[
    {
        "author": "w1na",
        "body": "She did a good job, no one could even imagine even 5 years ago where AMD would be today.\nWhen she took office, the cupboard were bare, there was no sales, no good architecture, losing for 2 decade to intel. Since the first athlon x64, they kept releasing bad products most of the time. In just 3 years, she made AMD go from Zero to Hero!\n\nAMD now trading at tremendous numbers, no one thought would be possible ever. Heck just look 7 years back, the share price was about 2 bucks.\n\nIf there is any CEO who you feel should earn so much, it’s not people from Moderna, but Lisa Su.\n\nJust to give you an idea, back in 2014 or so, I remember trying to buy AMD shares under 2 euros each (I wanted to get 2000 euro), before the order went through, it asked me for some paperwork confirmation, I then did not go through with the order and never did.\n\nMissed on 1000 shares from AMD. I did not believe back then, although I saw it was incredibly cheap.",
        "created_utc": 1591071652,
        "id": "fslovb3",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591100452.0
    },
    {
        "author": "kontekisuto",
        "body": "Linux recommends AMD over Intel, that's all I need to know.",
        "created_utc": 1591070661,
        "id": "fslncru",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591099461.0
    },
    {
        "author": "rasuzuki",
        "body": "She fucking deserves it tho, look at AMD! Just ass fucking Intel for 3 years straight",
        "created_utc": 1591066371,
        "id": "fslgasz",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591095171.0
    },
    {
        "author": "mechtech",
        "body": "Well this is /r/investing, so buy quality and hold, diversify (beyond just bonds which may or may not have a good future in a zero rate world), and have worldwide exposure/don't arbitrarily lock yourself to your own country.\n\nI actively trade, but in all likelihood in 2040 the investors at the top will likely have stories like \"As Waymo got bigger, my ETF kept buying more, and now Waymo is 10 trillion dollars. And as that Chinese electric car company grew and took 1/3 of the 1 billion person Chinese market, my ETF kept buying more on the way up.\"\n\nAlthough in that same vein, getting ahead of the tech curve might be one of the few ways for someone outside of the professional investor/institutional world to realistically get ahead. The trick is having the fortitude to hold for 1-2 decades. The financial crisis in '08 blew me out of so many hilariously good positions, like SBAC because the iPhone was just invented and 3G means more cell phone towers... It's not always rocket science. Anyone with some specialized insight into the future, whatever it may be, should consider putting a small well thought out speculative position on and leave it be. Small enough to not hurt if it goes nowhere, but big enough to care enough to check up and manage every few months.\n\nWow, just looked up an email from over 10 years ago. These names are probably in the mainstream investing language now, but wow... 10-100x if they were held. And it wasn't complex quant investing or anything, just looking ahead, positioning, and waiting.\n\nQuotes from the email circa 10 years ago: \"NVDA... They are also making a leap into scientific computing, where there's a lot of money to be made. They're the first major player to enter that arena to fight Intel and AMD in a long time, and their architecture is much more suited to scientific computing than the traditional CPUs that currently rule the top 100 supercomputer list. I think I'll see how that works out before selling NVDA\"\n\n\"I might want to put some money in AMD as well. They're here to stay and may still be undervalued...\"\n\n\"Universal Display Corp and LG Display (PANL/LPL) are also the leaders and partners in OLED screen development, which is bound to catch on eventually. Lower power use and much better image quality mean that it's just a matter of time before more devices adopt this new display technology and it becomes a new standard. I actually expect Apple to eventually partner up with LG (I think LG is their main LCD supplier) and use and use an OLED display on either a new product or a new Iphone version, which will kick OLED production into overdrive.\"\n\nFood for thought... MicroLED is likely going to grow 1000x over the coming decades. AR and LIDAR sensors for AR will probably not just be used for face unlock and will get some killer apps, the next Snapchat or TikTok might be AR based. Self-Driving is going to be powered by thousands of companies, not just NVIDIA and Waymo. Quantum computing? AI providers in the military contracting space? Clean cargo ship tech to get in front of green regulations? It's endless, and so many people know about these little niches of information that very few others do. Even mundane spaces see world changing innovation every day. Getting in front of a curve is inherently speculative but it is also entertaining, educational to follow through development, and can be extremely profitable.\n\nThat's my appeal for pulling a few pennies out of the ETF pile and doing some a little different, especially if you have a \"wheelhouse\" that you know a little bit more about.",
        "created_utc": 1591160039,
        "id": "fsprhaz",
        "score": 9,
        "subreddit": "investing",
        "created": 1591188839.0
    },
    {
        "author": "WSBankrupt",
        "body": "5G is going to be pushed hard.  I've done a fair bit of research on tickers that are worthwhile if it blows up as much as I think it will.  The implementation of these mesh networks could be huge for many companies.\n\nNetwork Implementation - NOK and ERIC (Would grab NOK asap)\n\nBase Station Chipsets - MRVL\n\nPhone Semis - QCOM\n\nIndustrial + Vehicle Semis - NXPI\n\nShared Comms Infrastructure - AMT\n\nMulti Discipline - INTC\n\n&amp;#x200B;\n\nI hold positions (leaps or stonks in almost all of the above)",
        "created_utc": 1591055320,
        "id": "fskwp03",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591084120.0
    },
    {
        "author": "TheMailmanic",
        "body": "I can't believe it.  I used to exclusively buy AMD computers back in the 90s because fuck Intel.   Then Intel pulled ahead and it looked like AMD was going down the drain.  Can't believe I lost my faith",
        "created_utc": 1591071010,
        "id": "fslnw2y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591099810.0
    },
    {
        "author": "necrophrenic",
        "body": "Looks like INTC is gonna ride back up if AMD does, so I approve this message.",
        "created_utc": 1591117830,
        "id": "fsnjanh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591146630.0
    },
    {
        "author": "TripleBrain",
        "body": "Now why the fuck exactly would any company that’s not the size of intel, Apple, ibm etc need 150 hosts??? You know the point of a host right? It’s to host a meeting. You really think anyone will need to host 150 meetings in the same time frame? Hell no.\n\nAnd aside from that, you know these are not gonna be large companies because they won’t be categorizing it as “companies with 10+” employees. That’s like using inches to measure a mile. \nI’d bet a majority of those companies have under 10 hosts.",
        "created_utc": 1591158971,
        "id": "fsppy0c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591187771.0
    },
    {
        "author": "p_giggles",
        "body": "I'd say that because companies which are heavily shorted are often smaller companies, there isn't a lot of other (non-financial) recognition. So if people can't find much besides a \"short the shit out of this company\" report, it might be more important for management to attempt to keep the stock afloat, whether it's in their own self interest or not.\n\nIf you try to short Intel it's a bit of a different story considering there are 40 analysts covering it and an ungodly amount of brand recognition. If one analyst comes out with a short and 39 say Intel is fine, it's unlikely the short piece actually does anything. But if you have three analysts covering you, which is very common for small-cap companies, one short piece can actually fuck your shit up. \n\nAlso since companies often use their equity as collateral for a loan, the higher stock price could afford more reasonable loan terms, which could help the company's actual business.",
        "created_utc": 1591061591,
        "id": "fsl7zvc",
        "score": 2,
        "subreddit": "SecurityAnalysis",
        "created": 1591090391.0
    },
    {
        "author": "peon72",
        "body": "ARM is the Linux of the CPU world. The plebs out here thinking that Intel and AMD are a big deal meanwhile literally every machine that isn't a desktop computer is running an ARM processor.",
        "created_utc": 1591126729,
        "id": "fso28ck",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591155529.0
    },
    {
        "author": "BF5lagsssss",
        "body": "AMD greatest ever. Their semiconductor business is excellent they beat Intel. For one stage Intel dominated 70 percent of the processor market and now the Ryzen processors have basically contributed to more sales tha Intel. Now AMD is now a dominant player due to the popularity of the Ryzen and maybe the Radeon GPU.",
        "created_utc": 1591072682,
        "id": "fslqeqf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591101482.0
    },
    {
        "author": "somanychins",
        "body": "Can anyone explain INTC to me? They trade at a multiple of 12 with a 2% div yield, meanwhile almost everything is 24+ in tech. I know they're mature and have competition, but what gives?",
        "created_utc": 1591028003,
        "id": "fsjdqb9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591056803.0
    },
    {
        "author": "Lil_Musket",
        "body": "Thats the relationship amd and intel have. Its always been a constant battle. I can't remember the exact details but intel has used shady political tactics to dick down amd before",
        "created_utc": 1591085669,
        "id": "fsm6spf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591114469.0
    },
    {
        "author": "ThroneTrader",
        "body": "What? 20 years? You're just gonna gloss over the athlon xp and athlon 64? Those were chips that kicked Intel's ass I'm the desktop space, especially as Intel tried to milk the netburst architecture for every Hz it could give them. That was early 2000s. \n\nIt wasn't till Intel rolled out the core 2 duo that they took back the crown.",
        "created_utc": 1591082231,
        "id": "fsm2ymc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591111031.0
    },
    {
        "author": "A_Simple_Simpleton",
        "body": "Well it's believable cause amd was truly a big pile of doodoo. I bought amd cause I was a poor high schooler but it was obviously under performing Intel",
        "created_utc": 1591102377,
        "id": "fsmpmaa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591131177.0
    },
    {
        "author": "boon4376",
        "body": "When Jim Keller goes to work somewhere, you know that in 2-3 years that company will be cranking out new game changing products. Apple / AMD / Tesla.\n\nJim joined Intel in 2018 after leaving Tesla. Presumably to help Intel get their shit together. I'd anticipate we'll see Intel come roaring back starting in 2021.\n\nJim coordinates chip makers into a well oiled machine. \n\nHopefully AMD's architecture and practices that Jim left in place have legs to keep up with whatever Intel develops.",
        "created_utc": 1591103731,
        "id": "fsmrq4a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591132531.0
    },
    {
        "author": "somanychins",
        "body": "I have Stockholm syndrome with INTC, I just can't stop buying it, and it just keeps abusing me.",
        "created_utc": 1591117304,
        "id": "fsni6p8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591146104.0
    },
    {
        "author": "GamblingMikkee",
        "body": "XOM, MMM, RTX, MCD, FDX, INTC, CVX, CVS, MO",
        "created_utc": 1591179733,
        "id": "fsqelfi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591208533.0
    },
    {
        "author": "rp_whybother",
        "body": "Pentium IV was a dog. Intel really lost it with that. worse performance then P3. Things only came good with core 2. I remember working on quite a few P IV and just thinking what's going on here, so slow.",
        "created_utc": 1591100715,
        "id": "fsmn8jh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591129515.0
    },
    {
        "author": "somanychins",
        "body": "BABA, EWH, INTC, PFE, TWTR long calls\nMSFT, BRKB, CVX, EURN, FDX, EWH, INTC, LAZ, PEP, PFE, PTON, UPS, XOM shares\nMSFT short calls",
        "created_utc": 1591128122,
        "id": "fso59is",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156922.0
    },
    {
        "author": "gaysaucemage",
        "body": "AMD has been kicking their ass for about 2 years while Intel has been stuck on 14nm process since 2014.",
        "created_utc": 1591028325,
        "id": "fsjedd6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591057125.0
    },
    {
        "author": "cranial_pudding",
        "body": "I think there's money to be made on INTC short term, there's some weird call activity all the way up to 70, I just wouldn't expect it to meme out like some of these other tech stocks\n\nIf you're playing in this sector right now, QCOM has some wild activity on 85c 6/12",
        "created_utc": 1591028595,
        "id": "fsjewrx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591057395.0
    },
    {
        "author": "JimC29",
        "body": "EPD since 04. INTC since 09. MO since last year. PM since November of 18. With dividends I'm  about even on PM and  on MO. They were both limit orders I had for a while I never expected to get that low.",
        "created_utc": 1591041714,
        "id": "fsk607u",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1591070514.0
    },
    {
        "author": "nemoTheKid",
        "body": "&gt; Now why the fuck exactly would any company that’s not the size of intel, Apple, ibm etc need 150 hosts??? \n\nThere are plenty of enterprise SaaS companies that have more than 150 sales people that aren't anywhere near the size of IBM, much less Apple. If every sales guy can host a Zoom call to talk to a prospective client, that's a host right there.\n\nWhy would you assume Zoom hosts are only for people internal to the company?",
        "created_utc": 1591166544,
        "id": "fsq016a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591195344.0
    },
    {
        "author": "jxxc7",
        "body": "Intel",
        "created_utc": 1591124398,
        "id": "fsnx9wc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591153198.0
    },
    {
        "author": "reddituseranyonymous",
        "body": "Im stuck at work...everything 2002. AMGN, INTC GE\n\nRegret not buyjng\nSBUX circa 1996\nAcre with 100ft of shore on a SW Florida barrier island near Ft Myers $5000 Fall 1999",
        "created_utc": 1591125094,
        "id": "fsnyr2q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591153894.0
    },
    {
        "author": "necrophrenic",
        "body": "Intel dropping off a cliff too. Be nice to the chip makers this week pls.",
        "created_utc": 1591109275,
        "id": "fsn1p53",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591138075.0
    },
    {
        "author": "firefoxx04",
        "body": "&gt;Linux recommends AMD over Intel, that's all I need to know.\n\nYeah I bet you have not heard of cloud huh? Where important workloads run. Even Azure is mostly Linux.",
        "created_utc": 1591114014,
        "id": "fsnbbiv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591142814.0
    },
    {
        "author": "duckbill_principate",
        "body": "$62B are you fucking shitting me. Did we time travel to 1999?\n\n\nBA and 3M and UPS: 90\nBP and Blackrock and AXP: 83\nSNE and BUD: 80\nUN and CI and INTU: 75\nIntel: 72\nTrendy video conferencing: 62\n\n\nFucking hell.",
        "created_utc": 1591195842,
        "id": "fsr2ys8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591224642.0
    },
    {
        "author": "learningis1st",
        "body": "FXAIX - 24%\n\nCSIQ - 23%\n\nTSM - 6%\n\nGILD - 6%\n\nINTC - 4%\n\nCTXS - 2%\n\nSTX - 2%\n\nTER - 2%\n\nLOGM - 2%\n\nDBX - 2%\n\nABBV - 1%\n\n...",
        "created_utc": 1591081909,
        "id": "fsm2l4k",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591110709.0
    },
    {
        "author": "cranial_pudding",
        "body": "That makes sense, INTC has some unusual call activity too but nothing like QCOM",
        "created_utc": 1591026364,
        "id": "fsjagae",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055164.0
    },
    {
        "author": "Chucklate-LeClaire",
        "body": "Their new budget chip line + high end consumer is going to decimate Intel this cycle",
        "created_utc": 1591098252,
        "id": "fsmk2hp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591127052.0
    },
    {
        "author": "krische",
        "body": "&gt; It wasn't till Intel rolled out the core 2 duo that they took back the crown.\n\nAnd that was based on a design they stole from the University of Wisconsin: https://www.engadget.com/2008-02-07-intel-sued-for-core-2-duo-patent-infringement-by-the-universi.html",
        "created_utc": 1591116422,
        "id": "fsngbtz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591145222.0
    },
    {
        "author": "ixamnis",
        "body": "HUM (Humana):  9.7 Equity Score Summary; Valuation Score: 95 (Undervalued); (S&amp;P Global Market Intelligence); short term outlook is weak (less than 6 weeks) but long term outlook is strong.\n\nSFM (Sprouts Farmer's Market): 9.5 Equity Score Summary; Valuation: 80 (Undervalued)\n\nSPGI (S &amp; P Global, Inc); 9.7 Equity Score Summary; Valuation: 82 (Undervalued)\n\nINTC (Intel Corp); 9.9 Equity Score Summary; Valuation: 94 (Undervalued)\n\nCPB (Campbell's Soup); 9.1 Equity Score; Valuation: 71 (Undervalued)\n\nThere are plenty of blue chips out there (and small and mid-cap stocks) that are still a good value, but they don't always get a lot of attention.\n\n&amp;#x200B;\n\n(All intel is from Fidelity; I own shares in SFM and INTC)",
        "created_utc": 1591105675,
        "id": "fsmuzny",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591134475.0
    },
    {
        "author": "Deus_ex69",
        "body": "I won't argue if she deserved it or not, but the fact is AMD still struggles making profit compared to Intel or Nvidia. Even Micron makes in two weeks more then AMD makes in a year and AMD market cap is bigger. Makes you wonder if AMD isn't heavily overvalued atm.",
        "created_utc": 1591129717,
        "id": "fso8out",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591158517.0
    },
    {
        "author": "damianwrx",
        "body": "Thanks for the excellent value Ryzen CPUs! Rocking one in my rig after using intel all my life",
        "created_utc": 1591131303,
        "id": "fsoc1uz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591160103.0
    },
    {
        "author": "azwel",
        "body": "i see they own  \n\n* Microsoft Corporation 18.51%\n* Apple Inc.\n* Visa Inc. Class A 4.15%\n* Intel Corporation 3.81%\n* Mastercard Incorporated Class A 3.51%\n* Cisco Systems, Inc.\n* Adobe Inc.\n* NVIDIA Corporation 2.48\n\nI Have a lot of those.  A couple like cisco  adobe, nvidia, i dont have.  I could either buy those few,  or just this etf..",
        "created_utc": 1591126310,
        "id": "fso1bpq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591155110.0
    },
    {
        "author": "Jay_x_Playboy",
        "body": "Intel just released their new stuff that crushes AMD’s current lineup. Not a great time to buy IMO",
        "created_utc": 1591178728,
        "id": "fsqdipk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591207528.0
    },
    {
        "author": "Bwesson",
        "body": "Semi conductors ETF like SMH and SOXX hold em all !! Qualcomm, Nvidia, Intel, AMD, etc.",
        "created_utc": 1591194556,
        "id": "fsr0ek0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591223356.0
    },
    {
        "author": "Shaun80",
        "body": "Some sectors are booming because of the pandemic and have huge growth potential when we emerge into our new normal post pandemic. This is especially true for technology allowing remote entertainment, medicine , commerce, payment and communication.  Netflix, E-commerce (Amazon,Shop) , Zoom video conferencing, cloud computing  (MSFT, Veev, Crm,fsly) , AI robotics (NVIDiA ,TSLA,TWLO, GOOG), 5G technology, semiconductors (AMD,TSM, QCOM, INTC) fintech (Square, Paypal, MA ,V), telemedicine (TDOC)   Brick and mortar retailers,oil , resources , REITs, financial sector will all take a hit when the economy opens to the new normal.",
        "created_utc": 1591154675,
        "id": "fspj7rc",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1591183475.0
    },
    {
        "author": "itachi12131415",
        "body": "I heard he lost it all and had to start working at a Dairy Queen.\n\nPoor guy.",
        "created_utc": 1591637832,
        "id": "fte0u4t",
        "score": 1423,
        "subreddit": "wallstreetbets",
        "created": 1591666632.0
    },
    {
        "author": "ofimmsl",
        "body": "Click the blue triangle on top of the ad. It lets you select a reason to not see those types of ads anymore. In your case you would select \"ive already purchased this product\"",
        "created_utc": 1591722547,
        "id": "fthssxy",
        "score": 1298,
        "subreddit": "wallstreetbets",
        "created": 1591751347.0
    },
    {
        "author": "Retard069",
        "body": "Retards like us, started to think they are smarter than Buffet. Yep, we've reached that level of stupid, so SPY400 it is :D\n\nEDIT: Thanks for all the likes and award. I honestly want to be an old dumb fuck as Buffet and loose a couple of billions on airlines.",
        "created_utc": 1591712929,
        "id": "fth96lo",
        "score": 1085,
        "subreddit": "wallstreetbets",
        "created": 1591741729.0
    },
    {
        "author": "hippiegodfather",
        "body": "I’m more the ‘fuck up for twenty years and fix it all in 5 minutes’ breed of retard.",
        "created_utc": 1591640507,
        "id": "fte68lz",
        "score": 972,
        "subreddit": "wallstreetbets",
        "created": 1591669307.0
    },
    {
        "author": "piggydancer",
        "body": "Billionaire investors also have a lot more to lose and a lot less to gain from taking large risks. That shouldn't be lost in the average retail investor. Investing with 1 billion should be different than investing with 10k. \n\nIt doesn't surprise me that he and other large investors who manage money for incredibly wealthy clients have a lower threshold for risk. They should. As long as they out pace inflation and don't spend more than they make, they can afford to live for life times. \n\nAverage investors need to grow their money. Wealthy investors need to protect theirs. Don't get caught up comparing yourself or following the path of someone with different goals.",
        "created_utc": 1591620187,
        "id": "ftd4bxs",
        "score": 866,
        "subreddit": "investing",
        "created": 1591648987.0
    },
    {
        "author": "sebach22",
        "body": "First ones free retard, try again and see how it works out",
        "created_utc": 1591629254,
        "id": "ftdjomp",
        "score": 788,
        "subreddit": "wallstreetbets",
        "created": 1591658054.0
    },
    {
        "author": "Kieran1664",
        "body": "Jokes on you, it costs $0 to pre-order a Nikola truck.\n\nPreordering 1000 trucks and buying calls 🤑/s",
        "created_utc": 1591686970,
        "id": "ftgd1uy",
        "score": 760,
        "subreddit": "wallstreetbets",
        "created": 1591715770.0
    },
    {
        "author": "NormalGap",
        "body": "I genuinely hope everyone in this sub hits it big.",
        "created_utc": 1591647556,
        "id": "ftekm1i",
        "score": 495,
        "subreddit": "wallstreetbets",
        "created": 1591676356.0
    },
    {
        "author": "Mousek801",
        "body": "Fuck it. Let him YOLO that Communion money.",
        "created_utc": 1591712705,
        "id": "fth8rfs",
        "score": 426,
        "subreddit": "wallstreetbets",
        "created": 1591741505.0
    },
    {
        "author": "Yankee_Fever",
        "body": "Nobody understands how scary it is that a bunch of people getting free money, with a 3rd grade reading level, and never read a single book on investing, can just gamble a company back into existence.\n\nIt's scary because the entire market is going to fucking implode. It's all Fugazi",
        "created_utc": 1591812581,
        "id": "ftlwudj",
        "score": 372,
        "subreddit": "wallstreetbets",
        "created": 1591841381.0
    },
    {
        "author": "shawnsblog",
        "body": "My wife saw I was negative today and asked what you do about it.\n\nTold her you wait for tomorrow and hope it's better.",
        "created_utc": 1591745264,
        "id": "ftj37tr",
        "score": 365,
        "subreddit": "wallstreetbets",
        "created": 1591774064.0
    },
    {
        "author": "DiY4Engi",
        "body": "3 Million... fucking retire already. all these material things dont matter anyway. travel and live a happy life for the rest of your life....ooooor you could sell some spreads to make it 1 million more",
        "created_utc": 1591813054,
        "id": "ftlxusf",
        "score": 357,
        "subreddit": "wallstreetbets",
        "created": 1591841854.0
    },
    {
        "author": "GlideOutside",
        "body": "Thanks, my wife’s bf told me to post it this way",
        "created_utc": 1591629258,
        "id": "ftdjovx",
        "score": 353,
        "subreddit": "wallstreetbets",
        "created": 1591658058.0
    },
    {
        "author": "moonshine_865",
        "body": "I knew it. \n\nFull 🌈",
        "created_utc": 1591753210,
        "id": "ftjh6dw",
        "score": 340,
        "subreddit": "wallstreetbets",
        "created": 1591782010.0
    },
    {
        "author": "13pts35sec",
        "body": "&gt; it just means you’re bogarting chromosomes\n\nI’m sorry but that was beautiful now if you don’t mind I’m going to steal this comment and use it as both the title and body for my upcoming Forbes piece",
        "created_utc": 1591756553,
        "id": "ftjmu78",
        "score": 335,
        "subreddit": "wallstreetbets",
        "created": 1591785353.0
    },
    {
        "author": "HinduHamma",
        "body": "Uncharted territory my fucking ass. \n\nAll the sp500 has ever done is make new ATHs time after time , crash after crash. This time is not any different. This is normal. The speed at which it is recovering is also normal because every market participant knows the story of past US recessions and economic downturn - they know if you sell your holdings, you’ll regret it down the road. So what’s the point of selling right now if your actually investing for years, decades? None. Especially when it’s super easy to get a loan for rock bottom rates, cash is very accessible for all the big boy investors and institutions. \n\nEveryone constantly downvoted bulls in March for even thinking that a V shape market recovery was gonna happen, for ever thinking we were gonna see ATHs again this year. Don’t worry I haven’t forgotten. There’s a lot of remind me bot posts I got coming due soon from March . \n\nOnce again bears, hold this L . Scoreboard don’t lie. You never win consistently. Keep being wrong and stay salty about this. I’m sorry you missed out on the greatest 50 day rally in stock market history. That’s gonna be a good story to tell your grand kids at least.",
        "created_utc": 1591648278,
        "id": "ftem3cj",
        "score": 267,
        "subreddit": "investing",
        "created": 1591677078.0
    },
    {
        "author": "confusedp",
        "body": "tsla above $1k nails it. At this rate, he should be building cars that lays gold for it to be worth that much. I declare this is peak EV bubble, but this balloon still has some stretching before it will burst.",
        "created_utc": 1591800298,
        "id": "ftl94ha",
        "score": 262,
        "subreddit": "wallstreetbets",
        "created": 1591829098.0
    },
    {
        "author": "Two_Pizzas_Each",
        "body": "I'm diving in but if it doesn't work out you owe me a beer",
        "created_utc": 1591660592,
        "id": "ftf9q6r",
        "score": 259,
        "subreddit": "pennystocks",
        "created": 1591689392.0
    },
    {
        "author": "pennyhardaway11",
        "body": "They’re just mad that their forecasts were wrong and the kids profited from it. Even tho the market will eventually fall.",
        "created_utc": 1591795021,
        "id": "ftkzdhi",
        "score": 256,
        "subreddit": "wallstreetbets",
        "created": 1591823821.0
    },
    {
        "author": "anik1993",
        "body": "We broke algos and unbankrupted companies 👏🏻 CNBC and Business Insider are more interested in WSB targets than Analyst ratings\n\nEdit: We might just end 2020 recession before it even started. Never doubt the power of WSB autists especially when they are jobless/working from home.",
        "created_utc": 1591713346,
        "id": "fth9yw9",
        "score": 239,
        "subreddit": "wallstreetbets",
        "created": 1591742146.0
    },
    {
        "author": "Flash_ina_pan",
        "body": "Robinhood traders are just Cthulhu in tights. Stealing from the rich and yoloing it into the void.",
        "created_utc": 1591760306,
        "id": "ftjt1x4",
        "score": 232,
        "subreddit": "wallstreetbets",
        "created": 1591789106.0
    },
    {
        "author": "Vote_CE",
        "body": "If it collapses everyone will rush in to buy.",
        "created_utc": 1591650440,
        "id": "fteqjbu",
        "score": 228,
        "subreddit": "investing",
        "created": 1591679240.0
    },
    {
        "author": "pathrowaway555",
        "body": "Damn people actually withdraw? I just assumed we all throw it back in to the next shit stock",
        "created_utc": 1591655067,
        "id": "ftezm6l",
        "score": 227,
        "subreddit": "pennystocks",
        "created": 1591683867.0
    },
    {
        "author": "itsmeboogaloo",
        "body": "If you have money to trade, this sub is invaluable. \nJust learn how to read momentum. \n\nHell, I had never even heard of NKLA. Saw 100 posts a minute here today, checked the chart  and made 12k in 6 minutes on it.\n\n$12,000. In 6 minutes. From reading a bunch of comments on Reddit. \n\nSeriously, that was dope guys. Thank you.",
        "created_utc": 1591661459,
        "id": "ftfba2j",
        "score": 226,
        "subreddit": "wallstreetbets",
        "created": 1591690259.0
    },
    {
        "author": "PeakOfTheMountain",
        "body": "Please make sure to post the follow up of her losing it all on options.",
        "created_utc": 1591735402,
        "id": "ftijv3n",
        "score": 226,
        "subreddit": "wallstreetbets",
        "created": 1591764202.0
    },
    {
        "author": "HandsomeTar",
        "body": "Made $40k in one day yesterday. Lost 80% of it today. AMA.",
        "created_utc": 1591735098,
        "id": "ftij8lq",
        "score": 221,
        "subreddit": "wallstreetbets",
        "created": 1591763898.0
    },
    {
        "author": "SolitaryEgg",
        "body": "Yo seriously though, when did everyone here get so sensitive? When I am wrong and lose money, people on here mock me, and I laugh. I post my positions so people can call me a retard when I get shit on. It's all part of the game, baby. And it's fun. It adds a bit of SPICE to the market day.\n\nBut when I am right and make some jokes at others' expenses, people get *really* mad. Like, really mad. I've had multiple people send me hate PMs, try to doxx me, tag me for days straight to yell at me, etc etc. Like, jesus. It's not like I fucking know you. I'm not *actually* attacking you, personally.\n\nI swear this sub didn't used to be this way. We used to laugh at retards, and the retards would laugh along. And, most importantly, all of us are the retards sometimes. But, now, good lord, people are so fucking defensive.\n\nIs it the /r/all influx or something?\n\nAnyway, I feel like people really shouldn't be here if they can't handle some pub-grade banter when they make a bad play. Shouldn't really even be trading.\n\nThank you for coming to my TEDx talk.",
        "created_utc": 1591820082,
        "id": "ftmcst8",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1591848882.0
    },
    {
        "author": "Captain_Loosearrow",
        "body": "That one dude just manhandling a fucking bear, I love it.",
        "created_utc": 1591656855,
        "id": "ftf2y3h",
        "score": 204,
        "subreddit": "wallstreetbets",
        "created": 1591685655.0
    },
    {
        "author": "legendariers",
        "body": "Must be the top. Back in 1929, right before the crash, a young girl wrote a letter to Standard Oil with $4 (or maybe it was $40) attached asking if they could invest the money for her. It ended up in the papers and sentimental readers funded a share for her to own. Then the stock market tanked.\n\nEDIT: It was $4. She was trying to invest in Standard Oil of New Jersey, which reached a high of $37.25. The share was finally purchased just a few days before Black Tuesday.",
        "created_utc": 1591713283,
        "id": "fth9uhv",
        "score": 197,
        "subreddit": "wallstreetbets",
        "created": 1591742083.0
    },
    {
        "author": "IrregardlessOfFeels",
        "body": "I personally have found it super easy to not murder any black people in my life. I don't really get it.",
        "created_utc": 1591207434,
        "id": "fsrrn1q",
        "score": 196,
        "subreddit": "wallstreetbets",
        "created": 1591236234.0
    },
    {
        "author": "mr77",
        "body": "If everyone is a genius in a bull market. What does it mean if you're losing money right now?",
        "created_utc": 1591810407,
        "id": "ftls1q0",
        "score": 194,
        "subreddit": "wallstreetbets",
        "created": 1591839207.0
    },
    {
        "author": "stejerd",
        "body": "It's funny when you see videos like this the people that are trying to stop the fight only make it worse by basically restricting the person they are grabbing giving the other guy free shots. Not to say this guy would have done any better unrestrained  but you see it all the time.",
        "created_utc": 1591714814,
        "id": "fthctm8",
        "score": 184,
        "subreddit": "wallstreetbets",
        "created": 1591743614.0
    },
    {
        "author": "etmhpe",
        "body": "I know how to do it.  Take my course and I can teach you",
        "created_utc": 1591322997,
        "id": "fsxgb98",
        "score": 180,
        "subreddit": "investing",
        "created": 1591351797.0
    },
    {
        "author": "vaythooiah1111",
        "body": "If we have another red day, it will take 90% of wsb out",
        "created_utc": 1591736357,
        "id": "ftiluea",
        "score": 177,
        "subreddit": "wallstreetbets",
        "created": 1591765157.0
    },
    {
        "author": "Gndossan",
        "body": "We all know how it ends. All the bulls with delusions of grandeur locked inside of pods dreaming of green markets while the world is in a permanent depression",
        "created_utc": 1591632770,
        "id": "ftdqlar",
        "score": 173,
        "subreddit": "wallstreetbets",
        "created": 1591661570.0
    },
    {
        "author": "ryan_dfs",
        "body": "If they cash out, great job. \n\nMost of them probably will develop some kind of irrational confidence about their trading skills and lose it all back. Just like gambling.",
        "created_utc": 1591722294,
        "id": "fths9sq",
        "score": 172,
        "subreddit": "investing",
        "created": 1591751094.0
    },
    {
        "author": "orxababa",
        "body": "Car payment is a cheap loan. Keep at it",
        "created_utc": 1591724839,
        "id": "fthxnem",
        "score": 169,
        "subreddit": "RobinHood",
        "created": 1591753639.0
    },
    {
        "author": "mikeylew92",
        "body": "I mean do your own research... If someone says don't or do something; look it up.  Don't take it at face value.  TF kinda logic is that",
        "created_utc": 1591647652,
        "id": "fteksz7",
        "score": 163,
        "subreddit": "stocks",
        "created": 1591676452.0
    },
    {
        "author": "dwdsquared2",
        "body": "**Events in the US Today (EDT):**\n\n* 6:00am - OPEC Meeting \\[2/3 Volatility\\]\n* 7:00am - MBA Home &amp; Mortgage Data \\[1/3 Volatility\\]\n* 8:30am - Core CPI (MoM-May) \\[3/3 Volatility\\]\n   * Core CPI (YoY-May) \\[2/3 Volatility\\]\n   * CPI (MoM-May) \\[2/3 Volatility\\]\n   * Real Earnings (MoM-May) \\[1/3 Volatility\\]\n* 9:30am - Seevol Cushing Oil Storage Report \\[2/3 Volatility\\]\n* 10:00am - The House Judiciary Committee will hold a hearing about police brutality\n   * The Senate convenes to resume work on a measure that would provide maintenance funding for national parks and other public land.\n   * Treasury Secretary Steven Mnuchin will testify before the Senate Small Business and Entrepreneurship Committee during a hearing about provisions of the CARES Act enacted to respond to the pandemic\n* 10:30am - Crude Oil Inventories \\[3/3 Volatility\\]\n* 11:00am - Cleveland CPI (MoM-May) \\[1/3 Volatility\\]\n* 12:00pm - Thomson Reuters IPSOS PCSI \\[2/3 Volatility\\]\n* 2:00pm - FOMC Statement \\[3/3 Volatility\\]\n   * FOMC Economic Projections \\[3/3 Volatility\\]\n      * The first since late last year.  March was skipped.\n   * Fed Interest Rate Decision \\[3/3 Volatility\\]\n   * Federal Budget Balance (May) \\[2/3 Volatility\\]\n   * Press Secretary Kayleigh McEnany holds a briefing\n* 2:30pm - FOMC Press Conference \\[3/3 Volatility\\]\n   *  [https://www.youtube.com/watch?v=ehI0wxxEilc](https://www.youtube.com/watch?v=ehI0wxxEilc)\n* Boosted by the May jobs report, GOP lawmakers are urging a slow approach to pass another coronavirus package as it becomes more and more unlikely that the Senate will consider a bill before the July 4 recess\n* MGM to open more Vegas casinos, including Mandalay Bay and Aria, by July 1\n\n**Events in the World Today (EDT):**\n\n* 9:00am - Brazil CPI (MoM&amp;YoY-May) \\[2/3 Volatility\\]\n* 9:30am - ECB's De Guindos Speaks \\[2/3 Volatility\\]\n* Bulgaria's parliament on Wednesday approved government plans to cut value added tax (VAT) on food provided by restaurants and catering services\n* AMC Entertainment said it expects to reopen its theaters globally in July\n* North Korea might be making millions, and breaking sanctions, selling sand\n* ECB prepares 'bad bank' plan for wave of coronavirus toxic debt - Reuters\n* North Korean leader's sister emerges as policymaker in spat with South Korea\n\n**Earnings Before Open:**\n\n* United Natural Foods\n* Graham\n* Chico's\n* Guess\n* Red Robin\n* Cheetah Mobile\n\n**Earnings After Close:**\n\n* Neptune Wellness Solns, Inc.\n* Sartorius\n* Oxford Industries, Inc.",
        "created_utc": 1591787109,
        "id": "ftkoec9",
        "score": 163,
        "subreddit": "wallstreetbets",
        "created": 1591815909.0
    },
    {
        "author": "MadNhater",
        "body": "Waited all last week for a dip to buy and it never happened. I fomo’d into calls yesterday just in time to get fucked",
        "created_utc": 1591702552,
        "id": "ftgt02d",
        "score": 159,
        "subreddit": "wallstreetbets",
        "created": 1591731352.0
    },
    {
        "author": "Vegas1905",
        "body": "I do not know anything about the tech industry, but I imagine it also depends on the industry. Do you managers not know how to code or anything technical? I work in finance, and while my technical skills might be stronger than my boss', he could still do my job if he had to.",
        "created_utc": 1591809366,
        "id": "ftlpq2h",
        "score": 156,
        "subreddit": "investing",
        "created": 1591838166.0
    },
    {
        "author": "NerfJihad",
        "body": "Which will then make the front page, making it seem like these things are way more common than they are, leading to a false attribution.\n\nOr we're all geniuses and you're all invited to my yacht party!",
        "created_utc": 1591721372,
        "id": "fthqan7",
        "score": 151,
        "subreddit": "wallstreetbets",
        "created": 1591750172.0
    },
    {
        "author": "alanbakr22",
        "body": "if u really used reddit as a reliable source then you're REALLY lucky man. Happy to hear that it worked out well for you!",
        "created_utc": 1591718071,
        "id": "fthjcjo",
        "score": 151,
        "subreddit": "stocks",
        "created": 1591746871.0
    },
    {
        "author": "s0kuba",
        "body": "The market traded sideways for almost 15 years from 1998-2013 in nominal terms, and CD rates paid better than dividends for the entire period.  I am a long-term believer in the market but some people forget how long downward cycles can take.  I have 75% of my net worth in private equity which is illiquid so I'm heavily net-long regardless of whether I want to be or not.  But I still call it like I see it and this market is starting to feel irrationally exuberant, especially given the tax changes on the horizon which knock out a meaningful % of EPS all by themselves.",
        "created_utc": 1591650352,
        "id": "fteqcwv",
        "score": 151,
        "subreddit": "investing",
        "created": 1591679152.0
    },
    {
        "author": "notapropriate",
        "body": "*Airlines*\n\nRobinhood boys: it literally cannot go tits up 😎\n\nBuffet: I’ll sell at bottom 🧠",
        "created_utc": 1591812156,
        "id": "ftlvxek",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1591840956.0
    },
    {
        "author": "htr_xorth",
        "body": "Learn to be ok with not capitalizing on every stock you research.  I have refused to buy Tesla since $400 and I keep it on my watch list just as a test to my stock guidelines. Get used to fomo, embrace it as an unhealthy but normal feeling.  Just as people rush to buy lottery tickets as the prize pool grows.\n\nI won't buy Tesla because it's too expensive.  I like Tesla.  I like Elon.  I want Tesla to succeed.  I'm happy for those who are bought in.   I feel the fomo, but I ignore it, I'm not going to buy a speculative stock for $900+, I'm just not.",
        "created_utc": 1591816907,
        "id": "ftm63e5",
        "score": 144,
        "subreddit": "stocks",
        "created": 1591845707.0
    },
    {
        "author": "Khashoggis-Thumbs",
        "body": "Also it is stunning survivor bias. This sub is full of gay bears with gaping arseholes rubbed raw by the collossal green dildo of JPowni MC who used their puts as lube. And showed them how worthless they were.\n\nIt also happens to be full of bulls who said \"printer go brrr\" and stumbled cock first into a money orgy.\n\nNobody caught what the world's greatest investors missed. The sub is just big enough to have people on either side so someone is posting gains while another posts losses.\n\nCan wsbtards do it consistently? They can if it refers to gambling away yesterday's winnings.",
        "created_utc": 1591719877,
        "id": "fthn3z4",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1591748677.0
    },
    {
        "author": "MasterCookSwag",
        "body": "I think something that everyone here should keep in mind is that this sub has damn near doubled in the last year and a half.  It's traffic more than doubled over the last three months.  Most of the commenters here are extremely new to markets and investing - they may be extremely confident in expressing their \"analysis\" but it doesn't change the fact that the overwhelming tide of thought here is coming from an extremely novice place.  The voting system only amplifies that.\n\nI mean this genuinely when I say in the last three months almost every top comment in every front page thread has been either an outright wrong take or a very very surface level platitude.\n\nYou've probably seen this a lot but many of us repeat often that the stock market is not the economy.  When you see this sub push the rhetoric that the stock market right now has to be irrational because it isn't highly correlated with present day macro conditions you should take that as indicative of the broad inexperience present here rather than any sort of useful analysis of markets.  Your article puts figures to something a lot of us regulars have tried to tell people - the stock market is not the economy and it behaving out of lockstep with present day macro conditions is neither new nor unexpected.",
        "created_utc": 1591795524,
        "id": "ftl07sj",
        "score": 142,
        "subreddit": "investing",
        "created": 1591824324.0
    },
    {
        "author": "namsilat",
        "body": "Fuck the formatting, we'll do it live.",
        "created_utc": 1591681112,
        "id": "ftg6b98",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1591709912.0
    },
    {
        "author": "seattle_exile",
        "body": "There are a few things going on here, which I find fascinating.\n\n1. RH users and the meme team at WSB are fucking up the narrative. \n2. This whole market defies logic, but they take issue with it defying *their* logic.\n3. They fail to understand that the world Boomers have left Millennials is one where it takes significant risk to get anywhere close to where they did at the same age. YOLO indeed, and there are no $20/hr union jobs straight out of high school anymore.\n\nPeople here say that RH and other retail investors don't have the weight to move markets. I'm not so sure about that. HTZ should be 0, but it goes flying off the shelves. I suspect MMs and their algos then pick up the movement, and start picking up the stock as well.",
        "created_utc": 1591798331,
        "id": "ftl5a5z",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1591827131.0
    },
    {
        "author": "Vector3DX",
        "body": "&gt; Imagine if I held..\n\nIf you keep thinking like that you will lose it all in future trades. Profit is profit",
        "created_utc": 1591820190,
        "id": "ftmd0w3",
        "score": 139,
        "subreddit": "wallstreetbets",
        "created": 1591848990.0
    },
    {
        "author": "Nitemare32",
        "body": "There was a reply to a post in this sub once, it read “How can we have insider knowledge when we don’t have any knowledge?”, always stuck with me lol",
        "created_utc": 1591734338,
        "id": "ftihnlf",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1591763138.0
    },
    {
        "author": "tukatu0",
        "body": "Not instantly if it did. It probably had a concussion at least and a brain hemmorage at worst",
        "created_utc": 1591677635,
        "id": "ftg1szc",
        "score": 137,
        "subreddit": "wallstreetbets",
        "created": 1591706435.0
    },
    {
        "author": "Sooon99",
        "body": "It means literally nothing. He’s been selling his shares as his options are exercised for at least the last 9 years.\n\nhttp://www1.insider-monitor.com/trader/cik1524316.html",
        "created_utc": 1591416680,
        "id": "ft21sip",
        "score": 137,
        "subreddit": "investing",
        "created": 1591445480.0
    },
    {
        "author": "one0sixpdem",
        "body": "I would consider Hertz much more of a symbol of irrationality. They literally filed for bankruptcy and the stock is up like 800%. \n\nAt least NKLA has a plan and industry investors behind it to push their semi-truck production forward.",
        "created_utc": 1591670828,
        "id": "ftfrhxk",
        "score": 137,
        "subreddit": "investing",
        "created": 1591699628.0
    },
    {
        "author": "Vegas1905",
        "body": "Makes sense. If you're in the office, it gives an illusion that you are doing work even if you are not doing any. Once you work from home, unless you are sending regular emails and work product, that same illusion does not exist. This has already happened at my company where several people who obviously were never working or doing the bare minimum can no longer hide behind the illusion and have now found themselves without a job.",
        "created_utc": 1591808000,
        "id": "ftlmp5d",
        "score": 137,
        "subreddit": "investing",
        "created": 1591836800.0
    },
    {
        "author": "LongLiveDetroit",
        "body": "Thought it was going be some feel good shit LOLL",
        "created_utc": 1591714568,
        "id": "fthcc5p",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1591743368.0
    },
    {
        "author": "JeveSt0bs",
        "body": "Tell them to spread it on toast.",
        "created_utc": 1591741087,
        "id": "ftivc10",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1591769887.0
    },
    {
        "author": "BLACKdrew",
        "body": "So real talk for a second.\n\nThese past few weeks have been crazy. Seeing everyone make bank everyday while you're losing money would be a nightmare. If you're feeling like shit, bummed out, depressed, whatever, don't be afraid to reach out to someone. Mental health is no joke, especially when money that can change your life is involved. If you have someone to reach out to, do it, for your own sake.\n\nIf you need someone to speak with man to man I'm always down to talk and listen. I've dealt with mental health issues in the past so no judgement will be given.",
        "created_utc": 1591651464,
        "id": "ftesl46",
        "score": 131,
        "subreddit": "wallstreetbets",
        "created": 1591680264.0
    },
    {
        "author": "squidward_train",
        "body": "Investors always ask themselves, why was I a braindead retard for not following the Motley Fool's advice? Remember, we are the best investors on the planet. Anybody can do DD and risk calculations on investments using actual money, it takes geniuses to write enough articles on \"rare double down buy alerts\" to eventually get a few right. Motley Fool: pay us money to read what Yahoo Finance tells you for free.",
        "created_utc": 1591650896,
        "id": "ftergbs",
        "score": 130,
        "subreddit": "stocks",
        "created": 1591679696.0
    },
    {
        "author": "Power80770M",
        "body": "This is essentially it. I'm in my 30's and have a good job that I don't hate. What else am I going to do for the next couple of decades? $3M is indeed a ton of money, but in a couple of decades of not working, it's going to zero one way or the other.",
        "created_utc": 1591815409,
        "id": "ftm2x9s",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1591844209.0
    },
    {
        "author": "ThatOneRedditBro",
        "body": "I think this was the plan all along. Democrats wanted it in the stimulus and since they didn't get it, Trump can now legalize it giving him credit, winning potential black votes, or deny it and make republicans look really bad.\n\nThe art of the deal.",
        "created_utc": 1591469748,
        "id": "ft5xspb",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1591498548.0
    },
    {
        "author": "_MrPants_",
        "body": "This thing is going to be $5.10 in the morning. Book it.",
        "created_utc": 1591834330,
        "id": "ftn5dno",
        "score": 123,
        "subreddit": "pennystocks",
        "created": 1591863130.0
    },
    {
        "author": "VicarOfAstaldo",
        "body": "In broad description, the market as a whole crashed. And before quickly recovering by and large for a number of reasons, a lot of people clearly looked at major companies and industries and thought, “well clearly this will recover soon it can’t fail it’s too much of a part of our civilization” and that kind of cascaded all over. \n\nAnd to the point we’re at they weren’t wrong. It was a fairly obvious observation that most likely sure, companies like delta for example will most likely recover their stock value at some point. \n\nAnd so they dumped a big chunk of their money into that and saw massive profits. \n\nSeeing a 50% return on stocks consistently for two months time is not normal. \n\nAlmost always that is entirely the realm of luck and Id argue it’s the realm of luck borderline here. It’s normally essentially gambling. \n\nThe amount of posts I’ve seen commenting something like “it’s not much” with 150% returns is **insane**\n\nThat’s not how stats or money or whatever you want to call it work. \n\nSure if you are only investing $1000 that’s not a ton to many investors. But it doesn’t matter if you invested $3 it’s still a figure to be proud of. \n\nThe amount of people who suggest their essential doubling of their money “isn’t much” isn’t healthy. \n\nThat’s not normally how that works and the expectation  of anything near that over the next many years is going to breed the behavior of a gambler.",
        "created_utc": 1591669500,
        "id": "ftfp91h",
        "score": 122,
        "subreddit": "RobinHood",
        "created": 1591698300.0
    },
    {
        "author": "lubokkanev",
        "body": "I just wait for it to reach the top and then sell.",
        "created_utc": 1591807644,
        "id": "ftllzaf",
        "score": 120,
        "subreddit": "StockMarket",
        "created": 1591836444.0
    },
    {
        "author": "DerpDerp2020",
        "body": "Scholars maintain that it means a \"whale's vagina\"",
        "created_utc": 1591667230,
        "id": "ftfldd6",
        "score": 120,
        "subreddit": "wallstreetbets",
        "created": 1591696030.0
    },
    {
        "author": "Vince161",
        "body": "Yep, went all in on 15 885c 6/12, woke up to 26k in profit at open so I cashed out.  Then I put it back in on 21 945c 6/12 yesterday and woke up to this in the morning.  I still can’t believe it.",
        "created_utc": 1591846306,
        "id": "ftnqwh5",
        "score": 119,
        "subreddit": "RobinHood",
        "created": 1591875106.0
    },
    {
        "author": "BrunoRib",
        "body": "If the tits are already up, it can't go tits up",
        "created_utc": 1591808796,
        "id": "ftlogzl",
        "score": 119,
        "subreddit": "wallstreetbets",
        "created": 1591837596.0
    },
    {
        "author": "pretty_honest_guy",
        "body": "No shit. Like call it quits bubs and do something other than making money. \n\nBut, I’m sure he’ll go full Stephen Hawking and become a machine to live forever, but he won’t rely on Windows Me as an OS.",
        "created_utc": 1591643817,
        "id": "ftecxnz",
        "score": 118,
        "subreddit": "wallstreetbets",
        "created": 1591672617.0
    },
    {
        "author": "MigratingSwallow",
        "body": "Those were good times.  Buying Stellar and Ripple at .30 see them rip up above $1 , keep holding cause greed, then see it all tumble back down.  All happened in like a week, best high ever.",
        "created_utc": 1591718008,
        "id": "fthj7v9",
        "score": 118,
        "subreddit": "wallstreetbets",
        "created": 1591746808.0
    },
    {
        "author": "tlighta",
        "body": "The fact that you got 30 interviews indicates that it is pretty great.",
        "created_utc": 1591809712,
        "id": "ftlqhtq",
        "score": 116,
        "subreddit": "investing",
        "created": 1591838512.0
    },
    {
        "author": "MrStealYoBeef",
        "body": "Options are contracts.  They are not stocks, they are a contract stating that the holder has the right (the choice, or the *option*) to purchase/sell 100 shares of a specific stock at a specific price on a specific date.  Calls are for purchasing 100 shares on a later date, puts are for selling 100 shares on a later date.\n\nLet's say a stock, we'll call them AAAA for simplicity, is at $100 today.  If you were to buy 10 shares of this company, that would cost you $1000.  You would own 10 shares of that company for $1000 though.  If you instead buy options, you would likely be able to get a couple options instead for the same price.  Let's say that a $100 call on AAAA for next friday costs $5 per share, or $500 per contract.  For that same $1000, you could have 2 calls on AAAA.\n\nIn both scenarios, you're looking for the value of the stock to go up obviously.  If you have 10 shares and AAAA goes up one dollar, you gained 10 dollars.  If you have 2 calls (which is 200 shares worth of an option) and AAAA goes up by a dollar, those calls increase in value as well, although not quite as much, we'll say it increases by $0.50 per share.  That's still a lot.  Instead of making $10 from your $1000 investment, you made $100 instead.  It's not quite that simple though.\n\nCalls (and puts) have an expiration date.  If the call is expiring on the 12th (next Friday), then the value of the stock needs to be decently close or above the value stated in the contract, or the \"strike price\".  In our $100 AAAA calls, if the stock goes below $100 (especially on the Thursday), the value of the call will plummet.  And remember, since these are just contracts, you don't actually own anything with the money you spent.\n\nSince you also spent $5 per share in order to get the call, the value of AAAA needs to not only be above $100 on the 12th to be redeemed (nobody should ever execute a right to buy at a higher than market price, obviously, you'd just be throwing away money for no reason) but it needs to be above $105 in order to make a profit.  You had already paid $5 per share for the right to buy those shares later at $100 per share.\n\nNext, and here's what many people do in order to make their profit instead, *you do not have to hold your contracts.*  If you buy a call on Monday, you don't have to wait until it expires on Friday to make money.  If AAAA jumps to $120 on Tuesday, you could sell your 2 calls for likely $23-$24 per share.  That would turn a $1000 investment into $4600.  What a hell of a gain, right?  If you just had 10 shares, you'd have only made $200 on a 20% stock jump when people who are options trading just made a $3600 or a 460% return.\n\nLastly, the reason that so many people avoid them.  *Options can expire* ***worthless***.  If the stock drops to $95 on Tuesday, those calls are suddenly only $2 per share, you just lost $600.  If it drops again to $90 on Wednesday, those calls are suddenly less than $1 per share, you're at an $800+ loss.  If you had 10 shares, you'd have only lost $100.  On Friday if you still have those calls, if AAAA never hits $100, your calls will expire and you'll have lost the full $1000 investment with absolutely nothing to show for it.  That money is gone for good, no amount of wishful thinking is going to make it come back to you.\n\nPuts are the opposite of calls in a way, they're the right to sell 100 shares at a certain price.  You get a put when you believe the value of the stock is going to drop.  Let's say you have a $100 put on AAAA and the stock drops to $80 on Friday.  On Friday, you would purchase 100 shares of AAAA at market value ($80, or $8000 worth) and then immediately sell it to whoever wrote the contract for $100 per share, or $10000.  That's quite a profit right there too, you made money when a stock decreased in value.  You can't really do that with standard stock trading.  Puts do still come with the same risk as calls in the fact that they too can expire worthless if the value of the stock is above the strike price.  If you have a $100 put on AAAA and the value on Friday is $105, it would be absolutely stupid to purchase 100 shares at $105 to sell them immediately for $100.  Remember, these contracts give you the *option* to buy/sell at a certain price, it doesn't mean that you have to when they expire.\n\nI hope that helps!  If you've got more questions, I'd be happy to answer them to the best of my ability.",
        "created_utc": 1591493663,
        "id": "ft8558n",
        "score": 116,
        "subreddit": "RobinHood",
        "created": 1591522463.0
    },
    {
        "author": "Breezy_t",
        "body": "I totally didn't expect the last part, especially \"oh no the airplane house is empty but soon it will be full\" A+",
        "created_utc": 1591615881,
        "id": "ftcywoq",
        "score": 116,
        "subreddit": "wallstreetbets",
        "created": 1591644681.0
    },
    {
        "author": "werubim",
        "body": "I missed out on the march dip and I'm super depressed about it!! Gahhhhh",
        "created_utc": 1591648206,
        "id": "ftely21",
        "score": 115,
        "subreddit": "investing",
        "created": 1591677006.0
    },
    {
        "author": "oarabbus",
        "body": "&gt;Stocks are being manipulated beyond belief. \n\nThe counter argument is basically \"it's not manipulation when the Fed does it\".  A change in monetary policy isn't necessarily manipulation, it could be a new normal.",
        "created_utc": 1591657531,
        "id": "ftf47jh",
        "score": 115,
        "subreddit": "stocks",
        "created": 1591686331.0
    },
    {
        "author": "slipstream808",
        "body": "It is SOOO true.  Sudden influx of money  and the world is a better place.",
        "created_utc": 1591649114,
        "id": "ftent4m",
        "score": 114,
        "subreddit": "wallstreetbets",
        "created": 1591677914.0
    },
    {
        "author": "TakeMeArachne",
        "body": "Now show us what they looked like at open when it turned green\n\nEdit: wait lmao I'm retarded I saw all FAGMAN green and I assumted",
        "created_utc": 1591719486,
        "id": "fthmal3",
        "score": 114,
        "subreddit": "wallstreetbets",
        "created": 1591748286.0
    },
    {
        "author": "MedusaOblongGato",
        "body": "Everyone always replies \"first one's free\" and I'm over here like \"if you're doing it right they're all free\"",
        "created_utc": 1591635929,
        "id": "ftdwyhw",
        "score": 112,
        "subreddit": "wallstreetbets",
        "created": 1591664729.0
    },
    {
        "author": "pendragon31415",
        "body": "It was alleged that it was a fake bill, also that doesn't mean he was the one to make it or knew that it was fake.\n\nEdit: or that it was even fake",
        "created_utc": 1591128174,
        "id": "fso5dsb",
        "score": 108,
        "subreddit": "wallstreetbets",
        "created": 1591156974.0
    },
    {
        "author": "ThrowaWayneGretzky99",
        "body": "It produces Ted talks.",
        "created_utc": 1591689711,
        "id": "ftgfx5n",
        "score": 108,
        "subreddit": "wallstreetbets",
        "created": 1591718511.0
    },
    {
        "author": "centrist-5",
        "body": "You sound retarded. Welcome. Cash out or let it run. I couldnt give less of a shit",
        "created_utc": 1591825068,
        "id": "ftmnbwj",
        "score": 106,
        "subreddit": "wallstreetbets",
        "created": 1591853868.0
    },
    {
        "author": "Dvdpjr",
        "body": "Your comment killed me. Lost all your money and made it all back over the course of a week?? You absolutely belong here. Welcome to the Big League.",
        "created_utc": 1591655374,
        "id": "ftf06s6",
        "score": 105,
        "subreddit": "wallstreetbets",
        "created": 1591684174.0
    },
    {
        "author": "x2Arawnage",
        "body": "You will have the rights to the shares of the company that acquired your company. Did some of these before, structure is a bit different but it could be worth a lot.",
        "created_utc": 1591645170,
        "id": "ftefozl",
        "score": 105,
        "subreddit": "stocks",
        "created": 1591673970.0
    },
    {
        "author": "psytokine_storm",
        "body": "Dave Portnoy (of Barstool fame) has about $500k in options, which he learned about earlier this week. Direct quote from today's stream from his twitter:\n\n\"**I don't know what a call is**, but I bought it and I'm up $500k. I want to buy $2 million more of these calls\".\n\nThe top is in.",
        "created_utc": 1591301637,
        "id": "fswba2c",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1591330437.0
    },
    {
        "author": "LeoFireGod",
        "body": "No one ever accounted for the average person making under 50K to be making literally more money than they had before, with no sports to bet on, and no bars to go to. This is just pure full blown idiocy but its what we have learned to love.\n\n$0 trades didn't fully cause this, corona and such caused it along with the $0 trading",
        "created_utc": 1591805900,
        "id": "ftlj00z",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1591834700.0
    },
    {
        "author": "Cobbenik",
        "body": "I remember my first one. I made $4.8k. It was like taking candy from a baby. I thought everyone here was retarded for not getting free money. Couple days later I was bent over, pants down, with line of bulls waiting to get their turn.",
        "created_utc": 1591644585,
        "id": "fteehx1",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1591673385.0
    },
    {
        "author": "AtticusFigt",
        "body": "Ok if you want a tip the worst thing that can happen to a beginner is wild success. Be very careful about making assumptions about the market. It isn’t irrational right now. Good for you on your profits. I wish you luck but urge you caution.",
        "created_utc": 1591495516,
        "id": "ft889nt",
        "score": 104,
        "subreddit": "options",
        "created": 1591524316.0
    },
    {
        "author": "dino_74",
        "body": "I just broke up with my girlfriend (stocks/401K) at the end of March. We went through  a rough patch and it didn't seem like it was working out so I left. I've been following her on social media (/r/investing) since and it seems like she's rebounded and moved on. Here I am looking at our old pictures (portfolio) and wondering why I didn't stick it out. (´༎ຶ ͜ʖ ༎ຶ \\`)♡",
        "created_utc": 1591233886,
        "id": "fst9dfi",
        "score": 103,
        "subreddit": "investing",
        "created": 1591262686.0
    },
    {
        "author": "Fr33Flow",
        "body": "I remember when I was a kid, I found a cat stuck in a tree.  He kept meowing and meowing for someone to save him. I climbed the tree and it took 30 minutes to get him down. Instantly me at that cat had a bond. I must have knocked on 30 different doors trying to find his home. But without a collar,  finding his owners was impossible. After asking all over the neighborhood I brought the cat back home where I knew my father would be waiting, wondering where I was. So I walked inside holding the cat, my dad was sitting on the couch and we locked eyes. You’ll never believe what he said. He said: “Son, what the fuck are shares???”",
        "created_utc": 1591726581,
        "id": "fti1aq0",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1591755381.0
    },
    {
        "author": "inlighttrading",
        "body": "Well put! It's always refreshing to hear from the perspectives of learning traders who have *actually learned* something.\n\nFOMO is one of the most dangerous Fears of Trading. This can be FOMO in anticipation or FOMO in reflection. In both cases, you feel a negative emotional reaction to missing or potentially missing a big move.\n\nAs you know, negative emotions are very bad as a trader and can limit your Trading Vision - preventing you from seeing a much clearer move that fits within your own defined strategy and risk tolerance.\n\nThere is no such thing as \"missing out\" in the stock market. There are infinite opportunities presented to you every single second. So focus on that. Focus on the stream of infinite opportunities and how you can interpret and decipher this data stream to pluck out trades within your own strategy boundaries.\n\nStick to your rules, manage your emotions, and focus on what is right in front of you.\n\n**I'd love to hear some thoughts from other traders who very recently learned this lesson. What made you learn it? Was it a big trade that went wrong or a big trade you missed? I'd like to hear your story and your interpretation of the lesson you learned :)**",
        "created_utc": 1591713600,
        "id": "fthagc5",
        "score": 102,
        "subreddit": "stocks",
        "created": 1591742400.0
    },
    {
        "author": "JungAndReckless6",
        "body": "I think it’s purely the influx of new investors the last few months trying to find the next Amazon. After all, Tesla has only been profitable for 3 quarters, it at some point could be worth what Amazon is. I wouldn’t touch it at this price personally, but to each their own.",
        "created_utc": 1591799135,
        "id": "ftl6tn0",
        "score": 100,
        "subreddit": "investing",
        "created": 1591827935.0
    },
    {
        "author": "PaperShark0001",
        "body": "No, ur up 300%. Imagine if u held and it dropped. Congratulations",
        "created_utc": 1591819377,
        "id": "ftmbbve",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1591848177.0
    },
    {
        "author": "Hybridkg87",
        "body": "From what CNBC told me yesterday, as a Robinhood trader I am smarter then a Billionaire. This only furthers it.",
        "created_utc": 1591802992,
        "id": "ftldi13",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1591831792.0
    },
    {
        "author": "r4rthrowawaysoon",
        "body": "Why crop?  This gives it more gravitas.",
        "created_utc": 1591728219,
        "id": "fti4qga",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1591757019.0
    },
    {
        "author": "ez2remembercpl",
        "body": "This isn't about options it's about life.\n\nIn my 20s  I worked a lot of fun jobs with no pay, mostly in the bar industry. By my early 30s I needed to get out and actually have a positive net worth, and sunk my life into one more bar (so fucking cliche', like a heist movie). It bombed.\n\n***At 35 I was in debt, had no job, and was living in the spare bedroom of a friend in a room with no furniture besides a mattress.*** I also went online for dating (read: sex) and met a fabulous woman who turned my life around. We've been together for 15 years, I got an MBA and started making real money, and now I have actual investments, I'm semi-retired, and I have a great wife.\n\nYou can \\*ALWAYS\\* start over and succeed. My dad's girlfriend (yes, a 90 year old MF is a player) had stage 4 cancer in 2014 and a 6 months prognosis. She's the one who drives his half-blind ass around town because she's in pretty good shape to this day.\n\nThere is always hope until the last day.",
        "created_utc": 1591829623,
        "id": "ftmwftd",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1591858423.0
    },
    {
        "author": "justafreesheep",
        "body": "Everything works until it doesn't, and everyone is right until they're wrong. Anyone who is sure of the direction the market will take over the next few months is retarded. This market has shown zero logic or rationale, it has made no sense, and will continue to evade anyone's crystal ball. Admit you know nothing more than anyone else, not even J pow does. If you're right, it's luck, just the same as if you're wrong.",
        "created_utc": 1591843681,
        "id": "ftnmf0t",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1591872481.0
    },
    {
        "author": "B1GBoiBets",
        "body": "The debate is not whether we’re in a bubble, it’s when is it going to burst",
        "created_utc": 1591650826,
        "id": "fterb80",
        "score": 98,
        "subreddit": "investing",
        "created": 1591679626.0
    },
    {
        "author": "Sovereign_Mind",
        "body": "Youre fucking retarded buddy. I work for this company and its been a sinking ship since 2016. It is not going to jump 300% their sales are at an all time low and there were THOUSANDS AND THOUSANDS of cancellations due to covid.\n\nKeep dreaming.\n\nJoseph abboud was the only brand they owned that was actually worth a fuck. The other brands they own are complete garbage. You literally have given zero reason as to why the stock will rise 300% besides that they are declaring bankruptcy which I will not speak on.\n\nDo not get your hopes up. This will not happen.",
        "created_utc": 1591676227,
        "id": "ftfzuh4",
        "score": 98,
        "subreddit": "pennystocks",
        "created": 1591705027.0
    },
    {
        "author": "Agitated-Bike",
        "body": "lol its an obvious play given the logic this market follows. JUst someone has to have the balls, capital and risk tolerance to play it; he did. we didn't.",
        "created_utc": 1591313081,
        "id": "fswynki",
        "score": 96,
        "subreddit": "wallstreetbets",
        "created": 1591341881.0
    },
    {
        "author": "BlazinBoy",
        "body": "The view count was a nice touch, too bad you didn’t align it tardo",
        "created_utc": 1591760087,
        "id": "ftjspha",
        "score": 96,
        "subreddit": "wallstreetbets",
        "created": 1591788887.0
    },
    {
        "author": "Haskie",
        "body": "Same! Made 2800 bucks on 4000 dollars of contracts over the past two days. Insane.\n\nThat leaves me at -98% for the year! I am absolutely Killing it right now.",
        "created_utc": 1591202527,
        "id": "fsrh0cm",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1591231327.0
    },
    {
        "author": "MacDaddyNeo",
        "body": "It actually makes perfect sense. If it tracks the top 500 companies and each company is worth at least $1, it should definitely be $500. Market is just really undervalued right now.",
        "created_utc": 1591207398,
        "id": "fsrrkc5",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1591236198.0
    },
    {
        "author": "SolitaryEgg",
        "body": "Honestly my worldview is shooketh.\n\nThe people who were calling stay-at-home orders government tyranny a week ago are now the ones praising curfews and cheering on the military flooding American streets.\n\n\nAnd, the ones who were on social media shaming people for going outside and spreading rona are now the ones crowding into mobs and pretending like the virus doesn't matter.\n\n\nLeft, right... Who gives a shit? It's like fucking no one, on either side, has a fucking ounce of sincerity or conviction anymore. We're all just a bunch of fucking ADD bitchboys shouting endlessly into the internet void, searching for a small dopamine hit, and getting stupider by the day.\n\n\nPuts on humanity.",
        "created_utc": 1591075873,
        "id": "fsluxog",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1591104673.0
    },
    {
        "author": "huy90_",
        "body": "This sub is so useless now.",
        "created_utc": 1591149657,
        "id": "fspaman",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1591178457.0
    },
    {
        "author": "bobstaman",
        "body": "Just a heads up to everyone. Don't make plays just to make a play. It's ok to weigh it out or just go with a different trade for now. Making a bad trade is worse than not making a trade.",
        "created_utc": 1591063542,
        "id": "fslbgms",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1591092342.0
    },
    {
        "author": "iLynx",
        "body": "While I am in GNUS, telling somebody to jump in now when it’s at its 52 week high is horrible advice.",
        "created_utc": 1591210873,
        "id": "fsrz61b",
        "score": 32,
        "subreddit": "pennystocks",
        "created": 1591239673.0
    },
    {
        "author": "HoosierPride",
        "body": "The whole country has 3 stars right now",
        "created_utc": 1591069487,
        "id": "fsllh4v",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1591098287.0
    },
    {
        "author": "xGOXSTRAPx",
        "body": "You can tell everyone is over leveraged when a -0.7% move is now a \"dump\"",
        "created_utc": 1591043426,
        "id": "fsk9ii6",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1591072226.0
    },
    {
        "author": "King_Tendie",
        "body": "&gt;*\"That leaves me at -98% for the year! I am absolutely Killing it right now.\"*\n\nThis hurts so bad the hurt is painful.",
        "created_utc": 1591202837,
        "id": "fsrho0c",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1591231637.0
    },
    {
        "author": "dog34421",
        "body": "Its pretty amazing how wsb went from 80% gay bears at the March bottom buying puts the DAY OF THE BOTTOM to 100% mindless bulls now buying calls and assuring other fucking idiots yes its the time to go all in long.",
        "created_utc": 1591048135,
        "id": "fskj2nf",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1591076935.0
    },
    {
        "author": "iluvairforcealotalot",
        "body": "Time to buy puts now, thanks",
        "created_utc": 1591035972,
        "id": "fsju358",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1591064772.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "Dude...  I've heard of more layoff and paycuts in the last week than I think I have ever...  With shit now reopen!\n\nThis is probably what the start of a depression looks like.\n\nSPY 345c",
        "created_utc": 1591132642,
        "id": "fsoeu73",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1591161442.0
    },
    {
        "author": "nightjar123",
        "body": "This post is now on the Reddit front page. So it will be taken down soon.",
        "created_utc": 1591140672,
        "id": "fsoukdk",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1591169472.0
    },
    {
        "author": "grubslam",
        "body": "My first moon stock! Got in for 5 shares at 3.85, now I have made almost $20! Now I am a professional thanks to r/pennystocks",
        "created_utc": 1591201840,
        "id": "fsrfjq3",
        "score": 25,
        "subreddit": "pennystocks",
        "created": 1591230640.0
    },
    {
        "author": "FecesVortex",
        "body": "r/pennystocks normally: \"Sell at 15% profit! Take your gains!\"\n\nr/pennystocks now: \"Anyone who sells is a piece of shit\"",
        "created_utc": 1591212413,
        "id": "fss2io9",
        "score": 25,
        "subreddit": "pennystocks",
        "created": 1591241213.0
    },
    {
        "author": "TheOri0",
        "body": "Yeah there is no motivation for savers right now....interest is terrible. Literally no other place to put your $ and add on to that everyone is stuck at home in front of their PCs.\n\nPerfect storm for a stupid illogical squeeze upward.",
        "created_utc": 1591058708,
        "id": "fsl2uex",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1591087508.0
    },
    {
        "author": "knicksAHgoat",
        "body": "DKNG\n\nupvote me now",
        "created_utc": 1591146248,
        "id": "fsp4mgt",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1591175048.0
    },
    {
        "author": "scopolamine",
        "body": "The Bull Case is now \"the Fed is completely insane.\"  It's not a bad case.",
        "created_utc": 1591043820,
        "id": "fskabfm",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1591072620.0
    },
    {
        "author": "the_heat_waver",
        "body": "That empty podium at the White House sums up our leadership right now.",
        "created_utc": 1591035080,
        "id": "fsjs7ob",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1591063880.0
    },
    {
        "author": "Cynikal818",
        "body": "I got banned from /news for posting a similar video to this one in the mega thread. Just posted the link, nothing else\n\nGot banned for racism. Idk how that even makes sense.\n\nThis website is such fucking trash now",
        "created_utc": 1591142137,
        "id": "fsox9of",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1591170937.0
    },
    {
        "author": "burrowed_greentext",
        "body": "In a world of instant gratification only now u can see who got caught up in the easy dopamine hits and is out of touch when easy dopamine goes away.\n\nChase happiness and cling to it with ur fucking last breath. Turn off the fuckin news and play that videogame u haven't played in a while. Call up that girl u like and write ur fuckin love story with the world as ur witness.\n\nU think those fucking Syrian children getting acid-bombed or those women in Iran getting mutilated and gang raped would give up and roll over in America rn?\n\nNah man fuck that shit. If ur sad because some shit is getting broken go watch fuckin Saving Private Ryan and watch all those fucking 18yo's get fucking obliterated the moment the boat doors opened up. That's some real disastrous, horrific shit worth being shell-shocked over, not some glass on the streets or cars on fire cuz some dudes be pissed that their skin color brings them absolute hell in this country sometimes.\n\nA whole bunch of poor, beaten-down-and-tossed-aside Americans are bearing their teeth. Fuck it if their methods suck ass that's still some bald-eagle ass spirit knowing any of these fuckin cops could end their lives in a heartbeat and they'd become another number and name on a sign.\n\nIf ur fuckin sad rn get the fuck off this sub, save some money, go take a fucking roadtrip tomorrow and see this beautiful nation for what it is, beyond whatever bullshit ass short term shit we in right now.",
        "created_utc": 1591070156,
        "id": "fslmk6o",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1591098956.0
    },
    {
        "author": "RyFba",
        "body": "That was his risk tolerance now quit with the dumbass questions",
        "created_utc": 1591128950,
        "id": "fso71wi",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1591157750.0
    },
    {
        "author": "PM_ME_YOUR_SUNSHINE",
        "body": "Its been literally said week after week now during this pandemic and nobody is getting it.\n\nThe American economy is so shitty and on such life support that the ONLY place to see ANY decent returns is gambling in the stock market. So that is what ANYONE with ANY money is doing, big players or small. And the more people playing, the higher the market goes.\n\nWho gives a shit if Uber's core business model is a sham if everyone owns their stock? WeWork only failed because their PR game was garbage and they couldn't control their figurehead. Put out a decent public image, attract some idiots with mainstream recognition and you too could be the next ZOOM buoying peoples' portfolios as the rest of the country goes to shit.",
        "created_utc": 1591156904,
        "id": "fspmri0",
        "score": 21,
        "subreddit": "investing",
        "created": 1591185704.0
    },
    {
        "author": "undergroundinvesting",
        "body": "Every single Healthcare/Biotech company: “we’re cooking up a cure right now”",
        "created_utc": 1591156198,
        "id": "fsplnl0",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1591184998.0
    },
    {
        "author": "10x_EBITDA",
        "body": "Remember in March when everything tanked because of covid after it had been ignored by a market that kept melting up for 2 months and everyone said “wow that was so obvious”.\n\nWell, we’re now seeing a repeat with tons of risks mounting. Yet nobody cares because “calls are free money” at the moment. Calls were free money in October-February too. And then they weren’t. \n\nIgnore the risks at your own peril",
        "created_utc": 1591153991,
        "id": "fspi2l5",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1591182791.0
    },
    {
        "author": "TheFourthSon",
        "body": "I have a real photo of gnus at $8.00. Available now for sale. $9.00 each.",
        "created_utc": 1591214527,
        "id": "fss73yj",
        "score": 20,
        "subreddit": "pennystocks",
        "created": 1591243327.0
    },
    {
        "author": "PaperShark0001",
        "body": "If this gets 5 downvotes, 5 upvotes, or an award i will go on my run 😤\n\nEdit: gonna go run now; went from a half marathon is ok to struggling to run a mile.\n\nYesterday was a mile, today is 1.5",
        "created_utc": 1591118832,
        "id": "fsnleye",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1591147632.0
    },
    {
        "author": "kokeboka",
        "body": "I used to work in a major music studio in London. The public perception of the worth of music has changed. Anyone can stream nearly anything for free or very cheap subscriptions. 30 years ago you had to spend 10-20 dollars to buy one album, nowadays that seems like an absurdity to the average consumer. Ease of access means there is now a panoply of genres and bands. Artists have bypassed large studios and large labels because technology now allows them to record at home with a little investment in equipment, self-publish and promote their work through sites like bandcamp, soundcloud and social media in general. Labels used to be the great gatekeepers and help fund recording sessions; that's not how the industry works anymore. I love music, but I don't think the future of the industry will be as profitable as it used to be, by a long shot.",
        "created_utc": 1591128854,
        "id": "fso6uiy",
        "score": 19,
        "subreddit": "stocks",
        "created": 1591157654.0
    },
    {
        "author": "VladdyGuerreroJr",
        "body": "So a reality TV star became president, and is now deploying the military to end unrest, while the worst pandemic in 100 year spreads around the world, and the economy contracts the most since the great depression.\n\nSo stocks closed green. Again.",
        "created_utc": 1591063451,
        "id": "fslbaye",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1591092251.0
    },
    {
        "author": "Trinity0519",
        "body": "Makes the decision easy for Trudeau now because there's no decision to make. The big 3 Telcos chose other companies on their own.",
        "created_utc": 1591121767,
        "id": "fsnrmn1",
        "score": 19,
        "subreddit": "CanadianInvestor",
        "created": 1591150567.0
    },
    {
        "author": "d4ng3rz0n3",
        "body": "Actually no, They expire in 17 days and there is now 399,692 open interest.",
        "created_utc": 1591144702,
        "id": "fsp1vle",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1591173502.0
    },
    {
        "author": "elld",
        "body": "Am I the only one who - once I've watched a porn scene and jerked off to it.... I refuse to ever jerk off to it again.\n\n\nI don't know why? It's like yeah I've shot my load to her on that scene, now it's useless shit to wank over. Do porn companies rely on people like me?",
        "created_utc": 1591077920,
        "id": "fslxn7f",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1591106720.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "I bet you are racist towards Chinese people now.",
        "created_utc": 1591128757,
        "id": "fso6n2q",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1591157557.0
    },
    {
        "author": "JoJoBabbit",
        "body": "Elon saying Tesla’s stock was too high and now it’s up near ATHs was a total power move",
        "created_utc": 1591155414,
        "id": "fspkeio",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1591184214.0
    },
    {
        "author": "orangehorton",
        "body": "they own a lot of record labels.. do you think record labels dont get money when we stream on spotify???\n\nand how is music on the decline? there are more artists now than ever before and  they are more easily accessible",
        "created_utc": 1591125601,
        "id": "fsnzteo",
        "score": 18,
        "subreddit": "stocks",
        "created": 1591154401.0
    },
    {
        "author": "ScaryPillow",
        "body": "Who cares about what the market price is right now? Remember you are buying parts of businesses. If Mr. Market comes to your door daily and says I'm selling X business for Y dollars. If it doesn't make sense to buy that business because it won't earn enough money for you, then you don't buy it. Who cares if Mr. Market keeps quoting you higher prices every day and laughs saying 'you should've bought yesterday'. If he's offering you a shit business at a shit price, then Mr. Market can go stuff himself.",
        "created_utc": 1591142008,
        "id": "fsox19b",
        "score": 18,
        "subreddit": "investing",
        "created": 1591170808.0
    },
    {
        "author": "racerxff",
        "body": "Every other stock on your watchlist, now that you have no available funds to trade with: \"NOOT NOOT\"",
        "created_utc": 1591055290,
        "id": "fskwmzi",
        "score": 17,
        "subreddit": "pennystocks",
        "created": 1591084090.0
    },
    {
        "author": "uniaintshit",
        "body": "When I bought bitcoin everyone laughed at me because I have a small dick, but whose laughing now?",
        "created_utc": 1591053895,
        "id": "fsku2os",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591082695.0
    },
    {
        "author": "ArsonDub",
        "body": "The virtue signalling going on ig right now is unreal",
        "created_utc": 1591112208,
        "id": "fsn7lc9",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591141008.0
    },
    {
        "author": "Greenman_on_LSD",
        "body": "This used to be a sub of autists. Now it's just retards.",
        "created_utc": 1591129994,
        "id": "fso99zw",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591158794.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "there is literally no benefit to anyone for the market to crash again. governments dont want markets to crash, fund managers dont want markets to crash, the fed doesnt want markets to crash, donnie man doesnt want the markets to crash, retail investors dont want the market to crash. literally no one wants the market to crash except gay fucking bears. why do gay fucking bears want the market to crash? *bEcAuSe tHe MaRkEt Is OvErVaLuEd* no bitch its cause you missed the dip and are now salty you missed the fucking dip and are too scared to buy in and now you want another dip. well bitch it wont happen, so stop being a big fucking pussy and just buy in and become a bull u fucks.",
        "created_utc": 1591161032,
        "id": "fspsvtu",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591189832.0
    },
    {
        "author": "buildapchelper",
        "body": "Unpopular opinion but there is no such thing as a peaceful protest right now. The instigators are lumped in with the peaceful folks and all it takes is 1 bad apple for the entire thing to turn south. That bad Apple ALWAYS happens.",
        "created_utc": 1591053357,
        "id": "fskt2gm",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591082157.0
    },
    {
        "author": "CyanideMuffins",
        "body": "Do you guys watch your trades all day? Or just set limit orders and go on with your day? I'm realizing that I'm just getting in the way of my own success by micromanaging my plays. I keep getting emotional, impulsive, and impatient. If I had just set my orders and paid less attention to the market over the past 2 months, I'd probably have 500% what I have now.",
        "created_utc": 1591217988,
        "id": "fssefjw",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1591246788.0
    },
    {
        "author": "eyefrica",
        "body": "Phewww I can finally go to the bathroom now",
        "created_utc": 1591214652,
        "id": "fss7dmd",
        "score": 16,
        "subreddit": "pennystocks",
        "created": 1591243452.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "The Stages of Reopening (update):\n\nWeek 0 - Excitement - \"OMG we're back!!\"\n\nWeek 1 - Euphoria - \"SPY 300+, I heard there's lines at some place!! V-shaped recovery!!\"\n\nWeek 2 - Realization - \"hindsight, lockdowns were stupid. Probably caused more harm than it prevented\"\n\nWeek 3 - Concern - \"okay the lines are shorter now, I participated in going out, it was meh.. it was slow and awkward, maybe it comes back?\"\n\n* Most of you are here (now with rioting)\n\nWeek 4 - Growing Concern - \"These places are empty... How are they going to make it on 25% capacity, assuming they're even seeing that? No one is getting rehired, in fact they'll probably need to let more go.\"\n\nWeek 5 - Full Bear - \"Okay, this is slower than I remember 2009 being. I don't think it's bouncing back. SPY levels totally not sustainable, WTF were we thinking!?!\"\n\nWeek 6 (**New**) - Joining the Poors - \"I thought my white collar job was safe, but the company is being more dick now than they were when we were under lockdown.  I think they retained people just to cultivate good PR during the crisis, but are ready to release employees\"",
        "created_utc": 1591043627,
        "id": "fsk9x64",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1591072427.0
    },
    {
        "author": "AveenoFresh",
        "body": "What autists are buying ZM shares right now?",
        "created_utc": 1591138947,
        "id": "fsoriu1",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1591167747.0
    },
    {
        "author": "RotMGMeliorus",
        "body": "People are looking for something other than GNUS, and this is an option right now. PR around the corner.",
        "created_utc": 1591205617,
        "id": "fsrnnmf",
        "score": 16,
        "subreddit": "pennystocks",
        "created": 1591234417.0
    },
    {
        "author": "ch1p_skylark",
        "body": "Protesters are gona pee their pants and go home now. I'm calling it.\n\nThe fun is over, bear gang going back on lockdown to stare at their -99% robinhood accounts.",
        "created_utc": 1591052285,
        "id": "fskr212",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591081085.0
    },
    {
        "author": "Sam_Handwich69420",
        "body": "Now we’re seeing all these companies putting out PSA’s against police brutality bc that’s what’s hot right now. I hate politics. SPY 315",
        "created_utc": 1591060708,
        "id": "fsl6eoe",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591089508.0
    },
    {
        "author": "w1na",
        "body": "She did a good job, no one could even imagine even 5 years ago where AMD would be today.\nWhen she took office, the cupboard were bare, there was no sales, no good architecture, losing for 2 decade to intel. Since the first athlon x64, they kept releasing bad products most of the time. In just 3 years, she made AMD go from Zero to Hero!\n\nAMD now trading at tremendous numbers, no one thought would be possible ever. Heck just look 7 years back, the share price was about 2 bucks.\n\nIf there is any CEO who you feel should earn so much, it’s not people from Moderna, but Lisa Su.\n\nJust to give you an idea, back in 2014 or so, I remember trying to buy AMD shares under 2 euros each (I wanted to get 2000 euro), before the order went through, it asked me for some paperwork confirmation, I then did not go through with the order and never did.\n\nMissed on 1000 shares from AMD. I did not believe back then, although I saw it was incredibly cheap.",
        "created_utc": 1591071652,
        "id": "fslovb3",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591100452.0
    },
    {
        "author": "BenjiWon",
        "body": "We sure haven't had a red day in a while... \\*tumbleweed rolls by\\* Should be coming any day now... \\*looks into the sunset as protfolio burns\\*",
        "created_utc": 1591047133,
        "id": "fskh2fj",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591075933.0
    },
    {
        "author": "PushaTeaTime",
        "body": "If youre selling now your brain is a smooth as a babys ass",
        "created_utc": 1591203390,
        "id": "fsriuhw",
        "score": 15,
        "subreddit": "pennystocks",
        "created": 1591232190.0
    },
    {
        "author": "orrangearrow",
        "body": "Listen. War is Bullish. And if we have war on our own soil, it's incredibly bullish. Weapons can be manufactured Monday and used on American citizens on Tuesday. The potential efficiency is incredible. Buy calls now or you'll always wonder what if.",
        "created_utc": 1591146492,
        "id": "fsp51np",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591175292.0
    },
    {
        "author": "mattyfinna",
        "body": "Initial investment was about 2% of my portfolio, now its over 25%",
        "created_utc": 1591131175,
        "id": "fsobs45",
        "score": 15,
        "subreddit": "StockMarket",
        "created": 1591159975.0
    },
    {
        "author": "zjz",
        "body": "sorry I just woke up, I'll moderate now",
        "created_utc": 1591208520,
        "id": "fsru0b1",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591237320.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "Lol. \n\nTeam members,\n\nI'm heartbroken about these protests \n\n\nNow I need everyone to give 18384848 percent. Hustle. No sleep. YOU ARE THE COMPANY\n\nhugs and kisses- chad",
        "created_utc": 1591067097,
        "id": "fslhis5",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591095897.0
    },
    {
        "author": "vinnyk407",
        "body": "Now that WSB is off of DKNG it’s going to blow up tomorrow lol.\n\nIt got 3 price target upgrades but went down for now. Still going to be interesting",
        "created_utc": 1591217095,
        "id": "fsscj7g",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591245895.0
    },
    {
        "author": "MmmDarkMeat",
        "body": "What would really calm down these protestors now is a capital gains tax suspension on assets bought between now and the end of the year.",
        "created_utc": 1591141573,
        "id": "fsow86b",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591170373.0
    },
    {
        "author": "murdock9108",
        "body": "Mooon ... Join now or regret later :D\n\n\nBrrrrr",
        "created_utc": 1591214102,
        "id": "fss66jf",
        "score": 15,
        "subreddit": "pennystocks",
        "created": 1591242902.0
    },
    {
        "author": "peppercupp",
        "body": "Heard a loud bang from the backyard, now there are a bunch of sirens. If I die, give my portfolio to haupt.",
        "created_utc": 1591053847,
        "id": "fsktzia",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591082647.0
    },
    {
        "author": "ClothedKing",
        "body": "Haha this is definitely what i will do from now on",
        "created_utc": 1591061325,
        "id": "fsl7ifv",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591090125.0
    },
    {
        "author": "smiling_stranger",
        "body": "I dont get it. I get taught to fight and rebel in school by our founding fathers, i buy the guns 🔫🔫, the flag🇺🇸🇺🇸🇺🇸, the home🏘️, pay my taxes, dont want cops killing me or you and now im unamerican? You taught me this. USA USA!\n\nSBWI DKNG🌝🌝🌝",
        "created_utc": 1591061844,
        "id": "fsl8g65",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591090644.0
    },
    {
        "author": "scohrdarkshadow",
        "body": "FUcking shit I'm so pissed right now. Just had a convo with my friend (who is up bigly on STONKS) where she said\n\n\"Do you know what the companies are. I just buy whatever ppl tell me. I just see the name and the recommendation and buy lol\" \n\n&amp;#x200B;\n\nMeanwhile I'm down $5k for the month\n\n[https://imgur.com/a/IbbYisw](https://imgur.com/a/IbbYisw)",
        "created_utc": 1591217913,
        "id": "fsse9sv",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591246713.0
    },
    {
        "author": "dephlepid",
        "body": "Yeah. This person is relying on second hand info and media. \n\nUber is NOT a self driving play, Uber has not said they need self-driving to profitable. Dara has said repeatedly that autonomous is a long way away and they don’t need nor expect to be leaders in this technology. The ride sharing business is profitable. Also, ATG is now financed via outside investors.",
        "created_utc": 1591128262,
        "id": "fso5kqa",
        "score": 14,
        "subreddit": "investing",
        "created": 1591157062.0
    },
    {
        "author": "The_Collector4",
        "body": "“I am going to stand up for my beliefs and delete Facebook! From now on I’m only using Instagram.”",
        "created_utc": 1591149038,
        "id": "fsp9jb5",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591177838.0
    },
    {
        "author": "bowman_54",
        "body": "Got a SPY 313C expiring in 20min. NOW THIS IS POD RACING",
        "created_utc": 1591213072,
        "id": "fss3y3p",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591241872.0
    },
    {
        "author": "DeliciouslyUnaware",
        "body": "Okay now replace Biden with Clinton and this is exactly how 2016 went",
        "created_utc": 1591034706,
        "id": "fsjrg0h",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591063506.0
    },
    {
        "author": "_Oboe_",
        "body": "China is 100% wanting him gone. I have a very close relation to a Chinese manufacturer who has kept me in the loop. They wanted him as president, now, they want him gone due to very high tariffs on goods that were low profit but high running (think cheap shit at Walmart). \n\nIndia and China are at each other’s throats. India will be very supportive of trump because they are going to benefit from that situation. China wants it how it used to be. \n\nWho knows how it plays out, but Reddit is going to be brainwashed into biden no matter what.",
        "created_utc": 1591211692,
        "id": "fss0y8i",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591240492.0
    },
    {
        "author": "psiguy686",
        "body": "It will only take a single -6% day to blow up 80% of the accounts in this sub right now.",
        "created_utc": 1591054695,
        "id": "fskvjr1",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591083495.0
    },
    {
        "author": "IronManKillsThanos",
        "body": "I was comparing inflation over the years and found some pretty depressing numbers. \n\nBrand new mustang was $3k in the 60s when minimum wage was $1. 3000 hours of work for a new car.\n\nNew mustang now starts at $35k and minimum wage is $7.25. 4800 hours of work now.\n\nYou don't want to know housing.",
        "created_utc": 1591070444,
        "id": "fsln0gb",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591099244.0
    },
    {
        "author": "galivet",
        "body": "A company splits its stock to increase liquidity.\n\nConsider Berkshire Hathaway, with a share price north of $250K. If a shareholder needs to liquidate enough stock to raise $100K, they can't do it without selling more than twice that value of BRK-A. So maybe they'll pick something else to sell instead that's more right-sized for the amount of money they need. Now consider an individual investor with \"only\" $100K to invest. That person can't buy even one share of BRK-A. In both cases, the high share price discouraged investors from trading the stock -- it inhibits liquidity. If BRK-A did a 3-for-1 stock split then those two investors could work out a trade with each other.\n\nThere are three reasons companies don't split stock:\n\n1. They feel it's prestigious to have a high per-share stock price.\n2. They prefer having lower liquidity because it causes the population of investors holding your shares to trend toward being wealthier and trading less frequently. That can provide greater stability for the stock price in normal times.\n3. Splitting the stock isn't free. It requires you to pay lawyers, publish notifications to shareholders, and so on. Companies prefer not to incur expenses without a clear payoff.\n\nEDIT: I guess I'll also explain why a company might like a more liquid stock. A more liquid stock will track more closely to its true market value. A low-liquidity stock can drop in price very sharply if it's hard for buyers to purchase it. Go back to that investor who needed to raise $100K. Now suppose that guy **ONLY** has BRK-A and he **HAS** to sell it. Because of the high share price, there's a smaller pool of investors who have the money to buy it from him. Desperate seller + small buyer pool means that seller can get screwed. Maybe in desperation he'll sell for $200K instead of the $250K+ the stock is worth... well then the market sees **ALL** of those shares as worth only $200K and the share price plummets. Now of course the price isn't really determined by what one guy does, but in a crisis a lot of sellers can find themselves in the same boat and it can happen.\n\nThis kind of liquidity problem is why the US Fed recently started buying up bond ETFs -- desperate sellers + small buyer pool would have put the price of those bonds through the floor *even though the bonds are actually still valuable* had the Fed not stepped in. Because the Fed has the money to buy anything, it can buy those bonds at a normal market price from anyone and let the price decline in a less terrifying way for everyone involved. When analysts talk about the Fed \"providing liquidity,\" this is what they mean.",
        "created_utc": 1591061657,
        "id": "fsl841m",
        "score": 14,
        "subreddit": "investing",
        "created": 1591090457.0
    },
    {
        "author": "the-faded-ferret",
        "body": "I posted a black square on my Instagram the riots can stop now I have cured racism",
        "created_utc": 1591135675,
        "id": "fsol30m",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591164475.0
    },
    {
        "author": "AllahuCakebar",
        "body": "these looters are legit incredibly stupid. Why wouldn't you be wearing masks?! It's perfectly normal to be wearing masks right now so it's not like wearing one will make you suspicious... \n\nboy these people are fucking up their lives... even if they don't get caught right now the police will track them down eventually. or who knows in 3 years the police starts using facial recognition technology and tracks down all the past rioters.",
        "created_utc": 1591062610,
        "id": "fsl9tcb",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591091410.0
    },
    {
        "author": "Number-91",
        "body": "Despite the sell offs gnus is hanging in tough. We could've been to $8+ by now",
        "created_utc": 1591203674,
        "id": "fsrjgfd",
        "score": 14,
        "subreddit": "pennystocks",
        "created": 1591232474.0
    },
    {
        "author": "tbwalker02",
        "body": "Delete this now",
        "created_utc": 1591210565,
        "id": "fsryhcj",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591239365.0
    },
    {
        "author": "Patriotnation5",
        "body": "Jesus downtown DC is in better shape than this thread right now.",
        "created_utc": 1591065608,
        "id": "fslf0l3",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591094408.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "Man, I love full telework. Trading has been so much more enjoyable and profitable. Do trading during real hours and fake gay work in the off hours. Now I just need to find a less expensive area to live in.",
        "created_utc": 1591048921,
        "id": "fskkmza",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591077721.0
    },
    {
        "author": "zjz",
        "body": "&gt;9/11 wasn't that bad\n\n+90000000000000000000000000 upvotes, three pages of reward emojis, circlejerk until the site can't handle the comment depth\n\n&gt;This one guy died because he had a heart attack not because black p-\n\nbanned, 0 upvotes, race war now\n\n\nsometimes I hate this website. this may be one of the only subreddits on Reddit that isn't a shithole country.",
        "created_utc": 1591036051,
        "id": "fsju94f",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591064851.0
    },
    {
        "author": "DoctorBalpak",
        "body": "The disconnect from reality right now is so insane in financial markets, that I am scared of the moment when it finally starts to happen and shit goes from 0 to 100 in no time without giving anyone a chance to smoothen the fall.",
        "created_utc": 1591147240,
        "id": "fsp6d1u",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591176040.0
    },
    {
        "author": "HinduHamma",
        "body": "How are this many people crying and whining about DKNG lmao?? It’s up over 100 percent in a matter of fucking weeks. Longs won big. Did everyone just now enter at 43 or something lolol!!??",
        "created_utc": 1591120813,
        "id": "fsnpm9k",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591149613.0
    },
    {
        "author": "CryptoMadeMeCrakHed",
        "body": "Bros, I've been buying calls on KR and killing it. \n\nIt spikes in the morning, tanks in the afternoon, and respikes EOD\n\nHere...\n\n- Sell in the morning\n\n- wait...\n\n- I said wait bitch\n\n- rebuy midday when you see a double spike (only on double)\n\n- hold through morning, or sell EOD, either way you win :)\n\nThis wont be sustainable for much longer given ER in a few weeks, but a good time to get in is 1 week ago, another good time is now.",
        "created_utc": 1591216187,
        "id": "fssami2",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591244987.0
    },
    {
        "author": "JAnon19",
        "body": "Imagine how high stocks would be right now if trump didn't let the rona in",
        "created_utc": 1591065579,
        "id": "fsleyu1",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591094379.0
    },
    {
        "author": "nafinmasjid",
        "body": "you know, now that im a bull again it feels good to have papa powell on my side. \n\ni still will never forget two weeks ago when i had puts and got excited asf at 2 AM cause hangseng was down 5.8% and oil was down 8% and futures were -0.6%.\n\ni was the happiest bear ever. went to sleep feeling good. had the most amazing sleep in the past few months  knowing that tendies had been secured.\n\nwoke up to +1.1%.\n\ni will never forget that",
        "created_utc": 1591146220,
        "id": "fsp4kpa",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591175020.0
    },
    {
        "author": "ma____",
        "body": "I need JPow and Elon to livestream themselves helicoptering their cocks right now so TSLA opens above $1000. Please.",
        "created_utc": 1591146945,
        "id": "fsp5u6d",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591175745.0
    },
    {
        "author": "-Nostalgic-",
        "body": "I’m holding $2 of btc at $9,200 rn. Been making pennies by the minute. I’m at $2.19 now fucking amazing",
        "created_utc": 1591063820,
        "id": "fslby4z",
        "score": 12,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1591092620.0
    },
    {
        "author": "Ijustquaffed",
        "body": "Remember when 300 seemed crazy? Now it seems crazy we'll ever go back down to 300",
        "created_utc": 1591146438,
        "id": "fsp4y91",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591175238.0
    },
    {
        "author": "Alkash42",
        "body": "I had a nice portfolio and then yesterday I decided to take a shit on it. Instead of cleaning that shit up now, I decided shit on the shit. Why am I like this",
        "created_utc": 1591215022,
        "id": "fss866f",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591243822.0
    },
    {
        "author": "Dudebroha1",
        "body": "Dude, Sell that now.",
        "created_utc": 1591066351,
        "id": "fslg9ld",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591095151.0
    },
    {
        "author": "movn",
        "body": "Gotta hand it to you VTIQ guys. I wrote that shit off as a stupid pump a month back. I wasn’t autistic enough to realize the potential. Now time for you all to lose it on DIS puts",
        "created_utc": 1591046971,
        "id": "fskgqta",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591075771.0
    },
    {
        "author": "RamboWarFace",
        "body": "Imagine being the guy who bets against a dude who made a fuckin spaceship. If you think its too expensive to FOMO in now, wait till TSLA never sees sub 1000.",
        "created_utc": 1591045682,
        "id": "fske4s7",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591074482.0
    },
    {
        "author": "vl99",
        "body": "DKNG now down .02% \n\nMust be that mega dump in AH the bears have been crowing about.",
        "created_utc": 1591049367,
        "id": "fsklhxc",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591078167.0
    },
    {
        "author": "phyllisteak",
        "body": "A month from now: SPX crossed 4000 as investors hope the aliens will soon go away",
        "created_utc": 1591053319,
        "id": "fskszue",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591082119.0
    },
    {
        "author": "Harudera",
        "body": "Starting to get nervous with DKNG now that all you idiots are holding it...",
        "created_utc": 1591040716,
        "id": "fsk3xlm",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591069516.0
    },
    {
        "author": "LordMeatwich",
        "body": "For a while WSB was where I came to get a break from all of the awfulness. This place fucking blows right now.",
        "created_utc": 1591071277,
        "id": "fsloapg",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591100077.0
    },
    {
        "author": "LMY723",
        "body": "Anyone else in the 1am workout gang? I used to be fat so I got used to working out at night because of shame, now I’m skinny and it’s just habit.",
        "created_utc": 1591076564,
        "id": "fslvvf8",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591105364.0
    },
    {
        "author": "rahulshtv",
        "body": "Congrats. Now tendie train only. Godspeed",
        "created_utc": 1591059688,
        "id": "fsl4lrv",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591088488.0
    },
    {
        "author": "marxr87",
        "body": "Did the gay bears get out and now we gonna fly for real?",
        "created_utc": 1591200808,
        "id": "fsrddir",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1591229608.0
    },
    {
        "author": "stojak4",
        "body": "I went from obsessively checking futures every 5 minutes until 3am every night to now not even bothering checking at all because I know it will just be green by open",
        "created_utc": 1591161562,
        "id": "fsptmki",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591190362.0
    },
    {
        "author": "TheSuperStableGenius",
        "body": "Here homo now let me pump ur mouth like ur mom https://imgur.com/a/r6fCGlB",
        "created_utc": 1591214019,
        "id": "fss600y",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591242819.0
    },
    {
        "author": "fin425",
        "body": "Kendall Jenner.....we fucking need you and Pepsi right now!!!!!!",
        "created_utc": 1591050843,
        "id": "fskobzv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591079643.0
    },
    {
        "author": "SolitaryEgg",
        "body": "Honestly my worldview is shooketh.\n\nThe people who were calling stay-at-home orders government tyranny a week ago are now the ones praising curfews and cheering on the military flooding American streets.\n\n\nAnd, the ones who were on social media shaming people for going outside and spreading rona are now the ones crowding into mobs and pretending like the virus doesn't matter.\n\n\nLeft, right... Who gives a shit? It's like fucking no one, on either side, has a fucking ounce of sincerity or conviction anymore. We're all just a bunch of fucking ADD bitchboys shouting endlessly into the internet void, searching for a small dopamine hit, and getting stupider by the day.\n\n\nPuts on humanity.",
        "created_utc": 1591075873,
        "id": "fsluxog",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1591104673.0
    },
    {
        "author": "bobstaman",
        "body": "Just a heads up to everyone. Don't make plays just to make a play. It's ok to weigh it out or just go with a different trade for now. Making a bad trade is worse than not making a trade.",
        "created_utc": 1591063542,
        "id": "fslbgms",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1591092342.0
    },
    {
        "author": "HoosierPride",
        "body": "The whole country has 3 stars right now",
        "created_utc": 1591069487,
        "id": "fsllh4v",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1591098287.0
    },
    {
        "author": "xGOXSTRAPx",
        "body": "You can tell everyone is over leveraged when a -0.7% move is now a \"dump\"",
        "created_utc": 1591043426,
        "id": "fsk9ii6",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1591072226.0
    },
    {
        "author": "dog34421",
        "body": "Its pretty amazing how wsb went from 80% gay bears at the March bottom buying puts the DAY OF THE BOTTOM to 100% mindless bulls now buying calls and assuring other fucking idiots yes its the time to go all in long.",
        "created_utc": 1591048135,
        "id": "fskj2nf",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1591076935.0
    },
    {
        "author": "iluvairforcealotalot",
        "body": "Time to buy puts now, thanks",
        "created_utc": 1591035972,
        "id": "fsju358",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1591064772.0
    },
    {
        "author": "TheOri0",
        "body": "Yeah there is no motivation for savers right now....interest is terrible. Literally no other place to put your $ and add on to that everyone is stuck at home in front of their PCs.\n\nPerfect storm for a stupid illogical squeeze upward.",
        "created_utc": 1591058708,
        "id": "fsl2uex",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1591087508.0
    },
    {
        "author": "scopolamine",
        "body": "The Bull Case is now \"the Fed is completely insane.\"  It's not a bad case.",
        "created_utc": 1591043820,
        "id": "fskabfm",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1591072620.0
    },
    {
        "author": "the_heat_waver",
        "body": "That empty podium at the White House sums up our leadership right now.",
        "created_utc": 1591035080,
        "id": "fsjs7ob",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1591063880.0
    },
    {
        "author": "burrowed_greentext",
        "body": "In a world of instant gratification only now u can see who got caught up in the easy dopamine hits and is out of touch when easy dopamine goes away.\n\nChase happiness and cling to it with ur fucking last breath. Turn off the fuckin news and play that videogame u haven't played in a while. Call up that girl u like and write ur fuckin love story with the world as ur witness.\n\nU think those fucking Syrian children getting acid-bombed or those women in Iran getting mutilated and gang raped would give up and roll over in America rn?\n\nNah man fuck that shit. If ur sad because some shit is getting broken go watch fuckin Saving Private Ryan and watch all those fucking 18yo's get fucking obliterated the moment the boat doors opened up. That's some real disastrous, horrific shit worth being shell-shocked over, not some glass on the streets or cars on fire cuz some dudes be pissed that their skin color brings them absolute hell in this country sometimes.\n\nA whole bunch of poor, beaten-down-and-tossed-aside Americans are bearing their teeth. Fuck it if their methods suck ass that's still some bald-eagle ass spirit knowing any of these fuckin cops could end their lives in a heartbeat and they'd become another number and name on a sign.\n\nIf ur fuckin sad rn get the fuck off this sub, save some money, go take a fucking roadtrip tomorrow and see this beautiful nation for what it is, beyond whatever bullshit ass short term shit we in right now.",
        "created_utc": 1591070156,
        "id": "fslmk6o",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1591098956.0
    },
    {
        "author": "VladdyGuerreroJr",
        "body": "So a reality TV star became president, and is now deploying the military to end unrest, while the worst pandemic in 100 year spreads around the world, and the economy contracts the most since the great depression.\n\nSo stocks closed green. Again.",
        "created_utc": 1591063451,
        "id": "fslbaye",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1591092251.0
    },
    {
        "author": "elld",
        "body": "Am I the only one who - once I've watched a porn scene and jerked off to it.... I refuse to ever jerk off to it again.\n\n\nI don't know why? It's like yeah I've shot my load to her on that scene, now it's useless shit to wank over. Do porn companies rely on people like me?",
        "created_utc": 1591077920,
        "id": "fslxn7f",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1591106720.0
    },
    {
        "author": "racerxff",
        "body": "Every other stock on your watchlist, now that you have no available funds to trade with: \"NOOT NOOT\"",
        "created_utc": 1591055290,
        "id": "fskwmzi",
        "score": 17,
        "subreddit": "pennystocks",
        "created": 1591084090.0
    },
    {
        "author": "uniaintshit",
        "body": "When I bought bitcoin everyone laughed at me because I have a small dick, but whose laughing now?",
        "created_utc": 1591053895,
        "id": "fsku2os",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591082695.0
    },
    {
        "author": "buildapchelper",
        "body": "Unpopular opinion but there is no such thing as a peaceful protest right now. The instigators are lumped in with the peaceful folks and all it takes is 1 bad apple for the entire thing to turn south. That bad Apple ALWAYS happens.",
        "created_utc": 1591053357,
        "id": "fskt2gm",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591082157.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "The Stages of Reopening (update):\n\nWeek 0 - Excitement - \"OMG we're back!!\"\n\nWeek 1 - Euphoria - \"SPY 300+, I heard there's lines at some place!! V-shaped recovery!!\"\n\nWeek 2 - Realization - \"hindsight, lockdowns were stupid. Probably caused more harm than it prevented\"\n\nWeek 3 - Concern - \"okay the lines are shorter now, I participated in going out, it was meh.. it was slow and awkward, maybe it comes back?\"\n\n* Most of you are here (now with rioting)\n\nWeek 4 - Growing Concern - \"These places are empty... How are they going to make it on 25% capacity, assuming they're even seeing that? No one is getting rehired, in fact they'll probably need to let more go.\"\n\nWeek 5 - Full Bear - \"Okay, this is slower than I remember 2009 being. I don't think it's bouncing back. SPY levels totally not sustainable, WTF were we thinking!?!\"\n\nWeek 6 (**New**) - Joining the Poors - \"I thought my white collar job was safe, but the company is being more dick now than they were when we were under lockdown.  I think they retained people just to cultivate good PR during the crisis, but are ready to release employees\"",
        "created_utc": 1591043627,
        "id": "fsk9x64",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1591072427.0
    },
    {
        "author": "ch1p_skylark",
        "body": "Protesters are gona pee their pants and go home now. I'm calling it.\n\nThe fun is over, bear gang going back on lockdown to stare at their -99% robinhood accounts.",
        "created_utc": 1591052285,
        "id": "fskr212",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591081085.0
    },
    {
        "author": "Sam_Handwich69420",
        "body": "Now we’re seeing all these companies putting out PSA’s against police brutality bc that’s what’s hot right now. I hate politics. SPY 315",
        "created_utc": 1591060708,
        "id": "fsl6eoe",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591089508.0
    },
    {
        "author": "w1na",
        "body": "She did a good job, no one could even imagine even 5 years ago where AMD would be today.\nWhen she took office, the cupboard were bare, there was no sales, no good architecture, losing for 2 decade to intel. Since the first athlon x64, they kept releasing bad products most of the time. In just 3 years, she made AMD go from Zero to Hero!\n\nAMD now trading at tremendous numbers, no one thought would be possible ever. Heck just look 7 years back, the share price was about 2 bucks.\n\nIf there is any CEO who you feel should earn so much, it’s not people from Moderna, but Lisa Su.\n\nJust to give you an idea, back in 2014 or so, I remember trying to buy AMD shares under 2 euros each (I wanted to get 2000 euro), before the order went through, it asked me for some paperwork confirmation, I then did not go through with the order and never did.\n\nMissed on 1000 shares from AMD. I did not believe back then, although I saw it was incredibly cheap.",
        "created_utc": 1591071652,
        "id": "fslovb3",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591100452.0
    },
    {
        "author": "BenjiWon",
        "body": "We sure haven't had a red day in a while... \\*tumbleweed rolls by\\* Should be coming any day now... \\*looks into the sunset as protfolio burns\\*",
        "created_utc": 1591047133,
        "id": "fskh2fj",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591075933.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "Lol. \n\nTeam members,\n\nI'm heartbroken about these protests \n\n\nNow I need everyone to give 18384848 percent. Hustle. No sleep. YOU ARE THE COMPANY\n\nhugs and kisses- chad",
        "created_utc": 1591067097,
        "id": "fslhis5",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591095897.0
    },
    {
        "author": "peppercupp",
        "body": "Heard a loud bang from the backyard, now there are a bunch of sirens. If I die, give my portfolio to haupt.",
        "created_utc": 1591053847,
        "id": "fsktzia",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591082647.0
    },
    {
        "author": "ClothedKing",
        "body": "Haha this is definitely what i will do from now on",
        "created_utc": 1591061325,
        "id": "fsl7ifv",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591090125.0
    },
    {
        "author": "smiling_stranger",
        "body": "I dont get it. I get taught to fight and rebel in school by our founding fathers, i buy the guns 🔫🔫, the flag🇺🇸🇺🇸🇺🇸, the home🏘️, pay my taxes, dont want cops killing me or you and now im unamerican? You taught me this. USA USA!\n\nSBWI DKNG🌝🌝🌝",
        "created_utc": 1591061844,
        "id": "fsl8g65",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591090644.0
    },
    {
        "author": "DeliciouslyUnaware",
        "body": "Okay now replace Biden with Clinton and this is exactly how 2016 went",
        "created_utc": 1591034706,
        "id": "fsjrg0h",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591063506.0
    },
    {
        "author": "psiguy686",
        "body": "It will only take a single -6% day to blow up 80% of the accounts in this sub right now.",
        "created_utc": 1591054695,
        "id": "fskvjr1",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591083495.0
    },
    {
        "author": "IronManKillsThanos",
        "body": "I was comparing inflation over the years and found some pretty depressing numbers. \n\nBrand new mustang was $3k in the 60s when minimum wage was $1. 3000 hours of work for a new car.\n\nNew mustang now starts at $35k and minimum wage is $7.25. 4800 hours of work now.\n\nYou don't want to know housing.",
        "created_utc": 1591070444,
        "id": "fsln0gb",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591099244.0
    },
    {
        "author": "galivet",
        "body": "A company splits its stock to increase liquidity.\n\nConsider Berkshire Hathaway, with a share price north of $250K. If a shareholder needs to liquidate enough stock to raise $100K, they can't do it without selling more than twice that value of BRK-A. So maybe they'll pick something else to sell instead that's more right-sized for the amount of money they need. Now consider an individual investor with \"only\" $100K to invest. That person can't buy even one share of BRK-A. In both cases, the high share price discouraged investors from trading the stock -- it inhibits liquidity. If BRK-A did a 3-for-1 stock split then those two investors could work out a trade with each other.\n\nThere are three reasons companies don't split stock:\n\n1. They feel it's prestigious to have a high per-share stock price.\n2. They prefer having lower liquidity because it causes the population of investors holding your shares to trend toward being wealthier and trading less frequently. That can provide greater stability for the stock price in normal times.\n3. Splitting the stock isn't free. It requires you to pay lawyers, publish notifications to shareholders, and so on. Companies prefer not to incur expenses without a clear payoff.\n\nEDIT: I guess I'll also explain why a company might like a more liquid stock. A more liquid stock will track more closely to its true market value. A low-liquidity stock can drop in price very sharply if it's hard for buyers to purchase it. Go back to that investor who needed to raise $100K. Now suppose that guy **ONLY** has BRK-A and he **HAS** to sell it. Because of the high share price, there's a smaller pool of investors who have the money to buy it from him. Desperate seller + small buyer pool means that seller can get screwed. Maybe in desperation he'll sell for $200K instead of the $250K+ the stock is worth... well then the market sees **ALL** of those shares as worth only $200K and the share price plummets. Now of course the price isn't really determined by what one guy does, but in a crisis a lot of sellers can find themselves in the same boat and it can happen.\n\nThis kind of liquidity problem is why the US Fed recently started buying up bond ETFs -- desperate sellers + small buyer pool would have put the price of those bonds through the floor *even though the bonds are actually still valuable* had the Fed not stepped in. Because the Fed has the money to buy anything, it can buy those bonds at a normal market price from anyone and let the price decline in a less terrifying way for everyone involved. When analysts talk about the Fed \"providing liquidity,\" this is what they mean.",
        "created_utc": 1591061657,
        "id": "fsl841m",
        "score": 14,
        "subreddit": "investing",
        "created": 1591090457.0
    },
    {
        "author": "AllahuCakebar",
        "body": "these looters are legit incredibly stupid. Why wouldn't you be wearing masks?! It's perfectly normal to be wearing masks right now so it's not like wearing one will make you suspicious... \n\nboy these people are fucking up their lives... even if they don't get caught right now the police will track them down eventually. or who knows in 3 years the police starts using facial recognition technology and tracks down all the past rioters.",
        "created_utc": 1591062610,
        "id": "fsl9tcb",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591091410.0
    },
    {
        "author": "Patriotnation5",
        "body": "Jesus downtown DC is in better shape than this thread right now.",
        "created_utc": 1591065608,
        "id": "fslf0l3",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591094408.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "Man, I love full telework. Trading has been so much more enjoyable and profitable. Do trading during real hours and fake gay work in the off hours. Now I just need to find a less expensive area to live in.",
        "created_utc": 1591048921,
        "id": "fskkmza",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591077721.0
    },
    {
        "author": "zjz",
        "body": "&gt;9/11 wasn't that bad\n\n+90000000000000000000000000 upvotes, three pages of reward emojis, circlejerk until the site can't handle the comment depth\n\n&gt;This one guy died because he had a heart attack not because black p-\n\nbanned, 0 upvotes, race war now\n\n\nsometimes I hate this website. this may be one of the only subreddits on Reddit that isn't a shithole country.",
        "created_utc": 1591036051,
        "id": "fsju94f",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591064851.0
    },
    {
        "author": "JAnon19",
        "body": "Imagine how high stocks would be right now if trump didn't let the rona in",
        "created_utc": 1591065579,
        "id": "fsleyu1",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591094379.0
    },
    {
        "author": "-Nostalgic-",
        "body": "I’m holding $2 of btc at $9,200 rn. Been making pennies by the minute. I’m at $2.19 now fucking amazing",
        "created_utc": 1591063820,
        "id": "fslby4z",
        "score": 12,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1591092620.0
    },
    {
        "author": "Dudebroha1",
        "body": "Dude, Sell that now.",
        "created_utc": 1591066351,
        "id": "fslg9ld",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591095151.0
    },
    {
        "author": "movn",
        "body": "Gotta hand it to you VTIQ guys. I wrote that shit off as a stupid pump a month back. I wasn’t autistic enough to realize the potential. Now time for you all to lose it on DIS puts",
        "created_utc": 1591046971,
        "id": "fskgqta",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591075771.0
    },
    {
        "author": "RamboWarFace",
        "body": "Imagine being the guy who bets against a dude who made a fuckin spaceship. If you think its too expensive to FOMO in now, wait till TSLA never sees sub 1000.",
        "created_utc": 1591045682,
        "id": "fske4s7",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591074482.0
    },
    {
        "author": "vl99",
        "body": "DKNG now down .02% \n\nMust be that mega dump in AH the bears have been crowing about.",
        "created_utc": 1591049367,
        "id": "fsklhxc",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591078167.0
    },
    {
        "author": "phyllisteak",
        "body": "A month from now: SPX crossed 4000 as investors hope the aliens will soon go away",
        "created_utc": 1591053319,
        "id": "fskszue",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591082119.0
    },
    {
        "author": "Harudera",
        "body": "Starting to get nervous with DKNG now that all you idiots are holding it...",
        "created_utc": 1591040716,
        "id": "fsk3xlm",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591069516.0
    },
    {
        "author": "LordMeatwich",
        "body": "For a while WSB was where I came to get a break from all of the awfulness. This place fucking blows right now.",
        "created_utc": 1591071277,
        "id": "fsloapg",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591100077.0
    },
    {
        "author": "LMY723",
        "body": "Anyone else in the 1am workout gang? I used to be fat so I got used to working out at night because of shame, now I’m skinny and it’s just habit.",
        "created_utc": 1591076564,
        "id": "fslvvf8",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591105364.0
    },
    {
        "author": "rahulshtv",
        "body": "Congrats. Now tendie train only. Godspeed",
        "created_utc": 1591059688,
        "id": "fsl4lrv",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591088488.0
    },
    {
        "author": "fin425",
        "body": "Kendall Jenner.....we fucking need you and Pepsi right now!!!!!!",
        "created_utc": 1591050843,
        "id": "fskobzv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591079643.0
    },
    {
        "author": "spyaintnobitch",
        "body": "These protests kinda played out now. The looting ruined it",
        "created_utc": 1591068060,
        "id": "fslj4mf",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591096860.0
    },
    {
        "author": "smallchimpu",
        "body": "Some bear mocked j pow at white house, now he banned red color",
        "created_utc": 1591037035,
        "id": "fsjwbbl",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591065835.0
    },
    {
        "author": "neutralpoliticsbot",
        "body": "Now you know why Tesla Cybertruck has bulletproof body and glass.",
        "created_utc": 1591074020,
        "id": "fslschn",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591102820.0
    },
    {
        "author": "carterbrianw",
        "body": "Hey guys. Made a Reddit account 30 days ago and spend around 3-4 hours a day here. Finally able to post. Crazy stuff happening in the world, people rioting and stuff. Had a smoothie for breakfast then went and got free Popeyes because when I went yesterday they gave me 2 French fries. That’s not an exaggeration, my meal contained two French fries. Like one, two. After that I came home and hung out. Then I went to qdoba, which is significantly better than chipotle. Now I’m just hanging out.\n\nEDIT: sold 3 Tesla calls at 7.15 today. Call me a pussy, but my average was 1.42. Holding 2 $315 AAPL puts",
        "created_utc": 1591067313,
        "id": "fslhvpo",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591096113.0
    },
    {
        "author": "DontSweatIt32",
        "body": "Keep waiting for “the second drop”... “anyday now boys”... this will break 1k by friday.",
        "created_utc": 1591043630,
        "id": "fsk9xea",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591072430.0
    },
    {
        "author": "lame_irl",
        "body": "YOUVE SEEN ARAB SPRING\n\nNOW ITS TIME FOR BLACK AMERICAN SUMMER",
        "created_utc": 1591047665,
        "id": "fski4yw",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591076465.0
    },
    {
        "author": "ch1p_skylark",
        "body": "BITCOIN JUST OMEGA MOONED IN THE LAST 10 MIN\n\nNOW ABOVE 10K",
        "created_utc": 1591053048,
        "id": "fskshjd",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591081848.0
    },
    {
        "author": "DingleberryBlaster69",
        "body": "virus is fake and gay we rioting now",
        "created_utc": 1591079314,
        "id": "fslzeo5",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591108114.0
    },
    {
        "author": "iRelapse",
        "body": "Only reason I'm here right now.",
        "created_utc": 1591048231,
        "id": "fskj9k9",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591077031.0
    },
    {
        "author": "winele",
        "body": "About the same percent your puts are down right now.",
        "created_utc": 1591056315,
        "id": "fskyiea",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591085115.0
    },
    {
        "author": "DIRTY_MAGICIAN",
        "body": "Congrats now you can go to the doctor for that half brain of yours",
        "created_utc": 1591048771,
        "id": "fskkcdy",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591077571.0
    },
    {
        "author": "MightyMiami",
        "body": "Nobody knows. People are not selling this stock right now. More people buying than selling. Look at today. It was up a d down but never lower than open.\n\nOnce it hits $3. Sure maybe some take profits. But it will likely keep going up because a $3 is a strong benchmark and likely more people will come on.. I don't see it being below $2.60 for awhile now.",
        "created_utc": 1591052205,
        "id": "fskqwjr",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1591081005.0
    },
    {
        "author": "superbowl_LII_champs",
        "body": "Its eventually going to be worth more than it is now, but it could possibly be worth less too.",
        "created_utc": 1591040427,
        "id": "fsk3by5",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1591069227.0
    },
    {
        "author": "magisteerial",
        "body": "These stories are comical.  \n\nThis lady is a fucking real estate agent, doesnt know how mortgages work, takes on a risky investment and is now complaining to the media hoping for some miracle GoFundMe to start like a govt corporate bailout, but for idiots.  \n\nI fail to see why I should have any sympathy for these retards. Dont buy shit you cant afford.",
        "created_utc": 1591035112,
        "id": "fsjsa3k",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591063912.0
    },
    {
        "author": "Ban_787",
        "body": "Holy shit they shooting cops in St.Louis now crazyyy\n\n\nhttps://twitter.com/breaking911/status/1267697362857836544?s=21",
        "created_utc": 1591078832,
        "id": "fslysos",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591107632.0
    },
    {
        "author": "OofxYikes",
        "body": "You're deliberately misrepresenting the situations to bolster your point. It was not that the business owners in question banned a gay couple from purchasing the cake, it is that they refused to perform the service of baking a custom cake. The majority of the Supreme Court ruled for the bakers, including some liberals. And now it is an ongoing debate whether Twitter is just \"a business\" or serves a more public role as a platform, publisher, or utility. Your lack of appreciation for the nuance of these cases belies your ideological leanings.",
        "created_utc": 1591062204,
        "id": "fsl930q",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591091004.0
    },
    {
        "author": "Lothire",
        "body": "SP500 Futures ***DOWN*** 0.06%?!\n\n#*I CANNOT TAKE THIS VOLATILITY!!!*\n\nedit - FUCK -0.07% now I can't do this anymore!",
        "created_utc": 1591049643,
        "id": "fskm0uj",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591078443.0
    },
    {
        "author": "SoberCharlieSheen123",
        "body": "This is some Orwellian propaganda on display right now in this presser what the fuck",
        "created_utc": 1591036762,
        "id": "fsjvqnp",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591065562.0
    },
    {
        "author": "HoosierPride",
        "body": "People shorting DKNG are going to get burned. Why would it randomly dump now with sports coming back and major announcements this week? Unless SPY dumps DKNG is $50 EOW",
        "created_utc": 1591040685,
        "id": "fsk3v88",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591069485.0
    },
    {
        "author": "firestormdude",
        "body": "Tesla is going to moon up to $1200 and it’s going to take 3 quarters of shitty earnings for investors to finally get frustrated and give up. No one is fucking buying cars right now.",
        "created_utc": 1591045714,
        "id": "fske72j",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591074514.0
    },
    {
        "author": "saliym1988",
        "body": "America is so ghetto right now, from the president to the cops.",
        "created_utc": 1591069823,
        "id": "fslm0x1",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591098623.0
    },
    {
        "author": "scopolamine",
        "body": "As you might know, I am teasing a lot of Americans here, through observing from Europe. (like a brother tease)\n\nToday, my country decided to relax measurement after nearly 3 months of lockdown. I went to a terrace with some friends, we had beers and dined, laughed and looked at all other people. Everybody was quite happy.\n\nDuring that dinner, there was one moment, I felt quite a bit sad thinking of USA and what USA is going through right now. I am hoping that the USA will do better any time soon because you deserve better as much as we do.\n\nOnce this shitshow is over, I will start teasing you Muricans about stupid stuff again.",
        "created_utc": 1591042830,
        "id": "fsk8am4",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591071630.0
    },
    {
        "author": "Harry_Butterfield",
        "body": "I love days like this when I make so much money I call into work (I work afternoons) and party all day because punching a clock for a few dollars is so ridiculous now. 🤣🚀🆙️🇺🇸🤑",
        "created_utc": 1591046580,
        "id": "fskfyit",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591075380.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Bro they have to show so much self restraint and emotional control to not just take out their guns and start capping mothafuckas right now",
        "created_utc": 1591065578,
        "id": "fsleyrk",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591094378.0
    },
    {
        "author": "drummerboye",
        "body": "Jeez even the military protecting SPY from the bears now",
        "created_utc": 1591071518,
        "id": "fslonzo",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591100318.0
    },
    {
        "author": "FightingLasagna24",
        "body": "I’m a bull but the closer Trump gets to attempting to become a dictator the faster the market will drop. \n\nThat right wingers are calling for the killing of democrats is not only despicable, it’ll destroy the country.\n\nNow that I got that out of my chest, \n\n\nspy 310c",
        "created_utc": 1591056671,
        "id": "fskz5r6",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591085471.0
    },
    {
        "author": "LilBoogalooBoi",
        "body": "No more stimulus checks now. Had my eye on a free mp5 and suppressor 🤬",
        "created_utc": 1591063510,
        "id": "fslbeo6",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591092310.0
    },
    {
        "author": "not_batsoup",
        "body": "Still can’t believe i sold my TSLA 1000c on friday. Sold them for .90 now 4.88",
        "created_utc": 1591058782,
        "id": "fsl2z60",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591087582.0
    },
    {
        "author": "UsernameTaken_123",
        "body": "where's the anti-gubmint \"dont tread on me\" crowd now....?",
        "created_utc": 1591071748,
        "id": "fslp0ml",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591100548.0
    },
    {
        "author": "Dans2016",
        "body": "[Yep, looks like martial law is coming.](https://www.abc57.com/news/active-duty-troops-deploying-to-washington-dc) Green from now on. VIX to zero. All stable. Printers safe.",
        "created_utc": 1591064611,
        "id": "fsldb3n",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591093411.0
    },
    {
        "author": "Lolsmileyface13",
        "body": "the funniest thing about all this is that a fucking limit down puts us at what, like 290? a level we couldn't break for a month. \n\nThat's how markets move now. Slow and steady, up an aimless 1-2% every day. So when they drop, they're limited to where they were last tuesday lmfao",
        "created_utc": 1591063394,
        "id": "fslb7c1",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591092194.0
    },
    {
        "author": "ExternalBid",
        "body": "DKNG OOOH DADDY DON'T STOP NOW",
        "created_utc": 1591040066,
        "id": "fsk2l0e",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591068866.0
    },
    {
        "author": "Prayaa",
        "body": "Never trying to time the fall again.  With that now being said, I’m probably going to average down on puts tomorrow when spy reaches 310.",
        "created_utc": 1591043633,
        "id": "fsk9xny",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591072433.0
    },
    {
        "author": "eyerollingsex",
        "body": "Lol CNN hasn’t mentioned Coronavirus once all night. \n\nReporters wearing no masks\n\nA week ago they wouldn’t stop talking about it\n\nIs the virus just over now 🤷‍♂️",
        "created_utc": 1591069269,
        "id": "fsll43t",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591098069.0
    },
    {
        "author": "nikofili",
        "body": "Theres like 3 chases going on in LA right now lmao",
        "created_utc": 1591069391,
        "id": "fsllbfg",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591098191.0
    },
    {
        "author": "alhuxley",
        "body": "Market can do whatever it wants, I'm just salty Zoom 🚀  hits all time highs despite being (a) now facing major competition from larger competitors (b) at the end of its demand peak as work from home ends (c) shady chinese pump and dump",
        "created_utc": 1591043452,
        "id": "fsk9kcy",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591072252.0
    },
    {
        "author": "FFW3",
        "body": "I like how we are calling .25% pullbacks \"dumps\" now.",
        "created_utc": 1591036019,
        "id": "fsju6q5",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591064819.0
    },
    {
        "author": "LuxGang",
        "body": "I'm not an expert on Forex, so take this with a grain of salt, and anyone can correct me if I'm off base.\n\nMy observation is that the Canadian Dollar (and our economy) is somewhat tied to oil, so when oil started crashing, the CAD went down with it. Now that oil has bottomed and is recovering, so is the CAD.",
        "created_utc": 1591046371,
        "id": "fskfj4j",
        "score": 8,
        "subreddit": "CanadianInvestor",
        "created": 1591075171.0
    },
    {
        "author": "chibuezephoibos",
        "body": "&gt; Trump: China trade deal going great, we will now punish hong kong for being invaded by china\n\nThis is what confused me the most about the press conference last week. China fucks up HK, so now we punish HK for something they couldn't stop?",
        "created_utc": 1591037724,
        "id": "fsjxrdc",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591066524.0
    },
    {
        "author": "POOTERSS",
        "body": "the market being up right now is crazy... with the state of the world right now in total chaos..",
        "created_utc": 1591037839,
        "id": "fsjxzyd",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591066639.0
    },
    {
        "author": "CriticalSodium",
        "body": "Now he's walking through the park where he just kicked out the commies",
        "created_utc": 1591052844,
        "id": "fsks3qc",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591081644.0
    },
    {
        "author": "CMac681",
        "body": "Bro...come on now",
        "created_utc": 1591068538,
        "id": "fsljx1z",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591097338.0
    },
    {
        "author": "abogado-de-aves",
        "body": "Fuck it, just bought another 100 shares of DKNG, now have 300. Brought my average up from $25 to $31. My IRA is now 75% DKNG, for the memes lfg ☄️🪐🌔",
        "created_utc": 1591041350,
        "id": "fsk595o",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591070150.0
    },
    {
        "author": "gabethebaeb",
        "body": "I hate sitting on cash but it feels like all of my favorites are just too high right now besides DIS, and I really don’t wanna get in bed with them again",
        "created_utc": 1591035741,
        "id": "fsjtlwx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591064541.0
    },
    {
        "author": "Thecreedthoughtsgov",
        "body": "I was so close to breaking even 1 month ago and now I’m down 60% again. Fml",
        "created_utc": 1591038072,
        "id": "fsjyhls",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591066872.0
    },
    {
        "author": "FeistyButthole",
        "body": "“A stock market can go up or down, but the stonkavator can go sideways and slantways and longways and backways and squareways, frontways and any other ways that you can think of. It can take you to any value in the whole market just by pressing one of these buttons. Up until now I’ve pressed them all. Except one. This one (points to Main Street QE button).” — Jerome Powell\n\n[Stonkavator knockoff](https://youtu.be/A9_yMvOdYoo)",
        "created_utc": 1591060761,
        "id": "fsl6i5h",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591089561.0
    },
    {
        "author": "twistedlimb",
        "body": "He didn’t answer you because he has two broken arms right now.",
        "created_utc": 1591067981,
        "id": "fslj00u",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591096781.0
    },
    {
        "author": "ArsonDub",
        "body": "Irish reperations now",
        "created_utc": 1591062711,
        "id": "fsl9zqg",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591091511.0
    },
    {
        "author": "bearsgotoalaskanstfu",
        "body": "To all the bulls, you guys must be fucking rich by now. I’ve been a bear for a month and just hoped in the bull train. I know we are crashing tomorrow but I had to do it. It’s free real stonks. Bubble time",
        "created_utc": 1591031371,
        "id": "fsjkjk6",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591060171.0
    },
    {
        "author": "bigbend01",
        "body": "Who's wearing LULU pants right now? Be honest?",
        "created_utc": 1591065916,
        "id": "fslfjdk",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591094716.0
    },
    {
        "author": "approachingX",
        "body": "I moved all my shit into long plays and now I’m bored. /:",
        "created_utc": 1591028494,
        "id": "fsjepm2",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591057294.0
    },
    {
        "author": "oregon_forever",
        "body": "So they shutdown the entire economy, caused the biggest economic recession in history, 30 million unemployment just to slowdown spread of a disease which is now spreading like wildfire because people are rioting in the streets.\n\n2020 baby.",
        "created_utc": 1591056427,
        "id": "fskyprv",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591085227.0
    },
    {
        "author": "yawn_this_gets_old",
        "body": "[Bears have now descended on Wall Street](https://media.giphy.com/media/l2SpMDbxk09bYpGPC/giphy.gif).",
        "created_utc": 1591064602,
        "id": "fsldaho",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591093402.0
    },
    {
        "author": "kk7766",
        "body": "coronavirus is gone it was used as a political weapon but now they have a bigger one",
        "created_utc": 1591065396,
        "id": "fslenqe",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591094196.0
    },
    {
        "author": "acoupleoftravels",
        "body": "Went from amazing to horrible in terms of portfolio gains past few months. Finally stopped buying puts and anything not a leap or pretty far dated near money call. Sold first gain in what feels like forever for 65% profit (bynd 215c 2021). Now just 100 more and I can recover to where I was",
        "created_utc": 1591048881,
        "id": "fskkk6m",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591077681.0
    },
    {
        "author": "pelikana20",
        "body": "They won't fuck with armed soldiers. All the rioting that's gonna happen from now on is Twitter",
        "created_utc": 1591052177,
        "id": "fskqums",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591080977.0
    },
    {
        "author": "xGOXSTRAPx",
        "body": "You can tell everyone is over leveraged when a -0.7% move is now a \"dump\"",
        "created_utc": 1591043426,
        "id": "fsk9ii6",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1591072226.0
    },
    {
        "author": "dog34421",
        "body": "Its pretty amazing how wsb went from 80% gay bears at the March bottom buying puts the DAY OF THE BOTTOM to 100% mindless bulls now buying calls and assuring other fucking idiots yes its the time to go all in long.",
        "created_utc": 1591048135,
        "id": "fskj2nf",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1591076935.0
    },
    {
        "author": "iluvairforcealotalot",
        "body": "Time to buy puts now, thanks",
        "created_utc": 1591035972,
        "id": "fsju358",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1591064772.0
    },
    {
        "author": "scopolamine",
        "body": "The Bull Case is now \"the Fed is completely insane.\"  It's not a bad case.",
        "created_utc": 1591043820,
        "id": "fskabfm",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1591072620.0
    },
    {
        "author": "the_heat_waver",
        "body": "That empty podium at the White House sums up our leadership right now.",
        "created_utc": 1591035080,
        "id": "fsjs7ob",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1591063880.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "The Stages of Reopening (update):\n\nWeek 0 - Excitement - \"OMG we're back!!\"\n\nWeek 1 - Euphoria - \"SPY 300+, I heard there's lines at some place!! V-shaped recovery!!\"\n\nWeek 2 - Realization - \"hindsight, lockdowns were stupid. Probably caused more harm than it prevented\"\n\nWeek 3 - Concern - \"okay the lines are shorter now, I participated in going out, it was meh.. it was slow and awkward, maybe it comes back?\"\n\n* Most of you are here (now with rioting)\n\nWeek 4 - Growing Concern - \"These places are empty... How are they going to make it on 25% capacity, assuming they're even seeing that? No one is getting rehired, in fact they'll probably need to let more go.\"\n\nWeek 5 - Full Bear - \"Okay, this is slower than I remember 2009 being. I don't think it's bouncing back. SPY levels totally not sustainable, WTF were we thinking!?!\"\n\nWeek 6 (**New**) - Joining the Poors - \"I thought my white collar job was safe, but the company is being more dick now than they were when we were under lockdown.  I think they retained people just to cultivate good PR during the crisis, but are ready to release employees\"",
        "created_utc": 1591043627,
        "id": "fsk9x64",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1591072427.0
    },
    {
        "author": "BenjiWon",
        "body": "We sure haven't had a red day in a while... \\*tumbleweed rolls by\\* Should be coming any day now... \\*looks into the sunset as protfolio burns\\*",
        "created_utc": 1591047133,
        "id": "fskh2fj",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591075933.0
    },
    {
        "author": "DeliciouslyUnaware",
        "body": "Okay now replace Biden with Clinton and this is exactly how 2016 went",
        "created_utc": 1591034706,
        "id": "fsjrg0h",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591063506.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "Man, I love full telework. Trading has been so much more enjoyable and profitable. Do trading during real hours and fake gay work in the off hours. Now I just need to find a less expensive area to live in.",
        "created_utc": 1591048921,
        "id": "fskkmza",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591077721.0
    },
    {
        "author": "zjz",
        "body": "&gt;9/11 wasn't that bad\n\n+90000000000000000000000000 upvotes, three pages of reward emojis, circlejerk until the site can't handle the comment depth\n\n&gt;This one guy died because he had a heart attack not because black p-\n\nbanned, 0 upvotes, race war now\n\n\nsometimes I hate this website. this may be one of the only subreddits on Reddit that isn't a shithole country.",
        "created_utc": 1591036051,
        "id": "fsju94f",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591064851.0
    },
    {
        "author": "movn",
        "body": "Gotta hand it to you VTIQ guys. I wrote that shit off as a stupid pump a month back. I wasn’t autistic enough to realize the potential. Now time for you all to lose it on DIS puts",
        "created_utc": 1591046971,
        "id": "fskgqta",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591075771.0
    },
    {
        "author": "RamboWarFace",
        "body": "Imagine being the guy who bets against a dude who made a fuckin spaceship. If you think its too expensive to FOMO in now, wait till TSLA never sees sub 1000.",
        "created_utc": 1591045682,
        "id": "fske4s7",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591074482.0
    },
    {
        "author": "vl99",
        "body": "DKNG now down .02% \n\nMust be that mega dump in AH the bears have been crowing about.",
        "created_utc": 1591049367,
        "id": "fsklhxc",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591078167.0
    },
    {
        "author": "Harudera",
        "body": "Starting to get nervous with DKNG now that all you idiots are holding it...",
        "created_utc": 1591040716,
        "id": "fsk3xlm",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591069516.0
    },
    {
        "author": "fin425",
        "body": "Kendall Jenner.....we fucking need you and Pepsi right now!!!!!!",
        "created_utc": 1591050843,
        "id": "fskobzv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591079643.0
    },
    {
        "author": "smallchimpu",
        "body": "Some bear mocked j pow at white house, now he banned red color",
        "created_utc": 1591037035,
        "id": "fsjwbbl",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591065835.0
    },
    {
        "author": "DontSweatIt32",
        "body": "Keep waiting for “the second drop”... “anyday now boys”... this will break 1k by friday.",
        "created_utc": 1591043630,
        "id": "fsk9xea",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591072430.0
    },
    {
        "author": "lame_irl",
        "body": "YOUVE SEEN ARAB SPRING\n\nNOW ITS TIME FOR BLACK AMERICAN SUMMER",
        "created_utc": 1591047665,
        "id": "fski4yw",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591076465.0
    },
    {
        "author": "iRelapse",
        "body": "Only reason I'm here right now.",
        "created_utc": 1591048231,
        "id": "fskj9k9",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591077031.0
    },
    {
        "author": "DIRTY_MAGICIAN",
        "body": "Congrats now you can go to the doctor for that half brain of yours",
        "created_utc": 1591048771,
        "id": "fskkcdy",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591077571.0
    },
    {
        "author": "superbowl_LII_champs",
        "body": "Its eventually going to be worth more than it is now, but it could possibly be worth less too.",
        "created_utc": 1591040427,
        "id": "fsk3by5",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1591069227.0
    },
    {
        "author": "magisteerial",
        "body": "These stories are comical.  \n\nThis lady is a fucking real estate agent, doesnt know how mortgages work, takes on a risky investment and is now complaining to the media hoping for some miracle GoFundMe to start like a govt corporate bailout, but for idiots.  \n\nI fail to see why I should have any sympathy for these retards. Dont buy shit you cant afford.",
        "created_utc": 1591035112,
        "id": "fsjsa3k",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591063912.0
    },
    {
        "author": "Lothire",
        "body": "SP500 Futures ***DOWN*** 0.06%?!\n\n#*I CANNOT TAKE THIS VOLATILITY!!!*\n\nedit - FUCK -0.07% now I can't do this anymore!",
        "created_utc": 1591049643,
        "id": "fskm0uj",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591078443.0
    },
    {
        "author": "SoberCharlieSheen123",
        "body": "This is some Orwellian propaganda on display right now in this presser what the fuck",
        "created_utc": 1591036762,
        "id": "fsjvqnp",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591065562.0
    },
    {
        "author": "HoosierPride",
        "body": "People shorting DKNG are going to get burned. Why would it randomly dump now with sports coming back and major announcements this week? Unless SPY dumps DKNG is $50 EOW",
        "created_utc": 1591040685,
        "id": "fsk3v88",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591069485.0
    },
    {
        "author": "firestormdude",
        "body": "Tesla is going to moon up to $1200 and it’s going to take 3 quarters of shitty earnings for investors to finally get frustrated and give up. No one is fucking buying cars right now.",
        "created_utc": 1591045714,
        "id": "fske72j",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591074514.0
    },
    {
        "author": "scopolamine",
        "body": "As you might know, I am teasing a lot of Americans here, through observing from Europe. (like a brother tease)\n\nToday, my country decided to relax measurement after nearly 3 months of lockdown. I went to a terrace with some friends, we had beers and dined, laughed and looked at all other people. Everybody was quite happy.\n\nDuring that dinner, there was one moment, I felt quite a bit sad thinking of USA and what USA is going through right now. I am hoping that the USA will do better any time soon because you deserve better as much as we do.\n\nOnce this shitshow is over, I will start teasing you Muricans about stupid stuff again.",
        "created_utc": 1591042830,
        "id": "fsk8am4",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591071630.0
    },
    {
        "author": "Harry_Butterfield",
        "body": "I love days like this when I make so much money I call into work (I work afternoons) and party all day because punching a clock for a few dollars is so ridiculous now. 🤣🚀🆙️🇺🇸🤑",
        "created_utc": 1591046580,
        "id": "fskfyit",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591075380.0
    },
    {
        "author": "ExternalBid",
        "body": "DKNG OOOH DADDY DON'T STOP NOW",
        "created_utc": 1591040066,
        "id": "fsk2l0e",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591068866.0
    },
    {
        "author": "Prayaa",
        "body": "Never trying to time the fall again.  With that now being said, I’m probably going to average down on puts tomorrow when spy reaches 310.",
        "created_utc": 1591043633,
        "id": "fsk9xny",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591072433.0
    },
    {
        "author": "alhuxley",
        "body": "Market can do whatever it wants, I'm just salty Zoom 🚀  hits all time highs despite being (a) now facing major competition from larger competitors (b) at the end of its demand peak as work from home ends (c) shady chinese pump and dump",
        "created_utc": 1591043452,
        "id": "fsk9kcy",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591072252.0
    },
    {
        "author": "FFW3",
        "body": "I like how we are calling .25% pullbacks \"dumps\" now.",
        "created_utc": 1591036019,
        "id": "fsju6q5",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591064819.0
    },
    {
        "author": "LuxGang",
        "body": "I'm not an expert on Forex, so take this with a grain of salt, and anyone can correct me if I'm off base.\n\nMy observation is that the Canadian Dollar (and our economy) is somewhat tied to oil, so when oil started crashing, the CAD went down with it. Now that oil has bottomed and is recovering, so is the CAD.",
        "created_utc": 1591046371,
        "id": "fskfj4j",
        "score": 8,
        "subreddit": "CanadianInvestor",
        "created": 1591075171.0
    },
    {
        "author": "chibuezephoibos",
        "body": "&gt; Trump: China trade deal going great, we will now punish hong kong for being invaded by china\n\nThis is what confused me the most about the press conference last week. China fucks up HK, so now we punish HK for something they couldn't stop?",
        "created_utc": 1591037724,
        "id": "fsjxrdc",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591066524.0
    },
    {
        "author": "POOTERSS",
        "body": "the market being up right now is crazy... with the state of the world right now in total chaos..",
        "created_utc": 1591037839,
        "id": "fsjxzyd",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591066639.0
    },
    {
        "author": "abogado-de-aves",
        "body": "Fuck it, just bought another 100 shares of DKNG, now have 300. Brought my average up from $25 to $31. My IRA is now 75% DKNG, for the memes lfg ☄️🪐🌔",
        "created_utc": 1591041350,
        "id": "fsk595o",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591070150.0
    },
    {
        "author": "gabethebaeb",
        "body": "I hate sitting on cash but it feels like all of my favorites are just too high right now besides DIS, and I really don’t wanna get in bed with them again",
        "created_utc": 1591035741,
        "id": "fsjtlwx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591064541.0
    },
    {
        "author": "Thecreedthoughtsgov",
        "body": "I was so close to breaking even 1 month ago and now I’m down 60% again. Fml",
        "created_utc": 1591038072,
        "id": "fsjyhls",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591066872.0
    },
    {
        "author": "bearsgotoalaskanstfu",
        "body": "To all the bulls, you guys must be fucking rich by now. I’ve been a bear for a month and just hoped in the bull train. I know we are crashing tomorrow but I had to do it. It’s free real stonks. Bubble time",
        "created_utc": 1591031371,
        "id": "fsjkjk6",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591060171.0
    },
    {
        "author": "approachingX",
        "body": "I moved all my shit into long plays and now I’m bored. /:",
        "created_utc": 1591028494,
        "id": "fsjepm2",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591057294.0
    },
    {
        "author": "acoupleoftravels",
        "body": "Went from amazing to horrible in terms of portfolio gains past few months. Finally stopped buying puts and anything not a leap or pretty far dated near money call. Sold first gain in what feels like forever for 65% profit (bynd 215c 2021). Now just 100 more and I can recover to where I was",
        "created_utc": 1591048881,
        "id": "fskkk6m",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591077681.0
    },
    {
        "author": "turdfurgeson23",
        "body": "I'm balls deep in DKNG 7/17 50c, so you guys can start firing your puts up now.",
        "created_utc": 1591029921,
        "id": "fsjhkub",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591058721.0
    },
    {
        "author": "your_dog_is_lonely",
        "body": "&gt; When I hear \"iS BitCoiN AbLe tO BuY My CoFFee?\" I instantly know they dont understand bitcoin, the block size the mining time or the fee's.\n\nI hold a small amount of my investments in bitcoin (2.5%).  I completely 100% disagree with this statement of yours.  You see I purchased my bitcoin right after the big crash once I learned about the lightning network.  The lightning network made me say \"yes, this technology has promise.\"\n\n\"Is bitcoin able to buy my coffee\" is EXACTLY the correct question to ask.  Second layer drops fees and wait time down to nearly free and instantaneous.  Businesses setting themselves up to accept bitcoin via secondary layers is trivial vs getting credit card and other payment systems setup (all you need is a phone an internet connection and some know how. It can be done in less than 25minutes).\n\nThe ONLY thing holding bitcoin back is the volatility (that said, volatility is spurred by risk w.r.t. legal systems and wide market adoption).  If we knew that bitcoin was a stable and assured store of value, actually exchanging goods and services for it is extraordinarily simple.  And thus, why the hell not exchange coffee for bitcoin?\n\nIf a coffee shop can be assured that they can buy their beans for a set amount of bitcoin, and this set amount will remain the same tomorrow, next week, and next month; then they can sell their coffee products for a stable set amount of btc.\n\nOnce bitcoin has a stable set value, then there is no reason NOT to exchange coffee for bitcoin, and thus \"Can I buy my coffee with bitcoin?\" is precisely the question to ask.  Bitcoin is speculative until it's a stable store of value, and once it's a stable store of value you'll be able to buy coffee with it.\n\n&gt; I need to transfer 300,000 dollars worth of bitcoin\n\nBut you can't transfer $300k worth of bitcoin.  You can transfer what you THINK is $300k today, but you cannot be assured that tomorrow it will be $300k, nor can the person on the receiving end \"withdraw\" that $300k quickly.  EG If you sent me 30BTC right now, I couldn't immediately exchange it for my local currency, it would probably take me a few years and be quite the hassle.  Thus you THOUGHT you sent me $300k, but you actually sent me $100k, or maybe $750k.  However, once I can exchange bitcoin for a coffee, then I have no reason to transfer it into my local currency, I'll just spend it as it is.\n\nYou see, it's a tautology.  Once bitcoin has value, I can spend it, but I can't spend it until it has value.  Thus \"Can I buy my coffee with bitcoin\" is precisely the correct question to ask.",
        "created_utc": 1591041408,
        "id": "fsk5dk6",
        "score": 6,
        "subreddit": "investing",
        "created": 1591070208.0
    },
    {
        "author": "vancitydani",
        "body": "Is anyone buying actual stocks for anything right now?",
        "created_utc": 1591048596,
        "id": "fskjzut",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591077396.0
    },
    {
        "author": "Dansk_Arsenal2",
        "body": "No such thing as unemployment.  They’re all employed as looters now.",
        "created_utc": 1591047576,
        "id": "fskhyiv",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591076376.0
    },
    {
        "author": "spyaintnobitch",
        "body": "My 5 TSLA 875c bought at open are now up 100%. Fully cooked and time to cash out",
        "created_utc": 1591039009,
        "id": "fsk0ew2",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591067809.0
    },
    {
        "author": "slowand-old",
        "body": "DKNG EOD Facerippers are too predictable now",
        "created_utc": 1591040095,
        "id": "fsk2n3a",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591068895.0
    },
    {
        "author": "lame_irl",
        "body": "Wall Street never gave a fuck about the goings on of poors, why start now?",
        "created_utc": 1591042809,
        "id": "fsk891s",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591071609.0
    },
    {
        "author": "CommunismPanda",
        "body": "A) Is it seriously on the fucking ground right now?\n\nB) Get a bed skirt you fucking loser.",
        "created_utc": 1591037806,
        "id": "fsjxxh3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591066606.0
    },
    {
        "author": "thowthembowz",
        "body": "sentiment is now in greed territory. buy puts now.",
        "created_utc": 1591038599,
        "id": "fsjzkk8",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591067399.0
    },
    {
        "author": "Thales111",
        "body": "I’ve been a committed 🌈 bear for a few weeks now and have been able to stomach the small rallies... but I gotta admit, I am caught offguard here. Especially given what I see happening on the ground in my city.\n\nI guess with “buy when there’s blood in the streets” there’s an assumption that market prices will go down when that happens lmao",
        "created_utc": 1591029100,
        "id": "fsjfxcg",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591057900.0
    },
    {
        "author": "TheBelgianStrangler",
        "body": "Economic recession. Business is down, there's no money being loaned or spent, people holding cash etc,...\n\nThe movement of money has slowed a lot hence it's going up in value.\n\nWhy do you think the interest rates are 0% or in Europe they're even negative, it's to encourage taking up loans and getting that money moving in the economy/society. Low and negative rates are signs of deep economic recession, in my opinion it's only a matter of time before we are going to reflect on the stock market and again in my opinion it's going to be a hard hard drop. The speed at which the markets dropped in october 2018 and now in march were just warning signs.",
        "created_utc": 1591039254,
        "id": "fsk0wup",
        "score": 6,
        "subreddit": "stocks",
        "created": 1591068054.0
    },
    {
        "author": "JefBezosExWifesNewBF",
        "body": "My cock is enormous right now",
        "created_utc": 1591029764,
        "id": "fsjh9at",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591058564.0
    },
    {
        "author": "Arrrrrrrrrrrrrrrrrpp",
        "body": "Thank goodness the protests started on the weekend so we could have a green Monday. \n\n*Stocks surge as protests are now slightly less violent*.",
        "created_utc": 1591029512,
        "id": "fsjgr10",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591058312.0
    },
    {
        "author": "br0botic",
        "body": "LULU is now trading at over 40B in mkt cap. That is 10x sales with PE nearing 60. For an apparel retailer. Fucking madness",
        "created_utc": 1591029961,
        "id": "fsjhnrw",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591058761.0
    },
    {
        "author": "OnceALoser",
        "body": "that guy on cnbc says that some people are just misbehaving. hmm. didnt know looting has a new synonym now.",
        "created_utc": 1591034298,
        "id": "fsjqlnh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591063098.0
    },
    {
        "author": "bpotts2",
        "body": "I wouldn’t consider myself a “whale” but I have 15,000 shares. I’m not selling on the 15th or anywhere near there. I also got in early and could take a decent profit right now.",
        "created_utc": 1591049721,
        "id": "fskm68y",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1591078521.0
    },
    {
        "author": "ORANGE420MAN69BAD",
        "body": "DRAFTKINGS IV is so gay. At $43 I was making $50 at 10am. $43 now I’m -$20",
        "created_utc": 1591039898,
        "id": "fsk28oc",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591068698.0
    },
    {
        "author": "v-shizzle",
        "body": "the MC just straight up said Why are we doing this in the rose garden right now?",
        "created_utc": 1591051268,
        "id": "fskp4qo",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591080068.0
    },
    {
        "author": "7omdogs",
        "body": "In the late 90’s and early 00’s it was something for China to learn from. A free capitalist city, with all the gdp growth that entails. China then took this model, spread it to other Chinese cities to create free economic zones. These then along with HK helped fuel china’s growth. \n\n\n\nWhen China took over HK it was 25% of china’s gdp.\n\n\nToday it’s 2%. That’s why all this is happening now, China no long needs Hong Kong.",
        "created_utc": 1591040569,
        "id": "fsk3miu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591069369.0
    },
    {
        "author": "tommy1010",
        "body": "If you go buy DKNG 6/19 $50c right now before close, you will be rich in 2 weeks. [Please believe me!](https://youtu.be/Unzsc7O6Q-A)",
        "created_utc": 1591041074,
        "id": "fsk4ohz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591069874.0
    },
    {
        "author": "AceVonSpades",
        "body": "Haha, now that wouldve been embarrassing",
        "created_utc": 1591048625,
        "id": "fskk1x1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591077425.0
    },
    {
        "author": "FerdTurgerson",
        "body": "The power of the Fed:\n\nWe were last at these levels (SPX) in early November.  There was nearly full employment, trade agreement nearing completion and a relatively stable global political environment.\n\nNow - roughly 20% unemployed, trade war 2.0 potentially unfolding and global GDP taking it directly in the nuts.\n\nBetting against this market is like trying to swim up a waterfall.  There is a never ending supply of cheap money that will funnel its way into equities.",
        "created_utc": 1591031312,
        "id": "fsjkf4c",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591060112.0
    },
    {
        "author": "lilfianchetto",
        "body": "texting him now HAHA, good point.",
        "created_utc": 1591043191,
        "id": "fsk9192",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591071991.0
    },
    {
        "author": "Junkbot",
        "body": "So is the Daily thread a lost cause now?",
        "created_utc": 1591028557,
        "id": "fsjeu2t",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591057357.0
    },
    {
        "author": "wdcvvv",
        "body": "FB saved my portfolio today. Now it’s time to go to 250!",
        "created_utc": 1591047338,
        "id": "fskhhfv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591076138.0
    },
    {
        "author": "samdevia",
        "body": "Nope bought at 4.20 sitting on 2.20 now",
        "created_utc": 1591045668,
        "id": "fske3rm",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591074468.0
    },
    {
        "author": "Kaith8",
        "body": "I actually made back everything I lost since starting in late March thanks to CRM, FB, WORK, a little DKNG, KOS, and CRWD. Now that earnings season is winding down tho I have literally no idea what my next move will be. I don’t wanna yolo now that I’ve made it all back. Wanna see real gains. But no idea where to go that was as successful as these last 3-4 days. This sucks.",
        "created_utc": 1591043918,
        "id": "fskaipz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591072718.0
    },
    {
        "author": "atlfirsttimer",
        "body": "Cant think of a single thing Trump could say right now that would benefit anyone. Should just cancel his conference so I can keep riding my calls",
        "created_utc": 1591033972,
        "id": "fsjpxae",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591062772.0
    },
    {
        "author": "washusha",
        "body": "I’d sell now if I were you.",
        "created_utc": 1591040352,
        "id": "fsk36a2",
        "score": 5,
        "subreddit": "stocks",
        "created": 1591069152.0
    },
    {
        "author": "_No_Donkey_Brains_",
        "body": "Buy gold! Chaos is here! Buy my gold coins now!",
        "created_utc": 1591041979,
        "id": "fsk6jrt",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1591070779.0
    },
    {
        "author": "dawhizkid123",
        "body": "FB employees are having a moral crisis on Twitter. \n\nRealizing they are Goldman Sachs now 😂",
        "created_utc": 1591041984,
        "id": "fsk6k4d",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591070784.0
    },
    {
        "author": "cheezor42",
        "body": "Y’all the 100k in physical gold and silver I bought in 2019 is lookin real nice these days.  Everyone I know laughed at me too, now I’m selling these suckers silver one ounce coins at a 5 dollar premium over spot.",
        "created_utc": 1591036984,
        "id": "fsjw7ht",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591065784.0
    },
    {
        "author": "Flacko135",
        "body": "Idk bout July. Sell now in June and buy back in on the dip.",
        "created_utc": 1591032633,
        "id": "fsjn544",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1591061433.0
    },
    {
        "author": "burrowed_greentext",
        "body": "Trump's gotta be doing that Gavin Belson scene every day during these riots\n\n*You know, 200 years ago people like ME could have people like THAT killed! Ah, but we live in better times now... Unless?*",
        "created_utc": 1591035625,
        "id": "fsjtd12",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591064425.0
    },
    {
        "author": "Captain_Nipples",
        "body": "I did that with some shit company and their shares dropped 50%. So, I made like 100 bucks on the Calls and lost like 400 on shares..\n\nThe price did come back up tho.. So I'm slightly ahead now",
        "created_utc": 1591034470,
        "id": "fsjqyiv",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591063270.0
    },
    {
        "author": "an2200",
        "body": "SPY puts now and sell EOD?",
        "created_utc": 1591035334,
        "id": "fsjsqp3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591064134.0
    },
    {
        "author": "burrowed_greentext",
        "body": "Yes now calculate both A and B properly and you'll receive a Nobel Prize",
        "created_utc": 1591036492,
        "id": "fsjv68c",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591065292.0
    },
    {
        "author": "FFW3",
        "body": "That was the pullback, load to the tits on calls now...",
        "created_utc": 1591036385,
        "id": "fsjuy95",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591065185.0
    },
    {
        "author": "Khalian",
        "body": "Brah, this bitch has inexplicably been on an untested, unabashed moon mission for a straight month now. Every .01% drop is a big deal in this era of \"fun printer money, spy never ever goes down, its illegal for it to go down, brrrrr\"\n\nIt pisses me off because I can't fucking buy calls in good faith at these prices and buying puts a fuckin suicide mission every time",
        "created_utc": 1591036204,
        "id": "fsjukqj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591065004.0
    },
    {
        "author": "elusive_crawfish",
        "body": "God, calls are so easy right now. I know a red day has to happen but that shit is hard to time.",
        "created_utc": 1591037157,
        "id": "fsjwkfm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591065957.0
    },
    {
        "author": "bootyloverz31",
        "body": "DGLY dumping right now",
        "created_utc": 1591038118,
        "id": "fsjyl18",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591066918.0
    },
    {
        "author": "bzboy",
        "body": "OK, NOW I'm upset that I sold my TSLA calls this morning.",
        "created_utc": 1591039589,
        "id": "fsk1lsp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591068389.0
    },
    {
        "author": "TonguePressedAtTeeth",
        "body": "Heard the Rolex store on 5th ave was looted.  They contacted my company for barriers.  Now that’s a smart looter!",
        "created_utc": 1591051336,
        "id": "fskp9dm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591080136.0
    },
    {
        "author": "stonkdropandroll",
        "body": "We literally have the biggest fucking fragile-ego orange fuck of a tyrant for a president right now. Jesus this country is pathetic",
        "created_utc": 1591051447,
        "id": "fskpgwj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591080247.0
    },
    {
        "author": "dontlookup25",
        "body": "We are now China.",
        "created_utc": 1591051778,
        "id": "fskq38v",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591080578.0
    },
    {
        "author": "diabeetusboy",
        "body": "I bought calls on ULTA at $200, CLDR at $9, SMAR at $50, BABA at $198 and JD at $49. \n\nI am now loading up on SNX calls for earnings. Do with this information what you will.",
        "created_utc": 1591045287,
        "id": "fskdbxp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591074087.0
    },
    {
        "author": "Jay0903",
        "body": "My friend just sold his DKNG , now we go up lmaooo let’s go guys!!!",
        "created_utc": 1591040048,
        "id": "fsk2jol",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591068848.0
    },
    {
        "author": "nobodynobody567",
        "body": "Yup nothing special.\n\n1. Cdn banks still in the channel. We see TD looking good here relative to others. Bns not coming up as strong but they are just lagging. Will catch up. \n\n2. It's June now. Need to see how volumes will form.\n\n3. Current events is so odd. We been complaining how everyone should be coming out of their homes. And now many people are coming out but government implementing a curfew. Overall these are small events in terms of economy, still need people going to work, spending money, building things, etc. \n\n4. Rant about the social divide. The numbers I'm seeing on the fundamental side are terrible over 40 mill unemployed. I don't think the rate in which people go back to work will effect stock prices. But society is  hurting. My guessimation is 40 / 170 mill working people under employed so daddy not bringing home the bacon means the poorer segment of the population hurting. Kids are going hungry. \n\nThe rich on the other hand have an opportunity to buy into the rebound and the top 10-15% of the population will get solid returns 10%-20%+ on their piles of money. The more the government prints the money goes into stock markets. They need to print a lot more to feed the other 30-40% that are going hungry and it'll go into paying rent keeping housing prices maybe only 10% down across the board. \n\nNew companies will emerge. And old companies like Disney will redo their business and I don't know what they going to do with Disney Land charge $200 a person due to less people no idea. Redo the park for half the visitors and sell a weeklong pass (basically for rich people) for $500 for a week.\n\nAnyway I digress this is a technical analysis forum. \nBut there's alot of pain out there.",
        "created_utc": 1591048203,
        "id": "fskj7jr",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1591077003.0
    },
    {
        "author": "carlians",
        "body": "43 is now a support?🤔",
        "created_utc": 1591032508,
        "id": "fsjmvum",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591061308.0
    },
    {
        "author": "Isuckatfantasy0",
        "body": "Sold everything and went all cash today. Honestly have no idea about this market right now.",
        "created_utc": 1591042278,
        "id": "fsk75v7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591071078.0
    },
    {
        "author": "BigTanVan05",
        "body": "Yep.  The value of money changes, even though 1USD = 1USD.   Since there is a greater supply of money right now, the dollar isn’t worth as much as it was before.  So before when you’d buy a stock for $100, now you have to pay $120 for it.  \n\nWhich sounds good if you’re the one who is selling the stock.",
        "created_utc": 1591042642,
        "id": "fsk7wm9",
        "score": 4,
        "subreddit": "stocks",
        "created": 1591071442.0
    },
    {
        "author": "theohellos",
        "body": "That’s been the rule for a couple months now",
        "created_utc": 1591031422,
        "id": "fsjkncy",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591060222.0
    },
    {
        "author": "MartinePorteLaBurka",
        "body": "The \"rising waves pattern\" seems to have completely disappeared since mid-may. Now markets are just straight up, with not a single small pull back.",
        "created_utc": 1591031451,
        "id": "fsjkpjn",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591060251.0
    },
    {
        "author": "YOLOingMyKidsSavings",
        "body": "To answer your question:\n\nThat's kind of where the fun is, right? Not really knowing for sure which company they will go after. Maybe it is Beyond Meats, and then it will be Beyond AND FMCI rather than Beyond VS FMCI. Kinda see what I'm getting at? \n\nMy main point is that FMCI is 100% worth looking into and forming your own ideas. And like I was saying before, the best part is that it is still pretty early - things are cheap, but they are beginning to move now. \n\nUltimately, I think to understand better what is going on here with FMCI, your best bet is to hit the books and read into what it means to be a \"SPAC.\" VTIQ is a SPAC as well as FMCI is too.",
        "created_utc": 1591044279,
        "id": "fskb98r",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591073079.0
    },
    {
        "author": "dyl3456",
        "body": "REZI calls very cheap right now now that they've pulled back a bit after going up nearly 40% this past month.... This security company is a former Honeywell subsidiary that is very undervalued and riot tailwinds have not yet been priced in\n\nDetailed investment thesis below for why I love them so much:\n\nhttps://www.reddit.com/r/wallstreetbets/comments/gulzhm/rezi\\_severely\\_undervalued\\_security\\_industry/",
        "created_utc": 1591030511,
        "id": "fsjis6j",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591059311.0
    },
    {
        "author": "GatorMD12",
        "body": "ZOOMMMMMMMMMMMMMMMMMM!   breaking the market right now LOL",
        "created_utc": 1591029008,
        "id": "fsjfqpr",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591057808.0
    },
    {
        "author": "zangor",
        "body": "My DOCU 190c 07/17 were 0.40 last week. \n\nNow they are 2.48. \n\nI don’t think I ever would have had the thought “I should buy more of this”.",
        "created_utc": 1591029844,
        "id": "fsjhf7m",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591058644.0
    },
    {
        "author": "mke1996",
        "body": "On feburary 26, jim cramer said disney will never go above 115 for the rest of the year\n\nWho's laughing now dickhead",
        "created_utc": 1591029918,
        "id": "fsjhko4",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591058718.0
    },
    {
        "author": "the_heat_waver",
        "body": "The printer must have some smoke coming out of it about now",
        "created_utc": 1591047128,
        "id": "fskh22y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591075928.0
    },
    {
        "author": "SolitaryEgg",
        "body": "Honestly my worldview is shooketh.\n\nThe people who were calling stay-at-home orders government tyranny a week ago are now the ones praising curfews and cheering on the military flooding American streets.\n\n\nAnd, the ones who were on social media shaming people for going outside and spreading rona are now the ones crowding into mobs and pretending like the virus doesn't matter.\n\n\nLeft, right... Who gives a shit? It's like fucking no one, on either side, has a fucking ounce of sincerity or conviction anymore. We're all just a bunch of fucking ADD bitchboys shouting endlessly into the internet void, searching for a small dopamine hit, and getting stupider by the day.\n\n\nPuts on humanity.",
        "created_utc": 1591075873,
        "id": "fsluxog",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1591104673.0
    },
    {
        "author": "huy90_",
        "body": "This sub is so useless now.",
        "created_utc": 1591149657,
        "id": "fspaman",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1591178457.0
    },
    {
        "author": "bobstaman",
        "body": "Just a heads up to everyone. Don't make plays just to make a play. It's ok to weigh it out or just go with a different trade for now. Making a bad trade is worse than not making a trade.",
        "created_utc": 1591063542,
        "id": "fslbgms",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1591092342.0
    },
    {
        "author": "HoosierPride",
        "body": "The whole country has 3 stars right now",
        "created_utc": 1591069487,
        "id": "fsllh4v",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1591098287.0
    },
    {
        "author": "xGOXSTRAPx",
        "body": "You can tell everyone is over leveraged when a -0.7% move is now a \"dump\"",
        "created_utc": 1591043426,
        "id": "fsk9ii6",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1591072226.0
    },
    {
        "author": "dog34421",
        "body": "Its pretty amazing how wsb went from 80% gay bears at the March bottom buying puts the DAY OF THE BOTTOM to 100% mindless bulls now buying calls and assuring other fucking idiots yes its the time to go all in long.",
        "created_utc": 1591048135,
        "id": "fskj2nf",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1591076935.0
    },
    {
        "author": "iluvairforcealotalot",
        "body": "Time to buy puts now, thanks",
        "created_utc": 1591035972,
        "id": "fsju358",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1591064772.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "Dude...  I've heard of more layoff and paycuts in the last week than I think I have ever...  With shit now reopen!\n\nThis is probably what the start of a depression looks like.\n\nSPY 345c",
        "created_utc": 1591132642,
        "id": "fsoeu73",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1591161442.0
    },
    {
        "author": "nightjar123",
        "body": "This post is now on the Reddit front page. So it will be taken down soon.",
        "created_utc": 1591140672,
        "id": "fsoukdk",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1591169472.0
    },
    {
        "author": "TheOri0",
        "body": "Yeah there is no motivation for savers right now....interest is terrible. Literally no other place to put your $ and add on to that everyone is stuck at home in front of their PCs.\n\nPerfect storm for a stupid illogical squeeze upward.",
        "created_utc": 1591058708,
        "id": "fsl2uex",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1591087508.0
    },
    {
        "author": "knicksAHgoat",
        "body": "DKNG\n\nupvote me now",
        "created_utc": 1591146248,
        "id": "fsp4mgt",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1591175048.0
    },
    {
        "author": "scopolamine",
        "body": "The Bull Case is now \"the Fed is completely insane.\"  It's not a bad case.",
        "created_utc": 1591043820,
        "id": "fskabfm",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1591072620.0
    },
    {
        "author": "the_heat_waver",
        "body": "That empty podium at the White House sums up our leadership right now.",
        "created_utc": 1591035080,
        "id": "fsjs7ob",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1591063880.0
    },
    {
        "author": "Cynikal818",
        "body": "I got banned from /news for posting a similar video to this one in the mega thread. Just posted the link, nothing else\n\nGot banned for racism. Idk how that even makes sense.\n\nThis website is such fucking trash now",
        "created_utc": 1591142137,
        "id": "fsox9of",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1591170937.0
    },
    {
        "author": "burrowed_greentext",
        "body": "In a world of instant gratification only now u can see who got caught up in the easy dopamine hits and is out of touch when easy dopamine goes away.\n\nChase happiness and cling to it with ur fucking last breath. Turn off the fuckin news and play that videogame u haven't played in a while. Call up that girl u like and write ur fuckin love story with the world as ur witness.\n\nU think those fucking Syrian children getting acid-bombed or those women in Iran getting mutilated and gang raped would give up and roll over in America rn?\n\nNah man fuck that shit. If ur sad because some shit is getting broken go watch fuckin Saving Private Ryan and watch all those fucking 18yo's get fucking obliterated the moment the boat doors opened up. That's some real disastrous, horrific shit worth being shell-shocked over, not some glass on the streets or cars on fire cuz some dudes be pissed that their skin color brings them absolute hell in this country sometimes.\n\nA whole bunch of poor, beaten-down-and-tossed-aside Americans are bearing their teeth. Fuck it if their methods suck ass that's still some bald-eagle ass spirit knowing any of these fuckin cops could end their lives in a heartbeat and they'd become another number and name on a sign.\n\nIf ur fuckin sad rn get the fuck off this sub, save some money, go take a fucking roadtrip tomorrow and see this beautiful nation for what it is, beyond whatever bullshit ass short term shit we in right now.",
        "created_utc": 1591070156,
        "id": "fslmk6o",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1591098956.0
    },
    {
        "author": "RyFba",
        "body": "That was his risk tolerance now quit with the dumbass questions",
        "created_utc": 1591128950,
        "id": "fso71wi",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1591157750.0
    },
    {
        "author": "PaperShark0001",
        "body": "If this gets 5 downvotes, 5 upvotes, or an award i will go on my run 😤\n\nEdit: gonna go run now; went from a half marathon is ok to struggling to run a mile.\n\nYesterday was a mile, today is 1.5",
        "created_utc": 1591118832,
        "id": "fsnleye",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1591147632.0
    },
    {
        "author": "kokeboka",
        "body": "I used to work in a major music studio in London. The public perception of the worth of music has changed. Anyone can stream nearly anything for free or very cheap subscriptions. 30 years ago you had to spend 10-20 dollars to buy one album, nowadays that seems like an absurdity to the average consumer. Ease of access means there is now a panoply of genres and bands. Artists have bypassed large studios and large labels because technology now allows them to record at home with a little investment in equipment, self-publish and promote their work through sites like bandcamp, soundcloud and social media in general. Labels used to be the great gatekeepers and help fund recording sessions; that's not how the industry works anymore. I love music, but I don't think the future of the industry will be as profitable as it used to be, by a long shot.",
        "created_utc": 1591128854,
        "id": "fso6uiy",
        "score": 19,
        "subreddit": "stocks",
        "created": 1591157654.0
    },
    {
        "author": "VladdyGuerreroJr",
        "body": "So a reality TV star became president, and is now deploying the military to end unrest, while the worst pandemic in 100 year spreads around the world, and the economy contracts the most since the great depression.\n\nSo stocks closed green. Again.",
        "created_utc": 1591063451,
        "id": "fslbaye",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1591092251.0
    },
    {
        "author": "Trinity0519",
        "body": "Makes the decision easy for Trudeau now because there's no decision to make. The big 3 Telcos chose other companies on their own.",
        "created_utc": 1591121767,
        "id": "fsnrmn1",
        "score": 19,
        "subreddit": "CanadianInvestor",
        "created": 1591150567.0
    },
    {
        "author": "d4ng3rz0n3",
        "body": "Actually no, They expire in 17 days and there is now 399,692 open interest.",
        "created_utc": 1591144702,
        "id": "fsp1vle",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1591173502.0
    },
    {
        "author": "elld",
        "body": "Am I the only one who - once I've watched a porn scene and jerked off to it.... I refuse to ever jerk off to it again.\n\n\nI don't know why? It's like yeah I've shot my load to her on that scene, now it's useless shit to wank over. Do porn companies rely on people like me?",
        "created_utc": 1591077920,
        "id": "fslxn7f",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1591106720.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "I bet you are racist towards Chinese people now.",
        "created_utc": 1591128757,
        "id": "fso6n2q",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1591157557.0
    },
    {
        "author": "orangehorton",
        "body": "they own a lot of record labels.. do you think record labels dont get money when we stream on spotify???\n\nand how is music on the decline? there are more artists now than ever before and  they are more easily accessible",
        "created_utc": 1591125601,
        "id": "fsnzteo",
        "score": 18,
        "subreddit": "stocks",
        "created": 1591154401.0
    },
    {
        "author": "ScaryPillow",
        "body": "Who cares about what the market price is right now? Remember you are buying parts of businesses. If Mr. Market comes to your door daily and says I'm selling X business for Y dollars. If it doesn't make sense to buy that business because it won't earn enough money for you, then you don't buy it. Who cares if Mr. Market keeps quoting you higher prices every day and laughs saying 'you should've bought yesterday'. If he's offering you a shit business at a shit price, then Mr. Market can go stuff himself.",
        "created_utc": 1591142008,
        "id": "fsox19b",
        "score": 18,
        "subreddit": "investing",
        "created": 1591170808.0
    },
    {
        "author": "racerxff",
        "body": "Every other stock on your watchlist, now that you have no available funds to trade with: \"NOOT NOOT\"",
        "created_utc": 1591055290,
        "id": "fskwmzi",
        "score": 17,
        "subreddit": "pennystocks",
        "created": 1591084090.0
    },
    {
        "author": "uniaintshit",
        "body": "When I bought bitcoin everyone laughed at me because I have a small dick, but whose laughing now?",
        "created_utc": 1591053895,
        "id": "fsku2os",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591082695.0
    },
    {
        "author": "ArsonDub",
        "body": "The virtue signalling going on ig right now is unreal",
        "created_utc": 1591112208,
        "id": "fsn7lc9",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591141008.0
    },
    {
        "author": "Greenman_on_LSD",
        "body": "This used to be a sub of autists. Now it's just retards.",
        "created_utc": 1591129994,
        "id": "fso99zw",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591158794.0
    },
    {
        "author": "buildapchelper",
        "body": "Unpopular opinion but there is no such thing as a peaceful protest right now. The instigators are lumped in with the peaceful folks and all it takes is 1 bad apple for the entire thing to turn south. That bad Apple ALWAYS happens.",
        "created_utc": 1591053357,
        "id": "fskt2gm",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1591082157.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "The Stages of Reopening (update):\n\nWeek 0 - Excitement - \"OMG we're back!!\"\n\nWeek 1 - Euphoria - \"SPY 300+, I heard there's lines at some place!! V-shaped recovery!!\"\n\nWeek 2 - Realization - \"hindsight, lockdowns were stupid. Probably caused more harm than it prevented\"\n\nWeek 3 - Concern - \"okay the lines are shorter now, I participated in going out, it was meh.. it was slow and awkward, maybe it comes back?\"\n\n* Most of you are here (now with rioting)\n\nWeek 4 - Growing Concern - \"These places are empty... How are they going to make it on 25% capacity, assuming they're even seeing that? No one is getting rehired, in fact they'll probably need to let more go.\"\n\nWeek 5 - Full Bear - \"Okay, this is slower than I remember 2009 being. I don't think it's bouncing back. SPY levels totally not sustainable, WTF were we thinking!?!\"\n\nWeek 6 (**New**) - Joining the Poors - \"I thought my white collar job was safe, but the company is being more dick now than they were when we were under lockdown.  I think they retained people just to cultivate good PR during the crisis, but are ready to release employees\"",
        "created_utc": 1591043627,
        "id": "fsk9x64",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1591072427.0
    },
    {
        "author": "AveenoFresh",
        "body": "What autists are buying ZM shares right now?",
        "created_utc": 1591138947,
        "id": "fsoriu1",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1591167747.0
    },
    {
        "author": "ch1p_skylark",
        "body": "Protesters are gona pee their pants and go home now. I'm calling it.\n\nThe fun is over, bear gang going back on lockdown to stare at their -99% robinhood accounts.",
        "created_utc": 1591052285,
        "id": "fskr212",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591081085.0
    },
    {
        "author": "Sam_Handwich69420",
        "body": "Now we’re seeing all these companies putting out PSA’s against police brutality bc that’s what’s hot right now. I hate politics. SPY 315",
        "created_utc": 1591060708,
        "id": "fsl6eoe",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591089508.0
    },
    {
        "author": "w1na",
        "body": "She did a good job, no one could even imagine even 5 years ago where AMD would be today.\nWhen she took office, the cupboard were bare, there was no sales, no good architecture, losing for 2 decade to intel. Since the first athlon x64, they kept releasing bad products most of the time. In just 3 years, she made AMD go from Zero to Hero!\n\nAMD now trading at tremendous numbers, no one thought would be possible ever. Heck just look 7 years back, the share price was about 2 bucks.\n\nIf there is any CEO who you feel should earn so much, it’s not people from Moderna, but Lisa Su.\n\nJust to give you an idea, back in 2014 or so, I remember trying to buy AMD shares under 2 euros each (I wanted to get 2000 euro), before the order went through, it asked me for some paperwork confirmation, I then did not go through with the order and never did.\n\nMissed on 1000 shares from AMD. I did not believe back then, although I saw it was incredibly cheap.",
        "created_utc": 1591071652,
        "id": "fslovb3",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591100452.0
    },
    {
        "author": "BenjiWon",
        "body": "We sure haven't had a red day in a while... \\*tumbleweed rolls by\\* Should be coming any day now... \\*looks into the sunset as protfolio burns\\*",
        "created_utc": 1591047133,
        "id": "fskh2fj",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591075933.0
    },
    {
        "author": "orrangearrow",
        "body": "Listen. War is Bullish. And if we have war on our own soil, it's incredibly bullish. Weapons can be manufactured Monday and used on American citizens on Tuesday. The potential efficiency is incredible. Buy calls now or you'll always wonder what if.",
        "created_utc": 1591146492,
        "id": "fsp51np",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591175292.0
    },
    {
        "author": "mattyfinna",
        "body": "Initial investment was about 2% of my portfolio, now its over 25%",
        "created_utc": 1591131175,
        "id": "fsobs45",
        "score": 15,
        "subreddit": "StockMarket",
        "created": 1591159975.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "Lol. \n\nTeam members,\n\nI'm heartbroken about these protests \n\n\nNow I need everyone to give 18384848 percent. Hustle. No sleep. YOU ARE THE COMPANY\n\nhugs and kisses- chad",
        "created_utc": 1591067097,
        "id": "fslhis5",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591095897.0
    },
    {
        "author": "MmmDarkMeat",
        "body": "What would really calm down these protestors now is a capital gains tax suspension on assets bought between now and the end of the year.",
        "created_utc": 1591141573,
        "id": "fsow86b",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1591170373.0
    },
    {
        "author": "peppercupp",
        "body": "Heard a loud bang from the backyard, now there are a bunch of sirens. If I die, give my portfolio to haupt.",
        "created_utc": 1591053847,
        "id": "fsktzia",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591082647.0
    },
    {
        "author": "ClothedKing",
        "body": "Haha this is definitely what i will do from now on",
        "created_utc": 1591061325,
        "id": "fsl7ifv",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591090125.0
    },
    {
        "author": "smiling_stranger",
        "body": "I dont get it. I get taught to fight and rebel in school by our founding fathers, i buy the guns 🔫🔫, the flag🇺🇸🇺🇸🇺🇸, the home🏘️, pay my taxes, dont want cops killing me or you and now im unamerican? You taught me this. USA USA!\n\nSBWI DKNG🌝🌝🌝",
        "created_utc": 1591061844,
        "id": "fsl8g65",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591090644.0
    },
    {
        "author": "dephlepid",
        "body": "Yeah. This person is relying on second hand info and media. \n\nUber is NOT a self driving play, Uber has not said they need self-driving to profitable. Dara has said repeatedly that autonomous is a long way away and they don’t need nor expect to be leaders in this technology. The ride sharing business is profitable. Also, ATG is now financed via outside investors.",
        "created_utc": 1591128262,
        "id": "fso5kqa",
        "score": 14,
        "subreddit": "investing",
        "created": 1591157062.0
    },
    {
        "author": "The_Collector4",
        "body": "“I am going to stand up for my beliefs and delete Facebook! From now on I’m only using Instagram.”",
        "created_utc": 1591149038,
        "id": "fsp9jb5",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591177838.0
    },
    {
        "author": "DeliciouslyUnaware",
        "body": "Okay now replace Biden with Clinton and this is exactly how 2016 went",
        "created_utc": 1591034706,
        "id": "fsjrg0h",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591063506.0
    },
    {
        "author": "psiguy686",
        "body": "It will only take a single -6% day to blow up 80% of the accounts in this sub right now.",
        "created_utc": 1591054695,
        "id": "fskvjr1",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591083495.0
    },
    {
        "author": "IronManKillsThanos",
        "body": "I was comparing inflation over the years and found some pretty depressing numbers. \n\nBrand new mustang was $3k in the 60s when minimum wage was $1. 3000 hours of work for a new car.\n\nNew mustang now starts at $35k and minimum wage is $7.25. 4800 hours of work now.\n\nYou don't want to know housing.",
        "created_utc": 1591070444,
        "id": "fsln0gb",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591099244.0
    },
    {
        "author": "galivet",
        "body": "A company splits its stock to increase liquidity.\n\nConsider Berkshire Hathaway, with a share price north of $250K. If a shareholder needs to liquidate enough stock to raise $100K, they can't do it without selling more than twice that value of BRK-A. So maybe they'll pick something else to sell instead that's more right-sized for the amount of money they need. Now consider an individual investor with \"only\" $100K to invest. That person can't buy even one share of BRK-A. In both cases, the high share price discouraged investors from trading the stock -- it inhibits liquidity. If BRK-A did a 3-for-1 stock split then those two investors could work out a trade with each other.\n\nThere are three reasons companies don't split stock:\n\n1. They feel it's prestigious to have a high per-share stock price.\n2. They prefer having lower liquidity because it causes the population of investors holding your shares to trend toward being wealthier and trading less frequently. That can provide greater stability for the stock price in normal times.\n3. Splitting the stock isn't free. It requires you to pay lawyers, publish notifications to shareholders, and so on. Companies prefer not to incur expenses without a clear payoff.\n\nEDIT: I guess I'll also explain why a company might like a more liquid stock. A more liquid stock will track more closely to its true market value. A low-liquidity stock can drop in price very sharply if it's hard for buyers to purchase it. Go back to that investor who needed to raise $100K. Now suppose that guy **ONLY** has BRK-A and he **HAS** to sell it. Because of the high share price, there's a smaller pool of investors who have the money to buy it from him. Desperate seller + small buyer pool means that seller can get screwed. Maybe in desperation he'll sell for $200K instead of the $250K+ the stock is worth... well then the market sees **ALL** of those shares as worth only $200K and the share price plummets. Now of course the price isn't really determined by what one guy does, but in a crisis a lot of sellers can find themselves in the same boat and it can happen.\n\nThis kind of liquidity problem is why the US Fed recently started buying up bond ETFs -- desperate sellers + small buyer pool would have put the price of those bonds through the floor *even though the bonds are actually still valuable* had the Fed not stepped in. Because the Fed has the money to buy anything, it can buy those bonds at a normal market price from anyone and let the price decline in a less terrifying way for everyone involved. When analysts talk about the Fed \"providing liquidity,\" this is what they mean.",
        "created_utc": 1591061657,
        "id": "fsl841m",
        "score": 14,
        "subreddit": "investing",
        "created": 1591090457.0
    },
    {
        "author": "the-faded-ferret",
        "body": "I posted a black square on my Instagram the riots can stop now I have cured racism",
        "created_utc": 1591135675,
        "id": "fsol30m",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591164475.0
    },
    {
        "author": "AllahuCakebar",
        "body": "these looters are legit incredibly stupid. Why wouldn't you be wearing masks?! It's perfectly normal to be wearing masks right now so it's not like wearing one will make you suspicious... \n\nboy these people are fucking up their lives... even if they don't get caught right now the police will track them down eventually. or who knows in 3 years the police starts using facial recognition technology and tracks down all the past rioters.",
        "created_utc": 1591062610,
        "id": "fsl9tcb",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1591091410.0
    },
    {
        "author": "Patriotnation5",
        "body": "Jesus downtown DC is in better shape than this thread right now.",
        "created_utc": 1591065608,
        "id": "fslf0l3",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591094408.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "Man, I love full telework. Trading has been so much more enjoyable and profitable. Do trading during real hours and fake gay work in the off hours. Now I just need to find a less expensive area to live in.",
        "created_utc": 1591048921,
        "id": "fskkmza",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591077721.0
    },
    {
        "author": "zjz",
        "body": "&gt;9/11 wasn't that bad\n\n+90000000000000000000000000 upvotes, three pages of reward emojis, circlejerk until the site can't handle the comment depth\n\n&gt;This one guy died because he had a heart attack not because black p-\n\nbanned, 0 upvotes, race war now\n\n\nsometimes I hate this website. this may be one of the only subreddits on Reddit that isn't a shithole country.",
        "created_utc": 1591036051,
        "id": "fsju94f",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591064851.0
    },
    {
        "author": "DoctorBalpak",
        "body": "The disconnect from reality right now is so insane in financial markets, that I am scared of the moment when it finally starts to happen and shit goes from 0 to 100 in no time without giving anyone a chance to smoothen the fall.",
        "created_utc": 1591147240,
        "id": "fsp6d1u",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591176040.0
    },
    {
        "author": "HinduHamma",
        "body": "How are this many people crying and whining about DKNG lmao?? It’s up over 100 percent in a matter of fucking weeks. Longs won big. Did everyone just now enter at 43 or something lolol!!??",
        "created_utc": 1591120813,
        "id": "fsnpm9k",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591149613.0
    },
    {
        "author": "JAnon19",
        "body": "Imagine how high stocks would be right now if trump didn't let the rona in",
        "created_utc": 1591065579,
        "id": "fsleyu1",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591094379.0
    },
    {
        "author": "nafinmasjid",
        "body": "you know, now that im a bull again it feels good to have papa powell on my side. \n\ni still will never forget two weeks ago when i had puts and got excited asf at 2 AM cause hangseng was down 5.8% and oil was down 8% and futures were -0.6%.\n\ni was the happiest bear ever. went to sleep feeling good. had the most amazing sleep in the past few months  knowing that tendies had been secured.\n\nwoke up to +1.1%.\n\ni will never forget that",
        "created_utc": 1591146220,
        "id": "fsp4kpa",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591175020.0
    },
    {
        "author": "ma____",
        "body": "I need JPow and Elon to livestream themselves helicoptering their cocks right now so TSLA opens above $1000. Please.",
        "created_utc": 1591146945,
        "id": "fsp5u6d",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591175745.0
    },
    {
        "author": "-Nostalgic-",
        "body": "I’m holding $2 of btc at $9,200 rn. Been making pennies by the minute. I’m at $2.19 now fucking amazing",
        "created_utc": 1591063820,
        "id": "fslby4z",
        "score": 12,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1591092620.0
    },
    {
        "author": "Ijustquaffed",
        "body": "Remember when 300 seemed crazy? Now it seems crazy we'll ever go back down to 300",
        "created_utc": 1591146438,
        "id": "fsp4y91",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591175238.0
    },
    {
        "author": "Dudebroha1",
        "body": "Dude, Sell that now.",
        "created_utc": 1591066351,
        "id": "fslg9ld",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591095151.0
    },
    {
        "author": "movn",
        "body": "Gotta hand it to you VTIQ guys. I wrote that shit off as a stupid pump a month back. I wasn’t autistic enough to realize the potential. Now time for you all to lose it on DIS puts",
        "created_utc": 1591046971,
        "id": "fskgqta",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591075771.0
    },
    {
        "author": "RamboWarFace",
        "body": "Imagine being the guy who bets against a dude who made a fuckin spaceship. If you think its too expensive to FOMO in now, wait till TSLA never sees sub 1000.",
        "created_utc": 1591045682,
        "id": "fske4s7",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591074482.0
    },
    {
        "author": "vl99",
        "body": "DKNG now down .02% \n\nMust be that mega dump in AH the bears have been crowing about.",
        "created_utc": 1591049367,
        "id": "fsklhxc",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591078167.0
    },
    {
        "author": "phyllisteak",
        "body": "A month from now: SPX crossed 4000 as investors hope the aliens will soon go away",
        "created_utc": 1591053319,
        "id": "fskszue",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591082119.0
    },
    {
        "author": "Harudera",
        "body": "Starting to get nervous with DKNG now that all you idiots are holding it...",
        "created_utc": 1591040716,
        "id": "fsk3xlm",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591069516.0
    },
    {
        "author": "LordMeatwich",
        "body": "For a while WSB was where I came to get a break from all of the awfulness. This place fucking blows right now.",
        "created_utc": 1591071277,
        "id": "fsloapg",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591100077.0
    },
    {
        "author": "LMY723",
        "body": "Anyone else in the 1am workout gang? I used to be fat so I got used to working out at night because of shame, now I’m skinny and it’s just habit.",
        "created_utc": 1591076564,
        "id": "fslvvf8",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591105364.0
    },
    {
        "author": "rahulshtv",
        "body": "Congrats. Now tendie train only. Godspeed",
        "created_utc": 1591059688,
        "id": "fsl4lrv",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591088488.0
    },
    {
        "author": "fin425",
        "body": "Kendall Jenner.....we fucking need you and Pepsi right now!!!!!!",
        "created_utc": 1591050843,
        "id": "fskobzv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591079643.0
    },
    {
        "author": "spyaintnobitch",
        "body": "These protests kinda played out now. The looting ruined it",
        "created_utc": 1591068060,
        "id": "fslj4mf",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591096860.0
    },
    {
        "author": "401klaser",
        "body": "DKNG has very good support at 40 right now if you look at the order books. if NBA announces restart on Thursday those calls should print. But I am also a complete retard so obviously that could be 100% false.\n\nDKNG 45c 6/5",
        "created_utc": 1591126889,
        "id": "fso2krt",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591155689.0
    },
    {
        "author": "Ajslick23",
        "body": "Profits are profits, always a good move, you got your money set in stone. However I do believe gnus will still continue going up, just not at the exponential rate it is now",
        "created_utc": 1591134788,
        "id": "fsojacy",
        "score": 11,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1591163588.0
    },
    {
        "author": "smallchimpu",
        "body": "Some bear mocked j pow at white house, now he banned red color",
        "created_utc": 1591037035,
        "id": "fsjwbbl",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591065835.0
    },
    {
        "author": "cj17digr",
        "body": "When China sold ~25% of their Treasuries last year or the year before, the treasury cost to borrow went down.\n\nChina is ~5% of the market now.  I think you underestimate the amount of Treasuries pension and endowments hold and pour into the market.\n\nIf they try to sell too quickly, the Fed will buy the Treasuries to calm the market and slowly sell them to the market.  This is literally a non event.",
        "created_utc": 1591149586,
        "id": "fspahtg",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591178386.0
    },
    {
        "author": "Orngarth",
        "body": "Zoom is now worth over 1/3 (\\~37%) as much as Tesla.  Pretty crazy when you think about it.",
        "created_utc": 1591130148,
        "id": "fso9lqb",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591158948.0
    },
    {
        "author": "neutralpoliticsbot",
        "body": "Now you know why Tesla Cybertruck has bulletproof body and glass.",
        "created_utc": 1591074020,
        "id": "fslschn",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591102820.0
    },
    {
        "author": "carterbrianw",
        "body": "Hey guys. Made a Reddit account 30 days ago and spend around 3-4 hours a day here. Finally able to post. Crazy stuff happening in the world, people rioting and stuff. Had a smoothie for breakfast then went and got free Popeyes because when I went yesterday they gave me 2 French fries. That’s not an exaggeration, my meal contained two French fries. Like one, two. After that I came home and hung out. Then I went to qdoba, which is significantly better than chipotle. Now I’m just hanging out.\n\nEDIT: sold 3 Tesla calls at 7.15 today. Call me a pussy, but my average was 1.42. Holding 2 $315 AAPL puts",
        "created_utc": 1591067313,
        "id": "fslhvpo",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591096113.0
    },
    {
        "author": "DontSweatIt32",
        "body": "Keep waiting for “the second drop”... “anyday now boys”... this will break 1k by friday.",
        "created_utc": 1591043630,
        "id": "fsk9xea",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591072430.0
    },
    {
        "author": "lame_irl",
        "body": "YOUVE SEEN ARAB SPRING\n\nNOW ITS TIME FOR BLACK AMERICAN SUMMER",
        "created_utc": 1591047665,
        "id": "fski4yw",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591076465.0
    },
    {
        "author": "ch1p_skylark",
        "body": "BITCOIN JUST OMEGA MOONED IN THE LAST 10 MIN\n\nNOW ABOVE 10K",
        "created_utc": 1591053048,
        "id": "fskshjd",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591081848.0
    },
    {
        "author": "mattyfinna",
        "body": "That was what I initially wanted to do, but hey these are sick gains. I just watched Wolf of Wall Street too so I'm a penny stock guy now",
        "created_utc": 1591131013,
        "id": "fsobfwo",
        "score": 11,
        "subreddit": "StockMarket",
        "created": 1591159813.0
    },
    {
        "author": "younglordtyler",
        "body": "Finally lol. But better now then later lol.",
        "created_utc": 1591134685,
        "id": "fsoj2rv",
        "score": 11,
        "subreddit": "pennystocks",
        "created": 1591163485.0
    },
    {
        "author": "IcyResident5",
        "body": "Quit now while you're ahead",
        "created_utc": 1591136232,
        "id": "fsom6ww",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591165032.0
    },
    {
        "author": "diabeetusboy",
        "body": "Bought bitcoin and now it burns when I pee",
        "created_utc": 1591148575,
        "id": "fsp8q9g",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591177375.0
    },
    {
        "author": "SauerKraut90",
        "body": "The transition is complete! Now there’s no economy, only market. And it only goes up",
        "created_utc": 1591144964,
        "id": "fsp2cin",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1591173764.0
    },
    {
        "author": "DingleberryBlaster69",
        "body": "virus is fake and gay we rioting now",
        "created_utc": 1591079314,
        "id": "fslzeo5",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591108114.0
    },
    {
        "author": "iRelapse",
        "body": "Only reason I'm here right now.",
        "created_utc": 1591048231,
        "id": "fskj9k9",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591077031.0
    },
    {
        "author": "Lovehotwings",
        "body": "Who has ZM puts and is shitting their pants right now? Speak up, I need a laugh",
        "created_utc": 1591131036,
        "id": "fsobhkb",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591159836.0
    },
    {
        "author": "Oktrab",
        "body": "Nah the media stopped caring about corona a while ago. Now we have the protests, and obviously that has no impact on markets either. Maybe the next big news headline will, but I highly doubt it. Just buy calls instead",
        "created_utc": 1591133973,
        "id": "fsohltp",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591162773.0
    },
    {
        "author": "chris_nfl",
        "body": "All these zoom puts holders now saying it’s gonna go to 160 tomorrow makes me very worried for my zoom puts #inverseWSB",
        "created_utc": 1591137068,
        "id": "fsonuoy",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591165868.0
    },
    {
        "author": "Milosenpotion",
        "body": "Calls on firearm companies the obvious play right now?",
        "created_utc": 1591147690,
        "id": "fsp75z2",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591176490.0
    },
    {
        "author": "winele",
        "body": "About the same percent your puts are down right now.",
        "created_utc": 1591056315,
        "id": "fskyiea",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591085115.0
    },
    {
        "author": "DIRTY_MAGICIAN",
        "body": "Congrats now you can go to the doctor for that half brain of yours",
        "created_utc": 1591048771,
        "id": "fskkcdy",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591077571.0
    },
    {
        "author": "MightyMiami",
        "body": "Nobody knows. People are not selling this stock right now. More people buying than selling. Look at today. It was up a d down but never lower than open.\n\nOnce it hits $3. Sure maybe some take profits. But it will likely keep going up because a $3 is a strong benchmark and likely more people will come on.. I don't see it being below $2.60 for awhile now.",
        "created_utc": 1591052205,
        "id": "fskqwjr",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1591081005.0
    },
    {
        "author": "superbowl_LII_champs",
        "body": "Its eventually going to be worth more than it is now, but it could possibly be worth less too.",
        "created_utc": 1591040427,
        "id": "fsk3by5",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1591069227.0
    },
    {
        "author": "eyerollingsex",
        "body": "Fucking media acts like this virus is just _over_ now. \n\nFuck this shit\n\nRest In Peace to your friend",
        "created_utc": 1591141338,
        "id": "fsovsof",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591170138.0
    },
    {
        "author": "moboo",
        "body": "You know how some psychologists have looked at traumatic historical periods and concluded that some people actually acted and felt like they were invincible after a close brush with death? An example would be how many Londoners got more and more cavalier as The Blitz of London went on. This market is like that! If that didn’t do us in, people don’t know what will. \n\n“Corona didn’t kill me, mate! Nothin’ can touch me now! Me and JPow gunna get right smashed tonight, snort some Tokyo off a stripper’s arse, and then buy more calls come mornin’!”",
        "created_utc": 1591141758,
        "id": "fsowkky",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591170558.0
    },
    {
        "author": "knicksAHgoat",
        "body": "dkng is a gift right now dont be fooled",
        "created_utc": 1591118634,
        "id": "fsnkzvl",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1591147434.0
    },
    {
        "author": "quinnh1",
        "body": "Someones gotta store the overwhelming amount of police body cam footage, my bets on NTAP",
        "created_utc": 1591105932,
        "id": "fsmvg08",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591134732.0
    },
    {
        "author": "TonguePressedAtTeeth",
        "body": "I’m sitting here on NVDA missing all the fun. Bleh.",
        "created_utc": 1591032320,
        "id": "fsjmhps",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591061120.0
    },
    {
        "author": "rob_mail",
        "body": "selling weekly iron condors on NVDA and SHOP put spreads has been MONEY",
        "created_utc": 1591043808,
        "id": "fskaamv",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591072608.0
    },
    {
        "author": "ch1p_skylark",
        "body": "good chance it pulls an NVDA and just doesnt move at all.\n\nnot advocating iron condoms though, this thing is a wildcard, the high IV is justified",
        "created_utc": 1591034805,
        "id": "fsjrncz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591063605.0
    },
    {
        "author": "NeverInterruptEnemy",
        "body": "I'm a pussy and sold 3 contracts at 100%. I mean... It's positive +100% so, that's better than someone the idiot calls here like FB or NVDA $4000 for 6/5",
        "created_utc": 1591041744,
        "id": "fsk62fn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591070544.0
    },
    {
        "author": "option-trader",
        "body": "I jumped on FB 232.5c 6/5.\n\nNot sure about NVDA though, but I did jump into ZS 6/5 $105c too.",
        "created_utc": 1591030722,
        "id": "fsjj7pa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591059522.0
    },
    {
        "author": "ManWith_ManyCheeses",
        "body": "MSFT, AMD or NVDA?",
        "created_utc": 1591045723,
        "id": "fske7q4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591074523.0
    },
    {
        "author": "Morty-c147",
        "body": "AMD or Nvidia calls?",
        "created_utc": 1591034911,
        "id": "fsjrv5q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591063711.0
    },
    {
        "author": "jdjdthrow",
        "body": "Not in the S&amp;P 500.  The big one is NVDA.",
        "created_utc": 1591067683,
        "id": "fslii3p",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591096483.0
    },
    {
        "author": "EugeneApplebottom",
        "body": "Is this a good buy in point for nvidia?",
        "created_utc": 1591031283,
        "id": "fsjkczk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591060083.0
    },
    {
        "author": "lloydgross24",
        "body": "I also got wrecked by NVDA. I learned my lesson tho. Never short AMD or NVDA. Those have hard core fans that don't care about any valuations and buy any dip.",
        "created_utc": 1591023383,
        "id": "fsj528z",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1591052183.0
    },
    {
        "author": "AngryDingo",
        "body": "Why nvda no go up?  Thinking of getting calls today...",
        "created_utc": 1591025563,
        "id": "fsj8xt6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591054363.0
    },
    {
        "author": "thisisbsol",
        "body": "Nasdaq up, all my NVDA, CSCO, ADBE calls down. Just what I like",
        "created_utc": 1591027195,
        "id": "fsjc3r2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055995.0
    },
    {
        "author": "banditcleaner2",
        "body": "LULU about to do the same shit NVDA did lol",
        "created_utc": 1591033208,
        "id": "fsjobsx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591062008.0
    },
    {
        "author": "I_have_a_dog",
        "body": "Ooh yeah NVDA give me that pump. Glad I doubled down this morning.",
        "created_utc": 1591035565,
        "id": "fsjt8bi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591064365.0
    },
    {
        "author": "void-crus",
        "body": "But NVidia rocks too",
        "created_utc": 1591054356,
        "id": "fskuxa7",
        "score": 1,
        "subreddit": "investing",
        "created": 1591083156.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "NVDA tmr, bitcoin is on the move.",
        "created_utc": 1591056510,
        "id": "fskyv4d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591085310.0
    },
    {
        "author": "norwegianmorningw00d",
        "body": "Dividends that I have are aapl, msft, dis, v, nee, bac, nvda",
        "created_utc": 1591019382,
        "id": "fsiy2me",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1591048182.0
    },
    {
        "author": "nervousformyclasses",
        "body": "NVDA and AMD puts printing. In and out lol",
        "created_utc": 1591018629,
        "id": "fsiwubt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591047429.0
    },
    {
        "author": "I_have_a_dog",
        "body": "Still time to buy the NVDA dip but it’s rapidly disappearing.",
        "created_utc": 1591020358,
        "id": "fsizq7x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591049158.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of June\n\n\n\n## Upcoming events for Monday, June  1st\n\n - Stock splits:\n\n    - EW @ **3:1** (Payable date: 05/29/2020)\n\n - Expected earnings:\n\n  ATEX, ATHM, AXAS, CANF, CSWC, ENS, ERJ, GSM, HHR, IDXG, IRS, LONE, MLAB, NAOV, NGL, OGEN, PIXY, PLX, PRCP, PSTI, PUMP, QTT, RMBL, SBT, STAF, THR, TTM, XYF\n\n - Ex-div:\n\n  AGR, BPOP, CATY, CRD.A, CRD.B, EBIX, EDUC, ESNT, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, IGD, IID, ITUB, KEY, KNSL, LHX, NEE, QIWI, RCKY, SNP, SOI, SWK, UVSP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.130%)\n    - 6-Month Bill Auction (previous: 0.160%)\n    - Construction Spending (consensus: -6.0%, previous: 0.9%)\n    - ISM Manufacturing Employment (consensus: 35.0, previous: 27.5)\n    - ISM Manufacturing New Orders Index (previous: 27.1)\n    - ISM Manufacturing PMI (consensus: 43.0, previous: 41.5)\n    - ISM Manufacturing Prices (consensus: 37.0, previous: 35.3)\n    - Investing.com Gold Index (actual: 52.4%, previous: 56.9%)\n    - Investing.com S&amp;P 500 Index (actual: 23.9%, previous: 22.3%)\n    - Manufacturing PMI (consensus: 39.8, previous: 36.1)\n\n## Upcoming events for Tuesday, June  2nd\n\n - Stock splits:\n\n    - LPI @ **1:20**\n\n - Expected earnings:\n\n  AMBA, APPS, BBW, BZUN, CBRL, CRDF, CRWD, DCI, DKS, ENT, EVRI, GME, GRPN, HCR, HQY, HUD, IOTS, JT, LEJU, MDLA, MOGO, NEXT, PKX, PXS, RGS, RLMD, ROSE, SB, SOHO, TIF, TISI, TUES, WEI, WUBA, ZM\n\n - Ex-div:\n\n  AAON, AROW, AVT, AVY, BBD, BBDO, GHL, HAL, KRNY, LIN, NNA, NPO, ODFL, OPOF, OTTW, PAHC, PEBK, PJT, SLB, UG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 8.700M)\n    - ISM NY Business Conditions (previous: 4.3%)\n    - ISM-New York Index (previous: 826.5)\n    - Redbook (previous: -1.5%)\n    - Redbook (previous: -5.5%)\n    - Total Vehicle Sales (previous: 8.60M)\n\n## Upcoming events for Wednesday, June  3rd\n\n - Expected earnings:\n\n  ABM, AEO, AKTX, ALOT, AMSC, BWAY, CHNG, CLDR, CMTL, CNK, CORR, CPB, CPRI, CTXR, CZZ, DLPN, ESTC, EXPR, EYES, FOSL, GEF, GOOS, GWRE, HALL, HEPA, JAX, LMB, MBOT, MCF, NOVN, PBIO, PVH, QES, QMCO, SBSW, SMAR, SRNE, TENX, TLYS, UNFI, VOLT, VRA, VRNT, WTI, YJ, ZUO\n\n - Ex-div:\n\n  CEO, FRO, HD, HVT, HVT.A, MBCN, MOS, NEM, NLSN, PTEN, QCOM, RMBI, SSTK, SU\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -9,000K, previous: -20,236K)\n    - Crude Oil Imports (previous: 2.066M)\n    - Crude Oil Inventories (consensus: -1.944M, previous: 7.928M)\n    - Cushing Crude Oil Inventories (previous: -3.395M)\n    - Distillate Fuel Production (previous: -0.024M)\n    - Durables Excluding Defense (previous: -16.2%)\n    - EIA Refinery Crude Runs  (previous: 0.088M)\n    - EIA Weekly Distillates Stocks (consensus: 1.771M, previous: 5.494M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.0%, previous: 1.9%)\n    - Factory Orders (consensus: -12.5%, previous: -10.4%)\n    - Factory orders ex transportation (previous: -3.7%)\n    - Gasoline Inventories (consensus: 0.100M, previous: -0.724M)\n    - Gasoline Production (previous: 0.005M)\n    - Heating Oil Stockpiles (previous: 0.107M)\n    - ISM Non-Manufacturing Business Activity (previous: 26.0)\n    - ISM Non-Manufacturing Employment (previous: 30.0)\n    - ISM Non-Manufacturing New Orders (previous: 32.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 41.8)\n    - ISM Non-Manufacturing Prices (previous: 55.1)\n    - MBA 30-Year Mortgage Rate (previous: 3.42%)\n    - MBA Mortgage Applications (previous: 2.7%)\n    - Markit Composite PMI (consensus: 36.4, previous: 27.0)\n    - Mortgage Market Index (previous: 746.5)\n    - Seevol Cushing Storage Report (previous: -4.261M)\n    - Services PMI (consensus: 36.9, previous: 26.7)\n\n## Upcoming events for Thursday, June  4th\n\n - Expected earnings:\n\n  AINC, AMC, AVGO, BAK, BITA, BMA, BVXV, CAAS, CAL, CARE, CCEP, CIEN, CLUB, CMD, COO, CRC, CVIA, DBI, DLNG, DLTH, DOCU, DOMO, FLR, FUV, GES, GGAL, GHG, GIII, GPS, HBB, HOME, INWK, IRCP, JILL, KLXE, LLEX, MARK, MDB, MIK, MMYT, MOV, MTN, NAV, NGG, NX, OESX, PD, PRTY, RRGB, RTIX, SAIC, SCWX, SEAC, SENS, SJM, SPWH, TNP, TTC, UFAB, VJET, WORK, WPRT, XBIT, XELA, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AIN, AJG, AL, AMNB, ANAT, BAC, BAX, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CDK, CERN, CHRW, CTXS, D, ESBK, FFNW, FLO, FRME, GARS, GOLF, GPC, HLI, HWC, HWKN, ICBK, INT, KFRC, KMB, KNX, LCII, MANT, MBWM, MLI, NAVI, NVDA, ORI, PBIP, PCH, PEP, PII, RF, SEE, SLM, SNR, SQM, TGNA, TILE, TRST, TT, UFCS, WM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.130%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Challenger Job Cuts (previous: 1,576.9%)\n    - Challenger Job Cuts (previous: 671.129K)\n    - Continuing Jobless Claims (consensus: 25,750K, previous: 21,052K)\n    - Exports (previous: 187.80B)\n    - Imports (previous: 232.20B)\n    - Initial Jobless Claims (consensus: 1,800K, previous: 2,123K)\n    - Jobless Claims 4-Week Avg. (previous: 2,608.00K)\n    - Natural Gas Storage (consensus: 107B, previous: 109B)\n    - Nonfarm Productivity (consensus: -2.5%, previous: -2.5%)\n    - Trade Balance (consensus: -44.30B, previous: -44.40B)\n    - Unit Labor Costs (consensus: 4.8%, previous: 4.8%)\n\n^^^^2020-06-01",
        "created_utc": 1591005619,
        "id": "fsigvgq",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1591034419.0
    },
    {
        "author": "WastemanWilsh",
        "body": "Any advice for a 19 y/o beginner\n\nBasically I started trading almost 2 weeks ago, since then I’ve watched countless hours of videos on trading yet still I feel like I’m missing the bigger picture. I’ve started with an initial £1,000 but I’m unsure of how to split it at the moment. I see most people on this sub seem to advise beginners to look into ETF’s as a start. I looked into the Vanguard FTSE 250 however I’m not sure if that’s a good move in the current market or not. Also it’s probably good to mention I’ve already invested in a few tech companies such as RTX, NVDA (again not sure if that was smart) I’m sure I’ll get loads of stick from more experienced traders but i guess I gotta start somewhere :).\n\nAny advice would be incredible",
        "created_utc": 1591017445,
        "id": "fsiuzes",
        "score": 1,
        "subreddit": "investing",
        "created": 1591046245.0
    },
    {
        "author": "nervousformyclasses",
        "body": "This is a massive green day for you? Lol weird. My NVDA puts printed this morning so not sure what you're on about mate",
        "created_utc": 1591023717,
        "id": "fsj5o71",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591052517.0
    },
    {
        "author": "Shaun8030",
        "body": "Nvidia and amd are overpriced or ratio is atrocious , fomo stocks at this value .",
        "created_utc": 1591055117,
        "id": "fskwbk6",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1591083917.0
    },
    {
        "author": "AceVonSpades",
        "body": "AMD, NVDA, ZM, AMZN (amoung others) all have reached ATH's why not TSLA?",
        "created_utc": 1591059233,
        "id": "fsl3sgo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591088033.0
    },
    {
        "author": "Im_Tele",
        "body": "I personally would've consolidated MSFT, AMZN, NVDA, AMD into QQQ.",
        "created_utc": 1591043948,
        "id": "fskaky9",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1591072748.0
    },
    {
        "author": "HoosierPride",
        "body": "Yall think $ with come back to NVDA this week?",
        "created_utc": 1591025678,
        "id": "fsj955n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591054478.0
    },
    {
        "author": "Stalin_Four_Time",
        "body": "WDC has lagged behind Nvidia growth but still retains the same growth estimates by large banks and analysts. If anyone’s looking to hop onto the computer peripheral industry and is too late to nvidia, look for Western Digital",
        "created_utc": 1591033909,
        "id": "fsjpsnq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591062709.0
    },
    {
        "author": "ButtFart88",
        "body": "Most WSB have stayed up. They only ever crashed during the Corona virus and then went right back up. Over the years we’ve had NVDA, AMD, TSLA, DKNG, + more I know I’m missing. Only one that never recovered that well post Corona crash was SPCE",
        "created_utc": 1591046090,
        "id": "fskeygx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591074890.0
    },
    {
        "author": "shuttdown700",
        "body": "NVDA spreads. Don’t know what shit will do but it’s moving",
        "created_utc": 1591022493,
        "id": "fsj3giy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591051293.0
    },
    {
        "author": "Inquisitive10",
        "body": "24y.o., risk tolerance: high, I have an emergency savings fund and a decent amount in my savings account as well. Plan to be in the market for 25+ years. Amount invested: 50,000.\n\nMSFT - 10%\n\nAMZN - 10%\n\nQSR.TO - 10%\n\nNVDA - 5%\n\nAMD - 5%\n\nDIS - 10%\n\nMKL - 30%\n\nVFV.TO - 15%\n\nVEE.TO - 5%\n\nAlways love to hear insights from redditors about my portfolio. I won't take any of it to heart, but I think it is nice to hear everyone's thoughts.",
        "created_utc": 1591040284,
        "id": "fsk3159",
        "score": 0,
        "subreddit": "investing",
        "created": 1591069084.0
    },
    {
        "author": "jd_coud9",
        "body": "&gt; ORCL is the next CRM\n\nthe retardation is strong",
        "created_utc": 1591031522,
        "id": "fsjkuqw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591060322.0
    },
    {
        "author": "GoldTonight4",
        "body": "You gonna hold ZM past earnings?\n\ni hope you get some fuck\n\nI like Oracle, buying calls today. \n\nAnd you missed out on ESTC.",
        "created_utc": 1591029258,
        "id": "fsjg8qi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591058058.0
    },
    {
        "author": "caratspy",
        "body": "Tell me more oracle...",
        "created_utc": 1591000812,
        "id": "fsic4cm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591029612.0
    },
    {
        "author": "cough_cough_harrumph",
        "body": "Seems the volume is super low for ORCL... what strike were you looking at? I can't find anything that doesn't make me nervous.",
        "created_utc": 1591033998,
        "id": "fsjpz8f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591062798.0
    },
    {
        "author": "dtdude87",
        "body": "So I typically buy OOM calls ($60) 1-2 weeks before ER and have never not turned a decent profit.  Was up 1000% a couple quarters ago.\n\nBut - don’t hold through ER.  It’s usually a dud.\n\nThis is typically their best quarter as it’s their year end so their sales team really pushes hard to close deals, but given the fact every company out there halted spending, I doubt it’ll be good.\n\nI work very closely with a lot of Orcl folks as well and they’ve told me they’ve cut costs heavily and aren’t allowing OT for their tech folks, which to me is a sign of slowing sales.",
        "created_utc": 1591052326,
        "id": "fskr4tm",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591081126.0
    },
    {
        "author": "golfwangthesenuts",
        "body": "anyone thinking of playing ORCL for earnings in two weeks??",
        "created_utc": 1591115238,
        "id": "fsnduqw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591144038.0
    },
    {
        "author": "Krusher4Lyfe",
        "body": "Not OP, but I’ve never gotten a payout from such low IV. ORCL and CRWD (I think) got me in the past for decent losses. \n\nI bought one of the QCOM options immediately and then sold it like ten minutes later for ten bucks more. \n\n5.00 in two weeks is a huge move for that stock.\n\nIMO you’d do better selling credit spreads if you want to take advantage of that 85c",
        "created_utc": 1591052491,
        "id": "fskrg45",
        "score": 2,
        "subreddit": "options",
        "created": 1591081291.0
    },
    {
        "author": "piggydancer",
        "body": "And OI finished up 14.82% today. \n\nWe have found the Oracle of Idiocracy!",
        "created_utc": 1591055242,
        "id": "fskwjsk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591084042.0
    },
    {
        "author": "water_boat",
        "body": "ORCL products dominate the finance and banking industry from my knowledge. Within the past year, I've dealt with Oracle PeopleSoft, Oracle Hyperion, Sun micro Systems and was offered a job a Strategic Consultant position for NetSuite integration which are all Oracle products.",
        "created_utc": 1591061008,
        "id": "fsl6y08",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591089808.0
    },
    {
        "author": "jd_coud9",
        "body": "&gt; ORCL is the next CRM\n\nthe retardation is strong",
        "created_utc": 1591031522,
        "id": "fsjkuqw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591060322.0
    },
    {
        "author": "Dildobagginz6969",
        "body": "The Oracle sees all",
        "created_utc": 1591066247,
        "id": "fslg38k",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591095047.0
    },
    {
        "author": "KimJongUnsTrousers",
        "body": "Starting to accumulate calls for earnings on ORCL",
        "created_utc": 1591121858,
        "id": "fsnrtq2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591150658.0
    },
    {
        "author": "GoldTonight4",
        "body": "You gonna hold ZM past earnings?\n\ni hope you get some fuck\n\nI like Oracle, buying calls today. \n\nAnd you missed out on ESTC.",
        "created_utc": 1591029258,
        "id": "fsjg8qi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591058058.0
    },
    {
        "author": "blazespinnaker",
        "body": "Lot of buyback support at 52 on this stock.   I'd look at it as another CSCO and trade it the same way.\n\nThat said, Zoom could surprise to the upside on earnings and potentially push Oracle higher as there was a big deal about Oracle cloud hosting Zoom.\n\nOracle Cloud is really Oracles only chance to escape the doldrums, but it's not a very good cloud compared to its competitors.",
        "created_utc": 1591056768,
        "id": "fskzbzc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591085568.0
    },
    {
        "author": "golfwangthesenuts",
        "body": "my safest play is probably ORCL earnings run up in two weeks",
        "created_utc": 1591076084,
        "id": "fslv85w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591104884.0
    },
    {
        "author": "malloun123",
        "body": "I would buy 6/12 for adobe and 6/19 for oracle but wait until the Monday of that week to buy it, that’s what I’ve noticed it starts consistently pumping. Prior to that it’s up and down",
        "created_utc": 1591082545,
        "id": "fsm3bme",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591111345.0
    },
    {
        "author": "Smok3dSalmon",
        "body": "put spreads for me.\n\nOracle sucks, they've done a miserable job trying to move to cloud. It's just accounting gimmicks to inflating their cloud business because that drives stonk.\n\nEarnings is going to be a fat dud.",
        "created_utc": 1591068953,
        "id": "fslklkq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591097753.0
    },
    {
        "author": "caratspy",
        "body": "Tell me more oracle...",
        "created_utc": 1591000812,
        "id": "fsic4cm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591029612.0
    },
    {
        "author": "durkkaderpa",
        "body": "Oracle is the GE of SaaS",
        "created_utc": 1591064148,
        "id": "fslcide",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591092948.0
    },
    {
        "author": "dtdude87",
        "body": "Oracle autonomous DB and the security that comes with it makes it better than AWS, but they’re just starting to catch up to the cloud, started way too late.",
        "created_utc": 1591064653,
        "id": "fslddoa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591093453.0
    },
    {
        "author": "golfwangthesenuts",
        "body": "anyone gearing up for ORCL earnings??? also NUAN is about to break out, it had its tennis ball action today and is looking for ATHs",
        "created_utc": 1591124101,
        "id": "fsnwmzu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591152901.0
    },
    {
        "author": "dtdude87",
        "body": "Essentially yes, you could significantly reduce internal IT costs because of this (is DBAs).  Their security is apparently highly encrypted.  They mentioned that the Capital One security breach using AWS wouldn’t have happened with Oracle as they wouldn’t have allowed internal configuration errors.",
        "created_utc": 1591125860,
        "id": "fso0d74",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591154660.0
    },
    {
        "author": "QuandlFgt",
        "body": "Yeah I'm just picturing an algorithm randomly revoking access on an internal application and no one knows why\n\nI really have no idea how it works and have never tested it, they have really smart people at Oracle so they could probably pull it off I just can't picture how it would look from a users perspective",
        "created_utc": 1591126849,
        "id": "fso2hnm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591155649.0
    },
    {
        "author": "lalitmufc",
        "body": "Dude seriously, all tech have the same charts today as ORCL. Just saying!",
        "created_utc": 1591128142,
        "id": "fso5b55",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156942.0
    },
    {
        "author": "QuandlFgt",
        "body": "I work with some huge software vendors, and they've always required Oracle DB in the past, now they all integrate with postgres(free open source database). The free databases are getting so good, a lot of people are questioning why they would go with Oracle for new products. \n\nIt's also one of the first things people are looking to cut with new projects because the licensing fees are so eye watering; like it's legit a few million for Oracle or free postgres. IDK if their cloud is doing well, I've heard it's nice but everyone seems to already be pretty happy with AWS or Azure",
        "created_utc": 1591062582,
        "id": "fsl9rkd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591091382.0
    },
    {
        "author": "cough_cough_harrumph",
        "body": "Seems the volume is super low for ORCL... what strike were you looking at? I can't find anything that doesn't make me nervous.",
        "created_utc": 1591033998,
        "id": "fsjpz8f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591062798.0
    },
    {
        "author": "numbhallow",
        "body": "Oh that makes sense, yeah Oracle is the option.  The spread is wide option for sure.",
        "created_utc": 1591040748,
        "id": "fsk400l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591069548.0
    },
    {
        "author": "imgram",
        "body": "Buffet is intelligent and nuanced. Individuals who latch onto PE then pretend like they are the second coming of the Oracle of Omaha are not.",
        "created_utc": 1591042596,
        "id": "fsk7t9n",
        "score": 1,
        "subreddit": "investing",
        "created": 1591071396.0
    },
    {
        "author": "Dildobagginz6969",
        "body": "The Oracle can only see with more blood in the streets, copy that.",
        "created_utc": 1591067452,
        "id": "fsli47c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591096252.0
    },
    {
        "author": "Soltang",
        "body": "ORCL is not neccassarily a cloud company but in fact their DB (bread and butter) is facing a tough competition from the early adoptors of Cloud (aka AWS and the likes). They still are making good headways in to cloud with NetSuite etc but their DB has ways to go.\n\nNice DD though. With as many acquisitions as they have been doing (esp Java and Enterprise ERP) they are well suited to face the tough economic times. \n\nBut 55C is still a tough call in my opinion with industry freezing most new developments.",
        "created_utc": 1591128886,
        "id": "fso6x0u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591157686.0
    },
    {
        "author": "golfwangthesenuts",
        "body": "what did i say about ORCL?? i gave you guys a chance, all execs bought shares yesterday and they have earnings in two weeks AND they are a cloud company... what more could you ask for?",
        "created_utc": 1591128057,
        "id": "fso5468",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156857.0
    },
    {
        "author": "Throwback5",
        "body": "ORACLE MOONING",
        "created_utc": 1591127874,
        "id": "fso4pa8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156674.0
    },
    {
        "author": "nafinmasjid",
        "body": "Looked into earnings for the week of June 17th and Oracle has earnings that week.\n\nMight be worth looking into some lottery calls or whatever if you think the price will rise in anticipation for earnings",
        "created_utc": 1591081992,
        "id": "fsm2olf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591110792.0
    },
    {
        "author": "amgin3",
        "body": "Zoom is using Oracle compute services to run their platform, which should represent a large amount of revenue for Oracle.",
        "created_utc": 1591079085,
        "id": "fslz425",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591107885.0
    },
    {
        "author": "det_frank_pembleton",
        "body": "Fair enough. I'm not on that side of it, I think we use SAP idk if that's their own software or Oracle under the hood",
        "created_utc": 1591060877,
        "id": "fsl6plq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591089677.0
    },
    {
        "author": "det_frank_pembleton",
        "body": "Genuine q: Who uses Oracle? We generally use postgres or AWS for data solutions. I don't think I've even touched an oracle product since we moved from vms to docker.",
        "created_utc": 1591059442,
        "id": "fsl4607",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591088242.0
    },
    {
        "author": "im_priced_in",
        "body": "More likely by Oracle. ZM has been using OCI.",
        "created_utc": 1591119711,
        "id": "fsnn9y4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591148511.0
    },
    {
        "author": "mpbh",
        "body": "Fuck ORCL, toxic stock. It's as shitty as IBM with 1/3 of the dividend",
        "created_utc": 1591121855,
        "id": "fsnrtgj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591150655.0
    },
    {
        "author": "ravepeacefully",
        "body": "Mhm, and have ANY of those “big investors” ever had as much in assets as WB? Have any of those “big investors” doubled the S&amp;P returns over the last 55 years? Have any of them actually done anything close, to what buffet has done? Do you know that BRK was never owned primarily by institutions, like most other equities? Those “big investors” are just big talk idiots that spent their entire life  losing to the S&amp;P consistently, every year. Many of those “big investors” are only big today because they had an uncle high up on Wall Street and got to skip the 20 years of hard work that normal people have to do before calling the shots.\n\n\nTldr: show me anyone who has beat the S&amp;P as consistently as buffet, and I’ll crown them the new oracle.",
        "created_utc": 1591122438,
        "id": "fsnt2ri",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591151238.0
    },
    {
        "author": "yawn_this_gets_old",
        "body": "Sounds like a self fulfilling prophecy there, Neo. Did the Oracle send you?",
        "created_utc": 1591062909,
        "id": "fslac8s",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1591091709.0
    },
    {
        "author": "dtdude87",
        "body": "So I typically buy OOM calls ($60) 1-2 weeks before ER and have never not turned a decent profit.  Was up 1000% a couple quarters ago.\n\nBut - don’t hold through ER.  It’s usually a dud.\n\nThis is typically their best quarter as it’s their year end so their sales team really pushes hard to close deals, but given the fact every company out there halted spending, I doubt it’ll be good.\n\nI work very closely with a lot of Orcl folks as well and they’ve told me they’ve cut costs heavily and aren’t allowing OT for their tech folks, which to me is a sign of slowing sales.",
        "created_utc": 1591052326,
        "id": "fskr4tm",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1591081126.0
    },
    {
        "author": "Krusher4Lyfe",
        "body": "Not OP, but I’ve never gotten a payout from such low IV. ORCL and CRWD (I think) got me in the past for decent losses. \n\nI bought one of the QCOM options immediately and then sold it like ten minutes later for ten bucks more. \n\n5.00 in two weeks is a huge move for that stock.\n\nIMO you’d do better selling credit spreads if you want to take advantage of that 85c",
        "created_utc": 1591052491,
        "id": "fskrg45",
        "score": 2,
        "subreddit": "options",
        "created": 1591081291.0
    },
    {
        "author": "piggydancer",
        "body": "And OI finished up 14.82% today. \n\nWe have found the Oracle of Idiocracy!",
        "created_utc": 1591055242,
        "id": "fskwjsk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591084042.0
    },
    {
        "author": "jd_coud9",
        "body": "&gt; ORCL is the next CRM\n\nthe retardation is strong",
        "created_utc": 1591031522,
        "id": "fsjkuqw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591060322.0
    },
    {
        "author": "GoldTonight4",
        "body": "You gonna hold ZM past earnings?\n\ni hope you get some fuck\n\nI like Oracle, buying calls today. \n\nAnd you missed out on ESTC.",
        "created_utc": 1591029258,
        "id": "fsjg8qi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591058058.0
    },
    {
        "author": "blazespinnaker",
        "body": "Lot of buyback support at 52 on this stock.   I'd look at it as another CSCO and trade it the same way.\n\nThat said, Zoom could surprise to the upside on earnings and potentially push Oracle higher as there was a big deal about Oracle cloud hosting Zoom.\n\nOracle Cloud is really Oracles only chance to escape the doldrums, but it's not a very good cloud compared to its competitors.",
        "created_utc": 1591056768,
        "id": "fskzbzc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591085568.0
    },
    {
        "author": "caratspy",
        "body": "Tell me more oracle...",
        "created_utc": 1591000812,
        "id": "fsic4cm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591029612.0
    },
    {
        "author": "cough_cough_harrumph",
        "body": "Seems the volume is super low for ORCL... what strike were you looking at? I can't find anything that doesn't make me nervous.",
        "created_utc": 1591033998,
        "id": "fsjpz8f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591062798.0
    },
    {
        "author": "numbhallow",
        "body": "Oh that makes sense, yeah Oracle is the option.  The spread is wide option for sure.",
        "created_utc": 1591040748,
        "id": "fsk400l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591069548.0
    },
    {
        "author": "imgram",
        "body": "Buffet is intelligent and nuanced. Individuals who latch onto PE then pretend like they are the second coming of the Oracle of Omaha are not.",
        "created_utc": 1591042596,
        "id": "fsk7t9n",
        "score": 1,
        "subreddit": "investing",
        "created": 1591071396.0
    }
]