[
    {
        "author": "epyonxero",
        "body": "Pence has perfected the exact tone of voice and cadence that makes you completely tune him out and forget what he was taking about. Very effective.",
        "created_utc": 1602120563,
        "id": "g82cyyc",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1602149363.0
    },
    {
        "author": "kayakextrodinare",
        "body": "I get Kamala's strategy now, it's just let Pence lie and self destruct. He's got a good cadence, but I doubt people are buying his shit.",
        "created_utc": 1602120305,
        "id": "g82cg2b",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602149105.0
    },
    {
        "author": "parlay_king",
        "body": "Bought today: \n- SPY 360$ Jan calls\n- AYX 150$ Jan calls\n- CDNS 130$ Jan calls \n\n🚀",
        "created_utc": 1602785719,
        "id": "g8x7qj3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602814519.0
    },
    {
        "author": "benjumanji55",
        "body": "Gosh darnit I think you mighta found something here!\n\nThe money looks good, the valuation seems low, but they do have CDNS in direct competition.  However, it seems CDNS is falling off compared to SNPS in the last month, possibly due to these disparate earnings stories. CDNS got hit hard this year after a monster Q1, while SNPS has had a positive trend through volatility. That could signal an industry preference for one over the other. I can't figure out anything they're doing differently -- they both run FinFET, same full-suite offerings on the website. One is undervalued, the other slightly over. I'm curious as to why, but the two are telling different stories on the charts.",
        "created_utc": 1603398077,
        "id": "g9oomlv",
        "score": 3,
        "subreddit": "stocks",
        "created": 1603426877.0
    },
    {
        "author": "HereUThrowThisAway",
        "body": "Try to roughly map out cash flows over a long enough period of time and discount it back. If you can't do this it's probably speculation. Most people can't predict how long so of these high growth names will grow for and at what rate. I would argue they are also applying arbitrary discount rates. Looks smart now, but could end in tears later on.\n\nThe contrary is that these companies are basically taking free money and trying to own a market. This could be profitable but you have to own the market as fast as possible. Again, highly unpredictable.\n\nI own 2-3 \"growth\" companies, but I can plot out their growth reasonably well as I know the end market, management, cadence etc. I own another 3 that are slower growing but high incremental margin businesses so the \"growth in their case is cash flow.\n\nIf an investment can't pass my hurdle rate (not WACC or any other crazy academic rate) then I hold cash or short term paper until there is an opportunity.",
        "created_utc": 1601597813,
        "id": "g7citul",
        "score": 3,
        "subreddit": "SecurityAnalysis",
        "created": 1601626613.0
    },
    {
        "author": "kayakextrodinare",
        "body": "I don't dispute his cadence and poise.",
        "created_utc": 1602120027,
        "id": "g82bvw5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602148827.0
    },
    {
        "author": "SportTheFoole",
        "body": "But they’re CDNs, not clouds. They have a cloud, but so does everyone. FSLY and NET aren’t really direct competitors to the cloud companies (0).\n\n0. Kind of, there is some overlap, especially when it comes to DNS and 1.1.1.1 was definitely a shot across GOOG’s bow by NET.",
        "created_utc": 1602727976,
        "id": "g8uzdsv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602756776.0
    },
    {
        "author": "sf2cinci",
        "body": "I think you’re right.... I was just talking to a couple engineers I know who do chip design and they said SNPS is basically taking over and becoming the industry standard. CDNS will still be around but many prefer SNPS. Long term they compared it to excel where it’s industry standard and everyone just uses SNPS. \n\nGreat buy great company... I got into some SNPS shares in August and haven’t looked back.",
        "created_utc": 1603399404,
        "id": "g9orq09",
        "score": 2,
        "subreddit": "stocks",
        "created": 1603428204.0
    },
    {
        "author": "Meymo",
        "body": "You’re not “stupid” so quit calling yourself stupid. You can’t undo the past anyways so there’s no sense in dwelling on it.  \n\nIf you look at most stocks, they generally have one long term direction which is up and to the right. The appropriate thing to do most of the time is to buy and keep buying the same stocks over and over and over. Consistency is key, and buying in the US market on a regular cadence will provide positive results in the long term.\n\nYou never have to sell something completely unless you no longer want it as a part of your portfolio. \n\nThe important thing is to learn from this. The market isn’t going anywhere and I guarantee that there will be both red and green days in the future. Learn from your past. Plan for your future. Good luck.",
        "created_utc": 1603841181,
        "id": "gabr3rc",
        "score": 2,
        "subreddit": "investing",
        "created": 1603869981.0
    },
    {
        "author": "Bearcat1504",
        "body": "Interesting buy.... i definitely like the industry they’re in. What differentiates them from CDNS cadence Design Systems systems?",
        "created_utc": 1603394094,
        "id": "g9oez83",
        "score": 2,
        "subreddit": "stocks",
        "created": 1603422894.0
    },
    {
        "author": "Boring-End-6178",
        "body": "Momentus is pretty public about press releasing all of their clients when they sign them (can see on website) and included a slide in the investor presentation. Currently they are serving customers launching nano or micro satellites. This is because Vigoride only has a payload capacity (right now) of up to 750kg. Ardoride which will commercially launch next year will significantly expand the potential payload capacity enabling them to serve larger satellites. The bull case would be that when Starship and New Glenn arrive, every flight will be a rideshare (as opposed to SpaceX's current cadence of 3-4 per year going forward).  Again because the payload capacity will be so massive that no one satellite provider will be able to fill it. Then almost every satellite on those ships could be a potential customer because again, these rockets can only drop off the payload in a specific orbit and there will be many customers on the rocket each with different needs. \n\nNumerically, there are a gigantic almost absurd amount of companies developing satellites right now, whether they be cube sats or larger ones. If you do some googling (or just look through the Momentus press releases on partners), I'm sure your head will get to spinning quickly. SpaceX enabled that through their dramatic lowering of launch costs. Many will fail, but the good thing about Momentus is they are agnostic as to who wins and who doesn't.",
        "created_utc": 1602144643,
        "id": "g839t5w",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1602173443.0
    },
    {
        "author": "parlay_king",
        "body": "NNOX, AMD, AAPL, CDNS \n\nKeep Buying",
        "created_utc": 1602158820,
        "id": "g83n1bt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602187620.0
    },
    {
        "author": "MRnulook",
        "body": "Year to date : $60,861.54 (1/1/2020)-172,606.00 (64.76% 10/9/2020)-Many positions are day traded during volatility, but most if not all\nare held long.\n\nPositions:\nNvda: 14.80%\nMsft: 13.82% \nApple: 29.21%\nGnrc: 11.16%\nCdns: 10.12%\nMlm: 10.49%\nPton:10.40%",
        "created_utc": 1602463441,
        "id": "g8jo8jw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602492241.0
    },
    {
        "author": "123432123456678986",
        "body": "99 cents for 100 shares. But it adds up if you are buying lots of shares. It's actually cheaper to have a TD account for shares where you are buying thousands of shares. So u need 3 fn accounts. I wish we cdns could open a Robinhood account. I wish wealth simple didn't steal from you on the currency conversion.",
        "created_utc": 1602515988,
        "id": "g8lj3ny",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1602544788.0
    },
    {
        "author": "dwdsquared2",
        "body": " **Events in the US Today (EDT):**\n\n* DAY - Wear a mask &amp; socially distance &lt;3\n* 8:00am - Fed Chair Powell speaks \\[3/3 Volatility\\]\n   * Speaking as part of a panel on cross-border payments and digital currencies at the International Monetary Fund’s (IMF) annual meeting. (Crypt0)\n* 9:00am - FOMC Member Williams Speaks \\[2/3 Volatility\\]\n* 10:00am - NAHB Housing Market Index (Oct) \\[1/3 Volatility\\]\n* 11:45am - FOMC Member Clarida Speaks \\[2/3 Volatility\\]\n* 1:00pm - 10-Year TIPS Auction \\[1/3 Volatility\\]\n* 2:00pm - Federal Budget Balance \\[2/3 Volatility\\]\n* 2:20pm - FOMC Member Bostic Speaks \\[2/3 Volatility\\]\n* 3:00pm - FOMC Member Harker Speaks \\[2/3 Volatility\\]\n* Speaker Nancy Pelosi says she has given negotiators one more day to strike a deal on a coronavirus relief package in order to pass a bill before Election Day, adding urgency to talks that appear to have devolved into finger-pointing, even as she declared herself “optimistic.”\n* The House is out of Washington until after the election. \n\n**Events in the World Today (EDT):**\n\n* 3:15am - Euro Zone ECB's De Guindos Speaks \\[2/3 Volatility\\]\n* 7:25am - Brazil BCB Focus Market Readout \\[2/3 Volatility\\]\n* 7:30am - Euro Zone ECB's Mersch Speaks \\[2/3 Volatility\\]\n* 8:30am - Canada Wholesale Sales (MoM-Aug) \\[2/3 Volatility\\]\n* 8:40am - Euro Zone ECB's Lane Speaks \\[2/3 Volatility\\]\n* 8:45am - Euro Zone ECB's President Lagarde Speaks \\[3/3 Volatility\\]\n* 10:05am - UK BoE MPC Member Cunliffe Speaks \\[2/3 Volatility\\]\n* 11:00am - UK BoE MPC Member Cunliffe Speaks \\[2/3 Volatility\\]\n* 12:00pm - Germany Buba President Weidmann Speaks \\[2/3 Volatility\\]\n* 5:00pm - New Zealand NZIER Business Confidence (Q3) \\[2/3 Volatility\\]\n* 7:00pm - Australia RBA Assist Gov Kent Speaks \\[2/3 Volatility\\]\n* 8:30pm - Australia RBA Meeting Minutes \\[3/3 Volatility\\]\n* 9:30pm - China PBoC Loan Prime Rate \\[3/3 Volatility\\]\n* In Italy on Sunday, Prime Minister Giuseppe Conte unveiled tougher measures to try to halt a sharp rise in COVID-19 cases and gave mayors the power to shut public squares from 9 p.m. to halt public gatherings.\n* China says its economy grew 4.9% in the third quarter.\n* The International Monetary Fund downgraded its outlook for Middle East and Central Asian economic recovery, predicting a 4.1% contraction for the region as a whole.\n   * The fund does not see oil staging a dramatic recovery next year, forecasting prices in the $40 to $50 range in 2021. \n\nEarnings Before Open:\n\n* Halliburton, Lennox, Phillips, Old National Bank, Simmons First National Corp., G\n\n**Earnings After Close:**\n\n* Logitech, IBM, Cadence, PPG, Crown, Steel Dynamics, Zions Bancorporation\n\n[Earnings This Week](https://i.imgur.com/ffP3FJL.png)",
        "created_utc": 1603106262,
        "id": "g9ba30k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603135062.0
    },
    {
        "author": "lawfulgoodd",
        "body": "Just to add here, u/Power80770M is mostly right and i did think the same on the begining, however, Fastly does have an advantage over general CDNs provided by Amazon, Microsoft, Google etc, which is the targeted delivery of specific static content like images and videos, thereby, tiktok being quite a big chunk of their revenue. now think it this way... with the latest trend (images (instagram, fb etc) and videos (snap, tiktok etc)) where do you think the market is heading towards?  \nimo this trend can be easily monetized. why? what happens if tiktok videos on dense populated areas take a few seconds to load or the stream delays from time to time? less usage, which over time (if it happens constaltly) means less adicition, so less users..  \nPS: cloud architect here",
        "created_utc": 1603460797,
        "id": "g9rams0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603489597.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the 16th of October\n\n\n\n## Upcoming events for Friday, October 16th\n\n - Stock splits:\n\n    - CQRLF @ **2:5**\n\n - Expected earnings:\n\n  ACU, ALLY, BCBP, BK, BMI, BOCH, BOTJ, CBAN, CFG, CHMG, EMCF, FCAP, FCCY, HDB, HONE, JBHT, KSU, MBCN, NVR, OVLY, RBCAA, RMCF, SLB, STT, SXT, TMP, VFC\n\n - Ex-div:\n\n  ACP, AFT, AGD, AIF, AOD, ARDC, AWP, AYI, COP, EDF, EDI, FSLF, GFL, GGG, GLBZ, HRL, RPM, SRV, SZC\n\n - Economic events and announcements:\n\n    - Business Inventories (consensus: 0.4%, previous: 0.1%)\n    - CFTC Aluminium speculative net positions (previous: 174.3K)\n    - CFTC Copper speculative net positions (previous: 53.6K)\n    - CFTC Corn speculative net positions (previous: 225.7K)\n    - CFTC Crude Oil speculative net positions (previous: 471.5K)\n    - CFTC Gold speculative net positions (previous: 248.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -75.0K)\n    - CFTC Natural Gas speculative net positions (previous: 68.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 74.0K)\n    - CFTC Silver speculative net positions (previous: 41.3K)\n    - CFTC Soybeans speculative net positions (previous: 257.3K)\n    - CFTC Wheat speculative net positions (previous: 37.3K)\n    - Capacity Utilization Rate (consensus: 71.9%, previous: 71.4%)\n    - Core Retail Sales (consensus: 0.5%, previous: 0.7%)\n    - IMF Meetings\n    - Industrial Production (consensus: 0.5%, previous: 0.4%)\n    - Industrial Production (previous: -7.73%)\n    - Manufacturing Production (consensus: 0.7%, previous: 1.0%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (consensus: 76.5, previous: 75.6)\n    - Michigan Consumer Sentiment (consensus: 80.5, previous: 80.4)\n    - Michigan Current Conditions (consensus: 88.5, previous: 87.8)\n    - Michigan Inflation Expectations (previous: 2.6%)\n    - NAHB Housing Market Index (previous: 83)\n    - Overall Net Capital Flow (previous: -88.70B)\n    - Retail Control (consensus: 0.2%, previous: -0.1%)\n    - Retail Inventories Ex Auto (previous: 0.9%)\n    - Retail Sales (consensus: 0.7%, previous: 0.6%)\n    - Retail Sales (previous: 2.57%)\n    - Retail Sales Ex Gas/Autos (previous: 0.7%)\n    - TIC Net Long-Term Transactions (previous: 10.8B)\n    - TIC Net Long-Term Transactions including Swaps (previous: -29.00B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 193)\n    - U.S. Baker Hughes Total Rig Count (previous: 269)\n    - US Foreign Buying, T-bonds (previous: -22.80B)\n\n## Upcoming events for Saturday, October 17th\n\n - Economic events and announcements:\n\n    - IMF Meetings\n\n## Upcoming events for Sunday, October 18th\n\n - Economic events and announcements:\n\n    - IMF Meetings\n\n## Upcoming events for Monday, October 19th\n\n - Stock splits:\n\n    - IVW @ **4:1** (Payable date: 10/16/2020)\n    - IJK @ **4:1** (Payable date: 10/16/2020)\n    - IJJ @ **2:1** (Payable date: 10/16/2020)\n    - IJT @ **2:1** (Payable date: 10/16/2020)\n    - IJS @ **2:1** (Payable date: 10/16/2020)\n    - NCTY @ **1:10**\n    - TRPXY @ **1:70**\n    - CXSE @ **2:1** (Payable date: 10/16/2020)\n\n - Expected earnings:\n\n  ADC, BFIN, BSRR, BXS, CCK, CDNS, EFSC, ELS, FBMS, FBSS, FMAO, FNB, FNCB, FUNC, GNTY, HAL, HNI, HSTM, HXL, IBM, IBTX, IHT, LCNB, LII, LOAN, LOGI, NWBI, ONB, ONCS, PETS, PFBC, PHG, PPG, SFBS, SFNC, SMBC, STLD, TBK, TMBR, WASH, ZION\n\n - Ex-div:\n\n  ATCO, CIVB, CMRE, DMB, HRZN, IGR, INSI, LND, OC, THQ, THW, VCIF\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.966%)\n    - 3-Month Bill Auction (previous: 0.105%)\n    - 6-Month Bill Auction (previous: 0.115%)\n    - Federal Budget Balance (consensus: -124.0B, previous: -200.0B)\n    - NAHB Housing Market Index (consensus: 83, previous: 83)\n\n^^^^2020-10-16",
        "created_utc": 1602842422,
        "id": "g8zl5bs",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1602871222.0
    },
    {
        "author": "spacebizzle",
        "body": "Maybe they are onto something but i think everyone because infatuated with Cloud companies because they’re kinda a black box that nobody really quite understands.  I find myself interested in them as well but mostly on the short side because i think most are way overpriced.  \n\nAs of now its a $9B company that makes a paltry $70 mil per quarter and may never make a profit.  At some point Tik Tok could switch CDNs or maybe make their own? Idk im just skeptical.",
        "created_utc": 1603343262,
        "id": "g9mbkcj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603372062.0
    },
    {
        "author": "OnigiriHunter",
        "body": "How do you feel about CDNS opposed to SNPS?",
        "created_utc": 1603418883,
        "id": "g9ptpht",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603447683.0
    },
    {
        "author": "Endeejay2",
        "body": "I think the important thing to realize is that Snowflake isn't just a general \"cloud\" service. Like you mentioned, they are a data warehousing service. They compete with a small section of AWS called Redshift. Other competitors in this field are IBM DB2 warehouse, Teradata, and MS Azure Synapse. \n\nAs far as competitive advantage over these services from what I know the big one is their ability to separate the scaling of storage vs computing and price those scaling options separately. With most data warehousing solutions when you pay to scale computing, you also have to pay for storage upgrades. This results in larger solutions looking toward snowflake depending on how much work they actually need to do with the data.\n\nSo to complete this point, out of the ones you mentioned. Google has BigQuery or whatever its called, AWS has Redshift, MS has synapse. Salesforce and Cloudflare don't offer the same solutions as they are CDNs and a security service respectively. The other competitors really are IBM and Teradata as mentioned above. I would look into these, read the 10k, see how much profit comes in from these companies and their warehousing solutions. \n\nAs a bonus anecdotal meme, I frequent data engineering and big data subs a bunch even though I'm a boring regular developer and Snowflake seems to be the hot wave that every dev wants to implement. Take that for what you will.",
        "created_utc": 1603118452,
        "id": "g9buvn3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603147252.0
    },
    {
        "author": "tabshiftescape",
        "body": "First, don't panic. Financial decisions under duress are never good.\n\nIt might be a good idea to look at things other than just the stock price when making your evaluation. Did you listen to the earnings call or read the [letter to shareholders](https://investors.fastly.com/files/doc_financials/2020/q3/updated/3Q20-Shareholder-Letter.pdf)? What did you make of the guidance?\n\nPersonally, I would hold the position. Though they just lost 10% of their revenue with TikTok, they've kept 90%. As a CDN, they're going to enjoy considerable network effects with regard to their financial position. They need to work on customer concentration, but as they continue to build out they'll have the ability to do just that.\n\nBeyond that, I think there are some pretty clever things Fastly will be able to do now that they own Signal Sciences regarding package deals to woo current Signal Sciences customers away from their existing CDNs.\n\nWhat's your time horizon?",
        "created_utc": 1604159109,
        "id": "gapfxow",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604187909.0
    },
    {
        "author": "BigFishInYourButt",
        "body": "I'm sure that's him tweeting thats his particular word cadence. Him announcing he has Covid19? He definitely didn't tweet that.",
        "created_utc": 1601813333,
        "id": "g7o42si",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601842133.0
    },
    {
        "author": "blueteambluz",
        "body": "I do this kind of thing for a living and it’s not my first DDoS rodeo. I’ve lived through several waves of these attacks and seen multiple generations of solutions.  At first we had to figure out how to do it ourselves with on-prem solutions like Radware and Arbor.  Next you had scrappy upstarts like Prolexic that used those techs to build scrubbing centers and offered services to those that couldn’t protect themselves.  Then there was a wave of acquisitions and others trying scale the scrubbing center idea (e.g. Akamai buying Prolexic, carriers adding DDoS services). Now we have some entrenched players like Akamai, CloudFlare and some of the carriers, but I recently noticed that players like A-10, Radware and F5 are getting in the game with hybrid cloud/on-prem DDoS solutions.  From a technical perspective, these are an improvement over the 3 layers of defense I mentioned above because there is an on-perm component, but practically I think only a relatively small subset of customers will need this level of protection. \n\nGenerally some mix of A-10, Radware and Arbor will probably be the technologies the big players like Akamai, CloudFlare, Lumen and even Fastly use to deliver their services. So as these solutions providers build out there networks and scrubbing centers A-10 and the other hardware vendors could benefit in the same way a steel company will benefit when car sales trend up. \n\nThat said, A-10 is a pretty niche player. I run a team at a Fortune 50 multi-national and I’ve only ever used a single pair of A-10 boxes on my network and those were eventually replaced by a feature on Palo Alto firewalls.  I suppose they could be an acquisition target if their tech is good, but I think they’ll have a hard time competing against carriers and CDNs over time because the latter will have an easier time cross selling and up selling. I know I would rather expand services with a current vendor and push for volume discounts than go through the pain of cutting a contract with a new vendor for a niche tech.",
        "created_utc": 1602964698,
        "id": "g94urne",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602993498.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 19th of October\n\n\n\n## Upcoming events for Monday, October 19th\n\n - Stock splits:\n\n    - IVW @ **4:1** (Payable date: 10/16/2020)\n    - IJK @ **4:1** (Payable date: 10/16/2020)\n    - IJJ @ **2:1** (Payable date: 10/16/2020)\n    - IJT @ **2:1** (Payable date: 10/16/2020)\n    - IJS @ **2:1** (Payable date: 10/16/2020)\n    - NCTY @ **1:10**\n    - TRPXY @ **1:70**\n    - CXSE @ **2:1** (Payable date: 10/16/2020)\n\n - Expected earnings:\n\n  ADC, BFIN, BSRR, BXS, CCK, CDNS, EFSC, ELS, FBMS, FBSS, FMAO, FNB, FNCB, FUNC, GNTY, HAL, HNI, HSTM, HXL, IBM, IBTX, IHT, LCNB, LII, LOAN, LOGI, NWBI, ONB, ONCS, PETS, PFBC, PHG, PPG, SFBS, SFNC, SMBC, STLD, TBK, TMBR, WASH, ZION\n\n - Ex-div:\n\n  ATCO, CIVB, CMRE, DMB, HRZN, IGR, INSI, LND, OC, THQ, THW, VCIF\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.966%)\n    - 3-Month Bill Auction (previous: 0.105%)\n    - 6-Month Bill Auction (previous: 0.115%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Clarida Speaks\n    - FOMC Member Harker Speaks\n    - FOMC Member Williams Speaks\n    - Fed Chair Powell Speaks\n    - Federal Budget Balance (consensus: -124.0B, previous: -200.0B)\n    - Investing.com Gold Index (actual: 55.8%, previous: 53.7%)\n    - Investing.com S&amp;P 500 Index (actual: 45.9%, previous: 52.5%)\n    - NAHB Housing Market Index (consensus: 83, previous: 83)\n\n## Upcoming events for Tuesday, October 20th\n\n - Expected earnings:\n\n  ACI, AGR, AMX, ASRV, CALX, CATC, CBSH, CFB, CHSCP, CIT, CMA, CNI, CP, CSL, CTG, DCT, DOV, EQBK, FMBI, FULT, GATX, GPK, HOPE, HWC, IBKR, IQV, IRBT, IRDM, LMT, MAN, MBWM, NAVI, NBHC, NCBS, NFLX, OMC, PCAR, PEBO, PFC, PG, PLBC, PLD, PM, PNFP, PNR, PTSI, REXR, RF, SBNY, SMBK, SMIT, SNAP, SNV, STXB, SYF, TCS, TER, THC, TRV, TXN, UBS, UCBI, UEC, USNA, WDFC, WRB\n\n - Ex-div:\n\n  AZZ, LOW, PFLT, ZTS\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.136%)\n    - API Weekly Crude Oil Stock (previous: -5.422M)\n    - Building Permits (consensus: 1.520M, previous: 1.476M)\n    - Building Permits (previous: -0.5%)\n    - Chicago Fed President Evans Speaks\n    - FOMC Member Quarles Speaks\n    - FOMC Member Williams Speaks\n    - Housing Starts (consensus: 1.457M, previous: 1.416M)\n    - Housing Starts (previous: -5.1%)\n    - Redbook (previous: 0.4%)\n    - Redbook (previous: 1.2%)\n\n## Upcoming events for Wednesday, October 21st\n\n - Expected earnings:\n\n  ABT, AFI, ALGN, AN, APH, AVY, BANR, BCOV, BDN, BFC, BIIB, BKR, BOKF, BPFH, CADE, CCI, CLB, CMG, CNS, CSX, CTBI, CVBF, CVCY, DFS, EFX, EGBN, ERIC, ESBK, EVR, EW, FBC, FCCO, FR, FTI, GGG, GL, GSBC, GTY, HCSG, HLX, INBK, IPG, KALU, KEY, KMI, KNX, LAD, LOB, LRCX, LSTR, LVS, MMLP, MNSB, MTH, NDAQ, NEE, NEP, NTGR, NTRS, NVEC, NWE, PINE, PZN, RLI, RUSHA, RUSHB, SCL, SEIC, SLG, SLGN, SLM, SRE, STC, STL, SUI, TCBI, TDY, TMO, TRIB, TRN, TRST, TSC, TSLA, TZOO, UFPI, UMPQ, UNB, UNF, USAP, VMI, VZ, WGO, WHR, WSBC, WTFC, XLNX\n\n - Ex-div:\n\n  AGX, APA, BGH, CVS, HOLI, LTC, SUNS\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.213%)\n    - Beige Book\n    - Crude Oil Imports (previous: 0.078M)\n    - Crude Oil Inventories (consensus: -2.835M, previous: -3.818M)\n    - Cushing Crude Oil Inventories (previous: 2.906M)\n    - Distillate Fuel Production (previous: -0.263M)\n    - EIA Refinery Crude Runs  (previous: -0.276M)\n    - EIA Weekly Distillates Stocks (consensus: -2.096M, previous: -7.244M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.9%, previous: -2.0%)\n    - FOMC Member Brainard Speaks\n    - FOMC Member Mester Speaks\n    - Gasoline Inventories (consensus: -1.607M, previous: -1.626M)\n    - Gasoline Production (previous: -0.282M)\n    - Heating Oil Stockpiles (previous: -0.398M)\n    - MBA 30-Year Mortgage Rate (previous: 3.00%)\n    - MBA Mortgage Applications (previous: -0.7%)\n    - MBA Purchase Index (previous: 311.1)\n    - MBA Purchase Index (previous: 311.1)\n    - Mortgage Market Index (previous: 798.9)\n    - Mortgage Refinance Index (previous: 3,612.3)\n    - Seevol Cushing Storage Report (previous: 3.923M)\n\n## Upcoming events for Thursday, October 22nd\n\n - Expected earnings:\n\n  AAL, AB, ABCB, ACBI, AEP, ALK, ALLE, AMZN, ANIK, AQMS, ARCH, ARGX, ASB, ASPS, AUB, AXTA, BANC, BHE, BJRI, BMTC, BOOM, BPRN, BWB, BY, CASS, CFFI, CHKP, CIZN, CLBK, CLW, COF, CRI, CRS, CSLT, CSTR, CTS, CTXS, CURO, CX, CYBE, DECK, DGX, DHR, DOW, DRQ, DVD, EHTH, ENTG, EQNR, EQT, EVBN, EWBC, FAF, FBIZ, FCX, FFBC, FFNW, FITB, FIX, FMBH, FORR, FSBW, FWRD, GBCI, GLPG, GNCA, GPC, GTLS, GWW, HBAN, HEES, HFWA, HLI, HRI, HTBK, HTH, ICBK, IIIN, INTC, KMB, KO, LBAI, LLNW, LNN, LUV, MANH, MAT, MCBC, MCBS, MOFG, MRBK, MSBI, MTB, MTRN, MYFW, NOC, NOK, NUE, NWG, NWGI, NXGN, OIS, OPBK, ORC, ORI, OSIS, OZK, PAC, PATK, PBCT, PCB, PDS, PHM, POOL, PSTV, PTEN, PWOD, RBNC, RCI, RFL, RNGR, RS, RVSB, SAFE, SASR, SB, SCHN, SCKT, SGLB, SHBI, SHI, SIRI, SIVB, SMMF, SMSI, SNA, SON, SONA, SRCE, STBA, STM, STND, STRT, T, TAL, TBBK, TBNK, TFII, TOWN, TPH, TR, TSCO, TV, UBCP, UBSI, UHS, UNP, USX, UTMD, VALE, VICR, VLO, VLY, VRSN, VVI, WAL, WBS, WRLD, WSFS, WSO, WSO.B, WST, ZDGE\n\n - Ex-div:\n\n  BDGE, BGB, BGX, BSL, BUSE, BWG, CL, COKE, DEX, DFP, DMO, DX, EFF, EFR, EFT, EHI, EMD, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EVG, EVT, EXD, EXG, FFC, FLC, FMN, GAIN, GDO, GFY, GLAD, GOOD, HIE, HIO, HIX, HYI, IGI, KALU, LAND, LKFN, MGU, MMU, MTT, NVT, PBA, PFD, PG, PNR, PPT, SBI, SM, THO, TPZ, WEA, WIA, WIW, WSM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 5-Year TIPS Auction (previous: 0.020%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Continuing Jobless Claims (consensus: 9,500K, previous: 10,018K)\n    - Existing Home Sales (consensus: 5.0%, previous: 2.4%)\n    - Existing Home Sales (consensus: 6.30M, previous: 6.00M)\n    - FOMC Member Barkin Speaks\n    - FOMC Member Kaplan Speaks\n    - Initial Jobless Claims (consensus: 860K, previous: 898K)\n    - Jobless Claims 4-Week Avg. (previous: 866.25K)\n    - KC Fed Composite Index (previous: 11)\n    - KC Fed Manufacturing Index (previous: 18)\n    - Natural Gas Storage (consensus: 55B, previous: 46B)\n    - US Leading Index (consensus: 0.7%, previous: 1.2%)\n\n^^^^2020-10-19",
        "created_utc": 1603101619,
        "id": "g9b5orl",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1603130419.0
    },
    {
        "author": "parlay_king",
        "body": "CDNS - great entry point - earnings on the 19th should be solid.",
        "created_utc": 1602860303,
        "id": "g90a7i5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602889103.0
    },
    {
        "author": "kdrisck",
        "body": "The issue is this: AMZN, GOOG, MSFT do not want to make $10 a TB transferring their competitors data around. And CDNs don’t really make a whole lot of sense if you need 6 of them in each cloud region to deliver your content based on which provider those workloads are residing with. The fact that Akamai, Fastly, etc. are all neutral in the cloud war is kinda the point. More companies will find themselves in hybrid multi cloud environments in the next 3-5 years, and there will need to be neutral parties to handle the relationships between the giants.",
        "created_utc": 1602814865,
        "id": "g8ypgbx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602843665.0
    },
    {
        "author": "RIC_FLAIR-WOOO",
        "body": "CDNS has around 15% revenue exposed to China and seems to lean more on recurring revenue from licensing IP.",
        "created_utc": 1603464704,
        "id": "g9rhsh8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603493504.0
    },
    {
        "author": "parlay_king",
        "body": "CDNS earnings AH today.. anticipating a beat.. solid company",
        "created_utc": 1603107968,
        "id": "g9bbzud",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603136768.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "AKAM usually doesn't nothing. But yeah, I noticed LLNW too (hard not to). I don't trust FSLY at all. I only have gay shares this time around. But overall, I think CDNs are kinda weak. NET seems the leader, for now.",
        "created_utc": 1603570139,
        "id": "g9y1cns",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603598939.0
    },
    {
        "author": "Radman41",
        "body": "Be careful with FSLY. Watch how Akamai does Wednesday. If they tank, FSLY is probably going nowhere. LLNW already got pummeled, fastly already adjusted their guidance. CDNs rise curve is flattening and analysts projections might be too bullish.\nIf Akamai rises, chances are 50/50 for FSLY to go up too.",
        "created_utc": 1603567181,
        "id": "g9xviw7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603595981.0
    },
    {
        "author": "Style0790",
        "body": "Trudeau's Liberal Party...mhmmm. Lots of scandals. Bad the first time around and yet most CDNs revoted him into office. Next. Those who fail to learn from history are doomed to repeat it. Moving along.",
        "created_utc": 1601594894,
        "id": "g7cdrcw",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1601623694.0
    },
    {
        "author": "Artivist",
        "body": "A word of caution. There is an endless amount of \"free\" youtube videos and courses from TD Ameritrade, TastyTrade, eTrade, Fidelity, etc. But, what they don't show you is how someone actually puts that knowledge to practice into developing a strategy that allows you to make an income while properly managing risk. The course I went through helped with that and may be most people don't necessarily have the issues that I ran into using these courses. But, in hindsight, I wasted way too much time just going through these free videos without really understanding how they work in the real world.     \n    \nEdit: I didn't want to appear as if I'm spamming but I got a couple of DMs asking about the course I took. It's from ZipTrader. You can get 70% of the information from his youtube channel. But, I wanted something more structured and he really goes in a lot more detail in the course. I highly recommend it. Check out his free videos on YouTube particularly the one on why he is a trader and if it resonates with you (like it did for me), and you want to go ahead and check out the course, DM me for a discount coupon.",
        "created_utc": 1601593017,
        "id": "g7ca0e6",
        "score": 13,
        "subreddit": "options",
        "created": 1601621817.0
    },
    {
        "author": "4569",
        "body": "Yes, fund a TDAmeritrade account with a $100 and there are plenty of legit education classes on there and webcast to teach you. Start as soon as you can part with the $100 and just try to get 1% better everyday. This is better than trying to sift through a bunch of sleepy and amateur learning resources. Fidelity also has the same thing but I prefer TD Ameritrade. I think these are both reputable places to start with educational resources and offer enough customer service. I prefer TD Ameritrade.",
        "created_utc": 1601596785,
        "id": "g7ch3fe",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1601625585.0
    },
    {
        "author": "khdo1992",
        "body": "Recommend on fidelity",
        "created_utc": 1601693571,
        "id": "g7h706i",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1601722371.0
    },
    {
        "author": "halflifee134",
        "body": "Naturally after fidelity auto sells my 334P we start to drop",
        "created_utc": 1601666116,
        "id": "g7fkjop",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601694916.0
    },
    {
        "author": "UrKewlito",
        "body": "Anybody here day trade on fidelity pro?",
        "created_utc": 1601595051,
        "id": "g7ce280",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601623851.0
    },
    {
        "author": "Art0002",
        "body": "TOS has great charting. Very flexible. Very nice but it can be overwhelming. But it is good. \n\nYou need to apply to trade the different options trading levels. Some people complain that they can’t get to the level they want so they change brokerages. \n\nIn my experience Tastyworks is the most liberal in giving out option permissions and I think they are a little cheaper.\n\nI trade with TW, TDA and Fidelity. I trade Roth accounts and cash accounts. \n\nThe Roth and IRA accounts have limited trading permissions but I’m ok with that. You can’t have margin you can’t sell naked calls. \n\nYou want to be able to trade ...\n\nCash secured puts\nCovered calls\nSingle leg calls/puts\nAnd importantly call/put spreads\n\nIf you BUY an option, that is your max loss. \n\nIf you SELL an option, that is your max gain. \n\nI strongly suggest that you take advantage of TOS paper trading. It’s free. Practice trading options for months. For free. No risk. You can practice all the strategies and most importantly learn to manage a trade. \n\nYou will need to roll a trade out in time to give yourself more time to be right. You can also roll a trade out and up/down. \n\nI’m not trying to teach you how to trade, but option trading requires management. It is as important to manage winners as well as losers. \n\nMonths ago I bought SNAP at $19.8x and sold a $20 covered call for $1. That is 5%. Not bad for a month. \n\nI’ve rolled it out and up so I now have a $25 covered call. I’m still ITM but the point is that it’s never only one trade. And the trade isn’t over. \n\nAm I an expert - no. But just realize that options trading is not one and done. It’s not. \n\nAnd it is a sum zero game. Your lose is my gain. We all don’t profit. Stocks go up and everyone wins. That is not true with options. \n\nYou need to be very smart to make money. Smarter than average. Are you?\n\nPaper trade. See how you stand.",
        "created_utc": 1601686908,
        "id": "g7gw1hi",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601715708.0
    },
    {
        "author": "AzazelPrays",
        "body": "Fidelity won’t let me sell naked poots 😤😤\nFuck you fidelity, I know my personal risk tolerance!",
        "created_utc": 1601579695,
        "id": "g7bhlqc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601608495.0
    },
    {
        "author": "Tycrist8",
        "body": "Got locked out of RH have to use fidelity.  God damn this shit sucks wheres my cool confetti when i YOLO my whole account?",
        "created_utc": 1601582054,
        "id": "g7bnfmn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601610854.0
    },
    {
        "author": "MMOAddict",
        "body": "Does any broker not do that?  I wanted to find this out myself so I compared prices that I could trade options at cross platform and it was exactly the same on Fidelity and TD Ameritrade as Robinhood. I would put the limit price above halfway point between the bid/ask and it sat there for a few hours on all 3 platforms until the bid/ask moved enough to put the halfway point on my limit price. \n\nI did it twice on BAC and once on CVX. They sold at almost the exact same moment each time.  The only difference was I paid 65 cents for each of those transactions on the other platforms.",
        "created_utc": 1601590746,
        "id": "g7c5w6a",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601619546.0
    },
    {
        "author": "ControlPlusZ",
        "body": "You can enable international trading with fidelity. This will likely be available OTC in the USA as well. \n\nYou can google “fidelity international trading” for details. Fidelity charges a commission (20-30 bucks I think) and 1% currency fee. These fees are if you trade on a foreign exchange with a US account.",
        "created_utc": 1601567756,
        "id": "g7aq6gc",
        "score": 2,
        "subreddit": "shroomstocks",
        "created": 1601596556.0
    },
    {
        "author": "DKNG-STONK",
        "body": "I would guess no, but I haven’t looked into it for all brokerages. Tho I’ve never heard anyone complaining. \n\nI can definitively tell you fidelity does not have a fee for ticker change.",
        "created_utc": 1601573548,
        "id": "g7b3bx7",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1601602348.0
    },
    {
        "author": "PapaCharlie9",
        "body": "I don't use Fidelity, but I watched this video and my guess is that white means neutral strategies, green is bullish, red is bearish.\n\nhttps://www.fidelity.com/learning-center/tools-demos/active-trader-pro-platforms/options-statistics-atp-video",
        "created_utc": 1601579784,
        "id": "g7bhtk1",
        "score": 2,
        "subreddit": "options",
        "created": 1601608584.0
    },
    {
        "author": "OneCheapBastard",
        "body": "SpaceX is a private company, you can’t invest in them except for a few select funds offered by Fidelity but even then your max exposure to SpaceX will be 0.233% ($FBGRX)",
        "created_utc": 1601667421,
        "id": "g7fo4qi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601696221.0
    },
    {
        "author": "Connortbh",
        "body": "I love fidelity. Customer service is great too IMO.",
        "created_utc": 1601593081,
        "id": "g7ca57q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601621881.0
    },
    {
        "author": "Ken385",
        "body": "The only retail broker that allows access to the full session is Interactive Brokers.  Fidelity offers access to that last couple of hours.  You can still see the overnight markets with most brokers.",
        "created_utc": 1601664096,
        "id": "g7ffpcs",
        "score": 2,
        "subreddit": "options",
        "created": 1601692896.0
    },
    {
        "author": "Dmoan",
        "body": "Haha Fidelity Magellan fund is down 11% over 20 years and they are now switching to etf, this is why you don’t buy funds based on previous performance (the fund avg 25% return in 90s).",
        "created_utc": 1601666335,
        "id": "g7fl5ri",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601695135.0
    },
    {
        "author": "lobster_johnson",
        "body": "Competitors such as Fidelity, Schwab, and Vanguard are also commission-free\n\nWhat you get with these brokerages:\n\n* Traditional and Roth IRAs as well as things like 529 accounts\n* Joint accounts (joint tenancy and all the other forms)\n* Checking account with debit card and check/bill payment\n* Access to mutual funds\n* Access to bonds, futures, and other securities\n* Superb 24/7 chat and phone support. (I've only ever used Schwab, which is fantastic, but the others are known for great support.)\n* Financial advice and free workshops\n* As far as I can tell, better order flow. Schwab abides by NBBO and provides price improvement on approximately\n90% of orders. (Unlike RH, other brokerages apparently don't make a lot of money on order flow.)\n* Native real-time trading apps (Schwab has StreetSmart, Fidelity has Active Trader Pro)\n* Roboadvisors\n\nNone of this costs anything extra, though tailored financial advisor services do come extra.\n\nI think one of the big draws of a brokerage like Schwab, Fidelity, and Vanguard is access to mutual funds. At Robinhood you're limited to stocks, which includes ETFs. Mutual funds offer a wider range of funds, including target date funds and tax management funds. (Contrary to what many people on Reddit seem to believe, mutual funds don't just mean expensive actively managed funds! There are tons of cheap funds, and some that are even cheaper than ETFs.) For example, my IRAs are all in target date funds that have a fee of just 0.08%.\n\nIf I were starting out today, I'd pick Vanguard. Fantastic company with a uniquely altruistic vision.",
        "created_utc": 1601703676,
        "id": "g7hlorb",
        "score": 2,
        "subreddit": "investing",
        "created": 1601732476.0
    },
    {
        "author": "MyOldAolName",
        "body": "Fidelity just canceled my UVXY purchase from 2 months ago and sold the open covered calls I had on them. They reverse the original purchase and give me $22.09/share or what I paid but sold the contracts at market price for a profit, ended up making a quick $600 off the deal.",
        "created_utc": 1601566474,
        "id": "g7an6ll",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601595274.0
    },
    {
        "author": "portlander33",
        "body": "Same here.  \n\n\nFidelity is one the biggest investors in Nikola.  I wonder if that has anything to do with it.",
        "created_utc": 1601602050,
        "id": "g7cqr55",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601630850.0
    },
    {
        "author": "budflight",
        "body": "I’m trying to gradually take a large cash position and buy into QQQ and SPY. Had it all in my main IRA in a Fidelity Date fund but wanted to buy on the dips a few thousand dollars at a time. Watching from the sidelines as markets start to rise again makes me wish I had dumped it all in at once. Do you think there will be another downturn which will make my wait the right move?",
        "created_utc": 1601556774,
        "id": "g7a44rq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601585574.0
    },
    {
        "author": "BrownShoe4",
        "body": "If you switched to a real broker (TD Ameritrade, Fidelity, etc.) you can do exactly this for no extra cost to Robin hood",
        "created_utc": 1601558722,
        "id": "g7a75og",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601587522.0
    },
    {
        "author": "Breeze_on_my_nutz",
        "body": "Don’t have settled funds fidelity takes 4 days to transfer. FUCKIN BULLSHIT BY THE WAY. But whatever.",
        "created_utc": 1601578942,
        "id": "g7bftf7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601607742.0
    },
    {
        "author": "stayyfr0styy",
        "body": "Instead of paying money for a course, I just put a couple hundred into Robinhood and let it go. Cheaper than a course and you learn more if you lose. Discovered an iron condor just by looking at bear call and bull put spreads, and Robinhood identified the move as an iron condor.\nI also looked through an options for dumbys book at borders one time. Good for the basics.\n\nRobinhood gets a lot of hate, but it displays things a lot more clearly than fidelity, td ameritrade, Webull, etrade in my opinion. I wouldn’t be able to make a lot of my trades on those others because of how much more complicated it is.\n\nJust start small and expect to lose it all. Then as you figure out how it works, flip through some books and videos and you’ll grasp what they’re talking about much easier than if you had no hands on experience.",
        "created_utc": 1601602445,
        "id": "g7crizq",
        "score": 1,
        "subreddit": "options",
        "created": 1601631245.0
    },
    {
        "author": "PredatoryCat",
        "body": "That's why I use Fidelity.",
        "created_utc": 1601600846,
        "id": "g7cog1t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601629646.0
    },
    {
        "author": "Zippytuna",
        "body": "I use TDA, but be aware they charge $38 when the units split. I've heard on here that Fidelity doesn't charge.",
        "created_utc": 1601620411,
        "id": "g7dk7cq",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601649211.0
    },
    {
        "author": "mikedpoisson",
        "body": "Yeah, Fidelity doesn’t charge to split units. You just have to call them up and it takes 2-3 days to change into warrants and common shares.",
        "created_utc": 1601622546,
        "id": "g7dmzka",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601651346.0
    },
    {
        "author": "NotAnAlligator",
        "body": "Fidelity",
        "created_utc": 1601541667,
        "id": "g79o7y7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601570467.0
    },
    {
        "author": "chikenbeer",
        "body": "Fidelity. Hands down best I tried.",
        "created_utc": 1601648775,
        "id": "g7ekodn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601677575.0
    },
    {
        "author": "cbh1997",
        "body": "So would you recommend fidelity over RH? I’m thinking about withdrawing and trying a different trading app",
        "created_utc": 1601653464,
        "id": "g7etof9",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601682264.0
    },
    {
        "author": "Thraex_Exile",
        "body": "Fidelity does the same. Very large window letting you know you’re capped out.",
        "created_utc": 1601655585,
        "id": "g7exvro",
        "score": 1,
        "subreddit": "investing",
        "created": 1601684385.0
    },
    {
        "author": "MyOldAolName",
        "body": "Mine is a work sponsored 401k, where I see the Brokeragelink there is an asterisk next to it saying that it's linked to my work 401k. Hope that helps. Also, I was told by Fidelity that how much freedom and what percent of my total 401k that can be in there is dictated by my employer. Good luck getting it set up.",
        "created_utc": 1601658233,
        "id": "g7f357f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601687033.0
    },
    {
        "author": "Boss1010",
        "body": "All my other money is in Fidelity. I deposited $5",
        "created_utc": 1601590979,
        "id": "g7c6bef",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601619779.0
    },
    {
        "author": "gordonopolis",
        "body": "Yes I did at both fidelity and Schwab",
        "created_utc": 1601593446,
        "id": "g7cavuw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601622246.0
    },
    {
        "author": "Wololo242",
        "body": "Yes, especially once you can trade synthetic stocks, the entire world will have access to stock trading 24 hours a day on decentralized exchanges, where all you need is an open source phone wallet. Not only that, the common person will be able to earn the same yield figures that Robin Hood and fidelity make by lending your stocks right now to margin traders (7-10% annually). The 8:30 to 4pm trading window is an inefficient social construct of days past. Regulators need to step up their game to 24 hours a day, otherwise they will generate resentment among stock traders and lose control of the situation, which wouldn’t be good. The best way for them to do this would be to regulate online identities in the most equitable way possible to people who were not born with identities (usually people in third world countries), otherwise again they will generate resentment and lose control of the situation.",
        "created_utc": 1601563380,
        "id": "g7ag4ba",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601592180.0
    },
    {
        "author": "truemeliorist",
        "body": "Interesting! With fidelity, at least the way our plan is set up, everything we \"can't touch\" is kept in a separate cash account. Once things vest or meet minimum holding periods, they transfer it into a separate individual account we own. At that point the shares are ours to do with as we please.",
        "created_utc": 1601597469,
        "id": "g7ci96c",
        "score": 1,
        "subreddit": "options",
        "created": 1601626269.0
    },
    {
        "author": "oohpulchritude",
        "body": "Wait. Am I imagining things? Most investing platforms have moved to 0 commission trading for stocks, ETF's, and options. Mutual funds may vary.\n\nFidelity, TD Ameritrade, E-Trade, Charles Swab... all sufficient for the Robinhood amateur demographic.",
        "created_utc": 1601703683,
        "id": "g7hlp0l",
        "score": 1,
        "subreddit": "investing",
        "created": 1601732483.0
    },
    {
        "author": "WSBVoteBot",
        "body": "**A Submission was Spammed by Vote**\n___\n**Title:** Why do you need 2k in your margin account on fidelity?\n\n**URL:** https://redd.it/j4bvms\n___\n[Click Here to Vote to Approve](https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=restore&amp;message=j4bvms) if this is a good submission.\n\nHey /u/stockmaster6969, you're encouraged to copy and paste the approval link into the Daily Discussion thread for help restoring your post.\n\nUsers who Voted:\nstockmaster6969\nLokyeezy\nnahvan10",
        "created_utc": 1601712321,
        "id": "g7hvaoj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601741121.0
    },
    {
        "author": "SirGlass",
        "body": "Schwab, fidelity, vanguard are probably the most popular brokerages",
        "created_utc": 1601741109,
        "id": "g7ivyxy",
        "score": 1,
        "subreddit": "investing",
        "created": 1601769909.0
    },
    {
        "author": "DystopianRealist",
        "body": "You won't be able to buy mutual funds through RH, as far as I know, nor would I recommend it, but you can absolutely replicate them through ETFs, and you can do it through fractional shares. There are more ideal ways, and if you're investing long term, you would want assistance limiting taxes as much as possible, but there is absolutely no reason why you couldn't start a small fund on your own through robinhood.\n\nBond ETFs you might look at are TLT, TIPS, BND, and of course there are tons of others (those just happen to cover different durations or different strategies, so I thought I would toss out some names so you start looking at what different bonds have for goals -- read the prospectus).\n\nA basic 80/20 portfolio or 60/40 would simply be something like (VT, VTI, VOO - Pick one for now or similar equivalents, but VTI is generally considered slightly lower risk than the other two, with good exposure to the full USA market) and add BND to the bond portion, for simplicity.\n\n&amp;#x200B;\n\n\\*\\*Going to pitch Fidelity to you here, and explain why (full disclosure, I have a broker account with Fidelity, but they are not my primary broker)  :\n\nIf you intend on investing long term, you should get professional financial advise, and be aware that a company like Fidelity, which actually does handle mutuals, tax advantaged acccounts, retirement plans, and so forth, might be a better choice than a broker that you have to email even for simple questions. Fidelity also offers fractional shares, including on ETFs, and they have good customer service available via phone. That would be my move from the start, before you have to start moving funds from one broker to another, as long term investing like this includes trying to reduce taxes and fees as much as possible as part of the general strategy.",
        "created_utc": 1601600896,
        "id": "g7cojkk",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1601629696.0
    },
    {
        "author": "dvdmovie1",
        "body": "From an interview with Fidelity Contrafund manager Will Danoff: \n\n\"So, I'd say it's a very healthy give-and-take and dialogue. And I would say, often because Joel and I and all the other fund managers started as Fidelity research analysts, when a new analyst arrives, they usually show up at my office with a list, and say “I'm the new railroad analyst. Here are my names, and I like XYZ railroad because the group's trading at 14 times earnings, and this ones trading at 11 times earnings.” And I might say, “Wow, that's interesting. Why is that one trading at such a discount to the group?” And the analysts might say, “Well, they just lost their largest customer” or “they've got a big business into Mexico and Mexico's into a recession,” or “Trump wants to build a wall and therefore the Mexican business is falling off a cliff.” **And I usually say, “That's not the type of company I'm interested in. I'm interested in companies that are doing well, where the earnings outlook is positive, where earnings per share is growing. Maybe it's growing faster than people think. What do you have on your list that would fit that bill even if it's more expensive than the average company in your group?”** So, it's that's sort of give-and-take. And I might encourage an analyst to reorient their priority list to help me look for stocks that fit my ideal pattern.\" (https://www.morningstar.com/podcasts/the-long-view/40)\n\nToo many people I think jump to an Intel because \"LOOKS CHEAP!\" when they'd have been better off with the things that appear more expensive where the company is doing well and the outlook is positive.\n\nIntel spent $15B on Mobileye, and for all the discussion of self driving, I don't know that I've heard anything much regarding Mobileye probably since they bought it.\n\nLastly,\n\n\"Intel completely missed out on the smartphone revolution, too, having been unable to come up with an answer for the rise of the ultra-low-power ARM SoC. After its smartphone insurgency, ARM chips quickly moved on Intel's territory by spreading to tablets and laptops. Intel's latest black eye is being completely dumped by Apple, which, after building its own ARM design house for the iPhone and iPad, has announced plans to upscale its ARM chips to Mac laptops and desktops.\"\n\nhttps://arstechnica.com/gadgets/2020/07/heads-roll-at-intel-after-7nm-delay/\n\n\"Laptops and desktops are the next great frontier for Apple's chip division. That division will help the company avoid the same fate that has befallen Android smartwatch manufacturers: letting some other company dictate your product lineup. Apple's plans to update the Mac have often been stymied by Intel's product roadmap, and Intel does not make chips that serve all of Apple's design priorities. The new CPU will be just one part of an Apple-designed system-on-a-chip that would also include (among other things) an Apple GPU and a desktop version of Apple's Neural Engine machine learning and AI processor found in the iPhone and iPad.\"\n\nhttps://arstechnica.com/gadgets/2020/06/this-is-apples-roadmap-for-moving-the-first-macs-away-from-intel/\n\n\"Intel actually says that the issues with its current 7nm production means that production is trending a year behind its internal roadmap. For some reason, though, the company says that being a year behind schedule will still only result in that aforementioned six-month delay to market. For comparison, AMD has already been outputting its own Ryzen 4000 chips based on its 7nm architecture for months, which have been handily outperforming Intel’s offerings.\"\n\nhttps://www.theverge.com/circuitbreaker/2020/7/23/21336356/intel-7nm-chips-next-gen-delay-q2-2020-earnings-amd-10nm-tiger-lake-desktop-laptop-cpu",
        "created_utc": 1601630089,
        "id": "g7dupx5",
        "score": 1,
        "subreddit": "investing",
        "created": 1601658889.0
    },
    {
        "author": "_umm_0",
        "body": "HYLN is untradable in Vanguard and Fidelity this morning. Was going to roll a $60 covered call to next week and a higher strike price if I could but looks like it won't happen. Eh, maybe the premium will be higher this Monday.",
        "created_utc": 1601646165,
        "id": "g7eg2tz",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601674965.0
    },
    {
        "author": "Dumb-Retail-Trader",
        "body": "PTK unit splits into one share and one whole warrant huh? This sounds like a good arb opportunity. \n\nI think I also need to move to Fidelity. Tried to arb a 6 cents or so for CCIV units vs commons+warrants and it took ML a whole week to split and $30. Don’t mind the $30 as much but a week is so damn long. I keep reading here Fidelity is much quicker like 2 days.",
        "created_utc": 1601652348,
        "id": "g7ergiv",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601681148.0
    },
    {
        "author": "AssistanceFluid",
        "body": "https://www.stockbrokers.com/compare/fidelityinvestments-vs-robinhood\nCheck this out for detailed analysis to compare Fidelity and Rh.",
        "created_utc": 1601655000,
        "id": "g7ewpla",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601683800.0
    },
    {
        "author": "Zamoon",
        "body": "Thinking of dropping rh. Is Fidelity good?",
        "created_utc": 1601706472,
        "id": "g7hov8j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601735272.0
    },
    {
        "author": "sirvapedalot",
        "body": "Yeah I suspect they’ll go with Goldman and Morgan Stanley as some of the main underwriters so I’m guessing maybe it’ll be available through Fidelity but not sure who else\n\nI also have Schwab, TD, and WeBull but they have more limited IPO access usually",
        "created_utc": 1601706479,
        "id": "g7hovi2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601735279.0
    },
    {
        "author": "domyorke",
        "body": "I started with robinhood and it’s a great platform for getting started as it’s intuitive and easy to understand. I recently opened a Roth IRA with fidelity and I’m loving that tho as well. If you haven’t, I absolutely recommend it. You can put money in there and buy stocks just like robinhood, plus you have access to international stocks if that matters to you, and it will be tax free when you turn 59.5. Plus, you get free withdrawals of your contribution amount anytime (you’re only taxed on your gains for early withdrawals I believe). So there’s not much of a downside. This is coming from a 28 year old who wishes he did this 6 years ago instead of this year lol",
        "created_utc": 1601707175,
        "id": "g7hpn0c",
        "score": 1,
        "subreddit": "investing",
        "created": 1601735975.0
    },
    {
        "author": "AnotherThroneAway",
        "body": "&gt; price improvement on approximately 90% of orders.\n\nI'm Fidelity and find it absolutely weird when I don't get a price improvement on a trade. Ordering matters!",
        "created_utc": 1601711323,
        "id": "g7hu6nh",
        "score": 1,
        "subreddit": "investing",
        "created": 1601740123.0
    },
    {
        "author": "dudeitsadell",
        "body": "they sell your options when they are ITM? wtf.. ive never heard of this. get on fidelity bro",
        "created_utc": 1601699062,
        "id": "g7hfqzz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601727862.0
    },
    {
        "author": "LiquidatorBruntFCA",
        "body": "Why are you trading options on vanguard instead of etrade, fidelity or ToS?",
        "created_utc": 1601704127,
        "id": "g7hm7qo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601732927.0
    },
    {
        "author": "oleosmirf",
        "body": "I have Fidelity. I can buy HYLN, but I can't say sell any of my shares.",
        "created_utc": 1601667066,
        "id": "g7fn7bb",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601695866.0
    },
    {
        "author": "Patereye",
        "body": "Fidelity wont even let me short this stock 0\\_0  \n\n\nNot enough shares to fill the request???",
        "created_utc": 1601576338,
        "id": "g7b9rzs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601605138.0
    },
    {
        "author": "SElonsC42069",
        "body": "Bruh I just found out my dad has been 💎 ✋✋ AMZN for over a decade\n\nPuts on my mother's fidelity, can't be my biological father",
        "created_utc": 1601557576,
        "id": "g7a5d2k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601586376.0
    },
    {
        "author": "BigSalad",
        "body": "That was clear with fact He’s using fidelity. He’s no robinhood scrub",
        "created_utc": 1601543299,
        "id": "g79pixu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601572099.0
    },
    {
        "author": "dajuhnk",
        "body": "Robinhood user asking for OTC stocks lol. Get fidelity you'll be glad you did. Otherwise just keep trading NASDAQ stocks. It's not about the price of the stock it's about the percentage",
        "created_utc": 1601720091,
        "id": "g7i2z19",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601748891.0
    },
    {
        "author": "ImmediateHistorian2",
        "body": "Put all 85K into a good brokerage account - Schwab - Fidelity - IB - etc...\n\n90% into TSLA stock - then forget about it. \n\nFor the other 10% Use no more than 5% of the remaining cash for each other investment - options, whatever. Good luck to you.",
        "created_utc": 1601683404,
        "id": "g7gqhsv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601712204.0
    },
    {
        "author": "Evaloalove",
        "body": "Get rid of RH and get fidelity.",
        "created_utc": 1601683650,
        "id": "g7gqw0x",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601712450.0
    },
    {
        "author": "Frankie__Spankie",
        "body": "The only way you lose all your money in the stock market is by blowing it all in options and/or blowing it all on penny stocks that get delisted. \n\nThose both sound like gambling problems and they both sound like he'd have that problem wherever he goes, whether it's Robin hood, vanguard, fidelity, etc. Maybe get him some help or at least teach him that the stock market isn't a slot machine.",
        "created_utc": 1601724004,
        "id": "g7i95sz",
        "score": 1,
        "subreddit": "investing",
        "created": 1601752804.0
    },
    {
        "author": "Sloppy_JoeBK",
        "body": "Don’t know if this is helpful but in fidelity you can do it by checking closed positions page.",
        "created_utc": 1601731756,
        "id": "g7ifd34",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601760556.0
    },
    {
        "author": "myke_oxbig45",
        "body": "Fidelity small pp Schwab big pp",
        "created_utc": 1601733208,
        "id": "g7ihuib",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601762008.0
    },
    {
        "author": "shrpdrssd",
        "body": "For index funds, it seems mutual funds now often cheaper than ETF. Say S&amp;P 500, plenty MF are under 2 basis points, but no ETF this cheap.\n\nAnd fidelity created zero MF, not ETF.",
        "created_utc": 1601733665,
        "id": "g7iiozz",
        "score": 1,
        "subreddit": "investing",
        "created": 1601762465.0
    },
    {
        "author": "AnonymousWjsjsbsb",
        "body": "Moving to Ameritrade. Fuck schwab and their rich person fees, and fuck Fidelity and their voice verification and anal risk department.",
        "created_utc": 1601712126,
        "id": "g7hv2fk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601740926.0
    },
    {
        "author": "marnuslabushane",
        "body": "Schwab has given me no such problems and like Fidelity, is fee free for OTC.",
        "created_utc": 1601550923,
        "id": "g79whqy",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601579723.0
    },
    {
        "author": "GBAgency",
        "body": "Fidelity is solid. Interface is like Windows 98 and iOS/android apps are nothing special.\n\nBut it’s utterly functional and their support is great; that is, you can always chat with a professional and real human.\n\nTastyworks is complex and functional. Some issues on certain types of iOS devices, but their interface is top-notch and every bit as complex and capable as you’d like it to be.",
        "created_utc": 1601576857,
        "id": "g7baxrl",
        "score": 1,
        "subreddit": "options",
        "created": 1601605657.0
    },
    {
        "author": "BrandinoGames",
        "body": "I started trading when I was 14. At first, I just found random stocks and threw money at it, and cared about every single penny I earned or lost. Now, I can look back on it an laugh. I had major paper hands, and just couldn't resist checking the prices to see if I had lost a few dollars. \n\nI would say that most people would and should be investing as early as possible, reason being that you can put money in index funds and hold for the long term. Trading is a different matter, I would say that around the age of 15-16 is probably a good time to start. Start with a little bit, and play around with it. The reason being is that you're able to experiment and learn things about the market before actually committing larger amounts of money. \n\nAs for starting off, I would highly recommend watching youtube videos or a udemy course on investing basics, as well as looking at Investopedia. Those in combination with reading posts on specific reddit subs (r/stocks, r/finance, r/stockmarket, r/options) helped me get started. Reading reddit posts gets me more interested into trading. Stay away from WSB though, there's a lot more meme material there.\n\nIf you want to invest and not trade, then research basic market principles, how index funds/ETFs work, and research various ETFs. Generally I like to look at total market index funds, mid-large cap company funds, and emerging markets/fast growing markets such as Tech, EV, and Cannabis.\n\nIf you want to minimize risk, hold ETFs for the long term. Open a brokerage account through Fidelity, TD Ameritrade, Schwab, etc and put a portion of your paycheck into it. I actually really like this short document that has an ETF trading strategy: [https://www.etf.com/docs/IfYouCan.pdf](https://www.etf.com/docs/IfYouCan.pdf)\n\nTL;DR: Look at a basic investing course on Udemy or YouTube to learn basics of the market, and read about things on specific reddit subs. Invest and don't trade (investing tends to be holding for the long term while trading tends to be more short term). Invest in ETFs, and there are many different resources for finding which ones to invest in.",
        "created_utc": 1601579196,
        "id": "g7bgdso",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601607996.0
    },
    {
        "author": "antoniosrevenge",
        "body": "I suggest reading the [PF prime directive](https://www.reddit.com/r/personalfinance/wiki/commontopics) to determine if investing is the next right step for you and learn more about types of accounts to contribute to, and their wiki page on [investing](https://www.reddit.com/r/personalfinance/wiki/investing) (similar info covered in this sub’s wiki)\n\nI also recommend the [Boglehead’s wiki](https://www.bogleheads.org/wiki/Bogleheads®_investment_philosophy)\n\nStart with broad market index funds if you don't know what you're doing - agree that Vanguard, Fidelity, or Schwab are all good options",
        "created_utc": 1601746709,
        "id": "g7j5y7z",
        "score": 1,
        "subreddit": "investing",
        "created": 1601775509.0
    },
    {
        "author": "GrowStrong1507",
        "body": "yea same couldn't find the ticker on any broker i have. TD WB RH or Fidelity",
        "created_utc": 1601704373,
        "id": "g7hmi73",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601733173.0
    },
    {
        "author": "Normie_O1",
        "body": "I second this. Fidelity is a hell of a beast if used on pc",
        "created_utc": 1601707302,
        "id": "g7hprm0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601736102.0
    },
    {
        "author": "Prophetic_Pisces",
        "body": "I dislike Robinhood because I think it's a shitty app when there are (IMO) better options from larger institutions with more to offer. Robinhood did great with ushering in new investors and cracking the market to force no-commission trades everywhere, but now that Fidelity, Vanguard, and Schwab have that too, what's the point?",
        "created_utc": 1601708212,
        "id": "g7hqrev",
        "score": 1,
        "subreddit": "investing",
        "created": 1601737012.0
    },
    {
        "author": "Boss1010",
        "body": "Thoughts on Fidelity brokerage? They arent even willing to reimburse the $75 ACAT fee from RH",
        "created_utc": 1601592113,
        "id": "g7c8av4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601620913.0
    },
    {
        "author": "SpliTTMark",
        "body": "I wish fidelity offered it though..",
        "created_utc": 1601591956,
        "id": "g7c80vn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601620756.0
    },
    {
        "author": "SloviXxX",
        "body": "Ahhh that would explain it. The transfer to my bank was still pending but Fidelity was already showing the funds deducted yesterday.",
        "created_utc": 1601556787,
        "id": "g7a45i0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601585587.0
    },
    {
        "author": "arice948",
        "body": "Is there a way to view this in Fidelity or any other monitor?",
        "created_utc": 1601586994,
        "id": "g7byurb",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601615794.0
    },
    {
        "author": "DeNovaCain",
        "body": "All the big ones have been updated. Robinhood, TD, Schwab, Fidelity.",
        "created_utc": 1601649822,
        "id": "g7emmyk",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601678622.0
    },
    {
        "author": "broke-gambla",
        "body": "Lmfaoooo so you want to use two different platforms to trade. You might as well just use fidelity.",
        "created_utc": 1601652642,
        "id": "g7es1h9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601681442.0
    },
    {
        "author": "AssistanceFluid",
        "body": "I have been able to trade through fidelity all morning even with the merger of shll/hyln. No issues. I would definitely recommend fidelity over RH.",
        "created_utc": 1601653630,
        "id": "g7eu02r",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601682430.0
    },
    {
        "author": "AssistanceFluid",
        "body": "Yep! I just bought Some more HYLN for 39 on fidelity",
        "created_utc": 1601653405,
        "id": "g7etk4f",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601682205.0
    },
    {
        "author": "AssistanceFluid",
        "body": "Fidelity has no account fees.\nFidelity offers free fractional share purchasing on stocks and ETFs. No commissions to trade US online stocks.\nThey also have Zero index funds (so u can invest without paying any fees). \nOverall fidelity’s fees and commissions are the lowest among the other brokerages",
        "created_utc": 1601654551,
        "id": "g7evthk",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601683351.0
    },
    {
        "author": "Ac-28",
        "body": "Even more gamble-ey.\n\nDamn Fidelity doesn't offer them.",
        "created_utc": 1601620596,
        "id": "g7dkgk6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601649396.0
    },
    {
        "author": "dvdmovie1",
        "body": "&gt; Again, I know almost nothing about investing so I don’t know what the best option would be for me.\n\nDon't use RH. Use Fidelity, which offers the same things (fractional, etc) and more features/better customer service. If you're going to be more involved, do it on a better brokerage.",
        "created_utc": 1601541425,
        "id": "g79o0vp",
        "score": 1,
        "subreddit": "investing",
        "created": 1601570225.0
    },
    {
        "author": "TreyATX",
        "body": "You really thought Blackrock and Fidelity we’re going to let their investments go to $0 in NKLA 🤣🤣🤣🤣🤣🤣🤣🤡🤡🤡🤡🤡",
        "created_utc": 1601563227,
        "id": "g7afs5c",
        "score": -3,
        "subreddit": "wallstreetbets",
        "created": 1601592027.0
    },
    {
        "author": "LukeDuke",
        "body": "I picked up some KLA",
        "created_utc": 1601658584,
        "id": "g7f3vy3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601687384.0
    }
]