[
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "Got 6/19 and 7/17 calls on:  \n  \nBABA  \nOKTA  \nDOCU  \nCRWD  \nWDAY  \nWORK  \nBOX  \nADBE  \nPTON  \nZUO  \nCRM  \nHPQ  \nTWLO  \nNFLX  \nDIS  \nVEEV  \nROKU  \nVMW  \n  \nCan the market open already so I can sell half and trim this stupid list?",
        "created_utc": 1590462763,
        "id": "fru1tzr",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1590491563.0
    },
    {
        "author": "Silky69Johnson420",
        "body": "&gt; I'm not aware of any tech company that uses it though\n\nIntel, Salesforce, Adobe, Dell, SAP all use Microsoft. You must not have tried very hard lol",
        "created_utc": 1590528351,
        "id": "frwvlno",
        "score": 11,
        "subreddit": "investing",
        "created": 1590557151.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "I bought 6/19 calls at open today after being cash gang for the weekend and got reamed.    \n  \nSPLK  \nTTWO  \nBABA  \nOKTA  \nDOCU  \nCRWD  \nPANW  \nWDAY  \nWORK  \nBOX  \nADBE  \nPTON  \nNVDA  \nCRM  \n  \nOnly BABA and TTWO in the green. Someone please pass me the $ROPE",
        "created_utc": 1589844621,
        "id": "fr2vdbb",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589873421.0
    },
    {
        "author": "karlaxel2",
        "body": "Why do people think the market is so cheap right now?\n\nWe’re still 40% higher than in 2016. A lot of areas are priced CORRECTLY such as airlines and banks. The rest of the market should be there too.\n\nBut the rest of the market is fucking insane. Why are NVDA, ADBE, and LULU trading at all time highs. Ridiculous.",
        "created_utc": 1589474061,
        "id": "fqma4ab",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1589502861.0
    },
    {
        "author": "ApartheidClyde",
        "body": "AAPL gap fill completed.\n\nhttps://www.tradingview.com/x/9tXhoEw5/\n\nIts mission is complete.\n\nMSFT --https://www.tradingview.com/x/3a9nbUa8/\n\nAll gaps completed, its mission was already over.\n\nCMG. - https://www.tradingview.com/x/xZrE2MJF/\n\nAll gaps completed, its mission was already over.\n\nADBE -- https://www.tradingview.com/x/DF843oSH/\n\nAll gaps completed, its mission was already over.\n\nQQQ - https://www.tradingview.com/x/jZ3WmgEr/\n\n3% left to go. Its mission is about to complete.\n\nI will write up my detailed post about deflation and imminent depression late tonight",
        "created_utc": 1588990954,
        "id": "fpxwf31",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1589019754.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "Adbe calls",
        "created_utc": 1589158159,
        "id": "fq847d2",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1589186959.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "Currently holding 6/19 calls for:  \n  \nPANW  \nBABA  \nDIS  \nVMW  \nWDAY  \nADBE  \nDOCU  \nOKTA  \nPTON  \nVEEV  \nZUO  \nPLAN  \nHPQ  \nCRM  \nCRWD  \nTWTR  \nOKTA  \nNFLX  \n  \nDoesn't look like a green day, but if it is, would be happy to get out of a lot of positions.",
        "created_utc": 1590096514,
        "id": "frdufd0",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1590125314.0
    },
    {
        "author": "theoriginalrude",
        "body": "Ask Adobe",
        "created_utc": 1590125308,
        "id": "frf68x1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1590154108.0
    },
    {
        "author": "Orzorn",
        "body": "Hey everyone, check out ADBE (Adobe). They've been making consistent gains for the last month and they're still 4% off their ATH. They also had a dip today. Could be an easy play to get a call for 380 maybe a month or so out and just ride the wave up. They already reported earnings.\n\nDisclaimer: I do not have any positions in ADBE and probably don't plan to do so unless Monday pans out well, as I am playing earnings run ups right now.",
        "created_utc": 1588982185,
        "id": "fpxgezu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1589010985.0
    },
    {
        "author": "Industry_Standard",
        "body": "I'd probably swap a share of NOW, ADBE, or CRM for a share of AAPL.",
        "created_utc": 1588739567,
        "id": "fpmr5nq",
        "score": 4,
        "subreddit": "stocks",
        "created": 1588768367.0
    },
    {
        "author": "StoneHolder28",
        "body": "Mutual funds, someone literally manages your money way better than you ever could. Or MSFT, ADBE, AAPL, basically the big guys in tech that will only become bigger.",
        "created_utc": 1589488111,
        "id": "fqn3msx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1589516911.0
    },
    {
        "author": "shuttdown700",
        "body": "To be fair, V and MA are tech stocks. They do financial services and don’t issue credit. They are just financial tech stocks. \n\nAlso, you have to think what’s gonna be big in the next five years. Cloud computing (AMZN, MSFT, GOOG, ADBE, and NVDA for hardware), enterprise tech platforms (MSFT, CRM, GOOG, ADBE, even AAPL and FB), video games (EA, ATVI, MSFT, NVDA, and FB has oculus)... I can continue but you get it. \n\nTech has a lower cost for growth and the lowest entry threshold for obtaining economies of scale than physical retailers or businesses with complex supply chains.",
        "created_utc": 1588638672,
        "id": "fpidief",
        "score": 3,
        "subreddit": "stocks",
        "created": 1588667472.0
    },
    {
        "author": "iwanttodiewhodoesnt",
        "body": "ADBE calls for June 12 right after earnings. Buying now would maximize profit. Adobe moving steadily up and did well during the crash anyway so it’s a safe investment. And they will probably outperform earnings with theire cloud services and those already doing well and then software that has also been doing awesome lately",
        "created_utc": 1588877806,
        "id": "fpsqbmq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1588906606.0
    },
    {
        "author": "EmployerOfTheMonth",
        "body": "adobe DO copy them, adobe sign",
        "created_utc": 1590964814,
        "id": "fsgudhk",
        "score": 3,
        "subreddit": "investing",
        "created": 1590993614.0
    },
    {
        "author": "ShutUpDonny_007",
        "body": "I discovered a new beast today. ADBE options.",
        "created_utc": 1590524123,
        "id": "frwmz53",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1590552923.0
    },
    {
        "author": "MorpheusOnAcid",
        "body": "Notable earnings the week of 6/8: \n\nCHWY LULU ADBE GME SFIX PLAY\n\nAnyone feeling a run up this week for any of these?",
        "created_utc": 1590884465,
        "id": "fsdfdz6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1590913265.0
    },
    {
        "author": "tesla6000",
        "body": "60 minute looks like there using Microsoft paint to make their graphics the fuckkkkk they need Adobe after effects",
        "created_utc": 1589756603,
        "id": "fqyy77n",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1589785403.0
    },
    {
        "author": "samtony234",
        "body": "MSFT, Google, Slack, Facebook, Adobe and loom are all competitors that will either create their own platform or already have a platform. Also most of these companies can leverage their existing resources to compete, zoom can't.",
        "created_utc": 1589074494,
        "id": "fq47nyp",
        "score": 2,
        "subreddit": "stocks",
        "created": 1589103294.0
    },
    {
        "author": "Industry_Standard",
        "body": "It's a tired adage, but it's true: diversify. Not just in what you invest in, but also your risk levels. My breakdown is like this (with my positions, not equally weighted):\n\n40% blue chips (as in MSFT, AAPL, GOOGL, AMZN, FB, BABA)\n\n40% higher risk growth (SNAP, CRM, NOW, ADBE, DDOG, PYPL, SHOP, BAND, NET)\n\n15% recovery (RTX, XOM, BAC, EXPE, DIS LEAP)\n\n10% YOLO stocks (not currently maxed. DKNG, IZEA, SGDR, VTIQ)\n\n5% Options (not currently maxed. DDOG call, UBER put, HEAR c, SDC c)\n\nThe reason I do this is because I don't mind losing that 5%, and my largest portions will usually have my back.",
        "created_utc": 1589062792,
        "id": "fq340ls",
        "score": 2,
        "subreddit": "stocks",
        "created": 1589091592.0
    },
    {
        "author": "Whakefieldd",
        "body": "VEEV, ADBE, HD",
        "created_utc": 1588813501,
        "id": "fpq1uzn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588842301.0
    },
    {
        "author": "codingprofessor",
        "body": "They aren't in danger if they stick to their main product which is media processing. But in that case you also have valid competitors like Cloudinary.\n\nIMO the industry is too large for one player to dominate.i think you'll see Fastly grow along with invisible market forces created by Adobe, networking advancements and so on.",
        "created_utc": 1590633562,
        "id": "fs1qlna",
        "score": 2,
        "subreddit": "stocks",
        "created": 1590662362.0
    },
    {
        "author": "Rightnr",
        "body": "I will hold because I lost half of all my €2k 380c 6/19 holding which I bought today and yesterday (thought at a fair price). \n\nMy hope from playing earnings is we get a push even if tech declines, at least enough to recover to break even. I was looking to Nvidia as a case study and Adobe look like a solid company set to profit from these lockdowns.\n\nI've also recently sold CSCO and HPQ calls too early lately, so I'll give it at least until end of week. Worst thing is my Vix hedge is not doing much.",
        "created_utc": 1590526516,
        "id": "frwrwb9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1590555316.0
    },
    {
        "author": "officespace2020",
        "body": "new partnership with Adobe",
        "created_utc": 1590596975,
        "id": "frzqzrh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1590625775.0
    },
    {
        "author": "pleasegivefreestuff",
        "body": "Says dumb adobe without any rebuttal or anything to back it up.... yup sounds like dumb responding with dumb to me. Classic reddit investing",
        "created_utc": 1590370470,
        "id": "frq5f2i",
        "score": 2,
        "subreddit": "stocks",
        "created": 1590399270.0
    },
    {
        "author": "PuttinTendiesToWork",
        "body": "ADBE $365p 5/29\nADBE $365c 5/8",
        "created_utc": 1588541253,
        "id": "fpe6dbp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588570053.0
    },
    {
        "author": "BlablaPRApra",
        "body": "Is this Adobe pro?",
        "created_utc": 1589236429,
        "id": "fqbgakx",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1589265229.0
    },
    {
        "author": "Raslatt",
        "body": "I was researching docusign and came across your thread. For what it’s worth, I work at a fairly big regional law firm, and we’ve been using docusign for Agreements that allow digital signatures. I had never heard of it before until recently and thought it might make a good investment. We have adobe pro, which I think has this feature, but all our offices use docusign. I’m thinking it might make a solid investment, especially at the low market cap. Has your opinion changed?",
        "created_utc": 1588737007,
        "id": "fpmngmq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1588765807.0
    },
    {
        "author": "MovieMuscle25",
        "body": "&gt;JPM\n\nEh, there's still an opportunity there. Meanwhile, Adobe and Nvidia haven't even given me that opportunity yet. Some day, they'll dip...",
        "created_utc": 1590001175,
        "id": "fr9os3s",
        "score": 2,
        "subreddit": "stocks",
        "created": 1590029975.0
    },
    {
        "author": "wolfofnostreet100",
        "body": "Major partnerships and just partnered with adobe",
        "created_utc": 1590861904,
        "id": "fsbw9qb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1590890704.0
    },
    {
        "author": "EmployerOfTheMonth",
        "body": "docusign and adobe sign have been growing before covid-19",
        "created_utc": 1590964789,
        "id": "fsgubs4",
        "score": 2,
        "subreddit": "investing",
        "created": 1590993589.0
    },
    {
        "author": "LockDown5",
        "body": "I've liked ADBE for a while, just too expensive to get in...should have jumped in after the market fell apart in March...The subscription based businesses have all done decently.",
        "created_utc": 1590345148,
        "id": "frotjn6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1590373948.0
    },
    {
        "author": "yellowsockss",
        "body": "ADBE gonna blow up next week.  ADBE 5/15 700c &amp; 695c",
        "created_utc": 1588720631,
        "id": "fplw5vo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588749431.0
    },
    {
        "author": "chetpancakesparty",
        "body": "Calls for the following for the earnings runup:\n\n$RST - Everyone is looking to new hobbies during lockdown and I have several friends that said they have bought Rosetta Stone. Still 25% or so from the pre-covid top.\n\n$ADBE - Everyone working from home needs to use pdf's, pretty simple.\n\n$GLUU - After seeing $ATVI kill earnings I just have a feeling about this one in my testicle",
        "created_utc": 1588713535,
        "id": "fplixe2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588742335.0
    },
    {
        "author": "fgh125312",
        "body": "Any thoughts on ADBE next month? Seems like they should have been relatively unaffected by COVID-19 being a pure software company which have in general been doing well throughout the crisis",
        "created_utc": 1589155078,
        "id": "fq7yy29",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589183878.0
    },
    {
        "author": "viburnum608",
        "body": "Yes, I think they will do well. Their earnings are in June, and they should get a boost from more remote work. Companies that dealt with a lot of paperwork, getting signatures, etc, will be using adobe. The ones that get it probably will keep it coming out of this. Everyone is doing bad right now, but ADBE is one of the few that will benefit long term.",
        "created_utc": 1588911460,
        "id": "fpufarb",
        "score": 2,
        "subreddit": "stocks",
        "created": 1588940260.0
    },
    {
        "author": "planetbeforeneptune",
        "body": "Why adobe?",
        "created_utc": 1588787024,
        "id": "fpoml93",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588815824.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "I lost 40k in October, made 75k from the virus drop, and am up 15% in robotics and adbe bags now",
        "created_utc": 1589822967,
        "id": "fr1nvxa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589851767.0
    },
    {
        "author": "slotback67",
        "body": "My wife works at adobe. She says the main boss is always farting and stinking the whole building up. A lot of people are fed up and are quitting without any warning. I personally wouldn’t touch this stock",
        "created_utc": 1590786507,
        "id": "fs8p847",
        "score": 2,
        "subreddit": "stocks",
        "created": 1590815307.0
    },
    {
        "author": "chewymilk02",
        "body": "Sounds like they found the “download adobe reader” IT guy.",
        "created_utc": 1590532764,
        "id": "frx493o",
        "score": 2,
        "subreddit": "investing",
        "created": 1590561564.0
    },
    {
        "author": "Vast_Cricket",
        "body": "The best way to state is there is so much demand for video conferencing. Actually Cisco had a great product about 12-15 years ago. The team work at Zoom is mostly from Cisco.\n\nSame can be said about Ducusign, there are at least 3 public companies within a few miles all have the product. I use 3 other private companies and it has not impede the demand for more. Adobe could corner the entire market put locks on their pdf files. They got too many other products more lucrative.\n\nI do see ZM insiders sold most of their stocks at the peak meaning they knew the price point for investors.",
        "created_utc": 1590548227,
        "id": "frxvdj3",
        "score": 2,
        "subreddit": "investing",
        "created": 1590577027.0
    },
    {
        "author": "sofarsogood84",
        "body": "This sort of discussion is why r/investing finds WSB a joke. But I still love my WSB memes.\n\n\\- It's clearly overvalued, even a fully retarded understanding of FA will show you that.Even after the recent drop it's valued at around 40x REVENUES (LOL), not EARNINGS. Other tech stocks have nowhere near these valuations. FB has a revenue multiple of around 8. Difference is FB and other stocks actually have a decent chunk of revenue converted ( and will continue to be converted to revenue) to EARNINGS. ZM has almost ZERO prospects of converting even a fraction of this revenue into earnings due to :\n\n\\- Bigger,better competition with massive amounts of capital to invest compared to ZOOM. Google, MSFT, FB, CISCO, ADOBE. Do you really think that if there was that much money to be made in the videoconferencing sector ZM will even have any significant market share a short time from now?  What kind of earnings or margin do you see be made on this small market share, if any? These companies have just cloned what worked for Zoom and offered it for free through their existing interlinked platforms. Offered a similar ( and eventually better) product for FREE, not a great investment thesis for ZM longer term. Video conferencing is NOT a high tech, heavily patented sector, it's essentially freeware longer term. The software development is basic and we wouldn't even be talking about Zoom if it wasn't for beer aids. \n\n\\- Beer aids has peaked, at least fear of it has. People will start going back to offices around the world soon, no long term thesis for zoom's current price. One of the first things struggling businesses and companies cut during downturns is non-essential IT expenses, so like I said, even if you think a recession/possibly depression is likely (I do) you would cut zoom use across the company and move to a free platform.\n\n\\-ZM was clearly a meme stock bought buy poor , first time normies or mum and dad investors that was happily dumped on them shortly after the IPO. Fuck me, to get and idea of the average investor just remember that ZOOM ticker mooned because investors didn't even bother to check the right ticker for this pile of shit and bought the wrong company. ZOOM trading was even suspended lol. Being a med-long investor on ZM is like flying a booking a spaceflight where everyone on the vessel including the flight crew tell you BEFOREHAND that they are mongoloids but you still buy a ticket anyway. \n\n\\- Security issues, zoombombing, shit load of existing tech companies exploiting the shit out of these stuff ups as they ramp up their own products. The power google,FB and others have using their advertising budget and other media platforms to promote their own product shouldn't be underestimated - just look at the propaganda that been put out by big tech the last few days.\n\n\\- Friday was just a tiny dead cat bounce with people taking profits and/or some market makers covering their spreads on expiration, the drop was anticipated but happened a bit quicker than many were expecting imo. That's my retards opinion on the open interest and the put/call ratio activity anyway. There where a shit load of calls on this and still are that are now way OTM and will expiry useless over the next couple of weeks and have already.\n\n&amp;#x200B;\n\n\\- How many more reasons do you need? This is WSB, Elon bipolar rant over. Iv'e been short on this dumpster fire since the 7% below the top, mostly unbalanced butterflys and backspreads and I even gone full retard at points and just bought straight puts occasionally. They have been printing but to be honest I feel a bit sorry for the mum and dad investors who bought this cos they saw their kids using the app - they are not stupid, probably smarter than me most of them- but they have been handed this pile of shit by CNBC and analysts who work for the same banks that made fees on the IPO and selling on the spike.",
        "created_utc": 1588411534,
        "id": "fp929mz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588440334.0
    },
    {
        "author": "viburnum608",
        "body": "Adobe is the play right now. Earnings are in June and everyone is working from home.",
        "created_utc": 1588534115,
        "id": "fpdtujv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588562915.0
    },
    {
        "author": "estevado",
        "body": "Lots of good stuff. Too much JPM. T has a lot of debt. KO is very slow to grow. Consider AMT, TSCO, ADBE, HD, V, MA.",
        "created_utc": 1588537153,
        "id": "fpdz5kp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588565953.0
    },
    {
        "author": "WhiteHoney88",
        "body": "Do you mind if I ask what else you’re holding? I am holding ADBE, MSFT as my techs",
        "created_utc": 1588604586,
        "id": "fpgkour",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588633386.0
    },
    {
        "author": "tybaldus",
        "body": "In my opinion, there is very little value right now anyway. You can ride the wave in tech stocks but that's it, knowing that you're paying too much for it. I've bought SQ, DDOG and ADBE but I sold them all already after +20%. This is something I'd normally never do. I still have GOOGL and FB but might dump these later too. The difference with 09 is that tech is now seen as a safe haven.\n\nSo what's left?\n\nAll your small &amp; midcaps will be reporting weak Q2 numbers combined with bad news around banks probably underestimating all the bad debt they need to take on. Correct guidance after Q2 will determine whether it's time to start loading up. You could already start now but you're probably too early.\n\nThe companies to look at are those that benefit from whatever situation will be happening or the ones that have a battered share price and are likely to climb again. All very difficult to predict considering there might be some bodies buried in all the bad debt estimations. Some stuff I'm doing now is:\n\n\\- Put profit from tech stocks in my All-World ETF for the long term.\n\n\\- Increased my stake in companies like AER when they dip, airline leasing will profit from this situation for example. \n\n\\- Looking at the EU market for real estate stocks with strong balance sheets to enter after Q2",
        "created_utc": 1589660307,
        "id": "fqukc4c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589689107.0
    },
    {
        "author": "joeadewunmi55",
        "body": "their revenue last year was less than $1billion, loss for 20% and yet they are valued x 20 of their revenue just crazy. I'd rather stick with Adbe",
        "created_utc": 1589719540,
        "id": "fqww9xd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589748340.0
    },
    {
        "author": "codingprofessor",
        "body": "I use Figma at work and I'm not that impressed by it - Adobe isn't going to hit the nail on the head on every piece of their cloud suite",
        "created_utc": 1589738440,
        "id": "fqxvcn2",
        "score": 1,
        "subreddit": "investing",
        "created": 1589767240.0
    },
    {
        "author": "Grunblau",
        "body": "AutoDesk has been quietly buying up all of the interesting/innovative companies that challenge their position as the industry standard.  They are heavily weighting all of their software to be more like Adobe SaaS model.\n\nFusion 360 was offered to everyone as a free gateway drug.  Look for all of the previously free add-ons like CAM to become modules to purchase even for the home DIYer.  \n\nI almost bought shares back in March, but didn’t because I couldn’t get past the taste of vomit in the back of my mouth.  Revit ruined architecture as a profession (imho).\n\n360 is a great product.  It is sad that they seem to be turning their back on the maker community that helped spread the word and embraced the ‘free’ software.",
        "created_utc": 1589772331,
        "id": "fqzpdmd",
        "score": 1,
        "subreddit": "investing",
        "created": 1589801131.0
    },
    {
        "author": "LuLeBe",
        "body": "I'm on my way to that. Not news sites, but Spotify, YouTube, Netflix that I never use, Amazon prime, various servers for side projects, Adobe creative cloud, office 365, Google one and probably more that I forgot about...",
        "created_utc": 1589997829,
        "id": "fr9hsa3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590026629.0
    },
    {
        "author": "Raybay192",
        "body": "NVDA , Adobe , MDB",
        "created_utc": 1589856247,
        "id": "fr3ff7f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589885047.0
    },
    {
        "author": "Milazzo",
        "body": "&gt; Salesforce Positioned in the Leaders Quadrant of the Gartner's 2020 Magic Quadrant for Multichannel Marketing Hubs \n\nThis is awesome progress against Adobe, thanks for linking. Feeling even better about my ER 190c.",
        "created_utc": 1589818651,
        "id": "fr1f5ym",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589847451.0
    },
    {
        "author": "puddlegum66",
        "body": "Adobe.  Not necessarily a library of content,  but their  video and audio production tools are industry standard at this point",
        "created_utc": 1589899046,
        "id": "fr4y2wk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589927846.0
    },
    {
        "author": "spicyricerocket",
        "body": "What does DocuSign do that Adobe Acrobat cannot?",
        "created_utc": 1589501304,
        "id": "fqntvji",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589530104.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "After looking at the holdings, I would definitely invest in this ETF.  I can see it getting 20%+ returns in a decent market.  Unfortunately, it is not showing up on M1 Finance yet.\n\nHoldings:\n\niRobot Corporation\t2.09%\n\nVeeva Systems Inc Class A\t2.06%\n\nTwilio, Inc. Class A\t2.04%\n\nAmazon.com, Inc.\t1.92%\n\nAtlassian Corp. Plc Class A\t1.89%\n\nShopify, Inc. Class A\t1.87%\n\nIllumina, Inc.\t1.84%\n\nMongoDB, Inc. Class A\t1.76%\n\nAppen Ltd.\t1.75%\n\nCloudflare Inc Class A\t1.74%\n\nNVIDIA Corporation\t1.74%\n\nMicrosoft Corporation\t1.72%\n\nWix.com Ltd.\t1.67%\n\nSplunk Inc.\t1.67%\n\nHubSpot, Inc.\t1.65%\n\nNetflix, Inc.\t1.62%\n\nsalesforce.com, inc.\t1.60%\n\nArista Networks, Inc.\t1.59%\n\nAlphabet Inc. Class A\t1.58%\n\nTencent Holdings Ltd.\t1.57%\n\nServiceNow, Inc.\t1.55%\n\nFair Isaac Corporation\t1.52%\n\nGrubhub, Inc.\t1.51%\n\nVeracyte Inc\t1.50%\n\nXilinx, Inc.\t1.50%\n\nJD.com, Inc. Sponsored ADR Class A\t1.47%\n\nCognex Corporation\t1.44%\n\nNew Relic, Inc.\t1.43%\n\nPalo Alto Networks, Inc.\t1.43%\n\nInternational Business Machines Corporation\t1.43%\n\nNuance Communications, Inc.\t1.42%\n\nRapid7 Inc.\t1.42%\n\nAlteryx, Inc. Class A\t1.41%\n\nSpotify Technology SA\t1.40%\n\nZendesk, Inc.\t1.39%\n\nAutodesk, Inc.\t1.39%\n\nASML Holding NV ADR\t1.38%\n\nAccenture Plc Class A\t1.38%\n\nMercadoLibre, Inc.\t1.37%\n\nYandex NV Class A\t1.34%\n\nTesla Inc\t1.31%\n\nSquare, Inc. Class A\t1.31%\n\nIntuit Inc.\t1.30%\n\nVerisk Analytics Inc\t1.30%\n\nBaidu, Inc. Sponsored ADR Class A\t1.30%\n\nVaronis Systems, Inc.\t1.27%\n\nAnalog Devices, Inc.\t1.26%\n\nAlibaba Group Holding Ltd. Sponsored ADR\t1.26%\n\nBlue Prism Group Plc\t1.26%\n\nElectronic Arts Inc.\t1.21%\n\nSage Group plc\t1.21%\n\nInfineon Technologies AG\t1.20%\n\nAdobe Inc.\t1.18%\n\nLam Research Corporation\t1.17%\n\nProofpoint, Inc.\t1.14%\n\nTeradyne, Inc.\t1.12%\n\nGlobal Unichip Corp.\t1.11%\n\nFiserv, Inc.\t1.09%\n\nAdvanced Micro Devices, Inc.\t1.07%\n\nSoftBank Group Corp.\t1.06%\n\nCornerstone Ondemand, Inc.\t1.01%\n\nCapgemini SE\t1.00%\n\nAspen Technology, Inc.\t1.00%\n\nTeradata Corporation\t0.98%\n\nMUTUAL FUND (OTHER)\t0.95%\n\nBooking Holdings Inc.\t0.94%\n\nTalend SA Sponsored ADR\t0.87%\n\nPure Storage, Inc. Class A\t0.86%\n\nIntellia Therapeutics, Inc.\t0.86%\n\nYext, Inc.\t0.86%\n\nTaiwan Semiconductor Manufacturing Co., Ltd.\t0.81%\n\nCloudera, Inc.\t0.79%\n\nPublicis Groupe SA\t0.60%\n\niflytek Co., Ltd. Class A\t0.27%\n\nU.S. Dollar\t-0.00%",
        "created_utc": 1589547753,
        "id": "fqpjaub",
        "score": 1,
        "subreddit": "investing",
        "created": 1589576553.0
    },
    {
        "author": "discovery999",
        "body": "I like MA and V but their volume is dropping. People usually book big ticket travel on credit cards and who’s doing that lately? Hence the drop in their share price. Better to stick with virus proof companies like MSFT, AMZN, FB, GOOGL, ADBE, WMT, COST, HD etc...",
        "created_utc": 1589586213,
        "id": "fqrkjfw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589615013.0
    },
    {
        "author": "Vast_Cricket",
        "body": "I can be wrong like Zoom I think both take advantage of the Covid situation.  They are expensive right now assuming the stock market will come down.\n\nI have been using Docu since 2005. But there is Hello Sign, Adobe Sign, Discovery sign, eSign, iSign etc.",
        "created_utc": 1589518300,
        "id": "fqolt0i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589547100.0
    },
    {
        "author": "Casandy420",
        "body": "Obviously y'all need to be buying more Adobe stock. That crop tool is fire.",
        "created_utc": 1589484647,
        "id": "fqmwekh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589513447.0
    },
    {
        "author": "spanishgalacian",
        "body": "You've got Adobe, Amazon, Apple and MSFT to choose from, but no you chose fucking Roku. Lol.",
        "created_utc": 1590216589,
        "id": "frj2d8w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590245389.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "6/19 and 7/17 calls going into the long weekend:  \n   \nBABA  \nDIS  \nVMW  \nWDAY  \nADBE  \nVEEV  \nDOCU  \nOKTA  \nZUO  \nROKU  \nHPQ  \nCRM  \nCRWD  \nNFLX  \nTWLO  \nBOX  \nADSK  \n  \nMy asshole shall remain clenched for 3 days...",
        "created_utc": 1590176164,
        "id": "frha09u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590204964.0
    },
    {
        "author": "gefickte",
        "body": "Adbe",
        "created_utc": 1588978398,
        "id": "fpx9q5j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589007198.0
    },
    {
        "author": "whiskeyandcode",
        "body": "Closest competitors/services to Shopify are: WooCommerce, Magento (owned by Adobe now, I believe), BigCommerce",
        "created_utc": 1588961224,
        "id": "fpwcvse",
        "score": 1,
        "subreddit": "investing",
        "created": 1588990024.0
    },
    {
        "author": "viburnum608",
        "body": "It's on you to do your DD. I currently don't have it because my portfolio is long term, and think there are better ones from an outlook past 18 months. If I were OP, I would hold ADBE at least until earnings. I would either sell the day before, or the day after, depending on the price at that time.",
        "created_utc": 1588912503,
        "id": "fpugrx4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588941303.0
    },
    {
        "author": "Berryitall",
        "body": "Adobe 🚀🚀🚀",
        "created_utc": 1589211022,
        "id": "fqa1bg4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589239822.0
    },
    {
        "author": "spicyricerocket",
        "body": "I think some particular cloud-based SaaS companies will be real winners long-term due to the accelerated adoption of cloud infrastructure in this current remote-working economy. I like Microsoft, Adobe, and Okta, although I wouldn't necessarily say they are cheap at these levels.",
        "created_utc": 1589249872,
        "id": "fqc4dkh",
        "score": 1,
        "subreddit": "investing",
        "created": 1589278672.0
    },
    {
        "author": "T-Par",
        "body": "Who doesn't have Microsoft, Google, Amazon, Oracle, Adobe, IBM on their radar?\n\nI'd add Paycom to the list.",
        "created_utc": 1589298454,
        "id": "fqdxtb9",
        "score": 1,
        "subreddit": "investing",
        "created": 1589327254.0
    },
    {
        "author": "firestormdude",
        "body": "Beyond Meat could explode further. Shopify still has room to run and so does AMD.\n\nTesla is overbought in my opinion. Some room to run but I expect a drop in consumer demand to hurt the stock down the road.\n\nThe Trade Desk will keep skyrocketing on the backend of the pandemic.\n\nI don’t see a lot of names that can really take off that just IPO’ed. There was Uber, Lyft, and Pinterest recently... I own PINS and had Uber and Lyft but sold in January. Those ride sharing platforms could really take off when economy gets back up and running, especially if they become consistently profitable and can get self driving taxis developed and approved for global use. We’ll see what happens.\n\nRight now, my whole stock portfolio is buy and hold on Microsoft, AMD, Alibaba, Pinterest, Shopify, Trade Desk, Twilio, Beyond Meat, Zynga\n\nLooking to pick up Amazon, Adobe, and Mercado Libre here shortly.\n\nActivision could have a monster year with gaming cycle and everyone at home. Earnings guidance was very high for Q2 and this is pre-PS5 and Xbox launch.",
        "created_utc": 1589132083,
        "id": "fq6ibxs",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589160883.0
    },
    {
        "author": "cheeriocharlie",
        "body": "It's quite exciting. Though Autodesk is tough competition, I am very bullish on Procore. Their moves have been very smart in terms of expanding their moat around management by vertically integrating. They've also moved towards building a platform for third parties and lead the industry in terms of market share. Their software is also very sticky with contractors often forcing developers to buy into the platform as a condition of work. They are also profitable. \n\nTheir early moves have paid off. In their S-1 they talk about the procore platform being taught many schools as well. \n\nIt's all super exciting LOL. I'm still young and inexperienced but I feel I found gold when I heard about this company. It feels like it could be the next adobe or similar.",
        "created_utc": 1589138355,
        "id": "fq6vfuq",
        "score": 1,
        "subreddit": "investing",
        "created": 1589167155.0
    },
    {
        "author": "fletchdeezle",
        "body": "It’s great for small business but for scale shopify cannot complete with salesforce sap adobe or oracle.",
        "created_utc": 1589149698,
        "id": "fq7pp8t",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1589178498.0
    },
    {
        "author": "jschreiber77",
        "body": "100% via Adobe.\n\nCanopy?  NO.",
        "created_utc": 1588722918,
        "id": "fpm08kl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588751718.0
    },
    {
        "author": "BigHouse5",
        "body": "Can you further explain why on adobe",
        "created_utc": 1588752245,
        "id": "fpn6to0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588781045.0
    },
    {
        "author": "yellowsockss",
        "body": "i feel youuu. i just did my last yolo on ADBE 5/15 695c/700c",
        "created_utc": 1588797069,
        "id": "fpp70kg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588825869.0
    },
    {
        "author": "schplat",
        "body": "uh...  ADBE is 362.52..  5/15 options only go up to 480.\n\nso wtf?",
        "created_utc": 1588798246,
        "id": "fpp9fxb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588827046.0
    },
    {
        "author": "CptGusMcCrae",
        "body": "Protip: buy an ADBE 6/19 option now. Earnings are on 6/16",
        "created_utc": 1588801610,
        "id": "fppg1pf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588830410.0
    },
    {
        "author": "shuttdown700",
        "body": "ADBE maybe.",
        "created_utc": 1588788206,
        "id": "fpop1m1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588817006.0
    },
    {
        "author": "Discoveryellow",
        "body": "Short $ADBE ?? It's their Photoshop Express for Android",
        "created_utc": 1588808284,
        "id": "fppsht7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588837084.0
    },
    {
        "author": "joeyjoejoe314",
        "body": "Are people purchasing more Adobe licenses because they are working from home?",
        "created_utc": 1588721749,
        "id": "fply5xj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588750549.0
    },
    {
        "author": "spicyricerocket",
        "body": "I have been long Microsoft and Adobe for a long while.\nI like Okta, but the valuation is too rich for my liking at this moment. When the opportunity arises, I will bite. For now, I will wait.",
        "created_utc": 1589410052,
        "id": "fqjhmh5",
        "score": 1,
        "subreddit": "investing",
        "created": 1589438852.0
    },
    {
        "author": "Benzo_Head",
        "body": "Nvidia and Adobe\n\nThey’re both worth 180 billion dollars",
        "created_utc": 1589460080,
        "id": "fqlk0ri",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589488880.0
    },
    {
        "author": "dragoonburst1",
        "body": "Holding:\n\nMSFT 192.5 5/22c\n\nADBE 377.5 5/22c\n\nV 185 5/29c\n\nUBER 31.5 6/5c\n\nAdvice? P scared for tomorrow. Should've exited all these positions midday",
        "created_utc": 1589335504,
        "id": "fqg0osl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589364304.0
    },
    {
        "author": "gefickte",
        "body": "Fuck me sideways with my adbe calls",
        "created_utc": 1589463256,
        "id": "fqlp096",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589492056.0
    },
    {
        "author": "dreammanalishi",
        "body": "You start with pennies. Spreadsheet ratings from every possible source, then watch the chart for a proper dip. This is an example of their trades for a few days...\n\nCLLS\nAPT\nIMRA\nDMAC\nGRWG\nEDNT\nWIX\nCBLI\nOPK\nALO\nIBIO\nGROW\nNVMI\nAEYE\nAXU\nGERN\nCVM\nBLU\nNLS\nSMG\nFLAT\nEVSI\nTPTX\nNVDA\nICLK\nLGC\nRPAY\nARYA\nMMX\nJD\nNOW\nKMED\nKURE\nCCX\nLCA\nHYAC\nRWLS\nOCX\nDBP\nGLTR\nHARP\nLCR\nAMZN\nAGMH\nIBMP\nSUMR\nREPL\nFUMB\nCCH\nIBML\nOFLX\nSUB\nIBMK\nFLMB\nHCAC\nBSCS\nSMB\nUUP\nMFAC\nLSST\nSMMU\nRAVI\nVNLA\nJMST\nLINC\nWBC\nTZAC\nARYAU\nBSCR\nGRAF\nSPAQ\nYI\nBTAL\nREK\nCOLL\nKOPN\nPCYG\nAUPH\nWTRH\nUI\nDPZ\nIMKTA\nSFM\nMRTX\nAGTC\nVTVT\nHAIN\nAZRE\nDDOG\nMARK\nPEP\nFB\nZNGA\nHL\nV\nNET\nLOW\nZM\nXBI\nATVI\nCPB\nHMY\nZ\nSVM\nIIVI\nLABU\nNEWR\nXLC\nNGD\nWPM\nCHD\nROK\nCNAT\nASM\nADSW\nADBE\nCLX\nIGV\nGOOGL\nIMGN\nVRTX\nQLD\nGOOG\nWBC\nFLO\nSTE\nTHO\nFTNT\nOCUL\nEE\nOR\nILMN\nMRNS\nNTLA\nCRSP\nMASI\nENTG\nPAYC\nWGO\nSHW\nINSM\nAGFS\nLTRX\nMTUM\nEDIT\nITCI\nCORT\nKURA\nNBIX\nGNRC\nCALM\nVGT\nLIVX\nCRNC\nPULM\nAOBC\nBL\nZG\nNOVA\nCDNA\nCDAY\nTYL\nARCT\nSPSC\nGOLF\nOCFT\nSWAV\nUUP\nARKG\nHZO\nRMD\nTYME\nICLK\nCOLL\nBIB\nVERU\nGWPH\nAAAU\nAVEO\nBGNE\nTMQ\nINSP\nPFSW\nBCEL\nASMB\nFTEC\nLOCO\nAVAV\nCSGP\nCHE\nDMAC\nGROW\nCRTX\nIMXI\nSUB\nCSTL\nYMAB\nEVOK\nARGX\nCRNX\nFENC\nRLMD\nPDP\nKNSL\nNLTX\nESPO\nGRAF\nCIIC\nAPPF\nIYW\nCMF\nCHG\nANY\nWEBL\nPRSC\nMOR\nROM\nQMOM\nIGMS\nENG\nXPH\nVTIQU\nPTNR\nARYA\nCSBR\nSTSA\nAGZ\nARDS\nCPAH\nSBIO\nFULC\nPHAT\nETHG\nETNB\nIBMJ\nIBML\nCNCR\nDBS\nXNTK\nIETC\nXSW\nLIVE\nBIOX\nGTO\nDGL\nPSJ\nGNOM\nMOM\nMFMS\nMIRM\nACAM\nPBE\nBMAY\nDFND\nAIQ\nGUDB\nPLL\nHTAB\nBKAG\nCCX\nCIZN\nSMMC\nSPSK\nLCA\nBKSB\nAAMC\nAMCI\nSBUG\nCOFS\nMTGP\nGBUG\nNFINU\nFLAT",
        "created_utc": 1590764306,
        "id": "fs7ex6k",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1590793106.0
    },
    {
        "author": "Rightnr",
        "body": "I sure bloody hope so. Got in too early and still not seeing that earnings bounce for ADBE",
        "created_utc": 1590764926,
        "id": "fs7g5ms",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590793726.0
    },
    {
        "author": "Rightnr",
        "body": "Taking a massive L on Adbe. Still think it should recover with a run-up to earnings.",
        "created_utc": 1590588514,
        "id": "frza9cj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590617314.0
    },
    {
        "author": "Rightnr",
        "body": "I still believe in my ADBe calls. They've had consecutive low days like this in the past weeks and tech is not going out of fashion any time soon with remote working become the new paradigm",
        "created_utc": 1590593018,
        "id": "frzix20",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590621818.0
    },
    {
        "author": "Rightnr",
        "body": "Why is ADBE tanking? I seem to have bought just before the dip.",
        "created_utc": 1590505345,
        "id": "frvk7vn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590534145.0
    },
    {
        "author": "Jiggerson",
        "body": "Dollar cost average my man. I remember I bough in at 266/share in my Roth 401k and people were saying it is overvalued then. Honestly, fuck people who say overvalued. They don't know shit and I made almost 100/share  although I only had 4 shares. If I see the slightest pullback, I'll buy a few shares. I will keep buying in as it moves down, but I don't see much downside on it.\n\nI'm also looking into NOW, ADBE, DOCU, and WDAY. All great companies with massive potential and a few of them have earnings coming up so I plan to ride that wave a bit. I don't like holding through earning a tbh and decided that I'll sell a majority of my shares before the announcement.",
        "created_utc": 1590342080,
        "id": "fronpya",
        "score": 1,
        "subreddit": "investing",
        "created": 1590370880.0
    },
    {
        "author": "estevado",
        "body": "Looks like a solid portfolio of quality businesses. Quality and established businesses is always good and usually safer. ADBE, BAM, MMM and V/MA could also fit your style. Z/ZG might still work out in the long run but it’s definitely more speculative than your current holdings.",
        "created_utc": 1590342323,
        "id": "froo5on",
        "score": 1,
        "subreddit": "stocks",
        "created": 1590371123.0
    },
    {
        "author": "Durhamarama",
        "body": "$ESPO -- We're only on the cusp of eSports and gaming subscription offers.  There's plenty room for growth within the gaming ETF.\n\n$CSCO -- Mirroring the success from Adobe and Microsoft, Cisco is a sleeper converting to a software subscription model while continuing innovate through high profile acquisitions.  \n\n$MA -- Cash is dying by the day, and digital payments are becoming more and more the norm.  Mastercard is a smooth bet towards a cashless future around the world.",
        "created_utc": 1590453170,
        "id": "frtm3dh",
        "score": 1,
        "subreddit": "investing",
        "created": 1590481970.0
    },
    {
        "author": "estevado",
        "body": "Yes, subscription based revenue often makes for a strong company. I was waiting for the 52wk low for ADBE mid March. It never happened. Hindsight... Speaks to the strength of their business though. You are right, it looks a bit pricey. But so does COST. But it’s always easier to hold than to buy at high valuations, isn’t it?",
        "created_utc": 1590345857,
        "id": "frov1mw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1590374657.0
    },
    {
        "author": "SirWetWater",
        "body": "Awesome, definitely going to play Adobe and Oracle. Thanks for the heads up!",
        "created_utc": 1590854123,
        "id": "fsbcjj6",
        "score": 1,
        "subreddit": "options",
        "created": 1590882923.0
    },
    {
        "author": "AnonZeit",
        "body": "How are we gonna make money after all this earnings end? Does everyone's money get funneled into the few remaining? Adobe? Oracle? American Software lawl?",
        "created_utc": 1590797799,
        "id": "fs9a1qf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590826599.0
    },
    {
        "author": "polyfractal",
        "body": "Yeah, this is arguably why Microsoft and Adobe have allowed piracy of Office/Photoshop for so long.  People pirating the software go on to work at companies that buy the same software.  \n\nDitto to OSS, or free accounts below a certain threshold... they are effectively marketing costs to grow the user base which you later hope to monetize.\n\nAs a prime example, I use Fusion360 as a hobbyist.  But if I ever transitioned to a business where I needed to use CAD/CAM for my dayjob, there's a strong chance I'd reach for Fusion because I already know it.  And then I'd be a paying customer (or my boss would be).\n\nRegarding Autodesk in particular, I think they've done a really good job marketing Fusion to students and hobbyists, and are continually adding in functionality from their other software offerings.  It's all over the 3d printing and hobbyist CNC sphere, and at least some of those people will be pushing to use it at their day job.  \n\nNot to say it's the better software by any means, whole industries are entrenched in competitors (CATIA / NX for aero, etc), but they've done a pretty good job pushing the hobby/student angle imo.",
        "created_utc": 1590692023,
        "id": "fs493m6",
        "score": 1,
        "subreddit": "investing",
        "created": 1590720823.0
    },
    {
        "author": "vikrant1993",
        "body": "Out of curiosity, why adobe? What’s the thought process for them?",
        "created_utc": 1588495183,
        "id": "fpccb69",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588523983.0
    },
    {
        "author": "firestormdude",
        "body": "All subscription based revenue and a lot room to run. Very safe investment with good future prospects. I also like the valuation better than Salesforce or AutoDesk.\n\nAdobe has an unmatched suite for marketing professionals including audio, graphic design, web, and video. You can simultaneously make professional commercials, podcasts, music, graphics, and websites all within the same suite for $50/month. Their package is hard to beat. Been using their platform since 2009 and still use it to this day.\n\nOnly competition is companies with individual products to compete against individual Adobe products but as a packaged suite for creators and entrepreneurs, Adobe is untouchable.",
        "created_utc": 1588495991,
        "id": "fpcd2y8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588524791.0
    },
    {
        "author": "old-wizz",
        "body": "Adobe too",
        "created_utc": 1588602411,
        "id": "fpggt3g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588631211.0
    },
    {
        "author": "Industry_Standard",
        "body": "Although Robinhood is extremely easy to use, I'd still suggest a full service brokerage like Schwab or TD. Just excellent service, and always someone available to answer questions. \n\nAs for information, Investopedia has some great breakdowns. Also, all of those \"like buying blah blah blah at $3\" articles should be taken with an ocean of salt. Use stock tips to start your own research. For example, you might see an article that talks about how much an analyst likes ADBE. Instead of just blindly buying, look for more information. Find the why for yourself.\n\nLastly, good luck, have fun, buy good companies, and whatever you do, don't panic.",
        "created_utc": 1588608027,
        "id": "fpgr782",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588636827.0
    },
    {
        "author": "BonBelafonte",
        "body": "Adobe fucking calls. You’re a dumbass if you’re betting against cloud right now.",
        "created_utc": 1588878672,
        "id": "fpss39d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588907472.0
    },
    {
        "author": "spicyricerocket",
        "body": "The likelihood of completely cancelled subscriptions en masse is low given the mission critical nature of ADBE software to digital media/digital experience operations. What's more likely to happen is just slower revenue growth due to deferred IT spending in the period. Those who use Adobe solutions will find that it works excellently under the remote work environment.",
        "created_utc": 1588923724,
        "id": "fpuu2gb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588952524.0
    },
    {
        "author": "Tyrana-suarez_Rex",
        "body": "Got my shit kicked in on Adobe once. Not worth it",
        "created_utc": 1588970654,
        "id": "fpwvcp5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588999454.0
    },
    {
        "author": "Vast_Cricket",
        "body": "More AAPL, add Adobe",
        "created_utc": 1588995507,
        "id": "fpy3zn7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589024307.0
    },
    {
        "author": "antivin",
        "body": "I bought AMD at $9 but sold at $15. FML",
        "created_utc": 1588810573,
        "id": "fppwlou",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1588839373.0
    },
    {
        "author": "theknowndude",
        "body": "i miss the old AMD, the outperform AMD\n\nstraight going up AMD, the no drop AMD\n\ni hate the new AMD, the make me GUH AMD\n\nno momentum AMD, the theta burn AMD\n\n-by me, a faggot",
        "created_utc": 1588791926,
        "id": "fpowmtw",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1588820726.0
    },
    {
        "author": "thelastkek",
        "body": "Bagheld NET ROKU AMD calls and got laid off today. Guh",
        "created_utc": 1588911921,
        "id": "fpufyks",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1588940721.0
    },
    {
        "author": "CoronavirusWithLime",
        "body": "Y'all remember when AMD was the flavor of the week every single week and now it's in the dirt",
        "created_utc": 1588812682,
        "id": "fpq0etv",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1588841482.0
    },
    {
        "author": "cryptosai",
        "body": "Okay thanks. Shorting AMD",
        "created_utc": 1588876853,
        "id": "fpsobt1",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588905653.0
    },
    {
        "author": "CramersAsshole",
        "body": "Would you eat out Lisa Su’s asshole for 500 AMD shares?",
        "created_utc": 1588394300,
        "id": "fp8jyuw",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588423100.0
    },
    {
        "author": "pvjumper05",
        "body": "Comments make it seem like AMD is down 10%\n\nIt’s half a percent...",
        "created_utc": 1588875894,
        "id": "fpsmbz3",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588904694.0
    },
    {
        "author": "pump4iron",
        "body": "Holy shit...I opened 50 AMD call credit spread 54/56 calls without realizing that i'm risking $9K for a max gain of just 900 bucks..  FML",
        "created_utc": 1588638904,
        "id": "fpidwo6",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588667704.0
    },
    {
        "author": "secondliaw",
        "body": "I sold my kidney so I can buy more AMD",
        "created_utc": 1588352757,
        "id": "fp6i65i",
        "score": 9,
        "subreddit": "stocks",
        "created": 1588381557.0
    },
    {
        "author": "WinterWeather5",
        "body": "I think SBUX will acquire AMD",
        "created_utc": 1588722257,
        "id": "fplz2e0",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588751057.0
    },
    {
        "author": "DARPA1191969v1",
        "body": "I can give the perspective from a tech/software dev.\n\nIn my opinion, these are sort of different players. In fact, I would say that NVDA and AMD are far more analogous to each other than even AMD -&gt; AAPL, and certainly to MSFT. The  way that I see it, NVDA/AMD are fundamentally companies that are concerned with producing a *physical good* \\- literal chipsets and dies. AAPL seems to waver on the hardware side of things (they have been known to go proprietary in that arena, but have also loaned out work to INTC on more than one occasion). I most certainly see MSFT as a true software/PaaS/SaaS company - suffice to say that they are producing very little in the way of physical goods.\n\nI think the *soft/hardware* direction is important to mention, because that fundamentally plays into the way that these companies deal in the market. Developing hardware is a mind-bendingly expensive process (relatively speaking). It takes years of R&amp;D and cash on hand to fund something that is truly great. An example of this would be the move AMD made to Zen (which is based on the concept of 'chiplets'; highly-scalable many-core designs that are fundamentally different from their monolithic predecessors).\n\nIn terms of growth, I would have to say that I see two viable options here: *NVDA and MSFT*. MSFT is pretty easy to explain; they create a product that fundamentally has lower upstart costs (software development's most expensive attribute is the cost of human labor) and lower maintenance costs (I would think). There is some movement towards a more data-center driven profit scheme (which would require boots on ground hardware en masse), and Azure is certainly an AWS competitor, but I think we've yet to see them really go full throttle on that (I think it could be big if they did).\n\nNVDA is a leader from a technological perspective. GPU compute-cores are very specialized devices that are good at doing only a few things, but very, *very well.* NVDA has been hammering away at this technology for years - they know the game, and they know where the money is. Autonomous cars, drones...the computer viz recogition software for postal, for literally anything, runs on a platform that is fundamentally a GPU (very high level view here). Machine learning applications in this field at the data-center level (think machine learning on AWS) are absolutely dominated by NVDA; In fact I would go as far as to say there aren't really a lot of competitors out there that are bringing to the table what NVDA does (Honestly AMD has severely gimped even their consumer dies at this point).\n\n&amp;#x200B;\n\nI can elaborate more, but I'd go with MSFT and NVDA on this one.",
        "created_utc": 1588630100,
        "id": "fphydh4",
        "score": 8,
        "subreddit": "investing",
        "created": 1588658900.0
    },
    {
        "author": "Howard_510",
        "body": "Wtf this is literally a replay of last Nov-Feb. We’ve had Tesla $1000c, MSFT $200c, AMD $60c and now SPCE $35c and BYND $120c all over again.\n\nAre we stuck in a simulation?",
        "created_utc": 1588721027,
        "id": "fplwvsn",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1588749827.0
    },
    {
        "author": "Stackin_Paper",
        "body": "AMD fucking sucks",
        "created_utc": 1588965574,
        "id": "fpwliwg",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588994374.0
    },
    {
        "author": "forgetful_storytellr",
        "body": "I jumped back in today after taking a week off ( WSB/RH was legit affecting my work performance but I make more money on this gay app so fuck it)\n\nAnyway here were my moves:\n\nETSY puts (I’m bearish on $BECKY this quarter because their sugar daddies are broke right now)\n\nBABA calls (we’re $15/$20 under expert target prices and we’re talking about a China’s Amazon here)\n\nDeep BABA put (as a hedge against rug pull)\n\nUBER calls (I just have a weird vibe that Uber belongs in the low 40s)\n\nAMD call (ride the hype)\n\ndeep AAPL put (for funsies)\n\nGLUU put (tap sports baseball is a trainwreck — Didi Gregorius was still a yankee)\n\n$SBUX call (ok I whiffed here)\n\nTomorrow I’ll probably hold at open to get a general sense of direction for the day, sell half of the opposite side.",
        "created_utc": 1588730485,
        "id": "fpmd55i",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588759285.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "I have 59% of my portfolio in MSFT$  \n\nAnd I sleep like a baby \n\n😂😂😂😂\n\nFuck I have 7% in amd$ and I lose more sleep over them\nHahahah \n😂😂😂",
        "created_utc": 1588553629,
        "id": "fperw66",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588582429.0
    },
    {
        "author": "be_o3",
        "body": "Let this sink in. AMD, the one tech company that met earning expectations, tanks the most each time",
        "created_utc": 1588707926,
        "id": "fpl7vr0",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588736726.0
    },
    {
        "author": "strawberry-jam-boy",
        "body": "Fuck you amd\n\nPiece of shit",
        "created_utc": 1588706553,
        "id": "fpl55pe",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588735353.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "OK U STUPID FUCKS \nMOST UNDERVALUED STONKS \n\n1. AMD$\n\n2. SHOP$\n\n3. TESLA $ \n\n\nNo way u can argue this !!!",
        "created_utc": 1588806855,
        "id": "fpppvld",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588835655.0
    },
    {
        "author": "hihihi12344",
        "body": "people claling me clowns for getting amd calls, they printing now",
        "created_utc": 1588359606,
        "id": "fp6w40x",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588388406.0
    },
    {
        "author": "Schobeyy",
        "body": "All you \"fuck you bears/bulls\" people are annoying as shit. It's obvious nobody has a clue what the market is going to do day in and day out. Start playing smart. Go with your gut. And please for the love of god stop reading this chat all day. It will help, I promise lmao. Good luck gentleman. You are going to need it. \n\nPositions: VXX $40c 6/5 FRO $11c 6/19 AMD $55c 5/22 LYFT $25p 5/15 CCL $17c 6/5 and a shit ton of SPXS shares",
        "created_utc": 1588622704,
        "id": "fphk5oa",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588651504.0
    },
    {
        "author": "LimitedNetwork",
        "body": "I love AMD one of the few companies I actually hold a long position in fuck Intel they are ripe to be fucked on. 2021 they also come out with their data center gpus that rival the NVDA titan class gpu at 30% less wattage.",
        "created_utc": 1588889603,
        "id": "fpte5sd",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588918403.0
    },
    {
        "author": "APHAbaghodler",
        "body": "Sold my AMD calls for break even before close.. what a gay fucking week.. literally bought them last Friday and no fucking movement since then.. holy fuck. Watch, it's going to moon next week. Gap up to 55 confirmed.. potential 10K fucking gain lost. Since when did AMD turn into a fucking boomer stock like F and GE.. shit was flat all fucking week.",
        "created_utc": 1588978220,
        "id": "fpx9et3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1589007020.0
    },
    {
        "author": "DonBonleone",
        "body": "I officially quit today 🥺\n\nAMD punched through my asscheeks like a cork. Threw extra cash on RWT stocks and uninstalled",
        "created_utc": 1588723908,
        "id": "fpm1ydp",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588752708.0
    },
    {
        "author": "readerbunny",
        "body": "I put 5k into amd shares at $2.15. I sold at 2.75 or something stupid a couple weeks later.",
        "created_utc": 1588812456,
        "id": "fpq000n",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588841256.0
    },
    {
        "author": "Larnek",
        "body": "5/8 SPY 288p's up 40% and 5/8 AMD 53c down 11%.. my dick has never been so hard and scared at the same time. Not while sober at least.",
        "created_utc": 1588733629,
        "id": "fpmi7c6",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588762429.0
    },
    {
        "author": "be_o3",
        "body": "I think AMD will go back up next week. The only question is how high.",
        "created_utc": 1588374482,
        "id": "fp7ocyg",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588403282.0
    },
    {
        "author": "CptTonyStark",
        "body": "Always avoid groupthink. \n\nI remember the first 3 days of the Feb crash WSB kept shouting, “Stonks Always Go Up”. \n\nThen when we hit the bottom, WSB kept repeating “SPY 180”. \n\nWSB told me “Don’t bet against the mouse”, “Don’t doubt Elon’s Vibe”, “AMD is an overvalued company” but I hit 10 baggers shorting TSLA from 700 to 350, riding AMD calls from 40 to 58, and my DIS puts paid off bigly too. \n\nThis new “Don’t bet against America” sentiment feels similar. I’m 100% cash gang in May but I wanna encourage you all to always think for yourself.",
        "created_utc": 1588895071,
        "id": "fptoe7u",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588923871.0
    },
    {
        "author": "sylphvanas",
        "body": "Why is AMD sucking a fat cock this week?",
        "created_utc": 1588877568,
        "id": "fpsptt3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588906368.0
    },
    {
        "author": "HourPackage",
        "body": "Does AMD have coronavirus?",
        "created_utc": 1588877570,
        "id": "fpsptxv",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588906370.0
    },
    {
        "author": "200lbRockLobster",
        "body": "Just pulled the trigger on a new AMD build with that stimulus check. Can't wait for it all to arrive.",
        "created_utc": 1588636525,
        "id": "fpi9sne",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588665325.0
    },
    {
        "author": "hughesmaxwell",
        "body": "You can almost afford a share of AMD",
        "created_utc": 1588644029,
        "id": "fpimjwz",
        "score": 6,
        "subreddit": "stocks",
        "created": 1588672829.0
    },
    {
        "author": "umbrellacorgi",
        "body": "AMD to 54 by EOW or Su Bae said she is personally going on Only Fans to raise money for investors 😤😤😍😍📈📈🚀🚀",
        "created_utc": 1588612886,
        "id": "fph0o18",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588641686.0
    },
    {
        "author": "throwawaay1112341",
        "body": "amd bounced off 20 day this thing is going higher.",
        "created_utc": 1588608390,
        "id": "fpgrw74",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588637190.0
    },
    {
        "author": "Money_Turtle",
        "body": "Well Im getting assigned some AMD on Monday.",
        "created_utc": 1588365693,
        "id": "fp77yp8",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588394493.0
    },
    {
        "author": "ignore_shitpost",
        "body": "AMD is such a disappointment every day",
        "created_utc": 1588697044,
        "id": "fpklz3f",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588725844.0
    },
    {
        "author": "PaintedParadise",
        "body": "Man fuck AmD for real",
        "created_utc": 1588706975,
        "id": "fpl5znv",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588735775.0
    },
    {
        "author": "BigEd781",
        "body": "&gt;The reason for this is that most blue chips nowadays have already had there Impressive growth\n\nHave you calculated how many years of growth at X% are already baked into the price of a single share of AMD? I'm not saying AMD is a bad investment, I like AMD as a company quite a bit, but I would hope you understand how to project earnings, relate that to share price, and evaluate that in the context of their current P/E. \n\nYou're about to put a lot of money on something I don't think you've quite thought through.\n\n&gt;comparable companies to amd like Nvidia have a stock prices in the hundreds\n\nCompletely irrelevant. If I told you I'd sell you 1/10 of my company for $1, or 1/20 for $0.50, what's the difference?",
        "created_utc": 1588971610,
        "id": "fpwx746",
        "score": 6,
        "subreddit": "stocks",
        "created": 1589000410.0
    },
    {
        "author": "Expect_The_Opposite",
        "body": "look at intc and amd. they both ran up and then dumped after their earnings. probably gonna have a similar thing happen to nvda.",
        "created_utc": 1588872196,
        "id": "fpsenz1",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588900996.0
    },
    {
        "author": "Briggie",
        "body": "Today, AMD got yet another promising launch with the R3 3100 and 3300x. Both are getting pretty good reviews.",
        "created_utc": 1588886583,
        "id": "fpt87z8",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1588915383.0
    },
    {
        "author": "mattbeau80",
        "body": "Wow what a candle on AMD",
        "created_utc": 1588706591,
        "id": "fpl58ev",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588735391.0
    },
    {
        "author": "billyswag94",
        "body": "Haha, I’m sorry, AMD",
        "created_utc": 1588712448,
        "id": "fplgtcf",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588741248.0
    },
    {
        "author": "throwAwayMyCsDegree",
        "body": "If SPY tanks Monday what’re the chances that AMD, WMT, CSCO and BOX are still up? Asking for a friend",
        "created_utc": 1588967210,
        "id": "fpwoqzn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588996010.0
    },
    {
        "author": "APHAbaghodler",
        "body": "Ugh the dr\\*lling again.. fuck me.. just when i bought more AMD calls. Fuck me..",
        "created_utc": 1588804254,
        "id": "fppl1sm",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588833054.0
    },
    {
        "author": "NotGucci",
        "body": "Yeah might as well sell for a 50 %. I fucked up by holding AMD, and V after earnings thinking it would recover given it was 2 weeks out. You are going feel theta burn come Monday. A 50% loss is better than a 90 % loss.",
        "created_utc": 1588808038,
        "id": "fpps1nw",
        "score": 5,
        "subreddit": "stocks",
        "created": 1588836838.0
    },
    {
        "author": "Pirelli85",
        "body": "Raise your hand if you’re annoyed by SuBae &amp; AMD. \n\n$55c for 5/15\n\n🙋‍♂️",
        "created_utc": 1588815964,
        "id": "fpq66mk",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588844764.0
    },
    {
        "author": "Degenerate95",
        "body": "Is AMD going to moon? Please or Put red",
        "created_utc": 1588730922,
        "id": "fpmduz9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588759722.0
    },
    {
        "author": "bicameral_mind",
        "body": "Investors leaving TSLA should really consider AMD.\n\nFeel the warmth of su bae's sweet embrace.",
        "created_utc": 1588347199,
        "id": "fp66yyn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588375999.0
    },
    {
        "author": "Tiiimmmaayy",
        "body": "Watch this actually be the start of another great big dip.\nI first started with options a month before the first big decline. I remember making a comment along the lines of \"I refuse to believe that the moment I start playing options, a recession happens\" when my MSFT 200c and AMD 60c shit the bed.\n\nWell now I sold all my positions and went full boomer and just bought stocks today. This is the start of another nosedive. Just watch.",
        "created_utc": 1588349261,
        "id": "fp6b1uu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588378061.0
    },
    {
        "author": "MrWSB",
        "body": "AMD calls free money\n\nUp 20% on 200 contracts a month out",
        "created_utc": 1588607226,
        "id": "fpgpmy5",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588636026.0
    },
    {
        "author": "Boris-Vasilyev",
        "body": "imagien thinking future was gonna be green today lmfao !😆\n\namd next week too is gonabe so red amazing crash coming",
        "created_utc": 1588545202,
        "id": "fped7bt",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588574002.0
    },
    {
        "author": "HourPackage",
        "body": "Why did I invest in this meme stonk AMD when I could be crushing it with a serious company like fastly?",
        "created_utc": 1588879898,
        "id": "fpsumvi",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588908698.0
    },
    {
        "author": "trynacash",
        "body": "AMD 55-60 EOW",
        "created_utc": 1588779653,
        "id": "fpo7da4",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588808453.0
    },
    {
        "author": "moneyandbanking1",
        "body": "AMD broke through. Blast off time",
        "created_utc": 1588787321,
        "id": "fpon7by",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588816121.0
    },
    {
        "author": "SDisSCAMMIN",
        "body": "I don’t think AMD is hitting 55 by friday",
        "created_utc": 1588720641,
        "id": "fplw6kl",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588749441.0
    },
    {
        "author": "Bxdwfl",
        "body": "we prefer the term \"AMD\" strength",
        "created_utc": 1588613138,
        "id": "fph161m",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588641938.0
    },
    {
        "author": "YepRabbit",
        "body": "Give me AMD 55 end of week pls",
        "created_utc": 1588607047,
        "id": "fpgpad0",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588635847.0
    },
    {
        "author": "BrownBoiler",
        "body": "AMD, TSLA, BA calls leggo",
        "created_utc": 1588637118,
        "id": "fpiatqr",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588665918.0
    },
    {
        "author": "AyeDennis",
        "body": "Who else is thinking amd is looking good?",
        "created_utc": 1588358370,
        "id": "fp6tlip",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588387170.0
    },
    {
        "author": "S_p_encer",
        "body": "It’s funny, long time bear but yesterday I finally cracked and picked up some shares of AMD in my Roth. I’m sorry to the bulls for killing you",
        "created_utc": 1588350599,
        "id": "fp6drmx",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588379399.0
    },
    {
        "author": "DeanYerdon",
        "body": "Why is AMD consistently more pathetic than everything else",
        "created_utc": 1588707607,
        "id": "fpl78s1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588736407.0
    },
    {
        "author": "billyswag94",
        "body": "https://www.pcgamer.com/amd-ryzen-4000-release-date-specs-performance/\n\nAMC is releasing a new CPU for gaming computer, if you don’t wanna miss the ride, buy calls tomorrow when it’s still on discount",
        "created_utc": 1588712403,
        "id": "fplgq5q",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588741203.0
    },
    {
        "author": "Yak54RC",
        "body": "Just sold my AMD calls. So if they moon after this, you’re welcome",
        "created_utc": 1588965599,
        "id": "fpwlkm8",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588994399.0
    },
    {
        "author": "be_o3",
        "body": "I can't believe AMD is still having a fit about those earnings",
        "created_utc": 1588869140,
        "id": "fps8a8f",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588897940.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "idk if u can tell but theres controlled dumping of AMD",
        "created_utc": 1588875505,
        "id": "fpslj92",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588904305.0
    },
    {
        "author": "sylphvanas",
        "body": "Still can't believe I sold my NVDA calls for a loss and got AMD calls, FML",
        "created_utc": 1588872731,
        "id": "fpsfs26",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588901531.0
    },
    {
        "author": "Darkdude24",
        "body": "I just made my first ever option trade on a put on AMD and I made 300 dollars lol",
        "created_utc": 1588360609,
        "id": "fp6y371",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588389409.0
    },
    {
        "author": "UeberMeister",
        "body": "This week seriously fucked so many, AMZN, TSLA and AMD shitting the bed, MSFT staying sideways as usual",
        "created_utc": 1588363145,
        "id": "fp732ew",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588391945.0
    },
    {
        "author": "AggieLand42",
        "body": "Oh AMD I knew your sexy little ass would come back alive this week &lt;3",
        "created_utc": 1588607670,
        "id": "fpgqi5s",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588636470.0
    },
    {
        "author": "futureisours",
        "body": "Yup amd always recovers after it tanks on earnings. Easy $$$",
        "created_utc": 1588608130,
        "id": "fpgreh9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588636930.0
    },
    {
        "author": "betaraywill",
        "body": "Just been gambling the wrong way the past 2 weeks. Booooooo. Spy 275ps - and didn’t buy AMD 52cs ... Booooooooooo",
        "created_utc": 1588609790,
        "id": "fpgulc2",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588638590.0
    },
    {
        "author": "StreicherADS",
        "body": "AMD calls",
        "created_utc": 1588645728,
        "id": "fpipazm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588674528.0
    },
    {
        "author": "feelin_cheesy",
        "body": "AMD what you doing bby?",
        "created_utc": 1588707854,
        "id": "fpl7qg9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588736654.0
    },
    {
        "author": "i_iz_potato",
        "body": "Thanks AMD for shitting on my chest, I mean it is my fetish",
        "created_utc": 1588708725,
        "id": "fpl9hc6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588737525.0
    },
    {
        "author": "SolopreneurOnYoutube",
        "body": "AMD has been good to me so far for the wheel",
        "created_utc": 1588892835,
        "id": "fptkaef",
        "score": 4,
        "subreddit": "options",
        "created": 1588921635.0
    },
    {
        "author": "unteagle20",
        "body": "Amd still gonna open red in the morning so none of this shit matters",
        "created_utc": 1588918182,
        "id": "fpuo05d",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588946982.0
    },
    {
        "author": "SPCE_VIRGIN",
        "body": "I tell myself that institutional investors are in the \"accumulation\" phase and AMD will moon soon  \n\n\nAMD 57.5c 6/19  \n\n\n^(please)",
        "created_utc": 1588873870,
        "id": "fpsi595",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588902670.0
    },
    {
        "author": "Boomer2200",
        "body": "Still don’t get how AMD isn’t apart of this rally",
        "created_utc": 1588869815,
        "id": "fps9oxf",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588898615.0
    },
    {
        "author": "SubyDude707",
        "body": "As someone holding SPY and AMD calls, today is just terrible. At least they don't expire till 5/8 and 5/15, respectively.",
        "created_utc": 1588355740,
        "id": "fp6o95s",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588384540.0
    },
    {
        "author": "Jtbny",
        "body": "I like AMD long term. They have a history of going down after positive earnings and w/whats happening around the world who knows where it lands by mid June.",
        "created_utc": 1588359798,
        "id": "fp6whrb",
        "score": 4,
        "subreddit": "options",
        "created": 1588388598.0
    },
    {
        "author": "captainstrange94",
        "body": "Anyone buying AMD calls EOD or waiting till Monday?",
        "created_utc": 1588359811,
        "id": "fp6wimz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588388611.0
    },
    {
        "author": "DanielSon602",
        "body": "Just catching those AMD knives 😭",
        "created_utc": 1588348656,
        "id": "fp69ukg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588377456.0
    },
    {
        "author": "EuphoricFactor",
        "body": "Literally sold AMD calls on Friday, fml",
        "created_utc": 1588608696,
        "id": "fpgsh6q",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588637496.0
    },
    {
        "author": "YepRabbit",
        "body": "AMD 55 end of week",
        "created_utc": 1588621704,
        "id": "fphi5r9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588650504.0
    },
    {
        "author": "ApexWolves",
        "body": "Well at this point any legitimate kind of TA, FA or DD at all that generally would make a trader profitable is completely and utterly fucking useless.  So. Retard trading strategies should be employed at this point. First, I see AMD has had three red days in a row which means stonks should only go up to ATH 6/12 65c... thats probably playing it a bit safe, i meant 6/12 70c. Wait. I meant 5/15 70c. There. That looks better.",
        "created_utc": 1588867361,
        "id": "fps4kyj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588896161.0
    },
    {
        "author": "StoneHolder28",
        "body": "So uh... What's you're next move on AMD?",
        "created_utc": 1588961212,
        "id": "fpwcuyh",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588990012.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "AMD 55$",
        "created_utc": 1588916129,
        "id": "fpulitk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588944929.0
    },
    {
        "author": "billyswag94",
        "body": "AMD is officially excluded from meme stocks, isn’t it? I’ve never been so disappointed at it like right now. I’m waiting for the right moment into get into SHOP",
        "created_utc": 1588919510,
        "id": "fpupjrx",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588948310.0
    },
    {
        "author": "MP1182",
        "body": "AMD is such a piece of shit I have no idea why I still play it.",
        "created_utc": 1588797696,
        "id": "fpp8bco",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588826496.0
    },
    {
        "author": "Semithedog",
        "body": "Fuck u AMD",
        "created_utc": 1588794332,
        "id": "fpp1itz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588823132.0
    },
    {
        "author": "MrWSB",
        "body": "AMD CALLS \n\n60$ this week pls \n\nEarnings went bigly dildos good and AMD dropped like a brick. \n\n20% drop in 2 days on such a good stock =yolo everything into calls",
        "created_utc": 1588649882,
        "id": "fpivsy5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588678682.0
    },
    {
        "author": "OgLocBabyy",
        "body": "Y’all think Tesla and AMD go up more?",
        "created_utc": 1588625261,
        "id": "fphp6yj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588654061.0
    },
    {
        "author": "zaktrades123",
        "body": "Amd and Tesla got me rock solid today",
        "created_utc": 1588615403,
        "id": "fph5nv8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588644203.0
    },
    {
        "author": "elesdee1",
        "body": "amd boutta pop",
        "created_utc": 1588606997,
        "id": "fpgp6x0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588635797.0
    },
    {
        "author": "DCook0308",
        "body": "Keep going AMD!",
        "created_utc": 1588607746,
        "id": "fpgqnke",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588636546.0
    },
    {
        "author": "JeanClaudeRumHam",
        "body": "AMD. NVDA is a good runner up. AMD stands to grow the most because on top the growth in various hardware markets, which it shares with NVDA. AMD is also slowly eating Intel's market share as well. Which NVDA can't do.\n\nAAPL is being destroyed by Huawei especially in China. And the growing anti-US sentiment in China as well as China being one of the few economically opened markets through this Pandemic won't help Apple's overall sales anytime soon.\n\nMSFT is a blue chip. It's not going to grow very fast. It will likely move with the overall market.\n\nAMD will be that stock in 2025 that people will go, \"I wish I would've bought AMD back in 2017 after Lisa Su overhauled the product line.\" Like AAPL 2004, AMZN 2012, or NFLX 2013. Full diclosure, I bought a boat load of AMD at \\~$10 in 2017. I don't know if that makes me too biased to listen to or more credible about the stock but there you go.",
        "created_utc": 1588640872,
        "id": "fpih9iy",
        "score": 4,
        "subreddit": "investing",
        "created": 1588669672.0
    },
    {
        "author": "jay0319",
        "body": "AMD EVERYONE ON WSB ROOTING FOR YOU!!! UP UP UP!!",
        "created_utc": 1588608091,
        "id": "fpgrbqc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588636891.0
    },
    {
        "author": "sparta0703",
        "body": "selling my amc and amd calls tomorrow i want off this wild ride. JK will keep until they expire worthless",
        "created_utc": 1588653808,
        "id": "fpj181w",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588682608.0
    },
    {
        "author": "wolfofnostreet100",
        "body": "Gild 85 call 5/8 \nSpy 295 call 5/6 \nAmd 60 5/1\nAmd 65 5/1",
        "created_utc": 1588354462,
        "id": "fp6ln7y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588383262.0
    },
    {
        "author": "wsb-narrator",
        "body": "SHOP, TSLA, SPCE, AMD",
        "created_utc": 1588359846,
        "id": "fp6wl5d",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588388646.0
    },
    {
        "author": "moneyandbanking1",
        "body": "Of all the trading regrets I have the biggest is selling 500 AMD sharesfor $20 in my IRA.\n\nCost basis was $10.45...\n\nI thought no way could it keep going up..",
        "created_utc": 1588957061,
        "id": "fpw4ee4",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588985861.0
    },
    {
        "author": "mtsdorf",
        "body": "ANET Arista Networks",
        "created_utc": 1588732741,
        "id": "fpmgs6g",
        "score": 2,
        "subreddit": "investing",
        "created": 1588761541.0
    },
    {
        "author": "anomander_rake123",
        "body": "I have ANET calls",
        "created_utc": 1588709288,
        "id": "fplalf4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588738088.0
    },
    {
        "author": "KX9lol",
        "body": "Never buy calls on ANET ER. They always plummet no matter how good lately",
        "created_utc": 1588742142,
        "id": "fpmul14",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588770942.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  4th of May\n\n\n\n## Upcoming events for Tuesday, May  5th\n\n - Expected earnings:\n\n  ABG, ACLS, ACM, ACOR, ADNT, ADRO, AER, AGCO, AGLE, AGN, AGRX, AGTC, AHCO, AIZ, AJX, AKBA, AKCA, AKR, ALK, ALL, AMCX, AME, AMK, ANAB, ANDE, ANET, AOS, AOSL, APTO, APTV, AQST, ARCB, ARCC, ARDX, ARMK, AROC, ASC, ASH, ATCO, ATGE, ATI, ATRS, ATSG, ATVI, AXNX, BCH, BCO, BGCP, BGFV, BGS, BHVN, BKD, BKI, BLCM, BLD, BLDP, BLKB, BMCH, BRG, BTAI, BTG, BXC, BYND, CAI, CAKE, CAMP, CARA, CBB, CBFV, CBMG, CC, CDK, CEA, CELC, CEQP, CERS, CGBD, CHCT, CHFS, CHUY, CLDX, CLPT, CLVS, CLW, CMP, CMPR, CNK, CNO, COHR, COHU, CPAC, CPSI, CRD.B, CRI, CSII, CTLT, CTRE, CTSO, CVLT, CZNC, D, DBD, DCPH, DD, DEA, DENN, DHT, DIS, DK, DKL, DNR, DOOR, DRRX, DVA, DVN, DXPE, EA, EC, EFC, EIDX, ENPH, EOLS, EQR, ETM, ETON, EVBG, EVRI, EXEL, EXPD, FATE, FCAU, FCBC, FI, FMC, FNHC, FPH, FSTR, GBL, GFN, GLDD, GLMD, GLRE, GLT, GMDA, GORO, GPI, GRPN, GRWG, GTE, GTES, HA, HAE, HBIO, HCHC, HCKT, HCR, HE, HPP, HSIC, HTA, HVT, HWM, I, ICAD, ICFI, INCY, INFI, INGN, INGR, INSP, IOTS, IOVA, IPGP, IR, ITW, IX, JAZZ, JBGS, JELD, JLL, JOUT, KAR, KEX, KGC, KIDS, KLAC, KOPN, KPTI, KRYS, KZR, LADR, LAND, LC, LCII, LDOS, LFVN, LGIH, LHX, LILA, LITE, LL, LPSN, LPX, MAT, MATX, MCS, MDC, MEC, MED, MELI, MEOH, MFA, MGNX, MGP, MIC, MLCO, MLM, MMI, MNK, MODN, MOR, MPC, MPLX, MSC, MTCH, MUX, MYGN, NBR, NEM, NEX, NEXA, NEXT, NLTX, NPO, NR, NRZ, NTEC, NVRO, NVTA, OAS, OCFT, OLP, OMP, ONTO, OPK, ORCC, OSPN, OTTR, OVID, OXFD, OXY, PAA, PAGP, PAYS, PBPB, PEAK, PFMT, PINC, PINS, PKI, PLMR, PLNT, PLT, PLYA, PQG, PRIM, PRNB, PRO, PRPL, PRU, PUMP, PZZA, QTRX, QUAD, QUMU, QUOT, RCM, RDHL, REGN, RGA, RGNX, RGS, RIGL, RPAI, RRR, RSG, RVI, RVSB, RWLK, RYAM, SAND, SBAC, SBSI, SEE, SFM, SGMS, SIFY, SIGI, SLF, SND, SOHO, SOLO, SPCE, SPG, SPKE, SPN, SRC, STIM, STOR, SU, SUPN, SWX, SYY, TA, TCO, TDG, TEUM, TH, TISI, TREC, TREE, TRI, TRIP, TROV, TSLX, TSQ, TSU, TT, TTI, TTOO, TUES, UEC, UFPT, USAC, USCR, USFD, USWS, VAPO, VCEL, VGR, VGZ, VOYA, VPG, VRCA, VREX, VRSK, VRT, VST, VVUS, VYGR, W, WBT, WES, WIFI, WMGI, WRK, WTTR, WU, XENE, XYL, Y, YORW, ZAGG, ZGNX\n\n - Ex-div:\n\n  AMTD, BFIN, DCOM, EIG, MDC, PHG, RELL, WBS, WTBA\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 10.000M)\n    - Exports (previous: 207.50B)\n    - IBD/TIPP Economic Optimism (previous: 47.8)\n    - ISM Non-Manufacturing Business Activity (previous: 48.0)\n    - ISM Non-Manufacturing Employment (previous: 47.0)\n    - ISM Non-Manufacturing New Orders (previous: 52.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 52.5)\n    - ISM Non-Manufacturing Prices (previous: 50.0)\n    - Imports (previous: 247.50B)\n    - Markit Composite PMI (consensus: 27.4, previous: 40.9)\n    - Redbook (previous: -11.8%)\n    - Redbook (previous: -8.1%)\n    - Services PMI (consensus: 27.0, previous: 39.8)\n    - Trade Balance (consensus: -44.00B, previous: -39.90B)\n\n## Upcoming events for Wednesday, May  6th\n\n - Expected earnings:\n\n  ACMR, ACRE, ADMA, ADTN, AEIS, AEL, AEP, AERI, AFIN, AI, ALB, ALE, ALG, ALGT, ALLO, ALNY, ALTM, ALXN, AMED, AMOT, AMP, AMPY, ANGI, ANSS, AP, APA, AQUA, ARES, ASM, ASTE, ATO, ATRA, AVB, AVNS, AWK, AXGN, AXTA, AYX, AZPN, BBSI, BBU, BCRX, BCSF, BEAT, BEP, BFAM, BFYT, BG, BHR, BIO, BKCC, BNFT, BPMC, BRKR, BRY, BWA, CAPL, CARS, CBZ, CCMP, CCO, CDAY, CDW, CECE, CENT, CENTA, CF, CFMS, CGEN, CHEF, CHMG, CIM, CLDT, CLI, CLLS, CNHI, CNST, CORR, CPA, CPG, CPK, CPLP, CRHM, CRK, CSGS, CSTE, CTL, CUB, CVNA, CVS, CW, CXW, CYTK, DAR, DCP, DDD, DHX, DISCA, DLHC, DNN, DNOW, DRQ, DRTT, DX, EAF, ELVT, EMKR, ENBL, ENTA, EPAY, EPR, EQIX, ERYP, ES, ESE, ESPR, ESS, ETSY, EVFM, EVRG, EXAS, EXR, EXTR, EYPT, FCPT, FG, FIT, FLIR, FMS, FNV, FOE, FORM, FOXA, FOXF, FRT, FSK, FSLY, FTDR, FTNT, FTS, FUN, GBT, GCP, GDDY, GEL, GM, GMRE, GNK, GNL, GOLD, GPC, GPN, GRUB, GSS, GSX, GTHX, GTY, H, HDSN, HEP, HI, HR, HSON, HT, HUBS, HZNP, IAA, IAC, IDN, IIPR, IMMU, IMUX, INMD, INN, INSG, INVH, IO, IONS, IPI, IRT, IRWD, ISEE, IVC, J, JAX, JNCE, KFRC, KKR, KL, KRG, KW, LASR, LCI, LGND, LNC, LPI, LVGO, LXU, LYFT, MAA, MCFT, MEET, MET, MFC, MLVF, MNKD, MNR, MOR, MRO, MTRX, MX, MYE, NBIX, NDLS, NE, NEPH, NI, NMFC, NMIH, NOA, NREF, NTR, NTRA, NUS, NUVA, NXST, NYT, ODP, OMI, OPK, OSB, OSUR, PAAS, PACB, PAG, PARR, PEIX, PERI, PGEN, PING, PKOH, PPD, PRTA, PRTS, PSN, PTON, PXD, PYPL, PZZA, QDEL, QGEN, QMCO, QNST, QRTEA, QTWO, RAIL, RARE, RBBN, RCII, RCL, RDN, RDWR, RE, REAL, RESN, REZI, RGEN, RGLD, RM, RMAX, RNG, RNR, ROCK, RP, RST, RTLR, RUBI, RUN, RYI, SAVE, SBBP, SBGI, SBH, SBOW, SBRA, SEDG, SHOP, SID, SITM, SJI, SLRX, SMG, SMSI, SONO, SPNE, SPR, SPT, SQ, SRI, SRPT, STAA, STAY, STFC, STKL, STN, STNG, SWM, TALO, TBPH, TCP, TIVO, TLND, TMDX, TMHC, TMUS, TNC, TPC, TPVG, TRMB, TRNO, TROX, TRVG, TSE, TTGT, TUSK, TVTY, TWLO, TWO, TXMD, UDR, UFCS, UGI, UIHC, UPWK, VBIV, VCYT, VIAV, VIV, VMC, VNDA, VNTR, VRTV, VTVT, VVUS, WATT, WCN, WD, WELL, WEN, WING, WKHS, WLL, WM, WMC, WPM, WPX, WTI, WTRG, WTS, WYND, XEC, XPER, ZIXI, ZNGA, ZTS\n\n - Ex-div:\n\n  AMG, AWI, AZZ, CATC, CNXM, ET, ETR, FE, FELE, FSBW, GMLP, HTBK, INTC, KBH, LSBK, LSTR, MATX, NBN, NEP, NGL, NWBI, OFED, OPBK, PTMN, RUSHA, RUSHB, SIMO, SUN, VAM, VBTX, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -20,000K, previous: -27K)\n    - Crude Oil Imports (previous: -0.047M)\n    - Crude Oil Inventories (consensus: 10.619M, previous: 8.991M)\n    - Cushing Crude Oil Inventories (previous: 3.637M)\n    - Distillate Fuel Production (previous: -0.025M)\n    - EIA Refinery Crude Runs  (previous: 0.305M)\n    - EIA Weekly Distillates Stocks (consensus: 3.600M, previous: 5.092M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.7%, previous: 2.0%)\n    - Gasoline Inventories (consensus: 2.527M, previous: -3.669M)\n    - Gasoline Production (previous: 0.530M)\n    - Heating Oil Stockpiles (previous: -0.892M)\n    - MBA 30-Year Mortgage Rate (previous: 3.43%)\n    - MBA Mortgage Applications (previous: -3.3%)\n    - Seevol Cushing Storage Report (previous: 4.150M)\n\n## Upcoming events for Thursday, May  7th\n\n - Expected earnings:\n\n  AAN, AAOI, AAON, AAWW, AAXN, ABC, ABEV, ACAD, ACIA, ADMS, ADSW, ADT, AES, AGEN, AGS, AHT, AINC, AIRG, AIV, AL, ALBO, ALDX, ALRM, ALTR, AMH, ANIK, ANIP, APPN, AQB, AQN, ARGO, ARI, ARNA, ARWR, ASMB, ASUR, ASYS, AT, ATEN, ATNX, ATTO, AUMN, AUTL, AUTO, AVID, AVLR, AXDX, AZUL, BAP, BATRK, BCE, BCEI, BCLI, BDSI, BDX, BECN, BFS, BGG, BGSF, BHC, BILL, BIOL, BJRI, BKNG, BLL, BMY, BRBR, BRX, BSIG, BTE, BUD, BV, CALA, CARE, CARG, CBIO, CBRE, CCOI, CCRN, CDXS, CFX, CHMA, CHRS, CIO, CIR, CLBS, CLNC, CLNE, CLUB, CLXT, CNDT, CNNE, CNP, CNQ, COLD, COLL, COMM, CORE, CPT, CRC, CRL, CRNC, CSLT, CTB, CTMX, CTSH, CTVA, CUBE, CUTR, CVA, CVEO, CVTI, CWEN, CWK, CWST, CYRX, DBX, DEI, DFIN, DGII, DHC, DHR, DLPH, DLR, DLX, DOC, DOX, DRNA, DSKE, DVAX, DZSI, ECOL, ECOM, ED, EDIT, EFC, EGAN, EGLE, ELAN, ELGX, ELOX, ENB, ENDP, ENLC, ENR, ENV, EOG, EPAM, EPC, EQH, EQNR, EQT, ERIE, ESTA, ESTE, EURN, EVH, EVLO, EXLS, EXPE, FARM, FET, FFG, FGEN, FIS, FISV, FLDM, FLEX, FLMN, FLR, FLS, FLT, FLXN, FNKO, FOCS, FOLD, FORR, FPRX, FSLR, FVRR, FWONA, FWONK, GCI, GDP, GERN, GH, GKOS, GLIBA, GLOG, GLOP, GLPG, GLUU, GMED, GNC, GOLF, GPOR, GPRO, GSAT, GTN, GTS, GWRS, HAIN, HASI, HBB, HCI, HEAR, HES, HESM, HFC, HII, HIMX, HL, HLF, HLT, HMHC, HMN, HNGR, HSDT, HSKA, HST, IART, ICD, ICUI, IDCC, IEA, IHRT, IIIV, IMMR, ING, INSW, INVE, IPHI, IRM, IRTC, IT, ITCI, ITGR, JBLU, JCAP, JOBS, KALA, KAR, KIN, KINS, KLDO, KMPR, KRP, KTB, KTOS, KWR, LAMR, LAUR, LBRDA, LBRDK, LCTX, LHCG, LIN, LMRK, LNT, LOPE, LQDA, LQDT, LSI, LSXMA, LSXMK, LTRX, LUNA, LXP, LYG, LYV, MAC, MAIN, MATW, MBUU, MCHP, MCHX, MCRB, MD, MDRX, MDU, MGA, MGEN, MMI, MMS, MN, MNLO, MNST, MNTA, MR, MRAM, MRNA, MSI, MT, MTD, MTG, MTW, MUR, MVIS, NBY, NCSM, NET, NEWT, NGS, NGVC, NINE, NKTR, NMR, NMRK, NOMD, NRG, NSCO, NSIT, NTCT, NTLA, NUAN, NVAX, NVCN, NVEE, NWPX, NWSA, NXRT, OCSI, OCSL, OEC, OGE, OLED, OMCL, ONCY, ONEW, OPCH, OPGN, OPTN, ORTX, OTIS, OVV, PAHC, PAR, PBA, PBH, PBYI, PCRX, PCTI, PCTY, PDCE, PDFS, PDLI, PEB, PEI, PEN, PENN, PETQ, PFIE, PFNX, PFPT, PFSI, PFSW, PGNX, PLUG, PMT, PODD, POST, POWI, PRA, PRAA, PRDO, PRFT, PRMW, PROF, PRVB, PSNL, PWFL, PWR, QLYS, QRVO, RBA, RCUS, RDFN, RDUS, REG, REYN, RGNX, RHP, RLGY, RMNI, ROKU, RPD, RTIX, RTX, RVNC, SAGE, SAIL, SAND, SAR, SCOR, SELB, SERV, SHLX, SKYW, SLRC, SNDX, SNSS, SP, SPAR, SPH, SPPI, SPWR, SRCL, SREV, SRLP, SRTS, SSTI, STMP, SUNS, SUNW, SVMK, SWIR, SXI, SYNA, SYRS, TACT, TAST, TCDA, TCRD, TCX, TDC, TEVA, TGNA, THRM, THS, TMST, TNAV, TPIC, TPRE, TRGP, TRHC, TRUE, TRVN, TS, TTD, TU, TWI, TWST, UBER, UEIC, UMH, UNT, UPLD, URGN, USAK, VECO, VEON, VG, VIRT, VSLR, VSTO, VVI, VVNT, WEX, WLDN, WPG, WRI, WRLD, WSR, XAN, XEL, XERS, XFOR, XNCR, XOG, XONE, YELP, YETI, YMAB, ZG, ZIOP, ZYME\n\n - Ex-div:\n\n  AEP, AFB, AFIN, AMSWA, ARTNA, ASA, BCBP, BPFH, CADE, CBAN, CDR, CELP, CEQP, CINR, CIT, CLB, CPLP, CS, CSFL, CWBC, CXO, FCBC, FCF, FRBA, GABC, HMLP, HOPE, HSII, IBM, JBHT, LAD, LW, MET, MMLP, MMP, MPLX, NBLX, NSC, NYCB, OPB, PCTI, PFE, PH, PPBI, RBNC, SBFG, SBUX, SC, SCHW, SFBC, SIRI, SMBK, SON, SSB, STL, SXT, WAB, WAFD, WFC, WMT, WSFS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.095%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 222.288K)\n    - Challenger Job Cuts (previous: 266.9%)\n    - Consumer Credit (consensus: 15.00B, previous: 22.33B)\n    - Continuing Jobless Claims (consensus: 19,810K, previous: 17,992K)\n    - FOMC Member Harker Speaks\n    - Initial Jobless Claims (consensus: 3,000K, previous: 3,839K)\n    - Jobless Claims 4-Week Avg. (previous: 5,033.25K)\n    - Natural Gas Storage (previous: 70B)\n    - Nonfarm Productivity (consensus: -5.5%, previous: 1.2%)\n    - Unit Labor Costs (consensus: 4.0%, previous: 0.9%)\n\n^^^^2020-05-04",
        "created_utc": 1588601659,
        "id": "fpgfi8g",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1588630459.0
    },
    {
        "author": "Chucktownbadger",
        "body": "As far as ANET is concerned it’s because nothing in tech makes sense.  For example, I like NTNX and it dropped from 20 to 17 last week and then back to 20 AH today.",
        "created_utc": 1588726045,
        "id": "fpm5m09",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588754845.0
    },
    {
        "author": "theduke9",
        "body": "&gt; ANET\n\nreasonable PE for tech company...",
        "created_utc": 1588873344,
        "id": "fpsh1r5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588902144.0
    },
    {
        "author": "yer_a_harry_wizard",
        "body": "These are just the brokerage account holdings. Got good mutual funds and etf’s in the retirement accounts. 28 y.o. Looking to maximize on near term and long term shifts due to RONA. Thanks for taking a look!\n\n\nAMZN- 8.91%\nANET- 1.94%\nAPPN- 0.98%\nCWBHF- 0.52%\nDDOG- 1.44%\nDIS- 8.84%\nDOCU- 2.16%\nFSLY- 4.54%\nJKHY- 3.13%\nMA- 5.09%\nMDB- 2.03%\nMELI- 1.77%\nMSFT- 9.67%\nOKTA- 6.50%\nPYPL- 8.69\nROKU- 1.65%\nSHOP- 1.65%\nTDOC- 6.56%\nTEAM- 2.07% \nTTD- 6.56%\nTWLO- 4.46%\nV- 5.43%\nZM- 9.12%",
        "created_utc": 1588897701,
        "id": "fptt2i0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588926501.0
    },
    {
        "author": "UmmDuhhh",
        "body": "Can anyone tell me how anet drops 10pts on a 30% earnings beet and BYND goes up 5 on a miss?  Seriously W T F...",
        "created_utc": 1588725409,
        "id": "fpm4jbq",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1588754209.0
    }
]