[
    {
        "author": "groommer",
        "body": "This is more haunting the the original zuck photo. ADBE calls?",
        "created_utc": 1595536462,
        "id": "fz0oblk",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1595565262.0
    },
    {
        "author": "C0r0naBallSackLord69",
        "body": "https://en.m.wikipedia.org/wiki/Snowflake_Inc.#:~:text=Website,two%20years%20in%20stealth%20mode.\n\nA rapidly growing cloud-based data-warehousing company. It has a number of unique advantages over data-storing in Google Cloud, AWS and MSFT Azure, one of which is cheaper prices and higher user availability. \n\nHas quite some well-known customers as well (e.g. Square, Adobe, Deliveroo). The stock will probably explode when it IPOs",
        "created_utc": 1595788759,
        "id": "fzbqv9j",
        "score": 20,
        "subreddit": "investing",
        "created": 1595817559.0
    },
    {
        "author": "ThatOneDrunkUncle",
        "body": "Apple buys Disney and AMD, Amazon buys the airlines, Macy's and AMC. Google buys hertz and makes them all waymo autonomous. Facebook buy Docu, Adobe, and Shopify. America is #1 again and the communists lose",
        "created_utc": 1596165139,
        "id": "fztozxi",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1596193939.0
    },
    {
        "author": "troylus81",
        "body": "VIX up 3% with all markets still green. I'm yelling Timber by 12PM. Loaded up on Adobe puts.",
        "created_utc": 1595429051,
        "id": "fyvk64f",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1595457851.0
    },
    {
        "author": "Lucky_Knight1",
        "body": "wish i bought any of these last week:\n\nAMD calls\n\nTSM calls\n\nINTC puts\n\nSLV calls\n\ninstead i bought ADBE and ABBV calls, which i broke even on  😩😩",
        "created_utc": 1595911970,
        "id": "fzhehjt",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1595940770.0
    },
    {
        "author": "4pooling",
        "body": "They don't mention the below because talking about dividends is a concept newer investors can gravitate towards. \n\nQualified dividends and long capital gains are both taxed at the same rate and neither is inherently better for passive income. You're mostly just trading one type of growth for another, but you may be less diversified if you just buy high dividend stocks or high dividend funds.\n\nAn important advantage of getting more of your returns in the form of capital gains is that you decide when to sell and take capital gains while you're forced to pay taxes frequently with dividends. High dividend funds are less tax-efficient because more of your return is being taxed along the way. \n\nBoth Andre and Joseph earn money from their YouTube ad revenue and other streams like Patreon so they can continue to be tax inefficient in their investment strategy. \n\nIt's just a bit surprising to willingly ignore some of the non-dividend payers like FB, AMZN, GOOGL, TSLA, ADBE, BRK.B, etc. \n\nThis is just another reason why both continue to underperform the S&amp;P 500 and the Nasdaq-100.",
        "created_utc": 1595437398,
        "id": "fyw12tw",
        "score": 8,
        "subreddit": "investing",
        "created": 1595466198.0
    },
    {
        "author": "stewart7795",
        "body": "Great post. Just buy the businesses you like that tend to win. All companies mentioned above you will not lose on in the long run. MSFT, GOOG, NFLX, AMZN, FB is probably all you need. LOL. NVDA, AMD, LRCX, MA, V, ADBE- you are not going to lose with those kind of companies. I'm not buying TSLA at $1,500. I thought I was rolling the dice at $1,000, which I never would have done without my $400-$500 shares. If they make money, lead their industries and are innovative then it's a good bet.",
        "created_utc": 1594518567,
        "id": "fxs82z8",
        "score": 6,
        "subreddit": "investing",
        "created": 1594547367.0
    },
    {
        "author": "MWigg",
        "body": "As someone who teaches at a Canadian university, I'm very uncertain about what companies will most likely see profit from the move online that haven't already. While I don't know enough to name actual stocks that may be of interest, I can point to some large product types.\n\nVideo conferencing (Zoom, Microsoft, Adobe) was obviously huge and continues to be, but I think most universities have already sorted out their solutions there, and may not change much. Learning Management Systems like Blackboard, Canvas, D2L, and Moodle (LMS) are also a huge chunk of it, but I'm not sure how much more growth these companies will be seeing. There is also going to be a lot of movement in normal software licenses for students to use remotely (think MS Office, Antidote, MatLab, SPSS, NViVo, etc).  \n\n\nOne that I keep hearing buzz about unis needing to buy is remote proctoring software services (such as Respondus or ExamSoft, or services built into an LMS (e.g Blackboard, Canvas). I don't know if any Canadian companies are in this space, or how many unis haven't already decided upon what they're using, but if you're interested in investing in online ed this may be a place to look.",
        "created_utc": 1595254178,
        "id": "fynrldg",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1595282978.0
    },
    {
        "author": "OGWFORLIFE",
        "body": "I’m never again fucking with low volume stocks like ADBE. Burn in fucking hell you piece of fucking shit.",
        "created_utc": 1595439726,
        "id": "fyw5zwn",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595468526.0
    },
    {
        "author": "za01",
        "body": "Some good blue chips to consider: \n\nWM, DIS, V, MA, ADBE, WMT, MCD",
        "created_utc": 1594169512,
        "id": "fx9k65d",
        "score": 5,
        "subreddit": "stocks",
        "created": 1594198312.0
    },
    {
        "author": "CharlieBrown364",
        "body": "First off, I think you are doing great! Keep hustling and saving and you’ll be able to retire earlier than most.\n\nIf you don’t know much about investing, you should definitely learn before investing any money. It is easy to lost your money if you aren’t careful. Youtube is a great place to learn. I like sending people to Andrei Jikh’s channel to learn how to invest. He is more focused on dividend stocks, while I think that growth stocks are better. Most people on YouTube aren’t too bad.\n\nI don’t know how much you should trust redditors (probably not at all), but if you do decide to, here is my opinion.\n\nI think for young people, growth stocks and ETFs are best. Here are some good stocks IMO.\n\nLarge/Mega Cap Growth Stocks: AMZN, MSFT, ADBE, LULU, NFLX, PYPL, MA, NVDA, TSLA (be careful w/ TSLA).\n\nSmall/Medium Cap Growth Stocks: LOGI, SQ, TTD, SE, LVGO, CHGG, NET, AMD.\n\nGrowth ETFs: QQQ, WCLD, QCLN, TAN, all of the ARK ETFs.\n\nIf you are OK with risk, Bitcoin could be an interesting buy, but don’t make it more than 10% of your portfolio and make sure you know if you actually own the Bitcoin.\n\nNote that this is my opinion. These are all growth stocks/ETFs, which carry more risk but pose a higher return. If you want something more safe, invest in SPY.\n\nMake sure to do your own DD (due diligence) and research to make sure you are OK with investing in a stock.\n\nMy absolute favorite stocks on this list are MSFT, ADBE, NVDA, TSLA, LOGI, SQ, and ARKK.",
        "created_utc": 1595906399,
        "id": "fzh65wl",
        "score": 5,
        "subreddit": "stocks",
        "created": 1595935199.0
    },
    {
        "author": "somanychins",
        "body": "Anyone know why MSFT seemed to lead the way down today? They were lagging from the open, and looked like the canary in the coal line along with ADBE.",
        "created_utc": 1594696763,
        "id": "fy01fl1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594725563.0
    },
    {
        "author": "CrimsonBrit",
        "body": "I'm not sure if I'll pull the trigger today, but here are some recent moves and moves I'm considering:\n\n* This morning I bought 20 shares of **Spotify ($SPOT)** @ $245/share after they posted a -6% share price yesterday. \n* Today, **Adobe ($ADBE)** is trading -5.5%, and is currently -10% since July 10th. This might be a decent buy-in opportunity to enter the cloud stock sector",
        "created_utc": 1594737155,
        "id": "fy1fme3",
        "score": 5,
        "subreddit": "stocks",
        "created": 1594765955.0
    },
    {
        "author": "CptGusMcCrae",
        "body": "ADBE has been so solid, every dip recovers immediately. Of course I buy the massive dip and it continues to tank for days for the first time in months",
        "created_utc": 1594897730,
        "id": "fy8pnt7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594926530.0
    },
    {
        "author": "abstract__art",
        "body": "\"Tech\" is:\n\n* Finance/Payments (Square, PayPal , Mastercard, Visa)\n* The entire internet in the first place: (Amazon, Microsoft, Google, semiconductors)\n* Retail (Amazon, Tesla, Shopify, Apple)\n* Entertainment (Amazon,Facebook,  Google, Spotify, Apple, Netflix)\n* Software (microsoft, amazon, salesforce, adobe, etc)\n\nTech basically means innovation and operating at scale.   All these businesses operate at scale by code and don't need armies of employees to operate at.  Any company that can operate at scale without manual human decision making is going to do well.\n\nEmploying people is a liability and expensive.",
        "created_utc": 1594233549,
        "id": "fxc94ja",
        "score": 4,
        "subreddit": "investing",
        "created": 1594262349.0
    },
    {
        "author": "ob-j",
        "body": "7/24 and 8/7 GLD spreads at 169/170... those might be fine\n\n\n7/31 ADBE 457.5/460\n\n7/31 EBAY 58/59\n\n\n7/31 PTON 60/61\n\n\n8/21 AMZN 2995/3000, AMZN 3240/3250\n\n\n8/28 LVGO 99/100\n\n8/28 ZM 270/275\n\n\nJan 2022 XLK $100C\n\n\n8/21 WMT 135c and 8/21 ATVI 85c",
        "created_utc": 1595193513,
        "id": "fylgdup",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595222313.0
    },
    {
        "author": "OGWFORLIFE",
        "body": "Any time I get in tech it acts like this. I’m really about to just sell ADBE and DOCU for $2800 loss.\nI get fucked by the biggest single day sell off since Covid been around now they come out with vaccine news and tech acts like a limp dick leaving me trapped in positions once again.",
        "created_utc": 1594821703,
        "id": "fy57uzk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594850503.0
    },
    {
        "author": "cptphoto",
        "body": "Looking at the Adobe chart today and I feel like 8/24 500c are free money.",
        "created_utc": 1594495946,
        "id": "fxqefpi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594524746.0
    },
    {
        "author": "ClevelandReaper216",
        "body": "I saw this shit too and made a note of it for DD tomorrow morning. They know something and I want in on it. I also got ADBE puts bc their C Suite looked to be selling completely out of their shares so that looked like some insider shit too.",
        "created_utc": 1596068609,
        "id": "fzofss3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596097409.0
    },
    {
        "author": "lowcas",
        "body": "Who got news on DOCU? NO way this is pumping randomly. Is CRM or ADBE acquiring it",
        "created_utc": 1593706846,
        "id": "fwpmhqm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593735646.0
    },
    {
        "author": "qwpajrty",
        "body": "What's the news on ADBE?",
        "created_utc": 1594665975,
        "id": "fxyfgef",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594694775.0
    },
    {
        "author": "cptphoto",
        "body": "Very concerned about not taking the 20-25% profit on Apple/adobe when I had the chance today.",
        "created_utc": 1594758766,
        "id": "fy2oa6e",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594787566.0
    },
    {
        "author": "CaptainBans",
        "body": "Is it safe to say that tech is much more diversified now than it was during the dot com bubble? I mean when I look at tech, I see AMD/NVIDIA, Microsoft, Apple, Facebook, Adobe, Amazon.... Some of these overlap a bit, but most of them are quite diversified not only in what they do, but also other companies that they own. Whereas the dot com bubble consisted literally of a bunch of websites.",
        "created_utc": 1595358365,
        "id": "fyslqgo",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595387165.0
    },
    {
        "author": "color_shot",
        "body": "Adobe calls look at technicals, growth, and chart history it will go up by next week",
        "created_utc": 1595599741,
        "id": "fz3b8c9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595628541.0
    },
    {
        "author": "CharlieBrown364",
        "body": "ARKW, SQ, LOGI, ADBE, MSFT",
        "created_utc": 1595907327,
        "id": "fzh7lzd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595936127.0
    },
    {
        "author": "bigwhite5294",
        "body": "Look into Adobe",
        "created_utc": 1595953962,
        "id": "fziz1f5",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1595982762.0
    },
    {
        "author": "AgentChester",
        "body": "I feel like ADBE will keep going up unless there is a market crash",
        "created_utc": 1594094266,
        "id": "fx67lak",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594123066.0
    },
    {
        "author": "newlife_newaccount",
        "body": "ADBE will continue to go up for the sole reason of spiting me for selling my 410 calls for a 10% gain.",
        "created_utc": 1594094619,
        "id": "fx683wi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594123419.0
    },
    {
        "author": "ob-j",
        "body": "Adobe you FUCKING cunt",
        "created_utc": 1594819221,
        "id": "fy53keq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594848021.0
    },
    {
        "author": "ron_sterling",
        "body": "Lol everything has run up too much. Sq, PayPal, tesla, Nvidia, Adobe, baba...",
        "created_utc": 1594237515,
        "id": "fxchk2d",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594266315.0
    },
    {
        "author": "hhsebastian",
        "body": "TWS - the desktop app definitely is kind of overwhelming at the beginning, has a learning curve,  but there are plenty of videos on YouTube.\nIn my opinion, the mobile app is ok or even good for trading simple strategies or even buy and hold. \n I like to compare it with adobe photoshop, it’s a hell of a tool, but at the beginning, a bit too much :)",
        "created_utc": 1595163049,
        "id": "fyjyi9x",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595191849.0
    },
    {
        "author": "stockmarketfeed",
        "body": "I think Docusign is still a good long play, but they have many more competitors than just Adobe. I use 3 different types of digital signature software for work alone (software development) and we usually go with the cheaper digital signature providers without hesitation. \n\nI sat in contract renewals where the Docusign CEO was present and spoke, and I think the leadership is good (mostly why I still think it’s a good long play), but their competitors are catching up fast. Plus, digital signature software is becoming much more common and it’s only a matter of time until Microsoft has a mass-audience digital signature solution of their own, so I would invest in Docusign now while they still have good momentum.",
        "created_utc": 1595480227,
        "id": "fyy8ucv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595509027.0
    },
    {
        "author": "ob-j",
        "body": "lmao what, my ADBE spreads aren't fucked either? Dude...",
        "created_utc": 1595287184,
        "id": "fyplrze",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595315984.0
    },
    {
        "author": "OGWFORLIFE",
        "body": "I’m selling my ADBE and hopefully MSFT tomorrow. Still gotta hold my PYPL and DOCU calls. I don’t trust this sht lol",
        "created_utc": 1595296699,
        "id": "fyq2dls",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595325499.0
    },
    {
        "author": "DarkMatter917",
        "body": "Lines on charts\nCalls: MSFT AAPL SPY BABA MA\nPuts: AMD NVDA BA ADBE",
        "created_utc": 1595856407,
        "id": "fzegz32",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595885207.0
    },
    {
        "author": "CharlieBrown364",
        "body": "SPACs: GR-AF (VeIo-dyne), SH-LL (Hy-llion)\n\nSmall/Mid cap growth: TDOC, LVGO, SQ, SE, TTD, CHGG, LOGI, PTON, DOCU\n\nMy favorites: SQ, LOGI\n\nLarge/Mega cap growth: NVDA, ADBE, PYPL, POOL, MA, TSLA, MSFT, AMZN\n\nMy favorites: NVDA, TSLA, MSFT",
        "created_utc": 1596235517,
        "id": "fzxdnin",
        "score": 3,
        "subreddit": "stocks",
        "created": 1596264317.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Shopify PayPal CrowdStrike NVIDIA Apple QCOM Adobe",
        "created_utc": 1593731653,
        "id": "fwr14x9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1593760453.0
    },
    {
        "author": "Droidvoid",
        "body": "ADBE",
        "created_utc": 1594691031,
        "id": "fxzrwwi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594719831.0
    },
    {
        "author": "XorAndNot",
        "body": "Just because you need them, doesn't make them good companied. Gotta look at their renevues, cash flow, debt, net income...\n\nEdit: AVLR, UPWK and SHOP aren't even profitable right now, nobody can tell if they'll ever be. ADBE and PYPL are fine.",
        "created_utc": 1596074810,
        "id": "fzoqzu5",
        "score": 3,
        "subreddit": "investing",
        "created": 1596103610.0
    },
    {
        "author": "shuttdown700",
        "body": "Adobe. PayPal and SQ have too much small business exposure. Plus they don’t really have a moat. Lots of competitors or future competitors. Everything adobe offers is exclusively adobe.",
        "created_utc": 1593737919,
        "id": "fwrbspr",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593766719.0
    },
    {
        "author": "shuttdown700",
        "body": "PYPL and SQ don’t have the moat that ADBE has.",
        "created_utc": 1594093486,
        "id": "fx66f74",
        "score": 2,
        "subreddit": "investing",
        "created": 1594122286.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "$ADBE if Gen X,\n$DIS If boomer,\n$NKLA if you’re an idiot",
        "created_utc": 1594139040,
        "id": "fx7v964",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594167840.0
    },
    {
        "author": "MarketOracle",
        "body": "I follow tech stocks, but don't have any positions with Netflix. Creating content for streaming is expensive, so I prefer software companies (Adobe and Microsoft) where you write code once, distribute infinitely.",
        "created_utc": 1594952460,
        "id": "fybilab",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594981260.0
    },
    {
        "author": "mrredbeardman",
        "body": "I’m definitely not essential we were just able to work from home. I’m currently yolo’ing msft calls hoping to make enough to start gambling on Apple and Adobe soon too.",
        "created_utc": 1594958026,
        "id": "fybr9w5",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594986826.0
    },
    {
        "author": "bcuzofdaimplication",
        "body": "Riding ADBE calls 480 7/17",
        "created_utc": 1594586839,
        "id": "fxv41lk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594615639.0
    },
    {
        "author": "proctu",
        "body": "$XLK is pure tech. The largest holdings are $AAPL and $MSFT combined at 40%. Followed by $PYPL $MA $V $ADBE $CRM to name the other notable holdings. \n\n$QQQ is not exactly pure tech like most think. It is mostly \"tech\" but it also has names like $FB which fall under communications. \"Tech\" only makes up about 60% of the Qs. \n\nAs for as an etf for these young companies check out the Arkweb actively managed ETF's. The portfolio manager, Cathy Wood, has been on fire over the past few years $ARKW $ARKK. You defiantly wont find any \"boomer garbage\" there.",
        "created_utc": 1594330359,
        "id": "fxgsm2a",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594359159.0
    },
    {
        "author": "somanychins",
        "body": "Get $40k and do ADBE covered calls",
        "created_utc": 1594783108,
        "id": "fy3wajx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594811908.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "I did not notice ADBE go ham today. wowzers",
        "created_utc": 1595312920,
        "id": "fyqpry9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595341720.0
    },
    {
        "author": "kyle_io",
        "body": "It may also be worth looking at this from another angle. You've already shown an interest in some diversification, given your broad accumulation of tech stocks rather than betting on an individual one. And you list an interest in additional companies, 2 payment / financials and 3 healthcare related.\n\nA lot of the focus on long term investing is based on the minimization of downside. Ex: Suppose one company from your list of 7 tech stocks got banned from a country (we're seeing the beginnings of this with Huawei, likely expect some retaliation). How exposed are you to that negative news?\n\nBy constructing your own collection of 7+ tech stocks, you'll end up re-creating your own mini diversified ETF. By adding additional sectors into your investment portfolio, you're diversifying your risk from one sector into multiple. The end result is an actively managed portfolio where you do all the work. If you value your time / energy spent on managing stocks in this portfolio, you're effectively paying a fee for this actively managed portfolio. At the very least, you're spending your free time.\n\nSuppose you want to focus on a tech-heavy portfolio, but from a less actively managed standpoint. You can pick up an etf, like VGT for example, that focuses on just the tech sector. From the top asset holdings as of 6/30, that etf holds AAPL, MSFT, V, M, INTC, NVDA, Adobe, Cisco, Paypal, Salesforce with roughly 60% of it's assets. This is actually pretty well aligned with your current collection of stocks. There are individual sector ETFs, dividend growth ETFs, disruptive tech ETFs, and broad market ETFs. It's important to recognize when the collection of stocks you end up with actually aligns with a broader index. Arguably your current portfolio and intended direction seems like 40% VGT and 30% VHT. If later you want to add exposure to other parts of the economy, you might end up with a mix of multiple individual sector ETFs, which might end up having significant overlap with the S&amp;P500 or VTI (total market ETF). A long road to end up at a broad market ETF.\n\nThe important thing about ETFs that track benchmarks / indices is that the index is a moving target. Right now there are discussions about TSLA being included in the S&amp;P 500, which would kick some other company out. All the S&amp;P index tracking funds would adjust to this new definition of the index, and all passive investors would then be exposed to TSLA. This is true for many of the index tracking funds, the index definition can change and the funds change to reflect that.\n\nIn trying to outperform an index, you're making a bet that you can pick stocks that do better than the continually evolving indices that track economic growth of various sectors. It's always worth evaluating whether you can outperform the 7-9% long term avg the S&amp;P500 returns, and how much effort it takes for you to do that. By spending a lot of time and effort on stocks, you're spending time trying to improve performance on current savings. Your time could also be spent acquiring skills to increase your earning potential, increasing future savings.\n\nTL;DR: Upgrade your portfolio to sector ETFs, eventually to VTI.",
        "created_utc": 1595197606,
        "id": "fylnvo7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595226406.0
    },
    {
        "author": "Shaun8030",
        "body": "Shop , tesla , amazon , square , MSFT, adobe  , amd  killed it today . IBM is killing it after hours earnings.",
        "created_utc": 1595284368,
        "id": "fypgali",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1595313168.0
    },
    {
        "author": "TheArcticBoss",
        "body": "I don't have stock but have made significant returns on calls and will continue to add until earnings. Will definitely see $240 by that time. \n\nI'm in several different industries incl. RE and we've all since switched to using Docusign, so much so that it's become a verb. There are other platforms we could use like SignNow, Adobe, HelloSign, etc. but hands down, Docusign currently brings the most confidence with our specific contract partners and in securing sales. The implementation is very smooth and like everyone else, they hook you with the free trial.",
        "created_utc": 1595494685,
        "id": "fyyohxg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595523485.0
    },
    {
        "author": "OGWFORLIFE",
        "body": "ADBE is the most pathetic stock I’ve ever fucking seen.",
        "created_utc": 1595343058,
        "id": "fyrqi9f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595371858.0
    },
    {
        "author": "shuttdown700",
        "body": "ADBE is innovative and grounded. They know what they are about and have great leadership. They have a sustainable growth platform with their creative cloud and enterprise products, while sustaining a large free cashflow (largely due to their high profit margin) that enables strong investment in new growth sectors, as well as future buybacks. I view ADBE the same way I view MA: a strong and stable company with plenty of road ahead of it to grow and build itself into a huge market share holder.",
        "created_utc": 1595709107,
        "id": "fz8dsyt",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595737907.0
    },
    {
        "author": "saibaba90",
        "body": "I like ADBE, great choice!",
        "created_utc": 1595094655,
        "id": "fyhbybl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595123455.0
    },
    {
        "author": "_FinalPantasy_",
        "body": "Acquisio, Kenshoo, Adobe Advertising Cloud, Smartly.io, madgicx, QuanticMind, Adzooma, Adalysis, Optmyzr.\n\nWhat I'm saying is that unless Marin comes out with some sort of turn shit into gold campaign automation platform, I don't think their price will go anywhere, and social campaign pacing tools have been around since 2015. It's not going to pull a Kodak with this PR and I doubt it will move at all.",
        "created_utc": 1596152245,
        "id": "fzsz69m",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1596181045.0
    },
    {
        "author": "thestrandedmoose",
        "body": "A couple things:\n\n1. Everyone is locked up at home so Amazon or grocery stores are your only method of shopping\n2. Amazon has a web services division called AWS which powers a huge amount of businesses cloud infrastructure. Netflix, Facebook, Twitch, Adobe, Twitter, GE, AirBnB, even Apple all run on AWS and pretty much a lot of the apps you use likely run on either AWS, Microsoft, or Google. The virus has hugely boosted the amount of time/money people use on these services, especially Netflix, so every minute you are on netflix is more money that Amazon is making.\n\nIn 2-3 years we'll likely be seeing a $4000 value. In fact, Amazon says it is poised to hit that number easily",
        "created_utc": 1594074551,
        "id": "fx59xw1",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594103351.0
    },
    {
        "author": "OGWFORLIFE",
        "body": "I want to play ADBE so badddddd but if we red tomorrow I will be salty.",
        "created_utc": 1594664358,
        "id": "fxyc1ho",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594693158.0
    },
    {
        "author": "FreeSpiritRunning",
        "body": "Yeah, Docusign is definitely not flying under the radar.\n\nI hold positions in the company.\n\nI like them.\n\nI dont $200 like them.\n\nTheyre overvalued at a $36b market cap and a PEG of -210M, but what doesn't look like that in COVID-world?\n\nRealistic value IMHO, maybe $100 at best, but more honest probably down in the 75-80 range. Future growth? Absolutely. I wouldnt be surprised if they get bought out by someone like Adobe in the next 5-10 years since they pretty much have the market cornered as the standard.\n\nEnter positions at your own risk, its a great company on a huge bubble. Its taking huge daily swing right now so just keep an eye on it if you want to position.",
        "created_utc": 1594144179,
        "id": "fx862b9",
        "score": 2,
        "subreddit": "investing",
        "created": 1594172979.0
    },
    {
        "author": "catarahbpus",
        "body": "Yes trade off at least a portion of nio (if you double your return cut half) for something like MSFT, ADBE and even cut ATVI it's back around to all time high in the 80's. But I wouldn't make it to drastic, keep around 5% and use the 2.7% to help put towards TSLA, AMZN, MSFT, ADBE a larger tech play that will be safe through covid or without it.",
        "created_utc": 1594501614,
        "id": "fxr1pwt",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594530414.0
    },
    {
        "author": "Great_Chairman_Mao",
        "body": "Kinda newb here, so for ADBE covered calls, I'd buy 100 stocks, and then buy calls or sell calls?",
        "created_utc": 1594873684,
        "id": "fy7zjvv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594902484.0
    },
    {
        "author": "LoveNewton_Nibbler",
        "body": "I work in HVAC and think Daikin is overrated. IMO you wanna be looking at Trane Technologies or a manufacturer of fiberless insulation material for long term. Trane seems to be buying up a bunch of product lines and we've seen them manage to monopolize entire jobs (full floor tenant fit outs) because they will be specified for the actual AC units then also the controls for the entire floor, thus making it impossible to use anyone else. We currently use fiberglass insulation on the interior of ductwork on most jobs as is usually the mimimum requirement. I've been seeing more requests for the fiberless insulation since COVID started. The fiberless (Armaflex) lining is better long term, does not break down as easily as fiberglass and can be cleaned easier. Complement play: Adobe. Their PDF reader makes my life insanely easier",
        "created_utc": 1594920441,
        "id": "fy9tebp",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594949241.0
    },
    {
        "author": "PlusUltra-san",
        "body": "If you want to see it from a different perspective.\n\nTSLA ($257bn) is larger than any of these companies:\n\nMcDonalds ($138bn)\n\nDisney ($206bn)\n\nNvidia ($249bn)\n\nTwitter ($28bn)\n\nNetflix ($220bn)\n\nIntel ($246bn)\n\nCoca Cola ($192bn)\n\nNike ($152bn)\n\nPepsi ($185bn)\n\nStarbucks ($85bn)\n\nSquare ($58bn)\n\nAdobe ($219bn)",
        "created_utc": 1594228984,
        "id": "fxbz9fz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594257784.0
    },
    {
        "author": "CDS_2008",
        "body": "Nivida is my favorite of the 3 and here's why: \n\nAdobe: Debt/Equity(&lt;0.5) is nice and if I just looked at that then I would say Adobe but the current ratio is very close to 1 and debt has been rising over the past 10 years. Margins along with ROA/ROE are beautiful but a company can't go bankrupt by having too little debt and although it is nothing to sell over I always try to be as pessimistic as possible before I buy because the emotional scale tends to shift once you've purchased an asset.\n\nSalesforce: As with Adobe, Debt/Equity is low but the current ratio is also low.  Profits are worse with Salesforce with operating margins decreasing since 2018. As of 4/30/20 the Operating Margin is around -0.2%. ROA and ROE are both negative and have been decreasing since 2018 like Operating Margin. Also, Salesforce has had an unpredictable EPS. I like to see a line with a 45 degree angle but Salesforce has been wildly fluctuating since 2006. \n\nNividia: Debt/Equity is low (less than 1) but recently it went from roughly 0.20 to 0.5 which is because of a nearly 200% increase in debt from Q1 to Q2 2020. However, even though the Debt/Equity has gone up in the past quarter the current ratio is MUCH higher (10) than Salesforce or Adobe. Also, unlike Salesforce, Nivida has beautiful Operating Margins (26%) as well as ROA (18%) and ROE (28%) like Adobe. Finally, EPS and Free Cash Flow is a lot more predictable and is what I like to see. As a cherry on top, insiders own roughly 4% which is always great to see.",
        "created_utc": 1595125781,
        "id": "fyit72x",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1595154581.0
    },
    {
        "author": "OGWFORLIFE",
        "body": "Trading day #8 holding tech calls that do absolutely fucking nothing. Anytime I’m in tech and holding a position it does this. 8/20 is when it’ll probably go up. That’s when my ADBE calls expire. If not 8/20 then 9/18 is the next time tech will go up. My contracts will have to expire or I will have to sell for a loss before we see any movement.",
        "created_utc": 1595430776,
        "id": "fyvnjkr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595459576.0
    },
    {
        "author": "graciewonder",
        "body": "Not if you know the potential growth. They offer what Adobe doesn't, which is it's main competitor. Speaking of too much....",
        "created_utc": 1595479310,
        "id": "fyy7nir",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595508110.0
    },
    {
        "author": "bumblebear3012",
        "body": "Adobe, Akamai, Square, Doordash are among the clients and there are some pretty talented developers and data scientists at those companies. \n\nPlus AWS, Azure, and Google Cloud aren’t synced with Salesforce data. Companies are increasingly looking to avoid over-reliance on a single cloud vendor. \n\nThose factors, combined with the extremely flexible pricing, provide enough of a need for their 2000 enterprise customers by the looks of it.",
        "created_utc": 1595654361,
        "id": "fz652ft",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595683161.0
    },
    {
        "author": "long_AMZN",
        "body": "haha I wish I was long AMZN from the day I created my account... I sold all my calls on tuesday at open and converted into shares. Holding:\n\nBanks: JPM, GS\n\nTech: ADBE, FB\n\nRetail: FTCH\n\nTourism: MAR, IAG (british airways)\n\nOil: BP",
        "created_utc": 1595655272,
        "id": "fz6673d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595684072.0
    },
    {
        "author": "gamesdf",
        "body": "ADBE. Look at their revenue growth rate for the past 10 yrs. Same goes for net income and free cash flow. They cant be stopped. They are the leader in the industry they are in. No real competitions yet. NOW just started getting + earnings.. So It might be a good time to invest in it if you truly believe in the company. But its price at the moment cant be justified..",
        "created_utc": 1595701331,
        "id": "fz7v2l1",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595730131.0
    },
    {
        "author": "GnarlyPounderWoo",
        "body": "Just sell before earnings, and roll back in after IV has died if you like ADBE.",
        "created_utc": 1595364026,
        "id": "fysxknh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595392826.0
    },
    {
        "author": "lucidvein",
        "body": "Not too shabby OP.  I have all of those except Coca Cola, Pepsi, and McDonalds since most of their stuff is based on unhealthy products even w/ their market penetration I'm not convinced society is heading in that direction.\n\nI can post my top 20 holdings for you.  I've been lucky enough to typically beat the S&amp;P.  40% of my portfolio are in mutual funds but my individual picks are:\n\n1. Amazon: 6.6% - #1 Ecommerce subscription \\[moat\\], hardware, twitch, ecosystem\n2. Johnson and Johnson: 6% - #1 Pharma giant\n3. Next Era Energy: 5.8% - Moated energy utility in SE USA, going 20% solar too soon\n4. Google: 5.0% - #1 Search engine, Data monster, Youtube, Invests in SpaceX etc.\n5. Gold: 5% - Hedge\n6. Intel: 4.6% - Chipset King.  Might dip w/ AMD on rise.\n7. Cadence Design: 4% - Electronic Design Automation\n8. Apple: 3.7% - World class phone maker, ecosystem, cult following w/ services\n9. Microsoft: 3.4% - Azure, Office Suite, Windows, Solid\n10. Lockheed Martin: 3.4% - Defense spending won't be going away. Industry leader.\n11. Illumina: 3% - Genetic Analysis, human health advancement\n12. Wheaton Precious Metals: 2.8% - Favorite precious metals miner\n13. United Health Group: 2.8% - Industry leader in Health Insurance\n14. Waste Management: 2.6% - Garbage isn't going to go away anytime soon\n15. Market Axcess: 2.5% -  Electronic trading platform for bonds/fixed income\n16. Disney: 2.3% - Media &amp; entertainment giant\n17. Nvidia 1.8% - #1 video card company, gaming, business visualization, solid AI r&amp;d\n18. Raytheon: 1.5% - More Defense\n19. Visa: 1.4% - Fintech &amp; market penetration\n20. Adobe: 1.4% - Subscription service for top graphic suite\n21. Crispr: 1.1% - Genetic Editing R&amp;D and interesting possibilities\n\nSome other stocks I own and don't mind recommending are HD, LULU, BLK, SPCE (can't fight the memes), Alibaba, Tencent, Qdel, Fortinet, Berkshire, Paypal, Texas Instruments, Qcom, some beat down covid stocks like RCL &amp; Boeing.",
        "created_utc": 1595027757,
        "id": "fyetcay",
        "score": 2,
        "subreddit": "investing",
        "created": 1595056557.0
    },
    {
        "author": "Shaun8030",
        "body": "Agree but I would add some software , semis and fintech if you have the risk tolerance ie Adobe , Nvidia , v, ma , sq and PayPal.",
        "created_utc": 1594722029,
        "id": "fy0ug8b",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1594750829.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Adobe cancels all political ads on their digital platforms, says they will help all political clients migrate to other platforms.\n\n\nBasically PR to let people know that Adobe has a digital ads offering",
        "created_utc": 1596227017,
        "id": "fzwpjuh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596255817.0
    },
    {
        "author": "tmssqtch",
        "body": "And in 2030, you’ll get great deals like AMZN 5700, TSLA 3500, ADBE 650",
        "created_utc": 1596210713,
        "id": "fzvkoen",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596239513.0
    },
    {
        "author": "JE163",
        "body": "They are the industry leader and no one else comes close in terms of market share. I think someone like MS or adobe would buy them out to strengthen their product portfolios if it came to it.",
        "created_utc": 1593742372,
        "id": "fwriyrw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593771172.0
    },
    {
        "author": "Babyfreezer",
        "body": "I have a high risk tolerance and plan to FIRE in 16 years which is my investing timeframe. This is my portfolio, what do you think of it?\n\nPension: 100% US equities\nTax saving account:\n\nHold forever:\n\nTesla 25%, Amazon 15%, Microsoft 10%\n\nHold long:\n\nAMD 10%, Nividia 10% , Adobe 10%\n\nSpeculation:\n\nSquare 5%, Shopify 5%\n\nValue:\n\nBoeing 5%, United/American Airlines 5%",
        "created_utc": 1594065695,
        "id": "fx4s323",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594094495.0
    },
    {
        "author": "vansterdam_city",
        "body": "But ADBE has largely burned out their growth opportunities. At this point, everyone has converted from the old license model to the new subscription model.\n\nADBE can't keep trading like a tech/growth stock. It grew revenues 14% compared to SQ at 44%, its not even close anymore.\n\nThey had a good run but IMO the parabolics are coming to an end.",
        "created_utc": 1594096401,
        "id": "fx6aocw",
        "score": 2,
        "subreddit": "investing",
        "created": 1594125201.0
    },
    {
        "author": "shadybounce",
        "body": "I bought adobe and Docu when they were down lol. Then they just went down wayyy more! Love it! Guess I’m holding till expiration",
        "created_utc": 1594673348,
        "id": "fxyuyw4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594702148.0
    },
    {
        "author": "tinderdrunkman101",
        "body": "If you look at ADBE chart ud think another coronovirus happened, what a joke lmao",
        "created_utc": 1594735325,
        "id": "fy1cagg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594764125.0
    },
    {
        "author": "WobeTryant",
        "body": "Every website I went to made sure to emphasize the “potential for massive loss” but don’t list out that people are trading options on margin or selling options to finance other moves. At the beginning I thought I was on the hook for 100 shares of Adobe at like $415 a pop because nobody could define who is at risk for assignment if I sell one that I purchased. Newbies should always start with stocks they like and are willing to research on and then make one move at a time",
        "created_utc": 1594877244,
        "id": "fy84cro",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1594906044.0
    },
    {
        "author": "icydash",
        "body": "Why did all of the software stocks (adobe, netflix, wix, fastly, etsy, cloudflare, upwork, fiverr, etc) start dumping on Monday?  It seems like they all should be the beneficiaries of Coronavirus, yet they have tanked in the last 4 days.  Lost a lot of money.",
        "created_utc": 1594934519,
        "id": "fyamndd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594963319.0
    },
    {
        "author": "UniverseChamp",
        "body": "Fucking ADBE",
        "created_utc": 1595036427,
        "id": "fyf7s3q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595065227.0
    },
    {
        "author": "slamdunktiger86",
        "body": "Hi Op, I only train vertical spreads momentum stocks. I have a few basic scanners and it’s the same repeat offenders to I keep trading: AMazon, Adobe, Microsoft, Tesla, DocuSign, etc.\n\nLosers include: casinos, reits\n\nLoser honorable mentions include: airlines, banks —these are weird at times though, less inclined to trade these as they have their own micro climate that’s permanently fiending for government money. unless vol is extremely rich of course \n\nI sell weeklies, put or call verticals around one sigma out, 85-90% prob OTM at expiration. Generally these are 40-80 vol underlyings.\n\nI have 30-60% of my total bankroll in play, generally. \n\nI confirm my selection criteria with $ inflows through OnBalanceVolume and a reduced ATR. \n\nI have a 85% win rate on bullish underlyings and 60% on bearish underlyings.\n\nI row oars in both sides to keep my beta weighted net delta at zero of slightly negative as I’m expecting a long sustained downturn.",
        "created_utc": 1594522255,
        "id": "fxsgg3b",
        "score": 2,
        "subreddit": "options",
        "created": 1594551055.0
    },
    {
        "author": "cptphoto",
        "body": "SPY, ADBE, AG, BNTX, SPCE and a couple others.  Getting roasted today.",
        "created_utc": 1595537090,
        "id": "fz0pmh2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595565890.0
    },
    {
        "author": "DarkMatter917",
        "body": "Adobe did that to me",
        "created_utc": 1595858382,
        "id": "fzekdd9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595887182.0
    },
    {
        "author": "somanychins",
        "body": "ADBE has been crushing.",
        "created_utc": 1595655329,
        "id": "fz669kv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595684129.0
    },
    {
        "author": "Coffeewin",
        "body": "[Theta gang gains for the day.](http://imgur.com/a/bFypcEq) All PCS positions with +550 passive daily theta, anyone have recommendations for non-meme tickers with high IVP? Currently looking to sell PCS on DOCU and ADBE",
        "created_utc": 1595293380,
        "id": "fypwogp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595322180.0
    },
    {
        "author": "color_shot",
        "body": "Its only profitable at **expiration** when it hits the strike price. \n\n\n  *Example*\n\n  I can buy an Adobe 460C for 3.00.  (Stock price 450.00)\n\n  2 hours later, Adobe's stock price is 455.00. \n The call is now 6.00, and I can sell it to make 300$. \n\nIt never hit the strike price yet I still made money.",
        "created_utc": 1595291794,
        "id": "fyptyg5",
        "score": 2,
        "subreddit": "options",
        "created": 1595320594.0
    },
    {
        "author": "roufathome",
        "body": "Disruptive doesnt mean some  cool unknown trending tech company. Conventional companies can be disruptive too. \nARKW holds stuff like AMZN  AAPL FB TCEHY BABA ADBE NVDA....\n\nThey have become the latest fad with their tsla holdings and predictions, which to date has held up well. Its is like 10% of the portfolio. (I have come across people thinking its upto 80%)\n\nMoreover their 25%+ yearly performance dates back to 2015 (inception). Long before tsla became any fad. (Idk if they held tesla back then, being actively managed). \n\nBut yeah, a downward movement is possible. Just like any other funds.",
        "created_utc": 1595219887,
        "id": "fymnwmr",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595248687.0
    },
    {
        "author": "illmakeagoodlife",
        "body": "i’ve been holding onto adobe shares for years so this is good to know. thank you!!!",
        "created_utc": 1596069274,
        "id": "fzoh0r5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596098074.0
    },
    {
        "author": "Brap_Rotatoe",
        "body": "What's your tools and process like? Do we go long ADBE? Do you use After Effects and then Premiere Pro? Vice-versa?",
        "created_utc": 1595954715,
        "id": "fzj0lps",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595983515.0
    },
    {
        "author": "CodyTG",
        "body": "ADBE up $7",
        "created_utc": 1594041043,
        "id": "fx3ggpn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594069843.0
    },
    {
        "author": "If_it_fits_yourcycle",
        "body": "Yes that's probably true. Do you know a good combination of ETFs for the stocks that I wrote? My problem with qqq is that it has Intel and Adobe among others that I want to avoid. That's where this whole idea comes from with the fractional shares. I feel like I'm creating my own etf. But maybe that's dumb from a risk and fee standpoint? I do want some type of overweight in some of them, maybe I could just supplement the ETFs with stocks/fractional buys?",
        "created_utc": 1594046459,
        "id": "fx3pl8i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594075259.0
    },
    {
        "author": "Babyfreezer",
        "body": "I have a high risk tolerance and plan to FIRE in 16 years which is my investing timeframe. This is my portfolio, what do you think of it?\n\nPension: 100% US equities\nTax saving account:\n\nHold forever:\n\nTesla 25%, Amazon 15%, Microsoft 10%\n\nHold long:\n\nAMD 10%, Nividia 10% , Adobe 10%\n\nSpeculation:\n\nSquare 5%, Shopify 5%\n\nValue:\n\nBoeing 5%, United/American Airlines 5%",
        "created_utc": 1594065456,
        "id": "fx4rl7p",
        "score": 1,
        "subreddit": "investing",
        "created": 1594094256.0
    },
    {
        "author": "ExcelMD",
        "body": "JPOWs risen from his Fourth hangover and was spotted online.  I believe his score foreshadows the NASDAQ in one month’s time. With rising COVID and advertisers dumping FB, I’m back at it tomorrow with ADBE 550c (8/7) and FB 295c (8/7).",
        "created_utc": 1593996435,
        "id": "fx1wvis",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594025235.0
    },
    {
        "author": "pspahn",
        "body": "And it wasn't that long ago when it was the gold standard for e-commerce development. Shopify likely owes their recent success to Adobe getting their greedy little paws on Magento and turning it into a fucking heap of garbage and driving away development talent.\n\nAs it stands now, there really isn't a new framework/platform that stands out that does what Magento 1.x did that takes into account the many development advances that have happened since it was first released. Magento 2 tried, but it was still a heaping pile of PHP garbage.\n\nShopify will end up no different than Magento. It will be hot shit for awhile but the inherent weaknesses will be ignored until someone else comes along and provides a superior product. Fuck, maybe it will be Magento once the stigma of being owned by Adobe wears off.",
        "created_utc": 1593996349,
        "id": "fx1wqb6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594025149.0
    },
    {
        "author": "Shaun8030",
        "body": "ETFs - ARKW  and WCLD \nStocks - Nvidia , PayPal , Adobe and Square preferably on a dip",
        "created_utc": 1593654222,
        "id": "fwnfl32",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1593683022.0
    },
    {
        "author": "ClearVisibility",
        "body": "You have solid cloud stocks: Amazon, Google, Microsoft, Adobe. And you have speculative stocks like those you listed. People are jumping in now hoping it could be the next big thing.",
        "created_utc": 1593687303,
        "id": "fwolc73",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593716103.0
    },
    {
        "author": "Shaun8030",
        "body": "Apple , amazon ,MSFT , GOOG , Nvidia, V , Ma , sq , adobe , PayPal , ARKW , WCLD , VGT , IGV , XNTK , FDN , Soxx , QQQ, XIT",
        "created_utc": 1594172321,
        "id": "fx9ow9w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594201121.0
    },
    {
        "author": "CantStopWatchingVids",
        "body": "WLMT\nSPOT\nROKU\nNET\nDIS\nADBE\nNVDA\nPDD\nPYPL\nREGN\n\nYou’re welcome",
        "created_utc": 1594162962,
        "id": "fx98j8s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594191762.0
    },
    {
        "author": "malloun123",
        "body": "Anyone playing SQ or ADBE?",
        "created_utc": 1594127112,
        "id": "fx799lk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594155912.0
    }
]