[
    {
        "author": "AoeDreaMEr",
        "body": "That’s a great read. I am a packaging engineer and I loved reading this. As you said, Intel isn’t out of the game yet. But if they don’t get their shit together in next couple of years, they will be the next IBM.",
        "created_utc": 1600179303,
        "id": "g5cuxpx",
        "permalink": "/r/stocks/comments/it7nbn/packaging_deep_dive_the_new_battleground_between/g5cuxpx/",
        "score": 88,
        "subreddit": "stocks",
        "created": 1600208103.0
    },
    {
        "author": "adayofjoy",
        "body": "It's not specifically tech stocks that are inflated faster, but growth stocks. Low PE ratio tech stocks such as Intel, Cisco and IBM are still sitting at depressed levels.",
        "created_utc": 1600572658,
        "id": "g5x4558",
        "permalink": "/r/investing/comments/iw6f89/why_do_low_interest_rates_have_a_more_pronounced/g5x4558/",
        "score": 77,
        "subreddit": "investing",
        "created": 1600601458.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "Nope, far more than that.  \n  \nThe bulk of their revenues come from solar panel installations at Trevor's house. So they are in the energy sector.  \n  \nThey also do the best in class CGI.  \n  \nThey probably might rival Intel, IBM, AMD, NVDA, etc in making HTML5 supercomputers in the future.  \n  \nPlus, their valuation is in the clouds. So they can be a cloud play too.  \n  \nAnd they come under GaaS too. Gravity-As-A-Service.",
        "created_utc": 1600300473,
        "id": "g5j1ub2",
        "permalink": "/r/wallstreetbets/comments/iu7i10/is_nikola_really_just_an_oversized_pinewood_derby/g5j1ub2/",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1600329273.0
    },
    {
        "author": "General-Maintenance",
        "body": "Even more boomer than IBM. Wtf",
        "created_utc": 1600049587,
        "id": "g56wwnr",
        "permalink": "/r/wallstreetbets/comments/is95c6/microsoft_bid_rejected_by_tiktok/g56wwnr/",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1600078387.0
    },
    {
        "author": "ShoulderFalse",
        "body": "They bought all those datacenters for the Oracle cloud that absolutely nobody uses. TikTok is nothing more than a chance for them to show they can still run something at scale that is public facing in order to try and stay somewhat technologically relevant while getting some bonus marketing along the way.\n\nOutside of legacy OracleDB stuff, there is zero reason for a company to use Oracle these days. They would be better served by VMware if they're trying to shake hands with a big enterprisey, hybrid cloud kind of place. Oracle has been proving they're IBM 2.0 in that if you partner with them to do something, it'll come in over budget and half baked. It's kind of incredible tbh.\n\nThe problem is going to be that big O didn't get TikTok's recommendation system, so they get to figure out a new one. I would bet good money they fuck it up and tank the platform.",
        "created_utc": 1600061000,
        "id": "g57djhx",
        "permalink": "/r/investing/comments/is9f4j/microsoft_drops_out_of_bidding_for_tiktoks_us/g57djhx/",
        "score": 40,
        "subreddit": "investing",
        "created": 1600089800.0
    },
    {
        "author": "navyguy666",
        "body": "IBM is considered a joke within the IT industry nowadays",
        "created_utc": 1600557861,
        "id": "g5vsfem",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5vsfem/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1600586661.0
    },
    {
        "author": "AnonymousAstro",
        "body": "I sold a naked 9/4 $410c at close as a part of a strangle because an “$85 move up in a day is impossible”. I sold it for $70 and ate a $2800 loss this morning.\n\n**One big lesson learned:** people will buy up everything and try to make it the new TSLA. ZM has EPS of $.92 and a current P/E ratio of $1700ish. It’s now worth more than IBM.\n\nAs long as “stonks go up”, I’ll stick to selling puts only.",
        "created_utc": 1598993396,
        "id": "g3n27ob",
        "permalink": "/r/options/comments/iknpp2/zm_5246_up/g3n27ob/",
        "score": 26,
        "subreddit": "options",
        "created": 1599022196.0
    },
    {
        "author": "Oh-I-Misunderstood",
        "body": "Don't know if you've ever seen any of TastyTrade's videos on Iron Condors but they definitely have some stark differences on what they look for, namely an IV rank over 50 for them to even be interested.\n\nhttps://youtu.be/IrM1V2qMJgA \n\nThey mention similar parameters in a lot of their IC videos. It usually sounds like the idea is getting IV in a position to revert back to the mean and drop. That along with theta decay let's them manage early and aim for exiting at 30% profit. Typically they do 45 DTE and go 1 SD OTM on both sides looking to still get 1/3 the width of the strikes in premium.\n\nThere's obviously a ton of different ways to trade successfully, I followed something similar to what you wrote as well. IBM was my go to given how few surprises it had keeping it so stable.",
        "created_utc": 1599963835,
        "id": "g50xddg",
        "permalink": "/r/options/comments/irkacx/intro_to_iron_condors/g50xddg/",
        "score": 18,
        "subreddit": "options",
        "created": 1599992635.0
    },
    {
        "author": "dramebaz",
        "body": "Next up, IBM acquiring Snapchat.",
        "created_utc": 1600041776,
        "id": "g56jlmf",
        "permalink": "/r/wallstreetbets/comments/is5mrk/what_are_your_moves_tomorrow_september_14_2020/g56jlmf/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1600070576.0
    },
    {
        "author": "teegolf1",
        "body": "Zoom is way overpriced as well. Here’s a quote from BARRON’S today.............  “Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It’s now worth $129.1 billion, more than International Business Machines’ (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.”",
        "created_utc": 1599003033,
        "id": "g3nnczg",
        "permalink": "/r/stocks/comments/ikqq4q/tesla_hype_is_fun_until_its_not/g3nnczg/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1599031833.0
    },
    {
        "author": "thicc_dads_club",
        "body": "I worked for IBM for a few years. You probably shouldn’t invest in any company dumb enough to hire me.",
        "created_utc": 1600571712,
        "id": "g5x1i3t",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5x1i3t/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1600600512.0
    },
    {
        "author": "will-succ-4-guac",
        "body": "People said the same shit, every time, about every company that at the time was the largest in the world. Go look up who was the first 100B company. It was IBM. Everyone said “tech and computers are the future and IBM has too much of a lead, they’ll never lose”...",
        "created_utc": 1600469133,
        "id": "g5r4j9w",
        "permalink": "/r/stocks/comments/iv9y63/i_bought_a_lot_of_aapl_shares_now_im_losing_a_lot/g5r4j9w/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1600497933.0
    },
    {
        "author": "BoatsNThots",
        "body": "IBM is a shitty system integrator and nothing more",
        "created_utc": 1600559609,
        "id": "g5vxtw7",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5vxtw7/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1600588409.0
    },
    {
        "author": "TerrorByteYT",
        "body": "IBM never had as much of a presence in our lives as Apple does now.",
        "created_utc": 1600469434,
        "id": "g5r52kg",
        "permalink": "/r/stocks/comments/iv9y63/i_bought_a_lot_of_aapl_shares_now_im_losing_a_lot/g5r52kg/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1600498234.0
    },
    {
        "author": "dragonowl1990",
        "body": "thats what he's saying...  before microsoft xerox and apple came along, who do you think dominated all tech business sales in the entire world??  maybe you didnt own any IBM products at home, but every store/business you shopped at did.\n\nbut yeah, i do agree it is different now that everyone has to have a phone / computer / internet these days, its hard to imagine that not being the case but  who knows what will happen.",
        "created_utc": 1600470624,
        "id": "g5r753u",
        "permalink": "/r/stocks/comments/iv9y63/i_bought_a_lot_of_aapl_shares_now_im_losing_a_lot/g5r753u/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1600499424.0
    },
    {
        "author": "IlleaglSmile",
        "body": "I’m an IBM employee who recent bought 100 shares of Intel. Your analogy makes me nervous.",
        "created_utc": 1600209142,
        "id": "g5etp1d",
        "permalink": "/r/stocks/comments/it7nbn/packaging_deep_dive_the_new_battleground_between/g5etp1d/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1600237942.0
    },
    {
        "author": "WeberStateWildcat",
        "body": "I'd certainly rather have Apple over IBM, but if I had 100+ shares of IBM, I'd investigate selling covered calls and collect some premium on the sale. And maybe premiums plural if it takes a few times for the buyers of said calls to succeed in hitting the strike price and exercising the option.",
        "created_utc": 1599280285,
        "id": "g42zuds",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g42zuds/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1599309085.0
    },
    {
        "author": "hypertr00per",
        "body": "When I was a kid I almost drowned. Mom freaked out, mom's boyfriend was nowhere to be seen (probably YOLOing on IBM and Yahoo). Always keep an eye on your kids when they are swimming.",
        "created_utc": 1600620494,
        "id": "g5zxvww",
        "permalink": "/r/wallstreetbets/comments/ivdifw/weekend_discussion_thread_for_the_weekend_of/g5zxvww/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600649294.0
    },
    {
        "author": "TrenAndOptions",
        "body": "You’re an idiot if you think IBM is dying. They’re leading the charge with quantum computing, even more than google",
        "created_utc": 1599023464,
        "id": "g3ooxye",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ooxye/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599052264.0
    },
    {
        "author": "ghostbearinforest",
        "body": "My friend works for IBM and they literally pay him a bonus to not leave them while they slowly drown lol. Stay away from ibm",
        "created_utc": 1600562728,
        "id": "g5w8axe",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5w8axe/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1600591528.0
    },
    {
        "author": "ixamnis",
        "body": "I see several people on here suggesting VOO.  I have no problem with VOO, but be aware that the top six holdings in VOO are:  AAPL, MSFT, AMZN, FB, GOOGL and GOOG.  I like VOO, but if you want to diversify outside of tech you may want to consider some value stocks and buy individual stocks instead of an ETF, or buy sector ETFs.  \n\nValue stocks that I'd recommend:  ABBV, ACN, AES, CLX, DIS, IBM, JNJ, JPM, KHC, KO, KR, LOW, MA, MAR, MCD, NVS, O, PEP, PFE, PLAY, SBUX, T, TD, TGT, TROW, VZ, WBA, WMT, WSM. I think you could easily pick any three to five of these and have a nicely balanced portfolio given the amount of money you are investing.\n\nSector ETFs that I like include:\n\nICLN, TAN or PBW - Clean energy/renewable energy\n\nFHLC, XLV - Health Care\n\nIDNA, ARKG - Genomic Research and DNA technology\n\nPRNT - 3D printing\n\nARKQ, THNK, ROBO - artificial intelligence and robotics (However, this is \"tech\")\n\nVFH, FNCL, XLF, IEFN - financial sector ETFs\n\nI'm not a financial advisor and have no business giving financial advice. That said, a nice balanced portfolio might look something like this:\n\n33% tech stocks and ETFs  (This is what you already have)\n\n33% value stocks (from the list above)\n\n33% sector ETFs:  10% ICLN, 10% ARKG, 10% XLV\n\nBest of luck to you.",
        "created_utc": 1600262071,
        "id": "g5gum66",
        "permalink": "/r/stocks/comments/itqkn5/i_am_a_dumbass_and_100_of_my_portfolio_is_tech/g5gum66/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1600290871.0
    },
    {
        "author": "Particular-Wedding",
        "body": "Apple's stock buyback program reminds me of another tech company - IBM which is doing the exact same thing.  But without the cult following.",
        "created_utc": 1600378421,
        "id": "g5mxc2c",
        "permalink": "/r/investing/comments/iup9ig/aapl_didnt_double_their_profit_but_doubled_their/g5mxc2c/",
        "score": 8,
        "subreddit": "investing",
        "created": 1600407221.0
    },
    {
        "author": "hak8or",
        "body": "Case in point, Microsoft from 2000 to a few years ago. Hell, what about IBM years before? Big glue was never the wrong choice, until it was. Same with Sears. The context given by /u/Okmanl is great, but OP's conclusion is a piss into the wind due to the \"easy\" part.\n\n&gt; If you buy and hold onto only good companies (Apple, Amazon, Costco, McDonalds, jnj, Brk, O etc...) you could **easily** outperform the S&amp;P 500 over a long period of time.",
        "created_utc": 1600636864,
        "id": "g6150h7",
        "permalink": "/r/investing/comments/iwklnv/warren_buffetts_greatest_investing_mistake_was_an/g6150h7/",
        "score": 8,
        "subreddit": "investing",
        "created": 1600665664.0
    },
    {
        "author": "L0L303",
        "body": "As someone who (may be) uniquely qualified to speak on the matter... stay the fuck away from IBM .. if it wasn't for the location or the salary someone I know wouldn't be there",
        "created_utc": 1600565006,
        "id": "g5wfwv1",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5wfwv1/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600593806.0
    },
    {
        "author": "CptTonyStark",
        "body": "ppl who invest in cryp-to as a hyperinflation hedge in case dollar goes bust don't even realize that almost all cry-pto-currencies like shitcoin and airer are based on elliptic curve digital signature algorithm cryp-to-graphy, which is not quantum secure. The day quantum computers become powerful enough, which will happen in maybe a decade thanks to google, IBM, and MSFT, all coins will become worthless overnight. Imagine investing in something thinking that its' like gold and will keep value even in an apocalypse, not knowing that it's not even future proof just 1 decade from now. \n\n&amp;#x200B;\n\nNow, quantum secure cryp-to-graphy algorithms do exist but it's impossible to change the underlying block-chains and the algos driving them, by design. Quantum computers breaking encryption won't be a big problem to systems with central authority because they can just overhaul the encryption infrastructure. Not so much with coins, because the whole purpose of making them was to make sure no one tampers with the underlying block-chain and any algos driving it once it's up and running.",
        "created_utc": 1599336577,
        "id": "g45s0vr",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g45s0vr/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599365377.0
    },
    {
        "author": "united858",
        "body": "Who would have imagined ORCL, probably the most boomer of tech companies along with IBM, would end up with TikTok?",
        "created_utc": 1600043196,
        "id": "g56m1i2",
        "permalink": "/r/wallstreetbets/comments/is5mrk/what_are_your_moves_tomorrow_september_14_2020/g56m1i2/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600071996.0
    },
    {
        "author": "TrenAndOptions",
        "body": "“Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.“",
        "created_utc": 1599023318,
        "id": "g3oor4k",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oor4k/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599052118.0
    },
    {
        "author": "pamdathebear",
        "body": "MSFT is sitting on a huge pile of cash. More than what they know what to do with. It gets returned to shareholders via dividend or buyback, which many companies do, including IBM. \n\nIBM's problem is innovation and growth. They missed the cloud. They couldn't monetize AI (watson) when they had a lead. A lot of their revenue comes from a dying legacy business. MSFT at one point was dying due to windows and office. But they pivoted and rode the cloud bubble with Azure and turned office into a subscription model.",
        "created_utc": 1600259642,
        "id": "g5gqxge",
        "permalink": "/r/investing/comments/itnt25/microsoft_announces_quarterly_dividend_increase/g5gqxge/",
        "score": 6,
        "subreddit": "investing",
        "created": 1600288442.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Imagine all the dumb fuck analysts who said Amazon was not a buy back in the 90s and recommended IBM, CSCO, and INTC instead. \n\nThat's how I feel about all the analysts with bearish targets on TSLA",
        "created_utc": 1599285296,
        "id": "g4372xo",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g4372xo/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599314096.0
    },
    {
        "author": "greytoc",
        "body": "&gt;Both are in varying forms of cloud computing\n\nThat's not entirely accurate. Both are extremely different businesses with different products that target different customers. It's like saying that $NVO and $HCA are varying forms of healthcare. \n\n$RXT is a capital intensive business that attempted to compete with AWS, Azure, GCP, and Softlayer/IBM but is considered a small player. They pivoted with software offerings to support multicloud solutions in an attempt to be an overlay solution to companies that require multicloud infrastructure. But I think that's a tough sell to companies that are deploying IaC solutions instead which may be arguably more agile and flexible. \n\n$SNOW - well - I don't know why the valuation is that high. They have a good product and service and many companies have flocked to them because they are more affordable than AWS Redshift and GCP BigQuery - and they have some nice built in ETL. They seem to have captured a lot of startup tech companies but  I don't really understand how/when they can be profitable. Competing on price alone doesn't seem sustainable to me. \n\nI don't hold any positions in either company.",
        "created_utc": 1600308987,
        "id": "g5ji856",
        "permalink": "/r/stocks/comments/iu9qfi/a_tale_of_two_ipos_snow_and_rxt/g5ji856/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1600337787.0
    },
    {
        "author": "MeteorMash101",
        "body": "IBM",
        "created_utc": 1599173113,
        "id": "g3wzbe6",
        "permalink": "/r/stocks/comments/ilwoqa/careful_with_thinking_this_is_the_only_dip/g3wzbe6/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1599201913.0
    },
    {
        "author": "DankMemelord25",
        "body": "Intel is the new IBM, change my mind 🤔🤔🤔",
        "created_utc": 1599024513,
        "id": "g3oq9t6",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oq9t6/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599053313.0
    },
    {
        "author": "jpsgshow",
        "body": "I really am not sure with INTC, I like the growth prospects but I feel as if we’re in an IBM type of situation",
        "created_utc": 1600451820,
        "id": "g5q4a60",
        "permalink": "/r/investing/comments/iv345y/what_do_you_think_of_the_long_term_prospects_for/g5q4a60/",
        "score": 5,
        "subreddit": "investing",
        "created": 1600480620.0
    },
    {
        "author": "throwaway23948733",
        "body": "IBM is a has-been. They probably make 120% of their income on ancient maintenance contracts to keep dusty mainframes running",
        "created_utc": 1600568116,
        "id": "g5wq284",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5wq284/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600596916.0
    },
    {
        "author": "BPFortyEight",
        "body": "Idk,  I look at IBM and it screams buy. But then I look at my ESPN fantasy app and use the IBM Watson trade assistant and it offers up Jordan Howard, Adrian Peterson, and Cooper Kupp for Mike Evans. Their AI is equally retarded as my league mates.\n\nAll that being said, I'm still considering LEAPs.",
        "created_utc": 1600558239,
        "id": "g5vtjl7",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5vtjl7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600587039.0
    },
    {
        "author": "infinitelimits00",
        "body": "I just noticed the Boomer Index actually crushed today. \n\nKO, IBM, INTC all massively outperforming today. KO back to its post-COVID highs (since March 23). CSCO, DIS, BA, RTX, T also all up. And XLU was up 3%, which is a lot for a defensive utilities sector.",
        "created_utc": 1599091636,
        "id": "g3seg2j",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3seg2j/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599120436.0
    },
    {
        "author": "technocrat_landlord",
        "body": "Is this what non-technical people think the tech landscape looks like?\n\nAlso, please post more frequently so I can inverse your ideas and positions\n\nquick note - it has been years since IBM was a leader in AI",
        "created_utc": 1600581920,
        "id": "g5xt972",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5xt972/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600610720.0
    },
    {
        "author": "infinitelimits00",
        "body": "No that's Intel, if they are even tech anymore. IBM and Cisco are next. Slack maybe is the most hated new tech company though. That or DBX which also never moves.",
        "created_utc": 1599692140,
        "id": "g4lhb9e",
        "permalink": "/r/wallstreetbets/comments/ipnztr/what_are_your_moves_tomorrow_september_10_2020/g4lhb9e/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599720940.0
    },
    {
        "author": "sandpipa78",
        "body": "Same, can’t believe this shit. How in the hell ZM is worth more than IBM?",
        "created_utc": 1599001380,
        "id": "g3njqwz",
        "permalink": "/r/wallstreetbets/comments/ikt5rw/zoom_porn/g3njqwz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599030180.0
    },
    {
        "author": "dryu12",
        "body": "Zoom is valued more than IBM. Let that sink into your retarded brain.",
        "created_utc": 1599055486,
        "id": "g3px4uq",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3px4uq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599084286.0
    },
    {
        "author": "Cwc123",
        "body": "ardes Michel11 hours ago\nYes....But.....Debt is huge for IBM......And they are not alone...Competition is also huge for IBM......Then a growth company is always richly priced......The world is the limit for ZM........No frontiers.......Sky is the limit.....ZM will reach 1000 usd if they continue to beat....\n\nWhy the f did i buy puts on this with ppl like this on the other side",
        "created_utc": 1599093636,
        "id": "g3si419",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3si419/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599122436.0
    },
    {
        "author": "infinitelimits00",
        "body": "Lol if you guys love the DOW, may I introduce you to the Boomer Index. \n\nKO, T, JNJ, BA, NKE, MCD, INTC, IBM, and CSCO (although INTC is catching on here...and the last three technically are correlated with tech).\n\nI like never see anyone trade NKE calls but it's actually a good company.",
        "created_utc": 1599182161,
        "id": "g3xln4y",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xln4y/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599210961.0
    },
    {
        "author": "sc0tt_1990",
        "body": "lol at Intel.  the new IBM.",
        "created_utc": 1599063974,
        "id": "g3qhsh2",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qhsh2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599092774.0
    },
    {
        "author": "TAWS",
        "body": "Snowflake's CEO is a boomer. They totally going to end up like IBM and die over time",
        "created_utc": 1600648196,
        "id": "g61tai1",
        "permalink": "/r/wallstreetbets/comments/iwl5kb/what_are_your_moves_tomorrow_september_21_2020/g61tai1/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600676996.0
    },
    {
        "author": "rbrumble",
        "body": "Any discussion of future investments should be broader than a single category.\n\nBut, this is a good post to kick off a deeper dive conversation.\n\nWhat should a portfolio focused on future trends include?\n\nI'd pick AI (IBM, MS, Apple, Nvidia, Google, Amazon, etc), solar power and battery makers (Tesla for sure), online shopping (Amazon).\n\nWhat else?",
        "created_utc": 1600184055,
        "id": "g5d5gvc",
        "permalink": "/r/stocks/comments/it5tpj/investing_in_the_future/g5d5gvc/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1600212855.0
    },
    {
        "author": "wildcat990",
        "body": "Everyone is on TSLA S&amp;P watch -  what about ZM?  It’s eligible now -  https://www.barrons.com/articles/zoom-is-now-worth-more-than-ibm-next-stop-the-s-p-500-51598966331",
        "created_utc": 1598993925,
        "id": "g3n3og7",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3n3og7/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599022725.0
    },
    {
        "author": "My_Papa_Is_Elon_Musk",
        "body": "Watson caught a virus. Puts on ibm.",
        "created_utc": 1599791719,
        "id": "g4s9yu6",
        "permalink": "/r/wallstreetbets/comments/iqb5ey/what_are_your_moves_tomorrow_september_11_2020/g4s9yu6/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599820519.0
    },
    {
        "author": "ReflectAA",
        "body": "The first and most important thing you have to learn about the stock market is that the overwhelming majority of people have no clue what they’re talking about. \n\nPeople said Tesla was inflated when it had a market cap of 1 billion. And they were probably telling you to sell it and buy GE or IBM instead.",
        "created_utc": 1599266934,
        "id": "g42er4l",
        "permalink": "/r/stocks/comments/imruf3/apple_and_pe_ratio/g42er4l/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599295734.0
    },
    {
        "author": "cornflake-millennial",
        "body": "OP clearly knows nothing about AI if he thinks IBM is sweet at it. Domain expertise and feature engineering matter most in developing relevant predictive models. IBM spreads AI like peanut butter on a sandwich — all breadth and no depth. They have their Watson brand, but there are much better firms to partner with in nearly every vertical. \n\nGo look up how many hospitals ended partnerships with IBM once they saw how misleading the “Watson cures cancer” ads from a few years ago were. \n\nMaybe there is a fundamental argument that IBM is undervalued, but don’t expect big gains ever.",
        "created_utc": 1600565779,
        "id": "g5wiedw",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5wiedw/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600594579.0
    },
    {
        "author": "Navarath",
        "body": "I seem to remember that years back IBM was really touting the benefits of working at home, and then they ended up calling back their own employees.",
        "created_utc": 1600185018,
        "id": "g5d7vb7",
        "permalink": "/r/investing/comments/it8ddc/is_working_at_home_overrated/g5d7vb7/",
        "score": 3,
        "subreddit": "investing",
        "created": 1600213818.0
    },
    {
        "author": "krootz1",
        "body": "Ugh til tok is useless for Oracle, what are they gonna do advertise java on it.\n\nFucking everything Oracle touches dies, worse than IBM imo",
        "created_utc": 1600044032,
        "id": "g56ngu1",
        "permalink": "/r/wallstreetbets/comments/is5mrk/what_are_your_moves_tomorrow_september_14_2020/g56ngu1/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600072832.0
    },
    {
        "author": "pelikana20",
        "body": "Damn I slept on IBM's unusual options activity. It's up 3.8% today but who's even in IBM??",
        "created_utc": 1599081666,
        "id": "g3rskmk",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rskmk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599110466.0
    },
    {
        "author": "cornflake-millennial",
        "body": "I used to work at a giant healthcare company that had a giant partnership with IBM Watson. It was stupid. Did a similar one with Google at a different company. \n\nThose companies only do that for free marketing and press releases. \n\nRarely, if ever, do those work out. The agreements between the companies are so prohibitive that the employees working on the project can’t even share important details with one another.",
        "created_utc": 1600567362,
        "id": "g5wnkdk",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5wnkdk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600596162.0
    },
    {
        "author": "MGSteezus",
        "body": "Reading these comments make me consider this subreddit, Oracle is a huge legacy company almost on par with IBM. Facebook &amp; Snapchat aren't in the same league, the only worry is FB reels, TikTok is now one of the largest social media platforms with huge financial backing. Are people forgetting the rest of the world exists outside the US?",
        "created_utc": 1600145034,
        "id": "g5brbfk",
        "permalink": "/r/investing/comments/iso7dg/oracle_wins_race_to_bottom_to_acquire_tiktok_us/g5brbfk/",
        "score": 3,
        "subreddit": "investing",
        "created": 1600173834.0
    },
    {
        "author": "guyfawkes202",
        "body": "I have 30 shares of international business machines stock that I’ve been holding since 1979... in fact I set up one of the original COBOLT servers for IBM back in the day.",
        "created_utc": 1599104516,
        "id": "g3t1mit",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3t1mit/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599133316.0
    },
    {
        "author": "barnett9",
        "body": "NVDA has been working on architecture to do compute without CPU's for a while. If they pull it off then they will redefine how computers work at a fundamental level. They are stupidly overbought right now, but long timeline I'd take that gamble.\n\nIBM is also trying to not be a dinosaur and is investing fairly heavily into quantum computing, maybe that.",
        "created_utc": 1599156838,
        "id": "g3voret",
        "permalink": "/r/wallstreetbets/comments/ilygri/30_year_timeline_10k_bet/g3voret/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599185638.0
    },
    {
        "author": "LemonBrothers",
        "body": "I work in tech, know a lot of ppl who work in IBM and I've never seen such a retarded thesis like yours",
        "created_utc": 1600582129,
        "id": "g5xtpqg",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5xtpqg/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600610929.0
    },
    {
        "author": "x-w-j",
        "body": "&gt;SQQQ\n\nI am a living specimen and had some small investment on it. SQQQ can at the best meet 2x of QQQ on continuous climb. Backtested since 2000 (post crash) to before COVID happened (Feb). This can be modeled at the best something like a Random Walk problem but the delta might be unknown.\n\nI also find it hard to put more money in tech as it more service oriented than product oriented, your revenue could possibly shift between (big) players or whomever offers more value as consumers become more and more aware.\n\nTL;DR IBM was a tech stock in 2000.",
        "created_utc": 1600629918,
        "id": "g60nbav",
        "permalink": "/r/investing/comments/iwf062/hedging_risks_within_qqq_andor_faangcentric/g60nbav/",
        "score": 3,
        "subreddit": "investing",
        "created": 1600658718.0
    },
    {
        "author": "SimoHayha360",
        "body": "IBM the fuck do they produce these days?",
        "created_utc": 1600558648,
        "id": "g5vuqx3",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5vuqx3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600587448.0
    },
    {
        "author": "basic_math_doit",
        "body": "IBM is a patent troll company in the making   \nMy smart watch has more AI than all their products put together.",
        "created_utc": 1600563955,
        "id": "g5wcfwc",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5wcfwc/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600592755.0
    },
    {
        "author": "robogarbage",
        "body": "I think Apple would buy OLED screens from a dude in a van if he could deliver quantity and quality.  \n\nI don't think any company's AI product is accepted based on brand name alone, they have to prove that their shit works.  So IBM has no advantage vs no-names, except maybe easier to get a foot in the door.\n\nI heard that Watson sucks and doesn't work.  Which would explain why we haven't heard about it in recent years.",
        "created_utc": 1600581481,
        "id": "g5xs54l",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5xs54l/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600610281.0
    },
    {
        "author": "ZippyZebras",
        "body": "I did the math for each pick last time it was posted, through 2005 the best return was -60%, on an internet security company that got bought by IBM  \n\n\nEvery. single. other. pick. was worse -90% or worse. Not a single one actually had any form of fundamentals, even in an abstract view of the term.",
        "created_utc": 1600269896,
        "id": "g5h8x53",
        "permalink": "/r/wallstreetbets/comments/ite9su/who_has_a_monkey/g5h8x53/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600298696.0
    },
    {
        "author": "CritSC",
        "body": "I’ve been thinking about buying IBM for weeks because it is the only tech stock with a price less than its IV. I just haven’t had time to do a full DCF and read the 10-K yet.",
        "created_utc": 1599100898,
        "id": "g3svfg2",
        "permalink": "/r/ValueInvesting/comments/ill0c5/ibm_good_investment_or_value_trap/g3svfg2/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1599129698.0
    },
    {
        "author": "likeitis121",
        "body": "Not really a fan of Dividend Aristocrats myself, it's a well meaning list that focuses on the wrong things.\n\nThere are companies like T, IBM, and XOM that would be so much better suited taking that money and trying to dig themselves out of debt rather than just continuing to pay the dividend.  They mortgage themselves and their growth to get on a list.\n\nBut yeah, it feels like a relatively small part of his portfolio.  It feels like a portfolio chosen by looking backwards instead of forwards.  \n\nPersonally I'm not sure how I feel about walmart, I want to like them as a stock.  They are a bit overpriced, but I strongly feel like they are the company that truly could take on Amazon for online retail supremacy.  They have all these stores already all over that they truly could pull off same day delivery.... And then I buy stuff online from them and they can't even handle it.  Amazon is just really good at what they do, and it's why it's tough to crack it in online retail.",
        "created_utc": 1599528990,
        "id": "g4eeo6p",
        "permalink": "/r/stocks/comments/iobyko/opinions_on_my_portfolio/g4eeo6p/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599557790.0
    },
    {
        "author": "oyveyanyday",
        "body": "No don't put emergency funds into the stock market!  I get your logic, I'm heavy into stocks for dividend these days.  But IME investing your emergency fund only works when you have huge sums of money - large enough that if you lose your job, your dividends are meaningful enough to help pay the bills.  But if we're only talking about a few thousand dollars, that money will be much more valuable in cash.  If you hate the no interest, maybe shop around for a CD that will lock you in and have  a penalty if you take the $$ out early?  Those usually pay actual interest, and you'd probably just need to give up a couple of months' interest if you cash it out for an actual emergency, such as unemployment.\n\nBut investing any new savings in an ETF is great.  Everyone here will tell you to do a tech ETF, but if you invest long enough you'll realize it's best to buy things when they are on sale and wait when they are not.  Right now, tech is overpriced, AATH, or at the very least, most definitely not on sale.\n\nGo for all of the non-tech names on sale.  I highly recommend the Vanguard high dividend ETF symbol VYM which includes all of the companies you'd buy if you were into individual stocks.  And they pay a dividend so you'll get $$$ to reinvest:\n\nVerizon, JNJ, Merck, Intel, JPM, Bank of America, Pepsi, Walmart, McDonalds, Abbvie, Coca Cola, Next Era Energy, Texas Instruments, UPS, IBM, Bristol Meyes Squid, Colgate-Palmolive, Gilead, Raytheon, ADP, Duke Energy, Kimberly Clark, 3M, Lockhead Martin........the list goes on and on\n\nThe more $$$$ I have, the more I'm just putting into this fund since it has all of the solid companies I used to buy individually anyways. Also, it's on sale now, unlike tech!",
        "created_utc": 1600269520,
        "id": "g5h85pk",
        "permalink": "/r/stocks/comments/itrfij/rstocks_daily_discussion_wednesday_sep_16_2020/g5h85pk/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600298320.0
    },
    {
        "author": "pamdathebear",
        "body": "It's financial engineering. IBM is an example. Declining revenues for 10 years but they grow EPS because they bought back half their outstanding shares.",
        "created_utc": 1600404557,
        "id": "g5o8yzs",
        "permalink": "/r/investing/comments/iuyc4e/apple_buybacks_the_leading_reason_for_eps_growth/g5o8yzs/",
        "score": 2,
        "subreddit": "investing",
        "created": 1600433357.0
    },
    {
        "author": "HmnmmmNmmm",
        "body": "no I B M\n\nits not U B M\n\nIBM\n\nfuck off\n\nbecause IBM\n\nM GANG HOE\n\nTSLA 999 9/99",
        "created_utc": 1600559075,
        "id": "g5vw1l8",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5vw1l8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600587875.0
    },
    {
        "author": "LineReact0r1",
        "body": "Ahh the Redhat deal. Yeah i remember reading about that. Probably the best thing they have done in 20 years. Not for Redhat but def for IBM.",
        "created_utc": 1599026152,
        "id": "g3os8ad",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3os8ad/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599054952.0
    },
    {
        "author": "CallinCthulhu",
        "body": "People still use yahoo everyday. It’s the 10th most visited site in the world.\n\nIt takes more than a cornerstone product to grow. Microsoft was weighed down by a continuous stream of awful products, poor acquisitions, botched acquisitions, and no ability to look forward. They were very slowly but surely dying. They were losing market share everywhere.\n\nSatiya changed that and they really embraced cloud, and managed some fantastic acquisitions that they didn’t fuck up after. Without him and the changes they made, they’d be IBM. Flat as fuck",
        "created_utc": 1599280313,
        "id": "g42zvn2",
        "permalink": "/r/stocks/comments/imqb50/selling_my_tesla_stock_yes_im_an_idiot/g42zvn2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599309113.0
    },
    {
        "author": "AvodLooksee",
        "body": "mPulse is the patented leading microgrid managing software, and mVSO is their optimization program that then feeds info to their mPulse software. Not 100% sure if mVSO is patented but their main product mPulse definitely is.\n\nIBM said they're on the leading edge of the cutting edge in a white paper, and seeing as though tesla partnered with them on a microgrid battery I think it's more set in stone than up in the air. 1m in backlogged contracts, and more projected after the acquisition of gridfabric and its clients.",
        "created_utc": 1599164057,
        "id": "g3wadzt",
        "permalink": "/r/stocks/comments/ilz5hw/clsk_on_super_sale_before_the_conference/g3wadzt/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599192857.0
    },
    {
        "author": "DankMemelord25",
        "body": "IBM",
        "created_utc": 1600577796,
        "id": "g5xiqjx",
        "permalink": "/r/wallstreetbets/comments/ivdifw/weekend_discussion_thread_for_the_weekend_of/g5xiqjx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600606596.0
    },
    {
        "author": "Be_Kind_To_Strangers",
        "body": "Ibm stats are just lies and smoke.",
        "created_utc": 1600558223,
        "id": "g5vthwl",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g5vthwl/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600587023.0
    },
    {
        "author": "realmastodon2",
        "body": "\\&gt;  Most people are not going to return to the office full time. \n\nMost office workers are doing jobs which can't be done at home. Such as a supporting roles and HR. Not to mention sales teams need to meet clients either in office or their offices, and communications teams need to fix companies issues and meet with clients as well. WFH is for software engineers. Even then a lot of them can't do it at home. They need to be in a team environment. Once COVID is gone a lot of companies will do a 180 and force all workers back to the office. If I recall IBM tried WFH before it was popular a few years ago and didn't work out so well.",
        "created_utc": 1600103864,
        "id": "g595bq9",
        "permalink": "/r/investing/comments/isku7v/bp_says_the_era_of_oildemand_growth_is_over/g595bq9/",
        "score": 2,
        "subreddit": "investing",
        "created": 1600132664.0
    },
    {
        "author": "schrute-farms-inc",
        "body": "You think you’re the first one to make this argument? IBM used to be the biggest company and they were “the future of tech”. The first 100 billion market cap company, all the way back in 1987.",
        "created_utc": 1600104689,
        "id": "g597rc4",
        "permalink": "/r/investing/comments/is44om/investing_in_tech_right_now_where_do_you_stand/g597rc4/",
        "score": 2,
        "subreddit": "investing",
        "created": 1600133489.0
    },
    {
        "author": "Govika",
        "body": "Ibm will buy tiktok.\n\nCap this",
        "created_utc": 1600052972,
        "id": "g572cri",
        "permalink": "/r/wallstreetbets/comments/is95c6/microsoft_bid_rejected_by_tiktok/g572cri/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600081772.0
    },
    {
        "author": "ryanl247",
        "body": "If I’m wrong about NNOX then\n\n1. GE\n2. Siemens\n3. Bill &amp; Melinda Gates Foundation\n4. Fujifilm\n5. Sony\n6. SK Telecom\n7. FoxConn\n8. IBM\n9. USARAD\n10. Cantor Fitzgerald\n11. Berenberg Bank\n12. Oppenheimer\n13. Hadassah\n14. Rafael Grossmann\n15. Medical Director of Computed Tomography at Univ. of Washington\n16. Former Chair Duke Dept of Radiology\n17. Customers in Mexico, Australia, Norway &amp; more...\n\nAre all wrong too. I’m good with that investment company.\n\nI can't believe Citron is allowed to continue to exist, to be honest, but thank you to them\n\nEdit: It looks like there is a [change.org](https://change.org) petition against Citron's repeatedly deliberate false and misleading reports, particularly Andrew Left who has been sued and convicted by regulators and governments: [http://chng.it/YZ9bRdMPmP](http://chng.it/YZ9bRdMPmP).",
        "created_utc": 1600187704,
        "id": "g5deeqv",
        "permalink": "/r/investing/comments/it9a1w/citron_did_a_report_on_nnox_but_it_seems_to_be/g5deeqv/",
        "score": 2,
        "subreddit": "investing",
        "created": 1600216504.0
    },
    {
        "author": "moneygardener",
        "body": " Regarding INTC:\n\nWith all the security issues that has been popping up the last couple of years (Meltdown, Spectre and unfortunately many more)\n\nThe risk of having fabs that are being outperformed by both TSMC and Samsung.  \nAs in having fabs becoming a liability if you can't reach the cutting edge.\n\nLosing marketshare in both DIY desktop segment and datacenters. due to the competitors latest 2-3 product cycles which are competitive both in price and performance.\n\nRumours of terrible workplace conditions, especially for the so-called green badges. (Green badges are hired short-mid term employees)\n\nHilariously terrible and false marketing lately (Which they are receiving a lot of flak for in the tech tuber space) Possibly why their Chief Communications Officer, Claire Dixon just left.\n\nA freshly started ext-gpu division (Risky. Difficult to compete. A moneyhog if it doesn't work out)\n\nINTC also has a lot of debt.  \n\n\nAll in all I fear that they will be the new IBM of chip stocks.",
        "created_utc": 1600204844,
        "id": "g5ekgk2",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g5ekgk2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600233644.0
    },
    {
        "author": "PerilousPostulation",
        "body": "Nvidia has certainly tried tie-ups with a CPU arch for perf gains before - the IBM Power CPUs in the summit supercomputer are directly lashed together with their Nvidia GV100s through a native NVLink interface rather than the usual switch chips\n\nI see why they might prefer to self-build an ARM variant of that concept over Power given the momentum of the ISA in servers and computers. But yeah, just don’t understand why the Apple route isn’t a better way to do it",
        "created_utc": 1599954695,
        "id": "g503lx3",
        "permalink": "/r/SecurityAnalysis/comments/irgr9s/wsj_softbank_nears_40_billion_deal_to_sell_arm/g503lx3/",
        "score": 2,
        "subreddit": "SecurityAnalysis",
        "created": 1599983495.0
    },
    {
        "author": "Rectilon",
        "body": "Is IBM a good 2 month hold? Any better options?",
        "created_utc": 1600089789,
        "id": "g587c93",
        "permalink": "/r/stocks/comments/isgskc/rstocks_daily_discussion_monday_sep_14_2020/g587c93/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600118589.0
    },
    {
        "author": "oshtitswaynebradyson",
        "body": "I actually think a lot of the boomer stocks will bounce hard in the 2020s. Altria is in a nice position. Huge dividend and they are heavy into cannabis space. Chevron, Exxon, ATT, IBM, etc....all these boomer picks are super cheap now. They are better picks than these stupid software names at 100x earnings that are probably at a multi-decade top",
        "created_utc": 1600522412,
        "id": "g5t9run",
        "permalink": "/r/stocks/comments/iva8p8/lock_in_losses/g5t9run/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600551212.0
    },
    {
        "author": "Thanks-Feeling",
        "body": "Why don't you just reinvest the dividend from your IBM stock into shares of Apple stock?",
        "created_utc": 1599285445,
        "id": "g437an8",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g437an8/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599314245.0
    },
    {
        "author": "Trumpowell",
        "body": "Anyone see that huge order  on $IBM contracts 6049 traded 130C 8/4\n\nIs $IBM buying tikthot ?",
        "created_utc": 1599102275,
        "id": "g3sxtee",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3sxtee/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599131075.0
    },
    {
        "author": "Dogburt_Jr",
        "body": "Because the terms are ill will/anti-competitive/monopolistic. They don't encourage a free market. I agree for &gt;80% of apps in-app payment should go through Google Play. I don't do so for Spotify, I pay through their website. Fortnite is entitled to do the same. Apple only cares because Fortnite is a massive revenue for them because of all the kids using parents credit cards on their iPhones.\n\nI disagree with Apple and Epic Games on a *lot* of their ethics policies. Epic Studios is a massive burnout hell for developers, and their business model is exploiting children under 18 y/o. The bell curve is likely averaged around 13 y/o. Apple holds an overbearing tight key over their software, very comparable to IBM in the early computer days and their business model is blatantly anti-consumer based on the design of a lot of their products and sales model. iPhones are physically the nicest phones to fix. But they will fight with everything they have to prevent repairs by 3rd parties.\n\nI think this is one time I actually like Epic Games.",
        "created_utc": 1599605530,
        "id": "g4ho12h",
        "permalink": "/r/stocks/comments/ip1sgx/apple_countersues_epic_games_for_breach_of/g4ho12h/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599634330.0
    },
    {
        "author": "LePootPootJames",
        "body": "ZM larger market cap than IBM lol",
        "created_utc": 1598971566,
        "id": "g3ledwt",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ledwt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599000366.0
    },
    {
        "author": "TrudeausMakeupArtist",
        "body": "Me: I think IBM is making a pivot to cloud services, but the results are yet to be seen. I'll buy in at $115-118.\n\nMarket: Fuck your plan.",
        "created_utc": 1599063232,
        "id": "g3qfuxm",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qfuxm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599092032.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If IBM changes their name to International Blockchain Machines they’d probably double in value.",
        "created_utc": 1599001219,
        "id": "g3nje0s",
        "permalink": "/r/investing/comments/iks7c7/7_million_worthington_nkla_shares_unlocking/g3nje0s/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599030019.0
    },
    {
        "author": "Furloughedinvester",
        "body": "I also understand that ZM is currently valued higher than IBM. We may not be in a bubble but we are definitely in something.  Maybe the Twilight Zone?",
        "created_utc": 1599100543,
        "id": "g3suslr",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3suslr/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599129343.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If ibm traded at a pe of .00001 I would buy every share and collect millions in dividends for a few thousand dollars. Value absolutely does matter.",
        "created_utc": 1599030192,
        "id": "g3owlhc",
        "permalink": "/r/investing/comments/il13pb/cmv_fundamentals_and_pe_ratio_do_not_and_have/g3owlhc/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599058992.0
    },
    {
        "author": "radioref",
        "body": "IBM, Honeywell, Ford, GE, Kellogg, Exxon, Phillip Morris.",
        "created_utc": 1599415173,
        "id": "g494fcs",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g494fcs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599443973.0
    },
    {
        "author": "BigEd781",
        "body": "SQL was initially conceived of at IBM. Oracle (then Relational Software Inc. iirc) saw it's potential and quickly developed their implementation. They also own the licensing rights to java, but you're right in implying they are a dinosaur for the most part.",
        "created_utc": 1600051715,
        "id": "g570dmx",
        "permalink": "/r/stocks/comments/isa99l/oracle_poised_to_become_tiktoks_us_technology/g570dmx/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600080515.0
    },
    {
        "author": "HwanZike",
        "body": "Big companies have issues and risks due to their sheer size. There's also risks of new paradigm shifts. History usually repeats itself, people think companies like FAGMAN will continue to grow and be dominant. Look at how the big ones fell, from railway companies back in the 1900 to more recent history with GM, F, X, AT&amp;T, GE, AIG, C, XOM, ICBC, IBM, to name a few. Who knows what the next big companies will be? Or what sectors? Biotech? Clean energy?\n\nCheck this podcast episode that touches on it: https://rationalreminder.ca/podcast/113",
        "created_utc": 1600391211,
        "id": "g5nm59t",
        "permalink": "/r/investing/comments/iup9ig/aapl_didnt_double_their_profit_but_doubled_their/g5nm59t/",
        "score": 2,
        "subreddit": "investing",
        "created": 1600420011.0
    },
    {
        "author": "hungry_koala",
        "body": "Buy index funds. Seriously. know you’re probably thinking you can beat the market. I’ve been investing/trading for almost 3 years and I’ve been there before. I set out with the intention of beating the market, and was successful at some points. Let me tell you I would have better far better off if I just started with building a good foundation (index funds). Now I’m 25 and while I’ve made some good investments ultimately my losses are still weighing me down (that said some of my investment theses have not played out so this can change in the future). To give some more perspective, I’ve been working for 2 years and 4 months and I only have one years worth of max contributions in my 401k, Roth IRA, and HSA, when I could easily have maxed it out this whole time.\n\nGranted this isn’t a terrible position to be in—I’m probably still ahead of many people my age and even some older than me. I’m grateful for this and count my blessings every day. But I’d be so much further along in my journey if I didn’t indulge in so much speculation and gambling (yes even investing in companies like Apple or Microsoft for the long term is not foolproof.. just look back at giants past of the S&amp;P and see where they are today. IBM, XOM, Enron are some classic example). Index funds are truly the only investments you can blindly hold for a long period of time with minimal re evaluation and decision making.\n\nAs for what to buy, look for the lowest cost index funds you can find. VOO or VTI are classics. If you have fidelity, they have zero fee equivalents (FNILX,FZROX), which can save you a lot of money over time if you take into account compounding gains. Hope this helps!",
        "created_utc": 1600451040,
        "id": "g5q2oy5",
        "permalink": "/r/investing/comments/ivajs7/investing_advice/g5q2oy5/",
        "score": 2,
        "subreddit": "investing",
        "created": 1600479840.0
    },
    {
        "author": "darqmachine",
        "body": "Yes it is. A Reverse Iron Condor is the same as an Iron Condor while a Reverse Iron Butterfly is the opposite of a Butterfly. You use the Butterfly or the Iron Condor on stocks that exhibit a Delta Neutral Pattern as in no movement. Stocks like GE, Ford, Fitbit, Gopro, IBM have been stagnant over the past 2 or 3 months. On these they are perfect for Condors or Butterflies because the stay within a certain price range. On these you want to look at the the Greeks I mentioned earlier and then look at the Vix.",
        "created_utc": 1600545794,
        "id": "g5uszbx",
        "permalink": "/r/options/comments/iveedr/went_from_4500_to_1000_and_learned_many_lessons/g5uszbx/",
        "score": 2,
        "subreddit": "options",
        "created": 1600574594.0
    },
    {
        "author": "honor-",
        "body": "&gt;Well artificial intelligence is used in -Vaccine research -Cyber security -medicine -computer programming -Mass Production of good\n\nYou seem to have a very limited understanding of current capabilities of AI. But let me keep it simple: AI can not think or reason, it is only used for limited tasks that involve crunching huge amounts of data that humans cannot. Now you need to ask yourself the question of whether or not IBM can do this for profit and grow their sales of AI services.\n\n&amp;#x200B;\n\n&gt;Because of covid 19 I don’t think big corporate companies are going to want humans they are expensive and are snowflakes. There for most major companies will be more inclined to robots and artificial intelligence\n\nOK, among AI professionals IBM Watson is kinda considered a joke that did good at Jeopardy and nothing else. It's tried to expand into health but very few hospitals take it, and even then its only used in limited capacity to evaluate its judgements. I haven't heard of it being used widely, and there are certainly no clinical studies that have been done to evaluate any improvements over human professionals. Just the clinical study part should give you massive pause.\n\n&amp;#x200B;\n\n&gt;Plus you don’t have to pay taxes for employing artificial intelligence🤷🏼\n\nI don't even know what this means. No one is close to using Watson to replace human workers in anything.\n\n&amp;#x200B;\n\n&gt;Edit: I’m not saying buy the stock because I actually waiting for the dip I’m hoping the stock won’t go up but down\n\nIBM has been in decline for 8 years in spite of massive share buybacks. Their acquisitions have been garbage and they're a garbage company. They will need a total overhauling as a company if they want to have growth in the future.\n\n&amp;#x200B;\n\n&gt;Edit: When you walk down the street do you see IBM on the street or when you drive or when you go to the store no they are not a consumer goods product but corporate product. Pandemic happens corporations cut costs and restructure most companies will want to have less human work force thus AI will take over go to Walmart and look at the self checkout or when you go to a amazon warehouse tell me what you see boy.\n\nAgain, no one is using IBM's crappy Watson AI. They're making their own AI solutions.",
        "created_utc": 1600638321,
        "id": "g6197vx",
        "permalink": "/r/wallstreetbets/comments/iw2qmc/ibm_why_not/g6197vx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600667121.0
    },
    {
        "author": "doublejay1999",
        "body": "dont understand your downvotes.  this is pretty much where we are right now.\n\nin different times, they would have already have broken them up.  They were very close to breaking up IBM in the 90's and they were no where near the level of dominance of Google &amp; Amazon.\n\nI think they are surviving because they are vital to the economy right at the moment, in the US at least.  But things are changing elsewhere.  Rupert Murdoch has his ass in his hands about content theft by Facebook &amp; Google, and the EU are sniffing round amazon for sharp practice and tax policies.\n\ni still dont believe anyone has the balls or brains to make the case that our economies would be better balanced &amp; stronger without these guys  sucking everything up.",
        "created_utc": 1599046348,
        "id": "g3pezzc",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3pezzc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599075148.0
    },
    {
        "author": "mbr902000",
        "body": "Someone gonna scoop em up, maybe ibm",
        "created_utc": 1599045958,
        "id": "g3pehq4",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3pehq4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599074758.0
    },
    {
        "author": "EithneDraoct",
        "body": "There was probably some repositioning out of Apple and Tesla in to some value plays, but tech will continue to dominate this K, imo. A lot of those value stocks are tech anyway. Look at IBM and INTC.",
        "created_utc": 1599068711,
        "id": "g3qu4ij",
        "permalink": "/r/stocks/comments/il7ojn/rotation_from_tech/g3qu4ij/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599097511.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM, DD, HEALTHCARE, INDUSTRIALS",
        "created_utc": 1599075387,
        "id": "g3rbl88",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3rbl88/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599104187.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Shift to CVS, IBM, MO",
        "created_utc": 1599055092,
        "id": "g3pw7eh",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3pw7eh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599083892.0
    },
    {
        "author": "scot-t-ophile216",
        "body": "I hear a lot about breaking AMZN, but I don't think it'll happen. There are so many competing against AMZN and holds their own against them, like Microsoft, Google, Oracle, Salesforce, IBM, Walmart, Target, etc.",
        "created_utc": 1599016674,
        "id": "g3oew62",
        "permalink": "/r/StockMarket/comments/ikpu4w/walmart_vs_amazon_the_next_big_online_retailer/g3oew62/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599045474.0
    },
    {
        "author": "AnonymousAstro",
        "body": "I sold a naked 9/4 $410c at close as a part of a strangle because an “$85 move up in a day is impossible”. I sold it for $70 and ate a $2800 loss this morning.\n\n**One big lesson learned:** people will buy up everything and try to make it the new TSLA. ZM has EPS of $.92 and a current P/E ratio of $1700ish. It’s now worth more than IBM.\n\nAs long as “stonks go up”, I’ll stick to selling puts only.",
        "created_utc": 1598993396,
        "id": "g3n27ob",
        "permalink": "/r/options/comments/iknpp2/zm_5246_up/g3n27ob/",
        "score": 26,
        "subreddit": "options",
        "created": 1599022196.0
    },
    {
        "author": "teegolf1",
        "body": "Zoom is way overpriced as well. Here’s a quote from BARRON’S today.............  “Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It’s now worth $129.1 billion, more than International Business Machines’ (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.”",
        "created_utc": 1599003033,
        "id": "g3nnczg",
        "permalink": "/r/stocks/comments/ikqq4q/tesla_hype_is_fun_until_its_not/g3nnczg/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1599031833.0
    },
    {
        "author": "WeberStateWildcat",
        "body": "I'd certainly rather have Apple over IBM, but if I had 100+ shares of IBM, I'd investigate selling covered calls and collect some premium on the sale. And maybe premiums plural if it takes a few times for the buyers of said calls to succeed in hitting the strike price and exercising the option.",
        "created_utc": 1599280285,
        "id": "g42zuds",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g42zuds/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1599309085.0
    },
    {
        "author": "TrenAndOptions",
        "body": "You’re an idiot if you think IBM is dying. They’re leading the charge with quantum computing, even more than google",
        "created_utc": 1599023464,
        "id": "g3ooxye",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ooxye/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599052264.0
    },
    {
        "author": "CptTonyStark",
        "body": "ppl who invest in cryp-to as a hyperinflation hedge in case dollar goes bust don't even realize that almost all cry-pto-currencies like shitcoin and airer are based on elliptic curve digital signature algorithm cryp-to-graphy, which is not quantum secure. The day quantum computers become powerful enough, which will happen in maybe a decade thanks to google, IBM, and MSFT, all coins will become worthless overnight. Imagine investing in something thinking that its' like gold and will keep value even in an apocalypse, not knowing that it's not even future proof just 1 decade from now. \n\n&amp;#x200B;\n\nNow, quantum secure cryp-to-graphy algorithms do exist but it's impossible to change the underlying block-chains and the algos driving them, by design. Quantum computers breaking encryption won't be a big problem to systems with central authority because they can just overhaul the encryption infrastructure. Not so much with coins, because the whole purpose of making them was to make sure no one tampers with the underlying block-chain and any algos driving it once it's up and running.",
        "created_utc": 1599336577,
        "id": "g45s0vr",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g45s0vr/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599365377.0
    },
    {
        "author": "TrenAndOptions",
        "body": "“Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.“",
        "created_utc": 1599023318,
        "id": "g3oor4k",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oor4k/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599052118.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Imagine all the dumb fuck analysts who said Amazon was not a buy back in the 90s and recommended IBM, CSCO, and INTC instead. \n\nThat's how I feel about all the analysts with bearish targets on TSLA",
        "created_utc": 1599285296,
        "id": "g4372xo",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g4372xo/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599314096.0
    },
    {
        "author": "MeteorMash101",
        "body": "IBM",
        "created_utc": 1599173113,
        "id": "g3wzbe6",
        "permalink": "/r/stocks/comments/ilwoqa/careful_with_thinking_this_is_the_only_dip/g3wzbe6/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1599201913.0
    },
    {
        "author": "DankMemelord25",
        "body": "Intel is the new IBM, change my mind 🤔🤔🤔",
        "created_utc": 1599024513,
        "id": "g3oq9t6",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oq9t6/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599053313.0
    },
    {
        "author": "infinitelimits00",
        "body": "I just noticed the Boomer Index actually crushed today. \n\nKO, IBM, INTC all massively outperforming today. KO back to its post-COVID highs (since March 23). CSCO, DIS, BA, RTX, T also all up. And XLU was up 3%, which is a lot for a defensive utilities sector.",
        "created_utc": 1599091636,
        "id": "g3seg2j",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3seg2j/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599120436.0
    },
    {
        "author": "sandpipa78",
        "body": "Same, can’t believe this shit. How in the hell ZM is worth more than IBM?",
        "created_utc": 1599001380,
        "id": "g3njqwz",
        "permalink": "/r/wallstreetbets/comments/ikt5rw/zoom_porn/g3njqwz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599030180.0
    },
    {
        "author": "dryu12",
        "body": "Zoom is valued more than IBM. Let that sink into your retarded brain.",
        "created_utc": 1599055486,
        "id": "g3px4uq",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3px4uq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599084286.0
    },
    {
        "author": "Cwc123",
        "body": "ardes Michel11 hours ago\nYes....But.....Debt is huge for IBM......And they are not alone...Competition is also huge for IBM......Then a growth company is always richly priced......The world is the limit for ZM........No frontiers.......Sky is the limit.....ZM will reach 1000 usd if they continue to beat....\n\nWhy the f did i buy puts on this with ppl like this on the other side",
        "created_utc": 1599093636,
        "id": "g3si419",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3si419/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599122436.0
    },
    {
        "author": "infinitelimits00",
        "body": "Lol if you guys love the DOW, may I introduce you to the Boomer Index. \n\nKO, T, JNJ, BA, NKE, MCD, INTC, IBM, and CSCO (although INTC is catching on here...and the last three technically are correlated with tech).\n\nI like never see anyone trade NKE calls but it's actually a good company.",
        "created_utc": 1599182161,
        "id": "g3xln4y",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xln4y/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599210961.0
    },
    {
        "author": "sc0tt_1990",
        "body": "lol at Intel.  the new IBM.",
        "created_utc": 1599063974,
        "id": "g3qhsh2",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qhsh2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599092774.0
    },
    {
        "author": "wildcat990",
        "body": "Everyone is on TSLA S&amp;P watch -  what about ZM?  It’s eligible now -  https://www.barrons.com/articles/zoom-is-now-worth-more-than-ibm-next-stop-the-s-p-500-51598966331",
        "created_utc": 1598993925,
        "id": "g3n3og7",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3n3og7/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599022725.0
    },
    {
        "author": "ReflectAA",
        "body": "The first and most important thing you have to learn about the stock market is that the overwhelming majority of people have no clue what they’re talking about. \n\nPeople said Tesla was inflated when it had a market cap of 1 billion. And they were probably telling you to sell it and buy GE or IBM instead.",
        "created_utc": 1599266934,
        "id": "g42er4l",
        "permalink": "/r/stocks/comments/imruf3/apple_and_pe_ratio/g42er4l/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599295734.0
    },
    {
        "author": "pelikana20",
        "body": "Damn I slept on IBM's unusual options activity. It's up 3.8% today but who's even in IBM??",
        "created_utc": 1599081666,
        "id": "g3rskmk",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rskmk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599110466.0
    },
    {
        "author": "guyfawkes202",
        "body": "I have 30 shares of international business machines stock that I’ve been holding since 1979... in fact I set up one of the original COBOLT servers for IBM back in the day.",
        "created_utc": 1599104516,
        "id": "g3t1mit",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3t1mit/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599133316.0
    },
    {
        "author": "barnett9",
        "body": "NVDA has been working on architecture to do compute without CPU's for a while. If they pull it off then they will redefine how computers work at a fundamental level. They are stupidly overbought right now, but long timeline I'd take that gamble.\n\nIBM is also trying to not be a dinosaur and is investing fairly heavily into quantum computing, maybe that.",
        "created_utc": 1599156838,
        "id": "g3voret",
        "permalink": "/r/wallstreetbets/comments/ilygri/30_year_timeline_10k_bet/g3voret/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599185638.0
    },
    {
        "author": "CritSC",
        "body": "I’ve been thinking about buying IBM for weeks because it is the only tech stock with a price less than its IV. I just haven’t had time to do a full DCF and read the 10-K yet.",
        "created_utc": 1599100898,
        "id": "g3svfg2",
        "permalink": "/r/ValueInvesting/comments/ill0c5/ibm_good_investment_or_value_trap/g3svfg2/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1599129698.0
    },
    {
        "author": "LineReact0r1",
        "body": "Ahh the Redhat deal. Yeah i remember reading about that. Probably the best thing they have done in 20 years. Not for Redhat but def for IBM.",
        "created_utc": 1599026152,
        "id": "g3os8ad",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3os8ad/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599054952.0
    },
    {
        "author": "CallinCthulhu",
        "body": "People still use yahoo everyday. It’s the 10th most visited site in the world.\n\nIt takes more than a cornerstone product to grow. Microsoft was weighed down by a continuous stream of awful products, poor acquisitions, botched acquisitions, and no ability to look forward. They were very slowly but surely dying. They were losing market share everywhere.\n\nSatiya changed that and they really embraced cloud, and managed some fantastic acquisitions that they didn’t fuck up after. Without him and the changes they made, they’d be IBM. Flat as fuck",
        "created_utc": 1599280313,
        "id": "g42zvn2",
        "permalink": "/r/stocks/comments/imqb50/selling_my_tesla_stock_yes_im_an_idiot/g42zvn2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599309113.0
    },
    {
        "author": "AvodLooksee",
        "body": "mPulse is the patented leading microgrid managing software, and mVSO is their optimization program that then feeds info to their mPulse software. Not 100% sure if mVSO is patented but their main product mPulse definitely is.\n\nIBM said they're on the leading edge of the cutting edge in a white paper, and seeing as though tesla partnered with them on a microgrid battery I think it's more set in stone than up in the air. 1m in backlogged contracts, and more projected after the acquisition of gridfabric and its clients.",
        "created_utc": 1599164057,
        "id": "g3wadzt",
        "permalink": "/r/stocks/comments/ilz5hw/clsk_on_super_sale_before_the_conference/g3wadzt/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599192857.0
    },
    {
        "author": "Thanks-Feeling",
        "body": "Why don't you just reinvest the dividend from your IBM stock into shares of Apple stock?",
        "created_utc": 1599285445,
        "id": "g437an8",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g437an8/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599314245.0
    },
    {
        "author": "Trumpowell",
        "body": "Anyone see that huge order  on $IBM contracts 6049 traded 130C 8/4\n\nIs $IBM buying tikthot ?",
        "created_utc": 1599102275,
        "id": "g3sxtee",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3sxtee/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599131075.0
    },
    {
        "author": "LePootPootJames",
        "body": "ZM larger market cap than IBM lol",
        "created_utc": 1598971566,
        "id": "g3ledwt",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ledwt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599000366.0
    },
    {
        "author": "TrudeausMakeupArtist",
        "body": "Me: I think IBM is making a pivot to cloud services, but the results are yet to be seen. I'll buy in at $115-118.\n\nMarket: Fuck your plan.",
        "created_utc": 1599063232,
        "id": "g3qfuxm",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qfuxm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599092032.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If IBM changes their name to International Blockchain Machines they’d probably double in value.",
        "created_utc": 1599001219,
        "id": "g3nje0s",
        "permalink": "/r/investing/comments/iks7c7/7_million_worthington_nkla_shares_unlocking/g3nje0s/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599030019.0
    },
    {
        "author": "Furloughedinvester",
        "body": "I also understand that ZM is currently valued higher than IBM. We may not be in a bubble but we are definitely in something.  Maybe the Twilight Zone?",
        "created_utc": 1599100543,
        "id": "g3suslr",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3suslr/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599129343.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If ibm traded at a pe of .00001 I would buy every share and collect millions in dividends for a few thousand dollars. Value absolutely does matter.",
        "created_utc": 1599030192,
        "id": "g3owlhc",
        "permalink": "/r/investing/comments/il13pb/cmv_fundamentals_and_pe_ratio_do_not_and_have/g3owlhc/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599058992.0
    },
    {
        "author": "radioref",
        "body": "IBM, Honeywell, Ford, GE, Kellogg, Exxon, Phillip Morris.",
        "created_utc": 1599415173,
        "id": "g494fcs",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g494fcs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599443973.0
    },
    {
        "author": "doublejay1999",
        "body": "dont understand your downvotes.  this is pretty much where we are right now.\n\nin different times, they would have already have broken them up.  They were very close to breaking up IBM in the 90's and they were no where near the level of dominance of Google &amp; Amazon.\n\nI think they are surviving because they are vital to the economy right at the moment, in the US at least.  But things are changing elsewhere.  Rupert Murdoch has his ass in his hands about content theft by Facebook &amp; Google, and the EU are sniffing round amazon for sharp practice and tax policies.\n\ni still dont believe anyone has the balls or brains to make the case that our economies would be better balanced &amp; stronger without these guys  sucking everything up.",
        "created_utc": 1599046348,
        "id": "g3pezzc",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3pezzc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599075148.0
    },
    {
        "author": "mbr902000",
        "body": "Someone gonna scoop em up, maybe ibm",
        "created_utc": 1599045958,
        "id": "g3pehq4",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3pehq4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599074758.0
    },
    {
        "author": "EithneDraoct",
        "body": "There was probably some repositioning out of Apple and Tesla in to some value plays, but tech will continue to dominate this K, imo. A lot of those value stocks are tech anyway. Look at IBM and INTC.",
        "created_utc": 1599068711,
        "id": "g3qu4ij",
        "permalink": "/r/stocks/comments/il7ojn/rotation_from_tech/g3qu4ij/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599097511.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM, DD, HEALTHCARE, INDUSTRIALS",
        "created_utc": 1599075387,
        "id": "g3rbl88",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3rbl88/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599104187.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Shift to CVS, IBM, MO",
        "created_utc": 1599055092,
        "id": "g3pw7eh",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3pw7eh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599083892.0
    },
    {
        "author": "scot-t-ophile216",
        "body": "I hear a lot about breaking AMZN, but I don't think it'll happen. There are so many competing against AMZN and holds their own against them, like Microsoft, Google, Oracle, Salesforce, IBM, Walmart, Target, etc.",
        "created_utc": 1599016674,
        "id": "g3oew62",
        "permalink": "/r/StockMarket/comments/ikpu4w/walmart_vs_amazon_the_next_big_online_retailer/g3oew62/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599045474.0
    },
    {
        "author": "LineReact0r1",
        "body": "For real what does IBM even do anymore? Havent heard of anything made by them in forever?",
        "created_utc": 1599023834,
        "id": "g3opf7m",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3opf7m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599052634.0
    },
    {
        "author": "Longboarding-Is-Life",
        "body": "I image most established tech companies were. Apple, Microsoft, IBM, etc.",
        "created_utc": 1599099843,
        "id": "g3stk0a",
        "permalink": "/r/investing/comments/ilkw0n/werent_plenty_of_tech_firms_profitable_before_the/g3stk0a/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599128643.0
    },
    {
        "author": "JmotD",
        "body": "In terms of P/S ratio, this time is crazier than  Dot.com bubble.  \n\n Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It's now worth $129.1 billion, more than International Business Machines' (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.",
        "created_utc": 1599046924,
        "id": "g3pfxsm",
        "permalink": "/r/stocks/comments/iks9cg/zooms_market_cap_dashes_past_lowes_phillip_morris/g3pfxsm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599075724.0
    },
    {
        "author": "shadowgyro",
        "body": "I am seeing a lot of posts commenting about AWS  \"subsidizing\" Amazon retail. That idea doesn't look that fleshed out to me. How exactly are people arriving at that conclusion? By looking at the overall profitability? Sure, AWS has a much higher profit margin but that doesn't say anything about whether or not they are subsidizing products on retail. Amazon e-commerce, by design, is reinvesting all the cash back into the business for top-line growth. E-commerce divison itself has so many other businesses within it - profits from TV could be subsidizing shoes or phone cables. We only see the overall profits of the _entire_ e-commerce divison.  Also, the marketplace division is significant chunk of the e-commerce revenue (Amazon only counts the fees they charge 3rd parties as revenue). Profit margins for those will be a lot better than that of the first-party retail business as Amazon doesn't have to carry inventory at all. Also, advertising is another fast growing segment with higher profit-margins.I am not sure if we have enough data to make any comment regarding who is subsidizing what.\n\nAlso, AWS itself faces very serious competition from Azure, GCP, IBM, Oracle etc They are releasing a tonne of new features every year. Why will they not want use the cash from AWS for growing AWS but subsidize toilet-paper? Seems odd to me.\n\nFrom what I understand the profitability of AWS is providing a cover for Amazon from a Wall Street standpoint - \"Here have some profits, let us concentrate on growth.\"\n\nI also don't see how breaking up Amazon into AWS and E-commerce creates room for additional innovation. There is very serious competition for both the businesses.",
        "created_utc": 1599107033,
        "id": "g3t5qqk",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3t5qqk/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599135833.0
    },
    {
        "author": "RedVermont12",
        "body": "Just like IBM has continued to be an amazing investment.",
        "created_utc": 1598979107,
        "id": "g3lywa3",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3lywa3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599007907.0
    },
    {
        "author": "ampatton",
        "body": "It’s typically someone that’s seen as someone that has a financial/business background and “counts beans” by putting a bigger importance on the short term profitability of the company rather than the core engineering principles and/or the long term growth of the company.\n\nOne example of this could be seen from IBM and its past leadership (Louis Gerstner, Sam Palmisano, and Ginni Rometty) which, in my opinion, significantly contributed to IBMs decline. This could also probably apply this to other companies as well, but this is the one that sticks out most in my mind.",
        "created_utc": 1599449051,
        "id": "g4apv31",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4apv31/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599477851.0
    },
    {
        "author": "Ironleg01",
        "body": "Absolutely brilliant write up. Tech equities became really expensive and I was looking for some value alternatives in tech sector as well. HPE definitely stood out but initially I was quite skeptical as I thought this would be company that sells servers or networking equipment. Upon investigating it I'm super intrigued and will open position next week.  \n\nI love that they detached from legacy PC and printers business, I love that early on they spun off their services &amp; consulting business, I love that they offloaded their legacy software business to Micro Focus (poor guys are struggling to sell it now) and I love that they are not competing with Azure or AWS but instead specialise in their own niche. I think that HPE's hybrid cloud solution is probably the best offering in industry right now. IBM, AWS and Google Cloud offer hybrid solutions but it looks like they are very nascent offerings compared to HPE's.\n\nI also love acquisitions they been making. Like you mentioned Silver Peak and Cray (which were very smart acquisitions) but also BlueData (AI &amp; big data analysis), Plexxi (hybrid networking) and others.\n\nAlso, their focus on the edge and hybrid seems to be very well timed. Edge computing is still in its early stages but will undoubtedly expand in the future. A lot of people talk about hybrid as stepping stone for legacy infrastructures which is true. However, with data privacy and data security regulations becoming stricter hybrid will become way more than just stepping stone to full cloud. In Europe it already matters great deal where are you servers located and who can access them.\n\nFinally, HPE feels like it could be story similar to Microsoft. That is, Microsoft was perceived as this legacy, stagnant organization and it was trading at price reflecting that sentiment. Until their cloud offering changed everything. If all goes well with HPE it could be very similar story and brilliant entry point right now.\n\nP.S.\n\nSpeaking of undervalued tech equities. Do you have any thoughts on Seagate? They are trading at quite low multiples and with growing cloud, data storage will have to grow too. On the  other hand HDDs are legacy hardware and they are not very strong at making SSDs yet.",
        "created_utc": 1599389585,
        "id": "g47ynni",
        "permalink": "/r/stocks/comments/igib2a/hpe_transition_to_asaservice_and_path_to_alltime/g47ynni/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599418385.0
    },
    {
        "author": "dreamvilliannm",
        "body": "What price did you buy ibm?",
        "created_utc": 1599279975,
        "id": "g42zfmo",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g42zfmo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599308775.0
    },
    {
        "author": "woahwoahwoahokay",
        "body": "Yeah intel may turn into an ibm. I’m fully aware of that and can always keep an eye out for that. But they still have a lot of potential for short term increases and a lot of enterprises hardware still runs on intel because that’s superior.\n\nTrust me. I live here in Silicon Valley so I know that intel is on the down turn but they can still change things up and come out ahead. I’ve seen bigger comebacks. Who knows. It’s just a small percentage meant to hedge bets. We’ll see. Hopefully it’s just an ibm and not a yahoo that intel ends up turning into.",
        "created_utc": 1599260187,
        "id": "g422hqf",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g422hqf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288987.0
    },
    {
        "author": "_Floriduh_",
        "body": "Agree on ARM and Intel. Huge acquisition that could truly make them a giant if things really do break away from x86. And Intel will be stag-tech case study much like the IBM we know.",
        "created_utc": 1599310974,
        "id": "g44a9yb",
        "permalink": "/r/wallstreetbets/comments/imxoeh/nvidia_will_be_the_first_1_trillion_semiconductor/g44a9yb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599339774.0
    },
    {
        "author": "Spenraw",
        "body": "If I had more cash flow I would put a safe chunk in to this. Part of me thinks Apple and IBM will see a huge jump with 5g and pay good dividends too. Cien seems like a great grab right now, but the dividends could help me grab more 5g stuff in the next year before it really booms",
        "created_utc": 1599162931,
        "id": "g3w70rf",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3w70rf/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599191731.0
    },
    {
        "author": "CallsCallsCallsCalls",
        "body": "\"blue chip\"  tech is going to do well right now. IBM for example. Stuff with dividends that has been hit but with growth still.",
        "created_utc": 1599140855,
        "id": "g3uenb1",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3uenb1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599169655.0
    },
    {
        "author": "CallsCallsCallsCalls",
        "body": "I've been waiting for a correction, and at the end of today I was thinking we definitely bleed tomorrow too. Now AH was so bad I think the pendulum has to swing back already to some degree, on some stocks.\n\nGood \"blue chip\" stuff and more mature tech stocks with dividends have been waiting to explode up. Every time the bubble stuff reverses a bit, stocks like IBM and INTC have had huge moves up relative to their normal betas/IV (options on IBM for $1 OTM have gone up 700%+ multiple times intraday for relatively small moves).\n\nThose type of stocks haven't gone up during the pandemic at all despite positive earnings/outlook and minimal disruption. Money has a lot to flow into tomorrow, it just won't be the usual stuff.",
        "created_utc": 1599178233,
        "id": "g3xe6vz",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xe6vz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599207033.0
    },
    {
        "author": "Kangaroos2020",
        "body": "Rumors of IBM acquiring Cloudera have been around for awhile, CLDR would go to moon if so",
        "created_utc": 1598987982,
        "id": "g3mnl0k",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3mnl0k/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599016782.0
    },
    {
        "author": "Smooothoperat0r",
        "body": "Just a sticking point here: GE and IBM had huge cash flows for decades that led to a sharp decline in stock price because they were cash rich but growth poor. Today both are miniature versions of their former behemoth selves.",
        "created_utc": 1599014965,
        "id": "g3obwlf",
        "permalink": "/r/wallstreetbets/comments/ikrq8w/gme_yolo_monthstart_update_sep_1_2020/g3obwlf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599043765.0
    },
    {
        "author": "khizoa",
        "body": "not to be an ass, but no relevance whatsoever. esp since OP asked about EXPLOSIVE GAINS, in the next FEW YEARS. they're not even relevant RIGHT NOW\n\noil companies will eat shit\n\nsears is already eating shit\n\nibm is pretty stagnant unless they innovate to keep up with tech\n\ngoodyear, i guess they can keep making tires or whatever they do, as there will always be cars. but the only explosive gains will be the random trump pump that theyre being treated unfairly",
        "created_utc": 1598980418,
        "id": "g3m2qqb",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3m2qqb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599009218.0
    },
    {
        "author": "redroverster",
        "body": "IBM, Mobil, Exxon, Sears, Goodyear",
        "created_utc": 1598961371,
        "id": "g3krlu3",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krlu3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990171.0
    },
    {
        "author": "Itsawhazzyitsawhoozy",
        "body": "I bought some stock on June 1st, not the best day price wise but it’s the stock I plan to hold the longest out of my whole portfolio, except for MSFT maybe. I made a DD for myself and made a brief summary around April. Most of it is based on their 10-K last year and their first 10-Q of the year. The key here is that this has been seen as a dinosaur for the past decade, due to lack of innovation, terrible management decisions (crazy high EPS and a buyback program that should have been cut long ago), and recruiting issues. A new CEO (Arvind Krishna) and a switch to the cloud (and quantum computing for the 2030s at least) are the key changes that could drive change. Sorry if it’s a bit messy, was not meant to be posted when I wrote it : \n\nIBM : New CEO Arvid Krishna has my trust, hope he will change top and mid tier management (which did weird accounting tricks like the pseudo Lenovo « sale/buy », laid off workforce for no reason, did not R&amp;D enough, focused on business services and consulting too much, had the crazy 20$ EPS goal, etc…). Krishna pushed Red Hat acquisition (open source enterprise software, will allow them to become hybrid cloud providers, hybrid cloud is interoperable (BFF example), scalable (ERP switch to 3rd parties), portable, and secure (user data still in private cloud)). Krishna was senior VP for cloud and cognitive software. \nIBM has switched industries several times throughout its life : time clocks, then tabulating machine, then typewriter, then mainframe (good changes), then personal computers (good initially but then poor because used competitors’ chips), etc… Cloud/AI could be their next successful switch (1/3rd of revenue in 2019, still increasing). Quantum Computing too, as they’ve strongly positioned themselves as industry leaders, but that’s in the very, very long run.\nWhile not the most important aspect, company is a dividend aristocrat (increasing div payout for 25 years), but what matters is that div payment was never removed, even though I think it should have been decreased during the struggles of the 2010s and instead reinvested in R&amp;D, they should have also paused their share buyback program. Financials : P/E around 10 (very good for a tech company), P/BV is 5.5 (good for a tech company, especially one transitioning to less tangible assets), net income slowly increasing, current ratio of nearly 1 at end of 03/31 which is decent given Red Hat acquisition and coronavirus, D/E is 2.62 (that one is indeed bad, but they got cash I guess, still not great).",
        "created_utc": 1599125472,
        "id": "g3tpsfi",
        "permalink": "/r/ValueInvesting/comments/ill0c5/ibm_good_investment_or_value_trap/g3tpsfi/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1599154272.0
    },
    {
        "author": "FireEraser",
        "body": "Why would any of those companies want to buy IBM?",
        "created_utc": 1599070284,
        "id": "g3qy3t7",
        "permalink": "/r/stocks/comments/ilby5h/ibm_as_takeover_target/g3qy3t7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599099084.0
    },
    {
        "author": "shatterkneesinc",
        "body": "cmon cscso even ibm mooned today",
        "created_utc": 1599069693,
        "id": "g3qwn2w",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qwn2w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599098493.0
    },
    {
        "author": "Lambotherambo",
        "body": "You said it could never get to the size of google fairly explicitly. Google is already a dinosaur and in 10 years time will be viewed as an IBM of sorts. AWS is not blocked from being the next current “Google” at all",
        "created_utc": 1599074446,
        "id": "g3r8zn3",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3r8zn3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599103246.0
    },
    {
        "author": "Jarlaxle_rigged_it",
        "body": "NFLX was starting a great run before this fing shit. even managed to try to break up yesterday while everything was crashing. dd plz on that solid stock&lt;3\n\nINTC ofc (all that insider buying) \n\nSomehow AVGO/IBM barely felt this thing, might be good tech+cyclical trades..",
        "created_utc": 1599250717,
        "id": "g41b97v",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g41b97v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599279517.0
    },
    {
        "author": "sirajgb",
        "body": "Airbus, ibm (people make fun of it but they are one of the leaders on developing quantum computing, including the prog language), Ericsson (5g play) Eon",
        "created_utc": 1599241794,
        "id": "g40k92i",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g40k92i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599270594.0
    },
    {
        "author": "soupmonster40",
        "body": "lol yeah. I inverse WSB.\n\n\"intel is the next IBM\" --&gt; buy intel &amp; Micron\n\n\"oil is dead\"--&gt; buy oil\n\n\"NET sucks it's a meme stock\" --&gt; buy NET",
        "created_utc": 1599261430,
        "id": "g4256lr",
        "permalink": "/r/wallstreetbets/comments/imp0dz/insights_on_my_portfolio_please/g4256lr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599290230.0
    },
    {
        "author": "Kramer-Melanosky",
        "body": "Your comparison is absurd. Microsoft would have become another IBM if not for Sathya Nadela. \n\nIntel is lagging in technology for quite a while. Without any positive news in near future, it's a gamble. It can be become next Microsoft or IBM.\n\nMobile Eye I good, but with chances of their major revenue going down and gap between ADM widening over next few years. I don't feel it's worth it.",
        "created_utc": 1599424001,
        "id": "g49kgv5",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49kgv5/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599452801.0
    },
    {
        "author": "bitflag",
        "body": "I think Intel is already close to being IBM. They consistently gave up on new markets (ie mobile, high end GPU, modems) because it is initially small and expensive, which let the competition take those juicy new trends while Intel got stuck the same old x86 chips it's been doing for 4 decades.\n\nManufacturing problems is only salt on the wound. It's accelerating the decline because it was Intel moat in it's core business.",
        "created_utc": 1599448655,
        "id": "g4apa51",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4apa51/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599477455.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Bit of a personal anecdote here:\n\nSo I have a degree in IT with a focus on Computer Networking.\n\nI once interviewed for IBM because they had positions open for Network Admins.  Unfortunately, when I sat down and looked over their list of jobs I discovered that they were only looking for senior level positions (something they did not mention in the email they sent to my university).\n\nI decided to interview anyway because I was already there in suit and tie so I wasn't about to get all dressed up for nothing.\n\nThe interview went well, but the guy told me he just didn't have anything for me at the time.\n\nI decided to walk around afterwards and saw a guy interviewing for entry level programmers.  My campus did not offer a Software degree (they offered it at a different campus), but I did have to take 9 credits in basic programming which was Java, C++, and HTML.  I had already taken the Java and C++ classes.\n\nI sit down with the guy and we get to talking.\n\nHe asks my background in coding.  I tell him one intro in Java and C++ so far.\n\nHe asks why am I interviewing if my degree is not focused on coding.  I tell him because those two classes opened my eyes to something that I didn't even know I wanted before.  I love creating stuff with code, I find it cathartic to sit and stare at code, getting lost in it while trying to figure out where my errors are, the absolute joy of finally getting it to compile and run.  I even started to make some basic programs at home in my free time.\n\nHe asks me if I have any of my work to show him.  I did not bring any copies of my code because I wasn't even thinking about the possibility of interviewing for any other positions (let this be a lesson to anyone who's still getting their degree, bring everything!).\n\nI tell him I did have it on a thumb drive that I carry around in my briefcase, but of course he waves his hand and says that's a security issue (totally agreed).\n\nHe asks me what a function is.  I draw a blank.  I ended up stammering out something like, \"it's the part of the code that does stuff\".  Not necessarily wrong, but more of an ELI5 definition.\n\nHe shows me some code and asks what I can decipher from it.  It's a function that takes a variable, runs it through a formula, returns a variable, and then loops 4 more times using the new return variable each time, and finally shows a set of the return variables at the print out.  He confirmed that I was right.\n\nHe asks me what that sets of numbers is called.  Obviously it's an array, and I had heard the term before, but again I did not know at the time.  He frowns and says something along the lines of, \"You really don't know basic terminology.  You should work on that.\"\n\nWe shook hands and parted ways, never got a call back.  Now, I know I messed up by not having some of my work printed out, and not being up on the terminology.  But it really rubbed me raw that this guy was so hung up on terminology, knowing that coding was like 5% of my entire degree, and yet I still had a basic working knowledge of programming to at least be able to read and understand what was going on, and that I was passionate enough about it to go home and write some basic programs of my own.\n\nNow I don't know that the lack of terminology was the ultimate reason I was turned down.  I do know that they were looking to start up a class that would take about 3 years to go through, and they were going to teach a proprietary language that was similar to Java.  Obviously, the terminology would have been brought up again multiple times in that 3 year program.  The only clue I had for why I was turned down was the lack of lingo.\n\nI am now a manager at a FinTech company, and I don't ask \"lingo\" questions of interviewees.  I want to know if they understand the meat and potatoes of what the job entails because, to me, that means so much more.  Lingo will happen over time as they do the job.\n\nI'm not saying that is all the OP was concerned about in their interviews, but they certainly seem to think it's a flaw in an interviewee that makes them unsuitable for hiring.",
        "created_utc": 1599457511,
        "id": "g4b12z3",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4b12z3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599486311.0
    },
    {
        "author": "Lazybumm1",
        "body": "I'm very bullish on NVIDIA but I think you are overestimating some of its competitive advantages. Raytracing will probably become industry standard sooner or later and supported across either platform. DLSS is something AMD or any other company with a bunch of ML engineers and money can replicate given some time. \n\nIt's not impossible for other companies to replicate or immitate or substitute some of those technologies / products. AMD is certainly catching up and will carve off some fractions of the market in the AI/ML &amp; datacenter businesses.\n\nThe ARM acquisition, if it happens, will confer a competitive advantage like no other. As an NVDA stockholder I wish this happens. As a Brit working in and loving tech, I am slowly dying on the inside... \n\nSomething to remember is that this is a fast expanding market and not a saturated one, there's room for multiple players to grow and win at the same time. \n\nThat being said, I still think Intel will likely be the next IBM. Is it gonna tank overnight? No, and there will probably be plenty of rallies to make money off, but long term I wouldn't look to hold.",
        "created_utc": 1599305308,
        "id": "g440s54",
        "permalink": "/r/wallstreetbets/comments/imxoeh/nvidia_will_be_the_first_1_trillion_semiconductor/g440s54/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599334108.0
    },
    {
        "author": "ThemChecks",
        "body": "This seems pretty fair honestly. IBM isn't a bad dividend stock for what it's worth.",
        "created_utc": 1599308082,
        "id": "g445t5l",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g445t5l/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599336882.0
    },
    {
        "author": "Art0002",
        "body": "You asked a decent question so I thought you deserved a thoughtful response. \n\nDo old companies like IBM and newer companies and companies that are in focus now. \n\nI read a post by someone trying to put a valuation on SPCE. He had to make assumptions and he pointed them out. It was a good read. I’m not sure what he ultimately concluded but I dabble with SPCE options and I’ve made a few bucks. \n\nI think your endeavor will improve your future trading results. There is no downside. \n\nAnother thought is adding a layer of technical analysis to add even more signals as to when to buy or sell. There is analysis paralysis but when fundamental and technical analysis lines up ...\n\nI don’t want to ramble but I trade differently than you. You are young and I am retired. What made early retirement possible was increasing my dollar cost averaging (DCA) into the 08/09 crash. I cut spending and DCA’ed into it. It was brutal. I was fully invested. I raised my 401k contributions. \n\nIt paid off and took me over the hump. Don’t underestimate DCA.",
        "created_utc": 1599176554,
        "id": "g3x9m49",
        "permalink": "/r/investing/comments/im2uuw/learning_valuation/g3x9m49/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599205354.0
    },
    {
        "author": "Spenraw",
        "body": "very good to know, I already own telus so maybe time to put it in apple, but IBM AI will use 5g alot",
        "created_utc": 1599186866,
        "id": "g3xu28l",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3xu28l/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599215666.0
    },
    {
        "author": "ThreeEyeJedi",
        "body": "Exactly they never used the products they're talking about. What tech company you know uses Teams? Maybe some corporate giant like IBM but no one is actually using Teams",
        "created_utc": 1599065571,
        "id": "g3qlx8h",
        "permalink": "/r/wallstreetbets/comments/ijpbec/slack_work_discord_for_grownups_and_why_this_saas/g3qlx8h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599094371.0
    },
    {
        "author": "chawpyx5",
        "body": "Right there with ya. I also have IBM 131 9/11s that were up 390%. They are literally break even at 0% right now.",
        "created_utc": 1599213567,
        "id": "g3yqndt",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3yqndt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599242367.0
    },
    {
        "author": "RumLovingPirate",
        "body": "Retail investors *used* to not have an affect on the market up until the past year or so. I mean, being a retail investors used to me call your local stock broker and asking for a few shares of that hot new stock called ibm. Mainframes are the future!\n\nThen came online trading and even then, most people who had been investing saw little reason to leave their stock broker and fees started at like $30 a trade and we're executed slowly.\n\nEven with *super low*  $10 trades making 30 trades a day was expensive and people didn't focus on in.\n\nIn comes gen z who are the side hustle generation, $0 fast trades, tons of youtube and tiktok vids on how to trade and make $1k a day, and we're seeing the long tail effect of a lot of people with low volume adding up to a lot of the overall trade volume. \n\nRetail investors absolutely affect things now, and they absolutely need to realize what it's like to get burned.",
        "created_utc": 1599222872,
        "id": "g3z49ks",
        "permalink": "/r/investing/comments/imeakd/cnbc_robinhood_traders_need_to_get_burned_a_bit/g3z49ks/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599251672.0
    },
    {
        "author": "trader9899",
        "body": "TSLA is the most watched stock from retail along with Apple. They can make a business selling their own stock and would bring in 2 billion a year for the next 100 year. I don’t understand what is the allure of having to short Tesla when there are a bunch of legacy boomer stock you can short. IBM/XOM/mall stock for easy money",
        "created_utc": 1599270249,
        "id": "g42kch8",
        "permalink": "/r/investing/comments/imp0rv/tesla_stock_could_tumble_over_90_says_analyst/g42kch8/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599299049.0
    },
    {
        "author": "Lazybumm1",
        "body": "Yes not talking short term, the IBM example is a good one. That's what I meant.\n\nThey can pump prices with buybacks anytime too.",
        "created_utc": 1599260058,
        "id": "g422645",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g422645/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288858.0
    },
    {
        "author": "DankMemelord25",
        "body": "Intel is the next IBM",
        "created_utc": 1599090971,
        "id": "g3scxzu",
        "permalink": "/r/wallstreetbets/comments/ilb2rx/need_more_shit_tech/g3scxzu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599119771.0
    },
    {
        "author": "roox911",
        "body": "yeah, tough to say - i'm bullish enough on it that i think it'll be up 10% from here before the end of the year, assuming the market doesn't keep black swanning from here of course...\n\nI have IBM in my sights as well - just waiting to see if there is a better entry in the coming days :)",
        "created_utc": 1599163120,
        "id": "g3w7l7x",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3w7l7x/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599191920.0
    },
    {
        "author": "nicename09",
        "body": "Intel ruined itself by hiring mediocre tech talent. Maintenance engineers who think they're innovators. What a joke. Years of onboarding average employees gets you average results. Shocking! Gotta squeeze those margins from somewhere I guess. Now its a perpetual cycle of complacency and ineptitude. At this point you could hand intel the market leading product in self driving tech and they'd blow that lead within 16 months. They want to be IBM. No amount of wishful thinking from the outside can change that.",
        "created_utc": 1599459847,
        "id": "g4b3tjt",
        "permalink": "/r/wallstreetbets/comments/inrj01/intel_the_big_picture_and_why_im_bullish_on_it/g4b3tjt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599488647.0
    },
    {
        "author": "Ironleg01",
        "body": "Unless Intel gets new CEO they are going to do just as well as IBM did. They also were massive company once.",
        "created_utc": 1599468540,
        "id": "g4bch3b",
        "permalink": "/r/wallstreetbets/comments/io1van/amd_will_because_of_intels_presentation/g4bch3b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599497340.0
    },
    {
        "author": "Furloughedinvester",
        "body": "IBM?",
        "created_utc": 1598959320,
        "id": "g3kotnr",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kotnr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598988120.0
    },
    {
        "author": "Immediate_Student_92",
        "body": "ah okay, but why is that. Both azure and aws are better than the competition, which is google baba IBM etc, all the giant techs. And cloud is still in its infancy. What makes you think theyll be replaced, at least in that industry.",
        "created_utc": 1599187582,
        "id": "g3xv9yt",
        "permalink": "/r/stocks/comments/iltt53/are_we_in_a_covidtech_bubble_heres_how_to_tell_my/g3xv9yt/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599216382.0
    },
    {
        "author": "MattSurprise",
        "body": "IBM",
        "created_utc": 1599354481,
        "id": "g46sq5w",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g46sq5w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599383281.0
    },
    {
        "author": "woahwoahwoahokay",
        "body": "No trust me. I agree. I think AMD is the superior product at this point and my stocks reflect that. But intel is undervalued in the short term based on reactionary sell offs due to bad news. It’s undervalued. They have a lot of talent. I live close to intel. I know a lot of people who work there. They’re not going to go under overnight and they don’t ONLY sell chips. They’ll pivot and react accordingly. If I’m wrong then I only lose a small percentage of money, if I’m right, then I make serious gains. It’s meant to mitigate risk. Buying into intel is meant to help diversify my portfolio and I honestly feel they are undervalued at this point. Should it have dipped? Yes. By that much? No. Intel is still fucking intel. They will continue to do well for the coming years.\n\nCould they turn into an ibm? Yeah maybe. But by then I’ll be out of the stock. But the revamped logo and some updates to hardware is enough to push the needle.",
        "created_utc": 1599259754,
        "id": "g4215i2",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g4215i2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288554.0
    },
    {
        "author": "sk169",
        "body": "Yes. My whole thesis is based on Intel becoming Microsoft rather than IBM. \n\nI don't have a crystal ball and neither do you. I'm betting on Intel becoming Microsoft rather than IBM.",
        "created_utc": 1599424176,
        "id": "g49ks6f",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49ks6f/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599452976.0
    },
    {
        "author": "ATLiving",
        "body": "Intel is like IBM. Maybe in 10 years it’s great again or maybe in 10 years it’s dead.",
        "created_utc": 1599432597,
        "id": "g49zlvb",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49zlvb/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599461397.0
    },
    {
        "author": "undecidedmarketmaker",
        "body": "I agree with all your points, except \n\n&gt;The kind of employees has not really mattered about how the company as a whole does\n\nIt matters a lot when it comes to the bread and butter of processors. No innovation means death in this industry. While poorly run companies can limp (and limp well) for years - see Oracle, IBM, etc - is Oracle really going to be a company you want to put your money in? \n\nGiven what I know about INTC, I don't think INTC is going to be around in 20 years. Not in its current form, at least. The part I'm keeping a close eye on is Intel Capital, which they use to squelch and/or gobble up competition - that might keep them alive forever as a business model, but I don't like it. I guess I'll be proven wrong when I'm an old man lol but that's my two cents.",
        "created_utc": 1599442054,
        "id": "g4aeq16",
        "permalink": "/r/wallstreetbets/comments/inrj01/intel_the_big_picture_and_why_im_bullish_on_it/g4aeq16/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599470854.0
    },
    {
        "author": "upvotemeok",
        "body": "Can ibm pull a msft over next decade and but 1t?",
        "created_utc": 1599428820,
        "id": "g49t0i5",
        "permalink": "/r/stocks/comments/imfn3y/down_dayselloffpanicdont_panicwhat_are_you_buying/g49t0i5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599457620.0
    },
    {
        "author": "MaximusHippocratus",
        "body": "IBM",
        "created_utc": 1599123215,
        "id": "g3tnqz9",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3tnqz9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599152015.0
    },
    {
        "author": "dmitsuki",
        "body": "IBM can make good RISC CPU'S, PPC is still an option though devs prefer completely off the shelf nowadays.",
        "created_utc": 1599124590,
        "id": "g3tozi5",
        "permalink": "/r/wallstreetbets/comments/ilfn28/any_plays_for_nvidia/g3tozi5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599153390.0
    },
    {
        "author": "wearsgreensometimes",
        "body": "I sold 40 of those 0.80 contracts. doubled my money from that morning based off a tip here (should have tripled, but missed a good buy). basically rode the Tiger Lake chipset talk hype, sold before they dipped back down (but were still up 50%). \n\nI hope yall do well but used to work at a company in that industry and I don’t know how much it will actually rise beyond that based off what I remember. Intel is a boomer tech stock like IBM, Cisco, and Lenovo...of course they could always pull off an MSFT type revival but who knows",
        "created_utc": 1599132779,
        "id": "g3ty85v",
        "permalink": "/r/wallstreetbets/comments/ilcywi/intc_gang_wya_intc_918_50c_56c/g3ty85v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599161579.0
    },
    {
        "author": "neekogo",
        "body": "I hear ya. My strategy lately has been similar to you. Well known companies (MFST, WM, DIS). A few companies I expect to be making strides in the coming years (IBM, CSCO, CVS). A few risk shots (F, AFL,T). And a couple of solid ETFs to round it out. Yesterday I was 16% up. Right now I'm still 8% 😄",
        "created_utc": 1599147602,
        "id": "g3uyesm",
        "permalink": "/r/investing/comments/ilgy50/finally_got_a_stake_in_aapl/g3uyesm/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599176402.0
    },
    {
        "author": "MaximusHippocratus",
        "body": "IBM boys. It just pumped after a bull flag forming for weeks. IV is still low. Get in while you can. Before the COVID crash it was pumping. Hasn't cut dividend through the pandemic.",
        "created_utc": 1599075222,
        "id": "g3rb57y",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3rb57y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599104022.0
    },
    {
        "author": "Flaky-Bad9954",
        "body": "Oh I didn't make it clear. I am not saying only MSFT will be replaced. I think all the giant tech you see today will be replaced... Like how IBM was being replaced...",
        "created_utc": 1599177459,
        "id": "g3xcd8q",
        "permalink": "/r/stocks/comments/iltt53/are_we_in_a_covidtech_bubble_heres_how_to_tell_my/g3xcd8q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599206259.0
    },
    {
        "author": "Turtlesaur",
        "body": "Lol by who, IBM?",
        "created_utc": 1599078818,
        "id": "g3rl5zb",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rl5zb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599107618.0
    },
    {
        "author": "hidden-carrot",
        "body": "ARKK\nBABA\nBUD\nCARR\nCZR\nIBM\nMJ\nMSFT\nNFLX\nPlanet 13\nSE\nTSM\nVGT\nVTI\nWMT\nXLY",
        "created_utc": 1598979893,
        "id": "g3m17ni",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g3m17ni/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599008693.0
    },
    {
        "author": "a_nobody_really_99",
        "body": "Well, I’d have to say Cisco is doing much better than IBM and continues to do so.",
        "created_utc": 1598969356,
        "id": "g3l8l0d",
        "permalink": "/r/investing/comments/ijzxrp/tesla_opens_up_at_440_post_split_and_soars_12_to/g3l8l0d/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598998156.0
    },
    {
        "author": "r3dd1t0rxzxzx",
        "body": "Saying “they all have software” shows how little understanding you have of each automakers level of capability and focus. It’s like saying Microsoft and IBM both do software so whatever - pretty crazy conclusion.",
        "created_utc": 1598997594,
        "id": "g3nbu81",
        "permalink": "/r/investing/comments/ik4ehw/tsla_is_now_the_tenthlargest_company_via_market/g3nbu81/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599026394.0
    },
    {
        "author": "sc0tt_1990",
        "body": "Their new chip is a redux of the AMD FX series.  It's hilarious how things have come full circle.  Wonder if you can cook an egg on it.\n\nIntel is a shit company now.  IBM 2.0 until proven otherwise.  They don't spend on R and D, look it up, don't just listen to me.  Or hell, look at how AMD is going to eat their lunch 6 months from now when Ryzen 4 is out.",
        "created_utc": 1598998457,
        "id": "g3ndvjo",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ndvjo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599027257.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Look up IBM quantum computing, Redhat acquisition, cloud, software business transition from their legacy hardware business",
        "created_utc": 1599025859,
        "id": "g3orvyc",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3orvyc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599054659.0
    },
    {
        "author": "Troll_Sauce",
        "body": "Buy them out a ways so you have some flexibility. Er is a huge wildcard. I still think it's primed for an IBM acquisition sooner or later.",
        "created_utc": 1599026970,
        "id": "g3ot5xn",
        "permalink": "/r/wallstreetbets/comments/ikm425/techcalls_are_easy_gains/g3ot5xn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599055770.0
    },
    {
        "author": "Wearahat02",
        "body": "Not sure but the market thinks it will\nThey did quadruple their revenues YoY and double their revenues QoQ.\n\nIf they can maintain this rate of growth for just one year, their revenues will be 7.5billion next FY\n\nTheir operating expenses are ridiculously low I guess it doesn't take much to run a video conference app\n\nThat means 3 billion net income in 2 years\n\nGrowth can't be that easy can it? \n\nLiterally a company that earned 5 million last comparative quarter, earns 186mil this quarter and at this rate possibly almost 1 billion next years quarter.\n\nAlso I'm amazed that companies that have been around for a long time like Boeing, IBM, Starbucks, Lockheed, 3M, American Express, Citigroup are smaller than a video conferencing company that was worth just 17bn last year.",
        "created_utc": 1598970260,
        "id": "g3laybc",
        "permalink": "/r/stocks/comments/ikgc75/rstocks_daily_discussion_technicals_tuesday_sep/g3laybc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598999060.0
    },
    {
        "author": "AnonymousAstro",
        "body": "I sold a naked 9/4 $410c at close as a part of a strangle because an “$85 move up in a day is impossible”. I sold it for $70 and ate a $2800 loss this morning.\n\n**One big lesson learned:** people will buy up everything and try to make it the new TSLA. ZM has EPS of $.92 and a current P/E ratio of $1700ish. It’s now worth more than IBM.\n\nAs long as “stonks go up”, I’ll stick to selling puts only.",
        "created_utc": 1598993396,
        "id": "g3n27ob",
        "permalink": "/r/options/comments/iknpp2/zm_5246_up/g3n27ob/",
        "score": 26,
        "subreddit": "options",
        "created": 1599022196.0
    },
    {
        "author": "teegolf1",
        "body": "Zoom is way overpriced as well. Here’s a quote from BARRON’S today.............  “Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It’s now worth $129.1 billion, more than International Business Machines’ (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.”",
        "created_utc": 1599003033,
        "id": "g3nnczg",
        "permalink": "/r/stocks/comments/ikqq4q/tesla_hype_is_fun_until_its_not/g3nnczg/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1599031833.0
    },
    {
        "author": "WeberStateWildcat",
        "body": "I'd certainly rather have Apple over IBM, but if I had 100+ shares of IBM, I'd investigate selling covered calls and collect some premium on the sale. And maybe premiums plural if it takes a few times for the buyers of said calls to succeed in hitting the strike price and exercising the option.",
        "created_utc": 1599280285,
        "id": "g42zuds",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g42zuds/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1599309085.0
    },
    {
        "author": "TrenAndOptions",
        "body": "You’re an idiot if you think IBM is dying. They’re leading the charge with quantum computing, even more than google",
        "created_utc": 1599023464,
        "id": "g3ooxye",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ooxye/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599052264.0
    },
    {
        "author": "CptTonyStark",
        "body": "ppl who invest in cryp-to as a hyperinflation hedge in case dollar goes bust don't even realize that almost all cry-pto-currencies like shitcoin and airer are based on elliptic curve digital signature algorithm cryp-to-graphy, which is not quantum secure. The day quantum computers become powerful enough, which will happen in maybe a decade thanks to google, IBM, and MSFT, all coins will become worthless overnight. Imagine investing in something thinking that its' like gold and will keep value even in an apocalypse, not knowing that it's not even future proof just 1 decade from now. \n\n&amp;#x200B;\n\nNow, quantum secure cryp-to-graphy algorithms do exist but it's impossible to change the underlying block-chains and the algos driving them, by design. Quantum computers breaking encryption won't be a big problem to systems with central authority because they can just overhaul the encryption infrastructure. Not so much with coins, because the whole purpose of making them was to make sure no one tampers with the underlying block-chain and any algos driving it once it's up and running.",
        "created_utc": 1599336577,
        "id": "g45s0vr",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g45s0vr/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599365377.0
    },
    {
        "author": "TrenAndOptions",
        "body": "“Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.“",
        "created_utc": 1599023318,
        "id": "g3oor4k",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oor4k/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599052118.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Imagine all the dumb fuck analysts who said Amazon was not a buy back in the 90s and recommended IBM, CSCO, and INTC instead. \n\nThat's how I feel about all the analysts with bearish targets on TSLA",
        "created_utc": 1599285296,
        "id": "g4372xo",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g4372xo/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599314096.0
    },
    {
        "author": "MeteorMash101",
        "body": "IBM",
        "created_utc": 1599173113,
        "id": "g3wzbe6",
        "permalink": "/r/stocks/comments/ilwoqa/careful_with_thinking_this_is_the_only_dip/g3wzbe6/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1599201913.0
    },
    {
        "author": "DankMemelord25",
        "body": "Intel is the new IBM, change my mind 🤔🤔🤔",
        "created_utc": 1599024513,
        "id": "g3oq9t6",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oq9t6/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599053313.0
    },
    {
        "author": "infinitelimits00",
        "body": "I just noticed the Boomer Index actually crushed today. \n\nKO, IBM, INTC all massively outperforming today. KO back to its post-COVID highs (since March 23). CSCO, DIS, BA, RTX, T also all up. And XLU was up 3%, which is a lot for a defensive utilities sector.",
        "created_utc": 1599091636,
        "id": "g3seg2j",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3seg2j/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599120436.0
    },
    {
        "author": "sandpipa78",
        "body": "Same, can’t believe this shit. How in the hell ZM is worth more than IBM?",
        "created_utc": 1599001380,
        "id": "g3njqwz",
        "permalink": "/r/wallstreetbets/comments/ikt5rw/zoom_porn/g3njqwz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599030180.0
    },
    {
        "author": "dryu12",
        "body": "Zoom is valued more than IBM. Let that sink into your retarded brain.",
        "created_utc": 1599055486,
        "id": "g3px4uq",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3px4uq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599084286.0
    },
    {
        "author": "Cwc123",
        "body": "ardes Michel11 hours ago\nYes....But.....Debt is huge for IBM......And they are not alone...Competition is also huge for IBM......Then a growth company is always richly priced......The world is the limit for ZM........No frontiers.......Sky is the limit.....ZM will reach 1000 usd if they continue to beat....\n\nWhy the f did i buy puts on this with ppl like this on the other side",
        "created_utc": 1599093636,
        "id": "g3si419",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3si419/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599122436.0
    },
    {
        "author": "infinitelimits00",
        "body": "Lol if you guys love the DOW, may I introduce you to the Boomer Index. \n\nKO, T, JNJ, BA, NKE, MCD, INTC, IBM, and CSCO (although INTC is catching on here...and the last three technically are correlated with tech).\n\nI like never see anyone trade NKE calls but it's actually a good company.",
        "created_utc": 1599182161,
        "id": "g3xln4y",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xln4y/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599210961.0
    },
    {
        "author": "sc0tt_1990",
        "body": "lol at Intel.  the new IBM.",
        "created_utc": 1599063974,
        "id": "g3qhsh2",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qhsh2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599092774.0
    },
    {
        "author": "wildcat990",
        "body": "Everyone is on TSLA S&amp;P watch -  what about ZM?  It’s eligible now -  https://www.barrons.com/articles/zoom-is-now-worth-more-than-ibm-next-stop-the-s-p-500-51598966331",
        "created_utc": 1598993925,
        "id": "g3n3og7",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3n3og7/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599022725.0
    },
    {
        "author": "ReflectAA",
        "body": "The first and most important thing you have to learn about the stock market is that the overwhelming majority of people have no clue what they’re talking about. \n\nPeople said Tesla was inflated when it had a market cap of 1 billion. And they were probably telling you to sell it and buy GE or IBM instead.",
        "created_utc": 1599266934,
        "id": "g42er4l",
        "permalink": "/r/stocks/comments/imruf3/apple_and_pe_ratio/g42er4l/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599295734.0
    },
    {
        "author": "pelikana20",
        "body": "Damn I slept on IBM's unusual options activity. It's up 3.8% today but who's even in IBM??",
        "created_utc": 1599081666,
        "id": "g3rskmk",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rskmk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599110466.0
    },
    {
        "author": "guyfawkes202",
        "body": "I have 30 shares of international business machines stock that I’ve been holding since 1979... in fact I set up one of the original COBOLT servers for IBM back in the day.",
        "created_utc": 1599104516,
        "id": "g3t1mit",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3t1mit/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599133316.0
    },
    {
        "author": "barnett9",
        "body": "NVDA has been working on architecture to do compute without CPU's for a while. If they pull it off then they will redefine how computers work at a fundamental level. They are stupidly overbought right now, but long timeline I'd take that gamble.\n\nIBM is also trying to not be a dinosaur and is investing fairly heavily into quantum computing, maybe that.",
        "created_utc": 1599156838,
        "id": "g3voret",
        "permalink": "/r/wallstreetbets/comments/ilygri/30_year_timeline_10k_bet/g3voret/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599185638.0
    },
    {
        "author": "CritSC",
        "body": "I’ve been thinking about buying IBM for weeks because it is the only tech stock with a price less than its IV. I just haven’t had time to do a full DCF and read the 10-K yet.",
        "created_utc": 1599100898,
        "id": "g3svfg2",
        "permalink": "/r/ValueInvesting/comments/ill0c5/ibm_good_investment_or_value_trap/g3svfg2/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1599129698.0
    },
    {
        "author": "LineReact0r1",
        "body": "Ahh the Redhat deal. Yeah i remember reading about that. Probably the best thing they have done in 20 years. Not for Redhat but def for IBM.",
        "created_utc": 1599026152,
        "id": "g3os8ad",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3os8ad/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599054952.0
    },
    {
        "author": "CallinCthulhu",
        "body": "People still use yahoo everyday. It’s the 10th most visited site in the world.\n\nIt takes more than a cornerstone product to grow. Microsoft was weighed down by a continuous stream of awful products, poor acquisitions, botched acquisitions, and no ability to look forward. They were very slowly but surely dying. They were losing market share everywhere.\n\nSatiya changed that and they really embraced cloud, and managed some fantastic acquisitions that they didn’t fuck up after. Without him and the changes they made, they’d be IBM. Flat as fuck",
        "created_utc": 1599280313,
        "id": "g42zvn2",
        "permalink": "/r/stocks/comments/imqb50/selling_my_tesla_stock_yes_im_an_idiot/g42zvn2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599309113.0
    },
    {
        "author": "AvodLooksee",
        "body": "mPulse is the patented leading microgrid managing software, and mVSO is their optimization program that then feeds info to their mPulse software. Not 100% sure if mVSO is patented but their main product mPulse definitely is.\n\nIBM said they're on the leading edge of the cutting edge in a white paper, and seeing as though tesla partnered with them on a microgrid battery I think it's more set in stone than up in the air. 1m in backlogged contracts, and more projected after the acquisition of gridfabric and its clients.",
        "created_utc": 1599164057,
        "id": "g3wadzt",
        "permalink": "/r/stocks/comments/ilz5hw/clsk_on_super_sale_before_the_conference/g3wadzt/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599192857.0
    },
    {
        "author": "Thanks-Feeling",
        "body": "Why don't you just reinvest the dividend from your IBM stock into shares of Apple stock?",
        "created_utc": 1599285445,
        "id": "g437an8",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g437an8/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599314245.0
    },
    {
        "author": "Trumpowell",
        "body": "Anyone see that huge order  on $IBM contracts 6049 traded 130C 8/4\n\nIs $IBM buying tikthot ?",
        "created_utc": 1599102275,
        "id": "g3sxtee",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3sxtee/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599131075.0
    },
    {
        "author": "LePootPootJames",
        "body": "ZM larger market cap than IBM lol",
        "created_utc": 1598971566,
        "id": "g3ledwt",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ledwt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599000366.0
    },
    {
        "author": "TrudeausMakeupArtist",
        "body": "Me: I think IBM is making a pivot to cloud services, but the results are yet to be seen. I'll buy in at $115-118.\n\nMarket: Fuck your plan.",
        "created_utc": 1599063232,
        "id": "g3qfuxm",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qfuxm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599092032.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If IBM changes their name to International Blockchain Machines they’d probably double in value.",
        "created_utc": 1599001219,
        "id": "g3nje0s",
        "permalink": "/r/investing/comments/iks7c7/7_million_worthington_nkla_shares_unlocking/g3nje0s/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599030019.0
    },
    {
        "author": "Furloughedinvester",
        "body": "I also understand that ZM is currently valued higher than IBM. We may not be in a bubble but we are definitely in something.  Maybe the Twilight Zone?",
        "created_utc": 1599100543,
        "id": "g3suslr",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3suslr/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599129343.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If ibm traded at a pe of .00001 I would buy every share and collect millions in dividends for a few thousand dollars. Value absolutely does matter.",
        "created_utc": 1599030192,
        "id": "g3owlhc",
        "permalink": "/r/investing/comments/il13pb/cmv_fundamentals_and_pe_ratio_do_not_and_have/g3owlhc/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599058992.0
    },
    {
        "author": "radioref",
        "body": "IBM, Honeywell, Ford, GE, Kellogg, Exxon, Phillip Morris.",
        "created_utc": 1599415173,
        "id": "g494fcs",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g494fcs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599443973.0
    },
    {
        "author": "doublejay1999",
        "body": "dont understand your downvotes.  this is pretty much where we are right now.\n\nin different times, they would have already have broken them up.  They were very close to breaking up IBM in the 90's and they were no where near the level of dominance of Google &amp; Amazon.\n\nI think they are surviving because they are vital to the economy right at the moment, in the US at least.  But things are changing elsewhere.  Rupert Murdoch has his ass in his hands about content theft by Facebook &amp; Google, and the EU are sniffing round amazon for sharp practice and tax policies.\n\ni still dont believe anyone has the balls or brains to make the case that our economies would be better balanced &amp; stronger without these guys  sucking everything up.",
        "created_utc": 1599046348,
        "id": "g3pezzc",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3pezzc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599075148.0
    },
    {
        "author": "mbr902000",
        "body": "Someone gonna scoop em up, maybe ibm",
        "created_utc": 1599045958,
        "id": "g3pehq4",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3pehq4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599074758.0
    },
    {
        "author": "EithneDraoct",
        "body": "There was probably some repositioning out of Apple and Tesla in to some value plays, but tech will continue to dominate this K, imo. A lot of those value stocks are tech anyway. Look at IBM and INTC.",
        "created_utc": 1599068711,
        "id": "g3qu4ij",
        "permalink": "/r/stocks/comments/il7ojn/rotation_from_tech/g3qu4ij/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599097511.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM, DD, HEALTHCARE, INDUSTRIALS",
        "created_utc": 1599075387,
        "id": "g3rbl88",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3rbl88/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599104187.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Shift to CVS, IBM, MO",
        "created_utc": 1599055092,
        "id": "g3pw7eh",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3pw7eh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599083892.0
    },
    {
        "author": "scot-t-ophile216",
        "body": "I hear a lot about breaking AMZN, but I don't think it'll happen. There are so many competing against AMZN and holds their own against them, like Microsoft, Google, Oracle, Salesforce, IBM, Walmart, Target, etc.",
        "created_utc": 1599016674,
        "id": "g3oew62",
        "permalink": "/r/StockMarket/comments/ikpu4w/walmart_vs_amazon_the_next_big_online_retailer/g3oew62/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599045474.0
    },
    {
        "author": "LineReact0r1",
        "body": "For real what does IBM even do anymore? Havent heard of anything made by them in forever?",
        "created_utc": 1599023834,
        "id": "g3opf7m",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3opf7m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599052634.0
    },
    {
        "author": "Longboarding-Is-Life",
        "body": "I image most established tech companies were. Apple, Microsoft, IBM, etc.",
        "created_utc": 1599099843,
        "id": "g3stk0a",
        "permalink": "/r/investing/comments/ilkw0n/werent_plenty_of_tech_firms_profitable_before_the/g3stk0a/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599128643.0
    },
    {
        "author": "JmotD",
        "body": "In terms of P/S ratio, this time is crazier than  Dot.com bubble.  \n\n Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It's now worth $129.1 billion, more than International Business Machines' (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.",
        "created_utc": 1599046924,
        "id": "g3pfxsm",
        "permalink": "/r/stocks/comments/iks9cg/zooms_market_cap_dashes_past_lowes_phillip_morris/g3pfxsm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599075724.0
    },
    {
        "author": "shadowgyro",
        "body": "I am seeing a lot of posts commenting about AWS  \"subsidizing\" Amazon retail. That idea doesn't look that fleshed out to me. How exactly are people arriving at that conclusion? By looking at the overall profitability? Sure, AWS has a much higher profit margin but that doesn't say anything about whether or not they are subsidizing products on retail. Amazon e-commerce, by design, is reinvesting all the cash back into the business for top-line growth. E-commerce divison itself has so many other businesses within it - profits from TV could be subsidizing shoes or phone cables. We only see the overall profits of the _entire_ e-commerce divison.  Also, the marketplace division is significant chunk of the e-commerce revenue (Amazon only counts the fees they charge 3rd parties as revenue). Profit margins for those will be a lot better than that of the first-party retail business as Amazon doesn't have to carry inventory at all. Also, advertising is another fast growing segment with higher profit-margins.I am not sure if we have enough data to make any comment regarding who is subsidizing what.\n\nAlso, AWS itself faces very serious competition from Azure, GCP, IBM, Oracle etc They are releasing a tonne of new features every year. Why will they not want use the cash from AWS for growing AWS but subsidize toilet-paper? Seems odd to me.\n\nFrom what I understand the profitability of AWS is providing a cover for Amazon from a Wall Street standpoint - \"Here have some profits, let us concentrate on growth.\"\n\nI also don't see how breaking up Amazon into AWS and E-commerce creates room for additional innovation. There is very serious competition for both the businesses.",
        "created_utc": 1599107033,
        "id": "g3t5qqk",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3t5qqk/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599135833.0
    },
    {
        "author": "RedVermont12",
        "body": "Just like IBM has continued to be an amazing investment.",
        "created_utc": 1598979107,
        "id": "g3lywa3",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3lywa3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599007907.0
    },
    {
        "author": "ampatton",
        "body": "It’s typically someone that’s seen as someone that has a financial/business background and “counts beans” by putting a bigger importance on the short term profitability of the company rather than the core engineering principles and/or the long term growth of the company.\n\nOne example of this could be seen from IBM and its past leadership (Louis Gerstner, Sam Palmisano, and Ginni Rometty) which, in my opinion, significantly contributed to IBMs decline. This could also probably apply this to other companies as well, but this is the one that sticks out most in my mind.",
        "created_utc": 1599449051,
        "id": "g4apv31",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4apv31/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599477851.0
    },
    {
        "author": "Ironleg01",
        "body": "Absolutely brilliant write up. Tech equities became really expensive and I was looking for some value alternatives in tech sector as well. HPE definitely stood out but initially I was quite skeptical as I thought this would be company that sells servers or networking equipment. Upon investigating it I'm super intrigued and will open position next week.  \n\nI love that they detached from legacy PC and printers business, I love that early on they spun off their services &amp; consulting business, I love that they offloaded their legacy software business to Micro Focus (poor guys are struggling to sell it now) and I love that they are not competing with Azure or AWS but instead specialise in their own niche. I think that HPE's hybrid cloud solution is probably the best offering in industry right now. IBM, AWS and Google Cloud offer hybrid solutions but it looks like they are very nascent offerings compared to HPE's.\n\nI also love acquisitions they been making. Like you mentioned Silver Peak and Cray (which were very smart acquisitions) but also BlueData (AI &amp; big data analysis), Plexxi (hybrid networking) and others.\n\nAlso, their focus on the edge and hybrid seems to be very well timed. Edge computing is still in its early stages but will undoubtedly expand in the future. A lot of people talk about hybrid as stepping stone for legacy infrastructures which is true. However, with data privacy and data security regulations becoming stricter hybrid will become way more than just stepping stone to full cloud. In Europe it already matters great deal where are you servers located and who can access them.\n\nFinally, HPE feels like it could be story similar to Microsoft. That is, Microsoft was perceived as this legacy, stagnant organization and it was trading at price reflecting that sentiment. Until their cloud offering changed everything. If all goes well with HPE it could be very similar story and brilliant entry point right now.\n\nP.S.\n\nSpeaking of undervalued tech equities. Do you have any thoughts on Seagate? They are trading at quite low multiples and with growing cloud, data storage will have to grow too. On the  other hand HDDs are legacy hardware and they are not very strong at making SSDs yet.",
        "created_utc": 1599389585,
        "id": "g47ynni",
        "permalink": "/r/stocks/comments/igib2a/hpe_transition_to_asaservice_and_path_to_alltime/g47ynni/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599418385.0
    },
    {
        "author": "dreamvilliannm",
        "body": "What price did you buy ibm?",
        "created_utc": 1599279975,
        "id": "g42zfmo",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g42zfmo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599308775.0
    },
    {
        "author": "woahwoahwoahokay",
        "body": "Yeah intel may turn into an ibm. I’m fully aware of that and can always keep an eye out for that. But they still have a lot of potential for short term increases and a lot of enterprises hardware still runs on intel because that’s superior.\n\nTrust me. I live here in Silicon Valley so I know that intel is on the down turn but they can still change things up and come out ahead. I’ve seen bigger comebacks. Who knows. It’s just a small percentage meant to hedge bets. We’ll see. Hopefully it’s just an ibm and not a yahoo that intel ends up turning into.",
        "created_utc": 1599260187,
        "id": "g422hqf",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g422hqf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288987.0
    },
    {
        "author": "_Floriduh_",
        "body": "Agree on ARM and Intel. Huge acquisition that could truly make them a giant if things really do break away from x86. And Intel will be stag-tech case study much like the IBM we know.",
        "created_utc": 1599310974,
        "id": "g44a9yb",
        "permalink": "/r/wallstreetbets/comments/imxoeh/nvidia_will_be_the_first_1_trillion_semiconductor/g44a9yb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599339774.0
    },
    {
        "author": "Spenraw",
        "body": "If I had more cash flow I would put a safe chunk in to this. Part of me thinks Apple and IBM will see a huge jump with 5g and pay good dividends too. Cien seems like a great grab right now, but the dividends could help me grab more 5g stuff in the next year before it really booms",
        "created_utc": 1599162931,
        "id": "g3w70rf",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3w70rf/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599191731.0
    },
    {
        "author": "CallsCallsCallsCalls",
        "body": "\"blue chip\"  tech is going to do well right now. IBM for example. Stuff with dividends that has been hit but with growth still.",
        "created_utc": 1599140855,
        "id": "g3uenb1",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3uenb1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599169655.0
    },
    {
        "author": "CallsCallsCallsCalls",
        "body": "I've been waiting for a correction, and at the end of today I was thinking we definitely bleed tomorrow too. Now AH was so bad I think the pendulum has to swing back already to some degree, on some stocks.\n\nGood \"blue chip\" stuff and more mature tech stocks with dividends have been waiting to explode up. Every time the bubble stuff reverses a bit, stocks like IBM and INTC have had huge moves up relative to their normal betas/IV (options on IBM for $1 OTM have gone up 700%+ multiple times intraday for relatively small moves).\n\nThose type of stocks haven't gone up during the pandemic at all despite positive earnings/outlook and minimal disruption. Money has a lot to flow into tomorrow, it just won't be the usual stuff.",
        "created_utc": 1599178233,
        "id": "g3xe6vz",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xe6vz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599207033.0
    },
    {
        "author": "Kangaroos2020",
        "body": "Rumors of IBM acquiring Cloudera have been around for awhile, CLDR would go to moon if so",
        "created_utc": 1598987982,
        "id": "g3mnl0k",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3mnl0k/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599016782.0
    },
    {
        "author": "Smooothoperat0r",
        "body": "Just a sticking point here: GE and IBM had huge cash flows for decades that led to a sharp decline in stock price because they were cash rich but growth poor. Today both are miniature versions of their former behemoth selves.",
        "created_utc": 1599014965,
        "id": "g3obwlf",
        "permalink": "/r/wallstreetbets/comments/ikrq8w/gme_yolo_monthstart_update_sep_1_2020/g3obwlf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599043765.0
    },
    {
        "author": "khizoa",
        "body": "not to be an ass, but no relevance whatsoever. esp since OP asked about EXPLOSIVE GAINS, in the next FEW YEARS. they're not even relevant RIGHT NOW\n\noil companies will eat shit\n\nsears is already eating shit\n\nibm is pretty stagnant unless they innovate to keep up with tech\n\ngoodyear, i guess they can keep making tires or whatever they do, as there will always be cars. but the only explosive gains will be the random trump pump that theyre being treated unfairly",
        "created_utc": 1598980418,
        "id": "g3m2qqb",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3m2qqb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599009218.0
    },
    {
        "author": "redroverster",
        "body": "IBM, Mobil, Exxon, Sears, Goodyear",
        "created_utc": 1598961371,
        "id": "g3krlu3",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krlu3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990171.0
    },
    {
        "author": "Itsawhazzyitsawhoozy",
        "body": "I bought some stock on June 1st, not the best day price wise but it’s the stock I plan to hold the longest out of my whole portfolio, except for MSFT maybe. I made a DD for myself and made a brief summary around April. Most of it is based on their 10-K last year and their first 10-Q of the year. The key here is that this has been seen as a dinosaur for the past decade, due to lack of innovation, terrible management decisions (crazy high EPS and a buyback program that should have been cut long ago), and recruiting issues. A new CEO (Arvind Krishna) and a switch to the cloud (and quantum computing for the 2030s at least) are the key changes that could drive change. Sorry if it’s a bit messy, was not meant to be posted when I wrote it : \n\nIBM : New CEO Arvid Krishna has my trust, hope he will change top and mid tier management (which did weird accounting tricks like the pseudo Lenovo « sale/buy », laid off workforce for no reason, did not R&amp;D enough, focused on business services and consulting too much, had the crazy 20$ EPS goal, etc…). Krishna pushed Red Hat acquisition (open source enterprise software, will allow them to become hybrid cloud providers, hybrid cloud is interoperable (BFF example), scalable (ERP switch to 3rd parties), portable, and secure (user data still in private cloud)). Krishna was senior VP for cloud and cognitive software. \nIBM has switched industries several times throughout its life : time clocks, then tabulating machine, then typewriter, then mainframe (good changes), then personal computers (good initially but then poor because used competitors’ chips), etc… Cloud/AI could be their next successful switch (1/3rd of revenue in 2019, still increasing). Quantum Computing too, as they’ve strongly positioned themselves as industry leaders, but that’s in the very, very long run.\nWhile not the most important aspect, company is a dividend aristocrat (increasing div payout for 25 years), but what matters is that div payment was never removed, even though I think it should have been decreased during the struggles of the 2010s and instead reinvested in R&amp;D, they should have also paused their share buyback program. Financials : P/E around 10 (very good for a tech company), P/BV is 5.5 (good for a tech company, especially one transitioning to less tangible assets), net income slowly increasing, current ratio of nearly 1 at end of 03/31 which is decent given Red Hat acquisition and coronavirus, D/E is 2.62 (that one is indeed bad, but they got cash I guess, still not great).",
        "created_utc": 1599125472,
        "id": "g3tpsfi",
        "permalink": "/r/ValueInvesting/comments/ill0c5/ibm_good_investment_or_value_trap/g3tpsfi/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1599154272.0
    },
    {
        "author": "FireEraser",
        "body": "Why would any of those companies want to buy IBM?",
        "created_utc": 1599070284,
        "id": "g3qy3t7",
        "permalink": "/r/stocks/comments/ilby5h/ibm_as_takeover_target/g3qy3t7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599099084.0
    },
    {
        "author": "shatterkneesinc",
        "body": "cmon cscso even ibm mooned today",
        "created_utc": 1599069693,
        "id": "g3qwn2w",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qwn2w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599098493.0
    },
    {
        "author": "Lambotherambo",
        "body": "You said it could never get to the size of google fairly explicitly. Google is already a dinosaur and in 10 years time will be viewed as an IBM of sorts. AWS is not blocked from being the next current “Google” at all",
        "created_utc": 1599074446,
        "id": "g3r8zn3",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3r8zn3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599103246.0
    },
    {
        "author": "Jarlaxle_rigged_it",
        "body": "NFLX was starting a great run before this fing shit. even managed to try to break up yesterday while everything was crashing. dd plz on that solid stock&lt;3\n\nINTC ofc (all that insider buying) \n\nSomehow AVGO/IBM barely felt this thing, might be good tech+cyclical trades..",
        "created_utc": 1599250717,
        "id": "g41b97v",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g41b97v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599279517.0
    },
    {
        "author": "sirajgb",
        "body": "Airbus, ibm (people make fun of it but they are one of the leaders on developing quantum computing, including the prog language), Ericsson (5g play) Eon",
        "created_utc": 1599241794,
        "id": "g40k92i",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g40k92i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599270594.0
    },
    {
        "author": "soupmonster40",
        "body": "lol yeah. I inverse WSB.\n\n\"intel is the next IBM\" --&gt; buy intel &amp; Micron\n\n\"oil is dead\"--&gt; buy oil\n\n\"NET sucks it's a meme stock\" --&gt; buy NET",
        "created_utc": 1599261430,
        "id": "g4256lr",
        "permalink": "/r/wallstreetbets/comments/imp0dz/insights_on_my_portfolio_please/g4256lr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599290230.0
    },
    {
        "author": "Kramer-Melanosky",
        "body": "Your comparison is absurd. Microsoft would have become another IBM if not for Sathya Nadela. \n\nIntel is lagging in technology for quite a while. Without any positive news in near future, it's a gamble. It can be become next Microsoft or IBM.\n\nMobile Eye I good, but with chances of their major revenue going down and gap between ADM widening over next few years. I don't feel it's worth it.",
        "created_utc": 1599424001,
        "id": "g49kgv5",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49kgv5/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599452801.0
    },
    {
        "author": "bitflag",
        "body": "I think Intel is already close to being IBM. They consistently gave up on new markets (ie mobile, high end GPU, modems) because it is initially small and expensive, which let the competition take those juicy new trends while Intel got stuck the same old x86 chips it's been doing for 4 decades.\n\nManufacturing problems is only salt on the wound. It's accelerating the decline because it was Intel moat in it's core business.",
        "created_utc": 1599448655,
        "id": "g4apa51",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4apa51/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599477455.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Bit of a personal anecdote here:\n\nSo I have a degree in IT with a focus on Computer Networking.\n\nI once interviewed for IBM because they had positions open for Network Admins.  Unfortunately, when I sat down and looked over their list of jobs I discovered that they were only looking for senior level positions (something they did not mention in the email they sent to my university).\n\nI decided to interview anyway because I was already there in suit and tie so I wasn't about to get all dressed up for nothing.\n\nThe interview went well, but the guy told me he just didn't have anything for me at the time.\n\nI decided to walk around afterwards and saw a guy interviewing for entry level programmers.  My campus did not offer a Software degree (they offered it at a different campus), but I did have to take 9 credits in basic programming which was Java, C++, and HTML.  I had already taken the Java and C++ classes.\n\nI sit down with the guy and we get to talking.\n\nHe asks my background in coding.  I tell him one intro in Java and C++ so far.\n\nHe asks why am I interviewing if my degree is not focused on coding.  I tell him because those two classes opened my eyes to something that I didn't even know I wanted before.  I love creating stuff with code, I find it cathartic to sit and stare at code, getting lost in it while trying to figure out where my errors are, the absolute joy of finally getting it to compile and run.  I even started to make some basic programs at home in my free time.\n\nHe asks me if I have any of my work to show him.  I did not bring any copies of my code because I wasn't even thinking about the possibility of interviewing for any other positions (let this be a lesson to anyone who's still getting their degree, bring everything!).\n\nI tell him I did have it on a thumb drive that I carry around in my briefcase, but of course he waves his hand and says that's a security issue (totally agreed).\n\nHe asks me what a function is.  I draw a blank.  I ended up stammering out something like, \"it's the part of the code that does stuff\".  Not necessarily wrong, but more of an ELI5 definition.\n\nHe shows me some code and asks what I can decipher from it.  It's a function that takes a variable, runs it through a formula, returns a variable, and then loops 4 more times using the new return variable each time, and finally shows a set of the return variables at the print out.  He confirmed that I was right.\n\nHe asks me what that sets of numbers is called.  Obviously it's an array, and I had heard the term before, but again I did not know at the time.  He frowns and says something along the lines of, \"You really don't know basic terminology.  You should work on that.\"\n\nWe shook hands and parted ways, never got a call back.  Now, I know I messed up by not having some of my work printed out, and not being up on the terminology.  But it really rubbed me raw that this guy was so hung up on terminology, knowing that coding was like 5% of my entire degree, and yet I still had a basic working knowledge of programming to at least be able to read and understand what was going on, and that I was passionate enough about it to go home and write some basic programs of my own.\n\nNow I don't know that the lack of terminology was the ultimate reason I was turned down.  I do know that they were looking to start up a class that would take about 3 years to go through, and they were going to teach a proprietary language that was similar to Java.  Obviously, the terminology would have been brought up again multiple times in that 3 year program.  The only clue I had for why I was turned down was the lack of lingo.\n\nI am now a manager at a FinTech company, and I don't ask \"lingo\" questions of interviewees.  I want to know if they understand the meat and potatoes of what the job entails because, to me, that means so much more.  Lingo will happen over time as they do the job.\n\nI'm not saying that is all the OP was concerned about in their interviews, but they certainly seem to think it's a flaw in an interviewee that makes them unsuitable for hiring.",
        "created_utc": 1599457511,
        "id": "g4b12z3",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4b12z3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599486311.0
    },
    {
        "author": "Lazybumm1",
        "body": "I'm very bullish on NVIDIA but I think you are overestimating some of its competitive advantages. Raytracing will probably become industry standard sooner or later and supported across either platform. DLSS is something AMD or any other company with a bunch of ML engineers and money can replicate given some time. \n\nIt's not impossible for other companies to replicate or immitate or substitute some of those technologies / products. AMD is certainly catching up and will carve off some fractions of the market in the AI/ML &amp; datacenter businesses.\n\nThe ARM acquisition, if it happens, will confer a competitive advantage like no other. As an NVDA stockholder I wish this happens. As a Brit working in and loving tech, I am slowly dying on the inside... \n\nSomething to remember is that this is a fast expanding market and not a saturated one, there's room for multiple players to grow and win at the same time. \n\nThat being said, I still think Intel will likely be the next IBM. Is it gonna tank overnight? No, and there will probably be plenty of rallies to make money off, but long term I wouldn't look to hold.",
        "created_utc": 1599305308,
        "id": "g440s54",
        "permalink": "/r/wallstreetbets/comments/imxoeh/nvidia_will_be_the_first_1_trillion_semiconductor/g440s54/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599334108.0
    },
    {
        "author": "ThemChecks",
        "body": "This seems pretty fair honestly. IBM isn't a bad dividend stock for what it's worth.",
        "created_utc": 1599308082,
        "id": "g445t5l",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g445t5l/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599336882.0
    },
    {
        "author": "Art0002",
        "body": "You asked a decent question so I thought you deserved a thoughtful response. \n\nDo old companies like IBM and newer companies and companies that are in focus now. \n\nI read a post by someone trying to put a valuation on SPCE. He had to make assumptions and he pointed them out. It was a good read. I’m not sure what he ultimately concluded but I dabble with SPCE options and I’ve made a few bucks. \n\nI think your endeavor will improve your future trading results. There is no downside. \n\nAnother thought is adding a layer of technical analysis to add even more signals as to when to buy or sell. There is analysis paralysis but when fundamental and technical analysis lines up ...\n\nI don’t want to ramble but I trade differently than you. You are young and I am retired. What made early retirement possible was increasing my dollar cost averaging (DCA) into the 08/09 crash. I cut spending and DCA’ed into it. It was brutal. I was fully invested. I raised my 401k contributions. \n\nIt paid off and took me over the hump. Don’t underestimate DCA.",
        "created_utc": 1599176554,
        "id": "g3x9m49",
        "permalink": "/r/investing/comments/im2uuw/learning_valuation/g3x9m49/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599205354.0
    },
    {
        "author": "Spenraw",
        "body": "very good to know, I already own telus so maybe time to put it in apple, but IBM AI will use 5g alot",
        "created_utc": 1599186866,
        "id": "g3xu28l",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3xu28l/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599215666.0
    },
    {
        "author": "ThreeEyeJedi",
        "body": "Exactly they never used the products they're talking about. What tech company you know uses Teams? Maybe some corporate giant like IBM but no one is actually using Teams",
        "created_utc": 1599065571,
        "id": "g3qlx8h",
        "permalink": "/r/wallstreetbets/comments/ijpbec/slack_work_discord_for_grownups_and_why_this_saas/g3qlx8h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599094371.0
    },
    {
        "author": "chawpyx5",
        "body": "Right there with ya. I also have IBM 131 9/11s that were up 390%. They are literally break even at 0% right now.",
        "created_utc": 1599213567,
        "id": "g3yqndt",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3yqndt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599242367.0
    },
    {
        "author": "RumLovingPirate",
        "body": "Retail investors *used* to not have an affect on the market up until the past year or so. I mean, being a retail investors used to me call your local stock broker and asking for a few shares of that hot new stock called ibm. Mainframes are the future!\n\nThen came online trading and even then, most people who had been investing saw little reason to leave their stock broker and fees started at like $30 a trade and we're executed slowly.\n\nEven with *super low*  $10 trades making 30 trades a day was expensive and people didn't focus on in.\n\nIn comes gen z who are the side hustle generation, $0 fast trades, tons of youtube and tiktok vids on how to trade and make $1k a day, and we're seeing the long tail effect of a lot of people with low volume adding up to a lot of the overall trade volume. \n\nRetail investors absolutely affect things now, and they absolutely need to realize what it's like to get burned.",
        "created_utc": 1599222872,
        "id": "g3z49ks",
        "permalink": "/r/investing/comments/imeakd/cnbc_robinhood_traders_need_to_get_burned_a_bit/g3z49ks/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599251672.0
    },
    {
        "author": "trader9899",
        "body": "TSLA is the most watched stock from retail along with Apple. They can make a business selling their own stock and would bring in 2 billion a year for the next 100 year. I don’t understand what is the allure of having to short Tesla when there are a bunch of legacy boomer stock you can short. IBM/XOM/mall stock for easy money",
        "created_utc": 1599270249,
        "id": "g42kch8",
        "permalink": "/r/investing/comments/imp0rv/tesla_stock_could_tumble_over_90_says_analyst/g42kch8/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599299049.0
    },
    {
        "author": "Lazybumm1",
        "body": "Yes not talking short term, the IBM example is a good one. That's what I meant.\n\nThey can pump prices with buybacks anytime too.",
        "created_utc": 1599260058,
        "id": "g422645",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g422645/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288858.0
    },
    {
        "author": "DankMemelord25",
        "body": "Intel is the next IBM",
        "created_utc": 1599090971,
        "id": "g3scxzu",
        "permalink": "/r/wallstreetbets/comments/ilb2rx/need_more_shit_tech/g3scxzu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599119771.0
    },
    {
        "author": "roox911",
        "body": "yeah, tough to say - i'm bullish enough on it that i think it'll be up 10% from here before the end of the year, assuming the market doesn't keep black swanning from here of course...\n\nI have IBM in my sights as well - just waiting to see if there is a better entry in the coming days :)",
        "created_utc": 1599163120,
        "id": "g3w7l7x",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3w7l7x/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599191920.0
    },
    {
        "author": "nicename09",
        "body": "Intel ruined itself by hiring mediocre tech talent. Maintenance engineers who think they're innovators. What a joke. Years of onboarding average employees gets you average results. Shocking! Gotta squeeze those margins from somewhere I guess. Now its a perpetual cycle of complacency and ineptitude. At this point you could hand intel the market leading product in self driving tech and they'd blow that lead within 16 months. They want to be IBM. No amount of wishful thinking from the outside can change that.",
        "created_utc": 1599459847,
        "id": "g4b3tjt",
        "permalink": "/r/wallstreetbets/comments/inrj01/intel_the_big_picture_and_why_im_bullish_on_it/g4b3tjt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599488647.0
    },
    {
        "author": "Ironleg01",
        "body": "Unless Intel gets new CEO they are going to do just as well as IBM did. They also were massive company once.",
        "created_utc": 1599468540,
        "id": "g4bch3b",
        "permalink": "/r/wallstreetbets/comments/io1van/amd_will_because_of_intels_presentation/g4bch3b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599497340.0
    },
    {
        "author": "Furloughedinvester",
        "body": "IBM?",
        "created_utc": 1598959320,
        "id": "g3kotnr",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kotnr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598988120.0
    },
    {
        "author": "Immediate_Student_92",
        "body": "ah okay, but why is that. Both azure and aws are better than the competition, which is google baba IBM etc, all the giant techs. And cloud is still in its infancy. What makes you think theyll be replaced, at least in that industry.",
        "created_utc": 1599187582,
        "id": "g3xv9yt",
        "permalink": "/r/stocks/comments/iltt53/are_we_in_a_covidtech_bubble_heres_how_to_tell_my/g3xv9yt/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599216382.0
    },
    {
        "author": "MattSurprise",
        "body": "IBM",
        "created_utc": 1599354481,
        "id": "g46sq5w",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g46sq5w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599383281.0
    },
    {
        "author": "woahwoahwoahokay",
        "body": "No trust me. I agree. I think AMD is the superior product at this point and my stocks reflect that. But intel is undervalued in the short term based on reactionary sell offs due to bad news. It’s undervalued. They have a lot of talent. I live close to intel. I know a lot of people who work there. They’re not going to go under overnight and they don’t ONLY sell chips. They’ll pivot and react accordingly. If I’m wrong then I only lose a small percentage of money, if I’m right, then I make serious gains. It’s meant to mitigate risk. Buying into intel is meant to help diversify my portfolio and I honestly feel they are undervalued at this point. Should it have dipped? Yes. By that much? No. Intel is still fucking intel. They will continue to do well for the coming years.\n\nCould they turn into an ibm? Yeah maybe. But by then I’ll be out of the stock. But the revamped logo and some updates to hardware is enough to push the needle.",
        "created_utc": 1599259754,
        "id": "g4215i2",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g4215i2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288554.0
    },
    {
        "author": "sk169",
        "body": "Yes. My whole thesis is based on Intel becoming Microsoft rather than IBM. \n\nI don't have a crystal ball and neither do you. I'm betting on Intel becoming Microsoft rather than IBM.",
        "created_utc": 1599424176,
        "id": "g49ks6f",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49ks6f/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599452976.0
    },
    {
        "author": "ATLiving",
        "body": "Intel is like IBM. Maybe in 10 years it’s great again or maybe in 10 years it’s dead.",
        "created_utc": 1599432597,
        "id": "g49zlvb",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49zlvb/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599461397.0
    },
    {
        "author": "undecidedmarketmaker",
        "body": "I agree with all your points, except \n\n&gt;The kind of employees has not really mattered about how the company as a whole does\n\nIt matters a lot when it comes to the bread and butter of processors. No innovation means death in this industry. While poorly run companies can limp (and limp well) for years - see Oracle, IBM, etc - is Oracle really going to be a company you want to put your money in? \n\nGiven what I know about INTC, I don't think INTC is going to be around in 20 years. Not in its current form, at least. The part I'm keeping a close eye on is Intel Capital, which they use to squelch and/or gobble up competition - that might keep them alive forever as a business model, but I don't like it. I guess I'll be proven wrong when I'm an old man lol but that's my two cents.",
        "created_utc": 1599442054,
        "id": "g4aeq16",
        "permalink": "/r/wallstreetbets/comments/inrj01/intel_the_big_picture_and_why_im_bullish_on_it/g4aeq16/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599470854.0
    },
    {
        "author": "upvotemeok",
        "body": "Can ibm pull a msft over next decade and but 1t?",
        "created_utc": 1599428820,
        "id": "g49t0i5",
        "permalink": "/r/stocks/comments/imfn3y/down_dayselloffpanicdont_panicwhat_are_you_buying/g49t0i5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599457620.0
    },
    {
        "author": "MaximusHippocratus",
        "body": "IBM",
        "created_utc": 1599123215,
        "id": "g3tnqz9",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3tnqz9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599152015.0
    },
    {
        "author": "dmitsuki",
        "body": "IBM can make good RISC CPU'S, PPC is still an option though devs prefer completely off the shelf nowadays.",
        "created_utc": 1599124590,
        "id": "g3tozi5",
        "permalink": "/r/wallstreetbets/comments/ilfn28/any_plays_for_nvidia/g3tozi5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599153390.0
    },
    {
        "author": "wearsgreensometimes",
        "body": "I sold 40 of those 0.80 contracts. doubled my money from that morning based off a tip here (should have tripled, but missed a good buy). basically rode the Tiger Lake chipset talk hype, sold before they dipped back down (but were still up 50%). \n\nI hope yall do well but used to work at a company in that industry and I don’t know how much it will actually rise beyond that based off what I remember. Intel is a boomer tech stock like IBM, Cisco, and Lenovo...of course they could always pull off an MSFT type revival but who knows",
        "created_utc": 1599132779,
        "id": "g3ty85v",
        "permalink": "/r/wallstreetbets/comments/ilcywi/intc_gang_wya_intc_918_50c_56c/g3ty85v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599161579.0
    },
    {
        "author": "neekogo",
        "body": "I hear ya. My strategy lately has been similar to you. Well known companies (MFST, WM, DIS). A few companies I expect to be making strides in the coming years (IBM, CSCO, CVS). A few risk shots (F, AFL,T). And a couple of solid ETFs to round it out. Yesterday I was 16% up. Right now I'm still 8% 😄",
        "created_utc": 1599147602,
        "id": "g3uyesm",
        "permalink": "/r/investing/comments/ilgy50/finally_got_a_stake_in_aapl/g3uyesm/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599176402.0
    },
    {
        "author": "MaximusHippocratus",
        "body": "IBM boys. It just pumped after a bull flag forming for weeks. IV is still low. Get in while you can. Before the COVID crash it was pumping. Hasn't cut dividend through the pandemic.",
        "created_utc": 1599075222,
        "id": "g3rb57y",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3rb57y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599104022.0
    },
    {
        "author": "Flaky-Bad9954",
        "body": "Oh I didn't make it clear. I am not saying only MSFT will be replaced. I think all the giant tech you see today will be replaced... Like how IBM was being replaced...",
        "created_utc": 1599177459,
        "id": "g3xcd8q",
        "permalink": "/r/stocks/comments/iltt53/are_we_in_a_covidtech_bubble_heres_how_to_tell_my/g3xcd8q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599206259.0
    },
    {
        "author": "Turtlesaur",
        "body": "Lol by who, IBM?",
        "created_utc": 1599078818,
        "id": "g3rl5zb",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rl5zb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599107618.0
    },
    {
        "author": "hidden-carrot",
        "body": "ARKK\nBABA\nBUD\nCARR\nCZR\nIBM\nMJ\nMSFT\nNFLX\nPlanet 13\nSE\nTSM\nVGT\nVTI\nWMT\nXLY",
        "created_utc": 1598979893,
        "id": "g3m17ni",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g3m17ni/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599008693.0
    },
    {
        "author": "a_nobody_really_99",
        "body": "Well, I’d have to say Cisco is doing much better than IBM and continues to do so.",
        "created_utc": 1598969356,
        "id": "g3l8l0d",
        "permalink": "/r/investing/comments/ijzxrp/tesla_opens_up_at_440_post_split_and_soars_12_to/g3l8l0d/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598998156.0
    },
    {
        "author": "r3dd1t0rxzxzx",
        "body": "Saying “they all have software” shows how little understanding you have of each automakers level of capability and focus. It’s like saying Microsoft and IBM both do software so whatever - pretty crazy conclusion.",
        "created_utc": 1598997594,
        "id": "g3nbu81",
        "permalink": "/r/investing/comments/ik4ehw/tsla_is_now_the_tenthlargest_company_via_market/g3nbu81/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599026394.0
    },
    {
        "author": "sc0tt_1990",
        "body": "Their new chip is a redux of the AMD FX series.  It's hilarious how things have come full circle.  Wonder if you can cook an egg on it.\n\nIntel is a shit company now.  IBM 2.0 until proven otherwise.  They don't spend on R and D, look it up, don't just listen to me.  Or hell, look at how AMD is going to eat their lunch 6 months from now when Ryzen 4 is out.",
        "created_utc": 1598998457,
        "id": "g3ndvjo",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ndvjo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599027257.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Look up IBM quantum computing, Redhat acquisition, cloud, software business transition from their legacy hardware business",
        "created_utc": 1599025859,
        "id": "g3orvyc",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3orvyc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599054659.0
    },
    {
        "author": "Troll_Sauce",
        "body": "Buy them out a ways so you have some flexibility. Er is a huge wildcard. I still think it's primed for an IBM acquisition sooner or later.",
        "created_utc": 1599026970,
        "id": "g3ot5xn",
        "permalink": "/r/wallstreetbets/comments/ikm425/techcalls_are_easy_gains/g3ot5xn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599055770.0
    },
    {
        "author": "Wearahat02",
        "body": "Not sure but the market thinks it will\nThey did quadruple their revenues YoY and double their revenues QoQ.\n\nIf they can maintain this rate of growth for just one year, their revenues will be 7.5billion next FY\n\nTheir operating expenses are ridiculously low I guess it doesn't take much to run a video conference app\n\nThat means 3 billion net income in 2 years\n\nGrowth can't be that easy can it? \n\nLiterally a company that earned 5 million last comparative quarter, earns 186mil this quarter and at this rate possibly almost 1 billion next years quarter.\n\nAlso I'm amazed that companies that have been around for a long time like Boeing, IBM, Starbucks, Lockheed, 3M, American Express, Citigroup are smaller than a video conferencing company that was worth just 17bn last year.",
        "created_utc": 1598970260,
        "id": "g3laybc",
        "permalink": "/r/stocks/comments/ikgc75/rstocks_daily_discussion_technicals_tuesday_sep/g3laybc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598999060.0
    },
    {
        "author": "laken906",
        "body": "FSLY, MSFT, RKT, SOXL, SPY, SE, IAU, INTC, VXX calls\n\nUUP puts\n\n10 for 10 premarket. Should prolly simplify the portfolio while I'm ahead this morning...",
        "created_utc": 1598962618,
        "id": "g3ktsg0",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ktsg0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598991418.0
    },
    {
        "author": "pervsensei11",
        "body": "Have TSLA, NVDA, PINS, NFLX, WORK, ZM, INTC calls and spreads\n\nCan’t wait for premarket",
        "created_utc": 1598945876,
        "id": "g3kc8l7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kc8l7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598974676.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing like a rebranding thing",
        "created_utc": 1598952960,
        "id": "g3kim3q",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kim3q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598981760.0
    },
    {
        "author": "REDmonster333",
        "body": "Intel. Even though it looks bleak short term. But long term they will still pull through. They have 10+ years of dominance, I doubt they wont catch up.",
        "created_utc": 1598952851,
        "id": "g3kiik2",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kiik2/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1598981651.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "It’s not gonna happen but if INTC gaps up to $60 I get the WSB logo tattooed. This isn’t even a bet. This is a goal.",
        "created_utc": 1598954092,
        "id": "g3kjn5f",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjn5f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982892.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC is up to $51.30 for +0.69% rn",
        "created_utc": 1598953629,
        "id": "g3kj7z9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kj7z9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982429.0
    },
    {
        "author": "HinduHamma",
        "body": "Thank god I ignored all you intel pumping clowns and bought nvda instead.",
        "created_utc": 1598968574,
        "id": "g3l6lsd",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l6lsd/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598997374.0
    },
    {
        "author": "ProPenguin800",
        "body": "Who else is playing Intel?",
        "created_utc": 1598946830,
        "id": "g3kd4xs",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd4xs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598975630.0
    },
    {
        "author": "_ddeeezzzz",
        "body": "Truly hope some of you jumped on this NVDA train, shit is going to the next solar system, fuck the moon. Not too late they have a press event at 12est will probably spike on that as well... my earlier hope was 550 eow, now I have to roll up and out to maybe 600. \n\nAlso, I’d buy intel 50$ weekly calls on this slight AM dip, thank me later. \nBig options activity, new processor release wed, tech hype.",
        "created_utc": 1598969394,
        "id": "g3l8oln",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l8oln/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598998194.0
    },
    {
        "author": "Bellweirboy",
        "body": "EVERYTHING is up except Intel and Tesla. Everything. What am  I holding.......",
        "created_utc": 1598968894,
        "id": "g3l7f7v",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7f7v/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598997694.0
    },
    {
        "author": "ztw2002",
        "body": "oooooof Intel is fucked again",
        "created_utc": 1598967402,
        "id": "g3l3kpa",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3kpa/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996202.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "This AMD cuck is big mad NVDA GPU cards are better than AMDs. Stick with your CPU cuck , just because they beat boomer intel doesn't mean they can beat Leatherman.",
        "created_utc": 1598969547,
        "id": "g3l92k3",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l92k3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598998347.0
    },
    {
        "author": "pg209",
        "body": "Nice dip in most tech stocks\n\nGoing in on INTC, FTNT, MU, AMD\n\nAlso thinking of calls on WORK, they have earnings release next week, should be a good run-up",
        "created_utc": 1598967669,
        "id": "g3l49nk",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l49nk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996469.0
    },
    {
        "author": "august_thecow",
        "body": "INTC is severely underbought... might buy more calls at open before the announcement",
        "created_utc": 1598960784,
        "id": "g3kqmuf",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kqmuf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598989584.0
    },
    {
        "author": "Davidkanye",
        "body": "I mean, I’ve been watching past earnings plays and there’s still time Imo. \n\nAdditionally eyeing INTC. \n\nCurrent play are post earnings: ESTC, INTU, AMGN",
        "created_utc": 1598947233,
        "id": "g3kdic9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdic9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598976033.0
    },
    {
        "author": "NervousTumbleweed",
        "body": " Ha ha wow Intel that was so funny, you sure had me going there with that dip. Probably should get back to going up though, right? haha.",
        "created_utc": 1598967875,
        "id": "g3l4sec",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l4sec/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996675.0
    },
    {
        "author": "Infernal-Affairs",
        "body": "if INTC hits $60 before eow\n\nI'll just sell my calls or something idk",
        "created_utc": 1598954353,
        "id": "g3kjvtu",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjvtu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598983153.0
    },
    {
        "author": "GamblingMikkee",
        "body": "JPM, CVS, INTC, MO, WBA. Almost all single digits",
        "created_utc": 1598957426,
        "id": "g3kmu1x",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kmu1x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598986226.0
    },
    {
        "author": "sven2123",
        "body": "I agree. Intel is cheap right now and will go back up once they smoothe out operations",
        "created_utc": 1598958975,
        "id": "g3kog5j",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kog5j/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598987775.0
    },
    {
        "author": "lord_v0ldemort",
        "body": "Gj buying fucking intel and somehow thinking ur better at tech than Buffett while he rakes in  mounds of cash from his Apple stake\n\nUr up like 2% and he’s up like 400% but somehow you shit on him lol u clown",
        "created_utc": 1598968132,
        "id": "g3l5gbk",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3l5gbk/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598996932.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Ffs lord please just have INTC pop like it did the week of May 12th",
        "created_utc": 1598969177,
        "id": "g3l83vu",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l83vu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598997977.0
    },
    {
        "author": "therealsparticus",
        "body": "AMD has already priced in half the growth of intel. Intel is their competition and is not a wimp.",
        "created_utc": 1598964236,
        "id": "g3kws71",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kws71/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993036.0
    },
    {
        "author": "DukeOfEarle88",
        "body": "AMD is going to get Intel this year- &amp; then quantum computers ftw.",
        "created_utc": 1598965074,
        "id": "g3kyeyx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kyeyx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993874.0
    },
    {
        "author": "DerTagestrinker",
        "body": "AMD will more than double within a year. It’s cap is only ~$100b and they are at this point at least two years ahead of Intels processor tech, especially for laptops. Intel has ~70% share so there is massive share for AMD to steal.",
        "created_utc": 1598966380,
        "id": "g3l13s5",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l13s5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995180.0
    },
    {
        "author": "Krakusmaximus",
        "body": "intel is trying to kill itself",
        "created_utc": 1598967466,
        "id": "g3l3qj1",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3qj1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996266.0
    },
    {
        "author": "therealsparticus",
        "body": "All AV companies including the one I work at use Intel. All of the software runs with less bugs on intel, board design support including pretty complex stuff like EM interference is way better from Intel. Intel has the best ecosystem despite their failures to catch TSMC on the fab side.\n\nTesla has their own asic instead of a GPU but even they run an intel processor.",
        "created_utc": 1598968656,
        "id": "g3l6tbk",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l6tbk/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598997456.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I dropped another grand into Intel calls.",
        "created_utc": 1598969032,
        "id": "g3l7rem",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7rem/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598997832.0
    },
    {
        "author": "learningtosail",
        "body": "We here at the intel shareholders club thank you for buying our shit from us so we can finally leave this stupid club.  \n\nYou can foot the bill for our class action now :)",
        "created_utc": 1598968025,
        "id": "g3l56kg",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l56kg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996825.0
    },
    {
        "author": "PattayaGuy",
        "body": "AMD def has a ton of market share to eat away at. They're being aggressive in their road map and pushing forward while intel is jerking off in the corner. If AMD could deliver a beast GPU to match its Ryzen CPU's, they'd shoot straight up. NVidia isn't as lazy as intel though.",
        "created_utc": 1598963942,
        "id": "g3kw8b6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kw8b6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992742.0
    },
    {
        "author": "Cygopat",
        "body": "The only thing fundamentals do for you in this market is limit downside. There are very little plays for that available. Two weeks ago I bought INTC at $49. Buffett should have gotten into that but I guess it's not within his CoC.",
        "created_utc": 1598964026,
        "id": "g3kwe2p",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3kwe2p/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598992826.0
    },
    {
        "author": "Billionairess",
        "body": "Intel",
        "created_utc": 1598949028,
        "id": "g3kf4vt",
        "permalink": "/r/StockMarket/comments/ik3l3n/which_stocks_are_still_under_valued/g3kf4vt/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598977828.0
    },
    {
        "author": "R4N7",
        "body": "Oh I guess you’re diversified enough to not worrry. If RDSB is more then 5% of your portfolio you might sell half just to lower the risks and then buy again when you will see stock starting rebound. Actually I am in similar position with INTC (currently -9%) I am not buying more and not selling I am just holding without any actions. Time will show.",
        "created_utc": 1598960919,
        "id": "g3kquq2",
        "permalink": "/r/stocks/comments/ikhmdd/rdsb_shell_what_is_happening_to_the_price/g3kquq2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598989719.0
    },
    {
        "author": "Johnnyrocket47",
        "body": "Intc 50c 11/20",
        "created_utc": 1598946920,
        "id": "g3kd7wf",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd7wf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975720.0
    },
    {
        "author": "coachellathrowaway42",
        "body": "Intel 9/28 $50.5 C",
        "created_utc": 1598947689,
        "id": "g3kdxi7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdxi7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598976489.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC 1/15/21 $50c",
        "created_utc": 1598947104,
        "id": "g3kde04",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kde04/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975904.0
    },
    {
        "author": "Duke_of_Scotty",
        "body": "Did you see the part about Intel options. He's on track to learn that the first one is always free",
        "created_utc": 1598963542,
        "id": "g3kvh7d",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kvh7d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598992342.0
    },
    {
        "author": "Bellweirboy",
        "body": "Anyone bagholding Intel?",
        "created_utc": 1598963153,
        "id": "g3kur97",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kur97/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991953.0
    },
    {
        "author": "imsoepicxd",
        "body": "Bleeding a bit on my INTC 55c 10/16 gamble. Hope my RKT calls print. Thinking of opening a position for DOCU but not sure yet.",
        "created_utc": 1598969342,
        "id": "g3l8jqi",
        "permalink": "/r/smallstreetbets/comments/ikil53/daily_market_discussion_thread_tuesday_september/g3l8jqi/",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1598998142.0
    },
    {
        "author": "WoodWoodClepper",
        "body": "Fuck off INTC",
        "created_utc": 1598970094,
        "id": "g3lahyr",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3lahyr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998894.0
    },
    {
        "author": "F1shB0wl816",
        "body": "Nio is one I’m hoping to explode but I figured there’s a lot of potential in the arkks too, a lot of that has a future and is still in complete infancy, it’s just a matter of what. Picking something that explodes like that will be a lucky pick though, some of it’s not even rational right now. \n\nI still think tsla, amd, and nvda have places to go though. Musk is just full of ideas, if 1 pans out for every 100, that could shake up the world as we know it. Amd will take over intels market eventually, they’re a head of the game, younger, fresher, intel just seems dated to me, lacking, it got high off its success and hasn’t thought straight since. Nvda is still making moves and growing fast and they have a handful of nice deals coming in the next few years.",
        "created_utc": 1598961463,
        "id": "g3krrgy",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krrgy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990263.0
    },
    {
        "author": "Berrymore13",
        "body": "Well my open is shaping up to be good. Holding NVDA, WORK, PINS, and INTC calls 🥰🤑",
        "created_utc": 1598964699,
        "id": "g3kxo8g",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kxo8g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993499.0
    },
    {
        "author": "Spaceseeds",
        "body": "Anybody who asks why intel has never looked at the fact that intel dominates the enterprise market and none of them are going to switch to AMD. The numbers are staggering. Intel has like over 80% of the market. They could outsource their chips and still be more successful than AMD. This doesn't even get into the rest of their business. I feel like Intel is a buy right now.",
        "created_utc": 1598964626,
        "id": "g3kxj41",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kxj41/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993426.0
    },
    {
        "author": "candidly1",
        "body": "AMD R&amp;D budget 1.5B\n\n\nINTC R&amp;D Budget  $13.3B\n\n\n\"jerking off\"",
        "created_utc": 1598965740,
        "id": "g3kzr0n",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kzr0n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598994540.0
    },
    {
        "author": "HBK05",
        "body": "uh..buy low sell high? Intel has been in charge of a lot of their market for the past 10+ years, they are only lacking behind for the past couple of years. I fully believe in their ability to bounce back eventually and compete with amd, hopefully pushing innovation and price/performance for consumer computers to the moon, but for now it's time to wait and see if they can pull it.",
        "created_utc": 1598963603,
        "id": "g3kvl5a",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kvl5a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992403.0
    },
    {
        "author": "FattySquirrelDaddy",
        "body": "What’s going on with INTC?",
        "created_utc": 1598967192,
        "id": "g3l3129",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3129/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598995992.0
    },
    {
        "author": "bicameral_mind",
        "body": "INTC just can't take two steps forward without another step back.",
        "created_utc": 1598967875,
        "id": "g3l4sdx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l4sdx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996675.0
    },
    {
        "author": "WagieInTheCagie",
        "body": "INTC crying in the corner while all the other stonks are having an orgy. FeelsBadMan",
        "created_utc": 1598969401,
        "id": "g3l8pbc",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l8pbc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998201.0
    },
    {
        "author": "therealsparticus",
        "body": "Anyone who has to deal with bare level cpu will tell you how good their engineering support is. Intel runs on ecosystem fuel. It’s their most.",
        "created_utc": 1598964055,
        "id": "g3kwfy6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kwfy6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992855.0
    },
    {
        "author": "v0lati1e",
        "body": "Intc wtf",
        "created_utc": 1598967378,
        "id": "g3l3ijw",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3ijw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996178.0
    },
    {
        "author": "FindtheTruth5",
        "body": "Any chance for Intel to actually have a good day?",
        "created_utc": 1598969853,
        "id": "g3l9vov",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l9vov/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998653.0
    },
    {
        "author": "Zouk11",
        "body": "To add to this, i may be wrong but, I've seen many articles about Apple wanting to switch over their Mac CPUs from Intel to AMD, which makes sense for AMD to continue rising if a deal gets put into place with AMD and Apple.",
        "created_utc": 1598969863,
        "id": "g3l9wlb",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l9wlb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598998663.0
    },
    {
        "author": "SealCub-ClubbingClub",
        "body": "They still have massive market shares in sectors that they will be behind on for at least 2 years.\n\nIf that market share is significantly eroded before they get 7nm (with actual decent yields) then I think they could dip significantly.\n\nI think Intel is actually quite expensive right now. Their share price is around 2018, 2019 levels but their outlook for the next year or 2 is significantly worse than it was then. Maybe that's confidence in the 3+ year vision or maybe it's the market not discounting properly.",
        "created_utc": 1598968206,
        "id": "g3l5nar",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l5nar/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598997006.0
    },
    {
        "author": "arcarsen",
        "body": "INTC tiger lake release... will it release the tendies too?",
        "created_utc": 1598969126,
        "id": "g3l7yra",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7yra/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598997926.0
    },
    {
        "author": "sleepyguy007",
        "body": "intel, cisco, qualcomm, juniper etc were all huge bubble stocks in the tech bubble and were making tons of money.  \n\n\nThis tech bubble is just as bad and the same sort of mix of unprofitable companies, profitable overvalued companies, and now people just trying to cash out as fast as possible via SPACs and IPOs as there was then.  It might not be quite as steep a bubble yet, but its definitely getting there.  it took 4 years to go from 1200 -&gt; 5000 in 2000.   4 years ago the nasdaq was 5000 or so, so I could see it gettingto even 15000 and then crashing.  maybe not quite as big, but still as someone above mentioned economic conditions are far far worse now and we have much more debt than we did in 2000 as a nation",
        "created_utc": 1598955614,
        "id": "g3kl2if",
        "permalink": "/r/stocks/comments/ik5vev/why_the_stock_market_is_disconnected_from_the/g3kl2if/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598984414.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing  like a rebranding thing",
        "created_utc": 1598953918,
        "id": "g3kjhgx",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjhgx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598982718.0
    },
    {
        "author": "Started-Late",
        "body": "I’m calling it boys, $60 on Intel by 9/18",
        "created_utc": 1598963125,
        "id": "g3kupgv",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kupgv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991925.0
    },
    {
        "author": "ShankThatSnitch",
        "body": "Yeah, but you also aren't responsible for other peoples money, and got lucky. What if NVDA pulled an INTC and ate shit over night?",
        "created_utc": 1598967155,
        "id": "g3l2xrg",
        "permalink": "/r/wallstreetbets/comments/ik2vki/rip_to_the_guy_who_took_out_a_15k_loan_for_30k_in/g3l2xrg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598995955.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Intel gonna absolutely fuck me 🥺",
        "created_utc": 1598967217,
        "id": "g3l33gz",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l33gz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996017.0
    },
    {
        "author": "DWINGMAN97",
        "body": "Very nice! I got in INTC yesterday after doing some TA and it looks really solid for continuation over the next month or so!",
        "created_utc": 1598965880,
        "id": "g3l014e",
        "permalink": "/r/StockMarket/comments/ikjue5/analysis_paralysis_hour_daily_market_insights/g3l014e/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598994680.0
    },
    {
        "author": "needcshelp1234",
        "body": "Buy amd options. Ever since Amd was more expensive than intc people have been saying buy intel",
        "created_utc": 1598965827,
        "id": "g3kzx89",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kzx89/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598994627.0
    },
    {
        "author": "almostmicrochip",
        "body": "INTEL entry point LOCATED\n\n\n\nENGAGE",
        "created_utc": 1598967498,
        "id": "g3l3thl",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3thl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996298.0
    },
    {
        "author": "enricosusatyo",
        "body": "Seriously, I’ve been an Intel shareholder for 5 years, and to be honest it’s not looking good for the company right now. \n\nIt’s cheap, I agree. But they gonna have to work hard to catch up to competitors.",
        "created_utc": 1598966807,
        "id": "g3l24hv",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l24hv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995607.0
    },
    {
        "author": "StonkGoUp",
        "body": "Annnnddd I’m down 25% on INTC already",
        "created_utc": 1598967259,
        "id": "g3l37fd",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l37fd/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1598996059.0
    },
    {
        "author": "laken906",
        "body": "FSLY, MSFT, RKT, SOXL, SPY, SE, IAU, INTC, VXX calls\n\nUUP puts\n\n10 for 10 premarket. Should prolly simplify the portfolio while I'm ahead this morning...",
        "created_utc": 1598962618,
        "id": "g3ktsg0",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ktsg0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598991418.0
    },
    {
        "author": "pervsensei11",
        "body": "Have TSLA, NVDA, PINS, NFLX, WORK, ZM, INTC calls and spreads\n\nCan’t wait for premarket",
        "created_utc": 1598945876,
        "id": "g3kc8l7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kc8l7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598974676.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing like a rebranding thing",
        "created_utc": 1598952960,
        "id": "g3kim3q",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kim3q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598981760.0
    },
    {
        "author": "REDmonster333",
        "body": "Intel. Even though it looks bleak short term. But long term they will still pull through. They have 10+ years of dominance, I doubt they wont catch up.",
        "created_utc": 1598952851,
        "id": "g3kiik2",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kiik2/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1598981651.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "It’s not gonna happen but if INTC gaps up to $60 I get the WSB logo tattooed. This isn’t even a bet. This is a goal.",
        "created_utc": 1598954092,
        "id": "g3kjn5f",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjn5f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982892.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC is up to $51.30 for +0.69% rn",
        "created_utc": 1598953629,
        "id": "g3kj7z9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kj7z9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982429.0
    },
    {
        "author": "ProPenguin800",
        "body": "Who else is playing Intel?",
        "created_utc": 1598946830,
        "id": "g3kd4xs",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd4xs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598975630.0
    },
    {
        "author": "august_thecow",
        "body": "INTC is severely underbought... might buy more calls at open before the announcement",
        "created_utc": 1598960784,
        "id": "g3kqmuf",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kqmuf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598989584.0
    },
    {
        "author": "Davidkanye",
        "body": "I mean, I’ve been watching past earnings plays and there’s still time Imo. \n\nAdditionally eyeing INTC. \n\nCurrent play are post earnings: ESTC, INTU, AMGN",
        "created_utc": 1598947233,
        "id": "g3kdic9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdic9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598976033.0
    },
    {
        "author": "Infernal-Affairs",
        "body": "if INTC hits $60 before eow\n\nI'll just sell my calls or something idk",
        "created_utc": 1598954353,
        "id": "g3kjvtu",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjvtu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598983153.0
    },
    {
        "author": "GamblingMikkee",
        "body": "JPM, CVS, INTC, MO, WBA. Almost all single digits",
        "created_utc": 1598957426,
        "id": "g3kmu1x",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kmu1x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598986226.0
    },
    {
        "author": "sven2123",
        "body": "I agree. Intel is cheap right now and will go back up once they smoothe out operations",
        "created_utc": 1598958975,
        "id": "g3kog5j",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kog5j/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598987775.0
    },
    {
        "author": "therealsparticus",
        "body": "AMD has already priced in half the growth of intel. Intel is their competition and is not a wimp.",
        "created_utc": 1598964236,
        "id": "g3kws71",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kws71/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993036.0
    },
    {
        "author": "DukeOfEarle88",
        "body": "AMD is going to get Intel this year- &amp; then quantum computers ftw.",
        "created_utc": 1598965074,
        "id": "g3kyeyx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kyeyx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993874.0
    },
    {
        "author": "DerTagestrinker",
        "body": "AMD will more than double within a year. It’s cap is only ~$100b and they are at this point at least two years ahead of Intels processor tech, especially for laptops. Intel has ~70% share so there is massive share for AMD to steal.",
        "created_utc": 1598966380,
        "id": "g3l13s5",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l13s5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995180.0
    },
    {
        "author": "PattayaGuy",
        "body": "AMD def has a ton of market share to eat away at. They're being aggressive in their road map and pushing forward while intel is jerking off in the corner. If AMD could deliver a beast GPU to match its Ryzen CPU's, they'd shoot straight up. NVidia isn't as lazy as intel though.",
        "created_utc": 1598963942,
        "id": "g3kw8b6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kw8b6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992742.0
    },
    {
        "author": "Cygopat",
        "body": "The only thing fundamentals do for you in this market is limit downside. There are very little plays for that available. Two weeks ago I bought INTC at $49. Buffett should have gotten into that but I guess it's not within his CoC.",
        "created_utc": 1598964026,
        "id": "g3kwe2p",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3kwe2p/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598992826.0
    },
    {
        "author": "Billionairess",
        "body": "Intel",
        "created_utc": 1598949028,
        "id": "g3kf4vt",
        "permalink": "/r/StockMarket/comments/ik3l3n/which_stocks_are_still_under_valued/g3kf4vt/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598977828.0
    },
    {
        "author": "R4N7",
        "body": "Oh I guess you’re diversified enough to not worrry. If RDSB is more then 5% of your portfolio you might sell half just to lower the risks and then buy again when you will see stock starting rebound. Actually I am in similar position with INTC (currently -9%) I am not buying more and not selling I am just holding without any actions. Time will show.",
        "created_utc": 1598960919,
        "id": "g3kquq2",
        "permalink": "/r/stocks/comments/ikhmdd/rdsb_shell_what_is_happening_to_the_price/g3kquq2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598989719.0
    },
    {
        "author": "Johnnyrocket47",
        "body": "Intc 50c 11/20",
        "created_utc": 1598946920,
        "id": "g3kd7wf",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd7wf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975720.0
    },
    {
        "author": "coachellathrowaway42",
        "body": "Intel 9/28 $50.5 C",
        "created_utc": 1598947689,
        "id": "g3kdxi7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdxi7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598976489.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC 1/15/21 $50c",
        "created_utc": 1598947104,
        "id": "g3kde04",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kde04/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975904.0
    },
    {
        "author": "Duke_of_Scotty",
        "body": "Did you see the part about Intel options. He's on track to learn that the first one is always free",
        "created_utc": 1598963542,
        "id": "g3kvh7d",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kvh7d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598992342.0
    },
    {
        "author": "Bellweirboy",
        "body": "Anyone bagholding Intel?",
        "created_utc": 1598963153,
        "id": "g3kur97",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kur97/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991953.0
    },
    {
        "author": "F1shB0wl816",
        "body": "Nio is one I’m hoping to explode but I figured there’s a lot of potential in the arkks too, a lot of that has a future and is still in complete infancy, it’s just a matter of what. Picking something that explodes like that will be a lucky pick though, some of it’s not even rational right now. \n\nI still think tsla, amd, and nvda have places to go though. Musk is just full of ideas, if 1 pans out for every 100, that could shake up the world as we know it. Amd will take over intels market eventually, they’re a head of the game, younger, fresher, intel just seems dated to me, lacking, it got high off its success and hasn’t thought straight since. Nvda is still making moves and growing fast and they have a handful of nice deals coming in the next few years.",
        "created_utc": 1598961463,
        "id": "g3krrgy",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krrgy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990263.0
    },
    {
        "author": "Berrymore13",
        "body": "Well my open is shaping up to be good. Holding NVDA, WORK, PINS, and INTC calls 🥰🤑",
        "created_utc": 1598964699,
        "id": "g3kxo8g",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kxo8g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993499.0
    },
    {
        "author": "Spaceseeds",
        "body": "Anybody who asks why intel has never looked at the fact that intel dominates the enterprise market and none of them are going to switch to AMD. The numbers are staggering. Intel has like over 80% of the market. They could outsource their chips and still be more successful than AMD. This doesn't even get into the rest of their business. I feel like Intel is a buy right now.",
        "created_utc": 1598964626,
        "id": "g3kxj41",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kxj41/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993426.0
    },
    {
        "author": "candidly1",
        "body": "AMD R&amp;D budget 1.5B\n\n\nINTC R&amp;D Budget  $13.3B\n\n\n\"jerking off\"",
        "created_utc": 1598965740,
        "id": "g3kzr0n",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kzr0n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598994540.0
    },
    {
        "author": "HBK05",
        "body": "uh..buy low sell high? Intel has been in charge of a lot of their market for the past 10+ years, they are only lacking behind for the past couple of years. I fully believe in their ability to bounce back eventually and compete with amd, hopefully pushing innovation and price/performance for consumer computers to the moon, but for now it's time to wait and see if they can pull it.",
        "created_utc": 1598963603,
        "id": "g3kvl5a",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kvl5a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992403.0
    },
    {
        "author": "therealsparticus",
        "body": "Anyone who has to deal with bare level cpu will tell you how good their engineering support is. Intel runs on ecosystem fuel. It’s their most.",
        "created_utc": 1598964055,
        "id": "g3kwfy6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kwfy6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992855.0
    },
    {
        "author": "sleepyguy007",
        "body": "intel, cisco, qualcomm, juniper etc were all huge bubble stocks in the tech bubble and were making tons of money.  \n\n\nThis tech bubble is just as bad and the same sort of mix of unprofitable companies, profitable overvalued companies, and now people just trying to cash out as fast as possible via SPACs and IPOs as there was then.  It might not be quite as steep a bubble yet, but its definitely getting there.  it took 4 years to go from 1200 -&gt; 5000 in 2000.   4 years ago the nasdaq was 5000 or so, so I could see it gettingto even 15000 and then crashing.  maybe not quite as big, but still as someone above mentioned economic conditions are far far worse now and we have much more debt than we did in 2000 as a nation",
        "created_utc": 1598955614,
        "id": "g3kl2if",
        "permalink": "/r/stocks/comments/ik5vev/why_the_stock_market_is_disconnected_from_the/g3kl2if/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598984414.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing  like a rebranding thing",
        "created_utc": 1598953918,
        "id": "g3kjhgx",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjhgx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598982718.0
    },
    {
        "author": "Started-Late",
        "body": "I’m calling it boys, $60 on Intel by 9/18",
        "created_utc": 1598963125,
        "id": "g3kupgv",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kupgv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991925.0
    },
    {
        "author": "DWINGMAN97",
        "body": "Very nice! I got in INTC yesterday after doing some TA and it looks really solid for continuation over the next month or so!",
        "created_utc": 1598965880,
        "id": "g3l014e",
        "permalink": "/r/StockMarket/comments/ikjue5/analysis_paralysis_hour_daily_market_insights/g3l014e/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598994680.0
    },
    {
        "author": "needcshelp1234",
        "body": "Buy amd options. Ever since Amd was more expensive than intc people have been saying buy intel",
        "created_utc": 1598965827,
        "id": "g3kzx89",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kzx89/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598994627.0
    },
    {
        "author": "laken906",
        "body": "FSLY, MSFT, RKT, SOXL, SPY, SE, IAU, INTC, VXX calls\n\nUUP puts\n\n10 for 10 premarket. Should prolly simplify the portfolio while I'm ahead this morning...",
        "created_utc": 1598962618,
        "id": "g3ktsg0",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ktsg0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598991418.0
    },
    {
        "author": "pervsensei11",
        "body": "Have TSLA, NVDA, PINS, NFLX, WORK, ZM, INTC calls and spreads\n\nCan’t wait for premarket",
        "created_utc": 1598945876,
        "id": "g3kc8l7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kc8l7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598974676.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing like a rebranding thing",
        "created_utc": 1598952960,
        "id": "g3kim3q",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kim3q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598981760.0
    },
    {
        "author": "REDmonster333",
        "body": "Intel. Even though it looks bleak short term. But long term they will still pull through. They have 10+ years of dominance, I doubt they wont catch up.",
        "created_utc": 1598952851,
        "id": "g3kiik2",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kiik2/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1598981651.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "It’s not gonna happen but if INTC gaps up to $60 I get the WSB logo tattooed. This isn’t even a bet. This is a goal.",
        "created_utc": 1598954092,
        "id": "g3kjn5f",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjn5f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982892.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC is up to $51.30 for +0.69% rn",
        "created_utc": 1598953629,
        "id": "g3kj7z9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kj7z9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982429.0
    },
    {
        "author": "ProPenguin800",
        "body": "Who else is playing Intel?",
        "created_utc": 1598946830,
        "id": "g3kd4xs",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd4xs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598975630.0
    },
    {
        "author": "august_thecow",
        "body": "INTC is severely underbought... might buy more calls at open before the announcement",
        "created_utc": 1598960784,
        "id": "g3kqmuf",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kqmuf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598989584.0
    },
    {
        "author": "Davidkanye",
        "body": "I mean, I’ve been watching past earnings plays and there’s still time Imo. \n\nAdditionally eyeing INTC. \n\nCurrent play are post earnings: ESTC, INTU, AMGN",
        "created_utc": 1598947233,
        "id": "g3kdic9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdic9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598976033.0
    },
    {
        "author": "Infernal-Affairs",
        "body": "if INTC hits $60 before eow\n\nI'll just sell my calls or something idk",
        "created_utc": 1598954353,
        "id": "g3kjvtu",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjvtu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598983153.0
    },
    {
        "author": "GamblingMikkee",
        "body": "JPM, CVS, INTC, MO, WBA. Almost all single digits",
        "created_utc": 1598957426,
        "id": "g3kmu1x",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kmu1x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598986226.0
    },
    {
        "author": "sven2123",
        "body": "I agree. Intel is cheap right now and will go back up once they smoothe out operations",
        "created_utc": 1598958975,
        "id": "g3kog5j",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kog5j/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598987775.0
    },
    {
        "author": "therealsparticus",
        "body": "AMD has already priced in half the growth of intel. Intel is their competition and is not a wimp.",
        "created_utc": 1598964236,
        "id": "g3kws71",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kws71/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993036.0
    },
    {
        "author": "DukeOfEarle88",
        "body": "AMD is going to get Intel this year- &amp; then quantum computers ftw.",
        "created_utc": 1598965074,
        "id": "g3kyeyx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kyeyx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993874.0
    },
    {
        "author": "PattayaGuy",
        "body": "AMD def has a ton of market share to eat away at. They're being aggressive in their road map and pushing forward while intel is jerking off in the corner. If AMD could deliver a beast GPU to match its Ryzen CPU's, they'd shoot straight up. NVidia isn't as lazy as intel though.",
        "created_utc": 1598963942,
        "id": "g3kw8b6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kw8b6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992742.0
    },
    {
        "author": "Cygopat",
        "body": "The only thing fundamentals do for you in this market is limit downside. There are very little plays for that available. Two weeks ago I bought INTC at $49. Buffett should have gotten into that but I guess it's not within his CoC.",
        "created_utc": 1598964026,
        "id": "g3kwe2p",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3kwe2p/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598992826.0
    },
    {
        "author": "Billionairess",
        "body": "Intel",
        "created_utc": 1598949028,
        "id": "g3kf4vt",
        "permalink": "/r/StockMarket/comments/ik3l3n/which_stocks_are_still_under_valued/g3kf4vt/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598977828.0
    },
    {
        "author": "R4N7",
        "body": "Oh I guess you’re diversified enough to not worrry. If RDSB is more then 5% of your portfolio you might sell half just to lower the risks and then buy again when you will see stock starting rebound. Actually I am in similar position with INTC (currently -9%) I am not buying more and not selling I am just holding without any actions. Time will show.",
        "created_utc": 1598960919,
        "id": "g3kquq2",
        "permalink": "/r/stocks/comments/ikhmdd/rdsb_shell_what_is_happening_to_the_price/g3kquq2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598989719.0
    },
    {
        "author": "Johnnyrocket47",
        "body": "Intc 50c 11/20",
        "created_utc": 1598946920,
        "id": "g3kd7wf",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd7wf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975720.0
    },
    {
        "author": "coachellathrowaway42",
        "body": "Intel 9/28 $50.5 C",
        "created_utc": 1598947689,
        "id": "g3kdxi7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdxi7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598976489.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC 1/15/21 $50c",
        "created_utc": 1598947104,
        "id": "g3kde04",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kde04/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975904.0
    },
    {
        "author": "Duke_of_Scotty",
        "body": "Did you see the part about Intel options. He's on track to learn that the first one is always free",
        "created_utc": 1598963542,
        "id": "g3kvh7d",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kvh7d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598992342.0
    },
    {
        "author": "Bellweirboy",
        "body": "Anyone bagholding Intel?",
        "created_utc": 1598963153,
        "id": "g3kur97",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kur97/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991953.0
    },
    {
        "author": "F1shB0wl816",
        "body": "Nio is one I’m hoping to explode but I figured there’s a lot of potential in the arkks too, a lot of that has a future and is still in complete infancy, it’s just a matter of what. Picking something that explodes like that will be a lucky pick though, some of it’s not even rational right now. \n\nI still think tsla, amd, and nvda have places to go though. Musk is just full of ideas, if 1 pans out for every 100, that could shake up the world as we know it. Amd will take over intels market eventually, they’re a head of the game, younger, fresher, intel just seems dated to me, lacking, it got high off its success and hasn’t thought straight since. Nvda is still making moves and growing fast and they have a handful of nice deals coming in the next few years.",
        "created_utc": 1598961463,
        "id": "g3krrgy",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krrgy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990263.0
    },
    {
        "author": "Berrymore13",
        "body": "Well my open is shaping up to be good. Holding NVDA, WORK, PINS, and INTC calls 🥰🤑",
        "created_utc": 1598964699,
        "id": "g3kxo8g",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kxo8g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993499.0
    },
    {
        "author": "Spaceseeds",
        "body": "Anybody who asks why intel has never looked at the fact that intel dominates the enterprise market and none of them are going to switch to AMD. The numbers are staggering. Intel has like over 80% of the market. They could outsource their chips and still be more successful than AMD. This doesn't even get into the rest of their business. I feel like Intel is a buy right now.",
        "created_utc": 1598964626,
        "id": "g3kxj41",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kxj41/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993426.0
    },
    {
        "author": "candidly1",
        "body": "AMD R&amp;D budget 1.5B\n\n\nINTC R&amp;D Budget  $13.3B\n\n\n\"jerking off\"",
        "created_utc": 1598965740,
        "id": "g3kzr0n",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kzr0n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598994540.0
    },
    {
        "author": "HBK05",
        "body": "uh..buy low sell high? Intel has been in charge of a lot of their market for the past 10+ years, they are only lacking behind for the past couple of years. I fully believe in their ability to bounce back eventually and compete with amd, hopefully pushing innovation and price/performance for consumer computers to the moon, but for now it's time to wait and see if they can pull it.",
        "created_utc": 1598963603,
        "id": "g3kvl5a",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kvl5a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992403.0
    },
    {
        "author": "therealsparticus",
        "body": "Anyone who has to deal with bare level cpu will tell you how good their engineering support is. Intel runs on ecosystem fuel. It’s their most.",
        "created_utc": 1598964055,
        "id": "g3kwfy6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kwfy6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992855.0
    },
    {
        "author": "sleepyguy007",
        "body": "intel, cisco, qualcomm, juniper etc were all huge bubble stocks in the tech bubble and were making tons of money.  \n\n\nThis tech bubble is just as bad and the same sort of mix of unprofitable companies, profitable overvalued companies, and now people just trying to cash out as fast as possible via SPACs and IPOs as there was then.  It might not be quite as steep a bubble yet, but its definitely getting there.  it took 4 years to go from 1200 -&gt; 5000 in 2000.   4 years ago the nasdaq was 5000 or so, so I could see it gettingto even 15000 and then crashing.  maybe not quite as big, but still as someone above mentioned economic conditions are far far worse now and we have much more debt than we did in 2000 as a nation",
        "created_utc": 1598955614,
        "id": "g3kl2if",
        "permalink": "/r/stocks/comments/ik5vev/why_the_stock_market_is_disconnected_from_the/g3kl2if/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598984414.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing  like a rebranding thing",
        "created_utc": 1598953918,
        "id": "g3kjhgx",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjhgx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598982718.0
    },
    {
        "author": "Started-Late",
        "body": "I’m calling it boys, $60 on Intel by 9/18",
        "created_utc": 1598963125,
        "id": "g3kupgv",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kupgv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991925.0
    }
]