[
    {
        "author": "Meymo",
        "body": "The people that have money on this sub were buying. I’m not going to name users but there were plenty of us who have benefited from this crash. The people who are risk averse were not buying and were predicting further doom. Coincidently, they are the same people still predicting doom.\n\nThe best thing I can say is that you should buy on a regular cadence. Whether it’s every pay period or every month, you should be invested.",
        "created_utc": 1594609842,
        "id": "fxw6y2a",
        "permalink": "/r/investing/comments/hq78jm/why_couldnt_anyone_predict_that_tech_was_going_to/fxw6y2a/",
        "score": 23,
        "subreddit": "investing",
        "created": 1594638642.0
    },
    {
        "author": "Meymo",
        "body": "If you're looking for an echo chamber, you'll find it here. This subreddit loves value stocks and dividends, so you're going to get a lot of people who agree with your assertion.\n\nPeople are hoping for the \"bubble\" to pop because things are \"too expensive\" in their minds. Unfortunately, many of these people will not be buyers even as the market is dropping, because they don't have any money. They'll be busy making predictions on how far the market will drop and sitting in cash talking about how cash is amazing. Then when the market goes back up they'll be the first ones complaining about how they missed their opportunity again. People in this sub tend to be extremely risk averse and stubborn. These same people get irritated every day as they see their value stocks doing nothing while growth stocks continue to march forward.\n\nI've posted this portfolio last year, when talking about portfolio construction. I think that you need more than 3 stocks (so don't just buy this blindly), but here is a combination of three stocks that have beaten the SPY for the past 26 years (and yes, I discussed this portfolio last year and it's still winning). (WM,INTU,MSFT): [https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=1985&amp;firstMonth=1&amp;endYear=2020&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=1&amp;annualAdjustment=1000&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=2&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;showYield=false&amp;reinvestDividends=true&amp;benchmark=VFINX&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=WM&amp;allocation1\\_1=33&amp;symbol2=INTU&amp;allocation2\\_1=33&amp;symbol3=MSFT&amp;allocation3\\_1=34](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=1985&amp;firstMonth=1&amp;endYear=2020&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=1&amp;annualAdjustment=1000&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=2&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;showYield=false&amp;reinvestDividends=true&amp;benchmark=VFINX&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=WM&amp;allocation1_1=33&amp;symbol2=INTU&amp;allocation2_1=33&amp;symbol3=MSFT&amp;allocation3_1=34)\n\nI'll repeat again because people seem to miss it: You should have more than 3 stocks if you're going to pick stocks. I prefer 8-15 per composite portfolio. The key to this is that you need to keep investing on a consistent basis. That way when the market goes down, sideways, or up, you're accumulating more shares.\n\nInvesting should never be a one-time event. Treat your investments like a bill and make a habit of buying into them on a regular cadence.\n\nIf you're interested in growth stocks, compile a list of the ones that you want to buy into, and then start doing some research. If you would prefer someone else manage the growth (so you can skip the research part), you could buy into an ARK ETF or a ZVN ETF/fund.",
        "created_utc": 1594489674,
        "id": "fxpn8bc",
        "permalink": "/r/investing/comments/hpd6ve/are_we_really_in_a_tech_bubble/fxpn8bc/",
        "score": 13,
        "subreddit": "investing",
        "created": 1594518474.0
    },
    {
        "author": "Dabble1234",
        "body": "No one wants to sell. There is always consistent flows into the market causing upward pressure on price.  401k, pension, etc. which buy on cadence. A lot of the typical selling pressures were removed this year including required minimum distributions for anyone over 69.5. Paused this year. Trump and Washington literally gamed the market. It’s too funny.",
        "created_utc": 1594132503,
        "id": "fx7ie0b",
        "permalink": "/r/wallstreetbets/comments/hmrv6e/daily_discussion_thread_for_july_07_2020/fx7ie0b/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594161303.0
    },
    {
        "author": "zpowell2180",
        "body": "I'm a new investor buying in for the first time tomorrow. Here's what I'm planning:\n\nVGT - 25%\n\nWMT - 12.5%\n\nEA - 12.5%\n\nT - 12.5%\n\nLLY - 12.5%\n\nAMP - 12.5%\n\nCDNS - 12.5%\n\nAny advice would be appreciated. I'm wondering if I should add more ETFs or other sectors?",
        "created_utc": 1594604442,
        "id": "fxvyexp",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fxvyexp/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594633242.0
    },
    {
        "author": "lockhartbeat",
        "body": "Don’t sleep on any of the CDNs, there are others not trading anywhere near the multiples Fastly and Cloudflare are, with comparable revenues",
        "created_utc": 1594582203,
        "id": "fxuvgb4",
        "permalink": "/r/wallstreetbets/comments/hpyb43/upset_you_missed_the_fsly_train_dont_fear_ive/fxuvgb4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594611003.0
    },
    {
        "author": "knowledgemule",
        "body": "i think when it was first ipo'd it was in a weird no man's land of healthcare and tech and now the multiple clearly endorses the tech view. I met w/ them at a conference and it all makes sense to me. clearly costs too high - this is a very cheap total cost ownership thing that is sold to who actually cares about the costs being too high, your employer lol. The healthcare system wants them higher forever. Do some light searches in the diabetes forums about LVGO - will be helpful too. If they become a defacto standard it really gets going. All in all seems like an \"obviously\" good idea. \n\nMeanwhile CDNs lol. i have done a lot work and it's clear they have some special execution going on at FSLY, but AKAM invented this category and has only ceded share",
        "created_utc": 1594156356,
        "id": "fx8vmgt",
        "permalink": "/r/SecurityAnalysis/comments/hmtaly/fastly_edge_compute_explained/fx8vmgt/",
        "score": 2,
        "subreddit": "SecurityAnalysis",
        "created": 1594185156.0
    },
    {
        "author": "fastfrequency",
        "body": "CDNs are only getting started - most businesses will need this service with the increase in internet traffic\n\nCloudflare is a top CDN with excellent track record\n\nGet in now before the huge rally that is coming up",
        "created_utc": 1594617487,
        "id": "fxwhi16",
        "permalink": "/r/investing/comments/hq8tid/get_in_price_for_net/fxwhi16/",
        "score": 2,
        "subreddit": "investing",
        "created": 1594646287.0
    },
    {
        "author": "110Baud",
        "body": "I think CDNs are a very strong growth segment in general going forward and NET is one of the best. As for timing, with rapidly rising high-flyers like that I've found the best thing is to just buy it if I really want it, without trying to wait for a better entry. They have a strong tendency to just keep shooting up if I sit on the sidelines waiting, and by the time I get that nice entry I wanted, I'm usually paying more, even with a pullback, than I would have paid back at the start. Sure, sometimes it bites you, but the odds seem to favor just going for it. Even if it drops a chunk right afterwards, if it's really growing that fast it'll make it back up pretty quickly. Unless a stock is cycling in a trading range, timing is pretty much pure luck.\n\nMy only exception is if the stock just did a massive one-day spike up, then I wait a couple days to make sure it's not just going to whipsaw back down, and will hold at the new level at least for a while.",
        "created_utc": 1594635714,
        "id": "fxx09sk",
        "permalink": "/r/investing/comments/hq8tid/get_in_price_for_net/fxx09sk/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594664514.0
    },
    {
        "author": "fastfrequency",
        "body": "CDNs have been banned by China",
        "created_utc": 1594669496,
        "id": "fxymvjb",
        "permalink": "/r/stocks/comments/hqkgou/is_net_and_fsly_good_buys/fxymvjb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594698296.0
    },
    {
        "author": "moondoginyoureyes",
        "body": "Comrade, I don't give two shits if tiktok lives or dies.  It is a shit platform. While you have time, research DNS and IP addresses and CDNs. Your Putin bucks are about to be worthless like your mother's ass potatoes. Pfft.",
        "created_utc": 1594110733,
        "id": "fx6r2b2",
        "permalink": "/r/investing/comments/hmp6tg/us_looking_at_banning_chinese_social_media_apps/fx6r2b2/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594139533.0
    },
    {
        "author": "RogueJello",
        "body": "&gt; Intel hasn't been able to move there in house manufacturing to processes smaller 14nm for quite some time.\n\nI don't believe this is true.  Cannon Lake, Icelake, Tigerlake, and Sapphire Rapids are all 10 nm.  Supposedly they'll have 7 nm in 2021.  This is all ignoring the disagreements about exactly how to measure these nodes mean.\n\nTSMC definitely have the lead in the fab development cadence, it will be interesting to see how things play out.  Their location in Taiwan seems to be their biggest weakness with the current cold war between China and the US heating up.\n\nAs I said, I like NVIDIA and AMD, but I can't help noticing TSMC is a P/E of ~25 vs NVIDIA at 75, and AMD at 126.  I think I'd pick TSM before either of these stocks.",
        "created_utc": 1594223309,
        "id": "fxbn53l",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxbn53l/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594252109.0
    },
    {
        "author": "wtf_is_up",
        "body": "Do you have any opinions on EDA tools (CDNS, SNPS)?",
        "created_utc": 1593860492,
        "id": "fww695d",
        "permalink": "/r/investing/comments/hkbz2f/thoughts_on_asml/fww695d/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593889292.0
    },
    {
        "author": "Erdos_0",
        "body": "I own some CDNS and that is the basis of my thesis and good way to gain long term exposure to the semiconductor industry.",
        "created_utc": 1593780697,
        "id": "fwstvfr",
        "permalink": "/r/SecurityAnalysis/comments/hil7s1/how_a_handful_of_chip_companies_came_to_control/fwstvfr/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1593809497.0
    },
    {
        "author": "r3dd1t0rxzxzx",
        "body": "It IS material because you are the one who said that they are worth 500,000x a typical worker household (you spuriously used a meth head as a straw man when I don’t know many meth heads with $100k net worth). Your evidence for this is “their value is incalculable” (random opinion) which would only be true if you think it is impossible for someone else to do anything similar to what they did. Logically, if Elon Musk did not exist at all it would be entirely unsurprising if someone else would come along and spot the same issue and run with it (multiple people had already tried and just been slightly early). Not in the exact same way or cadence, but it would happen cause all the tech and environmental factors are there. Their cars could have been vastly superior for all you know. \n\nAt the end of the day, the fundamental question is whether a billionaire would have still started their company without the promise of quite as much money (fractions less). The obvious answer is yes given that many of them started in garages. They were trying to make money, but you would be hard pressed to find someone who says “if I didn’t make $100 billion I wouldn’t have started my company”. The vast majority of people start companies for much much less. \n\nSo, if you still would get the same level of innovation AND be able to invest more in the country’s infrastructure/education/health to accelerate growth &amp; innovation then that would be an obvious win. However, for some reason, people who are not billionaires, such as yourself, seem to feel compelled to pontificate wildly about why we should save billionaires a few % on their tax for no discernible reason other than the possible delusion that they themselves will be a billionaire some day.",
        "created_utc": 1594486273,
        "id": "fxp9fnf",
        "permalink": "/r/investing/comments/hp5031/elon_musk_is_now_richer_than_warren_buffett/fxp9fnf/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594515073.0
    },
    {
        "author": "K215215",
        "body": "CDNs like Fastly, Cloudflare and Atlassian all are critical business infrastructure for tech companies. ZS, CRWD, OKTA are cyber security - doesn't matter how the customers are doing, with more of their business online, they need more security. Veeva, Oracle, SAP are enterprise resource planners that's business dont fluctuate based on customer success - again critical business infrastructure.  Twilio, Band &amp; Ring all have improved business from wfh with an increased need for online communications. Also, Shopify only needs its customers opening and running storefronts",
        "created_utc": 1594341015,
        "id": "fxhcjqe",
        "permalink": "/r/wallstreetbets/comments/hoa9dp/what_are_your_moves_tomorrow_july_10_2020/fxhcjqe/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594369815.0
    },
    {
        "author": "Recoil42",
        "body": "Hilarious if true, since neither NET nor FSLY have much to do with WFH — they're static CDNs.",
        "created_utc": 1593698307,
        "id": "fwp38zp",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwp38zp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593727107.0
    },
    {
        "author": "notbrokemexican",
        "body": "1. It's not a zero sum game\n\n2. Look at my DD on the subject. it's clear you don't understand how CDNs work with regards to everything else. You basically said the infrastructure that supports SEA is more valuable than what built it depends on to exist. Lol",
        "created_utc": 1593814187,
        "id": "fwuicrw",
        "permalink": "/r/stocks/comments/hkpu8t/fastly_cloudflare_sea_limited/fwuicrw/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593842987.0
    },
    {
        "author": "shadowpawn",
        "body": "Better than looking for a job. $16K day and no asshole boss on Monday AM Sales Cadence call saying how he could do a better job selling our shite.",
        "created_utc": 1594065019,
        "id": "fx4qoqr",
        "permalink": "/r/wallstreetbets/comments/hmeujr/how_many_of_you_have_turned_trading_into_a_full/fx4qoqr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594093819.0
    },
    {
        "author": "-xenomorph-",
        "body": "I don’t wanna get too lengthy in my reply, but basically compared the fundamentals. Read and compared both their 10k and recent SEC filings. Cloudflare has a lot of customers, I’m liking their financials, the negatives are since  they’re spending a lot on research and development. As for me personally there is some uncertainty with regards to how they will convert most of their free, I believe they will and maybe this has been priced in... who knows.\n\nI also spent time getting some qualitatives. I work in tech but not with CDNs. I asked a bunch of my ex coworkers, current ones and friends about cloudflare and fastly from a product perspective. Almost everyone knew cloudflare and only a few heard of fastly. Everyone who knew fastly and use it , liked it and same with cloudflare. There were few negatives , but nothing concerning since to me  since it felt like personal preferences rather than bad product. But then again I’m not in this field... so. \n\nApart from this I also listened to both their recent shareholder calls, it’s promising to me. Read a bunch of analysis, and viewed some of the management interviews on CNBC and stuff. It looks like Fastly has a very techy management compared to Cloudflare. I wouldn’t be surprised if Fastly actually ends up being superior in long run but doesn’t mean cloudflare is gonna lag behind, also considering their current stock prices Fastly is getting a kinda expensive and less growth potential compared to couldflare, but this is speculative of me and just something I’m comfortable betting on. Both are long play and I’m just gonne DCA into both and not even consider looking at the stock price next 5 yrs, except looking into 10K and Q to make sure nothing is going terribly bad with the financials.",
        "created_utc": 1594136377,
        "id": "fx7puy0",
        "permalink": "/r/stocks/comments/hmi0ov/good_stocks_for_the_next_month/fx7puy0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594165177.0
    },
    {
        "author": "notbrokemexican",
        "body": "I apologize for directing users that are interested in learning more about CDNs. Have a nice weekend.",
        "created_utc": 1594589555,
        "id": "fxv905q",
        "permalink": "/r/wallstreetbets/comments/hpyb43/upset_you_missed_the_fsly_train_dont_fear_ive/fxv905q/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594618355.0
    },
    {
        "author": "wtf_is_up",
        "body": "CDNS AMT EQIX GDS",
        "created_utc": 1594335605,
        "id": "fxh2v5l",
        "permalink": "/r/investing/comments/ho7mq2/whos_selling_the_pickaxes/fxh2v5l/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594364405.0
    },
    {
        "author": "thug_funnie",
        "body": "CDNs are pick axes. Fastly, limelight, etc.\n\nCybersecurity is shovels. CrowdStrike, Akamai\n\nBasically look at all the apps on your phone and figure out who those companies use to run their businesses.",
        "created_utc": 1594340095,
        "id": "fxhaz32",
        "permalink": "/r/investing/comments/ho7mq2/whos_selling_the_pickaxes/fxhaz32/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594368895.0
    },
    {
        "author": "tuart",
        "body": "why are zero other CDNs building out infrastructure with it?  the fact so many people are bearish on it is a good sign for me.  this shit will be $200 in one year.",
        "created_utc": 1594220919,
        "id": "fxbi90d",
        "permalink": "/r/wallstreetbets/comments/hnegmj/daily_discussion_thread_for_july_08_2020/fxbi90d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594249719.0
    },
    {
        "author": "speaknovel",
        "body": "I've had a mortgage with Cadence for \\~1 year and everything has gone smoothly so far. Customer service is very good and never had any excessive fees, weird charges, etc. \n\nNo idea from an investor standpoint though.",
        "created_utc": 1594245005,
        "id": "fxcx69t",
        "permalink": "/r/investing/comments/hnoe5k/any_opinion_on_cadence/fxcx69t/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594273805.0
    },
    {
        "author": "dvdmovie1",
        "body": "At this moment not much - growth has had an extraordinary year and unless this time is real, real different I can't imagine that the kind of performance you've seen in growth will be repeated in the back half of the year. I'd be pretty stunned if there's not a healthy correction in things like SaaS at some point in the near-term. \n\nI'd look at anything that improves/changes the patient experience in regards to medicine. Teladoc will probably be a long-term winner after this situation is over as adoption of telemedicine has been significantly pulled forward by this. Livongo, as well. Twilio is certainly not a telehealth play, but is powering a number of them (https://www.twilio.com/healthcare.) Testing also continues to improve in terms of the patient experience with things like Exact (EXAS), Guardant Health (GH) and others. I think healthcare is absolutely a place to look for growth and potentially really durable, sustainable growth if it improves aspects of the patient experience, saves money or other improvements.\n\nI think people have to invest in what they're interested in and what I'm interested in someone else may not be, but personally I think digital payments given what is going on is a theme that should be emphasized; I think a lot of the growth of the next few years in digital payments has been pulled forward by what is going on. Paypal's CEO called the current situation a \"tipping point\" (\" and I believe we will look back at this time as a tipping point, where digital payments both offline and online became an essential element of our lives, hastening the demise of cash, enforcing a reimagination of commerce, retailing and the payment system, and we intend to be a driving force as those trends unfold\") in the move away from cash and I don't disagree. Additionally, Venmo and Square Cash have seen increased adoption during this and even Bank of America's CEO said this finally pushed seniors to adopting digital banking.\n\nTech - cyber security (CRWD), identity management (OKTA), communications (RNG, FIVN, BAND, TWLO), data analytics (AYX), healthcare (VEEV), monitoring (DDOG), business spend management (COUP), ad tech (TTD), science (SDGR) and others (MSFT, etc.)  As more people don't want to handle paperwork during this, look at DOCU. EVBG provides crisis management software and likely continues to benefit. \n\nE commerce: along with digital payments, I think years of growth in e-commerce have been pulled forward. Things that offer the building blocks (SHOP, WIX, to a lesser degree SQ), sales tax automation (AVLR) and names both in the US (AMZN, ETSY) and elsewhere (MELI, SE.) There were a number of people skeptical of Kroger's investment and partnership with robotic grocery warehouse operator Ocado (OCDGF), now this happened, lots of people are grocery shopping online and Ocado said during the peak the level of traffic was like a \"denial of service\" attack. The stock is +58% YTD.\n\nFiverr is kind of an interesting marketplace stock as more and more digital freelance work is transacted online, but the stock has ramped considerably already in recent months. Match has done a surprisingly decent job navigating through this crisis and now has been spun off from IAC so IAC becomes something to look at as a Berkshire-esque portfolio company looking at internet brands with money to invest.\n\nEveryone wants into betting stocks and I do think that online betting will be a larger market in the years ahead as more and more states look for revenue. However, I said the other day that when you start seeing ETFs for a hot newer theme, it's probably not a great sign near-term. Delays in sports returning will also probably cause some volatility.  Evolution Gaming (EVVTY) is kind of an interesting name that nobody has discussed that is worth watching on a pullback; they provide a sort of \"Peloton-esque\" casino experience online with dealers and other operators in studios around the world (https://www.evolutiongaming.com/live-casino-studios) They also partner with others (like Draftkings) and can provided branded live experiences online (https://www.evolutiongaming.com/who-we-are/customers)  Has done quite well and perhaps something that hasn't been talked about for those interested in the theme.\n\nI still think Roku is an interesting play if they can continue to work deals to ensure that the apps of interest are included. There has been a few bumps lately, including HBO Max. Still, the company has a bit over 39M active accounts that streamed nearly 14B hours of programming last quarter. The more accounts the more essential Roku becomes to launch a new streaming service, the more engagement that active accounts have with their Roku, the more ads served. They bought their own ad tech company and I think people continue to view Roku as \"that device company\" when really the focus is the advertising business.  The downside of that is ad spending in a downturn but over the long haul more ad dollars are going to continue to flee linear TV. Funny enough at the lows in March, there was an offering of 5.5M shares to sell at slightly lower than the close of the day. That was the literal bottom in the stock and it was Fox selling their stake. \n\nOne more thing that people should look to focus on is internet traffic and what benefits from considerable growth in internet traffic. CDNs have done very well this year - Cloudflare said in the last quarterly call that \"growth in internet traffic has been unprecedented, across our platform. We saw as much growth in traffic in 12 weeks as we have seen in the previous 12 months.\" FSLY has basically become the new ZM and is way overbought after more than tripling in the span of a few months. I think there will be no shortage of demand for data infrastructure REITs - SBAC/EQIX/AMT/CCI (or the SRVR etf) What are pure plays that really benefit (and have demonstrated that they benefit) from increased internet demand? \n\nI'd be very cautious about investing in much at this point; there's growth funds up almost 60% YTD - which is insane - and it's only the beginning of July (https://www.morningstar.com/funds/xnas/zvnbx/performance), but I think it's a good time to really work on a shopping list and think about the next 5 years and where one sees things going. I've said for the last few months there's a lot of growth themes that are accelerating due to this (and you've heard many companies talk about it) and there's a lot of things that were already in decline where that decline will be faster because of this. There's a lot of focus on what to be concerned about on this sub and I think people have to really focus some on where they see things going because there will continue to be opportunities. \n\nEven in something like department stores which has been an absolutely awful sector for a while, who benefits if one or more players go away?  If people move away from cities, who benefits in more rural areas (TSCO), who benefits if there's a lot of close out merchandise from stores closing (OLLI), etc. \n\nSo this is the time IMO to think through where one sees themes in the coming years, where one sees opportunities, create the shopping list and patiently wait for better opportunities.",
        "created_utc": 1593947790,
        "id": "fwzmf1w",
        "permalink": "/r/investing/comments/hjvudf/daily_advice_thread_all_basic_help_or_advice/fwzmf1w/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593976590.0
    },
    {
        "author": "alkaline119",
        "body": "AKAM is one of the world's largest CDNs. Amazon has one, too (CloudFront). But FSLY and NET are considered to be the leaders. FSLY, especially, is well positioned to dominate. Here's a good write up on FSLY and their advantages. It's a bit technical.\n\nhttps://softwarestackinvesting.com/fastly-edge-compute-explained/",
        "created_utc": 1593996804,
        "id": "fx1xhqx",
        "permalink": "/r/stocks/comments/hlwsef/edge_computing/fx1xhqx/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594025604.0
    },
    {
        "author": "ftc1234",
        "body": "lol \n\nCDNs have a central master point to control the content distribution. That is the whole reason you have a CDN. US government can cripple that master by regulation and domain attacks.",
        "created_utc": 1594109886,
        "id": "fx6q88h",
        "permalink": "/r/investing/comments/hmp6tg/us_looking_at_banning_chinese_social_media_apps/fx6q88h/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594138686.0
    },
    {
        "author": "analyst52",
        "body": "Would deff like to chat more since you seemed well-knowledges on CDNs.",
        "created_utc": 1594158532,
        "id": "fx902kc",
        "permalink": "/r/SecurityAnalysis/comments/hmtaly/fastly_edge_compute_explained/fx902kc/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1594187332.0
    },
    {
        "author": "dawhizkid",
        "body": "CDNs are a commodity 👏👏👏",
        "created_utc": 1594307054,
        "id": "fxffpoz",
        "permalink": "/r/wallstreetbets/comments/ho0krw/daily_discussion_thread_for_july_09_2020/fxffpoz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594335854.0
    },
    {
        "author": "wgfdark",
        "body": "Cloudflare is a [CDN](https://en.wikipedia.org/wiki/Content_delivery_network), but on steroids.  So the reason I'm bullish on it more has to do with WASM (web assembly) and the future of web + serverless (bad name, because it's not really serverless).  Essentially the web is (quietly) shifting towards a different structure, in which companies are able to get more of their content to customers using CDNs for cheaper, easier, and way more endpoints than using cloud providers (like AWS, azure, etc).  It is *kind of* a replacement for AWS (though the two work together now, and will still in the future).  Basically you shift what gets done on big servers to the browser.  Companies would want to make this move because it's cheaper for them.  Hence more customers for CDN companies. \n\nCloudflare is pushing for this architecture, fastly supports it but isn't as bullish on it.  I also wouldnt exactly call Fastly and Cloudflare competitors, they appeal to two different types of developers.",
        "created_utc": 1594421689,
        "id": "fxkwdwu",
        "permalink": "/r/investing/comments/hoslq1/what_tech_stocks_would_you_invest_in_today_with/fxkwdwu/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594450489.0
    },
    {
        "author": "FinndBors",
        "body": "Do you know a lot of extremely rich people? I do. Nobody I know will be paying six digits for a 5 minute ride. There may be a few, but not enough to sustain a multi-billion dollar business.\n\nAlso look at their track record. They took deposits starting in 2005. Maybe at some point they will actually launch customers, but it will be a long time (perhaps never) before they could do it at a cadence that would be profitable. Remember, their space plane takes 6 passengers per trip. How often have they test flown that thing?\n\nAlso they have competition. Blue Origin is working on doing the same thing at roughly the same cost. They seem way more competent and have deeper pockets than SPCE. SpaceX is going straight to orbital with fully reusable larger rockets (which will scale). Who would go on a 5-minute suborbital ride when with orbital might cost the same?",
        "created_utc": 1594666151,
        "id": "fxyftt7",
        "permalink": "/r/investing/comments/hqinvz/spce_and_twtr/fxyftt7/",
        "score": 0,
        "subreddit": "investing",
        "created": 1594694951.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"Wow. These are great insights. Thank you so much! \"\n\nNo problem.\n\n\" I just thought that all ETFs helped mitigate most risk, but that’s not always the case.\"\n\nNope. There are very few actively managed funds that really do attempt to sidestep downturns to some degree and fewer that have a decent track record doing it. One is little-known mutual fund Provident Trust (PROVX, https://www.mutualfundobserver.com/2018/12/provident-trust-strategy-fund-provx/, \"Investors remember that this period includes the 2007-09 financial crisis. What they may not know is that in 2008, the fund lost 21.0% compared to the S&amp;P 500’s 37.0% decline. That ranked the fund in the 1st percentile.\n\nWhile paralyzed investors and central banks struggled, the fund held between 61% in cash and fixed income instruments at the end of ’08 and 70% at the market bottom in March ’09. That positioning dramatically reduced the fund’s losses compared to the market, while giving it ample “dry powder” for the gains that followed. During Provident’s tenure as portfolio manager to September 30, 2018, PROVX gained +389% cumulatively with a 79.8% average month-end allocation to equities vs. +348% for the always fully invested S&amp;P 500.\")\n\nSo that's an example of a fund where managers will start to move to the sideline if they think it's prudent to do so. Not entirely - you're still going to lose some money - just probably not as much as the market in a downturn. \n\nIf it's a bad year most funds are going to have a bad year and the letter will be basically, \"Hey, sorry it was a bad year.\"\n\nStock index funds are going to go down in a downturn whatever the index does.\n\n\"I remember seeing a video interview of this analyst on Robinhood who said that the tech bubble right now is bigger than the dot com bubble was in the 2000s.\"\n\nI don't think this is the dot com bubble again. I do think that after the bottom in March, you saw a widening of the gap between the performance of the market and the performance of certain growth themes that were either less impacted by this or benefited from it. E-commerce, digital payments, cloud, software, telehealth and the \"stay at home\" names (Peloton, Netflix, etc.) Even the \"buy a home online\" names, as things like Zillow finally started to seem to have a sustained gain for once as people are now apparently comfortable buying houses virtually. People basically ran towards what they thought benefited today and I think what many people thought the future is going to look like post-crisis. I think what's been very frustrating on this sub this year has been this focus on the negative, when I think a compelling topic really is, what are the themes post-crisis that will be big? How does the world change in the next 3-5 years? **I think what's done extraordinarily well this year is in part due to the result of people asking themselves that question and investing accordingly.** The ARKW and ARKF have themes listed on the main pages for those funds and you look at those themes and those have absolutely been the places to be this year.\n\nIn the short-term, I have a hard time believing that the correct answer to concerning statistics will continue to be \"just buy more growth (Zoom, etc) stocks.\" At some point that will either stop working and broad market pullback or there will be a solution to this crisis and when that happens you're going to see a considerable rotation out of the Ark-style growth stocks and into impacted names that have lagged, but I think that is going to be buying opportunity for growth. \n\nYou've saw this sort of \"tale of two markets\" again on Thursday and Friday of last week: Thursday the Dow was down 300 but growth stocks were ramping. There was the Gilead news on Friday and the Dow was up 300 but many of the growth stocks were down.\n\nMuch of my own portfolio is similarly aggressive growth to Ark or Scottish Mortgage and I would not be surprised if at some point in the near-term much of my portfolio lost 20% in a hurry. The problem is when: I thought there was going to be a pullback in May - didn't happen. I have a long-term view on what I own so I may trim a little here, add a little there at times but happy not doing much of anything for long stretches. Additionally, I'm not a major market timer or do I have any desire to be. But after a really fantastic first half of the year, I really don't think that I'm going to have a repeat of that kind of performance in the back half of the year and I'm sitting here fully expecting a considerable pullback. If I manage to get through the second half of the year without a considerable pullback in my portfolio, I will be 1) stunned and 2) have to question whether this time is actually somehow different. I've said recently that I did a lot in March and April and then have since gone back to doing not much and am happy with long stretches of doing little-to-nothing. I'm okay with investing in aggressive growth stocks, but where I'm increasingly cautious is where/how much I add to things. \n\nBut, long story short, I think there are compelling long-term growth themes and growth may continue up for a while, but it is overextended and a considerable correction at some point in the relatively near-term would be so not surprising that it would be pretty remarkable imo if it didn't happen. Broadly, if you're not risk tolerant (and there's nothing wrong with that), then the ARK funds would not be something I'd recommend (great when things are fantastic for growth, going to be rough when it's not - they've had an amazing year, but people have to be cognizant of things capable of having those kinds of gains in that short a time period are also capable of going the wrong direction just as swiftly, if not swifter) or at the most would be a *tiny* bit to have exposure to some themes long-term - but I'd be particularly cautious about where you bought them.",
        "created_utc": 1594552724,
        "id": "fxtiqod",
        "permalink": "/r/investing/comments/hmtd5f/daily_advice_thread_all_basic_help_or_advice/fxtiqod/",
        "score": 2,
        "subreddit": "investing",
        "created": 1594581524.0
    },
    {
        "author": "thunder89",
        "body": "From what I've read (bc I'm not an \"experienced\" trader) that can happen with any level of experience. It's just good to be cognizant of it.\n\nAlso, check out gambler's fallacy while we're on the topic",
        "created_utc": 1594335774,
        "id": "fxh36mn",
        "permalink": "/r/pennystocks/comments/hocmv8/awh_dd/fxh36mn/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1594364574.0
    },
    {
        "author": "mewtrader",
        "body": "I'd naturally agree that it seems rather uncaring, but not knowing him or much about him, I don't reduce him to a rapacious individual, perhaps I could be informed of such, but he could simply be unaware, uninvolved, and indifferent. This is likely more a function of personality that's not directly tied to greed but results in a nonaction that is then perceived as cruelty. You choosing to donate is an active choice. Not giving away your earnings is the default state, a state of nonaction, because in such a state the subject is assumed to be incognizant of any particular demand. The same way you aren't cruel for not having donated to a particular starving child yesterday -- that is a default state of nonaction. Now your brain has become cognizant of the concept of starving children. Reading this, you may or may not choose to donate respondingly. Does not donating make you cruel? Perhaps, perhaps not. It's up to interpretation.",
        "created_utc": 1594547362,
        "id": "fxtdlgw",
        "permalink": "/r/stocks/comments/hpoew2/bill_gates_could_have_been_worth_800_billion_today/fxtdlgw/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594576162.0
    },
    {
        "author": "notbrokemexican",
        "body": "Ok. I have my retirement portfolio and I'm aware of EWW.\n\nLike I said - I'm making my own portfolio and I'm cognizant of its optimality. \n\nI'm not even going to be nice about it - everyone regurgitates the same shit. I get the common sense aspect of 3 fund portfolios and the Effecient market \n\n\nI'm here for a discussion on stock picking and INVESTING in something. Anyone who invests has a fucking god damn retirement portfolio.",
        "created_utc": 1594581153,
        "id": "fxuthpt",
        "permalink": "/r/investing/comments/hpyu28/usmca_mexicanamerican_investment_ideas/fxuthpt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594609953.0
    },
    {
        "author": "cashflow_",
        "body": "Just being cognizant of sugar intake is huge",
        "created_utc": 1594175924,
        "id": "fx9uydb",
        "permalink": "/r/wallstreetbets/comments/hn1zzv/what_are_your_moves_tomorrow_july_08_2020/fx9uydb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594204724.0
    },
    {
        "author": "notbrokemexican",
        "body": "Ok, I do this as a hobby. This isn't my life. I enjoy reading business news. I have my retirement portfolio. Why is it so hard to have a discussion on stock picking in this forum? Everybody says the same thing. I already put this in my post. I said I was cognizant of optimality.",
        "created_utc": 1594580970,
        "id": "fxut56m",
        "permalink": "/r/investing/comments/hpyu28/usmca_mexicanamerican_investment_ideas/fxut56m/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594609770.0
    },
    {
        "author": "Chuckox50",
        "body": "Yes, it’s a good idea \n\nI think this is a particularly perilous time in the market, so really be cognizant of your asset allocation.",
        "created_utc": 1594663817,
        "id": "fxyawcl",
        "permalink": "/r/stocks/comments/hqigq6/cash_on_hand/fxyawcl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594692617.0
    },
    {
        "author": "rrrrrrrx123",
        "body": "3000 shares. Please read again. Also, bear or bull, being cognizant to manipulation is good. Gives you room to exit positions.",
        "created_utc": 1594259344,
        "id": "fxdnewq",
        "permalink": "/r/wallstreetbets/comments/hnp5x6/did_you_see_the_woman_in_the_red_dress_two_weeks/fxdnewq/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594288144.0
    },
    {
        "author": "uchoz",
        "body": "Great stuff. Thanks for sharing.\n\nOn DXC, I think the investor has low conviction on where shares trade a month from now. So investor buys puts tight to current trading price and sells call a corresponding amount of calls to make it costless. Ideally shares go up and investor makes 10% or $15 mil plus any dividends. If shares go down, investor keeps dividends and tries again in August.\n\nJust out of curiosity, how did you know the investor is holding $150 mil in shares? And is there a good way to screen for unusual option activity? Great finds tho",
        "created_utc": 1593658617,
        "id": "fwnmuwr",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fwnmuwr/",
        "score": 4,
        "subreddit": "options",
        "created": 1593687417.0
    },
    {
        "author": "FutureBayStreeter",
        "body": "How did you find out that the DXC options were linked to a $150m long position?",
        "created_utc": 1593658684,
        "id": "fwnmysp",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fwnmysp/",
        "score": 3,
        "subreddit": "options",
        "created": 1593687484.0
    },
    {
        "author": "Rice_Knows",
        "body": "Very large call buying on DXC 18c 8/21... \n\nalso VERY large volume today at 10AM \\~9.25M shares... \n\nsomeone hedging with covered calls maybe?",
        "created_utc": 1593616218,
        "id": "fwl8uaw",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl8uaw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593645018.0
    },
    {
        "author": "LargeFatherOrtiz",
        "body": "Why are there 93,000 DXC 17c 8/21",
        "created_utc": 1593614559,
        "id": "fwl5l6z",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl5l6z/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593643359.0
    },
    {
        "author": "Spuri0n",
        "body": "DXC 8/21 16p, looks like fake news",
        "created_utc": 1593613885,
        "id": "fwl4av6",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl4av6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593642685.0
    },
    {
        "author": "therealdonp",
        "body": "Crazy call vol on DXC Aug17C (93k vs 278 OI) no idea why, but that's enough DD for me",
        "created_utc": 1593618999,
        "id": "fwlef1j",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlef1j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593647799.0
    },
    {
        "author": "MoneyBaggy",
        "body": "This looks great swaggy!\n\nUnusualwhales saw some similar movement in their analysis on DXC a few days ago [https://gyazo.com/850e0bbcc987988673f2cb688a48d148](https://gyazo.com/850e0bbcc987988673f2cb688a48d148)\n\nas well as  on BMY earlier today: [https://gyazo.com/06b7185acf74984bcb9442a3ea064e80](https://gyazo.com/06b7185acf74984bcb9442a3ea064e80)\n\nYou should team up with the developer there. He is always looking for help and contributions.",
        "created_utc": 1593661158,
        "id": "fwnqvhm",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fwnqvhm/",
        "score": 1,
        "subreddit": "options",
        "created": 1593689958.0
    },
    {
        "author": "Patriotnation5",
        "body": "100k volume on DXC 8/21 17c. What's up with that? Earnings on 8/4.",
        "created_utc": 1593669949,
        "id": "fwo2wr8",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwo2wr8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593698749.0
    },
    {
        "author": "Competitive_Kick4851",
        "body": "Thanks for sharing this. Regarding DXC, what makes you so sure that the Call strike was a sale? It was transacted at the offer, not mid or the bid. This could be a simple premium play where the player does not expect a big move before expiration and is slightly bullish, selling premium on both side before a rally.",
        "created_utc": 1593958108,
        "id": "fwzz78i",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fwzz78i/",
        "score": 1,
        "subreddit": "options",
        "created": 1593986908.0
    },
    {
        "author": "zigtrade",
        "body": "high vol stocks for possible yolo bets this week: \n\nAPA\n\nCCL\n\nDFS\n\nDXC\n\nHAL\n\nMGM\n\nNCLH\n\nOXY\n\nPVH\n\nSYF\n\nTPR\n\nplease place your votes",
        "created_utc": 1594041158,
        "id": "fx3gn02",
        "permalink": "/r/wallstreetbets/comments/hm51pm/daily_discussion_thread_for_july_06_2020/fx3gn02/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594069958.0
    },
    {
        "author": "zigtrade",
        "body": "this weeks yolo list ... what should i do?\n\nAPA  CCL  DFS  DXC  HAL  MGM  NCLH  OXY  PVH  SYF  TPR",
        "created_utc": 1594041977,
        "id": "fx3hwhk",
        "permalink": "/r/wallstreetbets/comments/hm51pm/daily_discussion_thread_for_july_06_2020/fx3hwhk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594070777.0
    },
    {
        "author": "Sjourn",
        "body": "Why does your second link to DXC refer to DexCom Inc (DXCM)?",
        "created_utc": 1593717896,
        "id": "fwq9rcy",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fwq9rcy/",
        "score": 1,
        "subreddit": "options",
        "created": 1593746696.0
    },
    {
        "author": "thelostclam",
        "body": "DXC is holding a vote right now on selling more stock and changing the structure of their compensation package to employees to include stock. Could this just be tied to the possibility of stock release? Basically a hedge on a dip in stock value depending on the outcome of the vote?",
        "created_utc": 1593687058,
        "id": "fwol2sl",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fwol2sl/",
        "score": 1,
        "subreddit": "options",
        "created": 1593715858.0
    },
    {
        "author": "dooblr",
        "body": "Were the DXC positions filled?",
        "created_utc": 1593700633,
        "id": "fwp89vj",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fwp89vj/",
        "score": 1,
        "subreddit": "options",
        "created": 1593729433.0
    },
    {
        "author": "Crackbot420-69",
        "body": "Also an equal number of DXC Aug $ 16 puts",
        "created_utc": 1593619209,
        "id": "fwleuic",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwleuic/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593648009.0
    },
    {
        "author": "ss218145",
        "body": "DXC announced they were hacked",
        "created_utc": 1594051744,
        "id": "fx3zr2k",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fx3zr2k/",
        "score": 1,
        "subreddit": "options",
        "created": 1594080544.0
    },
    {
        "author": "GoobyFRS",
        "body": "I'm watching GTX, DXC, and UMC",
        "created_utc": 1593851307,
        "id": "fwvxnuf",
        "permalink": "/r/StockMarket/comments/hkcnkx/what_stocks_are_you_eyeballing_for_next_week/fwvxnuf/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593880107.0
    },
    {
        "author": "johngotti",
        "body": "DXC $17c 08/21/2020\n\nVALE $10p 07/31/2020\n\nSONO $25c 08/21/2020\n\nCASHGANG?",
        "created_utc": 1594037676,
        "id": "fx3bu3j",
        "permalink": "/r/wallstreetbets/comments/hm51pm/daily_discussion_thread_for_july_06_2020/fx3bu3j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594066476.0
    },
    {
        "author": "j_bonk",
        "body": "Puts on DXC, any date after earnings. It's gonna be less than $10/sh",
        "created_utc": 1593617541,
        "id": "fwlbgqb",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlbgqb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593646341.0
    },
    {
        "author": "ob-j",
        "body": "&gt; DXC \n\nThe FUCK is this random ass ticker lol",
        "created_utc": 1593614661,
        "id": "fwl5sdf",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl5sdf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593643461.0
    },
    {
        "author": "satincactus7",
        "body": "Great stuff, really appreciate it. How were you able to identify the large stock position behind all those DXC moves?",
        "created_utc": 1593707816,
        "id": "fwpoi83",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fwpoi83/",
        "score": 1,
        "subreddit": "options",
        "created": 1593736616.0
    },
    {
        "author": "mrantoniodavid",
        "body": "DXC... isn't this just a basic collar?  From that .. you know what their motivation was.  Assuming of course the strategy they picked aligns with their motivation.",
        "created_utc": 1593688025,
        "id": "fwom4vo",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fwom4vo/",
        "score": 1,
        "subreddit": "options",
        "created": 1593716825.0
    },
    {
        "author": "GoatTrade",
        "body": "100K VOLUME JUST PLACED ON DXC 17C AUG 21 AFTER EARNINGS",
        "created_utc": 1593613647,
        "id": "fwl3usb",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl3usb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593642447.0
    },
    {
        "author": "Krusher4Lyfe",
        "body": "DXC 8/21 17c 😳",
        "created_utc": 1593613757,
        "id": "fwl4278",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl4278/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593642557.0
    },
    {
        "author": "centosanjr",
        "body": "DXC had a ransomware attack that we weren't privvy to till today.\n\n&amp;#x200B;\n\n[https://finance.yahoo.com/news/dxc-identifies-ransomware-attack-part-022000393.html](https://finance.yahoo.com/news/dxc-identifies-ransomware-attack-part-022000393.html)",
        "created_utc": 1594006290,
        "id": "fx2cj7m",
        "permalink": "/r/options/comments/hjmxrq/todays_unusual_options_activity_tickers_bmy_dxc/fx2cj7m/",
        "score": 1,
        "subreddit": "options",
        "created": 1594035090.0
    },
    {
        "author": "xorasun",
        "body": "Isn’t ticker symbol $HPQ for Hewlett Packard? $HPE is Hewlett Packard Enterprise Co. which is legally separate company.",
        "created_utc": 1594660053,
        "id": "fxy2zea",
        "permalink": "/r/wallstreetbets/comments/hqj3jx/dd_buy_hpe_like_right_now_today_tendies_print/fxy2zea/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594688853.0
    },
    {
        "author": "101emptyfireplaces",
        "body": "Yeah I like 8-12.\nGot my long term holders: MSFT, V, DIS, MCD\nGot my ETFS: VTI, ARKG, ARKW\nGot my short term plays: HPQ, NKE, NLCH\nAnd got my gambles: DKNG, SPCE",
        "created_utc": 1594408919,
        "id": "fxk7uex",
        "permalink": "/r/stocks/comments/horqot/how_many_stocks_is_appropriate_for_a_portfolio/fxk7uex/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594437719.0
    },
    {
        "author": "bgalli",
        "body": "There’s a few older posts holding some DD if anyone feels like searching. Still hold true.  Client A represents about 1.5b in sales and recurring maintenance. Contracts to be determined and signed end of august.\n\nThere’s an unknown B &amp; C, B is modeling torches, C is entering negotiations to just buy.\n\nPlasma induration torches represent a large reduction in GHG over traditional burning methods.\n\nThere are multiple lines: they sell waste destruction furnaces to the us military\n\nThey sell Drosrite, which extracts aluminum from aluminum waste without the use of salts\n\nOwn a 10% stake and supplying technology to HPQ, refining silicone at a much cheaper price than can be currently done (25% of the cost roughly), and of a purity good enough for solar use (99.999)\n\nModeling contract with a boring company to drill holes\n\nRecycling titanium powders for implant use\n\n\nGE uses their old tech for titanium powders and was once the standard",
        "created_utc": 1593788224,
        "id": "fwt65dv",
        "permalink": "/r/pennystocks/comments/hk6cf2/pyrogenesis_ramping_up_for_another_run_on_news_of/fwt65dv/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593817024.0
    },
    {
        "author": "jackneefus",
        "body": "Now that you mention it, XRX does seem to be overlooked and undervalued. They have negative growth, which kills stock valuation.  Other than that, XRX may have potential.  \n\nThe price has been fairly stable before and after March, and during their attempt to acquire Hewlett-Packard .    Since calls are getting squashed the last few weeks, maybe this is a better stock than an option.",
        "created_utc": 1594390553,
        "id": "fxj6n43",
        "permalink": "/r/wallstreetbets/comments/homrji/xrx_inhale_the_crotch_fumes/fxj6n43/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594419353.0
    },
    {
        "author": "spacegrab",
        "body": "short the obvious ERs.\n\nPuts on GRPN, BBBY, HPQ, all printed pretty heavily around ER time. The reckoning of failed quarterly reports is nigh.\n\nI haven't done my research on ERs next week yet.",
        "created_utc": 1595046077,
        "id": "fyfmag0",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyfmag0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595074877.0
    },
    {
        "author": "BanffandBoujee",
        "body": "HPQ and PYR are definitely hold for the next 2 months. I personally own 1900 shares of PYR!",
        "created_utc": 1593944716,
        "id": "fwzjjbx",
        "permalink": "/r/pennystocks/comments/hlidn1/hpq_silicon_hpqtsxv_investors_starting_to_figure/fwzjjbx/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593973516.0
    },
    {
        "author": "bgalli",
        "body": "The million mile battery has to do with using a silicon graphite anode and nickel cathode, not the actual lithium. Currently the hold backs are the 30k$/kg refining cost of silicon of the right purity, and the particle size.\n\nLook up HPQ silicon on the tsx-v if you want to read about it. They have signed NDAs for their battery tech, but they have the refining process using PUREVAP technology. Can refine to 99.99999% pure silicon and in the micron particle size for a fraction of the cost.\n\nIf their tech is proven, we could see 4000mile batteries with it. Lots of competition in this space tho, so who knows how it’ll all flesh out.",
        "created_utc": 1594186907,
        "id": "fxaauzr",
        "permalink": "/r/pennystocks/comments/hnb0z9/speculative_lithium_play_pev/fxaauzr/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594215707.0
    },
    {
        "author": "connmattwhite",
        "body": "HPQ 🚀 it will go to the moon baby! THE MOON! I will finally be able to afford the new Ford bronco for my wife’s second boyfriend",
        "created_utc": 1594981739,
        "id": "fychiv3",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fychiv3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595010539.0
    },
    {
        "author": "TheOstrichThing",
        "body": "HP inc or HPQ siliconces inc?",
        "created_utc": 1594985441,
        "id": "fyclhbt",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fyclhbt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595014241.0
    },
    {
        "author": "19wekamper",
        "body": "I leave for basic next week so I would like advice before I go \nBoeing 24% \nMsft 20%\nInseego 10%\nVivent solar 10%\nHPQ 10%\nPH 8% \nSCHD 8% \nMEI 5% \nCarnival MetLife and Altria are like 1-3% for the rest",
        "created_utc": 1593735717,
        "id": "fwr85dh",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fwr85dh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593764517.0
    },
    {
        "author": "devtendo",
        "body": "Long Vmw\nShort HPQ\nShort INTL\nLong NVDA\n\nUse options to make it as risky as you want",
        "created_utc": 1594832812,
        "id": "fy5u9ok",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy5u9ok/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594861612.0
    },
    {
        "author": "tmssqtch",
        "body": "Also, after the failed HPQ offer, wouldn’t HP be better positioned for the possible WFH future?",
        "created_utc": 1594905823,
        "id": "fy90sqp",
        "permalink": "/r/ValueInvesting/comments/hs6ck9/xerox_xrx/fy90sqp/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1594934623.0
    },
    {
        "author": "highlyordinary",
        "body": "HPQ GO BR \n\nEven split of incredibly risky short term calls expiring on the same day. \n\nPrinter go brrrrrr let’s goooooooooooooooo",
        "created_utc": 1594838659,
        "id": "fy66sco",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy66sco/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594867459.0
    },
    {
        "author": "boomdynasty",
        "body": "how is INTC looking to everyone? is it a good long term hold?",
        "created_utc": 1593598661,
        "id": "fwkj39f",
        "permalink": "/r/stocks/comments/hj63kf/rstocks_daily_discussion_wednesday_jul_01_2020/fwkj39f/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627461.0
    },
    {
        "author": "awxomexd",
        "body": "Now might be a good time to buy. They've just dropped Intel completely from their base model products.",
        "created_utc": 1593594850,
        "id": "fwkfdav",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkfdav/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593623650.0
    },
    {
        "author": "Captaincadet",
        "body": "You mean they dropped intel from ALL computers and taking their computers to in house ARM processors in the next 2 years.\n\nIt looks promising from the developer kit so maybe now’s the time to buy as they won’t have to pay intel which should make their computers more profitable going forward",
        "created_utc": 1593599027,
        "id": "fwkjgi4",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkjgi4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627827.0
    },
    {
        "author": "sp3xl",
        "body": "It’s going to be 200B-ish market cap in case intel dies completely. That puts it at 3x growth potential from what we have now.",
        "created_utc": 1593604556,
        "id": "fwkpk13",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpk13/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633356.0
    },
    {
        "author": "madnutbutter",
        "body": "US needs curfew and mandatory masks. Too many white woke kids colonized the BLM like their great grandparents colonized Africa. They don't understand they are manipulated by foreign intel and corporate interests to do rioting, attack police, attack cars and spread the rona.\n\nMarket will stay volatile with many crashes and pumps. I think we can say finally that the mouse is fuk.",
        "created_utc": 1593602547,
        "id": "fwkn5wd",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkn5wd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593631347.0
    },
    {
        "author": "boomdynasty",
        "body": "how is INTC looking to everyone? is it a good long term hold?",
        "created_utc": 1593598661,
        "id": "fwkj39f",
        "permalink": "/r/stocks/comments/hj63kf/rstocks_daily_discussion_wednesday_jul_01_2020/fwkj39f/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627461.0
    },
    {
        "author": "awxomexd",
        "body": "Now might be a good time to buy. They've just dropped Intel completely from their base model products.",
        "created_utc": 1593594850,
        "id": "fwkfdav",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkfdav/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593623650.0
    },
    {
        "author": "Captaincadet",
        "body": "You mean they dropped intel from ALL computers and taking their computers to in house ARM processors in the next 2 years.\n\nIt looks promising from the developer kit so maybe now’s the time to buy as they won’t have to pay intel which should make their computers more profitable going forward",
        "created_utc": 1593599027,
        "id": "fwkjgi4",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkjgi4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627827.0
    }
]