[
    {
        "author": "HealerWarrior",
        "body": "&gt; What are the alternatives?\n\nLiterally any of the actual brokerages (Fidelity, TDA, CS, Vanguard).",
        "created_utc": 1595188541,
        "id": "fyl7aqd",
        "permalink": "/r/stocks/comments/hu4pmo/how_do_investment_firms_and_companies_in_general/fyl7aqd/",
        "score": 327,
        "subreddit": "stocks",
        "created": 1595217341.0
    },
    {
        "author": "BrunoRib",
        "body": "Is he going to get it? Because this picture says [Otherwise](https://i.imgur.com/onNdpuF_d.webp?maxwidth=640&amp;shape=thumb&amp;fidelity=medium)",
        "created_utc": 1595372020,
        "id": "fytdgbx",
        "permalink": "/r/wallstreetbets/comments/hvh6ue/amzn_3800_call_cant_go_tits_up/fytdgbx/",
        "score": 214,
        "subreddit": "wallstreetbets",
        "created": 1595400820.0
    },
    {
        "author": "spyVSspy420-69",
        "body": "I’m fairly sure the Fidelity mobile app was designed by a team of people who haven’t ever used a smartphone before.",
        "created_utc": 1595704309,
        "id": "fz80lya",
        "permalink": "/r/wallstreetbets/comments/hxo91u/14k_159k_4_this_is_what_happens_when_you_never/fz80lya/",
        "score": 93,
        "subreddit": "wallstreetbets",
        "created": 1595733109.0
    },
    {
        "author": "eloc49",
        "body": "\\+1 for Fidelity. Left RH after the first big outage when covid was first hitting the US markets. Haven't looked back. Not as pretty, but gets the job done. Still use RH for news though, haven't found a decent alternative there yet.",
        "created_utc": 1595194048,
        "id": "fylhcx0",
        "permalink": "/r/stocks/comments/hu4pmo/how_do_investment_firms_and_companies_in_general/fylhcx0/",
        "score": 87,
        "subreddit": "stocks",
        "created": 1595222848.0
    },
    {
        "author": "hoogetraps",
        "body": "I have decided to leave robinhood. I’m taking my talents to Fidelity.",
        "created_utc": 1595884252,
        "id": "fzg1tyj",
        "permalink": "/r/wallstreetbets/comments/hyzs0g/what_are_your_moves_tomorrow_july_28_2020/fzg1tyj/",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1595913052.0
    },
    {
        "author": "JP2205",
        "body": "Why don’t people just use Fidelity, Scwab, Etrade etc.  I’m older but just never saw the appeal of Robinhood, Webull etc.  can someone explain it?    Free trades almost everywhere.",
        "created_utc": 1595701071,
        "id": "fz7ul6t",
        "permalink": "/r/wallstreetbets/comments/hxo91u/14k_159k_4_this_is_what_happens_when_you_never/fz7ul6t/",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1595729871.0
    },
    {
        "author": "IguaneRouge",
        "body": "Or Fidelity.",
        "created_utc": 1596146067,
        "id": "fzslv0n",
        "permalink": "/r/stocks/comments/i0tm7d/apple_splitting_shares_41/fzslv0n/",
        "score": 66,
        "subreddit": "stocks",
        "created": 1596174867.0
    },
    {
        "author": "toomuchtodotoday",
        "body": "ACATS'd my accounts to Fidelity awhile ago, Vanguard's tech story is a shitshow. Lots of inertia, no motivation to improve, they're an old financial services firm who doesn't comprehend that tech is the differentiator now (and they'll just outsource it to Infosys).\n\nExpense ratios are so low across the board for non-actively managed funds, it makes no sense to be at Vanguard anymore. I keep Schwab for investment income management and a checking account that reimburses ATM fees globally, Fidelity for tax advantaged accounts, 529, etc (their cash management account is good as well, but only domestic ATM fee reimbursement).\n\nDisclosure: I work in financial services, but not for any of the orgs mentioned in this comment.",
        "created_utc": 1595270280,
        "id": "fyonnd2",
        "permalink": "/r/investing/comments/huphqe/vanguard_transfers_1300_jobs_to_outsourcing_giant/fyonnd2/",
        "score": 62,
        "subreddit": "investing",
        "created": 1595299080.0
    },
    {
        "author": "__TriggerHappy__",
        "body": "Some relevant points for interested potential investors:\n\n- this is an OTC stock which means 1) there is no pre-market trading and 2) you cannot trade it on Robinhood. You will need to use another broker, like eTrade, Fidelity, etc. to purchase this stock. \n\n- this is going to open up tomorrow with a gigantic spike UNLESS news comes out in PM that somehow nullifies the expected reverse merger. Such news is unlikely at this point. \n\n- “buy the rumor, sell the news” is excellent advice for penny stocks, but does not really apply here. If you’ve followed this sub closely the last several weeks, you’ve undoubtedly seen PASO mentioned numerous times, but it’s never been a ‘pump’ stock so to speak, like IDEX, SOLO, GNUS, XSPA, IZEA, BIOC, BYFC, NBRV... the list goes on. This is largely due to its status as an OTC, but also because a gag order has been in place to outlaw any PR about the upcoming deal, therefore stifling any solid catalysts and subsequent short-term trader enthusiasm. This is not something penny stocks do; this is what huge companies (like the $50B company handling this merger) do. \n\n- so how tf does PASO play into this? Essentially, they’re a shell. CLX has been openly wanting to go public for some time now. The easiest way to go public without filing a separate IPO is an RM with a partnered, joint venture company who is already trading on the market. Hence the letter of intent (LOI) explicitly stating CLX’s intentions to merge with PASO. \n\n- I’m always a proponent of selling before news with pennies, simply because the rumor is almost ALWAYS more valuable than the news itself. Personally I believe this one to be different. You see on this sub, and others, tons of posts saying ‘this is a great long term hold’, and I hope most are right, but it’s highly unlikely. To me, this scenario looks like a similar type of deal as NKLA, going from ~$15 to $30, then $80s not much later. PTs I’m seeing are 0.3 (2.3x of 7/14 closing price), but that was before the news that TRU is involved. \n\nOpen disclaimer: I own 9000 @ 0.114\n\nAs always, good luck to everyone, and may the stock winds be ever in your favor.",
        "created_utc": 1594781550,
        "id": "fy3trkq",
        "permalink": "/r/pennystocks/comments/hre92v/dd_on_why_paso_will_run_soon/fy3trkq/",
        "score": 59,
        "subreddit": "pennystocks",
        "created": 1594810350.0
    },
    {
        "author": "bigdickofwallstreet",
        "body": "Easier interface on mobile which makes trades quicker to do and easier to understand for new traders. For instance, on Fidelity you choose the strike first using a scroll wheel and then the strike date. Then they show the price for that specific option. Don't even bother asking how to do a spread on mobile . Too complex for short term traders. Buy and hold its ok",
        "created_utc": 1595703499,
        "id": "fz7z495",
        "permalink": "/r/wallstreetbets/comments/hxo91u/14k_159k_4_this_is_what_happens_when_you_never/fz7z495/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1595732299.0
    },
    {
        "author": "MasterCookSwag",
        "body": "I realize that most people here are very new to investing and tend to think that's an accurate statement, so I'm sure there's going to be plenty of angry comments in my inbox after this, but that isn't remotely true. \n\nCommissions have been steadily declining since May day in 1975 with the removal of the price fixing requirements.  Reaching zero was a logical endpoint, they'd fallen from nearly $40-60 per trade in the 70s down to $20 in the 90s, $10 in the 00's, and sub $5 all well before Robinhood was a thing.  Charles Schwab(the person) had said his eventual goal was to get commissions down to 0 decades ago. \n\nAnd frankly Robinhood's model doesn't work.  It's not a profitable company.  There had been zero commission brokers before and they all failed as well because nobody figured out how to make it sustainable - from that standpoint Schwab and Fidelity have really lead the way in changing the brokerage platform to one that can sustain profits from things like fund management and NIM without the need to push commissions.  The entire reason why the TD deal happened is because they weren't ready for zero commissions and everyone else was.  RH can continue to burn VC cash for a while so it's of little consequence to them but let's not pretend like Schwab, Vanguard, and Fidelity have been shifting their revenue streams for decades towards management fees and NIM because of a broker that just started.  \n  \nAlso, to be quite frank, Robinhood largely caters to a trader that isn't profitable for most brokers.  They hold low amounts of cash but trade often and don't care about spreads much - this is how they're able to generate significantly more cashflow from order flow than other firms.  \n\nCrediting robinhood with creating the current commission environment basically ignores everything that's happened in securities regulation and brokerage structure from the 70s till today and instead just presumes that there wasn't already downward trajectory in fees prior to like 2016.  I get that people who just started investing in the last few years, likely with Robinhood, might not be aware of all of these things so there's that, but IMO it's somewhat absurd to credit them here.  It's like saying they were the reason your team won the game when they showed up to the stadium with 2 minutes left, and made a field goal while your team was already up by four touchdowns.  The only way you could think that is if you only turned the game on with a minute and a half left.",
        "created_utc": 1595352014,
        "id": "fys8inm",
        "permalink": "/r/investing/comments/hv5quk/robinhood_cancels_uk_launch/fys8inm/",
        "score": 55,
        "subreddit": "investing",
        "created": 1595380814.0
    },
    {
        "author": "JonathanL73",
        "body": "100% this.\n\nI ditched RH after the Covid Fiasco to Fidelity. Once Fidelity went zero-commission and fractional-shares long before RH, there was no really no reason to stay with RH especially if you’re going to be locked out of buying stocks during a dip.\n\nThe app is definitely not as pretty or flexible but like you said it gets the job done.\n\n&gt; haven't found a decent alternative there yet.\n\nWebull seems to be an alternative I’ve heard good things about, but it’s owned by a Chinese company which makes me nervous to use it though.",
        "created_utc": 1595197123,
        "id": "fyln0j4",
        "permalink": "/r/stocks/comments/hu4pmo/how_do_investment_firms_and_companies_in_general/fyln0j4/",
        "score": 51,
        "subreddit": "stocks",
        "created": 1595225923.0
    },
    {
        "author": "UpTheDownEscalator",
        "body": "If you're in the US, call a bank/broker like Fidelity or Charles Schwab. Ultimately you'll open an account with them and then likely mail copies of those papers in to be converted to stock which will be deposited into your account, digitally.",
        "created_utc": 1594587828,
        "id": "fxv5vsy",
        "permalink": "/r/StockMarket/comments/hq19a5/im_sure_this_has_been_asked_a_thousand_times_but/fxv5vsy/",
        "score": 49,
        "subreddit": "StockMarket",
        "created": 1594616628.0
    },
    {
        "author": "p0intbreak",
        "body": "Fuck that fidelity millionaire",
        "created_utc": 1594238881,
        "id": "fxckg3e",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxckg3e/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1594267681.0
    },
    {
        "author": "msiekkinen",
        "body": "&gt; also, lol @ fidelity mobile.\n\nIf it prints, it prints",
        "created_utc": 1595864140,
        "id": "fzevi7z",
        "permalink": "/r/wallstreetbets/comments/hyss5w/1m_in_gold_gains/fzevi7z/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1595892940.0
    },
    {
        "author": "j33tAy",
        "body": "oh, i agree. i use fidelity all my majority of my investment accounts \n\ni'm laughing because fidelity is one of the best brokers out there but a good portion of the sub doesn't use them",
        "created_utc": 1595864343,
        "id": "fzevxgi",
        "permalink": "/r/wallstreetbets/comments/hyss5w/1m_in_gold_gains/fzevxgi/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1595893143.0
    },
    {
        "author": "j33tAy",
        "body": "fuck yeah, good work.\n\nalso, lol @ fidelity mobile.",
        "created_utc": 1595858650,
        "id": "fzekul2",
        "permalink": "/r/wallstreetbets/comments/hyss5w/1m_in_gold_gains/fzekul2/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1595887450.0
    },
    {
        "author": "jhonkas",
        "body": "fidelity shows principal vs net gains, best of both worlds",
        "created_utc": 1595352772,
        "id": "fysa3xz",
        "permalink": "/r/wallstreetbets/comments/hv8w2j/psa_robinhood_artificially_inflates_your_percent/fysa3xz/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1595381572.0
    },
    {
        "author": "InvestingNerd2020",
        "body": "Fidelity or Charles Schwab.  Both are great choices, but Fidelity has free Index mutual funds and fractional share purchasing ability for all stocks and ETFs.  Schwab has great travel perks and slightly better customer service.",
        "created_utc": 1595271340,
        "id": "fyopuw1",
        "permalink": "/r/investing/comments/huphqe/vanguard_transfers_1300_jobs_to_outsourcing_giant/fyopuw1/",
        "score": 34,
        "subreddit": "investing",
        "created": 1595300140.0
    },
    {
        "author": "msiekkinen",
        "body": "Majority uses robin hood b/c fidelity what their parents used so \"that's for boomers\", then end up posting loss porn when their \"broker\" is offline for the 10th time for the year.",
        "created_utc": 1595864636,
        "id": "fzewj1i",
        "permalink": "/r/wallstreetbets/comments/hyss5w/1m_in_gold_gains/fzewj1i/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1595893436.0
    },
    {
        "author": "ukfan758",
        "body": "🟢Fidelity🟢 gang rise up",
        "created_utc": 1595408342,
        "id": "fyusvim",
        "permalink": "/r/wallstreetbets/comments/hvnnm2/_/fyusvim/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1595437142.0
    },
    {
        "author": "bonerfly",
        "body": "Yes Fidelity or Schwab will take care of you.",
        "created_utc": 1594593478,
        "id": "fxvg5ct",
        "permalink": "/r/StockMarket/comments/hq19a5/im_sure_this_has_been_asked_a_thousand_times_but/fxvg5ct/",
        "score": 27,
        "subreddit": "StockMarket",
        "created": 1594622278.0
    },
    {
        "author": "Laundry_Service",
        "body": "Going to your bank is generally going to lead you to poor results when it comes to ~~finances~~ investments. Try Vanguard, Fidelity or Schwab. These are all reputable.",
        "created_utc": 1594604890,
        "id": "fxvz5cx",
        "permalink": "/r/StockMarket/comments/hq19a5/im_sure_this_has_been_asked_a_thousand_times_but/fxvz5cx/",
        "score": 26,
        "subreddit": "StockMarket",
        "created": 1594633690.0
    },
    {
        "author": "fbstalker98",
        "body": "Oh, hell no. I hope Infosys isn't going to be working on the trading software. KCG lost over 400 million within 45 minutes: [https://en.wikipedia.org/wiki/Knight\\_Capital\\_Group](https://en.wikipedia.org/wiki/Knight_Capital_Group)\n\nI'm going to have to research how to move my funds to Fidelity, and I recommend you all do the same. If Infosys is touching those critical parts, it's not if but when there's going to be a multi-billion dollar loss day, and class action lawsuits against Vanguard. Infosys are literally bottom of the barrel programmers who couldn't get jobs anywhere else.",
        "created_utc": 1595268501,
        "id": "fyojy99",
        "permalink": "/r/investing/comments/huphqe/vanguard_transfers_1300_jobs_to_outsourcing_giant/fyojy99/",
        "score": 25,
        "subreddit": "investing",
        "created": 1595297301.0
    },
    {
        "author": "BigAlTrading",
        "body": "Obviously not because I'm not yoloing my life savings at Billy's Awesome Brokerage Adventure.\n\nFidelity, Schwab, TD Ameritrade, IB, Etrade. Pick one.",
        "created_utc": 1595297531,
        "id": "fyq3st9",
        "permalink": "/r/wallstreetbets/comments/huy16a/can_i_sue_robinhood_for_locking_my_account_full/fyq3st9/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1595326331.0
    },
    {
        "author": "aerrreaa",
        "body": "15k -&gt; 200k since I jumped back in March. Great end of the month. 90k this month alone. Monday when Fidelity updates the monthly gains I'll post a screenshot. All day trades, rarely holding overnight. \n\nGoing for 400k so I can pay off my house after taxes. Or I'll buy a Porsche 718 Cayman S, that would be sexier",
        "created_utc": 1596237759,
        "id": "fzxifi0",
        "permalink": "/r/wallstreetbets/comments/i1ejxp/weekend_discussion_thread_for_the_weekend_of_july/fzxifi0/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1596266559.0
    },
    {
        "author": "LovableContrarian",
        "body": "At the end of the day, fidelity's focus is retirement accounts. They are all about creating amazing mutual funds and holding people's cash in IRAs and 401ks. They are a also a brokerage, of course, but it's not their main focus. \n\nBut they have fidelity active trader pro on desktop, which is solid. It's not good as ToS, but it's the next best thing honestly.\n\nI really have no idea why people try to make big options plays on mobile. Get your ass to a computer, no matter what brokerage you use.",
        "created_utc": 1595715943,
        "id": "fz8tn5s",
        "permalink": "/r/wallstreetbets/comments/hxo91u/14k_159k_4_this_is_what_happens_when_you_never/fz8tn5s/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1595744743.0
    },
    {
        "author": "EazeeP",
        "body": "It’s simple really. Bitcoin will either continue to rip up exponentially higher than it has previously done all whilst having major corrections thereafter but at the same time being exponentially higher than the previous correction or it will just all go to zero. My bet is on the former - based off adoption (look up visa, MasterCard, office of comptroller allowing bank custody, fidelity digital assets, CashApp/square, etc..... ) as well as metcalfes law (there’s more bitcoin wallets today than ever before , there’s more people holding fractions of bitcoin and only goes up every single day), as well as the defining features/properties of hard money and the current currency debasement going on with the US dollar . Add all this shit together and that’s reason enough for me. \n\nI’m never expecting bitcoin price to be similar to growth stocks. If anything it mimics precious metals pretty closely , the only difference in the huge ass swings and volatility between the two? It’s only a $299 billion market. This tells me there’s tons of room to grow before it starts acting less volatile like the giant and battle tested markets like precious metals",
        "created_utc": 1595912191,
        "id": "fzhesdd",
        "permalink": "/r/investing/comments/hz1zdi/bitcoin_just_passed_11000_9k_to_11k_in_2_days/fzhesdd/",
        "score": 22,
        "subreddit": "investing",
        "created": 1595940991.0
    },
    {
        "author": "makutamillion",
        "body": "Yea. Most of my stocks are in RH. \n\nI also have good amount in Ameritrade, Fidelity, Stockpile (😂😂😂) from years back, and others. For example I converted my HSA (Health savings account) into an investment tool. And that’s another story.\n\nNow that I’m approaching 200k, I plan to get out of Robinhood",
        "created_utc": 1595260456,
        "id": "fyo3fgp",
        "permalink": "/r/RobinHood/comments/hulzpz/5_months_later_finally_hit_100_returns_meeting_my/fyo3fgp/",
        "score": 21,
        "subreddit": "RobinHood",
        "created": 1595289256.0
    },
    {
        "author": "SirGlass",
        "body": "Yea I worked for MSFT from about 2005-2011 ; during that time everyone wanted to go somewhere else, google, fb, amazon ect....probably how I managed to get a job .\n\nAlso MSFT now is regarded as an amazing stock, people forget from 2000-2012 over a decade the stock did nothing as the company wasn't innovating . While working there even the employees knew it, they told me to sell my stock options as soon as they were vested because the stock sucked. I was young, dumb and sort of lazy and lost my fidelity password for like 7 years (not a joke) so I never sold...best mistake of my life.\n\n&amp;#x200B;\n\nHowever to the point MSFT has become cool again and lots of top talent wants to work there .",
        "created_utc": 1595372414,
        "id": "fyte540",
        "permalink": "/r/investing/comments/hvg2t0/telltale_signs_of_a_declining_bluechip_company/fyte540/",
        "score": 21,
        "subreddit": "investing",
        "created": 1595401214.0
    },
    {
        "author": "HealerWarrior",
        "body": "Schwab &amp; Fidelity do not charge fees or commissions on trades.",
        "created_utc": 1595188598,
        "id": "fyl7ege",
        "permalink": "/r/stocks/comments/hu4pmo/how_do_investment_firms_and_companies_in_general/fyl7ege/",
        "score": 20,
        "subreddit": "stocks",
        "created": 1595217398.0
    },
    {
        "author": "j33tAy",
        "body": "lol yep\n\ni've used fidelity since my first major employer opened my first 401k @ 22 and since then opened up iras, regular brokerage and checking accounts too. it's been 10 years and i don't think they have EVER been down\n\ni call them once in a while and all their phone support people actually know what options are, how they exercise, how margin works, etc. it's like they hire real professionals!\n\ndon't get me wrong, i use rh once in a while to make stupid trades, but i can't imagine trying to trade with that full time. such a shit broker.",
        "created_utc": 1595865468,
        "id": "fzey9ht",
        "permalink": "/r/wallstreetbets/comments/hyss5w/1m_in_gold_gains/fzey9ht/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1595894268.0
    },
    {
        "author": "qwfort01",
        "body": "Get this - the average investor lost money in the Fidelity Magellan fund under Peter Lynch’s tenure during a period of time when the fund returned around 29% annually.",
        "created_utc": 1594740720,
        "id": "fy1mimi",
        "permalink": "/r/investing/comments/hr3789/i_am_reading_this_article_that_suggests_that_the/fy1mimi/",
        "score": 18,
        "subreddit": "investing",
        "created": 1594769520.0
    },
    {
        "author": "EskettiMySpaghetti",
        "body": "I’m surprised how long it took for someone to ask that question. You can’t buy OTC stocks on Robinhood. Move to Schwab or Fidelity if you want to catch shell plays like PASO.",
        "created_utc": 1594777749,
        "id": "fy3nf3g",
        "permalink": "/r/pennystocks/comments/hre92v/dd_on_why_paso_will_run_soon/fy3nf3g/",
        "score": 18,
        "subreddit": "pennystocks",
        "created": 1594806549.0
    },
    {
        "author": "shotcatch",
        "body": "Sure Dutch, what I would do if I were your age is determine your risk tolerance for your split between stocks and bonds but at your age you probably want to be 100% stocks. The next thing is to use low-cost index funds like through Vanguard Schwab or Fidelity.  Etfs  like VTI, SCHB,for domestic and VXUS, SCHF for international.  Studies say you do better when you go all-in rather than timing the market but I'm too risk-averse, I've always been.  What I would probably do is gradually dollar cost average into the market over a period of time. Kind of like you do what with your company 401K when you are contributing a little bit each paycheck.  For instance if you had $20 to 30,000 I would want to average in over 12 months you would put 1/12 each month into the market. Personally I feel the market is  being manipulated by fed policy and there's  \"irrational exuberance\" in the market so I believe the market will correct in 3-12 mo's. Read up about the three or four fund / ETF portfolio. It keeps it simple. if you want to be more speculative I would use 5% of your investments to buy individual stocks, gold, silver,  etc but not expose the majority of your holdings. Bogleheads.com is a good site where most of the participants believe in indexing, low-cost, and not timing the market. I think Warren Buffett said that investing should be about as boring as watching grass grow.I'm telling you what I would tell my own children. Good luck. You have time on your side. Try not to let worry, fear, greed, pride , ego control your investment decisions. If it sounds too good to be true it probably is. Hope this helps Dutch.",
        "created_utc": 1594753148,
        "id": "fy2chi5",
        "permalink": "/r/StockMarket/comments/hqztwb/dont_get_too_obsessed_following_how_your/fy2chi5/",
        "score": 18,
        "subreddit": "StockMarket",
        "created": 1594781948.0
    },
    {
        "author": "dopexile",
        "body": "I am using interactive brokers, but it is expensive unless you have 100k+ in assets. They charge a monthly fee for the sub 100k crowd.\n\nFor someone who doesn't have that much, I would recommend using Fidelity.",
        "created_utc": 1595354713,
        "id": "fyse4kr",
        "permalink": "/r/investing/comments/hv5quk/robinhood_cancels_uk_launch/fyse4kr/",
        "score": 17,
        "subreddit": "investing",
        "created": 1595383513.0
    },
    {
        "author": "Tiaan",
        "body": "I moved out of vanguard a while ago because of their outdated UI and no 2FA option that wasn't SMS based. I can't imagine how a huge financial firm still offers SMS based 2fA without realizing how huge of a security flaw it is with sim swapping. At least fidelity and Schwab offer an authenticator-like app with symantec VIP. Vanguard has been behind on the times for a while now and shows no signs of getting with it.\n\nWith all of the great brokerage account options out there, there's very little reason to use Vanguard. Don't get me wrong, I love the Vanguard funds, but you can access all of their ETFs in many other platforms. For example, you can literally buy fractional shares of Vanguard ETFs in Fidelity for no extra cost at the same expense ratio as you get in Vanguard. That's something that you can't even do in Vanguard itself!",
        "created_utc": 1595273496,
        "id": "fyouani",
        "permalink": "/r/investing/comments/huphqe/vanguard_transfers_1300_jobs_to_outsourcing_giant/fyouani/",
        "score": 15,
        "subreddit": "investing",
        "created": 1595302296.0
    },
    {
        "author": "ThatOneDrunkUncle",
        "body": "The true infinite money glitch: Short sell 1,000 shares of a dumb stock like intel then use the buying power to buy AMZN or whatever calls. You will most likely win both. If it goes tits up, you call Fidelity and say you meant to buy intel, you don't know what short selling is, honest mistake and won't happen again. They'll forgive you.",
        "created_utc": 1596171315,
        "id": "fztz2je",
        "permalink": "/r/wallstreetbets/comments/i0t4tc/what_are_your_moves_tomorrow_july_31_2020/fztz2je/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1596200115.0
    },
    {
        "author": "gsgun",
        "body": "Found it on Merrill. Not on webull, TD or fidelity",
        "created_utc": 1595431693,
        "id": "fyvpdb2",
        "permalink": "/r/wallstreetbets/comments/hvvn6o/bill_ackmans_spac_went_live_today_psthu/fyvpdb2/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1595460493.0
    },
    {
        "author": "HLuha",
        "body": "Moving to Fidelity!",
        "created_utc": 1595399584,
        "id": "fyujx1m",
        "permalink": "/r/wallstreetbets/comments/hvnnm2/_/fyujx1m/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1595428384.0
    },
    {
        "author": "mcogneto",
        "body": "Glad I just moved over to fidelity. I don't trust this shit nor do I want someone I cannot understand on the phone when I need help. Didn't help that vanguard's platform is dogshit for active traders. Passively it was fine, but fidelity and schwab are much better platforms at least on a technical level.",
        "created_utc": 1595276614,
        "id": "fyp0ofx",
        "permalink": "/r/investing/comments/huphqe/vanguard_transfers_1300_jobs_to_outsourcing_giant/fyp0ofx/",
        "score": 13,
        "subreddit": "investing",
        "created": 1595305414.0
    },
    {
        "author": "throwaway_finn2",
        "body": "AAPL long-term hold. AAPL will split August, 24th, 4 to 1.  \n\nBuying at an ATH. Put 15% of my net worth into it; $15,000 -&gt; 10,000+ in Fidelity, 5,000 in RH (aka my property taxes because I'm not escrowing my mortgage).  \n  \nhttps://imgur.com/a/xiWKA69  \n  \nFom my experience, after a split, the stocks shoot up almost immediately, and AAPL will continue to be hyped. I'll post here if my account RIPs.  \n  \nhttps://www.marketwatch.com/story/apple-beats-on-earnings-and-announces-stock-split-sending-shares-toward-record-high-2020-07-30  \n  \nI want to buy AAPL options, but I'm still confused how to cash out without being on the hook for getting called. I feel like it's going to be $430 in a month, or close to it, 425 at least.. I don't have enough money to cover a naked call though, and I know shit about Greeks, because I'm not gay. Or is it I don't know anything about being gay, because I'm not Greek. \n  \nAnyway, I'm holding AAPLs atm.",
        "created_utc": 1596179895,
        "id": "fzu9bev",
        "permalink": "/r/wallstreetbets/comments/i0t4tc/what_are_your_moves_tomorrow_july_31_2020/fzu9bev/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1596208695.0
    },
    {
        "author": "Snowie_mays",
        "body": "There are some HUGE assumptions in this article\n\n1. That individual tax rates and capital gains taxes will still be the same in 20-30 years when people retire.\n2. That the 401k plan has bad expense ratio funds - both companies I’ve worked for offered a 401k with Fidelity and have 0.015% ER S&amp;P 500 funds and other low ER funds\n3. That the protection from bankruptcy and creditors having your cash in a 401k has no value. 401ks have more legal protection than IRAs and much more than a taxable brokerage account.",
        "created_utc": 1595344601,
        "id": "fyrtgwq",
        "permalink": "/r/investing/comments/hv8rqg/401k_plans_no_longer_make_much_sense_for_savers/fyrtgwq/",
        "score": 12,
        "subreddit": "investing",
        "created": 1595373401.0
    },
    {
        "author": "aerrreaa",
        "body": "Yay! Fidelity approved me for 4x margin and naked option writing. Gonna GET RICH NOW BITCH. THETA GANG JUST IN TIME",
        "created_utc": 1595902334,
        "id": "fzgzdg0",
        "permalink": "/r/wallstreetbets/comments/hyzs0g/what_are_your_moves_tomorrow_july_28_2020/fzgzdg0/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1595931134.0
    },
    {
        "author": "Slachi",
        "body": "Fidelity's website yelled at me for buying, selling, then rebuying mutual funds. I don't know what I'm doing. I promise I'm not trying to fuck you over. Please have mercy Mr. Fidelity.",
        "created_utc": 1594938264,
        "id": "fyatys1",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fyatys1/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1594967064.0
    },
    {
        "author": "BobBetsOnWallStreet",
        "body": "I’m using fidelity. My research process for pennies. Look here, stocktwits, yahoo boards, Schwab, and fidelity for undervalued stocks that have catalysts. After I find something I will research it. I look at financials (is the company close to bankruptcy or making a profit?), look at insiders buying or selling, look at sec filings, study the graph to see its history. I legit would not hold most pennies long term unless my research pans out and they look undervalued. Most pennies run on hype and will crash hard after the sell off. Also for biotechs I always check there pipeline to see what drugs are in the works. Is it in phase 1, 2, or 3? Is it something that is innovative and showing good results? Are they filing a NDA soon or is a PDUFA coming up?",
        "created_utc": 1594244484,
        "id": "fxcw3r9",
        "permalink": "/r/RobinHoodPennyStocks/comments/hnpt58/16k_in_4_months_with_only_pennies/fxcw3r9/",
        "score": 10,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1594273284.0
    },
    {
        "author": "SleepBeforeWork",
        "body": "Plenty of other sites out there. Charles Schwab, fidelity, Edward Jones, etc",
        "created_utc": 1595187655,
        "id": "fyl5ool",
        "permalink": "/r/stocks/comments/hu4pmo/how_do_investment_firms_and_companies_in_general/fyl5ool/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1595216455.0
    },
    {
        "author": "LovableContrarian",
        "body": "I have a theory why people like robinhood so much: the portfolio graph. You when log in, right there you see a graph of your portfolio balance. It appeals to gambling addicts, because it shows your money  going up and down.\n\n I also use ToS and fidelity, and neither have a portfolio graph anywhere. They show your current balance, and you can usually find a general graph with each day's closing balance, but neither have live, tracked portfolio values. Weird AF.",
        "created_utc": 1594695478,
        "id": "fxzzdpw",
        "permalink": "/r/wallstreetbets/comments/hqmoth/what_are_your_moves_tomorrow_july_14_2020/fxzzdpw/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1594724278.0
    },
    {
        "author": "sloop703",
        "body": "I’ve spent a lot of time in the Caribbean for work. CWCO (Cayman Water) literally has a monopoly on the water utility business in Grand Cayman. They’ve been growing in US and Caribbean but a lot of their business is consumer/potable water on island.\n\nThis is a good, steady business. Nonetheless, it’s been pretty boring, trading around the $15-17 range but had 22% rev increase YoY and is possibly benefiting from covid as everyone’s home and utility bills are up (my friends on island tell me their bills are way up). Mgmt bought shares at $14-$15 back at March lows (basically its 2-yr low). \n\nOn 7/7 at 9am, Janney Montgomery Scott announced its rating downgrade on the stock from Buy to NEUTRAL. At market open, the stock dumped from $15.50 to $13 bc of the downgrade, then continued to fall to $12 next day and closed at $12.50 yesterday. Janney “expert” had no commentary on the “downgrade” and haven’t changed the rating in 3+ years. I also read all the recent ERs, Janney didn’t ask a single fucking question on the calls. Yet it’s still a “buy” overall and a 9.2 equity scorecard on fidelity and trades cheap, w/ options volume.\n\nBasically this dumped ~20% near 2-yr lows based on an irrelevant analyst “downgrade” (to neutral) with zero commentary. Spreads look wide but they filled cheap. I’m long this company and buying cheaper than mgmt, $15c and $17.5c for it to rubber band back to range. It’s extremely oversold.\n\nTLDR: CWCO calls or shares",
        "created_utc": 1594514730,
        "id": "fxs0o0b",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxs0o0b/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594543530.0
    },
    {
        "author": "Kakarot_faps",
        "body": "The problem is that most debt collectors are you and I - aka bond holders, Americans and our companies. I would be surprised if China has more of our debt than vanguard + fidelity",
        "created_utc": 1595979791,
        "id": "fzkfjr5",
        "permalink": "/r/wallstreetbets/comments/hzl664/kanye_gets_it/fzkfjr5/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1596008591.0
    },
    {
        "author": "InvestingNerd2020",
        "body": "Its a battle between Fidelity and Charles Schwab at this point.  \n\nFidelity owns their market makers, so you don't have to worry about order flow manipulation.\n\nCharles schwab keeps their market makers in check not to abuse clients...too much.",
        "created_utc": 1595356529,
        "id": "fyshwge",
        "permalink": "/r/investing/comments/hv5quk/robinhood_cancels_uk_launch/fyshwge/",
        "score": 9,
        "subreddit": "investing",
        "created": 1595385329.0
    },
    {
        "author": "slapchopchap",
        "body": "When I move funds into Fidelity it has typically taken 3-4 days before it is “settled” cash and I always try to trade from settled funds",
        "created_utc": 1594760076,
        "id": "fy2r025",
        "permalink": "/r/pennystocks/comments/hr9mm4/fidelity/fy2r025/",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1594788876.0
    },
    {
        "author": "AppropriateCorner21",
        "body": "I checked fidelity and they have it. Cant find it on robinhood",
        "created_utc": 1595178922,
        "id": "fykp0py",
        "permalink": "/r/stocks/comments/hu1e48/nlst_is_about_to_pop_winning_lottery_ticket/fykp0py/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1595207722.0
    },
    {
        "author": "VirtusInjection",
        "body": "How dare fidelity Denies  me option trading I’ve only lost 10k and done jt for 2 years. Time to re apply",
        "created_utc": 1594575010,
        "id": "fxuhrq4",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxuhrq4/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1594603810.0
    },
    {
        "author": "trevcam11",
        "body": "&gt;There’s a reason why we don’t see people in their young 20s using Fidelity.\n\nBecause only recently (likely due to RH and similar services) have they and others made any attempt to appeal to young adults. Shocking that young people didn't want to pay $9.95 per trade on a platform that was designed in the 80s and had little to no mobile integration. Hell, I had a Vanguard account only a few years ago and the whole site seemed like it was designed for people age 50+.\n\nLet's not forget RH was incredibly popular well before they ever introduced option trading. They just didn't grab any fear mongering headlines.",
        "created_utc": 1594258501,
        "id": "fxdly3r",
        "permalink": "/r/investing/comments/hnovbr/nytimes_sources_describe_horror_stories_of_young/fxdly3r/",
        "score": 8,
        "subreddit": "investing",
        "created": 1594287301.0
    },
    {
        "author": "Bweeze086",
        "body": "I bought 420 of DARE today, I really expected a little Fidelity elf with a blunt in it's mouth to come to my house.\n\n&amp;#x200B;\n\nSo far, only bills have come to my house :/",
        "created_utc": 1594747603,
        "id": "fy20pc8",
        "permalink": "/r/wallstreetbets/comments/hr2nrx/when_youre_trying_to_buy_the_dip/fy20pc8/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1594776403.0
    },
    {
        "author": "sparkjays",
        "body": "Couple sours, an IPA and a 2g blunt of some project 4510.   \n\nMy account isn't setup for after hours, apparently I need to call fidelity and I've been too lazy to do so 🤷‍♂️",
        "created_utc": 1595134580,
        "id": "fyj5k9j",
        "permalink": "/r/stocks/comments/htsjyp/upcoming_netflix_free_membership_plan_with/fyj5k9j/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1595163380.0
    },
    {
        "author": "Pepperoni_nipps",
        "body": "Fidelity has thousands of people working for them and through Infosys in India for many years. Clearly there’s no issues.",
        "created_utc": 1595272287,
        "id": "fyortb6",
        "permalink": "/r/investing/comments/huphqe/vanguard_transfers_1300_jobs_to_outsourcing_giant/fyortb6/",
        "score": 8,
        "subreddit": "investing",
        "created": 1595301087.0
    },
    {
        "author": "v_AgentOrange_v",
        "body": "I use Fidelity. And the PDT rule goes out the window if you are using a Cash Account as oppose to a Margin Account. You are not restricted AS Long as there is settled cash in the account to make the trade. So, in terms of $25K, you don't need to have that much but you do need the cash to be Settled.... Hope this helps.",
        "created_utc": 1595089694,
        "id": "fyh2xgj",
        "permalink": "/r/StockMarket/comments/htjc5k/best_platform_for_day_trading_without_having/fyh2xgj/",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1595118494.0
    },
    {
        "author": "theAjnin",
        "body": "That looks like Fidelity based on the screenshot.",
        "created_utc": 1595858886,
        "id": "fzel9h7",
        "permalink": "/r/wallstreetbets/comments/hyss5w/1m_in_gold_gains/fzel9h7/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1595887686.0
    },
    {
        "author": "Give_me_an_M3",
        "body": "r/politics has excellent impartial political comentary. A true monument to fidelity. Beautiful place. Beautiful people.",
        "created_utc": 1594252400,
        "id": "fxdbasj",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxdbasj/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1594281200.0
    },
    {
        "author": "CptTonyStark",
        "body": "What are the characteristics of funds that consistently beat the market over long periods of time?\n\n1.\tTheir managers are the biggest shareholders.\n2.\tThey have low fees.\n3.\tThey dare to have a unique trading philosophy eg. Peter Lynch of Fidelity Magellan\n4.\tThey close their funds to new investors pretty early.\n5.\tThey don't advertise.",
        "created_utc": 1594769043,
        "id": "fy38jx0",
        "permalink": "/r/wallstreetbets/comments/hr8uhb/what_are_your_moves_tomorrow_july_15_2020/fy38jx0/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594797843.0
    },
    {
        "author": "kylem92",
        "body": "Been digging active trader pro with Fidelity. I’ve heard think or swim is good as well through TD",
        "created_utc": 1594775564,
        "id": "fy3jpqu",
        "permalink": "/r/wallstreetbets/comments/hr8uhb/what_are_your_moves_tomorrow_july_15_2020/fy3jpqu/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594804364.0
    },
    {
        "author": "PatricksPub",
        "body": "Follow up question on this topic: tonget in on an IPO, wouldn't just buy within my normal mechanism (Fidelity)? Will it be suddenly available there, or is there a delay on fidelity and/or a special way to get it on IPO day?",
        "created_utc": 1595795045,
        "id": "fzc32mw",
        "permalink": "/r/investing/comments/hyblbx/how_to_go_about_investing_in_snowflake_when_it/fzc32mw/",
        "score": 7,
        "subreddit": "investing",
        "created": 1595823845.0
    },
    {
        "author": "somanychins",
        "body": "Fidelity fills are god like",
        "created_utc": 1595943864,
        "id": "fzifffx",
        "permalink": "/r/wallstreetbets/comments/hzc3ko/daily_discussion_thread_for_july_28_2020/fzifffx/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1595972664.0
    },
    {
        "author": "Cruian",
        "body": "The S&amp;P 500 is not the only index. People that were using US total market style funds (FZROX, FSKAX, VTSAX &amp; VTI, SWTSX, ITOT, SCHB to name a few) already had Tesla. Edit: Tesla was also likely in VTWAX as well, a total world index fund.\n\n&amp;#x200B;\n\nIf you were using only an S&amp;P 500 index without an extended market (such as FSMAX, which has Tesla as its #1 holding) or mid &amp; small cap index funds to complement it, then yes, they'd have missed out on Tesla so far.\n\n&amp;#x200B;\n\nInteresting note: FNILX, Fidelity's zero expense ratio large cap fund also already had Tesla since it is not a true S&amp;P 500 fund and instead uses a custom Fidelity designed index ([https://fundresearch.fidelity.com/mutual-funds/composition/315911628](https://fundresearch.fidelity.com/mutual-funds/composition/315911628) \\-&gt; Prospectus &amp; Reports -&gt; note that it is as of May 29, 2020, then Ctrl+F Tesla).",
        "created_utc": 1595387635,
        "id": "fyu3yj2",
        "permalink": "/r/investing/comments/hvlx3z/did_index_investors_miss_out_on_teslas_meteoric/fyu3yj2/",
        "score": 7,
        "subreddit": "investing",
        "created": 1595416435.0
    },
    {
        "author": "beavertwp",
        "body": "I think the point is that Tesla actually made and sold products before it got huge investments from public markets. Also it’s 2020 and even institutional investors like fidelity are just throwing cash at equities since there’s nothing else to do with it.",
        "created_utc": 1595357234,
        "id": "fysjdl1",
        "permalink": "/r/wallstreetbets/comments/hv8fob/trevor_milton_is_likely_a_sociopath_you_heard_it/fysjdl1/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1595386034.0
    },
    {
        "author": "indonesian_activist",
        "body": "With my mom daytrading her ira on fidelity and my niece on robinhood, I don't want to set a bad example in case they browse wsb.",
        "created_utc": 1595212087,
        "id": "fymcbxd",
        "permalink": "/r/wallstreetbets/comments/huc6hi/zombies_bit_me_zombie_markets_part_vi/fymcbxd/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1595240887.0
    },
    {
        "author": "alexesver",
        "body": "Yes. Fidelity,Webull, TOS, TDameritrade, E*TRADE are all better\nCharles Schwab and fidelity have zero fees for OTcs too",
        "created_utc": 1595542448,
        "id": "fz10dmu",
        "permalink": "/r/pennystocks/comments/hwp9vx/does_ah_trading_bother_anyone_else_or_is_it_just/fz10dmu/",
        "score": 7,
        "subreddit": "pennystocks",
        "created": 1595571248.0
    },
    {
        "author": "reuhop",
        "body": "Fidelity has both fractional shares and free trades now.",
        "created_utc": 1596151444,
        "id": "fzsxk19",
        "permalink": "/r/stocks/comments/i0tm7d/apple_splitting_shares_41/fzsxk19/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1596180244.0
    },
    {
        "author": "gmc218989",
        "body": "It’s only available on Fidelity? Or can i get it on webull ?",
        "created_utc": 1594776972,
        "id": "fy3m3j0",
        "permalink": "/r/pennystocks/comments/hre92v/dd_on_why_paso_will_run_soon/fy3m3j0/",
        "score": 7,
        "subreddit": "pennystocks",
        "created": 1594805772.0
    },
    {
        "author": "Slimalicious",
        "body": "You’re right on all accounts, but its also worth noting that Schwab, Vanguard, Fidelity, etc. have other businesses outside of their self-directed brokerage platform.  Their revenue streams are much more diversified over TD, E*Trade, or Robinhood.\n\nI’ve heard that Robinhood is profitable now, except their CAC is way too high, thus the requirement to keep raising funding.  They’re still in a massive growth phase, as weird as that sounds considering their 13M customers.  They have to keep growing as their average balances are likely $1-3k per customer, and as you said with little to no cash.  \n\nThat being said, they raised $600 M in the past two months.  I would bet anything they are putting together a managed investment product, which has a much higher margin than brokerage.",
        "created_utc": 1595353990,
        "id": "fyscm1w",
        "permalink": "/r/investing/comments/hv5quk/robinhood_cancels_uk_launch/fyscm1w/",
        "score": 7,
        "subreddit": "investing",
        "created": 1595382790.0
    },
    {
        "author": "cashcatguy",
        "body": "Get on youtube and start learning. I personally used Investing with Rose, she explained the basics pretty well.  There are a ton of financial basics videos on there.  \n\n Consider Fidelity or Vanguard.  Start basic.  Invest in what you understand.",
        "created_utc": 1595185153,
        "id": "fyl0zwv",
        "permalink": "/r/stocks/comments/hu5pjw/im_so_lost_idk_where_else_to_go_so_here_i_am_redit/fyl0zwv/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1595213953.0
    },
    {
        "author": "shad0wtig3r",
        "body": "Where? Vanguard, Fidelity, TD Ameritrade, Charles Schwaub, Merrill are now ALL FREE. \n\nWe have Robinhood to thank for that, though I left Robinhood because the above are better.",
        "created_utc": 1595997465,
        "id": "fzl9w7p",
        "permalink": "/r/investing/comments/hzr9o3/most_anticipated_ipos_in_20202021_for_long_term/fzl9w7p/",
        "score": 7,
        "subreddit": "investing",
        "created": 1596026265.0
    },
    {
        "author": "auto_headshot",
        "body": "Check your statements, Fidelity still charges per contract. It's small and there's no base fee but it's still not free.",
        "created_utc": 1594843560,
        "id": "fy6h6tl",
        "permalink": "/r/options/comments/hrq0z1/tsla_june_2022_5_puts/fy6h6tl/",
        "score": 6,
        "subreddit": "options",
        "created": 1594872360.0
    },
    {
        "author": "Bear_buh_dare",
        "body": "I bought more on my fidelity long account today",
        "created_utc": 1594154779,
        "id": "fx8sdo5",
        "permalink": "/r/pennystocks/comments/hn2j9b/for_all_those_that_have_little_faith_stay_strong/fx8sdo5/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1594183579.0
    },
    {
        "author": "Hobs_Dad",
        "body": "RH by far has the most user friendly interface. Easy to use. No fees. Free stock when you sign up. RH gives you your first hit and then leaves you wanting more- so you sign up for webull, fidelity or TD later down the road",
        "created_utc": 1594357937,
        "id": "fxi3d9z",
        "permalink": "/r/pennystocks/comments/hoiyg6/what_makes_robinhood_so_significant/fxi3d9z/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1594386737.0
    },
    {
        "author": "pervsensei11",
        "body": "Current positions:\n\n20 SPY 330c 7/31 \n\n8 WMT 125c  7/17\n\n5 VXX 48c 7/31\n\n5 PFE 34c 7/17\n\n1 TSLA 1240p 7/10 \n\nAnd one big short position: 15 QQQ 200p jan2021\n\n\nI’m gonna one up that fidelity 1million guy 💩",
        "created_utc": 1594239315,
        "id": "fxclcy6",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxclcy6/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1594268115.0
    },
    {
        "author": "ceskanda",
        "body": "Fidelity UI sucks but the fills are 💥",
        "created_utc": 1595951051,
        "id": "fzit308",
        "permalink": "/r/wallstreetbets/comments/hzc3ko/daily_discussion_thread_for_july_28_2020/fzit308/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595979851.0
    },
    {
        "author": "MementoMori97",
        "body": "There are many brokerages with no minimums and no comission trading now.\n\nPersonally I use Fidelity and I love it so much more than Robinhood. I use Robinhood just for options trading and gambles now.\n\nLook into ETFs as well instead of just putting everything in individual stocks, much less risk that way especially if you aren't actively watching your investments.",
        "created_utc": 1595723017,
        "id": "fz9645k",
        "permalink": "/r/investing/comments/hxx5mk/question_about_fees_as_a_beginner/fz9645k/",
        "score": 6,
        "subreddit": "investing",
        "created": 1595751817.0
    },
    {
        "author": "pugRescuer",
        "body": "+1 to Fidelity, they are pretty great in most places.",
        "created_utc": 1595361053,
        "id": "fysrbh6",
        "permalink": "/r/investing/comments/hv5quk/robinhood_cancels_uk_launch/fysrbh6/",
        "score": 6,
        "subreddit": "investing",
        "created": 1595389853.0
    },
    {
        "author": "Hank-TheSpank-Hill",
        "body": "It’s a psychological phenomena called otherificarion. Basically it’s a way for people to classify investors and create stereotypes that make them feel good or better about themselves. At the end of the day all brokers do things better and worse so I use three. Fidelity Schwabb and RH I can’t say there’s a crazy difference in execution time or spread listed.",
        "created_utc": 1596137140,
        "id": "fzrkm82",
        "permalink": "/r/investing/comments/i0s81q/why_does_robinhood_get_so_much_hate/fzrkm82/",
        "score": 6,
        "subreddit": "investing",
        "created": 1596165940.0
    },
    {
        "author": "-serious-",
        "body": "My 403b lets me access a large amount of ETFs and mutual funds through fidelity brokerage link. I would rather buy in the money leaps on qqq and keep rolling them out but TQQQ is doing ok for me.",
        "created_utc": 1595292423,
        "id": "fypv1ci",
        "permalink": "/r/wallstreetbets/comments/huunwg/never_forget/fypv1ci/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595321223.0
    },
    {
        "author": "SushiRoe",
        "body": "Are there any (tax or otherwise) repercussions if I want to transfer my Roth IRA and brokerage account to something like Fidelity?",
        "created_utc": 1595281751,
        "id": "fypb3yp",
        "permalink": "/r/investing/comments/huphqe/vanguard_transfers_1300_jobs_to_outsourcing_giant/fypb3yp/",
        "score": 6,
        "subreddit": "investing",
        "created": 1595310551.0
    },
    {
        "author": "LSatou",
        "body": "Nice find, really cool, thank you.\n\nFidelity isn't even allowing me to trade it 🙄",
        "created_utc": 1593707838,
        "id": "fwpoju5",
        "permalink": "/r/pennystocks/comments/hk0a3g/new_otc_reverse_merger_play_with_huge_returns/fwpoju5/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1593736638.0
    },
    {
        "author": "InvestingNerd2020",
        "body": "A few things:\n\n1) Get a maintenance free checking account. Capital One is a good choice.\n\n2) Get a high yield savings account. Go with Capital One. Put your emergency funds there. Usually 3-6 months of your routine expenses.\n\n3) Open a Roth IRA with Fidelity if your income is below $124k per year.  The max contribution is $6k per year or $500 per month. Invest in FZROX. In your 30s add the lowest costing bond Index mutual fund (FXNAX).\n\n4) If you have any extra funds after steps 1-3, then invest in technology ETFs (FTEC, VGT, QQQ) and any total USA stock market fund (ITOT).",
        "created_utc": 1595192415,
        "id": "fyled7u",
        "permalink": "/r/investing/comments/htzjd5/daily_advice_thread_all_basic_help_or_advice/fyled7u/",
        "score": 6,
        "subreddit": "investing",
        "created": 1595221215.0
    },
    {
        "author": "InvestingNerd2020",
        "body": "Most young people's retirement investments are with Fidelity, Charles Schwab, or M1 Finance nowadays.  \n\nM1 finance does automatic rebalancing and has low cost ETFs that can be bought using fractional shares.",
        "created_utc": 1595291442,
        "id": "fyptcop",
        "permalink": "/r/investing/comments/huphqe/vanguard_transfers_1300_jobs_to_outsourcing_giant/fyptcop/",
        "score": 6,
        "subreddit": "investing",
        "created": 1595320242.0
    },
    {
        "author": "InvestingNerd2020",
        "body": "Fidelity's customer service is local.  Also many of the features Fidelity uses are from Google Cloud now.  More of an H1-B visa population that is managed locally than 100% outsourced.",
        "created_utc": 1595282630,
        "id": "fypcvxr",
        "permalink": "/r/investing/comments/huphqe/vanguard_transfers_1300_jobs_to_outsourcing_giant/fypcvxr/",
        "score": 6,
        "subreddit": "investing",
        "created": 1595311430.0
    },
    {
        "author": "cryptomoon_484",
        "body": "I just bought it on fidelity it is under PSTHU. You have to enter that  symbol n the trade section. I tried first on their search bar and it did not show.",
        "created_utc": 1595432319,
        "id": "fyvqmy7",
        "permalink": "/r/wallstreetbets/comments/hvvn6o/bill_ackmans_spac_went_live_today_psthu/fyvqmy7/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595461119.0
    },
    {
        "author": "Bear_buh_dare",
        "body": "Same but im on fidelity. That 4-7am can fuck us up even",
        "created_utc": 1596067103,
        "id": "fzod1lc",
        "permalink": "/r/pennystocks/comments/i0bo1c/successful_new_strategy_ive_found_robinhood_users/fzod1lc/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1596095903.0
    },
    {
        "author": "nate223",
        "body": "I owe fidelity $5000 because of a returned check that I bought options with and lost money. What happens now? Do I go to jail?",
        "created_utc": 1594440303,
        "id": "fxlqdvx",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxlqdvx/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1594469103.0
    },
    {
        "author": "Waffle_Authority",
        "body": "My Fidelity account: +$18,204 (hold stocks and leaps)\n\nMy Robinhood account: -$5,728 (YOLO LMAO)",
        "created_utc": 1594337663,
        "id": "fxh6nq6",
        "permalink": "/r/wallstreetbets/comments/hoa9dp/what_are_your_moves_tomorrow_july_10_2020/fxh6nq6/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1594366463.0
    },
    {
        "author": "BlissfulThinkr",
        "body": "Honest answer: if 3k is a lot, opt for broad ETFs with low expense ratios from the big guys. From what I’ve heard from Schwab themselves, the robo-advisors make a real difference against tax loss harvesting and essentially building your own personal ETF. That’s why the advertised robo products require like 100k or more. You have to have cash so the algorithm can re-balance and/or rotate when necessary.\n\nGiven the comparison expense ratios, Id stick with Vanguard, Schwab, Fidelity, BlackRock ETFs. For example, Vanguard’s funds are straightforward to comprehend and their website explains performance and holdings quite well. Just as a comparison: Vanguard’s VOO (s&amp;p500), VTI (all USA), VT (all world), VUG or MGK (growth), VIG (dividend), and sector-specific products are all solid for 3k total. Could split your money across multiple funds. Likewise, QQQ (growth) is one of the best performing ETFs out there and only has an expense ratio of .20%.",
        "created_utc": 1594842063,
        "id": "fy6e03k",
        "permalink": "/r/investing/comments/hrtdo8/now_that_even_vanguard_offers_a_robo_advisor_ive/fy6e03k/",
        "score": 6,
        "subreddit": "investing",
        "created": 1594870863.0
    },
    {
        "author": "Red-eleven",
        "body": "Fidelity didn’t give me emojis when I used them. Fuck that.",
        "created_utc": 1595884320,
        "id": "fzg1yta",
        "permalink": "/r/wallstreetbets/comments/hyss5w/1m_in_gold_gains/fzg1yta/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595913120.0
    },
    {
        "author": "jdelator",
        "body": "jFYI, Fidelity has fractional shares on their mobile app only.",
        "created_utc": 1596151608,
        "id": "fzsxwcd",
        "permalink": "/r/stocks/comments/i0tm7d/apple_splitting_shares_41/fzsxwcd/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1596180408.0
    },
    {
        "author": "fornix90",
        "body": "I use Fidelity as my main brokerage.",
        "created_utc": 1595978313,
        "id": "fzkctkf",
        "permalink": "/r/RobinHood/comments/hzp8ao/im_not_happy_with_robinhood_where_should_i/fzkctkf/",
        "score": 6,
        "subreddit": "RobinHood",
        "created": 1596007113.0
    },
    {
        "author": "s6dative",
        "body": "Fidelity is not too great with OTCs. try etrade if you still have difficulties!",
        "created_utc": 1594745264,
        "id": "fy1vrxx",
        "permalink": "/r/pennystocks/comments/hr47dl/paso_news/fy1vrxx/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1594774064.0
    },
    {
        "author": "SkyHigh27",
        "body": "Yup. It will be a slog to get through the auto direct system and explain your situation.  Give yourself a two hour window during business hours on the east coast.  Have everything at your fingertips including your current fidelity account info.",
        "created_utc": 1594596001,
        "id": "fxvkj5q",
        "permalink": "/r/StockMarket/comments/hq19a5/im_sure_this_has_been_asked_a_thousand_times_but/fxvkj5q/",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1594624801.0
    },
    {
        "author": "p0intbreak",
        "body": "Okay guys applied for fidelity options on my way to my millions",
        "created_utc": 1594260429,
        "id": "fxdpbce",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxdpbce/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1594289229.0
    },
    {
        "author": "ReflectAA",
        "body": "As far as I know Fidelity allows all US stocks including OTC, and charges no fees for any.",
        "created_utc": 1595620175,
        "id": "fz4hrnc",
        "permalink": "/r/pennystocks/comments/hx8mhp/penny_stock_broker/fz4hrnc/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1595648975.0
    },
    {
        "author": "xorasun",
        "body": "Isn’t ticker symbol $HPQ for Hewlett Packard? $HPE is Hewlett Packard Enterprise Co. which is legally separate company.",
        "created_utc": 1594660053,
        "id": "fxy2zea",
        "permalink": "/r/wallstreetbets/comments/hqj3jx/dd_buy_hpe_like_right_now_today_tendies_print/fxy2zea/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594688853.0
    },
    {
        "author": "101emptyfireplaces",
        "body": "Yeah I like 8-12.\nGot my long term holders: MSFT, V, DIS, MCD\nGot my ETFS: VTI, ARKG, ARKW\nGot my short term plays: HPQ, NKE, NLCH\nAnd got my gambles: DKNG, SPCE",
        "created_utc": 1594408919,
        "id": "fxk7uex",
        "permalink": "/r/stocks/comments/horqot/how_many_stocks_is_appropriate_for_a_portfolio/fxk7uex/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594437719.0
    },
    {
        "author": "bgalli",
        "body": "There’s a few older posts holding some DD if anyone feels like searching. Still hold true.  Client A represents about 1.5b in sales and recurring maintenance. Contracts to be determined and signed end of august.\n\nThere’s an unknown B &amp; C, B is modeling torches, C is entering negotiations to just buy.\n\nPlasma induration torches represent a large reduction in GHG over traditional burning methods.\n\nThere are multiple lines: they sell waste destruction furnaces to the us military\n\nThey sell Drosrite, which extracts aluminum from aluminum waste without the use of salts\n\nOwn a 10% stake and supplying technology to HPQ, refining silicone at a much cheaper price than can be currently done (25% of the cost roughly), and of a purity good enough for solar use (99.999)\n\nModeling contract with a boring company to drill holes\n\nRecycling titanium powders for implant use\n\n\nGE uses their old tech for titanium powders and was once the standard",
        "created_utc": 1593788224,
        "id": "fwt65dv",
        "permalink": "/r/pennystocks/comments/hk6cf2/pyrogenesis_ramping_up_for_another_run_on_news_of/fwt65dv/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593817024.0
    },
    {
        "author": "jackneefus",
        "body": "Now that you mention it, XRX does seem to be overlooked and undervalued. They have negative growth, which kills stock valuation.  Other than that, XRX may have potential.  \n\nThe price has been fairly stable before and after March, and during their attempt to acquire Hewlett-Packard .    Since calls are getting squashed the last few weeks, maybe this is a better stock than an option.",
        "created_utc": 1594390553,
        "id": "fxj6n43",
        "permalink": "/r/wallstreetbets/comments/homrji/xrx_inhale_the_crotch_fumes/fxj6n43/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594419353.0
    },
    {
        "author": "spacegrab",
        "body": "short the obvious ERs.\n\nPuts on GRPN, BBBY, HPQ, all printed pretty heavily around ER time. The reckoning of failed quarterly reports is nigh.\n\nI haven't done my research on ERs next week yet.",
        "created_utc": 1595046077,
        "id": "fyfmag0",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyfmag0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595074877.0
    },
    {
        "author": "BanffandBoujee",
        "body": "HPQ and PYR are definitely hold for the next 2 months. I personally own 1900 shares of PYR!",
        "created_utc": 1593944716,
        "id": "fwzjjbx",
        "permalink": "/r/pennystocks/comments/hlidn1/hpq_silicon_hpqtsxv_investors_starting_to_figure/fwzjjbx/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593973516.0
    },
    {
        "author": "bgalli",
        "body": "The million mile battery has to do with using a silicon graphite anode and nickel cathode, not the actual lithium. Currently the hold backs are the 30k$/kg refining cost of silicon of the right purity, and the particle size.\n\nLook up HPQ silicon on the tsx-v if you want to read about it. They have signed NDAs for their battery tech, but they have the refining process using PUREVAP technology. Can refine to 99.99999% pure silicon and in the micron particle size for a fraction of the cost.\n\nIf their tech is proven, we could see 4000mile batteries with it. Lots of competition in this space tho, so who knows how it’ll all flesh out.",
        "created_utc": 1594186907,
        "id": "fxaauzr",
        "permalink": "/r/pennystocks/comments/hnb0z9/speculative_lithium_play_pev/fxaauzr/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594215707.0
    },
    {
        "author": "connmattwhite",
        "body": "HPQ 🚀 it will go to the moon baby! THE MOON! I will finally be able to afford the new Ford bronco for my wife’s second boyfriend",
        "created_utc": 1594981739,
        "id": "fychiv3",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fychiv3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595010539.0
    },
    {
        "author": "TheOstrichThing",
        "body": "HP inc or HPQ siliconces inc?",
        "created_utc": 1594985441,
        "id": "fyclhbt",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fyclhbt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595014241.0
    },
    {
        "author": "19wekamper",
        "body": "I leave for basic next week so I would like advice before I go \nBoeing 24% \nMsft 20%\nInseego 10%\nVivent solar 10%\nHPQ 10%\nPH 8% \nSCHD 8% \nMEI 5% \nCarnival MetLife and Altria are like 1-3% for the rest",
        "created_utc": 1593735717,
        "id": "fwr85dh",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fwr85dh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593764517.0
    },
    {
        "author": "devtendo",
        "body": "Long Vmw\nShort HPQ\nShort INTL\nLong NVDA\n\nUse options to make it as risky as you want",
        "created_utc": 1594832812,
        "id": "fy5u9ok",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy5u9ok/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594861612.0
    },
    {
        "author": "tmssqtch",
        "body": "Also, after the failed HPQ offer, wouldn’t HP be better positioned for the possible WFH future?",
        "created_utc": 1594905823,
        "id": "fy90sqp",
        "permalink": "/r/ValueInvesting/comments/hs6ck9/xerox_xrx/fy90sqp/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1594934623.0
    },
    {
        "author": "highlyordinary",
        "body": "HPQ GO BR \n\nEven split of incredibly risky short term calls expiring on the same day. \n\nPrinter go brrrrrr let’s goooooooooooooooo",
        "created_utc": 1594838659,
        "id": "fy66sco",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy66sco/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594867459.0
    },
    {
        "author": "AveenoFresh",
        "body": "I went through your post/comment history. At no point did you ever tell anyone that NVAX would be a good buy, or post any DD on it. \n\nY'all just come in, lurk, make great plays, and only post when it profits? Nah, man. Be a bro and share intel.",
        "created_utc": 1594571743,
        "id": "fxubdo1",
        "permalink": "/r/wallstreetbets/comments/hpx0j6/easiest_game_of_my_life/fxubdo1/",
        "score": 530,
        "subreddit": "wallstreetbets",
        "created": 1594600543.0
    },
    {
        "author": "rali108",
        "body": "AMD is one of two companies in the world with x86 license. Their new Ryzen desktop lineup is kicking Intels ass, (intel is the other company with the license).  \n\nThey also make GPUs, and their mid to low end is highly competitive with Nvidia, although Nvidia has better high end. \n\nThey are exclusive suppliers for chips for XBOX and Playstation.\n\nTheir server chips which power cloud computing are top of the line when it comes to price performance and are just demolishing most of the competition.\n\nTheir new mobile chips are excellent as well.\n\nAlso their CEO, Lisa Su is simply a genius for what she has been able to accomplish thus far\n\n&amp;#x200B;\n\nIf they continue hitting their goals and gaining market share, Amd could be close to Intel or Nvidia market cap in a couple of years",
        "created_utc": 1595295035,
        "id": "fypzj5d",
        "permalink": "/r/stocks/comments/huxla4/why_is_amd_so_popular_on_this_sub/fypzj5d/",
        "score": 65,
        "subreddit": "stocks",
        "created": 1595323835.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "It is hard to tell what tech stocks and the NASDAQ will do but a bit of history is worth studying.\n\nIn 2000 Cisco was the giant of the internet and the internet was the giant of tech stocks. Every employee at Cisco was rich because they all got stock options (yes, including the janitors in those days) and the stock price had climbed from $10 in 98 to $33 in 99 and $79/sh in 2000. They did then sell and still do sell routers that were the backbone of the internet and CSCO was everyone's tech darling. I can't tell you how many Cisco employees had told me in spring of 2000 that they were not going to diversify until CSCO hit $100/sh. In Sept of 2001, their share price had dropped to $12/share. They still were the backbone of the internet but the internet and tech were no longer the darling of the Market. In Feb of 2009 they were at $14/sh and are today at $48/sh. So they today as an ongoing company still doing what it did and with a strong balance sheet are trading at roughly 2/3rds the price they were 20 years ago. That is what can happen to a really good tech company.\n\nBTW, CSCO is not the only one. Intel was at $74.88 in the fall of 2000 and is at $60/sh now and was running around in the $20's for most of the past 20 years. Still a great tech company doing great things.   And yes Intel employees also got rich on options.  I met with a Intel employee, a janitor, single, living in a trailer that was about to exercise $3 mm in net in the money INTC options and needed help with estate planning.   Those were the days.  A short edit:  In 2000 the estate tax began with only $675,000 of assets at death and it started just below 50% and quickly grew to 55%.   So you didn't need to be very wealthy to need estate tax planning.\n\nMicrosoft, one of today's tech darlings, was $50/sh in early 2000. It wandered around $25/share for 15 years until it again hit $50/sh in fall of 2015, fifteen long years later. The last 5 years have been good for it but will it stay at $200/sh?",
        "created_utc": 1595185321,
        "id": "fyl1bdi",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fyl1bdi/",
        "score": 56,
        "subreddit": "stocks",
        "created": 1595214121.0
    },
    {
        "author": "allprowi",
        "body": "If you want intel.  NVAX's market cap is still laughably low for a company that has gotten $2B in sales on a product in phase 1 off a product's results that hasn't been licensed yet. This could make them a giant worth $150B+ which means 30x is still left to be had. (edit) (I have only sold my initial investment in this company. I'm letting all that ride until they cure us all or fail.)",
        "created_utc": 1594572383,
        "id": "fxuclkh",
        "permalink": "/r/wallstreetbets/comments/hpx0j6/easiest_game_of_my_life/fxuclkh/",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1594601183.0
    },
    {
        "author": "joshmaaaaaaans",
        "body": "Man, I fucked up so big on AMD.\n\nI knew this shit was so undervalued, ryzen was just coming out and the 3 series was gaining insane hype like I've never seen before in the pc enthusiast market, and their stock value just wasn't reflecting that at all, so I bought in at around $9, then for some reason, just decided to sell at $12, even though I had told myself I'm going to hold this for the long term, this stock is going to go crazy, there's no reason it's so far below intel with the hype surrounding their ryzen and threadripper releases, just sold at $12 and completely forgot about it, lmao.\n\nFelsbedmen",
        "created_utc": 1594856853,
        "id": "fy77cs2",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy77cs2/",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1594885653.0
    },
    {
        "author": "TheSweetestKill",
        "body": "First off, save your F5 key, keep this website open in a tab. I listen to it all during trading hours. https://wsbsynth.com/\n\nSecond, same here with the job. What sort of intel do you look for? Since covid I have been working from home and I basically have fuck all to do most days, so I've been spending a lot of time researching and watching wsb and trading options. But I can't seem to find a decent strategy to win OR lose, it seems like I wind up week after week +10% or -10% but nothing crazy in either direction. My portfolio all time is only +5.3%.",
        "created_utc": 1594862466,
        "id": "fy7h75w",
        "permalink": "/r/wallstreetbets/comments/hs00ru/just_want_to_thank_all_you_dummies/fy7h75w/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1594891266.0
    },
    {
        "author": "Vtwin0001",
        "body": "LONG TERM CHAIR (CULT)\n\nGO FOR INTC",
        "created_utc": 1595003845,
        "id": "fydhkdv",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fydhkdv/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1595032645.0
    },
    {
        "author": "Pizza_Bagel_",
        "body": "You're letting your emotions dictate the day. \n\nAccording to you, Facebook, Amazon, NVDIA, and Google have run their companies into the ground and the Fed is propping them up. AMD isn't positioning themselves to overtake Intel. Tech isn't the future....You know this none of this is true, and you know the stocks doing the worst right now are those in fact that are in the most trouble. \n\nYou're angry because money is an imaginary concept, and imaginary concepts can be manipulated, and the people in a position to manipulate in their favor are the people in power. You failed to take that into consideration and are now crying over whatever bad position you took in the market.\n\nLife isn't fair. But don't make it harder on yourself by lying to yourself.",
        "created_utc": 1595353944,
        "id": "fyscilh",
        "permalink": "/r/wallstreetbets/comments/hv1v3h/never_forget/fyscilh/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1595382744.0
    },
    {
        "author": "10x_EBITDA",
        "body": "\"Tesla Is Now Bigger Than Intel, Verizon, AT&amp;T, Walt Disney And Bank of America\"\n\n 🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡  🤡",
        "created_utc": 1594069917,
        "id": "fx50q0g",
        "permalink": "/r/wallstreetbets/comments/hmfeen/what_are_your_moves_tomorrow_july_07_2020/fx50q0g/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1594098717.0
    },
    {
        "author": "wanderer56",
        "body": "Reposting one of my comments from another thread (with some slight changes to be particularly relevant to answer OP):\n\nThe Reddit popular \"Pandemic Bull Tech Thesis\" is just parroting of a nonsensical idea that world's populous has permanently altered their habits (be it in the form of individual consumption or in business practices) in the last 4 months thus justifying the valuations of companies that were likely already trading at lofty sums pre-crash.\n\nThe \\*only\\* way you can justify this narrative is if you believe the world isn't heading (further) into a deep recession for the next 1-3 years and that the new normal is simply a reorienting of pre-COVID level spending and consumption toward these few \"tech titans\".\n\nIf you decide to buy into this sand castle story of infinite tech growth, ask yourself...\n\nWhy have Zoom's execs been dumping their stock during its COVID run?\n\nHas Apple sold more iPhones since March YOY (and will people have the disposable income to continue to buy Apple products for the next year)?\n\nIs NVIDIA really worth more than Intel now at 1/7th their revenues?\n\nIs Netflix, a company that isn't profitable, worth more today with the increasing competition in the streaming space?\n\nIs Shopify with an estimated PEG of above 20 (when anything above 1 is considered over valued) going to sustain it's current price with massive earnings while we're in the worst economic crisis since the Great Depression?\n\nIs Facebook losing its biggest advertisers bullish?\n\nAnd don't even get me started on Tesla... \\*bUt iT's a BaTtErY sTaRt-Up\\*\n\nIt's hard to believe so many people are justifying these company's valuations based on this idea that the companies themselves somehow represent the next major technological revolution. An expanded product line of shiny computers and reality TV-show streaming aren't something to be counted on for unlimited upward stock movements nor is it something to celebrate as the dazibao of 21st century progress.",
        "created_utc": 1594509937,
        "id": "fxrsj3a",
        "permalink": "/r/investing/comments/hpd6ve/are_we_really_in_a_tech_bubble/fxrsj3a/",
        "score": 19,
        "subreddit": "investing",
        "created": 1594538737.0
    },
    {
        "author": "likeitis121",
        "body": "Depends on how you categorize them.  They aren't software companies, but the general market sees them as tech companies, which is the companies that benefit so much.  The people hyping up Tesla so much, are arguing that it's a tech company, even though it makes cars.\n\nThe big 5 (MSFT/AAPL/AMZN/FB/GOOG) are definitely solid companies.  That doesn't change the fact that they've gotten overvalued.  Apple has grown 2.5x in value the past few years, but revenues have slowed, and profits really haven't changed much.  \n\nBelow that top tier you have a bunch of unprofitable $100-300M companies that have gotten hyped up.  And simply comparing it to 2000 without reference is ignoring it.  Microsoft, Cisco, and Intel were top 10 companies and weren't the single product late 90's product that you focus on.  Cisco still lost 90% of it's value, and still isn't back up there.  Microsoft still took 16 years to recover it's lost market cap.  \n\nHow am I throwing a tantrum.  It's a fact that the only time that valuation compared to trailing earnings was higher was the dot com bubble, and near right before great depression, the only time that market cap was higher as a percentage of GDP was dot com bubble.  There's tons of comparables that suggest this market is overvalued, and absolutely 0 that it's undervalued compared to history.",
        "created_utc": 1594779580,
        "id": "fy3qh5v",
        "permalink": "/r/StockMarket/comments/hrd2vx/dow_futures_jump_250_points_after_moderna_says/fy3qh5v/",
        "score": 18,
        "subreddit": "StockMarket",
        "created": 1594808380.0
    },
    {
        "author": "skwirly715",
        "body": "MSFT has growth potential due to its diversification across tech sub-sectors. It is also safe for this reason, whereas single-service companies are less so. I don’t think you can put it in the same box as Cisco or Intel, hardware companies focused on providing a single service. \n\nMSFT has greater market share in the broader tech sector than either of those companies because it has expanded vertically (across sub sectors, for example gaming, office software, web services, laptops/hardware) instead of trying to expand horizontally (within its own sub sector) and has plans to continue to do so via its cloud services. I personally do not know who will “win” the cloud web services sub sector but I know that MSFT won’t lose purely due to its advantage in existing office software (MS Office integrates well with devices like Azure and Sharepoint making it more appealing to companies exploring the cloud).\n\nI love your take regarding the cyclical nature of those speculator dollars, but I think MSFT should be compared to AAPL, AMZN, and GOOG instead of CSCO and Intel. Maybe Shopify is a better comp for CSCO and Intel?",
        "created_utc": 1595194666,
        "id": "fylihmd",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fylihmd/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1595223466.0
    },
    {
        "author": "Iskippedfaceday",
        "body": "I don’t mean to sound rebellious, but this sub has really rejected the potential of this stock for no reason.\n\nThey are partnered with: Apple, Nvidia, Intel, AMD, Boeing, IBM, Lenovo, HP, Lyft, Puma, Toshiba, Raytheon, Thunderbolt, Universal Audio, Focusrite, and Cisco etc...\n\nThey also make twice as much revenue as their entire market cap and now have the only PCIe 4.0 expansion system in the world.\n\nI understand that the history of this sub is based on people getting burned and such, but when we all drool over a possible partnership with ONE of those companies? This company has them all already. \n\nTheir contracts with the U.S. military, side projects with NVIDIA, and the incentives given to their CEO to keep their share price up are just bonuses. \n\nI am really committed to seeing how this company performs, because after beating their earnings so many times, they are definitely well-positioned to move forward.",
        "created_utc": 1594671110,
        "id": "fxyqaxx",
        "permalink": "/r/pennystocks/comments/hqm2v8/oss_detailed_dd_on_the_pcie_backbone_of_nvidia/fxyqaxx/",
        "score": 17,
        "subreddit": "pennystocks",
        "created": 1594699910.0
    },
    {
        "author": "avelak",
        "body": "TSLA with a higher market cap than intel, verizon, at&amp;t, coca-cola, disney, bank of america...",
        "created_utc": 1594071656,
        "id": "fx5484d",
        "permalink": "/r/wallstreetbets/comments/hmfeen/what_are_your_moves_tomorrow_july_07_2020/fx5484d/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1594100456.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "Dividends?  We are talking about tech stocks here.  CSCO began dividends in 2011 at an overwhelming $0.06/share.  MSFT started dividends in 2003 at a magnificent 8 cents/share and today is paying an outstanding dividend of 0.98%.   Intel (INTC) was paying dividends in 2000 and it was a huge 2 cents/share.   The words dividends and tech stocks can not easily be used in the same sentence.",
        "created_utc": 1595187041,
        "id": "fyl4k6y",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fyl4k6y/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1595215841.0
    },
    {
        "author": "knitekloud",
        "body": "I didn’t believe the hype behind amd until I switched from intel to the new ryzen cpus. Kind of blown away at the price per performance.",
        "created_utc": 1595312567,
        "id": "fyqpdt4",
        "permalink": "/r/stocks/comments/huxla4/why_is_amd_so_popular_on_this_sub/fyqpdt4/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1595341367.0
    },
    {
        "author": "midwestck",
        "body": "Intel has fossilized and is now on display at the Smithsonian. Qualcomm is a penny stock",
        "created_utc": 1594341282,
        "id": "fxhd03a",
        "permalink": "/r/wallstreetbets/comments/ho9pmw/its_2027/fxhd03a/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1594370082.0
    },
    {
        "author": "Shaggyninja",
        "body": "I'm not so sure. Every time AMD posts earnings it drops. Then it rallys like crazy until the next earnings and drops.\n\nExcept this time. It didn't rally, it just bounced around the low 50s. For the first time ever it might actually jump after earnings because it hasn't had any stock growth this quarter.\n\nPlus Intel fucking sucks so I expect a healthy forward estimation",
        "created_utc": 1595283833,
        "id": "fypf8jz",
        "permalink": "/r/wallstreetbets/comments/hus2ji/amd_tendy_printer/fypf8jz/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1595312633.0
    },
    {
        "author": "[deleted]",
        "body": "I seriously doubt there are many AMD investors who got in at $2 and said \"this company is definitely going to hire a new CEO that completely turns this company around and win the battle for sub 10 nm lithography against Intel in 10+ years, while Intel just continuously blows their advantage\"\n\nWhen AMD was $2, it was a shit company. It's a 1 in 1,000 case of a company turning things around. Sure, if you bought it for $2 in 2008 and held for 12 years, you would be doing awesome now, but there was nothing about 2008 AMD that would logically lead an investor to believe that their chips would be industry leading in 2020",
        "created_utc": 1595170450,
        "id": "fyk9jtf",
        "permalink": "/r/pennystocks/comments/htusv5/this_sub_in_a_nutshell/fyk9jtf/",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1595199250.0
    },
    {
        "author": "crazy_goat",
        "body": "Increased my position even though the stock has been boring as hell to own.\n\nRumors about Nvidia getting stuck on Samsung 8nm with mediocre performance/handicap has me thinking AMD could benefit in the near-term.  \n\n\nIntel is just waiting to tank - AMD might make inroads there too.",
        "created_utc": 1595280093,
        "id": "fyp7qca",
        "permalink": "/r/wallstreetbets/comments/hus2ji/amd_tendy_printer/fyp7qca/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1595308893.0
    },
    {
        "author": "YoungCrouton99",
        "body": "Currently building my PC rn and let me tell you dude definitely go AMD. Not only are they much cheaper but they are absolutely blowing Intel out of the water right now with the processing power they are achieving through how many cores and threads they’re pumping into their processors.",
        "created_utc": 1595356579,
        "id": "fysi03g",
        "permalink": "/r/wallstreetbets/comments/hv9g86/amd_is_a_cumrag_of_a_stock/fysi03g/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1595385379.0
    },
    {
        "author": "austinblacknj",
        "body": "AMD &gt; INTC",
        "created_utc": 1595263856,
        "id": "fyoack5",
        "permalink": "/r/wallstreetbets/comments/huod7n/daily_discussion_thread_for_july_20_2020/fyoack5/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1595292656.0
    },
    {
        "author": "Halli75",
        "body": "Yes definitely a smart decision. I was about to comment Amd as well. Amd is having their gpu tech and cpu tech in the ps5 and their new thread ripper pro lineup makes it impossible to resist the opportunity. Not to mention that they have a brilliant new CEO and are dominating intel in the cpu game and nvidia in the gpu game as far as price to performance is concerned. You can trust my word, I am a day trader and investor. Also this is kind of a risky investment because if you look at AMDs past you can see that every time they seem like they are doing good their stock price crashes because intel launches a new insane chip. Sorry if my English sucks by the way and I hope this gets chosen man.",
        "created_utc": 1594857944,
        "id": "fy79avn",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy79avn/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594886744.0
    },
    {
        "author": "Iskippedfaceday",
        "body": "Yes. Especially NVIDIA. They’re married to one another. There is actual PR from Nvidia that cites them as the main provider of PCIe 4.0 expansion.\n\nFor Lyft they will provide the systems for AI training and self driving power.\n\nFor NVIDIA, Intel, and AMD, the products are the pieces of their systems. It’s a symbiotic relationship.\n\nFor major corporations, they create the big “racks” that you see that can supply the whole building, hence the PCIe 4.0.\n\nFor the government and military? They have systems powerful enough for DLSS, AI learning, and large scale data transfer. And just received another order from the Navy last month.\n\nI could go on",
        "created_utc": 1594672340,
        "id": "fxysw0b",
        "permalink": "/r/pennystocks/comments/hqm2v8/oss_detailed_dd_on_the_pcie_backbone_of_nvidia/fxysw0b/",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1594701140.0
    },
    {
        "author": "LocalestofLols",
        "body": "Went through Earnings Calendar and picked out some well known names who have earnings in the next 2 weeks. Time to do some DD\n\n* DAL 7/14\n* C  7/14\n* JPM 7/14\n* EBAY 7/15\n* BAC 7/16\n* MSFT 7/16\n* JNJ 7/16 \n* ALLY 7/17 (Fuck ALLY, 3/20 Calls still haunt me)\n* KO 7/21 \n* SNAP 7/21\n* T 7/23\n* INTC 7/23\n* TWTR 7/23\n\nHard to imagine bank earnings will be pretty",
        "created_utc": 1594232095,
        "id": "fxc5yyu",
        "permalink": "/r/wallstreetbets/comments/hnegmj/daily_discussion_thread_for_july_08_2020/fxc5yyu/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1594260895.0
    },
    {
        "author": "marksizzle",
        "body": "Hi, I have no history with you so hopefully we can have a clean conversation. We have a small team researching this company. We'll have a more in depth DD post dropping soon, but for now I'll address your partnership comment.\n\nThose companies are listed on the \"Partners\" page of the OSS site and you cannot use the logo of or claim to be a partner of a major tech company without permission. Source, I worked for a start up and we were doing food safety tech through a company that served Google campus so we tried to put the Google logo on our site under partners and we got a serious slap on the wrist.\n\nNow to address the concerns about whether or not they are a partner or just compatible with their technology - yes, they are partners. Specifically using the HPC server technology, which is high performance computing, that is listed on that partners page in the small blurb. This would typically be some type of server rack with the PCIe backbone to have multiple processors or GPUs to do high performance computing of some variety for those companies listed such as Apple, Intel, etc. It may be crunching numbers for Apple Maps or maybe just for how many times the restrooms were cleaned across the Apple campus. We don't know. We just know they use the OSS HPC products at a large enough scale that they have approval to put them on the partners page.\n\nI hope that helps clear things up. Please be on the look out as we continue to publish more information that we find. Thanks and enjoy the rest of your weekend.",
        "created_utc": 1594587132,
        "id": "fxv4l7h",
        "permalink": "/r/pennystocks/comments/hq0x80/potential_pennystock_of_the_year_oss_one_stop/fxv4l7h/",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1594615932.0
    },
    {
        "author": "osamaromoh",
        "body": "No worries. Happy to help. My sheet has the following stocks: IBM, KO, SNAP, UAL, MSFT, TSLA, T, TWTR, AAL, INTC, and VZ. If you’re interested in the specific analysis of any, let me know and I’ll write them here as text.",
        "created_utc": 1595178309,
        "id": "fyknv5w",
        "permalink": "/r/options/comments/hu11zj/next_weeks_earning_plays/fyknv5w/",
        "score": 7,
        "subreddit": "options",
        "created": 1595207109.0
    },
    {
        "author": "wanderer56",
        "body": "What does this comment really mean, though? This sounds like the parroting of a nonsensical idea that world's populous has permanently altered their habits (be it in the form of individual consumption or in business practices) in the last 4 months thus justifying the valuations of companies that were likely already trading at lofty sums pre-crash.\n\nThe \\*only\\* way you can justify this narrative is if you believe the world isn't heading into a deep recession for the next 1-3 years and that the new normal is simply a reorienting of pre-COVID level spending and consumption toward these few \"tech titans\".\n\nAs you continue to buy into this sand castle story of infinite tech growth, ask yourself...\n\nWhy Zoom's execs have been dumping their stock during it's COVID run?\n\nHas Apple sold more iPhones since March YOY (and will people have the disposable income to continue to buy Apple products for the next year)?\n\nIs NVIDIA really worth more than Intel now at 1/7th their revenues?\n\nIs Netflix, a company that isn't profitable, worth more today with the increasing competition in the streaming space?\n\nIs Shopify with an estimated PEG of above 20 (when anything above 1 is considered over valued) going to sustain it's current price with massive earnings while we're in the worst economic crisis since the Great Depression?\n\nFacebook losing it's biggest advertisers is bullish?\n\nAnd don't even get me started on Tesla... \\*bUt iT's a BaTtErY sTaRt-Up\\*\n\nIt's hard to believe so many people are justifying these company's valuations based on this idea that the companies themselves somehow represent the next major technological revolution. An expanded product line of shiny computers and reality TV-show streaming aren't something to be counted on for unlimited upward stock movements nor is it something to celebrate as the dazibao of 21st century progress.\n\nDo one of those remind me in 6 months things and let's see where we're at.",
        "created_utc": 1594435241,
        "id": "fxlivld",
        "permalink": "/r/investing/comments/hox6ij/anyone_else_a_little_spooked_by_whats_going_on/fxlivld/",
        "score": 7,
        "subreddit": "investing",
        "created": 1594464041.0
    },
    {
        "author": "shuttdown700",
        "body": "AAPL is at a pretty high valuation right now, likely their growth as an SaaS provider has added to the multiple. However, their supply chain is complex and adds risk, but it seems like they’re trying to become more vertically integrated as with the last switch away from Intel",
        "created_utc": 1594504534,
        "id": "fxrdnh3",
        "permalink": "/r/stocks/comments/hpgat1/trying_to_convince_your_younger_self_to_buy_apple/fxrdnh3/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1594533334.0
    },
    {
        "author": "Mintykanesh",
        "body": "TL;DR AMD is currently the smaller competitor in CPUs vs Intel and GPUs vs Nvidia. But for various reasons AMD is set to dominate Intel and be much more competitive vs Nvidia in the next few years. That and AMD is just becoming profitable and has nearly paid off its debt, so P/E should improve a lot pretty fast.\n\n**CPU Context**\n\nTheir main competitor is Intel who for a long time have been the dominant force in CPU design and manufacture - at least for laptops, desktops and servers anyway. They had most of the market share (think 90% +) earning most of the revenue and most of the profit.\n\nIntel managed this because both their CPU architecture was superior to their competitors and their manufacturing capability was also significantly more advanced. Intel simply made a better product for a long time. In contrast in the mid 2010s AMD released a new CPU architecture called Bulldozer which was *terrible*. It was so bad it almost killed the company.\n\nBut Intel was badly mismanaged in recent years. Instead of continuing to invest heavily in R&amp;D to maintain their dominant position, they milked their customers by selling virtually the same products every year at high markup. They managed to get away with it because their manufacturing technology continued improving with node shrinks roughly every 2 years which translated to better performance, energy efficiency etc.\n\nBut then everything went wrong for Intel and right for AMD at roughly the same time.\n\n**CPU Manufacturing**\n\nIntel got stuck on their 14nm process. They were supposed to begin mass producing products on their next 10nm node way back in 2016 but they still haven't really managed it. There are some 10nm products on the market now but performance is really poor and yields are terrible i.e. a lot of Intel's 10nm CPUs are broken and can't be used.\n\nDuring this time their manufacturing competitors like TSMC simply caught up and have now overtaken them. I think TSMC 5nm is entering mass production later this year. AMD CPUs are manufactured by TSMC so AMD have been benefiting from this significantly and all signs are pointing to this advantage increasing.\n\n**CPU Architecture - Zen**\n\nAMD's bulldozer sucked, but they followed it up with a new architecture called Zen in 2017 which was much more competitive. Their current Zen 2 architecture is pretty much equal to Intel's current offerings in terms of IPC and Zen 3 is rumoured to be a pretty big jump which may give them the architecture lead as well.\n\n**CPU Architecture - Chiplets**\n\nOne of the ways Intel screwed customers was not increasing core counts for years - they just didn't innovate in this area. AMD however did.\n\nThey came up with a chiplet design where rather than having the whole CPU on one die like Intel (a monolithic design) they consist of multiple smaller chiplets which are connected together. It's much easier to manufacture large core count CPUs this way as if a single large die has a defect on it it can kill the whole thing, so it's less risky to make smaller dies and hook them up.\n\n**CPU Summary**\n\nThe combination of the improved Zen architecture, the chiplet design and the TSMC manufacturing lead means AMD can produce higher core count CPUs than Intel can at lower cost. They also use less energy. They also tend to offer more features. They also run faster when core counts are high.\n\nSo now their products in the consumer space are very competitive VS Intel. Intel has a marginal gaming lead due to higher clocks at lower core counts still but AMD looks like a no-brainer in a lot of cases.\n\n* If you need lots of cores - go AMD\n* If you want a laptop with long battery life - go AMD (at least when their new Zen 2 based models are out - mobile chips come last for AMD)\n* If you need features like ECC - go AMD\n* If you need lots of PCI-E lanes - go AMD\n* If you run a datacenter - go AMD for the greatly reduced cost per core and better power efficiency. There is a **LOT** of money here.\n\nAll signs are pointing to these advantages only getting larger as AMD releases Zen 3 and TSMC extend their manufacturing lead over Intel.\n\n**GPUs**\n\nNvidia has been dominating AMD in the GPU space for a long time. AMD has some products competitive in the low-mid range but they just haven't been able to match Nvidia's best performance. The 2080ti came out in Sep 2018 but AMD still haven't released anything as fast.\n\nBut it's rumoured AMD may make a bit of a comeback when their new architecture RDNA 2 hits later this year. It's supposedly significantly faster than their current offerings and it looks like they may have manufacturing leadership as well. Again TSMC produce AMDs GPUs but normally they also produce them for Nvidia as well. But supposedly Nvidia tried pitting Samsung vs TSMC to reduce their prices and TSMC just gave them the boot, meaning Nvidia now has to produce their next gen cards on Samsung who offer an inferior process.\n\nA lot of this is based on rumour though. It's looking fairly certain AMD will be making serious headway on the CPU front, the GPU front is more of an unknown at this point.\n\n**Consoles**\n\nNot much to say here - AMD is producing the CPUs and GPUs for both the next Xbox and Playstation. This will bring a nice revenue boost in Q4 this year and in to next year, but this should be priced in.\n\n**Coronavirus**\n\nAMD is set to benefit greatly from coronavirus. There has been increased demand for their products as adoption of cloud services increases and consumers need their own devices to WFH. Intel may gain significantly as well as they are still the dominant player, and the server markets move slowly and consumers can take a while to change their opinion of brands. But it should still be a positive.\n\n**Risks**\n\nOn the negative side AMD is really vulnerable to political issues with China. They are reliant on TSMC to manufacture their products and TSMC are based in Taiwan.\n\n**AMD's Finances**\n\nAMD is coming from a situation to where they were nearly bankrupt to one where they are rapidly gaining market share. They are set to capture market share in CPUs, a market which is also growing significantly at the moment and may well do so in the GPU space as well.\n\nThey have also been paying off their debt and have nearly got rid of all of it. Together that means they are set for a rather big jump in earnings which could quickly lower their P/E ratio. Or they could increase R&amp;D investment which helps them build on their success on the longer term / a bit of both.",
        "created_utc": 1595332434,
        "id": "fyr9ohr",
        "permalink": "/r/stocks/comments/huxla4/why_is_amd_so_popular_on_this_sub/fyr9ohr/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1595361234.0
    },
    {
        "author": "daaabears1",
        "body": "This is what I did: I started with YouTube to learn exactly what 5G is, how it works differently compared to 4G and how absolutely life changing 5G will be compared to 4G. We’re talking self driving cars, delivery drones, and doctors in New York performing surgery on soldiers in Afghanistan in a tent. \n\nFrom there you have the companies that make the actually radio transmission device like Nokia and Ericsson (both very reasonably priced). Those devices have to go somewhere so you put them on a tower owned by AMT and CCI (crown castle, not carnival cruise line). Those companies make money renting the towers to the service providers. Then you have the companies that make the chips that go into those devices, the chips that go into cell phones, drones and the internet of things (NVDA, INTC, MRVL, QCOM, etc.). Then there are the companies that make the devices we buy to connect us to 5G (Apple, amazon, google, Tesla). Finally there are the service providers like Verizon att and t mobile that connect our devices to the 5G network. \n\nI suggest starting at YouTube. There are videos that explain what each company does and their role in the 5G network.\n\nHowever, I wanted ALL of the companies with not a lot of money so I went after the 5G ETF (ticker: FIVG).",
        "created_utc": 1595302302,
        "id": "fyqbmrn",
        "permalink": "/r/stocks/comments/huvvu5/5g/fyqbmrn/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1595331102.0
    },
    {
        "author": "cassiusclayd",
        "body": "Only if you bought the right ones. A number of the largest cap tech stocks in 1999 have \\*absolutely not\\* done just fine. Cisco and Intel, for example, have never fully recovered since the dot com bubble.",
        "created_utc": 1594529924,
        "id": "fxsug93",
        "permalink": "/r/investing/comments/hplw3z/is_this_what_the_market_felt_like_in_2010_and_2011/fxsug93/",
        "score": 6,
        "subreddit": "investing",
        "created": 1594558724.0
    },
    {
        "author": "LePootPootJames",
        "body": "Goldman Sucks downgraded Intel. Last week they downgraded America and we got a +2% gain today. You know what that means. Intel to the moon lol.",
        "created_utc": 1594064087,
        "id": "fx4osmm",
        "permalink": "/r/wallstreetbets/comments/hm51pm/daily_discussion_thread_for_july_06_2020/fx4osmm/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1594092887.0
    },
    {
        "author": "RandyCrane17",
        "body": "Goldman downgrades intel so you know that means to get calls.",
        "created_utc": 1594071916,
        "id": "fx54qvz",
        "permalink": "/r/wallstreetbets/comments/hmfeen/what_are_your_moves_tomorrow_july_07_2020/fx54qvz/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1594100716.0
    },
    {
        "author": "GamblingMikkee",
        "body": "RTX, BA, XOM, CVS, MO, CAT, FDX, INTC, SBUX, WFC, AXP, KMI, MMM, WBA, CVX etc\n\nAll getting massacred",
        "created_utc": 1595258480,
        "id": "fynzjkd",
        "permalink": "/r/wallstreetbets/comments/hu74gf/what_are_your_moves_tomorrow_july_20_2020/fynzjkd/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595287280.0
    },
    {
        "author": "TomPrince",
        "body": "Good intel! On lesser news they’ve shot above $10 in the last month. This is a nice little play.",
        "created_utc": 1594660744,
        "id": "fxy4fiw",
        "permalink": "/r/wallstreetbets/comments/hqj3jx/dd_buy_hpe_like_right_now_today_tendies_print/fxy4fiw/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1594689544.0
    },
    {
        "author": "lonewolf420",
        "body": "Not OP but a refute to a few of your points.\n\n&gt;This is a lie, Intel has the fastest performance on the market if we look at performance per core.  \n&gt;  \n&gt;Most programs only use a limited amount of CPU cores.\n\nonly gaming really uses 1-2 cores ,not most programs, its 2020 software developers know how to utilize multiple cores, and for gaming GPUs are where its at anyways. Workstations don't care about clock speed, they want multi core throughput.\n\n&gt;The only thing AMD has is slightly cheaper prices and a lot of cores that are usually unused, though in some specialties those cores are very useful.\n\nagain I have both AMD and Intel comps, the AMD wins hands down with price per performance on everything but gaming higher clock speed and I could still overclock if I absolutely needed more but most games do not care about CPUs its GPU bottle-necked.\n\n&gt;i5 9600K outperforms Ryzen 7 3700X and is cheaper than Ryzen 7 3700X\n\nonly in single core speed, in multi core processes the 3700X has 2 more cores and twice the threads it would dominate the i5 9600K. A better comparison in the cheaper benchmarks is a 3600X anyways as it has the same 6 cores but more threads at roughly the same clock speed and similar price as a i5 9600K. Making it a better choice than the i5 9600K in everything but gaming and in gaming both CPUs would perform just fine.",
        "created_utc": 1594235567,
        "id": "fxcdgl2",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxcdgl2/",
        "score": 6,
        "subreddit": "investing",
        "created": 1594264367.0
    },
    {
        "author": "Sir_Bleezie",
        "body": "They also got the PlayStation and Xbox deal. Should be factored into this earnings. Ryzen processors are straight slaughtering Intel.",
        "created_utc": 1595200728,
        "id": "fylth3s",
        "permalink": "/r/investing/comments/hu1fzh/400_plus_companies_reporting_earnings_this_week/fylth3s/",
        "score": 6,
        "subreddit": "investing",
        "created": 1595229528.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 21st of July\n\n\n\n## Upcoming events for Tuesday, July 21st\n\n - Expected earnings:\n\n  AGR, AIR, AMTD, CALX, CATC, CBSH, CIT, CMA, CNI, COF, CSL, EQBK, FFIC, FFWM, FMBI, FNF, FULT, GATX, GPK, HCSG, HOPE, HWC, IBKR, IRBT, ISRG, KB, KO, LMT, MBWM, MUSA, NAVI, NBHC, NCBS, NEOG, NVS, OGI, PCAR, PEBO, PFBC, PLD, PM, PNFP, REXR, SBNY, SFNC, SMBK, SNAP, SNV, SUM, SYF, TER, TRNS, TRST, TXN, UAL, UBS, UCBI, USNA, WAFD, WRB, WTFC\n\n - Ex-div:\n\n  APA, CMRE, FUL, LOW, SUNS\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -8.322M)\n    - Chicago Fed National Activity (previous: 2.61)\n    - Redbook (previous: -5.5%)\n    - Redbook (previous: 3.0%)\n\n## Upcoming events for Wednesday, July 22nd\n\n - Expected earnings:\n\n  ABB, AFI, ALGN, APH, ARR, ATEC, ATNI, AVNT, AXTI, BANR, BCOV, BDN, BEDU, BFST, BIIB, BKR, BOKF, BRKL, CADE, CAJ, CASH, CBD, CBNK, CHKP, CHX, CKH, CLB, CLBK, CLGX, CMG, CMRE, CNS, CP, CPAC, CPSS, CSX, CTO, CUBI, CVBF, CVCY, CVLG, DB, DFS, DOV, ECHO, EFX, EGBN, EIG, EVR, FARO, FBNC, FCCO, FCFS, FR, FSB, GGG, GL, GSK, GTY, HCA, HCCI, HLX, ICLR, INBK, INVA, IQV, JMP, KALU, KEY, KMI, KNX, LAD, LMST, LN, LOB, LSTR, LVS, MCB, MCRI, MHO, MKTX, MLCO, MSA, MSC, MSFT, MTH, NDAQ, NFBK, NRZ, NTB, NTGR, NTRS, NVR, OBNK, ODT, OMAB, OMC, ORRF, OSBC, PINE, PLXS, RCI, RCKY, RLI, RUSHA, SAVE, SBSI, SCCO, SCL, SEIC, SJW, SLG, SLGN, SLM, SLRX, SONM, STC, STL, SU, SUI, SYBT, TCBI, TCFC, TDY, TLRD, TMO, TRN, TRVG, TSC, TSLA, UFPI, UMPQ, USAP, UVSP, VAR, VMI, WHR, WIX, WPG, WSBC, WSBF\n\n - Ex-div:\n\n  AGX, BGH, COO, CVS, DX, FMN, FSLF, LTC\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.314%)\n    - Crude Oil Imports (previous: -1.983M)\n    - Crude Oil Inventories (consensus: -1.950M, previous: -7.493M)\n    - Cushing Crude Oil Inventories (previous: 0.949M)\n    - Distillate Fuel Production (previous: 0.104M)\n    - EIA Refinery Crude Runs  (previous: -0.038M)\n    - EIA Weekly Distillates Stocks (consensus: -0.550M, previous: -0.453M)\n    - EIA Weekly Refinery Utilization Rates (previous: 0.6%)\n    - Existing Home Sales (consensus: 24.5%, previous: -9.7%)\n    - Existing Home Sales (consensus: 4.78M, previous: 3.91M)\n    - Gasoline Inventories (consensus: -1.175M, previous: -3.147M)\n    - Gasoline Production (previous: 0.050M)\n    - Heating Oil Stockpiles (previous: 0.420M)\n    - House Price Index (previous: 0.2%)\n    - House Price Index (previous: 288.3)\n    - House Price Index (previous: 5.5%)\n    - MBA 30-Year Mortgage Rate (previous: 3.19%)\n    - MBA Mortgage Applications (previous: 5.1%)\n    - MBA Purchase Index (previous: 305.4)\n    - Mortgage Market Index (previous: 815.5)\n    - Mortgage Refinance Index (previous: 3,774.3)\n    - Seevol Cushing Storage Report (previous: 1.748M)\n\n## Upcoming events for Thursday, July 23rd\n\n - Stock splits:\n\n    - BBX @ **1:5**\n    - PREF @ **5:1** (Payable date: )\n\n - Expected earnings:\n\n  AAL, AB, ABEV, ACBI, ADS, AEP, ALK, ALKS, ALLE, AN, APD, ARD, ASB, ASPS, AUB, AUY, BANC, BJRI, BOOM, BPOP, BPRN, BWB, BX, BY, CFB, CLFD, CMS, COLB, CSTR, CTAS, CTS, CTXS, CVE, CX, CYBE, DECK, DEO, DGX, DHR, DOW, DRQ, EHTH, ENTG, EQNR, ERIE, ESQ, ETFC, EW, EWBC, FAF, FBIZ, FCX, FE, FET, FFBC, FFNW, FITB, FIX, FMBH, FOR, FRME, FSBW, FSV, FWRD, GBCI, GCAP, GHL, GLOP, GLPG, GNCA, GPL, GTLS, GWW, HBAN, HBIO, HEES, HFWA, HONE, HRI, HSY, HTBI, HTBK, HZO, ICBK, IEX, INDB, INT, INTC, ISTR, JILL, KMB, KOF, LMAT, LNTH, LOGM, LUV, LYV, MANH, MAT, MCBC, MITK, MNOV, MOFG, MPB, MSBI, MTA, MTB, MTRN, MXL, MYFW, NOK, NUE, NURO, OCFC, OMCL, OPBK, ORI, OZK, PAC, PBCT, PCB, PDS, PHM, PNR, POOL, POWI, PTEN, RBNC, RCL, RGP, RHI, RNGR, RS, SAFE, SAM, SASR, SBBX, SBCF, SCHL, SCPL, SGMS, SHBI, SIVB, SKX, SMMF, SMP, SMSI, SONA, STM, SWKS, T, TACO, TBNK, TCBK, TCO, TECK, TEF, TILE, TMUS, TOT, TOWN, TREE, TRV, TSCO, TTM, TWTR, UBSI, UHS, UNP, VICR, VLRS, VLY, VRSN, VVI, WBS, WRLD, WSFS, WSO, WST, WTBA, WTER\n\n - Ex-div:\n\n  BGB, BGX, BSL, BUSE, BWG, COKE, DFP, DMO, EFF, EFR, EFT, EHI, EMD, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EVG, EVT, EXD, EXG, FFC, FLC, GAIN, GDO, GFY, GLAD, GOOD, HFRO, HGLB, HIE, HIO, HIX, HYI, IGI, J, KALU, LAND, LKFN, MGU, MMU, MTT, MVC, NHF, NTG, NVT, PBA, PBR, PBR.A, PFD, PG, PNR, PPT, SBI, TPZ, TYG, USA, WEA, WIA, WIW, WSM\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.470%)\n    - 4-Week Bill Auction (previous: 0.105%)\n    - 8-Week Bill Auction (previous: 0.110%)\n    - Continuing Jobless Claims (consensus: 17,067K, previous: 17,338K)\n    - Initial Jobless Claims (consensus: 1,300K, previous: 1,300K)\n    - Jobless Claims 4-Week Avg. (previous: 1,375.00K)\n    - KC Fed Composite Index (previous: 1)\n    - KC Fed Manufacturing Index (previous: 2)\n    - Natural Gas Storage (consensus: 47B, previous: 45B)\n    - US Leading Index (consensus: 2.1%, previous: 2.8%)\n\n## Upcoming events for Friday, July 24th\n\n - Stock splits:\n\n    - CMHHY @ **106.302:100** (Payable date: 08/06/2020)\n\n - Expected earnings:\n\n  ACRE, AIMC, AMTB, AXP, BBD, BCML, BLMN, CCB, CIVB, CRI, E, ENLV, ESXB, FHB, FMNB, FMX, GNTX, GT, HON, LBAI, LOAN, MCBS, MOG.A, NEE, NEP, OFG, PGC, PIPR, ROCK, SAL, SLB, TPH, TRTN, USAU, VNE, VRTS, VTR, VZ\n\n - Ex-div:\n\n  BCO, BK, CE, CLB, CZNC, DHC, ILPT, MMC, OPI, RMR, RY, SAR, SGU, SLP, SPFI, SVC, TRMT, UNB, VALU, WMK\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 110.9K)\n    - CFTC Copper speculative net positions (previous: 33.4K)\n    - CFTC Corn speculative net positions (previous: -99.7K)\n    - CFTC Crude Oil speculative net positions (previous: 539.8K)\n    - CFTC Gold speculative net positions (previous: 262.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 35.6K)\n    - CFTC Natural Gas speculative net positions (previous: -14.3K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -28.6K)\n    - CFTC Silver speculative net positions (previous: 43.9K)\n    - CFTC Soybeans speculative net positions (previous: 127.7K)\n    - CFTC Wheat speculative net positions (previous: 16.7K)\n    - Manufacturing PMI (consensus: 51.5, previous: 49.8)\n    - Markit Composite PMI (previous: 47.9)\n    - New Home Sales (consensus: 4.0%, previous: 16.6%)\n    - New Home Sales (consensus: 700K, previous: 676K)\n    - Services PMI (consensus: 51.0, previous: 47.9)\n    - U.S. Baker Hughes Oil Rig Count (previous: 180)\n    - U.S. Baker Hughes Total Rig Count (previous: 253)\n\n^^^^2020-07-21",
        "created_utc": 1595327944,
        "id": "fyr4sps",
        "permalink": "/r/RobinHood/comments/hv554a/daily_discussion_thread_july_21st_2020/fyr4sps/",
        "score": 6,
        "subreddit": "RobinHood",
        "created": 1595356744.0
    },
    {
        "author": "N4D5",
        "body": "LEO friend is undercover right now, drinks beer and gets lap dances all day and picks up street walkers for intel.\n\nBut Reddit hates him.",
        "created_utc": 1594526388,
        "id": "fxsoolg",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxsoolg/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1594555188.0
    },
    {
        "author": "cuteasy0",
        "body": "Intel is losing their ass my guy",
        "created_utc": 1594802158,
        "id": "fy4joc2",
        "permalink": "/r/wallstreetbets/comments/hr8uhb/what_are_your_moves_tomorrow_july_15_2020/fy4joc2/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1594830958.0
    },
    {
        "author": "anthropicprincipal",
        "body": "Intel spent [100's of millions on raytracing GPUs](https://en.wikipedia.org/wiki/Larrabee_\\(microarchitecture\\)) that went nowhere.\n\nIntel knew in 2010 it needed to enter the discrete GPU market and we are still waiting.",
        "created_utc": 1594248913,
        "id": "fxd4x9o",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxd4x9o/",
        "score": 6,
        "subreddit": "investing",
        "created": 1594277713.0
    },
    {
        "author": "IntrepidSjw",
        "body": "But intel doesn’t have a gpu market share do they lol?",
        "created_utc": 1594243160,
        "id": "fxctd1v",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxctd1v/",
        "score": 6,
        "subreddit": "investing",
        "created": 1594271960.0
    },
    {
        "author": "WaterBlueDev",
        "body": "AMD earnings is on July 28th in 8 days.  \n\n\nQ2 Covid people all have been buying new computers + Intel literally fisting their own assholes with their new line up and practically begging you to buy AMD.  \n\n\nGovt contract + new gaming hardware lineup all using AMD.  \n\n\nTSM + AMD partnership still going strong, and look at TSM's latest growth, AMD is gonna continue to rise to at least 63-65 range.",
        "created_utc": 1595279424,
        "id": "fyp6dec",
        "permalink": "/r/wallstreetbets/comments/hus2ji/amd_tendy_printer/fyp6dec/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595308224.0
    },
    {
        "author": "diabeetis",
        "body": "Got a Ryzen 4700u. Shits amazing. Intel r fuk",
        "created_utc": 1594497320,
        "id": "fxqj2wj",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxqj2wj/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594526120.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "Nasdaq bouncing off 10,900. Intels best consumer-grade CPU is the i9 10900K.\n\n\nINTC mooning, AMD dumping as usual.",
        "created_utc": 1594609299,
        "id": "fxw64hk",
        "permalink": "/r/wallstreetbets/comments/hq11ao/what_are_your_moves_tomorrow_july_13_2020/fxw64hk/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594638099.0
    },
    {
        "author": "EatTacosDaily",
        "body": "Any device that connect to the internet needs a CPU.  AMD has solid management. See ryzen processors.  Intel is boomer garbage with poor management.",
        "created_utc": 1594611419,
        "id": "fxw9azu",
        "permalink": "/r/wallstreetbets/comments/hq11ao/what_are_your_moves_tomorrow_july_13_2020/fxw9azu/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594640219.0
    },
    {
        "author": "KneeGrowsToes",
        "body": "Tell my why I shouldn't put all my money into AMD stock. Their revenue has been exponential. Intel just got downgraded to Sell by Goldman Sachs. If not Intel, then what else? Su bae.",
        "created_utc": 1594264608,
        "id": "fxdwc0e",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxdwc0e/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594293408.0
    },
    {
        "author": "Blacksin01",
        "body": "They make apple’s ARM lineup currently. With Apple moving away from Intel, they will likely be utilizing TSMC 7nm or 5nm process to make their new chips.",
        "created_utc": 1593730343,
        "id": "fwqyr97",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqyr97/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593759143.0
    },
    {
        "author": "Klutzy_Hamster",
        "body": "And AMD is planning on rapidly expanding their market share in server CPUs. Hence its a growth stock and Intel isn't.",
        "created_utc": 1595310437,
        "id": "fyqmwl9",
        "permalink": "/r/stocks/comments/huxla4/why_is_amd_so_popular_on_this_sub/fyqmwl9/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1595339237.0
    },
    {
        "author": "_Floriduh_",
        "body": "Lets take this one bite at a time. Please understand this isn't a personal rant of Intel hate or AMD love, just my informed opinion about the companies as investments. \n\nClock speed - Yep. Intel still holds *single core* performance crown, at the cost of incredibly high power draw and all for maybe 5% improvement. Multi-Core AMD still leads and offers more value per $ overall. \n\nMarket Share - Depends on your sources and regions so I won't nitpick on specifically \"who has more % of market share\" but rather, who has momentum and is gaining vs. losing market share. AMD is gaining consistently regardless of data source. \n\nSecurity Flaws - Threat to both, Intel has just had more bad press lately. No telling when these flaws get picked up in the media or how much they will effect. However, the CTS Labs scandal from 2018 shouldn't be ignored. An intel funded \"security\" company based in Israel announces AMD vulnerabilities publicly without contacting AMD (industry standard to give notice so they can fix). Vulnerabilities were practically nothing (diversion from Spectre and Meltdown) and company has faded into the background without answering any questions, deleting their webpage \"[AMDFlaws.com](https://AMDFlaws.com)\"\n\nMarketing Deception - \n\n* 2018 Computex Industrial Chiller incident to distract from Threadripper\n* Principled Technologies funded study, using an Intel funded benchmark, that pitted the i9-9900K  against a 2700X that deliberately had half its cores disabled\n* Threadripper losing to an i5 in same Intel funded benchmark\n* 2019 MDS vulnerability appears, Intel bribes researchers to downplay severity\n* \"Real World Performance\" campaign the moment benchmarks started showing AMD consistently in the lead, trying to devalue long standing benchmark validity. \n* \"Financial Horsepower\" $3 BILLION set aside to persuade anyone considering AMD to stick with Intel.\n* \"Real World Performance\" caught deliberately hiding disclosures, which exist because Intel was previously caught in anti-consumer deceptive practices in 2009. \n* Plethora of vaporware product announcements with rigged benchmarks, but since the product was never released we can't independently test. \n\nAnti-Competitive Practices - See $3Billion bullet above. And dont' recall what their latest margins on CPUs were, but AMD margins are increasing and Intel has been price cutting. Again, momentum in AMDs favor. \n\nNvidia Market Leader - Team Green has long been the GPU market leader and it isn't debatable, but as AMD (hopefully) and Intel both become more competitive Nvidia may be forced to cut into their margin to stay on top. Sources vary again, but typically they sit at about 70% market share +/-. \n\nMy comparison to Ford/Tesla = Intel/Nvidia remains. Intel has the capability/cash to turn the ship around but I'm not buying until I see a defined culture shift there.",
        "created_utc": 1594238240,
        "id": "fxcj39a",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxcj39a/",
        "score": 5,
        "subreddit": "investing",
        "created": 1594267040.0
    },
    {
        "author": "Nightman2122",
        "body": "Applefi - they are going to launch their own network. They also pushed out intel to keep chips in house to lower costs. Oh and they have more cash than God.",
        "created_utc": 1594260790,
        "id": "fxdpxy7",
        "permalink": "/r/wallstreetbets/comments/hnum1n/apple_bulls_youre_dumb_maybe/fxdpxy7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594289590.0
    },
    {
        "author": "durtyfn",
        "body": "Seriously?! Wall Street bets is literally a troll forum. Don’t listen to any intel from there.",
        "created_utc": 1595256434,
        "id": "fynvobr",
        "permalink": "/r/options/comments/hug6s1/731_nkla_put/fynvobr/",
        "score": 5,
        "subreddit": "options",
        "created": 1595285234.0
    },
    {
        "author": "Power80770M",
        "body": "Nope, you're wrong. Cisco, Intel, Oracle, and Microsoft had absolutely insane valuations back then, and they were all very profitable.",
        "created_utc": 1594071020,
        "id": "fx52y7k",
        "permalink": "/r/wallstreetbets/comments/hmgm67/article_from_2013_about_the_2000_bubble_anything/fx52y7k/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594099820.0
    },
    {
        "author": "maztron",
        "body": "I don't think so.  There were other factors involved at that time in which are not here now.  NVIDIA and Intel are blue chips that have been around for ages.  Its not like they are a new hyped IPO with a lot of risk.  Considering everything that has happened the last few years between China and more recently COVID if there was a bubble to be had it would have already shown itself.  Especially, under the weight of a global shutdown.",
        "created_utc": 1594226988,
        "id": "fxbuys8",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxbuys8/",
        "score": 5,
        "subreddit": "investing",
        "created": 1594255788.0
    },
    {
        "author": "gratitudeisbs",
        "body": "Swap INTC for AMD",
        "created_utc": 1593648212,
        "id": "fwn52jg",
        "permalink": "/r/wallstreetbets/comments/hjmaiy/soon_to_be_18_year_old_looking_for_advice/fwn52jg/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593677012.0
    },
    {
        "author": "SchpartyOn",
        "body": "If you actually had insider information and were trading on it, you'd be committing a felony. Additionally, if others were trading on that information, you'd be committing a felony.\n\nWhile you may coincidentally be right about the price, I think you're full of shit. No one with real intel would advertise it because they know how stupid that would be.",
        "created_utc": 1593709709,
        "id": "fwpsgy4",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwpsgy4/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1593738509.0
    },
    {
        "author": "IveGotNoOtherOptions",
        "body": "I remember one of my first big gambles was an intel earnings call which they did well on and the stock still tanked because it was run up so hard before hand. Hopefully you autists have learned something today, if not better quit options now or long $ROPE",
        "created_utc": 1594933928,
        "id": "fyalfrl",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fyalfrl/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594962728.0
    },
    {
        "author": "llamawithscarf",
        "body": "AMD could cure COVID-19 and destroy Intel and it would still fall when earnings are presented. I'm so tired of AMD but if I sell it will pass 60.",
        "created_utc": 1594749923,
        "id": "fy25mvd",
        "permalink": "/r/wallstreetbets/comments/hr3u54/dd_on_amd/fy25mvd/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594778723.0
    },
    {
        "author": "Burnmebabes",
        "body": "I haven't looked at their financials, but I know personally they are taking large market share away from Intel. They have very recently come up with products that perform better and cost less, and I think they're striking deals with console makers",
        "created_utc": 1595333185,
        "id": "fyralgy",
        "permalink": "/r/stocks/comments/hv022o/what_stocks_were_discussed_the_most_here_5_years/fyralgy/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1595361985.0
    },
    {
        "author": "austinblacknj",
        "body": "If this week pans out right for me I’m taking msft profits and rolling them into intel. 2 ER 1 week hellz yeah",
        "created_utc": 1595094368,
        "id": "fyhbfag",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyhbfag/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595123168.0
    },
    {
        "author": "souptrades",
        "body": "I would make your portfolio some split of individual stocks and ETFs. Personally if I had 60k ready to go I’d do something like 10k in ETFs and 50k in stocks. I know that’s maybe an unpopular pick but a lot of the ETFs will have crossover with each other and the stocks I’d buy \nYou really need to make the call yourself but again if it were ME I would go hard into the aforementioned ETFs. They all have room to run. (Maybe 10-20%) \nI’d put a gigantic sum into MSFT (like 15-20% of my portfolio) and then throw the rest into runners. \n\nReddit darlings are: SPOT, PYPL, ADBE, SE, NET, FSLY, LVGO, DDOG, BABA, MU, AMD, CRWD, V, M, JPM, INTC, NVDA, SPLK (splunk idr the exact callsign), AVGO, MELI, CRM, TTD, DOCU, SHOP, etc. all pretty pricy shares but I believe in all of those companies. AMZN is a near must buy but it’s something like $3000 now lol. \n\nSome smaller cap stocks I’m bullish on are DKNG, AVCT, APPS, KLR, maybe get yourself an EV they’re all the rage now idk \n\nAlso look into a REIT possibly. \n\nThat’s if you want to be active investing \nIf you want to be passive just go 60/40 ETF/Stock and throw it all into an array of ETFs and then MSFT or whatever",
        "created_utc": 1594499688,
        "id": "fxqtfkh",
        "permalink": "/r/stocks/comments/hpft03/advice_for_high_risk_etf_portfolio/fxqtfkh/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1594528488.0
    },
    {
        "author": "gooeyShroom",
        "body": "Intel is still on like 14nm++++++++, just released a new \"crazy Chipset that doesn't even support PCIE 4.0, which AMD has going for it right now. If Intel wants to blow AMD put of the water when they drop Zen 3, they not only have to release a new Chipset, which will require a new socket for their CPUs, but also new CPUs themselves which will have to be 7nm and lower power consumption to even think about competing with Zen 3, and on top of that end users will have to buy a completely new motherboard along with the CPU... In the middle of a pandemic induced recession.\n\nAMD is gonna stick it to Intel bad this year.",
        "created_utc": 1594862090,
        "id": "fy7gjlr",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy7gjlr/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594890890.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "What you say is certainly true.  MSFT and AMZN and others appear to be diversified in interesting ways, mostly services and cloud projections.  The obvious bubbles are in ZM, Shop, TSLA and others that really are one trick ponies.  But think about the problems in 2000.  We had just had the internet millenial clock challenge so everybody and been spending a lot on hardware.  And the market simply projected that growth forward for years.   It didn't happen.  Are we making the same mistake now with services and the Cloud?  There has to be a point where, like hardware, the services are mature and the crazy growth comes back to single digits.  When/if that happens these crazy multiples will come way down.   I certainly could be wrong but if that happens in cloud and services we are going to see a real problem in AMZN, AAPL, GOOG and MSFT just as happened with INTC, CSCO, JNPR and AMAT in 2000.",
        "created_utc": 1595196630,
        "id": "fylm4eb",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fylm4eb/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1595225430.0
    },
    {
        "author": "StreicherADS",
        "body": "The 3 main buyers for Intel stock are Intel, robots, and boomers.",
        "created_utc": 1594085296,
        "id": "fx5t1r7",
        "permalink": "/r/wallstreetbets/comments/hmfeen/what_are_your_moves_tomorrow_july_07_2020/fx5t1r7/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594114096.0
    },
    {
        "author": "BlueFalcon2009",
        "body": "I got outta AMD a smidge too early call wise, and got into a put on them a smidge too early. They are pretty damn close to surpassing intel share price wise. Crazy. Go AMD even though I am betting against you!",
        "created_utc": 1594322120,
        "id": "fxgbgom",
        "permalink": "/r/wallstreetbets/comments/ho0krw/daily_discussion_thread_for_july_09_2020/fxgbgom/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594350920.0
    },
    {
        "author": "lonewolf420",
        "body": "Nvidia is far from a newcomer status, they are the leader in GPUs.\n\nETF is a smart play, but that doesn't take away that Nvidia is going to be leading the industry in GPU and AI computational core tech for the next few years while AMD plays catch up. Intel will just IMO flop and flounder in the GPU space while still maintaining profits as the whole industry rises but the biggest winner in the AI race will be Nvidia.\n\nIn CPUs, AMD is wiping the floor with Intel in price per performance and it seams like Intel is having a lot of difficulty with their 7nm chip process still. Resting on their laurels with core clock speeds only goes so far before developers start developing software that utilizes more than 1-2 cores (mostly gaming developers).",
        "created_utc": 1594233990,
        "id": "fxca31h",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxca31h/",
        "score": 4,
        "subreddit": "investing",
        "created": 1594262790.0
    },
    {
        "author": "The_Alternate_1",
        "body": "Oh are you in for a bad time.... INTC is gonna pull a GE over the next 3-5 years.",
        "created_utc": 1595261862,
        "id": "fyo69f0",
        "permalink": "/r/wallstreetbets/comments/hu74gf/what_are_your_moves_tomorrow_july_20_2020/fyo69f0/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595290662.0
    },
    {
        "author": "oriolesa",
        "body": "Picked up 2250 shares of intel at $59 and made a quick 1k today. Going to hold this for a while I think, probably sell some covered calls right before earnings too",
        "created_utc": 1594415690,
        "id": "fxkl64f",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxkl64f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594444490.0
    },
    {
        "author": "wilhelm96",
        "body": "Old news, AAPL using their own APUs instead of INTC CPUs. Now rumored they’re also developing their own GPU to replace AMD",
        "created_utc": 1594441668,
        "id": "fxlt11c",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxlt11c/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594470468.0
    },
    {
        "author": "auxiliary7",
        "body": "&gt;only gaming really uses 1-2 cores ,not most programs, its 2020 software  developers know how to utilize multiple cores, and for gaming GPUs are  where its at anyways. Workstations don't care about clock speed, they  want multi core throughput. \n\nWhat is your technical knowledge? I doubt any average software uses more than 6 cores. Not only that, but multi-cores becomes very ineffecient the more cores you have.\n\nAlso games don't use 1 or 2 cores, games really do use all the cores usually, just at a certain point it doesn't make a difference anymore because of a lot of technical difficulties. And most of modern games barely use the CPU for anything, so the FPS differences between 9600K and 3700X will be almost none except for very CPU-intensive games. \n\nYou should watch this : [https://www.youtube.com/watch?v=Q5-3MMoA\\_A0](https://www.youtube.com/watch?v=Q5-3MMoA_A0)\n\n&gt;again I have both AMD and Intel comps, the AMD wins hands down with  price per performance on everything but gaming higher clock speed and I  could still overclock if I absolutely needed more but most games do not  care about CPUs its GPU bottle-necked. \n\nHow did you test that? Sounds like some bullshit you made up with no objective data. As I said before, most programs don't use multiple cores effeciently as they simply can't.\n\nThe only thing a 3700X, which is much more expensive than the 9600k, would beat the 9600K in, would be either specific software utilizing multiple cores to compute independent lines of code or a lot of active programs being ran at once. \n\n&gt;only in single core speed, in multi core processes the 3700X has 2 more  cores and twice the threads it would dominate the i5 9600K. A better  comparison in the cheaper benchmarks is a 3600X anyways as it has the  same 6 cores but more threads at roughly the same clock speed and  similar price as a i5 9600K. Making it a better choice than the i5 9600K  in everything but gaming and in gaming both CPUs would perform just  fine. \n\nSame answer as above. \n\nAnd no, a 9600K should be compared to a 3700X, the 3600X is no match at all. The 9600K outperforms the 3600X even on the 8-core test, lmao. Showing how threads aren't that useful. \n\n**Here are the specific and objective numbers that are relevant :**\n\n3700X is \\~42% more expensive than the 9600K, 170 euros vs 240 euros.\n\nThese are the performance scores, 9600K on the left and 3700X on the right. Non-OC :\n\nMemory speed : 93,3 vs 79\n\nSingle-core : 136 vs 136\n\nTwo-core : 271 vs 269\n\nFour-core : 532 vs 516\n\nEight-core : 761 vs 928\n\nSixty-four core : 905 vs 1499\n\nOC :\n\nMemory speed : 97,4 vs 89,2\n\nSingle-core : 155 vs 141\n\nTwo-core : 308 vs 281\n\nFour-core : 616 vs 548\n\nEight-core : 899 vs 1025\n\nSixty-four core : 768 vs 1418\n\nSource : [https://cpu.userbenchmark.com/Compare/Intel-Core-i5-9600K-vs-AMD-Ryzen-7-3700X/4031vs4043](https://cpu.userbenchmark.com/Compare/Intel-Core-i5-9600K-vs-AMD-Ryzen-7-3700X/4031vs4043)\n\nAs you can see, objectively, there's no reason to ever buy the much more expensive 3700X over the 9600K unless you specifically require a very high core count.  Also note that in benchmarks the conditions for multi-core are ideal with minimum memory usage and no overlapping calculations. In real world software, there will always be a lot of memory storage and reading between CPU's, which will make the multi-cores less effective. \n\nIn games that like multi-core CPU's like CS:GO the 9600K still outperforms the 3700X by 20% in fps, this mostly likely caused by the memory latency of the 3700X. \n\nI'm not saying Intel is much better, I'm saying Intel's performance is king, while AMD's price per performance is king.\n\nI believe the Ryzen 5 3600 is the most valuable processor right now. As you can see, many AMD's on the list :\n\n[https://www.cpubenchmark.net/cpu\\_value\\_available.html](https://www.cpubenchmark.net/cpu_value_available.html)",
        "created_utc": 1594241300,
        "id": "fxcph6u",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxcph6u/",
        "score": 4,
        "subreddit": "investing",
        "created": 1594270100.0
    },
    {
        "author": "kristopolous",
        "body": "They never came back. People were predicting them to collapse and disintegrate like Data General, Honeywell, CDC, or Wang. The surprising thing was when they held the ship. But they were never the 1970s IBM, that's not coming back.\n\nYou can compare the two perspectives. Look at the 1981 text by Sobel, IBM, a Colossus in Transition and compare it to the fumblings with the pen computing craze as documented in Jerry Kaplan's Startup from 1994.\n\nThey sold off their Aptiva and Lenovo lines and the 90s had a bunch of failed products like the IBM Simon.  They never got their stuff together, but somehow never lost the farm. Their latest debacle, the Power Series CPU, which is actually 35 years old, on a price/performance ratio, is behind AMD, Arm, and Intel. It sits around Oracle's Sparc.\n\nThey have a few super-computer contracts with it but I've only met 1 serious person about a Power series workstation, at a linux conference, probably about 6 years ago ... that's it ... other offerings like Z/OS, MVS, and AIX ... these are like seeing endangered species. Super rare.",
        "created_utc": 1595286433,
        "id": "fypkcfr",
        "permalink": "/r/SecurityAnalysis/comments/huam4v/bigcap_tech_stocks_are_a_sucker_bet_jeremy_siegel/fypkcfr/",
        "score": 4,
        "subreddit": "SecurityAnalysis",
        "created": 1595315233.0
    },
    {
        "author": "StreicherADS",
        "body": "Lmao I've been a bear barely keeping my head above water for months now, just to be holding a single INTC 60p for the second leg down.\n\nThat's what I get for betting against America 🙃",
        "created_utc": 1594085962,
        "id": "fx5u6gr",
        "permalink": "/r/wallstreetbets/comments/hmfeen/what_are_your_moves_tomorrow_july_07_2020/fx5u6gr/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594114762.0
    },
    {
        "author": "BlakeRidley",
        "body": "Lulu, Intel, Google, MasterCard, Apple",
        "created_utc": 1594075748,
        "id": "fx5c97s",
        "permalink": "/r/wallstreetbets/comments/hmfeen/what_are_your_moves_tomorrow_july_07_2020/fx5c97s/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594104548.0
    },
    {
        "author": "Eastbei",
        "body": "Well apple was on the verge of bankruptcy once. They had lost the PC war and were under 10% market share. The only thing that saved them was the iPod and some help from Microsoft and Intel.  They are going to lose the smartphone wars too. Android is over 80% of global market, it's open, it's cheaper, and will eventually beat out apple. It will take a very very long time. And apple  has plenty of other niches, but they no longer have Jobs, or a viable halo product to keep there massive growth for a couple decades. I'm not saying they are a bad buy, but you asked for reasons why not. They are no longer a growth company. They are just maximizing existing product life and patents and software etc. But they don't have the opportunity for massive growth like other smaller companies. They have failed before, they still can't get TV done correctly, they are under 20% market share in their walled garden, and they charge premium prices, what could go wrong?",
        "created_utc": 1594509551,
        "id": "fxrruy2",
        "permalink": "/r/stocks/comments/hpgat1/trying_to_convince_your_younger_self_to_buy_apple/fxrruy2/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1594538351.0
    },
    {
        "author": "QueasyStrawberry",
        "body": "MU: Green\n\nNVDA: Green\n\nINTC: Green\n\nAMD: Red\n\nGuess which one i have calls in?",
        "created_utc": 1594394462,
        "id": "fxje3ps",
        "permalink": "/r/wallstreetbets/comments/homfbk/daily_discussion_thread_for_july_10_2020/fxje3ps/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594423262.0
    },
    {
        "author": "ceskanda",
        "body": "True. My dad was telling me he remember when it was a single digit stock that was getting crushed by intel lol. Sue Bae has done a pretty good job.",
        "created_utc": 1594418774,
        "id": "fxkr233",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxkr233/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594447574.0
    },
    {
        "author": "oriolesa",
        "body": "Sitting on 2300 shares for Intel. Sell 23 contracts of 7/24 $65 calls? I could see them having a big beat though, so idk",
        "created_utc": 1594951705,
        "id": "fybhcgq",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fybhcgq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594980505.0
    },
    {
        "author": "AxeLond",
        "body": "They have a lot of shit all about to drop soon, consoles, Big navi, Zen 3. \n\nIf initial console sales are strong then AMD will rally. \n\nGraphics is kinda meh, mostly just for enthusiast gamers, Nvidia makes way better shit overall. \n\nZen 3 could be strong, Intel is about self conflagrate from all the overclocking their doing on 14+++ nm CPUs. Zen 3 moving to 7 nm to 7 nm EuV is a relatively big step that should bring 10% performance, they're talking another +15% in architecture so it could solidify AMD at the top. AMD keep saying Q3, I have no idea how they will pull that off, that's like now. \n\nZen 4 will be total market dominance in CPU (if not from Zen 3), Huawei got banned from TSMC and AMD joinked their reserved wafers on 5 nm. The smartphone guys usually launch on the new node in like March, AMD will probably need longer, but not that much longer. There's another 7-10% performance or 15% power reduction at 5 nm and I think Intel is targeting their first 10 nm desktop processors Q4 2021 on 10 nm++ (no joke, that's their name). \n\nAMD's advantage fighting TSMC's 5nm vs Intel's 14 nm++++ for most of 2021 will absolutely crush Intel.",
        "created_utc": 1593730866,
        "id": "fwqzpao",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqzpao/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1593759666.0
    },
    {
        "author": "OblivionXBA",
        "body": "Everyone and their mother should downgrade Intel. That company is done for, can’t even get down to 10nm nodes effectively 😂",
        "created_utc": 1594064148,
        "id": "fx4ox42",
        "permalink": "/r/wallstreetbets/comments/hm51pm/daily_discussion_thread_for_july_06_2020/fx4ox42/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594092948.0
    },
    {
        "author": "soAsian",
        "body": "AMD 7nm 4000 cpu or Intel 14nm+++++++++ 10th gen cpu?\n\nif Intel, yes u are a loser. if AMD, congrat. Su Bae, best Bae in the world!",
        "created_utc": 1594069357,
        "id": "fx4zky9",
        "permalink": "/r/wallstreetbets/comments/hmfeen/what_are_your_moves_tomorrow_july_07_2020/fx4zky9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594098157.0
    },
    {
        "author": "CptTonyStark",
        "body": "NVDA worth more than intel 🚀🚀🚀🚀🚀🚀",
        "created_utc": 1594126417,
        "id": "fx787z6",
        "permalink": "/r/wallstreetbets/comments/hmrv6e/daily_discussion_thread_for_july_07_2020/fx787z6/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594155217.0
    },
    {
        "author": "partially__derived",
        "body": "Literally every single motherboard that’s compatible with Ryzen 3000 &amp; next gen processors are sold out or extremely marked up. I seriously can’t build my PC cuz of it. All the Intel boards are fully stocked tho. AMD about to obliterate earnings",
        "created_utc": 1594126672,
        "id": "fx78lrg",
        "permalink": "/r/wallstreetbets/comments/hmrv6e/daily_discussion_thread_for_july_07_2020/fx78lrg/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594155472.0
    },
    {
        "author": "justincaseyoucare",
        "body": "At some point I'm doing 75% portfolio on AMD Jan/22 calls.  I just realized the tech in the graphic cards in both the Xbox and PlayStation are on par of a 2080 and a 1/3 of the price.  They have chips for both consoles and beat Intel in every category for PC.   \nThis is only going to get bigger",
        "created_utc": 1594684219,
        "id": "fxzg17r",
        "permalink": "/r/wallstreetbets/comments/hqmoth/what_are_your_moves_tomorrow_july_14_2020/fxzg17r/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594713019.0
    },
    {
        "author": "cuteasy0",
        "body": "It's more useful to calculate P/E after including R&amp;D spending as part of earnings. AMD currently spends 22% of its earnings on R&amp;D. If we take this into account and adjust Nvidia/AMD based on R&amp;D spending, Nvidia trades at a premium compared to AMD\n\nWithin the larger context of what's happening right now, this shouldn't be the case.\n\nMost notably: \"AMD is already playing big, having won the contracts with both Sony (SNE) and Microsoft (MSFT) to produce CPUs and GPUs (branded as APUs, as AMD is combining both the CPU and GPU on a single integrated circuit) for PlayStation 5 and the Xbox Series X\"\n\nAlso new laptops using AMD mobile processors are just destroying Intel in both performance and power consumption",
        "created_utc": 1594802038,
        "id": "fy4jjwm",
        "permalink": "/r/wallstreetbets/comments/hr8uhb/what_are_your_moves_tomorrow_july_15_2020/fy4jjwm/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594830838.0
    },
    {
        "author": "lloydgross24",
        "body": "20-25% revenue growth rate YOY, great tech. Lisa Su. \n\nIntel has dropped the boat on their tech side leaving the door wide open for AMD to take major chunks out of their business. \n\nIt's overvalued at the moment but with the expected growth it's got crazy upside potential.",
        "created_utc": 1594611421,
        "id": "fxw9b3o",
        "permalink": "/r/wallstreetbets/comments/hq11ao/what_are_your_moves_tomorrow_july_13_2020/fxw9b3o/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594640221.0
    },
    {
        "author": "butler1233",
        "body": "&gt; If you want stability go nvidia\n\nI don't understand this meme. Sure, AMD (well, ATI) may have historically had drivers which weren't suoer stable, but they're not any worse (nor have they been for about the last *decade* than anything else.\n\nI can't comment on the historical part with nvidia since ive only been using their cards for about 2 years, but in that time those have been undeniably worse than any AMD drivers or even Intel graphics drivers I've used in the last few years. That said, thats not difficult because I've had very few issues with those two.\n\nFull disclosure, I have multiple AMD positions which I've been holding since Jan last year when it was floating around the $20 mark.",
        "created_utc": 1594493257,
        "id": "fxq2s5l",
        "permalink": "/r/wallstreetbets/comments/hpap8s/saw_so_many_gain_posts_on_friday_710/fxq2s5l/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594522057.0
    },
    {
        "author": "PoopDemonExorcist",
        "body": "AMD gonna eat up intel marketcap",
        "created_utc": 1594567999,
        "id": "fxu4deb",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxu4deb/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594596799.0
    },
    {
        "author": "foobargoop",
        "body": "Apple account was hacked on twitter, too. \n\nhttps://www.macrumors.com/2020/07/15/apple-twitter-account-hacked/\n\nOther hacked accounts: (*reportedly)\n\n* Microsoft\n* Cisco\n* Juniper\n* Oracle\n* Zoom\n* Citrix\n* CAP\n* F5\n* Intel\n* Adobe\n* Jenkins\n* NVIDIA\n* Apache\n* Chrome\n* Android\n* VMware\n* Siemens\n* Rust Lang Crates\n* Go Programming",
        "created_utc": 1594847987,
        "id": "fy6qbkr",
        "permalink": "/r/wallstreetbets/comments/hruzcj/what_are_your_moves_tomorrow_july_16_2020/fy6qbkr/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594876787.0
    },
    {
        "author": "mixalite",
        "body": "This entirely my opinion, I still find value investments,$DISCA recently hit 19.60 with a very low P/E and a solid earning report. $BRK.B also is a bargain with impressive portfolio and a huge amount of cash flow. $INTC has been punished and will probably continue to lag behind but this is just short term pains and I’m sure some bullish AMD moron will downvote this.",
        "created_utc": 1594838781,
        "id": "fy671mj",
        "permalink": "/r/stocks/comments/hrt1db/kangaroo_market/fy671mj/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594867581.0
    },
    {
        "author": "spikiera",
        "body": "next week is big for semiconductor companies due to INTC reporting",
        "created_utc": 1595039401,
        "id": "fyfchcd",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyfchcd/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595068201.0
    },
    {
        "author": "oshbear",
        "body": "Imagine being Intel, releases new chip design on 14nm node. While AMD is currently on 7nm and transitioning to 5nm. \n\nOld guard getting fucked hard.",
        "created_utc": 1595098661,
        "id": "fyhjbvg",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyhjbvg/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595127461.0
    },
    {
        "author": "lmneozoo",
        "body": "This, but pass on NVDA. Gonna take 5 years at the current price and earnings growth rate to be 1/3rd as profitable as Intel. It's already valued more than Intel.",
        "created_utc": 1594273964,
        "id": "fxe9q13",
        "permalink": "/r/wallstreetbets/comments/hnx5oe/helping_mom_invest_300k/fxe9q13/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594302764.0
    },
    {
        "author": "_Floriduh_",
        "body": "Don't think anyone is arguing that Intel is going under. They're sitting on tens of billions in cash and will be just fine, but they have consistently failed to innovate and until I see evidence they can leverage their size effectively then I'm going with the growth stories.",
        "created_utc": 1594225269,
        "id": "fxbra52",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxbra52/",
        "score": 3,
        "subreddit": "investing",
        "created": 1594254069.0
    },
    {
        "author": "Kevenam",
        "body": "Their margins were so inflated that last year, Intel brought down the price of many of their CPUs *significantly* in hopes of driving people away from AMD. They were just selling them so high because they could. At least now with competition, the consumer is getting a better price.",
        "created_utc": 1594228722,
        "id": "fxbyorz",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxbyorz/",
        "score": 3,
        "subreddit": "investing",
        "created": 1594257522.0
    },
    {
        "author": "PassiveF1st",
        "body": "I don't understand why AMD stock has been so stagnant other than experts keeping it with Intel when as a company they are surpassing Intel every step of the way.",
        "created_utc": 1593721061,
        "id": "fwqgdak",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqgdak/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593749861.0
    },
    {
        "author": "Sozzcat94",
        "body": "Yeah, it got my friend that was a die hard INTEL fan, moment the AMD came out. Instantly switched and says it’s way better.",
        "created_utc": 1595357472,
        "id": "fysjvfz",
        "permalink": "/r/wallstreetbets/comments/hv9g86/amd_is_a_cumrag_of_a_stock/fysjvfz/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595386272.0
    },
    {
        "author": "JustinUti",
        "body": "Hast thou spoken thine daily prayer to the effigy of LIsa Su upon thine pedestal? I sacrificed a chicken and two old INTC pentium processors last night, cold blood and silicone sprayed upon her noble visage overlooking my boudoir. Thank you, Lady Su.",
        "created_utc": 1595269634,
        "id": "fyomaum",
        "permalink": "/r/wallstreetbets/comments/huod7n/daily_discussion_thread_for_july_20_2020/fyomaum/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595298434.0
    },
    {
        "author": "BiggieOfBethel",
        "body": "According to what Intel? They don’t look primed to make any big moves??",
        "created_utc": 1595263243,
        "id": "fyo936x",
        "permalink": "/r/RobinHoodPennyStocks/comments/hujh06/weekly_rrobinhoodpennystocks_discussion/fyo936x/",
        "score": 3,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1595292043.0
    },
    {
        "author": "Naregkap",
        "body": "&gt;NVDA is selling tech for cellphone, automotive, and industrial displays\n\nThey dropped out of cellphones a few years ago(still in tablets tho) and tsla are making their own chips.\n\n&gt;that don't depend on AMD or Intel architectures.\n\nThey never depened on AMD or Intel.\n\n&gt;With 5nm chip technology, single board computers are more energy efficient and OLED touchscreen displays are doing much more.\n\nGuess who else is making 5nm chips . (AMD)",
        "created_utc": 1594534063,
        "id": "fxszwez",
        "permalink": "/r/stocks/comments/hpp9gd/why_would_anyone_buy_nvda_over_amd_when_they_have/fxszwez/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594562863.0
    },
    {
        "author": "Blacksin01",
        "body": "They make apple’s ARM lineup currently. With Apple moving away from Intel, they will likely be utilizing TSMC 7nm or 5nm process to make their new chips.",
        "created_utc": 1593730343,
        "id": "fwqyr97",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqyr97/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593759143.0
    },
    {
        "author": "gratitudeisbs",
        "body": "Swap INTC for AMD",
        "created_utc": 1593648212,
        "id": "fwn52jg",
        "permalink": "/r/wallstreetbets/comments/hjmaiy/soon_to_be_18_year_old_looking_for_advice/fwn52jg/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593677012.0
    },
    {
        "author": "SchpartyOn",
        "body": "If you actually had insider information and were trading on it, you'd be committing a felony. Additionally, if others were trading on that information, you'd be committing a felony.\n\nWhile you may coincidentally be right about the price, I think you're full of shit. No one with real intel would advertise it because they know how stupid that would be.",
        "created_utc": 1593709709,
        "id": "fwpsgy4",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwpsgy4/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1593738509.0
    },
    {
        "author": "AxeLond",
        "body": "They have a lot of shit all about to drop soon, consoles, Big navi, Zen 3. \n\nIf initial console sales are strong then AMD will rally. \n\nGraphics is kinda meh, mostly just for enthusiast gamers, Nvidia makes way better shit overall. \n\nZen 3 could be strong, Intel is about self conflagrate from all the overclocking their doing on 14+++ nm CPUs. Zen 3 moving to 7 nm to 7 nm EuV is a relatively big step that should bring 10% performance, they're talking another +15% in architecture so it could solidify AMD at the top. AMD keep saying Q3, I have no idea how they will pull that off, that's like now. \n\nZen 4 will be total market dominance in CPU (if not from Zen 3), Huawei got banned from TSMC and AMD joinked their reserved wafers on 5 nm. The smartphone guys usually launch on the new node in like March, AMD will probably need longer, but not that much longer. There's another 7-10% performance or 15% power reduction at 5 nm and I think Intel is targeting their first 10 nm desktop processors Q4 2021 on 10 nm++ (no joke, that's their name). \n\nAMD's advantage fighting TSMC's 5nm vs Intel's 14 nm++++ for most of 2021 will absolutely crush Intel.",
        "created_utc": 1593730866,
        "id": "fwqzpao",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqzpao/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1593759666.0
    },
    {
        "author": "PassiveF1st",
        "body": "I don't understand why AMD stock has been so stagnant other than experts keeping it with Intel when as a company they are surpassing Intel every step of the way.",
        "created_utc": 1593721061,
        "id": "fwqgdak",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqgdak/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593749861.0
    },
    {
        "author": "FATTEST_CAT",
        "body": "Intel uses its own foundries, Apple doesn't.  So if Apple stops using Intel, it means other foundries like TSMC will see increased business making chips Apple would have previously sourced from Intel foundries.",
        "created_utc": 1593730230,
        "id": "fwqyjqx",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqyjqx/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593759030.0
    },
    {
        "author": "Glassiftrue",
        "body": "If AMD doesn't hit 53 by tomorrow I'm ripping out my GPU and CPU and replacing with Intel and Nvidia out of spite",
        "created_utc": 1593618721,
        "id": "fwlduj6",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlduj6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593647521.0
    },
    {
        "author": "1st_Amendment_EndRun",
        "body": "Looking at the three year graph, all I see is s slide from $10 down to 0.75.\n\nSome news hit the street on 6/19 that caused their stock to jump and get wildly volatile after hours (Intel trying to get out of their losing position?)  There was a similar event that happened back on 5/7.  Research those and report back.",
        "created_utc": 1593646865,
        "id": "fwn2mld",
        "permalink": "/r/stocks/comments/hjlel1/vuzi_ar_play/fwn2mld/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593675665.0
    },
    {
        "author": "Bhawks489",
        "body": "So your “actual intel” is you seeing other penny stocks dip in the afternoon. \n\nStop spreading misinformation.",
        "created_utc": 1593711042,
        "id": "fwpv9ys",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwpv9ys/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1593739842.0
    },
    {
        "author": "YouDoNotKnowMeSir",
        "body": "Ahhh I didn’t know that Apple was gonna use TSMC for their arm chips. I just knew intel made their own and that AMD uses TSMC as well.",
        "created_utc": 1593730388,
        "id": "fwqyu5u",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwqyu5u/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593759188.0
    },
    {
        "author": "FATTEST_CAT",
        "body": "Yeah I had considered buying TSMC but I just bought some right now.  I think the crazy thing too is they haven't gotten stuck on nodes and their yields on 7nm are strong already.  Supposedly 5nm is doing well too in preproduction.  I don't know who will be able to compete with them on high end at that point.\n\nAnd it's kind of a snowball effect where they will get more money to develop better nodes and then of course more orders since power efficiency will be the best.  Just so long as they don't get stuck like Intel.",
        "created_utc": 1593732224,
        "id": "fwr25mh",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwr25mh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593761024.0
    },
    {
        "author": "KingBadford",
        "body": "Fuck AMD I'm buying an Intel cpu.  Oh wait I can't because I'm fucking broke.",
        "created_utc": 1593611757,
        "id": "fwl0fxi",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0fxi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640557.0
    },
    {
        "author": "boomdynasty",
        "body": "how is INTC looking to everyone? is it a good long term hold?",
        "created_utc": 1593598661,
        "id": "fwkj39f",
        "permalink": "/r/stocks/comments/hj63kf/rstocks_daily_discussion_wednesday_jul_01_2020/fwkj39f/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627461.0
    },
    {
        "author": "somanychins",
        "body": "Why is INTC dumping?",
        "created_utc": 1593632695,
        "id": "fwm8e8e",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwm8e8e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593661495.0
    },
    {
        "author": "TT_Productions",
        "body": "I feel like everyone's been very optimistic heading into Independence Day thinking \"We're 'murica, there's no way the market doesn't kick ass through Independence Day!\" But as the covid numbers just continued to climb (and will continue to as they always do on Wednesdays, Thursdays, and Fridays, after catching up from the weekend delays) and broke 50,000, government officials realized they're going to have a massive shitstorm on their hands if they allow large gathering 4th of July firework celebrations and bars remaining opened etc, and started shutting stuff down. For some officials to say, \"we will not go back into lockdown or close businesses\" and then a couple days later close down businesses, they must be receiving enough intel/pressure to know they're going to lose far more tax revenue in the long run if they try and keep everything open through a huge holiday weekend and just shut everything down on Monday 7/6. I think we're heading down until another stimulus bill is passed.",
        "created_utc": 1593665773,
        "id": "fwnxl58",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwnxl58/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593694573.0
    },
    {
        "author": "RogueShroom",
        "body": "‘No one was ever upset buying intel’",
        "created_utc": 1593674858,
        "id": "fwo8ilw",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwo8ilw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593703658.0
    },
    {
        "author": "xWinnfield",
        "body": "First was INTC cancelling one of their projects, second was based on bad cashflow. That’s my understanding of the two drops",
        "created_utc": 1593699310,
        "id": "fwp5d3q",
        "permalink": "/r/stocks/comments/hjlel1/vuzi_ar_play/fwp5d3q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593728110.0
    },
    {
        "author": "GoatTrade",
        "body": "Large volume and O/I on INTC 65c for AUG 21 (\\~50K combined)",
        "created_utc": 1593699462,
        "id": "fwp5own",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwp5own/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593728262.0
    },
    {
        "author": "awxomexd",
        "body": "Now might be a good time to buy. They've just dropped Intel completely from their base model products.",
        "created_utc": 1593594850,
        "id": "fwkfdav",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkfdav/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593623650.0
    },
    {
        "author": "crackercider",
        "body": "Intel is currently run by retards with a $250B market cap, AMD's got a $61B market cap with a ton of innovation across all market pricing segments, stomping Intel in the dick. We'll see how they stack up to Nvidia's new GPU's later this year.",
        "created_utc": 1593725527,
        "id": "fwqphyi",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqphyi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593754327.0
    },
    {
        "author": "thatLifeVibe",
        "body": "I bought Intel today lol",
        "created_utc": 1593738778,
        "id": "fwrd6wm",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwrd6wm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593767578.0
    },
    {
        "author": "iCHAIT",
        "body": "Good time to buy Intel?",
        "created_utc": 1593688136,
        "id": "fwom9b7",
        "permalink": "/r/stocks/comments/hjt0ej/rstocks_daily_discussion_options_trading_thursday/fwom9b7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593716936.0
    },
    {
        "author": "elsinore11",
        "body": "Think the NASDAQ was 5k in 2000. Companies like intel and CSCO still aren’t as high as they were then.",
        "created_utc": 1593658414,
        "id": "fwnmj5z",
        "permalink": "/r/investing/comments/hi5sme/my_outlook_and_where_i_would_put_my_money_tell_me/fwnmj5z/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593687214.0
    },
    {
        "author": "WOWzival",
        "body": "Speaking of aMd how is their competition going with Intel ??",
        "created_utc": 1593704079,
        "id": "fwpg5ai",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpg5ai/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593732879.0
    },
    {
        "author": "Vcize",
        "body": "Great intel from a guy that doesn't even know what selling puts is, and also thinks nearly thrice bankrupt AAL is an example of a company we should be holding standards against.",
        "created_utc": 1593725954,
        "id": "fwqqcpb",
        "permalink": "/r/options/comments/hk0du9/nkla_looks_like_its_gonna_duummmmppppppppppppppppp/fwqqcpb/",
        "score": 1,
        "subreddit": "options",
        "created": 1593754754.0
    },
    {
        "author": "IamNaNIam",
        "body": "&gt;amd is more a hardware company than a software company, though\n\nUnfortunately. They are smoking Intel on hardware, but the future is AI",
        "created_utc": 1593734396,
        "id": "fwr5x2x",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwr5x2x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593763196.0
    },
    {
        "author": "sirvapedalot",
        "body": "Sounds like this article has the most up to date info. It doesn’t 100% convince me. It could be bad intel or it could be what Postmates’ bankers are saying so Uber or CCXX pays a bit more to get the deal done (very relevant after Uber lost the Grubhub deal)\n\nI guess I’d give it a 25% chance at best of it being CCXX but it shows he’s trying to land a big fish. Some people here don’t love Postmates anyway (they weren’t doing as well  before corona) so it could be a blessing in disguise. I think Postmates would do well on hype right now for sure but there are many other candidates if the bidding gets too high",
        "created_utc": 1593729558,
        "id": "fwqxbsr",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwqxbsr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593758358.0
    },
    {
        "author": "Captaincadet",
        "body": "You mean they dropped intel from ALL computers and taking their computers to in house ARM processors in the next 2 years.\n\nIt looks promising from the developer kit so maybe now’s the time to buy as they won’t have to pay intel which should make their computers more profitable going forward",
        "created_utc": 1593599027,
        "id": "fwkjgi4",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkjgi4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627827.0
    },
    {
        "author": "Captaincadet",
        "body": "They are going fully ARM\n\n\nhttps://www.theguardian.com/technology/2020/jun/22/apple-ditches-intel-for-arm-processors-in-big-sur-computers",
        "created_utc": 1593606057,
        "id": "fwkri7a",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkri7a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593634857.0
    },
    {
        "author": "p_giggles",
        "body": "A range of 1,500-15,000 is also a good way for a company to say \"we have no fuckin idea and want to hype up the stock\" \n\nYou don't see analysts covering Intel with a price range of $20-$200",
        "created_utc": 1593611047,
        "id": "fwkz7pe",
        "permalink": "/r/stocks/comments/hj5rzv/arkk_and_arkw_overpriced/fwkz7pe/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593639847.0
    },
    {
        "author": "DaPurpleMage",
        "body": "INTC down just as much",
        "created_utc": 1593611840,
        "id": "fwl0l4b",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0l4b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640640.0
    },
    {
        "author": "namrock23",
        "body": "I dunno, she's somebody's intel operative. I think she was probably the brains behind the operation too. More likely that she gets three months in a country club prison and then goes about her business, whatever that is these days",
        "created_utc": 1593729536,
        "id": "fwqxaad",
        "permalink": "/r/wallstreetbets/comments/hk6a4p/if_maxwell_isnt_murdered_before_testifying_which/fwqxaad/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593758336.0
    },
    {
        "author": "midasTch",
        "body": "QCOM — Apple,AMD,intel will buying chips from them.",
        "created_utc": 1593706381,
        "id": "fwpli2d",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwpli2d/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593735181.0
    },
    {
        "author": "Crackbot420-69",
        "body": "It's mostly a graveyard of things I never sold from the last run up, so survivorship bias.\n\nGot some leaps on MO, JPM,  INTC. Other calls on KO, MGM.\n\nIts a grab bag of shit.",
        "created_utc": 1593709808,
        "id": "fwpsofx",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpsofx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593738608.0
    },
    {
        "author": "DangerousLiberal",
        "body": "Check the share price of the two. Check Intel. Have you ever heard of dilution?",
        "created_utc": 1593623013,
        "id": "fwlmwrk",
        "permalink": "/r/wallstreetbets/comments/hj4tqj/the_tech_bubble_is_a_gay_bear_fantasy/fwlmwrk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593651813.0
    },
    {
        "author": "moltch",
        "body": "Are we getting jebaited, why is amd/micron/intel the only sector down??",
        "created_utc": 1593611913,
        "id": "fwl0ppa",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwl0ppa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593640713.0
    },
    {
        "author": "ayyopapi",
        "body": "Intel fans",
        "created_utc": 1593624266,
        "id": "fwlplia",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlplia/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593653066.0
    },
    {
        "author": "RogueJello",
        "body": "I mostly agree, except with the claim \"equally\" since Intel is the default on everything oem site I've checked.",
        "created_utc": 1593647438,
        "id": "fwn3o1b",
        "permalink": "/r/SecurityAnalysis/comments/hil7s1/how_a_handful_of_chip_companies_came_to_control/fwn3o1b/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1593676238.0
    },
    {
        "author": "sp3xl",
        "body": "It’s going to be 200B-ish market cap in case intel dies completely. That puts it at 3x growth potential from what we have now.",
        "created_utc": 1593604556,
        "id": "fwkpk13",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpk13/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633356.0
    },
    {
        "author": "madnutbutter",
        "body": "US needs curfew and mandatory masks. Too many white woke kids colonized the BLM like their great grandparents colonized Africa. They don't understand they are manipulated by foreign intel and corporate interests to do rioting, attack police, attack cars and spread the rona.\n\nMarket will stay volatile with many crashes and pumps. I think we can say finally that the mouse is fuk.",
        "created_utc": 1593602547,
        "id": "fwkn5wd",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkn5wd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593631347.0
    },
    {
        "author": "rankiba",
        "body": "Doubt intel will die",
        "created_utc": 1593604621,
        "id": "fwkpmxx",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpmxx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633421.0
    },
    {
        "author": "Ehralur",
        "body": "That's because Intel doesn't operate in 3 of the world's biggest industries while pushing completely new technology that will change all of these. A bear case of 1,500 in case they stay just a car company compared to 15,000 if they dominate automotive energy and autonomous driving industries makes perfect sense.\n\nSo no, it has nothing to do with them being clueless, but it's just that you can't predict whether disruptions this big will succeed.",
        "created_utc": 1593618474,
        "id": "fwldcci",
        "permalink": "/r/stocks/comments/hj5rzv/arkk_and_arkw_overpriced/fwldcci/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593647274.0
    },
    {
        "author": "altaro22",
        "body": "Checked the holdings for that etf, i dont see any of the big players frol the junteenth movement on there? A lot of big corporations like MCD, INTEL etc.",
        "created_utc": 1593629567,
        "id": "fwm1f28",
        "permalink": "/r/pennystocks/comments/hjerel/beware_of_july_7th_blackout_day/fwm1f28/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593658367.0
    },
    {
        "author": "Mausteidenmies",
        "body": "Nokia uses broadcom processors (that weird ReefShark thingy) for their base stations and Ericsson uses Intel surprisingly.\n\nI wouldn't touch Huawei with a stick.",
        "created_utc": 1593697859,
        "id": "fwp2auc",
        "permalink": "/r/stocks/comments/hjuzg8/semiconductors/fwp2auc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593726659.0
    },
    {
        "author": "modulusshift",
        "body": "No joke, if Intel can’t sort their damn process out fast, AMD and Apple are going to eat their lunch. I think people don’t realize how dominant the first few Apple Silicon Macs are gonna be. Be glued to that Apple Q1 earnings report for the first rumblings. \n\nMan I remember back when it was just assumed Intel was going to be the dominant chip fab forever.",
        "created_utc": 1593738366,
        "id": "fwrciw5",
        "permalink": "/r/wallstreetbets/comments/hk2l69/elon_musk_just_replied_to_our_boy_uwsbconsensus/fwrciw5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593767166.0
    },
    {
        "author": "IgnitedSpade",
        "body": "Intel is so shit they got dumped by apple and amd keeps pumping out the best workstation/server chips on the market. If the ceo of amd shitposted on twitter as much as elon does they'd be mooning rn.",
        "created_utc": 1593726594,
        "id": "fwqrmxo",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqrmxo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593755394.0
    },
    {
        "author": "ob-j",
        "body": "I hopped on the AMD train when people were shitting all over them still and they were trading $14 a share. Like, who the fuck else competes with Intel (in the eyes of the dumb public) other than AMD? Why wouldn’t you invest? SMH",
        "created_utc": 1593715894,
        "id": "fwq5ljb",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwq5ljb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593744694.0
    },
    {
        "author": "reaper527",
        "body": "&gt; Now might be a good time to buy. They've just dropped Intel completely from their base model products.\n\nthat seems like the opposite of a good time to buy. are you old enough to remember how obscure and irrelevant apple was in the computer market in the 90's/early 2000's prior to them switching from ppc to intel x86-64?\n\nthey were a niche product.",
        "created_utc": 1593618073,
        "id": "fwlcj65",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwlcj65/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593646873.0
    },
    {
        "author": "AngelaQQ",
        "body": "Why would you \"bet\" against the best foundry in the world?\n\nLike, they're objectively the best. No one else touches them from a tech perspective. Samsung is probably the second best in the world, and they're a good 3 years behind TSMC's current node.\n\nTSMC manufactures chips for companies like Apple, AMD and Tesla. This is how good their reputation is. They're the best.\n\nBet against shit companies. Not the Rolls Royces of the industrial world.\n\nIf you're gonna bet against a foundry, bet against UMC or something. If Intel were just a foundry, I'd bet against them, because their foundry side has been floundering for years now. But I would never bet against Intel's sales and marketing....",
        "created_utc": 1593617063,
        "id": "fwlaidm",
        "permalink": "/r/stocks/comments/hjaa6i/bear_case_against_taiwan_semi_for_the_long_term/fwlaidm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593645863.0
    },
    {
        "author": "urmyheartBeatStopR",
        "body": "There ain't no way TSM is going to be bought.\n\nBuying a fab company is a shit move.\n\nAMD spun off it's fab factory.\n\nIntel is getting fucked with its own fab factory.\n\n---\n\nThat's because buying a big companies you inherit a lot of bullshit. Debt and the responsibility to integrate it with your current company (technology stack, etc..).\n\nMost tech company do aqcui hire on smaller companies.",
        "created_utc": 1593620227,
        "id": "fwlgynu",
        "permalink": "/r/stocks/comments/hj8zv0/apples_next_5g_company/fwlgynu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593649027.0
    },
    {
        "author": "uhhhhhuhhhhh",
        "body": "&gt;Intel has (or had) a very strong moat in terms of agreements with the various large scale OEM manufacturers for PCs. This has started to decay a bit in recent years, but the last time AMD had the better CPUs in the processor space (a couple of decades ago) you still could not buy a PC with an AMD processor because of various contracts Intel had with the PC manufacturers.\n\nThis is no longer an accurate description of the market. AMD and Intel are both widely available in basically every single OEM's product lineups. I'm sure there's a few random OEMs out there that only use one chip manufacturer for accidental reasons - they got a good wholesale deal, or they have a limited lineup of models and it was easier to use a single chipset - but in general AMD is equally available from all the big OEMs.",
        "created_utc": 1593641160,
        "id": "fwmr7mh",
        "permalink": "/r/SecurityAnalysis/comments/hil7s1/how_a_handful_of_chip_companies_came_to_control/fwmr7mh/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1593669960.0
    },
    {
        "author": "PassiveF1st",
        "body": "Hard to say... Honestly I'd go to AMD.. They are going to take a large amount of marketshare from Intel and NVidia.",
        "created_utc": 1593711219,
        "id": "fwpvnre",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpvnre/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593740019.0
    },
    {
        "author": "Limewire-",
        "body": "AMD make excellent value products. Their CPUs are currently smashing Intel in terms of price to performance, and thir GPUs are significantly cheaper than Nvidias, alebeit with less performance.\n\nNvidia is the market leader in terms of GPUs, have just signed a deal with Mercedes and their next generation of GPU is said to be coming out later this year. With a significant performance increase, you'll be able to get a 2nd tier GPU from the new generation, which will outperform the 1st tier from the previous generation, giving them an even more sizable lead over AMD.\n\nSomeone mentioned in a post here that the future could be APUs - essentially you wouldn't need a GPU becuase the computer's CPU is so powerful it runs all the graphics requirements. And at the moment AMD and Intel do offer some APUs, but right now they are no match for having a dedicated GPU. We're probably 10 years or so away from APUs taking over, if they do.\n\nI personally hold a position in Nvidia.",
        "created_utc": 1593691102,
        "id": "fwopv9y",
        "permalink": "/r/stocks/comments/hjvaht/thoughts_on_amd/fwopv9y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593719902.0
    },
    {
        "author": "Rick_Perrys_Asshole",
        "body": "INTC was up, I sold out 60% of my position, now I am BE\n\nAapl I sold out 50% of my position, will hold on the rest\n\nAMZN killed me today ... \n\nMSFT I was up 50%, sold off, and kept the rest\n\nMost of these are oct expirations, so I'm not worried",
        "created_utc": 1593631737,
        "id": "fwm69kc",
        "permalink": "/r/wallstreetbets/comments/hc9zjn/im_out_autists_dont_fight_the_future_if_you_suck/fwm69kc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593660537.0
    },
    {
        "author": "Agent_Simmons",
        "body": "No, that's just common sense. The actual Intel was that millions of dollars in shares we're gonna be dumped at 3.3. and what do you fucking know, turns out it was true.",
        "created_utc": 1593711405,
        "id": "fwpw26q",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwpw26q/",
        "score": 0,
        "subreddit": "pennystocks",
        "created": 1593740205.0
    },
    {
        "author": "EndFCC230forReddit",
        "body": "So then what's the point of this megathread? To redirect people just to search for DD? 🤔 or is it just to post more rocketships to convince more passing fools to become bag holders?\n\nCome then, lay out the intel",
        "created_utc": 1593654479,
        "id": "fwng0re",
        "permalink": "/r/pennystocks/comments/hjnvmn/sfet_megathread_72/fwng0re/",
        "score": -2,
        "subreddit": "pennystocks",
        "created": 1593683279.0
    },
    {
        "author": "Agent_Simmons",
        "body": "I have actual Intel that it's gonna get fucking shit on at 3.3. also, look at the candlesticks. No bearish patterns yet. Look at the graph. Patterns consistent with previous daily climb patterns. The news isn't shit, CEO making an announcement Monday. \n\nThat being said, DO NOT HOLD TILL MONDAY. THATS HOW YOU LOSE",
        "created_utc": 1593709293,
        "id": "fwprlhv",
        "permalink": "/r/pennystocks/comments/hk0mvr/gnus_final_update/fwprlhv/",
        "score": -3,
        "subreddit": "pennystocks",
        "created": 1593738093.0
    },
    {
        "author": "boomdynasty",
        "body": "how is INTC looking to everyone? is it a good long term hold?",
        "created_utc": 1593598661,
        "id": "fwkj39f",
        "permalink": "/r/stocks/comments/hj63kf/rstocks_daily_discussion_wednesday_jul_01_2020/fwkj39f/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627461.0
    },
    {
        "author": "awxomexd",
        "body": "Now might be a good time to buy. They've just dropped Intel completely from their base model products.",
        "created_utc": 1593594850,
        "id": "fwkfdav",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkfdav/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593623650.0
    },
    {
        "author": "Captaincadet",
        "body": "You mean they dropped intel from ALL computers and taking their computers to in house ARM processors in the next 2 years.\n\nIt looks promising from the developer kit so maybe now’s the time to buy as they won’t have to pay intel which should make their computers more profitable going forward",
        "created_utc": 1593599027,
        "id": "fwkjgi4",
        "permalink": "/r/stocks/comments/hj6a83/why_is_it_that_some_people_avoid_aapl/fwkjgi4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593627827.0
    },
    {
        "author": "sp3xl",
        "body": "It’s going to be 200B-ish market cap in case intel dies completely. That puts it at 3x growth potential from what we have now.",
        "created_utc": 1593604556,
        "id": "fwkpk13",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkpk13/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593633356.0
    },
    {
        "author": "madnutbutter",
        "body": "US needs curfew and mandatory masks. Too many white woke kids colonized the BLM like their great grandparents colonized Africa. They don't understand they are manipulated by foreign intel and corporate interests to do rioting, attack police, attack cars and spread the rona.\n\nMarket will stay volatile with many crashes and pumps. I think we can say finally that the mouse is fuk.",
        "created_utc": 1593602547,
        "id": "fwkn5wd",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkn5wd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593631347.0
    }
]