[
    {
        "author": "zaktrades123",
        "body": "Cramer pumping my favorite company’s NVDA, AMD and QCOM\n\nMoment of silence for them",
        "created_utc": 1589409261,
        "id": "fqjfmtl",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqjfmtl/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589438061.0
    },
    {
        "author": "Incognito512",
        "body": "he only suggested $AMD. $NVDA and $QCOM; the retard strength stocks",
        "created_utc": 1589427035,
        "id": "fqkgw09",
        "permalink": "/r/wallstreetbets/comments/gjcaqq/jim_cramer_reveals_his_playbook_says_investors/fqkgw09/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589455835.0
    },
    {
        "author": "mufasala88",
        "body": "RIP AMD, NVDA, QCOM. Jim Cramer said more upside. F",
        "created_utc": 1589412604,
        "id": "fqjnt9n",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqjnt9n/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1589441404.0
    },
    {
        "author": "WSBankrupt",
        "body": "Current long positions: ABBV, BMY, C, CAR, DCP, H, INTC, MGM, PK, QCOM, RDSB, RTX, T, USCR\n\nOnly 50% of spare cash is in the above. Will DCA.\n\nLottos: OXY puts and DFEN\n\nMemes: TNP\n\nAlso sold CCL puts and TNP calls",
        "created_utc": 1588640043,
        "id": "fpifumk",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fpifumk/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588668843.0
    },
    {
        "author": "needadvicebadly",
        "body": "I think that's an internal detail though. They are not reselling their chips. They custom design them for better integration in their products, and they still source others from Samsung and AMD with no plans to build their own desktop GPUs that I'm aware of. Even a more exponential growth for datacenters or IoT devices won't have an impact on Apple's chip business compared to something like AMD, NVDA, INTC or QCOM.",
        "created_utc": 1588639597,
        "id": "fpif30g",
        "permalink": "/r/investing/comments/gdkx3v/nvdaamdmsftaapl_which_has_the_most_potential_for/fpif30g/",
        "score": 4,
        "subreddit": "investing",
        "created": 1588668397.0
    },
    {
        "author": "uninfinity",
        "body": "RIP\n\n   **Jim Cramer: Chart action shows more upside in Nvidia, AMD and Qualcomm**",
        "created_utc": 1589411812,
        "id": "fqjlw7b",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqjlw7b/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1589440612.0
    },
    {
        "author": "discovery999",
        "body": "Exactly, Blackberry, Nortel and don’t forget Bre-X. Canada is cursed when it comes to high flyers. The US just looks at the success; then copies it and makes it better. Aka. Apple, Qcom....",
        "created_utc": 1590089868,
        "id": "frdh99t",
        "permalink": "/r/stocks/comments/gnxfj2/shop_just_hit_800_ath/frdh99t/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1590118668.0
    },
    {
        "author": "opiablame",
        "body": "Let me get the names straight for everyone: \n\n*Tim Apple\n\n*Dave Boeing\n\n*Steven Qualcomm\n\n*Chuck Cisco\n\n*Marilyn Lockheed",
        "created_utc": 1589581904,
        "id": "fqrcx7b",
        "permalink": "/r/wallstreetbets/comments/gkb8h0/apple_is_going_down/fqrcx7b/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1589610704.0
    },
    {
        "author": "BringBckSheriffLobo",
        "body": "China will just follow thru with listing Qualcomm, Apple, Cisco as \"Unreliable Entities\".  We'd take a decent hit from that. Bad time to be whacking a hornets' nest.",
        "created_utc": 1590101887,
        "id": "fre4pb9",
        "permalink": "/r/wallstreetbets/comments/go46ep/what_are_your_moves_tomorrow_may_22_2020/fre4pb9/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1590130687.0
    },
    {
        "author": "needadvicebadly",
        "body": "I agree with all your points. In terms of business similarity (not at all investing prospect similarities) I think of tech companies as:\n\n- chip/components/data center hardware: NVDA, AMD, INTC, QCOM, TXN\n- fabrication: TSM (I don't follow anything else sorry)\n- PaaS: MSFT, AMZN, IBM/RedHat, GOOG (trying aggressively)\n- SaaS/Software: MSFT, GOOG, ORCL, IBM/RedHat, ADEB, FB, AMZN\n- Consumer Electronics: AAPL\n- Ads: GOOG, FB\n\nobviously there are many other companies that I don't follow, and the categorization isn't 100% clean either. AAPL's services (music, icloud, etc) are forms of SaaS. FB is technically ads, but they are also a complete marketing SaaS especially globally where many businesses rely 100% on FB for their entire online presence. Ads also depends on your reach. Both GOOG and MSFT have consumer electronics, but I don't use that to drive investment. I won't be surprised if GOOG or MSFT cancel a major line of their hardware any time.\n\nThere are many other consumer electronics companies but nothing as fully integrated as AAPL in that area, including MSFT and GOOG.\n\nRedHat is active in the datacenter space and probably why IBM acquired them. IBM is more of a global tech projects coordinator, and manages a lot of banks infrastructures, but are feeling the pressure from other PaaS providers. I don't have any investments in it though. \n\nTech companies always have their toes in many businesses because of the nature of software. I can't think of one with more toes than MSFT (maybe GOOG second), which could be unfocused waste depending on their management. It certainly feel like it was for MSFT for most of the 2000s.\n\nTo answer OP's question though, I think any of these companies are probably fine with equal chances, though you will introduce yourself to company specific short term volatility. Who knows when a random bad news for AAPL, MSFT, AMD, NVDA, etc might hit affecting the stock price in the short term. Balancing (depending on the amount) or using an etf like others mentioned is a good idea, though I don't think any of your picks will be bad in the long run either.",
        "created_utc": 1588637788,
        "id": "fpibzai",
        "permalink": "/r/investing/comments/gdkx3v/nvdaamdmsftaapl_which_has_the_most_potential_for/fpibzai/",
        "score": 3,
        "subreddit": "investing",
        "created": 1588666588.0
    },
    {
        "author": "terpythrowaway",
        "body": "Unusual options activity on qcom puts, might involve news thats going to come out regarding chinese sanctions",
        "created_utc": 1590675765,
        "id": "fs3asip",
        "permalink": "/r/wallstreetbets/comments/gs3jqo/daily_discussion_thread_for_may_28_2020/fs3asip/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1590704565.0
    },
    {
        "author": "rockybullwinkle43",
        "body": "Just want to say thanks to the random folks who said DIS and QCOM calls in the daily thread yesterday.",
        "created_utc": 1589516792,
        "id": "fqojnui",
        "permalink": "/r/wallstreetbets/comments/gjtxjd/what_are_your_moves_tomorrow_may_15_2020/fqojnui/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1589545592.0
    },
    {
        "author": "WSBankrupt",
        "body": "I would very much like a few solid red days so I can buy more FB, AAPL, NXPI and QCOM.  This whole China + social media shit is perfect for this but the printer may win out.\n\nCould even load up on a few calls again.  Someone make this happen.",
        "created_utc": 1590715607,
        "id": "fs5iz9m",
        "permalink": "/r/wallstreetbets/comments/gsdpeo/what_are_your_moves_tomorrow_may_29_2020/fs5iz9m/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1590744407.0
    },
    {
        "author": "HajaKensei",
        "body": "Then explain instead of being a pickle dick like your name suggests you are. As far as IT news are concerned, it is an apt comparison when AMD is definitely not going to stop here. It already broke Intel's monopoly over the desktop, mobile and server CPU market. They are also already in the midst of making phone gpu and will be directly taking on Qualcomm and ARM. As stock  market goes; nothing is for certain of course. But calling it retarded? It's like a peanut farmer saying potato farms won't be rich; stupid remark about a different product, different market and lack of knowledge. It's one of the few industries that are still going up despite the pandemic, that speaks a lot by itself.",
        "created_utc": 1589066601,
        "id": "fq3htlv",
        "permalink": "/r/stocks/comments/ggiafk/some_good_news_coming_amds_way/fq3htlv/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1589095401.0
    },
    {
        "author": "fawkesmulder",
        "body": "Anyone here like 5G stocks? Or is this chasing the dragon. Made a small Xilinx bet now, avoiding qualcomm though.",
        "created_utc": 1590689857,
        "id": "fs44igp",
        "permalink": "/r/wallstreetbets/comments/gs3jqo/daily_discussion_thread_for_may_28_2020/fs44igp/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1590718657.0
    },
    {
        "author": "globalcontagion",
        "body": "They put some US companies on an undesirable list: BA, AAPL, QCOM, and some others. Market shrugged it off...quite amazing.",
        "created_utc": 1589864575,
        "id": "fr3rvp8",
        "permalink": "/r/wallstreetbets/comments/gm9211/what_are_your_moves_tomorrow_may_19_2020/fr3rvp8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589893375.0
    },
    {
        "author": "Broshawn",
        "body": "TSLA is like Qualcomm in that they won’t see $800 share price again for at least 10 years",
        "created_utc": 1588793683,
        "id": "fpp07o2",
        "permalink": "/r/wallstreetbets/comments/gehav8/daily_discussion_thread_for_may_06_2020/fpp07o2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588822483.0
    },
    {
        "author": "FearlessGuster2001",
        "body": "What is going on with QCOM after hours? No news that I have seen",
        "created_utc": 1589403189,
        "id": "fqj00ag",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqj00ag/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589431989.0
    },
    {
        "author": "VeryTiredDad",
        "body": "Lol. A few favorites are MX, DKNG, QCOM, WYNN, and EADSY. Definitely a good amount of risk here but I’m good with that given the upside.",
        "created_utc": 1588886267,
        "id": "fpt7lb0",
        "permalink": "/r/stocks/comments/gf5s7b/underrated_stocks/fpt7lb0/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1588915067.0
    },
    {
        "author": "Redknife11",
        "body": "DAL, TMUS, QCOM, bought F at the bottom. Yes risky for Ford but I think they pull out of it",
        "created_utc": 1590461347,
        "id": "frtzn8w",
        "permalink": "/r/wallstreetbets/comments/gqi8ye/what_are_your_moves_tomorrow_may_26_2020/frtzn8w/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1590490147.0
    },
    {
        "author": "ghostbearinforest",
        "body": "Corning Qualcomm tsmc broadcom marvell",
        "created_utc": 1590647609,
        "id": "fs2au9n",
        "permalink": "/r/stocks/comments/gs0x43/tech_stocks/fs2au9n/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1590676409.0
    },
    {
        "author": "Phillyvegas24",
        "body": "I was looking at both Qualcomm and Nvidia but gotta do more research on them. Te be honest not at all familiar with Xilinx",
        "created_utc": 1590021730,
        "id": "fraly1e",
        "permalink": "/r/StockMarket/comments/gnld38/new_to_stocks_what_do_you_guys_think_about/fraly1e/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1590050530.0
    },
    {
        "author": "GreedySpeculator",
        "body": "BUY THE DIP IN SEMIS IT S ALL GRANDSTANDING\n\n  [https://www.wsj.com/articles/u-s-moves-to-cut-off-chip-supplies-to-huawei-11589545335](https://www.wsj.com/articles/u-s-moves-to-cut-off-chip-supplies-to-huawei-11589545335) \n\nThe senior administration official played down the impact of the rule on Huawei. ‘This is a licensing requirement,” the official said. “It doesn’t necessarily mean things are denied.”\n\nA year ago, Commerce Department officials put Huawei on an export blacklist of companies considered to be national-security threats. That move was designed to cut Huawei off from some U.S. semiconductor makers.\n\nOver the last year, however, Huawei’s suppliers have largely [managed to get around the blacklisting ](https://www.wsj.com/articles/huawei-manages-to-make-smartphones-without-american-chips-11575196201?mod=article_inline&amp;mod=article_inline)through a technicality. American companies—such as [Qualcomm](https://quotes.wsj.com/QCOM) Inc. and [Intel](https://quotes.wsj.com/INTC) Corp. —could still supply Huawei with some chips that are manufactured overseas. Huawei has also greatly ramped up the use of HiSilicon-designed chips, primarily built by TSMC, thereby reducing its reliance on the U.S. supply chain.\n\nHuawei is now capable of building both 5G base-stations and advanced smartphones free of American technology, The Wall Street Journal reported in December.",
        "created_utc": 1589560117,
        "id": "fqq69qh",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqq69qh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589588917.0
    },
    {
        "author": "The_Big_Short_2020",
        "body": "Getting ready to buy $QCOM calls. This shit just tanked 6 percent off a tweet? Da fuck?\n\nThey are huge in the 5G space, recently won the Apple contract and I can  see them near $95 by EOY.",
        "created_utc": 1589565439,
        "id": "fqqh5wf",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqqh5wf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589594239.0
    },
    {
        "author": "-2Black2Strong-",
        "body": "19 QCOM 6/26 80Cs\n\nChina aint gonna do NOTHIN",
        "created_utc": 1589572399,
        "id": "fqquwz9",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqquwz9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589601199.0
    },
    {
        "author": "ixamnis",
        "body": "Solid choices. VISA, McDonald's, Coke, Exxon, Dutch Shell and Delta are generally known for producing nice dividends. I think MSFT and AMD have great short term and long term growth potential. I think Disney isn't going anywhere in the short term, but it's a good long-term stock to hold. \n\nBecause of your age, as you move forward, I would consider more growth stocks in your portfolio. Some of my favorites right now include SQ, APPN, W, TTD, and TSLA. \n\nFor such a small portfolio, you have 20% of your stocks in Energy/Oil companies. Not necessarily a bad thing, and you've picked two of the best in that sector. It has been a volatile sector lately, so I would be cautious. In that sector, the only additional holding that I have currently is ET (Energy Transfer) and it has been doing quite well. The upside is both for growth and dividends.  Also, Tesla might be considered an energy stock, a tech stock and a car company stock.\n\nI'd say you have a solid start as a long term investor. Continue to expand on this and you should do well. \n\nGold:  GLD or IAU\n\n5G Technology:  QCOM, AAPL (which you already have), VZ, TMUS",
        "created_utc": 1589218639,
        "id": "fqagff2",
        "permalink": "/r/stocks/comments/ghr5of/my_stocks_at_18_thoughts/fqagff2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1589247439.0
    },
    {
        "author": "buttersquashcorgi",
        "body": "BRKB. \n\n\nIf there’s a truly big dip, then Buffett will deploy it faster and more efficiently than I ever could for a large number of sector. I just can’t force myself into to read up DD on insurance companies or some low level manufacturing company. \n\n\nFor tech, I still like MS, QCOM, ERIC, NOK, INTC, AMD. Stuff that are the backbone of the internet. My other big play is TGT - they’ve been doing pretty well with e-commerce and IMHO can be competitive with Amazon in household goods. They have physical locations and are just a pleasant shopping experience in general. Amazon is filled with trash these days.",
        "created_utc": 1589083393,
        "id": "fq4sw5j",
        "permalink": "/r/investing/comments/ggu9be/if_and_i_repeat_if_there_is_another_huge_dip_what/fq4sw5j/",
        "score": 2,
        "subreddit": "investing",
        "created": 1589112193.0
    },
    {
        "author": "Spit_in_the_Pit",
        "body": "Any reason you're avoiding the obvious picks? Nokia, Eric, Qualcomm?",
        "created_utc": 1589474110,
        "id": "fqma82f",
        "permalink": "/r/wallstreetbets/comments/gjpqt0/5g_portfolio/fqma82f/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589502910.0
    },
    {
        "author": "abouzee",
        "body": "HD and QCOM selling put going into ex dividend.",
        "created_utc": 1590436221,
        "id": "frsrjwb",
        "permalink": "/r/wallstreetbets/comments/gqhpi8/weekly_theta_gang_thread/frsrjwb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1590465021.0
    },
    {
        "author": "jschreiber77",
        "body": "Hmm...MX:  No idea about this company.  DKNG being so new and all the hype right now on it, \"when those are greedy...\" -- I'll pass.  QCOM is a buy.  WYNN is a buy.  EADSY = no interest.\n\nMy watchlist is over 50 via a variety of sectors, so I won't mention every one.  I will, however, mention eight.  Here goes:\n\nNTR, ELY, TCEHY, AVVI, MU, FANG, O, CRWD\n\nBecause I own shares of 25 different stocks, 45% of ETFs and generally risk 10% on riskier stocks, I'm now going to focus my energies on buying high-dividend quality stocks and build a new portfolio with Fidelity.",
        "created_utc": 1588901598,
        "id": "fptzqj2",
        "permalink": "/r/stocks/comments/gf5s7b/underrated_stocks/fptzqj2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1588930398.0
    },
    {
        "author": "zandarkyn21",
        "body": "I’ll have to take a peak at that! What’s the future outlook here. I had jumped in on this and a few other things just assuming 5G would be big in a couple years. I got out out a couple a few weeks back and moved into other stocks but kept NOK because I had a small position and it wasn’t expensive to buy it. I also had MU and QCOM but at the time those cost more for the number of shares I had than I wanted to commit. I saw that NOK and ERIC were the two non Chinese companies to go with and picked NOK. Just wondering if this will ever be / has potential to be a high value stock. I did see they have signed a couple of contracts already. I was confused about the hostile takeover threat and how they hired help to protect them from that.....",
        "created_utc": 1589938408,
        "id": "fr72ts7",
        "permalink": "/r/stocks/comments/gn1s2k/nok_hold_or_move_funds_elsewhere/fr72ts7/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1589967208.0
    },
    {
        "author": "smallchimpu",
        "body": "So calls on Qualcomm?",
        "created_utc": 1590591963,
        "id": "frzgty7",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/frzgty7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1590620763.0
    },
    {
        "author": "RPMayhem",
        "body": "APPL, AMD, ATVI,  DFEN, F, FB, GOOGL, MSFT, ORCL, QCOM, SBUX, SNAP, SPOT, VIAC, TQQQ, TWTR, and UBER \n\nThere, now I've cursed my portfolio and all those holding these \n\nyou're welcome c:",
        "created_utc": 1590611687,
        "id": "fs0lmv2",
        "permalink": "/r/wallstreetbets/comments/grr84s/what_are_your_moves_tomorrow_may_28_2020/fs0lmv2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1590640487.0
    },
    {
        "author": "terpythrowaway",
        "body": "Qcom puts, you heard it here first",
        "created_utc": 1590677982,
        "id": "fs3f668",
        "permalink": "/r/wallstreetbets/comments/gs3jqo/daily_discussion_thread_for_may_28_2020/fs3f668/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1590706782.0
    },
    {
        "author": "KSD123",
        "body": "QCOM to anyone that trying to make money it has to gap up next week on the 30 min. RSI showing a potential reversal. And overall chipmakers are in demand",
        "created_utc": 1589565063,
        "id": "fqqge6r",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqqge6r/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589593863.0
    },
    {
        "author": "TheCandyMan25",
        "body": "I'm weary of any company that is so reliant on Apple. Apple's making all of their CPUs now, who's to say they won't start making other hardware? Obviously that's not a concern for QCOM until 2023 but just something to consider when these contracts are set to expire.",
        "created_utc": 1588704338,
        "id": "fpl0qer",
        "permalink": "/r/investing/comments/ge389v/best_5g_stocks_to_buy_right_now/fpl0qer/",
        "score": 2,
        "subreddit": "investing",
        "created": 1588733138.0
    },
    {
        "author": "sushishart",
        "body": "I’m with you there. Western world will not be using Huawei. Value investors will eventually rotate into QCOM for the yield.\n\nI think they are headed to $90/sh.",
        "created_utc": 1589589989,
        "id": "fqrqwbt",
        "permalink": "/r/wallstreetbets/comments/gkb8h0/apple_is_going_down/fqrqwbt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589618789.0
    },
    {
        "author": "-2Black2Strong-",
        "body": "Naw, biggest mover gonna be QCOM... BOOK IT OR BAN!!!!\n\nI'ma have to do a DD post (with bear, bull, and short term plays), yall niggas sleeping",
        "created_utc": 1589665734,
        "id": "fquwsr7",
        "permalink": "/r/wallstreetbets/comments/gkggr4/weekend_discussion_thread_for_the_weekend_of_may/fquwsr7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589694534.0
    },
    {
        "author": "nilsl2708",
        "body": "Qualcomm 80$ 17/06 calls?",
        "created_utc": 1589910060,
        "id": "fr5kikw",
        "permalink": "/r/wallstreetbets/comments/gmlsuw/daily_discussion_thread_for_may_19_2020/fr5kikw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589938860.0
    },
    {
        "author": "Shorter_McGavin",
        "body": "Think I’m going to short the shit out of QCOM if we delist their companies",
        "created_utc": 1589992326,
        "id": "fr96680",
        "permalink": "/r/wallstreetbets/comments/gn8r9k/daily_discussion_thread_for_may_20_2020/fr96680/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590021126.0
    },
    {
        "author": "dazacr7",
        "body": "But do you see how AMD graph follows a different pattern?if you look at it and kinda resembles rtx or Qualcomm another tech stock",
        "created_utc": 1589945945,
        "id": "fr7f6en",
        "permalink": "/r/RobinHood/comments/gmweel/does_anyone_know_why_different_companies_follow/fr7f6en/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1589974745.0
    },
    {
        "author": "heartstesler",
        "body": "Note the stocks that are going up crazy and have exposure to China , those will come down very badly e.g. Boeing Apple Tesla Qualcomm Cisco etc as and when China retaliate",
        "created_utc": 1590068293,
        "id": "frcaf00",
        "permalink": "/r/wallstreetbets/comments/gnu61u/daily_discussion_thread_for_may_21_2020/frcaf00/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590097093.0
    },
    {
        "author": "Bramptonboy",
        "body": "Within the next decade, how likely is it that the semiconductor industry takes off and why? I'm assuming it's because companies like qualcomm are making their way into the 5g industries correct?",
        "created_utc": 1590072703,
        "id": "frcif3w",
        "permalink": "/r/stocks/comments/gnkoo8/portfolio_thoughtsopinions/frcif3w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1590101503.0
    },
    {
        "author": "FatalCartilage",
        "body": "When qualcomm was suing apple in 2019, I looked into it and it was really obvious to me that apple was the one in violation.  Put a whole bunch into qualcomm and it doubled overnight, sold immediately.",
        "created_utc": 1590290135,
        "id": "frm2yn5",
        "permalink": "/r/stocks/comments/gp4yrz/what_is_your_1_your_bestworst_market_decision/frm2yn5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1590318935.0
    },
    {
        "author": "upvotemeok",
        "body": "Cloud is msft amzn goog and baba 5g is Qualcomm and skyworks but Trump's been dicking them with the trade war so beware",
        "created_utc": 1589777019,
        "id": "fqzwciq",
        "permalink": "/r/stocks/comments/gk51fo/rstocks_daily_discussion_fundamentals_friday_may/fqzwciq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589805819.0
    },
    {
        "author": "nilsl2708",
        "body": "Best calls to buy right now ? \nQualcomm 80$ ?",
        "created_utc": 1589792066,
        "id": "fr0dtc8",
        "permalink": "/r/wallstreetbets/comments/glmbkl/what_are_your_moves_tomorrow_may_18_2020/fr0dtc8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589820866.0
    },
    {
        "author": "nilsl2708",
        "body": "AMD 55$ calls 17/06? \nQualcomm 80$ calls 17/06?",
        "created_utc": 1589792915,
        "id": "fr0enku",
        "permalink": "/r/wallstreetbets/comments/glmbkl/what_are_your_moves_tomorrow_may_18_2020/fr0enku/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589821715.0
    },
    {
        "author": "-2Black2Strong-",
        "body": "it's only funny cause you were right. Let's not pretend the reversal was \"super obvious\" (I'm a bull - QCOM 80+ next week leggo)",
        "created_utc": 1589692485,
        "id": "fqw4ca5",
        "permalink": "/r/wallstreetbets/comments/gkggr4/weekend_discussion_thread_for_the_weekend_of_may/fqw4ca5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589721285.0
    },
    {
        "author": "-2Black2Strong-",
        "body": "Neither. QCOM",
        "created_utc": 1589696443,
        "id": "fqw93r2",
        "permalink": "/r/wallstreetbets/comments/gkggr4/weekend_discussion_thread_for_the_weekend_of_may/fqw93r2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589725243.0
    },
    {
        "author": "Throwawayin2020",
        "body": "Idk, Intel failed so hard against Qualcomm on the mobile chips, I can’t imagine them competing in the GPU space.",
        "created_utc": 1590441936,
        "id": "frt2dm1",
        "permalink": "/r/investing/comments/gq2l0h/regarding_nvda_as_well_as_other_chipmakers_is_it/frt2dm1/",
        "score": 1,
        "subreddit": "investing",
        "created": 1590470736.0
    },
    {
        "author": "Draiko",
        "body": "I'm in AMD as well. The only chip stock I'm getting out of is Intel. They have a pretty bad problem in the short term. I'll buy back into it later but I'm cashing out of it for now.\n\nI'm also eyeing Qualcomm but I don't see high mobile device sales in the near future so I'm going to circle it like a buzzard for now and swoop in when the 5G hype clashes with poor mobile device sales.",
        "created_utc": 1590343094,
        "id": "fropllh",
        "permalink": "/r/investing/comments/gple9p/nvidia_shares_reach_alltime_high_as_notebooks/fropllh/",
        "score": 1,
        "subreddit": "investing",
        "created": 1590371894.0
    },
    {
        "author": "Robjeah",
        "body": "Hello. I am 27 Years old and want to update my portfolio for next quarter. Do you have any suggestions?\n\nName\t                         Buy Price\tLast Price\tPortfolio Percent\nAPPLE INC. - COMMON ST\t    239,59\t318,89\t1,67%\nCHEGG INC. COMMON STO\t    35,44\t64,91\t2,56%\nDARDEN RESTAURANTS IN\t    77,49\t75,63\t1,39%\nDOCUSIGN INC. - COMMO\t    86,5\t133\t        1,75%\nETFS CRUDE OIL\t            2,85\t2,914\t7,43%\nETSY INC. - COMMON ST\t    36,11\t77,48\t2,03%\nFACEBOOK INC. - CLASS\t    157,9\t234,91\t2,47%\nFOOT LOCKER INC.\t            27,79\t26,83\t1,76%\nMCDONALDS CORPORATION   180,92\t184,41\t1,45%\nMICROSOFT CORPORATION    185,47\t183,51\t1,45%\nNETFLIX INC. - COMMON\t    366,7\t429,32\t2,26%\nNVIDIA CORPORATION - C\t    242,64\t361,05\t1,90%\nOKTA INC\t                            124,3\t192,49\t1,52%\nPAYPAL HOLDINGS INC.\t    143,1\t150,86\t1,19%\nPELOTON INTERACTIVE INC-A 23,79\t45,81\t3,01%\nQUALCOMM INCORPORATED   66,84\t78,7\t        0,62%\nREVOLVE GROUP INC.            11,8\t14,59\t0,57%\nSHOPIFY INC. CLASS A S\t    420,4\t825,17\t2,17%\nSQUARE INC - A\t            46,13\t81,49\t2,14%\nSTARBUCKS CORPORATION    76,9\t77,62\t1,43%\nTAKE-TWO INTERACTIVE S\t   146,6\t140,51\t1,85%\nTAPESTRY INC\t                   13,06\t13,98\t1,29%\nTESLA MOTORS INC. - C\t   593,6\t816,88\t30,03%\nTEXAS ROADHOUSE INC.\t   49,53\t50,35\t1,32%\nTHE CHEESECAKE FACTORY   20,3\t19,97\t1,31%\nTHE TRADE DESK CL A\t   195,98\t307,6\t2,42%\nVANGUARD S&amp;P500\t           49\t        51,256\t17,61%\nWALT DISNEY COMPANY (T\t   115\t118,02\t0,62%\nWENDY'S COMPANY (THE)\t   20,5\t20,86\t1,37%\nYUM! BRANDS INC.\t           87,4\t87,25\t1,37%",
        "created_utc": 1590403620,
        "id": "frra4xw",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/frra4xw/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1590432420.0
    },
    {
        "author": "ODonThis",
        "body": "Yeah I got Qualcomm google illumina and probably 1 or 2 more since my parents company is in electronic assembly I went with names I have built parts for when I was 5 years old. I just dont know if i should pay off my margin or just let it keep building since it is at 5k and equal to my total portfolio value in robinhood.",
        "created_utc": 1588548201,
        "id": "fpeii4r",
        "permalink": "/r/stocks/comments/gcpxkt/is_this_sub_going_to_be_renamed_rbuffet/fpeii4r/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588577001.0
    },
    {
        "author": "WSBankrupt",
        "body": "QCOM, INTC and MRVL at open.\n\nMight sell some tanker puts.",
        "created_utc": 1588562481,
        "id": "fpf5t4l",
        "permalink": "/r/wallstreetbets/comments/gcx8rv/what_are_your_moves_tomorrow_may_04_2020/fpf5t4l/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588591281.0
    },
    {
        "author": "you999",
        "body": "It's hard to say.  AMD has been hitting them hard on the prosumer and Qualcomm is trying to take over their laptop monopoly.  Intel is still a really big player in the data centers with their xeons and I don't see that changing for the time being.  Right now Intel is in process of taking on nvidia's graphic cards with their XE project. if the high end XE GPU can trade blows with Nvidia's quadros and tesla cards things would look really good for Intel but only time will tell.",
        "created_utc": 1588572056,
        "id": "fpfi987",
        "permalink": "/r/wallstreetbets/comments/gcx8rv/what_are_your_moves_tomorrow_may_04_2020/fpfi987/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588600856.0
    },
    {
        "author": "moneyandbanking1",
        "body": "Is QCOM gonna pop or drop?",
        "created_utc": 1588694642,
        "id": "fpkh7y8",
        "permalink": "/r/wallstreetbets/comments/gdv4qs/daily_discussion_thread_for_may_05_2020/fpkh7y8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588723442.0
    },
    {
        "author": "tsuruko918",
        "body": "Both closed near zero change from close previous day.  When did you open the trade?  What were your strikes and expiry?  How were they chosen?  What is your trading plan assuming they opened ITM?\n\nI didn't participate in QCOM, but TSLA was an easy 5% ROC.",
        "created_utc": 1588317008,
        "id": "fp55j7s",
        "permalink": "/r/wallstreetbets/comments/gb8q7j/strangles_the_best_way_to_play_earnings/fp55j7s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588345808.0
    },
    {
        "author": "tsuruko918",
        "body": "TSLA: Looks like you did an inverse iron condor if you did debit spreads, so opposite what this thread is about so I won't cover this.\n\nQCOM: Assuming you shorted the contracts, these strikes are just too aggressive.  You are ITM if the stock had moved 0.5 in either direction (the stock actually closed almost ITM).  The expected move in QCOM was about 4.4% ($3.5) with the average move from earnings (over the past 10 years) of 4.6%.  In other words, your strikes are set in an extremely aggressive manner giving you a low probability trade and really high gamma exposure.  What the OP is recommending is 1 standard deviation strikes, which mean a delta of 0.16 on either side.",
        "created_utc": 1588354134,
        "id": "fp6kz5m",
        "permalink": "/r/wallstreetbets/comments/gb8q7j/strangles_the_best_way_to_play_earnings/fp6kz5m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588382934.0
    },
    {
        "author": "SwimmingJunky",
        "body": "Ah yes, Tesla the $800 penny stock, Apple the $300 penny stock, AMD the $50 penny stock, and Qualcomm the $80 penny stock.",
        "created_utc": 1588764294,
        "id": "fpnit2o",
        "permalink": "/r/pennystocks/comments/gei47q/4_tech_stocks_that_will_make_you_a_fortune_in_the/fpnit2o/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1588793094.0
    },
    {
        "author": "coapa760",
        "body": "Anybody have any experience with \n\nMURPHY OIL STOCK or MARATHON OIL ?\n\nI know oil is in the news lately. \nAdvice ?\nOther stock I'm eying for the long run is BOEING or a tech either nvdia Qualcomm or Roku...",
        "created_utc": 1588784020,
        "id": "fpogc3o",
        "permalink": "/r/wallstreetbets/comments/gehav8/daily_discussion_thread_for_may_06_2020/fpogc3o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588812820.0
    },
    {
        "author": "Sev3n",
        "body": "&gt;Qualcomm or anything 5G related should also be a pretty safe bet\n\nExcept Nokia.",
        "created_utc": 1589101852,
        "id": "fq5e32l",
        "permalink": "/r/RobinHood/comments/gg3c90/if_you_had_50000_saved_to_spend_in_the_stock/fq5e32l/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1589130652.0
    },
    {
        "author": "DFriedRice",
        "body": "I think Apple, qualcomm, and tesla has a huge potential, especially because of the switch to 5g, and of course apple is apple, they have huge money making potential in the future. Also Microsoft and Amazon are sure to win in the future, especially because more and more companies will want to operate online, and sell products online in the long run.",
        "created_utc": 1589403463,
        "id": "fqj0pju",
        "permalink": "/r/stocks/comments/giy853/which_company_do_you_think_is_an_great_business/fqj0pju/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589432263.0
    },
    {
        "author": "KSD123",
        "body": "QCOM calls if youre smart",
        "created_utc": 1589485175,
        "id": "fqmxi3c",
        "permalink": "/r/wallstreetbets/comments/gjjjxj/daily_discussion_thread_for_may_14_2020/fqmxi3c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589513975.0
    },
    {
        "author": "KSD123",
        "body": "QCOM  79$ call u can thank me later",
        "created_utc": 1589378572,
        "id": "fqhk33b",
        "permalink": "/r/wallstreetbets/comments/giw912/daily_discussion_thread_for_may_13_2020/fqhk33b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589407372.0
    },
    {
        "author": "Esti88",
        "body": "More than likely. 5g is kind of available to some markets but I don’t expect anything big until third quarter of 2021. Qcom directly benefits by creating radios and other parts for phones like modems that need to be updated to support the new 5g standard. Qcom is the major player in this game selling to both Apple and Android manufacturers.",
        "created_utc": 1589560192,
        "id": "fqq6fa0",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqq6fa0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589588992.0
    },
    {
        "author": "-2Black2Strong-",
        "body": "QCOM :)\n\nY'all niggas really think China gonna ban them? fuck outta hereeee",
        "created_utc": 1589560287,
        "id": "fqq6m6x",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqq6m6x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589589087.0
    },
    {
        "author": "weightedpullups",
        "body": "https://twitter.com/globaltimesnews/status/1261270413390143491\n\nShares in #Qualcomm, #Cisco, #Apple and #Boeing - four companies named by Chinese sources as possible targets for retaliation amid US moves against China's Huawei - dropped in premarket trading on Friday.",
        "created_utc": 1589546706,
        "id": "fqphr4n",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqphr4n/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589575506.0
    },
    {
        "author": "KSD123",
        "body": "BTFD on QCOM 79$ call",
        "created_utc": 1589554792,
        "id": "fqpvm6m",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpvm6m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589583592.0
    },
    {
        "author": "ERISAboy",
        "body": "Cramer fucked us NVDA holders \n\nhttps://www.google.com/amp/s/www.cnbc.com/amp/2020/05/13/cramer-charts-show-nvidia-amd-and-qualcomm-have-more-room-to-run.html",
        "created_utc": 1589637966,
        "id": "fqtfiaw",
        "permalink": "/r/wallstreetbets/comments/gkggr4/weekend_discussion_thread_for_the_weekend_of_may/fqtfiaw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589666766.0
    },
    {
        "author": "pgh1979",
        "body": "When you try to commit murder you better get it right the first time. US tried to kill Huawei last year. China caved and bought a year of time . Huawei has used that year to build their own chip and OS. Now they can live without Qualcomm and Google. This time US is bringing a knife to a gunfight",
        "created_utc": 1589646457,
        "id": "fqtuof3",
        "permalink": "/r/wallstreetbets/comments/gktptp/us_pushes_china_decoupling_wiping_billions_off/fqtuof3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589675257.0
    },
    {
        "author": "quaeratioest",
        "body": "Qualcomm is shit. They have a few generic chips for all different types of devices. None of that shit is optimized to the OS/hardware. \n\nNotice how iphones have a 30% smaller battery size than most droids, yet similar battery life. All of those gainz are through design, optimization from doing everything in house. This is why samsumg watch and google watch failed.",
        "created_utc": 1589654430,
        "id": "fqu94og",
        "permalink": "/r/wallstreetbets/comments/gktptp/us_pushes_china_decoupling_wiping_billions_off/fqu94og/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589683230.0
    },
    {
        "author": "thomaswtran",
        "body": "Based on what I know, if the US further blocks key technology supply to Huawei, China will activate the \"unreliable entity list\", restrict or investigate US companies such as Qualcomm, Cisco and Apple, and suspend the purchase of Boeing airplanes.\n\nChina block Apple? yeah right they will get Riots but yeah the white house messin with my tendies",
        "created_utc": 1589541552,
        "id": "fqpbe1v",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpbe1v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570352.0
    },
    {
        "author": "-2Black2Strong-",
        "body": "Check your portfolio. Got QCOM?\n\nThose of you that don't? In the words of Russell Westbrook :\n\n&gt; Y'all niggas trippin",
        "created_utc": 1589559239,
        "id": "fqq4gxb",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqq4gxb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589588039.0
    },
    {
        "author": "ElonSuks",
        "body": "Got qcom skyworks crown castle buy!",
        "created_utc": 1590466255,
        "id": "fru701e",
        "permalink": "/r/stocks/comments/gq722v/rstocks_daily_discussion_monday_may_25_2020/fru701e/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1590495055.0
    },
    {
        "author": "s0ysauce09",
        "body": "What do you think about QCOM, I just recently picked up QCOM last week, in the hopes of holding them for 5g rollout",
        "created_utc": 1590571235,
        "id": "frynzi6",
        "permalink": "/r/stocks/comments/fbt6pb/rate_my_portfolio_rstocks_quarterly_thread_march/frynzi6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1590600035.0
    },
    {
        "author": "Will_Work_For_Frags",
        "body": "CSCO and QCOM is free money tomorrow",
        "created_utc": 1590595392,
        "id": "frznqqy",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/frznqqy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590624192.0
    },
    {
        "author": "Will_Work_For_Frags",
        "body": "Sold my AMD 50p, holding onto the 45p.\n\nGot some QCOM and CSCO",
        "created_utc": 1590597572,
        "id": "frzs8e5",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/frzs8e5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590626372.0
    },
    {
        "author": "whatgoxneeds",
        "body": "Any Canadian (TSX) companies that hold 5G patents?\n\nI'm interested as well, but haven't found any.\n\nSome American ones (Broadcom/Qualcomm) come to mind..    \n\nAnyone aware of a 5G based ETF for some exposure?",
        "created_utc": 1590621043,
        "id": "fs149gv",
        "permalink": "/r/CanadianInvestor/comments/grtzcu/5g/fs149gv/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1590649843.0
    },
    {
        "author": "DalDad",
        "body": "Semiconductors. Qualcomm, Micron, Qorvo, Broadcom, Texas Instruments, etc.",
        "created_utc": 1590695519,
        "id": "fs4gg2h",
        "permalink": "/r/wallstreetbets/comments/gs3jqo/daily_discussion_thread_for_may_28_2020/fs4gg2h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590724319.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "Everything is way to high but if your looking out a few years you should be ok imo. Qcom micron sky works Amat are some to look into.",
        "created_utc": 1590671391,
        "id": "fs32yor",
        "permalink": "/r/stocks/comments/gs0x43/tech_stocks/fs32yor/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1590700191.0
    },
    {
        "author": "terpythrowaway",
        "body": "Qcom makes 50% of their revenue from mainland China and will be on the banned company list for China",
        "created_utc": 1590678232,
        "id": "fs3foaa",
        "permalink": "/r/wallstreetbets/comments/gs3jqo/daily_discussion_thread_for_may_28_2020/fs3foaa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590707032.0
    },
    {
        "author": "MgliebMBA",
        "body": "XLNX vs QCOM leaps? which will do better?",
        "created_utc": 1588346730,
        "id": "fp66259",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp66259/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588375530.0
    },
    {
        "author": "RawInquisitor",
        "body": "Positions:\n1. TSLA 805C/810C debit spread, 760P/765P debit spread.\nGot each spread for 2$ (8000$ worth) 30 mins before earnings release. TSLA usually has a big swing in one direction. I have always lost money on TSLA, so didn't want to take much risk here. Should have sold the call spread when it was at 850 but yeah well. Sold the put spread today for a slight profit. Phew. \n2. QCOM 79C/78P at 3.5$ (3500$ worth). QCOM was trading at 78.5 so I felt like this was a no brainer given that both QCOM and AAPL have their earnings (AAPL earnings usually affect QCOM). Both my options were down yesterday. But AAPL earnings pushed QCOM down and the 78P was ITM. Sold it at a slight loss.",
        "created_utc": 1588349969,
        "id": "fp6chff",
        "permalink": "/r/wallstreetbets/comments/gb8q7j/strangles_the_best_way_to_play_earnings/fp6chff/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588378769.0
    },
    {
        "author": "moneyandbanking1",
        "body": "Bought QCOM calls 30 minutes before a downgrade AMA",
        "created_utc": 1588614583,
        "id": "fph419x",
        "permalink": "/r/wallstreetbets/comments/gd8zpy/daily_discussion_thread_for_may_04_2020/fph419x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588643383.0
    },
    {
        "author": "swistak84",
        "body": "\\&gt; Saudi  Arabia’s sovereign wealth fund buys stakes in Disney, Facebook,  Starbucks, Bank of America, Berkshire Hathaway, Qualcomm and Uber, among  others. \n\n&amp;#x200B;\n\nWhat's interesting is how they buy, they are literally just throwing dollars at anything:\n\n&amp;#x200B;\n\n\\&gt; I believe they are trying to get rid of their US dollar reserve currency as quickly as possible. No country spends systematically 500 millions dollars in shares for each company; Disney ($500m); Facebook($520m), LiveNation($500m) etc... to build up a 300 billion dollar portfolio in just 2 months.\n\n&amp;#x200B;\n\nLooks like they are quickly unloading their dollar reserves anticipating inflation, or they are just throwing money at the wall and hoping something sticks.\n\n&amp;#x200B;\n\nSource: [https://www.yahoo.com/entertainment/saudi-arabia-public-investment-fund-221510838.html](https://www.yahoo.com/entertainment/saudi-arabia-public-investment-fund-221510838.html)",
        "created_utc": 1589640864,
        "id": "fqtknmp",
        "permalink": "/r/wallstreetbets/comments/gkur3w/saudi_sovereign_wealth_fund_seeking_10_billion/fqtknmp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589669664.0
    },
    {
        "author": "Redknife11",
        "body": "Woah. The US China Stuff is going to kick off.\n\nhttps://www.reuters.com/article/us-usa-huawei-tech-exclusive-idUSKBN22R1KC\n\nBasically the US prohibits the sale of its chips to Huawei and ZTE. Huawei said whatever and developed the kirin chip which it uses.\n\nThe new EO will block companies outside the US from supplying Huawei and ZTE. How can we do that?\n\nGlad you asked TSMC out of Taiwan is the premier chip faber for basically everybody. They use US licensed tech. They sell to Huawei, no more tech AND they lose US business, also with the China/Taiwan political shit they won't piss off the US.\n\nThere is also nobody else comparable in the chip fab business.\n\nHow to Play: Calls on QCOM (less competition), Puts on TSMC (losing business)\n\nStand by for China's retaliation",
        "created_utc": 1589614489,
        "id": "fqspntv",
        "permalink": "/r/wallstreetbets/comments/gkggr4/weekend_discussion_thread_for_the_weekend_of_may/fqspntv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589643289.0
    },
    {
        "author": "TheGuyAboveMeSucks",
        "body": "The problem is that you have an MBA and you think rationally. You most likely dig into financials more than I do. \n\nI don’t know anything about NAT, and skip every post about tankers and oil, but NAT 7c 6/19 seems like a good call and you have time if there is a dip after earnings, same with WMT. WMT should kill it. WFC looks like a long hold. NOK and QCOM really need that 5G to kick them up. I held some FIVG for awhile, but it didn’t take off as I had planned. On those calls, I’d just really think about your exit plan. Do you hold NAT thru all it’s ups and downs? Will WMT maintain or continue to rise past 135?  \n\nMy 6/19s are BABA 220, JD 60, and NET 30. JD and NET already had earnings. Other than that I have longer dated calls on XLK, XLY, XLP, and XLF.",
        "created_utc": 1589618292,
        "id": "fqsthzh",
        "permalink": "/r/wallstreetbets/comments/gkk4xh/42069_boys/fqsthzh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589647092.0
    },
    {
        "author": "-2Black2Strong-",
        "body": "Nah, we all jacked on QCOM",
        "created_utc": 1589763604,
        "id": "fqzb0lm",
        "permalink": "/r/wallstreetbets/comments/glmbkl/what_are_your_moves_tomorrow_may_18_2020/fqzb0lm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589792404.0
    },
    {
        "author": "-2Black2Strong-",
        "body": "Not as much as QCOM that's for sure. I'd say another $15 before overall market rugpull",
        "created_utc": 1589649848,
        "id": "fqu0v4b",
        "permalink": "/r/wallstreetbets/comments/gkggr4/weekend_discussion_thread_for_the_weekend_of_may/fqu0v4b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589678648.0
    },
    {
        "author": "Leroy--Brown",
        "body": "More than 50% will go into SCHB, think of it like VTI or VTSAX.\n\nThe rest: WMT, V, BAM, MSFT, AMT, QCOM and if I didn't already have a huge allocation into DIS, I'd add more DIS.",
        "created_utc": 1589611471,
        "id": "fqsmd0p",
        "permalink": "/r/investing/comments/gknu9s/post_crash_watch_list/fqsmd0p/",
        "score": 1,
        "subreddit": "investing",
        "created": 1589640271.0
    },
    {
        "author": "ts1234666",
        "body": "Why would they do that? Apple works closely with chinese giants like FoxConn and QualComm.",
        "created_utc": 1589804383,
        "id": "fr0quqo",
        "permalink": "/r/stocks/comments/glzzg5/i_want_to_sell_aapl/fr0quqo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589833183.0
    },
    {
        "author": "-2Black2Strong-",
        "body": "QCOM 80 5/22",
        "created_utc": 1589787623,
        "id": "fr094zu",
        "permalink": "/r/wallstreetbets/comments/glmbkl/what_are_your_moves_tomorrow_may_18_2020/fr094zu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589816423.0
    },
    {
        "author": "fin425",
        "body": "Qualcomm is a big one",
        "created_utc": 1589812044,
        "id": "fr12mc1",
        "permalink": "/r/wallstreetbets/comments/glyucu/daily_discussion_thread_for_may_18_2020/fr12mc1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589840844.0
    },
    {
        "author": "heartstesler",
        "body": "Agree \n\nChina will do for all three Qualcomm Apple Cisco and others \n\nAll should be and would be down big",
        "created_utc": 1589556822,
        "id": "fqpzkiw",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpzkiw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589585622.0
    },
    {
        "author": "-2Black2Strong-",
        "body": "Ah ok. \n\nBA seems to be on the lower end of its channel. I went all in on QCOM but if I were looking for FDs I'd prolly pick up some BA 120Cs or 125Cs.\n\nYou can always bet on UFC tomorrow! lol, trade safe bro",
        "created_utc": 1589559884,
        "id": "fqq5sk0",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqq5sk0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589588684.0
    },
    {
        "author": "printer_go_brrr",
        "body": "Hey, idiot, let me help you since you're a fucking retard.\n\nChina is sad we're fucking Huawei so they're saying they're going to fuck Cisco, Qualcomm and Apple.\n\nkek",
        "created_utc": 1589541283,
        "id": "fqpb3o6",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpb3o6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570083.0
    },
    {
        "author": "Andrew_the_giant",
        "body": "Markets down this morning due to fears that China will not allow Apple, Qualcomm, or buy buy Boeing planes.\n\nNo way this happens.\n\nI'm buying calls.",
        "created_utc": 1589541542,
        "id": "fqpbdnr",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpbdnr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570342.0
    },
    {
        "author": "thecashcow-",
        "body": "Based on what I know, if the US further blocks key technology supply to Huawei, China will activate the \"unreliable entity list\", restrict or investigate US companies such as Qualcomm, Cisco and Apple, and suspend the purchase of Boeing airplanes. -GT editor",
        "created_utc": 1589541308,
        "id": "fqpb4mv",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpb4mv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570108.0
    },
    {
        "author": "scopolamine",
        "body": "&gt;Based on what I know, if the US further blocks key technology supply to Huawei, China will activate the \"unreliable entity list\", restrict or investigate US companies such as Qualcomm, Cisco and Apple, and suspend the purchase of Boeing airplanes. - Chinese Global Times reporter\n\nTrade war is back on the menu, boys!",
        "created_utc": 1589541355,
        "id": "fqpb6g7",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpb6g7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570155.0
    },
    {
        "author": "DrUNC83",
        "body": "“Based on what I know, if the US further blocks key technology supply to Huawei, China will activate the \"unreliable entity list\", restrict or investigate US companies such as Qualcomm, Cisco and Apple, and suspend the purchase of Boeing airplanes.”",
        "created_utc": 1589546039,
        "id": "fqpgtgq",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpgtgq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589574839.0
    },
    {
        "author": "zaktrades123",
        "body": "Cramer pumping my favorite company’s NVDA, AMD and QCOM\n\nMoment of silence for them",
        "created_utc": 1589409261,
        "id": "fqjfmtl",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqjfmtl/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589438061.0
    },
    {
        "author": "Incognito512",
        "body": "he only suggested $AMD. $NVDA and $QCOM; the retard strength stocks",
        "created_utc": 1589427035,
        "id": "fqkgw09",
        "permalink": "/r/wallstreetbets/comments/gjcaqq/jim_cramer_reveals_his_playbook_says_investors/fqkgw09/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589455835.0
    },
    {
        "author": "mufasala88",
        "body": "RIP AMD, NVDA, QCOM. Jim Cramer said more upside. F",
        "created_utc": 1589412604,
        "id": "fqjnt9n",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqjnt9n/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1589441404.0
    },
    {
        "author": "WSBankrupt",
        "body": "Current long positions: ABBV, BMY, C, CAR, DCP, H, INTC, MGM, PK, QCOM, RDSB, RTX, T, USCR\n\nOnly 50% of spare cash is in the above. Will DCA.\n\nLottos: OXY puts and DFEN\n\nMemes: TNP\n\nAlso sold CCL puts and TNP calls",
        "created_utc": 1588640043,
        "id": "fpifumk",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fpifumk/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588668843.0
    },
    {
        "author": "needadvicebadly",
        "body": "I think that's an internal detail though. They are not reselling their chips. They custom design them for better integration in their products, and they still source others from Samsung and AMD with no plans to build their own desktop GPUs that I'm aware of. Even a more exponential growth for datacenters or IoT devices won't have an impact on Apple's chip business compared to something like AMD, NVDA, INTC or QCOM.",
        "created_utc": 1588639597,
        "id": "fpif30g",
        "permalink": "/r/investing/comments/gdkx3v/nvdaamdmsftaapl_which_has_the_most_potential_for/fpif30g/",
        "score": 4,
        "subreddit": "investing",
        "created": 1588668397.0
    },
    {
        "author": "uninfinity",
        "body": "RIP\n\n   **Jim Cramer: Chart action shows more upside in Nvidia, AMD and Qualcomm**",
        "created_utc": 1589411812,
        "id": "fqjlw7b",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqjlw7b/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1589440612.0
    },
    {
        "author": "needadvicebadly",
        "body": "I agree with all your points. In terms of business similarity (not at all investing prospect similarities) I think of tech companies as:\n\n- chip/components/data center hardware: NVDA, AMD, INTC, QCOM, TXN\n- fabrication: TSM (I don't follow anything else sorry)\n- PaaS: MSFT, AMZN, IBM/RedHat, GOOG (trying aggressively)\n- SaaS/Software: MSFT, GOOG, ORCL, IBM/RedHat, ADEB, FB, AMZN\n- Consumer Electronics: AAPL\n- Ads: GOOG, FB\n\nobviously there are many other companies that I don't follow, and the categorization isn't 100% clean either. AAPL's services (music, icloud, etc) are forms of SaaS. FB is technically ads, but they are also a complete marketing SaaS especially globally where many businesses rely 100% on FB for their entire online presence. Ads also depends on your reach. Both GOOG and MSFT have consumer electronics, but I don't use that to drive investment. I won't be surprised if GOOG or MSFT cancel a major line of their hardware any time.\n\nThere are many other consumer electronics companies but nothing as fully integrated as AAPL in that area, including MSFT and GOOG.\n\nRedHat is active in the datacenter space and probably why IBM acquired them. IBM is more of a global tech projects coordinator, and manages a lot of banks infrastructures, but are feeling the pressure from other PaaS providers. I don't have any investments in it though. \n\nTech companies always have their toes in many businesses because of the nature of software. I can't think of one with more toes than MSFT (maybe GOOG second), which could be unfocused waste depending on their management. It certainly feel like it was for MSFT for most of the 2000s.\n\nTo answer OP's question though, I think any of these companies are probably fine with equal chances, though you will introduce yourself to company specific short term volatility. Who knows when a random bad news for AAPL, MSFT, AMD, NVDA, etc might hit affecting the stock price in the short term. Balancing (depending on the amount) or using an etf like others mentioned is a good idea, though I don't think any of your picks will be bad in the long run either.",
        "created_utc": 1588637788,
        "id": "fpibzai",
        "permalink": "/r/investing/comments/gdkx3v/nvdaamdmsftaapl_which_has_the_most_potential_for/fpibzai/",
        "score": 3,
        "subreddit": "investing",
        "created": 1588666588.0
    },
    {
        "author": "rockybullwinkle43",
        "body": "Just want to say thanks to the random folks who said DIS and QCOM calls in the daily thread yesterday.",
        "created_utc": 1589516792,
        "id": "fqojnui",
        "permalink": "/r/wallstreetbets/comments/gjtxjd/what_are_your_moves_tomorrow_may_15_2020/fqojnui/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1589545592.0
    },
    {
        "author": "HajaKensei",
        "body": "Then explain instead of being a pickle dick like your name suggests you are. As far as IT news are concerned, it is an apt comparison when AMD is definitely not going to stop here. It already broke Intel's monopoly over the desktop, mobile and server CPU market. They are also already in the midst of making phone gpu and will be directly taking on Qualcomm and ARM. As stock  market goes; nothing is for certain of course. But calling it retarded? It's like a peanut farmer saying potato farms won't be rich; stupid remark about a different product, different market and lack of knowledge. It's one of the few industries that are still going up despite the pandemic, that speaks a lot by itself.",
        "created_utc": 1589066601,
        "id": "fq3htlv",
        "permalink": "/r/stocks/comments/ggiafk/some_good_news_coming_amds_way/fq3htlv/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1589095401.0
    },
    {
        "author": "Broshawn",
        "body": "TSLA is like Qualcomm in that they won’t see $800 share price again for at least 10 years",
        "created_utc": 1588793683,
        "id": "fpp07o2",
        "permalink": "/r/wallstreetbets/comments/gehav8/daily_discussion_thread_for_may_06_2020/fpp07o2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588822483.0
    },
    {
        "author": "FearlessGuster2001",
        "body": "What is going on with QCOM after hours? No news that I have seen",
        "created_utc": 1589403189,
        "id": "fqj00ag",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqj00ag/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589431989.0
    },
    {
        "author": "VeryTiredDad",
        "body": "Lol. A few favorites are MX, DKNG, QCOM, WYNN, and EADSY. Definitely a good amount of risk here but I’m good with that given the upside.",
        "created_utc": 1588886267,
        "id": "fpt7lb0",
        "permalink": "/r/stocks/comments/gf5s7b/underrated_stocks/fpt7lb0/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1588915067.0
    },
    {
        "author": "ixamnis",
        "body": "Solid choices. VISA, McDonald's, Coke, Exxon, Dutch Shell and Delta are generally known for producing nice dividends. I think MSFT and AMD have great short term and long term growth potential. I think Disney isn't going anywhere in the short term, but it's a good long-term stock to hold. \n\nBecause of your age, as you move forward, I would consider more growth stocks in your portfolio. Some of my favorites right now include SQ, APPN, W, TTD, and TSLA. \n\nFor such a small portfolio, you have 20% of your stocks in Energy/Oil companies. Not necessarily a bad thing, and you've picked two of the best in that sector. It has been a volatile sector lately, so I would be cautious. In that sector, the only additional holding that I have currently is ET (Energy Transfer) and it has been doing quite well. The upside is both for growth and dividends.  Also, Tesla might be considered an energy stock, a tech stock and a car company stock.\n\nI'd say you have a solid start as a long term investor. Continue to expand on this and you should do well. \n\nGold:  GLD or IAU\n\n5G Technology:  QCOM, AAPL (which you already have), VZ, TMUS",
        "created_utc": 1589218639,
        "id": "fqagff2",
        "permalink": "/r/stocks/comments/ghr5of/my_stocks_at_18_thoughts/fqagff2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1589247439.0
    },
    {
        "author": "buttersquashcorgi",
        "body": "BRKB. \n\n\nIf there’s a truly big dip, then Buffett will deploy it faster and more efficiently than I ever could for a large number of sector. I just can’t force myself into to read up DD on insurance companies or some low level manufacturing company. \n\n\nFor tech, I still like MS, QCOM, ERIC, NOK, INTC, AMD. Stuff that are the backbone of the internet. My other big play is TGT - they’ve been doing pretty well with e-commerce and IMHO can be competitive with Amazon in household goods. They have physical locations and are just a pleasant shopping experience in general. Amazon is filled with trash these days.",
        "created_utc": 1589083393,
        "id": "fq4sw5j",
        "permalink": "/r/investing/comments/ggu9be/if_and_i_repeat_if_there_is_another_huge_dip_what/fq4sw5j/",
        "score": 2,
        "subreddit": "investing",
        "created": 1589112193.0
    },
    {
        "author": "Spit_in_the_Pit",
        "body": "Any reason you're avoiding the obvious picks? Nokia, Eric, Qualcomm?",
        "created_utc": 1589474110,
        "id": "fqma82f",
        "permalink": "/r/wallstreetbets/comments/gjpqt0/5g_portfolio/fqma82f/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1589502910.0
    },
    {
        "author": "jschreiber77",
        "body": "Hmm...MX:  No idea about this company.  DKNG being so new and all the hype right now on it, \"when those are greedy...\" -- I'll pass.  QCOM is a buy.  WYNN is a buy.  EADSY = no interest.\n\nMy watchlist is over 50 via a variety of sectors, so I won't mention every one.  I will, however, mention eight.  Here goes:\n\nNTR, ELY, TCEHY, AVVI, MU, FANG, O, CRWD\n\nBecause I own shares of 25 different stocks, 45% of ETFs and generally risk 10% on riskier stocks, I'm now going to focus my energies on buying high-dividend quality stocks and build a new portfolio with Fidelity.",
        "created_utc": 1588901598,
        "id": "fptzqj2",
        "permalink": "/r/stocks/comments/gf5s7b/underrated_stocks/fptzqj2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1588930398.0
    },
    {
        "author": "TheCandyMan25",
        "body": "I'm weary of any company that is so reliant on Apple. Apple's making all of their CPUs now, who's to say they won't start making other hardware? Obviously that's not a concern for QCOM until 2023 but just something to consider when these contracts are set to expire.",
        "created_utc": 1588704338,
        "id": "fpl0qer",
        "permalink": "/r/investing/comments/ge389v/best_5g_stocks_to_buy_right_now/fpl0qer/",
        "score": 2,
        "subreddit": "investing",
        "created": 1588733138.0
    },
    {
        "author": "ODonThis",
        "body": "Yeah I got Qualcomm google illumina and probably 1 or 2 more since my parents company is in electronic assembly I went with names I have built parts for when I was 5 years old. I just dont know if i should pay off my margin or just let it keep building since it is at 5k and equal to my total portfolio value in robinhood.",
        "created_utc": 1588548201,
        "id": "fpeii4r",
        "permalink": "/r/stocks/comments/gcpxkt/is_this_sub_going_to_be_renamed_rbuffet/fpeii4r/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588577001.0
    },
    {
        "author": "WSBankrupt",
        "body": "QCOM, INTC and MRVL at open.\n\nMight sell some tanker puts.",
        "created_utc": 1588562481,
        "id": "fpf5t4l",
        "permalink": "/r/wallstreetbets/comments/gcx8rv/what_are_your_moves_tomorrow_may_04_2020/fpf5t4l/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588591281.0
    },
    {
        "author": "you999",
        "body": "It's hard to say.  AMD has been hitting them hard on the prosumer and Qualcomm is trying to take over their laptop monopoly.  Intel is still a really big player in the data centers with their xeons and I don't see that changing for the time being.  Right now Intel is in process of taking on nvidia's graphic cards with their XE project. if the high end XE GPU can trade blows with Nvidia's quadros and tesla cards things would look really good for Intel but only time will tell.",
        "created_utc": 1588572056,
        "id": "fpfi987",
        "permalink": "/r/wallstreetbets/comments/gcx8rv/what_are_your_moves_tomorrow_may_04_2020/fpfi987/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588600856.0
    },
    {
        "author": "moneyandbanking1",
        "body": "Is QCOM gonna pop or drop?",
        "created_utc": 1588694642,
        "id": "fpkh7y8",
        "permalink": "/r/wallstreetbets/comments/gdv4qs/daily_discussion_thread_for_may_05_2020/fpkh7y8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588723442.0
    },
    {
        "author": "tsuruko918",
        "body": "Both closed near zero change from close previous day.  When did you open the trade?  What were your strikes and expiry?  How were they chosen?  What is your trading plan assuming they opened ITM?\n\nI didn't participate in QCOM, but TSLA was an easy 5% ROC.",
        "created_utc": 1588317008,
        "id": "fp55j7s",
        "permalink": "/r/wallstreetbets/comments/gb8q7j/strangles_the_best_way_to_play_earnings/fp55j7s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588345808.0
    },
    {
        "author": "tsuruko918",
        "body": "TSLA: Looks like you did an inverse iron condor if you did debit spreads, so opposite what this thread is about so I won't cover this.\n\nQCOM: Assuming you shorted the contracts, these strikes are just too aggressive.  You are ITM if the stock had moved 0.5 in either direction (the stock actually closed almost ITM).  The expected move in QCOM was about 4.4% ($3.5) with the average move from earnings (over the past 10 years) of 4.6%.  In other words, your strikes are set in an extremely aggressive manner giving you a low probability trade and really high gamma exposure.  What the OP is recommending is 1 standard deviation strikes, which mean a delta of 0.16 on either side.",
        "created_utc": 1588354134,
        "id": "fp6kz5m",
        "permalink": "/r/wallstreetbets/comments/gb8q7j/strangles_the_best_way_to_play_earnings/fp6kz5m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588382934.0
    },
    {
        "author": "SwimmingJunky",
        "body": "Ah yes, Tesla the $800 penny stock, Apple the $300 penny stock, AMD the $50 penny stock, and Qualcomm the $80 penny stock.",
        "created_utc": 1588764294,
        "id": "fpnit2o",
        "permalink": "/r/pennystocks/comments/gei47q/4_tech_stocks_that_will_make_you_a_fortune_in_the/fpnit2o/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1588793094.0
    },
    {
        "author": "coapa760",
        "body": "Anybody have any experience with \n\nMURPHY OIL STOCK or MARATHON OIL ?\n\nI know oil is in the news lately. \nAdvice ?\nOther stock I'm eying for the long run is BOEING or a tech either nvdia Qualcomm or Roku...",
        "created_utc": 1588784020,
        "id": "fpogc3o",
        "permalink": "/r/wallstreetbets/comments/gehav8/daily_discussion_thread_for_may_06_2020/fpogc3o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588812820.0
    },
    {
        "author": "Sev3n",
        "body": "&gt;Qualcomm or anything 5G related should also be a pretty safe bet\n\nExcept Nokia.",
        "created_utc": 1589101852,
        "id": "fq5e32l",
        "permalink": "/r/RobinHood/comments/gg3c90/if_you_had_50000_saved_to_spend_in_the_stock/fq5e32l/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1589130652.0
    },
    {
        "author": "DFriedRice",
        "body": "I think Apple, qualcomm, and tesla has a huge potential, especially because of the switch to 5g, and of course apple is apple, they have huge money making potential in the future. Also Microsoft and Amazon are sure to win in the future, especially because more and more companies will want to operate online, and sell products online in the long run.",
        "created_utc": 1589403463,
        "id": "fqj0pju",
        "permalink": "/r/stocks/comments/giy853/which_company_do_you_think_is_an_great_business/fqj0pju/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589432263.0
    },
    {
        "author": "KSD123",
        "body": "QCOM calls if youre smart",
        "created_utc": 1589485175,
        "id": "fqmxi3c",
        "permalink": "/r/wallstreetbets/comments/gjjjxj/daily_discussion_thread_for_may_14_2020/fqmxi3c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589513975.0
    },
    {
        "author": "KSD123",
        "body": "QCOM  79$ call u can thank me later",
        "created_utc": 1589378572,
        "id": "fqhk33b",
        "permalink": "/r/wallstreetbets/comments/giw912/daily_discussion_thread_for_may_13_2020/fqhk33b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589407372.0
    },
    {
        "author": "thomaswtran",
        "body": "Based on what I know, if the US further blocks key technology supply to Huawei, China will activate the \"unreliable entity list\", restrict or investigate US companies such as Qualcomm, Cisco and Apple, and suspend the purchase of Boeing airplanes.\n\nChina block Apple? yeah right they will get Riots but yeah the white house messin with my tendies",
        "created_utc": 1589541552,
        "id": "fqpbe1v",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpbe1v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570352.0
    },
    {
        "author": "MgliebMBA",
        "body": "XLNX vs QCOM leaps? which will do better?",
        "created_utc": 1588346730,
        "id": "fp66259",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp66259/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588375530.0
    },
    {
        "author": "RawInquisitor",
        "body": "Positions:\n1. TSLA 805C/810C debit spread, 760P/765P debit spread.\nGot each spread for 2$ (8000$ worth) 30 mins before earnings release. TSLA usually has a big swing in one direction. I have always lost money on TSLA, so didn't want to take much risk here. Should have sold the call spread when it was at 850 but yeah well. Sold the put spread today for a slight profit. Phew. \n2. QCOM 79C/78P at 3.5$ (3500$ worth). QCOM was trading at 78.5 so I felt like this was a no brainer given that both QCOM and AAPL have their earnings (AAPL earnings usually affect QCOM). Both my options were down yesterday. But AAPL earnings pushed QCOM down and the 78P was ITM. Sold it at a slight loss.",
        "created_utc": 1588349969,
        "id": "fp6chff",
        "permalink": "/r/wallstreetbets/comments/gb8q7j/strangles_the_best_way_to_play_earnings/fp6chff/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588378769.0
    },
    {
        "author": "moneyandbanking1",
        "body": "Bought QCOM calls 30 minutes before a downgrade AMA",
        "created_utc": 1588614583,
        "id": "fph419x",
        "permalink": "/r/wallstreetbets/comments/gd8zpy/daily_discussion_thread_for_may_04_2020/fph419x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588643383.0
    },
    {
        "author": "printer_go_brrr",
        "body": "Hey, idiot, let me help you since you're a fucking retard.\n\nChina is sad we're fucking Huawei so they're saying they're going to fuck Cisco, Qualcomm and Apple.\n\nkek",
        "created_utc": 1589541283,
        "id": "fqpb3o6",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpb3o6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570083.0
    },
    {
        "author": "Andrew_the_giant",
        "body": "Markets down this morning due to fears that China will not allow Apple, Qualcomm, or buy buy Boeing planes.\n\nNo way this happens.\n\nI'm buying calls.",
        "created_utc": 1589541542,
        "id": "fqpbdnr",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpbdnr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570342.0
    },
    {
        "author": "thecashcow-",
        "body": "Based on what I know, if the US further blocks key technology supply to Huawei, China will activate the \"unreliable entity list\", restrict or investigate US companies such as Qualcomm, Cisco and Apple, and suspend the purchase of Boeing airplanes. -GT editor",
        "created_utc": 1589541308,
        "id": "fqpb4mv",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpb4mv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570108.0
    },
    {
        "author": "scopolamine",
        "body": "&gt;Based on what I know, if the US further blocks key technology supply to Huawei, China will activate the \"unreliable entity list\", restrict or investigate US companies such as Qualcomm, Cisco and Apple, and suspend the purchase of Boeing airplanes. - Chinese Global Times reporter\n\nTrade war is back on the menu, boys!",
        "created_utc": 1589541355,
        "id": "fqpb6g7",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpb6g7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570155.0
    },
    {
        "author": "HateIsAnArt",
        "body": "I have 5/22 LUV MGM and QCOM. I feel your pain.\n\nJust thankful I have some 5/8 puts and a 5/8 call on GLD",
        "created_utc": 1588598582,
        "id": "fpgalvw",
        "permalink": "/r/wallstreetbets/comments/gd8zpy/daily_discussion_thread_for_may_04_2020/fpgalvw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588627382.0
    },
    {
        "author": "cran-BEAR-y",
        "body": "Hi Lee,\n\nThanks for the reply. \n\nYeah, I feel that it is an argument that goes both ways. No clear answer, for me at least. I feel that you are on the same boat?\n\nHere are a few good picks for my dividend stocks.\n\n$RTX\n\n$JPM  \n$SBUX\n\n$QCOM\n\n$DIS\n\n$CSCO\n\n$COST\n\n$T\n\n$IBM (reaching)",
        "created_utc": 1588901768,
        "id": "fpu00mt",
        "permalink": "/r/investing/comments/gfjlre/can_someone_help_me_better_understand_dividend/fpu00mt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588930568.0
    },
    {
        "author": "jordo2323",
        "body": "I like QCOM and NOK for a smaller buy-in.",
        "created_utc": 1588887119,
        "id": "fpt9aks",
        "permalink": "/r/stocks/comments/gfa25q/best_stocks_for_5g/fpt9aks/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588915919.0
    },
    {
        "author": "Broshawn",
        "body": "If there is any surge in vol, it will almost certainly be downward movement, TSLA looks a lot like QCOM in the tech bubble",
        "created_utc": 1588876263,
        "id": "fpsn3al",
        "permalink": "/r/wallstreetbets/comments/gf3vim/daily_discussion_thread_for_may_07_2020/fpsn3al/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588905063.0
    },
    {
        "author": "WSBankrupt",
        "body": "There are a variety of decent stocks in defense/banking/travel/entertainment/materials that are close to their 52 week lows (RTX, C, T, H PK, MGM, USCR, RDSB, DCP). Looking at pharma, ABBV and BMY are reasonably priced.  Over to tech and 5g plays, where things are looking a little pricey, QCOM and INTC are still in a reasonable position.",
        "created_utc": 1589022974,
        "id": "fpzsnk1",
        "permalink": "/r/wallstreetbets/comments/gg0k2r/weekend_discussion_thread_for_the_weekend_of_may/fpzsnk1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589051774.0
    },
    {
        "author": "kstorm88",
        "body": "My mom basically did that with me, except it was allowance it was my own money started with $500. For whatever reason, we put most of the money into dis and Qualcomm. I don't really have access to the account as it was custodial, but I think last time she said there was like $5k in it.",
        "created_utc": 1589208302,
        "id": "fq9waa6",
        "permalink": "/r/wallstreetbets/comments/ghkxmf/daily_discussion_thread_for_may_11_2020/fq9waa6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589237102.0
    },
    {
        "author": "baseballbatupmyass",
        "body": "I did well with QCOM but after taking profits I switched over to the FIVG ETF.",
        "created_utc": 1588850708,
        "id": "fprd3mr",
        "permalink": "/r/stocks/comments/gf0fac/any_thoughts_on_qualcomm_a_s_a_5g_play/fprd3mr/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588879508.0
    },
    {
        "author": "SorrowsSkills",
        "body": "Care to give a quick description on each one?\n\nI'm especially interested to learn about HIMX, been looking for a great semiconductor company, what makes these guys better than say a qualcomm or Micron?",
        "created_utc": 1588827142,
        "id": "fpqnm73",
        "permalink": "/r/stocks/comments/gelimt/what_are_your_favourite_disruptivefuturistic/fpqnm73/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588855942.0
    },
    {
        "author": "Kilstar",
        "body": "SMH\n\nHere's their 25 holdings as of now:\n\n1\tTaiwan Semiconductor Manufacturing Co L\tTSM US\t3,797,828\t$201,778,601.64 \t12.05%\n2\tIntel Corp\tINTC US\t2,979,264\t$178,696,254.72 \t10.68%\n3\tNvidia Corp\tNVDA US\t426,343\t$124,611,532.04 \t7.44%\n4\tBroadcom Inc\tAVGO US\t309,923\t$84,181,285.26 \t5.03%\n5\tAsml Holding Nv\tASML US\t288,591\t$83,238,302.13 \t4.97%\n6\tTexas Instruments Inc\tTXN US\t715,786\t$83,081,281.02 \t4.96%\n7\tQualcomm Inc\tQCOM US\t1,021,613\t$80,370,294.71 \t4.80%\n8\tAnalog Devices Inc\tADI US\t726,726\t$79,649,169.60 \t4.76%\n9\tAdvanced Micro Devices Inc\tAMD US\t1,501,245\t$78,650,225.55 \t4.70%\n10\tMicron Technology Inc\tMU US\t1,569,263\t$75,152,005.07 \t4.49%\n11\tNxp Semiconductors Nv\tNXPI US\t671,859\t$66,897,000.63 \t4.00%\n12\tApplied Materials Inc\tAMAT US\t1,307,056\t$64,934,542.08 \t3.88%\n13\tLam Research Corp\tLRCX US\t247,995\t$63,308,163.60 \t3.78%\n14\tKla Corp\tKLAC US\t324,060\t$53,175,005.40 \t3.18%\n15\tXilinx Inc\tXLNX US\t582,414\t$50,902,983.60 \t3.04%\n16\tCadence Design Systems Inc\tCDNS US\t604,698\t$49,059,148.74 \t2.93%\n17\tStmicroelectronics Nv\tSTM US\t1,745,035\t$44,620,544.95 \t2.67%\n18\tSkyworks Solutions Inc\tSWKS US\t393,114\t$40,836,682.32 \t2.44%\n19\tMicrochip Technology Inc\tMCHP US\t451,468\t$39,607,287.64 \t2.37%\n20\tMaxim Integrated Products Inc\tMXIM US\t556,880\t$30,617,262.40 \t1.83%\n21\tMarvell Technology Group Ltd\tMRVL US\t999,064\t$26,714,971.36 \t1.60%\n22\tQorvo Inc\tQRVO US\t225,071\t$22,063,710.13 \t1.32%\n23\tTeradyne Inc\tTER US\t344,780\t$21,562,541.20 \t1.29%\n24\tUniversal Display Corp\tOLED US\t100,420\t$15,075,050.40 \t0.90%\n25\tOn Semiconductor Corp\tON US\t824,746\t$13,233,049.57 \t0.79%\n26\tOther/Cash\t\t0\t$1,889,767.67 \t0.11%",
        "created_utc": 1588432827,
        "id": "fp9r6ht",
        "permalink": "/r/stocks/comments/gbe5cs/rstocks_daily_discussion_fundamentals_friday_may/fp9r6ht/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588461627.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Great choice.  Nokia was having so many issues with their 5G rollout that they had to bring in Marvell to make their chips.\n\n[https://www.lightreading.com/5g/nokia-hires-marvell-to-fix-5g-problems/d/d-id/757984](https://www.lightreading.com/5g/nokia-hires-marvell-to-fix-5g-problems/d/d-id/757984)\n\nI am long on T, VZ, TMUS, QCOM, ABB, BB, MSFT, AMZN, TSLA, TSM, AMAT, ERIC for 5G.\n\nNokia might be a player in the 5G world, but they are currently in the worst shape of all of those stocks I just mentioned and keep messing up to the point that I'm not even sure I would see much return by investing in them.  Some of the biggest returns won't even be from the infrastructure, but the companies who will take advantage of the network to improve automation, autonomous driving, and all of the semiconductors, processors, and sensors that will power all of these innovations.",
        "created_utc": 1588861332,
        "id": "fprss0k",
        "permalink": "/r/investing/comments/gf2bdb/5g_stocks/fprss0k/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588890132.0
    },
    {
        "author": "turello9",
        "body": "Qualcomm, Skyworks are good bets",
        "created_utc": 1588870188,
        "id": "fpsah50",
        "permalink": "/r/stocks/comments/gfa25q/best_stocks_for_5g/fpsah50/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588898988.0
    },
    {
        "author": "savi9876",
        "body": "I would think there’s gonna be 2 big camps, Huawei and anti-Huawei. \n\nSo countries/companies going the anti-Huawei route will do Nokia and Ericsson. \n\nIs there really much info right now to differentiate Nokia &amp; Ericsson ? \n\nDo we really know much about 5G in general, it’s so early. \n\nFor the smartphone side rather than infrastructure it seems Qualcomm has a monopoly.",
        "created_utc": 1588839166,
        "id": "fpr1ljn",
        "permalink": "/r/investing/comments/gf2bdb/5g_stocks/fpr1ljn/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588867966.0
    },
    {
        "author": "Leroy--Brown",
        "body": "I increased my allocation of AMT, BAM, WMT, and SCHB. SCHB was the one that had the largest increase in my allocation. \n\nI initiated positions in V, MSFT, and sold JPM.\n\nI left DIS (cost basis $97-98) T ($33) and QCOM (55) alone and let it ride.  In fact I let a lot of stuff ride, JPM was the only one I sold, but I'm still tempted to part ways with PYPL and SQ.",
        "created_utc": 1588996143,
        "id": "fpy50t7",
        "permalink": "/r/investing/comments/gg5t84/six_weeks_ago_i_went_long_on_dis_rcl_nclh_amc_rgs/fpy50t7/",
        "score": 1,
        "subreddit": "investing",
        "created": 1589024943.0
    },
    {
        "author": "SorrowsSkills",
        "body": "&gt; DKNG or PENN as online sports betting becomes commonplace \n\nAre there any studies/statistics to show how fast this industry is growing? I'd love to educate myself in it. I've been looking into ERI, MGM, BOYD and Penn already but never really gave any attention to DKNG, Penns also probably been on the bottom of my list as well for gambling stocks, but I can definitely see the room for growth in online gambling via a phone in the future. \n\n&amp;#x200B;\n\n&gt;Looking for companies working 5G infrastructure as it pertains to cloud computing, as I think the future of consumer networks is wireless, with only larger commercial pipes needing to be hard\n\nI've been trying to find a good 5g play as well. Right now I'm looking into qualcomm and MU.\n\n&gt; I think Azure will win the cloud war for the majority of government and large caps so also looking for companies on the forward development side of that, especially in business intelligence, how it's used, etc. \n\nAnother industry I know nothing about haha. I'm looking to get into microsoft if we see another dip and I'm already invested in Amazon which is currently the leader in cloud. I know microsoft is much better at marketing their products to big caps though which will further their revenues a lot. From what I read earlier (on reddit to be fair..) is that as of right now Amazon undeniably has the better cloud services (apparently microsoft is slightly lacking in their quality) but microsoft has been making up for this with their hard line  marketing towards big caps so I can see that being beneficial for them too. I think everything cloud is going to be big in general, so investing in anyone doing cloud is a good investment in the long run probably. \n\nI'm also invested in Alibaba which is investing HEAVILY into their cloud service and will probably be the biggest cloud service in China and likely surrounding nations within their sphere of influence so I definitely think they're great as well.",
        "created_utc": 1588786730,
        "id": "fpolz2j",
        "permalink": "/r/stocks/comments/gelimt/what_are_your_favourite_disruptivefuturistic/fpolz2j/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588815530.0
    },
    {
        "author": "Avaronah",
        "body": "What about QCOM?",
        "created_utc": 1588662070,
        "id": "fpjay57",
        "permalink": "/r/investing/comments/gdkx3v/nvdaamdmsftaapl_which_has_the_most_potential_for/fpjay57/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588690870.0
    },
    {
        "author": "Shaun8030",
        "body": "The semiconductor ETF holdings are solid Nvidia , Amd , Intel , Qualcomm , Broadcom  , it will rebound I wouldn't worry there will be a high demand for semis in the future 5g,  AI, robotics , gaming , mobile hardware etc. It was up 50 to 60% in 2019",
        "created_utc": 1589442547,
        "id": "fql10c8",
        "permalink": "/r/CanadianInvestor/comments/gjd1me/when_to_take_a_loss/fql10c8/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1589471347.0
    },
    {
        "author": "Shaun8030",
        "body": "I was thinking Soxx but it's very cyclic and dependent on trade with China. Also the big chip makers Nvidia , amd, Qualcomm , Broadcom , Intel , tsm , nxp etc are are all in the other ETFs anyways .",
        "created_utc": 1589428954,
        "id": "fqkjw9e",
        "permalink": "/r/StockMarket/comments/gjbfrj/all_tech_etf_portfolio/fqkjw9e/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1589457754.0
    },
    {
        "author": "thebrylcreembounce",
        "body": "Calls on banks Friday/Monday then big 5G players late next week Qualcomm, Corning, etc.",
        "created_utc": 1589506254,
        "id": "fqo2jby",
        "permalink": "/r/wallstreetbets/comments/gjtxjd/what_are_your_moves_tomorrow_may_15_2020/fqo2jby/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589535054.0
    },
    {
        "author": "WSBankrupt",
        "body": "QCOM, INTC and some eurotrash like NOK and ERIC are going to fuck so hard",
        "created_utc": 1589542084,
        "id": "fqpbyyc",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpbyyc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570884.0
    },
    {
        "author": "scopolamine",
        "body": "&gt;Based on what I know, if the US further blocks key technology supply to Huawei, China will activate the \"unreliable entity list\", restrict or investigate US companies such as Qualcomm, Cisco and Apple, and suspend the purchase of Boeing airplanes. - Global Times Chinese reporter",
        "created_utc": 1589542109,
        "id": "fqpbzvg",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqpbzvg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589570909.0
    },
    {
        "author": "Redknife11",
        "body": "Similar been buting QCOM and TMUS",
        "created_utc": 1588563746,
        "id": "fpf7mqz",
        "permalink": "/r/wallstreetbets/comments/gcx8rv/what_are_your_moves_tomorrow_may_04_2020/fpf7mqz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588592546.0
    },
    {
        "author": "Lebronsweedman",
        "body": "Qualcomm sucks",
        "created_utc": 1588590705,
        "id": "fpg0wfu",
        "permalink": "/r/stocks/comments/gd9hjk/why_is_qualcom_and_3m_going_down_so_much_even/fpg0wfu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588619505.0
    },
    {
        "author": "WSBankrupt",
        "body": "Bought more C and ABBV on discount on Fri.  Pretty stoked.  Next up is comms/5g.\n\nLooking at QCOM for SOC's and essentially a full RF solution, INTL + MRVL for base station chips and have NOK leaps.",
        "created_utc": 1588415514,
        "id": "fp95uwo",
        "permalink": "/r/wallstreetbets/comments/gbpcs2/weekend_discussion_thread_for_the_weekend_of_may/fp95uwo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588444314.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Dude, since you still do not seem to get it with my portfolio, here you go:  [https://m1.finance/jREK76aA6MDy](https://m1.finance/jREK76aA6MDy)\n\nFeel free to backtest it all you want.\n\nI'll even help you get started.\n\nHere's the sectors with subsequent tickers: [https://imgur.com/a/RJsacvV](https://imgur.com/a/RJsacvV)\n\nHere's the Technology sector pie I have created since it has the most companies: [backtest](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=1985&amp;firstMonth=1&amp;endYear=2020&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;showYield=false&amp;reinvestDividends=true&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=XLK&amp;allocation1_1=100&amp;symbol2=QCOM&amp;allocation2_2=7&amp;symbol3=AVGO&amp;allocation3_2=7&amp;symbol4=TSM&amp;allocation4_2=7&amp;symbol5=TXN&amp;allocation5_2=6&amp;symbol6=IBM&amp;allocation6_2=6&amp;symbol7=AMAT&amp;allocation7_2=7&amp;symbol8=FFIV&amp;allocation8_2=6&amp;symbol9=MSFT&amp;allocation9_2=6&amp;symbol10=SWKS&amp;allocation10_2=6&amp;symbol11=INTC&amp;allocation11_2=6&amp;symbol12=ADBE&amp;allocation12_2=6&amp;symbol13=VMW&amp;allocation13_2=6&amp;symbol14=BB&amp;allocation14_2=6&amp;symbol15=NOW&amp;allocation15_2=6&amp;symbol16=ERIC&amp;allocation16_2=6&amp;symbol17=NOK&amp;allocation17_2=6)\n\nHere's the ETFs vs SPY: [backtest](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=1985&amp;firstMonth=1&amp;endYear=2020&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;showYield=false&amp;reinvestDividends=true&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=SPY&amp;allocation1_1=100&amp;symbol2=VOOG&amp;allocation2_2=8&amp;symbol3=MGK&amp;allocation3_2=8&amp;symbol4=XLG&amp;allocation4_2=8&amp;symbol5=QQQ&amp;allocation5_2=8&amp;symbol6=ARKF&amp;allocation6_2=8&amp;symbol7=ARKG&amp;allocation7_2=8&amp;symbol8=ARKK&amp;allocation8_2=8&amp;symbol9=ARKQ&amp;allocation9_2=8&amp;symbol10=ARKW&amp;allocation10_2=8&amp;symbol11=VBK&amp;allocation11_2=7&amp;symbol12=VOT&amp;allocation12_2=7&amp;symbol13=ESPO&amp;allocation13_2=7&amp;symbol14=CLOU&amp;allocation14_2=7)",
        "created_utc": 1589416811,
        "id": "fqjxxzu",
        "permalink": "/r/investing/comments/gix81w/why_picking_individual_stocks_might_actually_make/fqjxxzu/",
        "score": 1,
        "subreddit": "investing",
        "created": 1589445611.0
    },
    {
        "author": "BrockKetchum",
        "body": "QCOM is good. They're gonna be making NFC stuff",
        "created_utc": 1589483861,
        "id": "fqmurat",
        "permalink": "/r/wallstreetbets/comments/gjcaqq/jim_cramer_reveals_his_playbook_says_investors/fqmurat/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589512661.0
    },
    {
        "author": "EAH5515",
        "body": "If you're looking to hold for a while Boeing might be something to look into their stock took a major hit because of the corona virus. They are the largest air craft manufacturer and they have quite a few DOD contracts. So I think in a few years they'll be back to their previous stock price and they've always been consistent with their dividends. Although I wouldn't recommend investing anymore than your willing to lose because even though there is the chance that you'll make 200 a share they're in serious financial trouble if they aren't able to secure some kind of bail out but I don't think that'll be a problem because they're such a large part of our economy.\n\n\nI'd also recommend looking into amd because they are producing the processors for both the PS5 and the new Xbox \n\nQualcomm or anything 5G related should also be a pretty safe bet",
        "created_utc": 1588982179,
        "id": "fpxgeje",
        "permalink": "/r/RobinHood/comments/gg3c90/if_you_had_50000_saved_to_spend_in_the_stock/fpxgeje/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1589010979.0
    },
    {
        "author": "Redknife11",
        "body": "Me? Aside from my TMUS and QCOM",
        "created_utc": 1588967576,
        "id": "fpwpgbz",
        "permalink": "/r/wallstreetbets/comments/gfqjq5/daily_discussion_thread_for_may_08_2020/fpwpgbz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588996376.0
    },
    {
        "author": "PM_MeUsernameIdeas",
        "body": "C, HD, IWM, LVS, QCOM, QQQ, SPY, PLUG, JCP, ROKU\n\nMix of CCS, PCS, puts, calls, LEAPs",
        "created_utc": 1588900106,
        "id": "fptx8ta",
        "permalink": "/r/wallstreetbets/comments/gfj6pm/what_are_you_holding/fptx8ta/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588928906.0
    },
    {
        "author": "WSBankrupt",
        "body": "I hope tech takes a hit today.  Want to get into QCOM and MRVL.",
        "created_utc": 1588549055,
        "id": "fpek1xz",
        "permalink": "/r/wallstreetbets/comments/gcx8rv/what_are_your_moves_tomorrow_may_04_2020/fpek1xz/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1588577855.0
    }
]