[
    {
        "author": "thesysblt",
        "body": "...with a slew of big names set to report this week: IBM, INTC, JNJ, PG, AXP, TXN, NFLX, UNP. Watch for strong results out of all of em.",
        "created_utc": 1579466000,
        "id": "ff07g5j",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1579494800.0
    },
    {
        "author": "Veliladon",
        "body": "&gt;I’m open to advice, if anyone has anything similar for less(price wise) or better.\n\nTake the money you would have spent on a V share and sell the 1/24 132/130 put credit spread @33c on IBM using your $200 as collateral. \n\nInstead of making $33 in two years you'll make it in under two weeks.\n\nI'm not bullshitting either. [I do have actual skin in the game on this one](https://i.imgur.com/cjtpJXY.jpg) and if you don't make money, I probably won't either.",
        "created_utc": 1579490297,
        "id": "ff205so",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1579519097.0
    },
    {
        "author": "Luka-Step-Back",
        "body": "At one point, IBM sold orders of magnitude more computers than Apple.",
        "created_utc": 1578081886,
        "id": "fcykx63",
        "score": 12,
        "subreddit": "investing",
        "created": 1578110686.0
    },
    {
        "author": "APHAbaghodler",
        "body": "LOLWUT? IBM rallying because a woman CEO stepped down? LOL whatever.. i'll take it, saved my IBM calls BIGLY.. holy fuck.",
        "created_utc": 1580425696,
        "id": "fg1ejts",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1580454496.0
    },
    {
        "author": "69SluttyPoptarts",
        "body": "IBM is such a trash company",
        "created_utc": 1580434890,
        "id": "fg1xy5q",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1580463690.0
    },
    {
        "author": "Astronaut100",
        "body": "Dow would've already been at 30000 if not for Boeing's fuckups. Also, if it didn't have Boomer tickers like IBM and GE.",
        "created_utc": 1579489130,
        "id": "ff1yj7y",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1579517930.0
    },
    {
        "author": "flex674",
        "body": "IBM was bad. GE was a nightmare.",
        "created_utc": 1578250853,
        "id": "fdavpxh",
        "score": 7,
        "subreddit": "investing",
        "created": 1578279653.0
    },
    {
        "author": "JoeFlipperhead",
        "body": "Hey Kiddos,\n\nI just learned about this newfangled Reddit website.  Pretty Neat.  Anywho, I'd like to impart some sage wisdom to all you young whipper-snappers.\n\n1) Diversification is key.  Some stocks go down at times.\n\n2) Invest heavily in safe securities:  IBM, GE, Sears (might be down, but it's bound to make a comeback; great catalog)\n\n3) High Yield savings accounts are wonderful for your portfolio\n\nLow Risk tolerance, slow and steady, conservative investing... that's the keys to success!\n\nSincerely,\n\nMort",
        "created_utc": 1580412073,
        "id": "fg0or9q",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1580440873.0
    },
    {
        "author": "daytrader987654321",
        "body": "Lol is IBM a joke? It mooned 5% because the CEO is stepping down? lol",
        "created_utc": 1580428013,
        "id": "fg1j2vk",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1580456813.0
    },
    {
        "author": "Vast_Cricket",
        "body": "Stock Activists tried to boot her out unsuccessfully.  Actually she has a computer science background from NWU but had no vision or finance skills.  Rometty  is fairly lucky most firms will not let her stay that long. She was not well liked by IBM employees.",
        "created_utc": 1580426691,
        "id": "fg1gik5",
        "score": 6,
        "subreddit": "investing",
        "created": 1580455491.0
    },
    {
        "author": "TheAmillion12",
        "body": "OP assuming IBM does well.  Are you full blown retarded?",
        "created_utc": 1579487255,
        "id": "ff1vq9r",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1579516055.0
    },
    {
        "author": "easythrees",
        "body": "Damn, beat me to it. This could be a good move for IBM, more push into cloud and AI.",
        "created_utc": 1580423823,
        "id": "fg1aq3a",
        "score": 5,
        "subreddit": "investing",
        "created": 1580452623.0
    },
    {
        "author": "vaidasy",
        "body": " Carnival Cruise Lines (CCL)\n\nCarnival Cruise Lines maintains shareholder benefits and rewards for all of it’s subsidiary companies. Shareholders can get an onboard credit per stateroom based on how long they sail.\n\nFor example, for 2015, you can get the following on-board credits:\n\n* Cruises over 14 days: $250\n* Cruises 7 to 13 days: $100\n* Cruises under 6 days: $50\n\nThese perks apply to all of their cruise lines: Carnival Cruise Line, Princess Cruises, Holland America, Seabourn, Cunard, and Costa Cruises.\n\nYou can learn more about these shareholder perks [here](http://phx.corporate-ir.net/phoenix.zhtml?c=140690&amp;p=irol-sharebenefit).\n\n### Churchill Downs (CHDN)\n\nChurchill Downs offers all of their shareholders (as long as they own 100 or more shares) 2 free passes for general admission to any Churchill Downs-owned facility. To receive the offer, shareholders must own the 100 shares by December 31 of the year, and the passes will be provided in the first quarter of the following year.\n\nThe passes allow free general admission at all our racing and off-track betting facilities. They are valid for an unlimited number of visits during the year, as well as general admission for the Kentucky Oaks and the Kentucky Derby at Churchill Downs.\n\nFor more information, learn about [Churchill Down’s perks here](http://www.churchilldownsincorporated.com/investors/general_information/shareholder_pass).\n\n### Ford (F)\n\nFord has always been known to reward it’s shareholders with a discount, but if you search their website, there is nothing to be found. So I reached out to their Investors Relations Department, and here’s what they said.\n\nAs a special “Thank You” to Ford Motor Company shareholders, the Investor Relations Department offers the opportunity to participate in the “Friends &amp; Neighbors” Special Vehicle Pricing Privilege (also known as the X-Plan).  In order to qualify, you:\n\n1. Must be a current shareholder of Ford Motor Company common stock (Ticker: F).\n2. Must own a minimum of one hundred (100) shares of Ford Motor Company common stock (Ticker: F).\n3. Need to have held the minimum number of shares of Ford Motor Company common stock for the past 6 months or longer.\n\nIf you meet all of the above criteria, you are more than welcome to contact Investor Relations via phone at: 1-800-555-5259; or email www.stockinf@ford.com for further information about available vehicle discounts for shareholders.\n\n### Intercontinental Hotels Group (IHG)\n\nThe Intercontinental Hotels Group offers shareholders discounts at their hotels if they book through a private website. For further details please contact the Company Secretariat department at [companysecretariat@ihg.com](mailto:companysecretariat@ihg.com).\n\nIntercontinental Hotels includes the brands: Intercontinental, Crowne Plaza, Holiday Inn, Staybridge Suites, Candlewood Suites, and Hotel Indigo.\n\n### International Business Machines (IBM)\n\nIMB doesn’t sell much direct to consumers, but it does have a Shareholders Store where it sells computer equipment at up to 25% off. You can find refurbished desktop and laptop computers, accessories, and more, from manufacturers such as Lenovo.\n\nHere is the link to the [Lenovo IMB Shareholder Store](https://shop.lenovo.com/ibmeppstockca/ca/en/legal/).\n\n### Kimberly-Clark (KMB)\n\nKimberly-Clark offers shareholders a special gift box they can purchase from the company for $24.45 (add $7 for Alaska and Hawaii). The box comes with samples of many of the companies’ products, such as Kleenex and diaper wipes, and also has over $25 in coupons for the companies’ products.\n\nKimberly-Clark says that more than 3 million boxes have been shared since it started this program in 1957.\n\nYou can learn more about the [Kimberly-Clark gift box program here](http://www.kcgiftbox.com/).\n\n### Norwegian Cruise Lines (NCL)\n\nNorwegian Cruise Lines provides similar benefits to the other cruise lines when it comes to rewarding their shareholders.\n\nFor 2015, Norwegian Cruise Lines is offering the following on-board credits:\n\n* Cruises over 14 days: $250\n* Cruises 7 to 13 days: $100\n* Cruises under 6 days: $50\n\nNorwegian owns the following brands that this can be applied to: Norwegian Cruise Lines, Oceania Cruises, and Regent Seven Seas Cruises.\n\nRemember, you must submit paperwork to Investor Relations at least 15 days in advance of your cruise. Learn more about the benefit [here](http://files.shareholder.com/downloads/ABEA-5WOY6H/0x0x681823/FC8230FE-82FE-4331-B5F6-28A7E543D773/blankPDF.pdf).\n\n### Royal Caribbean Cruise Lines (RCL)\n\nRoyal Caribbean Cruise Lines offers the same benefits as the other cruise lines, but adds one additional tier for shareholders.\n\nFor 2015, Royal Caribbean is offering the following ob-board credits for shareholders:\n\n* Cruises over 14 days: $250\n* Cruises 10 to 13 days: $200\n* Cruises 6 to 9 days: $100\n* Cruises under 5 days: $50\n\nRoyal Caribbean owns the following brands: Royal Caribbean International, Celebrity Cruises, and Azamara Club Cruises.\n\n### Willamette Valley Vineyards (WVVI)\n\nWillamette Valley Vineyards is a small publicly traded company that owns several vineyards in Oregon. It offers shareholders several perks (really catered to wine lovers):\n\n* Admissions to special events at the winery.\n* Priority on the purchase of limited production wines, wine futures, and discounted items.\n* Discounted pricing of selections purchased through the WVV Wine Club.\n* Priority use of the Winery’s tasting and hospitality facilities for events (open dates only).\n* Personalized winery business cards, the initial set is complementary.",
        "created_utc": 1579465577,
        "id": "ff0609x",
        "score": 4,
        "subreddit": "stocks",
        "created": 1579494377.0
    },
    {
        "author": "chaney3",
        "body": "$IBM has been a joke for years. The company is the ultimate clown as far as monetization. $IBM has so much potential just in its research and developmental fields alone and literally refuses to generate any meaningful growth.",
        "created_utc": 1580428394,
        "id": "fg1jtp1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1580457194.0
    },
    {
        "author": "TigerKingz",
        "body": "Ginny Rometty has no vision. Her background is in the consulting business which is the problem with IBM. Consulting is a DOA with cloud now the mainstream. \n\nHer IBM business plan was to leach off the dead consulting business and redirect profits to bizarre moonshots like Watson (which is garbage and doesnt work) and Quantum computing (decades away from even the sight of a profit). \n\nShould of been sacked 5 years ago when it was clear and obvious cloud was the way forward. Now IBM is playing catch up to even Oracle lol.",
        "created_utc": 1580429451,
        "id": "fg1lwf4",
        "score": 4,
        "subreddit": "investing",
        "created": 1580458251.0
    },
    {
        "author": "mustaine42",
        "body": "Looking at her background it seems like she only held technical positions for 10 years or so, and then primarily held sales/management positions before becoming CEO. Really doesn't seem like the right background for tech company trying to lead in cloud computing, AI, and quantum computing. Not too surprising that IBM has lagged the competition.\n\nKrishna is the opposite. Looks like he has spent essentially his entire life in technical positions at IBM. He also has a PhD rather than an MBA, which is generally rare to see for CEOs or high executive positions. This guy has been balls deep in heavy research&amp;development for most of his life and is probably one of the most brilliant people in IBM. He is inline with the current trend of technical based CEOs who have been leading the technology sector in the last 5 years. The previous CEO was not similar to the trend (Tim Cook also is not similar to that trend, for what it's worth). \n\nAlso pointing out the obvious that he is from India and immigrated (was not born in, huge difference in mindset) to the United States. Similar mold to guys like Nadella, Pichai, Musk. This guy literally checks every box and then some for what I imagine you would want as a CEO for a tech company in 2020. IBM might actually dig themselves out of their rut with him leading the vision. Maybe.\n\nI sold some IBM stock recently and this has me intrigued to maybe buy back into it again.",
        "created_utc": 1580428864,
        "id": "fg1krkc",
        "score": 4,
        "subreddit": "investing",
        "created": 1580457664.0
    },
    {
        "author": "mwbbrown",
        "body": "&gt;almost guaranteed\n\nI think you are defining technology too broadly. Ford wasn't a \"technology stock\" or at least how we would use the phrase now. They disrupted the market and kicked off a revolution in mobility. But would you consider an investment in them in 1920 to be the same as Amazon now? In hindsight they both disrupted the market and made lots of money, but can you tell me what the 3rd stock in that chain over the next 30 years would be? \n\n&amp;#x200B;\n\nSears, Standard Oil, Kodak, IBM, Amazon, Facebook are all \"new technology disrupting the market\" stocks, but I wouldn't call them \"tech\" all today. Investing in tech today would overlook biomedical or Automotive stocks in the next 20 years, all of which might use technology to disrupt the market but wouldn't be billed as \"tech stocks\" \n\n&amp;#x200B;\n\nYou might be right that self driving cars change everything, but who is going to win because of that? Do you invest in Tesla and Alphabet, or is there a massive breakthrough and all the know how in the world doesn't help you make cars, so GM becomes the  leader when they include it in all of their cars and sell to everyone. \n\n&amp;#x200B;\n\nThe diversity in investing helps cover those blind spots.",
        "created_utc": 1578325520,
        "id": "fddw9bz",
        "score": 4,
        "subreddit": "investing",
        "created": 1578354320.0
    },
    {
        "author": "ilovewsb",
        "body": "So no wonder Disney is a piece of shit. Doesn’t have a stock buyback program like Apple or even fucking IBM. Stock can easily be fucking manipulated by MMs. Garbage Ima start selling spreads And buy calls on something else",
        "created_utc": 1578956867,
        "id": "febabmc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1578985667.0
    },
    {
        "author": "acgmph",
        "body": "$IBM went Hare Krishna. They looked at $MSFT and $GOOG and saw their competitive advantage was the Indian CEO...",
        "created_utc": 1580420558,
        "id": "fg14gh4",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1580449358.0
    },
    {
        "author": "fco1017",
        "body": "IBM got rid of the chic.  they might actually do something now.",
        "created_utc": 1580420461,
        "id": "fg14a4w",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1580449261.0
    },
    {
        "author": "LeonardoRafaell",
        "body": "Ok man, I'll help you.\nYou need a high yield income portfolio? How much do you have?\nMany baby boomers are in this situation. \nI'll give you the same advice I gave my dad.\n\n1) I advise to sell your house/downsize/move to cheaper area.\n2) sell your useless shit. Extra cars, boats,  etc..\n3) scrape all your cash together and invest it\n\nNow, lets say you have 300k, for example. You need about a 10% return to get a 30k income. Then you have probably 20k from SSI benefits,  so 50k salary. Not bad. But how do you get a safe 10% yield? Well, you pick stocks very carefully. Try to get 5% from dividends, and 5% from price appreciation. \n\nHere are some of my picks:\nABBV\nM\nSKT\nCTL\nIRM\nNEE\nTXN\nIBM\nBX\nAPO\nBAM\nKHC\nAMGN\nTSM\nOTEX\nTER\nUL\nNVO\nTM\nMRK\nBMY\n\nnow that is a diversified folio! You should get 4-5% paid out in dividends,  and then be able to pull 4-5% off each year in gains. That'll get your 10% and then the money should last if the market holds up in the 2020s. If it goes down, just stay invested. Lower your purchases, live off social sec for 1 year. Like that.  Alright good luck peace",
        "created_utc": 1579397827,
        "id": "fevilf2",
        "score": 4,
        "subreddit": "investing",
        "created": 1579426627.0
    },
    {
        "author": "jukito1",
        "body": "Need ibm to join the bull gang",
        "created_utc": 1579296700,
        "id": "feo8tco",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1579325500.0
    },
    {
        "author": "ookiemonsterx",
        "body": "&gt; Take the money you would have spent on a V share and sell the 1/24 132/130 put credit spread @33c on IBM using your $200 as collateral.\n&gt; \n&gt; Instead of making $33 in two years you'll make it in under two weeks.\n&gt; \n&gt; I'm not bullshitting either. I do have actual skin in the game on this one and if you don't make money, I probably won't either.\n\nDo you mind elaborating a little bit more? Im sure there are others like me who don't follow.",
        "created_utc": 1579498885,
        "id": "ff2aojx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1579527685.0
    },
    {
        "author": "thesysblt",
        "body": "IBM, INTC, JNJ, PG, AXP, TXN, NFLX, UNP all report this week. Watch for strong results out of all of em.",
        "created_utc": 1579465801,
        "id": "ff06vil",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1579494601.0
    },
    {
        "author": "commodorenorrington",
        "body": "For what it’s worth, I’m not putting my cash in any aerospace stock right now. Personally, I think the airline industry is one of the most significant industries at risk for serious disruption in the next 10 years. Think about how quickly Tesla rose to unseat historical market dominators like Ford and GM. \n\nSpecifically though, I find Boeing to be the IBM of its industry; it’s too successful and profitable conducting business as usual. I don’t think it’s going anywhere, but I don’t think it will be the powerhouse it is today in 15 years. \n\nThis belief has little to do with the Max fiasco, though I do think it’s indicative of how complacent and stuck in its ways the company is.",
        "created_utc": 1579369752,
        "id": "feswtmh",
        "score": 3,
        "subreddit": "investing",
        "created": 1579398552.0
    },
    {
        "author": "n0tfakenews",
        "body": "&gt; Now IBM is playing catch up to even Oracle lol.\n\nLOL so true, and so embarrassing.  I'm not even exaggerating, but she's gotta be one of the top 10 *worst* F500 CEOs of the last 20 years (maybe even top 5).",
        "created_utc": 1580429598,
        "id": "fg1m629",
        "score": 3,
        "subreddit": "investing",
        "created": 1580458398.0
    },
    {
        "author": "TheSavingsGuy",
        "body": "While Buffett is my idol, he has made some mistakes. \n\nHe famously bought a stake in IBM (which floundered while the rest of the market soared) and then later sold it. \n\nBuffett also sold Disney stock years ago and missed out on the gains of the past couple decades.",
        "created_utc": 1578355327,
        "id": "fdf7ulf",
        "score": 2,
        "subreddit": "investing",
        "created": 1578384127.0
    },
    {
        "author": "arrty",
        "body": "Kill ibm. Buy a cloud company",
        "created_utc": 1578895228,
        "id": "fe6lt2r",
        "score": 2,
        "subreddit": "stocks",
        "created": 1578924028.0
    },
    {
        "author": "rebelde_sin_causa",
        "body": "not including dividends your DJIA index results in roughly x6 your money (rounding up), so $1.8 million for your initial $300k investment\n\nwith $10k a piece invested into each of the 30 components......\n\nUTX x30 over same period... $300k\n\nDIS x18...… $180k\n\nMCD x27..... $270k\n\nAXP x16...… $160k\n\nBA x13...… $130k\n\nPG x12...… $120k\n\nCAT x24..... $240k\n\nJPM x17..... $170k\n\nMMM x7...… $70k\n\nIBM, XOM, MRK x5 each..... $150k\n\nCVX x6...… $60k\n\nKO x10..... $100k\n\nmost of those I rounded down\n\nInternational Paper, AT&amp;T, GE, Goodyear, and duPont Nemours are basically flat for this whole period (again, not including dividends), so we'll call that $50k\n\nBut that gets us to $2 million before we have to wade into the weeds\n\nTexaco was acquired by Chevron in 2001, don't have readily available numbers for that\n\nDitto for Westinghouse being renamed CBS and then being acquired by Viacom in the 1990s\n\nand Union Carbide being acquired by Dow Chemical, Allied Signal by Honeywell\n\nAlcoa split into two different companies, I don't have the old data for the old Alcoa\n\nSo we're probably in the ballpark of $2.5 - $3 million before we have to get to our total losses, Sears, Woolworth's, GM, Kodak, and Bethlehem Steel\n\nwith no dividends factored in\n\nSo we can call it tremendously outperform",
        "created_utc": 1579292926,
        "id": "fenz2vb",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1579321726.0
    },
    {
        "author": "Veliladon",
        "body": "I only had one thankfully. I had success in 5 other spreads (KMB, VFC, LUV, 2xTXN) and my IBM stuff is still up in the air. One is $2 and the other is $3 OTM so fingers crossed.",
        "created_utc": 1579817386,
        "id": "ffdblpa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1579846186.0
    },
    {
        "author": "stenlis",
        "body": "You also can't build building sized mainframes out of thin air. Didn't help IBM one bit.  \n\nIf space x can disrupt space industry I don't see why Boeing's field couldn't be ripe for picking.",
        "created_utc": 1579373179,
        "id": "feta1wz",
        "score": 2,
        "subreddit": "investing",
        "created": 1579401979.0
    },
    {
        "author": "stenlis",
        "body": "I'm sure IBM had fat military contracts back in the day as well.",
        "created_utc": 1579372475,
        "id": "fet7jlj",
        "score": 2,
        "subreddit": "investing",
        "created": 1579401275.0
    },
    {
        "author": "dolpherx",
        "body": "I doubt it. IBM is not in the same league as those other companies. IBM is considered to be the in the same league of companies that are being disrupted by the other large mega tech companies.\n\nWhat does IBM have going for them?",
        "created_utc": 1580431339,
        "id": "fg1pkem",
        "score": 2,
        "subreddit": "investing",
        "created": 1580460139.0
    },
    {
        "author": "D14DFF0B",
        "body": "AI is buzzword, *especially*at IBM: https://spectrum.ieee.org/biomedical/diagnostics/how-ibm-watson-overpromised-and-underdelivered-on-ai-health-care",
        "created_utc": 1580432312,
        "id": "fg1rxj3",
        "score": 2,
        "subreddit": "investing",
        "created": 1580461112.0
    },
    {
        "author": "Jordykins850",
        "body": "VIAC can be good if they announce good Picard #’s. CSCO could continue run if sentiment remains positive, IBM earnings could be a key one to watch.. if they boost guidance, CSCO will probably rise as well.\n\nCRM mostly always a smart play, especially now.\n\nI think CRWD is dogshit currently. I just don’t like that entire marketplace though, outside of Palo and Okta.. and even they’re hurt by the glut overall. Needs consolidation.",
        "created_utc": 1579489099,
        "id": "ff1yhnw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1579517899.0
    },
    {
        "author": "TheSurfNSnow",
        "body": "IBM? What is this, 1983?",
        "created_utc": 1579297014,
        "id": "feo9m1q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1579325814.0
    },
    {
        "author": "chodmode2",
        "body": "not worth the premium. I worked for IBM in the past and I refuse to touch that shit",
        "created_utc": 1579299518,
        "id": "feofkfd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1579328318.0
    },
    {
        "author": "CorneredSponge",
        "body": "1. Sony's recent over ear headphones and fully wireless earbuds have widely been considered the best in the industry for the past year (Source: Various tech YouTubers and review websites)\n\n2. PlayStation, Peripherals, Components, etc. are all currently quite profitable. Only their mobile business doesn't turnover a profit.\n\n3. IBM is also quite old. While it lacks the $500B+ of FAANG, it still has almost double a market cap than Sony. Age may have an influence, but don't overstate it.",
        "created_utc": 1580247910,
        "id": "ffurex1",
        "score": 2,
        "subreddit": "investing_discussion",
        "created": 1580276710.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM BIG BLUE",
        "created_utc": 1580420722,
        "id": "fg14r1z",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1580449522.0
    },
    {
        "author": "n0tfakenews",
        "body": "Considering most large/mega tech companies have run up tremendously over the past 2 years - except IBM - perhaps this could be the catalyst for some serious gains in IBM soon.",
        "created_utc": 1580428593,
        "id": "fg1k85p",
        "score": 2,
        "subreddit": "investing",
        "created": 1580457393.0
    },
    {
        "author": "frameworkfortune",
        "body": "Well for budget investors, amatuers, new investors etc it might matter. Not everyone has a ton of money to invest, and if they want to invest in VR but can't afford Facebook maybe they can get a couple of shares of Sony. If I did a top 5 tech stocks in general the obvious overly talked about stocks Amazon, IBM, Facebook, etc. would be on there and it wouldn't be as interesting.",
        "created_utc": 1577898451,
        "id": "fcr8ty9",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1577927251.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM 145 do it",
        "created_utc": 1579121999,
        "id": "fehqr49",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579150799.0
    },
    {
        "author": "Jordykins850",
        "body": "Feeling positive. +20% on COP calls to sell at open. Threw in some USO OTM flyers as well. Hedged with IBM, sold off after positive news, locked into calls a month from now, expect positive guidance at ER.. they’ve been inking banking/money manager cloud deals left and right.",
        "created_utc": 1579122456,
        "id": "fehrjpu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579151256.0
    },
    {
        "author": "G_Shark",
        "body": "Thanks. But I'm going with ma boy Warren on this one and throw IBM in the traaash.\n\nOn the other hand, another very comparable stock graph to BUD is SHAK. At least that one's rebounding :(.\n\nBUD Lightyear to the mooooon.",
        "created_utc": 1579121452,
        "id": "fehpsuz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579150252.0
    },
    {
        "author": "Emergency_Advantage",
        "body": "On may 6, 1991 roughly 29 years ago the Dow Jones components were as follows. \n\nAllied-Signal Incorporated,\nEastman Kodak Company,\n Minnesota Mining &amp; Manufacturing, Company Aluminum Company of America,\n Exxon Corporation ,\nPhilip Morris Companies Inc. ,\nAmerican Express Company,\nGeneral Electric Company, \nThe Procter &amp; Gamble Company ,\nAT&amp;T Corporation † ,\nGeneral Motors Corporation,\nSears Roebuck &amp; Company ,\nBethlehem Steel Corporation, \nGoodyear Tire and Rubber Company, Texaco Incorporated ,\nThe Boeing Company ,\nInternational Business Machines Corporation ,\nUnion Carbide Corporation,\n Caterpillar Inc. ↑,\n International Paper Company ,\nUnited Technologies Corporation ,\nChevron Corporation ,\nJ.P. Morgan &amp; Company ↑ ,\nThe Walt Disney Company ↑ ,\nThe Coca-Cola Company ,\nMcDonald's Corporation ,\nWestinghouse Electric Corporation ,\nE.I. du Pont de Nemours &amp; Company ,\nMerck &amp; Co., Inc. ,\nF. W. Woolworth Company ,\n\nHad you asked then, these would be on the list. Some of them were real stinkers, some of them are still on the index.\n\nMoral of the story. Buy an index. It changes to suit the economy faster than most of the companies listed above did/do.",
        "created_utc": 1579129893,
        "id": "fei46b4",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1579158693.0
    },
    {
        "author": "swamprat70",
        "body": "IBM 😎",
        "created_utc": 1579220270,
        "id": "feleh7y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579249070.0
    },
    {
        "author": "STRAT0CAST3R",
        "body": "23 years old, new to investing. Have about 2k in my portfolio, would love to hear how I'm doing:  \n\n\nIBM - 26%\n\nMSFT - 24%\n\nBYND - 25%\n\nPYPL - 11%\n\nDIS - 7%\n\nBEP - 7%",
        "created_utc": 1578598664,
        "id": "fdo4ckv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578627464.0
    },
    {
        "author": "realister",
        "body": "JAN 21 is when it starts for big Tech. IBM and Netflix reporting.",
        "created_utc": 1578590374,
        "id": "fdnpd83",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578619174.0
    },
    {
        "author": "ahsanali65",
        "body": "Definitely agree that not all tech companies are created equal. IBM and Oracle are not stocks I'm interested in. Facebook, Google, and Netflix are all kinda \"meh\" to me compared to the other FAANGS. Trying to capture all of what I want will be pretty hard apparently.",
        "created_utc": 1578396325,
        "id": "fdggy5k",
        "score": 1,
        "subreddit": "investing",
        "created": 1578425125.0
    },
    {
        "author": "Lunaticllama14",
        "body": "I mean as a historical matter, Windows gained an initial large market share because the position of DOS in the market place, which had initial success because of a deal Microsoft struck with IBM.  Windows was adopted because computer manufacturers placed it on machines and people basically don't shop around operating systems.\n\nAlso, every operating system has had GUIs for decades.  The idea that Windows had the only point-and-click GUI is false.  The point-and-click GUI was first put on a personal computer by Apple and then Windows was Microsoft's attempt copy it.",
        "created_utc": 1579294472,
        "id": "feo316d",
        "score": 1,
        "subreddit": "investing",
        "created": 1579323272.0
    },
    {
        "author": "kcwwinemaker",
        "body": "no body ever got fired for buying ibm?",
        "created_utc": 1579221968,
        "id": "felh0o8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579250768.0
    },
    {
        "author": "3000dollarsuitCOMEON",
        "body": "I've worked in investment/ banking for a while and can tell you that at least in our industry IBM is there backbone of the majority of companies infrastructure. They have long term extremely sticky clients and the switching costs when exploring new tech make it very easy to continue and move forward with IBM. The negative perception of IBM is also in my opinion more prevalent in North America than elsewhere anecdotally.",
        "created_utc": 1580479509,
        "id": "fg3elex",
        "score": 1,
        "subreddit": "investing",
        "created": 1580508309.0
    },
    {
        "author": "streetvoyager",
        "body": "Guys I’m so fuckin smart. Instead of buying IBM puts on open for some quick profit I buy them after the dip and it immediately goes back up 2 dollars hahaha I’m so good.",
        "created_utc": 1580483710,
        "id": "fg3kiks",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580512510.0
    },
    {
        "author": "BurningOrangeHeaven",
        "body": "IBM is the tech worlds GE",
        "created_utc": 1580483732,
        "id": "fg3kjqd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580512532.0
    },
    {
        "author": "CreativeScale",
        "body": "Awesome news for IBM, very sexist move though. Now theyll have to fight the media on top of their shitty revenue growth.",
        "created_utc": 1580421705,
        "id": "fg16ima",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580450505.0
    },
    {
        "author": "kmung",
        "body": "Or IBM... lul",
        "created_utc": 1580489110,
        "id": "fg3t4mg",
        "score": 1,
        "subreddit": "investing",
        "created": 1580517910.0
    },
    {
        "author": "Oakland_Trader",
        "body": "Who watches these mid day CNBC shows, some fat loser panellist just insults all 350K IBM employees calls them lazy and useless?",
        "created_utc": 1580490921,
        "id": "fg3w3ay",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580519721.0
    },
    {
        "author": "deweese3",
        "body": "The answer is both and more. We have our own cloud, saas apps, cloud native services, subscription models that are not exactly saas and also the piece I am a part of, cloud migration services which include building and migrating f100 companies to the cloud (not just IBM cloud) I am their AWS and Azure expert and focus on these mostly, I got poached from msft and previously worked at amazon as well, I brought expertise to assist. The truth is most companies are multi-cloud and they should be, being in just one cloud is limiting and potentially disastrous.",
        "created_utc": 1580502760,
        "id": "fg4g61j",
        "score": 1,
        "subreddit": "investing",
        "created": 1580531560.0
    },
    {
        "author": "ody42",
        "body": "IBM cloud is a private cloud solution or do they have a plan for a public cloud offering?(like Oracle did recently?)",
        "created_utc": 1580503584,
        "id": "fg4hvqs",
        "score": 1,
        "subreddit": "investing",
        "created": 1580532384.0
    },
    {
        "author": "VitalSpunky",
        "body": "I'm doubtful that we could be seeing the satya nutella turnaround effect happening.\n\nMicrosoft was full of talent and latent potential even with an idiot like Ballmer at it's helm. (look up his comments about the iPhone)\n\nFrom what I've heard about IBM, they're just a bunch of overpaid consultants coasting on their brand, all the people at the  cutting edge have left so they are forced to innovate through acquisitions.",
        "created_utc": 1580503652,
        "id": "fg4i0mx",
        "score": 1,
        "subreddit": "investing",
        "created": 1580532452.0
    },
    {
        "author": "Necarad",
        "body": "Long Term hold: intent is 5+ years\n\nWhich Dog of the Dow would you buy 100 shares of this year for writing weekly 1-2% OTM calls?  \n\nCurrent 2020 DoD list. MMM DOW XOM WBA IBM CSCO CVX KO PFE VZ\n\nI’m debating between WBA I think TA it’s going to $50 and rebound.  PFE also looks set to rebound soon.",
        "created_utc": 1580474832,
        "id": "fg390ra",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580503632.0
    },
    {
        "author": "Shaun8030",
        "body": "Agree missing Visa Mastercard IBM Oracle and other tech stocks on the NYSE , go with TEC or better yet Vgt or FTEC if possible",
        "created_utc": 1579366797,
        "id": "fesmhze",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1579395597.0
    },
    {
        "author": "Master_SgT_Penis",
        "body": "IBM is crap",
        "created_utc": 1579284547,
        "id": "fenh3al",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579313347.0
    },
    {
        "author": "zetret",
        "body": "&gt;Oak Ridge National Laboratory\n\nORNL supercomputer user IBM Power Systems (IBM Power architecture, not AMD or Intel). ([https://www.ornl.gov/news/ornl-launches-summit-supercomputer](https://www.ornl.gov/news/ornl-launches-summit-supercomputer))",
        "created_utc": 1579456453,
        "id": "feze81r",
        "score": 1,
        "subreddit": "investing",
        "created": 1579485253.0
    },
    {
        "author": "Neutral_User_Name",
        "body": "IBM",
        "created_utc": 1579705939,
        "id": "ff96f3o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579734739.0
    },
    {
        "author": "Tragic_Carpet_Ride",
        "body": "I was like 12 when AOL came out and it wasn't definitely cool.  Same with IBM because Apple computer's were lame by that point, and it was before Gateway and Dell came out.",
        "created_utc": 1579720086,
        "id": "ff9s8sd",
        "score": 1,
        "subreddit": "investing",
        "created": 1579748886.0
    },
    {
        "author": "HinduHamma",
        "body": "They would be the same ones crying foul a decade ago when amazon, Apple, googles, etc we’re going higher with ridiculous PEs and shit. It’s because they are jealous they didn’t enter and are asking why isn’t their JNJ and IBM going vertical like other growth companies that have weak balance sheets. \n\nTickers of companies that investors find special are going to get FOMOd into hard. Look at how many were quitting and giving up on Apple back in their first decade after IPO. After amazons early struggles where they were constantly dumping capital into expansion with no profit or consistent positive cash flow. \n\nTesla is still young and the future is bright. I’m not predicting it’s going to be a trillion cap company one day but I’ll sure as shit won’t bet against what they are doing . Because they are proving to be that young breakthrough company and investors don’t wanna miss out on that. Their potential is definitely great and 100b market cap is nothing. Decade from now if they are executing on their plan and still showing growth and dominating the field , their Cap is still going to be higher than it is today. $650 a share ain’t nothing unless your short term trading. \n\nJust like when it was $300 a pop years ago...real long term investors didn’t give a shit about entering at such ridiculous highs if they plan to hold for decades what’s it matter if you believe in the companies potential to turn into a giant like an amazon, google, Apple, etc etc....",
        "created_utc": 1580390039,
        "id": "ffzqmz9",
        "score": 1,
        "subreddit": "investing",
        "created": 1580418839.0
    },
    {
        "author": "n4torfu",
        "body": "yeah was going to say the same thing, IBM doesn't seem like it can grow much because of Amazon and Microsoft, Wells Fargo is just a crappy bank that people don't trust and they haven't had any growth. Don't know enough about Cigna but just at a glance, they haven't had any growth.",
        "created_utc": 1580350317,
        "id": "ffyn1me",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580379117.0
    },
    {
        "author": "deten",
        "body": "I think the poster above is wrong about that point, but I do see a concern coming where IBM watson is better at diagnosing patients than real doctors.  As soon as a new health insurance arrives which costs 30% of what current insurances do, but you use IBM watson before seeing a real doctor.\n\nOr another AI that can plan buildings faster, more accurately, and more efficiently than a person.\n\nWhat are engineers and doctors going to do when their market has a need for only a small portion of them?",
        "created_utc": 1579883103,
        "id": "ffffxo6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579911903.0
    },
    {
        "author": "firefoxx04",
        "body": "I use all of the clouds mentioned. Azure, garbage. IBM, garbage.\n\nAWS, its fine and works well. GCP is by far the most user-friendly and consistent when it comes to their API. Also, GKE is premier, and if you have not noticed, Kubernetes is a huge deal. \n\n&amp;#x200B;\n\nWhile I hate Azure, everyone in the industry seems to be moving too it despite their engineers also hating Azure. This is why im all in MSFT at the moment. They are the ones taking the money.\n\ngive GCP some more time, im talking several years. My companies production runs on GCP and its great, but we are small.",
        "created_utc": 1579551109,
        "id": "ff3xo0l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579579909.0
    },
    {
        "author": "exidis",
        "body": "I just don't like IBM, they are trying really hard to stay relevant. On another note they'll be here for another 10 years at least.",
        "created_utc": 1579630187,
        "id": "ff6m7wl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579658987.0
    },
    {
        "author": "chodmode2",
        "body": "yeah no IBM",
        "created_utc": 1579572600,
        "id": "ff4ua3v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579601400.0
    },
    {
        "author": "RickyDaytonaJr",
        "body": "IBM should just change their corporate motto to “goes down on earnings due to continuing trend of declining revenue.”",
        "created_utc": 1579575435,
        "id": "ff4yeav",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579604235.0
    },
    {
        "author": "squid_nipps",
        "body": "IBM is still b2b af and will be just fine imo",
        "created_utc": 1579577991,
        "id": "ff51wix",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579606791.0
    },
    {
        "author": "gizamo",
        "body": "I'm getting in on this downies party.       \n       \nIBM puts are basically free money.",
        "created_utc": 1579582392,
        "id": "ff57ed8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579611192.0
    },
    {
        "author": "ilovewsb",
        "body": "Well lets fucking GOOOOO then IBM!",
        "created_utc": 1579637536,
        "id": "ff6yk6k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579666336.0
    },
    {
        "author": "Elna_Fybbg",
        "body": "anyone fucking wit IBM?",
        "created_utc": 1579638974,
        "id": "ff710lv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579667774.0
    },
    {
        "author": "SmutBrigade",
        "body": "IBM crushing it AH.\n\nYeah I’m old, fuck off.",
        "created_utc": 1579641542,
        "id": "ff75jai",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579670342.0
    },
    {
        "author": "buy_ge",
        "body": "I am 19 and gained on IBM. Checkmate \n\n146 148 1/24",
        "created_utc": 1579641559,
        "id": "ff75kc1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579670359.0
    },
    {
        "author": "DadGoneGamer",
        "body": "Boomers won with IBM while millennials are getting fucked raw by NFLX.  \n\nPretty symbolic if you ask me. Not much Hastings can say on the call to save the stock. The numbers speak for themselves.",
        "created_utc": 1579641020,
        "id": "ff74m4u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579669820.0
    },
    {
        "author": "thesysblt",
        "body": "yes i realize those 3 are not in the DOW...i just mentioned them as other big names...buy NFLX after hours dip, should be green shortly...IBM +$7 to $145 right on the money",
        "created_utc": 1579641420,
        "id": "ff75bkm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579670220.0
    },
    {
        "author": "HotStockSlinger",
        "body": "IBM bought redhat so they'll be around",
        "created_utc": 1579641855,
        "id": "ff763ag",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579670655.0
    },
    {
        "author": "lolnowhy106",
        "body": "I personally don’t wanna play w ibm since google does everything they do. IBM will grow bigger as time goes by but its just not a sexy stock",
        "created_utc": 1579642804,
        "id": "ff77sly",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579671604.0
    },
    {
        "author": "DonaldJ-Trump",
        "body": "I'm not a bear, I was like 100% long stonks &amp; 30% short. I was short IBM cause its for boomers",
        "created_utc": 1579647778,
        "id": "ff7emqs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579676578.0
    },
    {
        "author": "MAGAlibtards",
        "body": "&gt; Arvind Krishna\n\nI like the dude's surname, maybe I'll should buy some IBM stock.",
        "created_utc": 1580431144,
        "id": "fg1p4xj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580459944.0
    },
    {
        "author": "return_of_the_ring",
        "body": "It is risky... Some of Buffet's bets have not panned out as expected and he missed the boat on quite a few tech stocks. Eg: his investment into IBM was a failure.",
        "created_utc": 1578269227,
        "id": "fdc8lcq",
        "score": 1,
        "subreddit": "investing",
        "created": 1578298027.0
    },
    {
        "author": "coderntrader",
        "body": "$MSFT, $AMZN, $IBM, and $GOOG already have commercial AI offerings. They are mainly aimed at businesses and they are rolling them into existing offerings and charging more. For example, AI for your sales data or security logs. \n\nHere's an example from $MSFT that even lists some of their customers ($UBER and others):\n\nhttps://azure.microsoft.com/en-us/services/cognitive-services/",
        "created_utc": 1578286732,
        "id": "fdcwxz0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578315532.0
    },
    {
        "author": "unspoken_arrangement",
        "body": "I use a combination of seeking alpha(free version) and stock twits(mostly shit) to get broad strokes and then do more detailed research from there. \n\nWhile the current generation are both powered by AMD APUs all the previous three generations have been a mixture of ATI/Nvidia/Intel/IBM CPUs and GPUs. All to say that AMD getting the contracts for the next generation was not necessarily a guarantee but gives further confidence in their Zen 2 architecture.",
        "created_utc": 1578427112,
        "id": "fdhopt1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578455912.0
    },
    {
        "author": "Mdizzle29",
        "body": "Your “genius“ hasn’t done that much lately. No investment in tech other than IBM (lol) will bring poor returns. His investment style is passé. I was up 93% last year. Who’s the genius now? \n\nhttps://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-cant-beat-stock-market-2019-5-1028178282\n\nhttps://www.marketwatch.com/story/no-one-will-ask-this-one-question-hanging-over-berkshire-hathaways-annual-meeting-2019-05-03",
        "created_utc": 1578443023,
        "id": "fdihhi4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578471823.0
    },
    {
        "author": "mikes703",
        "body": "Haha just asked my friend who works at IBM and at data warehouses, he’s never even seen AMD.  Both of us are IS majors, I don’t work in that industry.  He says companies will lean towards intel anyway.",
        "created_utc": 1578464869,
        "id": "fdjc3tq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578493669.0
    },
    {
        "author": "Vxxputs",
        "body": "What about aapl, fb ? Actually don’t short anything in nasdaq. Even IBM can go up, such rallies lead to major fomo, unless a bad news comes out, it can keep going up.",
        "created_utc": 1578965311,
        "id": "fec1kpf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578994111.0
    },
    {
        "author": "CallMeAnanda",
        "body": "It might take 10 years, but it's coming. The switch will have started in 5. Necessary x86 shit will be emulated or run offsite. Software will be developed and maintained in one place - no more splitting resources between PC and mobile. Expect an ARM macbook in the next 2-3 years and as soon as it's announced, everybody else will see the writing on the wall. AMD and Intel will both tank and be bought by IBM. Trust me. I'm from the future.",
        "created_utc": 1578704299,
        "id": "fdskfk3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578733099.0
    },
    {
        "author": "IRPhysicist",
        "body": "Morgan Stanley sinking my IBM ship.",
        "created_utc": 1579262684,
        "id": "femmkdb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579291484.0
    },
    {
        "author": "Jordykins850",
        "body": "Got out of IBM calls that were killing it to short utilities 😰🥺",
        "created_utc": 1579284443,
        "id": "fengx81",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579313243.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM actually makes me money. One of the few things that regularly does",
        "created_utc": 1579284571,
        "id": "fenh4r1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579313371.0
    },
    {
        "author": "Jordykins850",
        "body": "If you’re looking for a comparable situation (sell off after Q3, no recovery, blue chip) with better upside, IBM is also staring at you.. except it has more positive groundswell. This coming from someone who owns both.",
        "created_utc": 1579121307,
        "id": "fehpjpx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579150107.0
    },
    {
        "author": "Jordykins850",
        "body": "Warren picked IBM when it was dog shit and tossed it in the trash the moment it started gaining momentum.",
        "created_utc": 1579121504,
        "id": "fehpw0p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579150304.0
    },
    {
        "author": "jerryckim",
        "body": "Yeah except IBM had Microsoft. Plus you can’t just suddenly build fking planes out of thin air. It’s a different market from technology. I bought a share recently at 330 I’m just gonna wait it out a year.",
        "created_utc": 1579372679,
        "id": "fet89sq",
        "score": 1,
        "subreddit": "investing",
        "created": 1579401479.0
    },
    {
        "author": "ProudResident",
        "body": "IBM or google",
        "created_utc": 1579061090,
        "id": "fefosza",
        "score": 1,
        "subreddit": "investing",
        "created": 1579089890.0
    },
    {
        "author": "Jordykins850",
        "body": "Sold IBM/COP calls at open. Rebought same calls + Cisco for cheap.",
        "created_utc": 1579186544,
        "id": "fejv3uu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579215344.0
    },
    {
        "author": "Luka-Step-Back",
        "body": "At one point, IBM sold orders of magnitude more computers than Apple.",
        "created_utc": 1578081886,
        "id": "fcykx63",
        "score": 12,
        "subreddit": "investing",
        "created": 1578110686.0
    },
    {
        "author": "flex674",
        "body": "IBM was bad. GE was a nightmare.",
        "created_utc": 1578250853,
        "id": "fdavpxh",
        "score": 7,
        "subreddit": "investing",
        "created": 1578279653.0
    },
    {
        "author": "mwbbrown",
        "body": "&gt;almost guaranteed\n\nI think you are defining technology too broadly. Ford wasn't a \"technology stock\" or at least how we would use the phrase now. They disrupted the market and kicked off a revolution in mobility. But would you consider an investment in them in 1920 to be the same as Amazon now? In hindsight they both disrupted the market and made lots of money, but can you tell me what the 3rd stock in that chain over the next 30 years would be? \n\n&amp;#x200B;\n\nSears, Standard Oil, Kodak, IBM, Amazon, Facebook are all \"new technology disrupting the market\" stocks, but I wouldn't call them \"tech\" all today. Investing in tech today would overlook biomedical or Automotive stocks in the next 20 years, all of which might use technology to disrupt the market but wouldn't be billed as \"tech stocks\" \n\n&amp;#x200B;\n\nYou might be right that self driving cars change everything, but who is going to win because of that? Do you invest in Tesla and Alphabet, or is there a massive breakthrough and all the know how in the world doesn't help you make cars, so GM becomes the  leader when they include it in all of their cars and sell to everyone. \n\n&amp;#x200B;\n\nThe diversity in investing helps cover those blind spots.",
        "created_utc": 1578325520,
        "id": "fddw9bz",
        "score": 4,
        "subreddit": "investing",
        "created": 1578354320.0
    },
    {
        "author": "ilovewsb",
        "body": "So no wonder Disney is a piece of shit. Doesn’t have a stock buyback program like Apple or even fucking IBM. Stock can easily be fucking manipulated by MMs. Garbage Ima start selling spreads And buy calls on something else",
        "created_utc": 1578956867,
        "id": "febabmc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1578985667.0
    },
    {
        "author": "TheSavingsGuy",
        "body": "While Buffett is my idol, he has made some mistakes. \n\nHe famously bought a stake in IBM (which floundered while the rest of the market soared) and then later sold it. \n\nBuffett also sold Disney stock years ago and missed out on the gains of the past couple decades.",
        "created_utc": 1578355327,
        "id": "fdf7ulf",
        "score": 2,
        "subreddit": "investing",
        "created": 1578384127.0
    },
    {
        "author": "arrty",
        "body": "Kill ibm. Buy a cloud company",
        "created_utc": 1578895228,
        "id": "fe6lt2r",
        "score": 2,
        "subreddit": "stocks",
        "created": 1578924028.0
    },
    {
        "author": "frameworkfortune",
        "body": "Well for budget investors, amatuers, new investors etc it might matter. Not everyone has a ton of money to invest, and if they want to invest in VR but can't afford Facebook maybe they can get a couple of shares of Sony. If I did a top 5 tech stocks in general the obvious overly talked about stocks Amazon, IBM, Facebook, etc. would be on there and it wouldn't be as interesting.",
        "created_utc": 1577898451,
        "id": "fcr8ty9",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1577927251.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM 145 do it",
        "created_utc": 1579121999,
        "id": "fehqr49",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579150799.0
    },
    {
        "author": "Jordykins850",
        "body": "Feeling positive. +20% on COP calls to sell at open. Threw in some USO OTM flyers as well. Hedged with IBM, sold off after positive news, locked into calls a month from now, expect positive guidance at ER.. they’ve been inking banking/money manager cloud deals left and right.",
        "created_utc": 1579122456,
        "id": "fehrjpu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579151256.0
    },
    {
        "author": "G_Shark",
        "body": "Thanks. But I'm going with ma boy Warren on this one and throw IBM in the traaash.\n\nOn the other hand, another very comparable stock graph to BUD is SHAK. At least that one's rebounding :(.\n\nBUD Lightyear to the mooooon.",
        "created_utc": 1579121452,
        "id": "fehpsuz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579150252.0
    },
    {
        "author": "Emergency_Advantage",
        "body": "On may 6, 1991 roughly 29 years ago the Dow Jones components were as follows. \n\nAllied-Signal Incorporated,\nEastman Kodak Company,\n Minnesota Mining &amp; Manufacturing, Company Aluminum Company of America,\n Exxon Corporation ,\nPhilip Morris Companies Inc. ,\nAmerican Express Company,\nGeneral Electric Company, \nThe Procter &amp; Gamble Company ,\nAT&amp;T Corporation † ,\nGeneral Motors Corporation,\nSears Roebuck &amp; Company ,\nBethlehem Steel Corporation, \nGoodyear Tire and Rubber Company, Texaco Incorporated ,\nThe Boeing Company ,\nInternational Business Machines Corporation ,\nUnion Carbide Corporation,\n Caterpillar Inc. ↑,\n International Paper Company ,\nUnited Technologies Corporation ,\nChevron Corporation ,\nJ.P. Morgan &amp; Company ↑ ,\nThe Walt Disney Company ↑ ,\nThe Coca-Cola Company ,\nMcDonald's Corporation ,\nWestinghouse Electric Corporation ,\nE.I. du Pont de Nemours &amp; Company ,\nMerck &amp; Co., Inc. ,\nF. W. Woolworth Company ,\n\nHad you asked then, these would be on the list. Some of them were real stinkers, some of them are still on the index.\n\nMoral of the story. Buy an index. It changes to suit the economy faster than most of the companies listed above did/do.",
        "created_utc": 1579129893,
        "id": "fei46b4",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1579158693.0
    },
    {
        "author": "STRAT0CAST3R",
        "body": "23 years old, new to investing. Have about 2k in my portfolio, would love to hear how I'm doing:  \n\n\nIBM - 26%\n\nMSFT - 24%\n\nBYND - 25%\n\nPYPL - 11%\n\nDIS - 7%\n\nBEP - 7%",
        "created_utc": 1578598664,
        "id": "fdo4ckv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578627464.0
    },
    {
        "author": "realister",
        "body": "JAN 21 is when it starts for big Tech. IBM and Netflix reporting.",
        "created_utc": 1578590374,
        "id": "fdnpd83",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578619174.0
    },
    {
        "author": "ahsanali65",
        "body": "Definitely agree that not all tech companies are created equal. IBM and Oracle are not stocks I'm interested in. Facebook, Google, and Netflix are all kinda \"meh\" to me compared to the other FAANGS. Trying to capture all of what I want will be pretty hard apparently.",
        "created_utc": 1578396325,
        "id": "fdggy5k",
        "score": 1,
        "subreddit": "investing",
        "created": 1578425125.0
    },
    {
        "author": "return_of_the_ring",
        "body": "It is risky... Some of Buffet's bets have not panned out as expected and he missed the boat on quite a few tech stocks. Eg: his investment into IBM was a failure.",
        "created_utc": 1578269227,
        "id": "fdc8lcq",
        "score": 1,
        "subreddit": "investing",
        "created": 1578298027.0
    },
    {
        "author": "coderntrader",
        "body": "$MSFT, $AMZN, $IBM, and $GOOG already have commercial AI offerings. They are mainly aimed at businesses and they are rolling them into existing offerings and charging more. For example, AI for your sales data or security logs. \n\nHere's an example from $MSFT that even lists some of their customers ($UBER and others):\n\nhttps://azure.microsoft.com/en-us/services/cognitive-services/",
        "created_utc": 1578286732,
        "id": "fdcwxz0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578315532.0
    },
    {
        "author": "unspoken_arrangement",
        "body": "I use a combination of seeking alpha(free version) and stock twits(mostly shit) to get broad strokes and then do more detailed research from there. \n\nWhile the current generation are both powered by AMD APUs all the previous three generations have been a mixture of ATI/Nvidia/Intel/IBM CPUs and GPUs. All to say that AMD getting the contracts for the next generation was not necessarily a guarantee but gives further confidence in their Zen 2 architecture.",
        "created_utc": 1578427112,
        "id": "fdhopt1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578455912.0
    },
    {
        "author": "Mdizzle29",
        "body": "Your “genius“ hasn’t done that much lately. No investment in tech other than IBM (lol) will bring poor returns. His investment style is passé. I was up 93% last year. Who’s the genius now? \n\nhttps://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-cant-beat-stock-market-2019-5-1028178282\n\nhttps://www.marketwatch.com/story/no-one-will-ask-this-one-question-hanging-over-berkshire-hathaways-annual-meeting-2019-05-03",
        "created_utc": 1578443023,
        "id": "fdihhi4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578471823.0
    },
    {
        "author": "mikes703",
        "body": "Haha just asked my friend who works at IBM and at data warehouses, he’s never even seen AMD.  Both of us are IS majors, I don’t work in that industry.  He says companies will lean towards intel anyway.",
        "created_utc": 1578464869,
        "id": "fdjc3tq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578493669.0
    },
    {
        "author": "Vxxputs",
        "body": "What about aapl, fb ? Actually don’t short anything in nasdaq. Even IBM can go up, such rallies lead to major fomo, unless a bad news comes out, it can keep going up.",
        "created_utc": 1578965311,
        "id": "fec1kpf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578994111.0
    },
    {
        "author": "CallMeAnanda",
        "body": "It might take 10 years, but it's coming. The switch will have started in 5. Necessary x86 shit will be emulated or run offsite. Software will be developed and maintained in one place - no more splitting resources between PC and mobile. Expect an ARM macbook in the next 2-3 years and as soon as it's announced, everybody else will see the writing on the wall. AMD and Intel will both tank and be bought by IBM. Trust me. I'm from the future.",
        "created_utc": 1578704299,
        "id": "fdskfk3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578733099.0
    },
    {
        "author": "Jordykins850",
        "body": "If you’re looking for a comparable situation (sell off after Q3, no recovery, blue chip) with better upside, IBM is also staring at you.. except it has more positive groundswell. This coming from someone who owns both.",
        "created_utc": 1579121307,
        "id": "fehpjpx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579150107.0
    },
    {
        "author": "Jordykins850",
        "body": "Warren picked IBM when it was dog shit and tossed it in the trash the moment it started gaining momentum.",
        "created_utc": 1579121504,
        "id": "fehpw0p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579150304.0
    },
    {
        "author": "ProudResident",
        "body": "IBM or google",
        "created_utc": 1579061090,
        "id": "fefosza",
        "score": 1,
        "subreddit": "investing",
        "created": 1579089890.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM run up to earnings\n\nAnd post-ER, if you’re buying a month out.",
        "created_utc": 1579128858,
        "id": "fei2iun",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579157658.0
    },
    {
        "author": "Fenix04",
        "body": "&gt;1. The jokes on you. I have a BS and a MBA. My role has always been a technical one in a financial services firm.\n\nThis quote explains why you think IBM is a tech company.  You pretty much just said \"I'm in a technical role at a company who's IT department is stuck in the 80's\" (90's if you're lucky).  I worked as a software engineer at a top financial services company for 6 years.  IBM and Oracle make Bank on financial services via support contracts.\n\nIs your mainframe running? Because the 80's would like it back...",
        "created_utc": 1578692659,
        "id": "fds13bc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578721459.0
    },
    {
        "author": "BenjaminTightwater",
        "body": "SPXL,DLA, AMZN, SPY, IBM\n\n~Mr. Tightwater",
        "created_utc": 1579118663,
        "id": "fehkyyz",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1579147463.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM bleed off after good news. Bout to hedge my oil calls with BIG BLUE eod",
        "created_utc": 1579119598,
        "id": "fehml6b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579148398.0
    },
    {
        "author": "Jordykins850",
        "body": "Sell ConocoPhillips calls at open. Probably pick up gold, oil and a tech hedge near close (prob IBM).",
        "created_utc": 1578279986,
        "id": "fdcofjj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578308786.0
    },
    {
        "author": "silence9",
        "body": "What you probably don't realize is that google and ibm also have cloud services. Aws was just first so it's more fleshed out in terms of ease of getting started. Learn aws, but use something else in the long run.",
        "created_utc": 1578659324,
        "id": "fdq8lvt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578688124.0
    },
    {
        "author": "TravelingArthur",
        "body": "Just a heads up. They said the same thing about General Electric, Bear Sterns, Lehman Brothers and IBM",
        "created_utc": 1578549422,
        "id": "fdmgtqh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578578222.0
    },
    {
        "author": "StockDealer",
        "body": "You just keep popping your head up like whack-a-mole with new names and new businesses. Jenson runs NVDA, and he's not just a CEO, it's literally his baby and he was the founder. He makes the decisions.\n\nLike Musk, for the most part, makes the decisions about Tesla. BOD's, for firms that do engineering, are very important if you have a shitty MBA at the helm. You need to have engineers on them to balance out the MBA's lack of knowledge.\n\nOkay, you barfed out IBM -- let's take a look. They aren't really a bleeding edged tech firm, they're a government consultant for the most part. So, not really relevant here. Yes yes, I know, deep blue, blah blah blah. No, they're not actually a silicon valley tech firm. They're the Sears of the tech world. They're just in it for the contracts. So sure, run them with MBA's. \n\nBill Gates was a criminal, not a good engineer. His firm stole code, just as one of many examples. He thought the Internet was a fad, before he said he predicted that it would be great. 640K should be enough for anybody, he said, and yes, he did say it. His firm was a gang that instituted a \"new computer tax\" and it made him money. Nothing to do with engineering. He didn't get where he was because his company made great software. Nobody would argue that. If you want to run a successful *software* company you need people who know software.\n\nYou just keep going on and on... Job's secret weapon was the Woz. And no, Apple was not a bleeding edged tech company (with the exception of three products: the original Apple, then 20 years later the Lisa, and then the iPhone) it became a design studio, and Jobs was a fucking excellent designer. See how that works? You want to run a successful  design studio you should be a designer.\n\nTell me about couch companies next. Guess what? To run a couch company you should have people who know about couches.",
        "created_utc": 1578683390,
        "id": "fdreh8q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578712190.0
    },
    {
        "author": "NexoExo",
        "body": "You are beyond stupid. \n\n1. The CEO of AMD is JENSEN Huang. \n\n2. It doesn't matter if he's the founder, you dumb fuck. We are talking about the Board. Do you know what the job of a BOD is?\n\n3. Okay, IBM is not a tech company. Why? Because it doesn't suit your argument. Go tell the rest of the world that. \n\n4. Right, Bill Gates owes everything to him being a thief.\n\n5. Wozniak had nothing to do with Apple 2.0. That is, the iPod era to current. Look at the share price performance in that period of time. The BOD has never had more than 1-2 engineer's during this period of time. \n\nIt's important to learn when you're wrong. Look up what the responsibility of a board is and why they're seldom (if ever) comprised of engineers. You need a very foundational education in this very basic topic if you are indeed a \"stock dealer\".",
        "created_utc": 1578684004,
        "id": "fdrfxfx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578712804.0
    },
    {
        "author": "mwbbrown",
        "body": "&gt; But they will be in EVERYTHING going forward.\n\nIf I asked you if IBM would be a major player in tech 20 years ago you would have said \"of course\", if I had asked you if the online book seller [Amazon.com](https://Amazon.com) would have been a massive player in tech you would have given me an answer like \"of course, their website will be even bigger\". but today Amazon is almost 10 times larger then IBM. \n\nSame with something like Facebook and HP. Facebook didn't exist 20 years ago, and HP is a shell of it's former self. \n\nI agree that information technology is revolutionizing everything, but it isn't a given that today's big tech companies will reap the benefits. Google might have the best self driving tech today, but it might be a commodity in 10 years and the real strengths is knowing how to build a car and having the experience to comply with 120 countries worth of bureaucracy so Ford could win. \n\n&amp;#x200B;\n\nMy point is, if you want to make money over the next 20 years with one investment made today, I would still stick with a total market position, rather then locking myself into one sector of the market.",
        "created_utc": 1578494949,
        "id": "fdk3754",
        "score": 1,
        "subreddit": "investing",
        "created": 1578523749.0
    },
    {
        "author": "Jigsus",
        "body": "Sundar Pichai is 100% to blame for this. He's just there to \"realize value\". That means he will bleed google dry until there's no more value to be pumped out of it to the detriment of innovation and disruption. \n\nHis number one mission is stock price and you can see it. Literally on the the day it was decided that he'd take over the nature of the stock changed from a steady constant slow grower to a \"live by the earning calls\" swinging machine: https://i.imgur.com/XpnBcoV.png\n\nHe's a wall street man not a revolutionary. He's the guy the board brings in after the founders are out. A pure successor CEO. You can see this in the tech industry over and over again with disaters like Gil Amelio or successes like Larry Probst. \n\nThis is the typical [founder dilemma](https://hbr.org/2008/02/the-founders-dilemma) that hit Google very late because they had an overly long growth phase. Eric Schmidt was smart enough to keep this alive even though he was a wall street man too by delegating all the tech to the founders. \n\nSo what does this mean? For me it means I'll keep trading Google stock by using classic indicators (money). There is no crash coming. It's just going to be a typical big tech company like IBM.",
        "created_utc": 1577889495,
        "id": "fcqobis",
        "score": 1,
        "subreddit": "stocks",
        "created": 1577918295.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM",
        "created_utc": 1577915151,
        "id": "fcsdul9",
        "score": 1,
        "subreddit": "investing",
        "created": 1577943951.0
    },
    {
        "author": "miaomiaomiao",
        "body": "Khamenei went all in on AMD and ww3 is not helping. Should’ve bought IBM instead.",
        "created_utc": 1578519105,
        "id": "fdl91ph",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1578547905.0
    }
]