[
    {
        "author": "Crackbot420-69",
        "body": "I wish real life worked like the market.\n\nStudent: Professor why did you give me an F on this essay?\n\nProfessor: there's no conclusion, no sources, it's like a third of your paper is just missing\n\nStudent: It could have been worse it could be missing 35% percent.\n\nProfessor: You're right! how stupid of me, A+ -- and now here's the keys to my house please go fuck my wife",
        "created_utc": 1596127587,
        "id": "fzqu029",
        "permalink": "/r/wallstreetbets/comments/i0ji8h/daily_discussion_thread_for_july_30_2020/fzqu029/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1596156387.0
    },
    {
        "author": "Panye_Zay",
        "body": "It's 3:00 AM. You can't sleep and your asshole is burning because you're a gay bear.\n\nYou waddle into your flannel pajama pants and grab your car keys.\n\nWhere are you headed? That's right, W A U L M A U T\n\nYou jam yourself into one of their Obese-Mobiles and amongst the masses of mullets and broken dreams, you realize you're home. That's right. Welcome to W A U L M A U T.",
        "created_utc": 1594145921,
        "id": "fx89ry1",
        "permalink": "/r/wallstreetbets/comments/hmrv6e/daily_discussion_thread_for_july_07_2020/fx89ry1/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1594174721.0
    },
    {
        "author": "hammondish",
        "body": "Think this is one of the things that separates investors from gamblers... the gamblers lose their shit and panic sell, while investors just continue to hold their long plays and buy up their wishlist stocks at a discount.\nLooking for dips on CRM, FISV, QCOM, CRNC, ZI, MU, KEYS, UBX, and SNCR\n\nC'mon baby, bleeeeed!",
        "created_utc": 1595788452,
        "id": "fzbq9i2",
        "permalink": "/r/pennystocks/comments/hyb4dn/my_plays_for_next_week/fzbq9i2/",
        "score": 17,
        "subreddit": "pennystocks",
        "created": 1595817252.0
    },
    {
        "author": "DatFkIsthatlogic",
        "body": "Bitcoin can't be mainstream currency because of he following problem:\n\n1. It doesn't have ability to refund/dispute purchases.\n2. It takes a long time for purchase to go through relative to say credit cards.\n3. There is no centralization so what to if people get hacked or lose their keys? You can't expect average person to remember when they often forget wifi password or misplace things.\n4. Ease of use, still too difficult for the average consumer and it will never ever rival the ease of use of traditional methods of payment like credit cards.\n5. Pricing understanding. People understand what $1.34 means. People have no clue what 0.0000215BTC means.\n6. Eventually the encryption will be cracked by quantum computers. It's not far off.\n7. Inefficient infrastructure. It takes a shit ton of energy consumption to maintain the bitcoin network, it's so wasteful and hard to scale as it gets more and more computationally demanding overtime. Look up how much electricity bitcoin network useses.\n\nThese are just off the top of my head, I'm sure there are plenty of others things.",
        "created_utc": 1595906764,
        "id": "fzh6qiz",
        "permalink": "/r/investing/comments/hz1zdi/bitcoin_just_passed_11000_9k_to_11k_in_2_days/fzh6qiz/",
        "score": 17,
        "subreddit": "investing",
        "created": 1595935564.0
    },
    {
        "author": "busterwilliams",
        "body": "Please tell me he has a 5 figure fund and isn’t retarded enough to hand you the keys to 6 figures or more.  \n\nBecause if he is then he deserves to lose all of his money.",
        "created_utc": 1594846871,
        "id": "fy6nzrg",
        "permalink": "/r/wallstreetbets/comments/hrvpp3/retards_help_me/fy6nzrg/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1594875671.0
    },
    {
        "author": "nfish91",
        "body": "What’s the old adage? Not you’re keys, not your coins.",
        "created_utc": 1594729304,
        "id": "fy12pm2",
        "permalink": "/r/RobinHood/comments/hqzv8m/whats_the_point_of_the_cryptocurrencies_if_theres/fy12pm2/",
        "score": 13,
        "subreddit": "RobinHood",
        "created": 1594758104.0
    },
    {
        "author": "SwitchedOnNow",
        "body": "Two years trading a bull market and he’s handing you the keys to his Lambo? What happens when you lose his money?",
        "created_utc": 1594846396,
        "id": "fy6n0ju",
        "permalink": "/r/wallstreetbets/comments/hrvpp3/retards_help_me/fy6n0ju/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1594875196.0
    },
    {
        "author": "bobstaman",
        "body": "That moment when your boss recovers your company from collapse, turns it around to be even more profitable, brings in some badass benefits for everyone, and puts in fail safes so the next boss couldn't possibly fuck shit up.  \nThen he gives you the keys and you proceed to find every possible way to fuck it up.. meanwhile you let a horde of orange baboons inside your workplace and they're killing everybody and you stand there throwing the future of our kids at them.",
        "created_utc": 1595568481,
        "id": "fz29dea",
        "permalink": "/r/wallstreetbets/comments/hwn0fj/what_are_your_moves_tomorrow_july_24_2020/fz29dea/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1595597281.0
    },
    {
        "author": "Phlebotanist",
        "body": "Computers will never fit in a pocket Moore's law says transistors can't get that small a touchscreen phone is idiotic how are people supposed to feel the keys as they push them",
        "created_utc": 1595473734,
        "id": "fyxzd0t",
        "permalink": "/r/wallstreetbets/comments/hw11bf/what_are_your_moves_tomorrow_july_23_2020/fyxzd0t/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1595502534.0
    },
    {
        "author": "concreteslinger",
        "body": "AirBNB still will work... I rented a condo in key west never saw the owner, combo lockbox, even left keys to a scooter for us to use. 🤳🏻 all via mobile",
        "created_utc": 1595465599,
        "id": "fyxlg0s",
        "permalink": "/r/SPACs/comments/hw4u0z/reuters_airbnb_approached_about_blankcheck/fyxlg0s/",
        "score": 10,
        "subreddit": "SPACs",
        "created": 1595494399.0
    },
    {
        "author": "oregon_forever",
        "body": "In Powel''s keyboard, two keys are mostly eroded.\n\nctrl + p",
        "created_utc": 1596127891,
        "id": "fzqumyj",
        "permalink": "/r/wallstreetbets/comments/i0ji8h/daily_discussion_thread_for_july_30_2020/fzqumyj/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1596156691.0
    },
    {
        "author": "AUserOfManyThings",
        "body": "So this guy was telling me pretentiously about how I need to watch where/how big banks put/rotate their money to make some really money. And then proceeded to delete every comment and his account as if he revealed to me the keys to the simulation lmaoo\n\nSo any of you autists know how I can find out how/where/when bank move and put their tenders?",
        "created_utc": 1594952098,
        "id": "fybhzrz",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fybhzrz/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1594980898.0
    },
    {
        "author": "umbrellacorgi",
        "body": "New strategy tomorrow since nothing else has worked: open RH, roll my face on the keys, see how lucky I get 🍀",
        "created_utc": 1594349999,
        "id": "fxhrl5f",
        "permalink": "/r/wallstreetbets/comments/hoa9dp/what_are_your_moves_tomorrow_july_10_2020/fxhrl5f/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594378799.0
    },
    {
        "author": "abeslton_Trees",
        "body": "This is really bad and I mean reaaaaaly bad for Twitter. This is either crazy exploit to get  passed the 2FA on their accounts on the back end or their is one dumb fuck Twitter sys admin that they were able get some crazy keys to serious admin panels to reset or disable 2FA",
        "created_utc": 1594856141,
        "id": "fy762p9",
        "permalink": "/r/wallstreetbets/comments/hruzcj/what_are_your_moves_tomorrow_july_16_2020/fy762p9/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594884941.0
    },
    {
        "author": "DatFkIsthatlogic",
        "body": "&gt;What value does a dollar have that people invest in USD? You use it to buy things plain and simple. Bitcoin still has a long way to go to get to the point of fluid transactions but once you hit that point what becomes the difference between bitcoin and any fiat currency? I believe it will serve as a proper store of value more any currency as it isn’t susceptible to manipulation like fiats are\n\nBitcoin can't be mainstream currency because of he following problem:\n\n1. It doesn't have ability to refund/dispute purchases.\n2. It takes a long time for purchase to go through relative to say credit cards.\n3. There is no centralization so what to if people get hacked or lose their keys? You can't expect average person to remember when they often forget wifi password or misplace things.\n4. Ease of use, still too difficult for the average consumer and it will never ever rival the ease of use of traditional methods of payment like credit cards.\n5. Pricing understanding. People understand what $1.34 means. People have no clue what 0.0000215BTC means.\n6. Eventually the encryption will be cracked by quantum computers. It's not far off.\n7. Inefficient infrastructure. It takes a shit ton of energy consumption to maintain the bitcoin network, it's so wasteful and hard to scale as it gets more and more computationally demanding overtime. Look up how much electricity bitcoin network useses.\n\nThese are just off the top of my head, I'm sure there are plenty of others things.",
        "created_utc": 1595906146,
        "id": "fzh5ri9",
        "permalink": "/r/investing/comments/hz1zdi/bitcoin_just_passed_11000_9k_to_11k_in_2_days/fzh5ri9/",
        "score": 7,
        "subreddit": "investing",
        "created": 1595934946.0
    },
    {
        "author": "buck_tardwater",
        "body": "just starting out with programming, looking at a career change. this weekend i made a program that takes all the recipes my gf has on file and puts them into an object with keys defined by meat (chicken, beef, pork, etc.) and specific recipes as properties for their respective key. I click the button each week going forward and it gives me a random set of recipes (one from each meat category) to have for the week, without repeating any from the previous week.\n\n\"HWHAT DO YOU WANT TO EAT THIS WEEK THINK OF 5 MEALS NOW\" is a demand I no longer have to labor over. click of the button then it's back to watching youtubes. There's something to this computer shit you guys, i'm tellin ya. calls on computers",
        "created_utc": 1594535667,
        "id": "fxt1sf6",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxt1sf6/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594564467.0
    },
    {
        "author": "yachtsandthots",
        "body": "Fuck lost the keys to the Benz there’s $500 down the drain. Already starting the week off with a loss",
        "created_utc": 1595127648,
        "id": "fyivzx7",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyivzx7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595156448.0
    },
    {
        "author": "bartriles",
        "body": "Lmao. DMT is a naturally occurring element in the brain. Generally only activated at life and birth, it holds the keys to the secrets you’ve been looking for. If you want to prep up for your ride, would recommend meditating, yoga, and building up psilocybin/THC use. Cut alcohol and try to your mind/body/spirit in a good overall shape where you don’t have any inner demons haunting you. \n\nUsually letting go of your ego and realizing your entire life is just a projection of YOUR particular soul’s consciousness and that we (all humans) are all connected on the same proverbial energy length, with constant negative lower energy beings (the cabal running the world bank and the show) trying to keep humanity from discovering its true powers if it were able to collectively unite through love. \n\nThe left v right divide are just silly games to keep the lower and middle class distracted while the rich perpetually take advantage of knowing more then they do. Slavery never died, it just evolved. The sooner you realize you are a slave, the sooner you can be free. \n\nA good DMT trip will show you all of this, but changing your life for the better and being a good person is an even better start. You can create you own reality by using a combo of psychohistory, astral projection, lucid dreaming, and transcendental meditation. Check out the Randonautica app. \n\nWhy do you think you have to sleep for a third of your life and scientists still don’t know really know why or what goes on in there? The knowledge is being hidden from you. Good luck finding the truth my friend and happy tendies.",
        "created_utc": 1595302110,
        "id": "fyqbbvg",
        "permalink": "/r/wallstreetbets/comments/husn8s/what_are_your_moves_tomorrow_july_21_2020/fyqbbvg/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595330910.0
    },
    {
        "author": "Prodo45",
        "body": "O so they are not that dumb to give us retards the entire keys to the kingdom.",
        "created_utc": 1595996731,
        "id": "fzl8tca",
        "permalink": "/r/wallstreetbets/comments/hzncma/250k_mostly_theta_gang_gainz/fzl8tca/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596025531.0
    },
    {
        "author": "PhilPipedown",
        "body": "I don't understand why this is trading so low. This company will hold the keys to the castle once schools go online. Numerous contracts have been confirmed with California and Guam.\n\nThese bags will be heavy.",
        "created_utc": 1595363379,
        "id": "fysw7af",
        "permalink": "/r/pennystocks/comments/hvdqvq/bkyi_offering_closing/fysw7af/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1595392179.0
    },
    {
        "author": "tradingonatoilet",
        "body": "Lol i like to call them boogeymen institutional investors market makers, money managers. They basically buy a huge chunk of shares and use the ability to control the stock price to make money themselves both ways up and down.\n\nCompanies basically hand them the keys to manipulate their stock value for upfront revenue. Theyve gotta make it back on the open market with us.",
        "created_utc": 1595226970,
        "id": "fymwfp7",
        "permalink": "/r/pennystocks/comments/hug780/alna_why_is_nobody_talking_about_it/fymwfp7/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1595255770.0
    },
    {
        "author": "bioprocesschemist",
        "body": "Recent graduate. Wouldn’t recommend calls. All engineering professors despised, “chegg and other cheating websites.” They would send students to SJA in droves if they even thought you were using chegg. Some profs even posted false answer keys on chegg and course hero and if they saw that your work matched they did everything they could to get you in trouble with the university and kicked out of the major.... I only imagine the problem getting worse and chegg is happy to eat on students who pay them. They will drop eventually. They are already too dangerous to use.",
        "created_utc": 1595107315,
        "id": "fyhyx6n",
        "permalink": "/r/wallstreetbets/comments/htnowt/chgg_dd/fyhyx6n/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595136115.0
    },
    {
        "author": "ViewSonik",
        "body": "Ikr, I used to be able to spread lube on the kb and it wouldn’t fucking ruin my keys",
        "created_utc": 1595984387,
        "id": "fzknum3",
        "permalink": "/r/wallstreetbets/comments/hzlx0h/what_are_your_moves_tomorrow_july_29_2020/fzknum3/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1596013187.0
    },
    {
        "author": "Relaxed_Engineer",
        "body": "For fuck's sake don't mess with options. \n\nOr money in general. \n\nOr car keys.",
        "created_utc": 1595645443,
        "id": "fz5s2zw",
        "permalink": "/r/wallstreetbets/comments/hx90gx/weekend_discussion_thread_for_the_weekend_of_july/fz5s2zw/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595674243.0
    },
    {
        "author": "myNameIsPDT",
        "body": "Alternatives are FLIR, and maybe KEYS depending on the thermal imaging application.",
        "created_utc": 1594925967,
        "id": "fya4ye0",
        "permalink": "/r/wallstreetbets/comments/hses93/us_bans_china_thermal_detection_cameras/fya4ye0/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594954767.0
    },
    {
        "author": "Dustin_Rx",
        "body": "I work for a major hospital corporation that still uses a DOS system for all of their order entry, charting, med admin, etc. I don't confirm things with \"enter\" or a mouse click. We use F keys.",
        "created_utc": 1595178896,
        "id": "fykoyyf",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fykoyyf/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595207696.0
    },
    {
        "author": "cloudone",
        "body": "+1. Chiplet design + infinity fabric are the keys to AMD's business.\n\nIt's not that AMD has elected to deal with higher reject levels, but it's that their design allows for higher reject levels on a transistor level and still have normal yield on a chip level.",
        "created_utc": 1595707283,
        "id": "fz8928d",
        "permalink": "/r/investing/comments/hx7da6/intc_what_went_wrong_with_intel/fz8928d/",
        "score": 4,
        "subreddit": "investing",
        "created": 1595736083.0
    },
    {
        "author": "Hi-Im-High",
        "body": "People who aren’t sure if khakis are pants or car keys",
        "created_utc": 1595607684,
        "id": "fz3r5kc",
        "permalink": "/r/wallstreetbets/comments/hwz949/daily_discussion_thread_for_july_24_2020/fz3r5kc/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595636484.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "Hotel I’m at is one the worst Marriott experiences I’ve had. \nWas told they had room service before I drove out.\n\nThey don’t have room service. No biggie. \nThen I learn they won’t clean/make your room until you completely checkout. \nThis is listed nowhere. \n\nHave to grab towels from the lobby or pool. \n\nPhones in the room don’t work. \nFront desk never answers no matter what time of day you call. \n\nHave to get new room keys made everyday. \nI’m on the 4th floor. Not cool. \n\nElevator smashed &amp; cut my foot because there isn’t a safety stop built in door. \nSome women where loading a giant cooler and I went to stop the door and it took me out. \n\n\nNo first aid kit in whole hotel. \nGave me bandaids from the lobby store\n“On the house”.\n\n\nThe staff just seems completely lost. \nIt’s borderline comical. \n\nLooking forward to checking out, because the building might collapse under the stupidity. \n\nIt’s like if the movie Waiting was about hotels.",
        "created_utc": 1594798758,
        "id": "fy4g9e3",
        "permalink": "/r/wallstreetbets/comments/hr8uhb/what_are_your_moves_tomorrow_july_15_2020/fy4g9e3/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594827558.0
    },
    {
        "author": "Cnastydawg",
        "body": "If you dont use hot keys when day trading wyd bb. I remapped my Logitech g keys lmao",
        "created_utc": 1595325790,
        "id": "fyr2osz",
        "permalink": "/r/wallstreetbets/comments/husn8s/what_are_your_moves_tomorrow_july_21_2020/fyr2osz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595354590.0
    },
    {
        "author": "AUserOfManyThings",
        "body": "Everything multiplied by 9, when the sum is added equals to 9. Nikola Tesla who is not the creator of this theory, but just had the fame to put it out said 369 holds the keys to the universe. \n\nJust your daily cool occult knowledge. \n\nAnd yes, I think I have figured out this key,  partially, after a looong time of research when I'm not trying to pursue my material gains here",
        "created_utc": 1594865550,
        "id": "fy7mkf0",
        "permalink": "/r/wallstreetbets/comments/hruzcj/what_are_your_moves_tomorrow_july_16_2020/fy7mkf0/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594894350.0
    },
    {
        "author": "thesmd1",
        "body": "Not easy. Super short segment scalps. Not only do you have to predict direction, but also, you need to be able to execute trades fast. You need quick keys, shortcuts, premade saved orders and fast mouse clicks. Decision making on the fly.",
        "created_utc": 1596077639,
        "id": "fzovuga",
        "permalink": "/r/wallstreetbets/comments/i01dg8/31_million_gain_from_amd/fzovuga/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596106439.0
    },
    {
        "author": "Surfincloud9",
        "body": "Man I love Alicia Keys.",
        "created_utc": 1593702380,
        "id": "fwpc7tb",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpc7tb/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593731180.0
    },
    {
        "author": "diegoREACH",
        "body": "dam seems like a good deal but i thought you also needed my house keys",
        "created_utc": 1595370719,
        "id": "fytb363",
        "permalink": "/r/pennystocks/comments/hvhb5f/is_this_possible/fytb363/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1595399519.0
    },
    {
        "author": "Trenchalicious",
        "body": "car keys taste better than most vagina plus keys can't get yeast infections.",
        "created_utc": 1595177053,
        "id": "fyklitm",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyklitm/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595205853.0
    },
    {
        "author": "xcheezeplz",
        "body": "I own Bitcoin, I use bitcoin, I develop cryptographic solutions, but it's not better than a central bank for a society at large and will remain a niche, barring some catastroohic shift in the entire global order that no one has even imagined, because it is good for two things only. \n1) speculation\n2) transferring money outside of the financial regulatory systems and even that isn't very great considering the high spreads and liquidity. \n\nIt does not allow for the elasticity of monetary policy. \nUnless you are going to get banks involved to act as escrow have no purchase protection. \nIf you fuck up and lose your keys your Bitcoin is gone forever. If you propose the layman keeps their Bitcoin with an exchange (aka bank), when the bank gets hacked it is insolvent and your money is all gone.\nIt can't be insured without leverage and that is what most people claim Bitcoin solves is preventing leverage (inflation).\n\nI don't care if the system is built on Bitcoin, dollars, toenail clippings... You can't run commerce and economic policy on scale without the institutions you are inferring are bad that Bitcoin can replace. What would prevent treasury from issuing debt even if it were ran on Bitcoin until the money supply was exhausted and you have a deflationary spiral? What would prevent public corps from just monopolizing the network and forking and causing a shit storm? Now you have execs and boards at PTCs running monetary policy. \n\nBitcoin is amazing for collecting that win from your out of state bookie or sending profits from a shady enterprise back to your bosses in South America. For everything else it pretty much sucks compared to having a bank card.",
        "created_utc": 1595491524,
        "id": "fyylemu",
        "permalink": "/r/investing/comments/hvy845/money_printing_consequnces_on_asset_prices_from/fyylemu/",
        "score": 3,
        "subreddit": "investing",
        "created": 1595520324.0
    },
    {
        "author": "BlueKnightJoe",
        "body": "Twitter wasn't really hacked per se. One of the employees took a bribe and gave away the keys to the castle. Your information is never 100% safe as long as there are corrupt people. When you go online you assume the risks.",
        "created_utc": 1594917370,
        "id": "fy9mye5",
        "permalink": "/r/wallstreetbets/comments/hs70w1/daily_discussion_thread_for_july_16_2020/fy9mye5/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594946170.0
    },
    {
        "author": "kstorm88",
        "body": "Not your keys, not your coins. They legit could bend everyone over, and there's nothing you could do. You're buying the idea of buttcoyn, and I doubt RH even is holding enough to cover everyone. If it hit 20k tomorrow, I bet rh would bankrupt",
        "created_utc": 1595886673,
        "id": "fzg6p9e",
        "permalink": "/r/wallstreetbets/comments/hyzs0g/what_are_your_moves_tomorrow_july_28_2020/fzg6p9e/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595915473.0
    },
    {
        "author": "Iskippedfaceday",
        "body": "Yup. It’s super expensive to purchase and create. \n\nYou can see it on the balance sheet how expensive their intangible costs are. Their engine/software license keys + physical hardware costs are going to be crazy. Hopefully they can gain some leverage in the future.",
        "created_utc": 1595487453,
        "id": "fyyhcxy",
        "permalink": "/r/pennystocks/comments/hw58ih/do_you_like_video_games_yvr/fyyhcxy/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1595516253.0
    },
    {
        "author": "JeremyLinForever",
        "body": "Bitcoin most likely won’t be used by any civilization ever. The day that happens, means that governments admit defeat. It will always be decentralized individual sovereignty currency.\n\nAlso, Bitcoin can never be deleted, only lost or forgotten keys.",
        "created_utc": 1595216778,
        "id": "fymjior",
        "permalink": "/r/StockMarket/comments/hu9e4o/bonds_wave_red_flag_on_us_economy_while_stocks/fymjior/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1595245578.0
    },
    {
        "author": "dameLillardManiac",
        "body": "I found an old keyboard in my garage from 2001... and I gotta say, the best typing experience I've had in forever. The keys are great, nice sound to it, nice travel, and useful shortcuts. things just aren't the same anymore i guess",
        "created_utc": 1595619854,
        "id": "fz4h3k5",
        "permalink": "/r/wallstreetbets/comments/hwz949/daily_discussion_thread_for_july_24_2020/fz4h3k5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595648654.0
    },
    {
        "author": "Thieving__Magpie",
        "body": "My wife gave him keys to the basement, sorry to say.",
        "created_utc": 1595424157,
        "id": "fyvbfn8",
        "permalink": "/r/wallstreetbets/comments/hvr7i6/daily_discussion_thread_for_july_22_2020/fyvbfn8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595452957.0
    },
    {
        "author": "AllahuCakebar",
        "body": "I only have one type of nightmare... It's when I am stuck in an infinite loop and the only condition to get out of it is for something close to impossible to happen.\n\nlike being told that you are immortal but you are stuck in a room with a monkey with a keyboard. and the monkey is pressing keys randomly. And you can't get out until the monkey writes Shakespeare from start to finish. It will probably take almost until the end of the universe but you have no choice but to just watch the monkey...\n\nthat's the type of nightmare i get. anyone else?",
        "created_utc": 1595402111,
        "id": "fyumnrx",
        "permalink": "/r/wallstreetbets/comments/hveqed/what_are_your_moves_tomorrow_july_22_2020/fyumnrx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595430911.0
    },
    {
        "author": "Orangedale",
        "body": "That's how I imagine my wife's boyfriend feels when he gives me the keys to my cock cage but I have to find the right key out of 100.",
        "created_utc": 1596179118,
        "id": "fzu8i2k",
        "permalink": "/r/wallstreetbets/comments/i0pwvs/i_made_a_scanner_to_help_you_find_the_next_kodac/fzu8i2k/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596207918.0
    },
    {
        "author": "mrmudzi",
        "body": "I think it's more the very obvious and rampant price manipulation, the extreme friction in actually using it as currency (including the need for internet access, the lack of protection if you lose the keys to your wallet, and the lack of deposit insurance in the event of cybertheft), the utter lack of velocity (more than half of all crypto have never moved, pointing to its use as speculation), and the high technical barrier to entry.",
        "created_utc": 1595667061,
        "id": "fz6inpq",
        "permalink": "/r/InvestmentClub/comments/hxgpzv/billionaire_explains_why_bitcoin_is_a_bubble/fz6inpq/",
        "score": 2,
        "subreddit": "InvestmentClub",
        "created": 1595695861.0
    },
    {
        "author": "Bytemebytch",
        "body": "So a few weeks ago someone suggested to blindly hit keys and see what ticker you come up with and buy it. I did it and ended up with AVLR 1/12 190c... I was not happy with it but whatever this is gambling... Today as my TAP calls die and my MGM puts vanish that damn AVLR is up. I am really bad at this :)",
        "created_utc": 1596218792,
        "id": "fzw5364",
        "permalink": "/r/wallstreetbets/comments/i15376/daily_discussion_thread_for_july_31_2020/fzw5364/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596247592.0
    },
    {
        "author": "Chris_TheTrader",
        "body": "Senate Bear Hunter Subcommittee: \"May the real JPow please stand up?\"                                             JPow: \"I would but I'm balancing this desktop computer, 10 keys of Columbian Snow, and the brrrr printer on my tremendous shlong.\"",
        "created_utc": 1596170365,
        "id": "fztxpgf",
        "permalink": "/r/wallstreetbets/comments/i0t4tc/what_are_your_moves_tomorrow_july_31_2020/fztxpgf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596199165.0
    },
    {
        "author": "AllYoullOwnIsEarth",
        "body": "It's the weekend thread cool your fuckin keys hoss. Your top-level meta botching is worse imo.",
        "created_utc": 1594571128,
        "id": "fxua823",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxua823/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594599928.0
    },
    {
        "author": "notapropriate",
        "body": "Here’s my lambo keys, go park it where it won’t get scratched.",
        "created_utc": 1595133971,
        "id": "fyj4s4f",
        "permalink": "/r/wallstreetbets/comments/htu8ug/iron_condor_calculator/fyj4s4f/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595162771.0
    },
    {
        "author": "RichieBot",
        "body": "Or is the meme power at hertz level? Fools thinking they have the keys to covid because Trump and Fauci mentioned them in passing a week ago?",
        "created_utc": 1595621172,
        "id": "fz4jth9",
        "permalink": "/r/wallstreetbets/comments/hx1ouu/moderna_melting_after_losing_ip_suit/fz4jth9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595649972.0
    },
    {
        "author": "TheAncient1sAnd0s",
        "body": "Get the car keys and leave the house.  Lock the house doors.  Put the car keys into the driver-side door of your car and unlock it.  Take the keys out of the door, sit down in the driver's seat and now put the keys in the ignition.  Turn the ignition.  Drive to QuikMart and buy some Cheetos.  Go back home etc and sit in your computer chair.  Get a web browser, open it by double-clicking, and type [youtube.com](https://youtube.com) (or just you and let the auto-fill handle the rest)..  Search \"how to get stock data\".  Click one of the videos.  Open your Cheetos.  Enjoy.",
        "created_utc": 1595712266,
        "id": "fz8mz5w",
        "permalink": "/r/stocks/comments/hxttrc/please_teach_me_how_to_download_ohlc_history_of_a/fz8mz5w/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595741066.0
    },
    {
        "author": "Shishi1315",
        "body": "All you need is an email and $50 to sign up for these trading apps &amp; bam- you're on your way to being a millionaire. I've seen so many loss posts it's sad.\n\nKinda like giving the keys of a P1 to a 17 year old boy. No training, no advice just follow the herd  (HTZ &amp; GNC to the moon) Many come here, but  then have to decipher the bullshit from the legit. \n\nRH (and others) has a moral &amp; ethical obligation regarding their clients. Make a few tutorials mandatory before betting the farm. \n\nSome will jump in &amp; make headway. But those numbers will be few and far between.",
        "created_utc": 1593629578,
        "id": "fwm1g02",
        "permalink": "/r/wallstreetbets/comments/hjamtv/is_fed_buying_tesla/fwm1g02/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593658378.0
    },
    {
        "author": "Distribution-Signal",
        "body": "While most of what you say I agree with, it would not be *easy* for huawei/china to gobble up your encrypted data and have it be usable, you also cannot act like hardware designed by a malicious actor (assuming huawei is one) is as secure as hardware designed to be secure.\n\nSure, my information should be secure as it bounces over infested nodes because its encrypted -- but if a service fails to encrypt correctly, is already compromised, or has a vulnerability like heartbleed that exposes keys, then I definitely would rather have my information bouncing around on hardware I know is not malicious.  \n\nAside from that, there are security concerns just from sniffing traffic frequency and load.\n\nFinally, this equipment will probably live for 30+ years.  You cannot reliably say that our current encryption will remain as hard to break.",
        "created_utc": 1594834215,
        "id": "fy5x9yy",
        "permalink": "/r/investing/comments/hr2y6z/boris_johnson_moves_to_ban_huawei_in_the_uk_by/fy5x9yy/",
        "score": 2,
        "subreddit": "investing",
        "created": 1594863015.0
    },
    {
        "author": "SteveStacks",
        "body": "I'm just gonna ride that GLD and SLV yacht to the keys.",
        "created_utc": 1594246128,
        "id": "fxczgs9",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxczgs9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594274928.0
    },
    {
        "author": "stockmarketrapist",
        "body": "find your keys",
        "created_utc": 1595127685,
        "id": "fyiw1tg",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyiw1tg/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595156485.0
    },
    {
        "author": "ZERGSOMG",
        "body": "I use AMD for wheeling, and its always worked well for me. It manages to have large volatile swings while still trading in a fairly narrow range in the medium term. Missed out on some gains on the $30-$50 rise, but the premiums have more than made up for it.\n\nI tried using BAC, but the premiums are too low for me personally and the risk of holding bank stocks in this low interest environment isn't appealing to me. One of the keys for me is, like you said, that its a stock I would have been comfortable holding long in the first place, and BAC doesn't fit that for me.",
        "created_utc": 1595322151,
        "id": "fyqz6pk",
        "permalink": "/r/investing/comments/hv21iv/is_there_a_currentmeta_recommendation_for_stocks/fyqz6pk/",
        "score": 2,
        "subreddit": "investing",
        "created": 1595350951.0
    },
    {
        "author": "TacoGuzzler69",
        "body": "Alright Europe, go ahead and stop selling off to close your day. Just hand over the keys to the rocket.",
        "created_utc": 1594653891,
        "id": "fxxqiga",
        "permalink": "/r/wallstreetbets/comments/hqcqy1/daily_discussion_thread_for_july_13_2020/fxxqiga/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594682691.0
    },
    {
        "author": "CursedEthirty",
        "body": "My keys are ambient temperature.",
        "created_utc": 1594572003,
        "id": "fxubvfj",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxubvfj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594600803.0
    },
    {
        "author": "jamnormal",
        "body": "\"The Economics of Customer Businesses\" by Michael Mauboussin gives an intro into how subscription businesses work, even if its examples are slightly outdated.\n\nOverall I don't follow a significant amount of SAAS companies. I follow more consumer subscription business (Spotify, Netflix, SiruisXM), which share similar characteristics to SAAS companies. Focusing on customer acquisition and Lifetime customer value are keys to understanding the operating leverage built into the businesses.",
        "created_utc": 1594469666,
        "id": "fxnqc11",
        "permalink": "/r/SecurityAnalysis/comments/hohhio/what_is_a_good_primer_on_software_and_saas/fxnqc11/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1594498466.0
    },
    {
        "author": "chazstreet",
        "body": "Just leave it it outside with the keys in it",
        "created_utc": 1594472900,
        "id": "fxnx4v9",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxnx4v9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594501700.0
    },
    {
        "author": "Goatboy3020",
        "body": "Cheggs straight up has the answer keys to most major question banks on a topic because that's all students submit questions on.  It's amazing.  If you learn that way, it can save time and headache.  I love it for continued distance learning college and high schools.  The money will flow when school is in sesh, so maybe Q3 will be amazing",
        "created_utc": 1594586077,
        "id": "fxv2n9l",
        "permalink": "/r/wallstreetbets/comments/hq11ao/what_are_your_moves_tomorrow_july_13_2020/fxv2n9l/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594614877.0
    },
    {
        "author": "ChoochMMM",
        "body": "They had the keys to the kingdom",
        "created_utc": 1594854071,
        "id": "fy728w2",
        "permalink": "/r/wallstreetbets/comments/hruzcj/what_are_your_moves_tomorrow_july_16_2020/fy728w2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594882871.0
    },
    {
        "author": "ShoeQuirky",
        "body": "Sorry for your lose. same thing happened to me 5 years back.Now you got the experience and i am sure that you will learn from your mistakes. please learn how to manage risk. stock market is always risk. learn play long game. invest in good companies. I think you are young. plan to invest in next 10 years stocks. patience and discipline are the real keys in the stock market.\n\nCheers",
        "created_utc": 1594734446,
        "id": "fy1arjf",
        "permalink": "/r/options/comments/hqy5aj/i_blew_up_my_account_and_i_feel_sick_to_the/fy1arjf/",
        "score": 1,
        "subreddit": "options",
        "created": 1594763246.0
    },
    {
        "author": "Staygangponyboy",
        "body": "this morning when I was driving, I said on the freeway \n\n\" Oh shit I left the car keys on the roof\"",
        "created_utc": 1595004036,
        "id": "fydhz34",
        "permalink": "/r/wallstreetbets/comments/hsxz71/for_all_the_new_guys_psa/fydhz34/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595032836.0
    },
    {
        "author": "RPAlias",
        "body": "January 2021, when Biden takes the keys to the Whitehouse.\nTrump is not leaving peacefully.",
        "created_utc": 1594923162,
        "id": "fy9z3kf",
        "permalink": "/r/investing/comments/hs8v28/us_retail_sales_rose_75_in_june_vs_50_increase/fy9z3kf/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594951962.0
    },
    {
        "author": "bigballsmcginty",
        "body": "The key to success is many keys of cocaine",
        "created_utc": 1595198440,
        "id": "fylpea2",
        "permalink": "/r/wallstreetbets/comments/htws5h/never_watched_it_before/fylpea2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595227240.0
    },
    {
        "author": "bbq-ribs",
        "body": "my jab was that a train can be synonymous with a self-driving car. \n\nBesides Mr.Musk and his appeal to the markets. People believe that the battery tech TSLA provides is the keys to the kingdom jumping on that train.\n\nMost people kinda forget that the batteries are made by companies like LG, Panasonic, and Samsung.\n\nAlso this is the thing that I dont understand, TSLA is valued as a Tech company, and most investors believe TSLA will gather a portfolio of patents and IP.",
        "created_utc": 1593646614,
        "id": "fwn25zv",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwn25zv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593675414.0
    },
    {
        "author": "PussySmith",
        "body": "Have you ever been to an apple store in a major metro area?\n\nIt's a fucking shitshow of people whipping out those titanium apple cards and plopping down thousands on hardware.\n\nCan online sales stand in for a while? Sure. \n\nDo the shiny new Macs and iPhones sitting on the shelf waiting for you to fondle their keys sell themselves? Absolutely.",
        "created_utc": 1593654985,
        "id": "fwngvdc",
        "permalink": "/r/wallstreetbets/comments/hjg6w7/apple_to_reclose_30_more_retail_stores_as/fwngvdc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593683785.0
    },
    {
        "author": "anon202001",
        "body": "Either\n\n* This dude has a well oiled system to safely get big gains, such as +500% consistently, and soon enough will be the richest dude on this planet.\n\nOr\n\n* This dude is a degenerate gambler and this will be $0 soon enough\n\nOr\n\n* This is one account of many, and his total bank roll is in the $10Ms, so this is just a little punt on the side for him.\n\nOr\n\n* This dude is a degenerate but in a moment of lucid clarity, he will fedex his phone to his mom with the keys to the handcuffs he will restrain himself with, and take profits and do something sensible with the money like hit the strip.\n\nI wonder",
        "created_utc": 1593664350,
        "id": "fwnvm6p",
        "permalink": "/r/wallstreetbets/comments/hjgidx/i_held_on_so_i_could_share_this_with_the_community/fwnvm6p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593693150.0
    },
    {
        "author": "GamingDrop",
        "body": "Not your keys, not your crypto",
        "created_utc": 1594076505,
        "id": "fx5docv",
        "permalink": "/r/RobinHood/comments/hmheoi/tiktok_is_currently_pushing_dogecoin_to_the_moon/fx5docv/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1594105305.0
    },
    {
        "author": "weekendmoney",
        "body": "Who regulates the world economy? Sure, you can make the purchase and sale of bitcoin illegal in the states, but the network will* continue across the globe, functioning as it was intended. RH crypto investors beware, if your private keys are not stored offline in a hardware wallet, they can lock you out of your crypto if it were to become illegal (which it will not). Also, Coinbase is FDIC insured... And fiat currency is used for money laundering.  Have a good day.\n\n*spelling",
        "created_utc": 1594054582,
        "id": "fx45h3f",
        "permalink": "/r/RobinHood/comments/h9j1fd/not_allowed_to_sell_my_btc/fx45h3f/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1594083382.0
    },
    {
        "author": "GourmetFilet",
        "body": "you have to be is be in shape and have a decent body. \n\nMental health comes with good looks.girls like a little crazy, think they can change you, so funny lol. \n\nYou don’t have to be smart, but you have to be able to manipulate them.\n\nThese are the keys to success with thots and woman above average IQs and below. \n\nWoman who are geniuses are a little tricky, you won’t outsmart them from the jump, but if you make them think your dumber than you actually are you can trick them down the road.",
        "created_utc": 1593910080,
        "id": "fwyey9c",
        "permalink": "/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fwyey9c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593938880.0
    },
    {
        "author": "tkhan456",
        "body": "The Model S has the handles that pop out. You still needed a key fob but it’s pretty hands off.  I still have to carry keys for my house, work, mailbox. So not having to carry one car key makes no difference to me",
        "created_utc": 1594314844,
        "id": "fxfvrkp",
        "permalink": "/r/wallstreetbets/comments/hnqsul/the_big_boys_earning_in_two_weeks_whats_your_play/fxfvrkp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594343644.0
    },
    {
        "author": "Rjeezy858",
        "body": "Patience &amp; Control the budget big keys for me .",
        "created_utc": 1594284338,
        "id": "fxekuws",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxekuws/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594313138.0
    },
    {
        "author": "NotNamedNathan",
        "body": "My dad never wanted to murder me so badly as the morning he left the house and found my keys dangling in the lock still. In a not phenomenal neighborhood lol",
        "created_utc": 1594301330,
        "id": "fxf54mx",
        "permalink": "/r/wallstreetbets/comments/ho0krw/daily_discussion_thread_for_july_09_2020/fxf54mx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594330130.0
    },
    {
        "author": "Iraq619",
        "body": "I had money on that game and I say the live bet was +1600 for Patriots to win so I put $100 just for kicks. When the Patriots got the interception I couldn't believe it. I couldn't stay in the house. I grabbed my keys and drove around for an hour.",
        "created_utc": 1593778891,
        "id": "fwsreqj",
        "permalink": "/r/wallstreetbets/comments/hkgjy6/daily_discussion_thread_for_july_03_2020/fwsreqj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593807691.0
    },
    {
        "author": "NilSatis_NisiOptimum",
        "body": "&gt; Tesla's HW3 computer that can run only Tesla software because it checks physically for electronic PGP keys\n\nThat was one of your points. How is that not underestimating their capabilities?",
        "created_utc": 1593820524,
        "id": "fwut5rv",
        "permalink": "/r/wallstreetbets/comments/hkqi3y/china_will_not_steal_from_tesla_to_help_nio/fwut5rv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593849324.0
    },
    {
        "author": "PM_Me_Macaroni_plz",
        "body": "Sure. I didn’t know what you meant so I just button mashed some keys to feel cool. \nHope it helps with tomorrow’s plays 😎",
        "created_utc": 1595970770,
        "id": "fzjy6rz",
        "permalink": "/r/wallstreetbets/comments/hzc3ko/daily_discussion_thread_for_july_28_2020/fzjy6rz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595999570.0
    },
    {
        "author": "AceVonSpades",
        "body": "Gotta admit, the standard low profile keyboard Dell sends with its new machines is awesome.  Full feature, regular layout, low keys.",
        "created_utc": 1595620011,
        "id": "fz4hfer",
        "permalink": "/r/wallstreetbets/comments/hwz949/daily_discussion_thread_for_july_24_2020/fz4hfer/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595648811.0
    },
    {
        "author": "F1shB0wl816",
        "body": "Again, protect it like it’s money. You wouldn’t store your only access to your savings account at a bank in your phone would you. Instead of relying on someone else to protect it for you, you have to take some initiative. Writing down a code to put up takes like 20 seconds and can save heart ache such as that. Plus many of my wallets I don’t need the wallet keys themselves, just a pin or password like any other account. \n\n5-30 minutes isn’t enough although I’ve sent as little as .00001 and as high as .037 and never had to wait more than 10 minutes for it to be confirmed.\n\nWhy are banks busy when you call? Because someone else a legitimate questions, others are stupid and will need help with the most simple of things despite how streamlined it’s made, or as simple. The only thing people seem to have the most problems with is forgetting to protect themselves. \n\nThat’s also not true either. What I use to store my coins is insured up to more than I’ll ever have, I think like 100 million. There’s not many people who are sending their bitcoins into a wallet they can’t have total control of. There’s not really any reason to do that considering some exchanges let you link your wallet or give you one to control while you use the exchange platform. I’ve also yet to hear of any platform “forgetting” their users key they store anymore than I hear of bank losing your routing number. \n\nOh I am but I also see how dumb people have no choice but to catch up regardless. Like I said, 15-20 years ago, the people who’d call others computer geeks, think it wasn’t going anywhere, now have a computer in their pockets they’re are on everyday. 10 years isn’t much time in the scheme of something being completely new, something that blows up to big to fast is usually just a phase, this has slowly become more mainstream and serious. I mean even some 401ks will mess with bitcoin. Many online retailers, some stores. You can buy bitcoin at atms now. \n\nThe problems you mention may exist for some users, but some of that also appeals to many people who want more control over their money, while simultaneously protecting against their dollars inflation. Chances are if waiting a few minutes or backing up your keys is to much, it’s not something your interested in regardless. It’s never been easier than now and I’m sure it’ll only get easier.",
        "created_utc": 1595936022,
        "id": "fzi44le",
        "permalink": "/r/investing/comments/hz1zdi/bitcoin_just_passed_11000_9k_to_11k_in_2_days/fzi44le/",
        "score": 1,
        "subreddit": "investing",
        "created": 1595964822.0
    },
    {
        "author": "mechtech",
        "body": "You should know, but you don't know.\n\nThe same guy who designed Zen core designed the K8 core that got AMD to 50% server market share with Opteron in the 2000s. Oh, and guess who hired him soon after to fix their internal processes? Intel. Intel only escaped the Opterons because they went into disaster mode and scaled up a P3 derived core from their small Israeli team, and that core happened to hold the keys for the next 15 years of architecture development. Otherwise it would have been 5+ years of AMD pushing to 75%+ market share. \n\nDisruption does happen, and this exact story has played out before with the same chip architect. Intel isn't going to shit out an iterated and optimized Infinity Fabric chiplet lineup (thus their yield problems with monolithic cores that's currently taking them down), and this time Intel lost the fab lead as well.\n\nOne more 6-12 mo. delay and they will have to outsource to TSMC/Samsung where they have no reserved capacity and no tool chain integration. Intel's top guy in the Xe program was spotted last year at Samsung's 5nm tape out. You're just waking up now to facts that semiconductor investors have been trading on for years. The depth of Intel's fab problems was first reported before 2017. Swan's ER call last year where INTC lost 10 billion in market cap while he talked made me laugh like a comedy show. The company has deep flaws and doubling down on denial and avoidance has put them right in the edge of massive risk. 5 years from now its very likely that everyone realizes Intel should have started going fab agnostic years before now, as soon as it was clear the fab moat was critically breached, which would have been 4+ years ago internally.\n\nAMDs biggest challenge will be getting through to mediocre elitist and brand loyal engineers.",
        "created_utc": 1595656624,
        "id": "fz67tip",
        "permalink": "/r/investing/comments/hxf6ud/intel_down_15_is_not_logical/fz67tip/",
        "score": 1,
        "subreddit": "investing",
        "created": 1595685424.0
    },
    {
        "author": "pexican",
        "body": "From the article you linked. Wouldn’t say BOSCH built the truck is accurate.\n\n“As customer chief engineer, Appel is responsible for the technical coordination of the Bosch components in the truck known as Nikola Two. There are plenty of those components: electric motors for the e-axle, the vehicle control unit, and key components of the hydrogen fuel cell. What’s more, the new Bosch mirror camera system has replaced the truck’s side-view mirrors, and the Bosch Perfectly Keyless system means truck drivers no longer have to search for their keys. “",
        "created_utc": 1595384827,
        "id": "fytzedu",
        "permalink": "/r/wallstreetbets/comments/hv8fob/trevor_milton_is_likely_a_sociopath_you_heard_it/fytzedu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595413627.0
    },
    {
        "author": "chuuwana",
        "body": "Ah, I see your google is broken and the calculator probably lost you when you couldn't find the + and - keys, let me help.\n\nYour max loss is (value of the shares - the premium you collect).  So if you sold calls at 1.72 for 10$ then your max loss is 1.62$ if the share price goes to 0 before 6/21.   \nAbove the strike price of your stock, the stock and the option should pretty much move in tandem so you won't \"lose money\" if it goes above 5$. You just won't gain anything. Your max profit would be (strike price - value of shares + premium).  So 3.38$ (5 - 1.72 + .10).",
        "created_utc": 1595376194,
        "id": "fytkq62",
        "permalink": "/r/wallstreetbets/comments/hviui3/i_pet_the_bunny/fytkq62/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595404994.0
    },
    {
        "author": "mikoybass",
        "body": "ETF = FIVG\n\nTop 10 holdings. \n\nQUALCOMM INC QCOM \nNXP SEMICONDUCTORS N V NXPI\nANALOG DEVICES INC ADI \nERICSSON ERIC \nXILINX INC XLNX \nNOKIA CORP NOK \nAMERICAN TOWER CORP AMT \nKEYSIGHT TECHNOLOGIES INC KEYS \nVERIZON COMMUNICATIONS INC VZ \nAT&amp;T INC T\n\nhttps://www.defianceetfs.com/defiance_uploads/fund/4-25-FIVG-Fact-Sheet-6-30-20.pdf",
        "created_utc": 1595302171,
        "id": "fyqbfb3",
        "permalink": "/r/stocks/comments/huvvu5/5g/fyqbfb3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595330971.0
    },
    {
        "author": "IamNaNIam",
        "body": "&gt;If Frederic Donner couldn’t keep gm a growth stock after 1965 when it was at its first prime I’m pretty sure Elon is going to slip up at some point.\n\nThe only constant is change. I have not signed any agreements to hold onto Tesla stock for life. Adaptability and flexibility are keys to success in any endeavor, and I'd say that goes double for investing.",
        "created_utc": 1594008732,
        "id": "fx2g44g",
        "permalink": "/r/investing/comments/hl3h45/stock_market_is_the_most_overvalued_over_last_50/fx2g44g/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594037532.0
    },
    {
        "author": "PMMEZERODAYS",
        "body": "This is a fucking load of bollocks. I work in the Infosec community, and I was actually very intrigued when I read this post as my company is looking to move to a private cloud solution that offers us scalability and maintainability cheaper than AWS, Azure or GCloud. Since we are in the security business, we have requirements that we need to have full ownership of the encryption keys etc. Nutanix provides absolutely fucking no benefit even in that space. Their private cloud solution brief is a marketing ballache and hurts my damn nuts just to read. Their background is hella shady and I don't see any customers who would want to head dick first into a solution that locks them in for 20 years either. What a waste of time and money.",
        "created_utc": 1594041033,
        "id": "fx3gg3n",
        "permalink": "/r/wallstreetbets/comments/hm2brj/ntnx_is_like_crack_for_it_managers/fx3gg3n/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594069833.0
    },
    {
        "author": "lvrenoan",
        "body": "I think a good direction is the increasing use of mega threads to consolidate all these threads.\n\nIt would be great to one day have a legit investor's sub for penny stocks that doesn't just pump newbs into FOMOing, but that's what you get when the fed pumps trillions into the economy and a bunch of bored people at home decide to give stocks a try. They flooded the forums looking for commission-free financial advisors to hand them the keys to 100% portfolio gains. It's no wonder there's so much salt these days.",
        "created_utc": 1594055730,
        "id": "fx47u24",
        "permalink": "/r/pennystocks/comments/hm9tq7/this_honestly_couldnt_be_any_funnier/fx47u24/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594084530.0
    },
    {
        "author": "ABVerageJoe69",
        "body": "Best of luck to you, but this is not effectively weaponized autism, it's some stupid boomer shit. My grandfather worked for Ford for 40 years and is one of many, many former employees that make up Ford's gigantic pention liability. Additionally, Ford has been a big source of dividends, which decreases stock price on payout. Additionally, Ford employees are unionized, so any gains get watered down before the investors see them. Peep the 5yr price history on Ford, expect more of that, leveling out if you're actually optimistic.\n\nOh, and F is discontinuing production of its cars. I am currently typing this in a Ford fusion, love this car. Ford is counting on people like me to trade in my keys and buy F150s and SUVs, but a lot of people are just not going to do it. The new Broncos look dope, but most people will just buy a comparable car from a different make.",
        "created_utc": 1593688415,
        "id": "fwomks1",
        "permalink": "/r/wallstreetbets/comments/hjqdgr/ford_jan_21_2022_17_calls_yolo_in_ira/fwomks1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593717215.0
    },
    {
        "author": "psiguy686",
        "body": "If you throw it all in TSLA 7/10 1240/1250 or AMZN 7/10 2980/2990 debit spreads you can be given the keys to the sub in my eyes. But you have to let them expire, no selling.",
        "created_utc": 1593661429,
        "id": "fwnrajd",
        "permalink": "/r/wallstreetbets/comments/hjnfst/100k_settlement_money_from_head_injury_just/fwnrajd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593690229.0
    },
    {
        "author": "HODL_monk",
        "body": "I would argue that 80 % of gold is also controlled by 10 whales, they are central banks. Google 'gold in England's central bank', there are videos of it, stacked on heavy racks floor to ceiling, and they will just sell into any significant rally. The difference with Bitcoin is its VERY hard to mine more, and a lot of large holders have lost their keys, so those coins are not dumping into a rally. Also best performing asset of the last 10 years.",
        "created_utc": 1593880028,
        "id": "fwwyo6a",
        "permalink": "/r/investing/comments/hl16kh/i_dont_see_the_point_in_buying_gold/fwwyo6a/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593908828.0
    },
    {
        "author": "pandorum",
        "body": "Sticky keys detected",
        "created_utc": 1594871186,
        "id": "fy7vulg",
        "permalink": "/r/wallstreetbets/comments/hruzcj/what_are_your_moves_tomorrow_july_16_2020/fy7vulg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594899986.0
    },
    {
        "author": "SteveMunchkin",
        "body": "The only reason to use it is answer keys with step by step solutions. Wonders for engineers",
        "created_utc": 1594971700,
        "id": "fyc7vbw",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fyc7vbw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595000500.0
    },
    {
        "author": "Tball_Inda",
        "body": "I can feel you OP, sometimes trading becomes an addiction. It's like digital crack that you can't go through the day without. You spend weekends waiting for Monday to come around to trade again, you spend work days after 4pm looking at your phone for AMH moves and scrolling through pages to try and find the next big trade. At the end of the day you ran the race and thought money was happiness. Now you realized it's not, and I think a lot of people need to realize this too. \n\nA lot of people trading think if they can just make a million or two they'll be happy and if they ever reach that, they'll realize it doesn't make them happy. Sure maybe buying a few things makes you temporarily happy, but what happens when when you feel exactly the same as before? You start thinking, oh maybe if I can make 10 million or 20 million. You'll keep reaching for a number that you think will bring you happiness and if you ever get to it, you'll only increase that number. Ultimately living your life without meaning. I'm Mexican and travel to where my parents grew up often and one thing I can say for sure is that the poorest towns in Mexico have some of the happiest people I've ever met. And I think this is due to the fact that they've accepted their state and realized money doesn't bring happiness. Love, compassion, unity and friendship are the true keys to happiness. If you can learn to trade and make money while keeping those keys in your life. You'll be truly happy.",
        "created_utc": 1594616804,
        "id": "fxwgngc",
        "permalink": "/r/wallstreetbets/comments/hq65dq/dont_be_like_me_find_meaning_in_your_life_because/fxwgngc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594645604.0
    },
    {
        "author": "lama_in_my_room",
        "body": "JPOW forgot the keys to the printer room",
        "created_utc": 1594672998,
        "id": "fxyu8hr",
        "permalink": "/r/wallstreetbets/comments/hqmoth/what_are_your_moves_tomorrow_july_14_2020/fxyu8hr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594701798.0
    },
    {
        "author": "idoescompooters",
        "body": "You realize Taiwan Semiconductor uses primarily Keysight technology right? I personally don't have an issue with the UI.",
        "created_utc": 1595445119,
        "id": "fywhm4e",
        "permalink": "/r/stocks/comments/flbsu5/longterm_play_on_robotics_ai_and_automation_on/fywhm4e/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595473919.0
    },
    {
        "author": "Vast_Cricket",
        "body": "You need to customize to your needs hot keys running real time etc. 2 weeks is hardly adequate for a professional fund trader to get used to. It sometimes get constipated from circuit breaker with 11,000,000 users. This year it is experiencing more because Covid stay at home FT traders.  I will also leave desktop version open esp you have multiple accounts to make sure you are trading from correct account.\n\nIf you like your previous platform please use it.",
        "created_utc": 1595290516,
        "id": "fyprqt8",
        "permalink": "/r/StockMarket/comments/huw4rf/opinions_on_td_ameritrade_app/fyprqt8/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1595319316.0
    },
    {
        "author": "agentchodeybanks",
        "body": "7/17 will be remembered as the day WMT put the keys in the ignition.",
        "created_utc": 1595001648,
        "id": "fydd1e5",
        "permalink": "/r/wallstreetbets/comments/hst6nm/daily_discussion_thread_for_july_17_2020/fydd1e5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595030448.0
    },
    {
        "author": "Atilim87",
        "body": "Honestly since we are talking about a standard the money it generates isn’t all that much potentially.\nYou can’t demand the keys to the faults just because you provide equipment in some areas. \n\nApplications of 5g is probably more interesting than 5g itself",
        "created_utc": 1595002651,
        "id": "fydf2qu",
        "permalink": "/r/investing/comments/hstg5y/5g_long_term_play_in_ericsson_and_nokia/fydf2qu/",
        "score": 1,
        "subreddit": "investing",
        "created": 1595031451.0
    },
    {
        "author": "ghostofgbt",
        "body": "I get it. It's different I think when you trade for a living. I could never use Robinhood. When you do it for a living or day trade heavily you need level 2 data, hot keys, complex order types, watchlists, detailed charts w/ multiple timeframes, etc. \n\nYou'll have to excuse the music lol but check this out: https://www.youtube.com/watch?v=CAYPciJkajI this is old but gives you an example of what you get w/ a real dedicated day trading broker (this is Speedtrader Pro using DAS). This is also just one monitor and looks slow due to the 30fps framerate on the video...in real time it's insanely fast and on the other two monitors I have about 20 more charts so I can watch a whole list of stocks all at once and react in seconds if needed. Watch at 3:25 you'll see how fast the volume comes in on this as someone takes out the last 50,000 shares of a big 150k block that was sitting at $2.45 and how quickly it pushes up from there. You'll never see stuff like this on a broker like RH or Webull. Fidelity and Schwab and the other major ones (like TD, etrade, IB, etc) also have \"pro\" software like this, but it's still very sub-par to something like DAS on centerpoint (edit: IMO of course lol). \n\nAnyway, wasn't trying to insult you. Tbh it's probably unlikely OP even wants to trade like this or needs something this advanced but it's good to know it's out there if so :)",
        "created_utc": 1595044517,
        "id": "fyfk3v5",
        "permalink": "/r/StockMarket/comments/ht5bpk/best_day_trading_platform/fyfk3v5/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1595073317.0
    },
    {
        "author": "TheGhostofSwitzer",
        "body": "Dude on YT who rents multiple houses in LA says the mass evictions probably won't happen because there's no one in the market to replace them with right now. If they've been good tenets, landlords will find a way.\n\nIf anything happens it'll be mass cash for keys, the landlords can't afford that many evictions at once.",
        "created_utc": 1596189014,
        "id": "fzuiaeu",
        "permalink": "/r/wallstreetbets/comments/i0zcy7/congress_didnt_reach_a_deal_today_this_means_the/fzuiaeu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596217814.0
    }
]