[
    {
        "author": "l0gicgate",
        "body": "Timeline of events:\n- Started the sub\n- Left for years / minimal activity\n- Once sub was popular he came back and demodded / banned people\n- Pushed his stupid fucking book trying to make a buck\n- Affiliated himself with True Trading Group and attempted to put on a Trading E-Sports type event with outrageous buy-in and shady prize scheme\n- Made fake account u/WSBGod and made some outlandish posts that got us on r/all and then an influx of retards came so he can promote his garbage to them\n- Changed the original logo/banner and removed the original Discord server to promote his\n- Disgruntled mods were somehow able to plan a coup with reddit mods to take him down and it brings us to today!",
        "created_utc": 1586387682,
        "id": "fmuan2v",
        "score": 394,
        "subreddit": "wallstreetbets",
        "created": 1586416482.0
    },
    {
        "author": "avgazn247",
        "body": "Nah he doing big brain moves. Don’t have to pay taxes on two mil if u lose half of it",
        "created_utc": 1586215370,
        "id": "fmn009x",
        "score": 291,
        "subreddit": "wallstreetbets",
        "created": 1586244170.0
    },
    {
        "author": "wadewannabe3",
        "body": "If SPY closes under 244 I will chop my dick off and eat it.",
        "created_utc": 1586390661,
        "id": "fmufznz",
        "score": 210,
        "subreddit": "wallstreetbets",
        "created": 1586419461.0
    },
    {
        "author": "TTUnathan",
        "body": "Calls it is then.",
        "created_utc": 1586395772,
        "id": "fmuoye9",
        "score": 204,
        "subreddit": "wallstreetbets",
        "created": 1586424572.0
    },
    {
        "author": "rushinrussia",
        "body": "If Gordon calls this market 3 days in a row (including today's call, so 2 more) can I buy him a piece of furniture or a bulb or something. Mods hold me to it",
        "created_utc": 1585770960,
        "id": "fm5dmoq",
        "score": 198,
        "subreddit": "wallstreetbets",
        "created": 1585799760.0
    },
    {
        "author": "BingBong-42",
        "body": "i legit think gordon is probably smarter than everyone here so i'll trust it",
        "created_utc": 1585770906,
        "id": "fm5dj04",
        "score": 189,
        "subreddit": "wallstreetbets",
        "created": 1585799706.0
    },
    {
        "author": "74FFY",
        "body": "Deposited and lost $13k out of $15k Friday on some expiring shit. Spent last $2k on some 4/9 SQ calls that dropped to $306 by Monday morning. That shot up to $28k by close but I didn't sell. Tuesday it dropped to $4k by EOD and I didn't sell. Today it grew from around $4-5k at open and I finally sold it at $38k. I'm retarded at basically every point for not selling earlier, but this one worked out. \n\n1,726% gain total, and I guess 11,772% from Monday morning until I sold. \n\n http://imgur.com/a/3dRpzvD",
        "created_utc": 1586380796,
        "id": "fmtxkop",
        "score": 184,
        "subreddit": "wallstreetbets",
        "created": 1586409596.0
    },
    {
        "author": "manufacture_reborn",
        "body": "I got the call from TD, “are you sure you know what you’re doing?” today.\n\nI told them yes, absolutely, that I’m using a “crowdsourced sentiment aggregating platform” to help make my positioning decisions. They seemed cool with that, and I didn’t have to tell them it was you autists.\n\nI’m working harder to hide WSB from my broker than my wife’s boyfriend was with his other girlfriend.",
        "created_utc": 1586380792,
        "id": "fmtxkew",
        "score": 154,
        "subreddit": "wallstreetbets",
        "created": 1586409592.0
    },
    {
        "author": "rtc824",
        "body": "We just hit the top of the bull trap at SPY 273\n\nIf it goes above 273 in the next 30 days I will accept a 6 month ban.\n\n*Edit. Please upvote and make this higher so that the mods see and hold me accountable. I now have skin in the game. Positions? MAR $50p 5/15, AAPL $210p 5/15.",
        "created_utc": 1586294260,
        "id": "fmq7eep",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1586323060.0
    },
    {
        "author": "leveredlloyd",
        "body": "Thanks Kevin. Now let’s take a look at today’s market movers. It looks like BA continues to sh*t bricks, while TSLA has surprisingly been performing well squeezing out short sellers.... **5 min ad about E-Trade commission free trading, followed by Comcast’s “we’re connecting people all over the world”... Jim, tell us what you’re seeing in rates today... crossing over to you @ricksantelli, let’s look at the 10yr curve, that’s the canary in the coal mine",
        "created_utc": 1586373990,
        "id": "fmtjwm9",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1586402790.0
    },
    {
        "author": "Banemorth",
        "body": "What the fuck are we supposed to do about it?  Might as well make the best out of a bad situation.  Ban.",
        "created_utc": 1585770222,
        "id": "fm5c7qj",
        "score": 141,
        "subreddit": "wallstreetbets",
        "created": 1585799022.0
    },
    {
        "author": "totally_not_the_fbi2",
        "body": "It was me my bad, was cashing out to buy some toilet paper",
        "created_utc": 1585768360,
        "id": "fm58npi",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1585797160.0
    },
    {
        "author": "Andrew_the_giant",
        "body": "In the last few weeks /months it's really gone down hill. I feel almost a sense of enlightenment without it. Almost like I can think for myself and play smart trades and actually make money.",
        "created_utc": 1586305801,
        "id": "fmqs095",
        "score": 138,
        "subreddit": "options",
        "created": 1586334601.0
    },
    {
        "author": "CCrest182",
        "body": "It will, however, go up 30 bucks in one day.",
        "created_utc": 1586389177,
        "id": "fmudcji",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1586417977.0
    },
    {
        "author": "Potpourrri",
        "body": "Holy fucking christ lmao\n\n\"Mommy can I sell my options?\"\n\n\"I'll think about it\"",
        "created_utc": 1586211353,
        "id": "fmmsqju",
        "score": 126,
        "subreddit": "wallstreetbets",
        "created": 1586240153.0
    },
    {
        "author": "danny_",
        "body": "It is just me, or is multiple phone calls not quite as bad as $25k lost due to flagged/delayed trades.",
        "created_utc": 1586222009,
        "id": "fmnb0cd",
        "score": 116,
        "subreddit": "investing",
        "created": 1586250809.0
    },
    {
        "author": "Mail_Order_Lutefisk",
        "body": "That is why it is called Wall Street Bets and not Wall Street Dollar Cost Averaging So I Can Drive a Fucking Toyota Camry Forever.",
        "created_utc": 1586293977,
        "id": "fmq6via",
        "score": 111,
        "subreddit": "wallstreetbets",
        "created": 1586322777.0
    },
    {
        "author": "jay9909",
        "body": "&gt; I think they only the owner has is if you use it for commercial use without his permission.\n\n/r/IHadAStroke",
        "created_utc": 1586371611,
        "id": "fmtf0ss",
        "score": 107,
        "subreddit": "wallstreetbets",
        "created": 1586400411.0
    },
    {
        "author": "klept0nic",
        "body": "To a rational human it does but I've found that most people on reddit have a victim mentality and think the world is rigged and out to get them.",
        "created_utc": 1586383307,
        "id": "fmu2f3f",
        "score": 99,
        "subreddit": "stocks",
        "created": 1586412107.0
    },
    {
        "author": "llenders97",
        "body": "i usually sell once i hit 10,000% gains, otherwise just let it expire worthless",
        "created_utc": 1585853564,
        "id": "fm8pedz",
        "score": 97,
        "subreddit": "wallstreetbets",
        "created": 1585882364.0
    },
    {
        "author": "MEGAQUIB",
        "body": "We stopped getting tendies when they took our boy off the logo and made it that caillou looking cuck.",
        "created_utc": 1585863489,
        "id": "fm9827o",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1585892289.0
    },
    {
        "author": "Mooonbound",
        "body": "Why tf is this thread not pinned?  Making me search for it",
        "created_utc": 1586383832,
        "id": "fmu3eln",
        "score": 93,
        "subreddit": "wallstreetbets",
        "created": 1586412632.0
    },
    {
        "author": "SuperomegaOP",
        "body": "Oh shit is that how it works?",
        "created_utc": 1586216370,
        "id": "fmn1pt0",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1586245170.0
    },
    {
        "author": "the_rabble_alliance",
        "body": "Overheard in a basement bedroom after eating tendies:\n\n\"WSB got me.\" Jartek said of WSB. \"That f***ing WSB boomed me.\"\n\nLeBron added, \"They're so autistic,\" repeating it four times.\n\nLeBron then said he wanted to add WSB to the list of subreddits he would be banned from this summer.",
        "created_utc": 1586369729,
        "id": "fmtb0jo",
        "score": 89,
        "subreddit": "wallstreetbets",
        "created": 1586398529.0
    },
    {
        "author": "Drupain",
        "body": "\"vanilla trades\"\n\nI only do BDSM trading, once you've tried it your life will never be the same. You won't even care how much money you lose.",
        "created_utc": 1586217486,
        "id": "fmn3lji",
        "score": 83,
        "subreddit": "investing",
        "created": 1586246286.0
    },
    {
        "author": "BestNarcissist",
        "body": "Sample size of three days during a black swan event?\n\nInteresting, but I'd like to see you keep running at least one of the bots to see how it does long-term.",
        "created_utc": 1585774910,
        "id": "fm5l0c6",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1585803710.0
    },
    {
        "author": "I_have_a_dog",
        "body": "We are at the start of 15 days to slow the spread. We must use these 30 days wisely. Once we have done our part and stayed isolated for 45 days, we can begin to go back to normal. 60 days may seem like a long time, but it will go quickly. After the original 90 days  of isolation is over, we can reevaluate the need to continue this lockdown past 120 days. \n\n-Mike Pence",
        "created_utc": 1586300243,
        "id": "fmqign1",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1586329043.0
    },
    {
        "author": "Unstoppable001",
        "body": "Delete this post before you jinx it",
        "created_utc": 1585856601,
        "id": "fm8v4wg",
        "score": 77,
        "subreddit": "wallstreetbets",
        "created": 1585885401.0
    },
    {
        "author": "reposado",
        "body": "Seriously. 65% drop and \"WhY isNT IT taNKing?\"",
        "created_utc": 1586390432,
        "id": "fmufkxb",
        "score": 77,
        "subreddit": "stocks",
        "created": 1586419232.0
    },
    {
        "author": "passwordisnotorange",
        "body": "Are you saying that YouInvest was responsible for 9/11? I hadn't heard that before, but I suppose it does sound plausible.",
        "created_utc": 1586212530,
        "id": "fmmuvdu",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1586241330.0
    },
    {
        "author": "Unhinged_Goose",
        "body": "This is beyond retarded.\n\nI love it.",
        "created_utc": 1586294348,
        "id": "fmq7ka4",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1586323148.0
    },
    {
        "author": "xblackout_",
        "body": "It's true I saw it happen",
        "created_utc": 1585777724,
        "id": "fm5q3i0",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1585806524.0
    },
    {
        "author": "bbues",
        "body": "u/Variation-Separate Don't get too discouraged bro that move at the end was absolute bullshit. Really enjoy your guidance on the market. Would love to keep hearing/studying it. Don't let the kids who don't understand that it's not possible to predict every single unknown fucking factor (fed manipulation) and get it right 100% of the time get you down.",
        "created_utc": 1585869243,
        "id": "fm9i6w1",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1585898043.0
    },
    {
        "author": "joyful-",
        "body": "Last time Ray Dalio called a depression publicly and committed his funds to his prediction, he was burned VERY hard (basically went bankrupt). He calls it the defining moment for his career because he learned humility, etc, and he talks about it often. I think he has to be quite confident with a lot of data backing him up for him to call out a depression after what he went through last time.",
        "created_utc": 1586385903,
        "id": "fmu7apa",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1586414703.0
    },
    {
        "author": "Fizzy_T",
        "body": "Come to think of it I don't have a point. Carry on.",
        "created_utc": 1585772072,
        "id": "fm5foe1",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1585800872.0
    },
    {
        "author": "edge13x",
        "body": "So.. Real talk here, guys. I think this is okay to do here, because it's not the daily thread. \n\nI'm pretty new to WSB, but I have been trading [badly] for a long time, and I have to say it's felt like treading water. I used to think that unless I was some trust fund baby with 2mil in cash waiting to be invested, it was gonna be the long haul for me.\n\nThen I found WSB, and it was great, but with each gain, there'd be things I couldn't control, or I'd chase the advice of people who didn't really do their DD. I was convinced that with all the bad news we were getting, that stocks would plummet last week, as I learned the hard way something I [and I would imagine, all of us] already knew -- the market doesn't do what it is supposed to, it does what the MMs want it to do, and in the process it takes advantage of the common trader.\n\nBut every once in a while, we get someone like /u/Variation-Separate who not only takes the time to share his secrets, but breaks it down for us, interacts with the community, and even fucking gives us confidence when the market seemingly isn't following the prophecy. He doesn't have to do any of this.\n\nI cannot do what he does as well as he does it. Not yet. But I am thankful for the knowledge I've gained, thankful for the tendies, and thankful for having my faith in good people and challenging corrupt systems resurrected.\n\nMuch love, OP. It's a rough time for a lot of people out there. You're a godsend.",
        "created_utc": 1585773213,
        "id": "fm5hssv",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1585802013.0
    },
    {
        "author": "SignalEngine",
        "body": "What are you gonna do if it drills tomorrow and friday? Surprisingly paper hands from a guy with such massive balls.",
        "created_utc": 1585773768,
        "id": "fm5iuo0",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1585802568.0
    },
    {
        "author": "tstehler1",
        "body": "I saw Questrade at a grocery store in Los Angeles yesterday. I told him how cool it was to meet him in person, but I didn’t want to be a douche and bother him and ask him for photos or anything.\nHe said, “Oh, like you’re doing now?”\nI was taken aback, and all I could say was “Huh?” but he kept cutting me off and going “huh? huh? huh?” and closing his hand shut in front of my face. I walked away and continued with my shopping, and I heard him chuckle as I walked off. When I came to pay for my stuff up front I saw him trying to walk out the doors with like fifteen Milky Ways in his hands without paying.\nThe girl at the counter was very nice about it and professional, and was like “Sir, you need to pay for those first.” At first he kept pretending to be tired and not hear her, but eventually turned back around and brought them to the counter.\nWhen she took one of the bars and started scanning it multiple times, he stopped her and told her to scan them each individually “to prevent any electrical infetterence,” and then turned around and winked at me. I don’t even think that’s a word. After she scanned each bar and put them in a bag and started to say the price, he kept interrupting her by yawning really loudly",
        "created_utc": 1586384756,
        "id": "fmu548n",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1586413556.0
    },
    {
        "author": "mrpoodles11",
        "body": "All I know is that if the market keeps being pumped up like this, when the crash does come down the road it is going to be absolutely fucking apocalyptic. I’m a gay bear for sure but I think downturns are honestly a healthy part of the business cycle. The idea that we should stop any stock market downturn with monetary policy is pretty crazy to me, but I’m also autistic as shit so what do I know.\n\nTL;DR buy a nice rifle, armor plates, and night vision goggles for long-term investments.",
        "created_utc": 1586207278,
        "id": "fmml5gv",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1586236078.0
    },
    {
        "author": "theknowndude",
        "body": "this will probably be the best advice i ever gave:\n\nyou dont want to hold jnug for longer than a week, in fact don‘t buy it at all",
        "created_utc": 1585783286,
        "id": "fm5zr5j",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1585812086.0
    },
    {
        "author": "dbgtboi",
        "body": "You want to know what would scare this market more than 100% unemployment and banks collapsing? The fed announcing that unlimited QE is over, we would easily hit a level 2 circuit breaker, and maybe for the first time in history level 3. Nothing scares the markets more than the fed saying they won't prop it up, look back at the end of 2018.",
        "created_utc": 1586388747,
        "id": "fmuckij",
        "score": 65,
        "subreddit": "investing",
        "created": 1586417547.0
    },
    {
        "author": "rusty_kx",
        "body": "Hey idiot, this virus grows exponentially and estimations are largely based on current data. The shit changes as it goes.",
        "created_utc": 1585857558,
        "id": "fm8wxr5",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1585886358.0
    },
    {
        "author": "4P87xfBDHcfhcMwI",
        "body": "And put it on pornhub?",
        "created_utc": 1586389361,
        "id": "fmudohj",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1586418161.0
    },
    {
        "author": "Variation-Separate",
        "body": "Thanks. I can swing the momentum, but not everyone can day trade. I want to show that having a plan and strategy, and sticking to it is the most important. Otherwise your conviction at the critical moment will always crumble.",
        "created_utc": 1586197436,
        "id": "fmm28sn",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1586226236.0
    },
    {
        "author": "obsessedwithstocks",
        "body": "Guys it’s simple. Just buy a call before it goes up, and buy puts before it goes down.",
        "created_utc": 1585944362,
        "id": "fmcexsx",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1585973162.0
    },
    {
        "author": "edge13x",
        "body": "Reading a lot of comments from concerned people. Very understandable. I'm right there with all of you. I've got a bit riding on this, a lot of which will die if a viable downtrend doesn't start before May and I can't adjust. I don't subscribe to telling people diamond hands, or blindly worshipping VS. We all have to adapt. But I am incredibly appreciative for the time he's put into these posts and educating us.\n\nThat said, we have no idea yet what will actually happen long term. /u/Variation-Separate has put together a really compelling plan. He didn't have to share it. No one has to follow it. But if you, like me, believe that there is validity and truth in his analysis, then do your own DD to embrace that vibe. Yesterday, people were freaking out in the first two hours of intraday when there was no drop, then we plummeted. Today, we flirted with 252 and are at risk of another leg up. If in the last two days, you have decided that this uptrend in the market is enough to call it quits, no one can blame you, but I would argue, maybe VS's posts aren't for you. \n\nI am a bear rn. I'm a bear not just because I have positions that reflect it -- I truly believe we're in a bad spot, and corporations, MMs, the Fed are being really irresponsible right now.  We're being set up for some horrible economic rebuilding in the 2020s. The longer the market waits to reflect this, the more fucked ordinary people are when they do. They don't have our best interests in mind. Deep down, I want us all to get through this and come out on top.\n\nI hope I'm not foolish in thinking that, collectively, we have the tools and minds to figure this out and at least make a little money before things get really bad. It's a difficult time to have conviction, but that's why I'm here in this thread (and no longer checking the dailies). Keep strong, fellow autists. Let's find patience and figure out what the next move is.",
        "created_utc": 1585865530,
        "id": "fm9br5o",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1585894330.0
    },
    {
        "author": "hamplane",
        "body": "I'm not sure what's with all the salt in this thread, u/variation-separation has been right all along.\n\n1) last Thursday/Friday were the \"biggest trading days of the year\" because we were going to see if we would break through 245 (spoiler, we didn't) and the way I read it, was that if we didn't, we would be due for a big bounce up to retest 265....literally exactly what happened today\n\n2) now the big test is if we will break through 267 (a lot of numbers between 265 and 270 have been tossed out). If we do, expect to continue rallying up and cancel the bear market, if not we'll test 245 again\n\nEveryone, this guy is a gift. Dont ruin this for us and make him run off to top secret elite web, I dont know if I can last if it goes back to being 100% mouth breathers in here instead of 99%",
        "created_utc": 1586204416,
        "id": "fmmfogx",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1586233216.0
    },
    {
        "author": "SJ_Shark_Byte",
        "body": "Disney $130c 4/17 got it",
        "created_utc": 1585866322,
        "id": "fm9d5l0",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1585895122.0
    },
    {
        "author": "redisamyth",
        "body": "Puts it is!",
        "created_utc": 1585863670,
        "id": "fm98dl2",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1585892470.0
    },
    {
        "author": "yaohyuri",
        "body": "It's pretty much much just people bitching about options not printing, hardly anything good anymore. It got to big to quick",
        "created_utc": 1586306053,
        "id": "fmqsfcj",
        "score": 56,
        "subreddit": "options",
        "created": 1586334853.0
    },
    {
        "author": "Life-Observer",
        "body": "market doesn’t care bro. it will just continue to go up. there isn’t any risk or consequences anymore just up.",
        "created_utc": 1586374130,
        "id": "fmtk6yq",
        "score": 55,
        "subreddit": "investing",
        "created": 1586402930.0
    },
    {
        "author": "Ijustquaffed",
        "body": "If tomorrow is green I am selling no matter what for a 95% loss. I can't do it anymore. I can't. I won't.  \n\n*Proceeds to open new retarded positions*",
        "created_utc": 1586207142,
        "id": "fmmkwfn",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1586235942.0
    },
    {
        "author": "lightbeersucks",
        "body": "Unlimited QE and a president pumping the market with false information = rigged\n\nAlso, go educate yourself. It’s very basic finance theory that market are irrational. It might actually be the first they that they say to you in your first day in a fucking finance course.",
        "created_utc": 1585855140,
        "id": "fm8seh6",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1585883940.0
    },
    {
        "author": "MortimerMcMire",
        "body": "over ten million dollars if SPY hits $10 tomorrow\n\nabout $3k if it doesnt",
        "created_utc": 1585771953,
        "id": "fm5fgij",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1585800753.0
    },
    {
        "author": "HinduHamma",
        "body": "Someone gets it. \n\nMarkets dump on uncertainty. That’s a fact of life. Right now there is certainty that this will hurt the economy in the short term . That’s it. We all know record unemployment. We all know companies are guiding down. \n\nAnd it’s only going to last a few quarters to a year maybe. We don’t even need a vaccine  but if one comes to life, great.. Hell we don’t even have one for the flu. Shots don’t do much. Last I checked people still die every year from flu season. \n\nMarket is moving as if this is a short term concern. Which is it. Bears want to believe the sky is falling and the world is going to stay on fire for a long time. When that becomes reality the market will price it in. Right now it ain’t a reality. \n\nRight now there’s no new uncertainty (besides oil drama but that’s a different narrative). But there is more $$ in the system. And that cash is to go somewhere. Stocks are a pretty fucking good place for it to go compared to the other shitty options (bonds, gold, oil, sitting in cash , etc)\n\nThat’s all there is to it. Money supply bigger. Money had to be allocated somewhere. The folks who get to play with this $$ are throwing it into the market. The end. You don’t get to decide where it goes. I know some of you think it’s unwise for it to go into stocks lol. \n\nGood luck on telling them they should pull out and be scared lol. I’m sure they wanna listen to redditors who snort zerohedge articles for breakfast.",
        "created_utc": 1586381080,
        "id": "fmty4l2",
        "score": 53,
        "subreddit": "investing",
        "created": 1586409880.0
    },
    {
        "author": "bluster_cretin",
        "body": "Can confirm. Saw it on reddit.",
        "created_utc": 1585780688,
        "id": "fm5vbnd",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1585809488.0
    },
    {
        "author": "Painpita",
        "body": "So your plan is to sell SPY at the bottom that you don't know, then buy calls for a snap back with a strike price unknown with a upper resistance that you don't know, and make profit out of it?\n\n&amp;#x200B;\n\nSeems bulletproof.",
        "created_utc": 1585799914,
        "id": "fm6psju",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1585828714.0
    },
    {
        "author": "scrapin_by",
        "body": "Say it with me....\n\n“MARKETS ARE FORWARD LOOKING”\n\nRecent data is indicating the curve may be flattening and measures are working. This on top of literally trillions of dollars in stimulus is whats causing confidence to come back again. \n\nNow the market could be wrong, we could double dip and covid19 might take off again.",
        "created_utc": 1586371437,
        "id": "fmtennx",
        "score": 50,
        "subreddit": "CanadianInvestor",
        "created": 1586400237.0
    },
    {
        "author": "PlayFree_Bird",
        "body": "I mean, this is all fine and well and you make some good points, but like so many of these posts lately, it's missing the most important paragraph at the end:\n\n\"Therefore, as an investor, you should...\"\n\nThis sub is about investing and the people here are interested in taking their available money and using it to maximize returns in the long run.  I suppose I just don't see the point of all these posts that all lay out some case for a massive correction or reset or collapse or depression without mentioning what the prudent course forward should be for the average person.\n\nSo, what's the play here?  Sit around with one hand on your gun and the other on your stack of cash waiting for the \"Big One\" to bring the world to its knees so that we can say, \"I told you so\"?  As somebody in another thread said, we can all play armchair analyst and try to figure out why the market isn't behaving the way we expected (or wanted it to), but you can only do that retrospectively.  By the time you figure out why the market is up 25% from two weeks ago, it's already up.  \n\nMaybe the market is due for another dive, maybe not.  But, what should we be waiting for?  We need a conclusion to your thesis here.  \"Therefore, you should...\"",
        "created_utc": 1586378554,
        "id": "fmtt4wz",
        "score": 49,
        "subreddit": "investing",
        "created": 1586407354.0
    },
    {
        "author": "iRelapse",
        "body": "Oh holy shit. I did not realise it was Friday, fucking looks like I'm holding all fucking weekend.\n\nGod damn quarantine fucking with my brain, not knowing what fucking day it is, God damn it.",
        "created_utc": 1585944273,
        "id": "fmcerza",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1585973073.0
    },
    {
        "author": "g____19",
        "body": "My lame buddy was like “brooo you need to go to r / slash / wallstreetbets I just found it and it’s fucking sooo funny brooo”\n\nSo if you see this Dan fuck you, ps your sister is pretty hot and keeps texting me late at night",
        "created_utc": 1585883024,
        "id": "fma3oep",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1585911824.0
    },
    {
        "author": "ghasp",
        "body": "To all those worried: I don't believe that VS meant that the direction of this market depends on today's actions alone. He is saying that there is major support point around SPY 248 - if the market lands above 252, it signals an upward movement to 263 which, if broken, means we are going to 270. If we hit 270, we are going to 300. It would be a sharper \"V\" shape recovery. \n\nTomorrow, or even next week, it is possible to do battle at 248 and win and signal a downward movement towards 231. Here we get into a faster free-fall.\n\nIt looks like a bear flag is happening on SPY and it is possible that the movement down is an escalator. If SPY breaks 263, the bear flag is pretty invalid IMO. VIX would mellow and we could reach the goal, but with more sideways trading (drawn out over months).\n\nCorrect or comment, please\n\nEdit: could also be other continuation patterns, but this theory more aligns with a quicker drop, like the bear flag...",
        "created_utc": 1585875178,
        "id": "fm9rw46",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1585903978.0
    },
    {
        "author": "wolfffman80",
        "body": "I’m with you, I honestly feel like if I sell the tsunami down will be the next day.  How can the market be roaring, it is just nonsense",
        "created_utc": 1586367672,
        "id": "fmt6k67",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1586396472.0
    },
    {
        "author": "EquivalentSelection",
        "body": "I know it might be a totally wild idea...but it just might work.  Brace yourselves, because this could blow your mind.\n\nCreate a new account.\n\nI know, I know... you're going to tell me that it's just not the same.  I know.  That's why it's called a \"new account\".\n\nYour new name shall be SpeaksInBooleansTrue.  You'll get your karma back - you're a hero now.  Nothing but upvotes for you no matter what you say.  You can kill babies and you're still getting upvotes.",
        "created_utc": 1586388131,
        "id": "fmubgp3",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1586416931.0
    },
    {
        "author": "SHITPOST_CENTRAL",
        "body": "My CEO scheduled 1 on 1 meetings with everyone in my department for this afternoon. It was nice knowing u bois",
        "created_utc": 1585772574,
        "id": "fm5glyr",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1585801374.0
    },
    {
        "author": "Posrover",
        "body": "Relax man. Go have a beer or two and check back tomorrow. I’ve seen plenty of these panic posts and it’s something screwy about how it appears right after it expires.",
        "created_utc": 1586381447,
        "id": "fmtyuad",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1586410247.0
    },
    {
        "author": "never_fucking_giveup",
        "body": "Holy shit it went tits up?",
        "created_utc": 1586393181,
        "id": "fmukha6",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1586421981.0
    },
    {
        "author": "kinzaman",
        "body": "Honestly, this. The large players in the market could make SPY go to 350 tomorrow if they wanted to. The market doesn’t reflect fundamentals any more, it’s just a bunch of computers calculating the optimal way to move prices around to take money away from suckers like us.\n\nThe bad news will continue to pile on, day after day and SPY will continue to go up. Then one day, for no discernible reason, it will drop 15%. It won’t make sense to any of us, but someone with deep pockets will profit greatly from it.",
        "created_utc": 1586386036,
        "id": "fmu7jun",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586414836.0
    },
    {
        "author": "Variation-Separate",
        "body": "I said it opens up 300. But they're squeezing everyone so hard. \n\nThursday will sell off. The following weeks will be blood baths.",
        "created_utc": 1586218308,
        "id": "fmn4yli",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586247108.0
    },
    {
        "author": "FuckThisSite2020",
        "body": "&gt; Cuban also said the pandemic will end up improving capitalism with companies putting employees first.\n\nLmao, suuuuure it will",
        "created_utc": 1586380764,
        "id": "fmtxih4",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586409564.0
    },
    {
        "author": "Dildobagginz6969",
        "body": "My favorite thing to do in Vegas.  Get my money back.  It always works out so well.",
        "created_utc": 1586214823,
        "id": "fmmz28u",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586243623.0
    },
    {
        "author": "pie-man",
        "body": "i bet carol baskin had something to do with it",
        "created_utc": 1586316928,
        "id": "fmr98pt",
        "score": 44,
        "subreddit": "investing",
        "created": 1586345728.0
    },
    {
        "author": "Variation-Separate",
        "body": "Yep, you got it. Close under 265.",
        "created_utc": 1586203253,
        "id": "fmmdead",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1586232053.0
    },
    {
        "author": "TriHardSlapper123",
        "body": "I'll take it in cash and buy ice cream for everyone 🍦",
        "created_utc": 1586388925,
        "id": "fmucw2m",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1586417725.0
    },
    {
        "author": "Variation-Separate",
        "body": "First, I said oil would gap down and most likely pull equities. It didn't pull equities and we had divergence.\n\nSecond, I said there would be a sell off on Thursday into close since no one really wants to hold for the long weekend.",
        "created_utc": 1586220823,
        "id": "fmn94cj",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1586249623.0
    },
    {
        "author": "Adios_numero_two",
        "body": "For any bears out there dude I feel you. Shits hit us all in different ways. My parents entrusted our family business accounts to me since I’m getting old enough to learn the ropes to take over one day but they’ve been struggling to keep the business afloat because they lack the cash flow or funds to storm the pandemic weather.\n\n\nThey told me if there’s any way I can invest some of their capital to generate extra funds to keep their store open they’re willing to let me man up and take the opportunity to do so.\n\n\nI took the remaining cash left in all of their accounts and literally dumped it into SPY puts hoping for a humble 2-3x return which will buy them a whole year of operations.\n\n\nMy portfolio is now at 2% of its original worth. I have not told my parents what happened yet. I’ve seriously fucked up. Not only did I ruin their business, but also lost their trust and probably make them regret them ever giving birth such a worthless idiot of a money sink. If I haven’t hit rock bottom yet, this might be it.",
        "created_utc": 1586220121,
        "id": "fmn7yq2",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1586248921.0
    },
    {
        "author": "superwonton",
        "body": "Grandpa how did you make your money?\n\nIn the global pandemic of 2020, your grandpa took his life savings and bought calls in Peloton because he had the foresight that regardless of 30% unemployment, people can't use a regular $200 exercise bike and need a $2300 bike with a $50 monthly subscription so it can sit and collect dust.",
        "created_utc": 1585772100,
        "id": "fm5fq9r",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1585800900.0
    },
    {
        "author": "AloneForever",
        "body": "Got it, buy calls. Thanks for your sacrifice.",
        "created_utc": 1586281027,
        "id": "fmphoyu",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1586309827.0
    },
    {
        "author": "smallchimpu",
        "body": "I wanna tell something to y'all , please get back to your life ,don't watch Batman guy for hours , don't watch futures and market for 18 hrs a day ,there is more to your life , I just realized how many days I wasted :'( ,will just keep my position for now ,but even if I earn I don't think the amount of time invested was worth it , I will probably take a break once this position ends , I am numb rn",
        "created_utc": 1585858942,
        "id": "fm8zm16",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1585887742.0
    },
    {
        "author": "jwd52",
        "body": "So... did everybody here start options trading with a few lucky moves that doubled their money, naively convince themselves that it was an easy thing to do, and then proceed to lose everything and then some with increasingly stupid decisions? Asking for a friend",
        "created_utc": 1585934090,
        "id": "fmbvpo2",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1585962890.0
    },
    {
        "author": "DeltafrogB69",
        "body": "That's exactly the principle he operates on. You don't buy his fund to make 8% a year. You buy a small piece of his fund as insurance so that when shit hits the fan and your main portfolio sinks 30% overnight, your Universa holdings balance it out by going up 600%.",
        "created_utc": 1586393343,
        "id": "fmukrv9",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1586422143.0
    },
    {
        "author": "coloradical5280",
        "body": "FFS you guys, few things:  \n\\-- VS has some of the best TA insights I've seen on this sub, but if you don't understand the fundamentals of what he's talking about and market movement in general, then go do something else until fantasy football comes back  \n\n\n\\-- If you have a strong (data driven) belief that the market will test a new low or hit a lower low, pick a strike that's a month or two out from when you think that low could happen...  e.g., NOT APRIL  \n\n\n\\-- Follow that road map, like VS said, and don't freak out in the meantime.  If you think we'll hit 200 by early May, why are you reacting to a 2% move at the beginning of April?  Have an exit date, and an exit PT:  \n\n\nExample:  I think we will retest lows around $217 by the beginning of May.  \nOver the last week I bought 5/15 $240s, $230s  and  6/17 $240s\n\nI will exit these positions if we hit $215.  It could go lower, but your never going to call the bottom so don't try.  Until then, just chill, pay attention but not obsessively.  If something fundamentally changes (e.g., and effective treatment gets approved) reconsider your theory.  \n\n\nStay calm, and stop watching Batman. Go outside, take a walk, learn to play an instrument or code or something.",
        "created_utc": 1585860777,
        "id": "fm931xk",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1585889577.0
    },
    {
        "author": "Charliebush",
        "body": "Not by OP tho. I heard Questtrade was threatening to burn their own office down and pin it on OP.",
        "created_utc": 1585865648,
        "id": "fm9byo7",
        "score": 39,
        "subreddit": "investing",
        "created": 1585894448.0
    },
    {
        "author": "motley_bruin",
        "body": "Unless Fibonacci can time travel the quantum realm and unplug Powell’s printer I don’t see it happening",
        "created_utc": 1586280581,
        "id": "fmpgtlt",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1586309381.0
    },
    {
        "author": "KremlinBot79",
        "body": "Just so he can lose it again on options expiring in four hours.",
        "created_utc": 1585787804,
        "id": "fm67acw",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1585816604.0
    },
    {
        "author": "Variation-Separate",
        "body": "Couldn’t have said it better. Thanks.",
        "created_utc": 1585875224,
        "id": "fm9rypu",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1585904024.0
    },
    {
        "author": "bazookatroopa",
        "body": "1821+ recorded deaths today...\n\nHeart disease - 1700/day\n\nCancer - 1600/day\n\nEven without many deaths being recorded... COVID-19 is now officially the most deadly thing in the US and it hasn’t even begun to peak \n\n5/1 SPY 420c",
        "created_utc": 1586295768,
        "id": "fmqa5m1",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1586324568.0
    },
    {
        "author": "GermyBones",
        "body": "BRRRRRR\n\nThat's it. That's the whole bull thesis.",
        "created_utc": 1586371451,
        "id": "fmteonz",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1586400251.0
    },
    {
        "author": "726bh",
        "body": "Thanks guys I don't need your apologies just do your crazy yolo options and if you win big do it for him",
        "created_utc": 1586212927,
        "id": "fmmvl5l",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1586241727.0
    },
    {
        "author": "saeuta31",
        "body": "I also want a \"fuck questrade\" flair. Just to remind me to never use it",
        "created_utc": 1585866779,
        "id": "fm9dyf1",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1585895579.0
    },
    {
        "author": "SensualKoala",
        "body": "POKIMANE IF YOURE READING THIS PLEASE REMEMBER THE TIME I SOLD MY HOUSE AND DONATED ALL MY MONEY TO YOU\n\nMY WIFE LEFT ME AFTER CHEATING ME WITH MY BEST FRIEND, THAT WAS ALSO MY DOG, NOW IM DIVORCED, HOMELESS AND DOGLESS\n\nBUT IT WAS ALL WORTH IT\n\nI LOVE YOU POKIMANE",
        "created_utc": 1586380283,
        "id": "fmtwknt",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1586409083.0
    },
    {
        "author": "Thieman15",
        "body": "GEX: -773m\nDIX: 51.1%\n\nMy interpretation: Market makers are short gamma (GEX is negative), meaning they’ve sold a lot of option contracts. In order to delta hedge those contracts they are having to sell more underlying equities which is putting even more downwards pressure on the market. \n\nGiven that DIX is the second highest print the system has ever seen, even on a -5% day, it’s likely that market makers are being forced to buy to prevent an even greater collapse. Correct me if I’m wrong here but this could get ugly tomorrow.\n\nEdit: looking at December 2018 recovery we saw a large discrepancy between the DIX and GEX. DIX was in the high 40’s and GEX was extremely negative. Negative gamma causes the movement of the market to be accelerated, no matter if it’s up or down. In the 2018 recovery it was an upward movement...today we’re seeing a downwards trend. This is why I think it will continue to trend downwards.",
        "created_utc": 1585782589,
        "id": "fm5yk7y",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1585811389.0
    },
    {
        "author": "SaveMyElephants",
        "body": "After awhile you get used to it. I actually enjoyed playing with their little mushroom in Thailand",
        "created_utc": 1586370445,
        "id": "fmtcjb2",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1586399245.0
    },
    {
        "author": "silicapacks",
        "body": "This is my favorite thread, feel like the IQ avg is higher here, but some of these comments are cringeworthy. VS is obviously a nice guy, not just because he shares his thoughts, but mostly because he's willing to answer VERY REPETITIVE UNNECESSARY questions. Here's the thing, when you constantly ask questions and bring doubt into the conversation, a good trader will lose their way. Pressure can also be detrimental, so the high praises and nut licking doesn't help. We all lost a lot of money here, so please chill out so your \"Messiah\" can focus.\n\nOn a brighter note, for those who need some bias to get through the night:\n\n1. SPY closed at 251.83. If I was a MM and I had a dick load of puts headed my way tmmw, knowing the feared resistance line is 252, I'd crank it up to 251.99 just to fuck with you.\n2. Gundlach is shorting.\n3. Goldman sees 200 by mid year.\n4. SPY gap at 230. SPY always fills its gaps.\n\nNote to self: Stop betting against TSLA, you fuckin bafoon!!!!!!",
        "created_utc": 1585864029,
        "id": "fm990ve",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1585892829.0
    },
    {
        "author": "StonkAutist",
        "body": "Against my better judgement I held today - I really believed in the thesis. Too bad all the government cares about is propping up the market to keep the rich rich. \n\nFor those with losses just know I went all in on these puts and lost 90k in the last week. \n\nIt could be worse. \n\nCheers.\n\nEDIT: the Thesis also made me 180k on the first leg down so I’m not broke. Just pissed i nuked it after i made it.",
        "created_utc": 1585858941,
        "id": "fm8zlyx",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1585887741.0
    },
    {
        "author": "jaehoony",
        "body": "Devil's advocate counterpoint: You know how during a bubble, we look at all those indicators you just mentioned and think, this is clearly an insane bubble and it will pop soon, but it doesn't and just keeps growing for years? What if that just keeps on happening?",
        "created_utc": 1586384808,
        "id": "fmu57qp",
        "score": 36,
        "subreddit": "stocks",
        "created": 1586413608.0
    },
    {
        "author": "CC_1138",
        "body": "LOOOOOOOOOOOL man’s gonna yolo all that dough into something really retarded and lose it all",
        "created_utc": 1586286763,
        "id": "fmpsyec",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1586315563.0
    },
    {
        "author": "bliss16",
        "body": "SPY $330C 4/17 got it",
        "created_utc": 1586383089,
        "id": "fmu207d",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1586411889.0
    },
    {
        "author": "Lead5alad",
        "body": "It is almost funny how a bunch of people on this sub (including myself) lost money buying OTM calls that expire in 30 minutes during the historical witching hour, and then just a few days later we get to see one of the biggest run-ups ever.\n\nTypical wallstreetbets fashion to be somewhat right, but to still lose a lot of money",
        "created_utc": 1586207286,
        "id": "fmml5zh",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1586236086.0
    },
    {
        "author": "rawj5561",
        "body": "/u/variation-separate, if you notice me, it will be a ray of shining light on my portfolio of blood red darkness.",
        "created_utc": 1586196531,
        "id": "fmm0isz",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1586225331.0
    },
    {
        "author": "TheLegendTwoSeven",
        "body": "Hey Finance Fam, it’s StockWhiz69 here with more dope-ass stock tips! Just the tip, lmao, am I right, famma-lam?\n\nBut before we get started, make sure to *smaaaaaaash* that Like button, tap the ass of that Subscribe button, and ring that notification bell. [Doorbell chime sound.]\n\nToday’s stock of the day is an old-school stock called Enron. A lot of old ass motherfuckers used to make bank on this shit in the late 90s and the early 2000s, I guess during the Vietnam War or some shit. Anyway, this shit was lit, they had dope ass energy products and MA BOI Kenneth Lay is the CEO! His fucking last name is **LAY**! So you know my boi KL lays more pipe than just oil pipelines. He’s probably getting *all* the Dallas Cowboy cheerleaders pregnant.\n\nSo that brings us to tip 2. Before you invest in a company, always look at the CEO. If he looks like a fuckin’ nerd, **left swipe that bitch**. But if he’s a dope-ass motherfucker with a bangin’ name? Back up the truck, and get ready to make a buck.\n\nAlright that’s all the tips I got for you right now. I’mma bout to to hit the bong and trade some Tesla and Carnival Cruise options.\n\nAnd don’t forget to sign up for Battle Legends using my affiliate code. You’ll get 65,000 gold coins. Alright? PEACE!",
        "created_utc": 1585956972,
        "id": "fmd116l",
        "score": 32,
        "subreddit": "investing",
        "created": 1585985772.0
    },
    {
        "author": "addictedtothetendies",
        "body": "He really locked up ma nigga Fauci",
        "created_utc": 1585868263,
        "id": "fm9gi67",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1585897063.0
    },
    {
        "author": "WholeThang",
        "body": "The last 2 or 3 full retard pump have been followed by massive dumps. I’ll be sleeping fine tonight with ma poots",
        "created_utc": 1585857626,
        "id": "fm8x2es",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1585886426.0
    },
    {
        "author": "jukito1",
        "body": "Holy shit masks ordered to MA were seized by NY. This is fkn disaster",
        "created_utc": 1585864574,
        "id": "fm9a0ws",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1585893374.0
    },
    {
        "author": "Reganato",
        "body": "So, at some point in history, I don't fucking know exactly when, some old white dude wanted to steal all the gold so he took it all back and switched us all to fiat currency.  Or maybe that was some later old conspiratorial white dude.  Anyway, no longer backed by a tangible asset, but rather by the \"faith and credit\" of the US, we started using money that couldn't be turned into gold.\n\nHas the same thing happened with stocks?  Earnings aren't here yet, and who knows what the damage is to the companies traded, but have we silently, through ma and pop retail investors, indexes, fed pumping, etc., also changed the stock market to fiat stocks where my shares of SPY have nothing to do with the value of the underlying companies, and everything to do with the \"faith and credit\" of the good ole Ameri-cone dream?  \n\nSeriously, is there any other way to explain the behavior of the markets lately?  Fiat stocks.  Think about it.",
        "created_utc": 1585870067,
        "id": "fm9jlgm",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1585898867.0
    },
    {
        "author": "Ah_The_Elusive_4chan",
        "body": "Why MasterCard visa and discover? People not being able to make payments?",
        "created_utc": 1585949556,
        "id": "fmcobq5",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1585978356.0
    },
    {
        "author": "Ivan_moskv",
        "body": "Ma man",
        "created_utc": 1585943798,
        "id": "fmcdwmm",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1585972598.0
    },
    {
        "author": "JeffBezosNewWife",
        "body": "The news isn’t moving this market - Traders are. Look at how spy moves in accordance to fib levels and the 200 day MA",
        "created_utc": 1585876435,
        "id": "fm9tu57",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1585905235.0
    },
    {
        "author": "qwpajrty",
        "body": "Where ma boy fauci",
        "created_utc": 1585949131,
        "id": "fmcnks1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1585977931.0
    },
    {
        "author": "Happylittle_tree",
        "body": "Don't really care about SPY but ma boi VIX is dying 😢",
        "created_utc": 1585944200,
        "id": "fmcen81",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585973000.0
    },
    {
        "author": "bored_yet_hopeful",
        "body": "Visa and MasterCard don't actually loan to people though, people not paying their cards off won't affect them.",
        "created_utc": 1585951700,
        "id": "fmcs23l",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585980500.0
    },
    {
        "author": "MrCreateWealth",
        "body": "If you sold these options you’re going to be in a world of hurt. Why in the tf would you sell puts in a bear market, especially at the peak of a bounce? Especially Shopify which rejected a 50 day MA this past week, and is on its way to test the 200 day MA. Gotta learn the hard way I guess\n\nEdit: OP buy your options back right after open during the AM bounce. Take the L and don’t wait it out.",
        "created_utc": 1585788173,
        "id": "fm67wbl",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585816973.0
    },
    {
        "author": "fettywap17388",
        "body": "Retail is dead.\n\nOil sector is dead.\n\n  \nHonestly I think Mastercard and visa, discover are fucked.",
        "created_utc": 1585949490,
        "id": "fmco7iq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585978290.0
    },
    {
        "author": "arzt506",
        "body": "Literally my post says past performance is no longer predicting predicting future performance... that’s like exactly what it says. Jesus Christ you people are stupid. The 200 MA was support for 9 years until now it isn’t and appears to be acting as solid resistance. Learn to read.",
        "created_utc": 1585782317,
        "id": "fm5y3at",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585811117.0
    },
    {
        "author": "jiraiya73",
        "body": "you need to get past 240 first. there will be battle 238 to 240\n\non 15min chart, 3 red candles well below 200 MA \n\nIm watching a trendline that gives a shot at 240 by EOD. Slow trajectory to 240\n\nAs long as there is no fuckery from JPow",
        "created_utc": 1585760027,
        "id": "fm4skcr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585788827.0
    },
    {
        "author": "ymi2f",
        "body": "At the president's direction I'm going to finger pop ma asshole.",
        "created_utc": 1585950535,
        "id": "fmcq15i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585979335.0
    },
    {
        "author": "mfaletti",
        "body": "Microsoft, Apple, Amazon, Merck, JP, Disney, Google, FB, NVDA, Visa/MasterCard, Delta, Medtronic, McDonalds, MGM, BA",
        "created_utc": 1585863992,
        "id": "fm98yds",
        "score": 3,
        "subreddit": "stocks",
        "created": 1585892792.0
    },
    {
        "author": "Jeffster54",
        "body": "Yeah dont know how shits gonna play out here in MA they’ve suspended evictions but blocked a rent freeze proposal. Most had saved up for a month at least so you probably right",
        "created_utc": 1585758991,
        "id": "fm4ql6v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1585787791.0
    },
    {
        "author": "KevinMKZ",
        "body": "Thanks, I don't have 100 shares of Visa, but I bought a SPY 270 Put that expired 3/23 and I sold it 3/19. \n\nI didn't realize maximum profit but it hedged my portfolio, and I used the profit to buy stocks that I think are good long term investments, FB, GOOGL, MA, V. \n\nI held equities throughout the downswing but my put was hedging a position larger than my equity so as the market was plunging my portfolio value was going up. I'm in a better position now than if I hadn't insured my portfolio.",
        "created_utc": 1585769875,
        "id": "fm5bjh4",
        "score": 2,
        "subreddit": "investing",
        "created": 1585798675.0
    },
    {
        "author": "SeabassJohn",
        "body": "My MACD X3, RSI, 69 day MA chart has a death cross forming",
        "created_utc": 1585938604,
        "id": "fmc48g7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1585967404.0
    },
    {
        "author": "AvgJoeCrypto",
        "body": "Ma and Cali not touching.  Very good.",
        "created_utc": 1585869890,
        "id": "fm9jalq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1585898690.0
    },
    {
        "author": "letthegooseloose",
        "body": "Your Disney puts are going to print too. Dont you worry ma friend.",
        "created_utc": 1585778135,
        "id": "fm5qu7a",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1585806935.0
    },
    {
        "author": "cheetoo621",
        "body": "If businesses go bankrupt, small ma and pa eateries and hair salons etc, the jobs are lost. If they come back on one leg they may only have the $$ to fund a portion of their previous payroll",
        "created_utc": 1585845981,
        "id": "fm8aszv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1585874781.0
    },
    {
        "author": "BattletoadRash",
        "body": "I'd stay away from companies that could go bankrupt or require bailouts until the dust settles. Well, depending on your risk tolerance. There are potential big gains there but also potential big losses. Unlike with sports, with the stock market, sometimes every team can lose lol. \n\nI'm planning to buy a bunch of stocks over the next few days/weeks/months depending on how things shake out. 5 low risk stocks: AAPL, MSFT, GOOGL, MA, V. 5 medium risk stocks: SBUX, MCD, JPM, DEO, DIS. 5 higher risk stocks: MGM, SYY, YUM, MAR, UBER. Will have to keep a close eye on those last 5 before jumping in. \n\nPlus a bunch will go in ETFs: 1/3 in QQQ (tech heavy, tracks to NASDAQ), 1/3 in MTUM (tracks to S&amp;P movers), 1/3 in LGLV (large cap low volatility). Between the 3 it's a pretty good swath of the market in general but should outperform.",
        "created_utc": 1585770590,
        "id": "fm5cx77",
        "score": 2,
        "subreddit": "stocks",
        "created": 1585799390.0
    },
    {
        "author": "HKane10",
        "body": "My kids in MA went to online learning on the third day of no school. It’s weird how your town was so far behind!",
        "created_utc": 1585781568,
        "id": "fm5wt67",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1585810368.0
    },
    {
        "author": "digitalfakir",
        "body": "The fuck are *you* talking about? MA is a lagging indicator, *at best*. Or are you confusing \"MA\" mentioned in methods like ARIMA as the MA you put on your charts?",
        "created_utc": 1585728321,
        "id": "fm3lzlw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585757121.0
    },
    {
        "author": "smoothtrex",
        "body": "Apple and google pay are pretty common but in their current state all you do is load it with a regular credit or debit card. So in most cases you are still using a regular visa or MasterCard card to fund the wallet. In China it’s different there is no intermediate layer, those apps pull money straight from your bank account.",
        "created_utc": 1585747620,
        "id": "fm46eza",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585776420.0
    },
    {
        "author": "darius_is_op",
        "body": "Loved reading, super interesting! Please definitely post more!\n\nWhat was the thought process around the 9 day MA telling you to go in at 2630? Looks like the 9 day SMA/EMAs were roughly 240-250 if I'm not mistaken - what does that tell you?",
        "created_utc": 1585728116,
        "id": "fm3lsov",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585756916.0
    },
    {
        "author": "indoloks",
        "body": "theta gang ma dood.. shits been paying out",
        "created_utc": 1585750436,
        "id": "fm4av6j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585779236.0
    },
    {
        "author": "imadummyoptionsyay",
        "body": "Um, hes joking around. You really think these will be ITM by April 3rd? lmao. They won't ever be ITM most likely. I own the same puts, down 78%. No point sell lol\n\nI enjoy melting crayons and dripping the hot wax on ma nutzz",
        "created_utc": 1585753354,
        "id": "fm4fxmz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585782154.0
    },
    {
        "author": "LivinLike",
        "body": "Battle for the 50 MA close",
        "created_utc": 1585771137,
        "id": "fm5dyiy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585799937.0
    },
    {
        "author": "couey",
        "body": "When someone’s running -2000 bank account because they can’t work, have to make rent, bills eat and provide for the family before a single dollar comes in from unemployment and stimulus, it’s not a bonus to go get a pair of beats by jpow headphones. \n\nYes those who still live with ma in the attic, have no bills, will be showing off on instabook their stimulus money. That’s not real life.",
        "created_utc": 1585849822,
        "id": "fm8i5l5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585878622.0
    },
    {
        "author": "Hey_Jimbo",
        "body": "**New Investor seeking judgment on portfolio!**\n\nHello everyone, I've recently compiled a watch list of some stocks, ETFs, and a mutual fund. My ultimate goal is to generate long-term growth. Please give me any thoughts or critiques you may have. Thanks a million! \n\nStocks: LULU, CPRT, MGRC, MSFT, ADBE, MA, PAYC, PFSI, NMIH | ETFs: FTEC, SCHG, SMH, SPYG | Mutual Fund: TRIRX",
        "created_utc": 1585942058,
        "id": "fmcao6y",
        "score": 1,
        "subreddit": "investing",
        "created": 1585970858.0
    },
    {
        "author": "Hip-H0pAn0nym0us",
        "body": "So I wanted to start dollar cost averaging into the market, weekly, and I bought shares a few weeks ago in a few companies. I think I timed my buys really well actually. I bought MSFT for $136, CRM for $119, NKE for $61, and MA for $215. However, right after I bought, we had the rally, and prices haven’t really gotten back down to where I first bought in. This has been making me hesitant to continue buying in, because I thought prices would keep falling. Am I making a mistake by not continuing to buy in weekly? Do you think prices will get back down to those levels? I’m worried that next week we’ll have another “bear market rally” and prices won’t get back down to where I’m hoping. But I also realize that they could, it just may take longer than I’m expecting. I also realize that by dollar cost averaging, I should stick to my set buying interval. Maybe weekly was to aggressive and I should do monthly? Thoughts?",
        "created_utc": 1585944948,
        "id": "fmcg0cq",
        "score": 1,
        "subreddit": "investing",
        "created": 1585973748.0
    },
    {
        "author": "BearBearChooey",
        "body": "MA and V-they’ve been stated multiple times on this sub but we will continue to move towards a cashless society. They still have massive room to grow over seas. Mise well add PYPL too\n\nZTS-Animal pharma has a ton of room to grow still. They’re the leaders in it. I wish I would have bought this stock when it spun off of PFE back in like 2012. Little shoutout to CHWY too, I think they have some nice value to grow. Could they become the amazon for pet parents?! \n\nPANW-Cyber Security will continue to be needed and in demand. \n\nMTCH-More and more people will move towards online dating in the future I feel. \n\nMGM (or other casinos)-Who will benefit from complete legalization of sports betting across the US? Lookout for DraftKings becoming public soon too. \n\nTTD-global tech advertising will continue to grow\n\nTGT-they’ve become the “my wife spends too much money there” joke. I don’t know a mom who dislikes Target. Can they compete somewhat in online retail with Amazon? Will also mention COST here. Everyone seems to love COST too that I talk to. \n\nKO-my safe dividend stock. Coke isn’t going anywhere in 10+ years. MCD and WM are some other good ones mentioned on this sub.",
        "created_utc": 1585950929,
        "id": "fmcqq4d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585979729.0
    },
    {
        "author": "imadummyoptionsyay",
        "body": "I got NO RAGRETS tatted on ma chest. Never ragret anything\n\nexcept that tattoo as I spelled it wrong. Oh, and loosing shitloads of money by thinking option trading was not straight up gambling ya\n\nOh, and, like my whole life :(",
        "created_utc": 1585837561,
        "id": "fm7vdlk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585866361.0
    },
    {
        "author": "ViceIntoVirtue",
        "body": "i dont think so becuse the 50 and 150 ma dident cross yet the macd isent bullish and ate that point it wasent worth the time for me to investigate more so maybe tomorrow or next week",
        "created_utc": 1585842091,
        "id": "fm83gjq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585870891.0
    },
    {
        "author": "Random-Guy-555",
        "body": "I bought some in the 30's range and 28 range.  I have about 400$ on it right now.  I'd rather have Visa or Mastercard, but I invested 700$ in Visa around Dow 18k and I'm waiting for it to get to that level again so I can buy Mastercard.\n\nBarrons said the MVP - Mastercard, Visa, and Paypal companies had a better return in years past than FANG- Facebook, Apple, Netflix and Google.\n\nSo I'm all about payment technology.  I won't probably buy anymore Discover though unless it goes under 20$.",
        "created_utc": 1585936922,
        "id": "fmc136i",
        "score": 1,
        "subreddit": "investing",
        "created": 1585965722.0
    },
    {
        "author": "supervisord",
        "body": "200 day MA?\n\n\nWell I held onto my puts today, got 4 market days to see if they print.\n\n\nFat chance...",
        "created_utc": 1585953279,
        "id": "fmcutwc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585982079.0
    },
    {
        "author": "GromGrommeta",
        "body": "If $1000 will be the total sum of your portfolio, I'd do something like:\n\nAbout $500 SP500 (2 shares SPY)\n\n$300 Microsoft (2 shares)\n\nand something like V/MA for the rest. Even with the short-term carnage, I don't see airlines outperforming tech or even the broader market over the long-term. Just my opinion of course.",
        "created_utc": 1585964746,
        "id": "fmdczbq",
        "score": 1,
        "subreddit": "investing",
        "created": 1585993546.0
    },
    {
        "author": "Osmosis_Bones13",
        "body": "Damn most of my local gas stations here in NY won’t even accept cash as a payment anymore. Only card\n\nVisa, MasterCard calls eventually. Not yet tho",
        "created_utc": 1585966315,
        "id": "fmdf8a7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585995115.0
    },
    {
        "author": "precrime3",
        "body": " **Thoughts on APT Calls?**\n\n**Original** \\- Entered a call debit spread $11/$13 @ $0.98. Exp: 4/9 Reason I did a spread and not naked was due to lack of capital at time being.\n\nI'm new to TA but wanted to try using what seem to be the most intuitive indicators for me - RSI, VWAP, and 50/200 MA.\n\n**My DD**\n\nWhen I entered the position, RSI seemed good but has gone up to 56 now, so that's got me a little bit worried.\n\nHowever, APT has crossed and come over the 50MA line 3 times in the last 5 days, which I read now as a support rather than a distance. It has also directly bounced off the 200MA which is good to see as well.\n\nMarket EOD was $18.xx or so, but VWAP is around $15\\~. Perhaps a good entry tomorrow for a long position will be if it returns to VWAP, but regarding the explosiveness and nature of the stock I'm also debating just buying ASAP with expiry for next week.\n\nAs for the strike price I'm looking at, I'm looking at around $25/26, which is where it peaked last time in early march.\n\n**Sentiment** \\- Talks about Americans getting used to the idea of having to wear masks. The thing is 3M, DuPont, etc. make PPE (personal protection equipment) but really APT has been sort of the front man of that for a while now. \n\nWith fear going to spike up again this week, I think it'll be good to get in and take a long. Plus volume was only 20 million today, so hasn't been \"discovered\" by the media yet. \n\nAny tips/advice for a newbie would be very beneficial.",
        "created_utc": 1585790901,
        "id": "fm6caam",
        "score": 1,
        "subreddit": "options",
        "created": 1585819701.0
    },
    {
        "author": "Cryptic0677",
        "body": "Anyone know why DFS is cratering so hard compared to V and MA? I get that they don't have as widespread usage, but their P/E is literally 10x less and falling. Down like 70%. Surely they rebound right?",
        "created_utc": 1585925069,
        "id": "fmbf3em",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585953869.0
    },
    {
        "author": "LivinLike",
        "body": "Reading the 50 Day MA was pretty key today. This drop was indicated by a double top attempting to break the 50 Day MA",
        "created_utc": 1585770104,
        "id": "fm5bzhv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585798904.0
    },
    {
        "author": "420Secured",
        "body": "better watch out for Ma-nu-el!",
        "created_utc": 1585777421,
        "id": "fm5pjmr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585806221.0
    },
    {
        "author": "qwpajrty",
        "body": "Ma boy Fauci",
        "created_utc": 1586033113,
        "id": "fmfr4ni",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586061913.0
    },
    {
        "author": "burrito3ater",
        "body": "Except you have to meet certain requirements. The biggest states (CA, TX, NY, MA) don't qualify for one. The Virgin Island literally has 0 on their UI fund.  [https://oui.doleta.gov/unemploy/docs/trustFundSolvReport2020.pdf](https://oui.doleta.gov/unemploy/docs/trustFundSolvReport2020.pdf)",
        "created_utc": 1586022211,
        "id": "fmf8rw3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586051011.0
    },
    {
        "author": "limitbreak09",
        "body": "You might like IGM better.\n\nHere is the top 10 holdings\n\nMSFT, AMZN,APPL, GOOG,GOOGL,FB, V, MA,CSCO,INTC",
        "created_utc": 1586087703,
        "id": "fmhnu6n",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586116503.0
    },
    {
        "author": "gottadothings",
        "body": "What's the play on MA and V, with unemployment high and rising shouldn't personal debt rise? On the flip side there will be a lot less discretionary spending on toys. Leaps?",
        "created_utc": 1586096767,
        "id": "fmhxfg1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586125567.0
    },
    {
        "author": "Jonathank92",
        "body": "It's stock has performed better over recent years. Tbh I don't think you can go wrong with either but I read a few different comparison articles that laid out a compelling case for ma. Stock performance, investment in new technology (AI), etc.",
        "created_utc": 1586095751,
        "id": "fmhwc26",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586124551.0
    },
    {
        "author": "settanitti",
        "body": "Ma and v don't make any interest. They make money on interchange.",
        "created_utc": 1586096968,
        "id": "fmhxnze",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586125768.0
    },
    {
        "author": "gottadothings",
        "body": "Good call, MA looked like it had a very slow recovery.",
        "created_utc": 1586097267,
        "id": "fmhy0m7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586126067.0
    },
    {
        "author": "Turlututu_2",
        "body": "Aphria is a good company and will likely survive. CGC has money too and good leadership now that STZ has effectively taken over and booted out the bums\n\nI think weedstocks have finally hit a bottom as they cannot realistically fall further without getting ridiculous (share prices of CGC and Cron hit levels that were less than the cash they hold in the bank). you'll note that the big weedstocks are actually more bullish than SPY at the moment as they bounced and closed above their daily MA and are holding it unlike the greater market\n\nthat said, the market is irrational and they could easily fall back to retest the lows again. it has happened many times over the last year. it does not help that Ontario just declared weed shops as non-essential. you may want to hold off a bit longer. I think the end of the year will be much better for them than this current limbo period. weed will eventually be one of the biggest growth industries of the decade imo but patience is key",
        "created_utc": 1586103042,
        "id": "fmi5uod",
        "score": 1,
        "subreddit": "investing",
        "created": 1586131842.0
    },
    {
        "author": "StaticInvestor",
        "body": "How much lower will it go? There’s no perfect time! What if we jump 10% in the next few weeks, you’ll be kicking yourself for a long time for not buying now. Things are cheap at SPY 245 compared to SPY 340. Learn this at 17, don’t be greedy. This opportunity will not happen again until you’re 30. Don’t waste it!\n\n30% MSFT\n25% AAPL\n15% AMZN\n7% HD\n5% SBUX\n5% NKE\n5% MA\n3% TJX\n3% LOW\n2% NVDA\n\nHere’s an example of what I have done with one of my portfolios, this is a portfolio for extreme growth for someone who is under the age of 20 and has many years of investing ahead of themselves.",
        "created_utc": 1586007540,
        "id": "fmelh3e",
        "score": 1,
        "subreddit": "investing",
        "created": 1586036340.0
    },
    {
        "author": "rmanthony7860",
        "body": "The reports do a good job of laying out both positives and negatives of a stock.  This is important when buying because there have been times when I haven’t realized possible bear cases for a company.  One that comes to mind is MasterCard. The Morningstar rating is high, but the do a good job laying out the future issues it may face and why it’s current PE valuation is so high.",
        "created_utc": 1586026934,
        "id": "fmfgszn",
        "score": 1,
        "subreddit": "investing",
        "created": 1586055734.0
    },
    {
        "author": "thedongthrowaway",
        "body": "Worried for ma puts.\n\nThis week trump could shit tweet his way to the thursday oil deal saying ”things are looking VERY good” or the market simply trades sideways in anticipation of a deal\n\nCongress back in session late april may start another stim package since $2t isn’t enough. \n\nNY cases may peak in a week or two, and once cases start dropping off, market gets optimistic since NY represents the focal point of the epidemic. Nobody will give a shit floridans or texans dying and will feel that if NY is getting better, then the rest of the country can get there too.\n\nSometime in May there may be a treatment coming out with the 400+ studies currently going on. We can’t rule this possibility out, we are all retards here so who are we to say there’s no way there will be a treatment.\n\nI just don’t see another big catalyst to cause a drop. Market is already adjusted to the unemployment numbers and corona cases anyway, gradual increases every week aren’t surprising anymore.",
        "created_utc": 1586071659,
        "id": "fmh9suf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586100459.0
    },
    {
        "author": "Jonathank92",
        "body": "Nothing wrong with those either just had to make a cut off. MA for more growth potential.",
        "created_utc": 1586079840,
        "id": "fmhh2u5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586108640.0
    },
    {
        "author": "TempleOfAlpaca",
        "body": "\nYou do realise there’s only one type of media in China, and that’s the official one right? Like everything is state owned. Being pro China is, unfortunately, like the basic requirement to exist in HK, not in China. As for the protests, You’ve Got to Be Shitting me.\n\nLet’s see this footage on the 11/11 protest\n\nhttps://youtu.be/0KitF7Eh7HE\n\nUnarmed guy, literally walking by\n\nLet’s see the HkFP version\n\nhttps://hongkongfp.com/2019/11/11/breaking-hong-kong-police-shoot-protester-live-round-sai-wan-ho/\n\nNow compare it to the SCMP version:\n\nhttps://www.google.com.sg/amp/s/amp.scmp.com/comment/opinion/article/3037983/hong-kong-crisis-protest-violence-wrong-government-inaction-worse\n\nPro Beijing, all the way, only reason jack ma bought it is to promote China to the western world. Never expect a Chinese businessman to act on profit, the will of CCP will always be more superior than any amount of economic gains or even free will.",
        "created_utc": 1586136833,
        "id": "fmjsisg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586165633.0
    },
    {
        "author": "lKuzon",
        "body": "Which stocks would u hold in medium long term like 2 years? U can rank the following stocks.\n\n\\- Bayer AG\n\n\\- Volkswagen AG\n\n\\- HeidelbergCement AG\n\n\\- Gazprom OAO\n\n\\- HUGO BOSS\n\n\\- Ethereum\n\n\\- Luckin Coffe Inc.\n\n\\- VISA\n\n\\- Mastercard\n\n\\- Facebook\n\n\\- Google\n\n\\- Disney\n\n\\- Alibaba",
        "created_utc": 1586175884,
        "id": "fml1au2",
        "score": 1,
        "subreddit": "investing",
        "created": 1586204684.0
    },
    {
        "author": "Shaxx100",
        "body": "Nah ma boi. Seeking alpha and other investing sites are full of bears commenting how bad its gonna be. When these comments pass we are in a bull trap. However there are zero bulls over there. Lol. Friday was a beartrap.",
        "created_utc": 1586177099,
        "id": "fml2sse",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586205899.0
    },
    {
        "author": "Blackwhitehorse",
        "body": "Looking into puts on MA... Talk me out of it.",
        "created_utc": 1586180794,
        "id": "fml7y9v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586209594.0
    },
    {
        "author": "Nansk",
        "body": "jack ma started his business in china, doesn't even have a green card, and never worked for any US companies. At some point you gotta realize it's probably better to go back to the \"they took err jerbs\" narrative than whatever you people are doing rn.",
        "created_utc": 1586084415,
        "id": "fmhkw1b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586113215.0
    },
    {
        "author": "RandomDesign",
        "body": "Damn, is Mass up to that much?  It used to be much lower (I worked for MA DET for 8 years in IT and worked on claims processing automated systems which is why I know a fair bit about how they work).\n\nIn any case, the UI funds are managed by the Treasury so it's something I'm sure they're aware of and not willing to allow to collapse.",
        "created_utc": 1586028858,
        "id": "fmfk0fb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586057658.0
    },
    {
        "author": "SorrowsSkills",
        "body": "I feel like I should really begin looking into Visa and Mastercard.",
        "created_utc": 1586029062,
        "id": "fmfkcnq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586057862.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "I work in Fintech.  Volume across the border has dropped very noticeably.  Great time to pick up V, MA, DFS, and AXP.",
        "created_utc": 1585759638,
        "id": "fm4rtm8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585788438.0
    },
    {
        "author": "jiraiya73",
        "body": "yep it bounced off 246\n\n&amp;#x200B;\n\nneed that 15min-chart 200 MA at around 248 and change to reject it on the way up",
        "created_utc": 1585760858,
        "id": "fm4u5ax",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585789658.0
    },
    {
        "author": "Nadechucker_1",
        "body": "I have puts on tons of fintech and payment processors but V just has that retard strength.  Im.staying away play MA instead.",
        "created_utc": 1585764866,
        "id": "fm520hb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585793666.0
    },
    {
        "author": "skifreeme",
        "body": "Thanks that makes sense. I guess I'm still confused why MasterCard would be classified as tech over google but it seems QQQ is a better choice.",
        "created_utc": 1585766139,
        "id": "fm54f3f",
        "score": 1,
        "subreddit": "investing",
        "created": 1585794939.0
    },
    {
        "author": "jason123332",
        "body": "yeah these work too. Bbands do use MA.",
        "created_utc": 1585746308,
        "id": "fm44isi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585775108.0
    },
    {
        "author": "The_SqueakyWheel",
        "body": "Lmaoo the 12second ma😂",
        "created_utc": 1585737212,
        "id": "fm3u8c9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585766012.0
    },
    {
        "author": "coloradical5280",
        "body": "It was also the 200 week MA, which had been support since 2008.",
        "created_utc": 1585785331,
        "id": "fm637zy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585814131.0
    },
    {
        "author": "Soccermatt13",
        "body": "SQ but let it crash more. Potential to be the next V or MA",
        "created_utc": 1585888054,
        "id": "fmaadhe",
        "score": 1,
        "subreddit": "investing",
        "created": 1585916854.0
    },
    {
        "author": "RespectTheHussle",
        "body": "At least I’m not losing stocks. That’s a bigger L than when ya ma had you💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯💯",
        "created_utc": 1585894105,
        "id": "fmahacj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585922905.0
    },
    {
        "author": "javalikecoffee",
        "body": "Visa or MasterCard. They’re revenue is directly tied to inflation.",
        "created_utc": 1585898907,
        "id": "fmam1w9",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1585927707.0
    },
    {
        "author": "LBgeckos",
        "body": "Support &amp; Resistance &amp; Demand usually based on MA but there are other ways of getting those numbers too. Part of TA.",
        "created_utc": 1585899776,
        "id": "fmamv7s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585928576.0
    },
    {
        "author": "Nutmasher",
        "body": "So looking at it on a 2 min, this recent bottom and churn at 2445-2525 has exposed the weakness of this technique.\nMA crossovers do not fair well in sideways markets unless you scalp... Get out before the turn.\nEven my 10-40 sma crossover gives false signals.\nObviously, the goal is to ride some wave higher.  It's coming today or next week, but this week, using this method is a bust.\nI bought a 5% position in SSO Wednesday at a crossover signal (~2500), but ended up holding it vs selling on a down signal.  I did that because I knew price would cover back to this level.  Then, as prices hit the 78.6% retracement, I added another 5%.  O added a third 5% on another retracement Thursday.\nI held these 3 positions until Thursday pm.  Sold for $2000 gain.\n\nSo it was a combination of...\n1. Moving average crossover entry.\n2. Dollar cost averaging on retracements.\n3. Fib levels for entry.\n4. Double top level for exit (Thursday high).\n\nA lot more work than the casual investor is looking for.  But if I strictly followed the buy/sell at the signal, I would have lost money.  Probably the same $2000.",
        "created_utc": 1585908600,
        "id": "fmauqnz",
        "score": 1,
        "subreddit": "investing",
        "created": 1585937400.0
    },
    {
        "author": "imadummyoptionsyay",
        "body": "Um, wtf does that prove you tard? Are you retarded? You said if SPY does not go below $201 he would lose money, I am telling you thats not true and to prove your point you show me he sold for a loss? Suck ma balls and learn \n\nI am trying to tell you that put options do not need to be below their strike price to profit and call options do not need to be above\n\nA few months ago I made a 120% return on Visa calls, strike price was $240. Visa never hit $240, ever.\n\nAnd again, two weeks ago I made 220% on a $65 spy put, spy was WELL above $200",
        "created_utc": 1585841592,
        "id": "fm82jsz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585870392.0
    },
    {
        "author": "jiraiya73",
        "body": "spy approached 200 MA in the 15min chart at around 248.1. - and it bounced up...for now",
        "created_utc": 1585755940,
        "id": "fm4koyv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585784740.0
    },
    {
        "author": "AlbibiG",
        "body": "That is in all honesty the best idea to do. Personally for me I have a much higher risk tolerance, so I am eyeing MA, V, MSFT, AMZN, and aggressive mutual funds (FSCSX, FMAGX, FOCPX). \n\nThere is no best time to slowly buy in, but I’d try to split it over the course of maybe a 6 months to a year or so. That seems like a reasonable timeframe for me for this bear market. \n\nYou won’t need to sell on the recovery because the coming bull market will surpass the next bear market. The last bear market was in 2008 and even if this market drops 50%, you’d still be up about 300%. It’s always wise to buy during a bear market, but I don’t recommend selling if this is for retirement. Hold until you need it.",
        "created_utc": 1585803190,
        "id": "fm6tzo9",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1585831990.0
    },
    {
        "author": "HockeyCoachHere",
        "body": "Reasonable options, but they all have notable downfalls.\n\nOne of the big ones is that a centralized blockchain will never suffice to replace something like Visa.\n\nThe current international transaction rate of credit cards peaks around 25,000 per second (christmas eve of 2019) combining major brands (visa, mastercard, etc)\n\nCash is probably significantly higher than that worldwide.\n\nFor a currency to \"replace\" money or credit cards or banks, as the long-term stated goal of crypto enthusiasts, it has to scale to numbers on the order of thousands of transactions per second.\n\nBitcoin, Zcash and Monero as they are designed, are all fundamentally centralized public blockchains that implement various forms of anonymization for wallet transactions.  \n\nHowever, in reality, it's probably not practical for all nodes to know about all transactions everywhere in the world at all times.   That requirement fundamentally means that every node everywhere has to constantly consume 5-20mbps of incoming transaction data, 24/7/365 and that's assuming no significant growth in transaction volumes.\n\nEven with aggressive pruning of transactions, the volume of data to accurately summarize the net worth of 7 billion people plus their various businesses, teams, organizations, accounts and otherwise would be extraordinary (trillions of transactions, at least - possibly a petabyte of data).\n\nIn the current blockchain concept, any transactions that have any significant notable value to the network have to be recorded on this chain, or they can't be verified.  Concepts like lightening network on bitcoin can \"shard\" some of this off, but these side transactions are fundamentally unverified, and the money used in them is fundamentally locked out of the main wallet of anyone using these channels, making them practical for certain activities (say, buying some gum), but impractical for something like transacting your rent, or any other dollar value that you value.\n\nSome concepts of more broad global sharding of the main chain exist, but under \"proof of work\" that doesn't really work well without establishing \"trusted nodes\" to referee the sharding and that doesn't make the decentralization proponents happy.\n\nIt's probably possible to design something, maybe using a proof of stake system with stakeholders pooled into smaller shards, but that runs a greater risk of having network takeovers, unless you have a referee system that patrols for large movements of stakeholders into shards in order to pool stakes and subvert the voting system for monetary gain.\n\nIt's not a solved problem and no platform currently exists that could plausibly take over world currency transactions, or even a smaller credit card player like Discover, in terms of size and volume.\n\nProof of work, in my opinion, is a poor tech and while I play in crypto as a speculative instrument, I view it like a penny stock in a worthless industry from a true fundamentals perspective.\n\nBut that's just my educated opinion.",
        "created_utc": 1585809004,
        "id": "fm70jqr",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1585837804.0
    },
    {
        "author": "Droidvoid",
        "body": "Buy one now? I said he should sell his if he’s thinking of cutting losses at EOD for the flush. We’re still hitting resistance and the short term MA are approaching longer ones which usually results in a flush when market sentiment is weak. Tomorrow being Friday, I expect a little weakness into it",
        "created_utc": 1585846465,
        "id": "fm8bphp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585875265.0
    },
    {
        "author": "NotGucci",
        "body": "I'm long on both. I also love V, and MA. But msft is probably the one who make money during this pandemic. No one is going buy expensive tech right now, and every business uses msft. So yeah load up in msft shares and calls for next year.",
        "created_utc": 1585858327,
        "id": "fm8yeyk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585887127.0
    },
    {
        "author": "Drew1904",
        "body": "I’m personally looking for $150 around Q4 or EOY. I think that’s when the aggregate numbers will peak in the macro. Shit has a lag time. We may test the monthly 200 MA around summer around $170. But it’ll break eventually.",
        "created_utc": 1585917551,
        "id": "fmb3t1n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585946351.0
    },
    {
        "author": "thelundyy",
        "body": "I got ma marked and emailed RH and they straignt up said no to removing it lmao",
        "created_utc": 1585917629,
        "id": "fmb3wmq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585946429.0
    },
    {
        "author": "srewoByesaC",
        "body": "It’s broken through the 20 day ma and has a big ole gap to fill. Might be ok for next week. I would def hold.",
        "created_utc": 1585938276,
        "id": "fmc3mdm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585967076.0
    },
    {
        "author": "ventilation1234",
        "body": "MA got pushed from April 7 to May sometime yesterday",
        "created_utc": 1585955089,
        "id": "fmcxxeu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585983889.0
    },
    {
        "author": "Marnsy16",
        "body": "#Les yeux qui brillent, la conscience qui s'éteint\nCerveau troué comme ma paire de Vans\nSeul au milieu du passage piéton\nLa faucheuse me fait des appels de phares\nLe calme intérieur, la belle face\nChangent tout c'que j'ai sous la chair en pierre\nChange la tisane de mon verre en bière\nEnvie d'envoyer chier la Terre entière\nLa vie est une imparfaite perfection\nChaque jour je subis de nouvelles pressions\nLe futur s'arrangera comme Urion\nJe disparais des caméras d'surveillance\nDehors les miens sont traités comme des chiens\nMonsieur policier nous respecte pas\nLa nuit, possédé comme un comédien\nJe m'endors à l'heure où le spectre part\nTorturé, quand les pensées claquent la porte du réel\nPetit, c'était dur d'être torturé\nC'est encore dur et ça va encore durer\nEn silence, je presse le pas\nTant de galères pour un si vieux parcours\nLes coïncidences n'existent pas\nChaque seconde, je vois des signes partout\nEt puis y a cette femme, envie de lui dire\n\"Grâce à nos baises, j'apprécie mieux chaque jour\"\nPeur qu'elle s'efface, envie de lui dire\nUn soir avec des petits jeux d'amour\nMême en été, j'ai peu chaud sans toi\nTout allait mieux quand on roulait sur ma Peugeot 103",
        "created_utc": 1585969190,
        "id": "fmdj6ly",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585997990.0
    },
    {
        "author": "sleeping_in_",
        "body": "AAPL, MSFT, MA, V, SQ, LMT",
        "created_utc": 1585980185,
        "id": "fmdwf79",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586008985.0
    },
    {
        "author": "SDuckworth12",
        "body": "MSFT\nFB\nV\nVOO\nJNJ\nSBUX\nMA",
        "created_utc": 1585943632,
        "id": "fmcdlj3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585972432.0
    },
    {
        "author": "Blackwhitehorse",
        "body": "I keep saying this today but look into $MA",
        "created_utc": 1586183686,
        "id": "fmlclmz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586212486.0
    },
    {
        "author": "mandilpradhan",
        "body": "&gt;if it breaks above the weekly 200 ma\n\nWhat do you mean by that? Sorry if it's an obvious answer, I'll probably spend all this down time this week doing an online course on stocks.",
        "created_utc": 1586187625,
        "id": "fmljgs8",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1586216425.0
    },
    {
        "author": "burrito3ater",
        "body": "Yeah, I was looking up which states offered the most when I filed in November and MA came out at the top. With the extra stimulus it should be almost 1500 a week.",
        "created_utc": 1586031078,
        "id": "fmfnoop",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586059878.0
    },
    {
        "author": "qwpajrty",
        "body": "Look at ma boy Fauci",
        "created_utc": 1586031294,
        "id": "fmfo1we",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586060094.0
    },
    {
        "author": "BattletoadRash",
        "body": "Looking to dump a bunch of cash into the market over the next few weeks/months. \n\n\\- 50% ETFs: Equal parts MTUM, LGLV, and QQQ.\n\n\\- 50% Stocks: Equal parts Low Risk: MSFT, GOOGL, MA. Medium Risk: SBUX, DIS, JPM. High Risk: MAR, SYY, JWN.\n\nThoughts about this overall allocation or individual stock picks? Companies you'd look at instead? Appreciate it.",
        "created_utc": 1586176000,
        "id": "fml1fsg",
        "score": 1,
        "subreddit": "investing",
        "created": 1586204800.0
    },
    {
        "author": "leochen1001",
        "body": "MSFT, V, AAPL, QQQ, GOOGL (fractional), XLK \n\nAmzn (fractional), MA, DIS also good",
        "created_utc": 1586076228,
        "id": "fmhdzao",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586105028.0
    },
    {
        "author": "Osmosis_Bones13",
        "body": "Deaths are always lagging indicator. 4 day new case MA is what you wanna be looking at",
        "created_utc": 1586107551,
        "id": "fmidqh6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586136351.0
    },
    {
        "author": "jamgantung",
        "body": "Sorry for my ignorance, but I am still curious why V or MA has a very high PE ratio (higher than other big tech companies) while their growth is in the high single digit or low double digits. They have a high profit margin as well which means it might be difficult to increase the profit margin further in the future. \n\nCan someone enlighten me for this?.",
        "created_utc": 1586086076,
        "id": "fmhmbh1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586114876.0
    },
    {
        "author": "antyang11",
        "body": "Why do you think MA has more growth potential over visa?",
        "created_utc": 1586084856,
        "id": "fmhl9np",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586113656.0
    },
    {
        "author": "WinterWeather5",
        "body": "Jack ma owns scmp",
        "created_utc": 1586095881,
        "id": "fmhwgqc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586124681.0
    },
    {
        "author": "buffbroSPT",
        "body": "I dunno about shorting V or MA - look into and read into both companies first because they’re pretty darn strong - disclaimer: am long both companies",
        "created_utc": 1586097694,
        "id": "fmhyj45",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586126494.0
    }
]