[
    {
        "author": "RNOUGHT18",
        "body": "American govt: We are sending Americans $1000 checks\n\nApple to my email: The new MacBook Air. Now from $999",
        "created_utc": 1584565601,
        "id": "fkvb0z1",
        "score": 205,
        "subreddit": "wallstreetbets",
        "created": 1584594401.0
    },
    {
        "author": "BoyYeetzWorld",
        "body": "AAPL is more secure than the US government.",
        "created_utc": 1584589411,
        "id": "fkwddlt",
        "score": 79,
        "subreddit": "wallstreetbets",
        "created": 1584618211.0
    },
    {
        "author": "okiedokiemochi",
        "body": "Apple can ride this out for 50 years",
        "created_utc": 1584568963,
        "id": "fkvgv8g",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1584597763.0
    },
    {
        "author": "whythefuckyo2020",
        "body": "AAPL has $200 BILLION in cash you absolute fucking idiot",
        "created_utc": 1584582277,
        "id": "fkw2yq2",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1584611077.0
    },
    {
        "author": "notmyrealname124",
        "body": "The IRS workers who seek payment in Apple gift cards",
        "created_utc": 1585078084,
        "id": "fle5pox",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1585106884.0
    },
    {
        "author": "Spazfreak",
        "body": "This is true mickey apple told me.",
        "created_utc": 1584478995,
        "id": "fkrz8nd",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1584507795.0
    },
    {
        "author": "10x_EBITDA",
        "body": "Amazon at levels not seen since January 27, 2020\n\nApple at levels not seen since December 13, 2019\n\nMicrosoft at levels not seen since December 12, 2019\n\nGoogle at levels not seen since September 27, 2019\n\nFacebook at levels not seen since June 6, 2019\n\nKind of amazing how some things have held up so well yet other stocks have seen 5-10 years of gains wiped out in 2 weeks",
        "created_utc": 1583963814,
        "id": "fk8vqg7",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1583992614.0
    },
    {
        "author": "ldom22",
        "body": "AAPL can buy themselves while at the dip",
        "created_utc": 1584569363,
        "id": "fkvhkyi",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1584598163.0
    },
    {
        "author": "CanadianCule10",
        "body": "Boeing gonna have to get bailed out at this rate, buy Apple or Microsoft retard",
        "created_utc": 1584072292,
        "id": "fkda2zy",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1584101092.0
    },
    {
        "author": "brickwall-ball",
        "body": "It's because some retard autists think they will be acquired by Apple",
        "created_utc": 1584406833,
        "id": "fkpcghc",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1584435633.0
    },
    {
        "author": "cannieu",
        "body": "Holding 120k in AAPL 280 puts 3/6. Pray for me.",
        "created_utc": 1583270520,
        "id": "fjeep7q",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1583299320.0
    },
    {
        "author": "dopexile",
        "body": "If you look at a chart of Apple you would hardly know there was a problem.\n\nIt's as if the market thinks people are going to lose their jobs and then will decide to go out and spend $1,300 to upgrade their cellphone that is only marginally better than the $1,200 phone they bought last year.\n\nAlso, oil is down 5% today yet oil stocks are up 5%. Their revenue and profits are evaporating yet the companies are more valuable? How does that make any sense?",
        "created_utc": 1585590979,
        "id": "flxw6u7",
        "score": 33,
        "subreddit": "investing",
        "created": 1585619779.0
    },
    {
        "author": "BoilerMaker36",
        "body": "I bought an entire cow for my freezer February 1st with no idea this was coming. I imagine this is what it feels like to be the guy that bought $250 Apple puts like 3 months ago",
        "created_utc": 1584499653,
        "id": "fksvxd2",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1584528453.0
    },
    {
        "author": "HashofCrete",
        "body": "Don't even ask the question. The answer is yes, it's priced in. Think Amazon will beat the next earnings? That's already been priced in. You work at the drive thru for Mickey D's and found out that the burgers are made of human meat? Priced in. You think insiders don't already know that? The market is an all powerful, all encompassing being that knows the very inner workings of your subconscious before you were even born. Your very existence was priced in decades ago when the market was valuing Standard Oil's expected future earnings based on population growth that would lead to your birth, what age you would get a car, how many times you would drive your car every week, how many times you take the bus/train, etc. Anything you can think of has already been priced in, even the things you aren't thinking of. You have no original thoughts. Your consciousness is just an illusion, a product of the omniscent market. Free will is a myth. The market sees all, knows all and will be there from the beginning of time until the end of the universe (the market has already priced in the heat death of the universe). So please, before you make a post on wsb asking whether AAPL has priced in earpods 11 sales or whatever, know that it has already been priced in and don't ask such a dumb fucking question again.",
        "created_utc": 1584477152,
        "id": "fkrw0bt",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1584505952.0
    },
    {
        "author": "SVXYstinks",
        "body": "Shitheads sold my AAPL and MSFT calls at the low today.",
        "created_utc": 1583194821,
        "id": "fjbjphp",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1583223621.0
    },
    {
        "author": "duhpolan",
        "body": "Calling the fuck out of spy and apple",
        "created_utc": 1584053264,
        "id": "fkchmtl",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1584082064.0
    },
    {
        "author": "Vector3DX",
        "body": "Apple throttled the phone because as batteries degrade they lose peak voltage. This happens with ALL phones using lithium ion batteries.\n\nWould you rather have a slightly slower phone, or have your phone shutdown during a high power event like when calling 911? \n\nApple should have been more transparent, but I feel like they didnt mean to do this maliciously. If they did, why support older iPhones with software updates for so long?",
        "created_utc": 1583270382,
        "id": "fjeeg17",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1583299182.0
    },
    {
        "author": "TimAppleBurner",
        "body": "I honestly don’t know how I’ll be able to go back to normal trading after this. \n\n“HOLY SHIT APPLE WAS UP 0.75% TODAY!!!!”\n\nBoeing was up 30%+ today. Think about that: a Dow Jones industrial up 30%. I don’t know how trading is even going to be remotely fun once this is over.",
        "created_utc": 1585167611,
        "id": "flhqi1z",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1585196411.0
    },
    {
        "author": "Cracker77",
        "body": " \n\nDebt Threat: Corporate debt is at a record level of $10 Trillion. AAPL has a Debt-to-Equity Ratio of 1.21, and that was reported before the market took a crap. Over half of \"investment quality\" bonds are now rated BBB, the the lowest investment grade rating available. Corporate cash holdings have dropped to $1.69 Trillion. The US Debt-to-GDP Ratio is 107% .\n\nConsumer Debt is at a record high of $13.95 trillion. Meanwhile, the Prime Age (working age) Employment Ratio has not returned to pre-recession levels. If you look at personal savings rate by income quintile, only the top 20% are saving more than 4%. the bottom 60% aren't saving anything at all. this is largely because the majority of income growth has been in the top 20%. Even the average including the top 20% is only 8%, still historically low.\n\nThe equity market cap-to-GDP ratio is at an all-time high, above 200%. The Price-to-Earnings-Growth Ratio (PEG) is at it's highest ever.\n\nIn other words, spending and prices have become decouples from actual productivity and earnings. With high debt, low savings, and low credit ratings, both consumers and corporations face default if they have a minor hiccup in revenue.\n\nNote: These numbers rely on the best available data, based on large numbers of tests, available from the WHO and academic sources. they could change as more information comes in from other countries.\n\nDisease threat: In China, the In China, the overall CFR for COVID-19 was 17.3% for cases before they improved standards of care (access to sophisticated medical equipment and trained personal); it then dropped to 0.7%. The much heard 2.3% Case Fatality Rate is an average between these two. This explains the variance in CFR, and why countries such as South Korea, which had preparation and foreknowledge, have a lower CFR.\n\nThe disease has a 1 to 14 day incubation rate. This explains the variance in apparent asymptomatic rates (diseases in incubation appear asymptomatic). Hundred of thousands of tests have been conducted in South Korea; the WHO reported that China produced millions of tests. Some cases, such as the first Italy, have shown several weeks of no symptoms before becoming severely ill. This makes it difficult to control the spread.\n\nThe data from both China &amp; South Korea seem to support that about 80.9% of cases are mild, 13.8% of cases become severe, and 4.7% become critical. The remaining 0.6% may be asymptomatic. The sum of severe &amp; critical cases is 18.5‬%, close to the 17.3% early CFR in China, suggesting that those people would die without significant supportive care. This care includes: oxygen production and breathing apparatus to support respiratory failure, IVs &amp; vasopressor medication to support septic shock, and dialysis to support kidney failure. The median time to recover is 3-6 weeks for patients with severe or critical disease.\n\nThis suggests that about 20% of those infected will need about 4.5 weeks of intensive care. The hospitalization rate for the flu is only 1%.\n\nThe overall CFR rate (including all ages and comorbidity statuses) for seasonal flu is about 0.1%. The CFR for COVID-19 ranges from 0.2% for peole in their 20s &amp; 30s, 0.4% for people in their 40s, 1.3% for people in their 50s, 3.6% for people in their 60s, 8.0% for people in their 70s, to 14.8% for people over 80.\n\nCFRs vary by comorbidity. For those with no comorbidity (otherwise in good health), the CFR is 0.9%. Remember that the flu is only 0.1% overall, which lumps in those with comorbidities. Those with diabetes have a CFR of 7.3%, those with hypertension have a CFR of 6.0%, those cardiovascular disease have a CFR of 10.5%.\n\nSo, the fatality of the disease ranges from twice as deadly as the overall rate for flu for the healthiest people, to 148 times as deadly as the overall rate for those over 70. It's significantly more likely to result in hospitalization, and that hospitalization will be longer.\n\nThe disease appears to have an R0 of about 2.5 without \"intense quarantine and social distancing measures\". most epidemiologists, and other relevant experts, don't think the world could maintain for the 6 months to a year necessary to develop a vaccine. Current estimates by epidemiologists range from 20% to 70% of adults being infected within a year, depending on control measures. Washington State Department of Health officials stated that they expect to see more cases of COVID-19 in the coming months than cases of flu.\n\nQuarantine and Control Measures Impact: If we want to prevent that millions of people being infected thing from happening, we could do this. The effect on productivity and demand would be tremendous. Additionally, transaction costs go way up; it's difficult to conduct business when you're in different quarantine zones. Their are also multiple legal and political hurdles.\n\nDisease Impact: 20% hospitalization of 20% infected of 209.1 Million adults in the US is 8.4 Million needing about 4 weeks of intensive care. 20% hospitalization of 70% infected of 209.1 Million adults in the US is about 29.3 million people requiring about 4 weeks of intensive care.\n\nA 1% fatality rate of 20% infected adults is 289,940 dead in the US. A 2% fatality rate of 70% infected adults is 2,927,400‬ dead in the US.\n\nNormal annual fatalities in the US are 2.8 Million. These death amount to between a 10.4% increase and 104.6% increase in deaths for the year.\n\nIf we choose to control it, the control measures will directly impact production and reduce demand in an immediate fashion.\n\nIf we allow the disease to run rampant, and it actually does, the deaths and hospitalizations will pose significant disruptions; massive resource will be allocated to medical requirements, people will take time off work to care for their family members or stay in hospital, deaths will result in a significant increase in empty housing, municipal property taxes will decline (increasing the likelihood of default on municipal bonds), assets such as stocks &amp; bonds will pour into the market either because the owner is dead or they need to pay for medical expenses.\n\nWith high debt and low savings, consumers and corporations are ill prepared to endure such an impact to production and revenue. Since we are close to full employment, have such high valuations compared to production, and have a high level of government debt already, we are primed for inflation if the government decides to print money to save these entities. In a worst case scenario, the government's credit laying could lower, and t-bonds would be dumped on the market.\n\nHowever, these are all just possibilities. the chance of the worst case scenarios happening is still low; it could be contained in relatively small areas. The full potential threat may not become apparent to the non-epidemiologist for six months or so, when we have significantly more cases and their impact is directly visible. Actions such as the additional rate cuts could raise prices in the meantime.\n\nPossible high risk long play: INGN is down to $ 47.67 from $67.59 about 8 weeks ago. They produce lightweight portable oxygen concentrators. They could have an increase in demand of orders of magnitude, in a market with a high barrier of entry (FDA regs, IP, expertise). However, they could face supply chain problems.",
        "created_utc": 1583265353,
        "id": "fje5015",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1583294153.0
    },
    {
        "author": "recentlyunearthed",
        "body": "“BofA lowers Apple’s price target” Apple should be lowering BofA’s price target.",
        "created_utc": 1583942824,
        "id": "fk7skjr",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1583971624.0
    },
    {
        "author": "itachi12131415",
        "body": "Nice paywall, granddad, can I have your AAPL shares when you die to the kung flu?",
        "created_utc": 1584987771,
        "id": "flao70q",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1585016571.0
    },
    {
        "author": "AbsolutelyAutistic",
        "body": "$AAPL have brand loyalty. A recession isn't going to stop someone getting the new iPhone; they'd rather not eat for a week.",
        "created_utc": 1584549310,
        "id": "fkuh3m5",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1584578110.0
    },
    {
        "author": "MasticateMyDungarees",
        "body": "If we’re talking puts, look to Inda, EWJ,  EWZ, AAPL, INTC, ULTA . Strike low and buy at least april or may.",
        "created_utc": 1584572056,
        "id": "fkvm68u",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1584600856.0
    },
    {
        "author": "AbsolutelyAutistic",
        "body": "I drink Apple juice therefore this is all wrong.",
        "created_utc": 1585077576,
        "id": "fle4rf4",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1585106376.0
    },
    {
        "author": "DillonMeSoftly",
        "body": "Why stop at 6 trillion? I for one, guarantee my infant son to work in the coal mines if it means CEOs can make up some money they lost this month. I hate to sound like an r/politics douche but this is really getting nuts. There are literally lives at stake by opening up early and there's very little need to. Apple isn't going broke and Boeings problems are due to their own incompetence and greed and are only partially due to CV. Plus cruise bailout? Fuck that, if you've ever been on a cruise you know 90% of employees are from overseas and they treat them as subhuman",
        "created_utc": 1585089748,
        "id": "fleqyb2",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1585118548.0
    },
    {
        "author": "ruby420",
        "body": "What the fuck makes you think Apple bees would hire me? Sir this is a Wendys",
        "created_utc": 1585173890,
        "id": "fli26lj",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1585202690.0
    },
    {
        "author": "boobalube",
        "body": "Virus priced in. Unemployment priced in. No way today was a short squeeze. Apple reopens store in a few weeks. Boeing gets all $6T in the bailout. Old people will die and will put their pensions to the young. Recession cancelled. \n\nSPY $117p 4/20",
        "created_utc": 1585091396,
        "id": "fletszg",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1585120196.0
    },
    {
        "author": "PAPA_JOHNS_ZIMBABWE",
        "body": "Two weeks ago I was screaming in my car because I made $300 profit on an AAPL put. Now, I just made $3,000 more and I feel numb",
        "created_utc": 1584550405,
        "id": "fkuj6u5",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1584579205.0
    },
    {
        "author": "hamiltondrips",
        "body": "SEC just charged AAPL $500 million for a case which Apple admitted to intentionally slowing down phones. \n\n$500 million on a 1.3 Trillion $ company. \n\nLMAO",
        "created_utc": 1583194388,
        "id": "fjbj1ia",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1583223188.0
    },
    {
        "author": "Scavenger53",
        "body": "A ton, but not that many compared to what remains. SPY has 244 million shares in ITM right now. That is equal to about a day now, or like 2 or 3 days before this crash. And the price is all the way up to 330. It should balance out lower than that. I have no idea wtf this will do, so tomorrow is going to be *fun*\n\nOther notable stocks that have this imbalance: MSFT, AAPL, AMD, CCL, TGT, UBER\n\nThen you go and look at other chains, and it's boring as hell where they don't even break a 1000 contracts.",
        "created_utc": 1584676105,
        "id": "fkzonr1",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1584704905.0
    },
    {
        "author": "kbthroaway723",
        "body": "Apple has more cash than most developing countries have ever produced in their existence and this retard actually wants to talk about bankruptcy",
        "created_utc": 1584589590,
        "id": "fkwdm7v",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1584618390.0
    },
    {
        "author": "hotgator",
        "body": "In 20 years the only two companies left will be Apple and China.",
        "created_utc": 1583946639,
        "id": "fk7zpoh",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1583975439.0
    },
    {
        "author": "kingyonez",
        "body": "Aapl is buying a car company. Which one ?",
        "created_utc": 1584060737,
        "id": "fkctf3a",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1584089537.0
    },
    {
        "author": "QBD10k",
        "body": "apple bottom jeans",
        "created_utc": 1585343335,
        "id": "floqca4",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1585372135.0
    },
    {
        "author": "jreasn",
        "body": "Apple, google and amazon can literally buy every fucking company beneath them at this point.",
        "created_utc": 1584582368,
        "id": "fkw33qx",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1584611168.0
    },
    {
        "author": "JCvalentyne",
        "body": " **Apple extends closure of US stores indefinitely on coronavirus worries** \n\n [https://www.cnet.com/news/apple-closes-all-us-stores-until-further-notice-on-coronavirus-worries/](https://www.cnet.com/news/apple-closes-all-us-stores-until-further-notice-on-coronavirus-worries/)",
        "created_utc": 1584485622,
        "id": "fksaaim",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1584514422.0
    },
    {
        "author": "justknoweverything",
        "body": "what a fucking retard, apple makes 50B per year you idiot they could get a 1/2 trillion dollar credit line if they wanted",
        "created_utc": 1584589241,
        "id": "fkwd5b3",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1584618041.0
    },
    {
        "author": "formerbuck",
        "body": "VIX at 60 again and climbing. Going to have a bloody red day here soon. \n\n***Positions:***  \n$AAPL 4/17 $215p's  \n$SPY 4/17 $220p's  \n$VIX 5/20 $80c's\n\nSuck my cock bulls.",
        "created_utc": 1585070569,
        "id": "flds0br",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1585099369.0
    },
    {
        "author": "retupmocomputer",
        "body": "Today I tried picking up pennies in front of a steam roller. Today I got rolled over. \n\nRisked 100k for 3k worth of spreads. Closed out with a 20k loss. Fuckin Apple, man.",
        "created_utc": 1584761461,
        "id": "fl2w42d",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1584790261.0
    },
    {
        "author": "AceOrigins",
        "body": "puts on anything will work especially AAPL up HUGE today",
        "created_utc": 1585068290,
        "id": "fldnx7e",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1585097090.0
    },
    {
        "author": "bigplay85",
        "body": "As much as you want to don't short companies like apple or Microsoft. The reason being is most companies are straddled with a fuckton of debt that they can barely pay if they're not operating, Think (Ge, Ford, Boeing). Apple doesn't have debt, in fact they have the opposite hundreds of billions of dollars in Straight Cash",
        "created_utc": 1584573506,
        "id": "fkvong1",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1584602306.0
    },
    {
        "author": "Anowoz",
        "body": "Don’t you guys get it?\n\n\n\n\n\n\n$AAPL closes stores = Stock goes up\n\n\n\n\n\n\n$DIS closes parks = Stock goes up\n\n\n\n\n\n\n$ULTA closes stores = Stock goes up\n\n\n\n\n\n\nCalifornia shuts down = Stock Market goes green",
        "created_utc": 1584671081,
        "id": "fkzhg5x",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1584699881.0
    },
    {
        "author": "LMY723",
        "body": "It's funny how when the market goes down all the sudden people are no longer experts and giving me trading tips. No Karen, I do not want to hear about this hot new startup called tesla, yes I know apple is doing well.",
        "created_utc": 1584508712,
        "id": "fkt7klq",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1584537512.0
    },
    {
        "author": "ian0104",
        "body": "DIS is magically up 1.68% Dis this week is outperforming Aapl msft just bc I'm holding Dis puts",
        "created_utc": 1584399703,
        "id": "fkp1j5p",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1584428503.0
    },
    {
        "author": "Beyond_Duality",
        "body": "The sooner we hit SPY $180 the sooner daddy can buy like ten thousand shares of MSFT, AAPL, V, AMD, etc and never look at his account again\n\n🥰🥰🥰",
        "created_utc": 1585159870,
        "id": "flhc0xs",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1585188670.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "The year is 2025 - Shia LaBeouf won the presidential race by a landslide victory for the Independent party. \nMia Khalifa is President of Vice(Formally known as Vice President)\n\n\nAll drugs are made legal in Q1. \n\nCoffee has become illegal. \n\n\nStarbucks &amp; 7-Eleven launch a subscription Salvia service. \n\n\nAmazon acquired the FAA and now controls all air traffic. \n\n\nApple/Charmin launch Smart Reusable  Toilet Paper. The addition of the 3.5mm headphone jack made it an immediate hit.",
        "created_utc": 1583647856,
        "id": "fjwwlyq",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1583676656.0
    },
    {
        "author": "Billie__Gates",
        "body": "I know I'm fucked up but I really fantasize about those boomer stock prices. Imagine if instead of bailing out Boeing we could buy in at 20 a share. Getting apple or Microsoft for 3. Actually being able to buy into multiple companies like it was no big deal a paycheck, and a 401k that actually felt like it was worth contributing to. Don't even start with the \"dollar is so much lower now\" bullshit, our wages we make now struggle to just  double from those times, while the markets even still have quadrupled and then some.",
        "created_utc": 1584505807,
        "id": "fkt48c3",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1584534607.0
    },
    {
        "author": "thehenrylong",
        "body": "[apple](https://twitter.com/BrianRoemmele/status/1234966752892616704?s=20)  having more supply chain issues and likely going to alter WWDC.",
        "created_utc": 1583297432,
        "id": "fjfq9to",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1583326232.0
    },
    {
        "author": "NotForrestGump",
        "body": "At a new job I can’t lose but I gotta stop by just to say LMAOOO some of the most popular plays on this sub that I saw only 1 month ago:\n\n- MSFT $200c 3/20\n- AMD $55c 3/20\n- AAPL $330c 4/17\n- SPCE $40c 3/20\n\n^ these are more dead than my dreams 🤣🤣🤣",
        "created_utc": 1583781562,
        "id": "fk1kli1",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1583810362.0
    },
    {
        "author": "WarrenBuffetsSon",
        "body": "Apple: supply chain fucked, some stores still closed, factories not fully operational\n\nAlso Apple: hey heads up we're going to miss our March estimates and we might close our shit again\n\nMarket: Ok good boy Apple, up 7% you go",
        "created_utc": 1583181697,
        "id": "fjaw1y7",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1583210497.0
    },
    {
        "author": "ElephantSquad",
        "body": "Today was a good day. http://imgur.com/a/FpweSrl\n\nEdit: don't have individual shots of positions but this is what I had, 9.6k in 38x VXX 35c 3/20, 2x RCL 60p 4/17, and 10x DIS 105p 3/20. Sold everything, rebought 15k of AAPL 240p 4/17.",
        "created_utc": 1583784640,
        "id": "fk1q342",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1583813440.0
    },
    {
        "author": "toomuchgoodstuff9",
        "body": "HOT TAKE: Apple should buy Ford",
        "created_utc": 1584567547,
        "id": "fkvefhd",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1584596347.0
    },
    {
        "author": "BoilerMaker36",
        "body": "You have $158. Buy an Apple OOM call and make that shit back. Don’t be a fucking quiter.",
        "created_utc": 1585614495,
        "id": "flz34ri",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1585643295.0
    },
    {
        "author": "TheStreetProphet",
        "body": "$AAPL gonna buy Pornhub and Youporn. About the only companies in the black rn.",
        "created_utc": 1584062183,
        "id": "fkcvm4g",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1584090983.0
    },
    {
        "author": "abrandis",
        "body": "True but you can't compare Apple to Airlines or Oil companies, some industries because of their nature are very CapEx intensive and don't have a lot of float in their reserves. \n\nShould they have more cash reserves  probably ,but how much is enough 2 months of operating costs for a major airline is likely a billion or more,.it's not practical to keep that much cash reserve.,  comparing it to Apples business which just has manufacturing and engineering costs  is like comparing Apples to Oranges (pun intended)\n\nAi",
        "created_utc": 1584477089,
        "id": "fkrvwcq",
        "score": 14,
        "subreddit": "investing",
        "created": 1584505889.0
    },
    {
        "author": "camrobe",
        "body": "I think the key to this market is Apple.  1000 dollars phones, stores closed, stock is up 100% up from a year ago. That’s not capitulation. I have been buying the dips until yesterday when I realized I was part of the problem. Let the prices reflect reality: we are going to be fucked for a while. This wishful thinking is not helping.",
        "created_utc": 1584500432,
        "id": "fksx2af",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1584529232.0
    },
    {
        "author": "oregon_forever",
        "body": "SPY closed the day at $252.80 and AAPL closed the day at $252.84. They weren't lying when they said SPY is AAPL.",
        "created_utc": 1584485958,
        "id": "fksau33",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1584514758.0
    },
    {
        "author": "kiwimancy",
        "body": "People have 100 apples. You and I go to the market one day and start trading apples for $10 each. Everybody's apples have a market cap of $1000. The next day we go to the market and decide an apple is only worth $8 and we make a trade at that price. Suddenly the market cap of everybody's apples is $800. The other $200 doesn't become cash somewhere, it's just an adjustment of what we think they're worth.",
        "created_utc": 1584068469,
        "id": "fkd4xa3",
        "score": 13,
        "subreddit": "investing",
        "created": 1584097269.0
    },
    {
        "author": "Koballin44",
        "body": "All imma say is I just left mall. One of the most popular in my state. And only 5 people were in the apple store. The mall felt empty &amp; nobody would go near the Chinese spot in the food court. That never happens. That's all.",
        "created_utc": 1583541035,
        "id": "fjp3nay",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1583569835.0
    },
    {
        "author": "Stockengineer",
        "body": "I got bad news for Apple... INDA is going to get totally butt fcked by the virus.",
        "created_utc": 1584398712,
        "id": "fkozy9c",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1584427512.0
    },
    {
        "author": "burn__the__witch",
        "body": "You’re all just too scared to take on Apple. Post apple puts or stop posting on this sub.",
        "created_utc": 1584582870,
        "id": "fkw3vii",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1584611670.0
    },
    {
        "author": "phostyle",
        "body": "It's really a mixed bag between industries and companies when it companies' balance sheet management. And it depends on how disciplined the company's executives have been during high growth periods. Berkshire, for example, has been very discplined about its balance sheet management in recent years while Apple has been hoarding cash due to its tax strategy.\n\nBut there really isnt a right answer to any single strategy employed by businesses. Apple and Berkshire have been criticized plenty during the last five years for not generating value with their massive cash pile. Whereas Tesla was just recently praised for how quickly it was able to grow its business by leveraging with debt. At end of the day, no one has a crystal ball and businesses ought to strive for a balance.",
        "created_utc": 1584476241,
        "id": "fkruf3a",
        "score": 13,
        "subreddit": "investing",
        "created": 1584505041.0
    },
    {
        "author": "TacStock",
        "body": "Maybe the market is pumping because Robinhood is buying everyone a free share of AAPL or MSFT.",
        "created_utc": 1583177348,
        "id": "fjao65m",
        "score": 12,
        "subreddit": "RobinHood",
        "created": 1583206148.0
    },
    {
        "author": "prestodigitarium",
        "body": "This is not true, Apple was “putting it to work” by lending it out to the government and other organizations.",
        "created_utc": 1584478109,
        "id": "fkrxopm",
        "score": 12,
        "subreddit": "investing",
        "created": 1584506909.0
    },
    {
        "author": "VacationLover1",
        "body": "Why doesn’t Apple buy Boeing and design planes that look like a flying Apple logo.. free advertising.. Kanye/Trump get their big brain idea of an iplane complete, and Apple can go to the moon \n\nWin/win to me",
        "created_utc": 1584478441,
        "id": "fkry9kx",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1584507241.0
    },
    {
        "author": "Matt1Up",
        "body": "This is my account currently.  \n\nSPY $250p 3/23    \nAAPL $270p 3/23   \nSPCE $15p 4/17   \nDIS $80p 5/15",
        "created_utc": 1583978921,
        "id": "fk9mf6x",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1584007721.0
    },
    {
        "author": "avaaa96",
        "body": "Imagine if Tim Cook tomorrow just said “fuck it I’m out” and left apple 😂😂😭😭😭😭",
        "created_utc": 1583462865,
        "id": "fjm6ovg",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1583491665.0
    },
    {
        "author": "swaggymedia",
        "body": "AAPL buy out DIS",
        "created_utc": 1584060750,
        "id": "fkctfw3",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1584089550.0
    },
    {
        "author": "xesus2019",
        "body": "APPLE made the 2020 Mac Pro in Wisconsin.  It costs $6000. \n\n***Maybe they deserve to go out of business.***",
        "created_utc": 1584417505,
        "id": "fkprpbb",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1584446305.0
    },
    {
        "author": "measuredrisk",
        "body": "I am jacked to the tits with puts expiring this Friday - all positions taken in the last two trading sessions.\n\nEdit: Positions \n\nTSLA 400P (9 contracts) \nAAPL 235P (5 contracts) \nSHOP 400P (5 contracts) \n\nWish me luck.\n\nEdit 2: thanks everyone for your support. If market tanks &gt;10% in the coming days I will upload a photo of my penis so you guys can make fun of how small it is",
        "created_utc": 1585600807,
        "id": "flyesey",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1585629607.0
    },
    {
        "author": "tanderson1121",
        "body": "If we don’t have red day by Monday I will drink an entire bottle of green apple brunettes and post footage. Put it in the books.",
        "created_utc": 1585259216,
        "id": "fllf9l3",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1585288016.0
    },
    {
        "author": "Heedunk",
        "body": "Anyone else feel life always goes against them? I always get told I am negative but it’s because I always brace for the worst, which usually ends up as the result. I tried to be positive by going long on AAPL and, of course, shit went down 17% right after. Life is hard.",
        "created_utc": 1583289340,
        "id": "fjfd5vy",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1583318140.0
    },
    {
        "author": "cbreezy88",
        "body": "Why did I not sell my calls I thought trump was actually going to clue us into a stimulus package I got fucked by tlt today hard and now bout to get ducked by Apple calls I love and hate this volatility so much",
        "created_utc": 1583882190,
        "id": "fk5k6tz",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1583910990.0
    },
    {
        "author": "Short-The-Vix",
        "body": "How is Apple, a company where all their revenue come from luxury goods and non-essential services, out-performing the market?",
        "created_utc": 1584579558,
        "id": "fkvyou5",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1584608358.0
    },
    {
        "author": "potrillo2124",
        "body": "Apple wishes they can buy Disney lol",
        "created_utc": 1585175869,
        "id": "fli5s8t",
        "score": 12,
        "subreddit": "stocks",
        "created": 1585204669.0
    },
    {
        "author": "recent_orders",
        "body": "My Apple Watch thinks I’m going into cardiac arrest every day from 3:55-4 PM.",
        "created_utc": 1585338936,
        "id": "floihee",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1585367736.0
    },
    {
        "author": "Roger-Shrederer",
        "body": "Not tomorrow but I'm eyeing some leaps once this is all over\n\nAAPL MSFT AMD NVDA BAM",
        "created_utc": 1583099314,
        "id": "fj7voxx",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1583128114.0
    },
    {
        "author": "avaaa96",
        "body": "Apple accidentally listed four new iPad Pro models on its website",
        "created_utc": 1584481344,
        "id": "fks378w",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584510144.0
    },
    {
        "author": "Softspokenclark",
        "body": "Lol this dope thinks Apple going to crash.    \n  \nWhat tree did George Washington cut down? An *APPLE*  tree  \n  \nAmerica’s backbone is made up of three things: Apple, slavery, and heroin",
        "created_utc": 1584569348,
        "id": "fkvhjzh",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584598148.0
    },
    {
        "author": "MusaEnsete",
        "body": "It's not really \"on sale.\"  AAPL is currently at 289.  It was at 209 six months ago, and 175 a year ago.  Will it drop more? No one knows (narrator: yes).  Will it go up more from here? No one knows (narrator: eventually).",
        "created_utc": 1583297036,
        "id": "fjfpphf",
        "score": 11,
        "subreddit": "investing",
        "created": 1583325836.0
    },
    {
        "author": "Lord_Uber",
        "body": "Short UBER and LYFT. Long AAPL and BRKB.",
        "created_utc": 1584061009,
        "id": "fkctu82",
        "score": 11,
        "subreddit": "SecurityAnalysis",
        "created": 1584089809.0
    },
    {
        "author": "DrClearCut",
        "body": "That's not right. They're not liable for things out of their control. 3 days of outage in 6 trading days is entirely in their control.\n\nIf your losses are substantial you will likely have to sue them. I'd recommend transferring to another broker before you do this so they don't lock up your cash/assets (...intentionally) while they \"process\" them to cash you out.\n\nThey'll have to prove that the outages were out of their control, which will be difficult for them since its fucked you over 3 out of 6 days. If they can't show that they invested a large amount into their infrastructure and coding since 3/2 then you can easily make the case that this could have been avoided. They haven't updated the App (Apple version) since 3/2, so I think this will be easy to show.",
        "created_utc": 1583779636,
        "id": "fk1h97s",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1583808436.0
    },
    {
        "author": "tracksuit1992",
        "body": "Cramer just said Apple is poised to rally. Your calls are fucked",
        "created_utc": 1583281853,
        "id": "fjf0rim",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1583310653.0
    },
    {
        "author": "optionseller",
        "body": "My Tim Apple shares might get filled at 240 tonight",
        "created_utc": 1584494516,
        "id": "fkso5pq",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584523316.0
    },
    {
        "author": "PhantomOwnage",
        "body": "Don't even ask the question, ever. The answer is yes, it's priced in. Think Amazon will beat the next earnings? That's already been priced in. You work at the drive thru for Mickey D's and found out that the burgers are made of human meat? Priced in. You think insiders don't already know that? The market is an all powerful, all encompassing being that knows the very inner workings of your subconscious before you were even born. Your very existence was priced in decades ago when the market was valuing Standard Oil's expected future earnings based on population growth that would lead to your birth, what age you would get a car, how many times you would drive your car every week, how many times you take the bus/train, etc. Anything you can think of has already been priced in, even the things you aren't thinking of. You have no original thoughts. Your consciousness is just an illusion, a product of the omniscent market. Free will is a myth. The market sees all, knows all and will be there from the beginning of time until the end of the universe (the market has already priced in the heat death of the universe). So please, before you make a post on wsb asking whether AAPL has priced in earpods 11 sales or whatever, know that it has already been priced in and don't ask such a dumb fucking question again.",
        "created_utc": 1584473756,
        "id": "fkrq1py",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584502556.0
    },
    {
        "author": "M1keKuszewski",
        "body": "Guys. Tomorrow is my 30th birthday. Apple needs to drop 8$. Just as a gay birthday gift feel me",
        "created_utc": 1584648385,
        "id": "fkygp44",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584677185.0
    },
    {
        "author": "xydasym",
        "body": "Every boomer I've talked to is holding. I don't mean bonds in a 401k I'm talking \"70% of my money is in Apple and I'm going to wait this one out\".\n\nThey're also \"taking advantage of the cheap flights\".",
        "created_utc": 1584651006,
        "id": "fkylbek",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584679806.0
    },
    {
        "author": "enpedocles",
        "body": "As a programmer it seems their developers shot past the Ballmer’s peak and went full retard. \n\nThere are standard software engineering practices that prevent this sort of thing, or allow you to roll back to previous state of affairs. \n\nSomeone screwed up pretty bad... but I was going to buy AAPL puts Today, so thanks I guess",
        "created_utc": 1583191519,
        "id": "fjbeiqw",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1583220319.0
    },
    {
        "author": "MuricasMostBlunted",
        "body": "FOMO’d into AAPL calls and lost a cool 70% of my portfolio",
        "created_utc": 1583256004,
        "id": "fjdo8ar",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1583284804.0
    },
    {
        "author": "Desmater",
        "body": "With that kind of money I would daytrade AAPL or SPY options.",
        "created_utc": 1585172199,
        "id": "flhz2tv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1585200999.0
    },
    {
        "author": "nakedwaffeln",
        "body": "Recession is cancelled y'all. Time to park your money in Microsoft and Apple calls like old times.",
        "created_utc": 1585598107,
        "id": "fly9ous",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1585626907.0
    },
    {
        "author": "Saucepass87",
        "body": "AAPL makes somewhat sense given how much cash they are sitting on.  But there's definitely going to be a major slowdown on purchases and they still trading like \"it's fine, everything is fine.\"",
        "created_utc": 1585591087,
        "id": "flxwdyp",
        "score": 11,
        "subreddit": "investing",
        "created": 1585619887.0
    },
    {
        "author": "SmallPotGuest",
        "body": "imagine being J Powell and having not clue what to do with so much aapl stock",
        "created_utc": 1583184424,
        "id": "fjb12uh",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1583213224.0
    },
    {
        "author": "Xots1234",
        "body": "I am going to sit in my assets in the long term and collect my dividends. \n\nWait, wrong subreddit. I’m buying a put on Apple at $12 that expires on Wednesday.",
        "created_utc": 1583801350,
        "id": "fk2hrs1",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1583830150.0
    },
    {
        "author": "long_AMZN",
        "body": "fun fact: AAPL (new gold, safe haven) is down 3% from the beginning of December 2019",
        "created_utc": 1584029751,
        "id": "fkbb8z8",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584058551.0
    },
    {
        "author": "Viridez",
        "body": "Feel so fucked rn\n\nMy ma works retail and they closed down tonight until April. They're offering her 15 hrs of pay per week until April. She just recently bought a house after getting back from DC due to failed engagement (he beat her).\n\n\nI have 3k in RH and I feel bad playing the market, I told her I'd her out but idk wtf my future lies and it's my moms 😭\n\nHolding a single spy call and 4 AAPL calls so hopefully they print do I can have cash for groceries next week",
        "created_utc": 1584588163,
        "id": "fkwbnuu",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584616963.0
    },
    {
        "author": "KyoceraMFP",
        "body": "Glad I was watching holy hell.\n\n&amp;#x200B;\n\nAAPL took a giant shit too, chart is hilarious.",
        "created_utc": 1585166726,
        "id": "flhovzd",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1585195526.0
    },
    {
        "author": "Randomness898",
        "body": "Lol Apple went up 10% the fuck. And stocks like Google didn't nearly go up as much even though Apple is way more affected by the virus. And Google dropped hard last week too so it wasn't like it didn't move last week.\n\nIs this the greatest Apple move all time on a non earnings date?",
        "created_utc": 1583183994,
        "id": "fjb0arb",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1583212794.0
    },
    {
        "author": "8aller8ruh",
        "body": "Dude, Berkshire is way too deep into reinsurance if the world keels over at the same time it won’t be insurance companies that are hurting.  It’ll be your little berky-berk.\n\nFacebook and all advertising will be hurt severely.  Might have the cash on hand and low overhead to hide it till then but still.  Alphabet is a bit more diversified but could get cucked by governments not letting them use their overseas money as they attempt to pay for anything in a reasonable way...and it’s on the list twice.  but Google Adsense is probably the only marketing companies will be forced to keep using.\n\nMicrosoft and Apple are in a great position in that they can have near zero overhead if they choose to and all technology companies will pretend to be part of the solution.  Make an app for pretending to scan for Corona, treat it at home, or anything related and they are golden whether it works or not.\n\nAmazon is a couple coronavirus links away from people being wary and already stopped taking allowing new non-medical supplies to be restocked in their warehouses.  Things are going to go out of stock left and right...but this protects their workers to a degree...\n\nPositions?  Let us see your bloody SPY calls my dude //they can’t be that bad can they?  Example for the algo: SPY 420c 4/20?",
        "created_utc": 1584670305,
        "id": "fkzgahh",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1584699105.0
    },
    {
        "author": "wearethealienshere",
        "body": "I gotchu. Example: \n\nYou have an Apple worth $0.25. I say I’ll buy your Apple tomorrow for $0.50 if you give it to me today. There’s then a shortage of apples for some reason (or anything else that would drive up the demand for apples), which I’ve predicted, and I find someone willing to give me 1.00$ for the Apple. I pay you back your $0.50 and pocket the excess $0.50.  \n\nThat’s a put, unless I’m an autist. \n\nA call is essentially the inverse of that. If an Apple is worth $0.25 today but for some reason you think that the apples value will increase, you approach the Apple owner and say you will pay them $0.30 for an Apple tomorrow. Hopefully tomorrow you were correct in your prediction and apples are now worth $0.50, so you sell your Apple to someone else and pocket the difference\n\nEdit: could be completely wrong tho, I am autistic",
        "created_utc": 1584568133,
        "id": "fkvffxk",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1584596933.0
    },
    {
        "author": "Elna_Fybbg",
        "body": "AVGO reaffirms their dividend. Now handing out 6.5% with at least 50% upside. I feel like stonks are starting to look nice",
        "created_utc": 1584064128,
        "id": "fkcyjk1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1584092928.0
    },
    {
        "author": "Trident1000",
        "body": "Rationale: Broadcom is currently worth over $800 on a DCF basis, and more like over ~$1200 if it were stretched on the valuation/in line with other stocks.  I know that puts the price off the charts technically and is laughably high, but it is what it is.  I have no idea why its trading where it is.  Usually there is an issue with the stock but its really a straightforward business with a large moat and is universally recommended by analysis's on the street.  The cash flow growth is 11% on average and the dividend yield is almost 5% right now.  Its trading at historically low RSI levels on the monthly (this is where it was before it rocketed 300% the last time around).  \n\n&amp;nbsp;\n\nWith that said, this is my set up.  A 2 year time horizon to see this rocket and a short term put hedge to get us through this virus situation (no idea if further impact will be worth the option but just like to limit volatility on uncertain events).  Taking a chance here and hoping it pays off down the line.",
        "created_utc": 1583351876,
        "id": "fjho3em",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1583380676.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Imagine being a company that reports earnings tomorrow...... rip ulta and Broadcom",
        "created_utc": 1583985709,
        "id": "fk9x1cz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1584014509.0
    },
    {
        "author": "PayMe4TradeIdeas",
        "body": "Definitely, td.to, ry.to, car.un, avgo(7%). Buy set on drip and forget about it\n\n\nI ain't no financial advisor. Cant sue. But I would be do that if had low interest moneh",
        "created_utc": 1584399340,
        "id": "fkp0ygw",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1584428140.0
    },
    {
        "author": "PayMe4TradeIdeas",
        "body": "Forget the oil\n\nStart buying DIS, AVGO ( the best one 5.3% dividend  and raising )",
        "created_utc": 1583802972,
        "id": "fk2ked4",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1583831772.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "so is any of these ER gonna save this pos market or nah.\n\nAVGO?",
        "created_utc": 1584044708,
        "id": "fkc2ut3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1584073508.0
    },
    {
        "author": "tommyselleck123",
        "body": "O, CSCO, CVS, DIS, JPM, MDT, MSFT, VZ, ECL, CTAS, WMT, AVGO, INTC, MS, NEE",
        "created_utc": 1584560510,
        "id": "fkv254j",
        "score": 3,
        "subreddit": "stocks",
        "created": 1584589310.0
    },
    {
        "author": "davidbigham",
        "body": "really did not expect Broadcom to go under $200.",
        "created_utc": 1584381057,
        "id": "fko6hwb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584409857.0
    },
    {
        "author": "richbeezy",
        "body": "Former 🌈🐻here that went bullish late last week. AVGO with a 6.7% dividend here looks to good to be true and well positioned for 5G (so long as computers and phones still exist a year from now).",
        "created_utc": 1584387140,
        "id": "fkoh6mf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584415940.0
    },
    {
        "author": "mcele311",
        "body": "Do we play any earnings boyz? Or we will get gaped no matter what by market movement? Broadcom is looking  spicy its down a bunch obviously, i usually like to run otm calls with experation dates 3 to 5 weeks out stock im bullish on but , .. but im not sure if its worth it because of Boomer plague",
        "created_utc": 1583636372,
        "id": "fjw7ugq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583665172.0
    },
    {
        "author": "gettendies",
        "body": "AVGO earnings?\n\nAny thoughts?",
        "created_utc": 1583991233,
        "id": "fka3ja1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584020033.0
    },
    {
        "author": "Elna_Fybbg",
        "body": "AVGO earnings tonight...Anyone gonna play?",
        "created_utc": 1584031383,
        "id": "fkbe8c8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584060183.0
    },
    {
        "author": "Bbear11",
        "body": "The date was March 2nd, now it’s after market March 4th.  By this point, it has been priced in.\n\nI’m a shareholder of AVGO.  Great cash flows and super dividend yield.",
        "created_utc": 1583385728,
        "id": "fjj7p2l",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583414528.0
    },
    {
        "author": "MostlyKelp",
        "body": "Split between these two calls going into next week: BA or AVGO?!",
        "created_utc": 1583365425,
        "id": "fjidqcx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583394225.0
    },
    {
        "author": "inept_kumquat",
        "body": "Jesus, Broadcom is getting slaughtered",
        "created_utc": 1584380004,
        "id": "fko4lt2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584408804.0
    },
    {
        "author": "PayMe4TradeIdeas",
        "body": "Man I wish I had money to buy AVGO or sell long dated put on avgo. 6% dividend",
        "created_utc": 1584117672,
        "id": "fkeoxz1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584146472.0
    },
    {
        "author": "richbeezy",
        "body": "AVGO is lookin nice here - great 5G player and a 6.7% dividend (pays out $13 per share).",
        "created_utc": 1584467680,
        "id": "fkrf85x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584496480.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 17th of March\n\n\n\n## Upcoming events for Tuesday, March 17th\n\n - Stock splits:\n\n    - EMBYF @ **1:15**\n\n - Expected earnings:\n\n  AIH, AKRO, ATNM, ATXI, AU, AXLA, BAX, BILI, BITA, CHA, CPSS, CRTX, CVGI, CYD, DBI, DL, ERYP, FDX, FTR, GEVO, GNC, HALL, HDS, HNP, IDXG, LE, MDB, MIK, MUX, NGM, NNVC, PEIX, PFMT, PRVL, PULM, RMBL, RRTS, SFST, SMAR, SSKN, STOK, SUNW, TERP, TEUM, UEC, UUUU, VIR, WMGI, WPRT, XP\n\n - Ex-div:\n\n  ACCO, AFT, AIF, AIMC, BANX, CAL, CEN, CHMG, CINF, CXE, CXH, DMB, FOF, FSK, FSS, GEF, GEF.B, HBAN, HRZN, KSS, LDP, LPLA, LVS, MAIN, MAV, MCR, MHI, MIE, MIN, MMT, MYE, NEWT, PFLT, PHD, PHI, PHT, PNNT, PSF, RA, RNP, RQI, SJI, TY, UTF\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 6.407M)\n    - Business Inventories (consensus: -0.1%, previous: 0.1%)\n    - Capacity Utilization Rate (consensus: 77.1%, previous: 76.8%)\n    - Core Retail Sales (consensus: 0.2%, previous: 0.3%)\n    - Industrial Production (consensus: 0.4%, previous: -0.3%)\n    - Industrial Production (previous: -0.83%)\n    - JOLTs Job Openings (consensus: 6.476M, previous: 6.423M)\n    - Manufacturing Production (consensus: 0.3%, previous: -0.1%)\n    - NAHB Housing Market Index (consensus: 73, previous: 74)\n    - Redbook (previous: -0.1%)\n    - Redbook (previous: 6.0%)\n    - Retail Control (consensus: 0.4%, previous: 0.0%)\n    - Retail Inventories Ex Auto (previous: 0.3%)\n    - Retail Sales (consensus: 0.2%, previous: 0.3%)\n    - Retail Sales (previous: 4.38%)\n    - Retail Sales Ex Gas/Autos (previous: 0.4%)\n\n## Upcoming events for Wednesday, March 18th\n\n - Stock splits:\n\n    - TU @ **2:1** (Payable date: 03/17/2020)\n\n - Expected earnings:\n\n  ACMR, ARCO, AXAS, BAK, BSGM, BZUN, CAPR, CHU, CODX, CORV, CPIX, CTRA, DFFN, DMAC, DUO, DYAI, EYES, FANH, FGBI, FIVE, GALT, GECC, GES, GIS, GVA, HEXO, IAA, IBN, IDYA, MLHR, MNOV, MOR, NEXT, NIO, NK, ONEM, OSMT, PANL, PD, PRTH, PSTI, QADA, QTT, RLMD, RYB, SILV, SLRX, STAF, TARA, TCOM, TLRD, TMDI, TPTX, VFF, VXRT, WSM, XBIT\n\n - Ex-div:\n\n  ADT, BBY, BCRH, BPOP, EBSB, FISI, KMF, KYN, LM, LMNX, SLRC, SNV, SUNS, VCIF, VGR\n\n - Economic events and announcements:\n\n    - Building Permits (consensus: 1.500M, previous: 1.550M)\n    - Building Permits (previous: 9.2%)\n    - Crude Oil Imports (previous: 0.918M)\n    - Crude Oil Inventories (consensus: 2.933M, previous: 7.664M)\n    - Cushing Crude Oil Inventories (previous: 0.704M)\n    - Distillate Fuel Production (previous: 0.057M)\n    - EIA Refinery Crude Runs  (previous: 0.006M)\n    - EIA Weekly Distillates Stocks (consensus: -1.900M, previous: -6.404M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.4%, previous: -0.5%)\n    - Gasoline Inventories (consensus: -3.000M, previous: -5.048M)\n    - Gasoline Production (previous: 0.199M)\n    - Heating Oil Stockpiles (previous: -1.034M)\n    - Housing Starts (consensus: 1.500M, previous: 1.567M)\n    - Housing Starts (previous: -3.6%)\n    - MBA 30-Year Mortgage Rate (previous: 3.47%)\n    - MBA Mortgage Applications (previous: 55.4%)\n    - MBA Purchase Index (previous: 280.7)\n    - Mortgage Market Index (previous: 1,172.1)\n    - Mortgage Refinance Index (previous: 6,418.9)\n    - Thomson Reuters IPSOS PCSI (previous: 62.90)\n\n## Upcoming events for Thursday, March 19th\n\n - Stock splits:\n\n    - BKGFY @ **1:1.079**\n\n - Expected earnings:\n\n  ACER, ACIU, ACN, AIRI, ALNA, APRE, APTX, ARAV, AUTO, BIOL, CEO, CLDX, CLUB, CMC, CNTG, CRWD, CTAS, CTXR, DLTH, DOYU, DRI, EFOI, ENT, EPAC, FRG, GDS, GGAL, GIII, GRFS, HABT, HOOK, HTGM, HX, IGMS, IMAC, IMV, IOTS, KRTX, LEN, LLEX, LONE, MBRX, MOMO, NBSE, NKSH, NVCN, OLLI, ONVO, OSS, PDSB, PLCE, PXS, PZG, RTIX, SBSW, SCHL, SCPH, SEEL, SLGL, SNN, SSI, TEF, TRVI, UFAB, UNT, VBLT, VIE, VIVE, WRTC, WTRH, XCUR, YTEN, ZLAB\n\n - Ex-div:\n\n  AAN, AAP, ACP, AGD, AIN, AINV, AL, ALRS, AOD, ARDC, AWP, BIG, CB, CNQ, CUBA, DEX, DIN, DKS, EGIF, FLXS, GAIN, GARS, GLAD, GOOD, HPP, HTLD, IEP, IGR, IROQ, ITCB, KAR, LAND, MGU, MLI, PINE, PLOW, PVH, QCRH, QTS, RBCAA, RPT, SABR, SPR, SRE, TCRD, THQ, THW, TIF, TPB, TSLF, TSM, WEYS, WMT\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: 0.036%)\n    - 4-Week Bill Auction (previous: 0.395%)\n    - 8-Week Bill Auction (previous: 0.290%)\n    - Continuing Jobless Claims (consensus: 1,725K, previous: 1,722K)\n    - Current Account (consensus: -109.0B, previous: -124.1B)\n    - Initial Jobless Claims (consensus: 220K, previous: 211K)\n    - Jobless Claims 4-Week Avg. (previous: 214.00K)\n    - Natural Gas Storage (previous: -48B)\n    - Philadelphia Fed Manufacturing Index (consensus: 10.0, previous: 36.7)\n    - Philly Fed Business Conditions (previous: 45.4)\n    - Philly Fed CAPEX Index (previous: 29.80)\n    - Philly Fed Employment (previous: 9.8)\n    - Philly Fed New Orders (previous: 33.6)\n    - Philly Fed Prices Paid (previous: 16.40)\n    - US Leading Index (consensus: 0.1%, previous: 0.8%)\n\n## Upcoming events for Friday, March 20th\n\n - Expected earnings:\n\n  ADMP, DOOO, GNLN, HDB, HIBB, HUGE, INUV, NRBO, SRNE, TIF, UTSI\n\n - Ex-div:\n\n  AVGO, BFC, BGH, CPTA, DX, EQR, FEO, FFA, FGBI, FMN, HRC, ITIC, LTC, PM, SWZ, TIPT\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: -86.7K)\n    - CFTC Copper speculative net positions (previous: -38.9K)\n    - CFTC Corn speculative net positions (previous: 5.6K)\n    - CFTC Crude Oil speculative net positions (previous: 388.4K)\n    - CFTC Gold speculative net positions (previous: 319.7K)\n    - CFTC Nasdaq 100 speculative positions (previous: 32.2K)\n    - CFTC Natural Gas speculative net positions (previous: -231.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 5.2K)\n    - CFTC Silver speculative net positions (previous: 48.3K)\n    - CFTC Soybeans speculative net positions (previous: 11.4K)\n    - CFTC Wheat speculative net positions (previous: 26.7K)\n    - Existing Home Sales (consensus: 0.7%, previous: -1.3%)\n    - Existing Home Sales (consensus: 5.50M, previous: 5.46M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 683)\n    - U.S. Baker Hughes Total Rig Count (previous: 792)\n\n^^^^2020-03-17",
        "created_utc": 1584439217,
        "id": "fkqbmnr",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1584468017.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 18th of March\n\n\n\n## Upcoming events for Wednesday, March 18th\n\n - Stock splits:\n\n    - TU @ **2:1** (Payable date: 03/17/2020)\n\n - Expected earnings:\n\n  ACMR, ARCO, AXAS, BAK, BSGM, BZUN, CAPR, CHU, CODX, CORV, CPIX, CTRA, DFFN, DMAC, DUO, DYAI, FANH, FGBI, FIVE, GECC, GES, GIS, GVA, HEXO, IAA, IBN, IDYA, MLHR, MNOV, MOR, NEXT, NIO, NK, ONEM, OSMT, PANL, PD, PRTH, PSTI, QADA, QD, QTT, RLMD, RYB, SILV, SLRX, STAF, TARA, TCOM, TLRD, TMDI, VFF, VXRT, WSM, XBIT\n\n - Ex-div:\n\n  ADT, BBY, BCRH, BPOP, EBSB, FISI, KMF, KYN, LM, LMNX, SLRC, SNV, SUNS, VCIF, VGR\n\n - Economic events and announcements:\n\n    - Building Permits (consensus: 1.500M, previous: 1.550M)\n    - Building Permits (previous: 9.2%)\n    - Crude Oil Imports (previous: 0.918M)\n    - Crude Oil Inventories (consensus: 3.256M, previous: 7.664M)\n    - Cushing Crude Oil Inventories (previous: 0.704M)\n    - Distillate Fuel Production (previous: 0.057M)\n    - EIA Refinery Crude Runs  (previous: 0.006M)\n    - EIA Weekly Distillates Stocks (consensus: -1.963M, previous: -6.404M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.1%, previous: -0.5%)\n    - Gasoline Inventories (consensus: -2.890M, previous: -5.048M)\n    - Gasoline Production (previous: 0.199M)\n    - Heating Oil Stockpiles (previous: -1.034M)\n    - Housing Starts (consensus: 1.500M, previous: 1.567M)\n    - Housing Starts (previous: -3.6%)\n    - MBA 30-Year Mortgage Rate (previous: 3.47%)\n    - MBA Mortgage Applications (previous: 55.4%)\n    - MBA Purchase Index (previous: 280.7)\n    - Mortgage Market Index (previous: 1,172.1)\n    - Mortgage Refinance Index (previous: 6,418.9)\n    - Thomson Reuters IPSOS PCSI (previous: 62.90)\n\n## Upcoming events for Thursday, March 19th\n\n - Stock splits:\n\n    - BKGFY @ **1:1.079**\n\n - Expected earnings:\n\n  ACER, ACIU, ACN, AIRI, APRE, APTX, ARAV, AUTO, BIOL, BLPH, BPMX, CEO, CFRX, CLDX, CLUB, CMC, CNTG, CRWD, CTAS, CTXR, CUE, DLTH, DOYU, DRI, EFOI, ENT, EPAC, EYES, FINV, FRG, GDS, GGAL, GHG, GIII, GRFS, HABT, HEPA, HOOK, HTGM, HX, IGMS, IMAC, IMV, INAP, IOTS, KRTX, LEN, LLEX, LONE, LX, MBRX, MOMO, NBSE, NGS, NKSH, NVCN, OLLI, ONVO, PDSB, PLCE, PXS, PZG, RTIX, SBSW, SCHL, SCPH, SEEL, SLGL, SNN, SSI, TEF, UFAB, UXIN, VBLT, VIE, VIVE, WRN, WRTC, XCUR, YTEN, ZLAB\n\n - Ex-div:\n\n  AAN, AAP, ACP, AGD, AIN, AINV, AL, ALRS, AOD, ARDC, AWP, BIG, CB, CNQ, CUBA, DEX, DIN, DKS, EGIF, FLXS, GAIN, GARS, GLAD, GOOD, HPP, HTLD, IEP, IGR, IROQ, ITCB, KAR, LAND, MGU, MLI, PINE, PLOW, PVH, QCRH, QTS, RBCAA, RPT, SABR, SPR, SRE, TCRD, THQ, THW, TIF, TPB, TSLF, TSM, WEYS, WMT\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: 0.036%)\n    - 4-Week Bill Auction (previous: 0.395%)\n    - 8-Week Bill Auction (previous: 0.290%)\n    - Continuing Jobless Claims (consensus: 1,725K, previous: 1,722K)\n    - Current Account (consensus: -109.0B, previous: -124.1B)\n    - Initial Jobless Claims (consensus: 220K, previous: 211K)\n    - Jobless Claims 4-Week Avg. (previous: 214.00K)\n    - Natural Gas Storage (previous: -48B)\n    - Philadelphia Fed Manufacturing Index (consensus: 10.0, previous: 36.7)\n    - Philly Fed Business Conditions (previous: 45.4)\n    - Philly Fed CAPEX Index (previous: 29.80)\n    - Philly Fed Employment (previous: 9.8)\n    - Philly Fed New Orders (previous: 33.6)\n    - Philly Fed Prices Paid (previous: 16.40)\n    - US Leading Index (consensus: 0.1%, previous: 0.8%)\n\n## Upcoming events for Friday, March 20th\n\n - Expected earnings:\n\n  ADMP, DOOO, GNLN, HDB, HIBB, HSON, HUGE, INUV, NRBO, ONCS, REXN, SINT, SRNE, TEO, TIF, UTSI\n\n - Ex-div:\n\n  AVGO, BFC, BGH, CPTA, DX, EQR, FEO, FFA, FGBI, FMN, HCAP, HRC, ITIC, LTC, NREF, PM, SWZ, TIPT\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: -86.7K)\n    - CFTC Copper speculative net positions (previous: -38.9K)\n    - CFTC Corn speculative net positions (previous: 5.6K)\n    - CFTC Crude Oil speculative net positions (previous: 388.4K)\n    - CFTC Gold speculative net positions (previous: 319.7K)\n    - CFTC Nasdaq 100 speculative positions (previous: 32.2K)\n    - CFTC Natural Gas speculative net positions (previous: -231.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 5.2K)\n    - CFTC Silver speculative net positions (previous: 48.3K)\n    - CFTC Soybeans speculative net positions (previous: 11.4K)\n    - CFTC Wheat speculative net positions (previous: 26.7K)\n    - Existing Home Sales (consensus: 0.7%, previous: -1.3%)\n    - Existing Home Sales (consensus: 5.50M, previous: 5.46M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 683)\n    - U.S. Baker Hughes Total Rig Count (previous: 792)\n\n^^^^2020-03-18",
        "created_utc": 1584525620,
        "id": "fktlr36",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1584554420.0
    },
    {
        "author": "davidbigham",
        "body": "AVGO is crashing like BA. wtf",
        "created_utc": 1584541469,
        "id": "fku3jzn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584570269.0
    },
    {
        "author": "PayMe4TradeIdeas",
        "body": "Why is avgo crashing so hard. Is a steal at these prices or is the company fked? ( for buy n hold 1 plus year )",
        "created_utc": 1584373806,
        "id": "fkntv1j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584402606.0
    },
    {
        "author": "PayMe4TradeIdeas",
        "body": "Thanks . What do you think of avgo shares",
        "created_utc": 1584374236,
        "id": "fknulcd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584403036.0
    },
    {
        "author": "BF5lagsssss",
        "body": "CISCO if it falls is good. Yes WEBEX has Zoom as its competitor but in network infrastructure it is the only major US firm and its competitors Juniper Networks doesnt quite have the scale as CISCO. However I would get CISCO maybe at 30 or less. I heard CISCO is entering the fabless network chip design market against Broadcom though so if you want sure throw down.",
        "created_utc": 1584379837,
        "id": "fko4azr",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1584408637.0
    },
    {
        "author": "davidbigham",
        "body": "Dam, Broadcom is dropping like Boeing.",
        "created_utc": 1584384285,
        "id": "fkoc6po",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584413085.0
    },
    {
        "author": "gopoohgo",
        "body": "&gt;I know fundamentals can be thrown out for now since we're trading through a pandemic, but something to keep an eye on going forward.  \n\nLooking at historic PEs is pointless as a measure of value, because we don't have any idea what forward earnings will be.  What we do know, is bad.  \n\nWhen companies like Broadcom say \"yeah...uh, fuck the forward guidance, we have no idea how shitty things will get\", I think waiting for market volatility to die/waiting for a floor to develop is a better plan.",
        "created_utc": 1584286647,
        "id": "fkkldnv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584315447.0
    },
    {
        "author": "sublimepact",
        "body": "Yup. That's when people will know how much it is actually affecting cash flow for these corps. They usually pick on one company to trigger a tidal wave of more selling. Right now there are a few Q1 reports coming out today tomorrow, Adobe, Broadcom, not what date range Q1 2020 encompasses (some are showing as q4 2019).\n\nYeah keep things posted here but likely it all depends how the corporations choose to \"word\" their target misses, or use it to cover up or shift on the books somewhere else for a sunny day in the future.",
        "created_utc": 1583976373,
        "id": "fk9hu4y",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1584005173.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 10th of March\n\n\n\n## Upcoming events for Tuesday, March 10th\n\n - Expected earnings:\n\n  ADXS, AIH, AKBA, AKRO, APEI, APTO, ARA, ARPO, ASPU, ATXI, AU, AXLA, BBX, BCEL, BE, BIOL, BXC, CATB, CCXI, CDMO, CDXC, CLDR, CLNE, CLRB, CPSS, CRTX, CSTL, CVIA, CYD, DKS, DSKE, DTIL, EMAN, FIXX, FLGT, FLL, FTR, GNC, GPX, GRTX, HALL, HCHC, HEAR, HOOK, III, INST, KFY, KOPN, KRYS, LOMA, MOGO, MVIS, NBRV, NEX, NGM, NIO, NNVC, NOAH, NSPR, NXTC, OPGN, PAM, PEIX, PETQ, PRPL, PRVL, PSN, PTGX, PULM, QTT, RESN, REYN, RMED, RRTS, SCCO, SFST, SNSS, SPAR, STOK, STSA, SUNW, SWTX, TACT, TEUM, TISI, TLRA, TRXC, TSQ, UEC, UUUU, VIR, VSLR, VSTM, WMGI, XGN, YORW\n\n - Ex-div:\n\n  AEE, AGO, BBDC, DHF, HPE, HPQ, NWS, NWSA, RE, SFL, SR, TU, TXRH, WRB, WSBF\n\n - Economic events and announcements:\n\n    - 3-Year Note Auction (previous: 1.394%)\n    - API Weekly Crude Oil Stock (previous: 1.690M)\n    - NFIB Small Business Optimism (actual: 104.5, consensus: 104.5, previous: 104.3)\n    - Redbook (previous: -0.1%)\n    - Redbook (previous: 5.9%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, March 11th\n\n - Expected earnings:\n\n  ACEL, ADRO, AMOT, ANIX, APLT, AQMS, ARCT, AXAS, AXU, BAK, BBCP, BBW, BLFS, BREW, BSGM, CALA, CHU, CLSD, CODX, CORV, CPIX, CRHM, CRNX, DMAC, DQ, DUO, DVAX, DYAI, EVOK, EXPR, EYES, FGBI, FLNT, FPH, FPI, FSM, FTEK, GALT, GECC, GVA, HEXO, HHS, HNGR, HUD, IBN, IDN, IDRA, IDYA, IEA, INMB, INSE, INSG, INXN, JCS, KINS, LCUT, LMNR, LPCN, LPL, LQDA, MCRI, MEET, MGEN, MIRM, MNOV, MOR, MUX, NAVB, NEXT, NK, NTEC, NVAX, PDD, PDLI, PFIE, PFNX, PHI, PKOH, PRTH, PSNL, PSTI, PUK, RC, RLMD, RST, SIEN, SILV, SLDB, SLRX, SMTC, SONM, SPHS, TACO, TALO, TARA, TH, TMDI, UBX, UNFI, VCNX, VFF, VRA, VTNR, VXRT, WPM, XBIT, XERS, ZAGG\n\n - Ex-div:\n\n  AAT, ACV, AIO, ASTE, AY, BTO, CBH, DBL, DCF, DSL, ECC, EFL, EHT, EIC, EVF, FNV, FUSB, GIL, HD, HEQ, HPF, HPI, HPS, HTD, HTY, HVT, HVT.A, JBT, JHI, JHS, LGI, MDU, MNRL, MPW, NBR, NCV, NCZ, NRGX, NRIM, ORA, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, POOL, PTY, PYN, PZC, RVT, STAY, SWCH, UVE, VGI, VSH, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.622%)\n    - CPI (consensus: 0.2%, previous: 0.1%)\n    - CPI (consensus: 2.2%, previous: 2.5%)\n    - CPI Index, n.s.a. (consensus: 258.54, previous: 257.97)\n    - CPI Index, s.a (previous: 258.82)\n    - CPI, n.s.a (previous: 0.39%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.2%)\n    - Core CPI (consensus: 2.3%, previous: 2.3%)\n    - Core CPI Index (previous: 266.48)\n    - Crude Oil Imports (previous: -0.476M)\n    - Crude Oil Inventories (consensus: 1.848M, previous: 0.785M)\n    - Cushing Crude Oil Inventories (previous: -1.971M)\n    - Distillate Fuel Production (previous: -0.198M)\n    - EIA Refinery Crude Runs  (previous: -0.312M)\n    - EIA Weekly Distillates Stocks (consensus: -2.133M, previous: -4.008M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: -1.0%)\n    - Federal Budget Balance (consensus: -236.3B, previous: -33.0B)\n    - Gasoline Inventories (consensus: -2.686M, previous: -4.340M)\n    - Gasoline Production (previous: -0.040M)\n    - Heating Oil Stockpiles (previous: 0.099M)\n    - MBA 30-Year Mortgage Rate (previous: 3.57%)\n    - MBA Mortgage Applications (previous: 15.1%)\n    - MBA Purchase Index (previous: 265.8)\n    - Mortgage Market Index (previous: 754.1)\n    - Mortgage Refinance Index (previous: 3,594.4)\n    - OPEC Monthly Report\n    - Real Earnings (consensus: 0.1%, previous: 0.1%)\n    - Thomson Reuters IPSOS PCSI (previous: 62.90)\n\n## Upcoming events for Thursday, March 12th\n\n - Stock splits:\n\n    - ICD @ **1:20**\n    - INLX @ **1:50**\n\n - Expected earnings:\n\n  ADBE, ADMA, ADVM, AGEN, AGFS, AGRO, AIRI, ALDX, ALOT, AMPH, AMRS, AP, APRE, AQST, ASUR, AVDL, AVEO, AVGO, AXSM, AZUL, BAX, BDSI, BEST, BGSF, BLCM, BLPH, BPMX, BRMK, BRT, CAL, CATS, CBAY, CBPO, CELC, CELH, CEMI, CERC, CFRX, CHAP, CLUB, CNST, CPLG, CRBP, CRMD, CSU, CTK, CTXR, CUE, DG, DOCU, DOMO, EIGR, ESTE, EVFM, FLXN, FOMX, GARS, GCO, GDEN, GEN, GERN, GHG, GLMD, GPL, GPS, GRFS, GSHD, HABT, HARP, HEPA, HSDT, HTHT, HX, HZN, IGMS, IMAC, INAP, INO, INVE, IOTS, IRIX, JBL, JOBS, KALV, KRTX, LAIX, LCTX, LLEX, LX, LXRX, MBII, MBRX, MDLA, MOGU, MRAM, MYO, NBEV, NBSE, NGS, NKSH, NLTX, NNBR, NOG, NSCO, OCUL, ONVO, ORCL, PAR, PDSB, PGNX, PLSE, PLX, PRTY, PRVB, PTE, PWFL, PZG, QRHC, RDNT, REDU, REED, RFIL, RMNI, RMTI, RTIX, RUBY, SALM, SBSW, SCYX, SDPI, SEEL, SELB, SENS, SHSP, SIC, SLGG, SMTX, SNN, SPRO, SRT, SVRA, SYBX, TEF, TERP, TGEN, TLYS, TRVI, TRVN, TTPH, ULTA, UNIT, UNT, UXIN, VEON, VIE, VIVE, VOLT, VRAY, WORK, WRN, WRTC, WUBA, XCUR, XFOR, XONE, YI, YMAB, ZEAL, ZSAN, ZUMZ, ZUO\n\n - Ex-div:\n\n  ADP, ALB, AME, AMH, AMSF, APTS, AU, AVK, BBBY, BBSI, BCTF, BDC, BR, BRY, BSIG, BXMX, BXS, CAE, CCD, CCI, CCOI, CFFI, CGO, CHI, CHW, CMA, CMCT, COFS, CPG, CPK, CPZ, CRH, CRWS, CSQ, CTBI, CTS, CVE, DIAX, DPZ, DVN, ENS, EOD, ETM, ETN, EXPO, FBSS, FDUS, FFIC, FFNW, FHN, FIS, FMNB, FRO, FTAI, GBAB, GFI, GGM, GHY, GILD, GOF, GOLF, GPK, GPN, HUN, HWBK, IBKC, ICMB, IIIN, IR, ISD, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JSD, JTA, JTD, KHC, KIO, LAD, LEG, LEO, LHX, M, MAXR, MBIN, MFSF, MGPI, MNRO, MSI, MTEX, NAC, NAD, NAN, NBB, NCB, NDAQ, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMFC, NMS, NMZ, NOV, NPN, NRK, NSA, NSL, NTES, NTRS, NUV, NUW, NVG, NWE, NXJ, NXR, NYV, NZF, OCSI, OCSL, OVV, PHM, PKG, QQQX, RGR, RIVE, RNR, RRR, RS, SAH, SAMG, SCI, SJR, SLCA, SNDR, SNR, SOHO, SPXX, STRT, SYBT, TCBK, TECK, TG, THG, TRTN, TRU, TSLX, TT, TXT, UBSI, UNTY, USPH, UTMD, VLY, VRSK, WH, WMB, WOR, WSBC, WWE, XEL\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.061%)\n    - 4-Week Bill Auction (previous: 0.925%)\n    - 8-Week Bill Auction (previous: 0.820%)\n    - Continuing Jobless Claims (consensus: 1,723K, previous: 1,729K)\n    - Core PPI (consensus: 0.1%, previous: 0.5%)\n    - Core PPI (consensus: 1.7%, previous: 1.7%)\n    - Initial Jobless Claims (consensus: 218K, previous: 216K)\n    - Jobless Claims 4-Week Avg. (previous: 213.00K)\n    - Natural Gas Storage (consensus: -82B, previous: -109B)\n    - PPI (consensus: -0.1%, previous: 0.5%)\n    - PPI (consensus: 1.8%, previous: 2.1%)\n\n## Upcoming events for Friday, March 13th\n\n - Expected earnings:\n\n  ACHV, AVH, BKE, CHMA, CNAT, CTRN, GNLN, GOGO, HCAP, HDB, HHR, HROW, HSON, KIRK, NEOS, OFS, ONCS, PLXP, PTI, REXN, SINT, SOL, TEO, UBA\n\n - Ex-div:\n\n  AGM, AIG, AMPY, ANTM, ARCC, ARKR, ARR, ATRI, BAF, BANC, BBF, BBK, BBN, BCE, BCX, BDJ, BFK, BFO, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BKK, BLE, BLW, BME, BNY, BOE, BQH, BSD, BSE, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, BZM, CARO, CBU, CHS, CII, CNMD, CORE, CSFL, CSWC, CWH, DPG, DTE, EDF, EDI, EFSC, EGF, EMN, ESRT, ESSA, EVC, EXR, FCAP, FCNCA, FFG, FFIN, FG, FRA, FRT, GIM, GRMN, GROW, HES, HLNE, HRTG, HYT, IRM, ITT, JCI, JCS, JRVR, KBR, KNL, KO, LAMR, LDOS, MCA, MEN, MHD, MLR, MMD, MNE, MRCC, MRK, MTSC, MUE, MUI, MUS, NEU, NEXA, NFJ, NIE, NXPI, NXRT, OMI, PB, PFBI, PLD, PRSC, PSA, PSB, QSR, ROIC, RRBI, RWT, SBR, SELF, SFNC, SGA, SMMF, SPOK, SRF, SRV, SSP, STC, SZC, TCO, TEI, TMO, TPVG, TROW, UCBI, UE, UGI, UNH, VVI, WTM, WYND\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: -114.0K)\n    - CFTC Copper speculative net positions (previous: -44.2K)\n    - CFTC Corn speculative net positions (previous: -7.1K)\n    - CFTC Crude Oil speculative net positions (previous: 431.5K)\n    - CFTC Gold speculative net positions (previous: 335.9K)\n    - CFTC Nasdaq 100 speculative positions (previous: 39.6K)\n    - CFTC Natural Gas speculative net positions (previous: -233.8K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 55.6K)\n    - CFTC Silver speculative net positions (previous: 74.8K)\n    - CFTC Soybeans speculative net positions (previous: -30.6K)\n    - CFTC Wheat speculative net positions (previous: 42.9K)\n    - Export Price Index (consensus: -0.4%, previous: 0.7%)\n    - Export Price Index (previous: 0.5%)\n    - Import Price Index (consensus: -0.8%, previous: 0.0%)\n    - Import Price Index (previous: 0.3%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.30%)\n    - Michigan Consumer Expectations (consensus: 88.2, previous: 92.1)\n    - Michigan Consumer Sentiment (consensus: 95.0, previous: 101.0)\n    - Michigan Current Conditions (consensus: 112.0, previous: 114.8)\n    - Michigan Inflation Expectations (previous: 2.4%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 682)\n    - U.S. Baker Hughes Total Rig Count (previous: 793)\n\n^^^^2020-03-10",
        "created_utc": 1583834493,
        "id": "fk3i0wd",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583863293.0
    },
    {
        "author": "Elna_Fybbg",
        "body": "AVGO June 300c, thank me later",
        "created_utc": 1584040343,
        "id": "fkbuwha",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584069143.0
    },
    {
        "author": "goodraine",
        "body": "It's likely. There is profit taking or exiting on bounce type activity going on. The S&amp;P was 100% green at open. Now look. Check out the difference between INTC and AVGO (the red block next to INTC).\n[Finviz SP500 Map](https://finviz.com/map.ashx)",
        "created_utc": 1584108197,
        "id": "fke9782",
        "score": 1,
        "subreddit": "options",
        "created": 1584136997.0
    },
    {
        "author": "davidbigham",
        "body": "Anyone want to catch the knife on AVGO?",
        "created_utc": 1584115863,
        "id": "fkelv17",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584144663.0
    },
    {
        "author": "blobbythebobby",
        "body": "Any companies you're looking at? I'm looking at LRCX, AMAT, AVGO, MU, TSM, KLAC. I have a thing for semiconductors.\n\nI feel like we're gonna get peak fear once US cases balloon properly, so I'm waiting right now.",
        "created_utc": 1584016113,
        "id": "fkapiyi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584044913.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 12th of March\n\n\n\n## Upcoming events for Thursday, March 12th\n\n - Stock splits:\n\n    - ICD @ **1:20**\n    - INLX @ **1:50**\n\n - Expected earnings:\n\n  ACER, ACRX, ADBE, ADMA, ADVM, AGEN, AGFS, AGRO, AIRI, ALDX, ALNA, ALOT, AMPH, AMRS, AP, APRE, AQST, ARAV, ASUR, AUTO, AVDL, AVEO, AVGO, AXSM, AZUL, BAX, BDSI, BEST, BGSF, BLCM, BLPH, BLRX, BPMX, BRMK, BRT, CAL, CATS, CBAY, CBPO, CELC, CELH, CEMI, CERC, CFRX, CHAP, CLDX, CLPR, CLUB, CNTG, CPLG, CRBP, CTK, CTXR, CUE, DG, DLNG, DOCU, EIGR, ESTE, EVFM, FLL, FLNT, FLXN, FRG, GARS, GCO, GDEN, GEN, GERN, GGAL, GHG, GLMD, GPL, GPS, GRFS, GSHD, HABT, HARP, HEPA, HHS, HSDT, HTGM, HX, IGMS, IMAC, INAP, INO, INVE, IOTS, IRIX, KRTX, LAIX, LCTX, LLEX, LONE, LX, LXRX, MBII, MBRX, MDLA, MOGU, MRAM, MYO, NBSE, NGS, NKSH, NLTX, NNBR, NOG, NSCO, OCUL, ONVO, ORCL, OVID, PAR, PDSB, PFSW, PGNX, PKX, PLX, PRTY, PRVB, PTE, PWFL, PZG, QRHC, RDNT, REDU, REED, RFIL, RMNI, RMTI, RTIX, RUBY, SALM, SBSW, SCYX, SDPI, SEEL, SELB, SENS, SHSP, SIC, SLGG, SNN, SPAR, SPRO, SRT, SSI, SVRA, SYBX, TEF, TERP, TGEN, TGS, TISI, TLYS, TRVI, TRVN, TTPH, UFAB, ULTA, UNIT, UNT, UXIN, VEON, VIE, VOLT, VRAY, VRCA, WORK, WRN, WRTC, WTRH, WUBA, XCUR, XFOR, XONE, YI, YMAB, ZEAL, ZSAN, ZUMZ, ZUO\n\n - Ex-div:\n\n  ADP, ALB, AME, AMH, AMSF, APTS, AU, AVK, BBBY, BBSI, BCTF, BDC, BR, BRY, BSIG, BXMX, BXS, CAE, CCD, CCI, CCOI, CFFI, CGO, CHI, CHW, CMA, CMCT, COFS, CPG, CPK, CPZ, CRH, CRWS, CSQ, CTBI, CTS, CVE, DIAX, DPZ, DVN, ENS, EOD, ETM, ETN, EXPO, FBSS, FDUS, FFIC, FFNW, FHN, FIS, FMNB, FRO, FTAI, GBAB, GFI, GGM, GHY, GILD, GOF, GOLF, GPK, GPN, HUN, HWBK, IBKC, ICMB, IIIN, IR, ISD, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JSD, JTA, JTD, KHC, KIO, LAD, LEG, LEO, LHX, M, MAXR, MBIN, MFSF, MGPI, MNRO, MSI, MTEX, NAC, NAD, NAN, NBB, NCB, NDAQ, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMFC, NMS, NMZ, NOV, NPN, NRK, NSA, NSL, NTES, NTRS, NUV, NUW, NVG, NWE, NXJ, NXR, NYV, NZF, OCSI, OCSL, OVV, PHM, PKG, QQQX, RGR, RIVE, RNR, RRR, RS, SAH, SAMG, SCI, SJR, SLCA, SNDR, SNR, SOHO, SPXX, STRT, SYBT, TCBK, TECK, TG, THG, TRTN, TRU, TSLX, TT, TXT, UBSI, UNTY, USPH, UTMD, VLY, VRSK, WH, WMB, WOR, WSBC, WWE, XEL\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.061%)\n    - 4-Week Bill Auction (previous: 0.925%)\n    - 8-Week Bill Auction (previous: 0.820%)\n    - Continuing Jobless Claims (consensus: 1,723K, previous: 1,729K)\n    - Core PPI (consensus: 0.1%, previous: 0.5%)\n    - Core PPI (consensus: 1.7%, previous: 1.7%)\n    - Initial Jobless Claims (consensus: 218K, previous: 216K)\n    - Jobless Claims 4-Week Avg. (previous: 213.00K)\n    - Natural Gas Storage (consensus: -59B, previous: -109B)\n    - PPI (consensus: -0.1%, previous: 0.5%)\n    - PPI (consensus: 1.8%, previous: 2.1%)\n    - Thomson Reuters IPSOS PCSI (previous: 62.90)\n\n## Upcoming events for Friday, March 13th\n\n - Expected earnings:\n\n  ACHV, AVH, BKE, CNAT, CNTY, CTRN, GNLN, GOGO, HCAP, HDB, HHR, HROW, HSON, HUGE, JBL, JKS, KIRK, NEOS, OFS, ONCS, OSTK, PLXP, REXN, SINT, SMTX, SOL, TEO\n\n - Ex-div:\n\n  AGM, AIG, AMPY, ANTM, ARCC, ARKR, ARR, ATRI, BAF, BANC, BBF, BBK, BBN, BCE, BCX, BDJ, BFK, BFO, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BKK, BLE, BLW, BME, BNY, BOE, BQH, BSD, BSE, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, BZM, CARO, CBU, CHS, CII, CNMD, CORE, CSFL, CSWC, CWH, DPG, DTE, EDF, EDI, EFSC, EGF, EMN, ESRT, ESSA, EVC, EXR, FCAP, FCNCA, FFG, FFIN, FG, FRA, FRT, GIM, GRMN, GROW, HES, HLNE, HRTG, HYT, IRM, ITT, JCI, JCS, JRVR, KBR, KNL, KO, LAMR, LDOS, MCA, MEN, MHD, MLR, MMD, MNE, MRCC, MRK, MTSC, MUE, MUI, MUS, NEU, NEXA, NFJ, NIE, NXPI, NXRT, OMI, PB, PFBI, PLD, PRSC, PSA, PSB, QSR, REYN, ROIC, RRBI, RWT, SBR, SELF, SFNC, SGA, SMMF, SPOK, SRF, SRV, SSP, STC, SZC, TCO, TEI, TMO, TPVG, TROW, UCBI, UE, UGI, UNH, VVI, WTM, WYND\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: -114.0K)\n    - CFTC Copper speculative net positions (previous: -44.2K)\n    - CFTC Corn speculative net positions (previous: -7.1K)\n    - CFTC Crude Oil speculative net positions (previous: 431.5K)\n    - CFTC Gold speculative net positions (previous: 335.9K)\n    - CFTC Nasdaq 100 speculative positions (previous: 39.6K)\n    - CFTC Natural Gas speculative net positions (previous: -233.8K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 55.6K)\n    - CFTC Silver speculative net positions (previous: 74.8K)\n    - CFTC Soybeans speculative net positions (previous: -30.6K)\n    - CFTC Wheat speculative net positions (previous: 42.9K)\n    - Export Price Index (consensus: -0.4%, previous: 0.7%)\n    - Export Price Index (previous: 0.5%)\n    - Import Price Index (consensus: -0.8%, previous: 0.0%)\n    - Import Price Index (previous: 0.3%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.30%)\n    - Michigan Consumer Expectations (consensus: 88.2, previous: 92.1)\n    - Michigan Consumer Sentiment (consensus: 95.0, previous: 101.0)\n    - Michigan Current Conditions (consensus: 112.0, previous: 114.8)\n    - Michigan Inflation Expectations (previous: 2.4%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 682)\n    - U.S. Baker Hughes Total Rig Count (previous: 793)\n\n^^^^2020-03-12",
        "created_utc": 1584007213,
        "id": "fkagnyo",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1584036013.0
    },
    {
        "author": "choose_a_use",
        "body": "RIP semis. AVGO just shat the bed",
        "created_utc": 1584046193,
        "id": "fkc5iw7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584074993.0
    },
    {
        "author": "davidbigham",
        "body": "Rip , AVGO earning sucks and bring all the semi brother down with him.",
        "created_utc": 1584048032,
        "id": "fkc8r4g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584076832.0
    },
    {
        "author": "gopoohgo",
        "body": "Getting dragged down with Broadcom imho.  \n\nThey missed slightly, but pulled all future guidance.  \n\nMarket no likey",
        "created_utc": 1584050113,
        "id": "fkcccw2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584078913.0
    },
    {
        "author": "kinzaman",
        "body": "All the chip stocks getting obliterated AH because AVGO guides lower due to virus. Seems overdone to me, guess we’ll find out tomorrow.",
        "created_utc": 1584049713,
        "id": "fkcbntj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584078513.0
    },
    {
        "author": "CharmCityNole",
        "body": "I've already bought AVGO and MA in my long term accounts today.",
        "created_utc": 1583780622,
        "id": "fk1iyok",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583809422.0
    },
    {
        "author": "Jack-Booted-Thug",
        "body": "bought AVGO  3/27  210  call 4.30",
        "created_utc": 1584407998,
        "id": "fkpe73s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584436798.0
    },
    {
        "author": "PayMe4TradeIdeas",
        "body": "Which companies?\n\nAre you buying dis and avgo shares ?",
        "created_utc": 1584382321,
        "id": "fko8qv7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584411121.0
    },
    {
        "author": "FredWeedMax",
        "body": "Yeah but AVGO is actually a good stock tho",
        "created_utc": 1584542364,
        "id": "fku4z7z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584571164.0
    },
    {
        "author": "nuhdoooo",
        "body": "https://www.google.com/amp/s/247wallst.com/investing/2020/03/13/top-analyst-upgrades-and-downgrades-amazon-adobe-amd-apple-blackrock-broadcom-caterpillar-deere-microsoft-morgan-stanley-oracle-slack-and-more/amp/",
        "created_utc": 1584244546,
        "id": "fkjfoua",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584273346.0
    },
    {
        "author": "nuhdoooo",
        "body": "Not according to broAdcom",
        "created_utc": 1584244496,
        "id": "fkjfmjf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584273296.0
    },
    {
        "author": "pinkplacentasurprise",
        "body": "Think you might want to do that DCF again, maybe at finbox.  Don't forget you won't receive dividends with that option.  Might want to look at QCOM too if you're going fundamental, better ROI in the dupont.\n\nThat said, I feel like I'm a portfolio manager and you're trying to sell me on why we should go overweight on AVGO with a 688 DTE call instead of a debit spread or plain stock.  I'm here to watch people fucking gamble and do autistic shit son",
        "created_utc": 1583358327,
        "id": "fji08zu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583387127.0
    },
    {
        "author": "reddituserzerosix",
        "body": "lol broadcom PPT",
        "created_utc": 1583870185,
        "id": "fk4yrbg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583898985.0
    },
    {
        "author": "CharmCityNole",
        "body": "I'm loving this drop for my IRA. I'm adding long term holdings on the cheap in MA, AVGO, and others already",
        "created_utc": 1583983088,
        "id": "fk9t9v8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584011888.0
    },
    {
        "author": "PM_ME_UR_INVESTMENTS",
        "body": "AVGO under 200?! O.o",
        "created_utc": 1584060954,
        "id": "fkctr4e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584089754.0
    },
    {
        "author": "ZT0931XK",
        "body": "AVGO going for the post earnings end zone spike",
        "created_utc": 1584107673,
        "id": "fke8dh2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584136473.0
    },
    {
        "author": "ZT0931XK",
        "body": "Any bears playing AVGO earnings",
        "created_utc": 1584029859,
        "id": "fkbbg01",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584058659.0
    },
    {
        "author": "FredWeedMax",
        "body": "WTF avgo paying close to 7% dividend at that price point if they don't lower it.",
        "created_utc": 1584542035,
        "id": "fku4g9x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584570835.0
    },
    {
        "author": "PayMe4TradeIdeas",
        "body": "WTF just happened to AVGO",
        "created_utc": 1584542238,
        "id": "fku4rvq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584571038.0
    },
    {
        "author": "JustTheWriter",
        "body": "**Hate to get all wholesome, but rest assured I'll get back to hurling abuse at the deserving momentarily.**  \n\n• There are likely some people out here who are being overshadowed by all the gain porn: folks who've lost their ass and might be worried as fuck. My only advice is to cut your losses and don't be ashamed or afraid to ask for help, even if it's reaching out to your fellow autists. I got crushed last fall chasing losses after CRM had their earnings call early and wrecked me. First people to reach out were people here. Messages, comments, all that. Since then, I've tried to pay that forward because it meant a lot at the time.  \n\n• This is real life and this is real money, yes. We all know a thing or two about risk. That said, COVID19 is positioned to fuck us all with a Theta crush. Don't take your physical well-being or that physical well-being of your loved ones for granted: take care of yourselves. \n\nThat's it. \n\nTL;DR: wash your fucking hands, take a deep breath. \n\n0327 SPY 275P",
        "created_utc": 1583952397,
        "id": "fk8agi1",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1583981197.0
    },
    {
        "author": "possiblyafish",
        "body": "Imagine trying to sell anybody ANYTHING with this shit going on right now. “Yeah I know it’s a crazy day but I’ve got a fucking sweet deal on CRM software for you”",
        "created_utc": 1584035624,
        "id": "fkbm9uk",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1584064424.0
    },
    {
        "author": "Robot-duck",
        "body": "My once dead April and June calls on shit like AMD and CRM are actually starting to offset my dying SPY puts what even is this. \n\nTomorrow I’m gonna just sit and spin, not doing anything until next week unless something drastic happens",
        "created_utc": 1583356494,
        "id": "fjhws5e",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583385294.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "Tech is going to use this as an excuse for lay-offs. Always happens. \n\nPuts on Microsoft, Oracle, Salesforce, IBM, Dell, etc. \n\nThese guys have huge consultant groups and you can’t bill clients if you’re on the bench.",
        "created_utc": 1583964588,
        "id": "fk8x7wu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583993388.0
    },
    {
        "author": "Enigma_101",
        "body": "######How hell is a 997.166 PE ratio for Salesforce(CRM) even possible? This market is messed up 🤦🏻‍♂️",
        "created_utc": 1584377167,
        "id": "fknzm37",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1584405967.0
    },
    {
        "author": "uwishucouldunswallow",
        "body": "that happened to me with $CRM\n\nwu flu fucks u",
        "created_utc": 1583443410,
        "id": "fjlb3xy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583472210.0
    },
    {
        "author": "UsuallylurknotToday",
        "body": "This guy works at service now or salesforce guaranteed. nobody else holds that many conferences",
        "created_utc": 1583286090,
        "id": "fjf7qxo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583314890.0
    },
    {
        "author": "coolcomfort123",
        "body": "Fb, googl, amzn and crm.",
        "created_utc": 1583070340,
        "id": "fj6fkou",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583099140.0
    },
    {
        "author": "larry_dallas99",
        "body": "Anyone got puts on CRM?",
        "created_utc": 1583071258,
        "id": "fj6gkgp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583100058.0
    },
    {
        "author": "DisastrousBluebirb",
        "body": "CRM co-founder left the company so that was a factor",
        "created_utc": 1583138843,
        "id": "fj9a3u3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583167643.0
    },
    {
        "author": "mcele311",
        "body": "I suggest not playing individual stocks that arent health related, look what happened to guys who played  CRM earnings",
        "created_utc": 1583147235,
        "id": "fj9gc6e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583176035.0
    },
    {
        "author": "CapitalC5",
        "body": "SHOP has the worst p/e ratio I've seen so far and they're losing more money every year for 4 years in a row now. V, MA, MSFT and CRM have good financials but are also overvalued.",
        "created_utc": 1584486146,
        "id": "fksb4uu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584514946.0
    },
    {
        "author": "Fizzy_T",
        "body": "Long on Salesforce. Any company who wants the ability to have remote workers will put more value in a crm.",
        "created_utc": 1584450658,
        "id": "fkqmxl7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584479458.0
    },
    {
        "author": "Fizzy_T",
        "body": "Leaving Salesforce is also very expensive.",
        "created_utc": 1584451298,
        "id": "fkqnsxo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584480098.0
    },
    {
        "author": "QuanOne",
        "body": "I work in the Bay Area and if you think sales force or square is over valued then you need to go back to your cave. SFDC controls the B2B CRM market. It’s like saying - LinkedIn is over valued. GTFO",
        "created_utc": 1584451263,
        "id": "fkqnr6e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584480063.0
    },
    {
        "author": "ArminVanBuuren",
        "body": "Why not diversify a bit too. Maybe pick up some Salesforce.",
        "created_utc": 1584523966,
        "id": "fktkh3z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584552766.0
    },
    {
        "author": "Enigma_101",
        "body": "#Holding CRM Calls 3/20 🥺🔫",
        "created_utc": 1584292039,
        "id": "fkku7wh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584320839.0
    },
    {
        "author": "Enigma_101",
        "body": "#Holding CRM Calls. Please make me feel better 🥺🔫",
        "created_utc": 1584365940,
        "id": "fknhl75",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584394740.0
    },
    {
        "author": "thait84",
        "body": "Businesses won't need Salesforce when they are going out of business.",
        "created_utc": 1584365998,
        "id": "fknho9l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584394798.0
    },
    {
        "author": "blade2you1234",
        "body": "Been investing since last January, so a little over a year. But I have tried to spread it across a couple different markets! Numbers are in shares:\n\nBAC 50x\n\nCRM 6x\n\nD 50x\n\nDIS 20x\n\nINTC 18x\n\nIRM 100x\n\nJNJ 9x\n\nKO 20x\n\nMSFT 15x\n\nNLY 50x\n\nNOK 50x\n\nT 50x\n\nTGT 15x\n\nV 13x\n\nVZ 30x\n\nNext on the docket are: PG, ABBV, WM",
        "created_utc": 1583269526,
        "id": "fjecvoe",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583298326.0
    },
    {
        "author": "Robot-duck",
        "body": "The only thing I have left is an SPY put I'm riding and a CRM call that is in June or July that I'll also just ride. Every other cent is now in my TD account that I was only using for stocks and theta gang stuff.",
        "created_utc": 1583271544,
        "id": "fjeh3ux",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583300344.0
    },
    {
        "author": "yaphealme",
        "body": "Why wont CRM die?",
        "created_utc": 1583342724,
        "id": "fjh7hsp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583371524.0
    },
    {
        "author": "atn016",
        "body": "100% stock cause I like to go big or go home!!\n\nTech-50%\n\nV\n\nMA\n\nMSFT\n\nCRM\n\nSHOP\n\nEverything else - 50%\n\nJNJ\n\nABBV\n\nDIS\n\nLOW\n\nUPS\n\nPG\n\nPEP\n\nTMUS\n\nLMT\n\nBA\n\nVOO",
        "created_utc": 1583885384,
        "id": "fk5pm3a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583914184.0
    },
    {
        "author": "Madharder",
        "body": "Gonna miss out on thousands bc I sold my Salesforce, roku, and MU puts at close yesterday. \n\nStill own dis, mRNA and fb puts",
        "created_utc": 1584015980,
        "id": "fkapcyq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584044780.0
    },
    {
        "author": "Madharder",
        "body": "Everything man. I’m still in the same boat but look at superovervalued stuff like Salesforce, square, and roku",
        "created_utc": 1584016143,
        "id": "fkapk9z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584044943.0
    },
    {
        "author": "MakeMyDayGypsy",
        "body": "I’ve been waiting for CRM to be a reasonable price for a long time. I have limit order in at $122. ILMN at $171.",
        "created_utc": 1584031414,
        "id": "fkbeaek",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1584060214.0
    },
    {
        "author": "akmalhot",
        "body": "Got any other ideas? May start a twlo POS on another down day,.. shop? I'm already overweight crm and shop at a lower cost basis than today",
        "created_utc": 1583840228,
        "id": "fk3mzae",
        "score": 1,
        "subreddit": "investing",
        "created": 1583869028.0
    },
    {
        "author": "tinyraccoon",
        "body": "No, that was sector-wide.  AMZN is down, so are ADBE, IBM, AYX, TEAM, CRM, etc etc",
        "created_utc": 1583616546,
        "id": "fjugfdc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583645346.0
    },
    {
        "author": "swoosh112",
        "body": "Should I buy puts on SF based companies like CRM and OKTA when the Corona eventually hits SF?",
        "created_utc": 1583351267,
        "id": "fjhmzur",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583380067.0
    },
    {
        "author": "optionseller",
        "body": "what's your price target for CRM",
        "created_utc": 1583110255,
        "id": "fj8clyv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583139055.0
    },
    {
        "author": "coolcomfort123",
        "body": "msft, v, ma, googl, amzn, and crm.",
        "created_utc": 1583165390,
        "id": "fja34zm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583194190.0
    },
    {
        "author": "the_retart",
        "body": "Yea. I went with Salesforce. Figured no chinese manufacturing and maybe remote software will be on the rise.\n\nBoeing so cheap tho...",
        "created_utc": 1584026284,
        "id": "fkb531w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584055084.0
    },
    {
        "author": "vVvRain",
        "body": "Companies won't cut back on tech, especially as people are forced to work from home, arguably more tech is needed. Companies like Zoom, Salesforce, oracle, etc won't go away because all crucial business activities are preformed through many of these SaaS services. You can't suddenly stop accounting or communication.",
        "created_utc": 1584053960,
        "id": "fkcirzr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584082760.0
    },
    {
        "author": "PalsgrafBlows",
        "body": "Lol of course they use salesforce",
        "created_utc": 1583417370,
        "id": "fjk0qqp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583446170.0
    },
    {
        "author": "michielu",
        "body": "Yeah Vanguards are good. You can go on their website and they have good examples of diverse vanguard portfolios depending on how aggressive you want to be. \n\nPersonally, that wasn't agressive enough so i got into american tech(amazon, google, microsoft, salesforce), and chinese companies like alibaba and tencent",
        "created_utc": 1583539746,
        "id": "fjp1rrt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583568546.0
    },
    {
        "author": "borntoperform",
        "body": "Teams is not a better alternative. It fucking sucks. My company uses Slack and it's money for our internal communication. The only reason to use Teams is to save money, but a company with a few hundred to several thousand people will probably use (and should use) Slack over Teams.\n\nPlus, we've integrated things like Salesforce and other platforms into Slack, and it was really easy to integrate.",
        "created_utc": 1583443371,
        "id": "fjlb1f9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583472171.0
    },
    {
        "author": "bigjoe13",
        "body": "Winners bracket: $WMT 2-1\nInverse bracket: $CRM 2-1",
        "created_utc": 1583690499,
        "id": "fjy5zbq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583719299.0
    },
    {
        "author": "degener8_otm",
        "body": "Right on. There are a million big names that pay well for sales engineers and have solid prospects for your equity to pan out. If you can't get a job at one of those, Oracle, ServiceNow, SalesForce, Palo Alto Networks and the like are always hiring.",
        "created_utc": 1583178636,
        "id": "fjaqhhl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583207436.0
    },
    {
        "author": "larry_dallas99",
        "body": "CRM p/e is through the roof. Puts easy money right now?",
        "created_utc": 1583372062,
        "id": "fjiobt0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583400862.0
    },
    {
        "author": "Enigma_101",
        "body": "#####MSFT, CRM, ADBE AAPL and NVDA calls for September.",
        "created_utc": 1583853726,
        "id": "fk45i9a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583882526.0
    },
    {
        "author": "DivineMomentsOfWhoa",
        "body": "Agreed! I am just paper trading because I’m a noob but I bought some CRM calls for September. Kinda want to just hold them to see what happens.",
        "created_utc": 1584410404,
        "id": "fkphooj",
        "score": 1,
        "subreddit": "options",
        "created": 1584439204.0
    },
    {
        "author": "swolking",
        "body": "Damn. Was waiting for CRM $120 to buy some up. Appears that ship has sailed. Lol",
        "created_utc": 1584456296,
        "id": "fkqv9hv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584485096.0
    },
    {
        "author": "Captain-i0",
        "body": "&gt; SaaS is up like a rocket today. Appian, Okta, Splunk, Salesforce.. it's weird\n\nThey have workforces than can easily work from home. They are recurring contract based. The majority of their contracts are with large corporations that aren't going to stop using their service during a recession.  Many companies have much of their infrastructure built through these platforms. They aren't going to just kill them, unless they are completely closing up shop for good. \n\nThey won't see as many new investments during a recession, but they aren't going to lose much in the way of customers, and some companies may use this time to spend on internal projects. I was surprised they ever were taking much of a hit in this crash to begin with. If you can get them cheap, I would.",
        "created_utc": 1584459851,
        "id": "fkr18jd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584488651.0
    },
    {
        "author": "Enigma_101",
        "body": "######OMFG Salesforce (CRM) P/E ratio is now 997.16 WTF 😳",
        "created_utc": 1584371406,
        "id": "fknpwc5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584400206.0
    },
    {
        "author": "shiningdays",
        "body": "\\&gt;In the B2B sector these contracts are all annualized. Businesses won't  cancel salesforce and square unless they're literally failing, which  is/will happen, but probably not enough to impact short term  valuations....yet...\n\n&amp;#x200B;\n\nWorked in ecommerce software for 4+ years. Beyond being annualized contracts (and, in fact, usually 3 year contracts on auto-renewal) the kinds of implementations that use these tech's are generally boutique hand-built custom things. That's the entire point of Square's API in many ways. Most of the companies which use these tech's are the kinds that do major tech upgrades/replatforming every 10-20 years or so. People who bought into Salesforce in 2008 are probably in the market for smth new, but people who bought into Square will probably stay with their current implementations until at least 2030.",
        "created_utc": 1584451498,
        "id": "fkqo321",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584480298.0
    },
    {
        "author": "Madharder",
        "body": "Businesses are going to be pennypinching and services like the one salesforce offer would be the first to go in my opinion",
        "created_utc": 1584451258,
        "id": "fkqnqwl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584480058.0
    },
    {
        "author": "Enigma_101",
        "body": "# Holding Salesforce (CRM) calls  🥺🔫",
        "created_utc": 1584325798,
        "id": "fkmclxh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584354598.0
    },
    {
        "author": "wasteoftime774",
        "body": "Msft 160 3/13\nCrm 170 3/13",
        "created_utc": 1583261321,
        "id": "fjdxtb1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583290121.0
    },
    {
        "author": "amoctar",
        "body": "They can be good bull traps though. I was trapped by CRM earnings like a retard",
        "created_utc": 1583073231,
        "id": "fj6j4ql",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583102031.0
    },
    {
        "author": "TrustedDeveloper",
        "body": "The coronavirus is just now cropping up in the US, with cases in [Washington State](https://twitter.com/HealthyFla?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Eauthor), [New York](https://twitter.com/NYGovCuomo/status/1234280155033546753?s=20), and [Florida](https://twitter.com/HealthyFla/status/1234307915395338242?s=20). The consensus seems to be that the CDC made some bad decisions early on, including developing their own ineffectual [Coronavirus test](https://www.politico.com/news/2020/03/01/health-officials-probe-coronavirus-cdc-118523). I am sure that we will see a considerable uptick in cases within the next two weeks across North America. If the Fed lowers interest rates this week, it will be a critical error to do so simply to quell a bearish market.\n\nI think that while investors cry at the Fed and markets rise in the early hours of the 2nd, buy month-long puts in manufacturing and tourism sectors. This bull market is not going down without a fight.\n\nSo...  \nPut - $LVS, 3/20, $57.5  \nCall - $SOXL 3/20, $350\n\nDon’t be like me and cling on to CRM and V calls from last week.\n\n[Positions (and why you should take my thoughts with a grain of salt)](https://imgur.com/gallery/QHNbNrw)",
        "created_utc": 1583129061,
        "id": "fj91vey",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583157861.0
    },
    {
        "author": "InKanosWeTrust",
        "body": "5000 in spy puts. 3000 in gld/jnug/crm/msft calls",
        "created_utc": 1583136733,
        "id": "fj98hic",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583165533.0
    },
    {
        "author": "trilogee",
        "body": "* They have the higest margins of any pure play retailer in the country (excluding legacy businesses). Sequential revenue increases since company's inception.\n* They have a proprietary CRM and analytics platform in hifyre that allows them to capture actionable insights on consumer spending and preferences. \n* They have the country's largest private database of retail customers through Spark Perks (over 50k members as of last q).\n* With the exception of the OCS they easily have the retail industry's most accessible and optimized e-commerce platform.\n* They have one of a few wholesale operations in SK which will enable them to vie for any future private wholesale decisions ON makes.  \n* They have the expertise to operate with compliance, in a highly regulated market (former mettrum/emblem execs). \n* They have the backing and support of $60B retail behemoth Alimentation Couche Tard (think about all the benefits this offers in terms of real estate, operational efficiencies, network etc.) \n* They are partnered with CBRE and have access to prime real estate (&lt;-- huge). \n* They are better capitalized than ANY other retailer in the country and even more so than most LPs.\n* They have an immediately recognizable brand with search interest that far outweighs their competition (check google trends).\n* CEO already forcasted profitability for Q2 2020.\n\nNo question that competition is going to be stiff - many retailers will fail; there's also room for many to succeed. Those who do will demonstrate discipline in cost control, will leverage data to order and stock products that sell, and will work with LPs to produce products that they know customers will want.\n\nEdit: Also to be clear, there are only about 190 ROLs issued thus far. 800 applications total. 190 or less RSAs have been submitted depending on who was ready at midnight yesterday.",
        "created_utc": 1583177793,
        "id": "fjaoypm",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1583206593.0
    },
    {
        "author": "dwiniars",
        "body": "Agreed, bitten by CRM same way",
        "created_utc": 1583328402,
        "id": "fjgjioi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583357202.0
    },
    {
        "author": "jlusales",
        "body": "Industry Vertical CRM will pass up General CRM more and more as time progresses. It's a lot easier and cost effective to buy software that already works for your business than try to customize an out of the box CRM. This is why Veeva is crushing it in the Pharma vertical.",
        "created_utc": 1583331972,
        "id": "fjgogai",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583360772.0
    },
    {
        "author": "HowGreatAreYourDanes",
        "body": "u/cardinalnumber you guys seem to have figured out how to send generic salesforce emails - good work, we’re proud of you. Maybe go knockoff Grindr, a financial app isn’t working well for you.",
        "created_utc": 1583416000,
        "id": "fjjytck",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583444800.0
    },
    {
        "author": "larry_dallas99",
        "body": "Bought CRM 165p April 3 on Tuesday at 4.80, sold it yesterday for 12.00",
        "created_utc": 1583692120,
        "id": "fjy8wr2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583720920.0
    },
    {
        "author": "sc_shay20",
        "body": "$TWLO , $CRM?",
        "created_utc": 1583813889,
        "id": "fk30hbw",
        "score": 1,
        "subreddit": "investing",
        "created": 1583842689.0
    },
    {
        "author": "DaSemicolon",
        "body": "Winners- CRM 2-1 Inverse: MMM 2-0",
        "created_utc": 1583988203,
        "id": "fka07rr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584017003.0
    },
    {
        "author": "the_retart",
        "body": "anyone buying for long term accounts? i want some boeing at 150 but know it is very exposed. the easier play would be some salesforce or remote working software.",
        "created_utc": 1584024031,
        "id": "fkb18pr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584052831.0
    },
    {
        "author": "errorme001",
        "body": "35% VOO\n15% QQQ\n\nThe rest in: NVDA, MSFT, AAPL, ORCL, CRM, TSLA, AMD, ADBE, NFLX, GOOG",
        "created_utc": 1584313032,
        "id": "fklrkl1",
        "score": 1,
        "subreddit": "investing",
        "created": 1584341832.0
    },
    {
        "author": "Enigma_101",
        "body": "# Someone please call me the R and A word. I am holding Salesforce Calls.",
        "created_utc": 1584370166,
        "id": "fknny7q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584398966.0
    },
    {
        "author": "swolking",
        "body": "DIS, MSFT, CRM, V, NVDA, SHOP\nAll look juicy AF if you had the capital for 2022 leaps on all of them, I imagine you would be set for life. \n\nAlso, Boeing is too big to fail and is way down.",
        "created_utc": 1584068726,
        "id": "fkd5a31",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584097526.0
    },
    {
        "author": "companion_2_the_wind",
        "body": "Someone else's list I saw on Reddit:\n    \n\n**Disney** CEO, Bob Iger, 2/25 (after 15 Y)    \n**MasterCard** CEO, Ajay Banga, 2/25 (after 10 Y)    \n**Salesforce** CEO, Keith Block, 2/25 (after 18 M)    \nUber Eats VP, Jason Droege, 2/25 (after 6 Y)    \nOutdoor Voices CEO, Tyler Haney, 2/25 (after 8 Y)    \nCansortium Cannabis CEO, Jose Hidalgo, 2/25 (after 5 Y)     \n**St. Luke's Hospital** CEO, Christine Candio, 2/25 (after 5 Y) (one of St. Louis' biggest hospitals)    \nJCPenney CMO, Shawn Gensch, 2/25 (after 9 M)        \nBowers &amp; Wilkins CEO Gregory Lee, 2/24 (after 2 M)    \nBowers &amp; Wilkins CFO Gideon Yu, 2/24 (after 4 Y)    \n**L Brands** CEO, Les Wexner, 2/20 (after 57 Y)    \n**Credit Suisse** CEO, Tidjane Thiam, 2/13 (after 5 Y)    \n**MGM** CEO, Jim Murren, 2/12 (after 12 Y)    \nAurora Cannabis CEO, Terry Booth, 2/6 (+other big cuts)    \n**LinkedIn** CEO, Jeff Weiner, 2/5 (after 11 Y)    \n**HULU** CEO, Randy Freer, 1/31 (after 2 Y)    \n**IBM** CEO , Ginni Rometty, 1/30 (after 8 Y)    \nMatch.com CEO, Mandy Ginsberg, 1/29 (health)    \n    \n**International Airlines Group (IAG)** CEO, Willie Walsh, 1/9 (after 9 Y)",
        "created_utc": 1584151343,
        "id": "fkg6r9g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584180143.0
    },
    {
        "author": "Johnnybats330",
        "body": "Microsoft Teams. Mostly set up for Large enterprise. Slack is easy to customize and administer. Sack could dominate the mid/small business space and could potentially be bought out by Salesforce, IBM or Google.",
        "created_utc": 1583526275,
        "id": "fjoeqhk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583555075.0
    },
    {
        "author": "kojied",
        "body": "Yeah, it’s now about identifying sectors which have not seen that much of a downturn, but will in the future. Immediate industries (tourism, airlines, etc.) are already expected to fall. So maybe industries that will be indirectly impacted by the crisis are the ones to go after?\nThinking about advertisement, insurance, cloud solutions (e.g. salesforce)\nRural regions will be hit hard by the crisis, so regional banks may be a good idea too",
        "created_utc": 1584457182,
        "id": "fkqwpel",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584485982.0
    },
    {
        "author": "FargotRobMe",
        "body": "[Drew this on my lunch break because the new Boss Baby looks stupid](https://www.reddit.com/user/FargotRobMe/comments/fk8y9a/baby_cramer_wsb/?utm_source=share&amp;utm_medium=web2x)\n\nPositions:\n\n$PYPL 5/15 $135c\n\n$CSCO 4/24 $25p\n\nThanks for the $GLD, it makes up for my lunch getting cold",
        "created_utc": 1584465900,
        "id": "fkrc3eo",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1584494700.0
    },
    {
        "author": "VValrus54",
        "body": "Or you know. \n\n-\nCisco. Webex\n\n-\nMicrosoft. Teams.",
        "created_utc": 1583265073,
        "id": "fje4hqg",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1583293873.0
    },
    {
        "author": "helio987",
        "body": "Am I dumb to be putting in a bunch of sell orders on some stocks?  I am looking to get about 40k about right now. I have another 15k in cash.  I want some money in my account to hopefully buy the dip and I do hope it's not another 50% to go.  I feel like a idiot now for buying csco and vti back in January and already down 12 on cisco and 8 on vti",
        "created_utc": 1583108762,
        "id": "fj8adod",
        "score": 7,
        "subreddit": "investing",
        "created": 1583137562.0
    },
    {
        "author": "extwidget",
        "body": "Counterpoint as someone who works the other side of things: IT, where I set up solutions like this all day.\n\nWebex fucking sucks, and now that most people will be using it daily, expect Cisco to hemorrhage customers.",
        "created_utc": 1584477581,
        "id": "fkrwreo",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1584506381.0
    },
    {
        "author": "Jordykins850",
        "body": "Just put it all in CSCO 1/22 50c and live your life for the next year. Collect money.",
        "created_utc": 1583980920,
        "id": "fk9pupt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1584009720.0
    },
    {
        "author": "mootymoots",
        "body": "Interesting how SLACK is plummeting. Working from home was the press’s excuse for it going up only a few days back. \n\n\nhttps://finance.yahoo.com/news/coronavirus-zoom-microsoft-cisco-work-from-home-191121213.html",
        "created_utc": 1583960639,
        "id": "fk8pw44",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583989439.0
    },
    {
        "author": "Japparbyn",
        "body": "Short cisco and Apple lets go drill team!",
        "created_utc": 1583443269,
        "id": "fjlauu6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583472069.0
    },
    {
        "author": "bpait37613",
        "body": "Yes i do , You can easily do scalp options with 2k account as well. Infact i started with 2k account doing only CSCO 1 symbol and turned it into 21 K in 3 months using profit cycles and money management. Your max exposure to the market should be from 2 to 5 % .I can write a post about how profit cycles work for account growing while preserving capital",
        "created_utc": 1583381554,
        "id": "fjj2gs3",
        "score": 3,
        "subreddit": "options",
        "created": 1583410354.0
    },
    {
        "author": "niceanddtoastyplease",
        "body": "So any chance Cisco and Zoom moon since no one will be traveling?",
        "created_utc": 1583975933,
        "id": "fk9h2z4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1584004733.0
    },
    {
        "author": "roadtrippn",
        "body": "My neighbors are on mandatory remote for 2 weeks (FB and Cisco) I hope more companies follow and it proves out not needing to go into the office to do the same shit.",
        "created_utc": 1583815244,
        "id": "fk3233d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583844044.0
    },
    {
        "author": "dwyaneeewadeee",
        "body": "Cisco is an easy, safe, boring buy",
        "created_utc": 1583961998,
        "id": "fk8sd8c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583990798.0
    },
    {
        "author": "internetnewuser",
        "body": "I had that 2 weeks ago ... it spiked then came down and started tracking S&amp;P, so I sold and got some S&amp;P puts instead. I see it went up today.\n\nEdit: Good DD, OP. I would like to know how much rev can be sustained. Schools will be closed for a month. Will they keep using the platform after things went back to normal?  Some competitors: Free Google classroom, Cisco offered free Webex accounts, Zoom, etc.",
        "created_utc": 1584039989,
        "id": "fkbu97n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584068789.0
    },
    {
        "author": "ISeekGirls",
        "body": "$CSCO 40 calls 9/18... Dirt cheap options to print some extra cash.",
        "created_utc": 1583523484,
        "id": "fjo9ut3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583552284.0
    },
    {
        "author": "ColdManWinters",
        "body": "ZM\n\nEDIT or CSCO",
        "created_utc": 1583868867,
        "id": "fk4wcel",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583897667.0
    },
    {
        "author": "mayormcsleaze",
        "body": "Everyone is talking about how work from home will benefit Zoom but nobody is talking about Cisco. Am I missing something? WebEx meetings should skyrocket right? My org just doubled our number of Cisco AnyConnect VPN licenses",
        "created_utc": 1584460630,
        "id": "fkr2mh3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584489430.0
    },
    {
        "author": "MotivationalMadness",
        "body": "My uncles job just shut down an office branch and is telecommuting indefinitely until further notice.... *cough Cisco cough*",
        "created_utc": 1584137151,
        "id": "fkflmuq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584165951.0
    },
    {
        "author": "TheGoodSauce",
        "body": "CSCO is the biggest fucking cock tease",
        "created_utc": 1583860724,
        "id": "fk4hsvu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583889524.0
    },
    {
        "author": "Jordykins850",
        "body": "Cisco, IBM, CBS, Discover, shit ton of food stocks, Comcast, yada yada yada. Lots of beaten down blue chips.",
        "created_utc": 1583648134,
        "id": "fjwwxxc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583676934.0
    },
    {
        "author": "magnificient_turd",
        "body": "Any decently sized company with an IT department that’s got more than three brain cells already has this shit implemented. And half them probably use Cisco anyway.",
        "created_utc": 1583594765,
        "id": "fjs8oya",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583623565.0
    },
    {
        "author": "WestmontOG07",
        "body": "Amazon, google, FB, Qcom, SWKS, VOO, CSCO, Pfizer and Intel all the way down!\n\nAlso buying puts on the SPY!\n\nWhat are you buying?",
        "created_utc": 1584406963,
        "id": "fkpcnfl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1584435763.0
    },
    {
        "author": "N-tropi",
        "body": "It depends on how good your internal IT is and how much you pay Cisco. Source: worked at two large Fortune 500 companies both using Webex. Current job has excellent IT and flawless Webex other one was so shit that they moved to Skype for business, which was even more shit.",
        "created_utc": 1584496363,
        "id": "fksqz6j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584525163.0
    },
    {
        "author": "chazberlin",
        "body": "Seriously \\*fuck\\* WebEx. That might be their worst product. I am long on CSCO, but I'll take Zoom or even a Google Hangouts call over WebEx.",
        "created_utc": 1584452608,
        "id": "fkqpnnp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584481408.0
    },
    {
        "author": "Jonnydoo",
        "body": "wtf just happened to Cisco  ?",
        "created_utc": 1584540486,
        "id": "fku20v6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584569286.0
    },
    {
        "author": "Eunstoppable",
        "body": "The next time theres a rug pull im going to be going long calls on $CISCO. Everyone on this sub is bullish on Zoom and they forget that the majority of people working from home are using Cisco WebEx for meetings. DYOR but IV and premiums are pretty low for a multi-billion dollar company.",
        "created_utc": 1584515230,
        "id": "fktdn4t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584544030.0
    },
    {
        "author": "tehnoodles",
        "body": "At a very small scale software like DNAC or DCNM works ok. Try to scale this to 10,000's of nodes, and it starts to fall apart. I have seen this multiple different times, and this was using recommended compute hardware given to us by cisco to try and make it work.\n\nThe automation software crumbles when you reach scales the require automation, which completely defeats the purpose.\n\nI also didn't say their hardware has issues. Aside from the usual bug schedule (which cisco is no better/worse than anyone else) their hardware is rocksolid, it really comes down to the software for the API on the devices, or the software of tools to manage it.\n\nCisco is only a leader in the market when you look at the entire breadth of their portfolio because: No one else is spread as thin. Only Juniper comes close and IMO and while i like SRX, it's not a while lot better than Firepower. Their ability to automate though? Leaps and bounds above cisco, and their hardware platform is arguable just as mature as any that cisco has on the market.",
        "created_utc": 1584372554,
        "id": "fknrrp2",
        "score": 1,
        "subreddit": "investing",
        "created": 1584401354.0
    },
    {
        "author": "BF5lagsssss",
        "body": "CISCO if it falls is good. Yes WEBEX has Zoom as its competitor but in network infrastructure it is the only major US firm and its competitors Juniper Networks doesnt quite have the scale as CISCO. However I would get CISCO maybe at 30 or less. I heard CISCO is entering the fabless network chip design market against Broadcom though so if you want sure throw down.",
        "created_utc": 1584379837,
        "id": "fko4azr",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1584408637.0
    },
    {
        "author": "tendieshitter",
        "body": "First off, visit [optionsprofitcalculator.com](https://optionsprofitcalculator.com) to get an idea what you would make with the move of an option. It's usually difficult to calculate given all the variables, but this site should help.\n\n\" say I expect the stock to hit $35.50 at some point that day and I would  sell it, I would want to buy a put option because I expect the stock to  go down on Monday. This protects me and provides me with the opportunity  to sell my 100 shares at $36.62 still, when the current price is  $35.50. Correct? \"\n\nNo. If you expect a red Monday and you already own 100 shares of Cisco you plan to sell, you are already dealing with a loss. Furthermore, if you expect the price to go down further you would be good to buy a put contract on Cisco. \n\nIf you want to hang on to your shares of Cisco because you expect them to go up, but want \"insurance\" against that, you could also buy a put contract in case the price goes down.",
        "created_utc": 1584259300,
        "id": "fkjtrjg",
        "score": 1,
        "subreddit": "options",
        "created": 1584288100.0
    },
    {
        "author": "bookiefinesser",
        "body": "cisco webex is what my school has been using",
        "created_utc": 1584297958,
        "id": "fkl3xys",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584326758.0
    },
    {
        "author": "Vorskl",
        "body": "CISCO recovering to its 2000 price and the end of the Solar System - guess what 's common",
        "created_utc": 1584300667,
        "id": "fkl8a7l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584329467.0
    },
    {
        "author": "TrickyTarget",
        "body": "can anyone tell me why cisco at $30 strike price put expriring 4/17 went straight to $0.01even though they are down $4.56 since open",
        "created_utc": 1584365550,
        "id": "fknh0ne",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584394350.0
    },
    {
        "author": "EGK1717",
        "body": "Sysco, not Cisco",
        "created_utc": 1584324231,
        "id": "fkma65l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584353031.0
    },
    {
        "author": "gizamo",
        "body": "Lol. I also loath Cisco. When it was rumored that AMZN was making and would sell their own switches, I nearly shit myself with joy. Then, Bezos bitched out on us. Sooner or later they'll go the route of ORCL -- overcharge to the point of obsoleting themselves. I hope you're right. Cheers.",
        "created_utc": 1584325789,
        "id": "fkmclfr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584354589.0
    },
    {
        "author": "MT-6-55-3",
        "body": "I converted the $CORP to Aruba. They still suck, but they suck less than Cisco.\n\nCthulhu for president 2020! When you're tired of voting for the lesser of evils.",
        "created_utc": 1584326166,
        "id": "fkmd5tg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584354966.0
    },
    {
        "author": "ccaiccie",
        "body": "PANW FTNT CSCO",
        "created_utc": 1584283950,
        "id": "fkkh8dm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584312750.0
    },
    {
        "author": "fco1017",
        "body": "However, you want to go LONG.  I prefer to sell puts at what I think is below fair value for stock price.  For instance, I just sold APR puts for CSCO with strike of $40 for $3.55.",
        "created_utc": 1583943287,
        "id": "fk7tf3p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583972087.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "I would buy if I was in your position.  Cisco is doing alright atm.  They are, however, at a crossroads where they are trying to decide how to move forward.  They've been on a straight tear in [acquisitions](https://www.cisco.com/c/en/us/about/corporate-strategy-office/acquisitions/acquisitions-list-years.html) so if any of those pan out it could be big for them.  If you look at what each of those acquiring companies does though, it's all over the place.  SaaS, analytics, security, communications...I don't know if they're trying to be a jack-of-all-trades or if they are just throwing darts and seeing what sticks.",
        "created_utc": 1583854074,
        "id": "fk463l9",
        "score": 1,
        "subreddit": "investing",
        "created": 1583882874.0
    },
    {
        "author": "Logisticsbitches",
        "body": "Nope. MSFT has Skype.  Cisco has WebEx.  Either Dell or HP or dark horse Lenovo snatches up Zoom.  Apple is not the right fit",
        "created_utc": 1583990849,
        "id": "fka352n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584019649.0
    },
    {
        "author": "i_have_a_nose",
        "body": "Cisco maybe?",
        "created_utc": 1583968968,
        "id": "fk958o2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583997768.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM &amp; Cisco available for 115 and 35 in PM 🤤🤤",
        "created_utc": 1584000944,
        "id": "fkabz2e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584029744.0
    },
    {
        "author": "lplui",
        "body": "I am a new investor and here is what my portfolio so far.\n\nAAL majority of my shares\n\nMSFT\n\nUber\n\nPSX\n\nCCL\n\nKO\n\nSBUX\n\nAMD\n\nLBTYA\n\nCSCO\n\nPTN\n\nLYFT\n\nTaronis technologies: for short term investment\n\nI do not have too many shares on those but for this week, I want to buy more shares for the long term. My eyes are on SPY, APPl, and airlines but I think that each share is quite pricy. My plan for these upcoming weeks is to keep buying if the prices go lower. I have about $5k I want to invest but I don't want to diversify it too much and focus on where I have a great long term potential. Any advice?\n\nAgain, I am a new investor.",
        "created_utc": 1583688262,
        "id": "fjy22as",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583717062.0
    },
    {
        "author": "mickeyprime1",
        "body": "just go with a big full service broker like Schwab, Vanguard. I have both and was able to buy VTI, CSCO, STOR at 140,37.15,30 respectively. They worked great was able to change limit orders placed pre market to decrease limits even more almost at open. Now that trading cost are 0, no point sticking with RH. [Here](https://wealthcapitalist.com/tipsntricks/choose-broker-investing/?utm_source=reddit&amp;utm_medium=referral&amp;utm_campaign=generic_all) is my referral free review of both if you wanna check.",
        "created_utc": 1583763927,
        "id": "fk0qmok",
        "score": 1,
        "subreddit": "investing",
        "created": 1583792727.0
    },
    {
        "author": "jackperitas",
        "body": "I already sold some AMD puts\nMaybe I'll add CSCO, Apple and BRK.B",
        "created_utc": 1583789648,
        "id": "fk1ywqf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583818448.0
    },
    {
        "author": "mrbiggles2020",
        "body": "I have leaps right now.  Sold some CSCO outs and a FB put today as well.  Rest is AMZN leaps",
        "created_utc": 1583815865,
        "id": "fk32so8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583844665.0
    },
    {
        "author": "SUPER_swan",
        "body": "The ESPP program you have is a great money maker for you.\n\n\nLook at the last 10 years of the stock, not the last 6 months. Cisco has slowly gone up.\n\n\nLets say your required holding period is 1 year. That means if you hold the stock for 1 year and the stock doesn’t budge in price. If you sell you gain the 15% in the discount plus 4% from the dividend you gained as well. Historically, the stock has gone up as well, which also increase your gains.\n\nSo, continue to buy your company stock.\n\n\nNow there is some people I bet at your work, just like mine, that have bought their company stock for 20+ years and never sold. Doing this increasing your exposure to that one company. If the company tanks, your stock will be worth a lot less and you could be out of a job.\n\n\nHowever, if you go with selling right after your lock out period it’s a great way to use that discount to generate more money for you. \n\n\nRelax investing is a marathon not a sprint.",
        "created_utc": 1583847307,
        "id": "fk3vh8n",
        "score": 1,
        "subreddit": "investing",
        "created": 1583876107.0
    },
    {
        "author": "ChucklesMcGangsta",
        "body": "I own INTC, F , DAL, SPHD, T, PFE, CSCO, and SYF. When you focus on dividends and less on massive growth percentages, big dips in the market like this shouldnt worry you very much. Always keep a cash balance in your account for when dips like this happen. That way you can buy more stock of your favorite dividend companies when they do.",
        "created_utc": 1583752831,
        "id": "fk0d4cp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583781631.0
    },
    {
        "author": "suchacrisis",
        "body": "Yep, probably because no one is gunna buy for the market open price. I had puts on CSCO I tried to sell this morning for 3.80 and market is 2.33 right now.\n\nI get it, you fucked me and I can't make money Robinhood but at least let me fucking cancel it.",
        "created_utc": 1583772435,
        "id": "fk14us6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583801235.0
    },
    {
        "author": "Jordykins850",
        "body": "Cisco, 2yr lows. IBM, 52w low.",
        "created_utc": 1583478327,
        "id": "fjmpgtt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583507127.0
    },
    {
        "author": "ISeekGirls",
        "body": "$CSCO 40 call 9/18. Why? Well, their product WebEx is conferencing software, and a lot of businesses have started using ever since the outbreak. Also, Cisco already priced in the coronavirus in February. A significant shift from the office to the home is happening and will stay that way.",
        "created_utc": 1583613929,
        "id": "fju67vs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583642729.0
    },
    {
        "author": "ISeekGirls",
        "body": "Also, Webex, a Cisco product, has risen in use since the coronavirus outbreak. WebEx is a remote networking meeting software\nhttps://www.webex.com/",
        "created_utc": 1583524582,
        "id": "fjobrg2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583553382.0
    },
    {
        "author": "gamesterdude",
        "body": "Tech consultant here.\n\nThis guy is right. Companies don't have capacity for large scale work from home if a bulk of their workforce is normally in the office. \n\nSure you may always have been given VPN access, but most companies don't have enough capacity for everyone to use VPN at once. I typically see mid to large cap have capacity for about 30% of their workforce.\n\nI think if you want to play this though you have to stagger calls on cisco to collect on the q2, and q3 up tick. Theta may be a big enemy on this one.",
        "created_utc": 1583604636,
        "id": "fjt688f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583633436.0
    },
    {
        "author": "lo979797",
        "body": "Was too pricy for my paltry sum. Also $ONE, $CSCO",
        "created_utc": 1584055738,
        "id": "fkclngl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584084538.0
    },
    {
        "author": "Liquicity",
        "body": "MS Teams &gt; Slack. Slack is just for consultants to dick around and send memes to each other in every company where I've seen it used.   \n\n\nAlso, the earnings from more people WFH will show up in the future, not right now. These reports are for the quarter ending Dec 31, 2019. And you'd be better off looking at legit teleconferencing solutions such as CISCO and Zoom Video.",
        "created_utc": 1584061121,
        "id": "fkcu0fz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584089921.0
    },
    {
        "author": "ConBroMitch",
        "body": "$CSCO $PANW",
        "created_utc": 1584157479,
        "id": "fkgeo5m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584186279.0
    },
    {
        "author": "Vorskl",
        "body": "The older you become the less risk tolerant you are,  what's wrong with OP? Young people will live long enough to maybe see Tesla back at $1000 (hint: Zimbabwe style inflation in the us) but many seniors who loaded Cisco in 2000 won't ever see its recovery.",
        "created_utc": 1584200083,
        "id": "fkhj70k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584228883.0
    },
    {
        "author": "obnoxygen",
        "body": "The global oil price war hasn't played out yet, so while XOM and VLO are good companies they aren't a buy right now due to uncertainty.\n\nLikewise, I think travel will take a while to pick up again.\n\nwith $100 you can buy 3 csco, 1 sbux and 1 csco, or 1 CAT.\n\nThere's a lot of DIS fans on reddit too fwiw.",
        "created_utc": 1584131538,
        "id": "fkfcouq",
        "score": 1,
        "subreddit": "investing",
        "created": 1584160338.0
    },
    {
        "author": "willtherealdeal",
        "body": "Completely agree, I also like CSCO AND SBUX",
        "created_utc": 1584065730,
        "id": "fkd0yh3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584094530.0
    },
    {
        "author": "Greyrust",
        "body": "Yeah.  But not all blue chip stocks are that expensive - CSCO (Cisco) is at $32 right now, for example, and KO (Coke) is at $46.",
        "created_utc": 1584071714,
        "id": "fkd99xs",
        "score": 1,
        "subreddit": "investing",
        "created": 1584100514.0
    },
    {
        "author": "TrickyTarget",
        "body": "Do I sell CSCO $30p 4/17 or hold over weekend. Asking because the futures are down",
        "created_utc": 1584072351,
        "id": "fkda5s5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584101151.0
    },
    {
        "author": "vikkee57",
        "body": "Netflix did well duirng last week sell off, or in other words not as bad as the others - \n\nPast 5 days - Some random picks from this week's sell offs: \n\nBetter performance: \nNetflix: -3.5%\nRoku: -4%\nFitbit: -0.8%\nSquare: -0.2% \n\nWorst performers: \nCisco: -14%\nAMD: -15%\nApple: -12.5%\nBank of America: -17%\nTesla: -26%\nMacys: -19%",
        "created_utc": 1583426068,
        "id": "fjkfslv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583454868.0
    },
    {
        "author": "LakersRansom",
        "body": "fucking sell.  yes rev will be good but tbey are going to lower guidance\n\nI’m up 1400 today on puts and want to get some csco puts for earnings",
        "created_utc": 1583436666,
        "id": "fjkyy3y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583465466.0
    },
    {
        "author": "medicmurke",
        "body": "Except neither Zoom or Cisco is ready for this amount of bandwidth consumption. Universities are gonna be pissed on the other side of this.",
        "created_utc": 1583969699,
        "id": "fk96h8w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583998499.0
    },
    {
        "author": "Jordykins850",
        "body": "Idk. Cisco could go lower.. but I don’t see how IBM goes below $100..",
        "created_utc": 1584001147,
        "id": "fkac4pd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584029947.0
    },
    {
        "author": "StrictPopcorn",
        "body": "A bit of both. I’ve been using this time to sell off the stocks that I’ve been eying as underperforming and putting that money into stocks that are super down now so that I may see a good return instead of a continued loss even after the market recovers. \nI’ve also been increasing my dividend holdings significantly, I’ve been eying the airline stocks but for now I just have puts on a few airlines until I make a profit and put that money back into those stocks when I see a better sign of future growth coming for them. Right now they’re being hit harder than most stocks so that’s my thought behind it. \nTLDR:\nWhat I’ve been doubling down in: MSFT, NRZ, AMD, PFE, AMT, CSCO &amp; AAPL \nWhat I have puts on: JBLU, DAL, and sadly WEN (one of my larger holdings before the pandemic).",
        "created_utc": 1583969867,
        "id": "fk96rg2",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583998667.0
    },
    {
        "author": "Pi-R-Squared",
        "body": "Absolutely! CSCO is another one I have my eye on.",
        "created_utc": 1584047698,
        "id": "fkc8640",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584076498.0
    },
    {
        "author": "hwturner17",
        "body": "JNJ, ATT (T)/Verizon, Cisco to name a few others",
        "created_utc": 1584074808,
        "id": "fkdd78z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584103608.0
    },
    {
        "author": "philmacrack123",
        "body": "Thanks for letting me know of the demand for csco. Good luck",
        "created_utc": 1584131626,
        "id": "fkfcu5t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584160426.0
    },
    {
        "author": "ISeekGirls",
        "body": "Cisco already priced in the effects of the coronavirus in Feb. It will slowly rise thought out the year.",
        "created_utc": 1583524062,
        "id": "fjoauo6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583552862.0
    },
    {
        "author": "ISeekGirls",
        "body": "$CSCO 40 Call 9/18. WebEx has risen in use since the outbreak. Also, Cisco priced in the coronavirus during Feb.",
        "created_utc": 1583525981,
        "id": "fjoe7ya",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583554781.0
    },
    {
        "author": "WestmontOG07",
        "body": "My portfolio, for the communities thoughts:\n\nCVS\n\nVerizon\n\nPfizer\n\nIntel\n\nApple\n\nMicrosoft\n\nGoogle\n\nQualcomm\n\nVOO (S&amp;P ETF)\n\nLyondell Basell (Plastics / Polyurethane Manufacturer)\n\nSkyworks (5G)\n\nAmazon\n\nFoot Locker (Wish I wouldn't have bought this one but I'm in the game)\n\nFacebook\n\nCisco",
        "created_utc": 1583670365,
        "id": "fjxenu3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583699165.0
    },
    {
        "author": "Vorskl",
        "body": "BS. Imagine you bought nasdaq at the peak of 2000. It will take ONLY 2014 years to get your money back. Imagine your bought CISCO at its peak.... maybe your grandsons will get the money back, providing there will be Zimbamwe-like inflation in the USA",
        "created_utc": 1583673507,
        "id": "fjxhke1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583702307.0
    },
    {
        "author": "porraso",
        "body": "Non-tech, links to China, diversified (like DIS). If you’re a bit more bullish, something on the cheaper side like CSCO or IBM. Nothing too fancy, and I believe this is just scratching the surface, but you may be able to see a 10-20% jump if you but now without coughing up your balls every time you go into a position.",
        "created_utc": 1583596956,
        "id": "fjsh74k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583625756.0
    },
    {
        "author": "focusedddd",
        "body": "Yes. Also, I hear this little company called Cisco is an up and comer",
        "created_utc": 1583757966,
        "id": "fk0ij5x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583786766.0
    },
    {
        "author": "Jonnydoo",
        "body": "yeah before I had CSCO leaps that were 300% lol , not that I could get rid of them, but it was funny.",
        "created_utc": 1583763166,
        "id": "fk0pi71",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583791966.0
    },
    {
        "author": "Jimmy_bags",
        "body": "I honestly dont know why cisco is so low. They are a market innovator. They have certifications revolving around their products, those careers pay good money too.  They make equipment for the telco giants like comcast, att, their shit is on utility poles... fuck zoom, you'll buy calls and a security breach will happen and end your tendies.  I gave up on Cisco when the company sold off a shit ton of shares and made up \"low guidance\".. they fucked themselves and got rich in the process. Stupid assholes",
        "created_utc": 1583289548,
        "id": "fjfdij2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583318348.0
    },
    {
        "author": "SnarkySparkyIBEW332",
        "body": "&gt; As long as manufacturing can bottleneck your profits, you’re not a tech company.\n\nDisagree.  Lots of tech companies make hardware.  AMD, NVDA, MSFT, Apple, Cisco, etc. all make hardware.  What you're thinking of is a *software* company.  All software companies are tech companies, but not all tech companies are software companies.",
        "created_utc": 1583366730,
        "id": "fjifw0e",
        "score": 1,
        "subreddit": "investing",
        "created": 1583395530.0
    },
    {
        "author": "Smok3dSalmon",
        "body": "They were in bed with CISCO before GCP. They have something on AWS also. But yeah, a grim scenario is that they're the odd man out and looking to be acquired.",
        "created_utc": 1583266185,
        "id": "fje6isk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583294985.0
    },
    {
        "author": "peterjswift",
        "body": "Zoom, Blackboard, Slack, Webex (even though it is a cisco product)...all run on AWS.   \n\nNot to mention all the quarantine providing entertainment like Netflix, Disney+, hulu, and of course Prime video.\n\nAWS is gonna have the biggest quarter in their history.",
        "created_utc": 1583893808,
        "id": "fk64z5n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583922608.0
    },
    {
        "author": "ringrawer",
        "body": "Every 3 years it's done for COMPTIA &amp; CISCO.",
        "created_utc": 1583871026,
        "id": "fk50ae9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583899826.0
    },
    {
        "author": "MementoMori97",
        "body": "MSFT, CSCO, DIS, JET (airline etf, waiting on this one for a while still)",
        "created_utc": 1584370783,
        "id": "fknoxd2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584399583.0
    },
    {
        "author": "orchid_breeder",
        "body": "Go one level deeper and short Cisco that supplies food to most of these restaurants",
        "created_utc": 1584455176,
        "id": "fkqthjk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584483976.0
    },
    {
        "author": "capteni",
        "body": "&gt; Cisco\n\nSYSco",
        "created_utc": 1584455250,
        "id": "fkqtlq4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584484050.0
    },
    {
        "author": "skilliard7",
        "body": "If SPY drops below $240 or CSCO drops below $32, I'll buy.",
        "created_utc": 1584317609,
        "id": "fklywzs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584346409.0
    },
    {
        "author": "Jordykins850",
        "body": "UBER, SPLUNK, CISCO, IBM",
        "created_utc": 1584334781,
        "id": "fkmopc8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584363581.0
    },
    {
        "author": "smartidiotreddit",
        "body": "I agree, shorted the fuck outa $CSCO free money",
        "created_utc": 1584498051,
        "id": "fkstjbb",
        "score": 1,
        "subreddit": "investing",
        "created": 1584526851.0
    },
    {
        "author": "FargotRobMe",
        "body": "Shuffled my positions around:\n\n$PYPL 5/15 $135c\n\n$CSCO 4/24 $25p\n\nSome of you don't understand that selling an unlikely/shitty option at a profit during these volatile times is a thing and it shows.\n\n\"YoU rEaLLy tHiNk $\\[XXXX\\] iS GonNa bE wOrTh ThAt bY tHeN??\" Not all options are meant to be iron-fisted until they're ITM by exp.",
        "created_utc": 1584459297,
        "id": "fkr09sb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584488097.0
    },
    {
        "author": "ams93482",
        "body": "I think the issue is not doing any research before presenting a question. If, for example, you attempt an elementary level of stock analysis and summarize your thought process, while asking for feedback, that would be more appropriate. Simply stating \"should I buy X, I have Y money\" is somewhat lazy. Also, presenting questions in this fashion does not foster discussion in any meaningful way. \n\nTo answer your question:\n\n1. Microsoft, Apple, Google, Facebook, Amazon (Established Tech)\n2. Ecolab, Honeywell, 3M, Corning, Cisco (Blue chip)\n3. ETFs (i.e., VOO or VTI) \n\nStart here. See if you agree after researching. Additionally, I would wait to invest in Airlines/Travel due to the potential for bankruptcy.",
        "created_utc": 1584470328,
        "id": "fkrjxo0",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1584499128.0
    },
    {
        "author": "skilliard7",
        "body": "Odd, I haven't had any problems with their hardware/software in the past. There are competitors but from what I've seen Cisco is still the leader in the market.",
        "created_utc": 1584372116,
        "id": "fknr1h7",
        "score": 1,
        "subreddit": "investing",
        "created": 1584400916.0
    },
    {
        "author": "catarahbpus",
        "body": "Ate up some T at 32, KO at 46, and CSCO at 33 is a new position. Also got a new position in NRZ, a REIT at $11. I had it and sold it at $17.5 before the downturn. Waiting to see PFE back at $30 or below. Those are my only  real buys since the markets been negative. Got new positions in Ally and TWTR that I'll be buying more of. And looking to get DAL around 35. But I have so many things on the list, trying to gauge when to buy into Nike, mid 60's may be a solid entry point.",
        "created_utc": 1584383352,
        "id": "fkoajvo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584412152.0
    },
    {
        "author": "chihuahua001",
        "body": "Come on CSCO pump! Everyone and there mother is using WebEx right now!",
        "created_utc": 1584452111,
        "id": "fkqoy0d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584480911.0
    },
    {
        "author": "FargotRobMe",
        "body": "`$CSCO` 2021 calls were looking good, but Cramer is interested so I guess PUTS IT IS!",
        "created_utc": 1584451394,
        "id": "fkqnxtg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584480194.0
    },
    {
        "author": "MT-6-55-3",
        "body": "I work in tech. Fucking Cisco is the devil.\n\nI love the $400 bottles of wine that go down like your wife, but the reviews from my boss are worse than my wife's boyfriend.\n\nFucker can't give a good reach!",
        "created_utc": 1584325399,
        "id": "fkmc09v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584354199.0
    },
    {
        "author": "CornbreadMonsta",
        "body": "That's true, I think Cisco and Citrix are gonna be the play.",
        "created_utc": 1584535810,
        "id": "fktvj11",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584564610.0
    },
    {
        "author": "FargotRobMe",
        "body": "`$CSCO`, `$PYPL` and `$F`",
        "created_utc": 1584542155,
        "id": "fku4n3f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584570955.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM, which looks to have already found its bottom in all of this at around 95-97 is my personal fav. Also taking a shine to Discover, Olin, Cisco, SOXL.\n\nAny of the sexier SaaS are trading at huge discounts.. I got Splunk puts.. but damn right I’d be gobbling it up at 90. Shit all around that’s looking mighty good, Boeing just isn’t it.",
        "created_utc": 1584516881,
        "id": "fktf0kt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584545681.0
    },
    {
        "author": "Bendertheoffender69",
        "body": "Callls on Cisco etc",
        "created_utc": 1584288285,
        "id": "fkko0dt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584317085.0
    },
    {
        "author": "humm1010",
        "body": "Csco",
        "created_utc": 1583205146,
        "id": "fjbzvg2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583233946.0
    },
    {
        "author": "Istinto",
        "body": "I bought csco on friday",
        "created_utc": 1583130559,
        "id": "fj93bmm",
        "score": 1,
        "subreddit": "investing",
        "created": 1583159359.0
    },
    {
        "author": "focusedddd",
        "body": "A Robinhood spokesperson said the outage was caused by \"infrastructure that allows our systems to communicate with each other.\" \n\nSo your telling me your down again because you can't configure a Cisco ASA or a fucking managed switch is that a joke. \n\nJ.k. they are prob using Linksys routers from BestBuy",
        "created_utc": 1583249811,
        "id": "fjdbdoj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583278611.0
    },
    {
        "author": "dinodan420",
        "body": "Definitely diversely with blue chips too, those holding companies could theoretically blow up so there is a lot of risk. You can’t go into it thinking you’ll get a 10% dividend of your intial investment every year. I’m liking CSCO right now",
        "created_utc": 1583111987,
        "id": "fj8f6mb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583140787.0
    },
    {
        "author": "espresso_inflective",
        "body": "&gt;I'm sorry, but people stuck at home won't be buying fewer Apple products to entertain themselves with, even if there is a delay in receiving the product from Apple, and Cisco won't stop building the internet that more people will use when they quarantined at home, and people won't go on Twitter less when they stuck at home, or buy less bandaids from JNJ, or stop buying laundry detergent from PG.\n\nAll of these are examples of demand shock, which I think most people agree is not the issue here. The issue is a supply shock: Apple is going to produce less, Cisco is going to have trouble obtaining their parts, Twitter's advertisers are going to experience similar shocks and buy fewer advertisements, and PG is going to have trouble sourcing the inputs for its laundry detergent.",
        "created_utc": 1583171711,
        "id": "fjae9sz",
        "score": 1,
        "subreddit": "investing",
        "created": 1583200511.0
    },
    {
        "author": "thatasian26",
        "body": "I finally got Fidelity to let me trade options with my ROTH IRA. I've had 4k locked up in Vanguard cuz they wouldn't let me do shit with it.\n\nNow I can go full retard",
        "created_utc": 1583098177,
        "id": "fj7tupg",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1583126977.0
    },
    {
        "author": "HomelessOnWallStreet",
        "body": "Fidelity",
        "created_utc": 1583170334,
        "id": "fjabv91",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1583199134.0
    },
    {
        "author": "Tuscan_Leather_",
        "body": "Based upon the activity going around the RH/Options/WSB/Stocks subs I highly doubt RH is going to execute any of those trades for you. \n\nI think they are going to get SLAMMED with orders and crap out. It happened almost every morning last week. \n\nAnd this wasn’t just RH. Fidelity was sluggish every morning last week with canceled orders as well.",
        "created_utc": 1583091123,
        "id": "fj7g0g9",
        "score": 5,
        "subreddit": "RobinHood",
        "created": 1583119923.0
    },
    {
        "author": "loli333",
        "body": "wasn't fidelity not showing account balances a week ago",
        "created_utc": 1583169666,
        "id": "fjaaj5p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583198466.0
    },
    {
        "author": "motomike1",
        "body": "Fidelity “streamlined” their app due to unusual market activity aka shut off world market data. \n\nBuy puts",
        "created_utc": 1583112992,
        "id": "fj8gpd5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583141792.0
    },
    {
        "author": "Neo1331",
        "body": "I have fidelity and RH, I use RH for my daily quick, play money as logging into the app is super easy and executing trades is relatively easy. Any long term stuff I do through Fidelity.",
        "created_utc": 1583090718,
        "id": "fj7ex4k",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1583119518.0
    },
    {
        "author": "HinduHamma",
        "body": "Glad to have multiple platforms lmao. \n\nAlly savings account . Easily transferred a grand to my ally invest. Free option trades but gotta pay 50 cents per contract. Whatevs. At least it fucking works lol. \n\nFidelity for my HSA gambling needs. Pretty reliable.",
        "created_utc": 1583170940,
        "id": "fjacxlh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583199740.0
    },
    {
        "author": "bozoconnors",
        "body": "New-ish myself.  If by \"brands\" you mean brokers...  quite happy with Fidelity myself.  Great website.  Great app.  $0 trades.  Active Trader Pro desktop client is capable of more info than I'll *ever* use &amp; allows near instant trading.  I hear Schwab is also great.",
        "created_utc": 1583168603,
        "id": "fja8m8e",
        "score": 2,
        "subreddit": "investing",
        "created": 1583197403.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Fidelity app is sleek and pretty. Same with Merrill edge",
        "created_utc": 1583092096,
        "id": "fj7id4m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583120896.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Fidelity or Merrill Lynch",
        "created_utc": 1583098276,
        "id": "fj7u0hu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583127076.0
    },
    {
        "author": "Eman270",
        "body": "Fidelity and a few others are also down",
        "created_utc": 1583168176,
        "id": "fja7vac",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1583196976.0
    },
    {
        "author": "JezusBakersfield",
        "body": "I haven't used TD but re: RH, Fidelity is also same thing with better pre trade/after market hours + partial shares and instant deposit. No bullshit limits, no fees. Only you need good credit for margin or options and a decent history.\n\nAlso trades themselves execute MUCH better. I feel like I've been ripped off on everything I do on RH and there's this annoying delay half the time for confirmations. The only thing you can't do on Fidelity that you can on RH is crypto -- and in that case, RH rounds up 1% or down 3% unless you do limit order and YMMV w trades. Just about done w RH today...",
        "created_utc": 1583171277,
        "id": "fjadied",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1583200077.0
    },
    {
        "author": "instagunny",
        "body": "*Apocryphal* Fidelity study, although the lesson is true enough.  \n\nhttps://mobile.twitter.com/jposhaughnessy/status/1155171083663925248  \n&gt; When I went looking for it, I found nothing. Pure Urban Legend.  \n\nhttps://www.nytimes.com/2016/08/06/your-money/401k-retirement-plan-investment-stock-markets.html\n&gt; Fidelity, which has received inquiries about the study ever since, without knowing why, told me this week that it had never produced such a study.",
        "created_utc": 1583101249,
        "id": "fj7yr5h",
        "score": 2,
        "subreddit": "stocks",
        "created": 1583130049.0
    },
    {
        "author": "BillNye69",
        "body": "I have $75k I’d like to put into a brokerage account, Fidelity or Vanguard. My question is, which is the better plan:\n\n1. Depositing all $75k into Fidelity but straight into a money market fund, and then DCAing (say 2k) from the money market fund each week into Fidelity S&amp;P500, in order to ask Fidelity for a signup bonus since I deposited all 75k at once into the brokerage account. (Not sure how much Fidelity would offer me—anyone know?). \n\n2. Just setting up DCA (same 2k) per week from my savings account into Fidelity S&amp;P500.",
        "created_utc": 1583109821,
        "id": "fj8byeu",
        "score": 2,
        "subreddit": "investing",
        "created": 1583138621.0
    },
    {
        "author": "Busch_Diesel",
        "body": "I use Fidelity for my retirement accounts.  The UI is absolutely shit compared to Robinhood and I hate it.  Idk if the other apps are better, but I think Robinhood absolutely nailed it in the UI department.",
        "created_utc": 1583170210,
        "id": "fjabm8z",
        "score": 2,
        "subreddit": "investing",
        "created": 1583199010.0
    },
    {
        "author": "vannatter77",
        "body": "Was just able to buy some on Fidelity",
        "created_utc": 1583164530,
        "id": "fja1q2r",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1583193330.0
    },
    {
        "author": "ControlPlusZ",
        "body": "In my 401k\n \nFidelity insures up to 1.25 million in cash. \n\nAbove that put it in money market funds or treasuries.",
        "created_utc": 1583070455,
        "id": "fj6fp32",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583099255.0
    },
    {
        "author": "Osmosis_Bones13",
        "body": "RH has the best UI unfortunately. I still do all my pharma options trading on RH, then my share account is with fidelity.",
        "created_utc": 1583081935,
        "id": "fj6wzdj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583110735.0
    },
    {
        "author": "oklastfuckingtime",
        "body": "u/dawgsjw u/Dontcaredaily\n\nI use fidelity. I have active trader Pro which would be similar to think or swim just on the fidelity platform. So when you make an account, you have to call them and ask for extended hours trading. It's really as easy as calling. You may have to have a minimum amount of money in the account but I honestly don't remember.\n\nMy understanding regarding the EH swings is large institutions/big buyers can cause price fluctuations based on the number of shares they buy/sell. Very few shares are traded in extended hours which is why you will see a huge price swing.\n\nThe earliest I can trade is 7am central time and as late as 7pm central time I think. I don't do after market trading so I'm not so sure on the back end",
        "created_utc": 1583154983,
        "id": "fj9o02y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583183783.0
    },
    {
        "author": "__NapoleonBlownapart",
        "body": "Why do you like that instead of the vanguard or fidelity funds?",
        "created_utc": 1583083761,
        "id": "fj707yl",
        "score": 1,
        "subreddit": "investing",
        "created": 1583112561.0
    },
    {
        "author": "TheWholeButt",
        "body": "For whatever reason I don't want Fidelity to know I'm actually retarded so I just do your normal theta gang shit with my Roth",
        "created_utc": 1583098524,
        "id": "fj7ueuq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583127324.0
    },
    {
        "author": "thatasian26",
        "body": "Well I only started trading about a week and a half ago. Vanguard took 5 days to say no so I swapped to Fidelity and transferred about half of it, just waiting on the other half now.",
        "created_utc": 1583099540,
        "id": "fj7w28b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583128340.0
    },
    {
        "author": "kboogie82",
        "body": "Both have fractional shares. Fidelity has Roth IRAs. The difference between brokerages is usually punitive. Some times more advanced tools.",
        "created_utc": 1583087730,
        "id": "fj77xb8",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583116530.0
    },
    {
        "author": "j33tAy",
        "body": "Eyyy, that Fidelity price improvement\n\nGood luck, 275s are ballsy\n\nI'm riding 285s until they go ITM or go to $0 in premium",
        "created_utc": 1583103288,
        "id": "fj81x2m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583132088.0
    },
    {
        "author": "uptheneck",
        "body": "fidelity is down",
        "created_utc": 1583159654,
        "id": "fj9u4s3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583188454.0
    },
    {
        "author": "snendroid-ai",
        "body": "just opened an account at Fidelity and initiated asset transfer",
        "created_utc": 1583162152,
        "id": "fj9xvt6",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583190952.0
    },
    {
        "author": "Sir_Meowstro",
        "body": "I'm in Albany and none of us can access our brokerage accounts - RH, TD, Fidelity and ETrade are all not allowing logins but WeBull is up apparently.",
        "created_utc": 1583163690,
        "id": "fja0clo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583192490.0
    },
    {
        "author": "thetrooper424",
        "body": "How do they compare to Fidelity?",
        "created_utc": 1583161224,
        "id": "fj9wguv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583190024.0
    },
    {
        "author": "kapnklutch",
        "body": "Come over to Schwab, join the dark side.\n\nBut really you can’t go wrong with Schwab/Fidelity.",
        "created_utc": 1583161013,
        "id": "fj9w5f7",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583189813.0
    },
    {
        "author": "MagusUnion",
        "body": "Any of you wanks fuck with Fidelity for investments? I got a 401k with them that I'm doing fuck-all with so idk what else I can use with that company. How \"not poor\" do I have to be get an account with them to start losing money?",
        "created_utc": 1583162713,
        "id": "fj9yrit",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583191513.0
    },
    {
        "author": "Hedge_Fund_Guy",
        "body": "I've worked at a major brokerage firm before. The rules are murky, but if they want to keep customers they need to reimburse clients for all lost profits. There is nothing differentiating Robinhood from Fidelity or Schwab now, as everyone offers/will be offering free trades + fractional shares.",
        "created_utc": 1583161364,
        "id": "fj9woj4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583190164.0
    },
    {
        "author": "peterizzy",
        "body": "Anyone know if Fidelity is pretty easy to trade options with? Like interface wise?",
        "created_utc": 1583162093,
        "id": "fj9xske",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583190893.0
    },
    {
        "author": "Account-Manager",
        "body": "E-Trade, Fidelity, and TD are all down. Not just RH.",
        "created_utc": 1583162899,
        "id": "fj9z28h",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583191699.0
    },
    {
        "author": "Seated_Heats",
        "body": "Fidelity has even been a little odd this morning.  Not nearly to the extent of RH, but it was slow and there's even a message when you first login about higher server demand.",
        "created_utc": 1583162899,
        "id": "fj9z28k",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1583191699.0
    },
    {
        "author": "37478923934432453745",
        "body": "I just had to sign up because of a company stock program. I'm interested in how it is. I've only used fidelity and Scottrade in the past",
        "created_utc": 1583162470,
        "id": "fj9ydoe",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583191270.0
    },
    {
        "author": "brickwall-ball",
        "body": "My wife’s boyfriend has a fidelity account... might see if I can somehow get permission to use a phone and access my stocks on there",
        "created_utc": 1583160995,
        "id": "fj9w4gk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583189795.0
    },
    {
        "author": "someroastedbeef",
        "body": "fidelity because you can lose 90k on an options trade and they'll send a personalized letter to you through mail asking if you're alright",
        "created_utc": 1583164632,
        "id": "fja1w7t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583193432.0
    },
    {
        "author": "VValrus54",
        "body": "ToS. TastyTrade. Fidelity.",
        "created_utc": 1583164120,
        "id": "fja11w6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583192920.0
    },
    {
        "author": "alphaman03",
        "body": "Everyone here needs to leave Robinhood. I'm going to TD or Fidelity. This app is trash.",
        "created_utc": 1583163898,
        "id": "fja0op8",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583192698.0
    },
    {
        "author": "su-dad",
        "body": "And e\\*trade and fidelity",
        "created_utc": 1583164272,
        "id": "fja1avb",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1583193072.0
    },
    {
        "author": "Heckteck",
        "body": "I'm guessing one of them is fidelity since I've seen a couple post saying they're not working either",
        "created_utc": 1583165581,
        "id": "fja3gc6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583194381.0
    },
    {
        "author": "erichardson1178",
        "body": "looks like most sites are down right now. There are reports of TD, Fidelity, and etrade experiencing the same issue.",
        "created_utc": 1583165290,
        "id": "fja2z6x",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1583194090.0
    },
    {
        "author": "hunter360",
        "body": "Every platform is commission free now. Use any major platform. Use the biggest companies. Schwab, Merrill Edge, etrade, interactive brokers, Fidelity. Absolutely no reason to use Robin Hood anymore.",
        "created_utc": 1583164208,
        "id": "fja172s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583193008.0
    },
    {
        "author": "Osmosis_Bones13",
        "body": "All brokers having issues. E trade down, fidelity won’t let me log in",
        "created_utc": 1583166997,
        "id": "fja5tzt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583195797.0
    },
    {
        "author": "xLitecoin",
        "body": "I lost 2,000 in profits already this morning because I couldn’t sell and who knows how much more it will be, I couldn’t sell my puts let alone any trade this morning. Who is going to reimburse me? I already filed a complaint with the sec, something needs to be done. No other brokerage goes through problems like this every time their is a high trading volume. Absolutely incapable of doing their job but by golly the new referral program and fractional shares are more important ??? Who wants that shit when the main trading platform can’t even function correctly. Then you call customer service and they tell you to send an email to support that is not working as well. This is a full circle jerk and I’m done with this shit. TD, Fidelity, Charles Schwab, who knows but anything is better then this neck beard infested wannabe trading site.",
        "created_utc": 1583167336,
        "id": "fja6ewf",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583196136.0
    },
    {
        "author": "Seated_Heats",
        "body": "Fidelity is slow, but functional.",
        "created_utc": 1583168322,
        "id": "fja84in",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1583197122.0
    },
    {
        "author": "wuwubunny",
        "body": "It's not that hard to understand. While Robinhood is ASS with stuff like this, they figured out that people want a nice and simple interface, something all of these other investment companies still can't figure out. One of them should figure it out already and implement it so we can get rid of robinhood all together. Ive never seen worse apps than the ones Vanguard, Fidelity and Schwab use.",
        "created_utc": 1583169325,
        "id": "fja9v2s",
        "score": 1,
        "subreddit": "investing",
        "created": 1583198125.0
    },
    {
        "author": "ElegantEntropy",
        "body": "One doesn't work, has terrible execution, no support of any sort, will literally rob you of the money. \n\n&amp;#x200B;\n\nThe other one if Fidelity.",
        "created_utc": 1583168969,
        "id": "fja9952",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583197769.0
    },
    {
        "author": "B302LS",
        "body": "Looking at Webull and Fidelity right now, doesn't seem like either will cover the fee.",
        "created_utc": 1583171466,
        "id": "fjadue6",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583200266.0
    },
    {
        "author": "Neo1331",
        "body": "Not this bad, Fidelity isn’t even sluggish for me.",
        "created_utc": 1583170378,
        "id": "fjabyf6",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1583199178.0
    },
    {
        "author": "shia84",
        "body": "Tried to sell my calls to lock in some profit and buy some puts.  Now both orders are pending in RH. Anyone know what happens to these orders?  \n\n\nWas able to instantly buy on fidelity.",
        "created_utc": 1583170448,
        "id": "fjac2yc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583199248.0
    },
    {
        "author": "TheOriginalRK",
        "body": "Time to switch to shitty interface Fidelity",
        "created_utc": 1583160361,
        "id": "fj9v6am",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583189161.0
    },
    {
        "author": "Neo1331",
        "body": "I already use fidelity, I just use RH cause its easy to execute trades on my phone....well it was...",
        "created_utc": 1583160399,
        "id": "fj9v8bi",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1583189199.0
    },
    {
        "author": "wbted23",
        "body": "Fidelity is also fucked",
        "created_utc": 1583160404,
        "id": "fj9v8m1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583189204.0
    },
    {
        "author": "p0intbreak",
        "body": "Fidelity is so ugly to shit ui",
        "created_utc": 1583160784,
        "id": "fj9vt3c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583189584.0
    },
    {
        "author": "MartianManhunter0987",
        "body": "Fidelity is a well established player with a very large number of features. Robinhood is a relatively new entrant with very limited features. \n\nIf you ask me you should open accounts with both as both of them are free. \n\n\\- Use fidelity to open IRA accounts (IRA Roth as well) \n\n\\- Fidelity now lets you trade in fractional shares\n\n\\- Use Robinhood for your day to day trading and to learn about trading. \n\n&amp;#x200B;\n\nRobinhood has significantly better app interface.",
        "created_utc": 1583129460,
        "id": "fj929po",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583158260.0
    },
    {
        "author": "WhiskeyWoodAndWisdom",
        "body": "Fidelity reduced trading fees and getting into options is making it hard to hold cash, but I'm pretty new to active trading. Trying to be smart because the good times are going to slow down soon. It sure is fun though.",
        "created_utc": 1583130854,
        "id": "fj93lhh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583159654.0
    },
    {
        "author": "Jwceltic5",
        "body": "You don’t have too much flexibility with only $100-$200 because you’re limited by share price. I would go with Schwab or Fidelity and buy into their no minimum, broad market mutual funds. That way you can maximize your contributions every month.",
        "created_utc": 1583120182,
        "id": "fj8r9z9",
        "score": 1,
        "subreddit": "investing",
        "created": 1583148982.0
    },
    {
        "author": "kboogie82",
        "body": "Fidelity has fractional shares, Robinhood will have soon as well. You can start with as little as a buck.",
        "created_utc": 1583119857,
        "id": "fj8qt53",
        "score": 1,
        "subreddit": "investing",
        "created": 1583148657.0
    },
    {
        "author": "datdur73",
        "body": "I don't use my Fidelity for options because I don't understand the definitions. TF is a leg? Diagonals? I just use RH for options to dumb it down.",
        "created_utc": 1583078895,
        "id": "fj6s077",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583107695.0
    },
    {
        "author": "TAWS",
        "body": "Fidelity doesn't charge for OTC trades",
        "created_utc": 1583080936,
        "id": "fj6vajo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583109736.0
    },
    {
        "author": "macmus1",
        "body": "so why people don't use fidelity ? :D",
        "created_utc": 1583082953,
        "id": "fj6ys4a",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583111753.0
    },
    {
        "author": "ishitaki",
        "body": "Fidelity won’t crap out during high volatility.  RH is notorious for that.\n\n\nAny real broker is better",
        "created_utc": 1583082802,
        "id": "fj6yihu",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583111602.0
    },
    {
        "author": "gypsyphotos",
        "body": "If you’re with Fidelity they give a good 10yr history break down.",
        "created_utc": 1583060295,
        "id": "fj679l5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583089095.0
    },
    {
        "author": "davidwolf84",
        "body": "Do you use trade armor or active trader pro through Fidelity?",
        "created_utc": 1583111433,
        "id": "fj8econ",
        "score": 1,
        "subreddit": "investing",
        "created": 1583140233.0
    },
    {
        "author": "HeavyweightDoxxer",
        "body": "Probably fidelity since they have my 401k",
        "created_utc": 1583120855,
        "id": "fj8s7uv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583149655.0
    },
    {
        "author": "LifterPuller",
        "body": "This is it for me, finally moving everything to my fidelity account I should have done this months ago.",
        "created_utc": 1583159847,
        "id": "fj9ueo0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583188647.0
    },
    {
        "author": "FolayMingYoung",
        "body": "For real man. I thought my WiFi wasn’t working or something switch over the 4g and still not working. Got on my laptop still not working. Fuck this shit. Fidelity or Charles Schwab ? I’m switching over today",
        "created_utc": 1583160311,
        "id": "fj9v3n1",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583189111.0
    },
    {
        "author": "bxgoods",
        "body": "I have fidelity, I like it",
        "created_utc": 1583160862,
        "id": "fj9vxas",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583189662.0
    },
    {
        "author": "Heydanu",
        "body": "Fidelity drives me nuts. Keeps asking me to call in when trades are high risk. I gave up.",
        "created_utc": 1583160857,
        "id": "fj9vx1m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583189657.0
    },
    {
        "author": "BucDan",
        "body": "Td. So you can use thinkorswim. Fidelity is an antique.",
        "created_utc": 1583160850,
        "id": "fj9vwo4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583189650.0
    },
    {
        "author": "rebelmusab",
        "body": "Switch over to Fidelity that’s what I’m about to do",
        "created_utc": 1583160249,
        "id": "fj9v0e0",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583189049.0
    },
    {
        "author": "Rectalcactus",
        "body": "You fucked me for the last time robinhood. Im a Fidelity man now.",
        "created_utc": 1583160096,
        "id": "fj9ury9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583188896.0
    },
    {
        "author": "KlutzyKeynesian",
        "body": "Time to move to fidelity. Even USAA is more responsive than this.",
        "created_utc": 1583160833,
        "id": "fj9vvqx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583189633.0
    },
    {
        "author": "Almost_a_Noob",
        "body": "Is TOS or Fidelity better for options on mobile? \nI like the RH interface but obviously it is a shit broker.",
        "created_utc": 1583161391,
        "id": "fj9wq0f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583190191.0
    },
    {
        "author": "wbted23",
        "body": "No other ones are fully down, but Fidelity and TD have been having issues",
        "created_utc": 1583163672,
        "id": "fja0bjf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583192472.0
    },
    {
        "author": "Mnmsaregood",
        "body": "So TD, fidelity or something else?",
        "created_utc": 1583163079,
        "id": "fj9zcs7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583191879.0
    },
    {
        "author": "Fidug",
        "body": "Last week Schwab, TD, and Fidelity also had issues.  Pick your poison.  At some point, technology breaks.  I am not a day trader, but if I was, RH is not where I would be.  There are much better, more stable, and faster responding places out there.",
        "created_utc": 1583163371,
        "id": "fj9ztt0",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583192171.0
    },
    {
        "author": "PM_ME_UR_INVESTMENTS",
        "body": "Decent chunk of change?  IB.   \nBroke? fidelity",
        "created_utc": 1583163451,
        "id": "fj9zyfq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583192251.0
    },
    {
        "author": "creativityisafarce",
        "body": "Ya tried using Fidelity mobile to trade and it is legit 100x worse of an interface than Robinhood. I literally just can’t even. Someone needs to do a UI comparison video to showcase how different the experience is. I just don’t have the time to compare them all myself.",
        "created_utc": 1583162842,
        "id": "fj9yyz1",
        "score": 1,
        "subreddit": "options",
        "created": 1583191642.0
    },
    {
        "author": "Neo1331",
        "body": "All of them now, Fidelity is my main one. They went commission free back in October",
        "created_utc": 1583163679,
        "id": "fja0bxc",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1583192479.0
    },
    {
        "author": "Mnmsaregood",
        "body": "Fidelity doesn’t look too bad right now",
        "created_utc": 1583161276,
        "id": "fj9wjoh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583190076.0
    },
    {
        "author": "PlutoIsAPlanet13579",
        "body": "Just got fucked out of 100% gains on some options contracts... Fml\n\nI would go to Fidelity but they didn't approve me for options trading",
        "created_utc": 1583161896,
        "id": "fj9xhn1",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583190696.0
    },
    {
        "author": "80slaserbackground",
        "body": "Tried logging into my fidelity accounts (I dont trade options on those) and got a streamlined version of the app due to high market activity. lmao. everything is rigged",
        "created_utc": 1583161262,
        "id": "fj9wixs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583190062.0
    },
    {
        "author": "CyberJyggalag",
        "body": "Apparently fidelity is down too. My buddy just told me.",
        "created_utc": 1583163647,
        "id": "fja0a0s",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1583192447.0
    },
    {
        "author": "headbangershappyhour",
        "body": "Fidelity is set up more to trade and research on desktop than mobile. Mobile seems best suited to monitoring your current positions.",
        "created_utc": 1583162395,
        "id": "fj9y9cy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583191195.0
    },
    {
        "author": "tittiesandtendies",
        "body": "Fidelity",
        "created_utc": 1583164298,
        "id": "fja1cbo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583193098.0
    },
    {
        "author": "lolfunctionspace",
        "body": "Really sucks if that's the case. I've got 3k in there on SPY puts to hedge losses in my fidelity account. I was up big, since I got in early Feb with cheap puts.",
        "created_utc": 1583165601,
        "id": "fja3hk2",
        "score": 1,
        "subreddit": "investing",
        "created": 1583194401.0
    },
    {
        "author": "apex_17",
        "body": "Fidelity, e trade, RH all down....can I put on my tin foil hat now?",
        "created_utc": 1583163749,
        "id": "fja0g0y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583192549.0
    },
    {
        "author": "shortingelonmusk",
        "body": "Fidelity is a nightmare with options approval.   I've heard nothing but denials from people recently and I'm not talking about small accounts.   \n\nAdditionally if you take big losses they will pull your approval so I'd recommend anyone but Fidelity.",
        "created_utc": 1583165112,
        "id": "fja2oqk",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583193912.0
    },
    {
        "author": "ddpacker",
        "body": "Lol, is Fidelity and e-trade also down?",
        "created_utc": 1583164027,
        "id": "fja0w9r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583192827.0
    },
    {
        "author": "ludashi41",
        "body": "What are the fees like for fidelity",
        "created_utc": 1583164173,
        "id": "fja150n",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583192973.0
    },
    {
        "author": "anonymous_pennys",
        "body": "Any thoughts on ETrade vs Fidelity?",
        "created_utc": 1583164203,
        "id": "fja16th",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583193003.0
    },
    {
        "author": "Cruian",
        "body": "Limit orders with dollar orders definitely work. I don't do market orders, even with fractional shares at Fidelity.",
        "created_utc": 1583166734,
        "id": "fja5dum",
        "score": 1,
        "subreddit": "investing",
        "created": 1583195534.0
    },
    {
        "author": "ezim22",
        "body": "&gt;All brokers having issues. E trade down, fidelity won’t let me log in\n\n5% margin. I also had TOS but their margin is exorbitant",
        "created_utc": 1583167324,
        "id": "fja6e7e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583196124.0
    },
    {
        "author": "JezusBakersfield",
        "body": "No, all brokers are NOT. Chase and Fidelity working 100% fine for me rn. Doing very active trading today to buy up/sell and nothing on this pos RH working.",
        "created_utc": 1583171072,
        "id": "fjad5qk",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583199872.0
    },
    {
        "author": "pausiroy",
        "body": "Do we have a guide for first time buyers? Like best funds to get if I should get Fidelity or Vanguard.",
        "created_utc": 1583171640,
        "id": "fjae5cc",
        "score": 1,
        "subreddit": "investing",
        "created": 1583200440.0
    },
    {
        "author": "macmus1",
        "body": "fidelity, us, steady growth , 3 funds portfolio ?",
        "created_utc": 1583126061,
        "id": "fj8yphc",
        "score": 1,
        "subreddit": "investing",
        "created": 1583154861.0
    },
    {
        "author": "barobb99",
        "body": "I have my account through fidelity.",
        "created_utc": 1583072718,
        "id": "fj6iehn",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1583101518.0
    },
    {
        "author": "readuponthat24",
        "body": "I use Fidelity. Thanks to RH it is now free for me to trade.",
        "created_utc": 1583097372,
        "id": "fj7sk6i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583126172.0
    },
    {
        "author": "thatasian26",
        "body": "I finally got Fidelity to let me trade options with my ROTH IRA. I've had 4k locked up in Vanguard cuz they wouldn't let me do shit with it.\n\nNow I can go full retard",
        "created_utc": 1583098177,
        "id": "fj7tupg",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1583126977.0
    },
    {
        "author": "Tuscan_Leather_",
        "body": "Based upon the activity going around the RH/Options/WSB/Stocks subs I highly doubt RH is going to execute any of those trades for you. \n\nI think they are going to get SLAMMED with orders and crap out. It happened almost every morning last week. \n\nAnd this wasn’t just RH. Fidelity was sluggish every morning last week with canceled orders as well.",
        "created_utc": 1583091123,
        "id": "fj7g0g9",
        "score": 5,
        "subreddit": "RobinHood",
        "created": 1583119923.0
    },
    {
        "author": "motomike1",
        "body": "Fidelity “streamlined” their app due to unusual market activity aka shut off world market data. \n\nBuy puts",
        "created_utc": 1583112992,
        "id": "fj8gpd5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583141792.0
    },
    {
        "author": "Neo1331",
        "body": "I have fidelity and RH, I use RH for my daily quick, play money as logging into the app is super easy and executing trades is relatively easy. Any long term stuff I do through Fidelity.",
        "created_utc": 1583090718,
        "id": "fj7ex4k",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1583119518.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Fidelity app is sleek and pretty. Same with Merrill edge",
        "created_utc": 1583092096,
        "id": "fj7id4m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583120896.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Fidelity or Merrill Lynch",
        "created_utc": 1583098276,
        "id": "fj7u0hu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583127076.0
    },
    {
        "author": "instagunny",
        "body": "*Apocryphal* Fidelity study, although the lesson is true enough.  \n\nhttps://mobile.twitter.com/jposhaughnessy/status/1155171083663925248  \n&gt; When I went looking for it, I found nothing. Pure Urban Legend.  \n\nhttps://www.nytimes.com/2016/08/06/your-money/401k-retirement-plan-investment-stock-markets.html\n&gt; Fidelity, which has received inquiries about the study ever since, without knowing why, told me this week that it had never produced such a study.",
        "created_utc": 1583101249,
        "id": "fj7yr5h",
        "score": 2,
        "subreddit": "stocks",
        "created": 1583130049.0
    },
    {
        "author": "BillNye69",
        "body": "I have $75k I’d like to put into a brokerage account, Fidelity or Vanguard. My question is, which is the better plan:\n\n1. Depositing all $75k into Fidelity but straight into a money market fund, and then DCAing (say 2k) from the money market fund each week into Fidelity S&amp;P500, in order to ask Fidelity for a signup bonus since I deposited all 75k at once into the brokerage account. (Not sure how much Fidelity would offer me—anyone know?). \n\n2. Just setting up DCA (same 2k) per week from my savings account into Fidelity S&amp;P500.",
        "created_utc": 1583109821,
        "id": "fj8byeu",
        "score": 2,
        "subreddit": "investing",
        "created": 1583138621.0
    },
    {
        "author": "ControlPlusZ",
        "body": "In my 401k\n \nFidelity insures up to 1.25 million in cash. \n\nAbove that put it in money market funds or treasuries.",
        "created_utc": 1583070455,
        "id": "fj6fp32",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583099255.0
    },
    {
        "author": "Osmosis_Bones13",
        "body": "RH has the best UI unfortunately. I still do all my pharma options trading on RH, then my share account is with fidelity.",
        "created_utc": 1583081935,
        "id": "fj6wzdj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583110735.0
    },
    {
        "author": "__NapoleonBlownapart",
        "body": "Why do you like that instead of the vanguard or fidelity funds?",
        "created_utc": 1583083761,
        "id": "fj707yl",
        "score": 1,
        "subreddit": "investing",
        "created": 1583112561.0
    },
    {
        "author": "TheWholeButt",
        "body": "For whatever reason I don't want Fidelity to know I'm actually retarded so I just do your normal theta gang shit with my Roth",
        "created_utc": 1583098524,
        "id": "fj7ueuq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583127324.0
    },
    {
        "author": "thatasian26",
        "body": "Well I only started trading about a week and a half ago. Vanguard took 5 days to say no so I swapped to Fidelity and transferred about half of it, just waiting on the other half now.",
        "created_utc": 1583099540,
        "id": "fj7w28b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583128340.0
    },
    {
        "author": "kboogie82",
        "body": "Both have fractional shares. Fidelity has Roth IRAs. The difference between brokerages is usually punitive. Some times more advanced tools.",
        "created_utc": 1583087730,
        "id": "fj77xb8",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583116530.0
    },
    {
        "author": "j33tAy",
        "body": "Eyyy, that Fidelity price improvement\n\nGood luck, 275s are ballsy\n\nI'm riding 285s until they go ITM or go to $0 in premium",
        "created_utc": 1583103288,
        "id": "fj81x2m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583132088.0
    },
    {
        "author": "datdur73",
        "body": "I don't use my Fidelity for options because I don't understand the definitions. TF is a leg? Diagonals? I just use RH for options to dumb it down.",
        "created_utc": 1583078895,
        "id": "fj6s077",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583107695.0
    },
    {
        "author": "TAWS",
        "body": "Fidelity doesn't charge for OTC trades",
        "created_utc": 1583080936,
        "id": "fj6vajo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583109736.0
    },
    {
        "author": "macmus1",
        "body": "so why people don't use fidelity ? :D",
        "created_utc": 1583082953,
        "id": "fj6ys4a",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583111753.0
    },
    {
        "author": "ishitaki",
        "body": "Fidelity won’t crap out during high volatility.  RH is notorious for that.\n\n\nAny real broker is better",
        "created_utc": 1583082802,
        "id": "fj6yihu",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583111602.0
    },
    {
        "author": "gypsyphotos",
        "body": "If you’re with Fidelity they give a good 10yr history break down.",
        "created_utc": 1583060295,
        "id": "fj679l5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583089095.0
    },
    {
        "author": "davidwolf84",
        "body": "Do you use trade armor or active trader pro through Fidelity?",
        "created_utc": 1583111433,
        "id": "fj8econ",
        "score": 1,
        "subreddit": "investing",
        "created": 1583140233.0
    },
    {
        "author": "barobb99",
        "body": "I have my account through fidelity.",
        "created_utc": 1583072718,
        "id": "fj6iehn",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1583101518.0
    },
    {
        "author": "readuponthat24",
        "body": "I use Fidelity. Thanks to RH it is now free for me to trade.",
        "created_utc": 1583097372,
        "id": "fj7sk6i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583126172.0
    },
    {
        "author": "gopoohgo",
        "body": "if last week was any indication, most brokerage websites will be shit at 9:30.  \n\nI was finally able to load option quotes on Fidelity around 1030 on Friday.",
        "created_utc": 1583072791,
        "id": "fj6ii58",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583101591.0
    },
    {
        "author": "PsychoBillhilly",
        "body": "Just an FYI fidelity app had some words that said something bout higher volume than expected. Some other blah blah blah. Not defending the dude. Was just checking.",
        "created_utc": 1583102123,
        "id": "fj803wo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583130923.0
    },
    {
        "author": "leochen1001",
        "body": "It is free now, but not for options. and I started using RH in like 2017, when fidelity isn't free then.",
        "created_utc": 1583109666,
        "id": "fj8bq3k",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583138466.0
    },
    {
        "author": "JonathanL73",
        "body": "Fidelity is commission free now and with fractional shares. So I also wonder why people here still use RH.",
        "created_utc": 1583113492,
        "id": "fj8hgdz",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583142292.0
    },
    {
        "author": "one2zerojigawat",
        "body": "[it's what plants crave. ](https://i.imgur.com/R5OuiqA_d.jpg?maxwidth=640&amp;shape=thumb&amp;fidelity=medium)",
        "created_utc": 1583080655,
        "id": "fj6uuem",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583109455.0
    },
    {
        "author": "DesperatePleasure",
        "body": "TDAmeritrade. Same fees as Fidelity (that I'm aware) and you get access to Think or Swim.\n\nRecently just made the move. I'm sick of RH as well, but keeping it for now only for options.",
        "created_utc": 1583081098,
        "id": "fj6vkl6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583109898.0
    },
    {
        "author": "ControlPlusZ",
        "body": "In my 401k\n \nFidelity insures up to 1.25 million in cash. \n\nAbove that put it in money market funds or treasuries.",
        "created_utc": 1583070455,
        "id": "fj6fp32",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583099255.0
    },
    {
        "author": "datdur73",
        "body": "I don't use my Fidelity for options because I don't understand the definitions. TF is a leg? Diagonals? I just use RH for options to dumb it down.",
        "created_utc": 1583078895,
        "id": "fj6s077",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583107695.0
    },
    {
        "author": "TAWS",
        "body": "Fidelity doesn't charge for OTC trades",
        "created_utc": 1583080936,
        "id": "fj6vajo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583109736.0
    },
    {
        "author": "gypsyphotos",
        "body": "If you’re with Fidelity they give a good 10yr history break down.",
        "created_utc": 1583060295,
        "id": "fj679l5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583089095.0
    },
    {
        "author": "barobb99",
        "body": "I have my account through fidelity.",
        "created_utc": 1583072718,
        "id": "fj6iehn",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1583101518.0
    },
    {
        "author": "gopoohgo",
        "body": "if last week was any indication, most brokerage websites will be shit at 9:30.  \n\nI was finally able to load option quotes on Fidelity around 1030 on Friday.",
        "created_utc": 1583072791,
        "id": "fj6ii58",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583101591.0
    },
    {
        "author": "one2zerojigawat",
        "body": "[it's what plants crave. ](https://i.imgur.com/R5OuiqA_d.jpg?maxwidth=640&amp;shape=thumb&amp;fidelity=medium)",
        "created_utc": 1583080655,
        "id": "fj6uuem",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583109455.0
    },
    {
        "author": "RameeSumrein",
        "body": "INTC puts gonna be super cheap because they're going up for no reason.",
        "created_utc": 1583068078,
        "id": "fj6dcl3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583096878.0
    },
    {
        "author": "Yato_k",
        "body": "I went the other way and bought INTC puts and a few Disney",
        "created_utc": 1583049944,
        "id": "fj5zvi4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583078744.0
    }
]