[
    {
        "author": "heyitsathrowawayokay",
        "body": "Correct. The main keys here are that they were (1) weekly options which expired at the end of the next trading day, and (2) they were more than 10% out of the money (OTM), so they were rather cheap to buy.",
        "created_utc": 1580665967,
        "id": "fgbtck1",
        "permalink": "/r/options/comments/ex8uzf/amzn_500_into_10k/fgbtck1/",
        "score": 1,
        "subreddit": "options",
        "created": 1580694767.0
    },
    {
        "author": "1st_Amendment_EndRun",
        "body": "I remember reading a roadmap presentation on their datacenter offerings where each VM had instruction level crypto keys (trusted execution environment) that were only available to the customer who provisioned the VM.\n\nOddly, I don't believe that ever made it into any of their products.\n\nSo... I don't think that AMD is any less dirty that Intel in that regard, but maybe by omission rather than active subversion of trust.",
        "created_utc": 1580730583,
        "id": "fgf9019",
        "permalink": "/r/investing/comments/exzxs8/why_is_intel_intl_so_cheap_right_now/fgf9019/",
        "score": 1,
        "subreddit": "investing",
        "created": 1580759383.0
    },
    {
        "author": "drop-o-matic",
        "body": "Fed PR released this morning that all \"sell” keys have been removed from Bloomberg keyboards going forward.",
        "created_utc": 1580741951,
        "id": "fgfliw0",
        "permalink": "/r/wallstreetbets/comments/ey5kjc/daily_discussion_thread_february_03_2020/fgfliw0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580770751.0
    },
    {
        "author": "Volkswagens1",
        "body": "I could be wrong here, but I think there is still a massive risk. What if the USA decides to ban crypto. Will robinhood allow you to withdraw your monies? I think this is why people are so adamant on “not your keys, not your coin”. They could also easily confiscate your funds on robinhood, saying it’s for illegal purposes and you’d have no way to fight back. If you have your funds on a ledger, you’d be far safer. \nYour funds will still increase in value on a Ledger, where they are much more secure.",
        "created_utc": 1580619700,
        "id": "fg8hkct",
        "permalink": "/r/RobinHood/comments/ds5hkc/robinhood_crypto_currencies/fg8hkct/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1580648500.0
    },
    {
        "author": "MSL0727",
        "body": "Very very bad company. I went from HP to Hewlett-Packard Enterprise to DXC Technology, and the whole time we were employed at DXC there was a feeling of death around with no morale and a very sad feeling around the fact that most were told they should just be happy they have a job. Although I literally sat and watched as person by person around me all inevitably got laid off. They'd come in on Thursday and be told the next day (Friday) would be their last day and they'd be lucky to get severance. I eventually left the company because of anything could be better, and I was looking to grow and not be held down. \n\nNo raises or bonuses for years, layoffs left and right, vile environment, etc. I wouldn't own it, but then again I don't track the stock price and I see it from a perspective that would never interest me in looking.",
        "created_utc": 1586103820,
        "id": "fmi77dw",
        "permalink": "/r/investing/comments/fvf4dm/dxc_technology/fmi77dw/",
        "score": 1,
        "subreddit": "investing",
        "created": 1586132620.0
    },
    {
        "author": "Bleached_Hole_Patrol",
        "body": "made $5 dollars day trading ENPH shares today",
        "created_utc": 1585854953,
        "id": "fm8s1ph",
        "permalink": "/r/wallstreetbets/comments/ftkgj6/daily_discussion_thread_april_02_2020/fm8s1ph/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1585883753.0
    },
    {
        "author": "Firmest_Midget",
        "body": "Look into renewable energy stocks. Business is still booming, and going only up for a long time. NEE, ENPH, and SEDG for example are all hugely depressed and ready to pop when things start to clear up.  \n\nSource: Work office job for renewable energy broker.  \n\nNEE $340c 1/21/21, ENPH $60c 1/21/21",
        "created_utc": 1585845234,
        "id": "fm89d9j",
        "permalink": "/r/wallstreetbets/comments/ftophj/oil_talks_going_well/fm89d9j/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1585874034.0
    },
    {
        "author": "sterlingyates",
        "body": "$ENPH but wait for it to drop more as well",
        "created_utc": 1585834580,
        "id": "fm7qkn3",
        "permalink": "/r/investing/comments/fti1ik/green_businesses_with_promising_futures/fm7qkn3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1585863380.0
    },
    {
        "author": "Good_Sportsman",
        "body": "If you really wanted to buy just stick to solid companies or etfs. GOOGL, AAPL, MSFT, FB, etc and etfs lik voo, spy, qqq or xlk(?)are going to do fine. \n\nAMZN, DG are solid bets to weather the storm but arent down a ton compared to others.\n\nAnything thats a necessity or provides bargains will be fine PG, KO, PEP, HD, WMT, etc\n\nMedical is probably okay tho I'd stick with solid companies not speculative unless you can tolarate risk but BMY, JNJ, ABBV, etc should be fine.\n\nDefense never goes away HON, LMT, RNT, etc\n\nCan play the \"game is rigged\" card and go with kinda scumbags JPM, BLK, etc\n\nUtilities AWK, AQN, D, SO, WEC etc just watch for what kind of exposure you want i.e. oil, coal, nat gas folk have different feels on em.\n\nRenewables its eventually the future but caution as the sector is getting fucked by cheap oil, the pandemic, and a loss of subsidies. A dem in the white house would prob be needed to get the subsidies back. But SEDG, NEE, VSLR, ENPH, etc are decent.\n\nThere's a bunch of other good buys for good reasons but this should be a good start for ya.\n\nAlso and it should be obvious, I am not a financial advisor nor should anything I say be taken as anything other than friendly scuttlebutt.\n\nTickers are from memory so hopefully I got em right.r\n\nEdit: typos",
        "created_utc": 1585776585,
        "id": "fm5o17w",
        "permalink": "/r/stocks/comments/ft7ovi/curious/fm5o17w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1585805385.0
    },
    {
        "author": "retard_wknd",
        "body": "You the man. Can only hit F5 so many times on this thread lollol.",
        "created_utc": 1585758192,
        "id": "fm4p1w6",
        "permalink": "/r/wallstreetbets/comments/frcuzr/order_66_the_revenge_of_the_bears/fm4p1w6/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1585786992.0
    }
]