[
    {
        "author": "coolgoulfool",
        "body": "I bought Intel puts last night 5 minutes to close on whim from a random comment here. Not a good strat at ALL but I knew about Intel's current issues and have been long on AMD for a bit. Woke up to see the my puts over 100%. Love it",
        "created_utc": 1595631898,
        "id": "fz54pts",
        "score": 1050,
        "subreddit": "wallstreetbets",
        "created": 1595660698.0
    },
    {
        "author": "comparmentaliser",
        "body": "Intel’s lead architect left a few weeks ago - supposedly to join AMD (which is where he was prior to Intel anyway).\n\nThere was a good post on wsb a few weeks back about it - obviously there’s a lot of speculation, but it’s plausible.\n\nAlso, AMD have been gaining on Intel in terms of performance, power and heat. That said, Intel is still a household name, and they have a very aggressive marketing and licensing strategy. For example, Lenovo’s flagship X line of laptops are Intel-only, but they’re supposedly just waiting for that agreement to expire before moving on to AMD (I’d kill for an ARM X1 though :)",
        "created_utc": 1595756422,
        "id": "fzadkrp",
        "score": 495,
        "subreddit": "investing",
        "created": 1595785222.0
    },
    {
        "author": "IamMat",
        "body": "Here's what will happen and i will come back to this once earnings are released next week.\n\n&amp;#x200B;\n\n1) AMD will get pumped hard until earnings\n\n2) It will beat top and bottom but will dump, similar to microsoft.  This is our environment right now.",
        "created_utc": 1595543113,
        "id": "fz11pfn",
        "score": 410,
        "subreddit": "investing",
        "created": 1595571913.0
    },
    {
        "author": "longGERN",
        "body": "I owned amd at $15 in 2018 and sold at $18. Bought HEAR at $32, kept it in my portfolio this year because I enjoyed the 2 year landslide of pain, then sold this yr at $5",
        "created_utc": 1595629073,
        "id": "fz4zi1o",
        "score": 295,
        "subreddit": "wallstreetbets",
        "created": 1595657873.0
    },
    {
        "author": "martinvandepas",
        "body": "For 8 years, I worked at Intel as an electrical engineer designing circuits for the future manufacturing processes that Intel would be releasing 2-4 years into the future. There are literally thousands of MS and PhD engineers working on the myriad of challenges involved in making better computer chips. All the way from the design of the manufacturing tools, the amount of NAND gates in a library, the modeling and forecasting of dozens of transistor parameters, writing and supporting the simulation tools, to what I was doing designing and testing: analog circuits in a not yet stable manufacturing process. And hundreds of other challenges that each had teams from a few to a few dozen engineers trying to solve them. It's an insanely complex task. Most engineers working on any of these tasks are so specialized that they don't have any idea how to do the job of the engineers sitting a few aisles over. These engineers are 5-9 management layers below the CEO. Other companies operate the same way, it's just how chip design is done. \n\nIntel's main advantage over the last few decades was that it continuously had the most advanced manufacturing process, maintaining a 1-2 year lead over its closest competitors. However over the last ten years, TSMC has caught up and now overtaken Intel. This is mostly due to Intel's engineering struggles with it's last few manufacturing processes. These things spend half a decade in planning and development. Decisions were made years ago that they are now stuck with. \n\nYour points are all about top level management and I'm sure there's some truth to how important the CEO's decisions are, but I think Intel's current problems are primarily engineering problems with the manufacturing process. I sincerely doubt it's for lack of investment by CEOs. I think it's more likely that TSMC had better engineering talent and was able to do things more creatively that ended up wildly successful.  And surely some luck there too.\n\nAMD has been doing well with their architectures recently and they should get credit for that, but their architectures were always quite good, the thing holding them back was their process and what had been a disadvantage, with TSMC, is now a huge advantage. They are poised to take market share, but they mostly have TSMC to thank for that.",
        "created_utc": 1595777052,
        "id": "fzb3mtw",
        "score": 263,
        "subreddit": "investing",
        "created": 1595805852.0
    },
    {
        "author": "Lightening84",
        "body": "&gt; Maybe there's something to stocks popular with robinhood not being able to moon\n\nYou either have a goldfish's memory or it's ability to invest. $AMD is up 73% y/y and +3,021% 5Y. What is your definition of \"moon\" ???",
        "created_utc": 1595348618,
        "id": "fys1iua",
        "score": 263,
        "subreddit": "wallstreetbets",
        "created": 1595377418.0
    },
    {
        "author": "SpaceKujo",
        "body": "fuck me i sold my AMD 2 days ago",
        "created_utc": 1595970848,
        "id": "fzjycaz",
        "score": 216,
        "subreddit": "stocks",
        "created": 1595999648.0
    },
    {
        "author": "csklmf",
        "body": "AMD beats earnings: to the moon\n\nMSFT beats earnings: big drop and all tech stock plummet",
        "created_utc": 1595973252,
        "id": "fzk35at",
        "score": 201,
        "subreddit": "stocks",
        "created": 1596002052.0
    },
    {
        "author": "DARPA1191969v1",
        "body": "Intel is still viable but be aware that they (and this has been reported before) are essentially milking a product line from like 2015 (ish) at this point in terms of architecture and node size. Honestly they have no one to blame but themselves, but in case there are any actual longterm investors here - be aware that this problem has been boiling for years and the fallout is likely to be huge unless AMD fumbles at the 2-yard line or intel throws about 3 Hail Mary's.",
        "created_utc": 1595550279,
        "id": "fz1fa3o",
        "score": 165,
        "subreddit": "investing",
        "created": 1595579079.0
    },
    {
        "author": "OD_prime",
        "body": "Nah, AMD hasn’t cost $10 in a long time. This has been years in the making",
        "created_utc": 1595605022,
        "id": "fz3lkyj",
        "score": 159,
        "subreddit": "wallstreetbets",
        "created": 1595633822.0
    },
    {
        "author": "VRT_Corrado",
        "body": "Intel took a shit. Nvidia is the most valuable chip manufacturer in the world. AMD walked past Intel after years as the underdog. What a fuckin time to be alive!",
        "created_utc": 1595609447,
        "id": "fz3uwi4",
        "score": 153,
        "subreddit": "wallstreetbets",
        "created": 1595638247.0
    },
    {
        "author": "spid3rfly",
        "body": "In some good news... It looks like AMD is leaving that resistance line behind.\n\nWhich is cool but it's probably just because of the Intel chip delay news.",
        "created_utc": 1595597915,
        "id": "fz37z1y",
        "score": 148,
        "subreddit": "stocks",
        "created": 1595626715.0
    },
    {
        "author": "itsdrivingmenuts",
        "body": "Um, how exactly? This dude bought $250k worth of AMD shares years ago at 10 bucks. This is an /r/investing fucking bet at best.",
        "created_utc": 1595605755,
        "id": "fz3n3h0",
        "score": 148,
        "subreddit": "wallstreetbets",
        "created": 1595634555.0
    },
    {
        "author": "kareezy",
        "body": "AMD gang since 2013. This feels niiiiice.",
        "created_utc": 1595970334,
        "id": "fzjxbdj",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1595999134.0
    },
    {
        "author": "Minnesnota",
        "body": "Intel shit the bed on earnings and delayed 7nm. AMD about to cum all over that ass with Zen 3 in a month or two.",
        "created_utc": 1595538416,
        "id": "fz0sala",
        "score": 130,
        "subreddit": "wallstreetbets",
        "created": 1595567216.0
    },
    {
        "author": "LovableContrarian",
        "body": "Bruh, it's based on future expectations.\n\nAMD is grabbing market share like a hungry slut (not just in consumer PCs but also in consoles, enterprise, servers, etc), and INTC just continues to fuck up everything. It's honestly sort of amazing how many mistakes Intel has made in the past year or so, and they are legitimately at risk of becoming completely uncompetitive.\n\nThey basically lost 100% of the enthusiast/custom PC market overnight, and most of their revenue now comes from contracts with Dell, Lenovo, Apple, etc for desktop and notebook CPUs (and a few other random components, like wifi and Bluetooth cards). And, these companies will almost definitely be looking to AMD, as Intel's 7nm chips aren't expected to be available until *at least* 2022, and AMD is already mass-producing. Depending on how hard these companies ditch Intel, it could be an actual death blow. \n\nAnd that doesn't even bring up the issue that things are shifting more and more to mobile platforms, where Intel completely failed. Companies like Apple, Samsung, and Qualcomm absolutely dominate in the mobile SoC sector and managed to castrate a titan when Intel attempted to enter that market and failed miserably. \n\nIt's bad news all around. \n\nDoes that mean they can't come back? No. Of course they can. But the concerns are real.\n\nWhat other major stocks have you seen recently crash 13% on earnings then just... Stay there? Flat? We are in the most legendary dip-buying market of all time, where almost any dip will be bought without any logic, and yet no one would touch INTC, which is one of the biggest tech companies in the world.\n\nIt's a bit concerning.\n\nYour DD is basically \"bruh, it's Intel. And they made a lot of money in 2019.\" But that's frankly just not very good DD my friend.",
        "created_utc": 1595631956,
        "id": "fz54toq",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1595660756.0
    },
    {
        "author": "TheEUR0PEAN",
        "body": "Seems tempting to load up on AMD calls and sell them just before earnings.",
        "created_utc": 1595544137,
        "id": "fz13pd7",
        "score": 127,
        "subreddit": "investing",
        "created": 1595572937.0
    },
    {
        "author": "huynhorlose",
        "body": "Nah he threw 250k into AMD years back and held. \n\nThis is peak /investing",
        "created_utc": 1595606088,
        "id": "fz3nsn8",
        "score": 107,
        "subreddit": "wallstreetbets",
        "created": 1595634888.0
    },
    {
        "author": "HocusPokas",
        "body": "AMD.... This was my first stock. 1500 @ 8 bucks solely because of the memes and it turned out great. Paid my house down payment and wedding with that money. Shoutout WSB for that call way back when.",
        "created_utc": 1595302881,
        "id": "fyqcj2s",
        "score": 102,
        "subreddit": "stocks",
        "created": 1595331681.0
    },
    {
        "author": "OhioBaseball",
        "body": "Who remembers the days when AMD was the one dropping the ball like this at every turn? My oh my how the tables have turned. It’s pretty incredible.",
        "created_utc": 1595551590,
        "id": "fz1hmvu",
        "score": 102,
        "subreddit": "investing",
        "created": 1595580390.0
    },
    {
        "author": "Pijoto",
        "body": "I sold a ton of AMD shares and Calls this week, and now I'm in your position, with AMD Puts and Intel $50 Calls I picked up on the cheap when the price dropped below $50...  Gonna hold my breath all next week, will definitely be kicking myself if AMD rockets into the 70s, because my plan is to get back in under $65.....",
        "created_utc": 1595636369,
        "id": "fz5cq6i",
        "score": 95,
        "subreddit": "wallstreetbets",
        "created": 1595665169.0
    },
    {
        "author": "BullorbrokeWnG20",
        "body": "TSLA, nio, nkla, dkng, mrna, amd, rtx",
        "created_utc": 1595522684,
        "id": "fyzuc2d",
        "score": 92,
        "subreddit": "stocks",
        "created": 1595551484.0
    },
    {
        "author": "WSBConsensus",
        "body": "**Intel is pushing back its 7-nanometer-based CPU product timing by six months** from its previous target. The announcement comes as Intel reports stronger 2Q results. But, the **delays have given an advantage to competitors like Advanced Micro Devices.**",
        "created_utc": 1595538691,
        "id": "fz0su3t",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1595567491.0
    },
    {
        "author": "MrCoolizade",
        "body": "If it makes you feel better I bought AMD at $1.92 and sold ~$6.80. wasted all my gains on OTM options after that when if I held I'd almost have a million",
        "created_utc": 1595639101,
        "id": "fz5hg9a",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1595667901.0
    },
    {
        "author": "EngineNerding",
        "body": "Regulatory credits are legitimate income amd are expected to continue until everyone starts making EVs.",
        "created_utc": 1595450843,
        "id": "fywu29v",
        "score": 89,
        "subreddit": "investing",
        "created": 1595479643.0
    },
    {
        "author": "ztw2002",
        "body": "Holding Intel calls and AMD puts like a retard",
        "created_utc": 1595968025,
        "id": "fzjsl3w",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1595996825.0
    },
    {
        "author": "LogicUpgrade",
        "body": "In few months: glad I didn’t invest in AMD.  Kicking myself I didn’t buy Intel when it dipped few months back.",
        "created_utc": 1595758838,
        "id": "fzafuas",
        "score": 87,
        "subreddit": "investing",
        "created": 1595787638.0
    },
    {
        "author": "ninjawick",
        "body": "Congrats. AMD stocks might get much higer following the failure of intel's  7nm cpu.",
        "created_utc": 1595602601,
        "id": "fz3gqjr",
        "score": 83,
        "subreddit": "wallstreetbets",
        "created": 1595631401.0
    },
    {
        "author": "VolvoKoloradikal",
        "body": "Intel has the smartest minds in the business, they've been through worse times and they'll deliver.\n\nAnd AMD will be the king for the next 4 years for sure, maybe even longer.",
        "created_utc": 1595544957,
        "id": "fz15ac5",
        "score": 80,
        "subreddit": "investing",
        "created": 1595573757.0
    },
    {
        "author": "gkdjsl",
        "body": "I sold my AMD shares and kept my MU ones, I should qualify for some form of government disability benefit",
        "created_utc": 1595973016,
        "id": "fzk2o6l",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1596001816.0
    },
    {
        "author": "kbthroaway723",
        "body": "Positions: BABA calls mostly, TWTR PTON AMD also been good to me. 70% stock 30% calls. It’s no TSLA but I refuse to hop on a fomo bandwagon, slow and steady wins the race \n\nChina gang 2020",
        "created_utc": 1594513579,
        "id": "fxrynyx",
        "score": 79,
        "subreddit": "wallstreetbets",
        "created": 1594542379.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "Not blind , it's pretty obvious. Look at the fundamentals , net income of Intel is 21B in 2019 and revenue is 72B. Net income of AMD in 2019 is 341M and their revenue is 6.73B. You guys are really retarded if you didn't buy this Intel dip after good earnings.",
        "created_utc": 1595628425,
        "id": "fz4yapz",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1595657225.0
    },
    {
        "author": "spacezucchinies",
        "body": "I like people like this. Hindsight is 20/20 and AMD coulda gapped down. It could even crash now if anyone remembers what happened to silver last night. Take your profits while you can and don't look back.",
        "created_utc": 1595974393,
        "id": "fzk5d9e",
        "score": 78,
        "subreddit": "stocks",
        "created": 1596003193.0
    },
    {
        "author": "fsbull",
        "body": "My AMD tendies will be printing thanks to Intel 🤞",
        "created_utc": 1595536453,
        "id": "fz0oaxq",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1595565253.0
    },
    {
        "author": "LogicUpgrade",
        "body": "This entire narrative is BS. First, AMD has a fraction of the market share of Intel. Second, this is the third time AMD is about to overtake Intel, as if, it never happens. Check the long term charts. Third, Intel’s supposed 10nm process is actually a closer match to TSMC’s 7nm process already. Sizes don’t correspond to physical measurements. \n\nIs Intel hurting right now? Sure. But the biggest factors for it hurting aren’t the delay in process but two other things: the recession and the shrinking x86 market. \n\nGuess what, neither of those benefit AMD.",
        "created_utc": 1595758745,
        "id": "fzafr7q",
        "score": 74,
        "subreddit": "investing",
        "created": 1595787545.0
    },
    {
        "author": "TheAvantGardeners",
        "body": "Yes. AMD hasn’t  been $10 for a while now.",
        "created_utc": 1595613896,
        "id": "fz44h5f",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1595642696.0
    },
    {
        "author": "HiMyNamesEvan",
        "body": "AMD still has plenty of room to grow\n\nPeople are just  starting to see the true potential in this company \n\nLong term hold",
        "created_utc": 1595969871,
        "id": "fzjwdpo",
        "score": 73,
        "subreddit": "stocks",
        "created": 1595998671.0
    },
    {
        "author": "zakkwaldo",
        "body": "As someone who works at intel. I’ll let you in on a little more about why Intel is slumping. We are getting to a point with processors where the failure and error rate are almost matching that of the successful output rate for some of the processor processes (this is true for the industry as a whole). The difference is, intel has in house fabs. Amd outsources their fab work to partnered companies. The reason this matters is as you have more failures and complexities arise, if your in housing your own stuff, you eat the cost of failure directly. If you contract it out, you frankly don’t give a shit what happens. You either get your product or the partnered company hasn’t held up their agreed contract and things get legal. \n\nAs a result amd has been able to move forward with newer nanometer processes without any fear or concern of if it’s even feasible or not. \n\nI will end with this though. Intel wouldn’t be dropping 8 billion dollars in to a new fab space (d1x in Oregon) if they didn’t feel they had a solid road map. Mark my words now, in 5-10 years, intel will be the leading manufacturer of FPGA’s and FPGA’s as a whole, will begin to replace the standard processor market as we know it.",
        "created_utc": 1595772379,
        "id": "fzavmus",
        "score": 71,
        "subreddit": "investing",
        "created": 1595801179.0
    },
    {
        "author": "Matacumbie",
        "body": "Stay away from penny stocks. Stick to solid companies and don’t start messing with options until you have a firm grasp on what they are. You do this  and you will be a multi-millionaire before you hit 50 providing you increase your portfolio with monthly capital injections. 50-100-500 it doesn’t matter just every month make it a point to pay yourself first and add or make a new position. Time is the ultimate currency and it’s on your side. If I were you I would ask myself “what will my future look like” and invest in companies that align with that future. My future looks like this TSLA, NIO, AMD, GLD, SLV, MSFT, APPL, NVDA, AMZN, GOOGL, BRK-B, LYFT, APTV, LULU, ARKK, QQQ, PLUG, NEM, NET, MTCH, DDOG, SPCE etc. I also own 2 rental properties and a lots of physical gold, silver and some pretty sweet guns. This is what I see in my future and I’m 33; now ask yourself what you see in yours. Also, as a side note: ride the wave. There will be terrible days and there will be amazing days but stay the course. Don’t trade with emotions and sell because you lost 5%. Ride that wave through the storm and always buy the dips. Read the “intelligent investor” and “a random walk down Wall Street”. Enjoy this life lesson young man. Also, second side note: be a good person. Don’t be a jerk to women, don’t cheat, have respect for yourself and stay the fuck away from hard drugs and alcohol.",
        "created_utc": 1595477986,
        "id": "fyy5tur",
        "score": 70,
        "subreddit": "stocks",
        "created": 1595506786.0
    },
    {
        "author": "TeslaCyberBackpack",
        "body": "Puts on AMD and calls on Tesla after earnings? Yeah you definitely belong here",
        "created_utc": 1595525134,
        "id": "fyzzr68",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1595553934.0
    },
    {
        "author": "kolbi_nation",
        "body": "what a time to be alive. AMD carrying my portfolio",
        "created_utc": 1595602797,
        "id": "fz3h4f7",
        "score": 69,
        "subreddit": "stocks",
        "created": 1595631597.0
    },
    {
        "author": "smallstreetgains",
        "body": "The /r/wallstreetbets subreddit is bullish overall, with 807 bullish comments and 355 bearish comments.\n\n**Sentiment**|**Comments**\n:--|:--\nBullish|807\nNeutral|4459\nBearish|355\n\nThe top trending tickers of the day are TSLA, AZN, SPY, MSFT, AMZN, QQQ, VXX, AAPL, WMT, NKLA, AMD, MRNA, IBM, SNAP, FB, NIO, and F, out of 5621 searched comments.\n\n**Ticker**|**Mentions**|**Company**|**Price**|**P/E**|**Daily Change**\n:--|:--|:--|:--|:--|:--\nTSLA|356|Tesla, Inc.|$1648.53|-|9.84%\nAZN|240|AstraZeneca PLC|$58.96|105.34|-3.50%\nSPY|195|-|$324.90|-|0.99%\nMSFT|183|Microsoft Corporation|$211.85|35.79|4.42%\nAMZN|169|Amazon.com, Inc.|$3195.11|141.49|7.87%\nQQQ|72|-|$267.11|-|2.97%\nVXX|70|-|$29.17|-|-4.74%\nAAPL|62|Apple Inc.|$393.24|30.21|2.06%\nWMT|58|Walmart Inc.|$131.71|25.06|-0.03%\nNKLA|46|Nikola Corporation|$38.63|800.66|-20.90%\nAMD|39|Advanced Micro Devices, Inc.|$57.29|135.23|4.09%\nMRNA|38|Moderna, Inc.|$82.85|-|-12.65%\nIBM|33|International Business Machines Corporation|$126.73|12.18|1.29%\nSNAP|25|Snap Inc.|$25.25|-|2.91%\nFB|25|Facebook, Inc.|$245.17|34.83|1.30%\nNIO|23|NIO Inc.|$12.83|-|15.68%\nF|21|Ford Motor Company|$6.66|-|-2.13%\n\nYou can view all top trending tickers on /r/RedditTickers.\n\nNotice an error or have questions? Reply to this post or message /u/smallstreetgains.\n\nFinancial data provided by [finviz](https://finviz.com/).",
        "created_utc": 1595275774,
        "id": "fyoyynt",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1595304574.0
    },
    {
        "author": "smallstreetgains",
        "body": "**Subreddit:** /r/wallstreetbets\n\n**Searched Comments:** 14178\n\n**Overall Sentiment:** Bullish\n\n**Trending Tickers:** AMD, SLV, SPY, INTC, TSLA, AMZN, DKNG, MSFT, AUY, AAPL, BA, GLD, TSM, QQQ, NKLA, WMT, ACI, SPCE, APHA, MLB, DXY, MGM, MRNA, VXX, FE, FB, UPS, ATVI, GRMN, GO, GOLD, ARE, PFE, AZN, RTX\n\n**Trending Options:** B $33C 7/31, DKNG $35P 7/31, TSLA $1600C 7/31, AUY $7C 8/21, PCG $10C 7/31, AMD $59C 8/14, SPY $330C 7/31, TQQQ $100P 7/31, SLV $22C 7/31   \n\n**Sentiment**|**Comments**|**%**\n:--|:--|:--\nBullish|2073|67.75%\nNeutral|11118|-\nBearish|987|32.25%\n\n\n**Ticker**|**Mentions**|**Company**|**Price**|**P/E**|**Daily Change**\n:--|:--|:--|:--|:--|:--\nAMD|379|Advanced Micro Devices, Inc.|$68.88|170.52|-0.74%\nSLV|351|Exchange Traded Fund|$22.68|-|6.93%\nSPY|302|Exchange Traded Fund|$323.17|-|0.71%\nINTC|300|Intel Corporation|$49.54|9.79|-2.07%\nTSLA|288|Tesla, Inc.|$1538.28|729.28|8.56%\nAMZN|205|Amazon.com, Inc.|$3066.59|143.73|1.92%\nDKNG|196|DraftKings Inc.|$34.88|682.73|-7.11%\nMSFT|192|Microsoft Corporation|$203.79|34.92|1.24%\nAUY|175|Yamana Gold Inc.|$6.57|22.99|4.37%\nAAPL|122|Apple Inc.|$378.91|29.04|2.28%\nBA|122|The Boeing Company|$169.77|-|-2.30%\nGLD|115|Exchange Traded Fund|$181.96|-|1.83%\nTSM|100|Taiwan Semiconductor Manufacturing Company Limited|$82.45|24.79|11.57%   \nQQQ|90|Exchange Traded Fund|$260.23|-|1.83%\nNKLA|87|Nikola Corporation|$33.08|490.49|10.56%\nWMT|72|Walmart Inc.|$131.18|24.96|-0.05%\nACI|70|Albertsons Companies, Inc.|$15.20|9.62|-5.65%\nSPCE|67|Virgin Galactic Holdings, Inc.|$24.81|-|2.06%\nAPHA|66|Aphria Inc.|$5.74|17.09|12.43%\nMGM|56|MGM Resorts International|$14.95|2.84|-5.29%\nMRNA|54|Moderna, Inc.|$79.81|-|9.02%\nVXX|49|Exchange Traded Fund|$29.35|-|-2.72%\nFE|47|FirstEnergy Corp.|$29.15|27.68|-1.12%\nFB|45|Facebook, Inc.|$233.72|33.20|1.30%\nUPS|43|United Parcel Service, Inc.|$120.92|23.97|2.17%\nATVI|39|Activision Blizzard, Inc.|$81.75|39.58|2.21%\nGRMN|39|Garmin Ltd.|$100.33|18.99|3.71%\nGO|38|Grocery Outlet Holding Corp.|$43.03|164.49|2.99%\nGOLD|37|Barrick Gold Corporation|$29.85|11.79|4.98%\nARE|35|Alexandria Real Estate Equities, Inc.|$170.13|79.35|0.94%\nPFE|35|Pfizer Inc.|$37.66|13.76|0.00%\nAZN|31|AstraZeneca PLC|$56.58|96.21|1.39%\nRTX|31|Raytheon Technologies Corporation|$61.15|13.07|-1.49%\n\n\nYou can view all top trending tickers on /r/RedditTickers.\n\nNotice an error or have questions? Reply to this post or message /u/smallstreetgains.\n\nFinancial data provided by [finviz](https://finviz.com/).",
        "created_utc": 1595880643,
        "id": "fzfubv7",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1595909443.0
    },
    {
        "author": "rali108",
        "body": "AMD is one of two companies in the world with x86 license. Their new Ryzen desktop lineup is kicking Intels ass, (intel is the other company with the license).  \n\nThey also make GPUs, and their mid to low end is highly competitive with Nvidia, although Nvidia has better high end. \n\nThey are exclusive suppliers for chips for XBOX and Playstation.\n\nTheir server chips which power cloud computing are top of the line when it comes to price performance and are just demolishing most of the competition.\n\nTheir new mobile chips are excellent as well.\n\nAlso their CEO, Lisa Su is simply a genius for what she has been able to accomplish thus far\n\n&amp;#x200B;\n\nIf they continue hitting their goals and gaining market share, Amd could be close to Intel or Nvidia market cap in a couple of years",
        "created_utc": 1595295035,
        "id": "fypzj5d",
        "score": 65,
        "subreddit": "stocks",
        "created": 1595323835.0
    },
    {
        "author": "StockDealer",
        "body": "Oh dear. I'm afraid you're in for a nasty surprise. Even if AMD drops somewhat your premiums won't increase. And yes, it's just a matter of time before AMD goes higher so you're betting against the trend.",
        "created_utc": 1595636790,
        "id": "fz5dga1",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1595665590.0
    },
    {
        "author": "fivedaze",
        "body": "AMD is also supplying the chips for both next gen game consoles (ps5 &amp; xbox)",
        "created_utc": 1595971146,
        "id": "fzjyxkw",
        "score": 63,
        "subreddit": "stocks",
        "created": 1595999946.0
    },
    {
        "author": "leonx81",
        "body": "AMD gang 2016 checking in.",
        "created_utc": 1595970603,
        "id": "fzjxupg",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1595999403.0
    },
    {
        "author": "Deonneon",
        "body": "AMD broke out of its consolidation channel this week. Bullish pent up energy. When she moves, she moves for days. Expected NVDA speculation money to flow into AMD now that NVDA is too high. Pop hard Wednesday on New product news and it took a market to push her down Thursday. Bullish energy still there for ER next week. Expected a 5% bounce today. Intel did me good unexpectedly. \n\nAMD was the meme stock of 2017-2018 before Tesla.",
        "created_utc": 1595612204,
        "id": "fz40u0x",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1595641004.0
    },
    {
        "author": "MasterChief54321",
        "body": "AMD could reach NVIDIA price levels.",
        "created_utc": 1595604842,
        "id": "fz3l7tm",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1595633642.0
    },
    {
        "author": "Shjjjjjj",
        "body": "it just had a 16% pop, AMD always disappoints earnings. I wouldn't be surprised if it drops. I'd buy leaps on the dip (if it happens).  \n\n\nEdit: Don't get me wrong I think AMD Is a winner. Just cautious buying calls after such a large increase.",
        "created_utc": 1595691100,
        "id": "fz7c8at",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1595719900.0
    },
    {
        "author": "bbc82",
        "body": "Finally some insight. I kinda hate how people praise Su. If TSCM had not been where they are now, AMD would be in shambles and she would probably be looking for a new job. The Ryzen architecture was in the making long before Su became CEO.",
        "created_utc": 1595783077,
        "id": "fzbfjpu",
        "score": 55,
        "subreddit": "investing",
        "created": 1595811877.0
    },
    {
        "author": "martinsb12",
        "body": "Thinking of playing AMD.. all their new chipsets sell out within an hour.. dont know if low supply or if there really is that high demand.",
        "created_utc": 1595686930,
        "id": "fz759pa",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1595715730.0
    },
    {
        "author": "BigDerbsBiggerStonks",
        "body": "AMD gang 2017 checking in",
        "created_utc": 1595970478,
        "id": "fzjxlqn",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1595999278.0
    },
    {
        "author": "TrapHouseLessons",
        "body": "Don't you know the definition of \"moon\" to OP means it always has to go up? Maybe once he is finished throwing his temper tantrum he might notice that when AMD dips, it is a good time to get in since it has shown time and time again it will recover and eventually go down within a range.",
        "created_utc": 1595358281,
        "id": "fyslk7v",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1595387081.0
    },
    {
        "author": "Dooglers",
        "body": "And intel's entire empire was built off the back of having the undisputed best fabs  in the world.  They often led the nearest competition by 2+ years.  Now they are 2 years behind TSMC.  It is a different world now.  AMD is only one of the companies they are losing ground to.",
        "created_utc": 1595559149,
        "id": "fz1urnx",
        "score": 52,
        "subreddit": "investing",
        "created": 1595587949.0
    },
    {
        "author": "TheEmbalmer3",
        "body": "Here comes 25 (experts) (lol) saying “He must be new thats all penny stocks ever are”  🤔I wonder how anything ever got out of penny stock status by that logic. Tell that to AMD investors who got in when it was 2.00 or less. In reality there are too many dishonest or dumb ppl on reddit claiming to know what they are talking about.",
        "created_utc": 1595147496,
        "id": "fyjj6if",
        "score": 52,
        "subreddit": "pennystocks",
        "created": 1595176296.0
    },
    {
        "author": "smallstreetgains",
        "body": "**Subreddit:** /r/wallstreetbets\n\n**Searched Comments:** 9381\n\n**Overall Sentiment:** Bullish\n\n**Trending Tickers:** SLV, SPCE, AMD, SPY, TSLA, INTC, KODK, AMZN, GLD, BA, VXX, MSFT, AAPL, PFE, WMT, AUY, SHOP, QQQ, RTX, APHA, FB, TSM, ATVI, MCD\n\n**Trending Options:** SPY $330C 08/03, SLV $23C 9/18, BUD $57C 7/31, SLV $23C 8/7, AAPL $400C 8/21, NOK $4C 15/21, VXX $30C 8/14, CRON $6C 8/7, INTC $53C 7/31\n\n**Sentiment**|**Comments**|**%**\n:--|:--|:--\nBullish|1178|65.34%\nNeutral|7578|-\nBearish|625|34.66%\n\n\n**Ticker**|**Mentions**|**Company**|**Price**|**P/E**|**Daily Change**\n:--|:--|:--|:--|:--|:--\nSLV|406|Exchange Traded Fund|$22.73|-|-0.43%\nSPCE|266|Virgin Galactic Holdings, Inc.|$23.97|-|-3.83%\nAMD|250|Advanced Micro Devices, Inc.|$67.99|169.46|-1.43%\nSPY|183|Exchange Traded Fund|$321.75|-|-0.45%\nTSLA|183|Tesla, Inc.|$1495.56|792.38|-2.86%\nINTC|114|Intel Corporation|$49.21|9.59|-0.74%\nKODK|105|Eastman Kodak Company|$8.25|-|214.89%\nAMZN|94|Amazon.com, Inc.|$3011.40|145.94|-1.43%\nGLD|93|Exchange Traded Fund|$184.03|-|0.99%\nBA|87|The Boeing Company|$171.25|-|0.61%\nVXX|78|Exchange Traded Fund|$29.02|-|-1.09%\nMSFT|76|Microsoft Corporation|$202.67|35.36|-0.58%\nAAPL|66|Apple Inc.|$374.59|29.73|-1.23%\nPFE|60|Pfizer Inc.|$39.17|13.72|4.33%\nWMT|45|Walmart Inc.|$131.87|24.95|0.50%\nAUY|44|Yamana Gold Inc.|$6.59|24.12|-0.38%\nSHOP|42|Shopify Inc.|$985.82|-|0.97%\nQQQ|40|Exchange Traded Fund|$257.38|-|-1.06%\nRTX|40|Raytheon Technologies Corporation|$61.01|12.86|-0.14%\nAPHA|39|Aphria Inc.|$6.00|19.20|4.56%\nFB|39|Facebook, Inc.|$231.25|33.60|-0.96%\nTSM|34|Taiwan Semiconductor Manufacturing Company Limited|$77.03|27.93|-7.48%\nATVI|33|Activision Blizzard, Inc.|$80.89|40.39|-0.91%\nMCD|30|McDonald's Corporation|$196.59|26.36|-2.32%\n\n\nYou can view all top trending tickers on /r/RedditTickers.\n\nNotice an error or have questions? Reply to this post or message /u/smallstreetgains.\n\nFinancial data provided by [finviz](https://finviz.com/).",
        "created_utc": 1595966814,
        "id": "fzjq1yd",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1595995614.0
    },
    {
        "author": "hfutrell",
        "body": "And I was downvoted for calling Intel the next IBM ...\n\nAMD will profit from this, but who is building AMD’s 7nm chips? And who is building Apple’s chips when they transition away from Intel? Who is getting subsidized by every western government that fears China? TSMC to the moon.",
        "created_utc": 1595546157,
        "id": "fz17kmu",
        "score": 52,
        "subreddit": "investing",
        "created": 1595574957.0
    },
    {
        "author": "LovableContrarian",
        "body": "That's why I wrote this huge post about how AMD beat Intel to 7nm chips by a solid 3 years, which puts those sales to Dell, hp, Apple, etc at a huge risk.\n\nThis is literally why their stock dropped.",
        "created_utc": 1595636587,
        "id": "fz5d3nn",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1595665387.0
    },
    {
        "author": "PickelDik",
        "body": "A post about amd after it moons 8%. Coincidence?!?!?! Nawww",
        "created_utc": 1595445521,
        "id": "fywigq3",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1595474321.0
    },
    {
        "author": "elag20",
        "body": "*AMD announces brand new, innovative chips* Bears: this ^",
        "created_utc": 1595445119,
        "id": "fywhm4z",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1595473919.0
    },
    {
        "author": "username_404_",
        "body": "“AMD never breaks 60, I’ll just buy puts for the inevitable fall back down to 55”- me, the clown 🤡",
        "created_utc": 1595538640,
        "id": "fz0sqmi",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1595567440.0
    },
    {
        "author": "MkEnterprise",
        "body": "Remember we all use to look at AMD years ago in the single digits$",
        "created_utc": 1595632841,
        "id": "fz56g7o",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1595661641.0
    },
    {
        "author": "thesmd1",
        "body": "I trade AMD intra-day on another account too.",
        "created_utc": 1595614685,
        "id": "fz46602",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1595643485.0
    },
    {
        "author": "_UsUrPeR_",
        "body": "I was surprised Intel hovered around 60 as long as it had. They're selling server chips with two year old processor form factors for twice the price of AMD's Rome procs. For every company looking to do a refresher on hardware, the choice was a no-brainer. The Rome 2 procs were something we waited to August 2019 to order, and there was such a backlog from orders, that delivery occurred in May of 2020.\n\nI don't think Intel is going to do well. I am surprised they remained $60 until they lost $9 premarket.\n\nYes, Intel does have other revenue streams: network chipsets, motherboards, storage SSD fab, ~~video cards~~, etc. Still, I can't help but think that Intel's lack of R&amp;D into another processor architecture informs me as to their company modus operandi: they rode astride the chip manufacturing world for too long, and a more innovative company is now eating their lunch. They were content to imagine that single-NUMA architecture was going to continue to dominate, while AMD focused on multiple NUMA nodes.\n\nThe disadvantage of single NUMA architecture is the complexity of assembling a die with 24 or 28 cores as a single unit. A lot of their production is thrown away or put into a lower bin when a manufacturing defect takes place. This effectively increases the cost or manufacturing, and Intel processor prices as a whole.\n\nAMD on the other hand, has been developing the Zepplin architecture since the Bulldozer chips in 2011. Their goal was to make production easy by assembling NUMA node modules in batches, and then later integrating them on the  CPU die with a separate processor responsible for intra-node communication. This decreases the points of failure from the entire die, down to single cpu components. This decreases their rate of rejection, which gives them the upper hand on price.\n\nThe final nail in the coffin for Intel is their inability to close the architecture process size below 10nm. When I'd heard that AMD was producing 7nm processors, I was intrigued what Intel's response was going to be. When it came out that they were going to be producing only mobile processors at 10nm, I knew they were in trouble.\nIntel has become second-class, and if they don't invest in some serious R&amp;D on their process and architecture, their processor division will soon become redundant.\n\nI am ultra-bearish on Intel in the long run. I cannot understand anybody claiming otherwise, and they are going to suffer immensely. Their R&amp;D teams are definitely being whipped in the back rooms.",
        "created_utc": 1595679684,
        "id": "fz6vbc2",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1595708484.0
    },
    {
        "author": "miltown_muscle",
        "body": "AMD being worth more per share than INTC doesn't mean anything, you imbecile. Compare their market caps",
        "created_utc": 1595449789,
        "id": "fywrr22",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1595478589.0
    },
    {
        "author": "NonkosherTruth",
        "body": "Got INTC and MSFT and sold my AMD call two days ago. Right now I feel like Matt Damon at the end of the Departed when he walks into his apartment and Wahlberg is standing there, just shoot me.",
        "created_utc": 1595536631,
        "id": "fz0oo26",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1595565431.0
    },
    {
        "author": "detroitvelvetslim",
        "body": "AMD is going to slowly insert the whole shaft into Intel over the next 3 years",
        "created_utc": 1595639852,
        "id": "fz5iqn8",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1595668652.0
    },
    {
        "author": "black_and_shredded",
        "body": "The more I’m on this sub, the more I realize this sub has absolutely outstanding information. You just have to learn to wade through the sea of bullshit. All the tickers I’ve learned in the last year like (just some off the top of my head) DOCU, TSLA, SE, SQ, NVDA, AAPL, NET, FSLY, SPCE, and AMD have skyrocketed and would have made you serious cash if you bought the dips and took profits whenever you could \n\nPro-tip: if everyone’s on something with irrational exuberance, they’re probably just FOMOing. Stay away unless you’re early to the party. But keeps your eyes peeled for some good tickers and don’t be afraid to ride the wave of the thing that’s up 90% for the year. It’s high for a reason",
        "created_utc": 1595942037,
        "id": "fzicf9p",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1595970837.0
    },
    {
        "author": "return_of_the_ring",
        "body": "Don’t sell. They are doing very well and Intel is out of the game right now. As long as amd continues to execute, they are in no danger of falling off anytime soon. They haven’t even made significant inroads into the server market yet.",
        "created_utc": 1595976678,
        "id": "fzk9s2c",
        "score": 43,
        "subreddit": "investing",
        "created": 1596005478.0
    },
    {
        "author": "naltrad",
        "body": "Wtf? Are people mistakenly buying AMC instead of AMD? Up 20%",
        "created_utc": 1595968633,
        "id": "fzjtu97",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1595997433.0
    },
    {
        "author": "longi11",
        "body": "AMD 80c my dudes, Wednesday is coming",
        "created_utc": 1595686151,
        "id": "fz741xo",
        "score": 41,
        "subreddit": "options",
        "created": 1595714951.0
    },
    {
        "author": "RebelLord",
        "body": "Well I went to go sell the 5000$ worth of AMD shares I bought for my mom at 52 a share with her retirement......\n\n&amp;#x200B;\n\nSHE SOLD IT AT A LOSS 2 MONTHS AGO TO BUY SKETCHERS STOCK AND SHES DOWN 1K!!!!",
        "created_utc": 1595606784,
        "id": "fz3p98b",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1595635584.0
    },
    {
        "author": "sauccey",
        "body": "AMD. The original meme stock!!  Let’s goooo",
        "created_utc": 1594825630,
        "id": "fy5fbga",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1594854430.0
    },
    {
        "author": "Ban_787",
        "body": "Only the real OG’s remember when AMD was the only thing we traded here.",
        "created_utc": 1595973809,
        "id": "fzk48m5",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1596002609.0
    },
    {
        "author": "pikindaguy",
        "body": "AMD up 14% and INTC down 14%, what  a day",
        "created_utc": 1595604836,
        "id": "fz3l7ea",
        "score": 38,
        "subreddit": "stocks",
        "created": 1595633636.0
    },
    {
        "author": "musicamusement",
        "body": "Looks like my AMD 60p 7/31 are not printing lmao",
        "created_utc": 1595969295,
        "id": "fzjv7c2",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1595998095.0
    },
    {
        "author": "ikntspeel",
        "body": "\"Welcome to our AMD quarterly shareholder meeting. We have a major shareholder /u/thesmd1 joining us today to discuss... Oh nevermind, he just sold his entire position\" - AMD CEO",
        "created_utc": 1595609055,
        "id": "fz3u27f",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1595637855.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "I miss AMD under $10. It really wasn't that long ago.\n\nIt languish in a channel forever till market finally realize they are giving INTC a run for their money.",
        "created_utc": 1595623993,
        "id": "fz4pl6h",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1595652793.0
    },
    {
        "author": "SkyBIueDreams",
        "body": "I can’t help but laugh. This is all a fucking joke. I play MSFT earnings. They beat. It dumps. Calls worthless.\n\nI play Intel earnings. They beat. It dumps. Calls worthless.\n\nI avoid AMD because it just had a huge run up. They beat. It moons.\n\nSbux beats, moons. Of course.",
        "created_utc": 1595972620,
        "id": "fzk1vky",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1596001420.0
    },
    {
        "author": "amdsubae",
        "body": "Holy shit.....AMD why did I sell covered calls FUCK FUCK FUCK",
        "created_utc": 1595970424,
        "id": "fzjxhw6",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1595999224.0
    },
    {
        "author": "AmericanCreamer",
        "body": "This sub was the best when AMD went from $3 to $10. Lisa Su memes filled the front page. respect to the holders!",
        "created_utc": 1595973915,
        "id": "fzk4ftz",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1596002715.0
    },
    {
        "author": "LaPulgaAtomica87",
        "body": "Sold my AMD calls at $57 and bought puts expecting a pull back to $52...FML.\n\nThe memes, jokes and trolls on this site are therapeutic after such devastating losses.\n\nThank you good sir/ma'am for the laugh. Have my upvote.",
        "created_utc": 1595481091,
        "id": "fyy9y68",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1595509891.0
    },
    {
        "author": "ArUaArugula",
        "body": "Every AMD call holder here acting like their gains are realized rn lol. Hope ya set limits in case of a morning dump.",
        "created_utc": 1595969812,
        "id": "fzjw9ap",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1595998612.0
    },
    {
        "author": "10000yearsfromtoday",
        "body": "The fomo train that's about to slam into AMD is going to be something else. At least half as good as tsla",
        "created_utc": 1595662368,
        "id": "fz6e19f",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1595691168.0
    },
    {
        "author": "caiuscorvus",
        "body": "According to this analysis, every company that is bigger than a competitor will always be the better investment.\n\nWut?\n\nPoint 1. What on this earth does revenue have to do with the ability to buy a company???\n\nPoint 2. I'm sorry does growth not factor into valuation?\n\nPoint 3. Tariffs are applied to imports. Look at manufacturing sites.\n\nPoint 4. Growth, again. Also the study shows it is still gaining market share, just not as quickly in Q4 and **this has rebounded in 2020**.\n\nPoint 5. Entirely unsupported. And what does 5g have to do with AMD, anyways?\n\nPoint 6. Ummm.. do you know what a cpu/gpu is? \"They provide chips for motherboards and gpu's AMD just produce cpu's and graphics cards.\" So, intel provides CPU and CPUs, and AMD provides...CPUs and GPUs? \n\nPoint 7. So, upstart companies are not a thing I guess.\n\nPoint 8. Trusted brand, my ass. See the huge security problems Intel has been having.\n\nI don't normally comment like this, but wow what a shitty DD.\n\nedit. See the good response below.",
        "created_utc": 1595734552,
        "id": "fz9oia4",
        "score": 34,
        "subreddit": "investing",
        "created": 1595763352.0
    },
    {
        "author": "MotorizedDoucheCanoe",
        "body": "AMD call holders are assuming/hoping it’s going to open anywhere near it’s AH price.\n\nIf it does, enjoy the gains.  If it doesn’t, prepare for a day of 1000 AMD shitposts.",
        "created_utc": 1595981069,
        "id": "fzkhvvu",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1596009869.0
    },
    {
        "author": "Nintendie69",
        "body": "Buying the Intel dip is not a no brainer. The company is in decent financial shape but its long term future is looking bad:\n\n1. They have been struggling for years to transition to the 10 nm tech node and haven’t been able to get decent yields. Now the 7 nm process which was supposed to get them back on track is delayed.\n2. AMD is eating their lunch in CPUs. Intel never gained any ground against NVDA in the GPU market. \n3. Their acquisitions to get a foothold in other industries have been dissapointing. (Mobileye)\n4. They have a poor reputation among engineers and are bleeding talent. Anyone who can is looking to leave. The people who stay at Intel are the ones who can’t get another job.\n\nThe tech industry moves fast and today’s winners can disappear if they lose their edge. Look at what happened to Yahoo. Sun Microsystems. Silicon Graphics. All the office parks in the Valley have hidden histories to tell about the companies that used to do groundbreaking work there.",
        "created_utc": 1595632977,
        "id": "fz56p5w",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1595661777.0
    },
    {
        "author": "lmneozoo",
        "body": "$AMD still printing for us longbois in 2020",
        "created_utc": 1595432710,
        "id": "fyvrfk5",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1595461510.0
    },
    {
        "author": "CommonerChaos",
        "body": "Out of all the tech stocks that had recent earnings (AMD, AAPL, FB, AMZN, GOOG) I played the *one* stock in MSFT that decided to crap the bed after earnings instead of mooning.\n\nAlmost convinced there's some kind of voodoo curse on my calls.",
        "created_utc": 1596142871,
        "id": "fzsab8l",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1596171671.0
    },
    {
        "author": "william_fontaine",
        "body": "Sold all my AMD shares a few years ago at $2.",
        "created_utc": 1595555880,
        "id": "fz1p3g5",
        "score": 33,
        "subreddit": "investing",
        "created": 1595584680.0
    },
    {
        "author": "iopq",
        "body": "AMD is the good company at a bad price, Intel is the bad company at a good price",
        "created_utc": 1595552273,
        "id": "fz1iuya",
        "score": 33,
        "subreddit": "investing",
        "created": 1595581073.0
    },
    {
        "author": "dwdsquared2",
        "body": "**Events in the US Today (EDT):**\n\n* 8:55am - Redbook (YoY&amp;MoM) \\[1/3 Volatility\\]\n* 9:00am - S&amp;P/CS HPI Composite Data \\[2/3 Volatility\\]\n* 10:00am - CB Consumer Confidence (Jul) \\[3/3 Volatility\\]\n   * Richmond Manuf. &amp; Services Index, Shipments (Jul) \\[1/3 Volatility\\]\n   * The Senate convenes for session\n* 10:30am - Dallas Fed Services Revenue (Jul) \\[1/3 Volatility\\]\n   * Texas Services Sector Outlook (Jul) \\[1/3 Volatility\\]\n* 4:30pm - API Weekly Crude Oil Stock \\[2/3 Volatility\\]\n* Investors are betting setbacks in the fight against the coronavirus will lead Federal Reserve Chairman Jerome Powell to signal Wednesday that rates will stay near zero for longer\n   * The Federal Open Market Committee holds its policy meeting **today**, with an **a****nnouncement due on Wednesday**\n* Senate Republicans presented a $1 trillion proposal as a first step toward negotiating a compromise with Democrats, who’ve offered their own $3.5 trillion plan\n   * Headlining the proposal is a reduction of the enhanced unemployment insurance from $600 to $200 per week\n   * The HEALS Act will also include another round of direct checks to some Americans that will mirror those that were distributed after the CARES Act was approved in late March. The proposal would give a one-time check to those making up to $75,000 a year, with the amount winding down before it hits the $99,000 income ceiling\n   * It also includes $1.75 billion for construction of new FBI building\n*  U.S. second-quarter GDP is expected on Thursday\n\n**Events in the World Today (EDT):**\n\n* 8:30am - Brazil Current Account (USD-Jun) \\[1/3 Volatility\\]\n* 2:00pm - Brazil CAGED Net Payroll Jobs \\[2/3 Volatility\\]\n* 9:30pm - Australia CPI (QoQ-Q2) \\[3/3 Volatility\\]\n   * Australia Trimmed Mean CIP (QoQ-Q2) \\[2/3 Volatility\\]\n* The ECB extended its recommendation that banks pay no dividends by another six months to the end of the year\n\n**Earnings Before Open:**\n\n* Pfizer, McDonald's, 3M, Raytheon Technologies, Centene Corp., Altria, jetBlue, Harley Davidson, Sherwin Williams, LabCorp\n\n**Earnings After Close:**\n\n* AMD, Visa, eBay, Starbucks, Dexcom, FireEye, Akamai, Amgen, Oneok, Avis Budget Group\n\n[Earnings This Week](https://i.redd.it/6i19e9do82d51.jpg)",
        "created_utc": 1595934704,
        "id": "fzi2lmm",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1595963504.0
    },
    {
        "author": "Hutz_Lionel",
        "body": "Amazon, Apple, Tesla (which went nowhere for years), oil after the 2015 crash, defence in the lead up to election, AMD, Nvidia are a few successful ones that come to mind. Marijuana pre-legalization in Canada “to da moooon!!1!1”.\n\nLots of names were thrown about and went to 0 or close.",
        "created_utc": 1595296639,
        "id": "fyq29u7",
        "score": 33,
        "subreddit": "investing",
        "created": 1595325439.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "Brambles &amp; Shambles Report 7/31:\n\n\nIn Brambles: \n\n* INTC Callholders \n* AMD Callholders\n* AMZN FOMO’ers\n* FB FOMO’ers\n* SPY Putholders\n* VXX Callholders\n\nIn Shambles:\n\n* TSLA Callholders\n* KODK Callholders\n* SPY Putholders \n* AAPL Putholders \n* OPK Callholders\n* BA Callholders\n\n\n“In Shambles” User of the Day: Too many people to list; all you fucks who called the rug pull for the 57th time. Eat my butt\n\nShrimpie Out ✌️ Back on Monday.",
        "created_utc": 1596227087,
        "id": "fzwpotk",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1596255887.0
    },
    {
        "author": "UpperSpinach",
        "body": "Its cute how we're so bonded that everyone knows what we're talking about by the strike even if we dont say the ticker explicitly.\n\n1800c, we know its TSLA\n\n320p, we know its SPY\n\n60c, we know its AMD\n\n3200p, AMZN and so on\n\nLike women on the same menstrual cycle",
        "created_utc": 1594959126,
        "id": "fybsw6p",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1594987926.0
    },
    {
        "author": "tickitch",
        "body": "Hey guess who bought Intel instead of amd yesterday, after staring at both for a bit.\n\nI bought Intel at $60 thinking it would go up but now it's 13% down at $50 a share.\n\n\nFuck.",
        "created_utc": 1595600451,
        "id": "fz3ckji",
        "score": 31,
        "subreddit": "stocks",
        "created": 1595629251.0
    },
    {
        "author": "ReversalTheory",
        "body": "Get the fuck out of AMD tomorrow if you're still holding calls. Do not hold past earnings",
        "created_utc": 1595882292,
        "id": "fzfxrqj",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1595911092.0
    },
    {
        "author": "hfutrell",
        "body": "Except those people are largely right.\n\nHalf of Intel's revenue comes from consumer PCs, with the second largest segment data centers. Everything else they do is a footnote in comparison to these two groups. Intel is *not* well diversified and this is a direct result of their failure in GPUs, mobile, wearables, selling off their modem business, losing Apple as a customer, etc. This is a company increasingly reliant on a few high margin products. If those products lose ground to AMD they are in an *incredibly* precarious position. Intel looks to be a company *in decline*.",
        "created_utc": 1595567521,
        "id": "fz282pu",
        "score": 31,
        "subreddit": "investing",
        "created": 1595596321.0
    },
    {
        "author": "swag_on_the_deep",
        "body": "Robinhood users can't move AMD u fuc boi",
        "created_utc": 1595348699,
        "id": "fys1ou7",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1595377499.0
    },
    {
        "author": "minhyyuk1",
        "body": "I’m long with ENPH and JKS btw!",
        "created_utc": 1595272926,
        "id": "fyot4tf",
        "score": 43,
        "subreddit": "stocks",
        "created": 1595301726.0
    },
    {
        "author": "deGoblin",
        "body": "There is some uncertainty if they can protect their market share from ENPH. Personally I own both.",
        "created_utc": 1594768725,
        "id": "fy37yyh",
        "score": 7,
        "subreddit": "stocks",
        "created": 1594797525.0
    },
    {
        "author": "WhiteHoney88",
        "body": "Does the enph sketchiness bother you? And the fact that they have never come out and said “that’s not true”? I dumped them early but like everything else about them....",
        "created_utc": 1594779058,
        "id": "fy3plzp",
        "score": 7,
        "subreddit": "stocks",
        "created": 1594807858.0
    },
    {
        "author": "peridotdragon33",
        "body": "Yep ENPH is easily one of my favorite investments",
        "created_utc": 1594828923,
        "id": "fy5m1ky",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594857723.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "Speaking of Accounting Fraud...\n\nIt's been two weeks..  And any day now, ENPH is going to come out and deny those fraud allegations...   Any.  Day.  Now.  😏🕰️",
        "created_utc": 1593658752,
        "id": "fwnn2re",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1593687552.0
    },
    {
        "author": "just-another-human-1",
        "body": "Google “ENPH class action”",
        "created_utc": 1595294148,
        "id": "fypxzvq",
        "score": 5,
        "subreddit": "stocks",
        "created": 1595322948.0
    },
    {
        "author": "kstorm88",
        "body": " \n\nTo: All persons or entities who purchased or otherwise acquired securities of Enphase Energy, Inc. (\"Enphase\") (NASDAQ: ENPH) between February 26, 2019 and June 17, 2020. You are hereby notified that a securities class action lawsuit has been commenced in the the United States District Court for the Northern District of California.",
        "created_utc": 1594896097,
        "id": "fy8nxfs",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594924897.0
    },
    {
        "author": "kidze",
        "body": "I own both ENPH and SEDG. Both incredible companies.\n\nI would prefer more SEDG",
        "created_utc": 1594772239,
        "id": "fy3dzv0",
        "score": 4,
        "subreddit": "stocks",
        "created": 1594801039.0
    },
    {
        "author": "RightTackle",
        "body": "Remember when ENPH flash crashed that one day because of the short hit job? Everybody bought puts. If you had got calls, you’d be rich",
        "created_utc": 1595329294,
        "id": "fyr6647",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595358094.0
    },
    {
        "author": "AimlesslyCheesy",
        "body": "Got enph when it was still $5 was planning to sell when it dipped really low. Good thing I held onto it",
        "created_utc": 1595290787,
        "id": "fyps7wh",
        "score": 4,
        "subreddit": "stocks",
        "created": 1595319587.0
    },
    {
        "author": "ReflectAA",
        "body": "Citing false documents is also not against the law by itself though. A plaintiff would have to prove they *created* the false documents, which is difficult.\n\nI think you don’t realize just how often this stuff happens. At least a couple times a year I see a stock on my portfolio or watchlist affected by something like this. The most memorable examples are AMD and ENPH",
        "created_utc": 1594766421,
        "id": "fy33pu6",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1594795221.0
    },
    {
        "author": "TheOriginalRK",
        "body": "Leaving for camping and won’t have service next 2 days. Guess who strapped themselves with ENPH and SEDG weeklies to sell automatically Friday. This retard",
        "created_utc": 1594843677,
        "id": "fy6hfnn",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594872477.0
    },
    {
        "author": "ixamnis",
        "body": "For a riskier choice: **ENPH** \\- Enphase energy has a great future, in my opinion.\n\nFor a safer choice:  **TMUS** \\- T-Mobile used to be at the bottom of the mobile phone world. They are working their way to the top. They seem to be very well managed and their stock prices have been reflecting that.\n\n(I only have exposure to **ENPH** through ETFs. I own shares of **TMUS**).",
        "created_utc": 1593639906,
        "id": "fwmoion",
        "score": 3,
        "subreddit": "stocks",
        "created": 1593668706.0
    },
    {
        "author": "ryan_dfs",
        "body": "Absolutely, I had anxiety with ENPH and was waiting for an opportunity to dump it ever since at a break even point. \n\nThanks, I'll look at SDGR.",
        "created_utc": 1594266917,
        "id": "fxdzyi9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594295717.0
    },
    {
        "author": "freefeets44",
        "body": "If you’re interested in the space, like others have said check our ENPH. Both good companies, but ENPH has a signifiant technology advantage that some people overlook. The whole market is moving towards microinverters, and SEDG’s string/optimizer combo is gonna get left in the dust.",
        "created_utc": 1594780745,
        "id": "fy3sfhj",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594809545.0
    },
    {
        "author": "TheRealHBR",
        "body": "Soo is ENPH still legit?",
        "created_utc": 1593709872,
        "id": "fwpst9j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593738672.0
    },
    {
        "author": "jayjayy123",
        "body": "SPCE FCEL ENPH APHA",
        "created_utc": 1594502707,
        "id": "fxr63an",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594531507.0
    },
    {
        "author": "lackofcoordination",
        "body": "One vote for ENPH",
        "created_utc": 1594400748,
        "id": "fxjqxtr",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594429548.0
    },
    {
        "author": "omaha_shepherd",
        "body": "It's hard to give a single number. 5-10% per month is possible, it just might not be sustainable. Some months it could be 2-3% of that, you just don't know.\n\nA lot depends on what stock you select. In my case I was doing a ton of SFIX/WORK/ENPH and all of those had high premiums for a long time. AMD has gotten expensive but I made a lot with it too.\n\nIt's tough to give an answer to this question. Selling options is risky, owning stock is risky, things move left and right...",
        "created_utc": 1594412208,
        "id": "fxkee1z",
        "score": 2,
        "subreddit": "options",
        "created": 1594441008.0
    },
    {
        "author": "jacped",
        "body": "IMO ENPH is still a long-term buy.  Lots of room to run.  \n\nI now see that Biden released a $2 tril. climate plan today.  Don't know the details, but I am sure that solar would be a beneficiary.  This may have helped the solar stocks today.  \n\nBiden's plan or not, solar industry will be seeing growth.",
        "created_utc": 1594786390,
        "id": "fy41ann",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594815190.0
    },
    {
        "author": "jacped",
        "body": "I can't answer that specifically, but the whole sector was up nicely today...ENPH, SEDGE, etc.  \n\nSomeone must have had news or an ER that portends well for solar in general.",
        "created_utc": 1594769214,
        "id": "fy38v2j",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594798014.0
    },
    {
        "author": "JustinUti",
        "body": "Enph 😮👀",
        "created_utc": 1595255954,
        "id": "fynus9w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595284754.0
    },
    {
        "author": "howboutthemgators",
        "body": "ENPH. If it truly isn’t a fraudulent company, they are set up for success bigly",
        "created_utc": 1595284803,
        "id": "fyph5b6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595313603.0
    },
    {
        "author": "AcidHologram00",
        "body": "Might wanna do some more DD first but this is the second time PP has tried their short attack on ENPH. It was nothing but a great buying opportunity. This is a volatile stock so be cautious, but its a great long term hold. Badri has really turned this company around. Their IQ8 Inverter will be a game changer for them.",
        "created_utc": 1595266077,
        "id": "fyoexta",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595294877.0
    },
    {
        "author": "kidze",
        "body": "Yeah I was skeptical too. I checked their balance sheet and think everything looks fine. Plus the company that has been accusing them for fraud mainly did it bc they short the stocks.\n\nI guess if anyone is afraid they should not touch ENPH but I re-bought it ^o^",
        "created_utc": 1594799723,
        "id": "fy4h8gq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594828523.0
    },
    {
        "author": "KimJongUnsTrousers",
        "body": "These days, pick a fraud that gets heavily shorted and drops after a report, that's the perfect entry to go long and ride the squeeze. ENPH up 70% now after the Prescience report. LK dropped to 20 and then went up to 45 after the Muddy water report. GSX has doubled. HTZ... It's just an upside down market right now",
        "created_utc": 1594249115,
        "id": "fxd5b4v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594277915.0
    },
    {
        "author": "migbyo",
        "body": "I guess ENPH is back?",
        "created_utc": 1595304095,
        "id": "fyqecq1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595332895.0
    },
    {
        "author": "CapitalC5",
        "body": "Simple, you don't. Belief in a company or industry can change and you can never be 100% certain for 10 or even 5 years. But you're pretty sure it will be great for a decent time and if something comes up, just act to it. \n\nI also believed ENPH was going to be the biggest player in solar energy, but I've sold immediately when there were fraud accusations, even if it turns out they are not grounded.\n\nLook at Buffett being a big fan of airlines, well not anymore. He said the industry has changed too much. Such things can happen all the time because of certain events, crisis, regulations, etc.",
        "created_utc": 1594255226,
        "id": "fxdg8mn",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594284026.0
    },
    {
        "author": "czubizzle",
        "body": "I learned a similar lesson with enph a few months back, gotta get out while the gettings good",
        "created_utc": 1594865561,
        "id": "fy7ml3f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594894361.0
    },
    {
        "author": "WSBVoteBot",
        "body": "**A Submission was Spammed by Vote**\n___\n**Title:** ENPH cash out or buy in?\n\n**URL:** https://redd.it/hpw778\n___\n[Click Here to Vote to Approve](https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=restore&amp;message=hpw778) if this is a good submission.\n\nHey /u/Blazed-n-Dazed, you're encouraged to copy and paste the approval link into the Daily Discussion thread for help restoring your post.\n\nUsers who Voted:\ntheta_gang_commander\nMotorizedDoucheCanoe",
        "created_utc": 1594569175,
        "id": "fxu6jy2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594597975.0
    },
    {
        "author": "cocococopuffs",
        "body": "I’m wary of clean energy. Especially with solar tax credits falling off in 2020. Not sure ENPH or SEDG will do very well",
        "created_utc": 1594421417,
        "id": "fxkvwak",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594450217.0
    },
    {
        "author": "mlm55",
        "body": "Anybody read \"Uninhabitable Earth\" By David Wallace Wells? That book will fuck you up. \n\nENPH 50c 8/21, calls on Solar ETFs foreva",
        "created_utc": 1593792050,
        "id": "fwtd7j2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593820850.0
    },
    {
        "author": "KrakenClubOfficial",
        "body": "Holding NIO short term, NCLH mid($35-$40), ENPH, TSLA, and ARK until 🚀",
        "created_utc": 1594006898,
        "id": "fx2dg8c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594035698.0
    },
    {
        "author": "infininme",
        "body": "what do you mean ENPH is low-key?",
        "created_utc": 1593964607,
        "id": "fx0ae4w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593993407.0
    },
    {
        "author": "Deastruacsion",
        "body": "I mostly invested in stocks but had quite a few options pre-COVID. When I would make a few thousand dollars through tech/renewable energy calls BLDP, ENPH, LOGI, SPCE, etc. I would cut ~60 percent of the gains and buy Tesla, AMD, Apple, and nvidia stocks. This way when I lost everything on my DDs, I didn’t crash to 0.",
        "created_utc": 1594039644,
        "id": "fx3efj3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594068444.0
    },
    {
        "author": "Deastruacsion",
        "body": "I mostly invested in stocks but had quite a few options pre-COVID. When I would make a few thousand dollars through tech/renewable energy calls BLDP, ENPH, LOGI, SPCE, etc. I would cut ~60 percent of the gains and buy Tesla, AMD, Apple, and nvidia stocks. This way when I lost everything on my DDs, I didn’t crash to 0.",
        "created_utc": 1594041902,
        "id": "fx3hs7z",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1594070702.0
    },
    {
        "author": "BigHashBrows",
        "body": "\nI currently hold stock in European airlines Ryanair (I’m European) and a few European banks on different stock exchanges (not worth mentioning further).\nWas looking at the payments sector (V &amp; MA), solar companies (ENPH &amp; SEDG) and standard blue chip companies. Was also looking at weed stocks but only for shits and giggles. Feel there’s lots of upside in the future and they’re pretty low at the minute historically so if I see one, I might pick up a few shares.",
        "created_utc": 1594049828,
        "id": "fx3vz5a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594078628.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "His former Accountant works at ENPH 👍",
        "created_utc": 1593654892,
        "id": "fwngpmh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593683692.0
    },
    {
        "author": "Anotherdumbasshole",
        "body": "What happened with ENPH? People don’t care about the fraud?",
        "created_utc": 1593660582,
        "id": "fwnpz0k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593689382.0
    },
    {
        "author": "Parallelism09191989",
        "body": "HASI just loans out money for renewable projects and offers expertise in the field.....\n\nIMHO, they have no moat. If you want dividends, buy AQN or TERP or AY or BEP or NEP. If you want growth, buy ENPH.",
        "created_utc": 1593737852,
        "id": "fwrbopl",
        "score": 1,
        "subreddit": "investing",
        "created": 1593766652.0
    },
    {
        "author": "billmurrayabraham",
        "body": "Come on enph bb you can get in the 50s again it's ok",
        "created_utc": 1593742202,
        "id": "fwriowg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593771002.0
    },
    {
        "author": "RelaxedOctopus420",
        "body": "What is everyone’s thoughts on LOVE (lovesac) and ENPH (enphase energy)",
        "created_utc": 1594135628,
        "id": "fx7odi3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594164428.0
    },
    {
        "author": "Napalm32",
        "body": "NEE, BEP, SEDG, ENPH (low-key volatile af) take a look",
        "created_utc": 1593912985,
        "id": "fwyj42v",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593941785.0
    },
    {
        "author": "Thenattylimit",
        "body": "People have called out ENPH. No substance has been found in the claims. Stop engaging in confirmation bias.",
        "created_utc": 1593937695,
        "id": "fwzczec",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593966495.0
    },
    {
        "author": "Jdom666",
        "body": "MSFT, SQ, Enph, Ark's imo",
        "created_utc": 1594219378,
        "id": "fxbf8ce",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594248178.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "ENPH \n\nTSLA\n\nSEDG\n\nBOTZ\n\nBYND",
        "created_utc": 1594904252,
        "id": "fy8y7tg",
        "score": 1,
        "subreddit": "investing",
        "created": 1594933052.0
    },
    {
        "author": "htr_xorth",
        "body": "Net\nEnph\nAlly\nMsft\nLuv",
        "created_utc": 1594907693,
        "id": "fy93ype",
        "score": 1,
        "subreddit": "investing",
        "created": 1594936493.0
    },
    {
        "author": "GO-U-DIE",
        "body": "If you want to stick to stocks over options I would suggest the company ENPH, but direct stock. I see this company hitting $100 by end of the year. \n\nI found this company at $4, it saw a high about a year later of $70.... rn it’s at $57. \nVolatile stock but generally makes up trends creating awesome profits. Can’t wait for you to hand me 20% from this one;)\n\nEdit: investments open the world of risk and losing money. I just want to clarify that I can’t be held accountable for losses. I’m not a financial advisor.",
        "created_utc": 1594859627,
        "id": "fy7c96a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594888427.0
    },
    {
        "author": "sarvesh0517",
        "body": "I used the same dd for emphase but didn't play it abd it went to 70. Going with my gut on this one",
        "created_utc": 1594624188,
        "id": "fxwp1qp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594652988.0
    },
    {
        "author": "TerrorByteYT",
        "body": "Why has ENPH grown by 6652% over the past 3 years?",
        "created_utc": 1594626863,
        "id": "fxwrqy3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594655663.0
    },
    {
        "author": "silverlink22",
        "body": "You remember ENPH? That shit was illegal.",
        "created_utc": 1594637788,
        "id": "fxx2b6l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594666588.0
    },
    {
        "author": "ixamnis",
        "body": "Clean/renewable energy:  ICLN and QCLN.  I think the Democrats will have the House and Senate, as well, and the younger people in congress are going to really push for more funds towards clean/renewable energy.  This may also affect EV companies like TSLA. (Don't shoot me for that one).   SEDG, ENPH, PLUG, FSLR, BEP.UN, ALB, ON\n\nBiden is big on Nuclear energy, as well. I don't know what stocks or ETFs are strong in that area, but it is something I would take a look at.",
        "created_utc": 1594387703,
        "id": "fxj1ojk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594416503.0
    },
    {
        "author": "diddycarter",
        "body": "ENPH and SEDG",
        "created_utc": 1594360845,
        "id": "fxi71sk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594389645.0
    },
    {
        "author": "TheOriginalRK",
        "body": "Loaded with ENPH and Sedg calls. Any others in the solar gang?",
        "created_utc": 1594769164,
        "id": "fy38rvc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594797964.0
    },
    {
        "author": "Drakana",
        "body": "Thanks I’ve been keeping an eye on how the exchange will work out. For most part it’s been fairly even. \n\nThanks for info on ENPH, also have stock there. I feel there’s a good future for alternative energy, regardless of how election plays out.",
        "created_utc": 1594843076,
        "id": "fy6g5cz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594871876.0
    },
    {
        "author": "PAB_ESCOBAR",
        "body": "anyone in ENPH calls?",
        "created_utc": 1595274883,
        "id": "fyox4za",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595303683.0
    },
    {
        "author": "literallyjustforfmf",
        "body": "I had puts lined up to sell for massive premium right before last earnings, then my internet shit the bed for a week, and I live in the woods so no data connection. Good times. I'll prob play this but naturally I'm also moving across the country next week so good chance it gets fucked somehow. I first found ENPH at $9, wish I'd yolod then.",
        "created_utc": 1595287400,
        "id": "fypm670",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595316200.0
    },
    {
        "author": "Justcorn34",
        "body": "ENPH",
        "created_utc": 1595307866,
        "id": "fyqjnwn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595336666.0
    },
    {
        "author": "but-this-one-is-mine",
        "body": "ENPH",
        "created_utc": 1593989716,
        "id": "fx1lbmr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594018516.0
    },
    {
        "author": "foxtailavenger",
        "body": "My current holdings for growth are ENPH SE LVGO and NET. My fav by far is LVGO.",
        "created_utc": 1593695310,
        "id": "fwox83w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593724110.0
    },
    {
        "author": "Team_Avalon",
        "body": "DDOG - 36% \n\nMSFT - 10%\n\nCash - 10%\n\nOKTA - 8%\n\nFB - 8%\n\nROKU - 5%\n\nRDFN - 5%\n\nENPH - 5%\n\nLYFT - 4%\n\nSPT - 4%\n\nVIAC - 4%\n\nUAL - 3% (I hate myself for buying this)\n\nHigh risk tolerance so looking for some growthy bois. I'm 23 and just started investing last year",
        "created_utc": 1593704974,
        "id": "fwpi8mk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593733774.0
    },
    {
        "author": "TerrorByteYT",
        "body": "RUN, NEE, FSLR, ENPH (WTF is this chart), REGI to name a few renewable energy companies.",
        "created_utc": 1594625568,
        "id": "fxwqgp2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594654368.0
    },
    {
        "author": "jcpto3",
        "body": "Why not their competitor who is stealing market share from them for 3 years straight who just started diving into commercial and global where they will steal even more market share from them? ENPH.",
        "created_utc": 1594566841,
        "id": "fxu2by6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594595641.0
    },
    {
        "author": "ADKTrader1976",
        "body": "Although I do agree about nuclear energy is much more of an efficient way to produce energy for the masses, you are over looking a few issues with your bull run theory.  Nuclear is not something the United States, Japan, UK, Germany, or the rest of the 1st world countries want to go because of the waste and environmental impact.  China and India are the two majors that would need to commit to nuclear, and if they do, dollars to doughnuts they are not gonna use mines located in the US.  Another thing to consider, is that if people start to move out of the cities and people dense areas to more sparsely populated areas what is gonna prevent them to stay complete off the grid if it's possible with today's tech.  The pitifalls of the past in using renewable energy as the primary source to power a home has always been the conversion and storage part of the equation,  not the acquisition of it.   On the inverter side, companies like SEDG and ENPH have held onto their gains and continue to show robust sales in both the US and Europe.  Tesla's power wall has been gaining momentum and is leading the way in batteries.  Tesla is not just a car company, it's a renewable energy infrastructure play that in years to come will drive the new IoT in the future.  Add Musk's satellite internet drive and there is broad brush stroke of the next market cycle.",
        "created_utc": 1594473433,
        "id": "fxnyb4b",
        "score": 1,
        "subreddit": "investing",
        "created": 1594502233.0
    },
    {
        "author": "TerrorByteYT",
        "body": "Still think it's worth getting into any of these?\n\nAlso, thoughts on ENPH in its current situation?",
        "created_utc": 1594701368,
        "id": "fy089yv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594730168.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"Besides that, I sold ENPH because of the law suit.\"\n\nI'm going to guess it was some sort of class action like you see all the time.",
        "created_utc": 1594931107,
        "id": "fyafgxt",
        "score": 1,
        "subreddit": "investing",
        "created": 1594959907.0
    },
    {
        "author": "ishkabum",
        "body": "right now here is the line-up in order of weight:\n\nENPH Enphase energy\n\nRTX Raytheon\n\nAEP American electric power\n\nGAN GameAccount network\n\nARKK\n\nARKG\n\nHASI Sustainable energy co\n\nGRAF/WS to be Velodyne Lidar tech\n\nARKF",
        "created_utc": 1594216982,
        "id": "fxbar5w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594245782.0
    },
    {
        "author": "dbsp347",
        "body": "maybe ENPH and AOBC",
        "created_utc": 1594349451,
        "id": "fxhqoz1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594378251.0
    },
    {
        "author": "mightylfc",
        "body": "Sure, significant holdings include WCLD, NET, FSLY, NIO, SE, AMD, ENPH, LVGO, SQ, ARKK, ARKF, GAN, TTD and a bit of TQQQ.\n\nVery tech and healthcare heavy but my mindset is aggressive growth",
        "created_utc": 1594349485,
        "id": "fxhqqxd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594378285.0
    },
    {
        "author": "LACashFlow",
        "body": "ENPH - solid solar stock. Good play.",
        "created_utc": 1594827994,
        "id": "fy5k3ww",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594856794.0
    },
    {
        "author": "kidze",
        "body": "I like shop, ttd, enph, ma, sq, tsla, se, isrg\n\nThe rest is meh. But that’s my opinion.",
        "created_utc": 1594767028,
        "id": "fy34uzw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594795828.0
    },
    {
        "author": "AnAnonymousFool",
        "body": "I really like SE, ABBV, ENPH",
        "created_utc": 1594710598,
        "id": "fy0j8jy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594739398.0
    },
    {
        "author": "chickenfriedsandwich",
        "body": "Thought hard about buying ENPH during those allegations a few weeks back and didn't... Hindsight being 50/50 and all!",
        "created_utc": 1594770400,
        "id": "fy3at2j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594799200.0
    },
    {
        "author": "lloydgross24",
        "body": "I just mean bailing on stuff early or staying too late haha. \n\nI had Marvel calls today I sold for .25 that closed at .54 I think. I sold FSLR calls at like 1.20 two days ago and they went over $5 today. \n\nSold some ENPH calls at $3 (at least hung onto one)... It went up to 4.50 at one point. \n\nI then held on to SQ puts too long and lost most of the gains there. \n\nCLDR calls have murdered me until today. That's really the worst one ha. \n\nBut yeah that was the reasoning on BABA. The Chinese stocks are going nuts tho. I loaded up on some Tencent calls for August on the cheap. UOA on them too. Got a few other cheap ones too. Hoping for another big Chinese day tomorrow!",
        "created_utc": 1594252306,
        "id": "fxdb4tl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594281106.0
    },
    {
        "author": "_TheNorseman_",
        "body": "Sure thing. \n\nJust play it safe. I haven’t been investing long myself (close to 2 years) and my knowledge is still just a drop in the bucket. I started off like you, just jumping right in while investing in things I was 100% sure at the time would be wins. A few got me 20% gains... but I had far more that were -40% and as terrible as -70%. My first year resulted in losing far more than I gained, and therefore a net loss. Thankfully I only had a small amount of money in the game, so my losses weren’t something that put me in a financial crisis. That’s when I realized I need to focus more on “what will net me the highest chance of a positive return by the time I retire?” And for me the answer is ETFs, although I do have a few individual stocks (ENPH, AMD, DAL) but I only invested in them what I was comfortable with losing (and only invested in DAL when the pandemic hit and they had a massive dip), and not swinging for the fences. \n\nMoney in general is very important... a comfortable retirement should be the end goal, though... so don’t rush it.",
        "created_utc": 1594994097,
        "id": "fycy5lu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595022897.0
    },
    {
        "author": "lloydgross24",
        "body": "nah don't mess with penny stocks.\n\nOptions are the way in the volatility. They are risky for sure but you can do quite well if you are smart about it. And generally a bit more predictable based on patterns and valuations. \n\nENPH is a great example. Every time there is a dip, you can buy towards the bottom and it'll recover within a week. It keeps a trading range. AMD is another one. You can find a ton of stocks that bounce between trading ranges. \n\nBut you can also play them off unusual activity or around before expected news. \n\nAZN had around a 6% day yesterday. My options went up 176% since I got in a few days earlier before the IV spike. \n\nGot be careful with them tho and only trade with a certain position of your portfolio. I try to keep 10% or lower. Also make sure you fully understand them and know what you are doing. But most people stay away because they don't understand them... Even Warren Buffett uses options at times.",
        "created_utc": 1595105571,
        "id": "fyhvuqc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595134371.0
    },
    {
        "author": "1353-",
        "body": "ENPH begs to differ",
        "created_utc": 1595062143,
        "id": "fyg3q7v",
        "score": 1,
        "subreddit": "investing",
        "created": 1595090943.0
    },
    {
        "author": "phonefelloffacliff",
        "body": "New to this. \n\nENPH - 1 share \n\nVSLR - 1 share \n\nNIO - 2 shares \n\nSQ - 1 share \n\nTSLA - 0.2%",
        "created_utc": 1595046409,
        "id": "fyfmqkv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595075209.0
    },
    {
        "author": "ButchMFJones",
        "body": "Enphase ($ENPH) was the first stock I ever traded. Bought around $17, kept until 30s, sold when it dropped to $24. Pretty sure it's somewhere in the 50s now. You live and you learn.",
        "created_utc": 1594760450,
        "id": "fy2rsa0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594789250.0
    },
    {
        "author": "redditgod16",
        "body": "Take a look at evsi (ev charging), 1 billion company worth 46mill. They do more revenue and lose less money then blink (worth 160 bill). Also Enph, an easy 25 bill stock in 2-3 years",
        "created_utc": 1593880341,
        "id": "fwwz96n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593909141.0
    },
    {
        "author": "Rageoftheage",
        "body": "TSLA, HASI, NEP, BEP, AES, ORA, ENPH, SEDG, WKHS, SHLL, AYRO",
        "created_utc": 1593927852,
        "id": "fwz2r0q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593956652.0
    },
    {
        "author": "ragemind",
        "body": "fuck ENPH is really fucking me today. i guess people are over the fraud cases",
        "created_utc": 1594224512,
        "id": "fxbporl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594253312.0
    },
    {
        "author": "canadianfriesss",
        "body": "I strongly agree with the atz pick. Some others I like are:\n\nCanadian securities - flt, kxs, vff\n\nAmerican securties - dkng, enph",
        "created_utc": 1594174551,
        "id": "fx9sn3a",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1594203351.0
    },
    {
        "author": "Grunblau",
        "body": "With ENPH, I felt like someone I loved betrayed me and I was willing to take them back if they just promised to do better...  \n\nPeople in the industry really like their products compared to SEDG (Solar Edge) and believe that if the US has a change in leadership, solar and alternative energy will continue to pick up momentum.",
        "created_utc": 1593661006,
        "id": "fwnqn0c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593689806.0
    },
    {
        "author": "hotwingbias",
        "body": "ENPH",
        "created_utc": 1593695136,
        "id": "fwoww0a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593723936.0
    },
    {
        "author": "hughesmaxwell",
        "body": "Would never buy puts on TSLA, but would also never pay the current (and expanding) P/E multiple. Other clean energy plays also very expensive ENPH RUN",
        "created_utc": 1593956266,
        "id": "fwzwghm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593985066.0
    },
    {
        "author": "silverlink22",
        "body": "I told y’all human trafficking was bullish af. After ENPH burned me with that recovery, I said I’m not fucking with wayfair.",
        "created_utc": 1594660856,
        "id": "fxy4o40",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594689656.0
    },
    {
        "author": "goldengod518",
        "body": "WMT, AMZN, ENPH, UNFI, LMT, DIS",
        "created_utc": 1594701390,
        "id": "fy08b3s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594730190.0
    },
    {
        "author": "drnick5",
        "body": "I've mentioned this company a few times whenever solar is brought up. Don't look at the panels, look at the inverter companies. Of which its basically a duopoly of ENPH and SEDG. Every solar array needs an inverter, regardless of which brand panels (or solar roof) you use. If I remember correctly Solarege inverters are 99% efficient, and Enphase is only 97% with its microinverters. \n\nPersonally, my solar array has a Solaredge inverter, and its been great so far.",
        "created_utc": 1594776476,
        "id": "fy3l8tp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594805276.0
    },
    {
        "author": "Jigawattts",
        "body": "Enph is overvalued. CSIQ by far is the way to go.",
        "created_utc": 1594804572,
        "id": "fy4m19u",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594833372.0
    },
    {
        "author": "Vast_Cricket",
        "body": "enph",
        "created_utc": 1594924720,
        "id": "fya2cn8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594953520.0
    },
    {
        "author": "LeadingChallenge2",
        "body": "ENPH has been in my watch list. Isn’t it expensive at its current price?\n\nWhy SEDG?",
        "created_utc": 1594418397,
        "id": "fxkqce7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594447197.0
    },
    {
        "author": "lick_my_eye",
        "body": "this is a nice list!  I’m really curious about NKLA, though.  I’ve watched a lot of interviews with Milton and other presentations about the business model for this company.  I still am scratching my head on how this has a $15B market cap, zero sales and a handful of prototypes.  Plus a constantly evolving business model.  Every day, I am less and less impressed with the leadership at Nikola.  I’ve been wrong many times about stocks, so who knows, but with NKLA there appear to be many many red flags.\n\nFull disclosure, I am invested in tesla, but I’m always interested in renewable stocks and also own ENPH, NEE, BEP, NIO.  I also own hydrogen stocks like BLDP and PLUG because it seems like there is a big push toward hydrogen globally.\n\nI haven’t had a chance to look into SHLL, yet, but it sounds like they already EV trucks?",
        "created_utc": 1594434381,
        "id": "fxlhj41",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1594463181.0
    },
    {
        "author": "victorha1027",
        "body": "I bought the Facebook dip. Easy money. Wish I was aware enough for that tastier ENPH dip.",
        "created_utc": 1594364425,
        "id": "fxib5e8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594393225.0
    },
    {
        "author": "_TheNorseman_",
        "body": "I’m team ENPH.",
        "created_utc": 1594393995,
        "id": "fxjd6xa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594422795.0
    },
    {
        "author": "Klutzy_Hamster",
        "body": "SEDG/ENPH",
        "created_utc": 1595281042,
        "id": "fyp9nv4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595309842.0
    },
    {
        "author": "Bhawks489",
        "body": "I dont do twitter.\n\nI do feel that though, ive been pumping FSLY and ENPH last June. I should have went all out.\n\nI do think ENPH will be better than SEDG though.",
        "created_utc": 1595300070,
        "id": "fyq81ur",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1595328870.0
    },
    {
        "author": "Malamonga1",
        "body": "Good luck finding another ENPH again. ENPH was truly a unicorn penny stock with a product that is actually stellar (for residential purposes dare I say slightly better than SolarEdge). CLSK on the other hand, seems to be focusing on real time energy trading and optimization applications, which is a bit futuristic in my opinion. We won't have a strong need for that until much heavier renewable penetration, possibly 2030 (for California) or later (for other states in the East coast). Even in CA there is not a strong need for that yet. Academics at universities are just now starting to pay attention to the data analytics aspect of renewable.",
        "created_utc": 1595304656,
        "id": "fyqf6oj",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1595333456.0
    },
    {
        "author": "lloydgross24",
        "body": "Really hoping my CLDR calls print tomorrow. I've been holding out as long as I can. My portfolio has somehow managed to stay relatively flat the last 2 days despite losing 40% on those calls. Shout to AMD, VIAC, ENPH and a small RTX rally for keeping me from getting margin called.",
        "created_utc": 1593652740,
        "id": "fwnd100",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1593681540.0
    },
    {
        "author": "Bhawks489",
        "body": "Not a penny but ENPH should be just as good as SEDG. Probably an even better company",
        "created_utc": 1595010061,
        "id": "fyduj5c",
        "score": 0,
        "subreddit": "pennystocks",
        "created": 1595038861.0
    }
]