[
    {
        "author": "patrickbateman02",
        "body": "I see. I’d still buy leaps instead ok MS. KMI PAYX. UA. L. NS",
        "created_utc": 1590539542,
        "id": "frxglwz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1590568342.0
    },
    {
        "author": "Mxpx2002",
        "body": "You forgot the two biggest competitors - ADP and Paychex",
        "created_utc": 1588721787,
        "id": "fply8ec",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1588750587.0
    },
    {
        "author": "Kryogenic7",
        "body": "I have the same concerns about Exact and I'll take a look at Guardant. I'd rather buy PAYC too, but as a young person with little expendable income, the share price of PAYX is much more desirable. I tend to try an hold larger positions for the long-term. I guess I have my homework cut out for me. Thanks for giving your 2 cents.",
        "created_utc": 1589389900,
        "id": "fqi4eoz",
        "score": 1,
        "subreddit": "investing",
        "created": 1589418700.0
    },
    {
        "author": "cgar09",
        "body": "PAYX has done pretty well for me in terms of dividend growth and stock appreciation. \nKO's dividend is a lovely thing to get, but the stock price has gone mostly nowhere. \n\nI bought both around the same time in 2013 and am now getting over 5% yield on my original investment.",
        "created_utc": 1590857928,
        "id": "fsbl5yv",
        "score": 1,
        "subreddit": "investing",
        "created": 1590886728.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 11th of May\n\n\n\n## Upcoming events for Tuesday, May 12th\n\n - Stock splits:\n\n    - BTCWF @ **1:12**\n    - MICWF @ **1:2**\n\n - Expected earnings:\n\n  ACER, ADPT, AEYE, ALGT, ALLT, ALT, ARDS, BEST, BGFV, BHVN, BIOX, BLCM, BLRX, BNTX, BRG, BTAI, CATB, CCAP, CELH, CHFS, CHUY, CLPT, CLSK, CMBM, CNK, CNR, COHR, CPIX, CPLG, CRHM, CVLT, CVM, CYCC, CZNC, DNR, DT, DUK, DYNT, EDN, EGHT, EIDX, ELMD, ENT, ERJ, ETTX, EVRI, FCBC, FI, FLOW, FPH, FTEK, GBL, GECC, GEVO, GMDA, GMO, GOSS, GRPN, GSL, HCAT, HCR, HLI, HMC, HUD, HVT, I, INFN, IOTS, IR, ISR, ITRM, IX, KMDA, KMPH, KZR, LIFE, LIQT, LL, LOGC, MAC, METC, MFA, MGY, MIXT, MLCO, MOGO, MSC, MUX, NAT, NCNA, NEXA, NEXT, NOVT, NSPR, NTEC, NVST, NVUS, OCX, OLP, OPNT, OR, PAGS, PAM, PANL, PBPB, PEIX, PFMT, PGNY, PHIO, PIH, PTN, PUMP, RDCM, RDHL, REKR, RGS, RLJ, RLMD, ROSE, RRR, RVSB, RWLK, RXN, SGMS, SNGX, SOHO, SOLO, SPN, SSKN, SWAV, TAC, TAK, TCS, TELA, TESS, TEUM, TGEN, TH, TISI, TMDI, TPTX, TSQ, TUES, TUFN, VEC, VIR, VOD, VREX, VSH, VTSI, VYGR, WMGI, XELB, XENE, XP, ZAGG, ZSAN\n\n - Ex-div:\n\n  CCD, CGO, CHI, CHW, CPZ, CSQ, CURO, CXE, CXH, DCF, ED, ETFC, FDP, FOF, GLPI, HFWA, HOMB, INVH, JBGS, LDP, MCR, MIE, MIN, MINI, MKTX, MMT, NFBK, OGS, PSF, RA, RGP, RNP, RQI, SASR, SCCO, TTEK, UTF, WETF, WINA, WNEB, XLNX, XOM\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.782%)\n    - API Weekly Crude Oil Stock (previous: 8.400M)\n    - CPI (consensus: -0.7%, previous: -0.4%)\n    - CPI (consensus: 0.4%, previous: 1.5%)\n    - CPI Index, n.s.a. (consensus: 256.45, previous: 258.12)\n    - CPI Index, s.a (previous: 257.95)\n    - CPI, n.s.a (previous: -0.22%)\n    - Cleveland CPI (previous: 0.2%)\n    - Core CPI (consensus: -0.2%, previous: -0.1%)\n    - Core CPI (consensus: 1.7%, previous: 2.1%)\n    - Core CPI Index (previous: 266.80)\n    - FOMC Member Harker Speaks\n    - FOMC Member Mester Speaks\n    - FOMC Member Quarles Speaks\n    - Federal Budget Balance (consensus: -747.5B, previous: -119.0B)\n    - NFIB Small Business Optimism (previous: 96.4)\n    - Real Earnings (previous: 0.2%)\n    - Redbook (previous: -12.6%)\n    - Redbook (previous: -9.3%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, May 13th\n\n - Expected earnings:\n\n  ADVM, AGTC, ALLK, ALNA, ALRN, ARCO, ATHM, AVGR, AXU, BHR, BLU, BRP, CBD, CHK, CHRA, CNFR, CORR, CORV, CSCO, CYBR, CYRN, DMAC, EDAP, EDSA, EFOI, EVOK, EYEN, EZPW, FLL, FLO, FNJN, FOSL, FULC, GRP.U, HALL, HCAP, HHS, ITRN, JACK, JAX, JMIA, KLR, LINC, LUMO, MCF, MNRL, MSGS, NK, NMM, NTWK, NVGS, OII, ONEM, OSW, PCOM, PDSB, PGTI, PNTG, PRTH, PTI, QES, QMCO, RCL, RCMT, RKDA, RMED, RVLV, SCPH, SCYX, SDC, SDGR, SMTS, SNE, STE, TARA, TCON, TGI, TLC, TM, TPCO, TRWH, TSEM, VERU, VIE, VRTU, WLL, WTI, ZYNE\n\n - Ex-div:\n\n  ADS, AMAL, APOG, ASTE, BSM, COG, COLB, DBL, DEA, DLY, DRE, DSL, ETN, FANG, GDV, GNT, GUT, HTGC, IVH, LBC, LEO, OXLC, OXSQ, RMD, SPB, TBNK, UVE, V, VLO, VNOM, WEC\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.325%)\n    - Core PPI (consensus: 0.0%, previous: 0.2%)\n    - Core PPI (consensus: 0.9%, previous: 1.4%)\n    - Crude Oil Imports (previous: 0.166M)\n    - Crude Oil Inventories (previous: 4.590M)\n    - Cushing Crude Oil Inventories (previous: 2.068M)\n    - Distillate Fuel Production (previous: 0.100M)\n    - EIA Refinery Crude Runs  (previous: 0.215M)\n    - EIA Weekly Distillates Stocks (consensus: 2.900M, previous: 9.518M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.9%)\n    - Gasoline Inventories (consensus: 0.043M, previous: -3.158M)\n    - Gasoline Production (previous: -0.030M)\n    - Heating Oil Stockpiles (previous: 0.598M)\n    - MBA 30-Year Mortgage Rate (previous: 3.40%)\n    - MBA Mortgage Applications (previous: 0.1%)\n    - MBA Purchase Index (previous: 220.0)\n    - Mortgage Refinance Index (previous: 3,835.7)\n    - OPEC Monthly Report\n    - PPI (consensus: -0.2%, previous: 0.7%)\n    - PPI (consensus: -0.5%, previous: -0.2%)\n    - Seevol Cushing Storage Report (previous: 2.850M)\n    - Thomson Reuters IPSOS PCSI (previous: 47.77)\n\n## Upcoming events for Thursday, May 14th\n\n - Expected earnings:\n\n  ACB, ACHV, ADAP, ADMP, AG, ALPN, AMAT, AMC, APTX, APVO, AUPH, AYTU, AZUL, BAK, BAM, BBAR, BGNE, BLBD, BLFS, BLPH, BMA, BNGO, BXRX, CAAS, CARE, CCEP, CDR, CDTX, CDZI, CIR, CLUB, CSSE, CSU, CTEK, CVET, CVIA, CVTI, DARE, DENN, DFFN, DSX, DYAI, ECOR, EMAN, EQM, ETM, ETON, ETRN, FENC, FET, FGBI, FSCT, FSM, FTCH, FUV, GDS, GEN, GGAL, GLMD, GLOB, GRWG, GTIM, HBB, HBM, HOLI, HOOK, HTGM, HYRE, IMV, INMB, INWK, IRCP, IZEA, JAKK, KDMN, KEM, LCUT, LLEX, LOMA, LTRX, MARK, MESA, MOTS, MRKR, MTBC, NAVB, NCLH, NDRA, NEWR, NLOK, NOVA, NRBO, NVMI, NXE, ONTX, OPRT, OSMT, OSS, PBR, PHAS, PHI, PRCP, PRTY, PWFL, REDU, REV, RGLS, RMTI, SANW, SCU, SENS, SHSP, SILV, SLGG, SOLY, SPNS, SSRM, SSYS, STKS, SURF, TBIO, TEO, THMO, TRXC, UEPS, UFAB, VBLT, VERO, VFF, VIVE, VNET, VTNR, VVI, VXRT, WIX, WNC, WYY, XBIT, XELA, XPEL, YPF, YTEN, ZEAL, ZFGN\n\n - Ex-div:\n\n  AFT, AGCO, AHC, AIF, AIT, AIV, AJX, ALE, APAM, ARCB, AVK, AWR, BAF, BBF, BBK, BBN, BCX, BDJ, BFK, BFO, BFST, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BKK, BLE, BLW, BME, BMEZ, BNY, BOE, BPRN, BQH, BRKL, BSD, BSE, BSET, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, BZM, CC, CF, CGNX, CHCT, CHD, CII, CLCT, CLDB, CMS, CORR, CPSI, CSL, CSTR, CTVA, EBMT, EDF, EDI, EGF, EML, EMR, ENB, EQNR, EVA, EXC, FCFS, FDEF, FINS, FIX, FMO, FNHC, FNWB, FRA, FSB, FSS, FTAI, FTS, GBAB, GCBC, GGM, GHY, GIM, GOF, GRC, GSK, GWB, GWRS, HCHC, HCI, HNI, HON, HR, HTH, HTLF, HYT, IHIT, ISD, JBL, JCO, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LLY, LNN, LPX, MCA, MEN, MHD, MMD, MMS, MNE, MNR, MSBI, MSCI, MSEX, MSVB, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NXST, NYV, NZF, OBNK, ODC, OPP, OPY, OSK, OTTR, PAYX, PCF, PCSB, PETS, PFS, PGZ, POOL, RDS.A, RDS.B, RFM, RIV, RMI, RMM, RSF, RTX, SAL, SBR, SHBI, SJM, SJR, SMBC, SSBI, SWX, SZC, TAIT, TCF, TEI, TFC, TFX, TSBK, UL, UMH, UN, UTL, VBF, VTA, VVR, WAL, WHR, WTRG, XEC, XFLT\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.095%)\n    - 8-Week Bill Auction (previous: 0.110%)\n    - Continuing Jobless Claims (consensus: 25,100K, previous: 22,647K)\n    - Export Price Index (consensus: -2.1%, previous: -1.6%)\n    - Import Price Index (consensus: -3.1%, previous: -2.3%)\n    - Initial Jobless Claims (consensus: 2,500K, previous: 3,169K)\n    - Jobless Claims 4-Week Avg. (previous: 4,173.50K)\n    - Natural Gas Storage (previous: 109B)\n\n^^^^2020-05-11",
        "created_utc": 1589197349,
        "id": "fq9gbd6",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1589226149.0
    },
    {
        "author": "dvdmovie1",
        "body": "1. I'd rather suggest you invest in these than airlines and entertainment.\n\n2. Exact held up worse than I thought during this and saw a significant decline in Cologuard sales. A decline is understandable, but I think I was a little surprised to the extent of the decline/how not well this held up vs something like Guardant (GH) - not an apples-to-apples comparison, obviously but kind of interesting.  I think Exact will do fine over time, but all I'm saying is that how not well it did during this is perhaps something to keep in mind.\n\n3. I'd rather PAYC than PAYX but PAYX is fine.\n\n4. Never heard of SNX",
        "created_utc": 1589359021,
        "id": "fqgvypx",
        "score": 1,
        "subreddit": "investing",
        "created": 1589387821.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 13th of May\n\n\n\n## Upcoming events for Thursday, May 14th\n\n - Expected earnings:\n\n  ACB, ACHV, ADAP, ADMP, AEYE, AG, AHT, AINC, ALPN, ALT, ALTG, AMAT, AMC, APTX, APVO, AUPH, AYTU, AZUL, BAK, BAM, BBAR, BLBD, BLFS, BMA, BNGO, BPTH, CAAS, CARE, CCEP, CDR, CDTX, CIR, CLSN, CLUB, CRC, CSSE, CTEK, CVET, CVIA, CVTI, DARE, DENN, DSX, DYAI, EAST, ECOR, EMAN, EQM, ETM, ETON, ETRN, FENC, FGBI, FLR, FTCH, FUV, GDS, GEN, GERN, GGAL, GLMD, GLOB, GRWG, GTIM, HBB, HBM, HHS, HOLI, HOOK, HTGM, HYRE, IMV, INMB, INWK, IRCP, IZEA, KEM, KLDO, LLEX, LOMA, LTRX, MARK, MDP, MLCO, MOTS, MTBC, NAVB, NCLH, NDRA, NEWR, NICE, NLOK, NOVA, NRBO, NVMI, ONTX, OPRT, OSS, PBR, PEI, PHAS, PRCP, PRTY, PWFL, REDU, RGLS, RTIX, SANW, SENS, SHSP, SILV, SLGG, SLGL, SLRX, SOLY, SPNS, SSRM, SSYS, SURF, TEO, TFFP, THMO, TRXC, UEPS, UFAB, UNT, VBLT, VERO, VFF, VIVE, VNET, VTNR, VVI, VXRT, WIX, WNC, WYY, XBIT, XELA, XPEL, YTEN, ZEAL\n\n - Ex-div:\n\n  AFT, AGCO, AHC, AIF, AIT, AIV, AJX, ALE, APAM, ARCB, AVK, AWR, BAF, BBF, BBK, BBN, BCX, BDJ, BFK, BFO, BFST, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BKK, BLE, BLW, BME, BMEZ, BNY, BOE, BPRN, BQH, BRKL, BSD, BSE, BSET, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, BZM, CC, CF, CGNX, CHCT, CHD, CII, CLCT, CLDB, CMS, CORR, CPSI, CSL, CSTR, CTVA, DUK, EBMT, EDF, EDI, EGF, EML, EMR, ENB, EQNR, EVA, EXC, FCFS, FDEF, FINS, FIX, FMO, FNHC, FNWB, FRA, FSB, FSS, FTAI, FTS, GBAB, GCBC, GGM, GHY, GIM, GOF, GRC, GSK, GWB, GWRS, HCHC, HCI, HNI, HON, HR, HTH, HTLF, HYT, IEX, IHIT, ISD, JBL, JCO, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LLY, LNN, LPX, MCA, MEN, MHD, MMD, MMS, MNE, MNR, MSBI, MSCI, MSEX, MSVB, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NXST, NYV, NZF, OBNK, ODC, OPP, OPY, OSK, OTTR, PAYX, PCF, PCSB, PETS, PFS, PGZ, POOL, RDS.A, RDS.B, RFM, RIV, RMI, RMM, RSF, RTX, SAL, SBR, SHBI, SJM, SJR, SMBC, SSBI, SWX, SZC, TAIT, TCF, TEI, TFC, TFX, TSBK, UL, UMH, UN, UTL, VBF, VTA, VVR, WAL, WHR, WTRG, XEC, XFLT\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.095%)\n    - 8-Week Bill Auction (previous: 0.110%)\n    - Continuing Jobless Claims (consensus: 25,100K, previous: 22,647K)\n    - Export Price Index (consensus: -2.1%, previous: -1.6%)\n    - FOMC Member Kaplan Speaks\n    - FOMC Member Kashkari Speaks\n    - Import Price Index (consensus: -3.1%, previous: -2.3%)\n    - Initial Jobless Claims (consensus: 2,500K, previous: 3,169K)\n    - Jobless Claims 4-Week Avg. (previous: 4,173.50K)\n    - Natural Gas Storage (previous: 109B)\n\n## Upcoming events for Friday, May 15th\n\n - Expected earnings:\n\n  AIRI, ATNM, CBPO, CFRX, CTK, CYD, DKNG, DTIL, FSI, GVA, GWGH, IMVT, JD, LX, MAG, NMTR, NVIV, PBF, PBFX, PFHD, PLXP, SIC, STML, TGS, TGTX, TRCH, UTSI, VFC, XBIO\n\n - Ex-div:\n\n  ABC, ADX, ALSN, AMGN, AMP, APO, BCO, BG, BKH, BWFG, BWXT, CNA, CNS, CVI, DLB, DLX, EEA, GF, GLOG, GLOP, GNK, HIW, IOSP, JEF, JHG, KKR, KLAC, KMPR, MUR, NATI, NCMI, NVEC, PEO, PFLT, PFSI, PSX, R, RCII, REG, RGR, ROK, RTLR, SBRA, SIGI, SMM, SO, SPAR, STK, TIPT, TROX, UI, VCIF, WSTG, WWD\n\n - Economic events and announcements:\n\n    - Business Inventories (consensus: -0.2%, previous: -0.4%)\n    - CFTC Aluminium speculative net positions (previous: 79.7K)\n    - CFTC Copper speculative net positions (previous: -16.8K)\n    - CFTC Corn speculative net positions (previous: -118.4K)\n    - CFTC Crude Oil speculative net positions (previous: 589.4K)\n    - CFTC Gold speculative net positions (previous: 262.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 11.0K)\n    - CFTC Natural Gas speculative net positions (previous: -49.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -192.7K)\n    - CFTC Silver speculative net positions (previous: 25.5K)\n    - CFTC Soybeans speculative net positions (previous: 76.6K)\n    - CFTC Wheat speculative net positions (previous: 20.2K)\n    - Capacity Utilization Rate (consensus: 64.0%, previous: 72.7%)\n    - Core Retail Sales (consensus: -8.6%, previous: -4.2%)\n    - Industrial Production (consensus: -11.5%, previous: -5.4%)\n    - Industrial Production (previous: -5.49%)\n    - JOLTs Job Openings (previous: 6.882M)\n    - Manufacturing Production (consensus: -13.0%, previous: -6.3%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.50%)\n    - Michigan Consumer Expectations (consensus: 71.8, previous: 70.1)\n    - Michigan Consumer Sentiment (consensus: 68.0, previous: 71.8)\n    - Michigan Current Conditions (consensus: 75.0, previous: 74.3)\n    - Michigan Inflation Expectations (previous: 2.1%)\n    - NY Empire State Manufacturing Index (consensus: -63.50, previous: -78.20)\n    - Overall Net Capital Flow (previous: -13.40B)\n    - Retail Control (consensus: -4.6%, previous: 2.0%)\n    - Retail Inventories Ex Auto (previous: -1.3%)\n    - Retail Sales (consensus: -12.0%, previous: -8.4%)\n    - Retail Sales (previous: -5.80%)\n    - Retail Sales Ex Gas/Autos (previous: -2.8%)\n    - TIC Net Long-Term Transactions (previous: 49.4B)\n    - TIC Net Long-Term Transactions including Swaps (previous: 24.70B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 292)\n    - U.S. Baker Hughes Total Rig Count (previous: 374)\n    - US Foreign Buying, T-bonds (previous: 4.90B)\n\n^^^^2020-05-13",
        "created_utc": 1589364020,
        "id": "fqh0xjc",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1589392820.0
    },
    {
        "author": "mac_the_man",
        "body": "PAYX.",
        "created_utc": 1590856298,
        "id": "fsbh2pw",
        "score": 1,
        "subreddit": "investing",
        "created": 1590885098.0
    },
    {
        "author": "GrilledByWeber",
        "body": "So short $PAYX got it",
        "created_utc": 1588981001,
        "id": "fpxeamx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589009801.0
    },
    {
        "author": "Duc_of_hazzard",
        "body": "Couldn’t agree with your strategy more. Now is the time to look at the more cyclical end of the market, which has been absolutely pummeled. \n\n$SYY\n$LEG\n$SYF\n$PAYX\n$RHP\n$SNA\n$ULTA\n$JPM\n\nEtc.",
        "created_utc": 1589734162,
        "id": "fqxlj7q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1589762962.0
    }
]