[
    {
        "author": "svpvv",
        "body": "And how long until Data centers moves to ARM? They are always cognizant about how much power they consume. While I agree that ARM =/= x86, but at the end of the day they perform the same function so it is just a matter of time before one of them is established as a clear winner.",
        "created_utc": 1600214102,
        "id": "g5f2qig",
        "permalink": "/r/stocks/comments/ite63k/aapl_reveals_5nm_chip_with_a14_processor/g5f2qig/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600242902.0
    },
    {
        "author": "redblade79",
        "body": "It’s all about learning man! The fact you are cognizant of this means you’ll do well. I can give you so many examples of people our age who don’t even know what a 401k is. \n\nThis one girl I work with is about your age and one day we started talking about 401ks and she said that she wasn’t contributing anything - not even the minimum to get a match. I asked why and she said it was because she couldn’t afford it. That would be understandable except she took not 1 but 2 trips around the world last year. I think she went to Morocco and then to Indonesia on the other trip. Oh and she’s going to the Caribbean in a few weeks for another trip. \n\nThe point is that there’s a lot of idiots out there and just because you lost money doesn’t make you one. You are leaps and bounds ahead of your colleagues bro.",
        "created_utc": 1599608642,
        "id": "g4htrkz",
        "permalink": "/r/wallstreetbets/comments/ip2w12/help_me_down_95_all_time_70_just_today/g4htrkz/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599637442.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Told you idiots to sell RKT before earnings. Why aren't any of you cognizant that the run up before earnings is pricing in good results? Yeah you may have the 1 or 2 that run up before earrings and still shoot up after earnings, but that's really rare.",
        "created_utc": 1599077448,
        "id": "g3rhdio",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rhdio/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599106248.0
    },
    {
        "author": "Baraxton",
        "body": "In the context of trading options, it’s important to have dry powder available, especially when entering credit positions. \n\nFor instance back in March I was selling OTM cash secured puts on a number of companies, but was cognizant to maintain enough cash to either adjust in the event of a further decline, or to take assignment. \n\nTo be clear, I’m talking in the context of managing an option portfolio, not an investment portfolio or ROTH IRA.",
        "created_utc": 1599409199,
        "id": "g48s4xf",
        "permalink": "/r/options/comments/in7r1n/rules_of_risk_management/g48s4xf/",
        "score": 1,
        "subreddit": "options",
        "created": 1599437999.0
    },
    {
        "author": "supercoolguy__69",
        "body": "People probably want to punch you in the face all the time but you’re too retarded to be cognizant of it.",
        "created_utc": 1599141706,
        "id": "g3uh0jl",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3uh0jl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599170506.0
    },
    {
        "author": "All_I_Eat_Is_Gucci",
        "body": "Did those scientists attend the Zimbabwe Institute of Sciencology? Every single other person I know with a background in the physical sciences is very much cognizant of the necessity of masks, social distancing measures, and proper lockdown measures.",
        "created_utc": 1601369029,
        "id": "g71jcjq",
        "permalink": "/r/wallstreetbets/comments/j1jqk5/what_are_your_moves_tomorrow_september_29_2020/g71jcjq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601397829.0
    },
    {
        "author": "UnplayableConundrum",
        "body": "yeah I was wondering if its british vs american spelling, I gotta be more cognizant of that on the good ole world wide web.",
        "created_utc": 1601041947,
        "id": "g6j9a1o",
        "permalink": "/r/wallstreetbets/comments/izgxsw/daily_discussion_thread_for_september_25_2020/g6j9a1o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601070747.0
    },
    {
        "author": "_hi_",
        "body": "It works, but you have to be sure you're disciplined enough to not start moving your stops, or taking on more size etc.   \n\n\nBasically do not average into positions unless you already know at what levels you want to partake in, and at what point you're thesis is wrong.   \n\n\nYou'll keep convincing yourself that it's just extending a bit further than you initially thought, so if you just slightly adjust a stop.... you get the point. It snowballs and the more you fucking lose money and discipline the more you want to double down on the exact same trap that got you there in the first place.   \n\n\nSometimes you'll get lucky and think to yourself, whew that was a close one. It only takes that one time for you to not be lucky and game fucking over.   \n\n\nBlew up 20k in 2017 back when that amount was still soul crushing to me. Had to stop trading for a while after that. 3 years later I've made up those loses and then some, but that lesson stuck. I still find myself sliding into that trap, but at least now I'm cognizant of the risks.",
        "created_utc": 1599780017,
        "id": "g4rnouq",
        "permalink": "/r/wallstreetbets/comments/iqb5ey/what_are_your_moves_tomorrow_september_11_2020/g4rnouq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599808817.0
    },
    {
        "author": "LoveBackwardsIsEvil",
        "body": "Q1 2021 revenue guidance is also down from this quarter. The big trend all investors (for both Canada and US) should be cognizant of is the effect of price compression on top line revenues. \n\nAurora is selling a lot more cannabis, but decrease in sales price is weighing down revenues. \n\n&gt; Consumer cannabis net revenue1 was $35.3 million, a decrease of 9% over the previous quarter. **Total volume of dried consumer cannabis sold increased by 36%, but was offset by a 30% decrease in the average net selling price per gram** of consumer cannabis1 as the Company's value segment brand, Daily Special, accounted for a greater percentage of consumer cannabis net revenue, at 62% of flower revenue compared to 35% in the prior quarter. Consumer cannabis extract net revenue decreased by $1.5 million as compared to the prior quarter driven primarily by a loss of market share for vaporizer products.\n\nOverall, this is another ugly \"progress\" quarter from a company that was on the brink of distress. Looks like they will make it in the long run, but I can't help but think these guys will merge with TLRY/APHA/CRON.",
        "created_utc": 1600808108,
        "id": "g693wsv",
        "permalink": "/r/weedstocks/comments/ixvo6h/aurora_cannabis_announces_fiscal_fourth_quarter/g693wsv/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1600836908.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "permalink": "/r/wallstreetbets/comments/itw74x/thread_to_throw_off_the_algos_fuck_wall_street/g5irhtl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "jsboutin",
        "body": "I kinda agree with you. I actually think society is too mad too often and that's why we are having so many public problems today.\n\nWhile it's great that people are cognizant of what's going on in the world and can articulate an opinion, it's really not healthy to feel outrage on a daily basis.",
        "created_utc": 1600526293,
        "id": "g5till4",
        "permalink": "/r/stocks/comments/ivrimz/netflix_cancellations_surge_materially_in_the/g5till4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600555093.0
    },
    {
        "author": "WestWorld_",
        "body": "Cognizant*",
        "created_utc": 1601345812,
        "id": "g70qyit",
        "permalink": "/r/wallstreetbets/comments/j1mhy1/seems_legit/g70qyit/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601374612.0
    },
    {
        "author": "Moostucky_Stank",
        "body": "This half Martian half gremlin has cost me so much damn money over the years. Sell NVAX! They don’t make any money!  Don’t buy Cognizant!  Buy Satyam!  But Motient Technologies!  This cueball batboy wannabe shouldn’t be calling anyone crazy.",
        "created_utc": 1600266757,
        "id": "g5h2ru1",
        "permalink": "/r/wallstreetbets/comments/ite3i3/kramer_calls_nancy_pelosi_crazy_during_live/g5h2ru1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600295557.0
    }
]