[
    {
        "author": "Empyrius",
        "body": "None of the above.  Fidelity.",
        "created_utc": 1578149911,
        "id": "fd2ny6c",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd2ny6c/",
        "score": 97,
        "subreddit": "investing",
        "created": 1578178711.0
    },
    {
        "author": "thebabaghanoush",
        "body": "My buddy and I were just comparing Vanguard and Fidelity's Total Market Funds and laughing at how absurdly low the fees have gotten. \n\n0.04% for Vanguard and 0.015% for Fidelity. That's just silky.",
        "created_utc": 1577993704,
        "id": "fcv370m",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcv370m/",
        "score": 58,
        "subreddit": "investing",
        "created": 1578022504.0
    },
    {
        "author": "swerve408",
        "body": "Fidelity. Vanguards interface is god awful",
        "created_utc": 1578151588,
        "id": "fd2tsvq",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd2tsvq/",
        "score": 50,
        "subreddit": "investing",
        "created": 1578180388.0
    },
    {
        "author": "CaezarVII",
        "body": "Strictly as a broker:\n\n1. Fidelity is the best all round broker by a small margin because you get cash on your sweep account without having to manually move into money market. Vanguard also pays cash (more than Fidelity) on their sweep accounts but Vanguard is lacking in the technology department as far as their app and web platform so I prefer Fidelity.\n2. Most of the other brokers don't really have enough differentiating factors in my opinion to say one is \"better\" than another. Vanguard is great, but their technology is lacking. Between the others, they all have easy to use apps and websites. Etrade, Schwab, and Ally tend to have the better website platforms and highly rated Android and iPhone apps. IBKR and possibly TD Ameritrade are good for advanced traders. If you don't go with fidelity, I would literally just choose based on which app or web platform you like the most.\n\nBroker plus other banking services:\n\n* The Fidelity rewards 2% cashback credit card is good enough to serve as a primary credit card. For this reason, combining your broker and credit card platform both at Fidelity for simplicity is a good option. Fidelity also offers a checking account with fee free/reimbursed ATM usage but their checking account platform is not as good as Schwab or BoA.\n* Schwab is a great all round broker. Although they do not pay cash on sweep accounts, their easy to use and fee free/reimbursed checking accounts make up for it. I personally use Schwab for brokerage and checking (and an Amex credit card).\n* Ally Invest should be way more popular than it is. Their saving account rates speak for themselves so combining Ally savings/checking/brokerage accounts is a win win win situation. Their web platform for brokerage is also excellent and might be my favorite overall. They also have a large ATM network and will reimburse up to $10 in ATM fees per month.\n* Etrade offers a checking account with unlimited free ATM usage and fee reimbursement and a competitive rate Savings account. Etrade's offerings are very similar to Ally Invest in my opinion. I don't know how one would choose between the two except that I like Ally's website and app more. With things changing so quickly at brokers right now, I'm not sure that Ally Invest, or especially Etrade, are sustainable. I could see Etrade being acquired very soon. This is another reason why I stick with Schwab.\n* Merrill Edge combined with their Preferred Rewards program is excellent and if you have enough assets with them you get up to 5.25% cash back on a no annual fee credit card for a category of your choice, 3.5% cash back on groceries, and 1.75% cashback on everything else. You really can't beat this. If you have enough assets with BoA/Merrile Edge, you also get unlimited ATM fee free/reimbursed.\n* Chase YouInvest is a decent platform but it feels really new and not fully fleshed out. They only added options trading a few months ago I believe and they definitely have the most basic platform being only a couple notches above Robinhood as far as features which can be a good and bad thing since it is pretty simple to use. Now that they have options trading, I would recommend Chase YouInvest, especially if you are going to combine your assets at Chase. Like BoA Merrill Edge, you have to have a certain amount of assets with Chase to get fee free ATM usage with reimbursement.\n* TD Ameritrade is a great brokers with nothing much to offer by way of banking features or their own investment products. Because of this I am not surprised that TD was acquired. They have an advanced trading platform but I'm not sure that it's worth it since they have below average app reviews on Android. I basically use my phone for everything and so the app is really important to me. For these reasons TD Ameritrade didn't really stand out to me.\n\n\\*\\*One other caveat....if you trade inverse and leveraged ETFs such as UVXY or TQQQ, respectively, certain brokers do not allow trading of these securities. Vanguard and Chase do not allow trading of either. Merrill Edge does not allow trading of inverse ETFs. If not for this I would probably be with Merrill Edge in order to get the 5.25% cashback credit card or Chase to utilize their credit cards and checking account. I know Fidelity and Schwab allow trading of either leveraged or inverse ETFs, but I am not sure about the other brokers.\n\n\\*\\*\\*I have personally used Vanguard, Fidelity, Schwab, and Chase YouInvest extensively. I have experimented with Merrill Edge, Ally Invest, and Etrade.",
        "created_utc": 1578168250,
        "id": "fd4k6ob",
        "permalink": "/r/investing/comments/ejzcgv/what_is_the_best_brokerage_to_use/fd4k6ob/",
        "score": 49,
        "subreddit": "investing",
        "created": 1578197050.0
    },
    {
        "author": "ja1484",
        "body": "Still Vanguard. Still dat ownership structure.\n\nI hold my HSA at Fidelity because Vanguard doesn't offer them in-house.",
        "created_utc": 1578145655,
        "id": "fd2dite",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd2dite/",
        "score": 45,
        "subreddit": "investing",
        "created": 1578174455.0
    },
    {
        "author": "HODL_monk",
        "body": "Buying what is hot, and owning mostly stocks in a singe sector are the big failings, because you will naturally tend to buy high and sell in a long downtrend, when you doubt your choices. This is why the vast majority of individual investors lose money, or don't match the index, in individual stocks.\n\nTip - buy FZROX, Fidelity zero total stock market index fund, take ALL your costs to 0, and then don't look at it. This is pretty much the only investment choice tip you need. It might also make sense to set up a Roth IRA for retirement savings, and buy this in the Roth, for tax avoidance, but if you don't sell this fund, taxes will be very low, even in a taxable account.",
        "created_utc": 1578173445,
        "id": "fd51xzh",
        "permalink": "/r/investing/comments/ejyye9/what_was_your_path_in_learning_about_the_stock/fd51xzh/",
        "score": 41,
        "subreddit": "investing",
        "created": 1578202245.0
    },
    {
        "author": "yoloJMIA",
        "body": "After ending the year with a solid 35% loss, I've decided to move all my assets over to Fidelity from Robinhood and will become a buy and hold investor, selling covered calls. I refuse to become a -99% autist. I will continue to lurk because let's be honest this sub is hilarious. God speed my friends.",
        "created_utc": 1578101297,
        "id": "fczhe0x",
        "permalink": "/r/wallstreetbets/comments/ejnadw/weekend_discussion_thread_january_35_2020/fczhe0x/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1578130097.0
    },
    {
        "author": "jusremward",
        "body": "It’s like paying for shipping who the fuck does that? Just kidding I use Fidelity.",
        "created_utc": 1578978547,
        "id": "fecnr48",
        "permalink": "/r/wallstreetbets/comments/eofkdu/does_anyone_here_have_experience_using_grindr_as/fecnr48/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1579007347.0
    },
    {
        "author": "mervinj7",
        "body": "Fidelity but most of my investments are in Vanguard funds. Best of all worlds.",
        "created_utc": 1578149612,
        "id": "fd2n6ip",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd2n6ip/",
        "score": 24,
        "subreddit": "investing",
        "created": 1578178412.0
    },
    {
        "author": "irapedbinladenama",
        "body": "I use fidelity for my investment account and my inherited ira. My rollover traditional ira and Roth IRA are being managed by a Lincoln financial advisor.\n\nI agree that vanguard needs to revamp their site. That’s a main reason why I’m at Fidelity",
        "created_utc": 1578144827,
        "id": "fd2blfh",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd2blfh/",
        "score": 21,
        "subreddit": "investing",
        "created": 1578173627.0
    },
    {
        "author": "waltwhitman83",
        "body": "i switched to fidelity because it was easier to dollar cost average for a backdoor roth IRA\n\ni wanted to start january 1st, 2020 with $500/mo contributions each month, but you can’t do this in vanguard because you need to purchase $3k of the admiral fund before you can set up auto-contributions and their system doesn’t acknowledge that i already held more than $3k of the fund (because i had to sweep it from one account to the other)",
        "created_utc": 1578154824,
        "id": "fd359rq",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd359rq/",
        "score": 21,
        "subreddit": "investing",
        "created": 1578183624.0
    },
    {
        "author": "Visvism",
        "body": "Fidelity. My employer uses Fidelity so I keep all my business with them now. They offer quite a lot of services and the website and mobile app are actually useful. My products:  \n  \n- Brokerage\n- 401k (traditional and Roth)\n- Roth IRA\n- CMA\n- HSA\n- Employee Stock Purchase Program\n- Credit card",
        "created_utc": 1578154391,
        "id": "fd33icz",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd33icz/",
        "score": 19,
        "subreddit": "investing",
        "created": 1578183191.0
    },
    {
        "author": "Ryan_Alan",
        "body": "Agreed, Fidelity is the best brokerage I’ve tried. Easy to use, great app, and can also hold my HSA and 401k. \n\nI foolishly took the $750 and switched from Fidelity to Chase last March for most of my equity. Need to move back, but its such a pain switching!",
        "created_utc": 1578158857,
        "id": "fd3j8np",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd3j8np/",
        "score": 15,
        "subreddit": "investing",
        "created": 1578187657.0
    },
    {
        "author": "Bernie_Flanderstein",
        "body": "What u/NicksIdeaEngine said.\n\nAlso - if looking for free stock trading; Ally, Schwab, Fidelity - and also received an email this morning that Vanguard is now doing free stock trades.\n\nFor options, they're all pretty close $0.50 to $.65 per contract.  Pretty negligible considering how much RH can cost you by just failing.",
        "created_utc": 1578072495,
        "id": "fcxz9x6",
        "permalink": "/r/RobinHood/comments/ejggcw/i_just_took_a_15_loss_because_the_app_did_not/fcxz9x6/",
        "score": 14,
        "subreddit": "RobinHood",
        "created": 1578101295.0
    },
    {
        "author": "ocr_foodie",
        "body": "I use Fidelity too since my company's 401k is through that. Additionally, I figured I'd open up a Roth IRA along with it. So much easier to have everything consolidated in one place.",
        "created_utc": 1578164736,
        "id": "fd462pv",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd462pv/",
        "score": 13,
        "subreddit": "investing",
        "created": 1578193536.0
    },
    {
        "author": "Callingoutsince2019",
        "body": "I have tried multiple E*TRADE, tastyworks, fidelity, etc. nothing close to RH’s interface\nEdit: Tried Webull and moomoo as well, back to RH",
        "created_utc": 1578082447,
        "id": "fcylxri",
        "permalink": "/r/options/comments/ejk3e8/is_there_another_platform_with_a_simplified/fcylxri/",
        "score": 12,
        "subreddit": "options",
        "created": 1578111247.0
    },
    {
        "author": "penny_squeaks",
        "body": "I have all my accounts at Fidelity and have been happy with the decision. 401k, IRA, HSA, brokerage, checking (free ATMs), credit card (flat 2% cash back).",
        "created_utc": 1578160750,
        "id": "fd3q8sz",
        "permalink": "/r/investing/comments/ejzcgv/what_is_the_best_brokerage_to_use/fd3q8sz/",
        "score": 11,
        "subreddit": "investing",
        "created": 1578189550.0
    },
    {
        "author": "arbitrageisfreemoney",
        "body": "Fidelity has killer fills. They always save me money every single time I make a trade. I have 3 IRAs and 2 529s and a brokerage account with them and am not going anywhere",
        "created_utc": 1578166813,
        "id": "fd4ee8a",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd4ee8a/",
        "score": 11,
        "subreddit": "investing",
        "created": 1578195613.0
    },
    {
        "author": "YellowShirtDay",
        "body": "Fidelity already hit zero for mutual fund expense ratios. There's disadvantages to those funds though. \n\nhttps://www.personalfinanceclub.com/fzrox-vs-vtsax-the-hidden-cost-of-fidelitys-zero-fee-index-funds/",
        "created_utc": 1578022464,
        "id": "fcwcv18",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcwcv18/",
        "score": 11,
        "subreddit": "investing",
        "created": 1578051264.0
    },
    {
        "author": "RichTannins",
        "body": "Likely just being conservative funds. I was actually going to start a discussion today on what most do fund-wise for 529, as I just opened one last week and it isn’t often discussed here. I went with Fidelity and the NH aggressive portfolio (divorced, daughter lives in FL and I am in PA). I am considering moving to the FL prepaid though as the growth and potential growth (if the math and my contributions don’t increase a ton) likely won’t pay for the entirety of the tuition.\n\nEdit: if there is no state tax benefit, I don’t there they are any downsides of changing funds to a nation wide state",
        "created_utc": 1578050773,
        "id": "fcx4flj",
        "permalink": "/r/investing/comments/ejdrvr/why_do_529_plans_significantly_underperform_the/fcx4flj/",
        "score": 11,
        "subreddit": "investing",
        "created": 1578079573.0
    },
    {
        "author": "Meowmeow_kitten",
        "body": "He's also blatantly lying in these answers. Fidelity does not fucking just let the reps choose whatever lots they want to for tax purposes in these situations.",
        "created_utc": 1579369769,
        "id": "feswvi4",
        "permalink": "/r/wallstreetbets/comments/eqgj0b/i_just_left_fidelity_active_trader_services_ama/feswvi4/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1579398569.0
    },
    {
        "author": "NeuralNexus",
        "body": "I have it. Main attraction was the 1.80 APY on swept cash. It makes Robinhood the best value brokerage again. \n\nFidelity sweeps to SPAXX (current field 1.25)\n\nVanguard sweeps to their Prime fund (1.55) \n\nSchwab doesn’t pay much interest at all. \n\nRobinhood + Debit = 1.80% yield + FDIC insurance. Not bad.",
        "created_utc": 1578207676,
        "id": "fd7om22",
        "permalink": "/r/RobinHood/comments/ek6r8m/has_anyone_been_using_cash_mgmt_regularly_yet/fd7om22/",
        "score": 11,
        "subreddit": "RobinHood",
        "created": 1578236476.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "According to Fidelity ba$ did the most to lift the dow not apple \n\nFor all u asshole ba$ haters.  Knowing this is a American company and u choose to hate on it due to your Failures in this country \n\nBa$ 340 eom",
        "created_utc": 1578008281,
        "id": "fcvr8at",
        "permalink": "/r/wallstreetbets/comments/ej49t7/what_are_your_moves_tomorrow_january_03/fcvr8at/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1578037081.0
    },
    {
        "author": "theutan",
        "body": "You really can't go wrong with fidelity,  Schwab or vanguard.   I really value the simplicity of having all my investments and retirement accounts in the same places and nearly every employer I have had thus far has been through fidelity.",
        "created_utc": 1578153772,
        "id": "fd3128l",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd3128l/",
        "score": 11,
        "subreddit": "investing",
        "created": 1578182572.0
    },
    {
        "author": "HODL_monk",
        "body": "You DO have to be a Fidelity client to get this, go to their website directly to sign up, and they can do it because they are the biggest mutual fund provider, they want your funds under management (presumably to sell you something else that actually has costs later) and this fund 'cuts corners' that other index funds do not.\n\nI will discuss the corner cutting, since you seem interested. This fund does not licence an official S&amp;P index as a benchmark for what is in the fund, as many other index funds do. This means that the stocks are a 'generic' self made index, and not an official index made by a third party. As you can imagine, I don't really care for officially licenced crap, and I just want the performance of a broad index of stocks, and not some name brand on the prospectus. A second corner they cut is they have less stocks than a 'marque' index fund would have. For example, Vanguard's total stock market index fund has about 3400 stocks, while this no cost fund has about 2000. This means that the no cost fund is somewhat less diversified, but I personally feel that owning those tiniest of stocks is not important enough to pay a fee for. Another corner cut is the dividends are only paid out once a year. This makes it easier for the fund to pay out to people who sell, without the fund selling stocks and generating taxes, but you have to wait for income until the end of the year, while other funds pay every 3 months. While I do like income, I really invest for growth, so I can live with this compromise. Also, they will send you very little paperwork, besides tax forms, so you will have to check online, to see your status. I prefer paper mailings, but in the end, it is a cost to them, so I understand not getting a monthly update every month. You should consider these limitations, and if you don't want to do this, Vanguard has a very good total stock market index fund (VTSAX, $3000 minimum) without compromise, for about 0.04 % per year in fees, which is $ 4 per $10,000 invested per year, so not that significant a cost difference, at least with low balances. Also, you can get that vanguard fund as an ETF under the symbol VTI, which lets you trade it like a stock, through any brokerage, and not have to be a vanguard customer.",
        "created_utc": 1578177893,
        "id": "fd5i2iq",
        "permalink": "/r/investing/comments/ejyye9/what_was_your_path_in_learning_about_the_stock/fd5i2iq/",
        "score": 10,
        "subreddit": "investing",
        "created": 1578206693.0
    },
    {
        "author": "MONGSTRADAMUS",
        "body": "The one thing I like about fidelity index funds is for people starting out , there is no min balance required, I personally am using fskax, fidelity total stock market, as majority of my holding.",
        "created_utc": 1577996612,
        "id": "fcv83uu",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcv83uu/",
        "score": 10,
        "subreddit": "investing",
        "created": 1578025412.0
    },
    {
        "author": "orangehorton",
        "body": "fidelity is definitely a better platform, and if you have retirement accounts with them, it's easier to have everything in one place. That being said, Robinhood is probably better for beginners imo if you want to learn and get into investing more",
        "created_utc": 1577988146,
        "id": "fcutfnx",
        "permalink": "/r/investing/comments/ej1kfl/how_does_robinhood_compare_to_a_platform_like/fcutfnx/",
        "score": 10,
        "subreddit": "investing",
        "created": 1578016946.0
    },
    {
        "author": "verymickey",
        "body": "60 total us market . 30 total international  10 total bond  - if you use fidelity this handy chart will help find them. edit : forgot the link https://www.bogleheads.org/wiki/Fidelity",
        "created_utc": 1578331361,
        "id": "fde52un",
        "permalink": "/r/StockMarket/comments/ektuix/is_now_a_good_time_to_invest_in_vanguard_index/fde52un/",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1578360161.0
    },
    {
        "author": "MrRonObvious",
        "body": "What does Vanguard offer that Fidelity doesn't?",
        "created_utc": 1578411335,
        "id": "fdgyd20",
        "permalink": "/r/investing/comments/elcztl/canshould_i_transfer_funds_from_fidelity_401k_to/fdgyd20/",
        "score": 10,
        "subreddit": "investing",
        "created": 1578440135.0
    },
    {
        "author": "thgirwa",
        "body": "I manage the investment accounts of my wife (Fidelity) and myself (Vanguard). There are some slight differences, but I feel are pretty interchangeable. I prefer Fidelity’s website more, Fidelity doesn’t haven’t minimums to funds (but you can always buy the ETF at Vanguard), but does generally have higher expense ratios to Vanguard funds (although not always the case).\n\nLTDR it’s not necessary if you don’t want the hassle",
        "created_utc": 1578347052,
        "id": "fdeut5v",
        "permalink": "/r/investing/comments/el0qjd/is_vanguard_worth_having_another_account/fdeut5v/",
        "score": 9,
        "subreddit": "investing",
        "created": 1578375852.0
    },
    {
        "author": "webulltrade",
        "body": "0% expense? Do you have to be a fidelity client? How are they able to do 0%?",
        "created_utc": 1578174282,
        "id": "fd558h8",
        "permalink": "/r/investing/comments/ejyye9/what_was_your_path_in_learning_about_the_stock/fd558h8/",
        "score": 9,
        "subreddit": "investing",
        "created": 1578203082.0
    },
    {
        "author": "DarthJader27",
        "body": "I would just initiate the transfer and then chat with Fidelity support to see if they will reimburse the $75 fee Robinhood charges. I transferred my RH account to Schwab when the infinite money glitch was going on a couple of months ago and Schwab gave me a $75 credit to reimburse the fee after everything settled.",
        "created_utc": 1578068444,
        "id": "fcxpjgw",
        "permalink": "/r/StockMarket/comments/ejgwfv/question_on_transferring_to_a_new_brokerage/fcxpjgw/",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1578097244.0
    },
    {
        "author": "EvolvingWino",
        "body": "why not use a mainstream broker like Fidelity or TD?",
        "created_utc": 1578201542,
        "id": "fd7ae7o",
        "permalink": "/r/investing/comments/ek8kld/i_am_between_robinhood_and_some_site_that_a/fd7ae7o/",
        "score": 8,
        "subreddit": "investing",
        "created": 1578230342.0
    },
    {
        "author": "dvdmovie1",
        "body": "Fidelity.",
        "created_utc": 1577988423,
        "id": "fcutxpd",
        "permalink": "/r/investing/comments/ej1kfl/how_does_robinhood_compare_to_a_platform_like/fcutxpd/",
        "score": 7,
        "subreddit": "investing",
        "created": 1578017223.0
    },
    {
        "author": "unreliabletags",
        "body": "I've been using the beta iPhone app (Beacon), and progress is glacial. If it achieves parity with the legacy app any time this year, it'll be the first software project ever to actually accelerate late in the game. Vanguard just doesn't have this kind of thing in their wheelhouse. \n\nBuying Vanguard ETFs from Fidelity works fine.",
        "created_utc": 1578157734,
        "id": "fd3fbst",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd3fbst/",
        "score": 7,
        "subreddit": "investing",
        "created": 1578186534.0
    },
    {
        "author": "Cruian",
        "body": "Not sure if all apply to Vanguard but: uninvested money (I think this is a big one for Schwab), expense ratios of funds, being the brokerage used by work plans, paired credit cards (like the Fidelity Visa or Schwab AmEx options).",
        "created_utc": 1577996508,
        "id": "fcv7xk2",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcv7xk2/",
        "score": 7,
        "subreddit": "investing",
        "created": 1578025308.0
    },
    {
        "author": "Sirspender",
        "body": "Fidelity because my credit card is with them. I transfer all my spending money straight into my brokerage. Easy transfer in-house to pay off credit card. And it helps me decide to spend less. Because it's all in the brokerage if I've got money left over at the end of the month it goes straight into taxable investments.",
        "created_utc": 1578148866,
        "id": "fd2ldev",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd2ldev/",
        "score": 7,
        "subreddit": "investing",
        "created": 1578177666.0
    },
    {
        "author": "Shkreli2020",
        "body": " Hey, mods want to keep my knowledge from ya'll but I won't let them win.\n\nI'm here to answer any questions you have!\n\n# I just left Fidelity active janitorial services. AMA\n\n📷[**Satire**](https://www.reddit.com/r/wallstreetbets/search?q=flair_name%3A%22Satire%22&amp;restrict_sr=1)**Sorry, this post has been removed by the moderators of** r/wallstreetbets**.**Moderators remove posts from feeds for a variety of reasons, including keeping communities safe, civil, and true to their purpose.\n\nI was one of the people who employees would call and tell that the third stall in the men's bathroom is clogged again. Be happy to provide whatever evidence I need.",
        "created_utc": 1579383173,
        "id": "feu518x",
        "permalink": "/r/wallstreetbets/comments/eq5jxu/weekend_discussion_thread_january_1719_2020/feu518x/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1579411973.0
    },
    {
        "author": "SirGlass",
        "body": "All of them.\n\nSome brokerages will have a minimum amount like 3k (vanguard) however once you reach that amount you can invest any additional amount to the penny.\n\nSchwab and Fidelity have lots of funds whose minimum is $1 , meaning after investing $1  you could invest $0.15 a week if you wanted.",
        "created_utc": 1580261503,
        "id": "ffvdf1y",
        "permalink": "/r/investing/comments/evfi1y/mutual_fund_question/ffvdf1y/",
        "score": 6,
        "subreddit": "investing",
        "created": 1580290303.0
    },
    {
        "author": "iWOCuplikethis",
        "body": "I just transferred to fidelity last month without selling anything and it actually looks like they gave me a $35 credit.\n\nThat could have been an incentive or reimbursement for a fee the broker I left charged. I don’t know.",
        "created_utc": 1578067069,
        "id": "fcxndy0",
        "permalink": "/r/StockMarket/comments/ejgwfv/question_on_transferring_to_a_new_brokerage/fcxndy0/",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1578095869.0
    },
    {
        "author": "FUWS",
        "body": "I use Robinhood and Fidelity myself. \n\nRH “ had “ a niche which was free trade but rest of the packs are slowly doing the same.\n\nRH doesn’t have a great customer service ( from the posts and stories in reddit) but they are convenient. \n\nFidelity has a great tool for research and the app works. Far as research goes, there are other websites like investing.com which can go deeper. \n\nI only got into RH when I first started trading Canadian Weedstocks and there is just something that feels cheap about it. However, I will continue to use RH for easy quick/access.",
        "created_utc": 1577989172,
        "id": "fcuv5bi",
        "permalink": "/r/investing/comments/ej1kfl/how_does_robinhood_compare_to_a_platform_like/fcuv5bi/",
        "score": 6,
        "subreddit": "investing",
        "created": 1578017972.0
    },
    {
        "author": "ilovewsb",
        "body": "Charles Schwab is gay. E Trade and Fidelity approved me for options but Schwab sent me an e-mail saying to call them so I can answer a few questions. Ima just answer stonks only go up",
        "created_utc": 1578520119,
        "id": "fdlavq0",
        "permalink": "/r/wallstreetbets/comments/elyvd1/what_are_your_moves_tomorrow_january_09/fdlavq0/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1578548919.0
    },
    {
        "author": "FidelityThrowaway1",
        "body": "People who are in managed fidelity funds",
        "created_utc": 1579367290,
        "id": "feso1x7",
        "permalink": "/r/wallstreetbets/comments/eqgj0b/i_just_left_fidelity_active_trader_services_ama/feso1x7/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1579396090.0
    },
    {
        "author": "ImakeVideo4Investing",
        "body": "I highly don’t recommend using Robinhood. They only offer taxable/brokerage account. No other investment plan, or retirement plan. Considering big major online brokerages also offer free commissions fee, Robinhood lost its best feature. Let’s not mention that the search tool for Robinhood is disappointing as well (I used Robinhood for few weeks). \n\nI personally uses Fidelity, and it has great search tool. Anything you want to search or narrow down particularly detail, you can do it. \n\nJust do your research on online brokerage before you commit to one.",
        "created_utc": 1579392931,
        "id": "fev44ye",
        "permalink": "/r/investing/comments/eqosgc/robinhood_compared_to_other_stock_brokerages/fev44ye/",
        "score": 6,
        "subreddit": "investing",
        "created": 1579421731.0
    },
    {
        "author": "yeetwagon",
        "body": "Yes, I would recommend Fidelity. They now offer no brokerage fees so it costs nothing to use their platform and they don’t sell your data and do other unscrupulous stuff like robinhood. They have a very good selection of ETFs (a collection of stocks... safer than individual stocks). Putting your money in a brokerage account should earn you more money than it would in the bank (probably only a cent or two a month). Schwab and td ameritrade are also good platforms from what I’ve heard",
        "created_utc": 1578889649,
        "id": "fe6fvd8",
        "permalink": "/r/wallstreetbets/comments/envr3j/have_you_guys_been_these_robinhood_ads_theyve/fe6fvd8/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1578918449.0
    },
    {
        "author": "xASAPxHoTrOdx",
        "body": "Fidelity is good too",
        "created_utc": 1578892400,
        "id": "fe6iytm",
        "permalink": "/r/wallstreetbets/comments/envr3j/have_you_guys_been_these_robinhood_ads_theyve/fe6iytm/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1578921200.0
    },
    {
        "author": "AuralRapist",
        "body": "Fidelity defaults you into a limited margin account. Meaning your transfer is available immediately (assuming you use Fidelity to request the transfer) but you can't sell until everything clears. Which if you're investing rather than day or swing trading shouldn't be relevant at all.",
        "created_utc": 1578155087,
        "id": "fd3629d",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd3629d/",
        "score": 6,
        "subreddit": "investing",
        "created": 1578183887.0
    },
    {
        "author": "SeattleDave0",
        "body": "It's good to see they're lowering their prices closer to the competition, but they still charge $1/contact for option trades. All the big brokers (Fidelity, TD Ameritade, Schwab, eTrade) charge $0.65/contract. The only broker I've found that is truly commission free, including $0/contract + $0 option exercise fee + $0 option assignment fee, is Firstrade.",
        "created_utc": 1577996695,
        "id": "fcv88vb",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcv88vb/",
        "score": 5,
        "subreddit": "investing",
        "created": 1578025495.0
    },
    {
        "author": "dingledicker",
        "body": "SHOP is an institutional stock, not retail stock. (retail stock = TSLA). the price movements are dictated mainly by funds (Vanguard, Fidelity, hedge funds). These past 2/3 weeks have been holiday weeks where fund managers are typically are on vacation. So its been relatively flat except end of year where profits are locked in. You should see volume start to pick up on monday. Large volume will be morning or close when funds rebalance. If it starts to moon it means funds are adding it to their portfolio. If it crashes, be careful because it means funds are selling it, and it will be one of the first stocks to crash if we enter a correction",
        "created_utc": 1578113930,
        "id": "fd05ixz",
        "permalink": "/r/wallstreetbets/comments/ejrsye/shop_technical_analysis_screams_of_impending_drop/fd05ixz/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1578142730.0
    },
    {
        "author": "GaylrdFocker",
        "body": "IMO both are irrelevant anymore.  Fidelity, Schwab, and Vanguard all have no fee trades now and can start with just 1 share of any ETF. \n\nIf you can't afford 1 share of something, then I'd recommend M1 Finance as they allow fractional shares, and have other benefits over RH and Cash app",
        "created_utc": 1578494942,
        "id": "fdk36rv",
        "permalink": "/r/investing/comments/eltl6y/for_small_investors_is_cash_app_better_than/fdk36rv/",
        "score": 5,
        "subreddit": "investing",
        "created": 1578523742.0
    },
    {
        "author": "InvestingNerd2020",
        "body": "Fidelity easily now.  At least Robinhood had the advantage when they were the only one offering free trades in taxable accounts.  Now that Fidelity offers free trades, they kick Robinhood @ss.  \n\nRobinhood still has the Bitcoin trading market.",
        "created_utc": 1577990631,
        "id": "fcuxqdy",
        "permalink": "/r/investing/comments/ej1kfl/how_does_robinhood_compare_to_a_platform_like/fcuxqdy/",
        "score": 5,
        "subreddit": "investing",
        "created": 1578019431.0
    },
    {
        "author": "ilovewsb",
        "body": "Charles Schwab sent me a letter telling me they’re closing my account bc my credit isn’t great, It’s 630, they probably just got mad bc I sent them an email demanding they approve me for options or I’d take my ass to E Trade and Fidelity who had already approved me. Lol fuck them",
        "created_utc": 1580093737,
        "id": "ffpfgrh",
        "permalink": "/r/wallstreetbets/comments/eucwgc/what_are_your_moves_tomorrow_january_27/ffpfgrh/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1580122537.0
    },
    {
        "author": "PTC36",
        "body": "Some of your assumptions are wrong but the basis of what you’re driving at is correct.  REITs are a good safe thing to put a percentage of in your portfolio to hold because they do drive a lot of dividend revenue and R.E. is a good safe hedge overall. \n\nIf you are going with a REIT ETF make sure their geographic and property holdings match your objectives.  I trade with Fidelity and I like FREL ETF as a good general REIT hold.  No transaction fees, and it’s generated many good dividends for me over time.",
        "created_utc": 1578149008,
        "id": "fd2lpvp",
        "permalink": "/r/investing/comments/ejwuay/thoughts_on_reits/fd2lpvp/",
        "score": 5,
        "subreddit": "investing",
        "created": 1578177808.0
    },
    {
        "author": "Visvism",
        "body": "It works well as a basic 2% card. I deposit the rewards into my CMA. Yes, you can have rewards deposited into a number of Fidelity accounts.\n  \nThe customer service isn’t actually Fidelity but instead a company called Elan Financial Services.  I wish it were directly with Fidelity but oh well.\n  \nThey’re generous with credit lines even though I don’t use the card as much as I should. Haven’t requested a CLI so I can’t speak to how easy or hard it might be.",
        "created_utc": 1578166463,
        "id": "fd4d1n9",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd4d1n9/",
        "score": 5,
        "subreddit": "investing",
        "created": 1578195263.0
    },
    {
        "author": "ElasticSpeakers",
        "body": "This announcement is not related to what you asked (this is about Vanguard the brokerage, not Vanguard the fund manager) and yes, Vanguard funds have been available at Fidelity for many years.",
        "created_utc": 1577990219,
        "id": "fcuwzvp",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcuwzvp/",
        "score": 5,
        "subreddit": "investing",
        "created": 1578019019.0
    },
    {
        "author": "ChekovsWorm",
        "body": "A few thoughts on Fidelity vs Schwab, which I agree are likely the best choices for most people. I've used and continue to use both, but I lean towards Fidelity personally.\n\n1)  Fidelity has a few benefits over Schwab, for an all around financial supermarket.  \n\na) ATM rebates on the Cash Management Account are next business day, same day the ATM withdrawal fully processes. Schwab is at month end.  \n\nb) Fidelity does have a 1% foreign transaction fee listed on their Visa Debit ATM card, but both personal experience in dozens of countries and many reports online are that there is no fee on cash withdrawals at ATMs, only on Visa purchases. So for domestic use or for foreign cash withdrawal use, it's just as good as Schwab Bank Visa Debit, maybe better because of the next-day rebate.\n\nc) Both firms are essentially $1 minimum for investments in own-brand mutual funds, both index and active for Fido (mostly $1 for index, $100 for active Schwab funds.) So really easy to get started. But when Fidelity got rid of minimums on their own mutual funds, they also got rid of minimums for monthly automatic  investing in them. When Schwab reduced minimum fund investments to $1 for the initial investment, they still kept the monthly automatic investment minimum as $100. So at Fidelity you can do, for example, a total of $70 allocated to two funds or three funds (or even less) as a fully automated monthly investment from your bank. At Schwab, you can't even do one fund on an automatic investment for that amount, it would have to be $100 per fund. Even for the $1 minimum funds. \n\nBoth are still way better than Vanguard's $3000 minimum investment for most of their mutual funds ($1000 for target date funds.)\n\nd) Fidelity has better CD laddering tools for brokered CDs than Schwab. Fidelity also has the same $1 per $1000 bond (which includes secondary brokered CDs) commission, but does not have Schwab's 10-bond (so $10) minimum commission. \n\ne) Last time I compared, Fidelity had more advanced order types such as trailing limits by both $ or %, and bracketing buy/sell ranges, which they call \"Trade Armor\", right on their web interface, than does Schwab. You can do that with Schwab's Streetsmart desktop trading tool but that's more complicated.\n\nf) Any Fidelity-branded Money Market Fund in your non-retirement Fidelity account (trading or CMA), even if not your sweep fund, is immediately available as same-day available to withdraw, cover checks, debits, or ATM use (and in most cases, purchases) without having to sell the fund and wait till the next business day for it to be available. Further, the total of you cash, sweep fund, and purchased Fidelity money market funds in your trading account can be linked to be overflow immediately available cash in the Cash Management Account. Schwab doesn't have anything like that - Schwab MMFs tend to pay a basis point or two more than equivalent Fidelity ones, but you have to manually buy them, and manually sell them and wait till next day for the proceeds to be available to withdraw, and then transfer it to Schwab Bank to use on the ATM Debit card. \n\n2) Schwab has a few benefits over Fidelity for an all-around financial supermarket.\n\na) ATM Visa Debit Card is totally no-fee, even for purchases. And that's true both for the Schwab Bank Visa Debit card and the separate and issued only on-request Schwab Brokerage Account Visa Debit Card. At Fidelity the free unlimited ATM rebates are only on the Visa Debit Card issued on the Cash Management Account. If you want only the main trading \"Fidelity Account\" or want both, and want a card on the trading account, that is not free ATM rebates unless you are a high-net-worth private client or do a lot of paid trades. \n\nb) Customer service is good to excellent at both firms, and all US based, 24/7/365, but in my experience I think Schwab is a tiny bit better. \n\nc) Despite the lack of full integration between Schwab Brokerage and Schwab Bank for instant use and same day setttlement of MMFs, it's still all run by Schwab, so no chance of finger-pointing or handoff to another firm's support. \n\nThat's not the case at Fidelity, where the often mis-named on Reddit \"bank\" (the CMA) is really a limited, checking-specific but legally brokerage account. Entirely managed by Fidelity in terms of you can't directly talk to the other banks involved, but there are up to about 20-25 outside banks really handling different parts of operating the checking account function. PNC Mellon Bank runs the actual Visa Debit Card portion. UMB Bank runs the check clearing and routing number for direct deposit/debit part of the account. Up to 4 outside banks out of a total at any time of around 20, hold your cash once it's been in Fidelity overnight. \n\nAt Schwab, all of that is Schwab Bank, or the other Schwab-owned bank they bought in 2018, or Schwab Brokerage. All part of the Charles Schwab Corporation. The only part outsourced is BillPay, which is done by CheckFree, just like almost ever other bank, credit union, and brokerage (including Fidelity.)\n\nI've rarely had support issues on either the Fidelity CMA checking or the Fidelity CMA Visa Debit, but when I have, and called Fidelity, I had to be transferred to the Fidelity checking (UMB) or Fidelity Debit Card (PNC) support teams. During business hours they answer as \"Fidelity (name of service)\" but one time on a weekend when an ATM transaction failed to give me money but debited it, I called and got the \"PNC Bank Card Services\" weekend support where the firstline rep didn't understand that I did not have a PNC account number and it was a Fidelity account. Still got it resolved but it was a bit of a hassle and a risk.",
        "created_utc": 1578196309,
        "id": "fd6vo0m",
        "permalink": "/r/investing/comments/ejzcgv/what_is_the_best_brokerage_to_use/fd6vo0m/",
        "score": 5,
        "subreddit": "investing",
        "created": 1578225109.0
    },
    {
        "author": "OpeningSpeech1",
        "body": "Literally all upside of using fidelity over RH. Access to bonds, commodities, OTC, foreign listings, mutual funds, automatic interest on cash, better order execution, etc. Only way RH is better is if you're trading options frequently",
        "created_utc": 1578004813,
        "id": "fcvlqof",
        "permalink": "/r/investing/comments/eixh97/daily_advice_thread_all_basic_help_or_advice/fcvlqof/",
        "score": 4,
        "subreddit": "investing",
        "created": 1578033613.0
    },
    {
        "author": "Fennecfox9",
        "body": "Does anyone know if this means I can buy Vanguard funds in my Fidelity account?",
        "created_utc": 1577988146,
        "id": "fcutfn4",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcutfn4/",
        "score": 4,
        "subreddit": "investing",
        "created": 1578016946.0
    },
    {
        "author": "Footsteps_10",
        "body": "I use fidelity. Their customer service is amazing.\n\nPost your legitimate amounts, cash+margin buying power and I’ll believe they just closed you out.\n\nIf you were leveraged a shit ton, bought a penny stock on margin, you deserve to be closed out early.",
        "created_utc": 1578014198,
        "id": "fcw0bhf",
        "permalink": "/r/stocks/comments/ej7log/fidelity_allowed_me_to_buy_a_stock_on_margin_and/fcw0bhf/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1578042998.0
    },
    {
        "author": "Cruian",
        "body": "Dropping minimums would also help some: $1 initial minimum for Fidelity or Schwab mutual funds, $1,000 for Vanguard target date, $3,000 for Vanguard index mutual funds.",
        "created_utc": 1577996581,
        "id": "fcv81wn",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcv81wn/",
        "score": 4,
        "subreddit": "investing",
        "created": 1578025381.0
    },
    {
        "author": "Yankuba1",
        "body": "Dont invest in crypto. Dont pick individual stocks. Stick with a total market index fund from Vanguard or Fidelity. Go to Bogleheads and not Reddit for financial advice",
        "created_utc": 1579378171,
        "id": "fetpwbw",
        "permalink": "/r/investing/comments/eql1u0/the_basics/fetpwbw/",
        "score": 4,
        "subreddit": "investing",
        "created": 1579406971.0
    },
    {
        "author": "AvgDwnSyndrome",
        "body": "Options settle in one trade day on cash accounts unlike stock.  so you could day trade every day but you will be limited to covered calls and  long calls and puts. Also robinhood does not let you trade options on a cash account. You would have to use TD, Fidelity, Firstrade, etc",
        "created_utc": 1577910205,
        "id": "fcs1yp4",
        "permalink": "/r/wallstreetbets/comments/ein5hs/pattern_day_trader_workaround/fcs1yp4/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1577939005.0
    },
    {
        "author": "TheDarkOne32",
        "body": "Depends on the person really.  You said you like to use your phone for trading, and I know Vanguard gets a lot of complaints about their outdated website and app, so maybe a switch is right for you.\n\nI personally use Fidelity because they offer the credit card with 2 percent cash back, 24/7 client services (I'm a 3rd shift worker), their website is top-of-the-line, and they always solve any issues I am having.  A lot of people are jumping to Fidelity because they offer slightly cheaper index funds than Vanguard, but that really does not factor for me.  At this point, they're all so cheap that we're talking about nickles and dimes.\n\nAt the same time, if I had a friend who did not know a lot about investing, I would send him to Vanguard...either using a Target date fund or their Robo Advisor with a human contact.  Their advisory services are less expensive than Fidelity or Schwab, and they are not going to trip you up with any high fee funds and services that you might find at their competition if you are not paying attention.  A great example of this would be the target date funds at Fidelity.  Look at the expense ratio differences in the Fidelity Freedom funds and the Fidelity Freedom Index funds.  Vanguard just offers the low cost, better version.  Vanguard is very straight forward, simple, and almost boring.  That is how investing should be.\n\nVanguard actively managed funds are also cheaper and VDIGX would very appealing to me.   Their money market also has a higher return.  Schwab's money market return is almost laughable.",
        "created_utc": 1577992565,
        "id": "fcv198j",
        "permalink": "/r/investing/comments/eixh97/daily_advice_thread_all_basic_help_or_advice/fcv198j/",
        "score": 4,
        "subreddit": "investing",
        "created": 1578021365.0
    },
    {
        "author": "HarrisonJC",
        "body": "The only part of my life that my wife doesn't know about is in Fidelity.",
        "created_utc": 1578451066,
        "id": "fdiu3hw",
        "permalink": "/r/wallstreetbets/comments/elhbjc/why_does_almost_every_broker_have_a_really_stupid/fdiu3hw/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1578479866.0
    },
    {
        "author": "27onfire",
        "body": "I would like to thank the transfer Bank @ Fidelity for saving me a ton of money today as all the calls I planned to buy this morning went down bigly.",
        "created_utc": 1578690178,
        "id": "fdrux84",
        "permalink": "/r/wallstreetbets/comments/emwlz6/weekend_discussion_thread_january_1012_2020/fdrux84/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1578718978.0
    },
    {
        "author": "neocoff",
        "body": "&gt; my regular broker, fidelity, still hasn't approved me.\n\nYou're supposed to lie your ass off on the questionnaire.",
        "created_utc": 1579306500,
        "id": "feovtpl",
        "permalink": "/r/wallstreetbets/comments/eq6l3u/i_see_people_ask_all_the_time_what_the_greeks_are/feovtpl/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1579335300.0
    },
    {
        "author": "Lintlicker12",
        "body": "LOL. I did an ACATS to Fidelity and RH closed my account. It was never my intention to completely stop using RH, but when I finally received an email back about why my account was closed without asking me (this took like 6 business days) I was told my account was permanently disabled and I'd need to apply for a new account to use RH. I wanted to stay with RH to use fractional shares and as a fun account. Thanks Fidelity for adding features and respecting customers. RH is a cool basic broker, but their customer service is absolute shit and they get petty. They aren't the only ones offering low cost service any more, so they probably need to improve their game if they want to survive.",
        "created_utc": 1580339372,
        "id": "ffy6a09",
        "permalink": "/r/RobinHood/comments/evutgw/bye_robinhood_fidelity_introducing_fractionals/ffy6a09/",
        "score": 4,
        "subreddit": "RobinHood",
        "created": 1580368172.0
    },
    {
        "author": "Cruian",
        "body": "Some people think Vanguard's structure alone is enough reason to only use them. Or their history of pushing prices down.\n\nPersonally, I'm not one of them. As of right now, to me, Fidelity or Schwab would be my top 2 choices for brokerage, I personally use Fidelity.\n\nVanguard does have 2 big things I'm jealous of: their patents that let them get the same tax efficiency for some mutual funds as ETFs (hopefully Fidelity and Schwab jump on this in a free years once the patents expire) and VTWAX (I obviously prefer how mutual funds trade: I know I can buy VT at Fidelity commission free).",
        "created_utc": 1578014505,
        "id": "fcw0sd2",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcw0sd2/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578043305.0
    },
    {
        "author": "nameisjasonhello",
        "body": "Newbie here, 3-4 months investing. I’ve only used Vanguard and Fidelity, but I stuck with the latter due to easier navigation and it’s visually pleasing.",
        "created_utc": 1578015303,
        "id": "fcw204h",
        "permalink": "/r/investing/comments/ej7x0n/best_platform_to_start_investing/fcw204h/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578044103.0
    },
    {
        "author": "tempting_churro",
        "body": "I really like Fidelity, easy to use both on a computer and through the mobile app.",
        "created_utc": 1578163006,
        "id": "fd3zmmd",
        "permalink": "/r/investing/comments/ejzcgv/what_is_the_best_brokerage_to_use/fd3zmmd/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578191806.0
    },
    {
        "author": "BillNye69",
        "body": "Does FSSNX have that problem too? Fidelity Small Cap Index Fund. I own it",
        "created_utc": 1578170724,
        "id": "fd4sk5q",
        "permalink": "/r/investing/comments/ek0l6u/what_small_caps_are_currently_looking_interesting/fd4sk5q/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578199524.0
    },
    {
        "author": "1coin3lives",
        "body": "I've used E\\*TRADE, Schwab, Fidelity, Interactive Brokers, Merrill and TD Ameritrade.\n\nE\\*TRADE is my current all-around favorite, unless you're an active trader and need really good tools. Then TD Ameritrade (now owned by Schwab) is a good choice for the Thinkorswim platform. I recommend that you steer clear of Interactive Brokers unless you enjoy pulling your hair out.\n\nI've never had any trouble with transferring $ around once it was in Etrade, however I've had occasional drama when trying to transfer an external account to them. Usually the problem has ended up being nothing that Etrade had control over, such as mismatched names (for example \"John\" on one account and \"Jonathan\" on the other).\n\nI get very quick US-based phone support from Etrade when I need it.",
        "created_utc": 1578175625,
        "id": "fd5a709",
        "permalink": "/r/investing/comments/ejzcgv/what_is_the_best_brokerage_to_use/fd5a709/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578204425.0
    },
    {
        "author": "ja1484",
        "body": "I still find it interesting that people base their decision on this. Like me, personally, I prefer the brokerage with the ownership structure designed to prevent conflict of interest. But I guess we each get to determine our individual criteria.\n\nVanguard's web interface from what I can tell is fine, and my HSA is with Fidelity. If anything, I would argue Fidelity's web portal is more confusing - too many options I don't need.",
        "created_utc": 1578176382,
        "id": "fd5cwi1",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd5cwi1/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578205182.0
    },
    {
        "author": "Cruian",
        "body": "&gt;I didn’t realize commissions apply when you buy non fidelity funds on their site... thought they hacked all of it.\n\nFor mutual funds, commissions do still apply (I believe $75?). ETFs (at least \"normal\" and US listed) from any provider have been free since October.\n\n&amp;#x200B;\n\n&gt;So may need to open up a vanguard account if I’m interested in their fu SS to dodge the commission?\n\nYes. Or just use the ETF version.\n\n&amp;#x200B;\n\nEdit: Removed part not applicable to the comment thread since there's no VTWAX equivalent at Fidelity.",
        "created_utc": 1578027065,
        "id": "fcwj70s",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcwj70s/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578055865.0
    },
    {
        "author": "quickclickz",
        "body": "their interface is why i basically switched to fidelity",
        "created_utc": 1578000578,
        "id": "fcversg",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcversg/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578029378.0
    },
    {
        "author": "ilovewsb",
        "body": "So since today RH filled my orders at the bid-ask price for once in my life..... is this how it is with every other broker? Instant fills? \n\nI have a fidelity account but haven't transferred my money bc its a pain in the ass",
        "created_utc": 1578332712,
        "id": "fde78ny",
        "permalink": "/r/wallstreetbets/comments/eksot6/daily_discussion_thread_january_06_2020/fde78ny/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1578361512.0
    },
    {
        "author": "Cruian",
        "body": "For tax advantaged investing, Fidelity usually offers very comparable funds to Vanguard's offerings.\n\nIn taxable accounts, you could use ETFs at Fidelity as free to trade, even Vanguard ones.\n\nIf your happy with Fidelity, there's little to no reason to use Vanguard directly unless you want their mutual funds for taxable accounts (they have a patent that gives some of their burial funds ETF like tax efficiency).",
        "created_utc": 1578347444,
        "id": "fdevgz2",
        "permalink": "/r/investing/comments/el0qjd/is_vanguard_worth_having_another_account/fdevgz2/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578376244.0
    },
    {
        "author": "infamousnj69",
        "body": "This works. I do exactly the same with Fidelity",
        "created_utc": 1578251721,
        "id": "fdaya69",
        "permalink": "/r/wallstreetbets/comments/eke6ol/29_m4f_ohio_seeking_who_will_let_me_play_the/fdaya69/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1578280521.0
    },
    {
        "author": "Jakeep16",
        "body": "Fidelity",
        "created_utc": 1578159273,
        "id": "fd3kxvj",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd3kxvj/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578188073.0
    },
    {
        "author": "jinlonn",
        "body": "No reason to use it when better brokerages like Schwab and Fidelity and Vanguard are also 0 commission.\n\nUnless you want to do a lot of options trading, in which case best of luck to you and see you on r/WSB.",
        "created_utc": 1578515687,
        "id": "fdl20n6",
        "permalink": "/r/investing/comments/ely1ts/what_can_you_tell_me_about_robinhood_what_are/fdl20n6/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578544487.0
    },
    {
        "author": "Qwerty97HS",
        "body": "So I am 20 years old and just starting to get into investing. I don’t have a crazy amount of money but I want to start investing mine. At first my plan was to open both my Roth IRA and taxable account on Fidelity because of the zero expense index funds. But now I’m seeing some people saying that Vanguard is better for the taxable account. Now I’m thinking of doing the Roth IRA on Fidelity and taxable on Vanguard but maybe that’s just stupid. I’d have pretty much the same stuff on both, a 3 fund portfolio and maybe some REITs. \n\nWhat would you do?",
        "created_utc": 1578413655,
        "id": "fdh202t",
        "permalink": "/r/investing/comments/elaque/daily_advice_thread_all_basic_help_or_advice/fdh202t/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578442455.0
    },
    {
        "author": "boroqcat",
        "body": "&gt; Listening to you tards...So I'm like hey, maybe these autistic degenerates know what they're talking about. \n\nThis is what happens when a normie drinks vaccine juice hoping to catch autism.\n\nRules of r/wallstreetbets:\n\n1. Never listen to r/wallstreetbets \nException: to inverse.\n\n2. No one knows what they’re doing on r/wallstreetbets.\nException: unless they’re whale lurkers and MMers who come for the u/haupt91 memes and to fap at our loss porn.\n\n3. See rule # 1.\n\n4. ????\n\n5. Profit.\n\nInstructions for you:\n\n1. Cash gang.\n\n2. Transfer what’s left of ur RH to Fidelity.\n\n3. Delete the app.\n\n4. Subscribe to r/investing.\n\n5. Lurk no more.\n\n\nI have spoken.",
        "created_utc": 1578503599,
        "id": "fdkguz9",
        "permalink": "/r/wallstreetbets/comments/eluoej/listening_to_you_tards/fdkguz9/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1578532399.0
    },
    {
        "author": "Awkward_Lubricant",
        "body": "Nice, about a month after I've moved everything from there to Fidelity lol.  But Vanguard really seems to be solely/mostly for people who want to buy/trade their funds so it kind of makes sense that they'd lag behind on offering commission free trading on stocks and non vanguard etf's.",
        "created_utc": 1577993579,
        "id": "fcv2zk0",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcv2zk0/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578022379.0
    },
    {
        "author": "joshhhkk",
        "body": "Good. Because I was about to transfer money from Vanguard to Fidelity",
        "created_utc": 1577992030,
        "id": "fcv09wk",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcv09wk/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578020830.0
    },
    {
        "author": "Jakeep16",
        "body": "Didn't mean my comment in a rude way either. Just giving an option for a better yield. Also quickly looked at my Fidelity account and it shows for 3 month CD a few options to get 1.6%, 6 month was up to 1.65%. If you look around enough, you will find CD's with better rates than the one you mentioned in your post",
        "created_utc": 1579489834,
        "id": "ff1zipn",
        "permalink": "/r/investing/comments/er6dfz/are_there_any_safe_on_the_level_of_cds_or_money/ff1zipn/",
        "score": 3,
        "subreddit": "investing",
        "created": 1579518634.0
    },
    {
        "author": "Dmillehe",
        "body": "So interactive brokers is offering fractional stocks so... based on the events of free commission trading Schwab will offer it next then TDA then E*TRADE then fidelity? 🤪🤪\n\nEdit: added E*TRADE",
        "created_utc": 1578840121,
        "id": "fe2lquf",
        "permalink": "/r/wallstreetbets/comments/emwlz6/weekend_discussion_thread_january_1012_2020/fe2lquf/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1578868921.0
    },
    {
        "author": "MikeThePutz",
        "body": "Cyberspace\n\nEdit: seriously though: fidelity and IB for their short data. And S3 for short interest intramonth.",
        "created_utc": 1578849850,
        "id": "fe3jo55",
        "permalink": "/r/wallstreetbets/comments/enp896/pton_short_interest_and_borrow_rates_update_as_of/fe3jo55/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1578878650.0
    },
    {
        "author": "16CCZ71RG",
        "body": "It depends on what your investment goals are. Regardless of what funds or ETFs you decide on, your asset allocation is probably the most important thing to get right based on your risk tolerance.\n\nWhatever you decide, it's best to keep it simple if you're new to investing.\n\nCheck the big 3 brokerages (Fidelity, Vanguard and Schwab) for recommendations on creating starter portfolios.\n\nHere's a good article to get you started:\n\n[3 Fund Portfolio](https://www.wallstreetphysician.com/three-fund-portfolios-using-fidelity-index-funds/)",
        "created_utc": 1580097933,
        "id": "ffplen5",
        "permalink": "/r/stocks/comments/euhy7p/which_fidelity_mutualetf_funds_should_i_be/ffplen5/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1580126733.0
    },
    {
        "author": "usdenick",
        "body": "I like Ally. I'm a new investor and still like keeping most of my savings in cash.\n\nWith Ally I can instantly move my money from my HYSA into the brokerage when I see a good investment. \n\nFidelity and the others would require a transfer that would take several days or I would need to keep the money at Fidelity collecting no interest.",
        "created_utc": 1578146553,
        "id": "fd2fpoj",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd2fpoj/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578175353.0
    },
    {
        "author": "CommonPast",
        "body": "What if you do the wash sale on different platforms e.g sell on Robinhood, buy back on Fidelity?\n\nAlso, aren't we too late for 2019 tax loss harvesting?",
        "created_utc": 1578016514,
        "id": "fcw3txq",
        "permalink": "/r/investing/comments/ej87wf/i_sold_some_stock_for_a_total_lose_of_4500_if_i/fcw3txq/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578045314.0
    },
    {
        "author": "parkeyb",
        "body": "Serious question - Investment products aside, why do people use Vanguard over Fidelity when Fidelity’s tech, website, and service is so damn good?",
        "created_utc": 1578000402,
        "id": "fcveh3m",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcveh3m/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578029202.0
    },
    {
        "author": "KnickedUp",
        "body": "Fidelity charges $75!",
        "created_utc": 1578008355,
        "id": "fcvrche",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcvrche/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578037155.0
    },
    {
        "author": "KnickedUp",
        "body": "I've been wondering the same. I have accounts on both, but the Fidelity tech and cust service is so much friendlier to use, I have been moving more and more over there.",
        "created_utc": 1578008399,
        "id": "fcvrewg",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcvrewg/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578037199.0
    },
    {
        "author": "87880917",
        "body": "Selling everything will be a taxable event, unless this is a retirement account. \n\nYou may keep VOO and transfer in-kind to Fidelity, and continue to hold it there. There is no requirement to sell it.",
        "created_utc": 1578069869,
        "id": "fcxsl07",
        "permalink": "/r/StockMarket/comments/ejgwfv/question_on_transferring_to_a_new_brokerage/fcxsl07/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1578098669.0
    },
    {
        "author": "Cruian",
        "body": "Will this be a tax advantaged account (such as IRA) or taxable account? Especially if this is a tax advantaged account, Fidelity and Schwab offer $1 initial minimums on their mutual funds, their index ones have some of the lowest expense ratios available right now. They're also 2 of the 3 preferred brokerages of /r/personalfinance.\n\n&amp;#x200B;\n\nIt sounds like penny stocks generally aren't reccommeneded: [https://www.reddit.com/r/investing/comments/ekhxyk/is\\_there\\_ever\\_valid\\_cases\\_for\\_investing\\_in/](https://www.reddit.com/r/investing/comments/ekhxyk/is_there_ever_valid_cases_for_investing_in/)\n\n&amp;#x200B;\n\n&gt;ETFs and/or Index funds\n\nMany ETFs are index funds.\n\nIndex fund or actively managed describes how the contents are chosen. ETF or mutual fund describes how it trades. You can pair either method of choosing contents with either method of trading for 4 possible combinations.",
        "created_utc": 1578267286,
        "id": "fdc549e",
        "permalink": "/r/investing/comments/ekkyf7/is_buying_an_etf_andor_index_funds_along_with_a/fdc549e/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578296086.0
    },
    {
        "author": "SirGlass",
        "body": "Well with your 401k you only have access to a limited number of funds chosen by your 401k provider , robinhood has no bonds (out side of bond funds)\n\nWith robinhood you could buy one of the 100s of municipal bond ETFs. However if you want to buy specific bonds then yes Fidelity or Schwb may be your best bet however not all bonds are really tradable\n\nMeaning when muni bonds go on auction sometimes the minimum bid is 100k+, and possibly the secondary market just isn't there because no one is selling or there are too few sellers its just not worth to list them.\n\nAlso on fidelity and schwab they kind of hide a lot of bonds lower than a AA, mostly because lots of people are ignorant on bonds and think bonds=safe then might see a bond paying 10% interest and think thats a safe way to earn 10% (not realizing its rating is like CCC)\n\nEDIT\n\nIf you tell me the bond I can see if schwab has it",
        "created_utc": 1578846952,
        "id": "fe38j2t",
        "permalink": "/r/investing/comments/enpc6v/investing_into_individual_municipal_bonds/fe38j2t/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578875752.0
    },
    {
        "author": "iWOCuplikethis",
        "body": "Fidelity has several good zero fee MF options and even if you are paying for something like ITOT the teeny expense is well worth it to have your portfolio stay current and balanced with no effort.",
        "created_utc": 1578853283,
        "id": "fe3vpec",
        "permalink": "/r/investing/comments/enqhlw/etfs_are_outdated_and_dont_belong_in_any/fe3vpec/",
        "score": 3,
        "subreddit": "investing",
        "created": 1578882083.0
    },
    {
        "author": "sinatra86",
        "body": "Any actual broker...TDA, Fidelity, Etrade, etc.",
        "created_utc": 1578416704,
        "id": "fdh6xsl",
        "permalink": "/r/wallstreetbets/comments/ele3a9/best_app_to_short_stocks/fdh6xsl/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1578445504.0
    },
    {
        "author": "xler3",
        "body": "i use fidelity why did you omit fidelity in your post\n\ni demand an edit",
        "created_utc": 1578433379,
        "id": "fdi072t",
        "permalink": "/r/wallstreetbets/comments/elhbjc/why_does_almost_every_broker_have_a_really_stupid/fdi072t/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1578462179.0
    },
    {
        "author": "efitz11",
        "body": "Schwab was commission free before Fidelity was",
        "created_utc": 1578436802,
        "id": "fdi6vyb",
        "permalink": "/r/stocks/comments/eldfjf/any_hidden_fees_with_charles_schwab/fdi6vyb/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1578465602.0
    }
]