[
    {
        "author": "LatinoMuyFinO",
        "body": "Some Options:\n\nBYND Calls: I shorted this today from $138 to $135. Could have made more if i had held til close but fuck it. They took a beating and am expecting a bounce back from the 132-133 level. I'll be going short term calls tomorrow for a quick scalp at open.\n\nPTON Calls: Same as above \\^ bounce back from the $40-41 level\n\nDKNG: FOMO if you want. This thing could pop to $40 or drop to $30. I won't be touching this until at least another week or so. Risky af but mad tendiez if you guess the right direction (calls/puts)\n\nCOTY: Same as above, but I expect this will hold better than DKNG since its already near rock bottom prices. Might throw a few thousand at it tomorrow in calls.\n\nSPY: i personally don't play SPY, but there is mad tendiez to be made if you get in calls at a dip (around the 295-297 range) or puts (around the 301-303 range).\n\nCCL, RCL, NCLH: Easy plays to go long on a dip, Beaten up cruise stocks that have been forming new bottoms. Easy 2x 3x bagger if you get in before a large move up in the premarket. They seem a bit overheated lately though so I would be careful of a pullback soon, in which case go short term puts.\n\nAAL, DAL, UAL, LUV, SAVE: Same as above\n\nAAPL, MSFT, AMD, NVDA: Tech saw a big hit today, might be a good spot to buy the dip. I'll be watching closely tomorrow if we continue to fall in tech at open, then I'm buying the dip for sure.\n\nBABA, TSM: GYNA stocks if you want i guess\n\n&amp;#x200B;\n\nGood luck making your parents money back you fucking autist.",
        "created_utc": 1590537988,
        "id": "frxdvjh",
        "permalink": "/r/wallstreetbets/comments/gr8jbo/parents_let_me_trade_with_their_money/frxdvjh/",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1590566788.0
    },
    {
        "author": "IKnowTheCodings",
        "body": "Had around 100k invested 4 years ago. Largest positions since then were GGP, WNC, AMD, and NCLH. I figured I’ve pulled out about 160k over this time so this is 100% house money.",
        "created_utc": 1590545225,
        "id": "frxqfxy",
        "permalink": "/r/wallstreetbets/comments/grap5c/4_years_of_gains/frxqfxy/",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1590574025.0
    },
    {
        "author": "antivin",
        "body": "I bought AMD at $9 but sold at $15. FML",
        "created_utc": 1588810573,
        "id": "fppwlou",
        "permalink": "/r/wallstreetbets/comments/gerkgx/they_said_buy_the_dip/fppwlou/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1588839373.0
    },
    {
        "author": "IKnowTheCodings",
        "body": "A lot. Usually 90%. A couple times More like 75/25 and right now is probably the most diversified I’ve been with about 60/40 AMD/NCLH. Also, stay out of margin. Can’t hold if your broker makes you sell.",
        "created_utc": 1590545942,
        "id": "frxrmn4",
        "permalink": "/r/wallstreetbets/comments/grap5c/4_years_of_gains/frxrmn4/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1590574742.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "Had a good friend\nWho bought amd$ at 11$ \n\n\nFucker went to Dominican Republic and died when he walked in the beach and got some shit under his foot 🦶 \n“Parasite “\n\nAnyway he left all those amd$ shares to his sister \n\n\nAbout 19k worth at the time \n\nShe sold today for about 90k",
        "created_utc": 1590527578,
        "id": "frwu1qe",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frwu1qe/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1590556378.0
    },
    {
        "author": "IKnowTheCodings",
        "body": "I bought into AMD after joining WSB though. Was at around 400k before that.",
        "created_utc": 1590548533,
        "id": "frxvvse",
        "permalink": "/r/wallstreetbets/comments/grap5c/4_years_of_gains/frxvvse/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1590577333.0
    },
    {
        "author": "BlckKnfe",
        "body": "The best time to buy AMD was in 2016. The second best time is now.",
        "created_utc": 1589047449,
        "id": "fq1o9se",
        "permalink": "/r/stocks/comments/ggiafk/some_good_news_coming_amds_way/fq1o9se/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1589076249.0
    },
    {
        "author": "ltsPricedIn",
        "body": "You could say this about any successful stock really\n\nImagine buying AMD at $12",
        "created_utc": 1588808886,
        "id": "fpptkzl",
        "permalink": "/r/wallstreetbets/comments/gerkgx/they_said_buy_the_dip/fpptkzl/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1588837686.0
    },
    {
        "author": "theknowndude",
        "body": "i miss the old AMD, the outperform AMD\n\nstraight going up AMD, the no drop AMD\n\ni hate the new AMD, the make me GUH AMD\n\nno momentum AMD, the theta burn AMD\n\n-by me, a faggot",
        "created_utc": 1588791926,
        "id": "fpowmtw",
        "permalink": "/r/wallstreetbets/comments/gehav8/daily_discussion_thread_for_may_06_2020/fpowmtw/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1588820726.0
    },
    {
        "author": "iLoveRuthie",
        "body": "MU, AMD, MSFT, ZM, FB, NFLX, SQ, BA, UBER, INO\n\nHighly liquid with lots of movement and selling INO puts is easy money for now.",
        "created_utc": 1590634495,
        "id": "fs1s5d9",
        "permalink": "/r/options/comments/grwx33/if_you_had_to_pick_10_companies_to_trade_options/fs1s5d9/",
        "score": 22,
        "subreddit": "options",
        "created": 1590663295.0
    },
    {
        "author": "Fizzy_T",
        "body": "The amount of political comments here is getting annoying. Fuck all u losers. \n\nAMD 6/19 55c",
        "created_utc": 1590960669,
        "id": "fsgmjjk",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsgmjjk/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1590989469.0
    },
    {
        "author": "OriginalGravity8",
        "body": "TL;DR\n\nAMD Calls",
        "created_utc": 1589753414,
        "id": "fqyrn14",
        "permalink": "/r/stocks/comments/gln51p/nvidia_know_what_you_own/fqyrn14/",
        "score": 19,
        "subreddit": "stocks",
        "created": 1589782214.0
    },
    {
        "author": "smartalectb",
        "body": "I haven't used robinhood in years since they locked me out for day trading and I can't figure out options on interactive brokers where I have my long positions, their UI is too complicated. So when I saw robinhood shit itself a few weeks back, I wanted in on the action the action. I started with 5k and just just bought puts and calls on amd for a few weeks, learning how options worked. Then when I had enough money in the account for tesla options, every time Elon would tweet something dumb and the stock would fall, I would buy a call. Then after a few days, I would buy a put because the next tweet was sure to come. Rinse and repeat.\n\nRight now I am holding 3 tsla 6/5 $810 calls.",
        "created_utc": 1589493465,
        "id": "fqnelk4",
        "permalink": "/r/wallstreetbets/comments/gjw1sa/my_first_attempt_at_options/fqnelk4/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1589522265.0
    },
    {
        "author": "thelastkek",
        "body": "Bagheld NET ROKU AMD calls and got laid off today. Guh",
        "created_utc": 1588911921,
        "id": "fpufyks",
        "permalink": "/r/wallstreetbets/comments/gfe3sr/what_are_your_moves_tomorrow_may_08_2020/fpufyks/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1588940721.0
    },
    {
        "author": "CoronavirusWithLime",
        "body": "Y'all remember when AMD was the flavor of the week every single week and now it's in the dirt",
        "created_utc": 1588812682,
        "id": "fpq0etv",
        "permalink": "/r/wallstreetbets/comments/gevdqf/what_are_your_moves_tomorrow_may_07_2020/fpq0etv/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1588841482.0
    },
    {
        "author": "makepeace12",
        "body": "Can I just say how when I first joined WSB back in Dec/Jan, the big thing was BYND, then SPCE, AMD, etc.etc. There was always a few veterans who would say, 'Dec 2018 was a nightmare, you kids don't know shit about the market'.\n\nI feel like if you survived Feb 21st until today and are still positive, I think you've earned a merit badge. Trading back in Jan was like 'pick a call, any call two weeks out, tendies'.\n\nNow I've actually had to learn, went from 15k to 1k back to 30k then to 5k back up to 20k. I lost 2k on a PTON YOLO back in Feb. Lost another 3k on AIMT. On jesus christ, lost 3k on a dumb ass YOLO on ALLY 03/20 28c. Today was a 7k positive day. I've learned so fucking much in the past few months. \n\nBut here we stand. Hats off to you degenerate fucks. And welcome newbies, now go fuck yourselves and buy SPY puts.",
        "created_utc": 1588903226,
        "id": "fpu2fit",
        "permalink": "/r/wallstreetbets/comments/gfe3sr/what_are_your_moves_tomorrow_may_08_2020/fpu2fit/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1588932026.0
    },
    {
        "author": "IKnowTheCodings",
        "body": "I had to hold MU for almost 18 months to make money on it but at that point it was only about 1/4 of my account. And I had made some money selling puts on it so it was a bit easier to deal with.\n\nI was also down like 100k on AMD before it came back and started it’s huge run. A long time ago I had a position in a company called visteon I think it was VSTN, pretty sure they’re not around anymore. Was planning to hold through earnings and it dipped before and I panic sold. Lost 30k which was a very large portion of my account at the time. Had I held through earnings I would have made back the 30k and another 50k. Learned not to panic sell. I probably wouldn’t trade a company like that now either way though.",
        "created_utc": 1590546893,
        "id": "frxt6ke",
        "permalink": "/r/wallstreetbets/comments/grap5c/4_years_of_gains/frxt6ke/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1590575693.0
    },
    {
        "author": "introspective_lemon",
        "body": "100% the main thing OP is missing is the software aspect. Nvidia isn’t just a “chip” company anymore. I saw their latest GTC keynote and most of it was covering their various SDKs and tools for various markets (DL, robotics, autonomous vehicles, graphics).\n\nGranted, I see both Intel and AMD getting a foothold into some of these markets as well. I think it’s the case that all of them can “win” and compete with Nvidia by offering more open solutions at lower cost. But it’s going to be a challenge for them for sure.",
        "created_utc": 1589764652,
        "id": "fqzcrwq",
        "permalink": "/r/stocks/comments/gln51p/nvidia_know_what_you_own/fqzcrwq/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1589793452.0
    },
    {
        "author": "cryptosai",
        "body": "Okay thanks. Shorting AMD",
        "created_utc": 1588876853,
        "id": "fpsobt1",
        "permalink": "/r/wallstreetbets/comments/gfcdno/hey_alexa_how_can_i_borrow_5000_more_dollars_from/fpsobt1/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588905653.0
    },
    {
        "author": "Unlucky-Prize",
        "body": "**We were of course mentioned:**\n\n*“And, hey, it took a pandemic, but it was already happening before this with Wall Street Bets and cryptocurrency,” Camillo said by phone. “Now they’re wanting to go one layer deeper. OK I did that, I did crypto, OK now I own Tesla, I get it. But there has to be more to investing than just Tesla.”*\n\n**No, all there is to investing is owning Tesla, in call form specifically. Mr Camillo clearly has not read that many posts here.**\n\n*\"The fingerprints of tiny investors are all over the options market. Trades consisting of just one contract now account for 13% of total volume, according to Goldman Sachs Group Inc. analysts led by John Marshall. That supports a view that “individual investor active trading is playing an increased role in market volatility.” In some popular stocks, like Chipotle Mexican Grill Inc. and Alphabet Inc., small options trades account for nearly a third of total volume.\"*\n\n**CMG options? Really? Not AMD? Or DIS? Or MSFT? Or TSLA? Or MRNA? Chipotle???**\n\n*That’s been true for Ameer Umarov, a cab driver in Arizona with an interest in math and a passion for video games. Months ago, when he realized the coronavirus was growing into a global health crisis, he reactivated his Amazon.com account to make some purchases. Not for masks or hand sanitizer -- for books on stock trading. Two a week, at one point.*\n\n*When equities started surging in late March, Umarov stayed away, scared by the volatility. He was ready to act by the first week of April. He bought shares of Boeing Co., a bad decision that set him back more than $4,000. But a stake in Halliburton Co. brought him $9,800, after he sold shares on the day of a 16% rally late last month. A few other purchases -- Goldman Sachs and Micron Technology Inc., among them -- yielded mixed results. All told, Umarov is down some $400 since he began.*\n\n**Definitely more losses than that.**\n\n*“It’s a gamble, but a highly intellectual gamble,” he said by phone. “It’s about knowledge and risk, but especially for guys like me, it’s all about sheer luck.”*\n\n**He gets it.**\n\n*This month, he stopped buying books and instead signed up for a virtual trading boot-camp. He paid $4,100 for two days of 8 a.m. to 4 p.m. classes, where he learned about concepts like support, resistance, and trading on gaps. To Umarov, the course is a long-term investment, and he’s decided eventually he wants to make trading his full-time job.*\n\n**I really hope that's not code for True Trading Group.**\n\n*“I have no idea how it’s going to go,” he said. “But it will be stupid not to try.”*\n\n**Sums up this sub entirely.**\n\n**BTW, Ameer, you should reveal yourself. I assume you are reading this.**",
        "created_utc": 1590191066,
        "id": "fri1w5d",
        "permalink": "/r/wallstreetbets/comments/gouixl/bloomberg_has_found_us_out_again_some_choice/fri1w5d/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1590219866.0
    },
    {
        "author": "MesmericWar",
        "body": "Calls.  You want puts\n\nEdit: AMD is pretty much a YOLO at this point",
        "created_utc": 1589328153,
        "id": "fqfnl0w",
        "permalink": "/r/wallstreetbets/comments/gijkkd/i_thought_this_was_america/fqfnl0w/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1589356953.0
    },
    {
        "author": "cuddlypolarbear1",
        "body": "Not looking good. I went full retard on AMD calls. Valhalla here I come",
        "created_utc": 1590639769,
        "id": "fs20eys",
        "permalink": "/r/wallstreetbets/comments/grr84s/what_are_your_moves_tomorrow_may_28_2020/fs20eys/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1590668569.0
    },
    {
        "author": "theth1rdchild",
        "body": "They argued *hard* against AMD all the way up through 20 dollars IIRC. If you knew the sector you knew they were full of shit, they didn't even try to present a compelling argument, because they didn't need to. If you know the sector (whatever the sector is) you just put your money where it needs to go. If you're going to MF as your only resource, you probably don't know the sector.",
        "created_utc": 1589819650,
        "id": "fr1h5zz",
        "permalink": "/r/investing/comments/gm3iq6/two_years_ago_i_asked_about_buying_chipotle_one/fr1h5zz/",
        "score": 12,
        "subreddit": "investing",
        "created": 1589848450.0
    },
    {
        "author": "CramersAsshole",
        "body": "Would you eat out Lisa Su’s asshole for 500 AMD shares?",
        "created_utc": 1588394300,
        "id": "fp8jyuw",
        "permalink": "/r/wallstreetbets/comments/gbpcs2/weekend_discussion_thread_for_the_weekend_of_may/fp8jyuw/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588423100.0
    },
    {
        "author": "autismovaccination",
        "body": "If I had a gun with 2 bullets and AMD, TSLA and SHOP were in the same room I’d shoot AMD twice.",
        "created_utc": 1588877094,
        "id": "fpsou4w",
        "permalink": "/r/wallstreetbets/comments/gf3vim/daily_discussion_thread_for_may_07_2020/fpsou4w/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1588905894.0
    },
    {
        "author": "zaktrades123",
        "body": "Cramer pumping my favorite company’s NVDA, AMD and QCOM\n\nMoment of silence for them",
        "created_utc": 1589409261,
        "id": "fqjfmtl",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqjfmtl/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589438061.0
    },
    {
        "author": "IKnowTheCodings",
        "body": "The huge dips spikes were a massive AMD sell off from like 36 down to 16, Christmas 2018, and beer flu. Those drops are all shares.\n\nI do a really small percentage when buying options. Like I have 8k in an AMD spread right now. A strategy I like is to sell options to collect some premium and then use the premium to buy options I like. It usually turns out to be a wash though where the option seller wins.",
        "created_utc": 1590549102,
        "id": "frxwsmv",
        "permalink": "/r/wallstreetbets/comments/grap5c/4_years_of_gains/frxwsmv/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1590577902.0
    },
    {
        "author": "TenMegaFarads",
        "body": "I took the Robintrack most popular (http://robintrack.net/leaderboard) and put the numbers in a spreadsheet, and multiplied by current stock price.\n\nAMZN is far and away the most-invested in by dollar amount, with RH users holding $377.08 million in shares.\n\nTSLA and AAPL are the only others over $100 million, with $174m and $112m respectively.\n\nMSFT, DIS, and NFLX are next with $79m, $59m, and $51m. Things then start to drop off quickly: FB $41m, BABA $37m, BA $34m, SBUX $14m, and AMD $11m are the only others above the $10m mark.\n\nThe #1 and 2 by number of shares, F and GE, are way down the list by dollar amount at 27th and 28th.",
        "created_utc": 1589751701,
        "id": "fqyo05p",
        "permalink": "/r/wallstreetbets/comments/glmbkl/what_are_your_moves_tomorrow_may_18_2020/fqyo05p/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589780501.0
    },
    {
        "author": "Incognito512",
        "body": "he only suggested $AMD. $NVDA and $QCOM; the retard strength stocks",
        "created_utc": 1589427035,
        "id": "fqkgw09",
        "permalink": "/r/wallstreetbets/comments/gjcaqq/jim_cramer_reveals_his_playbook_says_investors/fqkgw09/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589455835.0
    },
    {
        "author": "subnative1",
        "body": "oh yeah AMD? how bout I show *you* an **advanced micro device**",
        "created_utc": 1590527767,
        "id": "frwuffh",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frwuffh/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1590556567.0
    },
    {
        "author": "thxfrthmmry",
        "body": "This is the official AMD prayer post.\n\nAll hail Su BAE",
        "created_utc": 1590611109,
        "id": "fs0kf3q",
        "permalink": "/r/wallstreetbets/comments/grr84s/what_are_your_moves_tomorrow_may_28_2020/fs0kf3q/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1590639909.0
    },
    {
        "author": "allianc4",
        "body": "You just compared the price per share of one stock to the price per share of other stocks with no valuation metrics...jesus.\n\nBy your logic I’m going to buy puts on NVDA because it’s over $300 while AMD and INTC are already so low.\n\nEdit: it appears you edited out some of your post to appear less autistic, it’s okay bro.",
        "created_utc": 1589487423,
        "id": "fqn26zi",
        "permalink": "/r/wallstreetbets/comments/gju21l/southwest_ceo_were_losing_1b_every_month_business/fqn26zi/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1589516223.0
    },
    {
        "author": "LiamPhlegmsworth",
        "body": "SPY/MGM/TWTR/AMD/SNE calls going into the weekend. Whole account in except $30. I'm at peace with my decisions.",
        "created_utc": 1590787135,
        "id": "fs8qgbu",
        "permalink": "/r/wallstreetbets/comments/gt08v2/weekend_discussion_thread_for_the_weekend_of_may/fs8qgbu/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1590815935.0
    },
    {
        "author": "pvjumper05",
        "body": "Comments make it seem like AMD is down 10%\n\nIt’s half a percent...",
        "created_utc": 1588875894,
        "id": "fpsmbz3",
        "permalink": "/r/wallstreetbets/comments/gf3vim/daily_discussion_thread_for_may_07_2020/fpsmbz3/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588904694.0
    },
    {
        "author": "oregon_forever",
        "body": "When will AMD gain its retard strength back?",
        "created_utc": 1590526712,
        "id": "frwsarv",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frwsarv/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1590555512.0
    },
    {
        "author": "IKnowTheCodings",
        "body": "About half AMD and half NCLH, a small call spread on AMD as well.",
        "created_utc": 1590545310,
        "id": "frxql0z",
        "permalink": "/r/wallstreetbets/comments/grap5c/4_years_of_gains/frxql0z/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1590574110.0
    },
    {
        "author": "Chuchuchu01",
        "body": "If you don’t love AMD at -10%, you don’t deserve him at green the same day!",
        "created_utc": 1590606817,
        "id": "fs0bicb",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/fs0bicb/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1590635617.0
    },
    {
        "author": "Thierr",
        "body": "The AMD story is kind of similar actually",
        "created_utc": 1589755960,
        "id": "fqywwuc",
        "permalink": "/r/stocks/comments/gln51p/nvidia_know_what_you_own/fqywwuc/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1589784760.0
    },
    {
        "author": "narcandistributor",
        "body": "My portfolio is patriotic. Calls on IWM, AMD, CHEF, TSLA, DIS, Puts on Gyna: BABA, HUYA",
        "created_utc": 1590014833,
        "id": "fraa8tf",
        "permalink": "/r/wallstreetbets/comments/gnisnu/what_are_your_moves_tomorrow_may_21_2020/fraa8tf/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1590043633.0
    },
    {
        "author": "pump4iron",
        "body": "Holy shit...I opened 50 AMD call credit spread 54/56 calls without realizing that i'm risking $9K for a max gain of just 900 bucks..  FML",
        "created_utc": 1588638904,
        "id": "fpidwo6",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fpidwo6/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588667704.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "I HEAR PEOPLE CHEERING OUTSIDE !! And sirens \n\nHow they know I had APPLE$ and AMD$ calls \n\n???",
        "created_utc": 1589238119,
        "id": "fqbjg8z",
        "permalink": "/r/wallstreetbets/comments/ghvey0/what_are_your_moves_tomorrow_may_12_2020/fqbjg8z/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589266919.0
    },
    {
        "author": "Benny303",
        "body": "Agreed, I was an Intel till i die man for a very long time and would have never bought that \"AMD trash\" now my next processor is going to be AMD without a doubt, unless Intel can find a serious way to compete.",
        "created_utc": 1589049201,
        "id": "fq1tra1",
        "permalink": "/r/stocks/comments/ggiafk/some_good_news_coming_amds_way/fq1tra1/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1589078001.0
    },
    {
        "author": "ChoochMMM",
        "body": "I mean buying AMD longterm at these prices is kind of a no brainier, right?",
        "created_utc": 1590591924,
        "id": "frzgr9p",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/frzgr9p/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1590620724.0
    },
    {
        "author": "NovelOrganization5",
        "body": "I’m convinced that AMD will be in the purgatory of the 50-60 range for the rest of eternity",
        "created_utc": 1590550107,
        "id": "frxydkg",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frxydkg/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1590578907.0
    },
    {
        "author": "Chuchuchu01",
        "body": "omg AMD is doing it, this mad man is actually trying to go from -10% to green in a day",
        "created_utc": 1590601490,
        "id": "fs00dw0",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/fs00dw0/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1590630290.0
    },
    {
        "author": "Randomness898",
        "body": "They make chips like AMD. Get on board.",
        "created_utc": 1590442452,
        "id": "frt3ch8",
        "permalink": "/r/wallstreetbets/comments/gqi8ye/what_are_your_moves_tomorrow_may_26_2020/frt3ch8/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1590471252.0
    },
    {
        "author": "TiltMastery",
        "body": "Every pc enthusiasts is switching to AMD. They arw gaining market share and that's a fact. Idk what is do meme about that",
        "created_utc": 1589047110,
        "id": "fq1n0q9",
        "permalink": "/r/stocks/comments/ggiafk/some_good_news_coming_amds_way/fq1n0q9/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1589075910.0
    },
    {
        "author": "austinblacknj",
        "body": "I see so many people talking about the same stocks and options here and buying the most autistic shit. Listen here faggots, $cost ER is the worst, imo don’t do it, it always rubber bands and leaves you dead too theta gang, AMD options chain is dogshit, Disney is a horrible fucking stock for options as well, literally the king of pop and fade, idk yall driving me nuts with these plays today",
        "created_utc": 1590601102,
        "id": "frzzkwu",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/frzzkwu/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1590629902.0
    },
    {
        "author": "secondliaw",
        "body": "I sold my kidney so I can buy more AMD",
        "created_utc": 1588352757,
        "id": "fp6i65i",
        "permalink": "/r/stocks/comments/gblsnc/anyone_ever_sell_personal_possessions_solely_to/fp6i65i/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1588381557.0
    },
    {
        "author": "WinterWeather5",
        "body": "I think SBUX will acquire AMD",
        "created_utc": 1588722257,
        "id": "fplz2e0",
        "permalink": "/r/wallstreetbets/comments/ge50yl/what_are_your_moves_tomorrow_may_06_2020/fplz2e0/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588751057.0
    },
    {
        "author": "Money_Turtle",
        "body": "I don't know why but I feel like if I am not doing something with my money I am losing out. I have to be like 90% invested at all times or I feel anxious with fomo. Even if its just writing OTM CCPs for a couple of bucks.  \n\nI am mostly theta gang at the moment. \n\nSold AMD 5/15 56Cs, 53Ps\n\nLong Gold and Silver leaps\n\nSmall position in VGK puts that have no volume. They are going for nearly intrinsic value even though they have more than a month in theta left (Please someone buy these from me, volume was 3 today haha)",
        "created_utc": 1589264169,
        "id": "fqcot15",
        "permalink": "/r/wallstreetbets/comments/ghvey0/what_are_your_moves_tomorrow_may_12_2020/fqcot15/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589292969.0
    },
    {
        "author": "Randomness898",
        "body": "The popular chip stocks didn't do so well today despite SPY being up. AMd, NVDA, and CMG all down 3%+.",
        "created_utc": 1590535063,
        "id": "frx8kz4",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frx8kz4/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1590563863.0
    },
    {
        "author": "wallthrowawaystreet",
        "body": "You know how people say to save money you put a little away, little by little, and it all adds up?\n\nMotherfucker, I'm doing the opposite, I'm losing little by little and it's all adding up.\n\nExiting positions, entering slightly worse positions.\n\nAMD you bitch go up tomorrow.",
        "created_utc": 1589842798,
        "id": "fr2s2fm",
        "permalink": "/r/wallstreetbets/comments/gm9211/what_are_your_moves_tomorrow_may_19_2020/fr2s2fm/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1589871598.0
    },
    {
        "author": "ReflectAA",
        "body": "You have to really study the company and the industry. Probably impossible to do so with a bunch of companies and industries at the same time so my advice is to pick a few industries and just lock in on those. \n\nI’ve caught a few. I had Best Buy in 2014, AMD in 2016, Geron in 2015, Valeant in 2017, Apple in 2018, and was ahead of the runup for all of them. But it was months and months of research to where I knew the stock was coming before the public did.\n\nOnce you have industry and company specific knowledge you learn to read between the lines. For example, the presentations Geron releases data in are the same time every year, so naturally if they have big data and that event is 2 months away, you can infer big data is coming out, even if they haven’t announced such yet. And I studied the tech industry to know that AMD was likely to capture significant market share before those earnings ever happened. Etc etc\n\nSo yes it is possible but the important point is you can’t be everywhere at once. I pick a focus area and ignore 100% of noise outside those areas. Any high-growth company outside my research area is automatically eliminated, no matter how good it sounds.\n\nUsually that means my high-growth portfolio is only 1-3 stocks at any given time. I don’t diversify at all. If you look at my list of successes, it’s not a coincidence I only got one per year. Because it took up to a year of digging just to find each one.\n\nThis post ended up way longer than I planned. Sorry lol",
        "created_utc": 1589995159,
        "id": "fr9c6be",
        "permalink": "/r/investing/comments/gnewh1/how_to_find_stocks_before_they_take_off/fr9c6be/",
        "score": 8,
        "subreddit": "investing",
        "created": 1590023959.0
    },
    {
        "author": "thetasoilder",
        "body": "The holy Trinity; SPCE, AMD, TSLA",
        "created_utc": 1588812887,
        "id": "fpq0s11",
        "permalink": "/r/wallstreetbets/comments/gewlb7/stocksoptions_to_owntrade_during_covid19_go/fpq0s11/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1588841687.0
    },
    {
        "author": "way2lazy2care",
        "body": "AMZN was above it's all time high in 2013.\n\nedit: I'm not super bullish on AMD, but using all time highs as a justification not to buy loses a ton of context when they are about 25-30% the market cap of their comparable competitors.",
        "created_utc": 1589052188,
        "id": "fq229x4",
        "permalink": "/r/stocks/comments/ggiafk/some_good_news_coming_amds_way/fq229x4/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1589080988.0
    },
    {
        "author": "thewordishere",
        "body": "What other stock do you need besides AMD?",
        "created_utc": 1590636719,
        "id": "fs1vqse",
        "permalink": "/r/wallstreetbets/comments/grrtkp/wow_we_made_it_onto_the_front_page_again/fs1vqse/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1590665519.0
    },
    {
        "author": "cuckboi784",
        "body": "AMD jumped up EOD allowing me to send my wife and her boyfriend on fun getaway to the beach for the weekend!",
        "created_utc": 1590815403,
        "id": "fsa1pw8",
        "permalink": "/r/wallstreetbets/comments/gt08v2/weekend_discussion_thread_for_the_weekend_of_may/fsa1pw8/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1590844203.0
    },
    {
        "author": "hiddenwhere",
        "body": "Half my portfolio gone.  ATVI and AMD calls hitting. Pray for me",
        "created_utc": 1590525793,
        "id": "frwqexu",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frwqexu/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1590554593.0
    },
    {
        "author": "shortgamegolfer",
        "body": "What should I sell from my autist portfolio to buy this obvious winner? AMD, JD, TWLO, or MSFT?\nFuck it, buying it with more margin.",
        "created_utc": 1589769482,
        "id": "fqzktd1",
        "permalink": "/r/wallstreetbets/comments/glseim/hidden_gem_upld/fqzktd1/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1589798282.0
    },
    {
        "author": "bridog19",
        "body": "Flipping between triple leveraged S&amp;P bear &amp; bull shares. AMD, AAPL, &amp; AMZN calls helped bring in the big single day gains",
        "created_utc": 1589506621,
        "id": "fqo3667",
        "permalink": "/r/wallstreetbets/comments/gjzuxf/global_recession_all_i_see_is_182_gains/fqo3667/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1589535421.0
    },
    {
        "author": "oregon_forever",
        "body": "All stonks will be blood green and AMD will be shitting the bed as always.\n\nOnce I sell AMD, it will skyrocket to $100 overnight, of course.",
        "created_utc": 1590613093,
        "id": "fs0okhz",
        "permalink": "/r/wallstreetbets/comments/grr84s/what_are_your_moves_tomorrow_may_28_2020/fs0okhz/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1590641893.0
    },
    {
        "author": "oregon_forever",
        "body": "Buying the AMD dip. It's now 17% below its March high while the rest of the tech companies are within 3-5% of their ATH.",
        "created_utc": 1590595038,
        "id": "frzn0fe",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/frzn0fe/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1590623838.0
    },
    {
        "author": "stacksandwhiskers",
        "body": "Give me a few reasons why AMD will skyrocket in the next few months. My portfolio is mainly AMD shares now 😇",
        "created_utc": 1590639484,
        "id": "fs1zzqj",
        "permalink": "/r/wallstreetbets/comments/grr84s/what_are_your_moves_tomorrow_may_28_2020/fs1zzqj/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1590668284.0
    },
    {
        "author": "DARPA1191969v1",
        "body": "I can give the perspective from a tech/software dev.\n\nIn my opinion, these are sort of different players. In fact, I would say that NVDA and AMD are far more analogous to each other than even AMD -&gt; AAPL, and certainly to MSFT. The  way that I see it, NVDA/AMD are fundamentally companies that are concerned with producing a *physical good* \\- literal chipsets and dies. AAPL seems to waver on the hardware side of things (they have been known to go proprietary in that arena, but have also loaned out work to INTC on more than one occasion). I most certainly see MSFT as a true software/PaaS/SaaS company - suffice to say that they are producing very little in the way of physical goods.\n\nI think the *soft/hardware* direction is important to mention, because that fundamentally plays into the way that these companies deal in the market. Developing hardware is a mind-bendingly expensive process (relatively speaking). It takes years of R&amp;D and cash on hand to fund something that is truly great. An example of this would be the move AMD made to Zen (which is based on the concept of 'chiplets'; highly-scalable many-core designs that are fundamentally different from their monolithic predecessors).\n\nIn terms of growth, I would have to say that I see two viable options here: *NVDA and MSFT*. MSFT is pretty easy to explain; they create a product that fundamentally has lower upstart costs (software development's most expensive attribute is the cost of human labor) and lower maintenance costs (I would think). There is some movement towards a more data-center driven profit scheme (which would require boots on ground hardware en masse), and Azure is certainly an AWS competitor, but I think we've yet to see them really go full throttle on that (I think it could be big if they did).\n\nNVDA is a leader from a technological perspective. GPU compute-cores are very specialized devices that are good at doing only a few things, but very, *very well.* NVDA has been hammering away at this technology for years - they know the game, and they know where the money is. Autonomous cars, drones...the computer viz recogition software for postal, for literally anything, runs on a platform that is fundamentally a GPU (very high level view here). Machine learning applications in this field at the data-center level (think machine learning on AWS) are absolutely dominated by NVDA; In fact I would go as far as to say there aren't really a lot of competitors out there that are bringing to the table what NVDA does (Honestly AMD has severely gimped even their consumer dies at this point).\n\n&amp;#x200B;\n\nI can elaborate more, but I'd go with MSFT and NVDA on this one.",
        "created_utc": 1588630100,
        "id": "fphydh4",
        "permalink": "/r/investing/comments/gdkx3v/nvdaamdmsftaapl_which_has_the_most_potential_for/fphydh4/",
        "score": 8,
        "subreddit": "investing",
        "created": 1588658900.0
    },
    {
        "author": "Howard_510",
        "body": "Wtf this is literally a replay of last Nov-Feb. We’ve had Tesla $1000c, MSFT $200c, AMD $60c and now SPCE $35c and BYND $120c all over again.\n\nAre we stuck in a simulation?",
        "created_utc": 1588721027,
        "id": "fplwvsn",
        "permalink": "/r/wallstreetbets/comments/ge50yl/what_are_your_moves_tomorrow_may_06_2020/fplwvsn/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1588749827.0
    },
    {
        "author": "waaaghbosss",
        "body": "Or we are cherry picking an example where his gamble luckily was correct, and ignoring when he was very wrong.  \n\n\n\n\"No way this is worth anywhere close to $25 billion or even $10 billion\"\nHes talking about snapchat, which is currently at 26 billion.  \nhttps://old.reddit.com/r/stocks/comments/6afd1w/snaplol/\n\nHes an annoying shit poster, not some magic stock picking Oracle\n\n\nHere is a fun one where is he pushing people to run from AMD,  when it was under $10.  It's currently at $53.\nhttps://old.reddit.com/r/stocks/comments/68mbsv/last_chance_to_get_out_of_amd/",
        "created_utc": 1589142087,
        "id": "fq75lf1",
        "permalink": "/r/stocks/comments/gh56hh/do_you_have_stocks_you_believe_can_grow_like/fq75lf1/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1589170887.0
    },
    {
        "author": "centech",
        "body": "Man if I had a dollar for every time AMD was the only bright spot in my portfolio...\n\nOh wait, I do!",
        "created_utc": 1589217530,
        "id": "fqae53x",
        "permalink": "/r/wallstreetbets/comments/ghkxmf/daily_discussion_thread_for_may_11_2020/fqae53x/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1589246330.0
    },
    {
        "author": "Xiaxs",
        "body": "MRNA - Loss\n\nSQ - Loss\n\nWMT - Loss\n\nAMD - Stagnant\n\nBABA - Green\n\nSo I still got some shit to lose.",
        "created_utc": 1589944050,
        "id": "fr7c8ay",
        "permalink": "/r/wallstreetbets/comments/gmyw1j/thank_you_reddit_advertisements_very_cool/fr7c8ay/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1589972850.0
    },
    {
        "author": "FluidSynergy",
        "body": "I sold at open on Tuesday, at 8am PST today I bought AMD 6/12 54c for 0.86, up 91%. DKNG 6/19 38c for 1.40, up 52%\nPlus i'm even on an Ino call and down 15% on some disney calls that i'll probably sell in the morning",
        "created_utc": 1590645990,
        "id": "fs28ven",
        "permalink": "/r/wallstreetbets/comments/grxopi/took_a_financial_investment_course_from_wsb/fs28ven/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1590674790.0
    },
    {
        "author": "AnAnonymousSource_",
        "body": "What does it say about AMD tomorrow?",
        "created_utc": 1590011122,
        "id": "fra648e",
        "permalink": "/r/wallstreetbets/comments/gnil4r/false_profit_its_simple_we_kill_the_gecko/fra648e/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590039922.0
    },
    {
        "author": "ScallyWag-Idiot",
        "body": "Went full autist Friday, shit might actually work out. The less you know the better?    \n    \nSPY 06/05 298C.    \n\nDAL 06/05 24C.    \n\nBAC 06/05 23C.    \n\nF 06/05 5C.    \n\nLYFT 06/12 37C.   \n\nGRPN 06/12 1.5C (100 contracts, 00.01-00.04 each this shit is going to rip).    \n\nPLUG 06/12 4.5C.    \n\nAMD 06/12 57C.",
        "created_utc": 1589773404,
        "id": "fqzr3l5",
        "permalink": "/r/wallstreetbets/comments/glmbkl/what_are_your_moves_tomorrow_may_18_2020/fqzr3l5/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1589802204.0
    },
    {
        "author": "McNoxey",
        "body": "Yo wanna hear king autist shit? \n\nMy first intro to stocks was with AMD. I bought 600ish shares at $10.20 as my very first play. Then i got high and tried to daytrade. Bought more at 15.20 before Ryzen launch, and then it started to drop. I panic sold. Then it was going up again between 14 and 15ish. I decided it was time to stop. So I set a buy above and below the current price.\n\nForgot to cancel one after the other filled and I doubled up on margin. Next day, -10%. Then it continued sliding until like... $9. Was up around 40%, then down nearly 80% on my first play. Then I got margin called. I decided the best play was to straight up ignore the emails from questrade. Play fucking dumb - who cares. \n\nThankfully it bottomed out and I rode it back up until I was profitable, sitting on over 1100 shares at an average of 14.20. Decided to stop being a dumbshit and [\"diversified\"](https://www.dictionary.com/browse/diversified).  Could have made a fat stack if I held all of it. I also would have had a hernia again later when it fell to under $10 a second time.\n\nAll said - I learned a fuck ton about order types, patience and emotional plays. All while making a few bucks.",
        "created_utc": 1588818865,
        "id": "fpqb27x",
        "permalink": "/r/wallstreetbets/comments/gerkgx/they_said_buy_the_dip/fpqb27x/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588847665.0
    },
    {
        "author": "DeepBuddy5",
        "body": "When MVIS hit that .59 dip I bought 2k AMD it went back up to .80 and I sold making a nice profit.  You just have to look at it carefully. MVIS might go a little higher but it will dip back down to the .70-.75 range",
        "created_utc": 1589144211,
        "id": "fq7beit",
        "permalink": "/r/RobinHoodPennyStocks/comments/gh884l/for_tomorrow_i_have_ktov_fet_bioc_and_mvis/fq7beit/",
        "score": 7,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1589173011.0
    },
    {
        "author": "dman1161999",
        "body": "It will be interesting to see how AMD and NVDA react to bitcoin halving.",
        "created_utc": 1589233329,
        "id": "fqba9r5",
        "permalink": "/r/wallstreetbets/comments/ghvey0/what_are_your_moves_tomorrow_may_12_2020/fqba9r5/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1589262129.0
    },
    {
        "author": "be_o3",
        "body": "Total Gain:+$10,143.99  USD\n\nThis is all the profit I made on an account that started at 80k trading only stocks, but the one saving grace is that this includes being fully invested during the crash\n\nGood or bad performance?\n\nEdit: I almost feel like I cheated, because about 8k comes from AMD during its pre-earnings run",
        "created_utc": 1589600714,
        "id": "fqs86v3",
        "permalink": "/r/wallstreetbets/comments/gkggr4/weekend_discussion_thread_for_the_weekend_of_may/fqs86v3/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1589629514.0
    },
    {
        "author": "meikawaii",
        "body": "AMD is like DIS, if lower than 50 instant buy, DIS is &lt;100",
        "created_utc": 1590603889,
        "id": "fs05e5o",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/fs05e5o/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590632689.0
    },
    {
        "author": "LamarHusky",
        "body": "Yesterday I wore my favorite shirt and made a fuck ton of money on AMD. Today I wore a different shirt and was losing money all morning. 5 mins ago I pulled my fav shirt out of the hamper and put it back on, now my boy AMD going for the stars 🌠",
        "created_utc": 1590681973,
        "id": "fs3nj1w",
        "permalink": "/r/wallstreetbets/comments/gs3jqo/daily_discussion_thread_for_may_28_2020/fs3nj1w/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590710773.0
    },
    {
        "author": "Ashhh1991",
        "body": "AMD",
        "created_utc": 1590019476,
        "id": "frahvmv",
        "permalink": "/r/stocks/comments/gnm5i8/intc_or_amd/frahvmv/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1590048276.0
    },
    {
        "author": "3compartmentsink",
        "body": "I got insanely lucky today. Averaging tqqq shares on the way down to the bottom was extremely close to my maint req at the bottom and it bounced. Selling amd nvda calls. Holding msft positions.\n\nHolding dkng shares.\n\nWondering about this pile of TQQQ shares tho",
        "created_utc": 1589507676,
        "id": "fqo4zgb",
        "permalink": "/r/wallstreetbets/comments/gjtxjd/what_are_your_moves_tomorrow_may_15_2020/fqo4zgb/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1589536476.0
    },
    {
        "author": "Stackin_Paper",
        "body": "AMD fucking sucks",
        "created_utc": 1588965574,
        "id": "fpwliwg",
        "permalink": "/r/wallstreetbets/comments/gfqjq5/daily_discussion_thread_for_may_08_2020/fpwliwg/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588994374.0
    },
    {
        "author": "theknowndude",
        "body": "Friendship ended with TSLA, AMD &amp; SPCE\n\nNET, FSLY, DDOG are my new friends.",
        "created_utc": 1589310037,
        "id": "fqemk2w",
        "permalink": "/r/wallstreetbets/comments/gi8h6c/daily_discussion_thread_for_may_12_2020/fqemk2w/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1589338837.0
    },
    {
        "author": "forgetful_storytellr",
        "body": "I jumped back in today after taking a week off ( WSB/RH was legit affecting my work performance but I make more money on this gay app so fuck it)\n\nAnyway here were my moves:\n\nETSY puts (I’m bearish on $BECKY this quarter because their sugar daddies are broke right now)\n\nBABA calls (we’re $15/$20 under expert target prices and we’re talking about a China’s Amazon here)\n\nDeep BABA put (as a hedge against rug pull)\n\nUBER calls (I just have a weird vibe that Uber belongs in the low 40s)\n\nAMD call (ride the hype)\n\ndeep AAPL put (for funsies)\n\nGLUU put (tap sports baseball is a trainwreck — Didi Gregorius was still a yankee)\n\n$SBUX call (ok I whiffed here)\n\nTomorrow I’ll probably hold at open to get a general sense of direction for the day, sell half of the opposite side.",
        "created_utc": 1588730485,
        "id": "fpmd55i",
        "permalink": "/r/wallstreetbets/comments/ge50yl/what_are_your_moves_tomorrow_may_06_2020/fpmd55i/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588759285.0
    },
    {
        "author": "OblivionXBA",
        "body": "Look what they did to my boy NASDAQ 😔 AMD better be safe.",
        "created_utc": 1590639144,
        "id": "fs1zhoj",
        "permalink": "/r/wallstreetbets/comments/grr84s/what_are_your_moves_tomorrow_may_28_2020/fs1zhoj/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590667944.0
    },
    {
        "author": "j33tAy",
        "body": "I played it half right while being bearish.\n\nI dumped about $40k of long stock in mid/late Feb well before the lows. I bought back into some pretty good prices. AMD @ 42, XLF @ 18, MSFT 150something, etc. I've done great on these positions. Sold tons of call premium on these. \n\nI got burned buying puts because they were mostly for mid-may or mid-june. Essentially I am about even right now.\n\nBasically learned don't be a retard and buy short term OTM options. Even though I already knew this....",
        "created_utc": 1590613149,
        "id": "fs0oorv",
        "permalink": "/r/wallstreetbets/comments/grrd97/millionaires_bet_that_stocks_will_take_at_least/fs0oorv/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590641949.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "I have 59% of my portfolio in MSFT$  \n\nAnd I sleep like a baby \n\n😂😂😂😂\n\nFuck I have 7% in amd$ and I lose more sleep over them\nHahahah \n😂😂😂",
        "created_utc": 1588553629,
        "id": "fperw66",
        "permalink": "/r/wallstreetbets/comments/gcx8rv/what_are_your_moves_tomorrow_may_04_2020/fperw66/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588582429.0
    },
    {
        "author": "be_o3",
        "body": "Let this sink in. AMD, the one tech company that met earning expectations, tanks the most each time",
        "created_utc": 1588707926,
        "id": "fpl7vr0",
        "permalink": "/r/wallstreetbets/comments/gdv4qs/daily_discussion_thread_for_may_05_2020/fpl7vr0/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588736726.0
    },
    {
        "author": "tdotz123",
        "body": "I started theta gang earlier this week with 2.5k\n\nI started selling premium on Tesla,  DataDog, SPCE, W, AMD, GRUB , BA\n\nWith credit spreads and closing on early profits.\n\nI'm at 5k now ....maybe theta gang is legit... Mind you today was iny favour in terms of market macros but I think #thetagang is onto something",
        "created_utc": 1589334231,
        "id": "fqfyhvk",
        "permalink": "/r/wallstreetbets/comments/gij7tq/what_are_your_moves_tomorrow_may_13_2020/fqfyhvk/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1589363031.0
    },
    {
        "author": "eZACulate",
        "body": "No big deal. He's just gonna be given a job as the senate AMD chair.",
        "created_utc": 1589476290,
        "id": "fqmevi6",
        "permalink": "/r/wallstreetbets/comments/gjpiv6/sen_richard_burr_steps_down_as_senate_intel_chair/fqmevi6/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1589505090.0
    },
    {
        "author": "gravityCaffeStocks",
        "body": "So for those interesting in wheeling, or selling options in general. I looked some 5/29 puts, first OTM, and compared the premium received (bid) and the strike to get some percentages. You can think of this as a percentage return in a week (premium received / collateral held for a cash secured put):\n\nGOOG:\n\n15.90/1410 = 0.011\n\n&amp;#x200B;\n\nAMZN:\n\n30.45/2435 = 0.013\n\n&amp;#x200B;\n\nMSFT:\n\n1.74/182.5 = 0.01\n\n&amp;#x200B;\n\nTSLA:\n\n19.05/815 = 0.023\n\n&amp;#x200B;\n\nAMD:\n\n1.08/55 = 0.02\n\n&amp;#x200B;\n\nSPY:\n\n3.09/295 = 0.01\n\n&amp;#x200B;\n\nTQQQ:\n\n4.4/79 = 0.056\n\nBasically, for the best return in a weeks time? TQQQ takes the cake right now.",
        "created_utc": 1590202003,
        "id": "frijkw9",
        "permalink": "/r/wallstreetbets/comments/goqr4v/weekend_discussion_thread_for_the_weekend_of_may/frijkw9/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590230803.0
    },
    {
        "author": "Billie__Gates",
        "body": "We need better meme stocks. MSFT, AMZN, TSLA, AMD are all where they were a month ago and are all boring as fuck.",
        "created_utc": 1590525604,
        "id": "frwq0vn",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frwq0vn/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590554404.0
    },
    {
        "author": "e30jawn",
        "body": "AMD fucked me so hard today.",
        "created_utc": 1590523956,
        "id": "frwmmo2",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frwmmo2/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590552756.0
    },
    {
        "author": "CryptoMstrmnd",
        "body": "I bought AMD and MGM calls.\n\nLike u guys say. \n\nThis will go titties up",
        "created_utc": 1590705257,
        "id": "fs507xj",
        "permalink": "/r/wallstreetbets/comments/gsdpeo/what_are_your_moves_tomorrow_may_29_2020/fs507xj/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590734057.0
    },
    {
        "author": "strawberry-jam-boy",
        "body": "Fuck you amd\n\nPiece of shit",
        "created_utc": 1588706553,
        "id": "fpl55pe",
        "permalink": "/r/wallstreetbets/comments/gdv4qs/daily_discussion_thread_for_may_05_2020/fpl55pe/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588735353.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "OK U STUPID FUCKS \nMOST UNDERVALUED STONKS \n\n1. AMD$\n\n2. SHOP$\n\n3. TESLA $ \n\n\nNo way u can argue this !!!",
        "created_utc": 1588806855,
        "id": "fpppvld",
        "permalink": "/r/wallstreetbets/comments/gehav8/daily_discussion_thread_for_may_06_2020/fpppvld/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1588835655.0
    },
    {
        "author": "dcss_west",
        "body": "my new computer i built today is fuckin purring guys AMD ryzen b450 tomahawk max, AMD ryzen 7 3700x, AMD radeon rx 580, thank you sue bae long live your glorious company",
        "created_utc": 1590121071,
        "id": "frf0mpg",
        "permalink": "/r/wallstreetbets/comments/go46ep/what_are_your_moves_tomorrow_may_22_2020/frf0mpg/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590149871.0
    },
    {
        "author": "neoarchaic",
        "body": "I bought everything on that dip Tesla, Amd, HPQ, MSFT,  NVDA, INTC, ULTA \n\nSo either tomorrow will be a great day or a terrible day🤷🏽‍♂️\n\nScared money don’t make money right",
        "created_utc": 1590598441,
        "id": "frzu2cm",
        "permalink": "/r/wallstreetbets/comments/grh1fv/daily_discussion_thread_for_may_27_2020/frzu2cm/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590627241.0
    },
    {
        "author": "Noobsicles",
        "body": "I miss the amd meme days",
        "created_utc": 1590548586,
        "id": "frxvyva",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frxvyva/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1590577386.0
    },
    {
        "author": "mxforest",
        "body": "Yolo’d into AMD 54p 5/22. Riding till expiry no matter what. I want the misery to be over soon so that i can focus on important things in life.",
        "created_utc": 1589953324,
        "id": "fr7pb7z",
        "permalink": "/r/wallstreetbets/comments/gmw5gr/what_are_your_moves_tomorrow_may_20_2020/fr7pb7z/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1589982124.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "AMD$ is gonna rape Intel man",
        "created_utc": 1589939499,
        "id": "fr74ohz",
        "permalink": "/r/wallstreetbets/comments/gmw5gr/what_are_your_moves_tomorrow_may_20_2020/fr74ohz/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1589968299.0
    }
]