[
    {
        "author": "adayofjoy",
        "body": "It's not specifically tech stocks that are inflated faster, but growth stocks. Low PE ratio tech stocks such as Intel, Cisco and IBM are still sitting at depressed levels.",
        "created_utc": 1600572658,
        "id": "g5x4558",
        "score": 77,
        "subreddit": "investing",
        "created": 1600601458.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "Maybe some historical perspective can help.  Let's take AMZN, MSFT and CSCO.\n\nIn early 2000, MSFT was 53 and a darling of the internet.   It again hit 53 in early 09 passing through $6/sh in the meantime.  So 9 years for breakeven.\n\nIn early 2000, AMZN was $64 and a darling of the internet.   It again hit $64 in Dec of 2015 after passing through $16 in the intervening years.   So 15.7 years for breakeven.\n\nIn early 2000, CSCO hit $77/sh and was and is the real backbone of the internet.   It has passed through $10/sh in the intervening years and is now $39.81/share.  Maybe in another 10-20 years it will recover its $77/share price.  So a 30 or 40 year recovery period?\n\nNobody knows what the future holds.   We do know that valuations are crazy and will take phenomenal growth to justify just the current stock prices.   I think your analysis that tech is the future is spot on.  But will that provide enough growth to justify the current prices over the next 10-20 years?   I am not so certain.",
        "created_utc": 1600618412,
        "id": "g5zt86c",
        "score": 70,
        "subreddit": "investing",
        "created": 1600647212.0
    },
    {
        "author": "DuckmanDrake69",
        "body": "Have you ever used Zoom? My god it’s a horrible product. Microsoft Teams is so incredibly superior anytime I tell be people how horrible Cisco Anyconnect and Zoom are everybody thinks im a paid sales person.\n\n\nEdit: I meant Cisco WebX not Anyconnect lol that’s their VPN",
        "created_utc": 1600300708,
        "id": "g5j295z",
        "score": 26,
        "subreddit": "stocks",
        "created": 1600329508.0
    },
    {
        "author": "teegolf1",
        "body": "Companies don’t always come back after crashes even if they are well run. Cisco and Intel are still are not at back to their euphoric dot.com highs reached back in 2000. That’s 20 years with a negative return. 20 YEARS. The euphoria around Apple, Tesla, AMD, NVDIA, etc. has priced these stocks way too high for MANY years to come. It is not sustainable. Reread this well written article and heed the warnings.",
        "created_utc": 1599698732,
        "id": "g4ltouk",
        "score": 24,
        "subreddit": "stocks",
        "created": 1599727532.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "Yes. Use Yahoo Finance and highlight the stock you want and go to \"chart\" and enter a custom time period.   Any dividends are marked by a large D on the time line and a split is a large S.\n\nBTW, every Cisco employee I heard that their FA recommended they sell some after option exercise to diversify for safety said \"No, it is going to $100.\"   The comments clients would give in late 99 and early 00 were the exact same words the youngsters today are saying re:  Today's Tech.",
        "created_utc": 1600620276,
        "id": "g5zxgco",
        "score": 24,
        "subreddit": "investing",
        "created": 1600649076.0
    },
    {
        "author": "couldbeworse2",
        "body": "BMO equity strategist Brian Belski noted that foreign interest in Canadian equities has all-but disappeared,\n\n\"Lack of foreign and even domestic interest in Canadian equities has hit extreme levels, depressing both valuations and relative price performance. However, we believe when (not if) interest returns, Canadian equities are likely to see a strong tailwind, particularly within Financials… \"\n\nMr. Belski also highlighted the recent underperformance of dividend investing strategies but believes these sectors are poised for a comeback,\n\n“Dividend Underperformance Has Been Extreme … With the thirst for yield poised to return, we believe higher yielding sectors with reasonable payout ratios are poised to benefit. This is particularly true for both Communication Services and Financials, which have relatively high yields and among the lowest payouts within the high yield sectors.”\n\nBMO provided a top picks list of North American dividend growth stocks. The list is too long to list all the names, but prominent stocks include BCE Inc., Telus Corp., McDonald’s Corp., PepsiCo Inc., Enbridge Inc., Manulife Financial Corp., Power Corp of Canada , JP Morgan Chase &amp; Co., Royal Bank, Amgen, Gilead Sciences Inc., Merck &amp; Co. Inc., Canadian National Railway Co., Lockheed Martin Corp., Microsoft Corp., Cisco Systems Inc. and Brookfield Infrastructure Partners LP.",
        "created_utc": 1600475620,
        "id": "g5rg4p3",
        "score": 21,
        "subreddit": "CanadianInvestor",
        "created": 1600504420.0
    },
    {
        "author": "Nawtreallyme",
        "body": "ORCL, BABA, CRM, PYPL, ADBE, NVDA, CSCO, PD, DDOG, NET, FB, AMZN, AAPL, MSFT, CLOU, AMD, FSLY, NFLX, SKYY, XLK",
        "created_utc": 1600222901,
        "id": "g5fitjz",
        "score": 17,
        "subreddit": "stocks",
        "created": 1600251701.0
    },
    {
        "author": "marilius12",
        "body": "The price of a stock alone says nothing about it being cheap or expensive. You need to also consider the number of shares outstanding. That's why instead of looking at the stock quote you should look at ratios like P/E.\n\nSo, what you're asking is what are some value stocks with relatively low P/Es compared to the S&amp;P average for example. There are several sectors that are \"cheap\" - these are your banks like JPM and BAC, manufacturers like MMM and HON, even some tech like INTC, CSCO, and STX.\n\nNote that low P/E are often indicative of low growth expectations. So you are trading stability (low beta) and dividends for capital appreciation.",
        "created_utc": 1600284227,
        "id": "g5i2eod",
        "score": 13,
        "subreddit": "stocks",
        "created": 1600313027.0
    },
    {
        "author": "wafflepiezz",
        "body": "&gt;”In May, state-run tabloid Global Times reported the measures would target such U.S. companies as **Apple Inc (AAPL.O),** Cisco Systems Inc (CSCO.O), Qualcomm Inc (QCOM.O), while suspending purchases of Boeing Co (BA.N) airplanes.”\n\n\nSTOP APPLE IS ALREADY DEAD 😭\n\n\nTrade wars are easy to win r-right",
        "created_utc": 1600512212,
        "id": "g5sw82m",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600541012.0
    },
    {
        "author": "accountinreddit",
        "body": "You guys are missing out on the scoop of the century, the trucks have HTML5 super computers and using they have built their own chips. \n\nNvidia, Intel, Cisco all are worried and believe this can bankrupt them",
        "created_utc": 1600138360,
        "id": "g5bguh9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600167160.0
    },
    {
        "author": "CantStopWatchingVids",
        "body": "Trade secret: CSCO never looks good",
        "created_utc": 1600965736,
        "id": "g6fvbgr",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600994536.0
    },
    {
        "author": "hedgefundaspirations",
        "body": "I'm not forgetting about dividends. If you invested at the highs and held CSCO until today you would be down 16% total including dividends. It still hasn't recovered.",
        "created_utc": 1598974211,
        "id": "g3llmx0",
        "score": 7,
        "subreddit": "investing",
        "created": 1599003011.0
    },
    {
        "author": "Kramer-Melanosky",
        "body": "More like Cisco in 2000.",
        "created_utc": 1598973826,
        "id": "g3lkkzx",
        "score": 7,
        "subreddit": "investing",
        "created": 1599002626.0
    },
    {
        "author": "Smipims",
        "body": "Certainly not Cisco. Webex is garbage.",
        "created_utc": 1599019535,
        "id": "g3ojfwl",
        "score": 7,
        "subreddit": "stocks",
        "created": 1599048335.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Imagine all the dumb fuck analysts who said Amazon was not a buy back in the 90s and recommended IBM, CSCO, and INTC instead. \n\nThat's how I feel about all the analysts with bearish targets on TSLA",
        "created_utc": 1599285296,
        "id": "g4372xo",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599314096.0
    },
    {
        "author": "UpTheDownMarket",
        "body": "Not all of the dotcom companies recovered. Cisco was the darling of the dotcom bubble. It's currently sitting at its 1999 price point. As one example.",
        "created_utc": 1600890859,
        "id": "g6cnd86",
        "score": 6,
        "subreddit": "investing",
        "created": 1600919659.0
    },
    {
        "author": "notbrokemexican",
        "body": "The difference is that Cloudflare is an organization with an extremely cheap and distributed solution that is eating the market share of AWS, GoDaddy, and Cisco. You get a shit ton out of the box for extremely cheap.\n\nFastly is a professional tool where networking professionals at places like Reddit or TikTok will use for late-stage development. Both can exist together in a large organization; the CDN market is not a zero sum game and the economy is too large for one player.\n\nReddit and Tiktok compete with Facebook so they need every inch of competition they can get. That is what Fastly provides which isn't necessarily everyones equal concern.\n\n\n\nI will go with cloudflare on the simple premise that online assets and digitally communicated assets will only increase in value greatly and so will the layers of security that wrap it.\n\nCloudflare's primary competition is Akamai.\nFastlys primary competition is limelight networks",
        "created_utc": 1600622914,
        "id": "g602syz",
        "score": 6,
        "subreddit": "stocks",
        "created": 1600651714.0
    },
    {
        "author": "omglawlz",
        "body": "lol poor CSCO. Doesn't pump with tech the past 3 months. Still gets rekt by tech sell off.",
        "created_utc": 1599843254,
        "id": "g4u97cd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599872054.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "Holy fuck MSFT. Wtf are you doing?  \n  \n- Teams killing Slack and WebEx (Cisco)  \n- O365 numero uno (GSuite isn't even close)  \n- OneDrive for Enterprise (that's why DBX and BOX are range bound)  \n- Azure is #2 in cloud and still chipping off AWS marketshare every quarter  \n- New generation console (a 1-in-7 years event) coming in November  \n- Dynamics CRM is #2 after Salesforce  \n- One of the healthiest balance sheets in tech  \n  \nAnd it still hugs that $200-$210. It doesn't need TikTok to skyrocket. Other bigcaps went up over much lesser.",
        "created_utc": 1599580855,
        "id": "g4ga0pr",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599609655.0
    },
    {
        "author": "infinitelimits00",
        "body": "I just noticed the Boomer Index actually crushed today. \n\nKO, IBM, INTC all massively outperforming today. KO back to its post-COVID highs (since March 23). CSCO, DIS, BA, RTX, T also all up. And XLU was up 3%, which is a lot for a defensive utilities sector.",
        "created_utc": 1599091636,
        "id": "g3seg2j",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599120436.0
    },
    {
        "author": "FinndBors",
        "body": "This is terrible advice. In 2000, you could argue the same for CSCO, SUNW, MSFT, ORCL.\n\nThese companies aren’t going anywhere, but only one out of the four ever reached their 2000 highs (and it took sixteen years). The rest are still down from highs.\n\nBroad index for the bulk of your investments. Buy individual stocks with some only if you have a high confidence bet that it will outperform.\n\nEdit: Just want to add that if you go with a broad index, last I checked S&amp;P was over 40% tech related companies, so you are still pretty heavy weight tech.",
        "created_utc": 1600891444,
        "id": "g6coj7y",
        "score": 5,
        "subreddit": "investing",
        "created": 1600920244.0
    },
    {
        "author": "infinitelimits00",
        "body": "No that's Intel, if they are even tech anymore. IBM and Cisco are next. Slack maybe is the most hated new tech company though. That or DBX which also never moves.",
        "created_utc": 1599692140,
        "id": "g4lhb9e",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599720940.0
    },
    {
        "author": "_Negrodamus_",
        "body": "Tbf, most small businesses buy stuff from wholesalers like Cisco, Kegels, and other distributors that deliver, very rarely will a sensible business owner in the food industry buy most of their product from Costco.",
        "created_utc": 1600632927,
        "id": "g60uc71",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600661727.0
    },
    {
        "author": "pistonstoturbines",
        "body": "So you're comparing call premiums for AAPL increasing roughly 50%, when it's up nearly 100% over the past year, to Cisco going up nearly 100%, when it's down 20% for the year . . . Of fucking course the latter will be relatively cheaper . . .",
        "created_utc": 1599854310,
        "id": "g4uwode",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599883110.0
    },
    {
        "author": "old-wizz",
        "body": "Cisco is a bit a ‘has been’ from the 90s",
        "created_utc": 1600095947,
        "id": "g58k44x",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600124747.0
    },
    {
        "author": "BuyLowSellNever",
        "body": "Security is a very saturated market and there are many different players, forget about the “Cloud” part and just focus on who offers the *best* security products, as every product utilises cloud in some form or another it doesn’t make sense to look for “Cloud Security Vendors” as that’s not really a thing.\n\nSecurity really falls into two main categories; securing the endpoints (encryption, device control etc) and securing the gateway (encryption, device control etc.) so figuring out who does that best is a good place to start.\n\nCompanies like Microsoft and Cisco (both mentioned here) are **not** security companies, they *offer* an element of security but their broader product offering is not security, so that’s not where their focus is.\n\nGood luck in your search!",
        "created_utc": 1600113794,
        "id": "g59zcf8",
        "score": 4,
        "subreddit": "stocks",
        "created": 1600142594.0
    },
    {
        "author": "Bulleyes87",
        "body": "Same thing with Cisco and it is even worst for people from other country. For those of us that are Canadian during the dotcom bubble the currency exchange rate was around 1.5 my dad Cisco shares are still around just 50% of what they were 20 years ago. Even MSFT if I am not mistaken he just managed to get it back to 2000s level 15 years later.",
        "created_utc": 1599760418,
        "id": "g4psu2p",
        "score": 4,
        "subreddit": "stocks",
        "created": 1599789218.0
    },
    {
        "author": "TrenAndOptions",
        "body": "INTC, CSCO, PFE have to be the worst, most painful stocks in the world lol",
        "created_utc": 1599586141,
        "id": "g4gkfhr",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599614941.0
    },
    {
        "author": "pmcredit",
        "body": "Thats exactly what was said about Cisco in 2k crash.only took 15 years to recover your money.",
        "created_utc": 1600688781,
        "id": "g63akjj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600717581.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Robinhood filled me on a CSCO credit spread 4 cents above the bid ask. I was shocked lol",
        "created_utc": 1601351029,
        "id": "g70zs0j",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601379829.0
    },
    {
        "author": "shatterkneesinc",
        "body": "big oil pump and boomer tech pump tomorrow\n\nlets go csco",
        "created_utc": 1599181998,
        "id": "g3xlbct",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599210798.0
    },
    {
        "author": "infinitelimits00",
        "body": "Lol if you guys love the DOW, may I introduce you to the Boomer Index. \n\nKO, T, JNJ, BA, NKE, MCD, INTC, IBM, and CSCO (although INTC is catching on here...and the last three technically are correlated with tech).\n\nI like never see anyone trade NKE calls but it's actually a good company.",
        "created_utc": 1599182161,
        "id": "g3xln4y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599210961.0
    },
    {
        "author": "b1ackfyre",
        "body": "Really hard for me to read TSLA. Are they going to be like an Amazon, where everyone just says that they’re perma overvalued, but then eventually they get to a point where they have global domination.\n\nOr will they end up like Cisco stock where they’re really shiny up until 2000 ish, and then for 2 decades they’re just Cisco... shoulder shrug.",
        "created_utc": 1598977409,
        "id": "g3ltyv0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599006209.0
    },
    {
        "author": "Bolkonsky999",
        "body": "i still can't get over the fact that i sold all my spce $16 october calls on friday! I had almost half my entire portfolio in it. sold the calls at a small loss. would have been up to over 400% today. Instead, I bought Microsoft and cisco. and currently down 32%. fucking greed!! that was an expensive lesson fuuck",
        "created_utc": 1599598876,
        "id": "g4h9xjs",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599627676.0
    },
    {
        "author": "ldom22",
        "body": " **Cisco** is one of the major vendors in the IT network **market**, mainly due to its dominating position in the global ethernet switch **market**, of which **Cisco** holds more than 50 percent of the **market share** \n\n[https://www.statista.com/topics/2286/cisco/#:\\~:text=Cisco%20is%20one%20of%20the%20major%20vendors%20in%20the%20IT,Nokia%2C%20Ericsson%2C%20and%20HPE](https://www.statista.com/topics/2286/cisco/#:~:text=Cisco%20is%20one%20of%20the%20major%20vendors%20in%20the%20IT,Nokia%2C%20Ericsson%2C%20and%20HPE).  \n\n\nnot sure about upstream equipment but they are definitely not going broke or negative revenue anytime soon",
        "created_utc": 1600097571,
        "id": "g58oh0d",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600126371.0
    },
    {
        "author": "AudreyScreams",
        "body": "Here's an article about a rapidly rising company with incredible potential called [Cisco](http://bizjournals.com/sanjose/stories/2000/03/20/story2.html) that happened to be published weeks before the crash began",
        "created_utc": 1599841870,
        "id": "g4u6dt7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599870670.0
    },
    {
        "author": "skeletor00",
        "body": "It's cheap. As someone stated, WebEx has been around forever but many companies can't afford it. Zoom is cheap but other than that, they've got nothing. \n\nIt's been in front of us all along....\n\nCisco Tech Bubble 2000 ---&gt; Zoom Tech Bubble 2020(2.0!2.0!) \n\nHow did we not see this?!?!",
        "created_utc": 1599079976,
        "id": "g3ro91s",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599108776.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "CSCO began paying a modest dividend in 2011.  It has now grown to 3.5%\nMSFT began paying a regular dividend in 2004.  It has risen to a resounding 1.1%\nAMZN has neither splits nor dividends.",
        "created_utc": 1600629063,
        "id": "g60ll8y",
        "score": 3,
        "subreddit": "investing",
        "created": 1600657863.0
    },
    {
        "author": "toost1cky",
        "body": "Paid off my margin down to 40% last week, back up to 80% margin today on leaps:  CSCO 1/2021 $40, INTC 1/2021 $30, HPE 1/2021 $5",
        "created_utc": 1600127105,
        "id": "g5avk8i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600155905.0
    },
    {
        "author": "SovietPenguin69",
        "body": "True my company loves Cisco we just bought two more distribution switches from them. All our phones have that cool little bridge shaped signal on them too.",
        "created_utc": 1600098203,
        "id": "g58q708",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600127003.0
    },
    {
        "author": "chusifer24",
        "body": "reits have been terrible and will continue to be terrible during covid. i would expect STWD to cut their dividend like other reits will or have already done.\n\ni own T. its been awful. Most people will say buy VZ.\n\ni have JNJ and AMGN. They have been decent for a dividend play, but nothing to get excited about. I also own CSCO and that's been a dog. Now u got me thinking, its time to dump all these as they not doing much for me.",
        "created_utc": 1601244093,
        "id": "g6w5sjz",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601272893.0
    },
    {
        "author": "ldom22",
        "body": "well if you must know, all my money is busy holding CSCO, DOCU and AMD bags",
        "created_utc": 1599952831,
        "id": "g4zyc0r",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599981631.0
    },
    {
        "author": "AlekRivard",
        "body": "25 y/o, been investing just over 2 years\n\n**Current**\n\nStocks | Percent Equity | Growth\n---|---|----\nMSFT | 19.57% | 109%\nFB | 10.17% | 65.28%\nAAPL | 9.24% | 164.62%\nWMT | 8.47% | 5.9%\nBAC | 6.64% | -4.76%\nBAH | 5.58% | 92.72%\nSE | 5.57% | 35.16%\nAAXN | 5.02% | 9.29%\nDAN* | 4.96% | 25.06%\nBX | 4.62% | 56.92%\nBNS | 4.15% | 2.53%\nPLD | 4.08% | -2.19%\nKO | 3.66% | 7.6%\nCMCSA | 3.62% | 22.79%\nET** | 3.61% | -57.95%\nBA | 2.96% | -4.25%\nCSCO | 2.89% | -1.97%\n\n*I have a limit order to sell at $15/share\n\n**I plan to sell once I am not so far in the red\n\n**Hard Plans**\n\n1. Increase CMCSA shares by 114%\n2. Increase CSCO shares by 66.67%\n3. Increase KO shares by 92.3%\n4. Buy STAG to a similar level that I have PLD\n5. Buy AMZN and GOOGL to similar levels that I have AAXN\n\n**Soft Plans**\n\n1. I am monitoring the SNOW IPO\n2. Increase position in MSFT and BNS\n3. Monitor FB to determine if I want to hold or increase position\n\n**Uncertainty**\n\n1. I think AAPL will go up in the long-term but may be overvalued in the short-term. Weighing selling to reinvest/diversify then get in at a more appropriate time. That said, I don't want to try and time the market so I think I'm likely to hold until I feel comfortable buying more.\n\nEdit: I should add I am very long-term minded. DAN is my only short-term play based on trends myself and a friend have noticed and spoken about.",
        "created_utc": 1599010365,
        "id": "g3o3nfv",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599039165.0
    },
    {
        "author": "GoldenPresidio",
        "body": "I really don't have an answer for you on that because these companies don't sit around and wait. If Snowflake sat around and didn't improve the product at all them maybe two years with all the user testing the cloud guys do? They really do not want to break their existing product at all because they stress resiliency. Either way that's not how it would go down.\n\nLook at Twilio for example. They have SO many competitors that all do the same shit on the surface: cloud based communications. But Vonage/Nexmo, Plivo, Avaya, Cisco, etc have not been able to catch up Twilio because Twilio keeps on expanding and innovating. Now Twilio has the biggest breadth of services from any of them and is straight up way easier to use.\n\nMaybe Snowflake keeps making their UI better. Maybe they integrate with more data sources before everybody else. Maybe they keep providing better analysis than the other guys. The innovation can keep them ahead even if the cloud guys make their product better.\n\nI think analyzing the catchup for a company like Fastly is more direct in that AWS CloudFront would just need to get even closer to the edge locations to decrease latency under Fastly's 35 millisecond one and be more competitive. You can see them doing this with the new Wavelength product.\n\nedit: one last thing I want to note is that there is plenty of room for both of them to grow! The cloud market is still not close to fully being penetrated so even if the cloud guys create a good product, it doesn't mean doom and gloom for all these other companies",
        "created_utc": 1599015422,
        "id": "g3ocpsx",
        "score": 3,
        "subreddit": "SecurityAnalysis",
        "created": 1599044222.0
    },
    {
        "author": "BPFortyEight",
        "body": "I don't give a fuck what you zoomers think. CSCO and BAC are LEAP champions that will print if you fucks can stay on your ADHD medication long enough to hold through the field of shit that's the rest of the year.",
        "created_utc": 1601075877,
        "id": "g6l2end",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601104677.0
    },
    {
        "author": "pickbot",
        "body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**CSCO**|**$44**|**BUY CALL**|**2020-11-20**|**$0.41**|**$39.13**|**26269**|**373**\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckfniumy18x5i0764l7z98q4i) | [Track Record](https://www.pickmojo.com/user/Harry_Fraud/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**",
        "created_utc": 1601357401,
        "id": "g717xy1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601386201.0
    },
    {
        "author": "PhotoKaz",
        "body": "You didn't mention one of my favorites: VGT\n\n[https://investor.vanguard.com/etf/profile/VGT](https://investor.vanguard.com/etf/profile/VGT)\n\nInformation Technology stocks, top holdings:\n\nApple, Microsoft, Visa, Nvidia, Mastercard, Adobe, Salesforce, PayPal, Intel, Cisco.\n\nThe returns have been great.",
        "created_utc": 1601401746,
        "id": "g7331y8",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601430546.0
    },
    {
        "author": "Cretin___",
        "body": "CSCO primed for liftoff.\n\nGet in now, 45c 10/18",
        "created_utc": 1601405501,
        "id": "g73bil9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601434301.0
    },
    {
        "author": "GimmeKarmaPleaz",
        "body": "yes but past performance doesn't mean continued future performance 15 years ago apple was not dominant and 20 years ago cisco was dominant.  times change, and tech by no means is going to outperform forever, and the fact that each of these companies have trillion dollar market caps means that they do in fact have large market share and it is already priced in.",
        "created_utc": 1601507911,
        "id": "g78c2vj",
        "score": 3,
        "subreddit": "investing",
        "created": 1601536711.0
    },
    {
        "author": "HolderofFour",
        "body": "“In 2000, at the height of the tech bubble, the top five stocks were Microsoft, Cisco (CSCO), Exxon Mobil (XOM), GE (GE), and Intel (INTC); they represented 18% of the index.”",
        "created_utc": 1600308851,
        "id": "g5jhxin",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600337651.0
    },
    {
        "author": "stodge17",
        "body": "Moves include:\nGE 9M sell,\nIntel 10M buy,\nBoeing 1.2M buy,\nWalmart 1M sell,\nPelton 1M buy,\nApple 13.8M buy,\nTesla 2.5M buy,\nAMD 2.3M sell,\nFacebook 1.8M buy,\nPizer 2M sell,\nMRO 1.5M buy,\nSirus XM 2.75M sell,\nPayPal 1.94M buy,\nCisco 3.54M buy,\nAmazon 400k buy.\n\nThose are the positions I’ve seen. Could just be simple moves but just haven’t seen volume at close like that in a hot minute.",
        "created_utc": 1599713565,
        "id": "g4mirev",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599742365.0
    },
    {
        "author": "TheJarlos",
        "body": "CSCO?",
        "created_utc": 1600013910,
        "id": "g54kro0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600042710.0
    },
    {
        "author": "kismatwalla",
        "body": "Agree its going to Pop once lockdowns are gone.  They would need to compete in enterprise space with Microsoft and Cisco. The integrations across multiple enterprise product suite is far more valuable than video conferencing alone.  The public domain will walk away from Zoom as quickly as they entered.",
        "created_utc": 1600046925,
        "id": "g56segy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600075725.0
    },
    {
        "author": "Special_K_2012",
        "body": "Bought csco calls during the dip, easiest 50% return",
        "created_utc": 1598994347,
        "id": "g3n4ocb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599023147.0
    },
    {
        "author": "Uniqueguy264",
        "body": "It’s also free with 365. Zoom is the Cisco of 2020, the company that fittingly owns its precursor, WebEx",
        "created_utc": 1599023526,
        "id": "g3op0t1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599052326.0
    },
    {
        "author": "ice_cream_winter",
        "body": "Awesome read thanks. The parallels are there, it's hard to imagine the right side of the graph but it's always good to be aware of the bear case. Cisco has done well over the past 10 years but their stock price only made it up to 70% of the dot com high. \n\nIf we imagine that Tesla follows the same kind of story it is possible that they do incredibly well over the next 10 years but the price of the stock might still be lower than it is today by the end of the next market cycle. Do the people spamming 'if you believe in the stock then why does it matter' actually consider the price of the stock could stagnate for quite some time? I think Tesla will do well but I'm not buying at these prices. It's price action is sentiment driven so when sentiment changes price will travel very fast in opposite direction. The best time to buy is when people are on here complaining about Tesla and Elon, not when they believe that Tesla will power everything from their toothbrushes to their hyperloops to work within the next 6 months.",
        "created_utc": 1598946695,
        "id": "g3kd0co",
        "score": 2,
        "subreddit": "investing",
        "created": 1598975495.0
    },
    {
        "author": "hedgefundaspirations",
        "body": "That is total bullshit. Microsoft had $20b in revenue in 2000. It hit $60 a share during the bubble. Now no one would say that it wasn't eventually going to be worth that, but it sure as shit wasn't at the time. It crashed and it took 16 years to recover to $60 a share. Seems like a perfectly plausible scenario for Tesla as well.\n\nAnd Cisco is an even better example. It had $19 billion in revenue in 2000 and manufactured hardware. It hit $80 a share before crashing to $14. Even today 20 years later it has only recovered to half it's fever pitch peak currently trading at $40.\n\nOne more for good measure, to kind of demonstrate the three possible paths for Tesla. WorldCom in year end 1999 did $37 billion in revenue, and we all know what happened to WorldCom.\n\nYou've got your history dead wrong.",
        "created_utc": 1598971471,
        "id": "g3le4md",
        "score": 2,
        "subreddit": "investing",
        "created": 1599000271.0
    },
    {
        "author": "looktheinternet",
        "body": "Woah. The post stock split variant Teslafury, Stonk of the Tendieseeker, AND TCoNonth. \n\nPaper sounds not so bad. \n\nOk, I’m still gonna need a Strangle on CSCO, at minimum 200 35c PRPL (I have to make up for the last time I went in on PRPL armor and furnishings).\n\nCan you server transfer from Paper to Live? I’m sure NYSE§ doesn’t do that, but there’s hackers out there with aimbots, surely they can recreate on Live. I’ll pay for the transfer. They work for INTC calls, so I hear.\n\nFinal final offer, $1.50 and syrup for that French toast stapled to a tree",
        "created_utc": 1599254645,
        "id": "g41o25m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599283445.0
    },
    {
        "author": "Duckbutter_cream",
        "body": "Cisco VC on top of blank checks for everyone.",
        "created_utc": 1599430295,
        "id": "g49vn7h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599459095.0
    },
    {
        "author": "Shoopshopship",
        "body": "Tesla is in a speculative bubble. When something is running on hype and everyone thinks it has a bright future, people buy into it initially seeing it as a long term inbestment but as the price goes up and the investors becoming cockier people follow them and chase the trend seeing the gains those investors got. The problem, is that you are buying a piece of a business and for a business to justify being valued so high it needs to make a significant amount of money and when that doesn't happen at maximum expectations, the stock price collapses. \n\nCheck out this article from 2002 when Cisco became the world's largest publicly traded company briefly: https://www.cnet.com/news/cisco-ascends-to-most-valuable-company/\n\nCisco is a valuable company and makes a lot of money, but people's expectations severely overpriced what people were paying for it. If you bought near the top and held all this time, you have not got your money back not factoring in dividends. \n\nThe bears aren't saying Tesla doesn't have a bright future, what they are saying is the talk that \"Tesla is not a car company\" is speculation. Until Tesla actually makes money in this area it may never be worth 300 billion dollars, but thats what its trading for. When Apple released the iPhone in 2007, the market cap did not immediately shoot up to 1 trillion dollars. So you are basically taking a huge gamble on a stock that is making far less income than any other stock trading at that level to pull through on technology that may or may not be revolutionary at an unforseen time in the future. That is why it is crashing and why it will likely continue to crash. \n\nTL;DR Tesla is way ahead of itself on valuation and will likely continue to go down",
        "created_utc": 1599607422,
        "id": "g4hrmcd",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1599636222.0
    },
    {
        "author": "teegolf1",
        "body": "20 years later Cisco still hasn’t recovered from the 2000 crash",
        "created_utc": 1599160831,
        "id": "g3w0jb7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599189631.0
    },
    {
        "author": "Startzagain",
        "body": "Here’s another CSCO 10/16 $41c check it out",
        "created_utc": 1600191212,
        "id": "g5dn1mz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600220012.0
    },
    {
        "author": "aharmlessloaf",
        "body": "As a user of their products they make far better software than Cisco, and their products intregrate very well together.  Their training is also very modern, with online university style training for their products.\n\nIve got money in it and Id be comfortable putting more in.  I even see them inevitably partnering heavily with either Microsoft or AWS for cloud linking to on-premises.  Which nobody will partner with Cisco since Cisco is its own cloud provider.",
        "created_utc": 1600622350,
        "id": "g601jgz",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600651150.0
    },
    {
        "author": "TheM0L3",
        "body": "As a brand it has definitely blown up.  People use “Zoom” as a synonym for video conference, and there is definitely value in being a leader in a market to that extent.  People say “I’m going to Zoom with them later” even if it is a video chat on another platform because of the name recognition.  You look at a company like Google who’s name became synonymous with searching and you can see where that kind of brand recognition can lead.\n\nBut that brand name will only get them so far if they don’t find some new revenue streams.  They are the biggest fish in the pond by a good margin but they don’t even have half the market and it is a crowded pond.  Not to mention they are swimming with some really big fish like Microsoft, Google, Facebook, and Cisco.\n\nThey have a lot of users but until they either control a very dominant market share or make more money on those users it is obvious that their valuation is way out of line.  Most of their users don’t pay anything and they have a payment model for 1000 users at $200 a month.  That’s 20 cents per month per user.  At that rate you could sign up all 7 billion people on the planet and still only be making 140 million a month.  Doesn’t exactly show a high profit ceiling for this company as-is and you can see why so many are baffled by their valuation.",
        "created_utc": 1600826853,
        "id": "g6a1cah",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600855653.0
    },
    {
        "author": "TreeHugChamp",
        "body": "Csco $37 calls purchased at $.85. Selling Tuesday or Wednesday and reversing into puts. Apple puts starting Tuesday and doubling down if it goes up on tuesday(exp Friday). Target puts on Tuesday, Tesla puts on Tuesday, but mainly saving my money for next week because I feel like next week will provide a juicier buying opportunity.",
        "created_utc": 1601237485,
        "id": "g6vsnif",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601266285.0
    },
    {
        "author": "cambiebridge",
        "body": "CSCO PE just went below 15. Quite attractive now",
        "created_utc": 1600964691,
        "id": "g6ft45m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600993491.0
    },
    {
        "author": "dum_townerino",
        "body": "People have been bagholding CSCO since the dot com bubble",
        "created_utc": 1600448966,
        "id": "g5py9wm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600477766.0
    },
    {
        "author": "FannyPackPhantom",
        "body": "Stupid good for nothing CSCO",
        "created_utc": 1599334441,
        "id": "g45noe6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599363241.0
    },
    {
        "author": "verbify",
        "body": "Look at cisco - their revenue has grown in the last 20 years, but the stock price still hasn't recovered because it was too high in the dot com bubble.",
        "created_utc": 1599608961,
        "id": "g4hubq1",
        "score": 2,
        "subreddit": "investing",
        "created": 1599637761.0
    },
    {
        "author": "pamdathebear",
        "body": "Back then the 4 horsemen were dell, Intel, Cisco and Microsoft.",
        "created_utc": 1599111165,
        "id": "g3tbdmk",
        "score": 2,
        "subreddit": "investing",
        "created": 1599139965.0
    },
    {
        "author": "stockpikr",
        "body": "It wasn't until 2016 that MSFT hit a new high. INTC and CSCO haven't hit new highs even now. Buy the way, I sold all of those in January 2000 and didn't buy back into MSFT till Satya Nadella made CEO at around $40. I still don't own INTC and I didn't buy back into CSCO until Chuck Robbins made  CEO at around $29.",
        "created_utc": 1599116408,
        "id": "g3th8vo",
        "score": 2,
        "subreddit": "investing",
        "created": 1599145208.0
    },
    {
        "author": "NobodySpecific2",
        "body": "Nothing but inertia. Zoom was easy to get setup fast when it looked like \"we need to do something right now because we will be getting a stay at home order any moment\" \n\nLarger companies that can afford this own SIP trunks and stuff will want to go back to self hosted solutions to save costs eventually when they have the IT resources available to make it happen.  The other player Microsoft, Cisco, are not going to just sit by and let Zoom be \"the online meeting collaboration platform.\" o365 is all about being a package deal, and MS is going to want to make sure \"Teams\" is a part of that.  I don't have position because I don't know what the time frame will be but once \"review or telecom solution\" becomes a department priority again for IT in corporate America, I strongly suspect Zoom won't be the pick.",
        "created_utc": 1598988548,
        "id": "g3mozbu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599017348.0
    },
    {
        "author": "TheFuschiaIsNow",
        "body": "CSCO calls. Did that on and off for a few months",
        "created_utc": 1599015448,
        "id": "g3ocrjs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599044248.0
    },
    {
        "author": "Jonnydoo",
        "body": "CSCO is such a turd.",
        "created_utc": 1598974472,
        "id": "g3lmbkx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599003272.0
    },
    {
        "author": "PassiveF1st",
        "body": "I can't believe Cisco AT&amp;T &amp; XOM are back at March prices. That's pretty wild.... Usually people just hold and forget about these stocks.",
        "created_utc": 1601046260,
        "id": "g6jhdtc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601075060.0
    },
    {
        "author": "haasvacado",
        "body": "I like CSCO and KO a lot. Not keen on banks atm.",
        "created_utc": 1601076002,
        "id": "g6l2olk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601104802.0
    },
    {
        "author": "generateausernamepls",
        "body": "Is anyone else playing the CSCO ACIA merger?",
        "created_utc": 1601134763,
        "id": "g6oy2vc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601163563.0
    },
    {
        "author": "shindiggaa",
        "body": "Add CSCO to that mix",
        "created_utc": 1601317666,
        "id": "g6z9186",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601346466.0
    },
    {
        "author": "xRiotZx",
        "body": "Tons man, slow grind. $2k on csco, $6k on ivr when they pump and dumped, $2k on auy, $2k on fb, $13k on wmt most recently, $800 on kr, $1600 on HD, $3k low, etc.",
        "created_utc": 1599094981,
        "id": "g3skk2c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599123781.0
    },
    {
        "author": "oldredditdidntsuck",
        "body": "So AApl 180 Billion mkt cap loss.  So the market just had a bankrupt Cisco or McDonalds?",
        "created_utc": 1599183993,
        "id": "g3xp1g9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599212793.0
    },
    {
        "author": "Myusernamegoesup",
        "body": "My only green tech is CSCO and INTC.😂",
        "created_utc": 1599228221,
        "id": "g3zh54e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599257021.0
    },
    {
        "author": "thri54",
        "body": "I believe that Cisco is doing better now than it was in 2000.  If I had bought Cisco two decades ago, I still would be down ~40% today.",
        "created_utc": 1599610857,
        "id": "g4hxqnn",
        "score": 2,
        "subreddit": "investing",
        "created": 1599639657.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "I feel like shorting $CSCO just because of WebEx. I’m hearing those beeps in my nightmares, in which I’m furiously wanking without realizing my video is on.",
        "created_utc": 1599682882,
        "id": "g4ky7yx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599711682.0
    },
    {
        "author": "sumtastic",
        "body": "Believe it or not, the moat isn't small. Zoom's real key is how well they work with enterprise infrastructure. Once there, it's sticky as hell. They still have a lot of enterprise customers to land, so plenty of market left for them. Cisco and Microsoft have never addressed the asks of corporate UC and IT teams as well as Zoom does.",
        "created_utc": 1599775474,
        "id": "g4rdxd6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599804274.0
    },
    {
        "author": "upvotemeok",
        "body": "Cisco was past its prime after the dotcom bubble. They have not executed well and are being beat by competition.",
        "created_utc": 1599782236,
        "id": "g4rs277",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599811036.0
    },
    {
        "author": "deadjawa",
        "body": "Yeah but there’s a whole world of adjacent opportunities that you can dig into.  Focusing in on only TSLA is like focusing in on only CSCO or INTC in 2000 because they were the only big tech companies making money on the dotcom expansion.  TSLA is probably a good play, but there’s going to be lots of other winners that aren’t just vehicle manufacturers.  \n\nI think the 10-100 baggers are in the application of EVs.  Tesla has maybe a 3x opportunity yet in front of them, 6x at most.  So why not look for the other companies that are killing it technologically that will benefit?",
        "created_utc": 1600024602,
        "id": "g55dzfr",
        "score": 2,
        "subreddit": "investing",
        "created": 1600053402.0
    },
    {
        "author": "TrenAndOptions",
        "body": "cisco and intel. Since they're also boomer stocks but they're sitting way closer to march lows than oracle.",
        "created_utc": 1600044428,
        "id": "g56o4t9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600073228.0
    },
    {
        "author": "leolim818",
        "body": "Thanks. I’m looking at some big cap stocks like JPM, BAC, T, VZ, KO, ORCL, CSCO, these are stocks under $100. Will need to do some technical analysis to ensure they are uptrend in long term.",
        "created_utc": 1600580703,
        "id": "g5xpxqr",
        "score": 2,
        "subreddit": "options",
        "created": 1600609503.0
    },
    {
        "author": "Threeaway411",
        "body": "Webex/Cisco has literally been doing this for decades.",
        "created_utc": 1599000163,
        "id": "g3nh9d9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599028963.0
    },
    {
        "author": "advester",
        "body": "No, CSCO is just reaching it’s old peak now.  Holders missed 20 years of growth.  Even if you bought at CSCO’s bottom, you’d be better off with SPY.  CSCO beats SPY sometimes, but it gets hammered in the market dips.  It acts a bit like a leveraged etf.",
        "created_utc": 1598975296,
        "id": "g3lofhe",
        "score": 1,
        "subreddit": "investing",
        "created": 1599004096.0
    },
    {
        "author": "TheRahulParmar",
        "body": "Yeah totally :P\nI use both a shit ton. Let's agree the cisco one is garbage haha",
        "created_utc": 1598990097,
        "id": "g3mt57p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599018897.0
    },
    {
        "author": "butterflyfrenchfry",
        "body": "Like CSCO doesn’t move kinda shit?",
        "created_utc": 1599016050,
        "id": "g3odtmm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599044850.0
    },
    {
        "author": "upvotemeok",
        "body": "Look at csco 1999",
        "created_utc": 1599028391,
        "id": "g3oupuu",
        "score": 1,
        "subreddit": "investing",
        "created": 1599057191.0
    },
    {
        "author": "jrex035",
        "body": "Not quite. Tesla has a lot of similarities to Cisco. In 2000 that company had quite a bit of revenue and lots of room to grow. It was seen as an investment and a gamechanger. \n\n20 years on and its stock has still never come close to its Dot Com bubble highs",
        "created_utc": 1598974205,
        "id": "g3llm9m",
        "score": 1,
        "subreddit": "investing",
        "created": 1599003005.0
    },
    {
        "author": "sweetleef",
        "body": "CSCO has been dead money for 20 years, it never caught up to what was priced in.",
        "created_utc": 1598959904,
        "id": "g3kphf3",
        "score": 1,
        "subreddit": "investing",
        "created": 1598988704.0
    },
    {
        "author": "NickBurnsComputerGuy",
        "body": "And CSCO would have been an OK investment even at it's peak.",
        "created_utc": 1598972608,
        "id": "g3lh8aq",
        "score": 1,
        "subreddit": "investing",
        "created": 1599001408.0
    },
    {
        "author": "thri54",
        "body": "&gt;Why wouldn’t it be good long term?\n\nIt’s much cheaper to pay interest on a note then buyback stock at a later date, in most cases.  Especially if the capex returns significant value. \n\nIf TSLA turned out to be a 2000 Cisco or Microsoft, issued shares at the top and started buybacks as they matured, and share prices dropped as the absurd expectations did, it would effectively be a negative interest loan.  \n\nCSCO today is highly profitable, though they never lived up to the hype.  If they issued shares at $80 in 2000, and bought them back today at 40, that’s an excellent return for their current investors, not so much for the guys who bought at the peak two decades ago.",
        "created_utc": 1598967103,
        "id": "g3l2t24",
        "score": 1,
        "subreddit": "investing",
        "created": 1598995903.0
    },
    {
        "author": "jokikinen",
        "body": "In my opinion you also have to consider the market at large back when Cisco bubbled. Completely legless enterprises received incredible valuations—then it follows that the companies with actual promise should be worth more than those. The garbage companies were a catalyst that makes an additional component to the forces pushing the share price up. As of now we don’t have a similar context. The “bubbling” stocks are proven tech giants, not companies that were listed a month ago.\n\nTSLA is definitely acting in a novel way and it should be noted. But we shouldn’t make the conclusion that it’s entirely similar with Cisco. There are major important differences which make the comparison hard.",
        "created_utc": 1598969754,
        "id": "g3l9mbo",
        "score": 1,
        "subreddit": "investing",
        "created": 1598998554.0
    },
    {
        "author": "Wutbot1",
        "body": "CSCO stock and calls. Good chart and recent upgrades. Cheap in comparison to most tech. Earnings Wednesday. Could moon. RKT looks like next meme stonk but risky if no stimmie.\n*****\n\n\n*[wut?](https://www.reddit.com/r/WutbotPosts/)* | *[source](https://reddit.com/r/wallstreetbets/comments/i5ksrt/today_all_the_pumpy_stocks_from_last_month_sold/g0pudou/)*",
        "created_utc": 1599058994,
        "id": "g3q5c8q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599087794.0
    },
    {
        "author": "godfather188",
        "body": "CSCO puts",
        "created_utc": 1599241626,
        "id": "g40jq41",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599270426.0
    },
    {
        "author": "bshaman1993",
        "body": "Guys take a look at CTXS",
        "created_utc": 1599068740,
        "id": "g3qu75i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599097540.0
    },
    {
        "author": "Trueslyforaniceguy",
        "body": "Yes!  Citrix, DOCU, WORK, PD",
        "created_utc": 1598969616,
        "id": "g3l990c",
        "score": 1,
        "subreddit": "investing",
        "created": 1598998416.0
    }
]