[
    {
        "author": "FargotRobMe",
        "body": "[Drew this on my lunch break because the new Boss Baby looks stupid](https://www.reddit.com/user/FargotRobMe/comments/fk8y9a/baby_cramer_wsb/?utm_source=share&amp;utm_medium=web2x)\n\nPositions:\n\n$PYPL 5/15 $135c\n\n$CSCO 4/24 $25p\n\nThanks for the $GLD, it makes up for my lunch getting cold",
        "created_utc": 1584465900,
        "id": "fkrc3eo",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1584494700.0
    },
    {
        "author": "VValrus54",
        "body": "Or you know. \n\n-\nCisco. Webex\n\n-\nMicrosoft. Teams.",
        "created_utc": 1583265073,
        "id": "fje4hqg",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1583293873.0
    },
    {
        "author": "helio987",
        "body": "Am I dumb to be putting in a bunch of sell orders on some stocks?  I am looking to get about 40k about right now. I have another 15k in cash.  I want some money in my account to hopefully buy the dip and I do hope it's not another 50% to go.  I feel like a idiot now for buying csco and vti back in January and already down 12 on cisco and 8 on vti",
        "created_utc": 1583108762,
        "id": "fj8adod",
        "score": 7,
        "subreddit": "investing",
        "created": 1583137562.0
    },
    {
        "author": "extwidget",
        "body": "Counterpoint as someone who works the other side of things: IT, where I set up solutions like this all day.\n\nWebex fucking sucks, and now that most people will be using it daily, expect Cisco to hemorrhage customers.",
        "created_utc": 1584477581,
        "id": "fkrwreo",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1584506381.0
    },
    {
        "author": "Jordykins850",
        "body": "Just put it all in CSCO 1/22 50c and live your life for the next year. Collect money.",
        "created_utc": 1583980920,
        "id": "fk9pupt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1584009720.0
    },
    {
        "author": "mootymoots",
        "body": "Interesting how SLACK is plummeting. Working from home was the press’s excuse for it going up only a few days back. \n\n\nhttps://finance.yahoo.com/news/coronavirus-zoom-microsoft-cisco-work-from-home-191121213.html",
        "created_utc": 1583960639,
        "id": "fk8pw44",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583989439.0
    },
    {
        "author": "Japparbyn",
        "body": "Short cisco and Apple lets go drill team!",
        "created_utc": 1583443269,
        "id": "fjlauu6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1583472069.0
    },
    {
        "author": "bpait37613",
        "body": "Yes i do , You can easily do scalp options with 2k account as well. Infact i started with 2k account doing only CSCO 1 symbol and turned it into 21 K in 3 months using profit cycles and money management. Your max exposure to the market should be from 2 to 5 % .I can write a post about how profit cycles work for account growing while preserving capital",
        "created_utc": 1583381554,
        "id": "fjj2gs3",
        "score": 3,
        "subreddit": "options",
        "created": 1583410354.0
    },
    {
        "author": "niceanddtoastyplease",
        "body": "So any chance Cisco and Zoom moon since no one will be traveling?",
        "created_utc": 1583975933,
        "id": "fk9h2z4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1584004733.0
    },
    {
        "author": "roadtrippn",
        "body": "My neighbors are on mandatory remote for 2 weeks (FB and Cisco) I hope more companies follow and it proves out not needing to go into the office to do the same shit.",
        "created_utc": 1583815244,
        "id": "fk3233d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583844044.0
    },
    {
        "author": "dwyaneeewadeee",
        "body": "Cisco is an easy, safe, boring buy",
        "created_utc": 1583961998,
        "id": "fk8sd8c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583990798.0
    },
    {
        "author": "internetnewuser",
        "body": "I had that 2 weeks ago ... it spiked then came down and started tracking S&amp;P, so I sold and got some S&amp;P puts instead. I see it went up today.\n\nEdit: Good DD, OP. I would like to know how much rev can be sustained. Schools will be closed for a month. Will they keep using the platform after things went back to normal?  Some competitors: Free Google classroom, Cisco offered free Webex accounts, Zoom, etc.",
        "created_utc": 1584039989,
        "id": "fkbu97n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584068789.0
    },
    {
        "author": "ISeekGirls",
        "body": "$CSCO 40 calls 9/18... Dirt cheap options to print some extra cash.",
        "created_utc": 1583523484,
        "id": "fjo9ut3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583552284.0
    },
    {
        "author": "ColdManWinters",
        "body": "ZM\n\nEDIT or CSCO",
        "created_utc": 1583868867,
        "id": "fk4wcel",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583897667.0
    },
    {
        "author": "mayormcsleaze",
        "body": "Everyone is talking about how work from home will benefit Zoom but nobody is talking about Cisco. Am I missing something? WebEx meetings should skyrocket right? My org just doubled our number of Cisco AnyConnect VPN licenses",
        "created_utc": 1584460630,
        "id": "fkr2mh3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584489430.0
    },
    {
        "author": "MotivationalMadness",
        "body": "My uncles job just shut down an office branch and is telecommuting indefinitely until further notice.... *cough Cisco cough*",
        "created_utc": 1584137151,
        "id": "fkflmuq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1584165951.0
    },
    {
        "author": "TheGoodSauce",
        "body": "CSCO is the biggest fucking cock tease",
        "created_utc": 1583860724,
        "id": "fk4hsvu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583889524.0
    },
    {
        "author": "Jordykins850",
        "body": "Cisco, IBM, CBS, Discover, shit ton of food stocks, Comcast, yada yada yada. Lots of beaten down blue chips.",
        "created_utc": 1583648134,
        "id": "fjwwxxc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583676934.0
    },
    {
        "author": "magnificient_turd",
        "body": "Any decently sized company with an IT department that’s got more than three brain cells already has this shit implemented. And half them probably use Cisco anyway.",
        "created_utc": 1583594765,
        "id": "fjs8oya",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583623565.0
    },
    {
        "author": "WestmontOG07",
        "body": "Amazon, google, FB, Qcom, SWKS, VOO, CSCO, Pfizer and Intel all the way down!\n\nAlso buying puts on the SPY!\n\nWhat are you buying?",
        "created_utc": 1584406963,
        "id": "fkpcnfl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1584435763.0
    },
    {
        "author": "N-tropi",
        "body": "It depends on how good your internal IT is and how much you pay Cisco. Source: worked at two large Fortune 500 companies both using Webex. Current job has excellent IT and flawless Webex other one was so shit that they moved to Skype for business, which was even more shit.",
        "created_utc": 1584496363,
        "id": "fksqz6j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584525163.0
    },
    {
        "author": "chazberlin",
        "body": "Seriously \\*fuck\\* WebEx. That might be their worst product. I am long on CSCO, but I'll take Zoom or even a Google Hangouts call over WebEx.",
        "created_utc": 1584452608,
        "id": "fkqpnnp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584481408.0
    },
    {
        "author": "Jonnydoo",
        "body": "wtf just happened to Cisco  ?",
        "created_utc": 1584540486,
        "id": "fku20v6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584569286.0
    },
    {
        "author": "Eunstoppable",
        "body": "The next time theres a rug pull im going to be going long calls on $CISCO. Everyone on this sub is bullish on Zoom and they forget that the majority of people working from home are using Cisco WebEx for meetings. DYOR but IV and premiums are pretty low for a multi-billion dollar company.",
        "created_utc": 1584515230,
        "id": "fktdn4t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584544030.0
    },
    {
        "author": "tehnoodles",
        "body": "At a very small scale software like DNAC or DCNM works ok. Try to scale this to 10,000's of nodes, and it starts to fall apart. I have seen this multiple different times, and this was using recommended compute hardware given to us by cisco to try and make it work.\n\nThe automation software crumbles when you reach scales the require automation, which completely defeats the purpose.\n\nI also didn't say their hardware has issues. Aside from the usual bug schedule (which cisco is no better/worse than anyone else) their hardware is rocksolid, it really comes down to the software for the API on the devices, or the software of tools to manage it.\n\nCisco is only a leader in the market when you look at the entire breadth of their portfolio because: No one else is spread as thin. Only Juniper comes close and IMO and while i like SRX, it's not a while lot better than Firepower. Their ability to automate though? Leaps and bounds above cisco, and their hardware platform is arguable just as mature as any that cisco has on the market.",
        "created_utc": 1584372554,
        "id": "fknrrp2",
        "score": 1,
        "subreddit": "investing",
        "created": 1584401354.0
    },
    {
        "author": "BF5lagsssss",
        "body": "CISCO if it falls is good. Yes WEBEX has Zoom as its competitor but in network infrastructure it is the only major US firm and its competitors Juniper Networks doesnt quite have the scale as CISCO. However I would get CISCO maybe at 30 or less. I heard CISCO is entering the fabless network chip design market against Broadcom though so if you want sure throw down.",
        "created_utc": 1584379837,
        "id": "fko4azr",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1584408637.0
    },
    {
        "author": "tendieshitter",
        "body": "First off, visit [optionsprofitcalculator.com](https://optionsprofitcalculator.com) to get an idea what you would make with the move of an option. It's usually difficult to calculate given all the variables, but this site should help.\n\n\" say I expect the stock to hit $35.50 at some point that day and I would  sell it, I would want to buy a put option because I expect the stock to  go down on Monday. This protects me and provides me with the opportunity  to sell my 100 shares at $36.62 still, when the current price is  $35.50. Correct? \"\n\nNo. If you expect a red Monday and you already own 100 shares of Cisco you plan to sell, you are already dealing with a loss. Furthermore, if you expect the price to go down further you would be good to buy a put contract on Cisco. \n\nIf you want to hang on to your shares of Cisco because you expect them to go up, but want \"insurance\" against that, you could also buy a put contract in case the price goes down.",
        "created_utc": 1584259300,
        "id": "fkjtrjg",
        "score": 1,
        "subreddit": "options",
        "created": 1584288100.0
    },
    {
        "author": "bookiefinesser",
        "body": "cisco webex is what my school has been using",
        "created_utc": 1584297958,
        "id": "fkl3xys",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584326758.0
    },
    {
        "author": "Vorskl",
        "body": "CISCO recovering to its 2000 price and the end of the Solar System - guess what 's common",
        "created_utc": 1584300667,
        "id": "fkl8a7l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584329467.0
    },
    {
        "author": "TrickyTarget",
        "body": "can anyone tell me why cisco at $30 strike price put expriring 4/17 went straight to $0.01even though they are down $4.56 since open",
        "created_utc": 1584365550,
        "id": "fknh0ne",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584394350.0
    },
    {
        "author": "EGK1717",
        "body": "Sysco, not Cisco",
        "created_utc": 1584324231,
        "id": "fkma65l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584353031.0
    },
    {
        "author": "gizamo",
        "body": "Lol. I also loath Cisco. When it was rumored that AMZN was making and would sell their own switches, I nearly shit myself with joy. Then, Bezos bitched out on us. Sooner or later they'll go the route of ORCL -- overcharge to the point of obsoleting themselves. I hope you're right. Cheers.",
        "created_utc": 1584325789,
        "id": "fkmclfr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584354589.0
    },
    {
        "author": "MT-6-55-3",
        "body": "I converted the $CORP to Aruba. They still suck, but they suck less than Cisco.\n\nCthulhu for president 2020! When you're tired of voting for the lesser of evils.",
        "created_utc": 1584326166,
        "id": "fkmd5tg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584354966.0
    },
    {
        "author": "ccaiccie",
        "body": "PANW FTNT CSCO",
        "created_utc": 1584283950,
        "id": "fkkh8dm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584312750.0
    },
    {
        "author": "fco1017",
        "body": "However, you want to go LONG.  I prefer to sell puts at what I think is below fair value for stock price.  For instance, I just sold APR puts for CSCO with strike of $40 for $3.55.",
        "created_utc": 1583943287,
        "id": "fk7tf3p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583972087.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "I would buy if I was in your position.  Cisco is doing alright atm.  They are, however, at a crossroads where they are trying to decide how to move forward.  They've been on a straight tear in [acquisitions](https://www.cisco.com/c/en/us/about/corporate-strategy-office/acquisitions/acquisitions-list-years.html) so if any of those pan out it could be big for them.  If you look at what each of those acquiring companies does though, it's all over the place.  SaaS, analytics, security, communications...I don't know if they're trying to be a jack-of-all-trades or if they are just throwing darts and seeing what sticks.",
        "created_utc": 1583854074,
        "id": "fk463l9",
        "score": 1,
        "subreddit": "investing",
        "created": 1583882874.0
    },
    {
        "author": "Logisticsbitches",
        "body": "Nope. MSFT has Skype.  Cisco has WebEx.  Either Dell or HP or dark horse Lenovo snatches up Zoom.  Apple is not the right fit",
        "created_utc": 1583990849,
        "id": "fka352n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584019649.0
    },
    {
        "author": "i_have_a_nose",
        "body": "Cisco maybe?",
        "created_utc": 1583968968,
        "id": "fk958o2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583997768.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM &amp; Cisco available for 115 and 35 in PM 🤤🤤",
        "created_utc": 1584000944,
        "id": "fkabz2e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584029744.0
    },
    {
        "author": "lplui",
        "body": "I am a new investor and here is what my portfolio so far.\n\nAAL majority of my shares\n\nMSFT\n\nUber\n\nPSX\n\nCCL\n\nKO\n\nSBUX\n\nAMD\n\nLBTYA\n\nCSCO\n\nPTN\n\nLYFT\n\nTaronis technologies: for short term investment\n\nI do not have too many shares on those but for this week, I want to buy more shares for the long term. My eyes are on SPY, APPl, and airlines but I think that each share is quite pricy. My plan for these upcoming weeks is to keep buying if the prices go lower. I have about $5k I want to invest but I don't want to diversify it too much and focus on where I have a great long term potential. Any advice?\n\nAgain, I am a new investor.",
        "created_utc": 1583688262,
        "id": "fjy22as",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583717062.0
    },
    {
        "author": "mickeyprime1",
        "body": "just go with a big full service broker like Schwab, Vanguard. I have both and was able to buy VTI, CSCO, STOR at 140,37.15,30 respectively. They worked great was able to change limit orders placed pre market to decrease limits even more almost at open. Now that trading cost are 0, no point sticking with RH. [Here](https://wealthcapitalist.com/tipsntricks/choose-broker-investing/?utm_source=reddit&amp;utm_medium=referral&amp;utm_campaign=generic_all) is my referral free review of both if you wanna check.",
        "created_utc": 1583763927,
        "id": "fk0qmok",
        "score": 1,
        "subreddit": "investing",
        "created": 1583792727.0
    },
    {
        "author": "jackperitas",
        "body": "I already sold some AMD puts\nMaybe I'll add CSCO, Apple and BRK.B",
        "created_utc": 1583789648,
        "id": "fk1ywqf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583818448.0
    },
    {
        "author": "mrbiggles2020",
        "body": "I have leaps right now.  Sold some CSCO outs and a FB put today as well.  Rest is AMZN leaps",
        "created_utc": 1583815865,
        "id": "fk32so8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583844665.0
    },
    {
        "author": "SUPER_swan",
        "body": "The ESPP program you have is a great money maker for you.\n\n\nLook at the last 10 years of the stock, not the last 6 months. Cisco has slowly gone up.\n\n\nLets say your required holding period is 1 year. That means if you hold the stock for 1 year and the stock doesn’t budge in price. If you sell you gain the 15% in the discount plus 4% from the dividend you gained as well. Historically, the stock has gone up as well, which also increase your gains.\n\nSo, continue to buy your company stock.\n\n\nNow there is some people I bet at your work, just like mine, that have bought their company stock for 20+ years and never sold. Doing this increasing your exposure to that one company. If the company tanks, your stock will be worth a lot less and you could be out of a job.\n\n\nHowever, if you go with selling right after your lock out period it’s a great way to use that discount to generate more money for you. \n\n\nRelax investing is a marathon not a sprint.",
        "created_utc": 1583847307,
        "id": "fk3vh8n",
        "score": 1,
        "subreddit": "investing",
        "created": 1583876107.0
    },
    {
        "author": "ChucklesMcGangsta",
        "body": "I own INTC, F , DAL, SPHD, T, PFE, CSCO, and SYF. When you focus on dividends and less on massive growth percentages, big dips in the market like this shouldnt worry you very much. Always keep a cash balance in your account for when dips like this happen. That way you can buy more stock of your favorite dividend companies when they do.",
        "created_utc": 1583752831,
        "id": "fk0d4cp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583781631.0
    },
    {
        "author": "suchacrisis",
        "body": "Yep, probably because no one is gunna buy for the market open price. I had puts on CSCO I tried to sell this morning for 3.80 and market is 2.33 right now.\n\nI get it, you fucked me and I can't make money Robinhood but at least let me fucking cancel it.",
        "created_utc": 1583772435,
        "id": "fk14us6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583801235.0
    },
    {
        "author": "Jordykins850",
        "body": "Cisco, 2yr lows. IBM, 52w low.",
        "created_utc": 1583478327,
        "id": "fjmpgtt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583507127.0
    },
    {
        "author": "ISeekGirls",
        "body": "$CSCO 40 call 9/18. Why? Well, their product WebEx is conferencing software, and a lot of businesses have started using ever since the outbreak. Also, Cisco already priced in the coronavirus in February. A significant shift from the office to the home is happening and will stay that way.",
        "created_utc": 1583613929,
        "id": "fju67vs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583642729.0
    },
    {
        "author": "ISeekGirls",
        "body": "Also, Webex, a Cisco product, has risen in use since the coronavirus outbreak. WebEx is a remote networking meeting software\nhttps://www.webex.com/",
        "created_utc": 1583524582,
        "id": "fjobrg2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583553382.0
    },
    {
        "author": "gamesterdude",
        "body": "Tech consultant here.\n\nThis guy is right. Companies don't have capacity for large scale work from home if a bulk of their workforce is normally in the office. \n\nSure you may always have been given VPN access, but most companies don't have enough capacity for everyone to use VPN at once. I typically see mid to large cap have capacity for about 30% of their workforce.\n\nI think if you want to play this though you have to stagger calls on cisco to collect on the q2, and q3 up tick. Theta may be a big enemy on this one.",
        "created_utc": 1583604636,
        "id": "fjt688f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583633436.0
    },
    {
        "author": "lo979797",
        "body": "Was too pricy for my paltry sum. Also $ONE, $CSCO",
        "created_utc": 1584055738,
        "id": "fkclngl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584084538.0
    },
    {
        "author": "Liquicity",
        "body": "MS Teams &gt; Slack. Slack is just for consultants to dick around and send memes to each other in every company where I've seen it used.   \n\n\nAlso, the earnings from more people WFH will show up in the future, not right now. These reports are for the quarter ending Dec 31, 2019. And you'd be better off looking at legit teleconferencing solutions such as CISCO and Zoom Video.",
        "created_utc": 1584061121,
        "id": "fkcu0fz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584089921.0
    },
    {
        "author": "ConBroMitch",
        "body": "$CSCO $PANW",
        "created_utc": 1584157479,
        "id": "fkgeo5m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584186279.0
    },
    {
        "author": "Vorskl",
        "body": "The older you become the less risk tolerant you are,  what's wrong with OP? Young people will live long enough to maybe see Tesla back at $1000 (hint: Zimbabwe style inflation in the us) but many seniors who loaded Cisco in 2000 won't ever see its recovery.",
        "created_utc": 1584200083,
        "id": "fkhj70k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584228883.0
    },
    {
        "author": "obnoxygen",
        "body": "The global oil price war hasn't played out yet, so while XOM and VLO are good companies they aren't a buy right now due to uncertainty.\n\nLikewise, I think travel will take a while to pick up again.\n\nwith $100 you can buy 3 csco, 1 sbux and 1 csco, or 1 CAT.\n\nThere's a lot of DIS fans on reddit too fwiw.",
        "created_utc": 1584131538,
        "id": "fkfcouq",
        "score": 1,
        "subreddit": "investing",
        "created": 1584160338.0
    },
    {
        "author": "willtherealdeal",
        "body": "Completely agree, I also like CSCO AND SBUX",
        "created_utc": 1584065730,
        "id": "fkd0yh3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584094530.0
    },
    {
        "author": "Greyrust",
        "body": "Yeah.  But not all blue chip stocks are that expensive - CSCO (Cisco) is at $32 right now, for example, and KO (Coke) is at $46.",
        "created_utc": 1584071714,
        "id": "fkd99xs",
        "score": 1,
        "subreddit": "investing",
        "created": 1584100514.0
    },
    {
        "author": "TrickyTarget",
        "body": "Do I sell CSCO $30p 4/17 or hold over weekend. Asking because the futures are down",
        "created_utc": 1584072351,
        "id": "fkda5s5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584101151.0
    },
    {
        "author": "vikkee57",
        "body": "Netflix did well duirng last week sell off, or in other words not as bad as the others - \n\nPast 5 days - Some random picks from this week's sell offs: \n\nBetter performance: \nNetflix: -3.5%\nRoku: -4%\nFitbit: -0.8%\nSquare: -0.2% \n\nWorst performers: \nCisco: -14%\nAMD: -15%\nApple: -12.5%\nBank of America: -17%\nTesla: -26%\nMacys: -19%",
        "created_utc": 1583426068,
        "id": "fjkfslv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583454868.0
    },
    {
        "author": "LakersRansom",
        "body": "fucking sell.  yes rev will be good but tbey are going to lower guidance\n\nI’m up 1400 today on puts and want to get some csco puts for earnings",
        "created_utc": 1583436666,
        "id": "fjkyy3y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583465466.0
    },
    {
        "author": "medicmurke",
        "body": "Except neither Zoom or Cisco is ready for this amount of bandwidth consumption. Universities are gonna be pissed on the other side of this.",
        "created_utc": 1583969699,
        "id": "fk96h8w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583998499.0
    },
    {
        "author": "Jordykins850",
        "body": "Idk. Cisco could go lower.. but I don’t see how IBM goes below $100..",
        "created_utc": 1584001147,
        "id": "fkac4pd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584029947.0
    },
    {
        "author": "StrictPopcorn",
        "body": "A bit of both. I’ve been using this time to sell off the stocks that I’ve been eying as underperforming and putting that money into stocks that are super down now so that I may see a good return instead of a continued loss even after the market recovers. \nI’ve also been increasing my dividend holdings significantly, I’ve been eying the airline stocks but for now I just have puts on a few airlines until I make a profit and put that money back into those stocks when I see a better sign of future growth coming for them. Right now they’re being hit harder than most stocks so that’s my thought behind it. \nTLDR:\nWhat I’ve been doubling down in: MSFT, NRZ, AMD, PFE, AMT, CSCO &amp; AAPL \nWhat I have puts on: JBLU, DAL, and sadly WEN (one of my larger holdings before the pandemic).",
        "created_utc": 1583969867,
        "id": "fk96rg2",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583998667.0
    },
    {
        "author": "Pi-R-Squared",
        "body": "Absolutely! CSCO is another one I have my eye on.",
        "created_utc": 1584047698,
        "id": "fkc8640",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584076498.0
    },
    {
        "author": "hwturner17",
        "body": "JNJ, ATT (T)/Verizon, Cisco to name a few others",
        "created_utc": 1584074808,
        "id": "fkdd78z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584103608.0
    },
    {
        "author": "philmacrack123",
        "body": "Thanks for letting me know of the demand for csco. Good luck",
        "created_utc": 1584131626,
        "id": "fkfcu5t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584160426.0
    },
    {
        "author": "ISeekGirls",
        "body": "Cisco already priced in the effects of the coronavirus in Feb. It will slowly rise thought out the year.",
        "created_utc": 1583524062,
        "id": "fjoauo6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583552862.0
    },
    {
        "author": "ISeekGirls",
        "body": "$CSCO 40 Call 9/18. WebEx has risen in use since the outbreak. Also, Cisco priced in the coronavirus during Feb.",
        "created_utc": 1583525981,
        "id": "fjoe7ya",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583554781.0
    },
    {
        "author": "WestmontOG07",
        "body": "My portfolio, for the communities thoughts:\n\nCVS\n\nVerizon\n\nPfizer\n\nIntel\n\nApple\n\nMicrosoft\n\nGoogle\n\nQualcomm\n\nVOO (S&amp;P ETF)\n\nLyondell Basell (Plastics / Polyurethane Manufacturer)\n\nSkyworks (5G)\n\nAmazon\n\nFoot Locker (Wish I wouldn't have bought this one but I'm in the game)\n\nFacebook\n\nCisco",
        "created_utc": 1583670365,
        "id": "fjxenu3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583699165.0
    },
    {
        "author": "Vorskl",
        "body": "BS. Imagine you bought nasdaq at the peak of 2000. It will take ONLY 2014 years to get your money back. Imagine your bought CISCO at its peak.... maybe your grandsons will get the money back, providing there will be Zimbamwe-like inflation in the USA",
        "created_utc": 1583673507,
        "id": "fjxhke1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583702307.0
    },
    {
        "author": "porraso",
        "body": "Non-tech, links to China, diversified (like DIS). If you’re a bit more bullish, something on the cheaper side like CSCO or IBM. Nothing too fancy, and I believe this is just scratching the surface, but you may be able to see a 10-20% jump if you but now without coughing up your balls every time you go into a position.",
        "created_utc": 1583596956,
        "id": "fjsh74k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583625756.0
    },
    {
        "author": "focusedddd",
        "body": "Yes. Also, I hear this little company called Cisco is an up and comer",
        "created_utc": 1583757966,
        "id": "fk0ij5x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583786766.0
    },
    {
        "author": "Jonnydoo",
        "body": "yeah before I had CSCO leaps that were 300% lol , not that I could get rid of them, but it was funny.",
        "created_utc": 1583763166,
        "id": "fk0pi71",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583791966.0
    },
    {
        "author": "Jimmy_bags",
        "body": "I honestly dont know why cisco is so low. They are a market innovator. They have certifications revolving around their products, those careers pay good money too.  They make equipment for the telco giants like comcast, att, their shit is on utility poles... fuck zoom, you'll buy calls and a security breach will happen and end your tendies.  I gave up on Cisco when the company sold off a shit ton of shares and made up \"low guidance\".. they fucked themselves and got rich in the process. Stupid assholes",
        "created_utc": 1583289548,
        "id": "fjfdij2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583318348.0
    },
    {
        "author": "SnarkySparkyIBEW332",
        "body": "&gt; As long as manufacturing can bottleneck your profits, you’re not a tech company.\n\nDisagree.  Lots of tech companies make hardware.  AMD, NVDA, MSFT, Apple, Cisco, etc. all make hardware.  What you're thinking of is a *software* company.  All software companies are tech companies, but not all tech companies are software companies.",
        "created_utc": 1583366730,
        "id": "fjifw0e",
        "score": 1,
        "subreddit": "investing",
        "created": 1583395530.0
    },
    {
        "author": "Smok3dSalmon",
        "body": "They were in bed with CISCO before GCP. They have something on AWS also. But yeah, a grim scenario is that they're the odd man out and looking to be acquired.",
        "created_utc": 1583266185,
        "id": "fje6isk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583294985.0
    },
    {
        "author": "peterjswift",
        "body": "Zoom, Blackboard, Slack, Webex (even though it is a cisco product)...all run on AWS.   \n\nNot to mention all the quarantine providing entertainment like Netflix, Disney+, hulu, and of course Prime video.\n\nAWS is gonna have the biggest quarter in their history.",
        "created_utc": 1583893808,
        "id": "fk64z5n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583922608.0
    },
    {
        "author": "ringrawer",
        "body": "Every 3 years it's done for COMPTIA &amp; CISCO.",
        "created_utc": 1583871026,
        "id": "fk50ae9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583899826.0
    },
    {
        "author": "MementoMori97",
        "body": "MSFT, CSCO, DIS, JET (airline etf, waiting on this one for a while still)",
        "created_utc": 1584370783,
        "id": "fknoxd2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584399583.0
    },
    {
        "author": "orchid_breeder",
        "body": "Go one level deeper and short Cisco that supplies food to most of these restaurants",
        "created_utc": 1584455176,
        "id": "fkqthjk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584483976.0
    },
    {
        "author": "capteni",
        "body": "&gt; Cisco\n\nSYSco",
        "created_utc": 1584455250,
        "id": "fkqtlq4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584484050.0
    },
    {
        "author": "skilliard7",
        "body": "If SPY drops below $240 or CSCO drops below $32, I'll buy.",
        "created_utc": 1584317609,
        "id": "fklywzs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584346409.0
    },
    {
        "author": "Jordykins850",
        "body": "UBER, SPLUNK, CISCO, IBM",
        "created_utc": 1584334781,
        "id": "fkmopc8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584363581.0
    },
    {
        "author": "smartidiotreddit",
        "body": "I agree, shorted the fuck outa $CSCO free money",
        "created_utc": 1584498051,
        "id": "fkstjbb",
        "score": 1,
        "subreddit": "investing",
        "created": 1584526851.0
    },
    {
        "author": "FargotRobMe",
        "body": "Shuffled my positions around:\n\n$PYPL 5/15 $135c\n\n$CSCO 4/24 $25p\n\nSome of you don't understand that selling an unlikely/shitty option at a profit during these volatile times is a thing and it shows.\n\n\"YoU rEaLLy tHiNk $\\[XXXX\\] iS GonNa bE wOrTh ThAt bY tHeN??\" Not all options are meant to be iron-fisted until they're ITM by exp.",
        "created_utc": 1584459297,
        "id": "fkr09sb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584488097.0
    },
    {
        "author": "ams93482",
        "body": "I think the issue is not doing any research before presenting a question. If, for example, you attempt an elementary level of stock analysis and summarize your thought process, while asking for feedback, that would be more appropriate. Simply stating \"should I buy X, I have Y money\" is somewhat lazy. Also, presenting questions in this fashion does not foster discussion in any meaningful way. \n\nTo answer your question:\n\n1. Microsoft, Apple, Google, Facebook, Amazon (Established Tech)\n2. Ecolab, Honeywell, 3M, Corning, Cisco (Blue chip)\n3. ETFs (i.e., VOO or VTI) \n\nStart here. See if you agree after researching. Additionally, I would wait to invest in Airlines/Travel due to the potential for bankruptcy.",
        "created_utc": 1584470328,
        "id": "fkrjxo0",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1584499128.0
    },
    {
        "author": "skilliard7",
        "body": "Odd, I haven't had any problems with their hardware/software in the past. There are competitors but from what I've seen Cisco is still the leader in the market.",
        "created_utc": 1584372116,
        "id": "fknr1h7",
        "score": 1,
        "subreddit": "investing",
        "created": 1584400916.0
    },
    {
        "author": "catarahbpus",
        "body": "Ate up some T at 32, KO at 46, and CSCO at 33 is a new position. Also got a new position in NRZ, a REIT at $11. I had it and sold it at $17.5 before the downturn. Waiting to see PFE back at $30 or below. Those are my only  real buys since the markets been negative. Got new positions in Ally and TWTR that I'll be buying more of. And looking to get DAL around 35. But I have so many things on the list, trying to gauge when to buy into Nike, mid 60's may be a solid entry point.",
        "created_utc": 1584383352,
        "id": "fkoajvo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584412152.0
    },
    {
        "author": "chihuahua001",
        "body": "Come on CSCO pump! Everyone and there mother is using WebEx right now!",
        "created_utc": 1584452111,
        "id": "fkqoy0d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584480911.0
    },
    {
        "author": "FargotRobMe",
        "body": "`$CSCO` 2021 calls were looking good, but Cramer is interested so I guess PUTS IT IS!",
        "created_utc": 1584451394,
        "id": "fkqnxtg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584480194.0
    },
    {
        "author": "MT-6-55-3",
        "body": "I work in tech. Fucking Cisco is the devil.\n\nI love the $400 bottles of wine that go down like your wife, but the reviews from my boss are worse than my wife's boyfriend.\n\nFucker can't give a good reach!",
        "created_utc": 1584325399,
        "id": "fkmc09v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584354199.0
    },
    {
        "author": "CornbreadMonsta",
        "body": "That's true, I think Cisco and Citrix are gonna be the play.",
        "created_utc": 1584535810,
        "id": "fktvj11",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584564610.0
    },
    {
        "author": "FargotRobMe",
        "body": "`$CSCO`, `$PYPL` and `$F`",
        "created_utc": 1584542155,
        "id": "fku4n3f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584570955.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM, which looks to have already found its bottom in all of this at around 95-97 is my personal fav. Also taking a shine to Discover, Olin, Cisco, SOXL.\n\nAny of the sexier SaaS are trading at huge discounts.. I got Splunk puts.. but damn right I’d be gobbling it up at 90. Shit all around that’s looking mighty good, Boeing just isn’t it.",
        "created_utc": 1584516881,
        "id": "fktf0kt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584545681.0
    },
    {
        "author": "Bendertheoffender69",
        "body": "Callls on Cisco etc",
        "created_utc": 1584288285,
        "id": "fkko0dt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584317085.0
    },
    {
        "author": "humm1010",
        "body": "Csco",
        "created_utc": 1583205146,
        "id": "fjbzvg2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583233946.0
    },
    {
        "author": "Istinto",
        "body": "I bought csco on friday",
        "created_utc": 1583130559,
        "id": "fj93bmm",
        "score": 1,
        "subreddit": "investing",
        "created": 1583159359.0
    },
    {
        "author": "focusedddd",
        "body": "A Robinhood spokesperson said the outage was caused by \"infrastructure that allows our systems to communicate with each other.\" \n\nSo your telling me your down again because you can't configure a Cisco ASA or a fucking managed switch is that a joke. \n\nJ.k. they are prob using Linksys routers from BestBuy",
        "created_utc": 1583249811,
        "id": "fjdbdoj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583278611.0
    },
    {
        "author": "dinodan420",
        "body": "Definitely diversely with blue chips too, those holding companies could theoretically blow up so there is a lot of risk. You can’t go into it thinking you’ll get a 10% dividend of your intial investment every year. I’m liking CSCO right now",
        "created_utc": 1583111987,
        "id": "fj8f6mb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583140787.0
    },
    {
        "author": "espresso_inflective",
        "body": "&gt;I'm sorry, but people stuck at home won't be buying fewer Apple products to entertain themselves with, even if there is a delay in receiving the product from Apple, and Cisco won't stop building the internet that more people will use when they quarantined at home, and people won't go on Twitter less when they stuck at home, or buy less bandaids from JNJ, or stop buying laundry detergent from PG.\n\nAll of these are examples of demand shock, which I think most people agree is not the issue here. The issue is a supply shock: Apple is going to produce less, Cisco is going to have trouble obtaining their parts, Twitter's advertisers are going to experience similar shocks and buy fewer advertisements, and PG is going to have trouble sourcing the inputs for its laundry detergent.",
        "created_utc": 1583171711,
        "id": "fjae9sz",
        "score": 1,
        "subreddit": "investing",
        "created": 1583200511.0
    },
    {
        "author": "ruslantulupov",
        "body": "Yes, at least to a degree. \n\nSource: Worked for IBM, frequently flew to attend business meetings.",
        "created_utc": 1583100712,
        "id": "fj7xxb2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1583129512.0
    },
    {
        "author": "Frenchiie",
        "body": "IBM says hi.",
        "created_utc": 1583100990,
        "id": "fj7ycpk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583129790.0
    },
    {
        "author": "Jordykins850",
        "body": "CBS, IBM, GLD all ripping. Has the markings of a good morning.",
        "created_utc": 1583141508,
        "id": "fj9c2la",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583170308.0
    }
]