[
    {
        "author": "larry-the-dream",
        "body": "I’ll break out my 2004 Motorola",
        "created_utc": 1608067860,
        "id": "gfyqem1",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1608096660.0
    },
    {
        "author": "proteccstaccs",
        "body": "Looks like a flip phone. Calls on Motorola",
        "created_utc": 1608523200,
        "id": "ggjy0ao",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1608552000.0
    },
    {
        "author": "Smell_Of_Cocaine",
        "body": "I hate professional porn.\n\nI have an easier time jerking off to some to some homemade porn made on a Russian guys Motorola razor than a 4K well lite Hollywood production gangbang",
        "created_utc": 1608534480,
        "id": "ggkdd7p",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1608563280.0
    },
    {
        "author": "DHK007",
        "body": "That was a concern for myself personally moving forward to whether to place a stake in this company.  \nThere are 3 things which made me sold on CRSR moving forward.  \n1) Esports + Aggressive marketing - It's slowly gather more and more mainstream media attention, with major sports leagues putting in stakes and major corporations backing them as sponsors of teams and entire leagues. Corsair, along with MSI, AMD and NVIDIA have been the leaders in leading the fronts of aggressively marketing in this niche market with a  lot of potential. What's Corsair lacked prior was its brand name as Corsair has always been a great product going back as early as 2010s but known to only handful of PC Enthusiasts. It's becoming a more of a household name and brand recognition goes a  long way in terms of  generating revenue moving forward.   \n\n\n2) Tech Growth + Monopolization in a niche PC Part area - AMD|NVIDIA going head to head on releasing the latest graphic cards and improving their chip sets, the underlying factor is the necessary components that come with running these newest cards (Ram + Power Supply). In the RAM department, Kingston HyperX and Corsair have been the two leaders of RAM making and Corsair is starting to pull ahead as the best mid-high tier RAM to go to especially with its \"Corsair Dominator PLatinum RGB\".  \n\n\nIn the Power Supply market, Corsair is also to pull ahead as \"The\" power supply needed to require to run the powerful chipsets and starting to take monopoly in this field.  \n\n\n3) The Wild Card: What was interesting about the Q3 presentation was its sinking its money into coaching/training people to become streamers on such popular platforms as Youtube/Twitch, a market which took off within the past few years and really taking off with Covid by acquiring \"Gamer Sensei\". I'm interested how popular and how much revenue they can extract from this since they're the first large scale company to tap into this market. Q4 would give a better estimation on how this is going.  \n\n\n\\-----------------------------------------  \n\n\nWith that said, nothing is certain and I'm not sure. based on what you said, may hold true but even if what you said was true, it would be wise to invest in Corsair for the next few quarters knowing that CoVid is still rampant right now, in a world full of lockdowns and a  Q4 coming up with Christmas Sales + BF/CM sales included, no?",
        "created_utc": 1607809965,
        "id": "gflc2yl",
        "score": 5,
        "subreddit": "investing",
        "created": 1607838765.0
    },
    {
        "author": "NeedsPraxis",
        "body": "Honestly, it's the best GPU I've ever had. I specifically got the MSI RTX 2060 Gaming Z, and it still plays most new AAA games at ultra or very high settings. The biggest issue I have is my CPU -- I'm still running on an i5 2500k, and that's my biggest bottleneck rn.\n\nAs for the stock, I'm probably going to lose money. But that's what I come to this subreddit for.",
        "created_utc": 1608227357,
        "id": "gg5u1h7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1608256157.0
    },
    {
        "author": "lulubutts",
        "body": "so is nokia and Motorola but where are they now",
        "created_utc": 1608677523,
        "id": "ggqmsnl",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1608706323.0
    },
    {
        "author": "3rd_Degree_Churns",
        "body": "It was called the Silicon Prairie waaay before the dotcom boom.  Ever heard of Motorola or Texas Instruments?",
        "created_utc": 1607727886,
        "id": "gfgez7v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1607756686.0
    },
    {
        "author": "not_creative1",
        "body": "iPhone has been invented and you are talking about betting on Motorola and Nokia.\n\nSure, not a perfect metaphor as apple was not an upstart when iPhone was invented. But there are a lot of parallels.\n\nFor one, you underestimate how hard it is to make electric cars. First model s was launched in 2012, its been 8 years and even now, there aren’t half decent equivalents from European car companies that can compete with the model s. Ever wondered why?\n\n\nThe meat behind electric cars is electronics, software and AI like self driving technology. Tesla was born in the part of the world that is the best at all of this. Europe is decades behind on AI, Machine learning compared to Silicon Valley, VW has no hopes of catching up to google/tesla with self driving tech. Silicon Valley is bloody good with electronics, Europe is not close. China is pretty close to Silicon Valley and that’s why you see nio, xpeng etc get the hype. \n\nNext VW is coming from China. Tesla is the Ford/GM of the 60s from the US. Europe is falling behind because all the core technologies required to make great electric cars are not their strengths.",
        "created_utc": 1609116616,
        "id": "gh8o6q4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1609145416.0
    },
    {
        "author": "pelikana20",
        "body": "What's next, Motorola Razr?",
        "created_utc": 1606965315,
        "id": "geg772d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606994115.0
    },
    {
        "author": "alioli0518",
        "body": "Check BB’s twitter. They just announced an investor call for 2pm this afternoon to chat about their new Ivy tech. No idea how BB will go during the day but id expect it to get up to $11 if this investor call gets crazy. So if its running up id sell right around 3:45 to make sure youre covered from loses. Other alt. Is to see if Ivy makes elon jealous and gen Z figures out that bb is now more like pltr than Motorola, this will be mooning by march.",
        "created_utc": 1606888090,
        "id": "gecc5k7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606916890.0
    },
    {
        "author": "Upbeat_Control",
        "body": "Kathuria was the public face for MirCorp, a joint venture with the Russian space agency aimed at privatizing space exploration. Los Angeles financial adviser Dennis Tito paid $20 million to go to the International Space Station in 2001, but the venture has since languished.\nDuring his time at MirCorp, Kathuria touted a $40 million agreement with NBC and the producer of the TV hit \"Survivor\" to devise a TV game show that would send the winner into orbit on the Russian Mir space station. But the deal fizzled after the aging Mir was deorbited by the Russians.\nKathuria also lists himself as president and co-founder of New World Telecom LLC, a firm that, according to one version of his resume, \"develops and operates major telecommunications and Internet projects throughout the world.\" He also previously listed himself as a founder of Koshika Telecom Ltd., \"which operates digital cellular mobile telephone services ... in India reaching 300 million consumers.\"\nCellular licenses revoked\nBut the cellular licenses, held in partnership by Kathuria's firms with an Indian company, were revoked by the government over a fee dispute. \"Koshika is not operational right now,\" Kathuria acknowledged.\nNew World Telecom was the beneficiary of U.S. Commerce Department help in getting permission to build a wireless telephone network in Albania. One Kathuria Web site asserts that his firm worked \"in partnership with Motorola, who has signed a letter of intent for $50 million,\" and that \"over $325 million will be spent on the project.\"\nBut a Motorola spokeswoman said the company simply agreed to sell Kathuria equipment if he could get financing. Ultimately, the deal with the Albanian government fell through, Kathuria acknowledged.\nKathuria previously has claimed that he co-founded X-Stream Networks Inc., an Internet service provider that became the third largest in the United Kingdom, and that he pioneered the concept of free Internet service. But Chris Sukornyk, who started X-Stream with his brother, said Kathuria was not a founder, \"did not help pioneer\" free Internet service, and never directly invested in the business. Kathuria's resume no longer refers to himself as a \"co-founder,\" but he maintains the company would not have survived without his help to line up financing.\nOne of Kathuria's higher-profile ventures was HealthCite, a Web site launched in August 2000 to deliver medical information to consumers and physicians. It attracted a $10 million investment from biotech giant Amgen and a $2.18 million loan from Enterasys Networks, a wireless equipment firm. It also hired Leo Burnett USA to provide marketing services.\nLittle more than a year later, Burnett filed suit in Cook County Circuit Court for breach of contract and eventually won a $155,000 judgment, which HealthCite is appealing.\nBy June 2002, HealthCite began laying off many of its two dozen or so employees. Even so, in November 2002, Kathuria supplied figures to reporters suggesting that HealthCite was the second-largest medical-interest site on the Internet. But the next month, Enterasys sued HealthCite for breach of contract and the firm told Maryland officials that it was broke.\n\"The company is not operating, has no employees, and has over $3 million in outstanding liabilities,\" wrote HealthCite president, Inderjote Kathuria, Kathuria's brother, in a letter to the Maryland attorney general.\nFirm sounds good on Web\nAs an offshoot of HealthCite, Kathuria created Agatal Inc., described in its Web site as \"a leading provider of wireless networks, network management services, health care information portals and broadband access solutions ... \"\nBut there is scant evidence that Agatal, or its successor firm, Vimani Wireless, has been providing much to anyone. Deals Kathuria touted in an Internet publication last November, involving wireless networks for a large insurance company and to build \"hotzones\" in Camden, N.J., never took place, he acknowledged.\nKathuria said an interviewer misunderstood him.\nOne former HealthCite official is Naiyer Imam, a Virginia radiologist who was Kathuria's roommate at Brown. Imam, who also chairs a firm that runs Kathuria's campaign Web site, was told by the World Intellectual Property Organization in July 2000 to give up rights to the \"burlingtoncoatfactory.net\" Internet domain name.\nThe ruling said Imam acted in \"bad faith\" for acquiring that domain name and others such as Izod, Liz Claiborne and Pepperidge Farm, with the intent of making a profit by selling them back to the companies that own those well-known brand names.\nImam and Kathuria currently are focused on a new business--a medical diagnostic imaging clinic chain, Medical Oasis Inc.\n\nKathuria has made different claims about the status of Medical Oasis in different versions of his resume. In one, he says it \"owns and operates chains\" of centers \"in partnership with Toshiba Corp. of Japan.\" Other versions of the resume describe Medical Oasis as \"positioned\" to become a leading chain of diagnostic centers and tout financial agreements with German technology conglomerate Siemens or Banco Popular, a Puerto Rican-based banking firm.\nBut officials with all three of those corporations say they have no financial agreements with Kathuria or his company. What's more, Kathuria conceded that the only functioning center connected to Medical Oasis was in Roanoke, Va., in which Imam claims partial ownership.\nKathuria is not only using his resume to try to win votes, but also to woo business partners.\nScott Seaberg, a vice president of Meridian Regional Imaging in Mundelein, said his firm has agreed to work with Medical Oasis to develop imaging centers in the upper Midwest.\nKey to the deal, he said, were Kathuria and his credentials.",
        "created_utc": 1607159107,
        "id": "geoodxs",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1607187907.0
    },
    {
        "author": "boogi3woogie",
        "body": "This is basically what happened.\n\nAn apple engineer bought a tesla.\n\nHe sat in it.\n\nHe said “I can make this shit even better”.\n\nHe sacrifices a lamb to the spirit of steve jobs.\n\nThe spirit of steve jobs says, “Ye shall make a car that make a Tesla look like a motorola razor.”  \n\nBut realistically they’re just going to supply the electronics and batteries while someone else assembles the rest of the car.",
        "created_utc": 1608609465,
        "id": "ggnqlwn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1608638265.0
    },
    {
        "author": "taofsatori",
        "body": "&gt; Iridium (Motorola), Globalstar, Teledesic (Microsoft), and O3B the only thing these have in common with AST are they are related to satellites. AST is linked with nano satellites, not big, bulky, expensive one and done satellites. Also back when these operators were trying, they have infrequent and expensive lauch costs, they had no or expesnive in space servicing. And the tech on the satellites themsleves has advanced 20 years, on the ground and in orbit.  \n&gt;  \n&gt;  \n&gt;  \n&gt;Can not even compare these with the new parifigm and AST anymore.  \n&gt;  \n&gt;  \n&gt;  \n&gt;From Today, same thing Maxr CEO says applies to AST as well. Need new way of thinking about the space and business, comparing old satellite business to now is is like comparing dial up to highspeed broadband  \n&gt;  \n&gt;  \n&gt;  \n&gt;\"“Launch costs are going down, but also launch frequency, the cadence in which things are being sent up into space is also going up,” pointed out Lucy Condakchian, GM of robotics at Maxar Technologies . “So if  you can launch smaller subsystems payloads and whatnot, and then be able to assemble things in space, maybe change out a certain aspect of what that satellite is doing… Why can’t we go up and actually change out a power subsystem, change out a camera mechanism, a computing element, whatever the case may be?”  \n&gt;  \n&gt;  \n&gt;  \n&gt;[https://techcrunch.com/2020/12/18/orbital-refueling-and-manufacturing-go-from-theory-to-reality-in-2021/](https://techcrunch.com/2020/12/18/orbital-refueling-and-manufacturing-go-from-theory-to-reality-in-2021/)",
        "created_utc": 1608697449,
        "id": "ggrm9rb",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1608726249.0
    },
    {
        "author": "Floginim",
        "body": "It's like the Motorola 2-way pager of the teledildonics world.",
        "created_utc": 1608173668,
        "id": "gg3ojhv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1608202468.0
    },
    {
        "author": "lulubutts",
        "body": "MSI\n\nasus\n\nalienware",
        "created_utc": 1607755251,
        "id": "gfhwvh9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1607784051.0
    },
    {
        "author": "CappiBeats",
        "body": "GG 60 fps 1000 ping gg msi geforce 720 potato adde computer get clapped S T O N K S",
        "created_utc": 1607421779,
        "id": "gf1h0pq",
        "score": 1,
        "subreddit": "stonks",
        "created": 1607450579.0
    },
    {
        "author": "Ijduwa",
        "body": "TACAU has ex motorola and vodaphone executives",
        "created_utc": 1608583507,
        "id": "ggmefsb",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1608612307.0
    },
    {
        "author": "Zephyr101",
        "body": "Bro just say you got a Motorola and go",
        "created_utc": 1608699134,
        "id": "ggrow0a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1608727934.0
    },
    {
        "author": "Jetta_Junkie528",
        "body": "The hell did you snatch a 3080??\nI flew to Mo from Cali only to grab a 3060ti MSI trio",
        "created_utc": 1608517765,
        "id": "ggjohzu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1608546565.0
    },
    {
        "author": "jhonkas",
        "body": "so what are yiu doing with that info? MSI EURO / ASIA?   AFRICA? Arethey investing in BRIC? \n\nther's probably 250B that's coming in beause of bidentoo",
        "created_utc": 1608333269,
        "id": "ggb0qhs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1608362069.0
    },
    {
        "author": "MichaelYada",
        "body": "No, Just something I worry about whenever I short stocks.  I still have ptsd from when Google bought Motorola Mobility when I was shorting Motorola.",
        "created_utc": 1608139385,
        "id": "gg1rpjm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1608168185.0
    },
    {
        "author": "Hank-TheSpank-Hill",
        "body": "None because no one games on Mac. Peripheral companies like razer doesn’t even do software for Mac compatibility because the addressable market is too small. Corsair, MSI no one supports Mac in the gaming world. I’d say it’s less than 1% of the TAM.",
        "created_utc": 1607523835,
        "id": "gf63n8e",
        "score": 1,
        "subreddit": "investing",
        "created": 1607552635.0
    },
    {
        "author": "Ahnold_Stonkntendder",
        "body": "While I agree with your incredulity, I’ve learned to stop obsessing over things that I don’t personally agree with when it comes to investing decisions. The older I get the less I “understand” fads, fashion trends, and pop culture references. But my lack of understanding has no bearing on the reality of said trends and so I don’t base my investing decisions on them. I’m in the market to make money not stroke my own ego.\n\nCase in point, when the Motorola Rokr came out, I thought it was stupid. Who wants to play music on their phone, you’ll kill the battery and not be able to make calls! How wrong was I!\n\nMaking fun of Apple fanboys and girls is so cliche at this point.",
        "created_utc": 1607580483,
        "id": "gf9452d",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1607609283.0
    },
    {
        "author": "Pompz1",
        "body": "When you start with \"you cant\" , you already sound like nokia and motorola.  No need to address anything else you say when you cannot comprehend what is possible.\n\n\"But it doesn't actually exist. And I'm not confident it will exist within the next decade. This is like arguing that Apple should be worth $5 trillion because they will eventually figure out how to...idk...install phones in your brain. It's pie-in-the-sky thinking.\" Your 'pie-in-the-sky' comment is actually YOU saying apple will figure out how to install phones in a brain? WHO said that? You're throwing smoke in order for a terrible comparison to stick. \n\nOf course there's no reason why companies cant figure this out' .. tell me why they havent? Again, apple was ahead with the first iphone by 5 years. What was apple's stock back in 2006 and how much did it rise since then? \n\nYOU literally missing the point (just an example), blew it up and created a terrible comparion thinking apple is the only tech company (there are millions of tech companies out there by the way, look it up) while ignoring the fact that no other tech company has reached apples standards.   Using apple as a benchmark will never meet any relative standards. You're throwing sand at sand in hopes it'll be water. Because of that, your comparisons do not apply and do not justify why Tesla shouldn't be valued where its at. Stop thinking so narrow and open your eyes to where the market and world is going.",
        "created_utc": 1609444013,
        "id": "ghmvnew",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609472813.0
    },
    {
        "author": "SchonoKe",
        "body": "Relax my man there’s Gen Z out there who remember some of that stuff. \n\nThe oldest of the group. Where’s my 96-98 “Wait am I a millennial or gen Z?” Babies at. \n\nI remember the 08 election, the GFC, my first phone was a Motorola Razr in 6th grade. But god damn I do not understand &lt; 20 year old zoomers. Guess I’m a boomer zoomer?",
        "created_utc": 1609078033,
        "id": "gh6ozvw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609106833.0
    },
    {
        "author": "fullondumb",
        "body": "Its a small company in a sea of large experienced companies that are/will be invested in EV.  GOEV has a low range, and no tech that makes them stand outm. The skateboard base and customization seams cook but so did the Motorola phones that was you chould switch things in and out.\n\nThey might go up, or down.  Its the stock market so no one can be 100% sure.\n\nI made a few gand and sold all my positions today.",
        "created_utc": 1609209044,
        "id": "ghcpfhx",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1609237844.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the 11th of December\n\n\n\n## Upcoming events for Friday, December 11th\n\n - Stock splits:\n\n    - MLGF @ **105:100** (Payable date: 12/29/2020)\n    - ROL @ **3:2** (Payable date: 12/10/2020)\n    - UURAF @ **1:10**\n\n - Expected earnings:\n\n  BHAT, BROG, CDZI, CNNB, ESGC, FSR, FTFT, GB, GNUS, GVA, JOUT, LACQ, LAZR, PKX, ROAD, THCB, TPHS, TRCH, USAU, UTSI, VALU, VHC, VIRC, XBIO\n\n - Ex-div:\n\n  AIG, BSET, CBU, CCD, CFFI, CGNX, CGO, CHI, CHRW, CHW, CMCT, CPZ, CSQ, EOD, FCBP, FCNCA, FDX, FIS, GROW, ITUB, JBT, JRVR, LEO, MRTN, SFL, SPR, SRV, SZC, TEF\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 6.2K)\n    - CFTC Copper speculative net positions (previous: 79.9K)\n    - CFTC Corn speculative net positions (previous: 435.0K)\n    - CFTC Crude Oil speculative net positions (previous: 517.2K)\n    - CFTC Gold speculative net positions (previous: 260.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -22.6K)\n    - CFTC Natural Gas speculative net positions (previous: 39.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -24.4K)\n    - CFTC Silver speculative net positions (previous: 47.9K)\n    - CFTC Soybeans speculative net positions (previous: 272.3K)\n    - CFTC Wheat speculative net positions (previous: 11.9K)\n    - Core PPI (consensus: 0.2%, previous: 0.1%)\n    - Core PPI (consensus: 1.5%, previous: 1.1%)\n    - FOMC Member Quarles Speaks\n    - Michigan 5-Year Inflation Expectations (previous: 2.50%)\n    - Michigan Consumer Expectations (consensus: 71.0, previous: 70.5)\n    - Michigan Consumer Sentiment (consensus: 76.5, previous: 76.9)\n    - Michigan Current Conditions (consensus: 87.0, previous: 87.0)\n    - Michigan Inflation Expectations (previous: 2.8%)\n    - PPI (consensus: 0.2%, previous: 0.3%)\n    - PPI (consensus: 0.8%, previous: 0.5%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 241)\n    - U.S. Baker Hughes Total Rig Count (previous: 320)\n\n## Upcoming events for Monday, December 14th\n\n - Stock splits:\n\n    - BEPC @ **3:2** (Payable date: 12/11/2020)\n    - BEP @ **3:2** (Payable date: 12/11/2020)\n\n - Expected earnings:\n\n  AKTX, BHP, CIG, CNSP, CSBR, HEXO, JOB, JT, QD, RFL, SAMA, TCCO, TLGT, VNCE, VVPR\n\n - Ex-div:\n\n  AGM, APH, APTS, ARCC, ARR, AVK, BAF, BANC, BBF, BBK, BBN, BBY, BCAT, BCE, BCX, BDJ, BFK, BFO, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BKK, BLE, BLW, BME, BMEZ, BNY, BOE, BR, BSD, BSE, BST, BSTZ, BTA, BTT, BTZ, BUI, BXMX, BXS, BYM, BZM, CCI, CEN, CII, CMA, COFS, CPG, CPK, CSWC, CTBI, CWH, DIAX, DLR, DPG, DPZ, ECL, EFSC, EGF, EMF, EMN, EXR, FCRD, FFG, FRA, GATX, GBAB, GBL, GGM, GILD, GIM, GOF, GPK, GRMN, HCAP, HES, HLNE, HRTG, HUN, HWBK, HYT, IHIT, IRM, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JSD, JTA, JTD, KAMN, KBR, KNL, LDOS, LEG, MAXR, MBIN, MCA, MEN, MHD, MMD, MRK, MSI, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NDMO, NEA, NEU, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NPN, NREF, NRK, NSA, NSL, NUV, NUW, NVG, NWE, NXJ, NXPI, NXR, NXRT, NYV, NZF, OCSI, OCSL, OLED, OMI, OVV, PB, PCH, PFBI, PINE, PSA, PSB, QQQX, RA, RCII, RICK, RNR, SAH, SBR, SCI, SCM, SELF, SFNC, SJR, SLG, SMMF, SPXX, SSP, STC, STM, TECK, TEI, TMO, TRNO, TROW, TSLX, UCBI, UGI, UNIT, UTMD, VBF, VLY, VRSK, VTA, VVR, WH, WOR, WRB, WWE, WYND, XFLT\n\n - Economic events and announcements:\n\n    - OPEC Monthly Report\n\n^^^^2020-12-11",
        "created_utc": 1607684413,
        "id": "gfdqo4u",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1607713213.0
    },
    {
        "author": "AdolescentCudi",
        "body": "My XR is two years old with a lotttt of daily use and the battery is still in pretty decent shape. It could definitely be a lot better and it used to be a lot better, but compared to my last two phones' (Motorola, Samsung) battery life after two years? I'll take it",
        "created_utc": 1608637550,
        "id": "ggomu7s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1608666350.0
    },
    {
        "author": "iRiserz",
        "body": "Motorola actually.",
        "created_utc": 1607395604,
        "id": "gf0j12i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1607424404.0
    },
    {
        "author": "nonagondwanaland",
        "body": "&gt;[PowerPC](https://en.m.wikipedia.org/wiki/PowerPC) is a reduced instruction set computer (RISC) instruction set architecture (ISA) created by the 1991 Apple–IBM–Motorola alliance, known as AIM.",
        "created_utc": 1607395855,
        "id": "gf0jh6p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1607424655.0
    },
    {
        "author": "lulubutts",
        "body": "most likely \n\nthe first \"iphone\" wasnt made by apple but made by Motorola",
        "created_utc": 1609015124,
        "id": "gh3o2w9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609043924.0
    },
    {
        "author": "thatdudenute",
        "body": "Blackberry, Motorola and Nokia ran the cell phone game in the early 2000s. Then Apple came along and all that’s really left was Samsung. I’d say they had competition and plenty of big players in an established market that they crushed.",
        "created_utc": 1609133672,
        "id": "gh9i444",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609162472.0
    },
    {
        "author": "BottledUp",
        "body": "I got a bit burned on that second account and left it alone for a bit. I now have some money leftover again that I can safely gamble which I will put into that account one of these days after I bought some Christmas presents. I mean, I did win $3 on my $6 lottery ticket and I was able to order an MSI 3060TI today so I feel like I'm on a winning streak.",
        "created_utc": 1606949148,
        "id": "gefbbv0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606977948.0
    },
    {
        "author": "Newtothisredditbiz",
        "body": "I bought AAPL in March 2009. I knew I wanted to invest in 2006 when the iPhone was just a rumour, but I figured the housing bubble would crash the markets and they did. I also bought small amounts of GOOG and AMZN.\n\nMy methodology then and now is to look for a great company that's the dominant leader in a sector that's about to take over the world. \n\nThe iPhone in 2009 didn't have the most marketshare. But it was the best, most innovative smartphone with the best ecosystem around it. That gave AAPL the largest profit share — it still has about 2/3rds of global smartphone profits today.\n\nThat's important because many tech sectors today are winner-take-all or winner-take-most. If you invested in a diversified portfolio of smartphone makers, you'd have piles of crap with Blackberry, Nokia, Motorola, HTC, etc. \n\nGlobally dominant companies like AAPL are rare, so I stay patient and don't chase companies that aren't. I didn't add or subtract any companies to or from my portfolio for ten years.\n\nBut now, 70% of my portfolio is in TSLA. The parallels with 2009 AAPL are uncanny. TSLA dominates the EV market and is the only car company that doesn't sell EVs at a loss. No other EV can match a Tesla's performance for the price, even while selling at a loss.\n\nThe EV market is guaranteed to explode in the next 10 years, as many countries are banning internal combustion car sales by 2035 or 2040. They're literally making TSLA's competitors illegal.\n\nAnd that's not counting TSLA's leadership in the autonomous car space, and the clean energy sector (solar power + mass battery storage).\n\nJust like AAPL was the clear winner in the smartphone market, TSLA is the clear winner in the EV / autonomous car / clean energy markets. \n\n-------\n\nThe other area I'm investing in now is genomics 🧬. It's much more speculative, with loads more uncertainty in the sector. Genetic medicine will for sure have explosive growth, but the science is full of unknowns and a company can implode with just one bad clinical trial. So picking individual stocks is much riskier than picking stocks in IT, social media, etc.\n\nMy two main genomics stocks are my top performers in the latter half of 2020 — outperforming even TSLA. But I wouldn't recommend them to anyone who doesn't know the sector and understand the risks.\n\nMost people would be better off investing in ARKG, Ark Invest's terrific genomics ETF.",
        "created_utc": 1608974095,
        "id": "gh26pqv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609002895.0
    },
    {
        "author": "mfontanilla",
        "body": "Replace Tesla with Apple and the “Big Boys” with Nokia/Motorola... and we heard this before when the iPhone disrupted the candy bar / flip phone.",
        "created_utc": 1607879278,
        "id": "gfprr2u",
        "score": 1,
        "subreddit": "investing",
        "created": 1607908078.0
    },
    {
        "author": "ac13332",
        "body": "Has he printed off his position, cut them out, arranged them, and photographed them on Motorola Razr at full zoom?\n\nThe fuck.",
        "created_utc": 1607865354,
        "id": "gfovuun",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1607894154.0
    },
    {
        "author": "Phlebotanist",
        "body": "Everyone is back to building PCs in 2020/2021 because of a significant generational refresh in components and time stuck at home.  Also premium components have become trendy.  MSI, logitech, corsair, Asus, EVGA etc.  I don't see how corsair is special but a rising tide floats all boats or some shit.",
        "created_utc": 1609166028,
        "id": "ghagufu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609194828.0
    },
    {
        "author": "sneakersourcerer",
        "body": "This is like Apple with iPhone in 2008, legacy auto is Nokia, Motorola, HTC, blackberry... iPhone about to eat their lunch",
        "created_utc": 1608440434,
        "id": "ggg0ct4",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1608469234.0
    },
    {
        "author": "cheebaclese",
        "body": "Such a terrible comparison. No the Tesla is not the iPhone to the Motorola razor. You were flashbanged by the giant center console display and lane keeping assist, both of which any major car manufacturer could replicate. There is no technological revolution in a Tesla that is disrupting driving like smartphones disrupted communication. You still have to drive them, you still use a steering wheel and a gas pedal, it’s a dolled up car that doesn’t use gas.",
        "created_utc": 1607145106,
        "id": "geo93l4",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1607173906.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Watching all these newbs get gutted on PLTR is like that scene in *Fight Club* when Ed Norton beats the absolute shit out of the pretty blonde kid",
        "created_utc": 1606840033,
        "id": "ge9s9do",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606868833.0
    },
    {
        "author": "rainonmydoor",
        "body": "Anyone in on NLOK? PFE?",
        "created_utc": 1607378402,
        "id": "gezmlpz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1607407202.0
    },
    {
        "author": "No_Variety9194",
        "body": "NLOK had a good acquisition",
        "created_utc": 1607395730,
        "id": "gf0j989",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1607424530.0
    },
    {
        "author": "CognitiveJay",
        "body": "CIBR -ETF Outperformed broader market in last year.\nNLOK \n\nHopefully this is better...",
        "created_utc": 1608296250,
        "id": "gg8w2mc",
        "score": 1,
        "subreddit": "investing",
        "created": 1608325050.0
    },
    {
        "author": "No_Variety9194",
        "body": "Nlok making move up",
        "created_utc": 1608008633,
        "id": "gfw5qhp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1608037433.0
    },
    {
        "author": "shesaskinnylegend",
        "body": "I have no idea what Norton Gambit is. *ashamed* I’m allowed to buy US ETF in my CAD account yes. It just appears in my CAD TFSA in CAD.",
        "created_utc": 1607541370,
        "id": "gf74hy0",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1607570170.0
    },
    {
        "author": "Akemi_Tachibana",
        "body": "EURN, FRO, ELP, WOR, KEN, GGAL, BAM, and NLOK all pass those requirements but the first 4 are the ones you should really look at. But it isn't. Strategy I'd rely on since it has an annualized return of 9% based off the top 8 results/year and 4 companies that fit your criteria at one point have been delisted (MRH, AWHHF and AOL).",
        "created_utc": 1607754870,
        "id": "gfhwfqc",
        "score": 1,
        "subreddit": "investing",
        "created": 1607783670.0
    },
    {
        "author": "PlayerLou",
        "body": "NortonLifeLock ($NLOK) \nProbably not in line for govt contacts or national security. More catered to small business and everyday people protecting their information online. \n\nA fairly recognizable and trusted name. Share price is reasonable but not likely to really jump exponentially either. \n\n I am holding; looking for buying opportunities.",
        "created_utc": 1608296107,
        "id": "gg8vvuj",
        "score": 1,
        "subreddit": "investing",
        "created": 1608324907.0
    },
    {
        "author": "No_Variety9194",
        "body": "NLOK",
        "created_utc": 1608301863,
        "id": "gg94nyp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1608330663.0
    },
    {
        "author": "GivenHimalayas",
        "body": "Just thought of it yesterday. So, we will see, bought into TSM $100 C exp 1/21/22, NXPI $155 C exp 1/21/22, TRMB $55 C exp 5/21/21, and JD $85 C exp 1/21/22 today. Going to ride them out and see. May cut at 20-30% loss for each",
        "created_utc": 1606841082,
        "id": "ge9ug1c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606869882.0
    }
]