[
    {
        "author": "WorriedBanker",
        "body": "SoftBank Nears $40 Billion Deal to Sell Arm Holdings to Nvidia\n\nUnion of Arm, Nvidia would create a powerhouse in the chip industry\n\n&amp;#x200B;\n\nSoftBank recently has been involved in a series of big asset sales after being under pressure to shore up its flagging stock price.\n\n&amp;#x200B;\n\nSoftBank Group Corp. 9984 1.03% is nearing a deal to sell British chip designer Arm Holdings to Nvidia Corp. NVDA -1.20% for more than $40 billion, according to people familiar with the matter, the latest in a series of big asset sales by the Japanese technology conglomerate.\n\n&amp;#x200B;\n\nThe cash-and-stock deal being discussed would value Arm in the low $40 billions, the people said. The terms under discussion would mark a big win for SoftBank, which bought Arm four years ago for $32 billion and had struggled to jump-start growth in the business.\n\n&amp;#x200B;\n\nArm and Nvidia have been in exclusive talks for several weeks and a deal could be sealed early next week, the people said — assuming it isn’t derailed at the last minute.\n\n&amp;#x200B;\n\nArm designs microprocessors that power most of the world’s smartphones. By joining forces with Nvidia, the combined company would be a powerhouse in the chip industry.\n\n&amp;#x200B;\n\nNvidia is a fast-growing industry player whose chips are used to run the intense calculations for graphics—and play a key role in videogaming, cloud-computing and other activities for which the coronavirus pandemic has stoked demand. That has sent its shares up more than 100% this year, making it the best-performing stock in the S&amp;P 500 index.\n\n&amp;#x200B;\n\nShould a deal come together, it would be one of the largest transactions so far this year and potentially the largest semiconductor deal ever. Though business disruptions stemming from the pandemic have dented global deal volume, consolidation has kept up pace in the semiconductor industry as chip makers seek scale and expand their product portfolios to support the increasing number of everyday items that are connected to the internet. Such linkage is commonly referred to as the Internet of Things. Another of the year’s biggest deals was the $22 billion purchase of Maxim Integrated Products Inc. MXIM -0.53% by fellow chip maker Analog Devices Inc.\n\n&amp;#x200B;\n\nA sale to Nvidia could prompt scrutiny from antitrust regulators and potentially pushback from Arm’s customers, which include major chip makers and electronics manufacturers such as Intel Corp., Samsung Electronics Co. and Apple Inc.\n\n&amp;#x200B;\n\nThe Wall Street Journal reported in July that SoftBank was exploring options for Arm including a full or partial sale or an IPO. Arm had said it planned to transfer two Internet of Things services units into new entities that would be owned and operated by SoftBank as part of a move to focus on its core semiconductor-Ip business. It later reversed course on that move, saying it would instead keep the operations in-house.\n\n&amp;#x200B;\n\nSoftBank, for its part, had been under pressure to shore up its flagging stock price and promised some $40 billion in asset disposals. Most or all of that is already under way or completed and its shares are up more than 20% this year. Among the sales: big chunks of its holdings in China’s Alibaba Group Holding Ltd. and T-Mobile US Inc. following the wireless provider’s merger with Sprint Corp.\n\n&amp;#x200B;\n\nSoftBank has also purchased options tied to around $50 billion worth of individual tech stocks this year. The sheer size of the bet has had an outsize effect on the overall stock market, driving prices higher, the Journal has reported.\n\n&amp;#x200B;\n\nAt SoftBank, Chief Executive Masayoshi Son has been working with a small team to negotiate the Arm deal including the chief executive of the chip company, Simon Segars, Chief Financial Officer Yoshimitsu Goto, as well as Rajeev Misra, CEO of the firm’s giant Vision Fund, and Akshay Naheta, another executive at the fund.",
        "created_utc": 1599933188,
        "id": "g4ycuuh",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1599961988.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "Employee77",
        "body": "Anyone know about Analog Devices? They were recommended on YouTube for 5G. I haven’t looked yet though.",
        "created_utc": 1601426304,
        "id": "g74gyrj",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1601455104.0
    },
    {
        "author": "iamgettingbuckets",
        "body": "yeah I mean obviously \"slave labor\" exists in China but over the past like 15 years theres been significantly more scrutiny on apparel manufacturers to have more ethics &amp; transparency in their supply chain... ive visited Chinese factories that produce huge volume for adi, Nike, reebok and others, its not \"slave labor\", though im sure the factory conditions wouldn't really fly here in the states",
        "created_utc": 1600813592,
        "id": "g69eewj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600842392.0
    },
    {
        "author": "the_river_nihil",
        "body": "So, regarding airlines: you’re right to think “this industry is distressed right now, I should buy it to earn on the recovery”, that is a logical thought. However, airlines are taking on an *insane* amount of debt to weather this storm. They’re straight up burning *tens of millions a day* to keep what travel is allowed available. Airlines are getting hit even harder than casinos right now, and that recovery will take a very, very long time.\n\nBut, if you step that logic back a couple steps into something more fundamental it avoids a lot of those issues. No, I’m not talking Boeing (that will be shorter but still extremely subdued), I’m talking about Amphenol. They’re an electronics manufacturer that makes aerospace-grade parts. The further you get away from consumer habits, the wider timeframe these profits and losses operate in, and (right now at least) the more attractive that makes an investment.\n\nPeople aren’t flying, companies aren’t going to be replacing planes any time soon either, but there’s foundational companies that are already up and running in anticipation of that. Because that’s *their* business cycle. Same goes for other industrial companies, like Air Products, or raw materials manufacturers on the DOW.\n\nDon’t play this recovery at the consumer level, whatever you do. Play it at the manufacturing level, and play it as diversely as you can.",
        "created_utc": 1599978908,
        "id": "g523syi",
        "score": 7,
        "subreddit": "investing",
        "created": 1600007708.0
    },
    {
        "author": "descride",
        "body": "Solid list. I have some GTII and APH (just bought APH today during the flush). I'd like to add a bit of CGC but in the $16-$17 CAD range",
        "created_utc": 1599261091,
        "id": "g424h6k",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599289891.0
    },
    {
        "author": "skinniks",
        "body": "Aph is still a non-entity for international medical cannabis revenue.  That will change at some point but I feel like I've been saying that forever.",
        "created_utc": 1599757091,
        "id": "g4pij6n",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599785891.0
    },
    {
        "author": "CannaVestments",
        "body": "It matters because CC pharma gross margins are in the low teens and barely ebidta-positive, while cannabis margins are closer to 50%. Their CC pharma business is generating close to zero profits for Aph",
        "created_utc": 1599675534,
        "id": "g4kj7vv",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599704334.0
    },
    {
        "author": "nitorra",
        "body": "I don't understand why ACB APH CRON etc  just don't downlist to the CSE and enter the US.\nIs their listing on mayor exchanges really worth more than entering the US?",
        "created_utc": 1599768734,
        "id": "g4qnv92",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599797534.0
    },
    {
        "author": "CannaVestments",
        "body": "Interesting. APH, ACB, Redecan seem to dominate a lot of the categories... Canopy notably absent from everything outside beverages",
        "created_utc": 1599147121,
        "id": "g3uww72",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599175921.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "CGC911",
        "body": "I have been trading weed stocks now since APH and CGC were a couple dollars a share and I made out like a bandit in 2017 long before the full recreational legalization. I am so thrilled to be back in the weed stock investment portfolio again in the run up to expected changes in the regulatory framework in the US. Honest my fellow traders, we are in for a very nice profit if we remain patient... I have been here before 5 years ago when CAD was on the up and its familiar ground. Looking fwd to the next 12 months in this space.",
        "created_utc": 1599608237,
        "id": "g4ht1y0",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599637037.0
    },
    {
        "author": "loneshark8801",
        "body": "When is ApH next earnings report?",
        "created_utc": 1599789742,
        "id": "g4s6aoa",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599818542.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the 11th of September\n\n\n\n## Upcoming events for Friday, September 11th\n\n - Stock splits:\n\n    - DXIEF @ **1:100**\n\n - Expected earnings:\n\n  ANIX, ATHE, ATNM, BRC, CNNB, EVI, FONR, FSEA, GMHI, GROW, GVA, IBIO, IRCP, JVA, KR, LFAC, MARPS, MSB, NFIN, NNVC, PKX, UTZ, VALU, VIRC, YIN\n\n - Ex-div:\n\n  AME, CCBG, CCD, CGO, CHI, CHW, CMCT, CPZ, CSQ, CWH, DVN, EDF, EDI, EOD, ESCA, FCNCA, GROW, JRVR, NFJ, NIE, PTR, RRBI, SPR, UNH\n\n - Economic events and announcements:\n\n    - CPI (consensus: 0.3%, previous: 0.6%)\n    - CPI (consensus: 1.2%, previous: 1.0%)\n    - CPI Index, n.s.a. (consensus: 259.52, previous: 259.10)\n    - CPI Index, s.a (previous: 258.72)\n    - CPI, n.s.a (previous: 0.51%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.6%)\n    - Core CPI (consensus: 1.6%, previous: 1.6%)\n    - Core CPI Index (previous: 267.72)\n    - Federal Budget Balance (consensus: -245.0B, previous: -63.0B)\n    - Real Earnings (previous: -0.6%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 181)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - WASDE Report\n\n## Upcoming events for Monday, September 14th\n\n - Stock splits:\n\n    - HGEN @ **1:5**\n\n - Expected earnings:\n\n  ADXS, AGX, AMBO, ASPU, CBAT, EBR, EBR.B, GRAF, GSUM, HCAC, HJLI, HPK, ICMB, IRS, JT, KALV, LEN, LEN.B, MIND, MVC, PLAG, RUHN, SAMA, SINA, THCA, THCB, TMBR, VNCE, WB\n\n - Ex-div:\n\n  AMH, APH, APTS, ARCC, ARR, ATRI, AVK, BAF, BANC, BBF, BBK, BBN, BBY, BCE, BCX, BDJ, BFK, BFO, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BKK, BLE, BLW, BME, BMEZ, BNY, BOE, BQH, BSD, BSE, BST, BSTZ, BTA, BTT, BTZ, BUI, BXMX, BXS, BYM, BZM, CBU, CCI, CFFI, CII, CMA, COFS, CPG, CPK, CSGS, CSWC, CTBI, DIAX, DPG, DPZ, ECL, EFSC, EGF, EMN, EVC, EXR, FCAP, FCRD, FFG, FRA, FRG, GATX, GBAB, GBL, GGM, GILD, GIM, GOF, GPK, GRMN, HES, HLNE, HRTG, HUN, HWBK, HYT, IHIT, IRM, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JSD, JTA, JTD, KAMN, KBR, KNL, KO, LDOS, LEG, LEO, MAXR, MBIN, MCA, MCY, MEN, MHD, MMD, MO, MRK, MSI, MTEX, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NEA, NEU, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NPN, NREF, NRK, NSA, NSL, NTST, NUV, NUW, NVG, NWE, NXJ, NXPI, NXR, NXRT, NYV, NZF, OCCI, OCSI, OCSL, OMI, OVV, OXY, PB, PCH, PFBI, PINE, PKG, PSA, PSB, QQQX, RICK, RNR, RPRX, SAH, SBR, SCI, SCM, SELF, SFNC, SJR, SMMF, SPXX, SRV, SSP, STC, SZC, TECK, TEI, TMO, TROW, TSLX, UCBI, UGI, VBF, VLY, VRSK, VTA, VVR, WH, WOR, WRB, WWE, XEL, XFLT, XIN\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.115%)\n    - 6-Month Bill Auction (previous: 0.105%)\n    - Investing.com Gold Index (previous: 56.3%)\n    - Investing.com S&amp;P 500 Index (previous: 34.5%)\n    - OPEC Monthly Report\n    - Treasury Department Report\n\n^^^^2020-09-11",
        "created_utc": 1599818416,
        "id": "g4t5uwj",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599847216.0
    },
    {
        "author": "Romanian_",
        "body": "Honeywell \n\nRockwell Automation\n\nOmron\n\nTexas Instruments  \n\nAmphenol",
        "created_utc": 1599702195,
        "id": "g4m0aw3",
        "score": 1,
        "subreddit": "investing",
        "created": 1599730995.0
    },
    {
        "author": "ankuo",
        "body": "I’ve been completely busy with work today, anyone have idea why APH tanked today(I’m long this stock, just curious why this happened ?)",
        "created_utc": 1600808904,
        "id": "g695i79",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1600837704.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 14th of September\n\n\n\n## Upcoming events for Monday, September 14th\n\n - Stock splits:\n\n    - HGEN @ **1:5**\n    - EQTXF @ **1:10**\n\n - Expected earnings:\n\n  ADXS, AGX, AMBO, ASPU, CBAT, EBR, EBR.B, GRAF, GSUM, HCAC, HJLI, HPK, ICMB, IRS, JT, KALV, LEN, LEN.B, MIND, MVC, PLAG, RUHN, SAMA, SINA, THCA, THCB, TMBR, VNCE, WB\n\n - Ex-div:\n\n  AMH, APH, APTS, ARCC, ARR, ATRI, AVK, BAF, BANC, BBF, BBK, BBN, BBY, BCE, BCX, BDJ, BFK, BFO, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BKK, BLE, BLW, BME, BMEZ, BNY, BOE, BQH, BSD, BSE, BST, BSTZ, BTA, BTT, BTZ, BUI, BXMX, BXS, BYM, BZM, CBU, CCI, CFFI, CII, CMA, COFS, CPG, CPK, CSGS, CSWC, CTBI, DIAX, DPG, DPZ, ECL, EFSC, EGF, EMN, EVC, EXR, FCAP, FCRD, FFG, FRA, FRG, GATX, GBAB, GBL, GGM, GILD, GIM, GOF, GPK, GRMN, HES, HLNE, HRTG, HUN, HWBK, HYT, IHIT, IRM, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JSD, JTA, JTD, KAMN, KBR, KNL, KO, LDOS, LEG, LEO, MAXR, MBIN, MCA, MCY, MEN, MHD, MMD, MO, MRK, MSI, MTEX, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NEA, NEU, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NPN, NREF, NRK, NSA, NSL, NTST, NUV, NUW, NVG, NWE, NXJ, NXPI, NXR, NXRT, NYV, NZF, OCCI, OCSI, OCSL, OMI, OVV, OXY, PB, PCH, PFBI, PINE, PKG, PSA, PSB, QQQX, RICK, RNR, RPRX, SAH, SBR, SCI, SCM, SELF, SFNC, SJR, SMMF, SPXX, SRV, SSP, STC, SZC, TECK, TEI, TMO, TROW, TSLX, UCBI, UGI, VBF, VLY, VRSK, VTA, VVR, WH, WOR, WRB, WWE, XEL, XFLT, XIN\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.115%)\n    - 6-Month Bill Auction (previous: 0.105%)\n    - Investing.com Gold Index (actual: 55.1%, previous: 56.3%)\n    - Investing.com S&amp;P 500 Index (actual: 53.7%, previous: 34.5%)\n    - OPEC Monthly Report\n    - Treasury Department Report\n\n## Upcoming events for Tuesday, September 15th\n\n - Stock splits:\n\n    - TREX @ **2:1** (Payable date: 09/14/2020)\n\n - Expected earnings:\n\n  ADBE, ANAT, APEX, ASFI, AZRX, BWL.A, CBRL, CIG, CLIR, CVV, DTEA, FDX, FRAN, GEC, HMY, IDXG, KBSF, METX, MFAC, SCPE, TC, TEUM, UTSI\n\n - Ex-div:\n\n  AGI, AGM, ALLE, ARES, CEN, CINF, CIZN, CXE, CXH, DYFN, ESSA, FFIN, FINS, FNF, FOF, FSFG, FSK, FSKR, GAB, GDL, GDV, GES, GGZ, GNT, GRX, GUT, GWRS, HI, HMN, ICE, IVH, LDP, MAV, MCN, MCR, MEOH, MHI, MIE, MIN, MMT, MRCC, MRTN, NMFC, NWS, NWSA, NX, OLED, OPP, OXLC, OXSQ, PGZ, PHD, PHT, PSF, RA, RFM, RIV, RMI, RMM, RNP, RNST, RQI, RSF, RYN, TCPC, TDS, TY, UHT, UTF, VST, WGO, WU\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.185%)\n    - API Weekly Crude Oil Stock (previous: 2.970M)\n    - Capacity Utilization Rate (consensus: 71.5%, previous: 70.6%)\n    - Export Price Index (consensus: 0.4%, previous: 0.8%)\n    - Export Price Index (previous: -4.4%)\n    - IEA Monthly Report\n    - Import Price Index (consensus: 0.5%, previous: 0.7%)\n    - Import Price Index (previous: -3.3%)\n    - Industrial Production (consensus: 1.0%, previous: 3.0%)\n    - Industrial Production (previous: -8.18%)\n    - Manufacturing Production (consensus: 0.8%, previous: 3.4%)\n    - NY Empire State Manufacturing Index (consensus: 5.95, previous: 3.70)\n    - Redbook (previous: -0.1%)\n    - Redbook (previous: -1.0%)\n\n## Upcoming events for Wednesday, September 16th\n\n - Stock splits:\n\n    - AROW @ **103:100** (Payable date: 09/25/2020)\n    - TGLVY @ **3:1** (Payable date: 09/15/2020)\n\n - Expected earnings:\n\n  HX, MLHR, OSH, SANW, WEI\n\n - Ex-div:\n\n  AAN, AFT, AIF, AIG, ARD, CHMG, DBL, DLY, DSL, EBSB, ES, GEF, GEF.B, HBAN, HRZN, PFLT, PLD, PNNT, SFL, SLRC, SNV, STFC, SWBI, VGR\n\n - Economic events and announcements:\n\n    - Business Inventories (consensus: 0.2%, previous: -1.1%)\n    - Core Retail Sales (consensus: 0.9%, previous: 1.9%)\n    - Crude Oil Imports (previous: 0.581M)\n    - Crude Oil Inventories (previous: 2.032M)\n    - Cushing Crude Oil Inventories (previous: 1.838M)\n    - Distillate Fuel Production (previous: -0.381M)\n    - EIA Refinery Crude Runs  (previous: -1.089M)\n    - EIA Weekly Distillates Stocks (previous: -1.675M)\n    - EIA Weekly Refinery Utilization Rates (previous: -4.9%)\n    - FOMC Economic Projections\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (previous: -2.954M)\n    - Gasoline Production (previous: -0.604M)\n    - Heating Oil Stockpiles (previous: -0.551M)\n    - Interest Rate Projection - 1st Yr (previous: 0.10)\n    - Interest Rate Projection - 2nd Yr (previous: 0.1)\n    - Interest Rate Projection - 3rd Yr (previous: 2.1)\n    - Interest Rate Projection - Current (previous: 0.1)\n    - Interest Rate Projection - Longer (previous: 2.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.07%)\n    - MBA Mortgage Applications (previous: 2.9%)\n    - MBA Purchase Index (previous: 317.7)\n    - Mortgage Market Index (previous: 776.7)\n    - Mortgage Refinance Index (previous: 3,415.1)\n    - NAHB Housing Market Index (consensus: 78, previous: 78)\n    - Overall Net Capital Flow (previous: -67.90B)\n    - Retail Control (consensus: 0.5%, previous: 1.4%)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Retail Sales (consensus: 1.0%, previous: 1.2%)\n    - Retail Sales (previous: 2.74%)\n    - Retail Sales Ex Gas/Autos (previous: 1.5%)\n    - Seevol Cushing Storage Report (previous: 0.391M)\n    - TIC Net Long-Term Transactions (previous: 113.0B)\n    - TIC Net Long-Term Transactions including Swaps (previous: 70.60B)\n    - US Foreign Buying, T-bonds (previous: 28.90B)\n\n## Upcoming events for Thursday, September 17th\n\n - Expected earnings:\n\n  AFIB, APOG, CMD, INTG, SCHL\n\n - Ex-div:\n\n  AAP, ADT, AIMC, ALB, ALRS, AVNT, BDC, CB, CNQ, CUBA, DEX, DMB, FBSS, FLS, HOFT, HPP, HRC, MGU, PLOW, QCRH, QSR, QTS, RBCAA, SBSW, TG, THQ, THW, TPB, TSM, UNIT, VCIF, VRS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.105%)\n    - Building Permits (consensus: 1.510M, previous: 1.483M)\n    - Building Permits (previous: 17.9%)\n    - Continuing Jobless Claims (consensus: 12,925K, previous: 13,385K)\n    - Housing Starts (consensus: 1.470M, previous: 1.496M)\n    - Housing Starts (previous: 22.6%)\n    - Initial Jobless Claims (consensus: 850K, previous: 884K)\n    - Jobless Claims 4-Week Avg. (previous: 970.75K)\n    - Natural Gas Storage (consensus: 68B, previous: 70B)\n    - Philadelphia Fed Manufacturing Index (consensus: 15.5, previous: 17.2)\n    - Philly Fed Business Conditions (previous: 38.8)\n    - Philly Fed CAPEX Index (previous: 23.00)\n    - Philly Fed Employment (previous: 9.0)\n    - Philly Fed New Orders (previous: 19.0)\n    - Philly Fed Prices Paid (previous: 15.30)\n\n^^^^2020-09-14",
        "created_utc": 1600077614,
        "id": "g57tb3w",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1600106414.0
    },
    {
        "author": "prplput",
        "body": "I'm a TSLA bear but everyone saying S&amp;P is now impossible for this quarter just look at last September's index news.\n\nThere were 4 separate days with announcements of additions to the S&amp;P 500.\n\nLVS announced 9/26, PCRX on 9/24, NVR on 9/20, and CDW on 9/17\n\nDunno why everyone thinks it's a done deal. They've also said they can add components at any time...doesn't have to be on a scheduled rebalancing day.",
        "created_utc": 1599530106,
        "id": "g4egjgv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599558906.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "stopdropandrauljulia",
        "body": "aal has been spiking in the mornings and dipping in the afternoons for a bit, so I've been buying short term otm ($13 or 15.50) calls in the afternoon and setting a 2x sell order that usually executes without fail the next morning. Every other play I've made has been pretty fucking stupid, though I made a little money flipping shares of dphc.\n\nAll cash right now, no idea what I'm doing on tuesday, though I have been looking at 10/16 cdw 120 calls.\n\nI still don't really know what I'm doing so I wouldn't take any advice from me.",
        "created_utc": 1599433023,
        "id": "g4a0ag1",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1599461823.0
    },
    {
        "author": "throwaway21342134213",
        "body": "Advice to all of you young TSLA/AAPL/CRM/NVDA millionaires thinking of spending those sweet tendies:\n\nRemember if it floats, flies or fucks — it’s a lot cheaper to rent than to buy.",
        "created_utc": 1599082379,
        "id": "g3ru6a8",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1599111179.0
    },
    {
        "author": "Trisstanroberts",
        "body": "zoom and crm been killing both Q1&amp;Q2 earnings and mooning since covid lockdown and zoom contracts were cheap about 500 bucks the morning of ER to take the chance again.\n\nTesla i was hedging since the split announcement, figured it would follow apples footsteps in percentage gains but surpassed it with retarded strength. Could have made alot more on tesla pre-split rise but constantly paper handed it.\n\nso you could say i made these on a hunch from reoccuring events lol",
        "created_utc": 1599246132,
        "id": "g40xmol",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1599274932.0
    },
    {
        "author": "curiouscat887",
        "body": "Basically my strategy is to look at the earning calls for the week, on the day the companies earnings are announced I usually search for that ticker and see if there are any alerts.\n\nSomething with high volume and low IO that’s quite far out with a short expiry looks like a bet to me so I look into the company a bit more and then follow the bet. \n\nI know it’s not rock solid but these are gambles after all.\n\nMost have made something like 20-30% within a few hours later. \n\nI missed the CRM one even tho I was going to do it, kicking myself for that, but with the ZM one I thought why not as it was 1.35 a contract.\n\nJust wish I put 10k into it as I’d have 400k now and could retire on theta haha but hindsight is 20/20",
        "created_utc": 1598986064,
        "id": "g3midoy",
        "score": 14,
        "subreddit": "options",
        "created": 1599014864.0
    },
    {
        "author": "clmohn",
        "body": "I lost 40k today on tesla... I was all puts and call credit spreads expecting an offering on Monday after the close... then offering hit Tuesday morning, super pumped, went down 5% and I flipped long at 475 before the close... well that didn't go so well.  I am currently long going into tomorrow.  I think we will have a rebound.  It seemed VERY strange to me that every damn ticker was green today except tesla, apple, zoom, and salesforce.... that's some hard rotation and seems fishy to me.",
        "created_utc": 1599089131,
        "id": "g3s8mpa",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599117931.0
    },
    {
        "author": "BigBoyDiapy",
        "body": "Salesforce and Apple do be fuckin me today. Good thing RKT earnings are gonna launch it to $150 🚀🚀🚀",
        "created_utc": 1599070193,
        "id": "g3qxvnb",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599098993.0
    },
    {
        "author": "MLGameOver",
        "body": "I’ll put this corn I bought today up my ass if RKT pulls a CRM",
        "created_utc": 1599071706,
        "id": "g3r1pdn",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599100506.0
    },
    {
        "author": "umblueberry",
        "body": "if tesla announced an s&amp;p inclusion i think they would jump like crm with dow announcement. hoping musk leaks something today about it",
        "created_utc": 1599065191,
        "id": "g3qkxhn",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599093991.0
    },
    {
        "author": "nebuloushazybull",
        "body": "For all you asking: “Wait, how tf did [insert CRWD, RKT, CLDR, etc] tank &amp; ZM 🚀 to fucking 40%?”\n\nAnd being like: “Fuck this market, this is rigged, it can’t be like that, etc.” \n\nQuit your bitching and process one thing and process it well. Read it 10-1000 times if you have to.\n\nWe’re in a fucking pandemic. Only the top dogs/upcoming and unfortunately overvalued as fuck monsters like ZM &amp; CRM are gonna dominate and destroy agenda-related items like quarterly earnings. Their leaders and engineers don’t give a shit about how much their shares have gone up this past month or year. Even if they do; they care much more about making their products or services the only and most attractive offering in their domain.\n\nStop latching on to what you heard or what you think you may know of a company. If it’s not the top of its game or the leader in what it’s doing, even if new or old, assess against the current situation and play accordingly.\n\nYes ZM &amp; CRM may not deserve the followed surges but hey, is anyone gonna need any less of either of these 2, especially during these times? Prolly not.\n\nCheers.",
        "created_utc": 1599082192,
        "id": "g3rtqf6",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599110992.0
    },
    {
        "author": "SnooRobots6193",
        "body": "Just looking at some of the biggest top performers this year:\n\n* AMZN PE Sept 2016: 192 (now 127)\n* FB PE Sept 2016: 57 (now 34)\n* CRM PE Sept 2016: 240 (now 99)\n* NFLX PE Sept 2016: 310 (now 87)\n* ABMD PE Sept 2016: 130 (now 80)\n* DPZ PE Sept 2016: 41 (now 34; not a tech giant, but I bring it up cause it's among the most overlooked top performer of 2010s IMO).\n\nAnd I didn't choose to compare with 2016 because it was some peak. The market climbed pretty much the entirety of 2017.\n\nObviously this list was handpicked and there are plenty of counterexamples, but the point is that growth companies have had growth priced in (and delivered on it) for many years.",
        "created_utc": 1599259923,
        "id": "g421ill",
        "score": 8,
        "subreddit": "stocks",
        "created": 1599288723.0
    },
    {
        "author": "curiouscat887",
        "body": "So I got lucky! But only because I missed CRM last week, I got an alert for unusual volume from an app I use ( I have no affiliation) and passed on it and it would have bagged me 20k so I have severe regret, I also missed out on 28k by selling my Tesla call for $500 profit and 3 days later it was worth $28k. \n\nI didn’t wanna miss out again this time so when I got another alert for this and one for tsla, I chose this as it was cheaper and luckily won, wish I put more money in it haha but can’t be greedy! \n\nThe Tsla one also did well too.",
        "created_utc": 1598981012,
        "id": "g3m4cnu",
        "score": 8,
        "subreddit": "options",
        "created": 1599009812.0
    },
    {
        "author": "targetfan76",
        "body": "Rare targetfan76 post about potential good stock for tomorrow earnings, doubt anyone cares.\n\n$Zuo fairly small cloud billing server company (just like $CRM). $Crm crushed earnings and zuo went up 10% that day last week. Zoom had insane revenue and their billing is provided by $Zuo.  $crm crushing earnings + $zm crushing earnings = $zuo crushing earnings is my theory.\n\nZuo earnings tomorrow after market close and stock up 13% today and 5% after hours so might be too late to buy calls, maybe long dated calls out. If you want to buy in I think buying stock almost 100% makes you some money..",
        "created_utc": 1599012034,
        "id": "g3o6oqj",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599040834.0
    },
    {
        "author": "honest_j",
        "body": "Thank you degenerates! I finally had seen enough gain porn and dropped $2k into a Robin Hood account last Tuesday. I’m now up ~450% and into 5 figures more than half in cash.  First move was CRM, then hit NVDA, and a bunch of successful SPY calls. Gonna play SPY monthlys until election. AGAIN A PROFOUND THANK YOU TO THE RETARDS!",
        "created_utc": 1599110460,
        "id": "g3tahbd",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599139260.0
    },
    {
        "author": "ar1195",
        "body": "I think docu is gonna have to dump on earnings even if it beats honestly. Look how much it’s run into it. Crm had a modest run up, zm had a decent run up but only on the day of. Docu is having a huge move 3 days before. \n\n*still gonna hold thru earnings though*",
        "created_utc": 1598984815,
        "id": "g3mev3s",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599013615.0
    },
    {
        "author": "jammyarab",
        "body": "GG guys. Hindsight is 20/20. If it had pulled a zoom or crm these same guys would be saying how its soo obvious they would crush earnings lol.",
        "created_utc": 1599079784,
        "id": "g3rnqpb",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599108584.0
    },
    {
        "author": "KenSpliffeyJr",
        "body": "after sitting out on ZM and CRM no way I'm gonna avoid spending an inadvisable amount on RKT calls for a third time",
        "created_utc": 1599071961,
        "id": "g3r2cvl",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599100761.0
    },
    {
        "author": "eyerollingsex",
        "body": "I blame this all on ZM and CRM. They pumped the market too hard too fast. A slower uptrend would have held up better. This whole market reminds me of the 2017 cryp-to crash. The Robinhood options trader is pretty much the same type of person the cryp-to noobs were. They think they’re bullet proof, masters of the market and in the end the boomers are right about it being a bubble",
        "created_utc": 1599168896,
        "id": "g3wo6mr",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599197696.0
    },
    {
        "author": "HEAT631",
        "body": "RKT and CRWD let’s goooo make me forget about missing out on ZM and CRM",
        "created_utc": 1599034300,
        "id": "g3p1wtf",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599063100.0
    },
    {
        "author": "I_love_boobs86",
        "body": "Flashbacks of BBY, PRPL, BC.  Even the ones I sold before close today like CRWD tanked.  Meanwhile garbage like ups, crm, dis, zm go up 45%",
        "created_utc": 1599086821,
        "id": "g3s3ip0",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599115621.0
    },
    {
        "author": "manwhoreproblems",
        "body": "Zoom, crm, apple, and Tesla. Contrary to popular belief market cap matters.",
        "created_utc": 1599180226,
        "id": "g3xi4uf",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599209026.0
    },
    {
        "author": "infinitelimits00",
        "body": "The main thing is a lot of index/benchmark funds have to buy. Hence the up move on ETSY AH. See the same thing when CRM was added to DOW.",
        "created_utc": 1599273219,
        "id": "g42p58u",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599302019.0
    },
    {
        "author": "somanychins",
        "body": "At some point it’s going to register that AAPL market cap swung down $135B intraday. That’s not like “oh shucks.” If there’s that kind of uncertainty in the value of one of the most well characterized and followed stonks on earth, what could happen to CRM? ADBE? PTON? Anything with a multiple over 30.... \n\nYou should be afraid",
        "created_utc": 1599112421,
        "id": "g3tcw7u",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599141221.0
    },
    {
        "author": "SwaggetyAndy",
        "body": "Goddammit now I've gotten fucked twice by earnings that I thought were gonna shoot up after the call. That CRM craziness last week got me greedy. I'm NEVER holding through earnings again, regardless of how well I think the company will do.",
        "created_utc": 1599080389,
        "id": "g3rpe2q",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599109189.0
    },
    {
        "author": "FiaRua_",
        "body": "one of my best days today:\n\nAVGO 400c 9/18 1.75-8.0 (bought yesterday at open)\n\nTesla 415p 9/4 4.3-14.2 (bought today before during the dump)\n\nSPY 354c 9/2 .7-4.3 (bought mid-day sold a little before close)\n\nMSFT 9/11 230c scalped a few times for decent gains. \n\nstill holding CRM 285c 9/11, TWTR 50c 10/16, INTC (lol) 52.5c 9/11",
        "created_utc": 1599087234,
        "id": "g3s4f5x",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599116034.0
    },
    {
        "author": "throwAwayMyCsDegree",
        "body": "CRM not bullshit lmao",
        "created_utc": 1599077870,
        "id": "g3rik5k",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599106670.0
    },
    {
        "author": "TappyDev",
        "body": "Exactly. I already hit on crm and aapl.  No complaints.  Never be afraid to take profits!",
        "created_utc": 1599012351,
        "id": "g3o79f2",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599041151.0
    },
    {
        "author": "hashtagzee",
        "body": "I’m sure this happened, some way OTM CRM calls returned 133x the next day after earnings. Same with ZM (80-90x returns). \n\nPotentially 16k -&gt; 1.7m in one month, lol",
        "created_utc": 1599015963,
        "id": "g3odoan",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599044763.0
    },
    {
        "author": "toomuchtodotoday",
        "body": "&gt; Just a gut feeling but I think there going to be a decent amount of white collar layoffs coming. \n\nOh yeah.\n\n[Ford: 1400 jobs](https://www.nytimes.com/reuters/2020/09/02/business/02reuters-fordmotor-layoffs.html)\n\n[Salesforce: 1000 jobs](https://finance.yahoo.com/news/salesforce-streamlines-business-1-000-123323820.html)\n\n[LinkedIn: 1000 jobs](https://www.washingtonpost.com/business/2020/07/22/linkedin-microsoft-msft-job-cuts/)\n\n[Coca-Cola: 4000 jobs](https://www.masslive.com/news/2020/08/coca-cola-to-offer-buyouts-to-4000-workers-in-the-us-and-canada.html)",
        "created_utc": 1599060901,
        "id": "g3qa23l",
        "score": 4,
        "subreddit": "investing",
        "created": 1599089701.0
    },
    {
        "author": "thegoldstandard55",
        "body": "Ultimately Tim Apple 🍎 started this chain reaction of toxic greed that led to Elon following with a split of his own then Salesforce getting added to the Dow and finally that bizarre reaction to Zoom which caused the final fomo chase.  The market was somewhat healthy until that stupid Apple split rally.",
        "created_utc": 1599177673,
        "id": "g3xcwfj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599206473.0
    },
    {
        "author": "Turdboimaloy",
        "body": "&gt;was all puts and call credit spreads expecting an offering on Monday after the close... then offering hit Tuesday morning, super pumped, went down 5% and I flipped long at 475 before the close... well that didn't go so well.  I am currently long going into tomorrow.  I think we will have a rebound.  It seemed VERY strange to me that every damn ticker was green today except tesla, apple, zoom, and salesforce.... that's some hard rotation and seems fishy to me.\n\nhard rotation fishy? yea, weird that dudes would want to take prophet on Tesla after it runs from 1400 to 2500",
        "created_utc": 1599090324,
        "id": "g3sbebx",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599119124.0
    },
    {
        "author": "hoobaacheche",
        "body": "DD: Inorder to pump DOW Jones, CRM needs to be pumped! Trade accordingly",
        "created_utc": 1599015834,
        "id": "g3odg9k",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599044634.0
    },
    {
        "author": "HGTV-Addict",
        "body": "Honestly in this market who the fucks knows. CRM and Zoom were both up massively before earnings, still exploded. I'd take hitting $400 before earnings and then a 10% pop and be happy. \n\nIt only has to move 6% from today for a $400 strike to be profitable over earnings. That does not seem like a lot to me.",
        "created_utc": 1598980377,
        "id": "g3m2mcd",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599009177.0
    },
    {
        "author": "jonny2shoez",
        "body": "CRM, DOCU, ADBE, WORK, CRWD, CHWY, WDAY, SQ, TSLA, RKT\n\nLet’s fucking gooooo",
        "created_utc": 1598982323,
        "id": "g3m7zzp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599011123.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "ZM pulling a CRM. 10 baggers incoming. 5-6 baggers for ITM options",
        "created_utc": 1598949244,
        "id": "g3kfby9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598978044.0
    },
    {
        "author": "I_had_corn",
        "body": "Jumped into the CRM spike, collected $3.7k in just 15 minutes",
        "created_utc": 1599018079,
        "id": "g3oh6xu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599046879.0
    },
    {
        "author": "AnonZeit",
        "body": "Same quarter profit as crm a 300b company",
        "created_utc": 1598994590,
        "id": "g3n58o5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599023390.0
    },
    {
        "author": "myredditaccounty",
        "body": "Bag holding $232C 9/18 through ER after getting $CRM &amp; $ZM gain",
        "created_utc": 1599025526,
        "id": "g3orhrg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599054326.0
    },
    {
        "author": "Kramnet",
        "body": "Why crm doing that",
        "created_utc": 1598982244,
        "id": "g3m7sbo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599011044.0
    },
    {
        "author": "dukeisanasshole",
        "body": "Experience tells me sell. But Zoom and CRM tell me hold. I have 4 calls so I will likely keep 1 to Yolo with",
        "created_utc": 1598972212,
        "id": "g3lg2dq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599001012.0
    },
    {
        "author": "yoshizzles",
        "body": "ok never holding through ER again. only bullshit companies like ZM and CRM can win apparently.",
        "created_utc": 1599077836,
        "id": "g3rigum",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599106636.0
    },
    {
        "author": "RandyCrane17",
        "body": "I'm glad this day finally came so i can go in and buy calls now without worry. I've been afraid of this for weeks but Tech earnings had been sending the market higher and higher. Started with Apple, then CRM then Zoom.",
        "created_utc": 1599157576,
        "id": "g3vr4ag",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599186376.0
    },
    {
        "author": "Orzorn",
        "body": "This earnings season has been such ass. Big massive beats jumps from ZM and CRM got everyone's hopes up and then everything else was ass.",
        "created_utc": 1599164461,
        "id": "g3wbl5z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599193261.0
    },
    {
        "author": "nanaboostme",
        "body": "crm wtf",
        "created_utc": 1598982329,
        "id": "g3m80m3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599011129.0
    },
    {
        "author": "Myusernamegoesup",
        "body": "CRM going to check if plutos a planet 🚀",
        "created_utc": 1598982059,
        "id": "g3m79y9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599010859.0
    },
    {
        "author": "redblade79",
        "body": "Agreed. I think we are gonna see a CRM/ZM type of movement. This shit will fucking levitate.",
        "created_utc": 1598975396,
        "id": "g3lop1g",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599004196.0
    },
    {
        "author": "bufferoverflo",
        "body": "Lol wtf held CRM for ~3 years and sold before all  these big rallies.",
        "created_utc": 1598982121,
        "id": "g3m7g2w",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599010921.0
    },
    {
        "author": "captainstrange94",
        "body": "After seeing CRM and ZM moon, which company do you think might pop similarly? I'm thinking DOCU and maybe CRWD",
        "created_utc": 1598960719,
        "id": "g3kqiw9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598989519.0
    },
    {
        "author": "whatulteriormotives",
        "body": "\"People are at home\" lmao - all the at-home stocks shot up today off of ZOOM (similar to how CRM brought up all the enterprise software)",
        "created_utc": 1598992058,
        "id": "g3mykb1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599020858.0
    },
    {
        "author": "MLGameOver",
        "body": "I’d be so rich\n\nI’ll put the corn I bought today up my ass for a RKT 50% day like CRM",
        "created_utc": 1599071009,
        "id": "g3qzxgx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599099809.0
    },
    {
        "author": "yaboiRich",
        "body": "We all hoping its the next ZM or CRM\n\nRKT to the moon",
        "created_utc": 1599071803,
        "id": "g3r1yav",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599100603.0
    },
    {
        "author": "FerrariFan1977",
        "body": "Sometimes you just need the smart and or lucky play. On CRM or ZM for example a $200 option would have got you $10K if you played the right strike",
        "created_utc": 1599019143,
        "id": "g3oiufg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599047943.0
    },
    {
        "author": "crimsonchin24",
        "body": "CRM about to rocket just broke out of consolidation after big earnings gap",
        "created_utc": 1598983545,
        "id": "g3mbalz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599012345.0
    },
    {
        "author": "infinitelimits00",
        "body": "So this is the theoretical explanation. Basically the IV increased so much to overwhelm any loss of delta, which is quite a big move in itself. So essentially a ton of people bought a ton of upside calls today could account for this massive IV increase. \n\nHowever, from a trading perspective this seems super exploitable. Essentially here's what it's implying. \n\nIt's saying Yesterday there was an X % chance for Tesla to be &gt; 800 (or pick any other upside strike) by September 18. Now Today, despite Tesla going down 4-5% at this current point, there is still an X % chance or even &gt; X% chance for Tesla to be &gt; 800 by September 18. That's insane!\n\nDespite 1 day passing by and a 4-5% drop in stock, the probability, according to MM, didn't change or even increased at certain points in the day! And it's not like there's that many days until September 18 anyways.\n\nI feel like this isn't a supply/demand issue. I think actually it's possible this market got broken due to outsized, black swan moves from stocks like CRM, ZM and DOCU who didn't even have an earnings yet that MM are so pressed to selling vol they jacked up everything arbitrarily across all names, which includes Tesla and CRM but should include others, which I haven't delved into.",
        "created_utc": 1598985384,
        "id": "g3mggi9",
        "score": 2,
        "subreddit": "options",
        "created": 1599014184.0
    },
    {
        "author": "samsong",
        "body": "Tell that to the guy who bought CRM call at open and then sold same day for something like 60k profit.",
        "created_utc": 1598986433,
        "id": "g3mjfkq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599015233.0
    },
    {
        "author": "PM_ME_PIERCED_NIPSS",
        "body": "i mean, when people take all of their fake zoom and docusign profits where the fuck do you think they are going to put them?? CRM, AutoZone, Chewy?? fuck off. going straight into Apple and Tesla. \n\nCalls all day",
        "created_utc": 1598989687,
        "id": "g3mrzlu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599018487.0
    },
    {
        "author": "infinitelimits00",
        "body": "I don't think there would be many links talking about this but ZeroHedge did mention the call skew effect in tech in a recent article. I know it's ZeroHedge and they are permabears, but the data seems accurate. Essentially MM are so short calls right now that calls in some names cost 4x as much as puts the same strike away from spot. So a move like CRM or ZM to the upside makes the move like 5x larger. \n\nhttps://www.zerohedge.com/markets/apples-market-cap-surpasses-entire-russell-2000-due-option-insanity",
        "created_utc": 1599015774,
        "id": "g3odcnk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599044574.0
    },
    {
        "author": "Matrix1216",
        "body": "Savage last week with the CRM! Had to peep the profile 👀",
        "created_utc": 1599003562,
        "id": "g3noknm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599032362.0
    },
    {
        "author": "JW4974",
        "body": "Last time I listened to these retards, I sold right before CRM earnings",
        "created_utc": 1599023446,
        "id": "g3oox43",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599052246.0
    },
    {
        "author": "mr-saxobeat",
        "body": "After CRM, ZM and now WORK, what is the next play",
        "created_utc": 1599027392,
        "id": "g3otmkf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599056192.0
    },
    {
        "author": "ar1195",
        "body": "If we can hold this, it’ll already qualify for my all time highest P/L (at least at open) day maybe not cause I made a fuck ton off crm",
        "created_utc": 1598950576,
        "id": "g3kginu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598979376.0
    },
    {
        "author": "gmcarve",
        "body": "CRM 9/18 300",
        "created_utc": 1598981433,
        "id": "g3m5kx0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599010233.0
    },
    {
        "author": "elijaali",
        "body": "After watching CRM, TSLA, ZM .... holding",
        "created_utc": 1598960477,
        "id": "g3kq5w3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598989277.0
    },
    {
        "author": "python_js",
        "body": "CRM pumped after open. So idk",
        "created_utc": 1598962383,
        "id": "g3ktd9t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598991183.0
    },
    {
        "author": "touchhimwiththejab",
        "body": "The same can be said for ZM CRM\n\nLook how they turned out",
        "created_utc": 1598957296,
        "id": "g3kmpd6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598986096.0
    },
    {
        "author": "LeBronomatopoeia",
        "body": "I did lol.  I sold before ER with CRM and missed out, so I figured id go down with the ship if ZM tanked",
        "created_utc": 1598969885,
        "id": "g3l9yn4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598998685.0
    },
    {
        "author": "touchhimwiththejab",
        "body": "Very likely \n\nAkin to CRM ZM",
        "created_utc": 1598956321,
        "id": "g3klqx4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598985121.0
    },
    {
        "author": "tindalos",
        "body": "Yeah the one company that isn't sustainable.   I love Zoom, use it all the time.\n\nThey were built for a small biz market and suddenly started closing deals way outside of their market.   Google Meet and hundreds of other conf systems competing.   I didn't have any stake in ZM - just wild.\n\nIt's like the stocks that skyrocket are only the ones with huge media visibility.  Salesforce, Zoom, etc.    I'm curious with my DocuSign.   After being burnt so many times, I feel I should sell before ER, but thats the one time it'll do a fuckin' Zoom",
        "created_utc": 1599080454,
        "id": "g3rpkca",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599109254.0
    },
    {
        "author": "eyestrikerbaby",
        "body": "I did as well. Was up 200% and rolled my initial investment into FDs yesterday right before close. Sold those this morning for profit bc I figured this was the selloff before earnings. \n\nLooking again this afternoon, I’m back in. Worth the risk and I’ve already locked in 150% profit off the original trade. I saw what happened to ZM CRM WDAY - I think there’s a great chance this is another one of those.",
        "created_utc": 1599070019,
        "id": "g3qxg05",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599098819.0
    },
    {
        "author": "NeelAsman",
        "body": "ZS is the play it's next weeks grand slam following suit CRM, ZM, ZS did spectacularly well, and the Oct. timeframe is perfect.",
        "created_utc": 1599072740,
        "id": "g3r4do7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599101540.0
    },
    {
        "author": "HowToBeAwkward_",
        "body": "All the funds (ie vanguard) are forced to buy TSLA, all but guaranteeing the stock price will shoot up. See CRM about 3 weeks ago when they got added to the DOW",
        "created_utc": 1599254743,
        "id": "g41oc4o",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599283543.0
    },
    {
        "author": "GreyMatter22",
        "body": "As a DOCU call holder who is still up due to the crazy IV, even though the stock has had quite the run up due to covid, DocuSign is literally the ONLY company for e-signatures, and every single industry is relying on this around the world for the foreseeable future due to prevalent social distancing norms.\n\nI mean, this is like the 'Netflix' to every 'Blockbuster', gone are the physical signature days at least until the vaccine.\n\n&amp;#x200B;\n\nThe revenue must be a huge beat, the stock's float is further held up by institutions and Salesforce, which is another success story due to COVID.\n\n&amp;#x200B;\n\nAny thoughts?",
        "created_utc": 1599155707,
        "id": "g3vl6up",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599184507.0
    },
    {
        "author": "cedrizzy",
        "body": "The top 5 options traded on CRM today are all puts, with volumes surging more than 200%:\n\nP250 04/09\nP230 11/09\nP240 04/09\nP240 18/09\nP220 18/09",
        "created_utc": 1599234877,
        "id": "g3zzy7z",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599263677.0
    },
    {
        "author": "sloSRT4",
        "body": "Apparently CRM, ZM earnings would have, guess which one I did 🚀",
        "created_utc": 1599281135,
        "id": "g430xu9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599309935.0
    },
    {
        "author": "staunch_character",
        "body": "Great rules. \n\nPlaying the run up to ER works really well (market crashes notwithstanding), but there’s always at least 1 or 2 ZM or CRM plays that go parabolic. Hoping you’ll catch that crazy one has definitely blown up a lot of accounts. \n\nSlow &amp; steady might not make gain porn, but it protects capital so we can keep growing.",
        "created_utc": 1599269501,
        "id": "g42j471",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599298301.0
    },
    {
        "author": "sadlifestrife",
        "body": "Actually, I made my first green trade in the past month or so lol Bought a CRM put for 1.50 cuz it seemed to be lagging behind on the dip compared to how much it's risen. Got a 2.5 bagger but I've already bled away all my fapital and have what little I have left on some longer term catalyst plays so it wasn't much. It'll be a long road back up...but feels good to finally see some green lol",
        "created_utc": 1599233436,
        "id": "g3zvrav",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599262236.0
    },
    {
        "author": "RealmHatch",
        "body": "It’s greed, everyone thinks they are going to hit the next ZM or CRM 😂",
        "created_utc": 1599091660,
        "id": "g3sehin",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599120460.0
    },
    {
        "author": "ar1195",
        "body": "Nah I just think these companies are tanking only because they rose so much after crm and zoom did their thing.",
        "created_utc": 1599087023,
        "id": "g3s3ydc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599115823.0
    },
    {
        "author": "Vcize",
        "body": "Or CRM.",
        "created_utc": 1599094492,
        "id": "g3sjnp5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599123292.0
    },
    {
        "author": "Complex-Ad8808",
        "body": "3/3 plays seems like ripping apart. ZUORA, RKT, CRWD. Not every stock is ZOOM, CRM.\n\nWill sell during the pump time before earnings for upcoming plays.",
        "created_utc": 1599077338,
        "id": "g3rh2xw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599106138.0
    },
    {
        "author": "Myusernamegoesup",
        "body": "CRM buying me a 3080 🚀🎉🎉",
        "created_utc": 1598981103,
        "id": "g3m4m4u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599009903.0
    },
    {
        "author": "stacksandwhiskers",
        "body": "Got in CRM at $273, my 9/18 300 calls are up 35%\n\n🤑🤑🤑",
        "created_utc": 1598981679,
        "id": "g3m69b2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599010479.0
    },
    {
        "author": "ItsreallyQ",
        "body": "Every time CRM runs up I’m like okay this is the top... and then it jumps up another $5",
        "created_utc": 1598981868,
        "id": "g3m6rl4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599010668.0
    },
    {
        "author": "TheAncient1sAnd0s",
        "body": "\\&gt;  With Salesforce and Docusign also popping this week, I don't see how much longer we can keep this rally going. \n\nThen it'll keep going. Until everyone is converted to a bull.  You don't turn around until you hit the peak in sentiment.",
        "created_utc": 1598971972,
        "id": "g3lfhsf",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599000772.0
    },
    {
        "author": "OptionExpiration",
        "body": "Since you worked at SIG, let's use the poker analogy. We know that retail has been buying calls across the board. We are short gamma and short so many calls. So we don't want to sell any more options at an x volatility. So retail keeps on buying at x+y and then x+y+z, etc. We keep on making sales at these 'inflated' prices and they keep on buying them.\n\nI presume this phenomena is happening in AAPL. Got steamrolled in CRM (what a move) and ZM (today). So we keep on offering at higher and higher levels (and retail keeps on buying) which is nuts.\n\nBecause the big tech stocks make up a huge portion on the NDX (QQQ) and SPX (SPY), we can get a little hedge on buy bidding up calls in the NDX (QQQ) and SPX (SPY). Because we are bidding up calls, we are now impacting VIX.\n\nThis is the only explanation I have for you. I think you are probably OK selling a little vol here (but I would go smaller size because of this craziness... vol can still go higher).",
        "created_utc": 1598990405,
        "id": "g3mu0gx",
        "score": 2,
        "subreddit": "options",
        "created": 1599019205.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "Tech earnings are back! I missed CRM and ZM but glad market sentiment is back to positive. Bore the brunt of shitty FSLY, TWLO, and DDOG earnings failures. Should be back soon. \n\n9/4 ROKU 185c",
        "created_utc": 1598997905,
        "id": "g3ncifm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599026705.0
    },
    {
        "author": "yaboiRich",
        "body": "Yes.\n\nI'm holding thru earnings. I hope it pulls off a zoom or at least a salesforce",
        "created_utc": 1599058189,
        "id": "g3q3f0h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599086989.0
    },
    {
        "author": "joseph66hole",
        "body": "Crm?",
        "created_utc": 1599058874,
        "id": "g3q51qc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599087674.0
    },
    {
        "author": "JNez123",
        "body": "Tech has been killing it, CRM and ZM, I think it'll continue with WORK, MDB, CLDR, VRNT, and DOCU.\n\nMy favs right now are VRNT and DOCU, just based on how many customer service positions have gone work from home during the pandemic.\n\nJust my thoughts.",
        "created_utc": 1598972949,
        "id": "g3li5bj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599001749.0
    },
    {
        "author": "spartandawg590",
        "body": "If you’re not buying this CRM dip you hate money",
        "created_utc": 1599071192,
        "id": "g3r0ebf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599099992.0
    },
    {
        "author": "RandyCrane17",
        "body": "Well probably get a vaccine pump after next week when tech earnings are all done. The catalyst for everything mooning the last few weeks has been Apple, CRM and now Zoom earnings.",
        "created_utc": 1599008176,
        "id": "g3nz5o2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599036976.0
    },
    {
        "author": "SUCcripLocc",
        "body": "Moves: bagholding my gold calls some more probably, I also enjoy making out with my girlfriend while she's sitting on the toilet peeing\n\n&amp;#x200B;\n\nIAU 1/15 $20c , SLV 1/15 $23c, CRM, MSFT, WMT, RKT, AMD, NVDA, short DXY",
        "created_utc": 1599120979,
        "id": "g3tlp00",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599149779.0
    },
    {
        "author": "leftyjef",
        "body": "Mitigate loss on $RKT and $CRWD.\n\nHow the hell after these two do I hold $AVGO through earnings.\n\nBeat down by selling $ZM and $CRM calls hour before earnings and got spanked on RKT and CRWD",
        "created_utc": 1599096421,
        "id": "g3sn7hf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599125221.0
    },
    {
        "author": "MushroomManiac",
        "body": "INTC, ZM, APL, FB, AMZN, CRM, LULU, VXX, WORK, SE, ZS, and RKT unfortunately. I feel as though I'm going to regret it very much so",
        "created_utc": 1599195375,
        "id": "g3y7lbt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599224175.0
    },
    {
        "author": "Freestyle_Fellowship",
        "body": "I am not in PRPL gang... or PTON, RKT, CRM, ZM and most other of the WSB hotties. What is the best deal because of today?",
        "created_utc": 1599163769,
        "id": "g3w9iw0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599192569.0
    },
    {
        "author": "python_js",
        "body": "The morning after earnings and that crazy AH/PM run up, CRM opened and still pumped like $20 in 30 min. I expect the same with ZM tbh",
        "created_utc": 1598951100,
        "id": "g3kgz7f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598979900.0
    },
    {
        "author": "Chouinard1984",
        "body": "Wow.. I was gonna say something.. buy I saw you're the CRM guy.\n\nGood luck! Holding 9/18 35c x20",
        "created_utc": 1599012937,
        "id": "g3o8bsj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599041737.0
    },
    {
        "author": "bralla97",
        "body": "CRM just dove off a cliff and took my portfolio with it",
        "created_utc": 1599054865,
        "id": "g3pvoqs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599083665.0
    },
    {
        "author": "sloSRT4",
        "body": "Aka CRM, ZM calls",
        "created_utc": 1598991052,
        "id": "g3mvtn7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599019852.0
    },
    {
        "author": "OptionExpiration",
        "body": "My feeling is that there is genuine panic at these market making firms because of these insane moves that just do not make sense (but they still continue because of the feedback loop). I would bet that a senior trader/partner has taken over these names (TSLA AAPL CRM FB GOOG etc) to make sure that the firm doesn't get clobbered too much.\n\nWe all know to respect the markets, but at some level the 'madness' has to end. Of course, nobody knows when that will happen. Notwithstanding, the 'edge' you get selling at x+y+z volatility is more than you got at x+y which is more than what you got at x. You may be wrong at the x and x+y levels, but at the x+y+z level you made up for your losses (from x and X+y) and then some. Thus, the snowball effect of implied volatility becoming actual volatility might be true at the x and x+y level and overstated at the x+y+z level. (There has to be some edge selling options because you need a balance sheet selling options versus buying options).\n\nSo I do agree with what you are saying that the implieds will eventually be overstating what is happening with actual volatility. Unfortunately, nobody knows what level this will be. Thus, selling vol in small pieces at higher and higher levels is probably the safest way of doing this (and this is probably what the market makers are doing). You should have enough edge that you can scratch a trade if it doesn't feel right...",
        "created_utc": 1598993570,
        "id": "g3n2p36",
        "score": 2,
        "subreddit": "options",
        "created": 1599022370.0
    },
    {
        "author": "spartandawg590",
        "body": "CRM $300c 9/11, bought on the dip, anyone else in it?",
        "created_utc": 1599069316,
        "id": "g3qvosa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599098116.0
    },
    {
        "author": "GourmetFilet",
        "body": "Draymond Green to Rondo: \"You thought you was Kobe?\" \n\nStock Market to CRWD: \"You thought you was CRM and ZM?\"",
        "created_utc": 1599078134,
        "id": "g3rjb6d",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599106934.0
    },
    {
        "author": "bshaman1993",
        "body": "Guys take a look at CTXS",
        "created_utc": 1599068740,
        "id": "g3qu75i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599097540.0
    },
    {
        "author": "Trueslyforaniceguy",
        "body": "Yes!  Citrix, DOCU, WORK, PD",
        "created_utc": 1598969616,
        "id": "g3l990c",
        "score": 1,
        "subreddit": "investing",
        "created": 1598998416.0
    }
]