[
    {
        "author": "hexydes",
        "body": "A good example is probably the hard drive industry. Back in 2012, there were [massive floods in Thailand](https://www.theverge.com/2012/1/24/2729692/western-digital-prices-thailand-floods) that badly disrupted the production of hard drives. This led to an almost 50% increase in hard drive prices for about a year or so. It was really annoying, and set the industry back for about 2 years (the pace of hard drive size increases just ground to a halt for a while). However, the big data center/cloud players were just spinning up and kept buying at any price. Eventually, markets do what they do, and the prices started going down, while the storage space started going back up.\n\nSo more than likely, you'll see a few quarters of higher prices, where enterprises will keep buying what they need because they have no other option. Consumer purchases will decrease for a while, but eventually things will sort back out because...what's the alternative?",
        "created_utc": 1581306037,
        "id": "fh6tz2s",
        "score": 10,
        "subreddit": "investing",
        "created": 1581334837.0
    },
    {
        "author": "Ax1er",
        "body": "Holding 2/28 in lulu, msft, v, amd, wdc\n4/17 in Alk, wynn, expe, ccl\n3/6 spy 290\n9/18 spy 300 which was a hedge from when I was bull gang\n\nBetter not bounce tomorrow",
        "created_utc": 1582839423,
        "id": "fiyhc72",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1582868223.0
    },
    {
        "author": "swampthing41",
        "body": "WDC $60puts 2 weeks out any takers",
        "created_utc": 1581106733,
        "id": "fgtmyuo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581135533.0
    },
    {
        "author": "Miragey",
        "body": "Not at all sandisk\n\n\nWestern Digital has manufacturing facilities in the US, as well as in China, Japan, Malaysia, the Philippines, Singapore, and Thailand; it has sales offices worldwide.",
        "created_utc": 1582399729,
        "id": "figi23b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582428529.0
    },
    {
        "author": "ChompySnack",
        "body": "Small price stocks are hard to wheel. You need a very liquid options market or the spread will make it much less profitable. Also $2k is not nearly enough unless you want to hold a single risky and downtrodden stock that don’t generate much premium. With that little an amount you also won’t be able to diversify. It’s best not to hold more than 5-10% of your account in any one stock. If you can get margin on your account, skip the put phase and buy the stock and sell an ITM (I like around 70 delta) call. That’s the same trade as a short put but you can leverage 4x usually. You can find stocks that can average between 0.5-1.0% a week. Going out farther than one week reduces risk and return. Some of my go-to lower price stocks are SFIX, MU, SNAP, TWTR, BAC, CIEN, CSCO, LK, MU, T, WDC, and XLNX. Beware of earnings!",
        "created_utc": 1581258725,
        "id": "fh2ocyp",
        "score": 1,
        "subreddit": "options",
        "created": 1581287525.0
    },
    {
        "author": "Atworkwasalreadytake",
        "body": "QCOM and WDC puts.  Both heavily reliant on Chinese supply chains.",
        "created_utc": 1581348062,
        "id": "fh7yp1q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581376862.0
    },
    {
        "author": "Killerslug",
        "body": "WDC apple Qcom",
        "created_utc": 1581351296,
        "id": "fh83mu8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581380096.0
    },
    {
        "author": "ichi-zero",
        "body": "The flu/cold is something is that widely known with lots of information/statistics; e.g. recovery times, symptoms, etc. While the coronavirus is completely NEW; uncharted territory. \n\nThis outbreak is something I followed very closely since it was announced a few weeks ago. As I have some relatives in China, I've had status updates from them. Even in ShangDong north east coast, there was frantic over buying/hoarding of supplies leading to the built up of official announcements. People were stocking up pretty much everything: Water filters, masks, sanitizers, gloves, dried foods, spices, butane canisters for cooking, propane tanks, you name it. You've even had speculative \"investors\" buying tons of higher end drones and cameras (e.g. DJI drones) - presumably to sell or to be used to monitor streets from a safe distance. As this was the most unprecedented “quarantine” lockdown in the history of mankind - this tell me that the CCP was spooked… their reaction which speaks volumes on the situation. \n\nIn no particular order:\n\nWhat we know:\n\n=&gt; Factories closed until Feb 10 - it will be decided if production/lockdown will be extended   \n=&gt; Schools closed &amp; don’t resume until mid Feb   \n=&gt; Flights limited/blocked to over 15 countries as of Feb 6th / Russian border closed to China   \n=&gt; Production/Supply chains will feel the squeeze shortly   \n=&gt; Examples include many electronic production lines in ShenZhen china; where work is outsourced 3-8 runs down the ladder; when production at the top have NO idea who to contact beyond 3-4 rungs down. Essentially, we're going to a massive price spike on electronics in the coming months from TVs, computer hardware, etc due to limited supply and rising shipping costs.   \n=&gt; Hyundai stopped domestic productions over parts shortage - few days ago.   \n=&gt; Toyota looking for new suppliers for car parts at of Feb 6th, 2020.   \n=&gt; Domino effect in play here; a “cheap” low cost part shortage (e.g. say specialized screw) can easily halt production of much higher value products (e.g. Medical devices, iPhones, Cars, Tvs etc)   \n=&gt; Retail to suffer due to store closures and/or operating on shorter hours. (e.g. Starbucks, McDonalds, Nicke, all domestic restaurants in lockdown zone, etc)   \n=&gt; International tourism to reduce significantly - due to fear, xenophobia/racism. This outbreak WILL change consumer spending/traveling habits - (something tells me e-commerce will be the biggest winner here - online grocery will get a nice boost from this). \n\nX Factors (Unknown):   \n=&gt; Spread of wildfire misinformation (the bigger pandemic imo) - rise of xenophobia/racism towards individuals of Asian descent. - which also makes it harder to contain &amp; combat this outbreak.   \n=&gt; Based on available information from official sources (WHO), NCoV has a “similar” fatality rate closer to the flu than say SARS - but not much more than that due to limited sample size outside of China.  \n=&gt; How it spreads is still not yet fully understood.   \n=&gt; Viruses are known to exchange genetic information with each other in their host; due to how contagious nCoV is, it CAN create new strains by combining with other viruses or something entirely new capable starting an real “pandemic”   \n=&gt; Actual infected cases TBD (due to bottleneck in lab verifying cases) - same goes for total death toll. Topped off by the assumption that “actual” numbers are downplayed by CCP officials.   \n=&gt; 2020 Olympics in Japan...\n\nDespite being new (2.5 years) in investing, I’ve always followed my gut/instincts with a logical foundation - pick long term table companies with a history of good management (e.g. MSFT, Visa, Mastercard, McD, Dis) which tends to translate to growth - I’ve also taken calculated risks with my knowledge of PC hardware (e.g. AMD, Western Digital, TSMC). With all the up/downs I’ve experienced, I quickly realized that buying stocks is easy - but waiting (time) is hard. And in this long bull run we’ve had this past decade, it’s easy to get carried away and lose sight of the bigger picture. I’ve felt that the current market is over extended and treading on thin ice; but between global growth slow down, record low interest rates and “trader euphoria” there is limited room forward and is a disaster waiting to happen. Even Dr Michael Burry himself said passive investing is an “bubble”. You may not agree but I’ve felt that traditional analysis in general no longer reflects “real stock value” anymore; due to the ease and accessibility to the market today. I remember dropping off an inhaler (asthma) for a friend’s brother in high school about an year ago, and saw him with a bunch of friends playing stocks on their smartphones at lunch CASUALLY; these are 14-17 year olds dabbling in stocks with budgets between $100-$2,500. Legalities aside, the investment landscape is changing. I’m quite cautions of the market at this time and have cashed out 80% about an week ago. I’m going to take a little break and observe where nCoV/Markets are headed. Choppy waters ahead...",
        "created_utc": 1581095161,
        "id": "fgsya9f",
        "score": 1,
        "subreddit": "investing",
        "created": 1581123961.0
    },
    {
        "author": "pet_wolverine",
        "body": "Companies like WDC, CCEP and KR have done just fine for me.  $25B isn't exactly a tiny market cap.  Obviously the higher you go in market cap, GENERALLY the more stable, less volatile the stock.  WDC has had more swings than a lot of stocks, but both CCEP and KR have been fairly steady, so it just depends.",
        "created_utc": 1582143739,
        "id": "fi4lqy2",
        "score": 1,
        "subreddit": "investing",
        "created": 1582172539.0
    },
    {
        "author": "DidymusTwo",
        "body": "WDC $75 3/20 c - free money",
        "created_utc": 1581713462,
        "id": "fhmiwhi",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1581742262.0
    }
]