[
    {
        "author": "PurpleSquare",
        "body": "who's the retard now:  \n[https://en.wikipedia.org/wiki/Tesla\\_Model\\_E](https://www.youtube.com/watch?v=dQw4w9WgXcQ)",
        "created_utc": 1600136460,
        "id": "g5bdksd",
        "permalink": "/r/wallstreetbets/comments/iswt0r/all_hail_the_musk/g5bdksd/",
        "score": 423,
        "subreddit": "wallstreetbets",
        "created": 1600165260.0
    },
    {
        "author": "MrHockey95",
        "body": "RTX, WM, AAPL, MSFT, V\n\n\nRTX - Beast of a defense company. Produces an ugodly amount of stuff for the U.S military. Commercial sector as well. No brainer for me. \n\nWM - People create waste like no other, and Waste Management is massive. Can’t see them going anywhere anytime soon. \n\nAAPL - Everyone knows this \n\nMSFT - Another Tech giant everyone uses. \n\nV - One of the 2 headed giant. People swipe their credit cards faster than you can say hello.",
        "created_utc": 1600136292,
        "id": "g5bda3z",
        "permalink": "/r/stocks/comments/isyhvx/if_you_can_only_choose_5_companies_to_buy_and/g5bda3z/",
        "score": 136,
        "subreddit": "stocks",
        "created": 1600165092.0
    },
    {
        "author": "Skeptophile",
        "body": "I mostly steer clear from YouTube investment channels since they are generally just \"content entrepreneurs\" milking the topic with zero insight (especially with Tesla since it's clearly a terrific click driver), video is also an inneficient medium to transfer information, but Rob Mauer is my go to when it comes to Tesla. All that to say his [video on this subject](https://www.youtube.com/watch?v=Wq5Awwmzh_o) is much more informative and interesting than this CNBC article.",
        "created_utc": 1600615831,
        "id": "g5zno08",
        "permalink": "/r/StockMarket/comments/iwewmg/what_to_expect_from_tesla_on_battery_day/g5zno08/",
        "score": 133,
        "subreddit": "StockMarket",
        "created": 1600644631.0
    },
    {
        "author": "sosa1414",
        "body": "                V A L E   S Q U A D \n\n🚀🚀😤 ASSEMBLE 😤🚀🚀",
        "created_utc": 1600431295,
        "id": "g5p0qem",
        "permalink": "/r/wallstreetbets/comments/iv3f4e/daily_discussion_thread_for_september_18_2020/g5p0qem/",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1600460095.0
    },
    {
        "author": "brutaldude",
        "body": "You're supposed to have a \"1 in 200 chance of getting stock\" in \"Visa, Microsoft, Johnson &amp; Johnson\". There should be plenty of other jackpot winners in here.",
        "created_utc": 1600588507,
        "id": "g5y5b0o",
        "permalink": "/r/wallstreetbets/comments/iw7vb2/you_love_to_see_it/g5y5b0o/",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1600617307.0
    },
    {
        "author": "smokeyjay",
        "body": "IMO Tiktok type stuff is incredible for advertising and we will see more and more stuff like it in the future.\n\nI downloaded the app because I had MSFT calls to see what the fuss was about.  It got me listening to new music.  And I already see the subliminal advertisements for fashion, makeup, food, exercise.\n\nTiktok I think was expected to pull in more than a billion revenue the next year.  I wish Apple bought it.\n\nI linked an article to the future of e-commerce.  We are seeing it in Asia, and its only a matter of time before the West adopts it.\n\n[https://a16z.com/2019/12/05/video-first-ecommerce/](https://a16z.com/2019/12/05/video-first-ecommerce/)\n\nHere's an example of Tiktok what I wear\n\n[https://www.youtube.com/watch?v=\\_bWUr0Yudbk](https://www.youtube.com/watch?v=_bWUr0Yudbk)\n\nThey've convinced tens to hundreds of millions of kids to basically watch a fashion show and that is scratching the surface.",
        "created_utc": 1600050784,
        "id": "g56yvmh",
        "permalink": "/r/investing/comments/is9f4j/microsoft_drops_out_of_bidding_for_tiktoks_us/g56yvmh/",
        "score": 68,
        "subreddit": "investing",
        "created": 1600079584.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "Yeah I lost my V card when I was 12 with this totally hot senior from the town over. She was like, oh man you're the bestest sex I had today, even better than my uncle.",
        "created_utc": 1599954104,
        "id": "g501nae",
        "permalink": "/r/wallstreetbets/comments/iray8b/what_happened_to_the_guy_who_hired_an_escort_with/g501nae/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1599982904.0
    },
    {
        "author": "brutaldude",
        "body": "Here's the interview: [https://www.youtube.com/watch?v=cRNypdYQoWk](https://www.youtube.com/watch?v=cRNypdYQoWk)  \n\n\nSkip to 1:34.",
        "created_utc": 1600228106,
        "id": "g5fsd4c",
        "permalink": "/r/wallstreetbets/comments/itl6m7/you_heard_him_boys_tesla_stock_6942000_secured/g5fsd4c/",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1600256906.0
    },
    {
        "author": "dvdmovie1",
        "body": "This wasn't Buffett, it was Todd or Ted and one can say that Todd and Ted have not had perhaps the greatest record at Berkshire (2019: \"Warren Buffett says Ted Weschler and Todd Combs have each trailed the S&amp;P 500 by a “tiny bit” since they joined Berkshire as investment managers.\", https://www.cnbc.com/2019/02/25/warren-buffett-says-berkshire-stock-managers-weschler-and-combs-have-trailed-the-sp-500.html.)\n\nThat said, Berkshire buying into something like this I think is surprising (I joked when this was announced that \"no, it's not April Fool's\") enough that it suggests perhaps further preparation for a post-Buffett Berkshire that can't simply say \"tech isn't our thing\" anymore. Edit - looking at this point like it will open somewhere around $165-170. Edit II: $170-175 Edit III: $175-180 Edit IV: $185-190 Edit V: $190-195. Edit VI: $195-200 Edit VII: $200-205. Edit VIII: $225-230. Edit IX: $230-235. Edit X: $235-240. Edit XI: $225-230. Edit XII: $230-235. If this could open that would be nice. Edit XIII: $235-240. Edit XIV: $238-241 Edit XV: $240-243 Opening soon? EDIT XVI: $241-243. Edit XVII: $243-245. Friggin open already. Open at $250ish now $275. Edit: now halted.",
        "created_utc": 1600262106,
        "id": "g5guo8j",
        "permalink": "/r/investing/comments/itv4t4/let_this_buffet_quote_guide_you_with_your/g5guo8j/",
        "score": 47,
        "subreddit": "investing",
        "created": 1600290906.0
    },
    {
        "author": "everybodysaysso",
        "body": "I thought Square is just a point-of-sale processor, not payment processor. So, your payment to the local coffee shop goes: Your phone/card -&gt; Square terminal -&gt; Visa -&gt; ...\n\nVisa is still the main payment processor. Did Square announce any interest in becoming one?",
        "created_utc": 1599270900,
        "id": "g42leec",
        "permalink": "/r/investing/comments/imso9g/the_bull_case_for_square_a_top_100_stock/g42leec/",
        "score": 40,
        "subreddit": "investing",
        "created": 1599299700.0
    },
    {
        "author": "bandwagonnetsfan",
        "body": "V Tec just kicked in yo",
        "created_utc": 1600648352,
        "id": "g61tk1s",
        "permalink": "/r/wallstreetbets/comments/iwljxd/didnt_realize_i_was_going_to_be_the_main_course/g61tk1s/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1600677152.0
    },
    {
        "author": "2fish24",
        "body": "V shaped recovery boys. Buy your calls rn this train only goes up",
        "created_utc": 1599167483,
        "id": "g3wkged",
        "permalink": "/r/wallstreetbets/comments/ilzs38/analysts_stumped_as_market_filled_with_odd/g3wkged/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1599196283.0
    },
    {
        "author": "your_fav_ant",
        "body": "Article:\n\nA new ETF offering 4-per-cent retirement income is going to be big\n\nRob CarrickPersonal Finance Columnist\n\nPublished 6 hours ago Updated September 15, 2020 \n\nYou can tell an investment product is going to be a hit when you instantly see a huge and hungry market for it.\n\nThe new Vanguard Retirement Income ETF Portfolio, which makes its debut on Wednesday, is designed to pay predictable amounts of monthly income to retirees. To underscore this purpose, the ticker symbol is VRIF. V is for Vanguard and RIF is a play on registered retirement income fund, which is where people have all, most or some of their retirement savings.\n\nA big question with RRIFs, and it’s more pressing than ever, is what do you stick in your account to generate income to live on in retirement? We have an aging population of investors who are going to be saddled with low interest rates for a long time. Dividend-paying stocks are going to be essential, but how do you pick the ones that will provide reliable income rather than grief to investors?\n\nVRIF attacks the problem by bundling eight Vanguard equity and bond funds (the stocks-bonds mix is 50-50) into a single package designed to pay monthly income targeting a real-world 4-per-cent yield. “That is what clients will get in their pocket, or bank account,” said Scott Johnston, head of product for the Americas at Vanguard.\n\nDividends and interest income will account for about 60 cents per $1 of income, with capital gains providing the other 40 cents. Basically, Vanguard will strategically sell holdings that have risen in price to top up dividends and interest. This approach highlights the fact that this is an ETF designed for generating income, not for growing your money.\n\nYou could build and manage a portfolio of individual ETFs or stocks and bonds to accomplish the same total-return approach of VRIF, but some exacting work is required to ensure you get the income you need.\n\nVanguard does it all for you in a cost-effective way. The management expense ratio for VRIF is projected to be 0.31 or 0.32 per cent – that’s not the cheapest fee in ETF-land, but it’s a fair value. The cost of the eight underlying funds is included in the published MER, as is the practice with fund-of-fund ETFs. One additional cost is the brokerage commission to buy and sell an ETF or stock.\n\nAt a time when the investment industry is prying up every rock in sight to find new ways to generate bond-beating income, the components of VRIF come across as basic or even bland. In a 50-50 mix of stocks and bonds, the fund holds Canadian, U.S. and international stocks (including a minuscule 1 per cent weighting in emerging markets), plus bonds.\n\nThere are no preferred share, high yield bond or emerging market bond funds, or use of a covered call strategy, where financial instruments called derivatives are used to augment income. Mr. Johnston said these securities can add risk to a portfolio as well as higher levels of income. “What we have with VRIF is a simple, broadly diversified portfolio – that is it.”\n\nVRIF is the latest iteration of one of the most popular types of ETFs – the balanced ETF, also known as asset allocation ETFs. Since Vanguard introduced the category in January, 2018, it has attracted $4.5-billion from DIY investors and advisers who understand that low-cost, index-tracking investments are a prime way to build long-term wealth.\n\nAn additional benefit of VRIF is tax efficiency in non-registered accounts. Only 50 per cent of a capital gain is taxable, and dividends benefit from the dividend tax credit.\n\nThere’s nothing particularly exotic about VRIF’s total return approach to generating a payout targeting 4 per cent, but it does raise the question of what happens when there aren’t enough capital gains to augment dividends and bond interest. Vanguard says it would use a return of capital in such situations, which it expects to do (in other than negligible amounts) roughly one in every 10 years.\n\nReturn of capital in non-registered accounts can be an annoyance to investors and a sign that a fund’s holdings are unable to deliver the promised level of income. A return of capital is an amount above and beyond the usual kinds of income from bond interest, dividends and capital gains. A return of capital is not taxed when you receive it, but it reduces the cost of an investment and thus increases your capital gain when you sell.\n\nVRIF, like many equity ETFs, may also use trace amounts of return of capital to ensure that identical amounts of income can be paid every month. This is necessary because dividend stocks pay quarterly and bonds pay semi-annually.\n\nIf you’re a retiree managing investments to produce income, ask yourself this: How have you found the challenges of the past year, and how confident are you that you can navigate the next 12 months? If you’d like help, it’s now at hand. Expect competing products shortly.",
        "created_utc": 1600232765,
        "id": "g5fzc6d",
        "permalink": "/r/CanadianInvestor/comments/itns1f/vanguard_introduces_new_etf/g5fzc6d/",
        "score": 34,
        "subreddit": "CanadianInvestor",
        "created": 1600261565.0
    },
    {
        "author": "upvotemeok",
        "body": "everyones a genius in a decade long bull market and a 3 month V shaped dip",
        "created_utc": 1599026017,
        "id": "g3os2kz",
        "permalink": "/r/investing/comments/il13pb/cmv_fundamentals_and_pe_ratio_do_not_and_have/g3os2kz/",
        "score": 32,
        "subreddit": "investing",
        "created": 1599054817.0
    },
    {
        "author": "rarecoder",
        "body": "Here’s hoping for a V shaped recovery buddy. Calls on $DAD 🚀 👨",
        "created_utc": 1600537855,
        "id": "g5u7658",
        "permalink": "/r/wallstreetbets/comments/ivwan5/my_dad_is_dying/g5u7658/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1600566655.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "Last time DIX was that low S&amp;P 500 was at 2400 and we had a V shape recovery. Now S&amp;P is only at 3426 with DIX that low which means 3426 is new bottom. Stonks go up on Tuesday.",
        "created_utc": 1599273156,
        "id": "g42p1nb",
        "permalink": "/r/wallstreetbets/comments/imtbmx/look_at_the_dix_the_fucking_dix_we_are_repeating/g42p1nb/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1599301956.0
    },
    {
        "author": "simplenicc",
        "body": "Holy shit TSLA is $500 in German market right now\n\n[https://www.boerse-frankfurt.de/equity/tesla-inc](https://www.youtube.com/watch?v=NW1zTVpRRpQ)",
        "created_utc": 1600150864,
        "id": "g5byt7y",
        "permalink": "/r/wallstreetbets/comments/issvr0/what_are_your_moves_tomorrow_september_15_2020/g5byt7y/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1600179664.0
    },
    {
        "author": "nebuloushazybull",
        "body": "Stonk Wars I: The Phantom Fauci\n\nStonk Wars II: Attack of the Bulls\n\nStonk Wars III: Revenge of the Bears \n\nStonk Wars IV: A New Stimulus\n\nStonk Wars V: The Virus Strikes Back \n\nStonk Wars VI: Return of the Printer \n\n🚀🚀🚀",
        "created_utc": 1599798133,
        "id": "g4skh4p",
        "permalink": "/r/wallstreetbets/comments/iqb5ey/what_are_your_moves_tomorrow_september_11_2020/g4skh4p/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1599826933.0
    },
    {
        "author": "smokey_randy",
        "body": "To be fair it’s a shit bike. V brakes, 26” wheels, rear spring shocks. Shimano shifter setup is the only decent part. It’s a bike for 🌈🐻\n\nBulls ride 29er’s",
        "created_utc": 1600052477,
        "id": "g571kgc",
        "permalink": "/r/wallstreetbets/comments/isanni/all_in_thoughts/g571kgc/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1600081277.0
    },
    {
        "author": "07Ghost",
        "body": "It's a business that gives out loans for god sake. You really think this company gonna grow 10x to compete with the big banks in the mortgage business? Especially in a low interest rate environment, there's a reason why most of the bank stocks were and are still lousy investments ever since 2008. NIM is everything in the lending business. I'd stay away any business whose outlook prospers on a change in interest rate and the housing economy, because those factors are outside of the company's control.\n\nSeriously, some of you have the weirdest DDs that maybe you're just thinking too hard. If you want to go with high growth, high risk company in finance, you have a better chance to double, triple, maybe even 5x your money with digital payment companies like Paypal and Square that sit well with Millennial &amp; Gen Z. If you want to invest in stable growing financial company with lower risk, Visa and Mastercard are the choices in the digital era.",
        "created_utc": 1599976630,
        "id": "g51xtaa",
        "permalink": "/r/stocks/comments/irqt4g/why_rkt_is_a_10_bagger_my_overly_detailed_dd/g51xtaa/",
        "score": 24,
        "subreddit": "stocks",
        "created": 1600005430.0
    },
    {
        "author": "kenman",
        "body": "Meanwhile, here's a progress video from 9/8 of Tesla's Gigafactory in Austin, drone footage starts at 2:45:\n\nhttps://www.youtube.com/watch?v=v9j87jREsA4\n\nYou may also want to watch it in 2x speed, it's long.\n\n\n\nThey're clearly putting their money to work.",
        "created_utc": 1599790332,
        "id": "g4s7dzv",
        "permalink": "/r/investing/comments/iq2sye/short_seller_hindenburg_alleges_that_electric/g4s7dzv/",
        "score": 24,
        "subreddit": "investing",
        "created": 1599819132.0
    },
    {
        "author": "EeveeB",
        "body": "Trump thinks we have a V shaped recovery so he can grab it by the Pussy",
        "created_utc": 1601436712,
        "id": "g7500xf",
        "permalink": "/r/wallstreetbets/comments/j272rv/what_are_your_moves_tomorrow_september_30_2020/g7500xf/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1601465512.0
    },
    {
        "author": "_Jerome_Powell_",
        "body": "Just had sex with my first black girl and I don’t think a white girl will ever get me hard again\n\nEdit: Dark brown. Wild, bouncing around and shit. Took her anal v card. 10/10",
        "created_utc": 1599994627,
        "id": "g535zdb",
        "permalink": "/r/wallstreetbets/comments/iqy7be/weekend_discussion_thread_for_the_weekend_of/g535zdb/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1600023427.0
    },
    {
        "author": "x2c3v4b5",
        "body": "As a beginner, regardless of your sources, I will save you a lot of time during your study with these 7 points:\n\n 1. Pay no respect to volatility of the markets. Who fucking cares about low growth times, high growth times, COVID, no COVID, \"all time highs\", \"all time lows\" or wherever the fuck we are on the \"graph\". You should not care if the market goes up, down, left, right, sideways, V-shape, W-shape, XYZ-shape, etc. Seriously, you should not care at all. Volatility should not mean anything to you since you should be a super long-term investor.\n\n 2. You cannot predict the future and you cannot time the market. \"Time in the market\" is superior to \"timing the market\" as per academic studies. Therefore, you should invest as much as you can every time you get paid while while balancing a decent quality of life (whatever that means to you). Basically, don't try to pull off some \"smart shit\" by pulling out your money because you think the markets will crash and then put your money back into the market after it crashes to capitalize on that hypothetical situation in your little head. Turn off your brain and keep your money in the markets because again, \"time in the market\" is superior to \"timing the market\" as per academic studies.\n\n 3. You should consider investing in an \"index exchange traded fund\" or \"index-ETF\" if you do not feel comfortable picking individual companies. An index-ETF is essentially an investment product which contains numerous individual stocks (usually some of the more bigger dominant ones in the market); therefore, giving you exposure to a wide array of sectors/companies. As such, you reduce your investment risk via diversification. As well, most, if not all, academic studies reveal that average retail investors who pick stocks will under perform an index-ETF over the long-term.\n\n 4. Don’t day trade. Don't try to \"get rich quick\". Don't try to \"buy low, sell high\". Don't buy shit/garbage. Don't buy \"meme stocks\". Don't worry about \"missing out\". Build wealth slowly over time as this is a long-term game and not a short-term or medium-term game.\n\n 5. Recessions, crashes, dips, depressions, or whatever the fuck people want to call it is good for you as long as you are not buying shit/garbage. When these events occur, this should be seen as a time of opportunity because everything goes on sale which includes high-quality companies and index-ETFs; and therefore, you get to buy more stuff at a discount. Do not fear these times, embrace them instead because these are the times which can actually accelerate you towards your financial goals quicker.\n\n 6. Again, generally speaking, you should not give a shit what happens in the world, economy, politics/elections, wars, recessions, poverty, and/or stock market (with respect to how it affects your purchasing behavior). You should have an unshakable discipline in buying index-ETFs or purchasing well-established, high-quality, dividend growth companies with wide economic/competitive moats as well as a proven track record of paying dividends through tough times every two weeks until you retire or die.\n\n 7. You should be building a financial castle brick-by-brick for you, your loved ones, and future generations every two weeks regardless of what happens (even if this time is \"different\" due to COVID because you should be a disciplined, long-term minded investor who just doesn't give two fucks about volatility). \n\nKeep it simple. Keep yourself disciplined. Keep hustling. Keep your money. Good luck with personal finance and investing! =)",
        "created_utc": 1600577111,
        "id": "g5xgnur",
        "permalink": "/r/investing/comments/iw3y38/question_about_market_crash/g5xgnur/",
        "score": 22,
        "subreddit": "investing",
        "created": 1600605911.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[The best feeling is buying penny stocks at 52 week highs, and watching your pennies fall faster than they can shoot out of a coin machine at the mint.](https://www.youtube.com/watch?v=Mc3t3IVkq60)",
        "created_utc": 1599164286,
        "id": "g3wb2g0",
        "permalink": "/r/wallstreetbets/comments/ilxnwo/yes/g3wb2g0/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1599193086.0
    },
    {
        "author": "Aviternus",
        "body": "[Return the ~~slaaaaaab~~](https://www.youtube.com/watch?v=kKnC674-ZDU&amp;ab_channel=CouragetheCowardlyDog) gold standard",
        "created_utc": 1599179516,
        "id": "g3xgsyv",
        "permalink": "/r/wallstreetbets/comments/im2lv5/market_crashes_the_next_morning/g3xgsyv/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1599208316.0
    },
    {
        "author": "bibibabibu",
        "body": "Been long on V, ma and sq and se for a long time. But note that v has been stagnant for quite a while. What're your thoughts on why the market seems to basically have left V on the shelf?",
        "created_utc": 1600152744,
        "id": "g5c0ue0",
        "permalink": "/r/stocks/comments/isyhvx/if_you_can_only_choose_5_companies_to_buy_and/g5c0ue0/",
        "score": 20,
        "subreddit": "stocks",
        "created": 1600181544.0
    },
    {
        "author": "fjortisar",
        "body": "Ameritrade has a lot of educational stuff, you can access some of it without an account\n\n[https://www.tdameritrade.com/education/investment-videos.page](https://www.tdameritrade.com/education/investment-videos.page)\n\n[https://www.youtube.com/watch?v=B43HsjSvdJE](https://www.youtube.com/watch?v=B43HsjSvdJE)",
        "created_utc": 1600977079,
        "id": "g6gkk1m",
        "permalink": "/r/RobinHood/comments/iz0zk2/is_there_a_profit_difference_between_buying_an/g6gkk1m/",
        "score": 20,
        "subreddit": "RobinHood",
        "created": 1601005879.0
    },
    {
        "author": "illtakethebox",
        "body": "&gt; @vegilates\n\nhttps://www.youtube.com/watch?v=LsBnDldZg3o",
        "created_utc": 1600019898,
        "id": "g55015h",
        "permalink": "/r/wallstreetbets/comments/irx4y6/she_says_its_for_luck/g55015h/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1600048698.0
    },
    {
        "author": "karmalizing",
        "body": "||||||||\n:--|:--|:--|:--|:--|:--|:--|\n|||||V|||\n|||||A|||\n||D|||L|||\n|B|A|T|T|E|R|Y|\n||Y||||||",
        "created_utc": 1600809802,
        "id": "g6979cx",
        "permalink": "/r/wallstreetbets/comments/ixv5mz/what_are_your_moves_tomorrow_september_23_2020/g6979cx/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1600838602.0
    },
    {
        "author": "HybridTrader",
        "body": "My boy Trevor spent years flaunting a functional truck.  Now its time for him to put his money where his mouth is.\n\nMy rant: I googled how Nikola's hydrogen fuel cells get replaced.  Its just a video of Trevor opening up the hood of an 18 wheeler and saying \"okay, theres the fuel cell\" without any specifications as to where the fuck the fuel cell was.\n\nVideo: [https://www.youtube.com/watch?v=7LSrvRMgIqw&amp;ab\\_channel=NikolaMotorCompany](https://www.youtube.com/watch?v=7LSrvRMgIqw&amp;ab_channel=NikolaMotorCompany)\n\nAt the **10 minute mark** they stop the truck and open the hood.\n\nEdit: added the video for anyone curious",
        "created_utc": 1600439589,
        "id": "g5peaqd",
        "permalink": "/r/wallstreetbets/comments/iv6wky/an_incomplete_list_of_firms_suinginvestigating/g5peaqd/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1600468389.0
    },
    {
        "author": "CptTonyStark",
        "body": "[https://www.youtube.com/watch?v=l6T9xIeZTds](https://www.youtube.com/watch?v=l6T9xIeZTds)\n\nIn today's battery day video, from 1:20:16 to 1:22:39 Elon admits that autopilot was not making any improvements at all a couple years ago, and they had to completely rewrite the autopilot codebase and labeling software, change everything, and that they are still stuck in a local maximum and yet he didn't mention any of these problems at all in last year's 4/23/2019 autonomy day presentation, insisting that FSD was coming \"very soon\" and be feature complete in 2019, not needing human attention at all by Q2 2020, and having a million robotaxis in 2020, all while shitting on companies that use LIDAR. \n\n[https://cleantechnica.com/2019/04/23/tesla-autonomy-day-what-we-learned/](https://cleantechnica.com/2019/04/23/tesla-autonomy-day-what-we-learned/)\n\n[https://www.cnbc.com/2019/04/23/elon-musk-celebrates-flawed-tesla-autonomy-day-with-employee-email.html](https://www.cnbc.com/2019/04/23/elon-musk-celebrates-flawed-tesla-autonomy-day-with-employee-email.html)\n\nThat's not even an \"ambitious promise\", it's straight up lying, hiding information, and misleading investors. Very cool and very legal, Elon.",
        "created_utc": 1600818447,
        "id": "g69mwut",
        "permalink": "/r/wallstreetbets/comments/ixv5mz/what_are_your_moves_tomorrow_september_23_2020/g69mwut/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1600847247.0
    },
    {
        "author": "SagaStrider",
        "body": "Political situation: Legally they have until January to replace her and only need a simple majority. They can't be filibustered for that long. Unless several GOP senators jump ship to Merrick Garland Isle, the Dems will be down, 6-3 justices. \n\nSWHC might be a play. Trump's financial records are on the docket, but Idk how you make a play on that. Parts of the ACA might get nixed in CA v TX, so private insurance I guess.",
        "created_utc": 1600476716,
        "id": "g5ri4md",
        "permalink": "/r/wallstreetbets/comments/ivhn3l/rbg_is_dead/g5ri4md/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1600505516.0
    },
    {
        "author": "Iceman_259",
        "body": "[BP:](https://youtube.com/watch?v=Zr31qrEH9dg)",
        "created_utc": 1600104417,
        "id": "g596xsk",
        "permalink": "/r/investing/comments/isku7v/bp_says_the_era_of_oildemand_growth_is_over/g596xsk/",
        "score": 18,
        "subreddit": "investing",
        "created": 1600133217.0
    },
    {
        "author": "Quatto",
        "body": "there is a deeper hell to come. AOC  v. Don Jr 2024",
        "created_utc": 1601437009,
        "id": "g750in0",
        "permalink": "/r/wallstreetbets/comments/j272rv/what_are_your_moves_tomorrow_september_30_2020/g750in0/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1601465809.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "Microsoft\n\nApple\n\nVisa\n\nGoogle\n\nAT&amp;T (Dividends play)",
        "created_utc": 1600133111,
        "id": "g5b7ltu",
        "permalink": "/r/stocks/comments/isyhvx/if_you_can_only_choose_5_companies_to_buy_and/g5b7ltu/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1600161911.0
    },
    {
        "author": "nareee20",
        "body": "You’re right. Square mostly helps Visa and other payment networks like MasterCard/Amex because they enable merchants to accept digital payments for cheaper than traditional processors. \nSquare’s Cash App might pose a risk to VISA because it allows users to transfer money without requiring a Visa/MasterCard.\nOverall though, it is complementary rather than competitive to the major card networks. \n\nOP has the core business misunderstood.",
        "created_utc": 1599278053,
        "id": "g42wt5z",
        "permalink": "/r/investing/comments/imso9g/the_bull_case_for_square_a_top_100_stock/g42wt5z/",
        "score": 18,
        "subreddit": "investing",
        "created": 1599306853.0
    },
    {
        "author": "Ready2gambleboomer",
        "body": "Some of the retards on this board should start here.  :)\n\nWhat is a stock?  \n\n [https://www.youtube.com/watch?v=5Xzl-Ej2vHQ&amp;t=2s](https://www.youtube.com/watch?v=5Xzl-Ej2vHQ&amp;t=2s)",
        "created_utc": 1600376242,
        "id": "g5mrn2q",
        "permalink": "/r/wallstreetbets/comments/iurwa7/live_footage_of_wsb_bulls_right_now/g5mrn2q/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1600405042.0
    },
    {
        "author": "RogueJello",
        "body": "Apple isn't really relevant to this discussion, since their license to ARM is guaranteed.  Rather this is much more about Intel v Nvidia.  Intel has been focusing on improving their GPUs, NVidia is about to start focusing on their CPUs.",
        "created_utc": 1600217214,
        "id": "g5f8cbc",
        "permalink": "/r/SecurityAnalysis/comments/itfa8k/nvidias_integration_dreams/g5f8cbc/",
        "score": 17,
        "subreddit": "SecurityAnalysis",
        "created": 1600246014.0
    },
    {
        "author": "Gatorm8",
        "body": "I remember when my robinhood had over 25k.... and then the “V shaped recovery” actually happened.",
        "created_utc": 1599858475,
        "id": "g4v5yew",
        "permalink": "/r/wallstreetbets/comments/iqzauz/did_i_get_the_new_high_score/g4v5yew/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1599887275.0
    },
    {
        "author": "7thAccountDontDelete",
        "body": "MSFT BRKB DIS V HD \n\nCall me a boomer",
        "created_utc": 1600135257,
        "id": "g5bbfxz",
        "permalink": "/r/stocks/comments/isyhvx/if_you_can_only_choose_5_companies_to_buy_and/g5bbfxz/",
        "score": 17,
        "subreddit": "stocks",
        "created": 1600164057.0
    },
    {
        "author": "PutsTookMyMoney",
        "body": "Lol imagine thinking this will v shape. This will open red for sure",
        "created_utc": 1600310308,
        "id": "g5jkuo2",
        "permalink": "/r/wallstreetbets/comments/iu3i05/what_are_your_moves_tomorrow_september_17_2020/g5jkuo2/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1600339108.0
    },
    {
        "author": "drrbillionaire",
        "body": "I demand a v shape recovery back to where we started this month",
        "created_utc": 1600310466,
        "id": "g5jl7b3",
        "permalink": "/r/wallstreetbets/comments/iu3i05/what_are_your_moves_tomorrow_september_17_2020/g5jl7b3/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1600339266.0
    },
    {
        "author": "Ijustquaffed",
        "body": "Incoming v shape. Green by morning",
        "created_utc": 1600314226,
        "id": "g5jsp5z",
        "permalink": "/r/wallstreetbets/comments/iu3i05/what_are_your_moves_tomorrow_september_17_2020/g5jsp5z/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1600343026.0
    },
    {
        "author": "Ijustquaffed",
        "body": "V A L E\n\nA\n\nL\n\nE",
        "created_utc": 1600811780,
        "id": "g69b28k",
        "permalink": "/r/wallstreetbets/comments/ixv5mz/what_are_your_moves_tomorrow_september_23_2020/g69b28k/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1600840580.0
    },
    {
        "author": "skateordie444",
        "body": "[https://www.youtube.com/watch?v=SD7sw0bf1ms](https://www.youtube.com/watch?v=SD7sw0bf1ms)",
        "created_utc": 1600030770,
        "id": "g55u7vn",
        "permalink": "/r/RobinHood/comments/is408s/why_does_is_say_my_return_is_124_dollars_but_i/g55u7vn/",
        "score": 16,
        "subreddit": "RobinHood",
        "created": 1600059570.0
    },
    {
        "author": "decjr06",
        "body": "V-Shaped recovery from the great crash of September 2020",
        "created_utc": 1600048261,
        "id": "g56uory",
        "permalink": "/r/wallstreetbets/comments/is5mrk/what_are_your_moves_tomorrow_september_14_2020/g56uory/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1600077061.0
    },
    {
        "author": "PoliticsRealityTV",
        "body": "Everyone who wants to see your stock on German markets, just type the name:Xetra into google and click the bloomberg link. E.g. typing Apple:Xetra gets you [https://www.bloomberg.com/quote/APC:GR](https://www.youtube.com/watch?v=Rtqkxkt7Hyg)",
        "created_utc": 1600067216,
        "id": "g57kdsq",
        "permalink": "/r/wallstreetbets/comments/is5mrk/what_are_your_moves_tomorrow_september_14_2020/g57kdsq/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1600096016.0
    },
    {
        "author": "Souskei",
        "body": "No one wanted 65.. \n\nIt’s like having 3 taco shops in a row. But there’s  lines on the outer 2. Hence they the food must be better. Hence people will flock to those. The one in the middle is empty so no one goes there’s cuz it’s probably gross. \n\nOP is the owner of the middle taco shop. \n\nMoral? Check V and OI too when you check your Greeks. Which you do, right? \n\nOf course you do. We’re all professionals here.",
        "created_utc": 1601352550,
        "id": "g711xhj",
        "permalink": "/r/wallstreetbets/comments/j1rtfo/sandwiched_between_1000s_gains/g711xhj/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601381350.0
    },
    {
        "author": "nebuloushazybull",
        "body": "Stonk Wars I: The Phantom Fauci\n\nStonk Wars II: Attack of the Bulls\n\nStonk Wars III: Revenge of the Bears \n\nStonk Wars IV: A New Stimulus\n\nStonk Wars V: The Virus Strikes Back \n\nStonk Wars VI: Return of the Printer \n\n🚀🚀🚀",
        "created_utc": 1599875272,
        "id": "g4w0pl9",
        "permalink": "/r/wallstreetbets/comments/iqy7be/weekend_discussion_thread_for_the_weekend_of/g4w0pl9/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1599904072.0
    },
    {
        "author": "adayofjoy",
        "body": "I'm a bit confused on Buffett's decision to sell MA and V. Financially the next few months will be shaky, but there are strong long-term tailwinds for fintech as we transition to a society that uses less and less paper cash.",
        "created_utc": 1599929902,
        "id": "g4y445c",
        "permalink": "/r/stocks/comments/irayy6/buffett_sells_100000_bank_shares_and_increases/g4y445c/",
        "score": 15,
        "subreddit": "stocks",
        "created": 1599958702.0
    },
    {
        "author": "FlyersTime",
        "body": "JUST GIVE US A V FUCKING SHAPE RECOVERY BEFORE I START THROWING MY OWN SHIT",
        "created_utc": 1599158705,
        "id": "g3vuo43",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3vuo43/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1599187505.0
    },
    {
        "author": "macgamutmac",
        "body": "The great debate of 2020.\nTrump v Wallace",
        "created_utc": 1601431680,
        "id": "g74qn47",
        "permalink": "/r/wallstreetbets/comments/j272rv/what_are_your_moves_tomorrow_september_30_2020/g74qn47/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601460480.0
    },
    {
        "author": "hugh_dickinson",
        "body": "You all fuckers never traded TSLA when it was at the REAL $500. V shape patterns like what you just saw happen all the time before it went up to 1500",
        "created_utc": 1599064035,
        "id": "g3qhy34",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qhy34/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1599092835.0
    },
    {
        "author": "Flakmaster92",
        "body": "ARM does have competition in the form of RISC-V. Honestly, if Nvidia mis-manages ARM then that could be the boost that RISC-V needs for further adoption. \n\nThe ARM ISA is important today, but it’s not critical long term, and it’s not without competition waiting in the wings.",
        "created_utc": 1600052525,
        "id": "g571n3i",
        "permalink": "/r/investing/comments/is9bz1/nvidia_to_buy_arm_holdings_from_softbank_for_40/g571n3i/",
        "score": 14,
        "subreddit": "investing",
        "created": 1600081325.0
    },
    {
        "author": "PoliticsRealityTV",
        "body": "Tesla +3% [(Xetra)](https://www.bloomberg.com/quote/TL0:GR)\nNvidia +5% [(Xetra)](https://www.bloomberg.com/quote/NVD:GR)\nFedex +2.7% [(Xetra)](https://www.bloomberg.com/quote/FDX:GR)\nApple +3% [(Xetra)](https://www.youtube.com/watch?v=Rtqkxkt7Hyg)",
        "created_utc": 1600065507,
        "id": "g57in10",
        "permalink": "/r/wallstreetbets/comments/is5mrk/what_are_your_moves_tomorrow_september_14_2020/g57in10/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1600094307.0
    },
    {
        "author": "yachtsandthots",
        "body": "V-shaped recovery coming straight up your asshole",
        "created_utc": 1600304756,
        "id": "g5j9hpl",
        "permalink": "/r/wallstreetbets/comments/iu3i05/what_are_your_moves_tomorrow_september_17_2020/g5j9hpl/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1600333556.0
    },
    {
        "author": "mPiR_3dot1415",
        "body": "Trevor watched this guy: \n\n[Turbo Encabulator](https://www.youtube.com/watch?v=rLDgQg6bq7o)\n\n&gt;*For a number of years now, work has  been proceeding in order to bring perfection to the crudely conceived  idea of a transmission that would not only supply inverse reactive  current for use in unilateral phase detractors, but would also be  capable of automatically synchronizing cardinal grammeters. Such an  instrument is the turbo encabulator.*  \n&gt;  \n&gt;*Now basically the only new principle  involved is that instead of power being generated by the relative motion  of conductors and fluxes, it is produced by the modial interaction of  magneto-reluctance and capacitive diractance.*  \n&gt;  \n&gt;*The original machine had a base plate  of pre-famulated amulite surmounted by a malleable logarithmic casing  in such a way that the two spurving bearings were in a direct line with  the panametric fan. The latter consisted simply of six hydrocoptic  marzlevanes, so fitted to the ambifacient lunar waneshaft that side  fumbling was effectively prevented.*  \n&gt;  \n&gt;*The main winding was of the normal  lotus-o-delta type placed in panendermic semi-boloid slots of the  stator, every seventh conductor being connected by a non-reversible  tremie pipe to the differential girdle spring on the “up” end of the  grammeters.*  \n&gt;  \n&gt;*The turbo-encabulator has now reached  a high level of development, and it’s being successfully used in the  operation of novertrunnions. Moreover, whenever a forescent skor motion  is required, it may also be employed in conjunction with a drawn  reciprocation dingle arm, to reduce sinusoidal repleneration.”*",
        "created_utc": 1600307241,
        "id": "g5jefop",
        "permalink": "/r/wallstreetbets/comments/iu4nsy/html_5_supercomputer_will_save_trevor_and_nkla/g5jefop/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1600336041.0
    },
    {
        "author": "FinndBors",
        "body": "He’s a broken clock. The only thing that’s golden about him is that CNBC (edit: maybe FOX) interview with him back in 2007 or 2006, which I fully admit was really entertaining and on point. He’s been milking that interview prediction forever.\n\nEdit: here are some of the videos, for some reason I can't find the original:\n\nCuts from interview with Art Laffer (Laffer Curve, Regan economic advisor) https://www.youtube.com/watch?v=lYkFYdLTTw8\n\nThere's another with these real estate guys that were laughing at him, but I can't find the full clip https://www.youtube.com/watch?v=sgRGBNekFIw (starts at around 2:40). It's somewhere on fox.",
        "created_utc": 1600566512,
        "id": "g5wkuky",
        "permalink": "/r/investing/comments/iw2vke/thoughts_on_peter_schiffs_ideas/g5wkuky/",
        "score": 14,
        "subreddit": "investing",
        "created": 1600595312.0
    },
    {
        "author": "Roach_Coach_Bangbus",
        "body": "Just a reminder that SPACs aren't for the faint hearted. If you want stability go buy ETF's or some Visa stock. The more risk the more reward and sometimes the ball doesn't bounce your way.",
        "created_utc": 1601507336,
        "id": "g78b4jx",
        "permalink": "/r/SPACs/comments/j1gfny/weekly_discussion_september_28th_october_4th/g78b4jx/",
        "score": 14,
        "subreddit": "SPACs",
        "created": 1601536136.0
    },
    {
        "author": "yachtsandthots",
        "body": "That quite a dip you got going there. \n\nI would hate for it to...V-shape recover",
        "created_utc": 1599613508,
        "id": "g4i2fvl",
        "permalink": "/r/wallstreetbets/comments/ip118i/what_are_your_moves_tomorrow_september_09_2020/g4i2fvl/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1599642308.0
    },
    {
        "author": "ComplexLock",
        "body": "**WHO WANTS A V-SHAPED RECOVERY RAISE YOUR HANDS**\n\n🤚",
        "created_utc": 1599153323,
        "id": "g3ve5d9",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3ve5d9/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1599182123.0
    },
    {
        "author": "cranial_pudding",
        "body": "S T E V E \n\nM A D D E N",
        "created_utc": 1601167427,
        "id": "g6r5pyw",
        "permalink": "/r/wallstreetbets/comments/j0gmep/sec_when_they_visit_our_future_building_in/g6r5pyw/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1601196227.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "fuck. i went all in and bought spy puts for a huge discount early in the morning. couldve recouped all my losses from my tech calls if i held, but i sold when i was only up 10% expecting a shitty V shaped recovery. if i held i wouldve double on those spy puts and recouped my losses for the day. instead i sold, and tried to daytrade spy calls/spy puts, and then lost even more. fuck me",
        "created_utc": 1599192707,
        "id": "g3y3ov7",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3y3ov7/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1599221507.0
    },
    {
        "author": "nafinmasjid",
        "body": "Rip v shaped recovery: March 23rd - September 2nd",
        "created_utc": 1600471330,
        "id": "g5r8cq3",
        "permalink": "/r/wallstreetbets/comments/ivdifw/weekend_discussion_thread_for_the_weekend_of/g5r8cq3/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1600500130.0
    },
    {
        "author": "dudeitsadell",
        "body": "Fundamentals? It has more cash on hand than most companies (and continues to grow). What fundamentals do you want? P/B is 13, Visa is 13, Coke is 13, Apple is 28, TSLA is 40... PTON is trading relative to Visa/Coke valuations which is arguably undervalued given their growth this year &amp; historically their best quarter is coming. P/S, P/C blah blah, PTON is undervalued compared to dying boomer companies who are waiting out the COVID era. Theres no fundamental you can point to that says PTON is overvalued other than \"$28b is a lot for a exercise bike\" which is boomer DD. $1b doesnt mean jack shit anymore\n\nCoupled along with the fact that it actually decreased its ad spending to 0 for the last quarter &amp; decreased the price of its main seller last week. Along with that they introduced refurbished bikes to further lower the entry cost. Their digital app paid subscriptions are at an all time high &amp; not only that, number of workouts per paid user is at an all time high. People are not only buying these things, but using them and theyre realizing the growth is in subscriptions, not hardware sales. Theres a lot to be optimistic about with peloton and definitely deserves to be priced as a growth company. If you're looking for P/Es and P/S then stick to REITs.",
        "created_utc": 1600119190,
        "id": "g5aeoi5",
        "permalink": "/r/wallstreetbets/comments/ist4l6/pton_will_rise_to_100_soon_and_beyond_prove_im/g5aeoi5/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1600147990.0
    },
    {
        "author": "high_side",
        "body": "    EXECUTING SENTIMENT ANALYSIS...\n    SENTIMENT: BEARISH\n    OP: LOST DICK TO V RECOVERY\n    ACTION: INVERSE OP, NKLA 0X69C 09/25, FUCK OP'S WIFE",
        "created_utc": 1600286287,
        "id": "g5i6r4h",
        "permalink": "/r/wallstreetbets/comments/ityxrp/bulls_are_about_to_have_their_dicks_ripped_off/g5i6r4h/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1600315087.0
    },
    {
        "author": "misterjefe83",
        "body": "what i think is gonna happen based on what has happened every time since march.\n\n- we open and just rip and V back up, sorry no chance to \"buy the dip\" or whatever.  bears get ripped a new asshole and never buy puts again for extended periods.\n\n- we open and tank as people get out of their bags, bears claim early victory.  dip buyers pump it up, but it's a fake bounce, bears reload like idiots and we drop again but develop some support.  bears keep claiming next leg down, people scared to buy (this is when you should buy), theta gang rules.  next week we go back into shrek dick rally, destroy the bulls who turned bear and we welcome another new class of idiots in the next few weeks.",
        "created_utc": 1599210071,
        "id": "g3ynhx6",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3ynhx6/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1599238871.0
    },
    {
        "author": "Jaecer",
        "body": "[https://www.youtube.com/watch?v=8qcbJbS106w](https://www.youtube.com/watch?v=8qcbJbS106w)   \n\ngo to 47:45",
        "created_utc": 1599258248,
        "id": "g41xbhr",
        "permalink": "/r/wallstreetbets/comments/impkrk/donald_pump_said_gdp_in_3rd_quarter_and_other/g41xbhr/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1599287048.0
    },
    {
        "author": "gabesmith63",
        "body": "Bought a Put on Tesla everyone prepare for biggest V shaped recovery ever seen and load up on calls and shares",
        "created_utc": 1599586610,
        "id": "g4gld4u",
        "permalink": "/r/wallstreetbets/comments/ioqzpq/daily_discussion_thread_for_september_08_2020/g4gld4u/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1599615410.0
    },
    {
        "author": "___alexa___",
        "body": "ɴᴏᴡ ᴘʟᴀʏɪɴɢ: [LMFAO - Sexy and I Know It  ](https://www.youtube.com/watch?v=wyx6JDQCslE) ─────────⚪───── ◄◄⠀[▶](https://www.youtube.com/watch?v=wyx6JDQCslE)⠀►►⠀ 2:16 / 3:24 ⠀ ───○ 🔊 ᴴᴰ ⚙️",
        "created_utc": 1600315767,
        "id": "g5jvqew",
        "permalink": "/r/wallstreetbets/comments/iu3i05/what_are_your_moves_tomorrow_september_17_2020/g5jvqew/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1600344567.0
    },
    {
        "author": "FAKEZAIUS",
        "body": "You were supposed to V. YOU WERE SUPPOSED TO V.",
        "created_utc": 1599592903,
        "id": "g4gxx3o",
        "permalink": "/r/wallstreetbets/comments/ioqzpq/daily_discussion_thread_for_september_08_2020/g4gxx3o/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1599621703.0
    },
    {
        "author": "MrDaleWiggles",
        "body": "I've got a luscious V of hair going from my chest pubes down to my ball-fro",
        "created_utc": 1600020727,
        "id": "g5524wd",
        "permalink": "/r/wallstreetbets/comments/irx4y6/she_says_its_for_luck/g5524wd/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1600049527.0
    },
    {
        "author": "Turd_nugget88",
        "body": "Not sure what ticker you're talking about, do you mean $V🅰️LE?",
        "created_utc": 1600442502,
        "id": "g5pk0m3",
        "permalink": "/r/wallstreetbets/comments/iv7lhx/vale_gang_trailer/g5pk0m3/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1600471302.0
    },
    {
        "author": "PoloValentino",
        "body": "Why is everyone so bearish in here. Pull back is fine and powell has made v clear they will pump this till the cows come home. Chill.",
        "created_utc": 1599502133,
        "id": "g4cx5li",
        "permalink": "/r/wallstreetbets/comments/io4y60/daily_discussion_thread_for_september_07_2020/g4cx5li/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599530933.0
    },
    {
        "author": "AgrivatedLemon",
        "body": "Strictly for a 20yr time frame, for safe picks:\n\nAAPL, AMZN, WM, V, DIS, COST, NVDA, and ETFs that track the S&amp;P500\n\nRiskier picks at a 20yr time frame:\n\nTSLA, SQ, TMUS, DKNG, ADBE, SPOT",
        "created_utc": 1600195701,
        "id": "g5dxqxp",
        "permalink": "/r/stocks/comments/itdr15/best_20_year_holds/g5dxqxp/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1600224501.0
    },
    {
        "author": "WhoaReddit77",
        "body": "Cheers to a V shaped recovery bro.",
        "created_utc": 1600478698,
        "id": "g5rlwfm",
        "permalink": "/r/wallstreetbets/comments/ivdifw/weekend_discussion_thread_for_the_weekend_of/g5rlwfm/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600507498.0
    },
    {
        "author": "mogki_millions",
        "body": "This also happens at bigger well known tech companies.  \nIt is highly dependent on the department and role.  \n\n\nFor instance, I don't think it would happen in an app dev role, but for systems architect role it does (personal experience, Apple did this to me).\n\nI've had colleagues interview on-site at Google for the same role.  \nThey'd bring them in for 4-5 hour interviews (without even having the decency of providing a lunch break).\n\nThis typically happens b/c they're too cheap to pay for a true professional, or they already have someone lined up for hire (typically based on visa status (or lack thereof) and ethnicity (I'm not playing victim here, but you'd be a fool not to recognize it and act accordingly).\n\nAccenture and some other consulting firms are the big abusers of this tactic.  \nThey like to give 'case studies' for an interview where you white board a design or pseudo-code a solution. \n\nTL, DL: Don't be a fool and work or give your knowledge for free.  \n\n\nSource: a consummate software professional who left the corporate world to forge his own path. I now make more than most FAANG employees (total compensation) and hate to see people get taken advantage of.",
        "created_utc": 1600533548,
        "id": "g5tyean",
        "permalink": "/r/wallstreetbets/comments/ivld6q/the_audacity_to_say_that_yoloing_weekly_calls_on/g5tyean/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600562348.0
    },
    {
        "author": "AngryDingo",
        "body": "How sick would it be if we V shape into yesterday's highs",
        "created_utc": 1599179389,
        "id": "g3xgkip",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xgkip/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599208189.0
    },
    {
        "author": "ComfortableComa",
        "body": "Your tech heavy. That is doable, however know your exposed here and if Tech ETF is down heavy-so will you be. Consider making some placements spread out to different sectors, finacial should be in there for example. I have been taking position in BAC for banking\nAnd either Visa or Paypal for another pairing with BAC. \nBAC has been really cleaning up thier books and setting up for long term sucess precovid, post covid, you have buffet giving it attention amd some $. If you watch the headline you can see Buffet is shifting his portfolio. I dont always like his picks honestly. 50/50 at best but BAC will be a great risk to reward ratio on placing money in a longer term asset(aka Buffets M.O.) specifically in the financial sector. Paypal could deflate most but could also inflate in price most in my opinion. \n\nConsumer. Get one at least. Every suggests the \"this\" version of amazon. Stick with Amazon. Jeff Bezos isnt running those knock of Amazons. Pick Amazon if you like amazon. In lomg term portfolio management you need to care about your companies leadership. Im day trading you dont even need to care about what ticker tag you are trading. \nAmazon. Nuff said. \n\nI would take a 50/50 split of AMD, and Nvidia right now to cover semiconductors. \n(Your already heavy tech or id do full positions in both)\n\nIf you do a consumer defense stock, id do walmart. They are pishing thier ecommerce and puttting thier leadership equity into that direction. I think they see Amazon and know what needs to happen to survive if a new commerce age comes. Great Amazon pairing to, as if one drops the other may get an increase due to thier respective market share. \n\nIf you are not going to manage yoyr portfolio a few times a week I wouldnt get any more in depth than that. \n\nSplit picks into secotrs and you account will take sharp downswing less often. More important to keep your money than to make alot. If you cannot keep what you make you will only borrow it mistakenly thinking you had ownership.",
        "created_utc": 1599975793,
        "id": "g51vvv6",
        "permalink": "/r/stocks/comments/irqmh0/will_have_50k_to_invest_by_the_end_of_the_year/g51vvv6/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1600004593.0
    },
    {
        "author": "wanderinhebrew",
        "body": "[When the ship ports in Jamaica](https://www.youtube.com/watch?v=j9V78UbdzWI)",
        "created_utc": 1601436662,
        "id": "g74zxvl",
        "permalink": "/r/wallstreetbets/comments/j2eh2l/cdc_director_overruled_on_cruise_ship_ban_ccl/g74zxvl/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1601465462.0
    },
    {
        "author": "monkeybizwak",
        "body": "&gt;rayner teo on YouTube\n\nthis is more like a starting point---&gt;\n\n[https://www.youtube.com/watch?v=xE3Vb4R6hpM](https://www.youtube.com/watch?v=xE3Vb4R6hpM)",
        "created_utc": 1600235437,
        "id": "g5g2nug",
        "permalink": "/r/wallstreetbets/comments/ithf9j/24k_10k_daddy_elon_delivers_in_the_clutch/g5g2nug/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600264237.0
    },
    {
        "author": "4thlineorangepeeler",
        "body": "If Pelosi is president that means more IPOs and Visa will moon. I’m ok with that.",
        "created_utc": 1600475033,
        "id": "g5rf2pd",
        "permalink": "/r/wallstreetbets/comments/ivdifw/weekend_discussion_thread_for_the_weekend_of/g5rf2pd/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600503833.0
    },
    {
        "author": "chewks",
        "body": "this reminds me of march, when all of WSB started saying puts were free money.. and then BAM V SHAPE, and made our generation of bears orphans. I can also be wrong and we continue to dip fucking hard until next week. SPY 300 PUT.",
        "created_utc": 1599190623,
        "id": "g3y0ez0",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3y0ez0/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599219423.0
    },
    {
        "author": "LiviuDragneaOfficial",
        "body": "You guys got anymore of that V shape recovery?",
        "created_utc": 1599594096,
        "id": "g4h0c3o",
        "permalink": "/r/wallstreetbets/comments/ioqzpq/daily_discussion_thread_for_september_08_2020/g4h0c3o/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599622896.0
    },
    {
        "author": "StuGats",
        "body": "Microsoft lost their antitrust case re: internet explorer back in 2001:\n\n&gt;United States v. Microsoft Corporation, 253 F.3d 34 (D.C. Cir. 2001),[1] was a noted American antitrust law case in which the U.S. government accused Microsoft of illegally maintaining its monopoly position in the PC market primarily through the legal and technical restrictions it put on the abilities of PC manufacturers (OEMs) and users to uninstall Internet Explorer and use other programs such as Netscape and Java. At trial, the district court ruled that Microsoft's actions constituted unlawful monopolization under Section 2 of the Sherman Antitrust Act of 1890, and the U.S. Court of Appeals for the D.C. Circuit affirmed most of the district court's judgments.\n\nhttps://en.m.wikipedia.org/wiki/United_States_v._Microsoft_Corp",
        "created_utc": 1599164348,
        "id": "g3wb95c",
        "permalink": "/r/investing/comments/im0w0x/goog_justice_dept_plans_to_file_antitrust_charges/g3wb95c/",
        "score": 12,
        "subreddit": "investing",
        "created": 1599193148.0
    },
    {
        "author": "Nope______________",
        "body": "This is one of the first guys I seen call out these “professional investors”. Fuckin hilarious too, these CNBC shills didn’t even know how to react. RH users don’t move the market they just ride they waves to tendie town\n\n\nhttps://m.youtube.com/watch?v=u2PHy5h0geQ",
        "created_utc": 1599166251,
        "id": "g3wgutw",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3wgutw/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599195051.0
    },
    {
        "author": "bottledfart_tv",
        "body": "Wsb lingo starter kit:\n\n“Circuit Breaker”\n\n“Next Leg Down”\n\n“🌈🐻 r fuk”\n\n“V shaped recovery”\n\n“This is the top”",
        "created_utc": 1599153431,
        "id": "g3vefdv",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3vefdv/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599182231.0
    },
    {
        "author": "hellolittleman10",
        "body": "A lot of Tech stocks seem like a bubble to me. For example, Zoom has a market cap of $130b and they just announced quarterly earnings of $128m lol. To grow into that market cap they will have to earn a couple billion per quarter in the next year or two. And this is for a video conferencing company lol. What are the barriers to entry to making a video conferencing app? Zero. \n\nJust for reference, visa earns $10b annually, coke $9b, McDonald’s $6b, Disney $9b. Investors buying Zoom today  are gambling idiots lol.\n\nAlso, Tesla skyrockets on splitting the shares lol. Lots of speculation today. I think we will have a tech bust sometime next year. Stay clear of it or gamble away. Cheers",
        "created_utc": 1599001466,
        "id": "g3njxt0",
        "permalink": "/r/CanadianInvestor/comments/ikncba/the_last_time_i_had_this_many_inquiries_it_was/g3njxt0/",
        "score": 12,
        "subreddit": "CanadianInvestor",
        "created": 1599030266.0
    },
    {
        "author": "LehmanParty",
        "body": "Hey buddies I'm going to watch the 2016 first debate [Here](https://www.youtube.com/watch?v=855Am6ovK7s) to get some scope on what we watched today and see how much has changed and what the market did after the remarks said then. I should have done that earlier, but better late than never. I'll report back in 90 minutes or so as a new post.",
        "created_utc": 1601438518,
        "id": "g752xrh",
        "permalink": "/r/wallstreetbets/comments/j272rv/what_are_your_moves_tomorrow_september_30_2020/g752xrh/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1601467318.0
    },
    {
        "author": "tendeeznuts",
        "body": "Labor Day V-EEKEND",
        "created_utc": 1599246962,
        "id": "g410btg",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g410btg/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599275762.0
    },
    {
        "author": "abogado-de-aves",
        "body": "bEaRiSh cLoSe, lOoK oUt BeLoW!!1!!1\n\nV SHAPE CONFIRMED\n\nCHAD BULLS WE DID IT, WE WIN AGAIN 🤙😎🇺🇸🦅🚀🚀🚀",
        "created_utc": 1599683112,
        "id": "g4kyou1",
        "permalink": "/r/wallstreetbets/comments/ipnztr/what_are_your_moves_tomorrow_september_10_2020/g4kyou1/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599711912.0
    },
    {
        "author": "Stock-Driver226",
        "body": "[I love that movie.](https://www.youtube.com/watch?v=SjbPi00k_ME&amp;disable_polymer=true)",
        "created_utc": 1600651141,
        "id": "g61yeyk",
        "permalink": "/r/stocks/comments/iwna6l/leak_reveals_2tn_of_possibly_corrupt_us_financial/g61yeyk/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1600679941.0
    },
    {
        "author": "kaywiz",
        "body": "V shaped recovery on Gostkowski's leg",
        "created_utc": 1600147399,
        "id": "g5bukng",
        "permalink": "/r/wallstreetbets/comments/issvr0/what_are_your_moves_tomorrow_september_15_2020/g5bukng/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600176199.0
    },
    {
        "author": "Ready2gambleboomer",
        "body": "Do NOT ban.  These commercials are the bomb.  I like this one the best.\n\n [https://www.youtube.com/watch?v=xhhEdDNWl6I](https://www.youtube.com/watch?v=xhhEdDNWl6I)",
        "created_utc": 1600375615,
        "id": "g5mpxlb",
        "permalink": "/r/wallstreetbets/comments/iurwa7/live_footage_of_wsb_bulls_right_now/g5mpxlb/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600404415.0
    },
    {
        "author": "Madchillhouse",
        "body": "Please be a V shaped recovery. Please be a V shaped recovery. Please be a V shaped recovery.",
        "created_utc": 1599147815,
        "id": "g3uz322",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3uz322/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599176615.0
    },
    {
        "author": "tfogg2",
        "body": "V bad math",
        "created_utc": 1600637288,
        "id": "g61672e",
        "permalink": "/r/wallstreetbets/comments/iwl5kb/what_are_your_moves_tomorrow_september_21_2020/g61672e/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600666088.0
    },
    {
        "author": "scopolamine",
        "body": "&gt;One of Donald Trump’s top economic advisers has claimed that the US economy is still enjoying a V-shaped recovery from the pandemic. - Bloomberg\n\nThese kind of remarks are making me very angry. What fucking kind of V shape recovery?\n\nUnemployment is still at record levels. Businesses are vanishing in huge numbers, small businesses are fucked for long. Bankruptcies are going higher each month. Much of the economy is on life support. Global trade and investment are collapsing. World-wide economy is looking at the possibility of a long-lasting depression.\n\nWhat V shape recovery? Fed's printers saved the bank accounts of Senate, House and top 1% with a V shape for sure but the rest is still struggling. For fuck's sake.",
        "created_utc": 1601390973,
        "id": "g72ctpu",
        "permalink": "/r/wallstreetbets/comments/j1whna/daily_discussion_thread_for_september_29_2020/g72ctpu/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1601419773.0
    },
    {
        "author": "msimp000",
        "body": "Anybody got anymore of that v-shape recovery?",
        "created_utc": 1599176260,
        "id": "g3x8xgm",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3x8xgm/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599205060.0
    },
    {
        "author": "TH3PhilipJFry",
        "body": "**N** V D A\n\nN **V** D A\n\nN V **D** A\n\nN V D **A**",
        "created_utc": 1598991387,
        "id": "g3mwrm4",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3mwrm4/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599020187.0
    }
]