[
    {
        "author": "damanamathos",
        "body": "Zoom is my biggest position.\n\nThe security concerns are overdone which is why large enterprises like Walmart and Nasdaq and Autodesk and AB InBev continue to use them.\n\nIt's why listed company CEOs are coming out to publicly defend Zoom -- here are [Equinix](https://twitter.com/Equinix/status/1249146616247922689), [HubSpot](https://twitter.com/bhalligan/status/1248688101091872775), [PagerDuty](https://twitter.com/pagerduty/status/1248697090743644160), and [Five9](https://medium.com/@rowantrollope/beyond-the-noise-7-reasons-its-safe-to-run-zoom-9a2e639b13ec).\n\nIt's why when Zoom announced their [CISO Council and Advisory Board](https://blog.zoom.us/wordpress/2020/04/08/update-on-zoom-90-day-plan-to-bolster-key-privacy-and-security-initiatives/) last week, CISOs from VMware, Netflix, Uber, and Electronic Arts agreed to join the Advisory Board that personally advises Eric Yuan, Zoom's CEO.\n\nIt's why [Alex Stamos agreed to join as a consultant](https://medium.com/@alexstamos/working-on-security-and-safety-with-zoom-2f61f197cb34). Alex is Facebook's Chief Security Officer, [known for](https://9to5mac.com/2020/04/09/zoom-security-advisory-council/) disagreeing with Facebook's privacy policy, challenging the NSA on encryption backdoors, discovering vulnerabilities in MacOS, and being an expert witness in digital privacy matters for Google and the Electronic Frontier Foundation.\n\nOn China in particular, yes, as they were dealing with the growth from 10 million users to 200 million users of a couple months they did misconfigure some new Chinese servers so that some US users did use them when US servers were full. Normally China is geofenced so US users never use them. To understand the extent of this error, on the 1st of April there were 37 participants in the US that went through servers in China out of 233 million participants worldwide that day. All 5 US servers had to return no response for this to happen, so it was very rare, and it's now fixed.\n\nIn terms of customers dropping them, the vast majority of the ones you mention are companies that never implemented Zoom in a top-down way and are responding to employees using it. A company wanting employees to not use software that hasn't been vetted seems reasonable to me.\n\nI've spoken to a number of large multinational enterprise customers who use Zoom and they seem comfortable, think the press reports are overdone, and think Zoom's response has been good. That's one reason I'm comfortable being long.",
        "created_utc": 1586682929,
        "id": "fn60qwh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586711729.0
    }
]