[
    {
        "author": "Capital_Losses",
        "body": "You know what? In all the MA talk, I forgot to mention, GPN in place of SQ on your list :) \n\nSomething else to look into.",
        "created_utc": 1586973804,
        "id": "fni4fuu",
        "permalink": "/r/stocks/comments/g0n90z/cant_decide_between_square_paypal_and_visa/fni4fuu/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1587002604.0
    },
    {
        "author": "yo_skank",
        "body": "Like dfs, wouldn't touch pxd or gpn personally",
        "created_utc": 1587401144,
        "id": "fnzuu3y",
        "permalink": "/r/stocks/comments/g4vn4p/thoughts_on_these_stocks/fnzuu3y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587429944.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"PXD, DFS, GPN, and XRAY\"\n\nNo; would rather AXP or better yet V/MA; good company but a decent amount of small/medium business exposure, no.",
        "created_utc": 1587383012,
        "id": "fnz177s",
        "permalink": "/r/investing/comments/g46p00/daily_advice_thread_all_basic_help_or_advice/fnz177s/",
        "score": 1,
        "subreddit": "investing",
        "created": 1587411812.0
    },
    {
        "author": "Ry-Fi",
        "body": "Yes, Visa is open loop, meaning they are just a processor. They don't own the relationship with the merchant nor are they issuing bank. They partner with banks who issue the cards and just act as the connecting rails processing transactions between card holders, merchants, and the banks that provide credit on behalf of the card holder. MasterCard is the same model. Neither takes credit risk as a result as both are strictly operating more or less as a toll booth as transactions flow through their network. \n\nDiscover and AMEX are closed loop. They own the merchant relationship (at least traditionally, this has changed recently), provide the \"rails\" to process transactions, AND have a captive bank that issues the cards and fronts money on behalf of card holders to merchants when they swipe. This is why AMEX &amp; discover fees are higher than Visa cards, because they're charging fees for the whole loop, whereas Visa is just charging for interchange fees. But when a merchant takes a visa they more or less end up paying the same fees just to different middle men companies along the way, such as a separate fee to the merchant acquior (like a Global Payments or EVO Payments who owns the merchant relationship), then pay the interchange to Visa/MasterCard, then pay a fee to the issuing bank (Wells Fargo, baml, etc). Amex bundles it all into one fee more or less, but still typically charges more than even the aggregated fees charged to run throu visa, but justify it by saying amex customers tend to spend more per transaction which benefits the merchant despite the higher fees.",
        "created_utc": 1587769850,
        "id": "fohp0dk",
        "permalink": "/r/investing/comments/g77gbn/american_express_increases_its_reserves_for/fohp0dk/",
        "score": 1,
        "subreddit": "investing",
        "created": 1587798650.0
    },
    {
        "author": "super-mega",
        "body": "$GPN",
        "created_utc": 1586069748,
        "id": "fmh7x5c",
        "permalink": "/r/stocks/comments/fv7ilq/best_stocks_for_the_electronic_payment_methods/fmh7x5c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586098548.0
    },
    {
        "author": "Eur0step",
        "body": "Any thoughts on PXD, DFS, GPN, and XRAY? All have been hit pretty hard and I'm tempted to throw cash into them...",
        "created_utc": 1587361382,
        "id": "fnyfaqm",
        "permalink": "/r/investing/comments/g46p00/daily_advice_thread_all_basic_help_or_advice/fnyfaqm/",
        "score": 1,
        "subreddit": "investing",
        "created": 1587390182.0
    },
    {
        "author": "MrKhutz",
        "body": "Not a bad set of companies, the numbers look good. Way better selections than most people who post as new investors pick! Decent balance sheets. DFS and GPN are in fairly similar lines of business so you might want to keep that in mind in terms of diversification. Are they safe? Who knows, though at least they have a decent balance sheet. Financials and energy are at risk sectors though.  XRAY seems like one of the more resistant to a downturn.",
        "created_utc": 1587360237,
        "id": "fnydvty",
        "permalink": "/r/stocks/comments/g4miqm/are_these_stocks_safe/fnydvty/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587389037.0
    },
    {
        "author": "SorrowsSkills",
        "body": "Never heard anyone else mention GPN before, interesting. I'll look into it.",
        "created_utc": 1586974233,
        "id": "fni5bcl",
        "permalink": "/r/stocks/comments/g0n90z/cant_decide_between_square_paypal_and_visa/fni5bcl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1587003033.0
    },
    {
        "author": "Psypriest",
        "body": "Think Equifax, some disney Disney, global payments, some BCBs, netflix has some presence in gcloud too",
        "created_utc": 1587021706,
        "id": "fnkc75d",
        "permalink": "/r/wallstreetbets/comments/g25e1l/alphabet_ceo_tells_employees_the_company_will/fnkc75d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587050506.0
    }
]