[
    {
        "author": "LABigAus",
        "body": "Demand was pulled forward due to supply uncertainty, Chinese competitors supported by government (uneconomic) coming online. Slightest price increase in Dram and SK Hynix and Samsung are producing dram in record droves. LRCX said Chinese Dram producers are buying equipment like mad to produce chips for Huawei. This is a very bad sign. \n\nMohnish Pabrai and David Tepper love this because they think it’s deep value, but I would stay away. It can always get cheaper. People betting on the US government coming in to protect Micron from serial dumpers in China are foolish. Look at the Trump administration pulling sanctions on and off of Huawei. They won’t do shit to protect this company. China has a made in 2025 plan for a reason, and the government is out to destroy this company to increase dependence on China. Your basically betting on China not fucking you over by going long this. \n\nGood luck and god speed.",
        "created_utc": 1597805478,
        "id": "g228x3v",
        "score": 11,
        "subreddit": "investing",
        "created": 1597834278.0
    },
    {
        "author": "myNameIsPDT",
        "body": "I wrote a quick program to search for  any company that has the key words \"convalescent\", \"plasma\", or  \"convalescent plasma\" anywhere in the company description, and I was  returned the list of tickers below. Beyond that, I have done no further  analysis. Should be a starting point though. Certainly better than trying to sift through the 7000+ companies in the healthcare sector.\n\n\"A\"      \"ABC\"   \"ADMA\"  \"AEIS\"  \"AGLE\"  \"AMBD\"  \"APYX\"  \"CANOF\" \"CERS\"   \"HAE\"   \"IMGN\"  \"KALV\"  \"LCTX\" \"LOFB\"  \"LRCX\"  \"MKSI\" \"PHRX\"  \"PIRS\"   \"RYAM\"  \"RZLT\" \"TTOO\"",
        "created_utc": 1598214693,
        "id": "g2mdmh4",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598243493.0
    },
    {
        "author": "batmanatee_",
        "body": "Remove LRCX. They're a semiconductor manufacturing company that makes plasma etch.\n\nEdit 1: MKSI is in laser/plasma instruments, so not relevant either.\n\nEdit 2: Also remove AEIS\n\nEdit 3: Remove RYAM\n\nGreat list! Thanks!",
        "created_utc": 1598227943,
        "id": "g2n2vog",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1598256743.0
    },
    {
        "author": "mechtech",
        "body": "I did know exactly when the bottom was down to the hour. Everything was beyond panic and into bewilderment and \"the world is ending\" in a financial sense. For the 2 hours before the very bottom I was looking at valuations and was entirely confused. Everything I was looking at was trading at levels lower than should be possible, even considering the circumstances. At the time I was looking at Capri Holdings and transfixed by its 5 dollar share price. I was also looking at REITs like Welltower and VTR. That's just what I happened to be looking at during the very market bottom. I got a phone call with a \"is the world ending\" question and it just snapped that it was now or never.  A little bit of volume and stability was returning, market makers were finally posting some bids with size in the option level 2, prices started to rise, and I slammed into VTR, Welltower, and CPRI LEAPS. I grabbed shares of Apple near 200, ASML at 193, KLAC, and LRCX as well as before the crash I wanted these companies. Also got Nokia at 2.43 for 5G exposure.\n\nYou won't see how bad it really was on that final day unless you really zoom in on the chart and look at the prices I just typed. For reference, my buy-in to CPRI was 5.97. Unless you're zoomed in you won't even see more than a single candle shadow that low, and it's half the price of what the bottom seems like at first glance. Things were trading for nothing. It was undeniably the bottom for anyone who wasn't in a complete state of shock.\n\nI did see the Fed pump the first trillion live. That was of course the turning point. I actually traded it immediately - I think I was in AAPL at the time, and the Fed pump saved a long I had open. The market actually faded the Fed after an initial pop, because it was confirmation of how bad things must be (the bond market was indeed blowing up).\n\nEvery day after the crash there would be little stories like the birth of the COVID stocks (facemask producers, etc), the start of the stay-at-home trend, etc, so there was always something to do. It felt like running with the pack and was very satisfying to stay on the pulse and understand why everything was doing what it was and where things would rotate next. After a day or two it would be outdated though and you'd have to re-analyze the entire situation, but it was possible to stay ahead of the twists and turns, it wasn't just pure unpredictable chaos.\n\nI do remember the blowoff top before the crash too. I was trading Virgin Galactic on the short side, and going through that was just the final straw. I would drive in my car and listen to this specific part of a song that made me think about the market crashing over and over and over. Every day in my mind when I was trading I called it \"dancing on top of the world\". It was a very odd feeling. Very euphoric, and I had a bear conviction that kept building. It felt like slowly rising up the hill of a roller coaster rather than the parabolic blowoff you see in some stay-at-home tech stocks now. More like the extreme leverage and suppressed volatility (which as we know was a nuclear bomb waiting to go off) was inevitably marching everyone off of a cliff, which it was. As things got more extreme and vol stayed crushed, things got tighter and tighter so that any perturbation would cause increasingly forceful feedback loops just waiting to be broken out of the boundaries. Granted, I was exclusively trading right in the thick of the craziness before the crash so that's what I saw every day for the month before.\n\nEvery morning felt like strapping up to go to WW1 or something. You'd just log in and say \"let's get killed\". Every day traders in the wrong place at the wrong time could just get ripped apart by a mortar out of nowhere. Correlations went to 0 so there was no good way to hide unless you were in cash. I'm probably still coming down from that.",
        "created_utc": 1598656575,
        "id": "g36rgee",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598685375.0
    },
    {
        "author": "Bonerdave",
        "body": "Everyone always mentions the same damn stocks. What about AMAT or LRCX?",
        "created_utc": 1598400539,
        "id": "g2uxavp",
        "score": 2,
        "subreddit": "investing",
        "created": 1598429339.0
    },
    {
        "author": "Organic-Video",
        "body": "LRCX, TSM, and LPL are my go to shares but I only buy shares in my roth, or what I call the boring portfolio.",
        "created_utc": 1597111388,
        "id": "g125qes",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597140188.0
    },
    {
        "author": "Blackops_21",
        "body": "I just had a 2 months worth of gains wiped out in a day thanks to Twilio, Okta, Docusign, lam research, Salesforce, and Adobe all dropping massive amounts. All my most expensive stocks dropped like 5%. Couldnt see it coming because I don't check my phone until lunch break.",
        "created_utc": 1596837215,
        "id": "g0q6oh2",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1596866015.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "Just gotta be aware of sector news. lrcx, amat, sk hybix, wdc can all affect MU",
        "created_utc": 1596744970,
        "id": "g0lo47v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596773770.0
    },
    {
        "author": "wtf_is_up",
        "body": "CDNS - Cadence Design Systems\n\nThey sell all sorts of design software / platforms / IP for chip design across a bunch of different sectors.  Strong ROIC and similar to returns to other semi equipment companies like LRCX, AMAT, KLAC, ASML without the cyclical ups and downs.\n\nPOOL -  I don't understand this one, but it just goes up.  I would love to understand what they do that's special  in the pool industry that allows them to compound for years.",
        "created_utc": 1597693158,
        "id": "g1wdj0d",
        "score": 2,
        "subreddit": "investing",
        "created": 1597721958.0
    },
    {
        "author": "Harry_Butterfield",
        "body": "LRCX 360c 9/4. Ur welcome.",
        "created_utc": 1598641879,
        "id": "g35xww1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598670679.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "I would rather go with Lam Research or KLA Corp. All of the semiconductors depend on them to provide necessary tools and equipment to manufacture chips.",
        "created_utc": 1596583784,
        "id": "g0e0y3f",
        "score": 1,
        "subreddit": "investing",
        "created": 1596612584.0
    },
    {
        "author": "catarahbpus",
        "body": "Good stuff, sold out before earning when it was around 63/64. Didn't see where they would go in the mid term. Been trying to decide between putting cash into ASML or LRCX.",
        "created_utc": 1597076841,
        "id": "g109ef1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597105641.0
    },
    {
        "author": "JakeSmithsPhone",
        "body": "I like ONTO more on a comparative basis. They have a technological edge with their equipment and are way under valued. They are taking at about 21 P/E right now, but as they build out their portfolio, they expect to earn over $5/sh with increased margins. So, a FPE of closer to 7. AMAT is a great company, but they are already built out. ONTO has that TAM SAM gap to fill in addition to eating market share and the growing industry. I wouldn't be shocked if AMAT or LRCX buys ONTO, frankly. It would make sense.",
        "created_utc": 1597035548,
        "id": "g0yrl7y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597064348.0
    },
    {
        "author": "jabogen",
        "body": "What do you think about lam research (LRCX) and how do they fit in?",
        "created_utc": 1597730459,
        "id": "g1yf0m4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597759259.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "My money is on Lam Research, KLA Corp, Cadence, Synopsys, Skyworks and Nvidia. Each of the company I mentioned is a leader in its niche and is well positioned to benefit from the increased volume in the decades to come as more and more industries are transitioning to digital and incorporating chips.",
        "created_utc": 1597941687,
        "id": "g288vei",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597970487.0
    },
    {
        "author": "kamil234",
        "body": "security, networking (palo alto, cisco, etc) , CDNs, edge computing, (cloudflare, fastly) semiconductors (amd, applied materials, lam research), 5G (nokia, ericsson, qualcomm) financials (bank of america, visa, master card, paypal)\n\nJust some ideas to look at. Companies in parenthesis are not necessarily recommendations, but some popular companies in the space, but those are some i'm eyeing or have positions in already.",
        "created_utc": 1598142756,
        "id": "g2jb32k",
        "score": 1,
        "subreddit": "investing",
        "created": 1598171556.0
    },
    {
        "author": "-Charkk",
        "body": "Semiconductors are a better call in my opinion. With a P/E of ~21 they are the forgotten tech stocks. I have 20% of my portfolio in QCOM. Im up over 100%. But right now I would buy Intel, Lam Research, Applied Materials and some Qualcomm if you have non. Even if they continue to perform poorly you will still see nice gains because of the high growth. At some point they cannot be ignored anymore.",
        "created_utc": 1598215096,
        "id": "g2meez6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598243896.0
    },
    {
        "author": "I_heard_a_who",
        "body": "First Solar and Lam Research. \n\nFirst solar is booked through 2022-2023. They are a utility scale solar company that is based in the US and doesn't rely on China for their manufacturing. I think they will be opening a few more manufacturing plants in Ohio in the coming years and they have been building out manufacturing like crazy to meet their demand. \n\nLam Research is a very well managed semiconductor manufacturer based in the US. They are increasing their margins by selling services as well as their technology, and they are paying a dividend which you don't get much of in technology stocks. There is a risk though that 25-30% of their business comes from selling to China, so if relations continue to deteriorate they could take a hit.",
        "created_utc": 1597507013,
        "id": "g1lvtj4",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1597535813.0
    },
    {
        "author": "123random7",
        "body": "LRCX, KEYS, NUAN, LI, ATVI",
        "created_utc": 1598557064,
        "id": "g321kll",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598585864.0
    },
    {
        "author": "catarahbpus",
        "body": "MSFT, LRCX, ASML, MU, AAPL, QCOM. Each of these have unique edges that will be needed with tech advancements.  T, KO, RTX, ABBV, DUK for consistency, not bad volatility, good dividends that typically increase per year.",
        "created_utc": 1596900923,
        "id": "g0sp2d1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596929723.0
    },
    {
        "author": "BoonSchlapp",
        "body": "Rate my portfolio - 24 years old with high appetite for risk due to high future earning potential. I’m still somewhat new to investing (2 yrs.) This is all in my Roth IRA which I have been maxing each year since leaving college. \n\nTech:\nTSLA (32%)\nAMZN (17%)\nAAPL (12%)\nMSFT (11%)\n\nOther:\nNET (11%)\nLRCX (10%)\nCARR (9%)\n\nI know that I’m pretty heavy into tech at the moment, but I rotated some of my portfolio over from COVID stocks like CCL and XOM two months ago when cases started picking up more across the rest of the US. At the moment, I don’t think re-entering those sectors makes sense. Besides tech and covid stocks, I’m not sure what other high growth areas to look at besides maybe disruptive new industries (online gambling, etc.) I used to hold more non-tech large caps, but the growth just isn’t there right now and I realized that it makes no sense for someone as early in my career as I am to be buying low-growth companies or industries.  I’m not currently holding ETFs because I want to swing trade companies/industries as we recover from Covid. \n\nAnother thing worth discussing is my concentration in TSLA. I wasn’t an early buyer, but eventually I couldn’t stay on the sidelines any more. Valuations don’t seem to be as important lately, and it is very difficult to assess Tesla’s value. Others think it is very valuable at the moment, and I don’t see that changing. In addition, I am bullish long term due to their upcoming gigafactories and increased production. EVs are also clearly the future, and Tesla is the leader. I recently increased this position further for these reasons. \n\nAny advice or suggestions are appreciated.",
        "created_utc": 1597252287,
        "id": "g18e0i4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597281087.0
    },
    {
        "author": "Blackops_21",
        "body": "LRCX (409% growth in 5 years), CRM (172%), NOW (462%), SNPS (282%) are really solid.",
        "created_utc": 1597629711,
        "id": "g1snyol",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1597658511.0
    },
    {
        "author": "WuKillaBees_",
        "body": "Picked up a few Calls on LRCX",
        "created_utc": 1598028240,
        "id": "g2cawz5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598057040.0
    },
    {
        "author": "raphaeldorean",
        "body": "I did a DD on semiconductors last week and Micron is a buy for me currently. Purely, on a fundamental basis. But so are ASML, Lam research, Broadcomm and TSM. All for slightly different reasons.",
        "created_utc": 1597816803,
        "id": "g22q2j9",
        "score": 1,
        "subreddit": "investing",
        "created": 1597845603.0
    },
    {
        "author": "Jericho3434",
        "body": "I've held MU, NVDA, LRCX for years and traded AMD here and there. MU is a good company but doesn't have the \"sparkle\" of AMD and NVDA. I think because the CEO of MU is meh and MU just isn't a sexy stock like it's rivals.",
        "created_utc": 1597857217,
        "id": "g24dbnu",
        "score": 1,
        "subreddit": "investing",
        "created": 1597886017.0
    },
    {
        "author": "kamil234",
        "body": "how about AMAT instead of LRCX?",
        "created_utc": 1597944488,
        "id": "g28exk6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597973288.0
    },
    {
        "author": "InternetOligarch",
        "body": "AMAT has been good to me for a while now. I might look into some LRCX",
        "created_utc": 1598406700,
        "id": "g2v8g1j",
        "score": 1,
        "subreddit": "investing",
        "created": 1598435500.0
    },
    {
        "author": "BigBrianBrand",
        "body": "1. Playing individual stocks is perfectly fine as long as you know how to look at a balance sheet and observe a company's growth, understanding their business model and knowing how relatively safe of an investment they are (low debt, lack of competition, high barrier to entry?).\n2. Building on from point #1: The stock market algorithms are far from perfect when it comes to accurately pricing every stock. There is a qualitative aspect that can cause stocks to be over or underpriced (see: companies like Facebook that have no debt losing 33% of their stock price when coronavirus hits as if their business is going to go bankrupt. Or semi-conductors like Lam Research losing 50% of its value during the late 2018 Trump tariffs speculation, as if the company's profits were going to be hit, when obviously Trump wouldn't do anything that would hurt the economy which would hurt his re-election chances). The algorithms can't really price in nuance that well, which creates a lot of valuable opportunities. It's just a matter of investing in a company that is undervalued before its stock price catches up to its earnings growth.\n3. There's a lot of ignorance/misinformation about the stock market. In terms of optimizing reward with minimal risk you can make a lot of money following points #1 &amp; #2 (hint, hint: a healthy balance sheet, high/sustainable earnings growth outpacing the stock price). If a company is killing it in terms of earnings and is seemingly a relatively safe investment, you should be fine. Even if black swan events occurs you should ultimately make more money than not. People literally were so focused speculating on something like Tesla, when they could've still made great money from companies like Facebook or the other FAANG stocks while being safe investments).\n\nTl;dr - Earnings growth outpacing the stock price's increase is the key to making a lot of money. Just make sure the company will keep killing it in terms of earnings, and is not a high risk investment like having a lot of debt or having a lot of competent competition to eat into their market share.",
        "created_utc": 1598454791,
        "id": "g2x12kv",
        "score": 1,
        "subreddit": "investing",
        "created": 1598483591.0
    },
    {
        "author": "michiamoGoffredo",
        "body": "I’m bullish on LRCX too. I’m opening a spread . Either way, calls won’t go tits up. This is THE play",
        "created_utc": 1598642003,
        "id": "g35y67q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598670803.0
    },
    {
        "author": "aRecycleAwayAccount",
        "body": "This is an option pricing bot. The latest option price is:\n\nTicker|Strike|Bid|Ask|Last Price|% Change\n-|-|-|-|-|-\nLRCX|360.0| 5.0| 5.1| 5.05| +102.00%\n\n\nLRCX 360.0call 9/4/2020 was mentioned 0 times",
        "created_utc": 1598641890,
        "id": "g35xxpg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598670690.0
    },
    {
        "author": "michiamoGoffredo",
        "body": "If you want a strong tech company that’s not basically at ATH, look no further than LRCX. One of the top chip stocks. Undervalued rn",
        "created_utc": 1598641636,
        "id": "g35xemz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598670436.0
    },
    {
        "author": "sockalicious",
        "body": "Tesla.  Not that they will build chips, but like Apple, their products will drive a need for specialized chips, and whomever they work with will benefit from it, the way ARM has benefited by being driven to create the Ax architectures that power the iPhone.  (Not that I'd put it past Elon to in-house this once it becomes big enough, either.)\n\nI also don't know a single chip guy who doesn't respect Lam Research.  Then they start talking more and my eyes glaze over - I am definitely hampered by the fact that I have no fucking clue what they're talking about or what Lam Research actually does all day.",
        "created_utc": 1596680868,
        "id": "g0im8xd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596709668.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Lam Research, KLA Corp, Skyworks and Nvidia.",
        "created_utc": 1598104308,
        "id": "g2gu35d",
        "score": 1,
        "subreddit": "investing",
        "created": 1598133108.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "I have positions in Lam Research, Qcom and PayPal (from the companies you mentioned). Also like Skyworks, KLA Corp, Synapsis and Cadence.",
        "created_utc": 1598143279,
        "id": "g2jbzpv",
        "score": 1,
        "subreddit": "investing",
        "created": 1598172079.0
    },
    {
        "author": "IwantPuppies",
        "body": "Yeah I'm gonna sound like a shill but LVGO,FSLY and TDOC made me so much money it's not funny. I wouldn't have heard about it without their recommendation. And this is from the free articles. You think it's worth subscribing? I've strongly considered it but held off.\n\nEdit: Disclaimer - I also lost a decent amount from their Aurora cannabis and Intel recommendations, and now from LRCX",
        "created_utc": 1597963940,
        "id": "g29mlyg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597992740.0
    },
    {
        "author": "bumblebear3012",
        "body": "LRCX definitely has solid exposure to edge devices and the expanding demand for data/storage, and I would expect they will likely continue their momentum on the back of this trend. On a valuation basis, certainly some of that near-term growth is priced in. \n\nSo I wouldn’t be totally surprised to see a pullback or two due to either industry pressures or quarterly results. But I would think that would be a good chance to enter a position if anything, as long-term their prospects are good. \n\nThanks so much for reading!",
        "created_utc": 1597757686,
        "id": "g1z9fkt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1597786486.0
    },
    {
        "author": "WuKillaBees_",
        "body": "Whts the story with LRCX?? Very tempted to get into some calls",
        "created_utc": 1598292182,
        "id": "g2pqpw4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598320982.0
    },
    {
        "author": "Blackops_21",
        "body": "LEN, MEDP, TREX, NXRT, LRCX, ICE, ABT, XPEL, AVTR, TER, RWEOY, IRDM, AMRC, CWST",
        "created_utc": 1597625324,
        "id": "g1sgstr",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1597654124.0
    },
    {
        "author": "brandon9182",
        "body": "LRCX doubles every 18 months for the past ten years. It's a meta moor's law.",
        "created_utc": 1598430087,
        "id": "g2w3yc0",
        "score": 1,
        "subreddit": "investing",
        "created": 1598458887.0
    }
]