[
    {
        "author": "Autumus_Prime",
        "body": "When considering apples valuation it’s not just the tech they put out. It’s also the fact that they hold the keys to the App Store and have an ever growing network of services they monetize.\n\nApple is overvalued. How overvalued I don’t know. Not as overvalued as they seem at first glance.\n\nI thought it was cool when they hit 1t. Bonkers when they hit 2t. But nobody cares about my opinion.\n\nIt’s not that surprising that a US company has the marketcap of the top 100 UK firms. It’s not 1820. There is no East India company. The UK has less people, less capital, and hasn’t benefited from the pro capitalist policies of the US for the last however many years. \n\nTLDR: typing “Murica” on my iPhone",
        "created_utc": 1603063575,
        "id": "g99srdp",
        "score": 130,
        "subreddit": "investing",
        "created": 1603092375.0
    },
    {
        "author": "LarryGlue",
        "body": "[Dark web hacking](https://www.bloomberg.com/news/articles/2020-10-30/dark-web-hackers-say-they-hold-keys-to-10-000-robinhood-accounts?srnd=premium) dweebs hold the keys to 10,000 RobinHood accounts with a total value of $752.19.",
        "created_utc": 1604089833,
        "id": "gamwy3q",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1604118633.0
    },
    {
        "author": "jamesdean300",
        "body": "They hold keys to 10,000 accounts with balances of $5",
        "created_utc": 1604084116,
        "id": "gamluv8",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1604112916.0
    },
    {
        "author": "noarms51",
        "body": "https://www.bloomberg.com/news/articles/2020-10-30/dark-web-hackers-say-they-hold-keys-to-10-000-robinhood-accounts\n\n2 factor authentication lick my taint dark web hackers",
        "created_utc": 1604073456,
        "id": "gam05qe",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604102256.0
    },
    {
        "author": "justanoththrowaway94",
        "body": "I get the keys to my new apartment tomorrow. Have 2 1/2 weeks to move everything. Haven’t really started yet.\n\nPlenty of time right?",
        "created_utc": 1603254840,
        "id": "g9if7mz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1603283640.0
    },
    {
        "author": "Autumus_Prime",
        "body": "Google holds the keys to google play with android. If Samsung and google were the same company that was also rapidly expanding into fin tech and didn’t license their OS you’d be getting closer",
        "created_utc": 1603066883,
        "id": "g99yb2i",
        "score": 5,
        "subreddit": "investing",
        "created": 1603095683.0
    },
    {
        "author": "ke263565",
        "body": "This dude is way too impulsive to have keys to nukes.\n\nEdit: stock market high tweets last night with a fucking helicopter youtube action flick.",
        "created_utc": 1602011534,
        "id": "g7xc2py",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1602040334.0
    },
    {
        "author": "VSTrader",
        "body": "Honesty not coming at you sideways but your post sounds like you’re more so gambling then investing. Maybe rethink your strategy all together. Learn market analysis and risk management. Come up with a plan and rules. Stick to them and be disciplined. Other then getting lucky, those are the keys to really finding success.",
        "created_utc": 1603989316,
        "id": "gai77l9",
        "score": 4,
        "subreddit": "stocks",
        "created": 1604018116.0
    },
    {
        "author": "ianuJ-",
        "body": "why are MW(2019) pc keys still almost 40 dollars. I wanna play cod but dont wanna wait till cold war and dont wanna buy a game to play for a month or two",
        "created_utc": 1601793487,
        "id": "g7msoy8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601822287.0
    },
    {
        "author": "_blackcrow",
        "body": "I'm quite sure the price before the split and before 2019 end was under valued. &lt;$300? \n\nThe ridiculous amount of cash they hold, the high margins for their products, holding a specific % of the entire global mobile market of which they hold on to both the software and the hardware, on top of that, the entire software distribution business that sits on these devices. \n\nWhich gets replaced every 2 years. More or less. You get android switchers who comes back in a cycle or two. \n\nJust think about the monthly revenue from the app store, and other services. The games you play that requires a payment in game, Apple just tax those payments at 30% by providing the resourses for distributing it on the app store etc etc.\n\nThat adds up to crazy amount of revenue. The whole market evaluating their tech and expecting their downfall each and every time they release their new phones are really missing it. The whole market for the high end mobile phones only has a couple of players, and only ONE in the entire industry that holds the keys to both software, hardware eco system which includes the OS and the distribution platform. \n\nThat's not including the rest of the eco system of iPads, Apple watch, pen, Macs, air pods. These are all high margin products mind you and they are sold at a high volume. And of course they are consistently best in class or considered to be, in order to command that pricing.  \n\nIt's almost as if Apple has a tax system on almost 10% or more of the global population, extremely reliable and consistent income. With no need for them to cut corners or reduce their profit margins.\n\nOf course feel free to rebut me, after all I'm typing this out on the go on a cracked android device with two thumbs. A lot can go wrong.",
        "created_utc": 1603074959,
        "id": "g9ac2hp",
        "score": 3,
        "subreddit": "investing",
        "created": 1603103759.0
    },
    {
        "author": "AtrumCanis",
        "body": "This is more like a guy going to play a $10 hand of blackjack losing and then going back home to find his keys don’t work and now the casino owns the house. \n\nIf it went the other way and he made $100k off the fuck up you think RH would just let him have it? Hell no and there have been post on here with just that. Oh sorry here’s the $100 you should have made well just be keeping the rest.",
        "created_utc": 1602468422,
        "id": "g8jx6vc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602497222.0
    },
    {
        "author": "sandtho15",
        "body": "cage the elephant, black keys, arctic monkeys, the killers are about as similar as you can get. the strokes were something totally new and innovative",
        "created_utc": 1602815998,
        "id": "g8yrb08",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602844798.0
    },
    {
        "author": "JimboTheSimpleton",
        "body": "IF everyone had warn masks and we had just bought the Korean's working test in Feb.  we woudl be so much better off. Masks and contract tracing are the keys. it didn't have to be this way.  Tens of thousands of people are dead that shouldn't be and the economy is wrecked.  Germany and south Korea are doing so much better than we are.  But noooooo it had turned into  a stupid as shit masculinity contest/political issue.  Congrats you have ten pound balls of steel but the country is wrecked.  \n\n&amp;#x200B;\n\nBy the way the virus destroys the geminal centers in your lymphatic system so you will not get a good or long lasting immunity via infection.  Heard immunity via infection is never, I repeat, NEVER going to work.  Glad its what we are doing though.  what a fuck show.",
        "created_utc": 1603499918,
        "id": "g9trcij",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1603528718.0
    },
    {
        "author": "FeistyButthole",
        "body": "Don't be crazy. \n\nThere is nothing semi about their cocks, but they are the gatekeepers. They are guarding all the doors, they are holding all the keys which means that sooner or later, someone is going to have to bendover and fight them.",
        "created_utc": 1603414018,
        "id": "g9pk3gd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1603442818.0
    },
    {
        "author": "wikipedia_answer_bot",
        "body": "Black Rock, Blackrock, Black Rocks, etc. may refer to:\n\n\n== Places ==\n\n\n=== Australia ===\nBlack Rock, South Australia, a hamlet on the Black Rock Plains\nBlack Rock, Victoria, a suburb of Melbourne\nBlackrock, Queensland, a locality in Shire of Hinchinbrook\nSouth Black Rock (Tasmania), an island off north-west Tasmania\n\n\n=== Canada ===\nBlack Rock, Colchester County, Nova Scotia\nBlack Rock, Cumberland County, Nova Scotia\nBlack Rock, Kings County, Nova Scotia\nBlack Rock, Victoria County, Nova Scotia\nBlackrock Mountain (Alberta), Alberta\nIrish Commemorative Stone, also known as The Black Rock, a monument to Irish typhoid victims in Montreal\n\n\n=== Ireland ===\nBlackrock, Cork, suburb of Cork city\nBlackrock, Dublin, southern coastal suburb of Dublin city\nBlackrock railway station, railway station serving the Dublin city suburb\nBlack Rock, Co. Limerick, mountain among the Ballyhouras\nBlackrock, County Louth, a village\nBlackrock Island (Mayo), rocky islet toward Blacksod Bay, County Mayo\nBlack Rock Mountain, County Wexford\n\n\n=== South Georgia (Southern Atlantic) ===\nBlack Rock, South Georgia, low rock well off Shag Rocks\nBlack Rocks, South Georgia, near Framnaes Point\n\n\n=== United Kingdom ===\nBlack Rock (Brighton and Hove), an area near Brighton Marina, South East England\nBlack Rock, a crossing of the River Severn at Portskewett, Monmouthshire\nBlack Rock Gorge, through which the Allt Graad flows in Scotland\nBlack Rocks (Derbyshire), England\n\n\n=== United States ===\n(sorted by state)\n\nBlack Rock, Arizona, wilderness area of northwest Arizona\nBlack Rock, Arkansas, city in Lawrence County\nBlack Rocks, a geological feature in the Temescal Mountains, in Riverside County, California\nBlackrock, California, community in Inyo County, California\nBlack Rock Falls, waterfall in Uvas Canyon County Park, near Morgan Hill, California\nBlack Rock, Bridgeport, Connecticut, a neighborhood\nBlack Rock Harbor, adjacent harbor in Bridgeport, Connecticut\nBlack Rock State Park, near Watertown, Connecticut\nBlack Rock Turnpike, a name for Connecticut State Route 58 in southwestern Connecticut\nBlack Rock Mountain State Park, near Mountain City, Georgia\nBlack Rock, Hawaii, an alternative name for Kāohikaipu, a volcanic island near Oahu\nBlack Rock, Indiana, an extinct community in Warren County\nBlack Rock, a pillar in Montana\nBlack Rock, Buffalo, former town and now a neighborhood in Buffalo, New York\nBlack Rock Forest, nature preserve in the Hudson highlands of Orange County, New York\nBlack Rock Desert, region of northwestern Nevada\nBlack Rock, New Mexico, a census-designated place in northwestern New Mexico\nBlack Rock, Oregon, community in Polk County\nBlackrock, Pennsylvania, an unincorporated community in York County, Pennsylvania\nBlack Rock Desert volcanic field, Utah\nBlack Rock, Millard County, Utah, a ghost town\nBlack Rock (West Virginia), a mountain\n\n\n=== Elsewhere ===\nBlack Rock Peak, Hangzhou, Zhejiang Province, China\nBlack Rocks (Saint Kitts), a notable rock formation on the northeastern coast of Saint Kitts\n\n\n== Arts, entertainment, and media ==\n\n\n=== Fictional entities ===\nBlack Rock, a ship on the TV show Lost; see Mythology of Lost\nBlack Rock Shooter, a Japanese media franchise based on the eponymous female character\nBlackrock (comics), an adversary of Superman's in DC Comics\nBlackrock Mountain, a mountain in the Warcraft universe, mostly seen in World of Warcraft\nG. B. Blackrock, a character in the Transformers comic book series\n\n\n=== Films ===\nBlack Rock (2012 film), a 2012 film starring Katie Aselton, Lake Bell, and Kate Bosworth\nBlackrock (film), a 1997 Australian film based on the 1992 play\n\n\n=== Literature ===\nBlack Rock (novel), by Steve Harris\nBlack Rock, a novel by John McFetridge\nBlackrock (play), 1992 Australian play inspired by the real-life rape and murder of schoolgirl Leigh Leigh\n\n\n=== Music ===\nBlack Rock (band), dance production duo from France\nBlack Rock (James Blood Ulmer album), 1982\nBlack Rock (Joe Bonamassa album), 2010\nBlack rock, an alternative name for the psychedelic soul music genre\n\n\n== Buildings and structures ==\nBlack Rock, a nickname for the CBS Building in New York City\nBlack Rock Airport, New Mexico\nBlack Rock Dam (Schuylkill River), Pennsylvania\nBlack Rock Halt railway station, near Criccieth, Wales; closed in 1976\nBlack Rock Lock, the terminal lock on the Black Rock Canal, part of the Erie Canal\nBlackrock railway station, in Blackrock, Dublin\nBlackrock Castle, in Blackrock, Cork\nBlackRock Center for the Arts, in Germantown, Maryland\nBlackrock Clinic, in Blackrock, Dublin\nThe Black Rock, a memorial to Irish typhus victims in Goose Village, Montreal\n\n\n== Businesses and organisations ==\nBlack Rock Arts Foundation, a U.S. foundation which supports arts programs in San Francisco, California\nBlack Rock City, LLC, the U.S.-based organization behind the annual Burning Man festival\nBlack Rock Coalition, a U.S.-based organization promoting black musicians\nBlack Rock Studio, a U.K. video games developer\nBlackRock, an American global investment management firm based in New York City\nBlackrock College, a secondary school in Blackrock, County Dublin, Ireland\n\n\n== Sports ==\nBlack Rock Football Club, Australia\nBlack Rock Yacht Club, Australia\nBlackrock College RFC, rugby club associated with Blackrock College in Blackrock, Dublin, Ireland\nBlackrock GAA (Blackrock Gaelic Athletic Association), also known as Blackrock Hunting Club, in Blackrock, Cork, Ireland\nBlackrock Rugby Festival, a schools' rugby festival hosted by St. Mary's School in Nairobi, Kenya\n\n\n== Other uses ==\nBlack Rock (hen), variety of domestic chicken\nBlackrock (geology), type of limestone\n\n\n== See also ==\nBlack Hill (disambiguation)\nBlack Hills (disambiguation)\nBlack metal\nBlack Mountain (disambiguation)\nBlack Mountains (disambiguation)\nBlack Stone (disambiguation)\nBlack Stone, a Muslim object of reverence in Mecca\nBlakroc, a 2009 collaboration project between the band The Black Keys and a number of hiphop and R&amp;B artists\nBlackrock railway station (disambiguation)\nBlackstone (disambiguation)\nBlackstones (disambiguation)\nLapis Niger (Latin: \"Black Stone\"), ancient shrine in Rome\nAll articles beginning with Black Rock\nAll articles beginning with Blackrock\n\nMore details here: https://en.wikipedia.org/wiki/Black_Rock \n\n\n\n*This comment was left automatically (by a bot). If something's wrong, please, report it.*\n\n*Really hope this was useful and relevant :D*\n\n*If I don't get this right, don't get mad at me, I'm still learning!*",
        "created_utc": 1603906984,
        "id": "gaehvxf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1603935784.0
    },
    {
        "author": "jsboutin",
        "body": "The debt is at the asset level. Even if a mall is 100M in the hole, they can turn in the metaphorical keys and get out for 0$.\n\nThat means that they can't really be at a negative equity position.",
        "created_utc": 1602445748,
        "id": "g8ioyzw",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1602474548.0
    },
    {
        "author": "TheKingOfNerds352",
        "body": "It’s like giving an alcoholic the keys to the liquor store",
        "created_utc": 1602454244,
        "id": "g8j7ube",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1602483044.0
    },
    {
        "author": "cullenjwebb",
        "body": "The advantages in the situation you describe could be one of the following:\n\n* PayPal has found a way to cut down on costs / regulations by allowing users to transfer funds via Crypto which is then converted into local fiat currency, rather than converting from fiat to fiat, or even within a single fiat currency\n* This opens the door for Crypto spending on regular everyday purchases. Paypal is extremely popular in online stores and opens the door for Crypto users even if the seller doesn't plan on keeping the coin as-is\n* Following up on the previous point, if more online shopping is conducted with Crypto it will encourage adoption and makes a future where online sellers want to keep the coin rather than convert them more likely as they could replenish stock with their Crypto or make other business purchases\n\nOverall though the long-term goal is for Bitcoin / Crypto to mature enough and be user friendly so that 3rd party help isn't required. It has made impressive improvements over the last few years but I still don't trust my Mom / Dad / Others to know how to responsibly hold their keys so I'm glad that an option like this is available in the meantime.",
        "created_utc": 1603486244,
        "id": "g9spru8",
        "score": 2,
        "subreddit": "investing",
        "created": 1603515044.0
    },
    {
        "author": "goodshotlet",
        "body": "KEYS",
        "created_utc": 1603295280,
        "id": "g9jubqf",
        "score": 2,
        "subreddit": "stocks",
        "created": 1603324080.0
    },
    {
        "author": "Khal_Drogo",
        "body": "Buy your crypto through a market like coinbase. Then transfer to a secured wallet where you keep your private keys.",
        "created_utc": 1603321811,
        "id": "g9ld12k",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1603350611.0
    },
    {
        "author": "SpockSays",
        "body": "Which government? Bitcoin is a global network.\nHow will the government know I have any? Most of my stack is non KYC.\nEven for my KYC stack, the keys are split in a way only I know how to recover, so the coins can never be seized from me by force.\nIf the sentiment of bitcoin is so outrageous and hostile, I’ll happily renounce citizenship and move elsewhere. I can already afford citizenship in several countries that do not tax bitcoin at all, so it would actually be better for me to do this honestly. (It’s something I’ve already been thinking about).\n\nAlso, I buy and smoke weed. That is and has been illegal in my country. It never stopped me (or anyone else) from buying and using cannabis.\n\nSo.... you tell me.",
        "created_utc": 1603340705,
        "id": "g9m8auc",
        "score": 2,
        "subreddit": "investing",
        "created": 1603369505.0
    },
    {
        "author": "skyfallboom",
        "body": "Link without captcha \n\nhttps://www.bloomberg.com/news/articles/2020-10-30/dark-web-hackers-say-they-hold-keys-to-10-000-robinhood-accounts?utm_source=url_link",
        "created_utc": 1604097338,
        "id": "ganal7p",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604126138.0
    },
    {
        "author": "NoiseNsignal",
        "body": "Keys to the market according to kramer",
        "created_utc": 1604036514,
        "id": "gakpcxe",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604065314.0
    },
    {
        "author": "Trueslyforaniceguy",
        "body": "Yes, this is one of the keys that the internet articles are avoiding.  Recent activist investor positions strongly imply some paradigm shift which will take all the bear arguments and send them where they belong.",
        "created_utc": 1602704117,
        "id": "g8trtw9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602732917.0
    },
    {
        "author": "BlandTomato",
        "body": "You shouldn't store your Bitcoin on an exchange. \n\nDoing so defeats the main value proposition of Bitcoin, which is that for the first time in history you can hold digital money without needing some institution like a bank to hold your money. \n\nYou can store Bitcoin in your own hands by using a non custodial Bitcoin wallet. \n\nNot your keys, not your coins.",
        "created_utc": 1603838548,
        "id": "gabm64e",
        "score": 2,
        "subreddit": "investing",
        "created": 1603867348.0
    },
    {
        "author": "Rox-onfire",
        "body": "I'm a white male grew up very safe in a mostly white city and even I was taught to do that, interior lights on, hands on the wheel, keys on the dash...",
        "created_utc": 1603419286,
        "id": "g9pukpl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603448086.0
    },
    {
        "author": "Boomtown626",
        "body": "&gt;mobile banking\n\nOne of my finance classes this year spent a lot of time focused specifically on the future of the biggest financial institutions. It was eye-opening to discover the unmitigated avalanche of money banks have committed to pouring into fintech. \n\nWhat impact this will have on square remains to be seen, but I think your comment keys in on a largely underrated wild card.\n\nOf course, the other side of this coin could be to underscore the under-valuation in the financial sector that still languishes from the short end of COVID's market influence.",
        "created_utc": 1603499718,
        "id": "g9tqr35",
        "score": 2,
        "subreddit": "stocks",
        "created": 1603528518.0
    },
    {
        "author": "SorkinThingsOut",
        "body": "he really about to just jingle a set of keys in front of the wall street buy-button babies with this stimulus. not good for my puts",
        "created_utc": 1602033065,
        "id": "g7yi2xx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602061865.0
    },
    {
        "author": "HolderofFour",
        "body": "You ever see the inside of your wife or gfs purse? Got a whole ass house in there. I just take my phone, wallet, and keys.",
        "created_utc": 1601929601,
        "id": "g7tqpkc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601958401.0
    },
    {
        "author": "FalseBadApple",
        "body": "Is this old news? Thought everybody would be freakin out. https://www.google.com/amp/s/www.bloomberg.com/amp/news/articles/2020-10-30/dark-web-hackers-say-they-hold-keys-to-10-000-robinhood-accounts",
        "created_utc": 1604096746,
        "id": "gan9jss",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604125546.0
    },
    {
        "author": "NewYorkJewbag",
        "body": "Okay my comment was removed because I mentioned a failed investment. I have edited my comment. \n\nYou will not be disappointed. The newsletter I subscribe to is Stock Advisor is run by the two founders (brothers) and has a lot of variety. Some of their marketing can be over the top and click-baity, but don’t pay that any mind. You could also just check out their basic stock investing book. \n\nSome keys to their philosophy are:\n\n1. You don’t need to be an expert or genius to grow wealth in the market. You need to be patient and unemotional (that’s harder than it sounds.)\n\n2. You actually have an advantage over professional investors such as fund managers because you have a longer time horizon for investments to pay off (3-5 years) while the pros really can’t hold things that long with out seeing gains. \n\n3. They focus on buying companies, not buying stocks. They look at the brand, the ownership, the management, customer loyalty, their products, etc...\n\n4. ...and that doesn’t mean they don’t look at the technical aspects of EPS, P/E, cash flow, etc, but they place those things in context of companies themselves. \n\n5. They reinforce that you only need to be right 51% of the time to beat the market (though for me they’ve been right more like 90% of the time.)\n\n6. They do recommend beginners anchor their stock investments around ETFs to start. And fuck mutual funds.\n\nYou can probably look at the track record of their picks pretty easily. I will say this, towards the beginning of the pandemic, I went in on a total of 7 new investments. Even after the last weeks major sell off, I’m up 80% in 6 months for those. For reference, SPY is up about 50% from the dead bottom of the pandemic (I bought in a little above that so up more like 40% from when I bought.) And one of those companies went completely belly up (a Chinese coffee company that wasn’t just brewing Java, they were cooking the books, too.) \n\nGod, I sound like I work for them, but I just have been so happy that I discovered them when I was younger (I’m 48, started with them in my early 30s) I like to share my experience.",
        "created_utc": 1604021137,
        "id": "gak1u0y",
        "score": 2,
        "subreddit": "stocks",
        "created": 1604049937.0
    },
    {
        "author": "goodshotlet",
        "body": "$KEYS",
        "created_utc": 1602522145,
        "id": "g8lv80l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602550945.0
    },
    {
        "author": "somanychins",
        "body": "Just realized how retard I am wondering how the AAPL even will impact the stock price. Is SoftBank going to get drunk and pass out with it’s foot on the accelerator or take the keys out of the ignition today? Like anybody fucking knows, or iPhone 12G even matters.\n\nThe only thing that’s not priced in is the daily market manipulation.",
        "created_utc": 1602591506,
        "id": "g8op32v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602620306.0
    },
    {
        "author": "lilnext",
        "body": "They are seen as the \"RGB keyboard\" maker. IMO they are undervalued due to most of their products not being RGB keyboard. \n\nBear stance - they will never be seen as a GPU competitor and always as a luxury accessory to PCs. People don't need MX Cherry Keys, hell, most people don't even need a mechanical keyboard and will only move into the corsair space if they are \"serious\" about taking their gaming to the next level. But the next level is filled with competitors and corsair isn't cheap, meaning that a frugal gamer will steer clear of the PC giant. Also for what they do well, well, they do it too well. I personally bought a corsair PSU a year ago for my PC build. I won't need a new PSU for at least 5 years, it's just that good. Corsair is a name for people building their PCs from scratch, not an everyday name like Nvidia or Intel.",
        "created_utc": 1602353387,
        "id": "g8cgrv8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602382187.0
    },
    {
        "author": "cakepiebrownie",
        "body": "I don't know about trustwallet.\n\nI buy coins on kraken then immediately transfer them to cold storage (a physical wallet for storing keys - i use trezor)",
        "created_utc": 1603523549,
        "id": "g9vbayo",
        "score": 1,
        "subreddit": "investing",
        "created": 1603552349.0
    },
    {
        "author": "DangerDavez",
        "body": "Did people just figure this out today?  It's been a topic during every debate and is one of the keys to Biden's platform to ensure he sweeps all the left leaning states.  \n\n2 trillion investment into renewables and eco renos with a goal of becoming carbon neutral by 2035. It won't happen overnight and their will be a transition but it's happening.",
        "created_utc": 1603454499,
        "id": "g9r0vbu",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1603483299.0
    },
    {
        "author": "linusgoddamtorvalds",
        "body": "...I call BS.\n\nIt's the \"real world money,\" and a fleeting idealism of faux  give-a-F.\n\nInteresting?\n\nThe dollar has been digital for some time, btw.\n\nPayPal isn't providing keys, and you cannot move out of the wallet  nor move  into from another, btw.\n\nYou can be an \"interested\" participant in this innovation for only 2.3% plus network fees, btw.\n\nPlease have respect for money--we all sacrifice that which is truly finite in its pursuit: our time=our life.",
        "created_utc": 1603542219,
        "id": "g9wfogb",
        "score": 1,
        "subreddit": "investing",
        "created": 1603571019.0
    },
    {
        "author": "hypmoden",
        "body": "it works like Robinhood, not your keys not your coin\n\nglad for the exposure though Bitcoin going to pump to the moon",
        "created_utc": 1603304733,
        "id": "g9ke2k3",
        "score": 1,
        "subreddit": "investing",
        "created": 1603333533.0
    },
    {
        "author": "koenigsburg-20",
        "body": "Honestly, with out the ability to transfer crypto into PayPal, this is a pointless gesture. They need to give us the keys to our crypto wallet in PayPal.",
        "created_utc": 1603344951,
        "id": "g9mdki6",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1603373751.0
    },
    {
        "author": "NOSjoker21",
        "body": "On Google Keyboard, long pressing a key usually displays additional sub keys",
        "created_utc": 1602800664,
        "id": "g8y0omx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602829464.0
    },
    {
        "author": "Boretsboris",
        "body": "It all depends on what you need at the moment. Every option on the option chain has a place in my heart. They’re like the 88 keys on a piano. You’re not going to need them all at once. You won’t even use them all during a performance, but you want them all to be available to you. Every option serves a purpose in giving you the opportunity to fine-tune your exposure with just the right amount of leverage you need.",
        "created_utc": 1603227000,
        "id": "g9h17zh",
        "score": 1,
        "subreddit": "options",
        "created": 1603255800.0
    },
    {
        "author": "Dr_Meany",
        "body": "Never. I've always hated the sector. Who wants to invest in a commodity where two of the most autocratic shitty countries in the world (Saudi Arabia and Russia) hold the keys to pricing? No fucking thanks.",
        "created_utc": 1601646509,
        "id": "g7ego36",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1601675309.0
    },
    {
        "author": "ceskanda",
        "body": "Get yourself some Ferrari keys. I hear he’s a nice dude. Cheers 🍻",
        "created_utc": 1601690316,
        "id": "g7h1eo5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601719116.0
    },
    {
        "author": "ChrisNomad",
        "body": "A couple of years ago I took my infant son and wife to a ‘big city’ back East for a vacation in the winter.\n\nWe’d used AirBNB once before and it went okay, so we thought we’d do it again for this two week trip.  With a baby and an extra sleeping space in the living room AirBNB fits a lot better than a hotel (ideally).\n\nWe found a killer looking condo in a brand new building, and the price was comparable with a hotel, but again with the added sleeping space, kitchen, room for the baby to crawl around, etc. it looked like a great deal.\n\nHowever, when we got to the building the person that was supposed to meet us with the keys told us we had to go ‘walk’ into the parking garage under the building through the exit, go deep into the parking garage and find a lockbox with the keys.  THEN we were supposed to walk through the garage entrance to the building and we’re told we couldn’t walk through the front lobby.  As many of you are now thinking, we’re fucked.\n\nIt’s already late in the evening, we’ve been traveling for 14 hours (woke up at 3am to catch the flight), it’s snowing out, and we have an infant.  All the other hotels are now booked solid and we have to play this one out.\n\nThe keys don’t work to the downstairs so we end up calling the ‘contact’ and finally they come and show us how to get in.  We’ve already been in the freezing garage for an hour.  I was literally ready to strangle the guy when he walked up.\n\nNeedless to say we were able to make it all work in the end, the condo was killer, but it was obviously not okay with the building that they were renting short terms in AirBnB.\n\nThese types of rentals are going on all over in many cities and states.  Eventually, like Uber, AirBnB is going to have to follow the laws of the land, new laws and regulations will be made, and they won’t be able to keep throwing hundreds of millions battling lawsuits while they disrupt (or break laws) to turn a profit.\n\nThis is one area that absolutely hate with the business models of these upstarts.  Imagine I open up a business in your field and don’t follow any of the rules but just fight everything in courts and pay fines while you follow the rules and I break them.  As publicly traded companies this is going to have to get cleaned up.",
        "created_utc": 1601802756,
        "id": "g7ngakb",
        "score": 1,
        "subreddit": "investing",
        "created": 1601831556.0
    },
    {
        "author": "WVR_Phil",
        "body": "No ink left on the keys, have you to just remember where they are.",
        "created_utc": 1602760179,
        "id": "g8vza1m",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1602788979.0
    },
    {
        "author": "artichoke2me",
        "body": "Lol it will get listed again. The pope got the keys to bank.",
        "created_utc": 1604092472,
        "id": "gan1vwz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604121272.0
    },
    {
        "author": "dudeitsadell",
        "body": "i cashed out and put the downpayment together last thursday, should close in a few days man. \n\nits one one of the most thrilling yet terrifying things i've ever done. 30 year mortgage is quite intimidating. excited to get the keys though",
        "created_utc": 1604099628,
        "id": "ganeh0h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604128428.0
    },
    {
        "author": "liftonjohn",
        "body": "That’s like saying I hold the keys to the local ice cream truck man’s safe",
        "created_utc": 1604101624,
        "id": "ganhtfw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604130424.0
    },
    {
        "author": "mingling4502",
        "body": "[Phone, wallet, keys](https://youtu.be/e9N6_Tj9u2U)",
        "created_utc": 1601929941,
        "id": "g7trig0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601958741.0
    },
    {
        "author": "8HokiePokie8",
        "body": "Imagine giving the keys to the nuclear football to a raging lunatic narcissist that’s high af on drugs 🤦",
        "created_utc": 1602025220,
        "id": "g7y4crt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602054020.0
    },
    {
        "author": "AccomplishedWin2",
        "body": "Look dude, I will give you a short list of sectors. However, I wouldn't be full on stocks that did great in the 1st round of covid in spring (like zoom) cuz people got used to this shit and there is not a lot of space to grow. Take zoom for exemple. Now everybody is using it and those who dont wont convert (like most of the universities in EU. They make their courses on MSFT Teams or GOOGLE classroom cuz Zoom is shitty). \n\nNow, here's the list:\n\n1. Retail (both online and physical): Walmart, Costco, Target, Amazon, Shopify, Etsy, Best Buy, Home Depot, Lowe's\n\n2. Construction: DR Horton, TOLL Brothers due to low interest rates \n\n3. Materials: only wood shit or lithium if you are risky af. Silver and gold suck atm but will get a boost soon due to the stimulus\n\n4. Tech, semis, comms: (carefull with the FAANGs. Might get blown if Biden wins) Crowdstrike, Telekom, Verizon, NVIDIA, Intel, AMD, Skyworks, Broadcom, Keysight, Texas Instrumets, Taiwan Semi, you get the idea. Every 5G and powerfull cyber company. \n\n5. Consumer discretionary (if you are truly a bear and life sucks in COVID, quarantine shit, depression and you dont like easy money): General Mills, Pepsi, Cola, other bullshit like this\n\n6. This is my power move: Energy: EVERY FCKING THING THAT IS RENEWABLE ENERGY. Buy an etf and it should be all good. I have a position in one since last month, up 20%. \n\n7. Video Games: EA, Activision, Sony, MSFT, Ubisoft",
        "created_utc": 1601974470,
        "id": "g7vn581",
        "score": 1,
        "subreddit": "investing",
        "created": 1602003270.0
    },
    {
        "author": "wallthrowawaystreet",
        "body": "Big institutions will get in on this very reasonable price for Draftkings... if they know what's good for them.\n\nI'm just saying. No, no, that's not a threat, but... that's a nice car ya got there.\n\nWould be a shame if someone... *keyed it using my keys to my 1994 Pontiac Firebird.*",
        "created_utc": 1602074297,
        "id": "g7zvoac",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602103097.0
    },
    {
        "author": "raiderkev",
        "body": "It's online, get innovative and cheat better. Make a video of you writing stuff down, and clacking away at keys on the computer. Put that in front of the camera, n wolfram alpha for days. Duh",
        "created_utc": 1602740112,
        "id": "g8vgd31",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602768912.0
    },
    {
        "author": "mminsfin",
        "body": "Research the gmo mosquitos they released recently in the keys, as well as previous releases then move over to Bill gates creepy new video about deadly mosquitos and that should answer your questions",
        "created_utc": 1602803414,
        "id": "g8y5lvu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602832214.0
    },
    {
        "author": "poofscoot",
        "body": "Depends on what your exit strategy was. If you didn't have any strategy and mashed keys together and got those calls, then I would take profit",
        "created_utc": 1602598821,
        "id": "g8p0b91",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602627621.0
    },
    {
        "author": "rastadreadj",
        "body": "SIM SIMMA WHO GOT DA KEYS TO THE BEEMA",
        "created_utc": 1602598421,
        "id": "g8ozm1t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602627221.0
    },
    {
        "author": "puffinnbluffin",
        "body": "I almost missed an important flight once so I left a hertz rental in the departures lane at LAX and of course, like any responsible person, flew home with the keys to ensure nobody stole the car.  Just wanna give a special fuck you to Hertz and all your affiliates for banning me for life.  Long dollar or some shit",
        "created_utc": 1603111691,
        "id": "g9bhogg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603140491.0
    },
    {
        "author": "CookieMonster_NYC",
        "body": "Time to change to Tradestation for fucking around account, $2000 needed for margin like RH it seems.  RH feels like I’m about to get scammed for buying cd keys for pc games soon.",
        "created_utc": 1602851104,
        "id": "g8zupfl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602879904.0
    },
    {
        "author": "CardinalNumber",
        "body": "No, bruh. Use and app. Store your keys and backup codes securely.",
        "created_utc": 1602341203,
        "id": "g8brzje",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1602370003.0
    },
    {
        "author": "RiskFreeLeverage",
        "body": "Stim stimmy ah! Who got the keys to my bimmah",
        "created_utc": 1602430954,
        "id": "g8huzyt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602459754.0
    },
    {
        "author": "puffinnbluffin",
        "body": "No.  Real life.  They charged my cc $100 a day for the keys until I cancelled it.  Was a real fiasco",
        "created_utc": 1603115903,
        "id": "g9bpj1u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603144703.0
    },
    {
        "author": "CaptainCaveSam",
        "body": "Exchanges are not safe places to store crypto. Not your keys, not your coins. \n\nGet a hardware wallet, keep your seed phrase safe, and you have nothing to worry about.",
        "created_utc": 1603350188,
        "id": "g9mjbyz",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1603378988.0
    },
    {
        "author": "farrapona",
        "body": "What does that mean in reality? If they go under or mismanage/lose keys/get hacked everyone loses their BTC holdings?\n\nI wonder if as long as ws is solvent they would have to pay you cash for your BTC if you want to cash out.",
        "created_utc": 1603379274,
        "id": "g9njky1",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1603408074.0
    },
    {
        "author": "xxdanabxx",
        "body": "1997, had to yank a few of the offshore power boat dummies off sandbars down in the keys. Zero idea how to work dual throttle or navigate. They’d be crying for us not to call OSHA",
        "created_utc": 1603537427,
        "id": "g9w599l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603566227.0
    },
    {
        "author": "rioferd888",
        "body": "alexa play fallin' by \\*Alicia keys",
        "created_utc": 1604042637,
        "id": "gakvgyi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604071437.0
    },
    {
        "author": "UnplayableConundrum",
        "body": "I mean - just my opinion and not really anything to do with them and their financials but Under Armour is a garbage company, Kevin Plank is a douche (and so is his brother) and Baltimore is dumb as fuck for given them the keys to the city",
        "created_utc": 1604060945,
        "id": "galdmsc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604089745.0
    },
    {
        "author": "TokyoRedTwist",
        "body": "For bitcoin I would recommend buying a physical wallet to keep your keys safe, like a Trezor.\n\nGold I would buy using a physical gold ETF.  Note there are other gold funds which are equity-based, holding positions in miners etc. I would go for a pure physical gold ETF.\n\nCoins are interesting but you need to store them somewhere and will likely spend more on that than you would paying fees on the ETF.",
        "created_utc": 1603832084,
        "id": "gab9hmm",
        "score": 1,
        "subreddit": "investing",
        "created": 1603860884.0
    },
    {
        "author": "ebkallday1",
        "body": "I got fired from my job 2 weeks ago and nobody walked me out. I still have the cell phone credit cards and keys",
        "created_utc": 1604166515,
        "id": "gaptdiq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604195315.0
    },
    {
        "author": "CardinalNumber",
        "body": "They fixed it. And by fix it, I mean, Robinhood stopped overlooking Intuit scraping account data with stolen client keys.",
        "created_utc": 1603461775,
        "id": "g9rcdk9",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1603490575.0
    },
    {
        "author": "jsnyd3",
        "body": "Wow, you got doom and also went waay OTM with that call. Mayor for a day, give this man the keys to the city",
        "created_utc": 1603453680,
        "id": "g9qzubz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603482480.0
    },
    {
        "author": "muxum",
        "body": "Yes. The bar is so low for our president that him behaving himself - while outright lying most of the time - is notable. I see last night as kind of like being proud of your kid finding his way to poop on the toilet by himself for the first time but tossing your keys into the bowl while he did it.",
        "created_utc": 1603454713,
        "id": "g9r15c0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603483513.0
    },
    {
        "author": "boosacks",
        "body": "selling my tf2 unusual pumpkin party prehistoric pullover for $699.99 on marketplace or 400 keys dm me",
        "created_utc": 1603282400,
        "id": "g9j7i2h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603311200.0
    },
    {
        "author": "MoneybagginYourMom",
        "body": "I think coinbase fees are lower than 3% . But ngl half my bitty is on robinhood bc idc about having the keys that much",
        "created_utc": 1602895779,
        "id": "g925nmb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602924579.0
    },
    {
        "author": "v-shizzle",
        "body": "puts on your sticky icky keyboard keys",
        "created_utc": 1602917307,
        "id": "g92ycil",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602946107.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "Only time will tell. Honestly I think they should go the full digital DRM route, distribute game keys, and maybe have their own subscription based game service, then use select stores as distributions centers for hardware, video games, and knick knacks. That’s where they would likely thrive. \n\nDisc gaming is dead. They need to become a digital store.",
        "created_utc": 1602210811,
        "id": "g86gc63",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602239611.0
    },
    {
        "author": "protos32",
        "body": "20% of $22.5 billion is $4.5 billion which is the size of PSTH. Just where I got that number from. \n\nJust gonna reply on this one because I saw you replied to a couple other comments I had. I feel what your saying for sure about AirBnB being able to raise $3b. I think there is still an opportunity especially if more details come out about how much cash on hand they had to burn to stay afloat. They already went through $1.2 billion and that was reported around July. I think it's possible they might go for the more sure thing here. Ackman can just hand them the keys to $4.5 billion instead of trying to raise $3b on their own 🤷",
        "created_utc": 1602276289,
        "id": "g893hvb",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1602305089.0
    },
    {
        "author": "thehappyheathen",
        "body": "Lol. You can buy torx drivers and star \"security\" drivers pretty easy. I did a camper van, and all the big bolts in cars are T-55 torx bolts, or T-35 or whatever. Hell, you can buy lockpicks, bump keys and just about anything you want. It's not illegal to own except in very rare cases",
        "created_utc": 1602559432,
        "id": "g8nragu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602588232.0
    },
    {
        "author": "Gigatrol",
        "body": "What about their future ability to get mortgages?  They won’t be able to turn in keys and still be credit worthy.",
        "created_utc": 1602468953,
        "id": "g8jy4l3",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1602497753.0
    },
    {
        "author": "Space4Time",
        "body": "Think of all the cool uses for your new Magnet. \n\nFridge, watch, keys.\n\nEach time you use it in a new and clever way you'll appreciate it a little more.\n\nYou'll begin to wonder why all phones don't have it.",
        "created_utc": 1602756865,
        "id": "g8vw51g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602785665.0
    },
    {
        "author": "throttlecntrl",
        "body": "Yes Mr Farter because I can’t find my keys",
        "created_utc": 1602845115,
        "id": "g8znnwc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602873915.0
    },
    {
        "author": "NoiseNsignal",
        "body": "According to Kramer. Apples are keys to the market",
        "created_utc": 1603892558,
        "id": "gado2zz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603921358.0
    },
    {
        "author": "PrettyLadiesAreGreat",
        "body": "Not your keys, not your coins.",
        "created_utc": 1603857630,
        "id": "gackqud",
        "score": 1,
        "subreddit": "investing",
        "created": 1603886430.0
    },
    {
        "author": "FuckingPrawns",
        "body": "Not your keys, not your coins!",
        "created_utc": 1603838070,
        "id": "gabl97e",
        "score": 1,
        "subreddit": "investing",
        "created": 1603866870.0
    },
    {
        "author": "Yourmumspiles",
        "body": "So what. If you're cool with your wife/girlfriend getting drilled by another man while you watch you may as well let him bum you too, you couldn't be anymore submissive unless you gave him the keys to your house and cooked his tea.",
        "created_utc": 1601963614,
        "id": "g7vd6x9",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1601992414.0
    },
    {
        "author": "CamarosAndCannabis",
        "body": "I got no clue, I just press the keys",
        "created_utc": 1601758269,
        "id": "g7jzwe1",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1601787069.0
    },
    {
        "author": "fakehalo",
        "body": "If you dont own your own keys, yeah you can just trade it on your exchange.  If you own your keys you can send it just like cash, use it as collateral, or even take it outside of the country without having to abide by any governmental rules (until you commit to a currency).\n\nThe fact I was late to the game in believing in it and still see people that don't \"get it\" yet gives me comfort for potential future growth.",
        "created_utc": 1603581470,
        "id": "g9yvwlt",
        "score": 0,
        "subreddit": "investing",
        "created": 1603610270.0
    },
    {
        "author": "BlandTomato",
        "body": "Yeah, they mean hold as in their custodial wallet. \n\nI want to withdraw my Bitcoin and actually hold my keys.",
        "created_utc": 1603299945,
        "id": "g9k3zj7",
        "score": 0,
        "subreddit": "investing",
        "created": 1603328745.0
    },
    {
        "author": "Ned_Flanderz",
        "body": "That, and the fuçking keyboard is terrible, why do I need 3 tabs, Android you can just hold certain keys.\n\niPhone is trash. I hate this thing.",
        "created_utc": 1602555675,
        "id": "g8nkx6y",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1602584475.0
    },
    {
        "author": "Wsbgal",
        "body": "Did you know that all of the CAT equipment uses universal keys? Or at least they used to. If you came across one you could in theory start the engine on a digger out on some country road, or open any compartment. All hearsay of course...",
        "created_utc": 1602816268,
        "id": "g8yrqxp",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1602845068.0
    },
    {
        "author": "99Thebigdady",
        "body": "Just please dont buy your bitcoins through paypal or venmo.. you won't even own them. You won't be able to send them, or trade them, it will be stuck on your account until you sell them... And if paypal gets hacked or whatever, its goodbye your bitcoins. Yes some day they will allow you to send and receive bitcoins on paypal, but i heard they will charge enormous/ridiculous fees... Not your private keys, not your bitcoins, remember that.\n\nTo answer your question, yes its a good investment, always as been, BTC will never disapear, blockchain is a new technology. Can only go up from here.",
        "created_utc": 1603821368,
        "id": "gaamyau",
        "score": 0,
        "subreddit": "investing",
        "created": 1603850168.0
    },
    {
        "author": "rioferd888",
        "body": "Alexa play fallin' by \\*Alicia Keys",
        "created_utc": 1604068406,
        "id": "galq45p",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1604097206.0
    },
    {
        "author": "KoonFlakes",
        "body": "That’s completely your fault lol. Decline the tour, tell him to hand over the keys and go about your sleep moron.",
        "created_utc": 1601771445,
        "id": "g7l2gtn",
        "score": -4,
        "subreddit": "investing",
        "created": 1601800245.0
    }
]