[
    {
        "author": "AlexValleDoesCocaine",
        "body": "MSFT, AAPL, AMZN, GOOG, CRM, MA, V, CCI.\n\nDOCU, AYX, SQ, PYPL, CDNS, XLNX, TER.\n\nTDOC, CRNC, ALRM, LITE.\n\nFree reveal of one \"top\" stocks: https://imgur.com/a/FKAPgzc. \n\n[Shh.](https://imgur.com/a/nhAfyA2) Don't Tekashi 6ix9ine this thread.",
        "created_utc": 1591320595,
        "id": "fsxc5a8",
        "score": 2,
        "subreddit": "investing",
        "created": 1591349395.0
    },
    {
        "author": "Rhetorik3",
        "body": "I've been killing it on semiconductor longs the past 2 weeks. Should be more big gains if congress approves $37B for more semi infrastructure.  [https://www.wsj.com/articles/semiconductor-industry-to-lobby-for-billions-to-boost-u-s-manufacturing-11590919201](https://www.wsj.com/articles/semiconductor-industry-to-lobby-for-billions-to-boost-u-s-manufacturing-11590919201)  \n\n\nSemi Positions: AMAT, AMD, ASML, AVGO, LCRX, TER, &amp; TSM   \n\n\nAlso financials looking poised for a rally, holding C and FAS. Unrelated long positions: ABBV, NOC, LMT, MMM, MRK, SNE, &amp; TMUS",
        "created_utc": 1591281620,
        "id": "fsv4e9p",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591310420.0
    },
    {
        "author": "jakekap5",
        "body": "Definitely the top 5 IMO. $TER seems to be the unsung hero here. Look out for them in NJ and PA",
        "created_utc": 1592144091,
        "id": "fusvk7c",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1592172891.0
    },
    {
        "author": "Trisolaran_arbitrage",
        "body": "Hi all,\n\nI have been following the subreddit for a while now and I have to say I am a big fan of reading some of the in-depth analysis provided here. Some of the old links to letters are fascinating and I have learned a ton just following along. \n\nAnyways, one of the company's I have been researching over the past almost year is Teradyne. While reading their latest 10Q, I come across the below paragraph under their revenue section which describes them selling their accounts receivables to third-parties. I am unfamiliar with the mechanics of this and how the below works, if someone could point me in the right direction for a resource or provide a quick explainer that would be great.\n\nFrom 10Q:\n\n *Accounts Receivable*\n\n*Teradyne sells certain trade accounts receivables on a non-recourse basis to third-party financial institutions pursuant to factoring agreements. Teradyne accounts for these transactions as sales of receivables and presents cash proceeds as a cash provided by operating activities in the consolidated statements of cash flows. Total trade accounts receivable sold under the factoring agreements were $46.8 million and $41.7 million for the three months ended March 29, 2020 and March 31, 2019, respectively. Factoring fees for the sales of receivables were recorded in interest expense and were not material.*\n\nI am looking for a possible reason that they might sell their accounts receivables and if this is possibly any type of red flag? When I peruse Google, it seems that a typical reason that a company would sell accounts receivables is to raise cash, but TER typically has a good amount of cash on hand. \n\nI appreciate any help,",
        "created_utc": 1592059352,
        "id": "fupfarj",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1592088152.0
    },
    {
        "author": "thabishop",
        "body": "My parents own LU0179866438, \"advised\" by their banker a long time ago.  \nI know the TER is too much for the stocks part of the Funds and I would defnitely advise them other ETF's. I would like to understand the bonds piece.  \n30% of the funds is in bonds. Is there any article about mixed funds and how to understand bond performance?  \n I dont understand how the yield etc works in such a funds. but I would think paying 1.45% TER for this is rediculous?   \nHow do they justify this TER for bonds if bonds return less in general? Or would they be good at buying bonds at a low price and sell them high before maturity?  \nThanks!",
        "created_utc": 1592243944,
        "id": "fuxais6",
        "score": 1,
        "subreddit": "investing",
        "created": 1592272744.0
    },
    {
        "author": "aforass",
        "body": "Last I checked, NFLX fell in March alongside the market. ZM fell in April (although ZM didn't really follow the market and fell for other reasons). \n\nIf you're convinced this stock won't follow the market and it'll do well in the near ter, go for it. However, consider the fact that there might be a better opportunity to get into it later on.",
        "created_utc": 1591069784,
        "id": "fsllyle",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591098584.0
    },
    {
        "author": "bikelanejane",
        "body": "There's a couple impatient noobs trying to make plays on TER. Low volume and what feels like a low float seems to make it move fairly easily.  Just look at that drop eod Friday. I want to catch this stock in the 2.30's again. I think it's going to fly like ACB did when it was dancing in the $2's for ages and then shot to $8+ in Oct 2017 before the top during the 2017 holidays",
        "created_utc": 1591480268,
        "id": "ft71u29",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591509068.0
    },
    {
        "author": "lincoln929",
        "body": "Anybody has any recommendation on TER?",
        "created_utc": 1591641591,
        "id": "fte8g97",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591670391.0
    },
    {
        "author": "bikelanejane",
        "body": "Patience. It'll come again. Pot stocks still do not have everyone's attention. Let alone TER",
        "created_utc": 1591664415,
        "id": "ftfghvm",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591693215.0
    },
    {
        "author": "FerrariBenz",
        "body": "TER looking coiled and ready to go",
        "created_utc": 1591816443,
        "id": "ftm53it",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591845243.0
    },
    {
        "author": "Hypn0sh",
        "body": "What are you talking about? Long ter. Trend up / midterm up. 2 day trend ( not even saying lower timeframe) down so open your autist eyes",
        "created_utc": 1592175784,
        "id": "fuughc1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592204584.0
    },
    {
        "author": "OG-sippingthatlean-O",
        "body": "Who do you think major LPs will be?  My guess is \nCGC, if constellation doesn’t go bk and Klein isn’t a fraud, Hexo if their drinks with molson are a killer. Fire; If premium weed is actually favoured over price, VFF EMH (PSF). TER. IMO APHA already made it. many other companies are too sketchy and a fraud. \nweedmd medically if union deal goes great. \n5/6 major LPs is logical, and no where close to excessive.",
        "created_utc": 1591861321,
        "id": "ftoad40",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591890121.0
    },
    {
        "author": "Greatkesh",
        "body": "I agree, I think it’s the same idea as many trades.  Buy the dips and sell the highs.   This one just recently dipped HARD.   So hopefully news will wake this up.    I’m watching for entry this morning.   \n\nAlso, the President of the company’s last AGV company was bought out recently for $165,000,000 buy Teradyne ($TER) which is trading in the $65-$70 range.    It’s an interesting play here.  https://roboticsandautomationnews.com/2019/10/23/teradyne-doubles-down-on-mobile-robots-with-autoguide-acquisition/26423/",
        "created_utc": 1591016691,
        "id": "fsitult",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591045491.0
    },
    {
        "author": "monkey_prick",
        "body": "* Unconventional Oil &amp; Gas\n* 0.54% TER\n* &lt;10M AUM\n* 35 holdings\n* Barely any volume\n\nHow many red flags do you need? Cause you got them all",
        "created_utc": 1591198233,
        "id": "fsr7wj1",
        "score": 1,
        "subreddit": "investing",
        "created": 1591227033.0
    },
    {
        "author": "learningis1st",
        "body": "FXAIX - 24%\n\nCSIQ - 23%\n\nTSM - 6%\n\nGILD - 6%\n\nINTC - 4%\n\nCTXS - 2%\n\nSTX - 2%\n\nTER - 2%\n\nLOGM - 2%\n\nDBX - 2%\n\nABBV - 1%\n\n...",
        "created_utc": 1591081909,
        "id": "fsm2l4k",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591110709.0
    },
    {
        "author": "BxlVie",
        "body": "Since I am from Europe, I use this one for s&amp;p500: https://www.trackingdifferences.com/ETF/ISIN/IE00B5BMR087 But I know in US u can buy vanguard ETF's witch lower costs (TER). U can go for s&amp;p500, higher risk higher reward because you are still young. Later I would recommend an ETF covering whole world (Dev markets and emerging markets). Also here, in europe we have diff ETF's to pick from.",
        "created_utc": 1591623575,
        "id": "ftd9h3e",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591652375.0
    },
    {
        "author": "FerrariBenz",
        "body": "TER, GTII, CURA",
        "created_utc": 1591662218,
        "id": "ftfcmcp",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591691018.0
    },
    {
        "author": "OG-sippingthatlean-O",
        "body": "TER is huge",
        "created_utc": 1591509354,
        "id": "ft8sfd2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591538154.0
    },
    {
        "author": "Doydoy123",
        "body": "my bank offered that generous active fund product of them. 1.6% TER, 1% buy commission. about 1.5% growth/year.\n\nI am so happy that I have a lot of other options now.",
        "created_utc": 1592237698,
        "id": "fuwx75r",
        "score": 1,
        "subreddit": "investing",
        "created": 1592266498.0
    },
    {
        "author": "Haveabagel246",
        "body": "Another reason to factor accounts receivables is to pass on risk of customers not paying to the third party. This would mean the company (TER) would lock in cash flow at a certain rate instead of risking a certain percentage of customers not paying. \n\nSo whether it’s a good idea or not depends on who the customers are.",
        "created_utc": 1592058082,
        "id": "fupdakq",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1592086882.0
    }
]