[
    {
        "author": "armyprivateoctopus99",
        "body": "Oh I keep reading that same line. I hope they are equally cognizant haha",
        "created_utc": 1591732231,
        "id": "ftid7h4",
        "permalink": "/r/pennystocks/comments/gzsan2/wheres_the_guy_who_told_us_tlrd_was_going_up_300/ftid7h4/",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1591761031.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Fucking hilarious how we talk about the market and tickers like they’re actual living human beings or have a cognizant aware existence.",
        "created_utc": 1591826745,
        "id": "ftmqu22",
        "permalink": "/r/wallstreetbets/comments/h0iz8p/what_are_your_moves_tomorrow_june_11_2020/ftmqu22/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591855545.0
    },
    {
        "author": "wilhelm96",
        "body": "Set up a satellite internet hotspot. Have to rent from your provider but It’s actually pretty easy to do. You just have to be cognizant that there will be about a half second delay for your orders to get filled. I’ve traded camping the middle of the Mojave with no humanity within 30 miles In any direction🍳🥃⛱🏕🏜",
        "created_utc": 1591435718,
        "id": "ft3ap7b",
        "permalink": "/r/wallstreetbets/comments/gxbzbj/weekend_discussion_thread_for_the_weekend_of_june/ft3ap7b/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591464518.0
    },
    {
        "author": "Noleova",
        "body": "Who knows on timing, but, y’all do know that we are in THE biggest bubble the market has ever seen, right? Buy the dip has worked and I certainly hope you stacked some cash because if you are cognizant Of this bubble the amount you will make on the way down is going to be life changing. I will say it now, Trump and the Fed (short of buying equities) don’t have a whole lot left to give the markets any confidence to the upside. Buy the Dip will soon be gone and will be replaced with short the rips.",
        "created_utc": 1592437641,
        "id": "fv6fx83",
        "permalink": "/r/wallstreetbets/comments/haz16z/what_are_your_moves_tomorrow_june_18_2020/fv6fx83/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1592466441.0
    },
    {
        "author": "DarkKnight24601",
        "body": "I wouldn’t touch those stocks. Not only are they incredibly unprofitable, the secret is out that they exploit and hurt local business which most consumers are becoming cognizant to.",
        "created_utc": 1591841071,
        "id": "ftnhr33",
        "permalink": "/r/investing/comments/h0m1pm/just_eat_takeaway_to_buy_grubhub_for_73_billion/ftnhr33/",
        "score": 3,
        "subreddit": "investing",
        "created": 1591869871.0
    },
    {
        "author": "Art0002",
        "body": "I kinda like Bollinger Bands. It shows so much including volatility. RSI is important too as well as Slow Stochastics.\n\nI normally (in normal times) just look at a 2 year chart, then compress to a year, then 3 months, etc. \n\nI really pay attention to gap down in stocks. There will be a ton of resistance as the stock recovers. There will be sellers as the stock moves up. \n\nSome say be cognizant of support levels. A line (a stock price level) is either support or resistance. You can see it on the charts drawing horizontal likes. \n\nOnce the support line is breached, it becomes a resistance line because people want to get out of a trade that they have been the bag holder. \n\nI probably watch 100 stocks (my Watchlist). \n\nI trade both stock and options (it’s all the same thing). But low, sell high. Or with options sell high, buy low.",
        "created_utc": 1592875370,
        "id": "fvp50yx",
        "permalink": "/r/options/comments/he4633/indicators/fvp50yx/",
        "score": 3,
        "subreddit": "options",
        "created": 1592904170.0
    },
    {
        "author": "the_lilypad",
        "body": "Which part?\n\nLending is unattractive because with the federal funds rate effectively at 0 guaranteed until 2022, it's a race to the bottom for loan fees and the credit risk of loaning money (especially now, during the pandemic/economic effects) outweighs the worth of the loan. We should expect - I think we already have - lending to become stricter a la what happened in 2008 with mortgage loans.\n\nAssuming the economy resumes and V-shapes or whatever, when banks start lending significantly the actual money supply will trigger inflation, since the value of the goods produced will not have changed in material terms (just the dollar will be worth less). The Fed can respond to this by raising rates, but oh wait, that will crash the economy again.\n\nEdit: Additionally, banks (I right now work in fintech) are very cognizant of the impending credit risk caused by the end of PPP/the bloated unemployment. If the economy doesn't restart as people hope and both of those run out, things will get very very messy. That's exactly why the Fed said what it said today during the stress test.",
        "created_utc": 1593124325,
        "id": "fw045pd",
        "permalink": "/r/wallstreetbets/comments/hft4mc/what_are_your_moves_tomorrow_june_26_2020/fw045pd/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593153125.0
    },
    {
        "author": "ZenMaster1212",
        "body": "Just to be clear, u/NamasteMotherLover, is selling you this stock on the basis that he thinks it will run on a small float. This generally occurs independently of a business's fundamental performance, i.e. revenue/income etc., and is subject to the hype it gets from retail investors. This can lead to large spikes up, but also large spikes down, so be cognizant of that when putting your money into something.\n\n\nAlso: [Here is the link to the slideshow](https://www.sec.gov/Archives/edgar/data/1708176/000121390020013714/ea122496ex99-1_gordonpointe.htm) that OP was referencing, if anyone wants to take a look themselves.",
        "created_utc": 1591902606,
        "id": "ftq4pyy",
        "permalink": "/r/SPACs/comments/h13mu1/gpaq_pro_football_hall_of_fame_next_big_spac/ftq4pyy/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1591931406.0
    },
    {
        "author": "peppermint_nightmare",
        "body": "cost benefit analysis? How much money do you think you're going to make and how much could you make elsewhere in a equivalent amount of time? Otherwise build strategy around the maximum amount of time you can be up and cognizant during trading hours or set trailing/stop losses constantly.",
        "created_utc": 1592003505,
        "id": "funf1q9",
        "permalink": "/r/wallstreetbets/comments/h7s30c/weekend_discussion_thread_for_the_weekend_of_june/funf1q9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592032305.0
    },
    {
        "author": "imgram",
        "body": "Relatively. Wireline and Wireless are inherently natural monopolies and it's the government that keeps the Big 3 in check otherwise I'd imagine Rogers-Shaw and TELUS-BCE to be natural fits. \n\nEvery market in the world ultimately winds up with 2-4 large **facility** operators consistent with the rule of 3. Any new competition that tries to compete with that will lose money, burn cash, and eventually be bought out. Everyone familiar with the economics of the industry knows this.\n\nWhere the risk comes from is government regulations of moving to more service-based competition. I personally don't like this option but I'm cognizant that this is *very* popular with consumer advocacy groups. What I hope for Canada is that the government isn't daft enough to buy into advocacy groups tactics of comparing prices across countries. You can say South Korea is xx% cheaper and therefore Canadians are overcharged but what I will counter with is that the bottom lines don't lie. What are the operating margins of these big Telcos? There is nowhere near the operating profit to match SK/EU/whatever country's pricing while maintaining the network quality/capex that Canada has.  I'm not going to individually pull annual reports for this so I'll rely on google:\n\nTELUS - 20% OM https://www.macrotrends.net/stocks/charts/TU/telus/profit-margins\nBCE - 23% OM https://www.macrotrends.net/stocks/charts/BCE/bce/profit-margins\nRCI - 24% OM https://www.macrotrends.net/stocks/charts/RCI/rogers-communication/profit-margins\n\nIf I were a telco investor, I'd be concerned CRTC/Government comes in and is too aggressive on regulations and kills the OM.",
        "created_utc": 1591087164,
        "id": "fsm8dsx",
        "permalink": "/r/CanadianInvestor/comments/guz6m3/how_safe_are_the_big_telecos_really/fsm8dsx/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1591115964.0
    },
    {
        "author": "Dmoan",
        "body": "Difference being lot of h1b used by tech companies are to bring it on IT consultants from India thru companies like TCS or Cognizant. They squeeze the employees on work using h1b as a threat since the employees cannot quit and look for other job.",
        "created_utc": 1593079686,
        "id": "fvxvcd2",
        "permalink": "/r/wallstreetbets/comments/hf8cor/what_are_your_moves_tomorrow_june_25_2020/fvxvcd2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593108486.0
    },
    {
        "author": "Edzhou2008",
        "body": "Have very similar experiences as well although the pension funds we typically deal with use multiple focus funds from different fund managers and lower tracking error through that. \nYou also have to be cognizant of the fact that pension fund managers suffer from the same risks that we do. Deviate too much from the benchmark could cause them to lose their job after a few bad years of underperformance.",
        "created_utc": 1593175844,
        "id": "fw22zl2",
        "permalink": "/r/SecurityAnalysis/comments/hfpe4v/research_shows_asset_management_has_a_genetic/fw22zl2/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1593204644.0
    },
    {
        "author": "Teach_This",
        "body": "Alf Poor has come across as competent and aggressive in interviews I’ve heard. There were a couple of cringe-worthy moments in the interview this morning but absolutely none of it had to do with Ideanomics or their management. To the contrary, the way Alf spoke about his head of energy was a major takeaway. If that’s their biggest cash cow and they have a rock star of a leader there, the company will be very profitable.  I’m bigger on their company after today, but also cognizant that many traders wanted to hear some major, nuclear, today-type-of-news this morning to make the stock go “to the moon” or whatever right this second. \nThey are making money now, and will make more soon. They seem solid now with exponential potential later which is not always the case with stocks in this price range.",
        "created_utc": 1593097338,
        "id": "fvyks6b",
        "permalink": "/r/RobinHoodPennyStocks/comments/hflk1o/idex_ceo_interview_takeaways_from_this_morning/fvyks6b/",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1593126138.0
    },
    {
        "author": "ILoveBentonsBacon",
        "body": "I flipped UAL and DAL for a nice and tidy profit. UAL was the shit 2 weeks ago. I would do a bit of research and see when the states they're based in are fully opening back up and be cognizant of the fact there may be another wave of lockdowns.",
        "created_utc": 1592137714,
        "id": "fusmreq",
        "permalink": "/r/pennystocks/comments/h8lwl0/when_you_fomo_and_it_works_out/fusmreq/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592166514.0
    },
    {
        "author": "rrrrrrrx123",
        "body": "If pandemic is what brought the earnings, it will just as easily wipe it away. Not to mention, Microsoft and Google have become more cognizant of ZM than ever before. Unlike ZM noise, Teams is being quietly pushed hard in the background. Esp. with Covid wiped out of US narrative, they will not be able to replicate Q1. Period.\n\nAlso, team actively selling is just another give away that Q1 was once in a life time thing for ZM, all thanks to Covid.",
        "created_utc": 1592415275,
        "id": "fv55evj",
        "permalink": "/r/wallstreetbets/comments/haqi1f/zm_is_up_again_and_im_sure_now_it_will_test_the/fv55evj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592444075.0
    },
    {
        "author": "dirtiestofbuttholes",
        "body": "Always be cognizant if FOMO. You’re better off looking around for the new hype train",
        "created_utc": 1592872010,
        "id": "fvoz9rm",
        "permalink": "/r/pennystocks/comments/he0u4c/stocks_that_are_about_to_explode_part_2/fvoz9rm/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592900810.0
    },
    {
        "author": "roytown",
        "body": "I'm starting to handle my parents investments since they are getting quite old and don't have the time or resources to not get tricked by everyone who tells them they can earn money that only helps their bottom line.\n\nTheir insurance broker is pitching them a 3 year, 3% MYGA. Now I'm looking over the brochure ( I asked for contract, so that's a red flag for me that I got a sales paper instead) and it's not mentioning fees or anything else in there. They have their rating posted as A- (again, I'm skeptical) but I don't know how ratings for annuities work. There has to be account management fees, right?\n\nWhat questions should I be asking, what are some red flags, what are things I should be aware of?\n\nIf it helps I can provide the company name for clarification.\n\nI don't think annuities are \"bad investments\" I just don't know much about them and ironically enough I just heard a radio ad about them the other day specifically targeting boomers (my parents age group).\n\nNow to be honest, my parents don't have all that much saved for retirement and I've been able to increase their portfolio ~15% this year by being very cognizant about less \"secure\" investments that have planned out. They like the idea of easy, secure money however what they have right now won't last them 10 years with perfect health so I need to help them grow as much as possible (safely).\n\nThanks in advance.",
        "created_utc": 1593025377,
        "id": "fvvp2ko",
        "permalink": "/r/investing/comments/hezxsg/daily_advice_thread_all_basic_help_or_advice/fvvp2ko/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593054177.0
    },
    {
        "author": "ne0shi",
        "body": "You'll be just fine. I've been way worse off than you (talking about below the 0 line by a LOT).\n\nThere are always jobs out there too. Sometimes you have to just take what you can get for the time being, even if it's fast food or janitorial. \n\nYou'll need to be cognizant of your lifestyle and will need to save diligently, but you will have enough again very shortly. There's plenty of free or cheap things to do. Living in a cheap apartment also isn't as bad as it seems either, but still select your neighborhood carefully. \n\nIt feels bad now and it will haunt you from time to time later even after you have recovered, but just keep strong goals (like taking proper care of yourself and your mother). \n\nAlso, don't be afraid of asking friends and family for help. There are more people willing to help than you may realize. Just don't ever take advantage of them and try to repay their kindness in various ways.\n\nRemember that there is unemployment to help you stay afloat as well as other assistance programs our there that will help, especially if your mother is elderly. They can provide everything from food to clothes to rent assistance.\n\nLastly, you've learned more about your own limits. Better now than later.",
        "created_utc": 1592467142,
        "id": "fv7nzaa",
        "permalink": "/r/wallstreetbets/comments/hb7s80/lost_my_entire_lifes_savings/fv7nzaa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592495942.0
    },
    {
        "author": "Raoul_Puke",
        "body": "Yes, that's why I prefer Margin accounts even with less than $25k as it provides some flexibility. Just gotta be cognizant of how many day trades you're making.",
        "created_utc": 1591217922,
        "id": "fsseak4",
        "permalink": "/r/pennystocks/comments/gw25rd/day_trading/fsseak4/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591246722.0
    },
    {
        "author": "Pirashood",
        "body": "You make good points. I 100% agree with your point about CAGR being more important than risk with a long time horizon.  Portfolio construction really is personal preference, but would still being very cautious keeping everything in domestic equities.  By keeping everything everything in domestic you are not only exposing yourself to more volatility(the standard measure of risk), but also more tangible risks such as no forex diversification (what would happen if the USD devalues substantially), regulatory risk concentration (what if we enter a phase of fiscal austerity and corporate tax rates in the US go way up), systemic risk concentration (what if the US is the victim of a cyber attack, war, or debt bubble), or even just a plain old stock market bubble(see Japan or the US in 2000). \n\nOn top of that you are probably forgoing higher returns too. The US is currently extremely expensive in relative terms to the rest of the world. Valuations typically mean revert, so just by that fact the US is more likely to underperform over the next decade.  I would be extremely cognizant of any recency bias you might be experiencing. By decade international stocks outperformed the US in the 70s, 80s, and the first decade of the 2000s.  Taking a look at rolling returns for US vs intl stocks illustrates this pretty well.",
        "created_utc": 1592667881,
        "id": "fvg5uiu",
        "permalink": "/r/investing/comments/hcladm/daily_advice_thread_all_basic_help_or_advice/fvg5uiu/",
        "score": 1,
        "subreddit": "investing",
        "created": 1592696681.0
    },
    {
        "author": "supbrother",
        "body": "What does \"fake market\" even mean? Every bearish comment I've seen is based around the pumping up of a bubble, which is completely fair because the Fed is propping up a huge part of the market, as you've mentioned yourself. Do you really think that can happen indefinitely? If so, inflation is not a concern for you?\n\nYou're talking about scary things not being out there while we're in the middle of a global pandemic with mass protests, with a very volatile election on the horizon. Even if you end up being right, you can't exactly say you're being very cognizant of the macroeconomics here man.",
        "created_utc": 1592938307,
        "id": "fvrrosd",
        "permalink": "/r/investing/comments/hei0i4/us_stocks_climb_yet_us_7day_average_of/fvrrosd/",
        "score": 1,
        "subreddit": "investing",
        "created": 1592967107.0
    },
    {
        "author": "4MileRunCapital",
        "body": "Excellent DD. Just your overall thought process of recognizing trend and shifting administration policy followed with how it translates to companies bottom line. \n\nOn a high level this stuff is close to what analysts in Hedge Funds and PE firms do. Keep up the good work. \n\nCTSH seems like it has the most upside but IBM is a safer play but I agree big names with huge India presence will see employee expenses reduced as $150K+ job here will be replaced by 30k- 50K Job in one of the India campus for GOOG, MSFT [et.al](https://et.al). \n\nUS losses out on the tax revenue across the board while (fed/income tax, real estate tax). Now some of these H1-B jobs will be replaced locally but those would be a fraction imo. Why do you think company have started to embrace remote work? Simply to reduce cost. They've figured out they don't need to get into a decade long commercial lease nor do they want the liability of getting sued if an outbreak occurs which is inevitable and there are so much more reasons. More so they now have figured out that they can do far more with less. Many more wave of layoffs are going to come and what you see on the news is just the beginning.",
        "created_utc": 1593373686,
        "id": "fwanb5q",
        "permalink": "/r/wallstreetbets/comments/hhiz0w/trump_bans_h1bs_buy_outsourcers/fwanb5q/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593402486.0
    },
    {
        "author": "MAXSPEED321",
        "body": "From Barrons. new Goldman price targets 6/24\n\n&amp;#x200B;\n\n* Adobe (ADBE), Neutral rated, to $460 from $350\n* Akamai Technologies (AKAM), Neutral rated, to $107 from $102\n* Alphabet, Buy rated, to $1,775 from $1,425\n* Anaplan (PLAN), Buy rated, to $57 from $51\n* Atlassian (TEAM), Buy rated, to $218 from $194\n* Autodesk (ADSK), Buy rated, to $265 from $228\n* Citrix Systems (CTXS), Buy rated, to $172 from $154\n* Cloudflare (NET), Neutral rated, to $39 from $27\n* CrowdStrike Holdings (CRWD), Neutral rated, to $107 from $87\n* DocuSign (DOCU), Neutral rated, to $175 from $100\n* Dropbox (DBX), Sell rated, to $22 from $19\n* Dynatrace (DT), Buy rated, to $55 from $51\n* Elastic (ESTC), Neutral rated, to $100 from $75\n* Facebook, Buy rated, to $265 from $250\n* [Microsoft](https://www.barrons.com/quote/stock/MSFT) (MSFT) Buy rated, to $215 from $198\n* MongoDB (MDB), Neutral rated, to $215 from $169\n* Okta (OKTA), Buy rated, to $230 from $173\n* Oracle (ORCL), Buy rated, to $61 from $58\n* Ping Identity Holding (PING), Neutral rated, to $35 from $22\n* RingCentral (RNG), Buy rated, to $320 from $275\n* Salesforce.com (CRM), Buy rated, to $220 from $204\n* Slack Technologies (WORK), Sell rated, to $31 from $30\n* SolarWinds (SWI), Sell rated, to $18 from $16\n* Twilio (TWLO), Neutral rated, to $225 from $137\n* VMware (VMW), Neutral rated, to $158 from $143\n* Workday (WDAY), Buy rated, to $210 from $181\n* Zoom Video Communications (ZM), Sell rated, to $187 from $154",
        "created_utc": 1593051081,
        "id": "fvwyzmj",
        "permalink": "/r/wallstreetbets/comments/hf8cor/what_are_your_moves_tomorrow_june_25_2020/fvwyzmj/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1593079881.0
    },
    {
        "author": "SweetPot-tay-toes",
        "body": "https://newacademyoffinance.com/outperforming-stocks-second-wave/\n\nif any of the 5 people who saw me post to buy citrix actually did it when I said, my paypal is at Biggayal@thundercock.tv\n\nIgnore every other terrible call.",
        "created_utc": 1592603747,
        "id": "fvdqoae",
        "permalink": "/r/wallstreetbets/comments/hc7rvq/weekend_discussion_thread_for_the_weekend_of_june/fvdqoae/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1592632547.0
    },
    {
        "author": "GromGrommeta",
        "body": "I think there are better names than CTXS in the cloud space. It’s quite a paradigm shift that suddenly cloud stocks with giant P/S ratios and no earnings are defensive in this market. Same with e-commerce: SHOP, MELI, SE all hitting new ATH this week.\n\nClorox is a well-managed defensive stock in any market that I was lucky to purchase pre-rona. Holding because its increased relevance will continue as long as covid is a thing.\n\nOther 3 I wasn’t interested in before covid and not interested now. Gilead in particular is a real loser of a stock. Don’t trust their management to deliver returns over any long-term period.",
        "created_utc": 1592599633,
        "id": "fvdj3bm",
        "permalink": "/r/investing/comments/hc3i60/only_1_of_sp500_counters_saw_positive_share_price/fvdj3bm/",
        "score": 2,
        "subreddit": "investing",
        "created": 1592628433.0
    },
    {
        "author": "tbrucker",
        "body": "CTXS",
        "created_utc": 1592861076,
        "id": "fvof7u8",
        "permalink": "/r/wallstreetbets/comments/hdzqai/what_are_your_moves_tomorrow_june_23_2020/fvof7u8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592889876.0
    },
    {
        "author": "Orzorn",
        "body": "Hedged my near the money calls with far OTM 10p. If Citrix is right then AAL might crash if their financials are revealed to be in dire straits.",
        "created_utc": 1591375817,
        "id": "fszm9be",
        "permalink": "/r/wallstreetbets/comments/gx1vt8/daily_discussion_thread_for_june_05_2020/fszm9be/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591404617.0
    },
    {
        "author": "pirateclem",
        "body": "I used to do all that until I learned to just follow the advice of those smarter than I am.  No reason to reinvent the wheel.\n\nBuy what you use.\n\nIt’s that easy.  If you buy a thing and like it then other people are buying it and liking it too.\n\nKeeping this in mind I bought Amazon when we got our first Alexa.  I bought Citrix and Palo at lows as I bought a lot of that at work.  I bought visa when I realized I put everything on my card for the points.  \n\nI’ve bought only one loser and tons of winners in the last 10 years doing this.",
        "created_utc": 1592268038,
        "id": "fuynhwm",
        "permalink": "/r/stocks/comments/h9n8zp/im_happy_to_admit_that_im_a_total_idiot/fuynhwm/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1592296838.0
    },
    {
        "author": "pmgoldenretrievers",
        "body": "I'd rather buy 1 share of Zoom at $100B valuation than get a free share of Citrix.",
        "created_utc": 1591224377,
        "id": "fssrmy0",
        "permalink": "/r/investing/comments/gvf68d/zoom_video_earnings_and_sales_blow_away/fssrmy0/",
        "score": 2,
        "subreddit": "investing",
        "created": 1591253177.0
    },
    {
        "author": "NotYourMommasBurger",
        "body": "Congrats! I don't know why I decided to hesitate at $1.38 then buy at $6. Very unlike me but we shall see what happens as you say. Citrix attacking gnus basically right after I bought has made me nervous, but perhaps it's a ploy to lower the share price so they can buy more. Only time may tell. It's fine. I only put $2000 in so no big deal.",
        "created_utc": 1591400115,
        "id": "ft10wms",
        "permalink": "/r/pennystocks/comments/gwizcj/rip_gnus_61206320/ft10wms/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1591428915.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  2nd of June\n\n\n\n## Upcoming events for Tuesday, June  2nd\n\n - Stock splits:\n\n    - LPI @ **1:20**\n    - VHI @ **1:12**\n\n - Expected earnings:\n\n  AMBA, AMSC, APPS, BBW, BZUN, CBRL, CRDF, CRWD, DCI, DKS, ENT, EVRI, GRPN, HCR, HQY, HUD, IOTS, JT, LEJU, MDLA, PKX, RGS, RLMD, ROSE, TIF, TISI, TUES, WEI, WUBA, ZM\n\n - Ex-div:\n\n  AAON, AROW, AVT, AVY, BBD, BBDO, GHL, HAL, KRNY, LIN, NNA, NPO, ODFL, OPOF, OTTW, PAHC, PEBK, PJT, SLB, UG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 8.700M)\n    - ISM NY Business Conditions (previous: 4.3%)\n    - ISM-New York Index (previous: 826.5)\n    - Redbook (previous: -1.5%)\n    - Redbook (previous: -5.5%)\n    - Total Vehicle Sales (previous: 8.60M)\n\n## Upcoming events for Wednesday, June  3rd\n\n - Expected earnings:\n\n  AEO, AFMD, ALOT, BWAY, CHNG, CLDR, CMTL, CNK, CORR, CPB, CPRI, CTXR, CZZ, DLPN, ESTC, EXPR, EYES, FOSL, GEF, GOOS, GWRE, HALL, HEPA, HTHT, JAX, LMB, MBOT, MCF, MOGO, PBIO, PXS, QMCO, SBSW, SMAR, TENX, TLYS, UNFI, VOLT, VRA, VRNT, WTI, YJ, ZUO\n\n - Ex-div:\n\n  CEO, FRO, HD, HVT, HVT.A, MBCN, MOS, NEM, NLSN, PTEN, QCOM, RMBI, SSTK, SU\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -9,000K, previous: -20,236K)\n    - Crude Oil Imports (previous: 2.066M)\n    - Crude Oil Inventories (consensus: 3.300M, previous: 7.928M)\n    - Cushing Crude Oil Inventories (previous: -3.395M)\n    - Distillate Fuel Production (previous: -0.024M)\n    - Durables Excluding Defense (previous: -16.2%)\n    - EIA Refinery Crude Runs  (previous: 0.088M)\n    - EIA Weekly Distillates Stocks (consensus: 3.025M, previous: 5.494M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.9%, previous: 1.9%)\n    - Factory Orders (consensus: -14.0%, previous: -10.4%)\n    - Factory orders ex transportation (previous: -3.7%)\n    - Gasoline Inventories (consensus: 1.350M, previous: -0.724M)\n    - Gasoline Production (previous: 0.005M)\n    - Heating Oil Stockpiles (previous: 0.107M)\n    - ISM Non-Manufacturing Business Activity (consensus: 34.0, previous: 26.0)\n    - ISM Non-Manufacturing Employment (previous: 30.0)\n    - ISM Non-Manufacturing New Orders (previous: 32.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 41.8)\n    - ISM Non-Manufacturing Prices (previous: 55.1)\n    - MBA 30-Year Mortgage Rate (previous: 3.42%)\n    - MBA Mortgage Applications (previous: 2.7%)\n    - Markit Composite PMI (consensus: 36.4, previous: 27.0)\n    - Mortgage Market Index (previous: 746.5)\n    - Seevol Cushing Storage Report (previous: -4.261M)\n    - Services PMI (consensus: 36.9, previous: 26.7)\n\n## Upcoming events for Thursday, June  4th\n\n - Expected earnings:\n\n  AINC, AMC, AVGO, BAK, BITA, BMA, BVXV, CAAS, CAL, CARE, CCEP, CIEN, CLUB, CMD, COO, CRC, CVIA, DBI, DLNG, DLTH, DOCU, DOMO, FLR, FUV, GES, GGAL, GHG, GIII, GPS, HBB, HOME, INWK, IRCP, JILL, KLXE, LLEX, LX, MARK, MDB, MIK, MMYT, MOV, MTN, NAV, NGG, NX, OESX, PD, PRTY, RRGB, RTIX, SAIC, SCWX, SFUN, SJM, SPWH, TNP, TTC, UFAB, VJET, WORK, WPRT, XBIT, XELA, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AIN, AJG, AL, AMNB, ANAT, BAC, BAX, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CDK, CERN, CHRW, CTXS, D, ESBK, FFNW, FLO, FRME, GARS, GOLF, GPC, HLI, HWC, HWKN, ICBK, INT, KFRC, KMB, KNX, LCII, MANT, MBWM, MLI, NAVI, NVDA, ORI, PBIP, PCH, PEP, PII, RF, SEE, SLM, SNR, SQM, TGNA, TILE, TRST, TT, UFCS, WM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.130%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Challenger Job Cuts (previous: 1,576.9%)\n    - Challenger Job Cuts (previous: 671.129K)\n    - Continuing Jobless Claims (consensus: 20,100K, previous: 21,052K)\n    - Exports (previous: 187.80B)\n    - Imports (previous: 232.20B)\n    - Initial Jobless Claims (consensus: 1,800K, previous: 2,123K)\n    - Jobless Claims 4-Week Avg. (previous: 2,608.00K)\n    - Natural Gas Storage (consensus: 107B, previous: 109B)\n    - Nonfarm Productivity (consensus: -2.6%, previous: -2.5%)\n    - Trade Balance (consensus: -49.00B, previous: -44.40B)\n    - Unit Labor Costs (consensus: 5.0%, previous: 4.8%)\n\n## Upcoming events for Friday, June  5th\n\n - Expected earnings:\n\n  ATNM, CONN, GVA, IMVT, TPCO, TRCH, UBA, UTSI\n\n - Ex-div:\n\n  AFIN, BF.A, BF.B, CCBG, FAF, GAIN, INSW, KSU, MLR, MNRO, NSP, ORAN, SVBI, UNF, WRI\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 8.6%, previous: 7.9%)\n    - Average Hourly Earnings (consensus: 1.0%, previous: 4.7%)\n    - Average Weekly Hours (consensus: 34.3, previous: 34.2)\n    - CFTC Aluminium speculative net positions (previous: 72.6K)\n    - CFTC Copper speculative net positions (previous: -13.4K)\n    - CFTC Corn speculative net positions (previous: -199.0K)\n    - CFTC Crude Oil speculative net positions (previous: 543.6K)\n    - CFTC Gold speculative net positions (previous: 251.8K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.0K)\n    - CFTC Natural Gas speculative net positions (previous: -61.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -236.3K)\n    - CFTC Silver speculative net positions (previous: 30.9K)\n    - CFTC Soybeans speculative net positions (previous: 87.6K)\n    - CFTC Wheat speculative net positions (previous: -9.9K)\n    - Consumer Credit (consensus: -20.00B, previous: -12.04B)\n    - Government Payrolls (previous: -980.0K)\n    - Manufacturing Payrolls (consensus: -400K, previous: -1,330K)\n    - Nonfarm Payrolls (consensus: -8,000K, previous: -20,500K)\n    - Participation Rate (previous: 60.2%)\n    - Private Nonfarm Payrolls (consensus: -7,750K, previous: -19,520K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 222)\n    - U.S. Baker Hughes Total Rig Count (previous: 301)\n    - U6 Unemployment Rate (previous: 22.8%)\n    - Unemployment Rate (consensus: 19.7%, previous: 14.7%)\n\n^^^^2020-06-02",
        "created_utc": 1591092019,
        "id": "fsmdah9",
        "permalink": "/r/RobinHood/comments/gv4ib3/daily_discussion_thread_june_2nd_2020/fsmdah9/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1591120819.0
    },
    {
        "author": "Otherpeopleskidsman",
        "body": "Schwab has never let me down, and the customer service is stellar. They, like most will transfer your RH free of charge as well.  Interface is a little outdated, but the Citrix app research platform is powerful. \n\nMessage if you want a referral link.",
        "created_utc": 1591136982,
        "id": "fsonoou",
        "permalink": "/r/pennystocks/comments/gvghdr/td_ameritrade_or_charles_schwab/fsonoou/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591165782.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of June\n\n\n\n## Upcoming events for Wednesday, June  3rd\n\n - Expected earnings:\n\n  AEO, AFMD, ALOT, BWAY, CHNG, CLDR, CMTL, CNK, CORR, CPB, CPRI, CTXR, CZZ, DLPN, ESTC, EXPR, EYES, FOSL, GEF, GOOS, GWRE, HALL, HEPA, HTHT, JAX, LMB, MBOT, MCF, MOGO, PBIO, PXS, QMCO, SBSW, SMAR, TENX, TLYS, VOLT, VRA, WTI, YJ, ZUO\n\n - Ex-div:\n\n  CEO, FRO, HD, HVT, HVT.A, MBCN, MOS, NEM, NLSN, PTEN, QCOM, RMBI, SSTK, SU\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -9,000K, previous: -20,236K)\n    - Crude Oil Imports (previous: 2.066M)\n    - Crude Oil Inventories (consensus: 3.038M, previous: 7.928M)\n    - Cushing Crude Oil Inventories (previous: -3.395M)\n    - Distillate Fuel Production (previous: -0.024M)\n    - Durables Excluding Defense (previous: -16.2%)\n    - EIA Refinery Crude Runs  (previous: 0.088M)\n    - EIA Weekly Distillates Stocks (consensus: 2.686M, previous: 5.494M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.0%, previous: 1.9%)\n    - Factory Orders (consensus: -14.0%, previous: -10.4%)\n    - Factory orders ex transportation (previous: -3.7%)\n    - Gasoline Inventories (consensus: 1.000M, previous: -0.724M)\n    - Gasoline Production (previous: 0.005M)\n    - Heating Oil Stockpiles (previous: 0.107M)\n    - ISM Non-Manufacturing Business Activity (consensus: 34.0, previous: 26.0)\n    - ISM Non-Manufacturing Employment (previous: 30.0)\n    - ISM Non-Manufacturing New Orders (previous: 32.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 41.8)\n    - ISM Non-Manufacturing Prices (previous: 55.1)\n    - MBA 30-Year Mortgage Rate (actual: 3.37%, previous: 3.42%)\n    - MBA Mortgage Applications (actual: -3.9%, previous: 2.7%)\n    - MBA Purchase Index (actual: 296.0, previous: 281.2)\n    - Markit Composite PMI (consensus: 36.4, previous: 27.0)\n    - Mortgage Market Index (actual: 717.7, previous: 746.5)\n    - Mortgage Refinance Index (actual: 3,166.7, previous: 3,466.2)\n    - Seevol Cushing Storage Report (previous: -4.261M)\n    - Services PMI (consensus: 36.9, previous: 26.7)\n\n## Upcoming events for Thursday, June  4th\n\n - Expected earnings:\n\n  AINC, AMC, AVGO, BAK, BITA, BMA, BVXV, CAAS, CAL, CARE, CCEP, CIEN, CLUB, CMD, COO, CRC, CVIA, DBI, DLNG, DLTH, DOCU, DOMO, FLR, FUV, GES, GGAL, GHG, GIII, GPS, HBB, HOME, INWK, IRCP, JILL, KLXE, LLEX, LX, MARK, MDB, MIK, MMYT, MOV, MTN, NAV, NGG, NX, OESX, PD, PRTY, RRGB, RTIX, SAIC, SCWX, SFUN, SJM, SPWH, TNP, TTC, UFAB, VJET, WORK, WPRT, XBIT, XELA, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AIN, AJG, AL, AMNB, ANAT, BAC, BAX, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CDK, CERN, CHRW, CTXS, D, ESBK, FFNW, FLO, FRME, GARS, GOLF, GPC, HLI, HWC, HWKN, ICBK, INT, KFRC, KMB, KNX, LCII, MANT, MBWM, MLI, NAVI, NVDA, ORI, PBIP, PCH, PEP, PII, RF, SEE, SLM, SNR, SQM, TGNA, TILE, TRST, TT, UFCS, WM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.130%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Challenger Job Cuts (previous: 1,576.9%)\n    - Challenger Job Cuts (previous: 671.129K)\n    - Continuing Jobless Claims (consensus: 20,050K, previous: 21,052K)\n    - Exports (previous: 187.80B)\n    - Imports (previous: 232.20B)\n    - Initial Jobless Claims (consensus: 1,800K, previous: 2,123K)\n    - Jobless Claims 4-Week Avg. (previous: 2,608.00K)\n    - Natural Gas Storage (consensus: 107B, previous: 109B)\n    - Nonfarm Productivity (consensus: -2.7%, previous: -2.5%)\n    - Trade Balance (consensus: -49.00B, previous: -44.40B)\n    - Unit Labor Costs (consensus: 5.0%, previous: 4.8%)\n\n## Upcoming events for Friday, June  5th\n\n - Expected earnings:\n\n  ATNM, GVA, IMVT, TPCO, TRCH, UBA, UTSI\n\n - Ex-div:\n\n  AFIN, BF.A, BF.B, CCBG, FAF, GAIN, INSW, KSU, LYB, MLR, MNE, MNRO, NSP, ORAN, SVBI, UNF, WRI\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 8.5%, previous: 7.9%)\n    - Average Hourly Earnings (consensus: 1.0%, previous: 4.7%)\n    - Average Weekly Hours (consensus: 34.3, previous: 34.2)\n    - CFTC Aluminium speculative net positions (previous: 72.6K)\n    - CFTC Copper speculative net positions (previous: -13.4K)\n    - CFTC Corn speculative net positions (previous: -199.0K)\n    - CFTC Crude Oil speculative net positions (previous: 543.6K)\n    - CFTC Gold speculative net positions (previous: 251.8K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.0K)\n    - CFTC Natural Gas speculative net positions (previous: -61.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -236.3K)\n    - CFTC Silver speculative net positions (previous: 30.9K)\n    - CFTC Soybeans speculative net positions (previous: 87.6K)\n    - CFTC Wheat speculative net positions (previous: -9.9K)\n    - Consumer Credit (consensus: -20.00B, previous: -12.04B)\n    - Government Payrolls (previous: -980.0K)\n    - Manufacturing Payrolls (consensus: -440K, previous: -1,330K)\n    - Nonfarm Payrolls (consensus: -8,000K, previous: -20,537K)\n    - Participation Rate (previous: 60.2%)\n    - Private Nonfarm Payrolls (consensus: -7,500K, previous: -19,557K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 222)\n    - U.S. Baker Hughes Total Rig Count (previous: 301)\n    - U6 Unemployment Rate (previous: 22.8%)\n    - Unemployment Rate (consensus: 19.8%, previous: 14.7%)\n\n^^^^2020-06-03",
        "created_utc": 1591189910,
        "id": "fsqrukj",
        "permalink": "/r/RobinHood/comments/gvtoib/daily_discussion_thread_june_3rd_2020/fsqrukj/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1591218710.0
    },
    {
        "author": "PHXHoward",
        "body": "Greetings.  CTXS has a slightly elevated IV at 37% for the Jul20 put $130 strike. Ex-dividend date is tomorrow (6/4/20). Thinking it is not good to sell a put on the day before ex-div because the price will drop by the dividend amount tomorrow putting my contract closer to ITM.  \n\nIs the day of ex-div or day after ex-dividend an appropriate entry point?  Does an already declared dividend have much affect on IV since people know what to expect?",
        "created_utc": 1591198296,
        "id": "fsr81cj",
        "permalink": "/r/options/comments/gue5kp/noob_safe_haven_thread_june_0106_2020/fsr81cj/",
        "score": 1,
        "subreddit": "options",
        "created": 1591227096.0
    },
    {
        "author": "WSByolobaggins",
        "body": "Yeah - the mobile app is a fair accusation. Schwab's mobile apps are garbage tier in comparison.\n\nBut, schwab's desktop app is top tier. I like it better than TOS. It's called streetsmart edge. You have to call and get approval to use it. It also has a mobile app, which is better than the standard Schwab app, but still not great.\n\nI have a friend that uses the citrix cloud app in conjunction with streetsmart edge cloud. It's certainly the best option - though still not exactly optimal.",
        "created_utc": 1592511410,
        "id": "fv9lx9d",
        "permalink": "/r/wallstreetbets/comments/hbh656/robinhood_crashed_yet_again_megathread/fv9lx9d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592540210.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "If you are a passive investor, they are great.\n\nComparing Schwab to Fidelity as I actively trade on both:\n\nSchwab wins on:\n- Tick chart support (Fidelity offers none) and charting options in general\n- UI for both their iPhone app and web\n- Mac support (sort of).  While Fidelity has a native Mac client, it's buggy and slow whereas Schwab's Citrix based streamed client is stable and fast\n- Futures trading (Fidelity does not offer it)\n\nFidelity wins on:\n- Allowing me to do what i want.  Schwab still won't give me more than L1 options.  I've made mistakes and Fidelity quickly fixes them.  \n- Customer support.  A real human always picks up after you get through the automated phone tree.  Each department is happy to give you direct lines to them and they pick up in 2-3 rings.  \n- It's like power-user mode in terms of UI.  i can slice or dice my account any way I want, look at it a dozen different ways, etc.  I can open and close accounts all over the place.  Lots of customization of the UI.  \n- News &amp; Research.  There's just more available on Fidelity.  Schwab has a nice hard copy magazine they send you, but it's all crap vanilla content. \n\nBoth have ample offerings to popular funds.  Neither offers forex or crypto (other than futures on Schwab).",
        "created_utc": 1592755796,
        "id": "fvjqyv0",
        "permalink": "/r/investing/comments/hd8t1z/what_are_the_downsides_of_schwab/fvjqyv0/",
        "score": 1,
        "subreddit": "investing",
        "created": 1592784596.0
    },
    {
        "author": "malharujawane",
        "body": "Buy the CTXS dip",
        "created_utc": 1591716154,
        "id": "fthffoa",
        "permalink": "/r/wallstreetbets/comments/gzkapz/daily_discussion_thread_for_june_09_2020/fthffoa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591744954.0
    },
    {
        "author": "ryan_dfs",
        "body": "CTXS, ZM, MSFT, ZS, CRWD, DOCU",
        "created_utc": 1592170070,
        "id": "fuu60up",
        "permalink": "/r/stocks/comments/h8zxf2/if_work_from_home_becomes_the_norm_in_corporate/fuu60up/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592198870.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of June\n\n\n\n## Upcoming events for Monday, June  1st\n\n - Stock splits:\n\n    - EW @ **3:1** (Payable date: 05/29/2020)\n\n - Expected earnings:\n\n  ATEX, ATHM, AXAS, CANF, CSWC, ENS, ERJ, GSM, HHR, IDXG, IRS, LONE, MLAB, NAOV, NGL, OGEN, PIXY, PLX, PRCP, PSTI, PUMP, QTT, RMBL, SBT, STAF, THR, TTM, XYF\n\n - Ex-div:\n\n  AGR, BPOP, CATY, CRD.A, CRD.B, EBIX, EDUC, ESNT, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, IGD, IID, ITUB, KEY, KNSL, LHX, NEE, QIWI, RCKY, SNP, SOI, SWK, UVSP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.130%)\n    - 6-Month Bill Auction (previous: 0.160%)\n    - Construction Spending (consensus: -6.0%, previous: 0.9%)\n    - ISM Manufacturing Employment (consensus: 35.0, previous: 27.5)\n    - ISM Manufacturing New Orders Index (previous: 27.1)\n    - ISM Manufacturing PMI (consensus: 43.0, previous: 41.5)\n    - ISM Manufacturing Prices (consensus: 37.0, previous: 35.3)\n    - Investing.com Gold Index (actual: 52.4%, previous: 56.9%)\n    - Investing.com S&amp;P 500 Index (actual: 23.9%, previous: 22.3%)\n    - Manufacturing PMI (consensus: 39.8, previous: 36.1)\n\n## Upcoming events for Tuesday, June  2nd\n\n - Stock splits:\n\n    - LPI @ **1:20**\n\n - Expected earnings:\n\n  AMBA, APPS, BBW, BZUN, CBRL, CRDF, CRWD, DCI, DKS, ENT, EVRI, GME, GRPN, HCR, HQY, HUD, IOTS, JT, LEJU, MDLA, MOGO, NEXT, PKX, PXS, RGS, RLMD, ROSE, SB, SOHO, TIF, TISI, TUES, WEI, WUBA, ZM\n\n - Ex-div:\n\n  AAON, AROW, AVT, AVY, BBD, BBDO, GHL, HAL, KRNY, LIN, NNA, NPO, ODFL, OPOF, OTTW, PAHC, PEBK, PJT, SLB, UG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 8.700M)\n    - ISM NY Business Conditions (previous: 4.3%)\n    - ISM-New York Index (previous: 826.5)\n    - Redbook (previous: -1.5%)\n    - Redbook (previous: -5.5%)\n    - Total Vehicle Sales (previous: 8.60M)\n\n## Upcoming events for Wednesday, June  3rd\n\n - Expected earnings:\n\n  ABM, AEO, AKTX, ALOT, AMSC, BWAY, CHNG, CLDR, CMTL, CNK, CORR, CPB, CPRI, CTXR, CZZ, DLPN, ESTC, EXPR, EYES, FOSL, GEF, GOOS, GWRE, HALL, HEPA, JAX, LMB, MBOT, MCF, NOVN, PBIO, PVH, QES, QMCO, SBSW, SMAR, SRNE, TENX, TLYS, UNFI, VOLT, VRA, VRNT, WTI, YJ, ZUO\n\n - Ex-div:\n\n  CEO, FRO, HD, HVT, HVT.A, MBCN, MOS, NEM, NLSN, PTEN, QCOM, RMBI, SSTK, SU\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -9,000K, previous: -20,236K)\n    - Crude Oil Imports (previous: 2.066M)\n    - Crude Oil Inventories (consensus: -1.944M, previous: 7.928M)\n    - Cushing Crude Oil Inventories (previous: -3.395M)\n    - Distillate Fuel Production (previous: -0.024M)\n    - Durables Excluding Defense (previous: -16.2%)\n    - EIA Refinery Crude Runs  (previous: 0.088M)\n    - EIA Weekly Distillates Stocks (consensus: 1.771M, previous: 5.494M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.0%, previous: 1.9%)\n    - Factory Orders (consensus: -12.5%, previous: -10.4%)\n    - Factory orders ex transportation (previous: -3.7%)\n    - Gasoline Inventories (consensus: 0.100M, previous: -0.724M)\n    - Gasoline Production (previous: 0.005M)\n    - Heating Oil Stockpiles (previous: 0.107M)\n    - ISM Non-Manufacturing Business Activity (previous: 26.0)\n    - ISM Non-Manufacturing Employment (previous: 30.0)\n    - ISM Non-Manufacturing New Orders (previous: 32.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 41.8)\n    - ISM Non-Manufacturing Prices (previous: 55.1)\n    - MBA 30-Year Mortgage Rate (previous: 3.42%)\n    - MBA Mortgage Applications (previous: 2.7%)\n    - Markit Composite PMI (consensus: 36.4, previous: 27.0)\n    - Mortgage Market Index (previous: 746.5)\n    - Seevol Cushing Storage Report (previous: -4.261M)\n    - Services PMI (consensus: 36.9, previous: 26.7)\n\n## Upcoming events for Thursday, June  4th\n\n - Expected earnings:\n\n  AINC, AMC, AVGO, BAK, BITA, BMA, BVXV, CAAS, CAL, CARE, CCEP, CIEN, CLUB, CMD, COO, CRC, CVIA, DBI, DLNG, DLTH, DOCU, DOMO, FLR, FUV, GES, GGAL, GHG, GIII, GPS, HBB, HOME, INWK, IRCP, JILL, KLXE, LLEX, MARK, MDB, MIK, MMYT, MOV, MTN, NAV, NGG, NX, OESX, PD, PRTY, RRGB, RTIX, SAIC, SCWX, SEAC, SENS, SJM, SPWH, TNP, TTC, UFAB, VJET, WORK, WPRT, XBIT, XELA, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AIN, AJG, AL, AMNB, ANAT, BAC, BAX, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CDK, CERN, CHRW, CTXS, D, ESBK, FFNW, FLO, FRME, GARS, GOLF, GPC, HLI, HWC, HWKN, ICBK, INT, KFRC, KMB, KNX, LCII, MANT, MBWM, MLI, NAVI, NVDA, ORI, PBIP, PCH, PEP, PII, RF, SEE, SLM, SNR, SQM, TGNA, TILE, TRST, TT, UFCS, WM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.130%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Challenger Job Cuts (previous: 1,576.9%)\n    - Challenger Job Cuts (previous: 671.129K)\n    - Continuing Jobless Claims (consensus: 25,750K, previous: 21,052K)\n    - Exports (previous: 187.80B)\n    - Imports (previous: 232.20B)\n    - Initial Jobless Claims (consensus: 1,800K, previous: 2,123K)\n    - Jobless Claims 4-Week Avg. (previous: 2,608.00K)\n    - Natural Gas Storage (consensus: 107B, previous: 109B)\n    - Nonfarm Productivity (consensus: -2.5%, previous: -2.5%)\n    - Trade Balance (consensus: -44.30B, previous: -44.40B)\n    - Unit Labor Costs (consensus: 4.8%, previous: 4.8%)\n\n^^^^2020-06-01",
        "created_utc": 1591005619,
        "id": "fsigvgq",
        "permalink": "/r/RobinHood/comments/guhudl/daily_discussion_thread_june_1st_2020/fsigvgq/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1591034419.0
    },
    {
        "author": "Orzorn",
        "body": "I'm playing all sorts of weird angles with AAL, mostly because I have no idea where its headed. I've got calls, some hedged 10p, I have 100 shares that I wrote a call against. Basically every thing.\nBest case scenario for me would be AAL going crazy next week, I sell my call, hold my put, and AAL crashes, all the while I theta gang it and write calls as it goes down to 10 like Citrix claims it would.",
        "created_utc": 1591392439,
        "id": "ft0kmzn",
        "permalink": "/r/wallstreetbets/comments/gxbzbj/weekend_discussion_thread_for_the_weekend_of_june/ft0kmzn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591421239.0
    },
    {
        "author": "bettercallsaully",
        "body": "i'm in... gotta use citrix unfortunately, but still so much better. thank you.",
        "created_utc": 1591392793,
        "id": "ft0lc1m",
        "permalink": "/r/wallstreetbets/comments/gx1vt8/daily_discussion_thread_for_june_05_2020/ft0lc1m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591421593.0
    },
    {
        "author": "LeadLeftTackle",
        "body": "\"Hey guys what is the most simple way to turn seawater into platinum\"\n\nRealistically, you'd go long on one of their competitors, of which there are few pure play video conferencing/remoting in/WFH equities (Citrix comes to mind; you could go long MSFT, but you're diluting the exposure you want to remote working - same with AMZN)",
        "created_utc": 1591213409,
        "id": "fss4ofo",
        "permalink": "/r/investing/comments/gvf68d/zoom_video_earnings_and_sales_blow_away/fss4ofo/",
        "score": 1,
        "subreddit": "investing",
        "created": 1591242209.0
    },
    {
        "author": "learningis1st",
        "body": "FXAIX - 24%\n\nCSIQ - 23%\n\nTSM - 6%\n\nGILD - 6%\n\nINTC - 4%\n\nCTXS - 2%\n\nSTX - 2%\n\nTER - 2%\n\nLOGM - 2%\n\nDBX - 2%\n\nABBV - 1%\n\n...",
        "created_utc": 1591081909,
        "id": "fsm2l4k",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fsm2l4k/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591110709.0
    },
    {
        "author": "ZloiAris",
        "body": "Rate my portfolio: 28  \n\n\n* MSFT - impressive growth with new CEO and who stops them? Leader in the enterprise area as a cloud-service provider, team communications provider, Office 365, data analysis and BI facilities. Missing AI component, but their business is well diversified and very steady. International exposure.\n* AAPL - until revolution in smartphones (like NeuraLink or any other interface which will remove smartphones at all) very decent business. 5G is coming, a diversified business, large pile of the cash in the pocket. Apple Music is eating Spotify pie, new SE &amp; iPhone 12 should be a best-seller during X-Mas time. International exposure.\n* V - leader in the world of payments, slowly entering the crypto area, and its balance-sheet a bit better than Mastercard. In general both are good choices. The only issue is that for Visa default currency is USD, while for MA - EUR, and USD might be weakier soon.\n* INTC - leader in the retail chipset area, right now controls almost the entire CPU area.\n* NVDA - one of the few \"growth\" stocks here. Its P/E is very high, but low leverage, impressive P/S and amazing return on employed capital is making the day. NVDA is one of the biggest beneficiaries of the AI industry coming, as well as auto-pilot vehicles.\n* CTXS - ok, there is another growth company. Citrix provides capabilities to work from home without buying dedicated hardware. It means you don't need to buy everyone a corporate laptop to enable them to safely join from home. It is held by top index funds, and attracts a lot of S&amp;P 500 clients, who have high hopes in them.\n* BABA - yes, not the AMZN. BABA right now is extremely undervalued. They look absolutely amazing in every financial aspect, and thanks to extreme digitalisation of Asia, their revenue is growing super fast.\n* NKE - from one hand this is a consumer cyclical company, but from another - very strong brand. Their online shopping presens is huge, as well as exposure to a world market including China. I might assume they will stay around for a while thanks to the new trend of being healthy.\n* ACN - top IT consulting company, basically working for every Fortune 500 company. Right now I see 3 factors they will keep growing. At first, companies needed expertise to migrate to new cloud infrastructure. At seconds, companies will reduce their hiring budget for a while, but will instead hire external resources more intensively. At third, ACN made few acquisitions in the cyber-security area.\n* (Disclaimer: I had worked for EPAM for 5 years and might be biased)  EPAM - one of the faster growing IT services companies in the world. They have a very strong expertise in almost every area, like integration of complex IT solutions, cloud migrations, online shopping, etc. I see them a long term winner of the current setup. Also they start expansion to the Asia market.\n* CIEN - another long-term winner of working from home setup providing hardware configurations for organizing IT servers, clusters, telecommunications, etc.\n* LDOS - one more IT services company but working in the aerospace &amp; defense area with governments. One of the key vendors in the area of COVID-19 tracking facilities and digitalisation of government infrastructure to control COVID-19. Currently holds a portfolio of almost $30 bln agreements.\n* AVGO - another 5G chipset producer winner. Very solid diversified portfolio, good fundamentals.\n* TSM - semiconductor manufacturer, one the largest in the world. Produces chipsets for NVDA, INTC, AVGO, AMD and others. In my opinion, if I bet on the chipset industry it would be weird to not bet on TSM who is located in COVID-19 free area now and also has clients not only from the USA.\n* LRCX - yet another semiconductor company, but this time a leader in the area of automatisation of production lines. They produce solutions which help to automate facilities - the thing most factories will look into to reduce risk of COVID or any other pandemic.\n* MRK - one of the biggest healthcare companies. While everyone is watching Moderna, MRK also participates in the race for COVID-19 vaccine and has a very decent fundamentals and portfolio of products.\n* REGN - innovative bio healthcare company, their financial and earnings are skyrocketing with a huge potential to grow.\n* ROG - Swiss based healthcare company, very strong portfolio and financials\n* BAYN - I am not a super big fan of Bayer, but they are definitely undervalued now due to all PR recent PR issues. Expect to grow 50% in upcoming years, with strong fundamentals. \n* VIAC - one of the most undervalued TV companies right now. Very strong portfolio and strong fundamentals, clean balance sheet. Frankly I spent hours trying to find a reason for such a low price and didn't manage to find any except for \"index fund problem\".  \n* CI - insurance industry under the huge hit due to increasing expenses (people suffer from COVID) and reduced payments (people loosing job and might start cutting their spendings), but Cigna looks like one of the best to survive the storm and has a bright future for a long term. Faitly under-valued strong balance-sheet company.\n* SU - European large cap producer of energy, data and sustainability facilities. \n* BN - Another European large cap company: food producer. They position themselves as a healthy food producer, and COVID should not distract them as much as Americans food producers are. \n* HD - One of rare bets on American consumer spending. Leader in the area of organizing houses in sub-urban zones. With growth of WFH setup, more people expected to migrate to the country-side, so in the long term HD might benefit. Their balance sheet is also very solid.\n* VMC - Basic materials bet. Among all other basic materials companies, VMC looks the best. Also, despite I have high doubts about 1 tln infrastructure package to pass the Congress, VMC would benefit from this idea.\n* BRK-B - no introduction is needed. Buffet underperformed S&amp;P for a long time, but his portfolio is decent, he sits on a large pile of the cash and proper timing of deploying this cash would result in a great return later on. Still pretty safe to add BRK into my portfolio, their long term run looks pretty good.\n\nAlso I am considering adding 4 strong dividend companies with still promising futures.  \n\n\n* IBM - it might look like a dying mamont, but IBM for years is a leader of patents. They year by year increase their presence in cloud infrastructure, AI, robotics and other topics. With new CEO targets growth, IBM has a pretty decent future for the moment with a diversified portfolio of technologies &amp; patents. High hopes on IBM AI technologies. As well, IBM pays very huge dividends, so why not hold them for some time?\n* T - the same story but in another segment. Might benefit from 5G, has a diversified portfolio, enters the \"stream wars\" area and pays a huge dividend. As a diversification for stocks who pays small dividends but grow in market cap, good choice. \n* STX - Another high dividend representative from the hardware storage business. This area will stay around for a while, and STX is healthier than their competitors, look like a safe bet for a long term holding. \n* ABBV - And the last high-dividend company from the healthcare segment. There is a lot of analysis of ABBV around, so no reason to repeat it all.\n\nAnd 1 ETF:  \n\n\n* EXV6 - since I am EU resident, I need to invest into UCITS, and this is a basic materials ETF mainly RIO, BHP, GLEN, AAL. This segment supports all manufacturing around the world, why should they have gone?\n\nThat's basically it. I am still playing around numbers to calculate the potential risk of this portfolio and define the proper % allocation of stocks, but what's your thoughts on the companies from the list?",
        "created_utc": 1592850809,
        "id": "fvnula3",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fvnula3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592879609.0
    },
    {
        "author": "Ankel88",
        "body": "I hereby declare $CTXS and $RST the shitties stock ever issued",
        "created_utc": 1591107892,
        "id": "fsmz0ha",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsmz0ha/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591136692.0
    },
    {
        "author": "SweetPot-tay-toes",
        "body": "I literally called Citrix Systems in the WSB thread before it happened btw, check my history if you want.\n\nI'm not just all salt.",
        "created_utc": 1592603545,
        "id": "fvdqb7s",
        "permalink": "/r/investing/comments/hc3i60/only_1_of_sp500_counters_saw_positive_share_price/fvdqb7s/",
        "score": 1,
        "subreddit": "investing",
        "created": 1592632345.0
    },
    {
        "author": "Twisted9Demented",
        "body": "I think you're completely wrong about this buddy.\n\nWhat apple is trying to do is save cost and use its existing know how and technology and experience it already has making iPhone processors and put it to use along with the ARM optimized chips that it will make for and utilize in mac.\nApple can kind do this as it owns the OS as well and all other components.\n\nDisclaimer: Processes Articiture Operating systems IO ( input and output) and memory hardware drivers and Program like MS Office,  Adobe,  VM ware and safari are all diffrent compoments  both software and hardware based in nature that talk and communicate with each other and exchange and communicate baised on the processors ability to handle and compute.\n\nApple MAC books stepping away from Intels x86 and x64 Articucture means everything I mentioned above needs to be redone. \n\nYes apple would have to redesign their whole OS and they will probably save money on the cost of processor but other software companies would have to rewrite their software to make it compatible with apple arm.\n\nARM has been around as a mobile processor Used in MS Surface RT at first this was not capable of running Windows or MS Office. \nAlso ARM processors have been used in. CHROME BOOKS\nBUT THEY CANNOT  RUN WINDOWS OR MS OFFICE or ADOBE Or Citrix or other bussiness applications..",
        "created_utc": 1593003698,
        "id": "fvuijvy",
        "permalink": "/r/stocks/comments/hdyke6/the_moment_aapl_announced_ending_partnership_with/fvuijvy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593032498.0
    },
    {
        "author": "ryit29",
        "body": "rofl that can't be right. Citrix is way more popular than VMware",
        "created_utc": 1592935865,
        "id": "fvrmnf5",
        "permalink": "/r/wallstreetbets/comments/hebygw/daily_discussion_thread_for_june_23_2020/fvrmnf5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592964665.0
    },
    {
        "author": "wirsteve",
        "body": "There are a handful of companies really benefitting on the books, many are not.\n\nTeledoc, Zoom, Docusign, Citrix, VMWare come to mind as players that got a boost from COVID. Paypal and Square missed earnings but the momentum of the market took their stock prices higher. Which is kind of nuts. I'm excluding the big dogs because Apple, Amazon, etc will be fine.\n\nMillions are saving, hurting the US dollar, many companies took on debt to keep things status quo (or to keep the lights on) during COVID.\n\nI foresee companies going out of business because they can't pay their debts in this hybrid-opened world. Fewer jobs available mean less money being made, which means less money coming into the economy.\n\nI'm optimistic that leadership of companies will do well and make smart business decisions. I'm not sure the terms of the debt that was offered by the government, I think it was pretty forgiving. I just want to be realistic, which I why I like to hear what others think too!",
        "created_utc": 1592941195,
        "id": "fvrxmp5",
        "permalink": "/r/investing/comments/hekr75/all_time_high_markets_all_time_high_savings_all/fvrxmp5/",
        "score": -2,
        "subreddit": "investing",
        "created": 1592969995.0
    },
    {
        "author": "JiYung",
        "body": "FLT, canadian drone company. They also trade on NYSE I think.",
        "created_utc": 1591690812,
        "id": "ftgh1av",
        "permalink": "/r/pennystocks/comments/gzgssw/canadian_penny_stocks/ftgh1av/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1591719612.0
    },
    {
        "author": "Throwaway42069lolz",
        "body": "FLT Drone delivery canada.  I got in at 0.61 a few weeks ago.  Its been a slow steady rise.",
        "created_utc": 1591930532,
        "id": "ftrl5bw",
        "permalink": "/r/pennystocks/comments/h7bzr3/canadian_penny_stocks/ftrl5bw/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1591959332.0
    },
    {
        "author": "IcyOrdinary1",
        "body": "Most of my portfolio is blue chip stocks or ETFs. The only speculative penny stock I have is FLT so I’d say 95/5.",
        "created_utc": 1591998006,
        "id": "fun4vi6",
        "permalink": "/r/CanadianInvestor/comments/h7tiu0/what_percentage_of_your_portfolio_is_blue_chip/fun4vi6/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1592026806.0
    },
    {
        "author": "Throwaway42069lolz",
        "body": "i think they are in a totally different industry.  FLT is targeting medical, industry etc.  I am not sure retail is their focus.",
        "created_utc": 1592070554,
        "id": "fupz7b7",
        "permalink": "/r/investing/comments/h7oo6u/drone_delivery_canada_1_step_closer/fupz7b7/",
        "score": 1,
        "subreddit": "investing",
        "created": 1592099354.0
    },
    {
        "author": "Emfrenxo",
        "body": "See a lot of misinformation in the comments. FLT is one of the few delivery companies in the world, and the only public drone delivery co in Canada. Their market cap was at once $300m and now about $150m. One of countless drone companies to take advantage of investor hype to build a drone company. $300m market cap at no revenue is insane.\n\nEven now at $150m aggressively over valued. They are now setting value with some contract announcements so the pressure is on. \n\nI know the ownership and have been to their facility and can tell you the tech is not the issue. The issue is the INSANE amount of infrastructure and regulation that would be required to integrate drones into an already over-saturated traffic management system.\n\nWe are about 10 years away until we see drone deliveries for every day items, apart from highly remote areas (FLT existing contracts), or depot-to-depot transportation in other countries with less red tape. \n\nNot to say FLT can’t be successful as a drone company, but they will need to survive off other area until the world is willing and capable to accept drones in built-up areas, and in the meantime accept a more realistic valuation as such. Investment-wise the rise has long passed.",
        "created_utc": 1592077055,
        "id": "fuqbjmd",
        "permalink": "/r/pennystocks/comments/h88k85/drone_delivery_canada_starting_ads_for_deliveries/fuqbjmd/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592105855.0
    },
    {
        "author": "zqmage",
        "body": "These drones are made by FLT right?",
        "created_utc": 1592061392,
        "id": "fupiofn",
        "permalink": "/r/pennystocks/comments/h88k85/drone_delivery_canada_starting_ads_for_deliveries/fupiofn/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592090192.0
    },
    {
        "author": "__MrPotato__",
        "body": "Somebody tried to convince me to buy some FLT when they were at 1.79$.\n\nNo thanks.",
        "created_utc": 1592103873,
        "id": "furkvst",
        "permalink": "/r/pennystocks/comments/h88k85/drone_delivery_canada_starting_ads_for_deliveries/furkvst/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592132673.0
    },
    {
        "author": "newengineerhere",
        "body": "ah someone below said the ticker was FLT. My bad",
        "created_utc": 1591368304,
        "id": "fsz6sac",
        "permalink": "/r/pennystocks/comments/gx4yhc/drone_delivery_canada_is_shooting_up/fsz6sac/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591397104.0
    },
    {
        "author": "idiot_in_real",
        "body": "OLLI 7/17 \nFLT C 7/17\nZYXI C 7/17\nBMY C 7/24",
        "created_utc": 1591563636,
        "id": "ftay2hr",
        "permalink": "/r/wallstreetbets/comments/gyk4fc/got_2k_to_play_with_anyone_got_any_plays/ftay2hr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591592436.0
    },
    {
        "author": "sporadicjesus",
        "body": "Drone Delivery Canada\n\n (TSXV: FLT) (OTC: TAKOF)\n\nNot hyped yet.",
        "created_utc": 1592085804,
        "id": "fuqryvm",
        "permalink": "/r/RobinHoodPennyStocks/comments/h7wttn/lets_brainstorm_nonhyped_stocks_for_next_week/fuqryvm/",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1592114604.0
    },
    {
        "author": "littlefin82",
        "body": "FLT drone delivery canada, i would say a good long term hold",
        "created_utc": 1592282203,
        "id": "fuzatbv",
        "permalink": "/r/pennystocks/comments/h9oxvy/good_canadian_penny_stocks/fuzatbv/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592311003.0
    },
    {
        "author": "littlefin82",
        "body": "not an otc stock, its on tsx FLT",
        "created_utc": 1591036587,
        "id": "fsjvdc2",
        "permalink": "/r/pennystocks/comments/gunul8/drone_delivery_corp_the_real_uavs_otc_takof/fsjvdc2/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591065387.0
    },
    {
        "author": "sporadicjesus",
        "body": "CVE: FLT",
        "created_utc": 1591368719,
        "id": "fsz7lpu",
        "permalink": "/r/pennystocks/comments/gx4yhc/drone_delivery_canada_is_shooting_up/fsz7lpu/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591397519.0
    },
    {
        "author": "chicofeliciano25",
        "body": "I've made a post on 1 Canadian penny stock.\n\n [https://www.reddit.com/r/pennystocks/comments/gz610o/loop\\_insights\\_inc\\_mtrxv/](https://www.reddit.com/r/pennystocks/comments/gz610o/loop_insights_inc_mtrxv/) \n\nAlso check out FLT (drone delivery) and WELL.TO",
        "created_utc": 1591692121,
        "id": "ftgibrz",
        "permalink": "/r/pennystocks/comments/gzgssw/canadian_penny_stocks/ftgibrz/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591720921.0
    },
    {
        "author": "littlefin82",
        "body": "you must be mistaken than, that article is about drone delivery canada (flt) or maybe takof is for the us exchange, which is an otc but for the tsx is a regular stock",
        "created_utc": 1591055387,
        "id": "fskwtfa",
        "permalink": "/r/pennystocks/comments/gunul8/drone_delivery_corp_the_real_uavs_otc_takof/fskwtfa/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591084187.0
    },
    {
        "author": "LitecoinAddict",
        "body": "FLT",
        "created_utc": 1591365280,
        "id": "fsz11fy",
        "permalink": "/r/pennystocks/comments/gx4yhc/drone_delivery_canada_is_shooting_up/fsz11fy/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591394080.0
    },
    {
        "author": "Throwaway42069lolz",
        "body": "different segments.  FLT is going for high risk high secuirty items like hospital deliveries.  you haven't figured this out after a year of watching this?",
        "created_utc": 1592072353,
        "id": "fuq2ht8",
        "permalink": "/r/pennystocks/comments/gzc2ua/drone_delivery_canada/fuq2ht8/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592101153.0
    },
    {
        "author": "RunWithTrees",
        "body": "Interesting I've been eying this stock because it can deliver up to 10 pounds i believe and I think rural US states will need it i guess ill buy the FLT version",
        "created_utc": 1592923439,
        "id": "fvqx9q7",
        "permalink": "/r/pennystocks/comments/hefi0t/drone_delivery_canada_announces_2nd_commercial/fvqx9q7/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592952239.0
    },
    {
        "author": "chicofeliciano25",
        "body": "[Well.to](https://Well.to)\n\nMtrx (loop insights)\n\nFlt (drone delivery)\n\nthese are mid-long term hold tho",
        "created_utc": 1592258071,
        "id": "fuy3rce",
        "permalink": "/r/pennystocks/comments/h9oxvy/good_canadian_penny_stocks/fuy3rce/",
        "score": 0,
        "subreddit": "pennystocks",
        "created": 1592286871.0
    },
    {
        "author": "ShankThatSnitch",
        "body": "Fireeye is kinda trash. Shit rev growth, endless profit losses. the stock has only ever trended downward its' whole existence. A better long term play would be Fortinet $FTNT. Also well known, good rev growth, makes lots of profits, stock continually trends up, consistently beats estimate.",
        "created_utc": 1591894129,
        "id": "ftpmz51",
        "permalink": "/r/wallstreetbets/comments/h0znz8/fireye_feye_the_new_normal_and_the_next_cold_war/ftpmz51/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591922929.0
    },
    {
        "author": "Lunaberri",
        "body": "**Next plays: What would you pick?**\n\nDGLY- Digital Ally, Inc.\n\nSWBI - American Outdoor Brands Corp\n\nAAXN - Axon Enterprise Inc\n\nVSTO - Vista Outdoor Inc\n\nFTNT - Fortinet Inc\n\nUNFI - United Natural Foods Inc\n\nAVGO - Broadcom\n\nKR - Kroger\n\nShare your opinions and thoughts",
        "created_utc": 1591068423,
        "id": "fsljqav",
        "permalink": "/r/wallstreetbets/comments/gurxgt/what_are_your_moves_tomorrow_june_02_2020/fsljqav/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591097223.0
    },
    {
        "author": "verto0912",
        "body": "Crowdstrike, Palo Alto Networks, Okta, Splunk, etc.\n\nI live in Australia and there's a Cybersecurity ETF here - I'm sure there are a couple in the US too. Anyhow, here are the top 10 holdings for it.\n\nCrowdstrike - 8.5%\n\nSplunk - 6.3%\n\nPalo Alto - 6.3%\n\nCisco - 5.8%\n\nBroadcom - 5.7%\n\nZscaler - 5.2%\n\nOkta - 3.8%\n\nFortinet - 3.4%\n\nF5 Networks - 3.0%\n\nAkamai - 3.0%",
        "created_utc": 1592356664,
        "id": "fv2rtop",
        "permalink": "/r/stocks/comments/hags62/cyber_security/fv2rtop/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1592385464.0
    },
    {
        "author": "gzaw1",
        "body": "I work in cyber. Fireeye is whack. The only two worth investing in are Fortinet and Palo Alto.",
        "created_utc": 1591901513,
        "id": "ftq2f7y",
        "permalink": "/r/wallstreetbets/comments/h0znz8/fireye_feye_the_new_normal_and_the_next_cold_war/ftq2f7y/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591930313.0
    },
    {
        "author": "SteveSharpe",
        "body": "Okta is going to start getting the Microsoft treatment real bad in the years to come.  Okta's products are significantly better, but Microsoft is bundling theirs into existing license agreements.\n\nSailpoint is likely the big play for security identity in the near future, with their focus more on the governance aspects.  Microsoft will eventually bundle them out as well, but not for a few years at least.\n\nPANW has acquired some good cloud-based security solutions.  It really depends on how well they integrate, which today is not at all.  They do have a SASE solution, which is likely to be a big wave in \"cloud security\" over the next few years.\n\nI think CRWD is basically Carbon Black of a few years ago.  Endpoint solutions come and go all the time in the security industry.\n\nHonestly, I think maybe the best security stock is Fortinet, but that's not really a cloud play specifically.",
        "created_utc": 1591114941,
        "id": "fsnd8pj",
        "permalink": "/r/stocks/comments/gv5o52/best_cloudbased_information_security_stock_zs/fsnd8pj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591143741.0
    },
    {
        "author": "Stupid-Dummy",
        "body": "I work in Cyber and these guys are not the key players anymore.  The core areas that FEYE focuses (Threat Detection, Threat Intel and Incident Response) is highly dependent on talented people.  In the Cyber-biz , the most talented players usually end up at the best companies (i.e., sexy pre-IPO companies, and public companies that are executing well and rising stock price) and when a company's stock spends an extended amount of time bouncing between $10-$15 (like FEYE), the talent departs for places where they will make more money.  There are exceptions of course, but this is generally true in tech and cyber even more so.  Talent drain creates a death-spiral from which recovery is difficult and rare.\n\nSure they might get bought for their installed base which would pop the stock, but failing that, there is no catalyst for this company to benefit from the current situation.\n\nThe hot public companies (PFPT, PANW, FTNT,CRWD) will stay hot until they are not cool any more.  For now those are the cool ones.",
        "created_utc": 1591965835,
        "id": "fulbrxi",
        "permalink": "/r/wallstreetbets/comments/h0znz8/fireye_feye_the_new_normal_and_the_next_cold_war/fulbrxi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591994635.0
    },
    {
        "author": "ketolad1",
        "body": "Please continue. This ia great discussion. Can we actually have an example. Step by step valuations of a growth company?\n\nFor example Docusign or fortinet or even zoom. I have access to bloomberg so if anything needed let me know. I am old school warren style investor but quite excited about how to do vals for growth companies.",
        "created_utc": 1592256226,
        "id": "fuxzu8w",
        "permalink": "/r/stocks/comments/gwo8q2/class_is_in_session_valuing_growth_companies_like/fuxzu8w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592285026.0
    },
    {
        "author": "danzf123",
        "body": "Opinions on FTNT? Probably going to get october calls?",
        "created_utc": 1591969278,
        "id": "fulh6mf",
        "permalink": "/r/wallstreetbets/comments/h7i2lz/daily_discussion_thread_for_june_12_2020/fulh6mf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591998078.0
    },
    {
        "author": "Bourbon-n-Coffee",
        "body": "If it’s a sure bet long term then just buy. Who cares if you are saving a few bucks? FTNT has a strong case, but maybe consider PANW as well. Good luck",
        "created_utc": 1591972987,
        "id": "fulnue6",
        "permalink": "/r/stocks/comments/h7ktm6/opinions_on_getting_in_on_atvi_and_ftnt/fulnue6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592001787.0
    },
    {
        "author": "ReflectAA",
        "body": "The only industries I’ve invested in the last 10 or so years:\n\nSocial media/Ad services (eg: FB, Google)\nMultimedia services (Disney, Netflix, Apple)\nConsumer Tech (Apple, Seagate, Blackberry)\nMicrochips (AMD)\nBiotech/pharma (eg: NBEV, AMRS, JNJ, MRNA)\nRetail\nRestaurants\nAirlines/Airline-related (DAL, BA)\nAuto/Auto-related (GM, UBER, HTZ)\nWireless/internet (CMCSA, AT&amp;T, VZ)\nBanking (BAC, WFC)\n\nThe examples are just examples, I didn’t invest in all of these companies but I did at least consider all of them.  \n\nAnd then some industries I stay out of because I haven’t researched and don’t have time or interest in doing so. Which isn’t to say they look like bad industries. Just ones I’m not comfortable touching until I research the whole industry at once:\n\nPayment services (PayPal, Square)\nBetting/gaming\nSolar energy\nCommodities and commodity related goods (oil, gas, diamonds, gold, etc...)\nOther areas of tech (graphics like NVidia, tech security like Fortinet, cloud services)\n\nI’m sure there’s way more I’m forgetting.",
        "created_utc": 1592056001,
        "id": "fupa6ap",
        "permalink": "/r/stocks/comments/h7wt9t/to_fellow_fresh_meat_investors_like_me_and_to/fupa6ap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592084801.0
    },
    {
        "author": "mightylfc",
        "body": "I have WCLD and SE from this list. Also watching FTNT.\n\nI'd personally exclude microcaps as they are more unpredictable and volatile\n\nEdit: Consider excluding small caps too tbh... I dont go for stocks with less than 1-2 billion market cap",
        "created_utc": 1591305167,
        "id": "fswiwhx",
        "permalink": "/r/stocks/comments/gwq95m/feedback_on_stocks_stan_weinsteins_methods/fswiwhx/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591333967.0
    },
    {
        "author": "RipeForInvesting",
        "body": "Fortinet\nMarten Transport\nAKAM",
        "created_utc": 1592366452,
        "id": "fv37wa9",
        "permalink": "/r/investing/comments/ha85g6/your_top_3_must_own_stocks_for_the_next_15_years/fv37wa9/",
        "score": 1,
        "subreddit": "investing",
        "created": 1592395252.0
    },
    {
        "author": "den0ner",
        "body": "You're in WSB.  Diamond hand this one.  Cyber Security is big right now.  All of Cyber Security Stock has been going up by large margins.  ETC Fastly / Fortinet / Zscaler.",
        "created_utc": 1591019417,
        "id": "fsiy4qc",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsiy4qc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591048217.0
    },
    {
        "author": "roochenz",
        "body": "FireEye\nPalo Alto\nCheckpoint\nFortinet\nOracle",
        "created_utc": 1591387268,
        "id": "ft0aa78",
        "permalink": "/r/stocks/comments/gxayw7/companies_that_make_their_own_hardware_and/ft0aa78/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591416068.0
    },
    {
        "author": "brownbrandon",
        "body": "Are cloud calls fucked tomorrow\n\nHolding:\n\nFTNT 145c 6/19 - CLDR 12.5c 6/19 - VXX 80c 6/26 - HLT 60p 7/17",
        "created_utc": 1592197097,
        "id": "fuvenu3",
        "permalink": "/r/wallstreetbets/comments/h90pkl/what_are_your_moves_tomorrow_june_15_2020/fuvenu3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592225897.0
    },
    {
        "author": "831sweatyfeet",
        "body": "Mixed conservative bag right now. I went easy knowing I have money on the sidelines that I’ve been waiting to get my hands on. Should be here next week. \nPutting 80% into the market wherever I see value, without over extending risk. \n\nMo pm bac brk.b jpm\n\nAdding next week and looking at forward thinking stuff like lulu ulta dpz gpn ma v. Probably add some conservative tech like txn intc etc. not looking to make any outsized gains but to hold. Might use some cash to say trade and keeping 10-20% in cash to buy any kind of dips",
        "created_utc": 1591390969,
        "id": "ft0hqgg",
        "permalink": "/r/wallstreetbets/comments/gx1vt8/daily_discussion_thread_for_june_05_2020/ft0hqgg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591419769.0
    },
    {
        "author": "millerlit",
        "body": "aapl,msft,googl,gpn,v,ma,dis,ba,nvda,amd,amzn",
        "created_utc": 1591562741,
        "id": "ftaweta",
        "permalink": "/r/stocks/comments/gycbx7/your_picks_for_the_next_10_years/ftaweta/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591591541.0
    },
    {
        "author": "831sweatyfeet",
        "body": "Mixed conservative bag right now. I went easy knowing I have money on the sidelines that I’ve been waiting to get my hands on. Should be here next week. \nPutting 80% into the market wherever I see value, without over extending risk. \n\nMo pm bac brk.b jpm\n\nAdding next week and looking at forward thinking stuff like lulu ulta dpz gpn ma v. Probably add some conservative tech like txn intc etc. not looking to make any outsized gains but to hold. Might use some cash to say trade and keeping 10-20% in cash to buy any kind of dips",
        "created_utc": 1591390969,
        "id": "ft0hqgg",
        "permalink": "/r/wallstreetbets/comments/gx1vt8/daily_discussion_thread_for_june_05_2020/ft0hqgg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591419769.0
    },
    {
        "author": "millerlit",
        "body": "aapl,msft,googl,gpn,v,ma,dis,ba,nvda,amd,amzn",
        "created_utc": 1591562741,
        "id": "ftaweta",
        "permalink": "/r/stocks/comments/gycbx7/your_picks_for_the_next_10_years/ftaweta/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591591541.0
    }
]