[
    {
        "author": "hammondish",
        "body": "Diversify across big and small... for long term it's all relative, and big = stability with less risk.\n\nI got inti  buying tech stocks around the end of 2016: GOOG, AMZN, FB: about as big as they get, but all were excellent buys and over 100% gains across the board.\nOn the smaller side, PYPL worked put pretty well too... with slightly more upside: the point is GROWTH POTENTIAL, and CRM has this plus stability.\nMakes it, IMO, an ideal investment.",
        "created_utc": 1596389009,
        "id": "g04dmzu",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596417809.0
    },
    {
        "author": "LoungingBear1",
        "body": "I do like CRM. Especially considering every company I work with seems to be using SFDC. I’m a bit nervous to buy into the bigger tech companies because of the recent run up and the potential for significant cooling. That said, it doesn’t look like CRM has had the insane success that the giants had this last quarter. \n\nI suppose it shouldn’t matter if I’m holding 5+ years. And the small cap companies aren’t any more immune with 50x ratios.\n\nEdit - I should add that I’m incredibly green when it comes to financial statement analysis. Every decision I’ve made to this point has been grounded in how I feel about the product and what I’ve read from others.",
        "created_utc": 1596328465,
        "id": "g01fc89",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596357265.0
    },
    {
        "author": "roadtrippn",
        "body": "I work in Shopify, Bigcommerce and Salesforce. My one issue and it’s not even that serious is Shopify’s url structures. IMO if Bigcommerce can figure out an App Store that matches Shopify I would probably go primarily with BIGC but the speed Shopify currently allows to be running and the breadth of apps is hard to beat.",
        "created_utc": 1596314456,
        "id": "g00r8kp",
        "score": 1,
        "subreddit": "investing",
        "created": 1596343256.0
    },
    {
        "author": "hammondish",
        "body": "You skipped right over it when you mentioned NCNO...\n\nit's CRM (Salesforce is not just a buyer, NCNO is literally BUILT on the Salesforce platform,  as is VEEV and many other companies).\n\nCRM is also an early investor in NCNO.\n\nBuy CRM before you buy NCNO.",
        "created_utc": 1596320557,
        "id": "g0121nu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596349357.0
    },
    {
        "author": "KrakenClubOfficial",
        "body": "Honestly, half of those are WCLD holdings, so maybe just consolidate some of them into that. It's a great ETF.\n\nWCLD: \n\nCRM - 1.38%\n\nVEEV - 2.23%\n\nDOCU - 3.3%\n\nWORK - 1.39%",
        "created_utc": 1596286536,
        "id": "fzza56v",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596315336.0
    },
    {
        "author": "hammondish",
        "body": "Splunk and Slack if I had to pick 2.\nSplunk is at a high right now, and has so many companies under its umbrella but no superstars really, Slack just seems like it will eventually be replaced by the next, well ... Slack.\n\nBut I'd definitely drop Slack (am holding Splunk myself, and looking to buy into CRM)",
        "created_utc": 1596320891,
        "id": "g012md8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596349691.0
    },
    {
        "author": "AngelaQQ",
        "body": "I'm all in on CUNT\n\nSalesforce, Uber, Netflix, Tesla",
        "created_utc": 1596401331,
        "id": "g052v3w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596430131.0
    },
    {
        "author": "hammondish",
        "body": "I'm with this approach, the roughly $2k I lost trading penny stocks in 2014 was the best money I ever spent: learned the basics of trading, avoiding risk, reading through the hype, and towards the end of that batch of trading found Canopy Growth @$2.00, which turned into my first win (and it offset all my previous losses).  Learned the difference between a hyped up pump-and-dump and a legitimate company, and shifted my focus to more established companies, mainly in tech.\n\nSince then I've followed a strategy similar to what the OP has done, buying stocks whose success is evident in my daily life and companies that demonstrate obvious value to their clients: I work as an IT consultant, so when I see that all my clients are using Paypal, building ecommerce sites with Shopify, and hooking up the CRMs with Salesforce, I research these companies and look for investment opportunities.\n\n1. Stick with what you know\n\n2. Trust your instinct\n\n3. Buy for long term",
        "created_utc": 1596376263,
        "id": "g03ih8s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1596405063.0
    },
    {
        "author": "roadtrippn",
        "body": "It’s pretty easy. I migrate sites a lot and it’s all just data structure and manipulation. You can move a Shopify store onto Bigcommerce in a day. The same can be said with bigcommerce as well. Once you get into hundreds of thousands of skus and complex backend it gets more difficult. I’m doing a Salesforce Commerce migration right now that will take a while. People also don’t like to move platforms because if you do it wrong you take a massive hit on SEO.",
        "created_utc": 1596314202,
        "id": "g00qqhz",
        "score": 1,
        "subreddit": "investing",
        "created": 1596343002.0
    },
    {
        "author": "rushpro808",
        "body": "SaaS, PaaS, IaaS are different platforms which provide basically the same underlying service. I’m curious why you single SaaS as an out performer compared to the others? Amazon is primarily IaaS / PaaS with AWS and they are doing as well as salesforce (SaaS).... and you don’t really need to understand the technology involved your trade should be based on much more than just it’s an SaaS provider.",
        "created_utc": 1596381638,
        "id": "g03wk3s",
        "score": 1,
        "subreddit": "investing",
        "created": 1596410438.0
    }
]