[
    {
        "author": "NoFapUnlessGainsPorn",
        "body": "Know some people at TXN, have been forced to take vacation days due to no supplies coming in from China",
        "created_utc": 1583210149,
        "id": "fjc6sry",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1583238949.0
    },
    {
        "author": "CapitalC5",
        "body": "Watchlist: V, MA, GILD, ISRG, MRVL, MSFT\n\nAnd on a lower level: ATVI, GOOGL, BRKB, BIIB, OKTA, QRVO, TXN\n\nJust bought DAL and DIS btw, probably you can pick them up even cheaper this week",
        "created_utc": 1583772700,
        "id": "fk15b5m",
        "score": 2,
        "subreddit": "stocks",
        "created": 1583801500.0
    },
    {
        "author": "BHOmber",
        "body": "A lot of exchanges did away with txn fees last year.",
        "created_utc": 1583170155,
        "id": "fjabieu",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1583198955.0
    },
    {
        "author": "ncreddituser",
        "body": "American Express, regions (and any bank really, they’re gone be buy one get one free), spirit airlines, Honeywell, labcorp, Texas Instruments",
        "created_utc": 1584716396,
        "id": "fl0v4oa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584745196.0
    },
    {
        "author": "zaku6",
        "body": "Polaris, Texas instruments, Disney, McDonald's. Just off the top of my head, what about you?",
        "created_utc": 1584503772,
        "id": "fkt1nc4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584532572.0
    },
    {
        "author": "4pooling",
        "body": "I wish you luck and good fortune. \n\nI'm certain we will drop more. The US is late to containment even though we were aware of COVID-19 in December 2019. \n\nPeople will continue to be indoors and unemployment will spike higher and higher. I am concerned for loved ones. \n\nI'm 30 and I've had time to save and build. I managed to save 18 months of expenses and am continuing to max my 401k and Roth IRA. \n\nFull transparency:\n\nMy Fidelity 401k: 72% S&amp;P 500. 28% US bond index. \n\nMy Vanguard Roth IRA: VWELX. \n\nMy Vanguard taxable account: QQQ, VXUS VDIGX. And a big cash hoard of VMFXX for buying opportunities. \n\nI have a small stock picks portfolio (less than 15% of my total investment portfolio). I'll be adding to: BAM, SBUX, DFS, ETN, TXN, TSLA and few more. \n\n*Notice I don't need extra exposure to the more common names like FB, AMZN, AAPL, MSFT and that's because they're already heavily weighted in QQQ and the S&amp;P 500. \n\n*Notice I keep all my bond exposure in my retirement accounts for maximum tax efficiency.\n\n*****\nIf you're into reading:\n\nGood start are the side bar links at r/investing and r/personalfinance \n\nGoogle the terms: Risk Management, Bogleheads new investor, tax efficient investing, asset allocation, modern portfolio construction, Recessions and investing. \n\nThis link from Vanguard shows historical average annual returns based on different asset allocations. \n\nhttps://personal.vanguard.com/us/insights/saving-investing/model-portfolio-allocations \n\nNotice the \"Worst year\" and \"Years with a loss.\"",
        "created_utc": 1585024627,
        "id": "flcati7",
        "score": 1,
        "subreddit": "investing",
        "created": 1585053427.0
    },
    {
        "author": "Unlucky-Prize",
        "body": "That seems really dumb. REITs do awesome in an easing environment, including mild recessions. Not even sure why you’d hedge that due to txn cost vs alternatives. Such a strange trade.",
        "created_utc": 1583608479,
        "id": "fjtk30s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583637279.0
    },
    {
        "author": "ErichlllZann",
        "body": "\"I have a Texas Instruments calculator with Snake installed. Halp...\"\n-You Two",
        "created_utc": 1584463998,
        "id": "fkr8oy5",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1584492798.0
    },
    {
        "author": "MercifulRhombus",
        "body": "Depends on the characteristics of the index the ETF is tracking. If the index is cap/liquidity weighted there's less hedging risk.\nSome indexes are screwy by design. E.g. the SOX index is \"modified cap\", otherwise it would be dominated by INTC, TXN, MU. So back when AMD was trading in single digits, its SOX weighting was 4x its cap weighting, and 8x its liquidity weighting. End of day hedging by leveraged SOX ETFs would cause it to drill or moon at the close more days than not. (This attracted day-traders which added a lot of fake churn liquidity and exacerbated vol.)",
        "created_utc": 1585395870,
        "id": "flqi9ne",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585424670.0
    },
    {
        "author": "NAHwasagoodman",
        "body": "This post changed my life. I’m selling all these shitty ITM FD’s and purchasing some fat OTM honky tonk TXN puts",
        "created_utc": 1585090816,
        "id": "flessnx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585119616.0
    },
    {
        "author": "planetbeforeneptune",
        "body": "I honestly think that they’re manipulating the market to seem like it’s gunna V rebound.. and if it works and people buy, it actually will happen. Tread lightly retards",
        "created_utc": 1585017079,
        "id": "flc0qv0",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1585045879.0
    },
    {
        "author": "UsuallylurknotToday",
        "body": "Hope your dad gets well v soon dude. Give him our best.",
        "created_utc": 1583365245,
        "id": "fjidfhj",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1583394045.0
    },
    {
        "author": "LOTT42",
        "body": "Lmao y'all fucked up in the head for being happy that people like you guys lost money because RH was down. I can't imagine being that upset about something Jesus christ. I'm just here hoping all of us make bank, while y'all here happy people lost money cause they disagreed with you smh. The Bear v Bull battle is a brotherly affair. Not a nuclear Holocaust.",
        "created_utc": 1583170687,
        "id": "fjachlq",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1583199487.0
    },
    {
        "author": "sand24man",
        "body": "whether you like Joe Rogan or not... I think the first 10 or so minutes of this podcast really brings light to the scenario.\n\nhttps://www.youtube.com/watch?v=E3URhJx0NSw",
        "created_utc": 1583958379,
        "id": "fk8lm6c",
        "score": 40,
        "subreddit": "stocks",
        "created": 1583987179.0
    },
    {
        "author": "NicholasStJames",
        "body": "Oh please, I lost that before my breakfast. If you don’t know what’s about to happen to this economy then your feather hands deserves to lose. Hold those puts and look at the big picture. Those hoping for a V recovery are delusional. See: LITERALLY EVERY FUCKING BEAR MARKET",
        "created_utc": 1584131015,
        "id": "fkfbsnq",
        "score": 38,
        "subreddit": "options",
        "created": 1584159815.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "Ppl are really dumb when it comes to the nuts and bolts. I know doctors who got fleeced by degenerates.\n\nI know someone whose parents are rich af. Kid went to undergrad and got a bs degree, failed out of med school, went to another school for an allied health degree. Parents bought them a $100k car and a house. Kid earns $40k and lives in a HCOL. If you add up the dollars sunk into that kid v their lifetime output they'll never earn enough to break even. Yet they strut around like they're the greatest gift to the world. That's a micro example of the macro issues facing America today.",
        "created_utc": 1583362437,
        "id": "fji8k76",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1583391237.0
    },
    {
        "author": "RssnGopnik",
        "body": "Stock goes up 0.5%\nBulls - “hurrr durr, market is V rebounding errr”\n\nDid American go on full shutdown yet ? Nope",
        "created_utc": 1584650735,
        "id": "fkyku8m",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1584679535.0
    },
    {
        "author": "PAPA_JOHNS_ZIMBABWE",
        "body": "Futures: *jumps up 0.0005% in a market that’s been trending down for three fucking weeks*\n\n[Bull gang:](https://m.youtube.com/watch?v=IFOvTWSYCbc)",
        "created_utc": 1584500827,
        "id": "fksxmmr",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1584529627.0
    },
    {
        "author": "WSBMORONICTRADER",
        "body": "Just joined my accounting class online. Boomer teacher thinks its going to be A V RECOVERY LMAO. I told him in the chat I was buying puts like hell and he got super pissed. What a time to be alive.",
        "created_utc": 1585074938,
        "id": "fldzv7h",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1585103738.0
    },
    {
        "author": "b_m_hart",
        "body": "If people are right, and the jobless report on Thursday 'iS pRiCeD iN\", cool.  How about [30 fucking percent unemployment](https://www.bloomberg.com/news/articles/2020-03-22/fed-s-bullard-says-u-s-jobless-rate-may-soar-to-30-in-2q).  Is that priced in?  Is a third of the freaking country declaring bankruptcy by late summer / early fall priced in?  Shit, we're still a good 3 weeks from the bodies actually starting to pile up.  Is Italy-style [body count](https://www.youtube.com/watch?v=WbfyerV37LQ) priced in?\n\n&amp;#x200B;\n\n20% of SPY component companies were trading at, or within single digits of their 5 year low yesterday.  How's it going to be looking when half, or two thirds have plunged way below previous 5 year lows?\n\n&amp;#x200B;\n\ntl;dr anyone saying stimulus is anything more than a road bump on the highway to hell is a moron.",
        "created_utc": 1585080258,
        "id": "fle9sbj",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1585109058.0
    },
    {
        "author": "ClaimsForFame",
        "body": "LATE AS USUAL\n\nhttps://www.whitehouse.gov/live/\n\nOR\n\nhttps://www.youtube.com/watch?v=feycmqjsLNw&amp;feature=emb_title\n\n\nEDIT: YES IM SPAMMING THIS BECAUSE EVERY OTHER POST IS ASKING **wHeRe dO i wAtCH?**",
        "created_utc": 1584126190,
        "id": "fkf3bgs",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1584154990.0
    },
    {
        "author": "zg44",
        "body": "I think we're not all that far from the bottom despite most of today's move simply erasing Friday's EOD short squeeze.\n\nWe're pretty close to S&amp;P 2350 which was the December 2018 low, though it's easy to argue we should be below that point given the economic problems that the coronavirus has exposed (way too many corporations gorged on cheap debt while throwing away cash on buybacks resulting in poor balance sheets, etc.).  Anywhere below S&amp;P 2300 starts to present some really good long-term buying opportunities.\n\nBottoming is a process, and markets typically never bottom on days like today or last Thursday/Friday.\n\nBut a lot of crucial things happened in the past 24 hours: the Fed threw the whole recession fighting toolkit at the wall and Trump finally appears to have publicly acknowledged the real scope of the problem along with basically saying that we're in one of the worst case scenarios with this coronavirus slowdown/shutdown probably extending all the way to July/August.\n\nMarkets price in events based on expectations, and now we're getting to the point where the horror show that April/May will bring on the coronavirus front is really beginning to get priced into expectations.\n\nSo that's why I think it's starting to become likely that we find a bottom before April.  Of course, after that I'm skeptical of any sort of V-shaped recovery (we might get a mini-V 200+ point gain off a downside overshoot to S&amp;P 2000-2100) but I expect a lot of choppiness and sidewards movement that will benefit theta/cash gang until late May.",
        "created_utc": 1584395443,
        "id": "fkouqxy",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1584424243.0
    },
    {
        "author": "Turtlesaur",
        "body": "Something smells extra fucky here. Why do we need $2,000,000,000,000 stimulus, if we're opening America back up, and expect a V shape recovery and markets are up 7% today.",
        "created_utc": 1585071750,
        "id": "fldu4dh",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1585100550.0
    },
    {
        "author": "Starcraftduder",
        "body": "I'd like to add on to your post with something I posted on another thread:\n\nA month ago I posted a thread making the argument that the global economy would enter a serious downturn unless two things happened: 1) a treatment for the new coronavirus was developed immediately 2) a vaccine is developed by the next flu season\n\nhttps://www.reddit.com/r/China_Flu/comments/f1fm6y/the_world_economy_will_enter_a_serious_downturn/\n\nThe reasoning hinged on whether the characteristics of the virus was dangerous enough to change the behavior of economic actors. We've had past scares like H1N1 or ebola that didn't have any major impact. But my it seemed clear that the characteristics of this new virus was disruptive and dangerous enough to seriously affect the behavior of economic actors and thus negatively impact the economy as a whole. Here's some highlights of what was discussed:\n\n&gt;This is why I said for nCoV to \"blow over\", an affordable treatment needs to be developed pretty much right now. Think about it, who would unnecessarily risk a trip to the movies or take a vacation with the risk of a catching HIGHLY infectious disease that spreads in many ways and spreads asymptomatically and can outright KILL you at up to a 25% probability without hospitalization?\n\n&gt;**Affordable and effective treatment SOON and vaccines before the next flu seasons are crucial to avoiding lasting economic decline**\n\n&gt;But why would there be economic decline? Well, because people will change their behavior as long as the threat of the virus remains. Let's look at what industries will be affected:\n\n- All tourism industry related businesses in Asia will take a huge hit. I'm talking about airlines, hotels, tours, restaurants, tourist destinations, markets, etc.\n\n- Reports already show that business declined by as much as 80% in some tourism driven markets in Thailand. Overall air traffic in China has shrunk from over 17,000 daily flights to 5,000. Hotels, cruises, flights are getting canceled left and right.\n\n- **Many businesses that run on tight margins and those with complex supply chains and a Just-in-Time manufacturing strategy will be seriously hit by this and may even have to file for bankruptcy.** Let's take something like restaurants into consideration. The ones who specialize in deliveries may actually thrive in this market but most restaurants that depend on foot traffic or has high markups and depend on ambience to attract customers will suffer or shutter. They have to keep paying expensive rent and other overhead costs while customers may take months to slowly return. \n\n- **Expect a lot of businesses to start massive layoffs.** Vulnerable Asian airlines will be first. Many airlines like China Airline are already halting recruiting new flight attendants. Others like Cathay Pacific which has negative operating cash flow are asking their crew to take up to month long unpaid leave. They are canceling up to 50% of their flights stretching into at least march. How can they possibly remove the threat of this virus if no treatment/vaccine has been developed? The reason they are shutting down flights will therefore persist, and they will suffer a prolonged period of diminished business.\n\n- **America and the West will also feel the reverberations of China's hard fall.** The ways that the West's economy is tied to China's is too much to even try to list. But just understand that the biggest growth of profit over the last 20 years for many of the largest companies have come from China's consumer class. If that consumer class is not buying stuff, stocks will tank. Companies that spent the last 10 years using cheap debt to finance growth may go into bankruptcy when they are faced from such a drastic and sudden dip in their business. Expect all the weak poorly run businesses to get shaken up and many of them failing in the coming months. \n\n- There will be a feedback loop. There are many industries we can FOR SURE predict big problems for in 2020. We are guaranteed to see layoffs in airlines (especially Asian airlines) in the coming months. Set a reminder on this comment if you don't believe. I can even name you specific companies that will probably go bankrupt.\n\n- **Layoffs will compound upon itself. When airlines, hotels, restaurants, malls, etc are firing workers, the workers won't have money to spend on buying things. This means other businesses may suffer enough to also start firing some workers. Businesses in 2020 overall are so overleveraged that a large percentage of them are not going to be able to handle even a few months of lower business.** They simply can't pay all the expenses and the debt obligation.\n\n&gt;So if my logic and assumptions are correct, we are looking at an inescapable catastrophe for the Asian tourism industry at the very least. Just in Time manufacturing keep about 2 weeks worth of parts. Most businesses already adjusted their supplies to account for the normal Chinese New Year shutdown. We are now coming up on the limits of most JIT supplies. So expect some pretty bad news to be coming out this week and especially by later this month. I'm seeing pretty big dips in the stock market by April. Probably -15% by April and up to -35% by the end of the year. This will be our \"dip\".\n\nAfter I posted this thread, the market (American) went on to make record breaking all time highs. I believe a few things are responsible for this:\n\n- Capital flight from Asia\n\n- Monetary actions from China and other nations\n\n- Poor modeling of previous \"health scares\" including the much talked about \"V-shaped recovery\"\n\n- Use of lagging indicators. There is still news coming out of \"positive economic news\" like ones regarding unemployment.\n\n- Downplay of the virus by governments and international health organization WHO\n\n- Pure ignorance (this was the \"it's just the flu\" period)\n\nAfter a month, we've come to find out some more information about the virus. Some are bad but there are some good news as well.\n\n**Let's start with the good news:**\n\n- Various currently available drugs like Chloroquine have shown efficacy in treating infected patients. Don't expect peer reviewed studies anytime soon, this is just based on what was observed in China where health officials tried throwing all types of drugs at it until they noticed Chloroquine seems to work.\n\n- [Speculation] Heat and humidity may play a part in slowing the spread of the virus: see Singapore, India where they have tested a significant number of patients. Singapore is especially transparent and aggressive in finding cases. If they can contain this as a travel hub, then they may have a roadmap for our own containment once the weather warms. Other coronaviruses also slowed in heat\n\n- [Speculation] Diet may play a part in the spread of the virus. Indian diet rich in Curcumin/Turmeric may have an advantage in either fighting infection or dealing with the symptoms of infection. Hundreds of Indian students were evacuated from the epicenter of the Chinese outbreak and not a single one was infected after quarantine and testing.\n\n- Let's all hope the weather can give the Northern Hemisphere some much needed help in combating this virus (stay out of the Southern Hemisphere)\n\n**Now some bad news:**\n\n- [Controversial] The virus may have mutated at least once. The newer strain is more aggressive. This was a fear that was talked about in the thread from a month ago:\n\n&gt;RNA viruses like nCoV mutates extremely quickly. This means potential resistance or immunization from catching nCoV once may be lost if the virus mutates enough. This also means that there may never be permanent immunization. Any vaccine developed for it may only be effective for a portion of the mutations. And each flu season may bring many different strains of this virus that will be unaffected by developed vaccines. In other words, nCoV may be here to stay, much like other flu viruses.\n\n- It is being reported that it is possible to catch both strains at once (Chinese Journal National Science Review)\n\n- [Speculation] Guangdong reports up to 13% of patients tested positive for virus again weeks after \"recovering\". There are many possible explanations for this, some are benign but there have been several reports from health officials in various parts of China that they're seeing reinfection. Some viruses, the ones that target and manipulate the immune system response, cause more damage the second/third+ time of infection. Some diseases use our antibodies to cause more damage. \n\n- Patients who \"recovered\" from the virus including the recent man in his 30's die after recovery. There is lasting lunge damage in some patients. This means worse lunge function and injuries that allow for opportunistic infections.\n\n- WHO saying around 20% of infected cases require hospitalization. These patients have pneumonia and will drown in lunge liquid if they don't get on ventilators or as a worst case scenario ECMO machines. There are 300 ECMO machines in America. \n\n- Very little has been done to contain virus spread in America. Up to a few days ago, only 500 have been tested compared to tens of thousands in South Korea, a nation a fraction the size/wealth of us. For over a month since China shut its country down, we didn't even have a working test kit. The earlier one was defective.\n\n**Will things get better or worse?**\n\n- For America, things will get much worse before it gets better.",
        "created_utc": 1583603750,
        "id": "fjt4ccx",
        "score": 21,
        "subreddit": "investing",
        "created": 1583632550.0
    },
    {
        "author": "peepaw329",
        "body": "is this real\n\nhttps://www.youtube.com/watch?v=ZQUYKER365U",
        "created_utc": 1583976404,
        "id": "fk9hw2z",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1584005204.0
    },
    {
        "author": "Hanshee",
        "body": "Wrong. We’re going to have a V shape recovery. The virus is the only thing holding the world down. Once that’s gone the world becomes a well oiled machine once again.\n\nEdit: set a reminder one year I dare you",
        "created_utc": 1584745265,
        "id": "fl28fsj",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1584774065.0
    },
    {
        "author": "blingblingmofo",
        "body": "[Pretty sure half this sub is rooting for more deaths.](https://www.youtube.com/watch?v=7eYcWpgCb7o)",
        "created_utc": 1584504481,
        "id": "fkt2kkf",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1584533281.0
    },
    {
        "author": "InappropriateAaron",
        "body": "Joe Rogan podcast just released with an infectious disease expert, super informative:  \n\n\n [https://www.youtube.com/watch?v=cZFhjMQrVts](https://www.youtube.com/watch?v=cZFhjMQrVts)   \n\n\nTLDR - Stay inside, this shits just beginning, buy CCL puts, we're all fucked",
        "created_utc": 1583889599,
        "id": "fk5xaof",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1583918399.0
    },
    {
        "author": "christes",
        "body": "[This calls for a song from 1929.](https://www.youtube.com/watch?v=IXzFPl7UdgQ)",
        "created_utc": 1584388880,
        "id": "fkok8v5",
        "score": 18,
        "subreddit": "investing",
        "created": 1584417680.0
    },
    {
        "author": "MPDisorder",
        "body": "After reading this bullshit, the only thing I want to do is turn your mum around and put her in the V position.",
        "created_utc": 1584589518,
        "id": "fkwdisn",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1584618318.0
    },
    {
        "author": "yolocr8m8",
        "body": "Consider hygiene. \n\nConsider what role cleanliness plays in stopping outbreaks.\n\nConsider India.\n\n [https://www.youtube.com/watch?v=ShbzUkHu0Ug](https://www.youtube.com/watch?v=ShbzUkHu0Ug) \n\n4/17 $26P INDA\n\nStill affordable. \n\nThis isn't to knock the Indian people. I do hate curry. But they've got to get on that plumbing, stat. And hand washing. And getting rid of the caste system.",
        "created_utc": 1584482561,
        "id": "fks59rj",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1584511361.0
    },
    {
        "author": "DespicableCasual",
        "body": "Entire Bay Area (including SF) to shut down at midnight. Mandatory \"shelter-in-place.\" [https://www.sfchronicle.com/local-politics/article/Bay-Area-must-shelter-in-place-Only-15135014.php](https://www.sfchronicle.com/local-politics/article/Bay-Area-must-shelter-in-place-Only-15135014.php)\n\nPress conference at 1pm local: [https://www.youtube.com/watch?v=\\_VwHUvVyO\\_M](https://www.youtube.com/watch?v=_VwHUvVyO_M)",
        "created_utc": 1584384054,
        "id": "fkobs5g",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1584412854.0
    },
    {
        "author": "nosalute",
        "body": "HOLY SHIT TASK FORCE CORONAVIRUS BRIEFING CANCELLED\n\nTRUMP ADDRESSING NATION IN 3 HOURS\n\n [https://www.youtube.com/watch?v=k19WyNDHlmY&amp;feature=youtu.be](https://www.youtube.com/watch?v=k19WyNDHlmY&amp;feature=youtu.be) \n\n&amp;#x200B;\n\nGG Bois if you bought puts you smaht.",
        "created_utc": 1583962548,
        "id": "fk8tdh2",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1583991348.0
    },
    {
        "author": "1poundbookingfee",
        "body": "[https://www.youtube.com/watch?v=VNYNMM0hXXY](https://www.youtube.com/watch?v=VNYNMM0hXXY)\n\nGo to the 4min mark to see where he starts to lose it. \n\n[https://youtu.be/VNYNMM0hXXY?t=240](https://youtu.be/VNYNMM0hXXY?t=240)",
        "created_utc": 1584735145,
        "id": "fl1s3px",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1584763945.0
    },
    {
        "author": "ClaimsForFame",
        "body": "LATE AS USUAL\n\nhttps://www.whitehouse.gov/live/\n\nOR\n\nhttps://www.youtube.com/watch?v=feycmqjsLNw&amp;feature=emb_title\n\n\nEDIT: YES IM SPAMMING THIS BECAUSE EVERY OTHER POST IS ASKING **wHeRe dO i wAtCH?**",
        "created_utc": 1584126281,
        "id": "fkf3gwf",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1584155081.0
    },
    {
        "author": "MustWarn0thers",
        "body": "How would markets react if the 3pm address is just a sweaty Trump in a V-neck, clearly succumbing to the beer virus and vomiting KFC all over his desk?",
        "created_utc": 1584125303,
        "id": "fkf1sza",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1584154103.0
    },
    {
        "author": "ToxicMemer",
        "body": "I love this market. Bulls come back for about 15 minutes when Trump or some other retard in the government tries to pump, saying \"bears r fuk\" and other retarded shit. As soon as futures open the bulls are already back to hiding, masturbating to their worthless call options and jerking off to an image of a V-shaped recovery that won't come. Why even bother embaress yourself like this every days bulls?",
        "created_utc": 1584915932,
        "id": "fl84w7p",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1584944732.0
    },
    {
        "author": "nosalute",
        "body": "[bulls right now](https://www.youtube.com/watch?v=WEdox8cp094)",
        "created_utc": 1583904574,
        "id": "fk6k291",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1583933374.0
    },
    {
        "author": "thait84",
        "body": "The more Trump talks about a V recovery, the more I think we'll be in a long depression. The guy has zero clue about anything",
        "created_utc": 1584929064,
        "id": "fl8pe6d",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1584957864.0
    },
    {
        "author": "taxman1922",
        "body": "[The $1000 stimulus makes me think of Dennis and Mac](https://m.youtube.com/watch?v=YAKOWcs8w54)",
        "created_utc": 1584500293,
        "id": "fkswv2v",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1584529093.0
    },
    {
        "author": "nosalute",
        "body": "# [LEVEL 2 BREAKERS, WE COMIN FOR YOU NI 🅱️ 🅱️A](https://www.youtube.com/watch?v=dTYT-bdttmc)",
        "created_utc": 1584481959,
        "id": "fks48yx",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1584510759.0
    },
    {
        "author": "smc733",
        "body": "B E E R\n\nV I R U S",
        "created_utc": 1583980958,
        "id": "fk9pwy7",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1584009758.0
    },
    {
        "author": "Crabby_Appleton",
        "body": "Look.... the market hates uncertainty.  The more certainty in the market... FED pump, stimulus bill, Europe and US lockdowns, unemployment numbers, Asian recovery, cure and vaccine progress (and the news doesn't have to be good, it just has to be certain), the more the market likes it.  Right now the extent of the damage is coming into sharp focus.  The panic phase will be over.  All bad news will be priced in because it will all be known knowns.  If it wasn't today, we are very near the bottom.  Not saying it won't get retested and we'll have a V shaped recovery, just saying we're not in freefall.  All contingent on them not screwing the pooch on the stimulus bill.  Initiated positions today: long SPY, long leveraged SPY, long leveraged Q's, 40% cash.",
        "created_utc": 1585017767,
        "id": "flc1rb6",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1585046567.0
    },
    {
        "author": "JFK9",
        "body": "Lol now everyone is saying V recovery and downvoting anyone who claims that the virus is worse than the common flu. Waiting for a super red day and tons of \"Thanks RH for making me have iron hands\" posts.",
        "created_utc": 1583206311,
        "id": "fjc1m81",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1583235111.0
    },
    {
        "author": "lnsufficientgravitas",
        "body": "Boomers furiously bought the dip today, ready to die for that V shaped economy  \n\n\nSometime in the next few days: EXECUTE ORDER 66",
        "created_utc": 1585081183,
        "id": "flebhpq",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1585109983.0
    },
    {
        "author": "TheChadUsername",
        "body": "C H I N E S E V I R U S\n\nH\n\nI\n\nN\n\nE\n\nS\n\nE\n\nV\n\nI\n\nR\n\nU\n\nS",
        "created_utc": 1584547726,
        "id": "fkue6d6",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1584576526.0
    },
    {
        "author": "nosalute",
        "body": "**HIGHLIGHTS OF THE DAY:**\n\nKUNG FLU\n\nPeople selling VXX too early\n\nPeople getting baited to buying JNUG calls\n\nS E L F S W A B\n\nI N V I S I B L E  E N E M Y\n\nPeople buying calls at the top and puts at the bottom",
        "created_utc": 1584562857,
        "id": "fkv64n9",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1584591657.0
    },
    {
        "author": "l0gicgate",
        "body": "##Our grand parents are ready to die for a V-shaped recovery",
        "created_utc": 1585072192,
        "id": "fldux18",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1585100992.0
    },
    {
        "author": "BelushiNicholson",
        "body": "6 mins ago - https://www.businesstraveller.com/business-travel/2020/03/11/coronavirus-india-suspends-visa-on-arrival-for-japan-and-south-korea/",
        "created_utc": 1583951373,
        "id": "fk88jgd",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1583980173.0
    },
    {
        "author": "nosalute",
        "body": "# [BREAKING NEWS: UFC MOVING TO THEIR OWN VENUE FOR EVENTS, CANCELLING HOSTING CITIES. NO FANS ALLOWED](https://www.youtube.com/watch?v=JyGO22pRyDk)",
        "created_utc": 1584066786,
        "id": "fkd2iwv",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1584095586.0
    },
    {
        "author": "moroniccow",
        "body": "Spy forming V shape recovery on the daily 5 minute chart. There you go, that’s the recovery people were talking about",
        "created_utc": 1585074551,
        "id": "fldz5ts",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1585103351.0
    },
    {
        "author": "TrippleEntendre",
        "body": "Continues to blow my mind that even with all the tendie taking and absurd shit we’ve seen over the last few weeks, no one is acknowledging we are experiencing a significantly...  \n\n\n\n\nI N V E R T E D   V I B E   C U R V E.",
        "created_utc": 1583898251,
        "id": "fk6c14w",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1583927051.0
    },
    {
        "author": "BernedTendies",
        "body": "Ugh thank goodness I thought I was stupid for inversing my inverse and buying poots at close. Futures looking v red.\n\nTomorrow morning will probably be green though and I'll wish I inversed the inverse of my inverse",
        "created_utc": 1584584191,
        "id": "fkw5whx",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1584612991.0
    },
    {
        "author": "DynamicDentures",
        "body": "\"Just don't dance\"\n\n80% of this sub right now looking at futures:  [https://www.youtube.com/watch?v=NPWYVSWw\\_iw](https://www.youtube.com/watch?v=NPWYVSWw_iw)",
        "created_utc": 1584503436,
        "id": "fkt17f1",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1584532236.0
    },
    {
        "author": "zebrawaterfall",
        "body": "Here you go boys: [Pelosi](https://www.youtube.com/watch?v=bcYr-d-hvAQ&amp;feature=emb_title)",
        "created_utc": 1584122758,
        "id": "fkexj0a",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1584151558.0
    },
    {
        "author": "LargerFiend",
        "body": "Bull confronts bear at grocery store https://www.youtube.com/watch?v=-ZpQTFmuJXo",
        "created_utc": 1583096841,
        "id": "fj7rqbw",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1583125641.0
    },
    {
        "author": "TAWS",
        "body": "Apparently this virus can spread via paper cash. Calls on V and MA",
        "created_utc": 1583365108,
        "id": "fjid74z",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1583393908.0
    },
    {
        "author": "Ijustquaffed",
        "body": "LOL only 1700 people have been tested by CDC\n\nhttps://www.youtube.com/watch?v=HcPAfj38gk4&amp;feature=youtu.be",
        "created_utc": 1583952290,
        "id": "fk8a9hl",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1583981090.0
    },
    {
        "author": "Starcraftduder",
        "body": "- This is not like the previous financial crises. With financial crises, we didn't have overrun healthcare systems, quarantines, and persistent danger of dangerous infectious disease to worry about. The economic impact will be dragged out because of the nature of this virus.\n\n- The biggest danger is that this virus mutates into more strains. This makes vaccination far less effective. If this virus retains its deadliness and persists as a seasonal flu, then we are looking at a potentially permanent shift in human behavior. Entire industries will stop existing because large gatherings of people is too dangerous to continue. This is a heavy dose of speculation but it is also founded in very real possibilities. This virus has a massive evolutionary advantage in that it can spread asymptomatically for up to weeks. This means unlike far \"deadlier\" coronaviruses like SARS and MERS, this virus can continue killing at the same rate without risking burning itself out. SARS and MERS showed symptoms too quickly and killed too much and destroyed its own transmission opportunities by killing or incapacitating the host. This virus has decoupled transmission from keeping the host alive or at least relatively well.\n\n- Imagine what industries are no longer possible if the seasonal flu puts 10-20% of infected people in the hospital. That's the very real potential if this virus mutates into more strains.\n\n**Further thoughts**\n\nI am running out of time writing this so I will give some direct bullet point thoughts on how things will develop. Please try to think about this pandemic critically and organically. **Do not use models from previous recessions because this is fundamentally different from financial crises.** Misapplying models is what led to the \"v-shaped recovery\" consensus that was briefly reached last month. This virus and its mutation has the potential to have lasting fundamental changes on economic actor behavior.\n\nStream of consciousness below:\n\n- As stated last month, massive layoffs and bankruptcies in the Airline industry will occur.\n\n- Many airlines will be bailed out, but equity holders will likely get wiped out\n\n- Biggest problem with airlines is they leveraged to meet booming demand, billions upon billions spent on airplanes that are generating zero revenue while grounded. Airlines lose money maintaining servicing and storing grounded planes. Cathay has half its fleet on the ground.\n\n- Casinos are the hidden big losers industry. They will lose far more than they have already lost. Casinos don't do well in recessions and will do especially poorly because of the virus. They will be trading for pennies on the dollars. They have similar problems as airlines: leverage to meet booming demand, huge overhead and debt service once the casinos stop generating revenue. Unlike grounded planes, at least casinos will get SOME kind of money out of their property. Not enough to cover expenses and debt but it's better than literally nothing.\n\n- Oil industries will be heavily impacted.\n\n- Different breakeven points for different oil extraction operations.\n\n- The most expensive North American oil extraction stops being profitable below $50\n\n- If oil prices hit $30, expect any type of fracking operations to pretty much stop.\n\n- All the towns/cities/local governments depending on this industry for tax revenue is in big trouble. And so are their municipal bonds.\n\n- States or even the federal government may need to bail out the industry.\n\n- States may need to bail out local governments.\n\n- If you are in Texas, New Mexico, OK or anywhere with oil related industry, get prepared for the local economic impact of laid off workers and less spending\n\n- The virus retains high infectiousness in the 50's to low 60's temperature. Check your local forecast to see when the weather gets hotter than that. Spread will likely slow past those temperatures.\n\n- Japan may be pushed into a massive economic crisis. They have the most unbelievable government debt levels of large developed economies. The triple hit of canceled Olympics, lack of tourism, and local recession may finally pop their debt bubble.\n\n- Keep eyes on Singapore for hope of containing virus\n\n- The more hosts this virus has, the more likely it mutates\n\n- Almost all economic data are lagging, don't use lagging data to affirm that things are better than they currently or will be in the future. Conversely, once an inflection point is hit, don't look at lagging economic data to be pessimistic about the future.\n\n- News from China are leading sources of data. News from Europe/Americas are lagging. See what happened in China to predict what will happen in the West (my original post and prediction came from following what happened in China)\n\n- Huge supply shock in some sectors = extreme inflation. There's plenty of opportunity here if you can gather the correct information.\n\n- Huge demand shock = distorted spending on alternatives. Can't go to the movies/concerts? Pay for games and home entertainment\n\n- Private jail industry will likely be devastated. This virus has shown to spread like wildfire among confined populations (Chinese jails and Korean psych ward). Almost 100% of patients were infected in Korean psych ward. The private jail industry will need a bailout.\n\n- Switch from big ticket luxury items to small luxuries. Entrepreneurs get ready to pivot to small luxuries.\n\n- Assuming threat of virus is gone, expect economic transition period of 3 years before we enter boom economy. Adjust the industries you invest in accordingly.\n\n- A lot of companies will go bankrupt or get bailed out. The bailouts come in many forms. Some type of loan payment freeze for entire industries (like tourism) is possible. Freeze on tax collection from businesses is likely. Helicopter money into consumer hands. Or outright bailouts like what we saw with some companies in 2008.\n\n- Most vulnerable and overleveraged companies will go under first.\n\n- Not the type of market to \"buy the dip\" because even financially secure companies may get wiped out in some industries.\n\n- Mass unemployment/underemployment. If you are in the most vulnerable businesses (tourism/travel), try to transition right now if you can. Have a plan to not have a job by May\n\n- The CFR is likely lower than reported. WHO has CFR at above 3%. But many countries like America are not testing to find everyone with virus. So the CFR is exaggerated from an unrepresentative sample. CFR may be well below 1%, but if enough are infected, the medical system will be overwhelmed and the CFR will quickly rise to the ~20% (those who require hospitalization to survive from severe/critical symptoms).\n\n- Governments should seek to reinforce vital functions (food supply, utilities, medical service)\n\n- Governments should seek to have comprehensive stimulus policies in place (US should seek high return investments like infrastructure)\n\n- Central Banks are in big trouble. If banks are afraid to raise rates during a supposed \"booming\" economy, what will they do now? \n\n- Negative effective rates equates to a massive wealth transfer\n\n- Real negative rates is an even bigger wealth transfer\n\n- Timing the market may be tricky because of central bank and government actors. But the direction is negative.\n\nIf I can leave with one last thought on this virus, it is the fact that **this virus is 100% capable of creating a new paradigm, a new normal, in human civilization.** \n\nThe mutations of this virus is key. This virus is uniquely positioned in mutating in ways that will fundamentally change human civilization. It can spread asymptomatically for up to weeks. That's our biggest problem. If it retains this characteristic, then there will be MUCH LESS evolutionary selection pressure for more benign strains of the virus. Remember that with viruses like MERS and SARS, they defeat themselves by showing symptoms too quickly and killing too much. They prevent themselves from being spread. But with this new virus, they can be as dangerous and deadly as they wish to evolve/mutate into, as long as they continue to be asymptomatic while infectious, their deadliness won't play a big factor in their persistence. They can still spread easily.\n\nRemember that of the two strains of this virus published in the Chinese Journal, the NEWER strain is the more aggressive one. Viruses can mutate into deadlier strains just as they can more benign ones. Unlike other diseases, there's no big natural selection pressure for the more benign version of this virus.\n\nIn this new paradigm, entire industries will not exist, and how we function currently may fundamentally shift. Imagine a persistent danger every flu season of being hospitalized 20% of the time by an incredibly stealthy and infectious disease. How will that change how we work, travel, learn in schools, etc?",
        "created_utc": 1583603833,
        "id": "fjt4h07",
        "score": 12,
        "subreddit": "investing",
        "created": 1583632633.0
    },
    {
        "author": "jerseymeathook",
        "body": "[Glad to see people are taking this social distancing stuff seriously.](https://www.youtube.com/watch?v=ZZamrmTMs6w)",
        "created_utc": 1584479337,
        "id": "fkrztix",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1584508137.0
    },
    {
        "author": "morokaiser",
        "body": "If you're holding for the long run now, you did good. But it may go lower from here, don't panic, stick to your plan and buy more if it goes down. You cannot time the bottom, so best bet is to average down. Visa is a great company, it'll be back at 200. It won't be soon though, be patient.",
        "created_utc": 1584550395,
        "id": "fkuj66j",
        "score": 11,
        "subreddit": "stocks",
        "created": 1584579195.0
    },
    {
        "author": "drummerboye",
        "body": "JESUS DIED, BEAUTIFUL TIME! HE ROSE AGAIN IN A V CURVE",
        "created_utc": 1585088286,
        "id": "fleoefv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1585117086.0
    },
    {
        "author": "amh88",
        "body": "can confirm worked for the NJ park for years. they replaced admin management every year keep salaries low. New COO every year. I worked for the Point of Sale / IT department and they literally let a 17 year old (s) have keys to the entire park. The amount of shit we got away with include\n\n1. playing xbox thats hidden in an air vent in our field office\n\n2. smoking bongs, drinking and partying in the same office\n\n3. driving the golf cart through the empty water park's lazy river\n\n4. stealing kegs from the warehouse \n\n5. partying with the international work-visa employees\n\n6. watching the baboons escape the safari enclosure almost weekly",
        "created_utc": 1583977832,
        "id": "fk9kh5u",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584006632.0
    },
    {
        "author": "ClaimsForFame",
        "body": "https://www.whitehouse.gov/live/\n\nOR\n\nhttps://www.youtube.com/watch?v=feycmqjsLNw&amp;feature=emb_title\n\n\nEDIT: YES IM SPAMMING THIS BECAUSE EVERY OTHER POST IS ASKING **wHeRe dO i wAtCH?**",
        "created_utc": 1584125962,
        "id": "fkf2xo4",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584154762.0
    },
    {
        "author": "ClaimsForFame",
        "body": "https://www.whitehouse.gov/live/\n   \nOR\n\n\nhttps://www.youtube.com/watch?v=feycmqjsLNw&amp;feature=emb_title",
        "created_utc": 1584125659,
        "id": "fkf2f7z",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584154459.0
    },
    {
        "author": "DefNotThrowAwayOrNot",
        "body": "Holy fuck\n\nJoe Rogan podcast about Corona\n\n[https://www.youtube.com/watch?v=cZFhjMQrVts](https://www.youtube.com/watch?v=cZFhjMQrVts) \n\n&amp;#x200B;\n\n\"Italian data supports its affecting 40-50 year old group\"",
        "created_utc": 1583894594,
        "id": "fk66ao6",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1583923394.0
    },
    {
        "author": "CroissantDuMonde",
        "body": "**Highlights from Bill Ackman’s meltdown on CNBC today**: “I’m an optimist, but beginning in late January I was getting increasingly bearish. I woke up with a nightmare. And my nightmare was, you had this virus, that replicates and infects incredibly rapidly. Each person infects 2.5 people, each of whom infect 2.5 people. 1 becomes 2 becomes 4 becomes 16 becomes 256 becomes 55,000... And when China shutdown Wuhan, they told people ‘12 hours from now we’re gonna shutdown Wuhan.’ Well what happened? 5 million people left Wuhan. 5 million people dispersed around China. 5 million people dispersed around the world.... The laws of probability tell me this thing is going to be everywhere. Everyone, 50% of the world is going to get infected. It’s just a matter of time...  \n\n“Until a vaccine is manufactured, distributed and injected, we will go through a depression-era period in the country. Millions of people will die around the globe. As many as a million Americans are gonna die... I think it‘s a very high probability millions of Americans have the virus. On February 27th I told the firm that we’re going to work from home. We have a small firm, we’ve got 50 people... we’ve been working from home for weeks and we’ve got 2 people that are likely to have the corona virus based on their symptoms... that’s 4% of our company and taking aggressive measures. It’s incredibly widespread...  \n\n“What happened in Chinatown is a microcosm... this is a model for the country. Hilton is the canary in the coal mine. This is an incredibly well-capitalized, amazing, dominant, global company that actually doesn’t own many hotels. It just collects royalties. Down from like $120 to $50. It’s going to $0 along with every other hotel company. Every hotel is going to be shutdown in the country. Every one... I’m a major shareholder. If we allow this to continue... every hotel company in the world is done. No business can survive a period of 18 months without revenue. And that’s what happens if you operate the way we’re operating now...  \n\n“The only answer for the world is to shut the world for 30 days. It’s so simple, its happening slowly on a rolling basis. You look at how South Korea and Singapore have handled this, but you need a global effort where every country at the same time says ‘for the next 30 days its basically spend time with your family.’... In a month, we’re done with this - the country survives, the economy survives. If we do this just incrementally over time, until there’s a vaccine, we’re done. What will happen is, the hotel industry and the restaurant industry will go bankrupt first. Boeing is on the brink, will not survive without a government bailout. So look at airline industry, auto industry, restaurant industry, hotel industry - capitalism doesn’t work in an 18-month shutdown. Capitalism can work in a 30-day shutdown. We gotta do the 30-day shutdown. And if the president has to bring out the National Guard to keep people in their homes, which I don’t think he will need to do, he should do it.”\n\nhttps://www.youtube.com/watch?v=FItEjc6VtuU",
        "created_utc": 1584574838,
        "id": "fkvqw6n",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1584603638.0
    },
    {
        "author": "ApostropheD",
        "body": "Best wishes to your grandparents/parents. They're worth the V shaped rebound if I'm following what you're saying.",
        "created_utc": 1585019107,
        "id": "flc3pbm",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1585047907.0
    },
    {
        "author": "BenHeisenbergPS2",
        "body": "Broke:\n\n&gt;STIMULUS MEANS V SHAPED RECOVERY BEAR R FUK\n\nWoke:\n\n&gt;The chairman of the Joint Chiefs of Staff suggested that the models show the country would “get through” the coronavirus crisis “probably late May, June, something in that range. Maybe could be as late as July.”",
        "created_utc": 1585068201,
        "id": "fldnrd2",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1585097001.0
    },
    {
        "author": "daserlkonig",
        "body": "Bear markets last on average 14 months, we are not out and I don’t think this will be a V shaped recovery. To add to that we could see people not returning to work anytime soon and the Fed printing their imaginary trillion dollar coins. There will be up days but I’m sure that jobs report is going to hit like a hammer.",
        "created_utc": 1585009507,
        "id": "flbp9rg",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1585038307.0
    },
    {
        "author": "JoeBoredom",
        "body": "Tax cuts for billionaires, bailouts for oil companies, interest rates to zero. The corona virus is [just a cold](https://www.youtube.com/watch?v=PdbpmeUODME).\n\nSPY to the moon",
        "created_utc": 1583868947,
        "id": "fk4whm9",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1583897747.0
    },
    {
        "author": "lnsufficientgravitas",
        "body": "Some dude keeps coughing in the press conference  \n[https://www.youtube.com/watch?v=Du15BUuoBa4](https://www.youtube.com/watch?v=Du15BUuoBa4)",
        "created_utc": 1583792585,
        "id": "fk23v67",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1583821385.0
    },
    {
        "author": "MakIkEenDonerMetKalf",
        "body": "For a bit of entertainment tonight, the flash crash of 2010:\n\n[https://www.youtube.com/watch?v=E1xqSZy9\\_4I](https://www.youtube.com/watch?v=E1xqSZy9_4I)\n\nA modern interpretation of the Hindenburg disaster",
        "created_utc": 1583454844,
        "id": "fjlun1w",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1583483644.0
    },
    {
        "author": "BenHeisenbergPS2",
        "body": "[This sub on Monday](https://www.youtube.com/watch?v=NkPEJoYnx4I&amp;feature=youtu.be)",
        "created_utc": 1583639954,
        "id": "fjwjmhu",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1583668754.0
    },
    {
        "author": "AsphyxiBate",
        "body": "　　　　　　　　　　My puts rocketing towards worthlessness  \n　　　　　　　　　　　　　　￣￣￣￣￣V￣￣￣￣￣　　　　  \n　　　　　　　　　　　　　　∧＿＿＿＿＿    \n　　　　　_＿─￣￣─＿E￣／ |　∧＿∧　 　＼  \n　＿─￣　　　　＿─＜Eﾆ|.　　| (　´∀｀ )　 |  \n　　　　 ─ニ三　＜＜Eﾆ|　　＼| ( っ¶¶o） |  \n　　￣─＿_　　　￣─＜Eﾆ|　　　￣￣￣￣￣|  \n　　　　　　￣─＿＿─￣E＿＼＿＿＿＿＿_／  \nゴーーーー!!!!　　　　　　　　∨",
        "created_utc": 1583353362,
        "id": "fjhqt03",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1583382162.0
    },
    {
        "author": "LITFAMWOKE",
        "body": "I'm gonna buy puts. We either tank or V recovery. I make money or save the U.S economy. Win/win.",
        "created_utc": 1584924219,
        "id": "fl8i53w",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1584953019.0
    },
    {
        "author": "nosalute",
        "body": "Yo wtf we were to busy making money and [SpaceX launched shit to space](https://www.youtube.com/watch?v=I4sMhHbHYXM). Can't wait for this IPO.",
        "created_utc": 1584580687,
        "id": "fkw0hhe",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1584609487.0
    },
    {
        "author": "GordonGekko19",
        "body": "I've got a slight bullish lean to the market now(temp) but have to shake that out of my head...\n\nTalked to people today, everyone is laid off, scared, asking for loan payment deferrals, gyms, small businesses shutting down.  I mean, this is bad, really bad not a V shape recovery.\n\n1/2 selling puts, selling calls\n\n1/4 ITM June/July QQQ puts, AMZN puts (fuck you Amzn) \n\n1/4 weekly calls and travel leaps.  Every big flush pick up 1 name for 2022 if there is a 2022.\n\n&amp;#x200B;\n\nWhat is the catalyst for max fear?  Will it be USA on complete lockdown?  Will it be the death of a prominent figure?  Time?  2nd wave?  People who don't give a shit and infect everyone? \n\n&amp;#x200B;\n\nTLDR: This is disruptive and will not be better in a month.  Short everything, take 50% profit, buy leaps on something utterly beaten down.  Repeat.  Spy $180 I want to say hello.",
        "created_utc": 1584663428,
        "id": "fkz5tbi",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1584692228.0
    },
    {
        "author": "-BLESS-THIS-MESS-",
        "body": "W I N D M I L L S\n\nA L L\n\nO V E R\n\nT H E \n\nP L A C E",
        "created_utc": 1585069691,
        "id": "fldqf20",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1585098491.0
    },
    {
        "author": "n0t_ben",
        "body": "Delusional bulls calling this the V shaped recovery when basically every Tuesday for the last month has been bigly green",
        "created_utc": 1585070345,
        "id": "fldrlqh",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1585099145.0
    },
    {
        "author": "CoinHunterManocean",
        "body": "# Pokemane just tweeted asking how to \"do puts\"\n\n# WEVE REACHED THE BOTTOM.\n\n# Link [www.imgur.com/a/G6rU8] (https://www.youtube.com/watch?v=dQw4w9WgXcQ)",
        "created_utc": 1584071627,
        "id": "fkd95wv",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1584100427.0
    },
    {
        "author": "ignobleesquire",
        "body": "For those missing out on the discussion of briskets, the sounds of iphones dinging, and some light wind noise: https://www.youtube.com/watch?v=q_WM_pMp0Hg",
        "created_utc": 1584127004,
        "id": "fkf4plh",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1584155804.0
    },
    {
        "author": "CptGusMcCrae",
        "body": "My wife says she loves her boyfriend's v line, maybe he trades too!",
        "created_utc": 1584725726,
        "id": "fl1bhw6",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1584754526.0
    },
    {
        "author": "CatcherOfKnives",
        "body": "China [welded people into their homes in Hubei province](https://www.youtube.com/watch?v=XJTDeh88hww) and they've been there even since. Remember this when you read about their \"everything's fine now!\" bullshit.",
        "created_utc": 1584739518,
        "id": "fl1zdhl",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1584768318.0
    },
    {
        "author": "Weakness_Disgusts_Me",
        "body": "buy V.  got it",
        "created_utc": 1584548752,
        "id": "fkug1q5",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1584577552.0
    },
    {
        "author": "hello2016",
        "body": "v ShApEd StOnKoVeRy",
        "created_utc": 1583470174,
        "id": "fjmgrml",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1583498974.0
    },
    {
        "author": "Mr_Find_Value",
        "body": "Jesus Christ, have you seen this video out of New York right now? Those hospitals can't take all these patients. Fucking hell\n\nhttps://www.youtube.com/watch?v=dQw4w9WgXcQ",
        "created_utc": 1583705449,
        "id": "fjyvh0l",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1583734249.0
    },
    {
        "author": "whofcentury",
        "body": "Trudue about to make a speech (currently 100k+ people waiting)\n\n [https://www.youtube.com/watch?v=erCCzcd9eYA](https://www.youtube.com/watch?v=erCCzcd9eYA)",
        "created_utc": 1584378437,
        "id": "fko1sve",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1584407237.0
    },
    {
        "author": "brycedriesenga",
        "body": "**Found another stream**: https://www.youtube.com/watch?v=MIUs08PZcdo\\\n\nEdit: Better sound -- https://www.youtube.com/watch?v=mtw4SPeoHOA",
        "created_utc": 1584643664,
        "id": "fky8dj4",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1584672464.0
    },
    {
        "author": "cmackmason",
        "body": "https://www.youtube.com/watch?v=XkYRI48bXRw \n\nthis is only the beginning.  All these fuckwits about to get on a plane and bring some Corona home with them.",
        "created_utc": 1584636795,
        "id": "fkxwjdf",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1584665595.0
    },
    {
        "author": "light-yagamii",
        "body": "Check this out guys: https://www.youtube.com/watch?v=YQzMH_L-5Ns What's preventing NYC from becoming like Wuhan? People in China took it seriously and wore masks. We don't even have that. here. They're saying Wuhan will end the quarantine end of April. But what's going to happen after that. Will countries open up their borders again? It only takes one person to infect everyone.  I feel like this will last a few years until everyone is exposed to it. You either live or die. \n\nA few weeks back New Yorkers couldn't imagine the current situation. What's to say the worst won't happen here? \n\nBuy puts for April and May.",
        "created_utc": 1584751148,
        "id": "fl2hhtf",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1584779948.0
    },
    {
        "author": "philmacrack123",
        "body": "Watch the v to green",
        "created_utc": 1584588131,
        "id": "fkwbm8r",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1584616931.0
    },
    {
        "author": "formerbuck",
        "body": "if you guys wanna be bored out of your mind tonight\n\n[https://www.youtube.com/watch?v=NzPxPkR73zk](https://www.youtube.com/watch?v=NzPxPkR73zk)",
        "created_utc": 1585011972,
        "id": "flbt2jg",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1585040772.0
    },
    {
        "author": "EnronMcWorldCom",
        "body": "C H I N E S E \n\nV I R U S",
        "created_utc": 1584923535,
        "id": "fl8h3i4",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1584952335.0
    },
    {
        "author": "Zigxy",
        "body": "Its from League of Legends, this song and video came out with the release of a character Jynx. \n\nShes a bloodthirsty psychopath. \n\nhttps://www.youtube.com/watch?v=0nlJuwO0GDs\n\n-----\n\nLeague has by far the best character promotional materials of any gaming company.\n\nThe most recent was last week on Friday the 13th when they announced they'd be reworking an old character named Fiddlesticks (evil scarecrow that mimics victims voices)\n\nhttps://www.youtube.com/watch?v=HIzPHd6DFM8",
        "created_utc": 1584644293,
        "id": "fky9h8x",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1584673093.0
    },
    {
        "author": "khydrox",
        "body": "[chamath always spittin that wisdom. tl;dr hedge funds leveraged to the tits we ded](https://www.youtube.com/watch?v=NvEWez59fbI)",
        "created_utc": 1584670130,
        "id": "fkzg0zh",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1584698930.0
    },
    {
        "author": "kyan-",
        "body": "shit ps5 reveal going on now\n\n [https://www.youtube.com/watch?v=ph8LyNIT9sg&amp;feature=emb\\_title](https://www.youtube.com/watch?v=ph8LyNIT9sg&amp;feature=emb_title)",
        "created_utc": 1584547334,
        "id": "fkudh74",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1584576134.0
    },
    {
        "author": "killerk14",
        "body": "Tomorrow I’m probably gonna watch my account go down by about 20% because I’m all month-out puts and cashed out my hedges (except for VXXp LEAPS) way too early today. But you know what, fuck it, trump acting like we can see the light at the end of the tunnel when this whole thing just barely started doesn’t sit right with me. Bear markets don’t end in a month and they don’t have V-shaped recoveries. I’m happy bulls can catch a break, including my retirement account. My puts are fine. Lower the level of hate in here.",
        "created_utc": 1585089127,
        "id": "flepvkj",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1585117927.0
    },
    {
        "author": "plasteroid",
        "body": "Remember that poll from yesterday on Red vs Green\n\n[https://p94.f3.n0.cdn.getcloudapp.com/items/8LuJnYQJ/Image+2020-03-04+at+12.27.33+PM.png?v=32e0a0ba5ebc8a69d60f96212cb59704](https://p94.f3.n0.cdn.getcloudapp.com/items/8LuJnYQJ/Image+2020-03-04+at+12.27.33+PM.png?v=32e0a0ba5ebc8a69d60f96212cb59704)\n\nRed was 70\n\nGreen 30\n\nWe should do that everyday, so i know to go opposite",
        "created_utc": 1583342998,
        "id": "fjh7zx1",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1583371798.0
    },
    {
        "author": "ringrawer",
        "body": "Why don't you call it a \"pandemic\"?\n\n\"Alright\"\n\nhttps://www.youtube.com/watch?v=b5SByM75Thg",
        "created_utc": 1583946875,
        "id": "fk805qm",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1583975675.0
    },
    {
        "author": "Miragey",
        "body": "[https://www.youtube.com/watch?v=Zy4KVGZjy8I&amp;feature=youtu.be](https://www.youtube.com/watch?v=Zy4KVGZjy8I&amp;feature=youtu.be)\n\nSo they are basically saying they arent testing. Because the testing kit is just being completed.\n\nMillions of tests (if needed) over the next few weeks.",
        "created_utc": 1583345698,
        "id": "fjhcwo5",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1583374498.0
    },
    {
        "author": "ringrawer",
        "body": "New all time low 10 year t-bond rate of \"0.829\" has been achieved.\n\nhttps://www.youtube.com/watch?v=jin1Qm6Hdxw\n\nFound the perfect headstone for the 10y Tbond.\nhttps://clearstreammonuments.com/memorials/proddetail.php?prod=DIECYCLE4-harley-rider-headstone&amp;cat=19",
        "created_utc": 1583463897,
        "id": "fjm88kw",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1583492697.0
    },
    {
        "author": "WhatTheFantasy",
        "body": "Fellow traders (mostly at bulls), please take some time and watch this: [https://www.youtube.com/watch?v=E3URhJx0NSw](https://www.youtube.com/watch?v=E3URhJx0NSw)\n\n&amp;#x200B;\n\nedit: Michael T. Osterholm is a public health scientist and a biosecurity and infectious disease expert in the United States. Joe Rogan had him on his episode for his podcast and they discussed coronavirus. Osterholm is saying this is going to be 6-12 month issue that impacts older people and those with underlying health issues such as obesity. He predicted/studied this type of scenario playing out, how it would impact supply chain and wrote about it in his book. He doesn't believe its bio-weaponized and discredits other myths of using saunas, probiotics, etc to fight it. Osterholm also states that washing your hands and not touching your face hasn't been captured as affective prevention but that White House officials and public want something to be able to do. Furthermore, he mentioned that saying that the risk is low is a false assertion. Still going through the video but it's very informative.\n\n&amp;#x200B;\n\nedit 2: \"this could require 48 million hospitalizations 96 million cases actually occurring over 480 thousand deaths that can occur over the next three to seven months with this situation so this is not one that to take lightly\"",
        "created_utc": 1583883130,
        "id": "fk5lsfn",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1583911930.0
    },
    {
        "author": "jdoge477",
        "body": "I love this, I feel like the bull v bear balance has been restored just as thanos wanted",
        "created_utc": 1584561426,
        "id": "fkv3sdh",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1584590226.0
    },
    {
        "author": "avaaa96",
        "body": "Just dropped 30k on visa shares for the pump 😌",
        "created_utc": 1584726981,
        "id": "fl1dquc",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1584755781.0
    },
    {
        "author": "Enigma_101",
        "body": "I come from the year 2030 and and I come bearing news. We didn't have any recession in 2020. The week of March 16 was the day we started a V shaped recovery. Thousands of bears died because of it. I came to warn you against this mass slaughter. Join bull gang before it's too late. I don't have much time. I must go back to my time. Our president, Dwayne The Rock Johnson will be holding a press conference soon.",
        "created_utc": 1584728417,
        "id": "fl1gapk",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1584757217.0
    },
    {
        "author": "zanif",
        "body": "Just ctrl+c, ctrl+v what South Korea has been doing.",
        "created_utc": 1584307436,
        "id": "fklj3xc",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1584336236.0
    },
    {
        "author": "MadJeffersonian",
        "body": " [https://www.youtube.com/watch?v=cZFhjMQrVts](https://www.youtube.com/watch?v=cZFhjMQrVts)  got me shook",
        "created_utc": 1583894833,
        "id": "fk66oyc",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1583923633.0
    },
    {
        "author": "wsb-narrator",
        "body": "https://www.youtube.com/watch?v=PsbhvSCtIZg here. eat a dick",
        "created_utc": 1583876020,
        "id": "fk59dq4",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1583904820.0
    },
    {
        "author": "syntheticapathyy",
        "body": "TRUMP SAID V BOYS WE GETTING A V",
        "created_utc": 1584632292,
        "id": "fkxoean",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1584661092.0
    },
    {
        "author": "chingwang",
        "body": "Stuff like CPRT, TMO, VRSN, GWRE, ADBE, and many others. Some are already at reasonable levels so we bought some this week. Stuff like CPRT and VRSN still have room to go before we'd be buying.",
        "created_utc": 1584200663,
        "id": "fkhk96b",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1584229463.0
    },
    {
        "author": "Jahmann",
        "body": "Short term:\nSPXS\nUVXY\nSQQQ\nREK\nGLD\n\n(Stay safe out there!!)\n\nLong term:\nAMD\nSNE\nEADSY\nARNC\nWDC\n\n(Fuckkkk me)",
        "created_utc": 1584381841,
        "id": "fko7wdv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1584410641.0
    },
    {
        "author": "kenji4861",
        "body": "**Unusual Call Options for 4/17**\n\n* ALK\n* ALL\n* GOOG\n* AMZN\n* AAL\n* V\n* WFC\n* WRK\n* WMB\n* WYNN\n\n**Unusual Put Options for 4/17**\n\n* MMM\n* ABT\n* ALK\n* AGN\n* MO\n* V\n* WMT\n* WDC",
        "created_utc": 1583863118,
        "id": "fk4m2bx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583891918.0
    },
    {
        "author": "mrpoopistan",
        "body": "There's an argument that right now the market isn't unduly fond of companies with more debt and less cash.\n\nThere are definitely folks who are preparing to ride the outbreak out for 18 months, and that's suggested in the response to certain companies and their debt and cash levels.\n\nLooking through that filter . . . yeah, they're pretty different. Of the two, WDC is by far the more likely to die a horrible death due to rona.\n\nFTR, I love companies with that sort of profile. I was into Altria, for example, heavy when the threat of mega lawsuits was there. Generally, if you have a proven market and major headwinds, I like you because headwinds aren't forever.\n\nYMMV, obviously.",
        "created_utc": 1584673014,
        "id": "fkzkaky",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1584701814.0
    },
    {
        "author": "sjybpysleep",
        "body": "Hey bro. \n\nStay away from anyone calling you a bro on stock board \n\nWait till 10k dow. Then buy the ones fell because of the virus. I would short the crap out of blue apron in a couple of days. This is for long term! Got WDC AND MU for pretty cheap. 40000 dow here we come!",
        "created_utc": 1584893233,
        "id": "fl73afa",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1584922033.0
    },
    {
        "author": "pet_wolverine",
        "body": "Yeah I'd buy more.  I'd move to things a bit more stable than you've got.  No need for emerging market funds in my opinion when developed markets HAVE given 25% annual returns and are currently probably undervalued.\n\nI've been buying blue chips.  Yesterday was BA, WDC, DIS.  I've got a few smaller companies mixed in, but those are limited positions.  UBER, OLED, a few like that.  Aside from the three big names I bought yesterday, I've got a lot of S&amp;P500 stocks at/near the top of my portfolio, and I've been adding to those positions over the past week.",
        "created_utc": 1584110226,
        "id": "fkecf46",
        "score": 1,
        "subreddit": "investing",
        "created": 1584139026.0
    },
    {
        "author": "swampthing41",
        "body": "Me too and wdc",
        "created_utc": 1583415756,
        "id": "fjjyhg0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583444556.0
    },
    {
        "author": "mrpoopistan",
        "body": "Thx.\n\nI've been birddogging the shorts and pretty much betting against them the last two weeks. Especially on otherwise good businesses.\n\nJust trying to figure out exactly how committed to buy-and-hold I want to be.\n\nFTR, I think we're mostly facing a V-shaped recovery, but I have certain western economies struggling to bounce back. I've mostly focused on companies with greater exposure in their supply chains to Asia. For example, I thought the beating Western Digital took was completely undeserved, and that bet is paying off handsomely.\n\nAs long as the U.S. doesn't trigger a debt crisis, I'm fairly optimistic.",
        "created_utc": 1585270715,
        "id": "fllyvwj",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1585299515.0
    },
    {
        "author": "Landlubber420",
        "body": "You mean seagate/western digital?",
        "created_utc": 1585310552,
        "id": "fln6cqx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585339352.0
    },
    {
        "author": "BroskiMcDoogleheimer",
        "body": "I bought my first option and am still wondering what to do with it. It's WDC Put 49 expiring tomorrow 3/13.\n\n1) If I sell to close the contract I make $750 (or $559 profit after subtracting $191 contract cost)\n\n2) Or I can exercise it and make $989 ($49-$39.11*100) or $798 profit after subtracting the $191 contract cost\n\nSo in this scenario exercising yields more profit - $798 vs $559. It's actually quite a big difference. So why do people always sell to close? I must be missing something.",
        "created_utc": 1584062403,
        "id": "fkcvy7u",
        "score": 1,
        "subreddit": "options",
        "created": 1584091203.0
    },
    {
        "author": "nikofili",
        "body": "2 that I'm looking at rn: WDC jan 2022 30c, and uber jan 22 18c",
        "created_utc": 1584549395,
        "id": "fkuh9bp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584578195.0
    },
    {
        "author": "obnoxygen",
        "body": "western digital? lost money in 2019 and the TTM is worse:\n\nIncome from Continuing Operations -1,193,000 -754,000\n\nAll numbers in thousands",
        "created_utc": 1584133757,
        "id": "fkfgauj",
        "score": 1,
        "subreddit": "investing",
        "created": 1584162557.0
    },
    {
        "author": "BudnamedSpud",
        "body": "I work for WDC, we just recently all started working remote. Buy puts",
        "created_utc": 1584581873,
        "id": "fkw2c6q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584610673.0
    },
    {
        "author": "LegalProfession",
        "body": "Western digital is gonna go up in the next few days.",
        "created_utc": 1585309174,
        "id": "fln4vg1",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1585337974.0
    },
    {
        "author": "sjybpysleep",
        "body": "Well my WDC investment has me up over $900,000.",
        "created_utc": 1585152809,
        "id": "flgymbg",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1585181609.0
    },
    {
        "author": "ferociousturtle",
        "body": "EQX-- very good management team. It's gotten hammered with the rest of gold, and is at a very good entry point right now.\n\nSTX-- it'll benefit from the exponential growth of data over the next decade, and has a better balance sheet than WDC. MU is approaching an attractive price point with the same bull thesis (data growth).\n\nNUE-- well run US steel company, reasonable balance sheet, great long-term track record for management, dividends, etc. It's cyclical, and we may have a ways to go before the bottom, but we're probably closer to the bottom of its cycle than we are to the top.\n\nHCC-- also in steel, it's a metallurgical coal company, which means it's much hated. Been following it for a while. The management seems solid, and it's at a deep discount.\n\nI'm also looking at STMP and BKNG.",
        "created_utc": 1584386742,
        "id": "fkoghb5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584415542.0
    },
    {
        "author": "Killerslug",
        "body": "Amazon, ba, apple, wdc, qcom",
        "created_utc": 1584393728,
        "id": "fkorvb2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584422528.0
    },
    {
        "author": "mrpoopistan",
        "body": "Got WDC at $27.50 on an overnight limit order I set before I went to sleep.\n\nApparently there was finally enough blood in the streets.",
        "created_utc": 1584646959,
        "id": "fkye64s",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1584675759.0
    },
    {
        "author": "AbbaFuckingZabba",
        "body": "I'm trying to build a somewhat stable average 6% dividend portfolio with companies that are unlikely to cut their dividends.  First for income and second for appreciation once we come out the other side of this with very very low rates, income producing stocks should get a boost.\n\nSo far bought WDC, STX, MMM, WFC, BA.    \n\n\nWatching AVGO, QCOM, JPM, DOW",
        "created_utc": 1584807283,
        "id": "fl46z6s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584836083.0
    }
]