[
    {
        "author": "WrongPurpose",
        "body": "Did you just made 1.2 million because Intel shit the bed? Congrats, now cash out and retire before you loose it all.",
        "created_utc": 1595601172,
        "id": "fz3dy1g",
        "score": 709,
        "subreddit": "wallstreetbets",
        "created": 1595629972.0
    },
    {
        "author": "rotofyaldabaoth",
        "body": "ok im bullish on hertz now",
        "created_utc": 1595305663,
        "id": "fyqgnt5",
        "score": 693,
        "subreddit": "wallstreetbets",
        "created": 1595334463.0
    },
    {
        "author": "TacticalYam",
        "body": "Great post. One thing you missed: he's not the CEO anymore. He stepped down so he has someone else to blame when the company goes to shit. He is the \"executive chairman\" now. Mark Russel is CEO.",
        "created_utc": 1595344241,
        "id": "fyrsrld",
        "score": 572,
        "subreddit": "wallstreetbets",
        "created": 1595373041.0
    },
    {
        "author": "247drip",
        "body": "Congratulations everyone. We are now all guilty of insider trading",
        "created_utc": 1595371235,
        "id": "fytc13r",
        "score": 561,
        "subreddit": "wallstreetbets",
        "created": 1595400035.0
    },
    {
        "author": "skomes99",
        "body": "I just saw this on ft.com and laughed.\n\nIt was just this year the Slack CEO was laughing at Teams, and they sent Microsoft a joke card about being late to the party, but they're clearly worried now.",
        "created_utc": 1595430448,
        "id": "fyvmw47",
        "score": 441,
        "subreddit": "investing",
        "created": 1595459248.0
    },
    {
        "author": "righthnd",
        "body": "700B is a joke to what the fed is spending now lol",
        "created_utc": 1595843377,
        "id": "fze13h9",
        "score": 435,
        "subreddit": "wallstreetbets",
        "created": 1595872177.0
    },
    {
        "author": "vadimyuryev",
        "body": "IV Crush Explained:  \nBased on the state of the current market as a whole, and the state of the stock in question, the stock will have a certain % of Implied Volatility.  \nFor example, if the IV is 40%, this means that a year from today, the market expects that the current stock price will either be 40% higher than it is today, or 40% lower than it is today.\n\n  \nThat's why IV was very high for stocks during Coronavirus, because the market was volatile and nobody really knew what was gonna happen, so there was a chance for stock prices to move drastically either up or down.  \nAbout a couple of weeks or a month before the earnings of a stock, people start talking about how the company will perform on their earnings report. If everything has been chugging along normally, their Implied Volatility stays pretty low since nobody expects there to be a huge move in either direction.  \n\n\nNow in the case of Tesla, which is a meme stock (basically incredibly popular and in the news all the time), there are drastically varying opinions. Some people believe they will fail their earnings for Q2 and the stock will crash down to 1000 or less points.   \nSome people believe they will succeed and the stock price will jump to 2000 points.  \nBecause of these drastically varying opinions and controversy, the Implied Volatility goes up.   \n\n\nBecause IV goes up, more people buy into the stock thinking they could earn some nice tendies. This increases the demand for options, which in turn raises the premium fee of buying those options.  \n\n\nThe demand and premium price stays high right up until earnings, since people are expecting a huge move in the stock price. As soon as the earnings gets released, everyone knows the truth and they know if they were wrong or right. The stock price changes quickly in after earnings trading to reflect the earnings report.  \n\n\nThis instantly crushes the Implied Volatility since nobody expects the price the move drastically anymore, and this GREATLY reduces the premium price of the option you own, so you lost all of that extra value due to increased demand.   \n\n\nOn top of that, your option expires tomorrow and the extrinsic value of your option decayed over time. Tomorrow, the extrinsic value will be worthless, so all you will be left with is the difference in stock price and your strike price. If you're not above break even, you basically lost all of your money.",
        "created_utc": 1595523279,
        "id": "fyzvm2j",
        "score": 418,
        "subreddit": "wallstreetbets",
        "created": 1595552079.0
    },
    {
        "author": "IamMat",
        "body": "Here's what will happen and i will come back to this once earnings are released next week.\n\n&amp;#x200B;\n\n1) AMD will get pumped hard until earnings\n\n2) It will beat top and bottom but will dump, similar to microsoft.  This is our environment right now.",
        "created_utc": 1595543113,
        "id": "fz11pfn",
        "score": 410,
        "subreddit": "investing",
        "created": 1595571913.0
    },
    {
        "author": "snek-jazz",
        "body": "&gt; What do you all make of this?\n\nBitcoiner since 2013 here, it's just like all the other times, we had a blow off top at the end of 2018, then around 80% correction during bear market 1-2 years of slow recovery back to about 50% (we are here now) and the next bull market starts.\n\nWhen it passes the old ATH (20k) a new hype cycle starts and new users start piling in as FOMO reaches its peak.",
        "created_utc": 1595888803,
        "id": "fzgaxa9",
        "score": 387,
        "subreddit": "investing",
        "created": 1595917603.0
    },
    {
        "author": "paincorp",
        "body": "I love how people keep realizing how bad of a situation airlines are in, like people haven’t been saying it for 4 months now.",
        "created_utc": 1595682370,
        "id": "fz6yn28",
        "score": 364,
        "subreddit": "investing",
        "created": 1595711170.0
    },
    {
        "author": "Jihelu",
        "body": "He’s out of prison now lmao",
        "created_utc": 1594766026,
        "id": "fy32z29",
        "score": 336,
        "subreddit": "wallstreetbets",
        "created": 1594794826.0
    },
    {
        "author": "HighFrequencyAutist",
        "body": "Now THIS is pod racing.",
        "created_utc": 1595527128,
        "id": "fz046l3",
        "score": 335,
        "subreddit": "wallstreetbets",
        "created": 1595555928.0
    },
    {
        "author": "xolican",
        "body": "That bear is 100% dead now, keep that in mind and buy calls.",
        "created_utc": 1595679343,
        "id": "fz6ux8c",
        "score": 326,
        "subreddit": "wallstreetbets",
        "created": 1595708143.0
    },
    {
        "author": "Nanostrip",
        "body": "Dude seriously money comes and goes. There will always be money. It's just a number on a screen. We're all just sending electrons back and forth so we have something to kill the time. Has there been any real difference in your life over the past few days as that squiggly line has gone down? Probably not. There is a lot of time between now and the time you actually need that money. So turn off the screen, have a beer, rub one out, and come back Monday to start working on getting that squiggly line to go back up.",
        "created_utc": 1595631371,
        "id": "fz53r6t",
        "score": 318,
        "subreddit": "wallstreetbets",
        "created": 1595660171.0
    },
    {
        "author": "SeeSee300",
        "body": "Instructions unclear, I now own 100 shares of HTZ",
        "created_utc": 1595198549,
        "id": "fylpllx",
        "score": 282,
        "subreddit": "wallstreetbets",
        "created": 1595227349.0
    },
    {
        "author": "thebabaghanoush",
        "body": "Now back to the daily $TSLA watch thread!",
        "created_utc": 1595894188,
        "id": "fzgl2j6",
        "score": 282,
        "subreddit": "investing",
        "created": 1595922988.0
    },
    {
        "author": "MasterCookSwag",
        "body": "My working theory is that CNBC brings this guy on just so that they can generate the type of headlines that have significantly higher click rates when shared on Facebook/Twitter.\n\nHe's wealthy because of his early stake in FB, but Social Capital as an entity has not been particularly successful and is effectively an MFO now.  You wouldn't normally have someone like that on to offer commentary, unless you just wanted to run headlines about a VC manager saying these sorts of things that make for fantastic shares on social media.",
        "created_utc": 1595514590,
        "id": "fyze5pl",
        "score": 274,
        "subreddit": "investing",
        "created": 1595543390.0
    },
    {
        "author": "jcarmona24",
        "body": "yeah I read that it was over [$93k](https://blockchair.com/bitcoin/address/bc1qxy2kgdygjrsqtzq2n0yrf2493p83kkfjhx0wlh).  What a brilliant way to get $$ if you can hack Elon and safely get away with it.\n\nedit: also if they lowered the price on Elon's from $1k to like $100 I bet they would've made a lot more.  $57.4k was the peak I saw the account at.  Now at $49k so assuming hackers are moving BTC now.  \n\nedit 2:  NVM they are hacking a LOT more accounts. Uber and Kanye just got hit. Account up to $90k",
        "created_utc": 1594845659,
        "id": "fy6lidv",
        "score": 271,
        "subreddit": "investing",
        "created": 1594874459.0
    },
    {
        "author": "Panda_Pineapple",
        "body": "after working a second, part time job at a grocery store for months now, I’ve finally made back what I’ve lost in a single day trading options....\n\nLife well spent",
        "created_utc": 1595193218,
        "id": "fylfu8x",
        "score": 266,
        "subreddit": "wallstreetbets",
        "created": 1595222018.0
    },
    {
        "author": "decent-rimjob",
        "body": "I'm 33 and still live with mommy.\n\nGo fuck yourself\n\nbackstory: 2 years ago i was living in my car, mommy and daddy said if i could put the vodka down i could live with them in florida. i've been sober ever since but now i'm addicted to money",
        "created_utc": 1595177301,
        "id": "fyklzav",
        "score": 265,
        "subreddit": "wallstreetbets",
        "created": 1595206101.0
    },
    {
        "author": "ZACHisZAQ",
        "body": "Nice I’m holding that right now 🚀🚀🚀",
        "created_utc": 1595275751,
        "id": "fyoyx15",
        "score": 263,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1595304551.0
    },
    {
        "author": "martinvandepas",
        "body": "For 8 years, I worked at Intel as an electrical engineer designing circuits for the future manufacturing processes that Intel would be releasing 2-4 years into the future. There are literally thousands of MS and PhD engineers working on the myriad of challenges involved in making better computer chips. All the way from the design of the manufacturing tools, the amount of NAND gates in a library, the modeling and forecasting of dozens of transistor parameters, writing and supporting the simulation tools, to what I was doing designing and testing: analog circuits in a not yet stable manufacturing process. And hundreds of other challenges that each had teams from a few to a few dozen engineers trying to solve them. It's an insanely complex task. Most engineers working on any of these tasks are so specialized that they don't have any idea how to do the job of the engineers sitting a few aisles over. These engineers are 5-9 management layers below the CEO. Other companies operate the same way, it's just how chip design is done. \n\nIntel's main advantage over the last few decades was that it continuously had the most advanced manufacturing process, maintaining a 1-2 year lead over its closest competitors. However over the last ten years, TSMC has caught up and now overtaken Intel. This is mostly due to Intel's engineering struggles with it's last few manufacturing processes. These things spend half a decade in planning and development. Decisions were made years ago that they are now stuck with. \n\nYour points are all about top level management and I'm sure there's some truth to how important the CEO's decisions are, but I think Intel's current problems are primarily engineering problems with the manufacturing process. I sincerely doubt it's for lack of investment by CEOs. I think it's more likely that TSMC had better engineering talent and was able to do things more creatively that ended up wildly successful.  And surely some luck there too.\n\nAMD has been doing well with their architectures recently and they should get credit for that, but their architectures were always quite good, the thing holding them back was their process and what had been a disadvantage, with TSMC, is now a huge advantage. They are poised to take market share, but they mostly have TSMC to thank for that.",
        "created_utc": 1595777052,
        "id": "fzb3mtw",
        "score": 263,
        "subreddit": "investing",
        "created": 1595805852.0
    },
    {
        "author": "rich000",
        "body": "That often doesn't work in practice.\n\nSuppose you have the highest pay in the industry.  You spend $1B researching 500 different formulas for batteries.  Any of them is simple enough that anybody could memorize them.  It turns out that 499 of them are duds, but 1 of them is a significant improvement.\n\nHere is the problem - that formula is something that dozens of employees at least end up knowing.  It cost the company $1B to obtain that formula - not so much to obtain the formula but to figure out that this is the one worth putting in the product.\n\nNow some other company can just offer one of those dozen employees $1M as a signing bonus and they get a $1B secret.  So, pay them all $10M a year!  Well, now the company can offer $100M and STILL get a $1B secret.  \n\nAnd it wasn't like any of those dozen employees \"discovered\" that formula due to their ingenuity and deserve all the money personally.  Maybe those 500 formulas are just all random tweaks of a common formula, and it was purely trial and error that lead to the right formula.  ANYBODY who did the work would have discovered it - the company just had to assign the testing to 100 scientists testing 5 formulas each at great expense, and one got lucky, purely because they were lucky.\n\nWhile I agree that companies should pay employees well to retain them, that doesn't mean that this is a substitute for IP law.  If you make the cheapest approach to R&amp;D to let somebody else do the work and then just poach their employees for a bit more, then nobody will do R&amp;D, and all of those employees will end up unemployed.\n\nDon't get me wrong - I think that plenty of employees are underpaid or not given sufficient bonuses for their creative discoveries.  However, the person who pulls the ball out of the lottery machine shouldn't get a cut of the jackpot every time somebody wins just for being the person who drew the ball.",
        "created_utc": 1595551490,
        "id": "fz1hgjc",
        "score": 261,
        "subreddit": "investing",
        "created": 1595580290.0
    },
    {
        "author": "DragaliaBoy",
        "body": "Nah just OP. This is public info now and you’re clear to trade.",
        "created_utc": 1595381440,
        "id": "fyttop2",
        "score": 254,
        "subreddit": "wallstreetbets",
        "created": 1595410240.0
    },
    {
        "author": "ShinoPrime987",
        "body": "How quickly people forget what happened to AIG and all its investors. AIG was seen as too big to fail. Oh it failed. 100k$ back at their height is worth like what 2k$ now?\n\nAll credit to Warren Buffet for doing what he has done, but selling stocks is a very important part of investing. Don't take everything he says as gospel. This quote is very clearly being spoken in hyperbole. Warren just recently sold billions in airline stock.",
        "created_utc": 1594853306,
        "id": "fy70tk2",
        "score": 236,
        "subreddit": "investing",
        "created": 1594882106.0
    },
    {
        "author": "PapaTachancla",
        "body": "He got caught with some weed and got over $400K worth of guns confiscated and got sent to prison for 2 months. He's been doing podcasts for a while now.",
        "created_utc": 1594778969,
        "id": "fy3pgnc",
        "score": 225,
        "subreddit": "wallstreetbets",
        "created": 1594807769.0
    },
    {
        "author": "havearedpill",
        "body": "I paid a $15k tax bill with Amazon gift cards to a nice man with a thick Indian accent over the phone. I found it a bit odd, but I guess that's how the IRS works now.",
        "created_utc": 1595378466,
        "id": "fytonuy",
        "score": 224,
        "subreddit": "wallstreetbets",
        "created": 1595407266.0
    },
    {
        "author": "BravewardSweden",
        "body": "His eyes kind of look downcast at the floor as he says, \"Yes, we did, that's another way to think about it.  We did,\" when asked if the printer is actually going \"brrr.\"\n\nThe interviewing is going, \"Say it ain't so, Joe,\" and Jerome is going, \"Yes, kid, I'm afraid it is.\"\n\nLike...yeah, it's all a sham - nothin' we can do about it now.",
        "created_utc": 1595352499,
        "id": "fys9j9i",
        "score": 224,
        "subreddit": "wallstreetbets",
        "created": 1595381299.0
    },
    {
        "author": "Gmcgator",
        "body": "$91k for real world options training.  I bet you'll understand iv crush from now on.",
        "created_utc": 1595521051,
        "id": "fyzqv21",
        "score": 221,
        "subreddit": "wallstreetbets",
        "created": 1595549851.0
    },
    {
        "author": "pervsensei11",
        "body": "Moved to a new apartment \n\nRent is 400$ cheaper\n\n400$ more to gamble every month now\n\nMMs better watch out \n\n💩💩💩",
        "created_utc": 1595198853,
        "id": "fylq6pl",
        "score": 219,
        "subreddit": "wallstreetbets",
        "created": 1595227653.0
    },
    {
        "author": "TU_NYCE",
        "body": "Wait what... You guys can see what we rename our accounts to? The fuck... My checkings is called retard fund.  \n\n\nNow it all makes sense whenever I speak to customer rep they speak slowly to me",
        "created_utc": 1594927790,
        "id": "fya8iz1",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1594956590.0
    },
    {
        "author": "raisinpon",
        "body": "Now THIS is pod racing",
        "created_utc": 1595903547,
        "id": "fzh1gwl",
        "score": 214,
        "subreddit": "wallstreetbets",
        "created": 1595932347.0
    },
    {
        "author": "xTofik",
        "body": "So he bought AAL for $18+ and BA for $210+ in early June when airline stocks doubled in a week?  AAL is down 40% now, BA about 15%",
        "created_utc": 1595697756,
        "id": "fz7o9s8",
        "score": 212,
        "subreddit": "wallstreetbets",
        "created": 1595726556.0
    },
    {
        "author": "LavenderAutist",
        "body": "Yeah. Uber's earnings are going to be bad.\n\nNow they're going to take Postmates down with them.",
        "created_utc": 1595908465,
        "id": "fzh9dyj",
        "score": 208,
        "subreddit": "investing",
        "created": 1595937265.0
    },
    {
        "author": "stockpicker69",
        "body": "I just realized I've never actually heard jpow's voice until now. I always thought he would sound like an old man.",
        "created_utc": 1595334867,
        "id": "fyrcsev",
        "score": 204,
        "subreddit": "wallstreetbets",
        "created": 1595363667.0
    },
    {
        "author": "OPINION_IS_UNPOPULAR",
        "body": "Why you heff to be mad?\n\n**User reports**\n\n8: This is spam        \n\n7: Advertisement or self-promotion        \n\n6: No Market Manipulation        \n\n3: Pump &amp; Dump, Scheme, Scam or Crypto        \n\n3: Fake, Fabricated, Phony, Con, Fraudulent.        \n\n1: Market manipulation. asking to pump a stock.\n\nSelfpromotion, this is a plot to get more youtube subs        \n1: Threatening, harassing, or inciting violence        \n\n1: Spam        \n\n1: y'all are a bunch of retarded faggots        \n\n1: No Advertisement, Self-Promotion, or Begging        \n\n1: retard mods shouldn't even allow some random ass rich dipshit do stuff like this here        \n\n1: piece of shit garbage human being.         \n\n1: Violated Content Guidelines        \n\n1: It's rude, vulgar or offensive        \n\n1: this sub sucks now, thanks mods.",
        "created_utc": 1594836817,
        "id": "fy62uj6",
        "score": 195,
        "subreddit": "wallstreetbets",
        "created": 1594865617.0
    },
    {
        "author": "Somethingdifferent39",
        "body": "There are defintely some similarities, but as Cuban notes, the Fed is taking some pretty extreme steps to pump in liquidity. If you talk to ten different market experts they will give you ten different ways this all might end, but the theory I like is that the party wont end until the Fed raises rates, and they won't raise rates until we see a spike in inflation. So the real question is when do we see inflation? \n\nAt the end of the day Mark is right, asset prices are frothy and you shouldnt put more in the market right now then you can stomach to lose. However, I think you could also be missing out on a lot of market gains if you have no exposue as the surge from March lows has already proven.",
        "created_utc": 1595257015,
        "id": "fynwrc2",
        "score": 195,
        "subreddit": "stocks",
        "created": 1595285815.0
    },
    {
        "author": "psy_throwaway_33",
        "body": "Gold and silver (+ metal stocks!) have been superstars of my portfolio this year, beating even NASDAQ high flyers.\n\nIf you asked me to describe ideal conditions for gold/silver prices it would be something very similar to what we have right now.\n\n* Economic downturn, yet the stock market at or near ATH\n* Out of control central banks\n* Reckless fiscal policies\n* Growing international instability\n* Near-zero or even negative yields on bonds",
        "created_utc": 1595851783,
        "id": "fzea4zz",
        "score": 194,
        "subreddit": "investing",
        "created": 1595880583.0
    },
    {
        "author": "perkses",
        "body": "Now comes the revenge trading where you lose the rest",
        "created_utc": 1595214423,
        "id": "fymfzbb",
        "score": 192,
        "subreddit": "wallstreetbets",
        "created": 1595243223.0
    },
    {
        "author": "Futuramah",
        "body": "Man can’t even afford $ROPE now. Might have to settle for ramen noodles.",
        "created_utc": 1595690340,
        "id": "fz7aws8",
        "score": 190,
        "subreddit": "wallstreetbets",
        "created": 1595719140.0
    },
    {
        "author": "thatlookslikemydog",
        "body": "I have traded options on and off for a couple years now. And have lost most of it! And I’m using an app that has more tools than Robinhood. In gamer terms, I’ve found the meta can shift multiple times a week, so even if you know what to look for, it’s a lot of work to stay up to date on things. tldr: what OP said.",
        "created_utc": 1594753848,
        "id": "fy2dygq",
        "score": 185,
        "subreddit": "RobinHood",
        "created": 1594782648.0
    },
    {
        "author": "k3nknee",
        "body": "So let's say you own 1000 shares of Tesla. Nobody knows what direction Tesla ia going to go, it could crash down or go back to the moon. So to hedge/protect your position you could buy puts on Tesla which gives you the right to sell 100 shares of Tesla at an agreed upon price. This would hedge your position because if the price of Tesla falls the value of your puts would go up. Now buying puts can be expensive, so to cover the cost of that you would sell   calls on the Tesla stock you already own giving someone else the right to buy from you at an agreed upon price, and use the premium from selling your calls to pay for your puts you just bought. \n\nThe only disadvantage to this strategy is if Tesla really moons your going to miss out on more profit because the calls you sold are going to get exercised and your shares of Tesla are going to get called away for a lower price then what Tesla is currently trading at in this scenario. But profits are still profits, and this strategy protects you from losing bad if the \"Tesla bubble\" pops. (Idk if it's actually a bubble, Idk anything anymore in this market)",
        "created_utc": 1595274453,
        "id": "fyow9bs",
        "score": 180,
        "subreddit": "stocks",
        "created": 1595303253.0
    },
    {
        "author": "MartialImmortal",
        "body": "literally the same accounting story every quarter\n\nyea they're growing, but it's hard to justify even a $400 pricetag, much less whatever the fuck is going on now",
        "created_utc": 1595459972,
        "id": "fyxbcwp",
        "score": 163,
        "subreddit": "investing",
        "created": 1595488772.0
    },
    {
        "author": "timeinthemarket",
        "body": "2008 didn't happen overnight and it took a while for the extent of the problem to set in and the markets to react.\n\nWe're still not past this problem and have no idea what kind of damage will be done before it's over. Right now the economic impact has been in certain areas but it'll bubble up to other sectors pretty fast. \n\nI'm pretty optimistic long-term(5+ years out) but short term, I think it's a total crap shoot.",
        "created_utc": 1595590804,
        "id": "fz2xl9a",
        "score": 162,
        "subreddit": "investing",
        "created": 1595619604.0
    },
    {
        "author": "myglasstrip",
        "body": "A coworker of mine bought them during the dip because bank + dividend. \n\nCouldn't believe they would risk it on a company with a proven terrible track record. \n\nThey're being rewarded now with declining share price and well... Being a wells Fargo share holder.",
        "created_utc": 1594757131,
        "id": "fy2kv7d",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1594785931.0
    },
    {
        "author": "cyrilsuave",
        "body": "MY 40K PORTFOLIO BECAME 5K LAST WEEK BECAUSE OF NETFLIX CALLS AND AVERAGING DOWN. I BOUGHT AZN CALLS LAST 2 DAYS AGO.... NOW MY LAST 5K IS 1K... FROM 40K TO 1K IN 1 WEEK. FUCK YEAHHH",
        "created_utc": 1595366342,
        "id": "fyt2fvo",
        "score": 157,
        "subreddit": "wallstreetbets",
        "created": 1595395142.0
    },
    {
        "author": "stejerd",
        "body": "Simple explanation really. Half this sub had their life savings in 2000c expiring today. Now that they are bankrupt they want the stimulus and hate musk. Had their options printed it would be the other way around.",
        "created_utc": 1595604823,
        "id": "fz3l6fr",
        "score": 154,
        "subreddit": "wallstreetbets",
        "created": 1595633623.0
    },
    {
        "author": "SpaceBollzz",
        "body": "Good decision imo, it should've been made long before now.\n\nChina cannot be trusted.",
        "created_utc": 1594739819,
        "id": "fy1kquc",
        "score": 153,
        "subreddit": "investing",
        "created": 1594768619.0
    },
    {
        "author": "ktempo",
        "body": "I took out 4k in March because the market was going to keep going down. 4k into 4/17 SPY 200P. You know what happened.\n\nDon't be a dumbfuck like me and lose it man. It's not worth it. That 50k is going to be worth 5-10 times what it is now in 25-30 years. Don't touch it retard.",
        "created_utc": 1595890198,
        "id": "fzgdmni",
        "score": 152,
        "subreddit": "wallstreetbets",
        "created": 1595918998.0
    },
    {
        "author": "ArnolduAkbar",
        "body": "All I remember is the dog and Will Smith is a cuck now.",
        "created_utc": 1595425397,
        "id": "fyvdhln",
        "score": 146,
        "subreddit": "stocks",
        "created": 1595454197.0
    },
    {
        "author": "ForwardChocolate4",
        "body": "now its our money.",
        "created_utc": 1595608380,
        "id": "fz3smkg",
        "score": 146,
        "subreddit": "wallstreetbets",
        "created": 1595637180.0
    },
    {
        "author": "AlBundysLastTD",
        "body": "Wait till they see how much I can rack up now that I know the rules!\n\nIt's my 7 year plan...",
        "created_utc": 1595623155,
        "id": "fz4nwem",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1595651955.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "[Edited because automod didn't like some wsb words I used.]\n\nIt feels like 1999 to me.\n\nSuper hot tech stocks that were unstoppable. Some even the same names (e.g. AMZN). Check.\n\nCompanies committing fraud (Enron and Worldcom back then, Luckin and Wirecard now). Check.\n\nA flurry of IPOs back then where they all go up. A bunch of IPOs plus SPACs which triple purely on speculation. Check.\n\nLots of new traders piling into the market because stocks only go up. Check.\n\nAll the talking heads on TV saying we're in a tech bubble. Check.\n\nNow, in 1999/2000, there was no bounce. It was kicked off with a big correction, a bit of a recovery, and then two years of pain.",
        "created_utc": 1594519864,
        "id": "fxsaf9j",
        "score": 143,
        "subreddit": "investing",
        "created": 1594548664.0
    },
    {
        "author": "xcheezeplz",
        "body": "No way, he should YOLO calls on moderna now. Just pumped to ATH off a great headline that sounds way better than the study results, and who cares if the execs are selling stock like crazy. This is the way.",
        "created_utc": 1594839837,
        "id": "fy69bnr",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1594868637.0
    },
    {
        "author": "ThroneTrader",
        "body": "Well congrats, you'll have even less reason to know what those terms mean now.",
        "created_utc": 1595718192,
        "id": "fz8xoy8",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1595746992.0
    },
    {
        "author": "Snaaaaaaaaaake",
        "body": "Next video a year from now: \"hi I'm Mr. Beast and this is my oil pool, let's jump in boys!\"",
        "created_utc": 1594855964,
        "id": "fy75r2v",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1594884764.0
    },
    {
        "author": "TurielD",
        "body": "Now that's Autist Energy",
        "created_utc": 1595451120,
        "id": "fywuo2y",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1595479920.0
    },
    {
        "author": "riceturm",
        "body": "Gpu’s are taking over more and more tasks from the cpu, nvidia is master in gpu development and sales. They especially dominate in server-gpus, used in almost all virtual workstation environments.\nNow nvidia is rumored to buy arm, they can also be a direct competitor for cpu sales.",
        "created_utc": 1595764764,
        "id": "fzalpmv",
        "score": 137,
        "subreddit": "investing",
        "created": 1595793564.0
    },
    {
        "author": "SupreamSammy",
        "body": "calls are fool proof now, thanks Leo!",
        "created_utc": 1595369851,
        "id": "fyt9gu8",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1595398651.0
    },
    {
        "author": "VapesOnAPlane",
        "body": "The Fed **didn't** do anything in 1929, but that's the point. They are doing something now. Are you right that a crash will happen eventually? Yeah, probably. But try timing that shit with the Fed coming in BBC style every time the market gets spooked. Good luck with that. It could be another few months or a few decades until a real crash happens. Who knows? I'll tell you one thing for sure though: no crash is happening until the election.",
        "created_utc": 1595233329,
        "id": "fyn2xxw",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1595262129.0
    },
    {
        "author": "steadyeddy_10",
        "body": "You’d be a millionaire by now if you weren’t retarded.",
        "created_utc": 1595723116,
        "id": "fz96a0z",
        "score": 129,
        "subreddit": "wallstreetbets",
        "created": 1595751916.0
    },
    {
        "author": "LovableContrarian",
        "body": "Bruh, it's based on future expectations.\n\nAMD is grabbing market share like a hungry slut (not just in consumer PCs but also in consoles, enterprise, servers, etc), and INTC just continues to fuck up everything. It's honestly sort of amazing how many mistakes Intel has made in the past year or so, and they are legitimately at risk of becoming completely uncompetitive.\n\nThey basically lost 100% of the enthusiast/custom PC market overnight, and most of their revenue now comes from contracts with Dell, Lenovo, Apple, etc for desktop and notebook CPUs (and a few other random components, like wifi and Bluetooth cards). And, these companies will almost definitely be looking to AMD, as Intel's 7nm chips aren't expected to be available until *at least* 2022, and AMD is already mass-producing. Depending on how hard these companies ditch Intel, it could be an actual death blow. \n\nAnd that doesn't even bring up the issue that things are shifting more and more to mobile platforms, where Intel completely failed. Companies like Apple, Samsung, and Qualcomm absolutely dominate in the mobile SoC sector and managed to castrate a titan when Intel attempted to enter that market and failed miserably. \n\nIt's bad news all around. \n\nDoes that mean they can't come back? No. Of course they can. But the concerns are real.\n\nWhat other major stocks have you seen recently crash 13% on earnings then just... Stay there? Flat? We are in the most legendary dip-buying market of all time, where almost any dip will be bought without any logic, and yet no one would touch INTC, which is one of the biggest tech companies in the world.\n\nIt's a bit concerning.\n\nYour DD is basically \"bruh, it's Intel. And they made a lot of money in 2019.\" But that's frankly just not very good DD my friend.",
        "created_utc": 1595631956,
        "id": "fz54toq",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1595660756.0
    },
    {
        "author": "new_account_5009",
        "body": "Also, you're older in 2020 than 2008.  Anyone posting to the investing subreddit is likely doing pretty good financially, which likely means they've got a much bigger financial cushion 12 years later.  I was an entry level grunt in corporate America in 2008 still paying off student loans.  In 2020, I'm now in a middle management role with a large enough cushion to fall back on if I were to lose my job.  Accordingly, 2008 felt a lot worse to me personally, but the economy is more than my personal experience.  Graduating college in 2008 is still preferable to graduating college in 2020, in my opinion.\n\nAdditionally, it's still very early in the COVID crisis timeline.  The dust hasn't settled on this at all yet.  People talk about 2008 as if the crisis happened in a single year and things were fine right away, but in reality, things started getting bad in 2007, and things were still pretty dicey through 2011 or so.  We're less than six months into the impact here.  Things like eviction protections and expanded unemployment benefits have dampened the impact, but those won't last forever.  As bad as things are now, it's entirely possible for them to get worse.",
        "created_utc": 1595605830,
        "id": "fz3n96w",
        "score": 126,
        "subreddit": "investing",
        "created": 1595634630.0
    },
    {
        "author": "ravepeacefully",
        "body": "It is a cutting edge high-tech firm out of the Midwest awaiting imminent patent approval on the next generation of radar detectors that have both huge military and civilian applications now.",
        "created_utc": 1595965179,
        "id": "fzjmm1e",
        "score": 124,
        "subreddit": "wallstreetbets",
        "created": 1595993979.0
    },
    {
        "author": "10nisne1",
        "body": "Long history to answer your question, but on a high level.....\n\nUnder Steve Ballmer (2000-2014), Microsoft was all about preserving their cash cow.  Their cash cow being licensing of Windows and Office.\n\nWhen Satya Nadella became CEO in 2014, he had a different philosophy and started opening up Microsoft to different revenue streams.  Microsoft became more open to open source and the company became more relevant again with enterprise companies.  For example, there is now native support to allow running Linux on Windows.  This would never have happened under Ballmer.\n\nWall street has always rewarded companies with re-occurring revenue model vs companies that had a \"CAPEX\" or \"one time purchase\" revenue model such as Apple (but now Apple is pivoting more towards software and services) with higher valuation.  Microsoft shifted from one time purchase model of their consumer Windows (95/XP, Vista, 7, etc) and Office licensing.  Office became O365, which could be purchased on a monthly/annual subscription.\n\nAzure services helped and played into the re-occurring revenue model for Microsoft.  AWS was introduced in 2006 and took many years to be where they are at today.  Microsoft is playing catch up with Azure.  However, the big advantage with Microsoft and Azure is that they have an existing enterprise organization that sold into enterprise accounts for many years.\n\nAWS didn't have an enterprise sales team and in the early years really only catered to the developers and \"rogue IT\".  Even today, in my opinion, AWS still doesn't have have the enterprise sales organization they need to compete more effectively.\n\nSame with Google.  Google never had an enterprise sales organization for GCP and is really playing catch up.  It was mentioned by Thomas Kurian that GCP sales team was only 1/15th the size of Microsoft/AWS and would like to be 1/5th the size in the next 2 years.",
        "created_utc": 1595862583,
        "id": "fzes9rd",
        "score": 123,
        "subreddit": "stocks",
        "created": 1595891383.0
    },
    {
        "author": "SigSalvadore",
        "body": "I'm in the same boat. \n\nBecause he's the Autist WSB deserves, but not the one it needs right now, so we'll shun him. Because he gives zero fucks, because he's not an autist. He's an obnoxious guardian, an ADHD protector, a Dark Douche.",
        "created_utc": 1595520625,
        "id": "fyzpz64",
        "score": 122,
        "subreddit": "wallstreetbets",
        "created": 1595549425.0
    },
    {
        "author": "SaplingCub",
        "body": "My daily reminder this sub is now WSB",
        "created_utc": 1595598950,
        "id": "fz39saj",
        "score": 122,
        "subreddit": "investing",
        "created": 1595627750.0
    },
    {
        "author": "likeitis121",
        "body": "This is what happens when people believe the Fed will backstop absolutely any correction. The thing though now is they really are going to be forced to fix their balance sheet, which is going to impact actual economic recovery.  I know they are trying to say otherwise, but in no way can they see this runaway market as good, it's another massive risk to the economy that is already in terrible shape.",
        "created_utc": 1595296262,
        "id": "fyq1msh",
        "score": 122,
        "subreddit": "StockMarket",
        "created": 1595325062.0
    },
    {
        "author": "Suds08",
        "body": "Now do it again only win this time",
        "created_utc": 1595193281,
        "id": "fylfycq",
        "score": 121,
        "subreddit": "wallstreetbets",
        "created": 1595222081.0
    },
    {
        "author": "zjz",
        "body": "We know, TSLA is annoying. It's just the way meme stocks are. When we try to fight the tide it just takes longer for people to get over it. Let them meme until they're sick of the meme and it'll pass naturally.\n\nRE: the \"WSB too popular REEE\" post earlier, WSB becoming more mainstream is *not* a bad thing. More blood for the blood god. More financial crimescene pictures. You don't have to let them change our lingo or vibe. You don't get shit like 2,000% losses and box spread shenanigans from people who know what they're doing.\n\nThe idea that there was once a significant period of better content or a concentration of well-informed insiders is a straight up meme. It's always been a trailmix of incompetence, talent, and newbies. One of the big early events was a rainbow dildo header background. The *big joke* at that time was \"go fuck yourself\" and people spammed it ten thousand times a day. We all invested in a biotech company that turned out to be HQ'd in a fucking shed. I think we're in a **much danker** timeline now. Onward and upward.\n\nAt some point in the near future we'll be looking for more mods for shitpost duty. If anybody has nominations in mind drop them here.\n\nComment for flair",
        "created_utc": 1594512867,
        "id": "fxrxh71",
        "score": 117,
        "subreddit": "wallstreetbets",
        "created": 1594541667.0
    },
    {
        "author": "bigbetsbigluck",
        "body": "Never in industry just means not right now",
        "created_utc": 1595138798,
        "id": "fyjahzh",
        "score": 116,
        "subreddit": "stocks",
        "created": 1595167598.0
    },
    {
        "author": "RogueJello",
        "body": "Wow, like 3 days from now for Baseball (July 23rd) and 7 Days for NBA.\n\nThanks!  Now shorting the market, wish me luck!",
        "created_utc": 1595290456,
        "id": "fyprn6c",
        "score": 115,
        "subreddit": "investing",
        "created": 1595319256.0
    },
    {
        "author": "Gareth321",
        "body": "&gt;I don't know why people talk so much shit about gold\n\nIt only just exceeded its 2011 peak. Lots of people got burned. *You* might get burned. Gold doesn't have (much of) an underlying utility value. This price is driven almost entirely by speculation. It's Bitcoin before cryptocurrencies were cool.\n\nThat said, the entire fucking market is pants-on-head silly right now so fuck it. Throw some money in gold, BTC, and fucking tulips. [~~I'm not even joking~~ someone was joking.](https://thestonkmarket.com/blackrock-announces-tulip-etf/)",
        "created_utc": 1595856691,
        "id": "fzehgi4",
        "score": 114,
        "subreddit": "investing",
        "created": 1595885491.0
    },
    {
        "author": "TeamLIFO",
        "body": "Yeah, airlines before the pandemic often had troubles making money... now they have massive disruptions to their demand and trying to have the correct supply of employees along with the heavy fixed cost structure of owning or leasing planes is a pretty big toll to recover from",
        "created_utc": 1595685194,
        "id": "fz72ldl",
        "score": 113,
        "subreddit": "investing",
        "created": 1595713994.0
    },
    {
        "author": "ura_walrus",
        "body": "This is the most bandwagony, self congratulatory blog post ive ever seen\n\nPlus hilariously late to the game. Maybe they should be bullish on tesla now too.",
        "created_utc": 1595772654,
        "id": "fzaw2ej",
        "score": 113,
        "subreddit": "investing",
        "created": 1595801454.0
    },
    {
        "author": "ImZoidberg_Homeowner",
        "body": "Now that’s a Wall Street fucking bet.",
        "created_utc": 1595601511,
        "id": "fz3eliy",
        "score": 112,
        "subreddit": "wallstreetbets",
        "created": 1595630311.0
    },
    {
        "author": "cuki321",
        "body": "Now we need Trump to pump this shit like Hydroxychloroquine.",
        "created_utc": 1594754430,
        "id": "fy2f65w",
        "score": 112,
        "subreddit": "wallstreetbets",
        "created": 1594783230.0
    },
    {
        "author": "journeyman_joe",
        "body": "What XSPA needs to do is change my -35% to +35%\n\nEdit: -40% now",
        "created_utc": 1594729484,
        "id": "fy12yh1",
        "score": 112,
        "subreddit": "pennystocks",
        "created": 1594758284.0
    },
    {
        "author": "dwittty",
        "body": "Well, let’s see. Trusting the first result from google there are 44.16 million 30-39 year olds in America.  Each of these persons is worth an average of 174002 based on what it says for the mean in the chart. Multiply that out and it’s 7.68393 trillion. Now, trusting the first result from google once again, Zuckerberg is worth 89.2 billion. If we take that number out of the 7.68393 trillion and then divide again by our 44.16 million 30-39 year olds, we find that this age bracket would instead have a mean net worth of $171982.07 if we took Zuckerberg out of it.\n\nZuckerberg accounts for about $2000 of that average. Put another way, Zuckerberg has about 1.1% of all the wealth of 30-39 year olds in America.",
        "created_utc": 1595366709,
        "id": "fyt37lq",
        "score": 111,
        "subreddit": "wallstreetbets",
        "created": 1595395509.0
    },
    {
        "author": "youreaditfirst",
        "body": "I lost 12k on **AMZN** CALLS they are worth $50 right now. I am broke. 🤡🔫",
        "created_utc": 1595536030,
        "id": "fz0nf4q",
        "score": 110,
        "subreddit": "wallstreetbets",
        "created": 1595564830.0
    },
    {
        "author": "beyphy",
        "body": "That's Jim Keller. He never stays in a place for too long. He usually joins a company for a few years, makes his impact, and he moves on. And he may have done that at Intel. What was surprising was the nature of how he left which was a [very abrupt resignation for \"personal reasons\"](https://www.anandtech.com/show/15846/jim-keller-resigns-from-intel-effective-immediately). \n\nSpeculation, but I think Intel's main problems are management related. Their management either laid off too many important, expensive engineers in an effort to save money. Or they were far too aggressive which led to the massive failure they had today. Or a combination of both. There are definitely fields where you can layoff staff and outsource costs to save money. But semiconductor manufacturing definitely isn't one of them.\n\nI've said in other posts that shareholders are tolerating this now, but they won't do so forever. If Intel doesn't get their stuff together, this may not get fixed until a lot of people get fired.",
        "created_utc": 1595774936,
        "id": "fzazu6z",
        "score": 110,
        "subreddit": "investing",
        "created": 1595803736.0
    },
    {
        "author": "-I_DO_NOT_COMPUTER-",
        "body": "I've been reading this sub for over a year now and I have no idea what anything means that anyone says here. Get fucked kid.",
        "created_utc": 1594830857,
        "id": "fy5q46q",
        "score": 110,
        "subreddit": "wallstreetbets",
        "created": 1594859657.0
    },
    {
        "author": "B20Bravo",
        "body": "I usually buy low, sell high. This is groundbreaking, now I know how to trade the right way! Lol",
        "created_utc": 1595777444,
        "id": "fzb4db1",
        "score": 109,
        "subreddit": "stocks",
        "created": 1595806244.0
    },
    {
        "author": "kylenusser",
        "body": "Graham used to be decent. Now every video is clickbait.\n\nAlso fuck you Graham. I know you're on this sub faggot",
        "created_utc": 1595280519,
        "id": "fyp8m1e",
        "score": 109,
        "subreddit": "wallstreetbets",
        "created": 1595309319.0
    },
    {
        "author": "the-regulaaaa",
        "body": "Great. Now do it to Amazon, Nike, etc...",
        "created_utc": 1595356684,
        "id": "fysi811",
        "score": 107,
        "subreddit": "stocks",
        "created": 1595385484.0
    },
    {
        "author": "IceShaver",
        "body": "1. Economic pressures haven’t hit the financial markets yet due to unprecedented government actions. Fed bought 3trillion and congress approved 3 trillion within weeks. The economy is certainly being backstopped for now. But the effects will be felt as soon as the fed and government puts their feet off the breaks. Or if the pandemic gets worse than it is now which is becoming more and more likely as fall/winter season approaches. \n\n2. Not being worried is actually pretty worrying. It’s normally good to be optimistic but in certain times of uncertainly it’s better to be wary than it is to be blindly hopeful. That’s how unexpected bad news can make a bad situation worse.\n\n3. I cannot stress that we haven’t even begun to see the economic ramifications yet. Entire supply chains and industries will be drastically affected after the temporary period ends. Who knows how far the hospitality industry will come back. What will all those millions of people that rely on those jobs do after the pandemic ends if those jobs don’t come back? Government action seems like the only solution. But again this crisis will likely last years.",
        "created_utc": 1595592275,
        "id": "fz2zfn9",
        "score": 107,
        "subreddit": "investing",
        "created": 1595621075.0
    },
    {
        "author": "complicatedAloofness",
        "body": "Literally no data on this entire article other than RH users trade 25x more than other broker users and RH gets paid 18x more in commissions per account than other brokers -- which makes perfect sense. The article idiotically assumed average dollar value of the account is what determines commission amount and not amount of trades made by the account.\n\nPurposefully singling out customers and giving them bad fills is illegal -- it's such a stupid  argument -- no wonder this sub regurgitates it nonstop.\n\nJust sounds like other brokers were late to the game in making a modern UI and offering free trading and now are missing out on that sweet sweet transaction cost gains. Get what you sow for charging $5+/trade or options contract for decades -- let the other brokers die.",
        "created_utc": 1595262859,
        "id": "fyo8aza",
        "score": 106,
        "subreddit": "wallstreetbets",
        "created": 1595291659.0
    },
    {
        "author": "Randolm",
        "body": "I'm guessing this is also going to be their base standard-definition offering as well.  I really doubt cannibalization into their paid services will be very high... they've already proven their current customers are willing to pay to avoid commercials, and many (maybe most?) are willing to pay even more for for HD/UHD, multiple devices, downloading content.  So this is opening up a whole new revenue stream for new users that just want some 'free stuff' (but NFLX gets commercial revenue in lieu of subscription).  \n\nI watched their earnings report video that came out a couple hours after market close on Thursday and was really reassured this company has their eye on the ball right now (continue to grow their dominant lead in streaming).  I was already happy I grabbed some at $469 when the report dropped and hearing this new model makes it even better.",
        "created_utc": 1595127106,
        "id": "fyiv73q",
        "score": 106,
        "subreddit": "stocks",
        "created": 1595155906.0
    },
    {
        "author": "UpTheDownMarket",
        "body": "It's an odd market. UAL reports much worse than expected numbers and the stock doesn't move. Same thing has happened with a number of other companies too. I think there is so much pumping that there is very little news that can drive prices lower. But at some point it stops. And then it gets real ugly real fast. If the pumping doesn't stop we'll have a whole host of much bigger problems to deal with. Hell, even Pelosi basically said she's OK with the pumping. So now we have both sides of the aisle willing to manipulate the markets. Should be good times.",
        "created_utc": 1595433608,
        "id": "fyvt9wm",
        "score": 105,
        "subreddit": "StockMarket",
        "created": 1595462408.0
    },
    {
        "author": "NormalGap",
        "body": "Someone is at home right now filled to the tits with MSFT calls and just crying. Lmfao",
        "created_utc": 1595448574,
        "id": "fywp49g",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1595477374.0
    },
    {
        "author": "MrTouchnGo",
        "body": "People were ragging on Buffet for selling airlines but the decision is looking more and more reasonable. The pressures facing airlines didn’t go away and there is a ton of pain and uncertainty ahead for them. Airlines are still at huge losses on the year. The spike a while back now looks like a dead cat bounce.\n\nEdit: spellcheck",
        "created_utc": 1594730728,
        "id": "fy14qje",
        "score": 103,
        "subreddit": "investing",
        "created": 1594759528.0
    },
    {
        "author": "Griffinhunters",
        "body": "It's nice when your options are at 0.01  Nothing to worry about now!  🎉",
        "created_utc": 1595534870,
        "id": "fz0kyjo",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1595563670.0
    },
    {
        "author": "djh_van",
        "body": "Figure out your intention with your stocks. Do you want to be an Investor with your Tesla stock, or a Trader with your Tesla stock? Two different jobs, two different attitudes.   \n\nIf you want to be a Trader, then yes, you need to check it regularly.  In fact, you'll need a real-time trading station, subscriptions to data feeds like Bloomberg and Reuters, all to get those latest swings, most current advantages, and to be ahead of the thousands of traders worldwide. Yeah, I thought not.  \n\nOn the other hand, if you want to be an Investor...take a breath. Research your company, know its value, figure out what it's worth and where you expect it to get to based on fundamentalls, then leave it alone and wait. Check in every quarter to see if its sticking to the goals. Your timeline should be in the years, not hours. It really doesn't matter what Tesla does tomorrow. What it does long term matters.  \n\nTrust me, I've been down this exact road, and with Tesla. I first bought in at I think $29!!! It was swinging around huge amounts back then. I sold a bunch when it hit $100, thinking I was made. Now I look back at those days of sweating and wish I had just bought in and not looked at it until I was ready to buy a house or whatever. The daily swings today make my initial purchase look like blips on the graph. I wasted nervous energy on it. I didn't think like an Investor. I thought like a gambler. Now I know way more.",
        "created_utc": 1595323184,
        "id": "fyr06gr",
        "score": 102,
        "subreddit": "stocks",
        "created": 1595351984.0
    },
    {
        "author": "dmx442",
        "body": "BTC is nowhere anonymous, those coins are now flagged",
        "created_utc": 1594848141,
        "id": "fy6qn24",
        "score": 101,
        "subreddit": "investing",
        "created": 1594876941.0
    },
    {
        "author": "BSFirstOfHisName",
        "body": "I was only 32 years old. I loved Trump so much, I had all the MAGA hats and Apprentice shows. I pray to Trump every night, thanking him for the life I’ve been given. “Trump is love” I say, “Trump is life.\" My wife’s boyfriend hears me and calls me a gay bear. I knew he was just jealous of my devotion to Trump. I called him a cunt. He hits me and sends me to sleep. I'm crying now and my Positions hurt. I lay in bed, really cold. I feel something warm... It's Trump I was so happy.\n\nHe whispers in my ear \"This is my market.\" He grabs me with his orange hands, and puts me on my hands and knees. I'm ready. I spread my ass cheeks for Trump. He penetrates my butthole. It hurts so much, but I do it for Trump. I can feel my butt tearing and eyes watering. I want to please Trump. He roars a MAGA roar as he fills my butt with his love. My wife’s boyfriend walks in. Trump looks him straight in the eye and says, \"It's all puts now”. Trump leaves through my window. Trump is love. Trump is life.",
        "created_utc": 1595299618,
        "id": "fyq7ava",
        "score": 101,
        "subreddit": "wallstreetbets",
        "created": 1595328418.0
    },
    {
        "author": "adayofjoy",
        "body": "I bought AMZN at 1950. Then I panic sold it at 1900 because the valuations seem too high.\n\nI bought ZM at 165. Then I panic sold it at 150 because the P/E ratio seemed ridiculous\n\nI bought TSLA at 980. Then I panic sold it at 960 because P/E ratio seemed unsustainably high.\n\nStill made a profit from my buy and hold in QQQ, but now I realize that day-trading is not for me and investing based on P/E ratios only leads to mistakes.",
        "created_utc": 1594608373,
        "id": "fxw4peb",
        "score": 100,
        "subreddit": "investing",
        "created": 1594637173.0
    },
    {
        "author": "long_AMZN",
        "body": "dumbass /r/wsb was ultra bearish all of april and may, calling for a \"rugpull\" any day now",
        "created_utc": 1595345358,
        "id": "fyruyn3",
        "score": 99,
        "subreddit": "wallstreetbets",
        "created": 1595374158.0
    },
    {
        "author": "CtheKiller",
        "body": "Been on wsb and rh 3 years now, still don't know what options are but the memes are great!",
        "created_utc": 1595262561,
        "id": "fyo7owp",
        "score": 99,
        "subreddit": "wallstreetbets",
        "created": 1595291361.0
    },
    {
        "author": "instagigated",
        "body": "My worst investment decision was not investing my money and spending it on shitty whims and desires. Honestly, if I could go back 10 years with the knowledge I have now...",
        "created_utc": 1595870229,
        "id": "fzf86f0",
        "score": 98,
        "subreddit": "CanadianInvestor",
        "created": 1595899029.0
    },
    {
        "author": "the_corporate_slave",
        "body": "Op escaped the rat race and now has Stockholm Syndrome. You got out man! You made it!",
        "created_utc": 1594603864,
        "id": "fxvxh3a",
        "score": 97,
        "subreddit": "wallstreetbets",
        "created": 1594632664.0
    },
    {
        "author": "notrealfaker",
        "body": "I'm considering paychex calls. Anyone think they could moon with small businesses being reopened?",
        "created_utc": 1594056091,
        "id": "fx48laq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594084891.0
    },
    {
        "author": "YZY1K",
        "body": "Is it me or could $PAYX be a surprise tomorrow?",
        "created_utc": 1594067896,
        "id": "fx4wk5n",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594096696.0
    },
    {
        "author": "dwdsquared2",
        "body": "**Events in the US Today (EDT):**\n\n* 9:00am - FOMC Member Bostic Speaks \\[2/3 Volatility\\]\n* 10:00am - JOLTs Job Openings (May) \\[3/3 Volatility\\]\n* 1:00pm - FOMC Member Quarles Speaks \\[2/3 Volatility\\]\n* 2:00pm - FOMC Member Daly Speaks \\[2/3 Volatility\\]\n   * FOMC Member Barkin Speaks \\[1/3 Volatility\\]\n* 3:00pm - POTUS &amp; VPOTUS participate in a National Dialogue on Safely Reopening America’s Schools\n* 4:30pm - API Weekly Crude Oil Stock \\[2/3 Volatility\\]\n* \\~6:00pm - Treasury Department Report \\[2/3 Volatility\\]\n   * The Treasury Department’s semiannual Report to Congress reviews developments in international economic and exchange rate policies across the United States’ major trading partners\n* Miami-Dade County to closed bars, restaurants, gyms and other facilities in an effort to curb coronavirus transmissions\n* Walt Disney World prepares to reopen on Saturday\n* A number of Ivy League universities revealed plans for the 2020-21 school year that include bringing only a fraction of undergraduates back to campus\n* Delaware &amp; New Jersey voters head to the polls for primary voting\n* Novavax shares soar 38% premarket on news of $1.6 billion in funding for COVID-19 vaccine candidate\n\n**Events in the World Today (EDT):**\n\n* 12:30am - Australia RBA Interest Rate Decision &amp; Statement (Jul) \\[3/3 Volatility\\]\n* 2:00am - Germany Industrial Production (MoM-May) \\[2/3 Volatility\\]\n* 2:15am - Euro Zone ECB's Panetta Speaks \\[2/3 Volatility\\]\n* 3:30am - UK Halifax House Price Index (MoM-Jun&amp;YoY) \\[2/3 Volatility\\]\n* 4:30am - UK Labor Productivity (Q1) \\[2/3 Volatility\\]\n* 10:00am - Ivey PMI (Jun) \\[3/3 Volatility\\]\n* 11:20am - New Zealand GlobalDairy Trade Price Index \\[2/3 Volatility\\]\n* 7:50pm - Japan Current Account n.s.a. (May) \\[2/3 Volatility\\]\n* Malaysia's central bank on Tuesday cut its key interest rate for a fourth straight meeting to a historic low\n* The EU adjusted 2020 GDP forecasts to -8.7% from -7.7% in May\n* BlackRock downgrades US Equities To Neutral On Risks Of Fading Fiscal Stimulus; Upgrades European Equities To Overweight\n* Brazilian President Jair Bolsonaro has undergone another test for the coronavirus shortly after he displayed symptoms consistent with Covid-19\n* Samsung says profit jumped 23%, likely thanks to strong chip demand\n\n**Earnings Before Open:**\n\n* Paychex\n\n**Earnings After Close:**\n\n* Aspen, Levi Strauss, SMART Global Holdings",
        "created_utc": 1594119882,
        "id": "fx701dn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594148682.0
    },
    {
        "author": "slhsdt",
        "body": "anybody betting on paychex earnings?",
        "created_utc": 1594057490,
        "id": "fx4bj5o",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594086290.0
    },
    {
        "author": "yukhateeee",
        "body": "I don't follow PAYX closely, so I could be wrong. They're a well-regarded / well-managed company. Companies like that are difficult to short.  People keep buying the dips, so they don't go down as much as you want, nor stay down for long.",
        "created_utc": 1593776451,
        "id": "fwsoeg7",
        "score": 1,
        "subreddit": "options",
        "created": 1593805251.0
    },
    {
        "author": "qwidjib0",
        "body": "Oh hell yes.  Ran 1.5 businesses on Paychex and words can’t express how bad that business is vs. others now.",
        "created_utc": 1593966412,
        "id": "fx0dpb5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593995212.0
    },
    {
        "author": "MambaSing24",
        "body": "Is Paychex a play?",
        "created_utc": 1594044984,
        "id": "fx3mwwq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594073784.0
    },
    {
        "author": "xRiotZx",
        "body": "FB, EBAY, UPS, PAYX",
        "created_utc": 1594011496,
        "id": "fx2ju50",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594040296.0
    },
    {
        "author": "TheLoneComic",
        "body": "Paychex, to be on topic, has a long history of organic growth, but not being an industry group leader will probably hurt it as the economic contraction really starts to take hold, probably starting as early as right after this Independence Day weekend or a couple weeks thereafter.\n\nNot to be one of those the sky is falling people, the markets as well as the economy have been showing resilience and surprise here and there despite the massive wave of bankruptcies, student loan defaults, stay closed small business environment and more tsunami-ing toward us.\n\nIt’s gonna hammer, but remember the old market adage- it’s always a sunny day on Wall Street.",
        "created_utc": 1593663411,
        "id": "fwnu8xt",
        "score": 1,
        "subreddit": "options",
        "created": 1593692211.0
    },
    {
        "author": "sockalicious",
        "body": "Had the identical experience.  Used Paychex all of 2019, still unfucking the Paychex damage",
        "created_utc": 1593915501,
        "id": "fwymmsa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593944301.0
    },
    {
        "author": "LatinoMuyFinO",
        "body": "Oh nice cant wait to buy my levi and paychex calls...\n\nWtf is this list bruh",
        "created_utc": 1593895484,
        "id": "fwxr3zh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593924284.0
    },
    {
        "author": "ggFuji",
        "body": "Thoughts on Paychex?",
        "created_utc": 1593802702,
        "id": "fwtxmr3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593831502.0
    },
    {
        "author": "expat31",
        "body": "shit my bad i thought i was commenting on a NIO pusher post... don't know anything about PAYX",
        "created_utc": 1593813180,
        "id": "fwugkgy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593841980.0
    },
    {
        "author": "Particular-Wedding",
        "body": "Paychex should be very interesting.  small business drop off in payroll processing could be bearish.  on the other hand PPP loans incentivizing the retainment of employees may be bullish.  Also a lot has to do with the early re-openings of businesses around the country and FY guidance.",
        "created_utc": 1593886015,
        "id": "fwxa358",
        "score": 1,
        "subreddit": "options",
        "created": 1593914815.0
    },
    {
        "author": "Jayhawker23",
        "body": "I’m long Paychex. I don’t really care that much about what it does this quarter. It pays a dividend and will likely report good earnings after jobs come back in the future. I don’t think we’re there yet. But it’s all based on expectations so those should already be low.",
        "created_utc": 1593931521,
        "id": "fwz6sv6",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593960321.0
    },
    {
        "author": "xRiotZx",
        "body": "I bought FB, UPS, EBAY, PAYX, uuuhhh so much shit on Friday. I feel like my account is gonna look like a Christmas tree tomorrow morning.",
        "created_utc": 1594010963,
        "id": "fx2j5cq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594039763.0
    },
    {
        "author": "GoogallyMoogally",
        "body": "PUTS on PAYCHEX. There's better options. After dealing with a few payroll companies over the years I realized they're all similarly priced but far different operationally. Paychex is filled with rookies in my dumbfuck opinion. From top to bottom they all fumbled my money around and paid me back too many times to count. QuickBooks payroll is even better than Paychex and they make you do it all yourself while paying them.",
        "created_utc": 1593910329,
        "id": "fwyfbkp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593939129.0
    },
    {
        "author": "silverlink22",
        "body": "Anyone playing paychex for earnings?",
        "created_utc": 1593911142,
        "id": "fwygibx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593939942.0
    },
    {
        "author": "amoctar",
        "body": "Payx hr software company will report next week. I think If they beat ADP (leader in the market) gonna moon. Don't buy payx though seem like they're set to miss",
        "created_utc": 1593680747,
        "id": "fwoel9e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593709547.0
    },
    {
        "author": "amoctar",
        "body": "Who's following payx for earnings next week?",
        "created_utc": 1593617911,
        "id": "fwlc7bp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593646711.0
    },
    {
        "author": "sub2pewdiepie-_-",
        "body": "PAYX gang rise up!",
        "created_utc": 1593610189,
        "id": "fwkxs4f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593638989.0
    },
    {
        "author": "MurrGawd",
        "body": "WDFC calls, PAYX puts, WBA calls. Don't @ me.",
        "created_utc": 1594051770,
        "id": "fx3zsz0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594080570.0
    },
    {
        "author": "xRiotZx",
        "body": "Anyone playing PAYX earnings?",
        "created_utc": 1593802882,
        "id": "fwtxywr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593831682.0
    },
    {
        "author": "reddE2Fly",
        "body": "I would rethink the PAYX call [Analyst Bearish on PAYX](https://www.google.com/amp/s/seekingalpha.com/amp/article/4356774-sentiment-toward-paychex-remains-bearish-ahead-of-earnings-report)",
        "created_utc": 1593901415,
        "id": "fwy17oy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593930215.0
    },
    {
        "author": "notrealfaker",
        "body": "I'm considering paychex calls. Anyone think they could moon with small businesses being reopened?",
        "created_utc": 1594056029,
        "id": "fx48gpf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594084829.0
    },
    {
        "author": "iamscyrus",
        "body": "PAYX Puts?",
        "created_utc": 1594060546,
        "id": "fx4hnwk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594089346.0
    },
    {
        "author": "BeachDev19",
        "body": "Chances that  $PAYX opens up over 80 tomorrow?",
        "created_utc": 1594066911,
        "id": "fx4ujnu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594095711.0
    },
    {
        "author": "keyokenx1017",
        "body": "Because we all know you used mommy and daddy’s credit card cash advances your piggy bank funds and couch change to get enough to unlock margin and then spend all of that margin on PAYX calls",
        "created_utc": 1594067481,
        "id": "fx4vptw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594096281.0
    },
    {
        "author": "ggFuji",
        "body": "[https://www.marketwatch.com/story/paychex-profit-and-revenue-fall-but-beat-estimates-as-pandemic-weighs-2020-07-07](https://www.marketwatch.com/story/paychex-profit-and-revenue-fall-but-beat-estimates-as-pandemic-weighs-2020-07-07)\n\nPaychex earnings results. Slight beat. Bullish or bearish?",
        "created_utc": 1594128022,
        "id": "fx7ao0b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594156822.0
    },
    {
        "author": "trishulk99",
        "body": "My positions for the week how fucked am i be honest pls \nBABA $265 7/10 C \nNIO $15 7/10 C\nSHOP $1200 7/10 C\nPYPL $200 7/17 C\nD 7/17 $90 C (rip)\nMARK 7/17 $4 C\nPAYX $82.5 7/17 C\nBBVA $5 10/16 C what y’all think?",
        "created_utc": 1594104738,
        "id": "fx6kxdh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594133538.0
    },
    {
        "author": "amoctar",
        "body": "Payx",
        "created_utc": 1593621471,
        "id": "fwljmax",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593650271.0
    },
    {
        "author": "labloke11",
        "body": "Paychex will be interesting since they are barometer of how good employment is.",
        "created_utc": 1593881209,
        "id": "fwx0wdo",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593910009.0
    },
    {
        "author": "yukhateeee",
        "body": "I don't follow PAYX closely, so I could be wrong. They're a well-regarded / well-managed company. Companies like that are difficult to short.  People keep buying the dips, so they don't go down as much as you want, nor stay down for long.",
        "created_utc": 1593776451,
        "id": "fwsoeg7",
        "score": 1,
        "subreddit": "options",
        "created": 1593805251.0
    },
    {
        "author": "TheLoneComic",
        "body": "Paychex, to be on topic, has a long history of organic growth, but not being an industry group leader will probably hurt it as the economic contraction really starts to take hold, probably starting as early as right after this Independence Day weekend or a couple weeks thereafter.\n\nNot to be one of those the sky is falling people, the markets as well as the economy have been showing resilience and surprise here and there despite the massive wave of bankruptcies, student loan defaults, stay closed small business environment and more tsunami-ing toward us.\n\nIt’s gonna hammer, but remember the old market adage- it’s always a sunny day on Wall Street.",
        "created_utc": 1593663411,
        "id": "fwnu8xt",
        "score": 1,
        "subreddit": "options",
        "created": 1593692211.0
    },
    {
        "author": "ggFuji",
        "body": "Thoughts on Paychex?",
        "created_utc": 1593802702,
        "id": "fwtxmr3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593831502.0
    },
    {
        "author": "expat31",
        "body": "shit my bad i thought i was commenting on a NIO pusher post... don't know anything about PAYX",
        "created_utc": 1593813180,
        "id": "fwugkgy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593841980.0
    },
    {
        "author": "amoctar",
        "body": "Payx hr software company will report next week. I think If they beat ADP (leader in the market) gonna moon. Don't buy payx though seem like they're set to miss",
        "created_utc": 1593680747,
        "id": "fwoel9e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593709547.0
    },
    {
        "author": "amoctar",
        "body": "Who's following payx for earnings next week?",
        "created_utc": 1593617911,
        "id": "fwlc7bp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593646711.0
    },
    {
        "author": "sub2pewdiepie-_-",
        "body": "PAYX gang rise up!",
        "created_utc": 1593610189,
        "id": "fwkxs4f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593638989.0
    },
    {
        "author": "xRiotZx",
        "body": "Anyone playing PAYX earnings?",
        "created_utc": 1593802882,
        "id": "fwtxywr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593831682.0
    },
    {
        "author": "amoctar",
        "body": "Payx",
        "created_utc": 1593621471,
        "id": "fwljmax",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593650271.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 27th of July\n\n\n\n## Upcoming events for Monday, July 27th\n\n - Stock splits:\n\n    - FMO @ **1:5**\n    - MCC @ **1:20**\n\n - Expected earnings:\n\n  ABCB, ACI, AGNC, AMG, AMKR, ARE, ARLP, AVY, BOH, BRO, BSVN, CATY, CBU, CINF, CMRE, CR, CSBR, CX, DGICA, DSX, EHC, EQT, FBMS, FFIV, FIBK, FIX, FRBA, FRTA, FSB, GOOD, HAS, HBMD, HBT, HMST, HSII, HSTM, HTLF, HXL, IBA, IVAC, JBT, JJSF, LECO, LKFN, LM, LXFR, MEDP, MEDS, MMLP, MNSB, NBTB, NOV, NWBI, NXPI, OGS, OMF, PCH, PFG, PMBC, PPBI, PRK, QCRH, QTS, RBB, RNST, RPM, SALT, SAP, SBFG, SI, SMBC, SSD, TBI, TCF, TESS, TFII, TNET, UHS, USAK, VCRA, VET\n\n - Ex-div:\n\n  CVLY, FAST, SAFM\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.193%)\n    - 3-Month Bill Auction (previous: 0.120%)\n    - 5-Year Note Auction (previous: 0.330%)\n    - 6-Month Bill Auction (previous: 0.130%)\n    - Core Durable Goods Orders (consensus: 3.5%, previous: 3.7%)\n    - Dallas Fed Mfg Business Index (previous: -6.1)\n    - Durable Goods Orders (consensus: 7.2%, previous: 15.7%)\n    - Durables Excluding Defense (previous: 15.3%)\n    - Goods Orders Non Defense Ex Air (consensus: 2.3%, previous: 1.6%)\n    - Investing.com Gold Index (actual: 52.6%, previous: 50.9%)\n    - Investing.com S&amp;P 500 Index (actual: 41.0%, previous: 40.0%)\n\n## Upcoming events for Tuesday, July 28th\n\n - Stock splits:\n\n    - EMO @ **1:5**\n    - CEM @ **1:5**\n    - CTR @ **1:5**\n\n - Expected earnings:\n\n  AAT, ABG, ACCO, AFL, AGYS, AKAM, ALRS, AMAL, AMD, AMED, AMGN, APAM, APEN, ARCH, ASC, ASH, ATEN, ATRC, AUDC, AWI, AXS, B, BDGE, BE, BEN, BGFV, BPFH, BSBR, BUSE, BXP, BYD, CAC, CAR, CATC, CB, CCS, CE, CHRW, CMI, CNC, COWN, CSGP, CSLT, CSV, CVLT, CYH, DCOM, DENN, DHI, DTE, DXCM, EBAY, EBMT, ECL, EDU, EGP, EIX, ENVA, EQR, FBC, FBP, FCF, FELE, FEYE, FTV, GLW, GSS, HA, HAFC, HBCP, HIW, HLI, HOG, HP, HRZN, HUN, IBCP, IBTX, IMAX, IRDM, IVZ, JBLU, JNPR, LBC, LBRT, LH, LSCC, LW, MASI, MCD, MDC, MDLZ, MLM, MMM, MO, MPWR, MRC, MSCI, MTDR, MXIM, NBR, NEO, NWE, OKE, OMCL, OVV, OXSQ, PEGA, PFC, PFE, PII, PJT, PKG, PKI, PLT, PRGX, PRLB, PROV, QUMU, RCKY, RDHL, RNR, ROK, ROP, RRD, RTX, RVSB, RXN, SAN, SBUX, SHW, SIFY, SITC, SPGI, SPN, SQNS, SSNC, SSTK, ST, STAG, STX, SYX, TCS, TENB, THFF, THG, TPB, TRMK, TRU, TRVG, UDR, UMBF, UNM, USX, V, VBTX, WAB, WAT, WDR, WH, WNC, WNEB, WRE, XGN, XRX, YNDX, ZBRA\n\n - Ex-div:\n\n  AMRB, ATR, CFG, CLX, ENTG, GBX, WST\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 0.511%)\n    - API Weekly Crude Oil Stock (previous: 7.544M)\n    - CB Consumer Confidence (consensus: 94.5, previous: 98.1)\n    - Dallas Fed Services Revenues (previous: 5.7)\n    - Redbook (previous: -7.5%)\n    - Redbook (previous: 1.9%)\n    - Richmond Manufacturing Index (previous: -27)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -28)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 4.0%, previous: 4.0%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.3%, previous: 0.3%)\n    - Texas Services Sector Outlook (previous: 2.1)\n\n## Upcoming events for Wednesday, July 29th\n\n - Expected earnings:\n\n  AAN, ACGL, ADM, ADP, AEGN, AEM, AER, AGI, AHCO, AHT, AIN, AJRD, ALG, ALGT, ALIM, ALKS, ALTA, ALTM, AM, AMP, ANTM, APA, APHA, APLS, APRN, AQMS, AR, ARCB, ASGN, ATNI, AVB, AVGR, AVTR, AX, AXTA, BA, BBVA, BCO, BDC, BG, BHLB, BKCC, BKU, BLKB, BOOT, BSGM, BSMX, BSX, BTU, BXMT, CAKE, CBL, CCI, CCJ, CDE, CERN, CF, CFFN, CFMS, CGNX, CHDN, CHE, CHEF, CHT, CLS, CME, CMO, CMPR, CNMD, CODI, CONE, CORR, CPAC, CPF, CPLP, CRHM, CRTO, CS, CTO, CTSH, CVEO, CXO, DIN, DRE, DRTT, DT, DX, EEFT, EGOV, ENB, EPD, EQC, EQIX, ESRT, ETN, ETR, EVBN, EXEL, EZPW, FB, FBHS, FCPT, FICO, FISI, FLOW, FSS, FTI, GAIN, GD, GE, GIB, GLDD, GM, GRFS, GRMN, GWB, HBB, HBNC, HES, HESM, HI, HOLX, HOME, HPP, HWKN, ILPT, INOV, IO, IPG, IRT, ISBC, JAKK, JCS, JHG, JRVR, KAMN, KGC, KLIC, KN, KRA, KRC, KTOS, LADR, LFUS, LIVN, LRCX, LXU, LYG, MAA, MANT, MC, MCO, MEET, MEOH, MFG, MGLN, MGRC, MHH, MHO, MKSI, MLVF, MMSI, MNRO, MOBL, MPX, MSEX, MTOR, MTSI, MUFG, MYRG, NEXA, NGVT, NLS, NLY, NMM, NMR, NOA, NOVA, NOW, NSC, NSCO, NYCB, OC, OCX, OII, OIS, OMC, ONDK, ORLY, ORN, PAG, PB, PDM, PEIX, PGRE, PI, PPC, PS, PTC, PYPL, QCOM, QEP, QRVO, R, RAIL, RDWR, RDY, RES, RGCO, RIG, RJF, ROIC, ROL, RYI, SAIA, SANM, SBBP, SBH, SBPH, SC, SCI, SDPI, SFM, SGC, SHOO, SHOP, SIGI, SIMO, SITE, SIX, SKY, SLAB, SLRX, SMG, SNY, SP, SPFI, SPG, SPOT, SRDX, SREV, SRI, STRA, SWIR, TAK, TARO, TBIO, TBPH, TDOC, TEL, TGI, TKC, TLRD, TMDI, TPC, TPL, TRNO, TROW, TROX, TRTX, TS, TSE, TSEM, TSU, TT, TTEK, TTMI, TUP, TX, TYL, UCTT, URI, UTHR, UVE, VAC, VGZ, VICI, VKTX, VNDA, VSEC, VTVT, WERN, WHD, WING, WIRE, WLL, WRI, WTI, WTRE, XAN, YUM, YUMC\n\n - Ex-div:\n\n  AM, BPMP, ERF, FRC, HMLP, KNOP, MSB, PVBC\n\n - Economic events and announcements:\n\n    - Crude Oil Imports (previous: -0.076M)\n    - Crude Oil Inventories (consensus: -2.088M, previous: 4.892M)\n    - Cushing Crude Oil Inventories (previous: 1.375M)\n    - Distillate Fuel Production (previous: -0.097M)\n    - EIA Refinery Crude Runs  (previous: -0.103M)\n    - EIA Weekly Distillates Stocks (consensus: -0.618M, previous: 1.073M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: -0.2%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.386M, previous: -1.802M)\n    - Gasoline Production (previous: -0.016M)\n    - Goods Trade Balance (previous: -75.26B)\n    - Heating Oil Stockpiles (previous: -0.750M)\n    - MBA 30-Year Mortgage Rate (previous: 3.20%)\n    - MBA Mortgage Applications (previous: 5.1%)\n    - Pending Home Sales (consensus: 15.3%, previous: 44.3%)\n    - Pending Home Sales Index (previous: 99.6)\n    - Retail Inventories Ex Auto (previous: -1.6%)\n    - Seevol Cushing Storage Report (previous: 0.769M)\n    - Wholesale Inventories (previous: -1.2%)\n\n## Upcoming events for Thursday, July 30th\n\n - Expected earnings:\n\n  AAPL, ABTX, ACA, ADSW, AGCO, AGIO, AIMT, AINC, AJG, ALXN, AMSF, AMT, AMZN, ANIK, AOS, APO, APTV, ARI, ARW, ASPN, ATR, ATUS, AZN, BAND, BAX, BC, BGCP, BGS, BHR, BIO, BLDR, BPMC, BRKS, BSAC, BUD, BVN, BZH, CARR, CARS, CASA, CBTX, CBZ, CC, CCC, CFR, CG, CGEN, CI, CLF, CMCO, CMCSA, CNHI, CNOB, CNX, CNXM, COG, COHU, COLM, COOP, COP, COR, CPG, CPT, CRAI, CROX, CRS, CRY, CUBI, CUZ, CVA, CWT, CXP, DAN, DBD, DCO, DD, DECK, DLA, DLR, DLX, DNKN, DRQ, DSPG, DVA, EA, EBS, EGHT, EGO, EKSO, ELAN, ERII, ERJ, ESXB, EVLO, EXAS, EXP, EXPE, EXPO, F, FCN, FHI, FLEX, FLS, FMBH, FMS, FND, FORM, FORR, FTAI, FTS, FWRD, GHM, GIL, GILD, GLPI, GNRC, GOOG, GOOGL, GPC, GPI, GRA, GTX, HBI, HGV, HIG, HOPE, HST, HTGC, HTH, HUBB, HUBG, HURN, ICE, IDA, INFI, INT, IP, IRMD, ISDR, ITGR, JILL, K, KDP, KEX, KHC, KNSL, LAWS, LIN, LKQ, LLY, LNTH, LOCO, LPLA, LTC, LXRX, MA, MAS, MATW, MD, MDRX, MELI, MERC, MGM, MGNX, MGPI, MHK, MITK, MIXT, MMC, MMP, MN, MOH, MPW, MSA, MT, MTA, MTD, MTLS, MTX, MTZ, MWK, MX, MYE, NATI, NEM, NOC, NTCT, NTUS, NVCR, NVST, NXGN, ODFL, OFC, ONEW, OPI, ORBC, ORC, OSK, PATK, PBI, PCG, PEB, PFPT, PFS, PG, POWI, PQG, PRFT, PRO, QDEL, RDFN, RDS.A, RGEN, ROG, RP, RTRX, SAH, SEM, SGEN, SHAK, SIRI, SKYW, SNDR, SO, SOI, SPSC, SPXC, SSB, STBA, SWK, SWN, SYK, TAL, TAP, TBBK, TEAM, TEX, TFX, TIGO, TMHC, TNC, TNDM, TPX, TRP, TRS, TW, TWOU, TXT, ULH, UPS, UTL, VC, VCYT, VLO, VRAY, VRTU, VRTX, WEX, WLTW, WM, WRTC, WWE, WYND, X, XEL, XFOR, XHR, XLNX, XPO, XYL, ZEN\n\n - Ex-div:\n\n  AGNC, ALLY, AOS, ATLO, AVAL, BMRC, BRMK, BSRR, CADE, CCLP, COST, CRT, CSWI, DCP, DD, DNP, EFC, ENLC, EPD, EV, FT, GECC, GEL, GPP, GRP.U, KFFB, LNT, MCBS, MS, NI, NNN, NWN, OHI, ORC, OSBC, OVBC, PAA, PAGP, PBT, PETS, PFE, PLBC, PSEC, PSXP, SBNY, SLG, STAG, TGP, TRGP, TXN, UNM, USAC, UVE, VRTS, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 17,067K, previous: 16,197K)\n    - Core PCE Prices (consensus: 1.40%, previous: 1.70%)\n    - GDP (consensus: -34.0%, previous: -5.0%)\n    - GDP Price Index (consensus: 1.2%, previous: 1.6%)\n    - GDP Sales (previous: -3.5%)\n    - Initial Jobless Claims (consensus: 1,400K, previous: 1,416K)\n    - Jobless Claims 4-Week Avg. (previous: 1,360.25K)\n    - Natural Gas Storage (consensus: 36B, previous: 37B)\n    - PCE Prices (previous: 1.3%)\n    - Real Consumer Spending (previous: -6.8%)\n\n^^^^2020-07-27",
        "created_utc": 1595844034,
        "id": "fze1qb2",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1595872834.0
    },
    {
        "author": "flulikesymptom5",
        "body": "Investing in “non evil” companies is not a great strategy if you are looking to make money to be honest. If your objective is to just help fund companies that help forward your personal political beliefs then I understand but just be aware that historically heavily socialist/political  focused companies do not tend to do well in capital markets or as a PTC.",
        "created_utc": 1594655747,
        "id": "fxxu6kb",
        "score": 1,
        "subreddit": "investing",
        "created": 1594684547.0
    }
]