[
    {
        "author": "aurora4000",
        "body": "tomorrow CRWD, SNPS, SNOW AND ZS report earnings.",
        "created_utc": 1606870959,
        "id": "gebjirm",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606899759.0
    },
    {
        "author": "Blackops_21",
        "body": "In 4 years I've owned a LOT of different companies. I made big returns on TTD, MED, EQIX, SNPS, CROX, TREX, QS, and BLK to name a few off the top of my head. I've made so much money off FB even though the share price gain over the years isnt astronomical just because I'm pretty disciplined at selling when i feel companies are over extended and rebuying at lower points.\n\nDoing something for 4 years is one thing, keeping it up for another 11 is another. I can only hope.",
        "created_utc": 1609378820,
        "id": "ghk85an",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1609407620.0
    },
    {
        "author": "gagnonca",
        "body": "Fuck SNPS",
        "created_utc": 1608519474,
        "id": "ggjrkqr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1608548274.0
    },
    {
        "author": "Social_History",
        "body": "There are a LOT of Mendelian disorders. Sickle cell is a drop in the bucket in a giant sea of possible diseases that can be cured. For example, Vertex just bought Exonics which is doing gene editing for Duchenne’s, a super common single gene disorder in males.\n\nPlus, if delivery can be figured out, eliminating point mutations in cancers will be highly effective.\n\nPlus, gene editing single genes can have huge effects on polygenic disorders. Common SNPs in PCSK9 are completely effective in preventing heart disease, the number 1 killer in the US. \n\nPlus gene editing has uses in CAR T cells and other forms of immunotherapy. Ex vivo editing is a huge market.",
        "created_utc": 1608436068,
        "id": "ggftdk4",
        "score": 2,
        "subreddit": "stocks",
        "created": 1608464868.0
    },
    {
        "author": "cg1899",
        "body": "I've been dollar cost averaging in M1 Finance since October 28, 2019. I contributed $2000 for tax year 2019 and $6000 (max) for tax year 2020. I have current positions in the following:\n\nTTD, TSLA, FVRR, CRWD, PYPL, NFLX, SNPS, PINS, HUBS, TWLO\n\nMy last change, I took a little off the top with TWLO as I thought it was going to tank...it did not and it kept going. I wanted to spread some love to PYPL, NFLX, SNPS and PINS. I should have let it run, but oh wellz.\n\nWhat I'd like to do is hopefully have 40% annualized return so I can get $1,000,000 in a 10 year timeline. I'm not interested in going with index funds (I will advise folks who are in their 20s to do that; I'm in my early 40s and my risk appetite is quite high.)\n\nI am think of liquidating everything to keep my double-up and go into the following M1 pies:\n\n**Financial Pie** 25%\n\n**Consumer Cyclical Pie** 25%\n\n**Communication Services Pie** 25%\n\n**Technology Pie** 25%\n\n**\\*** **Financial Pie**\n\nLMND 50%\n\nPYPL 50%\n\n\\* **Consumer Cyclical Pie**\n\nAMZN 50%\n\nTSLA 50%\n\n\\* **Communication Services Pie**\n\nDIS 20%\n\nFVRR 20%\n\nPINS 20%\n\nTWLO 20%\n\nZM 20%\n\n\\* **Technology Pie**\n\nCRWD 17%\n\nHUBS 17%\n\nSHOP 17%\n\nTTD 17%\n\nADSK 16%\n\nOKTA 16%\n\n\\--------\n\nShould I start from scratch with the above? If I can get 40% or more of annualized returns with what I've done I'd be very happy. Once I get a million, I will then turn into a dividend investor and live off yields for the rest of my life. That's my goal anyway. I welcome any advice or being pointed in the right direction.",
        "created_utc": 1607968945,
        "id": "gfu0b2d",
        "score": 1,
        "subreddit": "investing",
        "created": 1607997745.0
    },
    {
        "author": "Doodlemors",
        "body": "$BABA huge upside potential , i am sure There will be no impact to business with China with Biden as president.\n$SNPS huge potential tech firm that’s not fully discovered but has great products and not behind competition (like intel is behind AMD)",
        "created_utc": 1607496818,
        "id": "gf58xpo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1607525618.0
    },
    {
        "author": "Doodlemors",
        "body": "BABA SPCE SNPS",
        "created_utc": 1607076527,
        "id": "gekxkl8",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1607105327.0
    },
    {
        "author": "iopq",
        "body": "There's a chance all of them suck. My holdings were:\n\nTSM (good)\n\nAMD (great)\n\nLAND (meh)\n\nLYFT (shit)\n\nGILD (shit)\n\nSNPS (recently okay, but would have been better if I bought in earlier)\n\nASML (okay)\n\nBRK (meh)\n\n\nLiterally the top two holdings made me the most profit. My timing on the other companies wasn't as good.",
        "created_utc": 1608909275,
        "id": "ggzq45c",
        "score": 1,
        "subreddit": "investing",
        "created": 1608938075.0
    },
    {
        "author": "iopq",
        "body": "For example, I sold $LYFT in March at a big loss because I expected people to stop riding taxis because of the virus.\n\nIt has since rebounded, but fact is it dropped to half of my sale price. I just bought Gilead which was even worse, so I closed that at a loss in September.\n\nI bought SNPS with that money which was okay. Had I bought it instead of GILD I would have made a great trade selling my LYFT shares.",
        "created_utc": 1608879009,
        "id": "ggyygyn",
        "score": 1,
        "subreddit": "investing",
        "created": 1608907809.0
    },
    {
        "author": "sapples84",
        "body": "I appreciate all the advice but I’ve hijacked the original posters happy share and I’m such a novice I don’t really have much to guide me but common sense.\n\nWhen Tesla hit 100% I took 25% (half my original buy) and reallocated to other stocks and funds. \n\nI have 60% of my stocks in funds (Baillie Gifford America, European and Positive Change / Fundsmith Equity / Allianz Global Artificial Intelligence) and appreciate I am paying a more experienced investor to manage my money at a premium.\n\nThe remainder is thinly spread over stocks and they are AMD / MSFT / NVDA / TSLA / NET / AMZN / AAPL / PTON / TRIP / SNPS / WKHS / CINE / AFC / NET / PHE / NIO / HYLN / NIO / PLTR / SE / SQ\n\nMy original buy is usually £1-5k depending on my magic 8 ball and apart from significant deficits on HYLN &amp; PHE I’m otherwise up/flat.\n\nHappy for any criticism or feedback",
        "created_utc": 1607706989,
        "id": "gferu3l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1607735789.0
    },
    {
        "author": "FUCKING_BACON",
        "body": "SPY. \n  \nQQQ.  \n  \nVUG.  \n  \n AMD.    \n  \nNVDA.    \n  \nTSLA.    \n  \nSNPS.    \n  \nPLTR.   \n  \nFSLR.   \n  \nSPCE.   \n  \nNCLH.      \n  \n(and BTC)",
        "created_utc": 1607738211,
        "id": "gfh783d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1607767011.0
    }
]