[
    {
        "author": "applesNoranges98487",
        "body": "I'm bearish. I'm still expecting maybe a 20% drop in the markets, overall, if things don't get better sometime soon (regarding the economy, domestic and international).\n\nTechnology has been strong and steady through all of this.  just keep an eye on things, it's good you have your list going.\n\n&amp;#x200B;\n\nopen up excel and start tracking which have the best dividend yields, which have the best survivability (being innovative). a lot of people like AAPL, but they're not really innovative anymore. people aren't gonna be stocking up on new phones and shit this year, and their div-yield is pretty low compared to some others. so IMO, I don't consider AAPL a good buy, compared to some other options. I would replace AAPL with JNPR, CSCO, VZ or even MCD.\n\nIf you plan on holding these for 10+ years, start DCA'ing or buy and stop watching. for the short term (next few months) shit's going to be volatile. in 10 years, the strong companies will have recovered from this, most likely already way beyond the 20-30% hit they just took.\n\nthis is all just my opinion, I'm in no way a professional.\n\n&amp;#x200B;\n\nEdit: something else to consider is Shareholder Rewards.\n\n&amp;#x200B;\n\nThis is my index watch list: LVS, WYNN, VZ,  JNPR, \\*AAL, CSCO, CVS, MCD,  JNJ, EXPE, LMT, PG, H, MSFT, AMZN, GOOG, TSLA, \\*BA, GBTC, NFLX, \\*FB, \\*DAL, BKNG, DIS, \\*CCL, \\*NCLH, \\*RCL, IHG, WVVI, ONVC, CWGL, CHDN, F, BRKB\n\n\\* = I'm watching to see how things pan out over the next few weeks-months.\n\nNote: They're sorted by highest dividend yield, with the exception of DIS and ONVC. there are several there that don't have dividends, but I'm watching anyway as I think there is long term growth in them.",
        "created_utc": 1585938041,
        "id": "fmc36jg",
        "score": 1,
        "subreddit": "options",
        "created": 1585966841.0
    },
    {
        "author": "6yXMT739v",
        "body": "Cicsco and Juniper are next to e.g. Huawei one of the major carrier grade network manufactorer. If you think of 5G Huawei is a big player, but for the backbones of the internet and all the routing and switching equipment needed, Cisco and Juniper are delivering the hardware for it.  \n\n\nDue to the virus outbreak many companies learned the hard way of digitalization and that meetings can be held online. But not only this particular event, with everything going on like SaaS etc. the network infrastracture needs to handle more and more data. That's where those company kick in. But also for private use you can get some good cisco equipment. Many companies use Cisco (Ubiquiti is also a strong company) for their network infrastracture and old infrastructure needs to replaced ... etc. etc.",
        "created_utc": 1586203449,
        "id": "fmmdru6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586232249.0
    },
    {
        "author": "6yXMT739v",
        "body": "u/FundamentalsInvestor What's your opinion about Juniper Networks?",
        "created_utc": 1586196870,
        "id": "fmm15vo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586225670.0
    },
    {
        "author": "WillBurnYouToAshes",
        "body": "Why would you buy Juniper over Cisco ? That makes no sense to me.",
        "created_utc": 1586208964,
        "id": "fmmoazj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586237764.0
    },
    {
        "author": "Sarkham89",
        "body": "I agree with most of this. Although, It’s skewed to be negative. Businesses expenses being used as a complaint to counter marketshare gains? JCP will be a good stock option for you, as there business expenses will be zero by end of year. \n\nI wouldn’t ever consider buying ZM, but I want to point out that AMZN wasn’t profitable for several years the company existed. I remember in 2012 it had a P/E over 3500. At around 250 it would that would have been a great investment. \n\nCOST just reported 1.5 billion YOY revenue increase for March. I think that this leans in the direction of it’s not merely e-commerce. \n\nDisney+ (DIS) reported recently it has over 50 million subscribers as of 2 months ago being around 20. \n\nWorking from home requires additional security. You are vastly under playing the business required for this. Home based networks can make confidential information more vulnerable. PAWN and CSCO both stand to benefit from this. (Carbonite mcafee, etc). There is also additional companies that help provide a safe portal (NTAP, CSCO, MSFT) to access the infrastructure. The servers networks need built (INTC, AMD, NVDA) and then stored (DLR). Then maintained (JNPR CSCO). \n\nBeyond al of that Stock market is speculative. I speculate this is a great country and we have great people in this country that will pull through and make it a better place to live. \n\nGood luck to you sir, you are your family stay safe.",
        "created_utc": 1586390258,
        "id": "fmuf9xp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586419058.0
    }
]