[
    {
        "author": "nosalute",
        "body": "futures are fucking spazzing out right now",
        "created_utc": 1606810268,
        "id": "ge8p8po",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606839068.0
    },
    {
        "author": "dweeegs",
        "body": "Crude oil busting out now too despite the OPEC shenanigan it’s gonna be boomer day tomorrow",
        "created_utc": 1606810400,
        "id": "ge8pdlj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606839200.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "I was up 15% all times, now im down 3% in less than a week. Thank you chinese EVs.",
        "created_utc": 1606809779,
        "id": "ge8oqkl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606838579.0
    },
    {
        "author": "ur-comment-but-biden",
        "body": "congress to legalize pltr janet yellen bullish markets to rise pltr undervalued upgraded buy pltr joe biden alex karp earnings beat pltr beat estimate warren buffet nelson rockefeller pltr buy now",
        "created_utc": 1606810627,
        "id": "ge8plyx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606839427.0
    },
    {
        "author": "POOTERSS",
        "body": "anyone in airlinees or cruises is JACKED TO THE TITS right now",
        "created_utc": 1606828139,
        "id": "ge9739a",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606856939.0
    },
    {
        "author": "H_o",
        "body": "yo can u cool it with the reality checks pls\n\nnow... to the moon pltr!",
        "created_utc": 1606820733,
        "id": "ge8z17r",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606849533.0
    },
    {
        "author": "CoronaPooper",
        "body": "Ok here..\n\nHi I'm Warren, some of you must know me as a value investor. Benji and I loved penny stocks, but now with with Munger mungling us, we like the bigger brands. Please buy the GME security, because security analysis tells us it is the best value with makes you an intelligent investor. Warmest regards, drink the cola.",
        "created_utc": 1606809603,
        "id": "ge8ojo3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606838403.0
    },
    {
        "author": "sunstersun",
        "body": "healthcare software.\n\nfocusing on enterprise and market accessibility to new digital/AI tools. they're collecting tons of data and running a pilot program for health on their employees right now.\n\nI'd be surprised if apple, google, microsoft, and amazon didn't view healthcare as a potential next big thing for them.",
        "created_utc": 1606809921,
        "id": "ge8ow4d",
        "score": 2,
        "subreddit": "investing",
        "created": 1606838721.0
    },
    {
        "author": "doplitech",
        "body": "yea we are building it out right now, like all those van builds you see on Instagram or YouTube. We’ll have like a portable shower but our main source would be gyms campgrounds for showers so we don’t waste our freshwater",
        "created_utc": 1606809920,
        "id": "ge8ow42",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606838720.0
    },
    {
        "author": "got_meatsweats",
        "body": "Up 3.50% on the European exchanges right now",
        "created_utc": 1606810395,
        "id": "ge8pdew",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606839195.0
    },
    {
        "author": "ds580",
        "body": "I did some research and like them. They appear to solve the lidar cost challenges which puts them in a good position for automotive (lidar has inherent advantages over stereo camera systems that are common today for cost efficiency). This is a good startup with a very specific and focused problem to solve.\nThe even more enticing prospect to me are the consumer electronics applications. IPhone 12 now added lidar to improve photo depth. That's just the beginning of usage for these. With a simple cost effective chip these could start showing up a lot of places.\nWhat isn't clear to me is how they are protecting this tech and preventing others from replicating unless it's strictly cost advantage of being first.\n\nTake a look through the investor pitch from Aeva. It has good info and makes it digestible.",
        "created_utc": 1606828547,
        "id": "ge97nad",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1606857347.0
    },
    {
        "author": "StormyMonday024",
        "body": "Why would they need to do a secondary offering? They’re flush with cash right now, that’s what makes them fifteenth from blockbuster",
        "created_utc": 1606828161,
        "id": "ge974c9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606856961.0
    },
    {
        "author": "RedditDani",
        "body": "Bears appearing now is a good sign. Means we aren’t in august territory rn",
        "created_utc": 1606828732,
        "id": "ge97wgn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606857532.0
    },
    {
        "author": "t3amkill",
        "body": "CRSR green in pre-cum market. Buy now before it starts to fully cum at open",
        "created_utc": 1606828379,
        "id": "ge97f2b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606857179.0
    },
    {
        "author": "CollectedData",
        "body": "Buy the P/E dip now!",
        "created_utc": 1606828551,
        "id": "ge97nga",
        "score": 1,
        "subreddit": "investing",
        "created": 1606857351.0
    },
    {
        "author": "FuzziBunniRcstr",
        "body": "In at .45 myself, its more than contract tracing, and covid.  More excited about the AI and wallet and POS tech.  Although the covid part is hot right now",
        "created_utc": 1606828978,
        "id": "ge98946",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1606857778.0
    },
    {
        "author": "jloy88",
        "body": "Just FYI your site has been live for a day and I've checked it about 42 times between premarkets yesterday and today.   Get the AdSense signed up for right now this is going to be a resource many many of us use",
        "created_utc": 1606827881,
        "id": "ge96r6j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606856681.0
    },
    {
        "author": "Grand_Ad_7440",
        "body": "Automation will bring the end of capitalism\n\nThe fact that people are scared of losing their jobs and not happy that robots can now do it and they don't have to slave away shows how funking stupid everyone is",
        "created_utc": 1606828602,
        "id": "ge97q11",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606857402.0
    },
    {
        "author": "Fantastic_Wallaby_61",
        "body": "Is it bad that I hate weekends now?",
        "created_utc": 1606828599,
        "id": "ge97ptn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606857399.0
    },
    {
        "author": "tfam2020",
        "body": "I've been copying hyjbrighter and jaynemesis for about 2 months now and seen my account grow by 5% I'm pretty happy with that. You need to check how many years theyve been trading, plus their profitable months and assess yourself if it is risky using them or not. Another thing would be dont have too many copys open, you dont need to. You can have up to $2million assigned to one copier the only reason I would see the need to open multiple copies is if you have more than this assigned with one good copier so you are forced to have to take the risk of finding additional traders to copy.",
        "created_utc": 1606810094,
        "id": "ge8p2a5",
        "score": 1,
        "subreddit": "InvestmentClub",
        "created": 1606838894.0
    },
    {
        "author": "SaneLad",
        "body": "I've got some juicy NKLA 5 P. They went like 700% up today. Now I'm only 70% down. Diamond hands!",
        "created_utc": 1606809883,
        "id": "ge8oukt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606838683.0
    },
    {
        "author": "Adderalin",
        "body": "$65/hr is also relative to how much you invest. For the $90k difference in the two assets over 2 years at 21.5% annualized and 25% annualized the starting bucket for SPY and the active trading would be 1,050,000.00 each. \n\nIf OP did $2.1m in each bucket then it'd be $180k difference and so on. \n\nNow if OP just threw his entire $2,100,000 starting capital into a more efficient portfolio like [UPRO/TMF](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=2&amp;startYear=2018&amp;firstMonth=1&amp;endYear=2020&amp;lastMonth=11&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=2100000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=3&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;showYield=false&amp;reinvestDividends=true&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=UPRO&amp;allocation1_1=55&amp;symbol2=TMF&amp;allocation2_1=45) he'd be up to a total of 4,920,310 for a gain of $2,820,310 for 0 hours of work.",
        "created_utc": 1606810044,
        "id": "ge8p0ka",
        "score": 1,
        "subreddit": "investing",
        "created": 1606838844.0
    },
    {
        "author": "xyz9100",
        "body": "Yeah I guess that’s the thing and why I’m asking. It’s uncertain when the crash is. Could be sooner or later. Tbh I guess I’m in a good position where if I invest right now and a crash does happen soon. I still fortunately have enough to still invest during the crash and let my prior investments recover in the long run. Sound good to me? \n\n I forget the exact quote, but there was this saying I heard where the best time to invest is always now because in the time I keep taking to ponder to find the right time I could already be growing.",
        "created_utc": 1606809689,
        "id": "ge8on35",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606838489.0
    },
    {
        "author": "DoubleKillGG",
        "body": "Your source is a seekingalpha article. Not only that, your source backs up my point. \n\nYes, there are around 20% shares floating in the market. How? Thiel, Karp, et al., sold them to the market to make shares available. Why? In a direct listing no new shares are created. Before they sold there was 0% shares floating in the market but by selling shares they made it available to be traded on the market. \n\nWhy does your source reference an article that states that after a lock-up ends that there could be a flood of \"new\" shares if those subject to the lock-up decide to sell? \\[*Keep in mind that \"new\" means shares that were not previously allowed to be traded on the market but are now allowed to.*\\] It's because when they sell they increase the %float of shares trading in the market. Sounds familiar? Let's say, for example, the float increase 5%. How? No new shares were created? How did the float increase by 5%? Because early investors sold their shares to their market making previously unavailable shares available.\n\nCongrats buddy, you played yourself.",
        "created_utc": 1606811702,
        "id": "ge8qoks",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606840502.0
    },
    {
        "author": "b10m1m1cry",
        "body": "Rofl.  I have to check that sub out when i have se free time.  Must be some serious shit going down in that sub right now.",
        "created_utc": 1606810706,
        "id": "ge8potq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606839506.0
    },
    {
        "author": "BigMartyOG",
        "body": "[https://twitter.com/Ruteo\\_Solutions/status/1333682598678294528?s=20](https://twitter.com/Ruteo_Solutions/status/1333682598678294528?s=20)\n\nNow I think I'm long ahahaha.",
        "created_utc": 1606810707,
        "id": "ge8povm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606839507.0
    },
    {
        "author": "Pyrrhura_molinae",
        "body": "I read this sub for entertainment only. So many people here are not understanding that short term capital gains are taxed at whatever your marginal tax rate state/fed. I am in Oregon, with a 9.9% income tax rate, plus a higher marginal Federal tax rate. If I am not taking that into account for risk management, all I am doing is putting in a lot of effort for a lot of risk for modest after tax gains which is why I am mostly now dealing with long term investing which has a much lower tax rate, and much less stress. I assume many of you enjoy this like it is Vegas. I don't.",
        "created_utc": 1606810718,
        "id": "ge8ppbk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606839518.0
    },
    {
        "author": "Rattlesnake_Mullet",
        "body": "Spend to time to educate yourself on Bitcoin and you'll realize how incredibly cheap it is right now.",
        "created_utc": 1606813297,
        "id": "ge8s7y5",
        "score": 1,
        "subreddit": "investing",
        "created": 1606842097.0
    },
    {
        "author": "flybach",
        "body": "I use Moomoo's platform. You only need an account to use it. \n\nAnd if you want, you can trade HK stocks with it. HK is now the backup market if Chinese companies get delisted from the U.S.",
        "created_utc": 1606810406,
        "id": "ge8pdto",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606839206.0
    },
    {
        "author": "opiumman369",
        "body": "Once I got free tokens of one platform. But when I got more info more about it I understood that I became a member in DuckDuo club! Just look at the DDIM price now!",
        "created_utc": 1606811371,
        "id": "ge8qd0r",
        "score": 1,
        "subreddit": "investing",
        "created": 1606840171.0
    },
    {
        "author": "GiraffeAlert",
        "body": "He's speaking at the senate committee on banking, housing, and urban affairs which starts at 10AM so I'd imagine he's speaking shortly after that. Have your SPY puts ready to go! Although, his 5 page speech is already available online to read now, and its mixed IMO, but here it is so you can have a jump on everything. bisDOTorg/review/r201201a.htm",
        "created_utc": 1606811368,
        "id": "ge8qcwg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606840168.0
    },
    {
        "author": "emichael86",
        "body": "So, about 160 of us should be absolutely banging it right now.",
        "created_utc": 1606812261,
        "id": "ge8r7zl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606841061.0
    },
    {
        "author": "Rude_Journalist",
        "body": "Honestly I’m doing that *right now*",
        "created_utc": 1606811506,
        "id": "ge8qhu0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606840306.0
    },
    {
        "author": "visionridge",
        "body": "One more thing I would like to add. The concept of a Black Swan which is simply an event that is unlikely or hard to quantify that can still occur that has an immeasurable but extremely large downward or negative impact. Everyone seems to believe SPACs are in a bubble right now. I think we can all agree that is true. And at some point there will be a \"SPAC attack\" as people like to call it. We saw it mid-September and it took until Nov. to fully recover in many cases. \n\nHow do you quantify the risk of being in positions you cannot get out of when the bubble pops? How do you quantify the lost opportunity of buying SPACs at a discount in the middle of one of those attacks?\n\nMost of my biggest gains in November are the result of having cash on the sidelines that I put to use during the September attack. I just booked a 103% gain on my SPAC holdings due mostly to paying less \"opportunity cost\" in Sept. than a \"zero risk\" parking money in near-NAV strategy would have paid. I could follow a \"park til pop\" strategy for the next 12 months and come no where near my November gains even AFTER excluding the \"average\" SPAC gains. All due to rejecting the \"zero risk\" thesis.\n\nBut of course the bottom line is to follow a strategy that you understand, are comfortable with, and that seems to work for you based on your risk profile.",
        "created_utc": 1606811664,
        "id": "ge8qna4",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1606840464.0
    },
    {
        "author": "Snow_Administrative",
        "body": "What the fuck is CAAS now?",
        "created_utc": 1606813027,
        "id": "ge8ryhg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606841827.0
    },
    {
        "author": "Ok_Yak_6448",
        "body": "Oh thank god haha thats good to hear, I’m thinking based on the cost I can’t lose that much, just want to keep my shares. Would it be better for me to place the buy option now if I can’t wake up at 6:30, or would the price difference be too little to matter? Thanks for your help btw :)",
        "created_utc": 1606812964,
        "id": "ge8rwca",
        "score": 1,
        "subreddit": "options",
        "created": 1606841764.0
    },
    {
        "author": "OhWowMuchFunYouGuys",
        "body": "$BDRBF is my risk tomorrow, solid two weeks. New CFO and just finalized delivery on their $75 dollar super speed charter jet.\n\nThey are making decent decisions now.",
        "created_utc": 1606815510,
        "id": "ge8u9uu",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1606844310.0
    },
    {
        "author": "DidYouReadThatThing",
        "body": "You have to set the order type for extended hours pre-market and usually a limit order for it to execute before the market opens.\n\nLook at it this way, SNDL is at .99 now so you’ve doubled you money at least, not tripled like you planned.",
        "created_utc": 1606817316,
        "id": "ge8vw9n",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1606846116.0
    },
    {
        "author": "unclekarl_",
        "body": "On an AAL flight right now. The plane is packed. People in every row, some rows are filled with people with no seats skipped. It’s pretty crazy. \n\nBuy AAL calls",
        "created_utc": 1606815062,
        "id": "ge8tv1l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606843862.0
    },
    {
        "author": "BuxtonB",
        "body": "Would there have been more drop if Milton had sold his shares, I know right now it's pre-market, but would this only have been reflected when the market actually opens?\n\nI'll be genuinely shocked if he hasn't sold them.",
        "created_utc": 1606815555,
        "id": "ge8ubc2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606844355.0
    },
    {
        "author": "finanx",
        "body": "It cannot get worser than this, from now on everything is a gain",
        "created_utc": 1606815548,
        "id": "ge8ub38",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606844348.0
    },
    {
        "author": "AnalyticAlpha",
        "body": "Private for now for rotary wing, training in a R-22.",
        "created_utc": 1606816172,
        "id": "ge8uv53",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606844972.0
    },
    {
        "author": "Tapprunner",
        "body": "Sell at least half of that now. Take some gains. Don't get greedy.\n\nDon't be the guy who sees a meteoric and nonsensical rise and then watches it fall back to earth while waiting for a turnaround that's never going to happen.\n\nYou got insane gains in a year. I know you're on WSB but you're not actually required to act like an idiot.",
        "created_utc": 1606816625,
        "id": "ge8v9wn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606845425.0
    },
    {
        "author": "t3amkill",
        "body": "If I buy now GME needs to hit $19.95 for me to break even. What are chances?",
        "created_utc": 1606815937,
        "id": "ge8unmr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606844737.0
    },
    {
        "author": "sponge_hitler",
        "body": "It only seems like that because you suffer from Hindsight Bias. \n\nYou think now it was obvious that Amazon, Bitcoin, Tesla, etc. would become this big? If yes then why didn't everyone invest in them? Hell you didn't even know that Bitcoin is a thing 5 years ago, so you likely don't even know the next big thing yet!",
        "created_utc": 1606815000,
        "id": "ge8tsys",
        "score": 1,
        "subreddit": "investing",
        "created": 1606843800.0
    },
    {
        "author": "curtycurry",
        "body": "I will but for now Im a retard lol I thought weeklies were POPPIN but... Ig WSB just doesnt have the razzmatazz to get that guy to eat his own shit (burning WSB to get people to buy and prove me wrong, I love y'all)",
        "created_utc": 1606815736,
        "id": "ge8uh84",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606844536.0
    },
    {
        "author": "seeking_vega",
        "body": "It happened to me twice before. Learned from my mistakes,  never repeated them again, and now I made multiple the amounts lost. Never give up.",
        "created_utc": 1606815732,
        "id": "ge8uh2v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606844532.0
    },
    {
        "author": "brunoda",
        "body": "From now on this stock should start recovering once people forgets Citron shits...",
        "created_utc": 1606814429,
        "id": "ge8t9r6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606843229.0
    },
    {
        "author": "bwayne11111",
        "body": "Work is increasing because a take over price will be greater than the current market price. (Probably pretty close now after the run up last week)\n\nCRM is decreasing because they will likely use stock to purchase work. This means CRM will print stock like money and inflation will occur. The market cap of CRM will increase (from stock being printed to acquire work) but the overall value will not increase. In other words, dilution of shares will take place. This future devaluing of the company stock is causing people to sell off some shares",
        "created_utc": 1606814866,
        "id": "ge8tojg",
        "score": 1,
        "subreddit": "investing",
        "created": 1606843666.0
    },
    {
        "author": "send_the_gnar",
        "body": "i did too though now i’m realizing it is probably headed straight for 700 before a and p inclusion",
        "created_utc": 1606816307,
        "id": "ge8uzm2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606845107.0
    },
    {
        "author": "pickbot",
        "body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|**OI**|**Volume**|\n|:-|:-|:-|:-|:-|:-|:-|:-|\n|**GME**|**$20**|**BUY CALL**|**2020-12-04**|**$0.65**|**$16.56**|**8583**|**0**\n|**GME**|**$24**|**BUY CALL**|**2020-12-24**|**$1.94**|**$16.56**|**230**|**0**\n|**GME**|**$24**|**BUY CALL**|**2020-12-04**|**$0.31**|**$16.56**|**945**|**0**\n\n[Realtime ROI](https://www.pickmojo.com/pick/cki5svol5ijad0774v9z0r63p) | [Track Record](https://www.pickmojo.com/user/blake270797/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit) | [Exit this position](https://www.pickmojo.com/reddit_redirect)\n\n**^(*Recorded after market close, will be recorded at the next market open if the premium is within 10% margin. My owner is monitoring these posts, reply with feedback! You can now track comments by mentioning me!)**",
        "created_utc": 1606816202,
        "id": "ge8uw58",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606845002.0
    },
    {
        "author": "Loonter",
        "body": "You’d be betting that there’s going to be a big market downturn because of covid (who knows). People are super bullish on these stocks now that a vaccine is in since they want to ride it back up. Take it from an autist losing money on CCL puts right now",
        "created_utc": 1606818665,
        "id": "ge8x3x1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606847465.0
    },
    {
        "author": "mfairview",
        "body": "mso may be cute but already established in the world's biggest market and making more money than LP.  don't get me wrong, I'm all in LP's right now but the US is where the money will be.  just trying to understand how LP will close the multi-year gap the MSOs have in the states.  also, not a whole lot happening in the international stage right now other than maybe medical (IIRC from cgc er).",
        "created_utc": 1606819957,
        "id": "ge8yb2s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606848757.0
    },
    {
        "author": "ke263565",
        "body": "My wife loves that place.   Now they have ulta and starbucks.  It's basically the mall.",
        "created_utc": 1606820154,
        "id": "ge8yhqp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606848954.0
    },
    {
        "author": "Balkan_Error",
        "body": "When should I buy it? Right now on 590 or wait for it to drop?",
        "created_utc": 1606817604,
        "id": "ge8w5ma",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606846404.0
    },
    {
        "author": "o0k4m1",
        "body": "Hello!  \n30 y/o, started out trading stocks around 5 months ago. Invested 100-300 euros every month. Learned a lot and gonna learn lots more! I use Revolut app for this, so I am a bit limited to what I can trade, but it seems enough for now.\n\nCurrently, I have:  \nAAL 20,5 shares  \nAAPL 1,72 shares  \nCCL 3 shares  \nNFLX 0,41 shares  \nPLTR 7,58 shares  \nPFE 2,98 shares  \nTSLA 0,94 shares  \nVTRS 6,91 shares  \nXPEV 3,49 shares.\n\nPlayed a little with NIO and SFIX, MSFT, but since I am new to this and impatient, sold at (in my mind) good profit and bought other stuff, now it feels weird to buy back, let's say NIO. Currently, I calculate 27,4% profit on my portfolio from the cash I invested, so I consider myself lucky for not screwing up these savings too much. Usually I stay in the green, except for Netflix, Pfizer and Viatris, so maybe I'll get rid of these when the time feels right. I plan on continuing investing cash every month and learning more, comments are really welcome :)",
        "created_utc": 1606818370,
        "id": "ge8wu94",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606847170.0
    },
    {
        "author": "uxo9",
        "body": "Don’t buy weeklies, try something that’ll expire a  month or two from now",
        "created_utc": 1606818785,
        "id": "ge8x7wb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606847585.0
    },
    {
        "author": "MadCritic",
        "body": "Doesn't = stock price. Stock is priced right now for 50k delivered",
        "created_utc": 1606819201,
        "id": "ge8xlre",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606848001.0
    },
    {
        "author": "beefcleats",
        "body": "Nothing makes it certain. I just play probabilities.  Look back at daily RSI levels for when tsla squeezes. We have plenty on daily RSI left before it’s maxed out. Given the S&amp;P addition, this will likely peak out before that Dec 21st date which means if it’s going to run and continue its typical squeeze then it’s going to do it now, especially with the rest of the market moving up.",
        "created_utc": 1606819566,
        "id": "ge8xxxg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606848366.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "A lot of these stores found digital channels to sell through. \n\nBrick &amp; Mortar armageddon already happened, now the strong will still survive for some time imo.",
        "created_utc": 1606820013,
        "id": "ge8ycwy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606848813.0
    },
    {
        "author": "stupidgutsneverglory",
        "body": "Back in the day when someone mentioned a ticker nobody knew about the common reply would be \"what do they do?\" now its just \"what strike/exp?\". No clue about what FLIR does but im going to truly yolo on Jul 45c they are cheap and its below its ath so fuck it.",
        "created_utc": 1606818739,
        "id": "ge8x6cw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606847539.0
    },
    {
        "author": "BarbarX3",
        "body": "The golden age of investing is just beginning, always has been. I look back 10 yrs, 20yrs, 30yrs, 40yrs etc and wonder why people who could have been investing back then are not insanely rich right now. With the same reasoning you can look 10, 20, 30 yrs into the future and ask yourself why you can not be insanely rich then. We are in a boom period for mankind never seen before; communication, sharing information and education level has never been better. There have never been this many people competing, and competition drives innovation and wealth. Past 10% annual stock performance will look like peanuts decades from now. My children will wonder why I didn't become rich living in these times if I don't invest while I could have.",
        "created_utc": 1606819532,
        "id": "ge8xwtq",
        "score": 1,
        "subreddit": "investing",
        "created": 1606848332.0
    },
    {
        "author": "djpitagora",
        "body": "there are hundreds of spacs now looking for targets and I imagine a lot will fail to find one after two years. I think the results of such an ETF would be horrible",
        "created_utc": 1606817883,
        "id": "ge8wejd",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1606846683.0
    },
    {
        "author": "aidenargall",
        "body": "Okay, I’ve also been thinking about stocks, however I don’t know where to start. Which platform do you recommend? To buy stocks. And now with the crisis I think there’s extra risk.. but I think companies like moderna, Pfizer and Tesla will make profits soon",
        "created_utc": 1606818305,
        "id": "ge8ws5z",
        "score": 1,
        "subreddit": "investing",
        "created": 1606847105.0
    },
    {
        "author": "AdOld9994",
        "body": "What do you mean by that? Yeah so say i start with 10k, trade and build it up to 100k and now want to withdraw 20k ?",
        "created_utc": 1606818904,
        "id": "ge8xbsj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606847704.0
    },
    {
        "author": "aux_armes",
        "body": "They’re really popular in Japan right now",
        "created_utc": 1606819356,
        "id": "ge8xqym",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606848156.0
    },
    {
        "author": "pubstumper",
        "body": "Idk bruh, people been saying this for a long time now don’t wanna sound like a broken record",
        "created_utc": 1606819354,
        "id": "ge8xqwb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606848154.0
    },
    {
        "author": "evil_memo",
        "body": "Question: in 2018 I took a -55k realized loss ytd.\nIn 2020, I made +20k so does that mean i dont pay short term taxes for my 20k? \nMy new total loss deductible is now -35k which i can use for tax deductible??",
        "created_utc": 1606822024,
        "id": "ge9097g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606850824.0
    },
    {
        "author": "Phaeax",
        "body": "not now mom, I'm playing the PLTR GME, its L33T",
        "created_utc": 1606822017,
        "id": "ge908yw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606850817.0
    },
    {
        "author": "Misanthrooop",
        "body": "Any new thoughts here about New Wave Holdings?\n\nmy initial position is curently 90% down. I just bought it for the \"shroom boom\" , and if it goes to zero, it will go to zero. \n\nBut, now at a price of 0.026€ / share - is it may be a opportunity of  hardly average down my entry price, or is it still a \"shitstock\"?",
        "created_utc": 1606822454,
        "id": "ge90oj5",
        "score": 1,
        "subreddit": "shroomstocks",
        "created": 1606851254.0
    },
    {
        "author": "oleosmirf",
        "body": "I have a relatively small position of 100 units, which are now split.",
        "created_utc": 1606821226,
        "id": "ge8zhu3",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1606850026.0
    },
    {
        "author": "toeofcamell",
        "body": "how do I know when to sell?  I went way up and got crushed on Sept. 2nd (lost $25,000 in 2 days)  went way up then got crushed again on Oct. 13th.  now I'm making money again, still way down all time.\n\nhow do I know when to get the fuck out and sell?",
        "created_utc": 1606821882,
        "id": "ge904cp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606850682.0
    },
    {
        "author": "Eichizen",
        "body": "Yeah, Tesla sure has research here but so does other auto makers as well as other battery companies. In fact, they spend much more here on R&amp;D. Do we really now that Tesla has better batteries in development than competitors if we look at a 5-10 year time span?",
        "created_utc": 1606821925,
        "id": "ge905sg",
        "score": 1,
        "subreddit": "investing",
        "created": 1606850725.0
    },
    {
        "author": "bigchillinlat",
        "body": "Gtfo now",
        "created_utc": 1606820910,
        "id": "ge8z71l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606849710.0
    },
    {
        "author": "maderfarker3",
        "body": "You literally cannot lose when you trade between April to now.",
        "created_utc": 1606820910,
        "id": "ge8z72s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606849710.0
    },
    {
        "author": "LavenderAutist",
        "body": "Well, I do understand convertibles and I understand the silly gambit that happened earlier this year.\n\nElon was in a tough position with the convertible debt and needed the share price to rise so that the debt could convert to equity and he would be able to get more cash to fund their operations.\n\nIf the share price didn't skyrocket this year, Tesla would be in a whole different situation.\n\nIf I were Elon, I would try to do a $25 billion share offering. It would be 5% of thier current valuation. And if the share price fell, no big deal. They would have enough cash to go hard at their new business lines without worrying about where to get it in the future.\n\nThe counter argument would be that the dollar is losing its value so why do so much now. But it is also my opinion that many experts who believe in this reflation trade and the death of the dollar are wrong. So my assumptions drive my options.",
        "created_utc": 1606821980,
        "id": "ge907pa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606850780.0
    },
    {
        "author": "BearishDieVirgins",
        "body": "NIO just said they're now forced to rapidly expand production capacity in order to keep up with increasing demands 💰 💵 🤑",
        "created_utc": 1606820432,
        "id": "ge8yr45",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606849232.0
    },
    {
        "author": "RandomYouTuber69",
        "body": "35% shorted vs what, 140% shorted that it is now?!   \nCombined with much better future prospects and if the general market doesn't crash over the next 3-4 months, GME goes $30+.\n\nHop onboard mates, we're taking off!",
        "created_utc": 1606821295,
        "id": "ge8zk83",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606850095.0
    },
    {
        "author": "justanoththrowaway94",
        "body": "Who the hell is buying bonds now when the stock market won’t stop pumping?",
        "created_utc": 1606821295,
        "id": "ge8zk7p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606850095.0
    },
    {
        "author": "Okleksik",
        "body": "Imo it depends. Starting with small sums isnt the same when it comes to hours spend on doing research. However if you think that in the future you might start with bigger numbers, which would give you (let's say - 10 dollars for every hour spend researching) then the experience you get now will be pure gold. People also say that starting early is extremaly important when it comes to compound interests, which will go high over the years!",
        "created_utc": 1606821754,
        "id": "ge8zzyo",
        "score": 1,
        "subreddit": "investing",
        "created": 1606850554.0
    },
    {
        "author": "owlbear4lyfe",
        "body": "2-3 payed out.  the autism is now wandering.",
        "created_utc": 1606822425,
        "id": "ge90ni6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606851225.0
    },
    {
        "author": "Sufficient_Mulberry1",
        "body": "Their share lock ends today. All the og investors and employees can sell now. It’s gonna crash just like yesterday",
        "created_utc": 1606822989,
        "id": "ge917jh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606851789.0
    },
    {
        "author": "G_Morgan",
        "body": "I'm not touching TSLA either way but this is what the graph looks like right now\n\nhttps://imgur.com/uwkNGyQ",
        "created_utc": 1606823497,
        "id": "ge91puc",
        "score": 1,
        "subreddit": "investing",
        "created": 1606852297.0
    },
    {
        "author": "Daveywallnut",
        "body": "This idea has been discussed in depth and been in place for many months now, and I think that this late on you will risk jumping into an extremely volitle couple of weeks",
        "created_utc": 1606823591,
        "id": "ge91t8z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606852391.0
    },
    {
        "author": "Blkjpkmn",
        "body": "So long shot but like I'm getting married and $5,000 is literally life changing for me and chump change for you now soooo like... Merry Christmas???",
        "created_utc": 1606824523,
        "id": "ge92s6g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606853323.0
    },
    {
        "author": "Crooks00",
        "body": "There are 2 and a half hundreds right now. Like 90% of those get a target and that pushes them over 10, even a little. You dont have to invest in my imaginary etf then.",
        "created_utc": 1606823210,
        "id": "ge91fg6",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1606852010.0
    },
    {
        "author": "jloy88",
        "body": "All I am gonna say is this.  Be careful today.    This has weird tingle spider feels of a bull trap setup.    We had the weird market panic selloff yesterday almost everywhere to give everyone enticing positions and now a massive 9 inch green dildo futures to bring back the money.   Keep your fuckings eyes on VIX and dont over expose yourself by getting locked in on reckless PDT trades early.  be safe retards",
        "created_utc": 1606823247,
        "id": "ge91gq2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606852047.0
    },
    {
        "author": "PsychoSynthesizer",
        "body": "ZOOM earnings per share of 99 cents. Giving the shares a **p/e of 450!!!** That's 450 at arguably peak pandemic and as competition will only put further pressure on margins from now. Good company but utterly absurd share price....Do yourself a favour folks and **do not buy this dip**!",
        "created_utc": 1606824281,
        "id": "ge92iw9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606853081.0
    },
    {
        "author": "cuntnuzzler",
        "body": "&gt;Tnxp\n\ni am wondering why you think that? Its been relatively flat for a year now. Is there any news?",
        "created_utc": 1606824551,
        "id": "ge92t94",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1606853351.0
    },
    {
        "author": "gurglemonster",
        "body": "Because it isn't. There were some failed platforms (BitLending I think) but the only time crypto is lent out an interest payed is where it's the borrowed funds in a speculative bet by another party, in the case of Bitcoin always on a centralized exchange. \n\nNo rational individual borrows in crypto because it's like exposing themselves to the most insane currency risk ever. Literally 3 days ago you could buy a Bitcoin for 16,800 USD, now it's nearly 20,000. If you had traded that Bitcoin for services rendered for fiat, you'd have to find 20,000 to replace the borrowed Bitcoin, excluding any interest charges. \n\nThere is a reason that 10 years after Bitcoins inception, its market is still made of up almost entirely of speculation, those in the market for illegal goods and services and the outright insane that believe the world will end but somehow the internet and their Bitcoin / crypto will remain unaffected.",
        "created_utc": 1606823750,
        "id": "ge91z09",
        "score": 1,
        "subreddit": "investing",
        "created": 1606852550.0
    },
    {
        "author": "jager_mcjagerface",
        "body": "I didn't but i didn't get in march neither. If i would have i would be on the bahamas by now.",
        "created_utc": 1606823836,
        "id": "ge9227a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606852636.0
    },
    {
        "author": "123elvesarefake123",
        "body": "Filled my )probably) last position yesterday during the dip\n\nNow the hard way part begins\n\nPatience",
        "created_utc": 1606823850,
        "id": "ge922qj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606852650.0
    },
    {
        "author": "yxcd",
        "body": "They sold one unit to an university in hongKong?\n\nGive them 2 months and they will produces this in mass for like 10,50$ a piece. Take your revenue and leave this, this ship is sinking. It's a chinese product now.",
        "created_utc": 1606824643,
        "id": "ge92wrw",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1606853443.0
    },
    {
        "author": "darkMatterMatterz",
        "body": "What’s the best toilet paper in the market right now?",
        "created_utc": 1606823612,
        "id": "ge91u1o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606852412.0
    },
    {
        "author": "TOADSTOOL__SURPRISE",
        "body": "I mean I knew everything else about the company being a scam for months now, but embarrassingly I just put the name thing together yesterday lol",
        "created_utc": 1606824052,
        "id": "ge92ad8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606852852.0
    },
    {
        "author": "bagel_maker974",
        "body": "In reference to number 10 - 100% - if you are trying to be a successful investor and are not comfortable with staying away from the crowd and being confident; good luck.\n\nCNBC, Schwab, Martketwatch and all those \"buy ratings\" suddenly start making a WHOLE lot less sense when you've got the stocks story understood and *then* look outside for further info and see the conclusion others reached.\n\nThey either have no idea what they are talking about, or are basically trying to dump/prop the price so they can enter/exit.\n\nI just saw a big bank (JPM?) Recommending that NKLA is a clear buy now; because according to them, without the badger truck and now knowing the details of the lack-luster GM deal, NKLA can focus on their amazing truck technology and stop wasting their time on personal vehicles; because that was clearly their problem.\n\nStraight up fraudulent.",
        "created_utc": 1606824761,
        "id": "ge931g3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606853561.0
    },
    {
        "author": "postulate4",
        "body": "After the last shitty week of being red, aapl better be mooning now",
        "created_utc": 1606825914,
        "id": "ge94blv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606854714.0
    },
    {
        "author": "MackayBridgeTroll",
        "body": "Alright HEXO now run 400% so I can hop out at break even.",
        "created_utc": 1606825948,
        "id": "ge94cye",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1606854748.0
    },
    {
        "author": "caitsu",
        "body": "I knew it's Finland from the text, have to agree.\n\nAlso many seem to think that the inherent issues of euro and the EU have been resolved since we are now borrowing money together apparently.\n\nTruth is that this debt-sharing was sold to many as a \"one-time only fix\", and even now this is causing loud resentment. This will be tenfold when people realize that we will regularly be the target of extortion by the southern countries.",
        "created_utc": 1606826201,
        "id": "ge94nh9",
        "score": 1,
        "subreddit": "investing",
        "created": 1606855001.0
    },
    {
        "author": "Fantastic-Doubt4445",
        "body": "Oooffff AAPL lookin nice right now",
        "created_utc": 1606824914,
        "id": "ge937ey",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606853714.0
    }
]