[
    {
        "author": "DooberDrivah",
        "body": "You into adobe flash too?",
        "created_utc": 1581202572,
        "id": "fh0d2yb",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1581231372.0
    },
    {
        "author": "lilpenisboy",
        "body": "is it considered insider trading if I contract coronavirus and spread it to the adobe HQ by my house in order to make my puts print",
        "created_utc": 1582767175,
        "id": "fivsnv5",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1582795975.0
    },
    {
        "author": "Cristian888",
        "body": "Last Friday I invested 10k into apple, adobe, and netflix stocks and I'm up 100$ past couple days.\n\nHoly fuck that's boring!\n\nI need to get in on some options! Kinda scared tho, I have weak hands.",
        "created_utc": 1582147340,
        "id": "fi4s41i",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1582176140.0
    },
    {
        "author": "CarrollFilms",
        "body": "If you don't have calls in:\n\nAAPL, AMD, LULU, MSFT, ADBE, AMD, V, SPY, MA\n\nYou're retarded",
        "created_utc": 1581186020,
        "id": "fgyqu7b",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1581214820.0
    },
    {
        "author": "g____19",
        "body": "ADBE 👀",
        "created_utc": 1581620368,
        "id": "fhi9k0i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1581649168.0
    },
    {
        "author": "stiveooo",
        "body": "well 1st you may be entering in the worst time to start investing, better wait for q1 res sale\n\ngather cash\n\nthen buy apple, mastercard, microsoft, nvidia, amd, tesla, ansys, micron, adobe, adsk",
        "created_utc": 1581194288,
        "id": "fgzhwdl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1581223088.0
    },
    {
        "author": "4pooling",
        "body": "It's a fine way for a retiree to live off stocks that produce the 15% qualified dividend tax rate. \n\nJust my opinion: \n\nFocus on total return (capital appreciation + dividends) when analyzing stocks.\n\nThere are also funds geared towards dividend growth: NOBL, VIG, VIGI, DGRO, etc. \n\nAll the stocks/funds focused on high current dividend underperform the Market over time. Pull up any data and do back tests on portfoliovisualizer.com \n\nThat's why most investors stick with broad index funds that include both growth and value stocks. Think of VTSAX (VTI) and VFIAX (VOO), QQQ, DIA, etc. \n\nThere are many top earning companies whose stocks don't pay a dividend: FB, GOOG, AMZN, BRK.B, ADBE, etc.",
        "created_utc": 1581181378,
        "id": "fgyb15e",
        "score": 2,
        "subreddit": "investing",
        "created": 1581210178.0
    },
    {
        "author": "cyy-bg-bb",
        "body": "Throw out all the specs you want, the experience is still much better on a MacBook Pro. \n\nThe main reason I bought the ThinkPad is because of the specs. I mean, look at the GHz and SSD and cores and shit. \n\nBut it doesn’t matter cause Windows simply sucks. \n\nThe touchpad is horrible compared to my MAC, the ThinkPad struggles with simple zooming in and out, it’s hard as hell to multitask because of the choppy graphics despite having a better gpu and cpu and ssd. \n\nSpecs are useless imo unless you want to game or do stuff like editing. \n\nAs a lawyer I don’t do any of that I just use Microsoft word preview adobe pro dc outlook. Give me a 2013 MacBook Pro over a 2020 ThinkPad any day. \n\nMy company’s laptop is a ThinkPad but I’ve hated it so much I’m only using it as a backup lol. The MacBook Pro just works.",
        "created_utc": 1582569144,
        "id": "fins8me",
        "score": 2,
        "subreddit": "investing",
        "created": 1582597944.0
    },
    {
        "author": "WaitWhoIsWaldo",
        "body": "$ADBE 3/20 calls are gonna print",
        "created_utc": 1581724367,
        "id": "fhnbb73",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581753167.0
    },
    {
        "author": "TofuDawgg",
        "body": "ADBE 3/13 $420+ C don't ask questions just buy",
        "created_utc": 1582243508,
        "id": "fi8mg79",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1582272308.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "inherited 300k at 20. Cashed out all 180k for grad school and an apt. Had like...120k in 2016. Wife and I have put away a lot and gotten lucky on $ADBE over the years",
        "created_utc": 1581024404,
        "id": "fgqhq7h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581053204.0
    },
    {
        "author": "sofreshnsogreengreen",
        "body": "FDs unless you genuinely need a new laptop. i use my 2013 and 2015 13\" macbooks all time still. unless you're doing adobe cs work or similar don't upgrade too early and throw away money",
        "created_utc": 1581369342,
        "id": "fh8xf3w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581398142.0
    },
    {
        "author": "toomuchgoodstuff9",
        "body": "41% profit on ADBE, I take that",
        "created_utc": 1581610845,
        "id": "fhhsfph",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581639645.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "i have a big ADBE bagholder position",
        "created_utc": 1581724530,
        "id": "fhnbm14",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581753330.0
    },
    {
        "author": "smearballs",
        "body": "ADBE been my biggest winner for the last 7 years anyway.",
        "created_utc": 1581805906,
        "id": "fhqknyl",
        "score": 2,
        "subreddit": "investing",
        "created": 1581834706.0
    },
    {
        "author": "jonnydoo84",
        "body": "look at ADBE being a stupid bitch as always in the top corner not talking to anyone and just doing whatever the fuck it wants",
        "created_utc": 1582677925,
        "id": "fis515m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1582706725.0
    },
    {
        "author": "Meymo",
        "body": "Just a few...\n\nMSFT - Microsoft. Has an Operating System that’s Used by almost every corporation in the world. They have long term contracts with most of their clients too. \n\nNOW - ServiceNow. Sticky within mid-large organizations and has many long-term corporate clients. Solid growth and contracts continue to get renewed.\n\nADBE - Adobe. Needs no introduction. They have the leading tools for professionals in the industry and have moved to a SaaS model. Again, they have long term contracts with almost every Fortune 500 company, which means that they have a very long trajectory ahead of them.",
        "created_utc": 1580782818,
        "id": "fghe4z3",
        "score": 1,
        "subreddit": "investing",
        "created": 1580811618.0
    },
    {
        "author": "_jbird13",
        "body": "DOCU is the only company I’m remotely interested in from these - only because I think Microsoft or Adobe might buy them out. But, I agree with the other comments - buying little bits and pieces of a handful of companies is kind of a joke.",
        "created_utc": 1581113802,
        "id": "fgu5qxr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581142602.0
    },
    {
        "author": "smdwiftabz",
        "body": "- Amazon will be a 4 trillion dollar company (biggest in the world)\n- MSFT, AAPL, GOOGL will be at or near 3T market caps\n- Uber will be a massive global company with a $400 share price\n- Say goodbye to GameStop , it's this decades blockbuster\n- Weed is finally legalized in US: yay cannabis stocks\n- Intuitive Surgical will be worth 250 billion\n- Fintech (ma,v,sq,pypl) will be some of the decades best investments\n- Dis will continue to dominate the box office and become the world leader in streaming: dis+, Hulu, ESPN+, hotstar (india) \n- Microsoft or Adobe will buy DocuSign \n- telemedicine will change healthcare as we know it \n- and finally: Tesla will be a trillion dollar company \n\nMy bull case for my current portfolio ;)",
        "created_utc": 1581131896,
        "id": "fguxum3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581160696.0
    },
    {
        "author": "faithnoless",
        "body": "I hope your teacher gives you the option of investing in more than one stock!  If I had that sort of cash for real, I'd put $5 into each of 20 different stocks.  If this started a week ago and you chose Tesla, then you'd be a happy camper right now!  But I think it'll pull back quite a bit after some hype wears off.  Stocks that shoot up very high and very quick like that always pull back, sometimes a lot.\n\nThe only thing I don't like about this project is how investing shouldn't be boiled down to weeks, but I guess that's all the time you have to work with in a school.  So my advice:  if you do this for real when you're older, think about 8 YEARS instead of just weeks or months!\n\nStill reading, or getting bored yet?  Here are some picks:  Amazon, Mastercard or Visa, Shopify, The Trade Desk, Adobe, Cognex, MongoDB, Match Group, Okta, Stitch Fix, Square, Twilio, Zscaler, Zoom Video Communications, MercadoLibre, Wix, Roku, Nvidia, Netflix, Micron Technology.  Given your short time frame, some of these should give you a good boost during that time - unless the market has a bit of a correction, which it might because it's been \"hot\" lately.  Pick some, pick all, whatever your teacher lets you do.  Hope this helps!",
        "created_utc": 1580847556,
        "id": "fgjnaw6",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1580876356.0
    },
    {
        "author": "Blend_",
        "body": "S&amp;P 3.43% at least lezz goo baby!!!! but on the real that's just a side bet i made\n\nI'm short ADBE Small amount for fun Short TSLA hell yeah why not\n\nBullish S&amp;P and Bullish Dollar if anyone even cares about forex",
        "created_utc": 1580874634,
        "id": "fgkvlva",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580903434.0
    },
    {
        "author": "toomuchgoodstuff9",
        "body": "Ok ADBE...",
        "created_utc": 1580917537,
        "id": "fgm3w6n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580946337.0
    },
    {
        "author": "faithnoless",
        "body": "If you have a 30+ year time frame, then don't be worried about short-term news.  Buy several stocks at around $5K each, and let the winners ride as they emerge and cut any losers at around 15-20% and re-invest.  I'm not sure whether you prefer Canadian or U.S. holdings, but make sure good U.S. dividend payers are in your RRSP or you'll pay a withholding tax on the dividend if they're in your TFSA.  Buy companies that have no debt and strong cash positions.\n\nIf you doubt the power of stocks, your 4% gain in 5 years is compared to my 87% gain in less than 6 years, all U.S. stocks.  Not trying to brag, but trying to prove that at your age, you can afford to put your money into so-called \"higher risk.\"  (I don't think stocks like MA, V, PYPL, ADBE, AMZN, etc. are \"risky,\" but the Wall-Street pundits consider them to be just because they're stocks.)",
        "created_utc": 1580941225,
        "id": "fgnb7y4",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1580970025.0
    },
    {
        "author": "tinyraccoon",
        "body": "My stab on saas:\n\nBoth AWS and azure will be good, but I think aws will remain the leader.  I dont think googl or IBM can catch up.  \n\nI think there are too many analytics, cybersecurity,  and payroll softwares.  Some will be consolidated while others will go bust.  \n\nSplk looks solid in the big data analysis niche.\n\nAdbe is strong.\n\nCrm is good but will face increased competition from other paas.\n\nI dont like servicenow.  Singular product and team is catching up quickly with a cheaper product.  \n\nI can see googl focusing more on ai and big data than cloud infrastructure.  It might buy splk.",
        "created_utc": 1581205378,
        "id": "fh0md3o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581234178.0
    },
    {
        "author": "pnin22",
        "body": "Adbe is out of control. Needs to drop like 30% to bring valuation to normal level",
        "created_utc": 1582502083,
        "id": "fili2z2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582530883.0
    },
    {
        "author": "Cj716",
        "body": "Dad works for adobe, retired off adobe stocks mid 40s",
        "created_utc": 1582516248,
        "id": "fim2b6w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582545048.0
    },
    {
        "author": "darkoblivion000",
        "body": "Long ADBE",
        "created_utc": 1582518794,
        "id": "fim5koh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582547594.0
    },
    {
        "author": "Wowowiwa69",
        "body": "Lost $600 on adobe calls. Thanks for making me feel better lol.",
        "created_utc": 1582593595,
        "id": "fioxy1e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582622395.0
    },
    {
        "author": "Tommiahipp",
        "body": "Adobe?",
        "created_utc": 1582751289,
        "id": "fiuzx1p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582780089.0
    },
    {
        "author": "SharksFan1",
        "body": "MSFT\nADBE\nNEE\nAAXN\nSBUX\nV",
        "created_utc": 1582828913,
        "id": "fixygu5",
        "score": 1,
        "subreddit": "investing",
        "created": 1582857713.0
    },
    {
        "author": "techbro01",
        "body": "Amazing work of art lol. What tools do you use, Adobe Illustrator or something?",
        "created_utc": 1582812498,
        "id": "fix4l0w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582841298.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "?? no. From putting money away, and from bagholding ADBE from 118. Never bought a call on anything besides gold.",
        "created_utc": 1582852127,
        "id": "fiz1t56",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582880927.0
    },
    {
        "author": "Enigma_101",
        "body": "#My 🌈🐻 gang we are fucked. Everything is green. NVIDIA, Adobe, Apple, Uber, Slack, Microsoft. \n\n#Our SPY puts are fucked.",
        "created_utc": 1582908258,
        "id": "fj0v4qo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582937058.0
    },
    {
        "author": "shadybounce",
        "body": "Yea I heard him talk about it yesterday. But honestly I’ve been rocking Adobe calls for the past two months. Love Adobe ❤️",
        "created_utc": 1582896887,
        "id": "fj0d2cp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582925687.0
    },
    {
        "author": "Enigma_101",
        "body": "NVDA and ADBE",
        "created_utc": 1582902467,
        "id": "fj0l5h9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582931267.0
    },
    {
        "author": "Debeast44",
        "body": "I'm not sure about OP, but I've just been using Adobe Premiere Pro. He might have a better free way though not sure.",
        "created_utc": 1582348481,
        "id": "ficirvk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582377281.0
    },
    {
        "author": "Nikk2019",
        "body": "Sounds good to me...I’m mostly a dividend growth stock investor but did buy some Dropbox today and also have positions jn BABA, TSLA, and ADBE",
        "created_utc": 1582330248,
        "id": "fibu8ie",
        "score": 1,
        "subreddit": "stocks",
        "created": 1582359048.0
    },
    {
        "author": "lsuisgarbage",
        "body": "Adobes business model actually makes me jizz all over the place tbh with their monthly recurring revenue oh yeah fuck me adobe im going to $CRM",
        "created_utc": 1582444115,
        "id": "fije9vj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582472915.0
    },
    {
        "author": "PM_YOUR_VOLVO_TO_ME",
        "body": "So I'm actually on board the game streaming train and here's why. I know this will be a little long of a read for the fuck tards in the audience but bull with me here and hear me out.\n\nObviously internet connection speeds have been going up over time and in just 13 years we went from 3g slow as fuck networks to being on the rain slicked precipice of 5g mobile networks. AMD is making CPUs that are blowing the data center market away when it comes to performance, Nvidia is making the best GPUs money can buy and Intel is presumably doing something. \n\nGame streaming is GOING to become ubiquitous in the near future because consoles cost money and so do graphics cards. All the shit for Brains window lickers said the same fuckin thing about video streaming \n\n\"Bro, there's no way that will take off!\"\n\n\"Bro, blockbuster has the Lions share of the rental market, what the fuck is Netflix?\"\n\nGuess who won out? Netflix won out so fucking hard on their streaming service that they spun their DVD mail order rental business off into its own thing. Is that doing well? Sure, but does it matter? No.\n\nSo here's what is going to happen. Every single industry is moving towards the software as a service business model whether you like it or not and whether it's a good thing or not. Take a look at adobe for confirmation you literally cannot BUY a copy of Photoshop anymore other than legacy versions because of their SaaS model.\n\nNvidia was working on this project for 3 years and they've don't the math and if I know anything to be true, Asians are good at math. if this game streaming idea wasn't the most profitable avenue, they wouldn't have thrown down the gauntlet against google stadia. Nvidias GeForce now service is so good that they undercut stadias price point by $15 because that's how confident they are they will own this market. \n\nIf you're looking for short term gains, buy June $300 calls before it goes back up but don't discount the stock either because it's going to be jack hammering Google's asshole until it looks like hamburger meat in the near future. AMD and Nvidia are going to be good long term returns regardless.",
        "created_utc": 1582332711,
        "id": "fibxur0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582361511.0
    },
    {
        "author": "innatangle",
        "body": "If $ADBE was reasonable in their charges for Creative Suite like $MS is with O365, then they'd make a lot more sales. But they're not which means I wouldn't mind betting they'd be the most pirated software on the intermenetz.",
        "created_utc": 1581400279,
        "id": "fha8eed",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581429079.0
    },
    {
        "author": "rea736",
        "body": "I remember Adobe last quarter. They beat and lowered guidance. Everyone who had calls got F'd then literally a month later the stock was really low. Then they raised there guidance. Stock manipulation at its finest",
        "created_utc": 1581400318,
        "id": "fha8fxd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581429118.0
    },
    {
        "author": "Ridid",
        "body": "The play here is hoping they get acquired by Adobe",
        "created_utc": 1582027833,
        "id": "fi0648u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582056633.0
    },
    {
        "author": "shadybounce",
        "body": "Just made some nice tendies on Adobe this morning :) it’s a favorite of mine. But you’re right no one really talks about it and it only ever goes up.",
        "created_utc": 1582127516,
        "id": "fi3ttvh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582156316.0
    },
    {
        "author": "UrbanOutfisters",
        "body": "Real talk how come nobody talks about ADBE on here?",
        "created_utc": 1582127361,
        "id": "fi3tkpd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582156161.0
    },
    {
        "author": "housemusick",
        "body": "ADBE has been on fuckin fire",
        "created_utc": 1582131663,
        "id": "fi40tf9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582160463.0
    },
    {
        "author": "MemeologyPhd",
        "body": "What do you guys think about this run up in Adobe?",
        "created_utc": 1581931529,
        "id": "fhwuy3x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581960329.0
    },
    {
        "author": "PaPaPleb",
        "body": "I have expensive hobbies\n\n guitars, PC hardware, sim racing, vr, music software, (you think Adobe is expensive, check again) cars, artwork, shoes, filmmaking, headphones, I'm looking to get into speakers.\n\nOh and I'm only 20 years old. So if my money isn't working for me, then I'll be working for money for the rest of my life",
        "created_utc": 1581874911,
        "id": "fhtj8pc",
        "score": 1,
        "subreddit": "investing",
        "created": 1581903711.0
    },
    {
        "author": "WaitWhoIsWaldo",
        "body": "Thanks $ADBE for paying for my Grindr unlimited subscription this month",
        "created_utc": 1582131837,
        "id": "fi41425",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582160637.0
    },
    {
        "author": "seewickman69",
        "body": "I see a huge opportunity after todays drop to get in on pre ER Adobe 380c",
        "created_utc": 1582256294,
        "id": "fi95tub",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582285094.0
    },
    {
        "author": "jestlovetendies",
        "body": "No idea what to yolo into weeklys. Some ides \n\nAMD puts\nAAPL calls\nADBE calls\nROKu calls",
        "created_utc": 1582045423,
        "id": "fi0v67d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582074223.0
    },
    {
        "author": "PCPONFIRE",
        "body": "Adobe is solid but they're losing marketshare on their core product line. No one fucks with Photoshop any more, it's all Sketch and Figma in the design world. People are still subbed though because of old projects and the occasional .PSD from a client. That's going to continue to diminish as the years pass (like Flash, RIP). They need to innovate, and fast given they have a track record of stagnating product lines.",
        "created_utc": 1581618908,
        "id": "fhi6xzx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581647708.0
    },
    {
        "author": "faithnoless",
        "body": "&gt;faithnoless\n\nI sold my entire TFSA last summer to pay off most of my mortgage.  Now I'm rebuilding using the knowledge gained the first time.  They were all U.S. stocks before and will be U.S. stocks again (except SHOP).  My winners were SHOP, MA, PYPL, TTD, ADBE, FB, MTCH, OKTA, TWLO, ZS.  Most of these doubled, some multiplied in value.  SHOP went up 10x, MA went up 3.5x, MTCH, OKTA, and PYPL more than doubled.  I took small losses only in CGNX, MDB, SFIX, and SQ but I was more interested in drastically reducing my mortgage interest.  I now use that saved interest to re-invest into my TFSA.  Overall portfolio gain (winners minus losers) was 87% in less than 6 years.\n\nAMZN remains in my RRSP, currently up 5.5x.  I also immediately re-bought MA, PYPL, SHOP, and TTD last summer for my RRSP because those are the ones I couldn't live without owning.  Only PYPL is losing (by less than 1%) whereas SHOP is up 69% once again and MA up 20%.  BTW, each stock I sold is still on my watchlist for future re-purchase.\n\nThat's way more than I wanted to share, but I get really annoyed when people doubt me.\n\nThe point being that SHOP is a buy no matter what price it's currently at.  You need to look at the future prospects of a company, not just where it's currently at and ESPECIALLY NOT current share price.",
        "created_utc": 1581605285,
        "id": "fhhiz1y",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1581634085.0
    },
    {
        "author": "Nikk2019",
        "body": "Adobe, Alibaba, IBM...",
        "created_utc": 1581552460,
        "id": "fhfvrsj",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1581581260.0
    },
    {
        "author": "AAPL420",
        "body": "$ADBE free money",
        "created_utc": 1581699950,
        "id": "fhlexna",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581728750.0
    },
    {
        "author": "MaliciousLegroomMelo",
        "body": "Lots of stocks *are* being affected.  Travel, restaurants, entertainment, casinos, all are being slammed.  \n\nBut there's other things that are decoupled from China.  Why should Google care about cities being closed in China?   Adobe rents photoshop to people digitally.  Why would they be affected?\n\nAs for the stock market overall, the prevailing belief is the corona virus will be like other outbreaks and will be contained and won't look that bad in hindsight.  The contrarian view is it's too early to be sure, China always lies, and companies might not have taken the potential impacts that seriously.  For example, even if corona virus turns out to be mild, just having the public thinking negatively about travel and cruises and in person meetings, that can stunt various company earnings for the year, or if Apple runs out of ear buds, they can't make their numbers, and so on.",
        "created_utc": 1581705293,
        "id": "fhlvlzk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581734093.0
    },
    {
        "author": "WaitWhoIsWaldo",
        "body": "$ADBE 3/13 or 3/20 calls are tempting",
        "created_utc": 1581708953,
        "id": "fhm6ezv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581737753.0
    },
    {
        "author": "dvdmovie1",
        "body": "Well-run company, software and if you're a well-run Software as a Service/SaaS company in general (ADBE, PAYC, NOW, TEAM, AYX, etc etc etc etc) or one in an attractive vertical (VEEV, ANSS), you've done well over the last several years. SaaS names doing incredibly well this year - AYX up over 30% since January 1st. Even smaller companies in other countries - look at Nemetschek SE in Germany, up nearly 600% in the last 5 years.",
        "created_utc": 1581544913,
        "id": "fhfjyu1",
        "score": 1,
        "subreddit": "investing",
        "created": 1581573713.0
    },
    {
        "author": "Nikk2019",
        "body": "I mean...you can invest any way you like in whatever vehicle you choose, but to be tax efficient, I would not want bonds or high dividend yielding stocks in my taxable accounts.  I put those in my Roth.  I put stocks like BABA, Adobe, Amazon, Tesla, etc. in my brokerage because they have high growth potential and don’t pay dividends.  Or just a regular S&amp;P index that doesn’t pay much in dividend.",
        "created_utc": 1581608945,
        "id": "fhhp4h4",
        "score": 1,
        "subreddit": "investing",
        "created": 1581637745.0
    },
    {
        "author": "v270",
        "body": "Sketch isn't and Adobe product.",
        "created_utc": 1581455573,
        "id": "fhc3oy9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581484373.0
    },
    {
        "author": "faithnoless",
        "body": "E-commerce (AMZN, MELI, SHOP), cloud (AMZN, MSFT, ADBE), mobile payment processing (MA, PYPL, SQ), AI (do some online searching).",
        "created_utc": 1581464273,
        "id": "fhcjpx8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581493073.0
    },
    {
        "author": "TimAppleBurner",
        "body": "Once adobe consolidated it looks like it could go on a tear",
        "created_utc": 1581433052,
        "id": "fhb24g2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581461852.0
    },
    {
        "author": "faithnoless",
        "body": "From scratch, I would start with MA, TTD, SHOP, MELI, MDB with $2K in each.  After saving up more, I would buy the likes of AMZN, PYPL, ADBE, OKTA, SQ, TWLO, ZS.  However, this is just me; I'm not a certified investment advisor.  I only keep tabs on these stocks and get deliriously excited about their short-, intermediate-, AND long-term potential more than any others!  For the record, I get most of my stock recommendation advice from the Stock Advisor service of The Motley Fool, www.fool.com.",
        "created_utc": 1581443977,
        "id": "fhbk8fx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581472777.0
    },
    {
        "author": "flux8",
        "body": "&gt;So design should be based on what? One persons opinion?\n\nYes.  Or only a handful of people who work as a team.  You haven't heard the expression, \"too many chefs in the kitchen?\"\n\n&gt;Who decides how it SHOULD go? Epic uses data to determine the best workflow — fewest clicks, best outcomes in current practice, etc — and puts out a software designed with these workflows in mind. One person making this decision isn’t going to make a better end product. And the reality is that organizations will deviate no matter who gives the recommendation because people with credentials after their name feel the need to justify their education and salaries.\n\nData is useful for scientific exploration.  It is NOT useful in designing usability for software.  \n\n&gt;This is absolutely a problem. There aren’t enough qualified IT people in healthcare. Or really just in general. It’s getting better but there’s still a massive shortage.\n\nMore IT people isn't going to help the problem.  The problem is the fundamental model of Epic is not well-designed and depends far too much on healthcare workers who know what they need FOR THEIR JOB, but don't know what they need from Epic to get it done optimally.  \n\nLet me point out our example: I work at a rural hospital that has Epic courtesy of a larger academic hospital who we've teamed with.  So when they were first going to implement Epic, they asked us how we wanted our \"module\" to be built.  Our department consists of five people.  Two of us are MD's.  I'm the ONLY tech savvy person in the department.  Our staff is 3 people who are all women average age of 58.  The person who directs our workflow doesn't have a college degree.  Yet, they expected us to know how Epic, a software that we had no experience in, should build our module.  Then later, when we encountered problems or missing codes, or things we wanted to change, they either took forever to get done, or simply were ignored.  The IT team eventually got fed up with all of our requests and said that they couldn't do anything more for us because what we wanted wasn't \"critical\".   \n\n&amp;#x200B;\n\n&gt;The usability issues typically come from the local IT folks you mentioned above. But it’s not really fair to compare something like Epic to a basic iOS app. It’s more comparable to something like the adobe suite or audio editing software. Try jumping into photoshop and finding your way around with minimal training. It’s not easy.\n\nIt's absolutely fair.  Let's be clear about what healthcare IT software really is.  The fundamental need for healthcare IT software is to function as a tool to record and communicate information.  Healthcare is complicated.  The tool to record and communicate that information should not be.   You cannot compare this to Adobe Suite or Audio Editing.  Those kinds of software are meant to be used by professionals only and virtually all of them are tech savvy.  Healthcare IT software is used by a LOT of people, many if not most, are not tech savvy.  This includes the doctors and nurses.  It HAS to be usable by a lot of tech ignorant people.  \n\nHere's another example of the early days of our using Epic.  When I first started entering my reports, every once in awhile, the screen would seemingly hang.  Nothing I typed into the keyboard would do anything on the screen.  However, the mouse worked fine, and if I switched to another window, the keyboard would type just fine.  I had to logout of Epic and then back in to get it work again.  I told the IT people about it and they investigated.  A month went by and they still had no idea what was going on.  They couldn't replicate it, and neither could I.  But it happened sporadically.  Like at least twice a week. It didn't happen to anyone else.  FINALLY, one day I figured out what happened.  My keyboard has a backslash key above the Enter key that I was accidentally brushing when I was typing.  Apparently, doing this while in a report, it functions as some kind of \"escape\" key.  If you keep typing on the keyboard, nothing appears.  However, if you tap it again, it brings up a little window that shows everything you were typing while it was in \"escape\" mode.  The IT people had no idea why it was doing that nor what it was for.  There is NO indication on the screen that you've entered this mode, or what that little window is for after you type it in.  As far as I can tell, it's some developer's backdoor way of doing something to the system. \n\nBut that is a small example of all the little random unexplainable shit that happens in Epic.\n\nI haven't seen anything in Epic that couldn't done a LOT better.  The problem is that the fundamental model that Epic is built on is inadequate to accommodate the functionality that now is expected in healthcare IT systems.  But Epic is SO big and so widely used, that they will never start over from scratch.  \n\n&gt;Judy is that person. She’s not perfect but she’s already accomplished exactly what your asking of a healthcare professional.\n\nOkay, it's pretty clear that you work for Epic at this point.  Judy is NOT Steve Jobs.  Maybe she's a good company leader.  But she's certainly not a visionary.  I get frustrated with Epic not because it's not functional.   We certainly CAN get our jobs done by figuring out workarounds.  But there are so many examples of things that shouldn't need a workaround.  I get frustrated because being a tech savvy person, I KNOW that current day software is capable of so much more and has been for a long time.  Another example?  The search bar in Epic feels like it's there just because Google made it trendy.  I've tried searching for so many things.  It's pretty much useless.  If I have to learn how to use a search bar, it's already a failure.  \n\n&gt;No physician I talk to is happy with Epic or Cerner.\n\nThat’s anecdotal. Read reviews on HIMSS. Epic is the best reviewed enterprise EMR. Period. Most of the reviews are positive.\n\nIf you asked a society of software engineers back in the 80's how they liked Unix, the reviews would also be nearly universally positive.  If we just said that was good enough, we would have never gotten Windows or Mac OS.  \n\n&gt;I get where you’re coming from. I listen to physicians complain about Epic on a daily basis, but when I start to dig down into the issue, the overwhelming majority of the complaints aren’t BECAUSE of Epic. There’s something else that’s causing the issue. And when I ask if they have a better solution, most cannot actually produce any viable ideas. It’s all smoke. The average MD has an insane amount of hubris when it comes to other fields outside of theirs. Just because you have a shitload of medical training doesn’t mean you have any clue how to build software or run a multi-billion dollar enterprise. (Not singling you out personally, just again, the average MD)\n\nIt's not up to physicians to come up with the solution.  That's the whole point.  Just like food critics don't need to be world class chefs to be able to tell what's good food from bad food.    To be a leader in any field means presenting to the public what they never knew they needed.  I presume you are aware of the history of technology.  You shouldn't need me to explain this to you.",
        "created_utc": 1582310804,
        "id": "fiay9xx",
        "score": 1,
        "subreddit": "investing",
        "created": 1582339604.0
    },
    {
        "author": "Putin-Owns-the-GOP",
        "body": "My theory is that ADBE is Cornoavirus-proof. Most of revenue is from digital subscriptions, and they don't rely on deliverying products, and their subscribers use their products to work from home. If I expected a panic, and that ADBE will be fairly untouched by it in terms of revenue, what would the play be? Calls for right after earnings in March, or longer term?",
        "created_utc": 1582327376,
        "id": "fibpx6b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582356176.0
    },
    {
        "author": "Wowowiwa69",
        "body": "My $600 loss on Adobe calls feel better now. 😂",
        "created_utc": 1582593746,
        "id": "fioy66b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582622546.0
    },
    {
        "author": "lsuisgarbage",
        "body": "INTUIT is the gayest software ever. SALESFORCE and ADOBE software make me HARD",
        "created_utc": 1582443974,
        "id": "fije5ml",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582472774.0
    },
    {
        "author": "Nikk2019",
        "body": "Then buy high growth stocks like Tesla, BABA, ADBE, MSFT, but at least get some real growth potential that will be protected from taxation",
        "created_utc": 1582426253,
        "id": "fiit4eb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1582455053.0
    },
    {
        "author": "GypsyPunk",
        "body": "6/19 MSFT &amp; 3/13 ADBE are my biggest positions. The msft I have faith in.",
        "created_utc": 1582563233,
        "id": "finh339",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582592033.0
    },
    {
        "author": "Hites_05",
        "body": "I'm talking more like ADBE and NFLX, not SPCE.\nQQQ is a personal favorite, because if it gets assigned... Oh well, I got me some QQQ to write a call with.",
        "created_utc": 1582596877,
        "id": "fip2z5r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582625677.0
    },
    {
        "author": "GoodFuelMovin",
        "body": "Damn ADBE put on point",
        "created_utc": 1582597112,
        "id": "fip3ce6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582625912.0
    },
    {
        "author": "jonnydoo84",
        "body": "I hope this bullshit will bring ADBE down a bit, mother fucker doesn't know how to chill.",
        "created_utc": 1582515822,
        "id": "fim1qdi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582544622.0
    },
    {
        "author": "Hybridxx9018",
        "body": "I pulled out of, adbe and msft and switched over to Tesla. Tesla doesn’t seem to give a fuck about corona virus. \n\nI amrn and spce calls. \n\nI’m debating if I want to hold spce through earnings though.",
        "created_utc": 1582496513,
        "id": "fil9dms",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582525313.0
    },
    {
        "author": "Hutz_Lionel",
        "body": "I did the same.  There are some quality names that have come off their highs and I finally got around to picking them up.  \n\nAdobe being one of them although it’s not too off it’s highs.",
        "created_utc": 1582662452,
        "id": "firdr7k",
        "score": 1,
        "subreddit": "investing",
        "created": 1582691252.0
    },
    {
        "author": "jonnydoo84",
        "body": "yeah I want them and ADBE. ADBE has no chill tho.",
        "created_utc": 1582681102,
        "id": "fisagzg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582709902.0
    },
    {
        "author": "danomano65",
        "body": "Positions are linked near bottom. [Here is my current value.](https://imgur.com/a/mXVJEfz)\n\n[Value before Covid-19 sell off.](https://imgur.com/a/pAFKt9T) 🤷🏻‍♂️\n\nI have placed overnight calls:\n\n[1 MRNA $30 3/20](https://imgur.com/a/WY5ZGw7)\n\n[2 GILD $80 4/17](https://imgur.com/a/VlzxegG)\n\n+ 20 shares MRNA\n\n+ 5 shares GILD\n\nI have sell orders on other assets. Total for opening orders is $2084. \n[Currently burning alive on top of Adobe and SPCE calls.](https://imgur.com/a/EZr18Vi)\n\nYOLOing on the vaccine trials taking place.",
        "created_utc": 1582779042,
        "id": "fiw9ze2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582807842.0
    },
    {
        "author": "mw8912a",
        "body": "I am buying tsla ccl rcl and adbe puts and coming back to them when we retrace the entire “not qe” at around 2950.",
        "created_utc": 1582770998,
        "id": "fivylq1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582799798.0
    },
    {
        "author": "Phoenix_Force88",
        "body": "Honestly, prices are way too expensive still. End of 19 had retard strength \n\nLooking to invest at these levels:\n\nApple: 200$\nAMD: 20$\nMSFT: 130$\nADBE: 260$\nNVDA: 130$\n\nI will not pay a penny over those prices. Get it done bears",
        "created_utc": 1582881461,
        "id": "fizz8rj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582910261.0
    },
    {
        "author": "bb6733827c0a",
        "body": "I’ve tried Active Trader Pro a couple of times and in infuriating. It would take multiple seconds for an action to occur after clicking a button. I believe it’s build on Adobe Flex- wtf?",
        "created_utc": 1582980431,
        "id": "fj3e6y9",
        "score": 1,
        "subreddit": "options",
        "created": 1583009231.0
    },
    {
        "author": "shadybounce",
        "body": "Bought long calls Friday morning for Adobe/Apple/MSFT and a one year call for Disney. Was up 1400$ as of Friday EOD. Beer virus is contained. Let’s go ⬆️",
        "created_utc": 1582995103,
        "id": "fj3wy5x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583023903.0
    },
    {
        "author": "shadybounce",
        "body": "Too early to grab some April adobe calls?",
        "created_utc": 1582896662,
        "id": "fj0crzu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582925462.0
    },
    {
        "author": "-_somebody_-",
        "body": "I ran a few Shopify stores, my only success was in 2015 drop shipping those ‘hoverboards’ during that Holiday/ hoverboard peak meme season and actually made about 10k, I usually test something out on eBay first to get some sentiment but it’s kinda hard to find niche products, what kind of businesses / products were you dealing with?  \n\nSorry to pick your brain dude but even though with stuff like Shopify and some simple adobe design work / SEO, it’s easy to do a 1 man operation but it’s sucks when your 5 Shopify/other e-commerce designed stores are not really getting noticed and you’re just paying fees to keep the websites up or throwing money at AdWords",
        "created_utc": 1582317318,
        "id": "fib9gnt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582346118.0
    },
    {
        "author": "Salmon117",
        "body": "I’ve embraced it for the whole adobe suite, am I partially autist yet?",
        "created_utc": 1582355242,
        "id": "ficrrpu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582384042.0
    },
    {
        "author": "Zer033x",
        "body": "NVDA is on fire lately. Great earnings and lots of analyst upgrades.\n\nTTD will likely beat earnings next week, might make a run to mid 320s before earnings.\n\nPTON is near bottomed out, so probably only up from here til next earnings.\n\nROKU is pretty low despite a good beat on earnings and will likely rebound to high 130s low 140s in a week or two.\n\nBA is auto buy on calls in the 325-330 range or lower, so much bad news could only push it that low.\n\nDespite TSLA runup it's still a valid play on dips to 800s or lower, a lot of demand still.\n\nMSFT is awaiting Jedi contract decision so is likely range bound between 182-187 until then.\n\nXOP and other fuel/oil type stocks are at lows and consolidating, could be good medium/long term to play a bounce.\n\nOnce Coronavirus news dies down AAPL will be in 340s or higher due to a great earnings release that never really got realized in stock price.\n\nWYNN is a valid Coronavirus rebound play.\n\nAMD is a very strong stock right now. It's run up a lot lately but has strong support in mid 50s.\n\nSPCE is a meme stock but can make you rich or wipe you out. Keep bets small and potentially triple your money or more. Strangle could even work with how much it moves.\n\nCloud stocks and software are actually pretty resilient right now and if Coronavirus news spreads could be considered safe haven. Things like CRM TWLO OKTA MSFT NOW ADBE MDB.\n\nI don't trust LK or its current rebound.\n\nVideo game stocks are stable right now, EA and ATVI, but not high risers. Will likely stay range bound or rise slowly until next earnings. Could be good swing trades due to consistency.\n\nDIS continues to drift lower. This isn't anything new. DIS is a boring stock until it isn't, and jumps 20% in a day then starts its long drift lower again.\n\n\n\nI think that's all I got for now.",
        "created_utc": 1582260452,
        "id": "fi9bbsl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582289252.0
    },
    {
        "author": "somedude420420420",
        "body": "ADSK, they are turning all their shrink wrap into saas . When those ARR numbers dtsrt hitting the books it’ll go ADBE on you. There’s real competitors either - the construction and eng worlds run on autocad",
        "created_utc": 1580804732,
        "id": "fgi47cm",
        "score": 1,
        "subreddit": "investing",
        "created": 1580833532.0
    },
    {
        "author": "Helt3",
        "body": "22 years old, relatively new to this \n\nNFLX - 45%\n\nADBE - 20%\n\nAAPL - 10%\n\nEXAS - 10%\n\nUAA - 5%\n\nThoughts??",
        "created_utc": 1580835164,
        "id": "fgj1g9w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580863964.0
    },
    {
        "author": "fresh_ny",
        "body": "ADBE. It’s a winner because no one really understands its data business",
        "created_utc": 1580864541,
        "id": "fgkfsg2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580893341.0
    },
    {
        "author": "DifficultCharacter",
        "body": "Well, I believe there is a market for software on subscription (Adobe shows that) and also entertainment on subscription (Netflix, HBO Go, Dis+). I hope to believe that AdTech is dead, but that might be more driven by the desire to not live in a state of constant supervision and tracking.",
        "created_utc": 1580607401,
        "id": "fg820dc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580636201.0
    },
    {
        "author": "tegridy66",
        "body": "I know Apple had a few, Adobe had a big amount sold yesterday, msft.",
        "created_utc": 1581012159,
        "id": "fgpubyg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581040959.0
    },
    {
        "author": "OzymandiasLP",
        "body": "Looks as legit as u/WSBgod’s screenshots... I’m all in ADBE calls!",
        "created_utc": 1581035095,
        "id": "fgqzww9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581063895.0
    },
    {
        "author": "filmillr",
        "body": "If ya got the capital - TSLA \n\nMSFT is also good\n\nNo one really talks about it much but ADBE is very consistent but you’ll need to hold for a week or so before taking profit as it’s a slow mover",
        "created_utc": 1580867555,
        "id": "fgkkbhk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580896355.0
    },
    {
        "author": "Nikk2019",
        "body": "IBM, Boeing, Wells Fargo, Abbvie, Microsoft.  And Adobe and BABA are fairly valued with tons of growth ahead.  But, listen...it could take years, not months for some of these to recover.  You’ve probably only seen the stock market go up if you’re young because we’ve been in the longest bull run in history.  That’s not normal.  Stocks don’t always go up so it is not a good place to put money you’ll need in a year.  That’s just gambling.  5 years minimum is a general rule of thumb.  If you can afford to lose it, then go ahead.  You buy when others are fearful.  These stocks are undervalued because of bad news, or something outside of their business fundamentals and model.  Microsoft sat for almost 20 years completely flat.  It is only now taking off. Anyone who invested in them right before it dipped had to wait 2 decades to just break even.",
        "created_utc": 1581264758,
        "id": "fh34pek",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581293558.0
    },
    {
        "author": "SachsPanther",
        "body": "Honestly I’m not sure and I’m surprised that it’s rallied so hard. I still use Adobe software but many of my peers dont and Photoshop in particular has more competition than ever. Especially from Procreate.",
        "created_utc": 1581932738,
        "id": "fhwvrad",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581961538.0
    },
    {
        "author": "ThePiercoost",
        "body": "I am currently playing SDC, CCL, RCL, SBUX (dropped last two weeks), XOM, and a ford leap. Also have a couple contracts in ADBE but that doesnt abide by my sheet which is why i made a separate account for posting gains",
        "created_utc": 1581988737,
        "id": "fhz1jh0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582017537.0
    },
    {
        "author": "Jordykins850",
        "body": "Oracle or IBM are probably the tastiest snacks out there.. but neither would pass Johnny Law.\n\nI’d also toss Adobe in there.",
        "created_utc": 1581978275,
        "id": "fhylbgk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582007075.0
    },
    {
        "author": "urvik08",
        "body": "Curious question: Are you long ADBE? If yes, what's your thesis behind it? Frankly i don't quite understand their past 3-4 months of continuous rise. Been tracking it from 270 and it's just going straight up, line looks like it has been drawn with a ruler.",
        "created_utc": 1581992904,
        "id": "fhz7wfr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582021704.0
    },
    {
        "author": "IS_JOKE_COMRADE",
        "body": "The discord meme thread says ADBE",
        "created_utc": 1581970105,
        "id": "fhy7bvm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581998905.0
    },
    {
        "author": "wsb-narrator",
        "body": "Fuck adbe. Bring back one-payment products.",
        "created_utc": 1582044559,
        "id": "fi0tois",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582073359.0
    },
    {
        "author": "Zackdw",
        "body": "90% sure it’s adobe after effects.",
        "created_utc": 1581696001,
        "id": "fhl6ed1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581724801.0
    },
    {
        "author": "ee_stu",
        "body": "You can already run apps with split-screen in native Android and iPadOS (2-3 apps in one screen).  But the usage case you mentioned is probably already solved with iPad Pros.\n\nIn the context of iPadOS, which is just a variation of iOS, there's a lot of apps that support split-screen, take advantage of the bigger screen and keyboard optimized. \n\nThis is due to the fact that the iPads continue to sell very well, and we see a huge demand for iPad Pros for light professional use cases such as word, emails, excel documentation, note-taking and digital art. Many people who buys MacBooks just for simple things can bring all their use cases on to the iPad Pros.  \nBecause of these market demands and powerful hardware of the iPad Pros, you see more optimized apps such as Adobe with full flagship photoshop and lightroom popping up.   \n\nIn the context of Android, because no one buys android tablets anymore, there's no point in optimizing specifically for tablet or split-screen usage. Even though the OS supports split-screen, for the size of the phone you can't really take advantage of the extra productivity.\n\nNow with the new wave of Android phones that supports foldable or multiple screens that can act essentially as a tablet. if they sell well and people want it, you will see more Android apps that optimize for split or multi-screens.  \n\nBut right now no, I doubt any apps will even use the Android official APIs to optimize for multi-screen let alone with the Microsoft Surface Duo SDK unless they partnered with Microsoft. Most developers will start optimizing when they see more market share of these kinds of devices.",
        "created_utc": 1581748031,
        "id": "fhoaygn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581776831.0
    },
    {
        "author": "PrognosticatorofLife",
        "body": "Needs more Adobe.",
        "created_utc": 1581691619,
        "id": "fhkut7f",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581720419.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 13th of February\n\n\n\n## Upcoming events for Thursday, February 13th\n\n - Expected earnings:\n\n  ACB, ACOR, ACST, AEG, AEM, AER, AGIO, AGTC, AIG, AIMC, AIRI, AKG, ALE, ALKS, ALYA, AMAG, AMN, ANET, APRE, ARES, ARI, ARR, AUY, AYR, AYTU, AYX, BABA, BAX, BBIO, BCS, BFAM, BIO, BKI, BL, BPMC, BRG, BWA, CARG, CBB, CC, CCEP, CERC, CGNX, CRY, CS, CTT, CTXR, CXP, CZNC, DAN, DAVA, DDOG, DLPH, DLR, DUK, DXCM, EEX, EPIX, EQM, ETRN, EVLO, EXPE, FAF, FIS, FNF, FORR, FTS, FULC, GDDY, GLOB, GNCA, GNRC, GTLS, HE, HII, HIMX, HTA, HUN, ICL, IGMS, IMAC, INCY, IPGP, IRM, IRWD, JRSH, KELYA, KHC, KPTI, KRTX, KTB, LBTYA, LECO, LH, LIN, LLEX, LOGM, LPSN, MAT, MERC, MFG, MHK, MR, MRC, MTRN, NBEV, NBSE, NEPT, NET, NEXA, NGD, NICE, NKSH, NMRK, NVDA, NVMI, OMN, ONVO, OTLK, PATK, PBF, PBFX, PDFS, PDS, PEP, PLSE, POOL, PROF, PZG, R, RARE, RDCM, REPL, ROKU, RSG, RWT, SAFE, SAND, SCPL, SCU, SEEL, SHIP, SITC, SMP, SNN, SON, SPSC, SPXC, SRTS, SSTK, SVMK, SWAV, SWIR, TEX, THS, TLND, TNET, TPCO, TPX, TRP, TRUP, TRVI, TRWH, TU, TUFN, UROV, VECO, VIE, WEX, WH, WM, WRE, WRTC, WSO, WST, XCUR, XFOR, YCBD, YELP, YETI, ZBRA, ZTS\n\n - Ex-div:\n\n  ABC, ADS, ADX, AFT, AGCO, AGN, AHC, AIF, AIT, AIV, ALE, AMGN, AMP, APAM, ARR, AVK, AWR, BA, BAF, BAH, BBF, BBK, BBN, BCX, BDJ, BFK, BFO, BFST, BFY, BFZ, BG, BGIO, BGR, BGT, BGY, BHK, BHLB, BHV, BIT, BKH, BKK, BLE, BLW, BME, BNY, BOE, BP, BQH, BRKL, BSD, BSE, BSET, BSM, BST, BSTZ, BTA, BTT, BTZ, BUI, BWFG, BYM, BZM, CCD, CF, CGO, CHD, CHI, CHW, CII, CLCT, COP, CORR, CPZ, CSQ, DCI, DRE, DUK, EBMT, EDF, EDI, EGF, EMR, ENB, EQT, EVA, FBK, FCCY, FCFS, FDEF, FINS, FMO, FNHC, FRA, FRBA, FSB, GBAB, GCBC, GEO, GGM, GHY, GOF, GRC, GWRS, HA, HTH, HTLF, HXL, HYT, IHIT, INN, ISD, JBL, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LEO, LLY, LNN, LSTR, MCA, MEN, MHD, MMD, MMM, MMS, MNE, MOG.A, MOG.B, MSBI, MSEX, MSVB, MTX, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NXST, NYV, NZF, OBNK, ODC, OPP, OPY, OSK, OTTR, OXLC, OXSQ, PBI, PCSB, PEO, PER, PFS, PFSI, PGZ, PKOH, PSMT, PSTL, PZN, RBA, RDS.A, RDS.B, RIV, RMI, RMM, RSF, SAL, SALT, SBRA, SCHW, SIGI, SJM, SJR, SMBC, SMP, SONA, SPG, SRF, SRV, SSBI, SZC, TAIT, TCF, TECH, TFC, TSBK, UTL, UTX, V, VBF, VTA, VVR, WAL, WEC, WRK, WTRG, XEC, YUM\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.341%)\n    - 4-Week Bill Auction (previous: 1.540%)\n    - 8-Week Bill Auction (previous: 1.550%)\n    - CPI (consensus: 0.2%, previous: 0.2%)\n    - CPI (consensus: 2.4%, previous: 2.3%)\n    - CPI Index, n.s.a. (consensus: 257.86, previous: 256.97)\n    - CPI Index, s.a (previous: 258.44)\n    - CPI, n.s.a (previous: -0.09%)\n    - Cleveland CPI (previous: 0.2%)\n    - Continuing Jobless Claims (consensus: 1,745K, previous: 1,751K)\n    - Core CPI (consensus: 0.2%, previous: 0.1%)\n    - Core CPI (consensus: 2.2%, previous: 2.3%)\n    - Core CPI Index (previous: 265.83)\n    - Initial Jobless Claims (consensus: 210K, previous: 202K)\n    - Jobless Claims 4-Week Avg. (previous: 211.75K)\n    - Natural Gas Storage (previous: -137B)\n    - Real Earnings (consensus: 0.1%, previous: -0.1%)\n\n## Upcoming events for Friday, February 14th\n\n - Stock splits:\n\n    - PKBK @ **110:100** (Payable date: 03/03/2020)\n\n - Expected earnings:\n\n  ABR, AL, AXL, AZN, BBX, BLX, CGC, CYOU, ENB, ESNT, GNLN, HDB, IMGN, INMB, MGP, NWL, PIXY, POR, PPL, PVL, RWLK, SOGO, SOHU, SPR, SXT, TRTN, YNDX\n\n - Ex-div:\n\n  ALK, AUDC, CABO, CADE, CE, CG, CHCT, COTY, CTSH, CURO, CVX, DHT, DLX, ECT, EGIF, ENBL, FDBC, FTS, GIM, GLOP, HBI, HIW, JHG, KMPR, LAZ, LPX, LYTS, MC, MNR, MUR, NATI, PCF, PEAK, PFLT, PROV, PRU, PSX, PTMN, R, ROK, SBR, SO, SPB, STK, SWX, SXC, TEI, TSLF, UI, UMH, VCIF, WMK, WWD\n\n - Economic events and announcements:\n\n    - Business Inventories (consensus: 0.1%, previous: -0.2%)\n    - CFTC Aluminium speculative net positions (previous: -58.9K)\n    - CFTC Copper speculative net positions (previous: -14.4K)\n    - CFTC Corn speculative net positions (previous: 73.4K)\n    - CFTC Crude Oil speculative net positions (previous: 461.8K)\n    - CFTC Gold speculative net positions (previous: 330.1K)\n    - CFTC Nasdaq 100 speculative positions (previous: 24.4K)\n    - CFTC Natural Gas speculative net positions (previous: -261.5K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 16.8K)\n    - CFTC Silver speculative net positions (previous: 63.4K)\n    - CFTC Soybeans speculative net positions (previous: -6.3K)\n    - CFTC Wheat speculative net positions (previous: 41.1K)\n    - Capacity Utilization Rate (consensus: 76.8%, previous: 77.0%)\n    - Core Retail Sales (consensus: 0.3%, previous: 0.7%)\n    - Export Price Index (consensus: 0.2%, previous: -0.2%)\n    - Export Price Index (previous: -0.7%)\n    - FOMC Member Mester Speaks\n    - Import Price Index (consensus: -0.2%, previous: 0.3%)\n    - Import Price Index (previous: 0.5%)\n    - Industrial Production (consensus: -0.2%, previous: -0.3%)\n    - Industrial Production (previous: -1.01%)\n    - Manufacturing Production (consensus: -0.2%, previous: 0.2%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.50%)\n    - Michigan Consumer Expectations (consensus: 89.0, previous: 90.5)\n    - Michigan Consumer Sentiment (consensus: 99.3, previous: 99.8)\n    - Michigan Current Conditions (consensus: 115.0, previous: 114.4)\n    - Michigan Inflation Expectations (previous: 2.5%)\n    - Retail Control (consensus: 0.3%, previous: 0.5%)\n    - Retail Inventories Ex Auto (previous: -0.2%)\n    - Retail Sales (consensus: 0.3%, previous: 0.3%)\n    - Retail Sales (previous: 5.82%)\n    - Retail Sales Ex Gas/Autos (previous: 0.5%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 676)\n    - U.S. Baker Hughes Total Rig Count (previous: 790)\n\n^^^^2020-02-13",
        "created_utc": 1581591612,
        "id": "fhh356l",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1581620412.0
    },
    {
        "author": "cloudneb",
        "body": "Think ANET will dump like last Er?",
        "created_utc": 1581510090,
        "id": "fhe0rvj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581538890.0
    },
    {
        "author": "cron_tab",
        "body": "I think ANET could move quite a bit in either direction.",
        "created_utc": 1581267207,
        "id": "fh3bu44",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581296007.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 12th of February\n\n\n\n## Upcoming events for Wednesday, February 12th\n\n - Stock splits:\n\n    - FIRZF @ **1:10**\n    - CNRMF @ **1:2**\n    - NVIV @ **1:30**\n\n - Expected earnings:\n\n  AB, ACEL, AEL, AKR, AM, AMAT, ANDE, APLT, AR, ARCC, ASGN, ATOM, ATUS, AVLR, BG, BLBD, BRKR, BSGM, CDNS, CF, CHEF, CHNG, CIDM, CIGI, CIM, CME, CODX, COHU, COWN, CPA, CRWS, CSCO, CSTE, CTL, CTRE, CVE, CVS, CX, CXW, CYBR, CYRN, DISH, DMAC, DSSI, DYAI, DYNT, ECOM, EDRY, EFC, EFX, EQC, EQIX, EQX, FCPT, FET, FGBI, FOSL, FR, FTSI, GEO, GOLD, GOOD, GPN, HR, HUBS, IBN, IDYA, IFF, IPG, IQV, IRT, JHX, JMP, KAI, KALA, KGC, KLDO, KMDA, LAD, LPI, LPL, LTRX, MCHX, MCO, MFC, MGM, MIRM, MIST, MNOV, MRO, NBL, NBLX, NESR, NLY, NPO, NSIT, NTAP, NTB, NTWK, NUS, NWE, OIS, OSW, PEGA, PERI, PGRE, PROS, PRSP, PRTA, PRTH, PS, PSNL, PSTI, PTSI, QDEL, QLYS, QUIK, QUOT, RDFN, RDWR, REG, RLMD, RUSHA, RYAM, SHOP, SLF, SLGG, SONM, SPWR, SSNC, STAG, TAP, TCX, TEVA, TGE, TMDI, TMDX, TRIP, TRMB, TRNO, TRVG, TTGT, TW, TYL, UE, VCTR, VERU, VNDA, VXRT, WCN, WELL, WNC\n\n - Ex-div:\n\n  ACV, ADM, AIO, AMG, ARMK, BSIG, CBH, DBL, DSE, DSL, EFL, EHT, ELY, ETR, EVF, GDV, GNT, GUT, HPF, HPI, HPS, HTD, IVH, IVZ, NCV, NCZ, OMP, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RMD, SIMO, STBA, TBNK, TJX, VGI, ZION, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.869%)\n    - Crude Oil Imports (previous: 0.051M)\n    - Crude Oil Inventories (consensus: 2.987M, previous: 3.355M)\n    - Cushing Crude Oil Inventories (previous: 1.068M)\n    - Distillate Fuel Production (previous: -0.003M)\n    - EIA Refinery Crude Runs  (previous: 0.048M)\n    - EIA Weekly Distillates Stocks (consensus: -0.557M, previous: -1.512M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.4%, previous: 0.2%)\n    - FOMC Member Harker Speaks\n    - Fed Chair Powell Testifies\n    - Federal Budget Balance (consensus: -11.5B, previous: -13.3B)\n    - Gasoline Inventories (consensus: 0.546M, previous: -0.091M)\n    - Gasoline Production (previous: 0.745M)\n    - Heating Oil Stockpiles (previous: -0.014M)\n    - MBA 30-Year Mortgage Rate (previous: 3.71%)\n    - MBA Mortgage Applications (previous: 5.0%)\n    - MBA Purchase Index (previous: 283.8)\n    - Mortgage Market Index (previous: 682.0)\n    - Mortgage Refinance Index (previous: 2,975.7)\n    - OPEC Monthly Report\n    - Thomson Reuters IPSOS PCSI (previous: 63.42)\n\n## Upcoming events for Thursday, February 13th\n\n - Expected earnings:\n\n  ACOR, ACST, AEG, AEM, AER, AGIO, AGTC, AIG, AIMC, AIRI, AKG, ALE, ALKS, ALYA, AMAG, AMN, ANET, APRE, ARES, ARI, ARR, AUY, AYR, AYTU, AYX, BABA, BAX, BBIO, BCS, BFAM, BIO, BKI, BL, BPMC, BRG, BWA, CARG, CBB, CC, CCEP, CERC, CGNX, CRY, CS, CTT, CTXR, CXP, CZNC, DAN, DAVA, DDOG, DLPH, DLR, DUK, DXCM, EEX, EPIX, EQM, ETRN, EVLO, EXPE, FAF, FIS, FNF, FORR, FTS, FULC, GDDY, GLOB, GNCA, GNRC, GTLS, HE, HII, HIMX, HTA, HUN, ICL, IGMS, IMAC, INCY, IPGP, IRM, IRWD, JRSH, KELYA, KHC, KPTI, KRTX, KTB, KTOV, LBTYA, LECO, LH, LIN, LLEX, LOGM, LPSN, MANU, MAT, MERC, MFG, MHK, MR, MRC, MTRN, NBEV, NBSE, NEPT, NET, NEXA, NGD, NICE, NKSH, NMRK, NVDA, NVMI, OMN, ONVO, OTLK, PATK, PBF, PBFX, PDFS, PDS, PEP, PLSE, POOL, PROF, PZG, R, RARE, RDCM, REPL, ROKU, RSG, RWT, SAFE, SAND, SCPL, SCU, SEEL, SITC, SMP, SNN, SON, SPSC, SPXC, SRTS, SSTK, SVMK, SWAV, SWIR, TEX, THS, TLND, TNET, TPCO, TPX, TRP, TRUP, TRVI, TRWH, TU, TUFN, UROV, VECO, VIE, WEX, WH, WM, WRE, WRTC, WSO, WST, XCUR, XFOR, YCBD, YELP, YETI, ZBRA, ZTS\n\n - Ex-div:\n\n  ABC, ADS, ADX, AFT, AGCO, AGN, AHC, AIF, AIT, AIV, ALE, AMGN, AMP, APAM, ARR, AVK, AWR, BA, BAF, BAH, BBF, BBK, BBN, BCX, BDJ, BFK, BFO, BFST, BFY, BFZ, BG, BGIO, BGR, BGT, BGY, BHK, BHLB, BHV, BIT, BKH, BKK, BLE, BLW, BME, BNY, BOE, BP, BQH, BRKL, BSD, BSE, BSET, BSM, BST, BSTZ, BTA, BTT, BTZ, BUI, BWFG, BYM, BZM, CCD, CF, CGO, CHD, CHI, CHW, CII, CLCT, COP, CORR, CPZ, CSQ, DCI, DRE, DUK, EBMT, EDF, EDI, EGF, EMR, ENB, EQT, EVA, FBK, FCCY, FCFS, FDEF, FINS, FMO, FNHC, FRA, FRBA, FSB, GBAB, GCBC, GEO, GGM, GHY, GOF, GRC, GWRS, HA, HTH, HTLF, HXL, HYT, IHIT, INN, ISD, JBL, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LEO, LLY, LNN, LSTR, MCA, MEN, MHD, MMD, MMM, MMS, MNE, MOG.A, MOG.B, MSBI, MSEX, MSVB, MTX, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NXST, NYV, NZF, OBNK, ODC, OPP, OPY, OSK, OTTR, OXLC, OXSQ, PBI, PCSB, PEO, PER, PFS, PFSI, PGZ, PKOH, PSMT, PSTL, PZN, RBA, RDS.A, RDS.B, RIV, RMI, RMM, RSF, SAL, SALT, SBRA, SCHW, SIGI, SJM, SJR, SMBC, SMP, SONA, SPG, SRF, SRV, SSBI, SZC, TAIT, TCF, TECH, TFC, TSBK, UTL, UTX, V, VBF, VTA, VVR, WAL, WEC, WRK, WTRG, XEC, YUM\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.341%)\n    - 4-Week Bill Auction (previous: 1.540%)\n    - 8-Week Bill Auction (previous: 1.550%)\n    - CPI (consensus: 0.2%, previous: 0.2%)\n    - CPI (consensus: 2.4%, previous: 2.3%)\n    - CPI Index, n.s.a. (consensus: 257.86, previous: 256.97)\n    - CPI Index, s.a (previous: 258.44)\n    - CPI, n.s.a (previous: -0.09%)\n    - Cleveland CPI (previous: 0.2%)\n    - Continuing Jobless Claims (consensus: 1,745K, previous: 1,751K)\n    - Core CPI (consensus: 0.2%, previous: 0.1%)\n    - Core CPI (consensus: 2.2%, previous: 2.3%)\n    - Core CPI Index (previous: 265.83)\n    - Initial Jobless Claims (consensus: 210K, previous: 202K)\n    - Jobless Claims 4-Week Avg. (previous: 211.75K)\n    - Natural Gas Storage (previous: -137B)\n    - Real Earnings (consensus: 0.1%, previous: -0.1%)\n\n## Upcoming events for Friday, February 14th\n\n - Stock splits:\n\n    - PKBK @ **110:100** (Payable date: 03/03/2020)\n\n - Expected earnings:\n\n  ABR, AL, AXL, AZN, BBX, BLX, CGC, CYOU, ENB, ESNT, GNLN, HDB, IMGN, INMB, MGP, NWL, PIXY, POR, PPL, PVL, RWLK, SOGO, SOHU, SPR, SXT, TRTN, YNDX\n\n - Ex-div:\n\n  ALK, AUDC, CABO, CADE, CE, CG, CHCT, COTY, CTSH, CURO, CVX, DHT, DLX, ECT, ENBL, FDBC, FTS, GIM, GLOP, HBI, HIW, JHG, KMPR, LAZ, LPX, LYTS, MC, MNR, MUR, NATI, PCF, PEAK, PFLT, PROV, PRU, PSX, PTMN, R, ROK, SBR, SO, SPB, STK, SWX, SXC, TEI, TSLF, UI, UMH, VCIF, WMK, WWD\n\n - Economic events and announcements:\n\n    - Business Inventories (consensus: 0.1%, previous: -0.2%)\n    - CFTC Aluminium speculative net positions (previous: -58.9K)\n    - CFTC Copper speculative net positions (previous: -14.4K)\n    - CFTC Corn speculative net positions (previous: 73.4K)\n    - CFTC Crude Oil speculative net positions (previous: 461.8K)\n    - CFTC Gold speculative net positions (previous: 330.1K)\n    - CFTC Nasdaq 100 speculative positions (previous: 24.4K)\n    - CFTC Natural Gas speculative net positions (previous: -261.5K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 16.8K)\n    - CFTC Silver speculative net positions (previous: 63.4K)\n    - CFTC Soybeans speculative net positions (previous: -6.3K)\n    - CFTC Wheat speculative net positions (previous: 41.1K)\n    - Capacity Utilization Rate (consensus: 76.8%, previous: 77.0%)\n    - Core Retail Sales (consensus: 0.3%, previous: 0.7%)\n    - Export Price Index (consensus: -0.1%, previous: -0.2%)\n    - Export Price Index (previous: -0.7%)\n    - FOMC Member Mester Speaks\n    - Import Price Index (consensus: -0.2%, previous: 0.3%)\n    - Import Price Index (previous: 0.5%)\n    - Industrial Production (consensus: -0.2%, previous: -0.3%)\n    - Industrial Production (previous: -1.01%)\n    - Manufacturing Production (consensus: -0.1%, previous: 0.2%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.50%)\n    - Michigan Consumer Expectations (consensus: 90.3, previous: 90.5)\n    - Michigan Consumer Sentiment (consensus: 99.5, previous: 99.8)\n    - Michigan Current Conditions (consensus: 115.0, previous: 114.4)\n    - Michigan Inflation Expectations (previous: 2.5%)\n    - Retail Control (consensus: 0.3%, previous: 0.5%)\n    - Retail Inventories Ex Auto (previous: -0.2%)\n    - Retail Sales (consensus: 0.3%, previous: 0.3%)\n    - Retail Sales (previous: 5.82%)\n    - Retail Sales Ex Gas/Autos (previous: 0.5%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 676)\n    - U.S. Baker Hughes Total Rig Count (previous: 790)\n\n^^^^2020-02-12",
        "created_utc": 1581505212,
        "id": "fhdwj8m",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1581534012.0
    },
    {
        "author": "techguru830",
        "body": "Juniper is a terrible alternative for just about anything.  Fortinet and Palo Alto Networks are the best competitors when asking about Cisco competition in the network/ Security space (look at their stock performance as well).\n\nI think Arista has some very good use cases where it makes the most sense, but I'm not sure if there are enough of those use cases to drive up a stock price.",
        "created_utc": 1581602945,
        "id": "fhhfhw3",
        "score": 1,
        "subreddit": "investing",
        "created": 1581631745.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 10th of February\n\n\n\n## Upcoming events for Monday, February 10th\n\n - Expected earnings:\n\n  ACB, AEMD, AGN, AIN, AMKR, APPS, ARGO, AVYA, BHF, BIP, BLKB, BRX, BYND, CHGG, CMBM, CMP, CNA, CRNT, CSTL, DMPI, DO, DVA, ELVT, ELY, EPC, ESSA, FLDM, FRT, GBDC, GFN, GNSS, GO, GPP, GPRE, ICMB, IIIV, IIVI, ITUB, IVC, JCOM, JE, KMPR, L, LMNX, MCC, MCY, MELI, MESA, MGI, MIME, MLAB, MOH, MPAA, NFE, OMAB, OMF, PRCP, PSEC, PSTL, QSR, RE, RICK, RLGT, RNG, RPD, SBLK, STE, TMQ, TPTX, UL, UN, VOYA, VRNS, WTER, WTS, XPEL, XPO\n\n - Ex-div:\n\n  APO, ARCB, CWBC, ETRN, GHM, KMT, MCBC, MDRR, MTG, NI, NMM, PCAR, PGC, SBBX, STZ, STZ.B, SWKS, WBS, XLNX, XOM\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 1.550%)\n    - 6-Month Bill Auction (previous: 1.520%)\n    - CB Employment Trends Index (previous: 109.70)\n    - FOMC Member Bowman Speaks\n    - FOMC Member Harker Speaks\n    - Investing.com Gold Index (actual: 51.3%, previous: 57.4%)\n    - Investing.com S&amp;P 500 Index (actual: 45.1%, previous: 43.8%)\n\n## Upcoming events for Tuesday, February 11th\n\n - Expected earnings:\n\n  AAT, ACCO, ACGL, ADPT, AIZ, AKAM, AKRO, ALIM, AMCR, AMX, AN, ARA, ASC, ATEN, AXLA, AZRE, BCEL, BE, BFIN, BIOX, BXMT, CCR, CEIX, CNO, CPAC, CPSI, CPSS, CRL, CRNC, CRTO, CRTX, CTO, CVET, D, DBD, DCP, DEI, DENN, DIOD, DTIL, EEFT, ELMD, EXAS, EXC, FLOW, FSP, GPMT, GRPN, GT, GTIM, HAS, HCAT, HCSG, HLT, HOOK, IAA, INGR, IRTC, ISR, JLL, KRNT, LCII, LPX, LSCC, LYFT, MAS, MEC, MLM, MMYT, MORF, MWK, NCR, NGM, NMIH, NNN, NSP, NXTC, OMC, ONDK, OPRT, PEAK, PKD, PNTG, PRI, PRVL, PSN, PTN, REXR, RM, SANW, SCCO, SEE, SFST, SILK, SQNS, ST, STOK, STSA, SWTX, TGB, TGNA, TGTX, TH, TSU, UA, UAA, UDR, USFD, VIRT, VNOM, VREX, VTGN, WTRE, WU, XGN\n\n - Ex-div:\n\n  BFIN, BOKF, CEN, ECC, EIC, FOF, GWB, HOMB, INF, INVH, LDP, LEVI, LGI, MDC, MIE, MKTX, MSA, NFBK, PSF, RA, RNP, SASR, SIRI, SLB, TESS, TTEK, UTF, VLO, WETF, WINA, WNEB\n\n - Economic events and announcements:\n\n    - 3-Year Note Auction (previous: 1.567%)\n    - API Weekly Crude Oil Stock (previous: 4.180M)\n    - FOMC Member Bullard Speaks\n    - FOMC Member Kashkari Speaks\n    - FOMC Member Quarles Speaks\n    - Fed Chair Powell Testifies\n    - JOLTs Job Openings (consensus: 7.233M, previous: 6.800M)\n    - NFIB Small Business Optimism (consensus: 103.4, previous: 102.7)\n    - Redbook (previous: 0.2%)\n    - Redbook (previous: 5.7%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, February 12th\n\n - Stock splits:\n\n    - NVIV @ **1:30**\n\n - Expected earnings:\n\n  AB, ACEL, AEL, AKR, AM, AMAT, ANDE, APLT, AR, ARCC, ASGN, ATOM, ATUS, AVLR, BCOV, BG, BLBD, BRKR, BSGM, CDNS, CF, CFX, CHEF, CHNG, CIDM, CIGI, CIM, CME, CODX, COHU, COWN, CPA, CRWS, CSCO, CSTE, CTL, CTRE, CVE, CVS, CXW, CYBR, CYRN, DISH, DMAC, DSSI, DYAI, DYNT, ECOM, EFC, EFX, EQC, EQIX, EQX, FCPT, FET, FLIR, FOSL, FR, FTSI, GEO, GOLD, GOOD, GPN, HR, HUBS, IBN, IDYA, IFF, IPG, IQV, IRT, JHX, JMP, JRSH, KAI, KGC, KLDO, KMDA, LAD, LPI, LPL, LTRX, MCHX, MCO, MFC, MGM, MIST, MNOV, MRO, NBL, NBLX, NLY, NPO, NSIT, NTAP, NTB, NTWK, NUS, NWE, OIS, OSW, PEGA, PERI, PGRE, PING, PRSP, PRTA, PRTH, PS, PSNL, PTSI, QDEL, QLYS, QUIK, QUOT, RDFN, RDWR, REG, RLMD, RUSHA, RYAM, SHOP, SLF, SLGG, SONM, SPWR, SSNC, STAG, TAP, TCO, TCX, TEVA, TGE, TMDI, TRIP, TRMB, TRVG, TTGT, TW, TYL, UE, UROV, VCTR, VERU, VNDA, WCN, WELL, WNC\n\n - Ex-div:\n\n  ACV, ADM, AIO, AMG, ARMK, CBH, DBL, DSE, DSL, EFL, EHT, ELY, ETR, EVF, GDV, GNT, GUT, HPF, HPI, HPS, HTD, IVH, IVZ, NCV, NCZ, OMP, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RMD, SIMO, STBA, TBNK, TJX, VGI, ZION, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.869%)\n    - Crude Oil Imports (previous: 0.051M)\n    - Crude Oil Inventories (consensus: 2.831M, previous: 3.355M)\n    - Cushing Crude Oil Inventories (previous: 1.068M)\n    - Distillate Fuel Production (previous: -0.003M)\n    - EIA Refinery Crude Runs  (previous: 0.048M)\n    - EIA Weekly Distillates Stocks (consensus: -0.014M, previous: -1.512M)\n    - EIA Weekly Refinery Utilization Rates (previous: 0.2%)\n    - FOMC Member Harker Speaks\n    - Fed Chair Powell Testifies\n    - Federal Budget Balance (previous: -13.3B)\n    - Gasoline Inventories (consensus: 2.057M, previous: -0.091M)\n    - Gasoline Production (previous: 0.745M)\n    - Heating Oil Stockpiles (previous: -0.014M)\n    - MBA 30-Year Mortgage Rate (previous: 3.71%)\n    - MBA Mortgage Applications (previous: 5.0%)\n    - MBA Purchase Index (previous: 283.8)\n    - Mortgage Market Index (previous: 682.0)\n    - Mortgage Refinance Index (previous: 2,975.7)\n    - OPEC Monthly Report\n    - Thomson Reuters IPSOS PCSI (previous: 63.42)\n\n## Upcoming events for Thursday, February 13th\n\n - Expected earnings:\n\n  AAN, ACOR, ACST, AEG, AEM, AER, AGIO, AIG, AIMC, AKG, ALE, ALKS, ALYA, AMN, ANET, APRE, ARES, ARI, ARR, AUY, AYR, AYX, BABA, BAX, BCOR, BFAM, BIO, BKI, BL, BRG, BWA, CARG, CBB, CC, CCEP, CERC, CGNX, COOP, CPS, CRY, CS, CTT, CTXR, CVM, CXP, CZNC, DAN, DAVA, DDOG, DLPH, DLR, DUK, DXCM, EEX, EQM, EQT, ETRN, EVLO, EXPE, FAF, FIS, FNF, FORR, FTS, FULC, GDDY, GLOB, GNRC, GTLS, HE, HII, HIMX, HTA, HUN, ICL, IMAC, INCY, IPGP, IRM, IRWD, KELYA, KHC, LBTYA, LECO, LH, LIN, LOGM, LPSN, MANU, MAT, MERC, MFG, MHK, MRC, MTRN, NBEV, NBSE, NEPT, NET, NEXA, NGD, NICE, NKSH, NMM, NMRK, NVDA, NVMI, OMN, OTLK, PATK, PBF, PBFX, PDFS, PDS, PEP, POOL, PVG, R, RDCM, REPL, ROKU, RSG, RWT, SAFE, SITC, SMP, SON, SPSC, SPXC, SRTS, SSTK, SVMK, SWAV, SWIR, TEX, THS, TLND, TNET, TPX, TRP, TRUP, TRVI, TRWH, TU, TUFN, VECO, VIE, WEX, WH, WM, WRE, WRTC, WSO, WST, YCBD, YELP, YETI, ZBRA, ZTS\n\n - Ex-div:\n\n  ABC, ADS, ADX, AFT, AGCO, AGN, AHC, AIF, AIT, AIV, ALE, AMGN, AMP, APAM, ARR, AVK, AWR, BA, BAF, BAH, BBF, BBK, BBN, BCX, BDJ, BFK, BFO, BFST, BFY, BFZ, BG, BGIO, BGR, BGT, BGY, BHK, BHLB, BHV, BIT, BKH, BKK, BLE, BLW, BME, BNY, BOE, BP, BQH, BRKL, BSD, BSE, BSET, BSM, BST, BSTZ, BTA, BTT, BTZ, BUI, BWFG, BYM, BZM, CCD, CF, CGO, CHD, CHI, CHW, CII, CLCT, COP, CORR, CPZ, CSQ, DCI, DRE, DUK, EBMT, EDF, EDI, EGF, EMR, ENB, EQT, EVA, FBK, FCCY, FCFS, FDEF, FINS, FMO, FNHC, FRA, FRBA, FSB, GBAB, GCBC, GEO, GGM, GHY, GOF, GRC, GWRS, HA, HTH, HTLF, HXL, HYT, IHIT, INN, ISD, JBL, JCO, JEF, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KR, LEO, LLY, LNN, LSTR, MCA, MEN, MHD, MMD, MMM, MMS, MNE, MOG.A, MOG.B, MSBI, MSEX, MSVB, MTX, MUE, MUI, MUS, NAC, NAD, NAN, NBB, NCB, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMS, NMZ, NP, NPN, NRK, NRT, NSL, NUV, NUW, NVG, NXJ, NXR, NXST, NYV, NZF, OBNK, ODC, OPP, OPY, OSK, OTTR, OXLC, OXSQ, PBI, PCSB, PEO, PER, PFS, PGZ, PKOH, PSTL, PZN, RBA, RDS.A, RDS.B, RIV, RMI, RMM, RSF, SAL, SALT, SBRA, SCHW, SIGI, SJM, SJR, SMBC, SMP, SONA, SPG, SRF, SRV, SSBI, SZC, TAIT, TCF, TECH, TFC, TSBK, UTL, UTX, V, VBF, VTA, VVR, WEC, WRK, WTRG, XEC, YUM\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.341%)\n    - 4-Week Bill Auction (previous: 1.540%)\n    - 8-Week Bill Auction (previous: 1.550%)\n    - CPI (consensus: 0.2%, previous: 0.2%)\n    - CPI (consensus: 2.5%, previous: 2.3%)\n    - CPI Index, n.s.a. (consensus: 257.87, previous: 256.97)\n    - CPI Index, s.a (previous: 258.50)\n    - CPI, n.s.a (previous: -0.09%)\n    - Cleveland CPI (previous: 0.2%)\n    - Continuing Jobless Claims (previous: 1,751K)\n    - Core CPI (consensus: 0.2%, previous: 0.1%)\n    - Core CPI (consensus: 2.2%, previous: 2.3%)\n    - Core CPI Index (previous: 265.92)\n    - Initial Jobless Claims (consensus: 212K, previous: 202K)\n    - Jobless Claims 4-Week Avg. (previous: 211.75K)\n    - Natural Gas Storage (previous: -137B)\n    - Real Earnings (previous: -0.1%)\n\n^^^^2020-02-10",
        "created_utc": 1581332416,
        "id": "fh7hpht",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1581361216.0
    },
    {
        "author": "Aliens_r_us1",
        "body": "If that were the case, then why are Juniper and Arista also under performing?",
        "created_utc": 1581598890,
        "id": "fhha468",
        "score": 1,
        "subreddit": "investing",
        "created": 1581627690.0
    },
    {
        "author": "dcbrah",
        "body": "Familys been in it for 40+ years. When you first start out you are going to literally bust your ass until you hit the point you can hire a driver to deal with the work.\n\nLets say you have a machine that takes 20 cases of soda to fill and you have 20 machines around. Your talking about 400 cases at 20 pounds a case. 8000 pounds.\n\nYour moving 8000 pounds at the store to your cart, from your cart to the truck, from the truck to the hand truck, from the handtruck into the machine. Can your back handle 32000 pounds and bending up and down each time you refill? Obviously rough math, but you get the idea.\n\nDo you have a vehicle that can handle this?\n\nRepair is dirty cheap if you have good machines and a good mechanic. Very easy to swap boards, validators, etc.\n\nStay away from snack and food machines if you are just starting out. Hassle to be cognizant of perishables and dates, etc. Need to consider how well candy holds as well - are you in Florida and have candy/chocolate machines?\n\nYou can absolutely crush it in the right location - but keep in mind its not get rich quick. It's get rich slow and by making sure your machines are all in a relatively close proximity (at least to start).\n\nWhen we do the rough math it usually comes out that 50% of sales price is profit. So for $1 can of soda, $.50 goes towards gas, products cost, commission, operational expense etc.\n\nHow do you plan on moving the machines? Each time you move its $150-$200. Where do you store them when not using?\n\nJust food for thought :)",
        "created_utc": 1580770327,
        "id": "fggv8wv",
        "score": 1,
        "subreddit": "investing",
        "created": 1580799127.0
    },
    {
        "author": "420dogshitTradez",
        "body": "Eh it depends if u are even cognizant of it\n\nDementia and the alz are a biiiitch for the family",
        "created_utc": 1580702662,
        "id": "fgelqe1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580731462.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  3rd of February\n\n\n\n## Upcoming events for Monday, February  3rd\n\n - Stock splits:\n\n    - IMPZY @ **1:40**\n\n - Expected earnings:\n\n  ABG, ACM, AEIS, AFG, AKTS, AMG, ARE, BCH, BECN, BYND, CBT, CHKP, CSWC, CTLT, DLA, DSPG, EZPW, FN, FRG, GOOG, GOOGL, HIG, HLI, HLIT, HP, HXL, IX, KMT, KRC, LEG, MLAB, MTSC, MUFG, NEU, NSSC, NXPI, ON, PAHC, PCH, PINE, PLMR, RBC, REAL, RYAAY, SAIA, SSD, SXI, SYY, TARO, TCFC, TPTX, UL, UN, VVV, WWD\n\n - Ex-div:\n\n  APLE, BKEP, DKL, EQM, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, IGD, IID, LBAI, LMRK, MET, MPLX, NBLX, NLOK, RBNC, SPH, SRCE, SRLP, SXT, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 1.530%)\n    - 6-Month Bill Auction (previous: 1.535%)\n    - Construction Spending (consensus: 0.5%, previous: 0.6%)\n    - ISM Manufacturing Employment (previous: 45.1)\n    - ISM Manufacturing New Orders Index (previous: 46.8)\n    - ISM Manufacturing PMI (consensus: 48.5, previous: 47.2)\n    - ISM Manufacturing Prices (consensus: 51.0, previous: 51.7)\n    - Investing.com Gold Index (actual: 57.4%, previous: 55.3%)\n    - Investing.com S&amp;P 500 Index (actual: 43.8%, previous: 38.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 51.7, previous: 52.4)\n    - Total Vehicle Sales (previous: 16.70M)\n\n## Upcoming events for Tuesday, February  4th\n\n - Expected earnings:\n\n  AFL, AGN, AINV, ALIM, ALL, ALLT, AMSC, APAM, AQUA, ARA, ARLO, ARMK, ATGE, ATI, ATO, AXE, BDC, BE, BFIN, BOOT, BP, CB, CCK, CDK, CERN, CLX, CMCO, CMG, CMI, CNC, CNXN, COP, CTO, CTS, DIS, DOX, EGHT, EMR, ENTG, EQNR, ESE, ETH, ETN, EXP, F, FISV, GAIN, GHL, GILD, GL, GNW, GPMT, GRA, GTES, HAE, HIW, HLNE, HUBB, IPHI, IT, ITI, J, JHG, JKHY, KLAC, KN, KTCC, LHX, LII, LITE, LPT, MANH, MCHP, MCK, MDU, MEC, MKL, MLI, MOD, MODN, MSGN, MTCH, MTG, MWA, MWK, MYGN, NBIX, NEWR, OI, OLN, OXLC, PAA, PAGP, PBI, PCTY, PDM, PINC, PKD, PLT, PRU, QGEN, RACE, RCL, RGS, RL, RNR, ROLL, SBH, SCSC, SFST, SILK, SIRI, SNAP, SNE, SPG, STX, SWI, TCS, TDG, TECH, TENB, THG, TRNS, UNM, USNA, VIAV, VSH, WAT, WDR, ZAYO, ZBH\n\n - Ex-div:\n\n  AAL, AMTD, APTV, BBD, BBDO, BRO, CNXM, COLB, CZWI, FSBW, HMST, HTBK, IBCP, IDA, MPB, NTIC, OCFC, WTBA\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -4.267M)\n    - Durables Excluding Defense (previous: -2.5%)\n    - Factory Orders (consensus: 1.2%, previous: -0.7%)\n    - Factory orders ex transportation (previous: 0.3%)\n    - IBD/TIPP Economic Optimism (previous: 57.4)\n    - ISM NY Business Conditions (previous: 39.1%)\n    - ISM-New York Index (previous: 869.0)\n    - Redbook (previous: 0.1%)\n    - Redbook (previous: 5.5%)\n\n## Upcoming events for Wednesday, February  5th\n\n - Expected earnings:\n\n  ABB, ACLS, ADTN, AME, ANGI, AOSL, ARWR, ASC, AVB, BAP, BCEI, BMI, BSGM, BSX, BTU, CCMP, CDAY, CENT, CENTA, CFMS, CG, CINF, COHR, COTY, CPLP, CPRI, CSGS, CSII, CTSH, CUB, CURO, CUZ, DHT, DHX, DLHC, DTE, ECHO, ELF, ELY, EMKR, ENR, ENS, ENSG, EPM, FCBC, FEYE, FGBI, FLO, FMC, FORM, FOXA, FSV, GLAD, GLUU, GM, GPI, GPRO, GRUB, GSK, HI, HMN, HUM, IAC, ICHR, ICL, IEC, ING, INVA, IO, IRBT, KFRC, KLR, KNL, LBRT, LCI, LNC, LYTS, MC, MCFT, MET, MHH, MHO, MIRM, MN, MPWR, MRK, MTRX, MXL, NESR, NNA, NS, NTGR, NUAN, NVT, OHI, ORLY, OSB, PAG, PAYC, PFGC, PFLT, PHX, PLUS, PROS, PSEC, PSTI, PTON, PTSI, QCOM, QNST, RAMP, RDN, RGLD, RYN, SAVE, SITM, SONO, SPOT, SR, SRDX, STC, SU, SUM, TBI, TKR, TM, TMDX, TMHC, TRNO, TTMI, TUES, TWLO, TWO, UGI, UHAL, VNE, VXRT, WD, WERN, YUMC, ZNGA\n\n - Ex-div:\n\n  BPRN, BXG, CATC, DCOM, DHF, FELE, GHC, HESM, HFWA, KBH, MATX, NEP, NWBI, OFED, OPB, OPBK, RELL, RGA, SBUX, VAM, VBTX, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 159K, previous: 202K)\n    - Crude Oil Imports (previous: 0.133M)\n    - Crude Oil Inventories (previous: 3.548M)\n    - Cushing Crude Oil Inventories (previous: 0.758M)\n    - Distillate Fuel Production (previous: 0.025M)\n    - EIA Refinery Crude Runs  (previous: -0.933M)\n    - EIA Weekly Distillates Stocks (consensus: -1.095M, previous: -1.289M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.9%, previous: -3.3%)\n    - Exports (previous: 209.00B)\n    - FOMC Member Brainard Speaks\n    - Gasoline Inventories (consensus: 1.320M, previous: 1.203M)\n    - Gasoline Production (previous: -0.377M)\n    - Heating Oil Stockpiles (previous: -0.106M)\n    - ISM Non-Manufacturing Business Activity (consensus: 52.0, previous: 57.2)\n    - ISM Non-Manufacturing Employment (previous: 55.2)\n    - ISM Non-Manufacturing New Orders (previous: 54.9)\n    - ISM Non-Manufacturing PMI (consensus: 55.1, previous: 55.0)\n    - ISM Non-Manufacturing Prices (previous: 58.5)\n    - Imports (previous: 252.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.81%)\n    - MBA Mortgage Applications (previous: 7.2%)\n    - MBA Purchase Index (previous: 313.7)\n    - Markit Composite PMI (consensus: 53.1, previous: 52.7)\n    - Mortgage Market Index (previous: 649.8)\n    - Mortgage Refinance Index (previous: 2,581.2)\n    - Services PMI (consensus: 53.2, previous: 52.8)\n    - Trade Balance (consensus: -48.00B, previous: -43.10B)\n\n## Upcoming events for Thursday, February  6th\n\n - Expected earnings:\n\n  ABMD, AGCO, AGTC, AHH, AIRI, ALNY, AMAG, ARCH, ARW, ASYS, ATVI, AVNW, AVXL, AXGT, AYTU, BBIO, BBU, BCE, BCO, BDX, BEP, BGCP, BHE, BIDU, BILL, BKH, BLL, BMY, BRBR, BRKS, BRT, BSIG, BV, CAH, CBL, CCS, CDR, CDW, CI, COLM, COR, CPST, CRWS, CSL, CTHR, CX, CZNC, DLX, DNKN, DRTT, DX, DXC, EAF, EGAN, EGP, EHC, EIGI, EL, ENTA, EPIX, EXPO, FCAU, FFG, FLT, FSCT, FTNT, FTV, FWRD, G, GLOG, GLOP, GLT, GTIM, HAIN, HBI, HUBG, ICE, IGMS, IMKTA, IQ, IRMD, K, KB, KEM, KRTX, KTB, KTOV, LGF.A, LGND, LLEX, LMAT, LPTH, LQDT, LTRX, MAC, MBUU, MD, MDP, MEIP, MMS, MNR, MNRL, MOBL, MPW, MR, MSI, MT, MTD, MTW, MYOV, NGL, NGVC, NJR, NLOK, NOV, NR, NRZ, NTUS, NWSA, NYT, OCSI, OCSL, ODFL, OESX, OFC, OIIM, OMCL, ONTO, ONVO, PACB, PBH, PENN, PFSI, PINS, PJT, PLSE, PM, PMT, PNNT, POST, PRLB, PRO, PROF, PTEN, PXLW, PZG, REGN, RMR, RVLV, SCPL, SEEL, SGEN, SIMO, SNA, SNN, SNY, SPGI, SPH, SVM, SYNA, TDC, TGI, TMUS, TNAV, TOT, TPCO, TPR, TSE, TSN, TTWO, TWOU, TWST, TWTR, TXG, UBER, UEPS, ULH, USX, UTI, VCRA, VRSN, VRTU, VSAT, VSTO, VVI, WLTW, WMS, WWE, XCUR, XFOR, XYL, YUM, ZEN\n\n - Ex-div:\n\n  AFB, AMSWA, ARLP, ARNC, AROC, ARTNA, AUB, AWK, BCBP, BCO, BMRC, BPFH, CELP, CEQP, CFFN, CIT, CLR, CMCO, CMS, COST, CSTR, CVCY, ET, FBMS, FCBC, FCF, FE, FRAF, GMLP, HOPE, INTC, JBHT, LBC, MMLP, MMP, NGL, NRP, NSC, PCTI, PH, PNFP, RBB, SBFG, SMBK, SMLP, SSB, SUN, SYF, WAB, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.545%)\n    - 8-Week Bill Auction (previous: 1.550%)\n    - Challenger Job Cuts (previous: -25.2%)\n    - Challenger Job Cuts (previous: 32.843K)\n    - Continuing Jobless Claims (consensus: 1,720K, previous: 1,703K)\n    - FOMC Member Kaplan Speaks\n    - FOMC Member Quarles Speaks\n    - Initial Jobless Claims (consensus: 215K, previous: 216K)\n    - Jobless Claims 4-Week Avg. (previous: 214.50K)\n    - Natural Gas Storage (previous: -201B)\n    - Nonfarm Productivity (consensus: 1.5%, previous: -0.2%)\n    - Unit Labor Costs (consensus: 1.3%, previous: 2.5%)\n\n^^^^2020-02-03",
        "created_utc": 1580727612,
        "id": "fgf6u2j",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1580756412.0
    },
    {
        "author": "420dogshitTradez",
        "body": "Eh it depends if u are even cognizant of it\n\nDementia and the alz are a biiiitch for the family",
        "created_utc": 1580702662,
        "id": "fgelqe1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580731462.0
    }
]