[
    {
        "author": "redditpertu",
        "body": "Update on my portfolio!\n\n&amp;#x200B;\n\n| &lt;!--td {border: 1px solid #ccc;}br {mso-data-placement:same-cell;}--&gt;Waste ManagementAlphabetMicrosoftAppleAmazonAt &amp; TBroadcom StockRealty Icome CorporationJohnson &amp; JohnsonBerkshire Hathaway BWells FargoDisneyRoyal bank of CanadaPepsi CoCoca Cola CO | &lt;!--td {border: 1px solid #ccc;}br {mso-data-placement:same-cell;}--&gt;WMGOOGLMSFTAAPLAMZNTAVGOOJNJBRK.BWFCDISRYPEPKO | &lt;!--td {border: 1px solid #ccc;}br {mso-data-placement:same-cell;}--&gt;5.8%7.6%5.7%7.3%7.0%6.6%6.4%6.3%7.1%5.5%8.1%6.8%6.8%6.5%6.6% |\n|:-|:-|:-|\n||||",
        "created_utc": 1580914674,
        "id": "fglzfwm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580943474.0
    },
    {
        "author": "salfasano",
        "body": "You think the market doesn't realize the rvp spec is changing? \n\nEven with P66 Bayway FCC and maybe XOM BR down, it's going to take a lot to draw down these inventories.",
        "created_utc": 1581973098,
        "id": "fhycg7z",
        "score": 1,
        "subreddit": "investing",
        "created": 1582001898.0
    },
    {
        "author": "iamnewnewnew",
        "body": "&gt;2x MSFT 3/20 195c contracts yesterday\n\n~~Br~~GuH..",
        "created_utc": 1581758180,
        "id": "fhoib7c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581786980.0
    },
    {
        "author": "Rclarkttu07",
        "body": "The previous COD had a BR mode that sucked ass. I do not expect this to take off like fortnight as there is already a BR for adults called PUBG (I've been hooked for 2 years). I bought the new COD and played for a couple days and went back to PUBG. \n\n&amp;#x200B;\n\nSide note, if people don't already have the new COD, i doubt they will buy it solely for this game mode.",
        "created_utc": 1582139514,
        "id": "fi4eewj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1582168314.0
    },
    {
        "author": "FREESTONE_",
        "body": "Im on the boat man not hopping off for a while see what EOW brings well br fine",
        "created_utc": 1581600584,
        "id": "fhhc8sb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581629384.0
    },
    {
        "author": "yoteshot",
        "body": "Anybody else thinking this might be a good short term play to gain boost from upcoming release of the BR mode?",
        "created_utc": 1581540504,
        "id": "fhfc9bm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581569304.0
    },
    {
        "author": "Accurate_Jury",
        "body": "What ticker could you possibly br selling to get that consistent return",
        "created_utc": 1580788798,
        "id": "fghnbyb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580817598.0
    },
    {
        "author": "mrcrazy_monkey",
        "body": "This is one of the stocks that wont br effected by the Coronavirus righy?",
        "created_utc": 1581996666,
        "id": "fhzdflz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582025466.0
    },
    {
        "author": "LittleTendies",
        "body": "COD BR next couple weeks. 2 new Netflix shows from 2 of their most popular games? I don't like em either, but I do like money.",
        "created_utc": 1582142888,
        "id": "fi4kalu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582171688.0
    },
    {
        "author": "ElephantSquad",
        "body": "I don't see what they have that'd make them pop. WoW classic was baked in back in November when it went from low 50's to upper 50's. People like me who have lives played for 2 months for nostalgia then quit. The subs I follow indicate it's dying except for extremely obese nerds who have been playing since 2004. \n\nThe only thing I can see them having is CoD Battle Royale. They had a teaser with a C-130 dropping people and a gas ring and people are 100% sure (reasonably so) that this is a BR trailer. Combine that with the already high fan base of the new CoD game (myself included) and it  could make them some money.\n\nThat being said over 60% of what they earn is from mobile games so that's really where the money is. If there's news I don't know about a new Candy Crush game or something which is their bread and butter then maybe.\n\nI have no idea what this guy thinks is going to make it explode unless he has tunnel vision thinking the ~3 fully populated streamer servers on WoW classic are making them anything more than chump change.",
        "created_utc": 1582223829,
        "id": "fi7lwlv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582252629.0
    },
    {
        "author": "i7amNotAfraid",
        "body": "Yes Sir, for professional trader. I can provide all meals as well and provide accommodation in a shared 2 BR apartment, could provide dental as well. But I can't pay 150K a year. Since I am hiring only 2-4 traders, could you advise me what should I pay to attract professional traders to work for a start up and if I am trading 250K with professional traders, how much returns should I expect. I am good with forex, but stocks and commodities, I am not familiar. In forex I know that most professionals make 5% of investment per month. Could you advise ?",
        "created_utc": 1581296590,
        "id": "fh6a6kd",
        "score": 0,
        "subreddit": "investing",
        "created": 1581325390.0
    },
    {
        "author": "dacv393",
        "body": "Yeah I meant less latency than the current satellites. But also in those certain cases it could possibly be lower than ever traditional over the wire signal. Not suggesting that's going to be the selling point for the average user, since yeah CDNs and stuff, although I do remember reading how financial institutions in certain places (like London I think) would pay top dollar for some sort of dedicated channel on Starlink/LEO sat internet since those couple ms of lower latency could mean millions for high frequency trading or other stuff when trading in foreign markets",
        "created_utc": 1581086125,
        "id": "fgsjsys",
        "score": 1,
        "subreddit": "investing",
        "created": 1581114925.0
    }
]