[
    {
        "author": "babamanali",
        "body": "AVGO",
        "created_utc": 1606105209,
        "id": "gdatz4l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606134009.0
    },
    {
        "author": "FiWiFaKi",
        "body": "I think their fabs are too far behind to ever catch up to TSMC and Samsung.\n\nI think they'll slowly continue to bleed market share. Maybe they'll make a massive turn around, but calling it seriously undervalued isn't right. There's more competitors in the space now, and the only criteria they're better in now than then is reputation, and they're losing that fast. \n\nWouldn't touch it if it was me. Stuff like Qualcomm or Broadcom is more interesting to me.",
        "created_utc": 1605867836,
        "id": "gcxgwuf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605896636.0
    },
    {
        "author": "terrortbh",
        "body": "AVGO you ducking worthless piece of absolute garbage shit",
        "created_utc": 1604942030,
        "id": "gbqhie3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604970830.0
    },
    {
        "author": "sassypud",
        "body": "My wishlist consists of stocks I want to get at a lower price than where they are currently. I already have positions in all of these. \n\nINMD // \nQCOM // \nAVGO // \nDKNG // \nTMO // \nFTNT // \nDT // \nKEYS//",
        "created_utc": 1605810205,
        "id": "gcuqk2l",
        "score": 3,
        "subreddit": "stocks",
        "created": 1605839005.0
    },
    {
        "author": "BoomerImpairedShtSux",
        "body": "My Boomer stock pick is $AVGO.  A dividend stock that actually goes up.",
        "created_utc": 1605728835,
        "id": "gcr1y72",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605757635.0
    },
    {
        "author": "dknisle1",
        "body": "One of my M1 pies. Do I need to rebalance?\n \nAVGO 15%\n\nVOO 20%\n\nARKK 15%\n\nVXUS 15%\n\nVTI 20%\n\nVIG 15%",
        "created_utc": 1605631786,
        "id": "gcmif6b",
        "score": 2,
        "subreddit": "stocks",
        "created": 1605660586.0
    },
    {
        "author": "0toHeroInvesting",
        "body": "I think it is possible if people start early and invest wisely. But i do rather tend to like growth companies more but i do own and plan to invest into dividend paying companies also. I think a mix of both is best. I am planning to make a post about my portfolio in the next week or so. As i have just started a new portfolio from 0$ and want to grow it as much as possible. i own 64 companies from the US stock market, BYD from the Hong Kong exchange and some Bitcoin (i only like Bitcoin or ETH in the crypto wolrd) but that is only a 2% target of my portfolio. \n\nA couple of good dividend paying companies that i own in my opinion are: AT&amp;T, AbbVie,  Store Capital, Broadcom, JP Morgan,JNJ, Home Depot and a couple of others that have lower dividend yields but they are more growth focused.\n\nMy average dividend yield for the whole portfolio is just 1% but as i told you i am more growth focused",
        "created_utc": 1606077316,
        "id": "gd9bgra",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1606106116.0
    },
    {
        "author": "RoyalGod20",
        "body": "No, I’m not a fan of index funds. Unless you’re the type to want to set it and forget it. I like to be active in my choices. \n\nI like the following for long time growth and of course, do your own DD. \n\n1. AVGO\n2. ALB\n3. AMAT\n4. UNH\n5. PLUG\n6. WMT\n7. AMZN\n8. GOOG\n9. AAPL\n10. SQ\n11. BABA\n12. MSFT\n13. SE (definitely look into this) \n14. NIO (definitely look into this)\n15. JD (definitely look into this)\n16. TSLA\n\nLook into any of these if you want to make real money. Choose three or four and add to your positions and You’ll be a rich man.",
        "created_utc": 1606256778,
        "id": "gdhpuih",
        "score": 2,
        "subreddit": "investing",
        "created": 1606285578.0
    },
    {
        "author": "wilhelm96",
        "body": "Not just AMD that would screw AAPL NVDA MRVL QCOM AVGO. They all rely on TSM",
        "created_utc": 1605510634,
        "id": "gch3ao8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605539434.0
    },
    {
        "author": "ghathawayjunior",
        "body": "AVGO",
        "created_utc": 1605289532,
        "id": "gc6700j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605318332.0
    },
    {
        "author": "dr3amboy3657",
        "body": "This is an excellent analytic point most people don’t do.   I too have been comparing market caps of their competitors and see what’s the maximum potential.  Same theory I am not touching Tesla at this point with it’s unrealistic 500B cap; I’m content watching from the sidelines.\n\nSome undervalue companies compared to their competitors:\n\nFSLY-NET\nCRSR-LOGI\nAMD-Intel, Nvidia, AVGO, QCOM\nFCEL-PLUG\nSNAP-FB\n\nWill the laggards catch up to the leaders??  That’s a question that you have to determine.",
        "created_utc": 1606456305,
        "id": "gdqnzfm",
        "score": 1,
        "subreddit": "investing",
        "created": 1606485105.0
    },
    {
        "author": "terrortbh",
        "body": "friendship ended with NVDA.\n\nAVGO is my new best friend.",
        "created_utc": 1606766346,
        "id": "ge6j1ds",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606795146.0
    },
    {
        "author": "PapaCharlie9",
        "body": "I understand the desire, but those sparse expirations, low volumes, and crazy wide bid/asks are all warning flags to steer clear of options on those ETFs. You're just throwing away money trading those options.\n\nA better idea would be to figure out what the top 3 holdings of each of those funds are and see if any of those companies have highly liquid options. Then trade options on those companies as a sort of proxy.\n\nFor example, the top three holdings of SOXX are AVGO, NVDA, TXN. All three have decent liquidity.\n\nhttps://www.zacks.com/funds/etf/SOXX/holding\n\nYou can then use an asset correlation app to see which of those individual stocks with liquid options most closely correlates to the fund's performance. For example:\n\n[Portfolio Visualizer asset correlation](https://www.portfoliovisualizer.com/asset-correlations?s=y&amp;symbols=SOXX+AVGO+NVDA+TXN&amp;timePeriod=2&amp;tradingDays=60&amp;months=36)\n\nTXN is the closest with a .84 correlation to SOXX.\n\n\n\nFWIW, you're paying an obscene expense ratio on ARKK. You'd likely make more money over the long run holding QQQ instead of ARKK.",
        "created_utc": 1604251750,
        "id": "gat5mhn",
        "score": 1,
        "subreddit": "options",
        "created": 1604280550.0
    },
    {
        "author": "Luka4life",
        "body": "It depends on your invest strategy. Big divy payers typically underperform the market however dividend paying companies that are able to focus on growth and dividends have significantly outperformed the market as well as paid investors dividends. \n\nSmall list of Canadian companies that outperformed canadain index: tih,tri,mru,cnr,t, ifc,byd,engh,byp-un,atd-b,dol,eif,grt,hdi, Na, gsy,cjt\n\nAmerican: apple, msft,avgo,mcd,tmo,amt, spgi,cost,unh,nke,low",
        "created_utc": 1605374074,
        "id": "gc9mjrv",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1605402874.0
    },
    {
        "author": "CallidusVulpes",
        "body": "I buy only tech, so I'm biased, but to be fair tech has the most fastest growing med-large cap companies. \n\nIf I were playing safe, but also wanted to make a lot of money I'd buy mostly TSMC (they are the largest CPU manufacturing company in the world and they make CPUs for AMD, Apple, Huawei, Qualcomm, Broadcom, HiSilicon, and Sony, also Intel is in the queue, but TSMC doesn't have enough factories). All of the companies they supply are behemoths, they only compete with Intel and Samsung, (Intel has basically given up and actually wants to use TSMC's chips) they are based in Taiwan, so no anti-trust shenanigans, they are rapidly expanding with large profits (creating more factories literally approved a 17 billion dollar factory a couple of days ago), and they also have the fastest CPUs.\n\nAMD is also a great buy as they are rapidly expanding and Intel/NVidia won't have a decent response for months.\n\nI'll go into more detail if you want, but I'm not even sure if you would consider these companies. If you are feeling very risky I'd buy Corsair (that's where all my money is) because I've made +95% in the past month and a half going from 2k to 4k and they will keep going up significantly at least until January.",
        "created_utc": 1605994524,
        "id": "gd452my",
        "score": 1,
        "subreddit": "investing",
        "created": 1606023324.0
    },
    {
        "author": "fastfrequency",
        "body": "AVGO",
        "created_utc": 1604504453,
        "id": "gb4ifkz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604533253.0
    },
    {
        "author": "dknisle1",
        "body": "What are your thoughts on AVGO? Think it’ll dip a little? Looking to buy a couple more shares by ends week",
        "created_utc": 1604453270,
        "id": "gb2givk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604482070.0
    },
    {
        "author": "aurelius94",
        "body": "$ON, $IIVI $AVGO.\n\nTake a look at Apple supplier list and search \"Pennsylvania\".",
        "created_utc": 1604502297,
        "id": "gb4e3hl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604531097.0
    },
    {
        "author": "Abdullah_88",
        "body": "Siemens, Phizer (buy after the correction), Allianz, BMW (they seem to be making inroads to electric vehicles), Generali, Exelon Corp, Entergy, Citizens financial , Citigroup, Philips 76, Broadcom, Brookfield, Enbridge ( extremely risky, invest at your own responsibility), Reality income, Low's",
        "created_utc": 1605638363,
        "id": "gcmwt5u",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1605667163.0
    },
    {
        "author": "Jelly_Sir",
        "body": "AVGO, TTD, TXN, PG, AAPL, PTY\nGreat dividends (to reinvest or monthly check), better than sp500 growth and lower volatility.",
        "created_utc": 1606613028,
        "id": "gdyim58",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606641828.0
    },
    {
        "author": "monkeyseal42",
        "body": "AVGO",
        "created_utc": 1605910583,
        "id": "gczj5up",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605939383.0
    }
]