[
    {
        "author": "PetetheJuggler",
        "body": "Dow who? Jones? Tremendous guy. Tim Apple, Marilyn Lockheed, tremendous companies. Seriously some of the best. So we’re taking a big look- a really serious look- at some of the stuff we’re seeing come out of the Dow. Really remarkable. Thought it was just a chemical company you know, some of the strongest, I mean, really strong disinfectants, like bleach or formaldehyde, and so once Mr. Jones really gets going and we can reopen some states you’ll be able to really attack this virus, and I mean really attack- perhaps kill- this virus. This, invisible enemy. Really that’s what it is. It’s invisible. But we’re taking a look at it and a lot of different things and I think the American people are really going to like what they see.",
        "created_utc": 1590515868,
        "id": "frw5uxx",
        "permalink": "/r/wallstreetbets/comments/gqxlh1/its_our_cherished_annual_tradition_returning/frw5uxx/",
        "score": 124,
        "subreddit": "wallstreetbets",
        "created": 1590544668.0
    },
    {
        "author": "ObscureWhistle",
        "body": "Extra Credits did a pretty good series on it.\n\nI shit you not, the company could only send something like one ship per month, twelve ships per year to the entirety of the South American Ports. \n\nTo compare, fleets of ships were being sent to India to simply maintain the supply and trade going on there - the company’s scheme was completely FUCKED.\n\nBut the company was like “it’s fine, everything’s fine” the stock value increased, the ENTIRE COUNTRY bought into it, LOANS were being taken to buy more shares! It got so huge that the government had to shut down private entrepreneurs because they were taking away from buying shares. RE: there was not enough money in circulation to allow for other startups because they needed all the money for this company that DOESNT ACTUALLY MAKE ANY MONEY!\n\nAnd then it failed and everyone lost their stuff!\n\nThis is the second funniest shit I’ve ever heard of. \n\nThe first was the Viking that killed his rival, let the guy’s head hang from his saddle, only to get an infection from the head’s buck-teeth and die three days later.\n\nNow *that* is some autist level shit!\n\n[South Sea Bubble](https://www.youtube.com/playlist?list=PL931Bkj5KLMtJ4AMegQtekqKcCy14FCec)\n\nTLDR; \n\n1) Don’t cut off a guy’s head and tie it to a saddle bag - that’s disgusting and it’s not social distancing. \n\n2) Don’t take economic advice from a guy who’s know for: an apple falling on his head, creating a universal gravitational theory, and being COMPLETELY FUCKING INSANE! \n\n3) Finally, get a DNA for all your children. Hey, someone might be fucking your wife, but you won’t have to pay child support! Fuck the house, those monthly payments add up!\n\nEDIT: For the memes (also, a moment of silence for me and all of the brothers who have STNG and EURN shares. We will rise again, someday).",
        "created_utc": 1589082697,
        "id": "fq4ruu6",
        "permalink": "/r/wallstreetbets/comments/ggr3nr/newton_is_the_ultimate_wsb_autist/fq4ruu6/",
        "score": 122,
        "subreddit": "wallstreetbets",
        "created": 1589111497.0
    },
    {
        "author": "LatinoMuyFinO",
        "body": "Some Options:\n\nBYND Calls: I shorted this today from $138 to $135. Could have made more if i had held til close but fuck it. They took a beating and am expecting a bounce back from the 132-133 level. I'll be going short term calls tomorrow for a quick scalp at open.\n\nPTON Calls: Same as above \\^ bounce back from the $40-41 level\n\nDKNG: FOMO if you want. This thing could pop to $40 or drop to $30. I won't be touching this until at least another week or so. Risky af but mad tendiez if you guess the right direction (calls/puts)\n\nCOTY: Same as above, but I expect this will hold better than DKNG since its already near rock bottom prices. Might throw a few thousand at it tomorrow in calls.\n\nSPY: i personally don't play SPY, but there is mad tendiez to be made if you get in calls at a dip (around the 295-297 range) or puts (around the 301-303 range).\n\nCCL, RCL, NCLH: Easy plays to go long on a dip, Beaten up cruise stocks that have been forming new bottoms. Easy 2x 3x bagger if you get in before a large move up in the premarket. They seem a bit overheated lately though so I would be careful of a pullback soon, in which case go short term puts.\n\nAAL, DAL, UAL, LUV, SAVE: Same as above\n\nAAPL, MSFT, AMD, NVDA: Tech saw a big hit today, might be a good spot to buy the dip. I'll be watching closely tomorrow if we continue to fall in tech at open, then I'm buying the dip for sure.\n\nBABA, TSM: GYNA stocks if you want i guess\n\n&amp;#x200B;\n\nGood luck making your parents money back you fucking autist.",
        "created_utc": 1590537988,
        "id": "frxdvjh",
        "permalink": "/r/wallstreetbets/comments/gr8jbo/parents_let_me_trade_with_their_money/frxdvjh/",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1590566788.0
    },
    {
        "author": "htdwps",
        "body": "This some billionaire circle jerk?\n\nAmazon Bezos says he'll plunge 4bln in profits into his company.\n\nApple withholds guidance.\n\nElon fucks his own company over as a way to get back at the forced factory shut down?\n\nStill waiting for Branson to tweet his SPCE to the ground?",
        "created_utc": 1588366103,
        "id": "fp78rq6",
        "permalink": "/r/wallstreetbets/comments/gbpa1e/trade_like_elvis/fp78rq6/",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1588394903.0
    },
    {
        "author": "WaffleandWaffle",
        "body": "I thought he already made a killing by speculating on AAPL",
        "created_utc": 1589081565,
        "id": "fq4q3ax",
        "permalink": "/r/wallstreetbets/comments/ggr3nr/newton_is_the_ultimate_wsb_autist/fq4q3ax/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1589110365.0
    },
    {
        "author": "AmericanHerstoryX",
        "body": "Ronald Wayne is the third founder of Apple. He sold his 10% stake in the company to Wozniak for $800. if you ever feel bad about your plays",
        "created_utc": 1590783789,
        "id": "fs8jt3i",
        "permalink": "/r/wallstreetbets/comments/gt08v2/weekend_discussion_thread_for_the_weekend_of_may/fs8jt3i/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1590812589.0
    },
    {
        "author": "bewb_tewb",
        "body": "The reason he said the stock is overpriced is largely due to the shutdown. \n\nTesla has a lot of things priced in at this point. What isn’t priced in (right now) is the inability to build cars due to the shutdown. \n\nThe real problem is that everything is overpriced right now. A record breaking unemployment report went out and the DOW still went up 400 points. \n\nTesla, at this point, will never go bankrupt. Any company, be it Apple or google, would buy them instantly if they had the opportunity to swoop in. There’s a ton of reason to be optimistic about the future of the company regardless of all of this.",
        "created_utc": 1589246717,
        "id": "fqbyz2f",
        "permalink": "/r/stocks/comments/ghzg93/elon_muk_ready_to_go_to_jail/fqbyz2f/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1589275517.0
    },
    {
        "author": "pennystockplayer",
        "body": "My dad works for Disney. He's a bigwig. Maybe you heard of him. His name is goofy. Apparently apple gonna buy them for 130 a share.",
        "created_utc": 1589510175,
        "id": "fqo96nv",
        "permalink": "/r/wallstreetbets/comments/gjtxjd/what_are_your_moves_tomorrow_may_15_2020/fqo96nv/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1589538975.0
    },
    {
        "author": "realguyfromthenorth",
        "body": "Two years ago Apple was WAY lower than where it is now. Overall, he made tons of money on this move.",
        "created_utc": 1588819212,
        "id": "fpqbmuc",
        "permalink": "/r/investing/comments/geu5e2/what_buffett_actually_said_about_berkshires_cash/fpqbmuc/",
        "score": 29,
        "subreddit": "investing",
        "created": 1588848012.0
    },
    {
        "author": "saul_2",
        "body": "Thank God we have Tim Apple to save the day. Can't wait to buy an iPhone SE and get COVID-19. Two for one deal!",
        "created_utc": 1588964944,
        "id": "fpwkaj0",
        "permalink": "/r/wallstreetbets/comments/gfzdu2/apple_to_reopen_stores_in_us_starting_next_week/fpwkaj0/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1588993744.0
    },
    {
        "author": "thepennyshark",
        "body": "because apple only gives a fuck about the aesthetic... no reason to make a bunch of pretty server boxes that are going to sit in a dark room with some guy with a ponytail jerking off near them...",
        "created_utc": 1590537320,
        "id": "frxcouv",
        "permalink": "/r/wallstreetbets/comments/gr8laa/serious_discussion_after_all_these_years_why/frxcouv/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1590566120.0
    },
    {
        "author": "visvya",
        "body": "TikTok's long term plan is to become a full fledged new media network with original TV shows, a [Spotify competitor](https://www.bloomberg.com/news/articles/2019-05-20/tiktok-owner-to-challenge-spotify-and-apple-with-music-service) and more. Think Buzzfeed but spyware.",
        "created_utc": 1589838140,
        "id": "fr2j0or",
        "permalink": "/r/wallstreetbets/comments/gm9l6z/disneys_head_of_streaming_resigns_to_become_new/fr2j0or/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1589866940.0
    },
    {
        "author": "jpreeves",
        "body": "&gt; First of all, props to the CEO. Notwithstanding the management that led the company to where it is now, the way he's conducting the layoffs should be a gold standard to the many others soon to come.\n\nCompletely agree. Scanning down the list, these are actually sizable investments in departing workers. It's not only decent, it will read well—both as a PR move, and in recruiting top talent back should the opportunity arise. \n\n&gt;Alumni Talent Directory — We will be launching a public-facing website to help teammates leaving find new jobs. Departing employees can opt-in to have profiles, resumes, and work samples accessible to potential employers. \n&gt;Alumni Placement Team — For the remainder of 2020, a significant portion of Airbnb Recruiting will become an Alumni Placement Team. Recruiters that are staying with Airbnb will provide support to departing employees to help them find their next job.\n&gt;RiseSmart — We are offering four months of career services through RiseSmart, a company that specializes in career transition and job placement services. \n&gt;Employee Offered Alumni Support — We are encouraging all remaining employees to opt-in to a program to assist departing teammates find their next role.\n&gt;Laptops — A computer is an important tool to find new work, so we are allowing everyone leaving to keep their Apple laptops.",
        "created_utc": 1588712796,
        "id": "fplhhrl",
        "permalink": "/r/investing/comments/ge4aq5/airbnb_to_lay_off_nearly_1900_people_25_of_company/fplhhrl/",
        "score": 27,
        "subreddit": "investing",
        "created": 1588741596.0
    },
    {
        "author": "10x_EBITDA",
        "body": "Apple reopening 6 stores apparently wasn't priced in and was worth a couple hundred billion in market value.\n\n\"Efficient market\"",
        "created_utc": 1588968881,
        "id": "fpwryl6",
        "permalink": "/r/wallstreetbets/comments/gg0k2r/weekend_discussion_thread_for_the_weekend_of_may/fpwryl6/",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1588997681.0
    },
    {
        "author": "Drunken_Monkey5",
        "body": "Honeycrisps are the superior apple.",
        "created_utc": 1590548095,
        "id": "frxv5m1",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frxv5m1/",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1590576895.0
    },
    {
        "author": "frzgg",
        "body": "I've been so pessimistic about the economy and constantly getting my ass kicked the past few weeks when I shifted too early from bull to bear.  An hour and a half before close, I finally said I'm going to put everything into puts and just not touch or look at the account for a while other than may May puts I bought on SPY.  I was in a meeting and checked back right before close to see how the market was doing and I might have the dumbest luck possible and went all in at the top.   Current positions with a lot of contracts on each below.  If this continues, I'm going to give away so many gold and platinum awards in the next few weeks lol\n\n&amp;#x200B;\n\n* 510 of GLD\n* 4700 of SLV\n* SPY 290p 5/22\n* SPY 291p 5/29\n* SPY 291p 6/19\n* SPY 291p 9/18\n* SPY 291p 10/16\n* SPY 292p 11/20\n* AAPL 315p 9/18\n* AAPL 315p 10/16\n* CMG 940p 9/18\n* CMG 950p 12/18\n* W 190p 8/21\n* W 190p 11/20\n* QSR 52.5p 10/16\n* LYFT 32.5p 7/17\n\nThis comes off as a brag but it's just me saying how lucky I might have got and that I'm going to give out a ton of money here as a thank you for not following any of the dumb advice I read the past 4 weeks.",
        "created_utc": 1589317748,
        "id": "fqf2rhr",
        "permalink": "/r/wallstreetbets/comments/gij7tq/what_are_your_moves_tomorrow_may_13_2020/fqf2rhr/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1589346548.0
    },
    {
        "author": "wsb_roulette",
        "body": "I'm a bull but honestly I think we'll start to see a reasonable decline soon. Fed pumps less and less money, market growth slows, tech is at a high without having actually made any significant advances to support this move (AAPL for ex), corona wave 2 is a real possibility, market optimism is far too high. \n\nI think the big fish on Wall Street just wanted to get out of their shitty losing positions at a \"reasonable\" price by having the market artificially inflated. \n\nBut who knows, it's priced in already right?",
        "created_utc": 1589316180,
        "id": "fqezhlu",
        "permalink": "/r/wallstreetbets/comments/gij7tq/what_are_your_moves_tomorrow_may_13_2020/fqezhlu/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1589344980.0
    },
    {
        "author": "ShawnHans007",
        "body": "Put 125k in apple, msft and fb days before the crash.\n\nJust broke even today.\n\nhttps://imgur.com/a/Sz6ShOy",
        "created_utc": 1589910674,
        "id": "fr5ltk2",
        "permalink": "/r/wallstreetbets/comments/gmlsuw/daily_discussion_thread_for_may_19_2020/fr5ltk2/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1589939474.0
    },
    {
        "author": "Squid2j2",
        "body": "High chance of SPY going down , all techs are way overbought, it’ll like to be coming down by next week. Look at fucking AAPL , its $10 away from ATH , if you think it’ll keep climbing after 5/14 then you’re on fucking meth",
        "created_utc": 1589237869,
        "id": "fqbizkc",
        "permalink": "/r/wallstreetbets/comments/ghyhbx/25k_of_spy_puts_for_the_massive_head_and_shoulders/fqbizkc/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1589266669.0
    },
    {
        "author": "freethereddit",
        "body": "please forgive me. positions police.\n\nCurrent Positions:\n\nTSLA 20 Shares\n\nAAPL 10 Shares\n\nBA 210 Shares\n\nSTWD 390 Shares\n\nEverything else, CASH",
        "created_utc": 1589521815,
        "id": "fqoqdbp",
        "permalink": "/r/wallstreetbets/comments/gk12el/ok_this_time_cash_gang/fqoqdbp/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1589550615.0
    },
    {
        "author": "OrangesAreOrangeHa",
        "body": "I'm sorry but this is a gross misunderstanding of what is going on.\n\nThe S&amp;P 500 is not the economy.  It also is not an equal weighing of all the companies in the S&amp;P.  As long as there's not full blown fear, there should be some differentiation.  Owning MSFT and owning M are not equal.  The stocks like MSFT are helping carry the S&amp;P while M being down a lot is a not a proportionate loss.\n\nDon't forget, we are down.  It's not like we're up YTD.\n\nYou also have to remember that there's no competition to equities.  The 10-year is yielding less than 1%.  Why would I buy that when I can buy AAPL and get a better dividend than that?  After all, it has about $100 billion in cash alone right now so the dividend seems pretty safe.\n\nThere's also this thing called sentiment.  In layman's terms, it's the general belief of what will happen.  So while unemployment may not return to the record pre-crisis levels, the market believes most of these jobs will be back soon.  And that makes a lot of sense if you believe the world will be re-opening soon, which I do.  Since the general belief is that unemployment will be resolved shortly, the market is priced accordingly. \n\nThere's also TRILLIONS of dollars of stimulus being issued in a variety of ways.  I think you might underestimate how much TRILLIONS really is.\n\nEven if you're right and the market is being irrational, these bullish rallies are normal in a bear market.  That means you can be right AND THIS STILL HAPPENS.  These must be accounted for but you're not accounting for them whatsoever.\n\nMost importantly, you're looking at this like an amateur.   Big time investors are capitalists.  They understand ups and downs and all sorts of things I'm sure I don't know.  But markets are functioning.  The big fear in the Great Recession is that markets weren't functioning.  We recovered once it proved the markets functioned.  Knowing this, the Fed went right after this point immediately.  THAT'S WHY THE FED DID WHAT IT DID BECAUSE IT'S THAT IMPORTANT.  The day the Fed announced infinite QE was the bottom on the chart for the reason.  The Fed basically guaranteed markets will work so the worst case scenario is off the table.\n\nLastly \"Things aren't returning to normal anytime soon\" is a massive assumption.  I'm not saying the world will be back to normal on May 15th but a lot of people think the opposite of you, myself included.  Be careful what assumptions you make.\n\nEDIT:  You also have to remember how people think.  Let's say 20% of people thought the world would open again in April, 20% in May, 20% in June, 20% July, and 20% in August.  Well it's May now so the April 20% and the May 20% think re-opening is right around the corning - that's 40%.  In June, you add that 20% to the existing 40% and now we're up to 60%.  Just like you think the market will fall every day, they believe the opening is just around the corning.  You keep thinking \"tomorrow is the day\" forever.  Being stubborn  goes both ways.",
        "created_utc": 1588648370,
        "id": "fpitiq8",
        "permalink": "/r/options/comments/gdolv5/does_anyone_else_think_the_rally_of_the_past/fpitiq8/",
        "score": 19,
        "subreddit": "options",
        "created": 1588677170.0
    },
    {
        "author": "ApartheidClyde",
        "body": "&gt;“As you know, the last eight years, [the federal government] borrowed more than it did in the whole history of our country,” Trump said. “So they borrowed more than $10 trillion, right? And yet we picked up $5.2 trillion just in the stock market. Possibly picked up the whole thing in terms of the first nine months, in terms of value.”\n\n&gt;“So you could say, in one sense, we’re really increasing values. And maybe in a sense we’re reducing debt. But we’re very honored by it,” Trump said.\n\nhttps://www.cnbc.com/2017/10/12/trump-just-claimed-stock-market-gains-actually-offset-national-debt.html\n\nHe thinks if MSFT or AAPL goes up 1% then National debt goes down on that day. This guy has been pumping the market for last 3 years.",
        "created_utc": 1590618460,
        "id": "fs0zd7o",
        "permalink": "/r/wallstreetbets/comments/grr84s/what_are_your_moves_tomorrow_may_28_2020/fs0zd7o/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1590647260.0
    },
    {
        "author": "defy123",
        "body": "Played Amzn, Apple, Visa calls, lost all 3",
        "created_utc": 1588366825,
        "id": "fp7a696",
        "permalink": "/r/wallstreetbets/comments/gbq95q/heres_some_bull_blood_for_you_bears_to_feast_on/fp7a696/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1588395625.0
    },
    {
        "author": "qa2",
        "body": "His name is Tim Apple. Why else would the company be named Apple?",
        "created_utc": 1589573941,
        "id": "fqqxv6e",
        "permalink": "/r/wallstreetbets/comments/gkb8h0/apple_is_going_down/fqqxv6e/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1589602741.0
    },
    {
        "author": "negan90",
        "body": "Dinosaur. Buffet is a savant with consumer staples and banks.\n\nThe future is tech, he stumbled into apple after panning apple and Google for years. \n\nYesterday's man, if you are looking for large growth, he is essentially a \"game manager\" quarterback to use a sports analogy",
        "created_utc": 1589230150,
        "id": "fqb3xal",
        "permalink": "/r/stocks/comments/ghvwmv/brkb_worst_performer_out_of_50_stock_watchlist/fqb3xal/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1589258950.0
    },
    {
        "author": "LivinTheHiLife",
        "body": "On April 17 I went all in on SPY puts and rode SPY down from $284 to 273. \n\nOn April 29, I turned a $780 gamble into 3800 on Google $1350 5/8 FDs. \n\nThe next day I lost 2800 of that on Apple calls on their ER. But, I made it all back and more that same day when Daddy Elon made his now infamous tweet (I have him on notification on twitter). \n\nDid puts on TSLA that instant with my remaining 1400 into about 5300. Lost some. Then did all in on calls yesterday into Baba. Which took me to $7,000. \n\nThat same night I sold BABA calls I went in on NFLX calls when NFLX dropped like a rock in anticipation for DIS. Sold all NFLX calls at open for a total $3,500 gain resulting in my $10.5k total you see here now.\n\nFor some reason, i was so autistic in the heat of things I got marked as a pattern day trader today from a trade I didn't realize I made yesterday. So I'm locked out of RH for 90 days which is fantastic because it prevents me from losing this all so I get to keep these tendies. lol im so fucking dumb man it hurts.",
        "created_utc": 1588780257,
        "id": "fpo8lje",
        "permalink": "/r/wallstreetbets/comments/gemjwi/i_did_something_retarded_with_the_orange_turds/fpo8lje/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1588809057.0
    },
    {
        "author": "spoobydoo",
        "body": "Calls all day, hes a cult brand of his own like Apple. He can tell people he thinks his company's equity price is too high and then have it close higher not even a week later in the middle of an economic full-stop.",
        "created_utc": 1589058238,
        "id": "fq2oyj4",
        "permalink": "/r/wallstreetbets/comments/ggjq1v/elon_musk_rn/fq2oyj4/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1589087038.0
    },
    {
        "author": "Bartonias",
        "body": "Tesla $905\nApple $330\nCMG $920\n\nBought pretty close to the bottom. All expiring Jan 15, 2021. Watching it go up by tens of thousands a day. Been mind blowing. I imagine I’ll cross $100k tomorrow.",
        "created_utc": 1589172120,
        "id": "fq8ppyw",
        "permalink": "/r/wallstreetbets/comments/ghgtql/started_with_3k_ill_repost_when_it_gets_to_a/fq8ppyw/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1589200920.0
    },
    {
        "author": "deadjawa",
        "body": "The “Buffett is holding cash, it’s because he thinks a crash is coming” has been one of the go to short seller memes for as long as Buffett has been popular.  I mean, I’ve heard people say that for probably 15 years.\n\nEven if the amount of cash he was holding was historically abnormal, which it’s not, he is not a knife catcher and never has been.  Why you’d use him as a beacon to try to understand market timing is beyond me.  He’s been a pretty bad market timer.  Like two years ago when he bought Apple before the China crash or last year when he bought OXY before an oil crash.",
        "created_utc": 1588806251,
        "id": "fpports",
        "permalink": "/r/investing/comments/geu5e2/what_buffett_actually_said_about_berkshires_cash/fpports/",
        "score": 15,
        "subreddit": "investing",
        "created": 1588835051.0
    },
    {
        "author": "kernel_dev",
        "body": "I'm seriously considering writing a bot to place after-hours limit buy orders at low price points for meme stocks and companies popular among retail investors. I see flash crashes like this every 2-3 weeks for names like AMZN, PG, AAPL,... etc.",
        "created_utc": 1589932978,
        "id": "fr6tl4q",
        "permalink": "/r/wallstreetbets/comments/gmzm77/at_537_somebody_learned_about_market_orders/fr6tl4q/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1589961778.0
    },
    {
        "author": "wozza365",
        "body": "Excel is a really interesting one, and actually points to just how good MS are at being backwards compatible.\n\nMost of the longstanding bugs are well documented and understood, but are left in on purpose, even reprogramming to produce the same bugs to ensure compatibility with spreadsheets from 20 years ago that would break if the bug was fixed.\n\nMost, including myself would argue that those old spreadsheets should either be updated or remain on an old Office version, but it's the path they've chosen to take and I think a lot of businesses love it compared to Apple dropping support for things almost overnight.",
        "created_utc": 1590517849,
        "id": "frw9zz2",
        "permalink": "/r/investing/comments/gr09bz/slack_ceo_microsoft_is_unhealthily_preoccupied/frw9zz2/",
        "score": 15,
        "subreddit": "investing",
        "created": 1590546649.0
    },
    {
        "author": "encore42",
        "body": "An etf is a collection of stocks. For example a technology etf contains a bunch of technology stocks like Apple and Microsoft. Just a way to keep your portfolio diversified without having to do the extra research.\n\nedit: damn this subreddit is harsh",
        "created_utc": 1590626966,
        "id": "fs1f1xj",
        "permalink": "/r/pennystocks/comments/grw1tt/can_someone_explain_etfs_to_me/fs1f1xj/",
        "score": 15,
        "subreddit": "pennystocks",
        "created": 1590655766.0
    },
    {
        "author": "iWriteYourMusic",
        "body": "The new tech superpower.\n\nFB, AAPL, GOOG, MSFT, AMZN, NFLX, TSLA, INTC, SHOP\n\n**FAGMANTIS**",
        "created_utc": 1590529973,
        "id": "frwyu9q",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frwyu9q/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1590558773.0
    },
    {
        "author": "PillarsBliz",
        "body": "I think it's an interesting question since I am familiarizing myself with companies.  Surely companies won't have their share price increase forever (just look at the crash this year), but some of the ones I expect will still be strong in 6 months would be:\n\n* NVDA (despite the recent crash I think they'll at least stay strong, they have a good product, and they're in good financial shape)\n* HD (I want to trade this, seems a very solid company for contractor / do it yourself / home install stuff)\n* BBY (of all the consumer stores besides maybe Wal-mart, this seems in the best financial shape to survive?)\n* DIS (Disney has been tremendously successful at adapting and surviving, and I expect their stock to recover hugely)\n* MSFT (huge company, seems to be in good shape, if they die then we're in deep trouble everywhere since Windows is so ubiquitous)\n* KO (good defensive stock, decent dividend)\n\nIf I had more money, I'd probably look at Apple, Amazon, and Tesla.",
        "created_utc": 1590633408,
        "id": "fs1qcdq",
        "permalink": "/r/options/comments/grwx33/if_you_had_to_pick_10_companies_to_trade_options/fs1qcdq/",
        "score": 14,
        "subreddit": "options",
        "created": 1590662208.0
    },
    {
        "author": "plopseven",
        "body": "Can we talk about general P/E ratios and market evaluation now?  This market is about to be higher than before the pandemic.  Car companies are making respirators instead of cars, Apple is trying to sell cheap SE-model iPhones to stay afloat during a trade war with China, Facebook is sucking Trump’s dick saying they don’t really care about free speech...\n\nCities are rioting around the world and I don’t blame them.  Fuck this system.",
        "created_utc": 1590786460,
        "id": "fs8p4u4",
        "permalink": "/r/wallstreetbets/comments/gt09t6/boomers_bitch_about_participation_awards_but/fs8p4u4/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1590815260.0
    },
    {
        "author": "nckmiz",
        "body": "The market was down 30% for a week or so. You think Berk can just deploy 60 billion the way you deploy 5k? He’s not going to go buy more than a few billion in shares of Apple/MSFT, etc. with that money. He doesn’t ever want to hold over 10% positions in publicly traded companies for disclosure reasons. His game at this size is waiting for attractive companies to be in need. What company that was attractive in late March was in desperate need of capital? How quickly do you think Berk can negotiate a full on takeover? \n\nHe’s in a waiting game. This thing is far from over. He’s not a hedge fund manager buying temporary market dips.",
        "created_utc": 1588824758,
        "id": "fpqk8nf",
        "permalink": "/r/investing/comments/geu5e2/what_buffett_actually_said_about_berkshires_cash/fpqk8nf/",
        "score": 14,
        "subreddit": "investing",
        "created": 1588853558.0
    },
    {
        "author": "8PenDragon8",
        "body": "EMAN curious what others think apparently rumors are building about intel and Apple wanting a piece makes me want a piece too",
        "created_utc": 1589306230,
        "id": "fqeeijy",
        "permalink": "/r/pennystocks/comments/gigfar/new_pump/fqeeijy/",
        "score": 14,
        "subreddit": "pennystocks",
        "created": 1589335030.0
    },
    {
        "author": "fufufang",
        "body": "The output for the last 24 hours is like this: \n\n    Code    Frequency\n    MVIS    196\n    IZEA    107\n    KTOV    33\n    RTTR    29\n    MARK    22\n    DECN    12\n    GNUS    12\n    MSFT    12\n    INUV    11\n    UAVS    10\n    COVI    9\n    BBCP    9\n    VISL    9\n    NAK     8\n    RMBL    8\n    TTI     8\n    NAT     7\n    VAL     7\n    CNAT    7\n    RTW     6\n    EIS     5\n    FRSX    5\n    TLSS    5\n    MGM     4\n    DIS     4\n    NASD    4\n    WHAT    4\n    SHIP    4\n    GCGX    4\n    ACB     4\n    SCON    4\n    DYE     4\n    RTTF    3\n    TNP     3\n    FET     3\n    BIOC    3\n    STOC    3\n    AIKI    3\n    FLIR    3\n    MERG    3\n    EOD     3\n    ZOM     3\n    DISH    3\n    GHSI    3\n    OAS     3\n    BBRW    3\n    RAZF    3\n    HIL     3\n    AAPL    3\n    LADR    3",
        "created_utc": 1588795807,
        "id": "fpp4h9v",
        "permalink": "/r/pennystocks/comments/gerhqw/i_wrote_a_python_script_which_analyses_the_most/fpp4h9v/",
        "score": 14,
        "subreddit": "pennystocks",
        "created": 1588824607.0
    },
    {
        "author": "odansteron",
        "body": "Got the new iPhone SE in covid red. I’m satisfied with it. AAPL calls",
        "created_utc": 1589836418,
        "id": "fr2fkhq",
        "permalink": "/r/wallstreetbets/comments/gm9211/what_are_your_moves_tomorrow_may_19_2020/fr2fkhq/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1589865218.0
    },
    {
        "author": "Arcanosaur",
        "body": "Today in US History \n\n5/4/2020\n\n- Nasdaq climbed 1.2% supported by strong gains in big tech stocks \n\n- Shares of Tesla jumped more than 8% and Elon Musk appears to have listed two of his mansions for sale on Zillow following last week’s announcement that he doesn’t want any possessions or houses\n\n- Apple borrows $8.5 billion, joins record corporate debt borrowing spree\n\n- The U.S. Treasury Department plans to borrow nearly $3 trillion between April and June to bankroll the federal response to the coronavirus pandemic\n\n- Over 1.2 million coronavirus cases and just under 70,000 deaths \n\n- New models forecast 200,000 daily cases by the end of the month and a daily death toll of 3,000 by June 1st\n\n- U.S. Treasury Secretary Mnuchin says Trump is focused on tax changes to help businesses and the administration is ready to back additional stimulus money if needed \n\n- A flotilla of Saudi tankers loaded with crude oil has begun arriving on the U.S. Gulf Coast, worrying American shale producers who face uncertainty because of an oversupply of oil\n\n- Tyson says nation’s pork production is down 50%, despite Trump’s order to keep meat plants open\n\n- Global effort to raise $8B for coronavirus vaccine won’t include US, Russia\n\n- Dow futures rise 100 points in overnight trading as investors focus on reopening of economy",
        "created_utc": 1588640542,
        "id": "fpigp89",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fpigp89/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588669342.0
    },
    {
        "author": "freethereddit",
        "body": "Current Positions:\n\nTSLA 20 Shares\n\nAAPL 10 Shares\n\nBA 210 Shares\n\nSTWD 390 Shares\n\nEverything else, CASH",
        "created_utc": 1589512102,
        "id": "fqocd0z",
        "permalink": "/r/wallstreetbets/comments/gk12el/ok_this_time_cash_gang/fqocd0z/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1589540902.0
    },
    {
        "author": "btoned",
        "body": "Some really insightful shit from Motley Fool; if you guys are unsure of what to invest in they recommend Apple and Amazon. \n\nVery interesting picks.👌",
        "created_utc": 1589046306,
        "id": "fq1jvni",
        "permalink": "/r/wallstreetbets/comments/gg0k2r/weekend_discussion_thread_for_the_weekend_of_may/fq1jvni/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1589075106.0
    },
    {
        "author": "drewthegoat3",
        "body": "Gf went thru my phone and kicked me out the apartment, 2 hour drive home so I’m sleeping in the car. Just charged my phone and it’s already at 20%. AAPL is still too high imo",
        "created_utc": 1590553456,
        "id": "fry3c7c",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/fry3c7c/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1590582256.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Wasn’t the 2000 tech bubble fueled by shitty companies with no profitability? \n\nAmazon, Microsoft, google, Facebook, Apple are fucking cash generating big dick monsters. Not comparable at all",
        "created_utc": 1589249350,
        "id": "fqc3hph",
        "permalink": "/r/wallstreetbets/comments/ghvey0/what_are_your_moves_tomorrow_may_12_2020/fqc3hph/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1589278150.0
    },
    {
        "author": "PappleD",
        "body": "There’s something rotten going on. Apple, Facebook, Netflix, Microsoft, amazon are all at or near ATHs. Meanwhile, Main Street and overall economy is suffering worst depression since the 30s. I hear the sound of pitchforks sharpening...",
        "created_utc": 1588786566,
        "id": "fpolmoh",
        "permalink": "/r/wallstreetbets/comments/gehav8/daily_discussion_thread_for_may_06_2020/fpolmoh/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588815366.0
    },
    {
        "author": "WinXP001",
        "body": "I remember the old days when I would research industries to invest in that would lead the world in new technology, like someone buying apple shares in the 80s. Never thought I'd be gambling options. What a degenerate boomer i used to be",
        "created_utc": 1589348365,
        "id": "fqgk212",
        "permalink": "/r/wallstreetbets/comments/gij7tq/what_are_your_moves_tomorrow_may_13_2020/fqgk212/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1589377165.0
    },
    {
        "author": "HaydenMann",
        "body": "why I didn't buy puts. SPX gapped down and tested 2800 but held.. So bulls came in and defended this area.. Next level is 2822... tested a few times and failed and dipped to 2808 around 10:15 am pst.. It didn't break 2800 and eventually climbed back up to 2822.. Then I looked at BA AAPL NVDA- 3 diff stocks - airplane manufacturer/aerospace stock/tech/semiconductor  all 3 held key support levels so if these 3 hold and SPX held key levels. It implies the market may not go lower(yet) So once you come to the conclusion that the market may not break lower.. You assess and look at which stocks are out performing today.. You have NFLX,NOW,ROKU,TSLA, and others..you just have to pick a strong stock and trade it based on your plan/strategy etc. \n\ndont trust my TA unless you’re also retarded",
        "created_utc": 1588647070,
        "id": "fpirh2u",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fpirh2u/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588675870.0
    },
    {
        "author": "BestNarcissist",
        "body": "Are the big boys actually trying to crash the market?\n\nAmazon says all Q2 profit will be spent on 'Rona mitigation, Apple declines to offer guidance, Boeing refuses a bailout, Elon admits that Tesla stock is too high, Donny threatens Trade War II: Nuclear Boogaloo.\n\nCould mega-caps and billionaires benefit from a second leg down?",
        "created_utc": 1588370712,
        "id": "fp7hhku",
        "permalink": "/r/wallstreetbets/comments/gbpcs2/weekend_discussion_thread_for_the_weekend_of_may/fp7hhku/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588399512.0
    },
    {
        "author": "goldman-sux",
        "body": "Sound logic, but you know what makes even more sense? Not buying a shitty Fitbit and just buying Apple Watches instead\n\n$AAPL Calls",
        "created_utc": 1589314592,
        "id": "fqew5zf",
        "permalink": "/r/wallstreetbets/comments/gijbux/dd_on_exercising_and_fitness/fqew5zf/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1589343392.0
    },
    {
        "author": "Marnsy16",
        "body": "#Dating me rn is like investing in Apple 20 years ago.\n\nMy tinder pickup line always works lol",
        "created_utc": 1590460598,
        "id": "frtyg7t",
        "permalink": "/r/wallstreetbets/comments/gqi8ye/what_are_your_moves_tomorrow_may_26_2020/frtyg7t/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1590489398.0
    },
    {
        "author": "inlandempirestartup",
        "body": "If you buy puts, it will go up. If you buy calls, it will go down. If you strangle it, it will bounce between the two strikes. If you straddle it, it will settle a cent or two above your call strike price and you’ll be assigned your shares at a penny discount but the stonk will go down before you can sell it. You’ll decide to run the wheel and sell calls but the losses are greater than your gains. You’ll baghold and the company will claim bankruptcy. Once they claim bankruptcy, they will inevitably wipe out shareholders, you included, so you sell your shares to try and yolo your way back with whatever you have left. When they re-emerge from bankruptcy, they will pay a special dividend to the previous shareholders but you won’t get it because you sold prior to the hold date. Your wife will leave her boyfriend for a man that’s more manly that he could ever be. You’ll jerk off your wife’s ex while you both watch her fuck her new boyfriend. She’ll get pregnant, have the baby, go out for a pack of cigarettes, never come back, divorce you, make you pay alimony AND child support even though you have full custody, just not in the courts eyes. You’ll raise the child, his first words will be “dada”, you’ll teach him to walk, ride a bicycle, throw a baseball, how to ask a girl out, teach him to shave, tie a tie, he will excel in his studies, go to Harvard, graduate at the top of his class. The child, now a man, got an internship after college at Twitter (TWTR) and worked his way up to become CEO, he reorganized the company and it excels beyond your wildest imagination. Every move he makes has the midias touch, he will be featured on every financial news outlet, you’ll see his face plastered all over wall street and main street. Your Tendy alert goes off every day, like clockwork, showing that TWTR has increased more than 5% for the day (it never goes down), the stonk will eclipse the values of Apple, Microsoft and Amazon with retard strength even when the financials don’t make sense. You’ll be proud and everyone around you, no matter where you are, will constantly praise you for his success (which is your success). You alone raised him and he grew up to be everything you wanted, but could never, be. He has always loved you unconditionally, but, since you secretly despised him, you never bought calls, only puts. What I’m trying to say is, buy puts.",
        "created_utc": 1590646859,
        "id": "fs29xnl",
        "permalink": "/r/wallstreetbets/comments/gs0t73/twtr_puts/fs29xnl/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1590675659.0
    },
    {
        "author": "27onfire",
        "body": "If you needed AAPL to break 320 to breakeven you have bigger problems.",
        "created_utc": 1590535657,
        "id": "frx9oki",
        "permalink": "/r/wallstreetbets/comments/gr4jqs/what_are_your_moves_tomorrow_may_27_2020/frx9oki/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1590564457.0
    },
    {
        "author": "Baraxton",
        "body": "Apple is $17 off their all time highs.\nFacebook is $12 off their all time highs.\nMicrosoft is $10 off their all time highs. \nNetflix is at all time highs. \nAmazon is $80 off their all time highs. \n\nThe Nasdaq is a mere 5% off all time highs. \n\nThe S&amp;P500 is only 13% off all time highs.\n\nThe market is not pricing in the risks that exist, just as it ignored the pandemic risk in January and February. \n\nMarket will find new lows by October as reality sets in.",
        "created_utc": 1588985723,
        "id": "fpxn6e1",
        "permalink": "/r/StockMarket/comments/gfxwfd/us_unemployment_at_147_worst_since_the_great/fpxn6e1/",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1589014523.0
    },
    {
        "author": "Give_me_an_M3",
        "body": "Rioters don't matter lol. Not a single one of the people can afford a share of AAPL",
        "created_utc": 1590886318,
        "id": "fsdigkz",
        "permalink": "/r/wallstreetbets/comments/gt08v2/weekend_discussion_thread_for_the_weekend_of_may/fsdigkz/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1590915118.0
    },
    {
        "author": "visvya",
        "body": "Warren Buffet may talk about how everything's overvalued at the annual shareholder meeting on 5/2. Could lead to a week long downturn just like Goldman's downgrade of Apple.",
        "created_utc": 1588385680,
        "id": "fp87sqk",
        "permalink": "/r/wallstreetbets/comments/gbxvig/what_makes_you_guys_think_next_week_will_be_red/fp87sqk/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588414480.0
    },
    {
        "author": "caedin8",
        "body": "What you are missing is NVDA's economic moat in the machine learning world. \n\nAll the software runs on CUDA. The software stack that enables the AI revolution is what is going to put NVDA products in every data center for the ongoing future.\n\nI am a machine learning engineer and everything I use runs on CUDA. Being the backbone behind the AI revolution over the next 10 years is going to be extremely profitable for NVDA, just like the Windows OS made Microsoft the biggest home computer company, and iOS made Apple the biggest phone company.",
        "created_utc": 1589758860,
        "id": "fqz2ql2",
        "permalink": "/r/stocks/comments/gln51p/nvidia_know_what_you_own/fqz2ql2/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1589787660.0
    },
    {
        "author": "TeetsMcGeets23",
        "body": "Or one man’s investment is another man’s investment is another man’s investment is another man’s investment, etc. \n\nIf there is a group of people/corporations that don’t have a need for actual capital assets and have their operating expenses covered, and are basically in a long circle jerk of investment into each other’s companies that don’t actually need money, eventually, it may hit an end point such as Apple, who choose to sit on it. If we continue to inject money into this circle jerk to keep pushing their investment prices up we aren’t really doing much but inflating their stock value. \n\nThat is why the velocity of money is decreasing. There are end-points in our economy where growth is redundant and a stopping point makes logical strategic sense, so they can wait for the next ubiquitous opportunity which will require a massive amount of capital (such as an M&amp;A.)",
        "created_utc": 1589918833,
        "id": "fr62mky",
        "permalink": "/r/investing/comments/gmqvmt/us_money_supply_is_approaching_5_trillion_dollars/fr62mky/",
        "score": 12,
        "subreddit": "investing",
        "created": 1589947633.0
    },
    {
        "author": "commiehedhehog",
        "body": "That Adam’s Apple is the size of my fist",
        "created_utc": 1590554626,
        "id": "fry4z89",
        "permalink": "/r/wallstreetbets/comments/grcv3r/fox_news_calling_you_retards_out_fuck_you_gay/fry4z89/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1590583426.0
    },
    {
        "author": "FinisherJP",
        "body": "Biggest unemployment number on record.....mehhh\n\nApple opening stores......wooot wooot!!!!\n\nLiterally the market now....this shit is a fucking lunatic that’s it scary to come close to for now",
        "created_utc": 1588969246,
        "id": "fpwsno7",
        "permalink": "/r/wallstreetbets/comments/gg0k2r/weekend_discussion_thread_for_the_weekend_of_may/fpwsno7/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588998046.0
    },
    {
        "author": "PMmeGRILLEDCHEESES",
        "body": "my wife's older brother, who knows absolutely nothing about finance or the stock market, just sent her $50 of Apple stock on something called stockpile for her birthday.\n\nthis is the top.",
        "created_utc": 1588700648,
        "id": "fpkt9n3",
        "permalink": "/r/wallstreetbets/comments/gdv4qs/daily_discussion_thread_for_may_05_2020/fpkt9n3/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588729448.0
    },
    {
        "author": "joey_minaj",
        "body": "Made the mistake of typing “AAPL” in twitter search. Everyone busting out their finest mechanical pencils from their pocket protectors to draw lines on charts like everyone didn’t just take a shit at the exact same time today.",
        "created_utc": 1589333381,
        "id": "fqfx0uy",
        "permalink": "/r/wallstreetbets/comments/gij7tq/what_are_your_moves_tomorrow_may_13_2020/fqfx0uy/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1589362181.0
    },
    {
        "author": "Anowoz",
        "body": "Rule numba  1️⃣ of trading:\n\n\n\n\n\nNever bet against $TIM APPLE 🍎 \n\n\n\n\n\nNever bet against $BECKY 💅\n\n\n\n\n\nNever bet against $THE MOUSE 🐭 \n\n\n\n\n\nNever bet against $MEME STOCKS 🚀\n\n\n\n\n\nNever bet against $AMERICA 🇺🇸\n\n\n\n\n\nTL;DR: JUST BUY CALLS 🤑",
        "created_utc": 1589250730,
        "id": "fqc5tw0",
        "permalink": "/r/wallstreetbets/comments/ghvey0/what_are_your_moves_tomorrow_may_12_2020/fqc5tw0/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1589279530.0
    },
    {
        "author": "trevandezz",
        "body": "........I mean maybe lol. Like if Apple or Google paid me $8,000,000 to pump their stock. So if you see me decked out in Apple gear soon you know what’s up",
        "created_utc": 1589833693,
        "id": "fr29zsw",
        "permalink": "/r/pennystocks/comments/gm8zg5/full_transparency_two_companies_have_reached_out/fr29zsw/",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1589862493.0
    },
    {
        "author": "-casper-",
        "body": "Yup this is the reason.\n\nAnd 20% weighted being: Microsoft (5.6%), Apple (5.2%), Amazon (4.2%), Google (3.7%), Facebook (1.62%)\n\n&amp;#x200B;\n\nA few of the harder hit companies in S&amp;P 500 and their weights:\n\nKohls (0.002%)\n\nUnder Armour (.013%)\n\nAlaska Air (.014%)\n\nNorwegian cruise (.01%)\n\nAmerican Airlines (.015%)\n\n&amp;#x200B;\n\nTo be fair, Berkshire (1.42%), VISA (1.3%), JP Morgan (1.19%), and Mastercard (1.03%) have been hit pretty hard",
        "created_utc": 1589062946,
        "id": "fq34l3l",
        "permalink": "/r/investing/comments/ggjwdo/canada_loses_record_20_million_jobs_in_april/fq34l3l/",
        "score": 11,
        "subreddit": "investing",
        "created": 1589091746.0
    },
    {
        "author": "TenMegaFarads",
        "body": "I took the Robintrack most popular (http://robintrack.net/leaderboard) and put the numbers in a spreadsheet, and multiplied by current stock price.\n\nAMZN is far and away the most-invested in by dollar amount, with RH users holding $377.08 million in shares.\n\nTSLA and AAPL are the only others over $100 million, with $174m and $112m respectively.\n\nMSFT, DIS, and NFLX are next with $79m, $59m, and $51m. Things then start to drop off quickly: FB $41m, BABA $37m, BA $34m, SBUX $14m, and AMD $11m are the only others above the $10m mark.\n\nThe #1 and 2 by number of shares, F and GE, are way down the list by dollar amount at 27th and 28th.",
        "created_utc": 1589751701,
        "id": "fqyo05p",
        "permalink": "/r/wallstreetbets/comments/glmbkl/what_are_your_moves_tomorrow_may_18_2020/fqyo05p/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589780501.0
    },
    {
        "author": "Mvpalldayy",
        "body": "F to pay respects to the legend who sold $107K worth of AAPL 305C for a -$70K loss at 10am this morning. May his paper hands go down in history.",
        "created_utc": 1589567799,
        "id": "fqqlvnm",
        "permalink": "/r/wallstreetbets/comments/gk6goa/daily_discussion_thread_for_may_15_2020/fqqlvnm/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589596599.0
    },
    {
        "author": "jvisagod",
        "body": "If dividends are your goal then you need to move that Apple fortune into some better payouts.",
        "created_utc": 1590129317,
        "id": "frfb0yo",
        "permalink": "/r/RobinHood/comments/godq7p/building_my_dividend_portfolio/frfb0yo/",
        "score": 11,
        "subreddit": "RobinHood",
        "created": 1590158117.0
    },
    {
        "author": "chiefhazyroom",
        "body": "Short FB not apple",
        "created_utc": 1589239095,
        "id": "fqbl9ew",
        "permalink": "/r/wallstreetbets/comments/ghywk3/shorting_aapl_into_q2/fqbl9ew/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589267895.0
    },
    {
        "author": "GourmetFilet",
        "body": "Just got an Apple Watch. Lmao you can actually track SPY on your watch face. Amazing!!!!! \n\nTotally worth it just for that.\n\nEdit: \n\nFor those that asked: https://imgur.com/a/9UDH34f\n\nI had to re download the standard the “Stocks” app from the App Store. I must have deleted it when I got my iPhone. \n\nThen you can use the stocks on your watchlist for that app as a complication on the infograph watchface",
        "created_utc": 1589420929,
        "id": "fqk67my",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqk67my/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589449729.0
    },
    {
        "author": "stejerd",
        "body": "Treat it like a tabloid unless you want to find out how much your AAPL stock would be worth if you bought shares in 2001!!!",
        "created_utc": 1588899138,
        "id": "fptvksg",
        "permalink": "/r/wallstreetbets/comments/gfj4er/motley_fool_how_much_stock_do_should_i_put_on/fptvksg/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1588927938.0
    },
    {
        "author": "shutupstephenA",
        "body": "Poor people pay mortgages and rent. Guess who buys consumer goods? Poor people. Pulled the 12-18 month estimate out of your ass. You literally have no idea what you’re talking about. “Poor people” make up the incredible majority of the consuming public. No one will want to own Apple/Uber/Microsoft etc when people aren’t buying their products because they don’t even have enough money to pay for where they live. Wait until the negative interest rates hit, mortgage forbearance is over, stimulus money is spent, and small businesses shut down because their relief/ loan money didn’t cut it. You talk as if the president has the final say on the strength of the stock market, which is so wildly near-sighted. This reasoning is fucking retarded. But whatever, as it proliferates, the potential for profit just increases, so keep it up.",
        "created_utc": 1588976992,
        "id": "fpx77lo",
        "permalink": "/r/wallstreetbets/comments/gfxnov/unemployment_rate_vs_the_nasdaq_unemployment_the/fpx77lo/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589005792.0
    },
    {
        "author": "Extension-appeal",
        "body": "I gotta start actually looking at the girls that I swipe right for. So far I’ve matched with a bunch of fat chicks and a couple trannies. AAPL $350 5/18",
        "created_utc": 1589162188,
        "id": "fq8b1zj",
        "permalink": "/r/wallstreetbets/comments/gh8iga/what_are_your_moves_tomorrow_may_11_2020/fq8b1zj/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589190988.0
    },
    {
        "author": "ottermodee",
        "body": "Wonder how salty the -107k AAPL guy is right now.",
        "created_utc": 1589821473,
        "id": "fr1kul8",
        "permalink": "/r/wallstreetbets/comments/glyucu/daily_discussion_thread_for_may_18_2020/fr1kul8/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589850273.0
    },
    {
        "author": "needlestack",
        "body": "The comment you're replying to didn't claim anything innovative, and Apple doesn't have to do anything innovative to continue to grow market share, income, and profits. I think they are likely to do all three even with incremental upgrades for the next decade. Few companies ever do anything as innovative as Apple did in the past and yet they can still run highly profitable businesses. There's no benefit in judging them against an impossible standard.",
        "created_utc": 1590087656,
        "id": "frdcttu",
        "permalink": "/r/investing/comments/gnw10h/weekly_jobless_claims_rose_2438_million_vs_24/frdcttu/",
        "score": 11,
        "subreddit": "investing",
        "created": 1590116456.0
    },
    {
        "author": "RoopLoops",
        "body": "i dont go deep OTM. with all this volatility, ive been buying MSFT and AAPL calls 2 - 3 weeks out, and 1 or 2 strike prices OTM, with only a 2K portfolio, I made 1K today.",
        "created_utc": 1589233261,
        "id": "fqba4zp",
        "permalink": "/r/options/comments/ghw905/do_you_guys_play_with_otm_options_and_been/fqba4zp/",
        "score": 11,
        "subreddit": "options",
        "created": 1589262061.0
    },
    {
        "author": "psiguy686",
        "body": "AAPL opening 25 stores this week. I’m all in, including liquidating all household items and property. Remember when they re-opened 4 stores? I can’t get enough money into 5/29 325c.",
        "created_utc": 1589760652,
        "id": "fqz63gm",
        "permalink": "/r/wallstreetbets/comments/glmbkl/what_are_your_moves_tomorrow_may_18_2020/fqz63gm/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1589789452.0
    },
    {
        "author": "gigantoir",
        "body": "bears be like: “damn wish i went long on shop at 350 or aapl at 220”\n\nthen bears be like: “WHY THE FUCK ARE PEOPLE BUYING THE DIP”",
        "created_utc": 1589495116,
        "id": "fqnhuab",
        "permalink": "/r/wallstreetbets/comments/gjtxjd/what_are_your_moves_tomorrow_may_15_2020/fqnhuab/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1589523916.0
    },
    {
        "author": "BlueKnightJoe",
        "body": "This market with tech stocks is just like how I am raising my autistic toddler.  \n\n\nShe doesn't have to do much to impress me. If she shits in the potty instead of shitting her pants, I will clap and cheer!  \n\n\nAll Apple has to do to deserve ATH is to reopen their fucking stores. All Google has to do is reopen their offices at 10% capacity. You did it companies! You didn't completely die from coronavirus so therefore you deserve ATH valuations.",
        "created_utc": 1588965461,
        "id": "fpwlaz3",
        "permalink": "/r/wallstreetbets/comments/gfqjq5/daily_discussion_thread_for_may_08_2020/fpwlaz3/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588994261.0
    },
    {
        "author": "somanychins",
        "body": "Kinda feeling bummed right now that I probably didn’t buy enough puts on Friday. You would think the covid crash was one of those once in a lifetime opportunities, but I think we are going to get another bite at that apple. \n\nCommercial real estate debt about to blow up the financial sector (they don’t buy from Fanny and Freddie), energy industry a dick’s pimple away from implosion, and the great unemployment halting a big chunk of the 401k auto-buying that’s dragged market multiples to their current heights. Add to that an overbought market, and this is going to be like a bobsled run to SPY 235.",
        "created_utc": 1589680894,
        "id": "fqvnam6",
        "permalink": "/r/wallstreetbets/comments/gkggr4/weekend_discussion_thread_for_the_weekend_of_may/fqvnam6/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1589709694.0
    },
    {
        "author": "Jaypalm",
        "body": "Man I wish he would! No support for Apple Watch as a Bluetooth key is frustrating when your phone dies.",
        "created_utc": 1590965386,
        "id": "fsgvgqh",
        "permalink": "/r/wallstreetbets/comments/gu33hw/insider_trading_tips/fsgvgqh/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1590994186.0
    },
    {
        "author": "uninfinity",
        "body": "***Apple (AAPL) is to reopen retail stores in Australia on May 7th***\n\n***Mainland China reports 1 additional coronavirus case and 0 addtitional deaths on May 4th vs. 1 additional case and 0 deaths on May 3rd***\n\n***WSJ writes that senior Trump aides ease up on China pressure with officials signalling there will not be any economic punishment for China if it sticks to the trade agreement made in January***\n\n*Pump*",
        "created_utc": 1588637212,
        "id": "fpiazle",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fpiazle/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588666012.0
    },
    {
        "author": "dishdasher",
        "body": "Whatever you do, do not buy weeklies ot 0-2 Day to expiry options. Get some deep in the money boeing, aapl, amazon, fb, gild calls. Put exactly 15% in uvxy calls.\n\nIf you just want to trade index calls, buy deep in the money Jan 2021 SPX calls and 20% Oct/Nov UVXY calls. If the market does go down as retards like me expect, coin the UVXY calls which will keep you green and then ride the rest.\n\nI only give advice like this. As soon as I deposit money, I yolo it in weekly or same day expiry puts. So, take my advice with a grain of salt. I am a masochist.",
        "created_utc": 1590201090,
        "id": "frii6s6",
        "permalink": "/r/wallstreetbets/comments/gowobs/how_would_you_invest_100000_right_now/frii6s6/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1590229890.0
    },
    {
        "author": "skysblues",
        "body": "The 30 mil unemployed are anxiously looking forward to buying an overpriced apple product from one of their stores located in a mall near you",
        "created_utc": 1588991138,
        "id": "fpxwpz8",
        "permalink": "/r/wallstreetbets/comments/gg0k2r/weekend_discussion_thread_for_the_weekend_of_may/fpxwpz8/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1589019938.0
    },
    {
        "author": "toookoool",
        "body": "This. People cannot compare Moderna to Apple or Tesla. Those companies are making money. Moderna is not.",
        "created_utc": 1590514441,
        "id": "frw2tvk",
        "permalink": "/r/stocks/comments/gr129z/i_mistakenly_bought_moderna_when_it_spiked_should/frw2tvk/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1590543241.0
    },
    {
        "author": "BennyFlocka",
        "body": "What’s FAGMAN going to do this week (FB, AMZN, GOOG, MSFT, AAPL, NFLX)?",
        "created_utc": 1588542402,
        "id": "fpe8dq8",
        "permalink": "/r/wallstreetbets/comments/gcx8rv/what_are_your_moves_tomorrow_may_04_2020/fpe8dq8/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588571202.0
    },
    {
        "author": "kiwiatv",
        "body": "Pretty sure my 2 year old is showing red flags for autism.\n\nGood to know the apple doesn’t fall far from the tree.",
        "created_utc": 1588632217,
        "id": "fpi27of",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fpi27of/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588661017.0
    },
    {
        "author": "CptGusMcCrae",
        "body": "Bone apple tea",
        "created_utc": 1589748854,
        "id": "fqyhwr6",
        "permalink": "/r/wallstreetbets/comments/glmbkl/what_are_your_moves_tomorrow_may_18_2020/fqyhwr6/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1589777654.0
    },
    {
        "author": "Droidvoid",
        "body": "Long AAPL. Everybody is buying AirPods pros to not look poor while on webcam.",
        "created_utc": 1590173951,
        "id": "frh5le0",
        "permalink": "/r/wallstreetbets/comments/gogpfy/daily_discussion_thread_for_may_22_2020/frh5le0/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1590202751.0
    },
    {
        "author": "PIBPIP",
        "body": "This is true; but it’s actually not just inflation. The real idea here is that Apple can potentially earn better returns with that cash than the interest rate on the debt.",
        "created_utc": 1588633690,
        "id": "fpi4uis",
        "permalink": "/r/wallstreetbets/comments/gdktgg/apple_borrows_85_billion_joins_record_corporate/fpi4uis/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588662490.0
    },
    {
        "author": "SweetJackal",
        "body": "To put it simply, you are thinking that a dollar is worth a dollar, which is wrong.  A dollar is worth what you can trade for it.\n\nIf we look back into 2017 and 2019 territory we see a strong market, an economy marked by low unemployment and high demand for skilled labor while also increasing GDP, and strong fundamentals from the stars of the market with improving metrics in the lower ends.  In short, a reflection of a golden age for the market that had built up over time.\n\nYet, though the economy is shot and those strong fundamentals are now taking on water, that the gold has turned to lead, the prices are once again high.\n\nThe value of the stocks themselves aren't as high as they were before rather the money you are trading with doesn't have the same value in the market itself.  Central banks buying up high risk assets (junk bonds, corporate bonds, ETFs, at risk mortgages) combined with the restriction on discretionary spending from the closure of entertainment centers driving gamblers into the stock market, the collapse of the bond attraction from Trump promoting negative rates and negate rates appearing on the global scale, and the investors following the federal example of Stonks Only Go Up is pushing a multiple of the spending into the stock exchanges, driving up demand for these equities.\n\nThe value of Apple today is less than what it was years ago, however it's price had recovered because the value of the dollar it is compared against has tanked within the perception driven pocket reality of the exchanges.  This is what economists are talking about when they say these are becoming fake markets, they are acting independent of the governing factors of the economy, the market, and the underlying backing due to outside intervention manipulating the exchange.\n\nIn the short term the damage to the economy will likely cause deflation in the consumer markets regardless of the money dumps into the exchanges but if a correction or stagnation isn't experienced to allow the consumer markets to recover to the same level then we will experience aggressive inflation in the consumer markets in the long term that will dramatically outpace wage increases due to selling of exchange assets moving the money from the exchanges into the consumer markets.\n\nTLDR: I am a literal autist, and things only make sense if you realize that it isn't that a cup of coffee is worth a dollar, it is that a dollar is only worth a cup of coffee.  And tomorrow a dollar will be worth less than a cup of coffee.",
        "created_utc": 1590549338,
        "id": "frxx69n",
        "permalink": "/r/wallstreetbets/comments/grbd4o/trying_to_understand_the_bulls/frxx69n/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1590578138.0
    },
    {
        "author": "Fujit0ra",
        "body": "This is JPow dangling a trout in front of bears before he throws it into a ditch and they chase only to realize they are now in a meat grinder and SPY is up 7% on a cure from Apple. 5G can actually cure covid and aids. Steve Jobs died for you sins.",
        "created_utc": 1590123013,
        "id": "frf3aop",
        "permalink": "/r/wallstreetbets/comments/go46ep/what_are_your_moves_tomorrow_may_22_2020/frf3aop/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1590151813.0
    },
    {
        "author": "sethette",
        "body": "25 apple stores are opening tomorrow. if you want a new iphone you have to submit to a dna test and an anal probe.",
        "created_utc": 1589780900,
        "id": "fr01d6m",
        "permalink": "/r/wallstreetbets/comments/glmbkl/what_are_your_moves_tomorrow_may_18_2020/fr01d6m/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589809700.0
    },
    {
        "author": "100_PERCENT_BRKB",
        "body": "Ted Weschler is primarily a tech investor. Look at his history\n\nBerkshire owns more than $45 billion dollars of Apple (AAPL) at $141 per share. It also owns a tenth of 1% of AMZN (over a billion dollars worth)\n\nBerkshire owns 10% of BYD, the big chinese lithium ion battery (and electric vehicle company) that competes with CATL and Tesla\n\nBerkshire is a conglomerate and its three largest companies are, in decreasing order of size:\n\n1. Burlington Northern railroad,\n\n2. BH Energy, a huge power generation/transmission conglomerate with millions of customers and some of the largest wind and solar power power plants in the world (powering Facebook and Google data centers, for example),\n\n3. Apple, maker of iPhone, etc.",
        "created_utc": 1588354017,
        "id": "fp6kqom",
        "permalink": "/r/investing/comments/gbkmc7/berkshire_hathaway_with_a_portfolio_of_value/fp6kqom/",
        "score": 9,
        "subreddit": "investing",
        "created": 1588382817.0
    },
    {
        "author": "mcdoty",
        "body": "I see an Apple. All in Apple calls on Monday",
        "created_utc": 1588968565,
        "id": "fpwrcxs",
        "permalink": "/r/wallstreetbets/comments/gg0k2r/weekend_discussion_thread_for_the_weekend_of_may/fpwrcxs/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588997365.0
    },
    {
        "author": "GourmetFilet",
        "body": "I don’t even like hard rock/metal, but I found the doom soundtrack on Apple Music. Shit adds another level to trading holy fuck. \n\nI’m revvvvvedddd all the way the fuck up right now",
        "created_utc": 1589904962,
        "id": "fr59qzb",
        "permalink": "/r/wallstreetbets/comments/gmlsuw/daily_discussion_thread_for_may_19_2020/fr59qzb/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589933762.0
    },
    {
        "author": "TheManicCoder",
        "body": "Dammit. And here I bought a bunch of AAPL puts this morning instead of FB calls. \n\nGood stuff! I'll hop on the next train.",
        "created_utc": 1589910574,
        "id": "fr5lmck",
        "permalink": "/r/wallstreetbets/comments/gmtelj/lol_fb_today/fr5lmck/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589939374.0
    },
    {
        "author": "choose_a_use",
        "body": "Lmao and people were shorting AAPL. Only 5% away from ATH bitches",
        "created_utc": 1588980264,
        "id": "fpxd0l2",
        "permalink": "/r/wallstreetbets/comments/gg0k2r/weekend_discussion_thread_for_the_weekend_of_may/fpxd0l2/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589009064.0
    },
    {
        "author": "zangor",
        "body": "I mean cmon.  AAPL at 310.  They've gotta hit eventually...\n\nHaha...right...**RIGHT**?!?",
        "created_utc": 1589166461,
        "id": "fq8hq62",
        "permalink": "/r/wallstreetbets/comments/ghc8oi/rip/fq8hq62/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589195261.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "I HEAR PEOPLE CHEERING OUTSIDE !! And sirens \n\nHow they know I had APPLE$ and AMD$ calls \n\n???",
        "created_utc": 1589238119,
        "id": "fqbjg8z",
        "permalink": "/r/wallstreetbets/comments/ghvey0/what_are_your_moves_tomorrow_may_12_2020/fqbjg8z/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589266919.0
    },
    {
        "author": "Dreadpiratemarc",
        "body": "How many of the original DJIA are still in business?  I think it's maybe just GE and ATT.  All the rest, industry giants in their day, have dissolved.  Businesses like everything else have a life cycle.  \n\nHow many of the tech darlings popular with amature investors do you think will still be a good investment in 30 years?  Microsoft and Apple might or might not.  But Facebook?  Netflix?  Definitely not.  Amazon will probably be around but it will be more like Walmart is today, struggling to find growth in a saturated market and facing disruptors of its own.",
        "created_utc": 1589330000,
        "id": "fqfqzz6",
        "permalink": "/r/StockMarket/comments/gic6o6/young_investors_pile_into_stocks_seeing/fqfqzz6/",
        "score": 9,
        "subreddit": "StockMarket",
        "created": 1589358800.0
    }
]