[
    {
        "author": "Ohhstfu",
        "body": "Now to 140k!! You got this",
        "created_utc": 1595593698,
        "id": "fz31d60",
        "permalink": "/r/wallstreetbets/comments/hx0nol/10k_1k_70k_2k/fz31d60/",
        "score": 2232,
        "subreddit": "wallstreetbets",
        "created": 1595622498.0
    },
    {
        "author": "Volcomstone1669",
        "body": "Now - YOLO it all on TSLA C 4000 And you'll be a true autist",
        "created_utc": 1595858568,
        "id": "fzekpd1",
        "permalink": "/r/wallstreetbets/comments/hyss5w/1m_in_gold_gains/fzekpd1/",
        "score": 715,
        "subreddit": "wallstreetbets",
        "created": 1595887368.0
    },
    {
        "author": "WrongPurpose",
        "body": "Did you just made 1.2 million because Intel shit the bed? Congrats, now cash out and retire before you loose it all.",
        "created_utc": 1595601172,
        "id": "fz3dy1g",
        "permalink": "/r/wallstreetbets/comments/hx2h2b/new_high_score_thanks_amd/fz3dy1g/",
        "score": 709,
        "subreddit": "wallstreetbets",
        "created": 1595629972.0
    },
    {
        "author": "rotofyaldabaoth",
        "body": "ok im bullish on hertz now",
        "created_utc": 1595305663,
        "id": "fyqgnt5",
        "permalink": "/r/wallstreetbets/comments/hv0tsg/hertztard/fyqgnt5/",
        "score": 693,
        "subreddit": "wallstreetbets",
        "created": 1595334463.0
    },
    {
        "author": "TacticalYam",
        "body": "Great post. One thing you missed: he's not the CEO anymore. He stepped down so he has someone else to blame when the company goes to shit. He is the \"executive chairman\" now. Mark Russel is CEO.",
        "created_utc": 1595344241,
        "id": "fyrsrld",
        "permalink": "/r/wallstreetbets/comments/hv8fob/trevor_milton_is_likely_a_sociopath_you_heard_it/fyrsrld/",
        "score": 572,
        "subreddit": "wallstreetbets",
        "created": 1595373041.0
    },
    {
        "author": "247drip",
        "body": "Congratulations everyone. We are now all guilty of insider trading",
        "created_utc": 1595371235,
        "id": "fytc13r",
        "permalink": "/r/wallstreetbets/comments/hvh6ue/amzn_3800_call_cant_go_tits_up/fytc13r/",
        "score": 561,
        "subreddit": "wallstreetbets",
        "created": 1595400035.0
    },
    {
        "author": "skomes99",
        "body": "I just saw this on ft.com and laughed.\n\nIt was just this year the Slack CEO was laughing at Teams, and they sent Microsoft a joke card about being late to the party, but they're clearly worried now.",
        "created_utc": 1595430448,
        "id": "fyvmw47",
        "permalink": "/r/investing/comments/hvudoj/work_files_eu_competition_complaint_against_msft/fyvmw47/",
        "score": 441,
        "subreddit": "investing",
        "created": 1595459248.0
    },
    {
        "author": "righthnd",
        "body": "700B is a joke to what the fed is spending now lol",
        "created_utc": 1595843377,
        "id": "fze13h9",
        "permalink": "/r/wallstreetbets/comments/hyov07/remembering_the_fear_of_2008/fze13h9/",
        "score": 435,
        "subreddit": "wallstreetbets",
        "created": 1595872177.0
    },
    {
        "author": "vadimyuryev",
        "body": "IV Crush Explained:  \nBased on the state of the current market as a whole, and the state of the stock in question, the stock will have a certain % of Implied Volatility.  \nFor example, if the IV is 40%, this means that a year from today, the market expects that the current stock price will either be 40% higher than it is today, or 40% lower than it is today.\n\n  \nThat's why IV was very high for stocks during Coronavirus, because the market was volatile and nobody really knew what was gonna happen, so there was a chance for stock prices to move drastically either up or down.  \nAbout a couple of weeks or a month before the earnings of a stock, people start talking about how the company will perform on their earnings report. If everything has been chugging along normally, their Implied Volatility stays pretty low since nobody expects there to be a huge move in either direction.  \n\n\nNow in the case of Tesla, which is a meme stock (basically incredibly popular and in the news all the time), there are drastically varying opinions. Some people believe they will fail their earnings for Q2 and the stock will crash down to 1000 or less points.   \nSome people believe they will succeed and the stock price will jump to 2000 points.  \nBecause of these drastically varying opinions and controversy, the Implied Volatility goes up.   \n\n\nBecause IV goes up, more people buy into the stock thinking they could earn some nice tendies. This increases the demand for options, which in turn raises the premium fee of buying those options.  \n\n\nThe demand and premium price stays high right up until earnings, since people are expecting a huge move in the stock price. As soon as the earnings gets released, everyone knows the truth and they know if they were wrong or right. The stock price changes quickly in after earnings trading to reflect the earnings report.  \n\n\nThis instantly crushes the Implied Volatility since nobody expects the price the move drastically anymore, and this GREATLY reduces the premium price of the option you own, so you lost all of that extra value due to increased demand.   \n\n\nOn top of that, your option expires tomorrow and the extrinsic value of your option decayed over time. Tomorrow, the extrinsic value will be worthless, so all you will be left with is the difference in stock price and your strike price. If you're not above break even, you basically lost all of your money.",
        "created_utc": 1595523279,
        "id": "fyzvm2j",
        "permalink": "/r/wallstreetbets/comments/hwheds/bought_100k_in_tesla_724_calls_they_reported/fyzvm2j/",
        "score": 418,
        "subreddit": "wallstreetbets",
        "created": 1595552079.0
    },
    {
        "author": "IamMat",
        "body": "Here's what will happen and i will come back to this once earnings are released next week.\n\n&amp;#x200B;\n\n1) AMD will get pumped hard until earnings\n\n2) It will beat top and bottom but will dump, similar to microsoft.  This is our environment right now.",
        "created_utc": 1595543113,
        "id": "fz11pfn",
        "permalink": "/r/investing/comments/hwpfda/amd_up_8_as_intel_delays_nextgeneration_chips/fz11pfn/",
        "score": 410,
        "subreddit": "investing",
        "created": 1595571913.0
    },
    {
        "author": "snek-jazz",
        "body": "&gt; What do you all make of this?\n\nBitcoiner since 2013 here, it's just like all the other times, we had a blow off top at the end of 2018, then around 80% correction during bear market 1-2 years of slow recovery back to about 50% (we are here now) and the next bull market starts.\n\nWhen it passes the old ATH (20k) a new hype cycle starts and new users start piling in as FOMO reaches its peak.",
        "created_utc": 1595888803,
        "id": "fzgaxa9",
        "permalink": "/r/investing/comments/hz1zdi/bitcoin_just_passed_11000_9k_to_11k_in_2_days/fzgaxa9/",
        "score": 387,
        "subreddit": "investing",
        "created": 1595917603.0
    },
    {
        "author": "paincorp",
        "body": "I love how people keep realizing how bad of a situation airlines are in, like people haven’t been saying it for 4 months now.",
        "created_utc": 1595682370,
        "id": "fz6yn28",
        "permalink": "/r/investing/comments/hxk9f9/wont_united_air_go_bankrupt_what_am_i_missing/fz6yn28/",
        "score": 364,
        "subreddit": "investing",
        "created": 1595711170.0
    },
    {
        "author": "Jihelu",
        "body": "He’s out of prison now lmao",
        "created_utc": 1594766026,
        "id": "fy32z29",
        "permalink": "/r/wallstreetbets/comments/hrbalh/stock_market_of_2020/fy32z29/",
        "score": 336,
        "subreddit": "wallstreetbets",
        "created": 1594794826.0
    },
    {
        "author": "HighFrequencyAutist",
        "body": "Now THIS is pod racing.",
        "created_utc": 1595527128,
        "id": "fz046l3",
        "permalink": "/r/wallstreetbets/comments/hwkhc7/tsla_oof_not_quite_guh/fz046l3/",
        "score": 335,
        "subreddit": "wallstreetbets",
        "created": 1595555928.0
    },
    {
        "author": "xolican",
        "body": "That bear is 100% dead now, keep that in mind and buy calls.",
        "created_utc": 1595679343,
        "id": "fz6ux8c",
        "permalink": "/r/wallstreetbets/comments/hxkz6n/its_been_a_good_run_boys_spy_310p_aug21/fz6ux8c/",
        "score": 326,
        "subreddit": "wallstreetbets",
        "created": 1595708143.0
    },
    {
        "author": "Nanostrip",
        "body": "Dude seriously money comes and goes. There will always be money. It's just a number on a screen. We're all just sending electrons back and forth so we have something to kill the time. Has there been any real difference in your life over the past few days as that squiggly line has gone down? Probably not. There is a lot of time between now and the time you actually need that money. So turn off the screen, have a beer, rub one out, and come back Monday to start working on getting that squiggly line to go back up.",
        "created_utc": 1595631371,
        "id": "fz53r6t",
        "permalink": "/r/wallstreetbets/comments/hxbpb2/237k_im_out_panic_switch_position_didnt_help/fz53r6t/",
        "score": 318,
        "subreddit": "wallstreetbets",
        "created": 1595660171.0
    },
    {
        "author": "Unlucky-Prize",
        "body": "This needs to be flaired DD.\n\nEdit: was shitpost, but OP in their wisdom took feedback and changed to DD. Now everyone will take this as seriously as they should.",
        "created_utc": 1595801702,
        "id": "fzcfnvp",
        "permalink": "/r/wallstreetbets/comments/hyfzb0/monday_opening/fzcfnvp/",
        "score": 312,
        "subreddit": "wallstreetbets",
        "created": 1595830502.0
    },
    {
        "author": "xhtsk",
        "body": "So far 160 autists have sent money to the hacker, the value is around $38,650\n\nEdit - now 244 people have sent money now worth around $59,000",
        "created_utc": 1594845634,
        "id": "fy6lgks",
        "permalink": "/r/wallstreetbets/comments/hrvfer/tsla_puts_elons_twitter_got_hacked/fy6lgks/",
        "score": 290,
        "subreddit": "wallstreetbets",
        "created": 1594874434.0
    },
    {
        "author": "SeeSee300",
        "body": "Instructions unclear, I now own 100 shares of HTZ",
        "created_utc": 1595198549,
        "id": "fylpllx",
        "permalink": "/r/wallstreetbets/comments/hu9lu1/huge_loophole_to_guarantee_that_your_portfolio_is/fylpllx/",
        "score": 282,
        "subreddit": "wallstreetbets",
        "created": 1595227349.0
    },
    {
        "author": "thebabaghanoush",
        "body": "Now back to the daily $TSLA watch thread!",
        "created_utc": 1595894188,
        "id": "fzgl2j6",
        "permalink": "/r/investing/comments/hz1zdi/bitcoin_just_passed_11000_9k_to_11k_in_2_days/fzgl2j6/",
        "score": 282,
        "subreddit": "investing",
        "created": 1595922988.0
    },
    {
        "author": "MasterCookSwag",
        "body": "My working theory is that CNBC brings this guy on just so that they can generate the type of headlines that have significantly higher click rates when shared on Facebook/Twitter.\n\nHe's wealthy because of his early stake in FB, but Social Capital as an entity has not been particularly successful and is effectively an MFO now.  You wouldn't normally have someone like that on to offer commentary, unless you just wanted to run headlines about a VC manager saying these sorts of things that make for fantastic shares on social media.",
        "created_utc": 1595514590,
        "id": "fyze5pl",
        "permalink": "/r/investing/comments/hwgdlx/chamath_palihapitiya_teslas_push_toward_renewable/fyze5pl/",
        "score": 274,
        "subreddit": "investing",
        "created": 1595543390.0
    },
    {
        "author": "jcarmona24",
        "body": "yeah I read that it was over [$93k](https://blockchair.com/bitcoin/address/bc1qxy2kgdygjrsqtzq2n0yrf2493p83kkfjhx0wlh).  What a brilliant way to get $$ if you can hack Elon and safely get away with it.\n\nedit: also if they lowered the price on Elon's from $1k to like $100 I bet they would've made a lot more.  $57.4k was the peak I saw the account at.  Now at $49k so assuming hackers are moving BTC now.  \n\nedit 2:  NVM they are hacking a LOT more accounts. Uber and Kanye just got hit. Account up to $90k",
        "created_utc": 1594845659,
        "id": "fy6lidv",
        "permalink": "/r/investing/comments/hrvikc/twitter_down_after_hours_after_elon_musks_account/fy6lidv/",
        "score": 271,
        "subreddit": "investing",
        "created": 1594874459.0
    },
    {
        "author": "Panda_Pineapple",
        "body": "after working a second, part time job at a grocery store for months now, I’ve finally made back what I’ve lost in a single day trading options....\n\nLife well spent",
        "created_utc": 1595193218,
        "id": "fylfu8x",
        "permalink": "/r/wallstreetbets/comments/hu74gf/what_are_your_moves_tomorrow_july_20_2020/fylfu8x/",
        "score": 266,
        "subreddit": "wallstreetbets",
        "created": 1595222018.0
    },
    {
        "author": "decent-rimjob",
        "body": "I'm 33 and still live with mommy.\n\nGo fuck yourself\n\nbackstory: 2 years ago i was living in my car, mommy and daddy said if i could put the vodka down i could live with them in florida. i've been sober ever since but now i'm addicted to money",
        "created_utc": 1595177301,
        "id": "fyklzav",
        "permalink": "/r/wallstreetbets/comments/hu0q5h/when_you_move_out_of_moms_basement_and_the/fyklzav/",
        "score": 265,
        "subreddit": "wallstreetbets",
        "created": 1595206101.0
    },
    {
        "author": "n-some",
        "body": "\"If you bought Tulips for 10 guilders in 1633, you would be dead now.\"",
        "created_utc": 1595775267,
        "id": "fzb0f0j",
        "permalink": "/r/stocks/comments/hy74z8/anyone_else_hate_the_articles_that_say_if_you/fzb0f0j/",
        "score": 263,
        "subreddit": "stocks",
        "created": 1595804067.0
    },
    {
        "author": "ZACHisZAQ",
        "body": "Nice I’m holding that right now 🚀🚀🚀",
        "created_utc": 1595275751,
        "id": "fyoyx15",
        "permalink": "/r/RobinHoodPennyStocks/comments/husjpc/after_tons_of_mistakes_and_a_lot_of_dd_is_think/fyoyx15/",
        "score": 263,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1595304551.0
    },
    {
        "author": "martinvandepas",
        "body": "For 8 years, I worked at Intel as an electrical engineer designing circuits for the future manufacturing processes that Intel would be releasing 2-4 years into the future. There are literally thousands of MS and PhD engineers working on the myriad of challenges involved in making better computer chips. All the way from the design of the manufacturing tools, the amount of NAND gates in a library, the modeling and forecasting of dozens of transistor parameters, writing and supporting the simulation tools, to what I was doing designing and testing: analog circuits in a not yet stable manufacturing process. And hundreds of other challenges that each had teams from a few to a few dozen engineers trying to solve them. It's an insanely complex task. Most engineers working on any of these tasks are so specialized that they don't have any idea how to do the job of the engineers sitting a few aisles over. These engineers are 5-9 management layers below the CEO. Other companies operate the same way, it's just how chip design is done. \n\nIntel's main advantage over the last few decades was that it continuously had the most advanced manufacturing process, maintaining a 1-2 year lead over its closest competitors. However over the last ten years, TSMC has caught up and now overtaken Intel. This is mostly due to Intel's engineering struggles with it's last few manufacturing processes. These things spend half a decade in planning and development. Decisions were made years ago that they are now stuck with. \n\nYour points are all about top level management and I'm sure there's some truth to how important the CEO's decisions are, but I think Intel's current problems are primarily engineering problems with the manufacturing process. I sincerely doubt it's for lack of investment by CEOs. I think it's more likely that TSMC had better engineering talent and was able to do things more creatively that ended up wildly successful.  And surely some luck there too.\n\nAMD has been doing well with their architectures recently and they should get credit for that, but their architectures were always quite good, the thing holding them back was their process and what had been a disadvantage, with TSMC, is now a huge advantage. They are poised to take market share, but they mostly have TSMC to thank for that.",
        "created_utc": 1595777052,
        "id": "fzb3mtw",
        "permalink": "/r/investing/comments/hy3mgo/why_is_intel_losing_to_amd_people_just_realized/fzb3mtw/",
        "score": 263,
        "subreddit": "investing",
        "created": 1595805852.0
    },
    {
        "author": "rich000",
        "body": "That often doesn't work in practice.\n\nSuppose you have the highest pay in the industry.  You spend $1B researching 500 different formulas for batteries.  Any of them is simple enough that anybody could memorize them.  It turns out that 499 of them are duds, but 1 of them is a significant improvement.\n\nHere is the problem - that formula is something that dozens of employees at least end up knowing.  It cost the company $1B to obtain that formula - not so much to obtain the formula but to figure out that this is the one worth putting in the product.\n\nNow some other company can just offer one of those dozen employees $1M as a signing bonus and they get a $1B secret.  So, pay them all $10M a year!  Well, now the company can offer $100M and STILL get a $1B secret.  \n\nAnd it wasn't like any of those dozen employees \"discovered\" that formula due to their ingenuity and deserve all the money personally.  Maybe those 500 formulas are just all random tweaks of a common formula, and it was purely trial and error that lead to the right formula.  ANYBODY who did the work would have discovered it - the company just had to assign the testing to 100 scientists testing 5 formulas each at great expense, and one got lucky, purely because they were lucky.\n\nWhile I agree that companies should pay employees well to retain them, that doesn't mean that this is a substitute for IP law.  If you make the cheapest approach to R&amp;D to let somebody else do the work and then just poach their employees for a bit more, then nobody will do R&amp;D, and all of those employees will end up unemployed.\n\nDon't get me wrong - I think that plenty of employees are underpaid or not given sufficient bonuses for their creative discoveries.  However, the person who pulls the ball out of the lottery machine shouldn't get a cut of the jackpot every time somebody wins just for being the person who drew the ball.",
        "created_utc": 1595551490,
        "id": "fz1hgjc",
        "permalink": "/r/investing/comments/hwjm6w/tesla_sues_rivian_for_allegedly_stealing_secrets/fz1hgjc/",
        "score": 261,
        "subreddit": "investing",
        "created": 1595580290.0
    },
    {
        "author": "DragaliaBoy",
        "body": "Nah just OP. This is public info now and you’re clear to trade.",
        "created_utc": 1595381440,
        "id": "fyttop2",
        "permalink": "/r/wallstreetbets/comments/hvh6ue/amzn_3800_call_cant_go_tits_up/fyttop2/",
        "score": 254,
        "subreddit": "wallstreetbets",
        "created": 1595410240.0
    },
    {
        "author": "ShinoPrime987",
        "body": "How quickly people forget what happened to AIG and all its investors. AIG was seen as too big to fail. Oh it failed. 100k$ back at their height is worth like what 2k$ now?\n\nAll credit to Warren Buffet for doing what he has done, but selling stocks is a very important part of investing. Don't take everything he says as gospel. This quote is very clearly being spoken in hyperbole. Warren just recently sold billions in airline stock.",
        "created_utc": 1594853306,
        "id": "fy70tk2",
        "permalink": "/r/investing/comments/hrwe84/warren_buffet_if_i_had_never_sold_a_stock_i_would/fy70tk2/",
        "score": 236,
        "subreddit": "investing",
        "created": 1594882106.0
    },
    {
        "author": "ayjaylar",
        "body": "Circuit city is now the leading candidate for a new virus!",
        "created_utc": 1596150698,
        "id": "fzsw0we",
        "permalink": "/r/wallstreetbets/comments/i0weia/blockbuster_video_wins_250_billion_contract_to/fzsw0we/",
        "score": 233,
        "subreddit": "wallstreetbets",
        "created": 1596179498.0
    },
    {
        "author": "PapaTachancla",
        "body": "He got caught with some weed and got over $400K worth of guns confiscated and got sent to prison for 2 months. He's been doing podcasts for a while now.",
        "created_utc": 1594778969,
        "id": "fy3pgnc",
        "permalink": "/r/wallstreetbets/comments/hrbalh/stock_market_of_2020/fy3pgnc/",
        "score": 225,
        "subreddit": "wallstreetbets",
        "created": 1594807769.0
    },
    {
        "author": "havearedpill",
        "body": "I paid a $15k tax bill with Amazon gift cards to a nice man with a thick Indian accent over the phone. I found it a bit odd, but I guess that's how the IRS works now.",
        "created_utc": 1595378466,
        "id": "fytonuy",
        "permalink": "/r/wallstreetbets/comments/hvh6ue/amzn_3800_call_cant_go_tits_up/fytonuy/",
        "score": 224,
        "subreddit": "wallstreetbets",
        "created": 1595407266.0
    },
    {
        "author": "BravewardSweden",
        "body": "His eyes kind of look downcast at the floor as he says, \"Yes, we did, that's another way to think about it.  We did,\" when asked if the printer is actually going \"brrr.\"\n\nThe interviewing is going, \"Say it ain't so, Joe,\" and Jerome is going, \"Yes, kid, I'm afraid it is.\"\n\nLike...yeah, it's all a sham - nothin' we can do about it now.",
        "created_utc": 1595352499,
        "id": "fys9j9i",
        "permalink": "/r/wallstreetbets/comments/hv1v3h/never_forget/fys9j9i/",
        "score": 224,
        "subreddit": "wallstreetbets",
        "created": 1595381299.0
    },
    {
        "author": "Gmcgator",
        "body": "$91k for real world options training.  I bet you'll understand iv crush from now on.",
        "created_utc": 1595521051,
        "id": "fyzqv21",
        "permalink": "/r/wallstreetbets/comments/hwheds/bought_100k_in_tesla_724_calls_they_reported/fyzqv21/",
        "score": 221,
        "subreddit": "wallstreetbets",
        "created": 1595549851.0
    },
    {
        "author": "pervsensei11",
        "body": "Moved to a new apartment \n\nRent is 400$ cheaper\n\n400$ more to gamble every month now\n\nMMs better watch out \n\n💩💩💩",
        "created_utc": 1595198853,
        "id": "fylq6pl",
        "permalink": "/r/wallstreetbets/comments/hu74gf/what_are_your_moves_tomorrow_july_20_2020/fylq6pl/",
        "score": 219,
        "subreddit": "wallstreetbets",
        "created": 1595227653.0
    },
    {
        "author": "TU_NYCE",
        "body": "Wait what... You guys can see what we rename our accounts to? The fuck... My checkings is called retard fund.  \n\n\nNow it all makes sense whenever I speak to customer rep they speak slowly to me",
        "created_utc": 1594927790,
        "id": "fya8iz1",
        "permalink": "/r/wallstreetbets/comments/hsfzwf/i_talked_to_one_of_you_autists_today/fya8iz1/",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1594956590.0
    },
    {
        "author": "raisinpon",
        "body": "Now THIS is pod racing",
        "created_utc": 1595903547,
        "id": "fzh1gwl",
        "permalink": "/r/wallstreetbets/comments/hz5idt/the_comedy_how_i_lost_all_my_money_in_two_hours/fzh1gwl/",
        "score": 214,
        "subreddit": "wallstreetbets",
        "created": 1595932347.0
    },
    {
        "author": "xTofik",
        "body": "So he bought AAL for $18+ and BA for $210+ in early June when airline stocks doubled in a week?  AAL is down 40% now, BA about 15%",
        "created_utc": 1595697756,
        "id": "fz7o9s8",
        "permalink": "/r/wallstreetbets/comments/hxq6w2/us_senator_pat_roberts_has_been_buying_up_airline/fz7o9s8/",
        "score": 212,
        "subreddit": "wallstreetbets",
        "created": 1595726556.0
    },
    {
        "author": "_scottyb",
        "body": "\"Get in now while you still can\"\n\n&gt;posts after the market closes",
        "created_utc": 1595967033,
        "id": "fzjqiel",
        "permalink": "/r/wallstreetbets/comments/hzlyid/only_idiots_selling_amd_now/fzjqiel/",
        "score": 210,
        "subreddit": "wallstreetbets",
        "created": 1595995833.0
    },
    {
        "author": "LavenderAutist",
        "body": "Yeah. Uber's earnings are going to be bad.\n\nNow they're going to take Postmates down with them.",
        "created_utc": 1595908465,
        "id": "fzh9dyj",
        "permalink": "/r/investing/comments/hz7h09/the_pennsylvania_supreme_court_has_ruled_that_an/fzh9dyj/",
        "score": 208,
        "subreddit": "investing",
        "created": 1595937265.0
    },
    {
        "author": "stockpicker69",
        "body": "I just realized I've never actually heard jpow's voice until now. I always thought he would sound like an old man.",
        "created_utc": 1595334867,
        "id": "fyrcsev",
        "permalink": "/r/wallstreetbets/comments/hv1v3h/never_forget/fyrcsev/",
        "score": 204,
        "subreddit": "wallstreetbets",
        "created": 1595363667.0
    },
    {
        "author": "krikke_d",
        "body": "can confirm, even large established corporations will report how amazing they are doing, having back to back record quarters...and ask their suppliers for longer payment terms in the same breath, no shame.\n\nSo you can increase quarterly dividends every year but now you need 120 instead of 90 days for payment or you will run to competition ? Yup, seems only fair.",
        "created_utc": 1595452393,
        "id": "fywxd1h",
        "permalink": "/r/investing/comments/hw1jny/tesla_reports_4th_straight_quarter_of_profits/fywxd1h/",
        "score": 199,
        "subreddit": "investing",
        "created": 1595481193.0
    },
    {
        "author": "OPINION_IS_UNPOPULAR",
        "body": "Why you heff to be mad?\n\n**User reports**\n\n8: This is spam        \n\n7: Advertisement or self-promotion        \n\n6: No Market Manipulation        \n\n3: Pump &amp; Dump, Scheme, Scam or Crypto        \n\n3: Fake, Fabricated, Phony, Con, Fraudulent.        \n\n1: Market manipulation. asking to pump a stock.\n\nSelfpromotion, this is a plot to get more youtube subs        \n1: Threatening, harassing, or inciting violence        \n\n1: Spam        \n\n1: y'all are a bunch of retarded faggots        \n\n1: No Advertisement, Self-Promotion, or Begging        \n\n1: retard mods shouldn't even allow some random ass rich dipshit do stuff like this here        \n\n1: piece of shit garbage human being.         \n\n1: Violated Content Guidelines        \n\n1: It's rude, vulgar or offensive        \n\n1: this sub sucks now, thanks mods.",
        "created_utc": 1594836817,
        "id": "fy62uj6",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy62uj6/",
        "score": 195,
        "subreddit": "wallstreetbets",
        "created": 1594865617.0
    },
    {
        "author": "Somethingdifferent39",
        "body": "There are defintely some similarities, but as Cuban notes, the Fed is taking some pretty extreme steps to pump in liquidity. If you talk to ten different market experts they will give you ten different ways this all might end, but the theory I like is that the party wont end until the Fed raises rates, and they won't raise rates until we see a spike in inflation. So the real question is when do we see inflation? \n\nAt the end of the day Mark is right, asset prices are frothy and you shouldnt put more in the market right now then you can stomach to lose. However, I think you could also be missing out on a lot of market gains if you have no exposue as the surge from March lows has already proven.",
        "created_utc": 1595257015,
        "id": "fynwrc2",
        "permalink": "/r/stocks/comments/hum7yz/dont_get_greedy_mark_cuban_warns_investors_of/fynwrc2/",
        "score": 195,
        "subreddit": "stocks",
        "created": 1595285815.0
    },
    {
        "author": "psy_throwaway_33",
        "body": "Gold and silver (+ metal stocks!) have been superstars of my portfolio this year, beating even NASDAQ high flyers.\n\nIf you asked me to describe ideal conditions for gold/silver prices it would be something very similar to what we have right now.\n\n* Economic downturn, yet the stock market at or near ATH\n* Out of control central banks\n* Reckless fiscal policies\n* Growing international instability\n* Near-zero or even negative yields on bonds",
        "created_utc": 1595851783,
        "id": "fzea4zz",
        "permalink": "/r/investing/comments/hyqkz9/gold_price_hits_record_high_on_new_fears_for_the/fzea4zz/",
        "score": 194,
        "subreddit": "investing",
        "created": 1595880583.0
    },
    {
        "author": "perkses",
        "body": "Now comes the revenge trading where you lose the rest",
        "created_utc": 1595214423,
        "id": "fymfzbb",
        "permalink": "/r/wallstreetbets/comments/hudds2/that_didnt_go_as_planned/fymfzbb/",
        "score": 192,
        "subreddit": "wallstreetbets",
        "created": 1595243223.0
    },
    {
        "author": "Futuramah",
        "body": "Man can’t even afford $ROPE now. Might have to settle for ramen noodles.",
        "created_utc": 1595690340,
        "id": "fz7aws8",
        "permalink": "/r/wallstreetbets/comments/hxo91u/14k_159k_4_this_is_what_happens_when_you_never/fz7aws8/",
        "score": 190,
        "subreddit": "wallstreetbets",
        "created": 1595719140.0
    },
    {
        "author": "thatlookslikemydog",
        "body": "I have traded options on and off for a couple years now. And have lost most of it! And I’m using an app that has more tools than Robinhood. In gamer terms, I’ve found the meta can shift multiple times a week, so even if you know what to look for, it’s a lot of work to stay up to date on things. tldr: what OP said.",
        "created_utc": 1594753848,
        "id": "fy2dygq",
        "permalink": "/r/RobinHood/comments/hr75ox/a_reminder_to_new_traders/fy2dygq/",
        "score": 185,
        "subreddit": "RobinHood",
        "created": 1594782648.0
    },
    {
        "author": "k3nknee",
        "body": "So let's say you own 1000 shares of Tesla. Nobody knows what direction Tesla ia going to go, it could crash down or go back to the moon. So to hedge/protect your position you could buy puts on Tesla which gives you the right to sell 100 shares of Tesla at an agreed upon price. This would hedge your position because if the price of Tesla falls the value of your puts would go up. Now buying puts can be expensive, so to cover the cost of that you would sell   calls on the Tesla stock you already own giving someone else the right to buy from you at an agreed upon price, and use the premium from selling your calls to pay for your puts you just bought. \n\nThe only disadvantage to this strategy is if Tesla really moons your going to miss out on more profit because the calls you sold are going to get exercised and your shares of Tesla are going to get called away for a lower price then what Tesla is currently trading at in this scenario. But profits are still profits, and this strategy protects you from losing bad if the \"Tesla bubble\" pops. (Idk if it's actually a bubble, Idk anything anymore in this market)",
        "created_utc": 1595274453,
        "id": "fyow9bs",
        "permalink": "/r/stocks/comments/hum7yz/dont_get_greedy_mark_cuban_warns_investors_of/fyow9bs/",
        "score": 180,
        "subreddit": "stocks",
        "created": 1595303253.0
    },
    {
        "author": "dwdsquared2",
        "body": "Hey, my brothers.  If you feel really bad right now, please read this.  Everything will be alright.  You are priceless and mistakes happen.  They may happen many times.  It's okay.\n\nThis week is over.  The weekend is here.  Take your lessons and learn from them.\n\nIf you feel addicted, sad, depressed, lonely, hopeless, etc. please tell someone.  You are loved.  If you need someone, send me a chat message.  I have all of the time in the world for you.",
        "created_utc": 1595621662,
        "id": "fz4ktnj",
        "permalink": "/r/wallstreetbets/comments/hx90gx/weekend_discussion_thread_for_the_weekend_of_july/fz4ktnj/",
        "score": 176,
        "subreddit": "wallstreetbets",
        "created": 1595650462.0
    },
    {
        "author": "MartialImmortal",
        "body": "literally the same accounting story every quarter\n\nyea they're growing, but it's hard to justify even a $400 pricetag, much less whatever the fuck is going on now",
        "created_utc": 1595459972,
        "id": "fyxbcwp",
        "permalink": "/r/investing/comments/hw1jny/tesla_reports_4th_straight_quarter_of_profits/fyxbcwp/",
        "score": 163,
        "subreddit": "investing",
        "created": 1595488772.0
    },
    {
        "author": "timeinthemarket",
        "body": "2008 didn't happen overnight and it took a while for the extent of the problem to set in and the markets to react.\n\nWe're still not past this problem and have no idea what kind of damage will be done before it's over. Right now the economic impact has been in certain areas but it'll bubble up to other sectors pretty fast. \n\nI'm pretty optimistic long-term(5+ years out) but short term, I think it's a total crap shoot.",
        "created_utc": 1595590804,
        "id": "fz2xl9a",
        "permalink": "/r/investing/comments/hwzv4a/maybe_im_crazy_but_2008_felt_worse/fz2xl9a/",
        "score": 162,
        "subreddit": "investing",
        "created": 1595619604.0
    },
    {
        "author": "myglasstrip",
        "body": "A coworker of mine bought them during the dip because bank + dividend. \n\nCouldn't believe they would risk it on a company with a proven terrible track record. \n\nThey're being rewarded now with declining share price and well... Being a wells Fargo share holder.",
        "created_utc": 1594757131,
        "id": "fy2kv7d",
        "permalink": "/r/wallstreetbets/comments/hr87n7/wells_fargo_shareholders_rise_up/fy2kv7d/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1594785931.0
    },
    {
        "author": "cyrilsuave",
        "body": "MY 40K PORTFOLIO BECAME 5K LAST WEEK BECAUSE OF NETFLIX CALLS AND AVERAGING DOWN. I BOUGHT AZN CALLS LAST 2 DAYS AGO.... NOW MY LAST 5K IS 1K... FROM 40K TO 1K IN 1 WEEK. FUCK YEAHHH",
        "created_utc": 1595366342,
        "id": "fyt2fvo",
        "permalink": "/r/wallstreetbets/comments/hveqed/what_are_your_moves_tomorrow_july_22_2020/fyt2fvo/",
        "score": 157,
        "subreddit": "wallstreetbets",
        "created": 1595395142.0
    },
    {
        "author": "stejerd",
        "body": "Simple explanation really. Half this sub had their life savings in 2000c expiring today. Now that they are bankrupt they want the stimulus and hate musk. Had their options printed it would be the other way around.",
        "created_utc": 1595604823,
        "id": "fz3l6fr",
        "permalink": "/r/wallstreetbets/comments/hx31y6/no_not_again/fz3l6fr/",
        "score": 154,
        "subreddit": "wallstreetbets",
        "created": 1595633623.0
    },
    {
        "author": "SpaceBollzz",
        "body": "Good decision imo, it should've been made long before now.\n\nChina cannot be trusted.",
        "created_utc": 1594739819,
        "id": "fy1kquc",
        "permalink": "/r/investing/comments/hr2y6z/boris_johnson_moves_to_ban_huawei_in_the_uk_by/fy1kquc/",
        "score": 153,
        "subreddit": "investing",
        "created": 1594768619.0
    },
    {
        "author": "ktempo",
        "body": "I took out 4k in March because the market was going to keep going down. 4k into 4/17 SPY 200P. You know what happened.\n\nDon't be a dumbfuck like me and lose it man. It's not worth it. That 50k is going to be worth 5-10 times what it is now in 25-30 years. Don't touch it retard.",
        "created_utc": 1595890198,
        "id": "fzgdmni",
        "permalink": "/r/wallstreetbets/comments/hz2oc8/50k_loan_against_401k/fzgdmni/",
        "score": 152,
        "subreddit": "wallstreetbets",
        "created": 1595918998.0
    },
    {
        "author": "ArnolduAkbar",
        "body": "All I remember is the dog and Will Smith is a cuck now.",
        "created_utc": 1595425397,
        "id": "fyvdhln",
        "permalink": "/r/stocks/comments/hvt0ti/us_will_pay_195_billion_for_pfizer_inc_to_produce/fyvdhln/",
        "score": 146,
        "subreddit": "stocks",
        "created": 1595454197.0
    },
    {
        "author": "ForwardChocolate4",
        "body": "now its our money.",
        "created_utc": 1595608380,
        "id": "fz3smkg",
        "permalink": "/r/wallstreetbets/comments/hx0nol/10k_1k_70k_2k/fz3smkg/",
        "score": 146,
        "subreddit": "wallstreetbets",
        "created": 1595637180.0
    },
    {
        "author": "AlBundysLastTD",
        "body": "Wait till they see how much I can rack up now that I know the rules!\n\nIt's my 7 year plan...",
        "created_utc": 1595623155,
        "id": "fz4nwem",
        "permalink": "/r/wallstreetbets/comments/hx4rqm/dad/fz4nwem/",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1595651955.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "[Edited because automod didn't like some wsb words I used.]\n\nIt feels like 1999 to me.\n\nSuper hot tech stocks that were unstoppable. Some even the same names (e.g. AMZN). Check.\n\nCompanies committing fraud (Enron and Worldcom back then, Luckin and Wirecard now). Check.\n\nA flurry of IPOs back then where they all go up. A bunch of IPOs plus SPACs which triple purely on speculation. Check.\n\nLots of new traders piling into the market because stocks only go up. Check.\n\nAll the talking heads on TV saying we're in a tech bubble. Check.\n\nNow, in 1999/2000, there was no bounce. It was kicked off with a big correction, a bit of a recovery, and then two years of pain.",
        "created_utc": 1594519864,
        "id": "fxsaf9j",
        "permalink": "/r/investing/comments/hplw3z/is_this_what_the_market_felt_like_in_2010_and_2011/fxsaf9j/",
        "score": 143,
        "subreddit": "investing",
        "created": 1594548664.0
    },
    {
        "author": "xcheezeplz",
        "body": "No way, he should YOLO calls on moderna now. Just pumped to ATH off a great headline that sounds way better than the study results, and who cares if the execs are selling stock like crazy. This is the way.",
        "created_utc": 1594839837,
        "id": "fy69bnr",
        "permalink": "/r/wallstreetbets/comments/hrqba6/go_all_in_on_tsla_they_said/fy69bnr/",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1594868637.0
    },
    {
        "author": "ThroneTrader",
        "body": "Well congrats, you'll have even less reason to know what those terms mean now.",
        "created_utc": 1595718192,
        "id": "fz8xoy8",
        "permalink": "/r/wallstreetbets/comments/hxr5s4/38020000_5100_gain_on_mrna_puts_overnight/fz8xoy8/",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1595746992.0
    },
    {
        "author": "Snaaaaaaaaaake",
        "body": "Next video a year from now: \"hi I'm Mr. Beast and this is my oil pool, let's jump in boys!\"",
        "created_utc": 1594855964,
        "id": "fy75r2v",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy75r2v/",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1594884764.0
    },
    {
        "author": "TurielD",
        "body": "Now that's Autist Energy",
        "created_utc": 1595451120,
        "id": "fywuo2y",
        "permalink": "/r/wallstreetbets/comments/hw1mrb/tsla_earnings_actually_what_the_fck/fywuo2y/",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1595479920.0
    },
    {
        "author": "riceturm",
        "body": "Gpu’s are taking over more and more tasks from the cpu, nvidia is master in gpu development and sales. They especially dominate in server-gpus, used in almost all virtual workstation environments.\nNow nvidia is rumored to buy arm, they can also be a direct competitor for cpu sales.",
        "created_utc": 1595764764,
        "id": "fzalpmv",
        "permalink": "/r/investing/comments/hy3mgo/why_is_intel_losing_to_amd_people_just_realized/fzalpmv/",
        "score": 137,
        "subreddit": "investing",
        "created": 1595793564.0
    },
    {
        "author": "Edz_",
        "body": "You're going to buy call on a company that is directly implicated in bribery charges. Even if they come out on top the name is now dragged through the mud for the foreseeable future.\n\n\nGodspeed you autistic fuck.",
        "created_utc": 1595390594,
        "id": "fyu8i7x",
        "permalink": "/r/wallstreetbets/comments/hvma42/the_fbi_just_did_us_all_a_favor_buy_the_fe_dip/fyu8i7x/",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1595419394.0
    },
    {
        "author": "SupreamSammy",
        "body": "calls are fool proof now, thanks Leo!",
        "created_utc": 1595369851,
        "id": "fyt9gu8",
        "permalink": "/r/wallstreetbets/comments/hvh6ue/amzn_3800_call_cant_go_tits_up/fyt9gu8/",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1595398651.0
    },
    {
        "author": "VapesOnAPlane",
        "body": "The Fed **didn't** do anything in 1929, but that's the point. They are doing something now. Are you right that a crash will happen eventually? Yeah, probably. But try timing that shit with the Fed coming in BBC style every time the market gets spooked. Good luck with that. It could be another few months or a few decades until a real crash happens. Who knows? I'll tell you one thing for sure though: no crash is happening until the election.",
        "created_utc": 1595233329,
        "id": "fyn2xxw",
        "permalink": "/r/wallstreetbets/comments/huha1q/the_fed_didnt_do_anything_in_19291111/fyn2xxw/",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1595262129.0
    },
    {
        "author": "steadyeddy_10",
        "body": "You’d be a millionaire by now if you weren’t retarded.",
        "created_utc": 1595723116,
        "id": "fz96a0z",
        "permalink": "/r/wallstreetbets/comments/hxxaeb/my_bounce_back_up_is_coming_soon/fz96a0z/",
        "score": 129,
        "subreddit": "wallstreetbets",
        "created": 1595751916.0
    },
    {
        "author": "LovableContrarian",
        "body": "Bruh, it's based on future expectations.\n\nAMD is grabbing market share like a hungry slut (not just in consumer PCs but also in consoles, enterprise, servers, etc), and INTC just continues to fuck up everything. It's honestly sort of amazing how many mistakes Intel has made in the past year or so, and they are legitimately at risk of becoming completely uncompetitive.\n\nThey basically lost 100% of the enthusiast/custom PC market overnight, and most of their revenue now comes from contracts with Dell, Lenovo, Apple, etc for desktop and notebook CPUs (and a few other random components, like wifi and Bluetooth cards). And, these companies will almost definitely be looking to AMD, as Intel's 7nm chips aren't expected to be available until *at least* 2022, and AMD is already mass-producing. Depending on how hard these companies ditch Intel, it could be an actual death blow. \n\nAnd that doesn't even bring up the issue that things are shifting more and more to mobile platforms, where Intel completely failed. Companies like Apple, Samsung, and Qualcomm absolutely dominate in the mobile SoC sector and managed to castrate a titan when Intel attempted to enter that market and failed miserably. \n\nIt's bad news all around. \n\nDoes that mean they can't come back? No. Of course they can. But the concerns are real.\n\nWhat other major stocks have you seen recently crash 13% on earnings then just... Stay there? Flat? We are in the most legendary dip-buying market of all time, where almost any dip will be bought without any logic, and yet no one would touch INTC, which is one of the biggest tech companies in the world.\n\nIt's a bit concerning.\n\nYour DD is basically \"bruh, it's Intel. And they made a lot of money in 2019.\" But that's frankly just not very good DD my friend.",
        "created_utc": 1595631956,
        "id": "fz54toq",
        "permalink": "/r/wallstreetbets/comments/hxappc/amd_vs_intel/fz54toq/",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1595660756.0
    },
    {
        "author": "new_account_5009",
        "body": "Also, you're older in 2020 than 2008.  Anyone posting to the investing subreddit is likely doing pretty good financially, which likely means they've got a much bigger financial cushion 12 years later.  I was an entry level grunt in corporate America in 2008 still paying off student loans.  In 2020, I'm now in a middle management role with a large enough cushion to fall back on if I were to lose my job.  Accordingly, 2008 felt a lot worse to me personally, but the economy is more than my personal experience.  Graduating college in 2008 is still preferable to graduating college in 2020, in my opinion.\n\nAdditionally, it's still very early in the COVID crisis timeline.  The dust hasn't settled on this at all yet.  People talk about 2008 as if the crisis happened in a single year and things were fine right away, but in reality, things started getting bad in 2007, and things were still pretty dicey through 2011 or so.  We're less than six months into the impact here.  Things like eviction protections and expanded unemployment benefits have dampened the impact, but those won't last forever.  As bad as things are now, it's entirely possible for them to get worse.",
        "created_utc": 1595605830,
        "id": "fz3n96w",
        "permalink": "/r/investing/comments/hwzv4a/maybe_im_crazy_but_2008_felt_worse/fz3n96w/",
        "score": 126,
        "subreddit": "investing",
        "created": 1595634630.0
    },
    {
        "author": "MovieMuscle25",
        "body": "You geniuses should probably take the hint by now.",
        "created_utc": 1595451553,
        "id": "fywvlm5",
        "permalink": "/r/investing/comments/hw1jny/tesla_reports_4th_straight_quarter_of_profits/fywvlm5/",
        "score": 125,
        "subreddit": "investing",
        "created": 1595480353.0
    },
    {
        "author": "ravepeacefully",
        "body": "It is a cutting edge high-tech firm out of the Midwest awaiting imminent patent approval on the next generation of radar detectors that have both huge military and civilian applications now.",
        "created_utc": 1595965179,
        "id": "fzjmm1e",
        "permalink": "/r/wallstreetbets/comments/hzj9pt/just_a_couple_of_brothers_making_radars_out_of/fzjmm1e/",
        "score": 124,
        "subreddit": "wallstreetbets",
        "created": 1595993979.0
    },
    {
        "author": "Harudera",
        "body": "Lmao this faggot spent 4 years travelling the world and earning 650k in the process and now he's crying.\n\nDid your gf's boyfriend beat you up?",
        "created_utc": 1594604439,
        "id": "fxvyeqm",
        "permalink": "/r/wallstreetbets/comments/hq65dq/dont_be_like_me_find_meaning_in_your_life_because/fxvyeqm/",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1594633239.0
    },
    {
        "author": "10nisne1",
        "body": "Long history to answer your question, but on a high level.....\n\nUnder Steve Ballmer (2000-2014), Microsoft was all about preserving their cash cow.  Their cash cow being licensing of Windows and Office.\n\nWhen Satya Nadella became CEO in 2014, he had a different philosophy and started opening up Microsoft to different revenue streams.  Microsoft became more open to open source and the company became more relevant again with enterprise companies.  For example, there is now native support to allow running Linux on Windows.  This would never have happened under Ballmer.\n\nWall street has always rewarded companies with re-occurring revenue model vs companies that had a \"CAPEX\" or \"one time purchase\" revenue model such as Apple (but now Apple is pivoting more towards software and services) with higher valuation.  Microsoft shifted from one time purchase model of their consumer Windows (95/XP, Vista, 7, etc) and Office licensing.  Office became O365, which could be purchased on a monthly/annual subscription.\n\nAzure services helped and played into the re-occurring revenue model for Microsoft.  AWS was introduced in 2006 and took many years to be where they are at today.  Microsoft is playing catch up with Azure.  However, the big advantage with Microsoft and Azure is that they have an existing enterprise organization that sold into enterprise accounts for many years.\n\nAWS didn't have an enterprise sales team and in the early years really only catered to the developers and \"rogue IT\".  Even today, in my opinion, AWS still doesn't have have the enterprise sales organization they need to compete more effectively.\n\nSame with Google.  Google never had an enterprise sales organization for GCP and is really playing catch up.  It was mentioned by Thomas Kurian that GCP sales team was only 1/15th the size of Microsoft/AWS and would like to be 1/5th the size in the next 2 years.",
        "created_utc": 1595862583,
        "id": "fzes9rd",
        "permalink": "/r/stocks/comments/hysa13/why_did_people_view_microsoft_as_a_sleepy_tech/fzes9rd/",
        "score": 123,
        "subreddit": "stocks",
        "created": 1595891383.0
    },
    {
        "author": "SigSalvadore",
        "body": "I'm in the same boat. \n\nBecause he's the Autist WSB deserves, but not the one it needs right now, so we'll shun him. Because he gives zero fucks, because he's not an autist. He's an obnoxious guardian, an ADHD protector, a Dark Douche.",
        "created_utc": 1595520625,
        "id": "fyzpz64",
        "permalink": "/r/wallstreetbets/comments/hwi7oa/a_new_method_to_the_yolo/fyzpz64/",
        "score": 122,
        "subreddit": "wallstreetbets",
        "created": 1595549425.0
    },
    {
        "author": "SaplingCub",
        "body": "My daily reminder this sub is now WSB",
        "created_utc": 1595598950,
        "id": "fz39saj",
        "permalink": "/r/investing/comments/hx1yq7/tesla_tsla_stock_down_over_8_at_opening/fz39saj/",
        "score": 122,
        "subreddit": "investing",
        "created": 1595627750.0
    },
    {
        "author": "likeitis121",
        "body": "This is what happens when people believe the Fed will backstop absolutely any correction. The thing though now is they really are going to be forced to fix their balance sheet, which is going to impact actual economic recovery.  I know they are trying to say otherwise, but in no way can they see this runaway market as good, it's another massive risk to the economy that is already in terrible shape.",
        "created_utc": 1595296262,
        "id": "fyq1msh",
        "permalink": "/r/StockMarket/comments/huxtz2/big_tech_stocks_add_291_billion_in_market_value/fyq1msh/",
        "score": 122,
        "subreddit": "StockMarket",
        "created": 1595325062.0
    },
    {
        "author": "Suds08",
        "body": "Now do it again only win this time",
        "created_utc": 1595193281,
        "id": "fylfycq",
        "permalink": "/r/wallstreetbets/comments/hu74gf/what_are_your_moves_tomorrow_july_20_2020/fylfycq/",
        "score": 121,
        "subreddit": "wallstreetbets",
        "created": 1595222081.0
    },
    {
        "author": "carc",
        "body": "All stocks are now meme stocks, Ford to the moon!",
        "created_utc": 1594577396,
        "id": "fxumdes",
        "permalink": "/r/wallstreetbets/comments/hpxky3/stonks_only_go_up_because_dead_people_cant_sell/fxumdes/",
        "score": 119,
        "subreddit": "wallstreetbets",
        "created": 1594606196.0
    },
    {
        "author": "zjz",
        "body": "We know, TSLA is annoying. It's just the way meme stocks are. When we try to fight the tide it just takes longer for people to get over it. Let them meme until they're sick of the meme and it'll pass naturally.\n\nRE: the \"WSB too popular REEE\" post earlier, WSB becoming more mainstream is *not* a bad thing. More blood for the blood god. More financial crimescene pictures. You don't have to let them change our lingo or vibe. You don't get shit like 2,000% losses and box spread shenanigans from people who know what they're doing.\n\nThe idea that there was once a significant period of better content or a concentration of well-informed insiders is a straight up meme. It's always been a trailmix of incompetence, talent, and newbies. One of the big early events was a rainbow dildo header background. The *big joke* at that time was \"go fuck yourself\" and people spammed it ten thousand times a day. We all invested in a biotech company that turned out to be HQ'd in a fucking shed. I think we're in a **much danker** timeline now. Onward and upward.\n\nAt some point in the near future we'll be looking for more mods for shitpost duty. If anybody has nominations in mind drop them here.\n\nComment for flair",
        "created_utc": 1594512867,
        "id": "fxrxh71",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxrxh71/",
        "score": 117,
        "subreddit": "wallstreetbets",
        "created": 1594541667.0
    },
    {
        "author": "bigbetsbigluck",
        "body": "Never in industry just means not right now",
        "created_utc": 1595138798,
        "id": "fyjahzh",
        "permalink": "/r/stocks/comments/htsjyp/upcoming_netflix_free_membership_plan_with/fyjahzh/",
        "score": 116,
        "subreddit": "stocks",
        "created": 1595167598.0
    },
    {
        "author": "RogueJello",
        "body": "Wow, like 3 days from now for Baseball (July 23rd) and 7 Days for NBA.\n\nThanks!  Now shorting the market, wish me luck!",
        "created_utc": 1595290456,
        "id": "fyprn6c",
        "permalink": "/r/investing/comments/husoq2/nasdaq_hits_all_time_closing_high_sp_500_highest/fyprn6c/",
        "score": 115,
        "subreddit": "investing",
        "created": 1595319256.0
    },
    {
        "author": "EducatingMorons",
        "body": "The DD we deserve but not the one we need right now. That's why we short him. Because he can take it, because he has infinite margin.",
        "created_utc": 1595551342,
        "id": "fz1h76p",
        "permalink": "/r/wallstreetbets/comments/hwmtac/its_not_about_moneyits_about_sending_a_message/fz1h76p/",
        "score": 114,
        "subreddit": "wallstreetbets",
        "created": 1595580142.0
    },
    {
        "author": "Gareth321",
        "body": "&gt;I don't know why people talk so much shit about gold\n\nIt only just exceeded its 2011 peak. Lots of people got burned. *You* might get burned. Gold doesn't have (much of) an underlying utility value. This price is driven almost entirely by speculation. It's Bitcoin before cryptocurrencies were cool.\n\nThat said, the entire fucking market is pants-on-head silly right now so fuck it. Throw some money in gold, BTC, and fucking tulips. [~~I'm not even joking~~ someone was joking.](https://thestonkmarket.com/blackrock-announces-tulip-etf/)",
        "created_utc": 1595856691,
        "id": "fzehgi4",
        "permalink": "/r/investing/comments/hyqkz9/gold_price_hits_record_high_on_new_fears_for_the/fzehgi4/",
        "score": 114,
        "subreddit": "investing",
        "created": 1595885491.0
    },
    {
        "author": "TeamLIFO",
        "body": "Yeah, airlines before the pandemic often had troubles making money... now they have massive disruptions to their demand and trying to have the correct supply of employees along with the heavy fixed cost structure of owning or leasing planes is a pretty big toll to recover from",
        "created_utc": 1595685194,
        "id": "fz72ldl",
        "permalink": "/r/investing/comments/hxk9f9/wont_united_air_go_bankrupt_what_am_i_missing/fz72ldl/",
        "score": 113,
        "subreddit": "investing",
        "created": 1595713994.0
    },
    {
        "author": "ura_walrus",
        "body": "This is the most bandwagony, self congratulatory blog post ive ever seen\n\nPlus hilariously late to the game. Maybe they should be bullish on tesla now too.",
        "created_utc": 1595772654,
        "id": "fzaw2ej",
        "permalink": "/r/investing/comments/hy3mgo/why_is_intel_losing_to_amd_people_just_realized/fzaw2ej/",
        "score": 113,
        "subreddit": "investing",
        "created": 1595801454.0
    },
    {
        "author": "ImZoidberg_Homeowner",
        "body": "Now that’s a Wall Street fucking bet.",
        "created_utc": 1595601511,
        "id": "fz3eliy",
        "permalink": "/r/wallstreetbets/comments/hx2h2b/new_high_score_thanks_amd/fz3eliy/",
        "score": 112,
        "subreddit": "wallstreetbets",
        "created": 1595630311.0
    },
    {
        "author": "cuki321",
        "body": "Now we need Trump to pump this shit like Hydroxychloroquine.",
        "created_utc": 1594754430,
        "id": "fy2f65w",
        "permalink": "/r/wallstreetbets/comments/hr7clc/abbv_calls_after_corona_cure_possibility_get_in/fy2f65w/",
        "score": 112,
        "subreddit": "wallstreetbets",
        "created": 1594783230.0
    },
    {
        "author": "journeyman_joe",
        "body": "What XSPA needs to do is change my -35% to +35%\n\nEdit: -40% now",
        "created_utc": 1594729484,
        "id": "fy12yh1",
        "permalink": "/r/pennystocks/comments/hr0cxt/what_xspa_needs_to_do/fy12yh1/",
        "score": 112,
        "subreddit": "pennystocks",
        "created": 1594758284.0
    },
    {
        "author": "dwittty",
        "body": "Well, let’s see. Trusting the first result from google there are 44.16 million 30-39 year olds in America.  Each of these persons is worth an average of 174002 based on what it says for the mean in the chart. Multiply that out and it’s 7.68393 trillion. Now, trusting the first result from google once again, Zuckerberg is worth 89.2 billion. If we take that number out of the 7.68393 trillion and then divide again by our 44.16 million 30-39 year olds, we find that this age bracket would instead have a mean net worth of $171982.07 if we took Zuckerberg out of it.\n\nZuckerberg accounts for about $2000 of that average. Put another way, Zuckerberg has about 1.1% of all the wealth of 30-39 year olds in America.",
        "created_utc": 1595366709,
        "id": "fyt37lq",
        "permalink": "/r/wallstreetbets/comments/hvd7ox/a_reminder_how_your_net_worth_compare_in_the_real/fyt37lq/",
        "score": 111,
        "subreddit": "wallstreetbets",
        "created": 1595395509.0
    },
    {
        "author": "youreaditfirst",
        "body": "I lost 12k on **AMZN** CALLS they are worth $50 right now. I am broke. 🤡🔫",
        "created_utc": 1595536030,
        "id": "fz0nf4q",
        "permalink": "/r/wallstreetbets/comments/hwn0fj/what_are_your_moves_tomorrow_july_24_2020/fz0nf4q/",
        "score": 110,
        "subreddit": "wallstreetbets",
        "created": 1595564830.0
    },
    {
        "author": "beyphy",
        "body": "That's Jim Keller. He never stays in a place for too long. He usually joins a company for a few years, makes his impact, and he moves on. And he may have done that at Intel. What was surprising was the nature of how he left which was a [very abrupt resignation for \"personal reasons\"](https://www.anandtech.com/show/15846/jim-keller-resigns-from-intel-effective-immediately). \n\nSpeculation, but I think Intel's main problems are management related. Their management either laid off too many important, expensive engineers in an effort to save money. Or they were far too aggressive which led to the massive failure they had today. Or a combination of both. There are definitely fields where you can layoff staff and outsource costs to save money. But semiconductor manufacturing definitely isn't one of them.\n\nI've said in other posts that shareholders are tolerating this now, but they won't do so forever. If Intel doesn't get their stuff together, this may not get fixed until a lot of people get fired.",
        "created_utc": 1595774936,
        "id": "fzazu6z",
        "permalink": "/r/investing/comments/hy3mgo/why_is_intel_losing_to_amd_people_just_realized/fzazu6z/",
        "score": 110,
        "subreddit": "investing",
        "created": 1595803736.0
    },
    {
        "author": "-I_DO_NOT_COMPUTER-",
        "body": "I've been reading this sub for over a year now and I have no idea what anything means that anyone says here. Get fucked kid.",
        "created_utc": 1594830857,
        "id": "fy5q46q",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy5q46q/",
        "score": 110,
        "subreddit": "wallstreetbets",
        "created": 1594859657.0
    },
    {
        "author": "B20Bravo",
        "body": "I usually buy low, sell high. This is groundbreaking, now I know how to trade the right way! Lol",
        "created_utc": 1595777444,
        "id": "fzb4db1",
        "permalink": "/r/stocks/comments/hy74z8/anyone_else_hate_the_articles_that_say_if_you/fzb4db1/",
        "score": 109,
        "subreddit": "stocks",
        "created": 1595806244.0
    },
    {
        "author": "kylenusser",
        "body": "Graham used to be decent. Now every video is clickbait.\n\nAlso fuck you Graham. I know you're on this sub faggot",
        "created_utc": 1595280519,
        "id": "fyp8m1e",
        "permalink": "/r/wallstreetbets/comments/hutvfy/youtube_investing_guru_idiots/fyp8m1e/",
        "score": 109,
        "subreddit": "wallstreetbets",
        "created": 1595309319.0
    },
    {
        "author": "the-regulaaaa",
        "body": "Great. Now do it to Amazon, Nike, etc...",
        "created_utc": 1595356684,
        "id": "fysi811",
        "permalink": "/r/stocks/comments/hv82zt/us_imposes_sanctions_on_11_chinese_companies_over/fysi811/",
        "score": 107,
        "subreddit": "stocks",
        "created": 1595385484.0
    },
    {
        "author": "IceShaver",
        "body": "1. Economic pressures haven’t hit the financial markets yet due to unprecedented government actions. Fed bought 3trillion and congress approved 3 trillion within weeks. The economy is certainly being backstopped for now. But the effects will be felt as soon as the fed and government puts their feet off the breaks. Or if the pandemic gets worse than it is now which is becoming more and more likely as fall/winter season approaches. \n\n2. Not being worried is actually pretty worrying. It’s normally good to be optimistic but in certain times of uncertainly it’s better to be wary than it is to be blindly hopeful. That’s how unexpected bad news can make a bad situation worse.\n\n3. I cannot stress that we haven’t even begun to see the economic ramifications yet. Entire supply chains and industries will be drastically affected after the temporary period ends. Who knows how far the hospitality industry will come back. What will all those millions of people that rely on those jobs do after the pandemic ends if those jobs don’t come back? Government action seems like the only solution. But again this crisis will likely last years.",
        "created_utc": 1595592275,
        "id": "fz2zfn9",
        "permalink": "/r/investing/comments/hwzv4a/maybe_im_crazy_but_2008_felt_worse/fz2zfn9/",
        "score": 107,
        "subreddit": "investing",
        "created": 1595621075.0
    },
    {
        "author": "mori226",
        "body": "Ah another oracle that can see the future exactly I see. OK Thanks for letting me know man.",
        "created_utc": 1594487346,
        "id": "fxpdn3d",
        "permalink": "/r/wallstreetbets/comments/hpd3wc/360k_on_tsla_821_2000_calls/fxpdn3d/",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1594516146.0
    },
    {
        "author": "B3LYP2",
        "body": "So you’re saying that Drafkings guy isn’t the new oracle?",
        "created_utc": 1594732521,
        "id": "fy17joz",
        "permalink": "/r/investing/comments/hr0f9h/delta_revenue_down_88_yoy_q2_for_57_billion_loss/fy17joz/",
        "score": 42,
        "subreddit": "investing",
        "created": 1594761321.0
    },
    {
        "author": "chi3fer",
        "body": "IT budgets have been cut by 7% or more by most companies. I work for a predominant cloud provider and we have been slow AF.  What I'm seeing is IT are buying tech to help them transition to WFH. It ends up being a lot of point solutions like Zoom, Slack, Gong, Twilio etc.  Not many IT teams are going to spend hundred of thousands of dollars on core cloud transformations since they already have something in place i.e switch from Salesforce or Oracle to Microsoft. Most of these point solutions mentioned above aren't nearly the cost of an ERP or CRM solution.",
        "created_utc": 1595450955,
        "id": "fywubc6",
        "permalink": "/r/stocks/comments/hw13yv/microsoft_earnings_are_out_here_are_the_numbers/fywubc6/",
        "score": 26,
        "subreddit": "stocks",
        "created": 1595479755.0
    },
    {
        "author": "Desert_Hawg",
        "body": "I did it today boys. -75% to +16.6%. On the dumbest stock of them all. Oracle. It can be done.",
        "created_utc": 1593721576,
        "id": "fwqheyk",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwqheyk/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1593750376.0
    },
    {
        "author": "Y0L0_Cholo",
        "body": "you are the new oracle of omaha.",
        "created_utc": 1595278335,
        "id": "fyp45id",
        "permalink": "/r/wallstreetbets/comments/husx2t/post_your_azn_losses/fyp45id/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1595307135.0
    },
    {
        "author": "OverAndUnder500",
        "body": "&gt;During the fourth quarter of 2019, Berkshire reduced its holdings in Wells Fargo (NYSE:WFC) by 55,156,100 shares.\n\nOracle knew something was up.",
        "created_utc": 1594728433,
        "id": "fy11joq",
        "permalink": "/r/wallstreetbets/comments/hqywzo/daily_discussion_thread_for_july_14_2020/fy11joq/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1594757233.0
    },
    {
        "author": "confusedtaco",
        "body": "calls on Sun Microsystems? Heard Oracle might buy them?\n\nSource: AOL Tech chatroom",
        "created_utc": 1594567784,
        "id": "fxu3zso",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxu3zso/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1594596584.0
    },
    {
        "author": "DirtyHarry133",
        "body": "You can call me the oracle of wsb",
        "created_utc": 1595188494,
        "id": "fyl77jl",
        "permalink": "/r/wallstreetbets/comments/hu6lds/technical_analysis_for_q2_earnings/fyl77jl/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1595217294.0
    },
    {
        "author": "ColdBeing",
        "body": "The Oracle says NIO is the chosen one",
        "created_utc": 1594146151,
        "id": "fx8a9go",
        "permalink": "/r/wallstreetbets/comments/hmrv6e/daily_discussion_thread_for_july_07_2020/fx8a9go/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594174951.0
    },
    {
        "author": "ChoppedCheeseNoTmato",
        "body": "DONT BEAT YOURSELF UP IF YOU DIDNT FOMO. There's no way you could've known unless you're an Oracle or some shit.",
        "created_utc": 1594652635,
        "id": "fxxo3dt",
        "permalink": "/r/wallstreetbets/comments/hqcqy1/daily_discussion_thread_for_july_13_2020/fxxo3dt/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594681435.0
    },
    {
        "author": "Ima-hot-Topika",
        "body": "I work in the industry. These opinions are based on what I’ve seen in this market in the last 18 months. Lots of consolidation going on right now. I expect CrowdStrike to get bought out by a bigger fish. They do one thing really well and will fit into a larger cyber security portfolio. I think Fortinets will hit a wall I their growth as they don’t translate to the cloud as well as they work in prem. Their VPN is nothing compared to mature vendors like Pulse and Checkpoint. Okra seems like it would also be a great candidate for an acquisition by a company like Oracle who’s lagging in the cloud and desperately wants to be relevant. I don’t know Zscaler well. I don’t know about the next 10 years but I think Pali Alto is in a great position for market growth in the next 2 to 3 years.",
        "created_utc": 1595118866,
        "id": "fyiigj7",
        "permalink": "/r/StockMarket/comments/htooq1/cybersecurity_stock_to_hold_long_term/fyiigj7/",
        "score": 9,
        "subreddit": "StockMarket",
        "created": 1595147666.0
    },
    {
        "author": "mexipill",
        "body": "I’m pretty sure we crash now....\nThe oracle of Omaha called the bottom by selling airlines and now he bought again.\nThis can only mean doom.",
        "created_utc": 1594257203,
        "id": "fxdjp4g",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxdjp4g/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594286003.0
    },
    {
        "author": "FinndBors",
        "body": "For a tech company the best bellweather for me is quality of hiring. You have to know people in the industry active in the job market though.\n\nAnd there is definitely a huge lag effect that can last 10 years. Quality of hiring might drop or they don’t get a lot of fresh blood for a while and they start to stagnate which doesn’t affect earnings right away, but long term growth prospects and ability to enter new markets. If their old market runs strong, they could continue to do okay with a cutthroat sales team, but it isn’t going to have explosive growth. You can see companies like Oracle and VMware here.\n\nAnd note that this kind of analysis isn’t really scientific, this just comes from working at a number of tech firms and realizing what are the key things that drive innovation and which kind of company can successfully invest and launch new products and ideas.",
        "created_utc": 1595369374,
        "id": "fyt8kc0",
        "permalink": "/r/investing/comments/hvg2t0/telltale_signs_of_a_declining_bluechip_company/fyt8kc0/",
        "score": 9,
        "subreddit": "investing",
        "created": 1595398174.0
    },
    {
        "author": "ChoppedCheeseNoTmato",
        "body": "If you sold your tesla calls before the rally, dont beat yourself up, you're not an Oracle, there's no way anyone could have guessed it would rally this hard",
        "created_utc": 1594410048,
        "id": "fxka3nf",
        "permalink": "/r/wallstreetbets/comments/homfbk/daily_discussion_thread_for_july_10_2020/fxka3nf/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1594438848.0
    },
    {
        "author": "zerowangtwo",
        "body": "In theory, if the market valuation was less than the \"real valuation\" (let's say we have an oracle who knows the DCF of the company over the next 10 years), then it would be profitable to hold shares because you could sell your shares to an institution with enough capital to accumulate sufficient shares to liquidate the company for a profit.",
        "created_utc": 1595112349,
        "id": "fyi7o6k",
        "permalink": "/r/investing/comments/htkvwd/wall_street_is_firmly_in_wonderland/fyi7o6k/",
        "score": 8,
        "subreddit": "investing",
        "created": 1595141149.0
    },
    {
        "author": "XPgains",
        "body": "Lol my prediction was all right: \n\n1. Bank earnings are bad, but JPM will be fine WFC will shit the bed\n2. Blood red opening, then panic buy, dip and end green \n3. WMT stays strong \n\nCall me the Oracle",
        "created_utc": 1594737523,
        "id": "fy1gazc",
        "permalink": "/r/wallstreetbets/comments/hqywzo/daily_discussion_thread_for_july_14_2020/fy1gazc/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594766323.0
    },
    {
        "author": "skykitty89",
        "body": "If I sell my TSLA 7/17 calls before the weekend, is it going to be one of those things where I could have woken up Monday a millionaire? You know, like last week? TELL ME, OH MYSTIC ORACLE",
        "created_utc": 1594401857,
        "id": "fxjt8wh",
        "permalink": "/r/wallstreetbets/comments/homfbk/daily_discussion_thread_for_july_10_2020/fxjt8wh/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1594430657.0
    },
    {
        "author": "ZloiAris",
        "body": "Well, being honest, I see 2 issues with Amazon:  \n\n\n1) Super low marginality on the edge of profitability, which they choose to grow and expand market, but for how long they grow? They're already 1.5 trln company  \n\n\n2) As an IT person I would say they're going into Oracle direction with thier AWS. Already now you won't deal with AWS without dedicated 2-3 specialised cloud engineers with certifications. Hundred of services, a lot of of them duplicate each other (just try to google how to enable logging &amp; monitoring in AWS). The same was with Oracle 20 years ago, their RDBMS was like invetiable, but very very complex and the cost of adopting Oracle grew every year. The same story with AWS now, as for me.",
        "created_utc": 1595447640,
        "id": "fywn1nd",
        "permalink": "/r/investing/comments/hvypvq/which_stock_do_you_see_to_top_market_cap_rank_at/fywn1nd/",
        "score": 6,
        "subreddit": "investing",
        "created": 1595476440.0
    },
    {
        "author": "Particular-Wedding",
        "body": "You know what's unusual no one talks about anymore?  ORCL saw some bullish sentiment towards the end of the week and squeeze metric is reporting a small but noticeable blip up.\n\nEDIT: sorry not squeeze metric - i saw it on TD ameritrade.",
        "created_utc": 1594601677,
        "id": "fxvtwp8",
        "permalink": "/r/options/comments/hq49p6/unusual_options_activity_in_amd_dkng_intc_ko_and/fxvtwp8/",
        "score": 6,
        "subreddit": "options",
        "created": 1594630477.0
    },
    {
        "author": "mythrowaway12211221",
        "body": "Bottom line from my perspective :) we cannot time travel like dr strange and invest in Tesla or NIO during their infancy stages\n\nSHLL is a fantastic opportunity to get in and I would say don't be an Oracle trying to time the lows perfectly :)\n\nSHLL is going to be an easy step for any organization to quickly shift towards the green side !",
        "created_utc": 1594754014,
        "id": "fy2eb29",
        "permalink": "/r/SPACs/comments/hr5pb3/shll_15_states_agree_to_work_together_for_all/fy2eb29/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1594782814.0
    },
    {
        "author": "Solid_Owl",
        "body": "I'd be interested in hearing legitimate arguments about this.  To me, Amazon is simply diversifying its revenue streams.  It doesn't appear have any kind of monopoly that prevents other big players from giving it a go at any of these businesses:\n\nMSFT and FB and Youtube did the Twitch competitor thing.\n\nWalmart announced Walmart Prime today.  Lots of stores do online shopping and delivery these days.  [Jet.com](https://Jet.com) was a thing.\n\nOracle, Azure, Google all have AWS competitors.\n\nNFLX, Disney+, et al for video streaming.\n\nAmazon isn't getting big via acquisitions of its competitors, either.  There's no antitrust discussion like there would be if ATT tried to buy Verizon, for example.\n\nI think AMZN is safe from any kind of antitrust lawsuit.  Frankly, I think Bezos's boys are too damn smart to make the mistake of getting in that kind of position in the first place.",
        "created_utc": 1594165947,
        "id": "fx9dzzp",
        "permalink": "/r/investing/comments/hn33qt/amazon_will_be_the_next_2t_company_why_its/fx9dzzp/",
        "score": 5,
        "subreddit": "investing",
        "created": 1594194747.0
    },
    {
        "author": "JerseyFlashBoys",
        "body": "Cannot wait for this JEDI contract to be settled. Sure it's only a $10B contract, but the fact that AMZN and MSFT (and ORCL) are willing to litigate for this long over it lets you know this contract has implications much much greater than 10 year/$10B",
        "created_utc": 1595388543,
        "id": "fyu5efc",
        "permalink": "/r/wallstreetbets/comments/hveqed/what_are_your_moves_tomorrow_july_22_2020/fyu5efc/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595417343.0
    },
    {
        "author": "emnom",
        "body": "If MSFT shows high Teams growth tonight, WORK will surely dive, today's complaint means they already can't compete and need a 3rd party to help them. https://slackhq.com/slack-files-eu-competition-complaint-against-microsoft\n\nSlack will be bought by ORCL, IBM or such by a fraction of current price and slowly die.\n\nStagnated product, nothing new in the last couple of years. Puts on slack.",
        "created_utc": 1595443774,
        "id": "fyweq1a",
        "permalink": "/r/wallstreetbets/comments/hvr7i6/daily_discussion_thread_for_july_22_2020/fyweq1a/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595472574.0
    },
    {
        "author": "Power80770M",
        "body": "Nope, you're wrong. Cisco, Intel, Oracle, and Microsoft had absolutely insane valuations back then, and they were all very profitable.",
        "created_utc": 1594071020,
        "id": "fx52y7k",
        "permalink": "/r/wallstreetbets/comments/hmgm67/article_from_2013_about_the_2000_bubble_anything/fx52y7k/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594099820.0
    },
    {
        "author": "96ZJ",
        "body": "Consulted the oracle, oracle has said today is the day! The oracle then ran off with my shoe.",
        "created_utc": 1594355089,
        "id": "fxhzfdu",
        "permalink": "/r/wallstreetbets/comments/hoa9dp/what_are_your_moves_tomorrow_july_10_2020/fxhzfdu/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594383889.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "Wow you must be an Oracle, you told people to buy calls. And don’t think we don’t see that fucking VXX 50c 7/17 😂😂😂😂😂😂",
        "created_utc": 1594427620,
        "id": "fxl6ky7",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxl6ky7/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594456420.0
    },
    {
        "author": "nomoneyball",
        "body": "the oracle of his mother's basement here everyone",
        "created_utc": 1595493053,
        "id": "fyymwer",
        "permalink": "/r/wallstreetbets/comments/hw11bf/what_are_your_moves_tomorrow_july_23_2020/fyymwer/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595521853.0
    },
    {
        "author": "ArpeggiConglomerate",
        "body": "The prophecy had been told by the oracle chimp! Thanks for the daily insights",
        "created_utc": 1594815391,
        "id": "fy4xu4q",
        "permalink": "/r/wallstreetbets/comments/hrm7c7/15_july_2020_its_your_boy_chimpu_back_with_daily/fy4xu4q/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594844191.0
    },
    {
        "author": "iSufiyan",
        "body": "Called a fake reversal and dump EOD a couple of minutes ago. Call me the oracle now lmao.   \nBuy calls at 3:59. We opening green.",
        "created_utc": 1595359161,
        "id": "fysne4p",
        "permalink": "/r/wallstreetbets/comments/hv4ux9/daily_discussion_thread_for_july_21_2020/fysne4p/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595387961.0
    },
    {
        "author": "realmastodon2",
        "body": "\\&gt;cisco\n\nI always mistakenly think Oracle owns them.",
        "created_utc": 1595481989,
        "id": "fyyb2qm",
        "permalink": "/r/investing/comments/hw1jny/tesla_reports_4th_straight_quarter_of_profits/fyyb2qm/",
        "score": 4,
        "subreddit": "investing",
        "created": 1595510789.0
    },
    {
        "author": "aryalmuskan17",
        "body": "I think BJs absolutely destroys earnings like last quarter. Jumped in for 2k today\n\nCurrent bigger plays: Dell 65c 8/21, ATVI 80c 8/14, LVGO 112c 8/7. ORCL 55c 7/31",
        "created_utc": 1595287188,
        "id": "fypls8o",
        "permalink": "/r/wallstreetbets/comments/husn8s/what_are_your_moves_tomorrow_july_21_2020/fypls8o/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595315988.0
    },
    {
        "author": "CopperDome-Bodhi",
        "body": "I know. It just seems to be the popular new meme for edge signaling autists right now (a lot of the same ppl bag holding HTZ), that is, to try to overcompensate for small bank accts (&amp; pps?) by larping as like Warren Buffett is a bum and we the new gurus now. The real joke is on the DDTG gang who’ve deluded themselves into unironically thinking they are superior investors over the Oracle of Omaha himself. Lmao",
        "created_utc": 1594762847,
        "id": "fy2wnky",
        "permalink": "/r/wallstreetbets/comments/hr0jmf/earnings_thread_for_tuesday_714/fy2wnky/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594791647.0
    },
    {
        "author": "veryfloppydisk",
        "body": "Really thinking about throwing more money at BRK.B. I can just see Warren smiling in a few weeks as he reads this thread as part of his morning routine, seeing all of us repeat \"never doubt the oracle!\"",
        "created_utc": 1594815409,
        "id": "fy4xv0f",
        "permalink": "/r/wallstreetbets/comments/hrkzcb/daily_discussion_thread_for_july_15_2020/fy4xv0f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594844209.0
    },
    {
        "author": "foobargoop",
        "body": "Apple account was hacked on twitter, too. \n\nhttps://www.macrumors.com/2020/07/15/apple-twitter-account-hacked/\n\nOther hacked accounts: (*reportedly)\n\n* Microsoft\n* Cisco\n* Juniper\n* Oracle\n* Zoom\n* Citrix\n* CAP\n* F5\n* Intel\n* Adobe\n* Jenkins\n* NVIDIA\n* Apache\n* Chrome\n* Android\n* VMware\n* Siemens\n* Rust Lang Crates\n* Go Programming",
        "created_utc": 1594847987,
        "id": "fy6qbkr",
        "permalink": "/r/wallstreetbets/comments/hruzcj/what_are_your_moves_tomorrow_july_16_2020/fy6qbkr/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594876787.0
    },
    {
        "author": "showerbro666",
        "body": "I hope for my sake the 7/31 spy puts that im currently -1500 on that your prediction comes true you retarded oracle you",
        "created_utc": 1593630875,
        "id": "fwm4crq",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwm4crq/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593659675.0
    },
    {
        "author": "derprondo",
        "body": "1. Fuck Oracle\n2. Fuckity Fuck Oracle\n3. Oracle is fuck\n4. Fucking shit, Oracle\n\nIn all seriousness corporate IT spending will be focused on supporting the new work from home workforce.  I believe you may see a dip in new software spend, and Oracle would be slightly affected.\n\nHow much does Oracle database cost?  Well just get three Oracle sales rep in the same room and they'll all tell you something different.",
        "created_utc": 1594328564,
        "id": "fxgoxx4",
        "permalink": "/r/wallstreetbets/comments/hoa9dp/what_are_your_moves_tomorrow_july_10_2020/fxgoxx4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594357364.0
    },
    {
        "author": "piggyterminal",
        "body": "Alright autists, Here are some top Unusual Options ordered by Vol/OI:\n\nNAME\tSTRIKE\tEXPIRATION\tVOL/OI\tCOST\n\nSQ Put\t$80\t2020-08-14 (23 DTE)\t400%\t$62,400.00\n\nFCX Call\t$17\t2020-08-28 (37 DTE)\t256%\t$2,816.00\n\nEFA Call\t$68\t2021-03-19 (240 DTE)\t17.94%\t$187,473.00\n\nSPXL Put\t$33\t2021-01-15 (177 DTE)\t13%\t$123,500.00\n\nORCL Call\t$59.5\t2020-08-21 (30 DTE)\t8.35%\t$17,884.00",
        "created_utc": 1595380492,
        "id": "fyts3sy",
        "permalink": "/r/wallstreetbets/comments/hveqed/what_are_your_moves_tomorrow_july_22_2020/fyts3sy/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595409292.0
    },
    {
        "author": "HumpedHerDumpedHer",
        "body": "and so it comes to pass as the great oracle chimp has written",
        "created_utc": 1595533256,
        "id": "fz0hgef",
        "permalink": "/r/wallstreetbets/comments/hwd4xj/daily_discussion_thread_for_july_23_2020/fz0hgef/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595562056.0
    },
    {
        "author": "guykirk9",
        "body": "u/Icebxrg_ is the TSLA oracle fyi\n\n\nMy man had it right",
        "created_utc": 1594411741,
        "id": "fxkdgqo",
        "permalink": "/r/wallstreetbets/comments/homfbk/daily_discussion_thread_for_july_10_2020/fxkdgqo/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594440541.0
    },
    {
        "author": "Euso36",
        "body": "I'm talking about investing like I'm the oracle of omaha with  my investment knowledge while high on edibles, I love stonks.",
        "created_utc": 1594938197,
        "id": "fyatucs",
        "permalink": "/r/wallstreetbets/comments/hsd7m5/i_have_to_go_make_a_call/fyatucs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594966997.0
    },
    {
        "author": "adigabusymind",
        "body": "As an HR Consultant let me tell you what I notice LinkedIn can do that no other company is doing right now, and how I believe this will be super powerful soon.\n\nLinkedIn recently started asking people to define who is their managers, colleagues, and subordinates are... which basically builds virtual Org Charts.\n\nAdditionally, they can know how the workforce is moving between companies, and have great insights like where are most of your employees are going, or where your employees are coming from, whether be it a company or a university, match that data with your high performers and you can start to identify your most efficient talent pool.\n\ntie all of this together, and you can build a Talent Management System that crosses companies' boundaries. As soon as LinkedIn starts providing Performance Management tracking alongside their Recruitment and Learning systems. LinkedIn basically has all the components to win the Talent game from the big players like SAP/Oracle/Workday...etc.",
        "created_utc": 1595398075,
        "id": "fyui80g",
        "permalink": "/r/investing/comments/hvdisj/linkedin_announces_1000_layoffs_ahead_of_msft/fyui80g/",
        "score": 3,
        "subreddit": "investing",
        "created": 1595426875.0
    },
    {
        "author": "TwoNine13",
        "body": "We haven’t had a shit posting oracle predicting the nexts days moves in a while. What gives",
        "created_utc": 1595384001,
        "id": "fyty0l0",
        "permalink": "/r/wallstreetbets/comments/hveqed/what_are_your_moves_tomorrow_july_22_2020/fyty0l0/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595412801.0
    },
    {
        "author": "OhioDad-88",
        "body": "To quote the Oracle of Omaha himself: \"No one ever went broke making a profit\"\n\nEnjoy your profits and don't linger on hindsight.  99% of the people here would happily trade places with you.",
        "created_utc": 1594651068,
        "id": "fxxl6u1",
        "permalink": "/r/investing/comments/hqfzkq/my_gain_taking_methodology_is_costing_me_dearly/fxxl6u1/",
        "score": 2,
        "subreddit": "investing",
        "created": 1594679868.0
    },
    {
        "author": "veryfloppydisk",
        "body": "Holding as much AAPL as they are? Don't underestimate the oracle...",
        "created_utc": 1594743907,
        "id": "fy1syic",
        "permalink": "/r/wallstreetbets/comments/hqywzo/daily_discussion_thread_for_july_14_2020/fy1syic/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594772707.0
    },
    {
        "author": "beardbrazil",
        "body": "he's an oracle lmao",
        "created_utc": 1595002974,
        "id": "fydfqrx",
        "permalink": "/r/wallstreetbets/comments/hst6nm/daily_discussion_thread_for_july_17_2020/fydfqrx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595031774.0
    },
    {
        "author": "crawalk",
        "body": "Forget SPAQ, has anyone connected the dots with Hyliion’s innovated use of natural gas and Berkshire Hathaway’s recent purchase of Dominion gas company? Very interesting to say the least, could the Oracle himself be on to something new?🐢🚛🌱🤑",
        "created_utc": 1595187331,
        "id": "fyl53dq",
        "permalink": "/r/SPACs/comments/ht949c/spaqfisker_valuation_and_leverage_question/fyl53dq/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1595216131.0
    },
    {
        "author": "Jcpmax",
        "body": "The Oracle of Oklahoma aka warren “free lunch” buffet, is washed up. Getting better picks on reddit. See you guys in the hamptons next summer",
        "created_utc": 1594126538,
        "id": "fx78eg7",
        "permalink": "/r/wallstreetbets/comments/hmrv6e/daily_discussion_thread_for_july_07_2020/fx78eg7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594155338.0
    },
    {
        "author": "shuttdown700",
        "body": "Yes. They have tendies in the oven. Best valuation out of all the big techs imo, and it’s not a dead fish either like IBM or Oracle. They own the internet and as the internet of things grows, so to does their reach",
        "created_utc": 1594328652,
        "id": "fxgp4a7",
        "permalink": "/r/stocks/comments/hoa4u1/googl_google/fxgp4a7/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594357452.0
    },
    {
        "author": "threebboyz",
        "body": "If only Oracle would moon...",
        "created_utc": 1593714235,
        "id": "fwq21wf",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwq21wf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593743035.0
    },
    {
        "author": "WSBlucky",
        "body": "Yes sensei Oracle... god u were rigjt",
        "created_utc": 1595359640,
        "id": "fysoee2",
        "permalink": "/r/wallstreetbets/comments/hv4ux9/daily_discussion_thread_for_july_21_2020/fysoee2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595388440.0
    },
    {
        "author": "aryalmuskan17",
        "body": "Oracle went vertical!",
        "created_utc": 1595268542,
        "id": "fyok17l",
        "permalink": "/r/wallstreetbets/comments/hu74gf/what_are_your_moves_tomorrow_july_20_2020/fyok17l/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595297342.0
    },
    {
        "author": "adultsoup",
        "body": "Please reply to this Oracle.",
        "created_utc": 1593658984,
        "id": "fwnng9m",
        "permalink": "/r/wallstreetbets/comments/hjo2uz/second_wave_wont_cause_the_big_drop/fwnng9m/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593687784.0
    },
    {
        "author": "ohmy420",
        "body": "It's funny when it's at $205 and they buy 2 week $225 calls...  That's adding an entire Oracle or McDonalds to their value",
        "created_utc": 1594878307,
        "id": "fy85ljx",
        "permalink": "/r/wallstreetbets/comments/hruzcj/what_are_your_moves_tomorrow_july_16_2020/fy85ljx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594907107.0
    },
    {
        "author": "swaggymedia",
        "body": "I actually saw that too. I like ORCL, one of the only tech stocks that hasn't rallied big and potentially has more room to go up.",
        "created_utc": 1594602516,
        "id": "fxvv9sp",
        "permalink": "/r/options/comments/hq49p6/unusual_options_activity_in_amd_dkng_intc_ko_and/fxvv9sp/",
        "score": 2,
        "subreddit": "options",
        "created": 1594631316.0
    },
    {
        "author": "perkses",
        "body": "Ok Mr Oracle. Can u please tell me when to sell my MRNA puts, oh your holy magicness?",
        "created_utc": 1595536759,
        "id": "fz0oxm3",
        "permalink": "/r/wallstreetbets/comments/hwnfw6/vix_puts_long_term/fz0oxm3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595565559.0
    },
    {
        "author": "Frostfright",
        "body": "The Oracle: Buffett\n\nThe Retard: Cramer\n\nThe Omega Chad: Bezos\n\nThe-*this space used to advertise Amazon Prime* - Yes, Amazon purchased the fourth spot as well for use as a billboard.",
        "created_utc": 1595548782,
        "id": "fz1ckn5",
        "permalink": "/r/wallstreetbets/comments/hwn0fj/what_are_your_moves_tomorrow_july_24_2020/fz1ckn5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595577582.0
    },
    {
        "author": "aryalmuskan17",
        "body": "ORCL 55c 7/31 looks juicy af",
        "created_utc": 1595254623,
        "id": "fynsdr6",
        "permalink": "/r/wallstreetbets/comments/hu74gf/what_are_your_moves_tomorrow_july_20_2020/fynsdr6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595283423.0
    },
    {
        "author": "bullmoney",
        "body": "I’m not holding till exp. Technicals point to ORCL moving up to $58 near term. That’s my exit point. I don’t give 2 shits about the product. I just look at the math. Up 30% currently.",
        "created_utc": 1595340036,
        "id": "fyrl014",
        "permalink": "/r/wallstreetbets/comments/husn8s/what_are_your_moves_tomorrow_july_21_2020/fyrl014/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595368836.0
    },
    {
        "author": "aryalmuskan17",
        "body": "Hey oracle. Time for you to rocket up today. You do that and I’ll buy a VR set",
        "created_utc": 1595332445,
        "id": "fyr9p0e",
        "permalink": "/r/wallstreetbets/comments/hv4ux9/daily_discussion_thread_for_july_21_2020/fyr9p0e/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595361245.0
    },
    {
        "author": "bashyourscript",
        "body": "Exactly this. I remember in 1999 Sun Microsystems was so big there was a catch phrase attached to the company \"The Sun will never set.\" Fast forward 8 years later, they get bought out by Oracle for $7B. They were close $300B at their peak in early 2000.",
        "created_utc": 1593731187,
        "id": "fwr0aij",
        "permalink": "/r/stocks/comments/hjbbv7/i_do_not_understand_how_tesla_is_worth_1100_per/fwr0aij/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593759987.0
    },
    {
        "author": "Beagle001",
        "body": "My equity in ORCL calls was 00.00. Then it went north and starts heading out. Now I have -55.00. I feel weird.",
        "created_utc": 1593627578,
        "id": "fwlwxib",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlwxib/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593656378.0
    },
    {
        "author": "im_not_you11",
        "body": "Look at apxt.\n\nSuperstar tmt team (oracle cfo plus goldman Sachs' head of tech ibd who led the google ipo). They're close to 1 year in their spac life so I won't be surprised if they announce spoon.",
        "created_utc": 1594506418,
        "id": "fxrix5g",
        "permalink": "/r/SPACs/comments/hp13fr/august_spac_play/fxrix5g/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1594535218.0
    },
    {
        "author": "the6ixmemeTO",
        "body": "Wtb oracle",
        "created_utc": 1594692329,
        "id": "fxzu5d8",
        "permalink": "/r/CanadianInvestor/comments/hqrur1/your_1yr_target_price_for_tecto/fxzu5d8/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1594721129.0
    },
    {
        "author": "AlexBeingAlex",
        "body": "Oracle needs to look at itself in the mirror and accept that it is a $50 stock. Stop trying to be something you’re not you fucking idiot ass compny",
        "created_utc": 1594745526,
        "id": "fy1wblo",
        "permalink": "/r/wallstreetbets/comments/hqywzo/daily_discussion_thread_for_july_14_2020/fy1wblo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594774326.0
    },
    {
        "author": "stonksanalyst",
        "body": "There are so many to list just names. But here are the four types of moats.\n\nBranding/Intangible Assets - Is the brand iconic and recognizable? Do they have great intellectual property? If so, this is a moat. (Disney, Pepsi)\n\nSwitching Costs- Once in Business with said company, how easy is to replace them? If a company is very difficult to replace their business with, then that is a moat. (Oracle for example)\n\nNetwork Effect- As the business expands, do they create channels where only their business can run through? Are consumers becoming almost forced to use their business because they are so widely accepted? If so, this is a moat.\n\nCost Advantages (Non scale and Scale) - Does the company have access to tech that makes production cheaper or the cheapest available? Is there scale so massive competition can’t move in? Are they able to keep their prices low through other means? If so, this is a moat.\n\nHope this helps!",
        "created_utc": 1594848501,
        "id": "fy6rdow",
        "permalink": "/r/ValueInvesting/comments/hruwof/your_opinion_on_wonderful_businesses_with/fy6rdow/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1594877301.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "My porfolio: Fresh 52-week high\n\nBRK.B: Down &gt;16% from 52 week high\n\nWhere were you when Oracle of Omaha was replaced by meh",
        "created_utc": 1595023979,
        "id": "fyemgag",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyemgag/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595052779.0
    },
    {
        "author": "i__like_turtles_",
        "body": "oracle bout to print 60+ grab the 60+ calls while u still can",
        "created_utc": 1594540549,
        "id": "fxt6xp4",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxt6xp4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594569349.0
    },
    {
        "author": "Hippoman_",
        "body": "Oracle moves sideways",
        "created_utc": 1594328460,
        "id": "fxgoq9b",
        "permalink": "/r/wallstreetbets/comments/hoa9dp/what_are_your_moves_tomorrow_july_10_2020/fxgoq9b/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594357260.0
    },
    {
        "author": "scopolamine",
        "body": "Peter Thiel once famously said that being long Microsoft (and Oracle) (now add AMZN, TSLA, GOOGL, NFLX) was being short innovation.   You could say that being long growth stocks right now is akin to being short science and long stagnation.",
        "created_utc": 1594749484,
        "id": "fy24pau",
        "permalink": "/r/wallstreetbets/comments/hqywzo/daily_discussion_thread_for_july_14_2020/fy24pau/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594778284.0
    },
    {
        "author": "CamiloMarco",
        "body": "The Oracle of WSB.",
        "created_utc": 1595532921,
        "id": "fz0gqea",
        "permalink": "/r/wallstreetbets/comments/hwd4xj/daily_discussion_thread_for_july_23_2020/fz0gqea/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595561721.0
    },
    {
        "author": "quackquack105",
        "body": "Zoom and the Chinese server issue. They resolved it by signing a contract with Oracle.",
        "created_utc": 1594683153,
        "id": "fxze5av",
        "permalink": "/r/wallstreetbets/comments/hq7qx5/w_total_impressions_from_social_media_sites/fxze5av/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594711953.0
    },
    {
        "author": "Okmanl",
        "body": "I second Ark. Their MAR ratio is insane. Catherine Wood is damn near an oracle, predicting Bitcoin, Tesla, Square among a basket of other companies. Not only that but having the foresight of selling Bitcoin right at its peak as well.",
        "created_utc": 1594659124,
        "id": "fxy125o",
        "permalink": "/r/stocks/comments/hqfzok/best_etf_for_super_long_term/fxy125o/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594687924.0
    },
    {
        "author": "ma8033",
        "body": "If bank earnings set off a 2.5% plus pullback tm I’ll take an Oracle of Cleveland flair",
        "created_utc": 1594650767,
        "id": "fxxkmze",
        "permalink": "/r/wallstreetbets/comments/hq9e04/i_like_the_mods_again/fxxkmze/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594679567.0
    },
    {
        "author": "XPgains",
        "body": "I think there's a reason why Buffett dumped the Banks, and Airlines. He's become one of us and invested in to AAPL. He really is a Oracle.\n\n[https://markets.businessinsider.com/news/stocks/warren-buffett-90-billion-apple-stake-20-percent-berkshire-hathaway-2020-6-1029338684#](https://markets.businessinsider.com/news/stocks/warren-buffett-90-billion-apple-stake-20-percent-berkshire-hathaway-2020-6-1029338684#)",
        "created_utc": 1594524923,
        "id": "fxsmgdo",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxsmgdo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594553723.0
    },
    {
        "author": "giacobbedan",
        "body": "It’s because I am the oracle of Kansas City",
        "created_utc": 1594838734,
        "id": "fy66y3a",
        "permalink": "/r/wallstreetbets/comments/hrq9k3/psa_netflix_nflx_earnings_tomorrow_astrazeneca/fy66y3a/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594867534.0
    },
    {
        "author": "Power80770M",
        "body": "So what are you saying, that it's not a bubble because those are good companies? Google \"four Horsemen dot com.\" The 2000 bubble was led by Intel, Oracle, Cisco, and Microsoft. Also good profitable companies. Also grossly overvalued.",
        "created_utc": 1594090134,
        "id": "fx614z5",
        "permalink": "/r/wallstreetbets/comments/hmlx4z/so_the_last_time_this_happened/fx614z5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594118934.0
    },
    {
        "author": "Martin4fun92",
        "body": "They did a deal with oracle to move it to their exadata database which secured it up and allowed to run.  Deal was about $60M",
        "created_utc": 1594135555,
        "id": "fx7o8ae",
        "permalink": "/r/wallstreetbets/comments/hmfeen/what_are_your_moves_tomorrow_july_07_2020/fx7o8ae/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594164355.0
    },
    {
        "author": "Marcheesio",
        "body": "Companies in the NASDAQ in 2000: Microsoft, Intel, Qualcomm, Dell, Oracle, Yahoo...\n\nThere were plenty of strong, legitimate companies that popped in the dotcom bubble. Being a strong company does make it immune to overvaluations and crashes.",
        "created_utc": 1594146978,
        "id": "fx8c0hr",
        "permalink": "/r/stocks/comments/hm9131/the_five_largest_stocks_now_account_for_20_of_the/fx8c0hr/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594175778.0
    },
    {
        "author": "Dimension20fan",
        "body": "fastly and cloudflare are not the same technologies as snowflake.  \n\nSnow flake competes with GCP Bigquery, AWS Redshift and Azure Synapse and legacy technologies like Teradata &amp; Oracle.  It is doing especially well in AWS environments.  Cloudflare and Fastly are completely different technologies.\n\nSnowflake has a much larger total addressable market.",
        "created_utc": 1593905429,
        "id": "fwy7tn2",
        "permalink": "/r/stocks/comments/hl72r0/snowflake_ipo/fwy7tn2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593934229.0
    },
    {
        "author": "fsulechner",
        "body": "If you can't be up at 3 a.m. like me I would definitely have that chat window open at all times because you have a lot of people looking at a lot of different stock so you can catch some leads through them. I'm thinking about getting the oracle but I want to get my portfolio up a little bit to wear 96 a month isn't anything to worry about.",
        "created_utc": 1593889742,
        "id": "fwxh0i3",
        "permalink": "/r/pennystocks/comments/hksvdv/broke_25k_last_week_well_on_my_way_to_my_next/fwxh0i3/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593918542.0
    },
    {
        "author": "identifiedlogo",
        "body": "Ya that why I’m asking. What does the oracle know wsb doesn’t? It’s outrageous",
        "created_utc": 1594013560,
        "id": "fx2mgck",
        "permalink": "/r/wallstreetbets/comments/hlt7rc/what_are_your_moves_tomorrow_july_06_2020/fx2mgck/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594042360.0
    },
    {
        "author": "Chucktownbadger",
        "body": "Oracle is expensive AF.  They have a decent cloud offering for their shit too.  That one is kind of a coin flip.  I wouldn’t personally touch it either way.",
        "created_utc": 1594328451,
        "id": "fxgoplp",
        "permalink": "/r/wallstreetbets/comments/hoa9dp/what_are_your_moves_tomorrow_july_10_2020/fxgoplp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594357251.0
    },
    {
        "author": "SnooHamsters6947",
        "body": "Tax shelter state I like it... you can become the oracle of Montana",
        "created_utc": 1593803018,
        "id": "fwty80a",
        "permalink": "/r/wallstreetbets/comments/hkn1jf/what_would_you_do_with_your_dream_yolo_gains/fwty80a/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593831818.0
    },
    {
        "author": "GrahamBuffettDodd",
        "body": "If $TSLA crashes then The oracle of Omaha will return as the rightful king. Also, buffett has given away over $35 Billion to charity in total, so he would be a lot higher on the rankings anyway..",
        "created_utc": 1594438185,
        "id": "fxlnbkc",
        "permalink": "/r/stocks/comments/hoyljv/elon_musk_rockets_past_warren_buffett_on/fxlnbkc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594466985.0
    },
    {
        "author": "iSufiyan",
        "body": "Please refer to me as the Oracle from now on",
        "created_utc": 1595358992,
        "id": "fysn1f2",
        "permalink": "/r/wallstreetbets/comments/hv4ux9/daily_discussion_thread_for_july_21_2020/fysn1f2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595387792.0
    },
    {
        "author": "thatkidthatsux8",
        "body": "The night is the darkest before the dawn, that stimulus isn't coming, that printer will turn off or lose ink. You have false hope in your oracle JPOW. Bears will come out of hibernation in masses",
        "created_utc": 1595442562,
        "id": "fywc5d6",
        "permalink": "/r/wallstreetbets/comments/hvr7i6/daily_discussion_thread_for_july_22_2020/fywc5d6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595471362.0
    },
    {
        "author": "abby1350",
        "body": "Thank god you decided to end your silence. I have been watching your account go silent for months, I am so happy you decided to voice this information no one knew a single thing about.\n\nCongrats i think you may have just stopped the bubble from popping, truly doing gods work!\n\nYou are the true oracle of omaha, please never go silent again (we will all suffer).",
        "created_utc": 1595294343,
        "id": "fypyc12",
        "permalink": "/r/StockMarket/comments/hutidx/the_bubble/fypyc12/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1595323143.0
    },
    {
        "author": "ferpro32",
        "body": "I worked for a large company that migrated from AWS to GCP. Others prefer Azure, Zoom left AWS for Oracle Cloud. Many options to choose from",
        "created_utc": 1595328047,
        "id": "fyr4wfz",
        "permalink": "/r/wallstreetbets/comments/hup5tb/minecraft_will_stop_using_amazons_cloud_puts_on/fyr4wfz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1595356847.0
    },
    {
        "author": "StavyCrowe",
        "body": "The fucking Oracle of WSB",
        "created_utc": 1593797181,
        "id": "fwtn3fh",
        "permalink": "/r/wallstreetbets/comments/hkc6ov/tsla_traders_be_like/fwtn3fh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593825981.0
    },
    {
        "author": "Dyunder",
        "body": "Anyone holding D calls rn? Just got a massive investment by the oracle",
        "created_utc": 1593977779,
        "id": "fx0z6l8",
        "permalink": "/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fx0z6l8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594006579.0
    },
    {
        "author": "aggiebrad16",
        "body": "I haven’t looked into the deal but I’m assuming it’s not all cash. I’m sure they raised debt to finance this transaction. The cost of debt to the oracle I’m assuming is fairly cheap",
        "created_utc": 1594002422,
        "id": "fx26lbg",
        "permalink": "/r/stocks/comments/hlsrjs/warren_buffetts_berkshire_buys_dominion_energy/fx26lbg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594031222.0
    },
    {
        "author": "Cattaphract",
        "body": "Because people on the internet are fools.       \nMade some bucks and think they are the oracle of porta potti          \n         \nAlso assuming just because he made a move, he no longer thinks the bubble is not exploding and the recession is cancelled, is puttingnwords into his mouth",
        "created_utc": 1593997075,
        "id": "fx1xy0r",
        "permalink": "/r/stocks/comments/hlsrjs/warren_buffetts_berkshire_buys_dominion_energy/fx1xy0r/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594025875.0
    },
    {
        "author": "Unlucky-Prize",
        "body": "You can use the characteristics of your poop to serve as a oracle for how SPX is going to move that day. I tried it once and it worked so it must be an infallible new TA method.",
        "created_utc": 1593668388,
        "id": "fwo0yy3",
        "permalink": "/r/wallstreetbets/comments/hjbzdu/does_anyone_else_trade_best_sitting_on_the_toilet/fwo0yy3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593697188.0
    },
    {
        "author": "meeni131",
        "body": "Does being in the MS ecosystem also solve security needs making Okta and similar less useful? We own a lot of MSFT owing to a lot of the things you pointed out, and I'm trying to understand the range of companies that are directly being encroached on by their product suite. My thesis is that by being in the Microsoft ecosystem vs an oracle + Salesforce + slack + zoom + tableau + okta + etc you just have incredible cost savings in Microsoft or at least strong pricing pressure on several of these public companies moving forward.",
        "created_utc": 1594150974,
        "id": "fx8kk8u",
        "permalink": "/r/investing/comments/hmktk3/estimations_for_microsoft_in_the_next_35_years/fx8kk8u/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594179774.0
    },
    {
        "author": "fhs",
        "body": "Their typical customer base (large companies, governments) are slightly more nimble and aren't afraid to look elsewhere like MSFT, Oracle. IBM can't coast on size as it did.",
        "created_utc": 1594067441,
        "id": "fx4vmy1",
        "permalink": "/r/investing/comments/hmae2e/ibm_undervalued/fx4vmy1/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594096241.0
    },
    {
        "author": "idiotnoobx",
        "body": "Oh look another oracle",
        "created_utc": 1593610224,
        "id": "fwkxu9i",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwkxu9i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593639024.0
    },
    {
        "author": "nitrouz",
        "body": "One thing that they're protesting in the court case (Quantico Tactical vs Unifire vs Atlantic Diving Supply) is the corruption of the DLA and the contract officers. Atlantic Diving Supply for years has been found guilty of lying about their status. The same judge who oversaw Amazon/Microsoft/Oracle cloud computing contract with the Department of Defense is seeing this case as well.\n\nWill the judge allow 1 company get the majority of the contracts or will he encourage a more level playing field? This case is important as it will give Unifire a revenue stream for 10 years. If they lose, they still have the GSA and other means but SOE is big!\n\nhttps://www.washingtonpost.com/business/2019/08/20/former-ceo-atlantic-diving-supply-settles-fraud-allegations-million/\n\n\nCourse Case\nhttps://www.docketalarm.com/cases/Court_Of_Federal_Claims/1--20-cv-00120/QUANTICO_TACTICAL_INC._v._USA/",
        "created_utc": 1593902998,
        "id": "fwy3urg",
        "permalink": "/r/pennystocks/comments/hkwf79/multibillion_government_contractor_flying_under/fwy3urg/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593931798.0
    },
    {
        "author": "noobstoch",
        "body": "Issue being I am not in front of my computer all the time at work. So I cannot be constantly monitoring and checking for lead in the chat window. That is the reason I subscribe to the news hoping to get some leads in the morning before I head to work and set a limit for auto execution of plays. I can start giving 3 am a shot if it means profits. \n\nThe Oracle is on sale for $9 for a week trial.  Planning on driving to work tomorrow night so I can start trying from Monday. If that proves out to be useful I will probably just stick to that and unsubscribe to news alerts because the oracle is a cheaper option. Right now I don't think I can afford both or even just news alerts by themselves...",
        "created_utc": 1593891375,
        "id": "fwxjx17",
        "permalink": "/r/pennystocks/comments/hksvdv/broke_25k_last_week_well_on_my_way_to_my_next/fwxjx17/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593920175.0
    },
    {
        "author": "shawman123",
        "body": "I think one question we should ask every year. Is there anything new about the company that changes your view that its a good investment longterm. Back in 2000 Microsoft was riding high but there was tons of bad news and it lagged for next decade or so. Post Balmer company pivoted to a cloud based and again is a huge player.\n\nGE, Cisco did not reinvent themselves, if anything GE went downhill post JW while Cisco was hit hard by white glove manufacturers of their core products and did not innovate fast enough to be relevant. On the other hand Amazon, Apple etc reinvented themselves significantly since 2000 and are the biggest players along with Microsoft.\n\n&amp;#x200B;\n\nSo blindly following even Oracle of Omaha is not a great idea. He avoided most tech firms and invested in oil/energy/banks. Not exactly ideal approach in past 2 decades. Thankfully post Todd Combs and Tedd Weschler coming in, Berkshire has invested in some tech firms and now Apple is the biggest position in Berkshire portfolio.",
        "created_utc": 1594866783,
        "id": "fy7ooi9",
        "permalink": "/r/investing/comments/hrwe84/warren_buffet_if_i_had_never_sold_a_stock_i_would/fy7ooi9/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594895583.0
    },
    {
        "author": "Dotz0cat",
        "body": "ORCL",
        "created_utc": 1594867704,
        "id": "fy7q8mi",
        "permalink": "/r/wallstreetbets/comments/hrorfa/i_will_invest_100000_into_whatever_is_the_top/fy7q8mi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594896504.0
    }
]