[
    {
        "author": "yolowsblfg",
        "body": "with u on that one, had calls when it broke above like 82/4ish and sold and just bought back today, smaller size tho. nxpi, amba, asml, mrvl, swks, avgo, oled all poppin off. holding avgo/oled",
        "created_utc": 1602624916,
        "id": "g8qgwzo",
        "permalink": "/r/wallstreetbets/comments/jalaq5/what_are_your_moves_tomorrow_october_14_2020/g8qgwzo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602653716.0
    },
    {
        "author": "dvdmovie1",
        "body": "I don't know that 5G will have quite the consumer demand thought. I'd look at the tower companies (AMT, CCI, SBAC). I'm not a huge fan of management, but QCOM. SWKS. I'd have said XLNX, but not now given that's up big pre-market due to rumor of AMD buying it.",
        "created_utc": 1602234601,
        "id": "g877pbw",
        "permalink": "/r/investing/comments/j7bvli/daily_advice_thread_all_basic_help_or_advice/g877pbw/",
        "score": 1,
        "subreddit": "investing",
        "created": 1602263401.0
    },
    {
        "author": "MadCritic",
        "body": "EXPI SWKS APPS SE CRNC",
        "created_utc": 1602348110,
        "id": "g8c64ux",
        "permalink": "/r/stocks/comments/j8f19q/looking_for_new_stocks/g8c64ux/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602376910.0
    },
    {
        "author": "MadCritic",
        "body": "Too much Tesla and Apple imo. Double down on that and get some EXPI SWKS AMD FB SE APPS NIO CRNC",
        "created_utc": 1602348502,
        "id": "g8c6yis",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g8c6yis/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602377302.0
    },
    {
        "author": "par-d",
        "body": "Skyworks Solutions. Look into that for yourself but amazing balance sheet and long term perspectives",
        "created_utc": 1603044274,
        "id": "g98r775",
        "permalink": "/r/wallstreetbets/comments/jdk5s9/5g_stocks_nokia_vs_ericsson/g98r775/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603073074.0
    },
    {
        "author": "Bexanderthebex",
        "body": "Skyworks",
        "created_utc": 1601691117,
        "id": "g7h2pqy",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7h2pqy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601719917.0
    },
    {
        "author": "RWrob11",
        "body": "15m \n\nTSLA-70%\n\n   I believe they have the potential to be a multi-trillion dollar company because of there innovation in there automotive, autonomy, and energy business segments.\n\nSKWS/FB-20%\n\n   The 5G opportunity with Skyworks is the main part of my thesis, but they are also have great financials and are well managed. Facebook is just such a cash cow of a business with some intriguing growth opportunities, like shopping and monetizing WhatsApp/Messenger.\n\nCash-10%\n\nI’m done buying TSLA and have been looking at other disruptive companies like Square, but haven’t been really convicted to buy anything else. I also have been trying to be more disciplined in my cash position after being low during the crash, missing great deals.",
        "created_utc": 1602084071,
        "id": "g80deiy",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g80deiy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602112871.0
    },
    {
        "author": "yolowsblfg",
        "body": "watch list (based on hittin new highs today...) anyone know anything/dd on things in **BOLD**? the ones that aren't bolded i am at least familiar with..\n\n**aaww**, **adpt**, **amsc**, bgne, cost, **crl**, ctas, etsy, **fate**, frc, frpt, **gnss**, hubs, idxx, ipgp, logi, now, okta, payc, pton, regn, rok, sgen, sq, swav, swks, **syk**, team, **tgtx**, trex, tsm, **ttgt**, ttd, twlo, **txg**, ups, vcyt, veev, vrns, **vrsk**, **wst**,",
        "created_utc": 1602558748,
        "id": "g8nq4sz",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8nq4sz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602587548.0
    },
    {
        "author": "pineapplestring",
        "body": "SWKS",
        "created_utc": 1603294563,
        "id": "g9jsvdw",
        "permalink": "/r/stocks/comments/jfeogi/5g_stocks/g9jsvdw/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603323363.0
    },
    {
        "author": "MadCritic",
        "body": "Hi r/stocks \\- I'm 19 and have around $17k invested, mostly in growth stocks as the dividend tax is rather high in Denmark, so I don't see the point in invested in McDonald's and the such.  Anyway here's my portfolio\n\nAMZN 16,64%\n\nENPH 10,05%\n\nTSLA 9,07%\n\nAMD 8,67%\n\nAPPS 8,65%\n\nEXPI 8,55%\n\nSWKS 8,46%\n\nSE 8,14%\n\nMA 7,14%\n\nFB 6,92%\n\nPTON 6,82%\n\nI realize it's very techy, and I would like a suggestion on diversification. Also, am I too invested in growth?",
        "created_utc": 1601539505,
        "id": "g79mfkj",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g79mfkj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601568305.0
    },
    {
        "author": "happierdayz4me2",
        "body": "QRVO and SWKS are in my Roth portfolio but only shares. I also have smaller stakes of INSG and MRVL (and cien, amt etc). I wasn't trying to promote or even really suggest buying n0k beyond the fact they have 3 things going for them that have landed them on my more ambitious portfolio, where I buy calls/LEAPS and lately lose money on. First two are safety related in an uncertain 5G future. They're very undervalued, when their dividend comes back they'll be lucrative and if it's just that I'll transfer shares to my roth. They won't go bankrupt, Finland and Europe have too much stake in them. Third is potential. They lost a major verizon contract yet won 100 other 5G ones. Theyre giving out a lot of tastes. They're also an acquisition target yet a merger with say er!c could potentially allow them to become formidable in the sphere. \n\nTheir past management has been atrocious, they do carry a lot of debt, and when I initially excercised a few call options on them this summer I figured I'd leave it as such. when my stop loss was triggered I learned of the new ceo's strategy and am looking at them in a different light. I think they could be a direct or indirect recipient of US 5G infrastructure investment and see a sizable upside, which is why I'm still holding a thousand (recently acquired) shares. Again, very different from qc0m and aforementioned 5G plays but not dismissable for me. Of course, if it's still trading like this come January I'll sell and hold leaps but I think something will. They're not special i just dont see the same downside risks, some of which feel like I'm betting on horses.",
        "created_utc": 1601697908,
        "id": "g7he2ks",
        "permalink": "/r/wallstreetbets/comments/j46ojn/disruptive_companies/g7he2ks/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601726708.0
    },
    {
        "author": "Ehralur",
        "body": "That's not at all what I said. What I said was that BMW and Merc were probably their biggest customers, so if they lost a large amount of their orders it's quite likely to have come from them. And there are many companies that are very reliant on 1 or 2 big customers, especially small companies. If for example Skyworks were to lose Apple tomorrow, they need to fire half their staff. And that's a 25B dollar company.",
        "created_utc": 1601769017,
        "id": "g7kuwzg",
        "permalink": "/r/stocks/comments/j4ekgo/tesla_to_acquire_german_battery_assembly_maker/g7kuwzg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601797817.0
    },
    {
        "author": "MadCritic",
        "body": "EXPI APPS ENPH SWKS",
        "created_utc": 1601986965,
        "id": "g7vzb8t",
        "permalink": "/r/wallstreetbets/comments/j62ihd/daily_discussion_thread_for_october_06_2020/g7vzb8t/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602015765.0
    },
    {
        "author": "AccomplishedWin2",
        "body": "Look dude, I will give you a short list of sectors. However, I wouldn't be full on stocks that did great in the 1st round of covid in spring (like zoom) cuz people got used to this shit and there is not a lot of space to grow. Take zoom for exemple. Now everybody is using it and those who dont wont convert (like most of the universities in EU. They make their courses on MSFT Teams or GOOGLE classroom cuz Zoom is shitty). \n\nNow, here's the list:\n\n1. Retail (both online and physical): Walmart, Costco, Target, Amazon, Shopify, Etsy, Best Buy, Home Depot, Lowe's\n\n2. Construction: DR Horton, TOLL Brothers due to low interest rates \n\n3. Materials: only wood shit or lithium if you are risky af. Silver and gold suck atm but will get a boost soon due to the stimulus\n\n4. Tech, semis, comms: (carefull with the FAANGs. Might get blown if Biden wins) Crowdstrike, Telekom, Verizon, NVIDIA, Intel, AMD, Skyworks, Broadcom, Keysight, Texas Instrumets, Taiwan Semi, you get the idea. Every 5G and powerfull cyber company. \n\n5. Consumer discretionary (if you are truly a bear and life sucks in COVID, quarantine shit, depression and you dont like easy money): General Mills, Pepsi, Cola, other bullshit like this\n\n6. This is my power move: Energy: EVERY FCKING THING THAT IS RENEWABLE ENERGY. Buy an etf and it should be all good. I have a position in one since last month, up 20%. \n\n7. Video Games: EA, Activision, Sony, MSFT, Ubisoft",
        "created_utc": 1601974470,
        "id": "g7vn581",
        "permalink": "/r/investing/comments/j5tasw/what_are_some_covid_safe_sectors/g7vn581/",
        "score": 1,
        "subreddit": "investing",
        "created": 1602003270.0
    },
    {
        "author": "ILikuhTheTrade",
        "body": "Nokia prebuilt their 5g infrastructure then regulations came out and the stuff they built wasn't up to code so they had to redo everything, Skyworks is probably going to be a better one but you're a bit late on this, 5g is already here.",
        "created_utc": 1603077575,
        "id": "g9ag891",
        "permalink": "/r/wallstreetbets/comments/jdk5s9/5g_stocks_nokia_vs_ericsson/g9ag891/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603106375.0
    },
    {
        "author": "Seahawksguy206",
        "body": "Skyworks (SWKS)",
        "created_utc": 1603305412,
        "id": "g9kfhpf",
        "permalink": "/r/stocks/comments/jfeogi/5g_stocks/g9kfhpf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603334212.0
    },
    {
        "author": "Long-John2",
        "body": "I am not interested in Nokia; poor management, high debt and poor execution lead to trouble no matter what the potential is. Although Erickson has a better potential to be dominant given Huawei mishaps. I believe skyworks and QRVO and to less extent XLNX, Marvell and Inseengo will benefit from the transition to 5G. Time will tell but I agree with QCOM theory",
        "created_utc": 1601695850,
        "id": "g7hask9",
        "permalink": "/r/wallstreetbets/comments/j46ojn/disruptive_companies/g7hask9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601724650.0
    },
    {
        "author": "MadCritic",
        "body": "EXPI APPS ENPH TSLA AMD SWKS SE PTON VWS",
        "created_utc": 1601574030,
        "id": "g7b4fvx",
        "permalink": "/r/wallstreetbets/comments/j35to3/daily_discussion_thread_for_october_01_2020/g7b4fvx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601602830.0
    },
    {
        "author": "OogieBoogie114",
        "body": "Yeah getting that one regardless I like it more than skyworks or marvell",
        "created_utc": 1603062521,
        "id": "g99qxxw",
        "permalink": "/r/wallstreetbets/comments/jdk5s9/5g_stocks_nokia_vs_ericsson/g99qxxw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603091321.0
    },
    {
        "author": "MadCritic",
        "body": "&amp;#x200B;\n\n|AMZN|11.89%|\n|:-|:-|\n|EXPI|6.5%|\n|SWKS|6%|\n|AMD|6%|\n|PTON|6%|\n|NIO|6%|\n|TDOC|5.84%|\n|SE|5.5%|\n|FB|5%|\n|MA|5%|\n|GOOGL|5%|\n|SHOp|4.89%|\n|CRNC|4.5%|\n|BYND|4.5%|\n|UNH|4.5%|\n|VWS|4.5%|\n|APPS|4.38%|\n|ACRX|4%|\n\n&amp;#x200B;\n\nThis is how I'd like to rebalance monday. Thoughts? Also I was going to sell my tesla shares monday too, but wondering if I should wait to Wednesday.",
        "created_utc": 1602956052,
        "id": "g94e31t",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g94e31t/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602984852.0
    },
    {
        "author": "Thymooo",
        "body": "Skyworks Solutions (SWKS) is also a pretty popular stock with an A-grade balance sheet.",
        "created_utc": 1602092465,
        "id": "g80ugs3",
        "permalink": "/r/stocks/comments/j6uqsu/financial_independence_the_ten_largest_debt_free/g80ugs3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602121265.0
    },
    {
        "author": "JPete4985",
        "body": "It’s all about market outlook. Look at those companies 12 month and 5 year targets and you will understand. In the meantime as a new investor I’d recommend picking up AIG, GE, CCL, AMC, BAC, XLE, XLF, HPE, NOK... these are all stocks that are almost guaranteed to double if not triple over the next 3-5 years. A great place to park some long term cash... especially GE as they restructure. Energy sectors and oil will double as well as demand rises as we break out of the pandemic. Same for airlines... I see Alaska Airlines as the best value play. If I were you I’d invest in all of these industries that are down 50-70% and wait to reap your rewards. Value investing is better than chasing momentum in my opinion. Buy low sell high, easy enough. There are a couple momentum stocks I’d buy right now as in ASAP! Apple, Verizon, TMobile, Skyworks, Bloom Energy, Qualcomm, WiFi (boingo), these companies are set to reap the rewards and huge cash flow into 5g. SPY is a great diversified etc to park some cash too. It’s the ultimate set it and forget it stock. I would definitely recommend you check out some great etfs as a new investor.",
        "created_utc": 1602478665,
        "id": "g8kchlf",
        "permalink": "/r/StockMarket/comments/j9fdlj/why_are_so_many_stocks_at_an_all_time_high/g8kchlf/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1602507465.0
    },
    {
        "author": "MadCritic",
        "body": "AMZN EXPI AMD PTON SWKS",
        "created_utc": 1602438269,
        "id": "g8i8i8u",
        "permalink": "/r/stocks/comments/j93sba/you_have_to_put_all_your_money_into_5_stocks_and/g8i8i8u/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602467069.0
    }
]