[
    {
        "author": "NorseLegend",
        "body": "Where my QCOM homies at?",
        "created_utc": 1601556788,
        "id": "g7a45k4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601585588.0
    },
    {
        "author": "brbcripwalking",
        "body": "TSM just broke 82 resistance and has been running all week.\n\n&amp;#x200B;\n\nPeep the open interest on the 10/16 80c compared to all the other strikes.\n\n&amp;#x200B;\n\nI am holding a small position of 10 calls since $2.25 so double ($4.40) as of now. 10/15 is their earnings. Regardless of pricing, volatility wise (44% right now), it gonna start spiking in the week of. Still 2 weeks left. I may sell and reposition if the market looks shaky with failed stimulus.\n\n&amp;#x200B;\n\nSMIC is their biggest rival (TSM S tier, SMIC and Samsung being Tier A) and they're basically blacklisted by the US using sanctions,  for being a supplier to Huawei and the Chinese military (do your own research on it but here's a link).\n\n[https://www.fool.com/investing/2020/10/01/tsmcs-biggest-chinese-rival-gets-slammed-by-us-san/](https://www.fool.com/investing/2020/10/01/tsmcs-biggest-chinese-rival-gets-slammed-by-us-san/)\n\n&amp;#x200B;\n\nSome catalysts:\n\nThey manufacture for AMD (big news coming on 10/8, also PS5 and Xbox X use AMD chips), Qualcomm (5G expansion), NVIDIA (ARM continuation), and Apple (iPhone 12 announcement, TSM ran up to an all time high of 85 during the Watch and iPad event.) Also World Championships for League of Legends and various E-Sports. Free advertising, TSM TSM TSM.\n\n&amp;#x200B;\n\nObviously do your own research and never go all in on DD you find online, but if there's a significant red day, I'm loading up 10 more. I'll be selling day before earnings because I don't like to risk it.",
        "created_utc": 1601611936,
        "id": "g7d7zk7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601640736.0
    },
    {
        "author": "NorseLegend",
        "body": "QCOM you sexy bitch",
        "created_utc": 1601559486,
        "id": "g7a8eyq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601588286.0
    }
]