[
    {
        "author": "cwwmbm",
        "body": "What's even more impressive is this: https://twitter.com/EricBalchunas/status/1340073777573539840\n\n&gt;NEXT LEVEL: $TSLA just obliterated the all-time volume record for an equity w/ $148b worth of shares traded today, beating $SPY's $118b high water mark set during March chaos. For perspective, $MSFT trades about $5b/day.\n\nAlso:\n\n&gt;Another mind-melter: $TSLA traded more today than the next 25 most active stocks COMBINED.\n\nAnd continued:\n\n&gt;Some asking what's past high water mark for a single stock. Not 100% sure but looking at Apple and Amazon, their all time highest volume days are a mere $43b and $31b respectively.\n\n\nSo... TSLA just traded at 3-4x of the **maximum** volume that AAPL and AMZN has seen. What a time to be alive.",
        "created_utc": 1608351058,
        "id": "ggbun7q",
        "score": 152,
        "subreddit": "investing",
        "created": 1608379858.0
    },
    {
        "author": "CouIomb",
        "body": "Stimulus will get gobbled up by big tech. People buying gifts on amazon, Apple tech, Microsoft computers, etc with their easy come easy go money. NDX fuel.",
        "created_utc": 1608510064,
        "id": "ggjadte",
        "score": 124,
        "subreddit": "StockMarket",
        "created": 1608538864.0
    },
    {
        "author": "gorays21",
        "body": "I will do 14 stocks.\n\nSquare, Cloudflare, Microsoft, AMD, NVDIA, Sea limited, Fastly, Nio, Palantir, ICLN, Draftkings, Disney and Alibaba.",
        "created_utc": 1608310916,
        "id": "gg9nhpq",
        "score": 95,
        "subreddit": "stocks",
        "created": 1608339716.0
    },
    {
        "author": "jonnydoo84",
        "body": "it's cause they figured it out before anyone else and dealt with it linking it to SolarWinds. Microsoft got hacked among others. This could instill confidence in Feye. I dont know if this is the correct answer but someone brought it up and I could see it being possible.",
        "created_utc": 1608342376,
        "id": "ggbgk8w",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1608371176.0
    },
    {
        "author": "Guru_of_Spores",
        "body": "Just leave it . Microsoft is a solid hold.",
        "created_utc": 1609290413,
        "id": "ghg9kby",
        "score": 45,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1609319213.0
    },
    {
        "author": "Okmanl",
        "body": "\nThe best strategy when it comes to investing is one that limits emotions as much as possible. Buying and holding is that strategy. Buying and looking at your portfolio all the time to determine when to sell, puts you at greater risk for emotions to get involved. Then you end up being one of those people selling PLTR for only 10% gains. Or MSFT/TSLA/LMND right before it they took off after trading sideways for a while. \n\n The best performing portfolios tend to belong to those who have died or those who’ve forgotten they even had a portfolio. Not those who actively trade. \n\n\nLastly you don’t know whether or not a company will suddenly do a complete 180 like AMD when Lisa Su took over or MSFT when Satya took over. Which is why I advocate just holding onto your assets.",
        "created_utc": 1608414550,
        "id": "ggel2ia",
        "score": 43,
        "subreddit": "stocks",
        "created": 1608443350.0
    },
    {
        "author": "ElmerFUDz",
        "body": "When Bill Gates retired from Microsoft a few years back, Jimmy kimmel was apparently called upon to participate in a final-day roast of the billionaire software tycoon. Unfortunately, Kimmel says the joke-fest didn’t go so well.\n\n Kimmel explained that although he was led to believe that Gates was on board with the roast, he didn’t seem to find Kimmel’s routine funny in the slightest.\n\n“It was a disaster. I insisted that he be onstage with me if I was going to do this, because the key to a roast is the people in the audience see the roastee laughing. Well, unfortunately, the roastee was not laughing. Not even a little bit.”\n\nOne of Kimmel’s jokes was that the only reason why Bill Gates didn’t get a perfect score on the SAT was because he missed the one that asks what a vagina looks like.\n\n\nKimmel went on to say that the only person in the room who laughed at his jokes was Tesla CEO Elon Musk. “He was laughing like a maniac,” the late-night host recalled. “Which in a way made it worse.”\n\nBy the end of the night, Kimmel said that Gates was referring to him simply as “the comedian.”\n\n“He was like, ‘We couldn’t get Jay Leno for this?'\"",
        "created_utc": 1608333102,
        "id": "ggb0fpt",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1608361902.0
    },
    {
        "author": "beakerbeaker",
        "body": "Why the fuck was there zero commentary or questions surrounding the digital revenue share agreements with MSFT or Sony??? And not a single one of the sellside idiots asked about the RC activist campaign???",
        "created_utc": 1607468529,
        "id": "gf3srcj",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1607497329.0
    },
    {
        "author": "NastyNas0",
        "body": "Tesla’s market cap isn’t 5 trillion though. PLTR at $3k would make it worth as much as APPL MSFT and AMZN combined",
        "created_utc": 1608319662,
        "id": "gga878p",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1608348462.0
    },
    {
        "author": "gorays21",
        "body": "Here are my picks:\n\nSquare, Cloudflare, Microsoft, AMD, NVDIA, Sea limited, Fastly, Nio, Palantir, ICLN, Draftkings, Disney and Alibaba.",
        "created_utc": 1608223973,
        "id": "gg5n0jf",
        "score": 29,
        "subreddit": "stocks",
        "created": 1608252773.0
    },
    {
        "author": "edible_scissors",
        "body": "Honestly they did an ok job of providing their guidance on going digital and cutting under performing stores.  The future seems at least a little hopeful. \n\n**BUT**\n\nNo mention of the msft deal or Cohen isn't cool.  You have someone on the verge of taking you over, say something.",
        "created_utc": 1607469319,
        "id": "gf3uc5w",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1607498119.0
    },
    {
        "author": "HondaSpectrum",
        "body": "I’d say this is the reason Microsoft followed suit\n\nM1 success couldn’t have been any more overwhelming in terms of reaction to chip performance\n\nWhen was the last time a computer chip got this much publicity ? Never",
        "created_utc": 1608345483,
        "id": "ggblsb2",
        "score": 27,
        "subreddit": "stocks",
        "created": 1608374283.0
    },
    {
        "author": "Uberkikz11",
        "body": "They fucks were short tens of millions of shares of GameStop and didn't close when the price was $3. Didn't close at $8 when Cohen first whipped his dick out at 9%. Still didn't close after the Microsoft deal because they called it fake news and vomited mountains of puts to smash the parabolic price action. STILL HAVEN'T FUCKING CLOSED BECAUSE THEY ARE TRAPPED.\n\nThese rumors that they and other 🌈 🐻 short institutions are trying to find a consortium of longs to purchase a massive block of shares from in a structured agreement lend more fuel to the fire that must burn inside of every retail investor TO GET WHAT IS OURS. \n\nThese pieces of 💩 tried to destroy a company whose balance sheet had more net cash on it than the entire share price. They deserve everything they get. \n\nStop buying shares in margin accounts, you're literally fueling the lendable share supply for these leeches to feed off every time Robinhood or whatever piece of shit broker your retarded asses use. BUY IN A CASH ACCOUNT WITHOUT LENDING ENABLED. I won't go into the details for you, but if you're buying shares in RH with margin enabled it does us no good and hands them the supply they so desperately need.\n\nThe next few months will be rocky, look at the price rises and falls the longs who have been in since mid-single digits have already overcome. Look at u/DeepFuckingValue. He was laughed at in 2019. Most of 2020. Redemption has been his and ours these past few months. And the next few will prove to be greater still. \n\nThere has never been a stock so durably shorted like this in the history of financial markets. There will be more FUD. But know this. Those of us that have been through the prior battles know the war is ours, and ours alone to win.\n\nGME GANG, ASSEMBLE!",
        "created_utc": 1609281168,
        "id": "ghfs0u0",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1609309968.0
    },
    {
        "author": "agentargo",
        "body": "Think of Git being Email. Then think of GitHub being GMail. Then think of GitLab as Outlook. Gmail is always managed by Google. Outlook can be managed by your corp IT or by Microsoft.",
        "created_utc": 1608347287,
        "id": "ggbor4b",
        "score": 24,
        "subreddit": "investing",
        "created": 1608376087.0
    },
    {
        "author": "RIZup18769",
        "body": "Pre-splits stock price from ipo to today;\n\nTSLA - $3,250\n\nAAPL - $29,000\n\nMSFT - $64,000\n\nAMZN $38,400\n\nI’m just sayin is all",
        "created_utc": 1608757441,
        "id": "ggu05r2",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1608786241.0
    },
    {
        "author": "awall630",
        "body": "I’m putting my entire account in MSFT 3/19 200c for nostalgia’s sake.",
        "created_utc": 1608170060,
        "id": "gg3hm7p",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1608198860.0
    },
    {
        "author": "MBlaizze",
        "body": "I watched Microsoft go sideways for years and years, and then explode upwards 1000%.",
        "created_utc": 1608314088,
        "id": "gg9v3tv",
        "score": 21,
        "subreddit": "stocks",
        "created": 1608342888.0
    },
    {
        "author": "lasergurke6",
        "body": "Microsoft is too resonable for this subreddit",
        "created_utc": 1609111367,
        "id": "gh8e4kx",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1609140167.0
    },
    {
        "author": "neutralpoliticsbot",
        "body": "**Lets check on our girl Nancy Pelosi and her option plays:**\n\nAt the end of February 2020 she purchased:\n\n 150 MSFT $130 strike calls expiration 3/19/21 at a price of **60.20**\n\n100 MSFT $140 strike calls expiration 3/19/21 at a price of **51.55**\n\nPelosi paid around **$1.4** million for these options and they are worth today around:\n\n#$2,100,000\n\nThe funny thing is that she purchased this right before the COVID dip and held it through the pandemic. This is why we call her Diamond Hands Pelosi around here. \n\nSo what is her latest options move? Heavy bet on PayPal this summer, she got a lot of shares and Purchased 50 call options with a strike of $100 and an expiration date of 01/21/2022\n\n*source: https://disclosures-clerk.house.gov/PublicDisclosure/FinancialDisclosure*",
        "created_utc": 1607992432,
        "id": "gfvc0k3",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1608021232.0
    },
    {
        "author": "Jimz2018",
        "body": "And now custom Microsoft cpus coming and Apple already has m1.  GG Intel",
        "created_utc": 1608408434,
        "id": "gge7mn3",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1608437234.0
    },
    {
        "author": "realister",
        "body": "**Lets check on our girl Nancy Pelosi and her option plays**\n\nAt the end of February 2020 she purchased:\n\n&gt;150 MSFT $130 strike calls expiration 3/19/21 at a price of 60.20\n\n&gt;100 MSFT $140 strike calls expiration 3/19/21 at a price of 51.55\n\nPelosi paid around $1.4 million for these options and they are worth today around:\n\n#$2,300,000\n\nThe funny thing is that she purchased this right before the COVID dip and held it through the pandemic. This is why we call her 💎 Diamond Hands Pelosi around here.\n\nSo what is her latest options move? Heavy bet on PayPal this summer, she got a lot of shares and Purchased 50 call options with a strike of $100 and an expiration date of 01/21/2022\n\n*source: https://disclosures-clerk.house.gov/PublicDisclosure/FinancialDisclosure*",
        "created_utc": 1609203376,
        "id": "ghcex3r",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1609232176.0
    },
    {
        "author": "TexasExPat1",
        "body": "BREAKING: GameStop acquires Microsoft after lawyers uncover hidden clause in October deal, more at 11.",
        "created_utc": 1606964850,
        "id": "geg6dcg",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1606993650.0
    },
    {
        "author": "LaPulgaAtomica87",
        "body": "You're absolutely right---actually you made one minor mistake you're comparing the June 18 QQQJ call to the June 30 QQQ call. The price of the June 18 QQQ call is ~ $5.70 which buttresses your point even more. \n\nAnd you can see this from their IV: QQQJ has an IV of 28% while QQQ has an IV of 21%. So yes, all things being equal, QQQ is cheaper than QQQJ.\n\nAll that said, I am still balls deep in QQQJ calls because I believe over the next year, it will outperform QQQ for the reason OP stated: it has many more beaten down companies than QQQ. The big boys in QQQ have all recovered for the most part. Another crucial point is that QQQJ has more non-tech companies so if there is a rotation out of tech, it will suffer less than QQQ.\n\nI'm very bullish about this etf. I saw a WSJ article where someone did a historic backtest from 2016 or 2017 and QQQJ outperformed QQQ even with the insane run of the big boys MSFT, AAPL, NVDA &amp; ADBE during that period.",
        "created_utc": 1608433556,
        "id": "ggfpbr5",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1608462356.0
    },
    {
        "author": "Meymo",
        "body": "It reminds me of this thought: *When does the breadth of contemporary evidence supersede the depth of historical data?*\n\nGenerally, I agree with your overall sentiment, but not for the reasons you cite here. I think there's a couple of things being conflated in the messaging. First, a 3-fund portfolio isn't going to get you some kind of multi-digit percentage return most of the time. You invest in a 3-fund portfolio if you're trying to preserve your money. Comparing a 3-fund portfolio to (insert growth fund here) isn't quite a fair comparison because the goals are different.\n\nAdditionally, I will point out that thematic investing isn't new. ARK and others have been following themes to great success, and as long as the theme remains hot (technology, clean energy, genomics, medical devices, etc.) the funds will continue to do well. [IHI](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=1985&amp;firstMonth=1&amp;endYear=2020&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=10000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;showYield=false&amp;reinvestDividends=true&amp;benchmark=VFINX&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=IHI&amp;allocation1_1=100), for example, has done a compounding return of of 15% per year since inception (2007), blowing away the SPY in all metrics (less drawdowns, higher return, lower volatility, etc.).\n\nTraditional thinking states that you can't beat the market over time, so why even bother trying. People who believe this accept it as fact, when there are so many other factors involved (e.g. was the person who picked stocks buying the same stocks every time they got paid?).  I expect this notion to be challenged over the next decade, and quite frankly, I hope the thinking dies out. There are plenty of funds and folks buying baskets of stocks (e.g. 10-20 stocks) especially now with fractional shares weighted for specific targets and are continuing to ascend to new highs.\n\nAs much as people want to speak poorly of strategies that differ from their index investing, rarely have I ever seen someone address the elephant in the room which is, \"By not investing in the index, you were able to beat the index.\" I've had many debates here about this because there is a camp of diehards who refuse to look at any kind of alternative data. If I say [here's an example of a basket of 3 stocks that has beat the SPY for the past 26+ years](https://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=1985&amp;firstMonth=1&amp;endYear=2020&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=100000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;showYield=false&amp;reinvestDividends=true&amp;benchmark=VFINX&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=MSFT&amp;allocation1_1=33&amp;symbol2=WM&amp;allocation2_1=33&amp;symbol3=INTU&amp;allocation3_1=34), is that enough evidence to show that consistently beating the market is at least *possible?? (put your pitchforks down, I did not say guaranteed).* I've been talking about this for the entire lifecycle of this reddit account, so it's nothing new.\n\nIf you're a person who is looking for outsized returns, you'll need to go outside the index. Momentum is one strategy that has consistently worked to accomplish this.\n\nGood luck",
        "created_utc": 1608399424,
        "id": "ggdp0dg",
        "score": 18,
        "subreddit": "investing",
        "created": 1608428224.0
    },
    {
        "author": "Frenchiie",
        "body": "It could also hit $150 in 2021. Nobody knows shit.\n\nI'm not biased, i am heavily vested in MSFT.",
        "created_utc": 1608693177,
        "id": "ggrf4tz",
        "score": 18,
        "subreddit": "stocks",
        "created": 1608721977.0
    },
    {
        "author": "StonkGoUp",
        "body": "You sit by the Christmas fire surrounded by your whole family. All is right in the world. Pfizer vaccines have been delivered to every household in America with the help of Elon’s Telsas. You open your Robinhood account and wait for open when SPY will hit 400. Your PFE and TSLA calls are already up 10,000% and they will keep rising. You bought 1,000 shares of MSFT, but you don’t know why. You sip your hot chocolate while the autism from the vaccine fills your body. Life is good",
        "created_utc": 1607715858,
        "id": "gffk0md",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1607744658.0
    },
    {
        "author": "justseeyoutonight",
        "body": "Was such a retard for buying MSFT in the middle of a pandemic, just before a new console generation and with everyone using Office.\n\nThe future is GME.",
        "created_utc": 1607291514,
        "id": "gevmsvg",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1607320314.0
    },
    {
        "author": "gorays21",
        "body": "Square, Cloudflare, Microsoft, AMD, NVDIA, Sea limted, Fastly, Nio, Palantir, ICLN, Draftkings, Disney and Alibaba.",
        "created_utc": 1608221264,
        "id": "gg5hgxj",
        "score": 17,
        "subreddit": "stocks",
        "created": 1608250064.0
    },
    {
        "author": "FartSpeller",
        "body": "I’m gonna make this real simple for you.  Forget about the names of the Greeks for a min, (since you don’t know what they mean anyway 😉). \n\nEvery option contract premium (how much it costs to buy said contract) is the total of its intrinsic value and extrinsic value. \n\nIntrinsic value is how far in the money the contract is.  So, if MSFT is $215, and you have a $210 strike call, there is $5 (per share) of intrinsic value there.  That means you’re holding a contract that lets you buy shares $5 cheaper than on the open market.  Now, people who sell options are smarter than you, so they aren’t going to let you just have that $5/share for free so the contract is gonna cost you that $5 and then some. \n\nThe “and then some” is the extrinsic value.  This is your gambling fee.  And extrinsic value disappears.  100% of extrinsic value is gone at expiration, every time, every contract, no exception. So if the MSFT contract we were talking about above was going for $6.00, that means there’s $5 of intrinsic value and $1 of extrinsic value. \n\nNow, to bring this all together for you smooth brain idiots to understand.  Only extrinsic value is impacted by theta and Vega.  I know, right. Weird huh.  \n\nSo with the MSFT contract above, $1 out of the $6 it cost you is subjected to IV crush or theta. So 16% of the value of your contract is impacted by Vega (IV)or theta (time).  The further you are in the money, the more intrinsic value you have, and less extrinsic.  Therefore, less of your contract would be subjected to the bleed of Vega or theta. \n\nWhen you buy an OTM option, it is 100% extrinsic value.  So, 100% of the contract is subject to theta and Vega bleed.",
        "created_utc": 1607474271,
        "id": "gf46g92",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1607503071.0
    },
    {
        "author": "homelandersballs",
        "body": "You hit the nail on the head. Its not enough for gme to compete. They have to become superior at this point. Customers have already left for a digital platform. To bring them back, they can't settle for equal. They have to be better. \n\nWhat have they done to show they can become better than Microsoft? This is why I've been a gay bear on gme. It just isn't happening. They will survive. They won't thrive.",
        "created_utc": 1607486339,
        "id": "gf4tyde",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1607515139.0
    },
    {
        "author": "iTradeStalks",
        "body": "**PLTR 30 IS THE NEW MSFT 200**",
        "created_utc": 1609127520,
        "id": "gh98l24",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1609156320.0
    },
    {
        "author": "fooledbyvechain",
        "body": "Down 36,000 across all holdings. PLTR, TSLA, AAPL and MSFT.  Tech do your thang tomorrow! 💎🤚",
        "created_utc": 1607555475,
        "id": "gf7xudl",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1607584275.0
    },
    {
        "author": "swaggymedia",
        "body": "Todays WSB Sentiment, Presented by Swaggy\n\nTotal Comments Parsed Last 24hrs: 44,909\n\nTicker | Comments | Bullish %\n:--|:--:|:--:\nTSLA|2146|75%\nGME|1584|74%\nPLTR|1309|83%\nAAPL|449|71%\nPFE|248|88%\nNIO|248|80%\nAMZN|243|76%\nRKT|216|81%\nSPCE|213|86%\nCRM|196|88%\nAMD|169|78%\nSNOW|139|56%\nARKK|133|87%\nBABA|119|71%\nFB|116|58%\nDKNG|114|84%\nMSFT|95|76%\nUBER|95|58%\nARKG|94|91%\nMRNA|83|86%\nQQQ|79|61%\nCRSR|78|88%\nCHWY|76|81%\nXPEV|73|89%\nPLUG|67|80%",
        "created_utc": 1607553758,
        "id": "gf7uiky",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1607582558.0
    },
    {
        "author": "Killtrend",
        "body": "TL;DR at the bottom. You are the reason I’m still subbed to Pennystocks after moving over to more serious companies. (No offense).. a reminder of really bad ideas stemming from pump and dumps. I got sucked into ATNM. Twice.  \n\nHonestly, and harshly, It’s better you lose $2500 than 5,000. You just paid your market tuition of $2500. Everyone does. I paid $1200 to a shitty Microsoft weekly option contract I shouldn’t have bought as my first option trade. 3 months later I made that back plus 3500 off 1-2k option investments (usually much less) at a time. (After that 1200 loss I also doubled down on studying, paper trading, and YouTube lessons. Dozens and dozens of hours before I made another trade). Take it on the chin and use that 2500 tax loss to offset your taxes. I’ve taken losses of $700, 1200, and two separate 200 losses since sept 1st (there’s more but those are the biggest.) If your strategy is good you’ll make it back. \n\nBtw you’re $5,000 investment in that company is 6% of their revenue for Q3. So. There’s that. \n\nTL;DR - Take the loss, claim it on your taxes. Do not buy back in or you’ll trigger a wash sale. \n\n-edit- Doing some quick research on them... and wow. They apparently used to be “On The Move Systems Corp” and it does not look good. Take your loss and move on my friend.",
        "created_utc": 1608074038,
        "id": "gfz2y1m",
        "score": 15,
        "subreddit": "pennystocks",
        "created": 1608102838.0
    },
    {
        "author": "ghathawayjunior",
        "body": "Amazon, Microsoft, Apple — all moving away from Intel. Intel is FUK.",
        "created_utc": 1608332296,
        "id": "ggayzf8",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1608361096.0
    },
    {
        "author": "canes1531",
        "body": "MSFT is up 37.5% YTD. It is my largest holding. Is it boring at times? Yes. Is it tough looking around and seeing some of these other crazy gains and wondering what could’ve been if I trimmed my position? Also yes. But I’m not going to complain about a blue chip stock approaching 40% gains in a calendar year regardless of what is going on in the market.",
        "created_utc": 1608229370,
        "id": "gg5y8s0",
        "score": 15,
        "subreddit": "stocks",
        "created": 1608258170.0
    },
    {
        "author": "brbcripwalking",
        "body": "https://thehill.com/homenews/senate/530968-warren-reintroduces-bill-to-bar-lawmakers-from-trading-stocks\n\nImagine thinking this would pass.\n\nBlackrock Powell, Microsoft Pelosi, and Vanguard Mitch would turn in their graves.",
        "created_utc": 1608406241,
        "id": "gge3fco",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1608435041.0
    },
    {
        "author": "spyaintnobitch",
        "body": "Rumors have it MSFT gonna come up with their own car too. Just gotta keep restarting it every time it blue windscreens",
        "created_utc": 1608595491,
        "id": "ggn1j98",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1608624291.0
    },
    {
        "author": "HardPretze1",
        "body": "Microsoft just announced they are offering refunds for this game as well. Expect another huge drop when the market opens up.",
        "created_utc": 1608341866,
        "id": "ggbfof4",
        "score": 15,
        "subreddit": "investing",
        "created": 1608370666.0
    },
    {
        "author": "Teh-alt-write",
        "body": "It allowed fractional shares before pretty much everyone else. You build a Pie (like a pie chart) with the percentages of the stocks you want. \n\nYou could do for example: 25% VOO, 10% TQQQ, 3% TSLA, 15% PLTR, 20% GME, 5% MSFT, 22% ARKF. \n\nYou can also have a pie within a pie. For example take 25% and make it whatever you want. The pie can have a theme, or not. \n\nThey also have expert pies with stocks and bonds or target dates for retirement. Btw, you can have a retirement account there and set it as Roth, Traditional, etc.",
        "created_utc": 1608324882,
        "id": "ggak88c",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1608353682.0
    },
    {
        "author": "ElmerFUDz",
        "body": " When Bill Gates retired from Microsoft a few years back, Jimmy kimmel was apparently called upon to participate in a final-day roast of the billionaire software tycoon. Unfortunately, Kimmel says the joke-fest didn’t go so well.\n\n Kimmel explained that although he was led to believe that Gates was on board with the roast, he didn’t seem to find Kimmel’s routine funny in the slightest.\n\n“It was a disaster. I insisted that he be onstage with me if I was going to do this, because the key to a roast is the people in the audience see the roastee laughing. Well, unfortunately, the roastee was not laughing. Not even a little bit.”\n\n\nKimmel went on to say that the only person in the room who laughed at his jokes was Tesla CEO Elon Musk. “He was laughing like a maniac,” the late-night host recalled. “Which in a way made it worse.”\n\nBy the end of the night, Kimmel said that Gates was referring to him simply as “the comedian.”\n\n“He was like, ‘We couldn’t get Jay Leno for this?'\"",
        "created_utc": 1608327647,
        "id": "ggaq5ia",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1608356447.0
    },
    {
        "author": "penguiin_",
        "body": "yep. states/govts and militaries have microsoft bending over backwards for them supporting officially deprecated software. some still using windows XP because they wrote so much custom software for it they dont want to update",
        "created_utc": 1606877011,
        "id": "gebufvy",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1606905811.0
    },
    {
        "author": "F1remind",
        "body": "Yeah and also many, many delayed titles including Call of Duty. It's not like the last title sold for a total of 500 million dollars within three days or something... Q4 will have a positive earnings per share for the first time in a while. And while I cannot stand the sound of \"OmNiChAnNeL\" anymore the stuff they implemented actually makes sense in the long term. Especially with the [Microsoft deal](http://news.gamestop.com/news-releases/news-release-details/gamestop-announces-multi-year-strategic-partnership-microsoft) and them apparently actually understanding that people care about being able to ask the clerks questions about gaming. But oh, alas, they missed the expected turnaround by 7% and only managed a revenue of 1 billion, not 1.09 billion.\n\nHow much did they reduce costs by while basically keeping their business intact amidst a global pandemic while restructuring their entire business model?\nYeah, diamond hands%, thats how much!",
        "created_utc": 1607480273,
        "id": "gf4iodc",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1607509073.0
    },
    {
        "author": "GaryTheSoulReaper",
        "body": "No he’s saying MSFT!",
        "created_utc": 1608255096,
        "id": "gg7djs2",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1608283896.0
    },
    {
        "author": "tazman141",
        "body": "Why the fuck is noone asking about Microsoft partnership, and why management is allowing their company to be shorted to such an extreme",
        "created_utc": 1607468139,
        "id": "gf3rzms",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1607496939.0
    },
    {
        "author": "DesertOTReal",
        "body": "Funny that you say gitlab is like outlook when GitHub is the one owned by microsoft",
        "created_utc": 1608364231,
        "id": "ggcbbwu",
        "score": 14,
        "subreddit": "investing",
        "created": 1608393031.0
    },
    {
        "author": "NoobSniperWill",
        "body": "I saw MSFT and rocket emoji. That’s enough for me to go all in\n\nMSFT 12/18 $225C",
        "created_utc": 1608158870,
        "id": "gg2wsw1",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1608187670.0
    },
    {
        "author": "JeffB1517",
        "body": "A lot of the .dot companies had plenty of history.  Sun, Cisco, Microsoft, Intel, Oracle, IBM ... Once you see stock prices that cannot be justified, and by justified I mean discounted value of future dividends,  without 2 tremendously generous assumptions you are in a bubble.  The people playing now are getting high on gambler's rush.",
        "created_utc": 1607620293,
        "id": "gfatnq5",
        "score": 14,
        "subreddit": "investing",
        "created": 1607649093.0
    },
    {
        "author": "svpa3991",
        "body": "NEVER WAIVER PLTR GANG, APPLE AND MSFT WERE SIDEWAYS FOR MONTHS. TRUST THE PROCESS",
        "created_utc": 1609192035,
        "id": "ghbtz7d",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1609220835.0
    },
    {
        "author": "ardme",
        "body": "This is the key thing. Slack is loved and super sticky with the core users who are in tech. I'm a programmer I work for a fortune 500 and I don't even use any Microsoft office products. If you send me a spreadsheet or a word doc I'm opening it in Google Docs. Never using some Microsoft Teams junk. Slack does not need 100% market share they already have a die hard user base that is growing.",
        "created_utc": 1606881712,
        "id": "gec2ljs",
        "score": 13,
        "subreddit": "investing",
        "created": 1606910512.0
    },
    {
        "author": "nosalute",
        "body": "I've witnessed a lot of bagholding. I mean I was here for MSFT 200c 3/20.\n\nBut i've **never** seen bagholding like gamestop",
        "created_utc": 1607473769,
        "id": "gf4574i",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1607502569.0
    },
    {
        "author": "kriptonicx",
        "body": "The vast majority of servers run Linux, and surface laptops make up a tiny fraction of all laptops sold. I think this makes sense for MSFT as it makes their products more competitive, but I doubt this is a huge threat to INTC. Then again, this isn't a space I know much about so happy to be corrected.",
        "created_utc": 1608331067,
        "id": "ggawpxf",
        "score": 13,
        "subreddit": "stocks",
        "created": 1608359867.0
    },
    {
        "author": "coldtacomeat",
        "body": "Palantir announces bid to acquire Microsoft.",
        "created_utc": 1607890815,
        "id": "gfqk9ch",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1607919615.0
    },
    {
        "author": "ShillSheepleton",
        "body": "My Father used to buy silver medallions from this guy back in the 80s. That guy always told my dad to buy up as much as he could of this *tech* company. My dad never did...that company Microsoft.",
        "created_utc": 1608257908,
        "id": "gg7ikgf",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1608286708.0
    },
    {
        "author": "JimCramersCoke",
        "body": "as far as single stocks go, I feel more comfortable adding to MSFT than most other stocks. Gonna be some steady growth in the coming years",
        "created_utc": 1608569205,
        "id": "gglln8e",
        "score": 13,
        "subreddit": "stocks",
        "created": 1608598005.0
    },
    {
        "author": "swaggymedia",
        "body": "Todays WSB Sentiment, Presented by Swaggy\n\nTotal Comments Parsed Last 24hrs: 48,352\n\nTicker | Comments | Bullish %\n:--|:--:|:--:\nAAPL|2383|84%\nGME|1890|81%\nTSLA|1726|71%\nPLTR|1607|83%\nQS|633|69%\nNIO|453|81%\nARKG|334|88%\nPTON|320|81%\nAMZN|249|76%\nAMD|247|87%\nFUBO|230|88%\nVLDR|211|80%\nWISH|189|79%\nARKK|188|91%\nBABA|184|88%\nMT|173|89%\nRIOT|157|90%\nICLN|148|96%\nCRM|138|91%\nPLUG|133|90%\nMSFT|123|83%\nFB|117|77%\nCRSR|113|70%\nLAZR|96|72%",
        "created_utc": 1608673718,
        "id": "ggqf50h",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1608702518.0
    },
    {
        "author": "Borderpotroll",
        "body": "Puts on everything tomorrow. AAPL, MSFT, SPY... long PLTR tho",
        "created_utc": 1607399249,
        "id": "gf0pjlj",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1607428049.0
    },
    {
        "author": "longGERN",
        "body": "Genius. What's better than owning both Microsoft and Activision? Micro vision",
        "created_utc": 1608693539,
        "id": "ggrfqvp",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1608722339.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "Every time I open NFLX and can’t find something to watch my eye twitches knowing the shares are at $500 with a $200 Billion market cap. \n\nThen I switch to Prime video and watch some student film shot on a 1st Gen Microsoft Surface.",
        "created_utc": 1606889557,
        "id": "gece1ug",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1606918357.0
    },
    {
        "author": "Electrical_Spite_477",
        "body": "Palantir will be the only company ever to be able to process big data. Cloudera , google; amazon, nvidia, and Microsoft and Facebook couldn't ever possibly how to compete with palantir",
        "created_utc": 1606970534,
        "id": "gegfurk",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1606999334.0
    },
    {
        "author": "Zerole00",
        "body": "Oh man I forgot about that, that one was a beauty to watch because MSFT is such a good hold anyways but people fuck themselves by buying options",
        "created_utc": 1606947581,
        "id": "gef83ko",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1606976381.0
    },
    {
        "author": "jart8905",
        "body": "People here sleep on how important low IV is to make massive gains. MSFT is up 2% and my 12/24 ATM calls are up 125%. You’d need like a 10-15% move in PLTR for the same gains. I bet the funds that arbitrage the difference in IV between indices and the underlying stocks are making an absolute killing with all the retail options trading going on.",
        "created_utc": 1608142769,
        "id": "gg1yu1d",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1608171569.0
    },
    {
        "author": "BuffettGOAT",
        "body": "MSFT is a piece of shit lately but at least today is the payment date for the dividend lol. Yes I own shares. Don't @ me.",
        "created_utc": 1607579839,
        "id": "gf93bsn",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1607608639.0
    },
    {
        "author": "HiBoobear",
        "body": "Why can’t Microsoft just step in and buy GME to help us all out ?",
        "created_utc": 1607465144,
        "id": "gf3m003",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1607493944.0
    },
    {
        "author": "OutgoingHostility",
        "body": "What is a microsoft",
        "created_utc": 1609111416,
        "id": "gh8e7zj",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609140216.0
    },
    {
        "author": "timeonmyhandz",
        "body": "And the combo of teams with LinkedIn and dynamics can add up to a pretty amazing integration... If Microsoft ever gets off their ass and makes it happen....",
        "created_utc": 1606867595,
        "id": "gebdgnl",
        "score": 12,
        "subreddit": "investing",
        "created": 1606896395.0
    },
    {
        "author": "danielbauwens",
        "body": "That's fair. I had the same opinion back in May, when it was around $4. Then the Ryan Cohen thing and Microsoft deal came along and I still see risk, but it's a risk I'm willing to take because it seems quite likely at this point.",
        "created_utc": 1608465264,
        "id": "gggrrwc",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1608494064.0
    },
    {
        "author": "browncoats4lyfe",
        "body": "Who's making the chips? MSFT? \n\nAre they mind control chips that make us all buy windows phones and zunes? \n\nJust trying to figure out how I can profit off this.",
        "created_utc": 1608220800,
        "id": "gg5gjkq",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1608249600.0
    },
    {
        "author": "thrusher",
        "body": "Stay moving onto new stocks. It hurts to see people playing baba and msft etc. Momentum is the best investment. SPACs are it right now.",
        "created_utc": 1609128238,
        "id": "gh99tkq",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609157038.0
    },
    {
        "author": "Misunderstood_999",
        "body": "I’m betting big on $Ai just because i think its the next meme stock, fuck all you 🌈🐻s that say its over valued. Half this fucking reddit supports a failing video game retailer or a spac pre acquisition that costs $20 for $1 worth of value. Throw logic out the video and invest in a meme ticker. I mean $AI is fucking gas and Microsoft is a partial owner. No fucking brainer in my book, Ai is the future and its taking off 🚀",
        "created_utc": 1609127659,
        "id": "gh98tpq",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609156459.0
    },
    {
        "author": "swaggymedia",
        "body": "Todays WSB Sentiment, Presented by Swaggy\n\nTotal Comments Parsed Last 24hrs: 40,707\n\nY’all hate DASH and like you some MT\n\nI see how it is\n\n\nTicker | Comments | Bullish %\n:--|:--:|:--:\nTSLA|1281|74%\nPLTR|1116|76%\nMT|831|93%\nAPHA|446|89%\nAAPL|423|83%\nNIO|373|84%\nGME|300|83%\nAMZN|293|78%\nBABA|279|87%\nTLRY|216|92%\nABNB|209|70%\nRKT|184|93%\nSPCE|150|80%\nCRM|144|90%\nDASH|137|35%\nAMD|128|83%\nSLV|125|90%\nDKNG|123|87%\nMSFT|117|80%\nLAZR|112|54%\nSNOW|93|64%\nGLD|91|58%\nBIDU|89|83%\nVLDR|86|80%",
        "created_utc": 1608155686,
        "id": "gg2qea5",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1608184486.0
    },
    {
        "author": "budispro",
        "body": "Because until this Fall everyone thought GME was destined for bankruptcy, hence the large short interest. Only decent news we had up until was that Big Short guy had a stake in it. Then news for MSFT deal and RC takeover, is the reason for the recent run up/hype. If you look at the financials, they're doing fine for a B&amp;M company in the middle of a pandemic, which they will eventually become the Amazon of gaming, if they just let RC do his thing.",
        "created_utc": 1607562663,
        "id": "gf8b4fx",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1607591463.0
    },
    {
        "author": "Burnt_toast_2018",
        "body": "I did. Only side affect I've noticed so far is that there are several charges on my card for various Microsoft products that I don't recall placing but strangely I don't feel an urge to open disputes on any of them. Can't explain it...",
        "created_utc": 1609193662,
        "id": "ghbx0ny",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609222462.0
    },
    {
        "author": "nfa1234",
        "body": "A month ago I was a sophisticated trader selling covered calls on msft and apple.  Today I'm jacked to the tits all in with BB and PLTR.  My gums are bleeding and I can taste the blood.  Happy New Year",
        "created_utc": 1609449541,
        "id": "ghn5t85",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1609478341.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "If I had kept my *AAPL*, *MSFT* and *FB* calls that I sold yesterday, I might have actually been green today.  \n  \nBut nope, I am in the WSB meme trio of **PLTR**, **NIO** and **GME** instead! 😂😂😂",
        "created_utc": 1606851764,
        "id": "geah4y7",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1606880564.0
    },
    {
        "author": "LUV2FUKMARRIEDMILFS",
        "body": "Lesson 1#\n\nU ever see Apple or Microsoft DOWN buy \n\nBuy and buy \n\nWent balls deep in msft$ today",
        "created_utc": 1607394070,
        "id": "gf0g7yv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1607422870.0
    },
    {
        "author": "scarface910",
        "body": "I'm bullish on MSFT due to the recent breakout of its consolidation range, I might go in on that.",
        "created_utc": 1608484900,
        "id": "gghw3xq",
        "score": 11,
        "subreddit": "options",
        "created": 1608513700.0
    },
    {
        "author": "Acc373828",
        "body": "Lol “that’s all they know” as if people had no idea AAPL MSFT V and AMZN are long term holds",
        "created_utc": 1608334205,
        "id": "ggb2ew2",
        "score": 11,
        "subreddit": "stocks",
        "created": 1608363005.0
    },
    {
        "author": "deadlyrabbits",
        "body": "Cash App will show you the 15 most traded stocks for the entire MONTH.\n\nWe're talking apple, tesla, amazon, boeing, microsoft, moderna, alibaba, facebook, amd, nvidia, zoom\n\nAND NOW\n\nNIO and Palantir, LOL",
        "created_utc": 1608156122,
        "id": "gg2rbts",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1608184922.0
    },
    {
        "author": "EchoooEchooEcho",
        "body": "Amazon and google next. Only Microsoft and Apple will dodge the antitrust shit",
        "created_utc": 1607547498,
        "id": "gf7hqdo",
        "score": 11,
        "subreddit": "stocks",
        "created": 1607576298.0
    },
    {
        "author": "handtodickcombat",
        "body": "This entire sub: Buy the rumor, sell the news.\n\nAlso this sub: GME earnings is different, it'll beat so hard the stock skyrockets. \n\nAnd finally: Why is GME tanking ah? Short squeeze, Cohen, MSFT deal. \n\nTL;DR: TSLA $800 12/11",
        "created_utc": 1607463291,
        "id": "gf3i0hr",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1607492091.0
    },
    {
        "author": "StuffMyCrust69",
        "body": "AAPL going over 140 tomorrow. AAPL AMZN MSFT all taking off boyz",
        "created_utc": 1609201666,
        "id": "ghcbsqs",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1609230466.0
    },
    {
        "author": "BigLeJaffe",
        "body": "&gt;2 trillion evaluation\n\n2 trillion is only 4x from now. That means, to quadruple your money at this valuation (not astronomical gains by any means), Tesla would have to outpace Amazon, Microsoft, Google and Apple to become the most valuable company in the world. Looking at current profit and revenue doesn't matter because all stocks are priced on expectation, but the valuation does matter because it's an indicator of just how large a company's projected future value will be. I personally find the idea that this company will make more money than Apple one day to be ludicrous.",
        "created_utc": 1608430056,
        "id": "ggfjd58",
        "score": 11,
        "subreddit": "investing",
        "created": 1608458856.0
    },
    {
        "author": "WukongEs",
        "body": "if you bought msft at the peak of the dot com bubble it would have taken you 17 years to breakeven\n\nif you bought amzn at the peak of the dot com bubble it would have taken 10 years to breakeven\n\n\nIf these high valuations pop, wonder how long it would take for things to recover",
        "created_utc": 1607884575,
        "id": "gfq2dx6",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1607913375.0
    },
    {
        "author": "dwdsquared2",
        "body": "[https://www.reuters.com/article/us-usa-cyber-treasury-exclsuive/exclusive-u-s-treasury-breached-by-hackers-backed-by-foreign-government-sources-idUSKBN28N0PG](https://www.reuters.com/article/us-usa-cyber-treasury-exclsuive/exclusive-u-s-treasury-breached-by-hackers-backed-by-foreign-government-sources-idUSKBN28N0PG)\n\n&gt;Exclusive: U.S. Treasury breached by hackers backed by foreign government - sources  \n&gt;  \n&gt;The hack involves the NTIA’s office software, Microsoft’s Office 365. Staff emails at the agency were monitored by the hackers for months, sources said.   \n&gt;  \n&gt; The hackers are “highly sophisticated” and have been able to trick the Microsoft platform’s authentication controls  \n&gt;  \n&gt; “This is a nation state,” said a different person briefed on the matter. “We just don’t know which one yet.”",
        "created_utc": 1607890861,
        "id": "gfqkco3",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1607919661.0
    },
    {
        "author": "iamiamwhoami",
        "body": "There's a huge market that Microsoft will likely never break into. There is billions in spend that Slack will win out on because large swaths of the tech industry don't like using Microsoft products.",
        "created_utc": 1606870915,
        "id": "gebjft4",
        "score": 10,
        "subreddit": "investing",
        "created": 1606899715.0
    },
    {
        "author": "WHistard42",
        "body": "MSFT has been somewhat underperforming compared to the rest of the industry. I'm long MSFT for several reasons, but people out there LOVE to hate on this stock",
        "created_utc": 1608691404,
        "id": "ggrc2df",
        "score": 10,
        "subreddit": "stocks",
        "created": 1608720204.0
    },
    {
        "author": "neutralpoliticsbot",
        "body": "Pelosky has MSFT and PYPL calls she needs to save, she won't go out without a fight.",
        "created_utc": 1608688198,
        "id": "ggr6c26",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1608716998.0
    },
    {
        "author": "dotobird",
        "body": "I don't understand this Steam fantasy. Why wouldn't you just buy games directly from Microsoft or Sony? What is being like Steam supposed to accomplish? \n\nI think the future of Gamestop is still physical games. People will still buy physical games over digital games (as long as the option is there) because it gives them the ability to resell. Gamestop will **NEVER** go back to its previous revenue high's without its resale business.",
        "created_utc": 1608476825,
        "id": "gghek5e",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1608505625.0
    },
    {
        "author": "McSupergeil",
        "body": "STIMULUS VOTE TODAY!!!!\n\n\nvaccines didn't cause autism yet, and top ranking people took it too.\n\nCORONA CURED, STOCK MONEY PAST\n\n\nMy MSFT &amp; AMZN Calls  exp 12/1\n\n#SAVED",
        "created_utc": 1608474495,
        "id": "ggh9jln",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1608503295.0
    },
    {
        "author": "OwenLincolnFratter",
        "body": "MSFT and APPL are practically the safest blue chip stocks you can buy, they will almost always out perform the SP, if you are unsure about buying Microsoft than you should be unsure about investing in general.",
        "created_utc": 1608572673,
        "id": "gglsjh4",
        "score": 10,
        "subreddit": "stocks",
        "created": 1608601473.0
    },
    {
        "author": "mtcoope",
        "body": "Its funny I'm a software developer and I think machine learning might be one the biggest buzz/hype words that exist at the moment. Dont get me wrong i think it has a future but every company I've worked at that experimented with it all had 1 common problem. Getting enough clean data to train a model. I guess my thing is its going to come but I dont think we are close to it taking over. \n\nCloud services are where the money is now and I think will continue to grow rapidly. Its boring but Microsoft and Amazon.",
        "created_utc": 1608398683,
        "id": "ggdn926",
        "score": 10,
        "subreddit": "options",
        "created": 1608427483.0
    },
    {
        "author": "xLogicx01",
        "body": "F you saying. With GameStop, I’ll buy the dip then the other and the other, gravity. You get the deal. Until it’s at least $30. Diamond handz. Keep buying, scratch the surface-console cycle. Dig deeper-Microsoft, Melvin, RC. Have you seen the dam Dota arenas in Asia? Mooning",
        "created_utc": 1608242331,
        "id": "gg6ov92",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1608271131.0
    },
    {
        "author": "Cashmoneytendies",
        "body": "Microsoft about to buy... word on the street.",
        "created_utc": 1607725646,
        "id": "gfg9902",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1607754446.0
    },
    {
        "author": "nabil_t",
        "body": "You're welcome\n\nhttps://www.bloomberg.com/news/articles/2020-12-18/microsoft-msft-is-designing-its-own-chips-in-move-away-from-intel-intc",
        "created_utc": 1608324059,
        "id": "ggaibic",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1608352859.0
    },
    {
        "author": "greyenlightenment",
        "body": "Yup everyone buying PLTR. Now $27, soon to be $50.  Another example of big tech stocks continuing to dominate. Don't waste your time with small cap crap. All the money is made with $50-500+ billion companies like AMZN and TSLA.  The stocks that people hone in on here are , such as FB, MSFT, GOOG, AMZN, TSLA, and other fang stocks, have proven to be huge winners out of a pool of thousands of companies to choose from. This is demonstrative of actual skill and not just guessing. Even the person who made a 400k PLTR yolo has recovered his losses. Soon to be $2 million. Just buy the dips or hold. Easiest $ ever made.",
        "created_utc": 1607363855,
        "id": "geypfuw",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1607392655.0
    },
    {
        "author": "nosalute",
        "body": "Top 5 bagholders:\n\n1. kodak $60 avg\n2. Gamestop today\n3. Betting on Tyson or Jones\n4. MSFT 200c 3/20\n5. Doordash $102 avg",
        "created_utc": 1607490962,
        "id": "gf51byy",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1607519762.0
    },
    {
        "author": "WBuffettJr",
        "body": " You’re talking to 100,000 guys who had MSFT $200c in March.",
        "created_utc": 1609209970,
        "id": "ghcr5gi",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1609238770.0
    },
    {
        "author": "Halleloumi",
        "body": "NET, NVDA, MSFT, SMG, PEP\n\nEdit: I think 5-10 years is a better timeline.  Reassess regularly.\n\nIf you really want 20-30, go for a total market index.  Maybe a clean energy or tech ETF if you want something more \"exciting.\"",
        "created_utc": 1608311353,
        "id": "gg9oi05",
        "score": 10,
        "subreddit": "stocks",
        "created": 1608340153.0
    },
    {
        "author": "Teckel22",
        "body": "Exclusive: Microsoft was hacked as part of the suspected Russian campaign that has hit multiple U.S. government agencies, sources say \n\nhttps://twitter.com/Reuters/status/1339706716938768387\n\n**BAD TIMING WITH FUTURES OPEN**",
        "created_utc": 1608245993,
        "id": "gg6vwhx",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1608274793.0
    },
    {
        "author": "xkulp8",
        "body": "Bought Compaq years ago. Then it became HP, then HP split into HPE and HPQ, then I got some DXC in the spinoff, then I got PRSP in the next spinoff.\n\nSo I have 5 shares of PRSP.\n\nAt least *something* might make money for me out of the old CPQ.",
        "created_utc": 1609875388,
        "id": "gi7npln",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609904188.0
    },
    {
        "author": "TAUTJ",
        "body": "I used to work for DXC Technologies (after the spin merge with HPE). They were hot garbage then. Have things improved since?",
        "created_utc": 1609724835,
        "id": "gi0sdx5",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1609753635.0
    },
    {
        "author": "veritasinvestments",
        "body": "Ehhh Jana isnt into this pump and dump business. They successfully navigated the initial DXC merger. They’re pretty sophisticated",
        "created_utc": 1609877075,
        "id": "gi7sun1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1609905875.0
    },
    {
        "author": "veritasinvestments",
        "body": "Great question bruh. Not sure when exactly this buyout will be finalized. Went through some more stuff and it seems like their fiscal year ends in March, which means management may actually end up fully selling in March, but at the same time, DXC (the company that prsp was split from) just got a BO offer from this French company. It’s really interesting how both companies are being bought out at the same time. 30c Jans are still above the price I recommended them at (I said buy at 0.1, now at 0.3) so if you’re up, take some profits perhaps.",
        "created_utc": 1610031840,
        "id": "gifi70w",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1610060640.0
    },
    {
        "author": "mmmttt123",
        "body": "Anyone have DXC options? Someone bout to be paid",
        "created_utc": 1610017808,
        "id": "giexrx9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610046608.0
    },
    {
        "author": "Forsaken-Pangolin-57",
        "body": "So I’m pretty out of my depth here. It’s a work project, but I’m essentially first trying to determine whether they were over or undersubscribed. Oversubscribed meaning that more ParentCo shares are tendered than new company shares are offered than exchange is done on a pro-rata basis. Usually, some sort of 8K or company press release state that the offer is oversubscribed. There’s a handful I’m looking at that don’t explicitly state it one way or the other, and I’m just trying to determine what happened in these deals (GE and Wabec, HPE and Micro Focus, HPE and DXC, Starwood and ILG, Nabors and C&amp;J Energy Services, Tyco and Pentair). Doing this to look at employee equity when deals are undersubscribed.",
        "created_utc": 1610741389,
        "id": "gjdnugm",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1610770189.0
    },
    {
        "author": "aerodynamic_AB",
        "body": "Anyone looking at rkt and dxc calls?",
        "created_utc": 1609766368,
        "id": "gi2cgiz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609795168.0
    }
]