[
    {
        "author": "betitallon13",
        "body": "Goldman also said the Coronavirus was \"highly unlikely\" to impact the US, and recommended to buy several specific stocks that ended up down 70-90% by the middle of March (I remember DXC as one). They have 100 people saying 100 different things, so whatever happens, they can claim they were right, and ignore all of their bad calls.  \n\nI don't keep a record, but it seems like they are wrong worse than Cramer... I remember their price reduction on TSLA back in 2013 when it first broke $100 per share, and they reduced their target to $80. It shot up from there, doubling in less than a year.",
        "created_utc": 1586879675,
        "id": "fndy6ij",
        "score": 25,
        "subreddit": "stocks",
        "created": 1586908475.0
    },
    {
        "author": "dwmeds",
        "body": "Why DXC?",
        "created_utc": 1586832397,
        "id": "fncauds",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586861197.0
    },
    {
        "author": "MSL0727",
        "body": "Very very bad company. I went from HP to Hewlett-Packard Enterprise to DXC Technology, and the whole time we were employed at DXC there was a feeling of death around with no morale and a very sad feeling around the fact that most were told they should just be happy they have a job. Although I literally sat and watched as person by person around me all inevitably got laid off. They'd come in on Thursday and be told the next day (Friday) would be their last day and they'd be lucky to get severance. I eventually left the company because of anything could be better, and I was looking to grow and not be held down. \n\nNo raises or bonuses for years, layoffs left and right, vile environment, etc. I wouldn't own it, but then again I don't track the stock price and I see it from a perspective that would never interest me in looking.",
        "created_utc": 1586103820,
        "id": "fmi77dw",
        "score": 1,
        "subreddit": "investing",
        "created": 1586132620.0
    },
    {
        "author": "BattletoadRash",
        "body": "Yea, I mean Lawrie is well know for being particularly draconian in his turnarounds. This has been 8 years in the coming, since Lawrie first joined CSC in 2012. \n\nHis 1st course of action was completely revising the entire company's job title/salary structure, leading to a large exodus especially of VPs who were being demoted. (I left around this time).\n\n2nd step was spinning off the govt business. \n\n3rd step was merging the commercial side with HPE.\n\n4th was massive cuts and layoffs across the new DXC org.\n\n5th was revamped M&amp;A approach and sale of their less profitable business units. \n\nThe guy is a dick for sure, but it's hard to argue with his results from a business perspective. \n\nLawrie recently stepped down from the CEO role. With a new CEO, new business model, and new cash from the spinoffs, they may be positioned to become a respectable business again and grow... or sell.",
        "created_utc": 1586105425,
        "id": "fmia16y",
        "score": 1,
        "subreddit": "investing",
        "created": 1586134225.0
    },
    {
        "author": "BallsTreesDebts",
        "body": "$30k is significant. I'd love to have $30k, but I don't because I'm poor. And that's why I'm giving investment advice on reddit...so... A lot of eggs in a few baskets is easier to watch than ten baskets. You can't effectively watch ten companies. You will have more luck getting to know two or three. You will also be more invested mentally. Putting $3k in ten companies doesn't make you more secure. It thins out your ability to pay attention effectively. Ten will make you emotional. You're focus will be split ten ways and you won't be making significant money from any of them. Focus on your best three or four ideas. Put $10k into Disney. Then wait another quarter and put another $10k into Disney. Wait another quarter and put the last $10k into Disney. ONE stock. Or you can buy some junior mining penny stocks like me. Up 50% since Thursday. This is speculation on the assumption that after a crash there is a mining boom. This is gambling. Disney is the real deal. Bank on Disney, put $3k into sphinx resources. You'll regret sphinx, but Disney will pay off until the day you're diagnosed with stage 4 cancer. Know what causes cancer? stress. You'll stress about ten small investments until you sell for some reason some day, or you'll feel secure in one good investment forever. \n\nWhy DXC? because it's a spin off and Joel Greenblatt told me those can be lucrative. I'm a fan though. I want it to do well. I like DXC and Garrett... I own neither. There are at least seven companies I'd buy before those two. Six of them are Canadian banks. If I wanted a sure thing... If I wanted something that would exist in 50 years... something I could buy enough of so that their dividends afforded more shares of that company... something that creditors trust even in a crisis, something with a brand akin to a cult... something that just cannot fail... I'd buy Disney. It's only $30k. Buy Disney all through the recession. $30k worth of shares averaging down over the next year will pay off until you die. \n\nAll those other choices are meh. Amazon might be a good one, but it's on top already. Tesla isn't profitable and they make cars. These other ones are not 50 year companies. They compete in competitive industries where competitive destruction reigns. Disney is different. In conclusions: spend $30k on apple.",
        "created_utc": 1586913925,
        "id": "fnfrgo4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586942725.0
    },
    {
        "author": "BallsTreesDebts",
        "body": "Don't buy airlines. I hate all your positions except Disney. Just buy Disney. It's only $30k. Don't split it ten ways. Split it three ways. Buy Disney for the rest of your life. Don't buy these other ones. Warren Buffett was buying Apple right before the crash. Bet he's buying Apple now. Tesla isn't profitable. Carnival is evil. Amazon may be an okay idea... Look into DXC Technology. Look into VIAC. Look into WD-40. Or just buy Disney and Apple right now, and wait for a few months for the global economy to struggle. Buy again next quarter. Don't split $30k ten ways on those stocks. Focus on two or three.",
        "created_utc": 1586822743,
        "id": "fnbusmt",
        "score": -4,
        "subreddit": "stocks",
        "created": 1586851543.0
    },
    {
        "author": "SolitaryEgg",
        "body": "Telling you what about ibm you fucking autist",
        "created_utc": 1585733328,
        "id": "fm3qmx0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585762128.0
    },
    {
        "author": "Benderwah",
        "body": "Pure cocaine. Then cut it with speed and quadruple my profits. Then id buy VZ, JNJ, MSFT, IBM.",
        "created_utc": 1585724877,
        "id": "fm3iotr",
        "score": 1,
        "subreddit": "investing",
        "created": 1585753677.0
    },
    {
        "author": "optionstudent516",
        "body": "The autist in me likes IBM",
        "created_utc": 1585733219,
        "id": "fm3qj7w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585762019.0
    },
    {
        "author": "l0gicgate",
        "body": "Timeline of events:\n- Started the sub\n- Left for years / minimal activity\n- Once sub was popular he came back and demodded / banned people\n- Pushed his stupid fucking book trying to make a buck\n- Affiliated himself with True Trading Group and attempted to put on a Trading E-Sports type event with outrageous buy-in and shady prize scheme\n- Made fake account u/WSBGod and made some outlandish posts that got us on r/all and then an influx of retards came so he can promote his garbage to them\n- Changed the original logo/banner and removed the original Discord server to promote his\n- Disgruntled mods were somehow able to plan a coup with reddit mods to take him down and it brings us to today!",
        "created_utc": 1586387682,
        "id": "fmuan2v",
        "score": 394,
        "subreddit": "wallstreetbets",
        "created": 1586416482.0
    },
    {
        "author": "avgazn247",
        "body": "Nah he doing big brain moves. Don’t have to pay taxes on two mil if u lose half of it",
        "created_utc": 1586215370,
        "id": "fmn009x",
        "score": 291,
        "subreddit": "wallstreetbets",
        "created": 1586244170.0
    },
    {
        "author": "wadewannabe3",
        "body": "If SPY closes under 244 I will chop my dick off and eat it.",
        "created_utc": 1586390661,
        "id": "fmufznz",
        "score": 210,
        "subreddit": "wallstreetbets",
        "created": 1586419461.0
    },
    {
        "author": "TTUnathan",
        "body": "Calls it is then.",
        "created_utc": 1586395772,
        "id": "fmuoye9",
        "score": 204,
        "subreddit": "wallstreetbets",
        "created": 1586424572.0
    },
    {
        "author": "rushinrussia",
        "body": "If Gordon calls this market 3 days in a row (including today's call, so 2 more) can I buy him a piece of furniture or a bulb or something. Mods hold me to it",
        "created_utc": 1585770960,
        "id": "fm5dmoq",
        "score": 198,
        "subreddit": "wallstreetbets",
        "created": 1585799760.0
    },
    {
        "author": "BingBong-42",
        "body": "i legit think gordon is probably smarter than everyone here so i'll trust it",
        "created_utc": 1585770906,
        "id": "fm5dj04",
        "score": 189,
        "subreddit": "wallstreetbets",
        "created": 1585799706.0
    },
    {
        "author": "74FFY",
        "body": "Deposited and lost $13k out of $15k Friday on some expiring shit. Spent last $2k on some 4/9 SQ calls that dropped to $306 by Monday morning. That shot up to $28k by close but I didn't sell. Tuesday it dropped to $4k by EOD and I didn't sell. Today it grew from around $4-5k at open and I finally sold it at $38k. I'm retarded at basically every point for not selling earlier, but this one worked out. \n\n1,726% gain total, and I guess 11,772% from Monday morning until I sold. \n\n http://imgur.com/a/3dRpzvD",
        "created_utc": 1586380796,
        "id": "fmtxkop",
        "score": 184,
        "subreddit": "wallstreetbets",
        "created": 1586409596.0
    },
    {
        "author": "manufacture_reborn",
        "body": "I got the call from TD, “are you sure you know what you’re doing?” today.\n\nI told them yes, absolutely, that I’m using a “crowdsourced sentiment aggregating platform” to help make my positioning decisions. They seemed cool with that, and I didn’t have to tell them it was you autists.\n\nI’m working harder to hide WSB from my broker than my wife’s boyfriend was with his other girlfriend.",
        "created_utc": 1586380792,
        "id": "fmtxkew",
        "score": 154,
        "subreddit": "wallstreetbets",
        "created": 1586409592.0
    },
    {
        "author": "rtc824",
        "body": "We just hit the top of the bull trap at SPY 273\n\nIf it goes above 273 in the next 30 days I will accept a 6 month ban.\n\n*Edit. Please upvote and make this higher so that the mods see and hold me accountable. I now have skin in the game. Positions? MAR $50p 5/15, AAPL $210p 5/15.",
        "created_utc": 1586294260,
        "id": "fmq7eep",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1586323060.0
    },
    {
        "author": "leveredlloyd",
        "body": "Thanks Kevin. Now let’s take a look at today’s market movers. It looks like BA continues to sh*t bricks, while TSLA has surprisingly been performing well squeezing out short sellers.... **5 min ad about E-Trade commission free trading, followed by Comcast’s “we’re connecting people all over the world”... Jim, tell us what you’re seeing in rates today... crossing over to you @ricksantelli, let’s look at the 10yr curve, that’s the canary in the coal mine",
        "created_utc": 1586373990,
        "id": "fmtjwm9",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1586402790.0
    },
    {
        "author": "Banemorth",
        "body": "What the fuck are we supposed to do about it?  Might as well make the best out of a bad situation.  Ban.",
        "created_utc": 1585770222,
        "id": "fm5c7qj",
        "score": 141,
        "subreddit": "wallstreetbets",
        "created": 1585799022.0
    },
    {
        "author": "totally_not_the_fbi2",
        "body": "It was me my bad, was cashing out to buy some toilet paper",
        "created_utc": 1585768360,
        "id": "fm58npi",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1585797160.0
    },
    {
        "author": "Andrew_the_giant",
        "body": "In the last few weeks /months it's really gone down hill. I feel almost a sense of enlightenment without it. Almost like I can think for myself and play smart trades and actually make money.",
        "created_utc": 1586305801,
        "id": "fmqs095",
        "score": 138,
        "subreddit": "options",
        "created": 1586334601.0
    },
    {
        "author": "CCrest182",
        "body": "It will, however, go up 30 bucks in one day.",
        "created_utc": 1586389177,
        "id": "fmudcji",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1586417977.0
    },
    {
        "author": "Potpourrri",
        "body": "Holy fucking christ lmao\n\n\"Mommy can I sell my options?\"\n\n\"I'll think about it\"",
        "created_utc": 1586211353,
        "id": "fmmsqju",
        "score": 126,
        "subreddit": "wallstreetbets",
        "created": 1586240153.0
    },
    {
        "author": "danny_",
        "body": "It is just me, or is multiple phone calls not quite as bad as $25k lost due to flagged/delayed trades.",
        "created_utc": 1586222009,
        "id": "fmnb0cd",
        "score": 116,
        "subreddit": "investing",
        "created": 1586250809.0
    },
    {
        "author": "Mail_Order_Lutefisk",
        "body": "That is why it is called Wall Street Bets and not Wall Street Dollar Cost Averaging So I Can Drive a Fucking Toyota Camry Forever.",
        "created_utc": 1586293977,
        "id": "fmq6via",
        "score": 111,
        "subreddit": "wallstreetbets",
        "created": 1586322777.0
    },
    {
        "author": "jay9909",
        "body": "&gt; I think they only the owner has is if you use it for commercial use without his permission.\n\n/r/IHadAStroke",
        "created_utc": 1586371611,
        "id": "fmtf0ss",
        "score": 107,
        "subreddit": "wallstreetbets",
        "created": 1586400411.0
    },
    {
        "author": "klept0nic",
        "body": "To a rational human it does but I've found that most people on reddit have a victim mentality and think the world is rigged and out to get them.",
        "created_utc": 1586383307,
        "id": "fmu2f3f",
        "score": 99,
        "subreddit": "stocks",
        "created": 1586412107.0
    },
    {
        "author": "llenders97",
        "body": "i usually sell once i hit 10,000% gains, otherwise just let it expire worthless",
        "created_utc": 1585853564,
        "id": "fm8pedz",
        "score": 97,
        "subreddit": "wallstreetbets",
        "created": 1585882364.0
    },
    {
        "author": "MEGAQUIB",
        "body": "We stopped getting tendies when they took our boy off the logo and made it that caillou looking cuck.",
        "created_utc": 1585863489,
        "id": "fm9827o",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1585892289.0
    },
    {
        "author": "Mooonbound",
        "body": "Why tf is this thread not pinned?  Making me search for it",
        "created_utc": 1586383832,
        "id": "fmu3eln",
        "score": 93,
        "subreddit": "wallstreetbets",
        "created": 1586412632.0
    },
    {
        "author": "SuperomegaOP",
        "body": "Oh shit is that how it works?",
        "created_utc": 1586216370,
        "id": "fmn1pt0",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1586245170.0
    },
    {
        "author": "the_rabble_alliance",
        "body": "Overheard in a basement bedroom after eating tendies:\n\n\"WSB got me.\" Jartek said of WSB. \"That f***ing WSB boomed me.\"\n\nLeBron added, \"They're so autistic,\" repeating it four times.\n\nLeBron then said he wanted to add WSB to the list of subreddits he would be banned from this summer.",
        "created_utc": 1586369729,
        "id": "fmtb0jo",
        "score": 89,
        "subreddit": "wallstreetbets",
        "created": 1586398529.0
    },
    {
        "author": "Drupain",
        "body": "\"vanilla trades\"\n\nI only do BDSM trading, once you've tried it your life will never be the same. You won't even care how much money you lose.",
        "created_utc": 1586217486,
        "id": "fmn3lji",
        "score": 83,
        "subreddit": "investing",
        "created": 1586246286.0
    },
    {
        "author": "BestNarcissist",
        "body": "Sample size of three days during a black swan event?\n\nInteresting, but I'd like to see you keep running at least one of the bots to see how it does long-term.",
        "created_utc": 1585774910,
        "id": "fm5l0c6",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1585803710.0
    },
    {
        "author": "I_have_a_dog",
        "body": "We are at the start of 15 days to slow the spread. We must use these 30 days wisely. Once we have done our part and stayed isolated for 45 days, we can begin to go back to normal. 60 days may seem like a long time, but it will go quickly. After the original 90 days  of isolation is over, we can reevaluate the need to continue this lockdown past 120 days. \n\n-Mike Pence",
        "created_utc": 1586300243,
        "id": "fmqign1",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1586329043.0
    },
    {
        "author": "Unstoppable001",
        "body": "Delete this post before you jinx it",
        "created_utc": 1585856601,
        "id": "fm8v4wg",
        "score": 77,
        "subreddit": "wallstreetbets",
        "created": 1585885401.0
    },
    {
        "author": "reposado",
        "body": "Seriously. 65% drop and \"WhY isNT IT taNKing?\"",
        "created_utc": 1586390432,
        "id": "fmufkxb",
        "score": 77,
        "subreddit": "stocks",
        "created": 1586419232.0
    },
    {
        "author": "passwordisnotorange",
        "body": "Are you saying that YouInvest was responsible for 9/11? I hadn't heard that before, but I suppose it does sound plausible.",
        "created_utc": 1586212530,
        "id": "fmmuvdu",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1586241330.0
    },
    {
        "author": "Unhinged_Goose",
        "body": "This is beyond retarded.\n\nI love it.",
        "created_utc": 1586294348,
        "id": "fmq7ka4",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1586323148.0
    },
    {
        "author": "xblackout_",
        "body": "It's true I saw it happen",
        "created_utc": 1585777724,
        "id": "fm5q3i0",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1585806524.0
    },
    {
        "author": "bbues",
        "body": "u/Variation-Separate Don't get too discouraged bro that move at the end was absolute bullshit. Really enjoy your guidance on the market. Would love to keep hearing/studying it. Don't let the kids who don't understand that it's not possible to predict every single unknown fucking factor (fed manipulation) and get it right 100% of the time get you down.",
        "created_utc": 1585869243,
        "id": "fm9i6w1",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1585898043.0
    },
    {
        "author": "joyful-",
        "body": "Last time Ray Dalio called a depression publicly and committed his funds to his prediction, he was burned VERY hard (basically went bankrupt). He calls it the defining moment for his career because he learned humility, etc, and he talks about it often. I think he has to be quite confident with a lot of data backing him up for him to call out a depression after what he went through last time.",
        "created_utc": 1586385903,
        "id": "fmu7apa",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1586414703.0
    },
    {
        "author": "Fizzy_T",
        "body": "Come to think of it I don't have a point. Carry on.",
        "created_utc": 1585772072,
        "id": "fm5foe1",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1585800872.0
    },
    {
        "author": "edge13x",
        "body": "So.. Real talk here, guys. I think this is okay to do here, because it's not the daily thread. \n\nI'm pretty new to WSB, but I have been trading [badly] for a long time, and I have to say it's felt like treading water. I used to think that unless I was some trust fund baby with 2mil in cash waiting to be invested, it was gonna be the long haul for me.\n\nThen I found WSB, and it was great, but with each gain, there'd be things I couldn't control, or I'd chase the advice of people who didn't really do their DD. I was convinced that with all the bad news we were getting, that stocks would plummet last week, as I learned the hard way something I [and I would imagine, all of us] already knew -- the market doesn't do what it is supposed to, it does what the MMs want it to do, and in the process it takes advantage of the common trader.\n\nBut every once in a while, we get someone like /u/Variation-Separate who not only takes the time to share his secrets, but breaks it down for us, interacts with the community, and even fucking gives us confidence when the market seemingly isn't following the prophecy. He doesn't have to do any of this.\n\nI cannot do what he does as well as he does it. Not yet. But I am thankful for the knowledge I've gained, thankful for the tendies, and thankful for having my faith in good people and challenging corrupt systems resurrected.\n\nMuch love, OP. It's a rough time for a lot of people out there. You're a godsend.",
        "created_utc": 1585773213,
        "id": "fm5hssv",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1585802013.0
    },
    {
        "author": "SignalEngine",
        "body": "What are you gonna do if it drills tomorrow and friday? Surprisingly paper hands from a guy with such massive balls.",
        "created_utc": 1585773768,
        "id": "fm5iuo0",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1585802568.0
    },
    {
        "author": "tstehler1",
        "body": "I saw Questrade at a grocery store in Los Angeles yesterday. I told him how cool it was to meet him in person, but I didn’t want to be a douche and bother him and ask him for photos or anything.\nHe said, “Oh, like you’re doing now?”\nI was taken aback, and all I could say was “Huh?” but he kept cutting me off and going “huh? huh? huh?” and closing his hand shut in front of my face. I walked away and continued with my shopping, and I heard him chuckle as I walked off. When I came to pay for my stuff up front I saw him trying to walk out the doors with like fifteen Milky Ways in his hands without paying.\nThe girl at the counter was very nice about it and professional, and was like “Sir, you need to pay for those first.” At first he kept pretending to be tired and not hear her, but eventually turned back around and brought them to the counter.\nWhen she took one of the bars and started scanning it multiple times, he stopped her and told her to scan them each individually “to prevent any electrical infetterence,” and then turned around and winked at me. I don’t even think that’s a word. After she scanned each bar and put them in a bag and started to say the price, he kept interrupting her by yawning really loudly",
        "created_utc": 1586384756,
        "id": "fmu548n",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1586413556.0
    },
    {
        "author": "mrpoodles11",
        "body": "All I know is that if the market keeps being pumped up like this, when the crash does come down the road it is going to be absolutely fucking apocalyptic. I’m a gay bear for sure but I think downturns are honestly a healthy part of the business cycle. The idea that we should stop any stock market downturn with monetary policy is pretty crazy to me, but I’m also autistic as shit so what do I know.\n\nTL;DR buy a nice rifle, armor plates, and night vision goggles for long-term investments.",
        "created_utc": 1586207278,
        "id": "fmml5gv",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1586236078.0
    },
    {
        "author": "theknowndude",
        "body": "this will probably be the best advice i ever gave:\n\nyou dont want to hold jnug for longer than a week, in fact don‘t buy it at all",
        "created_utc": 1585783286,
        "id": "fm5zr5j",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1585812086.0
    },
    {
        "author": "dbgtboi",
        "body": "You want to know what would scare this market more than 100% unemployment and banks collapsing? The fed announcing that unlimited QE is over, we would easily hit a level 2 circuit breaker, and maybe for the first time in history level 3. Nothing scares the markets more than the fed saying they won't prop it up, look back at the end of 2018.",
        "created_utc": 1586388747,
        "id": "fmuckij",
        "score": 65,
        "subreddit": "investing",
        "created": 1586417547.0
    },
    {
        "author": "rusty_kx",
        "body": "Hey idiot, this virus grows exponentially and estimations are largely based on current data. The shit changes as it goes.",
        "created_utc": 1585857558,
        "id": "fm8wxr5",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1585886358.0
    },
    {
        "author": "4P87xfBDHcfhcMwI",
        "body": "And put it on pornhub?",
        "created_utc": 1586389361,
        "id": "fmudohj",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1586418161.0
    },
    {
        "author": "Variation-Separate",
        "body": "Thanks. I can swing the momentum, but not everyone can day trade. I want to show that having a plan and strategy, and sticking to it is the most important. Otherwise your conviction at the critical moment will always crumble.",
        "created_utc": 1586197436,
        "id": "fmm28sn",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1586226236.0
    },
    {
        "author": "obsessedwithstocks",
        "body": "Guys it’s simple. Just buy a call before it goes up, and buy puts before it goes down.",
        "created_utc": 1585944362,
        "id": "fmcexsx",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1585973162.0
    },
    {
        "author": "edge13x",
        "body": "Reading a lot of comments from concerned people. Very understandable. I'm right there with all of you. I've got a bit riding on this, a lot of which will die if a viable downtrend doesn't start before May and I can't adjust. I don't subscribe to telling people diamond hands, or blindly worshipping VS. We all have to adapt. But I am incredibly appreciative for the time he's put into these posts and educating us.\n\nThat said, we have no idea yet what will actually happen long term. /u/Variation-Separate has put together a really compelling plan. He didn't have to share it. No one has to follow it. But if you, like me, believe that there is validity and truth in his analysis, then do your own DD to embrace that vibe. Yesterday, people were freaking out in the first two hours of intraday when there was no drop, then we plummeted. Today, we flirted with 252 and are at risk of another leg up. If in the last two days, you have decided that this uptrend in the market is enough to call it quits, no one can blame you, but I would argue, maybe VS's posts aren't for you. \n\nI am a bear rn. I'm a bear not just because I have positions that reflect it -- I truly believe we're in a bad spot, and corporations, MMs, the Fed are being really irresponsible right now.  We're being set up for some horrible economic rebuilding in the 2020s. The longer the market waits to reflect this, the more fucked ordinary people are when they do. They don't have our best interests in mind. Deep down, I want us all to get through this and come out on top.\n\nI hope I'm not foolish in thinking that, collectively, we have the tools and minds to figure this out and at least make a little money before things get really bad. It's a difficult time to have conviction, but that's why I'm here in this thread (and no longer checking the dailies). Keep strong, fellow autists. Let's find patience and figure out what the next move is.",
        "created_utc": 1585865530,
        "id": "fm9br5o",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1585894330.0
    },
    {
        "author": "hamplane",
        "body": "I'm not sure what's with all the salt in this thread, u/variation-separation has been right all along.\n\n1) last Thursday/Friday were the \"biggest trading days of the year\" because we were going to see if we would break through 245 (spoiler, we didn't) and the way I read it, was that if we didn't, we would be due for a big bounce up to retest 265....literally exactly what happened today\n\n2) now the big test is if we will break through 267 (a lot of numbers between 265 and 270 have been tossed out). If we do, expect to continue rallying up and cancel the bear market, if not we'll test 245 again\n\nEveryone, this guy is a gift. Dont ruin this for us and make him run off to top secret elite web, I dont know if I can last if it goes back to being 100% mouth breathers in here instead of 99%",
        "created_utc": 1586204416,
        "id": "fmmfogx",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1586233216.0
    },
    {
        "author": "SJ_Shark_Byte",
        "body": "Disney $130c 4/17 got it",
        "created_utc": 1585866322,
        "id": "fm9d5l0",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1585895122.0
    },
    {
        "author": "redisamyth",
        "body": "Puts it is!",
        "created_utc": 1585863670,
        "id": "fm98dl2",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1585892470.0
    },
    {
        "author": "yaohyuri",
        "body": "It's pretty much much just people bitching about options not printing, hardly anything good anymore. It got to big to quick",
        "created_utc": 1586306053,
        "id": "fmqsfcj",
        "score": 56,
        "subreddit": "options",
        "created": 1586334853.0
    },
    {
        "author": "Life-Observer",
        "body": "market doesn’t care bro. it will just continue to go up. there isn’t any risk or consequences anymore just up.",
        "created_utc": 1586374130,
        "id": "fmtk6yq",
        "score": 55,
        "subreddit": "investing",
        "created": 1586402930.0
    },
    {
        "author": "Ijustquaffed",
        "body": "If tomorrow is green I am selling no matter what for a 95% loss. I can't do it anymore. I can't. I won't.  \n\n*Proceeds to open new retarded positions*",
        "created_utc": 1586207142,
        "id": "fmmkwfn",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1586235942.0
    },
    {
        "author": "lightbeersucks",
        "body": "Unlimited QE and a president pumping the market with false information = rigged\n\nAlso, go educate yourself. It’s very basic finance theory that market are irrational. It might actually be the first they that they say to you in your first day in a fucking finance course.",
        "created_utc": 1585855140,
        "id": "fm8seh6",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1585883940.0
    },
    {
        "author": "MortimerMcMire",
        "body": "over ten million dollars if SPY hits $10 tomorrow\n\nabout $3k if it doesnt",
        "created_utc": 1585771953,
        "id": "fm5fgij",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1585800753.0
    },
    {
        "author": "HinduHamma",
        "body": "Someone gets it. \n\nMarkets dump on uncertainty. That’s a fact of life. Right now there is certainty that this will hurt the economy in the short term . That’s it. We all know record unemployment. We all know companies are guiding down. \n\nAnd it’s only going to last a few quarters to a year maybe. We don’t even need a vaccine  but if one comes to life, great.. Hell we don’t even have one for the flu. Shots don’t do much. Last I checked people still die every year from flu season. \n\nMarket is moving as if this is a short term concern. Which is it. Bears want to believe the sky is falling and the world is going to stay on fire for a long time. When that becomes reality the market will price it in. Right now it ain’t a reality. \n\nRight now there’s no new uncertainty (besides oil drama but that’s a different narrative). But there is more $$ in the system. And that cash is to go somewhere. Stocks are a pretty fucking good place for it to go compared to the other shitty options (bonds, gold, oil, sitting in cash , etc)\n\nThat’s all there is to it. Money supply bigger. Money had to be allocated somewhere. The folks who get to play with this $$ are throwing it into the market. The end. You don’t get to decide where it goes. I know some of you think it’s unwise for it to go into stocks lol. \n\nGood luck on telling them they should pull out and be scared lol. I’m sure they wanna listen to redditors who snort zerohedge articles for breakfast.",
        "created_utc": 1586381080,
        "id": "fmty4l2",
        "score": 53,
        "subreddit": "investing",
        "created": 1586409880.0
    },
    {
        "author": "bluster_cretin",
        "body": "Can confirm. Saw it on reddit.",
        "created_utc": 1585780688,
        "id": "fm5vbnd",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1585809488.0
    },
    {
        "author": "Painpita",
        "body": "So your plan is to sell SPY at the bottom that you don't know, then buy calls for a snap back with a strike price unknown with a upper resistance that you don't know, and make profit out of it?\n\n&amp;#x200B;\n\nSeems bulletproof.",
        "created_utc": 1585799914,
        "id": "fm6psju",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1585828714.0
    },
    {
        "author": "scrapin_by",
        "body": "Say it with me....\n\n“MARKETS ARE FORWARD LOOKING”\n\nRecent data is indicating the curve may be flattening and measures are working. This on top of literally trillions of dollars in stimulus is whats causing confidence to come back again. \n\nNow the market could be wrong, we could double dip and covid19 might take off again.",
        "created_utc": 1586371437,
        "id": "fmtennx",
        "score": 50,
        "subreddit": "CanadianInvestor",
        "created": 1586400237.0
    },
    {
        "author": "PlayFree_Bird",
        "body": "I mean, this is all fine and well and you make some good points, but like so many of these posts lately, it's missing the most important paragraph at the end:\n\n\"Therefore, as an investor, you should...\"\n\nThis sub is about investing and the people here are interested in taking their available money and using it to maximize returns in the long run.  I suppose I just don't see the point of all these posts that all lay out some case for a massive correction or reset or collapse or depression without mentioning what the prudent course forward should be for the average person.\n\nSo, what's the play here?  Sit around with one hand on your gun and the other on your stack of cash waiting for the \"Big One\" to bring the world to its knees so that we can say, \"I told you so\"?  As somebody in another thread said, we can all play armchair analyst and try to figure out why the market isn't behaving the way we expected (or wanted it to), but you can only do that retrospectively.  By the time you figure out why the market is up 25% from two weeks ago, it's already up.  \n\nMaybe the market is due for another dive, maybe not.  But, what should we be waiting for?  We need a conclusion to your thesis here.  \"Therefore, you should...\"",
        "created_utc": 1586378554,
        "id": "fmtt4wz",
        "score": 49,
        "subreddit": "investing",
        "created": 1586407354.0
    },
    {
        "author": "iRelapse",
        "body": "Oh holy shit. I did not realise it was Friday, fucking looks like I'm holding all fucking weekend.\n\nGod damn quarantine fucking with my brain, not knowing what fucking day it is, God damn it.",
        "created_utc": 1585944273,
        "id": "fmcerza",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1585973073.0
    },
    {
        "author": "g____19",
        "body": "My lame buddy was like “brooo you need to go to r / slash / wallstreetbets I just found it and it’s fucking sooo funny brooo”\n\nSo if you see this Dan fuck you, ps your sister is pretty hot and keeps texting me late at night",
        "created_utc": 1585883024,
        "id": "fma3oep",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1585911824.0
    },
    {
        "author": "ghasp",
        "body": "To all those worried: I don't believe that VS meant that the direction of this market depends on today's actions alone. He is saying that there is major support point around SPY 248 - if the market lands above 252, it signals an upward movement to 263 which, if broken, means we are going to 270. If we hit 270, we are going to 300. It would be a sharper \"V\" shape recovery. \n\nTomorrow, or even next week, it is possible to do battle at 248 and win and signal a downward movement towards 231. Here we get into a faster free-fall.\n\nIt looks like a bear flag is happening on SPY and it is possible that the movement down is an escalator. If SPY breaks 263, the bear flag is pretty invalid IMO. VIX would mellow and we could reach the goal, but with more sideways trading (drawn out over months).\n\nCorrect or comment, please\n\nEdit: could also be other continuation patterns, but this theory more aligns with a quicker drop, like the bear flag...",
        "created_utc": 1585875178,
        "id": "fm9rw46",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1585903978.0
    },
    {
        "author": "wolfffman80",
        "body": "I’m with you, I honestly feel like if I sell the tsunami down will be the next day.  How can the market be roaring, it is just nonsense",
        "created_utc": 1586367672,
        "id": "fmt6k67",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1586396472.0
    },
    {
        "author": "EquivalentSelection",
        "body": "I know it might be a totally wild idea...but it just might work.  Brace yourselves, because this could blow your mind.\n\nCreate a new account.\n\nI know, I know... you're going to tell me that it's just not the same.  I know.  That's why it's called a \"new account\".\n\nYour new name shall be SpeaksInBooleansTrue.  You'll get your karma back - you're a hero now.  Nothing but upvotes for you no matter what you say.  You can kill babies and you're still getting upvotes.",
        "created_utc": 1586388131,
        "id": "fmubgp3",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1586416931.0
    },
    {
        "author": "SHITPOST_CENTRAL",
        "body": "My CEO scheduled 1 on 1 meetings with everyone in my department for this afternoon. It was nice knowing u bois",
        "created_utc": 1585772574,
        "id": "fm5glyr",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1585801374.0
    },
    {
        "author": "Posrover",
        "body": "Relax man. Go have a beer or two and check back tomorrow. I’ve seen plenty of these panic posts and it’s something screwy about how it appears right after it expires.",
        "created_utc": 1586381447,
        "id": "fmtyuad",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1586410247.0
    },
    {
        "author": "never_fucking_giveup",
        "body": "Holy shit it went tits up?",
        "created_utc": 1586393181,
        "id": "fmukha6",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1586421981.0
    },
    {
        "author": "kinzaman",
        "body": "Honestly, this. The large players in the market could make SPY go to 350 tomorrow if they wanted to. The market doesn’t reflect fundamentals any more, it’s just a bunch of computers calculating the optimal way to move prices around to take money away from suckers like us.\n\nThe bad news will continue to pile on, day after day and SPY will continue to go up. Then one day, for no discernible reason, it will drop 15%. It won’t make sense to any of us, but someone with deep pockets will profit greatly from it.",
        "created_utc": 1586386036,
        "id": "fmu7jun",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586414836.0
    },
    {
        "author": "Variation-Separate",
        "body": "I said it opens up 300. But they're squeezing everyone so hard. \n\nThursday will sell off. The following weeks will be blood baths.",
        "created_utc": 1586218308,
        "id": "fmn4yli",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586247108.0
    },
    {
        "author": "FuckThisSite2020",
        "body": "&gt; Cuban also said the pandemic will end up improving capitalism with companies putting employees first.\n\nLmao, suuuuure it will",
        "created_utc": 1586380764,
        "id": "fmtxih4",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586409564.0
    },
    {
        "author": "Dildobagginz6969",
        "body": "My favorite thing to do in Vegas.  Get my money back.  It always works out so well.",
        "created_utc": 1586214823,
        "id": "fmmz28u",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1586243623.0
    },
    {
        "author": "pie-man",
        "body": "i bet carol baskin had something to do with it",
        "created_utc": 1586316928,
        "id": "fmr98pt",
        "score": 44,
        "subreddit": "investing",
        "created": 1586345728.0
    },
    {
        "author": "Variation-Separate",
        "body": "Yep, you got it. Close under 265.",
        "created_utc": 1586203253,
        "id": "fmmdead",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1586232053.0
    },
    {
        "author": "TriHardSlapper123",
        "body": "I'll take it in cash and buy ice cream for everyone 🍦",
        "created_utc": 1586388925,
        "id": "fmucw2m",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1586417725.0
    },
    {
        "author": "Variation-Separate",
        "body": "First, I said oil would gap down and most likely pull equities. It didn't pull equities and we had divergence.\n\nSecond, I said there would be a sell off on Thursday into close since no one really wants to hold for the long weekend.",
        "created_utc": 1586220823,
        "id": "fmn94cj",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1586249623.0
    },
    {
        "author": "Adios_numero_two",
        "body": "For any bears out there dude I feel you. Shits hit us all in different ways. My parents entrusted our family business accounts to me since I’m getting old enough to learn the ropes to take over one day but they’ve been struggling to keep the business afloat because they lack the cash flow or funds to storm the pandemic weather.\n\n\nThey told me if there’s any way I can invest some of their capital to generate extra funds to keep their store open they’re willing to let me man up and take the opportunity to do so.\n\n\nI took the remaining cash left in all of their accounts and literally dumped it into SPY puts hoping for a humble 2-3x return which will buy them a whole year of operations.\n\n\nMy portfolio is now at 2% of its original worth. I have not told my parents what happened yet. I’ve seriously fucked up. Not only did I ruin their business, but also lost their trust and probably make them regret them ever giving birth such a worthless idiot of a money sink. If I haven’t hit rock bottom yet, this might be it.",
        "created_utc": 1586220121,
        "id": "fmn7yq2",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1586248921.0
    },
    {
        "author": "superwonton",
        "body": "Grandpa how did you make your money?\n\nIn the global pandemic of 2020, your grandpa took his life savings and bought calls in Peloton because he had the foresight that regardless of 30% unemployment, people can't use a regular $200 exercise bike and need a $2300 bike with a $50 monthly subscription so it can sit and collect dust.",
        "created_utc": 1585772100,
        "id": "fm5fq9r",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1585800900.0
    },
    {
        "author": "AloneForever",
        "body": "Got it, buy calls. Thanks for your sacrifice.",
        "created_utc": 1586281027,
        "id": "fmphoyu",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1586309827.0
    },
    {
        "author": "smallchimpu",
        "body": "I wanna tell something to y'all , please get back to your life ,don't watch Batman guy for hours , don't watch futures and market for 18 hrs a day ,there is more to your life , I just realized how many days I wasted :'( ,will just keep my position for now ,but even if I earn I don't think the amount of time invested was worth it , I will probably take a break once this position ends , I am numb rn",
        "created_utc": 1585858942,
        "id": "fm8zm16",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1585887742.0
    },
    {
        "author": "jwd52",
        "body": "So... did everybody here start options trading with a few lucky moves that doubled their money, naively convince themselves that it was an easy thing to do, and then proceed to lose everything and then some with increasingly stupid decisions? Asking for a friend",
        "created_utc": 1585934090,
        "id": "fmbvpo2",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1585962890.0
    },
    {
        "author": "DeltafrogB69",
        "body": "That's exactly the principle he operates on. You don't buy his fund to make 8% a year. You buy a small piece of his fund as insurance so that when shit hits the fan and your main portfolio sinks 30% overnight, your Universa holdings balance it out by going up 600%.",
        "created_utc": 1586393343,
        "id": "fmukrv9",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1586422143.0
    },
    {
        "author": "coloradical5280",
        "body": "FFS you guys, few things:  \n\\-- VS has some of the best TA insights I've seen on this sub, but if you don't understand the fundamentals of what he's talking about and market movement in general, then go do something else until fantasy football comes back  \n\n\n\\-- If you have a strong (data driven) belief that the market will test a new low or hit a lower low, pick a strike that's a month or two out from when you think that low could happen...  e.g., NOT APRIL  \n\n\n\\-- Follow that road map, like VS said, and don't freak out in the meantime.  If you think we'll hit 200 by early May, why are you reacting to a 2% move at the beginning of April?  Have an exit date, and an exit PT:  \n\n\nExample:  I think we will retest lows around $217 by the beginning of May.  \nOver the last week I bought 5/15 $240s, $230s  and  6/17 $240s\n\nI will exit these positions if we hit $215.  It could go lower, but your never going to call the bottom so don't try.  Until then, just chill, pay attention but not obsessively.  If something fundamentally changes (e.g., and effective treatment gets approved) reconsider your theory.  \n\n\nStay calm, and stop watching Batman. Go outside, take a walk, learn to play an instrument or code or something.",
        "created_utc": 1585860777,
        "id": "fm931xk",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1585889577.0
    },
    {
        "author": "Charliebush",
        "body": "Not by OP tho. I heard Questtrade was threatening to burn their own office down and pin it on OP.",
        "created_utc": 1585865648,
        "id": "fm9byo7",
        "score": 39,
        "subreddit": "investing",
        "created": 1585894448.0
    },
    {
        "author": "motley_bruin",
        "body": "Unless Fibonacci can time travel the quantum realm and unplug Powell’s printer I don’t see it happening",
        "created_utc": 1586280581,
        "id": "fmpgtlt",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1586309381.0
    },
    {
        "author": "KremlinBot79",
        "body": "Just so he can lose it again on options expiring in four hours.",
        "created_utc": 1585787804,
        "id": "fm67acw",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1585816604.0
    },
    {
        "author": "Variation-Separate",
        "body": "Couldn’t have said it better. Thanks.",
        "created_utc": 1585875224,
        "id": "fm9rypu",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1585904024.0
    },
    {
        "author": "bazookatroopa",
        "body": "1821+ recorded deaths today...\n\nHeart disease - 1700/day\n\nCancer - 1600/day\n\nEven without many deaths being recorded... COVID-19 is now officially the most deadly thing in the US and it hasn’t even begun to peak \n\n5/1 SPY 420c",
        "created_utc": 1586295768,
        "id": "fmqa5m1",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1586324568.0
    },
    {
        "author": "GermyBones",
        "body": "BRRRRRR\n\nThat's it. That's the whole bull thesis.",
        "created_utc": 1586371451,
        "id": "fmteonz",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1586400251.0
    },
    {
        "author": "726bh",
        "body": "Thanks guys I don't need your apologies just do your crazy yolo options and if you win big do it for him",
        "created_utc": 1586212927,
        "id": "fmmvl5l",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1586241727.0
    },
    {
        "author": "saeuta31",
        "body": "I also want a \"fuck questrade\" flair. Just to remind me to never use it",
        "created_utc": 1585866779,
        "id": "fm9dyf1",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1585895579.0
    },
    {
        "author": "SensualKoala",
        "body": "POKIMANE IF YOURE READING THIS PLEASE REMEMBER THE TIME I SOLD MY HOUSE AND DONATED ALL MY MONEY TO YOU\n\nMY WIFE LEFT ME AFTER CHEATING ME WITH MY BEST FRIEND, THAT WAS ALSO MY DOG, NOW IM DIVORCED, HOMELESS AND DOGLESS\n\nBUT IT WAS ALL WORTH IT\n\nI LOVE YOU POKIMANE",
        "created_utc": 1586380283,
        "id": "fmtwknt",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1586409083.0
    },
    {
        "author": "Thieman15",
        "body": "GEX: -773m\nDIX: 51.1%\n\nMy interpretation: Market makers are short gamma (GEX is negative), meaning they’ve sold a lot of option contracts. In order to delta hedge those contracts they are having to sell more underlying equities which is putting even more downwards pressure on the market. \n\nGiven that DIX is the second highest print the system has ever seen, even on a -5% day, it’s likely that market makers are being forced to buy to prevent an even greater collapse. Correct me if I’m wrong here but this could get ugly tomorrow.\n\nEdit: looking at December 2018 recovery we saw a large discrepancy between the DIX and GEX. DIX was in the high 40’s and GEX was extremely negative. Negative gamma causes the movement of the market to be accelerated, no matter if it’s up or down. In the 2018 recovery it was an upward movement...today we’re seeing a downwards trend. This is why I think it will continue to trend downwards.",
        "created_utc": 1585782589,
        "id": "fm5yk7y",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1585811389.0
    },
    {
        "author": "SaveMyElephants",
        "body": "After awhile you get used to it. I actually enjoyed playing with their little mushroom in Thailand",
        "created_utc": 1586370445,
        "id": "fmtcjb2",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1586399245.0
    },
    {
        "author": "silicapacks",
        "body": "This is my favorite thread, feel like the IQ avg is higher here, but some of these comments are cringeworthy. VS is obviously a nice guy, not just because he shares his thoughts, but mostly because he's willing to answer VERY REPETITIVE UNNECESSARY questions. Here's the thing, when you constantly ask questions and bring doubt into the conversation, a good trader will lose their way. Pressure can also be detrimental, so the high praises and nut licking doesn't help. We all lost a lot of money here, so please chill out so your \"Messiah\" can focus.\n\nOn a brighter note, for those who need some bias to get through the night:\n\n1. SPY closed at 251.83. If I was a MM and I had a dick load of puts headed my way tmmw, knowing the feared resistance line is 252, I'd crank it up to 251.99 just to fuck with you.\n2. Gundlach is shorting.\n3. Goldman sees 200 by mid year.\n4. SPY gap at 230. SPY always fills its gaps.\n\nNote to self: Stop betting against TSLA, you fuckin bafoon!!!!!!",
        "created_utc": 1585864029,
        "id": "fm990ve",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1585892829.0
    },
    {
        "author": "StonkAutist",
        "body": "Against my better judgement I held today - I really believed in the thesis. Too bad all the government cares about is propping up the market to keep the rich rich. \n\nFor those with losses just know I went all in on these puts and lost 90k in the last week. \n\nIt could be worse. \n\nCheers.\n\nEDIT: the Thesis also made me 180k on the first leg down so I’m not broke. Just pissed i nuked it after i made it.",
        "created_utc": 1585858941,
        "id": "fm8zlyx",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1585887741.0
    },
    {
        "author": "jaehoony",
        "body": "Devil's advocate counterpoint: You know how during a bubble, we look at all those indicators you just mentioned and think, this is clearly an insane bubble and it will pop soon, but it doesn't and just keeps growing for years? What if that just keeps on happening?",
        "created_utc": 1586384808,
        "id": "fmu57qp",
        "score": 36,
        "subreddit": "stocks",
        "created": 1586413608.0
    },
    {
        "author": "CC_1138",
        "body": "LOOOOOOOOOOOL man’s gonna yolo all that dough into something really retarded and lose it all",
        "created_utc": 1586286763,
        "id": "fmpsyec",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1586315563.0
    },
    {
        "author": "bliss16",
        "body": "SPY $330C 4/17 got it",
        "created_utc": 1586383089,
        "id": "fmu207d",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1586411889.0
    },
    {
        "author": "Lead5alad",
        "body": "It is almost funny how a bunch of people on this sub (including myself) lost money buying OTM calls that expire in 30 minutes during the historical witching hour, and then just a few days later we get to see one of the biggest run-ups ever.\n\nTypical wallstreetbets fashion to be somewhat right, but to still lose a lot of money",
        "created_utc": 1586207286,
        "id": "fmml5zh",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1586236086.0
    },
    {
        "author": "rawj5561",
        "body": "/u/variation-separate, if you notice me, it will be a ray of shining light on my portfolio of blood red darkness.",
        "created_utc": 1586196531,
        "id": "fmm0isz",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1586225331.0
    },
    {
        "author": "theoldandtheresting",
        "body": "&gt;MCHP",
        "created_utc": 1585749677,
        "id": "fm49lxg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585778477.0
    },
    {
        "author": "theoldandtheresting",
        "body": "MCHP, I'm the idiot. My bad. All nighter.",
        "created_utc": 1585749762,
        "id": "fm49qyj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585778562.0
    },
    {
        "author": "theoldandtheresting",
        "body": "MCHP",
        "created_utc": 1585749655,
        "id": "fm49koh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585778455.0
    },
    {
        "author": "clever_username7",
        "body": "Global push for a mandatory vaccine instead of treatment so they can microchip us",
        "created_utc": 1585763556,
        "id": "fm4zhyf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585792356.0
    },
    {
        "author": "theoldandtheresting",
        "body": "MCHP",
        "created_utc": 1585749697,
        "id": "fm49n5g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585778497.0
    },
    {
        "author": "theoldandtheresting",
        "body": "MCHP",
        "created_utc": 1585749689,
        "id": "fm49moy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585778489.0
    },
    {
        "author": "theoldandtheresting",
        "body": "MCHP",
        "created_utc": 1585749693,
        "id": "fm49my1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585778493.0
    },
    {
        "author": "theoldandtheresting",
        "body": "MCHP",
        "created_utc": 1585749681,
        "id": "fm49m7y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585778481.0
    },
    {
        "author": "vanderdutch307",
        "body": "Not sure if either effect MCHP. 1.Chip components are having supply chain issues 2. US still trying to sink Huawei by licensing US chip manf equipment. This may or may not pass. https://www.foxbusiness.com/technology/huawei-chip-tech-national-security\nI'm short on $TSM p $45 5/8 hoping it does.",
        "created_utc": 1585752259,
        "id": "fm4e066",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585781059.0
    },
    {
        "author": "CaeliaShortface",
        "body": "you may be onto something with MCHP. \n\nOn top of the debt, their customers are heavy manufacturing (automotive being the largest). Their solutions go in the plants and nobody is doing heavy manufacturing right now. \n\n&amp;#x200B;\n\n[https://www.microchip.com/design-centers/automotive-solutions](https://www.microchip.com/design-centers/automotive-solutions)",
        "created_utc": 1585752386,
        "id": "fm4e863",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585781186.0
    },
    {
        "author": "Icehoot",
        "body": "It's fucking Microchip, ignore this post and inverse WSB. Jesus.",
        "created_utc": 1585776309,
        "id": "fm5nj4b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585805109.0
    },
    {
        "author": "alp-son",
        "body": "Thank you for your time sir. I definitely will look for some kind of cloud index or microchip",
        "created_utc": 1585941520,
        "id": "fmc9od2",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1585970320.0
    },
    {
        "author": "theoldandtheresting",
        "body": "MCHP",
        "created_utc": 1585749685,
        "id": "fm49mg9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585778485.0
    },
    {
        "author": "theoldandtheresting",
        "body": "MCHP Puts 4/17 for now, I'll roll out until mid June on these starting Monday since it doesn't look like they should make it past that.",
        "created_utc": 1585750723,
        "id": "fm4bcfw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585779523.0
    },
    {
        "author": "Grizzant",
        "body": "microchip produces a good product. they are diversified across several major sectors. is your entire premise built on the fact they have debt they have to service?",
        "created_utc": 1585754428,
        "id": "fm4hufr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585783228.0
    },
    {
        "author": "theoldandtheresting",
        "body": "MCHP June 1 is there first next big payment. They should have $800M in the bank with the revolver and what little was left from employee shares. Next payment should be $230M June 1. With being unable to collect on the A/R, it will probably look like a better option to get the ball rolling on selling off pieces or outright bking seeing the future outlook. They cannot outpace their debt. Revolver due 3/21/21 and that first note of 1B due 6/1/21. \n\nIt might not hit by Jun 15 strike, but it will be damn close.",
        "created_utc": 1585752620,
        "id": "fm4emu6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585781420.0
    }
]