[
    {
        "author": "Jackismyson",
        "body": "Here are my buys and prices. All bottom of technical channel. \n\n&amp;#x200B;\n\n* AAPL - $160\n* ADBE - $150\n* AMD - $30\n* AMZN - $1300\n* AON- $120\n* AVGO - $125\n* AXP - $49.57\n* BABA - $115\n* BAC - $15\n* BLL - $40\n* CDNS - $35\n* CHTR - $275\n* CMG - $325\n* COF - $40\n* COKE - $125\n* COST - $160\n* CRM - $100\n* D - $45\n* DHR - $79.82\n* DIS - $75\n* DXCM $125\n* EL - $105\n* EQIX- $325\n* EXAS - $35\n* FB - $125\n* GIS - $35\n* IRM - $20\n* ISRG - $300\n* JNJ - $75\n* KEYS - $60\n* LHX - $120\n* LOW - $50\n* LRCX - $83.85\n* LUV - $25\n* LYV - $30\n* MAA- $85\n* MAR - $35\n* MDB - $75\n* MSFT - $95\n* NKE - $50\n* NNN- $22\n* NOW - $180\n* NVDA - $150\n* O - $34.76\n* PG - $65\n* PLD - $35\n* RCL - $20\n* SBAC - $175\n* SBUX - $50\n* SNPS - $80\n* SO - $40\n* SPLK - $85\n* SRE - $70\n* T- $25\n* TDG - $150\n* TSLA - $250\n* TSM - $30\n* V - $95\n* VRTX - $125\n* VZ - $30\n* WELL - $20\n* WPC - $35",
        "created_utc": 1586207845,
        "id": "fmmm7fw",
        "permalink": "/r/wallstreetbets/comments/fw70j6/what_are_your_moves_tomorrow_april_07_2020/fmmm7fw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1586236645.0
    },
    {
        "author": "damanamathos",
        "body": "Zoom Vivendi Synopsys SoftBank Slack + 40 smaller positions.",
        "created_utc": 1586409562,
        "id": "fmv989i",
        "permalink": "/r/stocks/comments/fxlnht/share_your_portfolio/fmv989i/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586438362.0
    },
    {
        "author": "1st_Amendment_EndRun",
        "body": "NVIDIA- good choice - machine learning for automation to replace all those meatsacks that just got laid off \n\nPeleton - good for now - what happens when you don't pay your subscription?  Does someone come to your home to repossess the hardware?\n\nDropbox - meh - how is this any different than icloud... oh, that's right, it works across both platforms\n\n- Gilead - good for now - They'd better have some sort of moated COVID-19 solution\n\n- Rapid7 - meh - does staying at home mean everyone becomes a hacker?\n\nSplunk -  probably fine - I mean, this stuff has been around for years and is already part of most CI/CD/DS environments\n\nPayPal - meh - The fintech space is going to heat up as people start P2P garange selling every god damned piece of shit thing they own to make rent/mortgage and PayPal ain't it.\n\nApple - probably not a good choice - supply chain issue / not generating a continuous stream of content for users to consume what they're locked down\n\nSynopsys - meh - Do you think there's going to suddently be a bust of electronic development?  During the Q4 2018 draw down, they were below $90/share.\n\nMicron - meh - I'm sure they'll get to $90/share one of these years; Q4 2018 saw them at $30/share\n\nMicrosoft - meh - seemingly impervious... probably due to all those Office 365 subscriptions they've been selling for the last month; we'll see how long those subscriptions last when everyone get back on their Office exchange server.\n\nWestern Union - No. - Why send money home when you can actually go home since your restaurant job doesn't exist any more.\n\nStarbucks - No. - Anyone care to compare Luckin's fraud with the number of Starbuck store closures?\n\nFacebook - Yes. - I don't use facebook, but I can just imagine what a cesspool it will become when the only thing people can do to vent their frustration is use facebook.\n\nIntuitive Surgical - No. - I'll never let a robot anywhere near my insides after watching the Netflix documentary The Bleeding Edge.",
        "created_utc": 1586021448,
        "id": "fmf7fq9",
        "permalink": "/r/stocks/comments/fus61x/list_of_stocks_im_looking_at_thoughts/fmf7fq9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586050248.0
    }
]