[
    {
        "author": "itachi12131415",
        "body": "I heard he lost it all and had to start working at a Dairy Queen.\n\nPoor guy.",
        "created_utc": 1591637832,
        "id": "fte0u4t",
        "score": 1423,
        "subreddit": "wallstreetbets",
        "created": 1591666632.0
    },
    {
        "author": "ofimmsl",
        "body": "Click the blue triangle on top of the ad. It lets you select a reason to not see those types of ads anymore. In your case you would select \"ive already purchased this product\"",
        "created_utc": 1591722547,
        "id": "fthssxy",
        "score": 1298,
        "subreddit": "wallstreetbets",
        "created": 1591751347.0
    },
    {
        "author": "Retard069",
        "body": "Retards like us, started to think they are smarter than Buffet. Yep, we've reached that level of stupid, so SPY400 it is :D\n\nEDIT: Thanks for all the likes and award. I honestly want to be an old dumb fuck as Buffet and loose a couple of billions on airlines.",
        "created_utc": 1591712929,
        "id": "fth96lo",
        "score": 1085,
        "subreddit": "wallstreetbets",
        "created": 1591741729.0
    },
    {
        "author": "hippiegodfather",
        "body": "I’m more the ‘fuck up for twenty years and fix it all in 5 minutes’ breed of retard.",
        "created_utc": 1591640507,
        "id": "fte68lz",
        "score": 972,
        "subreddit": "wallstreetbets",
        "created": 1591669307.0
    },
    {
        "author": "piggydancer",
        "body": "Billionaire investors also have a lot more to lose and a lot less to gain from taking large risks. That shouldn't be lost in the average retail investor. Investing with 1 billion should be different than investing with 10k. \n\nIt doesn't surprise me that he and other large investors who manage money for incredibly wealthy clients have a lower threshold for risk. They should. As long as they out pace inflation and don't spend more than they make, they can afford to live for life times. \n\nAverage investors need to grow their money. Wealthy investors need to protect theirs. Don't get caught up comparing yourself or following the path of someone with different goals.",
        "created_utc": 1591620187,
        "id": "ftd4bxs",
        "score": 866,
        "subreddit": "investing",
        "created": 1591648987.0
    },
    {
        "author": "sebach22",
        "body": "First ones free retard, try again and see how it works out",
        "created_utc": 1591629254,
        "id": "ftdjomp",
        "score": 788,
        "subreddit": "wallstreetbets",
        "created": 1591658054.0
    },
    {
        "author": "Kieran1664",
        "body": "Jokes on you, it costs $0 to pre-order a Nikola truck.\n\nPreordering 1000 trucks and buying calls 🤑/s",
        "created_utc": 1591686970,
        "id": "ftgd1uy",
        "score": 760,
        "subreddit": "wallstreetbets",
        "created": 1591715770.0
    },
    {
        "author": "NormalGap",
        "body": "I genuinely hope everyone in this sub hits it big.",
        "created_utc": 1591647556,
        "id": "ftekm1i",
        "score": 495,
        "subreddit": "wallstreetbets",
        "created": 1591676356.0
    },
    {
        "author": "Mousek801",
        "body": "Fuck it. Let him YOLO that Communion money.",
        "created_utc": 1591712705,
        "id": "fth8rfs",
        "score": 426,
        "subreddit": "wallstreetbets",
        "created": 1591741505.0
    },
    {
        "author": "Yankee_Fever",
        "body": "Nobody understands how scary it is that a bunch of people getting free money, with a 3rd grade reading level, and never read a single book on investing, can just gamble a company back into existence.\n\nIt's scary because the entire market is going to fucking implode. It's all Fugazi",
        "created_utc": 1591812581,
        "id": "ftlwudj",
        "score": 372,
        "subreddit": "wallstreetbets",
        "created": 1591841381.0
    },
    {
        "author": "shawnsblog",
        "body": "My wife saw I was negative today and asked what you do about it.\n\nTold her you wait for tomorrow and hope it's better.",
        "created_utc": 1591745264,
        "id": "ftj37tr",
        "score": 365,
        "subreddit": "wallstreetbets",
        "created": 1591774064.0
    },
    {
        "author": "DiY4Engi",
        "body": "3 Million... fucking retire already. all these material things dont matter anyway. travel and live a happy life for the rest of your life....ooooor you could sell some spreads to make it 1 million more",
        "created_utc": 1591813054,
        "id": "ftlxusf",
        "score": 357,
        "subreddit": "wallstreetbets",
        "created": 1591841854.0
    },
    {
        "author": "GlideOutside",
        "body": "Thanks, my wife’s bf told me to post it this way",
        "created_utc": 1591629258,
        "id": "ftdjovx",
        "score": 353,
        "subreddit": "wallstreetbets",
        "created": 1591658058.0
    },
    {
        "author": "moonshine_865",
        "body": "I knew it. \n\nFull 🌈",
        "created_utc": 1591753210,
        "id": "ftjh6dw",
        "score": 340,
        "subreddit": "wallstreetbets",
        "created": 1591782010.0
    },
    {
        "author": "13pts35sec",
        "body": "&gt; it just means you’re bogarting chromosomes\n\nI’m sorry but that was beautiful now if you don’t mind I’m going to steal this comment and use it as both the title and body for my upcoming Forbes piece",
        "created_utc": 1591756553,
        "id": "ftjmu78",
        "score": 335,
        "subreddit": "wallstreetbets",
        "created": 1591785353.0
    },
    {
        "author": "HinduHamma",
        "body": "Uncharted territory my fucking ass. \n\nAll the sp500 has ever done is make new ATHs time after time , crash after crash. This time is not any different. This is normal. The speed at which it is recovering is also normal because every market participant knows the story of past US recessions and economic downturn - they know if you sell your holdings, you’ll regret it down the road. So what’s the point of selling right now if your actually investing for years, decades? None. Especially when it’s super easy to get a loan for rock bottom rates, cash is very accessible for all the big boy investors and institutions. \n\nEveryone constantly downvoted bulls in March for even thinking that a V shape market recovery was gonna happen, for ever thinking we were gonna see ATHs again this year. Don’t worry I haven’t forgotten. There’s a lot of remind me bot posts I got coming due soon from March . \n\nOnce again bears, hold this L . Scoreboard don’t lie. You never win consistently. Keep being wrong and stay salty about this. I’m sorry you missed out on the greatest 50 day rally in stock market history. That’s gonna be a good story to tell your grand kids at least.",
        "created_utc": 1591648278,
        "id": "ftem3cj",
        "score": 267,
        "subreddit": "investing",
        "created": 1591677078.0
    },
    {
        "author": "confusedp",
        "body": "tsla above $1k nails it. At this rate, he should be building cars that lays gold for it to be worth that much. I declare this is peak EV bubble, but this balloon still has some stretching before it will burst.",
        "created_utc": 1591800298,
        "id": "ftl94ha",
        "score": 262,
        "subreddit": "wallstreetbets",
        "created": 1591829098.0
    },
    {
        "author": "Two_Pizzas_Each",
        "body": "I'm diving in but if it doesn't work out you owe me a beer",
        "created_utc": 1591660592,
        "id": "ftf9q6r",
        "score": 259,
        "subreddit": "pennystocks",
        "created": 1591689392.0
    },
    {
        "author": "pennyhardaway11",
        "body": "They’re just mad that their forecasts were wrong and the kids profited from it. Even tho the market will eventually fall.",
        "created_utc": 1591795021,
        "id": "ftkzdhi",
        "score": 256,
        "subreddit": "wallstreetbets",
        "created": 1591823821.0
    },
    {
        "author": "anik1993",
        "body": "We broke algos and unbankrupted companies 👏🏻 CNBC and Business Insider are more interested in WSB targets than Analyst ratings\n\nEdit: We might just end 2020 recession before it even started. Never doubt the power of WSB autists especially when they are jobless/working from home.",
        "created_utc": 1591713346,
        "id": "fth9yw9",
        "score": 239,
        "subreddit": "wallstreetbets",
        "created": 1591742146.0
    },
    {
        "author": "Flash_ina_pan",
        "body": "Robinhood traders are just Cthulhu in tights. Stealing from the rich and yoloing it into the void.",
        "created_utc": 1591760306,
        "id": "ftjt1x4",
        "score": 232,
        "subreddit": "wallstreetbets",
        "created": 1591789106.0
    },
    {
        "author": "Vote_CE",
        "body": "If it collapses everyone will rush in to buy.",
        "created_utc": 1591650440,
        "id": "fteqjbu",
        "score": 228,
        "subreddit": "investing",
        "created": 1591679240.0
    },
    {
        "author": "pathrowaway555",
        "body": "Damn people actually withdraw? I just assumed we all throw it back in to the next shit stock",
        "created_utc": 1591655067,
        "id": "ftezm6l",
        "score": 227,
        "subreddit": "pennystocks",
        "created": 1591683867.0
    },
    {
        "author": "itsmeboogaloo",
        "body": "If you have money to trade, this sub is invaluable. \nJust learn how to read momentum. \n\nHell, I had never even heard of NKLA. Saw 100 posts a minute here today, checked the chart  and made 12k in 6 minutes on it.\n\n$12,000. In 6 minutes. From reading a bunch of comments on Reddit. \n\nSeriously, that was dope guys. Thank you.",
        "created_utc": 1591661459,
        "id": "ftfba2j",
        "score": 226,
        "subreddit": "wallstreetbets",
        "created": 1591690259.0
    },
    {
        "author": "PeakOfTheMountain",
        "body": "Please make sure to post the follow up of her losing it all on options.",
        "created_utc": 1591735402,
        "id": "ftijv3n",
        "score": 226,
        "subreddit": "wallstreetbets",
        "created": 1591764202.0
    },
    {
        "author": "HandsomeTar",
        "body": "Made $40k in one day yesterday. Lost 80% of it today. AMA.",
        "created_utc": 1591735098,
        "id": "ftij8lq",
        "score": 221,
        "subreddit": "wallstreetbets",
        "created": 1591763898.0
    },
    {
        "author": "SolitaryEgg",
        "body": "Yo seriously though, when did everyone here get so sensitive? When I am wrong and lose money, people on here mock me, and I laugh. I post my positions so people can call me a retard when I get shit on. It's all part of the game, baby. And it's fun. It adds a bit of SPICE to the market day.\n\nBut when I am right and make some jokes at others' expenses, people get *really* mad. Like, really mad. I've had multiple people send me hate PMs, try to doxx me, tag me for days straight to yell at me, etc etc. Like, jesus. It's not like I fucking know you. I'm not *actually* attacking you, personally.\n\nI swear this sub didn't used to be this way. We used to laugh at retards, and the retards would laugh along. And, most importantly, all of us are the retards sometimes. But, now, good lord, people are so fucking defensive.\n\nIs it the /r/all influx or something?\n\nAnyway, I feel like people really shouldn't be here if they can't handle some pub-grade banter when they make a bad play. Shouldn't really even be trading.\n\nThank you for coming to my TEDx talk.",
        "created_utc": 1591820082,
        "id": "ftmcst8",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1591848882.0
    },
    {
        "author": "Captain_Loosearrow",
        "body": "That one dude just manhandling a fucking bear, I love it.",
        "created_utc": 1591656855,
        "id": "ftf2y3h",
        "score": 204,
        "subreddit": "wallstreetbets",
        "created": 1591685655.0
    },
    {
        "author": "legendariers",
        "body": "Must be the top. Back in 1929, right before the crash, a young girl wrote a letter to Standard Oil with $4 (or maybe it was $40) attached asking if they could invest the money for her. It ended up in the papers and sentimental readers funded a share for her to own. Then the stock market tanked.\n\nEDIT: It was $4. She was trying to invest in Standard Oil of New Jersey, which reached a high of $37.25. The share was finally purchased just a few days before Black Tuesday.",
        "created_utc": 1591713283,
        "id": "fth9uhv",
        "score": 197,
        "subreddit": "wallstreetbets",
        "created": 1591742083.0
    },
    {
        "author": "IrregardlessOfFeels",
        "body": "I personally have found it super easy to not murder any black people in my life. I don't really get it.",
        "created_utc": 1591207434,
        "id": "fsrrn1q",
        "score": 196,
        "subreddit": "wallstreetbets",
        "created": 1591236234.0
    },
    {
        "author": "mr77",
        "body": "If everyone is a genius in a bull market. What does it mean if you're losing money right now?",
        "created_utc": 1591810407,
        "id": "ftls1q0",
        "score": 194,
        "subreddit": "wallstreetbets",
        "created": 1591839207.0
    },
    {
        "author": "stejerd",
        "body": "It's funny when you see videos like this the people that are trying to stop the fight only make it worse by basically restricting the person they are grabbing giving the other guy free shots. Not to say this guy would have done any better unrestrained  but you see it all the time.",
        "created_utc": 1591714814,
        "id": "fthctm8",
        "score": 184,
        "subreddit": "wallstreetbets",
        "created": 1591743614.0
    },
    {
        "author": "etmhpe",
        "body": "I know how to do it.  Take my course and I can teach you",
        "created_utc": 1591322997,
        "id": "fsxgb98",
        "score": 180,
        "subreddit": "investing",
        "created": 1591351797.0
    },
    {
        "author": "vaythooiah1111",
        "body": "If we have another red day, it will take 90% of wsb out",
        "created_utc": 1591736357,
        "id": "ftiluea",
        "score": 177,
        "subreddit": "wallstreetbets",
        "created": 1591765157.0
    },
    {
        "author": "Gndossan",
        "body": "We all know how it ends. All the bulls with delusions of grandeur locked inside of pods dreaming of green markets while the world is in a permanent depression",
        "created_utc": 1591632770,
        "id": "ftdqlar",
        "score": 173,
        "subreddit": "wallstreetbets",
        "created": 1591661570.0
    },
    {
        "author": "ryan_dfs",
        "body": "If they cash out, great job. \n\nMost of them probably will develop some kind of irrational confidence about their trading skills and lose it all back. Just like gambling.",
        "created_utc": 1591722294,
        "id": "fths9sq",
        "score": 172,
        "subreddit": "investing",
        "created": 1591751094.0
    },
    {
        "author": "orxababa",
        "body": "Car payment is a cheap loan. Keep at it",
        "created_utc": 1591724839,
        "id": "fthxnem",
        "score": 169,
        "subreddit": "RobinHood",
        "created": 1591753639.0
    },
    {
        "author": "mikeylew92",
        "body": "I mean do your own research... If someone says don't or do something; look it up.  Don't take it at face value.  TF kinda logic is that",
        "created_utc": 1591647652,
        "id": "fteksz7",
        "score": 163,
        "subreddit": "stocks",
        "created": 1591676452.0
    },
    {
        "author": "dwdsquared2",
        "body": "**Events in the US Today (EDT):**\n\n* 6:00am - OPEC Meeting \\[2/3 Volatility\\]\n* 7:00am - MBA Home &amp; Mortgage Data \\[1/3 Volatility\\]\n* 8:30am - Core CPI (MoM-May) \\[3/3 Volatility\\]\n   * Core CPI (YoY-May) \\[2/3 Volatility\\]\n   * CPI (MoM-May) \\[2/3 Volatility\\]\n   * Real Earnings (MoM-May) \\[1/3 Volatility\\]\n* 9:30am - Seevol Cushing Oil Storage Report \\[2/3 Volatility\\]\n* 10:00am - The House Judiciary Committee will hold a hearing about police brutality\n   * The Senate convenes to resume work on a measure that would provide maintenance funding for national parks and other public land.\n   * Treasury Secretary Steven Mnuchin will testify before the Senate Small Business and Entrepreneurship Committee during a hearing about provisions of the CARES Act enacted to respond to the pandemic\n* 10:30am - Crude Oil Inventories \\[3/3 Volatility\\]\n* 11:00am - Cleveland CPI (MoM-May) \\[1/3 Volatility\\]\n* 12:00pm - Thomson Reuters IPSOS PCSI \\[2/3 Volatility\\]\n* 2:00pm - FOMC Statement \\[3/3 Volatility\\]\n   * FOMC Economic Projections \\[3/3 Volatility\\]\n      * The first since late last year.  March was skipped.\n   * Fed Interest Rate Decision \\[3/3 Volatility\\]\n   * Federal Budget Balance (May) \\[2/3 Volatility\\]\n   * Press Secretary Kayleigh McEnany holds a briefing\n* 2:30pm - FOMC Press Conference \\[3/3 Volatility\\]\n   *  [https://www.youtube.com/watch?v=ehI0wxxEilc](https://www.youtube.com/watch?v=ehI0wxxEilc)\n* Boosted by the May jobs report, GOP lawmakers are urging a slow approach to pass another coronavirus package as it becomes more and more unlikely that the Senate will consider a bill before the July 4 recess\n* MGM to open more Vegas casinos, including Mandalay Bay and Aria, by July 1\n\n**Events in the World Today (EDT):**\n\n* 9:00am - Brazil CPI (MoM&amp;YoY-May) \\[2/3 Volatility\\]\n* 9:30am - ECB's De Guindos Speaks \\[2/3 Volatility\\]\n* Bulgaria's parliament on Wednesday approved government plans to cut value added tax (VAT) on food provided by restaurants and catering services\n* AMC Entertainment said it expects to reopen its theaters globally in July\n* North Korea might be making millions, and breaking sanctions, selling sand\n* ECB prepares 'bad bank' plan for wave of coronavirus toxic debt - Reuters\n* North Korean leader's sister emerges as policymaker in spat with South Korea\n\n**Earnings Before Open:**\n\n* United Natural Foods\n* Graham\n* Chico's\n* Guess\n* Red Robin\n* Cheetah Mobile\n\n**Earnings After Close:**\n\n* Neptune Wellness Solns, Inc.\n* Sartorius\n* Oxford Industries, Inc.",
        "created_utc": 1591787109,
        "id": "ftkoec9",
        "score": 163,
        "subreddit": "wallstreetbets",
        "created": 1591815909.0
    },
    {
        "author": "MadNhater",
        "body": "Waited all last week for a dip to buy and it never happened. I fomo’d into calls yesterday just in time to get fucked",
        "created_utc": 1591702552,
        "id": "ftgt02d",
        "score": 159,
        "subreddit": "wallstreetbets",
        "created": 1591731352.0
    },
    {
        "author": "Vegas1905",
        "body": "I do not know anything about the tech industry, but I imagine it also depends on the industry. Do you managers not know how to code or anything technical? I work in finance, and while my technical skills might be stronger than my boss', he could still do my job if he had to.",
        "created_utc": 1591809366,
        "id": "ftlpq2h",
        "score": 156,
        "subreddit": "investing",
        "created": 1591838166.0
    },
    {
        "author": "NerfJihad",
        "body": "Which will then make the front page, making it seem like these things are way more common than they are, leading to a false attribution.\n\nOr we're all geniuses and you're all invited to my yacht party!",
        "created_utc": 1591721372,
        "id": "fthqan7",
        "score": 151,
        "subreddit": "wallstreetbets",
        "created": 1591750172.0
    },
    {
        "author": "alanbakr22",
        "body": "if u really used reddit as a reliable source then you're REALLY lucky man. Happy to hear that it worked out well for you!",
        "created_utc": 1591718071,
        "id": "fthjcjo",
        "score": 151,
        "subreddit": "stocks",
        "created": 1591746871.0
    },
    {
        "author": "s0kuba",
        "body": "The market traded sideways for almost 15 years from 1998-2013 in nominal terms, and CD rates paid better than dividends for the entire period.  I am a long-term believer in the market but some people forget how long downward cycles can take.  I have 75% of my net worth in private equity which is illiquid so I'm heavily net-long regardless of whether I want to be or not.  But I still call it like I see it and this market is starting to feel irrationally exuberant, especially given the tax changes on the horizon which knock out a meaningful % of EPS all by themselves.",
        "created_utc": 1591650352,
        "id": "fteqcwv",
        "score": 151,
        "subreddit": "investing",
        "created": 1591679152.0
    },
    {
        "author": "notapropriate",
        "body": "*Airlines*\n\nRobinhood boys: it literally cannot go tits up 😎\n\nBuffet: I’ll sell at bottom 🧠",
        "created_utc": 1591812156,
        "id": "ftlvxek",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1591840956.0
    },
    {
        "author": "htr_xorth",
        "body": "Learn to be ok with not capitalizing on every stock you research.  I have refused to buy Tesla since $400 and I keep it on my watch list just as a test to my stock guidelines. Get used to fomo, embrace it as an unhealthy but normal feeling.  Just as people rush to buy lottery tickets as the prize pool grows.\n\nI won't buy Tesla because it's too expensive.  I like Tesla.  I like Elon.  I want Tesla to succeed.  I'm happy for those who are bought in.   I feel the fomo, but I ignore it, I'm not going to buy a speculative stock for $900+, I'm just not.",
        "created_utc": 1591816907,
        "id": "ftm63e5",
        "score": 144,
        "subreddit": "stocks",
        "created": 1591845707.0
    },
    {
        "author": "Khashoggis-Thumbs",
        "body": "Also it is stunning survivor bias. This sub is full of gay bears with gaping arseholes rubbed raw by the collossal green dildo of JPowni MC who used their puts as lube. And showed them how worthless they were.\n\nIt also happens to be full of bulls who said \"printer go brrr\" and stumbled cock first into a money orgy.\n\nNobody caught what the world's greatest investors missed. The sub is just big enough to have people on either side so someone is posting gains while another posts losses.\n\nCan wsbtards do it consistently? They can if it refers to gambling away yesterday's winnings.",
        "created_utc": 1591719877,
        "id": "fthn3z4",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1591748677.0
    },
    {
        "author": "MasterCookSwag",
        "body": "I think something that everyone here should keep in mind is that this sub has damn near doubled in the last year and a half.  It's traffic more than doubled over the last three months.  Most of the commenters here are extremely new to markets and investing - they may be extremely confident in expressing their \"analysis\" but it doesn't change the fact that the overwhelming tide of thought here is coming from an extremely novice place.  The voting system only amplifies that.\n\nI mean this genuinely when I say in the last three months almost every top comment in every front page thread has been either an outright wrong take or a very very surface level platitude.\n\nYou've probably seen this a lot but many of us repeat often that the stock market is not the economy.  When you see this sub push the rhetoric that the stock market right now has to be irrational because it isn't highly correlated with present day macro conditions you should take that as indicative of the broad inexperience present here rather than any sort of useful analysis of markets.  Your article puts figures to something a lot of us regulars have tried to tell people - the stock market is not the economy and it behaving out of lockstep with present day macro conditions is neither new nor unexpected.",
        "created_utc": 1591795524,
        "id": "ftl07sj",
        "score": 142,
        "subreddit": "investing",
        "created": 1591824324.0
    },
    {
        "author": "namsilat",
        "body": "Fuck the formatting, we'll do it live.",
        "created_utc": 1591681112,
        "id": "ftg6b98",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1591709912.0
    },
    {
        "author": "seattle_exile",
        "body": "There are a few things going on here, which I find fascinating.\n\n1. RH users and the meme team at WSB are fucking up the narrative. \n2. This whole market defies logic, but they take issue with it defying *their* logic.\n3. They fail to understand that the world Boomers have left Millennials is one where it takes significant risk to get anywhere close to where they did at the same age. YOLO indeed, and there are no $20/hr union jobs straight out of high school anymore.\n\nPeople here say that RH and other retail investors don't have the weight to move markets. I'm not so sure about that. HTZ should be 0, but it goes flying off the shelves. I suspect MMs and their algos then pick up the movement, and start picking up the stock as well.",
        "created_utc": 1591798331,
        "id": "ftl5a5z",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1591827131.0
    },
    {
        "author": "Vector3DX",
        "body": "&gt; Imagine if I held..\n\nIf you keep thinking like that you will lose it all in future trades. Profit is profit",
        "created_utc": 1591820190,
        "id": "ftmd0w3",
        "score": 139,
        "subreddit": "wallstreetbets",
        "created": 1591848990.0
    },
    {
        "author": "Nitemare32",
        "body": "There was a reply to a post in this sub once, it read “How can we have insider knowledge when we don’t have any knowledge?”, always stuck with me lol",
        "created_utc": 1591734338,
        "id": "ftihnlf",
        "score": 138,
        "subreddit": "wallstreetbets",
        "created": 1591763138.0
    },
    {
        "author": "tukatu0",
        "body": "Not instantly if it did. It probably had a concussion at least and a brain hemmorage at worst",
        "created_utc": 1591677635,
        "id": "ftg1szc",
        "score": 137,
        "subreddit": "wallstreetbets",
        "created": 1591706435.0
    },
    {
        "author": "Sooon99",
        "body": "It means literally nothing. He’s been selling his shares as his options are exercised for at least the last 9 years.\n\nhttp://www1.insider-monitor.com/trader/cik1524316.html",
        "created_utc": 1591416680,
        "id": "ft21sip",
        "score": 137,
        "subreddit": "investing",
        "created": 1591445480.0
    },
    {
        "author": "one0sixpdem",
        "body": "I would consider Hertz much more of a symbol of irrationality. They literally filed for bankruptcy and the stock is up like 800%. \n\nAt least NKLA has a plan and industry investors behind it to push their semi-truck production forward.",
        "created_utc": 1591670828,
        "id": "ftfrhxk",
        "score": 137,
        "subreddit": "investing",
        "created": 1591699628.0
    },
    {
        "author": "Vegas1905",
        "body": "Makes sense. If you're in the office, it gives an illusion that you are doing work even if you are not doing any. Once you work from home, unless you are sending regular emails and work product, that same illusion does not exist. This has already happened at my company where several people who obviously were never working or doing the bare minimum can no longer hide behind the illusion and have now found themselves without a job.",
        "created_utc": 1591808000,
        "id": "ftlmp5d",
        "score": 137,
        "subreddit": "investing",
        "created": 1591836800.0
    },
    {
        "author": "LongLiveDetroit",
        "body": "Thought it was going be some feel good shit LOLL",
        "created_utc": 1591714568,
        "id": "fthcc5p",
        "score": 135,
        "subreddit": "wallstreetbets",
        "created": 1591743368.0
    },
    {
        "author": "JeveSt0bs",
        "body": "Tell them to spread it on toast.",
        "created_utc": 1591741087,
        "id": "ftivc10",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1591769887.0
    },
    {
        "author": "BLACKdrew",
        "body": "So real talk for a second.\n\nThese past few weeks have been crazy. Seeing everyone make bank everyday while you're losing money would be a nightmare. If you're feeling like shit, bummed out, depressed, whatever, don't be afraid to reach out to someone. Mental health is no joke, especially when money that can change your life is involved. If you have someone to reach out to, do it, for your own sake.\n\nIf you need someone to speak with man to man I'm always down to talk and listen. I've dealt with mental health issues in the past so no judgement will be given.",
        "created_utc": 1591651464,
        "id": "ftesl46",
        "score": 131,
        "subreddit": "wallstreetbets",
        "created": 1591680264.0
    },
    {
        "author": "squidward_train",
        "body": "Investors always ask themselves, why was I a braindead retard for not following the Motley Fool's advice? Remember, we are the best investors on the planet. Anybody can do DD and risk calculations on investments using actual money, it takes geniuses to write enough articles on \"rare double down buy alerts\" to eventually get a few right. Motley Fool: pay us money to read what Yahoo Finance tells you for free.",
        "created_utc": 1591650896,
        "id": "ftergbs",
        "score": 130,
        "subreddit": "stocks",
        "created": 1591679696.0
    },
    {
        "author": "Power80770M",
        "body": "This is essentially it. I'm in my 30's and have a good job that I don't hate. What else am I going to do for the next couple of decades? $3M is indeed a ton of money, but in a couple of decades of not working, it's going to zero one way or the other.",
        "created_utc": 1591815409,
        "id": "ftm2x9s",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1591844209.0
    },
    {
        "author": "ThatOneRedditBro",
        "body": "I think this was the plan all along. Democrats wanted it in the stimulus and since they didn't get it, Trump can now legalize it giving him credit, winning potential black votes, or deny it and make republicans look really bad.\n\nThe art of the deal.",
        "created_utc": 1591469748,
        "id": "ft5xspb",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1591498548.0
    },
    {
        "author": "_MrPants_",
        "body": "This thing is going to be $5.10 in the morning. Book it.",
        "created_utc": 1591834330,
        "id": "ftn5dno",
        "score": 123,
        "subreddit": "pennystocks",
        "created": 1591863130.0
    },
    {
        "author": "VicarOfAstaldo",
        "body": "In broad description, the market as a whole crashed. And before quickly recovering by and large for a number of reasons, a lot of people clearly looked at major companies and industries and thought, “well clearly this will recover soon it can’t fail it’s too much of a part of our civilization” and that kind of cascaded all over. \n\nAnd to the point we’re at they weren’t wrong. It was a fairly obvious observation that most likely sure, companies like delta for example will most likely recover their stock value at some point. \n\nAnd so they dumped a big chunk of their money into that and saw massive profits. \n\nSeeing a 50% return on stocks consistently for two months time is not normal. \n\nAlmost always that is entirely the realm of luck and Id argue it’s the realm of luck borderline here. It’s normally essentially gambling. \n\nThe amount of posts I’ve seen commenting something like “it’s not much” with 150% returns is **insane**\n\nThat’s not how stats or money or whatever you want to call it work. \n\nSure if you are only investing $1000 that’s not a ton to many investors. But it doesn’t matter if you invested $3 it’s still a figure to be proud of. \n\nThe amount of people who suggest their essential doubling of their money “isn’t much” isn’t healthy. \n\nThat’s not normally how that works and the expectation  of anything near that over the next many years is going to breed the behavior of a gambler.",
        "created_utc": 1591669500,
        "id": "ftfp91h",
        "score": 122,
        "subreddit": "RobinHood",
        "created": 1591698300.0
    },
    {
        "author": "lubokkanev",
        "body": "I just wait for it to reach the top and then sell.",
        "created_utc": 1591807644,
        "id": "ftllzaf",
        "score": 120,
        "subreddit": "StockMarket",
        "created": 1591836444.0
    },
    {
        "author": "DerpDerp2020",
        "body": "Scholars maintain that it means a \"whale's vagina\"",
        "created_utc": 1591667230,
        "id": "ftfldd6",
        "score": 120,
        "subreddit": "wallstreetbets",
        "created": 1591696030.0
    },
    {
        "author": "Vince161",
        "body": "Yep, went all in on 15 885c 6/12, woke up to 26k in profit at open so I cashed out.  Then I put it back in on 21 945c 6/12 yesterday and woke up to this in the morning.  I still can’t believe it.",
        "created_utc": 1591846306,
        "id": "ftnqwh5",
        "score": 119,
        "subreddit": "RobinHood",
        "created": 1591875106.0
    },
    {
        "author": "BrunoRib",
        "body": "If the tits are already up, it can't go tits up",
        "created_utc": 1591808796,
        "id": "ftlogzl",
        "score": 119,
        "subreddit": "wallstreetbets",
        "created": 1591837596.0
    },
    {
        "author": "pretty_honest_guy",
        "body": "No shit. Like call it quits bubs and do something other than making money. \n\nBut, I’m sure he’ll go full Stephen Hawking and become a machine to live forever, but he won’t rely on Windows Me as an OS.",
        "created_utc": 1591643817,
        "id": "ftecxnz",
        "score": 118,
        "subreddit": "wallstreetbets",
        "created": 1591672617.0
    },
    {
        "author": "MigratingSwallow",
        "body": "Those were good times.  Buying Stellar and Ripple at .30 see them rip up above $1 , keep holding cause greed, then see it all tumble back down.  All happened in like a week, best high ever.",
        "created_utc": 1591718008,
        "id": "fthj7v9",
        "score": 118,
        "subreddit": "wallstreetbets",
        "created": 1591746808.0
    },
    {
        "author": "tlighta",
        "body": "The fact that you got 30 interviews indicates that it is pretty great.",
        "created_utc": 1591809712,
        "id": "ftlqhtq",
        "score": 116,
        "subreddit": "investing",
        "created": 1591838512.0
    },
    {
        "author": "MrStealYoBeef",
        "body": "Options are contracts.  They are not stocks, they are a contract stating that the holder has the right (the choice, or the *option*) to purchase/sell 100 shares of a specific stock at a specific price on a specific date.  Calls are for purchasing 100 shares on a later date, puts are for selling 100 shares on a later date.\n\nLet's say a stock, we'll call them AAAA for simplicity, is at $100 today.  If you were to buy 10 shares of this company, that would cost you $1000.  You would own 10 shares of that company for $1000 though.  If you instead buy options, you would likely be able to get a couple options instead for the same price.  Let's say that a $100 call on AAAA for next friday costs $5 per share, or $500 per contract.  For that same $1000, you could have 2 calls on AAAA.\n\nIn both scenarios, you're looking for the value of the stock to go up obviously.  If you have 10 shares and AAAA goes up one dollar, you gained 10 dollars.  If you have 2 calls (which is 200 shares worth of an option) and AAAA goes up by a dollar, those calls increase in value as well, although not quite as much, we'll say it increases by $0.50 per share.  That's still a lot.  Instead of making $10 from your $1000 investment, you made $100 instead.  It's not quite that simple though.\n\nCalls (and puts) have an expiration date.  If the call is expiring on the 12th (next Friday), then the value of the stock needs to be decently close or above the value stated in the contract, or the \"strike price\".  In our $100 AAAA calls, if the stock goes below $100 (especially on the Thursday), the value of the call will plummet.  And remember, since these are just contracts, you don't actually own anything with the money you spent.\n\nSince you also spent $5 per share in order to get the call, the value of AAAA needs to not only be above $100 on the 12th to be redeemed (nobody should ever execute a right to buy at a higher than market price, obviously, you'd just be throwing away money for no reason) but it needs to be above $105 in order to make a profit.  You had already paid $5 per share for the right to buy those shares later at $100 per share.\n\nNext, and here's what many people do in order to make their profit instead, *you do not have to hold your contracts.*  If you buy a call on Monday, you don't have to wait until it expires on Friday to make money.  If AAAA jumps to $120 on Tuesday, you could sell your 2 calls for likely $23-$24 per share.  That would turn a $1000 investment into $4600.  What a hell of a gain, right?  If you just had 10 shares, you'd have only made $200 on a 20% stock jump when people who are options trading just made a $3600 or a 460% return.\n\nLastly, the reason that so many people avoid them.  *Options can expire* ***worthless***.  If the stock drops to $95 on Tuesday, those calls are suddenly only $2 per share, you just lost $600.  If it drops again to $90 on Wednesday, those calls are suddenly less than $1 per share, you're at an $800+ loss.  If you had 10 shares, you'd have only lost $100.  On Friday if you still have those calls, if AAAA never hits $100, your calls will expire and you'll have lost the full $1000 investment with absolutely nothing to show for it.  That money is gone for good, no amount of wishful thinking is going to make it come back to you.\n\nPuts are the opposite of calls in a way, they're the right to sell 100 shares at a certain price.  You get a put when you believe the value of the stock is going to drop.  Let's say you have a $100 put on AAAA and the stock drops to $80 on Friday.  On Friday, you would purchase 100 shares of AAAA at market value ($80, or $8000 worth) and then immediately sell it to whoever wrote the contract for $100 per share, or $10000.  That's quite a profit right there too, you made money when a stock decreased in value.  You can't really do that with standard stock trading.  Puts do still come with the same risk as calls in the fact that they too can expire worthless if the value of the stock is above the strike price.  If you have a $100 put on AAAA and the value on Friday is $105, it would be absolutely stupid to purchase 100 shares at $105 to sell them immediately for $100.  Remember, these contracts give you the *option* to buy/sell at a certain price, it doesn't mean that you have to when they expire.\n\nI hope that helps!  If you've got more questions, I'd be happy to answer them to the best of my ability.",
        "created_utc": 1591493663,
        "id": "ft8558n",
        "score": 116,
        "subreddit": "RobinHood",
        "created": 1591522463.0
    },
    {
        "author": "Breezy_t",
        "body": "I totally didn't expect the last part, especially \"oh no the airplane house is empty but soon it will be full\" A+",
        "created_utc": 1591615881,
        "id": "ftcywoq",
        "score": 116,
        "subreddit": "wallstreetbets",
        "created": 1591644681.0
    },
    {
        "author": "werubim",
        "body": "I missed out on the march dip and I'm super depressed about it!! Gahhhhh",
        "created_utc": 1591648206,
        "id": "ftely21",
        "score": 115,
        "subreddit": "investing",
        "created": 1591677006.0
    },
    {
        "author": "oarabbus",
        "body": "&gt;Stocks are being manipulated beyond belief. \n\nThe counter argument is basically \"it's not manipulation when the Fed does it\".  A change in monetary policy isn't necessarily manipulation, it could be a new normal.",
        "created_utc": 1591657531,
        "id": "ftf47jh",
        "score": 115,
        "subreddit": "stocks",
        "created": 1591686331.0
    },
    {
        "author": "slipstream808",
        "body": "It is SOOO true.  Sudden influx of money  and the world is a better place.",
        "created_utc": 1591649114,
        "id": "ftent4m",
        "score": 114,
        "subreddit": "wallstreetbets",
        "created": 1591677914.0
    },
    {
        "author": "TakeMeArachne",
        "body": "Now show us what they looked like at open when it turned green\n\nEdit: wait lmao I'm retarded I saw all FAGMAN green and I assumted",
        "created_utc": 1591719486,
        "id": "fthmal3",
        "score": 114,
        "subreddit": "wallstreetbets",
        "created": 1591748286.0
    },
    {
        "author": "MedusaOblongGato",
        "body": "Everyone always replies \"first one's free\" and I'm over here like \"if you're doing it right they're all free\"",
        "created_utc": 1591635929,
        "id": "ftdwyhw",
        "score": 112,
        "subreddit": "wallstreetbets",
        "created": 1591664729.0
    },
    {
        "author": "pendragon31415",
        "body": "It was alleged that it was a fake bill, also that doesn't mean he was the one to make it or knew that it was fake.\n\nEdit: or that it was even fake",
        "created_utc": 1591128174,
        "id": "fso5dsb",
        "score": 108,
        "subreddit": "wallstreetbets",
        "created": 1591156974.0
    },
    {
        "author": "ThrowaWayneGretzky99",
        "body": "It produces Ted talks.",
        "created_utc": 1591689711,
        "id": "ftgfx5n",
        "score": 108,
        "subreddit": "wallstreetbets",
        "created": 1591718511.0
    },
    {
        "author": "centrist-5",
        "body": "You sound retarded. Welcome. Cash out or let it run. I couldnt give less of a shit",
        "created_utc": 1591825068,
        "id": "ftmnbwj",
        "score": 106,
        "subreddit": "wallstreetbets",
        "created": 1591853868.0
    },
    {
        "author": "Dvdpjr",
        "body": "Your comment killed me. Lost all your money and made it all back over the course of a week?? You absolutely belong here. Welcome to the Big League.",
        "created_utc": 1591655374,
        "id": "ftf06s6",
        "score": 105,
        "subreddit": "wallstreetbets",
        "created": 1591684174.0
    },
    {
        "author": "x2Arawnage",
        "body": "You will have the rights to the shares of the company that acquired your company. Did some of these before, structure is a bit different but it could be worth a lot.",
        "created_utc": 1591645170,
        "id": "ftefozl",
        "score": 105,
        "subreddit": "stocks",
        "created": 1591673970.0
    },
    {
        "author": "psytokine_storm",
        "body": "Dave Portnoy (of Barstool fame) has about $500k in options, which he learned about earlier this week. Direct quote from today's stream from his twitter:\n\n\"**I don't know what a call is**, but I bought it and I'm up $500k. I want to buy $2 million more of these calls\".\n\nThe top is in.",
        "created_utc": 1591301637,
        "id": "fswba2c",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1591330437.0
    },
    {
        "author": "LeoFireGod",
        "body": "No one ever accounted for the average person making under 50K to be making literally more money than they had before, with no sports to bet on, and no bars to go to. This is just pure full blown idiocy but its what we have learned to love.\n\n$0 trades didn't fully cause this, corona and such caused it along with the $0 trading",
        "created_utc": 1591805900,
        "id": "ftlj00z",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1591834700.0
    },
    {
        "author": "Cobbenik",
        "body": "I remember my first one. I made $4.8k. It was like taking candy from a baby. I thought everyone here was retarded for not getting free money. Couple days later I was bent over, pants down, with line of bulls waiting to get their turn.",
        "created_utc": 1591644585,
        "id": "fteehx1",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1591673385.0
    },
    {
        "author": "AtticusFigt",
        "body": "Ok if you want a tip the worst thing that can happen to a beginner is wild success. Be very careful about making assumptions about the market. It isn’t irrational right now. Good for you on your profits. I wish you luck but urge you caution.",
        "created_utc": 1591495516,
        "id": "ft889nt",
        "score": 104,
        "subreddit": "options",
        "created": 1591524316.0
    },
    {
        "author": "dino_74",
        "body": "I just broke up with my girlfriend (stocks/401K) at the end of March. We went through  a rough patch and it didn't seem like it was working out so I left. I've been following her on social media (/r/investing) since and it seems like she's rebounded and moved on. Here I am looking at our old pictures (portfolio) and wondering why I didn't stick it out. (´༎ຶ ͜ʖ ༎ຶ \\`)♡",
        "created_utc": 1591233886,
        "id": "fst9dfi",
        "score": 103,
        "subreddit": "investing",
        "created": 1591262686.0
    },
    {
        "author": "Fr33Flow",
        "body": "I remember when I was a kid, I found a cat stuck in a tree.  He kept meowing and meowing for someone to save him. I climbed the tree and it took 30 minutes to get him down. Instantly me at that cat had a bond. I must have knocked on 30 different doors trying to find his home. But without a collar,  finding his owners was impossible. After asking all over the neighborhood I brought the cat back home where I knew my father would be waiting, wondering where I was. So I walked inside holding the cat, my dad was sitting on the couch and we locked eyes. You’ll never believe what he said. He said: “Son, what the fuck are shares???”",
        "created_utc": 1591726581,
        "id": "fti1aq0",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1591755381.0
    },
    {
        "author": "inlighttrading",
        "body": "Well put! It's always refreshing to hear from the perspectives of learning traders who have *actually learned* something.\n\nFOMO is one of the most dangerous Fears of Trading. This can be FOMO in anticipation or FOMO in reflection. In both cases, you feel a negative emotional reaction to missing or potentially missing a big move.\n\nAs you know, negative emotions are very bad as a trader and can limit your Trading Vision - preventing you from seeing a much clearer move that fits within your own defined strategy and risk tolerance.\n\nThere is no such thing as \"missing out\" in the stock market. There are infinite opportunities presented to you every single second. So focus on that. Focus on the stream of infinite opportunities and how you can interpret and decipher this data stream to pluck out trades within your own strategy boundaries.\n\nStick to your rules, manage your emotions, and focus on what is right in front of you.\n\n**I'd love to hear some thoughts from other traders who very recently learned this lesson. What made you learn it? Was it a big trade that went wrong or a big trade you missed? I'd like to hear your story and your interpretation of the lesson you learned :)**",
        "created_utc": 1591713600,
        "id": "fthagc5",
        "score": 102,
        "subreddit": "stocks",
        "created": 1591742400.0
    },
    {
        "author": "JungAndReckless6",
        "body": "I think it’s purely the influx of new investors the last few months trying to find the next Amazon. After all, Tesla has only been profitable for 3 quarters, it at some point could be worth what Amazon is. I wouldn’t touch it at this price personally, but to each their own.",
        "created_utc": 1591799135,
        "id": "ftl6tn0",
        "score": 100,
        "subreddit": "investing",
        "created": 1591827935.0
    },
    {
        "author": "PaperShark0001",
        "body": "No, ur up 300%. Imagine if u held and it dropped. Congratulations",
        "created_utc": 1591819377,
        "id": "ftmbbve",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1591848177.0
    },
    {
        "author": "Hybridkg87",
        "body": "From what CNBC told me yesterday, as a Robinhood trader I am smarter then a Billionaire. This only furthers it.",
        "created_utc": 1591802992,
        "id": "ftldi13",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1591831792.0
    },
    {
        "author": "r4rthrowawaysoon",
        "body": "Why crop?  This gives it more gravitas.",
        "created_utc": 1591728219,
        "id": "fti4qga",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1591757019.0
    },
    {
        "author": "ez2remembercpl",
        "body": "This isn't about options it's about life.\n\nIn my 20s  I worked a lot of fun jobs with no pay, mostly in the bar industry. By my early 30s I needed to get out and actually have a positive net worth, and sunk my life into one more bar (so fucking cliche', like a heist movie). It bombed.\n\n***At 35 I was in debt, had no job, and was living in the spare bedroom of a friend in a room with no furniture besides a mattress.*** I also went online for dating (read: sex) and met a fabulous woman who turned my life around. We've been together for 15 years, I got an MBA and started making real money, and now I have actual investments, I'm semi-retired, and I have a great wife.\n\nYou can \\*ALWAYS\\* start over and succeed. My dad's girlfriend (yes, a 90 year old MF is a player) had stage 4 cancer in 2014 and a 6 months prognosis. She's the one who drives his half-blind ass around town because she's in pretty good shape to this day.\n\nThere is always hope until the last day.",
        "created_utc": 1591829623,
        "id": "ftmwftd",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1591858423.0
    },
    {
        "author": "justafreesheep",
        "body": "Everything works until it doesn't, and everyone is right until they're wrong. Anyone who is sure of the direction the market will take over the next few months is retarded. This market has shown zero logic or rationale, it has made no sense, and will continue to evade anyone's crystal ball. Admit you know nothing more than anyone else, not even J pow does. If you're right, it's luck, just the same as if you're wrong.",
        "created_utc": 1591843681,
        "id": "ftnmf0t",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1591872481.0
    },
    {
        "author": "B1GBoiBets",
        "body": "The debate is not whether we’re in a bubble, it’s when is it going to burst",
        "created_utc": 1591650826,
        "id": "fterb80",
        "score": 98,
        "subreddit": "investing",
        "created": 1591679626.0
    },
    {
        "author": "Sovereign_Mind",
        "body": "Youre fucking retarded buddy. I work for this company and its been a sinking ship since 2016. It is not going to jump 300% their sales are at an all time low and there were THOUSANDS AND THOUSANDS of cancellations due to covid.\n\nKeep dreaming.\n\nJoseph abboud was the only brand they owned that was actually worth a fuck. The other brands they own are complete garbage. You literally have given zero reason as to why the stock will rise 300% besides that they are declaring bankruptcy which I will not speak on.\n\nDo not get your hopes up. This will not happen.",
        "created_utc": 1591676227,
        "id": "ftfzuh4",
        "score": 98,
        "subreddit": "pennystocks",
        "created": 1591705027.0
    },
    {
        "author": "Agitated-Bike",
        "body": "lol its an obvious play given the logic this market follows. JUst someone has to have the balls, capital and risk tolerance to play it; he did. we didn't.",
        "created_utc": 1591313081,
        "id": "fswynki",
        "score": 96,
        "subreddit": "wallstreetbets",
        "created": 1591341881.0
    },
    {
        "author": "BlazinBoy",
        "body": "The view count was a nice touch, too bad you didn’t align it tardo",
        "created_utc": 1591760087,
        "id": "ftjspha",
        "score": 96,
        "subreddit": "wallstreetbets",
        "created": 1591788887.0
    },
    {
        "author": "Ban2Delete2",
        "body": "good info, but I think you've only really scratched the surface regarding investor risk and complexity.  Talk to me about how management is compensated; feels like private equity somehow got the keys to daddy's mid-life crisis IPO sports car.",
        "created_utc": 1591543016,
        "id": "ft9w0kv",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591571816.0
    },
    {
        "author": "fireguy123123",
        "body": "That weeaboo background for your soft keys tho...",
        "created_utc": 1591043654,
        "id": "fsk9z6f",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591072454.0
    },
    {
        "author": "Vinny32295",
        "body": "My magic crayons tell me we’re due for a pullback. We’ve hit keys fettuccini resistance lines. These colorful lines will beat the fed and their $7 trillion dollars /s",
        "created_utc": 1591536158,
        "id": "ft9l4mx",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591564958.0
    },
    {
        "author": "831sweatyfeet",
        "body": "Instead of Phone, Wallet, Keys. Now we have to remember a face mask. Strange times my friends.",
        "created_utc": 1591667037,
        "id": "ftfl1d0",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591695837.0
    },
    {
        "author": "dwdsquared2",
        "body": "That's literally what people in casinos or scratching lottery tickets say in their heads. \n\nJust think, if that was the key, why isn't everyone rich and doesn't need to borrow again?   Did you suddenly find the keys to success? \n\nNo, lil bro. You need to trade with patience and will-power and you'll be much more likely to succeed.",
        "created_utc": 1591311220,
        "id": "fswv4f7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591340020.0
    },
    {
        "author": "Wayfaring_Limey",
        "body": "Only time I ever used budget, I get to the parking lot with the keys to the car and find it has a flat. I go back to the counter and they try and tell me it's my fault the car has a flat and I'll need to pay for a replacement. Threw the keys back at them, and went to Hertz instead. When they tried processing my card, I just told the bank it was a fraudulent transaction.",
        "created_utc": 1591201531,
        "id": "fsrewhe",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591230331.0
    },
    {
        "author": "mdist612",
        "body": "Ironically, yes. You are not alone. I remember when I was setting up hot keys on my trader platform, I made my buy hot keys as 10, 100, and 1000. Turns out I made them 10, 1000, 1000. I never understood why my 100 buy hot keys kept acting up until I looked at the settings.",
        "created_utc": 1591745540,
        "id": "ftj3po3",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1591774340.0
    },
    {
        "author": "SaacTown",
        "body": "You mean his phone or keys?",
        "created_utc": 1591157922,
        "id": "fspocyy",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1591186722.0
    },
    {
        "author": "Jsizzle19",
        "body": "appreciate the clarification. the key really comes down to whether you want to be investing or gambling. You can get lucky, go on a nice streak and see your stocks rise a lot in a short period of time, but you’re playing with a house of cards.  you want your money to work for you. You may only have $1,300 now, but if you invest in a few, strong companies (profitable, strong balance sheets with positive free cash flow) or in an ETF / index fund where the stock prices will continue to increase over time, then each month or paycheck, set up a recurring deposit. Just like a 401k, you don’t want to touch the money. Just put it in there and try to forget about it (please note, there is nothing wrong with looking to\nRebalance your portfolio every so often) \n\nThere are really 2 keys to investing: 1) always keep investing and 2) having the strength to stay in the game when the market drops 5-10%. \n\nYou want to be in the game as long as possible. \nFor example: if you invest $1,300 today with a $100 recurring monthly deposit and attain a 9% return (average annual return of the S&amp;P 500), in 10 years you’ll have $22,050, in 20 years you’ll have $71,170, but in 30 years you’ll have $187,460. \n\nYou want your investment earnings to keep compounding over time. The stock market should not be viewed as a get rich quick scheme",
        "created_utc": 1591612868,
        "id": "ftcvoo8",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1591641668.0
    },
    {
        "author": "rnansloth",
        "body": "What are keys things that can tell you that there is a serious potential downside? From someone who knows nothing about spotting either upsides or downsides.",
        "created_utc": 1591564893,
        "id": "ftb0cu0",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1591593693.0
    },
    {
        "author": "hugofuegoeggo",
        "body": "Buy high sell low. Always buy the FOMO and chase. And of course always be greedy. Those are the keys to success",
        "created_utc": 1591682724,
        "id": "ftg89r6",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1591711524.0
    },
    {
        "author": "BLACKdrew",
        "body": "that shit better be fucking HYPOALLERGENIC\n\nMOM GET THE KEYS WE RIDING",
        "created_utc": 1591071614,
        "id": "fslot8x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591100414.0
    },
    {
        "author": "BrononymousEngineer",
        "body": "You can do that too, and the data will be better, but it will be more work to actually get data from the brokerage APIs.  From what I've read the steps to connect to TDA are notoriously confusing, and I think for IBKR you have to have TWS running.  If I was actually going to pull data to trade on I'd get it from a brokerage.\nYahoo works for this purpose because it's educational and you don't need API keys -- it's available for everyone.",
        "created_utc": 1591165379,
        "id": "fspyl6k",
        "score": 2,
        "subreddit": "options",
        "created": 1591194179.0
    },
    {
        "author": "minos157",
        "body": "Yep, I just wish everyone would stop shitting on other peoples styles.  We're all here to make money.  If anyone ever caught me posting for a new person to just go balls deep on one pattern I'd quit investing because it won't happen.  Every time I join these posts to defend TA it is with the notion that discipline and emotion free trading are the keys to success, not TA, not FA, not style, not length of holdings.  Find a strategy that works for you, and stick to the plan.  Don't let others tell you you're doing it the wrong way.",
        "created_utc": 1591569328,
        "id": "ftb8ggg",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591598128.0
    },
    {
        "author": "killuasbestfriend",
        "body": "Cool, asking because I have stocks like Apple, FB, Keysight, AMD, Roku, Chegg etc and I've made decent profits from them so far. However I'm curious as to whether I should sell a fraction of these shares e.g. 10%, when they are doing exceptionally well or just hold and keep adding?",
        "created_utc": 1591468154,
        "id": "ft5s2ly",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591496954.0
    },
    {
        "author": "GardenofGandaIf",
        "body": "You know you can back up your keys...right?",
        "created_utc": 1591301622,
        "id": "fswb90i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591330422.0
    },
    {
        "author": "prithishchanda",
        "body": "Thanks everyone \n\nI placed my limit orders on Nokia / Ericsson / Keys / Micron on 5 G \n\nGaming - Zynga ..\n\nPayment terminal contactless:- Square",
        "created_utc": 1591214776,
        "id": "fss7n7s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591243576.0
    },
    {
        "author": "LiveInLayers",
        "body": "Remember not your keys not your crypto",
        "created_utc": 1591065953,
        "id": "fslflkt",
        "score": 1,
        "subreddit": "investing",
        "created": 1591094753.0
    },
    {
        "author": "yawn_this_gets_old",
        "body": "Keys to the bunker.",
        "created_utc": 1591038476,
        "id": "fsjzbcl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591067276.0
    },
    {
        "author": "dfreinc",
        "body": "Day trading as an individual is just a form of long duration gambling (compared to fights or team games) as far as I'm concerned. \n\nMind you, I like gambling. It's fun and I have spare money. Those are the keys though; *fun* and *spare* money.",
        "created_utc": 1591314675,
        "id": "fsx1md3",
        "score": 1,
        "subreddit": "investing",
        "created": 1591343475.0
    },
    {
        "author": "Forty_Six_n_2",
        "body": "Thorlabs is the Amazon of optics and photonics equipment but they're not publicly traded as far as I'm aware.\n\nFor lasers check out IPG and Coherent\n\nFor optics check out Gooch and Housego, Heraeus Quartz (optical glasses)\n\nFor detectors and cameras/beam profilers check out MKS instruments\n\nPlenty of oscilloscope/ lab electronics companies too, agilent, keysight etc\n\nThese are just a few companies I know off the dome.\n\nWould be interested to hear what your play is here!",
        "created_utc": 1591124752,
        "id": "fsny0vw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591153552.0
    },
    {
        "author": "NewFlipPhoneWhoDis",
        "body": "3-4 days out keys l let's revisit this conversation please \n\nLike that Monday",
        "created_utc": 1591172477,
        "id": "fsq6wxz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591201277.0
    },
    {
        "author": "luponicdistortion",
        "body": "The guy who did this and lost his private keys might be the saddest soul on earth",
        "created_utc": 1591103471,
        "id": "fsmrapk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591132271.0
    },
    {
        "author": "Surfincloud9",
        "body": "I get them for free from pharm school. Usually medical device and auto injector sectors. They change quite rapidly given the current geopolitical situations and pandemic. Not worth it atm. Won’t get them for free, locked by keys",
        "created_utc": 1591069822,
        "id": "fslm0ue",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591098622.0
    },
    {
        "author": "them_FIERCE",
        "body": "Now let’s set aside the notion that stocks are allegedly suppose to trade at or anywhere near their valuations. \n\nDraftKings was able to make watching Soccer interesting to me. That is pure fucking wizardry. They hold the keys to a sports “betting” landscape that is practically untapped *globally*. Unlike casinos they have no risk exposure to outcome. They aren’t even classified as gambling in most countries because they make a legitimate argument that they are a game of skill not chance. So, no, tons of casinos are not just going to “make an app” and fart out profits. DraftKings has cornered the fantasy sports market, and if you haven’t looked at the financial trajectory of fantasy sports over the last 10 years...you done son. Pull back is def coming, so I hope your puts are reasonably placed because expecting the bottom to fall out just isn’t going to print.",
        "created_utc": 1591028150,
        "id": "fsje0td",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591056950.0
    },
    {
        "author": "PotatoKingIV",
        "body": "I laughed when I read \"Markets Rally as U.S. protests ease\" this morning. Protests have only helped the markets, distracting the public from corona, like dangling keys in front of a child. Protests easing should causing a downturn if anything.",
        "created_utc": 1591183297,
        "id": "fsqilm6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591212097.0
    },
    {
        "author": "isellgeputs",
        "body": "im just gonna buy a foreclosure here in sc now. i wanna move to the keys eventually.\n\nid go with tampa because of fewer tourists. orlando is cool because it is the stunt riding capitol of the world. more wheelies per capita than anywhere else lol",
        "created_utc": 1591671277,
        "id": "ftfs8jp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591700077.0
    },
    {
        "author": "262Chief",
        "body": "Gonna go out on a limb here and suggest that handing over the keys of the U.S. cannabis market to Canadian shell companies listed on the penny exchange, run by a bunch of wealthy, former bankers, politicians, businessmen, venture/vulture funds etc. may not be the way they go, structurally speaking.",
        "created_utc": 1591724178,
        "id": "fthw9a1",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591752978.0
    },
    {
        "author": "Jaydon1",
        "body": "So I lost my license/wallet again... this shit is sooo gay. I was in the Wendy’s line looking stupid asf looking for it(I asked if they did Apple Pay but they don’t). It’s also pretty gay that Illinois only allows 10 replacement drivers licenses in a lifetime. I just turned 20 last week, and my new one will be number 4...\n\n1. Stolen by family member(idek why but someone took my debit card, license, house keys, and PlayStation mono mic to get back at me for something ig 🤷🏾‍♂️. Nobody admitted to it, but  one day my keys appeared at my room door and that’s it)\n\n2.dropped it at work and I forgot to go back to look for it.🤦🏾‍♂️ I heard a thud, but I was holding a box. I didn’t realize my Wallet was missing until I got home. Never to be seen again\n\n3.???.... One day I lost one cc, a few days later another, now my whole wallet is gone.",
        "created_utc": 1591356346,
        "id": "fsynmco",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591385146.0
    },
    {
        "author": "mulletator",
        "body": "You mean this article?\nhttps://www.theatlantic.com/ideas/archive/2020/06/3-keys-understanding-strangest-economy-ever/612373/\n\nThat was a pretty good read.  No answers really but interesting.  I didn't realize that average income has gone up due to government stimulus and increase in unemployment benefits.\n\nThat doesn't bode well in my opinion.  That means that it will be harder to get low-income workers back to work.\n\nThat article seems to highlight that the entire economy is on life support from the FED.  Which is kind of my point.  How long can we keep this up?",
        "created_utc": 1591284032,
        "id": "fsv9bwi",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1591312832.0
    },
    {
        "author": "Hotspur000",
        "body": "Just my opinion, but some of the keys to being a day trader are:\n\n1) Don't try to do too much. Focus on maybe 2 or 3 stocks that you think could move well in the day and go after them. If you're trying to do like 10 or 15 or something, you're splitting up your attention too much. This then directly leads to;\n\n2) Don't be too greedy. If you earn some gains, take them. Prioritize ending the day up from where you started, even if it's by a smaller amount than you maybe would hope. I think a lot of day traders end up losing because they stay on a position too long, hoping for more, and then the floor falls out from under them.\n\nAnd (again this is just personal opinion), don't play options. Options, to me, are just pure gambling and really stupid, because even if you take a chance on a stock and it doesn't pan out that day, well, at least, you own it, it's still an investment – six months later it might go up again and you can sell it them.",
        "created_utc": 1591347090,
        "id": "fsydosn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591375890.0
    },
    {
        "author": "Lex_et_ordo",
        "body": "He is kind of right though. Zoom has 700+ engineers in China doing product development. They were caught routing security keys through data centers there. Quite a few governments are not allowing their employees to use it. Considering the amount of mass surveillance conducted by the chinese government and the pressure they put on companies to build backdoors and so forth, I think security will be an issue for Zoom for the foreseeable future.",
        "created_utc": 1591143209,
        "id": "fsoz7qt",
        "score": 0,
        "subreddit": "investing",
        "created": 1591172009.0
    },
    {
        "author": "Relaxed_Engineer",
        "body": "Still a chance of 2nd COVID. Race riots with no closure coming from the White House. Election season is going to be insane, and I'm sure Trump will calmly hand over the keys if he loses the election /s\n\nCash* gang until November at earliest. You all enjoy your shitastic rollercoaster ride, good luck.\n\n*Well, holding a shitload of USL, because I get the oil market.",
        "created_utc": 1591313585,
        "id": "fswzlfv",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1591342385.0
    },
    {
        "author": "eyerollingsex",
        "body": "Me when these TSLA calls print and I buy a Tesla:\n\n_Brand new whip got no keys \nTailor my clothes, no starch please \nSoon as I nut, you can gon' leave \nGot M's in the bank, like: \"Yes, indeed\"_",
        "created_utc": 1591568735,
        "id": "ftb7e14",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1591597535.0
    },
    {
        "author": "HitomiSato",
        "body": "Your mom clearly doesn't have the mental capacity to handle money. Take away her keys and cards.",
        "created_utc": 1591733135,
        "id": "ftif4r5",
        "score": -2,
        "subreddit": "stocks",
        "created": 1591761935.0
    }
]