[
    {
        "author": "coolgoulfool",
        "body": "I bought Intel puts last night 5 minutes to close on whim from a random comment here. Not a good strat at ALL but I knew about Intel's current issues and have been long on AMD for a bit. Woke up to see the my puts over 100%. Love it",
        "created_utc": 1595631898,
        "id": "fz54pts",
        "score": 1050,
        "subreddit": "wallstreetbets",
        "created": 1595660698.0
    },
    {
        "author": "WrongPurpose",
        "body": "Did you just made 1.2 million because Intel shit the bed? Congrats, now cash out and retire before you loose it all.",
        "created_utc": 1595601172,
        "id": "fz3dy1g",
        "score": 709,
        "subreddit": "wallstreetbets",
        "created": 1595629972.0
    },
    {
        "author": "ASaneDude",
        "body": "Thank Intel for its incompetence.",
        "created_utc": 1595601358,
        "id": "fz3eavd",
        "score": 564,
        "subreddit": "wallstreetbets",
        "created": 1595630158.0
    },
    {
        "author": "AveenoFresh",
        "body": "I went through your post/comment history. At no point did you ever tell anyone that NVAX would be a good buy, or post any DD on it. \n\nY'all just come in, lurk, make great plays, and only post when it profits? Nah, man. Be a bro and share intel.",
        "created_utc": 1594571743,
        "id": "fxubdo1",
        "score": 530,
        "subreddit": "wallstreetbets",
        "created": 1594600543.0
    },
    {
        "author": "comparmentaliser",
        "body": "Intel’s lead architect left a few weeks ago - supposedly to join AMD (which is where he was prior to Intel anyway).\n\nThere was a good post on wsb a few weeks back about it - obviously there’s a lot of speculation, but it’s plausible.\n\nAlso, AMD have been gaining on Intel in terms of performance, power and heat. That said, Intel is still a household name, and they have a very aggressive marketing and licensing strategy. For example, Lenovo’s flagship X line of laptops are Intel-only, but they’re supposedly just waiting for that agreement to expire before moving on to AMD (I’d kill for an ARM X1 though :)",
        "created_utc": 1595756422,
        "id": "fzadkrp",
        "score": 495,
        "subreddit": "investing",
        "created": 1595785222.0
    },
    {
        "author": "martinvandepas",
        "body": "For 8 years, I worked at Intel as an electrical engineer designing circuits for the future manufacturing processes that Intel would be releasing 2-4 years into the future. There are literally thousands of MS and PhD engineers working on the myriad of challenges involved in making better computer chips. All the way from the design of the manufacturing tools, the amount of NAND gates in a library, the modeling and forecasting of dozens of transistor parameters, writing and supporting the simulation tools, to what I was doing designing and testing: analog circuits in a not yet stable manufacturing process. And hundreds of other challenges that each had teams from a few to a few dozen engineers trying to solve them. It's an insanely complex task. Most engineers working on any of these tasks are so specialized that they don't have any idea how to do the job of the engineers sitting a few aisles over. These engineers are 5-9 management layers below the CEO. Other companies operate the same way, it's just how chip design is done. \n\nIntel's main advantage over the last few decades was that it continuously had the most advanced manufacturing process, maintaining a 1-2 year lead over its closest competitors. However over the last ten years, TSMC has caught up and now overtaken Intel. This is mostly due to Intel's engineering struggles with it's last few manufacturing processes. These things spend half a decade in planning and development. Decisions were made years ago that they are now stuck with. \n\nYour points are all about top level management and I'm sure there's some truth to how important the CEO's decisions are, but I think Intel's current problems are primarily engineering problems with the manufacturing process. I sincerely doubt it's for lack of investment by CEOs. I think it's more likely that TSMC had better engineering talent and was able to do things more creatively that ended up wildly successful.  And surely some luck there too.\n\nAMD has been doing well with their architectures recently and they should get credit for that, but their architectures were always quite good, the thing holding them back was their process and what had been a disadvantage, with TSMC, is now a huge advantage. They are poised to take market share, but they mostly have TSMC to thank for that.",
        "created_utc": 1595777052,
        "id": "fzb3mtw",
        "score": 263,
        "subreddit": "investing",
        "created": 1595805852.0
    },
    {
        "author": "DARPA1191969v1",
        "body": "Intel is still viable but be aware that they (and this has been reported before) are essentially milking a product line from like 2015 (ish) at this point in terms of architecture and node size. Honestly they have no one to blame but themselves, but in case there are any actual longterm investors here - be aware that this problem has been boiling for years and the fallout is likely to be huge unless AMD fumbles at the 2-yard line or intel throws about 3 Hail Mary's.",
        "created_utc": 1595550279,
        "id": "fz1fa3o",
        "score": 165,
        "subreddit": "investing",
        "created": 1595579079.0
    },
    {
        "author": "VRT_Corrado",
        "body": "Intel took a shit. Nvidia is the most valuable chip manufacturer in the world. AMD walked past Intel after years as the underdog. What a fuckin time to be alive!",
        "created_utc": 1595609447,
        "id": "fz3uwi4",
        "score": 153,
        "subreddit": "wallstreetbets",
        "created": 1595638247.0
    },
    {
        "author": "spid3rfly",
        "body": "In some good news... It looks like AMD is leaving that resistance line behind.\n\nWhich is cool but it's probably just because of the Intel chip delay news.",
        "created_utc": 1595597915,
        "id": "fz37z1y",
        "score": 148,
        "subreddit": "stocks",
        "created": 1595626715.0
    },
    {
        "author": "Minnesnota",
        "body": "Intel shit the bed on earnings and delayed 7nm. AMD about to cum all over that ass with Zen 3 in a month or two.",
        "created_utc": 1595538416,
        "id": "fz0sala",
        "score": 130,
        "subreddit": "wallstreetbets",
        "created": 1595567216.0
    },
    {
        "author": "LovableContrarian",
        "body": "Bruh, it's based on future expectations.\n\nAMD is grabbing market share like a hungry slut (not just in consumer PCs but also in consoles, enterprise, servers, etc), and INTC just continues to fuck up everything. It's honestly sort of amazing how many mistakes Intel has made in the past year or so, and they are legitimately at risk of becoming completely uncompetitive.\n\nThey basically lost 100% of the enthusiast/custom PC market overnight, and most of their revenue now comes from contracts with Dell, Lenovo, Apple, etc for desktop and notebook CPUs (and a few other random components, like wifi and Bluetooth cards). And, these companies will almost definitely be looking to AMD, as Intel's 7nm chips aren't expected to be available until *at least* 2022, and AMD is already mass-producing. Depending on how hard these companies ditch Intel, it could be an actual death blow. \n\nAnd that doesn't even bring up the issue that things are shifting more and more to mobile platforms, where Intel completely failed. Companies like Apple, Samsung, and Qualcomm absolutely dominate in the mobile SoC sector and managed to castrate a titan when Intel attempted to enter that market and failed miserably. \n\nIt's bad news all around. \n\nDoes that mean they can't come back? No. Of course they can. But the concerns are real.\n\nWhat other major stocks have you seen recently crash 13% on earnings then just... Stay there? Flat? We are in the most legendary dip-buying market of all time, where almost any dip will be bought without any logic, and yet no one would touch INTC, which is one of the biggest tech companies in the world.\n\nIt's a bit concerning.\n\nYour DD is basically \"bruh, it's Intel. And they made a lot of money in 2019.\" But that's frankly just not very good DD my friend.",
        "created_utc": 1595631956,
        "id": "fz54toq",
        "score": 127,
        "subreddit": "wallstreetbets",
        "created": 1595660756.0
    },
    {
        "author": "riceturm",
        "body": "Intel is also losing to arm, nvidia, qualcom and apple.",
        "created_utc": 1595755753,
        "id": "fzacxuk",
        "score": 120,
        "subreddit": "investing",
        "created": 1595784553.0
    },
    {
        "author": "OKOKOK405",
        "body": "If the market is green Monday, intel will pop 5-10% \n\nAnd no I'm not just saying this because I have 40k in calls expiring Friday..",
        "created_utc": 1595721585,
        "id": "fz93oxa",
        "score": 118,
        "subreddit": "wallstreetbets",
        "created": 1595750385.0
    },
    {
        "author": "beyphy",
        "body": "That's Jim Keller. He never stays in a place for too long. He usually joins a company for a few years, makes his impact, and he moves on. And he may have done that at Intel. What was surprising was the nature of how he left which was a [very abrupt resignation for \"personal reasons\"](https://www.anandtech.com/show/15846/jim-keller-resigns-from-intel-effective-immediately). \n\nSpeculation, but I think Intel's main problems are management related. Their management either laid off too many important, expensive engineers in an effort to save money. Or they were far too aggressive which led to the massive failure they had today. Or a combination of both. There are definitely fields where you can layoff staff and outsource costs to save money. But semiconductor manufacturing definitely isn't one of them.\n\nI've said in other posts that shareholders are tolerating this now, but they won't do so forever. If Intel doesn't get their stuff together, this may not get fixed until a lot of people get fired.",
        "created_utc": 1595774936,
        "id": "fzazu6z",
        "score": 110,
        "subreddit": "investing",
        "created": 1595803736.0
    },
    {
        "author": "Pijoto",
        "body": "I sold a ton of AMD shares and Calls this week, and now I'm in your position, with AMD Puts and Intel $50 Calls I picked up on the cheap when the price dropped below $50...  Gonna hold my breath all next week, will definitely be kicking myself if AMD rockets into the 70s, because my plan is to get back in under $65.....",
        "created_utc": 1595636369,
        "id": "fz5cq6i",
        "score": 95,
        "subreddit": "wallstreetbets",
        "created": 1595665169.0
    },
    {
        "author": "a09guy",
        "body": "Love that the top comment is that the rant is bullshit and to not short intel lmao",
        "created_utc": 1595641509,
        "id": "fz5lkta",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1595670309.0
    },
    {
        "author": "WSBConsensus",
        "body": "**Intel is pushing back its 7-nanometer-based CPU product timing by six months** from its previous target. The announcement comes as Intel reports stronger 2Q results. But, the **delays have given an advantage to competitors like Advanced Micro Devices.**",
        "created_utc": 1595538691,
        "id": "fz0su3t",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1595567491.0
    },
    {
        "author": "ztw2002",
        "body": "Holding Intel calls and AMD puts like a retard",
        "created_utc": 1595968025,
        "id": "fzjsl3w",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1595996825.0
    },
    {
        "author": "LogicUpgrade",
        "body": "In few months: glad I didn’t invest in AMD.  Kicking myself I didn’t buy Intel when it dipped few months back.",
        "created_utc": 1595758838,
        "id": "fzafuas",
        "score": 87,
        "subreddit": "investing",
        "created": 1595787638.0
    },
    {
        "author": "69Tyrone420",
        "body": "So my Intel Calls went from $0.64 a contract to $0.13 a contract. How is your day going guys?",
        "created_utc": 1595880554,
        "id": "fzfu550",
        "score": 82,
        "subreddit": "wallstreetbets",
        "created": 1595909354.0
    },
    {
        "author": "VolvoKoloradikal",
        "body": "Intel has the smartest minds in the business, they've been through worse times and they'll deliver.\n\nAnd AMD will be the king for the next 4 years for sure, maybe even longer.",
        "created_utc": 1595544957,
        "id": "fz15ac5",
        "score": 80,
        "subreddit": "investing",
        "created": 1595573757.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "Not blind , it's pretty obvious. Look at the fundamentals , net income of Intel is 21B in 2019 and revenue is 72B. Net income of AMD in 2019 is 341M and their revenue is 6.73B. You guys are really retarded if you didn't buy this Intel dip after good earnings.",
        "created_utc": 1595628425,
        "id": "fz4yapz",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1595657225.0
    },
    {
        "author": "fsbull",
        "body": "My AMD tendies will be printing thanks to Intel 🤞",
        "created_utc": 1595536453,
        "id": "fz0oaxq",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1595565253.0
    },
    {
        "author": "LogicUpgrade",
        "body": "This entire narrative is BS. First, AMD has a fraction of the market share of Intel. Second, this is the third time AMD is about to overtake Intel, as if, it never happens. Check the long term charts. Third, Intel’s supposed 10nm process is actually a closer match to TSMC’s 7nm process already. Sizes don’t correspond to physical measurements. \n\nIs Intel hurting right now? Sure. But the biggest factors for it hurting aren’t the delay in process but two other things: the recession and the shrinking x86 market. \n\nGuess what, neither of those benefit AMD.",
        "created_utc": 1595758745,
        "id": "fzafr7q",
        "score": 74,
        "subreddit": "investing",
        "created": 1595787545.0
    },
    {
        "author": "zakkwaldo",
        "body": "As someone who works at intel. I’ll let you in on a little more about why Intel is slumping. We are getting to a point with processors where the failure and error rate are almost matching that of the successful output rate for some of the processor processes (this is true for the industry as a whole). The difference is, intel has in house fabs. Amd outsources their fab work to partnered companies. The reason this matters is as you have more failures and complexities arise, if your in housing your own stuff, you eat the cost of failure directly. If you contract it out, you frankly don’t give a shit what happens. You either get your product or the partnered company hasn’t held up their agreed contract and things get legal. \n\nAs a result amd has been able to move forward with newer nanometer processes without any fear or concern of if it’s even feasible or not. \n\nI will end with this though. Intel wouldn’t be dropping 8 billion dollars in to a new fab space (d1x in Oregon) if they didn’t feel they had a solid road map. Mark my words now, in 5-10 years, intel will be the leading manufacturer of FPGA’s and FPGA’s as a whole, will begin to replace the standard processor market as we know it.",
        "created_utc": 1595772379,
        "id": "fzavmus",
        "score": 71,
        "subreddit": "investing",
        "created": 1595801179.0
    },
    {
        "author": "smallstreetgains",
        "body": "**Subreddit:** /r/wallstreetbets\n\n**Searched Comments:** 14178\n\n**Overall Sentiment:** Bullish\n\n**Trending Tickers:** AMD, SLV, SPY, INTC, TSLA, AMZN, DKNG, MSFT, AUY, AAPL, BA, GLD, TSM, QQQ, NKLA, WMT, ACI, SPCE, APHA, MLB, DXY, MGM, MRNA, VXX, FE, FB, UPS, ATVI, GRMN, GO, GOLD, ARE, PFE, AZN, RTX\n\n**Trending Options:** B $33C 7/31, DKNG $35P 7/31, TSLA $1600C 7/31, AUY $7C 8/21, PCG $10C 7/31, AMD $59C 8/14, SPY $330C 7/31, TQQQ $100P 7/31, SLV $22C 7/31   \n\n**Sentiment**|**Comments**|**%**\n:--|:--|:--\nBullish|2073|67.75%\nNeutral|11118|-\nBearish|987|32.25%\n\n\n**Ticker**|**Mentions**|**Company**|**Price**|**P/E**|**Daily Change**\n:--|:--|:--|:--|:--|:--\nAMD|379|Advanced Micro Devices, Inc.|$68.88|170.52|-0.74%\nSLV|351|Exchange Traded Fund|$22.68|-|6.93%\nSPY|302|Exchange Traded Fund|$323.17|-|0.71%\nINTC|300|Intel Corporation|$49.54|9.79|-2.07%\nTSLA|288|Tesla, Inc.|$1538.28|729.28|8.56%\nAMZN|205|Amazon.com, Inc.|$3066.59|143.73|1.92%\nDKNG|196|DraftKings Inc.|$34.88|682.73|-7.11%\nMSFT|192|Microsoft Corporation|$203.79|34.92|1.24%\nAUY|175|Yamana Gold Inc.|$6.57|22.99|4.37%\nAAPL|122|Apple Inc.|$378.91|29.04|2.28%\nBA|122|The Boeing Company|$169.77|-|-2.30%\nGLD|115|Exchange Traded Fund|$181.96|-|1.83%\nTSM|100|Taiwan Semiconductor Manufacturing Company Limited|$82.45|24.79|11.57%   \nQQQ|90|Exchange Traded Fund|$260.23|-|1.83%\nNKLA|87|Nikola Corporation|$33.08|490.49|10.56%\nWMT|72|Walmart Inc.|$131.18|24.96|-0.05%\nACI|70|Albertsons Companies, Inc.|$15.20|9.62|-5.65%\nSPCE|67|Virgin Galactic Holdings, Inc.|$24.81|-|2.06%\nAPHA|66|Aphria Inc.|$5.74|17.09|12.43%\nMGM|56|MGM Resorts International|$14.95|2.84|-5.29%\nMRNA|54|Moderna, Inc.|$79.81|-|9.02%\nVXX|49|Exchange Traded Fund|$29.35|-|-2.72%\nFE|47|FirstEnergy Corp.|$29.15|27.68|-1.12%\nFB|45|Facebook, Inc.|$233.72|33.20|1.30%\nUPS|43|United Parcel Service, Inc.|$120.92|23.97|2.17%\nATVI|39|Activision Blizzard, Inc.|$81.75|39.58|2.21%\nGRMN|39|Garmin Ltd.|$100.33|18.99|3.71%\nGO|38|Grocery Outlet Holding Corp.|$43.03|164.49|2.99%\nGOLD|37|Barrick Gold Corporation|$29.85|11.79|4.98%\nARE|35|Alexandria Real Estate Equities, Inc.|$170.13|79.35|0.94%\nPFE|35|Pfizer Inc.|$37.66|13.76|0.00%\nAZN|31|AstraZeneca PLC|$56.58|96.21|1.39%\nRTX|31|Raytheon Technologies Corporation|$61.15|13.07|-1.49%\n\n\nYou can view all top trending tickers on /r/RedditTickers.\n\nNotice an error or have questions? Reply to this post or message /u/smallstreetgains.\n\nFinancial data provided by [finviz](https://finviz.com/).",
        "created_utc": 1595880643,
        "id": "fzfubv7",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1595909443.0
    },
    {
        "author": "Klutzy_Hamster",
        "body": "Just goes to show how important leadership is. Microsoft was pretty irrelevant under Balmer for most of 2000s up until Satya came in an shook things up by deciding to focus on cloud.\n\nKinda see the same thing happening with Intel now only in reverse. \n\nThe problem with owning a single stock for 30 years is that you never know which way company culture will go long-term. Things might seem good now but might not be in the future. That's why diversification is always best",
        "created_utc": 1595616603,
        "id": "fz4a809",
        "score": 67,
        "subreddit": "stocks",
        "created": 1595645403.0
    },
    {
        "author": "Figurativelyryan",
        "body": "It's all crazy gamblers here. Bought some Intel stock to hold for a decade because I too like to live slightly dangerously.",
        "created_utc": 1595605725,
        "id": "fz3n15r",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1595634525.0
    },
    {
        "author": "rali108",
        "body": "AMD is one of two companies in the world with x86 license. Their new Ryzen desktop lineup is kicking Intels ass, (intel is the other company with the license).  \n\nThey also make GPUs, and their mid to low end is highly competitive with Nvidia, although Nvidia has better high end. \n\nThey are exclusive suppliers for chips for XBOX and Playstation.\n\nTheir server chips which power cloud computing are top of the line when it comes to price performance and are just demolishing most of the competition.\n\nTheir new mobile chips are excellent as well.\n\nAlso their CEO, Lisa Su is simply a genius for what she has been able to accomplish thus far\n\n&amp;#x200B;\n\nIf they continue hitting their goals and gaining market share, Amd could be close to Intel or Nvidia market cap in a couple of years",
        "created_utc": 1595295035,
        "id": "fypzj5d",
        "score": 65,
        "subreddit": "stocks",
        "created": 1595323835.0
    },
    {
        "author": "hamstringstring",
        "body": "Shoutout to the guy that posted saying short Intel when Jim Keller left.",
        "created_utc": 1595663631,
        "id": "fz6fa7j",
        "score": 64,
        "subreddit": "StockMarket",
        "created": 1595692431.0
    },
    {
        "author": "throwawayanon15",
        "body": "5000 in Intel",
        "created_utc": 1595608707,
        "id": "fz3tbhq",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1595637507.0
    },
    {
        "author": "doublemctwist1260",
        "body": "I bought intel calls on Friday, and now I’m gay, you decide",
        "created_utc": 1595888712,
        "id": "fzgaqps",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1595917512.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "It is hard to tell what tech stocks and the NASDAQ will do but a bit of history is worth studying.\n\nIn 2000 Cisco was the giant of the internet and the internet was the giant of tech stocks. Every employee at Cisco was rich because they all got stock options (yes, including the janitors in those days) and the stock price had climbed from $10 in 98 to $33 in 99 and $79/sh in 2000. They did then sell and still do sell routers that were the backbone of the internet and CSCO was everyone's tech darling. I can't tell you how many Cisco employees had told me in spring of 2000 that they were not going to diversify until CSCO hit $100/sh. In Sept of 2001, their share price had dropped to $12/share. They still were the backbone of the internet but the internet and tech were no longer the darling of the Market. In Feb of 2009 they were at $14/sh and are today at $48/sh. So they today as an ongoing company still doing what it did and with a strong balance sheet are trading at roughly 2/3rds the price they were 20 years ago. That is what can happen to a really good tech company.\n\nBTW, CSCO is not the only one. Intel was at $74.88 in the fall of 2000 and is at $60/sh now and was running around in the $20's for most of the past 20 years. Still a great tech company doing great things.   And yes Intel employees also got rich on options.  I met with a Intel employee, a janitor, single, living in a trailer that was about to exercise $3 mm in net in the money INTC options and needed help with estate planning.   Those were the days.  A short edit:  In 2000 the estate tax began with only $675,000 of assets at death and it started just below 50% and quickly grew to 55%.   So you didn't need to be very wealthy to need estate tax planning.\n\nMicrosoft, one of today's tech darlings, was $50/sh in early 2000. It wandered around $25/share for 15 years until it again hit $50/sh in fall of 2015, fifteen long years later. The last 5 years have been good for it but will it stay at $200/sh?",
        "created_utc": 1595185321,
        "id": "fyl1bdi",
        "score": 56,
        "subreddit": "stocks",
        "created": 1595214121.0
    },
    {
        "author": "Deonneon",
        "body": "AMD broke out of its consolidation channel this week. Bullish pent up energy. When she moves, she moves for days. Expected NVDA speculation money to flow into AMD now that NVDA is too high. Pop hard Wednesday on New product news and it took a market to push her down Thursday. Bullish energy still there for ER next week. Expected a 5% bounce today. Intel did me good unexpectedly. \n\nAMD was the meme stock of 2017-2018 before Tesla.",
        "created_utc": 1595612204,
        "id": "fz40u0x",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1595641004.0
    },
    {
        "author": "Wino-Junko",
        "body": "Meant to buy 5 more calls (from the single one I had) on intel at close before earnings and mistakenly bought 5 shares instead.",
        "created_utc": 1595781822,
        "id": "fzbcy04",
        "score": 55,
        "subreddit": "RobinHood",
        "created": 1595810622.0
    },
    {
        "author": "SirJediJohn",
        "body": "They beat earnings estimates  ($1.23 vs. $1.11) for the 4th quarter in a row and the chip delay is during 6 months when no company is buying new hardware anyway.  AFTER downgrades INTC has an average price estimate of $59.55. I'm not an Intel fan, but still... \n\nINTC 10/16 $50c",
        "created_utc": 1595627139,
        "id": "fz4vu89",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1595655939.0
    },
    {
        "author": "smallstreetgains",
        "body": "**Subreddit:** /r/wallstreetbets\n\n**Searched Comments:** 9381\n\n**Overall Sentiment:** Bullish\n\n**Trending Tickers:** SLV, SPCE, AMD, SPY, TSLA, INTC, KODK, AMZN, GLD, BA, VXX, MSFT, AAPL, PFE, WMT, AUY, SHOP, QQQ, RTX, APHA, FB, TSM, ATVI, MCD\n\n**Trending Options:** SPY $330C 08/03, SLV $23C 9/18, BUD $57C 7/31, SLV $23C 8/7, AAPL $400C 8/21, NOK $4C 15/21, VXX $30C 8/14, CRON $6C 8/7, INTC $53C 7/31\n\n**Sentiment**|**Comments**|**%**\n:--|:--|:--\nBullish|1178|65.34%\nNeutral|7578|-\nBearish|625|34.66%\n\n\n**Ticker**|**Mentions**|**Company**|**Price**|**P/E**|**Daily Change**\n:--|:--|:--|:--|:--|:--\nSLV|406|Exchange Traded Fund|$22.73|-|-0.43%\nSPCE|266|Virgin Galactic Holdings, Inc.|$23.97|-|-3.83%\nAMD|250|Advanced Micro Devices, Inc.|$67.99|169.46|-1.43%\nSPY|183|Exchange Traded Fund|$321.75|-|-0.45%\nTSLA|183|Tesla, Inc.|$1495.56|792.38|-2.86%\nINTC|114|Intel Corporation|$49.21|9.59|-0.74%\nKODK|105|Eastman Kodak Company|$8.25|-|214.89%\nAMZN|94|Amazon.com, Inc.|$3011.40|145.94|-1.43%\nGLD|93|Exchange Traded Fund|$184.03|-|0.99%\nBA|87|The Boeing Company|$171.25|-|0.61%\nVXX|78|Exchange Traded Fund|$29.02|-|-1.09%\nMSFT|76|Microsoft Corporation|$202.67|35.36|-0.58%\nAAPL|66|Apple Inc.|$374.59|29.73|-1.23%\nPFE|60|Pfizer Inc.|$39.17|13.72|4.33%\nWMT|45|Walmart Inc.|$131.87|24.95|0.50%\nAUY|44|Yamana Gold Inc.|$6.59|24.12|-0.38%\nSHOP|42|Shopify Inc.|$985.82|-|0.97%\nQQQ|40|Exchange Traded Fund|$257.38|-|-1.06%\nRTX|40|Raytheon Technologies Corporation|$61.01|12.86|-0.14%\nAPHA|39|Aphria Inc.|$6.00|19.20|4.56%\nFB|39|Facebook, Inc.|$231.25|33.60|-0.96%\nTSM|34|Taiwan Semiconductor Manufacturing Company Limited|$77.03|27.93|-7.48%\nATVI|33|Activision Blizzard, Inc.|$80.89|40.39|-0.91%\nMCD|30|McDonald's Corporation|$196.59|26.36|-2.32%\n\n\nYou can view all top trending tickers on /r/RedditTickers.\n\nNotice an error or have questions? Reply to this post or message /u/smallstreetgains.\n\nFinancial data provided by [finviz](https://finviz.com/).",
        "created_utc": 1595966814,
        "id": "fzjq1yd",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1595995614.0
    },
    {
        "author": "hfutrell",
        "body": "And I was downvoted for calling Intel the next IBM ...\n\nAMD will profit from this, but who is building AMD’s 7nm chips? And who is building Apple’s chips when they transition away from Intel? Who is getting subsidized by every western government that fears China? TSMC to the moon.",
        "created_utc": 1595546157,
        "id": "fz17kmu",
        "score": 52,
        "subreddit": "investing",
        "created": 1595574957.0
    },
    {
        "author": "LovableContrarian",
        "body": "That's why I wrote this huge post about how AMD beat Intel to 7nm chips by a solid 3 years, which puts those sales to Dell, hp, Apple, etc at a huge risk.\n\nThis is literally why their stock dropped.",
        "created_utc": 1595636587,
        "id": "fz5d3nn",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1595665387.0
    },
    {
        "author": "IrishGooner77",
        "body": "Blue badge work directly for Intel. Green badges do not. They work for companies contracted to Intel. Green badges don’t get all the benefits that blue badges get because they don’t work for Intel. They work at Intel for another company. \nBig difference.",
        "created_utc": 1595761195,
        "id": "fzai1ri",
        "score": 50,
        "subreddit": "investing",
        "created": 1595789995.0
    },
    {
        "author": "Bleeding_Irish",
        "body": "Intel beats, dies. Twitter misses, moons. \n\nJust fade me.",
        "created_utc": 1595535257,
        "id": "fz0ls59",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1595564057.0
    },
    {
        "author": "allprowi",
        "body": "If you want intel.  NVAX's market cap is still laughably low for a company that has gotten $2B in sales on a product in phase 1 off a product's results that hasn't been licensed yet. This could make them a giant worth $150B+ which means 30x is still left to be had. (edit) (I have only sold my initial investment in this company. I'm letting all that ride until they cure us all or fail.)",
        "created_utc": 1594572383,
        "id": "fxuclkh",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1594601183.0
    },
    {
        "author": "Wanderer1066",
        "body": "Intel may be the IBM of the chip world. A celebrated blue chip company at the top of the heap that rested on its laurels and forgot to innovate.",
        "created_utc": 1595881043,
        "id": "fzfv62v",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1595909843.0
    },
    {
        "author": "_UsUrPeR_",
        "body": "I was surprised Intel hovered around 60 as long as it had. They're selling server chips with two year old processor form factors for twice the price of AMD's Rome procs. For every company looking to do a refresher on hardware, the choice was a no-brainer. The Rome 2 procs were something we waited to August 2019 to order, and there was such a backlog from orders, that delivery occurred in May of 2020.\n\nI don't think Intel is going to do well. I am surprised they remained $60 until they lost $9 premarket.\n\nYes, Intel does have other revenue streams: network chipsets, motherboards, storage SSD fab, ~~video cards~~, etc. Still, I can't help but think that Intel's lack of R&amp;D into another processor architecture informs me as to their company modus operandi: they rode astride the chip manufacturing world for too long, and a more innovative company is now eating their lunch. They were content to imagine that single-NUMA architecture was going to continue to dominate, while AMD focused on multiple NUMA nodes.\n\nThe disadvantage of single NUMA architecture is the complexity of assembling a die with 24 or 28 cores as a single unit. A lot of their production is thrown away or put into a lower bin when a manufacturing defect takes place. This effectively increases the cost or manufacturing, and Intel processor prices as a whole.\n\nAMD on the other hand, has been developing the Zepplin architecture since the Bulldozer chips in 2011. Their goal was to make production easy by assembling NUMA node modules in batches, and then later integrating them on the  CPU die with a separate processor responsible for intra-node communication. This decreases the points of failure from the entire die, down to single cpu components. This decreases their rate of rejection, which gives them the upper hand on price.\n\nThe final nail in the coffin for Intel is their inability to close the architecture process size below 10nm. When I'd heard that AMD was producing 7nm processors, I was intrigued what Intel's response was going to be. When it came out that they were going to be producing only mobile processors at 10nm, I knew they were in trouble.\nIntel has become second-class, and if they don't invest in some serious R&amp;D on their process and architecture, their processor division will soon become redundant.\n\nI am ultra-bearish on Intel in the long run. I cannot understand anybody claiming otherwise, and they are going to suffer immensely. Their R&amp;D teams are definitely being whipped in the back rooms.",
        "created_utc": 1595679684,
        "id": "fz6vbc2",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1595708484.0
    },
    {
        "author": "miltown_muscle",
        "body": "AMD being worth more per share than INTC doesn't mean anything, you imbecile. Compare their market caps",
        "created_utc": 1595449789,
        "id": "fywrr22",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1595478589.0
    },
    {
        "author": "NonkosherTruth",
        "body": "Got INTC and MSFT and sold my AMD call two days ago. Right now I feel like Matt Damon at the end of the Departed when he walks into his apartment and Wahlberg is standing there, just shoot me.",
        "created_utc": 1595536631,
        "id": "fz0oo26",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1595565431.0
    },
    {
        "author": "anhties",
        "body": "Intel has been lying about 10nm for years. What are the odds that they're lying about 7nm too?",
        "created_utc": 1595608583,
        "id": "fz3t1z4",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1595637383.0
    },
    {
        "author": "schplopledop",
        "body": "Having worked at Intel, I’m not surprised to see the decline. The fundamental issue I saw there was too many people not enough work. This led to an environment with crazy politics (gotta fight over the limited meaningful work or protect the work you do have) and idle developers (I saw a team that sat idle for 9 months without any work or leadership). I saw their amazing intern pipelines wasted as every decent engineer left. For the most part (at least in my part of the org), only those not skilled enough to get another job or too lazy to look remained.",
        "created_utc": 1595787711,
        "id": "fzbot0d",
        "score": 45,
        "subreddit": "investing",
        "created": 1595816511.0
    },
    {
        "author": "detroitvelvetslim",
        "body": "AMD is going to slowly insert the whole shaft into Intel over the next 3 years",
        "created_utc": 1595639852,
        "id": "fz5iqn8",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1595668652.0
    },
    {
        "author": "AccomplishedClub6",
        "body": "You are buying stocks because of stock charts.  \n\nBesides maybe INTC, these were all companies that have fallen from their all time highs and perhaps look \"cheap\" on a chart. Even INTC can be said to be \"cheap\" when you bought it when you look relative to the outperformance of all other tech stocks.\n\nThe saying \"buy low sell high\" is not helpful but a lot of people follow it blindly by looking purely at stock price.  What is often true is that winning companies in their sectors tend to continue to win, and other companies that cling to their past will continue to fail.  I wouldn't recommend any oil/gas stocks because the world is shifting into renewals.  Slowly, yes, but surely.",
        "created_utc": 1595621593,
        "id": "fz4kog8",
        "score": 43,
        "subreddit": "investing",
        "created": 1595650393.0
    },
    {
        "author": "return_of_the_ring",
        "body": "Don’t sell. They are doing very well and Intel is out of the game right now. As long as amd continues to execute, they are in no danger of falling off anytime soon. They haven’t even made significant inroads into the server market yet.",
        "created_utc": 1595976678,
        "id": "fzk9s2c",
        "score": 43,
        "subreddit": "investing",
        "created": 1596005478.0
    },
    {
        "author": "Shrapple",
        "body": "Only blue badges get to eat from office popcorn machine! And that's not a joke by the way.\n\nBut Intel are doing some serious capex investment, see 6bn facility underway in leixslip ireland, plus others in Israel and arizona(may be Nevada just going by memory)",
        "created_utc": 1595767489,
        "id": "fzaovdl",
        "score": 40,
        "subreddit": "investing",
        "created": 1595796289.0
    },
    {
        "author": "Kryptotek-9",
        "body": "Additionally however, Intel is now investing into GPU production, bringing that gap back down. However I would much rather invest in Nvidia, buying an existing chip manufacturer, is a lot better than trying to architecture your own new GPU line. Especially when Intels chip architecture seems to be falling behind faster every year.",
        "created_utc": 1595767395,
        "id": "fzaor7q",
        "score": 39,
        "subreddit": "investing",
        "created": 1595796195.0
    },
    {
        "author": "andypagakis",
        "body": "I bought the dip on Intel, 60k or so worth, I'll sell out around 56,",
        "created_utc": 1595694058,
        "id": "fz7hhbz",
        "score": 39,
        "subreddit": "stocks",
        "created": 1595722858.0
    },
    {
        "author": "Romanian_",
        "body": "&gt; Swan said he expects Intel to ship its first 7-nm CPU products in late  2022 or early 2023\n\n\nHaha",
        "created_utc": 1595541529,
        "id": "fz0yk3i",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1595570329.0
    },
    {
        "author": "pikindaguy",
        "body": "AMD up 14% and INTC down 14%, what  a day",
        "created_utc": 1595604836,
        "id": "fz3l7ea",
        "score": 38,
        "subreddit": "stocks",
        "created": 1595633636.0
    },
    {
        "author": "DonJohnsonBTFD",
        "body": "You got burned on INTC didn’t you?",
        "created_utc": 1595610394,
        "id": "fz3wxxm",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1595639194.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "I miss AMD under $10. It really wasn't that long ago.\n\nIt languish in a channel forever till market finally realize they are giving INTC a run for their money.",
        "created_utc": 1595623993,
        "id": "fz4pl6h",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1595652793.0
    },
    {
        "author": "SkyBIueDreams",
        "body": "I can’t help but laugh. This is all a fucking joke. I play MSFT earnings. They beat. It dumps. Calls worthless.\n\nI play Intel earnings. They beat. It dumps. Calls worthless.\n\nI avoid AMD because it just had a huge run up. They beat. It moons.\n\nSbux beats, moons. Of course.",
        "created_utc": 1595972620,
        "id": "fzk1vky",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1596001420.0
    },
    {
        "author": "caiuscorvus",
        "body": "According to this analysis, every company that is bigger than a competitor will always be the better investment.\n\nWut?\n\nPoint 1. What on this earth does revenue have to do with the ability to buy a company???\n\nPoint 2. I'm sorry does growth not factor into valuation?\n\nPoint 3. Tariffs are applied to imports. Look at manufacturing sites.\n\nPoint 4. Growth, again. Also the study shows it is still gaining market share, just not as quickly in Q4 and **this has rebounded in 2020**.\n\nPoint 5. Entirely unsupported. And what does 5g have to do with AMD, anyways?\n\nPoint 6. Ummm.. do you know what a cpu/gpu is? \"They provide chips for motherboards and gpu's AMD just produce cpu's and graphics cards.\" So, intel provides CPU and CPUs, and AMD provides...CPUs and GPUs? \n\nPoint 7. So, upstart companies are not a thing I guess.\n\nPoint 8. Trusted brand, my ass. See the huge security problems Intel has been having.\n\nI don't normally comment like this, but wow what a shitty DD.\n\nedit. See the good response below.",
        "created_utc": 1595734552,
        "id": "fz9oia4",
        "score": 34,
        "subreddit": "investing",
        "created": 1595763352.0
    },
    {
        "author": "SpartanKing76",
        "body": "Someone who was very long Intel",
        "created_utc": 1595637700,
        "id": "fz5f1ap",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1595666500.0
    },
    {
        "author": "Nintendie69",
        "body": "Buying the Intel dip is not a no brainer. The company is in decent financial shape but its long term future is looking bad:\n\n1. They have been struggling for years to transition to the 10 nm tech node and haven’t been able to get decent yields. Now the 7 nm process which was supposed to get them back on track is delayed.\n2. AMD is eating their lunch in CPUs. Intel never gained any ground against NVDA in the GPU market. \n3. Their acquisitions to get a foothold in other industries have been dissapointing. (Mobileye)\n4. They have a poor reputation among engineers and are bleeding talent. Anyone who can is looking to leave. The people who stay at Intel are the ones who can’t get another job.\n\nThe tech industry moves fast and today’s winners can disappear if they lose their edge. Look at what happened to Yahoo. Sun Microsystems. Silicon Graphics. All the office parks in the Valley have hidden histories to tell about the companies that used to do groundbreaking work there.",
        "created_utc": 1595632977,
        "id": "fz56p5w",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1595661777.0
    },
    {
        "author": "iopq",
        "body": "AMD is the good company at a bad price, Intel is the bad company at a good price",
        "created_utc": 1595552273,
        "id": "fz1iuya",
        "score": 33,
        "subreddit": "investing",
        "created": 1595581073.0
    },
    {
        "author": "AlienManifestation",
        "body": "People working at Intel always say working there is like working for government, bad sign if you're doing cutting edge stuff.",
        "created_utc": 1595549204,
        "id": "fz1dc55",
        "score": 32,
        "subreddit": "investing",
        "created": 1595578004.0
    },
    {
        "author": "waterfly9604",
        "body": "I see some of you are still holding Intel puts after it had a -17% day. Godspeed idiots.",
        "created_utc": 1595796058,
        "id": "fzc4zvr",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1595824858.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "Brambles &amp; Shambles Report 7/31:\n\n\nIn Brambles: \n\n* INTC Callholders \n* AMD Callholders\n* AMZN FOMO’ers\n* FB FOMO’ers\n* SPY Putholders\n* VXX Callholders\n\nIn Shambles:\n\n* TSLA Callholders\n* KODK Callholders\n* SPY Putholders \n* AAPL Putholders \n* OPK Callholders\n* BA Callholders\n\n\n“In Shambles” User of the Day: Too many people to list; all you fucks who called the rug pull for the 57th time. Eat my butt\n\nShrimpie Out ✌️ Back on Monday.",
        "created_utc": 1596227087,
        "id": "fzwpotk",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1596255887.0
    },
    {
        "author": "zsx00",
        "body": "My same thoughts lol. Still a pretty good write up, but to call every play for every day this week is a stretch.\n\nI do agree with the early rally on monday morning, but I see it going all the way into the afternoon. Mondays usually the market moves up as a whole, not to mention we went into oversold territory on thursday and friday was kinda flatish. I see some sort of bounce on Monday with people getting back in, maybe even an INTC rally.",
        "created_utc": 1595789782,
        "id": "fzbsvot",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1595818582.0
    },
    {
        "author": "tickitch",
        "body": "Hey guess who bought Intel instead of amd yesterday, after staring at both for a bit.\n\nI bought Intel at $60 thinking it would go up but now it's 13% down at $50 a share.\n\n\nFuck.",
        "created_utc": 1595600451,
        "id": "fz3ckji",
        "score": 31,
        "subreddit": "stocks",
        "created": 1595629251.0
    },
    {
        "author": "hfutrell",
        "body": "Except those people are largely right.\n\nHalf of Intel's revenue comes from consumer PCs, with the second largest segment data centers. Everything else they do is a footnote in comparison to these two groups. Intel is *not* well diversified and this is a direct result of their failure in GPUs, mobile, wearables, selling off their modem business, losing Apple as a customer, etc. This is a company increasingly reliant on a few high margin products. If those products lose ground to AMD they are in an *incredibly* precarious position. Intel looks to be a company *in decline*.",
        "created_utc": 1595567521,
        "id": "fz282pu",
        "score": 31,
        "subreddit": "investing",
        "created": 1595596321.0
    },
    {
        "author": "joshmaaaaaaans",
        "body": "Man, I fucked up so big on AMD.\n\nI knew this shit was so undervalued, ryzen was just coming out and the 3 series was gaining insane hype like I've never seen before in the pc enthusiast market, and their stock value just wasn't reflecting that at all, so I bought in at around $9, then for some reason, just decided to sell at $12, even though I had told myself I'm going to hold this for the long term, this stock is going to go crazy, there's no reason it's so far below intel with the hype surrounding their ryzen and threadripper releases, just sold at $12 and completely forgot about it, lmao.\n\nFelsbedmen",
        "created_utc": 1594856853,
        "id": "fy77cs2",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1594885653.0
    },
    {
        "author": "dynolas1",
        "body": "Interesting observation , only issue you forgetting is US Gov. reason why intel has been superior in the security sector and government sector is because its made in US without risk of foreign government implanting bugs in the chips to spy.\n\n\nhttps://www.google.com/amp/s/techcrunch.com/2018/10/04/china-reportedly-infiltrated-apple-and-other-us-companies-using-spy-chips-on-servers/amp/",
        "created_utc": 1595694626,
        "id": "fz7ii5s",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1595723426.0
    },
    {
        "author": "jpowpump",
        "body": "2014-2018 AMD was not competitive. Intel deliberately delayed and became complacent. The reality is if Intel doesn't engage in anti competitive practices they wouldn't be milking that cash flow.",
        "created_utc": 1595611498,
        "id": "fz3zbc7",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1595640298.0
    },
    {
        "author": "noobgiraffe",
        "body": "&gt; Intel wouldn’t be dropping that magnitude of cash and 6-8 years of construction on a site just for the shits and giggles of it.\n\nIntel invested billions in 10nm fabs and that didn't turn out so well.\n\nYou must work at different Intel than i do since the one i work for has upper management had abysmal results in company wide surveys for a few years now. Every time they say the same bullshit about hearing us and that they are taking the steps to change but nothing ever happens except shuffling people at the top every two years to \"better align with priorities\" and changing my division name for the fifth time since i've been working there.",
        "created_utc": 1595778610,
        "id": "fzb6m2f",
        "score": 29,
        "subreddit": "investing",
        "created": 1595807410.0
    },
    {
        "author": "cache_miss",
        "body": "You have only mentioned the personal computing market. Intel has \\~$23B in quarterly revenue from the server market alone. AMD's total quarterly revenue is only \\~$7B.  \n\nIntel isn't \"losing\" until it loses its share of the enterprise and public cloud market -- a market where AMD is all but absent.",
        "created_utc": 1595771210,
        "id": "fzatw4u",
        "score": 29,
        "subreddit": "investing",
        "created": 1595800010.0
    },
    {
        "author": "BigEd781",
        "body": "First thanks for posting some substance here, I'll read through more of it later, but don't want to seem like I'm picking on one thing and ignoring everything else. \n\nIntel definitely seems undervalued on paper, but I don't want any of it until they show some operational competence. Operationally they have been screwing up for years, which doesn't bode well for their future. I'd like to see some good signs on that front before I put them back in my portfolio.",
        "created_utc": 1595707089,
        "id": "fz880pt",
        "score": 29,
        "subreddit": "stocks",
        "created": 1595735889.0
    },
    {
        "author": "cambeiu",
        "body": "[ARM-based Japanese supercomputer is now the fastest in the world](https://www.theverge.com/2020/6/23/21300097/fugaku-supercomputer-worlds-fastest-top500-riken-fujitsu-arm)\n\nIntel is being challenged on the highest end.\n\nIntel is being challenged on the mobile end (both by ARM and AMD).\n\nIntel is being challenged on the enthusiast end. \n\nIntel has no manufacturing advantage.\n\nIntel has no play on the AI space.\n\nIntel has no play on the 5G space.\n\nIntel has no play on the gaming console space.\n\nIntel smells like a value trap to me.",
        "created_utc": 1595677044,
        "id": "fz6scke",
        "score": 28,
        "subreddit": "StockMarket",
        "created": 1595705844.0
    },
    {
        "author": "smallstreetgains",
        "body": "**Subreddit:** /r/wallstreetbets\n\n**Searched Comments:** 14840\n\n**Overall Sentiment:** Bullish\n\n**Trending Tickers:** KODK, SLV, AMD, SPY, TSLA, BA, KODAK, INTC, AMZN, SHOP, PRPL, GLD, MSFT, FOMC, FB, APHA, WMT, VXX, AAPL, UPS, PYPL, AUY, BUD, SPCE, QQQ, DXY, TSM\n\n**Trending Options:** VXX $29C 8/7, WMT $120C 9/18, KODK $5P 8/21, KODK $5C 8/21, INTC $50C 9/18, FB $230P 7/31, KODK $15P 8/21, SPY $322P 7/31, UNH $315C 7/31\n\n**Sentiment**|**Comments**|**%**\n:--|:--|:--\nBullish|1467|58.33%\nNeutral|12325|-\nBearish|1048|41.67%\n\n\n**Ticker**|**Mentions**|**Company**|**Price**|**P/E**|**Daily Change**\n:--|:--|:--|:--|:--|:--\nKODK|796|Eastman Kodak Company|$39.49|-|397.36%\nSLV|356|Exchange Traded Fund|$22.65|-|-0.55%\nAMD|323|Advanced Micro Devices, Inc.|$75.89|166.12|12.25%\nSPY|261|Exchange Traded Fund|$325.29|-|1.28%\nTSLA|165|Tesla, Inc.|$1501.50|759.90|1.69%\nBA|160|The Boeing Company|$166.39|-|-2.60%\nINTC|111|Intel Corporation|$48.06|9.53|-2.39%\nAMZN|97|Amazon.com, Inc.|$3029.75|143.32|0.98%\nSHOP|85|Shopify Inc.|$1049.16|-|6.51%\nPRPL|79|Purple Innovation, Inc.|$22.47|376.07|6.67%\nGLD|75|Exchange Traded Fund|$185.03|-|0.70%\nMSFT|69|Microsoft Corporation|$204.28|35.04|1.12%\nFB|68|Facebook, Inc.|$233.12|33.12|1.30%\nAPHA|68|Aphria Inc.|$4.93|20.07|-17.83%\nWMT|64|Walmart Inc.|$130.88|25.06|-0.67%\nVXX|63|Exchange Traded Fund|$28.48|-|-2.38%\nAAPL|63|Apple Inc.|$380.35|29.24|1.97%\nUPS|47|United Parcel Service, Inc.|$124.01|24.22|3.67%\nPYPL|47|PayPal Holdings, Inc.|$184.49|111.56|4.66%\nAUY|42|Yamana Gold Inc.|$6.65|24.01|1.06%\nBUD|41|Anheuser-Busch InBev SA/NV|$56.70|37.70|1.91%\nSPCE|36|Virgin Galactic Holdings, Inc.|$23.06|-|-3.35%\nQQQ|35|Exchange Traded Fund|$260.02|-|1.25%\nTSM|30|Taiwan Semiconductor Manufacturing Company Limited|$82.70|25.80|7.51%\n\n\nYou can view all top trending tickers on /r/RedditTickers.\n\nNotice an error or have questions? Reply to this post or message /u/smallstreetgains.\n\nFinancial data provided by [finviz](https://finviz.com/).",
        "created_utc": 1596053266,
        "id": "fznlt0o",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1596082066.0
    },
    {
        "author": "EnigmaSpore",
        "body": "If it dips again at the open on monday, im definitely hopping on board. \n\nTheir 7nm product is definitely an issue for the long term, but those products were previously supposed to arrive q4 2021, so in the short term it's still business as usual for intel (outside of the virus issues of course).\n\nAlso... intel's 7nm is around the equivalent of TSMC's 5nm. Intel's 10nm is comparable to TSMC's 7nm. Intel just really F'd up because they went too hard on density and it backfired hard on them....\n\nanways... I'm down to hop on the intel comeback for the short term. At least back to the mid 50s during the next quarter, so if it dips im aiming for sept 50c",
        "created_utc": 1595630425,
        "id": "fz520tz",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1595659225.0
    },
    {
        "author": "blunt_person",
        "body": "Imma be ultra real here:\n\nSell those off (~1350) and fucking yolo them into $80 calls exp 1/15/21\n\n--\n\nIntel is all out of good news for the year.\n\nAMD hasn't even fully released the goods on their 4000 series, and on the enterprise market they continue to chip away at Intel's share with Intel doing fuck-all to stop that bleeding.\n\nWhen AMD hits ~85-88, take the fucking win and go home.",
        "created_utc": 1595642180,
        "id": "fz5mpia",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1595670980.0
    },
    {
        "author": "Amorphous_Shadow",
        "body": "Never buying another Intel cpu in my life.",
        "created_utc": 1595868748,
        "id": "fzf53ji",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1595897548.0
    },
    {
        "author": "TheSweetestKill",
        "body": "First off, save your F5 key, keep this website open in a tab. I listen to it all during trading hours. https://wsbsynth.com/\n\nSecond, same here with the job. What sort of intel do you look for? Since covid I have been working from home and I basically have fuck all to do most days, so I've been spending a lot of time researching and watching wsb and trading options. But I can't seem to find a decent strategy to win OR lose, it seems like I wind up week after week +10% or -10% but nothing crazy in either direction. My portfolio all time is only +5.3%.",
        "created_utc": 1594862466,
        "id": "fy7h75w",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1594891266.0
    },
    {
        "author": "__justsayin__",
        "body": "Product delay at Intel = opportunity &amp; competitive edge for AMD",
        "created_utc": 1595535650,
        "id": "fz0mma0",
        "score": 27,
        "subreddit": "stocks",
        "created": 1595564450.0
    },
    {
        "author": "1terrortoast",
        "body": "I love how AMD goes vertical because Intel is digging its own grave",
        "created_utc": 1595535058,
        "id": "fz0lcw5",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1595563858.0
    },
    {
        "author": "crazy_goat",
        "body": "Both.\n\nAMD and TSMC are solid plays. I expect a small pullback at some point - but they both have bright futures thanks to Intel being a complete fuck up",
        "created_utc": 1595687664,
        "id": "fz76feb",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1595716464.0
    },
    {
        "author": "crackpk",
        "body": "RIP my INTC calls 7/24/20-7/28/20 🕊",
        "created_utc": 1595968197,
        "id": "fzjsxx7",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1595996997.0
    },
    {
        "author": "YoungCrouton99",
        "body": "Eh they are still quite behind on the GPU front compared to NVIDIA but are blowing intel out of the water on the CPU front. Almost everyone I know who is building a computer is using an AMD CPU due to their ridiculous processing power and how cheap they are but I still have yet to meet anyone who has gone AMD over NVIDIA",
        "created_utc": 1595613243,
        "id": "fz432l7",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1595642043.0
    },
    {
        "author": "corytrade",
        "body": "The level of retarded in here thinking Intel is done as a company is top notch. 19.7B in revenue....bearish.",
        "created_utc": 1595608265,
        "id": "fz3sdy2",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1595637065.0
    },
    {
        "author": "Goatfacedwanderer",
        "body": "Intel has cash but they are going to get demolished in market share if they don't have anything better to offer for 2+ years. AMDs current lineup might be hard for them to deal with before you even factor in the product roadmap they've got coming.",
        "created_utc": 1595548104,
        "id": "fz1bb7y",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1595576904.0
    },
    {
        "author": "Michael---Scott",
        "body": "But Intel got 10 nano, sounds like your pp is too small.",
        "created_utc": 1595565149,
        "id": "fz24mg9",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1595593949.0
    },
    {
        "author": "LCJefferson",
        "body": "Would genuinely be interested in an unbiased view on both AMD and Intel from someone. I have no clue about chips and designs etc, but every post I go to has extreme bias in favour of one over the other. \n\nFor me personally, I just don't see people looking at the chip specs before buying a computer. I suppose the only exception is people buying gaming pcs, but can't see that having a huge impact on Intel?",
        "created_utc": 1595686198,
        "id": "fz744i4",
        "score": 24,
        "subreddit": "stocks",
        "created": 1595714998.0
    },
    {
        "author": "gizcard",
        "body": "The biggest problem with Intel is that it lacks leadership. AMD and NVIDIA both have excellent leadership teams starting with their CEOs.",
        "created_utc": 1595733682,
        "id": "fz9n5n9",
        "score": 24,
        "subreddit": "investing",
        "created": 1595762482.0
    },
    {
        "author": "zimzamzoom2",
        "body": "Dude they are just ramping up their Intel bloodbath. Wait until next year when they take over the laptop market.",
        "created_utc": 1595973416,
        "id": "fzk3gyb",
        "score": 24,
        "subreddit": "stocks",
        "created": 1596002216.0
    },
    {
        "author": "Vtwin0001",
        "body": "LONG TERM CHAIR (CULT)\n\nGO FOR INTC",
        "created_utc": 1595003845,
        "id": "fydhkdv",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1595032645.0
    },
    {
        "author": "NoobSniperWill",
        "body": "Intel delays 7nm. The semiconductor industry is highly competitive and the players must keep pushing smaller, faster and more cost efficient products.\nAnyone shows slowdown in innovation or new technology is slaughtered",
        "created_utc": 1595598662,
        "id": "fz399qj",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1595627462.0
    },
    {
        "author": "Jackie296",
        "body": "Sold SLV for INTC today 🤡🤡",
        "created_utc": 1595893757,
        "id": "fzgka00",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1595922557.0
    },
    {
        "author": "Hypoglybetic",
        "body": "10nm Desktop chips won't arrive until July 2021. . . AMD's Zen 3 chips arrive later this year on TSMC's 7nm (TSMC 7nm is similar enough to Intel 10 nm).  Intel is plagued with delay after delay.  AMD and TSMC are firing on all cylinders.  AMD will probably begin rolling out 5nm chips next year when intel finally get to 10 nm.  AMD is solidifying their advancement in both architecture and process node.  Buy calls but be weary of macro economics.",
        "created_utc": 1595542661,
        "id": "fz10sv6",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1595571461.0
    },
    {
        "author": "SkyBIueDreams",
        "body": "You know what’s feels worse than huge losses, at least to me? Knowing you were this 👌 close to making a play that would’ve skyrocketed your portfolio to that stratosphere. I was thinking on Thursday that I should go for AMD 1dte calls because of Intel’s earnings. \n\n I figured, if Intel beat bigly, AMD would go up by association. If Intel shit the bed, then AMD would still go up because their Intel’s competitor. I was only going to throw 1k into some 69cs as a lotto ticket. Literally had my cursor over the buy button, but I decided against it at the last second because I have taken a beating the last couple weeks and I made a commitment to only make safe plays. So I backed out.\n\nHad I bought those calls for 1k, had I just clicked that purchase button, it would’ve netted me over $300,000. \n\n$300,000.\n\nFuck man. Fuck.",
        "created_utc": 1595710139,
        "id": "fz8h43t",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1595738939.0
    },
    {
        "author": "fatmiddleagedcatlady",
        "body": "sure xlf is a technology exchanghe traded fund... they diversify into the tech industry and are a good alternative is you don't have the cash to buy full shares of microsoft and apple  ..i dont lol... \n\nXLK's top 4 holding's are\n\nMicrosoft Corp\tMSFT\t22.01%\nApple Inc\tAAPL\t19.43%\nVisa Inc Class A\tV\t5.05%\nIntel Corp\tINTC\t4.31%\n\napple is down 5% on good news\nmicosoft is down 4.3% on good news\nintel is down 7% on good news (earnings wise. the 6 month chip delay is nothing major)\n\nif all 3 bounce back that's a huge profit.\n\nthose four make up just over 50% of XLK fund's holdings.\n\n so buying xlk you are buying a fund where apple, microsoft and intel are the 3 companies that  make up about half of what the fun is invested in...\n\n\nessentially buying xlk is buying a little apple, a little microsoft, and a little intel... which are all down between 4% and 7% despite good news and being the safest bets for growth of any stocks right now\n\nxlk being down 2.6% .... with half of it's money invested in microsoft, apple, and intel....  it's a safe bet that that all 3 are going to bounce back tomorrow and continue to grow for a long time.\n\nxlk is up 25% in the last year...35% in the last 3 months. this little 2.6% dip is the best little drop with a near 100% guarentee to go up (way up) that you're going to ever see \n\n\narkk is another etf to look at because it's owns more tesla than another etf.. and is also invested in other solid companies so you can ride the tesla wave and not get burned when the tesla bubble pops\n\narkk is up 70% on the year\n\ni loaded up on arkk today when tesla dipped\n\nand i'm gonna load up an equal amount on xlk tomorrow because microsoft apple and intel are all dipping. \n\na comparison of xlk and arkk ... both funds very smart buys. smart safe and big returns. (you buy the fund like a stock, xlk is the symbol for the fund diversified into 50 different companies... 50% of it is microsoft, apple and inte... 47 other tech companies make up the other 50%)\n\nhere's a comparison of the two funds:\nhttps://www.askfinny.com/compare/xlk-vs-arkk\n\nim going to buy just as much xlk as i spent on arkk today (which is still a good time to buy,,, i recommend doing the same but thats just my opinion)\n\ndoes that make sense? im not great at explaining.. or i over explain sometimes lol",
        "created_utc": 1595539513,
        "id": "fz0uh7m",
        "score": 23,
        "subreddit": "stocks",
        "created": 1595568313.0
    },
    {
        "author": "Shrekthefatman",
        "body": "At July 23rd they went up 16% and it went up for the rest of week until a short decline till earnings. \n\nThey are also about to win since Intel has down syndrome",
        "created_utc": 1595970807,
        "id": "fzjy9h0",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1595999607.0
    },
    {
        "author": "VacationLover1",
        "body": "In 20 years my Intel shares are going to be +20% and you guys are going to regret not buying the dip.. sad really.. see you gays on my yacht",
        "created_utc": 1595789524,
        "id": "fzbsdha",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1595818324.0
    }
]