[
    {
        "author": "rightovahere",
        "body": "Quit bein a bitch. These BABA calls boutta print so hard I'm gonna rosetta stone some mandarin so I can thank Jack Ma in person.",
        "created_utc": 1597892323,
        "id": "g26b8od",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1597921123.0
    },
    {
        "author": "acoupleoftravels",
        "body": "In March I remember seeing TSLA $600 2022s for $10,000 a piece. Thought it was a steal. Bought some and told my mom to put her life savings into this. Tesla dropped a hundred more and I decided not to have my mom lose money for wsb loss porn and I sold along with her at break even. I thought this crash was going to be a long term bear market and as someone who held Tesla stock since 2016, I knew being stuck at $2-300 range for years was possible again and that first parabolic move to $900 was nuts and unusual. \n\nAnyways, I broke the golden rule and checked what those calls would be worth now. $1.5 million. You're welcome ma!",
        "created_utc": 1597729304,
        "id": "g1ydmwi",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1597758104.0
    },
    {
        "author": "RandyCrane17",
        "body": "Mastercard puts were one of the worse ideas i've had in a while.",
        "created_utc": 1598648381,
        "id": "g36bsm9",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1598677181.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "Trading is like the opposite of meditation.\n\nThe mind ruminates on passing garbage thoughts that just collect in my head like giant landfill patch in the middle of the Pacific.\n\nSeriously, this shit has made me like 20% retarded and forgetful as fuck.  Can't focus on shit.\n\nOnce ma' puts print, imma clear my mind and go back to my old hobbies.",
        "created_utc": 1597459647,
        "id": "g1ijc3m",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1597488447.0
    },
    {
        "author": "namisdavid",
        "body": "AAPL, MSFT, NET, V, MA",
        "created_utc": 1596590673,
        "id": "g0ecvpo",
        "score": 13,
        "subreddit": "stocks",
        "created": 1596619473.0
    },
    {
        "author": "raouldukesaccomplice",
        "body": "Will Alibaba keep up the fiction that they are a Cayman Islands company? Will Jack Ma start speaking with a Caribbean accent?",
        "created_utc": 1597797612,
        "id": "g21ujcd",
        "score": 12,
        "subreddit": "investing",
        "created": 1597826412.0
    },
    {
        "author": "t33po",
        "body": "Moscow Exchange to offer trading in U.S. blue chips from Aug. 24***\n\n\n\n&gt;(Russia August 24th🇷🇺)The exchange will offer shares in Microsoft Corp, Amazon.com Inc, NVIDIA Corp, McDonald's Corp , Facebook Inc, Twitter Inc, Alphabet Inc , Exxon Mobil Corp, Boeing Co, Intel Corp, AT&amp;T Inc, Pfizer Inc, Visa Inc , Netflix Inc, Micron Technology Inc, Activision Blizzard Inc, Walt Disney Co, Advance Micro Devices Inc and Mastercard Inc.  [Reuters](https://www.reuters.com/article/russia-moex-idUSL8N2FJ4H6)\n\nWith a fast collapsing Ruble, there might be some big Ruski money trying to find a temporary safe haven tomorrow. I can't possibly know the effect, if any at all, but it could be an interesting side show. Watch this space.",
        "created_utc": 1598240531,
        "id": "g2nocj1",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1598269331.0
    },
    {
        "author": "Geomaestro",
        "body": "Fintech companies like SQ and PYPL are a great investment. However, a lot of big companies will (and already did) implement online financial services. MA is able to easily work with multiple of those companies and they're using their global presence pretty well, that's why they're my pick for the fintech industry.\n\nThey launched Mastercard Accelerate last year, implementing those online paying platforms and letting start-ups take advantage of their global presence to grow and transform very fast. Last year they acquired Ethoca (managing e-commerce fraud) and Vyze (platform to connect merchants with multiple renders, giving them the opportunity to get those financial needs for start-ups). MA is basically helping start-ups to grow faster, which will result in more financial transactions in the future.\n\nLast but not least, they like to focus on expanding to countries where there isn't much competition yet. They are expanding their exposure to Middle East and Africa, working with local networks and e-commerce platforms. They are in a strong position to capitalize those regions in the future and take on market leader Visa even more.\n\nThey get compared a lot to Visa, so I'll expand on that subject a bit as well. While V is focussing on performance and speed, MA plays the cyber security card. They are already working on ways to implement cryptocurrency and Mastercard tend to have more growth potential vs stability from market leader Visa. While V is in the lead, MA is more widely used by fintech companies, which shows potential take-over in the future. Next to their credit services, they also own debit service Maestro, which is widely used in Europe.\n\n**Financial**\n\nReturns as high as 150% (ROE) and 60% (ROIC). Very large margins and perfectly stable balance sheet. High EPS growth YoY, 53% and 42% in the last two years. Quick ratio 1.87. V has more assets and even bigger margins, however MA wins in returns and cash. In terms of more growth, I like to focus on those last numbers more.\n\n**Doubts**\n\nIt's a blue chip at a $300B market cap. Their growth potential might be limited, although I see them as one of the better picks between blue chips.",
        "created_utc": 1598386155,
        "id": "g2u5rvv",
        "score": 11,
        "subreddit": "stocks",
        "created": 1598414955.0
    },
    {
        "author": "i_am_the_liquor_eh",
        "body": "I've been waiting for this IPO. I will be taking a position right away and holding long term.\n\nRocket Mortgage (Parent: Quicken Loans), provides a tool to electronically collect documentation about borrower’s income, assets and credit history, allowing the lender to make approval decisions based on an online application in as little as eight minutes.\n\nThey key is that Rocket Mortgages is in the business of mortgage origination and does not retain the loans on their balance sheet. Like other loan originators, Rocket Mortgages sells the loans to established banks.\n\nThis is similar to a company like Mastercard/Visa where it makes money off people using credit/loans but do not hold the loan and the majority of the risk.\n\nWho knows in the short term but like I said, long term hold for me.",
        "created_utc": 1596651677,
        "id": "g0gzg8l",
        "score": 10,
        "subreddit": "stocks",
        "created": 1596680477.0
    },
    {
        "author": "AllDatDalton",
        "body": "My momma she call me crying. She say\n\n‘SON are tees tings they say about you, these horrible things. Are they true?’\n\nI sigh and I say, oh so sad. \n\nYes muh-ma it is true. I bought GM calls Tuesday at the top.  EV they said momma. EV.",
        "created_utc": 1597942505,
        "id": "g28ao8q",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1597971305.0
    },
    {
        "author": "Mcjibblies",
        "body": "This guy thrives on uncertainty, holy smokes. He will drag you into the mud like no one I've ever seen. He'll just tear it down if it's not working for him. \n\nIt's a-ma-zing to see",
        "created_utc": 1596920846,
        "id": "g0tr6o1",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1596949646.0
    },
    {
        "author": "LeafsAreCryBabies",
        "body": "Lig ma balls!!!!",
        "created_utc": 1596559449,
        "id": "g0ce5no",
        "score": 9,
        "subreddit": "investing",
        "created": 1596588249.0
    },
    {
        "author": "JefBezosExWifesNewBF",
        "body": "I BOUGHT 10K IN BABA CALLS YESTERDAY😭😭😭 JACK MA PLEASE DONT STOP I NEED THIS",
        "created_utc": 1597244060,
        "id": "g17wc65",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1597272860.0
    },
    {
        "author": "heartstesler",
        "body": "Apple Amazon Alphabet Facebook Netflix Microsoft Tesla MasterCard Nvidia Boeing Goldman Sach \n\nThese stocks are main driver of this rally and taking this market higher everyday for last four and half months.\n\nyesterday Nasdaq recovered 3 previous days of losses in just one hour\n\nIt’s not a broad based rally. Even MM’s do not know which other stock to lift to take market higher.\n\nBet safely\n\nPositions in stocks -\nApple Amazon Alphabet Facebook Netflix Microsoft Nvidia MasterCard Tesla Shopify",
        "created_utc": 1597332073,
        "id": "g1c36ks",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1597360873.0
    },
    {
        "author": "hoodedcactus",
        "body": "Today we hit extreme greed. And we also had the farthest separation of the NASDAQ and it’s 200day ma in 20 years. But with JPow in play, calls it is I guess",
        "created_utc": 1598499876,
        "id": "g2zjtcv",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1598528676.0
    },
    {
        "author": "MechAegis",
        "body": "Honestly, I have never been positive on my RH account. I ma just dump some more into Tesla. Maybe a little into Apple and AMD.",
        "created_utc": 1598915943,
        "id": "g3j1nlm",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1598944743.0
    },
    {
        "author": "JustLookingAroundFor",
        "body": "I regret not buying this\n\n\nhttps://www.zillow.com/homedetails/26-Indian-Trl-Sagamore-Beach-MA-02562/55858587_zpid\n\nWhoever did made out like a bandit\n\nProbably some cum slut boomer",
        "created_utc": 1596500233,
        "id": "g09w14n",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1596529033.0
    },
    {
        "author": "Shaun8030",
        "body": "Tech is where it's at long term . I will stick with my amzn , apple , MSFT , GOOG , Nvidia , sq , v , ma over airlines , oil, telecoms , utilities  REITs, banks etc",
        "created_utc": 1597186674,
        "id": "g15keig",
        "score": 7,
        "subreddit": "stocks",
        "created": 1597215474.0
    },
    {
        "author": "darodardar",
        "body": "FREE MA NIBBA CHIMPU",
        "created_utc": 1597127769,
        "id": "g12th5u",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1597156569.0
    },
    {
        "author": "RPMayhem",
        "body": "Moscow Exchange to offer trading in U.S. blue chips from Aug. 24\n\nMOSCOW, Aug 17 (Reuters) - The Moscow Exchange will launch trading of the 19 most liquid shares from the U.S. S&amp;P 500 index on Aug. 24, the bourse said on Monday.\n\nThe exchange will offer shares in Microsoft Corp, Amazon.com Inc, NVIDIA Corp, McDonald's Corp , Facebook Inc, Twitter Inc, Alphabet Inc , Exxon Mobil Corp, Boeing Co, Intel Corp, AT&amp;T Inc, Pfizer Inc, Visa Inc , Netflix Inc, Micron Technology Inc, Activision Blizzard Inc, Walt Disney Co, Advance Micro Devices Inc and Mastercard Inc.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nsecond leg up confirmed to be fueled by soviet vodka",
        "created_utc": 1597939041,
        "id": "g283gck",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1597967841.0
    },
    {
        "author": "roufathome",
        "body": "V, MA. Two behemoths from the financial technologies sector. Phenomenal duopolies with no immediate competitors. With infrastructures that process hundreds of millions of transactions per day, the world would stop if they go out even briefly.",
        "created_utc": 1596424610,
        "id": "g0676bq",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1596453410.0
    },
    {
        "author": "ThatOneDrunkUncle",
        "body": "Northeast gonna have an outbreak again. Seeing tons of people w/o masks in MA, RI, and NY. Cases already spiking on cape cod again",
        "created_utc": 1596392585,
        "id": "g04l19m",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596421385.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "wtf just saw brk.b stock. yall sleeping on ma nibba buffett. this brkb graph is so fucking sexy wtf.  better yet look at the iv on the options. insanely low IV. potential for 10 baggers every week just by holding weeklies\n\nedit: dont even get me started on that brk.a graph! wow!!!! BRK.A to 1 million eoy",
        "created_utc": 1596834475,
        "id": "g0q13ts",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596863275.0
    },
    {
        "author": "bukakeparty69",
        "body": "I gotta wear shades inside. Because ma future’s too bright",
        "created_utc": 1598463563,
        "id": "g2xjnr7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1598492363.0
    },
    {
        "author": "akshayeb82",
        "body": "1. Amazon: No guesses why\n2. Facebook\n3. Plug: Forget electric, hydrogen cells are the future\n4. Walmart: Only challenger to Amazon\n5. Paypal, Visa, Mastercard",
        "created_utc": 1596594583,
        "id": "g0ejc50",
        "score": 6,
        "subreddit": "stocks",
        "created": 1596623383.0
    },
    {
        "author": "LordofTendiez",
        "body": "CHINA CENTRAL BANK ADVISER MA JUN SAYS EXPECTS CHINA'S ECONOMY TO GROW AROUND 2% IN 2020 - LOCAL MEDIA\n\nThis might be the last time we hear from this guy? 😵\n\nLast time CCP said their GDP growth gonna be 5%-6% this year despite coronavirus and the recession.",
        "created_utc": 1596611911,
        "id": "g0f6dmr",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596640711.0
    },
    {
        "author": "hamhamhammyham",
        "body": "My mom says I'm a bird in. I ask \"a bird in what ma? What?\" But she just hits me. I always wonder...am I a bird in a tree..or a bird in a plane? That would be cool",
        "created_utc": 1598116700,
        "id": "g2hrhte",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1598145500.0
    },
    {
        "author": "juancuneo",
        "body": "When I was 20 I received 5k from an insurance settlement. It was 2002 and I bought apple. No joke. Today my portfolio is worth 500k. All from that initial investment (I sold over time and bought other things I thought would do well). For example 5k in Amazon is now 100. Like 4K in MasterCard is like 60 today. Pretty crazy. I just ask myself “will this company still probably be here and doing well in 20 years?” If I lose visibility I sell. For example, I did well with Tata motors after I saw their cars and trucks all over the developing world. But once I stopped going to those regions I felt I had less visibility into the product and sold.",
        "created_utc": 1598461133,
        "id": "g2xefie",
        "score": 6,
        "subreddit": "investing",
        "created": 1598489933.0
    },
    {
        "author": "RPMayhem",
        "body": "Moscow Exchange to offer trading in U.S. blue chips from Aug. 24\n\nMOSCOW, Aug 17 (Reuters) - The Moscow Exchange will launch trading of the 19 most liquid shares from the U.S. S&amp;P 500 index on Aug. 24, the bourse said on Monday.\n\nThe exchange will offer shares in Microsoft Corp, Amazon.com Inc, NVIDIA Corp, McDonald's Corp , Facebook Inc, Twitter Inc, Alphabet Inc , Exxon Mobil Corp, Boeing Co, Intel Corp, AT&amp;T Inc, Pfizer Inc, Visa Inc , Netflix Inc, Micron Technology Inc, Activision Blizzard Inc, Walt Disney Co, Advance Micro Devices Inc and Mastercard Inc.\n\nApple in Sept.\n\nLegit calls on all of these for the soviet vodka fueled second leg up",
        "created_utc": 1597952793,
        "id": "g28xryi",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597981593.0
    },
    {
        "author": "Waffle_Authority",
        "body": "Well most people here have other jobs and don’t depend on this to survive. So if I make a grand every time I make a trade, that’s pretty good supplemental income. \n\n\nCurrently up $8680 on AAPL 415c 9/18, up $3700 on LOW 160c 10/16, and $1361 on MA 345c 1/15/21. \n\nPretty good for a guy earning under a  100k salary.",
        "created_utc": 1598475243,
        "id": "g2y9fhd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598504043.0
    },
    {
        "author": "NormButler",
        "body": "I was really hoping to hear, \"and now, we have.. ma... uhh... dhsmatt2... from... Wall street bets?!\" during Q/A on the earnings call.",
        "created_utc": 1597369076,
        "id": "g1e8tfa",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597397876.0
    },
    {
        "author": "letMeinuwb",
        "body": "rooting for u ma man",
        "created_utc": 1597351516,
        "id": "g1dacs1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1597380316.0
    },
    {
        "author": "PhantomChihuahua",
        "body": "Which stonk is gooder — Visa or MasterCard???????",
        "created_utc": 1597171424,
        "id": "g14n2er",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597200224.0
    },
    {
        "author": "RedBull2408",
        "body": "Ma man. I’m ripped af. Will probably just go perma high this weekend\n\nEDIT: maybe drop some K too 🤪",
        "created_utc": 1597449452,
        "id": "g1i1neo",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597478252.0
    },
    {
        "author": "somnitendy",
        "body": "So now Boomer database want to buyz tikkietok? Ma..!!",
        "created_utc": 1597721071,
        "id": "g1y1njj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1597749871.0
    },
    {
        "author": "SixOneFive615",
        "body": "Been holding a BABA option for 2 months. Almost sold after the post earnings drop yesterday, but held and am now finally starting to see some payoff. \n\nJack Ma fucks.",
        "created_utc": 1598041410,
        "id": "g2d2vwh",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598070210.0
    },
    {
        "author": "Shaun8030",
        "body": "Good move little late but long term you are good.  Even if faamgm adbe Nvidia , sq , PayPal , Tsla ,  ma, v,  semiconductors , software/cloud stocks drop 50 percent you won't be bag holding for long (like REITs , banks , energy , utilities ) the recovery will be rapid and robust in comparison to the broader market . The new reality is tech is a  defensive sector during uncertain times, March Covid crash and subsequent recovery made this very apparent . The bubble has survived  and thrived despite two crashes in the last 3 years Dec 2018 (25 percent down ) and March 2020 (35 percent down ). I just kept buying throughout and sold nothing , turned out great. Closing in on 200 percent return over 5 years.",
        "created_utc": 1597961010,
        "id": "g29guin",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1597989810.0
    },
    {
        "author": "beyonddisbelief",
        "body": "There are a lot of differen't opinions on this thread but most of the strongest voices here seem to have a one-track mind and look at the market as black and white, when nothing is ever so simple.\n\nTo make a proper speculation it's really important to fully understand what's going on and what makes up the economy and Macroeconomics 101, and I can't emphasize the latter enough because every bull who thinks their bull stocks will keep growing in perpetuity assumes those companies exists in a vacuum and nothing negative in the broader economy will come back to bite them in the ass.\n\nSome TL;DR points:\n\n1. **We are absolutely in a bubble.**\n\n\\- Just look at PE ratios, overall economic sentiments, there is zero reason in a value-based investment that we are hitting all-time highs.\n\n**2) A bubble is not going to burst without not even just one event, but a cascade of events.**\n\n\\- Look at DotCom and 2008 financial crisis. The triggering effect was a big ripple from a cascade of events that were for one reason or another bound to happen.\n\n**3) You can't predict when the bubble will burst.**\n\n\\- Just not happening. It comes down to your level of risk tolerance, how you diversify your portfolio so that when it does it, that portfolio will recover just as most people did in March.\n\n**4) Wall Street is not Main Street.**\n\n\\- Though I primarily subscribe to Mohamed El-Erian, to quote/paraphrase Bill Ackman, \"Wall Street may be hitting all-time highs. However, if you create an index for Main Street, it is down 80%.\"\n\nAccording to the SBA, 99.7% of the US comprise of small businesses. Most of these will not be listed on the stock market.\n\nThe best indicators you can get is probably look at commercial rental properties.\n\n**5) Wall Street indices/indicators are mostly comprise of top performers who are at least in part digital and all globalized. This is not representative of even established small corporations.**\n\n\\- Even if you were to focus on Dow Jones and S&amp;P etc. solely, you are not getting a full picture.\n\n&amp;#x200B;\n\n\\-------\n\nMy thoughts on the disconnect between the stock market and sentiments:\n\n1. **Macroeconomic effects takes time to materialize.**\n\n1a) With or without stimulus checks, most people have some level of reserves. Even those living paycheck to paycheck, they can get creative, and the quarantine itself creates more ways to save on expenses. I'm sure a lot of people are also working with their landlords to weather through the pandemic. Smart landlords know that even if they are unhappy with it, 1) They're not likely to be able to find new tenants during this time 2) Even if they really wanted to evict, that process may be a serious PITA because of the pandemic.\n\nIt's only been 6 months. If those reserves and creativity are to dry up, we'll see it in the next 6 months. The past 6 is not a good indicator of anything at all.\n\n1b) Small Businesses, PPP, or responsible ma &amp; pa stores or what have you probably tried their best to take care of their businesses and employees the past 6 months mitigating the larger effects of unemployment. Sure, the economy is \"opening up\", but retail consumers have not come back. The new equilibrium has changed and the cascading effects has yet to be seen.\n\n1c) Only after busineses go through a full finacial cycle or exhaust their reserves will you see mass layoffs, in turn means people can't pay, which in turn means other businesses will receive less revenue because of lack of spending, and the spiral continues.\n\nTHIS is the real macroeconomic effect. This happens at scale and takes time. 6 months is absolutely nothing at the macro scale.\n\nThink about it, at the macroeconomic scale it doesn't matter if a few businesses are thriving. If the rest of the economy is failing, people have no money to spend on the big businesses. This is a huge ticking time bomb you will not see on the stock market \\*now\\* but it will be felt later.\n\n&amp;#x200B;\n\n**2) The Stock Market is being propped up by more than the Fed**\n\n2a) One hugely significant thing people are not talking about is toward the end of 2019 all major brokerages eliminated the commission fees for stock trading. This HUGELY increased money velocity on the stock market because there's no perceived costs or barrier to entry to trade. When you rapidly trade stocks between people the slightest positive outlook will lead to much more rapid growth, even if you assume only existing participants are trading.\n\nBut that's not all, retail investors exploded BECAUSE it costs nothing to trade. They may had been hesitant and sat in the sidelines in the past, but where value-investors are hoarding cash? These formerly sidelined retail investors/non-investors are pouring in, their cash contribution easily rivals what cash previously taken out.\n\n2b) The Stimulus packages are being thrown into the stock market rather than the economy.\n\nThe stimulus packages came in too early for most people who had no fear of their job security (yet) and had not felt the squeeze in their usual spending. It was not selective enough so many middle class and those in hi-tech just wound up with money they didn't know what to do with. With extra cash on hand they bid the stock market because that's what everyon'es doing, right?\n\nThis is latently harmful to the macroeconomy, because bidding up stock prices doesn't inherently produce value, its actually spending them on the economy that does.\n\n2c) Rise of retail investors\n\nWith no where to go, people who normally have budget for travel or casinos, or other forms of social activities/make-up etc. that don't make sense in the social distancing era they move their money into \\*drumroll\\* stock market, rather than purchase alternative consumer goods.\n\nAgain, like 2b with the stimulus checks, this inflates the stock price but does not produce economic value. While the US economy is in a deflationary period, the stock market is absolutely in an inflationary period. No wonder Berkshire Hathaway who swore off gold decided to buy gold.",
        "created_utc": 1598300485,
        "id": "g2q81y4",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1598329285.0
    },
    {
        "author": "JKK201519",
        "body": "BIGC is the next Shopify but better. When you are Shopify but focus on enterprises and corporations vs ma and pa’s you’re the big beef cake of e-commerce. This deal today just solidifies my long term play on them. Granted I was down some.. had a great initial buy in but FOMO and my research told me get in and bought more around $99. I’m over even now though and loving this. To the fucking moon!",
        "created_utc": 1598374366,
        "id": "g2tgt37",
        "score": 4,
        "subreddit": "stocks",
        "created": 1598403166.0
    },
    {
        "author": "obiwang",
        "body": "Holy shit MA.",
        "created_utc": 1596642577,
        "id": "g0gfw6x",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596671377.0
    },
    {
        "author": "Shaun8030",
        "body": "No rational simple portfolio of large cap tech and fintech  MSFT , amazon , apple , goog, FB , sq , adbe , v , PayPal , ma , Nvidia , amd , tesla and shop will destroy any sector ETF , geographic etf or all in one ETF.  Just requires effort to buy each stock regularly . Comissions suck but I buy lump sums atleast 5 or 6k usd at a time and convert  via norberts gambit . Closing in on 200 percent return since 2016 .  People are too risk averse or scared to convert usd or have been programmed to follow the couch potato or Canadian dividend  boomer stock  cult . Tech is now a defensive sector there is volatility but long term I don't see the risk , we are not talking about penny stocks or pump and dumps but trillion dollar mega cap blue chip companies.",
        "created_utc": 1597962004,
        "id": "g29ittk",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1597990804.0
    },
    {
        "author": "lol558237",
        "body": " https://imgur.com/gallery/OsaDbYT\n\nTake profits on mastercard? I literally bought it half a month ago lol",
        "created_utc": 1598633393,
        "id": "g35fwx1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598662193.0
    },
    {
        "author": "ai89",
        "body": "GET DEM PAPER HANDS OUT MA FACE HOMIE I AINT SELL YET",
        "created_utc": 1598544680,
        "id": "g319sc1",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1598573480.0
    },
    {
        "author": "Infamous-Sheepherder",
        "body": "Uber eats and eating out celebrating that quarantine over did a number on ma stacks",
        "created_utc": 1596266144,
        "id": "fzypouv",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596294944.0
    },
    {
        "author": "oorakhhye",
        "body": "[It’s speculated]( https://www.voanews.com/east-asia-pacific/have-retired-jack-ma-alibaba-steered-away-china-communist-partys-clutches ) that Jack Ma stepped down as CEO because the party wanted to take over.",
        "created_utc": 1596486134,
        "id": "g0943ql",
        "score": 4,
        "subreddit": "investing",
        "created": 1596514934.0
    },
    {
        "author": "RPMayhem",
        "body": " Moscow Exchange to offer trading in U.S. blue chips from Aug. 24\n\nMOSCOW, Aug 17 (Reuters) - The Moscow Exchange will launch trading of the 19 most liquid shares from the U.S. S&amp;P 500 index on Aug. 24, the bourse said on Monday.\n\nThe exchange had earlier planned to offer trading in U.S. blue chips from Aug. 17, in a breakthrough for a long-awaited project which was slowed by Western sanctions.\n\nThe exchange will offer shares in Microsoft Corp, Amazon.com Inc, NVIDIA Corp, McDonald's Corp , Facebook Inc, Twitter Inc, Alphabet Inc , Exxon Mobil Corp, Boeing Co, Intel Corp, AT&amp;T Inc, Pfizer Inc, Visa Inc , Netflix Inc, Micron Technology Inc, Activision Blizzard Inc, Walt Disney Co, Advance Micro Devices Inc and Mastercard Inc.\n\nThe Moscow Exchange will also start trading Apple Inc shares on Sept. 7.\n\nRussia's largest bourse has said it will add more names from the S&amp;P 500 later this year, planning to trade the stocks in Russian roubles. (Reporting by Andrey Ostroukh and Elena Fabrichnaya; Editing by Mark Potter) Get ready for the putin pumps to combo with our trump pumps. That man knows money is power and has a ton of money so why not buy power via the stock market. Im ok with them buying at this price. Currently buying the ones I think are easily said in Russian. Micron, Exxon, NVDIA, TESLA",
        "created_utc": 1597989761,
        "id": "g2atov8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598018561.0
    },
    {
        "author": "smoothtrex",
        "body": "Curious to hear on the call tomorrow how much of Cash App's out-performance they attribute to consumer stimulus payments. I think its going to be a lot, but then again those customers will probably stick around and become long term customers to the platform. I think the seller business did ok relative to GDP and US card spend numbers from visa/mastercard but nothing to get too excited over. The stock seems to be pretty much all driven by Cash App metrics these days",
        "created_utc": 1596593461,
        "id": "g0ehhup",
        "score": 3,
        "subreddit": "stocks",
        "created": 1596622261.0
    },
    {
        "author": "Wild_Cat_Cory",
        "body": "Everyone tends to tell newbies to put money into ETF’s (like VTI , SPY, QQQ,....)\nIf your looking for long term single stocks, it’s hard to go past MSFT, AAPL , AMZN, WMT, WM , V or MA.\nThese are solid stocks with decent long term outlooks.\n\n(But as most will tell you, it’s always a good idea to do your own research and don’t rely completely on any one persons suggestions)",
        "created_utc": 1596665344,
        "id": "g0hsyzj",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1596694144.0
    },
    {
        "author": "FrancisCharlesBacon",
        "body": "CNBC bullish on SLV. Still above 50 and 100 MA.",
        "created_utc": 1597181211,
        "id": "g158p7t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597210011.0
    },
    {
        "author": "confused_teabagger",
        "body": "AMEX breh, it is a pleasure to use.\n\nVisa and Mastercard make money by taking advantage of the poors.",
        "created_utc": 1597171604,
        "id": "g14nfyv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597200404.0
    },
    {
        "author": "lol558237",
        "body": "Thank god my portfolio is all in mastercard calls",
        "created_utc": 1597175496,
        "id": "g14vwtg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597204296.0
    },
    {
        "author": "KimJongUnsTrousers",
        "body": "Boom-na-da-noom-na-na-NE-MA! Go! ~Korn 1998",
        "created_utc": 1597210418,
        "id": "g16qghb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597239218.0
    },
    {
        "author": "Ignignokt13",
        "body": "You guys need to do better lol, that article is sketchy to say the least.\n\n\n\" He was beaten up on the spot and embarrassed by the special police. He revealed everything in the interrogation room, including what the Jiang family and Jack Ma asked him to do overseas. He is currently on medical parole because of his heart condition. Bruno Wu sold out a lot of people, which is very lethal to the elites in financial, performing arts and film circles. \"",
        "created_utc": 1597330543,
        "id": "g1bzyy5",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1597359343.0
    },
    {
        "author": "BubbyginkESO",
        "body": "My understanding is the Square wants to position itself as a sort of complete ecosystem for a cashless/cardless society. It certainly has tons of competitors for this but IMO its advantage lies in the fact that nobody else has such wide spread POS capabilities AND a popular payment app (Cash App). As you mention, Square is also trying to become a bank and I am sure they will eventually offer a brokerage option on their app - imagine a Robinhood app only people can also instantly send and receive money from their account and use it to make payments to merchants - this IMO is the end game.\n\n\nSo the goal is to eliminate the need for using any other financial app or service, any paper money, and even physical cards whatsoever. You pay businesses directly to their POS device from your Cash App, you send and receive money to friends with Cash App, your account with Cash App has brokerage capabilities so you invest your money in it (maybe you open an IRA on there too), if you need a loan you get one directly from the Cash App, if you need credit instead of having a credit \"card\" you just have a line of credit you can spend from the Cash App directly to merchants or friends, and so on - complete and seamless integration of everything into one app.\n\n\nAgain, back to Square's big advantage - they already have an app and it is widely used AND they have a big POS presence. Obviously V/MA have a huge POS presence but they have no wildly popular app to integrate with. Paypal has Venmo and is very well integrated online but they don't really have much POS capability that I know of - can you pay at many physical locations via paypal? Maybe you can and I am just unaware. But Square is used by tons of merchants for payment all over and the Cash App is getting even more popular. Nobody else has these two key advantages. So if Square can add brokerage and banking capabilities to the Cash App and if direct payments from the Cash App to merchants takes off (in place of using cash/cards) then I think it can really take off.",
        "created_utc": 1596762442,
        "id": "g0mlid4",
        "score": 3,
        "subreddit": "stocks",
        "created": 1596791242.0
    },
    {
        "author": "HTleo",
        "body": "Slow bleed. Post earnings will fall to 50 day MA of $19. Shit cash flows.",
        "created_utc": 1596831565,
        "id": "g0pv166",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596860365.0
    },
    {
        "author": "starbolin",
        "body": "It takes quite a bit of discipline.   You need to have a system to pick entries.  I start by looking at macros/sectors. I want the whole sector going in the direction I think the stock is going. Then drill down to price action.  Look at varied chart periods.   It doesn't hurt to have a few indicators MA, MACD and etc.   I don't trade on the indicators but I use them as a reality check.   \n\nBe very mindful of volatility.  Staying out when volatility is low is key.  If the volatility rises after you enter then you get killed on the spread.   I am liking TastyWork's IV Ratio metric more and more and  watch it like a hawk.   Once I think I have found a bottom or a top then I look at the candlestick wicks.  I'm looking for multiple failed moves in one direction.  If I am unsure the stock has found a bottom/top then I look at the time-sales and try to build a narrative in my head as to who is buying/selling.   \n\nThe overall key is to cut down on your entries. You are looking for reasons not to do the trade. A few really good entries will beat a larger number of mixed quality entries.",
        "created_utc": 1597457240,
        "id": "g1ife5z",
        "score": 3,
        "subreddit": "options",
        "created": 1597486040.0
    },
    {
        "author": "haasvacado",
        "body": "*I just wan do hood rat stuff wit ma friends*",
        "created_utc": 1597853909,
        "id": "g246fiz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597882709.0
    },
    {
        "author": "Bxdwfl",
        "body": "mastercard, daddy's choice for his becky",
        "created_utc": 1598562422,
        "id": "g32d502",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598591222.0
    },
    {
        "author": "c4meron_",
        "body": "A blue chip stock has the following characteristics:\n\nThe company is a leader in both market capitalization within its sector, its country and in its business segment.\n\nThe company will often have products that are well-known to everyone and established within the household.\n\nI would think visa and MasterCard are blue chip stocks",
        "created_utc": 1598743546,
        "id": "g3aqo2k",
        "score": 3,
        "subreddit": "stocks",
        "created": 1598772346.0
    },
    {
        "author": "UTV_",
        "body": "mastercard",
        "created_utc": 1598820794,
        "id": "g3eb4e9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598849594.0
    },
    {
        "author": "cameron747",
        "body": "Anyone know why visa and MasterCard dropped today?",
        "created_utc": 1598902013,
        "id": "g3i7nn3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598930813.0
    },
    {
        "author": "atktitan",
        "body": "Seriously thinking about getting a GoldMoney 18k gold mastercard and load up mostly in to physical gold.",
        "created_utc": 1596576126,
        "id": "g0dllj7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596604926.0
    },
    {
        "author": "ketozaa",
        "body": "‪it pays to rip off merchants by exploiting a loophole in the Durbin Amendment to charge excessive debit interchange fees. Hi SQ and PYPL. \n\n‪Durbin seems to realize his amendment needs to be amended again...regularity risk is huge https://www.wsj.com/articles/visa-mastercard-debit-fees-are-hurting-retailers-sen-richard-durbin-says-11595669401‬",
        "created_utc": 1596594103,
        "id": "g0eijwq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596622903.0
    },
    {
        "author": "Polysorbate800",
        "body": "Bounced off the 100 day MA, that's bullish",
        "created_utc": 1596476379,
        "id": "g08efo4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596505179.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "U playing with ma cock",
        "created_utc": 1597547775,
        "id": "g1p9io5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597576575.0
    },
    {
        "author": "drewthegoat3",
        "body": "Anybody playing V or MA?",
        "created_utc": 1597782237,
        "id": "g210fnd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597811037.0
    },
    {
        "author": "JefBezosExWifesNewBF",
        "body": "Jack Ma look like Gollum",
        "created_utc": 1597783001,
        "id": "g212541",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597811801.0
    },
    {
        "author": "stonkpicks",
        "body": "BABA was doing so well until Jack Ma sold his shit. Has been flat / down since then.",
        "created_utc": 1597960228,
        "id": "g29f7fo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597989028.0
    },
    {
        "author": "Khanfushus",
        "body": "The only expectation that I've had is that it not go below the 200 MA, and it's done just that. I'm holding based off fundamentals and Chan's record, but just based on basic T/A, I think we're going to get some green candles very soon.\n\nThe daily chart looks great. There's been a bullish trend since May. A golden cross is impending. The 200 MA is providing great support. RSI is very low. Day traders may hate this POS, but I only see positive data for swing traders and longs. Looking forward to see how the 50 MA can help us post golden cross.",
        "created_utc": 1598381974,
        "id": "g2tx0ox",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1598410774.0
    },
    {
        "author": "Shaun8030",
        "body": "Love fintech own them all v , ma , sq and PayPal",
        "created_utc": 1598397022,
        "id": "g2uqwqd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1598425822.0
    },
    {
        "author": "GuaranteedForecast",
        "body": "NVDA, TSLA, AMZN, GOOG, BABA, AMD, PYPL, WMT, TGT, SBUX, FB, DIS, LOW, V, MA, AXP, MCD, HD, SNE, EA, W, SHOP, ADBE, CMG, JNJ, ORCL, NKE, CSCO, CZR, SE, MRNA, LVGO, FVRR, LULU, PG, EBAY, SAM, MAR, HSY, MTCH",
        "created_utc": 1598483230,
        "id": "g2yppol",
        "score": 3,
        "subreddit": "stocks",
        "created": 1598512030.0
    },
    {
        "author": "redmartian1",
        "body": "&gt; and crypto you will understand that all are valid asset to protect your money. \n\nyup just buy crypto it's just like metals\n\n&amp;#x200B;\n\n[Bitcoin](https://en.wikipedia.org/wiki/Bitcoin) has been characterized as a [speculative bubble](https://en.wikipedia.org/wiki/Speculative_bubble) by eight [winners of the Nobel Memorial Prize in Economic Sciences](https://en.wikipedia.org/wiki/List_of_Nobel_Memorial_Prize_laureates_in_Economics): [Paul Krugman](https://en.wikipedia.org/wiki/Paul_Krugman),[\\[7\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-Krugman-7) [Robert J. Shiller](https://en.wikipedia.org/wiki/Robert_J._Shiller),[\\[8\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-Shiller_2014-8) [Joseph Stiglitz](https://en.wikipedia.org/wiki/Joseph_Stiglitz),[\\[9\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-Stiglitz-9) [Richard Thaler](https://en.wikipedia.org/wiki/Richard_Thaler),[\\[10\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-Thaler-10) [James Heckman](https://en.wikipedia.org/wiki/James_Heckman),[\\[11\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-4Nobels-11) [Thomas Sargent](https://en.wikipedia.org/wiki/Thomas_Sargent),[\\[11\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-4Nobels-11) [Angus Deaton](https://en.wikipedia.org/wiki/Angus_Deaton),[\\[11\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-4Nobels-11) and [Oliver Hart](https://en.wikipedia.org/wiki/Oliver_Hart_(economist));[\\[11\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-4Nobels-11) and by central bank officials including [Alan Greenspan](https://en.wikipedia.org/wiki/Alan_Greenspan),[\\[12\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-Kearns-12) [Agustín Carstens](https://en.wikipedia.org/wiki/Agust%C3%ADn_Carstens),[\\[13\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-Carstens-13) [Vítor Constâncio](https://en.wikipedia.org/wiki/V%C3%ADtor_Const%C3%A2ncio),[\\[14\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-Constancio-14) and [Nout Wellink](https://en.wikipedia.org/wiki/Nout_Wellink).[\\[15\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-tulip_mania-15)\n\nThe investors [Warren Buffett](https://en.wikipedia.org/wiki/Warren_Buffett) and [George Soros](https://en.wikipedia.org/wiki/George_Soros) have respectively characterized it as a \"mirage\"[\\[16\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-16) and a \"bubble\";[\\[17\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-GnMSoros-17) while the business executives [Jack Ma](https://en.wikipedia.org/wiki/Jack_Ma) and [Jamie Dimon](https://en.wikipedia.org/wiki/Jamie_Dimon) have called it a \"bubble\"[\\[18\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-Yang_Ma-18) and a \"fraud\",[\\[19\\]](https://en.wikipedia.org/wiki/Cryptocurrency_bubble#cite_note-Buffet_and_Dimon-19) respectively.",
        "created_utc": 1596396542,
        "id": "g04touy",
        "score": 3,
        "subreddit": "investing",
        "created": 1596425342.0
    },
    {
        "author": "StupidsexyFland3rs",
        "body": "MasterCard",
        "created_utc": 1596499214,
        "id": "g09u68r",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1596528014.0
    },
    {
        "author": "jkhristov13",
        "body": "A few things that I see different. While the big tech companies have the capability to do get into this market, I do not see them pursuing a financial venture  like this,  especially capital lending. I can see the same with Visa and Mastercard feeling the same.\n\nAlso regarding visa and Mastercard,  they are payment processors,  they do not hold any of the risk since they are not the lenders. Again, not really their business motto.\n\nAs far as Cash App, a lot of the younger people I ha e talked with prefer to use the app instead of opening up a regular bank account.\n\nI think we also have to consider the international markets. While our banking system in the U.S. is great, other countries don't have access to great banks. Also, lot of cash counterfeiting and enormous banking fees. I believe the market distrubtion SQ will have outside of the U.S. will be huge.\n\nI am long SQ and my bigger concern is PayPal coming into the space. Even then, the market is large enough for more than one player.  Just like Apple iPhones and Samsung, or Facebook and Google for ad revenue.  I believe SQ has a great future and have been executing perfectly. \n\nI might be wrong, but this has just been my thoughts on it.",
        "created_utc": 1596761207,
        "id": "g0mjcgd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1596790007.0
    },
    {
        "author": "Xbsnguy",
        "body": "Du ma me",
        "created_utc": 1596753767,
        "id": "g0m5yea",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596782567.0
    },
    {
        "author": "alohaclaude",
        "body": "When the pimp's in the crib ma",
        "created_utc": 1597393078,
        "id": "g1f70pb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597421878.0
    },
    {
        "author": "Riblas",
        "body": "Hows this for some TA.  It's been under the 200d MA for most of the last 9 years.\n\n# BUT. It gets pumped every Summer and then dips.  It hasn't been pumped yet.",
        "created_utc": 1597177103,
        "id": "g14zeqw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597205903.0
    },
    {
        "author": "mulemoment",
        "body": "The reason most people can't trade profitably is that they don't have the time to learn TA and watch for good breakouts. For most people, buying and holding diversified funds and not worrying about TA is the best strategy.\n\nIf you want to stock pick, it would be good to learn basic TA like resistance levels so that you can estimate good entries and stop losses, but focus on fundamental factors.\n\nFor example, TA tells me that Amazon will have a good week next week, but only if the stock market holds up. If the entire market crashes because of some political issue, Amazon's breakout will fail. These additional concerns mean that you have to be able to pay attention to your portfolio at all times with TA. \n\nIf you invest fundamentally, you can just say you think Amazon is a good company and want to buy in and hold. With basic technical analysis, you can protect yourself from a major drop by setting a stop loss at slightly below the 50 or 200 MA (notice how [in its chart since March](https://imgur.com/I68sC2X), Amazon has never dropped below the green 50 MA line. Something big would have to happen for it to drop to the orange 200 MA line or lower). This is a lot less stress!\n\nAnd for even less stress, and the best strategy for most people, just buy and hold diversified funds so that you don't have to worry about this at all.",
        "created_utc": 1598114038,
        "id": "g2hm41o",
        "score": 3,
        "subreddit": "investing",
        "created": 1598142838.0
    },
    {
        "author": "InvestmentActuary",
        "body": "Plaus-ma",
        "created_utc": 1598218752,
        "id": "g2mlny9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598247552.0
    },
    {
        "author": "CptTonyStark",
        "body": "Pit ma balls",
        "created_utc": 1598209024,
        "id": "g2m2ddz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598237824.0
    },
    {
        "author": "Krusher4Lyfe",
        "body": "I don’t understand how SQ has a multiple way higher than established payment processing like V and MA as well as banks and creditors. Maybe I’m unimaginative but I don’t see how they change the game",
        "created_utc": 1598230445,
        "id": "g2n7c2c",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598259245.0
    },
    {
        "author": "EQRLZ",
        "body": "Just cash advance your Visa and MasterCard and long call both",
        "created_utc": 1597986235,
        "id": "g2apbeu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598015035.0
    },
    {
        "author": "romxii",
        "body": "Since P/E ratios are fucked and some companies are running at a deficit, you can look at Price to Sales TTM (trailing twelve month).\n\nWhen comparing P/S ratio, try to use comparable companies in similar industries/sectors, geographies, margins, etc. \n\nIf a company does many things, like a conglomerate or say Amazon, it becomes more art than a science.\n\n&amp;#x200B;\n\nDo note that ratios aren't perfect since companies have different capital structures, margins, CAPEX/working capital requirements, and tax treatments.\n\n&amp;#x200B;\n\nSQ is has a price to sales of 10.6 , not outrageous for a tech/fintech/payments company (MSFT and FB are at 11 and 10 respectively, V and MA at 19 and 20 respectively, PYPL at 11.9) \n\nTSLA is at 13 ish price to sales, in comparison Toyota is at a whopping 0.7, GM at 0.3, F at 0.2, Daimler at 0.3, VWAGY at 0.36. \n\nZM at 87, the most retarded ratio of all.\n\nAMD at 13. INTC is at 2.65, NVDA at 24.43, MU at 2.54, AVGO at 4.1, QCOM at 2.39, MCHP at 4.91.\n\nShopify at 58, second in retard strength only to ZM. EBAY is at 3.76, AMZN at 4.97. \n\nAAPL at 7.3\n\nAmazon is at 4.98. Amazon touches multiple sectors and is a monster/star company, yet still doesnt hit TSLA's multiple, make of it what you want.\n\n&amp;#x200B;\n\nSPCE, the king of all retards, with a ratio of 5122.\n\nYes I am aware valuations are about future value etc, enjoy your 5000+ P/S ratio.",
        "created_utc": 1597730439,
        "id": "g1yezrj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1597759239.0
    },
    {
        "author": "cardinalblack",
        "body": "Jack Ma is my new baba",
        "created_utc": 1598471058,
        "id": "g2y07co",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598499858.0
    },
    {
        "author": "yukinara",
        "body": "While i do try to be funny there are still some kernel of truth here.\n\nWhen you invest in stock you have no clue if a stock will perform as you want. So you look at the memes to see which one is popular and go from there. Popular stocks are the ones being pushed at the moment so there are other investors out there putting stakes into the companies too. Of course it's dumb to base off your whole investment strategy on that but it helps to start somewhere.\n\nYou can also invest in safe blue chip stocks that you see people use their products daily: amd, nvda, appl, msft, adbe, v, ma etc. Most of the time you wont go wrong because they're all solid.",
        "created_utc": 1596480577,
        "id": "g08qfeq",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1596509377.0
    },
    {
        "author": "kfuzion",
        "body": "Payment processors skim a percentage off every transaction with minimal overhead and insane profit margins. It's to the point where Visa and Mastercard buy out fintechs to keep their market share. \n\nLike,  suppose you could get mom and pop restaurants to switch to your startup for payments, and you take 1% of Visa's multi billion dollar business.  Billion dollar company just like that.  Now you threaten to take 10% of their business,  even if you're not turning a profit... multi billion dollar company.",
        "created_utc": 1596397216,
        "id": "g04v31c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596426016.0
    },
    {
        "author": "ixamnis",
        "body": "Outside of Technology: \n\nABBV, CPB, AES, CLX, DIS, JNJ, JPM, KR, KO, MMM, NVS, O, PEP, PLAY, SBUX, T, TD, V, MA, TROW, WSM, WMT",
        "created_utc": 1596569349,
        "id": "g0d4jmw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596598149.0
    },
    {
        "author": "DenDanny",
        "body": "I think Intel will be fine in the long term. There is room for both AMD and Intel imo.\n\nBut right now, INTC is severely undervalued. It is still a business with big earnings that keeps increasing every year and they have large cash reserves. \n\nPE is at about 9 right now, which is a steal. The price has also bounced at some key technical support levels, like the 2020 March lows and 200 week MA, and 50 month MA. \n\nI would say it is a pretty safe pick right now, with a lot of room to go up.\nI picked up a lot of shares on friday and monday.",
        "created_utc": 1596564905,
        "id": "g0csnda",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596593705.0
    },
    {
        "author": "timeisadrug",
        "body": "What's the subreddit that you're talking about? \n\nAlso, what do you mean when you say 50 MA? I'm really new to investing, I've only been doing it a couple weeks, so I'm sorry to bother you",
        "created_utc": 1596603173,
        "id": "g0ewein",
        "score": 2,
        "subreddit": "smallstreetbets",
        "created": 1596631973.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Why would you donate plaus-ma when you could sell it to celebrity types like Tom Hanks for like $5,000/pull ? (I know Tom Hanks recovered already, key word is *LIKE*)",
        "created_utc": 1596491867,
        "id": "g09g1jm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596520667.0
    },
    {
        "author": "KyFly1",
        "body": "I hadn’t looked at this since the dump but I’m glad you posted this b/ this looks awesome. The dump took it to the 200w ma and it’s likely bottomed. This thing has respected the 200w and bounced off it hard for the past 10 years. \n\nI think I’m going chunky on some 10/13 60c and I’ll roll them back to November once those are available in order to run into (and potentially through) earnings.",
        "created_utc": 1596497538,
        "id": "g09r2h6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596526338.0
    },
    {
        "author": "eyebeeleaf",
        "body": "What technical tools you fags use other than bollinger band, MA, Fibonacci, RSI, EMA?",
        "created_utc": 1597123710,
        "id": "g12oqw4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597152510.0
    },
    {
        "author": "ScopePerspective",
        "body": "they won't give up the senate seat, even though MA would surely continue to send Dems to congress\n\nIt's kamala, in my opinion\n\nnote, everything in market would be down if Warren was picked, though I can't explain why, because she can do more damage in the senate anyways",
        "created_utc": 1597176553,
        "id": "g14y7zy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597205353.0
    },
    {
        "author": "winter32842",
        "body": "I am in the red but these are my stocks that were in green (most green to least green): PAC, JPM, FRO, SPG, QCOM, NET, MA, AYX, DKNG, DAL, VMC, LUV, STZ, V, ABBV, NLY, RTX and BRKB.",
        "created_utc": 1597201093,
        "id": "g16c8r0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1597229893.0
    },
    {
        "author": "Packletico",
        "body": " 1x WMT 10/16 $140c  wont work for the following reasons:  \n1. Long team MA moved below the medium term MA, signaling a downtrend and the short team MA has already passed through.  \n2. Resistance formed at 133$ and it has now failed a 3rd time to break through.  \nFailed on the 4/20 (lol) and between the 7/13 and 7/20 numerous times.  \n3. WMT+ has been delayed for so long, and got delayed again.. Potential lack of stimulus bill or atleast sharp decline in the money to the lower class will definantly make them be less frivolous at walmart spending their few cash..  \n4. Volumes have decreased and MACD has crossed on the downwards trend.  \n5. Finally... It may seem like a joke, but its the most imporant part...  \nI have WMT call! And if it wasnt because its already bleed so hard that i might as well let it burn out, i'd say i jinxed that call before it even had a chance!  \n\n\nNo but really.. i hope your calls play out, dont base your desicions on mad rambelings of a soar loser like me. Selling before earnings? VERY Good idea, dont hold through, even on the off chance something might explode. Get that IV to work for you! I might suggest switching to spreads if your account is small since theta wont be as big of a problem.",
        "created_utc": 1596919877,
        "id": "g0tpcw9",
        "score": 2,
        "subreddit": "options",
        "created": 1596948677.0
    },
    {
        "author": "broncoBurner69",
        "body": "I believe MA has a better return on equities and a better outlook than Visa.   But this is with 10 minutes of research.",
        "created_utc": 1597375811,
        "id": "g1el045",
        "score": 2,
        "subreddit": "investing",
        "created": 1597404611.0
    },
    {
        "author": "LavenderAutist",
        "body": "That meme is a about as close to Jack Ma as I could imagine in a three man race\n\nhttps://youtu.be/aHGd6LqAVzw",
        "created_utc": 1597338182,
        "id": "g1cgrox",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597366982.0
    },
    {
        "author": "ETisME",
        "body": "No, square is not a small player anymore. \n\nVisa and MasterCard etc wants to coexist along side with square, because digital payment means less paper notes going around.\n\nCompanies are like a factory in a sense. Once you build for one specific purpose, it takes a lot to reconstruct and revamp into something else while risk losing the core business competitive advantage.\n\nIt's also challenging one of the most powerful sector, banks, eventually they will join in the fight.\n\nThe only competitor imo is PayPal. But the market is much bigger than just PayPal and Square imo, the global market potential is massive.\n\nImo there will be one or two more eventual big competitors, but that's why square has paved most of the groundworks and any potential fights against banks\n\nHaving one app to transfer money, store, invest, and with a better reward system than traditional banks etc are important but imo there would be so much more as more sellers join the ecosystem.",
        "created_utc": 1596763618,
        "id": "g0mng7m",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596792418.0
    },
    {
        "author": "poundofmayoforlunch",
        "body": "Ma lord, Musk",
        "created_utc": 1597706820,
        "id": "g1xbtes",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597735620.0
    },
    {
        "author": "bigdickofwallstreet",
        "body": "My mind is telling me nooooo, but ma bodddeee, ma body is telling me yehesss!",
        "created_utc": 1597801051,
        "id": "g220sub",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1597829851.0
    }
]