[
    {
        "author": "vitocorlene",
        "body": "This is Chinese posturing. They do this from time to time in an effort to manipulate iron ore prices.  They are bent over the barrel right now for supply of iron ore. You also have to be cognizant of the fact that drops in input costs will increase profitability on orders already contracted through May. Mills will put lower input costs into their pocket and increase gross margin based off sold material already booked. I do think iron ore has been speculatively over heated.  It is due for a bit of a pull back, but there are other derivatives that can be used for steel making like shredded scrap. China planned for this iron ore supply and price issue and changed their stance on importing shredded scrap in October/November. They haven’t imported foreign scrap for years. A signal that they knew this was coming. That’s why I don’t bet on pure iron ore plays.",
        "created_utc": 1608501074,
        "id": "ggit0m3",
        "permalink": "/r/wallstreetbets/comments/kh2tvc/mt_a_further_dive_into_why_this_is_the_steel_play/ggit0m3/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1608529874.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Agreed.  I have stock options that were given this year and some will not vest for 5 years.  I would be very cognizant of maintaining their valuation if they were to 7x within that period of time.",
        "created_utc": 1606970254,
        "id": "gegfex2",
        "permalink": "/r/investing/comments/k5fkcp/elon_musk_warns_employees_teslas_stock_could_get/gegfex2/",
        "score": 6,
        "subreddit": "investing",
        "created": 1606999054.0
    },
    {
        "author": "AlexDK1990",
        "body": "So many fking idiots on this thread not cognizant to fact Euro indices (FTSE esp) just rode up like 20% in 6 weeks. Of course its going to give back some of those gains when uncertainty is ramped up rn. It doesn't make vaccines ineffective all of a sudden.",
        "created_utc": 1608538057,
        "id": "ggkh8fr",
        "permalink": "/r/wallstreetbets/comments/kh27t0/what_are_your_moves_tomorrow_december_21_2020/ggkh8fr/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1608566857.0
    },
    {
        "author": "chipper_parrrot",
        "body": "&gt; Tyler Technologies, Verint, Tableau Software, Mu Sigma, Cognizant\n\nThese are very, very different companies. Look into what they do individually. Big data is not really an industry.",
        "created_utc": 1609366437,
        "id": "ghjkf8v",
        "permalink": "/r/stocks/comments/knc0vo/why_pltr_will_be_like_fb/ghjkf8v/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1609395237.0
    },
    {
        "author": "Introduction_Deep",
        "body": "Listen to the Investtalk podcast and start reading investopedia. And take a small amount of money and jump in. Be fully cognizant that there is a high probability of loosing you initial deposit. The best way to learn is by doing while listening to proven experts. You compare their advice to your performance.",
        "created_utc": 1607889681,
        "id": "gfqhy6y",
        "permalink": "/r/RobinHood/comments/kcdt2q/best_way_to_learn_robinhoodinvesting/gfqhy6y/",
        "score": 4,
        "subreddit": "RobinHood",
        "created": 1607918481.0
    },
    {
        "author": "DeadlyEnzyme",
        "body": "ETFs are a really good way to make a solid 7% return without spending much time staring at a screen. Plus it forces you to be cognizant of your money streams",
        "created_utc": 1607982881,
        "id": "gfutqdz",
        "permalink": "/r/stocks/comments/kd7h6v/college_student_who_has_some_money_to_invest/gfutqdz/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1608011681.0
    },
    {
        "author": "No_Strawberry1890",
        "body": "I get your point but it would have to be so actively managed to be beneficial such as being cognizant of mergers (which have a statistical record of having an 18.8% drop after) as well as when warrants are diluted. How about when a SPAC merges, does it immediately get taken off since it’s not a SPAC anymore? Do you only include SPACS that have a DA or is an LOI okay?\n\nEdit: the difference between a SPAC etf and a regular ETF is that SPACs have very clear catalysts that need to be actively accounted for. Traditional ETF’s don’t really have this problem and this isn’t accounting for all the variables that are present in SPACs but not traditional common stock.",
        "created_utc": 1609374289,
        "id": "ghjziu7",
        "permalink": "/r/SPACs/comments/kndkiu/new_spac_etf_spcx/ghjziu7/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1609403089.0
    },
    {
        "author": "Wild-Commission-7940",
        "body": "Hey guys, want to hear a hilarious but kind of sad story tangential to this IPO?  Here goes.  Someone in my life is a Chinese programmer.  He worked for a bunch of companies in management, eventually ending up at ABNB.  He made a bunch of money over the years but his dream was to be in management at a company as it was taken public.  He got frustrated that ABNB wasn't going public, so he left for ANT.  Yeah, so we were all stoked.  Honestly, I was probably a little jealous hater because stuff, but still I was cognizant of that and happy for him when ANT was going to launch into the third orbit with its IPO.  It was really gonna be nutz.  He was gonna be among the richest people in China.  Then the 'regulators' quashed that IPO and ABNB is now going public.  Wow.  It's all good, he's still a millionaire I guess, which is rare in China anyways.  I'll never forget the evil look in his sons eye when he threw the toy car at my face full force.  there was real malicious intent there.  Good thing I'm a jedi.  Lol.",
        "created_utc": 1607100697,
        "id": "gem0217",
        "permalink": "/r/stocks/comments/k6j6nt/airbnb_ipo_date_confirmed_dec_10/gem0217/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1607129497.0
    },
    {
        "author": "curlyfat",
        "body": "True. But we also need to realize that “not dead” is not the same as “no big deal.”  I personally know a 30- something that caught it a few months ago, and is struggling to exercise at all. He is (was) in great shape his whole life and the gym is his normal escape. This shit can do some damage and we need to be cognizant of that.",
        "created_utc": 1608438171,
        "id": "ggfwse5",
        "permalink": "/r/wallstreetbets/comments/kftjzt/weekend_discussion_thread_for_the_weekend_of/ggfwse5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1608466971.0
    },
    {
        "author": "quarky_uk",
        "body": "Work in IT.\n\nCRWD - Dealt with them in Feb, but their sales guy was an arrogant slimy piece of shit so didn't buy shares (Stupid, nonsense reason).\n\nMSFT - Sticky (difficult to get rid of), bought shares.\n\nAMZN - See MS (although bought way too late).\n\nVMW - Love their products but never bought shares because it has been obvious since at least 4/5 years ago that change was coming, probably faster than VMware could change.\n\nORCL - Spit. Would never willingly use, or buy shares in.\n\nSAP - Some stickyness in business, so have bought a small number in the past.\n\n&amp;#x200B;\n\nOthers - NET, AKAM, CTSH, OTKA, CRM are all ones that I considered but didn't buy, or didn't buy early enough. Still, all a learning curve!\n\nNo point in having regrets but I should have bought AMZN and CRWD a long time ago.",
        "created_utc": 1607361608,
        "id": "geyjoqc",
        "permalink": "/r/stocks/comments/k7oq6g/what_has_working_in_your_industry_taught_you/geyjoqc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1607390408.0
    },
    {
        "author": "Introduction_Deep",
        "body": "Start listening to the Investtalk podcast and reading investopedia. Then take a small amount of money and jump in. Be cognizant that you have a high probability of losing some of it. Make sure its a SMALL amount, what ever that is to you! \n\nLots of people will tell you to paper trade first, I don't agree. The hardest part of investing is managing your emotions. Also paper trading won't get you used to concepts like the bid/ask spread and volume.",
        "created_utc": 1608511730,
        "id": "ggjdhzs",
        "permalink": "/r/stocks/comments/kgqcn9/how_to_learn_about_stocks_if_im_completely/ggjdhzs/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1608540530.0
    },
    {
        "author": "BVdubs",
        "body": "It's kind of astounding how more people aren't cognizant of the potential here.",
        "created_utc": 1609443362,
        "id": "ghmufdh",
        "permalink": "/r/shroomstocks/comments/kntnw0/2020_was_the_year_of_the_magic_mushroom/ghmufdh/",
        "score": 1,
        "subreddit": "shroomstocks",
        "created": 1609472162.0
    },
    {
        "author": "ThemChecks",
        "body": "Dispositions happen. I don't think their named tenant base is risky. They do have a lot of undisclosed tenants...\n\nI think they're fine and are cognizant not to become a yield trap. P/ffo is 17-18 lately. That's a little high but the multiple is deserved. Their cost of capital is nearly free, they include rent escalators, their returns matched QQQ from recent tech boom years 2015-2019... They're expanding abroad.\n\nI don't see a long term decline in share price unless you're worried about interest rates increasing. Last time rates increased appreciably they were at ATH...",
        "created_utc": 1607896062,
        "id": "gfqv4lp",
        "permalink": "/r/investing/comments/kc9r3w/whats_your_favorite_etf_thats_pays_dividends/gfqv4lp/",
        "score": 1,
        "subreddit": "investing",
        "created": 1607924862.0
    },
    {
        "author": "gammaradiation2",
        "body": "Definitely cognizant of that. I wasnt really happy with a lot of what was going on back then, but hindsight in 2020...",
        "created_utc": 1607132040,
        "id": "genopha",
        "permalink": "/r/wallstreetbets/comments/k6m8m4/pltr_at_every_market_open/genopha/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1607160840.0
    },
    {
        "author": "MeetMeInMTK",
        "body": "sold this Jan 15 iron condor just now, what do you think?\n\n\\- Sold 145c, buy 150c\n\n\\- Sold 90p, buy 85p\n\nP/L risk profile: $106/394\n\nObviouslt not the juiciest risk profile but i feel like it's a strong window. I feel like the steam has run out. However, I am obviously just cognizant of meme power stocks that can have ridiculous earnings run ups. Earnings are after this IC close so I feel like im safe enough. Thoughts?",
        "created_utc": 1607702837,
        "id": "gfei60t",
        "permalink": "/r/options/comments/k89usc/options_questions_safe_haven_thread_dec_0713_2020/gfei60t/",
        "score": 1,
        "subreddit": "options",
        "created": 1607731637.0
    },
    {
        "author": "bendgame",
        "body": "Literally or rhetorically? Since you're probably too retarded to use google, I guess I can help you...\n\n **Alteryx**, **Trifacta**, IBM Watson Studio, and Altair Monarch are the most popular alternatives and competitors to Palantir Foundry. \n\nPalantir's top **competitors** include Tyler Technologies, Verint, Tableau Software, Splunk, Mu Sigma and Cognizant.\n\nLong PLTR, but not sure whether the hype is about their tech or the belief the shares are currently undervalued compared to their competitors.",
        "created_utc": 1609364410,
        "id": "ghjgbvf",
        "permalink": "/r/wallstreetbets/comments/kn3fiz/in_case_you_are_on_the_same_boat_pltr/ghjgbvf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609393210.0
    },
    {
        "author": "420milehigh",
        "body": "This deserves to be highlighted as a crucial statement, perhaps guidance, into Q2:\n\n&gt; Mr. Eugene Ruiz, President of the Company, stated, \"Our team has been steadfast in our commitment to transforming the Company into a profitable enterprise. Every decision and action that we have taken has moved us closer towards achieving our targeted goal of accelerating our path to profitability. During the first quarter 2021, tremendous progress was made. That progress has continued into the second quarter 2021, with our operating **business units achieving profitability for the month of November, 2020.** We continue to believe we are **on the path to achieving Company-wide profitability by the end of the second quarter 2021**. We remain vigilant and cognizant of the challenges posed by COVID-19 on tourism in our state, while remaining confident that the rebound of strong local cannabis sales experienced since the pandemic will provide for sustainable revenue growth.\"",
        "created_utc": 1609265572,
        "id": "ghewlb3",
        "permalink": "/r/weedstocks/comments/kmeqwv/1933_industries_reports_first_quarter_2021/ghewlb3/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1609294372.0
    },
    {
        "author": "FromBayToBurg",
        "body": "&gt;Is it worth it to do that if it's within a year and I have to pay a higher short-term capital gains tax\n\nI don't know what your income situation is like so I can't tell you any answer definitively. \n\nIf you want to sell you have to be cognizant of the fact that short term capital gains distributions are going to increase your income for 2020. If you've made a Roth IRA contribution will this increase in income push you into an AGI phase out range forcing you to recharacterize?\n\nIn your state is there a difference in how short-term and long-term capital gains rates are taxed? I know off hand that in California there is no differentiation. \n\nIs your income low enough that if you sold next year are you in the 0% LT capital gains tax rate?\n\nAre you older and on Medicare? If so how will more income affect your part B premium?\n\nDo you have healthcare through the exchange? Will extra income affect your ability to retain healthcare through the exchange?\n\nDo you have realized losses this year to offset any of the income if you sell?\n\nHow much of your portfolio is ARKK now? Have you considered what a good position size is for this fund? Do you have multiple tax lots? Can you trim from the highest basis tax lot to reduce its allocation in your portfolio to minimize tax due? \n\nWill taking this extra gain push you into the next tax bracket? \n\nDo you have time this year to make a contribution to a tax-deferred account to reduce AGI in order to offset the gains associated with the sale?\n\nWhy not tier your sales so that you slowly take gain this year and then next year? It doesn't need to be all or nothing if you're beginning to feel uncomfortable.",
        "created_utc": 1608738894,
        "id": "ggt0x4v",
        "permalink": "/r/investing/comments/kiqvny/arkk_and_arkg_in_a_taxable_account_tax_on_capital/ggt0x4v/",
        "score": 1,
        "subreddit": "investing",
        "created": 1608767694.0
    },
    {
        "author": "Eltotsira",
        "body": "That is fair, but in that case, I'd say prob don't do anything until you do some research, tbh. I personally like a balance of ARKG, ARKK, and ARKF. \n\nAll that said, good for you for at least being cognizant that you have their futures in their hands and the awesome responsibility that that entails. \n\nAll of that said, and everything with a grain of salt, imo, traditional S&amp;P 500 ETFs are the safest option that will almost certainly gain value over 20 years. But def do research on your own, not on reddit. \n\n**Also, this is not advice, and I am not a professional. I am not responsible or liable for any decisions you make or the resulting consequences, these are merely opinions expressed on a social media forum.**",
        "created_utc": 1609036613,
        "id": "gh4o8nu",
        "permalink": "/r/stocks/comments/kkhgls/are_ark_etfs_overvalued_or_undervalued/gh4o8nu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609065413.0
    }
]