[
    {
        "author": "-Jocko-",
        "body": "Tell me one good reason for buying Square over PayPal",
        "created_utc": 1604250270,
        "id": "gat2t05",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604279070.0
    },
    {
        "author": "ExtensionAd2828",
        "body": "square is literally the operating system for a small business. they offer workers comp insurance, run payroll, accounting features, and of course the cash register hardware. \n\npaypal isnt on that level",
        "created_utc": 1604250380,
        "id": "gat30kc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604279180.0
    },
    {
        "author": "Dmoan",
        "body": "I think SQ is better play as PYPL hasn’t sold off much",
        "created_utc": 1604252218,
        "id": "gat6iai",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604281018.0
    },
    {
        "author": "ToastedBagels991",
        "body": "thinking about going all in on paypal. how y’all think they’ll do?",
        "created_utc": 1604250179,
        "id": "gat2mue",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604278979.0
    },
    {
        "author": "Wade12323",
        "body": "Thoughts on PayPal? Might pop on earnings",
        "created_utc": 1604251844,
        "id": "gat5suz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604280644.0
    },
    {
        "author": "papi_shampuu",
        "body": "Selling my WM calls for PayPal calls selling Tuesday morning for marathon calls and alibaba calls YOLO",
        "created_utc": 1604266473,
        "id": "gatztip",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604295273.0
    },
    {
        "author": "Made_up_quote",
        "body": "Is PayPal still a thing?  The only websites I see this being actively pushed is eBay which is probably one of the reasons I no longer use eBay.",
        "created_utc": 1604239975,
        "id": "gasl0ru",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604268775.0
    },
    {
        "author": "AsAPLARKYY",
        "body": "God damn I have some paypal i missed close on, gotta cash out as soon as market opens just incase",
        "created_utc": 1604241035,
        "id": "gasmoju",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604269835.0
    },
    {
        "author": "wakuku",
        "body": "the only problem I have with this especially with Paypal is that even if they beat expectations, the current market can't make up their mind. People will then say its already priced in and such. I think if you already have them, then keep it But I would be wary with buying some tomorrow.",
        "created_utc": 1604244310,
        "id": "gasrza4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604273110.0
    },
    {
        "author": "Dmoan",
        "body": "If things settle down come Wednesday I will stick to what works which is stay at home stocks that are priced reasonably. Apple, ATVI, MSFT, SNE, CHWY, SQ or PYPL, UPS would be my plays",
        "created_utc": 1604249675,
        "id": "gat1oyn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604278475.0
    },
    {
        "author": "RemarkableScarcity8",
        "body": "I wanna buy cause it’s so low but I know that’ll just bite me in the ass... it’s low cause banks are overall down and wfc is facing major bad news cause of their bad business practice idk I’m not a banker.. virtual financial like PayPal are the future though",
        "created_utc": 1604258897,
        "id": "gatk4us",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604287697.0
    },
    {
        "author": "THE_MIGHTY_CHAD",
        "body": "Paypal’s new buy now pay later will take online transactions by storm. Many, many new users will sign up. Rates are half of the competition. Though merchants hate paypal by default, they will appreciate the lowered fees and increased sales.\n\nStill, you should choose square over paypal due to many more reasons.",
        "created_utc": 1604250642,
        "id": "gat3i4j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604279442.0
    },
    {
        "author": "TheAppleGuy25",
        "body": "Alibaba on the 5th, PayPal tmrw pre market",
        "created_utc": 1604243637,
        "id": "gasqtbw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604272437.0
    },
    {
        "author": "DenverNuggetz",
        "body": "PayPal owns Venmo",
        "created_utc": 1604244292,
        "id": "gasry2u",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604273092.0
    },
    {
        "author": "THE_MIGHTY_CHAD",
        "body": "Thinking of buying a bunch of paypal on monday if it continues dipping.\n\nAnyone thinking of doing the same?",
        "created_utc": 1604240483,
        "id": "gaslt71",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604269283.0
    },
    {
        "author": "ricke813",
        "body": "Animal health stocks (IDXX and ZTS): Should accelerate growth in 2021 after restrictions are lifted and people are more comfortable going to the vet. See the earnings call for IDXX, revenue growth and vet visits are actually positive this year because despite the restrictions... people still care about their pets and more people WFH = more first time pet owners\n\nLYV: What I learned is that most people don't care about social distancing and are ok with packing a venue to watch concerts and sports again. So many of the mom and pop shop venues are probably going to close due to $0 cash flow this year. As long as LYV can make it out alive until restrictions are lifted... the only competitor in there way will be pretty much AEG and they can continue its pre-COVID momentum. Warning... the stock hasn't dropped a lot for a company that is in a cash crunch and has +95% revenue decrease, which surprises me. E\nWhat won't surprise me if the stock drops to $20 - $45 and I'll be a buyer.\n\nV and MA: Should also accelerate growth once a vaccine is available and transactions are lifted. They should recover a big chunk of their spending volume and cross-border fees, but I think business travel is permanently impaired. Right now I'm a V holder, but I like PYPL a bit more as my favorite fintech.",
        "created_utc": 1604239455,
        "id": "gask81r",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604268255.0
    },
    {
        "author": "coolcomfort123",
        "body": "baba and paypal for the win.",
        "created_utc": 1604242418,
        "id": "gasosyx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604271218.0
    },
    {
        "author": "Dmoan",
        "body": "It on 11/5 AH, I like PYPL also but they are reporting tomorrow and will get lost in all this madness plus the stock has barely sold off",
        "created_utc": 1604228515,
        "id": "gas6dk3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604257315.0
    },
    {
        "author": "brereddit",
        "body": "If gdp spiked, PayPal will crush earnings",
        "created_utc": 1604266724,
        "id": "gau0ax9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604295524.0
    },
    {
        "author": "DenverNuggetz",
        "body": "40 million+ users and growing at a large rate.\n\nAdd that to PayPal’s already large userbase....pypl isn’t going anywhere soon.\n\nThe company is a great play alongside SQ as the biggest threats to the large payment processors like V.",
        "created_utc": 1604250841,
        "id": "gat3vqz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604279641.0
    },
    {
        "author": "Dmoan",
        "body": "Cash app (owned by SQ) is beating Paypal and Venmo app (owned by Paypal). PayPal was very slow to add features to Venmo allowing Cash app to beat them",
        "created_utc": 1604250828,
        "id": "gat3uvn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604279628.0
    },
    {
        "author": "mulemoment",
        "body": "Also, according to technical analysis, it's been way overbought this year and needs to correct. It looks like it'll stabilize at ~140, maybe ~120 with strong sell pressure.\n\nAlso they've been getting rewarded for revenue growth, but the revenue growth is from bitcoin which 1. they're barely profitable on and 2. are seeing a growth of competition in from companies like paypal.",
        "created_utc": 1604265372,
        "id": "gatxm4s",
        "score": -2,
        "subreddit": "investing",
        "created": 1604294172.0
    }
]