[
    {
        "author": "AoeDreaMEr",
        "body": "That’s a great read. I am a packaging engineer and I loved reading this. As you said, Intel isn’t out of the game yet. But if they don’t get their shit together in next couple of years, they will be the next IBM.",
        "created_utc": 1600179303,
        "id": "g5cuxpx",
        "score": 88,
        "subreddit": "stocks",
        "created": 1600208103.0
    },
    {
        "author": "adayofjoy",
        "body": "It's not specifically tech stocks that are inflated faster, but growth stocks. Low PE ratio tech stocks such as Intel, Cisco and IBM are still sitting at depressed levels.",
        "created_utc": 1600572658,
        "id": "g5x4558",
        "score": 77,
        "subreddit": "investing",
        "created": 1600601458.0
    },
    {
        "author": "General-Maintenance",
        "body": "Even more boomer than IBM. Wtf",
        "created_utc": 1600049587,
        "id": "g56wwnr",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1600078387.0
    },
    {
        "author": "navyguy666",
        "body": "IBM is considered a joke within the IT industry nowadays",
        "created_utc": 1600557861,
        "id": "g5vsfem",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1600586661.0
    },
    {
        "author": "AnonymousAstro",
        "body": "I sold a naked 9/4 $410c at close as a part of a strangle because an “$85 move up in a day is impossible”. I sold it for $70 and ate a $2800 loss this morning.\n\n**One big lesson learned:** people will buy up everything and try to make it the new TSLA. ZM has EPS of $.92 and a current P/E ratio of $1700ish. It’s now worth more than IBM.\n\nAs long as “stonks go up”, I’ll stick to selling puts only.",
        "created_utc": 1598993396,
        "id": "g3n27ob",
        "score": 26,
        "subreddit": "options",
        "created": 1599022196.0
    },
    {
        "author": "dramebaz",
        "body": "Next up, IBM acquiring Snapchat.",
        "created_utc": 1600041776,
        "id": "g56jlmf",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1600070576.0
    },
    {
        "author": "Billie__Gates",
        "body": "Robinhood really should take the \"my lists\" idea even further treating them as etf tickers.\n\nFavorite examples:\n\n**$TACY** - *White Girl ETF* - AAPL, LULU, SBUX, DECK, AMZN, ETSY, FB, ULTA, DEO and GOOS\n\n**$RDNK** - *Redneck ETF* - WMT, HD, YETI, PEP, DEERE, F, BUD, MNST, RGR, DG\n\n**$RBOT** - *Killer Robot ETF* - IBM, MU, AMD, TSLA, QCOM, SFTBF, UBNT, DDD, IRBT\n\n(Credit to u/Cowfister , u/AthosN8, u/Su-Bae-Bae)",
        "created_utc": 1601438268,
        "id": "g752jmu",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601467068.0
    },
    {
        "author": "ozud100",
        "body": "I don't know why there are so many Tesla retards here. \n\nIn terms of ultimate retardation, that title clearly belongs to Zoom. A videoconferencing app which does nothing more than put two cameras together is worth more than Boeing, IBM, Unilever, Morgan Stanley, General Electric and has a higher market cap other than the top 55 richest countries in the world by GDP.",
        "created_utc": 1600897741,
        "id": "g6d0b5g",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1600926541.0
    },
    {
        "author": "teegolf1",
        "body": "Zoom is way overpriced as well. Here’s a quote from BARRON’S today.............  “Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It’s now worth $129.1 billion, more than International Business Machines’ (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.”",
        "created_utc": 1599003033,
        "id": "g3nnczg",
        "score": 14,
        "subreddit": "stocks",
        "created": 1599031833.0
    },
    {
        "author": "thicc_dads_club",
        "body": "I worked for IBM for a few years. You probably shouldn’t invest in any company dumb enough to hire me.",
        "created_utc": 1600571712,
        "id": "g5x1i3t",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1600600512.0
    },
    {
        "author": "dragonowl1990",
        "body": "thats what he's saying...  before microsoft xerox and apple came along, who do you think dominated all tech business sales in the entire world??  maybe you didnt own any IBM products at home, but every store/business you shopped at did.\n\nbut yeah, i do agree it is different now that everyone has to have a phone / computer / internet these days, its hard to imagine that not being the case but  who knows what will happen.",
        "created_utc": 1600470624,
        "id": "g5r753u",
        "score": 12,
        "subreddit": "stocks",
        "created": 1600499424.0
    },
    {
        "author": "WeberStateWildcat",
        "body": "I'd certainly rather have Apple over IBM, but if I had 100+ shares of IBM, I'd investigate selling covered calls and collect some premium on the sale. And maybe premiums plural if it takes a few times for the buyers of said calls to succeed in hitting the strike price and exercising the option.",
        "created_utc": 1599280285,
        "id": "g42zuds",
        "score": 10,
        "subreddit": "stocks",
        "created": 1599309085.0
    },
    {
        "author": "hypertr00per",
        "body": "When I was a kid I almost drowned. Mom freaked out, mom's boyfriend was nowhere to be seen (probably YOLOing on IBM and Yahoo). Always keep an eye on your kids when they are swimming.",
        "created_utc": 1600620494,
        "id": "g5zxvww",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600649294.0
    },
    {
        "author": "TrenAndOptions",
        "body": "You’re an idiot if you think IBM is dying. They’re leading the charge with quantum computing, even more than google",
        "created_utc": 1599023464,
        "id": "g3ooxye",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599052264.0
    },
    {
        "author": "ixamnis",
        "body": "I see several people on here suggesting VOO.  I have no problem with VOO, but be aware that the top six holdings in VOO are:  AAPL, MSFT, AMZN, FB, GOOGL and GOOG.  I like VOO, but if you want to diversify outside of tech you may want to consider some value stocks and buy individual stocks instead of an ETF, or buy sector ETFs.  \n\nValue stocks that I'd recommend:  ABBV, ACN, AES, CLX, DIS, IBM, JNJ, JPM, KHC, KO, KR, LOW, MA, MAR, MCD, NVS, O, PEP, PFE, PLAY, SBUX, T, TD, TGT, TROW, VZ, WBA, WMT, WSM. I think you could easily pick any three to five of these and have a nicely balanced portfolio given the amount of money you are investing.\n\nSector ETFs that I like include:\n\nICLN, TAN or PBW - Clean energy/renewable energy\n\nFHLC, XLV - Health Care\n\nIDNA, ARKG - Genomic Research and DNA technology\n\nPRNT - 3D printing\n\nARKQ, THNK, ROBO - artificial intelligence and robotics (However, this is \"tech\")\n\nVFH, FNCL, XLF, IEFN - financial sector ETFs\n\nI'm not a financial advisor and have no business giving financial advice. That said, a nice balanced portfolio might look something like this:\n\n33% tech stocks and ETFs  (This is what you already have)\n\n33% value stocks (from the list above)\n\n33% sector ETFs:  10% ICLN, 10% ARKG, 10% XLV\n\nBest of luck to you.",
        "created_utc": 1600262071,
        "id": "g5gum66",
        "score": 9,
        "subreddit": "stocks",
        "created": 1600290871.0
    },
    {
        "author": "Particular-Wedding",
        "body": "Apple's stock buyback program reminds me of another tech company - IBM which is doing the exact same thing.  But without the cult following.",
        "created_utc": 1600378421,
        "id": "g5mxc2c",
        "score": 8,
        "subreddit": "investing",
        "created": 1600407221.0
    },
    {
        "author": "hak8or",
        "body": "Case in point, Microsoft from 2000 to a few years ago. Hell, what about IBM years before? Big glue was never the wrong choice, until it was. Same with Sears. The context given by /u/Okmanl is great, but OP's conclusion is a piss into the wind due to the \"easy\" part.\n\n&gt; If you buy and hold onto only good companies (Apple, Amazon, Costco, McDonalds, jnj, Brk, O etc...) you could **easily** outperform the S&amp;P 500 over a long period of time.",
        "created_utc": 1600636864,
        "id": "g6150h7",
        "score": 8,
        "subreddit": "investing",
        "created": 1600665664.0
    },
    {
        "author": "CptTonyStark",
        "body": "ppl who invest in cryp-to as a hyperinflation hedge in case dollar goes bust don't even realize that almost all cry-pto-currencies like shitcoin and airer are based on elliptic curve digital signature algorithm cryp-to-graphy, which is not quantum secure. The day quantum computers become powerful enough, which will happen in maybe a decade thanks to google, IBM, and MSFT, all coins will become worthless overnight. Imagine investing in something thinking that its' like gold and will keep value even in an apocalypse, not knowing that it's not even future proof just 1 decade from now. \n\n&amp;#x200B;\n\nNow, quantum secure cryp-to-graphy algorithms do exist but it's impossible to change the underlying block-chains and the algos driving them, by design. Quantum computers breaking encryption won't be a big problem to systems with central authority because they can just overhaul the encryption infrastructure. Not so much with coins, because the whole purpose of making them was to make sure no one tampers with the underlying block-chain and any algos driving it once it's up and running.",
        "created_utc": 1599336577,
        "id": "g45s0vr",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599365377.0
    },
    {
        "author": "united858",
        "body": "Who would have imagined ORCL, probably the most boomer of tech companies along with IBM, would end up with TikTok?",
        "created_utc": 1600043196,
        "id": "g56m1i2",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600071996.0
    },
    {
        "author": "ThrowawayAl2018",
        "body": "Anyone heard of IBM dominance in the PC market or Nokia in the hand phone industry? Folks are investing in a overvalued company hoping that it will go higher, then claiming that it would be that value in 10 years.\n\nRead any articles last year and everyone would be laughing if someone said Apple stocks could be bought for under $60/-. Well the black swan came in form of pandemic and stocks went below $60/- when market crashed.\n\ntldr: soothsayer exists in all forms. Tech changes so fast that big companies today might be irrelevant in 10 years.",
        "created_utc": 1600978749,
        "id": "g6gojee",
        "score": 7,
        "subreddit": "stocks",
        "created": 1601007549.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Imagine all the dumb fuck analysts who said Amazon was not a buy back in the 90s and recommended IBM, CSCO, and INTC instead. \n\nThat's how I feel about all the analysts with bearish targets on TSLA",
        "created_utc": 1599285296,
        "id": "g4372xo",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599314096.0
    },
    {
        "author": "greytoc",
        "body": "&gt;Both are in varying forms of cloud computing\n\nThat's not entirely accurate. Both are extremely different businesses with different products that target different customers. It's like saying that $NVO and $HCA are varying forms of healthcare. \n\n$RXT is a capital intensive business that attempted to compete with AWS, Azure, GCP, and Softlayer/IBM but is considered a small player. They pivoted with software offerings to support multicloud solutions in an attempt to be an overlay solution to companies that require multicloud infrastructure. But I think that's a tough sell to companies that are deploying IaC solutions instead which may be arguably more agile and flexible. \n\n$SNOW - well - I don't know why the valuation is that high. They have a good product and service and many companies have flocked to them because they are more affordable than AWS Redshift and GCP BigQuery - and they have some nice built in ETL. They seem to have captured a lot of startup tech companies but  I don't really understand how/when they can be profitable. Competing on price alone doesn't seem sustainable to me. \n\nI don't hold any positions in either company.",
        "created_utc": 1600308987,
        "id": "g5ji856",
        "score": 6,
        "subreddit": "stocks",
        "created": 1600337787.0
    },
    {
        "author": "MeteorMash101",
        "body": "IBM",
        "created_utc": 1599173113,
        "id": "g3wzbe6",
        "score": 6,
        "subreddit": "stocks",
        "created": 1599201913.0
    },
    {
        "author": "throwaway23948733",
        "body": "IBM is a has-been. They probably make 120% of their income on ancient maintenance contracts to keep dusty mainframes running",
        "created_utc": 1600568116,
        "id": "g5wq284",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600596916.0
    },
    {
        "author": "BPFortyEight",
        "body": "Idk,  I look at IBM and it screams buy. But then I look at my ESPN fantasy app and use the IBM Watson trade assistant and it offers up Jordan Howard, Adrian Peterson, and Cooper Kupp for Mike Evans. Their AI is equally retarded as my league mates.\n\nAll that being said, I'm still considering LEAPs.",
        "created_utc": 1600558239,
        "id": "g5vtjl7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600587039.0
    },
    {
        "author": "infinitelimits00",
        "body": "I just noticed the Boomer Index actually crushed today. \n\nKO, IBM, INTC all massively outperforming today. KO back to its post-COVID highs (since March 23). CSCO, DIS, BA, RTX, T also all up. And XLU was up 3%, which is a lot for a defensive utilities sector.",
        "created_utc": 1599091636,
        "id": "g3seg2j",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599120436.0
    },
    {
        "author": "technocrat_landlord",
        "body": "Is this what non-technical people think the tech landscape looks like?\n\nAlso, please post more frequently so I can inverse your ideas and positions\n\nquick note - it has been years since IBM was a leader in AI",
        "created_utc": 1600581920,
        "id": "g5xt972",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600610720.0
    },
    {
        "author": "infinitelimits00",
        "body": "No that's Intel, if they are even tech anymore. IBM and Cisco are next. Slack maybe is the most hated new tech company though. That or DBX which also never moves.",
        "created_utc": 1599692140,
        "id": "g4lhb9e",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599720940.0
    },
    {
        "author": "dryu12",
        "body": "Zoom is valued more than IBM. Let that sink into your retarded brain.",
        "created_utc": 1599055486,
        "id": "g3px4uq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599084286.0
    },
    {
        "author": "Cwc123",
        "body": "ardes Michel11 hours ago\nYes....But.....Debt is huge for IBM......And they are not alone...Competition is also huge for IBM......Then a growth company is always richly priced......The world is the limit for ZM........No frontiers.......Sky is the limit.....ZM will reach 1000 usd if they continue to beat....\n\nWhy the f did i buy puts on this with ppl like this on the other side",
        "created_utc": 1599093636,
        "id": "g3si419",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599122436.0
    },
    {
        "author": "infinitelimits00",
        "body": "Lol if you guys love the DOW, may I introduce you to the Boomer Index. \n\nKO, T, JNJ, BA, NKE, MCD, INTC, IBM, and CSCO (although INTC is catching on here...and the last three technically are correlated with tech).\n\nI like never see anyone trade NKE calls but it's actually a good company.",
        "created_utc": 1599182161,
        "id": "g3xln4y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599210961.0
    },
    {
        "author": "sc0tt_1990",
        "body": "lol at Intel.  the new IBM.",
        "created_utc": 1599063974,
        "id": "g3qhsh2",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599092774.0
    },
    {
        "author": "TAWS",
        "body": "Snowflake's CEO is a boomer. They totally going to end up like IBM and die over time",
        "created_utc": 1600648196,
        "id": "g61tai1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600676996.0
    },
    {
        "author": "rbrumble",
        "body": "Any discussion of future investments should be broader than a single category.\n\nBut, this is a good post to kick off a deeper dive conversation.\n\nWhat should a portfolio focused on future trends include?\n\nI'd pick AI (IBM, MS, Apple, Nvidia, Google, Amazon, etc), solar power and battery makers (Tesla for sure), online shopping (Amazon).\n\nWhat else?",
        "created_utc": 1600184055,
        "id": "g5d5gvc",
        "score": 4,
        "subreddit": "stocks",
        "created": 1600212855.0
    },
    {
        "author": "pelikana20",
        "body": "Damn I slept on IBM's unusual options activity. It's up 3.8% today but who's even in IBM??",
        "created_utc": 1599081666,
        "id": "g3rskmk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599110466.0
    },
    {
        "author": "cornflake-millennial",
        "body": "I used to work at a giant healthcare company that had a giant partnership with IBM Watson. It was stupid. Did a similar one with Google at a different company. \n\nThose companies only do that for free marketing and press releases. \n\nRarely, if ever, do those work out. The agreements between the companies are so prohibitive that the employees working on the project can’t even share important details with one another.",
        "created_utc": 1600567362,
        "id": "g5wnkdk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600596162.0
    },
    {
        "author": "MGSteezus",
        "body": "Reading these comments make me consider this subreddit, Oracle is a huge legacy company almost on par with IBM. Facebook &amp; Snapchat aren't in the same league, the only worry is FB reels, TikTok is now one of the largest social media platforms with huge financial backing. Are people forgetting the rest of the world exists outside the US?",
        "created_utc": 1600145034,
        "id": "g5brbfk",
        "score": 3,
        "subreddit": "investing",
        "created": 1600173834.0
    },
    {
        "author": "guyfawkes202",
        "body": "I have 30 shares of international business machines stock that I’ve been holding since 1979... in fact I set up one of the original COBOLT servers for IBM back in the day.",
        "created_utc": 1599104516,
        "id": "g3t1mit",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599133316.0
    },
    {
        "author": "barnett9",
        "body": "NVDA has been working on architecture to do compute without CPU's for a while. If they pull it off then they will redefine how computers work at a fundamental level. They are stupidly overbought right now, but long timeline I'd take that gamble.\n\nIBM is also trying to not be a dinosaur and is investing fairly heavily into quantum computing, maybe that.",
        "created_utc": 1599156838,
        "id": "g3voret",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599185638.0
    },
    {
        "author": "LemonBrothers",
        "body": "I work in tech, know a lot of ppl who work in IBM and I've never seen such a retarded thesis like yours",
        "created_utc": 1600582129,
        "id": "g5xtpqg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600610929.0
    },
    {
        "author": "x-w-j",
        "body": "&gt;SQQQ\n\nI am a living specimen and had some small investment on it. SQQQ can at the best meet 2x of QQQ on continuous climb. Backtested since 2000 (post crash) to before COVID happened (Feb). This can be modeled at the best something like a Random Walk problem but the delta might be unknown.\n\nI also find it hard to put more money in tech as it more service oriented than product oriented, your revenue could possibly shift between (big) players or whomever offers more value as consumers become more and more aware.\n\nTL;DR IBM was a tech stock in 2000.",
        "created_utc": 1600629918,
        "id": "g60nbav",
        "score": 3,
        "subreddit": "investing",
        "created": 1600658718.0
    },
    {
        "author": "throwawaythe6",
        "body": "I am loading up on IBM calls this and next week to unload most before their financials.\n\nBoomer stock but it’s undervalued af.",
        "created_utc": 1601434626,
        "id": "g74wdvt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601463426.0
    },
    {
        "author": "ZarrCon",
        "body": "Yes, payout ratio is honestly one of the most important factors for people looking at dividend paying stocks. \n\nFor example: MCD has a yield of 2.29% right now and a payout ratio of around 80%. AVGO has a yield of 3.64% with a payout ratio of around 60%. IBM has a yield of 5.46% with a payout ratio of around 60% too. \n\nSo even though IBM has a much larger yield than MCD, they are paying out less of their overall earnings, which I would argue means their dividend is technically safer. That being said, don't invest based on payout ratio or yield alone. Invest in quality companies with good long term prospects, which I'd argue IBM doesn't have.",
        "created_utc": 1601250196,
        "id": "g6wgzpj",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601278996.0
    },
    {
        "author": "SimoHayha360",
        "body": "IBM the fuck do they produce these days?",
        "created_utc": 1600558648,
        "id": "g5vuqx3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600587448.0
    },
    {
        "author": "basic_math_doit",
        "body": "IBM is a patent troll company in the making   \nMy smart watch has more AI than all their products put together.",
        "created_utc": 1600563955,
        "id": "g5wcfwc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600592755.0
    },
    {
        "author": "robogarbage",
        "body": "I think Apple would buy OLED screens from a dude in a van if he could deliver quantity and quality.  \n\nI don't think any company's AI product is accepted based on brand name alone, they have to prove that their shit works.  So IBM has no advantage vs no-names, except maybe easier to get a foot in the door.\n\nI heard that Watson sucks and doesn't work.  Which would explain why we haven't heard about it in recent years.",
        "created_utc": 1600581481,
        "id": "g5xs54l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600610281.0
    },
    {
        "author": "ZippyZebras",
        "body": "I did the math for each pick last time it was posted, through 2005 the best return was -60%, on an internet security company that got bought by IBM  \n\n\nEvery. single. other. pick. was worse -90% or worse. Not a single one actually had any form of fundamentals, even in an abstract view of the term.",
        "created_utc": 1600269896,
        "id": "g5h8x53",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600298696.0
    },
    {
        "author": "LineReact0r1",
        "body": "Ahh the Redhat deal. Yeah i remember reading about that. Probably the best thing they have done in 20 years. Not for Redhat but def for IBM.",
        "created_utc": 1599026152,
        "id": "g3os8ad",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599054952.0
    },
    {
        "author": "CallinCthulhu",
        "body": "People still use yahoo everyday. It’s the 10th most visited site in the world.\n\nIt takes more than a cornerstone product to grow. Microsoft was weighed down by a continuous stream of awful products, poor acquisitions, botched acquisitions, and no ability to look forward. They were very slowly but surely dying. They were losing market share everywhere.\n\nSatiya changed that and they really embraced cloud, and managed some fantastic acquisitions that they didn’t fuck up after. Without him and the changes they made, they’d be IBM. Flat as fuck",
        "created_utc": 1599280313,
        "id": "g42zvn2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599309113.0
    },
    {
        "author": "AvodLooksee",
        "body": "mPulse is the patented leading microgrid managing software, and mVSO is their optimization program that then feeds info to their mPulse software. Not 100% sure if mVSO is patented but their main product mPulse definitely is.\n\nIBM said they're on the leading edge of the cutting edge in a white paper, and seeing as though tesla partnered with them on a microgrid battery I think it's more set in stone than up in the air. 1m in backlogged contracts, and more projected after the acquisition of gridfabric and its clients.",
        "created_utc": 1599164057,
        "id": "g3wadzt",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599192857.0
    },
    {
        "author": "DankMemelord25",
        "body": "IBM",
        "created_utc": 1600577796,
        "id": "g5xiqjx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600606596.0
    },
    {
        "author": "Be_Kind_To_Strangers",
        "body": "Ibm stats are just lies and smoke.",
        "created_utc": 1600558223,
        "id": "g5vthwl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600587023.0
    },
    {
        "author": "realmastodon2",
        "body": "\\&gt;  Most people are not going to return to the office full time. \n\nMost office workers are doing jobs which can't be done at home. Such as a supporting roles and HR. Not to mention sales teams need to meet clients either in office or their offices, and communications teams need to fix companies issues and meet with clients as well. WFH is for software engineers. Even then a lot of them can't do it at home. They need to be in a team environment. Once COVID is gone a lot of companies will do a 180 and force all workers back to the office. If I recall IBM tried WFH before it was popular a few years ago and didn't work out so well.",
        "created_utc": 1600103864,
        "id": "g595bq9",
        "score": 2,
        "subreddit": "investing",
        "created": 1600132664.0
    },
    {
        "author": "schrute-farms-inc",
        "body": "You think you’re the first one to make this argument? IBM used to be the biggest company and they were “the future of tech”. The first 100 billion market cap company, all the way back in 1987.",
        "created_utc": 1600104689,
        "id": "g597rc4",
        "score": 2,
        "subreddit": "investing",
        "created": 1600133489.0
    },
    {
        "author": "Govika",
        "body": "Ibm will buy tiktok.\n\nCap this",
        "created_utc": 1600052972,
        "id": "g572cri",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600081772.0
    },
    {
        "author": "ryanl247",
        "body": "If I’m wrong about NNOX then\n\n1. GE\n2. Siemens\n3. Bill &amp; Melinda Gates Foundation\n4. Fujifilm\n5. Sony\n6. SK Telecom\n7. FoxConn\n8. IBM\n9. USARAD\n10. Cantor Fitzgerald\n11. Berenberg Bank\n12. Oppenheimer\n13. Hadassah\n14. Rafael Grossmann\n15. Medical Director of Computed Tomography at Univ. of Washington\n16. Former Chair Duke Dept of Radiology\n17. Customers in Mexico, Australia, Norway &amp; more...\n\nAre all wrong too. I’m good with that investment company.\n\nI can't believe Citron is allowed to continue to exist, to be honest, but thank you to them\n\nEdit: It looks like there is a [change.org](https://change.org) petition against Citron's repeatedly deliberate false and misleading reports, particularly Andrew Left who has been sued and convicted by regulators and governments: [http://chng.it/YZ9bRdMPmP](http://chng.it/YZ9bRdMPmP).",
        "created_utc": 1600187704,
        "id": "g5deeqv",
        "score": 2,
        "subreddit": "investing",
        "created": 1600216504.0
    },
    {
        "author": "moneygardener",
        "body": " Regarding INTC:\n\nWith all the security issues that has been popping up the last couple of years (Meltdown, Spectre and unfortunately many more)\n\nThe risk of having fabs that are being outperformed by both TSMC and Samsung.  \nAs in having fabs becoming a liability if you can't reach the cutting edge.\n\nLosing marketshare in both DIY desktop segment and datacenters. due to the competitors latest 2-3 product cycles which are competitive both in price and performance.\n\nRumours of terrible workplace conditions, especially for the so-called green badges. (Green badges are hired short-mid term employees)\n\nHilariously terrible and false marketing lately (Which they are receiving a lot of flak for in the tech tuber space) Possibly why their Chief Communications Officer, Claire Dixon just left.\n\nA freshly started ext-gpu division (Risky. Difficult to compete. A moneyhog if it doesn't work out)\n\nINTC also has a lot of debt.  \n\n\nAll in all I fear that they will be the new IBM of chip stocks.",
        "created_utc": 1600204844,
        "id": "g5ekgk2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600233644.0
    },
    {
        "author": "PerilousPostulation",
        "body": "Nvidia has certainly tried tie-ups with a CPU arch for perf gains before - the IBM Power CPUs in the summit supercomputer are directly lashed together with their Nvidia GV100s through a native NVLink interface rather than the usual switch chips\n\nI see why they might prefer to self-build an ARM variant of that concept over Power given the momentum of the ISA in servers and computers. But yeah, just don’t understand why the Apple route isn’t a better way to do it",
        "created_utc": 1599954695,
        "id": "g503lx3",
        "score": 2,
        "subreddit": "SecurityAnalysis",
        "created": 1599983495.0
    },
    {
        "author": "Rectilon",
        "body": "Is IBM a good 2 month hold? Any better options?",
        "created_utc": 1600089789,
        "id": "g587c93",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600118589.0
    },
    {
        "author": "oshtitswaynebradyson",
        "body": "I actually think a lot of the boomer stocks will bounce hard in the 2020s. Altria is in a nice position. Huge dividend and they are heavy into cannabis space. Chevron, Exxon, ATT, IBM, etc....all these boomer picks are super cheap now. They are better picks than these stupid software names at 100x earnings that are probably at a multi-decade top",
        "created_utc": 1600522412,
        "id": "g5t9run",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600551212.0
    },
    {
        "author": "Thanks-Feeling",
        "body": "Why don't you just reinvest the dividend from your IBM stock into shares of Apple stock?",
        "created_utc": 1599285445,
        "id": "g437an8",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599314245.0
    },
    {
        "author": "Trumpowell",
        "body": "Anyone see that huge order  on $IBM contracts 6049 traded 130C 8/4\n\nIs $IBM buying tikthot ?",
        "created_utc": 1599102275,
        "id": "g3sxtee",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599131075.0
    },
    {
        "author": "Dogburt_Jr",
        "body": "Because the terms are ill will/anti-competitive/monopolistic. They don't encourage a free market. I agree for &gt;80% of apps in-app payment should go through Google Play. I don't do so for Spotify, I pay through their website. Fortnite is entitled to do the same. Apple only cares because Fortnite is a massive revenue for them because of all the kids using parents credit cards on their iPhones.\n\nI disagree with Apple and Epic Games on a *lot* of their ethics policies. Epic Studios is a massive burnout hell for developers, and their business model is exploiting children under 18 y/o. The bell curve is likely averaged around 13 y/o. Apple holds an overbearing tight key over their software, very comparable to IBM in the early computer days and their business model is blatantly anti-consumer based on the design of a lot of their products and sales model. iPhones are physically the nicest phones to fix. But they will fight with everything they have to prevent repairs by 3rd parties.\n\nI think this is one time I actually like Epic Games.",
        "created_utc": 1599605530,
        "id": "g4ho12h",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599634330.0
    },
    {
        "author": "LePootPootJames",
        "body": "ZM larger market cap than IBM lol",
        "created_utc": 1598971566,
        "id": "g3ledwt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599000366.0
    },
    {
        "author": "TrudeausMakeupArtist",
        "body": "Me: I think IBM is making a pivot to cloud services, but the results are yet to be seen. I'll buy in at $115-118.\n\nMarket: Fuck your plan.",
        "created_utc": 1599063232,
        "id": "g3qfuxm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599092032.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If IBM changes their name to International Blockchain Machines they’d probably double in value.",
        "created_utc": 1599001219,
        "id": "g3nje0s",
        "score": 2,
        "subreddit": "investing",
        "created": 1599030019.0
    },
    {
        "author": "Furloughedinvester",
        "body": "I also understand that ZM is currently valued higher than IBM. We may not be in a bubble but we are definitely in something.  Maybe the Twilight Zone?",
        "created_utc": 1599100543,
        "id": "g3suslr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599129343.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If ibm traded at a pe of .00001 I would buy every share and collect millions in dividends for a few thousand dollars. Value absolutely does matter.",
        "created_utc": 1599030192,
        "id": "g3owlhc",
        "score": 2,
        "subreddit": "investing",
        "created": 1599058992.0
    },
    {
        "author": "BkkPla",
        "body": "Interesting, thanks for sharing. Yes it is indeed under the radar atm...had not heard of it actually until I saw your post...funny out of the 1000's of posts I decided to look up KC (and you mentioned a few others too I recall) - I do look at tickers I see in the feed but not that often...yours were all unknown to me, I think that was the draw.\nMaybe its the next Sino MSFT/IBM....we can only dream\nGood luck - hope it roars!",
        "created_utc": 1601318929,
        "id": "g6zbvix",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601347729.0
    },
    {
        "author": "radioref",
        "body": "IBM, Honeywell, Ford, GE, Kellogg, Exxon, Phillip Morris.",
        "created_utc": 1599415173,
        "id": "g494fcs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599443973.0
    },
    {
        "author": "BigEd781",
        "body": "SQL was initially conceived of at IBM. Oracle (then Relational Software Inc. iirc) saw it's potential and quickly developed their implementation. They also own the licensing rights to java, but you're right in implying they are a dinosaur for the most part.",
        "created_utc": 1600051715,
        "id": "g570dmx",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600080515.0
    },
    {
        "author": "HwanZike",
        "body": "Big companies have issues and risks due to their sheer size. There's also risks of new paradigm shifts. History usually repeats itself, people think companies like FAGMAN will continue to grow and be dominant. Look at how the big ones fell, from railway companies back in the 1900 to more recent history with GM, F, X, AT&amp;T, GE, AIG, C, XOM, ICBC, IBM, to name a few. Who knows what the next big companies will be? Or what sectors? Biotech? Clean energy?\n\nCheck this podcast episode that touches on it: https://rationalreminder.ca/podcast/113",
        "created_utc": 1600391211,
        "id": "g5nm59t",
        "score": 2,
        "subreddit": "investing",
        "created": 1600420011.0
    },
    {
        "author": "hungry_koala",
        "body": "Buy index funds. Seriously. know you’re probably thinking you can beat the market. I’ve been investing/trading for almost 3 years and I’ve been there before. I set out with the intention of beating the market, and was successful at some points. Let me tell you I would have better far better off if I just started with building a good foundation (index funds). Now I’m 25 and while I’ve made some good investments ultimately my losses are still weighing me down (that said some of my investment theses have not played out so this can change in the future). To give some more perspective, I’ve been working for 2 years and 4 months and I only have one years worth of max contributions in my 401k, Roth IRA, and HSA, when I could easily have maxed it out this whole time.\n\nGranted this isn’t a terrible position to be in—I’m probably still ahead of many people my age and even some older than me. I’m grateful for this and count my blessings every day. But I’d be so much further along in my journey if I didn’t indulge in so much speculation and gambling (yes even investing in companies like Apple or Microsoft for the long term is not foolproof.. just look back at giants past of the S&amp;P and see where they are today. IBM, XOM, Enron are some classic example). Index funds are truly the only investments you can blindly hold for a long period of time with minimal re evaluation and decision making.\n\nAs for what to buy, look for the lowest cost index funds you can find. VOO or VTI are classics. If you have fidelity, they have zero fee equivalents (FNILX,FZROX), which can save you a lot of money over time if you take into account compounding gains. Hope this helps!",
        "created_utc": 1600451040,
        "id": "g5q2oy5",
        "score": 2,
        "subreddit": "investing",
        "created": 1600479840.0
    },
    {
        "author": "darqmachine",
        "body": "Yes it is. A Reverse Iron Condor is the same as an Iron Condor while a Reverse Iron Butterfly is the opposite of a Butterfly. You use the Butterfly or the Iron Condor on stocks that exhibit a Delta Neutral Pattern as in no movement. Stocks like GE, Ford, Fitbit, Gopro, IBM have been stagnant over the past 2 or 3 months. On these they are perfect for Condors or Butterflies because the stay within a certain price range. On these you want to look at the the Greeks I mentioned earlier and then look at the Vix.",
        "created_utc": 1600545794,
        "id": "g5uszbx",
        "score": 2,
        "subreddit": "options",
        "created": 1600574594.0
    },
    {
        "author": "honor-",
        "body": "&gt;Well artificial intelligence is used in -Vaccine research -Cyber security -medicine -computer programming -Mass Production of good\n\nYou seem to have a very limited understanding of current capabilities of AI. But let me keep it simple: AI can not think or reason, it is only used for limited tasks that involve crunching huge amounts of data that humans cannot. Now you need to ask yourself the question of whether or not IBM can do this for profit and grow their sales of AI services.\n\n&amp;#x200B;\n\n&gt;Because of covid 19 I don’t think big corporate companies are going to want humans they are expensive and are snowflakes. There for most major companies will be more inclined to robots and artificial intelligence\n\nOK, among AI professionals IBM Watson is kinda considered a joke that did good at Jeopardy and nothing else. It's tried to expand into health but very few hospitals take it, and even then its only used in limited capacity to evaluate its judgements. I haven't heard of it being used widely, and there are certainly no clinical studies that have been done to evaluate any improvements over human professionals. Just the clinical study part should give you massive pause.\n\n&amp;#x200B;\n\n&gt;Plus you don’t have to pay taxes for employing artificial intelligence🤷🏼\n\nI don't even know what this means. No one is close to using Watson to replace human workers in anything.\n\n&amp;#x200B;\n\n&gt;Edit: I’m not saying buy the stock because I actually waiting for the dip I’m hoping the stock won’t go up but down\n\nIBM has been in decline for 8 years in spite of massive share buybacks. Their acquisitions have been garbage and they're a garbage company. They will need a total overhauling as a company if they want to have growth in the future.\n\n&amp;#x200B;\n\n&gt;Edit: When you walk down the street do you see IBM on the street or when you drive or when you go to the store no they are not a consumer goods product but corporate product. Pandemic happens corporations cut costs and restructure most companies will want to have less human work force thus AI will take over go to Walmart and look at the self checkout or when you go to a amazon warehouse tell me what you see boy.\n\nAgain, no one is using IBM's crappy Watson AI. They're making their own AI solutions.",
        "created_utc": 1600638321,
        "id": "g6197vx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600667121.0
    },
    {
        "author": "BunkyL",
        "body": "WFC 23C 9/25 bought right at close\n\nIBM 120C 9/25 bought right at close\n\nFDS 350C (earnings) \n\nHon 162.5C 10/16 bought at noon...\n\nACN 237.5C 10/16 bought at noon...  (earnings)",
        "created_utc": 1600894896,
        "id": "g6cv4ex",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600923696.0
    },
    {
        "author": "adayofjoy",
        "body": "Nike which is in an even bigger bubble (PE of 75) keeps going up.\n\nCostco which is more expensive than Google (PE of 41) keeps going up.\n\nUnder Armor which isn't even profitable just jumped 5% today.\n\nImo it's the fear of tech from the dot com bubble that's causing the real selloff rather than tech actually being in a bubble (at the very least it's not nearly the biggest bubble around). Even very cheap tech stocks such as IBM are getting dumped.",
        "created_utc": 1600908301,
        "id": "g6df5jm",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1600937101.0
    },
    {
        "author": "Kangaroos2020",
        "body": "Rumors of IBM acquiring Cloudera have been around for awhile, CLDR would go to moon if so",
        "created_utc": 1598987982,
        "id": "g3mnl0k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599016782.0
    },
    {
        "author": "Smooothoperat0r",
        "body": "Just a sticking point here: GE and IBM had huge cash flows for decades that led to a sharp decline in stock price because they were cash rich but growth poor. Today both are miniature versions of their former behemoth selves.",
        "created_utc": 1599014965,
        "id": "g3obwlf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599043765.0
    },
    {
        "author": "khizoa",
        "body": "not to be an ass, but no relevance whatsoever. esp since OP asked about EXPLOSIVE GAINS, in the next FEW YEARS. they're not even relevant RIGHT NOW\n\noil companies will eat shit\n\nsears is already eating shit\n\nibm is pretty stagnant unless they innovate to keep up with tech\n\ngoodyear, i guess they can keep making tires or whatever they do, as there will always be cars. but the only explosive gains will be the random trump pump that theyre being treated unfairly",
        "created_utc": 1598980418,
        "id": "g3m2qqb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599009218.0
    },
    {
        "author": "redroverster",
        "body": "IBM, Mobil, Exxon, Sears, Goodyear",
        "created_utc": 1598961371,
        "id": "g3krlu3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990171.0
    },
    {
        "author": "Itsawhazzyitsawhoozy",
        "body": "I bought some stock on June 1st, not the best day price wise but it’s the stock I plan to hold the longest out of my whole portfolio, except for MSFT maybe. I made a DD for myself and made a brief summary around April. Most of it is based on their 10-K last year and their first 10-Q of the year. The key here is that this has been seen as a dinosaur for the past decade, due to lack of innovation, terrible management decisions (crazy high EPS and a buyback program that should have been cut long ago), and recruiting issues. A new CEO (Arvind Krishna) and a switch to the cloud (and quantum computing for the 2030s at least) are the key changes that could drive change. Sorry if it’s a bit messy, was not meant to be posted when I wrote it : \n\nIBM : New CEO Arvid Krishna has my trust, hope he will change top and mid tier management (which did weird accounting tricks like the pseudo Lenovo « sale/buy », laid off workforce for no reason, did not R&amp;D enough, focused on business services and consulting too much, had the crazy 20$ EPS goal, etc…). Krishna pushed Red Hat acquisition (open source enterprise software, will allow them to become hybrid cloud providers, hybrid cloud is interoperable (BFF example), scalable (ERP switch to 3rd parties), portable, and secure (user data still in private cloud)). Krishna was senior VP for cloud and cognitive software. \nIBM has switched industries several times throughout its life : time clocks, then tabulating machine, then typewriter, then mainframe (good changes), then personal computers (good initially but then poor because used competitors’ chips), etc… Cloud/AI could be their next successful switch (1/3rd of revenue in 2019, still increasing). Quantum Computing too, as they’ve strongly positioned themselves as industry leaders, but that’s in the very, very long run.\nWhile not the most important aspect, company is a dividend aristocrat (increasing div payout for 25 years), but what matters is that div payment was never removed, even though I think it should have been decreased during the struggles of the 2010s and instead reinvested in R&amp;D, they should have also paused their share buyback program. Financials : P/E around 10 (very good for a tech company), P/BV is 5.5 (good for a tech company, especially one transitioning to less tangible assets), net income slowly increasing, current ratio of nearly 1 at end of 03/31 which is decent given Red Hat acquisition and coronavirus, D/E is 2.62 (that one is indeed bad, but they got cash I guess, still not great).",
        "created_utc": 1599125472,
        "id": "g3tpsfi",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1599154272.0
    },
    {
        "author": "FireEraser",
        "body": "Why would any of those companies want to buy IBM?",
        "created_utc": 1599070284,
        "id": "g3qy3t7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599099084.0
    },
    {
        "author": "shatterkneesinc",
        "body": "cmon cscso even ibm mooned today",
        "created_utc": 1599069693,
        "id": "g3qwn2w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599098493.0
    },
    {
        "author": "Lambotherambo",
        "body": "You said it could never get to the size of google fairly explicitly. Google is already a dinosaur and in 10 years time will be viewed as an IBM of sorts. AWS is not blocked from being the next current “Google” at all",
        "created_utc": 1599074446,
        "id": "g3r8zn3",
        "score": 1,
        "subreddit": "investing",
        "created": 1599103246.0
    },
    {
        "author": "Jarlaxle_rigged_it",
        "body": "NFLX was starting a great run before this fing shit. even managed to try to break up yesterday while everything was crashing. dd plz on that solid stock&lt;3\n\nINTC ofc (all that insider buying) \n\nSomehow AVGO/IBM barely felt this thing, might be good tech+cyclical trades..",
        "created_utc": 1599250717,
        "id": "g41b97v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599279517.0
    },
    {
        "author": "sirajgb",
        "body": "Airbus, ibm (people make fun of it but they are one of the leaders on developing quantum computing, including the prog language), Ericsson (5g play) Eon",
        "created_utc": 1599241794,
        "id": "g40k92i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599270594.0
    },
    {
        "author": "soupmonster40",
        "body": "lol yeah. I inverse WSB.\n\n\"intel is the next IBM\" --&gt; buy intel &amp; Micron\n\n\"oil is dead\"--&gt; buy oil\n\n\"NET sucks it's a meme stock\" --&gt; buy NET",
        "created_utc": 1599261430,
        "id": "g4256lr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599290230.0
    },
    {
        "author": "Kramer-Melanosky",
        "body": "Your comparison is absurd. Microsoft would have become another IBM if not for Sathya Nadela. \n\nIntel is lagging in technology for quite a while. Without any positive news in near future, it's a gamble. It can be become next Microsoft or IBM.\n\nMobile Eye I good, but with chances of their major revenue going down and gap between ADM widening over next few years. I don't feel it's worth it.",
        "created_utc": 1599424001,
        "id": "g49kgv5",
        "score": 1,
        "subreddit": "investing",
        "created": 1599452801.0
    },
    {
        "author": "bitflag",
        "body": "I think Intel is already close to being IBM. They consistently gave up on new markets (ie mobile, high end GPU, modems) because it is initially small and expensive, which let the competition take those juicy new trends while Intel got stuck the same old x86 chips it's been doing for 4 decades.\n\nManufacturing problems is only salt on the wound. It's accelerating the decline because it was Intel moat in it's core business.",
        "created_utc": 1599448655,
        "id": "g4apa51",
        "score": 1,
        "subreddit": "investing",
        "created": 1599477455.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Bit of a personal anecdote here:\n\nSo I have a degree in IT with a focus on Computer Networking.\n\nI once interviewed for IBM because they had positions open for Network Admins.  Unfortunately, when I sat down and looked over their list of jobs I discovered that they were only looking for senior level positions (something they did not mention in the email they sent to my university).\n\nI decided to interview anyway because I was already there in suit and tie so I wasn't about to get all dressed up for nothing.\n\nThe interview went well, but the guy told me he just didn't have anything for me at the time.\n\nI decided to walk around afterwards and saw a guy interviewing for entry level programmers.  My campus did not offer a Software degree (they offered it at a different campus), but I did have to take 9 credits in basic programming which was Java, C++, and HTML.  I had already taken the Java and C++ classes.\n\nI sit down with the guy and we get to talking.\n\nHe asks my background in coding.  I tell him one intro in Java and C++ so far.\n\nHe asks why am I interviewing if my degree is not focused on coding.  I tell him because those two classes opened my eyes to something that I didn't even know I wanted before.  I love creating stuff with code, I find it cathartic to sit and stare at code, getting lost in it while trying to figure out where my errors are, the absolute joy of finally getting it to compile and run.  I even started to make some basic programs at home in my free time.\n\nHe asks me if I have any of my work to show him.  I did not bring any copies of my code because I wasn't even thinking about the possibility of interviewing for any other positions (let this be a lesson to anyone who's still getting their degree, bring everything!).\n\nI tell him I did have it on a thumb drive that I carry around in my briefcase, but of course he waves his hand and says that's a security issue (totally agreed).\n\nHe asks me what a function is.  I draw a blank.  I ended up stammering out something like, \"it's the part of the code that does stuff\".  Not necessarily wrong, but more of an ELI5 definition.\n\nHe shows me some code and asks what I can decipher from it.  It's a function that takes a variable, runs it through a formula, returns a variable, and then loops 4 more times using the new return variable each time, and finally shows a set of the return variables at the print out.  He confirmed that I was right.\n\nHe asks me what that sets of numbers is called.  Obviously it's an array, and I had heard the term before, but again I did not know at the time.  He frowns and says something along the lines of, \"You really don't know basic terminology.  You should work on that.\"\n\nWe shook hands and parted ways, never got a call back.  Now, I know I messed up by not having some of my work printed out, and not being up on the terminology.  But it really rubbed me raw that this guy was so hung up on terminology, knowing that coding was like 5% of my entire degree, and yet I still had a basic working knowledge of programming to at least be able to read and understand what was going on, and that I was passionate enough about it to go home and write some basic programs of my own.\n\nNow I don't know that the lack of terminology was the ultimate reason I was turned down.  I do know that they were looking to start up a class that would take about 3 years to go through, and they were going to teach a proprietary language that was similar to Java.  Obviously, the terminology would have been brought up again multiple times in that 3 year program.  The only clue I had for why I was turned down was the lack of lingo.\n\nI am now a manager at a FinTech company, and I don't ask \"lingo\" questions of interviewees.  I want to know if they understand the meat and potatoes of what the job entails because, to me, that means so much more.  Lingo will happen over time as they do the job.\n\nI'm not saying that is all the OP was concerned about in their interviews, but they certainly seem to think it's a flaw in an interviewee that makes them unsuitable for hiring.",
        "created_utc": 1599457511,
        "id": "g4b12z3",
        "score": 1,
        "subreddit": "investing",
        "created": 1599486311.0
    },
    {
        "author": "ElitePhoenix-",
        "body": "Trust if this worked I'd be buying stuff at half price\n\nWorked a little with IBM once lol",
        "created_utc": 1599488527,
        "id": "g4c0prf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599517327.0
    },
    {
        "author": "Lazybumm1",
        "body": "I'm very bullish on NVIDIA but I think you are overestimating some of its competitive advantages. Raytracing will probably become industry standard sooner or later and supported across either platform. DLSS is something AMD or any other company with a bunch of ML engineers and money can replicate given some time. \n\nIt's not impossible for other companies to replicate or immitate or substitute some of those technologies / products. AMD is certainly catching up and will carve off some fractions of the market in the AI/ML &amp; datacenter businesses.\n\nThe ARM acquisition, if it happens, will confer a competitive advantage like no other. As an NVDA stockholder I wish this happens. As a Brit working in and loving tech, I am slowly dying on the inside... \n\nSomething to remember is that this is a fast expanding market and not a saturated one, there's room for multiple players to grow and win at the same time. \n\nThat being said, I still think Intel will likely be the next IBM. Is it gonna tank overnight? No, and there will probably be plenty of rallies to make money off, but long term I wouldn't look to hold.",
        "created_utc": 1599305308,
        "id": "g440s54",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599334108.0
    },
    {
        "author": "ThemChecks",
        "body": "This seems pretty fair honestly. IBM isn't a bad dividend stock for what it's worth.",
        "created_utc": 1599308082,
        "id": "g445t5l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599336882.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "I trim profit and move it into VTI.  I don't trust any individual company, or even most other ETFs, to be around and at a higher price in the next 30 years.\n\nDon't trust any of them, not even the FNMAGA stocks.  You can go all the way back to RCA, F, GM, GE...up to INTC, CSCO, IBM...really any time period since stocks have been traded and find plenty of examples of companies that became value traps for investors.\n\nThe broad markets continue to go up and are the closest thing to a guarantee you will probably find in the stock market.",
        "created_utc": 1599747124,
        "id": "g4okgjy",
        "score": 1,
        "subreddit": "investing",
        "created": 1599775924.0
    },
    {
        "author": "OverAndUnder500",
        "body": "IBM Watson: Bulls are fucked.",
        "created_utc": 1599761991,
        "id": "g4pyrbn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599790791.0
    },
    {
        "author": "WALKIEBRO",
        "body": "Its IBM",
        "created_utc": 1599696951,
        "id": "g4lqbzl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599725751.0
    },
    {
        "author": "radioref",
        "body": "Are my IBM calls going to print?",
        "created_utc": 1599520409,
        "id": "g4dzx4h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599549209.0
    },
    {
        "author": "Waterwoo",
        "body": "Microsoft was heading the way of IBM until they replaced Balmer and shook up the culture. Any signs the same is coming at Intel?",
        "created_utc": 1599500097,
        "id": "g4cs76y",
        "score": 1,
        "subreddit": "investing",
        "created": 1599528897.0
    },
    {
        "author": "11coffee",
        "body": "There was some sort of joke in the eighties that you'd never get fired for buying IBM. Well what would be the 2020 company you'd never get fired for buying?",
        "created_utc": 1599624798,
        "id": "g4ilgqn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599653598.0
    },
    {
        "author": "PUDDING_SLAVE",
        "body": "NOK, ERIC, Qualcomm, Apple",
        "created_utc": 1599093001,
        "id": "g3sgxzk",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599121801.0
    },
    {
        "author": "twood886",
        "body": "QCOM investors from 1999 have entered the chat",
        "created_utc": 1599231488,
        "id": "g3zq8uj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599260288.0
    },
    {
        "author": "HAC522",
        "body": "My bad, guys. I did the math and determined QCOM was consistently going up at least 10 bucks every single month, with lots of good news to support the rise. Therefore, I bet down on some totally reasonable 10/2 130c's yesterday. \n\nSo, of course, that's why the tech sector tanked.",
        "created_utc": 1599176957,
        "id": "g3xaosr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599205757.0
    },
    {
        "author": "HAC522",
        "body": "My bad, guys. I did the math and determined QCOM was consistently going up at least 10 bucks every single month, with lots of good news to support the rise. Therefore, I bet down on some totally reasonable 10/2 130c's yesterday. \n\nSo, of course, that's why the tech sector tanked.",
        "created_utc": 1599177143,
        "id": "g3xbh49",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599205943.0
    },
    {
        "author": "FloridaguyinOhio",
        "body": "Oh yes-  I have them and QualComm on my watch list.",
        "created_utc": 1599159416,
        "id": "g3vwlki",
        "score": 3,
        "subreddit": "investing",
        "created": 1599188216.0
    },
    {
        "author": "HAC522",
        "body": "You guys should get in QCOM",
        "created_utc": 1599089604,
        "id": "g3s9qit",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599118404.0
    },
    {
        "author": "Jm2421",
        "body": "Qualcomm",
        "created_utc": 1599091440,
        "id": "g3se1p5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599120240.0
    },
    {
        "author": "Reeeetail_Investor",
        "body": "Got currently:\n\nAAPL 150c 9/11\nQCOM 130c 9/11\n\nThinking about TSLA puts if the market starts getting choppy.",
        "created_utc": 1599097295,
        "id": "g3soyzz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599126095.0
    },
    {
        "author": "MrMineHeads",
        "body": "His valuation was pretty ass tbh. Plus who thinks that Intel is gonna double revenue in 10 years with competitors as fierce as AMD, Qualcomm, and others. Honestly, good luck. My rough DCF analysis put it has like $55/share, with 7% growth in revenue per year for 5 years (a generous amount).",
        "created_utc": 1599097899,
        "id": "g3sq3qd",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599126699.0
    },
    {
        "author": "BeastInfection",
        "body": "Agreed, QCOM, TSM, among others just lost billions in future investment from selling chips to China. TSMC is the big loser in this since new nodes are so crazy expensive now and they need crazy volume to drive down cost of production and still have enough to invest billions in the next node. Samsung is also a huge loser. I bet you they were almost excited for a few hours at the TSMC/Huawei ban, before realizing they would probably be covered as well.",
        "created_utc": 1599179221,
        "id": "g3xg9e6",
        "score": 2,
        "subreddit": "investing",
        "created": 1599208021.0
    },
    {
        "author": "sr603",
        "body": "I think qualcomm is another supplier also. Research it of course lol.",
        "created_utc": 1598977677,
        "id": "g3lur9j",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1599006477.0
    },
    {
        "author": "happierdayz4me2",
        "body": "Yeah, pre earnings. Then averaged then theta and lack of volume/movements nullified the 2k in gains that were trying to offset the initial 5k losses. I was promised stonks only go up and I was unaware that good news and fundamentals = sell off. \n\nMade a nice chunk off qualcomm and tup but my positions were limited by how much I sunk into atvi sept calls.",
        "created_utc": 1598997639,
        "id": "g3nbxlu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599026439.0
    },
    {
        "author": "Joeychaps1231",
        "body": "Of course I dump qcom and it’s up 3% 😭",
        "created_utc": 1598959364,
        "id": "g3kovg3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598988164.0
    },
    {
        "author": "PoliticsRealityTV",
        "body": "I think it's closer to QCOM",
        "created_utc": 1598954821,
        "id": "g3kkbok",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598983621.0
    },
    {
        "author": "ntrsfrml",
        "body": "AAPL, MSFT, QCOM, TSM, NET, SOXX, ARKK, TEC &amp; WCLD",
        "created_utc": 1599122617,
        "id": "g3tn7ei",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599151417.0
    },
    {
        "author": "CoolMoo5e",
        "body": "In the tech sector I have AAPL, AMD, INTC, TSM, NVDA, and QCOM.",
        "created_utc": 1599084644,
        "id": "g3ryzak",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599113444.0
    },
    {
        "author": "happierdayz4me2",
        "body": "This. But also nokia and Eric. Qualcomm even has automakers on lock.when you see anti trust news and then news of its appeal getting a stay, buy",
        "created_utc": 1599098317,
        "id": "g3squfq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599127117.0
    },
    {
        "author": "LanN00B",
        "body": "I missed that boat by being to poor and going long on Nokia instead of Nokia's supply chain like qcom in March. Maybe trim a few things and see what I can do over the next 2days but dam that premium",
        "created_utc": 1599090496,
        "id": "g3sbsqt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599119296.0
    },
    {
        "author": "theFriendlyDoomer",
        "body": "I mean, I do make bets.  They are just slow developing.  I'm long WMT, DISCA, JNCE, and got QCOM at a decent price so I'm holding.\n\nI'm building/shifting into EDV right now. So I'm starting to bet the economy is going to drag this market down after all (also, decent chance of overreaction to the election/aftermath).",
        "created_utc": 1599184284,
        "id": "g3xpkd1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599213084.0
    },
    {
        "author": "Stock2malone",
        "body": "Down about 65k.. Mostly all gains.. Fell in love with my contract positions.. Smh... Qualcomm 115c, tsla 400c 09.25,aapl 125c 10/02..hd 10/16.. Hoping for a nice v recovery to begin really soon lol... We got this",
        "created_utc": 1599204715,
        "id": "g3yiki2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599233515.0
    },
    {
        "author": "CountingCrush",
        "body": "It's already confirmed to be using 5g Qualcomm radios",
        "created_utc": 1599234221,
        "id": "g3zy25d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599263021.0
    },
    {
        "author": "Uniqueguy264",
        "body": "Didn't this guy lose $70 billion in 2000? I get the feeling he's done this before, you look at QCOM and CSCO and they have familiar looking stupid runups",
        "created_utc": 1599230843,
        "id": "g3zodj8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599259643.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  1st of September\n\n\n\n## Upcoming events for Tuesday, September  1st\n\n - Stock splits:\n\n    - INOTF @ **2:11**\n\n - Expected earnings:\n\n  ANAT, ASFI, AZRX, BBW, BWL.A, CAL, CDMO, CEA, CIG, CVV, DRD, GEC, GILT, HIHO, HMY, HOME, HRB, IDXG, JAMF, JILL, KBSF, KEN, METX, MFAC, NOVN, NSSC, NVUS, RBCN, SCPE, SCVL, SYNL, TC, TEUM, UTSI, WSG\n\n - Ex-div:\n\n  AROW, AVY, EBIX, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FOX, FOXA, FPF, FPL, FSD, FTHY, GHL, HAL, HLI, ICL, IGD, IID, ITUB, KRNY, MYE, NPO, NVDA, ODFL, OPOF, PAHC, PJT, RCKY, RE, SLB\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -4.524M)\n    - Construction Spending (consensus: 1.0%, previous: -0.7%)\n    - Dallas Fed Services Revenues (previous: -8.5)\n    - FOMC Member Brainard Speaks\n    - ISM Manufacturing Employment (consensus: 45.8, previous: 44.3)\n    - ISM Manufacturing New Orders Index (previous: 61.5)\n    - ISM Manufacturing PMI (consensus: 54.5, previous: 54.2)\n    - ISM Manufacturing Prices (consensus: 54.0, previous: 53.2)\n    - Manufacturing PMI (consensus: 53.6, previous: 50.9)\n    - Redbook (previous: 0.6%)\n    - Redbook (previous: 4.1%)\n    - Texas Services Sector Outlook (previous: -26.7)\n    - Total Vehicle Sales (previous: 14.50M)\n\n## Upcoming events for Wednesday, September  2nd\n\n - Expected earnings:\n\n  AKER, AMBA, AMRH, APWC, ATLC, BCOW, BF.A, BF.B, BMA, BROG, CBLI, CEI, CLDR, CPRT, CRWD, CTXR, CVU, EGAN, FIVE, FMCI, GES, GSX, GWRE, HMG, HOTH, HTHT, HUSA, IPDN, JFIN, KEP, KFFB, KLXE, LE, LMFA, M, MBOT, MCEP, MDB, MEIP, MIND, MTRX, OBSV, PD, PPSI, PRCP, PSV, PVH, QTT, REXN, RKT, SAIC, SMAR, SMIT, SNP, SPWH, TDAC, VRA, VRNT, WORX, WUBA, XIN, YGYI, ZNH, ZUO\n\n - Ex-div:\n\n  AMCR, BBD, BBDO, CEO, FORTY, HD, LIN, LZB, MOS, PEBK, PTEN, QCOM, RMBI, SSTK, TER\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 950K, previous: 167K)\n    - Beige Book\n    - Crude Oil Imports (previous: -1.040M)\n    - Crude Oil Inventories (consensus: -1.950M, previous: -4.689M)\n    - Cushing Crude Oil Inventories (previous: -0.279M)\n    - Distillate Fuel Production (previous: 0.380M)\n    - Durables Excluding Defense (previous: 9.9%)\n    - EIA Refinery Crude Runs  (previous: 0.225M)\n    - EIA Weekly Distillates Stocks (consensus: -1.450M, previous: 1.388M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -7.0%, previous: 1.1%)\n    - FOMC Member Mester Speaks\n    - FOMC Member Williams Speaks\n    - Factory Orders (consensus: 6.0%, previous: 6.2%)\n    - Factory orders ex transportation (previous: 4.4%)\n    - Gasoline Inventories (consensus: -3.575M, previous: -4.584M)\n    - Gasoline Production (previous: 0.118M)\n    - Heating Oil Stockpiles (previous: 0.294M)\n    - ISM NY Business Conditions (previous: 53.5%)\n    - ISM-New York Index (previous: 807.8)\n    - MBA 30-Year Mortgage Rate (previous: 3.11%)\n    - MBA Mortgage Applications (previous: -6.5%)\n    - MBA Purchase Index (previous: 310.2)\n    - Mortgage Market Index (previous: 770.6)\n    - Mortgage Refinance Index (previous: 3,423.0)\n    - Sec Kashkari Speaks\n    - Seevol Cushing Storage Report (previous: -0.010M)\n\n## Upcoming events for Thursday, September  3rd\n\n - Expected earnings:\n\n  AIM, AKTX, AOUT, AVGO, BNED, BNTC, BYSI, CIEN, CKX, CLUB, CONN, COO, CPB, CTHR, CULP, DBI, DCI, DLTH, DOCU, DOMO, FFBW, FFHL, FIZZ, FLR, GCO, GMS, GRNQ, GROW, GTT, HOFT, HOV, IROQ, JW.A, JW.B, KFY, KIRK, KZIA, MDLA, MEI, MIK, MOMO, MSON, NX, OXM, PBIO, PDCO, PDEX, PZG, SCX, SECO, SFET, SHLO, SIG, SPCB, SWBI, TLYS, TTC, TWMC, UBA, UBP, VEDL, VOLT, WVFC, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AJG, AMNB, BAC, BBL, BF.A, BF.B, BHP, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CHRW, CRH, D, ESBK, FDX, FFNW, FNB, FRME, GOLF, GPC, ICBK, KMB, KNX, LCII, MBCN, MBWM, MLI, MLR, NAVI, NFE, NNA, ORI, OTEX, PEP, RF, SEE, SLM, SNR, STRA, SU, TGNA, TILE, TRST, TT, UFCS, UNF, WM, YY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.090%)\n    - Challenger Job Cuts (previous: 262.649K)\n    - Chicago Fed President Evans Speaks\n    - Continuing Jobless Claims (consensus: 14,000K, previous: 14,535K)\n    - Exports (previous: 158.25B)\n    - ISM Non-Manufacturing Business Activity (consensus: 65.0, previous: 67.2)\n    - ISM Non-Manufacturing Employment (previous: 42.1)\n    - ISM Non-Manufacturing New Orders (previous: 67.7)\n    - ISM Non-Manufacturing PMI (consensus: 57.0, previous: 58.1)\n    - ISM Non-Manufacturing Prices (previous: 57.6)\n    - Imports (previous: 208.95B)\n    - Initial Jobless Claims (consensus: 950K, previous: 1,006K)\n    - Initial Jobless Claims (previous: 1,006K)\n    - Jobless Claims 4-Week Avg. (previous: 1,068.00K)\n    - Markit Composite PMI (consensus: 54.7, previous: 54.7)\n    - Natural Gas Storage (consensus: 47B, previous: 45B)\n    - Natural Gas Storage (previous: 45B)\n    - Nonfarm Productivity (consensus: 7.5%, previous: 7.3%)\n    - Services PMI (consensus: 54.8, previous: 54.8)\n    - Trade Balance (consensus: -58.00B, previous: -50.70B)\n    - Unit Labor Costs (consensus: 12.1%, previous: 12.2%)\n\n## Upcoming events for Friday, September  4th\n\n - Expected earnings:\n\n  ANIX, ATHE, ATNM, BMRA, BRC, CCH, CNNB, FSEA, GENE, GMHI, GVA, HURC, IBIO, IMRN, IRCP, JG, JKS, LFAC, MARPS, MSB, NFIN, PKX, QD, TNP, YIN\n\n - Ex-div:\n\n  AFIN, BPOP, EGOV, FAF, FANH, GBDC, LOB, PBIP, PE, PWOD, SVBI, UVSP, WRI\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.5%, previous: 4.8%)\n    - Average Hourly Earnings (previous: 0.2%)\n    - Average Weekly Hours (consensus: 34.5, previous: 34.5)\n    - CFTC Aluminium speculative net positions (previous: 211.8K)\n    - CFTC Copper speculative net positions (previous: 47.9K)\n    - CFTC Corn speculative net positions (previous: -17.4K)\n    - CFTC Crude Oil speculative net positions (previous: 500.7K)\n    - CFTC Gold speculative net positions (previous: 221.0K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 19.7K)\n    - CFTC Natural Gas speculative net positions (previous: 13.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -86.6K)\n    - CFTC Silver speculative net positions (previous: 31.3K)\n    - CFTC Soybeans speculative net positions (previous: 143.3K)\n    - CFTC Wheat speculative net positions (previous: 18.4K)\n    - Government Payrolls (previous: 301.0K)\n    - Manufacturing Payrolls (consensus: 50K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 1,400K, previous: 1,763K)\n    - Participation Rate (previous: 61.4%)\n    - Private Nonfarm Payrolls (consensus: 1,265K, previous: 1,462K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 180)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - U6 Unemployment Rate (previous: 16.5%)\n    - Unemployment Rate (consensus: 9.8%, previous: 10.2%)\n\n^^^^2020-09-01",
        "created_utc": 1598954413,
        "id": "g3kjxt6",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1598983213.0
    },
    {
        "author": "analyst_84",
        "body": "QCOM topped 1 day after 4:1 split in 99",
        "created_utc": 1599126549,
        "id": "g3tqrqm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599155349.0
    },
    {
        "author": "happierdayz4me2",
        "body": "I'm with you on concern for the market correction, aside from ATVI, im mostly in leaps for 5G, call wise. Qualcomm has made me a lot recently. \n\nAs for how how ATVI will perform under a correction, I think it will fare better than most. The minor pullback today didn't phase atvi and it feels almost impervious* (I know it's not). It is at ATH levels so that is a risk, but it's fundamentals make it not crazy overvalued going into its best holiday season. Santa comes recession or not. If trump is reelected tech stocks should stay afloat into the winter (not an economist) and if biden wins, he'll give everyone enough money to buy a console and blow a wad on microtransactions.\n\nNot quite sure what you mean by selling covered puts. \n\nI do see a long play in chevron and I'll look that up, thanks.",
        "created_utc": 1599081006,
        "id": "g3rqx0i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599109806.0
    },
    {
        "author": "Desmater",
        "body": "I said worst case scenario, it trade sideways.\n\nIt's at 10 PE and AMD, NVDA, QCOM, etc. All have huge multiples.",
        "created_utc": 1599091740,
        "id": "g3semla",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599120540.0
    },
    {
        "author": "HAC522",
        "body": "QCOM 130C 10/2",
        "created_utc": 1599093312,
        "id": "g3shikm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599122112.0
    },
    {
        "author": "gravycap",
        "body": "Where I live i am not legally allowed to trade in the stocks. But recently few new web services has allowed me. Almost everyday i would think about investing in the us stocks but I had to settle for stocks in my own country. I did lot of study my thesis everything on this topic. So on 22/06/2020 i started. Not a great time to enter. Made few mistakes at the beginning because of excitement.\n\nI can't predict every ups and downs. This one is very similar to 1999/2000. Check CSCO and QCOM chart for the period. You will see amazing similarity. And if you are asking why these stocks they were the market leaders of the time and their split marked the beginning of a bear market.",
        "created_utc": 1599183329,
        "id": "g3xnukp",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599212129.0
    },
    {
        "author": "Cryonyx",
        "body": "QCOM gave me PTSD",
        "created_utc": 1599089669,
        "id": "g3s9vzg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599118469.0
    },
    {
        "author": "ThinCrusts",
        "body": "I see him doing what Qualcomm did back in the 90's. Offer multiple splits in less than twice in less than 6 months, back in May 1999 and December 1999.",
        "created_utc": 1598971874,
        "id": "g3lf87d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599000674.0
    },
    {
        "author": "SipUrine",
        "body": "I've read articles that both Qualcomm and Broadcom will be making network chips for iphone. Which is it?",
        "created_utc": 1599010595,
        "id": "g3o42i0",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599039395.0
    },
    {
        "author": "iKalculated",
        "body": "Follow Up: The unusual options activity that seems to be repeating on QCOM is not an error. Each trade is unique",
        "created_utc": 1599012168,
        "id": "g3o6xk3",
        "score": 1,
        "subreddit": "options",
        "created": 1599040968.0
    },
    {
        "author": "Matrix1216",
        "body": "Yes, and if and when we do have a market correction, these stocks will fall a lot more. I’d buy it on any down day though And hold. Easily $600+ by the end of the year. Along with the other semis/chips too, AMD, Qualcomm",
        "created_utc": 1599013452,
        "id": "g3o98we",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599042252.0
    },
    {
        "author": "catarahbpus",
        "body": "26-year-old, long term investor. Let me know what you guys think or any suggestions!\n\nMSFT (20%)\nQCOM (18%)\nMU  (8.25%)\nLOW (7.5%)\nT (6.5%)\nWFC (5.8%)\nKO (5.5%)\nABBV (4.2%)\nLEVI (4.1%)\nAFL (4%)\nRTX (4%)\nDUK (3.5%)\nGOOGL(2.5%)\n\n\n 6% Cash\n\nBeen thinking of taking profits from some of these (MSFT/QCOM) Adding something like O, LRCX. DOCU/ARBE but on a weakness would be solid. Any other suggestions or thoughts on changes?",
        "created_utc": 1599053556,
        "id": "g3psrtu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599082356.0
    },
    {
        "author": "vvvvfl",
        "body": "Samsung also makes Exynos, which is also ARM. Half of their flagship phones is Qualcomm half is in-house production if I'm not wrong.",
        "created_utc": 1599071094,
        "id": "g3r05e1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599099894.0
    },
    {
        "author": "sleepyguy007",
        "body": "intel, cisco, qualcomm, juniper etc were all huge bubble stocks in the tech bubble and were making tons of money.  \n\n\nThis tech bubble is just as bad and the same sort of mix of unprofitable companies, profitable overvalued companies, and now people just trying to cash out as fast as possible via SPACs and IPOs as there was then.  It might not be quite as steep a bubble yet, but its definitely getting there.  it took 4 years to go from 1200 -&gt; 5000 in 2000.   4 years ago the nasdaq was 5000 or so, so I could see it gettingto even 15000 and then crashing.  maybe not quite as big, but still as someone above mentioned economic conditions are far far worse now and we have much more debt than we did in 2000 as a nation",
        "created_utc": 1598955614,
        "id": "g3kl2if",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598984414.0
    },
    {
        "author": "sand24man",
        "body": "Because qcom makes parts for the iPhone, which is what this post is about. While Nokia does nothing for an iPhone...",
        "created_utc": 1599003719,
        "id": "g3noxua",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599032519.0
    },
    {
        "author": "soozler",
        "body": "Verizon, qcom.",
        "created_utc": 1599095066,
        "id": "g3skppw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599123866.0
    },
    {
        "author": "Reeeetail_Investor",
        "body": "I hope so too, bro. I'm more concerned about my QCOM calls though.",
        "created_utc": 1599098263,
        "id": "g3sqr0q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599127063.0
    },
    {
        "author": "CoolMoo5e",
        "body": "I always buy and it drops more then after it skyrockets I bought QCOM at $70 and it dropped to high $50s if I recall and since then it hit $125 just buy and ride the climbs for years to come.",
        "created_utc": 1599176572,
        "id": "g3x9no4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599205372.0
    },
    {
        "author": "Mike_the_Merciless",
        "body": "This is the first long call I've done 5 QCOM 01/21/2022 @5.40. Its now sitting @16.70. I'm normally very patient but the return on this has been much quicker than expected. I'm looking for some advice from people that have do long calls on what they would normally do in this situation. Thank you.",
        "created_utc": 1599059068,
        "id": "g3q5ijy",
        "score": 1,
        "subreddit": "options",
        "created": 1599087868.0
    },
    {
        "author": "HAC522",
        "body": "Oh, todays not so bad afterall, so far. My QCOM calls are actually kind of recovering",
        "created_utc": 1599228888,
        "id": "g3ziv3f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599257688.0
    },
    {
        "author": "YoYo_Da",
        "body": "One is QCOM 1999-2000. The other is QCOM Mar '20 — Sep '20. \"History doesn't repeat itself, but it often rhymes\"\n\n[https://ibb.co/vDkMD9z](https://ibb.co/vDkMD9z)\n\n[https://ibb.co/02Rncx1](https://ibb.co/02Rncx1)",
        "created_utc": 1598983660,
        "id": "g3mbmc6",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1599012460.0
    },
    {
        "author": "Galigen173",
        "body": "Give it a minute the snps been fading and vxx is going up.\n\nIt'll be red by open.",
        "created_utc": 1599219394,
        "id": "g3yy60q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599248194.0
    },
    {
        "author": "Sincopated",
        "body": "Synopsys is my new baby. Please tell me what you think\n\nSNPS",
        "created_utc": 1600111472,
        "id": "g59rurm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600140272.0
    },
    {
        "author": "Galigen173",
        "body": "Give it a minute the snps been fading and vxx is going up.\n\nIt'll be red by open.",
        "created_utc": 1599219394,
        "id": "g3yy60q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599248194.0
    }
]