[
    {
        "author": "SERPMarketing",
        "body": "Also in many tech-focused roles you go from “doing the work” to “designing the work” which is technical in its nature, but not hands-on-keys so the atrophy May be on their quickness of implementation, but on their technical-mindedness.",
        "created_utc": 1591812638,
        "id": "ftlwyqp",
        "permalink": "/r/investing/comments/h0e5xm/jeffrey_gundlach_the_ceo_of_135_billion/ftlwyqp/",
        "score": 43,
        "subreddit": "investing",
        "created": 1591841438.0
    },
    {
        "author": "TeamGravityAnalytica",
        "body": "It looks like a map of the US with Bank of America the Florida Keys and the fly over country, sparse. And Wells Fargo is Texas. Which makes sense.",
        "created_utc": 1591243864,
        "id": "fstqba1",
        "permalink": "/r/SecurityAnalysis/comments/gw9qjz/heres_a_cool_graphic_my_buddy_made_showing_stocks/fstqba1/",
        "score": 10,
        "subreddit": "SecurityAnalysis",
        "created": 1591272664.0
    },
    {
        "author": "boltz86",
        "body": "Don’t forget about all the companies poised to profit. Keysight, Anritsu, and Rohde Schwarz supply 5g test equipment. Testing is federally required for anything 5G and that shit is expensive.\n\nEdit: Just checked and only Keysight is publicly traded.",
        "created_utc": 1592347868,
        "id": "fv2cayx",
        "permalink": "/r/wallstreetbets/comments/haenr6/5g_tendies/fv2cayx/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1592376668.0
    },
    {
        "author": "Dropmeoffatschool",
        "body": "Ya mate, we all have a crystal ball that tells us when something will spike 100% overnight. If you follow a company then you’ll know what important reports should be coming out. 100% spikes are usually related to pharma companies getting approval or other industries with similar types of processes for products. Or a gold miner that reports they’ve struck it big. To be on the train for a 100% jump you’ve got to be very lucky. \n\nIf we all had the keys to knowing which stock would jump 100% the next day we’d all be billionaires and we sure as hell wouldn’t be sharing our secrets on reddit.",
        "created_utc": 1591847894,
        "id": "ftnth4j",
        "permalink": "/r/stocks/comments/h0rdq9/stock_spikes/ftnth4j/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1591876694.0
    },
    {
        "author": "PlentyC",
        "body": "I just dumped 4 of my stocks to get in on IDEX. I was skeptical and I hate it. But I believe in it now. Somebody, quick, bring me my keys to my metallic lambo Diablo 🚀🚀🚀🚀🚀",
        "created_utc": 1593472904,
        "id": "fwf4nas",
        "permalink": "/r/pennystocks/comments/hib6nh/a_little_background_dd_for_idex_skeptics/fwf4nas/",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1593501704.0
    },
    {
        "author": "cunning_linguist_69",
        "body": "Keys are extremely conservative as a whole actually.",
        "created_utc": 1593199902,
        "id": "fw3ejfa",
        "permalink": "/r/wallstreetbets/comments/hge69a/all_bars_are_shutdown/fw3ejfa/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1593228702.0
    },
    {
        "author": "tysonsmithshootname",
        "body": "This is highly misleading and not narrow enough to see the true scope of what is happening to hotels/hospitality right now.\n\nWhile leisure bookings are way up, this short term booking window is simply opening the valve on pent up demand. This is in no way sustainable. Leisure bookings cannot support the current hotel infrastructure.\n\nThe loss of Group is the major blow to the hospitality community. Even if this leisure booking wave continues, the loss of major Banquet and Catering revenue is going to challenge many of these hotels, leisure resorts included. Groups dwarf leisure travel in non room revenue spend on a percentage basis. Any hotel of size in terms of meeting space will be looking at dramatically reduced revenues for the next 2-3 years, best case.\n\nThe Corporate, Association, and Citywide group segment that layer in critical base to hotels in all markets have essentially been wiped out. This leaves the SMERFE (Social, Military, Educational, Religious, Fraternal, and Ethnic) and Wedding segments as the primary driver of group business during this transitional period. These typically stay during weekends, which will crossover with the leisure segment. Even the most famous \"pure\" leisure markets (think Hawaii or Palm Springs) still have a 15-20% dependency on Group.\n\nThe second issue is supply. There is a dramatic reduction in the number of keys available compared to February. Many hotels are operating with reduced staffing and reduced available keys. As more of this supply comes on board, the pool of leisure will not increase, just get more diluted. This will naturally lead to ADR and RevPAR reduction over time.\n\nFinally, with events of all size unlikely to either come to fruition in the next 12 months or looking at reduced head counts, hotels are frankly operating with absolutely no long term base of size. The only group production coming is moved events from 2020 during the heart of the crisis. Once these events are consumed, the long range scope for hotels is very disheartening. Furthermore, the return of COVID in general is causing the last bits of 2020 business to either cancel or give notice that it is a possibility.\n\nFranchise models like Marriott and Hilton will be looking at heavily reduced Franchise Fees, especially in the F&amp;B segment (where they typically command a higher % than rooms). The questions I come back to are the following:\n\n1. How many of these leisure bookings came via point redemption? Without the ability to fill consistently and hit enhanced occupancy monetary kickers, individual properties get low compensation for these bookings. My statistics (I work for a hotel company) show that these types of bookings are leading the charge as the highest performing segment. In some of my hotels, these are compensated to the property at less than $40.\n2. The complete lack of Group for the remainder of 2020, and the lack of new Group pipeline for 2021 through 2025. In turn, the loss of profitable F&amp;B will take years to rectify.\n3. Secondary and tertiary markets are showing alarming statistics in terms of long range base business. I'm not worried about the mega markets long term (NYC, Chicago, SF, LA, NOLA etc.) but the secondary and tertiary hotel markets have a heavier dependency on Group and Convention business. The leisure pool is too small to support these markets.\n\nI am primarily looking at hotel companies that have a larger portfolio of independent hotels in destination markets that have a reliable drive-in base AND/OR a limited/select service portfolio.",
        "created_utc": 1593464214,
        "id": "fwenijm",
        "permalink": "/r/investing/comments/hi3tdu/latest_stats_from_goldman_show_consumers_starting/fwenijm/",
        "score": 8,
        "subreddit": "investing",
        "created": 1593493014.0
    },
    {
        "author": "Ban2Delete2",
        "body": "good info, but I think you've only really scratched the surface regarding investor risk and complexity.  Talk to me about how management is compensated; feels like private equity somehow got the keys to daddy's mid-life crisis IPO sports car.",
        "created_utc": 1591543016,
        "id": "ft9w0kv",
        "permalink": "/r/wallstreetbets/comments/gy62lm/basic_introduction_to_spacs/ft9w0kv/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1591571816.0
    },
    {
        "author": "fireguy123123",
        "body": "That weeaboo background for your soft keys tho...",
        "created_utc": 1591043654,
        "id": "fsk9z6f",
        "permalink": "/r/wallstreetbets/comments/gusdh0/someone_is_fucking_manipulating_this_stock_only/fsk9z6f/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591072454.0
    },
    {
        "author": "Mr_scout77",
        "body": "Did anyone catch the beep and JPow hitting a couple keys on his on computer????",
        "created_utc": 1592412170,
        "id": "fv4z023",
        "permalink": "/r/wallstreetbets/comments/haof9a/daily_discussion_thread_for_june_17_2020/fv4z023/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1592440970.0
    },
    {
        "author": "MessianicJuice",
        "body": "Basically handing the keys of the world to China to save the 1% in the US",
        "created_utc": 1592256682,
        "id": "fuy0qms",
        "permalink": "/r/wallstreetbets/comments/h9liuk/fed_says_it_will_buy_individual_corporate_bonds/fuy0qms/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1592285482.0
    },
    {
        "author": "marciuz777",
        "body": "Shes trying to find her keys?\n\n [https://twitter.com/bunnydelphine/status/1141807011019014150](https://twitter.com/bunnydelphine/status/1141807011019014150)",
        "created_utc": 1592459111,
        "id": "fv7ewh3",
        "permalink": "/r/wallstreetbets/comments/haz16z/what_are_your_moves_tomorrow_june_18_2020/fv7ewh3/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1592487911.0
    },
    {
        "author": "Relaxed_Engineer",
        "body": "If Biden does win, remember that Trump will still be in office until January. Trump will be a fucking mad-man on Twitter and he and his cronies are going to do all they can to set the house on fire before handing the keys over to Biden.\n\nThe Kang Gang better have their shit ready to go by September as we're going to be bouncing around like Tigger on crank from then to next spring.",
        "created_utc": 1592865797,
        "id": "fvoo82j",
        "permalink": "/r/wallstreetbets/comments/he29te/stonks_for_biden_election_win/fvoo82j/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1592894597.0
    },
    {
        "author": "Vinny32295",
        "body": "My magic crayons tell me we’re due for a pullback. We’ve hit keys fettuccini resistance lines. These colorful lines will beat the fed and their $7 trillion dollars /s",
        "created_utc": 1591536158,
        "id": "ft9l4mx",
        "permalink": "/r/wallstreetbets/comments/gxbzbj/weekend_discussion_thread_for_the_weekend_of_june/ft9l4mx/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591564958.0
    },
    {
        "author": "831sweatyfeet",
        "body": "Instead of Phone, Wallet, Keys. Now we have to remember a face mask. Strange times my friends.",
        "created_utc": 1591667037,
        "id": "ftfl1d0",
        "permalink": "/r/wallstreetbets/comments/gz6uth/what_are_your_moves_tomorrow_june_09_2020/ftfl1d0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591695837.0
    },
    {
        "author": "dwdsquared2",
        "body": "That's literally what people in casinos or scratching lottery tickets say in their heads. \n\nJust think, if that was the key, why isn't everyone rich and doesn't need to borrow again?   Did you suddenly find the keys to success? \n\nNo, lil bro. You need to trade with patience and will-power and you'll be much more likely to succeed.",
        "created_utc": 1591311220,
        "id": "fswv4f7",
        "permalink": "/r/wallstreetbets/comments/gwp2j2/what_are_your_moves_tomorrow_june_05_2020/fswv4f7/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591340020.0
    },
    {
        "author": "Wayfaring_Limey",
        "body": "Only time I ever used budget, I get to the parking lot with the keys to the car and find it has a flat. I go back to the counter and they try and tell me it's my fault the car has a flat and I'll need to pay for a replacement. Threw the keys back at them, and went to Hertz instead. When they tried processing my card, I just told the bank it was a fraudulent transaction.",
        "created_utc": 1591201531,
        "id": "fsrewhe",
        "permalink": "/r/wallstreetbets/comments/gvu0j3/avis_car_rental_going_bankrupt/fsrewhe/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591230331.0
    },
    {
        "author": "IsThatATitleist3",
        "body": "No one in their right minds is expecting Lambo keys are launch. I most certainly am not. I do expect this to be a $10-15 stock in a year.",
        "created_utc": 1592008700,
        "id": "funnz9r",
        "permalink": "/r/pennystocks/comments/h7h05l/gnus_megathread_june_12th/funnz9r/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1592037500.0
    },
    {
        "author": "fin425",
        "body": "How’s the cocaine? I hear you can get keys for like $12k",
        "created_utc": 1592972332,
        "id": "fvtic67",
        "permalink": "/r/wallstreetbets/comments/helxve/what_are_your_moves_tomorrow_june_24_2020/fvtic67/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593001132.0
    },
    {
        "author": "Colonel_Cubical",
        "body": "Zm Jul17 300c @ 3.32 exited @ 1.57\n\nSPY Jun29 300p @ 3.55 exited @ 2.38\n\nNFLX Jul02 470c @ 4.35 exited @ .52\n\nNET Jul17 42c @ 1.05 exited @ .45\n\ngive me the keys bitch, you can have my jet ski and bang my wife",
        "created_utc": 1593551055,
        "id": "fwilpbu",
        "permalink": "/r/wallstreetbets/comments/hiv3zw/what_are_your_moves_tomorrow_july_01_2020/fwilpbu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593579855.0
    },
    {
        "author": "mdist612",
        "body": "Ironically, yes. You are not alone. I remember when I was setting up hot keys on my trader platform, I made my buy hot keys as 10, 100, and 1000. Turns out I made them 10, 1000, 1000. I never understood why my 100 buy hot keys kept acting up until I looked at the settings.",
        "created_utc": 1591745540,
        "id": "ftj3po3",
        "permalink": "/r/pennystocks/comments/gzz19y/yall_ever_accidentally/ftj3po3/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1591774340.0
    },
    {
        "author": "iTradeWeTrade",
        "body": "Moon Dog had it all living in the Keys",
        "created_utc": 1593143207,
        "id": "fw102pp",
        "permalink": "/r/wallstreetbets/comments/hft4mc/what_are_your_moves_tomorrow_june_26_2020/fw102pp/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593172007.0
    },
    {
        "author": "tpf5023",
        "body": "I agree that’s very possible. I’m torn between that and a major sell off when these kids don’t get Lambo keys at the launch. That whole instant gratification thing. Def a lot of people here that don’t realize the launch is priced in. We probably won’t noon until there’s some sort of numbers or other news showing success.",
        "created_utc": 1592007878,
        "id": "funmlwr",
        "permalink": "/r/pennystocks/comments/h7h05l/gnus_megathread_june_12th/funmlwr/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1592036678.0
    },
    {
        "author": "mulletator",
        "body": "Those emotional charts are nothing new.  What you're failing to realize is the scope of the present economic situation.  This is not a normal recession.  I fully understand where you're coming from.  I usually invest that way too although I prefer individual stocks to ETFs and mutuals.   \n\nThe market is fucked man.  We already crashed and it's on life support right now from government stimulus.  Canada has already dumped $250 billion into stimulus and the US has put in at least $3 trillion.  That's all gone already, poof.  That is why we saw the recent bump in the market.  Nothing more.  Productivity is not picking up the way we hoped.  There are more shockers on the horizon.  Namely the US unemployment stimulus is ending soon and so is the mortgage holiday.\n\nThe world's economy is teetering right now.  There's more to the story than can be explained here.  What we are going to see is massive consolidation.  Big companies eating up small ones, the FAANG stocks are doing well right now but they rely on a healthy economy for people to buy their products.  It's hard to pay for Netflix if you lost your home.\n\nYou don't have to listen to me and this isn't my opinion either.  Take a look at the latest IMF reports for an impartial viewpoint on what is going on.  Things are bleak and that's accounting for everything that we already know.  Just look at the unrest in the last two weeks.  If any major stressors present themselves we are ultra-fucked.\n\nThe market is in full-on hope and dream mode with a vaccine already priced in.  Even if we had a vaccine today we'd still be screwed.  As long as we get a vaccine, maintain productivity, continue to innovate, and somehow reconcile the massive debt problems we will pull through this.  Those are big ifs.  \n\nThe world will survive I'm not saying this is the apocalypse but economic paradigm shifts have happened before.  China is already pushing out a new government-controlled cryptocurrency and that has powerful ramifications for the USD.  Check out this link (https://www.wired.co.uk/article/china-digital-currency-crypto).\n\nIt's ugly man.  I'm not just sharing my opinion here, the facts are all around us.  I wish this wasn't happening but it is.  The government stimulus kept the boat afloat and gave us time to get our affairs in order.  \n\nI wish nothing more than to be wrong about all of this.  If you know something that I don't please share it with me and I'll jump right back into the market and DCA all day long.\n\nHere are a couple more links:\nhttps://www.bloomberg.com/opinion/articles/2020-06-08/a-crash-in-the-dollar-is-coming\nhttps://www.foxbusiness.com/economy/fed-economist-argues-negative-interest-rates-needed-to-boost-us-economic-recovery\nhttps://www.nsenergybusiness.com/features/fossil-fuel-profits-decline/\nhttps://www.theatlantic.com/ideas/archive/2020/06/3-keys-understanding-strangest-economy-ever/612373/\nhttps://www.munknee.com/shift-from-u-s-dollar-as-world-reserve-currency-underway-what-will-this-mean-for-america/\nhttps://theconversation.com/buckle-up-for-turbulence-why-a-global-debt-crisis-looks-very-hard-to-avoid-127260\nhttps://theconversation.com/buckle-up-for-turbulence-why-a-global-debt-crisis-looks-very-hard-to-avoid-127260",
        "created_utc": 1592008126,
        "id": "funn104",
        "permalink": "/r/CanadianInvestor/comments/h7nu89/20_yearold_canadian_student_looking_for_investing/funn104/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1592036926.0
    },
    {
        "author": "weekendmoney",
        "body": "If you own bitcoin on RH you don't Hodl sheeet. Not your keys, not your coins.",
        "created_utc": 1592237824,
        "id": "fuwxgqu",
        "permalink": "/r/RobinHood/comments/h9j1fd/not_allowed_to_sell_my_btc/fuwxgqu/",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1592266624.0
    },
    {
        "author": "SaacTown",
        "body": "You mean his phone or keys?",
        "created_utc": 1591157922,
        "id": "fspocyy",
        "permalink": "/r/SPACs/comments/gvgrew/the_goat/fspocyy/",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1591186722.0
    },
    {
        "author": "HalfMoonCottage",
        "body": "Imagine pressing a few keys and printing trillions of dollars into existence. This is how I imagine the safety net for your bowling ball. You can blow a hole in the ice and the ball will simply keep rolling along my trillion dollar net. Goodnight sunshine.",
        "created_utc": 1592880923,
        "id": "fvpegoj",
        "permalink": "/r/wallstreetbets/comments/hdzqai/what_are_your_moves_tomorrow_june_23_2020/fvpegoj/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1592909723.0
    },
    {
        "author": "xcheezeplz",
        "body": "These are little keys things they don't teach you at Harvard and really should.",
        "created_utc": 1593054919,
        "id": "fvx5chh",
        "permalink": "/r/wallstreetbets/comments/hf8cor/what_are_your_moves_tomorrow_june_25_2020/fvx5chh/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1593083719.0
    },
    {
        "author": "HauntingRent",
        "body": "In the short term, it doesn't matter at all. Nobody is getting rich based on Trump acting like Bozo the Clown every day.  People often *say* it will have an effect on stock market trading boards, because many people who trade stocks are themselves bozos who shouldn't be given the keys to their own bank accounts, let alone a trading account.\n\nIn the long term, it offers a chance at fixing the economy, and restoring international trade (on which much of our economy depends) to some semblance of a stable condition.  Right now, any business you invest in that depends on trade with China (in other words: **every stock you own**) is being whipsawed around based on how many farts the bozo-in-chief had that day. Electing anyone else will reduce volatility substantially.",
        "created_utc": 1593191942,
        "id": "fw2xxp2",
        "permalink": "/r/StockMarket/comments/hgbjn7/how_do_you_think_the_stocks_will_perform_if/fw2xxp2/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1593220742.0
    },
    {
        "author": "smackinov",
        "body": "THIS RIGHT HERE is evidence that this administration is ran by retards dumber than us but they control the keys to a market that will never fail",
        "created_utc": 1592878213,
        "id": "fvp9yca",
        "permalink": "/r/wallstreetbets/comments/hdzqai/what_are_your_moves_tomorrow_june_23_2020/fvp9yca/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1592907013.0
    },
    {
        "author": "somanychins",
        "body": "\"BREAKING: Oil consumption inversely correlated with coronavirus cases, experts suggest driving and flying both keys to ending pandemic\"",
        "created_utc": 1591993253,
        "id": "fumvnx0",
        "permalink": "/r/wallstreetbets/comments/h7s30c/weekend_discussion_thread_for_the_weekend_of_june/fumvnx0/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592022053.0
    },
    {
        "author": "TwainCollector",
        "body": "Stocks are just like valuing anything else in the world. A share is only worth what someone will pay for it. I look at medium and long term trends and viability. I look for companies with steady unchanging leadership that has a record of delivering investment returns. I look for companies that previously traded at more than 10-15% their current price for at least 6 non-recession months. If people were paying more than $15 for a stock for two straight years before March of this year then it's pretty safe to assume the stock is worth at least $15, I'm absence of other major factors that need to be researched and understood.\n\nI don't take risks and I don't gamble with stocks. I pick companies that are going to be long term winners and I sell before they even get to where I think their valuation should be. \n\nThe keys are not to invest money you can't afford to lose so that you won't be emotionally driven to make hasty decisions. When you buy into a position it should be with the knowledge that you aren't going to sell it until it gets to $XX price, no matter how long that may take.",
        "created_utc": 1591979402,
        "id": "fum2gkv",
        "permalink": "/r/investing/comments/h7la4x/cramer_thinks_wall_street_pros_may_be_playing_a/fum2gkv/",
        "score": 2,
        "subreddit": "investing",
        "created": 1592008202.0
    },
    {
        "author": "inb4ElonMusk",
        "body": "It literally no more difficult than picking up your car keys when you leave the house. But no, people determined to prolong pandemic.",
        "created_utc": 1593193423,
        "id": "fw312ge",
        "permalink": "/r/wallstreetbets/comments/hg4wdd/daily_discussion_thread_for_june_26_2020/fw312ge/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593222223.0
    },
    {
        "author": "idsimon",
        "body": "Florida Keys",
        "created_utc": 1593477399,
        "id": "fwfcq7i",
        "permalink": "/r/wallstreetbets/comments/hi7lau/what_are_your_moves_tomorrow_june_30_2020/fwfcq7i/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593506199.0
    },
    {
        "author": "noel_edmondso",
        "body": "A drunk old man, staggering home from the pub and cannot find his door keys to get inside. \n\nDrunk man = S&amp;P / Door keys = calls  / Inside = far far away from 300",
        "created_utc": 1591982681,
        "id": "fuma0ff",
        "permalink": "/r/wallstreetbets/comments/h7i2lz/daily_discussion_thread_for_june_12_2020/fuma0ff/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592011481.0
    },
    {
        "author": "mulletator",
        "body": "Sure, here are a few recent ones.  One or two from late 2019 for context of the pre-Corona underlying factors.  There's lots of info out there.\n\nhttps://www.theatlantic.com/ideas/archive/2020/06/3-keys-understanding-strangest-economy-ever/612373/\nhttps://theconversation.com/buckle-up-for-turbulence-why-a-global-debt-crisis-looks-very-hard-to-avoid-127260\nhttps://fpif.org/the-black-death-killed-feudalism-what-does-covid-19-mean-for-capitalism/?\nhttps://www.bloomberg.com/news/features/2020-05-18/harvard-s-financial-crisis-experts-this-time-really-is-different\nhttps://www.dw.com/en/world-war-ii-and-coronavirus-economics-the-perils-of-comparison/a-53214554\nhttps://news.bitcoin.com/telegram-to-pay-back-investors-110-after-gram-token-launch-fails-again/\nhttps://www.barrons.com/articles/the-coronavirus-has-already-made-us-poorer-for-years-to-come-51586781001?mod=hp_LEAD_4\nhttps://www.npr.org/sections/money/2019/07/30/746337868/75-years-ago-the-u-s-dollar-became-the-worlds-currency-will-that-last\nhttp://archive.is/VK0Ou\nhttps://www.theguardian.com/world/2020/apr/08/coronavirus-putting-world-on-track-for-new-great-depression-says-who\nhttps://www.forbes.com/sites/zackfriedman/2020/05/07/consumer-debt-financial-crisis/#51b7fc506ded\nhttp://archive.is/ERUdR\nhttps://www.theguardian.com/business/2020/jun/04/coronavirus-crisis-collapse-fossil-fuels-demand?utm_campaign=Hot%20News&amp;utm_medium=email&amp;_hsmi=88976093&amp;_hsenc=p2ANqtz-9su9IeCQEyzchAxXZicDxab6y_4AIYUdZsbN_zIy9pwiRkHW_yncN7iAYEPyEsC7BKoxnjHbrF3wPfO7K9wDuzjuhC2A&amp;utm_content=88976093&amp;utm_source=hs_email\nhttps://www.imf.org/en/Publications/WEO/Issues/2020/04/14/weo-april-2020",
        "created_utc": 1592004480,
        "id": "fungsmn",
        "permalink": "/r/CanadianInvestor/comments/h7bjho/we_have_a_significant_negative_day_and_now/fungsmn/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1592033280.0
    },
    {
        "author": "suhleem",
        "body": "Lol I guess on your right hand it looked my a ring finger,  my b\n\nI’ll definitely look into it! It’s all subjective of course, but I’ve preferred lighter keys because they tend to need less pressure for the keys to hit the hammers. I had a teacher assign me Bud Powell’s version of Anthropology to learn, I realized with songs like that, the less work I need to play the better lmao. Played a Korg Kronos once, felt like pressing on bricks at first lol. However it’s great for stuff like Hanon though to develop finger strength! \n\nBut yeah, I’ll definitely check it out thanks, and put it as a write off if I get it, aha. (And you should too if you’re not already making your music expenses as write-offs 👀👀)",
        "created_utc": 1591921682,
        "id": "ftr6huf",
        "permalink": "/r/wallstreetbets/comments/h17ryk/everythings_fine_everythings_fine/ftr6huf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591950482.0
    },
    {
        "author": "bradleykirby",
        "body": "I got some SPY 320c 6/26 at close today. So yeah, the market forgot its keys and is elevatoring back up.",
        "created_utc": 1591921033,
        "id": "ftr5d9s",
        "permalink": "/r/wallstreetbets/comments/h16wnv/what_are_your_moves_tomorrow_june_12_2020/ftr5d9s/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591949833.0
    },
    {
        "author": "Jsizzle19",
        "body": "appreciate the clarification. the key really comes down to whether you want to be investing or gambling. You can get lucky, go on a nice streak and see your stocks rise a lot in a short period of time, but you’re playing with a house of cards.  you want your money to work for you. You may only have $1,300 now, but if you invest in a few, strong companies (profitable, strong balance sheets with positive free cash flow) or in an ETF / index fund where the stock prices will continue to increase over time, then each month or paycheck, set up a recurring deposit. Just like a 401k, you don’t want to touch the money. Just put it in there and try to forget about it (please note, there is nothing wrong with looking to\nRebalance your portfolio every so often) \n\nThere are really 2 keys to investing: 1) always keep investing and 2) having the strength to stay in the game when the market drops 5-10%. \n\nYou want to be in the game as long as possible. \nFor example: if you invest $1,300 today with a $100 recurring monthly deposit and attain a 9% return (average annual return of the S&amp;P 500), in 10 years you’ll have $22,050, in 20 years you’ll have $71,170, but in 30 years you’ll have $187,460. \n\nYou want your investment earnings to keep compounding over time. The stock market should not be viewed as a get rich quick scheme",
        "created_utc": 1591612868,
        "id": "ftcvoo8",
        "permalink": "/r/StockMarket/comments/gydrml/a_2_stock_is_not_always_cheaper_than_a_200_stock/ftcvoo8/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1591641668.0
    },
    {
        "author": "rnansloth",
        "body": "What are keys things that can tell you that there is a serious potential downside? From someone who knows nothing about spotting either upsides or downsides.",
        "created_utc": 1591564893,
        "id": "ftb0cu0",
        "permalink": "/r/StockMarket/comments/gydrml/a_2_stock_is_not_always_cheaper_than_a_200_stock/ftb0cu0/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1591593693.0
    },
    {
        "author": "hugofuegoeggo",
        "body": "Buy high sell low. Always buy the FOMO and chase. And of course always be greedy. Those are the keys to success",
        "created_utc": 1591682724,
        "id": "ftg89r6",
        "permalink": "/r/RobinHoodPennyStocks/comments/gzh3o1/please_analyze/ftg89r6/",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1591711524.0
    },
    {
        "author": "80slaserbackground",
        "body": "lemme hold your lambo keys",
        "created_utc": 1591789744,
        "id": "ftkrhol",
        "permalink": "/r/wallstreetbets/comments/h07z0d/daily_discussion_thread_for_june_10_2020/ftkrhol/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591818544.0
    },
    {
        "author": "TerrorSuspect",
        "body": "&gt;he and his cronies are going to do all they can to set the house on fire before handing the keys over to Biden.\n\nSo ... the same shit that happened last time.",
        "created_utc": 1592869256,
        "id": "fvoufwi",
        "permalink": "/r/wallstreetbets/comments/he29te/stonks_for_biden_election_win/fvoufwi/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592898056.0
    },
    {
        "author": "pennyboy-",
        "body": "this. no one knows this for some reason. do some research, you will appreciate bitcoin a whole lot more if you have the keys and your own wallet",
        "created_utc": 1592240822,
        "id": "fux3nil",
        "permalink": "/r/RobinHood/comments/h9j1fd/not_allowed_to_sell_my_btc/fux3nil/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1592269622.0
    },
    {
        "author": "attirer",
        "body": "As a new investor, you’re probably going to get better advice on r/PersonalFinanceCanada about getting started. There are good resources on the sidebar of that sub, search previous posts, and ask questions if you don’t see what you need.\n\nWhether you focus on passive investing, dividend growth, value investing, or something else, you’ll achieve the greatest success by developing an informed strategy and sticking to it. The three keys are: [maximize your investments early](https://www.mrmoneymustache.com/2012/01/13/the-shockingly-simple-math-behind-early-retirement/) (the power of compound interest); stick to your strategy (“time in the market beats timing the market”); and keep your fees low. \n\nFor passive investing, I suggest reading Andrew Hallam’s *Millionaire Teacher* (2nd ed) and John Robertson’s *The Value of Simple*. The archive of the [CCP blog](https://canadiancouchpotato.com/model-portfolios/) is a great resource, and more tips on the mechanics of passive investing are on the [CPM blog](https://www.canadianportfoliomanagerblog.com/model-etf-portfolios/). There are great videos on discrete passive investing topics on Ben Felix’s [YouTube Channel](https://www.youtube.com/channel/UCDXTQ8nWmx_EhZ2v-kp7QxA) but I suggest reading the resources I’ve mentioned (particularly the two books) to have a better sense of what he’s talking about.\n\nIf passive investing isn’t for you, there are great resources on the sidebars (wikis, FAQs, book lists) of r/SecurityAnalysis, r/stocks, and r/investing.\n\nMy two cents: use your TFSA to buy shares in an all-in-one fund that tracks with your [risk profile](https://www.vanguardcanada.ca/individual/questionnaire.htm). Your greatest advantage is time, and investing early in a balanced all-in-one ETF could provided you with 20x-30x your investment by the time you retire.",
        "created_utc": 1592354117,
        "id": "fv2ngy1",
        "permalink": "/r/CanadianInvestor/comments/hafazr/getting_started_with_a_small_capital/fv2ngy1/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1592382917.0
    },
    {
        "author": "BLACKdrew",
        "body": "that shit better be fucking HYPOALLERGENIC\n\nMOM GET THE KEYS WE RIDING",
        "created_utc": 1591071614,
        "id": "fslot8x",
        "permalink": "/r/wallstreetbets/comments/gurxgt/what_are_your_moves_tomorrow_june_02_2020/fslot8x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591100414.0
    },
    {
        "author": "cutiesarustimes2",
        "body": "Sounds like an amazing honeymoon. I might just go to the keys and pretend I'm somewhere else.",
        "created_utc": 1591760275,
        "id": "ftjt07k",
        "permalink": "/r/wallstreetbets/comments/gzuxmi/what_are_your_moves_tomorrow_june_10_2020/ftjt07k/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591789075.0
    },
    {
        "author": "Red_D_Rabbit",
        "body": "Oh LORDY please save these peoples souls before they  crash down into the inner depths of (hell aka) negative -$1,000,000 margin calls. When every sister-in-law and their dog has a position in the stock market you should know NOW is the time to follow Warren Buffett and CASH OUT! The loonies have taken over the asylum 🤪🤡 and aren't giving back the keys! RUN!",
        "created_utc": 1591759601,
        "id": "ftjrx51",
        "permalink": "/r/wallstreetbets/comments/gzv66q/thats_the_spirit/ftjrx51/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591788401.0
    },
    {
        "author": "BrononymousEngineer",
        "body": "You can do that too, and the data will be better, but it will be more work to actually get data from the brokerage APIs.  From what I've read the steps to connect to TDA are notoriously confusing, and I think for IBKR you have to have TWS running.  If I was actually going to pull data to trade on I'd get it from a brokerage.\nYahoo works for this purpose because it's educational and you don't need API keys -- it's available for everyone.",
        "created_utc": 1591165379,
        "id": "fspyl6k",
        "permalink": "/r/options/comments/gvmluu/thought_id_share_a_project_i_just_finished_3d/fspyl6k/",
        "score": 2,
        "subreddit": "options",
        "created": 1591194179.0
    },
    {
        "author": "fishythepete",
        "body": "Nah people who owe $24K on a bike worth $15K just turn the keys in eventually.",
        "created_utc": 1592590370,
        "id": "fvd0fug",
        "permalink": "/r/wallstreetbets/comments/hc0tu4/dd_ride_hog_into_the_fucking_ground_on_monday/fvd0fug/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592619170.0
    },
    {
        "author": "jer72981m",
        "body": "That's like finding your keys and then saying \"they're always the last place you look.\" YEAH THEY ARE",
        "created_utc": 1593047805,
        "id": "fvwtgb8",
        "permalink": "/r/investing/comments/hfca7h/bloomberg_day_traders_will_have_fun_until_they/fvwtgb8/",
        "score": 2,
        "subreddit": "investing",
        "created": 1593076605.0
    },
    {
        "author": "minos157",
        "body": "Yep, I just wish everyone would stop shitting on other peoples styles.  We're all here to make money.  If anyone ever caught me posting for a new person to just go balls deep on one pattern I'd quit investing because it won't happen.  Every time I join these posts to defend TA it is with the notion that discipline and emotion free trading are the keys to success, not TA, not FA, not style, not length of holdings.  Find a strategy that works for you, and stick to the plan.  Don't let others tell you you're doing it the wrong way.",
        "created_utc": 1591569328,
        "id": "ftb8ggg",
        "permalink": "/r/stocks/comments/gydcr9/are_support_and_resistance_levels_just_an/ftb8ggg/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591598128.0
    },
    {
        "author": "aDingDangDoo_Doo",
        "body": "Hide your keys. \nHide your coins. \nHide your purse...\nBecause they're raping your account right now.",
        "created_utc": 1592246029,
        "id": "fuxf4z9",
        "permalink": "/r/RobinHood/comments/h9j1fd/not_allowed_to_sell_my_btc/fuxf4z9/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1592274829.0
    },
    {
        "author": "mmbeaman1",
        "body": "And backup your keys in multiple places... Started Bitcoin mining back in early days and lost wallet. Makes me sad Everytime I think about it...",
        "created_utc": 1592246218,
        "id": "fuxfix2",
        "permalink": "/r/RobinHood/comments/h9j1fd/not_allowed_to_sell_my_btc/fuxfix2/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1592275018.0
    },
    {
        "author": "r-Spaids",
        "body": "I see this comment often, don't worry about looking up the quote about the clock, I'll save you the keys.\n\nI'm telling you why the clock will break and when and where you can be when the time is right twice.",
        "created_utc": 1592324449,
        "id": "fv0xdzy",
        "permalink": "/r/wallstreetbets/comments/ha6xbp/the_big_shit/fv0xdzy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592353249.0
    },
    {
        "author": "cunning_linguist_69",
        "body": "What part of the keys is near Miami?",
        "created_utc": 1593201020,
        "id": "fw3gs6e",
        "permalink": "/r/wallstreetbets/comments/hge69a/all_bars_are_shutdown/fw3gs6e/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593229820.0
    },
    {
        "author": "stuffandthings16",
        "body": "Not your keys not your wallet",
        "created_utc": 1591051246,
        "id": "fskp3bx",
        "permalink": "/r/wallstreetbets/comments/gurxgt/what_are_your_moves_tomorrow_june_02_2020/fskp3bx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591080046.0
    },
    {
        "author": "seattle_exile",
        "body": "To “invest”, you would have had to trade via shady platforms like [MtGOX](https://en.m.wikipedia.org/wiki/Mt._Gox). \n\nMost of the coins generated back then were by hobbyists who subsequently lost their wallet keys. I was one of them.",
        "created_utc": 1591103776,
        "id": "fsmrss3",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsmrss3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591132576.0
    },
    {
        "author": "goodshotlet",
        "body": "KEYS",
        "created_utc": 1591198528,
        "id": "fsr8ixn",
        "permalink": "/r/stocks/comments/gvvthm/planning_to_enter_the_5_g_race/fsr8ixn/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591227328.0
    },
    {
        "author": "nordmys",
        "body": "Like a boomer chromecast. Boomers love using it because \"it's got a remote\" but then they have to use the fucking arrow keys to type anything to search and it pushes them ads.",
        "created_utc": 1592362422,
        "id": "fv31h26",
        "permalink": "/r/wallstreetbets/comments/habm91/what_are_your_moves_tomorrow_june_17_2020/fv31h26/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592391222.0
    },
    {
        "author": "Versedx",
        "body": "I got a bj from one in a motel, it was a shitty blowjob but I gave her extra to skip the condom so I cant blame her for not going full THROAT QUEENS 9 on it, still better than my hand.  Sketchy notel motel, her \"sister\" hung out in the bathroom.  She was a cutie but was clearly worn out from the lifestyle.  Teasingly chastised me for bringing my car keys in with me.  Kept giggling and apologizing because she had the sniffles (lmao).  Vibe was good, but your mileage will vary.  As in all situations in life, being an attractive young white guy will improve how you are treated by women.  Overall good experience.",
        "created_utc": 1592301298,
        "id": "fuzw3nk",
        "permalink": "/r/wallstreetbets/comments/h9nsx3/what_are_your_moves_tomorrow_june_16_2020/fuzw3nk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592330098.0
    },
    {
        "author": "LETSGETSCHWIFTY",
        "body": "Buddy of mine said Walmart took all the security keys off black people hair products because it’s racist meanwhile it’s the highest stolen product in all of Walmart history.",
        "created_utc": 1592568599,
        "id": "fvbwd4x",
        "permalink": "/r/wallstreetbets/comments/hby5d4/daily_discussion_thread_for_june_19_2020/fvbwd4x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592597399.0
    },
    {
        "author": "Papadude13",
        "body": "I live in miami and trust I see it with my own eyes the carelessness of people. I work in a fancy sushi restaurant and everyone are still sharing bowls, keys to sniff coke and I'm like YUCK. I'm not surprise us Miami folks are pretty stupid eh, \"but we know it all\" I just love the bitches but their not smart enough to be moms just bitchez",
        "created_utc": 1592594181,
        "id": "fvd83n3",
        "permalink": "/r/wallstreetbets/comments/hby5d4/daily_discussion_thread_for_june_19_2020/fvd83n3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592622981.0
    },
    {
        "author": "Naj_md",
        "body": "Please share code, not the keys, let me try :)",
        "created_utc": 1592627607,
        "id": "fvet9j7",
        "permalink": "/r/pennystocks/comments/hcbt3o/from_passive_bitcoin_trader_to_day_trader_10k_up/fvet9j7/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592656407.0
    },
    {
        "author": "Nettletooth",
        "body": "MAC will recover quite a bit.  Best to enter a position on MAC with short puts, since the premiums for options are quite healthy.  \n\nWith mall reits in particular, it is important to consider which loans are recourse or non recourse.  Non recourse simply means that MAC can always just toss the keys back the lender and tell them to fuck off.\n\nMAC has a lot of leverage, but 84% of the total obligations are non recourse loans.  Lenders either play ball, or MAC can hand the keys over and wash their hands of it and selling the mall is now the bank's problem.  You can be sure the banks do not want to become mall owners.\n\nThe rest is a combination of credit facilities and recourse loans.  Either way, I think MAC isn't going to go bankrupt, even if you assume MAC hands back the keys for every non recourse loan, and keeps only those properties with recourse loans, or are unencumbered by debt, they will have substantial positive NAV that will easily support a 9.00 a share price.  MAC has a lot of high quality real estate, it is these malls and real estate that will hold value the best and that make MAC the most money.\n\nWhatever malls don't look great, MAC can just hand the keys to the lender and let the mall be their problem. 84% non-recourse debt is nice.",
        "created_utc": 1592673693,
        "id": "fvggh1g",
        "permalink": "/r/investing/comments/hc3oaf/opinions_macerich_mac/fvggh1g/",
        "score": 1,
        "subreddit": "investing",
        "created": 1592702493.0
    },
    {
        "author": "troy_caster",
        "body": "If the messages he left were really that crazy, you could have sued his ass, gotten the amount owed forgiven, they would have paid for attorney's fees, (most likely they would have settled.  $10k is about standard), and had to pay you a fee for violating your consumer rights (usually more than $10k).  \n\nSo where did you end up finding your GF again?  She was under the bed right?  That's always where my keys are when I lose them.",
        "created_utc": 1592616386,
        "id": "fvec86w",
        "permalink": "/r/wallstreetbets/comments/hc8lqd/this_is_what_i_assume_the_robinhood_trader_saw/fvec86w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592645186.0
    },
    {
        "author": "LordoftheEyez",
        "body": "Haha I wish, ophtho is a lot of hands on. The real keys are having a nice office and attractive nurses",
        "created_utc": 1592066264,
        "id": "fupr8vg",
        "permalink": "/r/wallstreetbets/comments/h7s30c/weekend_discussion_thread_for_the_weekend_of_june/fupr8vg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592095064.0
    },
    {
        "author": "taescience",
        "body": "How do I get keys? Where do I keep them?",
        "created_utc": 1592281868,
        "id": "fuzacge",
        "permalink": "/r/RobinHood/comments/h9j1fd/not_allowed_to_sell_my_btc/fuzacge/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1592310668.0
    },
    {
        "author": "Mikerobin25",
        "body": "Encrypted, yes and immune to computer viruses that software wallets are vulnerable to. Also, private keys are often stored in a protected area of a microcontroller, and cannot be transferred out of the device in plaintext.",
        "created_utc": 1592200915,
        "id": "fuvjj1v",
        "permalink": "/r/investing/comments/h99td3/investing_into_bitcoin_gold_c/fuvjj1v/",
        "score": 1,
        "subreddit": "investing",
        "created": 1592229715.0
    },
    {
        "author": "Mobman69",
        "body": "Same here . Also had coins in different accounts to mine for me and lost my keys . For all I k ow it’s still mining lol",
        "created_utc": 1592253800,
        "id": "fuxuzf8",
        "permalink": "/r/RobinHood/comments/h9j1fd/not_allowed_to_sell_my_btc/fuxuzf8/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1592282600.0
    },
    {
        "author": "Riptionator",
        "body": "Bro that's not why your keys are sticking",
        "created_utc": 1592027867,
        "id": "fuogbph",
        "permalink": "/r/wallstreetbets/comments/h819kr/heres_why_i_bought_120_contracts_for_a_25c_0619/fuogbph/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592056667.0
    },
    {
        "author": "thissempainotices",
        "body": "This sub has just amped my hate for boomers these past few days. The keys to the most powerful military and economy in history in the hands of a few old men who, if they were your parents or grandparents, youd be having a serious conversation about moving them into assisted living and your sure as shit taking their car keys away. Fuck boomers. They shit on the worlds future just to squeeze 3-5 years more status quo before they kick the bucket. Fuck them",
        "created_utc": 1592157102,
        "id": "futigck",
        "permalink": "/r/wallstreetbets/comments/h7s30c/weekend_discussion_thread_for_the_weekend_of_june/futigck/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592185902.0
    },
    {
        "author": "atomic_gecko",
        "body": "KEYS is like 3x price, but Keysight is going to boom with 5G.",
        "created_utc": 1592756577,
        "id": "fvjsd4k",
        "permalink": "/r/wallstreetbets/comments/hc7rvq/weekend_discussion_thread_for_the_weekend_of_june/fvjsd4k/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592785377.0
    },
    {
        "author": "4224aso",
        "body": "The premium for GBTC is almost 20% right now. Not nearly as much, but not nothing. If someone is wanting to gain exposure to BTC and is of an average technical ability, it's usually better to just buy BTC without going through Grayscale. \n\nAlso, it's possible (though I haven't yet looked up the specifics as to how because it doesn't apply to me right now) to set up a self-directed 401k where the owner has control of the actual Bitcoin keys, all the tax benefits, and doesn't have to pay the GBTC premium, which, altogether, is a much better way to do things.",
        "created_utc": 1591961869,
        "id": "ful6kpj",
        "permalink": "/r/investing/comments/h7hehh/what_do_you_think_about_grayscale/ful6kpj/",
        "score": 1,
        "subreddit": "investing",
        "created": 1591990669.0
    },
    {
        "author": "tdVancouver",
        "body": "Florida Keys and ICW on the water my dream retirement! - from Canada's west coast.",
        "created_utc": 1591651997,
        "id": "ftetmx2",
        "permalink": "/r/StockMarket/comments/gz27w6/anyone_else_back_to_their_all_time_highs/ftetmx2/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1591680797.0
    },
    {
        "author": "ButtFart88",
        "body": "That dude doesn’t seem real. A Georgia football coach who 1) keys cars, 2) keys Tesla’s?, and does it because they’re not American enough? This is like the most confusing situation I’ve ever found myself in.\n\nEdit: just noticed he’s a joker. Makes sense now.",
        "created_utc": 1591421537,
        "id": "ft2ba47",
        "permalink": "/r/wallstreetbets/comments/gxbzbj/weekend_discussion_thread_for_the_weekend_of_june/ft2ba47/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591450337.0
    },
    {
        "author": "Doctor_FatFinger",
        "body": "Haha. I went in to have my summers swapped out months ago. Employees were busy strait out and from what I gathered had been and were short handed. Over heard three from an open door beyond the counter, as I hand the gentlemen my keys, that they were starving and not happy about not even having time for a proper lunch, but in far more crass language.\n\nI showed back up with two large pizzas in hand. Explained they were for them. The manager shook my hand, thanked me, and handed my keys back over with no bill.\n\nSo 33 bucks got me what they normally charge close to 80.",
        "created_utc": 1591508139,
        "id": "ft8qyif",
        "permalink": "/r/stocks/comments/gxee2y/jc_penneys_check_bounced_rip/ft8qyif/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591536939.0
    },
    {
        "author": "Alex09464367",
        "body": "I think you're still getting confused between WhatsApp and Signal.\n\nYou can use it on iphone you just need to get an iPhone developer licence because Apple is Apple. Or you need install it every 7 days or updating the keys signature with in 7-days.",
        "created_utc": 1591457921,
        "id": "ft4xheo",
        "permalink": "/r/wallstreetbets/comments/gx4kh2/may_job_report_us_adds_25_mil_payrolls/ft4xheo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591486721.0
    },
    {
        "author": "262Chief",
        "body": "Gonna go out on a limb here and suggest that handing over the keys of the U.S. cannabis market to Canadian shell companies run by a bunch of wealthy, former bankers, politicians, businessmen, venture/vulture funds etc. may not be the way they go, structurally speaking.",
        "created_utc": 1591319773,
        "id": "fsxapfw",
        "permalink": "/r/weedstocks/comments/gwp0xy/rweedstocks_after_hours_discussion_june_04_2020/fsxapfw/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591348573.0
    },
    {
        "author": "vintage_screw",
        "body": "We need to keep making this known.  However, most wont read it without 17 🚀 \n\nOh, I am going to need the keys to the family beater.  The Lambo had to go back. And  I need $20 for gas too.",
        "created_utc": 1591293713,
        "id": "fsvu4bm",
        "permalink": "/r/pennystocks/comments/gwkuk5/alright_fellas_were_getting_a_ton_of_new/fsvu4bm/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591322513.0
    },
    {
        "author": "ValenTom",
        "body": "New York and the Mid-Atlantic region are, I feel, the keys to federal reform occurring in cannabis. When the issue is knocking on DC’s door then we will finally see some effort and movement by Congress.",
        "created_utc": 1591285371,
        "id": "fsvc4pr",
        "permalink": "/r/weedstocks/comments/gwipnl/new_york_senator_pushes_to_legalize_marijuana_as/fsvc4pr/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591314171.0
    },
    {
        "author": "b0nk3r00",
        "body": "I think some other keys to timing the market you may not have are analysts on staff, algorithms, and a regular stream of illegal insider information.",
        "created_utc": 1591341608,
        "id": "fsy7ncs",
        "permalink": "/r/investing/comments/gwryi4/lost_more_money_actively_trading_than_holding/fsy7ncs/",
        "score": 1,
        "subreddit": "investing",
        "created": 1591370408.0
    },
    {
        "author": "Captcha_Imagination",
        "body": "The problem as far as I see it is their consumer lineup in incomplete and too complex.\n\nIncomplete: Apple has phones, tablets, PCs, laptops, and accessories. Microsoft needed this whole lineup to compete.\n\nThey jettison things like Windows phones after years of no support. Of course, it will die.\n\nYou don't need an aggressive ecosystem that locks you in but consumers highly value ecosystems, that's one of the keys of Apple's success.\n\nToo complex: I have personally shopped for a Surface on multiple occasions but every time I end up X'ing out my browser after looking at 17 different models and by the time I am at the top end models, I am well above a high-end gaming PC price.\n\nThey need to offer fewer options and have them be clearly defined. For example, they could have a 1) Basic (cheapest), 2) Student (cheapest + software bundles), 3) Gaming (featuring a high-end GPU) and 4) Pro (best CPU and decent GPU).\n\nKeep the same models year after year and tweak the hardware inside every year. The average person knows nothing about specs. They don't the difference between an i3 or an i7. But they would understand broad categories.",
        "created_utc": 1593199076,
        "id": "fw3cvbd",
        "permalink": "/r/CanadianInvestor/comments/hg7z7i/microsoft_is_permanently_closing_its_retail_stores/fw3cvbd/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1593227876.0
    },
    {
        "author": "Chrisfrom1986",
        "body": "Didn't know the keys were located in LA.",
        "created_utc": 1593237492,
        "id": "fw54uvo",
        "permalink": "/r/wallstreetbets/comments/hge69a/all_bars_are_shutdown/fw54uvo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593266292.0
    },
    {
        "author": "cunning_linguist_69",
        "body": "That isn’t the “keys” though. They are not connected. The Florida Keys are in Monroe county.",
        "created_utc": 1593202771,
        "id": "fw3k7ql",
        "permalink": "/r/wallstreetbets/comments/hge69a/all_bars_are_shutdown/fw3k7ql/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593231571.0
    },
    {
        "author": "super_saiyan_rob",
        "body": "Yup fuck keys, rack up them gator tails",
        "created_utc": 1593058957,
        "id": "fvxbhe2",
        "permalink": "/r/wallstreetbets/comments/hf52uy/properly_engraved_my_apple_card/fvxbhe2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593087757.0
    },
    {
        "author": "tysonsmithshootname",
        "body": "Vaccine would be a game changer and would raise the floor, but too many segments continue to be at risk. I worry about lingering effects more. Are hotels ever going to see a strong percentage of IBT (Individual Business Transient) travel again? This is especially important because IBT is concentrated amongst a small percent of companies. \n\nWould Groups still require a level of social distancing, which lowers it's Revenue per Square Foot in Banquets and Catering? What concessions will groups now be seeking? How many associations will disband because they couldn't hold a conference this year (where attendance fees often provide more money than Association dues) \n\nWith that said, I'm much more concerned about the current COVID spike reverting some states back to late March/early April restrictions. Some of the states we are talking about here (Florida, California, Nevada, Texas, Arizona) represent a sizeable chunk of keys.",
        "created_utc": 1593470744,
        "id": "fwf0jrn",
        "permalink": "/r/investing/comments/hi3tdu/latest_stats_from_goldman_show_consumers_starting/fwf0jrn/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593499544.0
    },
    {
        "author": "bobbrucethe1st",
        "body": "Why do so many people on the internet talk so much shit, yet you same people act like feeble little newborn children out in public. I wasn't even talking to you so stop typing your keys you dipshit.",
        "created_utc": 1592990759,
        "id": "fvu3ljn",
        "permalink": "/r/RobinHoodPennyStocks/comments/hbo07l/seems_about_right/fvu3ljn/",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1593019559.0
    },
    {
        "author": "umbrellacorgi",
        "body": "No more car keys! AAPL to $500",
        "created_utc": 1592846777,
        "id": "fvnmcz3",
        "permalink": "/r/wallstreetbets/comments/hdpp7j/daily_discussion_thread_for_june_22_2020/fvnmcz3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592875577.0
    },
    {
        "author": "TH3PhilipJFry",
        "body": "solid updates, digital car keys, making their own parts instead of relying on Intel. That's the broad strokes.",
        "created_utc": 1592852415,
        "id": "fvnxu3m",
        "permalink": "/r/wallstreetbets/comments/hdpp7j/daily_discussion_thread_for_june_22_2020/fvnxu3m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592881215.0
    },
    {
        "author": "SofaKingGB",
        "body": "[https://www.forbes.com/sites/pedrodacosta/2020/04/20/a-glaring-new-conflict-of-interest-undermines-public-trust-in-federal-reserve/#3f3fec21135d](https://www.forbes.com/sites/pedrodacosta/2020/04/20/a-glaring-new-conflict-of-interest-undermines-public-trust-in-federal-reserve/#3f3fec21135d)\n\nThe man owns ETFs (a bit more than 11 million dollars worth) run by the same group and has given them the keys to direct billions of dollars  in municipal and corporate bond purchasing. What's to stop them from giving preference for bonds to companies held in their ETFs?\n\nPowell could be as pure as the white snow but this is a glaring conflict of interest.",
        "created_utc": 1592022864,
        "id": "fuo9yvf",
        "permalink": "/r/investing/comments/h7zqt7/jerome_powells_financial_disclosure_form_2019/fuo9yvf/",
        "score": 1,
        "subreddit": "investing",
        "created": 1592051664.0
    },
    {
        "author": "ChaosTheoryGoldblum",
        "body": "Holy fuck I'd honestly be honored. I hope there's no typos because it's hard to keep keys from sticking with all my drooling and autism.",
        "created_utc": 1592027762,
        "id": "fuog6zy",
        "permalink": "/r/wallstreetbets/comments/h819kr/heres_why_i_bought_120_contracts_for_a_25c_0619/fuog6zy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592056562.0
    },
    {
        "author": "terpythrowaway",
        "body": "Honestly in my losses I’ve learned the keys to this shit are 1. Firm +/- 30% stop losses. 2. Don’t focus on the losers",
        "created_utc": 1592122767,
        "id": "fus7jjl",
        "permalink": "/r/wallstreetbets/comments/h7s30c/weekend_discussion_thread_for_the_weekend_of_june/fus7jjl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592151567.0
    },
    {
        "author": "jloy88",
        "body": "Will you take the keys to my robinhood account.  I am multiplying the other direction 59k to 10k",
        "created_utc": 1592089008,
        "id": "fuqxfaa",
        "permalink": "/r/wallstreetbets/comments/h83cfp/35k_590k_in_3_months/fuqxfaa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592117808.0
    },
    {
        "author": "LostInvestor",
        "body": "You go out and fight with a cop and take his weapon from him then point it at another cop and see how it works out for you. \n\nDude was DUI, were they just supposed to let him go so he can kill a family on their way home from Golden Corral? “Oh, sorry man, I guess you really don’t want to go to jail, here’s your keys have a nice night”",
        "created_utc": 1592126886,
        "id": "fusbl2e",
        "permalink": "/r/wallstreetbets/comments/h7s30c/weekend_discussion_thread_for_the_weekend_of_june/fusbl2e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592155686.0
    },
    {
        "author": "lhatekale",
        "body": "“Print” peals the silver voice of Jay.\n\nYou obey. \n\nYou hold shift and your palms start sweating. Then you gingerly press “b”. Anticipation builds. You release the two keys. A flawless “B” appears on the terminal. Your heart races. It is finally time. Your eyes fervently turn to the key you know to be “r” even though the lettering on it had long ago been worn away. You voraciously hold it down as you crane your neck up to gaze back to the screen. \n\n“Brrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr” is printed in a pleasantly bland font on an equally bland background. You cannot contain it anymore and a euphoric moan escapes your lips, only to be echoed back at you and redoubled by the voices of your neighbors and indeed the entire American working class as they too all Print. You know it is but a fraction of divinity as compared to Jay as he sits locked upon his Printer Throne. He dedicates the entirety of his almighty JPower to convert the “Brr” signals into liquid currency to print the USA into safety while kindly reassuring the good people that all is well. You release the “r” key eight rapturous hours later, utterly spent.",
        "created_utc": 1592408714,
        "id": "fv4rxmj",
        "permalink": "/r/wallstreetbets/comments/haof9a/daily_discussion_thread_for_june_17_2020/fv4rxmj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592437514.0
    },
    {
        "author": "Hjklhjklopiuybnm",
        "body": "KEYS",
        "created_utc": 1592432961,
        "id": "fv673fi",
        "permalink": "/r/wallstreetbets/comments/harj9d/5g_infrastructure_play_tomorrow/fv673fi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592461761.0
    },
    {
        "author": "nomadofwaves",
        "body": "I’m going to the Keys today. Mini vacation.",
        "created_utc": 1592483849,
        "id": "fv867a4",
        "permalink": "/r/wallstreetbets/comments/hbbw0e/daily_discussion_thread_for_june_18_2020/fv867a4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592512649.0
    },
    {
        "author": "killuasbestfriend",
        "body": "Cool, asking because I have stocks like Apple, FB, Keysight, AMD, Roku, Chegg etc and I've made decent profits from them so far. However I'm curious as to whether I should sell a fraction of these shares e.g. 10%, when they are doing exceptionally well or just hold and keep adding?",
        "created_utc": 1591468154,
        "id": "ft5s2ly",
        "permalink": "/r/pennystocks/comments/gxcmb4/5k_to_52k_in_3_years_of_trading/ft5s2ly/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591496954.0
    },
    {
        "author": "GardenofGandaIf",
        "body": "You know you can back up your keys...right?",
        "created_utc": 1591301622,
        "id": "fswb90i",
        "permalink": "/r/wallstreetbets/comments/gwj8gj/ronald_wayne/fswb90i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591330422.0
    },
    {
        "author": "RADIO02118",
        "body": "These are the only earnings plays that worked for me this season. TSLA, CRWD, PYPL. Therefore it is of my opinion, that these 3 tickers will keep making new highs continually, forever.",
        "created_utc": 1591137735,
        "id": "fsop5pb",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsop5pb/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591166535.0
    },
    {
        "author": "Nickjersey",
        "body": "yeah want a fun gamble?\n \nsend $10 to my paypal, I will either keep it or send you $20 back\n \nhint: I will keep it\n \nlmk if you want my paypal",
        "created_utc": 1591145865,
        "id": "fsp3y2r",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsp3y2r/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591174665.0
    },
    {
        "author": "GranAutismo92",
        "body": "Started with 2k, up 22k, got a good deal for the watch so I bought it, LULU, ATVI, PAYPAL, MAXR all triple baggers, csco and DIS 67% , 74%",
        "created_utc": 1591065101,
        "id": "fsle5jj",
        "permalink": "/r/wallstreetbets/comments/guyoxd/thank_you_jpow_gonna_tell_my_kid_that_i_bought/fsle5jj/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591093901.0
    },
    {
        "author": "PaperShark0001",
        "body": "I ran out of settled funds for the day, who tryna place some paypal bets 👁👄👁",
        "created_utc": 1591293789,
        "id": "fsvua9f",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvua9f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591322589.0
    },
    {
        "author": "BigEd781",
        "body": "&gt;Tesla, check.\n\n&gt;SpaceX, check.\n\n&gt;Starlink now, check.\n\nTwo of those don't belong... hey, Musk was also the CEO of PayPal. Should PP's stock price be correlated to Tesla's somehow as well?\n\n\n&gt;While not sounding like an outright fanboy of their products (hell, I don't even own a Tesla....) why isn't the stock price higher?\n\nBased on what? Your feelings? Let's see the math.",
        "created_utc": 1591209392,
        "id": "fsrvwel",
        "permalink": "/r/stocks/comments/gvzjpp/am_i_stupid_for_thinking_tsla_still_doesnt_have_3/fsrvwel/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1591238192.0
    },
    {
        "author": "dvdmovie1",
        "body": "Nvidia, Twilio, Shopify, Wix, ServiceNow, Microsoft, Datadog and many others. Even those that are ad-reliant have bounced considerably. Trade Desk up another 11% today and is now more than 2x since early April. Car sales were considerably better than expected in May (https://www.autoblog.com/2020/06/02/may-2020-us-auto-sales/), which sent Carvana up big yesterday. Security? Okta had a very good quarter the other day, Crowdstrike yesterday. Visa said two days ago that trends continue to improve, Paypal said April was the best month since its IPO.\n\nSome emerging markets tech names doing well. Look at SE +117% YTD. MELI +40%\n\n Google and Facebook suffered from ad spending on things like travel being down (Booking and Expedia spend a fortune on Google ads - Expedia's chairman noted \"“At Expedia, for instance, we spend $5 billion a year on advertising. We won’t spend $1 billion on advertising probably this year.\" A couple of years ago, Booking spent a billion on Google ads in the quarter (https://www.cnbc.com/2018/11/05/travel-giant-booking-spent-1-billion-on-google-ads-in-the-quarter.html.) So those companies are uniquely effected, but things have improved as Facebook noted on their conference call. Google may have suspended some spending recently, but they announced the other day that employees who choose to work from home can expense a grand worth of office furniture. https://nypost.com/2020/05/26/google-will-let-workers-expense-1000-worth-of-office-furniture/\n\nWork from home has certainly done well too, but if that becomes a bigger part of culture going forward to some degree, that becomes a long-term theme. Remote work - look at RNG, ZM, FIVN.  Look at telehealth - Teladoc has done well this year but Livongo +145% YTD. Look at CDN names like FSLY, which is +150% YTD/NET +71%",
        "created_utc": 1591215030,
        "id": "fss86wn",
        "permalink": "/r/investing/comments/gw0rp2/qqq_is_set_to_close_at_ath/fss86wn/",
        "score": 4,
        "subreddit": "investing",
        "created": 1591243830.0
    },
    {
        "author": "MLGameOver",
        "body": "TSLA 900c 6/5\n\nPayPal me 10%",
        "created_utc": 1591287675,
        "id": "fsvh0wk",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvh0wk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591316475.0
    },
    {
        "author": "1monster90",
        "body": "You shouldn't invest money you can't afford to lose. Personally, money in the stock market is money I am considering nonexistent until 2045.   \nDon't be greedy but don't be cynical either. I think you could really benefit from making a list of interesting stocks. And from that list try to pick at least 10 stocks that you find promising and buy. Even if it's just 1 share (that way you will be focused on these companies, it's not so much to make a profit than making yourself focus and research these companies. I find it easier to focus on stocks I have at least one share with that stocks I don't own at all).  \n\n\nHere is my list of shares I'm watching carefully, feel free to research it.  \nMSFT, V, MA, NKE, NTDOY, LOGI, SPXL, TQQQ, DOCU,  TRIP, ALGN, F, GME, APPL, NFLX, SBUX, LUV, HS, AMZN, AAL, TMUS, PG,  INTC, QCOM, PYPL, T, ATVI, RSG, FDM, AXP, CSCO, TGT, PLSE, TROW, ORCL,  FDX, CUBE, BABA, CTAS, ALK, JNJ, LLY, CB, NEE, FANG, GAMR, TWLO, TNA,  LABU, FAS, CTRE, PEP, EBAY, DFS, GE, SNQP, MS, RF, AMG, HIG, BR, BEN,  ZNGA, COR, WWE, WYNN, VT, VTI, ELY, ADBE, SQ, TWTR, CVS, CRSP, QQ, NDLS,  WU, MTRX, PUTW, TECL, GM, NYMT, MU and NDAQ .",
        "created_utc": 1591285099,
        "id": "fsvbk0t",
        "permalink": "/r/StockMarket/comments/gwijcd/i_sold_at_a_loss_today_and_experienced_the/fsvbk0t/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1591313899.0
    },
    {
        "author": "Jetisfly420",
        "body": "Sold PYPL at 4.00 instead of 8.00 \nSold DE at 2.0 instead of 6.00 \nSold SWBI at a loss instead of 4.00 profit \nI really suck at timing when to take take profits",
        "created_utc": 1591152669,
        "id": "fspfta4",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fspfta4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591181469.0
    },
    {
        "author": "Tiaan",
        "body": "FOMO too much. Going all in on the following:\n\nAMZN, TSLA, MA, V, AMD, DIS, CMG, TGT, KR, PYPL\n\nMay mango have mercy on my soul",
        "created_utc": 1591200394,
        "id": "fsrcic4",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsrcic4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591229194.0
    },
    {
        "author": "clarkefromtheark",
        "body": "Pypl was my only 100% this month because it's the only one I truly believed in and was willing to risk holding however I fomo'd into vtiq today but vtiq may deliver me to another 100% tmr if I'm lucky",
        "created_utc": 1591076274,
        "id": "fslvhfb",
        "permalink": "/r/wallstreetbets/comments/gurxgt/what_are_your_moves_tomorrow_june_02_2020/fslvhfb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591105074.0
    },
    {
        "author": "Ax1er",
        "body": "True but it's profitable. Got lulu, sbux, msft, appl, pypl, fb, MGM, jpm, dis, DAL, eat, dkng, ba, lly, jnj, mrna leaps in just sitting on.",
        "created_utc": 1591050678,
        "id": "fsko0no",
        "permalink": "/r/wallstreetbets/comments/gurxgt/what_are_your_moves_tomorrow_june_02_2020/fsko0no/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591079478.0
    },
    {
        "author": "ray120",
        "body": "First get a regular bank account not a PayPal account.",
        "created_utc": 1591034042,
        "id": "fsjq2ic",
        "permalink": "/r/stocks/comments/gup9j0/can_someone_help_me_get_into_stocks/fsjq2ic/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591062842.0
    },
    {
        "author": "Raccoonpug",
        "body": "so when is the rug pull for SQ and PYPL? Im dying here",
        "created_utc": 1591138228,
        "id": "fsoq4b5",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsoq4b5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591167028.0
    },
    {
        "author": "Slouchingtowardsbeth",
        "body": "I'll PayPal you 200 bucks if you teach me how to make this myself.",
        "created_utc": 1591157933,
        "id": "fspodld",
        "permalink": "/r/wallstreetbets/comments/gvgbnh/whats_on_rwsbs_mind_today_most_popular_tickers/fspodld/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591186733.0
    },
    {
        "author": "whammyyy",
        "body": "Up, they will be their own PayPal",
        "created_utc": 1591289453,
        "id": "fsvkv2g",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvkv2g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591318253.0
    },
    {
        "author": "soliloquilee",
        "body": "PayPal weeklies.",
        "created_utc": 1591232379,
        "id": "fst6p2e",
        "permalink": "/r/wallstreetbets/comments/gw1ihx/what_are_your_moves_tomorrow_june_04_2020/fst6p2e/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591261179.0
    },
    {
        "author": "OrganicBerries",
        "body": "Wait wtf PayPal went from 99$ to all time highs in a month",
        "created_utc": 1591197651,
        "id": "fsr6okb",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsr6okb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591226451.0
    },
    {
        "author": "avelak",
        "body": "EVRI coming back from the fucking dead\n\nWas down like 15% AH, now basically flat\n\nDoesn't seem like it'll pull a PYPL though",
        "created_utc": 1591133073,
        "id": "fsofqii",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsofqii/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591161873.0
    },
    {
        "author": "callmekizzle",
        "body": "Just PayPal me 30k instead. Hell Just PayPal me 10k instead.",
        "created_utc": 1591137042,
        "id": "fsonsuf",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsonsuf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591165842.0
    },
    {
        "author": "banuntil",
        "body": "i went all in on 150p 6/26 on PYPL. theres got to be a correction right??",
        "created_utc": 1591236113,
        "id": "fstdd3z",
        "permalink": "/r/wallstreetbets/comments/gw1ihx/what_are_your_moves_tomorrow_june_04_2020/fstdd3z/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591264913.0
    },
    {
        "author": "whammyyy",
        "body": "I’d be careful with PayPal puts because of Venmo and the increase of online sales on other sites due to Covid",
        "created_utc": 1591289803,
        "id": "fsvlmod",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvlmod/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591318603.0
    },
    {
        "author": "steatorrhoea",
        "body": "Tesla actually made products and had proven tech. And who tf is Trevor Milton? Just because you’re loud like Elon on twitter doesn’t make you a fucking genius. Both the tech and the ceo is unproven lmao. Y’all getting finessed\n\nAt least Elon proved he can succeed with PayPal and spent his own hard cash on Tesla",
        "created_utc": 1591230427,
        "id": "fst35zb",
        "permalink": "/r/wallstreetbets/comments/gw1ihx/what_are_your_moves_tomorrow_june_04_2020/fst35zb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591259227.0
    },
    {
        "author": "zdonkeyspeaks",
        "body": "Hello there. Yes, some stocks are great!! You have a few good ones there. But some good Tech/ more consumer plays.  Ex.  AAPL PYPL NKE SQ CRM are some. Good luck!",
        "created_utc": 1591137798,
        "id": "fsopa7h",
        "permalink": "/r/investing/comments/gvhjtv/i_have_saved_up_10000_dollars_are_stocks_a_good/fsopa7h/",
        "score": 2,
        "subreddit": "investing",
        "created": 1591166598.0
    },
    {
        "author": "excadedecadedecada",
        "body": "\"Tariffs on Amazon, Tesla, Mastercard, Visa, Su Bae, Disney, Chipotle, Target, Kroger and Paypal! Effective immediately!!\"",
        "created_utc": 1591200470,
        "id": "fsrco5q",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsrco5q/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591229270.0
    },
    {
        "author": "Bramptonboy",
        "body": "I was reading up on SQ and contemplating buying some shares. Why do you think it'll disrupt the financial industry? In terms of Paypal, I think either MA or V will outperform it this decade; any thoughts?",
        "created_utc": 1591154260,
        "id": "fspiiuc",
        "permalink": "/r/stocks/comments/gvkm7x/faang_msfttesla_future_predictionopinionthoughts/fspiiuc/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591183060.0
    },
    {
        "author": "high4days420",
        "body": "So many i can’t even really name em all. Facebook square earnings. PayPal earnings. Activision earnings. AAXN. Spy 310c. MVRL. CSOD. INO. Qcom. Bud. List goes on",
        "created_utc": 1591203400,
        "id": "fsriv6t",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsriv6t/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591232200.0
    },
    {
        "author": "KifDawg",
        "body": "Those are all centralized, paypal can decide tomorrow to lock your funds. That will never ever happen with bitcoin, there is no centralized head that can be forced to comply. Its comply censorship resistant that's why. I'm still going to use PayPal but it's nice to have options",
        "created_utc": 1591036983,
        "id": "fsjw7dr",
        "permalink": "/r/investing/comments/guja62/where_do_you_see_bitcoin_in_10_years/fsjw7dr/",
        "score": 1,
        "subreddit": "investing",
        "created": 1591065783.0
    },
    {
        "author": "MysteriousAdvance2",
        "body": "I honestly haven’t found a reason to use bitcoin. Credit cards and PayPal work for me. \n\nCan someone give me some legitimate reasons why your average person needs bitcoin?",
        "created_utc": 1591044160,
        "id": "fskb0lq",
        "permalink": "/r/investing/comments/guja62/where_do_you_see_bitcoin_in_10_years/fskb0lq/",
        "score": 1,
        "subreddit": "investing",
        "created": 1591072960.0
    },
    {
        "author": "Pschemm31",
        "body": "Second this. When I started implementing Stripe as a payment processor  at work(~2014). I noticed how much easier it is from the dev prospective.  Compared to a paypal at the time. \n\nWas sad to see they had no intention of going public.  Felt like I found gold when the thought came to me to invest.",
        "created_utc": 1591182884,
        "id": "fsqi41a",
        "permalink": "/r/stocks/comments/gvj622/what_companies_are_private_but_you_totally/fsqi41a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591211684.0
    },
    {
        "author": "oonair",
        "body": "NKLA's little brother CNHI\n\nedit - and I take paypal, you are welcome",
        "created_utc": 1591221368,
        "id": "fsslizd",
        "permalink": "/r/wallstreetbets/comments/gw1ihx/what_are_your_moves_tomorrow_june_04_2020/fsslizd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591250168.0
    },
    {
        "author": "nnaoeznnaoezhis",
        "body": "Paypal me that $500 and me returning it with $1000 has a higher chance than 220 Puts LOL",
        "created_utc": 1591165039,
        "id": "fspy5kd",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fspy5kd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591193839.0
    },
    {
        "author": "Wuzztopher",
        "body": "Zoom, peloton, PayPal, etc etc.... not a rule, just no way to know the future",
        "created_utc": 1591229675,
        "id": "fst1saa",
        "permalink": "/r/wallstreetbets/comments/gvuhyu/cldr/fst1saa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591258475.0
    },
    {
        "author": "SteamedHamSalad",
        "body": "&gt;PayPal is a cheaper stock with the same fundamentals as LULU.\n\nComparing these two companies doesn't make a lick of sense. Even if their fundamentals are the same (I highly doubt it) they are in completely different industries. By what metric is PayPal cheaper than LULU?",
        "created_utc": 1591207464,
        "id": "fsrrpdv",
        "permalink": "/r/stocks/comments/gvopo2/whats_the_next_move/fsrrpdv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591236264.0
    },
    {
        "author": "ninjaspartan76",
        "body": "Are you cosplaying Elon, elonomicsfund? You started paypal, sold it. Now you have Spacex, boring co, and tsla? Born a white male African American. I don't think you should be playing other stocks in the market, the SEC might not like it.",
        "created_utc": 1591202877,
        "id": "fsrhr4m",
        "permalink": "/r/wallstreetbets/comments/gv9mo5/cortisol_level_stabilizing_after_selling_74m/fsrhr4m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591231677.0
    },
    {
        "author": "DynamicDentures",
        "body": "Balls deep in PYPL calls 6/19 cheap as fuck",
        "created_utc": 1591193085,
        "id": "fsqxkfk",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsqxkfk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591221885.0
    },
    {
        "author": "Davidkanye",
        "body": "Good weekly/monthly but swap to some longs on PayPal or somethin with a little profit else bcz spy/electronic payments should still be money long term",
        "created_utc": 1591130571,
        "id": "fsoai3b",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsoai3b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591159371.0
    },
    {
        "author": "toshi_g",
        "body": "V PYPL SQ MA\n\nAll buy and hold.\n\nEnd of story",
        "created_utc": 1591232935,
        "id": "fst7omn",
        "permalink": "/r/stocks/comments/gw2b5m/thoughts_on_sq/fst7omn/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591261735.0
    },
    {
        "author": "hlyyyy",
        "body": "None... Nadda zero. Look into arkk, pypl",
        "created_utc": 1591242173,
        "id": "fstnnix",
        "permalink": "/r/stocks/comments/gw7zr4/favourite_bank_stocks/fstnnix/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591270973.0
    },
    {
        "author": "whammyyy",
        "body": "Up, another revenue stream similar to PayPal. A large portion of PayPals revenue is generated through eBay I think maybe 30 or 40% (Paypal is the preferred payment method so buyers have protections from sellers)",
        "created_utc": 1591289557,
        "id": "fsvl3bq",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvl3bq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591318357.0
    },
    {
        "author": "Ned_Flanderz",
        "body": "Paypal me or stop posting\n\nMooooommmmm, this man robbed me\n\nStocks only go up",
        "created_utc": 1591279855,
        "id": "fsv0ykq",
        "permalink": "/r/wallstreetbets/comments/gwhycu/once_more_unto_the_marketpocalypse_breach/fsv0ykq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591308655.0
    },
    {
        "author": "derprondo",
        "body": "All aboard the elevator!  We’re going for a ride down this morning.  Thanks to the Comcast outage I’m not balls deep in shares and calls.  I’m going to get my ass destroyed on some PYPL calls, but only a few hundred worth.  Bears this is your day for the week.",
        "created_utc": 1591267876,
        "id": "fsuiy00",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsuiy00/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591296676.0
    },
    {
        "author": "theta-dog-420",
        "body": "take some profit and paypal me for the advice",
        "created_utc": 1591248361,
        "id": "fstwt2m",
        "permalink": "/r/wallstreetbets/comments/gw1ihx/what_are_your_moves_tomorrow_june_04_2020/fstwt2m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591277161.0
    },
    {
        "author": "2gurleys1kupp",
        "body": "why those cunts at PYPL being gay today?",
        "created_utc": 1591022055,
        "id": "fsj2ob2",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsj2ob2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591050855.0
    },
    {
        "author": "UltimateRewards",
        "body": "Amazon, activision, ebay, paypal of SE asia. Blew out earnings report and still low market cap compared to growth potential. What's not to like.",
        "created_utc": 1591033349,
        "id": "fsjomjj",
        "permalink": "/r/stocks/comments/guooxa/sea_limited_se_a_buy/fsjomjj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591062149.0
    },
    {
        "author": "csklmf",
        "body": "If your financial goal is for long term, hold for a little while and see how it goes. But I gotta say it’s too early to tell if Nikola is the next tesla. Nikola is still at a very early stage of business..... nothing is clear yet. Business owner of Nikola also does not have successful past business building history like Elon with PayPal.",
        "created_utc": 1591050363,
        "id": "fskneqj",
        "permalink": "/r/stocks/comments/guudae/sell_or_hold_vtiq/fskneqj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591079163.0
    },
    {
        "author": "leonardnimoyNC1701",
        "body": "Yeah I'm never surprised anymore just wanted to make sure OP knew you can do this literally anywhere (try paypal for example) and it's not indicative of a security flaw.",
        "created_utc": 1591045954,
        "id": "fskeoiy",
        "permalink": "/r/wallstreetbets/comments/gurxgt/what_are_your_moves_tomorrow_june_02_2020/fskeoiy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591074754.0
    },
    {
        "author": "Stonk_Wizard",
        "body": "Im not doing that bad tho. 🤷🏻‍♂️ I started options for the first time in February 20\n\nMaybe you should just PayPal me your money, I will invest it for you...\n\n\nhttps://ibb.co/HtmDgKF",
        "created_utc": 1591107183,
        "id": "fsmxoql",
        "permalink": "/r/wallstreetbets/comments/gv7p6x/21_year_old_retard_update_as_promised_dkng_puts/fsmxoql/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591135983.0
    },
    {
        "author": "cookiescards12",
        "body": "I just tell myself profit is profit, and that I could have easily just not done the play at all. It does suck tho seeing it go up even more after you sell off. I had $146 PYPL calls for last week. I sold at around $3.50. A day later it was in the $6.25 ish range. But at least I made really good profit (like 700%). So yeah, just tell yourself you could be like 90 percent of autists in this subreddit and lose thousands in a day to FOMO.",
        "created_utc": 1591222036,
        "id": "fssmwpw",
        "permalink": "/r/wallstreetbets/comments/gw1ihx/what_are_your_moves_tomorrow_june_04_2020/fssmwpw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591250836.0
    },
    {
        "author": "cookiescards12",
        "body": "God dammit I want paypal to go down so I can increase my position. Instead, it hits ATH's.",
        "created_utc": 1591278891,
        "id": "fsuz5aw",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsuz5aw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591307691.0
    },
    {
        "author": "estevado",
        "body": "Those are great stocks to buy/hold. Definitely add Square (SQ) to the list which is disrupting the financial industry and leading the war on cash. Also keep an eye on MELI, PYPL and ROKU.",
        "created_utc": 1591150011,
        "id": "fspb88a",
        "permalink": "/r/stocks/comments/gvkm7x/faang_msfttesla_future_predictionopinionthoughts/fspb88a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591178811.0
    },
    {
        "author": "High-__-there",
        "body": "Tsla will outperform all once their money printer (ai software) is complete. Hardware will be scaling massively (see battery day). Easy the biggest company in the world. Think apple x uber\n\nApple still making great hardware and moving into the massive opportunity in the heath care sector. Will likely keep printing money for some time\n\nAmazon all aspects of business is poised to keep growing and covid has accelerated that. Bezos is beast\n\nGoogle no real innovation seemingly just relying on youtube money and ads are dying imo (memes are better)\n\nFb ad revenue is so 2010 but these guys have many untapped revenue streams, extremely strong network effect, and all the most valuable data in the world. Zuckerberg is a robot and im not really comfortable with it\n\nMicrosoft is maximizing all revenue streams atm. Business is boring imo, i prefer apple\n\nSquare as others said will be massive juggernaut in the fintech space surpassing paypal, ma, v, due to their bottom up approach, cryptocurrency innovations and simplified services. Run by one of only 2 people simultaneously running 2 multibillion dollar companies",
        "created_utc": 1591155092,
        "id": "fspjw19",
        "permalink": "/r/stocks/comments/gvkm7x/faang_msfttesla_future_predictionopinionthoughts/fspjw19/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591183892.0
    },
    {
        "author": "Peter_Jennings_Lungs",
        "body": "Visa or PayPal, boys?",
        "created_utc": 1591187759,
        "id": "fsqog0i",
        "permalink": "/r/stocks/comments/gvprm2/rstocks_daily_discussion_wednesday_jun_03_2020/fsqog0i/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591216559.0
    },
    {
        "author": "Jalja",
        "body": "I'll paypal you 0 bucks if you teach me how to make this myself",
        "created_utc": 1591193208,
        "id": "fsqxsqq",
        "permalink": "/r/wallstreetbets/comments/gvgbnh/whats_on_rwsbs_mind_today_most_popular_tickers/fsqxsqq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591222008.0
    },
    {
        "author": "Ehombre",
        "body": "If you so proud to throw away money, send me some.\n\nI got the Paypal and Venmo on standby. You love to lose, don't you bitch?",
        "created_utc": 1591202016,
        "id": "fsrfx21",
        "permalink": "/r/wallstreetbets/comments/gveg4m/25000_yolo_on_shopify_850_call_expiring_friday/fsrfx21/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591230816.0
    },
    {
        "author": "cookiescards12",
        "body": "I played paypal when it was trading for 140 ish on the 27th. I also bought 10 shares at 123 prior to earnings. So its been really nice to me so far. What are your thoughts on playing 7/22 earnings? I'm not sure if their inevitable good earnings call is priced in right now.",
        "created_utc": 1591138420,
        "id": "fsoqhq3",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsoqhq3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591167220.0
    },
    {
        "author": "snehal_patel",
        "body": "In the IBD newlestter there is a list of stocks to buy now. Those stocks according to the newletters are suppose to near breakout from the cup and handle format. If you compare them with Marketsmith you will see the glaring difference. The paypal buy recommendation in their newsletter and sell recommendation on Marketsmith was a classic pump and dump scheme skewed towrds marketsmith users. As for the lists I believe there are etfs with all the holdings so kind of defeats the purpose of paying monthly.\n\nThat being said marketsmith is pretty good no doubt. Just very expensive. At around 50 a month it would be great for individual investors.\n\nThe cup and handle pattern is great pattern for the bull market no doubt about it.\n\nI havent looked at gorilla trades. Thanks for letting me know. Will check them out. \n\nIf there are any others do let me know.",
        "created_utc": 1591138906,
        "id": "fsorg4m",
        "permalink": "/r/stocks/comments/gmwz2i/is_ibd_a_scaminvestor_business_daily_review/fsorg4m/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591167706.0
    },
    {
        "author": "azwel",
        "body": "I think so too. Personally I rarely use paypal, but i guess many people on the net are in the habit.   I think they have paypal credit cards.. but Ive never seen anyone use one..",
        "created_utc": 1591127471,
        "id": "fso3tm7",
        "permalink": "/r/stocks/comments/gvc4rb/pypl_paypal_stock/fso3tm7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591156271.0
    },
    {
        "author": "SteamedHamSalad",
        "body": "&gt;The fundamentals are that they are on the rise because people are home and using their online services.\n\nThat is not what fundamentals are. \n\n&gt;PayPal shares cost ~$156 and LULU shares cost ~$322.\n\nThe price of a single share is not a good way to determine which stock is cheaper. This is because each company has a different number of total available shares. One share of LULU gets you a higher percentage of the company than one share of PayPal. What you are doing would be like comparing the price of 10 apples to the price of 20 oranges.",
        "created_utc": 1591215371,
        "id": "fss8x6x",
        "permalink": "/r/stocks/comments/gvopo2/whats_the_next_move/fss8x6x/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591244171.0
    },
    {
        "author": "Ankel88",
        "body": "what about paypal?",
        "created_utc": 1591289573,
        "id": "fsvl4la",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvl4la/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591318373.0
    },
    {
        "author": "whammyyy",
        "body": "It’s bad for PayPal but they have Venmo which is growing",
        "created_utc": 1591289639,
        "id": "fsvl9sd",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvl9sd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591318439.0
    },
    {
        "author": "whammyyy",
        "body": "It’s globally. They’re bailing from having PayPal be the one and only preferred payment method.",
        "created_utc": 1591290579,
        "id": "fsvna6f",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvna6f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591319379.0
    },
    {
        "author": "Phlebotanist",
        "body": "Paypal",
        "created_utc": 1591289553,
        "id": "fsvl2zt",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvl2zt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591318353.0
    },
    {
        "author": "cwilber88",
        "body": "They were reinvesting them for 30+ years but now in retirement, doing a bit of both. It helps that my mom worked for United Healthcare and got shares while working so she had as much as 1000 but sold about 250 a few years back. She also got Microsoft at like $39 and PayPal when it split off EBay, Altria and Phillip Morris spin off, plus Kraft. Verizon. Lots of the big ones but purchased decades ago....",
        "created_utc": 1591285091,
        "id": "fsvbjgt",
        "permalink": "/r/investing/comments/gwbi7j/i_feel_like_were_all_on_a_sinking_ship_waiting/fsvbjgt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1591313891.0
    },
    {
        "author": "estevado",
        "body": "Good observation re MA and V. I feel equally bullish on them and PYPL but even more optimistic about SQ. SQ has an amazing ecosystem for small merchants but is now also a bank that can loan money. Add to that their popular payment and investing app for consumers and the ability to take this abroad and scale to epic proportions. Everything is backed by a visionary leader.",
        "created_utc": 1591154841,
        "id": "fspjhjt",
        "permalink": "/r/stocks/comments/gvkm7x/faang_msfttesla_future_predictionopinionthoughts/fspjhjt/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591183641.0
    },
    {
        "author": "Double_Anybody",
        "body": "Give it a few. PayPal dumped then had* a run up a few hours later.",
        "created_utc": 1591133476,
        "id": "fsogkum",
        "permalink": "/r/wallstreetbets/comments/gvgahz/genuine_question_why_is_zoom_tanking_after_a/fsogkum/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591162276.0
    },
    {
        "author": "MLGameOver",
        "body": "I mean\n\nJust PayPal me the money instead. I’ll be able to give my gf several great dinners.",
        "created_utc": 1591136628,
        "id": "fsomzfg",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsomzfg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591165428.0
    },
    {
        "author": "KoalaBoy",
        "body": "PayPal is regularly used on eBay still and Shopify and woocommerce use PayPal by default so you don't have to set up a payment gateway with authorize.net or stripe. And PayPal gets a cut of every transactions and people who cash out their accounts to there bank. PayPal is more then a credit card. Hold them long. I'm in 500 shares at 115.",
        "created_utc": 1591142244,
        "id": "fsoxgrz",
        "permalink": "/r/stocks/comments/gvc4rb/pypl_paypal_stock/fsoxgrz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591171044.0
    },
    {
        "author": "Suds08",
        "body": "Paypal 2021 calls for long term gains",
        "created_utc": 1591142611,
        "id": "fsoy4oe",
        "permalink": "/r/wallstreetbets/comments/gvhs5y/need_some_long_term_stonks_to_park_some_winnings/fsoy4oe/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591171411.0
    },
    {
        "author": "Coda70",
        "body": "Another day of selling.  Sold my financials today.  JPM, Amex, paypal, XLF.  For double or more! Need one more rally in tech and I’ll be all cash gang. And wait for the next dip. Shit is so fucking fun... when it’s working.",
        "created_utc": 1591107864,
        "id": "fsmyylf",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsmyylf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591136664.0
    },
    {
        "author": "nafinmasjid",
        "body": "ZM puts are too obvious.. but the again PYPL and ATVI calls were obvious as well.",
        "created_utc": 1591121691,
        "id": "fsnrgoo",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnrgoo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591150491.0
    },
    {
        "author": "Solooosteph",
        "body": "Ofc, if you paypal me 100 so I can yolo again on soy puts (got them nip piercings too so u know its worth it 🔥)",
        "created_utc": 1591125726,
        "id": "fso02vc",
        "permalink": "/r/wallstreetbets/comments/gvdq1l/a_month_back_i_won_a_bet_being_top_comment/fso02vc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591154526.0
    },
    {
        "author": "SxCTang",
        "body": "Pypl is a safe pick regardless if there is a vaccine made or not. It’s a low risk pick in my opinion with potential for upside in the future.",
        "created_utc": 1591127275,
        "id": "fso3egd",
        "permalink": "/r/stocks/comments/gvc4rb/pypl_paypal_stock/fso3egd/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591156075.0
    },
    {
        "author": "sharkingdonkey",
        "body": "I'm looking into some large caps to move into once I take profit on DKNG. Considering MSFT, FB, and PYPL.",
        "created_utc": 1591111426,
        "id": "fsn5zwz",
        "permalink": "/r/stocks/comments/gv90ir/looking_to_invest_20k/fsn5zwz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591140226.0
    },
    {
        "author": "Its_the_dankness",
        "body": "Not totally sure to be honest, haven't followed SQ or PYPL very closely. That's just my speculation as to why its rallied, could be totally off-base",
        "created_utc": 1591119855,
        "id": "fsnnl1i",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnnl1i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591148655.0
    },
    {
        "author": "Double_Anybody",
        "body": "Yea it is kinda pricey. I did see that Boeing run up, that was crazy. PayPal is a cheaper stock with the same fundamentals as LULU. It’s Q2 earnings are coming up, high user count due to the rona, and is a solid company before the virus.",
        "created_utc": 1591202609,
        "id": "fsrh6ol",
        "permalink": "/r/stocks/comments/gvopo2/whats_the_next_move/fsrh6ol/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591231409.0
    },
    {
        "author": "bonejohnson8",
        "body": "I owe paypal money for a 10k loan I had to take out that banks wouldn't give me. You don't want this.",
        "created_utc": 1591223839,
        "id": "fssqkt8",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fssqkt8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591252639.0
    },
    {
        "author": "nothrowaway4me",
        "body": "Why are the bitcoin boys always comparing it to cash or gold\n\nMotherfucker you heard of PayPal? Transferwise? Revolut? Monese? Venmo? Xoom?\n\nAnd these are just the solutions for the western world, check out Alipay &amp; WeChat in China, or Sea Money from $SE (a real company actually changing the world of payments in South East Asia), India already digitalized the rupee.\n\n\nBitcoin is only useful for those in failed third world states with no rule of law, for everyone else it's completely useless",
        "created_utc": 1591035285,
        "id": "fsjsn04",
        "permalink": "/r/investing/comments/guja62/where_do_you_see_bitcoin_in_10_years/fsjsn04/",
        "score": 1,
        "subreddit": "investing",
        "created": 1591064085.0
    },
    {
        "author": "WSBVoteBot",
        "body": "**A Submission was Spammed by Vote**\n___\n**Title:** Buy $PYPL\n\n**URL:** https://redd.it/gusy12\n___\n[Click Here to Vote to Approve](https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=restore&amp;message=gusy12) if this is a good submission.\n\nHey /u/PlofkimPlooie, you're encouraged to copy and paste the approval link into the Daily Discussion thread for help restoring your post.\n\nUsers who Voted:\nPlofkimPlooie\nborosel",
        "created_utc": 1591046782,
        "id": "fskgd9p",
        "permalink": "/r/wallstreetbets/comments/gu9yks/wsbvotebot_log_for_jun_01_2020/fskgd9p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591075582.0
    },
    {
        "author": "my__ANUS_is_BLEEDING",
        "body": "Send it to my PayPal",
        "created_utc": 1591127306,
        "id": "fso3gx8",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso3gx8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156106.0
    },
    {
        "author": "steatorrhoea",
        "body": "The key was the idea was READY TECH. Elon must utilizes the internet to make PayPal to fill an unmet market. He did the same with Tesla. Hydrogen fuel ain’t it.",
        "created_utc": 1591242957,
        "id": "fstowsk",
        "permalink": "/r/wallstreetbets/comments/gw1ihx/what_are_your_moves_tomorrow_june_04_2020/fstowsk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591271757.0
    },
    {
        "author": "ron_sterling",
        "body": "Disney, tesla, zbh, fb, PayPal, Square...",
        "created_utc": 1591141334,
        "id": "fsovsg2",
        "permalink": "/r/wallstreetbets/comments/gvhs5y/need_some_long_term_stonks_to_park_some_winnings/fsovsg2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591170134.0
    },
    {
        "author": "Shaun80",
        "body": "Some sectors are booming because of the pandemic and have huge growth potential when we emerge into our new normal post pandemic. This is especially true for technology allowing remote entertainment, medicine , commerce, payment and communication.  Netflix, E-commerce (Amazon,Shop) , Zoom video conferencing, cloud computing  (MSFT, Veev, Crm,fsly) , AI robotics (NVIDiA ,TSLA,TWLO, GOOG), 5G technology, semiconductors (AMD,TSM, QCOM, INTC) fintech (Square, Paypal, MA ,V), telemedicine (TDOC)   Brick and mortar retailers,oil , resources , REITs, financial sector will all take a hit when the economy opens to the new normal.",
        "created_utc": 1591154675,
        "id": "fspj7rc",
        "permalink": "/r/CanadianInvestor/comments/gvie4z/can_someone_explain_why_its_still_a_good_idea_to/fspj7rc/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1591183475.0
    },
    {
        "author": "Double_Anybody",
        "body": "The fundamentals are that they are on the rise because people are home and using their online services. Both have pre-earnings run up, LULU for Q1 and PayPal for Q1 and upcoming Q2. PayPal shares cost ~$156 and LULU shares cost ~$322. I’m going to hold off on making fun of you and advise you get checked for a learning disability.",
        "created_utc": 1591210197,
        "id": "fsrxo8h",
        "permalink": "/r/stocks/comments/gvopo2/whats_the_next_move/fsrxo8h/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591238997.0
    },
    {
        "author": "Ankel88",
        "body": "that's a very strange story, since PayPal was their spin off lol! it went out of control ahaahha",
        "created_utc": 1591290725,
        "id": "fsvnldl",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvnldl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591319525.0
    },
    {
        "author": "blindwillie777",
        "body": "Do you really think terrorists are going to fund their transactions with something that can be traced straight to them?\n\n\"Media reports have outlined the notion that some, or even many, terrorist organizations have unlimited, untraceable sources of digital money, such as Bitcoin, which will be used to undermine the successes of CTF.1 Policymakers also have raised concerns about terrorist use of digital currencies.\"\n\nReference: 2 1 Heather Nauert, “ISIS Parks Its Cash in Bitcoin, Experts Say,” Fox News, November 2011; Ian McKendry, “ISIL May Be Using Bitcoin, Fincen’s Calvery Says,” American Banker, November 16, 2015; Resty Woro Yuniar, “Bitcoin, PayPal Used to Finance Terrorism, Indonesian Agency Says,” Wall Street Journal, January 10, 2017.",
        "created_utc": 1591062928,
        "id": "fsladld",
        "permalink": "/r/investing/comments/guja62/where_do_you_see_bitcoin_in_10_years/fsladld/",
        "score": 0,
        "subreddit": "investing",
        "created": 1591091728.0
    },
    {
        "author": "floodster",
        "body": "You can send less than $20k, I don't think that's his main point here. With a world that is increasingly global, it is absolutely a big advantage to be able to send transfers to any country on the planet, including those not served by other services (Paypal etc).",
        "created_utc": 1591038053,
        "id": "fsjyg9g",
        "permalink": "/r/investing/comments/guja62/where_do_you_see_bitcoin_in_10_years/fsjyg9g/",
        "score": 0,
        "subreddit": "investing",
        "created": 1591066853.0
    },
    {
        "author": "PaperShark0001",
        "body": "Who tryna bet 20 bucks paypal with me that Nflx wont break 415 today",
        "created_utc": 1591293551,
        "id": "fsvtrft",
        "permalink": "/r/wallstreetbets/comments/gwenjo/daily_discussion_thread_for_june_04_2020/fsvtrft/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1591322351.0
    },
    {
        "author": "Rianis96",
        "body": "i made a huge discovery. i can just accuse a white person of being racist if i need them to do something i want. hey cucklords, paypal me money or you're racist",
        "created_utc": 1591243415,
        "id": "fstpmo3",
        "permalink": "/r/wallstreetbets/comments/gw1ihx/what_are_your_moves_tomorrow_june_04_2020/fstpmo3/",
        "score": -21,
        "subreddit": "wallstreetbets",
        "created": 1591272215.0
    },
    {
        "author": "brownbrandon",
        "body": "my positions are red but I'm choosing to close the app and not be a weak handed bitch this afternoon.\n\nDKNG 45c 6/5  \nBAC 25.5c 6/5  \nQCOM 85c 6/12  \nTAK 20c 6/19",
        "created_utc": 1591121172,
        "id": "fsnqdcz",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnqdcz/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1591149972.0
    },
    {
        "author": "WSBankrupt",
        "body": "5G is going to be pushed hard.  I've done a fair bit of research on tickers that are worthwhile if it blows up as much as I think it will.  The implementation of these mesh networks could be huge for many companies.\n\nNetwork Implementation - NOK and ERIC (Would grab NOK asap)\n\nBase Station Chipsets - MRVL\n\nPhone Semis - QCOM\n\nIndustrial + Vehicle Semis - NXPI\n\nShared Comms Infrastructure - AMT\n\nMulti Discipline - INTC\n\n&amp;#x200B;\n\nI hold positions (leaps or stonks in almost all of the above)",
        "created_utc": 1591055320,
        "id": "fskwp03",
        "permalink": "/r/wallstreetbets/comments/gurxgt/what_are_your_moves_tomorrow_june_02_2020/fskwp03/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591084120.0
    },
    {
        "author": "OblivionXBA",
        "body": "Someone here commented about Qualcomm this morning. WHAT DID YOU KNOW",
        "created_utc": 1591129192,
        "id": "fso7kmf",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso7kmf/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591157992.0
    },
    {
        "author": "Krusher4Lyfe",
        "body": "I can’t fucking pick anything right. \n\nSold my BABA calls yesterday for a loss, day traded a QCOM call for ten bucks\n\nBought SFIX and T calls instead.\n\nReally those or UAL to pay off so I can continue to finance my newfound passion for losing money.",
        "created_utc": 1591139210,
        "id": "fsorzv8",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsorzv8/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591168010.0
    },
    {
        "author": "Jetisfly420",
        "body": "QCOM don’t stop I’m so hard",
        "created_utc": 1591125664,
        "id": "fsnzy81",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnzy81/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591154464.0
    },
    {
        "author": "donny1231992",
        "body": "QCOM ftw",
        "created_utc": 1591125383,
        "id": "fsnzcym",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnzcym/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591154183.0
    },
    {
        "author": "terpythrowaway",
        "body": "QCOM HITTING 85 EOD GET THE FUCK IN WHILE YOU CAN",
        "created_utc": 1591127237,
        "id": "fso3bhk",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso3bhk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591156037.0
    },
    {
        "author": "kamikazi3728",
        "body": "In no particular order\n\nCCI (cell site properties)\n\nCOMM (panel antennas)\n\nAMT (cell site properties)\n\nFIVG (5G ETF)\n\nSBAC (cell site properties)\n\nQCOM (its Qualcomm, need you know more?)\n\nNXPI (semiconductors)",
        "created_utc": 1591061617,
        "id": "fsl81js",
        "permalink": "/r/RobinHoodPennyStocks/comments/guq3ce/nok_will_be_leaving_the_station/fsl81js/",
        "score": 3,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1591090417.0
    },
    {
        "author": "HMSS-Overkill",
        "body": "Alternatively qualcomm will supply most semiconductors for 5G in the US",
        "created_utc": 1591199704,
        "id": "fsrb1z9",
        "permalink": "/r/CanadianInvestor/comments/gvvet5/ericsson_eric_not_on_wealthsimple_trade/fsrb1z9/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1591228504.0
    },
    {
        "author": "Jetisfly420",
        "body": "QCOM calls $85 6/12",
        "created_utc": 1591064193,
        "id": "fslcl59",
        "permalink": "/r/wallstreetbets/comments/gurxgt/what_are_your_moves_tomorrow_june_02_2020/fslcl59/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591092993.0
    },
    {
        "author": "wrodrigues2008",
        "body": "NOK just got upgraded, 5G is just around the corner. And stocks like ERIK and QCOM tend to follow the hype and are set up for when 5G kicks off this summer. I’ve got leaps on all of them and they are printing. QCOM is still good to get in.",
        "created_utc": 1591058202,
        "id": "fsl1xar",
        "permalink": "/r/options/comments/gus2no/qcom_whats_happening/fsl1xar/",
        "score": 2,
        "subreddit": "options",
        "created": 1591087002.0
    },
    {
        "author": "donny1231992",
        "body": "Is QCOM up because ex dividend is tomorrow? Then it’s gonna dump?",
        "created_utc": 1591137834,
        "id": "fsopcnt",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsopcnt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591166634.0
    },
    {
        "author": "high4days420",
        "body": "Yes. Qcom saving my account in the last hour. Jumping with joy",
        "created_utc": 1591127298,
        "id": "fso3g9i",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso3g9i/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591156098.0
    },
    {
        "author": "CantonGooner",
        "body": "Rumor of Qualcomm to buy Nokia?",
        "created_utc": 1591212435,
        "id": "fss2kfc",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fss2kfc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591241235.0
    },
    {
        "author": "alwayslookingout",
        "body": "I feel you. That’s how most of us started and how we lost our money. I’ve switched over to just start buying monthlies or LEAPS. The only time that I buy weeklies anymore is when I see an unusually large volume indicating something is about to happen. Perfect example is QCOM two days ago when a 35K call volume showed up for Jun 12. I bought two and sold them when they hit 200%.",
        "created_utc": 1591215301,
        "id": "fss8rrn",
        "permalink": "/r/options/comments/gw05m9/my_timing_is_awful/fss8rrn/",
        "score": 2,
        "subreddit": "options",
        "created": 1591244101.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "The run ups QCOM has had today have been incredible",
        "created_utc": 1591205513,
        "id": "fsrnfit",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsrnfit/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591234313.0
    },
    {
        "author": "terpythrowaway",
        "body": "I don’t have the buying power rn but hottest option is QCOM 90c for 6/12",
        "created_utc": 1591199324,
        "id": "fsra8hb",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsra8hb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591228124.0
    },
    {
        "author": "tinderdrunkman101",
        "body": "Alright stupid question time, Im holding QCOM calls right now, but they have dividends payout tmmrw, the stock is ripping for the day and I am debating whenever to close out and take profits end of day, do dividends usually impact the stock price negatively?",
        "created_utc": 1591124379,
        "id": "fsnx8cx",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnx8cx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591153179.0
    },
    {
        "author": "WhoWasBlowjob",
        "body": "Alright, last question, CRWD, WORK, or QCOM, for a 6/5 expiry yolo, I need your help, please, I'm just a poor man trying to make it.",
        "created_utc": 1591125135,
        "id": "fsnyu9c",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnyu9c/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591153935.0
    },
    {
        "author": "TummyAcheJake",
        "body": "My QCOM 85c 6/12’s started rocketing out of nowhere.",
        "created_utc": 1591126833,
        "id": "fso2gdq",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso2gdq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591155633.0
    },
    {
        "author": "Krusher4Lyfe",
        "body": "Not OP, but I’ve never gotten a payout from such low IV. ORCL and CRWD (I think) got me in the past for decent losses. \n\nI bought one of the QCOM options immediately and then sold it like ten minutes later for ten bucks more. \n\n5.00 in two weeks is a huge move for that stock.\n\nIMO you’d do better selling credit spreads if you want to take advantage of that 85c",
        "created_utc": 1591052491,
        "id": "fskrg45",
        "permalink": "/r/options/comments/gutfzh/unusual_option_activity_for_60120/fskrg45/",
        "score": 2,
        "subreddit": "options",
        "created": 1591081291.0
    },
    {
        "author": "sylphvanas",
        "body": "Fml, why did I sell my QCOM calls???",
        "created_utc": 1591126625,
        "id": "fso20bq",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso20bq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591155425.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "QCOM is going to have another huge run up tomorrow, get in while you can",
        "created_utc": 1591153763,
        "id": "fsphoqi",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsphoqi/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591182563.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "I made back everything threefold on QCOM though. Got really lucky on that",
        "created_utc": 1591153291,
        "id": "fspgvuw",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fspgvuw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591182091.0
    },
    {
        "author": "Staffordv15",
        "body": "Bought qcom calls at 2 yesterday for an easy flip but I shouldve held them lowkey",
        "created_utc": 1591164591,
        "id": "fspxl7v",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fspxl7v/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591193391.0
    },
    {
        "author": "60-Sixty",
        "body": "Anything with QCOM calls? Wondering if I should sell",
        "created_utc": 1591206524,
        "id": "fsrpn5o",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsrpn5o/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591235324.0
    },
    {
        "author": "BuyMyPuts",
        "body": "You probably should have closed 5 minutes before close but maybe QCOM rockets tomorrow and also has high IV, resulting in you making even more money.  I'll discuss my trade and perhaps my thought process will help you, but keep in mind what I did may not yield the highest profit (i.e., you might make more by holding).\n\nI bought 1 QCOM 12 JUN 20 85c at 0.52 at 11:40 am ET ([proof](https://imgur.com/a/voVXNSz), the times in the trade here are Pacific but I use Eastern in the post so people don't get confused) and closed at 3:55 pm ET at 1.87.  In light of the other activity in the option chain, I was confident that this unusual option activity (UOA) was not an arbitrage play (e.g., conversion or reverse conversion).  That said, the UOA volume on calls doesn't tell you if the \"smart\" money was short or long in the position (i.e., in the 22,000 that resulted from the 35,000 volume yesterday, how many of those 22,000 contracts is the smart money long or short on, it's one or the other).  I did not look at the history to see the skew between calls and puts, but perhaps selling calls might have netted more premium in the event of a decline in QCOM (e.g., instead of buying puts at a higher premium and profiting when the stock declines, maybe they were looking to sell a call at, say, 0.50 and with a market decline, buy to close their calls at, say, 0.25).  But I ultimately concluded that the smart money being short on the calls was highly unlikely in light the QCOM's presence in the 5G arena and then some; and, therefore, I was fairly confident that the smart money was bullish on QCOM and therefore long on all of these calls.  How confident?  1 contract worth, lol...but this more or less stems from me selecting--in a testing type way--UOA to participate in and gauge my analysis of the UOA.  I want to see if I am analyzing things correctly before I go to 5 or 10 contracts.\n\nWith such large activity on the call side, the market maker who is short all of these calls is in a risky situation since they are short \\~22,000 calls at this strike price alone (remember, other UOA was present on calls at other strike prices).  That means the market maker may, but not necessarily, start buying stock to hedge its position against these short calls.  Why does this matter?  If the market maker chooses to hedge, this can cause a rally because the market maker is buying TONS of stock.  Perhaps that's what happened today, or maybe the market maker didn't hedge and the rally is attributable to something else.  To me, it seems like the market maker hedged by buying shares because of the absolutely staggering increase in volume on the stock (not the option) starting at around 2:40 pm.  Who knows, maybe this volume wasn't the market maker.  I welcome any thoughts on my analysis.\n\nNow, why did I close at 3:55 pm?  I looked at one thing (because the position was already doing very well):  The volume on the 12 JUN 20 85c at the time.  It was around 20,000-21,000 (I don't remember exactly).  I interpreted this to mean that the smart money had closed most, if not all, of their long calls.  We'll find out tomorrow morning when we look at OI.  [Here](https://imgur.com/a/Pkd9wly) is a picture of the option chain after close (it shows OI and volume).  I'm guessing the OI will be around 5,000 or less.  If the smart money is closing, I wanted to follow suit and so I did.  Why does it matter?  If the rally was indeed a result of the market maker hedging its position on all of the short calls it held, then after it's need for the hedge disappears, so too does its need for the shares and a sell off by the market maker can (but not necessarily) occur.  [Here](https://imgur.com/a/viVMkyu) is a picture of the afternoon rally.  I got one of the highest prices when I closed.  Within the last 5 minutes after I closed my position, the premium dropped to around 1.70.  You can see the last trade in the option chain picture is 1.71.\n\nHope all of this helps.  Again, I welcome anyone's feedback on my analysis!  And who knows, maybe I missed out on profits by closing at 3:55pm.  Time will tell.  Regardless, I am very happy with this trade.  Good luck to you all!\n\nEdit:  Another possible scenario I thought of is the smart money wanting to enter a large position in the underlying in a short period of time and so to offset the increased cost of the shares they buy in a vast quantity, they buy calls beforehand to reduce their basis in the stock by selling the calls after their entry causes a rally.",
        "created_utc": 1591139483,
        "id": "fsosgvb",
        "permalink": "/r/options/comments/gus2no/qcom_whats_happening/fsosgvb/",
        "score": 2,
        "subreddit": "options",
        "created": 1591168283.0
    },
    {
        "author": "aptway",
        "body": "QCOM run baby run",
        "created_utc": 1591127098,
        "id": "fso30wp",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso30wp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591155898.0
    },
    {
        "author": "Hehirn",
        "body": "Qualcomm I feel will explode. Even more so. Just out of my realm right now",
        "created_utc": 1591064852,
        "id": "fsldq0b",
        "permalink": "/r/RobinHoodPennyStocks/comments/guq3ce/nok_will_be_leaving_the_station/fsldq0b/",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1591093652.0
    },
    {
        "author": "BakedForskin",
        "body": "If Qualcomm doesn’t drop in the morning I’m fucked with my puts and I’ll probably have to apply for a job. Ew",
        "created_utc": 1591139153,
        "id": "fsorw9m",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsorw9m/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591167953.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "QCOM baby",
        "created_utc": 1591125698,
        "id": "fso00pq",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso00pq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591154498.0
    },
    {
        "author": "Gingerescapeplan",
        "body": "QCOM! Unusual options activity paying off again",
        "created_utc": 1591127451,
        "id": "fso3ryw",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso3ryw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591156251.0
    },
    {
        "author": "oughmoment",
        "body": "QCOM 87 tomorrow pls",
        "created_utc": 1591129649,
        "id": "fso8jmz",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fso8jmz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591158449.0
    },
    {
        "author": "GrandArchitect",
        "body": "&gt;QCOM\n\nWell, this is a solid tech company.  Looks like the action lately has been a lot of consolidation. Its trading at 54 RSI.  \n\nEarnings are July 24th.\n\nIt seems like a great play tbh",
        "created_utc": 1591055637,
        "id": "fskx9u4",
        "permalink": "/r/options/comments/gus2no/qcom_whats_happening/fskx9u4/",
        "score": 2,
        "subreddit": "options",
        "created": 1591084437.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "Guys look at QCOM",
        "created_utc": 1591124987,
        "id": "fsnyj0n",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnyj0n/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591153787.0
    },
    {
        "author": "Cryonyx",
        "body": "If yall can meme QCOM back into the 90s for me I would make back like 4k that I lost",
        "created_utc": 1591127065,
        "id": "fso2ybj",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso2ybj/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591155865.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "I made so much on QCOM today holy shit",
        "created_utc": 1591128122,
        "id": "fso59ik",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso59ik/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591156922.0
    },
    {
        "author": "Xbsnguy",
        "body": "QCOM is basically an auto buy when it bounces between 78-79.",
        "created_utc": 1591129477,
        "id": "fso86kr",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso86kr/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591158277.0
    },
    {
        "author": "oughmoment",
        "body": "What do y’all think about QCOM tomorrow",
        "created_utc": 1591167147,
        "id": "fsq0rgp",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsq0rgp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591195947.0
    },
    {
        "author": "high4days420",
        "body": "So many i can’t even really name em all. Facebook square earnings. PayPal earnings. Activision earnings. AAXN. Spy 310c. MVRL. CSOD. INO. Qcom. Bud. List goes on",
        "created_utc": 1591203400,
        "id": "fsriv6t",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsriv6t/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591232200.0
    },
    {
        "author": "high4days420",
        "body": "Qcom 90 6/12. MVRL. Disney. Penn. Work. Cldr. Ko bud. Lvgo. Luv. Orcl. Chef. Eri activision. Mgm. Fedex. Csod. Think i got em all.",
        "created_utc": 1591204020,
        "id": "fsrk6x7",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsrk6x7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591232820.0
    },
    {
        "author": "somanychins",
        "body": "I think you have your dates wrong. Shareholders as of June 4 are eligible to receive the divident on June 25. On June 25 you should expect it to dump by $0.65. This was announced in April, so I don't think it would cause a run up in share price now.\n\n[https://investor.qualcomm.com/news-events/press-releases/detail/1276/qualcomm-announces-quarterly-cash-dividend](https://investor.qualcomm.com/news-events/press-releases/detail/1276/qualcomm-announces-quarterly-cash-dividend)",
        "created_utc": 1591138490,
        "id": "fsoqmrj",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsoqmrj/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591167290.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "ERI and QCOM are making me so happy today",
        "created_utc": 1591197459,
        "id": "fsr6a0f",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsr6a0f/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591226259.0
    },
    {
        "author": "LinkFrost",
        "body": "Came here to say this. \n\nI don’t think GLW is going to be replacing windows broken from riots. \n\nI do think smartphone components are undervalued though. Looking at QCOM and other Apple suppliers lagging behind Apple’s recovery, might be able to do the same with GLW. \n\nGLW seems to have buyers at 22.50, I’d definitely buy if GLW dropped to somewhere between $20-22, within the next week, and ride the pre earnings surge for a maybe 5-10% profit, but it seems to be closely linked to consumer discretionary so keep an eye out for that",
        "created_utc": 1591026100,
        "id": "fsj9xwg",
        "permalink": "/r/wallstreetbets/comments/guhwdr/looks_like_i_wasnt_the_first_retard/fsj9xwg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591054900.0
    },
    {
        "author": "cranial_pudding",
        "body": "Did they talk about QCOM on Cramer or some shit\n\nWhats up with the ridiculous volume on 85c 6/12, I can't find any news and have been waiting all morning",
        "created_utc": 1591026270,
        "id": "fsja9q3",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsja9q3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055070.0
    },
    {
        "author": "brownbrandon",
        "body": "Anyone else playing QCOM?",
        "created_utc": 1591040211,
        "id": "fsk2vrv",
        "permalink": "/r/wallstreetbets/comments/guoxyq/daily_discussion_thread_for_june_1_2020/fsk2vrv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591069011.0
    },
    {
        "author": "light5577",
        "body": "OP what do you think about QCOM (showed up on unusual options activity with high ratio of open interest / volume)",
        "created_utc": 1591051121,
        "id": "fskoutd",
        "permalink": "/r/options/comments/gutfzh/unusual_option_activity_for_60120/fskoutd/",
        "score": 1,
        "subreddit": "options",
        "created": 1591079921.0
    },
    {
        "author": "solidmussel",
        "body": "So when that happens,  doesnt that just make premiums go up for the same position?\n\nSeems safer to just buy shares or sell the option\n\nInteresting nonetheless. Qcom hasnt seemed too volatile lately",
        "created_utc": 1591069405,
        "id": "fsllcaa",
        "permalink": "/r/options/comments/gus2no/qcom_whats_happening/fsllcaa/",
        "score": 1,
        "subreddit": "options",
        "created": 1591098205.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  2nd of June\n\n\n\n## Upcoming events for Tuesday, June  2nd\n\n - Stock splits:\n\n    - LPI @ **1:20**\n    - VHI @ **1:12**\n\n - Expected earnings:\n\n  AMBA, AMSC, APPS, BBW, BZUN, CBRL, CRDF, CRWD, DCI, DKS, ENT, EVRI, GRPN, HCR, HQY, HUD, IOTS, JT, LEJU, MDLA, PKX, RGS, RLMD, ROSE, TIF, TISI, TUES, WEI, WUBA, ZM\n\n - Ex-div:\n\n  AAON, AROW, AVT, AVY, BBD, BBDO, GHL, HAL, KRNY, LIN, NNA, NPO, ODFL, OPOF, OTTW, PAHC, PEBK, PJT, SLB, UG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 8.700M)\n    - ISM NY Business Conditions (previous: 4.3%)\n    - ISM-New York Index (previous: 826.5)\n    - Redbook (previous: -1.5%)\n    - Redbook (previous: -5.5%)\n    - Total Vehicle Sales (previous: 8.60M)\n\n## Upcoming events for Wednesday, June  3rd\n\n - Expected earnings:\n\n  AEO, AFMD, ALOT, BWAY, CHNG, CLDR, CMTL, CNK, CORR, CPB, CPRI, CTXR, CZZ, DLPN, ESTC, EXPR, EYES, FOSL, GEF, GOOS, GWRE, HALL, HEPA, HTHT, JAX, LMB, MBOT, MCF, MOGO, PBIO, PXS, QMCO, SBSW, SMAR, TENX, TLYS, UNFI, VOLT, VRA, VRNT, WTI, YJ, ZUO\n\n - Ex-div:\n\n  CEO, FRO, HD, HVT, HVT.A, MBCN, MOS, NEM, NLSN, PTEN, QCOM, RMBI, SSTK, SU\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -9,000K, previous: -20,236K)\n    - Crude Oil Imports (previous: 2.066M)\n    - Crude Oil Inventories (consensus: 3.300M, previous: 7.928M)\n    - Cushing Crude Oil Inventories (previous: -3.395M)\n    - Distillate Fuel Production (previous: -0.024M)\n    - Durables Excluding Defense (previous: -16.2%)\n    - EIA Refinery Crude Runs  (previous: 0.088M)\n    - EIA Weekly Distillates Stocks (consensus: 3.025M, previous: 5.494M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.9%, previous: 1.9%)\n    - Factory Orders (consensus: -14.0%, previous: -10.4%)\n    - Factory orders ex transportation (previous: -3.7%)\n    - Gasoline Inventories (consensus: 1.350M, previous: -0.724M)\n    - Gasoline Production (previous: 0.005M)\n    - Heating Oil Stockpiles (previous: 0.107M)\n    - ISM Non-Manufacturing Business Activity (consensus: 34.0, previous: 26.0)\n    - ISM Non-Manufacturing Employment (previous: 30.0)\n    - ISM Non-Manufacturing New Orders (previous: 32.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 41.8)\n    - ISM Non-Manufacturing Prices (previous: 55.1)\n    - MBA 30-Year Mortgage Rate (previous: 3.42%)\n    - MBA Mortgage Applications (previous: 2.7%)\n    - Markit Composite PMI (consensus: 36.4, previous: 27.0)\n    - Mortgage Market Index (previous: 746.5)\n    - Seevol Cushing Storage Report (previous: -4.261M)\n    - Services PMI (consensus: 36.9, previous: 26.7)\n\n## Upcoming events for Thursday, June  4th\n\n - Expected earnings:\n\n  AINC, AMC, AVGO, BAK, BITA, BMA, BVXV, CAAS, CAL, CARE, CCEP, CIEN, CLUB, CMD, COO, CRC, CVIA, DBI, DLNG, DLTH, DOCU, DOMO, FLR, FUV, GES, GGAL, GHG, GIII, GPS, HBB, HOME, INWK, IRCP, JILL, KLXE, LLEX, LX, MARK, MDB, MIK, MMYT, MOV, MTN, NAV, NGG, NX, OESX, PD, PRTY, RRGB, RTIX, SAIC, SCWX, SFUN, SJM, SPWH, TNP, TTC, UFAB, VJET, WORK, WPRT, XBIT, XELA, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AIN, AJG, AL, AMNB, ANAT, BAC, BAX, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CDK, CERN, CHRW, CTXS, D, ESBK, FFNW, FLO, FRME, GARS, GOLF, GPC, HLI, HWC, HWKN, ICBK, INT, KFRC, KMB, KNX, LCII, MANT, MBWM, MLI, NAVI, NVDA, ORI, PBIP, PCH, PEP, PII, RF, SEE, SLM, SNR, SQM, TGNA, TILE, TRST, TT, UFCS, WM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.130%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Challenger Job Cuts (previous: 1,576.9%)\n    - Challenger Job Cuts (previous: 671.129K)\n    - Continuing Jobless Claims (consensus: 20,100K, previous: 21,052K)\n    - Exports (previous: 187.80B)\n    - Imports (previous: 232.20B)\n    - Initial Jobless Claims (consensus: 1,800K, previous: 2,123K)\n    - Jobless Claims 4-Week Avg. (previous: 2,608.00K)\n    - Natural Gas Storage (consensus: 107B, previous: 109B)\n    - Nonfarm Productivity (consensus: -2.6%, previous: -2.5%)\n    - Trade Balance (consensus: -49.00B, previous: -44.40B)\n    - Unit Labor Costs (consensus: 5.0%, previous: 4.8%)\n\n## Upcoming events for Friday, June  5th\n\n - Expected earnings:\n\n  ATNM, CONN, GVA, IMVT, TPCO, TRCH, UBA, UTSI\n\n - Ex-div:\n\n  AFIN, BF.A, BF.B, CCBG, FAF, GAIN, INSW, KSU, MLR, MNRO, NSP, ORAN, SVBI, UNF, WRI\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 8.6%, previous: 7.9%)\n    - Average Hourly Earnings (consensus: 1.0%, previous: 4.7%)\n    - Average Weekly Hours (consensus: 34.3, previous: 34.2)\n    - CFTC Aluminium speculative net positions (previous: 72.6K)\n    - CFTC Copper speculative net positions (previous: -13.4K)\n    - CFTC Corn speculative net positions (previous: -199.0K)\n    - CFTC Crude Oil speculative net positions (previous: 543.6K)\n    - CFTC Gold speculative net positions (previous: 251.8K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.0K)\n    - CFTC Natural Gas speculative net positions (previous: -61.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -236.3K)\n    - CFTC Silver speculative net positions (previous: 30.9K)\n    - CFTC Soybeans speculative net positions (previous: 87.6K)\n    - CFTC Wheat speculative net positions (previous: -9.9K)\n    - Consumer Credit (consensus: -20.00B, previous: -12.04B)\n    - Government Payrolls (previous: -980.0K)\n    - Manufacturing Payrolls (consensus: -400K, previous: -1,330K)\n    - Nonfarm Payrolls (consensus: -8,000K, previous: -20,500K)\n    - Participation Rate (previous: 60.2%)\n    - Private Nonfarm Payrolls (consensus: -7,750K, previous: -19,520K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 222)\n    - U.S. Baker Hughes Total Rig Count (previous: 301)\n    - U6 Unemployment Rate (previous: 22.8%)\n    - Unemployment Rate (consensus: 19.7%, previous: 14.7%)\n\n^^^^2020-06-02",
        "created_utc": 1591092019,
        "id": "fsmdah9",
        "permalink": "/r/RobinHood/comments/gv4ib3/daily_discussion_thread_june_2nd_2020/fsmdah9/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1591120819.0
    },
    {
        "author": "cranial_pudding",
        "body": "The only play I made today was QCOM 85c 6/12 because of the stupid retarded volume and I felt like I could ride some kind of wave \n\nShits fucked up yo, I'm too scared to plan my plays a day in advance\n\nedit: I lied I also bought PEP 136c 6/12 and 6/19 too",
        "created_utc": 1591047485,
        "id": "fskhrxk",
        "permalink": "/r/wallstreetbets/comments/gurxgt/what_are_your_moves_tomorrow_june_02_2020/fskhrxk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591076285.0
    },
    {
        "author": "cranial_pudding",
        "body": "Volume on QCOM 85c 6/12 just went from 16k to 22k in less than 10 minutes lmao",
        "created_utc": 1591023962,
        "id": "fsj64h0",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsj64h0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591052762.0
    },
    {
        "author": "zemunsquare",
        "body": "Did anyone make a bunch of money on QCOM? I’ve seen a few people post about it here",
        "created_utc": 1591134241,
        "id": "fsoi5se",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsoi5se/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591163041.0
    },
    {
        "author": "turtlejizzus",
        "body": "Does anyone know what happened to Qcom? It gapped up in the last few minutes.",
        "created_utc": 1591137986,
        "id": "fsopnb5",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsopnb5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591166786.0
    },
    {
        "author": "Rhaximus",
        "body": "QCOM has a dividend tomorrow. Holding overnight is insanely risky.",
        "created_utc": 1591127110,
        "id": "fso31ru",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso31ru/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591155910.0
    },
    {
        "author": "Equivalent_Mongoose",
        "body": "AVGO, SNPS, QCOM, CLDR , LULU, CHWY",
        "created_utc": 1591187138,
        "id": "fsqnjix",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsqnjix/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591215938.0
    },
    {
        "author": "terpythrowaway",
        "body": "Long QCOM? The bump was for dividend yesterday",
        "created_utc": 1591187346,
        "id": "fsqnu2p",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsqnu2p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591216146.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of June\n\n\n\n## Upcoming events for Wednesday, June  3rd\n\n - Expected earnings:\n\n  AEO, AFMD, ALOT, BWAY, CHNG, CLDR, CMTL, CNK, CORR, CPB, CPRI, CTXR, CZZ, DLPN, ESTC, EXPR, EYES, FOSL, GEF, GOOS, GWRE, HALL, HEPA, HTHT, JAX, LMB, MBOT, MCF, MOGO, PBIO, PXS, QMCO, SBSW, SMAR, TENX, TLYS, VOLT, VRA, WTI, YJ, ZUO\n\n - Ex-div:\n\n  CEO, FRO, HD, HVT, HVT.A, MBCN, MOS, NEM, NLSN, PTEN, QCOM, RMBI, SSTK, SU\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -9,000K, previous: -20,236K)\n    - Crude Oil Imports (previous: 2.066M)\n    - Crude Oil Inventories (consensus: 3.038M, previous: 7.928M)\n    - Cushing Crude Oil Inventories (previous: -3.395M)\n    - Distillate Fuel Production (previous: -0.024M)\n    - Durables Excluding Defense (previous: -16.2%)\n    - EIA Refinery Crude Runs  (previous: 0.088M)\n    - EIA Weekly Distillates Stocks (consensus: 2.686M, previous: 5.494M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.0%, previous: 1.9%)\n    - Factory Orders (consensus: -14.0%, previous: -10.4%)\n    - Factory orders ex transportation (previous: -3.7%)\n    - Gasoline Inventories (consensus: 1.000M, previous: -0.724M)\n    - Gasoline Production (previous: 0.005M)\n    - Heating Oil Stockpiles (previous: 0.107M)\n    - ISM Non-Manufacturing Business Activity (consensus: 34.0, previous: 26.0)\n    - ISM Non-Manufacturing Employment (previous: 30.0)\n    - ISM Non-Manufacturing New Orders (previous: 32.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 41.8)\n    - ISM Non-Manufacturing Prices (previous: 55.1)\n    - MBA 30-Year Mortgage Rate (actual: 3.37%, previous: 3.42%)\n    - MBA Mortgage Applications (actual: -3.9%, previous: 2.7%)\n    - MBA Purchase Index (actual: 296.0, previous: 281.2)\n    - Markit Composite PMI (consensus: 36.4, previous: 27.0)\n    - Mortgage Market Index (actual: 717.7, previous: 746.5)\n    - Mortgage Refinance Index (actual: 3,166.7, previous: 3,466.2)\n    - Seevol Cushing Storage Report (previous: -4.261M)\n    - Services PMI (consensus: 36.9, previous: 26.7)\n\n## Upcoming events for Thursday, June  4th\n\n - Expected earnings:\n\n  AINC, AMC, AVGO, BAK, BITA, BMA, BVXV, CAAS, CAL, CARE, CCEP, CIEN, CLUB, CMD, COO, CRC, CVIA, DBI, DLNG, DLTH, DOCU, DOMO, FLR, FUV, GES, GGAL, GHG, GIII, GPS, HBB, HOME, INWK, IRCP, JILL, KLXE, LLEX, LX, MARK, MDB, MIK, MMYT, MOV, MTN, NAV, NGG, NX, OESX, PD, PRTY, RRGB, RTIX, SAIC, SCWX, SFUN, SJM, SPWH, TNP, TTC, UFAB, VJET, WORK, WPRT, XBIT, XELA, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AIN, AJG, AL, AMNB, ANAT, BAC, BAX, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CDK, CERN, CHRW, CTXS, D, ESBK, FFNW, FLO, FRME, GARS, GOLF, GPC, HLI, HWC, HWKN, ICBK, INT, KFRC, KMB, KNX, LCII, MANT, MBWM, MLI, NAVI, NVDA, ORI, PBIP, PCH, PEP, PII, RF, SEE, SLM, SNR, SQM, TGNA, TILE, TRST, TT, UFCS, WM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.130%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Challenger Job Cuts (previous: 1,576.9%)\n    - Challenger Job Cuts (previous: 671.129K)\n    - Continuing Jobless Claims (consensus: 20,050K, previous: 21,052K)\n    - Exports (previous: 187.80B)\n    - Imports (previous: 232.20B)\n    - Initial Jobless Claims (consensus: 1,800K, previous: 2,123K)\n    - Jobless Claims 4-Week Avg. (previous: 2,608.00K)\n    - Natural Gas Storage (consensus: 107B, previous: 109B)\n    - Nonfarm Productivity (consensus: -2.7%, previous: -2.5%)\n    - Trade Balance (consensus: -49.00B, previous: -44.40B)\n    - Unit Labor Costs (consensus: 5.0%, previous: 4.8%)\n\n## Upcoming events for Friday, June  5th\n\n - Expected earnings:\n\n  ATNM, GVA, IMVT, TPCO, TRCH, UBA, UTSI\n\n - Ex-div:\n\n  AFIN, BF.A, BF.B, CCBG, FAF, GAIN, INSW, KSU, LYB, MLR, MNE, MNRO, NSP, ORAN, SVBI, UNF, WRI\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 8.5%, previous: 7.9%)\n    - Average Hourly Earnings (consensus: 1.0%, previous: 4.7%)\n    - Average Weekly Hours (consensus: 34.3, previous: 34.2)\n    - CFTC Aluminium speculative net positions (previous: 72.6K)\n    - CFTC Copper speculative net positions (previous: -13.4K)\n    - CFTC Corn speculative net positions (previous: -199.0K)\n    - CFTC Crude Oil speculative net positions (previous: 543.6K)\n    - CFTC Gold speculative net positions (previous: 251.8K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.0K)\n    - CFTC Natural Gas speculative net positions (previous: -61.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -236.3K)\n    - CFTC Silver speculative net positions (previous: 30.9K)\n    - CFTC Soybeans speculative net positions (previous: 87.6K)\n    - CFTC Wheat speculative net positions (previous: -9.9K)\n    - Consumer Credit (consensus: -20.00B, previous: -12.04B)\n    - Government Payrolls (previous: -980.0K)\n    - Manufacturing Payrolls (consensus: -440K, previous: -1,330K)\n    - Nonfarm Payrolls (consensus: -8,000K, previous: -20,537K)\n    - Participation Rate (previous: 60.2%)\n    - Private Nonfarm Payrolls (consensus: -7,500K, previous: -19,557K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 222)\n    - U.S. Baker Hughes Total Rig Count (previous: 301)\n    - U6 Unemployment Rate (previous: 22.8%)\n    - Unemployment Rate (consensus: 19.8%, previous: 14.7%)\n\n^^^^2020-06-03",
        "created_utc": 1591189910,
        "id": "fsqrukj",
        "permalink": "/r/RobinHood/comments/gvtoib/daily_discussion_thread_june_3rd_2020/fsqrukj/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1591218710.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "QCOM TAKING OFFF",
        "created_utc": 1591191095,
        "id": "fsqtwbd",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsqtwbd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591219895.0
    },
    {
        "author": "Cryonyx",
        "body": "QCOM tried to keep it going for a minute there",
        "created_utc": 1591191975,
        "id": "fsqvhx5",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsqvhx5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591220775.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "Damn QCOM you were fun while you lasted",
        "created_utc": 1591192423,
        "id": "fsqwbnr",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsqwbnr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591221223.0
    },
    {
        "author": "Pr333n",
        "body": "Stay down $QCOM",
        "created_utc": 1591201078,
        "id": "fsrdy1y",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsrdy1y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591229878.0
    },
    {
        "author": "oughmoment",
        "body": "Anyone holding QCOM \n\nHoping it goes to 86 so I can get rid of these calls",
        "created_utc": 1591146337,
        "id": "fsp4s1b",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsp4s1b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591175137.0
    },
    {
        "author": "BakedForskin",
        "body": "It’s ok today I bought 10 calls on Qualcomm after it shooting straight up instead of puts I was like wtf is this. Lol",
        "created_utc": 1591147643,
        "id": "fsp72uv",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsp72uv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591176443.0
    },
    {
        "author": "Goldrushef",
        "body": "Other 5G share to keep an eye on:\n\nCiena\nIntel\nLumentum\nAmerican tower\nCrown castle\nQualcomm\nTexas Instruments",
        "created_utc": 1591207236,
        "id": "fsrr7t2",
        "permalink": "/r/stocks/comments/gvvthm/planning_to_enter_the_5_g_race/fsrr7t2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591236036.0
    },
    {
        "author": "terpythrowaway",
        "body": "qualcomm puts should be free money, right? ex-dividend date is tomorrow and thats going to lead to a selloff",
        "created_utc": 1591154987,
        "id": "fspjpwd",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fspjpwd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591183787.0
    },
    {
        "author": "bshaman1993",
        "body": "Any idea what was up with QCOM?",
        "created_utc": 1591129814,
        "id": "fso8w38",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fso8w38/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591158614.0
    },
    {
        "author": "itsdrivingmenuts",
        "body": "qcom with interesting activity might be buying calls",
        "created_utc": 1591153409,
        "id": "fsph37v",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsph37v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591182209.0
    },
    {
        "author": "mycduck",
        "body": "The year is 2020 and NOK and QCOM are hot meme tech stocks!",
        "created_utc": 1591153911,
        "id": "fsphxps",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsphxps/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591182711.0
    },
    {
        "author": "oughmoment",
        "body": "Thoughts on qcom for tomorrow?",
        "created_utc": 1591130296,
        "id": "fso9wzg",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fso9wzg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591159096.0
    },
    {
        "author": "terpythrowaway",
        "body": "qualcomm 85c",
        "created_utc": 1591125846,
        "id": "fso0c2t",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso0c2t/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591154646.0
    },
    {
        "author": "bbq-ribs",
        "body": "&gt; QCOM\n\n\n\n5G hype!!!",
        "created_utc": 1591125149,
        "id": "fsnyvd0",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnyvd0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591153949.0
    },
    {
        "author": "Exeggutemoon",
        "body": "Up 66% on QCOM calls - you guys holding or going cash?",
        "created_utc": 1591125546,
        "id": "fsnzpdo",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnzpdo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591154346.0
    },
    {
        "author": "terpythrowaway",
        "body": "GET IN QUALCOMM QUICK",
        "created_utc": 1591127049,
        "id": "fso2x1p",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso2x1p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591155849.0
    },
    {
        "author": "brownbrandon",
        "body": "Lots of red smh\n\nDKNG 45c 6/5\n\nQCOM 85c 6/5\n\nTAK 20c 6/19",
        "created_utc": 1591108071,
        "id": "fsmzcz8",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsmzcz8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591136871.0
    },
    {
        "author": "Jetisfly420",
        "body": "Anyone know why QCOM is mooning",
        "created_utc": 1591125039,
        "id": "fsnymxc",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnymxc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591153839.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "Do 6/12 QCOM",
        "created_utc": 1591125173,
        "id": "fsnyx6a",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnyx6a/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591153973.0
    },
    {
        "author": "Equivalent_Mongoose",
        "body": "Thank god I got into QCOM this morning",
        "created_utc": 1591125056,
        "id": "fsnyo6t",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnyo6t/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591153856.0
    },
    {
        "author": "godisdildo",
        "body": "I just picked a few P/Es below.\n\nApple 24\nAdobe 58\nActivision blizzard 36\nAMD 130\nAlphabet 28\nAlteryx 1,300\nMicrosoft 30\nNvidia 64\nAmazon 117\nAlibaba 43\nFacebook 26\nIllumina 57\nQualcomm 22\n\nSome of these figures are crazy, but most aren’t. This is just nowhere near the dot com bubble.\n\nAnd second, even when the ratio starts to reverse, how can we know if growth is not better off anyway taking peaks and valleys into account?",
        "created_utc": 1591129318,
        "id": "fso7uc4",
        "permalink": "/r/ValueInvesting/comments/gvc1wb/buffetgraham_maxims_out_of_date/fso7uc4/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1591158118.0
    },
    {
        "author": "shotclckcheese_7",
        "body": "What y’all think about QCOM calls tomorrow?",
        "created_utc": 1591164353,
        "id": "fspxajh",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fspxajh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591193153.0
    },
    {
        "author": "Homiz88",
        "body": "Qualcomm",
        "created_utc": 1591194234,
        "id": "fsqzrvo",
        "permalink": "/r/stocks/comments/gvuu6l/buy_into_the_5g_hype/fsqzrvo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591223034.0
    },
    {
        "author": "codingprofessor",
        "body": "\nAs an engineer I implore that you take a look into Cloudflare Workers and Fastlys media optimizations. You have organizations like Reddit using Fastly because the companies are supermassive and can't always commit the same concentrations to processing or security like smaller, lazer focused, mature startups. Fastly and Cloudflare aren't startups anymore - they are pioneers in the modern CDN market where a CDN service is built around specific optimizations. In the case of Cloudflare - it's security. In the case of Reese's, it was peanut butter.\n\n\n\nCloudflare Workers is impressive because it compiles down to web assembly when you're computing requests at the network level.\n\n\nThe point of the thesis is that the demand for all CDN and cloud *infrastructure* has accelerated. The inherent value of the product is evident in Akamais long term survival.\n\n\nLyft, Facebook, Shopify, Stackoverflow, NPM and hospitals are all market mover enterprises that use Cloudflare.  We use Cloudflare at my job for error logging and speed performances (fintech)\n\n\nSeries D invested by Google, Microsoft, Baidu, and Qualcomm:\n\n\n\"So lastly, I wanted to talk about some of our customer wins for the quarter. We had some incredible wins, like a credit reporting service that signed a three-year deal worth $800,000 per year; a major gaming platform with a deal worth over $1 million per year; a reinsurance provider who will pay us $750,000 over three years to protect their network; and a U.S. government agency using a broad set of our platform's features to secure nuclear research for over $150,000 per year. But let me focus on some customers that are uniquely relevant to this moment.\n\nA company, many of us are relying on to deliver food to our homes while we shelter in place signed a deal for over $600,000 per year in January. In March, their demand was up so much, they increased their deal by more than $500,000 per year. One of their goals was to ensure that they could decrease their dependency on Amazon Web Services. They found Cloudflare was not only faster and more robust but also significantly more cost effective.\n\nOne of the largest telemedicine providers in the United States turned to Cloudflare as the crisis set in. They had to shift the majority of their physicians from clinics where they had legacy on-premise security hardware to their homes where, obviously, they did not. As a highly regulated industry, security of patient information is critical. They onboarded their physicians onto Cloudflare for Teams so they could keep serving patients.\n\n...\n\nAnd JD Cloud really fit that bill incredibly well. And so we signed an agreement with them. It's going to take us a little bit of time for us to get that online, but I'm incredibly excited about it. We're adding 50 new cities per year to a total of 150 PoPs across China that will augment the existing network that we have with Baidu\"",
        "created_utc": 1591200365,
        "id": "fsrcg4u",
        "permalink": "/r/wallstreetbets/comments/gvo3ph/cloudflare_and_cloudflaretv_a_visual_guide_to/fsrcg4u/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591229165.0
    },
    {
        "author": "Pr333n",
        "body": "can QCOM stop fucking around and drop due to the ex-dividend date?!!!",
        "created_utc": 1591208088,
        "id": "fsrt2co",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsrt2co/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591236888.0
    },
    {
        "author": "money_kat",
        "body": "I bought a call but it's a gamble. And from what I've been reading that tends to be the case for all UOA moves.\n\nAnyway found this https://www.barrons.com/articles/qualcomm-likely-to-sell-smartphone-chips-to-huawei-analyst-says-51590681654\n\n&gt; The government recently issued new rules that will make it difficult for Huawei’s chip manufacturing arm, HiSilicon, to get access to U.S. semiconductor manufacturing hardware.\n\n&gt; Vinh argues that as a result, Huawei won’t be able to use HiSilicon to source chipsets for its cutting-edge smartphones in 2021—and that the company will instead use Qualcomm’s Snapdragon chipset in its flagship phones, the Mate 50 and P50.\n\n&gt; Qualcomm would need to apply for a license from the Commerce Department’s Bureau of Industry and Security to sell those chips to Huawei. Vinh thinks the request would be granted, and that it would be accompanied by a patent license agreement between Qualcomm and Huawei. Qualcomm for months has been trying to secure a 5G technology license agreement with Huawei, but to no avail.",
        "created_utc": 1591093740,
        "id": "fsmf2h9",
        "permalink": "/r/options/comments/gutfzh/unusual_option_activity_for_60120/fsmf2h9/",
        "score": 1,
        "subreddit": "options",
        "created": 1591122540.0
    },
    {
        "author": "m0nkWidSoda",
        "body": "QCom ex dividend is tomorrow.",
        "created_utc": 1591129802,
        "id": "fso8v7v",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fso8v7v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591158602.0
    },
    {
        "author": "isospeedrix",
        "body": "what happened to QCOM?\n\nalll i know is that it was on Unusual options activity last week so i picked a few up and paid out",
        "created_utc": 1591127397,
        "id": "fso3nul",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso3nul/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156197.0
    },
    {
        "author": "timboSlice490",
        "body": "Why is Qualcomm mooning all of a sudden?",
        "created_utc": 1591126989,
        "id": "fso2sh5",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso2sh5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591155789.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of June\n\n\n\n## Upcoming events for Monday, June  1st\n\n - Stock splits:\n\n    - EW @ **3:1** (Payable date: 05/29/2020)\n\n - Expected earnings:\n\n  ATEX, ATHM, AXAS, CANF, CSWC, ENS, ERJ, GSM, HHR, IDXG, IRS, LONE, MLAB, NAOV, NGL, OGEN, PIXY, PLX, PRCP, PSTI, PUMP, QTT, RMBL, SBT, STAF, THR, TTM, XYF\n\n - Ex-div:\n\n  AGR, BPOP, CATY, CRD.A, CRD.B, EBIX, EDUC, ESNT, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, IGD, IID, ITUB, KEY, KNSL, LHX, NEE, QIWI, RCKY, SNP, SOI, SWK, UVSP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.130%)\n    - 6-Month Bill Auction (previous: 0.160%)\n    - Construction Spending (consensus: -6.0%, previous: 0.9%)\n    - ISM Manufacturing Employment (consensus: 35.0, previous: 27.5)\n    - ISM Manufacturing New Orders Index (previous: 27.1)\n    - ISM Manufacturing PMI (consensus: 43.0, previous: 41.5)\n    - ISM Manufacturing Prices (consensus: 37.0, previous: 35.3)\n    - Investing.com Gold Index (actual: 52.4%, previous: 56.9%)\n    - Investing.com S&amp;P 500 Index (actual: 23.9%, previous: 22.3%)\n    - Manufacturing PMI (consensus: 39.8, previous: 36.1)\n\n## Upcoming events for Tuesday, June  2nd\n\n - Stock splits:\n\n    - LPI @ **1:20**\n\n - Expected earnings:\n\n  AMBA, APPS, BBW, BZUN, CBRL, CRDF, CRWD, DCI, DKS, ENT, EVRI, GME, GRPN, HCR, HQY, HUD, IOTS, JT, LEJU, MDLA, MOGO, NEXT, PKX, PXS, RGS, RLMD, ROSE, SB, SOHO, TIF, TISI, TUES, WEI, WUBA, ZM\n\n - Ex-div:\n\n  AAON, AROW, AVT, AVY, BBD, BBDO, GHL, HAL, KRNY, LIN, NNA, NPO, ODFL, OPOF, OTTW, PAHC, PEBK, PJT, SLB, UG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 8.700M)\n    - ISM NY Business Conditions (previous: 4.3%)\n    - ISM-New York Index (previous: 826.5)\n    - Redbook (previous: -1.5%)\n    - Redbook (previous: -5.5%)\n    - Total Vehicle Sales (previous: 8.60M)\n\n## Upcoming events for Wednesday, June  3rd\n\n - Expected earnings:\n\n  ABM, AEO, AKTX, ALOT, AMSC, BWAY, CHNG, CLDR, CMTL, CNK, CORR, CPB, CPRI, CTXR, CZZ, DLPN, ESTC, EXPR, EYES, FOSL, GEF, GOOS, GWRE, HALL, HEPA, JAX, LMB, MBOT, MCF, NOVN, PBIO, PVH, QES, QMCO, SBSW, SMAR, SRNE, TENX, TLYS, UNFI, VOLT, VRA, VRNT, WTI, YJ, ZUO\n\n - Ex-div:\n\n  CEO, FRO, HD, HVT, HVT.A, MBCN, MOS, NEM, NLSN, PTEN, QCOM, RMBI, SSTK, SU\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -9,000K, previous: -20,236K)\n    - Crude Oil Imports (previous: 2.066M)\n    - Crude Oil Inventories (consensus: -1.944M, previous: 7.928M)\n    - Cushing Crude Oil Inventories (previous: -3.395M)\n    - Distillate Fuel Production (previous: -0.024M)\n    - Durables Excluding Defense (previous: -16.2%)\n    - EIA Refinery Crude Runs  (previous: 0.088M)\n    - EIA Weekly Distillates Stocks (consensus: 1.771M, previous: 5.494M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.0%, previous: 1.9%)\n    - Factory Orders (consensus: -12.5%, previous: -10.4%)\n    - Factory orders ex transportation (previous: -3.7%)\n    - Gasoline Inventories (consensus: 0.100M, previous: -0.724M)\n    - Gasoline Production (previous: 0.005M)\n    - Heating Oil Stockpiles (previous: 0.107M)\n    - ISM Non-Manufacturing Business Activity (previous: 26.0)\n    - ISM Non-Manufacturing Employment (previous: 30.0)\n    - ISM Non-Manufacturing New Orders (previous: 32.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 41.8)\n    - ISM Non-Manufacturing Prices (previous: 55.1)\n    - MBA 30-Year Mortgage Rate (previous: 3.42%)\n    - MBA Mortgage Applications (previous: 2.7%)\n    - Markit Composite PMI (consensus: 36.4, previous: 27.0)\n    - Mortgage Market Index (previous: 746.5)\n    - Seevol Cushing Storage Report (previous: -4.261M)\n    - Services PMI (consensus: 36.9, previous: 26.7)\n\n## Upcoming events for Thursday, June  4th\n\n - Expected earnings:\n\n  AINC, AMC, AVGO, BAK, BITA, BMA, BVXV, CAAS, CAL, CARE, CCEP, CIEN, CLUB, CMD, COO, CRC, CVIA, DBI, DLNG, DLTH, DOCU, DOMO, FLR, FUV, GES, GGAL, GHG, GIII, GPS, HBB, HOME, INWK, IRCP, JILL, KLXE, LLEX, MARK, MDB, MIK, MMYT, MOV, MTN, NAV, NGG, NX, OESX, PD, PRTY, RRGB, RTIX, SAIC, SCWX, SEAC, SENS, SJM, SPWH, TNP, TTC, UFAB, VJET, WORK, WPRT, XBIT, XELA, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AIN, AJG, AL, AMNB, ANAT, BAC, BAX, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CDK, CERN, CHRW, CTXS, D, ESBK, FFNW, FLO, FRME, GARS, GOLF, GPC, HLI, HWC, HWKN, ICBK, INT, KFRC, KMB, KNX, LCII, MANT, MBWM, MLI, NAVI, NVDA, ORI, PBIP, PCH, PEP, PII, RF, SEE, SLM, SNR, SQM, TGNA, TILE, TRST, TT, UFCS, WM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.130%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Challenger Job Cuts (previous: 1,576.9%)\n    - Challenger Job Cuts (previous: 671.129K)\n    - Continuing Jobless Claims (consensus: 25,750K, previous: 21,052K)\n    - Exports (previous: 187.80B)\n    - Imports (previous: 232.20B)\n    - Initial Jobless Claims (consensus: 1,800K, previous: 2,123K)\n    - Jobless Claims 4-Week Avg. (previous: 2,608.00K)\n    - Natural Gas Storage (consensus: 107B, previous: 109B)\n    - Nonfarm Productivity (consensus: -2.5%, previous: -2.5%)\n    - Trade Balance (consensus: -44.30B, previous: -44.40B)\n    - Unit Labor Costs (consensus: 4.8%, previous: 4.8%)\n\n^^^^2020-06-01",
        "created_utc": 1591005619,
        "id": "fsigvgq",
        "permalink": "/r/RobinHood/comments/guhudl/daily_discussion_thread_june_1st_2020/fsigvgq/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1591034419.0
    },
    {
        "author": "wdmx",
        "body": "QCOM",
        "created_utc": 1591022197,
        "id": "fsj2xff",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsj2xff/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591050997.0
    },
    {
        "author": "cranial_pudding",
        "body": "18k volume and less than 100 OI on QCOM 85c 6/12",
        "created_utc": 1591023529,
        "id": "fsj5bpl",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsj5bpl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591052329.0
    },
    {
        "author": "jabathehut6900",
        "body": "Anyone see the volume of QCOM options for 6/12?",
        "created_utc": 1591023873,
        "id": "fsj5ykg",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsj5ykg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591052673.0
    },
    {
        "author": "slothtastic24",
        "body": "QCOM 6/12 85 has 25k volume",
        "created_utc": 1591027709,
        "id": "fsjd590",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsjd590/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591056509.0
    },
    {
        "author": "cranial_pudding",
        "body": "I think there's money to be made on INTC short term, there's some weird call activity all the way up to 70, I just wouldn't expect it to meme out like some of these other tech stocks\n\nIf you're playing in this sector right now, QCOM has some wild activity on 85c 6/12",
        "created_utc": 1591028595,
        "id": "fsjewrx",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsjewrx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591057395.0
    },
    {
        "author": "EAH5515",
        "body": "I'm investing in 5g stocks like qualcomm and version and I'm also picking up some sony and amd because sony is coming out with the ps5. AMD because they are making the processors for the PS5 and the Xbox those are most of my speculative plays but I'm also buying some dividend aristocrats like colgate palmolive because they're so stable no matter what.",
        "created_utc": 1591065478,
        "id": "fslesnl",
        "permalink": "/r/stocks/comments/gu3q71/people_who_invested_in_stocks_during_the_2008/fslesnl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591094278.0
    },
    {
        "author": "omart008",
        "body": "Anyone getting in QCOM?",
        "created_utc": 1591031013,
        "id": "fsjjsyv",
        "permalink": "/r/wallstreetbets/comments/gu5xww/what_are_your_moves_tomorrow_june_01_2020/fsjjsyv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591059813.0
    },
    {
        "author": "WhoWasBlowjob",
        "body": "if SPY moons, do my calls on retail stocks have a chance of printing bigly? I got some weird ass calls, Bank of America, Kohl's, CLDR, YEXT, QCOM.\n\nThoughts on my positions? All short term like 6/5 and 6/19, please tell me. Also, SWBI.",
        "created_utc": 1591146294,
        "id": "fsp4pb2",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsp4pb2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591175094.0
    },
    {
        "author": "Jetisfly420",
        "body": "QCOM chill daddy",
        "created_utc": 1591124448,
        "id": "fsnxdrh",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnxdrh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591153248.0
    },
    {
        "author": "JohnnyBGoodeZSS",
        "body": "Made back everything I lost with DKNG and then some with QCOM",
        "created_utc": 1591125124,
        "id": "fsnyth1",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsnyth1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591153924.0
    },
    {
        "author": "high4days420",
        "body": "Qcom can’t stop won’t stop",
        "created_utc": 1591127306,
        "id": "fso3gx6",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso3gx6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156106.0
    },
    {
        "author": "brownbrandon",
        "body": "QCOM printing",
        "created_utc": 1591127459,
        "id": "fso3slk",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso3slk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156259.0
    },
    {
        "author": "BakedForskin",
        "body": "Just bought Qualcomm puts lol",
        "created_utc": 1591127631,
        "id": "fso460r",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fso460r/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156431.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of June\n\n\n\n## Upcoming events for Monday, June  1st\n\n - Stock splits:\n\n    - EW @ **3:1** (Payable date: 05/29/2020)\n\n - Expected earnings:\n\n  ATEX, ATHM, AXAS, CANF, CSWC, ENS, ERJ, GSM, HHR, IDXG, IRS, LONE, MLAB, NAOV, NGL, OGEN, PIXY, PLX, PRCP, PSTI, PUMP, QTT, RMBL, SBT, STAF, THR, TTM, XYF\n\n - Ex-div:\n\n  AGR, BPOP, CATY, CRD.A, CRD.B, EBIX, EDUC, ESNT, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, IGD, IID, ITUB, KEY, KNSL, LHX, NEE, QIWI, RCKY, SNP, SOI, SWK, UVSP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.130%)\n    - 6-Month Bill Auction (previous: 0.160%)\n    - Construction Spending (consensus: -6.0%, previous: 0.9%)\n    - ISM Manufacturing Employment (consensus: 35.0, previous: 27.5)\n    - ISM Manufacturing New Orders Index (previous: 27.1)\n    - ISM Manufacturing PMI (consensus: 43.0, previous: 41.5)\n    - ISM Manufacturing Prices (consensus: 37.0, previous: 35.3)\n    - Investing.com Gold Index (actual: 52.4%, previous: 56.9%)\n    - Investing.com S&amp;P 500 Index (actual: 23.9%, previous: 22.3%)\n    - Manufacturing PMI (consensus: 39.8, previous: 36.1)\n\n## Upcoming events for Tuesday, June  2nd\n\n - Stock splits:\n\n    - LPI @ **1:20**\n\n - Expected earnings:\n\n  AMBA, APPS, BBW, BZUN, CBRL, CRDF, CRWD, DCI, DKS, ENT, EVRI, GME, GRPN, HCR, HQY, HUD, IOTS, JT, LEJU, MDLA, MOGO, NEXT, PKX, PXS, RGS, RLMD, ROSE, SB, SOHO, TIF, TISI, TUES, WEI, WUBA, ZM\n\n - Ex-div:\n\n  AAON, AROW, AVT, AVY, BBD, BBDO, GHL, HAL, KRNY, LIN, NNA, NPO, ODFL, OPOF, OTTW, PAHC, PEBK, PJT, SLB, UG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 8.700M)\n    - ISM NY Business Conditions (previous: 4.3%)\n    - ISM-New York Index (previous: 826.5)\n    - Redbook (previous: -1.5%)\n    - Redbook (previous: -5.5%)\n    - Total Vehicle Sales (previous: 8.60M)\n\n## Upcoming events for Wednesday, June  3rd\n\n - Expected earnings:\n\n  ABM, AEO, AKTX, ALOT, AMSC, BWAY, CHNG, CLDR, CMTL, CNK, CORR, CPB, CPRI, CTXR, CZZ, DLPN, ESTC, EXPR, EYES, FOSL, GEF, GOOS, GWRE, HALL, HEPA, JAX, LMB, MBOT, MCF, NOVN, PBIO, PVH, QES, QMCO, SBSW, SMAR, SRNE, TENX, TLYS, UNFI, VOLT, VRA, VRNT, WTI, YJ, ZUO\n\n - Ex-div:\n\n  CEO, FRO, HD, HVT, HVT.A, MBCN, MOS, NEM, NLSN, PTEN, QCOM, RMBI, SSTK, SU\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -9,000K, previous: -20,236K)\n    - Crude Oil Imports (previous: 2.066M)\n    - Crude Oil Inventories (consensus: -1.944M, previous: 7.928M)\n    - Cushing Crude Oil Inventories (previous: -3.395M)\n    - Distillate Fuel Production (previous: -0.024M)\n    - Durables Excluding Defense (previous: -16.2%)\n    - EIA Refinery Crude Runs  (previous: 0.088M)\n    - EIA Weekly Distillates Stocks (consensus: 1.771M, previous: 5.494M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.0%, previous: 1.9%)\n    - Factory Orders (consensus: -12.5%, previous: -10.4%)\n    - Factory orders ex transportation (previous: -3.7%)\n    - Gasoline Inventories (consensus: 0.100M, previous: -0.724M)\n    - Gasoline Production (previous: 0.005M)\n    - Heating Oil Stockpiles (previous: 0.107M)\n    - ISM Non-Manufacturing Business Activity (previous: 26.0)\n    - ISM Non-Manufacturing Employment (previous: 30.0)\n    - ISM Non-Manufacturing New Orders (previous: 32.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 41.8)\n    - ISM Non-Manufacturing Prices (previous: 55.1)\n    - MBA 30-Year Mortgage Rate (previous: 3.42%)\n    - MBA Mortgage Applications (previous: 2.7%)\n    - Markit Composite PMI (consensus: 36.4, previous: 27.0)\n    - Mortgage Market Index (previous: 746.5)\n    - Seevol Cushing Storage Report (previous: -4.261M)\n    - Services PMI (consensus: 36.9, previous: 26.7)\n\n## Upcoming events for Thursday, June  4th\n\n - Expected earnings:\n\n  AINC, AMC, AVGO, BAK, BITA, BMA, BVXV, CAAS, CAL, CARE, CCEP, CIEN, CLUB, CMD, COO, CRC, CVIA, DBI, DLNG, DLTH, DOCU, DOMO, FLR, FUV, GES, GGAL, GHG, GIII, GPS, HBB, HOME, INWK, IRCP, JILL, KLXE, LLEX, MARK, MDB, MIK, MMYT, MOV, MTN, NAV, NGG, NX, OESX, PD, PRTY, RRGB, RTIX, SAIC, SCWX, SEAC, SENS, SJM, SPWH, TNP, TTC, UFAB, VJET, WORK, WPRT, XBIT, XELA, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AIN, AJG, AL, AMNB, ANAT, BAC, BAX, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CDK, CERN, CHRW, CTXS, D, ESBK, FFNW, FLO, FRME, GARS, GOLF, GPC, HLI, HWC, HWKN, ICBK, INT, KFRC, KMB, KNX, LCII, MANT, MBWM, MLI, NAVI, NVDA, ORI, PBIP, PCH, PEP, PII, RF, SEE, SLM, SNR, SQM, TGNA, TILE, TRST, TT, UFCS, WM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.130%)\n    - 8-Week Bill Auction (previous: 0.135%)\n    - Challenger Job Cuts (previous: 1,576.9%)\n    - Challenger Job Cuts (previous: 671.129K)\n    - Continuing Jobless Claims (consensus: 25,750K, previous: 21,052K)\n    - Exports (previous: 187.80B)\n    - Imports (previous: 232.20B)\n    - Initial Jobless Claims (consensus: 1,800K, previous: 2,123K)\n    - Jobless Claims 4-Week Avg. (previous: 2,608.00K)\n    - Natural Gas Storage (consensus: 107B, previous: 109B)\n    - Nonfarm Productivity (consensus: -2.5%, previous: -2.5%)\n    - Trade Balance (consensus: -44.30B, previous: -44.40B)\n    - Unit Labor Costs (consensus: 4.8%, previous: 4.8%)\n\n^^^^2020-06-01",
        "created_utc": 1591005619,
        "id": "fsigvgq",
        "permalink": "/r/RobinHood/comments/guhudl/daily_discussion_thread_june_1st_2020/fsigvgq/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1591034419.0
    }
]