[
    {
        "author": "Older_Miggy",
        "body": "Oh God yes.\n\nHave you seen some their Chevy commercials the past year or two? Watch Zebra Corner on YT, they parody the shit out of Chevy and they're funny as hell. Even the fine print shows how full of shit they are.",
        "created_utc": 1599754038,
        "id": "g4pa471",
        "permalink": "/r/wallstreetbets/comments/iq4yte/nikola_how_to_parlay_an_ocean_of_lies_into_a/g4pa471/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599782838.0
    },
    {
        "author": "Older_Miggy",
        "body": "I'm one of those boomer types you kids keep making fun of. I've been watching GM for at least a few decades.\n\nManagement there has been incompetent forever. If there's a way to do something half assed, GM will find it. It's like a way station for people who can't go anywhere else in their careers. Sadly, they still make big bank for doing so. GM is little more than a well paid managerial pit stop for women and minorities so progs can claim diversity, inclusion, equality and all that other horseshit claptrap.\n\nWhen GM agreed to pay workers 95% of their pay for not working back in the 90's or early 2000's, it was all downhill from there. About the dumbest thing imaginable. Bankruptcy was inevitable after that. They should have been killed off in BK and ripped into pieces, then sold off. But no! The Subhuman Mongrel saved his UAW pals at the expense of bondholders, especially little bondholders.\n\nThey couldn't even come out of BK right. When the IPO was being issued there was a disclaimer in their financials that said their financial statements STILL COULD NOT BE RELIED UPON AS BEING ACCURATE. WTF??? Maybe that's standard coming out of BK, but I've never seen it elsewhere. And since the IPO, the stock has gone literally nowhere....IPO 2010 at $33, Friday's close $30.46. Down almost 10% after 10 years. That's a classic sign of a shit company.\n\nThe fact that GM has institutional ownership is just BS too. All those firms did was pony up to suck government cock and bow at the feet of Chocolate Jesus. I haven't looked recently, but hell Warren Buffett owns/owned about $100 million of GM stock in Berkshire. That's a fart in a hurricane to Buffett. You really think he gives a shit about GM? \n\nI keep saying, go watch Zebra Corner on YT and their parodies of Chevy commercials. The real commercials are the most godawful things I've ever seen (I don't watch TV, so I don't see them as they air). Chevy's marketing department should all be marched into a concentration camp and gassed. \n\nLast year, GM and Softbank teamed up on something with EV's which caused GM to temporarily spike to about $40. Of course, after a little while the stock drifted back down to 30, just like now. Do you see a pattern here? GM, Softbank, now NKLA. It's like the trifecta of fuckups. And GM is paying with \"services.\" Those services won't be anything GM wouldn't have paid out in some other way. In other words, GM paid no money for a stake in a company that has no product. Brilliant.\n\nNKLA will die, but GM will limp on like it always does.\n\nI could go on, but Grampaw just woke up and needs his coffee. Y'all have a nice day.\n\nPosition: NKLA January 10 puts",
        "created_utc": 1600010944,
        "id": "g54e7ja",
        "permalink": "/r/wallstreetbets/comments/irzmuy/nkla_and_gm_to_the/g54e7ja/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600039744.0
    },
    {
        "author": "GreenhouseJim",
        "body": "you guys see the new arketf $FROG $GOOS $CAT $DE $ZBRA",
        "created_utc": 1601245491,
        "id": "g6w8etx",
        "permalink": "/r/wallstreetbets/comments/j0xvo5/what_are_your_moves_tomorrow_september_28_2020/g6w8etx/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601274291.0
    },
    {
        "author": "frykobs",
        "body": "Joe's tie looks like a zebra",
        "created_utc": 1601428194,
        "id": "g74k6jx",
        "permalink": "/r/wallstreetbets/comments/j272rv/what_are_your_moves_tomorrow_september_30_2020/g74k6jx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601456994.0
    },
    {
        "author": "kevc652",
        "body": "ZBRA, WMT are pretty safe bet",
        "created_utc": 1601061588,
        "id": "g6kbk01",
        "permalink": "/r/wallstreetbets/comments/izprnw/where_to_invest/g6kbk01/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601090388.0
    },
    {
        "author": "suckafuckduck",
        "body": "Lolololololol zebra underwear",
        "created_utc": 1599287590,
        "id": "g43abco",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g43abco/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599316390.0
    },
    {
        "author": "Older_Miggy",
        "body": "GM should have been allowed to die when it was bankrupt.\n\nGM management is that dumb, they've been that way for years. Look at their car commercials.....they actually pay for those shit ads where people meet to oooh and aaaah over some bland thing on wheels. Zebra Corner on TY parodies them to death and it's funny as hell.\n\nI smell desperation.",
        "created_utc": 1599569845,
        "id": "g4fqmpm",
        "permalink": "/r/wallstreetbets/comments/ios4v0/nikola_did_it/g4fqmpm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599598645.0
    },
    {
        "author": "AmbiguousDecisions",
        "body": "This is 100% a scratch and sniff lick tattoo. Ya no, like that bullshit zebra gum that lasted 5 seconds",
        "created_utc": 1599490380,
        "id": "g4c4vy8",
        "permalink": "/r/wallstreetbets/comments/io8i5z/im_back_bitches/g4c4vy8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599519180.0
    },
    {
        "author": "Older_Miggy",
        "body": "Yes, I do believe they got away with the GM deal when they were faking everything.\n\nThey've produced literally nothing. Their claims often need to be walked back or are just forgotten.  They have literally nothing to offer. And GM is STILL run by a bunch of fucking idiots.\n\nAgain I say, watch Zebra Corner on YT parody Chevy commercials. I don't watch TV, so that's the only time I can see them. A 5 year old could make better commercials than Chevy's marketing dept. Oh and if their cars didn't suck, GM wouldn't STILL be trading below the post-bankruptcy IPO price from 2010 ($33).",
        "created_utc": 1599798716,
        "id": "g4slas3",
        "permalink": "/r/wallstreetbets/comments/iqj7e4/hindenburg_vs_nikola_a_false_hit_piece/g4slas3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599827516.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "permalink": "/r/wallstreetbets/comments/itw74x/thread_to_throw_off_the_algos_fuck_wall_street/g5irhtl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "I thought for sure $ZBRA was the pen maker lol",
        "created_utc": 1600469439,
        "id": "g5r52vi",
        "permalink": "/r/wallstreetbets/comments/ivdifw/weekend_discussion_thread_for_the_weekend_of/g5r52vi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600498239.0
    },
    {
        "author": "AutomatonSwan",
        "body": "Why is there no premarket data for ZBRA?",
        "created_utc": 1600261406,
        "id": "g5gtkmq",
        "permalink": "/r/wallstreetbets/comments/itspun/daily_discussion_thread_for_september_16_2020/g5gtkmq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600290206.0
    },
    {
        "author": "frykobs",
        "body": "#why did Joe bring a zebra to the debate?",
        "created_utc": 1601428214,
        "id": "g74k7od",
        "permalink": "/r/wallstreetbets/comments/j272rv/what_are_your_moves_tomorrow_september_30_2020/g74k7od/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1601457014.0
    }
]