[
    {
        "author": "JabootieeIsGroovy",
        "body": "someone wanna go wake up tesla n tel em power hour is coming up goddamn",
        "created_utc": 1599067566,
        "id": "g3qr51m",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599096366.0
    },
    {
        "author": "scopolamine",
        "body": "&gt;Israel is preparing to enter a second national coronavirus lockdown on Friday, becoming the first country to re-enter nationwide restrictions. The unpopular lockdown is expected to last at least three weeks, upending a normally festive period filled with Jewish holidays. - The Guardian\n\nThe announcement was made on Sunday. Since then, Tel Aviv stock exchange is just deep diving to the ground:\n\n[https://www.tradingview.com/symbols/TASE-TASE/](https://www.tradingview.com/symbols/TASE-TASE/)\n\nSeems like second lockdowns are not priced in.",
        "created_utc": 1600417425,
        "id": "g5on6uh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600446225.0
    },
    {
        "author": "TURNIPtheB33T",
        "body": "Ok let me try and write this somewhat coherently. Think about it like this. You have the biggest bounce after March, tech is booming, people making millions and every bull out there throwing everything he’s got into tech. Problem is there’s this thought in the back of everyone’s mind, when is it going to crash?\n\nSo already you’re invested, but you’re uncertain. How do you reach new highs and solidify the current market caps? You correct it slightly. Every bear comes out screaming from the top ‘it’s all coming down’. This thought in the back of the mind is now at the front, people are panicking, figuring out how they’re going to tel there loved ones except all of a sudden, it stops crashing and markets bottom -10% and immediately bounce. Boom, new bull run. Market caps have been solidified as the low, retail gets massive hard ons because all they see is big green candles and all of a sudden you’ve sparked another massive run.\n\nAnd SoftBank makes billions.\n\nEdit\n\nClearly there’s more to it than that but from a pure psychological stand point, this is just a rekindling of the bull fire.",
        "created_utc": 1599278886,
        "id": "g42xz5k",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599307686.0
    },
    {
        "author": "auzeos",
        "body": "Someone tel me why the fuck NKLA went up 5% after hours",
        "created_utc": 1601415460,
        "id": "g73xnm4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601444260.0
    },
    {
        "author": "cat_modeler",
        "body": "Tel that to my nkla 40$ calls",
        "created_utc": 1600909790,
        "id": "g6dhq0h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600938590.0
    },
    {
        "author": "Think2wicemusic",
        "body": "You’re basically asking “hey random ppl, what should I do with my stocks?” Nobody knows man lol if someone could tel you that the stock market would be easy $ for all of us. Do some DD and decide what’s best for you",
        "created_utc": 1599326718,
        "id": "g457s5x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599355518.0
    },
    {
        "author": "dube123",
        "body": "I’ll tel you what. I’ll start an only fans just for you. Gotta get my tendies somehow 🤑🤡",
        "created_utc": 1599304494,
        "id": "g43zfs8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599333294.0
    },
    {
        "author": "saifly",
        "body": "SOMEONE TEL ME WHAT TO DO WITH THESE TSLA FDS",
        "created_utc": 1599744970,
        "id": "g4ociml",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599773770.0
    },
    {
        "author": "mannybanny17",
        "body": "Don’t feel that bad. In 5500 at 1.39. \nNone of the news has been wow yet but I’m crossing my fingers. It’s dropped to 65 shekels on the tel aviv exchange which is equivalent to about 18. Lets go miracle",
        "created_utc": 1599525786,
        "id": "g4e9di2",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599554586.0
    },
    {
        "author": "iyioi",
        "body": "Please tel me next time you buy a call",
        "created_utc": 1599177484,
        "id": "g3xcflb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599206284.0
    },
    {
        "author": "MikeGoldberg",
        "body": "Tellurian (TEL)",
        "created_utc": 1600569547,
        "id": "g5wuso2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600598347.0
    },
    {
        "author": "scopolamine",
        "body": "Yes, I did. I don't see any panic in Tel Aviv stock exchange. A small sell-off. Compared to Feb &amp; March.",
        "created_utc": 1600019479,
        "id": "g54yx73",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600048279.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "Nu2stocks",
        "body": "Tel me about it I gained 10k if a zoom call last week and lost half of it on the crash",
        "created_utc": 1599435821,
        "id": "g4a4oit",
        "score": 1,
        "subreddit": "options",
        "created": 1599464621.0
    },
    {
        "author": "hambone_83",
        "body": "https://m.jpost.com/israel-news/drone-drops-hundreds-of-bags-of-cannabis-dropped-in-tel-aviv-640981",
        "created_utc": 1599161845,
        "id": "g3w3prt",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599190645.0
    },
    {
        "author": "RelentlessPAWGHunter",
        "body": "Preface: First of all I can guarantee that I am the only person in this thread that has seen Palantir's products. And you are 100% dead wrong about describing it as \"military grade AI.\" It is a data integration application that connects different datasets and creates a user interface for humans to comb through and make connections.\n\nThis stock is garbage and extremely overvalued. I believe the catalyst will be insiders dumping their equity first chance they get. The lock-up is until 3 days after the FY 2020 results, but they're allowing insiders to sell up to 20% day 1 tomorrow. Right now I have OTM puts on $SSSS which holds a lot of Palantir shares. $SSSS was pumped up by retail traders looking for an IPO play.\n\nThis is a 17 year old company that has tied a lot of their employee compensation to equity. If you look at the filings, there are 10s of millions of RSUs set to schedule even throughout the next year. These are a huge expense for Palantir in addition to the compensation that has been tied up for TWO DECADES. What people don't understand is that Palantir has been teasing about an IPO for a LONG time. Palantir used to be an extremely hot Silicone Valley destination for Stanford graduates.\n\nThe high-level insiders also have what is described as one of the most aggressive governance structures ever with their class F shares which let them control the company while selling down to 0.5% of the class A shares. They can dump shares tomorrow and still control the company.\n\nThis is not some hot magic data platform provider a la Snowflake, this is a bloated government SaaS contractor. They have a very reliable and niche purpose providing their software to intelligence organizations like the CIA (which was their original purpose, getting their first seed money from the CIA venture capital arm  In-Q-Tel). But they cannot scale that product, \"Gotham.\" They have to hire and train consultant-style employees in order to deploy the application. Hence their massive \"look at this hand!\" magic trick they're trying to pull with their commercial application, \"Foundry.\" I have seen both of these applications and I have seen live demos from Palantir itself. I was impressed with the software, I am not impressed with it from a scale perspective. I genuinely believe that their software is incredibly useful to governments and intelligence organizations that deploy it successfully.\n\nThe magic trick: the majority of their revenue comes from Gotham. Their growth is within existing customers from Gotham. Their revenue from Foundry is a lot smaller and their annual growth is like 25%. Again mostly from existing customers. I can't find the source of the numbers but something like 90%+ of the growth was from existing customers. The reason they want you to focus on the commercial application is because the commercial application is infinitely more scalable than the government application. It's debatable how much easier it is to deploy. But remember that the government application, Gotham, is the majority of their revenue and requires an army of consultant engineers to keep running. It's real glue and toothpick type stuff.\n\nIf you do the digging you will also find numerous stories about corporate customers dropping Palantir, calling it expensive and complicated.\n\nI believe Palantir should be valued at around $6 billion a year, a multiple of around 6x their annual revenue which for the first time in 17 years is rumored to barely eclipse $1 billion.\n\nI firmly believe we are in another technology bubble between these SPAC EVs and tech IPOs. You have this lethargic private software company that's just been in complete zombie mode. 17 years guys. From the private investing perspective this investment needs to be dumped. And now you see their IPO plans go from IPO (roadshow with institutional investors with the bank then setting a price) to a direct listing with a weird lockup. And you see retail traders excited to get in a tech startup direct listing with terrible governance, terrible financials, weird muddled products that most mainstream media outlets can't accurately describe. And don't even get me started on Snowflake.",
        "created_utc": 1601401830,
        "id": "g7338uw",
        "score": 1,
        "subreddit": "investing",
        "created": 1601430630.0
    },
    {
        "author": "evilr2",
        "body": "They also trade on the Tel Aviv Stock Exchange so share price would likely be closer to half of that, but interestingly in line with the $30 price target.",
        "created_utc": 1599758532,
        "id": "g4pmj7z",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599787332.0
    },
    {
        "author": "mdkb",
        "body": "&gt;Junior year in high school I had an economics class where we learned a good amount in trading securities. I was also a big advocate of bitcoin at the time so I’ll tel you I won the competition (this was 2016-2017) ever since I’ve been learning and practicing. My uncle and grandfather are both brokers and it’s a big part of my family.\n\nI am perfectly chilled here, thanks for checking though.\n\nThis is you claiming 3 generations of family history and expertise in trading skills, you are then also claiming 40% to be realistic.\n\nbs, you are phishing for muppets.\n\nYou are clearly lying, and now I am making you uncomfortable so you have started wriggling around like a squirmy thing.\n\nJust stop replying and this will be over.",
        "created_utc": 1599290631,
        "id": "g43edwd",
        "score": 1,
        "subreddit": "options",
        "created": 1599319431.0
    },
    {
        "author": "Murderouswaffle",
        "body": "I work at a systems integration company and we had Cambium guys come in and pitch their new line of products last summer.  From what I remember, they are expensive but do have great products.  If what OP says is true and they're in such high demand, not only will these numbers look good on Q3 and Q4 earnings reports, but these will likely be repeat customers.  Making an instant deposit as we speak, I'm in.\n\nOh, and for what it's worth, the 3.65 GHz band hasn't been utilized nearly as much as the 5.9 GHz band.  Unless you're in the middle of nowhere, 5.9 GHz is becoming very crowded due to no licensing fees and pretty affordable tech.  Fiber is not always feasible, and licensed (11 GHz+) is expensive and a hassle (approved licensing can take up to 90 days).  From what I remember, 3.65 GHz band will be more of a subscription based license, like your cell bill.  I can totally see this ease of use grabbing a large share of the wireless market.  To add to the lack of 3.65 GHz providers, we installed Alvarion radios for a client years ago.  Alvarion has since moved entirely to Tel Aviv, Israel and you cannot even get an English-speaking customer service agent anymore.  Cambium is really all there is.\n\nFeel free to fact check me on the 3.65 GHz info for anyone who could know.  This is a smart play regardless, thank you OP.",
        "created_utc": 1600833644,
        "id": "g6acbsr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600862444.0
    },
    {
        "author": "ssmihailovitch",
        "body": "\"Why does this opportunity exist? Lesico has been public for only a handful of years and it is relatively unknown to local Israeli investors. Furthermore, it is a small cap using Tel Aviv Stock Exchange standards. another factor is insiders owning almost 70% of the company, the public float is estimated to value 53M NIS (\\~16M USD). This is a thinly traded and relatively illiquid security. It is our philosophy that opportunity lies where other investors would not or cannot go, and we believe Lesico is a strong example of that.\"",
        "created_utc": 1599506417,
        "id": "g4d71p8",
        "score": 0,
        "subreddit": "SecurityAnalysis",
        "created": 1599535217.0
    },
    {
        "author": "zendraven",
        "body": "PLEASE tel me I timed the top MM",
        "created_utc": 1600955898,
        "id": "g6fasvi",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1600984698.0
    },
    {
        "author": "quinnilius",
        "body": "Turn off the tel-a-vision. Fear dissipates with no propoganda machine to spin fear stories at you 24/7.",
        "created_utc": 1600974790,
        "id": "g6gevrj",
        "score": -1,
        "subreddit": "investing",
        "created": 1601003590.0
    },
    {
        "author": "TheChumGuzzler69",
        "body": "Can someone tel me how to even start this shit. I just yolod 50$ in my rh account.",
        "created_utc": 1600294656,
        "id": "g5ir2u9",
        "score": -8,
        "subreddit": "wallstreetbets",
        "created": 1600323456.0
    },
    {
        "author": "JabootieeIsGroovy",
        "body": "someone wanna go wake up tesla n tel em power hour is coming up goddamn",
        "created_utc": 1599067566,
        "id": "g3qr51m",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599096366.0
    },
    {
        "author": "TURNIPtheB33T",
        "body": "Ok let me try and write this somewhat coherently. Think about it like this. You have the biggest bounce after March, tech is booming, people making millions and every bull out there throwing everything he’s got into tech. Problem is there’s this thought in the back of everyone’s mind, when is it going to crash?\n\nSo already you’re invested, but you’re uncertain. How do you reach new highs and solidify the current market caps? You correct it slightly. Every bear comes out screaming from the top ‘it’s all coming down’. This thought in the back of the mind is now at the front, people are panicking, figuring out how they’re going to tel there loved ones except all of a sudden, it stops crashing and markets bottom -10% and immediately bounce. Boom, new bull run. Market caps have been solidified as the low, retail gets massive hard ons because all they see is big green candles and all of a sudden you’ve sparked another massive run.\n\nAnd SoftBank makes billions.\n\nEdit\n\nClearly there’s more to it than that but from a pure psychological stand point, this is just a rekindling of the bull fire.",
        "created_utc": 1599278886,
        "id": "g42xz5k",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599307686.0
    },
    {
        "author": "Think2wicemusic",
        "body": "You’re basically asking “hey random ppl, what should I do with my stocks?” Nobody knows man lol if someone could tel you that the stock market would be easy $ for all of us. Do some DD and decide what’s best for you",
        "created_utc": 1599326718,
        "id": "g457s5x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599355518.0
    },
    {
        "author": "dube123",
        "body": "I’ll tel you what. I’ll start an only fans just for you. Gotta get my tendies somehow 🤑🤡",
        "created_utc": 1599304494,
        "id": "g43zfs8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599333294.0
    },
    {
        "author": "saifly",
        "body": "SOMEONE TEL ME WHAT TO DO WITH THESE TSLA FDS",
        "created_utc": 1599744970,
        "id": "g4ociml",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599773770.0
    },
    {
        "author": "mannybanny17",
        "body": "Don’t feel that bad. In 5500 at 1.39. \nNone of the news has been wow yet but I’m crossing my fingers. It’s dropped to 65 shekels on the tel aviv exchange which is equivalent to about 18. Lets go miracle",
        "created_utc": 1599525786,
        "id": "g4e9di2",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599554586.0
    },
    {
        "author": "iyioi",
        "body": "Please tel me next time you buy a call",
        "created_utc": 1599177484,
        "id": "g3xcflb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599206284.0
    },
    {
        "author": "scopolamine",
        "body": "Yes, I did. I don't see any panic in Tel Aviv stock exchange. A small sell-off. Compared to Feb &amp; March.",
        "created_utc": 1600019479,
        "id": "g54yx73",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600048279.0
    },
    {
        "author": "Nu2stocks",
        "body": "Tel me about it I gained 10k if a zoom call last week and lost half of it on the crash",
        "created_utc": 1599435821,
        "id": "g4a4oit",
        "score": 1,
        "subreddit": "options",
        "created": 1599464621.0
    },
    {
        "author": "hambone_83",
        "body": "https://m.jpost.com/israel-news/drone-drops-hundreds-of-bags-of-cannabis-dropped-in-tel-aviv-640981",
        "created_utc": 1599161845,
        "id": "g3w3prt",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599190645.0
    },
    {
        "author": "evilr2",
        "body": "They also trade on the Tel Aviv Stock Exchange so share price would likely be closer to half of that, but interestingly in line with the $30 price target.",
        "created_utc": 1599758532,
        "id": "g4pmj7z",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599787332.0
    },
    {
        "author": "mdkb",
        "body": "&gt;Junior year in high school I had an economics class where we learned a good amount in trading securities. I was also a big advocate of bitcoin at the time so I’ll tel you I won the competition (this was 2016-2017) ever since I’ve been learning and practicing. My uncle and grandfather are both brokers and it’s a big part of my family.\n\nI am perfectly chilled here, thanks for checking though.\n\nThis is you claiming 3 generations of family history and expertise in trading skills, you are then also claiming 40% to be realistic.\n\nbs, you are phishing for muppets.\n\nYou are clearly lying, and now I am making you uncomfortable so you have started wriggling around like a squirmy thing.\n\nJust stop replying and this will be over.",
        "created_utc": 1599290631,
        "id": "g43edwd",
        "score": 1,
        "subreddit": "options",
        "created": 1599319431.0
    },
    {
        "author": "ssmihailovitch",
        "body": "\"Why does this opportunity exist? Lesico has been public for only a handful of years and it is relatively unknown to local Israeli investors. Furthermore, it is a small cap using Tel Aviv Stock Exchange standards. another factor is insiders owning almost 70% of the company, the public float is estimated to value 53M NIS (\\~16M USD). This is a thinly traded and relatively illiquid security. It is our philosophy that opportunity lies where other investors would not or cannot go, and we believe Lesico is a strong example of that.\"",
        "created_utc": 1599506417,
        "id": "g4d71p8",
        "score": 0,
        "subreddit": "SecurityAnalysis",
        "created": 1599535217.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  1st of September\n\n\n\n## Upcoming events for Tuesday, September  1st\n\n - Stock splits:\n\n    - INOTF @ **2:11**\n\n - Expected earnings:\n\n  ANAT, ASFI, AZRX, BBW, BWL.A, CAL, CDMO, CEA, CIG, CVV, DRD, GEC, GILT, HIHO, HMY, HOME, HRB, IDXG, JAMF, JILL, KBSF, KEN, METX, MFAC, NOVN, NSSC, NVUS, RBCN, SCPE, SCVL, SYNL, TC, TEUM, UTSI, WSG\n\n - Ex-div:\n\n  AROW, AVY, EBIX, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FOX, FOXA, FPF, FPL, FSD, FTHY, GHL, HAL, HLI, ICL, IGD, IID, ITUB, KRNY, MYE, NPO, NVDA, ODFL, OPOF, PAHC, PJT, RCKY, RE, SLB\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -4.524M)\n    - Construction Spending (consensus: 1.0%, previous: -0.7%)\n    - Dallas Fed Services Revenues (previous: -8.5)\n    - FOMC Member Brainard Speaks\n    - ISM Manufacturing Employment (consensus: 45.8, previous: 44.3)\n    - ISM Manufacturing New Orders Index (previous: 61.5)\n    - ISM Manufacturing PMI (consensus: 54.5, previous: 54.2)\n    - ISM Manufacturing Prices (consensus: 54.0, previous: 53.2)\n    - Manufacturing PMI (consensus: 53.6, previous: 50.9)\n    - Redbook (previous: 0.6%)\n    - Redbook (previous: 4.1%)\n    - Texas Services Sector Outlook (previous: -26.7)\n    - Total Vehicle Sales (previous: 14.50M)\n\n## Upcoming events for Wednesday, September  2nd\n\n - Expected earnings:\n\n  AKER, AMBA, AMRH, APWC, ATLC, BCOW, BF.A, BF.B, BMA, BROG, CBLI, CEI, CLDR, CPRT, CRWD, CTXR, CVU, EGAN, FIVE, FMCI, GES, GSX, GWRE, HMG, HOTH, HTHT, HUSA, IPDN, JFIN, KEP, KFFB, KLXE, LE, LMFA, M, MBOT, MCEP, MDB, MEIP, MIND, MTRX, OBSV, PD, PPSI, PRCP, PSV, PVH, QTT, REXN, RKT, SAIC, SMAR, SMIT, SNP, SPWH, TDAC, VRA, VRNT, WORX, WUBA, XIN, YGYI, ZNH, ZUO\n\n - Ex-div:\n\n  AMCR, BBD, BBDO, CEO, FORTY, HD, LIN, LZB, MOS, PEBK, PTEN, QCOM, RMBI, SSTK, TER\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 950K, previous: 167K)\n    - Beige Book\n    - Crude Oil Imports (previous: -1.040M)\n    - Crude Oil Inventories (consensus: -1.950M, previous: -4.689M)\n    - Cushing Crude Oil Inventories (previous: -0.279M)\n    - Distillate Fuel Production (previous: 0.380M)\n    - Durables Excluding Defense (previous: 9.9%)\n    - EIA Refinery Crude Runs  (previous: 0.225M)\n    - EIA Weekly Distillates Stocks (consensus: -1.450M, previous: 1.388M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -7.0%, previous: 1.1%)\n    - FOMC Member Mester Speaks\n    - FOMC Member Williams Speaks\n    - Factory Orders (consensus: 6.0%, previous: 6.2%)\n    - Factory orders ex transportation (previous: 4.4%)\n    - Gasoline Inventories (consensus: -3.575M, previous: -4.584M)\n    - Gasoline Production (previous: 0.118M)\n    - Heating Oil Stockpiles (previous: 0.294M)\n    - ISM NY Business Conditions (previous: 53.5%)\n    - ISM-New York Index (previous: 807.8)\n    - MBA 30-Year Mortgage Rate (previous: 3.11%)\n    - MBA Mortgage Applications (previous: -6.5%)\n    - MBA Purchase Index (previous: 310.2)\n    - Mortgage Market Index (previous: 770.6)\n    - Mortgage Refinance Index (previous: 3,423.0)\n    - Sec Kashkari Speaks\n    - Seevol Cushing Storage Report (previous: -0.010M)\n\n## Upcoming events for Thursday, September  3rd\n\n - Expected earnings:\n\n  AIM, AKTX, AOUT, AVGO, BNED, BNTC, BYSI, CIEN, CKX, CLUB, CONN, COO, CPB, CTHR, CULP, DBI, DCI, DLTH, DOCU, DOMO, FFBW, FFHL, FIZZ, FLR, GCO, GMS, GRNQ, GROW, GTT, HOFT, HOV, IROQ, JW.A, JW.B, KFY, KIRK, KZIA, MDLA, MEI, MIK, MOMO, MSON, NX, OXM, PBIO, PDCO, PDEX, PZG, SCX, SECO, SFET, SHLO, SIG, SPCB, SWBI, TLYS, TTC, TWMC, UBA, UBP, VEDL, VOLT, WVFC, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AJG, AMNB, BAC, BBL, BF.A, BF.B, BHP, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CHRW, CRH, D, ESBK, FDX, FFNW, FNB, FRME, GOLF, GPC, ICBK, KMB, KNX, LCII, MBCN, MBWM, MLI, MLR, NAVI, NFE, NNA, ORI, OTEX, PEP, RF, SEE, SLM, SNR, STRA, SU, TGNA, TILE, TRST, TT, UFCS, UNF, WM, YY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.090%)\n    - Challenger Job Cuts (previous: 262.649K)\n    - Chicago Fed President Evans Speaks\n    - Continuing Jobless Claims (consensus: 14,000K, previous: 14,535K)\n    - Exports (previous: 158.25B)\n    - ISM Non-Manufacturing Business Activity (consensus: 65.0, previous: 67.2)\n    - ISM Non-Manufacturing Employment (previous: 42.1)\n    - ISM Non-Manufacturing New Orders (previous: 67.7)\n    - ISM Non-Manufacturing PMI (consensus: 57.0, previous: 58.1)\n    - ISM Non-Manufacturing Prices (previous: 57.6)\n    - Imports (previous: 208.95B)\n    - Initial Jobless Claims (consensus: 950K, previous: 1,006K)\n    - Initial Jobless Claims (previous: 1,006K)\n    - Jobless Claims 4-Week Avg. (previous: 1,068.00K)\n    - Markit Composite PMI (consensus: 54.7, previous: 54.7)\n    - Natural Gas Storage (consensus: 47B, previous: 45B)\n    - Natural Gas Storage (previous: 45B)\n    - Nonfarm Productivity (consensus: 7.5%, previous: 7.3%)\n    - Services PMI (consensus: 54.8, previous: 54.8)\n    - Trade Balance (consensus: -58.00B, previous: -50.70B)\n    - Unit Labor Costs (consensus: 12.1%, previous: 12.2%)\n\n## Upcoming events for Friday, September  4th\n\n - Expected earnings:\n\n  ANIX, ATHE, ATNM, BMRA, BRC, CCH, CNNB, FSEA, GENE, GMHI, GVA, HURC, IBIO, IMRN, IRCP, JG, JKS, LFAC, MARPS, MSB, NFIN, PKX, QD, TNP, YIN\n\n - Ex-div:\n\n  AFIN, BPOP, EGOV, FAF, FANH, GBDC, LOB, PBIP, PE, PWOD, SVBI, UVSP, WRI\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.5%, previous: 4.8%)\n    - Average Hourly Earnings (previous: 0.2%)\n    - Average Weekly Hours (consensus: 34.5, previous: 34.5)\n    - CFTC Aluminium speculative net positions (previous: 211.8K)\n    - CFTC Copper speculative net positions (previous: 47.9K)\n    - CFTC Corn speculative net positions (previous: -17.4K)\n    - CFTC Crude Oil speculative net positions (previous: 500.7K)\n    - CFTC Gold speculative net positions (previous: 221.0K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 19.7K)\n    - CFTC Natural Gas speculative net positions (previous: 13.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -86.6K)\n    - CFTC Silver speculative net positions (previous: 31.3K)\n    - CFTC Soybeans speculative net positions (previous: 143.3K)\n    - CFTC Wheat speculative net positions (previous: 18.4K)\n    - Government Payrolls (previous: 301.0K)\n    - Manufacturing Payrolls (consensus: 50K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 1,400K, previous: 1,763K)\n    - Participation Rate (previous: 61.4%)\n    - Private Nonfarm Payrolls (consensus: 1,265K, previous: 1,462K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 180)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - U6 Unemployment Rate (previous: 16.5%)\n    - Unemployment Rate (consensus: 9.8%, previous: 10.2%)\n\n^^^^2020-09-01",
        "created_utc": 1598954413,
        "id": "g3kjxt6",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1598983213.0
    },
    {
        "author": "MK45124512",
        "body": "Just a note that TER hired a PR firm to push their stock which is part of why they've been getting so much buzz lately. They were a solid bet on NJ legalization but at this point I don't think the discount (if it exists) to the big 4 is worth investing in. Caveat emptor",
        "created_utc": 1598970903,
        "id": "g3lcnsl",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1598999703.0
    },
    {
        "author": "iAMiAnthus2020",
        "body": "They are both 5% weighting? That’s what I see despite Ter being a couple rows higher.",
        "created_utc": 1599013365,
        "id": "g3o93be",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599042165.0
    }
]