[
    {
        "author": "rioferd888",
        "body": "It feels like January again. \n\nTesla mooning to 900 soon. \n\nSpce about to rocket back to 40. \n\nAmd nearing ATH. \n\nFANG are driving the market higher. \n\nJpow has done it. He has created a time machine.",
        "created_utc": 1586909485,
        "id": "fnfjvwk",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1586938285.0
    },
    {
        "author": "Redditor45643335",
        "body": "Wow, AMD was $3 a share as recent as 2017!\n\n\nMan I'd like to find a killer company at absolute rock bottom prices like that and make a 1000% on my investment. For some reason every company I look at already has stupid crazy evaluations in the tens of billions.\n\n\nEven brand new companies that have just IPO'd are already getting multibillion dollar evaluations...",
        "created_utc": 1586982289,
        "id": "fnilxum",
        "score": 65,
        "subreddit": "stocks",
        "created": 1587011089.0
    },
    {
        "author": "Coz131",
        "body": "100B is possible but just needs very strong due diligence. They went for whatever that is loudest. Their due diligence process is rubbish. Could have just fucking bought over AMD with the money a couple of years ago. \n\nAlso they don't invest all in startups like their ARM take over. \n\nThey did buy Boston dynamics which is a good company for example.",
        "created_utc": 1586811056,
        "id": "fnb8gxu",
        "score": 49,
        "subreddit": "investing",
        "created": 1586839856.0
    },
    {
        "author": "edge2528",
        "body": "You have to take big punts to get lucky like this. It wouldnt have looked like a killer company at $3. It was there for a reason. Ive been buying pc hardware and pc building for two decades and up until very recently AMD was just the budget tat that couldnt escape nvidias shadow, they really turned themselves around.\n\nFind something now that looks shit but maybe, just maybe has a glimmer of hope. \n\n&amp;#x200B;\n\nhas anybody looked at BB much recently?",
        "created_utc": 1586984937,
        "id": "fnir7pe",
        "score": 40,
        "subreddit": "stocks",
        "created": 1587013737.0
    },
    {
        "author": "danmalek466",
        "body": "More perspective. AMD hit a $1.90 low in Feb 2016. Yea seriously.",
        "created_utc": 1586986388,
        "id": "fniu3uk",
        "score": 37,
        "subreddit": "stocks",
        "created": 1587015188.0
    },
    {
        "author": "Jimbob67123",
        "body": "When you buy AMD 60c before earnings when AMD always tanks at earnings and the whole world economy is failing. \n\nPure autism at its finest",
        "created_utc": 1588132671,
        "id": "fox2q2j",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1588161471.0
    },
    {
        "author": "Smart202020",
        "body": "GOOG misses estimates by 10%, moons.  AMD beats estimates by 25%,  tanks....Nothing makes sense",
        "created_utc": 1588109919,
        "id": "fovyt8z",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1588138719.0
    },
    {
        "author": "HotProblem",
        "body": "just move to less risky plays. I've started just buying AMD shares and selling at the money covered calls every week. usually get assigned and take my $500-1000 gains. Rebuy shares and repeat.",
        "created_utc": 1586939371,
        "id": "fngoqr1",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1586968171.0
    },
    {
        "author": "GourmetFilet",
        "body": "I feel like AMD should be fucking rewarded for giving guidance. \n\nAll these other companies a bunch of softies 🍦",
        "created_utc": 1588105960,
        "id": "fovqvmy",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1588134760.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "AMD$$ BITCH ILL TAKE ON A ARMY AND DEFEND SUE BAE TILL THE END !!!\n\nFIST ON CHEST NO FEAR !!!",
        "created_utc": 1588105118,
        "id": "fovp5ps",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1588133918.0
    },
    {
        "author": "PeenusTits",
        "body": "Dude I bought amd calls for 1.5k half hour ago and made $120 profit. Sold it 5 mins ago",
        "created_utc": 1587053593,
        "id": "fnlheki",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1587082393.0
    },
    {
        "author": "Huddster99",
        "body": "SNAP = shit earnings \nAMD = Stellar earnings\n\nSNAP = up \nAMD = down \n\nInverse earnings. Got it.",
        "created_utc": 1588107110,
        "id": "fovt7sl",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1588135910.0
    },
    {
        "author": "jollygreenscott91",
        "body": "I bought amd calls today. I forgot what it feels like to make money",
        "created_utc": 1587051347,
        "id": "fnlcybb",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1587080147.0
    },
    {
        "author": "vaidasy",
        "body": "AMD was very risky bet at $1.90 not many investors like to buy companys before bancruptcy they could fail easly . If not new CEO Lisa Sue company would be bancrupt .",
        "created_utc": 1586991197,
        "id": "fnj3d87",
        "score": 26,
        "subreddit": "stocks",
        "created": 1587019997.0
    },
    {
        "author": "msimp000",
        "body": "Can’t wait till SPCE announces a spaceship made by TSLA with systems powered by AMD just so you could make a quick stop to GME to buy a MSFT Xbox and  while using AAPL pay.",
        "created_utc": 1586921971,
        "id": "fng49uk",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1586950771.0
    },
    {
        "author": "FullTime_Autist",
        "body": "Jesus H Christ. There is so much conspiracy theory in here that it would be impossible to maintain if this was even remotely true. The fact of markets is that its driven by 80% financial institutions who are not barred from holding short positions. The market is irrational in the short term, but its never irrational long term. \n\nTake a look at the VIX, its at 42. This implies that SPY can move 12% up or down as driven by premium prices. This means that the underwriters of options (the guys you buy options from) are pricing in this movement. Now lets look at SPY's movement the last 2 weeks, gee what do you know? its moved up 12% well within the expected volatility of the market. \n\nThis means that the SPY index can swing up or down 12% within this month, and it will mean absolutely NOTHING. It would be considered random noise.\n\nNow during the last 2 weeks we've had 2 uncertainties become certain.\n\n1. PPP was activated and disbursed\n2. Fed commited to buying Equity based securities\n\nThese were the 2 big driving factors of the gains.\n\nNow if you scrutinized the winners and losers of the last 2 weeks of gains, you can notice a theme. Companies like MSFT/AMD/NVDA/Netflix are rewarded. Can you think of a rational reason why that is? Compared to say BA? This is proof the market is evaluating companies rationally corp to corp.\n\nNext, I want all the bears to understand that in the history of 100 years of equity movement, the stocks only moved down 4% of the time ( vs 96% of the time up) and in addition, bear markets only lasted 200 days on average. With the way algos reacted and the fed, you can expect this bear market to be compressed at LEAST by a factor of 2. Lets say 100 days. Now we've had market reaction for over 60 days now. this means, we are likely already halfway through this market correction statistically.\n\nKnowing the above quantifications, how many are actually brave enough to continue to short? It makes no sense logically given the above.",
        "created_utc": 1587066292,
        "id": "fnm77do",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1587095092.0
    },
    {
        "author": "Peoples19592009",
        "body": "Welcome to AMD where no matter what happens you still get fucked.",
        "created_utc": 1588108083,
        "id": "fovv6mc",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1588136883.0
    },
    {
        "author": "gburdell",
        "body": "Disclosure: I worked at Intel once upon a time and still own a few thousand of INTC\n\n&gt; Intel has been really awful for a long time. No innovation, the lack of security is missing in nearly every cpu, I've been hearing about 10nm progress for 5 years and they haven't even accomplished that (this is in an industry that is supposed to innovate at exponential rate. \n\nCompletely ignores that Intel does non-CPU work.  You cherry-picked modem, but optane is crushing NAND in performance, they're now the top [silicon photonics](http://www.reddit.com/r/siliconphotonics) supplier.  On the CPU side, they made a bad decision to tie their innovations so closely to the process, then another one when they refused to back-port said innovations for several years, so yeah it looks like they haven't innovated.  I imagine they'll surprise in the next year or two now that the process is un-gummed.\n\n&gt; They are mostly paying/bribing other companies to make worse amd products/not advertise amd products/not carry amd stuff. They've done it in the past and got fined 1 bilion dollars. \n\nUnless you have a more recent allegation, that was 15 years and 3 CEOs ago.  Perhaps you'd like to chastise IBM for supplying the Nazis as well?",
        "created_utc": 1587691301,
        "id": "fodw81h",
        "score": 23,
        "subreddit": "investing",
        "created": 1587720101.0
    },
    {
        "author": "nutbusterx22",
        "body": "i bought 20 shares for 6.42 amd made $600, trust your gut man",
        "created_utc": 1586966595,
        "id": "fnhpi73",
        "score": 22,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1586995395.0
    },
    {
        "author": "campandsurf",
        "body": "fuck AMD i lost money on a call after there positive Q1 report. Stonk market retarded",
        "created_utc": 1588197425,
        "id": "fozv5wy",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1588226225.0
    },
    {
        "author": "McZotteBaard",
        "body": "rode amd from -3% to +2.5% then shorted it  \n6k profit  \nthis has been a fcking great day  \n\n\nnow let it sink even further",
        "created_utc": 1585761779,
        "id": "fm4vvmd",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1585790579.0
    },
    {
        "author": "BigEd781",
        "body": "The sentiment here is kind of hilarious. Intel didn't drop because they're losing a small amount of earnings on Apple machines when apple makes the vast majority of their money on iPhones. They dropped after a 23% earnings growth and an estimate beat because of their shaky Q2 guidance. The fact that their even providing Q2 guidance puts them ahead of most other companies.\n\nAMD is coming up behind them, but take a look at their balance financial statements and PE. Intel is a great value buy right now (I don't own any). I'm fine being told I'm wrong, but if you're not doing it with facts and numbers you just being emotional. Intel grew earnings 23%; they're not tanking next year. The question is whether or not you think AMD is going to grow at a rate to justify the premium and why you think Intel is DOA given the facts.",
        "created_utc": 1587701639,
        "id": "foee80v",
        "score": 22,
        "subreddit": "investing",
        "created": 1587730439.0
    },
    {
        "author": "DarealKoG",
        "body": "AMD has been a steady gainer also, 65$ calls for June ran up huge today\n\nI’ll say it again also MSFT 210 6/19 CALLS",
        "created_utc": 1586812786,
        "id": "fnbbvl9",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1586841586.0
    },
    {
        "author": "chocolate_avocado",
        "body": "Just make straddles, stonks always go up, but the crash is imminent. I made 30% of my account balance over the past three trading days off of AMD and AAPL straddles.",
        "created_utc": 1586921927,
        "id": "fng47e3",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1586950727.0
    },
    {
        "author": "PM_YOUR_VOLVO_TO_ME",
        "body": "I sell put spreads, iron condors, naked puts on stocks I want like airlines, oil and AMD,  spin the wheel on ultra high IV shit.\n\nOnce you free your mind of bull vs bear and realize that neither of those gangs can beat big daddy chronos, you can start seeing green days. \n\nWhy bother trying to guess direction when you know that time decay will wreck people 86% of the time? Buying lottery tickets is literally a coin toss game. Selling lottery tickets is the patricians choice.",
        "created_utc": 1586392405,
        "id": "fmuj3fs",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1586421205.0
    },
    {
        "author": "splendidG00se",
        "body": "Joined AMD call train today, fastest 70% I’ve ever lost. Felt like a rite of passage.",
        "created_utc": 1587517907,
        "id": "fo55fva",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1587546707.0
    },
    {
        "author": "douggilmour93",
        "body": "AMD to $100 by year end",
        "created_utc": 1587095509,
        "id": "fnnlxua",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1587124309.0
    },
    {
        "author": "Shvabicu",
        "body": "I'm a europoor and play with different derivatives than US options, but this is intriguing stuff.\n\nLemme see if I got that right: You buy for example a 100 shares and then write a covered call at the price you bought. You rake in the premium. If you get assigned because it went up, you miss out on the capital gains, but are still up because of the premium. If AMD tanks and the option expires worthless, you're bagholding the shares, but at least you raked in the premium and can do the same shit again.\n\nSo the risk you have is losing more money due to capital depreciation of the shares than you can make up with premiums?",
        "created_utc": 1586940859,
        "id": "fngq68p",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1586969659.0
    },
    {
        "author": "jakedasnake011",
        "body": "Tickers I've learned not to fuck with ever again in the past year:\n\n* DIS\n\n* NFLX\n\n* UBER\n\n* LYFT\n\n* SNAP\n\n* MU\n\n* PTON\n\n* ROKU\n\n* Any weed stock ever\n\n* AMD gets special mention too",
        "created_utc": 1585766539,
        "id": "fm556nk",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1585795339.0
    },
    {
        "author": "i_iz_potato",
        "body": "I went full autist today, meant to buy AMD calls when it hit 44....realized an hour later I had bought puts. Made profit.",
        "created_utc": 1585784092,
        "id": "fm613x3",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1585812892.0
    },
    {
        "author": "MustWarn0thers",
        "body": "After getting burned by positive earnings reports I think I've got this shit figured out. It's so fucking easy now I can't believe I've lost money.\n\nAll companies are facing some degree of economic hardship from Tecate Cancer. That's the baseline. If you have a strong feeling a company will report positive earnings but didn't have to endure significant reduction in operations, you buy puts for post earnings. Companies that show even slight weakness regarding 2nd and 3rd quarter outlook, even if they will grow are trash.\n\nIf the company already got its ass kicked by the virus and will continue to get its ass kicked, and you think they'll withdraw guidance, buy calls.\n\nShit is so simple. Intel? Hope you had puts. AMD for April 28th? Definitely puts. Microsoft? Get those puts. MGM? Burning cash, who knows when crowds will feel comfortable at casinos this year. Load up on calls on the 30th.",
        "created_utc": 1587688263,
        "id": "fodqlki",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1587717063.0
    },
    {
        "author": "CurtHolls5",
        "body": "Alright boys I was bored and for my own sake compiled a tiny list, save this comment or copy this list if you haven't already... next week is gonna get crazy \n\nBefore Bell Monday: meh not much\n\nAfter Bell Monday: **Alphabet**\n\nBefore Bell Tuesday: UPS, CAT, JetBlue, BP, Mastercard, 3M\n\nAfter Bell Tuesday: **AMD**, United, **SBUX**, Ford\n\nBefore Bell Wednesday: **Boeing** (here we go), **GE**, **RCL**, Anthem, Blue Apron\n\nAfter Bell Wednesday: **TSLA, MSFT**, **FB**, PayPal, Qualcomm, **Sprit**, eBay\n\nBefore Bell Thursday: **TWTR**, MCD, Altria, Valero\n\nAfter Bell Thursday: **AMZN, AAPL, VISA**, Gilead\n\nBefore Bell Friday: Exxon, Chevron, Honeywell",
        "created_utc": 1587769055,
        "id": "fohnm2n",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1587797855.0
    },
    {
        "author": "PatrickBitmain",
        "body": "When the second wave outbreak comes the market will drop up to 20% again, even worse for some companies\n\nAAPL 235\n\nAMD 41\n\nNFLX 370\n\nUBER 17\n\nDIS 90\n\nTSLA will keep having 60% swings up and down because it's a meme stonk with cooked books and Musk's Chinese partners are using it as a pump and dump to rob Americans.",
        "created_utc": 1586936930,
        "id": "fngmb7h",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1586965730.0
    },
    {
        "author": "shacoand2boxes",
        "body": "AMD is officially not a meme stock. Let’s be real boys. That shit has earned its spot as a solid motherfucker.",
        "created_utc": 1586964033,
        "id": "fnhkeoc",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1586992833.0
    },
    {
        "author": "Acidbait",
        "body": "6/19 MSFT 250c 300 contracts\n\n5/15 AMD 90c 100 Contracts\n\n5/1 BA 160c 6 contracts\n\n4/24 BA 200c 167 contracts (yolo)\n\n5/15 BRK.B 210c 20 Contracts\n\n5/4 SPY 240p 10 contracts\n\n5/15 RTX 80c 20 contracts \n\n5/15 AAPL 330c 25 contracts\n\n5/15 DIS 140c 300 contracts\n\n6/19 GUSH 5p 50 contracts (yolo)",
        "created_utc": 1587503250,
        "id": "fo4f1xz",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1587532050.0
    },
    {
        "author": "aquagardener",
        "body": "Fuck you SPCE. Fuck you ROKU. Fuck you AMD. Fuck you SPY. Fuck you USO.\n\nHow can I literally be wrong 100% of the time?",
        "created_utc": 1587056001,
        "id": "fnlmdpl",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1587084801.0
    },
    {
        "author": "12A1313IT",
        "body": "Lemme know how shorting TSLA and AMD goes for you, tbh the market is more about identifying trends. There are people on here with the right amount of autism and retardation who catch the trends and make bank. For example the guy that held his AMZN leap from 3/18 for 1 mil.",
        "created_utc": 1587858898,
        "id": "folbsvu",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1587887698.0
    },
    {
        "author": "ReedSharkSlasher",
        "body": "Before Corona hit I was using duolingo learning spanish quickly.  Now that Corona is here I been reading stocks stuff non stop.  So far I dumped some amd and snap stocks for cash to hope to buy lower and mess with options.  But they are now about 8k higher from my sell point.  So basically I would be 8k richer and know Spanish. Instead, I'm 8k poorer and learned nothing.",
        "created_utc": 1588053381,
        "id": "fotgnzn",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1588082181.0
    },
    {
        "author": "Wadsworth_Algorithm",
        "body": "From March 3- March 23, everything got priced in. Analyst forecasts of the country opening up, Q1 earnings prediction etc. Within these 20 days everything got priced in. There are no more declines.\n\n\n\n\nIt can only go up. Unless some catastrophic event like an asteroid or massive tectonic disruption happens, stocks will only go up. \n\n\n\nLook at AMD with a PE ratio of 180+ and about to hit all time highs. Even with record unemployment, constrained supply chains and reduced consumer spending - the stock is trading pre-crash levels already",
        "created_utc": 1587039095,
        "id": "fnkt01q",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1587067895.0
    },
    {
        "author": "wikifeetarchivist",
        "body": "AMD will be green by tomorrow open and if i'm wrong i'll just delete this comment :)",
        "created_utc": 1588110185,
        "id": "fovzc89",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1588138985.0
    },
    {
        "author": "thehenrylong",
        "body": "Since this sub has gone to shit allow me to offer some advice. \n\nPick which direction you feel like the tickers are going, buy shares for them to build out a portfolio. If you want to play oil do XOM or MRO. If you want to do tech do AMD, NVDA, MSFT, AAPL or whatever. Then buy puts against the shares so if we do go down soon you’ll have cash to buy more shares on down days. Over time you’ll be rich, alternatively buy long calls instead of shares. Always at least a month out. \n\n\nBuy the oil dip, airline dip, hotel dip. But don’t expect bug returns in the short term. \n\nFinally. Don’t listen to advice on this sub. The confirmation bias here is god tier.",
        "created_utc": 1587411685,
        "id": "fo0ekkz",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1587440485.0
    },
    {
        "author": "Roxorek",
        "body": "1 year performance\n\nTSLA +184%\n\nSHOP +183%\n\nAMD +102%\n\nGold miners +60%\n\nPalladium +43%\n\nGold +34%\n\nNflx +15%\n\nNasdaq +10%\n\nSilver +1.5%\n\nS&amp;P 500 -4%\n\nCopper -20%\n\nRussell 2000 -23%\n\nNatural gas -28%\n\nOil -74%\n\nAurora Cannabis -92%",
        "created_utc": 1587728637,
        "id": "fof7iax",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1587757437.0
    },
    {
        "author": "KickBassColonyDrop",
        "body": "Options are called options for a reason, they are choice flexible. Oil futures are contract speculation. You're betting on movement of oil. End of April contracts expired less than worthless cause the virus grinded transports to a halt. Thus too much supply and no demand.\n\nHis max loss isn't the premium paid, it's that + the cost of movement of that oil. Options give you the right but not the obligation. Futures contracts as I understand it, don't give you a right, only an obligation. If you play around with these, you are doing so with an understanding that you are responsible for the underlying security.\n\nIf you buy AMD calls, and they expire worthless. You lose only the premium paid for it. You are not responsible for the movement of (hypothetically) all the chips that amount of stock would buy you in equivalent cash.\n\nIf you buy oil futures, it doesn't matter if they're OTM/ITM or expire worthless. You're on the hook for movement of the material goods. That's also because oil is a tangible material that needs specialized equipment to transport and store in a legally and environmentally proper way. You can't just fill your pool up with it. The fumes will kill you, your mom, her boyfriend, and all the trees within a few dozen yards of your house.\n\nAnd unlike gold, which if you were theoretically responsible for, you can't just dump it onto the ground of your backyard. Doing so sets you up for legal suits from the county, state, federal or all of them in precession.\n\nThis guy literally just ended his economic life.\n\n*Caveat: I don't know shit about how any of this works, but basic fucking googling and having more than two brain cells, has taught me enough to just stick with stocks and options, and don't go fuck around with shit I don't fundamentally understand.",
        "created_utc": 1587438478,
        "id": "fo1pi74",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1587467278.0
    },
    {
        "author": "Desmater",
        "body": "Looking like AMD 60 C 4/17 will print.",
        "created_utc": 1586920916,
        "id": "fng2p4l",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1586949716.0
    },
    {
        "author": "Dreadster",
        "body": "Buying a company at rock bottom is not as easy as it seems. I got into AMD starting at $9-10, and it was super rocky even then. Had to go through highly volatile periods where you’re second guessing yourself and getting bombarded by analysts and people online shrieking about P/E ratio and shitting on the company (they still do now, albeit substantially less). It takes a lot of fortitude to stick with it. There’s no such thing as easy money. The reason why you’re getting paid very high multiples in returns is because of the risk and volatility you took on, as well as your patience. Getting lucky is of course also a part of it",
        "created_utc": 1586989777,
        "id": "fnj0p6d",
        "score": 14,
        "subreddit": "stocks",
        "created": 1587018577.0
    },
    {
        "author": "LactobaSILLY",
        "body": "Intel is getting shit on by apple producing their own chips soon and heavy competition from AMD which companies are starting to shift to it seems. Didn’t help that they declined to give rest of year guidance but still surprised how it’s dipping when still beat expected eps and revenue. Shits weird right now.",
        "created_utc": 1587672955,
        "id": "focm3wr",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1587701755.0
    },
    {
        "author": "manamono",
        "body": "AMD single-handedly wiped all my profits within two trades bros. I hate life.",
        "created_utc": 1588106451,
        "id": "fovrvir",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1588135251.0
    },
    {
        "author": "SixthSigmaa",
        "body": "People are buying AMD near it's ATH at the beginning of a global recession... can't make this up",
        "created_utc": 1587051115,
        "id": "fnlcic7",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1587079915.0
    },
    {
        "author": "Tecashine",
        "body": "AMD about to announce 40 billion profit for the quarter.\n\nMarket drilling on the news that AMD will no longer be eligible for the Feds 10 trillion stimulus package.",
        "created_utc": 1588105733,
        "id": "fovqexz",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1588134533.0
    },
    {
        "author": "KX9lol",
        "body": "Alphabet earnings call: https://www.youtube.com/watch?v=YkrYz_vD_0E\n\nAMD: https://ir.amd.com/upcoming-events\n\nSimpBux: https://investor.starbucks.com/ir-home/default.aspx",
        "created_utc": 1588104839,
        "id": "fovol9o",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1588133639.0
    },
    {
        "author": "LactobaSILLY",
        "body": "Intel is getting shit on by apple producing their own chips soon and heavy competition from AMD which companies are starting to shift to it seems. Didn’t help that they declined to give rest of year guidance but still surprised how it’s dipping when still beat expected eps and revenue. Shits weird right now.",
        "created_utc": 1587672932,
        "id": "focm1l6",
        "score": 14,
        "subreddit": "stocks",
        "created": 1587701732.0
    },
    {
        "author": "mirkw00d",
        "body": "I waited a week to buy an $AMD 47P when it hit 50 yesterday, fuck me",
        "created_utc": 1586885867,
        "id": "fneafk4",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1586914667.0
    },
    {
        "author": "AloneForever",
        "body": "Buy Amazon, Microsoft, AMD, Netflix, and Tesla calls. It's just that easy bro.",
        "created_utc": 1587051418,
        "id": "fnld386",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1587080218.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "i had goog puts amd calls and sbux calls. im the best investor there is.",
        "created_utc": 1588105876,
        "id": "fovqpik",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1588134676.0
    },
    {
        "author": "controlladelete",
        "body": "My AMD puts were up 80% earlier and now it's -15%. I should've locked in the profits 🤡🤡🤡",
        "created_utc": 1587485112,
        "id": "fo3dnmb",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1587513912.0
    },
    {
        "author": "pacatak795",
        "body": "Intel has been losing market share to AMD for a while now. If Apple starts putting their own chips in low- to- mid-range laptops, and they're any good, that's terrible news for Intel.",
        "created_utc": 1587676465,
        "id": "focvl96",
        "score": 13,
        "subreddit": "investing",
        "created": 1587705265.0
    },
    {
        "author": "dhmzr",
        "body": "Grabbed AMD 55p at 3:59. WHOS THE RETARD NOW DAD?",
        "created_utc": 1588105975,
        "id": "fovqwpz",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588134775.0
    },
    {
        "author": "girthybearschlong",
        "body": "Some companies are breaking ATH's right now... SHOP after hours is at ATH...AMD at ATH...AMZN at ATH...NFLX at ATH...the market is completely unhinged from reality.  Stock price is no longer driven by the companies earnings and revenue.",
        "created_utc": 1587086827,
        "id": "fnn8nge",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1587115627.0
    },
    {
        "author": "hughesmaxwell",
        "body": "Yes, buy 500 shares of AMD",
        "created_utc": 1586919630,
        "id": "fng0qem",
        "score": 13,
        "subreddit": "stocks",
        "created": 1586948430.0
    },
    {
        "author": "ballllllllllls",
        "body": "AMD posts solid earnings and guidance and drops like a rock? Buy in this week boys, it's headed to the 60s.",
        "created_utc": 1588107408,
        "id": "fovtthi",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588136208.0
    },
    {
        "author": "markthemarKing",
        "body": "People will fomo into Google calls tomorrow and get screwed. They're going to fall for the ol pump and dump\n\nPeople will fomo into AMD puts tomorroe and get screwed. They're going to fall for the ol rope a dope",
        "created_utc": 1588116413,
        "id": "fowb6ip",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588145213.0
    },
    {
        "author": "justwanttopost1thing",
        "body": "Before I get into how I’m gonna fuck myself tomorrow. Let me start with how I fucked myself today. \n\nI took a lot of preworkout then proceeded to just obsess over the market instead of workout. \n\nFirst I’m holding 5 275c 4/9 SPY last night before closing. I sell before EOD pump for a 90% profit. \n\nWake up this morning and that same play would’ve netted me over 2grand if I wasn’t such a paper handed cuck and held it over night. \n\nSo I say fuck it AMD puts I’ll ride the wave down. Boom AMD starts rising so I switch to calls, boom AMD starts falling like a mother fucker let me get back on puts - I lose 50% of my account in 2 hours.  I never fucking act like this but I was so yeeted on preworkout I couldn’t relax - puts, calls, puts, calls.\n\n\nSo here the fuck I am with 3 AMD 42P 4/17 and maxed out on my mother fucken day trades.\n\nJesus.",
        "created_utc": 1586300796,
        "id": "fmqjfwk",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1586329596.0
    },
    {
        "author": "SDuckworth12",
        "body": "Visa\nMasterCard\nFacebook\nMicrosoft\nApple\nStarbucks\nMcDonald’s \nAmazon \nSquare\nAMD/NVIDIA\nShopify\nDisney \nAlibaba\nGoogle",
        "created_utc": 1587067881,
        "id": "fnmadva",
        "score": 12,
        "subreddit": "stocks",
        "created": 1587096681.0
    },
    {
        "author": "TendiesOnMargin",
        "body": "AMD Quad Witching so hard rn",
        "created_utc": 1588106181,
        "id": "fovrbr2",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588134981.0
    },
    {
        "author": "RANDY_MAR5H",
        "body": "I did. That's how this all started.\n\nI bought 20 AMD shares TWO days before the crash. First day I made like 2-3 bucks a share.\n\nLiterally the day after is when it crashed. I opened RH to see what's going on, came on here (because I lurked before) and I saw everyone saying \"JUST BUY OTM NAKED PUTS. CAN'T LOSE.\" Did 15 minutes of research about strikes and dates and OTM/ITM/ATM and puts and calls.\n\nOn 3/20 I went from $850~ to $7800 and should have went to shares again. But instead I kept being a gay bear idiot retard and lost $7k.\n\nHere I am back at my initial $800~.\n\nI would have been better off selling my shares when the market dipped, waited and bought at the low for AMD OR just DCA'd the whole time.\n\nNow i'm a degen",
        "created_utc": 1587861462,
        "id": "folg2a4",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1587890262.0
    },
    {
        "author": "jmeloso",
        "body": "I am long AAPL, MSFT, AMZN, GOOG, FB, NVDA, AMD, NFLX, BABA, ADBE, JPM, BA, TSLA.  Also recently purchased 12/31 270 SPY calls.\n\nI doubled down after the drop and my portfolio is doing better than ever.\n\nStop gambling and start investing and you’ll make money retards.   This was one of the best buying opportunities ever.",
        "created_utc": 1587089807,
        "id": "fnnde0g",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1587118607.0
    },
    {
        "author": "bdepz",
        "body": "ADVANCED MICRO DEVICES",
        "created_utc": 1586904720,
        "id": "fnfb34r",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1586933520.0
    },
    {
        "author": "munny_munny",
        "body": "AMD has burned me and paid me so many times it's like getting divorced and remarried all over again.",
        "created_utc": 1588114986,
        "id": "fow8j2f",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588143786.0
    },
    {
        "author": "ChoochMMM",
        "body": "\"Yes Mr. Powell, ChoochMMM from Reddit. Can you announce that AMD is becoming the soul provider of chips and computing power for your Infinity Wars printer, thanks\"",
        "created_utc": 1588185816,
        "id": "foz763z",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588214616.0
    },
    {
        "author": "dadftendirekt",
        "body": "TSLA calls are like the 10/10 chick who does anal on the first date while AMD calls are the frumpy 5/10 who has a bigger dick than you",
        "created_utc": 1588195826,
        "id": "fozrz1q",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588224626.0
    },
    {
        "author": "IndianaBW",
        "body": "if amd goes up tomorrow I will have a full stream of car exhaust B-lining right out of my asshole",
        "created_utc": 1587502871,
        "id": "fo4eay2",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1587531671.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "TELL EM MANGO \n\nWE READY TO ROCK !!! \n\n🔥🔥🔥🔥🔥💵💵💵💵🖨💵💵💵💵💵💵💵\n\nALEXA PLAY “ I WANAN ROCK BY TWISTED SISTA \nAMD$ to the fucken moon \n\nPEE PEE POWER!!!!!!\n\nFIST IN BEAR ASS\n\nNO FEAR !!!\n👊👊👊👊👊👊👊👊👊👊🇺🇸🇺🇸🇺🇸❤️❤️🦅🦅🦅🦅🦅🦅🦅🦅",
        "created_utc": 1586820506,
        "id": "fnbqtrb",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1586849306.0
    },
    {
        "author": "MetalliTooL",
        "body": "I have AMD calls and GOOGL puts.  Nice.",
        "created_utc": 1588110606,
        "id": "fow0691",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588139406.0
    },
    {
        "author": "Cocaine_Addiction",
        "body": "I miss the old Su Bae, SOXL boost Su Bae\n\nChop up the Si Su Bae, outperforms her earnings Su Bae\n\nI hate the new Su Bae, the bad news Su Bae\n\nThe always miss Su Bae, dip in the charts Su Bae\n\nI miss the sweet Su Bae, AMD beats Su Bae\n\nI gotta say at that time I'd like to meet Su Bae",
        "created_utc": 1588122627,
        "id": "fowmctq",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588151427.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Yeah saw some guy posting in the daily thread asking if his 160 strike AMD calls were going to be profitable. I swear some people in this sub just see a ticker and throw in their money first and ask questions later (typically after they lost all their money).",
        "created_utc": 1588116857,
        "id": "fowc00k",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588145657.0
    },
    {
        "author": "Kramnet",
        "body": "Everyone: AMD AMD AMD FUCK YEAH\nMe: *buys amd calls*\nAMD: everyone but you bitch, *dips to the balls*",
        "created_utc": 1587068784,
        "id": "fnmc63d",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1587097584.0
    },
    {
        "author": "battlesubie",
        "body": "Thinking about cashing out the 100k that I’ve made in the past month and just buying 2,200 shares of AMD and peacing out until this settles down.",
        "created_utc": 1585791853,
        "id": "fm6dt51",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1585820653.0
    },
    {
        "author": "soupofbowl",
        "body": "amd puts, it mooned ✔️\n\nzm puts, it mooned ✔️\n\ngme puts, it mooned ✔️\n\njnj calls, it tanked ✔️",
        "created_utc": 1586810113,
        "id": "fnb6l9t",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1586838913.0
    },
    {
        "author": "old-wizz",
        "body": "You can earn it back: get calls on tesla, xbi, beyond meat, shopify and amd",
        "created_utc": 1587655569,
        "id": "fob30k7",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1587684369.0
    },
    {
        "author": "TummyAcheJake",
        "body": "AMD .18 per share\n\nhttps://ir.amd.com/news-releases/news-release-details/amd-reports-first-quarter-2020-financial-results",
        "created_utc": 1588105735,
        "id": "fovqf1s",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1588134535.0
    },
    {
        "author": "theycallmeyoon",
        "body": "Sold my $1000 TSLA call  exp 10/16 at a 45% loss today and bought AMD $60C  Jan 2022 and MSFT 270C Sep 2022. Lol. F",
        "created_utc": 1585860289,
        "id": "fm9256d",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1585889089.0
    },
    {
        "author": "asianboydonli",
        "body": "Intel beat earnings...and tanks... and drags amd and nvda with it rip",
        "created_utc": 1587672900,
        "id": "foclxw3",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1587701700.0
    },
    {
        "author": "ColdManWinters",
        "body": "the year is 2021 MSFT is trading at 420 P\\E, AMD at 4206.9, Beach access real estate is booming in Philadelphia and the Yellowstone sinkhole has swallowed much of the rocky mountains. \n\nTesla is now a 6500 stock, Elon Musk declares the upcoming Q4 will be when the company will finally turn their first profit due to their foresight in building tunnel access to major cities to avoid exposing citizens to the elements.",
        "created_utc": 1586204123,
        "id": "fmmf3k6",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1586232923.0
    },
    {
        "author": "wra1th3_Ai",
        "body": "My first two stock picks ever were AMD and MU. Still my two best stock picks percentage wise. I bought AMD at $4 and sold at $12, of course this would have been way better had I just held onto it. I bought MU at $10 and sold at $55 and since have picked it up again at like $52 or something. A third really good one I had was LULU before the crash.",
        "created_utc": 1586980743,
        "id": "fniiu7u",
        "score": 11,
        "subreddit": "stocks",
        "created": 1587009543.0
    },
    {
        "author": "ReedSharkSlasher",
        "body": "I sold amd at 46 after holding since 10.  It's at 55 now and I'm immensely bitter.  Time to buy it at 55 and have it drop to 30 to wipe out my gains",
        "created_utc": 1587010268,
        "id": "fnjysut",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1587039068.0
    },
    {
        "author": "RfLock7",
        "body": "Rona make people stay inside use computer\n\nAMD make computer fun \n\nAMD make money",
        "created_utc": 1587036298,
        "id": "fnkpwro",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1587065098.0
    },
    {
        "author": "homebrewer222",
        "body": "My portfolio value today with AMD calls and SPY puts looks like a crackheads heart rate monitor",
        "created_utc": 1587652733,
        "id": "foaukhh",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1587681533.0
    },
    {
        "author": "be_o3",
        "body": "\\+$6,915.57 on AMD in one day",
        "created_utc": 1586877642,
        "id": "fnduc5u",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1586906442.0
    },
    {
        "author": "CptTonyStark",
        "body": "Glad I didn’t end up getting AMZN 5/1 2600c and V 5/1 185c that I was thinking long and hard about. After watching NFLX INTC and AMD, I realized earnings are just a gamble and decided against betting on them. \n\nI’m temporarily quitting trading to focus on other hobbies like guitar and getting 6 pack abs, I will be back in a month or so. I made 17k in profits in 2 months thanks to this sub and I have left 1k in my RH to start over when I return. \n\nThis sub has helped me get through some tough times and I’ll always love all of you tards. Thank you all for everything, I hope u enjoy lots of tendies!",
        "created_utc": 1588278951,
        "id": "fp3gm2g",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588307751.0
    },
    {
        "author": "Tvekelectric",
        "body": "Idk about these weekly swings but all i know is next 10 years amd is going to crush it. So if you just want a good long term stock they are a great bet.",
        "created_utc": 1588135789,
        "id": "fox779j",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588164589.0
    },
    {
        "author": "randomcluster",
        "body": "Guys what's the ticker symbol for AMD?",
        "created_utc": 1588106929,
        "id": "fovsuiu",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588135729.0
    },
    {
        "author": "jackstocking",
        "body": "AMD will be green at open 🚫🧢",
        "created_utc": 1588106285,
        "id": "fovrjbv",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588135085.0
    },
    {
        "author": "Venally",
        "body": "I won't argue that tech is more resilient than other sectors at the moment, but as the other sectors are impacted, so will the tech that services them. Others have already pointed out inflated valuations and massive P/Es ($AMD, I'm looking at you), which rely on forward revenue and growth. With that being said, until Q2 earnings can reflect that / money starts rotating out of tech, I wouldn't bet on a massive $QQQ move.",
        "created_utc": 1586824324,
        "id": "fnbxkj1",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1586853124.0
    },
    {
        "author": "Btx452",
        "body": "&gt; I feel like if AMD earnings are really bad, then AMD puts would print. \n\nDamn, this is some galaxy brain analysis.",
        "created_utc": 1588018973,
        "id": "foruz63",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588047773.0
    },
    {
        "author": "realister",
        "body": "Apple AirPods business by itself is in Fortune 500 or a 32nd Largest Company in the U.S ahead of AMD and Motorola. \n\nAirPods generate more revenue than Twitter, Uber, Square, Snap, AMD or NVIDIA!\n\nCrazy how huge AirPods are.",
        "created_utc": 1587850607,
        "id": "fokx3rs",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1587879407.0
    },
    {
        "author": "wolfofnostreet100",
        "body": "Think amd and Microsoft calls for 5/1 and 5/15 will probably mean my account will go to 0.",
        "created_utc": 1587683672,
        "id": "fodegkr",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1587712472.0
    },
    {
        "author": "self-assembled",
        "body": "Intel's process lead is gone for good at this point.  Even matching TSMC in two years seems like unlikely, though possible, at this point.  This means AMD and ARM chipmakers will have access to better silicon than Intel, and will ultimately have better chips, regardless of design variation.  AMD is already producing objectively better processors for laptop, desktop and server.  Although they're growing earnings now as the market is adjusting, it can't continue as they will have to start lowering prices to reflect the fact that they've lost a market wide process lead.",
        "created_utc": 1587715824,
        "id": "foev4mi",
        "score": 10,
        "subreddit": "investing",
        "created": 1587744624.0
    },
    {
        "author": "SaltyTrident",
        "body": "Jokes on you I switched to all cash and long AMD calls today lmao. I’m gonna sleep like a mf baby",
        "created_utc": 1588191046,
        "id": "fozi4t0",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588219846.0
    },
    {
        "author": "swaggymedia",
        "body": "me too brother, need AMD to hit $70 so I can retire early.",
        "created_utc": 1588191819,
        "id": "fozjqhl",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588220619.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "AMD$ \n\n\nCompany is growing but I guess investors aren’t happy with 40% y/y. Maybe they wanted 140000% increase? *eyeroll*\n\n😅😅😅",
        "created_utc": 1588106031,
        "id": "fovr0t2",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588134831.0
    }
]