[
    {
        "author": "Laminar_flo",
        "body": "I’m a PM at a hedge fund (although I’m credit side). \n\nYou all are fucking retarded. The SPY *IS NOT THE FUCKING MARKET!!!* The SPY is also *NOT THE FUCKING ECONOMY!!!* \n\nThis obsession with SPY Puts and ‘Short the SPY’ is beyond fucking stupid to the point that *actual* traders are laughing at you all. \n\nThink about it: in the US there are about 12M ‘operating companies’ (eg ‘companies’ as you think of them). Only about 6,000 companies are public and the *biggest* 500 (or so) compromise the SPY. \n\nAre you seeing where this is going yet? You all are shorting the 500 companies *that are best positioned to, not only survive this, but THRIVE in the post-corona economy.* They have the best capital access, the best size, the best market position....I can keep going. The companies that comprise the SPY are going to survive, particularly the top ~100 or so that comprise 80% of the SPY action.\n\nWhat the fuck are you retards thinking shorting those companies?? Why the fuck are you ***SHOCKED*** you are losing money? WSB: “See that ETF that is comprised of the companies best positioned to go up?I’m betting my life savings on Puts.” If one of my analysts came to me with that thesis, I’d assume they had brain damage and fire them. \n\nThere are *obvious* shorts out there. I’m not giving specific names but first off, get the fuck away from large caps and start thinking about S/Mid caps that service those 12M operating companies that are fucking hating it right now.\n\nYou people getting lit on SPY puts are getting *exactly* what you should have expected.",
        "created_utc": 1588807740,
        "id": "fpprhpp",
        "score": 238,
        "subreddit": "wallstreetbets",
        "created": 1588836540.0
    },
    {
        "author": "centaursteve",
        "body": "Good evening gentlemen,\n\nHad a hell of a year so far getting beat down doing various yolos. I would have some small wins, sold many potential big wins too early, and lost my ass playing ERs.  Before this week I was down about 50k and was depositing 5k every week trying to get my tendies back. This last 5k I deposited on Monday was going to be my last hoorah before I hung the gloves up. I played DDOG ER, saw the lackluster AH and thought I was boned. Woke up the next day to some good gains and decided to go all in on SPY on 1DTE puts believing it was going to dump. Like the true degenerate that I am I wanted to get rich or lose it all. Moral of the story, sometimes stonks do go down. \n\nPositions:\n\nDDOG 5/15 70c (65 contracts)\n-Bought for $0.65 on 5/11\n-Sold for $2.30 on 5/12\n\nSPY 5/13 286p (422 contracts)\n-Bought for $0.29 on 5/12\n-Sold for $5.51 on 5/13",
        "created_utc": 1589416140,
        "id": "fqjwblb",
        "score": 228,
        "subreddit": "wallstreetbets",
        "created": 1589444940.0
    },
    {
        "author": "elevenbang",
        "body": "I got lucky off my initial gains from sub $100k to $450k off of SPY puts during the March fall to 220s. Then I fought the fed, kept fighting the fed, and lost...I got way too stubborn and didn't think it'd bounce so much. Take it as a lesson. Don't be hubris. Discipline yourself. Follow your rules. Cut your losses quickly. Write down everything you do wrong and learn from it. I'm taking a break.",
        "created_utc": 1589490219,
        "id": "fqn80ig",
        "score": 226,
        "subreddit": "wallstreetbets",
        "created": 1589519019.0
    },
    {
        "author": "elevenbang",
        "body": "Just adding on --\n\nSeriously guys. Be grateful for what you have. Don't risk more than you're willing to lose. Fortunately, this isn't everything in my name, but my soul is fucking crushed. But fuck it, I'm young and I still have a long road to go. Remember this a marathon, it's not a sprint. It's better to make a small amount and accumulate those wins over time than make huge, quick gains and to keep chasing that mentally. I let that get to me. Chasing greed and big profits instead of taking small gains and capitalize on that. Don't fly too close to the sun.",
        "created_utc": 1589490855,
        "id": "fqn9b5n",
        "score": 210,
        "subreddit": "wallstreetbets",
        "created": 1589519655.0
    },
    {
        "author": "GlassWeird",
        "body": "The conservative cucks are eating it up too. I think this is part of a big brain strategy to sell musk's freedom mobiles to the real 'mericans",
        "created_utc": 1589232527,
        "id": "fqb8ol7",
        "score": 191,
        "subreddit": "wallstreetbets",
        "created": 1589261327.0
    },
    {
        "author": "VanHinten7",
        "body": "The USO guy is actually retarded. I love it",
        "created_utc": 1589835028,
        "id": "fr2cps2",
        "score": 187,
        "subreddit": "wallstreetbets",
        "created": 1589863828.0
    },
    {
        "author": "smileedude",
        "body": "The shrimp yesterday was wrong so I'm ingesting it",
        "created_utc": 1589403257,
        "id": "fqj06kz",
        "score": 187,
        "subreddit": "wallstreetbets",
        "created": 1589432057.0
    },
    {
        "author": "JeanClaudeRumHam",
        "body": "It's easy to predict Tesla moves. Just think, \"How do the Musk worshipers feel about it?\" Threatening to move Tesla is financially stupid and illogical but the Tesla gang loves this move. Because it's Musk sticking it to those corrupt assholes running California who are only interested in lining their pockets with healthy citizens.",
        "created_utc": 1589059063,
        "id": "fq2rzzv",
        "score": 186,
        "subreddit": "wallstreetbets",
        "created": 1589087863.0
    },
    {
        "author": "captaintrips420",
        "body": "Gotta love how easy it is to lead American top minds in whatever circles some choose.",
        "created_utc": 1589237946,
        "id": "fqbj4oh",
        "score": 154,
        "subreddit": "wallstreetbets",
        "created": 1589266746.0
    },
    {
        "author": "Xerxys",
        "body": "It would cause a lot of controversy arresting a working African American.",
        "created_utc": 1589249878,
        "id": "fqc4dyj",
        "score": 143,
        "subreddit": "stocks",
        "created": 1589278678.0
    },
    {
        "author": "Startspillowfights4",
        "body": "He’s selling the contracts for a profit because they increased their premium price.\n\nIf you subtract the total value from the total return you see he invested around $2700.\n\n$2700 divided by 10 contracts of 100 shares works out to a premium of $2.70 per share.\n\nHe was able to buy these contracts at such a low premium because it didn’t seem likely a stock would double in price in the next couple of months.\n\n5 of his contracts are now selling for a premium of 122.50 and 5 contracts are selling for a premium of 153.15.\n\nSo to resell the contracts (5contracts X 100shares X 122.50) equals $61,250 \n\nAnd 5 contracts X 100 shares X 153.15 equals $76,575.\n\nAdd $76,575 and $61,250 together to get $137,825.",
        "created_utc": 1588817503,
        "id": "fpq8tnd",
        "score": 137,
        "subreddit": "wallstreetbets",
        "created": 1588846303.0
    },
    {
        "author": "v0rt",
        "body": "Participation trophy were invented by boomers. Then they turn around and make fun of their kids/grandkids for it. It's the dumbest generation we've ever had.",
        "created_utc": 1590785989,
        "id": "fs8o7lw",
        "score": 133,
        "subreddit": "wallstreetbets",
        "created": 1590814789.0
    },
    {
        "author": "motley_bruin",
        "body": "“I can make it back” a retards dying words",
        "created_utc": 1590537223,
        "id": "frxciiv",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1590566023.0
    },
    {
        "author": "PetetheJuggler",
        "body": "Dow who? Jones? Tremendous guy. Tim Apple, Marilyn Lockheed, tremendous companies. Seriously some of the best. So we’re taking a big look- a really serious look- at some of the stuff we’re seeing come out of the Dow. Really remarkable. Thought it was just a chemical company you know, some of the strongest, I mean, really strong disinfectants, like bleach or formaldehyde, and so once Mr. Jones really gets going and we can reopen some states you’ll be able to really attack this virus, and I mean really attack- perhaps kill- this virus. This, invisible enemy. Really that’s what it is. It’s invisible. But we’re taking a look at it and a lot of different things and I think the American people are really going to like what they see.",
        "created_utc": 1590515868,
        "id": "frw5uxx",
        "score": 124,
        "subreddit": "wallstreetbets",
        "created": 1590544668.0
    },
    {
        "author": "ObscureWhistle",
        "body": "Extra Credits did a pretty good series on it.\n\nI shit you not, the company could only send something like one ship per month, twelve ships per year to the entirety of the South American Ports. \n\nTo compare, fleets of ships were being sent to India to simply maintain the supply and trade going on there - the company’s scheme was completely FUCKED.\n\nBut the company was like “it’s fine, everything’s fine” the stock value increased, the ENTIRE COUNTRY bought into it, LOANS were being taken to buy more shares! It got so huge that the government had to shut down private entrepreneurs because they were taking away from buying shares. RE: there was not enough money in circulation to allow for other startups because they needed all the money for this company that DOESNT ACTUALLY MAKE ANY MONEY!\n\nAnd then it failed and everyone lost their stuff!\n\nThis is the second funniest shit I’ve ever heard of. \n\nThe first was the Viking that killed his rival, let the guy’s head hang from his saddle, only to get an infection from the head’s buck-teeth and die three days later.\n\nNow *that* is some autist level shit!\n\n[South Sea Bubble](https://www.youtube.com/playlist?list=PL931Bkj5KLMtJ4AMegQtekqKcCy14FCec)\n\nTLDR; \n\n1) Don’t cut off a guy’s head and tie it to a saddle bag - that’s disgusting and it’s not social distancing. \n\n2) Don’t take economic advice from a guy who’s know for: an apple falling on his head, creating a universal gravitational theory, and being COMPLETELY FUCKING INSANE! \n\n3) Finally, get a DNA for all your children. Hey, someone might be fucking your wife, but you won’t have to pay child support! Fuck the house, those monthly payments add up!\n\nEDIT: For the memes (also, a moment of silence for me and all of the brothers who have STNG and EURN shares. We will rise again, someday).",
        "created_utc": 1589082697,
        "id": "fq4ruu6",
        "score": 122,
        "subreddit": "wallstreetbets",
        "created": 1589111497.0
    },
    {
        "author": "Jsp51",
        "body": "I remember when I dropped $200 on a put and the exhilaration seeing its value go up 53% and disappointment seeing it go down to 0% next day",
        "created_utc": 1590537344,
        "id": "frxcqgj",
        "score": 121,
        "subreddit": "wallstreetbets",
        "created": 1590566144.0
    },
    {
        "author": "toothbrush6969",
        "body": "imma keep it real with u chief, i have no clue what im looking at",
        "created_utc": 1588706044,
        "id": "fpl45u1",
        "score": 120,
        "subreddit": "pennystocks",
        "created": 1588734844.0
    },
    {
        "author": "FishBowlLegend",
        "body": "2 red days? I don’t believe it. But the dog has spoken",
        "created_utc": 1590091562,
        "id": "frdkn7t",
        "score": 117,
        "subreddit": "wallstreetbets",
        "created": 1590120362.0
    },
    {
        "author": "BankComplianceIdiot",
        "body": "The first rule of being extremely online is don’t ever reveal your power level to a normie. This was true before everyone saw fight club and it will be true until the internet is gone.",
        "created_utc": 1589488805,
        "id": "fqn52gy",
        "score": 113,
        "subreddit": "wallstreetbets",
        "created": 1589517605.0
    },
    {
        "author": "santropy",
        "body": "When I bought puts it sky rocketed, today I bought calls and it tanked. Wtf kind of luck is this?",
        "created_utc": 1589317821,
        "id": "fqf2wyx",
        "score": 113,
        "subreddit": "wallstreetbets",
        "created": 1589346621.0
    },
    {
        "author": "Bloodier_Whisper",
        "body": "I figured it was like Dairy Queen or something like that",
        "created_utc": 1589233320,
        "id": "fqba93v",
        "score": 107,
        "subreddit": "wallstreetbets",
        "created": 1589262120.0
    },
    {
        "author": "Something_About_Mory",
        "body": "Paying 35k for a 70k car is actually genius. Probably gonna sell it right after buying for that easy x2",
        "created_utc": 1590797050,
        "id": "fs98qif",
        "score": 106,
        "subreddit": "wallstreetbets",
        "created": 1590825850.0
    },
    {
        "author": "HalfMoonCottage",
        "body": "If someone offers you $600M you take it and don’t ask any questions about interest. It’s their problem if it doesn’t work out. You got $600M.",
        "created_utc": 1590513533,
        "id": "frw0vs3",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1590542333.0
    },
    {
        "author": "DemPokomos",
        "body": "I am a frontline physician (internal medicine hospitalist) that cares for exclusively covid patients  I’ve seen over 75 covid cases and have had 8 deaths on my services to date. The work is very hard. I just received a 10% pay cut in addition to a huge benefit reduction composing about another 10% pay cut. It definitely sucks.",
        "created_utc": 1589491498,
        "id": "fqnamgr",
        "score": 102,
        "subreddit": "StockMarket",
        "created": 1589520298.0
    },
    {
        "author": "thatdude858",
        "body": "Good. Fuck these guys, over 15,000 family homes in San Diego were converted to full-time rentals. Those are homes out of the traditional long term renter market. Further driving up prices for everyone else looking for a long term lease. \n\nThese guys operate full-time mini hotels in residentially zoned areas. That would be akin to me opening up a restaurant in my kitchen or using my garage as a mechanic shop. \n\nThey make about 2.5x a month compared to a normal long term lease so I understand why they do it but more cities like Denver are bringing down the fucking hammer on these losers.\n\nI don't mind someone renting out a spare bedroom like an empty nester family if they have the space. Denver is enforcing a strict license process with an active reporting mechanism and government agency to deter these full time mini hotels, but they allow the spare bedroom as long as someone is home.",
        "created_utc": 1588720143,
        "id": "fplv9oj",
        "score": 95,
        "subreddit": "investing",
        "created": 1588748943.0
    },
    {
        "author": "CoupleOfBitches",
        "body": "I think you are falling short on the analysis.\nFirst, the stock market is not only for primary financing, there is also people trying to change their positions.\nSecond, if you make money by doing that, and then you decide to sell o whatever, you end up with more wealth to invest in whatever you want, say a house. The point of the stock market is not only to finance debt or equity in primary offers. Think about derivatives, and how it helps comoanies to manage certain risks...\nI think this is a pretty stupid article that just give the people the \"challenging the status quo speech\" they want to read.",
        "created_utc": 1590722115,
        "id": "fs5u43s",
        "score": 94,
        "subreddit": "StockMarket",
        "created": 1590750915.0
    },
    {
        "author": "battlesubie",
        "body": "If you Google \"Plunge Protection Team\" it says that they work exclusively in the futures market to manipulate the price.  Yes it is completely rigged AF",
        "created_utc": 1588894197,
        "id": "fptmsao",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1588922997.0
    },
    {
        "author": "Bobthebuilder24",
        "body": "Congrats, and f u. What an excellent/lucky call... But it paid off so doesn't matter",
        "created_utc": 1589416342,
        "id": "fqjwtcw",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1589445142.0
    },
    {
        "author": "Sjourn",
        "body": "My ISP asked me why I was cancelling my service with them.  I told them it was for religious reasons and that my pastor had advised me there were too many heathens on the web.  After about 5 seconds of silence and realizing they didn't have a response script for that, they said well we can certainly respect that and we'll close the account lol",
        "created_utc": 1590103918,
        "id": "fre8ffh",
        "score": 92,
        "subreddit": "stocks",
        "created": 1590132718.0
    },
    {
        "author": "theducatiguy",
        "body": "Look at the JPM $90 or $100 call for 18 Dec. You would have a break even of about $107 to $111. JPM looks like it is ready for a breakout. Strong downside resistance (support) between $90 - $100 so minimal downside risk with strong upside potential to $120 - $130. If JPM breaks out to $120 (20% upside), you are looking at 75% - 100% returns. If JPM returns to $130 range, you are looking in the 150% - 200% return range and JPM would still be $15 below its all time high. Lots of potential upside with manageable downside risk. Strong breakout potential based on last couple of days stock movement. MACD very positive! And you have 7 months to get from here to there.",
        "created_utc": 1590630737,
        "id": "fs1lq1p",
        "score": 92,
        "subreddit": "options",
        "created": 1590659537.0
    },
    {
        "author": "18845683",
        "body": "The W Bush wars and tax cuts ended that.  We really did need stimulus back then, but what we got was unfunded tax cuts from Bush and an asset bubble (courtesy of Clinton's Fed Chair and stewardship of Mae and Mac).  Oh well, nothing to be done about it.",
        "created_utc": 1588629538,
        "id": "fphxbrb",
        "score": 91,
        "subreddit": "investing",
        "created": 1588658338.0
    },
    {
        "author": "DongusMcLongus",
        "body": "It is a terrible point.  It once again puts Elon in this mythical place where his Twitter outbursts are carefully orchestrated 4D chess moves to ensure world takeover.  \n\nIt's bullshit.  He is just emotionally unstable",
        "created_utc": 1589235177,
        "id": "fqbdvja",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1589263977.0
    },
    {
        "author": "ALL_IN_LK_SHARES",
        "body": "Ethics aside, I don't think it's a good business decision to treat your employees like sh*t. It will eventually come back to haunt Amazon",
        "created_utc": 1588617525,
        "id": "fph9wky",
        "score": 89,
        "subreddit": "investing",
        "created": 1588646325.0
    },
    {
        "author": "busterwilliams",
        "body": "“When he seemed super out of it.”\n\nYou’re gonna have to be more specific.",
        "created_utc": 1589833741,
        "id": "fr2a3dj",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1589862541.0
    },
    {
        "author": "Equulei",
        "body": "In reality, this is actually their business model.\n\nDo you realize how many people are too lazy to cancel their $10/month Planet Fitness membership and are happy to deal with continuing to be charged so long as it means they don't have to walk into the gym and listen to a spiel on why they shouldn't cancel, sign documents, etc.",
        "created_utc": 1590092557,
        "id": "frdmm9e",
        "score": 87,
        "subreddit": "stocks",
        "created": 1590121357.0
    },
    {
        "author": "j_kouzmanoff",
        "body": "It is truly an honor.",
        "created_utc": 1588886286,
        "id": "fpt7mow",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1588915086.0
    },
    {
        "author": "Billie__Gates",
        "body": "r/investing: *\"Loving this solid 5.63%, the 33 million I inherited should be safe right?\"*\n\n\nr/personalfinance: *\"my wife and I make 850k a year. We have everything paid off and double that in savings. She has 300 dollars of student loans left and I think purchasing the new kia Telluride may push us off the brink into financial ruin. What should we do?\"*\n\n\nr/wallstreetbets: *\"lol my life is a joke and it's my last $2500. TSLA calls it is fuck it.\"*",
        "created_utc": 1589151739,
        "id": "fq7t95j",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1589180539.0
    },
    {
        "author": "Jowemaha",
        "body": "Musk to Musk: Oh boy when the stock hits $840 I can't wait to split\n\nAlso Musk: Wait until it hits $841.38",
        "created_utc": 1588371805,
        "id": "fp7jivr",
        "score": 86,
        "subreddit": "investing",
        "created": 1588400605.0
    },
    {
        "author": "scooby_deux",
        "body": "You gotta be smooth about it bro, ask her what she and her friends are buying lately, which apps are fave, who's her daddy, etc.  Then tell her the magic words: that you have drugs.",
        "created_utc": 1590713146,
        "id": "fs5enr2",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1590741946.0
    },
    {
        "author": "Lickmychessticles",
        "body": "Yeah seriously. It just went straight to zero. That’s hard to do.",
        "created_utc": 1589926662,
        "id": "fr6i2vq",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1589955462.0
    },
    {
        "author": "analogjesus",
        "body": "If loss porn doesn't make you feel better about your portfolio you are doing it wrong",
        "created_utc": 1589421961,
        "id": "fqk83dh",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1589450761.0
    },
    {
        "author": "Badrush",
        "body": "MSFT has a good chance to win the code development market,\n\n* Created VSCode (arguable the best IDE)\n* Created TypeScript (used widely in web development now)\n* Bought Github and made it better (unlimited private repos now)\n* Bought npm (leading package manager)\n\nEach year Microsoft seems to be doing all the right things to woo in developers into their eco-system or simply buying the leading companies in the space.",
        "created_utc": 1590516613,
        "id": "frw7fke",
        "score": 85,
        "subreddit": "investing",
        "created": 1590545413.0
    },
    {
        "author": "badtradesguy",
        "body": "you can amazon prime it right to the landfills",
        "created_utc": 1590629329,
        "id": "fs1j95g",
        "score": 84,
        "subreddit": "stocks",
        "created": 1590658129.0
    },
    {
        "author": "TheHidestHighed",
        "body": "&gt; Im just confused why /r/pennystocks has to focus on these extremely cheap pennystocks when there are real companies under $5 still that are in financial need and could grow overtime into something great\n\n\n\nBecause we're not here to support companies, we're here to make money. Full stop. I dont care if this company is going to cure cancer or if this guy lied and said it's going to cure cancer when all they've got is a new flavor of chewable vitamin, if that stock price goes up and I make a profit off of it, thats what I'm here for. Thats why the majority of us are okay with pumpers. Someone telling you when a stock is going to go up? Thats a fucking meal ticket, and for whatever reason a lot of people seem to be too good for that.",
        "created_utc": 1589408788,
        "id": "fqjeg3y",
        "score": 84,
        "subreddit": "pennystocks",
        "created": 1589437588.0
    },
    {
        "author": "yourdadmom",
        "body": "Because complaining over there only works if your truly willing to sacrifice.\n\n\nOver here in the us complaining does it in half the time,  threatening economic and legal retaliation cleans up the pesky other half.",
        "created_utc": 1589232368,
        "id": "fqb8d7d",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1589261168.0
    },
    {
        "author": "itachi12131415",
        "body": "Fine but if your dog is wrong you have to eat it",
        "created_utc": 1590025954,
        "id": "frathf1",
        "score": 83,
        "subreddit": "wallstreetbets",
        "created": 1590054754.0
    },
    {
        "author": "DayChamp",
        "body": "I think Due Diligence. Pretty much it’s when people do their own legitimate research, hence the “DD”, and making a post to let people know what they think might happen with any given stock. It’s either that, or it  means Doug Dimmadome, owner of the dimmsdale dimmadome.",
        "created_utc": 1589955560,
        "id": "fr7s09o",
        "score": 82,
        "subreddit": "wallstreetbets",
        "created": 1589984360.0
    },
    {
        "author": "fresh5447",
        "body": "Pro tip: The faster you try and make money, the faster you lose it.  \n\n\nBe patient, and take what the market gives you. Piece by piece.",
        "created_utc": 1589486924,
        "id": "fqn15no",
        "score": 82,
        "subreddit": "wallstreetbets",
        "created": 1589515724.0
    },
    {
        "author": "ondrvese",
        "body": "First and foremost, most likely the number of customers that have Netflix and haven't watched anything for an ENTIRE YEAR is extremely small. Also, cancelling Netflix is super easy and can be done in a few clicks. Therefore, this will not be a huge loss in revenue. \n\nSecondly, it could be a clever strategy to avoid future problems (and maybe lawsuits) with inactive accounts. Say it was found out that Netflix was charging money to people who have been deceased for a long time. Relatives might not know the passwords to accounts etc. Or say Netlfix were found in breach of data protection laws by holding user data of dormant users. \n\nFinally, it's also some good PR. Some companies are known for making it really difficult to cancel. Netflix coming out saying that they will do it automatically if you don't use their service could be used as a selling point.",
        "created_utc": 1590096756,
        "id": "frduwhy",
        "score": 80,
        "subreddit": "stocks",
        "created": 1590125556.0
    },
    {
        "author": "reddev87",
        "body": "https://imgur.com/a/ddRJyhE\n\nReached a new level of degeneracy I didn't know was possible. Been taking it easy lately but just had a feeling about today. Bought a ton of 6/1 and 5/29 SPY puts about an hour after open and continued to periodically buy throughout the day. Ended up with 1800 by the time midday came around. Was down -$124,000 at one point today (that was like, -50% of entire account), felt pretty bad. EOD drop brought it all the way back to +$116,313. I hate myself rn tbh even though it worked out.",
        "created_utc": 1590696457,
        "id": "fs4if8t",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1590725257.0
    },
    {
        "author": "ascendtofutility",
        "body": "I don't get it, everyone knows the rules, positions fuckwad",
        "created_utc": 1589511835,
        "id": "fqobxe8",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1589540635.0
    },
    {
        "author": "gfz728374",
        "body": "Yeah it only has the largest economy in the US. Sucks for business...",
        "created_utc": 1589065468,
        "id": "fq3dudk",
        "score": 77,
        "subreddit": "stocks",
        "created": 1589094268.0
    },
    {
        "author": "st4n-",
        "body": "I bet it hertz",
        "created_utc": 1590697166,
        "id": "fs4jwo3",
        "score": 77,
        "subreddit": "investing",
        "created": 1590725966.0
    },
    {
        "author": "LastForkOnTheLeft",
        "body": "Fuck it, I’m either gonna go to the moon tomorrow or I’m gonna cry. Tears don’t last forever but a trip to the moon might.",
        "created_utc": 1588798880,
        "id": "fppaplc",
        "score": 76,
        "subreddit": "pennystocks",
        "created": 1588827680.0
    },
    {
        "author": "KebabDrogo",
        "body": "Honestly even 20k for a kids new car is dumb. Hes gonna wreck it. Get him a decent 10k car and tell him to save/yolo the rest.",
        "created_utc": 1590783680,
        "id": "fs8jl8b",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1590812480.0
    },
    {
        "author": "MillaShows",
        "body": "You’re obviously risking too much of your portfolio on a single trade. If you want to play it safe don’t even allocate more than like 5 percent of your account on one options trade. If you play the probabilities game right and do you’re research you should come out ahead",
        "created_utc": 1588798928,
        "id": "fppat20",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1588827728.0
    },
    {
        "author": "RandyChavage",
        "body": "tradeR. Switch the t and d and read it backwards.",
        "created_utc": 1588892368,
        "id": "fptjfhh",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1588921168.0
    },
    {
        "author": "USFederalReserve",
        "body": "Find yourself reading through the comments thinking \"what the fuck are these idiots actually trying to say?\" \n\n## WSB Vocab rubric\n\nalgos = I don't understand whats happening\n\nMM = I lost but wont admit its my fault\n\nflag = Price stopped moving in the direction I want, but it'll keep going in that direction\n\nprinters = people buying\n\nretail = everyone dumb but me\n\nbulls = i only buy calls like an idiot\n\nbears = i only buy puts like an idiot\n\nmanipulated = someone with more money moved the price in the direction I don't want\n\nmoon = im zoomed in on the 1m chart and it went up .3 percent\n\ndump = im zoomed in on the 1m chart and it went down .3 percent\n\nfake market = market is moving in the direction i dont like because of a conspiracy to fix the market\n\nban = your post actually made me doubt my position\n\nthis = your post confirmed my confirmation bias\n\nis anyone else playing... = i saw a ticker in another post but still need someone to spoon feed me a trade\n\ndo X, they said, it can't go tits up, they said = i decided that the best way to spend my money was to follow advice on a subreddit famous for it's massive losses\n\nresistance = the 1m candle stopped moving up for a second\n\nsupport = the 1m candle stopped moving down for a second\n\nvolatility is high = volatility is up 5% from yesterday\n\nppt = futures are up and i don't know why\n\nfutures dont matter = futures are moving in a direction i dont like \n\npajama traders = i don't know who is buying in futures, a market i've only ever watched. \n\nX are fucked = futures opened in the direction i like, so that means it'll go 5% in that direction.\n\nCNBC = cartoon network",
        "created_utc": 1589408063,
        "id": "fqjcmui",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1589436863.0
    },
    {
        "author": "candymaxie",
        "body": "If SPY hits 270 tomorrow, I’ll eat my shit and post it on WSB",
        "created_utc": 1589509853,
        "id": "fqo8npp",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1589538653.0
    },
    {
        "author": "cmcewen",
        "body": "Doctor here.  I’ve actually taken it as an anti malarial while providing health care in Belize.\n\nThe med doesn’t help according to studies.\n\nBut at standard oral dosing it’s unlikely to be toxic.  The people who died from it were getting really high doses I believe.  \n\nPlus I have calls so he can’t die right now.",
        "created_utc": 1589856611,
        "id": "fr3g0f3",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1589885411.0
    },
    {
        "author": "Geordenr",
        "body": "Joe posted about it on IG.\n\n-Spotify will post both the audio and video versions of the podcast\n-It will still be free\n-It is a licensing only deal, so it drives traffic to their app\n-He specifically states that the deal gives them NO creative control and they just want him to do his thing as he always has\n\nSpotify would be dumb to change/censor the show considering it's success. They are also a new media/entertainment company, not Fox News or MSNBC, so I don't think they will fuss over the content being \"controversial\".",
        "created_utc": 1589923954,
        "id": "fr6cu89",
        "score": 73,
        "subreddit": "stocks",
        "created": 1589952754.0
    },
    {
        "author": "USFederalReserve",
        "body": "Imagine how much money this sub would make if we collectively agreed to move on past the Bear vs Bull sentiment and worked together to strategize great plays and organized them on like a shared document or something. Assign people to different sectors, give people with more experience in finances a louder voice, and moved forward with the goal for all of us to make money. Any trolls or opportunists trying to fuck over the herd can be removed and eventually weed out the bad apples.\n\nI know it wont happen, but imagine if we did. There'd be a lot of money to be made.",
        "created_utc": 1590696890,
        "id": "fs4jbuy",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1590725690.0
    },
    {
        "author": "zjz",
        "body": "Sorry, somebody broke something in automod I guess. I just woke up.. quarantine sleep schedule. Looking into it.\n\nEDIT: I got short yesterday before close stop judging me reeee",
        "created_utc": 1588361746,
        "id": "fp70c57",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1588390546.0
    },
    {
        "author": "jasonhenderson23534",
        "body": "Definitely happening where I work. Telecommute has been liked so much now that management is considering making everyone permanent telecommute status and then you can optionally come into the office if you want to. They're even considering moving to a smaller office and getting rid of permanent cubicles. Instead it will be replaced with \"shared workspace\".",
        "created_utc": 1588876644,
        "id": "fpsnw0g",
        "score": 72,
        "subreddit": "investing",
        "created": 1588905444.0
    },
    {
        "author": "sm4ll2",
        "body": "Maybe I can just write it off on my taxes as a charitable donation because at this point I’m just giving people my money",
        "created_utc": 1590619303,
        "id": "fs10zqr",
        "score": 72,
        "subreddit": "pennystocks",
        "created": 1590648103.0
    },
    {
        "author": "originalusername__1",
        "body": "It will be interesting to see whether they find it monetarily makes sense. The upkeep and operation of your own airlines has got to be pretty damn expensive.",
        "created_utc": 1590623701,
        "id": "fs194pj",
        "score": 72,
        "subreddit": "stocks",
        "created": 1590652501.0
    },
    {
        "author": "HappyHereticalIAM",
        "body": "Say it with me now: \"The stock market is not the economy\"",
        "created_utc": 1588645999,
        "id": "fpipqj2",
        "score": 71,
        "subreddit": "options",
        "created": 1588674799.0
    },
    {
        "author": "Sen5atus",
        "body": "Fuck this is inspiring. But I have to say it. \n\nPositions or ban fucknugget",
        "created_utc": 1590544535,
        "id": "frxpa56",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1590573335.0
    },
    {
        "author": "SlAddict",
        "body": "Just realized it was shares 😂😂\n\nBan this faggot",
        "created_utc": 1589841845,
        "id": "fr2q9pe",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1589870645.0
    },
    {
        "author": "NoCountryForOldPete",
        "body": "Can you imagine being on the other end of this trade? Like, if you didn't wig out halfway through the drop and try to fix your shit - selling all those puts in Feb thinking \"LOL I just made a fortune.\", watching SPY brick it to 220, developing so many new ulcers your stomach looked like a smallpox victim's face, and then a month later all of a sudden making a profit? \n\nCan you imagine the *relief*?",
        "created_utc": 1590780191,
        "id": "fs8chye",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1590808991.0
    },
    {
        "author": "btoned",
        "body": "*oH sO itS goIng to PluNge afTerwArds*\n\nNo but I needed to make it look like the fucking mouse.",
        "created_utc": 1590105354,
        "id": "freazhz",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1590134154.0
    },
    {
        "author": "asianperswayze",
        "body": "My guess is he's almost done, and this is his last big paycheck before cashing out. He's talked openly about wanting to leave California, and that would make it far less convenient for his podcast, as he hates doing it remotely.",
        "created_utc": 1589920377,
        "id": "fr65q3h",
        "score": 69,
        "subreddit": "stocks",
        "created": 1589949177.0
    },
    {
        "author": "chubby464",
        "body": "So spy to infinity got it. Print more money",
        "created_utc": 1589491602,
        "id": "fqnau4o",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1589520402.0
    },
    {
        "author": "Incognadeau",
        "body": "2020.  People are watching a dog shit and staking their money on it.",
        "created_utc": 1590027307,
        "id": "fravufp",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1590056107.0
    },
    {
        "author": "KeepenItReel",
        "body": "If you’re not losing at least $10k per trade I don’t wanna hear it pfffttt",
        "created_utc": 1589498572,
        "id": "fqnoi00",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1589527372.0
    },
    {
        "author": "LatinoMuyFinO",
        "body": "Some Options:\n\nBYND Calls: I shorted this today from $138 to $135. Could have made more if i had held til close but fuck it. They took a beating and am expecting a bounce back from the 132-133 level. I'll be going short term calls tomorrow for a quick scalp at open.\n\nPTON Calls: Same as above \\^ bounce back from the $40-41 level\n\nDKNG: FOMO if you want. This thing could pop to $40 or drop to $30. I won't be touching this until at least another week or so. Risky af but mad tendiez if you guess the right direction (calls/puts)\n\nCOTY: Same as above, but I expect this will hold better than DKNG since its already near rock bottom prices. Might throw a few thousand at it tomorrow in calls.\n\nSPY: i personally don't play SPY, but there is mad tendiez to be made if you get in calls at a dip (around the 295-297 range) or puts (around the 301-303 range).\n\nCCL, RCL, NCLH: Easy plays to go long on a dip, Beaten up cruise stocks that have been forming new bottoms. Easy 2x 3x bagger if you get in before a large move up in the premarket. They seem a bit overheated lately though so I would be careful of a pullback soon, in which case go short term puts.\n\nAAL, DAL, UAL, LUV, SAVE: Same as above\n\nAAPL, MSFT, AMD, NVDA: Tech saw a big hit today, might be a good spot to buy the dip. I'll be watching closely tomorrow if we continue to fall in tech at open, then I'm buying the dip for sure.\n\nBABA, TSM: GYNA stocks if you want i guess\n\n&amp;#x200B;\n\nGood luck making your parents money back you fucking autist.",
        "created_utc": 1590537988,
        "id": "frxdvjh",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1590566788.0
    },
    {
        "author": "Damascinos",
        "body": "It hurts man it hurts",
        "created_utc": 1588987738,
        "id": "fpxqutm",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1589016538.0
    },
    {
        "author": "Luck038",
        "body": "I find it stupid how you get punished for being poor and trying to play the stocks. Fuckin asshole law makers / rich people",
        "created_utc": 1588707905,
        "id": "fpl7u7h",
        "score": 65,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588736705.0
    },
    {
        "author": "tommy1010",
        "body": "You're going to get it all back. It might take a while, but it's going to happen. Good luck homie.",
        "created_utc": 1590178814,
        "id": "frhf7kz",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1590207614.0
    },
    {
        "author": "MandoInThaBando",
        "body": "He's not looking to invest, he's waiting until a company comes dragging their bleeding corpse up to him and begs him for money. So then he can bully them into giving them more equity then if it was a straight cash for equity purchase. It is a genius and proven strategy albeit unfair.",
        "created_utc": 1588631410,
        "id": "fpi0rfp",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1588660210.0
    },
    {
        "author": "butatwutcost",
        "body": "I got it from signing up for Verizon and plan to cancel it when the year is up. Netflix is just so much better content wise.",
        "created_utc": 1588729608,
        "id": "fpmboks",
        "score": 63,
        "subreddit": "investing",
        "created": 1588758408.0
    },
    {
        "author": "Neighborhoodstoner",
        "body": "Fuck, dude take out fucking half of it at least, the remaining 115k profile is more than enough to work up to 1m. Keep yaself' off the rope lol",
        "created_utc": 1589417283,
        "id": "fqjyxk7",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1589446083.0
    },
    {
        "author": "archbroarch",
        "body": "Sorry to break it to you pal, service industry r fuk.",
        "created_utc": 1589396782,
        "id": "fqijdnc",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1589425582.0
    },
    {
        "author": "devangs3",
        "body": "Shit I read it transgender magazine in my head",
        "created_utc": 1588885062,
        "id": "fpt57er",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1588913862.0
    },
    {
        "author": "HeySlowfinger",
        "body": "It was a red day overall, and people are complaining HE lost them money LOL",
        "created_utc": 1589428674,
        "id": "fqkjgvu",
        "score": 61,
        "subreddit": "pennystocks",
        "created": 1589457474.0
    },
    {
        "author": "PlayFree_Bird",
        "body": "&gt;Tuesday he sold that [$2.3 billion] stake for pennies on the dollar, fetching 72 cents a share for a total of $39.8 million.\n\nIt must hurt to lose so bad, but can you imagine being so rich that even cashing out your \"worthless\" positions fetches you 40 million bucks?",
        "created_utc": 1590697506,
        "id": "fs4kmka",
        "score": 61,
        "subreddit": "investing",
        "created": 1590726306.0
    },
    {
        "author": "eugeisfore",
        "body": "Musk is crazy enough to actually do it",
        "created_utc": 1589506029,
        "id": "fqo25dd",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1589534829.0
    },
    {
        "author": "mpbh",
        "body": "I fucking bought calls when he picked it up and had to burn a day trade when he spit it out. gecko gang",
        "created_utc": 1589919954,
        "id": "fr64v6c",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1589948754.0
    },
    {
        "author": "4ppleF4n",
        "body": "Oh, definitely. *Every* industry is in danger. Airlines are going to struggle to convince people to travel. But guess what, people still will risk it. As evidenced by a recent United flight, people will pack into planes, even during a pandemic.\n\nBut agreed, it's going to be a challenging time for any transportation. I can't believe anyone would take a cruise, but somehow Carnival Cruiselines just announced it would [start taking reservations for August -- and surged to 600% bookings](https://www.fastcompany.com/90503385/what-pandemic-carnival-cruise-bookings-soar-600-for-august-trips).",
        "created_utc": 1589420400,
        "id": "fqk58sg",
        "score": 59,
        "subreddit": "stocks",
        "created": 1589449200.0
    },
    {
        "author": "snowydove304",
        "body": "Yea this happened to me once except it wasn’t a glitch",
        "created_utc": 1590185735,
        "id": "frhsfop",
        "score": 59,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1590214535.0
    },
    {
        "author": "Jimbob67123",
        "body": "Oh no, all the people that used credit to purchase additional homes so they could play hotel owner cant afford it.",
        "created_utc": 1590443712,
        "id": "frt5p4q",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1590472512.0
    },
    {
        "author": "cantaloupe_jones",
        "body": "As many as it takes.",
        "created_utc": 1590003482,
        "id": "fr9tncr",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1590032282.0
    },
    {
        "author": "prodoubt",
        "body": "He bought these April 2. Literally the last day of this stock dropping before going up almost every single day since. That is unprecedented luck. There is nothing you can do to learn to hit such a thing. He picked strikes that were more than double the stock price. A bet that the stock would rally over 100% in just 5 months. That is a very rare occurance. And it just so happens that SHOP was one of the few stocks that recovered  their entire virus loss and then some in only a month. Again, this is pure luck and balls. The fact he never sold even after being up a week, which still would have been an amazing gain, shows he is a true WSBr.",
        "created_utc": 1588822800,
        "id": "fpqhbp7",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1588851600.0
    },
    {
        "author": "Krogo_yago",
        "body": "I’m not making art so you can have a retarded wallpaper for your iphone 4. I make it for the sake of art! Art is not a commodity. Haha just kidding, Fuck you!",
        "created_utc": 1588972314,
        "id": "fpwyj4o",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1589001114.0
    },
    {
        "author": "Element_84",
        "body": "It dipped because I finally bought MSFT stock",
        "created_utc": 1589314896,
        "id": "fqewtda",
        "score": 58,
        "subreddit": "stocks",
        "created": 1589343696.0
    },
    {
        "author": "Cautemoc2",
        "body": "I like how this is a \"scam\" if a normal person does it but this is exactly how financial publications operate.",
        "created_utc": 1589245832,
        "id": "fqbxfkl",
        "score": 58,
        "subreddit": "investing",
        "created": 1589274632.0
    },
    {
        "author": "PaperShark0001",
        "body": "We won the war against coronavirus the same way we won the war against Vietnam. It got too expensive so we pretended that it was over.",
        "created_utc": 1590617266,
        "id": "fs0x1ij",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1590646066.0
    },
    {
        "author": "mightyXi",
        "body": "Same, so now whenever I feel like I should do something, I just do the opposite. Like today I shorted VGT before market opening and then cursed it because it went up, so I had my finger on the buy button when I started thinking: would a sucker from wsb do that? Since the answer is yes, I stayed in and made 7k at the end of the day. Spoiler: I'll probably lose 14k on the way up tomorrow 🤟",
        "created_utc": 1589318564,
        "id": "fqf4ggj",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1589347364.0
    },
    {
        "author": "TywinClegane",
        "body": "Petition to have a 1M bank note with J POW POW on it",
        "created_utc": 1590028360,
        "id": "fraxn3v",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1590057160.0
    },
    {
        "author": "its_a_gibibyte",
        "body": "Yep. OP claimed it was **sold** for $565 million, which is not really accurate. They essentially traded the company in exchange for 8.3 million shares of Excite (0.46 shares excite per share of imall). OP should be asking how much his shares of excite are now worth. \n\n\nAnswer: $0",
        "created_utc": 1590718235,
        "id": "fs5nk9k",
        "score": 57,
        "subreddit": "investing",
        "created": 1590747035.0
    },
    {
        "author": "fgh125312",
        "body": "CSCO DD for all you zoomers thinking this old school tech giant is just a meme stock, too much to bear as a lurker\n\nFundamentals\n\n· Diversified hardware/software company, provide switches/enterprise networking hardware, VPN, cyber security\n\n· Aim has been to pivot away from hardware sales (56%) toward more of a software play including a large focus on cyber security\n\n· Previous ER recorded a 4% decrease in Non-GAAP operating margins\n\n· Circa USD 9 bln net cash position/rock solid balance sheet – big enough to provide USD 2.5 bln financing for large hardware purchases until 2021 to ensure companies can still upgrade despite uncertainty (from CEO)\n\n· Owns Webex (recording 14 billion meeting minutes in March vs 6 in January)\n\n· COVID-19 potential catalysts from an increase in work from home (VPN/Cloud), WebEx adoption and also possible upgrades of data centers/Cisco Meraki hardware. Also active in the tele-health sector\n\n· Increase in web traffic (remember Netflix reducing video quality?) is another potential catalyst for their hardware segment as tech companies could be panic adding capacity\n\n· CEO mentioned they had been working around the clock on video interview with CNBC, to ensure businesses stay functioning through COVID-19\n\n· Recent conference call on their investor relations website outlining their remote work portfolio seems to have been slept on also price wise\n\nTechnical\n\n· Stock traded in 50’s, for much of 2019 then was slapped down by trade war headlines\n\n· Dumped last 3 ER’s , trade war related fears – expectations for upcoming ER are low\n\n· Previous ER’s have shown decent jumps (check 2018)\n\n· Hasn’t recovered like competing networking stocks (Juniper Networks, Arista networks)\n\n· Option volatility has also remained quite low throughout March/April – options pretty much imply no movement\n\n· Bottomed and bounced from the upper 30’s to low 40’s and has been stuck in a range since\n\n· Stock has tried to break out several times in April, random dumps due to macro related factors (mid April – negative Oil fears, 29th - 1st May dump from tech sell-off/supposed trade deal collapsing tweet)\n\nPossible risk factors mostly come from big IT spending being potentially put on hold due to companies having cash flow issues/supply chain issues delaying hardware production (as stated by other networking hardware markers) – biggest catalysts for a potential dump post ER. Equally could surprise to upside given all the coronavirus related catalysts and low expectations\n\nDisclaimer: I own 50c LEAPs, building a position since March, great company fundamentals, survived multiple crises (tech bubble, 2008) and has the highest dividend yield in the NASDAQ – how this has been slept on since March/April I have no idea. As always, do your own DD",
        "created_utc": 1588972151,
        "id": "fpwy83w",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1589000951.0
    },
    {
        "author": "Itsme_eljefe",
        "body": "Yassssss TSLA you sweet little juniper pea, rose from\nThe ashes like the Phoenix you are",
        "created_utc": 1590687830,
        "id": "fs407ei",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1590716630.0
    },
    {
        "author": "NotEligibleForRehire",
        "body": "Sorry I meant Juniper, Nokia, and Huawaei devices. Cisco just makes makes club bangers",
        "created_utc": 1588969087,
        "id": "fpwscmh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1588997887.0
    },
    {
        "author": "My-Cousin-Bobby",
        "body": "*a forewarning I started typing, and went on a bit of a tangent, apologies*\n\nSo I only tested it briefly, but it had pretty good results. I ended up like going mad and just started adding a bunch of different features to the program (ie some balance sheet stripping, getting macro data from the fed, getting performance of various industries via ETFs, etc.). \n\nBut back to the question: it was a bit more of a trend analysis than a stock screener, I just didnt really know how to word it. So in theory, you could use any stock, and it would be able to detect up and down trends in momentum, before typical trend line analysis would (I'm not a huge fan of technical analysis, but admit there are some times where it can be helpful).\n\nSo when I back tested, I tried to use companies I have never traded (I only back tested 2015-2016 to try and get the most similar markets to today without me having too much forward looking bias, since didn't start paying attention to markets/trading until mid 2017). Further more, I was not exposed to price action even in the trading, as the charts I read were derived from a formula to calculate and chart momentum, so it was charts of the stocks relative momentum not stock price. After I completed the year of what dates were buys and what were sells, I went in and found the prices of those days (used closing price for both buying and selling prices).\n\nSo I used the SPX for broad market (even though, I clearly know that this has since gone higher), GDX (which, full disclosure I have briefly traded as a hedge before), and had a list of independent companies, but the only two I got through before going off on my tangent of coding were JNPR, and CERN.\n\nFor the SPX\nI was able to achieve a return of 15.73% through 6 trading \"trips\", while on the year it returned -0.73%.\n\nFor GDX\nI was able to achieve a whopping 121.52% over 6 trading \"trips\" compared to -20.10% year return\n\nFor JNPR\nI was able to achieve (another whopping) 115.32% over 8 trading trips, compared to 25.88% year return.\n\nFor CERN\nI was able to achieve a 76.34% return over 5 trading \"trips\", compared to a -27.16% return on the year.\n\nSo, things to take a way, it was pretty damn successful in the brief back tests I did. However, I noticed pretty quickly it benefits most from short term and intermediate swings in price, which the in the cases of GDX, JNPR, and CERN all were pretty volatile for that year, so the results I achieved from them, I'm expecting, are way above average. Actually the thing that sparked my tangent into other parts of the program was to try and weed out stocks that have high volatility, so i wouldnt have to go through them myself, issue is I didnt stop there. I'm pegging most results to be around that SPX result. Furthermore, this strictly tested against a yearly holding of those stocks, am planning to have someone go through with a regular trendline analysis or something with the same period to get a more accurate result as its performance against some basic analysis techniques.\n\nAs for the process I picked the companies, I used a random organizer to pick 25 S&amp;P companies (made sure they were included in the S&amp;P on the date my back test started) and ran with it. I threw in a few etfs (as shown GDX, but also have TLT, TLH, XLE, XLY, etc. Just havent gotten to them).\n\nEdit: Thanks for the interest in its progress!",
        "created_utc": 1589320386,
        "id": "fqf8a99",
        "score": 2,
        "subreddit": "investing",
        "created": 1589349186.0
    },
    {
        "author": "Givemeallyourtacos",
        "body": "Why JNPR?",
        "created_utc": 1588808678,
        "id": "fppt7h6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1588837478.0
    },
    {
        "author": "phabphour20",
        "body": "MSFT trades at 30x earnings.  CSCO trades at 17x.  JNPR most direct competitor trades at 24x.\n\nBuy CSCO before its too late.  Last chance.",
        "created_utc": 1588967858,
        "id": "fpwpzx2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588996658.0
    },
    {
        "author": "SalesyMcSellerson",
        "body": "VPN for secure communication to the private network. Identity access and authentication management + 2FA, workforce management, and endpoint detection and response for the remote endpoint. For the private network, network detection and response (likely through an mssp), and edge firewalls. Microsegmentation and microservices for the data center / servers, and... For the most part that's good.\n\nAnd as far as the push to edge computing is concerned, if we're still making terminals then it's probably marginal to just build the rest of the computer out and just do it how we have been. Then for any intensive applications use the compute resources on the private network like a render farm.\n\nAs far as who wins the VM play. VMware is expensive. 99% of IT departments don't have even half of what I just outlined above. And there's some really great alternatives that are better in many ways and much more affordable. Big switch networks(now Arista) for cloud fabrics / networking / public-hybrid cloud, Red Hat (now IBM) for open source virtualization, open stack, Fortinet for security, etc. etc \n\nI like VMware, but I just don't see them winning the cloud wars. In my opinion, it's going to be open source providers and enablers like Arista that will win, but even then there's a lot of traditional competitors that could run with it like Cisco, Nokia, Juniper, etc.\n\nBut they did have Velocloud which sold like gangbusters. Although, sdwan is going to move more towards the whitebox virtualized services route.",
        "created_utc": 1589868363,
        "id": "fr3wmkq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589897163.0
    },
    {
        "author": "TheFlyingBoat",
        "body": "Sun and Intel were both hugely important in the history of technological development and progress. Oracle kinds sucks but they're am alright legal firm I guess. On a serious note, the names of the people and companies change, but what hasn't for the past 70 years is the center of the world's technological progress is the Bay Area. Shockley, Fairchild, and Xerox PARC dominated the 50s and 60s. You have hugely important R&amp;D work done by companies that used to be very forward moving that are now viewed as old giants like HP or whoever else. You have SRI demo the mouse. Then you start to have Apple start to pop up. You have VC firms like Sequoia or KPCB start. You have pretty much every networking company begin from Cisco to Juniper to whoever else. Hundreds of companies rise and fall every year in the Bay and history hasn't stopped running through it.",
        "created_utc": 1589217607,
        "id": "fqaeax8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589246407.0
    },
    {
        "author": "NotEligibleForRehire",
        "body": "I'm burning all my juniper certs and going back to Cisco. \n\nFriendship with juniper over. Cisco is my new best friend",
        "created_utc": 1589290374,
        "id": "fqdigi8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589319174.0
    },
    {
        "author": "Viscus121",
        "body": "Holding CLX at 195, in on W at 165 and JNPR at 21.60.\n\nMainly just trying to not think about me deciding to add to my W position yesterday before the bell versus pivoting into BYND, been burned by after hours reports too many times and chickened out.",
        "created_utc": 1588775397,
        "id": "fpnz2ay",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588804197.0
    },
    {
        "author": "Viscus121",
        "body": "Rough day, but I'm taking AMZN (in at 2360), AAPL (in at 292), CLX (in at 194) and JNPR (in at 21.10) into the weekend and next week. Have stop losses set for them, but I fully intend to hold these for at least a semi-long amount of time. All of these should have a solid May, this week's blip notwithstanding.",
        "created_utc": 1588361547,
        "id": "fp6zxum",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588390347.0
    },
    {
        "author": "carlos5577",
        "body": "vmware, juniper, maybe cisco, citrix. Until people stop buying tech I guess",
        "created_utc": 1588932388,
        "id": "fpv2dd3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588961188.0
    },
    {
        "author": "I_knowwhat_I_am",
        "body": "&gt; Possible risk factors mostly come from big IT spending being potentially put on hold due to companies having cash flow issues/supply chain issues delaying hardware production (as stated by other networking hardware markers) – biggest catalysts for a potential dump post ER. Equally could surprise to upside given all the coronavirus related catalysts and low expectations\n\n2 sides of this coin. \n\n1 side--- CapExpeniture is one of the first things cut (well, after corp travel and free coffee, but before eliminating yearly salary increases/ bonuses, and layoffs), especially IT related CapEx, which is a non-revenue generating business unit / group. Companies that were in the shitter pre-Covid wont have the cash/liquidity to spend. \n\nOther Side-- As many companies realize they can still function pretty well without people in the office, many will move to reduce their physical footprint, consolidate offices to a more \"regional\" model where you only go to office for important / customer facing meetings, maybe a project kickoff. To sustain this sort of environment, infrastructure needs to be beefed up to handle increased bandwidth, security, utilization, etc. Companies will save money by spending a little to beef up infrastructure etc compared to their current real estate spend. However, these sort of major upgrades are not a flip the switch / overnight type of implementation, and take time to do right. So companies may take 3-6 months to ramp up capacity, and move to a more remote workforce end of year and into next fiscal year while they exit lease contracts.\n\nA note on WebEx, btw, it is a subscription based service, every user (or individual who can \"host\" a meeting) is a subscription. I do expect  they made beaucoup bucks on this in March).\n\nOverall, very bullish on this industry long term (WSB long term, 6-12 months lol). But it is very competitive and there are multiple players. Cisco has a large market share but Juniper, Huawei, Dell, etc all play in this space and are very aggressive price-wise. \n\nMy position is 6/19 47.5c, will see how much it ramps into earnings, may dump pre-announce if I hit my targeted gain (see the other DD noted, it notoriously dumps post earnings). Longer term, I may buy shares at a lower entry price point.",
        "created_utc": 1588976853,
        "id": "fpx6ypu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589005653.0
    },
    {
        "author": "WhittledSpork",
        "body": "Cisco will be but not for cyber, for networking however I wouldn't expect it to move the needle short term. You should also look at palo alto and juniper networks.",
        "created_utc": 1590039542,
        "id": "frbdtpt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1590068342.0
    },
    {
        "author": "schplat",
        "body": "This has been 100% my life.  MSFT, pre-COVID adjusted earnings smashed, down it goes.  Tankers smashing earnings, goes way down.  EA.  NFLX.  JNPR.  Then there's companies that miss earnings, revenue, they go up 8-10%\n\nI know I'm missing *something* when it comes to this stuff, I just don't know what it is.",
        "created_utc": 1588773981,
        "id": "fpnwh1q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588802781.0
    },
    {
        "author": "pkincy",
        "body": "Didn't work out well for me.  I was heavily into QQQ or the stocks that made it up in 1999 and through 2002.  Many went Bk and I keep that old portfolio and its buy prices to simply remind myself how stupid one can be.   Many of the companies I bought if they are still in existence are not yet, 20 years later, near their 2000 stock values.   Take a look at a couple of good ones.  Cisco and Juniper Networks.  The backbone of the internet.  You won't find the bad ones because they no longer exist.",
        "created_utc": 1589214633,
        "id": "fqa8drg",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1589243433.0
    },
    {
        "author": "mycduck",
        "body": "This stock has runs up then levels out a lot. Has tons of competition from other HW players Arista, Juniper, Broadcom. ZM is eating CSCO video conferencing lunch, and is run by ex-Webex exec. CSCO also famous for layoffs every other year and outsourcing. No positions, I'm not messing with overpriced tech during this bull run.",
        "created_utc": 1588979515,
        "id": "fpxbpd8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589008315.0
    },
    {
        "author": "paperboythegod",
        "body": "If you are looking for something heavy in Okta that has cheap options for selling your calls when they go ITM.\n\nCheck out IHAK.\n\nAlso it’s a good long term hold with holdings in Fortinet, Citrix and Juniper.\n\nI am gambling right now with options. When I’m done I will be moving into adding shares monthly.\n\nPositions:\n\n4 - IHAK 30C 6/19\n\n20 - TRVN 2.5C 6/19\n\n5 - TRVN 2.5C 9/18\n\n1 - SPXS 12C 6/19 (just Incase so I can keep the gamble up if shit goes tits up)",
        "created_utc": 1589667584,
        "id": "fqv0rrm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1589696384.0
    },
    {
        "author": "Functioncatvoid",
        "body": "Already made the list: (this is my 10 year buy and hold 2020 economic depression list)\n\nT-Mobile, AT&amp;T, Verizon, Vodafone, China mobile, Taiwan Semiconductor, Juniper, EROS, Cloudflare, Century Link, Viacom, Telefonica, Noka, Ericsson, Kraft, Sony, Microsoft, Comm Systems, Orange, Sierra Wireless, Church &amp; Dwight, VEON, Sirius, Disney, Activision, Nintendo, Waste Management, Intel, Coca Cola, Cisco.",
        "created_utc": 1589670393,
        "id": "fqv5pka",
        "score": 1,
        "subreddit": "investing",
        "created": 1589699193.0
    }
]