[
    {
        "author": "CycleFB",
        "body": "Stocks or fds?\n\nIf looking for some mid to long term stock: 10k mtch, 10k rpm, 10k pton, 10k scl, 5k hpq, 5k rkt\n\nMatch is going to keep gobbling up dating apps, which i believe will remain to grow as they're common for genZ and will likely break into more parts of the world.  I could see them doing like dating games or some shit like the batchelor since their new ceo is some tv exec ceo dude.\n\nRpm is a coating company.  That are very aggressive in buying out companies, high margins, and coatings companies really aren't going to go bust anytime soon bc they're used fucking everywhere.  And as ppl push to move away from plastics, coatings will be needed even more.\n\nPton bc why not\n\nScl because they're a large powder coating company.  Powder coatings continue to grow bc of regulations on other paints.  And i like coatings..  axlta is descent too\n\nHpq because they have some big ass printers in the works that'll give crazy throughput, customization, and kill screen printing imo\n\nRkt bc it's literally a rocket\n\n\nI've excited almost all my positions in the companies above and am selling puts to get back in to some positions if they dip in the next few months.\n\nIf FDs, I've been playing nnox, rkt, hpq, and hpe",
        "created_utc": 1602466546,
        "id": "g8jtx6e",
        "permalink": "/r/wallstreetbets/comments/j9hkte/give_me_yolo_ideas_for_my_50k_yolo_account/g8jtx6e/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602495346.0
    },
    {
        "author": "monnomesttonnom",
        "body": "JPOW’s talk will be about his new HP money printer. Market will go crazy. Calls HPQ.",
        "created_utc": 1601932180,
        "id": "g7twuh6",
        "permalink": "/r/wallstreetbets/comments/j5qsww/what_are_your_moves_tomorrow_october_06_2020/g7twuh6/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601960980.0
    },
    {
        "author": "BaruchFeldheim",
        "body": "Today was a good day to put almost all my reserves into HPQ puts after Apple blackpilled me to fuck about calls. Let’s go 🌈 🐻",
        "created_utc": 1602693166,
        "id": "g8t61om",
        "permalink": "/r/wallstreetbets/comments/jaxxuj/daily_discussion_thread_for_october_14_2020/g8t61om/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602721966.0
    },
    {
        "author": "returnofthe9key",
        "body": "They’ve gotten too big. IBM has their hand in just about everything, and that’s not a problem, the problem is that they have turned into a “one-stop-shop” which means they’ve lost sight of any sort of focus or speciality. \n\nThe value of the two enterprises broken apart is similar to when HPE and HPQ separated. It’s for the best for everyone.",
        "created_utc": 1602270066,
        "id": "g88s4us",
        "permalink": "/r/investing/comments/j7yzpc/ibm_to_move_on_from_it_infrastructure_in_spinoff/g88s4us/",
        "score": 2,
        "subreddit": "investing",
        "created": 1602298866.0
    },
    {
        "author": "superbrad9",
        "body": "Premiums are so low on f that I wouldn't trade them. Not worth it to me. I'd do hpq or sono before ford.",
        "created_utc": 1603038375,
        "id": "g98fpsu",
        "permalink": "/r/options/comments/jdidyy/which_stock_should_i_wheel/g98fpsu/",
        "score": 2,
        "subreddit": "options",
        "created": 1603067175.0
    },
    {
        "author": "Pauldoesnotfall",
        "body": "Any of you gents/gentladies have HP laptops? These things work like dogshit. A 2019 HP laptop took me 4 minutes to even boot up and Microsoft edge essentially makes it unusable. \n\n$HPQ $5p 10/2. \n$MSFT $50p 10/2.\n$AAPL $200c 10/2.",
        "created_utc": 1601609076,
        "id": "g7d3iq5",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7d3iq5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601637876.0
    },
    {
        "author": "itsatarp",
        "body": "btw HPQ calls always free money, check the yearly chart",
        "created_utc": 1601664185,
        "id": "g7ffwvm",
        "permalink": "/r/wallstreetbets/comments/j3rz7r/daily_discussion_thread_for_october_02_2020/g7ffwvm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601692985.0
    },
    {
        "author": "clicknbait",
        "body": "&gt;HP and Dell shipped out most PCs they have shipped in a decade. Here is what HP's CEO said on Aug 27. **“We have never shipped so many PCs and it was really driven by the demand we see for people working from home and learning from home,” HP Inc. CEO Enrique Lores told CNBC.**  \n&gt;  \n&gt;  \n&gt;  \n&gt;Long term prospects for AMD are good. I'll sell AMD shares when Lisa Su steps down.",
        "created_utc": 1602966448,
        "id": "g94yllr",
        "permalink": "/r/stocks/comments/jctd53/amd_and_future_growth/g94yllr/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1602995248.0
    },
    {
        "author": "Greasyfork",
        "body": "HPQ sillicon resources. 0.50 CA$ a share. \n\nhttps://money.tmx.com/en/quote/HPQ/news/4525128182287010/HPQ_NANO_Receives_Request_for_Spherical_Nano_Silicon_Material_From_Major_Automobile_Manufacturer_First_PreOrder_Expected_Soon\n\nDont miss out.",
        "created_utc": 1602262547,
        "id": "g88dtp2",
        "permalink": "/r/wallstreetbets/comments/j811rd/share_your_dds_you_degenerates/g88dtp2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602291347.0
    },
    {
        "author": "mastafish",
        "body": "HPQ Silicon (Montreal, Canada) is partnered with Apollon Solar (France).  They have some catalysts coming up in December with the startup of their pilot plant, that will make silicon for batteries and solar panels etc.  They've potentially even been linked with Tesla and/or some other EV/Solar companies.  Good luck!",
        "created_utc": 1601940220,
        "id": "g7ucl57",
        "permalink": "/r/stocks/comments/j5qay7/solar_stocks/g7ucl57/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601969020.0
    },
    {
        "author": "Coffeepillow",
        "body": "Just make sure they are still offering a dividend or look strong enough that they'll be able to keep offering a dividend. My largest stakes are HPQ, KO, BGS and HAS. I like all of them and the have solid dividends.",
        "created_utc": 1601954078,
        "id": "g7v0vih",
        "permalink": "/r/wallstreetbets/comments/j5qsww/what_are_your_moves_tomorrow_october_06_2020/g7v0vih/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601982878.0
    },
    {
        "author": "Grymmful",
        "body": "[https://ca.finance.yahoo.com/news/hpq-nano-receives-request-spherical-120100767.html](https://ca.finance.yahoo.com/news/hpq-nano-receives-request-spherical-120100767.html)",
        "created_utc": 1602101061,
        "id": "g81c989",
        "permalink": "/r/pennystocks/comments/j6x1tf/2000_yolo/g81c989/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1602129861.0
    },
    {
        "author": "social_arb_trader",
        "body": "Hpq seems solid too I like it I did a trade on it last earnings",
        "created_utc": 1603038484,
        "id": "g98fwyl",
        "permalink": "/r/options/comments/jdidyy/which_stock_should_i_wheel/g98fwyl/",
        "score": 1,
        "subreddit": "options",
        "created": 1603067284.0
    },
    {
        "author": "bgalli",
        "body": "Could also look in to big brother Pyrogenesis, they hold a 10% royalty on the process for HPQ Nano and an option to turn that in to a 50% ownership of HPQ Nano. They also hold a 13% stake in HPQ itself. Lots going on with them.\n\nI hold both but heavily weighted on PYR",
        "created_utc": 1602776275,
        "id": "g8woo09",
        "permalink": "/r/pennystocks/comments/jb25lm/hpqv_proprietary_nano_silicon_manufacturing/g8woo09/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1602805075.0
    },
    {
        "author": "SmutBrigade",
        "body": "Is the partner TSLA?? Tunneling company, auto manufacturer, and aerospace company.  Who else???\n\nhttps://ca.finance.yahoo.com/news/hpq-nano-receives-first-order-190300952.html",
        "created_utc": 1603398774,
        "id": "g9oqa0u",
        "permalink": "/r/wallstreetbets/comments/jg7eyd/what_are_your_moves_tomorrow_october_23_2020/g9oqa0u/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603427574.0
    },
    {
        "author": "Grymmful",
        "body": "[https://ca.finance.yahoo.com/news/hpq-nano-receives-request-spherical-120100767.html](https://ca.finance.yahoo.com/news/hpq-nano-receives-request-spherical-120100767.html)\n\nThey got a client lined up with a preorder whose suppose to be a huge automobile manufacturer in December. Don't think you would wait long to see gains.",
        "created_utc": 1602690673,
        "id": "g8t126n",
        "permalink": "/r/pennystocks/comments/jb25lm/hpqv_proprietary_nano_silicon_manufacturing/g8t126n/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1602719473.0
    },
    {
        "author": "CSIS_Agent",
        "body": "HPQ Silicon",
        "created_utc": 1603730859,
        "id": "ga6k9s3",
        "permalink": "/r/CanadianInvestor/comments/jhmz3m/ev_stocks_that_are_yet_to_blow_up/ga6k9s3/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1603759659.0
    },
    {
        "author": "connors27",
        "body": "Really impressed with the content you wrote. How did you get into stocks?  Was it something you just decided to do one day or did some coworker give you a bad stock tip, you followed it, and was hooked ever since. \n\nIts not that I don't have a strat. I've read a couple of super informative books on stocks. One being Warren buffets 3 favourite books. Super impressed with the information on how to value a company and figure out what a stock should be valued at.\n\nI just started buying smart today and for the long haul. The plan is to get a good base of holds again before I go crazy.  Bought 2000 shares of HPQ in TSXV this morning. Super interested and intrigued with what they're doing. They're the only ones doing what they do, and in a market that's bound to boom, they can only go up!  \n\nGoing to stick with more stocks similar to this one until the portfolio starts to resemble something again. \n\nLet me know what you think!",
        "created_utc": 1604129460,
        "id": "gaoih6x",
        "permalink": "/r/wallstreetbets/comments/jldfai/all_in_stock_for_a_broke_ass/gaoih6x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604158260.0
    },
    {
        "author": "Delano_7",
        "body": "HPQ seems to have healthy financials, good cash flow. They have stable revenues and consistent profits. But they kind of remind me of IBM. Sales are stagnant. Not growing double digits.\n\nNeed to reengineer itself, diversify their business, such as selling services instead of their products, like Dell.\n\nMaybe it is better for this company to be acquired. Would not hold the stock with it current management.",
        "created_utc": 1602978336,
        "id": "g95n9qo",
        "permalink": "/r/stocks/comments/jd4kox/thoughts_on_hpq/g95n9qo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603007136.0
    },
    {
        "author": "superbrad9",
        "body": "I look for stocks that are trending up or staying flat. For that reason I would stay away from those last 4 mentioned above. I prefer cheaper stocks that are flat or bullish. (examples hpq, wfc, mu, sono, etc)",
        "created_utc": 1603080253,
        "id": "g9akavn",
        "permalink": "/r/options/comments/jdtd9g/companies_for_csp/g9akavn/",
        "score": 1,
        "subreddit": "options",
        "created": 1603109053.0
    },
    {
        "author": "conaldpeterson1960",
        "body": "There's only 1 hpq to care about, and that's silicon.",
        "created_utc": 1603116037,
        "id": "g9bpsez",
        "permalink": "/r/stocks/comments/jd4kox/thoughts_on_hpq/g9bpsez/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603144837.0
    },
    {
        "author": "SmutBrigade",
        "body": "HPQ.  I’m balls deep into these guys.  A penny stock to hold IMO.  And if they announce TSLA as their partner??  Mooooon lol",
        "created_utc": 1603458872,
        "id": "g9r7cds",
        "permalink": "/r/pennystocks/comments/jgg0if/looking_to_drop_a_few_grand/g9r7cds/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1603487672.0
    },
    {
        "author": "BabisAllos",
        "body": "Apparently Hewlett-Packard or something is taking the market share of AMD and INTC",
        "created_utc": 1603460433,
        "id": "g9r9zc7",
        "permalink": "/r/wallstreetbets/comments/jgkeqo/daily_discussion_thread_for_october_23_2020/g9r9zc7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603489233.0
    },
    {
        "author": "Grymmful",
        "body": " \n\n* The ***PUREVAP™ “Quartz Reduction Reactors” (QRR)***, an innovative process (patent pending), which will permit the one step transformation of quartz (SiO2) into high purity silicon (Si) at reduced costs, energy input, and carbon footprint that will propagate its considerable renewable energy potential***;***  \n***°*** HPQ believes it will become the lowest cost (Capex and Opex) producer of silicon (Si) and high purity silicon metal (3N – 4N Si);\n* The ***PUREVAP™ Nano Silicon Reactor*** ***(NSiR*****)**, a new proprietary process that can use different purities of silicon (Si) as feedstock, to make spherical silicon nanopowders and nanowires;\n\n \n\n* Use their patented process and develop a capability to produce commercially porous silicon (Si) wafers and porous silicon (Si) powders;  \n° The collaboration will allow HPQ to become the lowest cost producer of porous silicon wafers for all-solid -state batteries and porous silicon powders for Li-ion batteries;  \n° Develop the hydrogen generation potential of Silicon nanopowders for usage with the Gennao™ system;  \n° Commercialize, exclusively in Canada, and non-exclusive in the U.S.A., the Gennao™ H2 system and the chemical powders required for the hydrolysis production of Hydrogen (\"H2\").",
        "created_utc": 1602687950,
        "id": "g8svqod",
        "permalink": "/r/pennystocks/comments/jb25lm/hpqv_proprietary_nano_silicon_manufacturing/g8svqod/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1602716750.0
    },
    {
        "author": "Nutmasher",
        "body": "Strategy*:  I trade 0.5% of portfolio value on a company.  Sell with 5% gain.\n\nWatchlist: I have watchlist where I add blue chips and popular holdings (per news and other sites on buig movers).  I also use my broker's stock evaluation tool (Fidelity) or simplywall.st site and then add the company's competitors that look good fundamentally.\n\nScan**:  Technical indicators scan of the watchlist looking at these 3 indicators:\n\n* Wm%R (length:  10) on 4 Hour chart: Below -80%\n* Wm%R (length:  260) on 4 Hour chart: Below -80%\n* RSI (length: 14) on 4 Hour chart:  Wilders Below 30%\n\nEntry:  Only if stock and price is considered undervalued per Fidelity, simplywall.st, and/or TDAmeritrade site analysis (e.g., JNJ, HPQ, GILD, NVAX).  If the stock is overvalued on any of these sites, I pass (e.g., SPOT, FSLY, NFE, VRSN, AXP, V, MC). You can decide for yourself if there is a discrepancy whether to buy or not.\n\nEntry price:  Look at current price and determine on 1 hr candle chart the closest breakup candle price.  Basically, draw a price level of today's low and extend LEFT.  Then, scan eyes left.  Key markers are also recent gaps; price may float down and fill before bouncing higher.  Price is attracted to these levels of support.  CAVEAT:  This is individual.  If you like the stock, and it's falling like a rock, then you can just buy at market price.  \n\nExit price:  Entry price x 1.05 to the nearest 0.25 above calculation (e.g., 22.23 x 1.05 = 23.34.  exit price limit order at 23.50).  You can then plot price level and look on candle chart again.  Scan left to find breakdown candle high and maybe choose this.  Price is attracted to these levels of resistance.\n\n*Scan will show oversold price situation short and longer term.  Oversold does not mean price cannot go lower.  Especially with RSI indicator; many times price goes lower a few days past, but RSI is higher (divergence).  This is why buying undervalued is important.  Price will likely bounce to 5% target to sell. With major selloff like yesterday, target gain could be 10% depending on how.much the company sold off.  The scan is set up in TDAmeritrade's ThinkOrSwim platform.  I get a bell every time something hits all three scan criteria.  Usually, these oversold equities have dropped so far and fast that a bounce is coming.  I usually get in 2%-10% early with this signal, so take that for what it is worth.  Experiment.\n\n**0.5% portfolio value keeps it real folks.  No all in, big payday, slow and steady wins.  When you are (-), a 10% loss is only $50 or a $100 when buying only $500 to $1000 worth of a company.  You can go higher in $ amount held (higher %), but losses are magnified.  This allows one to sleep well at night; I am not worrying about $50-$100 and I know it will come back.  Undervalued company that has good fundamentals.\n\n***You can do 1-5 equities either up to 5% stake or hold long-term or both.  Example, crypto and TSLA and AAPL.",
        "created_utc": 1604011903,
        "id": "gajkwqg",
        "permalink": "/r/investing/comments/jk0g8m/how_do_you_guys_valuate_and_pick_stocks_in_2020/gajkwqg/",
        "score": 1,
        "subreddit": "investing",
        "created": 1604040703.0
    },
    {
        "author": "artemiusgreat",
        "body": "1. you expect crash but I see only long positions...\n2. maybe hedge them, say QQQ + 5 x VXZ  [https://imgur.com/a/ARMFERT](https://imgur.com/a/ARMFERT)  \n3. or play something more market neutral, e.g. 0 DTE or cheap straddles, the cost may be decreased if one leg is option and second is shares  [https://imgur.com/a/koMu0HZ](https://imgur.com/a/koMu0HZ) , e.g. HPQ in the list on the screenshot, price of the ATM option is \\~$50, so if second leg is commission-free shares, then it only need to move 50 cents to cover the cost of the option, this week it moved $2 down  [https://imgur.com/a/uNOx2lR](https://imgur.com/a/uNOx2lR)  . 0 DTE will be even cheaper.",
        "created_utc": 1604124222,
        "id": "gaodqwp",
        "permalink": "/r/wallstreetbets/comments/jl80mx/lost_200k_in_a_week/gaodqwp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604153022.0
    },
    {
        "author": "SmutBrigade",
        "body": "Here’s a good one: I was messing around with my buy order for HPQ before I started my job for the day.  Because am retarded, instead of 10k shares I now have 40k shares at .50\n\nJfc.",
        "created_utc": 1601587391,
        "id": "g7bzn0g",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7bzn0g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601616191.0
    },
    {
        "author": "wag123456789",
        "body": "Enphase, HP (HPQ not HPE), Ciena, Aspen, Bristol-Mysers Squibb",
        "created_utc": 1602431963,
        "id": "g8hwrti",
        "permalink": "/r/stocks/comments/j93sba/you_have_to_put_all_your_money_into_5_stocks_and/g8hwrti/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602460763.0
    },
    {
        "author": "my5cent",
        "body": "Maybe hpe,  hpq?",
        "created_utc": 1602385304,
        "id": "g8f5mf7",
        "permalink": "/r/stocks/comments/j7e5po/ibm_to_spin_off_it_infrastructure_services/g8f5mf7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602414104.0
    },
    {
        "author": "connors27",
        "body": "&gt;Been dumping what little cash I have into HPQ.  Im playing when I say only $100 but fuck, there isn't much left to fuck with.  Started playing with 20,000 and I'm left with only 5,000.",
        "created_utc": 1604125304,
        "id": "gaoeski",
        "permalink": "/r/wallstreetbets/comments/jldfai/all_in_stock_for_a_broke_ass/gaoeski/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604154104.0
    },
    {
        "author": "connors27",
        "body": "Been dumping what little cash I have into HPQ.  Im playing when I say only $100 but fuck, there isn't much left to fuck with.  Started playing with 20,000 and I'm left with only 5,000.",
        "created_utc": 1604124823,
        "id": "gaoec3n",
        "permalink": "/r/wallstreetbets/comments/jldfai/all_in_stock_for_a_broke_ass/gaoec3n/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604153623.0
    },
    {
        "author": "SmutBrigade",
        "body": "HPQ.TSX-V\n\nHPQ silicone.",
        "created_utc": 1603480670,
        "id": "g9sdpvl",
        "permalink": "/r/pennystocks/comments/jgg0if/looking_to_drop_a_few_grand/g9sdpvl/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1603509470.0
    },
    {
        "author": "SmutBrigade",
        "body": "Built my position in $HPQ to 76k shares.  I’m either gonna be rich or I’m retarded as fuck.\n\nMost likely the latter.  Let’s go!!",
        "created_utc": 1601994926,
        "id": "g7wc6oj",
        "permalink": "/r/wallstreetbets/comments/j62ihd/daily_discussion_thread_for_october_06_2020/g7wc6oj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602023726.0
    },
    {
        "author": "lacasabatlot",
        "body": "boring boomer stocks won today (GM, INTC, HPQ)\n\ndoes that suggest high fear?",
        "created_utc": 1602880602,
        "id": "g91e5vx",
        "permalink": "/r/wallstreetbets/comments/jch8a4/weekend_discussion_thread_for_the_weekend_of/g91e5vx/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1602909402.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "i'm pretty sure his past updates i went from:\n\n* first few posts: \"wow big play book value is there gl\"\n* first few red posts: \"damn youre still holding? uh oh?\"\n* when it starts turning green: \"holy shit you're up 500k on these. whats the exit plan?\"\n* when it blew past 1 mil: \"the fuckkkkk\"\n* and here we are.\n\ni'm back to wondering what our dude's exit plan is. dont want this to be Marty MU 2.0",
        "created_utc": 1602188630,
        "id": "g859udi",
        "permalink": "/r/wallstreetbets/comments/j7ki10/gme_yolo_update_oct_8_2020/g859udi/",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1602217430.0
    },
    {
        "author": "manufacture_reborn",
        "body": "What ever happened to decent DD on this sub? Back in my day, we used to get amazing DD on Micron, Cisco, you name it - and I had the chance to lose money on every one. \n\nNow no one has any ideas. \n\nPutting my money where my mouth is: SEDG, ENPH, TAN are all great plays to take advantage of the energy policy platform of the likely winner of the Coasts vs Heartland battle we’re not allowed to discuss - and you should be adding to solar positions hard and fast.",
        "created_utc": 1602461983,
        "id": "g8jlleo",
        "permalink": "/r/wallstreetbets/comments/j9cghm/what_are_your_moves_tomorrow_october_12_2020/g8jlleo/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1602490783.0
    },
    {
        "author": "Catheter_Trader",
        "body": "*Dear Softbank,*\n\n*If you could do that thing you do with Micron stock, that would be great! The ticker is MU. Thanks for everything you do!*\n\n*Sincerely,* \n\nWSB",
        "created_utc": 1601926397,
        "id": "g7tjhgi",
        "permalink": "/r/wallstreetbets/comments/j5guae/daily_discussion_thread_for_october_05_2020/g7tjhgi/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601955197.0
    },
    {
        "author": "mehhhhhhhhhhhhhhhhhh",
        "body": "It's funny, I have such fondness for MU back from the good ol' days of this sub before it caught scabies. So whenever I feel bullish I buy MU calls and I get fucked just like back then.",
        "created_utc": 1601872995,
        "id": "g7ram2n",
        "permalink": "/r/wallstreetbets/comments/j55kuy/what_are_your_moves_tomorrow_october_05_2020/g7ram2n/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601901795.0
    },
    {
        "author": "garthybooks22",
        "body": "IVR - coming soon to a list near you WSB.\n\nSNOW\n\nSPCE\n\nNIO\n\nTILRAY\n\nBHC (added!)\n\nIMMU\n\nIPOC\n\nIPOB\n\nSPAQ\n\nNKLA (added!)\n\nMU\n\nSilver\n\nKodk\n\nHertz\n\nGnus\n\nPola\n\nNNOX\n\nGold\n\nPurple\n\nRKT\n\nSPAC\n\nCORN\n\nTankers\n\nNAK\n\nLL\n\nOSTK\n\nCRBP\n\nTNXP\n\nIBIO\n\nNOVN\n\nWireCard\n\nVale\n\nLoop\n\nmaybe Peloton (because WSB does pump it alot)\n\n1 This list is meant to be a REMINDER to all on WSB that usually people need to pump things and could lead to dumping things.. It's just to remember that to make money in the market, someone has to lose money..\n\n(please help add to this list and I'll keep it updated on every post that tries to pump to remind people about investing in these usually leads to dumps)",
        "created_utc": 1602627949,
        "id": "g8qmltp",
        "permalink": "/r/wallstreetbets/comments/jam3z1/ivr_5c_01182021/g8qmltp/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1602656749.0
    },
    {
        "author": "laziflores",
        "body": "Any day now my MU 90c will print",
        "created_utc": 1602272753,
        "id": "g88x1ux",
        "permalink": "/r/wallstreetbets/comments/j7wdaz/daily_discussion_thread_for_october_09_2020/g88x1ux/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1602301553.0
    },
    {
        "author": "Cr4cker",
        "body": "Ahh, my sweet summer child...\n\nThat is how it starts for all of us, a hundred off of  a TSLA call, two hundred of a BAC put. It all seems so easy. \n\nThen you start to look at what could have been. Stayed in AAPL for another day, you could have made 1k instead of 1 hundred. If you had bout 10 calls of UPS instead of 1 you would be sitting on 2 months earnings instead of the measly 350 you got.\n\nIts all been going so well, you've been printing money for weeks. Your GF's boyfriend even called you champ at breakfast this morning. Then it hits you, I'll invest 2k into MU calls and be set for the rest of the year. You watch your profit go up to $500, $ 700 , $1k , you want to sell, but then you remember how sad you felt when you watched your other options ended prematurely so you hold on. It hits 2K, your ready to pull out but then it happens... it dips... Slowly you watch that 2k shrink. 2k to 1k , 1k to 700. . You cant sell now, it has to go back up right? It was at 2k just an hour ago, it'll go back up, you know it...\n\n&amp;#x200B;\n\nBut it doesn't. It keeps going down... 700 to 500, 500 to 0....0 to -2K. And you just stare at it in your account, mocking you the same way your limp dick does every time you get out of the shower.\n\n&amp;#x200B;\n\nThat is options trading...",
        "created_utc": 1602813958,
        "id": "g8ynxb2",
        "permalink": "/r/wallstreetbets/comments/jbvg7p/thoughts_on_microgains_vs_yolo_gains/g8ynxb2/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1602842758.0
    },
    {
        "author": "garthybooks22",
        "body": "- Do I need to add LEVI to the list!?? Do I !??\n\nBYND\n\nSNOW\n\nSPCE\n\nNIO\n\nTILRAY\n\nBHC (added!)\n\nIMMU\n\nIPOC\n\nIPOB\n\nSPAQ\n\nNKLA (added!)\n\nMU\n\nSilver\n\nKodk\n\nHertz\n\nGnus\n\nPola\n\nNNOX\n\nGold\n\nPurple\n\nRKT\n\nSPAC\n\nCORN\n\nTankers\n\nNAK\n\nLL\n\nOSTK\n\nCRBP\n\nTNXP\n\nIBIO\n\nNOVN\n\nVale\n\nLoop\n\nWireCard\n\nmaybe Peloton (because WSB does pump it alot)\n\n1 This list is meant to be a REMINDER to all on WSB that usually people need to pump things and could lead to dumping things.. It's just to remember that to make money in the market, someone has to lose money..\n\n(please help add to this list and I'll keep it updated on every post that tries to pump to remind people about investing in these usually leads to dumps)",
        "created_utc": 1602777913,
        "id": "g8wrykq",
        "permalink": "/r/wallstreetbets/comments/jbqcp4/lose_your_fucking_pants/g8wrykq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602806713.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "Martymoho had over 1 mil in MU calls and was up 2.5mil at one point.\n\nHe rolled them out as the position went against him but MU basically faded to shit (from 60s to 30s) and his calls likely expired worthless.\n\nThere's various post on it but here's one summary \n\nhttps://www.reddit.com/r/wallstreetbets/comments/eaujdv/the_rise_and_fall_of_martymoho/\n\nI lost about 30k in MU calls but that has nothing on what Marty lost.\n\nI dumped my last MU baghold earlier this year before pandemic at 60s and never got back in again as it's rightfully a pos cyclical stock, no matter how well run and how much money they make.\n\nEverytime MU comes into the news or I think about getting back in, I pour one out for our boi Marty and move on to a different ticker.",
        "created_utc": 1602195073,
        "id": "g85oh7n",
        "permalink": "/r/wallstreetbets/comments/j7ki10/gme_yolo_update_oct_8_2020/g85oh7n/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602223873.0
    },
    {
        "author": "ixamnis",
        "body": "I have multiple brokerage accounts and I do have on for just investing in ETFs.  Keeping it simple is a pretty solid approach.  However, I'm not thrilled with your choices.  **VOO** and **QQQ** will have a lot of overlap, so you aren't diversifying as much as you might think. **QQQ** is a great ETF, but the underlying index it uses as a benchmark contains 100 stocks.  (The NASDAQ 100).  **VOO** uses the S&amp;P 500, so it obviously contains 500 stocks. Many of the top holdings are going to be the same in both of those ETFs: Apple, Microsoft, Google, Facebook, Netflix, Amazon. There are, of course, differences, as well.\n\nI also don't like your choice of **VYM** because of its poor return. It has a 10 year return on investment of just 115%, while VOO is double that and **QQQ** has a return of more than 4 times that of **VYM**. **VYM** will also hold many of the companies you are already investing in with **VOO**.\n\n**QQQ** has one of the highest returns of any ETF, but it is Tech-heavy, so there may be a bit more risk than **VOO**.  \n\nYou don't tell us your age, your financial goals and how averse you are to risk, but assuming you are reasonably young (more than 20 years away from retirement) and don't mind some risk, I might suggest a strategy more along the lines of:\n\n**QQQ**: 25%\n\n**VOO**: 25%   (with the understanding that there is some overlap. The blue chip stocks in VOO will help your portfolio to be a little less volatile than putting 50% into QQQ.)\n\n**SOXX:**  10% - iShares PHLX Semiconductor ETF - this is a sector ETF that invests in companies that produce semi-conductors (and related companies). The top holdings of this ETF include Broadcom, Intel, NVIDIA, Texas Instruments, Qualcomm, Micron Technology, Taiwan Semiconductor, Analog Devices and NXP Semiconductors.  The might be a little overlap with this one and QQQ, but there shouldn't be much.\n\n**ICLN:**  20% - ICLN is an ETF that invests in green/renewable energy. It is a passively managed index fund that uses the S&amp;P Global Clean Energy Index as its benchmark. Many of its holdings are outside the US.  (If you prefer a more US focused ETF that invests in renewable energy, consider QCLN instead, but be aware that its top holding is NIO, an electric vehicle maker based in China). \n\n**ARKK:**  10% - The ARK funds are actively managed and they invest in \"disruptive,\" innovative companies, many of which are in the tech sector.  Tesla is the top holding of this fund.\n\n**VXUS**: 10% - This is an investment that tracks the performance of a benchmark index that measures the investment return of stocks issued by companies located in developed and emerging markets, excluding the US. The fund tracks the FTSE all Cap ex US Index fund. Top holdings include Alibaba, Tencent Holdings, Taiwan Semiconductor (a little overlap with SOXX) Nestle, Roche Holding, SAP SE, Novartis, Toyota and ASML.  While the long term track record of this fund isn't great, the recent addition of Alibaba, Tencent and other companies signal a likely more profitable future.\n\nI think an approach like this will give you the additional diversity you are looking for and a more aggressive return than the choices you've made in your post. \n\n*I'm not a professional Financial advisor and I didn't sleep in a Holiday Inn Express last night. I do own shares in many of the funds I've listed above.*",
        "created_utc": 1602473208,
        "id": "g8k5052",
        "permalink": "/r/stocks/comments/j9gq70/separate_etf_account/g8k5052/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1602502008.0
    },
    {
        "author": "Dmoan",
        "body": "SNE, CVS, AAPL, CHWY, ATVI, AMD, PEP, GOLD are only stocks I have left. Closed most of my positions and sold off good chunk of my stocks this week. It has been good run\n\nSold off: AMZN, HD, SBUX, MU, RKT (mostly)",
        "created_utc": 1602283945,
        "id": "g89grdv",
        "permalink": "/r/wallstreetbets/comments/j869wl/weekend_discussion_thread_for_the_weekend_of/g89grdv/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602312745.0
    },
    {
        "author": "Stormchaserelite13",
        "body": "I actually did tsm and MU. Tsm makes AMDs chips and micron does nvidias.  We had the dates they would announce the cards so I bought durring a dip before then.",
        "created_utc": 1602797795,
        "id": "g8xvdtq",
        "permalink": "/r/wallstreetbets/comments/jbob8s/the_harder_they_soar_the_fsly_they_fall_44k_380k/g8xvdtq/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602826595.0
    },
    {
        "author": "MrBojangerangs",
        "body": "Well, I'm gonna get an avalanche of micron shares crushing me Monday morning lmao.",
        "created_utc": 1601668864,
        "id": "g7fs4y4",
        "permalink": "/r/wallstreetbets/comments/j3rz7r/daily_discussion_thread_for_october_02_2020/g7fs4y4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601697664.0
    },
    {
        "author": "IronManKillsThanos",
        "body": "What are the worst shares to hold? I'll start. $MU - has hovered at $45 for 3 years, and will probably stay there for another 3.",
        "created_utc": 1601913071,
        "id": "g7srawa",
        "permalink": "/r/wallstreetbets/comments/j5guae/daily_discussion_thread_for_october_05_2020/g7srawa/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601941871.0
    },
    {
        "author": "Arimir",
        "body": "$MU up 1.8% AH 👁👅👁",
        "created_utc": 1602541313,
        "id": "g8mwaxo",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8mwaxo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602570113.0
    },
    {
        "author": "_thechosenbuck",
        "body": "MU the only tech ain’t blow up yet",
        "created_utc": 1602521253,
        "id": "g8ltfjo",
        "permalink": "/r/wallstreetbets/comments/j9obtn/daily_discussion_thread_for_october_12_2020/g8ltfjo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602550053.0
    },
    {
        "author": "lululemonhead",
        "body": "MU 90c weeklies",
        "created_utc": 1601950599,
        "id": "g7uv6m2",
        "permalink": "/r/wallstreetbets/comments/j5qsww/what_are_your_moves_tomorrow_october_06_2020/g7uv6m2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601979399.0
    },
    {
        "author": "garthybooks22",
        "body": "#1 What was your dumb trade on Silver?\n\n\nIVR - maybe - (saw a few posts trying to mention it...)\n\nBYND\n\nSNOW\n\nSPCE\n\nNIO\n\nTILRAY\n\nBHC (added!)\n\nIMMU\n\nIPOC\n\nIPOB\n\nSPAQ\n\nNKLA (added!)\n\nMU\n\nSilver\n\nKodk\n\nHertz\n\nGnus\n\nPola\n\nNNOX\n\nGold\n\nPurple\n\nRKT\n\nSPAC\n\nCORN\n\nTankers\n\nNAK\n\nLL\n\nOSTK\n\nCRBP\n\nTNXP\n\nIBIO\n\nNOVN\n\nWireCard\n\nVale\n\nLoop\n\nmaybe Peloton (because WSB does pump it alot)\n\n1 This list is meant to be a REMINDER to all on WSB that usually people need to pump things and could lead to dumping things.. It's just to remember that to make money in the market, someone has to lose money..\n\n(please help add to this list and I'll keep it updated on every post that tries to pump to remind people about investing in these usually leads to dumps)",
        "created_utc": 1602711096,
        "id": "g8u5lzb",
        "permalink": "/r/wallstreetbets/comments/jba0qy/journey_to_100k_update/g8u5lzb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602739896.0
    },
    {
        "author": "VictorVEnciso",
        "body": "$INTC &amp; $MU\nWe going for that NECK on Oct 30",
        "created_utc": 1601599613,
        "id": "g7clzto",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7clzto/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601628413.0
    },
    {
        "author": "FluidOpinion",
        "body": "MU $50 calls 1-3 months til expiration. Not quick but it's a printer",
        "created_utc": 1601662198,
        "id": "g7fbjej",
        "permalink": "/r/wallstreetbets/comments/j3rz7r/daily_discussion_thread_for_october_02_2020/g7fbjej/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601690998.0
    },
    {
        "author": "TheShorterShortBus",
        "body": "Wmt? You crazy. And you're missing mu 90c",
        "created_utc": 1602212902,
        "id": "g86jujl",
        "permalink": "/r/wallstreetbets/comments/j7kf7w/what_are_your_moves_tomorrow_october_09_2020/g86jujl/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602241702.0
    },
    {
        "author": "tuffys",
        "body": "MU",
        "created_utc": 1602559041,
        "id": "g8nqmah",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8nqmah/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602587841.0
    },
    {
        "author": "VictorVEnciso",
        "body": "$INTC and $MU",
        "created_utc": 1601859386,
        "id": "g7qpqib",
        "permalink": "/r/wallstreetbets/comments/j55kuy/what_are_your_moves_tomorrow_october_05_2020/g7qpqib/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601888186.0
    },
    {
        "author": "dudz23",
        "body": "MU 90c 10/16",
        "created_utc": 1601749562,
        "id": "g7jbhq4",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7jbhq4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601778362.0
    },
    {
        "author": "CallMe_Daddy_",
        "body": "bc MU is a POS",
        "created_utc": 1601999522,
        "id": "g7wl6g7",
        "permalink": "/r/wallstreetbets/comments/j62ihd/daily_discussion_thread_for_october_06_2020/g7wl6g7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602028322.0
    },
    {
        "author": "primitivekid",
        "body": "I had almost forgot about MU",
        "created_utc": 1602192877,
        "id": "g85jt35",
        "permalink": "/r/wallstreetbets/comments/j7ki10/gme_yolo_update_oct_8_2020/g85jt35/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602221677.0
    },
    {
        "author": "MrBojangerangs",
        "body": "Micron do be mooning tho",
        "created_utc": 1602171907,
        "id": "g849h3c",
        "permalink": "/r/wallstreetbets/comments/j7agfu/daily_discussion_thread_for_october_08_2020/g849h3c/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602200707.0
    },
    {
        "author": "Pyr0smurf",
        "body": "I played this last earnings with a majority of the same points applying then and got torched. \n\nTldr this stock gives me MU style ptsd.",
        "created_utc": 1602627170,
        "id": "g8ql3eh",
        "permalink": "/r/wallstreetbets/comments/jal4bk/aci_i_want_an_order_of_some_tendies/g8ql3eh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602655970.0
    },
    {
        "author": "Flash_ina_pan",
        "body": "OMGWTFBBQ\n\nOracle, Micron, Google, Wayfair, Tesla, Ford, Alibaba, Bank of America, QQQ",
        "created_utc": 1602528221,
        "id": "g8m78sx",
        "permalink": "/r/wallstreetbets/comments/j9sor7/the_perfect_stock_acronym_lgbtq/g8m78sx/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602557021.0
    },
    {
        "author": "danby457",
        "body": "MU 👀",
        "created_utc": 1602538037,
        "id": "g8mqaqs",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8mqaqs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602566837.0
    },
    {
        "author": "Jonnydoo",
        "body": "only down 60% on my MU $90  , we gon do it boys!",
        "created_utc": 1602860436,
        "id": "g90ago9",
        "permalink": "/r/wallstreetbets/comments/jc7ao5/daily_discussion_thread_for_october_16_2020/g90ago9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602889236.0
    },
    {
        "author": "garthybooks22",
        "body": "- Well, none of these I hope!\n\n\nBYND\n\nSNOW\n\nSPCE\n\nNIO\n\nTILRAY\n\nBHC (added!)\n\nIMMU\n\nIPOC\n\nIPOB\n\nSPAQ\n\nNKLA (added!)\n\nMU\n\nSilver\n\nKodk\n\nHertz\n\nGnus\n\nPola\n\nNNOX\n\nGold\n\nPurple\n\nRKT\n\nSPAC\n\nCORN\n\nTankers\n\nNAK\n\nLL\n\nOSTK\n\nCRBP\n\nTNXP\n\nIBIO\n\nNOVN\n\nVale\n\nLoop\n\nWireCard\n\nmaybe Peloton (because WSB does pump it alot)\n\n1 This list is meant to be a REMINDER to all on WSB that usually people need to pump things and could lead to dumping things.. It's just to remember that to make money in the market, someone has to lose money..\n\n(please help add to this list and I'll keep it updated on every post that tries to pump to remind people about investing in these usually leads to dumps)",
        "created_utc": 1602776959,
        "id": "g8wq1jq",
        "permalink": "/r/wallstreetbets/comments/jbppbv/what_stonk_is_nobody_talking_about_now_but_was/g8wq1jq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602805759.0
    },
    {
        "author": "Cheeseballin33",
        "body": "damn has it been 3 years already since the rise and fall of MU",
        "created_utc": 1601913223,
        "id": "g7srlpu",
        "permalink": "/r/wallstreetbets/comments/j5guae/daily_discussion_thread_for_october_05_2020/g7srlpu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601942023.0
    },
    {
        "author": "wolfman333",
        "body": "Are MU 90cs back on the menu?",
        "created_utc": 1602190459,
        "id": "g85e9s4",
        "permalink": "/r/wallstreetbets/comments/j7kf7w/what_are_your_moves_tomorrow_october_09_2020/g85e9s4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602219259.0
    },
    {
        "author": "Dmoan",
        "body": "Sold off all my SBUX and MU slowly moving to cash gang. Up 15% for the year overall across my portfolios",
        "created_utc": 1602276007,
        "id": "g892zjq",
        "permalink": "/r/wallstreetbets/comments/j869wl/weekend_discussion_thread_for_the_weekend_of/g892zjq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602304807.0
    },
    {
        "author": "garthybooks22",
        "body": "#1 The only thing WSB would affect would be now the smart money can squeeze or pin/hold back the mentioned stock further..\n\n#2 But WSB is known to have all kinds of stupid pump and dumps and try to get people in positions that they shouldn't..\n\n#3 Occasionally there are people that mention worthy DD and respond to question with a full answer that actually has merit and rational logic.\n\n#4 WSB used to be Put $10,000 bets on options every week on TQQQ and QQQ and SPY, along with bio-tech and more... But now it's just filled with the leftovers from krusty kids etc..\n\n#5 There used to be the Micron Million dollar guy, MartyMoho? and the Jnug Gang, and the $80,000/week bought a new Cadillac in a week guy with proof, the Futures Cattle/Hog dude, the Future Church Cult guy.. The 0-Day options guys, the weekly faggots, the Leaps guys, the crazy fights between mods, the short squeeze characters with memes and stories and honor for them, and much much more fun than today etc..  \n\n#6 So yeah, WSB is just essentially now waiting for something funny and just seeing question on how to make money with $500 or etc.",
        "created_utc": 1602222644,
        "id": "g86wu8g",
        "permalink": "/r/wallstreetbets/comments/j7sqi7/i_heard_that_rwallstreetbets_was_having_a/g86wu8g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602251444.0
    },
    {
        "author": "Dmoan",
        "body": "MU is one of weirdest stock i have held I have no idea why it is going higher today.",
        "created_utc": 1602177231,
        "id": "g84k7bb",
        "permalink": "/r/wallstreetbets/comments/j7agfu/daily_discussion_thread_for_october_08_2020/g84k7bb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602206031.0
    },
    {
        "author": "danby457",
        "body": "Mu actually muuning af or a glitch?",
        "created_utc": 1602537798,
        "id": "g8mpufb",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8mpufb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602566598.0
    },
    {
        "author": "danby457",
        "body": "Guys MU 😳",
        "created_utc": 1602537926,
        "id": "g8mq373",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8mq373/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602566726.0
    },
    {
        "author": "sarunspotatoes",
        "body": "Micron good play",
        "created_utc": 1602290175,
        "id": "g89qwq2",
        "permalink": "/r/wallstreetbets/comments/j89he7/is_amd_really_going_to_go_up/g89qwq2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602318975.0
    },
    {
        "author": "DylanMagleby",
        "body": "Buy micron you god forsaken retards. I tried to help these people",
        "created_utc": 1602289791,
        "id": "g89qaa3",
        "permalink": "/r/wallstreetbets/comments/j89he7/is_amd_really_going_to_go_up/g89qaa3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602318591.0
    },
    {
        "author": "Smooothoperat0r",
        "body": "Thank you. I’ve never read the legend of Marty micron",
        "created_utc": 1602275061,
        "id": "g8919tg",
        "permalink": "/r/wallstreetbets/comments/j7ki10/gme_yolo_update_oct_8_2020/g8919tg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602303861.0
    },
    {
        "author": "GzusWritesGzusWalks",
        "body": "MU calls exp end of week, deep otm",
        "created_utc": 1602249638,
        "id": "g87pa3w",
        "permalink": "/r/wallstreetbets/comments/j7ylmy/25000_found_its_way_in_my_bank_account_how_should/g87pa3w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602278438.0
    },
    {
        "author": "Catheter_Trader",
        "body": "What’s up with the low volume AH pump on MU?",
        "created_utc": 1602539740,
        "id": "g8mtgh5",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8mtgh5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602568540.0
    },
    {
        "author": "ryanq99",
        "body": "What up with MU?",
        "created_utc": 1602540759,
        "id": "g8mvb9y",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8mvb9y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602569559.0
    },
    {
        "author": "Arimir",
        "body": "$C $MU",
        "created_utc": 1602545096,
        "id": "g8n2u3f",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8n2u3f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602573896.0
    },
    {
        "author": "BenevolentMachine",
        "body": "I don’t have anything technical to add, but I was watching it today too. It could have a ton of upside. I’m stuck between MU and INTC. I like Intel’s dividend and I think it’s undervalued. MU seems like a better growth stock while INTC is an obvious value play. I’m still making considerations.",
        "created_utc": 1602033438,
        "id": "g7yiq4c",
        "permalink": "/r/stocks/comments/j6dg0y/micron_technology_mu/g7yiq4c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602062238.0
    },
    {
        "author": "TheTetraGrammaton",
        "body": "MU channels. Up to 50-55. Then down to 40-45. Then up to 50-55.....",
        "created_utc": 1602175758,
        "id": "g84h7hu",
        "permalink": "/r/wallstreetbets/comments/j7agfu/daily_discussion_thread_for_october_08_2020/g84h7hu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602204558.0
    },
    {
        "author": "Pijoto",
        "body": "$MU doesn't have a 50-55 channel...it never stays above $50 for long, more like a 45-50 channel....  Still, nothings changed since they plummeted off a cliff since their last ER, and now they're all of a sudden back up to near $50.",
        "created_utc": 1602175988,
        "id": "g84hoc7",
        "permalink": "/r/wallstreetbets/comments/j7agfu/daily_discussion_thread_for_october_08_2020/g84hoc7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602204788.0
    },
    {
        "author": "Kingdom818",
        "body": "I've been watching MU for a while, I'm a fan",
        "created_utc": 1602038866,
        "id": "g7ys9xr",
        "permalink": "/r/stocks/comments/j6dg0y/micron_technology_mu/g7ys9xr/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602067666.0
    },
    {
        "author": "MrBojangerangs",
        "body": "Micron mooned all day with AMD. But held its gains when amd tanked",
        "created_utc": 1602178658,
        "id": "g84n4c0",
        "permalink": "/r/wallstreetbets/comments/j7agfu/daily_discussion_thread_for_october_08_2020/g84n4c0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602207458.0
    },
    {
        "author": "daileyjd",
        "body": "How to double up the at casino. Fold cash in half. Insert in pocket.  Exit casino.         \n\n\n\n\n\n\n\nJk faggots yolo 22 black &amp; $MU calls on margin TO THE MOON!        \n\n\n\n\n\n\n\nIT ONLY GOES UP 🐻🌈",
        "created_utc": 1602437237,
        "id": "g8i6i35",
        "permalink": "/r/wallstreetbets/comments/j8zfc6/it_really_do_be_like_that_doe/g8i6i35/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602466037.0
    },
    {
        "author": "ItsChublocka",
        "body": "Who was here when AMD was stagnant around $10 and when SQ and MU were forever battling around $40",
        "created_utc": 1602432339,
        "id": "g8hxfwm",
        "permalink": "/r/wallstreetbets/comments/j869wl/weekend_discussion_thread_for_the_weekend_of/g8hxfwm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602461139.0
    },
    {
        "author": "ceskanda",
        "body": "I never understood why MU reached meme status, they sell memory.",
        "created_utc": 1602432532,
        "id": "g8hxsfh",
        "permalink": "/r/wallstreetbets/comments/j869wl/weekend_discussion_thread_for_the_weekend_of/g8hxsfh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602461332.0
    },
    {
        "author": "Lmah2x",
        "body": "Around $8000 loss on $SUNE  like 5 years ago, I don't do plays that risky anymore, fortunately it was only $8k.  If I do any trading these days I only do it with ETFs. SUNE wasn't my last dumb move, I also lost about $7000 on MU about 2 years ago.  So nothing in terms of WSB losses.",
        "created_utc": 1601813750,
        "id": "g7o526e",
        "permalink": "/r/stocks/comments/j4q7w7/what_is_your_biggest_loss/g7o526e/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601842550.0
    },
    {
        "author": "MrBojangerangs",
        "body": "But does micron go up tommorrow.\n\nThey've been known to be red on green days, red on green days",
        "created_utc": 1601857368,
        "id": "g7qm8fs",
        "permalink": "/r/wallstreetbets/comments/j55kuy/what_are_your_moves_tomorrow_october_05_2020/g7qm8fs/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601886168.0
    },
    {
        "author": "MrMango34",
        "body": "Mainly NVDA and MU crossing/above the 8 ema daily  but of course AMD when it’s launching but everyone knows that’s only good for a few days or so",
        "created_utc": 1602823406,
        "id": "g8z2b23",
        "permalink": "/r/wallstreetbets/comments/jbv6u4/what_are_your_moves_tomorrow_october_16_2020/g8z2b23/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602852206.0
    },
    {
        "author": "Kymei",
        "body": "True for the stocks I gamble on, MU, soon Walgreens",
        "created_utc": 1602701700,
        "id": "g8tn6t3",
        "permalink": "/r/wallstreetbets/comments/jb5eqg/12k_yolo_on_tsm_earnings_tomorrow/g8tn6t3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602730500.0
    },
    {
        "author": "cashflow_",
        "body": "Today is so green even micron is in on the fun.",
        "created_utc": 1601556162,
        "id": "g7a37kb",
        "permalink": "/r/wallstreetbets/comments/j35to3/daily_discussion_thread_for_october_01_2020/g7a37kb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601584962.0
    },
    {
        "author": "TopStrategist",
        "body": "$90 MU Calls \n\nMU is undervalued it should easily be $90/share",
        "created_utc": 1601590360,
        "id": "g7c56vf",
        "permalink": "/r/wallstreetbets/comments/j3djkk/costco_call_option_play_since_may/g7c56vf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601619160.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "Micron (MU)",
        "created_utc": 1601746668,
        "id": "g7j5vlx",
        "permalink": "/r/stocks/comments/j4is3y/stocks_that_should_be_performing_extraordinarily/g7j5vlx/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601775468.0
    },
    {
        "author": "PregnantPickle_",
        "body": "Small pharma that got first FDA approval for new opiate in years (Olinvyk)\n\nIt’s an IV mu-opioid agonist with no beta-arrestin induction, so you get the pain relief and analgesia you want without the parasympathetic breathing depression. \n\ntldr substantially safer opioid just approved",
        "created_utc": 1601821731,
        "id": "g7olmw3",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7olmw3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601850531.0
    },
    {
        "author": "GunsouBono",
        "body": "Did my degree in Materials Engineering in Utah with an emphasis in nanomaterials. At the time, IMFT (The Intel/Micron joint venture) was the dream. That was until I saw the job... It's shift engineering. 12 hour shifts just babysitting equipment. And because they operate on seniority, newbies get night shift. Trust me, you don't need it.",
        "created_utc": 1602074039,
        "id": "g7zvb39",
        "permalink": "/r/wallstreetbets/comments/j6ioot/intel_is_fucked/g7zvb39/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602102839.0
    },
    {
        "author": "BatmanvSuperman3",
        "body": "Who was Marty MU",
        "created_utc": 1602192723,
        "id": "g85jhco",
        "permalink": "/r/wallstreetbets/comments/j7ki10/gme_yolo_update_oct_8_2020/g85jhco/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602221523.0
    },
    {
        "author": "WasabiofIP",
        "body": "Oh man pour one out for my man Marty MU, may he Rest In Silicon",
        "created_utc": 1602199811,
        "id": "g85wvxt",
        "permalink": "/r/wallstreetbets/comments/j7ki10/gme_yolo_update_oct_8_2020/g85wvxt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602228611.0
    },
    {
        "author": "Turtle-PowA",
        "body": "rip Marty MU",
        "created_utc": 1602201442,
        "id": "g85zp28",
        "permalink": "/r/wallstreetbets/comments/j7ki10/gme_yolo_update_oct_8_2020/g85zp28/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602230242.0
    },
    {
        "author": "selladoordali",
        "body": "Cuz no one had calls on micron lol",
        "created_utc": 1602178747,
        "id": "g84nawa",
        "permalink": "/r/wallstreetbets/comments/j7agfu/daily_discussion_thread_for_october_08_2020/g84nawa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602207547.0
    },
    {
        "author": "Pijoto",
        "body": "wtf is $MU up all of sudden near $50?  Bought Puts, nothings changed since their last ER day....",
        "created_utc": 1602175697,
        "id": "g84h33o",
        "permalink": "/r/wallstreetbets/comments/j7agfu/daily_discussion_thread_for_october_08_2020/g84h33o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602204497.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "who the F knows. but his last post says he was in trouble as he rolled them out to Oct calls if I recall.\n\nMU never recovered anywhere close to any of his OTM strikes...\n\nhopefully he got out with some money left.",
        "created_utc": 1602196058,
        "id": "g85q9yx",
        "permalink": "/r/wallstreetbets/comments/j7ki10/gme_yolo_update_oct_8_2020/g85q9yx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602224858.0
    },
    {
        "author": "eve314",
        "body": "No WDC is. They got a bump because they are going to split off the NAND and HDD business.  HDD are dying from NAND prices being down. Micron on there recent CC warned that if the industry doesnt cut capex the nand profitability is going to detoriate next year. Nand is dying as china is finally ramping production, and they will flood the market. Intel has been asked numerous times about exiting the NAND industry no way the expand further into it.",
        "created_utc": 1602252461,
        "id": "g87u4mm",
        "permalink": "/r/investing/comments/j7pz9a/advanced_micro_devices_is_in_advanced_talks_to/g87u4mm/",
        "score": 1,
        "subreddit": "investing",
        "created": 1602281261.0
    },
    {
        "author": "pimple_in_my_dimple",
        "body": "Here since before the times of MU and RAD my child.",
        "created_utc": 1602251171,
        "id": "g87ruyc",
        "permalink": "/r/wallstreetbets/comments/j7wdaz/daily_discussion_thread_for_october_09_2020/g87ruyc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602279971.0
    },
    {
        "author": "Disada1",
        "body": "I know who it is. I was referring to Marty who made a shit ton on $mu and then lost it all bag holding",
        "created_utc": 1602426842,
        "id": "g8ho24w",
        "permalink": "/r/wallstreetbets/comments/j968aj/if_you_think_gme_is_a_good_play/g8ho24w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602455642.0
    },
    {
        "author": "Bexanderthebex",
        "body": "aight long MU as well",
        "created_utc": 1602412536,
        "id": "g8gt8ev",
        "permalink": "/r/wallstreetbets/comments/j869wl/weekend_discussion_thread_for_the_weekend_of/g8gt8ev/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602441336.0
    },
    {
        "author": "gvbargen",
        "body": "WMT - because duh\n\nMU - honestly partially to get exposure to this industry. I feel it has a lot of potential upside in the next couple of years\n\nPCG - it's down but far from out. It's not going to go under because it can't. It will eventually reach hights similar to it's pre fire value adjusting for the added shares.\n\nGE - again down but not going to disappear. Too big to fail\n\nVWAGY - it sounds like they are closest to competing with TSLA without being exposed to that volitility",
        "created_utc": 1602463834,
        "id": "g8joz3t",
        "permalink": "/r/stocks/comments/j93sba/you_have_to_put_all_your_money_into_5_stocks_and/g8joz3t/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602492634.0
    },
    {
        "author": "PayPerTrade",
        "body": "ICLN, ARKK, MU, INTC",
        "created_utc": 1602470649,
        "id": "g8k0ye8",
        "permalink": "/r/wallstreetbets/comments/j9cghm/what_are_your_moves_tomorrow_october_12_2020/g8k0ye8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602499449.0
    },
    {
        "author": "infinitelimits00",
        "body": "Did MU get some upgrade AH?",
        "created_utc": 1602541302,
        "id": "g8mwa5z",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8mwa5z/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602570102.0
    },
    {
        "author": "upsidedownbovine",
        "body": "This MU news is good for my long LRCX calls! Show me another 3% day, baby!",
        "created_utc": 1602591769,
        "id": "g8opfii",
        "permalink": "/r/wallstreetbets/comments/jaaj59/daily_discussion_thread_for_october_13_2020/g8opfii/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602620569.0
    },
    {
        "author": "majormajorsnowden",
        "body": "What’s the deal with MU",
        "created_utc": 1602569345,
        "id": "g8o44x0",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8o44x0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602598145.0
    },
    {
        "author": "majormajorsnowden",
        "body": "Micron??",
        "created_utc": 1602569081,
        "id": "g8o3utt",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8o3utt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602597881.0
    },
    {
        "author": "ondori_co",
        "body": "MU MICRON to the mooon\n\n10/16 52.5c",
        "created_utc": 1602599840,
        "id": "g8p256o",
        "permalink": "/r/wallstreetbets/comments/jaaj59/daily_discussion_thread_for_october_13_2020/g8p256o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602628640.0
    },
    {
        "author": "DoesntUnderstandJoke",
        "body": "Hello have you heard of MU 90C?",
        "created_utc": 1602635428,
        "id": "g8qzpds",
        "permalink": "/r/wallstreetbets/comments/jag8mq/im_about_to_inherit_150k_i_dont_know_what_to_do/g8qzpds/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602664228.0
    },
    {
        "author": "MrBojangerangs",
        "body": "Getting assigned 800 shares of micron monday morning.\n\nProbably losing a G even after the premuim I Received.\n\nCongrats, one of you fucked over theta gang, imma get yo ass this week tho.",
        "created_utc": 1601844870,
        "id": "g7q052h",
        "permalink": "/r/wallstreetbets/comments/j55kuy/what_are_your_moves_tomorrow_october_05_2020/g7q052h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601873670.0
    },
    {
        "author": "GoGoButters",
        "body": "Is this still good for MU",
        "created_utc": 1602339303,
        "id": "g8bnmon",
        "permalink": "/r/wallstreetbets/comments/j8kd8j/breaking_amd_90c_101610231030/g8bnmon/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602368103.0
    },
    {
        "author": "Kymei",
        "body": "Idk man I held through MU earnings and got burned $500, and that was a small bet that should have been a $300 profit.",
        "created_utc": 1602380392,
        "id": "g8esj8x",
        "permalink": "/r/wallstreetbets/comments/j8rnxg/ally_gains_more_to_come/g8esj8x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602409192.0
    },
    {
        "author": "OPisabundleofstix",
        "body": "My man...I sold covered calls on AAPL, MSFT, AMD, SPCE and MU on Monday all are safe so far but SPCE is looking sketchy",
        "created_utc": 1602669272,
        "id": "g8s62y8",
        "permalink": "/r/wallstreetbets/comments/jas0pn/people_who_stayed_in_during_the_aapl_event/g8s62y8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602698072.0
    },
    {
        "author": "ClearVisibility",
        "body": "Because if you ignore the political headlines, tech have been doing very well. Micron doubled their profits. TSM up 33% from last year. These are big numbers that are getting overlooked. These are from Wall Street non-favored companies. The favored big tech companies report the next two weeks. Take the hints from the non-favored companies and invest in the favored ones.",
        "created_utc": 1602772734,
        "id": "g8whr5b",
        "permalink": "/r/wallstreetbets/comments/jbktdv/daily_discussion_thread_for_october_15_2020/g8whr5b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602801534.0
    },
    {
        "author": "Fragglepusss",
        "body": "I lost $12,000 in 2018 on calls in Arcelormittal and Micron and finally just went positive again. I am absolutely retarded enough for this sub.",
        "created_utc": 1602794347,
        "id": "g8xott6",
        "permalink": "/r/wallstreetbets/comments/jbpt6f/im_getting_the_fuck_out_of_us_companies_asia_will/g8xott6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602823147.0
    },
    {
        "author": "VictorVEnciso",
        "body": "$MU calls for October 30th\nThank me later",
        "created_utc": 1601541522,
        "id": "g79o3pn",
        "permalink": "/r/wallstreetbets/comments/j2z040/what_would_you_do_with_10000/g79o3pn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601570322.0
    },
    {
        "author": "EEBucks",
        "body": "Current positions\n\nSDGR 12/18\nMU 1/15/21\nNOK 1/15/21\nEXEL 1/15/21\n\nNOK 1/21/22\n\nSchrodinger is the largest position at 15k premium",
        "created_utc": 1601764063,
        "id": "g7kgrek",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7kgrek/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601792863.0
    },
    {
        "author": "Kidault",
        "body": "60k; 40k in Micron and 20k in Square in 2018 when I first started options. \n\nFortunately, it was all profit from a previous trade. I used the rest to invest in long-term option contracts and now that is up 82k over the last 1 1/2 years.",
        "created_utc": 1601792432,
        "id": "g7mpm1c",
        "permalink": "/r/stocks/comments/j4q7w7/what_is_your_biggest_loss/g7mpm1c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601821232.0
    },
    {
        "author": "thetimsterr",
        "body": "I like the idea of MU, but I hate the stock action. I sold out at $49 the other day just above breakeven. It's been stuck in this sideways channel for almost three years now, and their forward guidance does not inspire confidence. I could see it hitting $40 before it hits $60 again. I'm keeping an eye on it, don't get me wrong. Just frustrated with it is all and would rather deploy the capital elsewhere until it seems the narrative is changing.",
        "created_utc": 1602044938,
        "id": "g7z1yc5",
        "permalink": "/r/stocks/comments/j6dg0y/micron_technology_mu/g7z1yc5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602073738.0
    },
    {
        "author": "quaddles",
        "body": "Jan 2021 Mu 16%",
        "created_utc": 1602079943,
        "id": "g805i0z",
        "permalink": "/r/wallstreetbets/comments/j6o9s8/daily_discussion_thread_for_october_07_2020/g805i0z/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602108743.0
    },
    {
        "author": "cracked_0ut_pingu",
        "body": "If the stock moons you will miss out on some of the potential upside when using a spread, but you should also consider the risk compared to long stock.\n\nThe worst case for your spread isn't that the stock moons, it's that your target is wrong and the stock drops below both strikes. \n\nHere is an example with MU 11/20, which is at 48.51/share: [www.waffles.click/8bsx](https://www.waffles.click/8bsx)\n\nYour max loss in this case would be $145, or about a quarter of your portfolio in about a month and a half.\n\nWith stock, it's unlikely you'll lose more than 15% of the initial investment over 45 days. However, for the example above, the spread has a maximum loss if MU trades completely flat or declines. Break-even is at 51.45, and anything below $50 is a maximum loss.",
        "created_utc": 1602121771,
        "id": "g82feug",
        "permalink": "/r/options/comments/j5aui0/options_questions_safe_haven_thread_oct_0511_2020/g82feug/",
        "score": 1,
        "subreddit": "options",
        "created": 1602150571.0
    },
    {
        "author": "danby457",
        "body": "Mu",
        "created_utc": 1601649068,
        "id": "g7el7sw",
        "permalink": "/r/wallstreetbets/comments/j3rz7r/daily_discussion_thread_for_october_02_2020/g7el7sw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601677868.0
    },
    {
        "author": "rustysrealaf",
        "body": "Arkq MU rtx",
        "created_utc": 1602819076,
        "id": "g8yw79q",
        "permalink": "/r/stocks/comments/jbxlv5/best_stocks_under_50/g8yw79q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602847876.0
    },
    {
        "author": "mysticthebest01",
        "body": "Haha because I don’t read up much on Semicondictors economy, like micron, intel, Qualcomm all. But anyway thanks for the recommendation! :) I’ll take note!",
        "created_utc": 1602505872,
        "id": "g8l2ust",
        "permalink": "/r/stocks/comments/j9go2f/investment_advice/g8l2ust/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602534672.0
    },
    {
        "author": "jonnydoo84",
        "body": "MU $90 ONWARD!",
        "created_utc": 1602541535,
        "id": "g8mwp9r",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8mwp9r/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602570335.0
    },
    {
        "author": "fcf-whore",
        "body": "MU as memory supply tightens",
        "created_utc": 1602393515,
        "id": "g8fr067",
        "permalink": "/r/wallstreetbets/comments/j8xasu/yolo_200k_on_stocksnot_gme/g8fr067/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602422315.0
    },
    {
        "author": "cashflow_",
        "body": "Martymoho is a legend. Also fuck micron",
        "created_utc": 1602382917,
        "id": "g8ez3uc",
        "permalink": "/r/wallstreetbets/comments/j869wl/weekend_discussion_thread_for_the_weekend_of/g8ez3uc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602411717.0
    },
    {
        "author": "wiseowlsays",
        "body": "So very true - I was long puts in MU going into earnings the other day - I knew something negative was on the horizon thanks to some grey data that I found on my Newswatch service. I got into the positions early in the day and had to hold it into earnings as the stock pushed higher,  I made some money, but nothing like I should have because of the crush in volatility. Vols are always highest before the event and that change in volatility can mean the difference between a profit &amp; loss even if you call the direction correctly.",
        "created_utc": 1601562628,
        "id": "g7aegit",
        "permalink": "/r/options/comments/j30seh/pepsi_pep_earnings_tomorrow_morning/g7aegit/",
        "score": 1,
        "subreddit": "options",
        "created": 1601591428.0
    },
    {
        "author": "seattle_exile",
        "body": "Getting an Edward Norton vibe from this guy.",
        "created_utc": 1601826743,
        "id": "g7oujy7",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7oujy7/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601855543.0
    },
    {
        "author": "Trading4Retirement",
        "body": "I wanted to double down in order to average down on my PP. I have a feeling the price won’t go up to my target price and I’m worried I might have made a bad play, I don’t have a strategy yet, I’m still new to Options, My expectations were to start trading to build my retirement account and profit but I know every trader has to experience losses at one point or another. I’m not to worried about loosing, I’m worried I might not learn from my mistakes. \nAny guidance or advice is greatly appreciated\nThe current price for that NLOK call is at $0.16",
        "created_utc": 1601750620,
        "id": "g7jdqna",
        "permalink": "/r/options/comments/j15jrz/options_questions_safe_haven_thread_sept_28_oct/g7jdqna/",
        "score": 1,
        "subreddit": "options",
        "created": 1601779420.0
    },
    {
        "author": "Trading4Retirement",
        "body": "I understand what you’re saying, I do feel that NLOK should’ve been at the $22 mark by now. Given the amount of time I have left in the contract I have faith that it will climb again before Oct 16 but it won’t give me the necessary gain that I need in order to break even, which is why I was considering the double down in order to save my investment, Now I know this is a speculative on my part. I tried selling the other day at my risk tolerance which was 50% but I couldn’t bring myself to sell. I’m scared of the risk but I’m even more scared of selling and FOMO.\nThe visuals that you shared are amazing, I’ll be using that in the near future.\nAs for scaling into another position, I’ve made a play into BMY for Nov 20 $65 Call. But I don’t want to scale into anything else because the amount of buying power I have left is enough to double down on NLOK. Tough decisions lol",
        "created_utc": 1601764770,
        "id": "g7kistj",
        "permalink": "/r/options/comments/j15jrz/options_questions_safe_haven_thread_sept_28_oct/g7kistj/",
        "score": 1,
        "subreddit": "options",
        "created": 1601793570.0
    },
    {
        "author": "Trading4Retirement",
        "body": "I need the communities advice on a play that I’m in. \nNLOK Oct 16 $22 Call, Ibhave 20 Contracts and the Average PP is $0.36.\nThinking of doubling down, what do you suggest?",
        "created_utc": 1601742451,
        "id": "g7iyckl",
        "permalink": "/r/options/comments/j15jrz/options_questions_safe_haven_thread_sept_28_oct/g7iyckl/",
        "score": 1,
        "subreddit": "options",
        "created": 1601771251.0
    },
    {
        "author": "meepodota",
        "body": "the way I would approach it is, do you think NLOK will move at least 9% between now and expiration? That is about how much it has to move for you to reach breakeven $22.36 ($22 + $0.36). Ideally, you want it to rally way above/close before exp.\n\ncheck out this visual [http://opcalc.com/fcy](http://opcalc.com/fcy) Your trade will lose value to theta every day.\n\nIf you think this is a losing trade, doubling down would just add to your losses.\n\n\\`also, maybe not applicable to this trade, but instead of doubling down, you can look into scaling into a position\n\nfor example, I have been playing around with leap diagonals and I have a set amount I am willing to allot to it. I might put a couple on, if it moves in my favor, great. If not, I can average down as long as my assumption on the trade has not changed.",
        "created_utc": 1601755379,
        "id": "g7jrjpj",
        "permalink": "/r/options/comments/j15jrz/options_questions_safe_haven_thread_sept_28_oct/g7jrjpj/",
        "score": 1,
        "subreddit": "options",
        "created": 1601784179.0
    },
    {
        "author": "bravander",
        "body": "HOLY FUCK DONNY THE CLOWN MY WEEKLY THURSDAY YOLO CALLS YOU SON OF BITCH SOMEONE WAKE UP POWELL WE NEED THE PRINTERS ON NOW",
        "created_utc": 1601616615,
        "id": "g7dem8l",
        "permalink": "/r/wallstreetbets/comments/j3oi8u/donny_got_the_rona_here_comes_the_crash/g7dem8l/",
        "score": 229,
        "subreddit": "wallstreetbets",
        "created": 1601645415.0
    },
    {
        "author": "Vivid_Mood",
        "body": "So many jokes, why not give him good advice? Pretty sickening. You are all on here talking making fun of his investment, he's done well. He's up about 50% on his initial investment, which is fantastic. OP ignore people on here who're trying to discourage you from trading, you seem to be doing very well. I'd recommend to hold onto it for now, and see what else you can learn in the meantime. You seem to be on the right track, and hopefully will be able to continue to grow your investment.",
        "created_utc": 1601593149,
        "id": "g7caa93",
        "permalink": "/r/pennystocks/comments/j3imof/should_i_cash_out/g7caa93/",
        "score": 192,
        "subreddit": "pennystocks",
        "created": 1601621949.0
    },
    {
        "author": "DiceyBusiness",
        "body": "Using Family Guy, Rick &amp; Morty, and Simpsons for my DD from now on",
        "created_utc": 1601618660,
        "id": "g7dhnln",
        "permalink": "/r/wallstreetbets/comments/j3p9x0/the_simpsons_usually_arent_wrong/g7dhnln/",
        "score": 179,
        "subreddit": "wallstreetbets",
        "created": 1601647460.0
    },
    {
        "author": "project21124",
        "body": "Holy shit you can have gifs as comments now, woah",
        "created_utc": 1601594147,
        "id": "g7ccai3",
        "permalink": "/r/pennystocks/comments/j3imof/should_i_cash_out/g7ccai3/",
        "score": 152,
        "subreddit": "pennystocks",
        "created": 1601622947.0
    },
    {
        "author": "chefwithpants",
        "body": "And now he’ll brag about how strong his immune system is and that he could never be killed by a Chinese flu",
        "created_utc": 1601615659,
        "id": "g7dd547",
        "permalink": "/r/wallstreetbets/comments/j3oi8u/donny_got_the_rona_here_comes_the_crash/g7dd547/",
        "score": 97,
        "subreddit": "wallstreetbets",
        "created": 1601644459.0
    },
    {
        "author": "Klacker",
        "body": "Only thing donny pumping now is a ventilator",
        "created_utc": 1601676286,
        "id": "g7gchcw",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7gchcw/",
        "score": 92,
        "subreddit": "wallstreetbets",
        "created": 1601705086.0
    },
    {
        "author": "John_T_Conover",
        "body": "It also happened on a Friday afternoon and in an age where markets and action on Wall Street didn't react with near the speed or overwhelming force that it can now.",
        "created_utc": 1601618445,
        "id": "g7dhc2y",
        "permalink": "/r/wallstreetbets/comments/j3oi8u/donny_got_the_rona_here_comes_the_crash/g7dhc2y/",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1601647245.0
    },
    {
        "author": "bobbybob189",
        "body": "Don’t feel bad man, you still have more money than most CLIS bagholders do now 🤣😂😂😂",
        "created_utc": 1601593103,
        "id": "g7ca6wh",
        "permalink": "/r/pennystocks/comments/j3imof/should_i_cash_out/g7ca6wh/",
        "score": 84,
        "subreddit": "pennystocks",
        "created": 1601621903.0
    },
    {
        "author": "protoformx",
        "body": "Futures down more than 1.5% right now.  My question is why?  What impact does the diagnosis have on the markets or the economy?",
        "created_utc": 1601615363,
        "id": "g7dcpfc",
        "permalink": "/r/stocks/comments/j3okko/donald_trump_and_first_lady_melania_trump_test/g7dcpfc/",
        "score": 62,
        "subreddit": "stocks",
        "created": 1601644163.0
    },
    {
        "author": "SaltKick2",
        "body": "lol exactly, this shit is 98% luck\n\n&gt; Be greedy when others are fearful. I am at a stage now where I LOVE RED DAYS. Why? Because I know that in 24-48 hours the large cap growth stocks are going to recover and I will basically make close to 100% gains on my initial investment.",
        "created_utc": 1601590053,
        "id": "g7c4n0l",
        "permalink": "/r/wallstreetbets/comments/j3fx2r/3000_in_2020_my_journey_to_the_golden_7_figure/g7c4n0l/",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1601618853.0
    },
    {
        "author": "brutalpancake",
        "body": "Easy come easy go. Realize when you turn a big profit that is YOUR money now. People here like ‘whoops just lost 10k OH WELL IT WAS ALL PROFITS’ are tragically retarded. Treat your profits with respect. Cash that shit out. If you’re any good at this, it’ll be easy to do again.",
        "created_utc": 1601585014,
        "id": "g7buuis",
        "permalink": "/r/wallstreetbets/comments/j3gljk/how_to_cope_with_making_life_changing_money_and/g7buuis/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1601613814.0
    },
    {
        "author": "UsernameTaken_123",
        "body": "you show me a paystub for $800 and i quit my job right now and work for you",
        "created_utc": 1601669757,
        "id": "g7ful32",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7ful32/",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1601698557.0
    },
    {
        "author": "JosephL_55",
        "body": "Shopping yes, shorting you’ll probably be too late. You would’ve had to short yesterday. Most of the movement down is happening now in the futures market.",
        "created_utc": 1601616545,
        "id": "g7deiay",
        "permalink": "/r/stocks/comments/j3okko/donald_trump_and_first_lady_melania_trump_test/g7deiay/",
        "score": 38,
        "subreddit": "stocks",
        "created": 1601645345.0
    },
    {
        "author": "BrunoRib",
        "body": "$3k - So messed up, I want you here\n\n$15k - In my room, I want you here\n\n$0k - Now we're gonna be face-to-face",
        "created_utc": 1601588050,
        "id": "g7c0w5m",
        "permalink": "/r/wallstreetbets/comments/j3h3jo/it_doesnt_get_much_more_retarded_than_this/g7c0w5m/",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1601616850.0
    },
    {
        "author": "Blizzgrarg",
        "body": "This is pretty big news.\n\n1. Political chaos means far less likely stimulus gets passed.\n\n2. Markets hate uncertainty. And this is extreme uncertainty.\n\n3. This severely reduces his election chances. He won't be able to campaign effectively. His whole schtick of not wearing masks now looks very bad for him. And Biden was already ahead before all this. Biden/Kamala's platform is not good for corporations, with them wanting to raise the corporate tax rate and all.\n\nI don't think this is something you sleep off in a day or two.\n\nHow I could be wrong:\n\nIf Trump recovers quickly and no one else in his inner circle contracts it (Pence, McConnell), then this will evaporate like smoke. Given his age and condition, I don't think this is likely. If you want a comparable, look at what Boris Johnson went through in the UK, and he's a lot younger and healthier than Trump.",
        "created_utc": 1601618859,
        "id": "g7dhy1n",
        "permalink": "/r/investing/comments/j3omb8/president_of_the_usa_tests_positive_for_covid19/g7dhy1n/",
        "score": 36,
        "subreddit": "investing",
        "created": 1601647659.0
    },
    {
        "author": "mmanofsteel86",
        "body": "Bro, I turned one 50k account into 250k and then briefly 320k since about June and didn’t sell my calls only to watch them theta bleed now for the past 3 months without any pop. I’m about to blow that entire account pending a massive turnaround. Keep your chin up and moving forward or else you’ll go crazy. You could always be as autistic as me diamond handing what was a massive winner into a massive loser.",
        "created_utc": 1601584601,
        "id": "g7btu1u",
        "permalink": "/r/wallstreetbets/comments/j3gljk/how_to_cope_with_making_life_changing_money_and/g7btu1u/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1601613401.0
    },
    {
        "author": "nerdyspartan12",
        "body": "480 now",
        "created_utc": 1601616477,
        "id": "g7deeno",
        "permalink": "/r/wallstreetbets/comments/j3oqv3/we_about_to_expect_a_blood_bath/g7deeno/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1601645277.0
    },
    {
        "author": "Not_FaZe_Worthy",
        "body": "Now you can tell people you’re fasting",
        "created_utc": 1601622060,
        "id": "g7dmfj5",
        "permalink": "/r/wallstreetbets/comments/j3puzp/relax_u_tards/g7dmfj5/",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1601650860.0
    },
    {
        "author": "DoGooderMcDoogles",
        "body": "Palantir has only *recently* shown the signs that it'll be cash positive in BIG ways in the coming year. Their shift has also moved bigly from service-based, to software-based. This is exactly what is needed for them to increase their margins, likely by 3x easily.\n\nHopefully they will continue to develop easier-to-implement software solutions that they can sell major subscriptions for and spend less time setting things up (boots on ground).\n\nI'm also banking on them having a simpler and publicly available product that smaller-size consumers can benefit from.\n\nPersonally I also like their mix of commercial and govt contracts.\n\n&amp;#x200B;\n\nTheir future growth potential is absolutely nuts. We've all heard about Target's crazy monitoring software that can tell you when a customer is pregnant before they even know. Imagine ANY company being able to have that capability (and more), without having to build it in-house. How much would you be willing to pay Palantir to 1.2-1.5x your revenue in a single year? \n\nCompanies know that building these types of tools and data analytic programs are HARD. A company like Palantir could really become the goto source for the most advanced type of data analysis. And they will only get better... Why?...\n\nBecause once you solve tough problems for one vertical you can solve it for others in the same vertical for cheaper. So initial cost of setting up data strategy for Nike might be ($10M, loss). But now Adidas wants the same fancy tech and data. The problem space has already been solved! So cost is now +$10M (profit).\n\n&amp;#x200B;\n\nSame shit can apply to any vertical industry. Automotive, manufacturing, services, help centers, IT, healthcare, etc... Solve the problem for one company (make less money), then apply solution to other companies (major moolas).\n\n&amp;#x200B;\n\nI'm bullish because I *need* to be.",
        "created_utc": 1601577997,
        "id": "g7bdj1a",
        "permalink": "/r/wallstreetbets/comments/j3c7aq/literally_cannot_go_tits_up/g7bdj1a/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1601606797.0
    },
    {
        "author": "dabigbaws",
        "body": "I closed 40% of my positions and bought VXX calls and QQQ puts today when stimulus negotiations fell through. Guess they’re definitely going to print now 🤑",
        "created_utc": 1601617400,
        "id": "g7dfs5e",
        "permalink": "/r/wallstreetbets/comments/j3oqv3/we_about_to_expect_a_blood_bath/g7dfs5e/",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1601646200.0
    },
    {
        "author": "Teamosrs",
        "body": "Please don't end yourself.  \nYou are 26, you still have plenty of time to turn things around in life, even though right now it might not look like it.",
        "created_utc": 1601582611,
        "id": "g7bov21",
        "permalink": "/r/wallstreetbets/comments/j3fw59/im_officially_done/g7bov21/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1601611411.0
    },
    {
        "author": "Phazem",
        "body": "My life used to start on Friday evenings.\nNow it ends on Friday afternoon.",
        "created_utc": 1601669630,
        "id": "g7fu8hr",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7fu8hr/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1601698430.0
    },
    {
        "author": "zepereshk",
        "body": "I was there man, I went from $20k to $83k then in 3 weeks to $1,800. It's frustrating and soul-crushing at first, but liberating in a weird way, like you've hit rock bottom. You'll have to really try to control your impulses, stay away from super short-term plays, take profit very frequently, and don't overreact when things are not going your way. This game man is always you against you. Since I went down to $1,800, I was able to build my account back to $52k, and now I try as hard as I can to just be cerebral, and control my fucking impulse. It's hard but doable. Don't think about going back to $55k now, just think about making like $1k at a time and take profit as much as possible. Godbless!",
        "created_utc": 1601585196,
        "id": "g7bv99z",
        "permalink": "/r/wallstreetbets/comments/j3gljk/how_to_cope_with_making_life_changing_money_and/g7bv99z/",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1601613996.0
    },
    {
        "author": "WillSmokeStaleCigs",
        "body": "Amazon is already on the moon dude, they're establishing a moon base for alien strippers right now",
        "created_utc": 1601584671,
        "id": "g7bu06m",
        "permalink": "/r/wallstreetbets/comments/j3fjjb/need_to_shut_up_because_amazon_is_going_to_the/g7bu06m/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1601613471.0
    },
    {
        "author": "sucdic69",
        "body": "Damn Mango isn't even tweeting now... Bearish",
        "created_utc": 1601676730,
        "id": "g7gdoj4",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7gdoj4/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1601705530.0
    },
    {
        "author": "thatisreallyfunnyha",
        "body": "The market reacts because they fear a legit lockdown now that the virus is “serious”",
        "created_utc": 1601619635,
        "id": "g7dj2xx",
        "permalink": "/r/wallstreetbets/comments/j3oi8u/donny_got_the_rona_here_comes_the_crash/g7dj2xx/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1601648435.0
    },
    {
        "author": "MustWarn0thers",
        "body": "Hopefully McConnell croaks between now and tomorrow morning so that the GOP can weekend at Bernie's his corpse, 2 aides jiggling the neck flaps for added realism, and make him bring the stimulus bill to the senate floor where all the cowards who hide behind a single person actually have to vote their conscience in front of their constituents.\n\nThen bulls dance.",
        "created_utc": 1601601241,
        "id": "g7cp7fe",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7cp7fe/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1601630041.0
    },
    {
        "author": "stonksthrowaway730",
        "body": "Ultimate fuckery. The house is voting on the $2.2T bill now (Gonna pass), then the senate will vote on it Monday (Not passing)\n\n\nhttps://twitter.com/craigcaplan/status/1311768923327651840?s=21",
        "created_utc": 1601585557,
        "id": "g7bw0nr",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7bw0nr/",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1601614357.0
    },
    {
        "author": "silverlink22",
        "body": "Bruh remember when mfers were making fun of Joe for staying in his basement doing ZM calls and wearing a mask and having small rallies with social distancing ? 😂😂😂. \n\nFox News feels retarded now.\n\nAmazing how fast things change when someone you know has the virus. It’s so wild.",
        "created_utc": 1601692676,
        "id": "g7h5god",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7h5god/",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1601721476.0
    },
    {
        "author": "MaverickMcfly",
        "body": "Passing the stimulus now would be just in time for Prime Day",
        "created_utc": 1601586690,
        "id": "g7by9p8",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7by9p8/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1601615490.0
    },
    {
        "author": "wsbyolo666",
        "body": "people like you are the reason this sub sucks shit now",
        "created_utc": 1601658167,
        "id": "g7f30my",
        "permalink": "/r/wallstreetbets/comments/j3ye7v/im_gong_to_tendie_town_today_bois/g7f30my/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1601686967.0
    },
    {
        "author": "eyerollingsex",
        "body": "Proud Boys in shambles right now 😪",
        "created_utc": 1601677048,
        "id": "g7gejjf",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7gejjf/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1601705848.0
    },
    {
        "author": "G23456789",
        "body": "It’s the year 2050, Kodak and GameStop just got added to the S and P 500, almost every stock has now gotten S and P inclusion, Tesla is trading at $10,000 per share, it is not in the S and P 500",
        "created_utc": 1601594267,
        "id": "g7ccjfc",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7ccjfc/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1601623067.0
    },
    {
        "author": "imsilver4fukyou",
        "body": "The reason Donnie hasn’t tweeted is cause he’s sitting in his bed, deadpan, staring into the abyss like jack Nicholson in the shinning, whispering “gyna” every now and then",
        "created_utc": 1601659120,
        "id": "g7f54bf",
        "permalink": "/r/wallstreetbets/comments/j3rz7r/daily_discussion_thread_for_october_02_2020/g7f54bf/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1601687920.0
    },
    {
        "author": "kk7766",
        "body": "Him getting corona is super bullish.\n\nNow the market can moon on the fact that hes getting better, stim talks going well, and vaccine and treatment pumps.\n\nAlso once he recovers they won't be scared he will catch it since he already had it.\n\nSPY $350 EOW",
        "created_utc": 1601690001,
        "id": "g7h0wpb",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7h0wpb/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1601718801.0
    },
    {
        "author": "burgerrking",
        "body": "Breaking: pelosi and mnuchin settling their differences in a motel right now the moaning i can hear through the wall indicates talks are going well",
        "created_utc": 1601603166,
        "id": "g7csx1v",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7csx1v/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1601631966.0
    },
    {
        "author": "Bonerhawk69",
        "body": "My drug dealer had me wait 2 hours to pick up and now this mf isn’t responding to my texts. If you’re a drug dealer don’t be that fucking guy.",
        "created_utc": 1601602952,
        "id": "g7csie6",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7csie6/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1601631752.0
    },
    {
        "author": "JustSayPLZ",
        "body": "Shit story- back when I was addicted to heroin I hadn’t shit for literally a month straight. Got busted doing a deal at the park and needed to swallow all my balloons of dope. Cops didn’t find anything so let me go.\n\nBy the time I got home I was already in withdrawal and all my drugs were in my belly. Tried to make myself puke but couldn’t. Tried to shit but couldn’t.\n\nDecided to just take laxatives and snort adderol all night to get it out. Eventually I began my shitting of the month long backage inside me and every time needed to get a coat hanger to chop it up looking for the balloons of heroin. Shat like every hour and used the coat hangar every hour looking for them. Was trying to like massage my belly to get them to go through my intestines faster 😂\n\nFucking by the 10th time I pooped the balloons came out and just floated at the top of the water. Didn’t need to use the coat hangar any of those previous times. Got high.\n\nClean and sober now for many years.\n\nEdit: Positions PSTH 15.00 Calls March 2021",
        "created_utc": 1601604149,
        "id": "g7cuooc",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7cuooc/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1601632949.0
    },
    {
        "author": "TripTryad",
        "body": "LMAO Are you watching the media right now? All of the channels are currently playing his voice downplaying the virus and running his quotes of how it would be gone by Summer, next to his tweet saying he's infected...\n\nHe has campaigned on \"Weak Sleepy Joe\" and now he himself is sick with a deadly virus and has to stop campaigning for 2 weeks at least because he is too sick to travel.....",
        "created_utc": 1601621224,
        "id": "g7dlbg5",
        "permalink": "/r/investing/comments/j3omb8/president_of_the_usa_tests_positive_for_covid19/g7dlbg5/",
        "score": 22,
        "subreddit": "investing",
        "created": 1601650024.0
    },
    {
        "author": "silverlink22",
        "body": "Lol now Fox News and shit taking coronavirus serious. SMH.",
        "created_utc": 1601670126,
        "id": "g7fvldl",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7fvldl/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1601698926.0
    },
    {
        "author": "gaybearishair",
        "body": "wow, it astonishes me how many people here haven’t taken a government class.\n\n\na bill has to pass through both houses of congress to become law.\n\n\nand then the president has the power to veto it!\n\nif he wants. \n\n\ni hope u learned something just now.",
        "created_utc": 1601599876,
        "id": "g7cmhg1",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7cmhg1/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1601628676.0
    },
    {
        "author": "Ballparkbuds",
        "body": "How many people here are negative all time? \n\nI suck at this! Losing money sucks so bad, especially because I seem to paper hand positions once they are down and yet when look back at my contract if I just held it, it would have been profitable. I had NKLA $30p and sold the Friday before Milton quit and the stock tanked. I had DQ before it mooned 30%. I had GME calls that I took the advice of \"leave while you have profit!\" So I left at 20% up and missed out on like 280% more growth. \n\n  Then when I decided that wasn't working now I diamond hand and so far that isn't always working either. I held SSSS calls yesterday, thinking \"alright don't panic sell...\" only for the underlying stock to tank 10% more today. \n\nAt this point I'm just chasing losses. The only positions that have done well for me are leaps on blue chips (holding aapl 1/15/22  $110c, $115c, and $120c)\n\n https://imgur.com/5aEeEvy.jpg",
        "created_utc": 1601569327,
        "id": "g7atu6u",
        "permalink": "/r/wallstreetbets/comments/j3b00f/pain/g7atu6u/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1601598127.0
    },
    {
        "author": "endankayy",
        "body": "The name of the company, Aerotyne International. It is a cutting edge high-tech firm out of the Midwest awaiting imminent patent approval on the next generation of radar detectors that have both huge military and civilian applications now. BUY NOW",
        "created_utc": 1601602071,
        "id": "g7cqsmh",
        "permalink": "/r/wallstreetbets/comments/j3liet/i_got_10_to_start_out_with_what_do_i_do/g7cqsmh/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1601630871.0
    },
    {
        "author": "dokkanman",
        "body": "crazy I was 10 when 9/11 happened. 18 when the housing bubble happened and our house got forclosed and now I'm 29 and lost my job due to COVID....sheesh at least 80% of my portfolio are Puts",
        "created_utc": 1601618641,
        "id": "g7dhmlz",
        "permalink": "/r/wallstreetbets/comments/j3ohrm/limit_breaker_inbound/g7dhmlz/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1601647441.0
    },
    {
        "author": "NoobSniperWill",
        "body": "Now 500 points",
        "created_utc": 1601616728,
        "id": "g7desci",
        "permalink": "/r/wallstreetbets/comments/j3oqv3/we_about_to_expect_a_blood_bath/g7desci/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1601645528.0
    },
    {
        "author": "widespreadhammocks",
        "body": "so now Cramers saying we don't need stimulus?  this fucking guy",
        "created_utc": 1601611759,
        "id": "g7d7qff",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7d7qff/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1601640559.0
    },
    {
        "author": "HPScots",
        "body": "**This is escalating really fucking quickly. Yesterday they're denying anyone in the administration has a problem; now they're sending him to the hospital and admitting that he's feeling fatigued. Can you imagine if he actually fucking dies? #ISurvived2020**",
        "created_utc": 1601675973,
        "id": "g7gbmzo",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7gbmzo/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1601704773.0
    },
    {
        "author": "UsernameTaken_123",
        "body": "corona is wreaking havoc in Washington right now. 95% of congress are old boomers in the target demographic for covid\n\nswamp finna get drained, just not the way they thought it would 💀",
        "created_utc": 1601687911,
        "id": "g7gxm0y",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7gxm0y/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1601716711.0
    },
    {
        "author": "youreaditfirst",
        "body": "Wtf man now I see why this place is dead. Your politics comments get deleted your get ban. Politics its what makes this market go up or down specially right now. Come on WSB don't kill this place please",
        "created_utc": 1601692652,
        "id": "g7h5f8t",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7h5f8t/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1601721452.0
    },
    {
        "author": "Dylan-Jupp",
        "body": "This is 100% he has one of the worst debates in history and the next day its COVID? Now he can delay the debate no doubt. im scared for my money now",
        "created_utc": 1601616889,
        "id": "g7df13i",
        "permalink": "/r/stocks/comments/j3okko/donald_trump_and_first_lady_melania_trump_test/g7df13i/",
        "score": 20,
        "subreddit": "stocks",
        "created": 1601645689.0
    },
    {
        "author": "Brawmethius",
        "body": "That is when factors that Nikola can't control come into effect. Their positioning on everything I think is to prop stock price until then, which used to include the now canceled Nikola World. \n\nThings that happen in Dec.\n\n1. The GM contract has to be finalized by Dec 3. \n2. Lots of share lockups end in December as well.\n\nQuarterly reports don't mean shit for them. Everyone already knows they don't make money and don't expect to make money anytime soon. \n\nRest is storytime:\n\nIf this company is a fraud here is what the insiders want to do.\nSell their investment with out losing money or getting caught up in legal battles for fraud. \n\nSo how do you do this? Your shares are locked up until December. Therefore you want stock price to stay as high as possible until you can. But you can't come out and double down on fraud; currently Trevor Milton is the fraudster at the center of the story and you are an unlucky defrauded investor. Definitely don't want the \"new management\" to also get caught up in the narrative that they are lying about capabilities which is what got you into this mess in the first place. When you sell out you also don't want to be in the cross hairs for legal repercussions. You just need out and your bare minimum goal is not at a loss. \n\nSo the first thing you do is change the narrative, maybe release some kind of new management plan. Scrub everything related to the impossible promises from trevor milton. Maybe something like:\n\nhttps://nikolamotor.com/press_releases/nikola-executing-strategy-and-vision-to-deliver-innovative-technology-energy-and-transportation-solutions-98\n\nOkay. Interesting, look at that. Nikola One and Two are completely gone, badger isn't mentioned. Completely focus on the only thing that might actually exist, the 'Tre' (which was built and designed by another company). Make a timeline 2+ years out where everything important to the core value of the company starts to happen. So far out no more questions on that. Great now you don't have to showcase anything in the near future. No fuel cells, no nothing other than a battery truck with the 'Tre'; also primarily in Germany/Europe. Also decouple yourself with GM expectations.\n\nFantastic, you have now set yourself up to deliver nothing from now until when you can sell your shares other than show a working 'Tre' which was already built by someone else. And announce a hydrogen partnership (keyword announce a possible partnership, not do anything). Throw in a little disclaimer at the bottom that all of these deliverables depend on market conditions. Awesome. You just stabilized the discussion around what your company does into speculation, away from fraud and you don't have to prove anything that has been contested before you can sell your shares. Also you have removed the wild claims and have a luke warm timeline focused around the 'Tre'. SO when you walk away, you haven't defrauded anyone. When nikola becomes a shitty company with their single crappy BeV truck the 'Tre' that is exactly what you just timelined out for people.\n\nBut there is still one more thorn in your side. Nikola world. Promised in december to hype up prices, but needs to have deliverables. They promised to show off al this awesome shit like the One the Two the Tre and the Badger. Plus some other hydrogen shit and software. Fucking problem we have here mate, we just excluded all of that shit from our new management plan and we clearly don't have any of it. What do? Cancel Nikola world. Perfect.\n\nNow we have sell in December, there is no narrative or defending tervors fraud. And when this company becomes a one trick pony with just the 'Tre' or they try to pivot to a commercial hydrogen provider, we haven't defrauded anyone. \n\nI know that was long story time. But if you believe they are fraud, then think about what you would need to do if you knew it was a fraud and had millions locked up and you wanted out with out seeing the inside of a jail cell.",
        "created_utc": 1601571195,
        "id": "g7ay2rm",
        "permalink": "/r/wallstreetbets/comments/j39xrq/why_is_nkla_up_17_today_and_why_isnt_there_a_post/g7ay2rm/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1601599995.0
    },
    {
        "author": "YoungWokeGrasshopper",
        "body": "Was down 95%, but I deposited some money and now I’m only down 45%. STONKS\n\nEdit: SPR 12/18 24C",
        "created_utc": 1601605442,
        "id": "g7cwz7n",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7cwz7n/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1601634242.0
    },
    {
        "author": "t33po",
        "body": "After this week I'm officially lost now:\n\nFundamentals don't seem to matter\n\nExternalities don't seem to matter\n\nIt feels like the only predictable thing is when JPOW speaks otherwise I'm just throwing shit against a wall.\n\nEven consensus(smart money not wsb) plays sit there dying for weeks till my calls expire then explode 17% in one day.\n\nI've never been one to say it's rigged but I just can't make sense of anything anymore.\n\n\n\nCash and GOOG leaps. Only tiny lottos until things make sense again.\n\nThanks for quickly scrolling past my whine fest.",
        "created_utc": 1601671744,
        "id": "g7g01z2",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7g01z2/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1601700544.0
    },
    {
        "author": "SolitaryEgg",
        "body": "Guys, we did it.\n\nIt's taken us over 27 years since SPY was introduced back in 1993, but the great experiment is finally complete. We found the fair market price of SPY: 335.\n\nVery good job everyone. Stock market is now closed. Bye forever.",
        "created_utc": 1601665654,
        "id": "g7fjbi2",
        "permalink": "/r/wallstreetbets/comments/j3rz7r/daily_discussion_thread_for_october_02_2020/g7fjbi2/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1601694454.0
    },
    {
        "author": "gymleadersilver",
        "body": "And now even reddit comments are a WiFi only activity for me ☹️",
        "created_utc": 1601596243,
        "id": "g7cg6ou",
        "permalink": "/r/pennystocks/comments/j3imof/should_i_cash_out/g7cg6ou/",
        "score": 18,
        "subreddit": "pennystocks",
        "created": 1601625043.0
    },
    {
        "author": "asun350",
        "body": "Who in here was about to sleep, then the news broke, and now you can’t sleep anymore ? Lol that’s me right now !",
        "created_utc": 1601617349,
        "id": "g7dfpio",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7dfpio/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1601646149.0
    },
    {
        "author": "GoreSeeker",
        "body": "This was my first year getting into investing and I feel like it has skewed my perception of percentages. 2% as an interest rate on a savings account would be amazing, but after seeing the market move 30% overnight 2% is nothing to me now.",
        "created_utc": 1601619141,
        "id": "g7dicin",
        "permalink": "/r/investing/comments/j3omb8/president_of_the_usa_tests_positive_for_covid19/g7dicin/",
        "score": 18,
        "subreddit": "investing",
        "created": 1601647941.0
    },
    {
        "author": "Broseph__Stylin",
        "body": "I worked hard this week to get my account from 9,000 to 15,000. It is now sitting at 7,200. F",
        "created_utc": 1601658583,
        "id": "g7f3vtp",
        "permalink": "/r/wallstreetbets/comments/j3rz7r/daily_discussion_thread_for_october_02_2020/g7f3vtp/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1601687383.0
    },
    {
        "author": "yinatom",
        "body": "BAN ALL MODS \n\nTHE MODS HERE USED TO BE CFOs AND TOP FINANCIAL MANAGERS OF FORTUNE 100 COMPANIES LIKE GOLDMAN’S SACKS AND BEARS TURNS \n\nNOW THEY ARE ALL PERVS AND ANAL FARMERS IVE HAD ENOUGH OF THEIR TYRANNACY 😤😤😤\n\nWE WANT POLITICAL BULLSHIT BAN THE MODS!!!!",
        "created_utc": 1601701786,
        "id": "g7hjc02",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7hjc02/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1601730586.0
    },
    {
        "author": "ExtremelyQualified",
        "body": "This basically means the 15 min test was positive and now they’re doing longer test to confirm.",
        "created_utc": 1601609941,
        "id": "g7d4wot",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7d4wot/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1601638741.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "The clowns at CNBC tomorrow probably...  \n  \n“**We got Ja Rule on the phone. Let’s see what Ja’s thoughts are on this tragedy.**”  \n  \n*Who gives a fuck what Ja Rule thinks at a time like this?* This is ridiculous. I don’t want to dance. I’m scared to death. I want some answers that Ja Rule might not have right now.",
        "created_utc": 1601620591,
        "id": "g7dkgc0",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7dkgc0/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1601649391.0
    },
    {
        "author": "Theaznpersuasian",
        "body": "Shll is going back up right now! LFG!!!!",
        "created_utc": 1601585079,
        "id": "g7bv0ct",
        "permalink": "/r/SPACs/comments/j1gmcd/shll_graf_merger_week_megathread/g7bv0ct/",
        "score": 18,
        "subreddit": "SPACs",
        "created": 1601613879.0
    },
    {
        "author": "SilverSpirit7",
        "body": "Went up to 49k in unrealized profits, down to 3k in profits and then up to 62k, and now my account is down 1k  🤡",
        "created_utc": 1601691444,
        "id": "g7h3al7",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7h3al7/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1601720244.0
    },
    {
        "author": "pelikana20",
        "body": "Who's actually getting work done today? Too much tendies are at stake right now",
        "created_utc": 1601579973,
        "id": "g7bia9j",
        "permalink": "/r/wallstreetbets/comments/j35to3/daily_discussion_thread_for_october_01_2020/g7bia9j/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1601608773.0
    },
    {
        "author": "tgundlach1",
        "body": "##now we get to see how rigged shit really is",
        "created_utc": 1601616539,
        "id": "g7dehzz",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7dehzz/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1601645339.0
    },
    {
        "author": "BaxterFax",
        "body": "God I could use that $1200 right about now",
        "created_utc": 1601592496,
        "id": "g7c8yxl",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7c8yxl/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1601621296.0
    },
    {
        "author": "BeneficialHeart8",
        "body": "Hey mods your dumbass filters that block anything that says a word as basic as c0ngr3ss are dumb as shit. We acting like this market is only hanging on by stimi hopes now? Smd. 🖕🏾",
        "created_utc": 1601753468,
        "id": "g7jm2ad",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7jm2ad/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1601782268.0
    },
    {
        "author": "DoctorBalpak",
        "body": "That press release is fishy af. Why would they give him Remdesivir if he was doing \"very well\" without it ? First that antibody cocktail, rushed hospitalisation and now this. They're playing us.",
        "created_utc": 1601697712,
        "id": "g7hdruo",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7hdruo/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1601726512.0
    },
    {
        "author": "sugaraurora",
        "body": "it blows my mind how ppl actually believe we are gonna go lower than MARCH... after 7 months of pandemic living.... like really? we are gonna FEAR NOW? human ADAPT",
        "created_utc": 1601628315,
        "id": "g7dsx48",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7dsx48/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1601657115.0
    },
    {
        "author": "EricsonGQMan33",
        "body": "At the start of September I had roughly 10k in savings and 8k in Robinhood  I used 3.5k on a pc and new desk. Now my computer caught fire and my Robinhood account is at 13 dollars. I love getting fuckked 🤤",
        "created_utc": 1601624283,
        "id": "g7dos1k",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7dos1k/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1601653083.0
    },
    {
        "author": "John_Whisk",
        "body": "Honestly I don’t think anything is going to come from this Pelosi / Mnuchin talk, and we’re gonna drop soon. There’s no way a random phone call now AGAIN is going to turn the tide. Maybe I’m wrong, but something doesn’t feel right",
        "created_utc": 1601572442,
        "id": "g7b0uf5",
        "permalink": "/r/wallstreetbets/comments/j35to3/daily_discussion_thread_for_october_01_2020/g7b0uf5/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1601601242.0
    },
    {
        "author": "DustyBowls",
        "body": "Corporate America: Thanks for the tax cuts and the bailouts. The buybacks have been great.\nNow let's fire some people.",
        "created_utc": 1601567361,
        "id": "g7apa58",
        "permalink": "/r/wallstreetbets/comments/j35to3/daily_discussion_thread_for_october_01_2020/g7apa58/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601596161.0
    },
    {
        "author": "invasion16",
        "body": "HOLY FUCK WHAT IF HE WAS DEAD RIGHT NOW AND BARONN MADE THEM WAIT SO HE COULD OPEN A FUTURES ACCOUNT TO BUY PUTS",
        "created_utc": 1601674282,
        "id": "g7g6zox",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7g6zox/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601703082.0
    },
    {
        "author": "bye_stander",
        "body": "then go pay your brokerage commission\n\nhaha, who's laughing now?",
        "created_utc": 1601618622,
        "id": "g7dhlj0",
        "permalink": "/r/wallstreetbets/comments/j3p4iz/load_up_on_discounted_calls/g7dhlj0/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601647422.0
    },
    {
        "author": "Domgrath42",
        "body": "I heard from a reliable source that Donnie is faking having covid so he can show up on Monday's presser declaring, \"Told you guys covid is not that bad! Reopen everything now!\"",
        "created_utc": 1601675436,
        "id": "g7ga666",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7ga666/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601704236.0
    },
    {
        "author": "Alepman",
        "body": "Buy high sell low is my everyday strategy, now my chance to buy low and sell lower",
        "created_utc": 1601619418,
        "id": "g7dir9v",
        "permalink": "/r/wallstreetbets/comments/j3p9x0/the_simpsons_usually_arent_wrong/g7dir9v/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601648218.0
    },
    {
        "author": "BrighttLightt",
        "body": "Pence is the President right now.",
        "created_utc": 1601672562,
        "id": "g7g2ai8",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7g2ai8/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601701362.0
    },
    {
        "author": "Used_Principle_941",
        "body": "This is a classic con job. Raise money for initialize investors, do some razzle dazzle to gain more cash. Once your cash heavy and people start to question you, take that cash and “partner” with reputable names. GM and CNH Industrials are, to my understanding, just providing services. Now if nikola admitted that they don’t have the expertise to build what they promised, they would be done with. \n\nThe trick is to call these contracted companies “partners”.  Partner suggests a joint venture where both parties are contributing to a mutually beneficial goal. In the case of Nikola, the “partners” have no skin in the game, if Nikola folded tomorrow, all they would lose is a paycheck for services. Now if your a contractor working for another company, you’d be stupid to admit there is a problem publicly, so these companies express optimism knowing they have nothing to lose. All this builds investors confidence as the house of cards keeps being built.\n\nI could be wrong, but I’m pretty sure that’s what this is. I am short Nikola.",
        "created_utc": 1601576456,
        "id": "g7ba1mt",
        "permalink": "/r/wallstreetbets/comments/j39xrq/why_is_nkla_up_17_today_and_why_isnt_there_a_post/g7ba1mt/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601605256.0
    },
    {
        "author": "NoCollegeKids",
        "body": "Oh, Nasdaq is at -2.2% now?  Thank goodness. I was afraid my calls would still have some value.",
        "created_utc": 1601616914,
        "id": "g7df2i2",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7df2i2/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601645714.0
    },
    {
        "author": "SchwarzerKaffee",
        "body": "How about now?",
        "created_utc": 1601616711,
        "id": "g7derfq",
        "permalink": "/r/wallstreetbets/comments/j3oqv3/we_about_to_expect_a_blood_bath/g7derfq/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601645511.0
    },
    {
        "author": "nebula504",
        "body": "Even if futures open down -3% Sunday evening, I have absolutely no faith that it will remain red. Ive been disappointed too many times by now (I'm a bear)",
        "created_utc": 1601676009,
        "id": "g7gbqkr",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7gbqkr/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601704809.0
    },
    {
        "author": "King0fAmericans",
        "body": "No stim package and Donny with rona. Everything and their mother is priced in right now.",
        "created_utc": 1601666527,
        "id": "g7flopg",
        "permalink": "/r/wallstreetbets/comments/j3rz7r/daily_discussion_thread_for_october_02_2020/g7flopg/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601695327.0
    },
    {
        "author": "yeetdabbitydab",
        "body": "Im officially depressed. I went from 10k -&gt; 3k in a week. I don’t necessarily need the money right now but all that money was earned from this summer. Fuck me.",
        "created_utc": 1601693501,
        "id": "g7h6vwo",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7h6vwo/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601722301.0
    },
    {
        "author": "troylus81",
        "body": "Stimulus failing at the house is bullish. Means Nancy will have to go down further on bill to meet gop demands. She doesn't even have the full support of her own party. She will need to cut a deal now.",
        "created_utc": 1601597196,
        "id": "g7chsko",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7chsko/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601625996.0
    },
    {
        "author": "absoluteScientific",
        "body": "Crippling depression. I’m having an episode right now.\n\nEdit: honestly thank you for asking and I’m grateful for anyone taking the time to even read this",
        "created_utc": 1601680932,
        "id": "g7gmfz4",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7gmfz4/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601709732.0
    },
    {
        "author": "NoCollegeKids",
        "body": "Since we are sharing shit stories....\nWhen I was still living with my folks at 22, I came home about 2am drunk and coked up.  I had to shit terribly and knew I couldn’t make it up the stairs to my bathroom.  And I wasn’t going to use the downstairs for fear of waking my folks up, in my tweaked state.  I had to clean up the dog shit the next day anyway, so I just decided to shit in the back yard.  Congratulating myself for my intuition, I walk up to the back door and our beagle is scratching to come out.  I didn’t want him to start barking so I let him outside.  He immediately ran over to my pile of shit, sniffed it, stared at it, then proceeded to backflip right into it.  My fucking jaw hit the grass as I quietly yelled “Jimmy...NOOoOOoO!”\nIt’s 2am, I’m fucked up, and now rinsing shit off a beagle in the family pool.  I couldn’t get him to stay still for the hose.  The next day I gave him a proper bath.\nThank fuck nobody woke up.",
        "created_utc": 1601603441,
        "id": "g7cteu5",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7cteu5/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601632241.0
    },
    {
        "author": "syu425",
        "body": "Here is what you should do, delete your trading app and reinstall a week from now.",
        "created_utc": 1601584274,
        "id": "g7bt1jb",
        "permalink": "/r/SPACs/comments/j3g0ua/holding_50_shares_of_shll_at_47/g7bt1jb/",
        "score": 15,
        "subreddit": "SPACs",
        "created": 1601613074.0
    },
    {
        "author": "getcheezed",
        "body": "I’ve read “walking in to heli” several times now as “walking in to hell” , coincidence? Maybe",
        "created_utc": 1601677584,
        "id": "g7gfylh",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7gfylh/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601706384.0
    },
    {
        "author": "CyanideMuffins",
        "body": "I fucking hate the assholes in here who egg on the hype to unrealistic levels and give out delusional advice with projections based purely on what they want. There was a highly upvoted thread earlier this week telling people not to sell our \"beloved\" stock of the week until after the ticker change. How many people got fucked over by that shit?\n\nThe truth is, no one knows what the fuck any stock will do on a given day. And you piece of shit pumpers know that. Yet you go around manufacturing certainty where none actually exists. \n\nHilarious how these dickholes are all silent now. Either that or they joined the equally obnoxious group of redditors who allegedly knew how this week would pan out because it was just so goddamn obvious apparently. \n\nAlso, the dude is not your \"papa\". He doesn't know who you are. He doesn't give a shit about you or your RH account. He will do whatever is in his best interest, and your wishes really don't factor into that. Stop glorifying these people. Stop turning these communities into creepy cults. Just kindly fuck off.",
        "created_utc": 1601677723,
        "id": "g7ggajm",
        "permalink": "/r/SPACs/comments/j1gfny/weekly_discussion_september_28th_october_4th/g7ggajm/",
        "score": 15,
        "subreddit": "SPACs",
        "created": 1601706523.0
    },
    {
        "author": "BrighttLightt",
        "body": "Presidents been awfully fucking quiet on Twitter. \n\nI think this is worse than what they're saying. I think he's in trouble right now. \n\nIt'll come out over the weekend and we'll crash very hard. \n\nRemindMe! 3 days so I can either laugh at my dramatic ass or say I knew it 🤷🏻‍♂️",
        "created_utc": 1601662824,
        "id": "g7fcrds",
        "permalink": "/r/wallstreetbets/comments/j3rz7r/daily_discussion_thread_for_october_02_2020/g7fcrds/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601691624.0
    },
    {
        "author": "clavitopaz",
        "body": "NOT A POLITICAL COMMENT\n\nWhy would anyone be so concerned with overspending on a stimulus? Who gives a flying fuck that we don’t have a balanced budget sheet right now, we’re in a fucking pandemic.\n\nJust approve the $2.4 trillion, people are literally dying and businesses are failing. Also we want fucking tendies.",
        "created_utc": 1601568384,
        "id": "g7arncl",
        "permalink": "/r/wallstreetbets/comments/j35to3/daily_discussion_thread_for_october_01_2020/g7arncl/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1601597184.0
    },
    {
        "author": "xodiacpraiz",
        "body": "I mean... we also have a lot more people now than we did in 1970",
        "created_utc": 1601571468,
        "id": "g7ayp09",
        "permalink": "/r/investing/comments/j37qh4/initial_jobless_claims_for_the_week_ending_on/g7ayp09/",
        "score": 15,
        "subreddit": "investing",
        "created": 1601600268.0
    },
    {
        "author": "LargerFiend",
        "body": "Imagine if Covid didnt happen. We would be at SPY 500 by now",
        "created_utc": 1601621285,
        "id": "g7dlei9",
        "permalink": "/r/wallstreetbets/comments/j3g70c/what_are_your_moves_tomorrow_october_02_2020/g7dlei9/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1601650085.0
    },
    {
        "author": "abunchofsoandso",
        "body": "Don't let it expire. Sell that now",
        "created_utc": 1601577795,
        "id": "g7bd2qm",
        "permalink": "/r/options/comments/j3ejrm/selling_options_early/g7bd2qm/",
        "score": 14,
        "subreddit": "options",
        "created": 1601606595.0
    },
    {
        "author": "Stonk_Wizard69",
        "body": "Positions now",
        "created_utc": 1601591419,
        "id": "g7c73fo",
        "permalink": "/r/wallstreetbets/comments/j3iqk4/i_turned_11_into_1343_in_8_trading_days/g7c73fo/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1601620219.0
    },
    {
        "author": "iredditacc",
        "body": "This market right now has to be my least favorite anime",
        "created_utc": 1601672708,
        "id": "g7g2owx",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7g2owx/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1601701508.0
    },
    {
        "author": "circular0101",
        "body": "Think about how you felt when you saw the video of him going to Walter Reed Hospital.  \n\nNow imagine watching it on a brand new iPhone 12.",
        "created_utc": 1601677212,
        "id": "g7gezly",
        "permalink": "/r/wallstreetbets/comments/j41xw2/weekend_discussion_thread_for_the_weekend_of/g7gezly/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1601706012.0
    },
    {
        "author": "System777",
        "body": "Prob cause if it’s up 112% this year you already missed the boat if you didn’t buy it. Now with the news newbie investors will likely FOMO buy, drive the price up even higher until the bubble pops and they lose their shirts... maybe.",
        "created_utc": 1601694882,
        "id": "g7h98ox",
        "permalink": "/r/stocks/comments/j43she/trump_hospitalized_at_walter_reed_hospital_for/g7h98ox/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1601723682.0
    },
    {
        "author": "BobbyPhistHer",
        "body": "I want to insult you so bad, but I’ll try to help instead. The federal reserve did not design the stimulus to inflate the stock market. Big money is putting the funds into the market, because it’s one of the only way to make returns right now. Savings accounts are shit because of the lowered interest rates. It’s easier to borrow money, so the banks are lending and people are putting the money into real estate (inflated asset prices)...same with gold, silver, etc.\n\nThe majority of the population don’t understand economics, so they don’t realize how fucked everything is right now. I assume the fed dishes the money out with good intentions, but smart money understands how fucked the economy is and will be in the future. They’re just trying to make as much as they can before the real crash, and the wealth gap will be tremendous.",
        "created_utc": 1601567133,
        "id": "g7aoqw9",
        "permalink": "/r/wallstreetbets/comments/j3aj7n/inflation_is_happening_now_but_its_in_the_stock/g7aoqw9/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1601595933.0
    },
    {
        "author": "sadsolipsist",
        "body": "Friendship ended with PLTR, now the next IPO is my best friend",
        "created_utc": 1601574166,
        "id": "g7b4rd4",
        "permalink": "/r/wallstreetbets/comments/j35to3/daily_discussion_thread_for_october_01_2020/g7b4rd4/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1601602966.0
    },
    {
        "author": "UpSideofDown",
        "body": "Not PAYX but played PAYC a few months ago who beat but still dropped.  I don’t fuck with earnings anymore...",
        "created_utc": 1601555666,
        "id": "g7a2hcg",
        "permalink": "/r/wallstreetbets/comments/j35to3/daily_discussion_thread_for_october_01_2020/g7a2hcg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601584466.0
    },
    {
        "author": "shepherd_eyes",
        "body": "Anyone playing PAYX earnings?",
        "created_utc": 1601555456,
        "id": "g7a26jn",
        "permalink": "/r/wallstreetbets/comments/j35to3/daily_discussion_thread_for_october_01_2020/g7a26jn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601584256.0
    }
]