[
    {
        "author": "jjwalla",
        "body": "I rode the weed bubble and got out almost at the perfect time. I would only invest in Aphira, as they have the best quality in Canada and didn't go so crazy with expansion that they are bleeding money every quarter.\n\nThe big names (ACB, WEED, APH) all have the potential for US expansion but have been screwed over in my opinion on the governments roll out of weed here in Canada. \n\nThere was a million dispensaries pre-legalization here in BC, and every single one seemed to be absolutely booming in terms of business.  I am a regular user and I've boughten government weed twice, neither time did I feel like I was getting a good price/quality ratio.\n\nIn my opinion Canadian weed companies won't start doing well until the regular users have the option to purchase bulk at a significant discount, something that the government in Canada doesn't seem keen on. \n\nIn terms of US expansion, it comes down to states legalizing and the hope that the big players can offer a better price/quality than their new competitors.",
        "created_utc": 1593139560,
        "id": "fw0uauu",
        "score": 3,
        "subreddit": "investing",
        "created": 1593168360.0
    },
    {
        "author": "shrimpslushie",
        "body": "Bias but if you're looking for long term, APH, VFF, GTI, riskier but TBP~",
        "created_utc": 1591450885,
        "id": "ft4d3k4",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591479685.0
    },
    {
        "author": "MrShady18",
        "body": "Honestly a month ago I made the decision to try out penny stocks and I've never been happier. Still holding my main picks for canada (APH) and US (GTI, TRUL, CL)",
        "created_utc": 1592943920,
        "id": "fvs37ml",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1592972720.0
    },
    {
        "author": "skinniks",
        "body": "It's Betting Bruiser so I assume the joint committee will be formed after the SEC investigation into Aph is finished and Aph buys OGI with the money they save from shuttering their entire LATAM operations and once Alberta bails out ACB.",
        "created_utc": 1593534345,
        "id": "fwhm416",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1593563145.0
    },
    {
        "author": "OldTracker",
        "body": "Too add Dr, If Aph goes below $4.80 Ca, I will ease back in. Might not happen but it's happened before many times. If I miss out and it climbs to $10. because of earnings, I may get back in then too. What a sector! But it's treated me well so far. Cheers.",
        "created_utc": 1592276025,
        "id": "fuz1a4d",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1592304825.0
    },
    {
        "author": "baconcheeseburgarian",
        "body": "They are terribly managed, they have a host of problems across all their programs, their engineers are pissed, morale is in the toilet, the debt keeps growing and Airbus is frankly kicking their ass.\n\nI'd much rather own Lockheed, Raytheon, GD, NOC, HON, APH, etc.  There's a whole lot more defense money going to better managed companies.  \n\nBoeing has too many problems in the short and long term.  I'm steering clear.",
        "created_utc": 1591936386,
        "id": "ftrtxp3",
        "score": 1,
        "subreddit": "investing",
        "created": 1591965186.0
    },
    {
        "author": "Shotgun516",
        "body": "Anyone realistically expects APH to get to $5.50 USD at some point in the next week or two?",
        "created_utc": 1591714324,
        "id": "fthbura",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591743124.0
    },
    {
        "author": "skinniks",
        "body": "I got stoned last week and bought 4 bags of chips.  Fuck APH for fleecing me like that!",
        "created_utc": 1591109601,
        "id": "fsn2cf6",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591138401.0
    },
    {
        "author": "cory_ander69",
        "body": "Anybody noticed the strenght of aph at 5.96? Its been going down to 5.96, popping to the low to mid 6 and goes back to 5.96 every once in awhile for the last few weeks. What do ya'll think of that?",
        "created_utc": 1592839164,
        "id": "fvn7a4b",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1592867964.0
    },
    {
        "author": "ankuo",
        "body": "Yes, adding every month. 1k shares at 4.10 avg cost. My two weed plays are Cgc and aphria. Cgc because it’s backed by a conglomerate, and aph due to its conservative and balanced financials. I reviewed the other companies and I would not touch them (VFF might be an exception)",
        "created_utc": 1592959415,
        "id": "fvswq0n",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1592988215.0
    },
    {
        "author": "AdvocateorAbdicate",
        "body": "Buy 100 APH now or at Lunch?",
        "created_utc": 1593093488,
        "id": "fvydn6p",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1593122288.0
    },
    {
        "author": "4Inv2est0",
        "body": "As someone watching Aleafia for some time, getting their deposit back plus some is a big deal.   \n   \nSucks for APH but they had screwed Emblem on that, especially being a small cap without the same capital resources that Aphria had.   \n   \nYes Aleafia won this round, but it's the long term game of who will be here and profitable in 2 years. Aphria still focused on their massive greenhouses, Aleafia going full throttle into commercial outdoor growing.     \n    \nTwo Interesting LPs to watch, especially with what AH gets paid out here. No question that it gives them greater flexibility.",
        "created_utc": 1593178384,
        "id": "fw2732j",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1593207184.0
    },
    {
        "author": "LavisAlex",
        "body": "Great probably an overreaction and a sell off to the news 😬 I swear the CEO could sneeze and Aph would lose 10%.\n\nSorry just frustrated with how this came to be given all the gov delays and incompetence.",
        "created_utc": 1593104721,
        "id": "fvyzmgo",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1593133521.0
    },
    {
        "author": "BoomBoom_King",
        "body": "First of all, loving the discussion and the points you are bringing to the table. In order for both CGC and APH to win, the industry needs to grow exponentially. So I really hope Aphria succeeds too for the growth of the industry overall.\n\nI would also like to mention that Canopy might have poo flower in Canada, but have been getting huge praise in the states for their Tweed and twd brands. Keep in mind there are 1000's of flower strains out there. If CGC really wanted to compete, they could purchase a company like Aph did with Broken coast to get that ball rolling again. \n\n1) Gave them assets and brands along the way, but agree the writedowns will be attrocious\n\n2)Buyouts will be extremely important though for both branding and innovation. Industry is still in its infancy and Canopy is tight lipped on their R&amp;D efforts. We dont really know what is happening behind the scenes. Could it be nothing? Maybe, but I highly doubt it.\n\n3) Retail margins aside, brand positioning and shelf space is what needs to be looked at.\n\n4) Canada was never the market to be focused on. Klein basically said Canada is a proof of concept for USA and Germany. Having Consellation own canopy is the biggest advantage canopy has over others.\n\n7) agreed. I do however tip my hat to APH's large pharmacy presence in the EU.\n\n9) Not yet at least. I cant wait for the day when Zeke Elliott gets on screen and promoting canopy during commercials, or the Brooklyn Nets showing Biosteel CBD at their games.",
        "created_utc": 1592679937,
        "id": "fvgrs5z",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1592708737.0
    },
    {
        "author": "LeaveTheWorldBehind",
        "body": "At a glance, APH and WEED charts look identical andSpy is up so 🤷🏼‍♂️",
        "created_utc": 1591193388,
        "id": "fsqy56s",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591222188.0
    },
    {
        "author": "skinniks",
        "body": "What if Merton The Younger wasn't high as fuck when he said Aph had 70% of the Ontario vape market.  Dare one dream?",
        "created_utc": 1591145641,
        "id": "fsp3jua",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591174441.0
    },
    {
        "author": "BackdoorBrain",
        "body": "I highly doubt it. Bruce isn't running the first and biggest, most hyped pot company this time. I think the majority of that kind of influence now rests with APH",
        "created_utc": 1591660506,
        "id": "ftf9kna",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591689306.0
    },
    {
        "author": "jymma15",
        "body": "Having a hard time wrapping my head around these numbers. How is it that Aph isn't in the top 5? This is quite disappointing.",
        "created_utc": 1591665421,
        "id": "ftfi9mx",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591694221.0
    },
    {
        "author": "LeaveTheWorldBehind",
        "body": "They’re also buying APH at $6+ during a bull run... that’s poor judgement, given the volatility we’ve seen. There’s odds of making money and much higher odds of losing when you follow that deep into a run 🤷🏼‍♂️\n\nI lost on IAN indeed, I never imagined it would plummet that hard. Take the lesson there too I guess, I sure did 🙂\n\nDisagree with “low rewards” and thats my point. Its incredibly lucrative to trade, thats why we are here.",
        "created_utc": 1591891869,
        "id": "ftpi6zh",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591920669.0
    },
    {
        "author": "stockresearcher18224",
        "body": "Regardless, they are trading at a multiple that is at a premium to both APH and OGI on a multiple of sales or forward earnings, and they have a meaningfully worse business (structurally busted cost structure) and way lower sales and market share. It's clearly too expensive and could half and still be expensive vs sales or potential future earnings.",
        "created_utc": 1591811313,
        "id": "ftlu3ec",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591840113.0
    },
    {
        "author": "CannaVestments",
        "body": "No... San Rafael was separate from Aurora as well and was huge in its own, tokyo smoke separate from tweed, and so on. It just depends on how the products were branded and Aph sells through a greater number of distinct brand lines",
        "created_utc": 1591722807,
        "id": "fthtbx9",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591751607.0
    },
    {
        "author": "kevlarcoozie",
        "body": "Microsoft teams, Cisco WebEx, Google just rolled out their version, this stuff ain't exactly ground breaking.",
        "created_utc": 1591152115,
        "id": "fspeuq1",
        "score": 42,
        "subreddit": "stocks",
        "created": 1591180915.0
    },
    {
        "author": "joeschmo28",
        "body": "This is just not true. I worked for one of the largest technology companies in the world and they switched from Cisco WebEx to Zoom. It was such an improvement it’s not even funny.",
        "created_utc": 1591148710,
        "id": "fsp8yod",
        "score": 19,
        "subreddit": "stocks",
        "created": 1591177510.0
    },
    {
        "author": "Cwc123",
        "body": "Imagine being a zm bear LMAO. They have competition by fb,cisco, msft, googl? What a joke! Do you really think these companies have the capital to program a video chat app, the most innovative technology in the world? And what, they will offer these services for free to their users as part of an integrated bundle of products that are used by every organization in the world? Who cares? Companies dont care about adding new costs. And what, they have security issues. ok? what company cares about securities or hackes? Thats right,none. Oh and the best one. ItS oVErValUed. no? they generated 27m income this quarter. this means that if you buy zm now, you turn a profit in 600 years. Are you really that fcking impatient? You cant wait? And so what if they had their best quarter ever and will never see anything close to that ever again? Video conferencing is the futur. Want to go play golf? lmao good one, crack a cold beer and talk on zoom. Your boss wants you to meet an important client for good first impressions? lmao fuck that, just call him on zm while wearing boxers and a suit top. no companies will have offices after this year. none. they will all use zm. everyone will work remote.",
        "created_utc": 1591232366,
        "id": "fst6o52",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591261166.0
    },
    {
        "author": "baycommuter",
        "body": "In 1999 was a company called 3Com that was failing badly trying to compete with Cisco. Everyone knew it was a dog. It happened to own through acquisition a company called Palm, which made the original Palm Pilot and was developing the world’s first smartphone. \nI knew a lot about Palm and bought 3Com calls. \n\n3Com decided to spin Palm off and goes to Goldman, who tells them to just release 30 million shares and keep the rest to keep demand higher than supply. This is at the top of the tech bubble. I keep buying calls. The Palm roadshow goes great and it’s one of the hottest IPOs ever because Goldman is keeping most of the shares locked in  3Com, probably doing the same play I am.\n\nThe first week in March 2000 my calls rise $200,000 in three days Monday to Wednesday. Palm goes public on Thursday and by 11 o’clock the embedded value of the Palm stock in 3Com is worth more than 3Com, which is logically impossible. \n\nAnyhow, I’m a millionaire for the first time and realize shit, if I sell these calls I’ll be paying $200,000 in taxes, maybe I can exercise and convert. Well, the tech bubble suddenly  deflates, and I wind up with only a $100,000 profit. \n\nI did get my first BMW out of it.",
        "created_utc": 1591398430,
        "id": "ft0x3mm",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591427230.0
    },
    {
        "author": "patsekaf",
        "body": "Rate my options: DIS 130c, MGM 25c, FB 255c, CSCO 50c, CHWY 50c",
        "created_utc": 1591496774,
        "id": "ft8abhr",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591525574.0
    },
    {
        "author": "dreammanalishi",
        "body": "I usually wait til the morning to decide, but Friday morning's list was...\n\nAYX\n\nBAH\n\nBLK\n\nBLL\n\nCAT\n\nCERN\n\nCL\n\nCMCSA\n\nCNSL\n\nCPB\n\nCSCO\n\nCTVA\n\nCVNA\n\nCZR\n\nDB\n\nDE\n\nDIS\n\nELF\n\nERIC\n\nGGG\n\nHD\n\nHLF\n\nHMC\n\nHUBB\n\nIEC\n\nINTC\n\nJNPR\n\nKDP\n\nKWR\n\nLANC\n\nLMT\n\nLOW\n\nLRCX\n\nMA\n\nMJCO\n\nMMM\n\nMORN\n\nMS\n\nMU\n\nMWA\n\nOOMA\n\nPAYC\n\nPCAR\n\nPCTY\n\nPSTG\n\nQCOM\n\nRACE\n\nSMTC\n\nSNE\n\nSPY\n\nSSSS\n\nSTN\n\nTCX\n\nTQQQ\n\nTSLA\n\nUBS\n\nULTA\n\nV\n\nVMW\n\nWCN\n\nWDAY\n\nWGO\n\nWIRE\n\nZEN\n\nZNGA\n\nI'm sure some will carry over to Monday.\n\nI move fast in the morning, but if I have time, maybe I'll try to remember to post before the market opens.",
        "created_utc": 1591462839,
        "id": "ft5c6bv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591491639.0
    },
    {
        "author": "ctess",
        "body": "I'm no expert but the fact that 3 of their employee;s just sold off a bunch of stocks in May.\n\n* CFO/Treasurer sold 2506 shares\n* CSCO - 826 shares (not significant)\n* General Counsel - 1253 shares\n\nThis makes it a risky move. This is going to dip closer to a dollar and be between the $1-$2 range for awhile until their cash flows go up. (Pumpers will spike this but I'm predicting it will decline back to these ranges soon after)\n\nThey've also had to close a lot of their locations due to COVID (temporarily). Even with re-opens of business their cash flow is going to be severely limited for awhile which they depend on to keep them afloat. Likely if they can't get adequate cash flow, you're going to see more common stock offerings. They don't have a ton of money in the bank.\n\nYou can check their latest 10-k here:  [https://ir.tailoredbrands.com/sec-filings](https://ir.tailoredbrands.com/sec-filings)",
        "created_utc": 1591709015,
        "id": "fth26rp",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1591737815.0
    },
    {
        "author": "GranAutismo92",
        "body": "Started with 2k, up 22k, got a good deal for the watch so I bought it, LULU, ATVI, PAYPAL, MAXR all triple baggers, csco and DIS 67% , 74%",
        "created_utc": 1591065101,
        "id": "fsle5jj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591093901.0
    },
    {
        "author": "vvv561",
        "body": "Cisco hasn't split up WebEx's revenue since 2015. \n\nIt was $4B then. \n\nIt was one of Cisco's fastest growing segment from 2015 - 2020.\n\nAnd now Cisco says they are doing 24x the normal call volume during peak hours.\n\nWebEx is crushing ZM, period.",
        "created_utc": 1591248023,
        "id": "fstwcen",
        "score": 4,
        "subreddit": "investing",
        "created": 1591276823.0
    },
    {
        "author": "astroyanny",
        "body": "Anyone else read CSCO as “C-S-CO” like the game CSGO",
        "created_utc": 1591155997,
        "id": "fsplbtz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591184797.0
    },
    {
        "author": "Alex8525",
        "body": "I know it is a crazy Bull market but I have taken reasonably good profits on my calls on CSCO, ATVI, BA, NOK, FLR etc. The problem is I always go really small like ~$1000 per position and that results in relatively smaller profits. Should I take larger positions now (5-10% of portfolio)? What is a good play this week?",
        "created_utc": 1591458305,
        "id": "ft4yq2j",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591487105.0
    },
    {
        "author": "beta-one",
        "body": "Hey - great questions so let me shed some light.\n\nMost of these big companies rely on reseller models as they don't have the capacity to go after SMBs. Your point is spot on - CTS goes after small and medium size enterprises while IBM will go after the Fortune 500. It is purely a reseller model...but the company's main focus is converting these clients into more software. \n\nA lot of the targets they acquire are usually product specific - they end up selling a ton of Cisco or a ton of Dell without much overlap. But if they are selling Cisco, it's not as if their clients aren't buying Dell products also. That's the value prop that they pitch when they acquire targets - we are going to give you the tools to sell everything your clients want and need and your clients will love that they will not have multiple vendors. So effectively cross-selling is a huge selling point for the targets. \n\nWith respect to Red Hat, IBM is actually giving Converge market development funds to pursue these markets effectively throwing their full weight behind them. \n\nAnd yes, 700m and still on the Venture...not something you see every day. I am pretty confident they will uplist to the TSX within the year and will aim to go after NASDAQ later this year if not early next year.",
        "created_utc": 1591634284,
        "id": "ftdtmf9",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1591663084.0
    },
    {
        "author": "1monster90",
        "body": "You shouldn't invest money you can't afford to lose. Personally, money in the stock market is money I am considering nonexistent until 2045.   \nDon't be greedy but don't be cynical either. I think you could really benefit from making a list of interesting stocks. And from that list try to pick at least 10 stocks that you find promising and buy. Even if it's just 1 share (that way you will be focused on these companies, it's not so much to make a profit than making yourself focus and research these companies. I find it easier to focus on stocks I have at least one share with that stocks I don't own at all).  \n\n\nHere is my list of shares I'm watching carefully, feel free to research it.  \nMSFT, V, MA, NKE, NTDOY, LOGI, SPXL, TQQQ, DOCU,  TRIP, ALGN, F, GME, APPL, NFLX, SBUX, LUV, HS, AMZN, AAL, TMUS, PG,  INTC, QCOM, PYPL, T, ATVI, RSG, FDM, AXP, CSCO, TGT, PLSE, TROW, ORCL,  FDX, CUBE, BABA, CTAS, ALK, JNJ, LLY, CB, NEE, FANG, GAMR, TWLO, TNA,  LABU, FAS, CTRE, PEP, EBAY, DFS, GE, SNQP, MS, RF, AMG, HIG, BR, BEN,  ZNGA, COR, WWE, WYNN, VT, VTI, ELY, ADBE, SQ, TWTR, CVS, CRSP, QQ, NDLS,  WU, MTRX, PUTW, TECL, GM, NYMT, MU and NDAQ .",
        "created_utc": 1591285099,
        "id": "fsvbk0t",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1591313899.0
    },
    {
        "author": "MementoMori97",
        "body": "Evrything is always projections and estimates for the most part when you're trying to look at a stock's future. No one knows for certain and new news, good or bad, can show up any given day without warning.\n\nI'm not a very technically driven investor amd what I mean by that is I havent taken many econ/business courses and don't use very in depth analysis. Obviously I use earnings, P/E, some trends, etc. But for the most part I look at the actual business or sector and if I believe its a good area for growth or not. \n\nI stick about half of my portfolio into an index fund to keep some stablility and beyond that I split between stocks/sectors I like and have faith in (Nokia, Clean Energy ETF, Cisco, to name a few). In the end no one is 100% certain on any investment and theres always risks involved.",
        "created_utc": 1591455709,
        "id": "ft4qn4v",
        "score": 3,
        "subreddit": "stocks",
        "created": 1591484509.0
    },
    {
        "author": "mpbh",
        "body": "I work for a 300k person company that was almost entirely remote before COVID. We tried zoom and everyone loved it, but security and cost were the biggest issues. WebEx enterprise is cheaper and more secure, but the UX blows fat dick.\n\nIf Zoom can improve their security and offer better enterprise pricing, they'll be a clear winner. Until then, Cisco is king.",
        "created_utc": 1591130964,
        "id": "fsobc3p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591159764.0
    },
    {
        "author": "typicaluswhitemale",
        "body": "This graph is for people that use a flip phone.  GDP as it was calculated is now BS for the past about 10-15 years.  Buffet has traded sideways for about the last 5 years now.  It's now a global economy.  \n\nTLDR on GDP; it only counts products/services produced DOMESTICALLY.  Thats right, where have ALL of tech been produced for the past 5-10 years?  This doesn't include things such as AMD, Cisco, Alibaba, Aliexpress, literally any type of tech mfg., \n\nChina has tripled GDP in last 10 years.  To rely on a US GDP graph vs. value of the market is:\n\nRETARDED.\n\nIf companies that produce all of their products in china are taken out of the stock market valuation, I will stand corrected.  Also, are companies like BABA, JD, etc. taken out too?",
        "created_utc": 1591155204,
        "id": "fspk2ld",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591184004.0
    },
    {
        "author": "mister_andrew",
        "body": "@ mixedwell\n\ntell her Cisco sent you",
        "created_utc": 1591640093,
        "id": "fte5efy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591668893.0
    },
    {
        "author": "isospeedrix",
        "body": "If Cisco hits 52 or xom hits 60 tomorrow I’m making a donation",
        "created_utc": 1591672424,
        "id": "ftfu3y9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591701224.0
    },
    {
        "author": "Desmater",
        "body": "Chinese stocks for HK listing.\n\nI have BIDU, JD and BABA calls.\n\nDIS should hit $130 by July for reopening. So get July calls.\n\nI have some UBER FDs for Sept. If they announce GRUB merger. Hoping for a run to $50-60.\n\n\nThen some smaller plays like CSCO, TME, HEAR, DG, TAK",
        "created_utc": 1591492204,
        "id": "ft82fvv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591521004.0
    },
    {
        "author": "s3riousChef",
        "body": "the user interface for Zoom is also the best compared to other products.\n\nCisco Webex - garbage.\nMS Teams - not designed as Zoom competitor but a Slack competitor. Video chat was an after-thought.\nSkype - Dead",
        "created_utc": 1591166247,
        "id": "fspzo4b",
        "score": 2,
        "subreddit": "investing",
        "created": 1591195047.0
    },
    {
        "author": "Avid1",
        "body": "Good day to stock up on some CSCO calls...",
        "created_utc": 1591037785,
        "id": "fsjxvxd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591066585.0
    },
    {
        "author": "Vast_Cricket",
        "body": "Huawei moved its technology from US to its northern border. US gov't never charged its stealing of Cisco operating system on router being so lenient back then.",
        "created_utc": 1591235283,
        "id": "fstbvu6",
        "score": 2,
        "subreddit": "investing",
        "created": 1591264083.0
    },
    {
        "author": "Socrateeez",
        "body": "That’s just it though, they’ve built any amazing infrastructure that’s held up to the skyrocketing demand of covid without a real hitch. Plus Eric Yuan basically said fuck you to Cisco over the piece of shit Webex and started zoom. Maybe he’ll go with amazon, one never really knows these days, but I have a feeling he’s got a vision for zoom",
        "created_utc": 1591225157,
        "id": "fsst6fz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591253957.0
    },
    {
        "author": "aspergillum",
        "body": "from the prospectus\n\n&gt; The weight of each Index constituent is initially based on each constituent’s free-float market capitalization and then adjusted upward or downward based on a proprietary composite score calculated based on three growth-oriented fundamental factors of each company: trailing 12-month sales growth, trailing 12-month earnings per share (“EPS”) growth, and 12-month forward- looking EPS growth consensus estimates. \n\n\n&gt;The Index is rebalanced and reconstituted annually, effective on the first Wednesday of each May based on data as of the tenth business day prior to the reconstitution date. As of March 1, 2019, the three largest Index constituents and the weights were as follows: Cisco Systems, Inc (5.33%); Amazon.com, Inc. (4.91%); Apple Inc. (4.45%).\n\nThe biggest holding is Cisco.  It's using its own criteria to buy from the S&amp;P 500",
        "created_utc": 1591136325,
        "id": "fsomdgl",
        "score": 2,
        "subreddit": "investing",
        "created": 1591165125.0
    },
    {
        "author": "MementoMori97",
        "body": "Picked up a handful of Ericsson shares today too so probably going to buy 40 NOK shares and 30-50 ERIC shares instead. Throwing the rest of the 1000 beyond that into CSCO and ITOT.",
        "created_utc": 1591153344,
        "id": "fspgz45",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591182144.0
    },
    {
        "author": "omglawlz",
        "body": "CSCO bought that software company the other day. They trying to become a big growth stock? They tried to buy DDOG before they went public. Obviously they know they need to incorporate into the cloud and SaaS",
        "created_utc": 1591155641,
        "id": "fspkrkk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591184441.0
    },
    {
        "author": "Bagel_Technician",
        "body": "Yeah I'm pretty sure the security concerns were a smear campaign by Cisco and Microsoft especially after I saw CNN run a story and then start advertising that their calls were by Webex\n\nBut I've also already seen the impact working with clients that are being told in their organizations to not use Zoom so it worked",
        "created_utc": 1591385004,
        "id": "ft05ii4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591413804.0
    },
    {
        "author": "JoseAureliano",
        "body": "Especially since every tech company has their own version of video chat at this point. Like, Google has Hangouts, Microsoft has Teams (and Skype?), Facebook has Messenger and WhatsApp and idk what else, even fucking Cisco has WebEx",
        "created_utc": 1591150485,
        "id": "fspc1sf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591179285.0
    },
    {
        "author": "dammahomelihpodep",
        "body": "I have a lot of invested in large cap stocks like MSFT, COST, CSCO, XOM, WMT, FB, GE, EA and a few others. And I also trade around 30k in pennystocks, which is up by 73%.",
        "created_utc": 1591210668,
        "id": "fsrypk3",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1591239468.0
    },
    {
        "author": "MementoMori97",
        "body": "Increased my positions in NOK, ERIC, ITOT and CSCO today before 9am",
        "created_utc": 1591215270,
        "id": "fss8pem",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591244070.0
    },
    {
        "author": "xRiotZx",
        "body": "No it's legit autists who read the DD pumping. This happened with 2 stocks I've been in, CSOD and CSCO.",
        "created_utc": 1591021782,
        "id": "fsj26v4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591050582.0
    },
    {
        "author": "SwoleStoner",
        "body": "Anyone buying CSCO dip or are there better plays?",
        "created_utc": 1591026736,
        "id": "fsjb6ny",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055536.0
    },
    {
        "author": "thisisbsol",
        "body": "Nasdaq up, all my NVDA, CSCO, ADBE calls down. Just what I like",
        "created_utc": 1591027195,
        "id": "fsjc3r2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055995.0
    },
    {
        "author": "blazespinnaker",
        "body": "Lot of buyback support at 52 on this stock.   I'd look at it as another CSCO and trade it the same way.\n\nThat said, Zoom could surprise to the upside on earnings and potentially push Oracle higher as there was a big deal about Oracle cloud hosting Zoom.\n\nOracle Cloud is really Oracles only chance to escape the doldrums, but it's not a very good cloud compared to its competitors.",
        "created_utc": 1591056768,
        "id": "fskzbzc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591085568.0
    },
    {
        "author": "ApartheidClyde",
        "body": "short CSCO, if next leg down is due to china this shit is going down",
        "created_utc": 1591084821,
        "id": "fsm5vba",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591113621.0
    },
    {
        "author": "itsatrashaccount",
        "body": "I know business (1000+ users) switching from Cisco, Poly, etc.  to Zoom.    I think Zoom is overpriced but the 2020 growth numbers will cement them as a top player in video conf.  Since it will be more positive news stonk only going up playa.  Take it with a grain of salt, just reporting what i see from the front.",
        "created_utc": 1591018637,
        "id": "fsiwutq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591047437.0
    },
    {
        "author": "Bigchrome",
        "body": "I thought the same at first, and was like \"Man, I thought Cisco would at least hire people who can write..\"",
        "created_utc": 1591108585,
        "id": "fsn0coc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591137385.0
    },
    {
        "author": "Bigchrome",
        "body": "I think you're missing that the email wasn't at Cisco",
        "created_utc": 1591106712,
        "id": "fsmwtxq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591135512.0
    },
    {
        "author": "jonnydoo84",
        "body": "MSFT and CSCO i'm keeping an eye",
        "created_utc": 1591312855,
        "id": "fswy8bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591341655.0
    },
    {
        "author": "CuseTown",
        "body": "Racks on racks with SPY QQQ HD CSCO. Should’ve bought yesterday’s dip",
        "created_utc": 1591364958,
        "id": "fsz0gh6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591393758.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "Would be nice if AMD could take some cues from Cisco.",
        "created_utc": 1591368820,
        "id": "fsz7svj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591397620.0
    },
    {
        "author": "Alex8525",
        "body": "My CSCO calls are 300% up",
        "created_utc": 1591369365,
        "id": "fsz8vj8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591398165.0
    },
    {
        "author": "_DillyPickle_",
        "body": "BA 4 shares\nCCL 2 shares\nCSCO 2 shares \nDAL 2 shares\nDIS 2 shares\nNYMT 2 shares \nPLUG 8 shares\n\nStill new to investing to criticism is welcome, also looking for recommendations for buying.",
        "created_utc": 1591237488,
        "id": "fstfryv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591266288.0
    },
    {
        "author": "Drew707",
        "body": "You know who benefits from Slack?  Zoom.  Would not be surprised at an acquisition.  GOOG, MSFT, and CSCO all have complete ecosystems, but Zoom needs Slack, and Slack shouldn't care about that.",
        "created_utc": 1591304477,
        "id": "fswhglk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591333277.0
    },
    {
        "author": "schplat",
        "body": "ORCL and CSCO are cut from the same cloth.",
        "created_utc": 1591375744,
        "id": "fszm3r0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591404544.0
    },
    {
        "author": "ImaginaryLead",
        "body": "CSCO, MSFT, V, DXCM",
        "created_utc": 1591541267,
        "id": "ft9t12u",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591570067.0
    },
    {
        "author": "ChudBuntsman",
        "body": "Its the same reason why I personally am not buying any Canadian banks in spite of the fact that everyone things theyre the best thing since Cisco circa 1999.\n\nI work in construction, In Toronto. We are in a housing bubble. I dont want to have my day job and my investments to be 100% correlated.",
        "created_utc": 1591572696,
        "id": "ftbedc1",
        "score": 1,
        "subreddit": "investing",
        "created": 1591601496.0
    },
    {
        "author": "TheMojo1",
        "body": "Sold my oil today at about double since March, reinvested into ASR.TO and CSCO",
        "created_utc": 1591648886,
        "id": "ftencdi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591677686.0
    },
    {
        "author": "notbrokemexican",
        "body": "They are building a full enterprise platform and would rather burn cash early to acquire long term relationships. If you pay attention to the CEO you will note that he is incredibly business savvy and strategic.\n\nNET is cheapest by several factors across the board. It's for market capture against large providers like CISCO and Palo Alto Networks.",
        "created_utc": 1591551357,
        "id": "ftabdgp",
        "score": 1,
        "subreddit": "investing",
        "created": 1591580157.0
    },
    {
        "author": "NoTP4us",
        "body": "Microsoft and Cisco will definitely survive.",
        "created_utc": 1591713013,
        "id": "fth9cca",
        "score": 1,
        "subreddit": "investing",
        "created": 1591741813.0
    },
    {
        "author": "masmith1495",
        "body": "Long Term Dividend Portfolio\n\nLooking for feedback on a recently put together portfolio and possible recommendations and stocks/ETFs to add. Just a start but looking to add shares periodically over time. \n\nTicker/Shares Held/Purchase Price \n\nBOTZ  - 5 - $24.32 (Growth over dividend)\n\nESPO - 5 - $47.76  (Growth over dividend) \n\nSCHD - 5 - $53.90 \n\nCSCO - 5 - $46.19\n\nDAL - 10 - $26.47\n\nDUK - 2 - $86.63\n\nO - 5 - $56.23 \n\nPEP - 1 - $133.84\n\nVZ - 5 - $56.57",
        "created_utc": 1591201580,
        "id": "fsrf06l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591230380.0
    },
    {
        "author": "reddituseranyonymous",
        "body": "Thanks. Im guessing chips and components need to be upgraded for 5G wireless? I bought some CSCO and IBM today",
        "created_utc": 1591206138,
        "id": "fsrosg9",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1591234938.0
    },
    {
        "author": "OT411",
        "body": "I agree, Ford uses Cisco Webex\n\nSame with the university I attend",
        "created_utc": 1591210943,
        "id": "fsrzbk5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591239743.0
    },
    {
        "author": "bobrobor",
        "body": "And CSCO",
        "created_utc": 1591215444,
        "id": "fss92se",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591244244.0
    },
    {
        "author": "HUMPDAY77",
        "body": "Cisco ?",
        "created_utc": 1591055590,
        "id": "fskx6qy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591084390.0
    },
    {
        "author": "MementoMori97",
        "body": "Personally, I would go about 50-75% in a total market or S&amp;P 500 index fund like VTI, VOO, SPY, ITOT, etc. And then use the other 25-50% in high quality companies you like and research. \n\nFor example: 60%-VTI 20%-MSFT 10%-KO 10%XOM\n\n(THIS IS JUST AN EXAMPLE NOT SAYING PICK THESE WITHOUT LOOKING INTO IT)\n\nMy brokerage account currently is ~40% ITOT and the rest is split pretty evenly between Nokia, a clean energy ETF and Cisco, with Cisco having the highest weighting of the three.\n\nJust gotta do your own research and be confident in any individual stocks you pick. Index funds are much safer but still have the potential for corrections and to lose money in the near term.",
        "created_utc": 1591026631,
        "id": "fsjaz7g",
        "score": 1,
        "subreddit": "investing",
        "created": 1591055431.0
    },
    {
        "author": "ChoochMMM",
        "body": "Did anyone else get CSCO calls today?",
        "created_utc": 1591053288,
        "id": "fsksxqs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591082088.0
    },
    {
        "author": "TheAvantGardeners",
        "body": "Plot twist, they use CSCO /s",
        "created_utc": 1591037953,
        "id": "fsjy8mm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591066753.0
    },
    {
        "author": "xRiotZx",
        "body": "CSCO ER",
        "created_utc": 1591069178,
        "id": "fslkyqi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591097978.0
    },
    {
        "author": "That70sUsername",
        "body": "No, it's not driven by a magical expectation. The high price is due to their market penetration, which is unlike any competitor.\n\nI'm not saying it's justified, I honestly have no idea what the true value of this company is, nobody does, but the value in Zoom is so much more than a 'magical expectation'.\n\nTech companies have stickier customers than any other industry in history due to the incredible amounts of data they can collect.\n\nAt a global scale, both on a consumer, business and enterprise level, Zoom has daily analytics on:\n\n- How many video conferences take place\n- Who participates in them\n- Whether they use chat features or just the video/audio\n- How many people are in a meeting\n- How close participants are geographically\n\nHonestly, I could make this list as long as I liked, the data points are endless.\n\nNo other video conference company has such deep penetration across every area of the vidconf market. \n\nThat mix of personal, business and enterprise penetration isn't something anyone else in the market has, and it's so incredibly valuable at a data analytics level. \n\nBeing able to compare and contrast customer behaviours across different contexts unlocks insights that power incredible company growth (see: Facebook)\n\nThis incredible amount of data informs their future product development opportunities, meaning that it's a strong bet that Zoom is going to make better future plays in the technology space than their competitors (e.g. Google, Webex, etc).\n\nNote again that these competitors cover an area of the market each (personal, enterprise), Zoom covers all of it and more.\n\nWhen you combine that with the fact that they have already destroyed every competitor in the space on user experience and customer satisfaction, this puts them at a huge advantage over every other player in the video conference space. \n\nThey came into this space as a startup competing against Microsoft, Cisco and Google, and they're winning by a country mile.\n\nSo when video chats move from 'schedule a call' to an all inclusive platform that handles all communications across audio/video, personal/business, etc, Zoom is going to be the best placed to dominate that huge market.\n\nThis is an equivalent shift in the Telcom industry as the one from dial phones to mobile phones. \n\nIf you're imagining what a shift like that might look like, imagine having cameras from your TV, fridge and various 'IoT enabled' devices around your house that follow you as you talk to people.\n\nImagine having an affordable interactive whiteboard in your house that updates as your video partners write on their own interactive whiteboards.\n\nImagine it get used to plan family trips out as much as it's used to plan corporate strategies.\n\nImagine being able to manipulate AR models on video and share it with the world.\n\nThat all requires a central platform to harness all the data involved and turn it into a user experience. Zoom is better placed to do that than any other company in the world right now.\n\nThat is what it's price is driven by.\n\nAnd all you see is people whining that they had a security breach, as though that can't be fixed (which it has).\n\nEvery company has data breaches, not every company is this well placed to dominate a market that is going to grow like wildfire over the next 20 years.\n\n---------\n\nNow, with all that being said, I still only have 10% of my portfolio in Zoom, even with all this going for it, every company is a 50/50 bet at best. But if I'm gonna pick 10 companies in the world to invest in, Zoom is definitely one of them.",
        "created_utc": 1591259528,
        "id": "fsua1hd",
        "score": 1,
        "subreddit": "investing",
        "created": 1591288328.0
    },
    {
        "author": "grathe",
        "body": "&gt;it's not CFA analysts who need to come around. It's the current shareholders who already bought at \"inflated\" valuations.\n\nNot at all. If (when?) the big boys decide to dump, current buying demand will not be near enough to maintain the prices.\n\nRight now they are slowly unloading to not scare off the buyers.\n\nI think of these stocks kind of like CSCO in 2000",
        "created_utc": 1591334870,
        "id": "fsxz45v",
        "score": 1,
        "subreddit": "investing",
        "created": 1591363670.0
    },
    {
        "author": "WaitingForGateaux",
        "body": "Why are webcasts for cloud/networking always the glitchiest? The WORK call quality sucks. CLDR yesterday sucked. CSCO sucked, HPE sucked. \n\nAre \"undocumented shoppers\" looting optical fiber in California?",
        "created_utc": 1591305754,
        "id": "fswk4e3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591334554.0
    },
    {
        "author": "jonnydoo84",
        "body": "I have a good amount of Cisco shares, but webex kind of sucks.",
        "created_utc": 1591232866,
        "id": "fst7kak",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591261666.0
    },
    {
        "author": "MementoMori97",
        "body": "I was looking at both of those too actually. I might go with either just RTX or a mix of PEP and KO.\n\nI'm selling my ERIC stock (already own NOK and CSCO stock so i feel ERIC isn't necessary right now) and it's only ~600$ of my portfolio. So it's not a huge chunk of change or anything",
        "created_utc": 1591451171,
        "id": "ft4dtnk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591479971.0
    },
    {
        "author": "burninTsherman",
        "body": "Cisco, Google and Microsoft are better alternatives.",
        "created_utc": 1591140390,
        "id": "fsou1ow",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591169190.0
    },
    {
        "author": "GreatMidnight",
        "body": "This literally doesn't matter. Even if webex goes to zero Cisco will just sell more routers for the increased voice and video traffic required on the networks.",
        "created_utc": 1591143871,
        "id": "fsp0e6y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591172671.0
    },
    {
        "author": "oldskol_d",
        "body": "Don't short CSCO based on this post.  Pre-pandemic many entities were moving away from WebEx due to the introduction  of numerous lower cost upstarts.  The fact that ops company didn't realize that WebEx was a premium product, reserved for external meetings, until the third month of the pandemic indicates that we should short his firm.",
        "created_utc": 1591112770,
        "id": "fsn8r8g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591141570.0
    },
    {
        "author": "rlv28",
        "body": "MSFT 16.63%\n\nCSCO 3.66%\n\nWFC 2.25%\n\nV 11.52%\n\nAAPL 16.49%\n\nWM 4.73%\n\nAMZN 38.68%\n\nSCHF 5.97%\n\nAll positions in Roth IRA",
        "created_utc": 1591218595,
        "id": "fssfpic",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591247395.0
    },
    {
        "author": "icantfindanametwice",
        "body": "Fake dd- source: am former Cisco contractor live with ex webex employee and know many who went from csco to Zoom.\n\nWebex or WebEx is how it’s written internally always, never hyphenated. Check the Cisco billboard on 880 in the Bay Area close to Cisco’s campus.\n\nThen again, I’m a random internet punter who didn’t take the time to do crappy photoshop. So never mind, go buy.",
        "created_utc": 1591105636,
        "id": "fsmux48",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591134436.0
    },
    {
        "author": "Rocfranklogjam001",
        "body": "Some context. This is only one company but it is the third largest company in its market sector. Not sure what percentage web-ex is for csco but I would imagine it’s a reasonable portion. Every company I have worked for used Web-ex  on MS systems. I see this change moving through a lot of industries especially with the high number of MS system users.",
        "created_utc": 1591103588,
        "id": "fsmrhlh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591132388.0
    },
    {
        "author": "steatorrhoea",
        "body": "323 million in revenue \n\nAnd net revenue 27 million \n\nSchools opening up. FB, MSFT, Whatsapp, Cisco, and the tom’s mom have the same tech prepacked for much cheaper (or free) with more security. \n\nLet’s just assume the stars are going to keep aligning for zoom and growth is sustained.",
        "created_utc": 1591160918,
        "id": "fspsq26",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591189718.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "Not really any Yolos. I bought a bunch of cheap calls in casino companies, as well as Cisco, CSOD, and a few other tech companies in early May. Kept seeing gains and rolling them into the next play. Then got in on DKNG early, got in on Disney’s first run up, bought their dip, and currently running up again. Just timed a lot of things really well, but also had some losses in May too.",
        "created_utc": 1591641559,
        "id": "fte8dy2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591670359.0
    },
    {
        "author": "schplat",
        "body": "Yah, because that shit don't move.  It's CSCO all over again.",
        "created_utc": 1591622847,
        "id": "ftd8b8j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591651647.0
    },
    {
        "author": "notbrokemexican",
        "body": "NET is cheapest by several factors across the board. It's for market capture against large providers like CISCO and Palo Alto Networks.",
        "created_utc": 1591551520,
        "id": "ftabopn",
        "score": 1,
        "subreddit": "investing",
        "created": 1591580320.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "I ended up bagholding a bunch (twenty five contracts) of Cisco 50c 6/19 through earnings last month. It fucking tanked, but as soon as it started moving back up, I rolled it to 7/17 and it’s been printing.",
        "created_utc": 1591652312,
        "id": "fteu9cf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591681112.0
    },
    {
        "author": "facehuggerpoop",
        "body": "CSCO hardly moves for anything.\n\nUnless those calls are far out to avoid theta burn, don’t.",
        "created_utc": 1591022589,
        "id": "fsj3mlq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591051389.0
    },
    {
        "author": "xRiotZx",
        "body": "All memory data used to support servers for companies like ZM, CSCO, MSFT, etc is manufactured by MU.",
        "created_utc": 1591027238,
        "id": "fsjc6tt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591056038.0
    },
    {
        "author": "HiMyNamesEvan",
        "body": "Cisco",
        "created_utc": 1591073685,
        "id": "fslrv33",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591102485.0
    },
    {
        "author": "inb4ElonMusk",
        "body": "I've never used either. WebEx a few times but that's it. I just don't see how ZM could ever compete with Microsoft or Cisco on the pricing long term.",
        "created_utc": 1591116081,
        "id": "fsnfm48",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591144881.0
    },
    {
        "author": "SirPickleSwanson",
        "body": "Csco pump",
        "created_utc": 1591127471,
        "id": "fso3tjs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156271.0
    },
    {
        "author": "mpbh",
        "body": "Like I said, for our 300k population WebEx was cheaper. Zoom doesn't have the same volume discount that Cisco offered.",
        "created_utc": 1591131532,
        "id": "fsocj7x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591160332.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "that is hilarous\n\nI am holding CSCO so good for me, LOL",
        "created_utc": 1591130861,
        "id": "fsob4gy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591159661.0
    },
    {
        "author": "WSBnoobxor",
        "body": "Probably move as slow as Well and Cisco",
        "created_utc": 1591133161,
        "id": "fsofx6q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591161961.0
    },
    {
        "author": "azwel",
        "body": "i see they own  \n\n* Microsoft Corporation 18.51%\n* Apple Inc.\n* Visa Inc. Class A 4.15%\n* Intel Corporation 3.81%\n* Mastercard Incorporated Class A 3.51%\n* Cisco Systems, Inc.\n* Adobe Inc.\n* NVIDIA Corporation 2.48\n\nI Have a lot of those.  A couple like cisco  adobe, nvidia, i dont have.  I could either buy those few,  or just this etf..",
        "created_utc": 1591126310,
        "id": "fso1bpq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591155110.0
    },
    {
        "author": "sgt_warturkey",
        "body": "Sitting on the sidelines is the worst thing you can do. If you're really that risk averse, at least buy some Vanguard fund or get Wells Fargo, Coke and Cisco while they're still kind of on sale.",
        "created_utc": 1591167668,
        "id": "fsq1dse",
        "score": 1,
        "subreddit": "investing",
        "created": 1591196468.0
    },
    {
        "author": "wimmelbuilder",
        "body": "My take is Zoom will slowly get eroded over a few years and then get bought out by Cisco or HPE where all enterprise software go to die",
        "created_utc": 1591179349,
        "id": "fsqe67p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591208149.0
    },
    {
        "author": "GreatMidnight",
        "body": "John Chambers once said after the Tandberg acquisition that for every dollar of video revenue, Cisco would see 9 dollars of route-switch and now wireless. Anything that drives more traffic over the network increases the sales of Cisco for the enterprise as well as the backbone provider.",
        "created_utc": 1591147179,
        "id": "fsp697b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591175979.0
    },
    {
        "author": "RIC_FLAIR-WOOO",
        "body": "I prefer QQQ but if you want strictly \"tech\", I guess VGT is pretty good too.  I wish QQQ didn't hold so much stinker CSCO, though.",
        "created_utc": 1591291306,
        "id": "fsvouyg",
        "score": 1,
        "subreddit": "investing",
        "created": 1591320106.0
    },
    {
        "author": "ChoochMMM",
        "body": "Anyone have CSCO calls?",
        "created_utc": 1591280500,
        "id": "fsv276u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591309300.0
    },
    {
        "author": "mdmarra",
        "body": "Zoom’s biggest competitors are Microsoft and Cisco. Zoom doesn’t have nearly the rest of the ecosystem the other two do. \n\nCompanies stood up Zoom since its quick and easy but many are switching to Microsoft Teams or WebEx Teams as their longer-term solution as the reality of remote work settles in.",
        "created_utc": 1591484431,
        "id": "ft7g1fe",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591513231.0
    },
    {
        "author": "thebiggdirtyy",
        "body": "Never bought into draftkings due to the volatile nature of it.\n\nWent with Cisco, Microsoft, shaw and Onex\n\nUp 5% total portfolio since April 11th and I'm happy",
        "created_utc": 1591330842,
        "id": "fsxt9e1",
        "score": 1,
        "subreddit": "investing",
        "created": 1591359642.0
    },
    {
        "author": "jonnydoo84",
        "body": "which ones you holding ?  In order of Percentage i'm BA, AMZN, AAPL, MSFT, CSCO, V, RTX, SBUX, DAL, CCL, NCLH, CARR. and roughly 5% in a broad market etf.  at any point do you plan on moving to ETFs and such or just going to keep rolling with tech?",
        "created_utc": 1591475844,
        "id": "ft6lncy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591504644.0
    },
    {
        "author": "isospeedrix",
        "body": "still holding 50 CSCO 50c 6/19",
        "created_utc": 1591521734,
        "id": "ft957c6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591550534.0
    },
    {
        "author": "MementoMori97",
        "body": "Im holding a couple hundred bucks of Ericsson stock right now that I'm probably going to sell tomorrow just due to holding Nokia and Cisco stock as well. I feel I'm a little too overweight in tech/5g.",
        "created_utc": 1591538993,
        "id": "ft9pb7v",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591567793.0
    },
    {
        "author": "nachodorito",
        "body": "anyone get in on CSCO calls today? I picked up 1 contract of $49c 7/17 for $0.77 and it's already up 39%",
        "created_utc": 1591652149,
        "id": "ftetxs9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591680949.0
    },
    {
        "author": "tinybabyjeezus",
        "body": "Just like my CSCO calls",
        "created_utc": 1591653304,
        "id": "ftew8jz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591682104.0
    },
    {
        "author": "A321ELAC",
        "body": "DAL, JETBLUE, CSCO, AMD, DIS, KO\n\nRunning the wheel on those 2-3 contracts on each",
        "created_utc": 1591684570,
        "id": "ftgaed8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591713370.0
    },
    {
        "author": "MementoMori97",
        "body": "I sold mine today so I could buy some RTX. Only sold it because I already have Nokia and Cisco so it seemed redundant. Should be a good bet for the next couple years though",
        "created_utc": 1591631471,
        "id": "ftdnzxx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591660271.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "No ones talking about Cisco? I’m +200% today and well into the green after bagholding calls through earnings last month.",
        "created_utc": 1591381190,
        "id": "fszxhmp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591409990.0
    },
    {
        "author": "kevlarcoozie",
        "body": "Microsoft teams, Cisco WebEx, Google just rolled out their version, this stuff ain't exactly ground breaking.",
        "created_utc": 1591152115,
        "id": "fspeuq1",
        "score": 42,
        "subreddit": "stocks",
        "created": 1591180915.0
    },
    {
        "author": "joeschmo28",
        "body": "This is just not true. I worked for one of the largest technology companies in the world and they switched from Cisco WebEx to Zoom. It was such an improvement it’s not even funny.",
        "created_utc": 1591148710,
        "id": "fsp8yod",
        "score": 19,
        "subreddit": "stocks",
        "created": 1591177510.0
    },
    {
        "author": "Cwc123",
        "body": "Imagine being a zm bear LMAO. They have competition by fb,cisco, msft, googl? What a joke! Do you really think these companies have the capital to program a video chat app, the most innovative technology in the world? And what, they will offer these services for free to their users as part of an integrated bundle of products that are used by every organization in the world? Who cares? Companies dont care about adding new costs. And what, they have security issues. ok? what company cares about securities or hackes? Thats right,none. Oh and the best one. ItS oVErValUed. no? they generated 27m income this quarter. this means that if you buy zm now, you turn a profit in 600 years. Are you really that fcking impatient? You cant wait? And so what if they had their best quarter ever and will never see anything close to that ever again? Video conferencing is the futur. Want to go play golf? lmao good one, crack a cold beer and talk on zoom. Your boss wants you to meet an important client for good first impressions? lmao fuck that, just call him on zm while wearing boxers and a suit top. no companies will have offices after this year. none. they will all use zm. everyone will work remote.",
        "created_utc": 1591232366,
        "id": "fst6o52",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1591261166.0
    },
    {
        "author": "GranAutismo92",
        "body": "Started with 2k, up 22k, got a good deal for the watch so I bought it, LULU, ATVI, PAYPAL, MAXR all triple baggers, csco and DIS 67% , 74%",
        "created_utc": 1591065101,
        "id": "fsle5jj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591093901.0
    },
    {
        "author": "vvv561",
        "body": "Cisco hasn't split up WebEx's revenue since 2015. \n\nIt was $4B then. \n\nIt was one of Cisco's fastest growing segment from 2015 - 2020.\n\nAnd now Cisco says they are doing 24x the normal call volume during peak hours.\n\nWebEx is crushing ZM, period.",
        "created_utc": 1591248023,
        "id": "fstwcen",
        "score": 4,
        "subreddit": "investing",
        "created": 1591276823.0
    },
    {
        "author": "astroyanny",
        "body": "Anyone else read CSCO as “C-S-CO” like the game CSGO",
        "created_utc": 1591155997,
        "id": "fsplbtz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591184797.0
    },
    {
        "author": "1monster90",
        "body": "You shouldn't invest money you can't afford to lose. Personally, money in the stock market is money I am considering nonexistent until 2045.   \nDon't be greedy but don't be cynical either. I think you could really benefit from making a list of interesting stocks. And from that list try to pick at least 10 stocks that you find promising and buy. Even if it's just 1 share (that way you will be focused on these companies, it's not so much to make a profit than making yourself focus and research these companies. I find it easier to focus on stocks I have at least one share with that stocks I don't own at all).  \n\n\nHere is my list of shares I'm watching carefully, feel free to research it.  \nMSFT, V, MA, NKE, NTDOY, LOGI, SPXL, TQQQ, DOCU,  TRIP, ALGN, F, GME, APPL, NFLX, SBUX, LUV, HS, AMZN, AAL, TMUS, PG,  INTC, QCOM, PYPL, T, ATVI, RSG, FDM, AXP, CSCO, TGT, PLSE, TROW, ORCL,  FDX, CUBE, BABA, CTAS, ALK, JNJ, LLY, CB, NEE, FANG, GAMR, TWLO, TNA,  LABU, FAS, CTRE, PEP, EBAY, DFS, GE, SNQP, MS, RF, AMG, HIG, BR, BEN,  ZNGA, COR, WWE, WYNN, VT, VTI, ELY, ADBE, SQ, TWTR, CVS, CRSP, QQ, NDLS,  WU, MTRX, PUTW, TECL, GM, NYMT, MU and NDAQ .",
        "created_utc": 1591285099,
        "id": "fsvbk0t",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1591313899.0
    },
    {
        "author": "mpbh",
        "body": "I work for a 300k person company that was almost entirely remote before COVID. We tried zoom and everyone loved it, but security and cost were the biggest issues. WebEx enterprise is cheaper and more secure, but the UX blows fat dick.\n\nIf Zoom can improve their security and offer better enterprise pricing, they'll be a clear winner. Until then, Cisco is king.",
        "created_utc": 1591130964,
        "id": "fsobc3p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591159764.0
    },
    {
        "author": "typicaluswhitemale",
        "body": "This graph is for people that use a flip phone.  GDP as it was calculated is now BS for the past about 10-15 years.  Buffet has traded sideways for about the last 5 years now.  It's now a global economy.  \n\nTLDR on GDP; it only counts products/services produced DOMESTICALLY.  Thats right, where have ALL of tech been produced for the past 5-10 years?  This doesn't include things such as AMD, Cisco, Alibaba, Aliexpress, literally any type of tech mfg., \n\nChina has tripled GDP in last 10 years.  To rely on a US GDP graph vs. value of the market is:\n\nRETARDED.\n\nIf companies that produce all of their products in china are taken out of the stock market valuation, I will stand corrected.  Also, are companies like BABA, JD, etc. taken out too?",
        "created_utc": 1591155204,
        "id": "fspk2ld",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591184004.0
    },
    {
        "author": "s3riousChef",
        "body": "the user interface for Zoom is also the best compared to other products.\n\nCisco Webex - garbage.\nMS Teams - not designed as Zoom competitor but a Slack competitor. Video chat was an after-thought.\nSkype - Dead",
        "created_utc": 1591166247,
        "id": "fspzo4b",
        "score": 2,
        "subreddit": "investing",
        "created": 1591195047.0
    },
    {
        "author": "Avid1",
        "body": "Good day to stock up on some CSCO calls...",
        "created_utc": 1591037785,
        "id": "fsjxvxd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591066585.0
    },
    {
        "author": "Vast_Cricket",
        "body": "Huawei moved its technology from US to its northern border. US gov't never charged its stealing of Cisco operating system on router being so lenient back then.",
        "created_utc": 1591235283,
        "id": "fstbvu6",
        "score": 2,
        "subreddit": "investing",
        "created": 1591264083.0
    },
    {
        "author": "Socrateeez",
        "body": "That’s just it though, they’ve built any amazing infrastructure that’s held up to the skyrocketing demand of covid without a real hitch. Plus Eric Yuan basically said fuck you to Cisco over the piece of shit Webex and started zoom. Maybe he’ll go with amazon, one never really knows these days, but I have a feeling he’s got a vision for zoom",
        "created_utc": 1591225157,
        "id": "fsst6fz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591253957.0
    },
    {
        "author": "aspergillum",
        "body": "from the prospectus\n\n&gt; The weight of each Index constituent is initially based on each constituent’s free-float market capitalization and then adjusted upward or downward based on a proprietary composite score calculated based on three growth-oriented fundamental factors of each company: trailing 12-month sales growth, trailing 12-month earnings per share (“EPS”) growth, and 12-month forward- looking EPS growth consensus estimates. \n\n\n&gt;The Index is rebalanced and reconstituted annually, effective on the first Wednesday of each May based on data as of the tenth business day prior to the reconstitution date. As of March 1, 2019, the three largest Index constituents and the weights were as follows: Cisco Systems, Inc (5.33%); Amazon.com, Inc. (4.91%); Apple Inc. (4.45%).\n\nThe biggest holding is Cisco.  It's using its own criteria to buy from the S&amp;P 500",
        "created_utc": 1591136325,
        "id": "fsomdgl",
        "score": 2,
        "subreddit": "investing",
        "created": 1591165125.0
    },
    {
        "author": "MementoMori97",
        "body": "Picked up a handful of Ericsson shares today too so probably going to buy 40 NOK shares and 30-50 ERIC shares instead. Throwing the rest of the 1000 beyond that into CSCO and ITOT.",
        "created_utc": 1591153344,
        "id": "fspgz45",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591182144.0
    },
    {
        "author": "omglawlz",
        "body": "CSCO bought that software company the other day. They trying to become a big growth stock? They tried to buy DDOG before they went public. Obviously they know they need to incorporate into the cloud and SaaS",
        "created_utc": 1591155641,
        "id": "fspkrkk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591184441.0
    },
    {
        "author": "JoseAureliano",
        "body": "Especially since every tech company has their own version of video chat at this point. Like, Google has Hangouts, Microsoft has Teams (and Skype?), Facebook has Messenger and WhatsApp and idk what else, even fucking Cisco has WebEx",
        "created_utc": 1591150485,
        "id": "fspc1sf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591179285.0
    },
    {
        "author": "dammahomelihpodep",
        "body": "I have a lot of invested in large cap stocks like MSFT, COST, CSCO, XOM, WMT, FB, GE, EA and a few others. And I also trade around 30k in pennystocks, which is up by 73%.",
        "created_utc": 1591210668,
        "id": "fsrypk3",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1591239468.0
    },
    {
        "author": "MementoMori97",
        "body": "Increased my positions in NOK, ERIC, ITOT and CSCO today before 9am",
        "created_utc": 1591215270,
        "id": "fss8pem",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591244070.0
    },
    {
        "author": "xRiotZx",
        "body": "No it's legit autists who read the DD pumping. This happened with 2 stocks I've been in, CSOD and CSCO.",
        "created_utc": 1591021782,
        "id": "fsj26v4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591050582.0
    },
    {
        "author": "SwoleStoner",
        "body": "Anyone buying CSCO dip or are there better plays?",
        "created_utc": 1591026736,
        "id": "fsjb6ny",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055536.0
    },
    {
        "author": "thisisbsol",
        "body": "Nasdaq up, all my NVDA, CSCO, ADBE calls down. Just what I like",
        "created_utc": 1591027195,
        "id": "fsjc3r2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591055995.0
    },
    {
        "author": "blazespinnaker",
        "body": "Lot of buyback support at 52 on this stock.   I'd look at it as another CSCO and trade it the same way.\n\nThat said, Zoom could surprise to the upside on earnings and potentially push Oracle higher as there was a big deal about Oracle cloud hosting Zoom.\n\nOracle Cloud is really Oracles only chance to escape the doldrums, but it's not a very good cloud compared to its competitors.",
        "created_utc": 1591056768,
        "id": "fskzbzc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591085568.0
    },
    {
        "author": "ApartheidClyde",
        "body": "short CSCO, if next leg down is due to china this shit is going down",
        "created_utc": 1591084821,
        "id": "fsm5vba",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591113621.0
    },
    {
        "author": "itsatrashaccount",
        "body": "I know business (1000+ users) switching from Cisco, Poly, etc.  to Zoom.    I think Zoom is overpriced but the 2020 growth numbers will cement them as a top player in video conf.  Since it will be more positive news stonk only going up playa.  Take it with a grain of salt, just reporting what i see from the front.",
        "created_utc": 1591018637,
        "id": "fsiwutq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591047437.0
    },
    {
        "author": "Bigchrome",
        "body": "I thought the same at first, and was like \"Man, I thought Cisco would at least hire people who can write..\"",
        "created_utc": 1591108585,
        "id": "fsn0coc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591137385.0
    },
    {
        "author": "Bigchrome",
        "body": "I think you're missing that the email wasn't at Cisco",
        "created_utc": 1591106712,
        "id": "fsmwtxq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591135512.0
    },
    {
        "author": "jonnydoo84",
        "body": "MSFT and CSCO i'm keeping an eye",
        "created_utc": 1591312855,
        "id": "fswy8bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591341655.0
    },
    {
        "author": "CuseTown",
        "body": "Racks on racks with SPY QQQ HD CSCO. Should’ve bought yesterday’s dip",
        "created_utc": 1591364958,
        "id": "fsz0gh6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591393758.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "Would be nice if AMD could take some cues from Cisco.",
        "created_utc": 1591368820,
        "id": "fsz7svj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591397620.0
    },
    {
        "author": "Alex8525",
        "body": "My CSCO calls are 300% up",
        "created_utc": 1591369365,
        "id": "fsz8vj8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591398165.0
    },
    {
        "author": "_DillyPickle_",
        "body": "BA 4 shares\nCCL 2 shares\nCSCO 2 shares \nDAL 2 shares\nDIS 2 shares\nNYMT 2 shares \nPLUG 8 shares\n\nStill new to investing to criticism is welcome, also looking for recommendations for buying.",
        "created_utc": 1591237488,
        "id": "fstfryv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591266288.0
    },
    {
        "author": "Drew707",
        "body": "You know who benefits from Slack?  Zoom.  Would not be surprised at an acquisition.  GOOG, MSFT, and CSCO all have complete ecosystems, but Zoom needs Slack, and Slack shouldn't care about that.",
        "created_utc": 1591304477,
        "id": "fswhglk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591333277.0
    },
    {
        "author": "schplat",
        "body": "ORCL and CSCO are cut from the same cloth.",
        "created_utc": 1591375744,
        "id": "fszm3r0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591404544.0
    },
    {
        "author": "masmith1495",
        "body": "Long Term Dividend Portfolio\n\nLooking for feedback on a recently put together portfolio and possible recommendations and stocks/ETFs to add. Just a start but looking to add shares periodically over time. \n\nTicker/Shares Held/Purchase Price \n\nBOTZ  - 5 - $24.32 (Growth over dividend)\n\nESPO - 5 - $47.76  (Growth over dividend) \n\nSCHD - 5 - $53.90 \n\nCSCO - 5 - $46.19\n\nDAL - 10 - $26.47\n\nDUK - 2 - $86.63\n\nO - 5 - $56.23 \n\nPEP - 1 - $133.84\n\nVZ - 5 - $56.57",
        "created_utc": 1591201580,
        "id": "fsrf06l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591230380.0
    },
    {
        "author": "reddituseranyonymous",
        "body": "Thanks. Im guessing chips and components need to be upgraded for 5G wireless? I bought some CSCO and IBM today",
        "created_utc": 1591206138,
        "id": "fsrosg9",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1591234938.0
    },
    {
        "author": "OT411",
        "body": "I agree, Ford uses Cisco Webex\n\nSame with the university I attend",
        "created_utc": 1591210943,
        "id": "fsrzbk5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591239743.0
    },
    {
        "author": "bobrobor",
        "body": "And CSCO",
        "created_utc": 1591215444,
        "id": "fss92se",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591244244.0
    },
    {
        "author": "HUMPDAY77",
        "body": "Cisco ?",
        "created_utc": 1591055590,
        "id": "fskx6qy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591084390.0
    },
    {
        "author": "MementoMori97",
        "body": "Personally, I would go about 50-75% in a total market or S&amp;P 500 index fund like VTI, VOO, SPY, ITOT, etc. And then use the other 25-50% in high quality companies you like and research. \n\nFor example: 60%-VTI 20%-MSFT 10%-KO 10%XOM\n\n(THIS IS JUST AN EXAMPLE NOT SAYING PICK THESE WITHOUT LOOKING INTO IT)\n\nMy brokerage account currently is ~40% ITOT and the rest is split pretty evenly between Nokia, a clean energy ETF and Cisco, with Cisco having the highest weighting of the three.\n\nJust gotta do your own research and be confident in any individual stocks you pick. Index funds are much safer but still have the potential for corrections and to lose money in the near term.",
        "created_utc": 1591026631,
        "id": "fsjaz7g",
        "score": 1,
        "subreddit": "investing",
        "created": 1591055431.0
    },
    {
        "author": "ChoochMMM",
        "body": "Did anyone else get CSCO calls today?",
        "created_utc": 1591053288,
        "id": "fsksxqs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591082088.0
    },
    {
        "author": "TheAvantGardeners",
        "body": "Plot twist, they use CSCO /s",
        "created_utc": 1591037953,
        "id": "fsjy8mm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591066753.0
    },
    {
        "author": "xRiotZx",
        "body": "CSCO ER",
        "created_utc": 1591069178,
        "id": "fslkyqi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591097978.0
    },
    {
        "author": "That70sUsername",
        "body": "No, it's not driven by a magical expectation. The high price is due to their market penetration, which is unlike any competitor.\n\nI'm not saying it's justified, I honestly have no idea what the true value of this company is, nobody does, but the value in Zoom is so much more than a 'magical expectation'.\n\nTech companies have stickier customers than any other industry in history due to the incredible amounts of data they can collect.\n\nAt a global scale, both on a consumer, business and enterprise level, Zoom has daily analytics on:\n\n- How many video conferences take place\n- Who participates in them\n- Whether they use chat features or just the video/audio\n- How many people are in a meeting\n- How close participants are geographically\n\nHonestly, I could make this list as long as I liked, the data points are endless.\n\nNo other video conference company has such deep penetration across every area of the vidconf market. \n\nThat mix of personal, business and enterprise penetration isn't something anyone else in the market has, and it's so incredibly valuable at a data analytics level. \n\nBeing able to compare and contrast customer behaviours across different contexts unlocks insights that power incredible company growth (see: Facebook)\n\nThis incredible amount of data informs their future product development opportunities, meaning that it's a strong bet that Zoom is going to make better future plays in the technology space than their competitors (e.g. Google, Webex, etc).\n\nNote again that these competitors cover an area of the market each (personal, enterprise), Zoom covers all of it and more.\n\nWhen you combine that with the fact that they have already destroyed every competitor in the space on user experience and customer satisfaction, this puts them at a huge advantage over every other player in the video conference space. \n\nThey came into this space as a startup competing against Microsoft, Cisco and Google, and they're winning by a country mile.\n\nSo when video chats move from 'schedule a call' to an all inclusive platform that handles all communications across audio/video, personal/business, etc, Zoom is going to be the best placed to dominate that huge market.\n\nThis is an equivalent shift in the Telcom industry as the one from dial phones to mobile phones. \n\nIf you're imagining what a shift like that might look like, imagine having cameras from your TV, fridge and various 'IoT enabled' devices around your house that follow you as you talk to people.\n\nImagine having an affordable interactive whiteboard in your house that updates as your video partners write on their own interactive whiteboards.\n\nImagine it get used to plan family trips out as much as it's used to plan corporate strategies.\n\nImagine being able to manipulate AR models on video and share it with the world.\n\nThat all requires a central platform to harness all the data involved and turn it into a user experience. Zoom is better placed to do that than any other company in the world right now.\n\nThat is what it's price is driven by.\n\nAnd all you see is people whining that they had a security breach, as though that can't be fixed (which it has).\n\nEvery company has data breaches, not every company is this well placed to dominate a market that is going to grow like wildfire over the next 20 years.\n\n---------\n\nNow, with all that being said, I still only have 10% of my portfolio in Zoom, even with all this going for it, every company is a 50/50 bet at best. But if I'm gonna pick 10 companies in the world to invest in, Zoom is definitely one of them.",
        "created_utc": 1591259528,
        "id": "fsua1hd",
        "score": 1,
        "subreddit": "investing",
        "created": 1591288328.0
    },
    {
        "author": "grathe",
        "body": "&gt;it's not CFA analysts who need to come around. It's the current shareholders who already bought at \"inflated\" valuations.\n\nNot at all. If (when?) the big boys decide to dump, current buying demand will not be near enough to maintain the prices.\n\nRight now they are slowly unloading to not scare off the buyers.\n\nI think of these stocks kind of like CSCO in 2000",
        "created_utc": 1591334870,
        "id": "fsxz45v",
        "score": 1,
        "subreddit": "investing",
        "created": 1591363670.0
    },
    {
        "author": "WaitingForGateaux",
        "body": "Why are webcasts for cloud/networking always the glitchiest? The WORK call quality sucks. CLDR yesterday sucked. CSCO sucked, HPE sucked. \n\nAre \"undocumented shoppers\" looting optical fiber in California?",
        "created_utc": 1591305754,
        "id": "fswk4e3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591334554.0
    },
    {
        "author": "jonnydoo84",
        "body": "I have a good amount of Cisco shares, but webex kind of sucks.",
        "created_utc": 1591232866,
        "id": "fst7kak",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591261666.0
    },
    {
        "author": "burninTsherman",
        "body": "Cisco, Google and Microsoft are better alternatives.",
        "created_utc": 1591140390,
        "id": "fsou1ow",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591169190.0
    },
    {
        "author": "GreatMidnight",
        "body": "This literally doesn't matter. Even if webex goes to zero Cisco will just sell more routers for the increased voice and video traffic required on the networks.",
        "created_utc": 1591143871,
        "id": "fsp0e6y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591172671.0
    },
    {
        "author": "oldskol_d",
        "body": "Don't short CSCO based on this post.  Pre-pandemic many entities were moving away from WebEx due to the introduction  of numerous lower cost upstarts.  The fact that ops company didn't realize that WebEx was a premium product, reserved for external meetings, until the third month of the pandemic indicates that we should short his firm.",
        "created_utc": 1591112770,
        "id": "fsn8r8g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591141570.0
    },
    {
        "author": "rlv28",
        "body": "MSFT 16.63%\n\nCSCO 3.66%\n\nWFC 2.25%\n\nV 11.52%\n\nAAPL 16.49%\n\nWM 4.73%\n\nAMZN 38.68%\n\nSCHF 5.97%\n\nAll positions in Roth IRA",
        "created_utc": 1591218595,
        "id": "fssfpic",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591247395.0
    },
    {
        "author": "icantfindanametwice",
        "body": "Fake dd- source: am former Cisco contractor live with ex webex employee and know many who went from csco to Zoom.\n\nWebex or WebEx is how it’s written internally always, never hyphenated. Check the Cisco billboard on 880 in the Bay Area close to Cisco’s campus.\n\nThen again, I’m a random internet punter who didn’t take the time to do crappy photoshop. So never mind, go buy.",
        "created_utc": 1591105636,
        "id": "fsmux48",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591134436.0
    },
    {
        "author": "Rocfranklogjam001",
        "body": "Some context. This is only one company but it is the third largest company in its market sector. Not sure what percentage web-ex is for csco but I would imagine it’s a reasonable portion. Every company I have worked for used Web-ex  on MS systems. I see this change moving through a lot of industries especially with the high number of MS system users.",
        "created_utc": 1591103588,
        "id": "fsmrhlh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591132388.0
    },
    {
        "author": "steatorrhoea",
        "body": "323 million in revenue \n\nAnd net revenue 27 million \n\nSchools opening up. FB, MSFT, Whatsapp, Cisco, and the tom’s mom have the same tech prepacked for much cheaper (or free) with more security. \n\nLet’s just assume the stars are going to keep aligning for zoom and growth is sustained.",
        "created_utc": 1591160918,
        "id": "fspsq26",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591189718.0
    },
    {
        "author": "facehuggerpoop",
        "body": "CSCO hardly moves for anything.\n\nUnless those calls are far out to avoid theta burn, don’t.",
        "created_utc": 1591022589,
        "id": "fsj3mlq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591051389.0
    },
    {
        "author": "xRiotZx",
        "body": "All memory data used to support servers for companies like ZM, CSCO, MSFT, etc is manufactured by MU.",
        "created_utc": 1591027238,
        "id": "fsjc6tt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591056038.0
    },
    {
        "author": "HiMyNamesEvan",
        "body": "Cisco",
        "created_utc": 1591073685,
        "id": "fslrv33",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591102485.0
    },
    {
        "author": "inb4ElonMusk",
        "body": "I've never used either. WebEx a few times but that's it. I just don't see how ZM could ever compete with Microsoft or Cisco on the pricing long term.",
        "created_utc": 1591116081,
        "id": "fsnfm48",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591144881.0
    },
    {
        "author": "SirPickleSwanson",
        "body": "Csco pump",
        "created_utc": 1591127471,
        "id": "fso3tjs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591156271.0
    },
    {
        "author": "mpbh",
        "body": "Like I said, for our 300k population WebEx was cheaper. Zoom doesn't have the same volume discount that Cisco offered.",
        "created_utc": 1591131532,
        "id": "fsocj7x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591160332.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "that is hilarous\n\nI am holding CSCO so good for me, LOL",
        "created_utc": 1591130861,
        "id": "fsob4gy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591159661.0
    },
    {
        "author": "WSBnoobxor",
        "body": "Probably move as slow as Well and Cisco",
        "created_utc": 1591133161,
        "id": "fsofx6q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591161961.0
    },
    {
        "author": "azwel",
        "body": "i see they own  \n\n* Microsoft Corporation 18.51%\n* Apple Inc.\n* Visa Inc. Class A 4.15%\n* Intel Corporation 3.81%\n* Mastercard Incorporated Class A 3.51%\n* Cisco Systems, Inc.\n* Adobe Inc.\n* NVIDIA Corporation 2.48\n\nI Have a lot of those.  A couple like cisco  adobe, nvidia, i dont have.  I could either buy those few,  or just this etf..",
        "created_utc": 1591126310,
        "id": "fso1bpq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591155110.0
    },
    {
        "author": "sgt_warturkey",
        "body": "Sitting on the sidelines is the worst thing you can do. If you're really that risk averse, at least buy some Vanguard fund or get Wells Fargo, Coke and Cisco while they're still kind of on sale.",
        "created_utc": 1591167668,
        "id": "fsq1dse",
        "score": 1,
        "subreddit": "investing",
        "created": 1591196468.0
    },
    {
        "author": "wimmelbuilder",
        "body": "My take is Zoom will slowly get eroded over a few years and then get bought out by Cisco or HPE where all enterprise software go to die",
        "created_utc": 1591179349,
        "id": "fsqe67p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591208149.0
    },
    {
        "author": "GreatMidnight",
        "body": "John Chambers once said after the Tandberg acquisition that for every dollar of video revenue, Cisco would see 9 dollars of route-switch and now wireless. Anything that drives more traffic over the network increases the sales of Cisco for the enterprise as well as the backbone provider.",
        "created_utc": 1591147179,
        "id": "fsp697b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591175979.0
    },
    {
        "author": "RIC_FLAIR-WOOO",
        "body": "I prefer QQQ but if you want strictly \"tech\", I guess VGT is pretty good too.  I wish QQQ didn't hold so much stinker CSCO, though.",
        "created_utc": 1591291306,
        "id": "fsvouyg",
        "score": 1,
        "subreddit": "investing",
        "created": 1591320106.0
    },
    {
        "author": "ChoochMMM",
        "body": "Anyone have CSCO calls?",
        "created_utc": 1591280500,
        "id": "fsv276u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591309300.0
    },
    {
        "author": "thebiggdirtyy",
        "body": "Never bought into draftkings due to the volatile nature of it.\n\nWent with Cisco, Microsoft, shaw and Onex\n\nUp 5% total portfolio since April 11th and I'm happy",
        "created_utc": 1591330842,
        "id": "fsxt9e1",
        "score": 1,
        "subreddit": "investing",
        "created": 1591359642.0
    },
    {
        "author": "831sweatyfeet",
        "body": "Mixed conservative bag right now. I went easy knowing I have money on the sidelines that I’ve been waiting to get my hands on. Should be here next week. \nPutting 80% into the market wherever I see value, without over extending risk. \n\nMo pm bac brk.b jpm\n\nAdding next week and looking at forward thinking stuff like lulu ulta dpz gpn ma v. Probably add some conservative tech like txn intc etc. not looking to make any outsized gains but to hold. Might use some cash to say trade and keeping 10-20% in cash to buy any kind of dips",
        "created_utc": 1591390969,
        "id": "ft0hqgg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591419769.0
    },
    {
        "author": "millerlit",
        "body": "aapl,msft,googl,gpn,v,ma,dis,ba,nvda,amd,amzn",
        "created_utc": 1591562741,
        "id": "ftaweta",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591591541.0
    }
]