[
    {
        "author": "Sanchuniathon",
        "body": "Sorted by weight ZAG, XBC, BIP, ARX, HUTL , ATD, BAM, BEP, WCN, AQN, SIA, AW, ZDI, AD, FLT, NFI, ETMC, BNS, XAW\n\nBeen a great 3/4 year, up 16%. That said it is my first year investing self directed and I am sure I am due for some ups and downs.\n\nHuge weight in ARX, XBC is more because of their individual success than actually overweighting in them.",
        "created_utc": 1578666899,
        "id": "fdqhn55",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1578695699.0
    },
    {
        "author": "TrumpChange2me",
        "body": "cbsnews: US officials are confident Ukrainian Flt 752 was shot down by Iran. US intelligence picked up signals of the radar being turned on &amp; satellite detected infrared blips of 2 missile launches, probably SA-15s, followed shortly by another infrared blip of an explosion.\"",
        "created_utc": 1578588452,
        "id": "fdnlrl2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578617252.0
    },
    {
        "author": "jmho19",
        "body": "lol you’re good what gave it away? air canada? i honestly don’t think they’ll fail tho, every drone startup is for surveillance and flt isn’t taking that route, they are focused on depot to depot and depot to consumer logistics and parcel delivery.. if they can get contracts with companies like UPS, Canada Post, Onstar and all the emergency first responder services in canada then the sky is the limit.. imagine getting your car stuck in the snow and onstar delivers you a hand shovel and a bag of cat litter or food and a heated blanket.. epi pens or a defibrillator dropped off to your kids soccer game or a dose of narcan for a drug overdose faster than it would take for an ambulance to arrive.. they just need to be the first to make it happen and take control of the market that’s all lol no big deal.. a buyout would be nice but i’d rather see their service in action before the buyout that way we don’t have to accept a low ball offer",
        "created_utc": 1580068811,
        "id": "ffnp3ee",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1580097611.0
    },
    {
        "author": "meanordljato",
        "body": "I'll like some input\n\nUPWK 10%\n\nTEVA 10%\n\nETSY 7%\n\nAMRN 10%\n\nENPH 10%\n\nADPT 2%\n\nBYND 3%\n\nCHRS 1.5%\n\nWATT 2%\n\nFLT 4.5%\n\nFCEL 1%\n\nLK 3%\n\nNBRV 3%\n\nNM 1.5%\n\nSSTI 3%\n\nSDC 3%\n\nUEC 3%\n\nBSK 4.5%\n\nBEE.V 6%\n\nBITCOIN 10%\n\nCURECOIN 1.5%\n\nPAT.V 4.5%\n\nAnd some 4-5 other smaller positions",
        "created_utc": 1579756182,
        "id": "ffb9ief",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579784982.0
    }
]