[
    {
        "author": "Bianfuxia",
        "body": "My nihilist thoughts exactly, gonna double my position on it tomorrow at open because it was literally created by thiel and funded by In-Q-Tel aka the CIA, the governments not just gonna let this go they’re already bought in.",
        "created_utc": 1605463747,
        "id": "gcerhk5",
        "permalink": "/r/wallstreetbets/comments/jumwot/load_up_on_pltr_big_time_or_you_will_miss_it/gcerhk5/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1605492547.0
    },
    {
        "author": "dcss_west",
        "body": "why didnt u guys tel lme a bout the new thread holy FUCK hello everyone congratulations on the next 4 years of stock market gains by the way spy 600 2024",
        "created_utc": 1604453547,
        "id": "gb2h0m5",
        "permalink": "/r/wallstreetbets/comments/jnllmp/perielection_election_discussion_thread/gb2h0m5/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1604482347.0
    },
    {
        "author": "Foxinc666",
        "body": "I’ll tel you who’s not having a good time today carnival",
        "created_utc": 1604518428,
        "id": "gb5c8x6",
        "permalink": "/r/wallstreetbets/comments/jnu8gl/daily_discussion_thread_for_november_04_2020/gb5c8x6/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1604547228.0
    },
    {
        "author": "fetusblender666",
        "body": "Intel about to be been-tel 😏",
        "created_utc": 1605032653,
        "id": "gbuooie",
        "permalink": "/r/wallstreetbets/comments/jriieh/daily_discussion_thread_for_november_10_2020/gbuooie/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605061453.0
    },
    {
        "author": "filterface",
        "body": "Been effectively legal for a while. In 2016 you could sit down at any cafe in Tel Aviv and see some hipster roasting a bone",
        "created_utc": 1605225973,
        "id": "gc3p8a1",
        "permalink": "/r/wallstreetbets/comments/jt38hy/what_are_your_moves_tomorrow_november_13_2020/gc3p8a1/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605254773.0
    },
    {
        "author": "Regjohn",
        "body": "Tel Aviv",
        "created_utc": 1605380862,
        "id": "gca0461",
        "permalink": "/r/wallstreetbets/comments/jtohy5/weekend_discussion_thread_for_the_weekend_of/gca0461/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605409662.0
    },
    {
        "author": "Redditor45643335",
        "body": "I disagree, most presidents are not radicals and often do not undo each others policies. \n\nBiden isn't going to spend money knocking down a wall that's already been built, or spend money moving the US embassy out of Jerusalem back to Tel Aviv etc. \n\nRemember a lot of what the president can do needs to be approved by congress and good luck getting some of those policies through the senate.\n\nI suspect the 2 main issues Biden will reverse will be the climate accord and the Iran nuclear deal. As long as the next republican isn't a Trump 2.0 the US should return back to a normal path of slow and steady progression rather than back and fourth overriding their predecessors policies.",
        "created_utc": 1604835096,
        "id": "gblkywj",
        "permalink": "/r/wallstreetbets/comments/jpufeo/postelection_election_discussion_thread/gblkywj/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604863896.0
    },
    {
        "author": "JamesRoth949",
        "body": "Tel them not us r/politics",
        "created_utc": 1604370975,
        "id": "gayravk",
        "permalink": "/r/wallstreetbets/comments/jmv1ax/what_are_your_moves_tomorrow_november_03_2020/gayravk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604399775.0
    },
    {
        "author": "GetOFFredditnow8504",
        "body": "Lol nobody tel him\n\nWRONG ANSWERS ONLY",
        "created_utc": 1605334867,
        "id": "gc8cq6l",
        "permalink": "/r/wallstreetbets/comments/jtohy5/weekend_discussion_thread_for_the_weekend_of/gc8cq6l/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605363667.0
    },
    {
        "author": "1200mademeaCommie",
        "body": "Ship me 1k and I’ll tel u",
        "created_utc": 1605364758,
        "id": "gc977zh",
        "permalink": "/r/wallstreetbets/comments/jtohy5/weekend_discussion_thread_for_the_weekend_of/gc977zh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605393558.0
    },
    {
        "author": "BuffaloFortress",
        "body": "The only way you should’ve put on this trade was on Friday.. wait for reflation to die, dying hope to tear a new asshole in cyclicals, and build massive positions (these recovery stocks are immune from sell off at a certain threshold not much below where they are now, ie CCL holds $13-14, same with airline stocks, DAL at $30’ish)... more concrete good news comes out dump at fucking opening bell.. I’ll tel you right now, the masses won’t get vaccines until December 2021 and we don’t know if antibodies are even effective and if gene mutation warrants current experiments pointless..  China doesn’t believe in herd immunity and .01% of their population has antibodies.. I hit that trade HUGE Monday and going to do it again when hope diminishes",
        "created_utc": 1605318434,
        "id": "gc7pohk",
        "permalink": "/r/wallstreetbets/comments/jtohy5/weekend_discussion_thread_for_the_weekend_of/gc7pohk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605347234.0
    },
    {
        "author": "Discipline_Character",
        "body": "Pls tel me your plays",
        "created_utc": 1605416972,
        "id": "gccduai",
        "permalink": "/r/wallstreetbets/comments/jugb1o/how_do_i_restart_this_game/gccduai/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605445772.0
    },
    {
        "author": "learningtosail",
        "body": "The embassy is still in Tel Aviv athough it is a \"branch office\".\n\nI visited Tel aviv in 2018, the us embassy was next to my hostel, it's right on the beach! I asked the security if it had actually moved and he said that it was \"in progress\" with a smirk. He agreed that everyone was pissed off because obviously all the diplomats would rather be in Tel Aviv on the beach than Jerusalem, which is frankly a tourist town full of whackos of all religions.\n\nThis conversation actually happened, I was surprised that he was willing to talk to me tbh",
        "created_utc": 1604838990,
        "id": "gblte6r",
        "permalink": "/r/wallstreetbets/comments/jpufeo/postelection_election_discussion_thread/gblte6r/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604867790.0
    },
    {
        "author": "BloombergFor2020",
        "body": "Ill tel you one now. Salesforce. They also pivoted to covid mapping fairly quickly.\n\nI’d love to see a comparison of the platforms, i assume palantir is miles ahead.",
        "created_utc": 1604847758,
        "id": "gbm7v2u",
        "permalink": "/r/wallstreetbets/comments/jpw5ij/guys_pltr_is_visiting_my_college_what_should_i/gbm7v2u/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604876558.0
    },
    {
        "author": "investinglong",
        "body": "How do you do the calculations again?\n\nYou’re holding 85 shares at $17 so to me that means 85 x $17 should tel me your initial investment right? \n\nHow do you figure out the gain?",
        "created_utc": 1604433189,
        "id": "gb1dcc3",
        "permalink": "/r/stocks/comments/jne3i6/selling_td_and_buying_nio/gb1dcc3/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1604461989.0
    },
    {
        "author": "flatech",
        "body": "I do this and have not held an index fund.\nThere isn't really anything to watch, you just buy and hold like an index fund. Also avoid hype stocks NIO, TSLA, PLTR etc. and you won't have to closely watch the day to day of your portfolio, as these stocks move quickly in either direction. Making them good for trading but not long term buy and holds. There are stocks that don't drop as much as index funds and go up faster than index funds. Examples: V, MA, TYL, AAON, CABO, CHTR, STE, CTAS, MKTX, SLP, ROST, TJX, BFAM, CHDN, PGR, CSGP, ZTS, EW, DG and NEE.\n\nThat's 20 stocks for a portfolio that blows away any index over a multi decade period. With a volatility less than the SP500.",
        "created_utc": 1606172140,
        "id": "gddp9qh",
        "permalink": "/r/investing/comments/jzrsd3/moving_from_passive_index_to_20_stock_portfolio/gddp9qh/",
        "score": 1,
        "subreddit": "investing",
        "created": 1606200940.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  2nd of November\n\n\n\n## Upcoming events for Monday, November  2nd\n\n - Stock splits:\n\n    - MDLY @ **1:10**\n\n - Expected earnings:\n\n  ADTN, ADUS, AGRX, AIZ, AKTX, ALUS, ALX, AMC, AMCX, AMRC, ANET, ANH, APPF, ARGO, ARVN, ATXI, AWR, BCC, BKH, BRKR, BSM, BTE, BWXT, BYFC, CBFV, CCLP, CCXI, CDEV, CDK, CDLX, CDW, CINR, CLCT, CLX, CNA, CNO, CNTY, CORR, CPAC, CPE, CPLP, CRD.A, CRD.B, CRNT, CRUS, CTIC, CVI, CWH, DEA, DEI, DOOR, DRIO, DRRX, DSPG, EC, ECPG, EEX, EGRX, EL, ELVT, ENIA, ESPR, EVER, EVRI, EXTN, FANG, FBM, FE, FICO, FMC, FN, FNCB, FRPT, FTSI, FUNC, FUSB, G, GAIN, GHL, GIFI, HALO, HCKT, HGEN, HLIO, HMN, HNRG, HRTG, HSIC, HUD, HURN, HZNP, IAA, ICCH, ICHR, IHT, INGR, INSP, IOVA, IPI, IR, IRET, ISEE, ITIC, ITRI, ITUB, JAKK, JAZZ, JCOM, JLL, KFRC, KMPR, KMT, KNSA, KPTI, KRYS, L, LCII, LDOS, LEG, LITE, LL, LNT, LPG, MATX, MDLZ, MEC, MED, MG, MGP, MIME, MITT, MOS, MPC, MPLX, MRTX, MSGN, MVBF, MYGN, MYOK, NC, NCMI, NERV, NI, NNN, NPTN, NSP, NSSC, NTP, NTR, NWHM, NXE, O, OGS, OMI, ON, ONCS, ONTO, OSPN, OTTR, OXBR, OXLC, PAA, PACB, PAGP, PARR, PBR, PBR.A, PEAK, PINC, PMBC, PUMP, PYPL, QTNT, RGS, RIG, RMBS, RPAI, RVNC, RYAAY, SAMA, SANM, SBAC, SEDG, SIBN, SIMO, SNDX, SOGO, SOHU, SRC, SRRA, STE, STIM, STRL, SUP, SWKS, SYN, TCMD, TEN, TLGT, TMBR, TPTX, TREX, TRVG, TRVN, TYME, UAN, UROV, USFD, VCTR, VCYT, VEON, VNO, VNOM, WBK, WING, WLFC, WM, WMB, WMK, XENT, YRCW\n\n - Ex-div:\n\n  ASGI, ASML, BANR, BKEP, CAPL, ETRN, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, IID, ITUB, KEN, LBAI, LMRK, MET, SHLX, SPH, SRCE, USDP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.100%)\n    - 6-Month Bill Auction (previous: 0.110%)\n    - Construction Spending (consensus: 0.9%, previous: 1.4%)\n    - Core PCE Price Index (previous: 0.3%)\n    - Core PCE Price Index (previous: 1.6%)\n    - ISM Manufacturing Employment (previous: 49.6)\n    - ISM Manufacturing New Orders Index (previous: 60.2)\n    - ISM Manufacturing PMI (consensus: 55.8, previous: 55.4)\n    - ISM Manufacturing Prices (consensus: 58.6, previous: 62.8)\n    - Investing.com Gold Index (actual: 56.5%, previous: 58.5%)\n    - Investing.com S&amp;P 500 Index (actual: 65.9%, previous: 58.7%)\n    - Loan Officer Survey\n    - Manufacturing PMI (previous: 53.3)\n    - PCE Price index (previous: 1.4)\n    - PCE price index (previous: 0.3%)\n    - Total Vehicle Sales (previous: 15.70M)\n\n## Upcoming events for Tuesday, November  3rd\n\n - Expected earnings:\n\n  ACET, ACOR, AGCO, AJX, AKR, ANAT, ANDE, APLS, AQB, ARA, ARCB, ARNC, AROC, ATH, ATHM, AUBN, AVD, AVNS, AVNT, BBGI, BBU, BCTX, BHC, BLD, BMCH, BRY, BTG, BTU, CARA, CARG, CBAY, CBD, CC, CGBD, CHCT, CHFS, CHSCP, CLSK, CLW, COHR, COKE, CORT, CPTA, CRIS, CRVL, CTLT, EAF, EMR, ES, ETN, ETRN, EURN, EXC, EXK, EXPD, FATE, FI, FOX, FOXA, FSP, GBLI, GCI, GLDD, GORO, GRFS, GSH, GTE, GTES, GWPH, HBM, HRZN, HSC, HTA, HUM, HY, HYRE, ICD, ICPT, INN, INS, IOSP, IPAR, IT, ITCI, JBGS, JCI, JELD, KAR, KE, KOPN, KRMD, LFC, LFVN, LGIH, LPX, LUNA, MBI, MCK, MCRB, MCS, MCY, MDNA, MDRR, METC, MOR, MRCY, MYL, NBR, NES, NEX, NEXT, NHC, NK, NP, NPO, NR, NRC, NSIT, OCFT, OCN, OMP, OPCH, ORA, OTEL, OXFD, PACD, PAYS, PEI, PFHD, PFIS, PKOH, PMD, PRU, PTRS, PTVCA, PTVCB, QUAD, RACE, RCM, RCUS, RHP, RNWK, RVI, SAVA, SCOR, SHIP, SIM, SMCI, SMIT, SPKE, SPR, STAR, SUPN, SYY, TCFC, TCON, TEF, TIMB, TISI, TREC, TRHC, TRI, TRMT, TTI, TX, UEC, UFPT, USAC, VIST, VIV, VPG, VSH, VSTM, W, WBT, WEC, WEYS, WLK, WLKP, WMG, WTRG, WTTR, XENE, XNCR, XOMA, Y, ZBRA, ZYME\n\n - Ex-div:\n\n  AIV, AMRB, BRO, CLX, EIG, FMX, HFWA, MCBS, PCB, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.140%)\n    - API Weekly Crude Oil Stock (previous: 4.577M)\n    - Durables Excluding Defense (previous: 3.4%)\n    - Factory Orders (consensus: 1.0%, previous: 0.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 55.2)\n    - ISM NY Business Conditions (previous: 56.1%)\n    - ISM-New York Index (previous: 807.3)\n    - Redbook (previous: 0.8%)\n    - Redbook (previous: 1.2%)\n    - U.S. Presidential Election\n\n## Upcoming events for Wednesday, November  4th\n\n - Expected earnings:\n\n  AAMC, ABIO, ACAD, ACIA, AE, AEE, AFIN, AGLE, AGM, AHCO, ALB, ALBO, ALL, ALLO, ALLT, ALSK, ALTM, AMEH, AMOT, AMSC, ANIK, ANSS, ANVS, APA, APEN, AQST, ARC, ARDX, ARTNA, ASC, ASTE, ATAX, ATEX, ATLO, AVA, AWK, AXNX, AZPN, BBD, BBDO, BBSI, BCH, BEP, BIDU, BIOL, BKCC, BKD, BKEP, BKTI, BLCM, BLPH, BRX, BSBR, BSGM, BWEN, CAPL, CBMG, CCAP, CCJ, CCRN, CCU, CDXC, CEA, CECE, CF, CFMS, CHEK, CHNG, CIA, CIB, CIM, CIX, CLFD, CLH, CLI, CMP, COHN, CPK, CRK, CRY, CSGS, CSII, CSTE, CTSO, CTVA, CUTR, CVU, CWBR, CXW, CYTK, DAR, DCP, DFIN, DHX, DK, DKL, DMAC, DNLI, DNOW, DRTT, DXPE, EGY, ELF, ELY, ENBL, ENLC, EPM, EPR, EPRT, EQH, ESSA, ET, EXPE, EXPI, EXR, FCRD, FIT, FLMN, FLXN, FNF, FNHC, FNV, FOE, FRG, FRGI, FROG, FRPH, FSTR, FTDR, FUN, GDDY, GDOT, GFL, GHC, GIB, GLMD, GLRE, GMAB, GMRE, GNK, GNW, GOL, GOOD, GPL, GPP, GPRE, GPRK, GRNQ, GRP.U, GTHX, H, HAE, HARP, HBB, HEP, HLNE, HLT, HNGR, HOFV, HOLX, HR, HST, IAG, IBOC, IDN, IGC, IIPR, IMXI, INFI, INGN, INPX, IO, IONS, IQ, ITI, JCAP, JKHY, KAMN, KBAL, KGC, KIDS, KLDO, KRUS, KW, KZR, LANC, LAND, LAZY, LBTYA, LBTYB, LBTYK, LC, LCI, LCTX, LHCG, LILA, LILAK, LMRK, LNC, LND, LPI, LPL, LRMR, LTBR, LTRPA, LTRPB, LUMN, LYRA, MCEP, MCHX, MDGL, MDU, MELI, MET, MFA, MGEE, MGNX, MIRM, MLAB, MLP, MLR, MLVF, MNKD, MOSY, MRCC, MRO, MRSN, MTCH, MTG, MTRX, MTW, NEWT, NGD, NHTC, NMFC, NODK, NTN, NUS, NWPX, OESX, OLN, ORCC, ORIC, ORTX, OSUR, OTIC, OUT, PAAS, PAHC, PATI, PAYC, PDCE, PDLB, PEBK, PFBI, PFGC, PING, PIRS, PLUS, PLYA, PODD, PRAH, PRGO, PRI, PRQR, PRTA, PSA, PSEC, PSN, PTGX, PXD, QCOM, QLYS, QRTEA, QRTEB, QRVO, QTWO, QUIK, RC, RCMT, RDN, RDWR, REI, RESI, REXN, RGLD, RGNX, RKDA, RLJ, RPD, RPT, RTLR, RYAM, SAFT, SBGI, SBOW, SENEA, SENEB, SG, SGA, SGMO, SGMS, SGRY, SITM, SJI, SJW, SLF, SMG, SMSI, SMTX, SPPI, SRDX, SRT, STAA, STN, SUN, SUZ, SWM, SWX, SYKE, SYNC, TA, TAC, TACT, TALO, TBIO, TELL, TG, TGA, TISI, TLK, TMDX, TPC, TPCO, TRC, TRMB, TRNO, TRTX, TS, TSLX, TTEC, TTGT, TTOO, TWO, TYL, UBX, UFCS, UHAL, UMH, UNVR, UPWK, USDP, USWS, VAC, VAPO, VBIV, VMD, VOYA, VRCA, VRSK, VRT, VST, VTOL, VTVT, VVNT, VYGR, WEN, WHD, WHLR, WK, WRN, WSTG, WTI, WTM, WTS, WYNN, XAN, XEC, ZAGG, ZNGA, ZNH, ZYNE\n\n - Ex-div:\n\n  AMG, AWI, BBD, BBDO, CATC, CFBK, FELE, HESM, IBCP, IDA, LSBK, MTRN, NEP, NWBI, OFED, PVBC, STBA, VBTX, WSFS, XYL\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 650K, previous: 749K)\n    - All Car Sales (previous: 3.75M)\n    - All Truck Sales (previous: 12.59M)\n    - Crude Oil Imports (previous: 0.122M)\n    - Crude Oil Inventories (previous: 4.320M)\n    - Cushing Crude Oil Inventories (previous: -0.422M)\n    - Distillate Fuel Production (previous: -0.005M)\n    - EIA Refinery Crude Runs  (previous: 0.362M)\n    - EIA Weekly Distillates Stocks (previous: -4.491M)\n    - EIA Weekly Refinery Utilization Rates (previous: 1.7%)\n    - Exports (previous: 171.90B)\n    - Gasoline Inventories (previous: -0.892M)\n    - Gasoline Production (previous: 0.162M)\n    - Heating Oil Stockpiles (previous: -0.299M)\n    - ISM Non-Manufacturing Business Activity (previous: 63.0)\n    - ISM Non-Manufacturing Employment (previous: 51.8)\n    - ISM Non-Manufacturing New Orders (previous: 61.5)\n    - ISM Non-Manufacturing PMI (consensus: 57.5, previous: 57.8)\n    - ISM Non-Manufacturing Prices (previous: 59.0)\n    - Imports (previous: 239.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.00%)\n    - MBA Mortgage Applications (previous: 1.7%)\n    - MBA Purchase Index (previous: 305.2)\n    - Markit Composite PMI (consensus: 55.5, previous: 54.3)\n    - Mortgage Market Index (previous: 807.8)\n    - Mortgage Refinance Index (previous: 3,711.6)\n    - Seevol Cushing Storage Report (previous: -2.538M)\n    - Services PMI (consensus: 56.0, previous: 54.6)\n    - Trade Balance (consensus: -64.00B, previous: -67.10B)\n\n^^^^2020-11-02",
        "created_utc": 1604314822,
        "id": "gavwe93",
        "permalink": "/r/RobinHood/comments/jmlg7k/daily_discussion_thread_november_2nd_2020/gavwe93/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604343622.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  3rd of November\n\n\n\n## Upcoming events for Tuesday, November  3rd\n\n - Expected earnings:\n\n  ACET, ACOR, AGCO, AKR, ANAT, ANDE, APLS, AQB, ARA, ARCB, AROC, ATH, ATHM, AVNS, AVNT, BBGI, BBU, BCTX, BHC, BLD, BMCH, BRY, BTG, BTU, CARA, CBAY, CBD, CC, CGBD, CHCT, CHFS, CHSCP, CLSK, CLW, COHR, COKE, CORT, CPTA, CRIS, CRVL, CTLT, DS, EAF, EMR, ES, ETN, ETRN, EURN, EXC, EXK, EXPD, FATE, FI, FOX, FOXA, FPRX, FSP, GBLI, GCI, GLDD, GORO, GRFS, GSH, GTES, GWPH, HBM, HRZN, HSC, HTA, HUD, HUM, HY, HYRE, ICD, ICPT, INN, INS, IOSP, IPAR, IT, ITCI, JBGS, JCI, JELD, KAR, KE, KOPN, KRMD, LFC, LFVN, LGIH, LPX, MBI, MCK, MCRB, MCS, MCY, MDNA, MDRR, METC, MOR, MRCY, MYL, NBR, NES, NEX, NEXT, NHC, NK, NMCI, NP, NPO, NR, NRC, NSIT, OCFT, OCN, OMP, OPCH, ORA, OTEL, OXFD, PACD, PAYS, PEI, PFIS, PKOH, PMD, PRU, PTRS, PTVCA, PTVCB, QUAD, RACE, RCM, RCUS, RHP, RNWK, RVI, SAVA, SHIP, SIM, SMCI, SPKE, SPR, STAR, SUPN, SYY, TCFC, TCON, TIMB, TREC, TRHC, TRI, TRMT, TTI, TX, UEC, UFPT, USAC, VIST, VIV, VPG, VSH, VSTM, W, WBT, WEC, WEYS, WLK, WLKP, WMG, WTRG, WTTR, XENE, XOMA, Y, ZBRA, ZYME\n\n - Ex-div:\n\n  AIV, AMRB, BRO, CLX, EIG, FMX, HFWA, MCBS, PCB, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.140%)\n    - API Weekly Crude Oil Stock (previous: 4.577M)\n    - Durables Excluding Defense (previous: 3.4%)\n    - Factory Orders (consensus: 1.0%, previous: 0.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 55.2)\n    - ISM NY Business Conditions (previous: 56.1%)\n    - ISM-New York Index (previous: 807.3)\n    - Redbook (previous: 0.8%)\n    - Redbook (previous: 1.2%)\n    - Total Vehicle Sales (consensus: 16.50M, previous: 16.30M)\n    - U.S. Presidential Election\n\n## Upcoming events for Wednesday, November  4th\n\n - Expected earnings:\n\n  AAMC, ABIO, ACAD, ACIA, AE, AEE, AFIN, AGLE, AGM, AHCO, ALB, ALBO, ALL, ALLO, ALLT, ALSK, ALTM, AMEH, AMOT, AMSC, ANIK, ANSS, ANVS, APA, APEN, AQST, ARC, ARDX, ARTNA, ASC, ASTE, ATAX, ATEX, ATLO, AVA, AWK, AXNX, AZPN, BBD, BBDO, BBSI, BCH, BEP, BIDU, BIOL, BKCC, BKD, BKEP, BKTI, BLCM, BLPH, BRX, BSBR, BSGM, BWEN, CAPL, CBMG, CCAP, CCJ, CCRN, CCU, CDXC, CEA, CECE, CF, CFMS, CHEK, CHNG, CIA, CIB, CIM, CIX, CLFD, CLH, CLI, CMP, COHN, CPK, CRK, CRY, CSGS, CSII, CSTE, CTSO, CTVA, CUTR, CVU, CWBR, CXW, CYTK, DAR, DCP, DFIN, DHX, DK, DKL, DMAC, DNLI, DNOW, DRTT, DXPE, EGY, ELF, ELY, ENBL, ENLC, EPM, EPR, EPRT, EQH, ESSA, ET, EXPE, EXPI, EXR, FCRD, FIT, FLMN, FLXN, FNF, FNHC, FNV, FOE, FRG, FRGI, FROG, FRPH, FSTR, FTDR, FUN, GDDY, GDOT, GFL, GHC, GIB, GLMD, GLRE, GMAB, GMRE, GNK, GNW, GOL, GOOD, GPL, GPP, GPRE, GPRK, GRNQ, GRP.U, GTHX, H, HAE, HARP, HBB, HEP, HLNE, HLT, HNGR, HOFV, HOLX, HR, HST, IAG, IBOC, IDN, IGC, IIPR, IMXI, INFI, INGN, INPX, IO, IONS, IQ, ITI, JCAP, JKHY, KAMN, KBAL, KGC, KIDS, KLDO, KRUS, KW, KZR, LANC, LAND, LAZY, LBTYA, LBTYB, LBTYK, LC, LCI, LCTX, LHCG, LILA, LILAK, LMRK, LNC, LND, LPI, LPL, LRMR, LTBR, LTRPA, LTRPB, LUMN, LYRA, MCEP, MCHX, MDGL, MDU, MELI, MET, MFA, MGEE, MGNX, MIRM, MLAB, MLP, MLR, MLVF, MNKD, MOSY, MRCC, MRO, MRSN, MTCH, MTG, MTRX, MTW, NEWT, NGD, NHTC, NMFC, NODK, NTN, NUS, NWPX, OESX, OLN, ORCC, ORIC, ORTX, OSUR, OTIC, OUT, PAAS, PAHC, PATI, PAYC, PDCE, PDLB, PEBK, PFBI, PFGC, PING, PIRS, PLUS, PLYA, PODD, PRAH, PRGO, PRI, PRQR, PRTA, PSA, PSEC, PSN, PTGX, PXD, QCOM, QLYS, QRTEA, QRTEB, QRVO, QTWO, QUIK, RC, RCMT, RDN, RDWR, REI, RESI, REXN, RGLD, RGNX, RKDA, RLJ, RPD, RPT, RTLR, RYAM, SAFT, SBGI, SBOW, SENEA, SENEB, SG, SGA, SGMO, SGMS, SGRY, SITM, SJI, SJW, SLF, SMG, SMSI, SMTX, SPPI, SRDX, SRT, STAA, STN, SUN, SUZ, SWM, SWX, SYKE, SYNC, TA, TAC, TACT, TALO, TBIO, TELL, TG, TGA, TISI, TLK, TMDX, TPC, TPCO, TRC, TRMB, TRNO, TRTX, TS, TSLX, TTEC, TTGT, TTOO, TWO, TYL, UBX, UFCS, UHAL, UMH, UNVR, UPWK, USDP, USWS, VAC, VAPO, VBIV, VMD, VOYA, VRCA, VRSK, VRT, VST, VTOL, VTVT, VVNT, VYGR, WEN, WHD, WHLR, WK, WRN, WSTG, WTI, WTM, WTS, WYNN, XAN, XEC, ZAGG, ZNGA, ZNH, ZYNE\n\n - Ex-div:\n\n  AMG, AWI, BBD, BBDO, CATC, CFBK, FELE, HESM, IBCP, IDA, LSBK, MTRN, NEP, NWBI, OFED, PVBC, STBA, VBTX, WSFS, XYL\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 650K, previous: 749K)\n    - All Car Sales (previous: 3.75M)\n    - All Truck Sales (previous: 12.59M)\n    - Crude Oil Imports (previous: 0.122M)\n    - Crude Oil Inventories (consensus: 1.964M, previous: 4.320M)\n    - Cushing Crude Oil Inventories (previous: -0.422M)\n    - Distillate Fuel Production (previous: -0.005M)\n    - EIA Refinery Crude Runs  (previous: 0.362M)\n    - EIA Weekly Distillates Stocks (consensus: -1.960M, previous: -4.491M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.4%, previous: 1.7%)\n    - Exports (previous: 171.90B)\n    - Gasoline Inventories (consensus: -1.220M, previous: -0.892M)\n    - Gasoline Production (previous: 0.162M)\n    - Heating Oil Stockpiles (previous: -0.299M)\n    - ISM Non-Manufacturing Business Activity (consensus: 62.0, previous: 63.0)\n    - ISM Non-Manufacturing Employment (previous: 51.8)\n    - ISM Non-Manufacturing New Orders (previous: 61.5)\n    - ISM Non-Manufacturing PMI (consensus: 57.5, previous: 57.8)\n    - ISM Non-Manufacturing Prices (previous: 59.0)\n    - Imports (previous: 239.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.00%)\n    - MBA Mortgage Applications (previous: 1.7%)\n    - MBA Purchase Index (previous: 305.2)\n    - Markit Composite PMI (consensus: 55.5, previous: 54.3)\n    - Mortgage Market Index (previous: 807.8)\n    - Mortgage Refinance Index (previous: 3,711.6)\n    - Seevol Cushing Storage Report (previous: -2.538M)\n    - Services PMI (consensus: 56.0, previous: 54.6)\n    - Trade Balance (consensus: -63.80B, previous: -67.10B)\n\n^^^^2020-11-03",
        "created_utc": 1604401217,
        "id": "gazsbv8",
        "permalink": "/r/RobinHood/comments/jn8can/daily_discussion_thread_november_3rd_2020/gazsbv8/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604430017.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  4th of November\n\n\n\n## Upcoming events for Wednesday, November  4th\n\n - Expected earnings:\n\n  AAMC, ABIO, ACAD, ACIA, AE, AEE, AFIN, AGLE, AGM, AHCO, ALB, ALBO, ALL, ALLO, ALLT, ALSK, ALTM, AMEH, AMOT, AMSC, ANIK, ANSS, ANVS, APA, APEN, AQST, ARC, ARDX, ARTNA, ASC, ASTE, ATAX, ATEX, ATLO, AVA, AWK, AXNX, AZPN, BBD, BBDO, BBSI, BCH, BEP, BIDU, BIOL, BKCC, BKD, BKEP, BKTI, BLCM, BLPH, BRX, BSBR, BSGM, BWEN, CAPL, CBMG, CCAP, CCJ, CCRN, CCU, CDXC, CEA, CECE, CF, CFMS, CHEK, CHNG, CIA, CIB, CIM, CIX, CLFD, CLH, CLI, CMP, COHN, CPK, CRK, CRY, CSGS, CSII, CSTE, CTSO, CTVA, CUTR, CVU, CWBR, CXW, CYTK, DAR, DCP, DFIN, DHX, DK, DKL, DMAC, DNLI, DNOW, DRTT, DXPE, EGY, ELF, ELY, ENBL, ENLC, EPM, EPR, EPRT, EQH, ESSA, ET, EXPE, EXPI, EXR, FCRD, FIT, FLMN, FLXN, FNF, FNHC, FNV, FOE, FRG, FRGI, FROG, FRPH, FSTR, FTDR, FUN, GDDY, GDOT, GFL, GHC, GIB, GLMD, GLRE, GMAB, GMRE, GNK, GNW, GOL, GOOD, GPL, GPP, GPRE, GPRK, GRNQ, GRP.U, GTHX, H, HAE, HARP, HBB, HEP, HLNE, HLT, HNGR, HOFV, HOLX, HR, HST, IAG, IBOC, IDN, IGC, IIPR, IMXI, INFI, INGN, INPX, IO, IONS, IQ, ITI, JCAP, JKHY, KAMN, KBAL, KGC, KIDS, KLDO, KRUS, KW, KZR, LANC, LAND, LAZY, LBTYA, LBTYB, LBTYK, LC, LCI, LCTX, LHCG, LILA, LILAK, LMRK, LNC, LND, LPI, LPL, LRMR, LTBR, LTRPA, LTRPB, LUMN, LYRA, MCEP, MCHX, MDGL, MDU, MDXG, MELI, MET, MFA, MGEE, MGNX, MIRM, MLAB, MLP, MLR, MLVF, MNKD, MOSY, MRCC, MRO, MRSN, MTCH, MTG, MTRX, MTW, NEWT, NGD, NHTC, NMFC, NODK, NTN, NUS, NWPX, OESX, OLN, ORCC, ORIC, ORTX, OSUR, OTIC, OUT, PAAS, PAHC, PATI, PAYC, PDCE, PDLB, PEBK, PFBI, PFGC, PING, PIRS, PLUS, PLYA, PODD, PRAH, PRGO, PRI, PRQR, PRTA, PSA, PSEC, PSN, PTGX, PXD, QCOM, QLYS, QRTEA, QRTEB, QRVO, QTWO, QUIK, RC, RCMT, RDN, RDWR, REI, RESI, REXN, RGLD, RGNX, RKDA, RLJ, RPD, RPT, RTLR, RYAM, SAFT, SBGI, SBOW, SENEA, SENEB, SG, SGA, SGMO, SGMS, SGRY, SITM, SJI, SJW, SLF, SMG, SMSI, SMTX, SPPI, SRDX, SRT, STAA, STN, SUN, SUZ, SWM, SWX, SYKE, SYNC, TA, TAC, TACT, TALO, TBIO, TELL, TG, TGA, TISI, TLK, TMDX, TPC, TPCO, TRC, TRMB, TRNO, TRTX, TS, TSLX, TTEC, TTGT, TTOO, TWO, TYL, UBX, UFCS, UHAL, UMH, UNVR, UPWK, USDP, USWS, VAC, VAPO, VBIV, VMD, VOYA, VRCA, VRSK, VRT, VST, VTOL, VTVT, VVNT, VYGR, WEN, WHD, WHLR, WK, WRN, WSTG, WTI, WTM, WTS, WYNN, XAN, XEC, ZAGG, ZNGA, ZNH, ZYNE\n\n - Ex-div:\n\n  AMG, AWI, BBD, BBDO, CATC, CFBK, FELE, HESM, IBCP, IDA, LSBK, MTRN, NEP, NWBI, OFED, PVBC, STBA, VBTX, WSFS, XYL\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 650K, previous: 749K)\n    - All Car Sales (previous: 3.75M)\n    - All Truck Sales (previous: 12.59M)\n    - Crude Oil Imports (previous: 0.122M)\n    - Crude Oil Inventories (consensus: 0.890M, previous: 4.320M)\n    - Cushing Crude Oil Inventories (previous: -0.422M)\n    - Distillate Fuel Production (previous: -0.005M)\n    - EIA Refinery Crude Runs  (previous: 0.362M)\n    - EIA Weekly Distillates Stocks (consensus: -1.729M, previous: -4.491M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.4%, previous: 1.7%)\n    - Exports (previous: 171.90B)\n    - Gasoline Inventories (consensus: -0.871M, previous: -0.892M)\n    - Gasoline Production (previous: 0.162M)\n    - Heating Oil Stockpiles (previous: -0.299M)\n    - ISM Non-Manufacturing Business Activity (consensus: 62.0, previous: 63.0)\n    - ISM Non-Manufacturing Employment (previous: 51.8)\n    - ISM Non-Manufacturing New Orders (previous: 61.5)\n    - ISM Non-Manufacturing PMI (consensus: 57.5, previous: 57.8)\n    - ISM Non-Manufacturing Prices (previous: 59.0)\n    - Imports (previous: 239.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.00%)\n    - MBA Mortgage Applications (previous: 1.7%)\n    - MBA Purchase Index (previous: 305.2)\n    - Markit Composite PMI (consensus: 55.5, previous: 54.3)\n    - Mortgage Market Index (previous: 807.8)\n    - Mortgage Refinance Index (previous: 3,711.6)\n    - Seevol Cushing Storage Report (previous: -2.538M)\n    - Services PMI (consensus: 56.0, previous: 54.6)\n    - Trade Balance (consensus: -63.80B, previous: -67.10B)\n\n## Upcoming events for Thursday, November  5th\n\n - Expected earnings:\n\n  AAIC, AAOI, AAON, AAWW, AAXN, ABC, ABUS, ACEL, ACIW, ACLS, ACMR, ACRS, ACRX, ADAP, ADMA, ADMS, ADT, ADVM, AEIS, AERI, AEZS, AG, AGFS, AGIO, AGO, AGS, AHH, AIG, AINV, AIRG, AIRI, AJX, AKBA, AKTS, ALDX, ALNY, ALRM, ALRN, ALTR, AMCR, AMH, AMN, AMPE, AMPY, AMRK, AMRN, AMRS, AMS, AMYT, ANGI, ANIP, AOSL, AP, APLE, APPN, APT, APVO, ARAV, ARCT, ARLO, ARNA, ARNC, ARPO, ARRY, ASM, ASMB, ATEC, ATGE, ATNX, ATRA, ATRC, ATRS, AUTL, AUTO, AVLR, AVNW, AVRO, AXDX, AXSM, AY, AYX, AZN, AZUL, BABA, BAP, BATRA, BATRK, BBAR, BBIO, BCE, BCEI, BCRX, BCSF, BCYC, BDSI, BDX, BFAM, BFS, BGS, BGSF, BHB, BHF, BIGC, BILL, BKNG, BLDP, BLFS, BLL, BMRN, BMY, BNFT, BNL, BRG, BRT, BW, CABA, CABO, CAH, CALA, CAPR, CARG, CATB, CBB, CBIO, CCOI, CCR, CDAY, CDTX, CDXS, CEIX, CELC, CEMI, CEVA, CGEN, CHH, CHMA, CHRS, CHUY, CI, CIO, CIR, CKPT, CKX, CLBS, CLLS, CLNC, CLNE, CLR, CLVS, CLXT, CMBM, CMLS, CMRX, CNCE, CNDT, CNHI, CNK, CNP, CNQ, COLD, COLL, COMM, CORE, CPLG, CPRI, CPS, CPSI, CRBP, CRDF, CREX, CRHM, CRMD, CRON, CSLT, CSOD, CSU, CTHR, CTMX, CTRE, CUBE, CUE, CWEN, CWEN.A, CWK, CYRX, CZNC, CZR, D, DAC, DBX, DCPH, DDD, DEN, DHC, DISCA, DISCB, DISCK, DISH, DLX, DNB, DNN, DRH, DRNA, DUK, DVAX, DXC, DXYN, EA, EARN, EB, EBS, ECOL, ECOM, ED, EDIT, EFC, EGLE, EIGI, EIGR, ELA, ELOX, EMAN, EML, ENDP, ENG, ENV, EOG, EPAM, EPAY, ESGR, ESTE, EVA, EVBG, EVC, EVH, EVOK, EVOP, EVRG, EXEL, EYE, EYEG, EYPT, FARM, FAT, FC, FFG, FGEN, FLDM, FLL, FLO, FLS, FLT, FNKO, FOCS, FOLD, FOR, FOUR, FRT, FVE, FWONA, FWONK, GBT, GDEN, GDP, GDYN, GEL, GEN, GERN, GH, GKOS, GLIBA, GLP, GLPG, GLUU, GLYC, GM, GNL, GOLD, GOOS, GOVX, GPRO, GPX, GRPN, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HBIO, HCFT, HCI, HDSN, HEAR, HFC, HHC, HII, HLF, HMHC, HMTV, HSKA, HSON, HUBS, HWCC, HZN, IAC, IBP, ICAD, ICFI, ICUI, IDCC, IGMS, IHC, IIVI, IMH, IMMR, IMRA, IMUX, INCY, INFN, INMB, INSG, INVE, IOVA, IRCP, IRM, IRTC, IRWD, ITP, IVR, JAX, JHX, JJSF, JYNT, KALA, KDMN, KDNY, KELYA, KELYB, KIM, KL, KODK, KOP, KRO, KRP, KRTX, KURA, KWR, LAMR, LASR, LAUR, LCUT, LEU, LGF.A, LGF.B, LIN, LIVX, LMNX, LNTH, LOMA, LOPE, LPTH, LSI, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LXP, LXU, LYV, MAC, MAIN, MANT, MAXR, MCHP, MDP, MEIP, MGEN, MGTX, MGY, MIDD, MITK, MLCO, MMI, MNPR, MNRL, MNST, MNTX, MOD, MR, MRAM, MRIN, MSC, MSON, MT, MTD, MTSI, MUR, MXL, MYOS, NAVB, NBLX, NCLH, NCSM, NEPH, NET, NEWR, NFG, NGS, NH, NINE, NKSH, NKTR, NL, NLOK, NLSN, NMIH, NMRK, NMTR, NNA, NNBR, NNI, NOMD, NRG, NRP, NS, NSA, NTLA, NTRA, NUZE, NVAX, NVCN, NVIV, NVRO, NVTA, NWGI, NWLI, NWN, NWS, NWSA, NXST, NYMT, NYT, OBSV, OCUL, ODP, OEC, OFIX, OGE, OLP, ONCT, ONVO, OTEX, OTRK, OYST, PAE, PANL, PAR, PBA, PBH, PBPB, PBYI, PCTI, PCTY, PCYG, PCYO, PDEX, PDFS, PDSB, PEIX, PESI, PETQ, PFSI, PGNY, PGTI, PH, PHI, PK, PLM, PLNT, PLUG, PMT, PNRG, PPL, PRA, PRAA, PRDO, PRMW, PROF, PRTK, PRVB, PS, PSNL, PTI, PTMN, PTON, PVAC, PZZA, QTRX, QUOT, RBA, RCKT, RDFN, RDUS, RDVT, REFR, REG, REGI, REGN, REZI, RFP, RGA, RGEN, RIBT, RIGL, RMAX, RMNI, RNET, ROKU, RP, RRGB, RSG, RTRX, RUN, SAGE, SAIL, SATS, SB, SBH, SBPH, SBR, SBRA, SCPL, SCU, SEAS, SEEL, SELB, SFE, SHI, SHO, SHYF, SIC, SIGA, SKT, SLQT, SLRC, SP, SPCE, SPNS, SPRO, SQ, SQFT, SRCL, SRE, SRG, SRLP, SRPT, SRTS, SSSS, STAG, STFC, STKS, STMP, STNG, STOR, STRA, STWD, SUNS, SUPV, SVM, SVMK, SVRA, SWCH, SYBX, SYNA, SYRS, TAST, TBPH, TCPC, TCX, TDC, TECH, TEVA, TFFP, TGI, TGS, THM, THR, THS, TIPT, TM, TMUS, TMX, TNAV, TNDM, TPIC, TPRE, TPVG, TR, TREE, TRGP, TRIP, TRUE, TRXC, TSE, TTD, TTWO, TVTY, TWI, TWNK, UBER, UE, UEIC, UEPS, UGP, UIHC, UPLD, USPH, UTZ, UVV, VBFC, VCEL, VER, VG, VGR, VIAV, VIVE, VMC, VNTR, VRAY, VRRM, VRTU, VRTV, VSAT, VSTO, VTGN, VYNE, WCC, WLDN, WLL, WMC, WMS, WNC, WRK, WSC, WTRH, WWR, WWW, XCUR, XERS, XFOR, XLRN, XNCR, XONE, XPO, XRAY, XXII, YELP, YETI, YMAB, YORW, YPF, YTRA, Z, ZEUS, ZG, ZIOP, ZTS\n\n - Ex-div:\n\n  AFB, BCBP, BCO, BMRC, BP, BPFH, BSBR, CEQP, CFFN, CIT, CMCO, CMS, CTAS, CXO, DCOM, DHF, DKL, EDF, EDI, ET, ETN, FCBC, FCF, FE, FHI, FIBK, FRAF, FRBA, FSBW, GMLP, GPP, HMST, HSII, HTBK, HWKN, IBTX, INTC, JBHT, LBC, LW, MC, MMLP, MMP, MPLX, NBLX, NGL, NS, NSC, NXST, NYCB, OPBK, PFE, PH, PNFP, PPBI, RBNC, RELL, SBFG, SIRI, SRLP, STZ, STZ.B, SUN, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 8-Week Bill Auction (previous: 0.085%)\n    - Challenger Job Cuts (previous: 118.804K)\n    - Challenger Job Cuts (previous: 118.804K)\n    - Challenger Job Cuts (previous: 185.9%)\n    - Continuing Jobless Claims (consensus: 7,200K, previous: 7,756K)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Initial Jobless Claims (consensus: 732K, previous: 751K)\n    - Jobless Claims 4-Week Avg. (previous: 787.75K)\n    - Natural Gas Storage (consensus: 37B, previous: 29B)\n    - Nonfarm Productivity (consensus: 5.6%, previous: 10.1%)\n    - Unit Labor Costs (consensus: -11.5%, previous: 9.0%)\n\n^^^^2020-11-04",
        "created_utc": 1604487616,
        "id": "gb3ss47",
        "permalink": "/r/RobinHood/comments/jnus2y/daily_discussion_thread_november_4th_2020/gb3ss47/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1604516416.0
    }
]