[
    {
        "author": "ButtScientist69",
        "body": "tbh RH's interface is dead simple to use. \"do you think this stock will go up or down?\" (it selects call/put for you based on your input).\n\nthey give you a free stock\n\nthere is confetti when you buy something.\n\nmost of these things are stupid gimmicks to the experienced investor, but they have their shit together in marketing department. it's similar to how apple made the first smartphone, even though windows made one 10 years earlier. RH is apple for stocks.\n\nOther brokerages could take a hint from RH. ToS Desktop is advanced but it's very confusing, and half the stuff doesn't even work right. I still haven't found a trading app I love (RH is *too* simple - not enough features). Fidelity active trader is great but there are a few things missing. Fidelity's mobile app is garbage bc you can't do anything beyond a very basic trade. TOS mobile is pretty good, but buggy and more confusing than it needs to be. I'm still looking for a good broker that doesn't have huge commissions and has a great app.\n\n Also, RH obviously sucks for their compliance department (unlimited leverage feature) and reliability issues, but I don't think first time investors care about that.",
        "created_utc": 1587025925,
        "id": "fnkg9wa",
        "score": 56,
        "subreddit": "investing",
        "created": 1587054725.0
    },
    {
        "author": "burlapballsack",
        "body": "Hello, my name is Ernie and my grandson (William) sent me to this website.  He said it was a good place for help with the stock market.\n\nI called my broker this morning because John who plays dominoes at the VFW told me that Boeing (the airplane company) and Disney (they have amusement parks) were trading very low and it would be a great time to buy!  It sounds crazy I know, William says buying stocks is called a \"YOLO\" (Bing says this means \"you only live once\" L-O-L!)\n\nMy stock broker (James at Fidelity at the Oklahoma City location, off of 4th St. near the new McDonalds) said that I had to update my \"account security questions\" and I dont know what that meant.  I am going to fax him some questions to use like \"What is my favorite hole at the City Club\".  But then James said I had to log into the \"web portal\" to change it.\n\nSince my grandson (William) said this was a good place for finance advice could anyone help me understand how to log in to the \"web portal\"?  \n\n\nEdit:  I will be speaking with William's mother and making sure he does not continue viewing this discussion web site, it is very crass with some foul language and people do not seem very helpful",
        "created_utc": 1586966697,
        "id": "fnhppkh",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1586995497.0
    },
    {
        "author": "greenglasspoor",
        "body": "Everyone is commission free now. Go to schwab or fidelity",
        "created_utc": 1585787554,
        "id": "fm66vkb",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1585816354.0
    },
    {
        "author": "BilldaCat10",
        "body": "lol fidelity warning me about the stock/calls I have in BA:\n\n\"Your portfolio has a significant concentration\"\n\nconcentrate on deez nuts",
        "created_utc": 1587165318,
        "id": "fnqik7k",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1587194118.0
    },
    {
        "author": "txholdem",
        "body": "i put $10k in a fidelity IRA, traded options for 3 months, one day i was unable to place an order, fidelity told me they wouln't let me trade options anymore because i turned 10k into 1.7k.\n\ni then bot mu stocks and when i checked 2 years later, the fucking balance didnt not change at all.\n\n2 months ago, i decided to do something. i sold MU, bought SLV. 1 week later, i sold for a 20% loss. i sold and bot OPK. i sold for 40% loss. i bot SPXS, sold for 15% loss. then i bot MFA, 2 days later, i sold for 25% loss.\n\nnow i have $475 left.\n\nbut who gives a fuck. i put $100 in RH last May, and i will have $4M in a few months.",
        "created_utc": 1586826042,
        "id": "fnc0hcz",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1586854842.0
    },
    {
        "author": "vinniedamac",
        "body": "You've inspired me. Now how do i turn on Options trading on Fidelity?",
        "created_utc": 1586960834,
        "id": "fnheg4k",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1586989634.0
    },
    {
        "author": "HinduHamma",
        "body": "This is worse than robinhood. Why do people use ally invest \n\nSource : I used ally invest. They issued me a margin call last month. I do not even have a margin account. I have since quit and moved to fidelity lol",
        "created_utc": 1586957338,
        "id": "fnh8h1w",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1586986138.0
    },
    {
        "author": "Jay87540",
        "body": "I use Fidelity, very happy with it.",
        "created_utc": 1586215911,
        "id": "fmn0xpx",
        "score": 11,
        "subreddit": "investing",
        "created": 1586244711.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "thats fidelity...",
        "created_utc": 1586962447,
        "id": "fnhhekq",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1586991247.0
    },
    {
        "author": "its_me_poida",
        "body": "While I have capitulated my Robinhood account (my favourite account for indulging bearish tendencies), I have a large 6 figure Fidelity account where I do boring theta stuff .. when SPY nears 300 I'm going to start accumulating November SPY 220 Put calendar spreads timed for the election - they are only $140 per contract if forward month is October - if this long bet pays off I'm going to post here.",
        "created_utc": 1588207916,
        "id": "fp0evnh",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588236716.0
    },
    {
        "author": "Sirspender",
        "body": "Buy fractional shares\n\nAlso, maybe buy tech etf. AMZN will be a large chunk of an etf that has Amazon. AMZN is 8% or the ONEQ sector etf by Fidelity.\n\n&amp;#x200B;\n\nEdited: i previous said buy any tech etf. A lot of tech etfs won't have AMZN because its Consumer Discretionary.",
        "created_utc": 1586804095,
        "id": "fnaulec",
        "score": 9,
        "subreddit": "investing",
        "created": 1586832895.0
    },
    {
        "author": "BeckywiththeDDs",
        "body": "Fidelity will cover the $75 automatically when they pull in your equities. Do it.",
        "created_utc": 1586911815,
        "id": "fnfnvd0",
        "score": 9,
        "subreddit": "StockMarket",
        "created": 1586940615.0
    },
    {
        "author": "astafe",
        "body": "Bois my 401was down like 33% one time , never managed it , but now it only down 10%  so I’m think off call fidelity and telling them to sell it . so that I can get a better entry when ever we have another leg down",
        "created_utc": 1586571544,
        "id": "fn1w56x",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1586600344.0
    },
    {
        "author": "grundle_mcphereson",
        "body": "To be fair you asked for a financial advisor not a fiduciary. \n\nMost financial advisors are similar to multi level marketing gigs selling pre defined funds based on what corporate tells them to.\n\nIf you want low maintenance put it in a vanguard or fidelity low cost index fund and contribute regularly and don’t pay a financial advisor",
        "created_utc": 1588020844,
        "id": "foryq49",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1588049644.0
    },
    {
        "author": "murakamidiver",
        "body": "Movies theaters are like record players. Much higher fidelity than streaming. There will always be a niche for them.",
        "created_utc": 1585854139,
        "id": "fm8qie6",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1585882939.0
    },
    {
        "author": "hhh888hhhh",
        "body": "This email is making me want to transfer all my funds to Fidelity.",
        "created_utc": 1587520343,
        "id": "fo59cd7",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1587549143.0
    },
    {
        "author": "thefoodiedentist",
        "body": "I wouldn’t, fidelity has 24/7 support line that’s very helpful and can advise you on investments.  Also their processing time is much quicker than robinhood.  Takes forever to transfer money into bank on robinhood whereas its 1 day for fidelity.\n\nTheir app takes getting used to.  It’s much more advanced and knowledge is much more comprehensive than robinhood.\n\nJust give them a call if you are confused about something, like never a wait time.\n\nAnother big advantage over robinhood is their afterhour and premarket hours are longer than robinhood, Webull has full premarket hour.\n\nPs I use fidelity and Webull (starts at 4am)",
        "created_utc": 1587034643,
        "id": "fnko9pd",
        "score": 8,
        "subreddit": "investing",
        "created": 1587063443.0
    },
    {
        "author": "nopal_blanco",
        "body": "Bought into VISL because fidelity said DFLYF has exchange fees due to it being Canadian?",
        "created_utc": 1587670954,
        "id": "focg7kn",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1587699754.0
    },
    {
        "author": "kodbell",
        "body": "Nope, all autistic trading in fidelity ROTH IRA :)",
        "created_utc": 1586884543,
        "id": "fne7r51",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1586913343.0
    },
    {
        "author": "LaurenCosmic",
        "body": "Fidelity allows after hours (and I believe pre market as well). You just have to get it enabled by basically agreeing that you know the risk (potentially wide bid/ask spreads and partial order fulfillment).",
        "created_utc": 1587080430,
        "id": "fnmy3pm",
        "score": 7,
        "subreddit": "investing",
        "created": 1587109230.0
    },
    {
        "author": "2020vw69",
        "body": "Fidelity was $4.95 until sometime last year. That’s a lot of money gone. RH was absolutely the reason they’re free now.",
        "created_utc": 1587039916,
        "id": "fnku13l",
        "score": 7,
        "subreddit": "investing",
        "created": 1587068716.0
    },
    {
        "author": "MaRrDuKzAyA",
        "body": "Robinhood isn’t the best for penny stocks. You can make a fidelity account, load funds, and purchase shares all within about 10 minutes. Highly recommend it. That it Schwab. Both have almost no fees.",
        "created_utc": 1587662829,
        "id": "fobrbwp",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1587691629.0
    },
    {
        "author": "HotStockSlinger",
        "body": "It is true retard, Fidelity did that today",
        "created_utc": 1585764639,
        "id": "fm51lbv",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1585793439.0
    },
    {
        "author": "Tylerturden2",
        "body": "I’m someone using Robinhood at the moment, probably getting ready to transfer over to Fidelity. Can anyone explain to me what would happen if Robinhood were to go bankrupt? Surely you don’t lose your stocks, but could you lose your cash holdings or any other financial losses, outside of having to transfer your holding and/or missing an opportunity to trade?",
        "created_utc": 1587035681,
        "id": "fnkp9v9",
        "score": 6,
        "subreddit": "investing",
        "created": 1587064481.0
    },
    {
        "author": "veryfloppydisk",
        "body": "Jan 2022 Fidelity 2050 Target Date Retirement Fund",
        "created_utc": 1586408729,
        "id": "fmv87la",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1586437529.0
    },
    {
        "author": "ThatOneDrunkUncle",
        "body": "This is crazy. TDA and Fidelity can't even keep up with these swings. May have to switch to robinhood",
        "created_utc": 1586287960,
        "id": "fmpv8sa",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1586316760.0
    },
    {
        "author": "netBlu",
        "body": "[Jack off on trains or ban](https://i.imgur.com/p6hqn5H_d.webp?maxwidth=640&amp;shape=thumb&amp;fidelity=medium)",
        "created_utc": 1587500385,
        "id": "fo4995h",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587529185.0
    },
    {
        "author": "theclj1992",
        "body": "So Fidelity hit my with the 90 day restriction last month for PDT. Oh well, I shifted all my money back to Robinhood. Linked my Fidelity saving to the RH account and been transferring every direct deposit instantly out ever since. Today I noticed they emailed saying my restrictions have been lifted lol. After less than 30 days?? I didn't think they could do that, anybody else ever escape the 90 days?",
        "created_utc": 1588192596,
        "id": "fozld71",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588221396.0
    },
    {
        "author": "Coconutfanatic",
        "body": "Fidelity does this/organizes ur watch list by movement % but their UI is rather horrendous",
        "created_utc": 1586403635,
        "id": "fmv1b6n",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1586432435.0
    },
    {
        "author": "gypsyphotos",
        "body": "Little guys like Robinhood and Square. They were stealing customers. Now that the big brokers changed there is no use for the little guys. I’d rather have my money in Fidelity than RH as you saw by what happened on March 2 &amp; 3.",
        "created_utc": 1586477397,
        "id": "fmy3m5s",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1586506197.0
    },
    {
        "author": "Cruian",
        "body": "Fewer can be just as effective as many, it just depends on which indices you're looking at. One popular investing strategy is a 3 fund portfolio: a US total market index fund + an international market fund + a bond fund gives excellent diversification. Ratios can be adjusted as you desire. [https://www.bogleheads.org/wiki/Three-fund\\_portfolio](https://www.bogleheads.org/wiki/Three-fund_portfolio) It can be simplified into 2 funds if you use VT or VTWAX + a bond fund, or expanded by adding an international bond fund. It can be used as the core of your portfolio and added to if you wish, such as many people adding extra REITs. Edit: Internally, target date index funds either use or effectively use a 3 fund portfolio (Fidelity's is until closer to retirement where I think they also start adding in TIPS, Vanguard's is a 3 fund + international bonds then adds TIPS as well I believe, Schwab's is several of their ETFs that combined would come out to a 3 fund + REITs early on).\n\n&amp;#x200B;\n\nIf this is outside an employer plan, you do not want to use any mutual funds from a company other than your brokerage (so don't use VTSAX at Fidelity or FTIHX at Vanguard) as you'll be hit with a commission (commission free doesn't apply to mutual funds from other companies). Using ETFs would be fine.\n\n&amp;#x200B;\n\nUsing similar index funds from different companies would do nothing for diversification. So VTSAX (or VTI) + FSKAX is pointless  from a diversification standpoint. You also generally don't want to use a US total market fund + an S&amp;P 500 fund, as by weight roughly 80% of the total market fund would be the S&amp;P 500.\n\n&amp;#x200B;\n\nThere are also multiple definitions of DCA, one of which is \"investing regular amounts over time\" (so investing money from each paycheck would count) and the other is specifically talking about only splitting up money you already have on hand (so investing as you earn wouldn't). Investing as you have the money available to do so is best 66% of the time, DCA as in the first definition would usually not be ideal.",
        "created_utc": 1586831300,
        "id": "fnc94lc",
        "score": 5,
        "subreddit": "investing",
        "created": 1586860100.0
    },
    {
        "author": "Alarmed-Isopod",
        "body": "[Investors when a company releases earnings](https://i.imgur.com/NLDugGD_d.jpg?maxwidth=640&amp;shape=thumb&amp;fidelity=medium)",
        "created_utc": 1588277358,
        "id": "fp3de4e",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588306158.0
    },
    {
        "author": "-LiveFreeOrDie",
        "body": "Literally did the same with my fidelity! 😂",
        "created_utc": 1587509677,
        "id": "fo4r96i",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587538477.0
    },
    {
        "author": "Brandon4454",
        "body": "Just buy into a total market index fund at either fidelity, Schwab, or vanguard.",
        "created_utc": 1587171293,
        "id": "fnqsjmc",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1587200093.0
    },
    {
        "author": "g0rd0n_freeman",
        "body": "Why is it that every bear market brings out so many first time traders and autists who tend to disappear in bull markets?  Shouldn't it be the opposite...I mean c'mon practice in a bull market before stepping into the bear market?  Why so many ads for TD Ameritrade, Robinhood, Fidelity, etc. nowadays? Why this trial by fire?",
        "created_utc": 1586992598,
        "id": "fnj5yj0",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1587021398.0
    },
    {
        "author": "Hollisb1001",
        "body": "VOO and SPY are of course very low expense ETFs that track the S&amp;P 500. Great choices. But since OP is in Fidelity, might as well use FZROX since it is a mutual fund with even lower expenses. FREE.",
        "created_utc": 1587028721,
        "id": "fnkiv4l",
        "score": 5,
        "subreddit": "stocks",
        "created": 1587057521.0
    },
    {
        "author": "Serath4",
        "body": "Fidelity won’t let me short SPY. Says there are no shares left to lend lmao. This market is a joke.",
        "created_utc": 1588186920,
        "id": "foz9hml",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1588215720.0
    },
    {
        "author": "Nuggyunlimited",
        "body": "I just got approved for Webull have a cash account for unilimited day trades. They give you a free stock for signing up, one for depositing $100, and three when you refer your first person. You get two for everyone else you refer. Let me know if you want a link or you can just download it and sign up. I like all of the data they provide it can be a little overwhelming at first but useful once you get the hang of it.\n\nEdit: they have a desktop app as well that they advertise useful for day trading. I would also recommend fidelity but I have a margin account with them have the same day trade limit but I like their active trader pro platform. I keep that open with Robinhood to track live stocks and not fall for Robinhood’s delay. They live data is pretty close to webull so you can’t go wrong with either imo.",
        "created_utc": 1586791777,
        "id": "fna66ex",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1586820577.0
    },
    {
        "author": "Fujit0ra",
        "body": "What y’all holding? Bought a few twitter puts towards the end of Friday. \n\n\nhttps://i.imgur.com/cu1Xmjj_d.jpg?maxwidth=640&amp;shape=thumb&amp;fidelity=medium",
        "created_utc": 1587329650,
        "id": "fnx1j12",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587358450.0
    },
    {
        "author": "your_mom_loves_me69",
        "body": "Fidelity active trader pro actually kinda fire",
        "created_utc": 1588088319,
        "id": "foupo41",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1588117119.0
    },
    {
        "author": "MrMaaky",
        "body": "Here's the article on Fidelity shutting money market funds to NEW investors to protect current ones. \n\n[https://finance.yahoo.com/news/fidelity-shuts-three-money-market-205320236.html](https://finance.yahoo.com/news/fidelity-shuts-three-money-market-205320236.html)",
        "created_utc": 1585763281,
        "id": "fm4yxub",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585792081.0
    },
    {
        "author": "shamusotool",
        "body": " Fidelity is pleased to make this trade commission-free! All online buy to close option orders executed at $0.10 or less are now commission-free.",
        "created_utc": 1585763940,
        "id": "fm50a7y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585792740.0
    },
    {
        "author": "Cumberland114",
        "body": "I didn’t screenshot the message that populated- but it indicated that it would not process the transaction and to call fidelity. Others on the yahoo finance ostk convo thread confirmed it happened to them and that they’re suspending purchases until after April 27th “so they don’t have to deal with it” referring to the dividend",
        "created_utc": 1587501452,
        "id": "fo4bg1x",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587530252.0
    },
    {
        "author": "gman00910",
        "body": "Does anyone just trade with their IRA with fidelity? Or should I keep Fidelity for my 401k and stocks, and use TOS for trading? Any recommendation?",
        "created_utc": 1586921008,
        "id": "fng2u3m",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586949808.0
    },
    {
        "author": "gman00910",
        "body": "Coming from a newb who just researched this:\n\nE*TRADE for company stock plan,\nFidelity for 401k and IRA,\nRH bc of the free commission,\nTradingView for charts\n\nNote: Fidelity has really good news/info on their app. So gonna try to use that more",
        "created_utc": 1586929676,
        "id": "fngedv0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586958476.0
    },
    {
        "author": "KimJongUnsTrousers",
        "body": "Fidelity closed 3 money market funds to investors. Liquidity getting bad. Bankruptcy risk skyrocketing",
        "created_utc": 1585765253,
        "id": "fm52qog",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585794053.0
    },
    {
        "author": "Noexit007",
        "body": "While TD Ameritrade charges, they also have a MUCH better platform to trade on AND ThinkorSwim which is by far the best software.\n\nI agree if you are trading in tiny amounts Fidelity is the way to go, but I still wouldn't shoot down TDA.",
        "created_utc": 1587684395,
        "id": "fodgi7r",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1587713195.0
    },
    {
        "author": "greentea45",
        "body": "Thanks. Fidelity. The app sucks, but my IRAs and 401K are there",
        "created_utc": 1586450400,
        "id": "fmwou6r",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1586479200.0
    },
    {
        "author": "ThatOneDrunkUncle",
        "body": "My mom, who is the CEO of Fidelity (hard to believe, I know), said their mutual funds are selling ALL of their stocks tomorrow. Plan accordingly",
        "created_utc": 1587018814,
        "id": "fnk94om",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1587047614.0
    },
    {
        "author": "FOMOhomo",
        "body": "Never, because I will just delete the Fidelity app.",
        "created_utc": 1585755991,
        "id": "fm4ksn3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585784791.0
    },
    {
        "author": "ducatista9",
        "body": "At any broker.  TD Ameritrade, etrade, fidelity, schwab, etc.",
        "created_utc": 1586934021,
        "id": "fngja9v",
        "score": 3,
        "subreddit": "investing",
        "created": 1586962821.0
    },
    {
        "author": "AussieFIdoc",
        "body": "Experience today’s biggest blockbusters like never before with the visual fidelity of real-time ray tracing and the ultimate performance of AI and programmable shading. RTX. It’s On.\n\nRay tracing is the holy grail of gaming graphics, simulating the physical behavior of light to bring real-time, cinematic-quality rendering to even the most visually intense games. Preorder your NVIDIA GeForce RTX 2080 now!",
        "created_utc": 1586218219,
        "id": "fmn4t9y",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1586247019.0
    },
    {
        "author": "kalel1500",
        "body": "I use Fidelity for OTC stocks",
        "created_utc": 1587513367,
        "id": "fo4xvdu",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1587542167.0
    },
    {
        "author": "MaRrDuKzAyA",
        "body": "fidelity gives you instant funds when you deposit. I would just make an account with them. That’s what I did and i got in at .23",
        "created_utc": 1587578016,
        "id": "fo7gntq",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1587606816.0
    },
    {
        "author": "School_IT_Hero",
        "body": "I used TD ameritrade just because i love their ThinkorSwim trading platform. But, keep in mind that they do charge a 6.95 commission fee for OTC stocks.   \n\n\nBrokers that offer commission free OTC trading is Charles Schwab and Fidelity",
        "created_utc": 1587588927,
        "id": "fo82uz7",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1587617727.0
    },
    {
        "author": "Cruian",
        "body": "At Fidelity all I had to do was click a link in the mobile app and maybe agree to some additional terms. Fidelity started their rollout in early February, so it might be widely available to anyone at this point (as long as you have an app version new enough to support it).",
        "created_utc": 1587520404,
        "id": "fo59fre",
        "score": 3,
        "subreddit": "investing",
        "created": 1587549204.0
    },
    {
        "author": "Groovytime2",
        "body": "Same fidelity fir the win",
        "created_utc": 1587506566,
        "id": "fo4lgr5",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1587535366.0
    },
    {
        "author": "Uizdum",
        "body": "Is there a reason for such a variety? Why are you quitting Fidelity? What makes Tastyworks better for option trading?",
        "created_utc": 1587176070,
        "id": "fnr02hk",
        "score": 3,
        "subreddit": "investing",
        "created": 1587204870.0
    },
    {
        "author": "2020vw69",
        "body": "You’ll love fidelity. No confetti though.",
        "created_utc": 1587039754,
        "id": "fnkttqk",
        "score": 3,
        "subreddit": "investing",
        "created": 1587068554.0
    },
    {
        "author": "vaish1992",
        "body": "https://imgur.com/a/sNoDT4j Fidelity knows what i like..puppies and gambling.",
        "created_utc": 1587067053,
        "id": "fnm8qs8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587095853.0
    },
    {
        "author": "ScratchyCow",
        "body": "\"I'm a gay bear\" \n\nLol what the FUCK this is a real ad on Snapchat\n\nhttps://i.imgur.com/bK4to4V_d.webp?maxwidth=640&amp;shape=thumb&amp;fidelity=medium",
        "created_utc": 1587046879,
        "id": "fnl4lzn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587075679.0
    },
    {
        "author": "Cruian",
        "body": "&gt;and free trades on iShares funds.\n\nThis now applies to basically all US listed ETFs, not just iShares (happened same time they went free trades on US listed stocks). I've been buying a Vanguard one in a Fidelity account with no commission.",
        "created_utc": 1586800990,
        "id": "fnaoeh5",
        "score": 3,
        "subreddit": "investing",
        "created": 1586829790.0
    },
    {
        "author": "Robluntski",
        "body": "Yeah, but what do you say about all these platforms that are offering the opportunity to buy partial shares now? I heard the CEO of Robinhood talking to Cramer about how they were launching that soon a couple weeks ago. I just logged into my Fidelity account this morning and they have a button to buy partial shares as well now. Actually it could have been my TD Ameritrade, but it was one of those two 😂\n\nEssentially the same difference as what you're talking about. You'd have the opportunity to invest still.",
        "created_utc": 1588282329,
        "id": "fp3navt",
        "score": 3,
        "subreddit": "stocks",
        "created": 1588311129.0
    },
    {
        "author": "Bkeller8345",
        "body": "Robinhood is great for beginners to learn with. However during the first downturn there was such a high volume of users that Robinhood can’t support so their service crashed and no one was able to buy or sell stocks. That’s a big deal when everything is tanking and you can’t close positions and move to cash. \n\nI’ve since moved everything to Fidelity since they have zero commission on stocks and allow fractional shares. Best choice in my opinion.",
        "created_utc": 1588021240,
        "id": "forzia1",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1588050040.0
    },
    {
        "author": "PlaxicosCellMate",
        "body": "I have Fidelity and so far I’ve been really happy. I started stocks about a month ago. Fidelity is super easy to figure out and has no fees.",
        "created_utc": 1587792538,
        "id": "foip13f",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1587821338.0
    },
    {
        "author": "punkprince182",
        "body": "Fidelity or TDAmeritrade",
        "created_utc": 1585782178,
        "id": "fm5xutb",
        "score": 3,
        "subreddit": "stocks",
        "created": 1585810978.0
    },
    {
        "author": "Raiddinn1",
        "body": "I will use Fidelity as an example of a company you might be referring to.\n\nThey have free trades on equities and free trades on their own funds and free trades on iShares funds.\n\nThose funds include FZROX which has 0% fees ever.\n\nThus you can buy the funds for free and then not get any fees while you hold the funds and then not pay any fees when you sell the funds.\n\nWhy would Fidelity offer this?\n\nFirstly, the Fidelity company has an arm that deals in \"paid advisory services\".  Fidelity will probably try to upsell you on that if they think you are in the right place for it.\n\nIf you are already a Fidelity customer, and you either decide you want paid services on your own OR they convince you that you need paid services, then you are more likely to choose Fidelity to provide those paid services.\n\nIf they can get some people upsold on those services, then the free trades already paid for themselves.\n\nAlso, it is important to note here that what constitutes a trade for you may not necessarily constitute a trade for Fidelity.\n\nIf you sell 100x FZROX and some other Fidelity customer buys 100x FZROX, then Fidelity doesn't have to hit the trading floor for anything.  They can just shift around some 1s and 0s administratively.  That saves them a lot of money.  They have millions of customers buying/selling and they can just shift numbers around so that they have to spend a lot less time on the NYSE (or whatever) trading floor.\n\nSecondly, Fidelity members often have large amounts sitting in cash in their accounts.  Depending on what you choose to do with that money, Fidelity might be able to borrow that money from you and pay you flat interest on it.  If they can use that money profitably, they come out ahead.  That can offset fees that they have to pay to trade (on NYSE or whatever) or pay their staff.\n\nThirdly, Fidelity can play similar games to #2 but with investments.  To some extent they can buy/short with your assets as long as it doesn't result in you losing any money.  This doesn't cost you anything, but it's potentially a source of income for Fidelity.  To the extent that they can play these games between 2x of their own customers, they can do it internally similar to #1.\n\nFourthly, Fidelity has costs that don't necessarily scale with the size of their business.  The cost to put a guy on the NYSE floor is the same regardless if Fidelity has one customer or a million.  If Fidelity can grow their asset base faster than they can grow their expenses, they will get more economies of scale and that helps them reduce relative costs.\n\nFifthly, Fidelity is privately owned and they can do whatever they feel like, even if it isn't profitable.  If their activities are a loss to the owners in the short term and the owners don't care, then /shrug.\n\nSixthly, Fidelity may be playing a long game here.  If they can squeeze some competitors out of the market by pricing things below cost, they may hope to make that back up later after some competitors are put out of business.  This would be anti-competitive, but they may try to do it anyway.\n\nThe answer you want is a combination of all of the above.",
        "created_utc": 1586797383,
        "id": "fnah2ht",
        "score": 3,
        "subreddit": "investing",
        "created": 1586826183.0
    },
    {
        "author": "sohaib3",
        "body": "If you don’t mind can you send me a screenshot of your profits/risk? With a real life example\n\nI don’t own 100 shares of any company yet, in fact building my way up (hopefully), just wish I could money in my Roth - I hate tying up money for that long - it hurts my heart thinking about it lol. \n\nSo in my taxable account I’m interested in doing this but fidelity keeps on disapproving me for options but I’m loyal to them bc they have fractional shares.\n\nCan you actually show me an example on BAC? That and ally are two holdings I actually want to build up and sell calls on.\n\nThank you!",
        "created_utc": 1586214537,
        "id": "fmmyjum",
        "score": 3,
        "subreddit": "stocks",
        "created": 1586243337.0
    },
    {
        "author": "reddit01010101010101",
        "body": "I'd love to know if you have a good platform. I started out on TradeKing and enjoyed it, but that company was bought out. Yes, Robinhood has issues, but I do like their UI (somewhat). I've used Fidelity (sucks), and now You Invest (sucks). Please make me a recommendation.",
        "created_utc": 1586221328,
        "id": "fmn9xme",
        "score": 3,
        "subreddit": "investing",
        "created": 1586250128.0
    },
    {
        "author": "W3NTZ",
        "body": "True if you dive that deep but for this guy fidelity would have been loads better. Their customer service is top notch and they basically have 0 fees now on everything besides managed accounts.",
        "created_utc": 1586226637,
        "id": "fmni7f2",
        "score": 3,
        "subreddit": "investing",
        "created": 1586255437.0
    },
    {
        "author": "MaRrDuKzAyA",
        "body": "I was using robinhood until i was reading through the subs and came across DECN. Opened a fidelity account that second and got in on it. Making some good gains.. pretty happy about it 🐸",
        "created_utc": 1587602572,
        "id": "fo8rwlq",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1587631372.0
    },
    {
        "author": "bluto2003",
        "body": "Fidelity is an option",
        "created_utc": 1587585555,
        "id": "fo7w4b6",
        "score": 3,
        "subreddit": "stocks",
        "created": 1587614355.0
    },
    {
        "author": "akhtarst",
        "body": "2-7 days but Fidelity is super slow responding to requests right now.",
        "created_utc": 1587040752,
        "id": "fnkv4jf",
        "score": 3,
        "subreddit": "investing",
        "created": 1587069552.0
    },
    {
        "author": "HealthierOverseas",
        "body": "Hi folks, please don’t pillory me, I have read both this wiki and the r/pf one, as well as various other research articles. But my brain is fried with info-overload and I don’t trust it anymore.\n\nI am trying to open my first Roth-IRA (retirement purposes in 20-30yrs); I have $12k on hand to max out 2019 and 2020’s contributions, and I intend to max it out every year until I hit the AGI cap, which will probably be in about 5-10yrs depending on how my career goes (my field is extremely stable/secure, but not a lot of upward mobility). I make 100kish in the DC market. I currently have an emergency fund and I’m maxxing my 401k contributions.\n\nHow do I decide between choosing Vanguard, Schwab, or Fidelity for my Roth account? I use a credit union for banking, so that decision point is a non-factor. I only kinda understand why Vanguard is appealing, but I also want to make the choice that’s easily digestible for an investment newbie.\n\nWhen I search for people’s opinions here, there’s a lot of contrast that is informative but ultimately doesn’t sway my decision because I just don’t feel educated enough to understand the pros/cons of each service. What would you advise? Thanks for any replies.",
        "created_utc": 1586954485,
        "id": "fnh4b3b",
        "score": 3,
        "subreddit": "investing",
        "created": 1586983285.0
    },
    {
        "author": "ElitePhoenix-",
        "body": "I put 90% in FZROX and 10% in FZILX of my deposit, these are mutual funds (almost like ETFs) fidelity is great because these have 0 fees.",
        "created_utc": 1587002991,
        "id": "fnjnwzg",
        "score": 3,
        "subreddit": "stocks",
        "created": 1587031791.0
    },
    {
        "author": "4pooling",
        "body": "You can gain instant exposure to the entire world stock index and bond index with 2 funds: VT+BNDW if that's what you want. \n\nQuite simple to go with a discount brokerage and manage 1 or 2 funds yourself. You simply deploy and consistently add, never selling until you need cash for immediate expenses (but you should have plenty of cash for immediate expenses and emergencies). \n\nVanguard is only one example. There's Fidelity and Schwab too. Especially starting with a grand.",
        "created_utc": 1587770603,
        "id": "fohqc52",
        "score": 3,
        "subreddit": "investing",
        "created": 1587799403.0
    },
    {
        "author": "Cruian",
        "body": "Unless you have something like $100,000, I don't think you'd find a money market fund better than SPRXX. With money market funds, the 7-day yield already takes expense ratios into account.\n\n&amp;#x200B;\n\nFidelity offers 4 index mutual funds (US total market style, international, essentially S&amp;P 500, and extended market) with no expense ratio at all. Their other index mutual funds are also the lowest I've seen anywhere and that's including ETFs (examples: a more complete US total market of FSKAX at 0.015%, international FTIHX at 0.06%, and bonds FXNAX at 0.025%).",
        "created_utc": 1588045046,
        "id": "fot5f05",
        "score": 3,
        "subreddit": "investing",
        "created": 1588073846.0
    },
    {
        "author": "justusingredditUSA",
        "body": "Might give it a try, I have fidelity but damn it’s a weird app.",
        "created_utc": 1588218592,
        "id": "fp0wn2w",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1588247392.0
    },
    {
        "author": "chowfuntime",
        "body": "No fidelity won't allow naked options, at least for me. You'll need to sign a supplemental agreements just to trade spreads.",
        "created_utc": 1588285876,
        "id": "fp3u6pw",
        "score": 3,
        "subreddit": "options",
        "created": 1588314676.0
    },
    {
        "author": "hydrocyanide",
        "body": "You bought a Schwab mutual fund from a brokerage not named Schwab. Consider this an $18 lesson.\n\nIf you're going to buy mutual funds, either buy them from the source (i.e. buy a Schwab fund in a Schwab account) or make sure the fund is on the NTF (no transaction fee) list. TD will let you see which funds are NTF and which aren't. Schwab, Fidelity, Vanguard at a minimum are going to be transaction fee funds because those fund families have distribution of their own. PIMCO funds, for example, will be NTF because you can't open a PIMCO account -- all their distribution is through brokerages.\n\nOr buy ETFs.",
        "created_utc": 1588283201,
        "id": "fp3p0aj",
        "score": 3,
        "subreddit": "investing",
        "created": 1588312001.0
    },
    {
        "author": "sohaib3",
        "body": "Top 25% of Fidelity accounts are +11%\n\nI rank in the worst 10% of fidelity accounts lol - I’m talking taxable not even the GUH 401k’s😩",
        "created_utc": 1585938900,
        "id": "fmc4s84",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585967700.0
    },
    {
        "author": "ElizabethGreene",
        "body": "I'm going to sit on hold with Fidelity and ask them to exercise my Gap puts.\n\nI thought they were ex-div tomorrow and bought the wrong week.  By sheer dumb luck I broke even.",
        "created_utc": 1585786763,
        "id": "fm65ky7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585815563.0
    },
    {
        "author": "the_welfare_store",
        "body": "I did and put it in my Fidelity account for that Boomer Style 2% on 100K+ interest. Now I have 2K in Robinhood and I am going to go for another 100K with weeklies.",
        "created_utc": 1585795963,
        "id": "fm6k7mg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585824763.0
    },
    {
        "author": "yuutt66",
        "body": "Don’t use Acorns. Last I remember their fee is $1 per month which is really expensive for a small account. Use a full service broker such as fidelity and buy their target retirement fund or an S&amp;P 500 fund/ETF. Most brokers no longer charge fees to trade ETFs and Stocks and you can also buy fractional shares. Full service brokers are 100% better than Robinhood or Acorns.",
        "created_utc": 1587416799,
        "id": "fo0ofm5",
        "score": 3,
        "subreddit": "investing",
        "created": 1587445599.0
    },
    {
        "author": "areychaltahai",
        "body": "Get Fidelity. No regrets so far.",
        "created_utc": 1587586926,
        "id": "fo7yw4t",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1587615726.0
    },
    {
        "author": "School_IT_Hero",
        "body": "Lmao both webull and RH don't support OTC stocks. time to get a big boy broker!!\n\nI used TD ameritrade just because i love their ThinkorSwim trading platform. But, keep in mind that they do charge a 6.95 commission fee for OTC stocks.\n\nBrokers that offer commission free OTC trading is Charles Schwab and Fidelity",
        "created_utc": 1587589826,
        "id": "fo84nmn",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1587618626.0
    },
    {
        "author": "cmmckechnie",
        "body": "I’ve used both TD and Fidelity and prefer TD Ameritrade but i like both.\n\nRobinhood sucks.",
        "created_utc": 1587590984,
        "id": "fo86wtd",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1587619784.0
    },
    {
        "author": "BohemianAddict",
        "body": "RH to me is just a toy I use to play with small amount of money. And for that it’s not bad. \n\nPrimary is Fidelity and secondary is Morgan Stanley (which also sucks). So I’m thinking Fidelity +TDA going forward.",
        "created_utc": 1587675866,
        "id": "focu13g",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1587704666.0
    },
    {
        "author": "DumpCake42",
        "body": "With most \"real\" brokerage accounts. Not sure what country you're in but I know you can purchase through Fidelity in the U.S.",
        "created_utc": 1587766058,
        "id": "fohhh3n",
        "score": 3,
        "subreddit": "shroomstocks",
        "created": 1587794858.0
    },
    {
        "author": "2020vw69",
        "body": "My banks app has real money. My fidelity app, just numbers on a screen I’m trying to get up!",
        "created_utc": 1587781703,
        "id": "foi9qg0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587810503.0
    },
    {
        "author": "575MV12",
        "body": "Fidelity doesn’t charge commission fees on penny-stocks (also known as OTC)",
        "created_utc": 1587792004,
        "id": "foioe1g",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1587820804.0
    },
    {
        "author": "ukfan758",
        "body": "Fidelity Active trader Pro has a section showing the biggest options plays of the day for each stonk and ETF, updated in real time.",
        "created_utc": 1587169239,
        "id": "fnqp97u",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1587198039.0
    },
    {
        "author": "gypsyphotos",
        "body": "If all those positions are currently settled you may sell them and rebuy instantly. I can do this with Fidelity with no violation and it’s not a margin account.",
        "created_utc": 1586791435,
        "id": "fna5ji4",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1586820235.0
    },
    {
        "author": "DangerousThanks",
        "body": "I’m seriously considering it myself. On top of all the outages the subreddit for RH isn’t very helpful at all. Now that I know Fidelity will cover the transfer fee it’s looking more attractive.",
        "created_utc": 1586912456,
        "id": "fnfozgm",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1586941256.0
    },
    {
        "author": "captain_stoobie",
        "body": "I’ll share my own experience.  I opened a Fidelity Roth IRA when I was about your age, and I’m 42 now.  It’s probably the best investment in my future I’ve ever made.  My only regret is not maxing it out every year, however a lot of life events have happened between then and now.  I split my contributions in to small cap, mid cap, and select heath care mutual funds.  They’ve all done decent, select health care has been the best performer.  \n\nCongrats for being ahead of the curve, future self will thank current self.",
        "created_utc": 1587003348,
        "id": "fnjohb5",
        "score": 3,
        "subreddit": "stocks",
        "created": 1587032148.0
    },
    {
        "author": "Cruian",
        "body": "In the US, almost all brokerages offer free trades on ETFs right now. They also usually offer free trades on their own mutual funds.\n\nFidelity, Schwab, or Vanguard are 3 great brokerages that can let you do self discussed investing at no account costs, only whatever the expense ratio of the fund(s) you use are.",
        "created_utc": 1586936629,
        "id": "fngm0ab",
        "score": 3,
        "subreddit": "investing",
        "created": 1586965429.0
    },
    {
        "author": "Jay87540",
        "body": "Fidelity",
        "created_utc": 1587011661,
        "id": "fnk0ow0",
        "score": 3,
        "subreddit": "stocks",
        "created": 1587040461.0
    },
    {
        "author": "ftstacks",
        "body": "I use Fidelity for fractional shares and so far I’ve loved it.",
        "created_utc": 1586977863,
        "id": "fnicvui",
        "score": 3,
        "subreddit": "stocks",
        "created": 1587006663.0
    },
    {
        "author": "zeppo_shemp",
        "body": "read books. a good book can go into far more detail than the best online resources. a few I've particularly enjoyed, with some rambling commentary because I'm stuck at home: \n\n- The Intelligent Investor by Benjamin Graham. somewhat dated but historically important and still has good advice. Graham pioneered value investing, a strategy of buying stocks that are on sale or priced low relative to an analysis of the company's 'fundamentals': income, earnings, profits, and 'book value' (the total of all assets minus all debts if everything was sold). historically and over long periods, value investing has tended to out perform every other strategy. \n\n- The Superinvestors of Graham and Doddsville, a 1984 article about value investing by Warren Buffett. he was one of Graham's students and is probably the most famous and successful investor of modern times. https://www8.gsb.columbia.edu/articles/columbia-business/superinvestors  Buffett's letters to investors in his company Berkshire-Hathaway are also worth reading. https://berkshirehathaway.com/reports.html\n\n- All of Peter Lynch's books: One Up on Wall Street, Beating the Street; Learn to Earn is aimed at teenagers and has simplified versions of the same data. Lynch was one of the most successful investors in history while managing the Magellan Fund at Fidelity. Lynch's books are also somewhat dated, such as due to the internet it's a lot easier to find info vs. in the 1990s when Lynch wrote and you had to read the Value Line newsletter for in-depth stock/company info. But a lot of what Lynch says is still relevant today. **Especially**: don't chase trends or the hot new startups particularly in IT/computers or biotech (re-reading these books recently it was as if he was describing all the hot new cannabis companies). Instead the best investments are usually boring, established, well-managed, low-debt companies with moderate growth (too-fast growth is a red flag) and an advantage or niche to ward off competition. most of his best picks were not exciting or glamorous companies: Taco Bell, Dunkin Donuts, Wal Mart, La Quinta hotels, various well-managed Savings &amp; Loan associations or railroad lines, and Crown Cork and Seal which makes bottle caps and beverage containers ... all boring established companies with a niche. e.g., Taco Bell was the first Mexican fast food chain when American was dominated by burger joints, railroads have a sort of built-in regional monoploy and even today can be insanely profitable, La Quinta was the first mid-price hotel chain when there was a gap between luxury Hiltons &amp; ultra-cheap Motel 6. Lynch says you want to invest in a company that an idiot could manage, because eventually an idiot with an MBA will be managing it. Lynch says there's a place for amateur stock picking, citing an amateur group that beat the markets 60-70% of the time IIRC, but he advises a very small portfolio of at least 5 and no more than 10-12 stocks. With 5 well-selected stocks he says you'll usually get 1 underperformer and 1 out-performer with the rest performing well but not spectularly. But the hobbist simply doesn't have the time for a detailed analysis/comparison of more than ~10 stocks. \n\n- Big Money Thinks Small by Joel Tillinghast. He worked with Lynch at Fidelity and manages the Low Price Stock Fund which specializes in small and mid size company value stocks. (interesting tidbit: Tillinghast writes how back in the day the economist John Maynard Keynes failed misterably as an investor when he tried to predict large market trands, but started beating the UK market when he turned to what people today would described as small and mid cap value investing). Tillinghast's fund had a rough few years recently (he tends to underperform in the final years of bear markets) but the fund has a history of out-performing the market. \n\n- Margin of Safety by Seth Klarman, a hedge fund manager and value investor who has a history of out-performance. this is out of print and absurdly expensive, but PDF scans are easy to find online. https://www.valueplays.net/wp-content/uploads/Margin.of.Safety.by.Seth.Klarman.1991.FullScan.pdf\n\n- Lessons from the Greatest Stock Traders of All Time by John Boik. profiles of a dozen prominent successful stock traders from throughout the 20th Century.\n\n- Ken Fisher has written some good stuff, his The Little Book of Market Myths is free online  https://www.kenfisher.com/books/little-book-market-myths\n\n- Reminiscenses of a Stock Operator, by Edwin Lefevre. partly of historical interest about the early days of Wall Street before the 1929 crash, but it's very readable and has some practical insights into the mindset or psychology of investors, such as the risk of making decisions based on hot tips. http://www.gutenberg.org/ebooks/60979\n\n- John Bogle's  Little Book of Common Sense Investing Advice and Bogle on Investing. He didn't invent index funds, buthe did popularize them for the everyday investor via Vanguard and was a very influential guy who based histheories on the Efficent Market Hypothesis (EMH, the idea that assets are priced accurately by the collective decisions of all investors in the market, so there's no use trying to beat the market over the long term). See also the Boggleheads Guide to Investing by some of Bogle's most prominent followers.\n\n- Random Walk Down Wall Street by Burton Malkiel a Princeton professor. presents the Random Walk Hypothesis that says stock prices move in an unpredicatble or random manner so you should just buy low-cost index funds rather than anything that's trying to beat the market averages. \n\n- When Genius Failed by Roger Lowenstein. About the collapse of a hedge fund with Nobel Prize winners and other assorted smart guys on staff. a good study of hubris, failing to consider risks, and the dangers of leverage. \n\n- What I Learned Losing a Million Dollars by Jim Paul. About an investor who well, lost a bit more than a million bucks via futures trading. Another cautionary tale.\n\n- All of Nassim Nicholas Taleb's books (Fooled By Randomness, The Black Swan, AntiFragile, Skin in the Game). these books touch on investing but are not investing books per se, he writes about risk and probability from several different angles. He was a Wall Street options trader and one of the few people who saw the 2008 housing crash and managed to profit from it. \n\n- the Ascent of Money by Niall Ferguson. he's a historian and this also isn't an investing book per se, but explains the origins and development of modern banking, bonds, stocks and insurance. \n\n- The Millionaire Next Door, the Millionaire Mind and Stop Acting Rich by Thomas J. Stanley. not investing books per se, but very important to understand if you want to be wealthy. Stanley was a finance professor who in the 1970s and '80s did some of the first systematic research into high wealth Americans. to his surprise, he found there are more millionaires per-capita in blue-collar and middle class neighborhoods than in upscale or white-collar neighborhoods. the TL;DR is that doctors and CEOs might earn more money than teachers, plumbers or farmers but the high-income earners are more likely so spend too much on lifestyle and status items like expensive foreign cars, Rolex watches, etc, and lower-income middle class people are statistically more likely to have a net worth of $1 million or more. based on their percentages of the general population, MDs are under-represented as millionaires while teachers and farmers are over-represented. Millionaire Next Door (1991) outlines the premise and Stop Acting Rich basically updates it with more recent data from 2009. Millionaire Mind is about those worth $10 million or more. \n\nnote that these books can contradict each other. The Bogle books and Random Walk recommend buying the whole market in low-fee index funds, and they subscribe to the EMH. but Lynch, Graham, Klarman and Tillinghast say buy individual companies with certain traits. Peter Lynch is skeptical of academic theorizing generally and attributes most of his success to un-learning what was taught in his MBA program; he says Random Walk is garbage &amp; EMH is highly dubious. Klarman notes that value investing is based on a rejection of the EMH. Tillinghast thinks the EMH has merit in a soft or weak form, but also proposes that the regular existence of bubbles and the fact that value invesging tends to beat the market over time show that the EMH is not foolproof. Buffet perhaps contradicts himself: in 1984 he outlined in detail how good value invesging can beat the market by applying the same analysis to different assets, but he's also recommended the typical investor should lean on low fee indexes. The point is a good education, formal or amateur, should involve reading a lot of information some of which clashes and analyzing or synthesizing it to reach your own conclusions. \n\nI feel compelled to stress that I don't buy or trade single stocks, despite reading a lot on the topic. I think it's too high risk, I'm 100% in boring established mutual funds. mostly indexes with substantial minority holdings in some established lower-fee growth, value and sector funds. if someone insists on single stocks, there's an old rule of thumb to keep it at a max of 10-15% of the overall portfolio.\n\nMorningstar has a good podcast called The Long View, with ~60 minute interviews with various investors and finance types. again, they can contradict each other but also have long and successful careers in their respective worlds. \n\nvirtually every investing company has a variety of articles and other literature on their websites, sometimes by in-house employees and other times reprints of other stuff. poke around the websites of Schwab, Fidelity, Vanguard, State St, BlackRock, Dimensional Funds Advisors, American Funds, Dodge &amp; Cox, Wasatch Funds, Ivy Funds, Eaton Vance, Voya, etc...",
        "created_utc": 1588012253,
        "id": "forhd7c",
        "score": 3,
        "subreddit": "investing",
        "created": 1588041053.0
    },
    {
        "author": "CityForAnts",
        "body": "I like Fidelity",
        "created_utc": 1585771486,
        "id": "fm5eljv",
        "score": 2,
        "subreddit": "options",
        "created": 1585800286.0
    },
    {
        "author": "fountainpenuserhere",
        "body": "Why is Texas instruments up and the options are 10000%+",
        "created_utc": 1585859003,
        "id": "fm8zq6x",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585887803.0
    },
    {
        "author": "CallLivesMatter",
        "body": "Want to get even more granular? Find the companies that did the fewest buybacks and had the most genuine organic growth. Those are the names to *not* bet against. \n\nNow go find the buyback kings (looking at you TXN) and buy puts on them all the way down. Anyone who used massive buybacks to paper over their huge executive comp? Puts. Anyone who borrowed (with their borderline bullshit BBB rating) to do their buybacks? Puts. Anyone who kept their BBB rating for years, despite having enough cash flow to pay down debt and get a better rating? Puts. \n\nThe BBB thing is a longer story and none of you will read it anyway, but it’s a big deal that we’ll start noticing in the coming months.",
        "created_utc": 1586094385,
        "id": "fmhv4q7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586123185.0
    },
    {
        "author": "FPSXpert",
        "body": "*Lockheed Martin or Raytheon \n \nAlso I didn't know this but apparently Texas Instruments used to help make guidance tech for US Missiles.",
        "created_utc": 1586478672,
        "id": "fmy5p7n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586507472.0
    },
    {
        "author": "whatyoulookinatbud",
        "body": "I agree with you that trading US stocks on WS is a bad idea. If it’s just a one time thing though and you’re planning to hold, it’s okay to eat the extra 1.5% fee one time. The semis sector ran hard after TSM earnings this past week. More earnings coming up this week with TXN, LRCX and XLNX. The Tec etf discussed above is barely affected by the semis sector.",
        "created_utc": 1587183433,
        "id": "fnrajfv",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1587212233.0
    },
    {
        "author": "heartstesler",
        "body": "This was a fake rally in semiconductor companies \nWhen their plants are closed\nTheir earning will be awful \n\nNvidia\nAMD\nMicron Tech\nTexas Instruments \nQualcomm\n\nAll are going to retest their lows in coming weeks after results\n\nFirst rally was\nIn Boeing\nAirline stock \ncruising stocks\nRetail stocks\nOil stocks\n\nAll fake rallies faded\n\nThere will not be any pent up demand\n\nRevenue lost is gone\n\nPent up demand is now\nAmazon\nNetflix\nWalmart\n\nThese stocks rally will go away when economy reopen and they will go down\n\nI see amazon sub 2000",
        "created_utc": 1587068488,
        "id": "fnmbkwf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587097288.0
    },
    {
        "author": "desquibnt",
        "body": "TXN and ADI",
        "created_utc": 1586960643,
        "id": "fnhe3j4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1586989443.0
    },
    {
        "author": "heartstesler",
        "body": "Totally agree\n\nStocks are overly priced particularly the tech stocks\nApple\nGoogle\nMicrosoft\nNvidia\nQualcomm\nAMD\nMicron\nTexas Instruments \nVery high multiples of over 21-22",
        "created_utc": 1587096135,
        "id": "fnnmtvm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1587124935.0
    },
    {
        "author": "fountainpenuserhere",
        "body": "Why is Texas instruments up and the options are 10000%+",
        "created_utc": 1585859003,
        "id": "fm8zq6x",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1585887803.0
    },
    {
        "author": "CallLivesMatter",
        "body": "Want to get even more granular? Find the companies that did the fewest buybacks and had the most genuine organic growth. Those are the names to *not* bet against. \n\nNow go find the buyback kings (looking at you TXN) and buy puts on them all the way down. Anyone who used massive buybacks to paper over their huge executive comp? Puts. Anyone who borrowed (with their borderline bullshit BBB rating) to do their buybacks? Puts. Anyone who kept their BBB rating for years, despite having enough cash flow to pay down debt and get a better rating? Puts. \n\nThe BBB thing is a longer story and none of you will read it anyway, but it’s a big deal that we’ll start noticing in the coming months.",
        "created_utc": 1586094385,
        "id": "fmhv4q7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586123185.0
    },
    {
        "author": "FPSXpert",
        "body": "*Lockheed Martin or Raytheon \n \nAlso I didn't know this but apparently Texas Instruments used to help make guidance tech for US Missiles.",
        "created_utc": 1586478672,
        "id": "fmy5p7n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586507472.0
    },
    {
        "author": "landob",
        "body": "Western Digital - Digital storage is going to be still be needed in the future. Will be back to at least $50 next year.",
        "created_utc": 1586062426,
        "id": "fmgzv9n",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1586091226.0
    },
    {
        "author": "avalanchecohen7",
        "body": "I look at it like this: If you have a 10% chance of losing $50, consider it as if you have lost a straight $5.\n\nSo a 20% chance of losing 50%, means a 10% downside; a 80% chance of making 3.5%, means a 2.8% upside. So you are 5x skewed in the downside direction. At this point it's your call. What I do is this: if you're leveraged 5x in the down direction, don't you want to inverse that for your portfolio? Take out 80% of it.\n\nIn the same way, when you have positive leverage, and you're borrowing 2x from the bank, you should be 2x as confident that the stocks are gonna be going up. If you're 5x as confident that they're going to go down, shrink your leverage to be 1/5.\n\nIt's the same thing for individual stocks. I think Ally has an upside of 2x this year, and WDC has an upside of 1.8x. My portfolio is balanced accordingly. It's like a parimutuel bet. Put your money on the \"horses\" (stocks) in proportion to their expected return. There are many opportunities to make money in excess of what the stock market does on average.\n\nSo you see how quickly this particular bet becomes more and more clear what to do though. If you thought a 60% chance of a pullback, you're looking at 30% downside and 1.4% upside, around 22x negative leverage, implying that you should move to 95% cash.\n\nThe market is usually not on the edge of collapsing from a global pandemic, so usually these sorts of analysis are not so incredible. But in this case, the math demonstrates that the choice is clear; it is a hugely lopsided gamble in favor of removing your money. By keeping your money in, if you thought at all that the stocks would correct themselves, you were making a big bet for a small return",
        "created_utc": 1586456907,
        "id": "fmx1qbs",
        "score": 1,
        "subreddit": "investing",
        "created": 1586485707.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  1st of April\n\n\n\n## Upcoming events for Wednesday, April  1st\n\n - Stock splits:\n\n    - WFGCF @ **1:10**\n    - OCPFF @ **1:5**\n    - NJDCY @ **2:1** (Payable date: 04/08/2020)\n\n - Expected earnings:\n\n  AFMD, ASND, AXAS, BSGM, CODX, FGBI, GVA, JFIN, LFC, LW, MITO, MNOV, NEXT, NG, OMN, PSTI, PVH, RLMD, ROSE, SMMT, STAF, TARA, TMDI, UNF, XBIT\n\n - Ex-div:\n\n  ABM, CHH, CLI, DOC, ERIC, ESE, FAM, FANH, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, HASI, HTA, IAE, IDE, IGA, IGD, IHD, IID, IRR, IRT, ITUB, KIM, SSD, THO, TSQ, UFS, VAM, VIV, VLGEA, WNC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -150K, previous: 183K)\n    - Construction Spending (consensus: 0.5%, previous: 1.8%)\n    - Crude Oil Imports (previous: 0.106M)\n    - Crude Oil Inventories (consensus: 3.997M, previous: 1.623M)\n    - Cushing Crude Oil Inventories (previous: 0.858M)\n    - Distillate Fuel Production (previous: 0.152M)\n    - EIA Refinery Crude Runs  (previous: 0.018M)\n    - EIA Weekly Distillates Stocks (consensus: 1.026M, previous: -0.679M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -1.2%, previous: 0.9%)\n    - Gasoline Inventories (consensus: 1.949M, previous: -1.537M)\n    - Gasoline Production (previous: -1.016M)\n    - Heating Oil Stockpiles (previous: 0.395M)\n    - ISM Manufacturing Employment (consensus: 43.6, previous: 46.9)\n    - ISM Manufacturing New Orders Index (previous: 49.8)\n    - ISM Manufacturing PMI (consensus: 45.0, previous: 50.1)\n    - ISM Manufacturing Prices (consensus: 41.2, previous: 45.9)\n    - MBA 30-Year Mortgage Rate (previous: 3.82%)\n    - MBA Mortgage Applications (previous: -29.4%)\n    - MBA Purchase Index (previous: 237.4)\n    - Manufacturing PMI (consensus: 49.2, previous: 50.7)\n    - Mortgage Market Index (previous: 758.4)\n    - Mortgage Refinance Index (previous: 3,809.3)\n    - Seevol Cushing Storage Report (previous: 0.760M)\n    - Total Vehicle Sales (previous: 17.04M)\n\n## Upcoming events for Thursday, April  2nd\n\n - Stock splits:\n\n    - BAM @ **3:2** (Payable date: 04/01/2020)\n\n - Expected earnings:\n\n  ACH, AIRI, APOG, ARDS, AYI, BLPH, BOXL, BPMX, BSET, CAAS, CEO, CHWY, CNTG, CTST, CTXR, FC, FRG, GGAL, HEPA, HTBX, IFRX, IOTS, KMX, LLEX, LONE, NGS, NKSH, PZG, RECN, RTIX, SBSW, SCHN, SEEL, SSI, THTX, UXIN, WBA, XCUR, XELB\n\n - Ex-div:\n\n  AFB, AXP, BBD, BBDO, BMY, CERN, CLF, CSCO, CUZ, GL, GLT, HBNC, HLIO, IHG, IVC, KDP, MORN, MRVL, NTAP, RGLD, SCS, SNN, SYY, UBA, UBP, WDC, WIRE\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 8-Week Bill Auction (previous: 0.000%)\n    - Challenger Job Cuts (previous: -26.3%)\n    - Challenger Job Cuts (previous: 56.660K)\n    - Continuing Jobless Claims (consensus: 4,882K, previous: 1,803K)\n    - Durables Excluding Defense (previous: 0.1%)\n    - Exports (previous: 208.60B)\n    - Factory Orders (consensus: 0.2%, previous: -0.5%)\n    - Factory orders ex transportation (previous: -0.1%)\n    - ISM NY Business Conditions (previous: 51.9%)\n    - ISM-New York Index (previous: 867.9)\n    - Imports (previous: 253.90B)\n    - Initial Jobless Claims (consensus: 3,500K, previous: 3,283K)\n    - Jobless Claims 4-Week Avg. (previous: 998.25K)\n    - Natural Gas Storage (previous: -29B)\n    - Trade Balance (consensus: -40.00B, previous: -45.30B)\n\n## Upcoming events for Friday, April  3rd\n\n - Expected earnings:\n\n  FUV, GBX, GGB, GMO, HUGE, NTIC, OGEN, ONCS, REXN, STZ\n\n - Ex-div:\n\n  BKSC, BRX, CMC, ERIE, HIFS, ISTR, JPM, LMNR, PWR, QIWI, SCVL, UBFO\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 3.0%, previous: 3.0%)\n    - Average Hourly Earnings (consensus: 0.2%, previous: 0.3%)\n    - Average Weekly Hours (consensus: 34.1, previous: 34.4)\n    - CFTC Aluminium speculative net positions (previous: 32.5K)\n    - CFTC Copper speculative net positions (previous: -38.1K)\n    - CFTC Corn speculative net positions (previous: -18.3K)\n    - CFTC Crude Oil speculative net positions (previous: 440.2K)\n    - CFTC Gold speculative net positions (previous: 281.9K)\n    - CFTC Nasdaq 100 speculative positions (previous: 22.4K)\n    - CFTC Natural Gas speculative net positions (previous: -123.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 17.0K)\n    - CFTC Silver speculative net positions (previous: 42.0K)\n    - CFTC Soybeans speculative net positions (previous: 33.6K)\n    - CFTC Wheat speculative net positions (previous: 14.5K)\n    - Government Payrolls (previous: 45.0K)\n    - ISM Non-Manufacturing Business Activity (consensus: 45.0, previous: 57.8)\n    - ISM Non-Manufacturing Employment (previous: 55.6)\n    - ISM Non-Manufacturing New Orders (previous: 63.1)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 57.3)\n    - ISM Non-Manufacturing Prices (previous: 50.8)\n    - Manufacturing Payrolls (consensus: -20K, previous: 15K)\n    - Markit Composite PMI (consensus: 40.5, previous: 40.5)\n    - Nonfarm Payrolls (consensus: -100K, previous: 273K)\n    - Participation Rate (consensus: 63.3%, previous: 63.4%)\n    - Private Nonfarm Payrolls (consensus: -163K, previous: 228K)\n    - Services PMI (consensus: 39.1, previous: 39.1)\n    - U.S. Baker Hughes Oil Rig Count (previous: 624)\n    - U.S. Baker Hughes Total Rig Count (previous: 728)\n    - U6 Unemployment Rate (previous: 7.0%)\n    - Unemployment Rate (consensus: 3.8%, previous: 3.5%)\n\n^^^^2020-04-01",
        "created_utc": 1585735211,
        "id": "fm3seb1",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1585764011.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  2nd of April\n\n\n\n## Upcoming events for Thursday, April  2nd\n\n - Stock splits:\n\n    - BAM @ **3:2** (Payable date: 04/01/2020)\n\n - Expected earnings:\n\n  ACH, AIRI, APOG, ARDS, AYI, BLPH, BOXL, BPMX, BSET, CAAS, CEO, CHWY, CNTG, CTST, CTXR, FC, FRG, GGAL, HEPA, HTBX, IFRX, IOTS, KMX, LLEX, LONE, NGS, NVGS, PLAY, PZG, RECN, RTIX, SBSW, SCHN, SEEL, SSI, THTX, UXIN, WBA, XCUR, XELB\n\n - Ex-div:\n\n  AFB, AXP, BBD, BBDO, BMY, CERN, CLF, CSCO, CUZ, GL, GLT, HBNC, HLIO, IHG, IVC, KDP, MORN, MRVL, NTAP, RGLD, SCS, SNN, SYY, UBA, UBP, WDC, WIRE\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 8-Week Bill Auction (previous: 0.000%)\n    - Challenger Job Cuts (previous: -26.3%)\n    - Challenger Job Cuts (previous: 56.660K)\n    - Continuing Jobless Claims (consensus: 4,882K, previous: 1,803K)\n    - Durables Excluding Defense (previous: 0.1%)\n    - Exports (previous: 208.60B)\n    - Factory Orders (consensus: 0.2%, previous: -0.5%)\n    - Factory orders ex transportation (previous: -0.1%)\n    - ISM NY Business Conditions (previous: 51.9%)\n    - ISM-New York Index (previous: 867.9)\n    - Imports (previous: 253.90B)\n    - Initial Jobless Claims (consensus: 3,500K, previous: 3,283K)\n    - Jobless Claims 4-Week Avg. (previous: 998.25K)\n    - Natural Gas Storage (consensus: -24B, previous: -29B)\n    - Trade Balance (consensus: -40.00B, previous: -45.30B)\n\n## Upcoming events for Friday, April  3rd\n\n - Expected earnings:\n\n  FUV, GBX, GMO, HUGE, OGEN, ONCS, REXN, STZ\n\n - Ex-div:\n\n  BKSC, BRX, CMC, ERIE, HIFS, ISTR, JPM, LMNR, PWR, QIWI, SCVL, UBFO\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 3.0%, previous: 3.0%)\n    - Average Hourly Earnings (consensus: 0.2%, previous: 0.3%)\n    - Average Weekly Hours (consensus: 34.1, previous: 34.4)\n    - CFTC Aluminium speculative net positions (previous: 32.5K)\n    - CFTC Copper speculative net positions (previous: -38.1K)\n    - CFTC Corn speculative net positions (previous: -18.3K)\n    - CFTC Crude Oil speculative net positions (previous: 440.2K)\n    - CFTC Gold speculative net positions (previous: 281.9K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 22.4K)\n    - CFTC Natural Gas speculative net positions (previous: -123.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 17.0K)\n    - CFTC Silver speculative net positions (previous: 42.0K)\n    - CFTC Soybeans speculative net positions (previous: 33.6K)\n    - CFTC Wheat speculative net positions (previous: 14.5K)\n    - Government Payrolls (previous: 45.0K)\n    - ISM Non-Manufacturing Business Activity (consensus: 45.0, previous: 57.8)\n    - ISM Non-Manufacturing Employment (previous: 55.6)\n    - ISM Non-Manufacturing New Orders (previous: 63.1)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 57.3)\n    - ISM Non-Manufacturing Prices (previous: 50.8)\n    - Manufacturing Payrolls (consensus: -20K, previous: 15K)\n    - Markit Composite PMI (consensus: 40.5, previous: 40.5)\n    - Nonfarm Payrolls (consensus: -100K, previous: 273K)\n    - Participation Rate (consensus: 63.3%, previous: 63.4%)\n    - Private Nonfarm Payrolls (consensus: -163K, previous: 228K)\n    - Services PMI (consensus: 39.1, previous: 39.1)\n    - U.S. Baker Hughes Oil Rig Count (previous: 624)\n    - U.S. Baker Hughes Total Rig Count (previous: 728)\n    - U6 Unemployment Rate (previous: 7.0%)\n    - Unemployment Rate (consensus: 3.8%, previous: 3.5%)\n\n^^^^2020-04-02",
        "created_utc": 1585821610,
        "id": "fm7cfdj",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1585850410.0
    },
    {
        "author": "pitrucha",
        "body": "Sadly i dont have access to the entire list and cannot check for that. But HYG also has some Western Digital - our hdd are financed by fed!",
        "created_utc": 1586458728,
        "id": "fmx5bk7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586487528.0
    }
]