[
    {
        "author": "xPURE_AcIDx",
        "body": "Facebook makes money from ads. They make money from having users\n\nGoogle makes money from ads. They make money from having users. \n\nMicrosoft makes money from milking corporations for Windows Enterprise / Server / Cloud / Office 365. A strong user base familiar with Microsoft products are more willing to work with Microsoft once they advance into senior roles in their company. They almost feel like they're getting free stuff, in reality they're victoms of vendor lock in. \n\nZoom loses money from having users. They're effectively leaches untill they turn into paying customers. Most potential consumers already have alternatives they don't have to pay for or already have access to.",
        "created_utc": 1589052523,
        "id": "fq23kxa",
        "score": 73,
        "subreddit": "stocks",
        "created": 1589081323.0
    },
    {
        "author": "paradoxinvesting",
        "body": "You idiots with your MSFT 200 calls have fucked the market once again",
        "created_utc": 1589314480,
        "id": "fqevxo0",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1589343280.0
    },
    {
        "author": "meetis",
        "body": "he is trying hard not to mispronounce MicroVision with Microsoft",
        "created_utc": 1588886357,
        "id": "fpt7ru5",
        "score": 58,
        "subreddit": "pennystocks",
        "created": 1588915157.0
    },
    {
        "author": "Element_84",
        "body": "It dipped because I finally bought MSFT stock",
        "created_utc": 1589314896,
        "id": "fqewtda",
        "score": 58,
        "subreddit": "stocks",
        "created": 1589343696.0
    },
    {
        "author": "TheGuyAboveMeSucks",
        "body": "Never Forget. MSFT 200c 3/20. RIP",
        "created_utc": 1589597568,
        "id": "fqs3bo8",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1589626368.0
    },
    {
        "author": "gierschj6963",
        "body": "They are busy merging with Microsoft",
        "created_utc": 1588885467,
        "id": "fpt60jp",
        "score": 47,
        "subreddit": "pennystocks",
        "created": 1588914267.0
    },
    {
        "author": "diboy2",
        "body": "How the hell is msft doing all these deals? Omg. My shares!",
        "created_utc": 1588725880,
        "id": "fpm5c0q",
        "score": 24,
        "subreddit": "investing",
        "created": 1588754680.0
    },
    {
        "author": "Casandy420",
        "body": "Maybe, but I think it might take longer than most people think. Tech firms sell to governments. Microsoft is one of the largest military contractors around the world. Pretty much every country's military runs windows.\n\nJust listened to the q3 earnings call. Cloud demand is up like crazy right now. So, money is being shifted away from local resources into cloud computing resources. So many of AWS and Azure customers are shifting money into these tech companies. Smaller firms like NetApp, Atlassian, or Slack are seeing sales raise with this new demand.\n\n&amp;#x200B;\n\nAlso, there are entirely new markets for tech that weren't viable pre covid. Consider the NFL, NBA....I can't remember the sport, but they now use MSTeams. Companies are seeing the cost benefits of remote work. Virtual Formula 1 is another example. Things are going to be interesting. To stay competitive, you will need to piviot into this new economic situation. Red Robin is an interesting case study. They cut costs like crazy and embraced off site orders. Or look at Trupanion's 10K. They cut costs and increased cash on hand to a point where they can operate for an entire year w/o income.\n\n&amp;#x200B;\n\nYou have to remember that there are millions of dollars worth of human intelligence driving the decisions behind each of these Tickers. Boards are made up of people with way way way way more industry knowledge than anyone on reddit. Yes, Tesla exists, and a tweet can swing billions of dollars around the moon, but for the most part, companies are ran by intelligent folks trying their best to make money. That's it. Even if the world is on fire, these people will find a way to sell you insurance on credit. The economy has existed since before the old testament. Exodus 30:11-16  is just ancient hebrew tax law. Even if it's not money, people will find something to trade to create value. The wheel keeps on turning.\n\nEDIT: Totally forgot, look at MSFT 10K. B2B OEM sales are the bread and butter. So you will need to see large retailers (including amazon) collapse before companies like intel and MSFT will feel the big hits.",
        "created_utc": 1588877300,
        "id": "fpsp9v5",
        "score": 21,
        "subreddit": "StockMarket",
        "created": 1588906100.0
    },
    {
        "author": "pugofwallstreet",
        "body": "MSFT is a safe stock, but damn. All your eggs in one basket is DANGEROUS.",
        "created_utc": 1589494747,
        "id": "fqnh4bi",
        "score": 20,
        "subreddit": "stocks",
        "created": 1589523547.0
    },
    {
        "author": "acoupleoftravels",
        "body": "Step 1: start a company \n\nStep 2: announce earnings: \"I don't have a business model but we found 27¢ in our home office couch and that was better earnings than we expected; I can't give guidance because we don't sell or do anything but we can only move up from here.\" \n\nStep 3: wait for retailers to rally as they use Professor X powers to see 50 years into the future where the company is successful. \n\nStep 4: media attention from rally\n\nStep 5: JPM price target increase as they try to get into the action\n\nStep 6: buy puts and go full Elon \"price is too high imo\"\n\nStep 7: throw your millions into msft 200c because nothing makes sense anymore",
        "created_utc": 1588885555,
        "id": "fpt66he",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1588914355.0
    },
    {
        "author": "degen1010101",
        "body": "Microsoft disagrees 🥱🤡",
        "created_utc": 1588715179,
        "id": "fplm37a",
        "score": 19,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588743979.0
    },
    {
        "author": "bongrips4titties",
        "body": "You are obviously clueless because nobody has said it’s going to be the next Microsoft, sorry you got burnt or dumped or whatever happened to you. Cheer up",
        "created_utc": 1588801653,
        "id": "fppg4o0",
        "score": 17,
        "subreddit": "pennystocks",
        "created": 1588830453.0
    },
    {
        "author": "ShootTheJae",
        "body": "Microsoft calls, got it.",
        "created_utc": 1588629161,
        "id": "fphwmg1",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1588657961.0
    },
    {
        "author": "Bigchungus1025",
        "body": "Groupon and blue apron had business models that can be easily replicated. When the market ( Google and MSFT) figured out the demand for video conferencing, they jumped in. It’s not a hard model to replicate which makes it trash.",
        "created_utc": 1589052367,
        "id": "fq22yto",
        "score": 15,
        "subreddit": "stocks",
        "created": 1589081167.0
    },
    {
        "author": "nckmiz",
        "body": "The market was down 30% for a week or so. You think Berk can just deploy 60 billion the way you deploy 5k? He’s not going to go buy more than a few billion in shares of Apple/MSFT, etc. with that money. He doesn’t ever want to hold over 10% positions in publicly traded companies for disclosure reasons. His game at this size is waiting for attractive companies to be in need. What company that was attractive in late March was in desperate need of capital? How quickly do you think Berk can negotiate a full on takeover? \n\nHe’s in a waiting game. This thing is far from over. He’s not a hedge fund manager buying temporary market dips.",
        "created_utc": 1588824758,
        "id": "fpqk8nf",
        "score": 14,
        "subreddit": "investing",
        "created": 1588853558.0
    },
    {
        "author": "fufufang",
        "body": "The output for the last 24 hours is like this: \n\n    Code    Frequency\n    MVIS    196\n    IZEA    107\n    KTOV    33\n    RTTR    29\n    MARK    22\n    DECN    12\n    GNUS    12\n    MSFT    12\n    INUV    11\n    UAVS    10\n    COVI    9\n    BBCP    9\n    VISL    9\n    NAK     8\n    RMBL    8\n    TTI     8\n    NAT     7\n    VAL     7\n    CNAT    7\n    RTW     6\n    EIS     5\n    FRSX    5\n    TLSS    5\n    MGM     4\n    DIS     4\n    NASD    4\n    WHAT    4\n    SHIP    4\n    GCGX    4\n    ACB     4\n    SCON    4\n    DYE     4\n    RTTF    3\n    TNP     3\n    FET     3\n    BIOC    3\n    STOC    3\n    AIKI    3\n    FLIR    3\n    MERG    3\n    EOD     3\n    ZOM     3\n    DISH    3\n    GHSI    3\n    OAS     3\n    BBRW    3\n    RAZF    3\n    HIL     3\n    AAPL    3\n    LADR    3",
        "created_utc": 1588795807,
        "id": "fpp4h9v",
        "score": 14,
        "subreddit": "pennystocks",
        "created": 1588824607.0
    },
    {
        "author": "capjl",
        "body": "I'm holding til this thing evolves to the next MSFT",
        "created_utc": 1588806242,
        "id": "fppor8q",
        "score": 14,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588835042.0
    },
    {
        "author": "hifrequencies",
        "body": "The dip today was sparked by an article that was later taken down because it was bs. There's still the patent evidence, rumors of the chip in the Xbox and the 20 or so former MVIS employees working at Microsoft. I'm holding 500. We should see a spike tomorrow, volume is still high and tomorrow was always going to be the biggest day.",
        "created_utc": 1588816315,
        "id": "fpq6sh5",
        "score": 14,
        "subreddit": "pennystocks",
        "created": 1588845115.0
    },
    {
        "author": "tomato_sandwich",
        "body": "Merger...Miercger...Microsoft. ITS HAPPENING",
        "created_utc": 1588885886,
        "id": "fpt6u2m",
        "score": 13,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588914686.0
    },
    {
        "author": "LactobaSILLY",
        "body": "This is from a site with an article next to it titled “15 ways to tell if your girlfriend is cheating on you.” \n\nI wouldn’t take investment advice from People magazine either. And highly doubt “TodaysFive” investigation “team” talked to any high level investors who heard directly from the MSFT CEO that “LoL yeah were defs gonna buy dat.” Which, also, would be insider trading.",
        "created_utc": 1588965971,
        "id": "fpwmb7d",
        "score": 13,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588994771.0
    },
    {
        "author": "wsbtitsup",
        "body": "Why don’t you at least buy June puts? This is poor risk mgmt. Take an upvote. Large cap tech will continue running up and likely bone you. I’m biased due to my msft calls",
        "created_utc": 1588969477,
        "id": "fpwt3li",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588998277.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Wasn’t the 2000 tech bubble fueled by shitty companies with no profitability? \n\nAmazon, Microsoft, google, Facebook, Apple are fucking cash generating big dick monsters. Not comparable at all",
        "created_utc": 1589249350,
        "id": "fqc3hph",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1589278150.0
    },
    {
        "author": "iBaconized",
        "body": "Everyone watching AH markets hasn’t played earnings before.\n\nRemember when MSFT was up like $10 after hours and then opened $10 lower than close? How quickly we’ve forgotten\n\nRetarded",
        "created_utc": 1588797611,
        "id": "fpp84ye",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588826411.0
    },
    {
        "author": "PappleD",
        "body": "There’s something rotten going on. Apple, Facebook, Netflix, Microsoft, amazon are all at or near ATHs. Meanwhile, Main Street and overall economy is suffering worst depression since the 30s. I hear the sound of pitchforks sharpening...",
        "created_utc": 1588786566,
        "id": "fpolmoh",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588815366.0
    },
    {
        "author": "hoopaholik91",
        "body": "So bears are fucked on Monday aren't we? It just seems like too much bad news all at once.\n\n* Fed report that came out right after the bell\n* GOOG anti-trust suit is gonna scare AMZN/MSFT/FB too\n* JPow on 60 minutes is gonna say the same thing he said on Wednesday that spooked the market but to a bunch of retail investors that have been buying like crazy\n* China has 3 days to retaliate for the Huawei news, and Trump can always be more aggressive\n\nEverything is lining up perfectly for a drop which means obviously it's gonna reverse.",
        "created_utc": 1589583404,
        "id": "fqrfn10",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1589612204.0
    },
    {
        "author": "__Snafu__",
        "body": "you have a serious case of denial here. We all want to hit big, but this is obviously not the one.   \n\n\nThere is no microsoft deal. That woman was obviously told to say that and waited until she heard from higher up.  \n\n\nThat stock is only going to go down until it get's back to like .40 or so....   \n\n\nWe all wanted it to hit, but it's not going to.",
        "created_utc": 1589325320,
        "id": "fqfi5mq",
        "score": 13,
        "subreddit": "pennystocks",
        "created": 1589354120.0
    },
    {
        "author": "LeSpare1",
        "body": "Bro, for real this time 6/19 msft 200c will print nicely this time.",
        "created_utc": 1589513434,
        "id": "fqoehpn",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1589542234.0
    },
    {
        "author": "xPURE_AcIDx",
        "body": "From my experience it seems like Teams is winning this battle. My company just switched from zoom to Teams. My Oil&amp;gas clients all use Teams. \n\nI have only witnessed mass use of zoom through free users, and universities. Universities which have access to both Microsoft and Google products. I'd imagine if this covid stuff pushes into fall these companies will get universities to use their products already bundled with suite of products. Instead of paying for an additional product. Considering that university virtual classes have suffered from trolls, using a product like hangouts that would require your university email will secure these chats. \n\nI hold no Microsoft/Google shares, and I have no stakes in zoom's success or failures. Just food for thought.",
        "created_utc": 1589053167,
        "id": "fq263jm",
        "score": 13,
        "subreddit": "stocks",
        "created": 1589081967.0
    },
    {
        "author": "StreetTripleRider",
        "body": "shit why didn't none of you lazy asses ask any questions about Microsoft? I didn't cause I thought someone would have for sure.",
        "created_utc": 1588887021,
        "id": "fpt93nw",
        "score": 13,
        "subreddit": "pennystocks",
        "created": 1588915821.0
    },
    {
        "author": "ss_400401",
        "body": "Just curious why you wanted to bet against MSFT?",
        "created_utc": 1588802446,
        "id": "fpphnfk",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1588831246.0
    },
    {
        "author": "thelukecameron",
        "body": "Genuine question, what happens if they get bought out by MSFT?",
        "created_utc": 1588626045,
        "id": "fphqoue",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1588654845.0
    },
    {
        "author": "IWorkForScoopsAhoy",
        "body": "It's a solid company. Well paid engineers and tangible products. Holograms, chips, and lidar. Many execs and engineers use MVIS as a stepping stone before being hired at microsoft. I don't like pennystocks often.",
        "created_utc": 1588636756,
        "id": "fpia74p",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1588665556.0
    },
    {
        "author": "superphotonerd",
        "body": "crabs in a bucket trying to escape - there was a bullshit article posted saying Microsoft are acquiring them..",
        "created_utc": 1588973227,
        "id": "fpx09jh",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1589002027.0
    },
    {
        "author": "TILilweeezy",
        "body": "Microsoft",
        "created_utc": 1588885860,
        "id": "fpt6s5e",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1588914660.0
    },
    {
        "author": "OnlyTheLadder",
        "body": "Their competitors have been complacent and Microsoft just keeps releasing quality business products that integrate well with each other.",
        "created_utc": 1588732694,
        "id": "fpmgpf1",
        "score": 12,
        "subreddit": "investing",
        "created": 1588761494.0
    },
    {
        "author": "DandierChip",
        "body": "MSFT isn’t playing you. You are being played by people pushing false rumors to try to pump the stock up so they can sell at a profit. Just look what happened yesterday. How many times will it take for us to learn. We had DECN, UAVS and now this. Pump and don’t forget to dump",
        "created_utc": 1588792910,
        "id": "fpoymtb",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1588821710.0
    },
    {
        "author": "npate102",
        "body": "Every time MSFT 200c comes back on the table, market shits panties. :(",
        "created_utc": 1589423662,
        "id": "fqkb3i7",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1589452462.0
    },
    {
        "author": "Philisophicalgoose33",
        "body": "The new Xbox has the MVIS chip in it, and Microsoft is having a conference about their new Xbox on thirsday I believe at 11:00. AM. So it’s very recent news that is coming out not just old news",
        "created_utc": 1588612932,
        "id": "fph0rdg",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1588641732.0
    },
    {
        "author": "Noexit007",
        "body": "IF (and it is still a big IF), MSFT is buying MVIS, generally you either would get compensation in MSFT stock, or cash for your shares.  However, the price offered is generally at a premium. As such, often you will see shares skyrocket in price to very close to what is expected to be offered to shareholders.\n\nRegardless, its a VERY good thing for investors because usually they make out quite well in the deal.",
        "created_utc": 1588710655,
        "id": "fpldae1",
        "score": 11,
        "subreddit": "pennystocks",
        "created": 1588739455.0
    },
    {
        "author": "DeepBuddy5",
        "body": "Do or die tomorrow. I have 500 shares left after selling Tues for a nice profit. I'm holding till the conference call. MVIS is a legit company.\nMicrosoft has an announcement tomorrow, maybe good news maybe not. \nEither way we'll see what finally happens. \nBest of luck to everyone tomorrow with all your stocks! Hope you all make some $$$",
        "created_utc": 1588827353,
        "id": "fpqnwhw",
        "score": 11,
        "subreddit": "pennystocks",
        "created": 1588856153.0
    },
    {
        "author": "slowand-old",
        "body": "Raise your hand if you're still holding your MSFT calls",
        "created_utc": 1588363885,
        "id": "fp74h41",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1588392685.0
    },
    {
        "author": "shutupstephenA",
        "body": "Poor people pay mortgages and rent. Guess who buys consumer goods? Poor people. Pulled the 12-18 month estimate out of your ass. You literally have no idea what you’re talking about. “Poor people” make up the incredible majority of the consuming public. No one will want to own Apple/Uber/Microsoft etc when people aren’t buying their products because they don’t even have enough money to pay for where they live. Wait until the negative interest rates hit, mortgage forbearance is over, stimulus money is spent, and small businesses shut down because their relief/ loan money didn’t cut it. You talk as if the president has the final say on the strength of the stock market, which is so wildly near-sighted. This reasoning is fucking retarded. But whatever, as it proliferates, the potential for profit just increases, so keep it up.",
        "created_utc": 1588976992,
        "id": "fpx77lo",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589005792.0
    },
    {
        "author": "olosnecaj",
        "body": "[Microsoft is buying...](https://pbs.twimg.com/media/EYAMNCKXkAQA2Oj?format=png&amp;name=small)",
        "created_utc": 1589486954,
        "id": "fqn17yg",
        "score": 11,
        "subreddit": "pennystocks",
        "created": 1589515754.0
    },
    {
        "author": "BrewTrue",
        "body": "My brothers friends cousins uncle who knows a guy at Amazon that’s brothers mothers grandma used to work for Microsoft and she said that this is true!",
        "created_utc": 1588611943,
        "id": "fpgyu2z",
        "score": 11,
        "subreddit": "pennystocks",
        "created": 1588640743.0
    },
    {
        "author": "bodiddlysquat26",
        "body": "Well boys, been fun, but I think I'm just going to sit on MSFT, BRK.B, and RTX until I'm ready to buy my house. No more speculation. Made some gains. Will still read the reddit for lols, but that's enough for me.",
        "created_utc": 1588366907,
        "id": "fp7ac03",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1588395707.0
    },
    {
        "author": "timeismoney247",
        "body": "Now, if only Bill could tweet that MSFT is undervalued",
        "created_utc": 1588352517,
        "id": "fp6hogx",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1588381317.0
    },
    {
        "author": "s2upid",
        "body": "We talk about this patent in detail here: https://www.reddit.com/r/MVIS/comments/9naz95/microsoft_scannerilluminated_lcos_projector_for/\n\nBasically it allows MSFT to utilize MVIS tech to create the most epic pair of augmented reality glasses you could think of. A prototype can be seen in the following video from Microsoft Research:\n\nhttps://youtu.be/lN4tFV16mU8?t=143",
        "created_utc": 1588712689,
        "id": "fplhabd",
        "score": 11,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588741489.0
    },
    {
        "author": "xxxchabrahxxx",
        "body": "Breaking news small drone company Ag Eagle swoops in and undercuts Microsoft in potential buyout worth 17 quadrillion yen!",
        "created_utc": 1589311723,
        "id": "fqeq305",
        "score": 11,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1589340523.0
    },
    {
        "author": "RoopLoops",
        "body": "i dont go deep OTM. with all this volatility, ive been buying MSFT and AAPL calls 2 - 3 weeks out, and 1 or 2 strike prices OTM, with only a 2K portfolio, I made 1K today.",
        "created_utc": 1589233261,
        "id": "fqba4zp",
        "score": 11,
        "subreddit": "options",
        "created": 1589262061.0
    },
    {
        "author": "bobfrink",
        "body": "Wow these are some of the worst strike prices I’ve seen. what made you pick $95 for Microsoft?",
        "created_utc": 1589567911,
        "id": "fqqm3pk",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1589596711.0
    },
    {
        "author": "LactobaSILLY",
        "body": "MSFT thrives on online interaction. Do you go to the Microsoft store at your local mall? Their teams and azure is killing it despite the market downturn. More computers sold to work from home people/companies = more money and more WFH = more teams. Not to mention gaming sector increase.",
        "created_utc": 1588826415,
        "id": "fpqmm2k",
        "score": 11,
        "subreddit": "stocks",
        "created": 1588855215.0
    },
    {
        "author": "Romano718",
        "body": "I hope for all the weak handed fucks, by the grace of moon gods they DO merge with MSFT on Thursday",
        "created_utc": 1588703207,
        "id": "fpkyftq",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1588732007.0
    },
    {
        "author": "LordTeddard",
        "body": "u know ur at the end of the tunnel when people start mentioning $MSFT 200c",
        "created_utc": 1589325372,
        "id": "fqfi99j",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1589354172.0
    },
    {
        "author": "lnsufficientgravitas",
        "body": "The top isn't in yet as we don't have any MSFT 200C memes on the front page yet",
        "created_utc": 1588972821,
        "id": "fpwzhwm",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1589001621.0
    },
    {
        "author": "Memetron9000",
        "body": "u/robinhoodstaff, do it or we go all in MSFT 400c 3/8 with maxed out margin",
        "created_utc": 1588808058,
        "id": "fpps30v",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588836858.0
    },
    {
        "author": "BennyFlocka",
        "body": "What’s FAGMAN going to do this week (FB, AMZN, GOOG, MSFT, AAPL, NFLX)?",
        "created_utc": 1588542402,
        "id": "fpe8dq8",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588571202.0
    },
    {
        "author": "qwertyaas",
        "body": "GUYS, THAT WAS A CLOSE ONE. BUT WE THINK WE ARE OUT OF THE DANGER ZONE. \n\nMSFT REALLY BOTTOMED OUT AT $190 AND DONT GET US STARTED AT NVDA FALLING TO $325. BUT WE THINK WE HIT THE BOTTOM AND IT'S NOW A GOOD TIME TO BUY. TRUST US, WE KNOW WHAT WERE TALKIKG ABOUT. \n\nPLEASE STAY ONLINE, OUR EDITORS ARE CURRENTLY EDITING MY NEXT ARTICLE STATING WE ARE AT THE TOP, AND MY SEQUAL, TRADING SIDEWAYS UNTIL 2040.",
        "created_utc": 1589224194,
        "id": "fqaruen",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1589252994.0
    },
    {
        "author": "Funkierail",
        "body": "bill gates stepped down from microsoft, so probably not.",
        "created_utc": 1588696520,
        "id": "fpkkx77",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1588725320.0
    },
    {
        "author": "livestrong2109",
        "body": "Too bad they're making massive cuts to their R&amp;D on self driving. Truth is they where way behind and are just hoping to buy the technology.\n\nUber is in such trouble longterm. It's the same line of thought as IBM when the licensed dos and then for some reason collaborated with Microsoft on OS/2.\n\nIts one of those companies that very likely won't be around in ten years.",
        "created_utc": 1589425464,
        "id": "fqke98t",
        "score": 10,
        "subreddit": "investing",
        "created": 1589454264.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "MSFT$ u fucken monster man thank  you \n\nMe and u gates we gonna save the world baby",
        "created_utc": 1588623062,
        "id": "fphkvc4",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1588651862.0
    },
    {
        "author": "pugofwallstreet",
        "body": "MSFT IS a safe stock, but that is still all your eggs in one basket. Because nothing is completely safe.\n\nNow, you need to stop taking advice from your pastor. He is recommending you hold things which DECAY by design as, in JNUG.\n\nLook at the chart for VTI.\n\nYou need to learn more about investing my friend. Not from your pastor. Also, the markets are highly volatile right now, and another crash is quite probably coming.",
        "created_utc": 1589495631,
        "id": "fqniulq",
        "score": 10,
        "subreddit": "stocks",
        "created": 1589524431.0
    },
    {
        "author": "jmm-22",
        "body": "Get out while you can.  All of these hype trains derail after these calls.  There’s no evidence they’re working with Microsoft.  Prior art in patents don’t mean anything.",
        "created_utc": 1588880906,
        "id": "fpswq1m",
        "score": 10,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588909706.0
    },
    {
        "author": "Csalsa85",
        "body": "My friends dad who works at Goldman Sachs said Tesla is partnering with Microsoft to partner with MVIS and amazon",
        "created_utc": 1588605732,
        "id": "fpgmt6h",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1588634532.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "MADE A GOOGLE EMAIL \n\nAND WHEN I HAD TO MAKE UP A PASSWORD I PUT \n\n“ MSFT$“ \n\nGOOGLE TOLD SORRY \n\nTHAT PASSWORD IS “ TOO STRONG “ !!!\n\n👊👊👊👊👊👊👊👊👊👊👊👊x1,000,0000%\n\n\nhttps://youtu.be/063Pzii3bqk",
        "created_utc": 1588609250,
        "id": "fpgtjoq",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588638050.0
    },
    {
        "author": "nafinmasjid",
        "body": "You would think earnings would be easy until you remember how MSFT and AMZN AND SPY cucked us",
        "created_utc": 1588624304,
        "id": "fphnba5",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588653104.0
    },
    {
        "author": "isaac11117",
        "body": "I was playing Xbox with Rory gates and he was playing this song. MVIS to the moon. Microsoft merger is official",
        "created_utc": 1588967699,
        "id": "fpwpotk",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1588996499.0
    },
    {
        "author": "s2upid",
        "body": "&gt;Around 1pm on Friday Microsoft (MSFT), Today’s Five investigative team was given word that CEO Satya Nadella reportedly informed close investors that the acquisition of MicroVision (MVIS) would “undoubtedly be followed through with”. An official announcement is expected on Tuesday.",
        "created_utc": 1588963253,
        "id": "fpwgxm1",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1588992053.0
    },
    {
        "author": "nodirection12",
        "body": "lol you got caught holding the bag on this pump and dump and now trying to get redditors to bail you out. msft isnt buying this junk.",
        "created_utc": 1589255432,
        "id": "fqcdace",
        "score": 9,
        "subreddit": "StockMarket",
        "created": 1589284232.0
    },
    {
        "author": "hallwaysoffat",
        "body": "I actually sold my MSFT and SPY calls for gains today. That’s one for the history books.",
        "created_utc": 1588725397,
        "id": "fpm4ijc",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588754197.0
    },
    {
        "author": "Dreadpiratemarc",
        "body": "How many of the original DJIA are still in business?  I think it's maybe just GE and ATT.  All the rest, industry giants in their day, have dissolved.  Businesses like everything else have a life cycle.  \n\nHow many of the tech darlings popular with amature investors do you think will still be a good investment in 30 years?  Microsoft and Apple might or might not.  But Facebook?  Netflix?  Definitely not.  Amazon will probably be around but it will be more like Walmart is today, struggling to find growth in a saturated market and facing disruptors of its own.",
        "created_utc": 1589330000,
        "id": "fqfqzz6",
        "score": 9,
        "subreddit": "StockMarket",
        "created": 1589358800.0
    },
    {
        "author": "ScallyWag-Idiot",
        "body": "\"@realbillgates: MSFT stock way too fucking low cucks. Ima buy every available share on the market\"",
        "created_utc": 1589405929,
        "id": "fqj727q",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589434729.0
    },
    {
        "author": "philmacrack123",
        "body": "ATH, it was the day of the top. A sign from the heavens to short, god came to us that day and gave us the easiest play of all time, and we all bought MSFT 200c",
        "created_utc": 1589100920,
        "id": "fq5d7yd",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589129720.0
    },
    {
        "author": "christhemix",
        "body": "to me this is proof MSFT is NOT buying MVIS.\n\ntheres a long list of former MVIS employees working for MSFT now\n\nMSFT just buys their patents and makes the shit themselves, why would they spend millions more acquiring the whole company?\n\nanyone else see it this way?",
        "created_utc": 1588711385,
        "id": "fplepy0",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1588740185.0
    },
    {
        "author": "sutich",
        "body": "Copyright Windows Report 2020\n#Not associated with Microsoft\n\nLiterally right there on the page",
        "created_utc": 1589298683,
        "id": "fqdyae7",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1589327483.0
    },
    {
        "author": "SwimmingJunky",
        "body": "I threw in 12k this morning, almost my entire portfolio.  Not because I actually believe there is going to be a Microsoft buyout, but that OTHER people think so.  I'm already up like 10k.  I'm not worried about small dips here and there because I know that, at least until Thursday, this stock will continue to rise driven purely by human psychology - other people believing the hype.  People are inherently greedy.  I could care less one way or the other if the news is true.\n\nSome people may call what I did risky - throwing my entire portfolio in - but considering the entirety of the circumstances, I'd consider it an extremely calculated risk with hardly any downside and enormous upside.",
        "created_utc": 1588639552,
        "id": "fpif06k",
        "score": 9,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588668352.0
    },
    {
        "author": "alffawolf33",
        "body": "I can’t read Microsoft calculator. WTF is this gay shit?",
        "created_utc": 1589420393,
        "id": "fqk58ba",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1589449193.0
    },
    {
        "author": "performx92",
        "body": "Never forget Donald Trump’s **REAL** last CORONAVIRUS TASK FORCE presser. Injection of sunlight and household cleaners. I feels like it was MSFT 200c days ago.",
        "created_utc": 1588644578,
        "id": "fping3v",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588673378.0
    },
    {
        "author": "jawni",
        "body": "Tyson -&gt; Vanguard -&gt; Microsoft -&gt; Bill Gates \n\nThey all relate to each other in highly variable degrees. It's not really worth elaborating because however you want to connect the dots will likely make more sense than whatever conspiracy theory is actually being presented because it's literal insanity.",
        "created_utc": 1588359498,
        "id": "fp6vwd7",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588388298.0
    },
    {
        "author": "Slow_is_Fast",
        "body": "Actually from what I understand they sold the tech to Microsoft. This reduces their overhead. They gain a royalty for each unit Microsoft makes which is reportedly equivalent to what they would earn if they did it themselves.",
        "created_utc": 1588719504,
        "id": "fplu40x",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1588748304.0
    },
    {
        "author": "Singleguywithacat",
        "body": "This earning season's reminds me of my first few parties in college.  I was super-excited, had all of the right clothes to wear, and was definitely looking forward to flossing the new-and-improved me.  The first party was definitely cool, as I felt my way around, filled with nervousness and anticipation.  I laughed off the fact I didn't actually go home with a woman that first night, or even get a number, or even talk to a woman, but I had a nice buzz and was prepared for my next shot.   It was kind of like my bet on Dominoes this earning's season, in hindsight it didn't work out, but I had done the research and looked forward to the next round.\n\nThe next few parties in college, I began to resent how easy it seemed to be for everybody else to have a good time, and get apparently what I was looking for.  I was beginning to get less and less optimistic, and that initial sense of euphoria and confidence was slowly turning into self-loathing and the feeling of petulance of not belonging there.  As I bet AMZN and MSFT this earnings season, the same feeling became me.  Why didn't I just click on FB instead, why did I blow $1600 on an expiring weekend SPY Put.  None of it makes sense, to anybody.  \n\nEventually at the end of my freshman year, I realized that parties weren't for me, and maybe I'm just a weirdo.  Maybe earnings aren't for me either, but I could just be broke.  In either event, I have no business being there or here.",
        "created_utc": 1588800524,
        "id": "fppdxs5",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1588829324.0
    },
    {
        "author": "soAsian",
        "body": "that didn't stop company like IBM, Microsoft, Google, hell even Apple from dumping money into India for R&amp;D, product development, call centers, iphone assembly...etc.",
        "created_utc": 1588626990,
        "id": "fphshj3",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1588655790.0
    },
    {
        "author": "Thethotslayer007",
        "body": "Yes totally. It's a high tech stark enterprise type company as in it has huge potential and could definitely eclipse 2 or 3 bucks. Uav was a shady company. Good for pump and dump methods but this one has alot of employees and is near Microsoft in washington state. Their designs and R and D are really brilliant from what one guy said. Like you want future tech they have it.",
        "created_utc": 1588621036,
        "id": "fphgtw0",
        "score": 8,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588649836.0
    },
    {
        "author": "MaRrDuKzAyA",
        "body": "The fact that MVIS actually has worked with microsoft in the past and half amazing products that are game-changers makes this very different than UAVS. i’m feelin good about this one",
        "created_utc": 1588637903,
        "id": "fpic6co",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1588666703.0
    },
    {
        "author": "BlueKnightJoe",
        "body": "https://www.cnbc.com/2020/05/08/op-ed-markets-rising-as-economic-numbers-plunge-is-historically-a-setup-for-disappointment.html\n\nEven the bears on CNBC advise you to avoid SPY puts and instead buy and hold shares of Pepsi, JNJ and MSFT. What the fuck kind of bear are you if being a bear just means playing slightly more defensive when longing stocks. Shit son grow a pair and load up on puts.",
        "created_utc": 1588954808,
        "id": "fpvzvlp",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1588983608.0
    },
    {
        "author": "docarwell",
        "body": "Ive referred 5 people and got a microsoft stock for one of them",
        "created_utc": 1588964117,
        "id": "fpwin7b",
        "score": 8,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588992917.0
    },
    {
        "author": "atolius",
        "body": "120K to MSFT calls. I believe you in Nutella",
        "created_utc": 1589241004,
        "id": "fqboqqp",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1589269804.0
    },
    {
        "author": "SwanArmy",
        "body": "I'm gonna drastically simplify this for you, keep in mind that this isn't the actual definition of IV by any means.\n\nEssentially, Implied Volatility is an options term for how much the underlying stock will move in a given time frame. Since TSLA has much wider swings in stock price than say...AAPL or MSFT, TSLA has higher IV. This higher IV correlates to lower movement in options prices for large moves. For example, a 5% move in TSLA will result in 50-60% gains in TSLA at-the-money options, but a 5% move in MSFT will translate to 150-200% gains in MSFT at-the-money options.\n\nTSLA is expected to move let's say....5 percent per day. It's NOT expected to move 5% in an hour. That's what i meant in that in general, TSLA's stock price was moving a lot more than expected (on high volume) during that timeframe.",
        "created_utc": 1588378477,
        "id": "fp7wh8m",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1588407277.0
    },
    {
        "author": "olsont1",
        "body": "Not even that. It’s just that 10% of that specific fund is invested in Microsoft. \nVanguard doesn’t own close to 10% of Microsoft as a whole.",
        "created_utc": 1588350277,
        "id": "fp6d3xo",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1588379077.0
    },
    {
        "author": "DandierChip",
        "body": "I had a bid ready for a couple thousand shares just in case Microsoft was announced. Definitely not 50k tho 😂",
        "created_utc": 1588887759,
        "id": "fptajwz",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1588916559.0
    },
    {
        "author": "christhemix",
        "body": "SHAREholders would receive their SHARE of whatever microsoft is paying. so if its $5 million... divide that by the millions of shares, and u end up with probably a penny for each one",
        "created_utc": 1588981190,
        "id": "fpxemdn",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1589009990.0
    },
    {
        "author": "UniqueUsernamedotcom",
        "body": "I just put Microsoft in and it worked so I don't think it really matters",
        "created_utc": 1588878205,
        "id": "fpsr512",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1588907005.0
    },
    {
        "author": "ale632007",
        "body": " Here is the patent [https://patents.google.com/patent/US20180292654A1/en?q=Scanner-illuminated+LCOS](https://patents.google.com/patent/US20180292654A1/en?q=Scanner-illuminated+LCOS) owned by Microsoft and it is citing [https://patents.google.com/patent/US8837050B2/en?q=Scanner-illuminated+LCOS](https://patents.google.com/patent/US8837050B2/en?q=Scanner-illuminated+LCOS) which belongs to MVIS. \n\nSeems that Joshua M. Hudman (inventor of US8837050B2) went from MVIS to Microsoft around the time this patent was filled, 2011, but now he is at Valve (relevant? meh) The patent that got approved today, was filled on 2017 by MS and that is the only link I found, didn’t care to dig in more, so make of it what you will. To me it means nothing that a patent was approved, always takes a while for them to get approved AFAIK.",
        "created_utc": 1588711722,
        "id": "fplfdvn",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1588740522.0
    },
    {
        "author": "wigannotathletic",
        "body": "What's the deal with FAANG anyway? What's the point of a big tech acronym if it doesn't include MSFT",
        "created_utc": 1589346127,
        "id": "fqgh4dq",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1589374927.0
    },
    {
        "author": "JohnLouis24",
        "body": "So not putting words in your mouth: Amazon, Google, and Microsoft are entering a bidding war for MVIS. I’ll update y’all with my lambo customizations.",
        "created_utc": 1588649128,
        "id": "fpiuocj",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1588677928.0
    },
    {
        "author": "DARPA1191969v1",
        "body": "I can give the perspective from a tech/software dev.\n\nIn my opinion, these are sort of different players. In fact, I would say that NVDA and AMD are far more analogous to each other than even AMD -&gt; AAPL, and certainly to MSFT. The  way that I see it, NVDA/AMD are fundamentally companies that are concerned with producing a *physical good* \\- literal chipsets and dies. AAPL seems to waver on the hardware side of things (they have been known to go proprietary in that arena, but have also loaned out work to INTC on more than one occasion). I most certainly see MSFT as a true software/PaaS/SaaS company - suffice to say that they are producing very little in the way of physical goods.\n\nI think the *soft/hardware* direction is important to mention, because that fundamentally plays into the way that these companies deal in the market. Developing hardware is a mind-bendingly expensive process (relatively speaking). It takes years of R&amp;D and cash on hand to fund something that is truly great. An example of this would be the move AMD made to Zen (which is based on the concept of 'chiplets'; highly-scalable many-core designs that are fundamentally different from their monolithic predecessors).\n\nIn terms of growth, I would have to say that I see two viable options here: *NVDA and MSFT*. MSFT is pretty easy to explain; they create a product that fundamentally has lower upstart costs (software development's most expensive attribute is the cost of human labor) and lower maintenance costs (I would think). There is some movement towards a more data-center driven profit scheme (which would require boots on ground hardware en masse), and Azure is certainly an AWS competitor, but I think we've yet to see them really go full throttle on that (I think it could be big if they did).\n\nNVDA is a leader from a technological perspective. GPU compute-cores are very specialized devices that are good at doing only a few things, but very, *very well.* NVDA has been hammering away at this technology for years - they know the game, and they know where the money is. Autonomous cars, drones...the computer viz recogition software for postal, for literally anything, runs on a platform that is fundamentally a GPU (very high level view here). Machine learning applications in this field at the data-center level (think machine learning on AWS) are absolutely dominated by NVDA; In fact I would go as far as to say there aren't really a lot of competitors out there that are bringing to the table what NVDA does (Honestly AMD has severely gimped even their consumer dies at this point).\n\n&amp;#x200B;\n\nI can elaborate more, but I'd go with MSFT and NVDA on this one.",
        "created_utc": 1588630100,
        "id": "fphydh4",
        "score": 8,
        "subreddit": "investing",
        "created": 1588658900.0
    },
    {
        "author": "Howard_510",
        "body": "Wtf this is literally a replay of last Nov-Feb. We’ve had Tesla $1000c, MSFT $200c, AMD $60c and now SPCE $35c and BYND $120c all over again.\n\nAre we stuck in a simulation?",
        "created_utc": 1588721027,
        "id": "fplwvsn",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1588749827.0
    },
    {
        "author": "ByeHiSellLow",
        "body": "Someone in wsb accidentally sold MSFT shares on his robinhood and bought them back right away",
        "created_utc": 1589250307,
        "id": "fqc53vn",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1589279107.0
    },
    {
        "author": "isaac11117",
        "body": "Yeah the only reason zoom isn’t dead yet is because google and Microsoft are just getting started with it. Once they release a superior product at lower cost most of the businesses will switch from zoom. Zoom might still survive in the medium term(1-5 years) but it’ll definitely be losing market share every year.",
        "created_utc": 1589053311,
        "id": "fq26nvj",
        "score": 8,
        "subreddit": "stocks",
        "created": 1589082111.0
    },
    {
        "author": "keyokenx1017",
        "body": "So are we fomoing back into MVIS now? Microsoft is actually buying them out",
        "created_utc": 1588971497,
        "id": "fpwwz8a",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1589000297.0
    },
    {
        "author": "isaac11117",
        "body": "I put my name as Rory Gates and company as Microsoft",
        "created_utc": 1588885869,
        "id": "fpt6svc",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1588914669.0
    },
    {
        "author": "TheCandyMan25",
        "body": "I'm weary of any company that is so reliant on Apple. Apple's making all of their CPUs now, who's to say they won't start making other hardware? Obviously that's not a concern for QCOM until 2023 but just something to consider when these contracts are set to expire.",
        "created_utc": 1588704338,
        "id": "fpl0qer",
        "score": 2,
        "subreddit": "investing",
        "created": 1588733138.0
    },
    {
        "author": "MgliebMBA",
        "body": "XLNX vs QCOM leaps? which will do better?",
        "created_utc": 1588346730,
        "id": "fp66259",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588375530.0
    },
    {
        "author": "RawInquisitor",
        "body": "Positions:\n1. TSLA 805C/810C debit spread, 760P/765P debit spread.\nGot each spread for 2$ (8000$ worth) 30 mins before earnings release. TSLA usually has a big swing in one direction. I have always lost money on TSLA, so didn't want to take much risk here. Should have sold the call spread when it was at 850 but yeah well. Sold the put spread today for a slight profit. Phew. \n2. QCOM 79C/78P at 3.5$ (3500$ worth). QCOM was trading at 78.5 so I felt like this was a no brainer given that both QCOM and AAPL have their earnings (AAPL earnings usually affect QCOM). Both my options were down yesterday. But AAPL earnings pushed QCOM down and the 78P was ITM. Sold it at a slight loss.",
        "created_utc": 1588349969,
        "id": "fp6chff",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588378769.0
    },
    {
        "author": "moneyandbanking1",
        "body": "Bought QCOM calls 30 minutes before a downgrade AMA",
        "created_utc": 1588614583,
        "id": "fph419x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588643383.0
    },
    {
        "author": "HateIsAnArt",
        "body": "I have 5/22 LUV MGM and QCOM. I feel your pain.\n\nJust thankful I have some 5/8 puts and a 5/8 call on GLD",
        "created_utc": 1588598582,
        "id": "fpgalvw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588627382.0
    },
    {
        "author": "Broshawn",
        "body": "If there is any surge in vol, it will almost certainly be downward movement, TSLA looks a lot like QCOM in the tech bubble",
        "created_utc": 1588876263,
        "id": "fpsn3al",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588905063.0
    },
    {
        "author": "baseballbatupmyass",
        "body": "I did well with QCOM but after taking profits I switched over to the FIVG ETF.",
        "created_utc": 1588850708,
        "id": "fprd3mr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588879508.0
    },
    {
        "author": "SorrowsSkills",
        "body": "Care to give a quick description on each one?\n\nI'm especially interested to learn about HIMX, been looking for a great semiconductor company, what makes these guys better than say a qualcomm or Micron?",
        "created_utc": 1588827142,
        "id": "fpqnm73",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588855942.0
    },
    {
        "author": "Kilstar",
        "body": "SMH\n\nHere's their 25 holdings as of now:\n\n1\tTaiwan Semiconductor Manufacturing Co L\tTSM US\t3,797,828\t$201,778,601.64 \t12.05%\n2\tIntel Corp\tINTC US\t2,979,264\t$178,696,254.72 \t10.68%\n3\tNvidia Corp\tNVDA US\t426,343\t$124,611,532.04 \t7.44%\n4\tBroadcom Inc\tAVGO US\t309,923\t$84,181,285.26 \t5.03%\n5\tAsml Holding Nv\tASML US\t288,591\t$83,238,302.13 \t4.97%\n6\tTexas Instruments Inc\tTXN US\t715,786\t$83,081,281.02 \t4.96%\n7\tQualcomm Inc\tQCOM US\t1,021,613\t$80,370,294.71 \t4.80%\n8\tAnalog Devices Inc\tADI US\t726,726\t$79,649,169.60 \t4.76%\n9\tAdvanced Micro Devices Inc\tAMD US\t1,501,245\t$78,650,225.55 \t4.70%\n10\tMicron Technology Inc\tMU US\t1,569,263\t$75,152,005.07 \t4.49%\n11\tNxp Semiconductors Nv\tNXPI US\t671,859\t$66,897,000.63 \t4.00%\n12\tApplied Materials Inc\tAMAT US\t1,307,056\t$64,934,542.08 \t3.88%\n13\tLam Research Corp\tLRCX US\t247,995\t$63,308,163.60 \t3.78%\n14\tKla Corp\tKLAC US\t324,060\t$53,175,005.40 \t3.18%\n15\tXilinx Inc\tXLNX US\t582,414\t$50,902,983.60 \t3.04%\n16\tCadence Design Systems Inc\tCDNS US\t604,698\t$49,059,148.74 \t2.93%\n17\tStmicroelectronics Nv\tSTM US\t1,745,035\t$44,620,544.95 \t2.67%\n18\tSkyworks Solutions Inc\tSWKS US\t393,114\t$40,836,682.32 \t2.44%\n19\tMicrochip Technology Inc\tMCHP US\t451,468\t$39,607,287.64 \t2.37%\n20\tMaxim Integrated Products Inc\tMXIM US\t556,880\t$30,617,262.40 \t1.83%\n21\tMarvell Technology Group Ltd\tMRVL US\t999,064\t$26,714,971.36 \t1.60%\n22\tQorvo Inc\tQRVO US\t225,071\t$22,063,710.13 \t1.32%\n23\tTeradyne Inc\tTER US\t344,780\t$21,562,541.20 \t1.29%\n24\tUniversal Display Corp\tOLED US\t100,420\t$15,075,050.40 \t0.90%\n25\tOn Semiconductor Corp\tON US\t824,746\t$13,233,049.57 \t0.79%\n26\tOther/Cash\t\t0\t$1,889,767.67 \t0.11%",
        "created_utc": 1588432827,
        "id": "fp9r6ht",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588461627.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Great choice.  Nokia was having so many issues with their 5G rollout that they had to bring in Marvell to make their chips.\n\n[https://www.lightreading.com/5g/nokia-hires-marvell-to-fix-5g-problems/d/d-id/757984](https://www.lightreading.com/5g/nokia-hires-marvell-to-fix-5g-problems/d/d-id/757984)\n\nI am long on T, VZ, TMUS, QCOM, ABB, BB, MSFT, AMZN, TSLA, TSM, AMAT, ERIC for 5G.\n\nNokia might be a player in the 5G world, but they are currently in the worst shape of all of those stocks I just mentioned and keep messing up to the point that I'm not even sure I would see much return by investing in them.  Some of the biggest returns won't even be from the infrastructure, but the companies who will take advantage of the network to improve automation, autonomous driving, and all of the semiconductors, processors, and sensors that will power all of these innovations.",
        "created_utc": 1588861332,
        "id": "fprss0k",
        "score": 1,
        "subreddit": "investing",
        "created": 1588890132.0
    },
    {
        "author": "turello9",
        "body": "Qualcomm, Skyworks are good bets",
        "created_utc": 1588870188,
        "id": "fpsah50",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588898988.0
    },
    {
        "author": "savi9876",
        "body": "I would think there’s gonna be 2 big camps, Huawei and anti-Huawei. \n\nSo countries/companies going the anti-Huawei route will do Nokia and Ericsson. \n\nIs there really much info right now to differentiate Nokia &amp; Ericsson ? \n\nDo we really know much about 5G in general, it’s so early. \n\nFor the smartphone side rather than infrastructure it seems Qualcomm has a monopoly.",
        "created_utc": 1588839166,
        "id": "fpr1ljn",
        "score": 1,
        "subreddit": "investing",
        "created": 1588867966.0
    },
    {
        "author": "SorrowsSkills",
        "body": "&gt; DKNG or PENN as online sports betting becomes commonplace \n\nAre there any studies/statistics to show how fast this industry is growing? I'd love to educate myself in it. I've been looking into ERI, MGM, BOYD and Penn already but never really gave any attention to DKNG, Penns also probably been on the bottom of my list as well for gambling stocks, but I can definitely see the room for growth in online gambling via a phone in the future. \n\n&amp;#x200B;\n\n&gt;Looking for companies working 5G infrastructure as it pertains to cloud computing, as I think the future of consumer networks is wireless, with only larger commercial pipes needing to be hard\n\nI've been trying to find a good 5g play as well. Right now I'm looking into qualcomm and MU.\n\n&gt; I think Azure will win the cloud war for the majority of government and large caps so also looking for companies on the forward development side of that, especially in business intelligence, how it's used, etc. \n\nAnother industry I know nothing about haha. I'm looking to get into microsoft if we see another dip and I'm already invested in Amazon which is currently the leader in cloud. I know microsoft is much better at marketing their products to big caps though which will further their revenues a lot. From what I read earlier (on reddit to be fair..) is that as of right now Amazon undeniably has the better cloud services (apparently microsoft is slightly lacking in their quality) but microsoft has been making up for this with their hard line  marketing towards big caps so I can see that being beneficial for them too. I think everything cloud is going to be big in general, so investing in anyone doing cloud is a good investment in the long run probably. \n\nI'm also invested in Alibaba which is investing HEAVILY into their cloud service and will probably be the biggest cloud service in China and likely surrounding nations within their sphere of influence so I definitely think they're great as well.",
        "created_utc": 1588786730,
        "id": "fpolz2j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588815530.0
    },
    {
        "author": "Avaronah",
        "body": "What about QCOM?",
        "created_utc": 1588662070,
        "id": "fpjay57",
        "score": 1,
        "subreddit": "investing",
        "created": 1588690870.0
    },
    {
        "author": "Redknife11",
        "body": "Similar been buting QCOM and TMUS",
        "created_utc": 1588563746,
        "id": "fpf7mqz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588592546.0
    },
    {
        "author": "Lebronsweedman",
        "body": "Qualcomm sucks",
        "created_utc": 1588590705,
        "id": "fpg0wfu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588619505.0
    },
    {
        "author": "WSBankrupt",
        "body": "Bought more C and ABBV on discount on Fri.  Pretty stoked.  Next up is comms/5g.\n\nLooking at QCOM for SOC's and essentially a full RF solution, INTL + MRVL for base station chips and have NOK leaps.",
        "created_utc": 1588415514,
        "id": "fp95uwo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588444314.0
    },
    {
        "author": "WSBankrupt",
        "body": "I hope tech takes a hit today.  Want to get into QCOM and MRVL.",
        "created_utc": 1588549055,
        "id": "fpek1xz",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1588577855.0
    }
]