[
    {
        "author": "ImagineInfinity12345",
        "body": "Bizarrely, the ones with solid growth potential and a track reccord of earnings, but the ones people think this new age of tech stocks is going to displace. Question is, are they right. Take Paychex for example.",
        "created_utc": 1599251650,
        "id": "g41dzr6",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599280450.0
    },
    {
        "author": "Sir_Dink",
        "body": "&gt;ADP only releases private numbers it has.\n\nPretty much this.\n\nI don't know any small business owner who uses ADP. Mostly it's between Paychex and Square.\n\nThey likely have some way of extrapolating an estimate for the missing payroll data, but since covid effected small business payrolls disproportionately it likely messed up their method of divining the data they don't have.",
        "created_utc": 1599227703,
        "id": "g3zfr2x",
        "score": 1,
        "subreddit": "investing",
        "created": 1599256503.0
    },
    {
        "author": "UpSideofDown",
        "body": "Here’s my leaps shopping list:  COST, PAYX, PEP, JBHT, VZ, PYPL, SQ, PLD.  Sure bets looking at any of their charts...",
        "created_utc": 1599355924,
        "id": "g46vaul",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599384724.0
    },
    {
        "author": "Sir_Dink",
        "body": "&gt;Lots of places just straight closed and stopped running payroll but they didn't notify them of employee additions/subtractions.\n\nAtleast from experience with Paychex self service, some fees are related to current head count. It makes little sense to not inform 3rd party payroll services you furloughed all workers and closed.",
        "created_utc": 1599234722,
        "id": "g3zzi9v",
        "score": 1,
        "subreddit": "investing",
        "created": 1599263522.0
    },
    {
        "author": "BumbleFuckDuck",
        "body": "Article from link:\n\n\"Zomedica Pharmaceuticals Corp. (NYSE American: ZOM) announced today that it has agreed with its development partner Qorvo Biotechnologies, LLC, a wholly owned subsidiary of Qorvo US, Inc., to develop three new assays -- Cobalamin, cPL (canine Pancreatic Lipase), and Folate -- to target diagnosis of canine gastrointestinal issues. The new assays are in addition to the initial five assays currently under development, including panels for adrenal and thyroid testing, for TRUFORMA™, Zomedica's point-of-care veterinary diagnostic platform. The agreement to pursue development of the new assays has triggered the final $2 million milestone payment under Zomedica’s Development and Supply Agreement with Qorvo.\n\n“Our intent for TRUFORMA™ always has been to have it serve as a broad diagnostic point-of-care tool for dogs and cats and to continue to expand the diagnostic offerings available on the platform,\" said Robert Cohen, Interim Chief Executive Officer of Zomedica. \"We believe that the combination of the Cobalamin, cPL and Folate assays will enable veterinarians to use TRUFORMA to conduct a thorough testing panel to diagnose dogs in gastrointestinal distress.\"\n\nIf successfully developed, the Cobalamin, cPL, and Folate assays will represent what the Company believes is the first non-infectious gastrointestinal panel optimized for use in canines fully available at the point-of-care to facilitate rapid diagnosis of gastrointestinal disorders. Evaluation of the health of different components of the gastrointestinal system is necessary to identify the cause of clinical symptoms. This panel is intended to assay the function of the pancreas, proximal small intestine, and distal small intestine. The Company believes that the ability to conduct testing at the point-of-care will facilitate real-time clinical decision-making, reduce in-patient clinic stay, promote earlier detection and treatment, and increase pet owner satisfaction.\n\nAccording to a DVM360 study*, ASPCA Pet Insurance, Embrace, Nationwide, Pets Best and Trupanion agree that “GI condition” is the most common insurance claim for dogs. Signs of digestive system disease can include excessive drooling, diarrhea, constipation, vomiting or regurgitation, loss of appetite, bleeding, abdominal pain and bloating, straining to defecate, shock, and dehydration. The TRUFORMA diagnostic device, which is smaller than a desktop printer, is anticipated to provide highly sensitive, species-specific assays using Qorvo’s proprietary, non-optical Bulk Acoustic Wave (\"BAW\") sensor technology. The BAW sensor is a proven semiconductor technology used in telecommunications and aerospace markets. The Company believes that BAW technology has the potential to improve veterinary diagnostics by delivering reference laboratory accuracy and test performance to the veterinary clinic at the point-of-care.\"\n\nI bolded the important parts. This is a long hold regardless if r/s happens or does not. IMO the r/s ain't happening.",
        "created_utc": 1599597057,
        "id": "g4h6ce5",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599625857.0
    },
    {
        "author": "dudeitsadell",
        "body": "I'm actually bullish on semiconductors and feel like theyre the next sector to pop up... the last tech run in august was mostly cloud, aapl, tsla, internet services. Only NVDA and broadcom saw a slight bump. \n\nHardware like $QRVO, $QCOM, $INTC, $AMD, $SWKS, $WDC, $MU, $TSM has some ground to make up. The sector rotation cant go to airlines or financials, so Semis and Retail it is",
        "created_utc": 1599411634,
        "id": "g48x7zo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599440434.0
    }
]