[
    {
        "author": "BenHeisenbergPS2",
        "body": "I want this to have an impact on ENPH's ability to do business in the short term so they have an actual drop, I want to get more of their shares but so does everybody else lol.  Other than that, couple partners of theirs and a few other various ones, anything that's not ENPH I just want to diversify across the renewable energy sector.\n\nIf JKS somehow drops again (doubt it), buying more of them to wait for China to get around to realizing clean air is nice.\n\nAlso your username is kinda freaking me out lol",
        "created_utc": 1583102278,
        "id": "fj80cho",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583131078.0
    },
    {
        "author": "PhantomChihuahua",
        "body": "MCD \n\nENPH\n\nYUM \n\nYUMC \n\nLLY \n\nMCK \n\n\nWith the exception of ENPH, the rest haven’t grown much. Any growth stock recommendations?",
        "created_utc": 1583122502,
        "id": "fj8uehx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583151302.0
    },
    {
        "author": "TristanPowell",
        "body": "CDAY can't go wrong with payment processing as long as people are working that will have work to do. Not really that sexy tech stock that investors look for though. \n\nLSPD Awesome \n\nBB  I watch blackberry I like the new CEO but besides the name Blackberry is just kinda ehhhhh \n\nYa Canadian tech kinda sucks I move most of tech investing money into the US market but I try to be loyal Canadian so when Gems do pop up I do my research.",
        "created_utc": 1586624146,
        "id": "fn3nb32",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1586652946.0
    },
    {
        "author": "IFartWhenNerv0us",
        "body": "Cday, lspd, bb, shop\nTbh canadian tech sucks. The infra isnt there as much as usa",
        "created_utc": 1586623508,
        "id": "fn3m66q",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1586652308.0
    }
]