[
    {
        "author": "MementoMori97",
        "body": "I literally just added LRCX to my actual stock portfolio and now seeing it on WSB is making me scared",
        "created_utc": 1600268209,
        "id": "g5h5l1n",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600297009.0
    },
    {
        "author": "shashankssj3",
        "body": "AMAT/LRCX bounce incoming...been charting like a hawk. Just watch.",
        "created_utc": 1599779477,
        "id": "g4rmqen",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599808277.0
    },
    {
        "author": "dscg24",
        "body": "VMWare, Lam Research, Google\n\nAnyone have any thoughts on the three?",
        "created_utc": 1599959185,
        "id": "g50hmwc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599987985.0
    },
    {
        "author": "123random7",
        "body": "Looking at LRCX, KEYS, SHOP",
        "created_utc": 1599513499,
        "id": "g4dnvwr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599542299.0
    },
    {
        "author": "shashankssj3",
        "body": "Eyeing AMAT 9/18 60$ calls and LRCX 9/12 exp close to the money calls tomorrow. Ridiculously oversold and RSI at \\~30..love the charts on both for a nice bounce.",
        "created_utc": 1599714373,
        "id": "g4mjtgg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599743173.0
    },
    {
        "author": "discodropper",
        "body": "Pretty much everyone will list off some of the household names in big tech, like AAPL, MSFT, AMZN, ADBE, GOOGL, etc. All of these are industry leaders with solid financials, so they’re probably a safe bet for long-term growth. Though they may be overvalued right now (pretty much everything is). \n\nOther than those, within tech I tend to like semiconductors. I figure that cloud computing, AI, AR/VR, self-driving cars, fintech, bitcoin mining, smart phones and computers, etc. are just going to become a bigger and bigger part of the economy. And computer chips (CPUs, GPUs, SSDs, those chips in your credit card, etc.) are at the heart of all of these technologies. It’s pretty clear that technological progress here isn’t slowing, and demand for chips is just going to continue to grow. If you want to go with individual companies, NVDA, AMD, TSM, AMAT, MU, LRCX are all at the forefront right now, and have solid balance sheets. If you don’t want to put all your money on one horse, a non-diversified, semiconductor-focused ETF like SMH or SOXX will give you exposure here while mitigating some of the risk. \n\nGreen/clean energy is a promising market, but it’s a really young industry so there’s a lot of risk in trying to pick a winner. TSLA is ahead of the pack for now, but it’ll have competitors nipping at it’s heals soon enough, and the stock is currently way overvalued. There are also other sectors of this market that TSLA hasn’t tapped into, and could see massive growth in the next 5-15 years as we begin to wean off of fossil fuels. Again, a focused ETF like PBW or QCLN is a good way to mitigate risk and broaden exposure without having to pick a single winner. That said, this sector may be overvalued right now because oil/gas have taken a big hit during COVID and green energy isn’t quite ready for prime time. In other words, oil/gas are currently cheap and will probably rebound a bit Post-COVID, so you could make money with fossil fuels, but I’d stay out of them long-term and bet on clean energy/vehicles instead. \n\nI also like biotech and genomic medicine. TMO is a blue chip that basically has a monopoly and is a go-to for all biological research. Pretty safe bet on a well run company that’ll be around for years. LZAGY, RHHBY, and TECH are similar, but tend to have their hands in more clinical trials and drug development, mainly with small molecules and other ‘classic’ treatment methods. I’m sure there’s a good ETF in this sector, but I haven’t really looked as it’s my field. CRISPR, gene therapy, etc. are all starting to show promise in the clinic, but is a really nascent industry. MRNA and BNTX are probably overvalued right now due to COVID speculation, but if they can get their delivery mechanisms to work (and they’re showing promise), they’ll basically revolutionize medicine. Again, if you don’t want to bet on a single horse, ARKG is a good ETF for genomic medicine. TNX is a very young company that’s showing a lot of promise for sequencing technology, so high risk but potentially very high reward. \n\nOther than that, it’s always a good idea to put money into ‘boring’ non-risky, non-tech stocks. COST, WMT will probably be good picks during the coming economic crisis, and may actually be able to compete with AMZN if they shore up their online interface. V and MC are solid standbys (can’t go wrong with credit cards). Also probably a safe bet to go with health insurance companies. SPY is also a broadly diversified ETF (basically the tracks the S&amp;P) that will be a safe bet long-term.\n\nMy suggestion would be to pick industries you think will grow long-term, and select a few stocks or an ETF within them. Set up a rather diversified portfolio so you aren’t overexposed on any one front (I’ve lost more than the market with this last slump, for instance, since I’m overexposed in tech; I could probably use more ‘boring’ stocks like WMT). One or two shares apiece from 50 promising companies is a much safer bet than 500 shares in one or two very promising companies. Keep each at a smallish percentage of your total (I get really uncomfortable if a single stock goes above 10% of my total, even if it began as 1%, so I sell to bring it back down and use the profit to diversify). Generally speaking, the riskier the industry/company is, the lower percentage of your total it should be. \n\nHope this helps!",
        "created_utc": 1600163197,
        "id": "g5ca2if",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600191997.0
    },
    {
        "author": "Blackops_21",
        "body": "Generally I look for anything on my Watchlist that falls &gt;3.5% without a valid reason (offering new shares like AZEK or trade war implications regarding LRCX would keep me from buying those \"dips\").",
        "created_utc": 1600029388,
        "id": "g55r453",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1600058188.0
    },
    {
        "author": "mikesmcd",
        "body": "That $LRCX article from this morning has me hyped for some major gains coming up. That discount price, though.",
        "created_utc": 1600269281,
        "id": "g5h7orv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600298081.0
    },
    {
        "author": "commitpushdrink",
        "body": "I’ve had my eye on LRCX for a few months now and with tech doing what it’s doing I’m debating 10/23 or 7/16/21 calls slightly OTM.\n\nThey’re simply the best at what the do and what they do is about to see fucking WILD demand when people see how fast 5G really is.",
        "created_utc": 1599514810,
        "id": "g4dqgpq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599543610.0
    },
    {
        "author": "Redererer",
        "body": "LRCX &amp; AMAT are both long term holds for me.",
        "created_utc": 1599248279,
        "id": "g4147dr",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599277079.0
    },
    {
        "author": "DouglasAndrews",
        "body": "I was up 31% before close on 8/31 and I'm still up 24% y'all need to make better investments \n\nAAPL, RUN, NVDA, AMD, HASI, PYPL, ADBE, CRM, XYL, AY, AUG, NEE,CWEN, AGR, EQIX, ADSK, ATVI, PCY, LBRDK, PGR, LRCX, SPCE, ORCL, AMAT, STM, TT, INTC, ALL, ENIA, CWCO",
        "created_utc": 1599169728,
        "id": "g3wq65b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599198528.0
    },
    {
        "author": "mikesmcd",
        "body": "That $LRCX discount price though",
        "created_utc": 1600268361,
        "id": "g5h5vq1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600297161.0
    },
    {
        "author": "MementoMori97",
        "body": "LDOS, LRCX",
        "created_utc": 1600223201,
        "id": "g5fjd9g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600252001.0
    },
    {
        "author": "MementoMori97",
        "body": "23 years old, letting my Brokerage account grow until I'm ready to put a down payment on a house in a couple years.\n\nBrokerage account:\n\nITOT - 28%\n\nICLN - 15%\n\nWM - 12%\n\nV - 9%\n\nVZ - 9%\n\nBMRG - 9%\n\nLRCX - 9%\n\nCash - 9%\n\n(Will be looking to buy some more shares of ICLN, LRCX and WM next paycheck and add LDOS at around 9% of my portfolio.)\n\n\n\nRoth IRA:\n\nFOCPX (Fidelity OTC fund) - 40%\n\nFSMEX (Medical Technology fund) - 30% \n\nFBSOX (Select IT portfolio) - 20%\n\nFCPGX (Small/Medium Cap growth) - 10%",
        "created_utc": 1599955498,
        "id": "g505xgw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599984298.0
    },
    {
        "author": "dameLillardManiac",
        "body": "ELI5 for this SMIC news? Is my LRCX stock in danger?",
        "created_utc": 1599470874,
        "id": "g4bejkp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599499674.0
    },
    {
        "author": "Blackops_21",
        "body": "That's hilarious. Lam research is on hedge funds top 100 most bought list. Synnex has increased their revenue and earnings by wide margins each of the last 5 years. Do you even research things before you talk?",
        "created_utc": 1599219751,
        "id": "g3yyqxz",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599248551.0
    },
    {
        "author": "heartstesler",
        "body": "CRWD and all others look good and should move up from here\n\nI bought stocks of CRWD.\n\nInfact I bought lot of tech stocks on this dip including Apple Nvidia Tesla Microsoft MasterCard Docusign Lam research\n\nI will keep buying these tech stocks on dips",
        "created_utc": 1599518745,
        "id": "g4dx55d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599547545.0
    },
    {
        "author": "Trumpowell",
        "body": "Thoughts on $LRCX",
        "created_utc": 1599722515,
        "id": "g4mtnbl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599751315.0
    },
    {
        "author": "123random7",
        "body": "Watchlist -  LRCX  ( 5G ), BLK (Finance) , TWLO (Cloud), and SHOP (e-commerce) if you still feel like you want to diversify but otherwise double-down if there's large dip to DCA",
        "created_utc": 1599780594,
        "id": "g4rot2z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599809394.0
    },
    {
        "author": "Blackops_21",
        "body": "2017. Before I give you too much hope I've invested 13k total now lol so some was my own money. In reality I turned 13k into 23k. Using as much capital as possible to day trade one stock or a 3x ETF on perfect days where everything is going good, premarket is all green, futures are up big, like yesterday. Holding through earnings has worked in my favor quite a bit. Betting big on FB, LRCX, and ORLY when they were down.",
        "created_utc": 1599090794,
        "id": "g3scilb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599119594.0
    },
    {
        "author": "snyder810",
        "body": "1. MSFT\n2. AAPL\n3. FB or AMZN - buying right now I’d lean FB\n4. SQ\n5. MA\n6. Semiconductor of your choice - I like LRCX\n7. TDOC\n8. JPM - not a classic “boom” but banks look to have a large turnaround yet, I wouldn’t want to not have a banking play to catch some of that\n9. UNH - imo best in class healthcare play, if you want a higher risk profile pick a biotech you believe in that could take off instead. EX: BLUE\n10. LMT, HD, or CAT - not sexy, but steady growth and balance\n11. energy company of your choice - renewables look like the long term play, but Oil is likely to boom back in your 10 year horizon. If it were me I’d probably play a VLO or PSX to catch the boom and maybe hold in to a renewable turn\n\n12. Speculative tech play - a mid or small cap you believe in\n13. Speculative turnaround play - travel or entertainment category",
        "created_utc": 1599654930,
        "id": "g4jguuj",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599683730.0
    },
    {
        "author": "MP9",
        "body": "I've worked alongside LRCX and they are super efficient and demand high standard. Haven't seen very many companies like LRCX. They can be assholes to their suppliers though. You sort of have to be in some scenarios.",
        "created_utc": 1599656960,
        "id": "g4jjstf",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599685760.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "Amazon\nGoogle \nFacebook\nSalesforce \nV/ma\nLowes\nAmat/lrcx\nBaba\nJd\nPypl\n\nCheated with a few but I like the fin tech and semi equipment space for the near future and would rather pick a bundle then one winner.",
        "created_utc": 1599678868,
        "id": "g4kq2eu",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599707668.0
    },
    {
        "author": "123random7",
        "body": "Bought calls on LRCX",
        "created_utc": 1599698780,
        "id": "g4lts49",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599727580.0
    },
    {
        "author": "catarahbpus",
        "body": "26-year-old, long term investor. Let me know what you guys think or any suggestions!\n\nMSFT (20%)\nQCOM (18%)\nMU  (8.25%)\nLOW (7.5%)\nT (6.5%)\nWFC (5.8%)\nKO (5.5%)\nABBV (4.2%)\nLEVI (4.1%)\nAFL (4%)\nRTX (4%)\nDUK (3.5%)\nGOOGL(2.5%)\n\n\n 6% Cash\n\nBeen thinking of taking profits from some of these (MSFT/QCOM) Adding something like O, LRCX. DOCU/ARBE but on a weakness would be solid. Any other suggestions or thoughts on changes?",
        "created_utc": 1599053556,
        "id": "g3psrtu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599082356.0
    },
    {
        "author": "shashankssj3",
        "body": "$AMAT and $LRCX due for a bounce",
        "created_utc": 1599830856,
        "id": "g4tl41a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599859656.0
    },
    {
        "author": "catarahbpus",
        "body": "Honestly it just goes back to Warren Buffy, be fearful when people are greedy and greedy when people are fearful. Wanted to get LRCX yesterday at 338 but missed it and didn't want to pay the extra 5-8% now look! Down 341, and see what's in store tomorrow, more fear or greed. If it's fear I'm sitting with my cards in hand and looking what I need to add. Hell, I was holding flat this morning until 10am. No need to sell especially just to try and save some change to buy in lower.",
        "created_utc": 1599168495,
        "id": "g3wn7m6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599197295.0
    },
    {
        "author": "Trumpowell",
        "body": "Have you seen the new sanctions on Chinese semiconductor companies\n\nRIP to AMAT, LAM research",
        "created_utc": 1599631039,
        "id": "g4itfsn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599659839.0
    },
    {
        "author": "shashankssj3",
        "body": "Has the same exact chart as AMAT actually. Both LRCX and AMAT move in tangent",
        "created_utc": 1599710565,
        "id": "g4mekx5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599739365.0
    },
    {
        "author": "shashankssj3",
        "body": "LRCX and AMAT have same chart and same set up. Only going with AMAT cuz of the UOA",
        "created_utc": 1599740069,
        "id": "g4nx8a2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599768869.0
    },
    {
        "author": "shashankssj3",
        "body": "LRCX and AMAT",
        "created_utc": 1599742729,
        "id": "g4o54vn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599771529.0
    },
    {
        "author": "Summebride",
        "body": "Agree with LRCX.  It seems to have been unfairly punished in the last week.  Good for a trade at least.",
        "created_utc": 1599807571,
        "id": "g4svyao",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599836371.0
    },
    {
        "author": "UnpolishedPleb",
        "body": "Ah yes all the classic comments about the “tech bubble” and how everything is overvalued. Guess what... “tech” is literally a part of our daily lives now. \n\nIn the dotcom times it was all about lofty valuation on the possibility that tech would be the next big sector. Turns out many years later to actually be true and everyone is pissed off that they were wrong about doubting it. \n\nNow Apple, and Microsoft are literally at the top of the S&amp;P500 yet some people still cannot accept them because of P/E valuations and it’s logical but I think its hilarious how contradictory some of the statements can be. \n\nThese people talk about how its impossible to time the market or that past performance doesn’t indicate future performance yet there is one thing they are certain of. A tech bubble because of the tech bubble that happened 20 years ago. How can everyone be so certain these companies are overvalued when the sector has lead the market for the last 10 years. Maybe tech will fall back or maybe it will continue to outperform for another 10 years. We just don’t know. What’s certain is tech is not what it was 20 years ago and it will be interesting to see how it grows going forward. Those who say techs outperformance isn’t relevant just want to rationalize their bearish stance on tech IMO.  \n\nAll this said the tech sector is  broad and there are fairly valued solid companies out there with good balance sheets. TSM(P/E 27.4) and LRCX(P/E 20.9) are some I am interested in.",
        "created_utc": 1599439871,
        "id": "g4ab50d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599468671.0
    },
    {
        "author": "Redererer",
        "body": "I’ve been waiting on someone to mention LRCX on this sub forever.",
        "created_utc": 1599239004,
        "id": "g40bt6m",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599267804.0
    },
    {
        "author": "mikesmcd",
        "body": "My bets are on $LRCX. Time for some solid gains!",
        "created_utc": 1600269837,
        "id": "g5h8sof",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600298637.0
    },
    {
        "author": "Blackops_21",
        "body": "Sony, Synnex, Lam Research Corp, Teradyne, to name a couple",
        "created_utc": 1599191102,
        "id": "g3y16pg",
        "score": -1,
        "subreddit": "StockMarket",
        "created": 1599219902.0
    },
    {
        "author": "OfficerCollins",
        "body": "They already ruled (EDIT: ok not ruled, came to a conclusion) all four to be monopolies and are drafting their proposals for moving forward. They will likely not get broken up you are right about that. The breakup of ma bell was a failure beyond compare and some of the committee members were part of the antitrust probe. \n\nBezos directly admitted that if they broke up Amazon they would change nothing about the fundamentals of the company and that nothing about its business would change. \n\nI bet they just fine them a ton and make them pay their competitors like they did with Microsoft in the 90s and more recently with the labor antitrust suit where ed catmull got a slap on the wrist for leading a wage fixing ring and other crimes.",
        "created_utc": 1599024773,
        "id": "g3oql34",
        "score": 28,
        "subreddit": "investing",
        "created": 1599053573.0
    },
    {
        "author": "solidmussel",
        "body": "Buffet has tons of winners other than apple.\n\nVisa, Mastercard,  American express, verisign, Amazon,  costco, kroger. \n\nBut the biggest position by far is Apple at 134bn.  His whole portfolio is 260bn.  So that seems like a win",
        "created_utc": 1599015819,
        "id": "g3odfb3",
        "score": 10,
        "subreddit": "investing",
        "created": 1599044619.0
    },
    {
        "author": "lamewoodworker",
        "body": "Baba calls made me enough last week to get me a new cabinet table saw for my wood shop. Funny that I was able to get it from Alibaba. Thank Baba, I'm Jack to Ma tits for ANT ipo",
        "created_utc": 1599017962,
        "id": "g3oh08p",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599046762.0
    },
    {
        "author": "WolfOctober",
        "body": "The fact that you made this post signals to me that even your gut is telling you that it's risky to having an entirely tech portfolio. \n\nIt never hurts to diversify. \n\nDon't get me wrong, every company in your portfolio is doing well (even a meme stock like TSLA) right now but that could change very quickly (see TSLA). As one of the unlucky people who bought into the TSLA hype too late, I'm kicking myself.\n\nCan't hurt to throw some ETFs in there to mitigate risk and further diversify. Throw in some financial stocks and some of the bigger healthcare or retail players too while you're at it.\n\nVOO, ABT, COST, NKE, V, MA, PYPL, and HD have all treated me very well these past few months",
        "created_utc": 1599075637,
        "id": "g3rc9wz",
        "score": 8,
        "subreddit": "stocks",
        "created": 1599104437.0
    },
    {
        "author": "happyjackss48",
        "body": "[Look Ma', I'm retarded 🥴](https://imgur.com/a/5lfJlRq)",
        "created_utc": 1599167110,
        "id": "g3wjdm9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599195910.0
    },
    {
        "author": "Cocaineniggums",
        "body": "Jack Ma looks like a fucking retard",
        "created_utc": 1599077380,
        "id": "g3rh76f",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599106180.0
    },
    {
        "author": "m77w",
        "body": "Just got off the phone with Jack Ma\n\nsaid butt coin was gay and had three dicks in his mouth",
        "created_utc": 1598980108,
        "id": "g3m1usp",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599008908.0
    },
    {
        "author": "Panda_Pineapple",
        "body": "We’re 15% above the 50 day MA on the S&amp;P \n\nLast time it was this high, it was at 13% on June 10",
        "created_utc": 1599078279,
        "id": "g3rjpxl",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599107079.0
    },
    {
        "author": "orrangearrow",
        "body": "I think I'm starting to understand this market thing-a-ma-jigger. So when the markets go up, the VIX goes up. And when the market goes down, the VIX goes down. GOT IT!!!!  \n  \nNow that I got that figured out, I can go back to shoving marbles up my butt",
        "created_utc": 1599141906,
        "id": "g3uhkwt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599170706.0
    },
    {
        "author": "Wearahat02",
        "body": "I hold a lot of NVDA, it is my best performing stock\n\nI’m not sure what to expect from gaming revenues. While I’m personally excited and will be upgrading my pc at the earliest chance, I am not sure how their gaming revenues will be impacted.\n\nIf I put my investor cap on, NVDA should know that their new graphics card would be released in September which means next quarters results includes the sales of that card and future quarters.\n\nThey guided to 4.4bn revenue which would account for ampere release which is up from 3.86 this qtr. however I expected more from NVDA with a new graphics card and data center growth expectations. \n\nStill I think nvda is great even at this price\nIf they can eventually rake in 20bn annually, they’re not far off, at 65% margin and 4.5-5bn opex then they can achieve 8bn ebit not too far into the future\n\nthat’s 43 times pre tax earnings and I think their growth runway is long so that figure should come down over the years\n\nI would say even 50x-60x forward earnings is fine due to how expensive other companies are.\n\nI’m more optimistic on their growth than fang stocks and ma/v.\n\nYet ma is trading at almost 50 times and visa almost 40 times. Msft, aapl, fb and goog are approaching 40x\n\nNvda deserves the 100x",
        "created_utc": 1599030368,
        "id": "g3owrxa",
        "score": 4,
        "subreddit": "stocks",
        "created": 1599059168.0
    },
    {
        "author": "arigoldjr",
        "body": "I thought about that, but the timing is too off for it to make sense, unless they intend to halt trading for the rest of the day (which would be absurd). This is bigger, either an acquisition, financing or MA.",
        "created_utc": 1598979855,
        "id": "g3m13di",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1599008655.0
    },
    {
        "author": "omega_jankay",
        "body": "MasterCard",
        "created_utc": 1598982481,
        "id": "g3m8fc7",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1599011281.0
    },
    {
        "author": "cialonetc",
        "body": "Thoughts on Mastercard?",
        "created_utc": 1599101024,
        "id": "g3svnep",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599129824.0
    },
    {
        "author": "looster2018",
        "body": "I bought more big momentum tech leaders. Not even close to their 50 of 200 day MA.  3rd time buying NVDA. NEVER should have sold the previous 2 times. Arghh !  Live learn and get better at trading !",
        "created_utc": 1599158678,
        "id": "g3vulfm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599187478.0
    },
    {
        "author": "LeVraiLomepal",
        "body": "Je me souviens de chaque jour de ma vie 🚬",
        "created_utc": 1599099687,
        "id": "g3sta6d",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599128487.0
    },
    {
        "author": "J-Lam",
        "body": "Facebook started in MA.. can’t cuck the Zuck.",
        "created_utc": 1599112018,
        "id": "g3tcf41",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599140818.0
    },
    {
        "author": "ghathawayjunior",
        "body": "I was thinking of taking my SQ gains into MA or PYPL to have a less volatile position",
        "created_utc": 1599104754,
        "id": "g3t21lo",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599133554.0
    },
    {
        "author": "Shortcut_to_Infinity",
        "body": "Chimpu, where we gonna end the day ma bbay?",
        "created_utc": 1599147413,
        "id": "g3uxu0n",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599176213.0
    },
    {
        "author": "Xbsnguy",
        "body": "Spy is going to test 338 or 339 (its 200 day MA) at some point before this is over. It’s blown through everything else. 200 MA is critical support.",
        "created_utc": 1599159942,
        "id": "g3vy0hb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599188742.0
    },
    {
        "author": "nycgarbage",
        "body": "And then what? We push TSLA P/E ratios to 2000+? Lol... The market in June and the market today aren't even remotely similar. You just had a massive rotation/re-balancing of portfolios happen in the last 3 days. Index's are less tech weighted. Look at this board. Today just wiped a massive chunk of speculators fuel right out of the market. Poof. We had STIMULUS in June. The only thing that \"could\" happen is this market downturn could influence congress into passing the stimulus bill. There is a massive amount of ground to cover to the downside before we regain our 200 day MA. It's time to diversify, set stop losses or learn to use options as they were meant to be used as a fucking hedge.",
        "created_utc": 1599174748,
        "id": "g3x455q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599203548.0
    },
    {
        "author": "B_Bohn",
        "body": "TSLA macd 0, rsi 50, converging ma. Could go either way here!",
        "created_utc": 1599071351,
        "id": "g3r0suo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599100151.0
    },
    {
        "author": "chewks",
        "body": "ma nigga.",
        "created_utc": 1598998307,
        "id": "g3ndiwo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599027107.0
    },
    {
        "author": "sockalicious",
        "body": "Ma cow is a special autonomous region, they keep it udderly separated.\n\nSo the casinos there eat hay while the sun shines, no one can horn in on their business and they skim the cream off the top of the pail.",
        "created_utc": 1599020654,
        "id": "g3ol3kv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599049454.0
    },
    {
        "author": "Oggang1255",
        "body": "Nvidia, msft, fortinet, palo alto networks, Mastercard, Visa",
        "created_utc": 1599176648,
        "id": "g3x9u5s",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599205448.0
    },
    {
        "author": "Petrovich1999",
        "body": "Should be good support near 112 - 40 day ma and it’s a price after last earnings. Don’t believe it will go down more. But if you hold calls from the top you are most likely fucked as it will consolidate for a while imo",
        "created_utc": 1599179082,
        "id": "g3xg0a3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599207882.0
    },
    {
        "author": "B_Bohn",
        "body": "Only if ur ma sits on it",
        "created_utc": 1599066281,
        "id": "g3qnqdi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599095081.0
    },
    {
        "author": "oilers169",
        "body": "My opinion MA has more growth potential, but V is safer growth.",
        "created_utc": 1599107068,
        "id": "g3t5sjw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599135868.0
    },
    {
        "author": "Cicero1982",
        "body": "MA in military history., BA in political science. Took more math and economic courses than a history student should take 🤣.",
        "created_utc": 1599174692,
        "id": "g3x3z0m",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1599203492.0
    },
    {
        "author": "Smitehz",
        "body": "A few things. The unemployment announcement was better than expected which hurts the argument for another stimulus round.  \n\nSPY hit the 200 day Bollinger band top (+2.5 SD above the 200 MA) which is too high (this in itself doesn't always cause a pull back but it definitely can). \n\nTrump tweeted about how good things are so the MM moved money out to help argue for more stimulus money.  (this won't last long cause equities besides tesla are the best place to keep money right now) \n\nGoogle may be in for an antitrust suit.",
        "created_utc": 1599185984,
        "id": "g3xsjki",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599214784.0
    },
    {
        "author": "polychris",
        "body": "bounced off the 20-day MA. If we cross that tomorrow will be ugly.",
        "created_utc": 1599181103,
        "id": "g3xjpnh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599209903.0
    },
    {
        "author": "cnbPEE",
        "body": "Stashing leaps on em booiiiiiiii thats ma MOVE",
        "created_utc": 1599011721,
        "id": "g3o649n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599040521.0
    },
    {
        "author": "R4N7",
        "body": "First of all 30k-&gt;100k within 5-10 years is unreal goal. (Market historical return is 7%/year)\n\nI would go:\n66% into VOO/SPY, 33% cash (you will need it for future DCA’s or if good stocks dips)\n\nGood stocks for me = strong blue chips (MSFT, AAPL, JPM,  JNJ, V, MA etc)",
        "created_utc": 1598955140,
        "id": "g3kkmfv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598983940.0
    },
    {
        "author": "haasvacado",
        "body": "I bought more AAPL calls. 136c 9/4.\n\nSuck Ma Nuts, ya fucknards.",
        "created_utc": 1599140097,
        "id": "g3ucnxh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599168897.0
    },
    {
        "author": "nordmys",
        "body": "SPY approaching 100 million in volume, when was the last time that happened? It's probably closing right at the 15 day MA",
        "created_utc": 1599158665,
        "id": "g3vuk7g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599187465.0
    },
    {
        "author": "2ndzero",
        "body": "Visa and Mastercard could use more love. Especially Visa",
        "created_utc": 1599159901,
        "id": "g3vxwmk",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599188701.0
    },
    {
        "author": "svgscrewball",
        "body": "During majior market corrections, like in March, even safe stocks get hit. Many safe stocks take longer to recover, like WM. Your best bet would have been to add to WM when it was down a bunch. MSFT, AMZN, MA, V, QQQ, VOO are my core holdings. Many of my dividend holdings are not doing nearly as well as my growth stuff but that is ok, I got them for the div and not the growth.",
        "created_utc": 1599098838,
        "id": "g3srs6q",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599127638.0
    },
    {
        "author": "svgscrewball",
        "body": "Even many non tech stocks are overvalued at this point but here are some securities to look at:   \n\nHealth   \n-  ABMD   \n-  VHT &lt;--- ETF     \n\nConsumer Cyclical   \n-  SBUX  \n-  AAP    \n-  DG   \n-  PEP   \n-  VCR &lt;-- ETF    \n   \nFinancial   \n-  JPM   \n-  MA   \n-  V",
        "created_utc": 1599085569,
        "id": "g3s0sq0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599114369.0
    },
    {
        "author": "the-og-beppe",
        "body": "Ancora ci provate con il classico schema ponzi del cazzo? Mio dio ragazzi ma vivete sotto un sasso?",
        "created_utc": 1599180173,
        "id": "g3xi180",
        "score": 2,
        "subreddit": "investing",
        "created": 1599208973.0
    },
    {
        "author": "CannonballUnder26",
        "body": "I’d propose two case studies for a general idea: Ma Bell and Microsoft IE. With Ma Bell, they split the company into several regional baby bells. I think you could possibly see this happen with Amazon and Facebook, but I think it’s unlikely to happen to the others. Anyway, this action was not catastrophic for the telecom sector. If anything, the breakup of the monopoly enabled innovation and increased the TAM of telecom companies. If it was just Ma Bell in town, think how long they would’ve resisted DSL or cable internet and tried to keep us all on dialup.\n\n\nWith IE, the problem was that they used their platform (Windows) to monopolize the browser space. I think there’s an extremely compelling case to argue that Google and Apple will be in trouble with this and be forced to spin off their app stores, but this will not cripple them — the vast majority of revenue does not come from App Store monopolies. Microsoft stock has been on a rampage since then, as well.\n\nTLDR: long term investors should not fear antitrust action under current regulations.",
        "created_utc": 1599070479,
        "id": "g3qylif",
        "score": 2,
        "subreddit": "investing",
        "created": 1599099279.0
    },
    {
        "author": "lost_in_life_34",
        "body": "people throw the word monopoly around today, but they don't really understand it. Historical monopolies have not only had the vast majority of market share in their primary market, but they used it to get market share and control other markets.\n\n&amp;#x200B;\n\nThe oil trust captured the majority of market share in drilling, refining and sales. and I forgot what else they had control of. AT&amp;T controlled over 90% of the local and long distance and phone markets until the 80's and locked out DSL, fax and other disruptive tech for years. When I had Ma Bell service we had to walk like 2 miles to the store and buy or rent their phone and no other phones were available or would work. not like today.\n\n&amp;#x200B;\n\napple, amazon and Facebook aren't monopolies by the historical definition . MS had over 90% of the desktop OS market and used it to capture majority shares in the server OS, applications and office applications and was kind of a monopoly. but by the time the court cases finished they were losing their control and so it was unlike historical monopolies.",
        "created_utc": 1599060341,
        "id": "g3q8niy",
        "score": 1,
        "subreddit": "investing",
        "created": 1599089141.0
    },
    {
        "author": "Bard_17",
        "body": "MA is my next must by stock, can't wait until I get some money flowing in",
        "created_utc": 1599073549,
        "id": "g3r6k2r",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599102349.0
    },
    {
        "author": "Petrovich1999",
        "body": "Yeah, simple TA also says back to the channel support and 20 day MA. Could dip below channel trend (280) but in this case should get bought the fuck out quickly",
        "created_utc": 1599179865,
        "id": "g3xhg3c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599208665.0
    },
    {
        "author": "ncredibles",
        "body": "When you look at the 20, 50, 100, 200 ma, do you usually only look at it with weekly candles?",
        "created_utc": 1599181606,
        "id": "g3xklxj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599210406.0
    },
    {
        "author": "Arctic_Snowfox",
        "body": "Hey thanks, not familiar with RH at all. I don’t need a bunch of fancy indicators, just candle sticks, ma, sma and rsi. Does RH have those?",
        "created_utc": 1599155052,
        "id": "g3vj5ab",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599183852.0
    },
    {
        "author": "Packletico",
        "body": "Seems as if most tech has bounched on MA 50",
        "created_utc": 1599162586,
        "id": "g3w5zdy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599191386.0
    },
    {
        "author": "DenverNuggetz",
        "body": "I believe (based on the AT&amp;T/ma bell break up a few decades back) it would do a stock split into several different companies according to sector and each new companies stock performance would vary wildly.\n\nEdit: just found this that explains what happened there; https://bimajority.org/~wollman/t.html",
        "created_utc": 1599172523,
        "id": "g3wxph6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599201323.0
    },
    {
        "author": "CamarosAndCannabis",
        "body": "It can swing big. Stop loss should be slightly below the 8 MA imo",
        "created_utc": 1598956585,
        "id": "g3km035",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598985385.0
    },
    {
        "author": "01Cloud01",
        "body": "Id wait till it gets closer to its 10 day MA then use a limit order to buy in.... I like them long term...",
        "created_utc": 1599117439,
        "id": "g3tib4j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599146239.0
    },
    {
        "author": "Scutterbum",
        "body": "&gt;the market runs on algorithms now.\n\nDo the algorithms not follow the same sort of technical indicators? Just in an automated fashion. For example, moves above the 50 day MA  = buy etc.\n\nOr is it pure black box AI trading.",
        "created_utc": 1599145075,
        "id": "g3uqn7q",
        "score": 1,
        "subreddit": "investing",
        "created": 1599173875.0
    },
    {
        "author": "sodenj5",
        "body": "MA down 4% because SELL EVERYTHING",
        "created_utc": 1599146329,
        "id": "g3uugsm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599175129.0
    },
    {
        "author": "MrSamsonite",
        "body": "That's not right - 200 day MA is 308. Are you looking at a different time scale?",
        "created_utc": 1599160150,
        "id": "g3vyjb8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599188950.0
    },
    {
        "author": "iamjt",
        "body": "There's the fucking 20 day MA on both dow and S&amp;P. Fucking line is so magical I got rekt by it many times. \n\n\nAt least it's not using it for the V.",
        "created_utc": 1599174927,
        "id": "g3x4v09",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599203727.0
    },
    {
        "author": "laken906",
        "body": "343 is 20 day MA, I think we touch that",
        "created_utc": 1599151987,
        "id": "g3varwb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599180787.0
    },
    {
        "author": "FrenchFriesAreSalad",
        "body": "yellow is 20 day EMA, white is 180 MA",
        "created_utc": 1599152814,
        "id": "g3vcuwv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599181614.0
    },
    {
        "author": "broneilbro",
        "body": "Many of the slow and dumb ALGOs use the 50/200 MA even the stock fuckboys at CNBC use it. \n\nGot a little further to go...\n\nRemember many RH gamblers don't know that Big Money can make money when the stonks go up and down.",
        "created_utc": 1599158268,
        "id": "g3vt9r9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599187068.0
    },
    {
        "author": "svgscrewball",
        "body": "-  MSFT   \n-  AMZN   \n-  V   \n-  MA   \n-  AVGO   \n-  TDG",
        "created_utc": 1599090370,
        "id": "g3sbhze",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599119170.0
    },
    {
        "author": "TAWS",
        "body": "VIX just went above the 50 day MA. Last time it did that was in Feb right before March crash",
        "created_utc": 1599039389,
        "id": "g3p7s65",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599068189.0
    },
    {
        "author": "0xy98",
        "body": "I ma glad I’m watching all this meme here on WSB not as trader nor investor. \nHere just to have fun!",
        "created_utc": 1599050968,
        "id": "g3pnb8s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599079768.0
    },
    {
        "author": "OfficerTenBagger",
        "body": "Going to give Jack Ma an RKO if he doesnt turn this around now!",
        "created_utc": 1599056943,
        "id": "g3q0hea",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599085743.0
    },
    {
        "author": "475563",
        "body": "Yep and V, MA, AMZN, FB and the GOOGs holding the market.",
        "created_utc": 1599060682,
        "id": "g3q9ibl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599089482.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Absolutely, offloading such a fund during a correction/crash should be taken into consideration.  I have been in TQQQ for only about 3 months now and decided beforehand that I would sell out below the 100-day MA.\n\nI also only devote 5% of my portfolio to TQQQ, so even if it implodes on me I will still sleep easily at night.",
        "created_utc": 1598976825,
        "id": "g3lsetq",
        "score": 1,
        "subreddit": "investing",
        "created": 1599005625.0
    },
    {
        "author": "Shaun80",
        "body": "Wow what a great day , up big across the board except MA for some reason. Finally caved and bought 25 shares of Tesla at 475",
        "created_utc": 1598999723,
        "id": "g3ngfnw",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599028523.0
    },
    {
        "author": "Shaun8030",
        "body": "Bought measly  25 shares of Tsla at 475 today fomo got the best of me I am.guilty .\nPortfolio now\nApple \nMSFT \nGOOG\nAmzn \nSq \nMa \nV \nTsla \nTSM \nNvidia \nBaba \nFB \nAmd (caved as well month ago ) \nPypl \nAdbe \nVgt \nQQQ\nWcld \nXntk \nArkw \nIgv \nFdn \n\nThinking of adding NFLX as analysts have upgraded the target price . Am I missing anything",
        "created_utc": 1599001420,
        "id": "g3nju4e",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599030220.0
    },
    {
        "author": "geekiowa",
        "body": "I moved 5% to VXX today. Looks like it might move above its 200 MA.  And election results will provide some volatility to sell it higher.  \n\nOr have some cash 5 to 10% on the sideline to gobble up stocks if they drop.  It will be short lived if see a 3 to 10% correction. \n\nAnd like others have said, diversify. Not all will drop like a rock. Metals &amp; miners are a good play too.",
        "created_utc": 1599001776,
        "id": "g3nkn80",
        "score": 1,
        "subreddit": "investing",
        "created": 1599030576.0
    },
    {
        "author": "peterinjapan",
        "body": "AAPL 11% (sold off a little yesterday, might sell more since so many of my other holdings also hold it)\n\nXOUT 10% (this is an ETF that tries to choose the best 250 stocks of SPY)\n\nSTOR 7.3% (picked up some shares during the crisis, holding in my IRA)\n\nDGRO 4.7% (this is a dividend growth fund like VIG or NOBL, which has been underperforming lately)\n\nMA 4.6%\n\nGOOG 4.5%\n\nHACAX 4.5% (this is a growth mutual fund that's killed it for the past 10 years, I'd consider selling but for the taxes)\n\nFB 3.6%\n\nTGT 3.5% (this was damn lucky to be holding this year)\n\nVUG 2.9% (a nice growth fund I am moving more money to)\n\nLMT 2.2%\n\nDISN 2.2%\n\nDAL 1.9% (stupidly didn't sell in February)\n\nXLY 1.8%\n\nVNQ 1.6%\n\nABBV 1.5%\n\nVEEV $1.45%\n\nQQQ 1.3% (started accumulating late)\n\n&amp;#x200B;\n\nAny feedback? Trying to teach myself charts and trend following and not make the same old damn mistakes as I've always done in the past.",
        "created_utc": 1599118919,
        "id": "g3tjqrx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599147719.0
    },
    {
        "author": "menatarms",
        "body": "QQQ down 4.32%, NASDAQ down 4.72%\n\nyet DDOG only down 4.22%.  Yet....its sitting below its 50 day MA and 21 day EMA and dogshit RSI of 42\n\ndoes it have incredible retard strength?  was it oversold to start with?  or is it being held up before a huge leg down to the 150 day EMA?\n\nreally not sure how to read this one.",
        "created_utc": 1599156389,
        "id": "g3vn9o7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599185189.0
    },
    {
        "author": "2ndzero",
        "body": "Visa and Mastercard for me",
        "created_utc": 1599149511,
        "id": "g3v3zio",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599178311.0
    },
    {
        "author": "nbladen",
        "body": "Earnings gaps usually lead to continuation right away or pull back to 10 day MA and consolidate and move higher for the following weeks months. Look at AAPL,TSLA,FB, this quarter and TWLO, FSLY ,PTON last quarter. None of them went down substantially and are still rising. Wait for ZM to consolidate then get calls.",
        "created_utc": 1599088681,
        "id": "g3s7lef",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599117481.0
    },
    {
        "author": "jlomohocob",
        "body": "It shows 114 for 200 ma for me",
        "created_utc": 1599172306,
        "id": "g3wx69d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599201106.0
    },
    {
        "author": "The_estimator_is_in",
        "body": "&gt;I can’t find a single helpful post about stocks testing resistance or approaching new lows.\n\n345\n\nIntraday low today\n\n340\n\n50 MA around 331.70\n\nBasement is around 320\n\n&gt;I’m looking online to find some hidden opportunities during a potential pullback\n\nWatch for a pullback to spread to areas beyond QQQ\n\nBut that's no fun, so just watch all the $ROPE calls",
        "created_utc": 1599190530,
        "id": "g3y09ie",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599219330.0
    },
    {
        "author": "Shaun8030",
        "body": "Low interest rates , institutional and retail fomo equals tech soaring . If you are into e commerce and fintech  baba , amzn , JD , shop , sq , PayPal and ma are worth a look",
        "created_utc": 1598960688,
        "id": "g3kqh2u",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1598989488.0
    },
    {
        "author": "cranial_pudding",
        "body": "Pretty glad I didn't pull the trigger on MA FD's, was pretty close after seeing what V did at 930\n\nStrike/exp? I bet you'll be okay if they're not like 20% OTM expiring on 9/4",
        "created_utc": 1598975958,
        "id": "g3lq4tt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599004758.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "If you were following the guidelines outlined by the OP, you would have sold out of the leveraged fund once the underlying fund went below the 200-day MA.\n\nNo one is putting a gun to your head and telling you to HODL leveraged ETFs when the market is shitting itself.",
        "created_utc": 1598975727,
        "id": "g3lpiuf",
        "score": 1,
        "subreddit": "investing",
        "created": 1599004527.0
    },
    {
        "author": "Not99Percent",
        "body": "NVDA, AAPL, MA, V, AMZN, FB and a lot in the mix but not TSLA",
        "created_utc": 1599054579,
        "id": "g3pv1m6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599083379.0
    },
    {
        "author": "investortrade",
        "body": "Big biotech blue chip like AZN. Maybe some LOW. And some MA and V would be good. They’re not going anywhere.",
        "created_utc": 1598991617,
        "id": "g3mxfb5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599020417.0
    },
    {
        "author": "475563",
        "body": "AMZN, V, MA, DIS, FB and both GOOGs",
        "created_utc": 1599063143,
        "id": "g3qfmjo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599091943.0
    },
    {
        "author": "cranial_pudding",
        "body": "V straight vertical while MA fucks around red\n\nMA calls?",
        "created_utc": 1598967755,
        "id": "g3l4hfl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996555.0
    },
    {
        "author": "kicktheminthecaballs",
        "body": "Whats a MA? sorry, I'm new",
        "created_utc": 1598981022,
        "id": "g3m4dl7",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1599009822.0
    },
    {
        "author": "aorta89",
        "body": "AAPL 1/21/2022 200c \nFB 11/20 280c\nNVDA 9/11 510c\nNVDA 10/02 585c\nMA 11/20 365c\nMSFT 9/25 230c\nQQQ 10/02 299c\nSPY 9/14 353c",
        "created_utc": 1599100174,
        "id": "g3su4sf",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1599128974.0
    },
    {
        "author": "OfficerCollins",
        "body": "They already ruled (EDIT: ok not ruled, came to a conclusion) all four to be monopolies and are drafting their proposals for moving forward. They will likely not get broken up you are right about that. The breakup of ma bell was a failure beyond compare and some of the committee members were part of the antitrust probe. \n\nBezos directly admitted that if they broke up Amazon they would change nothing about the fundamentals of the company and that nothing about its business would change. \n\nI bet they just fine them a ton and make them pay their competitors like they did with Microsoft in the 90s and more recently with the labor antitrust suit where ed catmull got a slap on the wrist for leading a wage fixing ring and other crimes.",
        "created_utc": 1599024773,
        "id": "g3oql34",
        "score": 28,
        "subreddit": "investing",
        "created": 1599053573.0
    },
    {
        "author": "solidmussel",
        "body": "Buffet has tons of winners other than apple.\n\nVisa, Mastercard,  American express, verisign, Amazon,  costco, kroger. \n\nBut the biggest position by far is Apple at 134bn.  His whole portfolio is 260bn.  So that seems like a win",
        "created_utc": 1599015819,
        "id": "g3odfb3",
        "score": 10,
        "subreddit": "investing",
        "created": 1599044619.0
    },
    {
        "author": "lamewoodworker",
        "body": "Baba calls made me enough last week to get me a new cabinet table saw for my wood shop. Funny that I was able to get it from Alibaba. Thank Baba, I'm Jack to Ma tits for ANT ipo",
        "created_utc": 1599017962,
        "id": "g3oh08p",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599046762.0
    },
    {
        "author": "m77w",
        "body": "Just got off the phone with Jack Ma\n\nsaid butt coin was gay and had three dicks in his mouth",
        "created_utc": 1598980108,
        "id": "g3m1usp",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599008908.0
    },
    {
        "author": "Wearahat02",
        "body": "I hold a lot of NVDA, it is my best performing stock\n\nI’m not sure what to expect from gaming revenues. While I’m personally excited and will be upgrading my pc at the earliest chance, I am not sure how their gaming revenues will be impacted.\n\nIf I put my investor cap on, NVDA should know that their new graphics card would be released in September which means next quarters results includes the sales of that card and future quarters.\n\nThey guided to 4.4bn revenue which would account for ampere release which is up from 3.86 this qtr. however I expected more from NVDA with a new graphics card and data center growth expectations. \n\nStill I think nvda is great even at this price\nIf they can eventually rake in 20bn annually, they’re not far off, at 65% margin and 4.5-5bn opex then they can achieve 8bn ebit not too far into the future\n\nthat’s 43 times pre tax earnings and I think their growth runway is long so that figure should come down over the years\n\nI would say even 50x-60x forward earnings is fine due to how expensive other companies are.\n\nI’m more optimistic on their growth than fang stocks and ma/v.\n\nYet ma is trading at almost 50 times and visa almost 40 times. Msft, aapl, fb and goog are approaching 40x\n\nNvda deserves the 100x",
        "created_utc": 1599030368,
        "id": "g3owrxa",
        "score": 4,
        "subreddit": "stocks",
        "created": 1599059168.0
    },
    {
        "author": "arigoldjr",
        "body": "I thought about that, but the timing is too off for it to make sense, unless they intend to halt trading for the rest of the day (which would be absurd). This is bigger, either an acquisition, financing or MA.",
        "created_utc": 1598979855,
        "id": "g3m13di",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1599008655.0
    },
    {
        "author": "omega_jankay",
        "body": "MasterCard",
        "created_utc": 1598982481,
        "id": "g3m8fc7",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1599011281.0
    },
    {
        "author": "chewks",
        "body": "ma nigga.",
        "created_utc": 1598998307,
        "id": "g3ndiwo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599027107.0
    },
    {
        "author": "sockalicious",
        "body": "Ma cow is a special autonomous region, they keep it udderly separated.\n\nSo the casinos there eat hay while the sun shines, no one can horn in on their business and they skim the cream off the top of the pail.",
        "created_utc": 1599020654,
        "id": "g3ol3kv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599049454.0
    },
    {
        "author": "B_Bohn",
        "body": "Only if ur ma sits on it",
        "created_utc": 1599066281,
        "id": "g3qnqdi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599095081.0
    },
    {
        "author": "cnbPEE",
        "body": "Stashing leaps on em booiiiiiiii thats ma MOVE",
        "created_utc": 1599011721,
        "id": "g3o649n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599040521.0
    },
    {
        "author": "R4N7",
        "body": "First of all 30k-&gt;100k within 5-10 years is unreal goal. (Market historical return is 7%/year)\n\nI would go:\n66% into VOO/SPY, 33% cash (you will need it for future DCA’s or if good stocks dips)\n\nGood stocks for me = strong blue chips (MSFT, AAPL, JPM,  JNJ, V, MA etc)",
        "created_utc": 1598955140,
        "id": "g3kkmfv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598983940.0
    },
    {
        "author": "CannonballUnder26",
        "body": "I’d propose two case studies for a general idea: Ma Bell and Microsoft IE. With Ma Bell, they split the company into several regional baby bells. I think you could possibly see this happen with Amazon and Facebook, but I think it’s unlikely to happen to the others. Anyway, this action was not catastrophic for the telecom sector. If anything, the breakup of the monopoly enabled innovation and increased the TAM of telecom companies. If it was just Ma Bell in town, think how long they would’ve resisted DSL or cable internet and tried to keep us all on dialup.\n\n\nWith IE, the problem was that they used their platform (Windows) to monopolize the browser space. I think there’s an extremely compelling case to argue that Google and Apple will be in trouble with this and be forced to spin off their app stores, but this will not cripple them — the vast majority of revenue does not come from App Store monopolies. Microsoft stock has been on a rampage since then, as well.\n\nTLDR: long term investors should not fear antitrust action under current regulations.",
        "created_utc": 1599070479,
        "id": "g3qylif",
        "score": 2,
        "subreddit": "investing",
        "created": 1599099279.0
    },
    {
        "author": "lost_in_life_34",
        "body": "people throw the word monopoly around today, but they don't really understand it. Historical monopolies have not only had the vast majority of market share in their primary market, but they used it to get market share and control other markets.\n\n&amp;#x200B;\n\nThe oil trust captured the majority of market share in drilling, refining and sales. and I forgot what else they had control of. AT&amp;T controlled over 90% of the local and long distance and phone markets until the 80's and locked out DSL, fax and other disruptive tech for years. When I had Ma Bell service we had to walk like 2 miles to the store and buy or rent their phone and no other phones were available or would work. not like today.\n\n&amp;#x200B;\n\napple, amazon and Facebook aren't monopolies by the historical definition . MS had over 90% of the desktop OS market and used it to capture majority shares in the server OS, applications and office applications and was kind of a monopoly. but by the time the court cases finished they were losing their control and so it was unlike historical monopolies.",
        "created_utc": 1599060341,
        "id": "g3q8niy",
        "score": 1,
        "subreddit": "investing",
        "created": 1599089141.0
    },
    {
        "author": "CamarosAndCannabis",
        "body": "It can swing big. Stop loss should be slightly below the 8 MA imo",
        "created_utc": 1598956585,
        "id": "g3km035",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598985385.0
    },
    {
        "author": "TAWS",
        "body": "VIX just went above the 50 day MA. Last time it did that was in Feb right before March crash",
        "created_utc": 1599039389,
        "id": "g3p7s65",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599068189.0
    },
    {
        "author": "0xy98",
        "body": "I ma glad I’m watching all this meme here on WSB not as trader nor investor. \nHere just to have fun!",
        "created_utc": 1599050968,
        "id": "g3pnb8s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599079768.0
    },
    {
        "author": "OfficerTenBagger",
        "body": "Going to give Jack Ma an RKO if he doesnt turn this around now!",
        "created_utc": 1599056943,
        "id": "g3q0hea",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599085743.0
    },
    {
        "author": "475563",
        "body": "Yep and V, MA, AMZN, FB and the GOOGs holding the market.",
        "created_utc": 1599060682,
        "id": "g3q9ibl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599089482.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Absolutely, offloading such a fund during a correction/crash should be taken into consideration.  I have been in TQQQ for only about 3 months now and decided beforehand that I would sell out below the 100-day MA.\n\nI also only devote 5% of my portfolio to TQQQ, so even if it implodes on me I will still sleep easily at night.",
        "created_utc": 1598976825,
        "id": "g3lsetq",
        "score": 1,
        "subreddit": "investing",
        "created": 1599005625.0
    },
    {
        "author": "Shaun80",
        "body": "Wow what a great day , up big across the board except MA for some reason. Finally caved and bought 25 shares of Tesla at 475",
        "created_utc": 1598999723,
        "id": "g3ngfnw",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599028523.0
    },
    {
        "author": "Shaun8030",
        "body": "Bought measly  25 shares of Tsla at 475 today fomo got the best of me I am.guilty .\nPortfolio now\nApple \nMSFT \nGOOG\nAmzn \nSq \nMa \nV \nTsla \nTSM \nNvidia \nBaba \nFB \nAmd (caved as well month ago ) \nPypl \nAdbe \nVgt \nQQQ\nWcld \nXntk \nArkw \nIgv \nFdn \n\nThinking of adding NFLX as analysts have upgraded the target price . Am I missing anything",
        "created_utc": 1599001420,
        "id": "g3nju4e",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599030220.0
    },
    {
        "author": "geekiowa",
        "body": "I moved 5% to VXX today. Looks like it might move above its 200 MA.  And election results will provide some volatility to sell it higher.  \n\nOr have some cash 5 to 10% on the sideline to gobble up stocks if they drop.  It will be short lived if see a 3 to 10% correction. \n\nAnd like others have said, diversify. Not all will drop like a rock. Metals &amp; miners are a good play too.",
        "created_utc": 1599001776,
        "id": "g3nkn80",
        "score": 1,
        "subreddit": "investing",
        "created": 1599030576.0
    },
    {
        "author": "Shaun8030",
        "body": "Low interest rates , institutional and retail fomo equals tech soaring . If you are into e commerce and fintech  baba , amzn , JD , shop , sq , PayPal and ma are worth a look",
        "created_utc": 1598960688,
        "id": "g3kqh2u",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1598989488.0
    },
    {
        "author": "cranial_pudding",
        "body": "Pretty glad I didn't pull the trigger on MA FD's, was pretty close after seeing what V did at 930\n\nStrike/exp? I bet you'll be okay if they're not like 20% OTM expiring on 9/4",
        "created_utc": 1598975958,
        "id": "g3lq4tt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599004758.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "If you were following the guidelines outlined by the OP, you would have sold out of the leveraged fund once the underlying fund went below the 200-day MA.\n\nNo one is putting a gun to your head and telling you to HODL leveraged ETFs when the market is shitting itself.",
        "created_utc": 1598975727,
        "id": "g3lpiuf",
        "score": 1,
        "subreddit": "investing",
        "created": 1599004527.0
    },
    {
        "author": "Not99Percent",
        "body": "NVDA, AAPL, MA, V, AMZN, FB and a lot in the mix but not TSLA",
        "created_utc": 1599054579,
        "id": "g3pv1m6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599083379.0
    },
    {
        "author": "investortrade",
        "body": "Big biotech blue chip like AZN. Maybe some LOW. And some MA and V would be good. They’re not going anywhere.",
        "created_utc": 1598991617,
        "id": "g3mxfb5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599020417.0
    },
    {
        "author": "475563",
        "body": "AMZN, V, MA, DIS, FB and both GOOGs",
        "created_utc": 1599063143,
        "id": "g3qfmjo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599091943.0
    },
    {
        "author": "cranial_pudding",
        "body": "V straight vertical while MA fucks around red\n\nMA calls?",
        "created_utc": 1598967755,
        "id": "g3l4hfl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996555.0
    },
    {
        "author": "kicktheminthecaballs",
        "body": "Whats a MA? sorry, I'm new",
        "created_utc": 1598981022,
        "id": "g3m4dl7",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1599009822.0
    },
    {
        "author": "OfficerCollins",
        "body": "They already ruled (EDIT: ok not ruled, came to a conclusion) all four to be monopolies and are drafting their proposals for moving forward. They will likely not get broken up you are right about that. The breakup of ma bell was a failure beyond compare and some of the committee members were part of the antitrust probe. \n\nBezos directly admitted that if they broke up Amazon they would change nothing about the fundamentals of the company and that nothing about its business would change. \n\nI bet they just fine them a ton and make them pay their competitors like they did with Microsoft in the 90s and more recently with the labor antitrust suit where ed catmull got a slap on the wrist for leading a wage fixing ring and other crimes.",
        "created_utc": 1599024773,
        "id": "g3oql34",
        "score": 28,
        "subreddit": "investing",
        "created": 1599053573.0
    },
    {
        "author": "solidmussel",
        "body": "Buffet has tons of winners other than apple.\n\nVisa, Mastercard,  American express, verisign, Amazon,  costco, kroger. \n\nBut the biggest position by far is Apple at 134bn.  His whole portfolio is 260bn.  So that seems like a win",
        "created_utc": 1599015819,
        "id": "g3odfb3",
        "score": 10,
        "subreddit": "investing",
        "created": 1599044619.0
    },
    {
        "author": "lamewoodworker",
        "body": "Baba calls made me enough last week to get me a new cabinet table saw for my wood shop. Funny that I was able to get it from Alibaba. Thank Baba, I'm Jack to Ma tits for ANT ipo",
        "created_utc": 1599017962,
        "id": "g3oh08p",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599046762.0
    },
    {
        "author": "WolfOctober",
        "body": "The fact that you made this post signals to me that even your gut is telling you that it's risky to having an entirely tech portfolio. \n\nIt never hurts to diversify. \n\nDon't get me wrong, every company in your portfolio is doing well (even a meme stock like TSLA) right now but that could change very quickly (see TSLA). As one of the unlucky people who bought into the TSLA hype too late, I'm kicking myself.\n\nCan't hurt to throw some ETFs in there to mitigate risk and further diversify. Throw in some financial stocks and some of the bigger healthcare or retail players too while you're at it.\n\nVOO, ABT, COST, NKE, V, MA, PYPL, and HD have all treated me very well these past few months",
        "created_utc": 1599075637,
        "id": "g3rc9wz",
        "score": 8,
        "subreddit": "stocks",
        "created": 1599104437.0
    },
    {
        "author": "happyjackss48",
        "body": "[Look Ma', I'm retarded 🥴](https://imgur.com/a/5lfJlRq)",
        "created_utc": 1599167110,
        "id": "g3wjdm9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599195910.0
    },
    {
        "author": "Cocaineniggums",
        "body": "Jack Ma looks like a fucking retard",
        "created_utc": 1599077380,
        "id": "g3rh76f",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599106180.0
    },
    {
        "author": "m77w",
        "body": "Just got off the phone with Jack Ma\n\nsaid butt coin was gay and had three dicks in his mouth",
        "created_utc": 1598980108,
        "id": "g3m1usp",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599008908.0
    },
    {
        "author": "Panda_Pineapple",
        "body": "We’re 15% above the 50 day MA on the S&amp;P \n\nLast time it was this high, it was at 13% on June 10",
        "created_utc": 1599078279,
        "id": "g3rjpxl",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599107079.0
    },
    {
        "author": "orrangearrow",
        "body": "I think I'm starting to understand this market thing-a-ma-jigger. So when the markets go up, the VIX goes up. And when the market goes down, the VIX goes down. GOT IT!!!!  \n  \nNow that I got that figured out, I can go back to shoving marbles up my butt",
        "created_utc": 1599141906,
        "id": "g3uhkwt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599170706.0
    },
    {
        "author": "Wearahat02",
        "body": "I hold a lot of NVDA, it is my best performing stock\n\nI’m not sure what to expect from gaming revenues. While I’m personally excited and will be upgrading my pc at the earliest chance, I am not sure how their gaming revenues will be impacted.\n\nIf I put my investor cap on, NVDA should know that their new graphics card would be released in September which means next quarters results includes the sales of that card and future quarters.\n\nThey guided to 4.4bn revenue which would account for ampere release which is up from 3.86 this qtr. however I expected more from NVDA with a new graphics card and data center growth expectations. \n\nStill I think nvda is great even at this price\nIf they can eventually rake in 20bn annually, they’re not far off, at 65% margin and 4.5-5bn opex then they can achieve 8bn ebit not too far into the future\n\nthat’s 43 times pre tax earnings and I think their growth runway is long so that figure should come down over the years\n\nI would say even 50x-60x forward earnings is fine due to how expensive other companies are.\n\nI’m more optimistic on their growth than fang stocks and ma/v.\n\nYet ma is trading at almost 50 times and visa almost 40 times. Msft, aapl, fb and goog are approaching 40x\n\nNvda deserves the 100x",
        "created_utc": 1599030368,
        "id": "g3owrxa",
        "score": 4,
        "subreddit": "stocks",
        "created": 1599059168.0
    },
    {
        "author": "arigoldjr",
        "body": "I thought about that, but the timing is too off for it to make sense, unless they intend to halt trading for the rest of the day (which would be absurd). This is bigger, either an acquisition, financing or MA.",
        "created_utc": 1598979855,
        "id": "g3m13di",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1599008655.0
    },
    {
        "author": "omega_jankay",
        "body": "MasterCard",
        "created_utc": 1598982481,
        "id": "g3m8fc7",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1599011281.0
    },
    {
        "author": "cialonetc",
        "body": "Thoughts on Mastercard?",
        "created_utc": 1599101024,
        "id": "g3svnep",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599129824.0
    },
    {
        "author": "looster2018",
        "body": "I bought more big momentum tech leaders. Not even close to their 50 of 200 day MA.  3rd time buying NVDA. NEVER should have sold the previous 2 times. Arghh !  Live learn and get better at trading !",
        "created_utc": 1599158678,
        "id": "g3vulfm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599187478.0
    },
    {
        "author": "LeVraiLomepal",
        "body": "Je me souviens de chaque jour de ma vie 🚬",
        "created_utc": 1599099687,
        "id": "g3sta6d",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599128487.0
    },
    {
        "author": "J-Lam",
        "body": "Facebook started in MA.. can’t cuck the Zuck.",
        "created_utc": 1599112018,
        "id": "g3tcf41",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599140818.0
    },
    {
        "author": "ghathawayjunior",
        "body": "I was thinking of taking my SQ gains into MA or PYPL to have a less volatile position",
        "created_utc": 1599104754,
        "id": "g3t21lo",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599133554.0
    },
    {
        "author": "Shortcut_to_Infinity",
        "body": "Chimpu, where we gonna end the day ma bbay?",
        "created_utc": 1599147413,
        "id": "g3uxu0n",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599176213.0
    },
    {
        "author": "Xbsnguy",
        "body": "Spy is going to test 338 or 339 (its 200 day MA) at some point before this is over. It’s blown through everything else. 200 MA is critical support.",
        "created_utc": 1599159942,
        "id": "g3vy0hb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599188742.0
    },
    {
        "author": "nycgarbage",
        "body": "And then what? We push TSLA P/E ratios to 2000+? Lol... The market in June and the market today aren't even remotely similar. You just had a massive rotation/re-balancing of portfolios happen in the last 3 days. Index's are less tech weighted. Look at this board. Today just wiped a massive chunk of speculators fuel right out of the market. Poof. We had STIMULUS in June. The only thing that \"could\" happen is this market downturn could influence congress into passing the stimulus bill. There is a massive amount of ground to cover to the downside before we regain our 200 day MA. It's time to diversify, set stop losses or learn to use options as they were meant to be used as a fucking hedge.",
        "created_utc": 1599174748,
        "id": "g3x455q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599203548.0
    },
    {
        "author": "B_Bohn",
        "body": "TSLA macd 0, rsi 50, converging ma. Could go either way here!",
        "created_utc": 1599071351,
        "id": "g3r0suo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599100151.0
    },
    {
        "author": "chewks",
        "body": "ma nigga.",
        "created_utc": 1598998307,
        "id": "g3ndiwo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599027107.0
    },
    {
        "author": "sockalicious",
        "body": "Ma cow is a special autonomous region, they keep it udderly separated.\n\nSo the casinos there eat hay while the sun shines, no one can horn in on their business and they skim the cream off the top of the pail.",
        "created_utc": 1599020654,
        "id": "g3ol3kv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599049454.0
    },
    {
        "author": "Oggang1255",
        "body": "Nvidia, msft, fortinet, palo alto networks, Mastercard, Visa",
        "created_utc": 1599176648,
        "id": "g3x9u5s",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599205448.0
    },
    {
        "author": "Petrovich1999",
        "body": "Should be good support near 112 - 40 day ma and it’s a price after last earnings. Don’t believe it will go down more. But if you hold calls from the top you are most likely fucked as it will consolidate for a while imo",
        "created_utc": 1599179082,
        "id": "g3xg0a3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599207882.0
    },
    {
        "author": "B_Bohn",
        "body": "Only if ur ma sits on it",
        "created_utc": 1599066281,
        "id": "g3qnqdi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599095081.0
    },
    {
        "author": "oilers169",
        "body": "My opinion MA has more growth potential, but V is safer growth.",
        "created_utc": 1599107068,
        "id": "g3t5sjw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599135868.0
    },
    {
        "author": "Cicero1982",
        "body": "MA in military history., BA in political science. Took more math and economic courses than a history student should take 🤣.",
        "created_utc": 1599174692,
        "id": "g3x3z0m",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1599203492.0
    },
    {
        "author": "Smitehz",
        "body": "A few things. The unemployment announcement was better than expected which hurts the argument for another stimulus round.  \n\nSPY hit the 200 day Bollinger band top (+2.5 SD above the 200 MA) which is too high (this in itself doesn't always cause a pull back but it definitely can). \n\nTrump tweeted about how good things are so the MM moved money out to help argue for more stimulus money.  (this won't last long cause equities besides tesla are the best place to keep money right now) \n\nGoogle may be in for an antitrust suit.",
        "created_utc": 1599185984,
        "id": "g3xsjki",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599214784.0
    },
    {
        "author": "polychris",
        "body": "bounced off the 20-day MA. If we cross that tomorrow will be ugly.",
        "created_utc": 1599181103,
        "id": "g3xjpnh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599209903.0
    },
    {
        "author": "cnbPEE",
        "body": "Stashing leaps on em booiiiiiiii thats ma MOVE",
        "created_utc": 1599011721,
        "id": "g3o649n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599040521.0
    },
    {
        "author": "R4N7",
        "body": "First of all 30k-&gt;100k within 5-10 years is unreal goal. (Market historical return is 7%/year)\n\nI would go:\n66% into VOO/SPY, 33% cash (you will need it for future DCA’s or if good stocks dips)\n\nGood stocks for me = strong blue chips (MSFT, AAPL, JPM,  JNJ, V, MA etc)",
        "created_utc": 1598955140,
        "id": "g3kkmfv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598983940.0
    },
    {
        "author": "haasvacado",
        "body": "I bought more AAPL calls. 136c 9/4.\n\nSuck Ma Nuts, ya fucknards.",
        "created_utc": 1599140097,
        "id": "g3ucnxh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599168897.0
    },
    {
        "author": "nordmys",
        "body": "SPY approaching 100 million in volume, when was the last time that happened? It's probably closing right at the 15 day MA",
        "created_utc": 1599158665,
        "id": "g3vuk7g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599187465.0
    },
    {
        "author": "2ndzero",
        "body": "Visa and Mastercard could use more love. Especially Visa",
        "created_utc": 1599159901,
        "id": "g3vxwmk",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599188701.0
    },
    {
        "author": "svgscrewball",
        "body": "During majior market corrections, like in March, even safe stocks get hit. Many safe stocks take longer to recover, like WM. Your best bet would have been to add to WM when it was down a bunch. MSFT, AMZN, MA, V, QQQ, VOO are my core holdings. Many of my dividend holdings are not doing nearly as well as my growth stuff but that is ok, I got them for the div and not the growth.",
        "created_utc": 1599098838,
        "id": "g3srs6q",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599127638.0
    },
    {
        "author": "svgscrewball",
        "body": "Even many non tech stocks are overvalued at this point but here are some securities to look at:   \n\nHealth   \n-  ABMD   \n-  VHT &lt;--- ETF     \n\nConsumer Cyclical   \n-  SBUX  \n-  AAP    \n-  DG   \n-  PEP   \n-  VCR &lt;-- ETF    \n   \nFinancial   \n-  JPM   \n-  MA   \n-  V",
        "created_utc": 1599085569,
        "id": "g3s0sq0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599114369.0
    },
    {
        "author": "the-og-beppe",
        "body": "Ancora ci provate con il classico schema ponzi del cazzo? Mio dio ragazzi ma vivete sotto un sasso?",
        "created_utc": 1599180173,
        "id": "g3xi180",
        "score": 2,
        "subreddit": "investing",
        "created": 1599208973.0
    },
    {
        "author": "CannonballUnder26",
        "body": "I’d propose two case studies for a general idea: Ma Bell and Microsoft IE. With Ma Bell, they split the company into several regional baby bells. I think you could possibly see this happen with Amazon and Facebook, but I think it’s unlikely to happen to the others. Anyway, this action was not catastrophic for the telecom sector. If anything, the breakup of the monopoly enabled innovation and increased the TAM of telecom companies. If it was just Ma Bell in town, think how long they would’ve resisted DSL or cable internet and tried to keep us all on dialup.\n\n\nWith IE, the problem was that they used their platform (Windows) to monopolize the browser space. I think there’s an extremely compelling case to argue that Google and Apple will be in trouble with this and be forced to spin off their app stores, but this will not cripple them — the vast majority of revenue does not come from App Store monopolies. Microsoft stock has been on a rampage since then, as well.\n\nTLDR: long term investors should not fear antitrust action under current regulations.",
        "created_utc": 1599070479,
        "id": "g3qylif",
        "score": 2,
        "subreddit": "investing",
        "created": 1599099279.0
    },
    {
        "author": "lost_in_life_34",
        "body": "people throw the word monopoly around today, but they don't really understand it. Historical monopolies have not only had the vast majority of market share in their primary market, but they used it to get market share and control other markets.\n\n&amp;#x200B;\n\nThe oil trust captured the majority of market share in drilling, refining and sales. and I forgot what else they had control of. AT&amp;T controlled over 90% of the local and long distance and phone markets until the 80's and locked out DSL, fax and other disruptive tech for years. When I had Ma Bell service we had to walk like 2 miles to the store and buy or rent their phone and no other phones were available or would work. not like today.\n\n&amp;#x200B;\n\napple, amazon and Facebook aren't monopolies by the historical definition . MS had over 90% of the desktop OS market and used it to capture majority shares in the server OS, applications and office applications and was kind of a monopoly. but by the time the court cases finished they were losing their control and so it was unlike historical monopolies.",
        "created_utc": 1599060341,
        "id": "g3q8niy",
        "score": 1,
        "subreddit": "investing",
        "created": 1599089141.0
    },
    {
        "author": "Bard_17",
        "body": "MA is my next must by stock, can't wait until I get some money flowing in",
        "created_utc": 1599073549,
        "id": "g3r6k2r",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599102349.0
    },
    {
        "author": "Petrovich1999",
        "body": "Yeah, simple TA also says back to the channel support and 20 day MA. Could dip below channel trend (280) but in this case should get bought the fuck out quickly",
        "created_utc": 1599179865,
        "id": "g3xhg3c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599208665.0
    },
    {
        "author": "ncredibles",
        "body": "When you look at the 20, 50, 100, 200 ma, do you usually only look at it with weekly candles?",
        "created_utc": 1599181606,
        "id": "g3xklxj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599210406.0
    },
    {
        "author": "Arctic_Snowfox",
        "body": "Hey thanks, not familiar with RH at all. I don’t need a bunch of fancy indicators, just candle sticks, ma, sma and rsi. Does RH have those?",
        "created_utc": 1599155052,
        "id": "g3vj5ab",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599183852.0
    },
    {
        "author": "Packletico",
        "body": "Seems as if most tech has bounched on MA 50",
        "created_utc": 1599162586,
        "id": "g3w5zdy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599191386.0
    },
    {
        "author": "DenverNuggetz",
        "body": "I believe (based on the AT&amp;T/ma bell break up a few decades back) it would do a stock split into several different companies according to sector and each new companies stock performance would vary wildly.\n\nEdit: just found this that explains what happened there; https://bimajority.org/~wollman/t.html",
        "created_utc": 1599172523,
        "id": "g3wxph6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599201323.0
    },
    {
        "author": "CamarosAndCannabis",
        "body": "It can swing big. Stop loss should be slightly below the 8 MA imo",
        "created_utc": 1598956585,
        "id": "g3km035",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598985385.0
    },
    {
        "author": "01Cloud01",
        "body": "Id wait till it gets closer to its 10 day MA then use a limit order to buy in.... I like them long term...",
        "created_utc": 1599117439,
        "id": "g3tib4j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599146239.0
    },
    {
        "author": "Scutterbum",
        "body": "&gt;the market runs on algorithms now.\n\nDo the algorithms not follow the same sort of technical indicators? Just in an automated fashion. For example, moves above the 50 day MA  = buy etc.\n\nOr is it pure black box AI trading.",
        "created_utc": 1599145075,
        "id": "g3uqn7q",
        "score": 1,
        "subreddit": "investing",
        "created": 1599173875.0
    },
    {
        "author": "sodenj5",
        "body": "MA down 4% because SELL EVERYTHING",
        "created_utc": 1599146329,
        "id": "g3uugsm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599175129.0
    },
    {
        "author": "MrSamsonite",
        "body": "That's not right - 200 day MA is 308. Are you looking at a different time scale?",
        "created_utc": 1599160150,
        "id": "g3vyjb8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599188950.0
    },
    {
        "author": "iamjt",
        "body": "There's the fucking 20 day MA on both dow and S&amp;P. Fucking line is so magical I got rekt by it many times. \n\n\nAt least it's not using it for the V.",
        "created_utc": 1599174927,
        "id": "g3x4v09",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599203727.0
    },
    {
        "author": "laken906",
        "body": "343 is 20 day MA, I think we touch that",
        "created_utc": 1599151987,
        "id": "g3varwb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599180787.0
    },
    {
        "author": "FrenchFriesAreSalad",
        "body": "yellow is 20 day EMA, white is 180 MA",
        "created_utc": 1599152814,
        "id": "g3vcuwv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599181614.0
    },
    {
        "author": "broneilbro",
        "body": "Many of the slow and dumb ALGOs use the 50/200 MA even the stock fuckboys at CNBC use it. \n\nGot a little further to go...\n\nRemember many RH gamblers don't know that Big Money can make money when the stonks go up and down.",
        "created_utc": 1599158268,
        "id": "g3vt9r9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599187068.0
    },
    {
        "author": "svgscrewball",
        "body": "-  MSFT   \n-  AMZN   \n-  V   \n-  MA   \n-  AVGO   \n-  TDG",
        "created_utc": 1599090370,
        "id": "g3sbhze",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599119170.0
    },
    {
        "author": "TAWS",
        "body": "VIX just went above the 50 day MA. Last time it did that was in Feb right before March crash",
        "created_utc": 1599039389,
        "id": "g3p7s65",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599068189.0
    },
    {
        "author": "0xy98",
        "body": "I ma glad I’m watching all this meme here on WSB not as trader nor investor. \nHere just to have fun!",
        "created_utc": 1599050968,
        "id": "g3pnb8s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599079768.0
    },
    {
        "author": "OfficerTenBagger",
        "body": "Going to give Jack Ma an RKO if he doesnt turn this around now!",
        "created_utc": 1599056943,
        "id": "g3q0hea",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599085743.0
    },
    {
        "author": "475563",
        "body": "Yep and V, MA, AMZN, FB and the GOOGs holding the market.",
        "created_utc": 1599060682,
        "id": "g3q9ibl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599089482.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Absolutely, offloading such a fund during a correction/crash should be taken into consideration.  I have been in TQQQ for only about 3 months now and decided beforehand that I would sell out below the 100-day MA.\n\nI also only devote 5% of my portfolio to TQQQ, so even if it implodes on me I will still sleep easily at night.",
        "created_utc": 1598976825,
        "id": "g3lsetq",
        "score": 1,
        "subreddit": "investing",
        "created": 1599005625.0
    },
    {
        "author": "Shaun80",
        "body": "Wow what a great day , up big across the board except MA for some reason. Finally caved and bought 25 shares of Tesla at 475",
        "created_utc": 1598999723,
        "id": "g3ngfnw",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599028523.0
    },
    {
        "author": "Shaun8030",
        "body": "Bought measly  25 shares of Tsla at 475 today fomo got the best of me I am.guilty .\nPortfolio now\nApple \nMSFT \nGOOG\nAmzn \nSq \nMa \nV \nTsla \nTSM \nNvidia \nBaba \nFB \nAmd (caved as well month ago ) \nPypl \nAdbe \nVgt \nQQQ\nWcld \nXntk \nArkw \nIgv \nFdn \n\nThinking of adding NFLX as analysts have upgraded the target price . Am I missing anything",
        "created_utc": 1599001420,
        "id": "g3nju4e",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599030220.0
    },
    {
        "author": "geekiowa",
        "body": "I moved 5% to VXX today. Looks like it might move above its 200 MA.  And election results will provide some volatility to sell it higher.  \n\nOr have some cash 5 to 10% on the sideline to gobble up stocks if they drop.  It will be short lived if see a 3 to 10% correction. \n\nAnd like others have said, diversify. Not all will drop like a rock. Metals &amp; miners are a good play too.",
        "created_utc": 1599001776,
        "id": "g3nkn80",
        "score": 1,
        "subreddit": "investing",
        "created": 1599030576.0
    },
    {
        "author": "peterinjapan",
        "body": "AAPL 11% (sold off a little yesterday, might sell more since so many of my other holdings also hold it)\n\nXOUT 10% (this is an ETF that tries to choose the best 250 stocks of SPY)\n\nSTOR 7.3% (picked up some shares during the crisis, holding in my IRA)\n\nDGRO 4.7% (this is a dividend growth fund like VIG or NOBL, which has been underperforming lately)\n\nMA 4.6%\n\nGOOG 4.5%\n\nHACAX 4.5% (this is a growth mutual fund that's killed it for the past 10 years, I'd consider selling but for the taxes)\n\nFB 3.6%\n\nTGT 3.5% (this was damn lucky to be holding this year)\n\nVUG 2.9% (a nice growth fund I am moving more money to)\n\nLMT 2.2%\n\nDISN 2.2%\n\nDAL 1.9% (stupidly didn't sell in February)\n\nXLY 1.8%\n\nVNQ 1.6%\n\nABBV 1.5%\n\nVEEV $1.45%\n\nQQQ 1.3% (started accumulating late)\n\n&amp;#x200B;\n\nAny feedback? Trying to teach myself charts and trend following and not make the same old damn mistakes as I've always done in the past.",
        "created_utc": 1599118919,
        "id": "g3tjqrx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599147719.0
    },
    {
        "author": "menatarms",
        "body": "QQQ down 4.32%, NASDAQ down 4.72%\n\nyet DDOG only down 4.22%.  Yet....its sitting below its 50 day MA and 21 day EMA and dogshit RSI of 42\n\ndoes it have incredible retard strength?  was it oversold to start with?  or is it being held up before a huge leg down to the 150 day EMA?\n\nreally not sure how to read this one.",
        "created_utc": 1599156389,
        "id": "g3vn9o7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599185189.0
    },
    {
        "author": "2ndzero",
        "body": "Visa and Mastercard for me",
        "created_utc": 1599149511,
        "id": "g3v3zio",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599178311.0
    },
    {
        "author": "nbladen",
        "body": "Earnings gaps usually lead to continuation right away or pull back to 10 day MA and consolidate and move higher for the following weeks months. Look at AAPL,TSLA,FB, this quarter and TWLO, FSLY ,PTON last quarter. None of them went down substantially and are still rising. Wait for ZM to consolidate then get calls.",
        "created_utc": 1599088681,
        "id": "g3s7lef",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599117481.0
    },
    {
        "author": "jlomohocob",
        "body": "It shows 114 for 200 ma for me",
        "created_utc": 1599172306,
        "id": "g3wx69d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599201106.0
    },
    {
        "author": "The_estimator_is_in",
        "body": "&gt;I can’t find a single helpful post about stocks testing resistance or approaching new lows.\n\n345\n\nIntraday low today\n\n340\n\n50 MA around 331.70\n\nBasement is around 320\n\n&gt;I’m looking online to find some hidden opportunities during a potential pullback\n\nWatch for a pullback to spread to areas beyond QQQ\n\nBut that's no fun, so just watch all the $ROPE calls",
        "created_utc": 1599190530,
        "id": "g3y09ie",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599219330.0
    },
    {
        "author": "Shaun8030",
        "body": "Low interest rates , institutional and retail fomo equals tech soaring . If you are into e commerce and fintech  baba , amzn , JD , shop , sq , PayPal and ma are worth a look",
        "created_utc": 1598960688,
        "id": "g3kqh2u",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1598989488.0
    },
    {
        "author": "cranial_pudding",
        "body": "Pretty glad I didn't pull the trigger on MA FD's, was pretty close after seeing what V did at 930\n\nStrike/exp? I bet you'll be okay if they're not like 20% OTM expiring on 9/4",
        "created_utc": 1598975958,
        "id": "g3lq4tt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599004758.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "If you were following the guidelines outlined by the OP, you would have sold out of the leveraged fund once the underlying fund went below the 200-day MA.\n\nNo one is putting a gun to your head and telling you to HODL leveraged ETFs when the market is shitting itself.",
        "created_utc": 1598975727,
        "id": "g3lpiuf",
        "score": 1,
        "subreddit": "investing",
        "created": 1599004527.0
    },
    {
        "author": "Not99Percent",
        "body": "NVDA, AAPL, MA, V, AMZN, FB and a lot in the mix but not TSLA",
        "created_utc": 1599054579,
        "id": "g3pv1m6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599083379.0
    },
    {
        "author": "investortrade",
        "body": "Big biotech blue chip like AZN. Maybe some LOW. And some MA and V would be good. They’re not going anywhere.",
        "created_utc": 1598991617,
        "id": "g3mxfb5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599020417.0
    },
    {
        "author": "475563",
        "body": "AMZN, V, MA, DIS, FB and both GOOGs",
        "created_utc": 1599063143,
        "id": "g3qfmjo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599091943.0
    },
    {
        "author": "cranial_pudding",
        "body": "V straight vertical while MA fucks around red\n\nMA calls?",
        "created_utc": 1598967755,
        "id": "g3l4hfl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996555.0
    },
    {
        "author": "kicktheminthecaballs",
        "body": "Whats a MA? sorry, I'm new",
        "created_utc": 1598981022,
        "id": "g3m4dl7",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1599009822.0
    },
    {
        "author": "aorta89",
        "body": "AAPL 1/21/2022 200c \nFB 11/20 280c\nNVDA 9/11 510c\nNVDA 10/02 585c\nMA 11/20 365c\nMSFT 9/25 230c\nQQQ 10/02 299c\nSPY 9/14 353c",
        "created_utc": 1599100174,
        "id": "g3su4sf",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1599128974.0
    },
    {
        "author": "yachtsandthots",
        "body": "Motorola Razr and ring tones lol",
        "created_utc": 1599013314,
        "id": "g3o905c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599042114.0
    }
]