[
    {
        "author": "justseeyoutonight",
        "body": "Not at all. TXN is not growing its revenues or profits and does not produce CPUs or GPUs (rather smaller, less complicated components)\n\nTSM is growing *quick* and can grow much more as it continues to win over Intel (Intel’s even considering outsourcing its manufacturing operation, almost certainly to TSM). Look at Apple, it’s switching to its own silicon, manufactured by TSM, in Macs because Intel is so garbage.\n\nAt the rate it’s going, no one will be buying a new PC with an Intel chip inside in 2021, as they have fallen behind AMD’s entire line this generation, which is why AMD has such a high valuation.",
        "created_utc": 1597695403,
        "id": "g1wk2xq",
        "permalink": "/r/investing/comments/ibjwn0/whats_one_stock_in_your_portfolio_that_you_would/g1wk2xq/",
        "score": 6,
        "subreddit": "investing",
        "created": 1597724203.0
    },
    {
        "author": "p_giggles",
        "body": "TXN and TSMC are vastly different companies. TXN is a diversified semiconductor manufacturer which designs its own products and fabricates the majority of them internally, as opposed to fabless semi companies like Qualcomm, Broadcom, or Nvidia. These fabless companies design their own products and have them manufactured by a foundry like Taiwan Semi, which doesn't design anything.",
        "created_utc": 1597699940,
        "id": "g1wy0x8",
        "permalink": "/r/investing/comments/ibjwn0/whats_one_stock_in_your_portfolio_that_you_would/g1wy0x8/",
        "score": 5,
        "subreddit": "investing",
        "created": 1597728740.0
    },
    {
        "author": "cp5",
        "body": "I dunno what kinda instruments are in Texas but TXN is saving my ass today",
        "created_utc": 1596552544,
        "id": "g0bxzlc",
        "permalink": "/r/wallstreetbets/comments/i3gpgo/daily_discussion_thread_for_august_04_2020/g0bxzlc/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596581344.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Tbf schools have been using the same $TXN calculators since 1878",
        "created_utc": 1596573001,
        "id": "g0de75d",
        "permalink": "/r/wallstreetbets/comments/i3qotz/what_are_your_moves_tomorrow_august_05_2020/g0de75d/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596601801.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "$TXN dip did not last long. Wow.",
        "created_utc": 1596851704,
        "id": "g0qx9ec",
        "permalink": "/r/wallstreetbets/comments/i5l1m1/weekend_discussion_thread_for_the_weekend_of/g0qx9ec/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596880504.0
    },
    {
        "author": "St_McD",
        "body": "How do you think it compares to TXN? I feel as though it has more intangible assets to be able to bolster its stock",
        "created_utc": 1597694116,
        "id": "g1wgavp",
        "permalink": "/r/investing/comments/ibjwn0/whats_one_stock_in_your_portfolio_that_you_would/g1wgavp/",
        "score": 3,
        "subreddit": "investing",
        "created": 1597722916.0
    },
    {
        "author": "Coffeepillow",
        "body": "Anybody know why TXN is moving after hours?",
        "created_utc": 1598905435,
        "id": "g3ifvqq",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3ifvqq/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598934235.0
    },
    {
        "author": "haasvacado",
        "body": "Goodbye Texas Instruments?",
        "created_utc": 1596572953,
        "id": "g0de2z5",
        "permalink": "/r/wallstreetbets/comments/i3qotz/what_are_your_moves_tomorrow_august_05_2020/g0de2z5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596601753.0
    },
    {
        "author": "NicestUsername",
        "body": "You’re talking about TXN (Texas Instruments) yea I agree they have similar goals.  However I’ve had good turnouts with ADI options in the past especially during earnings.  I’ll let you know how it goes",
        "created_utc": 1596589901,
        "id": "g0ebkzf",
        "permalink": "/r/wallstreetbets/comments/i3gpgo/daily_discussion_thread_for_august_04_2020/g0ebkzf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596618701.0
    },
    {
        "author": "Snoo_96430",
        "body": "Bagholding atvi is tough to watch reminds of TXN earnings call beat EPS and revenue but got shit on.",
        "created_utc": 1596573496,
        "id": "g0dfe29",
        "permalink": "/r/wallstreetbets/comments/i3qotz/what_are_your_moves_tomorrow_august_05_2020/g0dfe29/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596602296.0
    },
    {
        "author": "wapiti_and_whiskey",
        "body": "This is a vast over simplification. Silicon valley basically had nothing to do with the transistor which was developed in New Jersey at Bell Labs (an arm of a government sanctioned monopoly).  Bell Labs thought they couldn’t legally make much use of the transistor due to their consent decree, so they licensed it cheaply, this allowed texas instruments and sony to develop portable radios.  Silicon Valley comes into the picture more with integrated circuits of which there were many high value government contracts related to the space race and defense.  Maybe the most defining reason for why silicon valley is where it is, is that William Shockley wanted to be close to his aging mother who lived in Palo Alto.",
        "created_utc": 1598771826,
        "id": "g3bxj9e",
        "permalink": "/r/investing/comments/iiu9gc/us_tech_stocks_are_now_worth_more_than_the_entire/g3bxj9e/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598800626.0
    },
    {
        "author": "GFernandz94",
        "body": "Hello everyone! I think I'm really heavy tech now and I'd like suggestions to rebalance in order to avoid a tech bubble w/o selling my tech stocks. It could be adding new stocks or buying more of the ones I have. I'm focused on the long term.\n\nAAPL 46%\n\nGOOGL 31%\n\nBAC 4%\n\nWFC 3%\n\nDIS 3%\n\nTXN 3%\n\nIBM 2%\n\nJPM 2%\n\nAXP 2%\n\nOGZD (Gazprom) 2%\n\nGOLD 1%\n\nKO 1%",
        "created_utc": 1598492343,
        "id": "g2z6qo8",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/g2z6qo8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598521143.0
    },
    {
        "author": "Nomadic_Marvel07",
        "body": "I wonder if Texas instruments had something to do with the Mandela Effect.....I mean I learned how to trade goods on one of their devices. What the fuck was the name of that game?",
        "created_utc": 1596868581,
        "id": "g0rm5ix",
        "permalink": "/r/wallstreetbets/comments/i5l1m1/weekend_discussion_thread_for_the_weekend_of/g0rm5ix/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596897381.0
    },
    {
        "author": "joec3101",
        "body": "anyone know what happened with TXN?",
        "created_utc": 1596573830,
        "id": "g0dg6wu",
        "permalink": "/r/wallstreetbets/comments/i3qotz/what_are_your_moves_tomorrow_august_05_2020/g0dg6wu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596602630.0
    },
    {
        "author": "dunbevil",
        "body": "Hey absolutely, I understand about hype and news\n\nJust for discussion - PAyment processors make small margin with each txn true and agree about your volume comment too. But then there are a lot of VAS that they add and with txns running in millions easily, the money starts coming in. Look at stripe - even they don’t do their own processing and have some back end connection. For APMs they use another company called PPRO. I just hold for long term because this industry is growing overall with a huge push to be digital. And yes, it might be a long long hold but maybe worth the hold. \n\nAgain - this is no personal advise, I am just saying what I feel might be true. Maybe they fall and there is no comeback but I guess that’s always on the charts. Before Tesla went crazy, analysts were saying Tesla is going to fall to a point of no return but look at them from feb to now. But I think you are right it’s a penny stock.\n\nBut well the market is having a blood bath rn. Everything is just red",
        "created_utc": 1597251561,
        "id": "g18ccsi",
        "permalink": "/r/pennystocks/comments/i7sxj3/usio_reliable/g18ccsi/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1597280361.0
    },
    {
        "author": "patrickk1734",
        "body": "Is Texas Instruments expanding away from calculators?",
        "created_utc": 1597587163,
        "id": "g1qj3h8",
        "permalink": "/r/investing/comments/iam16g/my_portfolio_after_a_lot_of_learning/g1qj3h8/",
        "score": 1,
        "subreddit": "investing",
        "created": 1597615963.0
    },
    {
        "author": "grumpyhusky",
        "body": "Thanks for sharing, why do you classify Dropbox as EdTech?\n\nAnd why Texas Instruments?",
        "created_utc": 1597556742,
        "id": "g1pm7v1",
        "permalink": "/r/investing/comments/iam16g/my_portfolio_after_a_lot_of_learning/g1pm7v1/",
        "score": 1,
        "subreddit": "investing",
        "created": 1597585542.0
    },
    {
        "author": "broskijones",
        "body": "Atta way. Keep your eye on TXN. Usually plays around $127 - $133. I got some calls when it dropped to 126 and unloaded 3 days later at 131.",
        "created_utc": 1596662077,
        "id": "g0hma8v",
        "permalink": "/r/wallstreetbets/comments/i42orx/daily_discussion_thread_for_august_05_2020/g0hma8v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596690877.0
    },
    {
        "author": "insanegreek2020",
        "body": "Also keep in mind  by the time najarian announces these the moves been already made. By the time you look the premium is already up 20-30%, if I bought 5000 calls of something and could sell half for 30% a few hours later that’s what’s going on. Mostly hedging and reselling to the suckers trying to jump in on it. But I totally agree the last month I’ve watched, 90% of his unusual options plays have been dogshit. Only one I saw Texas Instruments 130c jan2021 went up like 70% that day but for 11.0 premium how many could the normal person buy.",
        "created_utc": 1596394016,
        "id": "g04o4tp",
        "permalink": "/r/options/comments/i2eoaf/is_it_just_me_thinking_follow_the_smart_money_is/g04o4tp/",
        "score": 1,
        "subreddit": "options",
        "created": 1596422816.0
    },
    {
        "author": "veggie151",
        "body": "Giddy up TXN 🤠",
        "created_utc": 1596463043,
        "id": "g07ha0k",
        "permalink": "/r/wallstreetbets/comments/i2upp0/daily_discussion_thread_for_august_03_2020/g07ha0k/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596491843.0
    },
    {
        "author": "robogarbage",
        "body": "Texas Instruments?  Calculators?  Do they sell anything people will buy more of than normal?",
        "created_utc": 1597631858,
        "id": "g1src7f",
        "permalink": "/r/wallstreetbets/comments/ib3x8n/back_to_school_thoughts/g1src7f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597660658.0
    },
    {
        "author": "ItsZoner",
        "body": "Intel is turning into the next Texas Instruments",
        "created_utc": 1597629016,
        "id": "g1smu4x",
        "permalink": "/r/wallstreetbets/comments/iavczs/the_mms_dont_want_you_to_see_this_bc_your/g1smu4x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597657816.0
    },
    {
        "author": "p_giggles",
        "body": "No problem at all, it can be a weird sector to try to figure out. In general the sector has shifted more to a fabless/foundry model since 2000 due to a massive boom/bust in the semiconductor cycle which coincided with the dotcom bubble. A bunch of integrated device manufacturers (e.g. companies like TXN which design products and manufacture them too) were left out to dry with a shit ton of inventory so they wanted to offload that \"risk\" to foundries which were more capable of handling sharp changes in supply and demand.",
        "created_utc": 1597707373,
        "id": "g1xctbc",
        "permalink": "/r/investing/comments/ibjwn0/whats_one_stock_in_your_portfolio_that_you_would/g1xctbc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1597736173.0
    },
    {
        "author": "cocaineflavoredwater",
        "body": "AMD has upside but there trajectory in the last few months is definitely inflated.\n\nIntel is still a good company and long term it will probably rise up because of them being the baseline for servers. They are still the gold standard in that space which is huge in any cloud based computing platform. But they might not grow as much with AMD looking better.\n\nThat being said a safer long term bet, as well as just a good indicator of the tech industry in general I'd look at the analog semiconductors such as ADI and TXN. Their stock maybe suffering from some overinflation as well, but the last five years both stocks have been generally moving upwards. With more Boomer ran industries such as Industrials/Automotive/and Medical industries are starting to invest heavily in \"electrifying\" their industries so analog semiconductors are now breaking into new markets at high rates. Also in the next couple years ADI will aquire Maxim, which is the combination of the second and third largest analog semiconductor companies. \n\nAlso even the Intel and AMD chips need supporting circuitry which analog semiconductors still use.\n\nAlso because how sales work in that industry, a decrease in semiconductors typically precedes a decrease in the tech market. \n\nFor short term gain I think semiconductors aren't the best play, these industries typically grow but can be hard to pin down in short term.\n\nI'm waiting for a pullback, because I don't think we are out of the woods of a recession yet. And if it does I'm going to try to pick up stock and maybe some longer term options about ATM for a decent chance at profit because a yearly decline in semiconductors is pretty strange (INTC is still above a year ago even though they have done pretty bad as far as semis go in the last few months)\n\nSource: I work in the Semiconductor industry.",
        "created_utc": 1597942064,
        "id": "g289nnv",
        "permalink": "/r/wallstreetbets/comments/iddbwp/semiconductor_discussion/g289nnv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597970864.0
    },
    {
        "author": "suhnot_68",
        "body": "TXN is mooning Friday, right? I have five $138 calls expiring.",
        "created_utc": 1597358153,
        "id": "g1dodcv",
        "permalink": "/r/wallstreetbets/comments/i977qn/what_are_your_moves_tomorrow_august_14_2020/g1dodcv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597386953.0
    },
    {
        "author": "BrokerBrody",
        "body": "Amazon and Microsoft are both from Washington. Qualcomm is in San Diego. These are really major companies.\n\nETA: Texas Instruments is in Texas. Activision Blizzard is from Santa Monica, CA. There are a LOT of major US tech companies outside California and just Amazon or Microsoft is much bigger than any of the European tech giants (Nokia, Ericcson, SAP, etc).",
        "created_utc": 1598810869,
        "id": "g3do727",
        "permalink": "/r/investing/comments/iiu9gc/us_tech_stocks_are_now_worth_more_than_the_entire/g3do727/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598839669.0
    },
    {
        "author": "_ImposterSyndrome_",
        "body": "Thanks for taking the time to provide sources. \n\nThe AWS is certainly a big one. I see a bright future for AWS (and, indeed, AMD). \n\nApple have been using AMD GPus for a long time, and Intel CPUs since they ditched PowerPC in around 2010 (IIRC). They've recently announced that they are transitioning to their own ARM-based silicone, which is presumably Apple based and produced by TSMC (which is definitely an interesting investing proposition itself). \n\nThe sales figure you linked is for 'high-end PCs', which as I mentioned is quite a small market segement. \n\nSee, 2022 is not exactly a long time, particularly in the investing world. Have you thought about how many years of exciting rapid progress AMD is going to need to have from now-on to justify the price? \n\n\nWhat are you going to do if AMD's price stabilises as it attempts to gain datacentre share from Intel, and then in 2022-2024 Intel comes out with superior chips again and quickly snatches it back? AMD's share price would drop like a rock. \n\nMuch like Tesla, AMD is going to have to make great strides in market penetration in order to replace the dominant players, and that may take a while. \n\nBottom line, I think it's hyped. Personally, if I was inclined to, I would just buy all the major seminconductor stocks available (TSMC, AMD, INTC, SMSN, TXN) Even cigarettes have semiconductors in them these days.",
        "created_utc": 1598813589,
        "id": "g3duqfn",
        "permalink": "/r/investing/comments/ij4cuh/if_you_began_dcaing_every_month_into_the_tech/g3duqfn/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598842389.0
    },
    {
        "author": "WallStreetDarling420",
        "body": "Can anyone here tell me if Texas Instruments product offerings are competitive for the future? \n\nDon’t see them being brought up in semiconductor conversations much, despite stellar financial performance.",
        "created_utc": 1597414767,
        "id": "g1fzfkz",
        "permalink": "/r/wallstreetbets/comments/i9jdiq/daily_discussion_thread_for_august_14_2020/g1fzfkz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1597443567.0
    },
    {
        "author": "cp5",
        "body": "I dunno what kinda instruments are in Texas but TXN is saving my ass today",
        "created_utc": 1596552102,
        "id": "g0bwzqq",
        "permalink": "/r/wallstreetbets/comments/i3gpgo/daily_discussion_thread_for_august_04_2020/g0bwzqq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1596580902.0
    },
    {
        "author": "Radiatin",
        "body": "&gt;I just can’t see how buying into a dividend paying stock could beat just buying into an S&amp;P500 fund...  \n&gt;  \n&gt;Example after example I just can’t find *any* that beat the performance of the S&amp;P....\n\nJohnson &amp; Johnson - Dividend: 2.7% - Yearly Appreciation: 15.4%\n\nProctor &amp; Gamble - Dividend: 2.3% - Yearly Appreciation: 14.6%\n\nUPS - Dividend: 2.5% - Yearly Appreciation: 38.5%\n\nBroadcom - Dividend: 4% - Yearly Appreciation: 14.3%\n\nTexas Instruments - Dividend: 2.6% - Yearly Appreciation: 10.7%\n\nQualcomm - Dividend: 2.4% - Yearly Appreciation: 43.4%\n\nMorgan Stanley - Dividend: 2.8% - Yearly Appreciation: 26.1%\n\nCaterpillar - Dividend: 3% - Yearly Appreciation: 16.6%\n\nKraft - Dividend: 4.6% - Yearly Appreciation: 36%\n\nGeneral Mills  - Dividend: 3% - Yearly Appreciation: 17.4%\n\nUBS - Dividend: 6% - Yearly Appreciation: 13.2%\n\n*S&amp;P 500  - Dividend:* ***1.8%*** *- Yearly Appreciation:* ***9.7%***",
        "created_utc": 1597995688,
        "id": "g2azxch",
        "permalink": "/r/investing/comments/idfnvm/whats_the_point_of_dividend_investing/g2azxch/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598024488.0
    },
    {
        "author": "YouKnowBagu",
        "body": "The only positive catalyst I could see for intel in the near term is the Chips for America Act, or the most recent semiconductor grants and contracts included in the NDAA.  Intel is most definitely hoping for a brand new, heavily subsidized (completely?) Fab from one of those, or at the very least have their R&amp;D costs heavily discounted.  That requires two big ifs though: if the funding levels in the bills stay the same and are passed, and then Intel is awarded the grant over Texas Instruments, NVIDIA, etc.\n\nUntil then, the advantage AMD has is in my opinion understated currently.  Any data center being built in the next four years would be fiscally irresponsible to buy intel over AMD for one huge reason: power consumption.  7nm and the soon to come 5nm chips from AMD will consume significantly less power than any of Intel’s offerings, and when you are talking data center quantities of CPUs, even small amounts add up.\n\nDisclosure: Long on AMD since I built a computer with a second generation Ryzen in 2018.  Also, I’m not an expert, and all of the opinions in this post are based on me, a dumb guy, doing my own research online and digging into the topic.  Happy to be educated further if anything I said in here is way off base.",
        "created_utc": 1598060815,
        "id": "g2e28an",
        "permalink": "/r/stocks/comments/idyk4m/intc_stock_undervalued/g2e28an/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598089615.0
    },
    {
        "author": "sockalicious",
        "body": "&gt; You can't tell me you think Intel has a higher chance at failure\n\nHey look, I remember when Texas Instruments was the leading company in this space.  I watched it get outpaced and never once thought it would fail, and it hasn't - it's still in business and you can buy shares.  Nowhere do I claim that Intel goes bankrupt.  It will not.\n\nI also do not claim that Texas Instruments, holder of the shining crown for total dominance of hand-held calculator microprocessors in 1974, will swiftly reclaim the top spot in CPUs in 2021.  That's ludicrous.  What I do see is that, barring a really effective turnaround, Intel is headed towards the bottom of the pile where it will join TI.",
        "created_utc": 1596731131,
        "id": "g0ksjmn",
        "permalink": "/r/wallstreetbets/comments/i45ao7/intc_is_actually_a_pretty_good_deal/g0ksjmn/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1596759931.0
    }
]