[
    {
        "author": "Just_Like_FIRE",
        "body": "Fidelity supports fractional share buying now, but I think you have to do it through the app. It gives you an option to specify dollars instead of shares.",
        "created_utc": 1588393535,
        "id": "fp8iz6w",
        "score": 2,
        "subreddit": "investing",
        "created": 1588422335.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "Fidelity has some interesting tools that look for profitable options, showing you profit and max loss, and provide probability of assignment, etc.  Gives you a good, better, best sort of choice with in/near and out of the money options to choose from.  \n\nAs much as I like pictures, I think for setting up an option trade, you want numbers and probabilities.  Also, a tool like you're suggesting, that isn't hooked up to my trading platform, isn't as handy.",
        "created_utc": 1588374996,
        "id": "fp7p9hc",
        "score": 2,
        "subreddit": "options",
        "created": 1588403796.0
    },
    {
        "author": "Manodactyl",
        "body": "Ive been with vanguard for over 20 years, love them to death, but damnit why don’t they offer fractional shares yet? I’ve been slowing adding money to my fidelity account to take advantage of their fractional shares offering.",
        "created_utc": 1588360947,
        "id": "fp6yr5x",
        "score": 2,
        "subreddit": "stocks",
        "created": 1588389747.0
    },
    {
        "author": "k1tch3nMitts",
        "body": "I agree- but depends how ‘close’ it is.\nThe one today was at a hefty loss but since I didn’t get a notification that I was assigned ( when it went ITM)I just assumed that the buyer wasn’t exercising. \n\nCalled fidelity and they told me it was likely I was assigned and that I wouldn’t get notice of same day assignment on expiry dayst",
        "created_utc": 1588387075,
        "id": "fp89tle",
        "score": 1,
        "subreddit": "options",
        "created": 1588415875.0
    },
    {
        "author": "armovetz",
        "body": "Thanks, I think I will start with fidelity, since i have 401k set within it.",
        "created_utc": 1588390614,
        "id": "fp8ez55",
        "score": 1,
        "subreddit": "investing",
        "created": 1588419414.0
    },
    {
        "author": "armovetz",
        "body": "Edited: i live in US and using USA etrade account ,just in case\n\n**How do i buy just 1.358 part of VOO for dollar cost average strategy?**\n\nFirst of all let me hooray myself on my first ever post-comment on reddit, thank you :)\n\nI'm slowly getting into investing, portfolio, all that being-super-funny-at-parties things.\n\nLet's say i have Etrade account and i love VOO by Vanguard.Let's say i want contribute $500 per month towards my billionaire future using **dollar cost averaging**\n\nI didn't find any option/button how i can buy **1.5** of VOO, or **0.35** of VOO, or **1.7891** of VOO.\n\nLet's assume VOO jumps between $230 - $320 whatever.So each time i can only buy 1 or 2 of VOO. Doesn't seem to be dollar average strategy.\n\nIs it Etrade limitation? Any other platform (Schwab, fidelity) will give me that option?Is it VOO (any etf, any stock at all??) limitation? (i doubt since every second article in web mentions VOO example for dollar cost averaging)\n\nI've tried google some stuff, and i found some article mentioning some limitations of etrade (if i remember correctly).\n\nIt would be awesome if someone can guide me to some 101 noobs article about buying whole/parts of stocks/etf opportunities.\n\nThanks for reading long post, it's not 9gag, thus no veggies ;)",
        "created_utc": 1588375100,
        "id": "fp7pg5j",
        "score": 1,
        "subreddit": "investing",
        "created": 1588403900.0
    },
    {
        "author": "Jwceltic5",
        "body": "I know Fidelity does partial shares. That or opening a Schwab account and putting however much money you want in one of their no minimum mutual funds are your best options.",
        "created_utc": 1588375728,
        "id": "fp7qjkx",
        "score": 1,
        "subreddit": "investing",
        "created": 1588404528.0
    },
    {
        "author": "Hollisb1001",
        "body": "Vanguard, Charles Schwab, and Fidelity are all good low cost to free brokerages. The biggest advantage for me right now with Fidelity, they already have the option to buy fractional shares. Also since my primary mode of investment is index mutual funds, they have the best option for those with their zero funds.",
        "created_utc": 1588359147,
        "id": "fp6v718",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588387947.0
    },
    {
        "author": "dominodancing93",
        "body": "How can I do that then? As far as being able to buy “partial” shares of an ETF? I would totally put all of my money into an ETF but I was under the impression that it has to be the exact amount that the etf is currently trading for.\n\nI do bank with Fidelity!",
        "created_utc": 1588359624,
        "id": "fp6w5cc",
        "score": 1,
        "subreddit": "investing",
        "created": 1588388424.0
    },
    {
        "author": "TRADE_FUTURES",
        "body": "There are already target date retirement funds that do exactly that. Schwab, fidelity, Vanguard all have them.",
        "created_utc": 1588383605,
        "id": "fp84xeu",
        "score": 1,
        "subreddit": "investing",
        "created": 1588412405.0
    },
    {
        "author": "cobras89",
        "body": "Isn't it really only Fidelity? Schwab, TD and Robinhood don't have them yet.",
        "created_utc": 1588388898,
        "id": "fp8cikb",
        "score": 1,
        "subreddit": "investing",
        "created": 1588417698.0
    },
    {
        "author": "The-Invisible-Handy",
        "body": "Already available in Robinhood (and a bunch of the other app-based brokers), and Schwab started their rollout as well (they actually announced before Fidelity did).  TD had mentioned road mapping it prior to the Schwab deal, now it figures to be a matter of time.",
        "created_utc": 1588393569,
        "id": "fp8j0qq",
        "score": 1,
        "subreddit": "investing",
        "created": 1588422369.0
    },
    {
        "author": "Harbor-Freight",
        "body": "\nPlenty of brokers do.  I use TD Ameritrade.  It carries a 6.95 transaction fee for OTC stocks.  Fidelity and Schwab are free.   FYI even some major companies who do meet the size requirements for major markets still choose to trade pink sheet OTC, like Nintendo for example.",
        "created_utc": 1588382477,
        "id": "fp83psq",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1588411277.0
    },
    {
        "author": "iknowiamwright",
        "body": "I am very new to the stock market. I actually had some extra income due to this situation as I work for some wealthy individuals and they asked for some extra help right when the issue hit, but I have to pay off a credit card with 0% interest until November. So I have 10k in assets right now, and 10k that needs to be paid off in November. I am 35 with a family, and we expect to be able to save $1400 per month moving forward as well which includes paying my car payment at 3%, but I live rent free (so I will be able to have another $8.4k to pay off the card). I also have retirement already and put enough in there, so I am not too worried about that. I placed a bit of money in Tesla for 1 week (a friend of mine got in really low talks about it all the time) and I removed it after making some money, just at the right time. I realize I was lucky and want to make the right decisions moving forward. Being as I can make enough to pay off most of my debt, I feel I could be a bit risky. I was contemplating placing about 1k or 2k into the market as I could still double down another 2k if the market goes way down, and then again if it goes down further. Is this the right strategy? 10-20% now knowing I could make that money back by investing more if it crashes? What else should I know? Should I do a Roth IRA now for 2k, or wait until my finances settle....\n\nLastly, I have been using Fidelity as they are already my bank. I like their website, hate their app. I am not locked in to using their services. I tried using Uplift on my phone just to track stocks... hated it. I have heard good things about Sigfig, but did not realize it was not more than a stock tracker and they wanted all my info. Any suggestions on the best app to possibly invest, but at least track stocks would be amazing. I want to do my research. I want to be able to see ratings, graphs,",
        "created_utc": 1588430284,
        "id": "fp9n5va",
        "score": 1,
        "subreddit": "investing",
        "created": 1588459084.0
    },
    {
        "author": "carolina0000FFs",
        "body": "You can also trade index funds on Robinhood by purchasing ETFs. However, Robinhood is a less mature investment platform. It's popular with people just getting started, but it has had a lot of bugs and outages and lacks good features for long term investing (like support for IRAs). Robinhood has been popular for a while because they popularized free trades and a good app. While the latter is subjective, most major brokerages have free trades and apps now. Fidelity is my choice which works well for index funds or individual stocks.",
        "created_utc": 1588423483,
        "id": "fp9dw8b",
        "score": 1,
        "subreddit": "investing",
        "created": 1588452283.0
    },
    {
        "author": "Zeddicus11",
        "body": "I started out with Robinhood, but then switched to Fidelity because their platform is more stable and developed, also offers mutual funds, allows opening a Roth IRA and checking account besides just a brokerage account, offers a great credit card etc. They also reimbursed me for the $75 Robinhood charged me to transfer all my stocks. RH seems great for relatively low stakes and experimenting with day trading in their nice looking app, whereas Fidelity (and Vanguard, and many other brokers) are more meant to be for long term investing and saving for retirement, rather than for day trading.",
        "created_utc": 1588407431,
        "id": "fp8yfa3",
        "score": 1,
        "subreddit": "investing",
        "created": 1588436231.0
    },
    {
        "author": "TouksMode",
        "body": "Hi, I recommend the following stocks:\n\n \n\nCharter communication (CHTR)\n\nLKQ Corp (LKQ)\n\nBristol Myers Squibb (BMY)\n\nL3Harris (LHX)\n\nXPO Logistics (XPO)\n\nApplied Materials (AMAT)\n\nFiserv (FISV)\n\nMicrochip Technology (MCHP)\n\nFidelity National Information (FIS)\n\nQorvo (QRVO)\n\nGlobal Payments (GPN)\n\nMosaic (MOS)\n\nVistra Energy (VST)\n\n&amp;#x200B;\n\nAs you can see they are distributed across different sectors, lowering portfolio risk.\n\nAlso, your allocation plan should be split into tranches.",
        "created_utc": 1588322404,
        "id": "fp5asfa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588351204.0
    },
    {
        "author": "iaalaughlin",
        "body": "Fidelity does fractional share investing for sure.  Don’t know about TD. \n\nE*TRADE doesn’t for sure.",
        "created_utc": 1588324113,
        "id": "fp5ce68",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588352913.0
    },
    {
        "author": "shinku443",
        "body": "-10% total today. Gonna just close fidelity",
        "created_utc": 1588340244,
        "id": "fp5uks0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588369044.0
    },
    {
        "author": "AlphaSquad1",
        "body": "I keep having to check the fidelity rules but I think they basically amount to “you can’t make money using money you don’t have”\n\n\nhttps://www.fidelity.com/learning-center/trading-investing/trading/avoiding-cash-trading-violations",
        "created_utc": 1588345896,
        "id": "fp64gg1",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1588374696.0
    },
    {
        "author": "Harbor-Freight",
        "body": "Plenty of brokers do.  I use TD Ameritrade.  It carries a 6.95 transaction fee for OTC stocks.  Fidelity and Schwab are free.   FYI even some major companies who do meet the size requirements for major markets still choose to trade pink sheet OTC, like Nintendo for example.",
        "created_utc": 1588382501,
        "id": "fp83qi3",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1588411301.0
    },
    {
        "author": "somanychins",
        "body": "So is robin hood half decent? Can you do legit limit orders and everything? I use fidelity right now and am pretty happy, but want to dick around with cheap options, and the fees kill you when buying like a $0.10 option",
        "created_utc": 1588369893,
        "id": "fp7fy69",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588398693.0
    },
    {
        "author": "Dyunder",
        "body": "So what is their fee on options for Fidelity and RH is ok but limit orders on their suck ass and are slow af",
        "created_utc": 1588369987,
        "id": "fp7g4m4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588398787.0
    },
    {
        "author": "zedlosjupino",
        "body": "Find a diverse etf with low maintenance cost. I used the fidelity 500 zero etf",
        "created_utc": 1588359119,
        "id": "fp6v508",
        "score": 1,
        "subreddit": "investing",
        "created": 1588387919.0
    },
    {
        "author": "funnel_out",
        "body": "Gotcha, Would you say to invest large amounts of money, you would use Fidelity instead of Robinhood?\n\nAlso what’s the difference between a mutual fund and ETF?",
        "created_utc": 1588407601,
        "id": "fp8yl80",
        "score": 1,
        "subreddit": "investing",
        "created": 1588436401.0
    },
    {
        "author": "InvestingNerd2020",
        "body": "Fidelity is a far better choice for investing.  Good 24/7 customer service, fractional shares for all stocks/ETFs via mobile app, tax protected IRA accounts, far better charts for day trading, more reliable for Option trading, and zero expense ratio Index mutual funds for IRAs.",
        "created_utc": 1588409805,
        "id": "fp90o1d",
        "score": 1,
        "subreddit": "investing",
        "created": 1588438605.0
    },
    {
        "author": "LimitedNetwork",
        "body": "Pretty much any proper broker has the ability. I’d call customer service I use fidelity told them my interested. I got quizzed on my understandings of the risks and the mechanics of it. They made it happen.\n\n\nCUSIP NUMBER: 345370BW9\n\n9.98% return about $100 bucks a year per bond held. Ford just needs to not go bankrupt.\n\n\nhttps://www.macroaxis.com/invest/bond/F/345370BW9",
        "created_utc": 1588391374,
        "id": "fp8g1wd",
        "score": 1,
        "subreddit": "investing",
        "created": 1588420174.0
    },
    {
        "author": "Loremipsum06308759",
        "body": "Is this something that partners and acts within fidelity/vanguard, etc, or does your money need to be within M1?",
        "created_utc": 1588361587,
        "id": "fp700o7",
        "score": 1,
        "subreddit": "investing",
        "created": 1588390387.0
    }
]