[
    {
        "author": "Kannoj0",
        "body": "She should sell her buthole for 2g. Make money, keep fidelity, stonks go up (sometimes)",
        "created_utc": 1599960131,
        "id": "g50l015",
        "score": 260,
        "subreddit": "wallstreetbets",
        "created": 1599988931.0
    },
    {
        "author": "yogaflame1337",
        "body": "Fidelity investments  \n\n\nEdit: My first-ever gold in my whole life THANK YOU SO MUCH!",
        "created_utc": 1599971573,
        "id": "g51je13",
        "score": 154,
        "subreddit": "wallstreetbets",
        "created": 1600000373.0
    },
    {
        "author": "c1utch10",
        "body": "It’s the latter. Direct investments by connecting buyers and sellers, but they are occasionally placed into mutual funds (a few Fidelity mutual funds own shares of SpaceX). Pre-IPO share exchanges is already a crowded market, but it’s a wise move by JPM due to tightening spreads for public equities (read: lower margins) and private companies continuing to delay going public.",
        "created_utc": 1599973272,
        "id": "g51p5ms",
        "score": 64,
        "subreddit": "investing",
        "created": 1600002072.0
    },
    {
        "author": "wonderbrah419",
        "body": "I don't know about Fidelity but the Baron fund BPTRX currently has a 3.5% holding of SpaceX and a 44.2% in Tesla. [https://www.baronfunds.com/product-detail/baron-partners-fund-bptrx](https://www.baronfunds.com/product-detail/baron-partners-fund-bptrx)\n\nFund is still up 56% YTD even after the Tesla pullback.\n\n2% fee though. And I know it uses leverage.",
        "created_utc": 1599998735,
        "id": "g53g39v",
        "score": 38,
        "subreddit": "investing",
        "created": 1600027535.0
    },
    {
        "author": "chipsomb",
        "body": "What Fidelity mutual fund has SpaceX? I wouldn't mind getting some of that. Thanks.",
        "created_utc": 1599984929,
        "id": "g52ils7",
        "score": 31,
        "subreddit": "investing",
        "created": 1600013729.0
    },
    {
        "author": "mountainmonkey2",
        "body": "Fidelity needs to dump a ton of money into the people designing the UI for the mobile app",
        "created_utc": 1600313057,
        "id": "g5jqctk",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1600341857.0
    },
    {
        "author": "DLAV8R",
        "body": "You can.  I had the chance to.  Fidelity requirements were minimum 500k in account.  I’m still waiting for the IPO bubble to pop before getting in.",
        "created_utc": 1600280940,
        "id": "g5hvr9k",
        "score": 24,
        "subreddit": "investing",
        "created": 1600309740.0
    },
    {
        "author": "GaylrdFocker",
        "body": "No brokerage portfolios are FDIC insured, that's banking type accounts (savings, checking, CDs).  Brokerage usually have SIPC insurance, but most large brokers have private insurance that covers above the SIPC limit.\n\n[Here](https://www.fidelity.com/why-fidelity/safeguarding-your-accounts#:~:text=All%20Fidelity%20brokerage%20accounts%20are,since%20they%20are%20considered%20securities) is Fidelity's overview on it..",
        "created_utc": 1600404339,
        "id": "g5o8o7j",
        "score": 23,
        "subreddit": "investing",
        "created": 1600433139.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"Due to those losses, I stopped investing for a couple of months exactly when the prices were at minimum of the year.\"\n\nI think a broad issue with this sub that I've seen over the years is that people buy when things are good (eventually - this happens after a couple of months of half a dozen \"WHY IS THE MARKET GOING UP?\" threads every day), but when the market has a correction - something that used to be viewed as normal - it's viewed as almost apocalyptic. I saw a post the other day about Amazon being down 10% as a \"massive decline\" - if you cannot tolerate a 10% decline in Amazon don't own it, because there are times where that's the initial reaction to earnings. If a 10% decline throws your view of owning a company into question, then your thesis on why you bought it in the first place probably wasn't that strong. If something goes down 10% and you look at it in your portfolio and if your first instinct is to dump it, then that tells you exactly how strong you really feel about the company.  Growth stock investing is not going to be trees grow to the moon or years like this where Ark funds are up 70% or whatever they were; there's going to be periods that are highly volatile and far more volatile than the last month - look at growth names at the end of 2018.  This year with growth is not normal; it's a situation where things came together that benefited a lot of growth companies tremendously.\n\n1) I think people have to view a March when the VIX is 80 and the CNN Fear and Greed is 2 and yadda yadda as the time to really lean in. That's the time when if you have an even somewhat longer-term view you're getting opportunities. By the time this sub has warmed up to the market is not the time to lean in.\n\n2) People have to have a longer-term view and not this \"one foot out the door\" mentality where every bit of market volatility and events that might cause volatility is something to flee from. There's been way more threads in the last year where people talk about \"selling everything\" - not a decision that should be easy and a decision you should make very, very rarely - if ever. Volatility creates opportunities, you just have to think in months and years with purchases, not \"OMG WHAT IS THE MARKET GONNA DO TOMORROW?\"  \n\n\" I want to know how can I feel less sad about this.\"\n\nIt's a bummer and I'm sorry that you're dismayed at what happened but you're going to miss opportunities. Everyone does. I owned VFF when it was around $1 and sold not long before it went to $6 and then eventually the high teens. There's plenty of other instances over the years. I think what I'm looking for in terms of individual names has become specific enough that there are things that do well where I know I wouldn't have bought it any way, but with that it's not being bummed as much as trying to understand why it did well and any takeaways - could I have looked at it differently? Etc. If I missed something there's always going to be a bit of dismay, but I've gradually tried to be far more automated about it - is there is a lesson/takeaway from this? y/n? then move on.\n\nThere is going to be a lot of \"could haves\" throughout your time in investing. The issue I think becomes that was before and today is a new day - literally. Chasing now after what you could have done is not always going to be the best idea - have to look at it with a fresh perspective and consider what is the best long-term strategy to build on right now.\n\n\"When I backtested my ETF purchase across my deposit intervals, I found that I could have made 37.9% in returns\"\n\nCould have. I wouldn't base decision making on what things have done, the question becomes what is the potential going forward for the next 3-5 years. I look at my portfolio all the time with the thought of - if I was stuck with this portfolio tomorrow and couldn't sell it for 5 years, would I be okay with that? If something is a no, then changes need to be made. Things are bought with the intent of owning long-term and bought with the view of potential over the coming years. I have no idea what the market will do tomorrow or next week.\n\n\"When I want to invest smaller amounts of money, I have to rely on fractional shares and my brokerage doesn't provide that, so I have to shift to Robinhood or other trading platform.\"\n\nIf you want fractional shares, I'd much rather suggest Fidelity than RH. I don't see the appeal of RH at this point.\n\n\"AAPL 20%, MSFT 15%, AMZN 15%, \"\n\nSo half your portfolio is the household names everyone already knows, likes and probably owns. These are not bad companies and I think they will continue to do well in the future, but I also do think that it's at a point where people have to devote more if they're going to be in tech to finding growth beyond FANG names.",
        "created_utc": 1600518277,
        "id": "g5t2609",
        "score": 22,
        "subreddit": "investing",
        "created": 1600547077.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"But at some point valuations might be over-stretched, future growth priced in and no greater fool showing up to pass the hot potato.\"\n\nThe issue with this is that I've read \"DOT COM!\" \"BUBBLE!\" on here for 5 years. There have absolutely been major rotations out of tech at times over the last 5 years but if you regarded those as confirmation of your bias that everything is a bubble rather than as a buying opportunity then you've missed out. Buying what \"appeared cheap\" and/or was \"impacted\" earlier this year when markets were cratering has not turned out nearly as well as buying what this sub has continually complained about as being \"too expensive.\"\n\nWill that change? Quite possibly.  When? Nobody on here has any idea. But the issue I think becomes sort of like the people who said for the last 10 years that \"value has gotta make a comeback, right?\" Just because something is cheap does not mean it can't get cheaper, just because something seems expensive does not mean it cannot get moreso. Just because something has underperformed for 5 years does not mean that it can't continue to underperform for another 5.  Without a very distinct catalyst in mind, incessant top calling (and you've seen it on this sub for years) is often an error.  Without a catalyst in mind, calling something cheap can often wind up waiting while watching what's working continue to do so. This sub has talked up big oil this year a lot because of being impacted (this, after big oil names have largely disappointed for 5+ years before this) and when BP literally came out and predicted that \"oil demand growth may have peaked\" and a lot of the responses on here were basically: \"well, what do they know?\" Buffett sold airlines: \"well, what does he know?\"\n\nThere is an eagerness to dismiss tech and growth and embrace what is viewed as cheap but when what is viewed as cheap isn't working, people keep trying to will the trade into working. There was a great interview with Fidelity Contrafund manager Will Danoff the other day and I liked this particular part:\n\n\"So, I'd say it's a very healthy give-and-take and dialogue. And I would say, often because Joel and I and all the other fund managers started as Fidelity research analysts, when a new analyst arrives, they usually show up at my office with a list, and say “I'm the new railroad analyst. Here are my names, and I like XYZ railroad because the group's trading at 14 times earnings, and this ones trading at 11 times earnings.” And I might say, “Wow, that's interesting. Why is that one trading at such a discount to the group?” *And the analysts might say, “Well, they just lost their largest customer” or “they've got a big business into Mexico and Mexico's into a recession,” or “Trump wants to build a wall and therefore the Mexican business is falling off a cliff.” And I usually say, “That's not the type of company I'm interested in*. **I'm interested in companies that are doing well, where the earnings outlook is positive, where earnings per share is growing. Maybe it's growing faster than people think. What do you have on your list that would fit that bill even if it's more expensive than the average company in your group?”** So, it's that's sort of give-and-take. And I might encourage an analyst to reorient their priority list to help me look for stocks that fit my ideal pattern.\" I think this sub is often looking for the impacted, but maybe - just maybe - consider more the Danoff perspective. (https://www.morningstar.com/podcasts/the-long-view/40)\n\nAs for tech, there are things that are absolutely ahead (or well ahead) of themselves, but I wouldn't paint everything in tech with one broad brush or would I be a tech fund either (tech and healthcare are about 65%ish of my portfolio, with the latter making up a large chunk of that.) There's a lot of innovation going on beyond tech. \n\nIf you think that tech is overheated, that doesn't mean that looking into what's been the most impacted is the correct answer, either. What's somewhere in the middle? Something that isn't \"hot\", but also hasn't been obliterated and where you can make a good fundamental case (not just \"it's down a lot!\") for the company in the coming years?",
        "created_utc": 1600609097,
        "id": "g5z78v5",
        "score": 20,
        "subreddit": "investing",
        "created": 1600637897.0
    },
    {
        "author": "DrKolagani",
        "body": "“Hey son are you investing in stocks now? Let me show you something”\n\nMy dad called me over to his laptop and opened his fidelity. This dude has 960k and needs +4% from the market to become a stock millionaire.\n\n18 years and he never told me he was this rich smh, guess that’s why he was so smug\n\nHe also right then and there liquidated 2k worth of  garbage and put it into tech because I said so\n\n\nEdit: He has about 650k of leveraged tech ETFs so just do that and it should work out alright",
        "created_utc": 1599010637,
        "id": "g3o45da",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1599039437.0
    },
    {
        "author": "2-leet-2-compete",
        "body": "I finally started using RH this week. Option gambling on Fidelity feels dirty, like you're eating a greasy hotdog at a 3 star Michelin restaurant. \n\nBut on RH it feels encouraged. They dumb it down and make it easy to buy super shitty options. Im loving it so far.\n\ndO yoU tHiNk uPPie??? \n\nOk! Try this! Some risk, low chance of reward: AAPL 10/16 150C",
        "created_utc": 1601416202,
        "id": "g73z39u",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1601445002.0
    },
    {
        "author": "TastyCuttlefish",
        "body": "Apple sold its Adobe position in *1989*. The top holder of ADBE is Vanguard Group, at 7.75%, followed by Fidelity and Blackrock. It’s not that hard to research this. \n\nPTON fell because the entire market fell. It was up 12% at points. I was holding 15,000 shares of it and sold at $98.15. I was watching it and continued throughout the trading day. \n\nYour analysis is based on really false information and across the board incorrect. I don’t think you should be giving advice.",
        "created_utc": 1599969618,
        "id": "g51cm2m",
        "score": 15,
        "subreddit": "options",
        "created": 1599998418.0
    },
    {
        "author": "Gorndog92",
        "body": "I use Fidelity, WebBull and RH. RH is my primary. \n\n\nWhy might you ask do I favor RH? The simplicity of it. So easy a 3rd grader could trade on it. In terms of research though, RH lacks immensely. \n\nI hate the options layout for WebBull. \n\nFidelity is solid, but I just find RH to be more user friendly.",
        "created_utc": 1601431782,
        "id": "g74qu3x",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1601460582.0
    },
    {
        "author": "ChronicCSD",
        "body": "Wake up late, take a dump, login onto fidelity, have a slight heart attack, hold my fucking calls.",
        "created_utc": 1599181950,
        "id": "g3xl87t",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599210750.0
    },
    {
        "author": "khdo1992",
        "body": "Dude time to open fidelity account",
        "created_utc": 1600629434,
        "id": "g60mbvz",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600658234.0
    },
    {
        "author": "Dontlovemoney",
        "body": "Lol looked up on my fidelity account and I had bought shares of TSLA at $80, and sold at like $180 back when their battery’s we’re catching on fire for minute there...imagine I held that 6 more years 😂",
        "created_utc": 1599669041,
        "id": "g4k69pw",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599697841.0
    },
    {
        "author": "SagaStrider",
        "body": "I was disappointed to see how small the Fidelity SpaceX holdings are.",
        "created_utc": 1599984895,
        "id": "g52iivl",
        "score": 10,
        "subreddit": "investing",
        "created": 1600013695.0
    },
    {
        "author": "kidseal",
        "body": "I would think Ackman would pick a company with very broad investor name recognition.  One vote for Fidelity Investments.",
        "created_utc": 1600463294,
        "id": "g5qryjp",
        "score": 10,
        "subreddit": "SPACs",
        "created": 1600492094.0
    },
    {
        "author": "thalassamikra",
        "body": "If TSLA with 900 PE is insane (and it is) then what explains the lunacy of Fidelity with 1800 PE? Flies under the radar because CEO isn't shitposting on Twitter.",
        "created_utc": 1599612304,
        "id": "g4i0asr",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599641104.0
    },
    {
        "author": "Bweeze086",
        "body": "Fidelity.....",
        "created_utc": 1599079732,
        "id": "g3rnlse",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599108532.0
    },
    {
        "author": "AnnualClient2",
        "body": "lol op is netting only 5% on fidelity after 1.5yrs. he’s making poor choices on any broker",
        "created_utc": 1600805432,
        "id": "g68yic8",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600834232.0
    },
    {
        "author": "LSatou",
        "body": "Doubt it. Fidelity customer service rep was probably just inexperienced or made an error.",
        "created_utc": 1599932810,
        "id": "g4yblqy",
        "score": 10,
        "subreddit": "SPACs",
        "created": 1599961610.0
    },
    {
        "author": "dvdmovie1",
        "body": "This, to some degree: \"Train conceded value will become so unloved it will have to make a comeback, but warned that some of value investors’ most compelling opportunities will be revealed to be ruinous value traps, due to digital disruption.\" (https://portfolio-adviser.com/nick-train-value-was-a-20th-century-phenomenon/)\n\nVarious thoughts:\n\n1. I think actual compelling value ideas are difficult and few-and-far-between. There is this perception that everything that is big and known and down a lot is a compelling value when much of these are not and/or are value traps. Somewhat related, I really agree with this discussion by Fidelity Contrafund manager Will Danoff: https://pbs.twimg.com/media/EiEOiBRWoAQaPdZ?format=jpg&amp;name=medium on focusing on what is doing well.\n\n2. You have a time period where the new economy names are the focus and there has been significant growth pulled forward. I don't think that this current crisis \"changes everything\", but it has pulled forward growth in the winners and there are themes and behaviors that I think will carry forward for years after this is over. While many on here still seem to disagree with this, there have clearly been winners throughout this that have benefited, some significantly.\n\n3. The problem with that is that you basically have a crowding (this year it's been a stampede) into new economy names and people ignoring old economy names (and that does play to Train's discussion in that 2018 article: \"“In 2018 it looks as though working out which companies are advantaged and which challenged by digital disruption may deliver better returns than establishing what is currently ‘cheap’ or ‘dear’ or whether macro-economic trends favour ‘cyclical value’ or ‘quality growth’,” he said.\") A funny bit but I think this is very true this year - \"even when the market is in \"rotation\" mode, you can feel that moment intraday when people are like wtf am I doing, give me a hit of that sweet sweet digital transformation (https://twitter.com/modestproposal1/status/1293211807709003776) The problem with that is that you now have a lot of people focused on/crowding into one part of the market and it gets ahead of itself (and some niches way ahead of themselves.) There's no gradual cool off of what's done well, the rotations are total \"escalator up\" for months followed by these \"elevator down\" movements.\n\n4.  There will probably be a more sustained rotation if there was a real solution to this crisis, but even then I think my question becomes how \"sticky\" are people in various \"value\" sectors. A rotation out of the winners into losers doesn't fix the pre-existing issues of poorly run retailers but I think people confuse price increase with the idea that everything is a-okay now. I think a lot of impacted sectors are going to be to some degree impacted even after this is over. So I think ultimately the rotation out of winners into losers is more an opportunity to buy the winners and with the losers, you have to be selective.  I've talked up medical devices (SYK) as a sector given the procedure delays, but those are well off the lows. People just think everything impacted by this is a value and is going to be okay again after, I just don't feel that way - especially if this takes another year to before it's really solved.\n\n5. It's pretty telling that for all the outperformance of growth over the last decade that even in the midst of a pandemic, value still underperformed in the decline in March and then proceeded to spectacularly outperform post March low.  I do think that value will make a comeback, but it will probably be brief and I think people are going to have to be selective.",
        "created_utc": 1600424064,
        "id": "g5osy4l",
        "score": 10,
        "subreddit": "investing",
        "created": 1600452864.0
    },
    {
        "author": "aerrreaa",
        "body": "Can't believe I had to get up and login to Fidelity's pro platform to check futures. They're fine. Investing.com is just being a bitch and crashed. Fidelity is showing updates as of 1 min ago",
        "created_utc": 1599024278,
        "id": "g3opzcl",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599053078.0
    },
    {
        "author": "BassilsBest",
        "body": "[fidelity stats](https://imgur.com/a/ldbPWmQ)",
        "created_utc": 1600447616,
        "id": "g5pv779",
        "score": 9,
        "subreddit": "stocks",
        "created": 1600476416.0
    },
    {
        "author": "theta_eta_my_beta",
        "body": "Congratulations retards.\n\n[Manager Of $139BN Fidelity Fund Blames Robinhood For Exodus Of Client Money](https://tradeforprofit.net/2020/09/manager-of-139bn-fidelity-fund-blames-robinhood-for-exodus-of-client-money/)",
        "created_utc": 1600805888,
        "id": "g68zf3m",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1600834688.0
    },
    {
        "author": "lobster_johnson",
        "body": "Many mutual funds *are* index funds or hold REITs, and have very low fees, so this is misinformation at best.\n\nFor example, a popular mutual fund, VTSAX, has an annualized fee of 0.04% and tracks a total US stock market index. Vanguard, Schwab, Fidelity, BlackRock, etc. all have excellent, low-cost mutual funds.\n\nIf you want to rail against _actively managed_ mutual funds, that's a whole other kettle of fish, and I agree that one should generally avoid them.",
        "created_utc": 1599930075,
        "id": "g4y4rbq",
        "score": 9,
        "subreddit": "investing",
        "created": 1599958875.0
    },
    {
        "author": "HolderofFour",
        "body": "Robinhood started the systemic ploy to get millennials and gen z who have been accustomed to instant gratification to dump their money into the market for when boomers die off. Toppled with student debt and bad money management, it is a perfect scenario for the big boys. Heck, firms like Fidelity even have these funds with buzzwords and ridiculous expense ratios to attract young people. Like what the fuck is a women’s and diversity fund?",
        "created_utc": 1600539734,
        "id": "g5ucld5",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1600568534.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "That's for KKR underwritten offerings which aren't the \"big ones\".  If you want Credit Suisse underwritten IPOs, you need $500K.  For example, of the 6 IPOs offered by Fidelity right now, all are CS and none are KKR.",
        "created_utc": 1600431770,
        "id": "g5p1dnt",
        "score": 8,
        "subreddit": "investing",
        "created": 1600460570.0
    },
    {
        "author": "rollickinggoodtime",
        "body": "Your Brittanica article makes reference to Apple threatening to sell its stake in Adobe in 1989, consistent with this [NYT article](https://www.nytimes.com/1989/07/07/business/apple-selling-adobe-stake-two-could-become-rivals.html), but I don't see anywhere that they ever effectuated that sale. Nevertheless, I think they must have, because the largest shareholders of ADBE are now Vanguard, Fidelity, Blackrock, SSGA, etc.",
        "created_utc": 1599965718,
        "id": "g5133ww",
        "score": 8,
        "subreddit": "options",
        "created": 1599994518.0
    },
    {
        "author": "escootme",
        "body": "It's pretty vaguely worded, but $100k \"in certain assets\" is the minimum.\n\n&gt;[Who is eligible to participate in an IPO at Fidelity Investments?  ](https://www.fidelity.com/stock-trading/faqs-ipos#)    \n&gt;  \n&gt;Eligibility for participation in traditional IPOs led by  Kohlberg Kravis Roberts &amp; Co. (KKR) is reserved for brokerage  customers with a minimum of $100,000 in certain assets at Fidelity.  Other providers of traditional IPOs, and other equity public offerings  made through Fidelity may be reserved for brokerage customers with a  minimum of $100,000 or $500,000 in certain assets at Fidelity. Members  of Premium Services are also eligible.  \n&gt;  \n&gt;The $500,000 or $100,000 requirement will be determined weekly by  aggregating all assets and trades in retail accounts which list the same  name and Social Security number and are maintained by Fidelity Service  Company, Inc. or Fidelity Brokerage Services LLC (excluding assets or  trades maintained on behalf of any divisions of Fidelity Investments  Institutional Services Company, such as 401(k) or 403(b) plan assets).  Other assets may be included in the calculation at our discretion. In  addition, an account in which an indication of interest is entered must  have at least $2,000 in cash or fully paid securities.",
        "created_utc": 1600409223,
        "id": "g5oevka",
        "score": 8,
        "subreddit": "investing",
        "created": 1600438023.0
    },
    {
        "author": "estoy_al_pedo",
        "body": "It is not a lotto. Fidelity specifically states they rank you based on the amount of assets you have with Fidelity excluding 401k and the amount of “revenue” you generate:\n\nhttps://www.fidelity.com/stock-trading/faqs-ipos\n\nI imagine you need multimillion dollar portfolios to get shares in hot tickers.",
        "created_utc": 1600435046,
        "id": "g5p68uy",
        "score": 8,
        "subreddit": "investing",
        "created": 1600463846.0
    },
    {
        "author": "LMY723",
        "body": "Two PE Firm recruiters and Goldman Sachs recruiter added me on LinkedIn yesterday. I sent in those applications two weeks ago and been hustling with those companies for a couple months. Was kinda blue but then BAM. Hoping to schedule some interviews. \n\nJust got an email telling me I’m in second round of fidelity, and third round with a VC group in Zurich. \n\nKeep hustling boys, it may work out after all. 🌽",
        "created_utc": 1600545180,
        "id": "g5urc6z",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600573980.0
    },
    {
        "author": "3ebfan",
        "body": "Fidelity",
        "created_utc": 1600572718,
        "id": "g5x4bc0",
        "score": 8,
        "subreddit": "stocks",
        "created": 1600601518.0
    },
    {
        "author": "xCHETx",
        "body": "Be careful when you talk to them, they blocked my trading account saying I was rude. Pathetic company. Fidelity and TD are much better",
        "created_utc": 1600620546,
        "id": "g5zxzhc",
        "score": 7,
        "subreddit": "options",
        "created": 1600649346.0
    },
    {
        "author": "clairec295",
        "body": "It wasn't a ploy to get people to buy their stock, they've been doing really well recently with COVID-19 causing the demand of oil to go down and people need to store it.\n\nFidelity recently purchased a large stake in it (June) if that makes you feel any better. If it's a large % of your portfolio and you're not comfortable with it, I would trim some anyway.",
        "created_utc": 1600104172,
        "id": "g5968b0",
        "score": 7,
        "subreddit": "investing",
        "created": 1600132972.0
    },
    {
        "author": "mrmoneyguesser",
        "body": "Not sure I can on fidelity I only see buy stocks not even options even tho I applied. Fidelity is wack sometimes",
        "created_utc": 1600033561,
        "id": "g5606vh",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1600062361.0
    },
    {
        "author": "fourjnk3",
        "body": "I can confirm that Fidelity does not charge fees for any of the items listed",
        "created_utc": 1599865047,
        "id": "g4vjf09",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1599893847.0
    },
    {
        "author": "ts23_",
        "body": "Sitting here working my 9-5, drinking a black coffee, refreshing my boomer ass Fidelity account watching my hard earned money disappear. Is this what it’s like to be an adult?",
        "created_utc": 1599228881,
        "id": "g3ziueo",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599257681.0
    },
    {
        "author": "DKNG-STONK",
        "body": "From my understanding, everywhere except RH and webull.\n\nI use fidelity. No commissions for buying and selling stocks/warrants, no minimums.",
        "created_utc": 1601414155,
        "id": "g73v3tk",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1601442955.0
    },
    {
        "author": "visionridge",
        "body": "I use Fidelity. All things considered I'm pretty happy with them.",
        "created_utc": 1600454550,
        "id": "g5q9nm6",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1600483350.0
    },
    {
        "author": "oleosmirf",
        "body": "Fidelity takes 48 hours with no fee applied.",
        "created_utc": 1600535442,
        "id": "g5u1uab",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1600564242.0
    },
    {
        "author": "wayyyv",
        "body": "Sitting on a load of bullish spreads and my account closed at $10,050 today. If we don’t open big green tomorrow fidelity is going to liquidate my account. Feeling like I might puke 🤢",
        "created_utc": 1600825372,
        "id": "g69yri7",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600854172.0
    },
    {
        "author": "n-cend",
        "body": "Fidelity you bitch settle my cash already",
        "created_utc": 1598977219,
        "id": "g3ltgd3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599006019.0
    },
    {
        "author": "SloviXxX",
        "body": "Try being -378% on your naked puts. Margin call me Fidelity you fucking punk bitch\n\n&amp;#x200B;\n\n^((Im so scared))",
        "created_utc": 1599292310,
        "id": "g43h84e",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599321110.0
    },
    {
        "author": "EithneDraoct",
        "body": "XOM is probably the best value play. I’ve started averaging in on some FENY, which is a fidelity energy index.\n\nIt’s down around 60% from its high and has exposure to all major oil companies.\n\nAlso, no wars. 🥳 I fuckin hate war.",
        "created_utc": 1599789501,
        "id": "g4s5u37",
        "score": 6,
        "subreddit": "stocks",
        "created": 1599818301.0
    },
    {
        "author": "spyaintnobitch",
        "body": "My Fidelity account got margin called and restricted. I had no idea I was in a margin call because the app doesn't show it, only the website does.\n\n Why I keep using these boomer apps I have no idea.",
        "created_utc": 1599108798,
        "id": "g3t8a7t",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599137598.0
    },
    {
        "author": "areyoume29",
        "body": "Enterprise Bechtel cox loves or fidelity each would work. My favorite would be enterprise.",
        "created_utc": 1600463017,
        "id": "g5qrcoj",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1600491817.0
    },
    {
        "author": "mayor_of_tendie_town",
        "body": "Would prefer SpaceX or Starlink but would like Wawa, Chick-Fil-A, Bloomberg, or Fidelity also.",
        "created_utc": 1600469714,
        "id": "g5r5kad",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1600498514.0
    },
    {
        "author": "No_Strawberry1890",
        "body": "Fidelity.",
        "created_utc": 1600552678,
        "id": "g5vd35m",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1600581478.0
    },
    {
        "author": "Nosefuroughtto",
        "body": "~~Someone just bought 3.5 Million NKLA at \\~33.50. Hot damn.~~\n\n&amp;#x200B;\n\nFucking Fidelity Trader Pro corrected the volume. Nvm.",
        "created_utc": 1600186689,
        "id": "g5dbw8f",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600215489.0
    },
    {
        "author": "WrongWeekToQuit",
        "body": "Not retail investors... just the officers and investment bankers.\n\nNow, Fidelity, if you sell IPO shares in under 30 days, they reserve the right to not let you participate in future IPOs.",
        "created_utc": 1600131100,
        "id": "g5b3za1",
        "score": 6,
        "subreddit": "investing",
        "created": 1600159900.0
    },
    {
        "author": "somanychins",
        "body": "Damn, you literally cannot short sell NKLA at least via fidelity, no shares available to borrow.",
        "created_utc": 1600097532,
        "id": "g58ocqf",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600126332.0
    },
    {
        "author": "mrzane24",
        "body": "Maybe I'm just an old guy, but I have brokerage with fidelity.",
        "created_utc": 1600564001,
        "id": "g5wclt0",
        "score": 6,
        "subreddit": "stocks",
        "created": 1600592801.0
    },
    {
        "author": "LSatou",
        "body": "&gt;I’m a noob I have no clue what that means.\n\nOTC stocks that don't report to otcmarkets.com are considered \"dark.\" When they report their financials they regain \"current\" status.\n\nFidelity is an example of a broker that doesn't allow trading of dark securities. Aside from that, if a company has no released financial data it's quite difficult for investors to actually valuate the company.\n\nGoing current should explain the run up from today, but I know literally nothing about this company so can't comment on what to expect in the future. \n\n&gt;Green or red tmrw?\n\nProbably just... Never type this again. Especially in reference to something that ran 300% in a day lol. Nobody knows the future and you shouldn't be making your trading decisions based on predictions of others. Use the information that others have to make your own conclusions.",
        "created_utc": 1600217681,
        "id": "g5f9787",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1600246481.0
    },
    {
        "author": "dante21oliva",
        "body": "Dam this interesting, I’m 85% 15% on fidelity and robinhood and I’ve definitely felt myself being more likely to lose my robinhood money making decisions off emotion compared to fidelity.",
        "created_utc": 1600805196,
        "id": "g68y15o",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600833996.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Is fidelity the most boomer broker out there.",
        "created_utc": 1600121621,
        "id": "g5akzts",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600150421.0
    },
    {
        "author": "bigcansguy",
        "body": "Use fidelity",
        "created_utc": 1599854408,
        "id": "g4uwwrv",
        "score": 5,
        "subreddit": "RobinHood",
        "created": 1599883208.0
    },
    {
        "author": "Gaston44",
        "body": "How is AAPL down if on Fidelity 80% of the orders have been buys for it",
        "created_utc": 1599155692,
        "id": "g3vl53m",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599184492.0
    },
    {
        "author": "chucktownhorn",
        "body": "For Fidelity, you need 100k in a brokerage account for KKG underwriting the IPO and 500k for everyone else. SNOW was Goldman Sachs and JPMorgan(i think) so you would need 500k in a single brokerage account to get a shot.\n\nEdit: Nvm, should have read a little lower.",
        "created_utc": 1600292566,
        "id": "g5im7o4",
        "score": 5,
        "subreddit": "investing",
        "created": 1600321366.0
    },
    {
        "author": "Napalm32",
        "body": "Fidelity",
        "created_utc": 1600204167,
        "id": "g5eivuq",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600232967.0
    },
    {
        "author": "WeakPressure1",
        "body": "good luck to everyone! No way im touching this but im having fun watching\n\nedit: fidelity ask shows $195",
        "created_utc": 1600268138,
        "id": "g5h5g1g",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600296938.0
    },
    {
        "author": "LSatou",
        "body": "Perfect OTC broker. Hours don't matter because no extended hours for OTC. Interface sucks but whatever. \n\nSlightly better than fidelity because you can trade dark pink sheets if that's your thing.",
        "created_utc": 1600470886,
        "id": "g5r7ldo",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1600499686.0
    },
    {
        "author": "cyzenl",
        "body": "Months of unrest with Global pandemic in an election year with Trump?\nI use Fidelity but ignore their analysis",
        "created_utc": 1599262918,
        "id": "g42830u",
        "score": 5,
        "subreddit": "investing",
        "created": 1599291718.0
    },
    {
        "author": "JefBezosExWifesNewBF",
        "body": "Can fidelity set up a sportsbook so i can gamble with my ira",
        "created_utc": 1600605226,
        "id": "g5yxy57",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600634026.0
    },
    {
        "author": "JayAreOhhh",
        "body": "Negative, jump on Fidelity. If I were loading up from the beginning I would have been on there. Free OTC trades while us other get probed by commission fees.",
        "created_utc": 1601247314,
        "id": "g6wbumz",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1601276114.0
    },
    {
        "author": "Trottingslug",
        "body": "Just fyi: the major catalyst isn't until Wednesday (app launch) and this stock is also going to be a solid growth mid to long-term play, so you still have time to set up an account in Fidelity, TDA, etc. and buy shares before then.",
        "created_utc": 1601254329,
        "id": "g6wo7o6",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1601283129.0
    },
    {
        "author": "ridinderty",
        "body": "I concur, Fidelity customer service is only second to Tings imo. Both outstanding everytime I've called.",
        "created_utc": 1599873259,
        "id": "g4vx9g6",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1599902059.0
    },
    {
        "author": "Slachi",
        "body": "wow...Fidelity actually transferred cash in less than 24 hours. That's never happened before. They must want me to lose more money.\n\nBuying the BND dip lul",
        "created_utc": 1599243895,
        "id": "g40qziw",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599272695.0
    },
    {
        "author": "Dr_Cocke",
        "body": "E*Trade and Fidelity both have it.  I assume most real brokers will let you buy it.",
        "created_utc": 1600647247,
        "id": "g61rn90",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600676047.0
    },
    {
        "author": "zeverbn",
        "body": "It’s crucial that this is done on robinhood too, not on one of them poser capital elitist firms like Schwab and fidelity.",
        "created_utc": 1600667730,
        "id": "g62mt26",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600696530.0
    },
    {
        "author": "morningreis",
        "body": "I was looking at a list of biggest movers/losers one on my Fidelity app almost 3 years ago. It had dipped down to $0.74 one day with a 1 year high of like $7. I just looked at the history and saw it cycling every few months. I put $200 in, got $400 out not long after. I did increasingly bigger trades. They were below $1 long enough this year that they were told they would get delisted. I put about $3k in over a few weeks and waited on it. Sold for about $7500 about 3 months ago. I had about 4000 shares... really wish I knew it would go to the moon like this",
        "created_utc": 1600885813,
        "id": "g6cd2tm",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600914613.0
    },
    {
        "author": "GlowingViral",
        "body": "If you trade in the US, the ticker is HNCKF\n\nIt's on Fidelity and Schaub, but not on RH",
        "created_utc": 1600205524,
        "id": "g5elwce",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1600234324.0
    },
    {
        "author": "Intermittent_reality",
        "body": "I have PASO shares in both Fidelity and Schwab.  Be careful of voluntary reorganization fees for trading in common for preferred. I am trying to get info on those, will post when I finally do.",
        "created_utc": 1600295983,
        "id": "g5itsne",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1600324783.0
    },
    {
        "author": "ThereforeIV",
        "body": "Also known as a great day to buy.\n\nI get paid monthly at the end of the month, it takes a few days for the money to get to my Fidelity brokerage account, this timing was absolutely perfect to buy into a nasdaq index fund today!\n\nDirty little secret, it is easier to make big profits when the market goes down some occasionally, than when it only goes up.\n\nYou get these great moments to buy on the cheap then watch the market shoot back up in a few days.",
        "created_utc": 1599193467,
        "id": "g3y4v3k",
        "score": 4,
        "subreddit": "investing",
        "created": 1599222267.0
    },
    {
        "author": "JefBezosExWifesNewBF",
        "body": "Im gonna wake up like a kid on Christmas tomorrow morning to see how many shares of SNOW are in my account. Probably none because i have the lowest networth of anyone at fidelity to apply for it\n\nSo ill be chasing with the rest of you",
        "created_utc": 1600165312,
        "id": "g5cbx91",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600194112.0
    },
    {
        "author": "braydeeee",
        "body": "Why doesn’t Fidelity show AH movements 😫",
        "created_utc": 1600899026,
        "id": "g6d2mzp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600927826.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "Dumped the warrants last Fri for $7+\n\nFelt validated when it went below $6, imagine my surprise to see how much they were at again today. They were basically free money and I'm glad I loaded up enough units to get these, even if Fidelity was a bit slow in splitting them.\n\nI don't know the market forces behind these pricing but if they drop below $4 I'll add some back again. For now I continue to hold the commons.",
        "created_utc": 1600125997,
        "id": "g5atlif",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1600154797.0
    },
    {
        "author": "bigdickofwallstreet",
        "body": "It's a lot calmer now that Fidelity has restricted my account. I ain't calling them either",
        "created_utc": 1599835369,
        "id": "g4tt9t5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599864169.0
    },
    {
        "author": "ixamnis",
        "body": "All of the above information comes from Fidelity. I generally use Fidelity and TD Ameritrade to gather information, but I will also look at Forbes, the Wall Street Journal, Schwab and other sources.  As a single, go-to source, I think Fidelity is top-notch.",
        "created_utc": 1599791913,
        "id": "g4sabis",
        "score": 4,
        "subreddit": "stocks",
        "created": 1599820713.0
    },
    {
        "author": "somanychins",
        "body": "***Margin Debit: Please be advised that trades executed on 09/03/2020 for your account with Fidelity Investments created a margin debit of $94,331.76*** 😳",
        "created_utc": 1599170743,
        "id": "g3wsw5m",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599199543.0
    },
    {
        "author": "LSatou",
        "body": "So you did not do that then and are using a \"cash account\"\n\nYou can buy and sell as many times as you want as frequently as you want but you need to be aware of settled funds.\n\nWhen you sell a stock or make a deposit, the cash takes time to settle. Usually 2 days. Until that happens, the funds are \"unsettled.\" Buying stock with these \"unsettled\" funds and then selling that same stock before the funds settle will get you hit with a Good Faith Violation.\n\nWith fidelity, in the balances tab you need to go to \"additional balances\" to find settled cash. Buying power is both settled and unsettled cash combined.",
        "created_utc": 1599615697,
        "id": "g4i6f6v",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1599644497.0
    },
    {
        "author": "----Felix----",
        "body": "Go o a website like Blackrock or Fidelity and you’ll see their thoughts on which sector the think are over/undervalued today and why. Look up sectors in search.",
        "created_utc": 1600588403,
        "id": "g5y54n2",
        "score": 4,
        "subreddit": "investing",
        "created": 1600617203.0
    },
    {
        "author": "devilmaskrascal",
        "body": "It should be noted that this was likely a direct fallout from the recent Nikola collapse. Nikola has a classified board that at one point included Milton's own family members. Fidelity reportedly protested back in March, which is why his father left the board and Milton stepped down as CEO. \n\nIf Milton convinced enough board members to keep him on, he may never have left Nikola and could have continued to damage the organization for shareholders. At least now they have a fighting chance to rebuild their reputation, but because of the classified board it's possible even this didn't happen.\n\nThis problem is unlikely for HYLN based on what we know, but all investors and all SPACs have to consider such things when they lay out merger agreements that include classified boards. You don't want an unaccountable board protecting a Trevor Milton-type from shareholder accountability permanently.",
        "created_utc": 1601317938,
        "id": "g6z9nc5",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1601346738.0
    },
    {
        "author": "derikwi",
        "body": "I use Fidelity, if you have to wait for your funds to settle, call customer service and they will expedite it for you or place the trade for you.",
        "created_utc": 1601248425,
        "id": "g6wdtzp",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1601277225.0
    },
    {
        "author": "manooch1",
        "body": "I called fidelity and they said they only do this clients in their private fund (10M+ in assets).\n\nAlso, asked a few friends who bank with JP Morgan and they said even their clients with 20M plus are not getting snowflake shares for IPO.",
        "created_utc": 1599683451,
        "id": "g4kzi3u",
        "score": 4,
        "subreddit": "stocks",
        "created": 1599712251.0
    },
    {
        "author": "pliescomb",
        "body": "Yeah I’d love to but when/how is it available? Can’t find it in Fidelity",
        "created_utc": 1599831267,
        "id": "g4tlscn",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1599860067.0
    },
    {
        "author": "JefBezosExWifesNewBF",
        "body": "Ok got the fidelity email. Confirmation is in👍 will check how many shares first thing in the morn",
        "created_utc": 1600223216,
        "id": "g5fje80",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600252016.0
    },
    {
        "author": "peterkozmd",
        "body": "where the hell they getting their numbers? isn't the company like 60x forward and no profits? When do we find out the actual cost it'll be out the gate? also when do they officially announce when they will release on the market? I put in a limit order at 120 and 10 shares, can't put in market order on an ipo fidelity says. I should be good once it opens right?",
        "created_utc": 1600268570,
        "id": "g5h6akl",
        "score": 4,
        "subreddit": "stocks",
        "created": 1600297370.0
    },
    {
        "author": "chewbeccamonkeyrobot",
        "body": "I use fidelity",
        "created_utc": 1600108905,
        "id": "g59k1d1",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1600137705.0
    },
    {
        "author": "danceswithsin",
        "body": "I have no issues with Fidelity but you have to call them to remove some restrictions.",
        "created_utc": 1599766317,
        "id": "g4qenys",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1599795117.0
    },
    {
        "author": "marshallmadness47",
        "body": "Fidelity",
        "created_utc": 1599803450,
        "id": "g4srdmi",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1599832250.0
    },
    {
        "author": "lowXpectations",
        "body": "Fidelity and Schwab, though there are a few restrictions.",
        "created_utc": 1599832206,
        "id": "g4tnf11",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1599861006.0
    },
    {
        "author": "Shmeepsheep",
        "body": "\"You are not eligible to participate in equity new issue offerings through Fidelity Investments. Eligibility is reserved for brokerage customers with a minimum of $500,000. Auction OpenIPOs and Secondary offerings made available through Fidelity are reserved for brokerage customers with a minimum of $100,000 in certain assets held at Fidelity. Members of Premium Services or customers who have placed 36 or more stock, fixed income, or option trades in a rolling 12-month period are eligible for either traditional or auction based offerings.\"\n\nThats what I get trying to participate in the IPO, the secondary just tells me that basically no new participants are allowed.",
        "created_utc": 1599776245,
        "id": "g4rfx0f",
        "score": 3,
        "subreddit": "investing",
        "created": 1599805045.0
    },
    {
        "author": "ContributorZero",
        "body": "FYI, Fidelity just filled my order.",
        "created_utc": 1599834900,
        "id": "g4tsdls",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1599863700.0
    },
    {
        "author": "kapnklutch",
        "body": "Sounds like Fidelity. Just don’t know what the user means by “haven’t paid commission fees in years” since I was under the impression that Fidelity didn’t make the change until late last year. I know some brokerages give “special rates” to big trading/big account holders. Just didn’t know it was that good years ago.",
        "created_utc": 1599183492,
        "id": "g3xo57z",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1599212292.0
    },
    {
        "author": "Caedro",
        "body": "No one knows for sure but some guesses are better than others.  I’m not saying fidelity knows, but there is value in some prediction if you understand what it’s telling you.",
        "created_utc": 1599268399,
        "id": "g42h9qs",
        "score": 3,
        "subreddit": "investing",
        "created": 1599297199.0
    },
    {
        "author": "act17",
        "body": "Fidelity app",
        "created_utc": 1600452924,
        "id": "g5q6ge7",
        "score": 3,
        "subreddit": "stocks",
        "created": 1600481724.0
    },
    {
        "author": "shllionaire",
        "body": "I've used both Fidelity and TD Ameritrade to trade SPACs. I'm currently using TDA for its thinkorswim platform and research material. However, I've seen new SPACs listed earlier and SPAC units split quicker on Fidelity. Both brokerages allow you to trade SPAC units, warrants, and commons, so you're better off with either one of them compared to Robinhood.",
        "created_utc": 1600576756,
        "id": "g5xfmkz",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1600605556.0
    },
    {
        "author": "TUGenius",
        "body": "If it were that easy Intel would've figured it out by now",
        "created_utc": 1600049030,
        "id": "g56vzol",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1600077830.0
    },
    {
        "author": "AoeDreaMEr",
        "body": "That’s a great read. I am a packaging engineer and I loved reading this. As you said, Intel isn’t out of the game yet. But if they don’t get their shit together in next couple of years, they will be the next IBM.",
        "created_utc": 1600179303,
        "id": "g5cuxpx",
        "score": 88,
        "subreddit": "stocks",
        "created": 1600208103.0
    },
    {
        "author": "SwimmingWolf23",
        "body": "Apple’s chip won’t really affect Intels market share. Apple designs their chips based on ARM, which as of right now, is intended for mobile devices such as phones and tablets (laptops in the future). Intel is on x86, and is currently struggling, but Apple and Intel won’t compete until later this year when Apple puts their A series chips in their macs and MacBooks. Even then, they don’t really compete. AMD and Intel will always be more direct competitors than Apple and Intel",
        "created_utc": 1600194148,
        "id": "g5du2og",
        "score": 68,
        "subreddit": "stocks",
        "created": 1600222948.0
    },
    {
        "author": "WorriedBanker",
        "body": "SoftBank Nears $40 Billion Deal to Sell Arm Holdings to Nvidia\n\nUnion of Arm, Nvidia would create a powerhouse in the chip industry\n\n&amp;#x200B;\n\nSoftBank recently has been involved in a series of big asset sales after being under pressure to shore up its flagging stock price.\n\n&amp;#x200B;\n\nSoftBank Group Corp. 9984 1.03% is nearing a deal to sell British chip designer Arm Holdings to Nvidia Corp. NVDA -1.20% for more than $40 billion, according to people familiar with the matter, the latest in a series of big asset sales by the Japanese technology conglomerate.\n\n&amp;#x200B;\n\nThe cash-and-stock deal being discussed would value Arm in the low $40 billions, the people said. The terms under discussion would mark a big win for SoftBank, which bought Arm four years ago for $32 billion and had struggled to jump-start growth in the business.\n\n&amp;#x200B;\n\nArm and Nvidia have been in exclusive talks for several weeks and a deal could be sealed early next week, the people said — assuming it isn’t derailed at the last minute.\n\n&amp;#x200B;\n\nArm designs microprocessors that power most of the world’s smartphones. By joining forces with Nvidia, the combined company would be a powerhouse in the chip industry.\n\n&amp;#x200B;\n\nNvidia is a fast-growing industry player whose chips are used to run the intense calculations for graphics—and play a key role in videogaming, cloud-computing and other activities for which the coronavirus pandemic has stoked demand. That has sent its shares up more than 100% this year, making it the best-performing stock in the S&amp;P 500 index.\n\n&amp;#x200B;\n\nShould a deal come together, it would be one of the largest transactions so far this year and potentially the largest semiconductor deal ever. Though business disruptions stemming from the pandemic have dented global deal volume, consolidation has kept up pace in the semiconductor industry as chip makers seek scale and expand their product portfolios to support the increasing number of everyday items that are connected to the internet. Such linkage is commonly referred to as the Internet of Things. Another of the year’s biggest deals was the $22 billion purchase of Maxim Integrated Products Inc. MXIM -0.53% by fellow chip maker Analog Devices Inc.\n\n&amp;#x200B;\n\nA sale to Nvidia could prompt scrutiny from antitrust regulators and potentially pushback from Arm’s customers, which include major chip makers and electronics manufacturers such as Intel Corp., Samsung Electronics Co. and Apple Inc.\n\n&amp;#x200B;\n\nThe Wall Street Journal reported in July that SoftBank was exploring options for Arm including a full or partial sale or an IPO. Arm had said it planned to transfer two Internet of Things services units into new entities that would be owned and operated by SoftBank as part of a move to focus on its core semiconductor-Ip business. It later reversed course on that move, saying it would instead keep the operations in-house.\n\n&amp;#x200B;\n\nSoftBank, for its part, had been under pressure to shore up its flagging stock price and promised some $40 billion in asset disposals. Most or all of that is already under way or completed and its shares are up more than 20% this year. Among the sales: big chunks of its holdings in China’s Alibaba Group Holding Ltd. and T-Mobile US Inc. following the wireless provider’s merger with Sprint Corp.\n\n&amp;#x200B;\n\nSoftBank has also purchased options tied to around $50 billion worth of individual tech stocks this year. The sheer size of the bet has had an outsize effect on the overall stock market, driving prices higher, the Journal has reported.\n\n&amp;#x200B;\n\nAt SoftBank, Chief Executive Masayoshi Son has been working with a small team to negotiate the Arm deal including the chief executive of the chip company, Simon Segars, Chief Financial Officer Yoshimitsu Goto, as well as Rajeev Misra, CEO of the firm’s giant Vision Fund, and Akshay Naheta, another executive at the fund.",
        "created_utc": 1599933188,
        "id": "g4ycuuh",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1599961988.0
    },
    {
        "author": "Bohdanowicz",
        "body": "Nvidia will hold the performance crown this gen but unlike nvidia, AMD can afford to break even on the consumer GPS this generation to create positive mind share.  Not that they will... but its an option nvidia doesn't have.\n\nI see AMD continuing to eat Intels lunch which alone is enough to push them past 200/300 in the next 2-3 years.  The biggest risk is Intel capitulating on the fab side of things and teaming up with Samsung.  I can see Intel besting AMD on the 8nm Samsung process.\n\nIntel will eventually go fabless.  If they do it in the next 2-3 years amd could be it trouble.  If they insist on being stubborn they are going the way of Nortel long term and AMD will rule x86 with an iron fist.",
        "created_utc": 1600046254,
        "id": "g56r94d",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1600075054.0
    },
    {
        "author": "teegolf1",
        "body": "Companies don’t always come back after crashes even if they are well run. Cisco and Intel are still are not at back to their euphoric dot.com highs reached back in 2000. That’s 20 years with a negative return. 20 YEARS. The euphoria around Apple, Tesla, AMD, NVDIA, etc. has priced these stocks way too high for MANY years to come. It is not sustainable. Reread this well written article and heed the warnings.",
        "created_utc": 1599698732,
        "id": "g4ltouk",
        "score": 24,
        "subreddit": "stocks",
        "created": 1599727532.0
    },
    {
        "author": "sami2525",
        "body": "I'm $12000 in calls over this long weekend. Wish me luck boys.\n\nMSFT, NVDA, INTC, AAPL, PFE, SNE, TSM, RIOT",
        "created_utc": 1599249810,
        "id": "g418l08",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1599278610.0
    },
    {
        "author": "ThrobbnHood",
        "body": "Don't worry, time will prove us right. INTC has fallen out of favor recently but will recover. I've been quietly adding shares since the big drop off :)",
        "created_utc": 1599855345,
        "id": "g4uz1pw",
        "score": 22,
        "subreddit": "stocks",
        "created": 1599884145.0
    },
    {
        "author": "Robomonk3y",
        "body": "Apparently short term it might drop, because NVDA needs to pay for it, but long term, it should fly. But this still needs to pass regulatory approval from Gov authorities. Also we still haven't heard of possible legal challenges from AMD and Intel.",
        "created_utc": 1600043429,
        "id": "g56mfqk",
        "score": 21,
        "subreddit": "stocks",
        "created": 1600072229.0
    },
    {
        "author": "kok823",
        "body": "Intel might as well dump all its cash into this legal battle. Why not after dumping money into shares buyback instead of R&amp;D?",
        "created_utc": 1600047797,
        "id": "g56twie",
        "score": 18,
        "subreddit": "stocks",
        "created": 1600076597.0
    },
    {
        "author": "LavenderAutist",
        "body": "It depends on how much the deal is in stock.\n\nNvidia shares are priced richly. If they do most of it for stock, it's a good deal.\n\nBut I don't think it will matter much.\n\nTheir market cap is $300 billion right now. More than Intel and AMD combined. What's another $40 billion?",
        "created_utc": 1599941527,
        "id": "g4yzmzk",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1599970327.0
    },
    {
        "author": "markerAngry",
        "body": "INTC $58C, 10/9, penny premium, will send $10 if it prints",
        "created_utc": 1600119794,
        "id": "g5ag9or",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1600148594.0
    },
    {
        "author": "RogueJello",
        "body": "Apple isn't really relevant to this discussion, since their license to ARM is guaranteed.  Rather this is much more about Intel v Nvidia.  Intel has been focusing on improving their GPUs, NVidia is about to start focusing on their CPUs.",
        "created_utc": 1600217214,
        "id": "g5f8cbc",
        "score": 17,
        "subreddit": "SecurityAnalysis",
        "created": 1600246014.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "I am amazed about how can the same mistakes  be repeated again, again, and again for years.\n\nEven when the best books warn you. Even when the best investors have quotes about it.\n\nIntel, the industry giant with the largest profit margins and the best positioned to be leading again, underperforms for a while, and all the \"smart\" people talking shit about INTC and paying crazy premium for AMD.\n\nEvery day passes and I am more secure about the quote that says money in the stock market at the end returns to those who it belongs\n\nI am gonna be the first to open a thread in 5/10 years, quoting all the \"smart\" guys who talked nonsense about INTC, and those who dickride AMD.\n\nIt's gonna be funny",
        "created_utc": 1600430793,
        "id": "g5p02it",
        "score": 17,
        "subreddit": "stocks",
        "created": 1600459593.0
    },
    {
        "author": "Tuucan1",
        "body": "I’m deep in INTC with you fellow tard. This is gonna print!",
        "created_utc": 1598994118,
        "id": "g3n45jz",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1599022918.0
    },
    {
        "author": "y0da1927",
        "body": "Depends on who is buying the IPO. \n\nBerkshire probably wants to own the stock, and generally IPOs are underpriced to get a decent return for those who subscribe. They may not want to own the stock but want to be called for more deals, so they bought some to make the broker happy. \n\nA company like Google probably Looking to get an interest in a company they may want to buy in the future, or get a board seat to gain market intel and have some influence on the company. Maybe they just thought it was cheap.\n\nLots of reasons to buy IPOs. All depends on the deal and the buyer.",
        "created_utc": 1600265068,
        "id": "g5gzohg",
        "score": 16,
        "subreddit": "investing",
        "created": 1600293868.0
    },
    {
        "author": "spoookymorty",
        "body": "Whoever told me to buy Intel calls is kind of a shitty person",
        "created_utc": 1599232340,
        "id": "g3zsnx6",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1599261140.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "June 10: Market corrected, VIX flew and then option premiums were fucked for 2 weeks.  \n  \nJuly 13: Market had a small pullback. VIX got killed and option premiums were fucked for a 10 days.  \n  \nAfter these two events, I swore to myself that I won't buy if there is another correction until VIX stabilizes a bit.  \n  \nAnd here I am now, holding 10/16 AAPL, MSFT, FB, WMT, CHWY, INTC and AMD calls that got severely IV crushed despite a big move in the underlying asset.  \n  \nSecond time's a coincidence, third time's just retarded.",
        "created_utc": 1599707120,
        "id": "g4m959m",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1599735920.0
    },
    {
        "author": "WolfOfNallStreet",
        "body": "Where's secret Intel gang...shhhh👀🤫",
        "created_utc": 1599009020,
        "id": "g3o11r0",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1599037820.0
    },
    {
        "author": "oldprecision",
        "body": "NVDIA's market cap is higher than Intel.  Intel ain't buying them.",
        "created_utc": 1599012217,
        "id": "g3o70rv",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1599041017.0
    },
    {
        "author": "Mrseanis",
        "body": "Look at INTC and CVS. Bargains",
        "created_utc": 1599960493,
        "id": "g50m3ij",
        "score": 14,
        "subreddit": "stocks",
        "created": 1599989293.0
    },
    {
        "author": "infinitelimits00",
        "body": "People saying Tesla is overvalued probably are long T, XOM, and INTC 🤡",
        "created_utc": 1599971695,
        "id": "g51jquo",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1600000495.0
    },
    {
        "author": "mr-no-homo",
        "body": "Got that event on Tuesday, I’m pretty sure the new iPhones will be announced then and those leaker nerds are morons. Also, With the transition away from intel chips to ARM Macs, I’m long and hard on AAPL",
        "created_utc": 1599969691,
        "id": "g51d2f2",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1599998491.0
    },
    {
        "author": "p_giggles",
        "body": "I highly doubt Apple would ever try to enter the CPU market outside it's own phones/devices. It would be super dilutive to consolidated margins as Intel's PC processor business is its lowest margin business. Apple just kicked out Intel so it can control everything about the process.",
        "created_utc": 1600373742,
        "id": "g5ml6d7",
        "score": 13,
        "subreddit": "investing",
        "created": 1600402542.0
    },
    {
        "author": "marilius12",
        "body": "The price of a stock alone says nothing about it being cheap or expensive. You need to also consider the number of shares outstanding. That's why instead of looking at the stock quote you should look at ratios like P/E.\n\nSo, what you're asking is what are some value stocks with relatively low P/Es compared to the S&amp;P average for example. There are several sectors that are \"cheap\" - these are your banks like JPM and BAC, manufacturers like MMM and HON, even some tech like INTC, CSCO, and STX.\n\nNote that low P/E are often indicative of low growth expectations. So you are trading stability (low beta) and dividends for capital appreciation.",
        "created_utc": 1600284227,
        "id": "g5i2eod",
        "score": 13,
        "subreddit": "stocks",
        "created": 1600313027.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "I believe in INTC long run. They're not going anywhere. People are prisoners of the moment and don't look to the big picture",
        "created_utc": 1599856645,
        "id": "g4v1tpa",
        "score": 12,
        "subreddit": "stocks",
        "created": 1599885445.0
    },
    {
        "author": "ReversalTheory",
        "body": "Intel run by a buncha retards. How do you botch a launch event that badly lmao",
        "created_utc": 1599065950,
        "id": "g3qmw6u",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599094750.0
    },
    {
        "author": "adamrch",
        "body": "Intel admitted at earnings it had production issues. This is an anonymous source and reads likes a hit piece.",
        "created_utc": 1600167522,
        "id": "g5ce2a9",
        "score": 12,
        "subreddit": "investing",
        "created": 1600196322.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "T\n\nPFE\n\nINTC\n\nO\n\nRTX",
        "created_utc": 1600116103,
        "id": "g5a6g9e",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1600144903.0
    },
    {
        "author": "sleepyguy007",
        "body": "yes, intel also made ridiculous money back then.  CPU prices were actually more in 2000 than now.... like Pentium 200s going for $800.   Profitable company and it still fell 75% and languished for well over a decade before it even got to half its 2000 highs.",
        "created_utc": 1600160455,
        "id": "g5c7sdy",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600189255.0
    },
    {
        "author": "iyioi",
        "body": "ARM is good for mobile and Apple processors. \n\nNot for the majority of windows machines, where AMD is taking market share from intel.",
        "created_utc": 1600030552,
        "id": "g55tqul",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600059352.0
    },
    {
        "author": "Noobenheim97",
        "body": "INTC is a great long term play right now IMO.  It got hit hard because of recent news but in the long haul I think will recover just fine.",
        "created_utc": 1600436290,
        "id": "g5p8c1o",
        "score": 12,
        "subreddit": "investing",
        "created": 1600465090.0
    },
    {
        "author": "detroitvelvetslim",
        "body": "It is running on state of the art Intel Core 2 Duo technology",
        "created_utc": 1599848912,
        "id": "g4uklyj",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599877712.0
    },
    {
        "author": "roundearththeory",
        "body": "&gt;This stock will be a buy the day they put a CEO with an engineering background that'll fire a lot of the dead weight and hire talented people to focus mainly on technology and ease off of the advertisement and stock buy backs.\n\nI've worked at both companies. Morale and leadership at Intel is broken and their current predicament and eroding performance is a lagging indicator of this. Unless there is an extreme hierarchical shakeup and a willingness to refocus R&amp;D dollars (not spend billions on stock buybacks), I'd be extremely wary of the long term trajectory.",
        "created_utc": 1599251373,
        "id": "g41d71p",
        "score": 12,
        "subreddit": "stocks",
        "created": 1599280173.0
    },
    {
        "author": "soap808s",
        "body": "Finally bought myself a new laptop yesterday and had a hard time pulling the trigger for $900 but today $3,000 vanished from INTC calls and I'm numb",
        "created_utc": 1599160429,
        "id": "g3vz9p2",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599189229.0
    },
    {
        "author": "Niklas1311",
        "body": "INTC will moon too. Stocks can only go up. \nSo dont be a 🌈🐻",
        "created_utc": 1599074435,
        "id": "g3r8ymb",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599103235.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "It is 9/2. \n\nThe Intel Tiger Lake announcement is about to begin. \n\nThe live stream starts. A lone mic in front of a dark blue curtain is all that can be seen. \n\nBob Intel, CEO of Intel, descends via tight wire from the rafters like Lady Gaga in that one super bowl half time show a few years ago. \n\nSilence. Utter, deafening silence. \n\nBob takes the mic and clears his throat. A man in the audience kills himself and his family because he can’t take the anticipation. \n\n*”Ladies, Gentlemen. Investors. We have bought the moon.”*\n\nThe curtain falls. The moon shows through a window behind the stage. A large *Intel* logo across its center.\n\nINTC explodes to $100 \n\nBob Intel begins levitating as the crowd breaks out in a frenetic orgy of tears and joy \n\nCOVID is instantly eradicated from the Earth as a wave of euphoria spreads",
        "created_utc": 1598978864,
        "id": "g3ly7c5",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599007664.0
    },
    {
        "author": "JRAXXI",
        "body": "Paint dries faster than INTC moves, but don’t let the haters stop you. \nGood luck! 💎🙌🏽",
        "created_utc": 1598995612,
        "id": "g3n7la1",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599024412.0
    },
    {
        "author": "EatMaTesticles",
        "body": "iPhone 12, Apple Watch 6, new iPad Air, iOS 14, new Macs with Apple silicon (beating Intel in performance) \n\nApple will moon more and more 🚀",
        "created_utc": 1599741933,
        "id": "g4o35ux",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599770733.0
    },
    {
        "author": "GHWBushh",
        "body": "Then if AMD rules it’ll be intel prices all over again, and so the cycle will continue",
        "created_utc": 1600050277,
        "id": "g56y1h7",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600079077.0
    },
    {
        "author": "Apps3452",
        "body": "INTC gang checking in",
        "created_utc": 1599073151,
        "id": "g3r5g36",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599101951.0
    },
    {
        "author": "IDoLikeMyShishkebabs",
        "body": "I sold my AAPL calls before it dipped too hard, now I’m literally all in with INTC Jan 2021 and bought midway down the dip.",
        "created_utc": 1599159657,
        "id": "g3vx8gj",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599188457.0
    },
    {
        "author": "InfiniteValueptr",
        "body": "Intel owns its own fabs; while AMD is fabless and buys wafers from TSMC. Due to their lithographic issues outlined [here](https://www.infinitevalueptr.com/post/intel_10nm) Intel have been forced to turn to TSMC for chips.\n\nThe second part of your statement would be true in a completely free market, but TSMC's management have stated that they don't view Intel as a long term customer (while they do view AMD as one). This is pretty evident given the fact that once Intel sort out their process they'll abandon TSMC and go back to in house manufacturing only, meaning TSMC's long term interests are aligned with ensuring AMD sees long term growth over Intel. From the comments TSMC management has made over the past few years and the execution of their business plans, I believe that TSMC management is focused more on long term value generation than short term profit, meaning your scenario wouldn't be likely to occur.",
        "created_utc": 1600189694,
        "id": "g5djeau",
        "score": 11,
        "subreddit": "stocks",
        "created": 1600218494.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "Intel has a bean counter as a CEO. Even if they put an engineer, you need someone who will change the core culture. They need to hire talent but instead have opted out for nepotism and politics. Their yields are awful, their CPUs were never efficient (Lookup Delidding), their pricing is high, always over heating, always higher than advertised power usage, and struggles to run games by throttling the GPU. Some of these could be my personal experience, but I've seen this posted too many times now.\n\nThey do have an edge on some things, but that's not going to stay long. Their current strategy is to buy back their stock and market against AMD instead of investing in their own technology and talent.\n\nThis stock will be a buy the day they put a CEO with an engineering background that'll fire a lot of the dead weight and hire talented people to focus mainly on technology and ease off of the advertisement and stock buy backs.\n\nIf you've read thus far, great. If you're still not convinced, which most Intel people aren't, here is a question: What would convince you? An actual live video of Lisa Su wiping the floor with Intel CPUs? Because that's already happening benchmark/stock/market share/profit wise.",
        "created_utc": 1599244619,
        "id": "g40t5ep",
        "score": 11,
        "subreddit": "stocks",
        "created": 1599273419.0
    },
    {
        "author": "NorCalAthlete",
        "body": "Rumor has it there’ll be an announcement today around 1pm pacific time on the iPhone 12.  \n\nOverall there’s supposed to be a new iPhone, new iPad, and new MacBook Pro announced among other things.  First generation to use 5G, it’s getting a lidar sensor for augmented reality, plus the MacBook is moving away from intel chips and the new chip is supposed to be insane.\n\nEdit - sources:\n\n\nhttps://www.macrumors.com/2020/08/20/apple-september-10-event-speculation/\n\nhttps://www.cnet.com/news/apple-appears-to-post-september-10-stream-details-for-5g-iphone-event-on-youtube/",
        "created_utc": 1599752347,
        "id": "g4p4ea7",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599781147.0
    },
    {
        "author": "AmishAbe-PA",
        "body": "For me AMD and Tesla. I bought AMD low a few years ago when they were struggling, but I had faith they would improve. Intel couldn’t be the only game in town. A couple of years ago they were like 9 bucks. Now 80.\n\nTesla, well duh. Got them at 220ish a couple years ago.",
        "created_utc": 1599755837,
        "id": "g4pfbtw",
        "score": 11,
        "subreddit": "stocks",
        "created": 1599784637.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "If you ever wanted in on AMD, NVDA, AAPL, TSLA, MSFT, INTC—— who am I fucking kidding if you ever wanted in on some calls on anybody now would be the time",
        "created_utc": 1599167593,
        "id": "g3wkruc",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599196393.0
    },
    {
        "author": "HinduHamma",
        "body": "Just incredible times. You got absolute fucking brain dead retards beating smart money. For not just a couple days or weeks. But like the entire fucking year \n\nLiterally just buying calls on tech . Free money. Any idiot can do it. \n\nTesla , Apple, amd, nvda, zm, etc anything tech (not intel) has won big time and smoked the cocksucker big money institutions and their baby gains. \n\nWhen retards are making money this easily, I get worried a bit. But then there’s him. He eases my concerns. \n\nThe gray fox. Papa Jerome and his majestic af printer.",
        "created_utc": 1598975373,
        "id": "g3lomyk",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599004173.0
    },
    {
        "author": "exoticoptions",
        "body": "Holding Intel. Should run.",
        "created_utc": 1599113526,
        "id": "g3te5hs",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599142326.0
    },
    {
        "author": "Taco_In_Space",
        "body": "Whoever told me to go on on INTC screw your boomer stock",
        "created_utc": 1599063875,
        "id": "g3qhirk",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599092675.0
    },
    {
        "author": "ltsPricedIn",
        "body": "nah bruh intel is the stat that allows you to cast spells",
        "created_utc": 1599015691,
        "id": "g3od7gy",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599044491.0
    },
    {
        "author": "wallthrowawaystreet",
        "body": "Today is the day, INTC bagholders.\n\nToday, INTC goes above and stays above 50.\n\n\\*tightens helmet around my head, drools with a dreamy smile on my face\\*",
        "created_utc": 1600172436,
        "id": "g5cjqyk",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600201236.0
    },
    {
        "author": "widespreadhammocks",
        "body": "So is Nvidia basically making Apple chips now? Did they just totally cuck Intel?",
        "created_utc": 1600041330,
        "id": "g56iuf8",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600070130.0
    },
    {
        "author": "FinndBors",
        "body": "Well, it gives more confidence that their ARM based Mac that they are rumored to release in November is going to be quite performant, which is the primary concern on moving away from Intel.",
        "created_utc": 1600201292,
        "id": "g5ec0t6",
        "score": 10,
        "subreddit": "stocks",
        "created": 1600230092.0
    },
    {
        "author": "7thAccountDontDelete",
        "body": "INTC looks real nice compared to AMD and NVDA. 9 PE, still very profitable, nice dividend.",
        "created_utc": 1599961074,
        "id": "g50o32k",
        "score": 10,
        "subreddit": "stocks",
        "created": 1599989874.0
    },
    {
        "author": "Wastelandrider",
        "body": "Look man I’m no expert but I’m pretty sure this is a really really bad idea. Fedex is gonna be wild at open and I can see a lot of people taking profits Monday with all the uncertainty about the market this coming week and especially with this having the hallmarks of a now classic covid era ER pump and dump. I myself am bullish on FDX staying propped up by institutional money to balance out all the gamblers, but not “20%-run-within 10-days bullish” and considering the frenzy at open, this far otm isn’t gonna qualify as an IV play either. \n\nPlus I’d probably be actually more bullish on the intc calls you already have that are close to the money anyway. \n\nBut then again all my information comes from like 8 minutes of a YouTube video I watched last week so whatever man...\n\nYOLO.",
        "created_utc": 1600055475,
        "id": "g5767zf",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600084275.0
    },
    {
        "author": "B0KCH0Y",
        "body": "Stripper I have on snap chat said she made 3 bands today. Same thanks intc and cost you making me stripper money.",
        "created_utc": 1599083285,
        "id": "g3rw7n4",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599112085.0
    },
    {
        "author": "Persian_Allah",
        "body": "Oh lord INTC IS GONNA MOOONNNNN they just announced some hype shit",
        "created_utc": 1599062763,
        "id": "g3qesg7",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599091563.0
    },
    {
        "author": "yCranjisMcBasketball",
        "body": "Wake up and pop a cialis and think about the guy that tried shorting Tesla while I do pushups waiting for my Intel calls to pump",
        "created_utc": 1598992692,
        "id": "g3n09rg",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599021492.0
    },
    {
        "author": "Oni_Haze",
        "body": "INTC just break $52 you fucking tease",
        "created_utc": 1599058024,
        "id": "g3q30rz",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599086824.0
    },
    {
        "author": "gaysaucemage",
        "body": "Intel should stream to Youtube, this is why people hate them. We don’t wanna register for boomer investor relations...\n\n\nhttps://www.cvent.com/events/intel-launch-event/registration-a906cbb167f841b4b335a17ccc057f6d.aspx?r=cc8c6bf6-30c1-49d6-8bd0-3152c74e5988&amp;refid=Media&amp;tystub=77qq83&amp;fqp=true",
        "created_utc": 1599062718,
        "id": "g3qep43",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599091518.0
    },
    {
        "author": "giancarlov345",
        "body": "intel wakeup faggot",
        "created_utc": 1599065244,
        "id": "g3ql2eg",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599094044.0
    },
    {
        "author": "realjpow",
        "body": "Intc 💎 🖐",
        "created_utc": 1599064395,
        "id": "g3qiu68",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599093195.0
    },
    {
        "author": "mystriddlery",
        "body": "Intel has once again delayed production of their 7nm mountain bike as they think it’s still too small for human riders, now expecting a 2022 release date",
        "created_utc": 1599514308,
        "id": "g4dpla9",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599543108.0
    },
    {
        "author": "SillyfkiNGo0se",
        "body": "Intel is fukd",
        "created_utc": 1600042359,
        "id": "g56kkzd",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600071159.0
    },
    {
        "author": "Shadicare",
        "body": "My INTC calls went up almost 30% today with the stock going -0.31%.  Imagine what they'll do when it moons tomorrow",
        "created_utc": 1599006739,
        "id": "g3nvx60",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599035539.0
    },
    {
        "author": "stamou5214",
        "body": "Hey, I'm a gamer and tech enthusiast and I know a couple of things. I'm only going to comment about what you said about the 11th gen being 30% better than AMD. Wrong. The benchmarks where cherry picked and highly in favor of intel, not going to go into specifics. They were just bullshit. If you are really interested i suggest you look it up yourself. Check hardware unboxed and gamernexus for real benchmarks on YouTube. Best of luck with your stocks.",
        "created_utc": 1599861139,
        "id": "g4vbye9",
        "score": 9,
        "subreddit": "stocks",
        "created": 1599889939.0
    },
    {
        "author": "Y_u_lookin_at_me",
        "body": "As a IT person  before I buy a tech stock I study their hardware architecture and see if it's competitive in the market and then buy right before it drops, watch the stock go up, and then sell. I knew amd's heterogeneous architecture was going to be a hit back when amd was 3-5$ ( I didn't have capital back then but my coworker did and he made like sixty racks at least) so I'm gonna be looking into AMDS RDNA and Navi 2. I also keenly watch what new company Jim keller goes too as he's a genius and made apples soc, ryzen, tesla's insane 21x improvement soc, etc. Right now he's in Intel trying to save their burning so perhaps Intel's new architecture is going to win but I doubt it.",
        "created_utc": 1600372348,
        "id": "g5mhczd",
        "score": 9,
        "subreddit": "stocks",
        "created": 1600401148.0
    },
    {
        "author": "PhatCalls",
        "body": "My INTC printing straight Benjamin franklins bitch",
        "created_utc": 1599096845,
        "id": "g3so1kb",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599125645.0
    },
    {
        "author": "AceVonSpades",
        "body": "Ill try to make this quick for those fortunate enough to still have buying power after today\n\nThis market is in warp speed, tech sector moves into \"return to normal\" phase within the next week-ish(tmrw wouldnt surprise me).  Some undervalued tech wont be as affected and will continue upward movement(see INTC) and some relative strength will remain in the sector. But expect more bleeding from the ones that had yuge run ups (ZM)\n\nNext leg up will be fueled by recovery plays to build on top of the already strong tech sector.  The vaccine is coming whether you like it or not. Put your political b.s. aside.  This is going to be a green light for getting covid impacted businesses going again at almost 100%. Again, just because you dont like Trump isnt a good counter argument.  Get over it.  Position yourselves accordingly; things like (good)airlines, cruise lines, retail, restaurants, DIS...  might even add in financials\n\nPersonally, I'll be leaving a little bit of reserves to savagely go balls deep into Palantir when they do their ipo later this month.\n\nThanks for coming to my Ted Talk",
        "created_utc": 1599180878,
        "id": "g3xjb25",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599209678.0
    },
    {
        "author": "smallstreetgains",
        "body": "##Top trending tickers, sentiments, and options on /r/wallstreetbets for the day of September 02, 2020.\n\n────────────────\n\n###Trending Tickers:\n\n**Ticker**|**Company**|**Mentions**|**Bulls / Bears**|**Price**|**Change**|**P/E**\n:-:|:--|:-:|:-:|:-:|:-:|:-:\nTSLA|Tesla, Inc.|1638|78.10% / 21.90%|$440.56|-7.26%|1222.47\nAAPL|Apple Inc.|699|85.84% / 14.16%|$131.44|-2.04%|40.79\nRKT|Rocket Companies, Inc.|624|84.44% / 15.56%|$32.46|5.70%|47.17\nNVDA|NVIDIA Corporation|441|82.11% / 17.89%|$572.09|3.48%|101.36\nSPY|Exchange Traded Fund|303|66.50% / 33.50%|$357.69|1.44%|-\nINTC|Intel Corporation|303|89.08% / 10.92%|$52.59|3.55%|9.34\nPTON|Peloton Interactive, |259|92.93% / 7.07%|$90.06|7.64%|-\nMSFT|Microsoft Corporation|169|90.57% / 9.43%|$232.06|2.11%|39.43\nCRWD|CrowdStrike Holdings,|124|88.00% / 12.00%|$141.63|-1.44%|-\nDOCU|DocuSign, Inc.|124|84.13% / 15.87%|$264.82|-1.48%|-\nDKNG|DraftKings Inc.|123|87.18% / 12.82%|$39.95|8.19%|671.45\nQQQ|Exchange Traded Fund|118|80.00% / 20.00%|$303.03|1.04%|-\nZM|Zoom Video Communicat|117|50.00% / 50.00%|$425.35|-7.07%|2528.67\nAMD|Advanced Micro Device|99|76.19% / 23.81%|$90.14|-2.21%|183.26\nVXX|Exchange Traded Fund|97|87.50% / 12.50%|$28.06|2.90%|-\nWMT|Walmart Inc.|92|95.65% / 4.35%|$147.93|0.23%|28.07\nCHWY|Chewy, Inc.|76|83.87% / 16.13%|$70.66|1.77%|-\nWORK|Slack Technologies, I|75|85.96% / 14.04%|$33.52|-2.27%|-\nFB|Facebook, Inc.|71|89.47% / 10.53%|$302.57|2.41%|37.69\nAMZN|Amazon.com, Inc.|56|91.30% / 8.70%|$3530.01|0.88%|134.50\nSLV|Exchange Traded Fund|56|83.33% / 16.67%|$25.55|-2.24%|-\nCOST|Costco Wholesale Corp|55|95.24% / 4.76%|$359.57|2.33%|41.53\n\n\n────────────────\n\n###Trending Options:\n\n**Ticker**|**Strike**|**Type**|**Expiration**\n:-:|:-:|:-:|:-:\nTSLA|$500|Call|9/4\nRKT|$30|Call|9/18\nTSLA|$500|Call|10/16\nAAPL|$135|Call|10/16\nCRWD|$200|Call|9/4\nRKT|$40|Call|9/18\nAAPL|$140|Call|9/18\nINTC|$55|Call|9/11\nPTON|$100|Call|9/11\nNVDA|$600|Call|9/4\nNVDA|$570|Call|9/4\nINTC|$52|Call|9/11\nFDX|$240|Call|9/25\nAAL|$13|Call|9/11\nPTON|$90|Call|9/18\n\n\n────────────────\n\n###Trending Sentiment:\n\n**Sentiment**|**Comments**|**%**\n:--|:--|:--\nBullish|2883|72.90%\nNeutral|13126|-\nBearish|1072|27.10%\n\n\n────────────────\n\n###Other Data:\n\n**Overall Market Sentiment:** Bullish\n\n**Comments Searched:** 17081\n\n**Newly Trending Tickers:** DKNG, COST\n\n────────────────\n\nYou can view all top trending tickers on /r/RedditTickers.\n\nNotice an error or have questions? Reply to this post or message /u/smallstreetgains.\n\nFinancial data provided by [finviz](https://finviz.com/).",
        "created_utc": 1599077228,
        "id": "g3rgrw8",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599106028.0
    },
    {
        "author": "dd16134",
        "body": "Tomorrow’s game plan:\n1. Sell BABA $300c at open peak for juicy profit\n2. Maybe buy one 12/18 $170c for $WMT\n3. Put rest of my account into $TSM $85c for 10/16 (look it up- multiple hedge funds picked it up this week, unusual options activity, good earnings expected 10/15, talks with Trump about moving business into Arizona, leagues ahead of Intel tech wise, AMD/NVDA are customers)",
        "created_utc": 1599010779,
        "id": "g3o4efh",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599039579.0
    },
    {
        "author": "Today-",
        "body": "When is this supposed INTC announcement?",
        "created_utc": 1599062764,
        "id": "g3qesjh",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599091564.0
    },
    {
        "author": "jdp111",
        "body": "Is it racist to say Intel needs an Asian CEO to turn them around?",
        "created_utc": 1599001827,
        "id": "g3nkr5t",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599030627.0
    },
    {
        "author": "WagieInTheCagie",
        "body": "INTC gang we out here 👌 If you ain't wit us you against us 🙅🏿",
        "created_utc": 1599057949,
        "id": "g3q2udf",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599086749.0
    },
    {
        "author": "Today-",
        "body": "Feeling fucking thankful for the bread this week.\n\n&amp;#x200B;\n\n\\+140% on PLAY (only $140 position but /shrug im happy)\n\n\\+100% on WMT on both earnings AND + announcement, two separate trades.\n\n\\+60% on INTC today\n\n\\+50% on M earnings overnight\n\nVXX even gave me 5%-10% as a fucking hedge.\n\nFor the losses:\n\n\\-30% on PSX calls\n\n\\-30% on RAD calls\n\n\\-10%on  MJ calls\n\nbut fortunately these were smaller positions, and much less % lost.\n\nA good week after getting wiped for 5k in June.",
        "created_utc": 1599066015,
        "id": "g3qn268",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599094815.0
    },
    {
        "author": "mathboom123",
        "body": "I have a feeling INTC is gonna moon",
        "created_utc": 1599526837,
        "id": "g4eb3lc",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599555637.0
    },
    {
        "author": "saifly",
        "body": "Holding January AAPL 150 calls, January INTC 60 calls and October TSLA 500 calls\n\nThings will be ok... r-right? 🥺🥺🥺",
        "created_utc": 1599336776,
        "id": "g45sg64",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599365576.0
    },
    {
        "author": "BenjerminGray",
        "body": "how is x86 companies like AMD and INTEL gonna benefit from this?",
        "created_utc": 1600054718,
        "id": "g57540y",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1600083518.0
    },
    {
        "author": "yCranjisMcBasketball",
        "body": "We all been sitting parked waiting for the INTC tendietown express to blow the whistle",
        "created_utc": 1598996110,
        "id": "g3n8pr7",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599024910.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Imagine INTC announces 7nm back on track to finish production  Early..... 🙌🙌",
        "created_utc": 1599060641,
        "id": "g3q9emk",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599089441.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "Pros of playing INTC: you survived/shrugged-off Thursday and Friday.\n\n\nCons of playing INTC: you also shrugged off the entire month of gains.",
        "created_utc": 1599532360,
        "id": "g4ek8s6",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599561160.0
    },
    {
        "author": "BlackBearMundane",
        "body": "Hi all, new to the WSB community and Reddit in general. Over the last month while patiently waiting to contribute posts to this form, I decided to try options trading. Took my 2k of investing monies up to 4.5k in just a couple days. Pure excitement. Then beginners luck ran out and I slowly dwindled down to a mere $30.... here I am now holding a $90 9/18 call on Starbucks and a $51 9/11 call on Intel. Pls pray for me",
        "created_utc": 1599783196,
        "id": "g4rttvh",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599811996.0
    },
    {
        "author": "Maximatux",
        "body": "HOLY SHIT THIS INTEL ANNOUCEMENT IS STRAIGHT UP CRINGE.",
        "created_utc": 1599063287,
        "id": "g3qg026",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599092087.0
    },
    {
        "author": "getgoingfast",
        "body": "If anything, this is bad new for INTC. \n\nCoupled with ARM's CPU and GPU, Nvidia is major threat to already wobbly Intel's DCG business. Yet people on here debate how undervalued INTC is right now (10nm fail check, 5G fail check, Nirvana ML fail check,  McAfee fail check, 6 months delay of 7nm check...), see the reason?",
        "created_utc": 1599945236,
        "id": "g4zbw8q",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599974036.0
    },
    {
        "author": "infinitelimits00",
        "body": "At this rate even Intel might be up 1% 😂😂",
        "created_utc": 1600049255,
        "id": "g56wcyd",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600078055.0
    },
    {
        "author": "DFB313",
        "body": "on the contrary. They stand to gain the most of anyone on earth.   \n\n\nSuddenly if you want their datacenter grade GPUS (they limit industry use GPUS and APUS) you have to use ARM as they only make drivers for ARM for those GPU.\n\n  \nThen suddenly, just maybe, they plan to stop supporting x86\\_64 completely, and develop something not unlike risc-v with the previous ARM team behind it. They now have a proprietary chip with none of the backwards compatability slow downs that come with Intel based chips. (they hold backwards compatible registers going back to the 1970s, taking up valuable die space).   \n\n\nSuddenly RISC might be able to leverage it's benefits to become CRISC-V with that kind of backing, and since RISC is always clock cycle fast, x86 will literally die when CRISC-V comes (multiple RISC executions per clock cycle, a complex reduced instruction set computer).   \n\n\nThat's it. That's game over. One architecture ecosystem",
        "created_utc": 1599979983,
        "id": "g525dvg",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600008783.0
    },
    {
        "author": "namsilat",
        "body": "I’m trapped in a fucking observer effect with my INTC leaps.    I’ve been holding the position and bleeding out for months.  Once I sell, it will explode, if I don’t sell, it will bleed out theta for the next 1000 years.\n\nI need to somehow watch it without watching it.",
        "created_utc": 1600101850,
        "id": "g58zphs",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600130650.0
    },
    {
        "author": "accountinreddit",
        "body": "You guys are missing out on the scoop of the century, the trucks have HTML5 super computers and using they have built their own chips. \n\nNvidia, Intel, Cisco all are worried and believe this can bankrupt them",
        "created_utc": 1600138360,
        "id": "g5bguh9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600167160.0
    },
    {
        "author": "sleepyguy007",
        "body": "intels 10nm+ process that tigerlake-u is using has about the same density as the tsmc 7nm+ process (which I think the zen3 chips will use... the current zen 2 chips use tsmc 7nm non plus which is less density than intel 10nm+.... the process names are basically just marketing labels and almost meaningless).\n\nThe reason those benchmarks look good for intel is they spent way more of the die on GPU than they usually do and have better clock speed  than the current ryzen 4800u.  So per core they are doing better and also more gpu speed / cores.   They sacrificed cores for that, hence the lower multithreaded.  I'd guess intel figures most people using thin and light notebooks don't really need 8 cores and would rather have more GPU., probably a good tradeoff for most people\n\nThere will eventually be a tigerlake - H is rumored to actually have less GPU onboard than tigerlake-u since I guess its assumed those will use discrete graphics anyway.  So Intel probably will sell a lot of tigerlake.  It shouldn't really lose much ground on laptops if any in the next year or 2.  I do own a lot of intel shares, and fully expect it to get back to $60 ish in the next 3-6 months.  There is actually a shortage of laptops / chromebooks right now because of the wfh / school from home thing even for the older cpus so Intel should do allright",
        "created_utc": 1600361169,
        "id": "g5lpmnv",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600389969.0
    },
    {
        "author": "sc0tt_1990",
        "body": "Intel just went red AH, it's over boys, it's over for tech.",
        "created_utc": 1599173760,
        "id": "g3x18is",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599202560.0
    },
    {
        "author": "TEdward504",
        "body": "This futures turn around got me feeling like INTC will moon tomorrow",
        "created_utc": 1599098138,
        "id": "g3sqiyx",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599126938.0
    },
    {
        "author": "Jackie296",
        "body": "If INTC manages to pull a nvda AH, I will be in tendie heaven. From -70% to +10%",
        "created_utc": 1599058475,
        "id": "g3q43ho",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599087275.0
    },
    {
        "author": "jaguarpawww",
        "body": "lost a quick 40% on my intel calls in the last 2 hours.. sick sick",
        "created_utc": 1599066946,
        "id": "g3qpjws",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599095746.0
    },
    {
        "author": "somanychins",
        "body": "INTC moved after hours. I wouldn't believe it if I hadn't seen it. 🐯Lake Time.",
        "created_utc": 1599001414,
        "id": "g3njtn9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599030214.0
    },
    {
        "author": "swaggymedia",
        "body": "Todays WSB Sentiment, Presented by Swaggy\n\nTotal Comments Parsed Last 24hrs: 50,497\n\nLots of long $ROPE today.\n\nTicker | Comments | Bullish %\n:--|:--:|:--:\nTSLA|3489|80%\nAAPL|1752|88%\nRKT|797|81%\nQQQ|377|77%\nNVDA|369|83%\nPTON|294|93%\nZM|260|60%\nDOCU|257|90%\nAMZN|228|80%\nMSFT|209|87%\nAMD|167|82%\nSLV|162|79%\nINTC|151|88%\nWMT|148|91%\nUVXY|137|82%\nSAVE|136|86%\nFDX|135|92%\nROPE|127|90%\nGLD|124|80%\nFB|98|83%\nEAT|92|81%\nTQQQ|83|79%\nUPS|83|82%\nCOST|82|86%\nCRWD|82|84%",
        "created_utc": 1599169629,
        "id": "g3wpxrt",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599198429.0
    },
    {
        "author": "WagieInTheCagie",
        "body": "If you're not in INTC you ain't black",
        "created_utc": 1599055988,
        "id": "g3pya86",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599084788.0
    },
    {
        "author": "Frostfright",
        "body": "If you sell INTC now, your melanin is forfeit.",
        "created_utc": 1599066599,
        "id": "g3qok62",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599095399.0
    },
    {
        "author": "hawkbearpig",
        "body": "Tiger lake has horrible yields.  OEMs are reporting that their orders from Intel are being massively shorted.  Not only that, it's waaaay expensive for Intel to manufacture because of the horrible yields.  \n\n\nNo thanks.  I'm staying away from this garbage company that is bleeding talent.  It's a technology company that is led by bean counters.",
        "created_utc": 1599242549,
        "id": "g40mjmn",
        "score": 8,
        "subreddit": "stocks",
        "created": 1599271349.0
    },
    {
        "author": "moneygardener",
        "body": "Both $AMD and $AAPL uses $TSM for the manufacturing of their chips.  \n\n\nIt's TSMC who has the fabs where they are developing smaller and smaller transistors (nodes)\n\nApple is their biggest customer and has first \"dibs\" on the newest nodes.\n\nThis is why apple comes first with 5nm.\n\nAMD to follow.\n\nPoor INTC :P nah just kidding. INTC is Evil.",
        "created_utc": 1600205366,
        "id": "g5ell6t",
        "score": 8,
        "subreddit": "stocks",
        "created": 1600234166.0
    }
]