[
    {
        "author": "bitflag",
        "body": "IBM has been around for a long time too and was once the mighty indestructible owner of all things computer. They are still making money but it's shadow of its former self.",
        "created_utc": 1580701217,
        "id": "fgejt0u",
        "score": 5,
        "subreddit": "investing",
        "created": 1580730017.0
    },
    {
        "author": "Sir-Lt-Cpt-Obvious",
        "body": "Better hope IBM has a good run tomorrow otherwise those calls with be worthless mid day.",
        "created_utc": 1581032342,
        "id": "fgqvgf7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1581061142.0
    },
    {
        "author": "Jordykins850",
        "body": "Since the sub has so far missed the IBM train.. Oracle might be next. Yes, they’re a distant 5th to IBM, GOOG, MSFT and AMZN in the cloud.. but does that even matter anymore? They’ve got a buzzword attached to their name via CLOUD CUMPUTERING, a semi-decent yield for a potential (hypothetically potential) growth company and are still down across the last 3 months. We should make it our new meme stonk.",
        "created_utc": 1580953377,
        "id": "fgnuth4",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1580982177.0
    },
    {
        "author": "sid12385",
        "body": "IBM can this be our next meme?",
        "created_utc": 1580922774,
        "id": "fgme4yu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1580951574.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM, it has room to grow from all 3 areas of investment these days. FOMO, real growth/overall positive sentiment, yield making it an attractive defensive.",
        "created_utc": 1581040049,
        "id": "fgr7ibh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1581068849.0
    },
    {
        "author": "iamsquidly",
        "body": "Twitter puts, spy Longs, IBM Puts I have a small dick",
        "created_utc": 1580937174,
        "id": "fgn3tlw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1580965974.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM calls EOD also aren’t a bad idea. Literally been a morning pump for a week now.",
        "created_utc": 1580926090,
        "id": "fgmjxtk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1580954890.0
    },
    {
        "author": "InformalAdvise",
        "body": "IBM to the **MOON!**",
        "created_utc": 1581011826,
        "id": "fgptqfh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581040626.0
    },
    {
        "author": "Mpcars",
        "body": "IBM and UNH the goats for today",
        "created_utc": 1580941862,
        "id": "fgncbiu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1580970662.0
    },
    {
        "author": "MangoManBad",
        "body": "Traitors chosing IBM over MSFT. **Traitors.**",
        "created_utc": 1581015748,
        "id": "fgq0vq9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581044548.0
    },
    {
        "author": "6edge9lord",
        "body": "lmfao bro you bought the right to buy 800 shares of IBM at the $160 strike price. you spent $.09/share, sell it for more than that and you'll be ok",
        "created_utc": 1581008727,
        "id": "fgpo6es",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581037527.0
    },
    {
        "author": "iTradeWithMyBallz",
        "body": "I have 50k in 2/21 ibm puts.\nNew ceo news got the stock going a little bit, but the hype died down and this will drop.",
        "created_utc": 1581029241,
        "id": "fgqqbdf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581058041.0
    },
    {
        "author": "Confident-Car",
        "body": "IBM is a boomer company. RIP",
        "created_utc": 1581011903,
        "id": "fgptvj1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1581040703.0
    },
    {
        "author": "saul_2",
        "body": "Buy Facebook ($FB). Best value FAANG/Big 5 tech company. Trading at $203 at the moment with tons of room for growth. Should recover quickly from the drop and has solid fundamentals.\n\nAnother option would be International Business Machines ($IBM) I think it is an interesting and compelling stock to have because of their growing profitability and new leadership (plus it has a dividend). Then you could diversify and add some riskier stocks like AMD, Uber, Pinterest, Snap, and GE. All with growth potential but with a good amount of risk.",
        "created_utc": 1580750648,
        "id": "fgfyy7q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580779448.0
    },
    {
        "author": "Not-The-Government-",
        "body": "AWS and Azure are the top dogs right now, I don't know off the top of my head how much corporate business google really does. IBM acquiring redhat is actually really interesting even though theyre a few years late to the game. Google def has hard competition, we'll see.",
        "created_utc": 1580759730,
        "id": "fggdqpa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580788530.0
    },
    {
        "author": "ThaDelio",
        "body": "So theoretically since you’re ahead of the curve. Is it smart to buy back in Tesla $1000+ calls expiring this week for gains or just take my gains and run and wait for something else? Down $1350 on last 2 weeks.. Tesla helped rekindle $150-250 of that today and so did IBM $144 call I had purchased for .84 and sold at 3.30.. still trying to climb back.. want to be smart. Ideas ?",
        "created_utc": 1580774844,
        "id": "fgh22gk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580803644.0
    },
    {
        "author": "uninfinity",
        "body": "Being the true autist the only play I took ended up being a loser so just been monitoring these and last 7 out of 10 were pretty profitable had I taken the bet. Some were BABA calls before phase-1 Gyna signing, INTC $68 calls last month, TSLA calls of course, RH calls, IBM calls, all worked out.",
        "created_utc": 1580610236,
        "id": "fg85qgy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580639036.0
    },
    {
        "author": "Jordykins850",
        "body": "I’m going to hope my spy puts recover, they probably won’t.. then roll into the weekend with spy, HK puts. IBM, XLP, Tyson chicken calls.",
        "created_utc": 1581042825,
        "id": "fgrbki6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581071625.0
    },
    {
        "author": "johnnybudge",
        "body": "Starbucks, Apple, IBM, AIG, GM, Lego, Ireland, Napoleon, Winston Churchill, Liverpool, and Tiger Woods.",
        "created_utc": 1581082434,
        "id": "fgsewq2",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1581111234.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM opening down 1%",
        "created_utc": 1581083570,
        "id": "fgsgcig",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581112370.0
    },
    {
        "author": "Jordykins850",
        "body": "Opening up HK etf puts, Marriott puts and IBM calls today. Wish me luck my ‘lil auties",
        "created_utc": 1581085105,
        "id": "fgsidgu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581113905.0
    },
    {
        "author": "Sir-Lt-Cpt-Obvious",
        "body": "$160 calls are a guarantee that you can buy the stock for $160 even if they shot up to $1,000 over night, which is why options can be so valuable. However, they have to be above the strike... in this case  $160.  Right now your calls are basically worthless because it's very very unlikely IBM will hit $160 tomorrow, and if it does, your $160 call would still be worthless, unless the stock  surpassed $160. This is why a short expiration on options can be so risky.",
        "created_utc": 1581032717,
        "id": "fgqw344",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581061517.0
    },
    {
        "author": "Geauxin",
        "body": "If ibm is over 160 then you options are basically worth however much IBM is over 160.\n\nHowever there is like a .001% chance of that",
        "created_utc": 1581019240,
        "id": "fgq7des",
        "score": 1,
        "subreddit": "options",
        "created": 1581048040.0
    },
    {
        "author": "-JPMorgan",
        "body": "I mean it doesn't take insane skill as an investor to chose Microsoft over Pets.com. I could understand the argument with maybe Dell or IBM though.",
        "created_utc": 1580897347,
        "id": "fglh1g8",
        "score": 1,
        "subreddit": "investing",
        "created": 1580926147.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM growing cloud faster than GOOG.. only thing boomer about it is the fucking redic high yield",
        "created_utc": 1580920807,
        "id": "fgma8ee",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580949607.0
    },
    {
        "author": "slayerbeans",
        "body": "Wait for dividend pay before selling - if you do plan to sell. I am also thinking about selling. \n\nI have IBM since 2016. I regret not selling when it went up to $180 and dropped back to the price I originally purchased it for on 2018. I held on, purchased more stocks and reminded myself that this a long term investment. But now there are more competition, I am leaning towards selling all.",
        "created_utc": 1580940721,
        "id": "fgnacha",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580969521.0
    },
    {
        "author": "Duckinator617",
        "body": "Anyone think IBM has any more gas left in the tank?",
        "created_utc": 1580942019,
        "id": "fgncl2f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580970819.0
    },
    {
        "author": "angrynapkin1",
        "body": "Microsoft’s price history is a bit odd though... it was stagnant for a long time until recent initiatives started paying off. If you compared dot com to 2014 between SPY and MSFT, SPY would have easily won. MSFT future was very cloudy during Ballmer days.. seemed like it was becoming another IBM, losing to Google, Amazon, Facebook at everything except Windows, which was declining in share as well.",
        "created_utc": 1580837354,
        "id": "fgj5hfh",
        "score": 1,
        "subreddit": "investing",
        "created": 1580866154.0
    },
    {
        "author": "Jcpmax",
        "body": "Bigger than IBM now",
        "created_utc": 1580823802,
        "id": "fgijwff",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580852602.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM up 21 in a week",
        "created_utc": 1580999322,
        "id": "fgp8bnj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581028122.0
    },
    {
        "author": "iTradeWithMyBallz",
        "body": "IBM popped because of new ceo, the hype will die off soon and the bulls will come back to reality. Going 3-4 weeks out if I find the sweet spot to enter",
        "created_utc": 1581002430,
        "id": "fgpd80a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581031230.0
    },
    {
        "author": "show-up",
        "body": "Bing definitely in the lead to be top AI. Right next to IBM Watson.",
        "created_utc": 1580915850,
        "id": "fgm17uz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580944650.0
    },
    {
        "author": "ernieballer",
        "body": "And the head of that acquisition is now the IBM ceo",
        "created_utc": 1580583958,
        "id": "fg74qdk",
        "score": 1,
        "subreddit": "investing",
        "created": 1580612758.0
    },
    {
        "author": "3000dollarsuitCOMEON",
        "body": "PAC, WFC, IBM",
        "created_utc": 1580566054,
        "id": "fg6f0ca",
        "score": 1,
        "subreddit": "investing",
        "created": 1580594854.0
    },
    {
        "author": "david_chi",
        "body": "I know what you are getting at.  Just the generalized nature of your post begs to have it picked apart.  Apple down a few points is just day to day movement.  That’s not cut a cut bait example;e by any means.  \n\nBut look at Warren Buffet for example when he sunk billions into IBM stock.  He had over 10 billion worth at an average price of 170.  It was a declining stock for the majority of the time he held it ranging from 150-110 / share.  He eventually dumped it at a loss so he could put that money to better use elsewhere.  He loaded up on Apple and those shares are now worth almost 2x what he paid.  Had he stuck with IBM stock waiting for a recovery that never happened he would still be very much in the red today.",
        "created_utc": 1580785289,
        "id": "fghi1xw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580814089.0
    },
    {
        "author": "ThetaBurnVictim",
        "body": "Well market cap wise it’s now worth more than IBM and NVDA.... soooo",
        "created_utc": 1580847342,
        "id": "fgjmxp3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580876142.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM on some retard strength lately",
        "created_utc": 1580915021,
        "id": "fglzycl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580943821.0
    },
    {
        "author": "Children_of_Lucifer",
        "body": "I read an article a while ago saying the best indicator of who will win the AI race is whoever is hiring the most in that discipline. IBM is not out pacing others and Watson has failed at least twice in really world applications.",
        "created_utc": 1580917018,
        "id": "fgm31vy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580945818.0
    },
    {
        "author": "Jordykins850",
        "body": "It’s like a sales thing too.. at least IBM has seemingly found its lane focusing on financials and deep analytics.",
        "created_utc": 1580774352,
        "id": "fgh1c8y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580803152.0
    },
    {
        "author": "bandawarrior",
        "body": "That’s a good resource. Bloomberg and CNBC. Watch all the videos and interviews. Find out what they are saying and what the analysts write or talk about them.\n\nSome stuff also makes sense. I mean Ford? For fucks sake guy. It’s 1969 and it wants it’s stock back.\n\nYou see people walking around with the EarPods like it’s going out of style. Everyone’s on Instagram (FB).\n\nEveryone is buying on amazon prime and if you have any awareness you know Amazon has this thing called AWS. It prints money.\n\nAlso Microsoft is cool again. IBM sucks. Get with the program. Some things make sense. Like don’t buy JC Penney stock. \n\nTesla is a better car (don’t get involved in the calls).",
        "created_utc": 1580863843,
        "id": "fgkeqyc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580892643.0
    },
    {
        "author": "Neon_Yoda_Lube",
        "body": "I'm waiting on more development on their quantum computer commercialization personally. If I had to put money on them or IBM to be the first I would put it on intel to be honest. IBM hasn't had much good news lately on their progress.",
        "created_utc": 1580875483,
        "id": "fgkwtd9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580904283.0
    },
    {
        "author": "amerikayo",
        "body": "Intel, IBM, MU anyone? Thoughts?",
        "created_utc": 1580933769,
        "id": "fgmx9ry",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580962569.0
    },
    {
        "author": "Slaggon3",
        "body": "IBM 140p gotta be free money about now, right?  Bout 1-2mo out?",
        "created_utc": 1580933835,
        "id": "fgmxeln",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580962635.0
    },
    {
        "author": "ComplexPhase",
        "body": "Well, he announced he wants India to be the center of IBM's new efforts. So.... if you are talented and live in the US and work for IBM, will the last one turn out the lights?\n\nSeriously. Not much diversity at the head of top tech companies based in the US. This is what India pressure looks like - you get the best deals with India if you have an Indian CEO. Trump is not the only one playing with foreign influence playing with Putin. US tech companies play with foreign influence, because mathematically and otherwise, it is too much of a coincidence that most of the top US tech companies are CEOS from India - barring those companies created by a person. Why are the boards making this non-EEOC decision? Why is it that there is no Asian, no white, no hispanic, no black, no other as CEO of these companies that rely so heavily on Indian labor or sites in India that drive down cost? Hm.....maybe someone can get their AI to crunch the number on the probability of that being wholly without bias.\n\nBut so much for the US being a champion of diversity in tech for their US employees. Really. Tech may be high minded calling out ICE and so forth, but they are not a fan of the EEOC or the idea of diversity on their teams. Except for a couple of photo ops.",
        "created_utc": 1580671318,
        "id": "fgccmnu",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1580700118.0
    },
    {
        "author": "Jordykins850",
        "body": "It’s too high. I’d rather be loading up on IBM.",
        "created_utc": 1580554107,
        "id": "fg65475",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580582907.0
    },
    {
        "author": "SP3NTt",
        "body": "This mofucker just said buy IBM over MSFT. \n\nOk boomer.\n\nExcel is still exponentially more versatile then shit tableau btw",
        "created_utc": 1580966537,
        "id": "fgodn39",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580995337.0
    },
    {
        "author": "DTforPorsche",
        "body": "Alright boys the move from meme stonks is on. Everything going into value. IBM up 7$ &amp; retailers are following behind. \n\nMake your moves accordingly.",
        "created_utc": 1580999279,
        "id": "fgp89bo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581028079.0
    },
    {
        "author": "aelric22",
        "body": "Should have bought into IBM or BA.\n\nIBM is up about 17% from less than a month ago.\n\nBA is still kinda cheap, but my buy in at $320 per share proved to be pretty well priced.\n\nThere's more to stock trading than meme stocks like TSLA.",
        "created_utc": 1581000236,
        "id": "fgp9q1d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1581029036.0
    },
    {
        "author": "iTradeWithMyBallz",
        "body": "i am looking for an entry on IBM puts, and once I find it, I am going to hit it HARD",
        "created_utc": 1581002220,
        "id": "fgpcvga",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581031020.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the  7th of February\n\n\n\n## Upcoming events for Friday, February  7th\n\n - Stock splits:\n\n    - NRGMF @ **1:6**\n\n - Expected earnings:\n\n  ABBV, ASX, AVTR, BBX, CAE, CBOE, CCJ, CIVB, CNHI, CYOU, FE, GOOS, HBI, HDB, HMC, MSG, PIXY, ROAD, SOGO, SOHU, SPR, THFF, UFS, VIVO, XAIR\n\n - Ex-div:\n\n  AAPL, AEP, AFIN, BGSF, BX, CCR, CDR, CINR, CLDB, COF, CSV, CWT, DCF, DHI, DLB, EBTC, FIBK, GABC, GLP, GROW, GWW, HBCP, HBT, HP, IBM, IBTX, ISBC, ITUB, KKR, MPX, MRLN, MWA, NBL, NBN, NS, NYCB, OLN, PPR, PUB, PZZA, ROL, SC, SCHN, SFBC, SJW, STND, SXI, USDP, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 3.0%, previous: 2.9%)\n    - Average Hourly Earnings (consensus: 0.3%, previous: 0.1%)\n    - Average Weekly Hours (consensus: 34.3, previous: 34.3)\n    - CFTC Aluminium speculative net positions (previous: -47.0K)\n    - CFTC Copper speculative net positions (previous: 5.8K)\n    - CFTC Corn speculative net positions (previous: 48.0K)\n    - CFTC Crude Oil speculative net positions (previous: 520.6K)\n    - CFTC Gold speculative net positions (previous: 317.7K)\n    - CFTC Nasdaq 100 speculative positions (previous: 9.0K)\n    - CFTC Natural Gas speculative net positions (previous: -249.4K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 4.6K)\n    - CFTC Silver speculative net positions (previous: 68.9K)\n    - CFTC Soybeans speculative net positions (previous: 17.6K)\n    - CFTC Wheat speculative net positions (previous: 47.7K)\n    - Consumer Credit (consensus: 15.00B, previous: 12.51B)\n    - Government Payrolls (previous: 6.0K)\n    - Manufacturing Payrolls (consensus: -5K, previous: -12K)\n    - Nonfarm Payrolls (consensus: 160K, previous: 145K)\n    - Participation Rate (consensus: 63.1%, previous: 63.2%)\n    - Private Nonfarm Payrolls (consensus: 150K, previous: 139K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 675)\n    - U.S. Baker Hughes Total Rig Count (previous: 790)\n    - U6 Unemployment Rate (previous: 6.7%)\n    - Unemployment Rate (consensus: 3.5%, previous: 3.5%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -0.1%)\n    - Wholesale Trade Sales (consensus: 0.4%, previous: 1.5%)\n\n## Upcoming events for Saturday, February  8th\n\n - Expected earnings:\n\n  CRD.A\n\n## Upcoming events for Monday, February 10th\n\n - Expected earnings:\n\n  ACB, AEMD, AGN, AIN, AMKR, APPS, ARGO, AVYA, BHF, BIP, BLKB, BRX, BYND, CHGG, CMBM, CMP, CNA, CRNT, CSTL, DMPI, DO, DVA, ELVT, ELY, EPC, ESSA, FLDM, FRT, GBDC, GFN, GNSS, GO, GPP, GPRE, ICMB, IIIV, IIVI, ITUB, IVC, JCOM, JE, KMPR, L, LMNX, MCC, MCY, MELI, MESA, MGI, MIME, MLAB, MOH, MPAA, NFE, OMAB, OMF, PRCP, PSEC, PSTL, QSR, RE, RICK, RLGT, RNG, RPD, SBLK, STE, TMQ, TPTX, UL, UN, VOYA, VRNS, WTER, WTS, XPO\n\n - Ex-div:\n\n  APO, ARCB, CWBC, ETRN, GHM, KMT, MCBC, MDRR, MTG, NI, NMM, PCAR, PGC, SBBX, STZ, STZ.B, SWKS, WBS, XLNX, XOM\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 1.550%)\n    - 6-Month Bill Auction (previous: 1.520%)\n    - CB Employment Trends Index (previous: 109.70)\n    - Investing.com Gold Index (previous: 57.4%)\n    - Investing.com S&amp;P 500 Index (previous: 43.8%)\n\n^^^^2020-02-07",
        "created_utc": 1581073213,
        "id": "fgs5y5a",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1581102013.0
    },
    {
        "author": "wink15",
        "body": "Long on $MSFT still, shorted SGEN and they got killed on earnings,, and YOLO called IBM for .01 a contract. Sorta new to the community, but I just might already be a autist.",
        "created_utc": 1581077026,
        "id": "fgs92gc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581105826.0
    },
    {
        "author": "sledsgetthedeals",
        "body": "NVDA c\nIBM c\nWORK p\nSPCE p\n\nOTM 2/7s and 2/14s",
        "created_utc": 1581036834,
        "id": "fgr2qpa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581065634.0
    },
    {
        "author": "gabethebaeb",
        "body": "What’s your IBM call price?",
        "created_utc": 1581036899,
        "id": "fgr2uhn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581065699.0
    },
    {
        "author": "1davejames1",
        "body": "IBM?",
        "created_utc": 1581054858,
        "id": "fgrr9ms",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581083658.0
    },
    {
        "author": "steve_park",
        "body": "Let's assume you have 10 155 IBM calls expiring 2/7. That would represent 1,000 shares. You'd need 150K in your account or your broker would automatically close these out because they would be exercised into equity. You are in the 160 so your position will expire worthless since IBM is at 156.76. Let's do a hypothetical and assume IBM gets upgraded tomorrow and share surge to 161 past the 160 strike putting you in the money. Your broker would automatically close you out at 3:45 eastern whatever the price is if you didn't have enough to cover the position.  This is useful to know because many traders trade in the money options to avoid premium decay. Avoid deep OTM options if you are new to options world. Quickest way to blow up your account.",
        "created_utc": 1581032762,
        "id": "fgqw5t4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581061562.0
    },
    {
        "author": "-_somebody_-",
        "body": "So tomorrow the calls will be worthless?  Is the ex dividend at the end of the day so I can at least make this swing trade and sell tomorrow without loss?  I’m not looking to buy 7000 shares of IBM",
        "created_utc": 1581018394,
        "id": "fgq5s9m",
        "score": 1,
        "subreddit": "options",
        "created": 1581047194.0
    },
    {
        "author": "3000dollarsuitCOMEON",
        "body": "Haha, did a double take. Good for IBM finally lol",
        "created_utc": 1580565676,
        "id": "fg6ekyu",
        "score": 1,
        "subreddit": "investing",
        "created": 1580594476.0
    },
    {
        "author": "PapaCharlie9",
        "body": "Where is your list of disadvantages?\n\nMy question, every time this topic comes up, is if we accept for the sake of argument that this time it's different, what exactly is different? What has so fundamentally changed that the long-term historic trends are now dead as dinosaurs?\n\nWhile all of those things you listed are advantages, they aren't advantages that weren't available to the large caps of the previous century. There was a time when IBM, T, XOM, GE, GM, JNJ, etc., seemed unstoppable large caps that could never be toppled from their top 10 positions, and yet they eventually were. \n\nMSFT and AAPL started out small to mid caps. Of course, not every small cap is going to turn into an MSFT or AAPL, or even 1 out of a 1000, but if the argument is that we should only buy stocks once they are large and established, isn't that also saying wait until they are more expensive?",
        "created_utc": 1580684156,
        "id": "fgdmqyo",
        "score": 1,
        "subreddit": "investing",
        "created": 1580712956.0
    },
    {
        "author": "jashsayani",
        "body": "There’s thousands of better investments than IBM.",
        "created_utc": 1580636440,
        "id": "fg9avsw",
        "score": 1,
        "subreddit": "investing",
        "created": 1580665240.0
    },
    {
        "author": "livecono",
        "body": "VZ (4.1%) and T (5.5%) both are ok coming out of earnings. IBM (4.5%) had a good one. Watch K (3.3%) going into earnings this week and CSCO (3.0%) next week.",
        "created_utc": 1580659712,
        "id": "fgb92cd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580688512.0
    },
    {
        "author": "ribnag",
        "body": "Because the market goes down, and the market goes up, but those sweet sweet dividends flow either way.\n\nIf it takes the market a decade to recover from the current artificially-maintained bull, are you going to sit on cash losing 2% per year to inflation the whole time, or are you going to at least enjoy 3% growth year over year regardless of actual stock prices?\n\nAnd in fact, dividend yield usually goes **up** in a bear market, because the DOW is largely meaningless to the day-to-day spending of the Joe Average.  If IBM is issuing $6/year in dividends, at $150/share, that's 4%; at $100/share, that's 6%.",
        "created_utc": 1580749023,
        "id": "fgfwbhi",
        "score": 1,
        "subreddit": "investing",
        "created": 1580777823.0
    },
    {
        "author": "dimitrynakhla",
        "body": "Listen here all. Have you been wondering what could be the next Tesla? I have the answer. IBM. Just look at how the stock has moved since Thursday. It is going to the sky now because the female CEO was replaced with a male CEO. Masculine gains are ahead of us. \n\nSo do yourself a favor and risk it all on International Business Men .. I mean Machines .. so that you may have enough tendies to feed those who are suffering from today’s TSLA reversal.",
        "created_utc": 1580955227,
        "id": "fgnxrsv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580984027.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM/TSM/CSCO (two of the three), MRK or PFE, T/Comcast/DIS (two of the three). L3. PEP. If XLP and XLU weren’t so bloated, I’d point you there as well. LIT and FAN are some decent ETFs as well.",
        "created_utc": 1580942782,
        "id": "fgndvia",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580971582.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  6th of February\n\n\n\n## Upcoming events for Thursday, February  6th\n\n - Stock splits:\n\n    - FDMSF @ **1:10**\n\n - Expected earnings:\n\n  ABMD, AGCO, AGTC, AHH, AIRI, ALNY, AMAG, ARCH, ARW, ASYS, ATVI, AVNW, AVXL, AXGT, AYTU, BAX, BBIO, BBU, BCE, BCO, BDX, BEP, BGCP, BHE, BILL, BKH, BLL, BMY, BRBR, BRKS, BRT, BSIG, BV, CAH, CBL, CCS, CDR, CDW, CI, COLM, COOP, COR, CPST, CRWS, CSL, CTHR, CX, CZNC, DLX, DNKN, DX, DXC, EAF, EGAN, EGP, EHC, EIGI, EL, ENTA, EPIX, EXPO, FARM, FCAU, FFG, FLT, FSCT, FTNT, FTV, FWRD, G, GLOG, GLOP, GLT, GTIM, HAIN, HL, HUBG, ICE, IGMS, IMKTA, IRMD, K, KB, KEM, KRTX, KTB, KTOV, LGF.A, LGND, LLEX, LMAT, LPTH, LQDT, MAC, MBUU, MDP, MEIP, MFG, MMS, MNR, MNRL, MOBL, MPW, MR, MSI, MT, MTD, MTW, MYGN, MYOV, NGL, NGVC, NJR, NKSH, NLOK, NMM, NNA, NOK, NOV, NR, NRZ, NTUS, NWSA, NYT, OCSI, OCSL, ODFL, OESX, OFC, OIIM, OMCL, OMN, ONTO, ONVO, PACB, PBH, PENN, PFSI, PINS, PJT, PLSE, PM, PMT, PNNT, POST, PRLB, PRO, PROF, PTEN, PXLW, PZG, REGN, RMR, SBH, SCPL, SEEL, SGEN, SIMO, SKX, SNA, SNN, SNY, SPGI, SPH, SVM, SYNA, TDC, TGI, TMUS, TNAV, TOT, TPCO, TPR, TSE, TSN, TTWO, TWOU, TWST, TWTR, TXG, UBER, UEPS, ULH, USX, UTI, VCRA, VRSN, VRTU, VSAT, VSTO, VVI, WLTW, WMS, WRTC, WWE, WYNN, XCUR, XFOR, XYL, YUM, ZEN\n\n - Ex-div:\n\n  AFB, AMSWA, ARLP, ARNC, AROC, ARTNA, AUB, AWK, BCBP, BCO, BMRC, BPFH, CELP, CEQP, CFFN, CIT, CLR, CMCO, CMS, COST, CSTR, CVCY, ET, FBMS, FCBC, FCF, FE, FHI, FRAF, GMLP, HOPE, INTC, JBHT, LBC, MMLP, MMP, NGL, NRP, NSC, PCTI, PH, PNFP, RBB, SBFG, SMBK, SMLP, SSB, SUN, SYF, WAB, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.545%)\n    - 8-Week Bill Auction (previous: 1.550%)\n    - Challenger Job Cuts (previous: -25.2%)\n    - Challenger Job Cuts (previous: 32.843K)\n    - Continuing Jobless Claims (consensus: 1,720K, previous: 1,703K)\n    - FOMC Member Kaplan Speaks\n    - FOMC Member Quarles Speaks\n    - Initial Jobless Claims (consensus: 215K, previous: 216K)\n    - Jobless Claims 4-Week Avg. (previous: 214.50K)\n    - Natural Gas Storage (consensus: -129B, previous: -201B)\n    - Nonfarm Productivity (consensus: 1.6%, previous: -0.2%)\n    - Unit Labor Costs (consensus: 1.4%, previous: 2.5%)\n\n## Upcoming events for Friday, February  7th\n\n - Expected earnings:\n\n  ABBV, ASX, AVTR, BBX, CAE, CBOE, CCJ, CIVB, CNHI, CYOU, FE, GOOS, HBI, HDB, HMC, MSG, PIXY, ROAD, SOGO, SOHU, SPR, THFF, UFS, VIVO, XAIR\n\n - Ex-div:\n\n  AAPL, AEP, AFIN, BGSF, BX, CCR, CDR, CINR, CLDB, COF, CSV, CWT, DCF, DHI, DLB, EBTC, FIBK, GABC, GLP, GROW, GWW, HBCP, HBT, HP, IBM, IBTX, ISBC, ITUB, KKR, MPX, MRLN, MWA, NBL, NBN, NS, NYCB, OLN, PPR, PUB, PZZA, ROL, SC, SCHN, SFBC, SJW, STND, SXI, USDP, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 3.0%, previous: 2.9%)\n    - Average Hourly Earnings (consensus: 0.3%, previous: 0.1%)\n    - Average Weekly Hours (consensus: 34.3, previous: 34.3)\n    - CFTC Aluminium speculative net positions (previous: -47.0K)\n    - CFTC Copper speculative net positions (previous: 5.8K)\n    - CFTC Corn speculative net positions (previous: 48.0K)\n    - CFTC Crude Oil speculative net positions (previous: 520.6K)\n    - CFTC Gold speculative net positions (previous: 317.7K)\n    - CFTC Nasdaq 100 speculative positions (previous: 9.0K)\n    - CFTC Natural Gas speculative net positions (previous: -249.4K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 4.6K)\n    - CFTC Silver speculative net positions (previous: 68.9K)\n    - CFTC Soybeans speculative net positions (previous: 17.6K)\n    - CFTC Wheat speculative net positions (previous: 47.7K)\n    - Consumer Credit (consensus: 15.00B, previous: 12.51B)\n    - Government Payrolls (previous: 6.0K)\n    - Manufacturing Payrolls (consensus: -5K, previous: -12K)\n    - Nonfarm Payrolls (consensus: 160K, previous: 145K)\n    - Participation Rate (consensus: 63.1%, previous: 63.2%)\n    - Private Nonfarm Payrolls (consensus: 150K, previous: 139K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 675)\n    - U.S. Baker Hughes Total Rig Count (previous: 790)\n    - U6 Unemployment Rate (previous: 6.7%)\n    - Unemployment Rate (consensus: 3.5%, previous: 3.5%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -0.1%)\n    - Wholesale Trade Sales (consensus: 0.4%, previous: 1.5%)\n\n## Upcoming events for Saturday, February  8th\n\n - Expected earnings:\n\n  CRD.A\n\n^^^^2020-02-06",
        "created_utc": 1580986811,
        "id": "fgou7p4",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1581015611.0
    },
    {
        "author": "LettucePro",
        "body": "Thanks for the reply. To make an analogy, it sounds like an average middle class American family that has a huge mortgage on a big house, cars on finance, boat, etc. They are asset rich but have lots debt.\n\nThe reason why I ask is because I've been hearing about the bloated balance sheets of GE and IBM and how passive investing into funds containing these blue chip stocks can be a value trap.",
        "created_utc": 1581005686,
        "id": "fgpivt1",
        "score": 1,
        "subreddit": "investing",
        "created": 1581034486.0
    },
    {
        "author": "Silver_Surfer93",
        "body": "IBM is making a top...today...rip",
        "created_utc": 1581019188,
        "id": "fgq79td",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581047988.0
    },
    {
        "author": "wink15",
        "body": "Fuck it, I’m in, autistis let’s pump IBM",
        "created_utc": 1581008750,
        "id": "fgpo7wv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581037550.0
    },
    {
        "author": "lucifer_alucard",
        "body": "Lol what? IBM was the undisputed king of computers while Apple and Microsoft were still babies living out of garages. Apple is a very young company.",
        "created_utc": 1581027423,
        "id": "fgqn6eq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581056223.0
    },
    {
        "author": "RealityPizza",
        "body": "IBM quietly mooning",
        "created_utc": 1580916095,
        "id": "fgm1lio",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580944895.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM, XOM are the leaders today. It's BOOMER TIME",
        "created_utc": 1580920667,
        "id": "fgm9z81",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580949467.0
    },
    {
        "author": "-_somebody_-",
        "body": "Gotcha.  Ok, now in an irrational market like we’re in, I did some digging up that on the ex- date the underlying price doesn’t necessarily have to go down since there are still other forces at work.  But also Idk enough about all those things or IBM that could be a reason why not to bet against the expectation (which is a price drop).  \n\nOh well I’ll see tomorrow lol...",
        "created_utc": 1581035214,
        "id": "fgr03zl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581064014.0
    },
    {
        "author": "levon105",
        "body": "Semiconductors / chips. See ibm, mu, qcom, nvda, etc...",
        "created_utc": 1580923281,
        "id": "fgmf56x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580952081.0
    },
    {
        "author": "saul_2",
        "body": "AMZN and MSFT. IBM is an interesting pick if it focuses on cloud business.",
        "created_utc": 1580783488,
        "id": "fghf7mw",
        "score": 1,
        "subreddit": "investing",
        "created": 1580812288.0
    },
    {
        "author": "Coz131",
        "body": "IBM has shitty leadership. Used to buy their stuff but nothing have changed. I used to think the old school tech companies will go through a transformation but IBM is a disappointment.",
        "created_utc": 1580800768,
        "id": "fgi12ge",
        "score": 1,
        "subreddit": "investing",
        "created": 1580829568.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  4th of February\n\n\n\n## Upcoming events for Tuesday, February  4th\n\n - Stock splits:\n\n    - BVLDF @ **1:5**\n\n - Expected earnings:\n\n  AFL, AGN, AINV, ALIM, ALL, ALLT, AMSC, APAM, AQUA, ARA, ARLO, ARMK, ATGE, ATI, ATO, AXE, BDC, BE, BFIN, BOOT, BP, CB, CCK, CDK, CERN, CLX, CMCO, CMG, CMI, CNC, CNXN, COP, CTO, CTS, DIS, DOX, EGHT, EMR, ENTG, EQNR, ESE, ETH, ETN, EXP, F, FISV, GAIN, GHL, GILD, GL, GNW, GPMT, GRA, GTES, HAE, HIW, HLNE, HUBB, IPHI, IT, ITI, J, JHG, JKHY, KLAC, KN, KTCC, LHX, LII, LITE, LPT, MANH, MCHP, MCK, MDU, MEC, MKL, MLI, MOD, MODN, MSGN, MTCH, MTG, MWA, MWK, NBIX, NEWR, OI, OLN, OXLC, PAA, PAGP, PBI, PCTY, PDM, PINC, PKD, PLT, PRU, QGEN, RACE, RCL, RGS, RL, RNR, ROLL, RRR, SBH, SCSC, SFST, SILK, SIRI, SNAP, SNE, SPG, STX, SWI, TCS, TDG, TECH, TENB, THG, TRNS, UNM, USNA, VIAV, VSH, WAT, WDR, YRCW, ZAYO, ZBH\n\n - Ex-div:\n\n  AAL, AMTD, APTV, BBD, BBDO, BRO, CNXM, COLB, CZWI, FSBW, HMST, HTBK, IBCP, IDA, MPB, NTIC, OCFC, WTBA\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -4.267M)\n    - Durables Excluding Defense (previous: -2.5%)\n    - Factory Orders (consensus: 1.2%, previous: -0.7%)\n    - Factory orders ex transportation (previous: 0.3%)\n    - IBD/TIPP Economic Optimism (previous: 57.4)\n    - ISM NY Business Conditions (previous: 39.1%)\n    - ISM-New York Index (previous: 869.0)\n    - Redbook (previous: 0.1%)\n    - Redbook (previous: 5.5%)\n\n## Upcoming events for Wednesday, February  5th\n\n - Expected earnings:\n\n  ABB, ACLS, ADTN, AME, ANGI, AOSL, ARWR, ASC, AVB, BAP, BBD, BCEI, BMI, BSGM, BSX, BTU, CCMP, CDAY, CENT, CENTA, CFMS, CG, CINF, COHR, COTY, CPLP, CPRI, CSGS, CSII, CTSH, CUB, CURO, CUZ, DHT, DHX, DLHC, DTE, ECHO, ELF, ELY, EMKR, ENR, ENS, ENSG, EPM, EQX, FCBC, FEYE, FGBI, FLO, FMC, FORM, FOXA, FSV, GLAD, GLUU, GM, GPI, GPRO, GRUB, GSK, HI, HMN, HUM, IAC, IBA, IBN, ICHR, ICL, IEC, ING, INVA, IO, IRBT, KFRC, KLDO, KLR, KNL, LBRT, LCI, LNC, LPL, LYTS, MC, MCFT, MET, MHH, MHO, MIRM, MN, MPWR, MRK, MTRX, MXL, NESR, NNA, NS, NTGR, NUAN, NVO, NVT, OHI, ORLY, OSB, PAG, PAYC, PFGC, PFLT, PHX, PLUS, PROS, PSEC, PSTI, PTON, PTSI, QCOM, QNST, RAMP, RDN, RGLD, RYN, SAVE, SITM, SONM, SONO, SPOT, SR, SRDX, STC, SU, SUM, TBI, THR, TKR, TM, TMDX, TMHC, TRNO, TTMI, TUES, TWLO, TWO, UGI, UHAL, VNE, VXRT, WD, WERN, YUMC, ZNGA\n\n - Ex-div:\n\n  BPRN, BXG, CATC, DCOM, DHF, FELE, GHC, HESM, HFWA, KBH, MATX, NEP, NWBI, OFED, OPB, OPBK, RELL, RGA, SBUX, VAM, VBTX, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 156K, previous: 202K)\n    - Crude Oil Imports (previous: 0.133M)\n    - Crude Oil Inventories (consensus: 3.000M, previous: 3.548M)\n    - Cushing Crude Oil Inventories (previous: 0.758M)\n    - Distillate Fuel Production (previous: 0.025M)\n    - EIA Refinery Crude Runs  (previous: -0.933M)\n    - EIA Weekly Distillates Stocks (consensus: 0.467M, previous: -1.289M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.2%, previous: -3.3%)\n    - Exports (previous: 209.00B)\n    - FOMC Member Brainard Speaks\n    - Gasoline Inventories (consensus: 2.067M, previous: 1.203M)\n    - Gasoline Production (previous: -0.377M)\n    - Heating Oil Stockpiles (previous: -0.106M)\n    - ISM Non-Manufacturing Business Activity (consensus: 56.5, previous: 57.2)\n    - ISM Non-Manufacturing Employment (previous: 55.2)\n    - ISM Non-Manufacturing New Orders (previous: 54.9)\n    - ISM Non-Manufacturing PMI (consensus: 55.0, previous: 55.0)\n    - ISM Non-Manufacturing Prices (previous: 58.5)\n    - Imports (previous: 252.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.81%)\n    - MBA Mortgage Applications (previous: 7.2%)\n    - MBA Purchase Index (previous: 313.7)\n    - Markit Composite PMI (consensus: 53.1, previous: 52.7)\n    - Mortgage Market Index (previous: 649.8)\n    - Mortgage Refinance Index (previous: 2,581.2)\n    - Services PMI (consensus: 53.2, previous: 52.8)\n    - Trade Balance (consensus: -48.20B, previous: -43.10B)\n\n## Upcoming events for Thursday, February  6th\n\n - Expected earnings:\n\n  ABMD, AGCO, AGTC, AHH, AIRI, ALNY, AMAG, ARCH, ARW, ASYS, ATVI, AVNW, AVXL, AXGT, AYTU, BBIO, BBU, BCE, BCO, BDX, BEP, BGCP, BHE, BIDU, BILL, BKH, BLL, BMY, BRBR, BRKS, BRT, BSIG, BV, CAH, CBL, CCS, CDR, CDW, CI, COLM, COR, CPST, CRWS, CSL, CTHR, CX, CZNC, DLX, DNKN, DRTT, DX, DXC, EAF, EGAN, EGP, EHC, EIGI, EL, ENTA, EPIX, EXPO, FCAU, FFG, FLT, FSCT, FTNT, FTV, FWRD, G, GLOG, GLOP, GLT, GTIM, HAIN, HBI, HUBG, ICE, IGMS, IMKTA, IQ, IRMD, K, KB, KEM, KRTX, KTB, KTOV, LGF.A, LGND, LLEX, LMAT, LPTH, LQDT, LTRX, MAC, MBUU, MDP, MEIP, MMS, MNR, MNRL, MOBL, MPW, MR, MSI, MT, MTD, MTW, MYGN, MYOV, NGL, NGVC, NJR, NLOK, NOV, NR, NRZ, NTUS, NWSA, NYT, OCSI, OCSL, ODFL, OESX, OFC, OIIM, OMCL, ONTO, ONVO, PACB, PBH, PENN, PFSI, PINS, PJT, PLSE, PM, PMT, PNNT, POST, PRLB, PRO, PROF, PTEN, PXLW, PZG, REGN, RMR, RVLV, SCPL, SEEL, SGEN, SIMO, SKX, SNA, SNN, SNY, SPGI, SPH, SVM, SYNA, TDC, TGI, TMUS, TNAV, TOT, TPCO, TPR, TSE, TSN, TTWO, TWOU, TWST, TWTR, TXG, UBER, UEPS, ULH, USX, UTI, VCRA, VRSN, VRTU, VSAT, VSTO, VVI, WLTW, WMS, WWE, WYNN, XCUR, XFOR, XYL, YUM, ZEN\n\n - Ex-div:\n\n  AFB, AMSWA, ARLP, ARNC, AROC, ARTNA, AUB, AWK, BCBP, BCO, BMRC, BPFH, CELP, CEQP, CFFN, CIT, CLR, CMCO, CMS, COST, CSTR, CVCY, ET, FBMS, FCBC, FCF, FE, FII, FRAF, GMLP, HOPE, INTC, JBHT, LBC, MMLP, MMP, NGL, NRP, NSC, PCTI, PH, PNFP, RBB, SBFG, SMBK, SMLP, SSB, SUN, SYF, WAB, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.545%)\n    - 8-Week Bill Auction (previous: 1.550%)\n    - Challenger Job Cuts (previous: -25.2%)\n    - Challenger Job Cuts (previous: 32.843K)\n    - Continuing Jobless Claims (consensus: 1,720K, previous: 1,703K)\n    - FOMC Member Kaplan Speaks\n    - FOMC Member Quarles Speaks\n    - Initial Jobless Claims (consensus: 215K, previous: 216K)\n    - Jobless Claims 4-Week Avg. (previous: 214.50K)\n    - Natural Gas Storage (previous: -201B)\n    - Nonfarm Productivity (consensus: 1.5%, previous: -0.2%)\n    - Unit Labor Costs (consensus: 1.3%, previous: 2.5%)\n\n## Upcoming events for Friday, February  7th\n\n - Expected earnings:\n\n  ABBV, ASX, AVTR, BBX, CAE, CBOE, CCJ, CIVB, CNHI, CYOU, GOOS, HDB, HMC, MSG, PIXY, RGCO, ROAD, SOGO, SOHU, SPR, TAK, THFF, UFS, VIVO, XAIR\n\n - Ex-div:\n\n  AAPL, AEP, AFIN, BGSF, BX, CCR, CDR, CINR, CLDB, COF, CSV, CWT, DCF, DHI, DLB, EBTC, FIBK, GABC, GLP, GROW, GWW, HBCP, HBT, HP, IBM, IBTX, ISBC, ITUB, MPX, MRLN, MWA, NBL, NBN, NYCB, OLN, PUB, PZZA, ROL, SC, SCHN, SFBC, SJW, STND, SXI, USDP, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 3.0%, previous: 2.9%)\n    - Average Hourly Earnings (consensus: 0.3%, previous: 0.1%)\n    - Average Weekly Hours (consensus: 34.3, previous: 34.3)\n    - CFTC Aluminium speculative net positions (previous: -47.0K)\n    - CFTC Copper speculative net positions (previous: 5.8K)\n    - CFTC Corn speculative net positions (previous: 48.0K)\n    - CFTC Crude Oil speculative net positions (previous: 520.6K)\n    - CFTC Gold speculative net positions (previous: 317.7K)\n    - CFTC Nasdaq 100 speculative positions (previous: 9.0K)\n    - CFTC Natural Gas speculative net positions (previous: -249.4K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 4.6K)\n    - CFTC Silver speculative net positions (previous: 68.9K)\n    - CFTC Soybeans speculative net positions (previous: 17.6K)\n    - CFTC Wheat speculative net positions (previous: 47.7K)\n    - Consumer Credit (consensus: 15.00B, previous: 12.51B)\n    - Government Payrolls (previous: 6.0K)\n    - Manufacturing Payrolls (consensus: -5K, previous: -12K)\n    - Nonfarm Payrolls (consensus: 160K, previous: 145K)\n    - Participation Rate (consensus: 63.1%, previous: 63.2%)\n    - Private Nonfarm Payrolls (consensus: 150K, previous: 139K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 675)\n    - U.S. Baker Hughes Total Rig Count (previous: 790)\n    - U6 Unemployment Rate (previous: 6.7%)\n    - Unemployment Rate (consensus: 3.5%, previous: 3.5%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -0.1%)\n    - Wholesale Trade Sales (consensus: 0.4%, previous: 1.5%)\n\n^^^^2020-02-04",
        "created_utc": 1580814012,
        "id": "fgiafid",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1580842812.0
    },
    {
        "author": "Ur7thfather",
        "body": "Literally bought a 144 ibm call this weekend for 2/7 and it was oonced this morning when i checked my shi",
        "created_utc": 1580763297,
        "id": "fggjpzf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580792097.0
    },
    {
        "author": "IAMV100",
        "body": "It sounds like you are perhaps uninformed, but not dumb. Dumb people are those that have the information and opportunities but still choose to ignore them. Uninformed people just don't know any better, and it sounds like you had the kind of environment that didnt foster financial learning or stability. Reaching out and trying to better your future sounds pretty smart to me.\n\nOn average the S&amp;P500 increases about 8-10% annually. Look up SPY and VOO ETFs, which track the S&amp;P500 (500 biggest companies on the US stock market). People are usually better off buying and holding those than picking individual stocks. At that rate of return, you might expect between 59-75k if you invest $100/month for 20 years due to compound interest.\n\nAlso, 53 isnt too late for you! You have another 20-30 years left statistically, possibly more with medical advancements. A lot of great people didn't make it big until their 50s. IBM and Home Depot were started by a 61 and 50 year old, you've still got opportunity left! Good luck!",
        "created_utc": 1580771596,
        "id": "fggx87o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580800396.0
    },
    {
        "author": "Jordykins850",
        "body": "I’ve literally been ahead of the curve on everything.. Tesla, IBM, yada yada yada. I’m sure shortly after these SPY/XLU shorts kill me.. Iran will hack the utilities grid and melt down a nuclear reactor.",
        "created_utc": 1580773906,
        "id": "fgh0omw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580802706.0
    },
    {
        "author": "MaliciousLegroomMelo",
        "body": "While I would agree with the general thesis that Intel has lost a few notches of their technical superiority, do you think that necessarily translates into stock price?  Such tectonic shifts - if real - can take a very long time.  \n\nThere used to be a saying \"nobody ever got fired for picking IBM\". It took decades for that rule to fade.  The same is true of Intel.  AMD may indeed be crushing it on tech, and winning customers one at a time.  But it will take a long time for Intel to lose their dominance, even if it's warranted.  \n\nKeep in mind the just had a blowout quarter.  Companies pay them $73 billion a year for what is essentially melted sand.  \n\nPerhaps their blowout is due to low analyst expectations.  But that's a condition that can take a quarter or two to rectify as the analysts gradually tweak their recommendations and targets to levels where Intel will struggle or miss.  That means they could beat again next quarter.  \n\nThey now have a permanent CEO who is a numbers guy, who reported is working for peanut salary with a strong incentive to crank those numbers.\n\nYour diagnosis is they've lost their way in product architecture and design and innovation. I won't argue as I wouldn't know and your case sounds plausible.  If so, then they probably have the wrong CEO since he doesn't sound like he'd be the inspiring voice to revive the product innovation.\n\nI sense the author is a die hard AMD fan, which is fine.  But AMD having a cooler product doesn't necessarily put Intel out of business.  Coke and Pepsi continue to punch the clock and fight each other.  And AMD's multiple is so out of whack that they probably need to crank up earnings by cranking up sales but any moves they make on price or competitiveness won't be as a monopoly; they'll be done with Intel fighting them for every inch.\n\nTo me that means even if your theory of AMD taking the crown from Intel is happening, it will be a slow moving coup.",
        "created_utc": 1580826857,
        "id": "fginy26",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580855657.0
    },
    {
        "author": "HinduHamma",
        "body": "That’s the way to do it boys. If your dead broke just scrap up and save a little bit. Because a little bit is all you need to gamble on earnings. \n\nIt just works folks. Better odds than scratch offs or the roulette table. The key is just doing ER yolo only on volatile shit that has the potential to move. \n\nStop doing it on boomer blue chip shit like ibm and visa you idiots. Play those wild sluts like Bezos and musk. Watch all these DIS dumb asses cry when the stock barely moves 3 percent today from ER. You don’t play yolos on shit that historically doesn’t move much. You want something that might give you the biggest erection you ever had. \n\nWell done. Now take that 30k and buy these 1200 strike Tesla fds to turn into 3 mill you pussy.",
        "created_utc": 1580838636,
        "id": "fgj7s4d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580867436.0
    },
    {
        "author": "saul_2",
        "body": "My money is on Krishna - the new appointed CEO  - to bring IBM into a growth-centric company through their cloud computing business.",
        "created_utc": 1580822366,
        "id": "fgii5v1",
        "score": 1,
        "subreddit": "investing",
        "created": 1580851166.0
    },
    {
        "author": "throwitaway2384719",
        "body": "People always say this and then some disruptor comes along. Ibm and hp used to be the apple of today.",
        "created_utc": 1580841977,
        "id": "fgjduw2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580870777.0
    },
    {
        "author": "tendiesecured",
        "body": "Why is no one talking about IBM?",
        "created_utc": 1580955793,
        "id": "fgnynga",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1580984593.0
    },
    {
        "author": "bitflag",
        "body": "IBM has been around for a long time too and was once the mighty indestructible owner of all things computer. They are still making money but it's shadow of its former self.",
        "created_utc": 1580701217,
        "id": "fgejt0u",
        "score": 5,
        "subreddit": "investing",
        "created": 1580730017.0
    },
    {
        "author": "Jordykins850",
        "body": "Since the sub has so far missed the IBM train.. Oracle might be next. Yes, they’re a distant 5th to IBM, GOOG, MSFT and AMZN in the cloud.. but does that even matter anymore? They’ve got a buzzword attached to their name via CLOUD CUMPUTERING, a semi-decent yield for a potential (hypothetically potential) growth company and are still down across the last 3 months. We should make it our new meme stonk.",
        "created_utc": 1580953377,
        "id": "fgnuth4",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1580982177.0
    },
    {
        "author": "sid12385",
        "body": "IBM can this be our next meme?",
        "created_utc": 1580922774,
        "id": "fgme4yu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1580951574.0
    },
    {
        "author": "iamsquidly",
        "body": "Twitter puts, spy Longs, IBM Puts I have a small dick",
        "created_utc": 1580937174,
        "id": "fgn3tlw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1580965974.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM calls EOD also aren’t a bad idea. Literally been a morning pump for a week now.",
        "created_utc": 1580926090,
        "id": "fgmjxtk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1580954890.0
    },
    {
        "author": "Mpcars",
        "body": "IBM and UNH the goats for today",
        "created_utc": 1580941862,
        "id": "fgncbiu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1580970662.0
    },
    {
        "author": "saul_2",
        "body": "Buy Facebook ($FB). Best value FAANG/Big 5 tech company. Trading at $203 at the moment with tons of room for growth. Should recover quickly from the drop and has solid fundamentals.\n\nAnother option would be International Business Machines ($IBM) I think it is an interesting and compelling stock to have because of their growing profitability and new leadership (plus it has a dividend). Then you could diversify and add some riskier stocks like AMD, Uber, Pinterest, Snap, and GE. All with growth potential but with a good amount of risk.",
        "created_utc": 1580750648,
        "id": "fgfyy7q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580779448.0
    },
    {
        "author": "Not-The-Government-",
        "body": "AWS and Azure are the top dogs right now, I don't know off the top of my head how much corporate business google really does. IBM acquiring redhat is actually really interesting even though theyre a few years late to the game. Google def has hard competition, we'll see.",
        "created_utc": 1580759730,
        "id": "fggdqpa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580788530.0
    },
    {
        "author": "ThaDelio",
        "body": "So theoretically since you’re ahead of the curve. Is it smart to buy back in Tesla $1000+ calls expiring this week for gains or just take my gains and run and wait for something else? Down $1350 on last 2 weeks.. Tesla helped rekindle $150-250 of that today and so did IBM $144 call I had purchased for .84 and sold at 3.30.. still trying to climb back.. want to be smart. Ideas ?",
        "created_utc": 1580774844,
        "id": "fgh22gk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580803644.0
    },
    {
        "author": "uninfinity",
        "body": "Being the true autist the only play I took ended up being a loser so just been monitoring these and last 7 out of 10 were pretty profitable had I taken the bet. Some were BABA calls before phase-1 Gyna signing, INTC $68 calls last month, TSLA calls of course, RH calls, IBM calls, all worked out.",
        "created_utc": 1580610236,
        "id": "fg85qgy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580639036.0
    },
    {
        "author": "-JPMorgan",
        "body": "I mean it doesn't take insane skill as an investor to chose Microsoft over Pets.com. I could understand the argument with maybe Dell or IBM though.",
        "created_utc": 1580897347,
        "id": "fglh1g8",
        "score": 1,
        "subreddit": "investing",
        "created": 1580926147.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM growing cloud faster than GOOG.. only thing boomer about it is the fucking redic high yield",
        "created_utc": 1580920807,
        "id": "fgma8ee",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580949607.0
    },
    {
        "author": "slayerbeans",
        "body": "Wait for dividend pay before selling - if you do plan to sell. I am also thinking about selling. \n\nI have IBM since 2016. I regret not selling when it went up to $180 and dropped back to the price I originally purchased it for on 2018. I held on, purchased more stocks and reminded myself that this a long term investment. But now there are more competition, I am leaning towards selling all.",
        "created_utc": 1580940721,
        "id": "fgnacha",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580969521.0
    },
    {
        "author": "Duckinator617",
        "body": "Anyone think IBM has any more gas left in the tank?",
        "created_utc": 1580942019,
        "id": "fgncl2f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580970819.0
    },
    {
        "author": "angrynapkin1",
        "body": "Microsoft’s price history is a bit odd though... it was stagnant for a long time until recent initiatives started paying off. If you compared dot com to 2014 between SPY and MSFT, SPY would have easily won. MSFT future was very cloudy during Ballmer days.. seemed like it was becoming another IBM, losing to Google, Amazon, Facebook at everything except Windows, which was declining in share as well.",
        "created_utc": 1580837354,
        "id": "fgj5hfh",
        "score": 1,
        "subreddit": "investing",
        "created": 1580866154.0
    },
    {
        "author": "Jcpmax",
        "body": "Bigger than IBM now",
        "created_utc": 1580823802,
        "id": "fgijwff",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580852602.0
    },
    {
        "author": "show-up",
        "body": "Bing definitely in the lead to be top AI. Right next to IBM Watson.",
        "created_utc": 1580915850,
        "id": "fgm17uz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580944650.0
    },
    {
        "author": "ernieballer",
        "body": "And the head of that acquisition is now the IBM ceo",
        "created_utc": 1580583958,
        "id": "fg74qdk",
        "score": 1,
        "subreddit": "investing",
        "created": 1580612758.0
    },
    {
        "author": "3000dollarsuitCOMEON",
        "body": "PAC, WFC, IBM",
        "created_utc": 1580566054,
        "id": "fg6f0ca",
        "score": 1,
        "subreddit": "investing",
        "created": 1580594854.0
    },
    {
        "author": "david_chi",
        "body": "I know what you are getting at.  Just the generalized nature of your post begs to have it picked apart.  Apple down a few points is just day to day movement.  That’s not cut a cut bait example;e by any means.  \n\nBut look at Warren Buffet for example when he sunk billions into IBM stock.  He had over 10 billion worth at an average price of 170.  It was a declining stock for the majority of the time he held it ranging from 150-110 / share.  He eventually dumped it at a loss so he could put that money to better use elsewhere.  He loaded up on Apple and those shares are now worth almost 2x what he paid.  Had he stuck with IBM stock waiting for a recovery that never happened he would still be very much in the red today.",
        "created_utc": 1580785289,
        "id": "fghi1xw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580814089.0
    },
    {
        "author": "ThetaBurnVictim",
        "body": "Well market cap wise it’s now worth more than IBM and NVDA.... soooo",
        "created_utc": 1580847342,
        "id": "fgjmxp3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580876142.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM on some retard strength lately",
        "created_utc": 1580915021,
        "id": "fglzycl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580943821.0
    },
    {
        "author": "Children_of_Lucifer",
        "body": "I read an article a while ago saying the best indicator of who will win the AI race is whoever is hiring the most in that discipline. IBM is not out pacing others and Watson has failed at least twice in really world applications.",
        "created_utc": 1580917018,
        "id": "fgm31vy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580945818.0
    },
    {
        "author": "Jordykins850",
        "body": "It’s like a sales thing too.. at least IBM has seemingly found its lane focusing on financials and deep analytics.",
        "created_utc": 1580774352,
        "id": "fgh1c8y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580803152.0
    },
    {
        "author": "bandawarrior",
        "body": "That’s a good resource. Bloomberg and CNBC. Watch all the videos and interviews. Find out what they are saying and what the analysts write or talk about them.\n\nSome stuff also makes sense. I mean Ford? For fucks sake guy. It’s 1969 and it wants it’s stock back.\n\nYou see people walking around with the EarPods like it’s going out of style. Everyone’s on Instagram (FB).\n\nEveryone is buying on amazon prime and if you have any awareness you know Amazon has this thing called AWS. It prints money.\n\nAlso Microsoft is cool again. IBM sucks. Get with the program. Some things make sense. Like don’t buy JC Penney stock. \n\nTesla is a better car (don’t get involved in the calls).",
        "created_utc": 1580863843,
        "id": "fgkeqyc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580892643.0
    },
    {
        "author": "Neon_Yoda_Lube",
        "body": "I'm waiting on more development on their quantum computer commercialization personally. If I had to put money on them or IBM to be the first I would put it on intel to be honest. IBM hasn't had much good news lately on their progress.",
        "created_utc": 1580875483,
        "id": "fgkwtd9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580904283.0
    },
    {
        "author": "amerikayo",
        "body": "Intel, IBM, MU anyone? Thoughts?",
        "created_utc": 1580933769,
        "id": "fgmx9ry",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580962569.0
    },
    {
        "author": "Slaggon3",
        "body": "IBM 140p gotta be free money about now, right?  Bout 1-2mo out?",
        "created_utc": 1580933835,
        "id": "fgmxeln",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580962635.0
    },
    {
        "author": "ComplexPhase",
        "body": "Well, he announced he wants India to be the center of IBM's new efforts. So.... if you are talented and live in the US and work for IBM, will the last one turn out the lights?\n\nSeriously. Not much diversity at the head of top tech companies based in the US. This is what India pressure looks like - you get the best deals with India if you have an Indian CEO. Trump is not the only one playing with foreign influence playing with Putin. US tech companies play with foreign influence, because mathematically and otherwise, it is too much of a coincidence that most of the top US tech companies are CEOS from India - barring those companies created by a person. Why are the boards making this non-EEOC decision? Why is it that there is no Asian, no white, no hispanic, no black, no other as CEO of these companies that rely so heavily on Indian labor or sites in India that drive down cost? Hm.....maybe someone can get their AI to crunch the number on the probability of that being wholly without bias.\n\nBut so much for the US being a champion of diversity in tech for their US employees. Really. Tech may be high minded calling out ICE and so forth, but they are not a fan of the EEOC or the idea of diversity on their teams. Except for a couple of photo ops.",
        "created_utc": 1580671318,
        "id": "fgccmnu",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1580700118.0
    },
    {
        "author": "Jordykins850",
        "body": "It’s too high. I’d rather be loading up on IBM.",
        "created_utc": 1580554107,
        "id": "fg65475",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580582907.0
    },
    {
        "author": "3000dollarsuitCOMEON",
        "body": "Haha, did a double take. Good for IBM finally lol",
        "created_utc": 1580565676,
        "id": "fg6ekyu",
        "score": 1,
        "subreddit": "investing",
        "created": 1580594476.0
    },
    {
        "author": "PapaCharlie9",
        "body": "Where is your list of disadvantages?\n\nMy question, every time this topic comes up, is if we accept for the sake of argument that this time it's different, what exactly is different? What has so fundamentally changed that the long-term historic trends are now dead as dinosaurs?\n\nWhile all of those things you listed are advantages, they aren't advantages that weren't available to the large caps of the previous century. There was a time when IBM, T, XOM, GE, GM, JNJ, etc., seemed unstoppable large caps that could never be toppled from their top 10 positions, and yet they eventually were. \n\nMSFT and AAPL started out small to mid caps. Of course, not every small cap is going to turn into an MSFT or AAPL, or even 1 out of a 1000, but if the argument is that we should only buy stocks once they are large and established, isn't that also saying wait until they are more expensive?",
        "created_utc": 1580684156,
        "id": "fgdmqyo",
        "score": 1,
        "subreddit": "investing",
        "created": 1580712956.0
    },
    {
        "author": "jashsayani",
        "body": "There’s thousands of better investments than IBM.",
        "created_utc": 1580636440,
        "id": "fg9avsw",
        "score": 1,
        "subreddit": "investing",
        "created": 1580665240.0
    },
    {
        "author": "livecono",
        "body": "VZ (4.1%) and T (5.5%) both are ok coming out of earnings. IBM (4.5%) had a good one. Watch K (3.3%) going into earnings this week and CSCO (3.0%) next week.",
        "created_utc": 1580659712,
        "id": "fgb92cd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580688512.0
    },
    {
        "author": "ribnag",
        "body": "Because the market goes down, and the market goes up, but those sweet sweet dividends flow either way.\n\nIf it takes the market a decade to recover from the current artificially-maintained bull, are you going to sit on cash losing 2% per year to inflation the whole time, or are you going to at least enjoy 3% growth year over year regardless of actual stock prices?\n\nAnd in fact, dividend yield usually goes **up** in a bear market, because the DOW is largely meaningless to the day-to-day spending of the Joe Average.  If IBM is issuing $6/year in dividends, at $150/share, that's 4%; at $100/share, that's 6%.",
        "created_utc": 1580749023,
        "id": "fgfwbhi",
        "score": 1,
        "subreddit": "investing",
        "created": 1580777823.0
    },
    {
        "author": "dimitrynakhla",
        "body": "Listen here all. Have you been wondering what could be the next Tesla? I have the answer. IBM. Just look at how the stock has moved since Thursday. It is going to the sky now because the female CEO was replaced with a male CEO. Masculine gains are ahead of us. \n\nSo do yourself a favor and risk it all on International Business Men .. I mean Machines .. so that you may have enough tendies to feed those who are suffering from today’s TSLA reversal.",
        "created_utc": 1580955227,
        "id": "fgnxrsv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580984027.0
    },
    {
        "author": "Jordykins850",
        "body": "IBM/TSM/CSCO (two of the three), MRK or PFE, T/Comcast/DIS (two of the three). L3. PEP. If XLP and XLU weren’t so bloated, I’d point you there as well. LIT and FAN are some decent ETFs as well.",
        "created_utc": 1580942782,
        "id": "fgndvia",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580971582.0
    },
    {
        "author": "RealityPizza",
        "body": "IBM quietly mooning",
        "created_utc": 1580916095,
        "id": "fgm1lio",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580944895.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM, XOM are the leaders today. It's BOOMER TIME",
        "created_utc": 1580920667,
        "id": "fgm9z81",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580949467.0
    },
    {
        "author": "levon105",
        "body": "Semiconductors / chips. See ibm, mu, qcom, nvda, etc...",
        "created_utc": 1580923281,
        "id": "fgmf56x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580952081.0
    },
    {
        "author": "saul_2",
        "body": "AMZN and MSFT. IBM is an interesting pick if it focuses on cloud business.",
        "created_utc": 1580783488,
        "id": "fghf7mw",
        "score": 1,
        "subreddit": "investing",
        "created": 1580812288.0
    },
    {
        "author": "Coz131",
        "body": "IBM has shitty leadership. Used to buy their stuff but nothing have changed. I used to think the old school tech companies will go through a transformation but IBM is a disappointment.",
        "created_utc": 1580800768,
        "id": "fgi12ge",
        "score": 1,
        "subreddit": "investing",
        "created": 1580829568.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  4th of February\n\n\n\n## Upcoming events for Tuesday, February  4th\n\n - Stock splits:\n\n    - BVLDF @ **1:5**\n\n - Expected earnings:\n\n  AFL, AGN, AINV, ALIM, ALL, ALLT, AMSC, APAM, AQUA, ARA, ARLO, ARMK, ATGE, ATI, ATO, AXE, BDC, BE, BFIN, BOOT, BP, CB, CCK, CDK, CERN, CLX, CMCO, CMG, CMI, CNC, CNXN, COP, CTO, CTS, DIS, DOX, EGHT, EMR, ENTG, EQNR, ESE, ETH, ETN, EXP, F, FISV, GAIN, GHL, GILD, GL, GNW, GPMT, GRA, GTES, HAE, HIW, HLNE, HUBB, IPHI, IT, ITI, J, JHG, JKHY, KLAC, KN, KTCC, LHX, LII, LITE, LPT, MANH, MCHP, MCK, MDU, MEC, MKL, MLI, MOD, MODN, MSGN, MTCH, MTG, MWA, MWK, NBIX, NEWR, OI, OLN, OXLC, PAA, PAGP, PBI, PCTY, PDM, PINC, PKD, PLT, PRU, QGEN, RACE, RCL, RGS, RL, RNR, ROLL, RRR, SBH, SCSC, SFST, SILK, SIRI, SNAP, SNE, SPG, STX, SWI, TCS, TDG, TECH, TENB, THG, TRNS, UNM, USNA, VIAV, VSH, WAT, WDR, YRCW, ZAYO, ZBH\n\n - Ex-div:\n\n  AAL, AMTD, APTV, BBD, BBDO, BRO, CNXM, COLB, CZWI, FSBW, HMST, HTBK, IBCP, IDA, MPB, NTIC, OCFC, WTBA\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -4.267M)\n    - Durables Excluding Defense (previous: -2.5%)\n    - Factory Orders (consensus: 1.2%, previous: -0.7%)\n    - Factory orders ex transportation (previous: 0.3%)\n    - IBD/TIPP Economic Optimism (previous: 57.4)\n    - ISM NY Business Conditions (previous: 39.1%)\n    - ISM-New York Index (previous: 869.0)\n    - Redbook (previous: 0.1%)\n    - Redbook (previous: 5.5%)\n\n## Upcoming events for Wednesday, February  5th\n\n - Expected earnings:\n\n  ABB, ACLS, ADTN, AME, ANGI, AOSL, ARWR, ASC, AVB, BAP, BBD, BCEI, BMI, BSGM, BSX, BTU, CCMP, CDAY, CENT, CENTA, CFMS, CG, CINF, COHR, COTY, CPLP, CPRI, CSGS, CSII, CTSH, CUB, CURO, CUZ, DHT, DHX, DLHC, DTE, ECHO, ELF, ELY, EMKR, ENR, ENS, ENSG, EPM, EQX, FCBC, FEYE, FGBI, FLO, FMC, FORM, FOXA, FSV, GLAD, GLUU, GM, GPI, GPRO, GRUB, GSK, HI, HMN, HUM, IAC, IBA, IBN, ICHR, ICL, IEC, ING, INVA, IO, IRBT, KFRC, KLDO, KLR, KNL, LBRT, LCI, LNC, LPL, LYTS, MC, MCFT, MET, MHH, MHO, MIRM, MN, MPWR, MRK, MTRX, MXL, NESR, NNA, NS, NTGR, NUAN, NVO, NVT, OHI, ORLY, OSB, PAG, PAYC, PFGC, PFLT, PHX, PLUS, PROS, PSEC, PSTI, PTON, PTSI, QCOM, QNST, RAMP, RDN, RGLD, RYN, SAVE, SITM, SONM, SONO, SPOT, SR, SRDX, STC, SU, SUM, TBI, THR, TKR, TM, TMDX, TMHC, TRNO, TTMI, TUES, TWLO, TWO, UGI, UHAL, VNE, VXRT, WD, WERN, YUMC, ZNGA\n\n - Ex-div:\n\n  BPRN, BXG, CATC, DCOM, DHF, FELE, GHC, HESM, HFWA, KBH, MATX, NEP, NWBI, OFED, OPB, OPBK, RELL, RGA, SBUX, VAM, VBTX, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 156K, previous: 202K)\n    - Crude Oil Imports (previous: 0.133M)\n    - Crude Oil Inventories (consensus: 3.000M, previous: 3.548M)\n    - Cushing Crude Oil Inventories (previous: 0.758M)\n    - Distillate Fuel Production (previous: 0.025M)\n    - EIA Refinery Crude Runs  (previous: -0.933M)\n    - EIA Weekly Distillates Stocks (consensus: 0.467M, previous: -1.289M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.2%, previous: -3.3%)\n    - Exports (previous: 209.00B)\n    - FOMC Member Brainard Speaks\n    - Gasoline Inventories (consensus: 2.067M, previous: 1.203M)\n    - Gasoline Production (previous: -0.377M)\n    - Heating Oil Stockpiles (previous: -0.106M)\n    - ISM Non-Manufacturing Business Activity (consensus: 56.5, previous: 57.2)\n    - ISM Non-Manufacturing Employment (previous: 55.2)\n    - ISM Non-Manufacturing New Orders (previous: 54.9)\n    - ISM Non-Manufacturing PMI (consensus: 55.0, previous: 55.0)\n    - ISM Non-Manufacturing Prices (previous: 58.5)\n    - Imports (previous: 252.00B)\n    - MBA 30-Year Mortgage Rate (previous: 3.81%)\n    - MBA Mortgage Applications (previous: 7.2%)\n    - MBA Purchase Index (previous: 313.7)\n    - Markit Composite PMI (consensus: 53.1, previous: 52.7)\n    - Mortgage Market Index (previous: 649.8)\n    - Mortgage Refinance Index (previous: 2,581.2)\n    - Services PMI (consensus: 53.2, previous: 52.8)\n    - Trade Balance (consensus: -48.20B, previous: -43.10B)\n\n## Upcoming events for Thursday, February  6th\n\n - Expected earnings:\n\n  ABMD, AGCO, AGTC, AHH, AIRI, ALNY, AMAG, ARCH, ARW, ASYS, ATVI, AVNW, AVXL, AXGT, AYTU, BBIO, BBU, BCE, BCO, BDX, BEP, BGCP, BHE, BIDU, BILL, BKH, BLL, BMY, BRBR, BRKS, BRT, BSIG, BV, CAH, CBL, CCS, CDR, CDW, CI, COLM, COR, CPST, CRWS, CSL, CTHR, CX, CZNC, DLX, DNKN, DRTT, DX, DXC, EAF, EGAN, EGP, EHC, EIGI, EL, ENTA, EPIX, EXPO, FCAU, FFG, FLT, FSCT, FTNT, FTV, FWRD, G, GLOG, GLOP, GLT, GTIM, HAIN, HBI, HUBG, ICE, IGMS, IMKTA, IQ, IRMD, K, KB, KEM, KRTX, KTB, KTOV, LGF.A, LGND, LLEX, LMAT, LPTH, LQDT, LTRX, MAC, MBUU, MDP, MEIP, MMS, MNR, MNRL, MOBL, MPW, MR, MSI, MT, MTD, MTW, MYGN, MYOV, NGL, NGVC, NJR, NLOK, NOV, NR, NRZ, NTUS, NWSA, NYT, OCSI, OCSL, ODFL, OESX, OFC, OIIM, OMCL, ONTO, ONVO, PACB, PBH, PENN, PFSI, PINS, PJT, PLSE, PM, PMT, PNNT, POST, PRLB, PRO, PROF, PTEN, PXLW, PZG, REGN, RMR, RVLV, SCPL, SEEL, SGEN, SIMO, SKX, SNA, SNN, SNY, SPGI, SPH, SVM, SYNA, TDC, TGI, TMUS, TNAV, TOT, TPCO, TPR, TSE, TSN, TTWO, TWOU, TWST, TWTR, TXG, UBER, UEPS, ULH, USX, UTI, VCRA, VRSN, VRTU, VSAT, VSTO, VVI, WLTW, WMS, WWE, WYNN, XCUR, XFOR, XYL, YUM, ZEN\n\n - Ex-div:\n\n  AFB, AMSWA, ARLP, ARNC, AROC, ARTNA, AUB, AWK, BCBP, BCO, BMRC, BPFH, CELP, CEQP, CFFN, CIT, CLR, CMCO, CMS, COST, CSTR, CVCY, ET, FBMS, FCBC, FCF, FE, FII, FRAF, GMLP, HOPE, INTC, JBHT, LBC, MMLP, MMP, NGL, NRP, NSC, PCTI, PH, PNFP, RBB, SBFG, SMBK, SMLP, SSB, SUN, SYF, WAB, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.545%)\n    - 8-Week Bill Auction (previous: 1.550%)\n    - Challenger Job Cuts (previous: -25.2%)\n    - Challenger Job Cuts (previous: 32.843K)\n    - Continuing Jobless Claims (consensus: 1,720K, previous: 1,703K)\n    - FOMC Member Kaplan Speaks\n    - FOMC Member Quarles Speaks\n    - Initial Jobless Claims (consensus: 215K, previous: 216K)\n    - Jobless Claims 4-Week Avg. (previous: 214.50K)\n    - Natural Gas Storage (previous: -201B)\n    - Nonfarm Productivity (consensus: 1.5%, previous: -0.2%)\n    - Unit Labor Costs (consensus: 1.3%, previous: 2.5%)\n\n## Upcoming events for Friday, February  7th\n\n - Expected earnings:\n\n  ABBV, ASX, AVTR, BBX, CAE, CBOE, CCJ, CIVB, CNHI, CYOU, GOOS, HDB, HMC, MSG, PIXY, RGCO, ROAD, SOGO, SOHU, SPR, TAK, THFF, UFS, VIVO, XAIR\n\n - Ex-div:\n\n  AAPL, AEP, AFIN, BGSF, BX, CCR, CDR, CINR, CLDB, COF, CSV, CWT, DCF, DHI, DLB, EBTC, FIBK, GABC, GLP, GROW, GWW, HBCP, HBT, HP, IBM, IBTX, ISBC, ITUB, MPX, MRLN, MWA, NBL, NBN, NYCB, OLN, PUB, PZZA, ROL, SC, SCHN, SFBC, SJW, STND, SXI, USDP, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 3.0%, previous: 2.9%)\n    - Average Hourly Earnings (consensus: 0.3%, previous: 0.1%)\n    - Average Weekly Hours (consensus: 34.3, previous: 34.3)\n    - CFTC Aluminium speculative net positions (previous: -47.0K)\n    - CFTC Copper speculative net positions (previous: 5.8K)\n    - CFTC Corn speculative net positions (previous: 48.0K)\n    - CFTC Crude Oil speculative net positions (previous: 520.6K)\n    - CFTC Gold speculative net positions (previous: 317.7K)\n    - CFTC Nasdaq 100 speculative positions (previous: 9.0K)\n    - CFTC Natural Gas speculative net positions (previous: -249.4K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 4.6K)\n    - CFTC Silver speculative net positions (previous: 68.9K)\n    - CFTC Soybeans speculative net positions (previous: 17.6K)\n    - CFTC Wheat speculative net positions (previous: 47.7K)\n    - Consumer Credit (consensus: 15.00B, previous: 12.51B)\n    - Government Payrolls (previous: 6.0K)\n    - Manufacturing Payrolls (consensus: -5K, previous: -12K)\n    - Nonfarm Payrolls (consensus: 160K, previous: 145K)\n    - Participation Rate (consensus: 63.1%, previous: 63.2%)\n    - Private Nonfarm Payrolls (consensus: 150K, previous: 139K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 675)\n    - U.S. Baker Hughes Total Rig Count (previous: 790)\n    - U6 Unemployment Rate (previous: 6.7%)\n    - Unemployment Rate (consensus: 3.5%, previous: 3.5%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -0.1%)\n    - Wholesale Trade Sales (consensus: 0.4%, previous: 1.5%)\n\n^^^^2020-02-04",
        "created_utc": 1580814012,
        "id": "fgiafid",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1580842812.0
    },
    {
        "author": "Ur7thfather",
        "body": "Literally bought a 144 ibm call this weekend for 2/7 and it was oonced this morning when i checked my shi",
        "created_utc": 1580763297,
        "id": "fggjpzf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580792097.0
    },
    {
        "author": "IAMV100",
        "body": "It sounds like you are perhaps uninformed, but not dumb. Dumb people are those that have the information and opportunities but still choose to ignore them. Uninformed people just don't know any better, and it sounds like you had the kind of environment that didnt foster financial learning or stability. Reaching out and trying to better your future sounds pretty smart to me.\n\nOn average the S&amp;P500 increases about 8-10% annually. Look up SPY and VOO ETFs, which track the S&amp;P500 (500 biggest companies on the US stock market). People are usually better off buying and holding those than picking individual stocks. At that rate of return, you might expect between 59-75k if you invest $100/month for 20 years due to compound interest.\n\nAlso, 53 isnt too late for you! You have another 20-30 years left statistically, possibly more with medical advancements. A lot of great people didn't make it big until their 50s. IBM and Home Depot were started by a 61 and 50 year old, you've still got opportunity left! Good luck!",
        "created_utc": 1580771596,
        "id": "fggx87o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580800396.0
    },
    {
        "author": "Jordykins850",
        "body": "I’ve literally been ahead of the curve on everything.. Tesla, IBM, yada yada yada. I’m sure shortly after these SPY/XLU shorts kill me.. Iran will hack the utilities grid and melt down a nuclear reactor.",
        "created_utc": 1580773906,
        "id": "fgh0omw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580802706.0
    },
    {
        "author": "MaliciousLegroomMelo",
        "body": "While I would agree with the general thesis that Intel has lost a few notches of their technical superiority, do you think that necessarily translates into stock price?  Such tectonic shifts - if real - can take a very long time.  \n\nThere used to be a saying \"nobody ever got fired for picking IBM\". It took decades for that rule to fade.  The same is true of Intel.  AMD may indeed be crushing it on tech, and winning customers one at a time.  But it will take a long time for Intel to lose their dominance, even if it's warranted.  \n\nKeep in mind the just had a blowout quarter.  Companies pay them $73 billion a year for what is essentially melted sand.  \n\nPerhaps their blowout is due to low analyst expectations.  But that's a condition that can take a quarter or two to rectify as the analysts gradually tweak their recommendations and targets to levels where Intel will struggle or miss.  That means they could beat again next quarter.  \n\nThey now have a permanent CEO who is a numbers guy, who reported is working for peanut salary with a strong incentive to crank those numbers.\n\nYour diagnosis is they've lost their way in product architecture and design and innovation. I won't argue as I wouldn't know and your case sounds plausible.  If so, then they probably have the wrong CEO since he doesn't sound like he'd be the inspiring voice to revive the product innovation.\n\nI sense the author is a die hard AMD fan, which is fine.  But AMD having a cooler product doesn't necessarily put Intel out of business.  Coke and Pepsi continue to punch the clock and fight each other.  And AMD's multiple is so out of whack that they probably need to crank up earnings by cranking up sales but any moves they make on price or competitiveness won't be as a monopoly; they'll be done with Intel fighting them for every inch.\n\nTo me that means even if your theory of AMD taking the crown from Intel is happening, it will be a slow moving coup.",
        "created_utc": 1580826857,
        "id": "fginy26",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580855657.0
    },
    {
        "author": "HinduHamma",
        "body": "That’s the way to do it boys. If your dead broke just scrap up and save a little bit. Because a little bit is all you need to gamble on earnings. \n\nIt just works folks. Better odds than scratch offs or the roulette table. The key is just doing ER yolo only on volatile shit that has the potential to move. \n\nStop doing it on boomer blue chip shit like ibm and visa you idiots. Play those wild sluts like Bezos and musk. Watch all these DIS dumb asses cry when the stock barely moves 3 percent today from ER. You don’t play yolos on shit that historically doesn’t move much. You want something that might give you the biggest erection you ever had. \n\nWell done. Now take that 30k and buy these 1200 strike Tesla fds to turn into 3 mill you pussy.",
        "created_utc": 1580838636,
        "id": "fgj7s4d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580867436.0
    },
    {
        "author": "saul_2",
        "body": "My money is on Krishna - the new appointed CEO  - to bring IBM into a growth-centric company through their cloud computing business.",
        "created_utc": 1580822366,
        "id": "fgii5v1",
        "score": 1,
        "subreddit": "investing",
        "created": 1580851166.0
    },
    {
        "author": "throwitaway2384719",
        "body": "People always say this and then some disruptor comes along. Ibm and hp used to be the apple of today.",
        "created_utc": 1580841977,
        "id": "fgjduw2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580870777.0
    }
]