[
    {
        "author": "robotlasagna",
        "body": "Imagine if you used this strategy 20 years ago and one of your picks was GE or Cisco. Both of those companies were seen as unstoppable back then.\n\nA lot can happen in 20 years.",
        "created_utc": 1594848603,
        "id": "fy6rl3f",
        "permalink": "/r/investing/comments/hrwe84/warren_buffet_if_i_had_never_sold_a_stock_i_would/fy6rl3f/",
        "score": 181,
        "subreddit": "investing",
        "created": 1594877403.0
    },
    {
        "author": "wegwerf874",
        "body": "I'm a very old man, and this feels too much like Cisco. Great company with two-digit annual growth rate in the nineties but back then priced for the year 2050.",
        "created_utc": 1595456948,
        "id": "fyx5vch",
        "permalink": "/r/investing/comments/hw1jny/tesla_reports_4th_straight_quarter_of_profits/fyx5vch/",
        "score": 69,
        "subreddit": "investing",
        "created": 1595485748.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "They were using cisco webx.",
        "created_utc": 1596142631,
        "id": "fzs8qk0",
        "permalink": "/r/wallstreetbets/comments/i0tuks/missed_the_clear_sign_during_big_tech_hearings_on/fzs8qk0/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1596171431.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "It is hard to tell what tech stocks and the NASDAQ will do but a bit of history is worth studying.\n\nIn 2000 Cisco was the giant of the internet and the internet was the giant of tech stocks. Every employee at Cisco was rich because they all got stock options (yes, including the janitors in those days) and the stock price had climbed from $10 in 98 to $33 in 99 and $79/sh in 2000. They did then sell and still do sell routers that were the backbone of the internet and CSCO was everyone's tech darling. I can't tell you how many Cisco employees had told me in spring of 2000 that they were not going to diversify until CSCO hit $100/sh. In Sept of 2001, their share price had dropped to $12/share. They still were the backbone of the internet but the internet and tech were no longer the darling of the Market. In Feb of 2009 they were at $14/sh and are today at $48/sh. So they today as an ongoing company still doing what it did and with a strong balance sheet are trading at roughly 2/3rds the price they were 20 years ago. That is what can happen to a really good tech company.\n\nBTW, CSCO is not the only one. Intel was at $74.88 in the fall of 2000 and is at $60/sh now and was running around in the $20's for most of the past 20 years. Still a great tech company doing great things.   And yes Intel employees also got rich on options.  I met with a Intel employee, a janitor, single, living in a trailer that was about to exercise $3 mm in net in the money INTC options and needed help with estate planning.   Those were the days.  A short edit:  In 2000 the estate tax began with only $675,000 of assets at death and it started just below 50% and quickly grew to 55%.   So you didn't need to be very wealthy to need estate tax planning.\n\nMicrosoft, one of today's tech darlings, was $50/sh in early 2000. It wandered around $25/share for 15 years until it again hit $50/sh in fall of 2015, fifteen long years later. The last 5 years have been good for it but will it stay at $200/sh?",
        "created_utc": 1595185321,
        "id": "fyl1bdi",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fyl1bdi/",
        "score": 56,
        "subreddit": "stocks",
        "created": 1595214121.0
    },
    {
        "author": "likeitis121",
        "body": "Depends on how you categorize them.  They aren't software companies, but the general market sees them as tech companies, which is the companies that benefit so much.  The people hyping up Tesla so much, are arguing that it's a tech company, even though it makes cars.\n\nThe big 5 (MSFT/AAPL/AMZN/FB/GOOG) are definitely solid companies.  That doesn't change the fact that they've gotten overvalued.  Apple has grown 2.5x in value the past few years, but revenues have slowed, and profits really haven't changed much.  \n\nBelow that top tier you have a bunch of unprofitable $100-300M companies that have gotten hyped up.  And simply comparing it to 2000 without reference is ignoring it.  Microsoft, Cisco, and Intel were top 10 companies and weren't the single product late 90's product that you focus on.  Cisco still lost 90% of it's value, and still isn't back up there.  Microsoft still took 16 years to recover it's lost market cap.  \n\nHow am I throwing a tantrum.  It's a fact that the only time that valuation compared to trailing earnings was higher was the dot com bubble, and near right before great depression, the only time that market cap was higher as a percentage of GDP was dot com bubble.  There's tons of comparables that suggest this market is overvalued, and absolutely 0 that it's undervalued compared to history.",
        "created_utc": 1594779580,
        "id": "fy3qh5v",
        "permalink": "/r/StockMarket/comments/hrd2vx/dow_futures_jump_250_points_after_moderna_says/fy3qh5v/",
        "score": 18,
        "subreddit": "StockMarket",
        "created": 1594808380.0
    },
    {
        "author": "skwirly715",
        "body": "MSFT has growth potential due to its diversification across tech sub-sectors. It is also safe for this reason, whereas single-service companies are less so. I don’t think you can put it in the same box as Cisco or Intel, hardware companies focused on providing a single service. \n\nMSFT has greater market share in the broader tech sector than either of those companies because it has expanded vertically (across sub sectors, for example gaming, office software, web services, laptops/hardware) instead of trying to expand horizontally (within its own sub sector) and has plans to continue to do so via its cloud services. I personally do not know who will “win” the cloud web services sub sector but I know that MSFT won’t lose purely due to its advantage in existing office software (MS Office integrates well with devices like Azure and Sharepoint making it more appealing to companies exploring the cloud).\n\nI love your take regarding the cyclical nature of those speculator dollars, but I think MSFT should be compared to AAPL, AMZN, and GOOG instead of CSCO and Intel. Maybe Shopify is a better comp for CSCO and Intel?",
        "created_utc": 1595194666,
        "id": "fylihmd",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fylihmd/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1595223466.0
    },
    {
        "author": "Iskippedfaceday",
        "body": "I don’t mean to sound rebellious, but this sub has really rejected the potential of this stock for no reason.\n\nThey are partnered with: Apple, Nvidia, Intel, AMD, Boeing, IBM, Lenovo, HP, Lyft, Puma, Toshiba, Raytheon, Thunderbolt, Universal Audio, Focusrite, and Cisco etc...\n\nThey also make twice as much revenue as their entire market cap and now have the only PCIe 4.0 expansion system in the world.\n\nI understand that the history of this sub is based on people getting burned and such, but when we all drool over a possible partnership with ONE of those companies? This company has them all already. \n\nTheir contracts with the U.S. military, side projects with NVIDIA, and the incentives given to their CEO to keep their share price up are just bonuses. \n\nI am really committed to seeing how this company performs, because after beating their earnings so many times, they are definitely well-positioned to move forward.",
        "created_utc": 1594671110,
        "id": "fxyqaxx",
        "permalink": "/r/pennystocks/comments/hqm2v8/oss_detailed_dd_on_the_pcie_backbone_of_nvidia/fxyqaxx/",
        "score": 17,
        "subreddit": "pennystocks",
        "created": 1594699910.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "Dividends?  We are talking about tech stocks here.  CSCO began dividends in 2011 at an overwhelming $0.06/share.  MSFT started dividends in 2003 at a magnificent 8 cents/share and today is paying an outstanding dividend of 0.98%.   Intel (INTC) was paying dividends in 2000 and it was a huge 2 cents/share.   The words dividends and tech stocks can not easily be used in the same sentence.",
        "created_utc": 1595187041,
        "id": "fyl4k6y",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fyl4k6y/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1595215841.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "I seriously thought about buying a Model 3 last year.  Ultimately I did not as I think I would have range anxiety on long trips.  But a number of friends have Teslas and each of them really like the car.  I also think that Tesla is going to be a viable car company long term and will do well in the future.\n\nThe problem is that the current price would only be justified if they were already profitable building and selling 5-6 mm cars per year and they don't do 10% of that and are not in any way profitable.   So anyone buying now is assuming they will find somebody that is a greater fool than they are to actually buy the stock from them at a price higher than $1500.\n\nIn 2000 I was young and stupid and financially had a great year.  Some of the companies I invested in that are still very successful and still leaders in their field were CSCO and JNPR.   2000 was the year of the internet and Cisco built all the routers for the internet worldwide.  Some ex Cisco employees had started Juniper and were building specialty routers that were pushing Cisco to improve.   All of that still is true and both companies are fabulously profitable and leaders in their field but today can be classified as old tech.  I paid $65/sh for CSCO and bought JNPR at $65, $83, and $115/sh.   Today CSCO is $48 and JNPR is $22 with no splits in the meantime.   Sometime you can be early and never recover.   That is where Tesla is now.   In 20 years 80% of the cars being sold will be EVs or H2 and every manufacturer will be making excellent products.  Tesla will be old tech and the 20 year olds now pumping Tesla will be 40 with 2 kids approaching college age and wondering about that $1500/sh stock they bought in 2020 that is worth $350/sh in 2040.",
        "created_utc": 1594520788,
        "id": "fxsce6i",
        "permalink": "/r/investing/comments/hplp2u/how_tsla_is_a_meme_stock_and_how_it_isnt/fxsce6i/",
        "score": 13,
        "subreddit": "investing",
        "created": 1594549588.0
    },
    {
        "author": "myne",
        "body": "Lol Cisco has had proper versions of that since the documentary, Demolition Man.",
        "created_utc": 1594827486,
        "id": "fy5j2dd",
        "permalink": "/r/wallstreetbets/comments/hroitj/zoom_is_doomed_bears_chasing_them_off_campus/fy5j2dd/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1594856286.0
    },
    {
        "author": "__justsayin__",
        "body": "You don't want a tech stock paying a \"good dividend\" since most of them are losers - just look at the likes of IBM, CSCO, even QCOM.  You want a tech company which focuses on growth, and growth companies typically do not pay dividends.",
        "created_utc": 1594771155,
        "id": "fy3c463",
        "permalink": "/r/CanadianInvestor/comments/hrczix/good_tech_stocks_for_dividend_investor/fy3c463/",
        "score": 12,
        "subreddit": "CanadianInvestor",
        "created": 1594799955.0
    },
    {
        "author": "CptTonyStark",
        "body": "NASDAQ more than tripled from late 1998 to March 2000. The P/E ratios soared above 100. Expectations of future stock returns ranged from 15%-25% a year. \n\nCISCO was selling at a triple digit P/E ratio, with a market cap of $600 billion. If Cisco grew it's earnings by 15% a year, it would still be selling well above the avg P/E ratio 10 years later. And if it returned 15% for the next 25 years and the US economy continued growing at 5% a year, Cisco would be bigger than the entire economy.\n\nWhen the bubble burst, even a blue Chip like Cisco lost 90% of its value.",
        "created_utc": 1595791262,
        "id": "fzbvsle",
        "permalink": "/r/wallstreetbets/comments/hx90gx/weekend_discussion_thread_for_the_weekend_of_july/fzbvsle/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1595820062.0
    },
    {
        "author": "_icarcus",
        "body": "first, figure out which sector you want to invest in. tech? energy? cloud computing? AI? home builders? \n\nsecond, find ETF’s that cover that sector and then compare its 5-10 yr chart to the S&amp;P 500. \n\nFrom an outside perspective, from Jim Cramer — host of CNBC’s, MAD MONEY — a fool proof way to start a saving is to invest your first $10,000 into a total market ETFs. Something like the SPY, VOO, VTI, or — if you want to focus on growth stocks — high risk, high return: VOOG. \n\nOverall, ETFs will allow you exposure to hundreds of companies under one name. Apple, MSFT, Cisco will all be  a tech focused ETF. They, on average, follow the markets trend and produce steady but OK returns. \n\nCheck out etf.com and look at their ETF screeners. They’ll tell you the expense rates (how much it costs a year), it’s price, what companies it has holdings in, and it has a return chart of 5+ years.",
        "created_utc": 1595800863,
        "id": "fzce488",
        "permalink": "/r/RobinHood/comments/hyf7ix/newbie_here_wanting_to_get_started_where_to_even/fzce488/",
        "score": 10,
        "subreddit": "RobinHood",
        "created": 1595829663.0
    },
    {
        "author": "FucklberryFinn",
        "body": "Wait, what? PHUN is a tech company and Cisco just picked up their software for their app market...",
        "created_utc": 1595000187,
        "id": "fyda2kh",
        "permalink": "/r/pennystocks/comments/hsxs0v/dont_hop_on_a_raging_bull_phun/fyda2kh/",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1595028987.0
    },
    {
        "author": "SurgeonLoki",
        "body": "Anti tech trust. Streamed with YouTube, meeting via Cisco and the Congress morons using iPhones....only in America 😓",
        "created_utc": 1596053469,
        "id": "fznm8a4",
        "permalink": "/r/wallstreetbets/comments/i07nqx/what_are_your_moves_tomorrow_july_30_2020/fznm8a4/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1596082269.0
    },
    {
        "author": "Norrisemoe",
        "body": "As someone in telecoms this is the BS that really gets me. There is literally no evidence or proof of any spying being done by Huawei and yet there is known factual confessions of network manufacturers like Cisco baking in [many many](https://www.bleepingcomputer.com/news/security/cisco-removes-backdoor-account-fourth-in-the-last-four-months/) for the US's use.\n\nChina is clearly power hungry and breaking treaties so yes they suck, but honestly this whole 5G thing is entirely overblown and they are not even guilty and have offered to have their code tested. The US is guilty of spying though but I get we need them for Brexit so oh well who cares gonna have to suck that one. I just don't get the complaints of people especially non-technical people complaining about Huawei's network equipment. Huawei makes all the TalkTalk home hubs, they would be able to spy on the vast majority of the population through those if they wanted! But do they? No (yes I looked for it). It's infuriating I hate it and no one ever talks about what a joke the technical side is just \"China bad, Huawei bad\" what happened to the crazy left telling everyone to stop generalizing?\n\n/rant",
        "created_utc": 1594765940,
        "id": "fy32t2e",
        "permalink": "/r/investing/comments/hr2y6z/boris_johnson_moves_to_ban_huawei_in_the_uk_by/fy32t2e/",
        "score": 7,
        "subreddit": "investing",
        "created": 1594794740.0
    },
    {
        "author": "juanda2",
        "body": "can you take a look at CSCO?",
        "created_utc": 1595305062,
        "id": "fyqfsdf",
        "permalink": "/r/options/comments/huwfat/short_long_option_plays_07202020/fyqfsdf/",
        "score": 7,
        "subreddit": "options",
        "created": 1595333862.0
    },
    {
        "author": "UABeeezy",
        "body": "Congress using Cisco is classic boomer shit. Only they would use a competitor when doing a virtual antitrust hearing. Fucking dweebs",
        "created_utc": 1596043326,
        "id": "fzn0w5k",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzn0w5k/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1596072126.0
    },
    {
        "author": "AccomplishedClub6",
        "body": "You are assuming GE and CSCO aren't also part of index funds that people have invested in (which also lost money when these stocks dropped).\n\nYou are also assuming 100% of the stocks people pick will crash down and never recover, and there won't be big winners in some of their picks.  Picking stocks is exactly like an index fund, except it's a smaller group of stocks relative to the thousands in an index fund.  So just like an index fund, there will be losers in your stock picks.  But just like an index, there will be 20% of your picks that return 80% of the total profits over the long term.",
        "created_utc": 1594863111,
        "id": "fy7ib89",
        "permalink": "/r/investing/comments/hrwe84/warren_buffet_if_i_had_never_sold_a_stock_i_would/fy7ib89/",
        "score": 7,
        "subreddit": "investing",
        "created": 1594891911.0
    },
    {
        "author": "solidmussel",
        "body": "For 4 months in.... I think you have a pretty good start. \n\nOne suggestion... dont be overconfident about your picks. \n\nI'd also point out that you have some entire sectors missing and you may want to find a good retail/grocery, real estate stock (I hold Kroger and Costco and sun communities).\n\nYou may also want to add a couple extreme value and a couple high growth.\n\nFor value I hold ATT, IBM, Cisco, BRK.  For growth I have SHOP, NFLX, Splunk,  and Lyft.\n\nLastly get Google in there!!",
        "created_utc": 1594605668,
        "id": "fxw0evs",
        "permalink": "/r/investing/comments/hpum76/sharing_the_16_stocks_in_my_portfolio/fxw0evs/",
        "score": 7,
        "subreddit": "investing",
        "created": 1594634468.0
    },
    {
        "author": "cassiusclayd",
        "body": "Only if you bought the right ones. A number of the largest cap tech stocks in 1999 have \\*absolutely not\\* done just fine. Cisco and Intel, for example, have never fully recovered since the dot com bubble.",
        "created_utc": 1594529924,
        "id": "fxsug93",
        "permalink": "/r/investing/comments/hplw3z/is_this_what_the_market_felt_like_in_2010_and_2011/fxsug93/",
        "score": 6,
        "subreddit": "investing",
        "created": 1594558724.0
    },
    {
        "author": "bernee_562662",
        "body": "Sponsors\n\nSamsung thanks sponsors for their support in this unique virtual experience including Cisco, Havrion, ALMO, D&amp;H, Stampede, Navori Labs, Boxlight, Useful, TechData, Synnex Corporation, Ingram, and MA Labs.",
        "created_utc": 1594834940,
        "id": "fy5yu7b",
        "permalink": "/r/pennystocks/comments/hrrz3e/boxl_our_apologies/fy5yu7b/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1594863740.0
    },
    {
        "author": "ReversalTheory",
        "body": "Cash out on my AMD, NTGR, CSCO calls tomorrow and buy MSFT, AMZN, SPOT sound like a good plan? Expecting the sell off to continue throughout tomorrow but will probably pick up calls eod. Shits getting pumped thru the weekend",
        "created_utc": 1595552396,
        "id": "fz1j2ka",
        "permalink": "/r/wallstreetbets/comments/hwn0fj/what_are_your_moves_tomorrow_july_24_2020/fz1j2ka/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595581196.0
    },
    {
        "author": "dawgsgoodjortsbad",
        "body": "AMZN was AMZN in 2000.  MFST was MFST.  CISCO was CISCO.  \n\nAll of them crashed HARD AF (&gt; 50+%) in 2000.\n\nIf you bought Microsoft back in 2000 at the peak, you would have to hold over 16 years just to break even.",
        "created_utc": 1595455155,
        "id": "fyx2rao",
        "permalink": "/r/wallstreetbets/comments/hvy0uo/my_fellow_bears_it_could_be_awhile_quite_before/fyx2rao/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595483955.0
    },
    {
        "author": "covalent523",
        "body": "lol jeff using his name while mark using facebook as his in the cisco call. ALPHA AF",
        "created_utc": 1596043329,
        "id": "fzn0wdm",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzn0wdm/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1596072129.0
    },
    {
        "author": "hijinks",
        "body": "yes.. ask any good option trader.. most of them will not hold through earnings. \n\nCisco is a good example. Their CEO would come out and say.. ya we beat beatings by 30 cents BUT we expect a lot of new competition. Stock will sell off. \n\nOr he comes out and earnings are -30 cents and he says outcome looks good moving forward and stock goes up",
        "created_utc": 1595392487,
        "id": "fyub8c9",
        "permalink": "/r/wallstreetbets/comments/hvn3f9/msft_earnings/fyub8c9/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1595421287.0
    },
    {
        "author": "varun22486",
        "body": "It tan like 15% today and has a lot of room. There is a lot of room to run. If you think they just partnered with CISCO. They launched a software for higher school education which will help school run online.",
        "created_utc": 1594947990,
        "id": "fybb66t",
        "permalink": "/r/pennystocks/comments/hsli5h/missed_out_on_boxl_dont_want_to_chase_hmhc_phun/fybb66t/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1594976790.0
    },
    {
        "author": "robotlasagna",
        "body": "They said \\*exactly\\* this about Cisco back in 1999/2000. Cisco was going to run the world and be the future of television and radio and all this other stuff and they (at the time were supposed to be the first $1T market cap company. You should go on CNN finance and search the archives and see the similarities with how people talked about Cisco vs Tesla.\n\nDont get me wrong Tesla is a super forward thinking company but you should always at least consider the possibility that people are a little too excited about its prospects in terms of share price.",
        "created_utc": 1594741597,
        "id": "fy1o9of",
        "permalink": "/r/investing/comments/hr2o2b/tesla_2020_vs_ericsson_2000/fy1o9of/",
        "score": 5,
        "subreddit": "investing",
        "created": 1594770397.0
    },
    {
        "author": "Shacreme",
        "body": "Online Schooling? Tech stocks should shoot up to the moon......\n\nMSFT, ZM, CSCO should shoot up 4/5%",
        "created_utc": 1595013672,
        "id": "fye1zm6",
        "permalink": "/r/wallstreetbets/comments/hst6nm/daily_discussion_thread_for_july_17_2020/fye1zm6/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595042472.0
    },
    {
        "author": "ChronicCSD",
        "body": "CSCO is such dog shit. Its baffling.",
        "created_utc": 1593701330,
        "id": "fwp9tuw",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwp9tuw/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1593730130.0
    },
    {
        "author": "Rahvinx",
        "body": "Csco\nIt's not sexy but they make money hand over fist",
        "created_utc": 1594774709,
        "id": "fy3i9qc",
        "permalink": "/r/wallstreetbets/comments/hr8uhb/what_are_your_moves_tomorrow_july_15_2020/fy3i9qc/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594803509.0
    },
    {
        "author": "Children_of_Lucifer",
        "body": "All I got from the link was Cisco Webex. So all in CSCO?",
        "created_utc": 1595294885,
        "id": "fypz9pk",
        "permalink": "/r/wallstreetbets/comments/huvftf/i_demand_astrazeneca_loss_porn/fypz9pk/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595323685.0
    },
    {
        "author": "Marcheesio",
        "body": "Yeah, exactly. If you used this same logic 20 years, sure you’d have winners but you’d also be holding stocks like GE and Cisco which have seriously lagged the market as a whole.\n\nThere’s no such thing as a “never sell” stock. Berkshire Hathaway might be the closest, that’s about it.",
        "created_utc": 1595554530,
        "id": "fz1mql6",
        "permalink": "/r/stocks/comments/hwppnh/what_makes_msft_a_good_or_never_sell_stock/fz1mql6/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1595583330.0
    },
    {
        "author": "Aaronsmth5",
        "body": "I have used teams and also frequently use Webex from Cisco. Zoom is fucking terrible",
        "created_utc": 1595298025,
        "id": "fyq4mys",
        "permalink": "/r/wallstreetbets/comments/huxabs/alright_enough_is_enough_zm_puts_back_on/fyq4mys/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595326825.0
    },
    {
        "author": "Power80770M",
        "body": "Nope, you're wrong. Cisco, Intel, Oracle, and Microsoft had absolutely insane valuations back then, and they were all very profitable.",
        "created_utc": 1594071020,
        "id": "fx52y7k",
        "permalink": "/r/wallstreetbets/comments/hmgm67/article_from_2013_about_the_2000_bubble_anything/fx52y7k/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594099820.0
    },
    {
        "author": "Neo1331",
        "body": "True, it's going to be interesting to see where Intel goes in the next 5 years. Though AMD is eroding their market share slightly, I really don't think they will get a lot of server side clients in the end. Intel controls about 98% of the server world and corporate clients don't think on a year to year basis, so if 7 nm doesn't come out till 2022 it won't effect their corporate client base all that much.  \n\nRemember the world runs on Intel, Microsoft and Cisco....",
        "created_utc": 1595611961,
        "id": "fz40b1h",
        "permalink": "/r/wallstreetbets/comments/hx2uvp/intc_down_16/fz40b1h/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595640761.0
    },
    {
        "author": "haasvacado",
        "body": "Gentleman, idgaf about your individual views on the severity of the current pandemic but y’all should know that the rising numbers outside the US may very well contribute to a rapid shift in global sentiment towards “oh, fuck here we go again” in the next week or two. \n\nShort term positions so you don’t write me off as a frustrated bear:\n\nUL 62.5c 8/21\nCSCO 46.5c 7/31\nDBX 22.5p 7/31\nKO 48.5p 7/31",
        "created_utc": 1595949292,
        "id": "fzipk7o",
        "permalink": "/r/wallstreetbets/comments/hzc3ko/daily_discussion_thread_for_july_28_2020/fzipk7o/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1595978092.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "What you say is certainly true.  MSFT and AMZN and others appear to be diversified in interesting ways, mostly services and cloud projections.  The obvious bubbles are in ZM, Shop, TSLA and others that really are one trick ponies.  But think about the problems in 2000.  We had just had the internet millenial clock challenge so everybody and been spending a lot on hardware.  And the market simply projected that growth forward for years.   It didn't happen.  Are we making the same mistake now with services and the Cloud?  There has to be a point where, like hardware, the services are mature and the crazy growth comes back to single digits.  When/if that happens these crazy multiples will come way down.   I certainly could be wrong but if that happens in cloud and services we are going to see a real problem in AMZN, AAPL, GOOG and MSFT just as happened with INTC, CSCO, JNPR and AMAT in 2000.",
        "created_utc": 1595196630,
        "id": "fylm4eb",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fylm4eb/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1595225430.0
    },
    {
        "author": "Kainint",
        "body": "Current positions:\n\nFor 7/17:  \nTWTR 38c  \nNIO 17c  \nSNAP 29c  \nMSFT 225c  \n  \nFor 8/21:  \nCSCO 60c  \n\n\nDidn't dump too bad so far today, and plenty of time to come back up",
        "created_utc": 1594313977,
        "id": "fxftxtr",
        "permalink": "/r/wallstreetbets/comments/ho0krw/daily_discussion_thread_for_july_09_2020/fxftxtr/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594342777.0
    },
    {
        "author": "samaritan1331",
        "body": "Puts on cisco for blacking out tim apple",
        "created_utc": 1596044956,
        "id": "fzn4bqu",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzn4bqu/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596073756.0
    },
    {
        "author": "_Law_So_Hard_",
        "body": "Why tf is CSCO not flying? I think it crushes earnings. Everyone’s using it",
        "created_utc": 1596050454,
        "id": "fznfvtv",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fznfvtv/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596079254.0
    },
    {
        "author": "hijinks",
        "body": "ok you are wrong on so many things. I've traded options for almost 3 years now.\n\n1) experienced option traders almost never hold post-ER. Why? We play the run up. The good ER is built into the run up. Almost always on good ER there is maybe a slight bump and then a sell up. Then a week or so later it has a good chance to run again. It's such a rookie mistake to think just because a company has a good ER the stock will go up\n\nCisco is a prime example of that. Cisco would beat earnings but their CEO might mention that they see stiff competition ahead in the earnings call. The stock will go down. They will miss on earnings but the CEO is positive and the stock goes up. \n\nIntel does not dominate production servers. I've worked in linux sys admin/devops/cloud eng for 21 years. AWS is slowly migrating away from Intel. Apple is making their own chip. AMD is destroying them. In fact Intel's next gen chip got delayed till 2022. I'm not sure if you are even paying attention to what's going on if you claim to work in the field. \n\n5g i can buy that but that's not gonna play out for years. People aren't pumped about 5g like they are with Tesla's master plan. \n\nIf you are long on Intel it might work out but NEVER expect good things to happen because a company beats earnings. I've seen it time and time again that smart money will run up a stock pre-earnings and then sell off. \n\nAlso I'd be willing to bet the gaming sector doesn't even show up on any of their radar at Intel. Cloud right now is what's pushing chip makers. \n\nHere's homework that I'd find interesting. Find all the AWS re:invent blog posts where they announce new instance types. See if there is a bump in AMD or Intel based on that. I'd be willing to bet there is better correlation there then ER",
        "created_utc": 1595648301,
        "id": "fz5wjqe",
        "permalink": "/r/investing/comments/hxf6ud/intel_down_15_is_not_logical/fz5wjqe/",
        "score": 4,
        "subreddit": "investing",
        "created": 1595677101.0
    },
    {
        "author": "gamers542",
        "body": "I'm expecting teams to see a jump. It seems like if you aren't using Zoom or Cisco Webex, then Teams has taken over as most companies' 3rd option.",
        "created_utc": 1595422404,
        "id": "fyv8ovp",
        "permalink": "/r/investing/comments/hvs0jj/earning_day_is_already_today_tesla_tsla_and/fyv8ovp/",
        "score": 4,
        "subreddit": "investing",
        "created": 1595451204.0
    },
    {
        "author": "SaucePodtrash",
        "body": "MSFT attracts a lot of old nerd talent that isn’t into working for millennial or hipster companies. Cisco, HP, IBM have experienced highly intelligent adults working for them.",
        "created_utc": 1595320456,
        "id": "fyqxjs8",
        "permalink": "/r/wallstreetbets/comments/husn8s/what_are_your_moves_tomorrow_july_21_2020/fyqxjs8/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1595349256.0
    },
    {
        "author": "Sayter",
        "body": "most sectors red. AMZN AAPL MSFT GOOGLE WMT COST NVDA AMD CSCO are keeping us up or we'll be pulled to 313.",
        "created_utc": 1594320641,
        "id": "fxg8c0n",
        "permalink": "/r/wallstreetbets/comments/ho0krw/daily_discussion_thread_for_july_09_2020/fxg8c0n/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1594349441.0
    },
    {
        "author": "Pleather_Boots",
        "body": "I think (IMO) we may be in a “melt up” or mini bubble now that could result in a pullback but not a crash like 2000. \n\nMy main painful memory of 2000 was buying Cisco, a solid tech, watching it go up 10x in a few months. Being jubilant at my investing skills. And watching it drop down to where it started. \n\nWe’re not seeing run ups like that across the market. Some are getting close but most not nearly that high. \n\nI’ve sold off a little of my holdings as they reach all time highs because I don’t want to have another case of 20 year regret as I did with Cisco.",
        "created_utc": 1594231663,
        "id": "fxc51ic",
        "permalink": "/r/investing/comments/hnhmon/at_the_time_im_writing_this_nvidia_24793b_is/fxc51ic/",
        "score": 4,
        "subreddit": "investing",
        "created": 1594260463.0
    },
    {
        "author": "haasvacado",
        "body": "I’ve played 4 or 5 stocks like a fiddle this week but I have no vibe for tomorrow. Sold off everything. See you guys next week.\n\nEdit:\nCSCO\nHPQ\nKO\nDBX",
        "created_utc": 1596129005,
        "id": "fzqx0dt",
        "permalink": "/r/wallstreetbets/comments/i0ji8h/daily_discussion_thread_for_july_30_2020/fzqx0dt/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596157805.0
    },
    {
        "author": "SageOfSixCabbages",
        "body": "Second this. They're working with Cisco and their software is more on the contact tracing of COVID.",
        "created_utc": 1594944636,
        "id": "fyb5hs9",
        "permalink": "/r/pennystocks/comments/hsli5h/missed_out_on_boxl_dont_want_to_chase_hmhc_phun/fyb5hs9/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1594973436.0
    },
    {
        "author": "NerdBlender",
        "body": "I’m sorry, but how exactly do they have a back door? \n\nYou obviously don’t understand how networks work. It’s absolutely no more risk using Huawei than using Cisco, Nokia, Ericsson or anyone else.\n\nNetwork providers build security around devices and can see exactly how much data is being sent where, if a copy of data was being funnelled to China, or if someone was attempting unauthorised access to equipment you would be damn sure they would know about it.\n\nIf we were saying we are not using Huawei because of China and their human rights records or their censorship, then fine. But we are doing this because the US say so. \n\nI have never seen a scrap of evidence that says Huawei are any less secure than any other network hardware vendor. If there was, don’t you think their competition and the security services would be shouting it from the rooftops, but they are not. \n\nThis is not a national security issue, this is a trade issue.",
        "created_utc": 1594798098,
        "id": "fy4fkzj",
        "permalink": "/r/investing/comments/hr2y6z/boris_johnson_moves_to_ban_huawei_in_the_uk_by/fy4fkzj/",
        "score": 4,
        "subreddit": "investing",
        "created": 1594826898.0
    },
    {
        "author": "realmastodon2",
        "body": "\\&gt;cisco\n\nI always mistakenly think Oracle owns them.",
        "created_utc": 1595481989,
        "id": "fyyb2qm",
        "permalink": "/r/investing/comments/hw1jny/tesla_reports_4th_straight_quarter_of_profits/fyyb2qm/",
        "score": 4,
        "subreddit": "investing",
        "created": 1595510789.0
    },
    {
        "author": "Coyote-Thunder",
        "body": "Some of their investors include: Cisco, Samsung, and WWE. BAH GOD THATS KANE'S MUSIC!",
        "created_utc": 1595004814,
        "id": "fydjlo3",
        "permalink": "/r/pennystocks/comments/hsz2u6/phun_and_information_to_consider_mini_dd/fydjlo3/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1595033614.0
    },
    {
        "author": "strolls",
        "body": "The top item on his list of unsustainable valuations is Cisco.\n\nLook at the date, and then look at [Cisco's chart.](https://i.imgur.com/o5KnpYr.png)\n\nThis article was written at the peak of the dot-com boom, and he appears to have called it.\n\nI'm not convinced the article is alarmingly appropriate today - I'd need clarification on that.",
        "created_utc": 1595223080,
        "id": "fymrzlz",
        "permalink": "/r/SecurityAnalysis/comments/huam4v/bigcap_tech_stocks_are_a_sucker_bet_jeremy_siegel/fymrzlz/",
        "score": 4,
        "subreddit": "SecurityAnalysis",
        "created": 1595251880.0
    },
    {
        "author": "ElephantSquad",
        "body": "Puts on CISCO after this abomination of a webex showing\n\nTheir tech is as slow and old as these congressmen",
        "created_utc": 1596046431,
        "id": "fzn7cnx",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzn7cnx/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1596075231.0
    },
    {
        "author": "foobargoop",
        "body": "Apple account was hacked on twitter, too. \n\nhttps://www.macrumors.com/2020/07/15/apple-twitter-account-hacked/\n\nOther hacked accounts: (*reportedly)\n\n* Microsoft\n* Cisco\n* Juniper\n* Oracle\n* Zoom\n* Citrix\n* CAP\n* F5\n* Intel\n* Adobe\n* Jenkins\n* NVIDIA\n* Apache\n* Chrome\n* Android\n* VMware\n* Siemens\n* Rust Lang Crates\n* Go Programming",
        "created_utc": 1594847987,
        "id": "fy6qbkr",
        "permalink": "/r/wallstreetbets/comments/hruzcj/what_are_your_moves_tomorrow_july_16_2020/fy6qbkr/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594876787.0
    },
    {
        "author": "varun22486",
        "body": "Did you checked the graph today? Ran from 1.34 to 1.49. The partnership with CISCO is the beginning, as they sign up high school and college more PR’s to come.",
        "created_utc": 1594950312,
        "id": "fybf17n",
        "permalink": "/r/pennystocks/comments/hsli5h/missed_out_on_boxl_dont_want_to_chase_hmhc_phun/fybf17n/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1594979112.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "From 91 to very early 2000 CSCO had 9 splits.  There have been no splits in the past 20 years.   It might be hard to understand or believe the actual losses tech investors have had over the past 20 years but they are they if you care to look.\nhttps://www.splithistory.com/csco/#:~:text=Cisco%20Systems%20%28CSCO%29%20has%209%20splits%20in%20our,became%20a%202000%20share%20position%20following%20the%20split.",
        "created_utc": 1595187362,
        "id": "fyl55i8",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fyl55i8/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595216162.0
    },
    {
        "author": "noobowheeler",
        "body": "calls on cisco?",
        "created_utc": 1596044676,
        "id": "fzn3qme",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzn3qme/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596073476.0
    },
    {
        "author": "blackout94bby",
        "body": "Verizon bought Bluejeans. \n\nCisco WebEx sucks but many corporations still use it. \n\nMicrosoft Teams will gain market share. Skype was awful, so some image/branding fixing is needed. \n\nGoogle has Hangouts \n\nI think this market is going to be pretty competitive, and I don't see Zoom living up to the expectations that are priced into the stock. I thought it was overpriced at $125 lol",
        "created_utc": 1595569281,
        "id": "fz2afem",
        "permalink": "/r/stocks/comments/hwryff/do_you_think_facebooks_new_feature_will_really/fz2afem/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595598081.0
    },
    {
        "author": "MementoMori97",
        "body": "My advice:\n\n1) Index funds are a great way to mitigate some risk from just holding singular companies. Personally I hold my entire Roth in mutual funds (some index and some actively managed) and 1/3 of my individual account in index funds.\n\n2) Look into a Roth IRA if you plan to hold long term. (For tax purposes). Dividends cause taxable events and are taxed as income, a Roth lets your money grow tax free but you can't take out more than what you originally put in without penalties.\n\n3) Personally I hate the idea of partial shares of stocks/etfs. I'd rather just save up a bit more and buy a full share, but thats just my preference.\n\nAs for dividend stocks: CSCO, T, KO, etc. There are many classic dividend stocks you can find on the internet.",
        "created_utc": 1593629812,
        "id": "fwm1ywy",
        "permalink": "/r/stocks/comments/hjgfi8/looking_for_recommendations_strategies_and/fwm1ywy/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1593658612.0
    },
    {
        "author": "LuxGang",
        "body": "There's mountains of data that show most people (including professionals who do it for a living) don't beat the market consistently over the long term. If it was so easy to trim the fat, everyone would do it and there would be no market to beat.\n\nThe fact that most people lose to the market over the long term is undeniable proof that you will at some point make a mistake, have an emotional reaction, buy too high, or sell too early, and you will lose to the market.\n\nEveryone used to think CSCO, XOM, and T were the future and nothing would stop them. Look where we are now. \n\nAnd before you say \"BuT tHeSe TeCh CoMpAnIeS aRe DiFfErEnT!\" I suggest looking at anti-trust cases of the past, and how those are likely to return with the amount of power these FANG stocks command.",
        "created_utc": 1596148436,
        "id": "fzsrcti",
        "permalink": "/r/stocks/comments/i0qzss/why_etfs/fzsrcti/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1596177236.0
    },
    {
        "author": "Astronaut100",
        "body": "I wouldn't touch bank stocks. They have been and will continue to be a yield trap. Interest rates aren't going up till at least 2022. Stocks like T, VZ, IBM, and CSCO are better yield plays. At least, they have some potential to grow.",
        "created_utc": 1594155482,
        "id": "fx8tuev",
        "permalink": "/r/stocks/comments/hmyrip/today_i_sold_the_last_of_my_nvda_shares_its_been/fx8tuev/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594184282.0
    },
    {
        "author": "also_roses",
        "body": "TSM 7/31 $70c\nPTON 7/31 $85c\nSNAP 7/31 $30c\nCSCO 7/31 $50c \n\nAnd some fuck it TLRD 8/22 $1c",
        "created_utc": 1594437598,
        "id": "fxlmgae",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxlmgae/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594466398.0
    },
    {
        "author": "AnAnonymousFool",
        "body": "Every stock you mentioned is down 25-40% over the last 5 years. Dividends are great, but you'd have made way more by putting your money into basically any top tech stock\n\nThat 13% that GLV pays out is annualized. Per month, they pay out roughly 1%. So essentially you get ~20% total growth over a 5 year period if you account for the decrease in stock price and the lower dividends you get throughout the last 5 years. Compare that to MSFT which is up 340% not including their small 1% dividend. or TSLA which is up 450% over the last 5 years. Or even a less hyped tech stock like Cisco is up 63% in the last 5 years. Or look at some more crazy stocks like Shopify which is up over **2000%** over the last 5 years. Yes you read that right\n\nDividend stocks are nice to diversify and get some consistent income, but it doesn't have anywhere near the upside that stocks have. To make a livable wage on dividend stocks, you'd have to have somewhere close to a $1M portfolio that is 100% invested into dividend stocks and that would return you like $60k if youre lucky before taxes\n\nEdit: I see I'm getting down votes, so maybe people just hate the tech stock hype, so ill look at other industries. O'Reily Autoparts is up 80% over the past 5 years. McDonalds is up 95% over the last 5 years. The list goes on\n\nSure there are also some very negative stocks, but dividend stocks will NEVER have the same growth opportunity that a regular stock has",
        "created_utc": 1594945837,
        "id": "fyb7jio",
        "permalink": "/r/stocks/comments/hshm8r/cef_with_monthly_dividends_what_am_i_missing/fyb7jio/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594974637.0
    },
    {
        "author": "IDidntTellYouThat",
        "body": "True... but have you looked up the cost of the Cisco hardware? It's like \"buy Cisco products if you hate money!\"",
        "created_utc": 1594841862,
        "id": "fy6dkya",
        "permalink": "/r/wallstreetbets/comments/hroitj/zoom_is_doomed_bears_chasing_them_off_campus/fy6dkya/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594870662.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "As another commenter said Cisco the darling and backbone of the internet was at $77/share in March of 2000.  20 years later it is at $45 and spent most of the intervening years in the teens.  So anybody that thinks their paltry 5-10 year time horizon is gonna help is whistling Dixie.  And this is a huge still massively successful company as opposed to a company with no products, no or little earnings and an illusory future.\n\nBut I certainly understand as I was young and stupid once myself and bought some of the NASDAQ crap at way too high a price.",
        "created_utc": 1594247166,
        "id": "fxd1j4c",
        "permalink": "/r/stocks/comments/hnpucr/stocks_only_go_up_problems/fxd1j4c/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1594275966.0
    },
    {
        "author": "geooooorge",
        "body": "They're using Webex... Calls on CSCO ???",
        "created_utc": 1596044815,
        "id": "fzn415f",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzn415f/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1596073615.0
    },
    {
        "author": "power_of_sun",
        "body": "Hold CSCO???",
        "created_utc": 1594323348,
        "id": "fxge11e",
        "permalink": "/r/wallstreetbets/comments/ho0krw/daily_discussion_thread_for_july_09_2020/fxge11e/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594352148.0
    },
    {
        "author": "RainbowSexPants",
        "body": "WebEx is doggy shit, that's why the man that created it left Cisco and created Zoom.",
        "created_utc": 1594511918,
        "id": "fxrvwed",
        "permalink": "/r/investing/comments/hpd6ve/are_we_really_in_a_tech_bubble/fxrvwed/",
        "score": 3,
        "subreddit": "investing",
        "created": 1594540718.0
    },
    {
        "author": "its_me_poida",
        "body": "Going deep long on WORK, CSCO, GSK, SNE, NEP, NEM - abandoning cash gang going to activate my buying power.",
        "created_utc": 1594622963,
        "id": "fxwnqc3",
        "permalink": "/r/wallstreetbets/comments/hq11ao/what_are_your_moves_tomorrow_july_13_2020/fxwnqc3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1594651763.0
    },
    {
        "author": "bkorsedal",
        "body": "Burn baby burn!  Cisco Inferno!  Burn baby burn!  Burn that mother fucker down!",
        "created_utc": 1595562562,
        "id": "fz20hkd",
        "permalink": "/r/wallstreetbets/comments/hwqql8/pride_yield_curve_inverted_then_red_day_today/fz20hkd/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1595591362.0
    },
    {
        "author": "Vast_Cricket",
        "body": "I think CSCO stock split occuring every 6 months.",
        "created_utc": 1595186939,
        "id": "fyl4deg",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fyl4deg/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1595215739.0
    },
    {
        "author": "baycommuter",
        "body": "That's why you diversify. I owned CSCO, GE and AAPL 20 years ago. If I never sold any of them, I'd still have more money just because of AAPL. I'm never going to sell a company I believe in just because of valuation again. Obviously, if the company loses its way it's time to sell.",
        "created_utc": 1594881342,
        "id": "fy8923u",
        "permalink": "/r/investing/comments/hrwe84/warren_buffet_if_i_had_never_sold_a_stock_i_would/fy8923u/",
        "score": 2,
        "subreddit": "investing",
        "created": 1594910142.0
    },
    {
        "author": "trashcantambourine",
        "body": "When will people realize cisco is the superior video conferencing app? Like I know I have leaps but I didn't want to actually keep them forever.",
        "created_utc": 1594915673,
        "id": "fy9jfl6",
        "permalink": "/r/wallstreetbets/comments/hs70w1/daily_discussion_thread_for_july_16_2020/fy9jfl6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594944473.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "Three year restricted ISOs.  Nowadays it is generally non quals.  Cisco had a director level that was between VP and Sr VP and they got 50,000 ISOs a quarter.  So in 2000 each quarter they were exercising 50,000 shares with about $40-50/sh in the money.   One of the smartest men I met instructed his advisor to exercise all the shares each quarter and diversify every penny outside of tech.  I mean over 3 years you have ISOs on 200,000 shares of CSCO/year or 600,000 total waiting for restrictions to be removed why would you keep them or even keep the money invested in the tech space.  But most did.  Most of the folks that would not diversify and kept their shares after exercising were more engineer or manager level types.  They had rosier ideas of what would happen to tech going forward.",
        "created_utc": 1595200806,
        "id": "fyltm1w",
        "permalink": "/r/stocks/comments/hu5t3x/tech_dip_aftermath_some_stocks_to_watch/fyltm1w/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595229606.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "I can't tell the future but I can tell the past.   In 2000 Cisco was the giant of the internet and the internet was the giant of tech stocks.  Every employee at Cisco was rich because they all got stock options (yes, including the janitors in those days) and the stock price had climbed from $10 in 98 to $33 in 99 and $79/sh in 2000.  They did then sell and still do sell routers that were the backbone of the internet and CSCO was everyone's tech darling.  I can't tell you how many Cisco employees had told me in spring of 2000 that they were not going to diversify until CSCO hit $100/sh.  In Sept of 2001, their share price had dropped to $12/share.  They still were the backbone of the internet but the internet and tech were no longer the darling of the Market.  In Feb of 2009 they were at $14/sh and are today at $48/sh.   So they today as an ongoing company still doing what it did and with a strong balance sheet are trading at roughly 2/3rds the price they were 20 years ago.   That is what can happen to a really good tech company.\n\nBTW, CSCO is not the only one.  Intel was at $74.88 in the fall of 2000 and is at $60/sh now and was running around in the $20's for most of the past 20 years.  Still a great company doing great things.\n\nMicrosoft, one of today's tech darlings, was $50/sh in early 2000.  It wandered around $25/share for 15 years until it again hit $50/sh in fall of 2015, fifteen long years later.  The last 5 years have been good for it but will it stay at $200/sh?",
        "created_utc": 1595124547,
        "id": "fyir9mc",
        "permalink": "/r/stocks/comments/htpzw0/if_the_market_crashes_what_would_happen_to_the_5/fyir9mc/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595153347.0
    },
    {
        "author": "Redditor45643335",
        "body": "Yes, they use tech created by other companies... They use Windows or linux operating systems, they use visa and mastercard, they use cisco routers etc etc. \n\nThe principles of a bank is still the same, 4 walls and a roof, deposit money, withdraw money, get charged interest for loans and late payments. \n\nNothing has changed and nothing will change in the next 50 years. Technology is the only industry that actually requires it to evolve to survive... This is what drives innovation, which drives new products which drives profits.",
        "created_utc": 1594335629,
        "id": "fxh2wtq",
        "permalink": "/r/investing/comments/hnz66z/stock_valuations_compared_to_the_past/fxh2wtq/",
        "score": 2,
        "subreddit": "investing",
        "created": 1594364429.0
    },
    {
        "author": "gypsyphotos",
        "body": "You could say NVDA is leading the charge. Since Covid low in March its up 114% in 5 months. Cisco during that time was up 150% annual and they never recovered.",
        "created_utc": 1594327793,
        "id": "fxgnckc",
        "permalink": "/r/investing/comments/hoacmm/the_obvious_tech_bubble/fxgnckc/",
        "score": 2,
        "subreddit": "investing",
        "created": 1594356593.0
    },
    {
        "author": "CanYouPleaseChill",
        "body": "We’re in a tech bubble now as we were then. Lots of hype for companies with negative operating income. Due diligence consists of pleasant stories and absolutely no mention of cash flows or competition anywhere. Mocking of value investors abounds and people really think tech is the only sector worth owning.\n\nBack in the late 90s, you had profitable companies like Cisco and Microsoft too. The only issue was that they were significantly overvalued, which is why they underperformed for over a decade. Cisco still hasn’t returned to its old peak despite significant earnings growth. If anybody thinks Amazon or Netflix are reasonably priced today, they’re dreaming. Apple certainly isn’t cheap either. Neither are NVDA, ADBE, TTD, etc. As for Facebook and Google, they  benefited a lot from the wretched excess of VC-funded startups spending money like sailors, and that is simply unsustainable.",
        "created_utc": 1594246380,
        "id": "fxczz6l",
        "permalink": "/r/stocks/comments/hnpucr/stocks_only_go_up_problems/fxczz6l/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594275180.0
    },
    {
        "author": "AppleTree98",
        "body": "Look at Cisco for a possible picture. They were the darling of Silicon valley. Made a ton of paper millionaires. Cisco is still on top of the world but look at the stock history. Still hasn't hit the high from 2000 Cisco Systems, Inc.\nNASDAQ: CSCO",
        "created_utc": 1594436167,
        "id": "fxlkagt",
        "permalink": "/r/StockMarket/comments/hou1kq/nflx_is_trading_above_550_now/fxlkagt/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1594464967.0
    },
    {
        "author": "urvik08",
        "body": "Puts on Cisco if the meeting is gonna last more than an hour. Matter of time before WebEx shits bed.",
        "created_utc": 1596044819,
        "id": "fzn41e4",
        "permalink": "/r/wallstreetbets/comments/hzy6my/daily_discussion_thread_for_july_29_2020/fzn41e4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596073619.0
    },
    {
        "author": "robotlasagna",
        "body": "Graham also discusses growth/hype stocks. Many market participants believe today that we are at a paradigm shift where growth/tech is the new way of investing and value is antiquated but he relates that several times in the last 100 years investors believed that hype stocks decoupled from fundamentals were the way forward and it always inevitably ended. \n\nHe’s relates that the common reasoning is that “well investing in high PE growth stocks just works” and it does for some time period (growth has had a great run for many years) but inevitably they will couple back to fundamentals typically when the company starts to mature.\n\nRemember that back in 2000 CIsco was the darling super growth/tech stock and people talked about it just as they do apple or tesla or Netflix today. With Cisco the company was not mismanaged or anything like that: they simply ran out of growth and when the market finally figured that out the price crashed to the point where it still hasn’t recovers today. Meanwhile CIsco still runs today as a well run concern. Now it’s just valued correctly.",
        "created_utc": 1595602304,
        "id": "fz3g5eb",
        "permalink": "/r/StockMarket/comments/hwkond/every_single_stock_purchase_ive_made_this_year/fz3g5eb/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1595631104.0
    },
    {
        "author": "MementoMori97",
        "body": "I personally love CSCO and have over 10% of my brokerage account in it (not total of all my investments, only my taxable account). But I think this was announced a year ago if I'm not mistaken? I think it has to be at least mostly priced in by now.",
        "created_utc": 1595603255,
        "id": "fz3i12s",
        "permalink": "/r/stocks/comments/hx2zrz/cscoacia_merger/fz3i12s/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595632055.0
    },
    {
        "author": "NYC25470",
        "body": "https://finance.yahoo.com/news/cisco-systems-acacia-communications-status-123000553.html",
        "created_utc": 1595515137,
        "id": "fyzf5l3",
        "permalink": "/r/wallstreetbets/comments/hwd4xj/daily_discussion_thread_for_july_23_2020/fyzf5l3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595543937.0
    },
    {
        "author": "cdog2215",
        "body": "\" When the bubble burst, even a blue Chip like Cisco lost 90% of its value. \"\n\nI don't see the 90% again, but wait until the corporate layoffs start.  Intel will be a layoff machine early next year, the airlines, many small businesses/restaurants will permanently shutter... whooo boy.",
        "created_utc": 1595791662,
        "id": "fzbwkiu",
        "permalink": "/r/wallstreetbets/comments/hx90gx/weekend_discussion_thread_for_the_weekend_of_july/fzbwkiu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595820462.0
    },
    {
        "author": "haasvacado",
        "body": "Fuck I guessed right yesterday, boys!\n\nHPQ 17.5p 7/31\nCSCO 47p 7/31\nDBX 22c 7/31\n\nI’m a very stable genius.",
        "created_utc": 1595945952,
        "id": "fzij5u5",
        "permalink": "/r/wallstreetbets/comments/hzc3ko/daily_discussion_thread_for_july_28_2020/fzij5u5/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595974752.0
    },
    {
        "author": "diddycorp",
        "body": "Don’t forget Cisco lol",
        "created_utc": 1595738570,
        "id": "fz9u77o",
        "permalink": "/r/wallstreetbets/comments/hx90gx/weekend_discussion_thread_for_the_weekend_of_july/fz9u77o/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595767370.0
    },
    {
        "author": "robotlasagna",
        "body": "&gt; I guess it's good downside protection for someone who is really risk averse with a short time horizon. For me, I have 20-30 years, I'll stick with my long-term disruptors and growth plays.\n\nSee that's the wrong thinking; BRK is for being risk averse over \\*long time horizons\\*. e.g Facebook right now is kicking ass but so was AOL or Cisco back in the 1990's. It is entirely feasible that FB could see such a decline over 20 years. Tech moves fast and grows fast but it also declines fast and there's always the the next thing gunning for top position.\n\nWhen you buy BRK you are buying a company that is run rationally enough that you can be sure it will still be around and profitable in 30 years time. You cant say that with any of the tech/growth companies. You should still IMO be in growth stocks as well but understand growth investing will have its lean years and when it does BRK is how you preserve your wealth and also still generate returns.",
        "created_utc": 1596221489,
        "id": "fzwddlc",
        "permalink": "/r/stocks/comments/i195ah/brkb_whats_your_take/fzwddlc/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596250289.0
    },
    {
        "author": "rawj5561",
        "body": "Check out this DD:   \nI got CSCO calls because ZM is being investigated by the US B)   \nPretty big brain move, amiright?",
        "created_utc": 1596148136,
        "id": "fzsqqmv",
        "permalink": "/r/wallstreetbets/comments/i0t4tc/what_are_your_moves_tomorrow_july_31_2020/fzsqqmv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596176936.0
    },
    {
        "author": "LittleTragik",
        "body": "Alright gents, let me tell you about a stock called CSCO. Earnings in a week and a half. Work in IT as a network engineer and they are going to kill it this quarter.",
        "created_utc": 1596125133,
        "id": "fzqov88",
        "permalink": "/r/wallstreetbets/comments/i0ji8h/daily_discussion_thread_for_july_30_2020/fzqov88/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1596153933.0
    },
    {
        "author": "brintoul",
        "body": "At the time you couldn't find a SINGLE analyst that didn't rate CSCO a strong buy.  Reminds me of AMZN.",
        "created_utc": 1595283637,
        "id": "fypeurw",
        "permalink": "/r/SecurityAnalysis/comments/huam4v/bigcap_tech_stocks_are_a_sucker_bet_jeremy_siegel/fypeurw/",
        "score": 2,
        "subreddit": "SecurityAnalysis",
        "created": 1595312437.0
    },
    {
        "author": "johnhammondsexpenses",
        "body": "Cisco never returned to its Dotcom level highs to date, so its possible to be a solid company and previously have been in bubble that should be stayed away from.",
        "created_utc": 1594089423,
        "id": "fx5zyv0",
        "permalink": "/r/StockMarket/comments/hk0q73/its_teslas_world_and_everyone_else_is_paying_rent/fx5zyv0/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1594118223.0
    },
    {
        "author": "LSatou",
        "body": "Here's a few sector ETFs I'm a big fan of:\n\nPAWZ (IDXX, FRPT, ZTS, CHWY) \n\nWCLD (FSLY, DOCU, ZM, SHOP, etc)\n\nHACK (CSCO, PANW, NET, SPLK)\n\nFTXL (SWKS, TER, NVDA, INTC, MRVL etc)",
        "created_utc": 1594948427,
        "id": "fybbwfo",
        "permalink": "/r/stocks/comments/hslujk/etfs/fybbwfo/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594977227.0
    },
    {
        "author": "RetardStrength-",
        "body": "Pays to own some dividend payers in the portfolio for sideways market. On top of all the growth plays I made in March I also picked up Extra Space Storage, Cisco, Banks, and Philip Morris. If the growth plays slow down I can fall back on dividends. Gotta love portfolio strategy... fun times",
        "created_utc": 1594962356,
        "id": "fybxaj3",
        "permalink": "/r/wallstreetbets/comments/hsha5a/what_are_your_moves_tomorrow_july_17_2020/fybxaj3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594991156.0
    },
    {
        "author": "lm2bofbb",
        "body": "I'm just a random dude on the internet and I don't think I know a lot more than you do, but overall I like it. \n\nTo be completely honest though, if you asked someone 20 years ago what should be in their buy and hold forever portfolio they'd've said companies like Cisco, eBay and Yahoo, and have no clue why you're talking about some company named after a river in South America. They'd also laugh you out the room for suggesting Apple. Thus, I'd probably avoid most tech companies outside of Microsoft for 'hold forever,' as it has a platform, which is much more difficult to overtake.\n\n  \nI'd also maybe shy away from McDonald's. I think most younger Americans don't like it as much as some newer competitors from various aspects; Chick-Fil-A for people looking for something cheap and Five Guys and Shake Shack for people who are willing to shell out the extra few bucks for a better quality burger.",
        "created_utc": 1594997483,
        "id": "fyd4qrl",
        "permalink": "/r/investing/comments/hslmcw/my_buy_and_hold_forever_portfolio/fyd4qrl/",
        "score": 2,
        "subreddit": "investing",
        "created": 1595026283.0
    },
    {
        "author": "9090990",
        "body": "Anyone see the EV to sales ratio on SHOP and how it is higher than Cisco was in the dot com boom? I know I’m gonna get burnt but it’s so tempting to short.",
        "created_utc": 1594501852,
        "id": "fxr2hfc",
        "permalink": "/r/wallstreetbets/comments/how5ir/weekend_discussion_thread_for_the_weekend_of_july/fxr2hfc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594530652.0
    },
    {
        "author": "Kainint",
        "body": "Real shit.\n\nHere's my positions currently:\n\nFor 7/17:  \nTWTR 38c  \nNIO 17c  \nSNAP 29c  \nMSFT 225c  \nUPWK 20c (meme stock from front page, but it was super cheap so 🤷)\n  \nFor 8/21:  \nCSCO 60c  \n\n\n  \nTwitter in particular has been very resistant to drops recently (barring today, but everything ate the drops today), and Cisco seems like a shoe-in with the massive rollout of new network infrastructures impacting earnings and consistent growth.",
        "created_utc": 1594328782,
        "id": "fxgpduv",
        "permalink": "/r/wallstreetbets/comments/hoa9dp/what_are_your_moves_tomorrow_july_10_2020/fxgpduv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594357582.0
    },
    {
        "author": "dum_townerino",
        "body": "Google Meet as well. AND WebEx (Cisco)\n\nZM is fuk once people wake up",
        "created_utc": 1594342545,
        "id": "fxhf4ky",
        "permalink": "/r/wallstreetbets/comments/hoa9dp/what_are_your_moves_tomorrow_july_10_2020/fxhf4ky/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594371345.0
    },
    {
        "author": "roaf",
        "body": "I work as a autist in this space and have been for the last 10 years. I can tell you after working for 5 different companies in the last decade and doing Cisco to MSFT, MSFT to Cisco and running POCs for all of them no one is as close as MSFT is right now. \n\nTeams is just an entry point. Hardware right now is almost irrelevant as all businesses are moving parts of their business to permanent WFH if they have not already.\n\nCisco/Slack/Zoom/your mom doesn't have Power Apps/Power Automate/PowerBI and the connector sources to MS Teams that Microsoft does. \n\nIt isn't just about the audio and video companies want, they want to automate all the entry level jobs that were onsite or just menial. \n\nTelling you guys I am not that smart. I was getting close to good money and to leave one job before COVID it took me 1.5 years to get the same money. Since COVID hit it took me 3 weeks to change to my current position with an increase.",
        "created_utc": 1594836504,
        "id": "fy626j7",
        "permalink": "/r/wallstreetbets/comments/hroitj/zoom_is_doomed_bears_chasing_them_off_campus/fy626j7/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594865304.0
    },
    {
        "author": "feelinggoodabouthood",
        "body": "Ask those who didn't sell csco in 2000, and bought more on the dip.",
        "created_utc": 1595482040,
        "id": "fyyb50b",
        "permalink": "/r/StockMarket/comments/hw9a31/why_do_people_sell_stocks/fyyb50b/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1595510840.0
    },
    {
        "author": "ryit29",
        "body": "Who the heck buys value tech stocks like Cisco. If the tech bubble bursts, tech value stocks will crash more than tech growth stocks lol",
        "created_utc": 1595165303,
        "id": "fyk1i55",
        "permalink": "/r/wallstreetbets/comments/ht2v2k/weekend_discussion_thread_for_the_weekend_of_july/fyk1i55/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1595194103.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"Wow. These are great insights. Thank you so much! \"\n\nNo problem.\n\n\" I just thought that all ETFs helped mitigate most risk, but that’s not always the case.\"\n\nNope. There are very few actively managed funds that really do attempt to sidestep downturns to some degree and fewer that have a decent track record doing it. One is little-known mutual fund Provident Trust (PROVX, https://www.mutualfundobserver.com/2018/12/provident-trust-strategy-fund-provx/, \"Investors remember that this period includes the 2007-09 financial crisis. What they may not know is that in 2008, the fund lost 21.0% compared to the S&amp;P 500’s 37.0% decline. That ranked the fund in the 1st percentile.\n\nWhile paralyzed investors and central banks struggled, the fund held between 61% in cash and fixed income instruments at the end of ’08 and 70% at the market bottom in March ’09. That positioning dramatically reduced the fund’s losses compared to the market, while giving it ample “dry powder” for the gains that followed. During Provident’s tenure as portfolio manager to September 30, 2018, PROVX gained +389% cumulatively with a 79.8% average month-end allocation to equities vs. +348% for the always fully invested S&amp;P 500.\")\n\nSo that's an example of a fund where managers will start to move to the sideline if they think it's prudent to do so. Not entirely - you're still going to lose some money - just probably not as much as the market in a downturn. \n\nIf it's a bad year most funds are going to have a bad year and the letter will be basically, \"Hey, sorry it was a bad year.\"\n\nStock index funds are going to go down in a downturn whatever the index does.\n\n\"I remember seeing a video interview of this analyst on Robinhood who said that the tech bubble right now is bigger than the dot com bubble was in the 2000s.\"\n\nI don't think this is the dot com bubble again. I do think that after the bottom in March, you saw a widening of the gap between the performance of the market and the performance of certain growth themes that were either less impacted by this or benefited from it. E-commerce, digital payments, cloud, software, telehealth and the \"stay at home\" names (Peloton, Netflix, etc.) Even the \"buy a home online\" names, as things like Zillow finally started to seem to have a sustained gain for once as people are now apparently comfortable buying houses virtually. People basically ran towards what they thought benefited today and I think what many people thought the future is going to look like post-crisis. I think what's been very frustrating on this sub this year has been this focus on the negative, when I think a compelling topic really is, what are the themes post-crisis that will be big? How does the world change in the next 3-5 years? **I think what's done extraordinarily well this year is in part due to the result of people asking themselves that question and investing accordingly.** The ARKW and ARKF have themes listed on the main pages for those funds and you look at those themes and those have absolutely been the places to be this year.\n\nIn the short-term, I have a hard time believing that the correct answer to concerning statistics will continue to be \"just buy more growth (Zoom, etc) stocks.\" At some point that will either stop working and broad market pullback or there will be a solution to this crisis and when that happens you're going to see a considerable rotation out of the Ark-style growth stocks and into impacted names that have lagged, but I think that is going to be buying opportunity for growth. \n\nYou've saw this sort of \"tale of two markets\" again on Thursday and Friday of last week: Thursday the Dow was down 300 but growth stocks were ramping. There was the Gilead news on Friday and the Dow was up 300 but many of the growth stocks were down.\n\nMuch of my own portfolio is similarly aggressive growth to Ark or Scottish Mortgage and I would not be surprised if at some point in the near-term much of my portfolio lost 20% in a hurry. The problem is when: I thought there was going to be a pullback in May - didn't happen. I have a long-term view on what I own so I may trim a little here, add a little there at times but happy not doing much of anything for long stretches. Additionally, I'm not a major market timer or do I have any desire to be. But after a really fantastic first half of the year, I really don't think that I'm going to have a repeat of that kind of performance in the back half of the year and I'm sitting here fully expecting a considerable pullback. If I manage to get through the second half of the year without a considerable pullback in my portfolio, I will be 1) stunned and 2) have to question whether this time is actually somehow different. I've said recently that I did a lot in March and April and then have since gone back to doing not much and am happy with long stretches of doing little-to-nothing. I'm okay with investing in aggressive growth stocks, but where I'm increasingly cautious is where/how much I add to things. \n\nBut, long story short, I think there are compelling long-term growth themes and growth may continue up for a while, but it is overextended and a considerable correction at some point in the relatively near-term would be so not surprising that it would be pretty remarkable imo if it didn't happen. Broadly, if you're not risk tolerant (and there's nothing wrong with that), then the ARK funds would not be something I'd recommend (great when things are fantastic for growth, going to be rough when it's not - they've had an amazing year, but people have to be cognizant of things capable of having those kinds of gains in that short a time period are also capable of going the wrong direction just as swiftly, if not swifter) or at the most would be a *tiny* bit to have exposure to some themes long-term - but I'd be particularly cautious about where you bought them.",
        "created_utc": 1594552724,
        "id": "fxtiqod",
        "permalink": "/r/investing/comments/hmtd5f/daily_advice_thread_all_basic_help_or_advice/fxtiqod/",
        "score": 2,
        "subreddit": "investing",
        "created": 1594581524.0
    },
    {
        "author": "thunder89",
        "body": "From what I've read (bc I'm not an \"experienced\" trader) that can happen with any level of experience. It's just good to be cognizant of it.\n\nAlso, check out gambler's fallacy while we're on the topic",
        "created_utc": 1594335774,
        "id": "fxh36mn",
        "permalink": "/r/pennystocks/comments/hocmv8/awh_dd/fxh36mn/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1594364574.0
    },
    {
        "author": "mewtrader",
        "body": "I'd naturally agree that it seems rather uncaring, but not knowing him or much about him, I don't reduce him to a rapacious individual, perhaps I could be informed of such, but he could simply be unaware, uninvolved, and indifferent. This is likely more a function of personality that's not directly tied to greed but results in a nonaction that is then perceived as cruelty. You choosing to donate is an active choice. Not giving away your earnings is the default state, a state of nonaction, because in such a state the subject is assumed to be incognizant of any particular demand. The same way you aren't cruel for not having donated to a particular starving child yesterday -- that is a default state of nonaction. Now your brain has become cognizant of the concept of starving children. Reading this, you may or may not choose to donate respondingly. Does not donating make you cruel? Perhaps, perhaps not. It's up to interpretation.",
        "created_utc": 1594547362,
        "id": "fxtdlgw",
        "permalink": "/r/stocks/comments/hpoew2/bill_gates_could_have_been_worth_800_billion_today/fxtdlgw/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594576162.0
    },
    {
        "author": "notbrokemexican",
        "body": "Ok. I have my retirement portfolio and I'm aware of EWW.\n\nLike I said - I'm making my own portfolio and I'm cognizant of its optimality. \n\nI'm not even going to be nice about it - everyone regurgitates the same shit. I get the common sense aspect of 3 fund portfolios and the Effecient market \n\n\nI'm here for a discussion on stock picking and INVESTING in something. Anyone who invests has a fucking god damn retirement portfolio.",
        "created_utc": 1594581153,
        "id": "fxuthpt",
        "permalink": "/r/investing/comments/hpyu28/usmca_mexicanamerican_investment_ideas/fxuthpt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594609953.0
    },
    {
        "author": "cashflow_",
        "body": "Just being cognizant of sugar intake is huge",
        "created_utc": 1594175924,
        "id": "fx9uydb",
        "permalink": "/r/wallstreetbets/comments/hn1zzv/what_are_your_moves_tomorrow_july_08_2020/fx9uydb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594204724.0
    },
    {
        "author": "notbrokemexican",
        "body": "Ok, I do this as a hobby. This isn't my life. I enjoy reading business news. I have my retirement portfolio. Why is it so hard to have a discussion on stock picking in this forum? Everybody says the same thing. I already put this in my post. I said I was cognizant of optimality.",
        "created_utc": 1594580970,
        "id": "fxut56m",
        "permalink": "/r/investing/comments/hpyu28/usmca_mexicanamerican_investment_ideas/fxut56m/",
        "score": 1,
        "subreddit": "investing",
        "created": 1594609770.0
    },
    {
        "author": "Chuckox50",
        "body": "Yes, it’s a good idea \n\nI think this is a particularly perilous time in the market, so really be cognizant of your asset allocation.",
        "created_utc": 1594663817,
        "id": "fxyawcl",
        "permalink": "/r/stocks/comments/hqigq6/cash_on_hand/fxyawcl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594692617.0
    },
    {
        "author": "rrrrrrrx123",
        "body": "3000 shares. Please read again. Also, bear or bull, being cognizant to manipulation is good. Gives you room to exit positions.",
        "created_utc": 1594259344,
        "id": "fxdnewq",
        "permalink": "/r/wallstreetbets/comments/hnp5x6/did_you_see_the_woman_in_the_red_dress_two_weeks/fxdnewq/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594288144.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "Speaking of Accounting Fraud...\n\nIt's been two weeks..  And any day now, ENPH is going to come out and deny those fraud allegations...   Any.  Day.  Now.  😏🕰️",
        "created_utc": 1593658752,
        "id": "fwnn2re",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwnn2re/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1593687552.0
    },
    {
        "author": "ixamnis",
        "body": "For a riskier choice: **ENPH** \\- Enphase energy has a great future, in my opinion.\n\nFor a safer choice:  **TMUS** \\- T-Mobile used to be at the bottom of the mobile phone world. They are working their way to the top. They seem to be very well managed and their stock prices have been reflecting that.\n\n(I only have exposure to **ENPH** through ETFs. I own shares of **TMUS**).",
        "created_utc": 1593639906,
        "id": "fwmoion",
        "permalink": "/r/stocks/comments/hjjrhw/what_is_your_favorite_growth_stock/fwmoion/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1593668706.0
    },
    {
        "author": "xolican",
        "body": "Numerous analysts came out the next day defending ENPH. PP already tried the exact same thing a while back. I still didnt have the balls to buy the dip.",
        "created_utc": 1594145614,
        "id": "fx8942l",
        "permalink": "/r/wallstreetbets/comments/hmzm1u/enph_am_i_missing_something/fx8942l/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594174414.0
    },
    {
        "author": "TheRealHBR",
        "body": "Soo is ENPH still legit?",
        "created_utc": 1593709872,
        "id": "fwpst9j",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwpst9j/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593738672.0
    },
    {
        "author": "KimJongUnsTrousers",
        "body": "These days, pick a fraud that gets heavily shorted and drops after a report, that's the perfect entry to go long and ride the squeeze. ENPH up 70% now after the Prescience report. LK dropped to 20 and then went up to 45 after the Muddy water report. GSX has doubled. HTZ... It's just an upside down market right now",
        "created_utc": 1594249115,
        "id": "fxd5b4v",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxd5b4v/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594277915.0
    },
    {
        "author": "CapitalC5",
        "body": "Simple, you don't. Belief in a company or industry can change and you can never be 100% certain for 10 or even 5 years. But you're pretty sure it will be great for a decent time and if something comes up, just act to it. \n\nI also believed ENPH was going to be the biggest player in solar energy, but I've sold immediately when there were fraud accusations, even if it turns out they are not grounded.\n\nLook at Buffett being a big fan of airlines, well not anymore. He said the industry has changed too much. Such things can happen all the time because of certain events, crisis, regulations, etc.",
        "created_utc": 1594255226,
        "id": "fxdg8mn",
        "permalink": "/r/stocks/comments/hnt441/long_term_how_do_you_justify_buying_healthcare/fxdg8mn/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594284026.0
    },
    {
        "author": "ForRolls",
        "body": "Looks like the ENPH recovery is kicking into gear",
        "created_utc": 1593621262,
        "id": "fwlj67f",
        "permalink": "/r/wallstreetbets/comments/hj7ixd/daily_discussion_thread_for_july_01_2020/fwlj67f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593650062.0
    },
    {
        "author": "ogpine0325",
        "body": "Enph was my first major swing back when it was worth like $3. Lately they've been hit with fraud allegations, something that has happened before in the company's past.",
        "created_utc": 1593645395,
        "id": "fwmzvfx",
        "permalink": "/r/stocks/comments/hjjrhw/what_is_your_favorite_growth_stock/fwmzvfx/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593674195.0
    },
    {
        "author": "OverallPriority",
        "body": "ENPH",
        "created_utc": 1593658534,
        "id": "fwnmq2j",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwnmq2j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593687334.0
    },
    {
        "author": "foxtailavenger",
        "body": "Most growth stocks tend to be “wildly overvalued” by traditional measures tbh. I think it’s ok to buy stocks at ATHs if you believe in the growth rate and business model of the company. I bought LVGO at an ATH at $57 I believe and averaged down when it tanked the next day. I always think it’s better to get a stake then just average down if it drops.\n\nPersonal picks: SE, LVGO, NET and ENPH (vested in all dyodd)",
        "created_utc": 1594025811,
        "id": "fx2zk8a",
        "permalink": "/r/stocks/comments/hm3vqb/best_growth_stocks_to_buy_now/fx2zk8a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594054611.0
    },
    {
        "author": "hkay4012",
        "body": "PLUG, ENPH, VSLR are good in my opinion for long term",
        "created_utc": 1594049055,
        "id": "fx3uh8v",
        "permalink": "/r/stocks/comments/hm3vqb/best_growth_stocks_to_buy_now/fx3uh8v/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594077855.0
    },
    {
        "author": "Dumptruckbaby",
        "body": "ENPH treating me so right",
        "created_utc": 1594051328,
        "id": "fx3yxrp",
        "permalink": "/r/wallstreetbets/comments/hm51pm/daily_discussion_thread_for_july_06_2020/fx3yxrp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594080128.0
    },
    {
        "author": "jacped",
        "body": "Like ENPH a lot long term.  A bit beaten down due to profit-taking and then the short-seller's report (which seems, from all available info, to be a hatchet job).",
        "created_utc": 1594141185,
        "id": "fx7zod9",
        "permalink": "/r/stocks/comments/hmqfe8/rstocks_daily_discussion_technicals_tuesday_jul/fx7zod9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594169985.0
    },
    {
        "author": "Parallelism09191989",
        "body": "Increase your risk. Your portfolio is that of a 90 year old.\n\nBuy some ERI, ENPH, SPACS, options and scale up your risk",
        "created_utc": 1594016351,
        "id": "fx2pr5b",
        "permalink": "/r/stocks/comments/hlqgnv/my_stock_portfolio_at_22_years_old/fx2pr5b/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594045151.0
    },
    {
        "author": "silverlink22",
        "body": "So we just gonna all forget about the ENPH fraud thing? Like they never responded and stock is back to normal. That was literally a buy the dip moment. Unless you got stuck holding puts like me.",
        "created_utc": 1593852322,
        "id": "fwvymd8",
        "permalink": "/r/wallstreetbets/comments/hkpyve/weekend_discussion_thread_for_the_weekend_of_july/fwvymd8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593881122.0
    },
    {
        "author": "Big-Stonks-Baller",
        "body": "Enph. It’ll be at 55-60 pre Er and could hit 70+ on strong numbers",
        "created_utc": 1594179124,
        "id": "fxa03za",
        "permalink": "/r/wallstreetbets/comments/hn8y27/in_ur_opinion_what_are_top_3_stock_that_have_a/fxa03za/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594207924.0
    },
    {
        "author": "ikasey24",
        "body": "I’ve officially went into my energy sectors, made out on one of the best days of the year today with ENPH and about to jump in on: CVX, FANG, SU.",
        "created_utc": 1594255902,
        "id": "fxdhf2j",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxdhf2j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594284702.0
    },
    {
        "author": "lloydgross24",
        "body": "My ENPH calls are currently worth $420",
        "created_utc": 1594230166,
        "id": "fxc1tht",
        "permalink": "/r/wallstreetbets/comments/hnegmj/daily_discussion_thread_for_july_08_2020/fxc1tht/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594258966.0
    },
    {
        "author": "DGar84",
        "body": "Im in enph since 12$ so Im happy with the performance overall. Solid company with good fundamentals. Im long.",
        "created_utc": 1594231213,
        "id": "fxc42vw",
        "permalink": "/r/StockMarket/comments/hnjs62/growth_solar_stock_recommendation/fxc42vw/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1594260013.0
    },
    {
        "author": "TheRealHBR",
        "body": "What about the lawsuit shit? ENPH never came out and said shit",
        "created_utc": 1593710224,
        "id": "fwptjwa",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwptjwa/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593739024.0
    },
    {
        "author": "ixamnis",
        "body": "TSLA, AMZN, ENPH, NVDA, MSFT, PYPL, TMUS\n\nETFs: XITK, QQQ, IWF, THNQ, ICLN",
        "created_utc": 1593749322,
        "id": "fwrtrr9",
        "permalink": "/r/stocks/comments/hjofm2/7000_ready_to_invest_in_these_potential_growth/fwrtrr9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593778122.0
    },
    {
        "author": "mlm55",
        "body": "Anybody read \"Uninhabitable Earth\" By David Wallace Wells? That book will fuck you up. \n\nENPH 50c 8/21, calls on Solar ETFs foreva",
        "created_utc": 1593792050,
        "id": "fwtd7j2",
        "permalink": "/r/wallstreetbets/comments/hkgjy6/daily_discussion_thread_for_july_03_2020/fwtd7j2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593820850.0
    },
    {
        "author": "KrakenClubOfficial",
        "body": "Holding NIO short term, NCLH mid($35-$40), ENPH, TSLA, and ARK until 🚀",
        "created_utc": 1594006898,
        "id": "fx2dg8c",
        "permalink": "/r/stocks/comments/hlzd23/growth_stocks/fx2dg8c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594035698.0
    },
    {
        "author": "infininme",
        "body": "what do you mean ENPH is low-key?",
        "created_utc": 1593964607,
        "id": "fx0ae4w",
        "permalink": "/r/stocks/comments/hl8w86/looking_for_good_renewable_energy_stocks/fx0ae4w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593993407.0
    },
    {
        "author": "Deastruacsion",
        "body": "I mostly invested in stocks but had quite a few options pre-COVID. When I would make a few thousand dollars through tech/renewable energy calls BLDP, ENPH, LOGI, SPCE, etc. I would cut ~60 percent of the gains and buy Tesla, AMD, Apple, and nvidia stocks. This way when I lost everything on my DDs, I didn’t crash to 0.",
        "created_utc": 1594039644,
        "id": "fx3efj3",
        "permalink": "/r/wallstreetbets/comments/hm6yic/hit_my_100_in_year_goal/fx3efj3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594068444.0
    },
    {
        "author": "Deastruacsion",
        "body": "I mostly invested in stocks but had quite a few options pre-COVID. When I would make a few thousand dollars through tech/renewable energy calls BLDP, ENPH, LOGI, SPCE, etc. I would cut ~60 percent of the gains and buy Tesla, AMD, Apple, and nvidia stocks. This way when I lost everything on my DDs, I didn’t crash to 0.",
        "created_utc": 1594041902,
        "id": "fx3hs7z",
        "permalink": "/r/RobinHood/comments/hm7j9z/ive_been_investing_a_little_over_1_year_i_hit_my/fx3hs7z/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1594070702.0
    },
    {
        "author": "BigHashBrows",
        "body": "\nI currently hold stock in European airlines Ryanair (I’m European) and a few European banks on different stock exchanges (not worth mentioning further).\nWas looking at the payments sector (V &amp; MA), solar companies (ENPH &amp; SEDG) and standard blue chip companies. Was also looking at weed stocks but only for shits and giggles. Feel there’s lots of upside in the future and they’re pretty low at the minute historically so if I see one, I might pick up a few shares.",
        "created_utc": 1594049828,
        "id": "fx3vz5a",
        "permalink": "/r/wallstreetbets/comments/hlx027/what_the_actual_fuck_is_going_on/fx3vz5a/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594078628.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "His former Accountant works at ENPH 👍",
        "created_utc": 1593654892,
        "id": "fwngpmh",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwngpmh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593683692.0
    },
    {
        "author": "Anotherdumbasshole",
        "body": "What happened with ENPH? People don’t care about the fraud?",
        "created_utc": 1593660582,
        "id": "fwnpz0k",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwnpz0k/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593689382.0
    },
    {
        "author": "Parallelism09191989",
        "body": "HASI just loans out money for renewable projects and offers expertise in the field.....\n\nIMHO, they have no moat. If you want dividends, buy AQN or TERP or AY or BEP or NEP. If you want growth, buy ENPH.",
        "created_utc": 1593737852,
        "id": "fwrbopl",
        "permalink": "/r/investing/comments/hictpi/hasireits_thoughts/fwrbopl/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593766652.0
    },
    {
        "author": "billmurrayabraham",
        "body": "Come on enph bb you can get in the 50s again it's ok",
        "created_utc": 1593742202,
        "id": "fwriowg",
        "permalink": "/r/wallstreetbets/comments/hk4c9t/what_are_your_moves_tomorrow_july_03_2020/fwriowg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593771002.0
    },
    {
        "author": "RelaxedOctopus420",
        "body": "What is everyone’s thoughts on LOVE (lovesac) and ENPH (enphase energy)",
        "created_utc": 1594135628,
        "id": "fx7odi3",
        "permalink": "/r/stocks/comments/hmqfe8/rstocks_daily_discussion_technicals_tuesday_jul/fx7odi3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594164428.0
    },
    {
        "author": "Napalm32",
        "body": "NEE, BEP, SEDG, ENPH (low-key volatile af) take a look",
        "created_utc": 1593912985,
        "id": "fwyj42v",
        "permalink": "/r/stocks/comments/hl8w86/looking_for_good_renewable_energy_stocks/fwyj42v/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593941785.0
    },
    {
        "author": "Thenattylimit",
        "body": "People have called out ENPH. No substance has been found in the claims. Stop engaging in confirmation bias.",
        "created_utc": 1593937695,
        "id": "fwzczec",
        "permalink": "/r/wallstreetbets/comments/hlhoym/nio_reporting_false_sales/fwzczec/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593966495.0
    },
    {
        "author": "Jdom666",
        "body": "MSFT, SQ, Enph, Ark's imo",
        "created_utc": 1594219378,
        "id": "fxbf8ce",
        "permalink": "/r/stocks/comments/hnhp48/21_yo_with_expenses/fxbf8ce/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594248178.0
    },
    {
        "author": "but-this-one-is-mine",
        "body": "ENPH",
        "created_utc": 1593989716,
        "id": "fx1lbmr",
        "permalink": "/r/wallstreetbets/comments/hlt7rc/what_are_your_moves_tomorrow_july_06_2020/fx1lbmr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594018516.0
    },
    {
        "author": "foxtailavenger",
        "body": "My current holdings for growth are ENPH SE LVGO and NET. My fav by far is LVGO.",
        "created_utc": 1593695310,
        "id": "fwox83w",
        "permalink": "/r/stocks/comments/hjjrhw/what_is_your_favorite_growth_stock/fwox83w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593724110.0
    },
    {
        "author": "Team_Avalon",
        "body": "DDOG - 36% \n\nMSFT - 10%\n\nCash - 10%\n\nOKTA - 8%\n\nFB - 8%\n\nROKU - 5%\n\nRDFN - 5%\n\nENPH - 5%\n\nLYFT - 4%\n\nSPT - 4%\n\nVIAC - 4%\n\nUAL - 3% (I hate myself for buying this)\n\nHigh risk tolerance so looking for some growthy bois. I'm 23 and just started investing last year",
        "created_utc": 1593704974,
        "id": "fwpi8mk",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fwpi8mk/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593733774.0
    },
    {
        "author": "ishkabum",
        "body": "right now here is the line-up in order of weight:\n\nENPH Enphase energy\n\nRTX Raytheon\n\nAEP American electric power\n\nGAN GameAccount network\n\nARKK\n\nARKG\n\nHASI Sustainable energy co\n\nGRAF/WS to be Velodyne Lidar tech\n\nARKF",
        "created_utc": 1594216982,
        "id": "fxbar5w",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fxbar5w/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594245782.0
    },
    {
        "author": "lloydgross24",
        "body": "I just mean bailing on stuff early or staying too late haha. \n\nI had Marvel calls today I sold for .25 that closed at .54 I think. I sold FSLR calls at like 1.20 two days ago and they went over $5 today. \n\nSold some ENPH calls at $3 (at least hung onto one)... It went up to 4.50 at one point. \n\nI then held on to SQ puts too long and lost most of the gains there. \n\nCLDR calls have murdered me until today. That's really the worst one ha. \n\nBut yeah that was the reasoning on BABA. The Chinese stocks are going nuts tho. I loaded up on some Tencent calls for August on the cheap. UOA on them too. Got a few other cheap ones too. Hoping for another big Chinese day tomorrow!",
        "created_utc": 1594252306,
        "id": "fxdb4tl",
        "permalink": "/r/wallstreetbets/comments/hnofn2/what_are_your_moves_tomorrow_july_09_2020/fxdb4tl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594281106.0
    },
    {
        "author": "redditgod16",
        "body": "Take a look at evsi (ev charging), 1 billion company worth 46mill. They do more revenue and lose less money then blink (worth 160 bill). Also Enph, an easy 25 bill stock in 2-3 years",
        "created_utc": 1593880341,
        "id": "fwwz96n",
        "permalink": "/r/wallstreetbets/comments/hkrnjz/20_year_old_with_more_money_than_sense_should_i/fwwz96n/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593909141.0
    },
    {
        "author": "Rageoftheage",
        "body": "TSLA, HASI, NEP, BEP, AES, ORA, ENPH, SEDG, WKHS, SHLL, AYRO",
        "created_utc": 1593927852,
        "id": "fwz2r0q",
        "permalink": "/r/stocks/comments/hl8w86/looking_for_good_renewable_energy_stocks/fwz2r0q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593956652.0
    },
    {
        "author": "ragemind",
        "body": "fuck ENPH is really fucking me today. i guess people are over the fraud cases",
        "created_utc": 1594224512,
        "id": "fxbporl",
        "permalink": "/r/wallstreetbets/comments/hnegmj/daily_discussion_thread_for_july_08_2020/fxbporl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594253312.0
    },
    {
        "author": "canadianfriesss",
        "body": "I strongly agree with the atz pick. Some others I like are:\n\nCanadian securities - flt, kxs, vff\n\nAmerican securties - dkng, enph",
        "created_utc": 1594174551,
        "id": "fx9sn3a",
        "permalink": "/r/CanadianInvestor/comments/hn4lbu/potential_canadian_growth_stocks/fx9sn3a/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1594203351.0
    },
    {
        "author": "Grunblau",
        "body": "With ENPH, I felt like someone I loved betrayed me and I was willing to take them back if they just promised to do better...  \n\nPeople in the industry really like their products compared to SEDG (Solar Edge) and believe that if the US has a change in leadership, solar and alternative energy will continue to pick up momentum.",
        "created_utc": 1593661006,
        "id": "fwnqn0c",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwnqn0c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593689806.0
    },
    {
        "author": "hotwingbias",
        "body": "ENPH",
        "created_utc": 1593695136,
        "id": "fwoww0a",
        "permalink": "/r/wallstreetbets/comments/hjudrj/daily_discussion_thread_for_july_02_2020/fwoww0a/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593723936.0
    },
    {
        "author": "hughesmaxwell",
        "body": "Would never buy puts on TSLA, but would also never pay the current (and expanding) P/E multiple. Other clean energy plays also very expensive ENPH RUN",
        "created_utc": 1593956266,
        "id": "fwzwghm",
        "permalink": "/r/stocks/comments/hlkc1z/investing_in_tesla_a_good_idea/fwzwghm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593985066.0
    },
    {
        "author": "lloydgross24",
        "body": "Really hoping my CLDR calls print tomorrow. I've been holding out as long as I can. My portfolio has somehow managed to stay relatively flat the last 2 days despite losing 40% on those calls. Shout to AMD, VIAC, ENPH and a small RTX rally for keeping me from getting margin called.",
        "created_utc": 1593652740,
        "id": "fwnd100",
        "permalink": "/r/wallstreetbets/comments/hjhy1t/what_are_your_moves_tomorrow_july_02_2020/fwnd100/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1593681540.0
    }
]