[
    {
        "author": "SpaceWanderer006",
        "body": "Accenture (big consulting firm) just announced they won't be traveling until end of Feb. 2021...",
        "created_utc": 1592256312,
        "id": "fuy00d3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1592285112.0
    },
    {
        "author": "philke",
        "body": "My half awake ass bought $ACN $225 6/26 Calls x10 @$1. \n\nI was already down 80% $1k down the drain. So hopefully it will gap up tomorrow morning so i can get out at least 50% back",
        "created_utc": 1593126816,
        "id": "fw08rwl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593155616.0
    },
    {
        "author": "DustyBowls",
        "body": "Arthur Enderson was apart of the Big 5 accounting firms with Deloitte. They were the auditors for Enron. When Enron went down they did as well.  They are now known as Accenture.\n\n[https://en.wikipedia.org/wiki/Arthur\\_Andersen](https://en.wikipedia.org/wiki/Arthur_Andersen)",
        "created_utc": 1592435932,
        "id": "fv6cm2b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1592464732.0
    },
    {
        "author": "pet_owl",
        "body": "Awesome man! I agree it’s getting only messy now. I’m looking for advice to start a longer dated short position. Say July/August. Would you personally recommend IWM, SPY, or a random tech like ACN, APPL? Thanks, just looking for opinion 🙏🏼",
        "created_utc": 1592010841,
        "id": "funrj8r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592039641.0
    },
    {
        "author": "malloun123",
        "body": "Anyone playing ACN? Earnings on Thursday",
        "created_utc": 1592791436,
        "id": "fvlhf2e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592820236.0
    },
    {
        "author": "ReactingPT",
        "body": "Same stuff happening at ACN",
        "created_utc": 1593029823,
        "id": "fvvybz2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593058623.0
    },
    {
        "author": "Spuri0n",
        "body": "someone convince me not to YOLO on $ACN for earnings this week.",
        "created_utc": 1593021710,
        "id": "fvvhf5u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593050510.0
    },
    {
        "author": "Spuri0n",
        "body": "eod play idea: watch for an $ACN pump near power hour, earnings tomorrow morning so we might see a pump",
        "created_utc": 1593020696,
        "id": "fvvf97w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593049496.0
    },
    {
        "author": "Worf_Of_Wall_St",
        "body": "Ah, I thought it became Accenture but that was just a separate business unit detaching from Arthur Anderson.",
        "created_utc": 1592581325,
        "id": "fvci4zi",
        "score": 1,
        "subreddit": "investing",
        "created": 1592610125.0
    },
    {
        "author": "xzero_3",
        "body": "DD is wrong.\n\nINFY/ACN/TCS charges client $72/hr, pays sub-contractor 45-50/hr and pays the slave $20-37/hr.\n\nA $20 margin is a $20 margin irregardless of %.",
        "created_utc": 1593414368,
        "id": "fwcg8wi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593443168.0
    },
    {
        "author": "pet_owl",
        "body": "Same. Would you suggest puts on individual tech shares (NFLX, ACN, others?) or vol play like TVIX? I'm down to my last few $k and want to be smart, lost good amount trying to 'predict' weeklies. Thanks!",
        "created_utc": 1592082377,
        "id": "fuqli94",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592111177.0
    },
    {
        "author": "Bexanderthebex",
        "body": "Accenture people are dumb",
        "created_utc": 1592257506,
        "id": "fuy2ifi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592286306.0
    },
    {
        "author": "gamesdf",
        "body": "$275/week allocations:\n\n**EFTs:**\n\nivv 40\n\nvgt 30\n\nskyy 18\n\nschd 30\n\nvnq 18\n\n**Stocks:**\n\nmsft 10\n\namzn 10\n\nv 10\n\nrtx 7\n\namd 7\n\nabbv 8\n\nacn 8\n\ncost 8\n\ngoogl 10\n\nfb 9\n\npypl 9\n\nnflx 9\n\nunh 8\n\njnj 8\n\naapl 10\n\njpm 8\n\nPlease let me know if this list is good enough for long term investment.\n\nThank you.",
        "created_utc": 1591896916,
        "id": "ftpstjo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591925716.0
    },
    {
        "author": "computerfreund",
        "body": "IBM, Accenture, SAP are coming to my mind immediately. They will offer DLT services/solutions to their clients, but they are huge already.",
        "created_utc": 1591163494,
        "id": "fspw763",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591192294.0
    },
    {
        "author": "mulemoment",
        "body": "Why so much tech? Some upcoming headwinds for tech are:\n\n* Rotation out of stay at home stocks (AMZN especially)\n\n* Full impact of advertising and other B2B cuts will be seen in second half of 2020 and through 2021 (Goog, FB, ACN, similar)\n\n* Possible anti-trust proceedings (Goog especially)\n\nIn your 20s you can wait out these headwinds, but if you diversify better you'll probably see better growth.",
        "created_utc": 1591555590,
        "id": "ftaj9yg",
        "score": 1,
        "subreddit": "investing",
        "created": 1591584390.0
    },
    {
        "author": "Creative_Fault",
        "body": "ACN",
        "created_utc": 1592667636,
        "id": "fvg5erv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592696436.0
    },
    {
        "author": "Spuri0n",
        "body": "$ACN gonna keep running tomorrow, might touch all-time highs before earnings. hope you got in yesterday",
        "created_utc": 1592927315,
        "id": "fvr4xui",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592956115.0
    },
    {
        "author": "ZloiAris",
        "body": "Rate my portfolio: 28  \n\n\n* MSFT - impressive growth with new CEO and who stops them? Leader in the enterprise area as a cloud-service provider, team communications provider, Office 365, data analysis and BI facilities. Missing AI component, but their business is well diversified and very steady. International exposure.\n* AAPL - until revolution in smartphones (like NeuraLink or any other interface which will remove smartphones at all) very decent business. 5G is coming, a diversified business, large pile of the cash in the pocket. Apple Music is eating Spotify pie, new SE &amp; iPhone 12 should be a best-seller during X-Mas time. International exposure.\n* V - leader in the world of payments, slowly entering the crypto area, and its balance-sheet a bit better than Mastercard. In general both are good choices. The only issue is that for Visa default currency is USD, while for MA - EUR, and USD might be weakier soon.\n* INTC - leader in the retail chipset area, right now controls almost the entire CPU area.\n* NVDA - one of the few \"growth\" stocks here. Its P/E is very high, but low leverage, impressive P/S and amazing return on employed capital is making the day. NVDA is one of the biggest beneficiaries of the AI industry coming, as well as auto-pilot vehicles.\n* CTXS - ok, there is another growth company. Citrix provides capabilities to work from home without buying dedicated hardware. It means you don't need to buy everyone a corporate laptop to enable them to safely join from home. It is held by top index funds, and attracts a lot of S&amp;P 500 clients, who have high hopes in them.\n* BABA - yes, not the AMZN. BABA right now is extremely undervalued. They look absolutely amazing in every financial aspect, and thanks to extreme digitalisation of Asia, their revenue is growing super fast.\n* NKE - from one hand this is a consumer cyclical company, but from another - very strong brand. Their online shopping presens is huge, as well as exposure to a world market including China. I might assume they will stay around for a while thanks to the new trend of being healthy.\n* ACN - top IT consulting company, basically working for every Fortune 500 company. Right now I see 3 factors they will keep growing. At first, companies needed expertise to migrate to new cloud infrastructure. At seconds, companies will reduce their hiring budget for a while, but will instead hire external resources more intensively. At third, ACN made few acquisitions in the cyber-security area.\n* (Disclaimer: I had worked for EPAM for 5 years and might be biased)  EPAM - one of the faster growing IT services companies in the world. They have a very strong expertise in almost every area, like integration of complex IT solutions, cloud migrations, online shopping, etc. I see them a long term winner of the current setup. Also they start expansion to the Asia market.\n* CIEN - another long-term winner of working from home setup providing hardware configurations for organizing IT servers, clusters, telecommunications, etc.\n* LDOS - one more IT services company but working in the aerospace &amp; defense area with governments. One of the key vendors in the area of COVID-19 tracking facilities and digitalisation of government infrastructure to control COVID-19. Currently holds a portfolio of almost $30 bln agreements.\n* AVGO - another 5G chipset producer winner. Very solid diversified portfolio, good fundamentals.\n* TSM - semiconductor manufacturer, one the largest in the world. Produces chipsets for NVDA, INTC, AVGO, AMD and others. In my opinion, if I bet on the chipset industry it would be weird to not bet on TSM who is located in COVID-19 free area now and also has clients not only from the USA.\n* LRCX - yet another semiconductor company, but this time a leader in the area of automatisation of production lines. They produce solutions which help to automate facilities - the thing most factories will look into to reduce risk of COVID or any other pandemic.\n* MRK - one of the biggest healthcare companies. While everyone is watching Moderna, MRK also participates in the race for COVID-19 vaccine and has a very decent fundamentals and portfolio of products.\n* REGN - innovative bio healthcare company, their financial and earnings are skyrocketing with a huge potential to grow.\n* ROG - Swiss based healthcare company, very strong portfolio and financials\n* BAYN - I am not a super big fan of Bayer, but they are definitely undervalued now due to all PR recent PR issues. Expect to grow 50% in upcoming years, with strong fundamentals. \n* VIAC - one of the most undervalued TV companies right now. Very strong portfolio and strong fundamentals, clean balance sheet. Frankly I spent hours trying to find a reason for such a low price and didn't manage to find any except for \"index fund problem\".  \n* CI - insurance industry under the huge hit due to increasing expenses (people suffer from COVID) and reduced payments (people loosing job and might start cutting their spendings), but Cigna looks like one of the best to survive the storm and has a bright future for a long term. Faitly under-valued strong balance-sheet company.\n* SU - European large cap producer of energy, data and sustainability facilities. \n* BN - Another European large cap company: food producer. They position themselves as a healthy food producer, and COVID should not distract them as much as Americans food producers are. \n* HD - One of rare bets on American consumer spending. Leader in the area of organizing houses in sub-urban zones. With growth of WFH setup, more people expected to migrate to the country-side, so in the long term HD might benefit. Their balance sheet is also very solid.\n* VMC - Basic materials bet. Among all other basic materials companies, VMC looks the best. Also, despite I have high doubts about 1 tln infrastructure package to pass the Congress, VMC would benefit from this idea.\n* BRK-B - no introduction is needed. Buffet underperformed S&amp;P for a long time, but his portfolio is decent, he sits on a large pile of the cash and proper timing of deploying this cash would result in a great return later on. Still pretty safe to add BRK into my portfolio, their long term run looks pretty good.\n\nAlso I am considering adding 4 strong dividend companies with still promising futures.  \n\n\n* IBM - it might look like a dying mamont, but IBM for years is a leader of patents. They year by year increase their presence in cloud infrastructure, AI, robotics and other topics. With new CEO targets growth, IBM has a pretty decent future for the moment with a diversified portfolio of technologies &amp; patents. High hopes on IBM AI technologies. As well, IBM pays very huge dividends, so why not hold them for some time?\n* T - the same story but in another segment. Might benefit from 5G, has a diversified portfolio, enters the \"stream wars\" area and pays a huge dividend. As a diversification for stocks who pays small dividends but grow in market cap, good choice. \n* STX - Another high dividend representative from the hardware storage business. This area will stay around for a while, and STX is healthier than their competitors, look like a safe bet for a long term holding. \n* ABBV - And the last high-dividend company from the healthcare segment. There is a lot of analysis of ABBV around, so no reason to repeat it all.\n\nAnd 1 ETF:  \n\n\n* EXV6 - since I am EU resident, I need to invest into UCITS, and this is a basic materials ETF mainly RIO, BHP, GLEN, AAL. This segment supports all manufacturing around the world, why should they have gone?\n\nThat's basically it. I am still playing around numbers to calculate the potential risk of this portfolio and define the proper % allocation of stocks, but what's your thoughts on the companies from the list?",
        "created_utc": 1592850809,
        "id": "fvnula3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592879609.0
    },
    {
        "author": "dwdsquared2",
        "body": "**Events in the US Today (EDT):**\n\n* 8:30am - GDP (QoQ-Q1) \\[3/3 Volatility\\]\n   * Core Durable Goods Orders (MoM-May) \\[3/3 Volatility\\]\n   * Initial Jobless Claims \\[3/3 Volatility\\]\n   * Durable Goods Orders (MoM-May) \\[2/3 Volatility\\]\n   * Goods Trade Balance (May) \\[2/3 Volatility\\]\n   * Retail Inventories Ex Auto (May) \\[2/3 Volatility\\]\n   * Wholesale Inventories (MoM) \\[1/3 Volatility\\]\n   * PCE Prices (Q1) \\[1/3 Volatility\\]\n* 9:00am - The House will convene to vote on a policing reform bill\n* 9:30am - FOMC Member Kaplan Speaks \\[2/3 Volatility\\]\n* 10:00am - The Senate will convene to resume consideration of the National Defense Authorization Act for fiscal 2021. \n* 10:30am - Natural Gas Storage \\[1/3 Volatility\\]\n* 11:00am - FOMC Member Bostic Speaks \\[2/3 Volatility\\]\n   * KC Fed Composite Index (Jun) \\[1/3 Volatility\\]\n   * KC Fed Manufacturing Index (Jun) \\[1/3 Volatility\\]\n* 11:10am - POTUS &amp; FLOTUS Ceremony Participation\n   * Wreath Laying Ceremony at the Korean War Veterans Memorial in D.C.\n* 12:00pm - FOMC Member Mester Speaks \\[2/3 Volatility\\]\n* 2:30pm - POTUS Townhall in Green Bay, WI\n   * With Sean Hannity, FOX News (but, aired at 8:00pm)\n* 4:30pm - Bank stress test results released \\[3/3 Volatility\\]\n* 5:00pm - POTUS delivers remarks at Fincantieri Marinette Marine\n   * Marinette, WI\n* Tomorrow: rebalance of Russell indexes\n* Disney has delayed the re-opening of theme parks and resorts in California beyond July 17th\n* New York, Connecticut and New Jersey to impose a 14-day quarantine on visitors arriving from the worst-affected states\n* There will a be quarterly update from JC Penney who is currently negotiating its way through Chapter 11 proceedings\n* Blank-check company Artius Acquisition Inc. filed for an initial public offering on Thursday, with plans to raise $525 million as well as be listed under Nasdaq ticker $AACQU\n\n**Events in the World Today (EDT):**\n\n* Day - China &amp; Hong Kong Holiday - Dragon Boat Festival\n* 2:00am - Germany GfK Consumer Climate (Jun) \\[2/3 Volatility\\]\n* 6:00am - France Jobseekers Total \\[2/3 Volatility\\]\n* 6:30am - UK BoC FPC Meeting Minutes \\[1/3 Volatility\\]\n* 7:00am - Mexico Retail Sales (MoM&amp;YoY-Apr) \\[2/3 Volatility\\]\n* 7:30am - Euro Zone ECB Account of Monetary Policy Meeting \\[3/3 Volatility\\]\n* 8:30am - Euro Zone ECB's Schnabel Speaks \\[2/3 Volatility\\]\n   * IMF Global Financial Stability report released \\[3/3 Volatility\\]\n* 9:30am - Euro Zone ECB's Mersch Speaks \\[2/3 Volatility\\]\n* 1:00pm - UK BoE MPC Member Haldane Speaks \\[2/3 Volatility\\]\n* 2:00pm - Mexico Interest Rate Decision (Jun) \\[2/3 Volatility\\]\n* 7:30pm - Japan Core CPI (YoY-Jun) \\[2/3 Volatility\\]\n   * Japan CPI Tokyo Ex Food &amp; Energy (MoM-Jun) \\[2/3 Volatility\\]\n* German payments company Wirecard collapsed on Thursday after disclosing a massive financial hole in its books, leaving creditors owed nearly $4 billion facing an almost complete wipeout\n* Lufthansa shares jumped around 15% after its top shareholder dropped his objections to a 9 billion euro ($10 billion) government bailout\n\n**Earnings Before Open:**\n\n* Rite Aid\n* Darden Restaurants\n* McCormick &amp; Co.\n* Accenture\n* FactSet Research Systems\n* GMS, Inc.\n* Worthington Industries\n* Enerpac Tool Group\n* Unique Fabricating, Inc.\n\n**Earnings After Close:**\n\n* Nike\n* Synnex\n* Progress Software\n* Aethlon Medical\n* CalAmp",
        "created_utc": 1593083060,
        "id": "fvxyvat",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593111860.0
    },
    {
        "author": "atomic_gecko",
        "body": "ACN, FSLY, SQ RIPPIN",
        "created_utc": 1593092427,
        "id": "fvybsx9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593121227.0
    },
    {
        "author": "SB52Birds",
        "body": "Anyone playing Accenture earnings?",
        "created_utc": 1593001051,
        "id": "fvuerj1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593029851.0
    },
    {
        "author": "Voqals",
        "body": "Buy $acn calls in the morning",
        "created_utc": 1593161733,
        "id": "fw1moqx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593190533.0
    },
    {
        "author": "ThisSiteIsCursed",
        "body": "They've wanted to sell this company for years, that's why Chen was brought in. I'm just curious what conglomerate is looking at them or is someone like Broadcom (who just aquired Symantec Corporation) or Accenture might snap them up as they just took over Symantec's CyberSecurity division.",
        "created_utc": 1591110212,
        "id": "fsn3kdq",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1591139012.0
    },
    {
        "author": "gamesdf",
        "body": "MSFT, AMZN, V, GOOGL, ABBV, RTX, AMD\n\nI also chose these 2 unpopular stocks bc...:\n\nACN, COST = Constant, steady growth. Very strong finance.",
        "created_utc": 1591550237,
        "id": "fta993y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591579037.0
    },
    {
        "author": "Spuri0n",
        "body": "$ACN -- any autist on here been following this stock? ripe for a bigly green day after today?\n\ncan anyone even clue me in on what they do before I try and get cucked on earnings again?",
        "created_utc": 1593014805,
        "id": "fvv32j5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593043605.0
    },
    {
        "author": "Voqals",
        "body": "Buy $acn calls",
        "created_utc": 1593161882,
        "id": "fw1mu8t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593190682.0
    },
    {
        "author": "Spuri0n",
        "body": "anyone excited for $ACN earnings on Thursday? I think I might load up some calls for the run-up. ATHs incoming baby",
        "created_utc": 1592874625,
        "id": "fvp3r3a",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1592903425.0
    }
]