[
    {
        "author": "DevilishJoe",
        "body": "ZM market cap is larger than UPS, T, AVGO, ABBV, XOM, QCOM.\n\nOnly 9B short of CSCO. Retard level 100 unlocked 🤣😂🤣😂🤣",
        "created_utc": 1602868172,
        "id": "g90pxfd",
        "permalink": "/r/wallstreetbets/comments/jc7ao5/daily_discussion_thread_for_october_16_2020/g90pxfd/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1602896972.0
    },
    {
        "author": "Captain-76",
        "body": "From the wire for the AAPL holders:\n\n  \n\n* Apple (AAPL) will report fourth quarter earnings tonight after the          close.       \n* **Q4 Capital IQ consensus calls for EPS of $0.70 (-8% yr/yr) on          revenue of $63.31 bln (-1% yr/yr).**  \n* The Street is expecting Q4 gross margins of 38.2% versus 38.0% last year.       \n* **The Street is expecting Q4 iPhone revenues (which is expected to decline due delay of new iPhone 12 models) of $28.5 bln vs. $33.4 bln last year,** wearables revenue of $7.6 bln vs. $6.5 bln last year, iPads revenue of $6.2 bln vs. $4.7 bln last year, and services revenue of $13.9 bln vs. $12.5 bln last year.       \n* **The most important data point is likely to be Q1 guidance due to the release of the iPhone 12 that was announced earlier this month.** Analyst Kuo told CNBC that Apple sold 2 mln iPhone 12 models on the first day or pre-orders versus 800K for iPhone 11. The company is expected to guide for Q1 revenues of $100.4 bln (-9.4% yr/yr). The Street is expecting Q1 gross margins of 37.8% vs. 38.4% last year.       \n* The company has not missed EPS or revenues in the last several quarters. Apple performed well across its bevy of offerings in Q3. iPhone revenues +1.5% yr/yr to $26.4 bln vs $22.0 bln estimates; Services revenues +14.8% yr/yr to $13.2 bln vs $13 bln ests; iPad +22% yr/yr to $7.08 bln; Mac revs +31% yr/yr to $6.6 bln; Wearables +16% yr/yr to $6.6 bln. Apple is benefitting from the shift to at-home work/school, which has pushed people to buy new products, apps and services. The economic stimulus measures and the lifting of          stay-at-home restrictions were tailwinds in May and June.       \n* AAPL has a $1.94 trillion valuation and currently trades at 34 times FY20 earnings.       \n* Based on the weekly AAPL Weekly Oct30 $113 straddle, the options market is currently pricing in a move of \\~5% in either direction by weekly expiration (Friday).       \n* Suppliers to keep on note include: **SWKS**, **CRUS**, **AVGO**, **QRVO**, **TSM**, and **QCOM**, among others (SMH); **SSNLF**, **LPL** (for displays) and **LITE**, FNSR and **IIVI** (for FaceID).",
        "created_utc": 1603981510,
        "id": "gahqx13",
        "permalink": "/r/wallstreetbets/comments/jk7d6g/daily_discussion_thread_for_october_29_2020/gahqx13/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604010310.0
    },
    {
        "author": "the13thrabbit",
        "body": "The Semi conductor sector is red hot for a reason — economy has never been so chip intensive as it is today. Deal activity soaring as the race to expand product breadth + increase TAMs heats up\n\nFavorites in the group: $NVDA, $AMD, $MRVL\n\nAlso worth a look: $LRCX, $AVGO, $QRVO\n\nAs we drill it's important to keep semis on your watchlist and look for an entry IMO",
        "created_utc": 1604072437,
        "id": "galy2fm",
        "permalink": "/r/wallstreetbets/comments/jku4jx/daily_discussion_thread_for_october_30_2020/galy2fm/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1604101237.0
    },
    {
        "author": "ixamnis",
        "body": "I have multiple brokerage accounts and I do have on for just investing in ETFs.  Keeping it simple is a pretty solid approach.  However, I'm not thrilled with your choices.  **VOO** and **QQQ** will have a lot of overlap, so you aren't diversifying as much as you might think. **QQQ** is a great ETF, but the underlying index it uses as a benchmark contains 100 stocks.  (The NASDAQ 100).  **VOO** uses the S&amp;P 500, so it obviously contains 500 stocks. Many of the top holdings are going to be the same in both of those ETFs: Apple, Microsoft, Google, Facebook, Netflix, Amazon. There are, of course, differences, as well.\n\nI also don't like your choice of **VYM** because of its poor return. It has a 10 year return on investment of just 115%, while VOO is double that and **QQQ** has a return of more than 4 times that of **VYM**. **VYM** will also hold many of the companies you are already investing in with **VOO**.\n\n**QQQ** has one of the highest returns of any ETF, but it is Tech-heavy, so there may be a bit more risk than **VOO**.  \n\nYou don't tell us your age, your financial goals and how averse you are to risk, but assuming you are reasonably young (more than 20 years away from retirement) and don't mind some risk, I might suggest a strategy more along the lines of:\n\n**QQQ**: 25%\n\n**VOO**: 25%   (with the understanding that there is some overlap. The blue chip stocks in VOO will help your portfolio to be a little less volatile than putting 50% into QQQ.)\n\n**SOXX:**  10% - iShares PHLX Semiconductor ETF - this is a sector ETF that invests in companies that produce semi-conductors (and related companies). The top holdings of this ETF include Broadcom, Intel, NVIDIA, Texas Instruments, Qualcomm, Micron Technology, Taiwan Semiconductor, Analog Devices and NXP Semiconductors.  The might be a little overlap with this one and QQQ, but there shouldn't be much.\n\n**ICLN:**  20% - ICLN is an ETF that invests in green/renewable energy. It is a passively managed index fund that uses the S&amp;P Global Clean Energy Index as its benchmark. Many of its holdings are outside the US.  (If you prefer a more US focused ETF that invests in renewable energy, consider QCLN instead, but be aware that its top holding is NIO, an electric vehicle maker based in China). \n\n**ARKK:**  10% - The ARK funds are actively managed and they invest in \"disruptive,\" innovative companies, many of which are in the tech sector.  Tesla is the top holding of this fund.\n\n**VXUS**: 10% - This is an investment that tracks the performance of a benchmark index that measures the investment return of stocks issued by companies located in developed and emerging markets, excluding the US. The fund tracks the FTSE all Cap ex US Index fund. Top holdings include Alibaba, Tencent Holdings, Taiwan Semiconductor (a little overlap with SOXX) Nestle, Roche Holding, SAP SE, Novartis, Toyota and ASML.  While the long term track record of this fund isn't great, the recent addition of Alibaba, Tencent and other companies signal a likely more profitable future.\n\nI think an approach like this will give you the additional diversity you are looking for and a more aggressive return than the choices you've made in your post. \n\n*I'm not a professional Financial advisor and I didn't sleep in a Holiday Inn Express last night. I do own shares in many of the funds I've listed above.*",
        "created_utc": 1602473208,
        "id": "g8k5052",
        "permalink": "/r/stocks/comments/j9gq70/separate_etf_account/g8k5052/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1602502008.0
    },
    {
        "author": "ArsMedMD",
        "body": "QRVO, AVGO",
        "created_utc": 1602476606,
        "id": "g8k9us6",
        "permalink": "/r/wallstreetbets/comments/j9cghm/what_are_your_moves_tomorrow_october_12_2020/g8k9us6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602505406.0
    },
    {
        "author": "michellinThrow",
        "body": "Can Someone Critique my portfolio?, have around 90% cash and planning to buy during this slight dip and hold forever, will probably sell in 30 years and not look at my account for a very long time. Looking at high growth stocks that still have the potential to grow over the FAMG or popular stocks that are developed:\n\n30% AMZN\n\n25% QQQ etf\n\n15% SPY etf\n\n10% TSLA\n\n10% NIO\n\n5% ARKK etf\n\n3% AVGO (Broadcam)\n\n2% ENB (Enbridge Natural Gas)",
        "created_utc": 1601848064,
        "id": "g7q65ac",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g7q65ac/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601876864.0
    },
    {
        "author": "PM_ME_UR_THONG_N_ASS",
        "body": "Our strategies are going to be different because I don't play options because I know I'm too retarded to manage an expiring asset.  I just take advantage of free stock trades and invest weekly in buy and forget stocks in my play account (but if you're curious, AAPL, TSM, AMZN, BABA, AVGO are the biggest holdings).  Since AVGO is something you probably haven't heard of, I like them because they supply Apple with a bunch of chips and have a big datacenter presence.  Plus they have a nice dividend, which is rare for a tech company.\n\nThe majority of my money goes to tax advantaged accounts (401k, after tax 401k, roth ira, hsa).  In those, VGT, FDGRX, and FCNTX.",
        "created_utc": 1602957051,
        "id": "g94fxmh",
        "permalink": "/r/wallstreetbets/comments/jcttss/most_anticipated_earnings_releases_for_the_week/g94fxmh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602985851.0
    },
    {
        "author": "RollingD",
        "body": "AVGO calls",
        "created_utc": 1603386957,
        "id": "g9nzd81",
        "permalink": "/r/wallstreetbets/comments/jfwwhm/daily_discussion_thread_for_october_22_2020/g9nzd81/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603415757.0
    },
    {
        "author": "yolowsblfg",
        "body": "with u on that one, had calls when it broke above like 82/4ish and sold and just bought back today, smaller size tho. nxpi, amba, asml, mrvl, swks, avgo, oled all poppin off. holding avgo/oled",
        "created_utc": 1602624916,
        "id": "g8qgwzo",
        "permalink": "/r/wallstreetbets/comments/jalaq5/what_are_your_moves_tomorrow_october_14_2020/g8qgwzo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602653716.0
    },
    {
        "author": "Fragglepusss",
        "body": "Don't start with options, don't buy anything with a market cap under 1B. I like TSM, BIDU, AVGO, BIIB, GLW, JNJ, BLK, LMT right now. If you have satellite radio then listening to the CNBC simulcast on your morning commute will help you gain literacy. Mad Money can also be listened to as a podcast.",
        "created_utc": 1601610126,
        "id": "g7d57pp",
        "permalink": "/r/wallstreetbets/comments/j3nbjw/im_new_here/g7d57pp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601638926.0
    },
    {
        "author": "solidmussel",
        "body": "Anyone who bets on intel better also balance their exposure with the semis that are gaining marketshare.  \n\nTake your pick of TSM AMD and NVDA.  Or even AVGO QCOM MU.  \n\nThese are all more sustainable companies than intel.",
        "created_utc": 1603831934,
        "id": "gab96i8",
        "permalink": "/r/stocks/comments/jj1nv6/thoughts_on_intel_intc/gab96i8/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1603860734.0
    },
    {
        "author": "bobthedestroyers",
        "body": "BROADCOM is a reloatively safe dividend stock",
        "created_utc": 1602633549,
        "id": "g8qwe82",
        "permalink": "/r/wallstreetbets/comments/jalaq5/what_are_your_moves_tomorrow_october_14_2020/g8qwe82/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602662349.0
    },
    {
        "author": "yolowsblfg",
        "body": "this kinda ruined my night before im bout to head to bed smh. bought too many calls as of late, including fomo chasing break outs (crsp and pypl calls)...and recently bought smh (avgo, tsm calls), and have too much tech (vmw, baba, crwd, nio, shop, oled, huya)...i feel like i need to get out while im still up..hate going red to green. \n\nplaying devils advocate/holding onto hope, if dix is meaningless/lagging and gex means high sensitivity/ continuation of trend, could this mean we get a mega squeeze up? kinda hopeful here but judging only by leading stocks, greed is here/risk is on..",
        "created_utc": 1602571345,
        "id": "g8o67pi",
        "permalink": "/r/wallstreetbets/comments/j9yfxe/what_are_your_moves_tomorrow_october_13_2020/g8o67pi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602600145.0
    },
    {
        "author": "dvdmovie1",
        "body": "In terms of non V/MA fintech, I particularly like Paypal's Ebay replacement, Adyen (ADYEY) although it's a little overextended at this point - but I also do like PYPL. SPGI is a terrific long-term holding. NVDA is a large holding, but I wouldn't be surprised if there's a mild pullback sooner than later after the run it has had. I haven't really looked at AVGO in a while. Somewhat related in semis, I do like ASML.",
        "created_utc": 1603097994,
        "id": "g9b2knh",
        "permalink": "/r/investing/comments/jcu1bj/daily_advice_thread_all_basic_help_or_advice/g9b2knh/",
        "score": 1,
        "subreddit": "investing",
        "created": 1603126794.0
    },
    {
        "author": "PM_ME_DANK",
        "body": "Started my dividend growth portfolio 2 years ago. I was up ~ +24% before March. Max draw down ~ -33%. Kept throwing in more money and made some key new additions to the portfolio in $AVGO, $AMAT, $UNP, and $NEE which has me up now around 14%. I attribute not still being negative to DCA'ing and owning companies with double digit dividend growth rates. Although my portfolio yields 3.15% currently the average dividend growth rate of my 22 holdings is 12.4% over the past 5 years",
        "created_utc": 1602813888,
        "id": "g8ynt55",
        "permalink": "/r/investing/comments/jbx0qe/dividend_investors_how_have_you_been_doing_since/g8ynt55/",
        "score": 1,
        "subreddit": "investing",
        "created": 1602842688.0
    },
    {
        "author": "terrortbh",
        "body": "AVGO you absolute worthless piece of garbage go up more!",
        "created_utc": 1602518763,
        "id": "g8loik3",
        "permalink": "/r/wallstreetbets/comments/j9obtn/daily_discussion_thread_for_october_12_2020/g8loik3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602547563.0
    },
    {
        "author": "thedirtybarnacle",
        "body": "NIO, WRK, AVGO",
        "created_utc": 1601906121,
        "id": "g7sef9s",
        "permalink": "/r/wallstreetbets/comments/j5guae/daily_discussion_thread_for_october_05_2020/g7sef9s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601934921.0
    },
    {
        "author": "PM_ME_UR_THONG_N_ASS",
        "body": "lol gtfo of here with this \"penny stocks, FSLY, PRPL or you're a boomer\" shit.  I already listed two stocks (TSM and AVGO) that boomers and this retarded sub have no clue about.",
        "created_utc": 1602961810,
        "id": "g94pb3y",
        "permalink": "/r/wallstreetbets/comments/jcttss/most_anticipated_earnings_releases_for_the_week/g94pb3y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602990610.0
    },
    {
        "author": "ixamnis",
        "body": "ETFs help you diversify and by picking the right ETFs or the right mix of ETFs you should be able to at least keep pace with the market and in many cases beat the market.\n\nPeople buy individual stocks for a variety of reasons, but mostly the goal is to significantly beat the market.  Over the last 20 years, if you owned stocks in companies like Apple, Amazon, Netflix, Google, Facebook, Home Depot, Lowes, Monster Beverage Co, Tractor Supply, Old Dominion Freight, Altria Group, Market Axess, Broadcom, United Rentals, Nvidia, Ross, Fortinet, Cintas, O'Reilly Automotive, etc .... you would have significantly outperformed the market and all ETFs.\n\n* ETFs for diversification and to make sure you keep pace with the market (or better)\n* individual stocks for better overall growth or for better dividends\n\nThat said, yes, you can have a great portfolio of just ETFs.",
        "created_utc": 1601643334,
        "id": "g7ebhpo",
        "permalink": "/r/stocks/comments/j3ttoc/why_do_people_stock_pick_opposed_to_buying_into/g7ebhpo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601672134.0
    },
    {
        "author": "caezar-salad",
        "body": "amd stmp ups amzn aapl avgo ba ual",
        "created_utc": 1601964380,
        "id": "g7ve060",
        "permalink": "/r/wallstreetbets/comments/j5qsww/what_are_your_moves_tomorrow_october_06_2020/g7ve060/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601993180.0
    },
    {
        "author": "AccomplishedWin2",
        "body": "Look dude, I will give you a short list of sectors. However, I wouldn't be full on stocks that did great in the 1st round of covid in spring (like zoom) cuz people got used to this shit and there is not a lot of space to grow. Take zoom for exemple. Now everybody is using it and those who dont wont convert (like most of the universities in EU. They make their courses on MSFT Teams or GOOGLE classroom cuz Zoom is shitty). \n\nNow, here's the list:\n\n1. Retail (both online and physical): Walmart, Costco, Target, Amazon, Shopify, Etsy, Best Buy, Home Depot, Lowe's\n\n2. Construction: DR Horton, TOLL Brothers due to low interest rates \n\n3. Materials: only wood shit or lithium if you are risky af. Silver and gold suck atm but will get a boost soon due to the stimulus\n\n4. Tech, semis, comms: (carefull with the FAANGs. Might get blown if Biden wins) Crowdstrike, Telekom, Verizon, NVIDIA, Intel, AMD, Skyworks, Broadcom, Keysight, Texas Instrumets, Taiwan Semi, you get the idea. Every 5G and powerfull cyber company. \n\n5. Consumer discretionary (if you are truly a bear and life sucks in COVID, quarantine shit, depression and you dont like easy money): General Mills, Pepsi, Cola, other bullshit like this\n\n6. This is my power move: Energy: EVERY FCKING THING THAT IS RENEWABLE ENERGY. Buy an etf and it should be all good. I have a position in one since last month, up 20%. \n\n7. Video Games: EA, Activision, Sony, MSFT, Ubisoft",
        "created_utc": 1601974470,
        "id": "g7vn581",
        "permalink": "/r/investing/comments/j5tasw/what_are_some_covid_safe_sectors/g7vn581/",
        "score": 1,
        "subreddit": "investing",
        "created": 1602003270.0
    },
    {
        "author": "ArsMedMD",
        "body": "AVGO as well.",
        "created_utc": 1602318006,
        "id": "g8aqysd",
        "permalink": "/r/wallstreetbets/comments/j811rd/share_your_dds_you_degenerates/g8aqysd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602346806.0
    },
    {
        "author": "yolowsblfg",
        "body": "wsb gone downhill..is no one 'investing' anymore?!\n\nthoughts on calls on baba? tsla? tenb? sq? avgo? crwd? yy?",
        "created_utc": 1602142867,
        "id": "g838a3f",
        "permalink": "/r/wallstreetbets/comments/j6ybvz/what_are_your_moves_tomorrow_october_08_2020/g838a3f/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602171667.0
    },
    {
        "author": "Ze_Schnitzler",
        "body": "30 y/o, $65k AUM between Roth IRA and individual accounts. Long time horizon (25+ years)-interested in best of breed stock picking for pure growth and dividend growth. I also do sector based ETF investing (\\~13.5% of portfolio right now, will increase in future) to increase exposures in particular sectors that I'm not familiar with to reduce risks associated with individual stock picking in those sectors. Rounding to nearest decimal point- may not quite add up to 100% but should give a decent picture of everything.\n\nCurrent Holdings (individual stocks) from highest to lowest:\n\nAAPL 12%\n\nAMD 10%\n\nAMZN 10%\n\nMSFT 7%\n\nNVDA 7%\n\nGOOG 4.5%\n\nNFLX 2.5%\n\nCOST 2.25%\n\nJPM 1.8%\n\nADBE 1.5%\n\nWMT 1.5%\n\nVZ 1.5%\n\nCAT 1.5%\n\nNEE 1.4%\n\nLOW 1.3%\n\nFDX 1.2%\n\nV 1.2%\n\nLMT 1.2%\n\nAVGO 1.1%\n\nABBV 1.%\n\nMCD 1%\n\nMMM 1%\n\nRS 1%\n\nMDT 1%\n\nUNP 1%\n\nHD 1%\n\nWM .9%\n\nPEP .9%\n\nUPS .8%\n\nBBY .7%\n\nJNJ .7%\n\nPG .6%\n\nCL .6%\n\nSQ .5% (want to increase to 1-1.5% but super expensive atm...)\n\nSJM .5%\n\nCMC .5%\n\nAXP .5%\n\nKMB .5%\n\nADM .4%\n\nTGT .2%\n\nCurrent Holdings (ETFs) from highest to lowest:\n\nVHT (Vanguard Healthcare) 4.1%\n\nVAW (Vanguard Materials) 3.2%\n\nVIS (Vanguard Industrials) 2.8%\n\nFNCL (Fidelity Financials) 1.9%\n\nFUTY (Fidelity Utilities) 1.4%%\n\nI invest \\~40-50% of my earned income on a biweekly basis so I'm constantly on the lookout for new opportunities. Currently on deck for me (in no particular order):\n\nInternational stocks (interested in TSMC, LVMH, ETFs )\n\nBonds (investment grade corporate debt and T-bills)--&gt; waiting for yields to be a little more favorable here... also something that I'll likely prioritize later in life for the reliable income.\n\nOther growth plays I'm interested in:\n\nDomestic consumer discretionary: LULU, TSLA\n\nGenetics\n\nAI/Robotics\n\nFintech\n\nClean energy tech.\n\nAny suggestions are appreciated with regard to the overall portfolio or companies I should start looking into in the aforementioned sectors. I know I am tech heavy, but I think that's appropriate given my age and longer time horizon...",
        "created_utc": 1602161317,
        "id": "g83qfzi",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g83qfzi/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602190117.0
    },
    {
        "author": "michellinThrow",
        "body": "Really needing assurance on what my portfolio should look like. Currently it is:\n\n30% Nasdaq e-series fund\n\n30% AMZN (Performing well)\n\n20% US Index e-series fund\n\n5% TSLA\n\n5% Renewables and EV\n\n5% Natural Gas (Performing really bad)\n\n5% AVGO Broadcam 5g supplier\n\n&amp;#x200B;\n\nEdit: Have lost 1k after holding small cap stocks",
        "created_utc": 1601658895,
        "id": "g7f4lqk",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g7f4lqk/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601687695.0
    },
    {
        "author": "Codayyyyy",
        "body": "I had no clue about AVGO, looks promising to me. Stock is slightly slipping right now so I'll definitely keep my out for a time to buy (currently have all chips on TSLA).",
        "created_utc": 1602974146,
        "id": "g95equ4",
        "permalink": "/r/wallstreetbets/comments/jcttss/most_anticipated_earnings_releases_for_the_week/g95equ4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603002946.0
    },
    {
        "author": "GuyManGuy24",
        "body": "Hey guys I'm new to investing and I have created a shortlist for some stocks I've been watching. They are listed in no particular order. I would love to know your thoughts on them!\n\n1. PYPL ------&gt;\n2.  SPGI ------ &gt;\n3. NVDA -----&gt;\n4. AVGO -----&gt;\n5. ABBV ------&gt;\n6. NKE -------&gt;",
        "created_utc": 1603044012,
        "id": "g98qn97",
        "permalink": "/r/investing/comments/jdfae5/daily_advice_thread_all_basic_help_or_advice/g98qn97/",
        "score": 1,
        "subreddit": "investing",
        "created": 1603072812.0
    },
    {
        "author": "GuyManGuy24",
        "body": "Thank you for your input! What are your thoughts on:\n(1) PYPL,  (2)  SPGI,  (3) NVDA, (4) AVGO",
        "created_utc": 1603044627,
        "id": "g98rxn6",
        "permalink": "/r/investing/comments/jcu1bj/daily_advice_thread_all_basic_help_or_advice/g98rxn6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1603073427.0
    },
    {
        "author": "azwel",
        "body": "Adobe, Nvidia, avgo, zoom..    Great growth stocks.  Just as good as the faang without the spotlight",
        "created_utc": 1603242435,
        "id": "g9hvnnf",
        "permalink": "/r/stocks/comments/jexqlk/20k_to_invest_need_advice_on_stock_to_buy/g9hvnnf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603271235.0
    },
    {
        "author": "azwel",
        "body": "Nvidia. Adobe..Avgo.  Then Google Amazon tesla etc",
        "created_utc": 1603102671,
        "id": "g9b6mee",
        "permalink": "/r/stocks/comments/jdu85d/growth_stocks_or_high_div/g9b6mee/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603131471.0
    },
    {
        "author": "Papa2Hunt19",
        "body": "For sure bro. Im playing super conservatively until i learn alot more, but im also starting to wrap my mind around losing. As of right now my Amazon and broadcom have been successful for me. Its been a good way to start.",
        "created_utc": 1602589635,
        "id": "g8omtm9",
        "permalink": "/r/stocks/comments/j9rfq2/if_you_could_only_invest_in_1_stock_for_the_next/g8omtm9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602618435.0
    },
    {
        "author": "95Daphne",
        "body": "I like AVGO a lot but it's already ran pretty hot.\n\nPersonally, one of the stocks I've started to watch to possibly add is TXN, I would've never figured that they do the things that they do, I thought it was mainly a calculators company lol. They're also a semiconductor sector stock.",
        "created_utc": 1603729599,
        "id": "ga6hovr",
        "permalink": "/r/stocks/comments/jiaoqf/rstocks_daily_discussion_monday_oct_26_2020/ga6hovr/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1603758399.0
    },
    {
        "author": "GardinerAndrew",
        "body": "I have been looking into NEE, PI and AVGO. My favorite out of those though is NEE. 12 straight years of positive returns. Focuses on cheap clean energy.",
        "created_utc": 1601783928,
        "id": "g7m2jvp",
        "permalink": "/r/stocks/comments/j4o457/strong_nontech_buys/g7m2jvp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601812728.0
    },
    {
        "author": "R4N7",
        "body": "Hi! \n\nI was basically you 2 years ago. (27 years old, resident of Latvia, started investing into US stocks with Interactive Brokers)\n\nMy strategy was also pretty similar: part of portfolio in ETF (S&amp;P 500 ETF=VUSA) + blue chips from different sectors with few dividends, like you said  \"my own little \"ETF '. I like your picks, I started with few of them: MSFT, AAPL, NKE + many others like Google, Visa, Mastercard, Johnson&amp;Johnson, Activision Blizzard, Sony, and United Health.\n\nAfter 2 years I have pretty diversified by sectors (mostly Tech tho) portfolio of 23 stocks (75%) +  ETF VUSA (25%). Learned a lot of about stock market through this period of time. \n\n&amp;#x200B;\n\n&gt; I'm still undecided on Intel, Broadcom, Brookfield Renewables, Bank of America, Next Era Energy, Duke, Southern, Welltower, Toronto Dominion and Caterpillar. \n\nI really like INTC (bought after the dip) currently my biggest position, also similar stock is Cisco (also good % of my portfolio) if you like some kind of undervalued stock. \n\nBroadcom might be good buy too. \n\nBrookfield Renewables - I have no idea, but I hold Renewable Energy Group (REGI) stock as my pick for that sector. \n\nBank of America - I like it, even tho I have bought JPMorgan instead but I believe they are pretty similar fundamentally +similar price graphic. \n\nNext Era Energy - was considered to buy, but price was always too high for me lol\n\nDuke, Southern, Welltower, Toronto Dominion - Have no idea.\n\nCaterpillar - was considered to buy year ago, but not anymore.\n\n&amp;#x200B;\n\n&gt;my strategy about 20% tech 20% real estate 15% consumer 10% Finance 10% healthcare 5% telecom, 10% utilities and 10% Industrials. \n\nThat's pretty solid. \n\n&amp;#x200B;\n\n&gt; I also plan on buying some Polish dividend stocks since its my original currency :D \n\nLet me guess,  CDR is one of them? )) \n\n\\--------\n\nOne of the things I changed in my strategy after 2 years are dividend stocks. I used to super like them but after few researches/reads and comparing historical returns of VYM (dividend stocks index) vs S&amp;P500 returns I see lower profitability for the price of constant income (dividends) which I will reinvest back to the market. If you're 55+ years old then ofc you would prefer it vs growth.",
        "created_utc": 1601905316,
        "id": "g7sd2y7",
        "permalink": "/r/investing/comments/j5g9wg/my_investing_strategy/g7sd2y7/",
        "score": 1,
        "subreddit": "investing",
        "created": 1601934116.0
    },
    {
        "author": "GuyManGuy24",
        "body": "Hey guys I'm new to investing and I have created a shortlist for some stocks I've been watching. They are listed in no particular order. I am 20, relatively risk-tolerant, and I am looking to invest a few thousand dollars to start. I plan to hold for at least 5 years. Are there any stocks in this list that seem particularly interesting to you? As a young person, Paypal (and Venmo which it owns) seems to have become a bit of a staple in my generation's life. I am seeing more and more people get Venmo cards as people seem to be putting off credit cards as there is already enough debt to worry about when it comes to the cost of college. Anyway, I would love to know your thoughts on them!\n\n1. PYPL ------&gt;\n2. SPGI ------ &gt;\n3. NVDA -----&gt;\n4. AVGO -----&gt;\n5. ABBV ------&gt;\n6. NKE -------&gt;",
        "created_utc": 1603051269,
        "id": "g995kjx",
        "permalink": "/r/investing/comments/jdfae5/daily_advice_thread_all_basic_help_or_advice/g995kjx/",
        "score": 1,
        "subreddit": "investing",
        "created": 1603080069.0
    },
    {
        "author": "LePootPootJames",
        "body": "&gt; **AAPL**, TSM, **AMZN**, **BABA**, AVGO\n\nThese are meme stocks. You are just as retarded as the rest of us. At one point, even AVGO was a meme stock.",
        "created_utc": 1602972958,
        "id": "g95cdzm",
        "permalink": "/r/wallstreetbets/comments/jcttss/most_anticipated_earnings_releases_for_the_week/g95cdzm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603001758.0
    },
    {
        "author": "Zero_Capital",
        "body": "It makes sense for AAPL's IV to drop in the past 20 days, because they had a release event for the iPhone 12. The market typically prices some additional variance into options for events like that, then the variance deflates when the event passes. We still haven't gotten a teardown for the internals, but that will have more of an impact on companies like AVGO and QCOM than on AAPL itself.\n\nUsually, when single name vols get cheaper while VIX stays constant (or increases), that means the market is increasing its expectation of a correlated move. This would make sense right now, considering that everyone is paying attention to stimulus and the election.",
        "created_utc": 1603277479,
        "id": "g9j1u4o",
        "permalink": "/r/options/comments/jdul03/options_questions_safe_haven_thread_oct_1925_2020/g9j1u4o/",
        "score": 1,
        "subreddit": "options",
        "created": 1603306279.0
    },
    {
        "author": "lurkingsince2006",
        "body": "PRPL.   All in using borrowed money.\n\nMy other winning plays early on were playing the Pillpack acquisition drop on CVS and WGA, playing the Broadcom failed acquisition drop, and playing the Johnson and Johnson lawsuit.\n\nThis was only to get wiped out by a large play on IQ, which would have worked had Trump not tweeted.\n\nI went all in on PRPL and ignored the market for a while.   I’ve been making plays since COVID, but nothing near this level.",
        "created_utc": 1602887225,
        "id": "g91rkmq",
        "permalink": "/r/wallstreetbets/comments/jcbj0n/final_score_on_prplw_32m_gain/g91rkmq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602916025.0
    },
    {
        "author": "PROSTARR",
        "body": "a few breakout plays - AVGO, CRWD, HD",
        "created_utc": 1602242637,
        "id": "g87f4ub",
        "permalink": "/r/wallstreetbets/comments/j7wdaz/daily_discussion_thread_for_october_09_2020/g87f4ub/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602271437.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "AVGO might.  I put more trust in semiconductors than I do sugar water though.  Hock Tan is a good CEO as well.",
        "created_utc": 1602253538,
        "id": "g87w2vx",
        "permalink": "/r/stocks/comments/j7x6qg/10k_in_cocacolako_drip_and_just_come_back_in_20/g87w2vx/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602282338.0
    },
    {
        "author": "Fragglepusss",
        "body": "That's a disaster scenario that is not impossible but I think it's far less likely than a US tech crash. TSM and AVGO hedge the Chinese shit except if China attacks Taiwan but if that happens I'll be more worried about World War 3 than my Robinhood account.",
        "created_utc": 1602785703,
        "id": "g8x7peu",
        "permalink": "/r/wallstreetbets/comments/jbpt6f/im_getting_the_fuck_out_of_us_companies_asia_will/g8x7peu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602814503.0
    },
    {
        "author": "Puk3s",
        "body": "AVGO when they bought broadcom (and renamed from avago to broadcom).",
        "created_utc": 1603804836,
        "id": "ga9pnrg",
        "permalink": "/r/investing/comments/jiytir/amd_to_acquire_xilinx_creating_the_industrys_high/ga9pnrg/",
        "score": 1,
        "subreddit": "investing",
        "created": 1603833636.0
    }
]