[
    {
        "author": "KristynaKorbelova",
        "body": "He wrote this in a letter to Lion Philips of Aachen in 1864. It was also published in this book:  Francis Wheen's biography Karl Marx: A Life (W. W. Norton, 2000)",
        "created_utc": 1602445003,
        "id": "g8imyzd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602473803.0
    },
    {
        "author": "Bandeeznutz",
        "body": "NLOK",
        "created_utc": 1602042131,
        "id": "g7yxshr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602070931.0
    },
    {
        "author": "BoonTobias",
        "body": "I have to get in arguments with my boss because he insists on buying norton",
        "created_utc": 1603450144,
        "id": "g9qvx5i",
        "score": 1,
        "subreddit": "investing",
        "created": 1603478944.0
    },
    {
        "author": "Au_contraire_zippy",
        "body": "not as bad as norton",
        "created_utc": 1602685961,
        "id": "g8sryn6",
        "score": 1,
        "subreddit": "investing",
        "created": 1602714761.0
    },
    {
        "author": "Trading4Retirement",
        "body": "I understand what you’re saying, I do feel that NLOK should’ve been at the $22 mark by now. Given the amount of time I have left in the contract I have faith that it will climb again before Oct 16 but it won’t give me the necessary gain that I need in order to break even, which is why I was considering the double down in order to save my investment, Now I know this is a speculative on my part. I tried selling the other day at my risk tolerance which was 50% but I couldn’t bring myself to sell. I’m scared of the risk but I’m even more scared of selling and FOMO.\nThe visuals that you shared are amazing, I’ll be using that in the near future.\nAs for scaling into another position, I’ve made a play into BMY for Nov 20 $65 Call. But I don’t want to scale into anything else because the amount of buying power I have left is enough to double down on NLOK. Tough decisions lol",
        "created_utc": 1601764770,
        "id": "g7kistj",
        "score": 1,
        "subreddit": "options",
        "created": 1601793570.0
    },
    {
        "author": "Trading4Retirement",
        "body": "I need the communities advice on a play that I’m in. \nNLOK Oct 16 $22 Call, Ibhave 20 Contracts and the Average PP is $0.36.\nThinking of doubling down, what do you suggest?",
        "created_utc": 1601742451,
        "id": "g7iyckl",
        "score": 1,
        "subreddit": "options",
        "created": 1601771251.0
    },
    {
        "author": "w8w8dont",
        "body": "I feel like Edward Norton in the last scene of fight club. Watching society collapse around me and not giving af.",
        "created_utc": 1603883591,
        "id": "gadbcqp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603912391.0
    },
    {
        "author": "meepodota",
        "body": "the way I would approach it is, do you think NLOK will move at least 9% between now and expiration? That is about how much it has to move for you to reach breakeven $22.36 ($22 + $0.36). Ideally, you want it to rally way above/close before exp.\n\ncheck out this visual [http://opcalc.com/fcy](http://opcalc.com/fcy) Your trade will lose value to theta every day.\n\nIf you think this is a losing trade, doubling down would just add to your losses.\n\n\\`also, maybe not applicable to this trade, but instead of doubling down, you can look into scaling into a position\n\nfor example, I have been playing around with leap diagonals and I have a set amount I am willing to allot to it. I might put a couple on, if it moves in my favor, great. If not, I can average down as long as my assumption on the trade has not changed.",
        "created_utc": 1601755379,
        "id": "g7jrjpj",
        "score": 1,
        "subreddit": "options",
        "created": 1601784179.0
    },
    {
        "author": "buzztiga",
        "body": "Thanks... Look impressive BUT I got a question -- WTF is Google linking to article as below (assuming these are white scams/bullshits)?\n\n&gt;\" **The best antivirus 2020 in full:**  \n&gt;  \n&gt;**Bitdefender Antivirus**. Loaded with features, giving you rock-solid protection - 2020's best antivirus. ...  \n&gt;  \n&gt;**Norton AntiVirus**. Protection that won't slow you down. ...  \n&gt;  \n&gt;**Kaspersky Anti-Virus**. ...  \n&gt;  \n&gt;**Trend Micro Antivirus**. ...  \n&gt;  \n&gt;Avira antivirus. ...  \n&gt;  \n&gt;**Webroot SecureAnywhere AntiVirus**. ...  \n&gt;  \n&gt;**Avast antivirus**. ...  \n&gt;  \n&gt;**Sophos Home**.  \n&gt;  \n&gt;[https://www.techradar.com/best/best-antivirus](https://www.techradar.com/best/best-antivirus) \"\n\nHow is it possible these guys still in business? I mean there may a fool or two like me, but there can't be so many fools out there to sustain so many \"retail\" Anti Virus listed above?\n\nI seriously think the Fireeye isn't a perfect replacement for shits listed above... Otherwise, why wouldn't folks use free \"enterprise\" antivirus like Fire Eye (instead of paying for bullshits listed above? Why no one is talking about Fire Eye (this is the first time I ever heard of this name) - even Google doesn't know about it?\n\nwhat say you?",
        "created_utc": 1603386314,
        "id": "g9ny0v3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1603415114.0
    },
    {
        "author": "Bandeeznutz",
        "body": "NLOK is gearing up for a major move north",
        "created_utc": 1602520743,
        "id": "g8lsf6n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602549543.0
    },
    {
        "author": "Bandeeznutz",
        "body": "NLOK thank me later",
        "created_utc": 1602006297,
        "id": "g7wzqqn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602035097.0
    },
    {
        "author": "obnoxygen",
        "body": "didn't symantec buy that years ago? and now they're spinning it off?\n\nhmmmm.",
        "created_utc": 1602804021,
        "id": "g8y6n5u",
        "score": 1,
        "subreddit": "investing",
        "created": 1602832821.0
    }
]