[
    {
        "author": "Mynamejeff66666",
        "body": "Jerome is dazed some honorable bear slipped him some ambien and he’s fighting to stay awake with lines of coke and fistfuls of zebra cakes",
        "created_utc": 1586287266,
        "id": "fmptx2l",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1586316066.0
    },
    {
        "author": "bottleofwatee82",
        "body": "Fuck man I got blood on my zebra carpet",
        "created_utc": 1587591963,
        "id": "fo88ruv",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1587620763.0
    },
    {
        "author": "Drunk_Logicist",
        "body": "Everyone see this Zebra tail? Looks like a giraffe neck forming on the 28 second candle. Lions beware. Sideways incoming.",
        "created_utc": 1585942828,
        "id": "fmcc3fi",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1585971628.0
    },
    {
        "author": "lookbehindyou___",
        "body": "Yeah, I’ll figure it out, I use Zebra too, thanks for the help. I’ll see if there’s another tweak interfering.",
        "created_utc": 1586483820,
        "id": "fmydsud",
        "score": 2,
        "subreddit": "smallstreetbets",
        "created": 1586512620.0
    },
    {
        "author": "strideside",
        "body": "Ice Station Zebra",
        "created_utc": 1587439966,
        "id": "fo1rqqq",
        "score": 1,
        "subreddit": "investing",
        "created": 1587468766.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 28th of April\n\n\n\n## Upcoming events for Tuesday, April 28th\n\n - Stock splits:\n\n    - MLPA @ **1:6**\n    - GXG @ **1:4**\n    - GREK @ **1:3**\n    - PAK @ **1:4**\n\n - Expected earnings:\n\n  AAT, AB, ABB, ACA, AGR, AKAM, AKO.B, ALRS, AMD, AMTB, APAM, ARAY, AUB, AXE, BEDU, BFST, BP, BSBR, BUSE, BXMT, BXP, BYD, CAC, CALX, CAT, CBSH, CERN, CHE, CHRW, CIGI, CMI, CNC, CSGP, CTO, CYH, DCOM, DGICA, DHI, DTE, DXCM, EBMT, ECL, EHC, ENVA, F, FARO, FBC, FBNC, FCBC, FCF, FDEF, FELE, FEYE, FFIC, GFF, GLW, GOOD, GOOG, GOOGL, HA, HBCP, HELE, HIW, HOG, HOPE, HRZN, HWC, IBA, IQV, IRBT, IRDM, JNPR, KREF, KTCC, LBRT, LSCC, LUV, MASI, MDLZ, MEDP, MKSI, MMM, MPWR, MRC, MRCY, MRK, MSCI, MSTR, MTH, MXIM, NEO, NUE, NVS, OI, OKE, OMC, OXSQ, PAYC, PEP, PFE, PII, PJT, PPBI, PRGX, PROV, QCRH, RCKY, RNST, ROK, ROP, RRD, SBBX, SBCF, SBUX, SC, SFST, SIMO, SIRI, SMBK, SMED, SPGI, SPN, SSTK, SYX, TAL, TEL, TENB, THFF, THG, TNET, TPB, TRMK, TROW, TRU, TX, UBS, UEC, UMBF, UPS, VALE, VBTX, VET, WAT, WDR, WERN, WIRE, WNEB, WSBF, WW, XRX, YNDX, YUMC, ZBRA\n\n - Ex-div:\n\n  AMRB, ATR, CFG, ENTG, PBR, PBR.A, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 0.680%)\n    - API Weekly Crude Oil Stock (previous: 13.226M)\n    - CB Consumer Confidence (consensus: 87.9, previous: 120.0)\n    - Dallas Fed Services Revenues (previous: -67.0)\n    - Goods Trade Balance (previous: -59.89B)\n    - Redbook (previous: -10.6%)\n    - Redbook (previous: -6.9%)\n    - Retail Inventories Ex Auto (previous: 0.3%)\n    - Richmond Manufacturing Index (previous: 2)\n    - Richmond Manufacturing Shipments (previous: 13)\n    - Richmond Services Index (previous: 1)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 3.3%, previous: 3.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.0%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.4%, previous: 0.3%)\n    - Texas Services Sector Outlook (previous: -78.8)\n    - Wholesale Inventories (previous: -0.7%)\n\n## Upcoming events for Wednesday, April 29th\n\n - Stock splits:\n\n    - USO @ **1:8**\n\n - Expected earnings:\n\n  ADM, ADP, AEGN, AFL, AGI, AGNC, AIN, ALGN, ALGT, ALIM, ALKS, AM, AMSF, AMT, ANTM, APRN, AR, ARR, ATNI, ATRC, AVTR, AVY, AX, AZN, AZZ, BA, BANC, BCOV, BCS, BDC, BDGE, BHE, BKU, BMRN, BPFH, BRKL, BSAC, BSMX, BSX, BTU, BWFG, CACI, CADE, CAJ, CARO, CBNK, CCI, CCS, CFFN, CHCO, CHDN, CHMG, CKH, CLGX, CLH, CLS, CME, CMO, CMPR, CNMD, CNXN, CONE, COWN, CREE, CRTO, CVE, DB, DIN, DMRC, DRE, EAT, EBAY, EEFT, EPD, EQBK, EVBN, FB, FICO, FMBH, FMNB, FRTA, FSS, FTSI, GD, GE, GIB, GIL, GRMN, HAS, HBMD, HBNC, HCC, HCCI, HIG, HOLX, HTBI, HUM, IMUX, INOV, ISBC, JBT, JRVR, KAI, KLIC, KOF, KRA, KRC, LFUS, LH, LIVN, LN, MA, MANT, MAS, MGRC, MHH, MHO, MKTX, MOBL, MPW, MPX, MSA, MSFT, MTSI, MVIS, MXL, MYRG, NFBK, NGD, NGHC, NGVT, NLY, NOC, NOW, NSC, NVT, NWBI, NYCB, OC, OFG, OIS, OLN, OMAB, ORN, OSK, PB, PDM, PEGA, PGRE, PPC, PRI, PS, PSB, PTC, QCOM, QEP, QMCO, R, RES, RIG, RJF, ROL, RRBI, RYN, SAH, SAIA, SCI, SHW, SI, SITE, SLAB, SMMT, SPOT, SRDX, ST, STRA, SUM, SXC, SXT, TDOC, TRN, TSLA, TTEK, TTMI, TUP, TYL, UCTT, UE, URI, UTHR, VLO, VRTX, WHD, WPG, WRTC, YUM, ZVO\n\n - Ex-div:\n\n  AEO, AGNC, AM, AOS, ARC, BMTC, BPMP, BRMK, BSRR, CAG, CRT, DNP, EFC, EPD, EPR, ERF, EV, FRC, FT, GECC, GRP.U, KFFB, LNT, MS, MSB, MTR, NI, NNN, NWN, OHI, ORC, PBT, PSEC, PVBC, PVL, RBB, REVG, SCHL, SJT, SKT, SLG, SQM, STAG, TX, VOC, VRTS\n\n - Economic events and announcements:\n\n    - Core PCE Prices (consensus: 1.40%, previous: 1.30%)\n    - Crude Oil Imports (previous: -0.197M)\n    - Crude Oil Inventories (consensus: 10.600M, previous: 15.022M)\n    - Cushing Crude Oil Inventories (previous: 4.776M)\n    - Distillate Fuel Production (previous: 0.080M)\n    - EIA Refinery Crude Runs  (previous: -0.209M)\n    - EIA Weekly Distillates Stocks (consensus: 3.750M, previous: 7.876M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.5%, previous: -1.5%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - GDP (consensus: -4.0%, previous: 2.1%)\n    - GDP Price Index (consensus: 1.2%, previous: 1.4%)\n    - GDP Sales (consensus: 2.1%, previous: 3.1%)\n    - Gasoline Inventories (consensus: 2.673M, previous: 1.017M)\n    - Gasoline Production (previous: 0.290M)\n    - Heating Oil Stockpiles (previous: 0.250M)\n    - MBA 30-Year Mortgage Rate (previous: 3.45%)\n    - MBA Mortgage Applications (previous: -0.3%)\n    - MBA Purchase Index (previous: 186.4)\n    - Mortgage Market Index (previous: 768.5)\n    - Mortgage Refinance Index (previous: 4,206.7)\n    - PCE Prices (previous: 1.4%)\n    - Pending Home Sales (consensus: -10.0%, previous: 2.4%)\n    - Pending Home Sales Index (previous: 111.5)\n    - Real Consumer Spending (previous: 1.8%)\n    - Seevol Cushing Storage Report (previous: 5.350M)\n\n## Upcoming events for Thursday, April 30th\n\n - Expected earnings:\n\n  AAL, AAPL, ABMD, ABTX, AEM, AGIO, AHH, AIMC, AIT, AJG, ALEX, AMAL, AMGN, AMZN, AQMS, ARW, ASGN, ASPN, ATOM, ATR, ATUS, AUY, BAND, BAX, BBD, BC, BCBP, BEN, BL, BLDR, BPMX, BPOP, BRKS, BSVN, BY, BZH, CASA, CBTX, CDNA, CFR, CG, CHD, CHT, CI, CMCSA, CNCE, CNOB, CNSL, CODI, COG, COLB, COLM, COOP, COP, COR, CRAI, CRVS, CRY, CURO, CUZ, CWT, CXO, CXP, DAN, DCO, DNKN, DOW, EBS, EGO, EGP, EIGI, EIX, EKSO, EME, EMN, ERII, ESI, ETN, EVA, EXPO, FBHS, FBP, FCN, FDUS, FHI, FIBK, FISI, FLWS, FMBI, FMX, FND, FRG, FSP, FTAI, FTV, FWRD, GEO, GHL, GILD, GLPI, GNCA, GNRC, GRA, GT, GWB, HAFC, HBI, HBT, HFWA, HGV, HONE, HP, HTH, HUBB, HUBG, HURN, IBCP, ICBK, ICE, IDA, IDXX, ILMN, ILPT, IMAX, IMXI, INSM, INT, IP, IRMD, ISDR, JHG, K, KHC, KNSL, LAWS, LAZ, LFC, LKQ, LMAT, LNG, LNTH, LOCO, LPLA, MCD, MCO, MERC, MGM, MGPI, MITK, MMC, MO, MOH, MRLN, MTLS, MTOR, MTX, MTZ, MYFW, NATI, NCR, NLSN, NOK, NPTN, NTB, NTUS, NVCR, NVST, OFC, ONDK, ORBC, ORC, OTEX, PATK, PDS, PFS, PH, PNR, PRAH, PRGO, PRLB, PSA, PTCT, PVG, PXLW, RDS.A, REGI, RMD, RNGR, ROG, RRC, SEM, SFE, SGC, SGEN, SILK, SITC, SIX, SNDR, SO, SPB, SPFI, SPSC, SPXC, SSI, SSNC, STAG, STAR, STBA, SWI, SWK, SWN, SYK, SYNH, TAP, TBBK, TEAM, TECH, TEX, TFX, TIGO, TNDM, TPR, TPX, TRS, TRUP, TWOU, TWTR, TXT, UAL, ULH, USX, UTL, V, VAL, VC, VICI, VKTX, VLY, VRAY, WCC, WDC, WHR, WK, WLTW, X, ZEN\n\n - Ex-div:\n\n  AES, ALLY, ATLO, AVAL, BMO, BMRC, CASY, CCLP, CFFN, CNBKA, COST, CSWI, CVCY, DCP, DGICA, DGICB, ENLC, FRAF, GEL, GLP, GPP, HAS, KNOP, LCUT, MCBS, NRG, O, OSBC, PAA, PAGP, PBCT, PCAR, PLBC, PNFP, PNM, PSXP, PZN, SNY, TCP, TGP, TRGP, WES\n\n - Economic events and announcements:\n\n    - Core PCE Prices (consensus: 1.40%, previous: 1.30%)\n    - Crude Oil Imports (previous: -0.197M)\n    - Crude Oil Inventories (consensus: 10.600M, previous: 15.022M)\n    - Cushing Crude Oil Inventories (previous: 4.776M)\n    - Distillate Fuel Production (previous: 0.080M)\n    - EIA Refinery Crude Runs  (previous: -0.209M)\n    - EIA Weekly Distillates Stocks (consensus: 3.750M, previous: 7.876M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.5%, previous: -1.5%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - GDP (consensus: -4.0%, previous: 2.1%)\n    - GDP Price Index (consensus: 1.2%, previous: 1.4%)\n    - GDP Sales (consensus: 2.1%, previous: 3.1%)\n    - Gasoline Inventories (consensus: 2.673M, previous: 1.017M)\n    - Gasoline Production (previous: 0.290M)\n    - Heating Oil Stockpiles (previous: 0.250M)\n    - MBA 30-Year Mortgage Rate (previous: 3.45%)\n    - MBA Mortgage Applications (previous: -0.3%)\n    - MBA Purchase Index (previous: 186.4)\n    - Mortgage Market Index (previous: 768.5)\n    - Mortgage Refinance Index (previous: 4,206.7)\n    - PCE Prices (previous: 1.4%)\n    - Pending Home Sales (consensus: -10.0%, previous: 2.4%)\n    - Pending Home Sales Index (previous: 111.5)\n    - Real Consumer Spending (previous: 1.8%)\n    - Seevol Cushing Storage Report (previous: 5.350M)\n\n## Upcoming events for Friday, May  1st\n\n - Stock splits:\n\n    - NDP @ **1:8**\n    - TYG @ **1:4**\n    - NTG @ **1:10**\n    - TTP @ **1:4**\n\n - Expected earnings:\n\n  ABBV, AFI, AON, APO, ASIX, BBDC, BCPC, BERY, BRK.A, BRK.B, CBOE, CCJ, CHTR, CL, CLX, CVX, DISH, EL, FCCY, GLYC, HON, HRC, HSBC, HUN, IMGN, IMO, ITT, JCI, KOP, LYB, MGI, MINI, MMP, NMM, NVO, NWL, OFS, OPI, PACB, PIPR, PSX, PSXP, QSR, RBS, RUTH, RYTM, SLCA, SNR, TKR, TRP, URG, VRTS, WETF, WPC, WSC, WY, XOM, XRAY, ZEUS\n\n - Ex-div:\n\n  ASRV, BKEP, BX, C, CANG, CMCO, DMLP, EVTC, EWBC, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, HEP, HESM, IGD, IID, ITUB, KMI, KOF, LMRK, LYTS, MATW, MC, MCI, NSEC, OCFC, ORRF, PEBO, PNW, PUB, SBNY, SBS, SGU, TXN, WABC, WSR\n\n - Economic events and announcements:\n\n    - All Car Sales (previous: 2.86M)\n    - CFTC Aluminium speculative net positions (previous: 79.6K)\n    - CFTC Copper speculative net positions (previous: -25.6K)\n    - CFTC Corn speculative net positions (previous: -55.8K)\n    - CFTC Crude Oil speculative net positions (previous: 484.9K)\n    - CFTC Gold speculative net positions (previous: 248.9K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 14.0K)\n    - CFTC Natural Gas speculative net positions (previous: -108.4K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -140.0K)\n    - CFTC Silver speculative net positions (previous: 29.7K)\n    - CFTC Soybeans speculative net positions (previous: 93.1K)\n    - CFTC Wheat speculative net positions (previous: 35.7K)\n    - Construction Spending (consensus: -3.5%, previous: -1.3%)\n    - ISM Manufacturing Employment (consensus: 37.0, previous: 43.8)\n    - ISM Manufacturing New Orders Index (previous: 42.2)\n    - ISM Manufacturing PMI (consensus: 36.9, previous: 49.1)\n    - ISM Manufacturing Prices (consensus: 35.0, previous: 37.4)\n    - Manufacturing PMI (consensus: 36.9, previous: 36.9)\n    - U.S. Baker Hughes Oil Rig Count (previous: 378)\n    - U.S. Baker Hughes Total Rig Count (previous: 465)\n\n^^^^2020-04-28",
        "created_utc": 1588068014,
        "id": "fotvwgi",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1588096814.0
    },
    {
        "author": "dvdmovie1",
        "body": "\"You think they won't realize how much money they can save on rent by just making everyone work from home permanently (essentially making employees shoulder their rent costs)?\"\n\nI agree with this and I think FIVN is something that will benefit in terms of call center employees working from home for the reasons you mention - now the employer isn't paying rent and utilities, the employee is.\n\n\"Malls/retail - no one is going to risk their life to go shopping when they can just order from home, COVID-19 is just accelerating the death of brick-and-mortar retail.\"\n\nI don't think malls/retail are going away entirely but the gradual decline in a number of retail sectors that might have gone on for another few years is going to be compressed into a far shorter time period. The bigger retailers wind up bigger and stronger after this and I think you're going to see an increasing amount of retail stores be treated like hybrid store/\"last mile fulfillment centers\" - Target and Walmart are already doing this, to great success. I think ZBRA is something that may benefit from this (an increasing amount of \"ship from store\", \"drive-up pick-up\", etc) Target uses Zebra products for this, I believe Loews and others do, too.",
        "created_utc": 1587823349,
        "id": "fojkln7",
        "score": 1,
        "subreddit": "investing",
        "created": 1587852149.0
    },
    {
        "author": "GromGrommeta",
        "body": "I mean look at Disney's ER for an example of why people would buy today. It's a pretty easy answer right? Either they hope to make money short-term or long-term.\n\nLong-term you got some companies with a lot of good things going on trading at a discount. DIS is more than parks, and streaming is really what was moving the stock price even before the crisis. Good streaming results outweigh the known loss of park revenue, go figure.\n\nToday I bought a bit of JPM, MCD and ZBRA, companies I already owned small amounts of before the crisis. Could they go lower? Sure, but I have absolute confidence in their continued relevance and success going forward.",
        "created_utc": 1586388906,
        "id": "fmucuse",
        "score": 1,
        "subreddit": "investing",
        "created": 1586417706.0
    },
    {
        "author": "imasensation",
        "body": "That’s so sad. I wish it worked for you! I’m on the XS Max 13.3 and I installed it using Zebra package manager. Maybe another tweak running is interfering?",
        "created_utc": 1586483741,
        "id": "fmydodh",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1586512541.0
    },
    {
        "author": "whofcentury",
        "body": "Yellow Zebra is the new Bull",
        "created_utc": 1586272398,
        "id": "fmp143a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1586301198.0
    },
    {
        "author": "clutchonthefly",
        "body": "looks like tomorrow is gonna be REDDER than a bloody zebra",
        "created_utc": 1588281014,
        "id": "fp3kq4u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588309814.0
    },
    {
        "author": "natelrevoh",
        "body": "Liz Dierking and Jenny Andrews. They have a show called The LIZ &amp; JNY. Part of the tastytrade network. They have some pretty innovative strategies. Jade lizards are their classic trade. They also have an interesting trade called a ZEBRA, which is a Zero Extrinsic Back RAtio. The concept is to place a back ratio without paying any Extrinsic value for the position, creating a nifty stock replacement strategy. I am no expert on these though, so you'll need to learn about them from the source. You can search for their content in the archives on tastytrade.",
        "created_utc": 1586675579,
        "id": "fn5tqro",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1586704379.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 27th of April\n\n\n\n## Upcoming events for Monday, April 27th\n\n - Expected earnings:\n\n  AMCR, AMG, AMKR, APY, ARE, AVT, AWI, BANR, BRO, BSGM, CATY, CE, CGNX, CHKP, CINF, CMRE, CMS, CNI, CNX, CNXM, CR, CSTR, DORM, EGOV, FBK, FBMS, FFIV, FRBA, FSB, GAIA, HLIT, HMST, HSII, HSTM, HTLF, IBTX, IVAC, JJSF, KDP, LECO, LKFN, LRN, LXFR, LXRX, MBCN, NBTB, NOV, NXPI, OGS, OMF, PCH, PFG, PI, PINE, PIXY, PKG, PMBC, PPG, QTS, RBNC, SANM, SMBC, SSD, STL, TCF, TCFC, UHS, USAU, UVE, WASH, WSBC, WSFS\n\n - Ex-div:\n\n  BK, CVLY, FAST, SAFM\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.398%)\n    - 3-Month Bill Auction (previous: 0.125%)\n    - 5-Year Note Auction (previous: 0.535%)\n    - 6-Month Bill Auction (previous: 0.145%)\n    - Dallas Fed Mfg Business Index (previous: -70.0)\n    - Investing.com Gold Index (actual: 52.8%, previous: 51.6%)\n    - Investing.com S&amp;P 500 Index (actual: 27.2%, previous: 16.9%)\n\n## Upcoming events for Tuesday, April 28th\n\n - Stock splits:\n\n    - MLPA @ **1:6**\n    - GXG @ **1:4**\n    - GREK @ **1:3**\n    - PAK @ **1:4**\n\n - Expected earnings:\n\n  AAT, AB, ABB, ACA, AGR, AKAM, AKO.B, ALRS, AMD, AMTB, APAM, ARAY, AUB, AXE, BEDU, BFST, BP, BSBR, BUSE, BXMT, BXP, BYD, CAC, CALX, CAT, CBSH, CERN, CHE, CHRW, CIGI, CMI, CNC, CSGP, CTO, CYH, DCOM, DGICA, DHI, DTE, DXCM, EBMT, ECL, EHC, ENVA, F, FARO, FBC, FBNC, FCBC, FCF, FDEF, FELE, FEYE, FFIC, GFF, GLW, GOOD, GOOG, GOOGL, HA, HBCP, HELE, HIW, HOG, HOPE, HRZN, HWC, IBA, IQV, IRBT, IRDM, JNPR, KREF, KTCC, LBRT, LSCC, LUV, MASI, MDLZ, MEDP, MFSF, MKSI, MMM, MPWR, MRC, MRCY, MRK, MSCI, MSTR, MTH, MXIM, NEO, NUE, NVS, OI, OKE, OMC, OXSQ, PAYC, PEP, PFE, PII, PJT, PPBI, PRGX, PROV, QCRH, RCKY, RNST, ROK, ROP, RRD, SBBX, SBCF, SBUX, SC, SFST, SIMO, SIRI, SMBK, SMED, SPGI, SPN, SSTK, SYX, TAL, TEL, TENB, THFF, THG, TNET, TPB, TRMK, TROW, TRU, TX, UBS, UEC, UMBF, UPS, VALE, VBTX, VET, WAT, WDR, WERN, WIRE, WNEB, WSBF, WW, XRX, YNDX, YUMC, ZBRA\n\n - Ex-div:\n\n  AMRB, ATR, CFG, ENTG, PBR, PBR.A, VSEC\n\n - Economic events and announcements:\n\n    - 7-Year Note Auction (previous: 0.680%)\n    - API Weekly Crude Oil Stock (previous: 13.226M)\n    - CB Consumer Confidence (consensus: 88.0, previous: 120.0)\n    - Dallas Fed Services Revenues (previous: -67.0)\n    - Goods Trade Balance (previous: -59.89B)\n    - Redbook (previous: -10.6%)\n    - Redbook (previous: -6.9%)\n    - Retail Inventories Ex Auto (previous: 0.3%)\n    - Richmond Manufacturing Index (previous: 2)\n    - Richmond Manufacturing Shipments (previous: 13)\n    - Richmond Services Index (previous: 1)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 3.3%, previous: 3.1%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.0%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 0.4%, previous: 0.3%)\n    - Texas Services Sector Outlook (previous: -78.8)\n    - Wholesale Inventories (previous: -0.7%)\n\n## Upcoming events for Wednesday, April 29th\n\n - Stock splits:\n\n    - USO @ **1:8**\n\n - Expected earnings:\n\n  ADM, ADP, AEGN, AFL, AGI, AGNC, AIN, ALGN, ALKS, AM, AMSF, AMT, ANTM, APRN, AR, ATNI, ATRC, AVTR, AVY, AX, AZN, AZZ, BA, BANC, BCOV, BCS, BDC, BDGE, BKU, BMRN, BPFH, BRKL, BSAC, BSMX, BSX, BTU, CACI, CADE, CCI, CCS, CFFN, CHCO, CHDN, CHMG, CLH, CLS, CME, CMO, CMPR, CNMD, CNXN, CONE, COWN, CREE, CRTO, CVE, DIN, DMRC, DRE, EAT, EBAY, EEFT, EPD, EQBK, EVBN, FB, FICO, FRTA, FSS, FTSI, GD, GE, GIB, GIL, GRMN, HAS, HBMD, HBNC, HCC, HCCI, HIG, HOLX, HUM, IMUX, INOV, ISBC, JRVR, KLIC, KOF, KRA, KRC, LFUS, LH, LIVN, MA, MANT, MAS, MGRC, MHH, MHO, MKTX, MOBL, MPX, MSFT, MTSI, MVIS, MXL, MYRG, NGD, NGHC, NGVT, NLY, NOC, NOW, NSC, NVT, NWBI, NYCB, OC, OFG, OLN, ORN, OSK, PB, PDM, PEGA, PGRE, PPC, PRI, PS, PSB, PTC, QCOM, QEP, QMCO, R, RES, RIG, RJF, ROL, RRBI, RYN, SAH, SAIA, SCI, SHW, SITE, SLAB, SMMT, SPOT, SRDX, ST, STRA, SUM, SXT, TDOC, TRN, TSLA, TTEK, TTMI, TUP, TYL, UCTT, UE, URI, UTHR, VLO, VRTX, WHD, WRTC, YUM\n\n - Ex-div:\n\n  AEO, AGNC, AM, AOS, ARC, BMTC, BPMP, BRMK, BSRR, CAG, CRT, DNP, EFC, EPD, EPR, ERF, EV, FRC, FT, GECC, GRP.U, KFFB, LNT, MS, MSB, MTR, NI, NNN, NWN, OHI, ORC, PBT, PSEC, PVBC, PVL, RBB, REVG, SCHL, SJT, SKT, SQM, STAG, TX, VOC, VRTS\n\n - Economic events and announcements:\n\n    - Core PCE Prices (consensus: 1.60%, previous: 1.30%)\n    - Crude Oil Imports (previous: -0.197M)\n    - Crude Oil Inventories (consensus: 15.150M, previous: 15.022M)\n    - Cushing Crude Oil Inventories (previous: 4.776M)\n    - Distillate Fuel Production (previous: 0.080M)\n    - EIA Refinery Crude Runs  (previous: -0.209M)\n    - EIA Weekly Distillates Stocks (consensus: 2.750M, previous: 7.876M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -2.2%, previous: -1.5%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - GDP (consensus: -4.0%, previous: 2.1%)\n    - GDP Price Index (consensus: 1.2%, previous: 1.4%)\n    - GDP Sales (consensus: 2.1%, previous: 3.1%)\n    - Gasoline Inventories (consensus: 3.578M, previous: 1.017M)\n    - Gasoline Production (previous: 0.290M)\n    - Heating Oil Stockpiles (previous: 0.250M)\n    - MBA 30-Year Mortgage Rate (previous: 3.45%)\n    - MBA Mortgage Applications (previous: -0.3%)\n    - MBA Purchase Index (previous: 186.4)\n    - Mortgage Market Index (previous: 768.5)\n    - Mortgage Refinance Index (previous: 4,206.7)\n    - PCE Prices (previous: 1.4%)\n    - Pending Home Sales (consensus: -10.0%, previous: 2.4%)\n    - Pending Home Sales Index (previous: 111.5)\n    - Real Consumer Spending (previous: 1.8%)\n    - Seevol Cushing Storage Report (previous: 5.350M)\n\n## Upcoming events for Thursday, April 30th\n\n - Expected earnings:\n\n  AAL, AAPL, ABMD, ABTX, AEM, AGIO, AHH, AIMC, AIT, AJG, ALEX, AMAL, AMGN, AMZN, AQMS, ARW, ASGN, ASPN, ATOM, ATR, ATUS, AUY, BAND, BAX, BBD, BC, BCBP, BEN, BL, BLDR, BPMX, BPOP, BRKS, BSVN, BY, BZH, CASA, CBTX, CDNA, CFR, CG, CHD, CHT, CI, CMCSA, CNCE, CNOB, CNSL, CODI, COG, COLB, COLM, COOP, COP, COR, CRAI, CRVS, CRY, CURO, CUZ, CWT, CXO, CXP, DAN, DCO, DNKN, DOW, EBS, EGO, EGP, EIGI, EIX, EKSO, EME, EMN, ERII, ESI, ETN, EVA, EXPO, FBHS, FBP, FCN, FDUS, FHI, FIBK, FISI, FLWS, FMBI, FMX, FND, FRG, FSP, FTAI, FTV, FWRD, GEO, GHL, GILD, GLPI, GNCA, GNRC, GRA, GT, GWB, HAFC, HBI, HBT, HFWA, HGV, HONE, HP, HTH, HUBB, HUBG, HURN, IBCP, ICBK, ICE, IDA, IDXX, ILMN, ILPT, IMAX, IMXI, INSM, INT, IP, IRMD, ISDR, JHG, K, KHC, KNSL, LAWS, LAZ, LFC, LKQ, LMAT, LNG, LNTH, LOCO, LPLA, MCD, MCO, MERC, MGM, MGPI, MITK, MMC, MO, MOH, MRLN, MTLS, MTOR, MTX, MTZ, MYFW, NATI, NCR, NLSN, NOK, NPTN, NTB, NTUS, NVCR, NVST, OFC, ONDK, ORBC, ORC, OTEX, PATK, PDS, PFS, PH, PNR, PRAH, PRGO, PRLB, PSA, PTCT, PVG, PXLW, RDS.A, REGI, RMD, RNGR, ROG, RRC, SEM, SFE, SGC, SGEN, SILK, SITC, SIX, SNDR, SO, SPB, SPFI, SPSC, SPXC, SSI, SSNC, STAG, STAR, STBA, SWI, SWK, SWN, SYK, SYNH, TAP, TBBK, TEAM, TECH, TEX, TFX, TIGO, TNDM, TPR, TPX, TRS, TRUP, TWOU, TWTR, TXT, UAL, ULH, USX, UTL, V, VAL, VC, VICI, VKTX, VLY, VRAY, WCC, WDC, WHR, WK, WLTW, X, ZEN\n\n - Ex-div:\n\n  AES, ALLY, ATLO, AVAL, BMO, BMRC, CASY, CCLP, CFFN, CNBKA, COST, CSWI, CVCY, DCP, DGICA, DGICB, ENLC, FRAF, GEL, GLP, GPP, HAS, KNOP, LCUT, MCBS, NRG, O, OSBC, PAA, PAGP, PCAR, PLBC, PNFP, PNM, PSXP, PZN, SNY, TCP, TGP, TRGP, WES\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.120%)\n    - Chicago PMI (consensus: 37.9, previous: 47.8)\n    - Continuing Jobless Claims (consensus: 16,476K, previous: 15,976K)\n    - Core PCE Price Index (consensus: -0.1%, previous: 0.2%)\n    - Core PCE Price Index (consensus: 1.7%, previous: 1.8%)\n    - Dallas Fed PCE (previous: 1.40%)\n    - Employment Benefits (previous: 0.50%)\n    - Employment Cost Index (consensus: 0.7%, previous: 0.7%)\n    - Employment Wages (previous: 0.70%)\n    - Initial Jobless Claims (consensus: 3,500K, previous: 4,427K)\n    - Jobless Claims 4-Week Avg. (previous: 5,786.50K)\n    - Natural Gas Storage (previous: 43B)\n    - PCE Price index (previous: 1.8)\n    - PCE price index (previous: 0.1%)\n    - Personal Income (consensus: -1.5%, previous: 0.6%)\n    - Personal Spending (consensus: -5.0%, previous: 0.2%)\n    - Real Personal Consumption (previous: 0.1%)\n\n^^^^2020-04-27",
        "created_utc": 1587981614,
        "id": "foq3gkm",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1588010414.0
    },
    {
        "author": "CptTonyStark",
        "body": "Never looked at a fucking zebra? Go to the zoo sometime cuck",
        "created_utc": 1587146804,
        "id": "fnpjxhm",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1587175604.0
    }
]