[
    {
        "author": "Cicero1982",
        "body": "I’m happier than a tornado in a trailer park! I picked out some value growth stocks last night, assessed the value I wanted to enter, and set my alerts. About an hour after market opened my alerts all blew up. I bought in on many, averaged down on a few, and ended today green. I have $12,000 allocated to averaging down on current positions if necessary and nearly 1/3rd of my portfolio available for new positions. Today was awesome! I now own SUM, CTXS, NET, IMOS, SIMO, &amp; IVC. Even took a small position of DFFN for a short squeeze and very small position in BKYI because ... well ... freaking because!",
        "created_utc": 1599166910,
        "id": "g3wisg8",
        "score": 11,
        "subreddit": "pennystocks",
        "created": 1599195710.0
    },
    {
        "author": "sylvikhan",
        "body": "Nanox (NNOX) is also a good theranos candidate. I work in xray equipment and have been watching this company for months because their claims of a 10k CT system are bogus. (As is their xray source technology). It IPOed one or two weeks ago and their stock shot up to 3B valuation. Now finally some research firm (Citrix) called them out on their shit early this week, calling them theranos 2.0.",
        "created_utc": 1600424052,
        "id": "g5osxqu",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600452852.0
    },
    {
        "author": "MustWarn0thers",
        "body": "Cloud data storage. Wow Holy shit guys can you believe it?! It's not like hard drives. It's hard drives that are on servers and you store it there, hence the cloud!\n\nIt's nothing like iCloud or AWS or Drive or pure storage or  Google drive or Egnyte or Citrix collab or Dropbox business.\n\nIt's totally revolutionary.",
        "created_utc": 1600276195,
        "id": "g5hlwjx",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600304995.0
    },
    {
        "author": "Cicero1982",
        "body": "Same here. I bought and averaged down SUM, INTC, SIMO, CTXS, IVC, IMOS, NET, and got a 5% squeeze out of DFFN and BKYI. Green Day for me due to averaging down. This is why number 9 [HERE](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/) is such a very strong and successful strategy, even amid temporary pullbacks. I can’t recommend it enough. It’s like getting penny stock-ish gains without the stress of pennies.",
        "created_utc": 1599266389,
        "id": "g42duaa",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1599295189.0
    },
    {
        "author": "bshaman1993",
        "body": "Guys take a look at CTXS",
        "created_utc": 1599068740,
        "id": "g3qu75i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599097540.0
    },
    {
        "author": "TG_Pro_Triathlete",
        "body": "150 billion company, price to sales 90+, what could go wrong... Just think, the entire company of Citrix (go-to-meeting plus many other software products) is like less than 15 billion.",
        "created_utc": 1600924636,
        "id": "g6e59ht",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600953436.0
    },
    {
        "author": "SoloTheFord",
        "body": "On another note I think you have some solid picks; added some of those to my watchlists, Citrix is an interesting one. I was checking it out earlier last month. \n\nI took some AMD and NVDA stock a while back no regrets. I like the idea of investing on the innovators and future tech for my mains. TSLA comes to mind but its really hyped, i think it is overvalued right now even though I like what the company is doing. Opted for some AAPL instead.",
        "created_utc": 1599275777,
        "id": "g42t9sd",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1599304577.0
    },
    {
        "author": "KneeGrowsToes",
        "body": "BB is representative of Canada as our top cyber security work and we are respected by many other countries, not just the US. The difference between CRWD and BB is the latter does not go after small fry. \n\n\nhttps://www.blackberry.com/us/en/company/newsroom/press-releases/2020/the-united-states-air-force-chooses-blackberry-spark-for-secure-productivity\n\nWhen the entire world had to go remote overnight, many companies didn’t anticipate the massive surge of hacking attempts that occurred from all over the world. All it takes is someone who knows how to do it over Discord, and that person shows the next. It’s like virtual COVID. That expensive lesson is going be paid for when they realize ransom is a real threat in this world.\n\nThere’s a reason 9/10 major Canadian banks use them.\n\nI am holding 10c and 20c for Jan 21. I want to profit as much as possible if this breaks out and is valued correctly. People still think they make phones. Even though they are releasing 5G phones from an American Manufacturer next year, it’s a drop in the bucket compared to QNX licensing and Spark UEM registrations. 18 of 20 G20 countries use Spark and they are the only product on DoD Approved Product List (and said by them the only product WORTH being on the list). I think this stock is gonna surpass CRWD in share price and Mkt cap soon. It’s been rebranded and updated as Spark UEM. They just hired Tom Eacobacci as President in June after he lead sales for Citrix for over 20 years and he gets to crank start the sales engine exactly how he wants. BlackBerry trades at 2-3x sales when CRWD trades at 30x. I am very confident they are gonna hit a massive beat Thursday BMO.\n\nThe purchase of Cylance was for a steal if you count the number of cyber security professionals they got with it. The demand for that talent during this pandemic was sky high and BlackBerry has the cash to pay them. With a centralized company, they only need one legal team, one accounting team. \nBB is representative of Canada as our top cyber security work and we are respected by many other countries, not just the US. The difference between CRWD and BB is the latter does not go after small fry.",
        "created_utc": 1600873192,
        "id": "g6bnc5e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600901992.0
    },
    {
        "author": "KneeGrowsToes",
        "body": "BB is representative of Canada as our top cyber security work and we are respected by many other countries, not just the US. The difference between CRWD and BB is the latter does not go after small fry. \n\n\nhttps://www.blackberry.com/us/en/company/newsroom/press-releases/2020/the-united-states-air-force-chooses-blackberry-spark-for-secure-productivity\n\nWhen the entire world had to go remote overnight, many companies didn’t anticipate the massive surge of hacking attempts that occurred from all over the world. All it takes is someone who knows how to do it over Discord, and that person shows the next. It’s like virtual COVID. That expensive lesson is going be paid for when they realize ransom is a real threat in this world.\n\nThere’s a reason 9/10 major Canadian banks use them.\n\nI am holding 10c and 20c for Jan 21. I want to profit as much as possible if this breaks out and is valued correctly. People still think they make phones. Even though they are releasing 5G phones from an American Manufacturer next year, it’s a drop in the bucket compared to QNX licensing and Spark UEM registrations. 18 of 20 G20 countries use Spark and they are the only product on DoD Approved Product List (and said by them the only product WORTH being on the list). I think this stock is gonna surpass CRWD in share price and Mkt cap soon. Cylance has been rebranded and updated as Spark UEM. They just hired Tom Eacobacci as President in June after he lead sales for Citrix for over 20 years and he gets to crank start the sales engine exactly how he wants. BlackBerry trades at 2-3x sales when CRWD trades at 30x. I am very confident they are gonna hit a massive beat Thursday BMO.\n\nThe purchase of Cylance was for a steal if you count the number of cyber security professionals they got with it. The demand for that talent during this pandemic was sky high and BlackBerry has the cash to pay them. With a centralized company, they only need one legal team, one accounting team.",
        "created_utc": 1600882652,
        "id": "g6c6l2e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600911452.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 10th of September\n\n\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n    - EXLLF @ **1:5**\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, BNTC, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FCEL, FFBW, FIZZ, FLR, FLUX, GRNQ, GTT, JG, KSPN, KZIA, LPTH, LTRX, ORCL, PBIO, PCYG, PDEX, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, SHLO, UEPS, VEDL, VITL, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 12,925K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.335M, previous: -9.362M)\n    - Cushing Crude Oil Inventories (consensus: 0.391M, previous: 0.110M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -0.557M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.2%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -2.384M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 846K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 68B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 2.8%, previous: 8.8%)\n\n## Upcoming events for Friday, September 11th\n\n - Expected earnings:\n\n  ANIX, ATHE, ATNM, BRC, CNNB, EVI, FONR, FSEA, GMHI, GROW, GVA, IBIO, IRCP, JVA, KR, LFAC, MARPS, MSB, NFIN, NNVC, PKX, UTZ, VALU, VIRC, YIN\n\n - Ex-div:\n\n  AME, CCBG, CCD, CGO, CHI, CHW, CMCT, CPZ, CSQ, CWH, DVN, EDF, EDI, EOD, ESCA, FCNCA, GROW, JRVR, NFJ, NIE, PTR, RRBI, SPR, UNH\n\n - Economic events and announcements:\n\n    - CPI (consensus: 0.3%, previous: 0.6%)\n    - CPI (consensus: 1.2%, previous: 1.0%)\n    - CPI Index, n.s.a. (consensus: 259.52, previous: 259.10)\n    - CPI Index, s.a (previous: 258.72)\n    - CPI, n.s.a (previous: 0.51%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.6%)\n    - Core CPI (consensus: 1.6%, previous: 1.6%)\n    - Core CPI Index (previous: 267.72)\n    - Federal Budget Balance (consensus: -245.0B, previous: -63.0B)\n    - Real Earnings (previous: -0.6%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 181)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - WASDE Report\n\n^^^^2020-09-10",
        "created_utc": 1599732013,
        "id": "g4ndtne",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599760813.0
    },
    {
        "author": "machococks",
        "body": "CTXS don't snooze",
        "created_utc": 1600106889,
        "id": "g59e7ui",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600135689.0
    },
    {
        "author": "RealisticCFMStudent",
        "body": "Speaking for a PE shop as well as a friend's FICC Sales and Trading experience. One of us works out of NY and the other out of Toronto.\n\nLike many of the others mentioned here, we using citrix to remote into our desktops at the office or on the trade floor. They also sent us a couple of extra monitors and gave us $500 to buy whatever we need to work from home.\n\nTheoretically, this should get us up to speed, but it's a complete quagmire. First, there is always going to be latency from using a remote connection. When the internet is slow, it might take a good 2-3 seconds before what you type actually appears. When you're dealing with a million emails a day, that adds up quickly. Also, there are tons of bugs with our software. I've lost track of the number of times my mic/webcam wasn't detected or our stupid screen share stopped working. Also, even 6 months into WFH, not everyone has all the privileges yet (screen share, file transfer over webex, etc).\n\nThe problems go beyond the technical issues. Things that took 10 min to resolve face to face now take 30 min to solve using WebEx (assuming no technical issues, which are common. If you have some technical issue, good luck). It is damn near impossible to read the room or read between the lines of what is being said on the call. It's just a slew of ppl taking at once followed by silence followed by \"go ahead\", etc, etc ,etc. My calendar is such a clusterfuck right now from all the calls. Our hours were already long before COVID (not as long as IB, but he works from 6AM - 7PM. My hours are about 8AM - 7PM), and now they are even longer. To make matters worse, having remote access means people are more likely to send you emails on the weekends.\n\nTLDR: It fucking sucks. Happy to answer any questions",
        "created_utc": 1601268651,
        "id": "g6xb3zf",
        "score": 1,
        "subreddit": "investing",
        "created": 1601297451.0
    },
    {
        "author": "Nochthitus44",
        "body": "It's quite bad that a company in 2020 is so unprepared for sudden work from home change; You mentioned a lot of technical issues, which aren't necessarily due to remote access, but more like CTO/COO not stepping up to 2020. I mean mic/camera issues, come on (buy **decent** camera+mic; hard enforce stable driver versions, make IT check each laptop before shipping to employee,etc.). Dealing with the lag with the likes of citrix is more complex, but 3 seconds delay is unacceptable and can be deal with. \n\nThe disruption in communications is more difficult to deal with, however most companies flat out suck donkey balls in their efforts to handle this. Let's take the \"random\" team huddles, which happen in the morning near the coffee machines or in the smoking area. Anyone would agree those were extremely useful. Yet not single company I know implemented a solution to mimic those. The solution is simple - have a voice chat rooms in which people can just join and chit-chat, they always open, like discord channels; name those \"smoking break\", \"coffee corner\", \"chitchat\" - etc. Yet nothing like that is present in any company I know and have friends working in. There are the only Teams meetings, which are definitely not the same thing. Because it's a meeting, you need to join exactly at some hour and it just sucks. Have you heard of a company which implemented such discord-like voice-chat rooms to re-create team-bonding over coffee/smoke, where one can join at like 10am and already find 2 people talking over a cigarette, then another girl might join at 10:07 when she has done her coffee and wc duties, no meeting deadlines, no official start and end time? I haven't. and that's a pretty simple solution. \n\nMy point is that I believe that with right attitude towards technology and organizational practices working in the office 2 days a week and from home 3 days a week can be a real win-win.",
        "created_utc": 1601294504,
        "id": "g6xzwat",
        "score": 1,
        "subreddit": "investing",
        "created": 1601323304.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "EightFolding",
        "body": "My top performers are: AAPL, FB, MSFT, MU, ACA, VWSYF, CTXS, TRN, MRVL, INO, CSCO, DOX, SNY, ABB. All with total gains over 40%. Those are *not* my recommendations, just my top performing holdings.\n\nI'm self taught and ignorant about a lot, but try to learn. But I do have an investing philosophy. One of the big investing mistakes I think we all make is believing that how things are now is how they will always be, so I try to buy for a better future. And along with fundamentals I buy what I believe in, and what I've seen and used.\n\nI do socially responsible self-directed investing. So I try not to buy anything that makes money directly from fossil fuels, war, harming people or animals,, prisons, poor treatment of immigrants, refugees, or asylum seekers, or, predatory financial industries, or any other industries that cause people, animals, or the environment harm. I think there's a fair argument to make that I'm breaking this rule to include tech companies like Facebook and some biotech, so that's my failure to work on. But my investments since the early 2000s have beat all the markets, and all the funds, just by choosing to have principles and trying to invest in companies that do good.\n\nI also own other green energy, tech, grocery, railroads, data/commercial real estate, biotech. In the early 2000s I bought the companies that have become big tech, right now I'm buying transportation, biotech, 5G, AR, VR, and green energy companies along with companies I think will do well during the upcoming COVID-19 repeat. Despite the awful world we live in, I believe a better future is possible.",
        "created_utc": 1600550604,
        "id": "g5v759p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600579404.0
    },
    {
        "author": "tbrucker",
        "body": "CTXS",
        "created_utc": 1599874679,
        "id": "g4vzotj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599903479.0
    },
    {
        "author": "Trueslyforaniceguy",
        "body": "Yes!  Citrix, DOCU, WORK, PD",
        "created_utc": 1598969616,
        "id": "g3l990c",
        "score": 1,
        "subreddit": "investing",
        "created": 1598998416.0
    },
    {
        "author": "upvotemeok",
        "body": "byebye BAC and C, hi hi SCHW and CTXS",
        "created_utc": 1600968170,
        "id": "g6g0an2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600996970.0
    },
    {
        "author": "KneeGrowsToes",
        "body": "It’s been rebranded as Spark. They just hired Tom Eacobacci as President in June after he lead sales for Citrix for over 20 years and he gets to crank start the sales engine exactly how he wants. BlackBerry trades at 2-3x sales when CRWD trades at 30x. I am very confident they are gonna get a massive beat Thursday BMO.",
        "created_utc": 1600841089,
        "id": "g6als6c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600869889.0
    },
    {
        "author": "dope_a_meme",
        "body": "Citrix",
        "created_utc": 1601286785,
        "id": "g6xsg45",
        "score": 1,
        "subreddit": "investing",
        "created": 1601315585.0
    },
    {
        "author": "totsnotbiased",
        "body": "The first thing I would do is double your interest in every ETF/ actively managed funds you own outside the S&amp;P 500, and sell the small positions you have in low growth companies like J&amp;J, JPM, KO, CTXS. \n\nA good rule of thumb for you might be if you can’t see a world where the stock could double in the next 12-24 months, you shouldn’t hold less than .5% of your total portfolio in it.\n\nYou’re highly diversified, but that’s what ETF’s are for, and they are probably better at it than any of us",
        "created_utc": 1599097699,
        "id": "g3spqfo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599126499.0
    },
    {
        "author": "Legitimate_Twist",
        "body": "Maybe for retail bank employees, but 100% of everyone in investment banking are working from home. Citrix and other remote work software makes it a non issue.",
        "created_utc": 1601282043,
        "id": "g6xok5p",
        "score": 1,
        "subreddit": "investing",
        "created": 1601310843.0
    },
    {
        "author": "preferoldredditcom",
        "body": "$CTXS",
        "created_utc": 1601281889,
        "id": "g6xofgg",
        "score": 1,
        "subreddit": "investing",
        "created": 1601310689.0
    },
    {
        "author": "sina_t97",
        "body": "im on a macbook and last time i tried to get streetsmart working with Citrix it just didn't work no matter what i tried. and im pretty tech savvy. i guess i could try running a virtual box with windows, just seems like a lot of effort.",
        "created_utc": 1599681399,
        "id": "g4kv89b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599710199.0
    },
    {
        "author": "Cicero1982",
        "body": "SUM CTXS NET IMOS IVC INTC MOMO SIMO\n\nI only buy value growth stocks. All of these are trading at a discount. Should they go lower I don’t mind averaging down nor bagholding. However I would warn that penny stocks, unlike the stocks above, are much harder to value and is highly dependent on speculation.\n\nRecommend trading the above securities congruent with number 9 [HERE](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/)",
        "created_utc": 1599421730,
        "id": "g49gch4",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599450530.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  7th of September\n\n\n\n## Upcoming events for Monday, September  7th\n\n - Expected earnings:\n\n  CBAT, EBR, EBR.B, GRAF, HCAC, HJLI, HPK, JT, PLAG, QD, SAMA, SINA, THCA, THCB, WB\n\n - Economic events and announcements:\n\n    - Investing.com Gold Index (actual: 56.3%, previous: 54.7%)\n    - Investing.com S&amp;P 500 Index (actual: 34.5%, previous: 28.6%)\n    - United States - Labor Day\n\n## Upcoming events for Tuesday, September  8th\n\n - Stock splits:\n\n    - PRGCF @ **1:10**\n\n - Expected earnings:\n\n  ABM, ANAT, ASFI, AZRX, BWL.A, CASY, CIG, COE, COUP, CVGW, CVV, DRD, GEC, HMY, HQY, IDXG, KBSF, KEQU, KTRA, LULU, METX, MFAC, NSSC, PHR, PPIH, SCPE, SEAC, TC, TEUM, UEC, UTSI, UXIN, WORK\n\n - Ex-div:\n\n  AEE, AVT, BBDC, BDX, CNI, HPE, HPQ, INSW, JKHY, LANC, LHX, OBCI, PEG, RCI, STNG, TFSL\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.115%)\n    - 3-Year Note Auction (previous: 0.179%)\n    - 52-Week Bill Auction (previous: 0.140%)\n    - 6-Month Bill Auction (previous: 0.105%)\n    - CB Employment Trends Index (previous: 50.89)\n    - Consumer Credit (consensus: 13.75B, previous: 8.95B)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - NFIB Small Business Optimism (previous: 98.8)\n\n## Upcoming events for Wednesday, September  9th\n\n - Stock splits:\n\n    - ALEDY @ **16:5**\n\n - Expected earnings:\n\n  ACB, AEO, AKER, ALOT, AMRH, APWC, ATLC, AVAV, AXR, BBCP, BCOW, BIGC, BROG, CBLI, CEI, CTXR, CVU, DSGX, EPM, FMCI, GFN, GIII, GME, HDS, HMG, HOTH, HTHT, HUSA, KEP, KFFB, LAKE, LMFA, LMNR, LOVE, MCFT, MEIP, NAV, OBSV, ORCL, REVG, RH, SCWX, SGMA, SLQT, STRM, TDAC, VERX, VRNT, WORX, WUBA, YGYI, ZNH, ZS\n\n - Ex-div:\n\n  AAT, ANTM, CASH, CME, DHF, FNV, GPN, HOG, KIM, LADR, MDU, MGM, MPW, NEM, NRIM, PPL, PPR, SJI, TRTN, TRV, TU, UBCP, UMBF, VCTR, VFC\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.660%)\n    - API Weekly Crude Oil Stock (previous: -6.360M)\n    - Cushing Crude Oil Inventories (previous: 0.110M)\n    - EIA Short-Term Energy Outlook\n    - JOLTs Job Openings (consensus: 6.000M, previous: 5.889M)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -2.0%)\n    - MBA Purchase Index (previous: 309.6)\n    - Mortgage Market Index (previous: 755.1)\n    - Mortgage Refinance Index (previous: 3,316.2)\n    - Redbook (previous: 4.6%)\n    - Redbook (previous: 5.8%)\n    - Seevol Cushing Storage Report (previous: -1.368M)\n    - Thomson Reuters IPSOS PCSI (previous: 47.05)\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FFBW, FLR, FLUX, GRNQ, GTT, JG, LPTH, LTRX, PBIO, PCYG, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, UEPS, VEDL, VITL, VNCE, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 14,000K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.887M, previous: -9.362M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -1.357M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -5.2%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -3.036M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 838K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 34B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 4.9%, previous: 8.8%)\n\n^^^^2020-09-07",
        "created_utc": 1599472813,
        "id": "g4bg86y",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599501613.0
    },
    {
        "author": "Cicero1982",
        "body": "NET, CTXS, IVC, IMOS, SUM, SIMO. All value companies, all have great potential for growth, all hopefully will dip more today so I can pick up more shares and average down.",
        "created_utc": 1599221329,
        "id": "g3z1fzd",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599250129.0
    },
    {
        "author": "GenTelGuy",
        "body": "I got Citrix shares back in May or June and they just keep getting pounded like a Ram Ranch Cowboy",
        "created_utc": 1600925700,
        "id": "g6e6isg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600954500.0
    }
]