[
    {
        "author": "cclem0013",
        "body": "GPN",
        "created_utc": 1599050250,
        "id": "g3plxfe",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599079050.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  7th of September\n\n\n\n## Upcoming events for Monday, September  7th\n\n - Expected earnings:\n\n  CBAT, EBR, EBR.B, GRAF, HCAC, HJLI, HPK, JT, PLAG, QD, SAMA, SINA, THCA, THCB, WB\n\n - Economic events and announcements:\n\n    - Investing.com Gold Index (actual: 56.3%, previous: 54.7%)\n    - Investing.com S&amp;P 500 Index (actual: 34.5%, previous: 28.6%)\n    - United States - Labor Day\n\n## Upcoming events for Tuesday, September  8th\n\n - Stock splits:\n\n    - PRGCF @ **1:10**\n\n - Expected earnings:\n\n  ABM, ANAT, ASFI, AZRX, BWL.A, CASY, CIG, COE, COUP, CVGW, CVV, DRD, GEC, HMY, HQY, IDXG, KBSF, KEQU, KTRA, LULU, METX, MFAC, NSSC, PHR, PPIH, SCPE, SEAC, TC, TEUM, UEC, UTSI, UXIN, WORK\n\n - Ex-div:\n\n  AEE, AVT, BBDC, BDX, CNI, HPE, HPQ, INSW, JKHY, LANC, LHX, OBCI, PEG, RCI, STNG, TFSL\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.115%)\n    - 3-Year Note Auction (previous: 0.179%)\n    - 52-Week Bill Auction (previous: 0.140%)\n    - 6-Month Bill Auction (previous: 0.105%)\n    - CB Employment Trends Index (previous: 50.89)\n    - Consumer Credit (consensus: 13.75B, previous: 8.95B)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - NFIB Small Business Optimism (previous: 98.8)\n\n## Upcoming events for Wednesday, September  9th\n\n - Stock splits:\n\n    - ALEDY @ **16:5**\n\n - Expected earnings:\n\n  ACB, AEO, AKER, ALOT, AMRH, APWC, ATLC, AVAV, AXR, BBCP, BCOW, BIGC, BROG, CBLI, CEI, CTXR, CVU, DSGX, EPM, FMCI, GFN, GIII, GME, HDS, HMG, HOTH, HTHT, HUSA, KEP, KFFB, LAKE, LMFA, LMNR, LOVE, MCFT, MEIP, NAV, OBSV, ORCL, REVG, RH, SCWX, SGMA, SLQT, STRM, TDAC, VERX, VRNT, WORX, WUBA, YGYI, ZNH, ZS\n\n - Ex-div:\n\n  AAT, ANTM, CASH, CME, DHF, FNV, GPN, HOG, KIM, LADR, MDU, MGM, MPW, NEM, NRIM, PPL, PPR, SJI, TRTN, TRV, TU, UBCP, UMBF, VCTR, VFC\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.660%)\n    - API Weekly Crude Oil Stock (previous: -6.360M)\n    - Cushing Crude Oil Inventories (previous: 0.110M)\n    - EIA Short-Term Energy Outlook\n    - JOLTs Job Openings (consensus: 6.000M, previous: 5.889M)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -2.0%)\n    - MBA Purchase Index (previous: 309.6)\n    - Mortgage Market Index (previous: 755.1)\n    - Mortgage Refinance Index (previous: 3,316.2)\n    - Redbook (previous: 4.6%)\n    - Redbook (previous: 5.8%)\n    - Seevol Cushing Storage Report (previous: -1.368M)\n    - Thomson Reuters IPSOS PCSI (previous: 47.05)\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FFBW, FLR, FLUX, GRNQ, GTT, JG, LPTH, LTRX, PBIO, PCYG, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, UEPS, VEDL, VITL, VNCE, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 14,000K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.887M, previous: -9.362M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -1.357M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -5.2%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -3.036M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 838K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 34B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 4.9%, previous: 8.8%)\n\n^^^^2020-09-07",
        "created_utc": 1599472813,
        "id": "g4bg86y",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599501613.0
    },
    {
        "author": "Inhibition_",
        "body": "I couldn't decide and wanted some diversity with the major credit players and GPN so i bought the prime mobile payments etf IPAY",
        "created_utc": 1600480632,
        "id": "g5rq6np",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600509432.0
    },
    {
        "author": "TUGenius",
        "body": "If it were that easy Intel would've figured it out by now",
        "created_utc": 1600049030,
        "id": "g56vzol",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1600077830.0
    },
    {
        "author": "AoeDreaMEr",
        "body": "That’s a great read. I am a packaging engineer and I loved reading this. As you said, Intel isn’t out of the game yet. But if they don’t get their shit together in next couple of years, they will be the next IBM.",
        "created_utc": 1600179303,
        "id": "g5cuxpx",
        "score": 88,
        "subreddit": "stocks",
        "created": 1600208103.0
    },
    {
        "author": "SwimmingWolf23",
        "body": "Apple’s chip won’t really affect Intels market share. Apple designs their chips based on ARM, which as of right now, is intended for mobile devices such as phones and tablets (laptops in the future). Intel is on x86, and is currently struggling, but Apple and Intel won’t compete until later this year when Apple puts their A series chips in their macs and MacBooks. Even then, they don’t really compete. AMD and Intel will always be more direct competitors than Apple and Intel",
        "created_utc": 1600194148,
        "id": "g5du2og",
        "score": 68,
        "subreddit": "stocks",
        "created": 1600222948.0
    },
    {
        "author": "WorriedBanker",
        "body": "SoftBank Nears $40 Billion Deal to Sell Arm Holdings to Nvidia\n\nUnion of Arm, Nvidia would create a powerhouse in the chip industry\n\n&amp;#x200B;\n\nSoftBank recently has been involved in a series of big asset sales after being under pressure to shore up its flagging stock price.\n\n&amp;#x200B;\n\nSoftBank Group Corp. 9984 1.03% is nearing a deal to sell British chip designer Arm Holdings to Nvidia Corp. NVDA -1.20% for more than $40 billion, according to people familiar with the matter, the latest in a series of big asset sales by the Japanese technology conglomerate.\n\n&amp;#x200B;\n\nThe cash-and-stock deal being discussed would value Arm in the low $40 billions, the people said. The terms under discussion would mark a big win for SoftBank, which bought Arm four years ago for $32 billion and had struggled to jump-start growth in the business.\n\n&amp;#x200B;\n\nArm and Nvidia have been in exclusive talks for several weeks and a deal could be sealed early next week, the people said — assuming it isn’t derailed at the last minute.\n\n&amp;#x200B;\n\nArm designs microprocessors that power most of the world’s smartphones. By joining forces with Nvidia, the combined company would be a powerhouse in the chip industry.\n\n&amp;#x200B;\n\nNvidia is a fast-growing industry player whose chips are used to run the intense calculations for graphics—and play a key role in videogaming, cloud-computing and other activities for which the coronavirus pandemic has stoked demand. That has sent its shares up more than 100% this year, making it the best-performing stock in the S&amp;P 500 index.\n\n&amp;#x200B;\n\nShould a deal come together, it would be one of the largest transactions so far this year and potentially the largest semiconductor deal ever. Though business disruptions stemming from the pandemic have dented global deal volume, consolidation has kept up pace in the semiconductor industry as chip makers seek scale and expand their product portfolios to support the increasing number of everyday items that are connected to the internet. Such linkage is commonly referred to as the Internet of Things. Another of the year’s biggest deals was the $22 billion purchase of Maxim Integrated Products Inc. MXIM -0.53% by fellow chip maker Analog Devices Inc.\n\n&amp;#x200B;\n\nA sale to Nvidia could prompt scrutiny from antitrust regulators and potentially pushback from Arm’s customers, which include major chip makers and electronics manufacturers such as Intel Corp., Samsung Electronics Co. and Apple Inc.\n\n&amp;#x200B;\n\nThe Wall Street Journal reported in July that SoftBank was exploring options for Arm including a full or partial sale or an IPO. Arm had said it planned to transfer two Internet of Things services units into new entities that would be owned and operated by SoftBank as part of a move to focus on its core semiconductor-Ip business. It later reversed course on that move, saying it would instead keep the operations in-house.\n\n&amp;#x200B;\n\nSoftBank, for its part, had been under pressure to shore up its flagging stock price and promised some $40 billion in asset disposals. Most or all of that is already under way or completed and its shares are up more than 20% this year. Among the sales: big chunks of its holdings in China’s Alibaba Group Holding Ltd. and T-Mobile US Inc. following the wireless provider’s merger with Sprint Corp.\n\n&amp;#x200B;\n\nSoftBank has also purchased options tied to around $50 billion worth of individual tech stocks this year. The sheer size of the bet has had an outsize effect on the overall stock market, driving prices higher, the Journal has reported.\n\n&amp;#x200B;\n\nAt SoftBank, Chief Executive Masayoshi Son has been working with a small team to negotiate the Arm deal including the chief executive of the chip company, Simon Segars, Chief Financial Officer Yoshimitsu Goto, as well as Rajeev Misra, CEO of the firm’s giant Vision Fund, and Akshay Naheta, another executive at the fund.",
        "created_utc": 1599933188,
        "id": "g4ycuuh",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1599961988.0
    },
    {
        "author": "Bohdanowicz",
        "body": "Nvidia will hold the performance crown this gen but unlike nvidia, AMD can afford to break even on the consumer GPS this generation to create positive mind share.  Not that they will... but its an option nvidia doesn't have.\n\nI see AMD continuing to eat Intels lunch which alone is enough to push them past 200/300 in the next 2-3 years.  The biggest risk is Intel capitulating on the fab side of things and teaming up with Samsung.  I can see Intel besting AMD on the 8nm Samsung process.\n\nIntel will eventually go fabless.  If they do it in the next 2-3 years amd could be it trouble.  If they insist on being stubborn they are going the way of Nortel long term and AMD will rule x86 with an iron fist.",
        "created_utc": 1600046254,
        "id": "g56r94d",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1600075054.0
    },
    {
        "author": "teegolf1",
        "body": "Companies don’t always come back after crashes even if they are well run. Cisco and Intel are still are not at back to their euphoric dot.com highs reached back in 2000. That’s 20 years with a negative return. 20 YEARS. The euphoria around Apple, Tesla, AMD, NVDIA, etc. has priced these stocks way too high for MANY years to come. It is not sustainable. Reread this well written article and heed the warnings.",
        "created_utc": 1599698732,
        "id": "g4ltouk",
        "score": 24,
        "subreddit": "stocks",
        "created": 1599727532.0
    },
    {
        "author": "sami2525",
        "body": "I'm $12000 in calls over this long weekend. Wish me luck boys.\n\nMSFT, NVDA, INTC, AAPL, PFE, SNE, TSM, RIOT",
        "created_utc": 1599249810,
        "id": "g418l08",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1599278610.0
    },
    {
        "author": "ThrobbnHood",
        "body": "Don't worry, time will prove us right. INTC has fallen out of favor recently but will recover. I've been quietly adding shares since the big drop off :)",
        "created_utc": 1599855345,
        "id": "g4uz1pw",
        "score": 22,
        "subreddit": "stocks",
        "created": 1599884145.0
    },
    {
        "author": "Robomonk3y",
        "body": "Apparently short term it might drop, because NVDA needs to pay for it, but long term, it should fly. But this still needs to pass regulatory approval from Gov authorities. Also we still haven't heard of possible legal challenges from AMD and Intel.",
        "created_utc": 1600043429,
        "id": "g56mfqk",
        "score": 21,
        "subreddit": "stocks",
        "created": 1600072229.0
    },
    {
        "author": "kok823",
        "body": "Intel might as well dump all its cash into this legal battle. Why not after dumping money into shares buyback instead of R&amp;D?",
        "created_utc": 1600047797,
        "id": "g56twie",
        "score": 18,
        "subreddit": "stocks",
        "created": 1600076597.0
    },
    {
        "author": "LavenderAutist",
        "body": "It depends on how much the deal is in stock.\n\nNvidia shares are priced richly. If they do most of it for stock, it's a good deal.\n\nBut I don't think it will matter much.\n\nTheir market cap is $300 billion right now. More than Intel and AMD combined. What's another $40 billion?",
        "created_utc": 1599941527,
        "id": "g4yzmzk",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1599970327.0
    },
    {
        "author": "markerAngry",
        "body": "INTC $58C, 10/9, penny premium, will send $10 if it prints",
        "created_utc": 1600119794,
        "id": "g5ag9or",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1600148594.0
    },
    {
        "author": "RogueJello",
        "body": "Apple isn't really relevant to this discussion, since their license to ARM is guaranteed.  Rather this is much more about Intel v Nvidia.  Intel has been focusing on improving their GPUs, NVidia is about to start focusing on their CPUs.",
        "created_utc": 1600217214,
        "id": "g5f8cbc",
        "score": 17,
        "subreddit": "SecurityAnalysis",
        "created": 1600246014.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "I am amazed about how can the same mistakes  be repeated again, again, and again for years.\n\nEven when the best books warn you. Even when the best investors have quotes about it.\n\nIntel, the industry giant with the largest profit margins and the best positioned to be leading again, underperforms for a while, and all the \"smart\" people talking shit about INTC and paying crazy premium for AMD.\n\nEvery day passes and I am more secure about the quote that says money in the stock market at the end returns to those who it belongs\n\nI am gonna be the first to open a thread in 5/10 years, quoting all the \"smart\" guys who talked nonsense about INTC, and those who dickride AMD.\n\nIt's gonna be funny",
        "created_utc": 1600430793,
        "id": "g5p02it",
        "score": 17,
        "subreddit": "stocks",
        "created": 1600459593.0
    },
    {
        "author": "Tuucan1",
        "body": "I’m deep in INTC with you fellow tard. This is gonna print!",
        "created_utc": 1598994118,
        "id": "g3n45jz",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1599022918.0
    },
    {
        "author": "y0da1927",
        "body": "Depends on who is buying the IPO. \n\nBerkshire probably wants to own the stock, and generally IPOs are underpriced to get a decent return for those who subscribe. They may not want to own the stock but want to be called for more deals, so they bought some to make the broker happy. \n\nA company like Google probably Looking to get an interest in a company they may want to buy in the future, or get a board seat to gain market intel and have some influence on the company. Maybe they just thought it was cheap.\n\nLots of reasons to buy IPOs. All depends on the deal and the buyer.",
        "created_utc": 1600265068,
        "id": "g5gzohg",
        "score": 16,
        "subreddit": "investing",
        "created": 1600293868.0
    },
    {
        "author": "spoookymorty",
        "body": "Whoever told me to buy Intel calls is kind of a shitty person",
        "created_utc": 1599232340,
        "id": "g3zsnx6",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1599261140.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "June 10: Market corrected, VIX flew and then option premiums were fucked for 2 weeks.  \n  \nJuly 13: Market had a small pullback. VIX got killed and option premiums were fucked for a 10 days.  \n  \nAfter these two events, I swore to myself that I won't buy if there is another correction until VIX stabilizes a bit.  \n  \nAnd here I am now, holding 10/16 AAPL, MSFT, FB, WMT, CHWY, INTC and AMD calls that got severely IV crushed despite a big move in the underlying asset.  \n  \nSecond time's a coincidence, third time's just retarded.",
        "created_utc": 1599707120,
        "id": "g4m959m",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1599735920.0
    },
    {
        "author": "WolfOfNallStreet",
        "body": "Where's secret Intel gang...shhhh👀🤫",
        "created_utc": 1599009020,
        "id": "g3o11r0",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1599037820.0
    },
    {
        "author": "oldprecision",
        "body": "NVDIA's market cap is higher than Intel.  Intel ain't buying them.",
        "created_utc": 1599012217,
        "id": "g3o70rv",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1599041017.0
    },
    {
        "author": "Mrseanis",
        "body": "Look at INTC and CVS. Bargains",
        "created_utc": 1599960493,
        "id": "g50m3ij",
        "score": 14,
        "subreddit": "stocks",
        "created": 1599989293.0
    },
    {
        "author": "infinitelimits00",
        "body": "People saying Tesla is overvalued probably are long T, XOM, and INTC 🤡",
        "created_utc": 1599971695,
        "id": "g51jquo",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1600000495.0
    },
    {
        "author": "mr-no-homo",
        "body": "Got that event on Tuesday, I’m pretty sure the new iPhones will be announced then and those leaker nerds are morons. Also, With the transition away from intel chips to ARM Macs, I’m long and hard on AAPL",
        "created_utc": 1599969691,
        "id": "g51d2f2",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1599998491.0
    },
    {
        "author": "p_giggles",
        "body": "I highly doubt Apple would ever try to enter the CPU market outside it's own phones/devices. It would be super dilutive to consolidated margins as Intel's PC processor business is its lowest margin business. Apple just kicked out Intel so it can control everything about the process.",
        "created_utc": 1600373742,
        "id": "g5ml6d7",
        "score": 13,
        "subreddit": "investing",
        "created": 1600402542.0
    },
    {
        "author": "marilius12",
        "body": "The price of a stock alone says nothing about it being cheap or expensive. You need to also consider the number of shares outstanding. That's why instead of looking at the stock quote you should look at ratios like P/E.\n\nSo, what you're asking is what are some value stocks with relatively low P/Es compared to the S&amp;P average for example. There are several sectors that are \"cheap\" - these are your banks like JPM and BAC, manufacturers like MMM and HON, even some tech like INTC, CSCO, and STX.\n\nNote that low P/E are often indicative of low growth expectations. So you are trading stability (low beta) and dividends for capital appreciation.",
        "created_utc": 1600284227,
        "id": "g5i2eod",
        "score": 13,
        "subreddit": "stocks",
        "created": 1600313027.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "I believe in INTC long run. They're not going anywhere. People are prisoners of the moment and don't look to the big picture",
        "created_utc": 1599856645,
        "id": "g4v1tpa",
        "score": 12,
        "subreddit": "stocks",
        "created": 1599885445.0
    },
    {
        "author": "ReversalTheory",
        "body": "Intel run by a buncha retards. How do you botch a launch event that badly lmao",
        "created_utc": 1599065950,
        "id": "g3qmw6u",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599094750.0
    },
    {
        "author": "adamrch",
        "body": "Intel admitted at earnings it had production issues. This is an anonymous source and reads likes a hit piece.",
        "created_utc": 1600167522,
        "id": "g5ce2a9",
        "score": 12,
        "subreddit": "investing",
        "created": 1600196322.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "T\n\nPFE\n\nINTC\n\nO\n\nRTX",
        "created_utc": 1600116103,
        "id": "g5a6g9e",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1600144903.0
    },
    {
        "author": "sleepyguy007",
        "body": "yes, intel also made ridiculous money back then.  CPU prices were actually more in 2000 than now.... like Pentium 200s going for $800.   Profitable company and it still fell 75% and languished for well over a decade before it even got to half its 2000 highs.",
        "created_utc": 1600160455,
        "id": "g5c7sdy",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600189255.0
    },
    {
        "author": "iyioi",
        "body": "ARM is good for mobile and Apple processors. \n\nNot for the majority of windows machines, where AMD is taking market share from intel.",
        "created_utc": 1600030552,
        "id": "g55tqul",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600059352.0
    },
    {
        "author": "Noobenheim97",
        "body": "INTC is a great long term play right now IMO.  It got hit hard because of recent news but in the long haul I think will recover just fine.",
        "created_utc": 1600436290,
        "id": "g5p8c1o",
        "score": 12,
        "subreddit": "investing",
        "created": 1600465090.0
    },
    {
        "author": "detroitvelvetslim",
        "body": "It is running on state of the art Intel Core 2 Duo technology",
        "created_utc": 1599848912,
        "id": "g4uklyj",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599877712.0
    },
    {
        "author": "roundearththeory",
        "body": "&gt;This stock will be a buy the day they put a CEO with an engineering background that'll fire a lot of the dead weight and hire talented people to focus mainly on technology and ease off of the advertisement and stock buy backs.\n\nI've worked at both companies. Morale and leadership at Intel is broken and their current predicament and eroding performance is a lagging indicator of this. Unless there is an extreme hierarchical shakeup and a willingness to refocus R&amp;D dollars (not spend billions on stock buybacks), I'd be extremely wary of the long term trajectory.",
        "created_utc": 1599251373,
        "id": "g41d71p",
        "score": 12,
        "subreddit": "stocks",
        "created": 1599280173.0
    },
    {
        "author": "soap808s",
        "body": "Finally bought myself a new laptop yesterday and had a hard time pulling the trigger for $900 but today $3,000 vanished from INTC calls and I'm numb",
        "created_utc": 1599160429,
        "id": "g3vz9p2",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599189229.0
    },
    {
        "author": "Niklas1311",
        "body": "INTC will moon too. Stocks can only go up. \nSo dont be a 🌈🐻",
        "created_utc": 1599074435,
        "id": "g3r8ymb",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599103235.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "It is 9/2. \n\nThe Intel Tiger Lake announcement is about to begin. \n\nThe live stream starts. A lone mic in front of a dark blue curtain is all that can be seen. \n\nBob Intel, CEO of Intel, descends via tight wire from the rafters like Lady Gaga in that one super bowl half time show a few years ago. \n\nSilence. Utter, deafening silence. \n\nBob takes the mic and clears his throat. A man in the audience kills himself and his family because he can’t take the anticipation. \n\n*”Ladies, Gentlemen. Investors. We have bought the moon.”*\n\nThe curtain falls. The moon shows through a window behind the stage. A large *Intel* logo across its center.\n\nINTC explodes to $100 \n\nBob Intel begins levitating as the crowd breaks out in a frenetic orgy of tears and joy \n\nCOVID is instantly eradicated from the Earth as a wave of euphoria spreads",
        "created_utc": 1598978864,
        "id": "g3ly7c5",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599007664.0
    },
    {
        "author": "JRAXXI",
        "body": "Paint dries faster than INTC moves, but don’t let the haters stop you. \nGood luck! 💎🙌🏽",
        "created_utc": 1598995612,
        "id": "g3n7la1",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599024412.0
    },
    {
        "author": "EatMaTesticles",
        "body": "iPhone 12, Apple Watch 6, new iPad Air, iOS 14, new Macs with Apple silicon (beating Intel in performance) \n\nApple will moon more and more 🚀",
        "created_utc": 1599741933,
        "id": "g4o35ux",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599770733.0
    },
    {
        "author": "GHWBushh",
        "body": "Then if AMD rules it’ll be intel prices all over again, and so the cycle will continue",
        "created_utc": 1600050277,
        "id": "g56y1h7",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1600079077.0
    },
    {
        "author": "Apps3452",
        "body": "INTC gang checking in",
        "created_utc": 1599073151,
        "id": "g3r5g36",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599101951.0
    },
    {
        "author": "IDoLikeMyShishkebabs",
        "body": "I sold my AAPL calls before it dipped too hard, now I’m literally all in with INTC Jan 2021 and bought midway down the dip.",
        "created_utc": 1599159657,
        "id": "g3vx8gj",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599188457.0
    },
    {
        "author": "InfiniteValueptr",
        "body": "Intel owns its own fabs; while AMD is fabless and buys wafers from TSMC. Due to their lithographic issues outlined [here](https://www.infinitevalueptr.com/post/intel_10nm) Intel have been forced to turn to TSMC for chips.\n\nThe second part of your statement would be true in a completely free market, but TSMC's management have stated that they don't view Intel as a long term customer (while they do view AMD as one). This is pretty evident given the fact that once Intel sort out their process they'll abandon TSMC and go back to in house manufacturing only, meaning TSMC's long term interests are aligned with ensuring AMD sees long term growth over Intel. From the comments TSMC management has made over the past few years and the execution of their business plans, I believe that TSMC management is focused more on long term value generation than short term profit, meaning your scenario wouldn't be likely to occur.",
        "created_utc": 1600189694,
        "id": "g5djeau",
        "score": 11,
        "subreddit": "stocks",
        "created": 1600218494.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "Intel has a bean counter as a CEO. Even if they put an engineer, you need someone who will change the core culture. They need to hire talent but instead have opted out for nepotism and politics. Their yields are awful, their CPUs were never efficient (Lookup Delidding), their pricing is high, always over heating, always higher than advertised power usage, and struggles to run games by throttling the GPU. Some of these could be my personal experience, but I've seen this posted too many times now.\n\nThey do have an edge on some things, but that's not going to stay long. Their current strategy is to buy back their stock and market against AMD instead of investing in their own technology and talent.\n\nThis stock will be a buy the day they put a CEO with an engineering background that'll fire a lot of the dead weight and hire talented people to focus mainly on technology and ease off of the advertisement and stock buy backs.\n\nIf you've read thus far, great. If you're still not convinced, which most Intel people aren't, here is a question: What would convince you? An actual live video of Lisa Su wiping the floor with Intel CPUs? Because that's already happening benchmark/stock/market share/profit wise.",
        "created_utc": 1599244619,
        "id": "g40t5ep",
        "score": 11,
        "subreddit": "stocks",
        "created": 1599273419.0
    },
    {
        "author": "NorCalAthlete",
        "body": "Rumor has it there’ll be an announcement today around 1pm pacific time on the iPhone 12.  \n\nOverall there’s supposed to be a new iPhone, new iPad, and new MacBook Pro announced among other things.  First generation to use 5G, it’s getting a lidar sensor for augmented reality, plus the MacBook is moving away from intel chips and the new chip is supposed to be insane.\n\nEdit - sources:\n\n\nhttps://www.macrumors.com/2020/08/20/apple-september-10-event-speculation/\n\nhttps://www.cnet.com/news/apple-appears-to-post-september-10-stream-details-for-5g-iphone-event-on-youtube/",
        "created_utc": 1599752347,
        "id": "g4p4ea7",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599781147.0
    },
    {
        "author": "AmishAbe-PA",
        "body": "For me AMD and Tesla. I bought AMD low a few years ago when they were struggling, but I had faith they would improve. Intel couldn’t be the only game in town. A couple of years ago they were like 9 bucks. Now 80.\n\nTesla, well duh. Got them at 220ish a couple years ago.",
        "created_utc": 1599755837,
        "id": "g4pfbtw",
        "score": 11,
        "subreddit": "stocks",
        "created": 1599784637.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "If you ever wanted in on AMD, NVDA, AAPL, TSLA, MSFT, INTC—— who am I fucking kidding if you ever wanted in on some calls on anybody now would be the time",
        "created_utc": 1599167593,
        "id": "g3wkruc",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599196393.0
    },
    {
        "author": "HinduHamma",
        "body": "Just incredible times. You got absolute fucking brain dead retards beating smart money. For not just a couple days or weeks. But like the entire fucking year \n\nLiterally just buying calls on tech . Free money. Any idiot can do it. \n\nTesla , Apple, amd, nvda, zm, etc anything tech (not intel) has won big time and smoked the cocksucker big money institutions and their baby gains. \n\nWhen retards are making money this easily, I get worried a bit. But then there’s him. He eases my concerns. \n\nThe gray fox. Papa Jerome and his majestic af printer.",
        "created_utc": 1598975373,
        "id": "g3lomyk",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599004173.0
    },
    {
        "author": "exoticoptions",
        "body": "Holding Intel. Should run.",
        "created_utc": 1599113526,
        "id": "g3te5hs",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599142326.0
    },
    {
        "author": "Taco_In_Space",
        "body": "Whoever told me to go on on INTC screw your boomer stock",
        "created_utc": 1599063875,
        "id": "g3qhirk",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599092675.0
    },
    {
        "author": "ltsPricedIn",
        "body": "nah bruh intel is the stat that allows you to cast spells",
        "created_utc": 1599015691,
        "id": "g3od7gy",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599044491.0
    },
    {
        "author": "wallthrowawaystreet",
        "body": "Today is the day, INTC bagholders.\n\nToday, INTC goes above and stays above 50.\n\n\\*tightens helmet around my head, drools with a dreamy smile on my face\\*",
        "created_utc": 1600172436,
        "id": "g5cjqyk",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600201236.0
    },
    {
        "author": "widespreadhammocks",
        "body": "So is Nvidia basically making Apple chips now? Did they just totally cuck Intel?",
        "created_utc": 1600041330,
        "id": "g56iuf8",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600070130.0
    },
    {
        "author": "FinndBors",
        "body": "Well, it gives more confidence that their ARM based Mac that they are rumored to release in November is going to be quite performant, which is the primary concern on moving away from Intel.",
        "created_utc": 1600201292,
        "id": "g5ec0t6",
        "score": 10,
        "subreddit": "stocks",
        "created": 1600230092.0
    },
    {
        "author": "7thAccountDontDelete",
        "body": "INTC looks real nice compared to AMD and NVDA. 9 PE, still very profitable, nice dividend.",
        "created_utc": 1599961074,
        "id": "g50o32k",
        "score": 10,
        "subreddit": "stocks",
        "created": 1599989874.0
    },
    {
        "author": "Wastelandrider",
        "body": "Look man I’m no expert but I’m pretty sure this is a really really bad idea. Fedex is gonna be wild at open and I can see a lot of people taking profits Monday with all the uncertainty about the market this coming week and especially with this having the hallmarks of a now classic covid era ER pump and dump. I myself am bullish on FDX staying propped up by institutional money to balance out all the gamblers, but not “20%-run-within 10-days bullish” and considering the frenzy at open, this far otm isn’t gonna qualify as an IV play either. \n\nPlus I’d probably be actually more bullish on the intc calls you already have that are close to the money anyway. \n\nBut then again all my information comes from like 8 minutes of a YouTube video I watched last week so whatever man...\n\nYOLO.",
        "created_utc": 1600055475,
        "id": "g5767zf",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600084275.0
    },
    {
        "author": "B0KCH0Y",
        "body": "Stripper I have on snap chat said she made 3 bands today. Same thanks intc and cost you making me stripper money.",
        "created_utc": 1599083285,
        "id": "g3rw7n4",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599112085.0
    },
    {
        "author": "Persian_Allah",
        "body": "Oh lord INTC IS GONNA MOOONNNNN they just announced some hype shit",
        "created_utc": 1599062763,
        "id": "g3qesg7",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599091563.0
    },
    {
        "author": "yCranjisMcBasketball",
        "body": "Wake up and pop a cialis and think about the guy that tried shorting Tesla while I do pushups waiting for my Intel calls to pump",
        "created_utc": 1598992692,
        "id": "g3n09rg",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599021492.0
    },
    {
        "author": "Oni_Haze",
        "body": "INTC just break $52 you fucking tease",
        "created_utc": 1599058024,
        "id": "g3q30rz",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599086824.0
    },
    {
        "author": "gaysaucemage",
        "body": "Intel should stream to Youtube, this is why people hate them. We don’t wanna register for boomer investor relations...\n\n\nhttps://www.cvent.com/events/intel-launch-event/registration-a906cbb167f841b4b335a17ccc057f6d.aspx?r=cc8c6bf6-30c1-49d6-8bd0-3152c74e5988&amp;refid=Media&amp;tystub=77qq83&amp;fqp=true",
        "created_utc": 1599062718,
        "id": "g3qep43",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599091518.0
    },
    {
        "author": "giancarlov345",
        "body": "intel wakeup faggot",
        "created_utc": 1599065244,
        "id": "g3ql2eg",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599094044.0
    },
    {
        "author": "realjpow",
        "body": "Intc 💎 🖐",
        "created_utc": 1599064395,
        "id": "g3qiu68",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599093195.0
    },
    {
        "author": "mystriddlery",
        "body": "Intel has once again delayed production of their 7nm mountain bike as they think it’s still too small for human riders, now expecting a 2022 release date",
        "created_utc": 1599514308,
        "id": "g4dpla9",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599543108.0
    },
    {
        "author": "SillyfkiNGo0se",
        "body": "Intel is fukd",
        "created_utc": 1600042359,
        "id": "g56kkzd",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1600071159.0
    },
    {
        "author": "Shadicare",
        "body": "My INTC calls went up almost 30% today with the stock going -0.31%.  Imagine what they'll do when it moons tomorrow",
        "created_utc": 1599006739,
        "id": "g3nvx60",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599035539.0
    },
    {
        "author": "stamou5214",
        "body": "Hey, I'm a gamer and tech enthusiast and I know a couple of things. I'm only going to comment about what you said about the 11th gen being 30% better than AMD. Wrong. The benchmarks where cherry picked and highly in favor of intel, not going to go into specifics. They were just bullshit. If you are really interested i suggest you look it up yourself. Check hardware unboxed and gamernexus for real benchmarks on YouTube. Best of luck with your stocks.",
        "created_utc": 1599861139,
        "id": "g4vbye9",
        "score": 9,
        "subreddit": "stocks",
        "created": 1599889939.0
    },
    {
        "author": "Y_u_lookin_at_me",
        "body": "As a IT person  before I buy a tech stock I study their hardware architecture and see if it's competitive in the market and then buy right before it drops, watch the stock go up, and then sell. I knew amd's heterogeneous architecture was going to be a hit back when amd was 3-5$ ( I didn't have capital back then but my coworker did and he made like sixty racks at least) so I'm gonna be looking into AMDS RDNA and Navi 2. I also keenly watch what new company Jim keller goes too as he's a genius and made apples soc, ryzen, tesla's insane 21x improvement soc, etc. Right now he's in Intel trying to save their burning so perhaps Intel's new architecture is going to win but I doubt it.",
        "created_utc": 1600372348,
        "id": "g5mhczd",
        "score": 9,
        "subreddit": "stocks",
        "created": 1600401148.0
    },
    {
        "author": "PhatCalls",
        "body": "My INTC printing straight Benjamin franklins bitch",
        "created_utc": 1599096845,
        "id": "g3so1kb",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599125645.0
    },
    {
        "author": "AceVonSpades",
        "body": "Ill try to make this quick for those fortunate enough to still have buying power after today\n\nThis market is in warp speed, tech sector moves into \"return to normal\" phase within the next week-ish(tmrw wouldnt surprise me).  Some undervalued tech wont be as affected and will continue upward movement(see INTC) and some relative strength will remain in the sector. But expect more bleeding from the ones that had yuge run ups (ZM)\n\nNext leg up will be fueled by recovery plays to build on top of the already strong tech sector.  The vaccine is coming whether you like it or not. Put your political b.s. aside.  This is going to be a green light for getting covid impacted businesses going again at almost 100%. Again, just because you dont like Trump isnt a good counter argument.  Get over it.  Position yourselves accordingly; things like (good)airlines, cruise lines, retail, restaurants, DIS...  might even add in financials\n\nPersonally, I'll be leaving a little bit of reserves to savagely go balls deep into Palantir when they do their ipo later this month.\n\nThanks for coming to my Ted Talk",
        "created_utc": 1599180878,
        "id": "g3xjb25",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599209678.0
    },
    {
        "author": "smallstreetgains",
        "body": "##Top trending tickers, sentiments, and options on /r/wallstreetbets for the day of September 02, 2020.\n\n────────────────\n\n###Trending Tickers:\n\n**Ticker**|**Company**|**Mentions**|**Bulls / Bears**|**Price**|**Change**|**P/E**\n:-:|:--|:-:|:-:|:-:|:-:|:-:\nTSLA|Tesla, Inc.|1638|78.10% / 21.90%|$440.56|-7.26%|1222.47\nAAPL|Apple Inc.|699|85.84% / 14.16%|$131.44|-2.04%|40.79\nRKT|Rocket Companies, Inc.|624|84.44% / 15.56%|$32.46|5.70%|47.17\nNVDA|NVIDIA Corporation|441|82.11% / 17.89%|$572.09|3.48%|101.36\nSPY|Exchange Traded Fund|303|66.50% / 33.50%|$357.69|1.44%|-\nINTC|Intel Corporation|303|89.08% / 10.92%|$52.59|3.55%|9.34\nPTON|Peloton Interactive, |259|92.93% / 7.07%|$90.06|7.64%|-\nMSFT|Microsoft Corporation|169|90.57% / 9.43%|$232.06|2.11%|39.43\nCRWD|CrowdStrike Holdings,|124|88.00% / 12.00%|$141.63|-1.44%|-\nDOCU|DocuSign, Inc.|124|84.13% / 15.87%|$264.82|-1.48%|-\nDKNG|DraftKings Inc.|123|87.18% / 12.82%|$39.95|8.19%|671.45\nQQQ|Exchange Traded Fund|118|80.00% / 20.00%|$303.03|1.04%|-\nZM|Zoom Video Communicat|117|50.00% / 50.00%|$425.35|-7.07%|2528.67\nAMD|Advanced Micro Device|99|76.19% / 23.81%|$90.14|-2.21%|183.26\nVXX|Exchange Traded Fund|97|87.50% / 12.50%|$28.06|2.90%|-\nWMT|Walmart Inc.|92|95.65% / 4.35%|$147.93|0.23%|28.07\nCHWY|Chewy, Inc.|76|83.87% / 16.13%|$70.66|1.77%|-\nWORK|Slack Technologies, I|75|85.96% / 14.04%|$33.52|-2.27%|-\nFB|Facebook, Inc.|71|89.47% / 10.53%|$302.57|2.41%|37.69\nAMZN|Amazon.com, Inc.|56|91.30% / 8.70%|$3530.01|0.88%|134.50\nSLV|Exchange Traded Fund|56|83.33% / 16.67%|$25.55|-2.24%|-\nCOST|Costco Wholesale Corp|55|95.24% / 4.76%|$359.57|2.33%|41.53\n\n\n────────────────\n\n###Trending Options:\n\n**Ticker**|**Strike**|**Type**|**Expiration**\n:-:|:-:|:-:|:-:\nTSLA|$500|Call|9/4\nRKT|$30|Call|9/18\nTSLA|$500|Call|10/16\nAAPL|$135|Call|10/16\nCRWD|$200|Call|9/4\nRKT|$40|Call|9/18\nAAPL|$140|Call|9/18\nINTC|$55|Call|9/11\nPTON|$100|Call|9/11\nNVDA|$600|Call|9/4\nNVDA|$570|Call|9/4\nINTC|$52|Call|9/11\nFDX|$240|Call|9/25\nAAL|$13|Call|9/11\nPTON|$90|Call|9/18\n\n\n────────────────\n\n###Trending Sentiment:\n\n**Sentiment**|**Comments**|**%**\n:--|:--|:--\nBullish|2883|72.90%\nNeutral|13126|-\nBearish|1072|27.10%\n\n\n────────────────\n\n###Other Data:\n\n**Overall Market Sentiment:** Bullish\n\n**Comments Searched:** 17081\n\n**Newly Trending Tickers:** DKNG, COST\n\n────────────────\n\nYou can view all top trending tickers on /r/RedditTickers.\n\nNotice an error or have questions? Reply to this post or message /u/smallstreetgains.\n\nFinancial data provided by [finviz](https://finviz.com/).",
        "created_utc": 1599077228,
        "id": "g3rgrw8",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599106028.0
    },
    {
        "author": "dd16134",
        "body": "Tomorrow’s game plan:\n1. Sell BABA $300c at open peak for juicy profit\n2. Maybe buy one 12/18 $170c for $WMT\n3. Put rest of my account into $TSM $85c for 10/16 (look it up- multiple hedge funds picked it up this week, unusual options activity, good earnings expected 10/15, talks with Trump about moving business into Arizona, leagues ahead of Intel tech wise, AMD/NVDA are customers)",
        "created_utc": 1599010779,
        "id": "g3o4efh",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599039579.0
    },
    {
        "author": "Today-",
        "body": "When is this supposed INTC announcement?",
        "created_utc": 1599062764,
        "id": "g3qesjh",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599091564.0
    },
    {
        "author": "jdp111",
        "body": "Is it racist to say Intel needs an Asian CEO to turn them around?",
        "created_utc": 1599001827,
        "id": "g3nkr5t",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599030627.0
    },
    {
        "author": "WagieInTheCagie",
        "body": "INTC gang we out here 👌 If you ain't wit us you against us 🙅🏿",
        "created_utc": 1599057949,
        "id": "g3q2udf",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599086749.0
    },
    {
        "author": "Today-",
        "body": "Feeling fucking thankful for the bread this week.\n\n&amp;#x200B;\n\n\\+140% on PLAY (only $140 position but /shrug im happy)\n\n\\+100% on WMT on both earnings AND + announcement, two separate trades.\n\n\\+60% on INTC today\n\n\\+50% on M earnings overnight\n\nVXX even gave me 5%-10% as a fucking hedge.\n\nFor the losses:\n\n\\-30% on PSX calls\n\n\\-30% on RAD calls\n\n\\-10%on  MJ calls\n\nbut fortunately these were smaller positions, and much less % lost.\n\nA good week after getting wiped for 5k in June.",
        "created_utc": 1599066015,
        "id": "g3qn268",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599094815.0
    },
    {
        "author": "mathboom123",
        "body": "I have a feeling INTC is gonna moon",
        "created_utc": 1599526837,
        "id": "g4eb3lc",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599555637.0
    },
    {
        "author": "saifly",
        "body": "Holding January AAPL 150 calls, January INTC 60 calls and October TSLA 500 calls\n\nThings will be ok... r-right? 🥺🥺🥺",
        "created_utc": 1599336776,
        "id": "g45sg64",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599365576.0
    },
    {
        "author": "BenjerminGray",
        "body": "how is x86 companies like AMD and INTEL gonna benefit from this?",
        "created_utc": 1600054718,
        "id": "g57540y",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1600083518.0
    },
    {
        "author": "yCranjisMcBasketball",
        "body": "We all been sitting parked waiting for the INTC tendietown express to blow the whistle",
        "created_utc": 1598996110,
        "id": "g3n8pr7",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599024910.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Imagine INTC announces 7nm back on track to finish production  Early..... 🙌🙌",
        "created_utc": 1599060641,
        "id": "g3q9emk",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599089441.0
    },
    {
        "author": "Throwawayeconboi",
        "body": "Pros of playing INTC: you survived/shrugged-off Thursday and Friday.\n\n\nCons of playing INTC: you also shrugged off the entire month of gains.",
        "created_utc": 1599532360,
        "id": "g4ek8s6",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599561160.0
    },
    {
        "author": "BlackBearMundane",
        "body": "Hi all, new to the WSB community and Reddit in general. Over the last month while patiently waiting to contribute posts to this form, I decided to try options trading. Took my 2k of investing monies up to 4.5k in just a couple days. Pure excitement. Then beginners luck ran out and I slowly dwindled down to a mere $30.... here I am now holding a $90 9/18 call on Starbucks and a $51 9/11 call on Intel. Pls pray for me",
        "created_utc": 1599783196,
        "id": "g4rttvh",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599811996.0
    },
    {
        "author": "Maximatux",
        "body": "HOLY SHIT THIS INTEL ANNOUCEMENT IS STRAIGHT UP CRINGE.",
        "created_utc": 1599063287,
        "id": "g3qg026",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599092087.0
    },
    {
        "author": "getgoingfast",
        "body": "If anything, this is bad new for INTC. \n\nCoupled with ARM's CPU and GPU, Nvidia is major threat to already wobbly Intel's DCG business. Yet people on here debate how undervalued INTC is right now (10nm fail check, 5G fail check, Nirvana ML fail check,  McAfee fail check, 6 months delay of 7nm check...), see the reason?",
        "created_utc": 1599945236,
        "id": "g4zbw8q",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599974036.0
    },
    {
        "author": "infinitelimits00",
        "body": "At this rate even Intel might be up 1% 😂😂",
        "created_utc": 1600049255,
        "id": "g56wcyd",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600078055.0
    },
    {
        "author": "DFB313",
        "body": "on the contrary. They stand to gain the most of anyone on earth.   \n\n\nSuddenly if you want their datacenter grade GPUS (they limit industry use GPUS and APUS) you have to use ARM as they only make drivers for ARM for those GPU.\n\n  \nThen suddenly, just maybe, they plan to stop supporting x86\\_64 completely, and develop something not unlike risc-v with the previous ARM team behind it. They now have a proprietary chip with none of the backwards compatability slow downs that come with Intel based chips. (they hold backwards compatible registers going back to the 1970s, taking up valuable die space).   \n\n\nSuddenly RISC might be able to leverage it's benefits to become CRISC-V with that kind of backing, and since RISC is always clock cycle fast, x86 will literally die when CRISC-V comes (multiple RISC executions per clock cycle, a complex reduced instruction set computer).   \n\n\nThat's it. That's game over. One architecture ecosystem",
        "created_utc": 1599979983,
        "id": "g525dvg",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600008783.0
    },
    {
        "author": "namsilat",
        "body": "I’m trapped in a fucking observer effect with my INTC leaps.    I’ve been holding the position and bleeding out for months.  Once I sell, it will explode, if I don’t sell, it will bleed out theta for the next 1000 years.\n\nI need to somehow watch it without watching it.",
        "created_utc": 1600101850,
        "id": "g58zphs",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600130650.0
    },
    {
        "author": "accountinreddit",
        "body": "You guys are missing out on the scoop of the century, the trucks have HTML5 super computers and using they have built their own chips. \n\nNvidia, Intel, Cisco all are worried and believe this can bankrupt them",
        "created_utc": 1600138360,
        "id": "g5bguh9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600167160.0
    },
    {
        "author": "sleepyguy007",
        "body": "intels 10nm+ process that tigerlake-u is using has about the same density as the tsmc 7nm+ process (which I think the zen3 chips will use... the current zen 2 chips use tsmc 7nm non plus which is less density than intel 10nm+.... the process names are basically just marketing labels and almost meaningless).\n\nThe reason those benchmarks look good for intel is they spent way more of the die on GPU than they usually do and have better clock speed  than the current ryzen 4800u.  So per core they are doing better and also more gpu speed / cores.   They sacrificed cores for that, hence the lower multithreaded.  I'd guess intel figures most people using thin and light notebooks don't really need 8 cores and would rather have more GPU., probably a good tradeoff for most people\n\nThere will eventually be a tigerlake - H is rumored to actually have less GPU onboard than tigerlake-u since I guess its assumed those will use discrete graphics anyway.  So Intel probably will sell a lot of tigerlake.  It shouldn't really lose much ground on laptops if any in the next year or 2.  I do own a lot of intel shares, and fully expect it to get back to $60 ish in the next 3-6 months.  There is actually a shortage of laptops / chromebooks right now because of the wfh / school from home thing even for the older cpus so Intel should do allright",
        "created_utc": 1600361169,
        "id": "g5lpmnv",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1600389969.0
    },
    {
        "author": "sc0tt_1990",
        "body": "Intel just went red AH, it's over boys, it's over for tech.",
        "created_utc": 1599173760,
        "id": "g3x18is",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599202560.0
    },
    {
        "author": "TEdward504",
        "body": "This futures turn around got me feeling like INTC will moon tomorrow",
        "created_utc": 1599098138,
        "id": "g3sqiyx",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599126938.0
    },
    {
        "author": "Jackie296",
        "body": "If INTC manages to pull a nvda AH, I will be in tendie heaven. From -70% to +10%",
        "created_utc": 1599058475,
        "id": "g3q43ho",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599087275.0
    },
    {
        "author": "jaguarpawww",
        "body": "lost a quick 40% on my intel calls in the last 2 hours.. sick sick",
        "created_utc": 1599066946,
        "id": "g3qpjws",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599095746.0
    },
    {
        "author": "somanychins",
        "body": "INTC moved after hours. I wouldn't believe it if I hadn't seen it. 🐯Lake Time.",
        "created_utc": 1599001414,
        "id": "g3njtn9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599030214.0
    },
    {
        "author": "swaggymedia",
        "body": "Todays WSB Sentiment, Presented by Swaggy\n\nTotal Comments Parsed Last 24hrs: 50,497\n\nLots of long $ROPE today.\n\nTicker | Comments | Bullish %\n:--|:--:|:--:\nTSLA|3489|80%\nAAPL|1752|88%\nRKT|797|81%\nQQQ|377|77%\nNVDA|369|83%\nPTON|294|93%\nZM|260|60%\nDOCU|257|90%\nAMZN|228|80%\nMSFT|209|87%\nAMD|167|82%\nSLV|162|79%\nINTC|151|88%\nWMT|148|91%\nUVXY|137|82%\nSAVE|136|86%\nFDX|135|92%\nROPE|127|90%\nGLD|124|80%\nFB|98|83%\nEAT|92|81%\nTQQQ|83|79%\nUPS|83|82%\nCOST|82|86%\nCRWD|82|84%",
        "created_utc": 1599169629,
        "id": "g3wpxrt",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599198429.0
    },
    {
        "author": "WagieInTheCagie",
        "body": "If you're not in INTC you ain't black",
        "created_utc": 1599055988,
        "id": "g3pya86",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599084788.0
    },
    {
        "author": "Frostfright",
        "body": "If you sell INTC now, your melanin is forfeit.",
        "created_utc": 1599066599,
        "id": "g3qok62",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599095399.0
    },
    {
        "author": "hawkbearpig",
        "body": "Tiger lake has horrible yields.  OEMs are reporting that their orders from Intel are being massively shorted.  Not only that, it's waaaay expensive for Intel to manufacture because of the horrible yields.  \n\n\nNo thanks.  I'm staying away from this garbage company that is bleeding talent.  It's a technology company that is led by bean counters.",
        "created_utc": 1599242549,
        "id": "g40mjmn",
        "score": 8,
        "subreddit": "stocks",
        "created": 1599271349.0
    },
    {
        "author": "moneygardener",
        "body": "Both $AMD and $AAPL uses $TSM for the manufacturing of their chips.  \n\n\nIt's TSMC who has the fabs where they are developing smaller and smaller transistors (nodes)\n\nApple is their biggest customer and has first \"dibs\" on the newest nodes.\n\nThis is why apple comes first with 5nm.\n\nAMD to follow.\n\nPoor INTC :P nah just kidding. INTC is Evil.",
        "created_utc": 1600205366,
        "id": "g5ell6t",
        "score": 8,
        "subreddit": "stocks",
        "created": 1600234166.0
    }
]