[
    {
        "author": "BigTendie08",
        "body": "4 straight minutes \n\nNot a cough\n\nNot a wheeze\n\nHe sounded more cognizant than normal if anything.",
        "created_utc": 1601766155,
        "id": "g7kmvb8",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1601794955.0
    },
    {
        "author": "RealisticHumanBot",
        "body": "Market is cognizant of the risk but it has not priced it in because the chances are fairly miniscule. We would still drop a fair bit",
        "created_utc": 1601945936,
        "id": "g7umssq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601974736.0
    },
    {
        "author": "lostitlosingit",
        "body": "I’m not in FIG, but I focus on a geography where a huge % of the investable universe is FIG. The other thing is that the banking system there is an oligopoly, so I don’t run into regional banks, and unfortunately can’t help you there.  I think with wholesale vs retail, especially if you’re dealing with smaller banks, you have to be cognizant that wholesaled can be a much flightier source of capital if there’s a crisis of confidence. I would make sure you understand average deposits/ broker, you don’t want one broker controlling $100s of MM. \n\nOne thing to also focus on is % of revenue that comes from fees - you have some banks in my geography where 60% of the revenues come from account and credit card fees, which is hugely advantageous as you aren’t exposed to rates. Then you’re almost a tolling business, not a bank. Not sure if that helps considering how oligopolistic my universe is, but that’s my $0.02!",
        "created_utc": 1602350376,
        "id": "g8cakjw",
        "score": 1,
        "subreddit": "investing",
        "created": 1602379176.0
    },
    {
        "author": "eli_lilly",
        "body": "Depending on who your broker is, you'll want to be cognizant as to the situation that can arise if you hold the option to its expiration. Some brokers will automatically sell it starting around 3pm on the day of expiration. Other brokers will \"exercise\" it, which means you'd have to pay for the underlying stock at that point.",
        "created_utc": 1602265749,
        "id": "g88jz61",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602294549.0
    },
    {
        "author": "i_accidently_reddit",
        "body": "how in the world is cognizant a competitor of palantir? out of the bunch the only one doing something remotely similar is splunk, and they are way to focussed on web stuff. (that means they are civil, and while that is also a good market, the margins are smaller) That's like saying Toyota is a competitor to Ferrari \n\nthe attraction of pltr is that it sits in a niche between technology that BAE or booz allen cant do, Niche abilities that IBM cant do, and technical expertise that Accenture or Avanade cant deliver.\n\nThere is no real competitor, and it is night impossible to build a similar company.\n\ntech talent loves them. they are almost always top of the list for the best of the best engineers, up there with google, jane street, elastic or shopify.",
        "created_utc": 1602077780,
        "id": "g801m31",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602106580.0
    },
    {
        "author": "TheMajorMedic",
        "body": "Not even joking, I go take a shit to check my portfolio and see everything fall down.\n\nLocked in the profits, will buy back later.\n\nEdit: Of all the stocks I'm still holding, only cruise lines are still green. Unbelievable.\n\nEdit 2: Just moved heavy into renewables: SPWR, CSIQ, PLUG, FSLR, ENPH.",
        "created_utc": 1602011474,
        "id": "g7xbwux",
        "score": 18,
        "subreddit": "stocks",
        "created": 1602040274.0
    },
    {
        "author": "fr33_",
        "body": "i spent months losing most my money. Put $20k in, wound up with like $3500 left. I give up, transfer most to a boomer account to do slow stocks, and only keep $1000 to play options with.\n\nOf course now I've been playing regular 20% day gains with almost no money.\n\nPositions: ETR, SPWR, and ENPH calls, figuring that a [Joey-Boy] win would rally those stocks and after the [public discussion last tuesday] it seemed likely.\n\nGay as fuck.",
        "created_utc": 1602005113,
        "id": "g7wwvx8",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1602033913.0
    },
    {
        "author": "Inferno456",
        "body": "Why was clean energy so good this week? TAN and ENPH were amazing",
        "created_utc": 1601595258,
        "id": "g7cegme",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1601624058.0
    },
    {
        "author": "JDjacket",
        "body": "My options got straight murdered in September, but decided to check the boomer stock portfolio and it actually went up 10% in September. Praise be to DKNG, LAC, and ENPH for saving it",
        "created_utc": 1601580919,
        "id": "g7bkkv2",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1601609719.0
    },
    {
        "author": "Yesrisk_noreward",
        "body": "I have no clue how people actually make solar energy into a profitable business model, but my $TAN and $ENPH calls are pumping. I don't even know the real names of these tickers.",
        "created_utc": 1602008743,
        "id": "g7x5kls",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602037543.0
    },
    {
        "author": "jeoportmanteau",
        "body": "I can't speak to NET, but my general advice is that if you're holding long term, adding the stock at a premium will be cheap compared to waiting on the sidelines hoping it will drop in price. As for REGI, I invested a couple years ago and since then they have shot up during the lockdowns. I think it's fairly valued finally, but if you want to buy in I wouldn't discourage you. They have so many positive catalysts going for them right now. With higher RIN prices, rejections of oil refinery exemptions from the renewable fuel standard, price target increases, Blender's Tax credits through 2022 and a future renewable diesel plant TBA, I'm still very bullish on this stock long term. Not to mention they could beat earnings in Q3. As for ENPH, I've been doing research on the company and its fundamentals before I invest in them. From what I've learned, the company seems to be rising due to recent analyst upgrades along with positive sentiment for renewables in general. I'd say that long term, clean energy is a great investment and you won't regret buying in even at it's high valuation. My advice, I'd look more towards a mix of clean energy stocks in ICLN or TAN, which will give you exposure to solar stocks broadly.",
        "created_utc": 1601624217,
        "id": "g7dopn0",
        "score": 4,
        "subreddit": "stocks",
        "created": 1601653017.0
    },
    {
        "author": "Shooter_Eye",
        "body": "SEGD vs ENPH, or should I just go with ICLN?",
        "created_utc": 1601936594,
        "id": "g7u6b9a",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601965394.0
    },
    {
        "author": "Grymninja",
        "body": "Same (well 3.3). Love it. ENPH and Nio going to take me to the promised land.",
        "created_utc": 1601930261,
        "id": "g7ts9me",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601959061.0
    },
    {
        "author": "WrongTechnician",
        "body": "ENPH is a beast",
        "created_utc": 1601927960,
        "id": "g7tmo3w",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601956760.0
    },
    {
        "author": "little87",
        "body": "Enph 🙌",
        "created_utc": 1601927855,
        "id": "g7tmfn6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601956655.0
    },
    {
        "author": "sarvesh0517",
        "body": "Call Debit spreads : NTLX oct 16,2020 $515/$520; ENPH 11/20 $90/95\n\nCalls: DIS $120 Dec 18; SPXL $51 Jan 15; CCL $12.5 jan 15\n\nPut: Sqqq $24 Jan 15 21\n\ntime to delete the app and com out either broke or rich",
        "created_utc": 1601656967,
        "id": "g7f0mfq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601685767.0
    },
    {
        "author": "chifredosul",
        "body": "Solar stocks are on a tear. SPWR &amp; ENPH to the ~~moon~~ Sun!",
        "created_utc": 1601915029,
        "id": "g7svf34",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601943829.0
    },
    {
        "author": "ScantilyCladLunch",
        "body": "Both ENPH and SEDG have gone up 25ish% in the past month, and 50ish% in the past 6 months. Why sell one to grab the other?",
        "created_utc": 1601933612,
        "id": "g7u04vb",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601962412.0
    },
    {
        "author": "PhantomChihuahua",
        "body": "Should’ve held ENPH. Jebus...",
        "created_utc": 1602008297,
        "id": "g7x4j14",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602037097.0
    },
    {
        "author": "captainstrange94",
        "body": "Bro I bought ENPH for the first time last week ($88), I think it's still going to go up in the coming months.",
        "created_utc": 1601933372,
        "id": "g7tzm7a",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601962172.0
    },
    {
        "author": "anchelus",
        "body": "same here but ENPH",
        "created_utc": 1601928468,
        "id": "g7tntvg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601957268.0
    },
    {
        "author": "AccomplishedWin2",
        "body": "Regarding ENPH, it seems cool but it may be a bit too exposed to consumers. I have a clean energy ETF position and it grew 20% in the last month and can't go down a lot cuz it's globaly exposed. If you want clean energy ETFs, or even stocks, look for something globaly exposed. \nI don't trust chinesse stocks for the love of my life, so I stay away even from BABA. My friends used to buy from there (I am from EU) and atm they dont anymore due to trust issues regarding the products and if the gov is involved in the business.\nSE is cool. I just looked it up and I love it. Everything video games relating is cool af. Shoutout to video games ETFs btw.",
        "created_utc": 1602019322,
        "id": "g7xtiz6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1602048122.0
    },
    {
        "author": "GenTelGuy",
        "body": "ENPH is just absolutely insane lately - definitely going to hold long-term. Enormous winner",
        "created_utc": 1601580729,
        "id": "g7bk40x",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601609529.0
    },
    {
        "author": "BOOmabad",
        "body": "ENPH could touch 100 today :o",
        "created_utc": 1602002943,
        "id": "g7ws0o6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602031743.0
    },
    {
        "author": "Bekabam",
        "body": "Pretty much all solar follows this.\n\n$ENPH, $FSLR, $SEDG, $PLUG, and even the ETF that has all of these in it $TAN",
        "created_utc": 1601918976,
        "id": "g7t4gsb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601947776.0
    },
    {
        "author": "WhiteHoney88",
        "body": "Are we partying yet?! Also SEDG is doing\nSoooo well. Curious if you are buying more enph or holding?",
        "created_utc": 1602033834,
        "id": "g7yjg1m",
        "score": 2,
        "subreddit": "investing",
        "created": 1602062634.0
    },
    {
        "author": "TonguePressedAtTeeth",
        "body": "Told y’all ENPH.  Still going to run.",
        "created_utc": 1602002499,
        "id": "g7wr4ie",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602031299.0
    },
    {
        "author": "Biztheroadthewealth",
        "body": "ENPH gang. Are we at the top?",
        "created_utc": 1601927696,
        "id": "g7tm2vv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601956496.0
    },
    {
        "author": "SuperJackpot",
        "body": "IMO you can't go wrong with ENPH. They have the products, the cash, and the growth - in the hottest industry on the planet.",
        "created_utc": 1601989448,
        "id": "g7w2v0s",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1602018248.0
    },
    {
        "author": "no_more_Paw_patrol",
        "body": "$ENPH seems to only go up.",
        "created_utc": 1602005801,
        "id": "g7wyjvu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602034601.0
    },
    {
        "author": "Ensemble_InABox",
        "body": "I’m a long time ENPH investor — we’ve had 4 short attacks / hit pieces in a year and a half. Two from prescient point, one from citron, and other. They’ve all been bogus",
        "created_utc": 1602012221,
        "id": "g7xdtpk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602041021.0
    },
    {
        "author": "ixamnis",
        "body": "**QCLN** might be something for you to look at.  **QCLN** is an ETF investing in renewable/clean energy.  The top holdings include:\n\n**NIO** \\- 8.58%\n\n**TSLA** \\- 6.63%\n\n**SEDG** \\- 6.63%  (Solar Edge Technologies) \n\n**ENPH** \\- 5.77%\n\n**ALB** \\- 5.27%  (Albemarle Corp)\n\n**RUN**  \\- 5.25% (SunRun)\n\n**BEP\\_UN:CA** \\- 4.45% (Brookfield Partners)\n\nFor an online Finance ETF, I'd probably recommend **ARKF**.  The top holdings are:\n\n**SQ** \\-12%\n\n**MELI** \\- 4.81%\n\n**Z** \\- 4.06%\n\n**TECHY** \\- 4%\n\n**ICE** \\- 3.9%\n\n**SE** \\- 3.9%\n\n**PINS** \\- 3.7%\n\n**AAPL** \\- 3.6%\n\n**TREE** \\- 3.5%\n\n&amp;#x200B;\n\nBy investing in these 2 funds, you tap into the two sectors you are interested in and the top holdings include the specific companies you want to invest in.  **QCLN** is both an EV and a clean energy sector, as opposed to **ICLN**, **TAN** and **FAN** which include only renewable energy companies but not EV companies.",
        "created_utc": 1601933617,
        "id": "g7u05a6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601962417.0
    },
    {
        "author": "terrortbh",
        "body": "ENPH really doesn’t quit",
        "created_utc": 1601929531,
        "id": "g7tqjl7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601958331.0
    },
    {
        "author": "locsandiego",
        "body": "I personally hold $VSLR, $NOVA, $JKS, and $SKYS in addition to $RUN, $ENPH, $SEDG. The rate of return are all very good, depending on when you got in.",
        "created_utc": 1601931295,
        "id": "g7tupm1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601960095.0
    },
    {
        "author": "futureIsYes",
        "body": "Ah, just mde a post about this! I decided to  cash in my EnPh (83% up), Cisr (53% up). I plan to buy solar edge or those two gain if there is  pullback. I am trying to get used to taking profits, after having seen many times  my 50%+ gains dwindle to low teens, or even negative in few cases..",
        "created_utc": 1601931350,
        "id": "g7tuue6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601960150.0
    },
    {
        "author": "TonguePressedAtTeeth",
        "body": "I’ve been scalping November 105s\n\nInvestment firms have prices ranging from 60-100 so I don’t know how much buying pressure is left at this point.  The runup was fierce but my thesis is that money is moving out of oil.  ENPH and FSLR and some other solar companies are in MM sight.",
        "created_utc": 1602003142,
        "id": "g7wsf1f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602031942.0
    },
    {
        "author": "Mad_Nekomancer",
        "body": "SFTBY gets mocked a lot by but they have a ton of cash right now and have more share buy-backs to go, and even a few months into a share buy-back program trade at a huge discount relative to their assets. Price might drop a bit if the Arm sale falls though but it's still a quality asset. Vision Fund 2 acquisitions are in progress and seem focused on higher tech stuff than the last one. \n\nBABA share value seems to have everything Trump can throw at it priced in, so I think it's a good buy whether long or short term. If the Ant IPO meets expectations the BABA price will rise for sure. \n\nI'm still looking to add green energy stocks. PLUG was up today, and ENPH was close to unchanged after having a good couple weeks. \n\nJPM is one I'm looking to buy at anything below $90 if it gets that low. \n\nMSGS seems like a good candidate for a nice return if you're willing to buy and hold 18 months or so.",
        "created_utc": 1602060530,
        "id": "g7zhtol",
        "score": 1,
        "subreddit": "stocks",
        "created": 1602089330.0
    },
    {
        "author": "nova46",
        "body": "ENPH has been doing wonderful lately. I am so pissed I sold my whole position a few months ago when the stock tanked due to fraud accusations. I bought back in recently and am up 35% already, but I would have been up almost 100% had I just held my original position.",
        "created_utc": 1601906707,
        "id": "g7sff51",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601935507.0
    },
    {
        "author": "SuperJackpot",
        "body": "ENPH is still underpriced IMO. When you look at a company like ZM that's worth $136 billion at peak and has nothing that another company can't just come in and do better, while ENPH which has the best inverter product on the market and a great pipeline in a rapidly growing sector and is worth $11 billion....",
        "created_utc": 1601910847,
        "id": "g7smyvy",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1601939647.0
    },
    {
        "author": "davidkaelin",
        "body": "&gt;SEGD\n\nI would do ENPH and ICLN if possible. ICLN captures global clean energy.",
        "created_utc": 1601947340,
        "id": "g7updfg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601976140.0
    },
    {
        "author": "MadCritic",
        "body": "Hi r/stocks \\- I'm 19 and have around $17k invested, mostly in growth stocks as the dividend tax is rather high in Denmark, so I don't see the point in invested in McDonald's and the such.  Anyway here's my portfolio\n\nAMZN 16,64%\n\nENPH 10,05%\n\nTSLA 9,07%\n\nAMD 8,67%\n\nAPPS 8,65%\n\nEXPI 8,55%\n\nSWKS 8,46%\n\nSE 8,14%\n\nMA 7,14%\n\nFB 6,92%\n\nPTON 6,82%\n\nI realize it's very techy, and I would like a suggestion on diversification. Also, am I too invested in growth?",
        "created_utc": 1601539505,
        "id": "g79mfkj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601568305.0
    },
    {
        "author": "WrongTechnician",
        "body": "ENPH is a beast",
        "created_utc": 1601648340,
        "id": "g7ejw0l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601677140.0
    },
    {
        "author": "DonCorleone47",
        "body": "Solar and renewable energy stocks have been going parabolic for 3 months straight, **VSLR** **ENPH** **SEDG** **RUN**",
        "created_utc": 1601648215,
        "id": "g7ejnon",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601677015.0
    },
    {
        "author": "jaanjaan1",
        "body": "I feel you on the enph. I saw the peak on enph and quickly sold bc I wasn’t sure what would happen after election. But man the regret is heavy haha",
        "created_utc": 1601582016,
        "id": "g7bnc1a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601610816.0
    },
    {
        "author": "Mossles",
        "body": "Enph!",
        "created_utc": 1601926753,
        "id": "g7tk7vf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601955553.0
    },
    {
        "author": "Napalm32",
        "body": "Enphase ENPH and Nvidia NVDA",
        "created_utc": 1601935163,
        "id": "g7u3nw1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601963963.0
    },
    {
        "author": "tannerp315",
        "body": "Personally I think either ICLN or ENPH",
        "created_utc": 1601919439,
        "id": "g7t5e3m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601948239.0
    },
    {
        "author": "Dongkey_kong",
        "body": "ENPH silently been tearing it up",
        "created_utc": 1601987627,
        "id": "g7w06yt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602016427.0
    },
    {
        "author": "MadCritic",
        "body": "EXPI APPS ENPH SWKS",
        "created_utc": 1601986965,
        "id": "g7vzb8t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602015765.0
    },
    {
        "author": "Thefishman1",
        "body": "Well ENPH  produces a very important product that is essential to the production of solar panels (micro inverters) they are continuously growing and doing better and better year over year,  EPS went from -.54 to 1.38 in two years (2019,) forbes) \n\nICLN is a good all rounder that covers the solar energy sector in general, and also gives me exposure to ENPH for not 70$ a share ( which, not having much cash to invest, I'll take)\n\nNET because technology is advancing at a very rapid rate, and when they went down a while ago, almost half the internet went down. They have services for free currently that will be paying in the future as well, and although they arent profitable yet, they will slowly get there.",
        "created_utc": 1602000837,
        "id": "g7wnsp5",
        "score": 1,
        "subreddit": "investing",
        "created": 1602029637.0
    },
    {
        "author": "Snow_Administrative",
        "body": "Run, ENPH, TAN",
        "created_utc": 1602022116,
        "id": "g7xys7s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602050916.0
    },
    {
        "author": "fr33_",
        "body": "Anyone else in solar gang with me??  ☀️☀️☀️☀️☀️☀️\n\nENPH, SPWR, ETR.  Am I the only one raking in money from these every day?",
        "created_utc": 1602076186,
        "id": "g7zyqo6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602104986.0
    },
    {
        "author": "dvdmovie1",
        "body": "ENPH is certainly technically overbought. That's not to say that it can't become more overbought or work off overbought condition by going sideways for a while, but I'd be cautious buying more with an RSI of nearly 80.",
        "created_utc": 1602062473,
        "id": "g7zjcx7",
        "score": 1,
        "subreddit": "investing",
        "created": 1602091273.0
    },
    {
        "author": "Yesrisk_noreward",
        "body": "YES ENPH YES YOU FAT BITCH YES",
        "created_utc": 1602070858,
        "id": "g7zrbv2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602099658.0
    },
    {
        "author": "gonemad16",
        "body": "Both sedg and enph popped the last 2 days with basically no news.   Enph did get a price target raise to 93, so I'm guessing that's the reason. The 2 stocks basically move together",
        "created_utc": 1601601029,
        "id": "g7cosxe",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601629829.0
    },
    {
        "author": "infininme",
        "body": "ENPH has been going up. BofA put a prediction to be at 92 next year, but i guess why wait!",
        "created_utc": 1601602269,
        "id": "g7cr6sz",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1601631069.0
    },
    {
        "author": "sylphvanas",
        "body": "wtf I sold my PTON and ENPH calls 2 days ago",
        "created_utc": 1601651085,
        "id": "g7ep0la",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601679885.0
    },
    {
        "author": "deplume",
        "body": "i browse this thread on and off pretty much every day...\n\n\nhow are none of you tards looking at solar stocks right now? big money is rotating out of oil in a huge way. Look at charts for ENPH, TAN and others...\n\nits overbought at the moment but every dip is an opportunity. This is like tech was 10 years ago. Oil has the rona and a vitamin D deficiency.",
        "created_utc": 1601648102,
        "id": "g7ejgfb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601676902.0
    },
    {
        "author": "MadCritic",
        "body": "ENPH TSLA and AMZN",
        "created_utc": 1601654528,
        "id": "g7evrs2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601683328.0
    },
    {
        "author": "platnumcy",
        "body": "for real though. ENPH was was one of the best calls I ever made.",
        "created_utc": 1601660452,
        "id": "g7f840g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601689252.0
    },
    {
        "author": "sunshinelighter",
        "body": "Hi 👋! Been in $ENPH since February 2019 when it was in single-digits and today, we hit the ATH.  \n\n\nWe have faced a few short hit pieces for ENPH in the past year, and each time, it turned out to be great buying opportunities. There is no doubt that this company is a $100+/share company and with the upcoming earnings, it'll most likely be a solid run. The demand can't keep up with the supply, if you listen to the last earnings call.\n\n&amp;#x200B;\n\nLong term, trust the company, and trust Badri. If anything, this will retrace in the coming weeks, before blowing past for the earnings.",
        "created_utc": 1601599435,
        "id": "g7clnsm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601628235.0
    },
    {
        "author": "sunshinelighter",
        "body": "I'm betting everything on ENPH to succeed in the long term. The lineup for their technology and what they have coming in the pipeline is certainly going to be taking larger market share away from SEDG.   \n\n\nI love SEDG, but I love ENPH a little more. Both investments won't go wrong though.",
        "created_utc": 1601599676,
        "id": "g7cm418",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601628476.0
    },
    {
        "author": "captainstrange94",
        "body": "Started from scratch in June after graduating in December and then clearing off some debts, currently have 4k in the following. Would appreciate some feedback. \n\nSQ (11.5%)\n\nAAPL (45.61%)\n\nAMD (16.49%)\n\nNET (4.18%)\n\nENPH (15.79%)\n\nSEDG (6.33%)",
        "created_utc": 1601659230,
        "id": "g7f5dzm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601688030.0
    },
    {
        "author": "Grymninja",
        "body": "I love all the main solar stocks and own a bit of all of them (majority ENPH though). I agree SEDG and ENPH definitely have more growth potential than residential focused companies like RUN. Even with an assumed Biden victory and solar tax credits, I don't understand RUNs valuation.\n\nI almost want to jump out now because I think it has to correct soon. Or maybe it will just run on hype through October? Ugh",
        "created_utc": 1601568359,
        "id": "g7arl91",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601597159.0
    },
    {
        "author": "SaveThemTurdles",
        "body": "I’m holding all my solar stocks. I think they have the most promise long term, regardless of the election. \n\nSEDG and ENPH both are leaders in the solar inverter manufacturing, with each company making a different type of inverter. Both very innovative companies as well trying to bring down costs of energy storage and transportation. TAN has SEDG and ENPH in the top 3 holdings if you like a less risky solar option.",
        "created_utc": 1601575639,
        "id": "g7b869h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601604439.0
    },
    {
        "author": "spacebizzle",
        "body": "SPWR, still only $2B market cap, well respected product, maybe the best panels in the industry. \n\nOther solar stocks\n\nRUN $9B, VSLR $5B, ENPH $10B, SEDG $11B\n\n Short % of Float   **43.60%**\n\nShort % of Shares Outstanding (Sep 15, 2020) **19.59%** \n\nWould love to see a big pop/short squeeze, seems like they have plenty of room to run.",
        "created_utc": 1601558516,
        "id": "g7a6tst",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601587316.0
    },
    {
        "author": "AusRtrd",
        "body": "And it’s buddy $enph",
        "created_utc": 1601561331,
        "id": "g7abmtt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601590131.0
    },
    {
        "author": "123elvesarefake123",
        "body": "Run Enph vslr :O",
        "created_utc": 1601563726,
        "id": "g7agwtf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601592526.0
    },
    {
        "author": "123elvesarefake123",
        "body": "Sedg tan enph vslr tan",
        "created_utc": 1601565189,
        "id": "g7ak8ir",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601593989.0
    },
    {
        "author": "MadCritic",
        "body": "EXPI APPS ENPH TSLA AMD SWKS SE PTON VWS",
        "created_utc": 1601574030,
        "id": "g7b4fvx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601602830.0
    },
    {
        "author": "nnguyen496",
        "body": "Clean energy is the future:\n\nICLN SEDG and ENPH together hold 30% of my portfolio",
        "created_utc": 1601634874,
        "id": "g7dzuzc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601663674.0
    },
    {
        "author": "TonguePressedAtTeeth",
        "body": "ENPH you nerds.",
        "created_utc": 1601646619,
        "id": "g7egurw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601675419.0
    },
    {
        "author": "brianjamesxx",
        "body": "Damn ENPH is insane. not FOMOing into that shit cuz itll dump $20 after I buy",
        "created_utc": 1601648042,
        "id": "g7ejcjc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601676842.0
    },
    {
        "author": "123elvesarefake123",
        "body": "Sedg vslr enph tan run now* go get em now tiger",
        "created_utc": 1601572086,
        "id": "g7b023o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601600886.0
    },
    {
        "author": "GenTelGuy",
        "body": "Both are good - they differ in balance sheet like you mentioned and in their tech. ENPH is microinverters sold on a per-panel basis whereas SEDG inverters are larger devices meant for handling your whole array. \n\nThis video talks about the differences between the products: https://youtu.be/hKRCGzz6-Ws\n\nENPH, SEDG, FSLR, I really think it's just a matter of having as much of all of them as possible.",
        "created_utc": 1601867047,
        "id": "g7r2gh4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601895847.0
    },
    {
        "author": "PhantomChihuahua",
        "body": "Is ENPH gonna go up every fucking day?",
        "created_utc": 1601918060,
        "id": "g7t2dc5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601946860.0
    },
    {
        "author": "poofscoot",
        "body": "Because im in ENPH :)",
        "created_utc": 1601918440,
        "id": "g7t38op",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601947240.0
    },
    {
        "author": "CIark",
        "body": "No, I had some 1-3 month out plays and common stock. Holding BABA ENPH TWTR leaps",
        "created_utc": 1601838847,
        "id": "g7pm3qc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601867647.0
    },
    {
        "author": "saipavan23",
        "body": "Is Enph a long time hold?",
        "created_utc": 1601906073,
        "id": "g7seca2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601934873.0
    },
    {
        "author": "ASV731",
        "body": "me too buddy. Fomo'd into AMD and ENPH",
        "created_utc": 1601908132,
        "id": "g7shy77",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601936932.0
    },
    {
        "author": "masque9",
        "body": "buy it. SEDG will diversity and is in way more markets the ENPH",
        "created_utc": 1601964363,
        "id": "g7vdziz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601993163.0
    },
    {
        "author": "LurksForTendies",
        "body": "ENPH,  RUN, SQ, or PYPL have been on a tear lately. SQ probably the best of the lot as it just...dominated...the magic crayon lines.",
        "created_utc": 1601988317,
        "id": "g7w16hy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602017117.0
    },
    {
        "author": "Em4ever520",
        "body": "I sold ENPH at 68 a couple of weeks ago so fml",
        "created_utc": 1601927982,
        "id": "g7tmpqa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601956782.0
    },
    {
        "author": "TonguePressedAtTeeth",
        "body": "Y’all been looking at ENPH at all?  Lots of money moving into green tech.  Oil is done.",
        "created_utc": 1601567271,
        "id": "g7ap2ki",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1601596071.0
    },
    {
        "author": "Big80sweens",
        "body": "Personally I won’t touch O&amp;G, call me crazy but even though we will consume for a long time the industry is on the decline. This is what I’m investing in on the energy/ green tech side: \n\nFunds: ICLN, QCLN, ACES\nStocks I own: AQN, NPI, FTS, BEP(C), BLX, RNW, ENPH, RUN\nInteresting green tech I have taken a punt on: DYA.TO, EWS.V, SHRC.V, POND.V, SAY.V (DYA I actually think will explode soon with the upcoming caveats)",
        "created_utc": 1601942133,
        "id": "g7ufx97",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1601970933.0
    },
    {
        "author": "Klacker",
        "body": "Fidelity wasting time warning me about online scams when the real danger is allowing my dumbass to buy options",
        "created_utc": 1601844494,
        "id": "g7pzemv",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1601873294.0
    },
    {
        "author": "CIark",
        "body": "Imagine being married and putting your savings into Robinhood. Do you know about the money your wife put into her boyfriends Fidelity account?",
        "created_utc": 1602527131,
        "id": "g8m54w1",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1602555931.0
    },
    {
        "author": "JStanten",
        "body": "Is fidelity recommending it or is there digital currency arm recommending it?",
        "created_utc": 1603576850,
        "id": "g9yiwzj",
        "score": 28,
        "subreddit": "investing",
        "created": 1603605650.0
    },
    {
        "author": "Fonference_Cun",
        "body": "Not Fidelity. Fidelity Digital Assets. And of course the crypto arm of Fidelity would say that.",
        "created_utc": 1602640000,
        "id": "g8r7z7s",
        "score": 25,
        "subreddit": "investing",
        "created": 1602668800.0
    },
    {
        "author": "mishka__",
        "body": "Fidelity sent me some message about managing risk after losing $6k on a few trades in September. Not sure where they were in March when I was down like $90k.",
        "created_utc": 1602475182,
        "id": "g8k7yal",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1602503982.0
    },
    {
        "author": "NordyNed",
        "body": "Fuck yeah fidelity",
        "created_utc": 1603224941,
        "id": "g9gw5p8",
        "score": 13,
        "subreddit": "pennystocks",
        "created": 1603253741.0
    },
    {
        "author": "Greenitthe",
        "body": "2002 AMZN is boomer FDs, can you imagine if they told their fidelity account manager they wanted to go all in on a book company? LOL",
        "created_utc": 1602189901,
        "id": "g85cxg6",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1602218701.0
    },
    {
        "author": "skilliard7",
        "body": "RH isn't a scam, but it's a low quality broker. Their app is glitchy, and their customer support is quite poor. They had a decent value proposition when they were the first to offer $0-fee trades with $0 account minimums, thus making them a good way for beginners to start investing with small sums of money.\n\nNowadays, there are so many other brokers/investment firms that offer $0 commission trades with way better support. The moment Fidelity offered free trades I jumped ship from Robinhood and never looked back.",
        "created_utc": 1602797023,
        "id": "g8xtxqv",
        "score": 13,
        "subreddit": "investing",
        "created": 1602825823.0
    },
    {
        "author": "Artivist",
        "body": "A word of caution. There is an endless amount of \"free\" youtube videos and courses from TD Ameritrade, TastyTrade, eTrade, Fidelity, etc. But, what they don't show you is how someone actually puts that knowledge to practice into developing a strategy that allows you to make an income while properly managing risk. The course I went through helped with that and may be most people don't necessarily have the issues that I ran into using these courses. But, in hindsight, I wasted way too much time just going through these free videos without really understanding how they work in the real world.     \n    \nEdit: I didn't want to appear as if I'm spamming but I got a couple of DMs asking about the course I took. It's from ZipTrader. You can get 70% of the information from his youtube channel. But, I wanted something more structured and he really goes in a lot more detail in the course. I highly recommend it. Check out his free videos on YouTube particularly the one on why he is a trader and if it resonates with you (like it did for me), and you want to go ahead and check out the course, DM me for a discount coupon.",
        "created_utc": 1601593017,
        "id": "g7ca0e6",
        "score": 13,
        "subreddit": "options",
        "created": 1601621817.0
    },
    {
        "author": "chikenbeer",
        "body": "Ask me what stock to DD, I'll consult Fidelity.",
        "created_utc": 1601779465,
        "id": "g7lqdgy",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1601808265.0
    },
    {
        "author": "gilly_b",
        "body": "VTI is great but how about adding some ~20% VXUS for international exposure? US returns have been great in the 2010s decade but the international market outperformed the American market in the 2000s decade. History suggests that such trends are cyclical. I recommended that you read [this Fidelity article](https://www.fidelity.com/viewpoints/investing-ideas/international-investing-myths) about international investing. I like QQQ as a growth fund, but you could also allocate a small percentage to VUG or MGK instead.",
        "created_utc": 1603587531,
        "id": "g9zceh1",
        "score": 10,
        "subreddit": "investing",
        "created": 1603616331.0
    },
    {
        "author": "Fonference_Cun",
        "body": "Yes, but there is a big difference, that statement coming from a traditional asset manager with Fidelity, and a director trying to hawk his own line of business at Fidelity Digital Assets.\n\nBesides, Wall Street guys have a terrible track record with calling innovation. If AMs are hawking cryptos but techies are fairly apathetic to it, then cryptos only have a future as a (very) alternative asset class. \n\nIdk why I would put my money in that, if it's essentially another form of financial assets like stocks and bonds, but it has no yield, and no legal or regulatory framework to protect my property rights.",
        "created_utc": 1602645122,
        "id": "g8rgfh2",
        "score": 9,
        "subreddit": "investing",
        "created": 1602673922.0
    },
    {
        "author": "Verix19",
        "body": "The next meme stock?  It's privately traded and pegged at $169 a share.  Only select few were allowed to invest.\nBest you can do atm is to invest in the companies that invested in SpaceX.  Namely Alphabet, Fidelity and a couple Venture Capital firms.",
        "created_utc": 1603398351,
        "id": "g9opal5",
        "score": 9,
        "subreddit": "investing",
        "created": 1603427151.0
    },
    {
        "author": "BorneFree",
        "body": "Yea but does Fidelity send you emojis when you sell your -90% options?",
        "created_utc": 1602465673,
        "id": "g8jsbqt",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1602494473.0
    },
    {
        "author": "LegNest",
        "body": "Jesus Christ Fidelity, Thanks for calling me too poor to FD  \n\n**Trade Message**\n\n(100963) For accounts with a net worth under $100,000, opening orders for equity options expiring today are not accepted within two and a half hours of market close.",
        "created_utc": 1603481518,
        "id": "g9sfdyp",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1603510318.0
    },
    {
        "author": "d3medical",
        "body": "If you’re planning to help pay for your kids tuition, look into a 529. If you decide to go down the 529 plan, I’d do it through fidelity",
        "created_utc": 1601867723,
        "id": "g7r3i6f",
        "score": 7,
        "subreddit": "smallstreetbets",
        "created": 1601896523.0
    },
    {
        "author": "chikenbeer",
        "body": "Fidelity algo predicts bullish dick rally - https://i.imgur.com/BzgDzWq.jpg",
        "created_utc": 1602296411,
        "id": "g8a0z4i",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1602325211.0
    },
    {
        "author": "CuriousNecklaceGuy",
        "body": "GME shares have become the cornerstone of my portfolio. Everyday i take profit from other positions to add to it. I’m literally DCA-ing it like it’s a fidelity mutual fund",
        "created_utc": 1603232623,
        "id": "g9hea32",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1603261423.0
    },
    {
        "author": "bentonboy",
        "body": "They probably will, I just moved to Charles Schwab and they reimbursed the fee. Fidelity doesn't charge for stocks, but they do for options contracts.",
        "created_utc": 1602794491,
        "id": "g8xp3s0",
        "score": 6,
        "subreddit": "investing",
        "created": 1602823291.0
    },
    {
        "author": "4569",
        "body": "Yes, fund a TDAmeritrade account with a $100 and there are plenty of legit education classes on there and webcast to teach you. Start as soon as you can part with the $100 and just try to get 1% better everyday. This is better than trying to sift through a bunch of sleepy and amateur learning resources. Fidelity also has the same thing but I prefer TD Ameritrade. I think these are both reputable places to start with educational resources and offer enough customer service. I prefer TD Ameritrade.",
        "created_utc": 1601596785,
        "id": "g7ch3fe",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1601625585.0
    },
    {
        "author": "patmccock86",
        "body": "if I see this Fidelity change of plans commercial one more fucking time",
        "created_utc": 1603299485,
        "id": "g9k31c4",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1603328285.0
    },
    {
        "author": "khdo1992",
        "body": "Recommend on fidelity",
        "created_utc": 1601693571,
        "id": "g7h706i",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1601722371.0
    },
    {
        "author": "NeverGiveupLearning",
        "body": "For buy and hold investors, there is nothing wrong with Fidelity. \n\nBut if you do active trading (esp. day trading), that's another story. I have to have accounts with Fidelity for reasons out of my control. I use ToS from TDA (have accounts there too) to do all my research and to time my entry and exit and just use ATP from Fidelity only for execution. Even then, it's a pain in the neck.",
        "created_utc": 1601951901,
        "id": "g7uxd37",
        "score": 5,
        "subreddit": "stocks",
        "created": 1601980701.0
    },
    {
        "author": "MementoMori97",
        "body": "I love Fidelity for my long term investments, I have absolutely 0 complaints about it.",
        "created_utc": 1601954177,
        "id": "g7v10xp",
        "score": 5,
        "subreddit": "stocks",
        "created": 1601982977.0
    },
    {
        "author": "Voodoomomajujuu",
        "body": "You can’t go wrong w either \nCharles, fidelity, or Vanguard for Roth’s \n\nThey all give access to index funds w low expense ratios \n\nThe thing about cs is that it can also be used as a bank. They also offer credit cards with no foreign transaction fees",
        "created_utc": 1601946367,
        "id": "g7unl9n",
        "score": 4,
        "subreddit": "stocks",
        "created": 1601975167.0
    },
    {
        "author": "Dexteryt_13",
        "body": "is fidelity okay for options?",
        "created_utc": 1603306399,
        "id": "g9khlf3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1603335199.0
    },
    {
        "author": "Noexit007",
        "body": "Going to tell you right now that your question comes off as if you feel like you got into some exclusive club with great tips. That's a mindset that will likely lead to financial ruin.\n\nThis is Reddit.\n\nAs such, be prepared for people looking to sell you on stocks that might just be trash just as much as they might just be diamonds. Bias abounds as people post about the stocks THEY are invested in, meaning they are basically selling others on something to help THEIR cause. Can everyone benefit? Sure, but everyone can also get fucked over.\n\nRule #1 of r/pennystocks (or trading in general)\n\nSTUDY, RESEARCH, PLAN, PRACTICE.\n\nNever take another's word for ANYTHING. Verify yourself.\n\nIf you want to be consistently successful you kind of have to treat this as a job, not a hobby.\n\nMy #1 tip?  Don't fall in love with a stock. I know this, I breathe this, and I STILL fall in love with stocks. It happens, but it is insanely dangerous.\n\nAlso, get rid of Robinhood unless you are keeping it really low key and just practicing. Robinhood is for newbies wanting to casually phone trade. A good portion of stocks mentioned on here are OTC's which you can't trade on Robinhood because they are riskier due to less oversight. Get a real broker that offers real services and better coverage for all aspects of trading. I'm talking Schwab, or TDA, or Fidelity or other such brokers. And don't let anyone tell you Webull is a real broker. It's better than Robinhood but comes with the same drawbacks.",
        "created_utc": 1601837474,
        "id": "g7pj5cl",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1601866274.0
    },
    {
        "author": "PerspectiveFew7772",
        "body": "I also came from rh and nope fidelity never grew on me, but they have Roth IRA so that's why I switched. I still use rh to look at stocks because fidelity is so bad with charts.",
        "created_utc": 1601953192,
        "id": "g7uzga1",
        "score": 4,
        "subreddit": "stocks",
        "created": 1601981992.0
    },
    {
        "author": "halflifee134",
        "body": "Naturally after fidelity auto sells my 334P we start to drop",
        "created_utc": 1601666116,
        "id": "g7fkjop",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601694916.0
    },
    {
        "author": "Pmmenakedbitcoin",
        "body": "You can buy GBTC. Fidelity also offers direct custodial Bitcoin to $100k+ investments.",
        "created_utc": 1602642874,
        "id": "g8rcwdi",
        "score": 4,
        "subreddit": "investing",
        "created": 1602671674.0
    },
    {
        "author": "lowlyinvestor",
        "body": "I don't mean this the wrong way, but what basis do you have for thinking you'll achieve 17% in the short term and 30% in the long term? I think you need to temper your expectations. Consider that:\n\n• Through the end of 2019, Berkshire Hathaway, run by one of the worlds best investors ever, has appreciated at the rate of 20.3% per year.\n\n• Fidelity Magellan Fund under Peter Lynch is widely acknowledged as being the best performing mutual fund ever, and its record under his leadership was 29.2% annually.\n\n• The 30 years since him have not been as kind, and Magellan's average performance through October 2019 had fallen to 15.74% annually.\n\nSo we've got Peter Lynch doing 29.3%. You've got Warren Buffett doing 20%. And you're coming into this expecting to do 17-30%? \n\nYou need to temper your expectations. Your performance year to date sounds fine, a little ahead of the market and a lot ahead of a lot of actively managed equity funds. \n\nKeeping doing that, and keeping doing that through different market cycles will be an achievement on its own. You might be feeling discouraged because your efforts have yielded very little in real dollar terms - I get that, but again have to remind you that you're at the beginning of your investing career, and have many decades ahead of you. As you work and are able to add more and more money to your investing accounts, you'll see greater rewards. But you have to start somewhere, and truthfully, that you're even investing at your age puts you miles ahead of your peers.\n\nI would only say cheer up, enjoy the ride, and know that it will get a whole lot more exciting as you are able to add more and more money to your accounts. Learning now and making mistakes now, though, is probably the best thing you can do, rather than waiting til you have $50,000, $100,000, $500,000 in the market.\n\nGood job!",
        "created_utc": 1603220581,
        "id": "g9gmitm",
        "score": 4,
        "subreddit": "stocks",
        "created": 1603249381.0
    },
    {
        "author": "Pure-Dimension-8022",
        "body": "Buy GBTC. You’re gonna need a real broker because it’s OTC so open a fidelity or Other account and buy buy buy. This stock will go up as the market declines as investors look for a safe haven from the coronavirus depression, and it will also go up when the stimulus eventually gets passed, as BTC is a great hedge against inflation and the excessive money supply that the fed is bent on producing.",
        "created_utc": 1603299760,
        "id": "g9k3lsk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1603328560.0
    },
    {
        "author": "Dwigt_Schroot",
        "body": "I scheduled my bank deposit from chase to fidelity. Fun thing is, I get to chose the spot where Chase and Fidelity trucker should meet for transfer to get completed. I chose eastern most coast of Alaska.",
        "created_utc": 1603580883,
        "id": "g9yuavr",
        "score": 4,
        "subreddit": "investing",
        "created": 1603609683.0
    },
    {
        "author": "sunshotisbae",
        "body": "Agreed, I'd say Vanguard is more dated than Fidelity",
        "created_utc": 1601951929,
        "id": "g7uxesr",
        "score": 4,
        "subreddit": "stocks",
        "created": 1601980729.0
    },
    {
        "author": "PrizeCriticism9",
        "body": "This shit has been on the fidelity front page in a slightly tweaked form like every fucking day.",
        "created_utc": 1602280325,
        "id": "g89anai",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602309125.0
    },
    {
        "author": "Antonio_F5",
        "body": "Ah, a fellow Fidelity user. Any reason for the warrants over other option strategies? Attractive pricing vs LEAPs when you bought them? Congrats on the gains.",
        "created_utc": 1602640995,
        "id": "g8r9s2y",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602669795.0
    },
    {
        "author": "JimmyChill2020",
        "body": "Someone call Fidelity and tell them to stop letting me buy palantir shares",
        "created_utc": 1602000259,
        "id": "g7wmngs",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1602029059.0
    },
    {
        "author": "RedalMedia",
        "body": "Those are trading websites. If you want to invest, I'd recommend Vanguard. They're the best by a long shot. Fidelity is second best but they're far behind. The only thing is that most Vanguard funds need 3k minimum, while their Star Fund needs 1k minimum. If, and only if you can't muster these amounts, go for Fidelity.\n\nWhy? Vanguard is a fiduciary mutual company. Which means the customers ARE the owners, and get a share of the profits. They don't offer sales commissions to agents to sell products that benefit everyone, except the customer. All the others are privately owned, and most are not even fiduciaries.",
        "created_utc": 1602030954,
        "id": "g7yecm8",
        "score": 3,
        "subreddit": "investing",
        "created": 1602059754.0
    },
    {
        "author": "Orangenewgrey",
        "body": "What sorts of things do you invest in your fidelity account vs. robinhood?",
        "created_utc": 1602001446,
        "id": "g7wp0je",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1602030246.0
    },
    {
        "author": "chikenbeer",
        "body": "fidelity wont let me",
        "created_utc": 1602544953,
        "id": "g8n2lbe",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602573753.0
    },
    {
        "author": "Thy_l3g3nd_27",
        "body": "hmm. Yeah I'm sure its somewhere in a 7000 page document on fidelity.  Can't find it though",
        "created_utc": 1602539574,
        "id": "g8mt5in",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602568374.0
    },
    {
        "author": "NordyNed",
        "body": "I use fidelity, there are no commission fees but it also doesn’t let you buy some pink sheets",
        "created_utc": 1601918506,
        "id": "g7t3ebc",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1601947306.0
    },
    {
        "author": "chikenbeer",
        "body": "i have fidelity for boomer stuff.\n\nRH for funsies",
        "created_utc": 1601953426,
        "id": "g7uztwh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601982226.0
    },
    {
        "author": "LSatou",
        "body": "Highly recommend not using Robinhood. It'll slow your learning curve, caters to impulse decision making, and has virtually nonexistent customer support.\n\nWebull feels GREAT to use once you get a feel for the app. Not as easy as RH but doable.\n\nFidelity, Schwab, and TDA are all great reliable brokers and they all offer OTC stocks as well.\n\n&gt;What’s the catch? Could it really be that easy sometimes?\n\nYou can 100% approach slot machines and blackjack with this logic. If you approach trading with this logic, you'll get the same results. Probably lose over time, maybe get lucky. The hard part is finding the stocks that will go up. For every one that does 800%, there are another thousand that stagnate or bleed down.\n\nAnyone can get lucky. The hard part is being consistent.",
        "created_utc": 1602892908,
        "id": "g9212du",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1602921708.0
    },
    {
        "author": "smoothtrex",
        "body": "WorldPay (ownded by FIS) and First Data (owned by FISV) are 2 of the big non bank affiliated US based processors. They take on average maybe net 20bps of the transaction, more with smaller merchants less with larger merchants. \n\nWhat Square does is takes all the transactions on their platform and sends them to Chase Merchant Services, for processing through the networks and issuing banks. Then Chase Merchant Services sends the money from all the transactions back to Square and Square distributes the funds to its merchants. Square is technically the merchant or record with Chase Merchant Services. \nChase in the past really only wanted to deal with very large merchants, so Square aggregated thousands of other merchants to basically become one very large one in Chase's view. Chase Merchant Services is the primary processor for both Amazon and Walmart for example, though both also use others.",
        "created_utc": 1603316534,
        "id": "g9l2pcv",
        "score": 3,
        "subreddit": "stocks",
        "created": 1603345334.0
    },
    {
        "author": "farmallnoobies",
        "body": "At the same time, fidelity does not provide a way to buy Bitcoin through their brokerage accounts.\n\nLet that sink in for a minute -- fidelity is literally telling their customers to put their money elsewhere.",
        "created_utc": 1602640038,
        "id": "g8r81ny",
        "score": 3,
        "subreddit": "investing",
        "created": 1602668838.0
    },
    {
        "author": "UrKewlito",
        "body": "Anybody here day trade on fidelity pro?",
        "created_utc": 1601595051,
        "id": "g7ce280",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601623851.0
    },
    {
        "author": "Art0002",
        "body": "TOS has great charting. Very flexible. Very nice but it can be overwhelming. But it is good. \n\nYou need to apply to trade the different options trading levels. Some people complain that they can’t get to the level they want so they change brokerages. \n\nIn my experience Tastyworks is the most liberal in giving out option permissions and I think they are a little cheaper.\n\nI trade with TW, TDA and Fidelity. I trade Roth accounts and cash accounts. \n\nThe Roth and IRA accounts have limited trading permissions but I’m ok with that. You can’t have margin you can’t sell naked calls. \n\nYou want to be able to trade ...\n\nCash secured puts\nCovered calls\nSingle leg calls/puts\nAnd importantly call/put spreads\n\nIf you BUY an option, that is your max loss. \n\nIf you SELL an option, that is your max gain. \n\nI strongly suggest that you take advantage of TOS paper trading. It’s free. Practice trading options for months. For free. No risk. You can practice all the strategies and most importantly learn to manage a trade. \n\nYou will need to roll a trade out in time to give yourself more time to be right. You can also roll a trade out and up/down. \n\nI’m not trying to teach you how to trade, but option trading requires management. It is as important to manage winners as well as losers. \n\nMonths ago I bought SNAP at $19.8x and sold a $20 covered call for $1. That is 5%. Not bad for a month. \n\nI’ve rolled it out and up so I now have a $25 covered call. I’m still ITM but the point is that it’s never only one trade. And the trade isn’t over. \n\nAm I an expert - no. But just realize that options trading is not one and done. It’s not. \n\nAnd it is a sum zero game. Your lose is my gain. We all don’t profit. Stocks go up and everyone wins. That is not true with options. \n\nYou need to be very smart to make money. Smarter than average. Are you?\n\nPaper trade. See how you stand.",
        "created_utc": 1601686908,
        "id": "g7gw1hi",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601715708.0
    },
    {
        "author": "SolitaryEgg",
        "body": "I use the fidelity visa. 2% flat cash back straight into stonks.\n\nLiterally everything I buy, 2% of it goes to stonks. It's beautiful.",
        "created_utc": 1603769163,
        "id": "ga8m080",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1603797963.0
    },
    {
        "author": "chikenbeer",
        "body": "I run into problems w/ fidelity because can't trade mutual funds that often or they get upset.",
        "created_utc": 1602722196,
        "id": "g8upgo2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602750996.0
    },
    {
        "author": "Ac-28",
        "body": "I know you can't expect much from an old game with user-created content, but the graphical fidelity looks like it's 1996-tier.",
        "created_utc": 1602635747,
        "id": "g8r09xk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602664547.0
    },
    {
        "author": "fordanguyen",
        "body": "finally got approved for options in my Fidelity IRA. time for those tax free gains boys",
        "created_utc": 1602650412,
        "id": "g8rnv47",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602679212.0
    },
    {
        "author": "moltch",
        "body": "My family has 21k in this fund. I should tell them to sell out and just buy SPY stock right?\n\nhttps://institutional.fidelity.com/app/funds-and-products/306/fidelity-advisor-capital-development-fund-class-o-fdetx.html#top",
        "created_utc": 1602546744,
        "id": "g8n5kvu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602575544.0
    },
    {
        "author": "Cruian",
        "body": "&gt;Also, i have heard that fidelity doesnt charge any fee on trading either?\n\nFor basic trading of US listed stocks and ETFs, many brokerages went free trades starting back in October 2019.",
        "created_utc": 1602794705,
        "id": "g8xpiuh",
        "score": 3,
        "subreddit": "investing",
        "created": 1602823505.0
    },
    {
        "author": "GulliblePirate",
        "body": "As long as you have earned income you can start one. Go to Fidelity or Schwab or whatever and simply an open account and transfer money from bank. You can deposit as much as you earn up to 6k. Anything you earn is tax free but you can’t withdraw until your 59.5",
        "created_utc": 1603513268,
        "id": "g9umyj3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1603542068.0
    },
    {
        "author": "wombatncombat",
        "body": "It's an Oracle \"update\" cost being passed onto us. You could be right, FiS could be laying it Oracles feat but that's the problem with bad reputations...",
        "created_utc": 1603738982,
        "id": "ga712hh",
        "score": 3,
        "subreddit": "investing",
        "created": 1603767782.0
    },
    {
        "author": "xxbearillaxx",
        "body": "If that is the case you should open a Fidelity or Vanguard account and research the Bogleheads three-fund approach to investing.  You are at a massive advantage to get started ahead of people your age.  You can use mutual funds or ETFs but you want most in US entire stock market index or ETF (60-70%), the next in international markets index funds/ETFs (20-30%), and 5-10% in US bonds mutual fund or ETF.  And you should continue investing in that as often as you can. \n\n\nOpen a ROTH IRA and put post tax money in ($6000 a year) and let that shit grow.  18-59.5 at a 7% annual return would put you sitting at 1.5 million.  And that's only $6000 a year.",
        "created_utc": 1603776623,
        "id": "ga8w5qx",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1603805423.0
    },
    {
        "author": "chikenbeer",
        "body": "I know ya'll are lazy so I consulted fidelity algos for quick DD.\n\nAAPL, SPY, QQQ, and TSLA downside prevails for next 1-2 weeks.\n\nShit ain't always accurate so who knows.",
        "created_utc": 1601778912,
        "id": "g7los97",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601807712.0
    },
    {
        "author": "AzazelPrays",
        "body": "Fidelity won’t let me sell naked poots 😤😤\nFuck you fidelity, I know my personal risk tolerance!",
        "created_utc": 1601579695,
        "id": "g7bhlqc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601608495.0
    },
    {
        "author": "Tycrist8",
        "body": "Got locked out of RH have to use fidelity.  God damn this shit sucks wheres my cool confetti when i YOLO my whole account?",
        "created_utc": 1601582054,
        "id": "g7bnfmn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601610854.0
    },
    {
        "author": "MMOAddict",
        "body": "Does any broker not do that?  I wanted to find this out myself so I compared prices that I could trade options at cross platform and it was exactly the same on Fidelity and TD Ameritrade as Robinhood. I would put the limit price above halfway point between the bid/ask and it sat there for a few hours on all 3 platforms until the bid/ask moved enough to put the halfway point on my limit price. \n\nI did it twice on BAC and once on CVX. They sold at almost the exact same moment each time.  The only difference was I paid 65 cents for each of those transactions on the other platforms.",
        "created_utc": 1601590746,
        "id": "g7c5w6a",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601619546.0
    },
    {
        "author": "juderm",
        "body": "Not sure but some brokerages are also now doing fractional shares. \n\nThese now offer it, there may be more:\n\nFidelity, Charles Schwab, M1, Interactive Brokers",
        "created_utc": 1603244985,
        "id": "g9i01p7",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1603273785.0
    },
    {
        "author": "kscise",
        "body": "American also based in China. I use fidelity and RH. I used a US address and phone number and it was super simple. Not sure how it works if you were to use a CN address/number.",
        "created_utc": 1602194850,
        "id": "g85o0h2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602223650.0
    },
    {
        "author": "theta_eta_my_beta",
        "body": "Some times I feel like hot shit. Then I realize fidelity prevented me a 15k loss today by not allowing me to trade spreads in my IRA.",
        "created_utc": 1602546842,
        "id": "g8n5qrq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602575642.0
    },
    {
        "author": "Redditpumpin6",
        "body": "When does AMZN report earnings need to know my fidelity rep said 10/22 but some guy on here says 10/27...",
        "created_utc": 1602686593,
        "id": "g8st5ff",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602715393.0
    },
    {
        "author": "Off_Duty_Machete",
        "body": "Fidelity (FXAIX) at 0.015%",
        "created_utc": 1602715502,
        "id": "g8udsbf",
        "score": 3,
        "subreddit": "stocks",
        "created": 1602744302.0
    },
    {
        "author": "thats_your_name_dude",
        "body": "Vanguard, Fidelity, or Chucky Schwab\n\nAny of these will serve you well.",
        "created_utc": 1601947849,
        "id": "g7uqbxr",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601976649.0
    },
    {
        "author": "Schneebley",
        "body": "Christ, Fidelity really wants you to claim that you're a Nigerian Prince and have $1 million in liquid assets before they give you any options trading, huh?",
        "created_utc": 1602789804,
        "id": "g8xfxyz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1602818604.0
    },
    {
        "author": "----The_Truth-----",
        "body": "Fidelity is telling me the next major resistance level is $2.85... what do you have?",
        "created_utc": 1602009493,
        "id": "g7x79sr",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1602038293.0
    },
    {
        "author": "kdiddy733",
        "body": "In my Fidelity account, I hold a lot of dividend centric stocks mixed with some growth stocks in reputable companies (Apple, Disney, Proctor &amp; Gamble, a dash of Tesla, couple more).\n\nRobinhood I take chances on rumors, play options a touch. Just a lot less averse to risk. I’ve had decent luck with it although I’ve been pretty flat here recently.\n\nI’m sure there are other strategies for long term investment but this is what I’m rolling with right now.",
        "created_utc": 1602009097,
        "id": "g7x6eom",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1602037897.0
    },
    {
        "author": "AzazelPrays",
        "body": "Switch to fidelity",
        "created_utc": 1602091596,
        "id": "g80snzs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602120396.0
    },
    {
        "author": "Cruian",
        "body": "Index funds can come as 2 main types: ETFs or mutual funds.\n\nMutual funds by default trade as dollar values, not shares (you will be assigned a fractional shares as appropriate). Some mutual funds, but not all, have initial and/or ongoing minimums required for purchase (example: Vanguard's VTSAX requires $3,000 for initial, $1 for any purchases after that; Fidelity and Schwab are generally only $1 for both initial and continuing).\n\nETFs at most brokerages must be traded as whole shares. A few places are now allowing fractional ETF trading though (Fidelity, M1, Robinhood to name a few).\n\nETFs and mutual funds have some important differences like how they trade and in most cases, tax efficiency (if you'll be holding outside tax advantaged accounts).",
        "created_utc": 1602215761,
        "id": "g86oc6j",
        "score": 2,
        "subreddit": "investing",
        "created": 1602244561.0
    },
    {
        "author": "Chrisiskingx",
        "body": "I had to call fidelity directly for the split. My Units went from RBAC.U to one that's filled with alphanumerical digits, I believe by Monday I should be good but be sure to call your broker",
        "created_utc": 1602443925,
        "id": "g8ik9gi",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1602472725.0
    },
    {
        "author": "lowlyinvestor",
        "body": "If you used their index funds, then I'd suggest switching to Fidelity's in house funds to avoid transaction fees, but ETFs trade without fees on either platform, so there's no real advantage to owning them on Vanguards platform and no disadvantage about owning them on Fidelity's. \n\nI do think that Fidelity has some funds available with no management fee at all, but to me at least, saving a few cents per $10,000 invested isn't a game changer.\n\nJust stick with what you have already.",
        "created_utc": 1602520207,
        "id": "g8lrd17",
        "score": 2,
        "subreddit": "stocks",
        "created": 1602549007.0
    },
    {
        "author": "jmremote",
        "body": "Thanks for posting this. I had my RH account correctly setup but I checked my Fidelity and was surprised it wasn't. oooof!",
        "created_utc": 1602606815,
        "id": "g8pfhkb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602635615.0
    },
    {
        "author": "atrueretard",
        "body": "&gt;Fidelity Digital Assets (FDA) is a subsidiary of Fidelity Investments focused on support for its institutional customers' holdings in digital assets.\n\nlooks like they share the same FINRA registration of the parent company, so as far as investors are concered its the same company.",
        "created_utc": 1602644238,
        "id": "g8rf2fn",
        "score": 2,
        "subreddit": "investing",
        "created": 1602673038.0
    },
    {
        "author": "Investinwaffl3s",
        "body": "Noooo avoid Schwab\n\nFidelity if you want a big name, Trade Station or TastyWorks if you are a heavy options trader",
        "created_utc": 1601953818,
        "id": "g7v0gg7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601982618.0
    },
    {
        "author": "Jakeep16",
        "body": "I agree with this. There’s nothing flashy about fidelity but it’s beyond easy to navigate. They don’t change it and I don’t have to worry about trying to figure out how to find something that I knew how to find before.",
        "created_utc": 1601956762,
        "id": "g7v4xia",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601985562.0
    },
    {
        "author": "wonderbrah419",
        "body": "Okay, good to know. Thanks. \n\nI have been thinking about transferring my account over to Fidelity. Only reason I use WF is because my dad is a financial adviser there but he is moving to another company (a lesser known one). I was thinking of moving either to Fidelity or Schwab.",
        "created_utc": 1602281302,
        "id": "g89cbfw",
        "score": 2,
        "subreddit": "investing",
        "created": 1602310102.0
    },
    {
        "author": "maillive2",
        "body": "Weird maybe I’m just limited to level 1 in my Roth. I use fidelity not tda so that may contribute",
        "created_utc": 1602365574,
        "id": "g8dild9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602394374.0
    },
    {
        "author": "dhsmatt2",
        "body": "Other fidelity people can vouch. If I edited it then I would certainly do a better job.",
        "created_utc": 1603208317,
        "id": "g9fx68y",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603237117.0
    },
    {
        "author": "PharmacistHog",
        "body": "Just applied for options trading in my fidelity account. Let me know when you want to know how to enable that.",
        "created_utc": 1603492739,
        "id": "g9t7m74",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603521539.0
    },
    {
        "author": "Smodol",
        "body": "Call up Fidelity, tell em you're ready for a real brokerage, and they'll help you get things moved or point you to resources.\n\nYou'll be fine, tons of folks doing this switch the last year or so; the phone rep probably has a 'Robinhood conversion' call script tbh.",
        "created_utc": 1602812878,
        "id": "g8ym3u0",
        "score": 2,
        "subreddit": "investing",
        "created": 1602841678.0
    },
    {
        "author": "Bull_Logic",
        "body": "Just move your money to another broker for the 90 days. Webull is comparable, has better charts but still suffers from the same outage issues and shitty customer service that Robinhood has.\n\nOtherwise Fidelity, TDAmeritrade (TOS platform is great), Schwab, etc all are good brokers.\n\nYou could even be a total degenerate and buy stocks through Cash App.",
        "created_utc": 1602953181,
        "id": "g948u7j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602981981.0
    },
    {
        "author": "ignatzami",
        "body": "About $25k according to Fidelity I'm up 98% on the year.",
        "created_utc": 1603408257,
        "id": "g9pa09y",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603437057.0
    },
    {
        "author": "cheesenuggets2003",
        "body": "\"**$0.00 commission applies to online U.S. equity trades, exchange-traded funds (ETFs), and options (+ $0.65 per contract fee) in a Fidelity retail account only for Fidelity Brokerage Services LLC retail clients. Sell orders are subject to an activity assessment fee (from $0.01 to $0.03 per $1,000 of principal). There is an Options Regulatory Fee (from $0.03 to $0.05 per contract), which applies to both option buy and sell transactions. The fee is subject to change. Other exclusions and conditions may apply. See** [**Fidelity.com/commissions**](https://www.fidelity.com/trading/commissions-margin-rates) **for details. Employee equity compensation transactions and accounts managed by advisors or intermediaries through Fidelity Clearing &amp; Custody Solutions®** **are subject to different commission schedules.\"**",
        "created_utc": 1602650037,
        "id": "g8rndby",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602678837.0
    },
    {
        "author": "AnOddvacado",
        "body": "Fidelity extended hours starts at 8am. Btfd on FSLY or wait and see if it tanks further?",
        "created_utc": 1602738052,
        "id": "g8vdy75",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1602766852.0
    },
    {
        "author": "Shmeepsheep",
        "body": "Fidelity required my account to be over 25k to reimburse the 100 that m1 took",
        "created_utc": 1602801528,
        "id": "g8y28in",
        "score": 2,
        "subreddit": "investing",
        "created": 1602830328.0
    },
    {
        "author": "PharmacistHog",
        "body": "Anyone ever traded options on Fidelity?",
        "created_utc": 1603239638,
        "id": "g9hqon9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603268438.0
    },
    {
        "author": "Godkingcoconut",
        "body": "Thanks for that awesome fidelity bit :)",
        "created_utc": 1603307602,
        "id": "g9kk3z6",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1603336402.0
    },
    {
        "author": "ControlPlusZ",
        "body": "You can enable international trading with fidelity. This will likely be available OTC in the USA as well. \n\nYou can google “fidelity international trading” for details. Fidelity charges a commission (20-30 bucks I think) and 1% currency fee. These fees are if you trade on a foreign exchange with a US account.",
        "created_utc": 1601567756,
        "id": "g7aq6gc",
        "score": 2,
        "subreddit": "shroomstocks",
        "created": 1601596556.0
    },
    {
        "author": "DKNG-STONK",
        "body": "I would guess no, but I haven’t looked into it for all brokerages. Tho I’ve never heard anyone complaining. \n\nI can definitively tell you fidelity does not have a fee for ticker change.",
        "created_utc": 1601573548,
        "id": "g7b3bx7",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1601602348.0
    },
    {
        "author": "PapaCharlie9",
        "body": "I don't use Fidelity, but I watched this video and my guess is that white means neutral strategies, green is bullish, red is bearish.\n\nhttps://www.fidelity.com/learning-center/tools-demos/active-trader-pro-platforms/options-statistics-atp-video",
        "created_utc": 1601579784,
        "id": "g7bhtk1",
        "score": 2,
        "subreddit": "options",
        "created": 1601608584.0
    },
    {
        "author": "OneCheapBastard",
        "body": "SpaceX is a private company, you can’t invest in them except for a few select funds offered by Fidelity but even then your max exposure to SpaceX will be 0.233% ($FBGRX)",
        "created_utc": 1601667421,
        "id": "g7fo4qi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601696221.0
    },
    {
        "author": "chikenbeer",
        "body": "Fidelity has some credibility. Their TA says SPY downside prevails 312 target.",
        "created_utc": 1601778614,
        "id": "g7lnwle",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601807414.0
    },
    {
        "author": "litlron",
        "body": "The Fidelity website is so much better than Vanguards. I'm seriously considering moving my IRA over so that I don't have to deal with their crap interface again.",
        "created_utc": 1601770880,
        "id": "g7l0oyz",
        "score": 2,
        "subreddit": "investing",
        "created": 1601799680.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "Nov 5th is Ant’s IPO in HK (night of the 4th for 🦅). Biggest IPO of all fucking time. RH doesn’t do international so you’ll need a big-boy broker like IBKR or Fidelity",
        "created_utc": 1603737295,
        "id": "ga6xj4b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1603766095.0
    },
    {
        "author": "ndpithad",
        "body": "Nope, Fidelity AIP wants $1M+ in the account.  I'm sure they incur expenses for this hence why their per-requisite is to have a large amount within their account.",
        "created_utc": 1603761818,
        "id": "ga88l5r",
        "score": 2,
        "subreddit": "investing",
        "created": 1603790618.0
    },
    {
        "author": "Poops_Hemingway",
        "body": "VUG or FTEC\n\nVanguard growth index or fidelity technology index.",
        "created_utc": 1601834462,
        "id": "g7paqzj",
        "score": 2,
        "subreddit": "stocks",
        "created": 1601863262.0
    },
    {
        "author": "ukfan758",
        "body": "I like how parts of the Fidelity website haven’t changed in the past 15-20 years. Literally the tax info page only takes up the left side of the screen.",
        "created_utc": 1601749998,
        "id": "g7jce1z",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601778798.0
    },
    {
        "author": "Artivist",
        "body": "A word of caution. There is an endless amount of \"free\" youtube videos and courses from TD Ameritrade, TastyTrade, eTrade, Fidelity, etc. But, what they don't show you is how someone actually puts that knowledge to practice into developing a strategy that allows you to make an income while properly managing risk. The course I went through helped with that and may be most people don't necessarily have the issues that I ran into using these courses. But, in hindsight, I wasted way too much time just going through these free videos without really understanding how they work in the real world.     \n    \nEdit: I didn't want to appear as if I'm spamming but I got a couple of DMs asking about the course I took. It's from ZipTrader. You can get 70% of the information from his youtube channel. But, I wanted something more structured and he really goes in a lot more detail in the course. I highly recommend it. Check out his free videos on YouTube particularly the one on why he is a trader and if it resonates with you (like it did for me), and you want to go ahead and check out the course, DM me for a discount coupon.",
        "created_utc": 1601593017,
        "id": "g7ca0e6",
        "score": 13,
        "subreddit": "options",
        "created": 1601621817.0
    },
    {
        "author": "4569",
        "body": "Yes, fund a TDAmeritrade account with a $100 and there are plenty of legit education classes on there and webcast to teach you. Start as soon as you can part with the $100 and just try to get 1% better everyday. This is better than trying to sift through a bunch of sleepy and amateur learning resources. Fidelity also has the same thing but I prefer TD Ameritrade. I think these are both reputable places to start with educational resources and offer enough customer service. I prefer TD Ameritrade.",
        "created_utc": 1601596785,
        "id": "g7ch3fe",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1601625585.0
    },
    {
        "author": "khdo1992",
        "body": "Recommend on fidelity",
        "created_utc": 1601693571,
        "id": "g7h706i",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1601722371.0
    },
    {
        "author": "halflifee134",
        "body": "Naturally after fidelity auto sells my 334P we start to drop",
        "created_utc": 1601666116,
        "id": "g7fkjop",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601694916.0
    },
    {
        "author": "UrKewlito",
        "body": "Anybody here day trade on fidelity pro?",
        "created_utc": 1601595051,
        "id": "g7ce280",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601623851.0
    },
    {
        "author": "Art0002",
        "body": "TOS has great charting. Very flexible. Very nice but it can be overwhelming. But it is good. \n\nYou need to apply to trade the different options trading levels. Some people complain that they can’t get to the level they want so they change brokerages. \n\nIn my experience Tastyworks is the most liberal in giving out option permissions and I think they are a little cheaper.\n\nI trade with TW, TDA and Fidelity. I trade Roth accounts and cash accounts. \n\nThe Roth and IRA accounts have limited trading permissions but I’m ok with that. You can’t have margin you can’t sell naked calls. \n\nYou want to be able to trade ...\n\nCash secured puts\nCovered calls\nSingle leg calls/puts\nAnd importantly call/put spreads\n\nIf you BUY an option, that is your max loss. \n\nIf you SELL an option, that is your max gain. \n\nI strongly suggest that you take advantage of TOS paper trading. It’s free. Practice trading options for months. For free. No risk. You can practice all the strategies and most importantly learn to manage a trade. \n\nYou will need to roll a trade out in time to give yourself more time to be right. You can also roll a trade out and up/down. \n\nI’m not trying to teach you how to trade, but option trading requires management. It is as important to manage winners as well as losers. \n\nMonths ago I bought SNAP at $19.8x and sold a $20 covered call for $1. That is 5%. Not bad for a month. \n\nI’ve rolled it out and up so I now have a $25 covered call. I’m still ITM but the point is that it’s never only one trade. And the trade isn’t over. \n\nAm I an expert - no. But just realize that options trading is not one and done. It’s not. \n\nAnd it is a sum zero game. Your lose is my gain. We all don’t profit. Stocks go up and everyone wins. That is not true with options. \n\nYou need to be very smart to make money. Smarter than average. Are you?\n\nPaper trade. See how you stand.",
        "created_utc": 1601686908,
        "id": "g7gw1hi",
        "score": 3,
        "subreddit": "stocks",
        "created": 1601715708.0
    },
    {
        "author": "AzazelPrays",
        "body": "Fidelity won’t let me sell naked poots 😤😤\nFuck you fidelity, I know my personal risk tolerance!",
        "created_utc": 1601579695,
        "id": "g7bhlqc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601608495.0
    },
    {
        "author": "Tycrist8",
        "body": "Got locked out of RH have to use fidelity.  God damn this shit sucks wheres my cool confetti when i YOLO my whole account?",
        "created_utc": 1601582054,
        "id": "g7bnfmn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601610854.0
    },
    {
        "author": "MMOAddict",
        "body": "Does any broker not do that?  I wanted to find this out myself so I compared prices that I could trade options at cross platform and it was exactly the same on Fidelity and TD Ameritrade as Robinhood. I would put the limit price above halfway point between the bid/ask and it sat there for a few hours on all 3 platforms until the bid/ask moved enough to put the halfway point on my limit price. \n\nI did it twice on BAC and once on CVX. They sold at almost the exact same moment each time.  The only difference was I paid 65 cents for each of those transactions on the other platforms.",
        "created_utc": 1601590746,
        "id": "g7c5w6a",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1601619546.0
    },
    {
        "author": "ControlPlusZ",
        "body": "You can enable international trading with fidelity. This will likely be available OTC in the USA as well. \n\nYou can google “fidelity international trading” for details. Fidelity charges a commission (20-30 bucks I think) and 1% currency fee. These fees are if you trade on a foreign exchange with a US account.",
        "created_utc": 1601567756,
        "id": "g7aq6gc",
        "score": 2,
        "subreddit": "shroomstocks",
        "created": 1601596556.0
    },
    {
        "author": "DKNG-STONK",
        "body": "I would guess no, but I haven’t looked into it for all brokerages. Tho I’ve never heard anyone complaining. \n\nI can definitively tell you fidelity does not have a fee for ticker change.",
        "created_utc": 1601573548,
        "id": "g7b3bx7",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1601602348.0
    },
    {
        "author": "PapaCharlie9",
        "body": "I don't use Fidelity, but I watched this video and my guess is that white means neutral strategies, green is bullish, red is bearish.\n\nhttps://www.fidelity.com/learning-center/tools-demos/active-trader-pro-platforms/options-statistics-atp-video",
        "created_utc": 1601579784,
        "id": "g7bhtk1",
        "score": 2,
        "subreddit": "options",
        "created": 1601608584.0
    },
    {
        "author": "OneCheapBastard",
        "body": "SpaceX is a private company, you can’t invest in them except for a few select funds offered by Fidelity but even then your max exposure to SpaceX will be 0.233% ($FBGRX)",
        "created_utc": 1601667421,
        "id": "g7fo4qi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601696221.0
    },
    {
        "author": "Connortbh",
        "body": "I love fidelity. Customer service is great too IMO.",
        "created_utc": 1601593081,
        "id": "g7ca57q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601621881.0
    },
    {
        "author": "Ken385",
        "body": "The only retail broker that allows access to the full session is Interactive Brokers.  Fidelity offers access to that last couple of hours.  You can still see the overnight markets with most brokers.",
        "created_utc": 1601664096,
        "id": "g7ffpcs",
        "score": 2,
        "subreddit": "options",
        "created": 1601692896.0
    },
    {
        "author": "Dmoan",
        "body": "Haha Fidelity Magellan fund is down 11% over 20 years and they are now switching to etf, this is why you don’t buy funds based on previous performance (the fund avg 25% return in 90s).",
        "created_utc": 1601666335,
        "id": "g7fl5ri",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601695135.0
    },
    {
        "author": "lobster_johnson",
        "body": "Competitors such as Fidelity, Schwab, and Vanguard are also commission-free\n\nWhat you get with these brokerages:\n\n* Traditional and Roth IRAs as well as things like 529 accounts\n* Joint accounts (joint tenancy and all the other forms)\n* Checking account with debit card and check/bill payment\n* Access to mutual funds\n* Access to bonds, futures, and other securities\n* Superb 24/7 chat and phone support. (I've only ever used Schwab, which is fantastic, but the others are known for great support.)\n* Financial advice and free workshops\n* As far as I can tell, better order flow. Schwab abides by NBBO and provides price improvement on approximately\n90% of orders. (Unlike RH, other brokerages apparently don't make a lot of money on order flow.)\n* Native real-time trading apps (Schwab has StreetSmart, Fidelity has Active Trader Pro)\n* Roboadvisors\n\nNone of this costs anything extra, though tailored financial advisor services do come extra.\n\nI think one of the big draws of a brokerage like Schwab, Fidelity, and Vanguard is access to mutual funds. At Robinhood you're limited to stocks, which includes ETFs. Mutual funds offer a wider range of funds, including target date funds and tax management funds. (Contrary to what many people on Reddit seem to believe, mutual funds don't just mean expensive actively managed funds! There are tons of cheap funds, and some that are even cheaper than ETFs.) For example, my IRAs are all in target date funds that have a fee of just 0.08%.\n\nIf I were starting out today, I'd pick Vanguard. Fantastic company with a uniquely altruistic vision.",
        "created_utc": 1601703676,
        "id": "g7hlorb",
        "score": 2,
        "subreddit": "investing",
        "created": 1601732476.0
    },
    {
        "author": "MyOldAolName",
        "body": "Fidelity just canceled my UVXY purchase from 2 months ago and sold the open covered calls I had on them. They reverse the original purchase and give me $22.09/share or what I paid but sold the contracts at market price for a profit, ended up making a quick $600 off the deal.",
        "created_utc": 1601566474,
        "id": "g7an6ll",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601595274.0
    },
    {
        "author": "portlander33",
        "body": "Same here.  \n\n\nFidelity is one the biggest investors in Nikola.  I wonder if that has anything to do with it.",
        "created_utc": 1601602050,
        "id": "g7cqr55",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1601630850.0
    },
    {
        "author": "budflight",
        "body": "I’m trying to gradually take a large cash position and buy into QQQ and SPY. Had it all in my main IRA in a Fidelity Date fund but wanted to buy on the dips a few thousand dollars at a time. Watching from the sidelines as markets start to rise again makes me wish I had dumped it all in at once. Do you think there will be another downturn which will make my wait the right move?",
        "created_utc": 1601556774,
        "id": "g7a44rq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601585574.0
    },
    {
        "author": "BrownShoe4",
        "body": "If you switched to a real broker (TD Ameritrade, Fidelity, etc.) you can do exactly this for no extra cost to Robin hood",
        "created_utc": 1601558722,
        "id": "g7a75og",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601587522.0
    },
    {
        "author": "Breeze_on_my_nutz",
        "body": "Don’t have settled funds fidelity takes 4 days to transfer. FUCKIN BULLSHIT BY THE WAY. But whatever.",
        "created_utc": 1601578942,
        "id": "g7bftf7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601607742.0
    },
    {
        "author": "stayyfr0styy",
        "body": "Instead of paying money for a course, I just put a couple hundred into Robinhood and let it go. Cheaper than a course and you learn more if you lose. Discovered an iron condor just by looking at bear call and bull put spreads, and Robinhood identified the move as an iron condor.\nI also looked through an options for dumbys book at borders one time. Good for the basics.\n\nRobinhood gets a lot of hate, but it displays things a lot more clearly than fidelity, td ameritrade, Webull, etrade in my opinion. I wouldn’t be able to make a lot of my trades on those others because of how much more complicated it is.\n\nJust start small and expect to lose it all. Then as you figure out how it works, flip through some books and videos and you’ll grasp what they’re talking about much easier than if you had no hands on experience.",
        "created_utc": 1601602445,
        "id": "g7crizq",
        "score": 1,
        "subreddit": "options",
        "created": 1601631245.0
    },
    {
        "author": "PredatoryCat",
        "body": "That's why I use Fidelity.",
        "created_utc": 1601600846,
        "id": "g7cog1t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601629646.0
    },
    {
        "author": "Zippytuna",
        "body": "I use TDA, but be aware they charge $38 when the units split. I've heard on here that Fidelity doesn't charge.",
        "created_utc": 1601620411,
        "id": "g7dk7cq",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601649211.0
    },
    {
        "author": "mikedpoisson",
        "body": "Yeah, Fidelity doesn’t charge to split units. You just have to call them up and it takes 2-3 days to change into warrants and common shares.",
        "created_utc": 1601622546,
        "id": "g7dmzka",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601651346.0
    },
    {
        "author": "NotAnAlligator",
        "body": "Fidelity",
        "created_utc": 1601541667,
        "id": "g79o7y7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601570467.0
    },
    {
        "author": "chikenbeer",
        "body": "Fidelity. Hands down best I tried.",
        "created_utc": 1601648775,
        "id": "g7ekodn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601677575.0
    },
    {
        "author": "cbh1997",
        "body": "So would you recommend fidelity over RH? I’m thinking about withdrawing and trying a different trading app",
        "created_utc": 1601653464,
        "id": "g7etof9",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601682264.0
    },
    {
        "author": "Thraex_Exile",
        "body": "Fidelity does the same. Very large window letting you know you’re capped out.",
        "created_utc": 1601655585,
        "id": "g7exvro",
        "score": 1,
        "subreddit": "investing",
        "created": 1601684385.0
    },
    {
        "author": "MyOldAolName",
        "body": "Mine is a work sponsored 401k, where I see the Brokeragelink there is an asterisk next to it saying that it's linked to my work 401k. Hope that helps. Also, I was told by Fidelity that how much freedom and what percent of my total 401k that can be in there is dictated by my employer. Good luck getting it set up.",
        "created_utc": 1601658233,
        "id": "g7f357f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601687033.0
    },
    {
        "author": "Boss1010",
        "body": "All my other money is in Fidelity. I deposited $5",
        "created_utc": 1601590979,
        "id": "g7c6bef",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601619779.0
    },
    {
        "author": "gordonopolis",
        "body": "Yes I did at both fidelity and Schwab",
        "created_utc": 1601593446,
        "id": "g7cavuw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601622246.0
    },
    {
        "author": "Wololo242",
        "body": "Yes, especially once you can trade synthetic stocks, the entire world will have access to stock trading 24 hours a day on decentralized exchanges, where all you need is an open source phone wallet. Not only that, the common person will be able to earn the same yield figures that Robin Hood and fidelity make by lending your stocks right now to margin traders (7-10% annually). The 8:30 to 4pm trading window is an inefficient social construct of days past. Regulators need to step up their game to 24 hours a day, otherwise they will generate resentment among stock traders and lose control of the situation, which wouldn’t be good. The best way for them to do this would be to regulate online identities in the most equitable way possible to people who were not born with identities (usually people in third world countries), otherwise again they will generate resentment and lose control of the situation.",
        "created_utc": 1601563380,
        "id": "g7ag4ba",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601592180.0
    },
    {
        "author": "truemeliorist",
        "body": "Interesting! With fidelity, at least the way our plan is set up, everything we \"can't touch\" is kept in a separate cash account. Once things vest or meet minimum holding periods, they transfer it into a separate individual account we own. At that point the shares are ours to do with as we please.",
        "created_utc": 1601597469,
        "id": "g7ci96c",
        "score": 1,
        "subreddit": "options",
        "created": 1601626269.0
    },
    {
        "author": "oohpulchritude",
        "body": "Wait. Am I imagining things? Most investing platforms have moved to 0 commission trading for stocks, ETF's, and options. Mutual funds may vary.\n\nFidelity, TD Ameritrade, E-Trade, Charles Swab... all sufficient for the Robinhood amateur demographic.",
        "created_utc": 1601703683,
        "id": "g7hlp0l",
        "score": 1,
        "subreddit": "investing",
        "created": 1601732483.0
    },
    {
        "author": "WSBVoteBot",
        "body": "**A Submission was Spammed by Vote**\n___\n**Title:** Why do you need 2k in your margin account on fidelity?\n\n**URL:** https://redd.it/j4bvms\n___\n[Click Here to Vote to Approve](https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=restore&amp;message=j4bvms) if this is a good submission.\n\nHey /u/stockmaster6969, you're encouraged to copy and paste the approval link into the Daily Discussion thread for help restoring your post.\n\nUsers who Voted:\nstockmaster6969\nLokyeezy\nnahvan10",
        "created_utc": 1601712321,
        "id": "g7hvaoj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601741121.0
    },
    {
        "author": "SirGlass",
        "body": "Schwab, fidelity, vanguard are probably the most popular brokerages",
        "created_utc": 1601741109,
        "id": "g7ivyxy",
        "score": 1,
        "subreddit": "investing",
        "created": 1601769909.0
    },
    {
        "author": "DystopianRealist",
        "body": "You won't be able to buy mutual funds through RH, as far as I know, nor would I recommend it, but you can absolutely replicate them through ETFs, and you can do it through fractional shares. There are more ideal ways, and if you're investing long term, you would want assistance limiting taxes as much as possible, but there is absolutely no reason why you couldn't start a small fund on your own through robinhood.\n\nBond ETFs you might look at are TLT, TIPS, BND, and of course there are tons of others (those just happen to cover different durations or different strategies, so I thought I would toss out some names so you start looking at what different bonds have for goals -- read the prospectus).\n\nA basic 80/20 portfolio or 60/40 would simply be something like (VT, VTI, VOO - Pick one for now or similar equivalents, but VTI is generally considered slightly lower risk than the other two, with good exposure to the full USA market) and add BND to the bond portion, for simplicity.\n\n&amp;#x200B;\n\n\\*\\*Going to pitch Fidelity to you here, and explain why (full disclosure, I have a broker account with Fidelity, but they are not my primary broker)  :\n\nIf you intend on investing long term, you should get professional financial advise, and be aware that a company like Fidelity, which actually does handle mutuals, tax advantaged acccounts, retirement plans, and so forth, might be a better choice than a broker that you have to email even for simple questions. Fidelity also offers fractional shares, including on ETFs, and they have good customer service available via phone. That would be my move from the start, before you have to start moving funds from one broker to another, as long term investing like this includes trying to reduce taxes and fees as much as possible as part of the general strategy.",
        "created_utc": 1601600896,
        "id": "g7cojkk",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1601629696.0
    },
    {
        "author": "dvdmovie1",
        "body": "From an interview with Fidelity Contrafund manager Will Danoff: \n\n\"So, I'd say it's a very healthy give-and-take and dialogue. And I would say, often because Joel and I and all the other fund managers started as Fidelity research analysts, when a new analyst arrives, they usually show up at my office with a list, and say “I'm the new railroad analyst. Here are my names, and I like XYZ railroad because the group's trading at 14 times earnings, and this ones trading at 11 times earnings.” And I might say, “Wow, that's interesting. Why is that one trading at such a discount to the group?” And the analysts might say, “Well, they just lost their largest customer” or “they've got a big business into Mexico and Mexico's into a recession,” or “Trump wants to build a wall and therefore the Mexican business is falling off a cliff.” **And I usually say, “That's not the type of company I'm interested in. I'm interested in companies that are doing well, where the earnings outlook is positive, where earnings per share is growing. Maybe it's growing faster than people think. What do you have on your list that would fit that bill even if it's more expensive than the average company in your group?”** So, it's that's sort of give-and-take. And I might encourage an analyst to reorient their priority list to help me look for stocks that fit my ideal pattern.\" (https://www.morningstar.com/podcasts/the-long-view/40)\n\nToo many people I think jump to an Intel because \"LOOKS CHEAP!\" when they'd have been better off with the things that appear more expensive where the company is doing well and the outlook is positive.\n\nIntel spent $15B on Mobileye, and for all the discussion of self driving, I don't know that I've heard anything much regarding Mobileye probably since they bought it.\n\nLastly,\n\n\"Intel completely missed out on the smartphone revolution, too, having been unable to come up with an answer for the rise of the ultra-low-power ARM SoC. After its smartphone insurgency, ARM chips quickly moved on Intel's territory by spreading to tablets and laptops. Intel's latest black eye is being completely dumped by Apple, which, after building its own ARM design house for the iPhone and iPad, has announced plans to upscale its ARM chips to Mac laptops and desktops.\"\n\nhttps://arstechnica.com/gadgets/2020/07/heads-roll-at-intel-after-7nm-delay/\n\n\"Laptops and desktops are the next great frontier for Apple's chip division. That division will help the company avoid the same fate that has befallen Android smartwatch manufacturers: letting some other company dictate your product lineup. Apple's plans to update the Mac have often been stymied by Intel's product roadmap, and Intel does not make chips that serve all of Apple's design priorities. The new CPU will be just one part of an Apple-designed system-on-a-chip that would also include (among other things) an Apple GPU and a desktop version of Apple's Neural Engine machine learning and AI processor found in the iPhone and iPad.\"\n\nhttps://arstechnica.com/gadgets/2020/06/this-is-apples-roadmap-for-moving-the-first-macs-away-from-intel/\n\n\"Intel actually says that the issues with its current 7nm production means that production is trending a year behind its internal roadmap. For some reason, though, the company says that being a year behind schedule will still only result in that aforementioned six-month delay to market. For comparison, AMD has already been outputting its own Ryzen 4000 chips based on its 7nm architecture for months, which have been handily outperforming Intel’s offerings.\"\n\nhttps://www.theverge.com/circuitbreaker/2020/7/23/21336356/intel-7nm-chips-next-gen-delay-q2-2020-earnings-amd-10nm-tiger-lake-desktop-laptop-cpu",
        "created_utc": 1601630089,
        "id": "g7dupx5",
        "score": 1,
        "subreddit": "investing",
        "created": 1601658889.0
    },
    {
        "author": "_umm_0",
        "body": "HYLN is untradable in Vanguard and Fidelity this morning. Was going to roll a $60 covered call to next week and a higher strike price if I could but looks like it won't happen. Eh, maybe the premium will be higher this Monday.",
        "created_utc": 1601646165,
        "id": "g7eg2tz",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601674965.0
    },
    {
        "author": "Dumb-Retail-Trader",
        "body": "PTK unit splits into one share and one whole warrant huh? This sounds like a good arb opportunity. \n\nI think I also need to move to Fidelity. Tried to arb a 6 cents or so for CCIV units vs commons+warrants and it took ML a whole week to split and $30. Don’t mind the $30 as much but a week is so damn long. I keep reading here Fidelity is much quicker like 2 days.",
        "created_utc": 1601652348,
        "id": "g7ergiv",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601681148.0
    },
    {
        "author": "AssistanceFluid",
        "body": "https://www.stockbrokers.com/compare/fidelityinvestments-vs-robinhood\nCheck this out for detailed analysis to compare Fidelity and Rh.",
        "created_utc": 1601655000,
        "id": "g7ewpla",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601683800.0
    },
    {
        "author": "Zamoon",
        "body": "Thinking of dropping rh. Is Fidelity good?",
        "created_utc": 1601706472,
        "id": "g7hov8j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601735272.0
    },
    {
        "author": "sirvapedalot",
        "body": "Yeah I suspect they’ll go with Goldman and Morgan Stanley as some of the main underwriters so I’m guessing maybe it’ll be available through Fidelity but not sure who else\n\nI also have Schwab, TD, and WeBull but they have more limited IPO access usually",
        "created_utc": 1601706479,
        "id": "g7hovi2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601735279.0
    },
    {
        "author": "domyorke",
        "body": "I started with robinhood and it’s a great platform for getting started as it’s intuitive and easy to understand. I recently opened a Roth IRA with fidelity and I’m loving that tho as well. If you haven’t, I absolutely recommend it. You can put money in there and buy stocks just like robinhood, plus you have access to international stocks if that matters to you, and it will be tax free when you turn 59.5. Plus, you get free withdrawals of your contribution amount anytime (you’re only taxed on your gains for early withdrawals I believe). So there’s not much of a downside. This is coming from a 28 year old who wishes he did this 6 years ago instead of this year lol",
        "created_utc": 1601707175,
        "id": "g7hpn0c",
        "score": 1,
        "subreddit": "investing",
        "created": 1601735975.0
    },
    {
        "author": "AnotherThroneAway",
        "body": "&gt; price improvement on approximately 90% of orders.\n\nI'm Fidelity and find it absolutely weird when I don't get a price improvement on a trade. Ordering matters!",
        "created_utc": 1601711323,
        "id": "g7hu6nh",
        "score": 1,
        "subreddit": "investing",
        "created": 1601740123.0
    },
    {
        "author": "dudeitsadell",
        "body": "they sell your options when they are ITM? wtf.. ive never heard of this. get on fidelity bro",
        "created_utc": 1601699062,
        "id": "g7hfqzz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601727862.0
    },
    {
        "author": "LiquidatorBruntFCA",
        "body": "Why are you trading options on vanguard instead of etrade, fidelity or ToS?",
        "created_utc": 1601704127,
        "id": "g7hm7qo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601732927.0
    },
    {
        "author": "oleosmirf",
        "body": "I have Fidelity. I can buy HYLN, but I can't say sell any of my shares.",
        "created_utc": 1601667066,
        "id": "g7fn7bb",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601695866.0
    },
    {
        "author": "Patereye",
        "body": "Fidelity wont even let me short this stock 0\\_0  \n\n\nNot enough shares to fill the request???",
        "created_utc": 1601576338,
        "id": "g7b9rzs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601605138.0
    },
    {
        "author": "SElonsC42069",
        "body": "Bruh I just found out my dad has been 💎 ✋✋ AMZN for over a decade\n\nPuts on my mother's fidelity, can't be my biological father",
        "created_utc": 1601557576,
        "id": "g7a5d2k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601586376.0
    },
    {
        "author": "BigSalad",
        "body": "That was clear with fact He’s using fidelity. He’s no robinhood scrub",
        "created_utc": 1601543299,
        "id": "g79pixu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601572099.0
    },
    {
        "author": "dajuhnk",
        "body": "Robinhood user asking for OTC stocks lol. Get fidelity you'll be glad you did. Otherwise just keep trading NASDAQ stocks. It's not about the price of the stock it's about the percentage",
        "created_utc": 1601720091,
        "id": "g7i2z19",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601748891.0
    },
    {
        "author": "ImmediateHistorian2",
        "body": "Put all 85K into a good brokerage account - Schwab - Fidelity - IB - etc...\n\n90% into TSLA stock - then forget about it. \n\nFor the other 10% Use no more than 5% of the remaining cash for each other investment - options, whatever. Good luck to you.",
        "created_utc": 1601683404,
        "id": "g7gqhsv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601712204.0
    },
    {
        "author": "Evaloalove",
        "body": "Get rid of RH and get fidelity.",
        "created_utc": 1601683650,
        "id": "g7gqw0x",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601712450.0
    },
    {
        "author": "Frankie__Spankie",
        "body": "The only way you lose all your money in the stock market is by blowing it all in options and/or blowing it all on penny stocks that get delisted. \n\nThose both sound like gambling problems and they both sound like he'd have that problem wherever he goes, whether it's Robin hood, vanguard, fidelity, etc. Maybe get him some help or at least teach him that the stock market isn't a slot machine.",
        "created_utc": 1601724004,
        "id": "g7i95sz",
        "score": 1,
        "subreddit": "investing",
        "created": 1601752804.0
    },
    {
        "author": "Sloppy_JoeBK",
        "body": "Don’t know if this is helpful but in fidelity you can do it by checking closed positions page.",
        "created_utc": 1601731756,
        "id": "g7ifd34",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601760556.0
    },
    {
        "author": "myke_oxbig45",
        "body": "Fidelity small pp Schwab big pp",
        "created_utc": 1601733208,
        "id": "g7ihuib",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601762008.0
    },
    {
        "author": "shrpdrssd",
        "body": "For index funds, it seems mutual funds now often cheaper than ETF. Say S&amp;P 500, plenty MF are under 2 basis points, but no ETF this cheap.\n\nAnd fidelity created zero MF, not ETF.",
        "created_utc": 1601733665,
        "id": "g7iiozz",
        "score": 1,
        "subreddit": "investing",
        "created": 1601762465.0
    },
    {
        "author": "AnonymousWjsjsbsb",
        "body": "Moving to Ameritrade. Fuck schwab and their rich person fees, and fuck Fidelity and their voice verification and anal risk department.",
        "created_utc": 1601712126,
        "id": "g7hv2fk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601740926.0
    },
    {
        "author": "marnuslabushane",
        "body": "Schwab has given me no such problems and like Fidelity, is fee free for OTC.",
        "created_utc": 1601550923,
        "id": "g79whqy",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601579723.0
    },
    {
        "author": "GBAgency",
        "body": "Fidelity is solid. Interface is like Windows 98 and iOS/android apps are nothing special.\n\nBut it’s utterly functional and their support is great; that is, you can always chat with a professional and real human.\n\nTastyworks is complex and functional. Some issues on certain types of iOS devices, but their interface is top-notch and every bit as complex and capable as you’d like it to be.",
        "created_utc": 1601576857,
        "id": "g7baxrl",
        "score": 1,
        "subreddit": "options",
        "created": 1601605657.0
    },
    {
        "author": "BrandinoGames",
        "body": "I started trading when I was 14. At first, I just found random stocks and threw money at it, and cared about every single penny I earned or lost. Now, I can look back on it an laugh. I had major paper hands, and just couldn't resist checking the prices to see if I had lost a few dollars. \n\nI would say that most people would and should be investing as early as possible, reason being that you can put money in index funds and hold for the long term. Trading is a different matter, I would say that around the age of 15-16 is probably a good time to start. Start with a little bit, and play around with it. The reason being is that you're able to experiment and learn things about the market before actually committing larger amounts of money. \n\nAs for starting off, I would highly recommend watching youtube videos or a udemy course on investing basics, as well as looking at Investopedia. Those in combination with reading posts on specific reddit subs (r/stocks, r/finance, r/stockmarket, r/options) helped me get started. Reading reddit posts gets me more interested into trading. Stay away from WSB though, there's a lot more meme material there.\n\nIf you want to invest and not trade, then research basic market principles, how index funds/ETFs work, and research various ETFs. Generally I like to look at total market index funds, mid-large cap company funds, and emerging markets/fast growing markets such as Tech, EV, and Cannabis.\n\nIf you want to minimize risk, hold ETFs for the long term. Open a brokerage account through Fidelity, TD Ameritrade, Schwab, etc and put a portion of your paycheck into it. I actually really like this short document that has an ETF trading strategy: [https://www.etf.com/docs/IfYouCan.pdf](https://www.etf.com/docs/IfYouCan.pdf)\n\nTL;DR: Look at a basic investing course on Udemy or YouTube to learn basics of the market, and read about things on specific reddit subs. Invest and don't trade (investing tends to be holding for the long term while trading tends to be more short term). Invest in ETFs, and there are many different resources for finding which ones to invest in.",
        "created_utc": 1601579196,
        "id": "g7bgdso",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601607996.0
    },
    {
        "author": "antoniosrevenge",
        "body": "I suggest reading the [PF prime directive](https://www.reddit.com/r/personalfinance/wiki/commontopics) to determine if investing is the next right step for you and learn more about types of accounts to contribute to, and their wiki page on [investing](https://www.reddit.com/r/personalfinance/wiki/investing) (similar info covered in this sub’s wiki)\n\nI also recommend the [Boglehead’s wiki](https://www.bogleheads.org/wiki/Bogleheads®_investment_philosophy)\n\nStart with broad market index funds if you don't know what you're doing - agree that Vanguard, Fidelity, or Schwab are all good options",
        "created_utc": 1601746709,
        "id": "g7j5y7z",
        "score": 1,
        "subreddit": "investing",
        "created": 1601775509.0
    },
    {
        "author": "GrowStrong1507",
        "body": "yea same couldn't find the ticker on any broker i have. TD WB RH or Fidelity",
        "created_utc": 1601704373,
        "id": "g7hmi73",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601733173.0
    },
    {
        "author": "Normie_O1",
        "body": "I second this. Fidelity is a hell of a beast if used on pc",
        "created_utc": 1601707302,
        "id": "g7hprm0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601736102.0
    },
    {
        "author": "Prophetic_Pisces",
        "body": "I dislike Robinhood because I think it's a shitty app when there are (IMO) better options from larger institutions with more to offer. Robinhood did great with ushering in new investors and cracking the market to force no-commission trades everywhere, but now that Fidelity, Vanguard, and Schwab have that too, what's the point?",
        "created_utc": 1601708212,
        "id": "g7hqrev",
        "score": 1,
        "subreddit": "investing",
        "created": 1601737012.0
    },
    {
        "author": "Boss1010",
        "body": "Thoughts on Fidelity brokerage? They arent even willing to reimburse the $75 ACAT fee from RH",
        "created_utc": 1601592113,
        "id": "g7c8av4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601620913.0
    },
    {
        "author": "SpliTTMark",
        "body": "I wish fidelity offered it though..",
        "created_utc": 1601591956,
        "id": "g7c80vn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1601620756.0
    },
    {
        "author": "SloviXxX",
        "body": "Ahhh that would explain it. The transfer to my bank was still pending but Fidelity was already showing the funds deducted yesterday.",
        "created_utc": 1601556787,
        "id": "g7a45i0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601585587.0
    },
    {
        "author": "arice948",
        "body": "Is there a way to view this in Fidelity or any other monitor?",
        "created_utc": 1601586994,
        "id": "g7byurb",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601615794.0
    },
    {
        "author": "DeNovaCain",
        "body": "All the big ones have been updated. Robinhood, TD, Schwab, Fidelity.",
        "created_utc": 1601649822,
        "id": "g7emmyk",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1601678622.0
    },
    {
        "author": "broke-gambla",
        "body": "Lmfaoooo so you want to use two different platforms to trade. You might as well just use fidelity.",
        "created_utc": 1601652642,
        "id": "g7es1h9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601681442.0
    },
    {
        "author": "AssistanceFluid",
        "body": "I have been able to trade through fidelity all morning even with the merger of shll/hyln. No issues. I would definitely recommend fidelity over RH.",
        "created_utc": 1601653630,
        "id": "g7eu02r",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601682430.0
    },
    {
        "author": "AssistanceFluid",
        "body": "Yep! I just bought Some more HYLN for 39 on fidelity",
        "created_utc": 1601653405,
        "id": "g7etk4f",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601682205.0
    },
    {
        "author": "AssistanceFluid",
        "body": "Fidelity has no account fees.\nFidelity offers free fractional share purchasing on stocks and ETFs. No commissions to trade US online stocks.\nThey also have Zero index funds (so u can invest without paying any fees). \nOverall fidelity’s fees and commissions are the lowest among the other brokerages",
        "created_utc": 1601654551,
        "id": "g7evthk",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1601683351.0
    },
    {
        "author": "Ac-28",
        "body": "Even more gamble-ey.\n\nDamn Fidelity doesn't offer them.",
        "created_utc": 1601620596,
        "id": "g7dkgk6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601649396.0
    },
    {
        "author": "dvdmovie1",
        "body": "&gt; Again, I know almost nothing about investing so I don’t know what the best option would be for me.\n\nDon't use RH. Use Fidelity, which offers the same things (fractional, etc) and more features/better customer service. If you're going to be more involved, do it on a better brokerage.",
        "created_utc": 1601541425,
        "id": "g79o0vp",
        "score": 1,
        "subreddit": "investing",
        "created": 1601570225.0
    },
    {
        "author": "TreyATX",
        "body": "You really thought Blackrock and Fidelity we’re going to let their investments go to $0 in NKLA 🤣🤣🤣🤣🤣🤣🤣🤡🤡🤡🤡🤡",
        "created_utc": 1601563227,
        "id": "g7afs5c",
        "score": -3,
        "subreddit": "wallstreetbets",
        "created": 1601592027.0
    }
]