[
    {
        "author": "alpha_beta_pruning",
        "body": "Semis can be risky/volatile since they're affected by trade policy and the market performance of other sectors, but that also makes them a great long term investment. TSM has some of the best fabs in the world. You might also check \nMCHP, AMAT, or NXPI. Or check out LRCX since they build the hardware that then builds your hardware. :)",
        "created_utc": 1591820178,
        "id": "ftmczyk",
        "permalink": "/r/investing/comments/h0ihcb/so_bought_4_shares_of_tsm_today/ftmczyk/",
        "score": 5,
        "subreddit": "investing",
        "created": 1591848978.0
    },
    {
        "author": "dreammanalishi",
        "body": "I usually wait til the morning to decide, but Friday morning's list was...\n\nAYX\n\nBAH\n\nBLK\n\nBLL\n\nCAT\n\nCERN\n\nCL\n\nCMCSA\n\nCNSL\n\nCPB\n\nCSCO\n\nCTVA\n\nCVNA\n\nCZR\n\nDB\n\nDE\n\nDIS\n\nELF\n\nERIC\n\nGGG\n\nHD\n\nHLF\n\nHMC\n\nHUBB\n\nIEC\n\nINTC\n\nJNPR\n\nKDP\n\nKWR\n\nLANC\n\nLMT\n\nLOW\n\nLRCX\n\nMA\n\nMJCO\n\nMMM\n\nMORN\n\nMS\n\nMU\n\nMWA\n\nOOMA\n\nPAYC\n\nPCAR\n\nPCTY\n\nPSTG\n\nQCOM\n\nRACE\n\nSMTC\n\nSNE\n\nSPY\n\nSSSS\n\nSTN\n\nTCX\n\nTQQQ\n\nTSLA\n\nUBS\n\nULTA\n\nV\n\nVMW\n\nWCN\n\nWDAY\n\nWGO\n\nWIRE\n\nZEN\n\nZNGA\n\nI'm sure some will carry over to Monday.\n\nI move fast in the morning, but if I have time, maybe I'll try to remember to post before the market opens.",
        "created_utc": 1591462839,
        "id": "ft5c6bv",
        "permalink": "/r/wallstreetbets/comments/gxubtc/the_market_already_has_a_blueprint_in_front_of_you/ft5c6bv/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591491639.0
    },
    {
        "author": "obzzervant",
        "body": "That's why I finally bought AAPL, AMZN, as well as keeping buying TSLA, and more LRCX.",
        "created_utc": 1591822698,
        "id": "ftmi9q6",
        "permalink": "/r/stocks/comments/h0ehgw/every_day_i_dont_buy_tsla_is_a_day_i_wish_i_had/ftmi9q6/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1591851498.0
    },
    {
        "author": "SelfDiagnosedMulatto",
        "body": "LRCX was a good play on MU earnings. If it opens at 322 it’s running all week to 340 at least",
        "created_utc": 1593464411,
        "id": "fwenx64",
        "permalink": "/r/wallstreetbets/comments/hi7a6k/mu_earnings_thread_today_after_the_bell/fwenx64/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593493211.0
    },
    {
        "author": "mke1996",
        "body": "Went all in on LRCX. Dipppppppppp has been bought",
        "created_utc": 1591112348,
        "id": "fsn7vnr",
        "permalink": "/r/wallstreetbets/comments/gv4nuh/daily_discussion_thread_for_june_02_2020/fsn7vnr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591141148.0
    },
    {
        "author": "blazespinnaker",
        "body": "ZNGA - not much today.  Man I really hated Pincus back in the day.   Still, this could be insider trading, they were corrupt to the core.  Hard to tell with your write up though if there are any short dated plays.\n\n  \nAZN -0.8%.  Looks interesting with the expiry date being pushed out.  High P/E of 94 and 139B market cap.  Very curious play, but could be hedging.\n\nFLEX + 2% - has an investors conference prez at June 4th.  I did an unusual options play on LRCX around something like this and it worked out very well.  Might try this again.",
        "created_utc": 1591138843,
        "id": "fsorbw2",
        "permalink": "/r/options/comments/gutfzh/unusual_option_activity_for_60120/fsorbw2/",
        "score": 1,
        "subreddit": "options",
        "created": 1591167643.0
    },
    {
        "author": "n4775u",
        "body": "I have been playing long positions on realted semiconductor manufacturing, because of big upcoming global demand for 5G chips since last December... had to liquidate in first week of March as corona fucked everything up.\n\nTickers to go long on QCOM, TSM, AMAT, KLAC, LRCX\n\nNOTE: I am yet to check if and how any fundamentals were changed by corona impact for AMAT, KLAC and LRCX, but I haven't noticed any concerning intelligence",
        "created_utc": 1592368631,
        "id": "fv3b2xy",
        "permalink": "/r/wallstreetbets/comments/haenr6/5g_tendies/fv3b2xy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592397431.0
    },
    {
        "author": "cyphersk8",
        "body": "LRCX, SHOP, MSFT",
        "created_utc": 1592372504,
        "id": "fv3g901",
        "permalink": "/r/stocks/comments/haikyh/what_is_your_favorite_stock_in_your_current/fv3g901/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592401304.0
    },
    {
        "author": "Jwceltic5",
        "body": "LRCX, KLAC, and ASML are my favorites on the equipment side.",
        "created_utc": 1592359510,
        "id": "fv2wlpf",
        "permalink": "/r/stocks/comments/haes3t/best_semiconductor_stocks/fv2wlpf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592388310.0
    },
    {
        "author": "n4775u",
        "body": "Mostly sitting out this stalemate right now, have small hedged bets on SPY and TQQQ puts expiring 8/21 leaving me time to bail if nothing happens by end of July.\n\nOther than that I am sticking with my pre-corona tickers of choice in semiconductor manufacturing - TSM, QCOM, AMAT, KLAC, LRCX and emerging e-sport - ATVI, AESE, SLGG and GMBL.\n\nChasing fomo on meme stocks is fun, but I don't have time to day trade and do my own DD of half-assed DDs here in WSB to gauge if it is calculated risk or just a trap that's going to reverse as soon as I walk into it. Had some good luck with SPCE and BYND, but mostly I was too late and had to cut loses doing that.",
        "created_utc": 1592539466,
        "id": "fvazdr3",
        "permalink": "/r/wallstreetbets/comments/hbnp92/dont_ever_go_full_reeetard_counter_to_shorting_a/fvazdr3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592568266.0
    },
    {
        "author": "dreammanalishi",
        "body": "I add up all the buy indicators for each stock, mostly, then have other criteria.\n\nMy bot says this, this morning... but keep in mind I only buy large amounts and sell after a small increment. I also haven't manually vetted these, yet. What you are looking for is stuff that is close to its pre Covid high that was already doing well. No energy, Pharma, therapeutics. Never buy at the top.\n\nACM\n\nADP\n\nADT\n\nAME\n\nAMPH\n\nAMTD\n\nANET\n\nANTM\n\nAYX\n\nBAM\n\nBLK\n\nBLL\n\nCAT\n\nCERN\n\nCL\n\nCMCSA\n\nCOST\n\nCZR\n\nDE\n\nDIS\n\nELF\n\nGGG\n\nHLF\n\nHMC\n\nHUBB\n\nIEC\n\nIGSB\n\nINTC\n\nIR\n\nKDP\n\nLMT\n\nLRCX\n\nMA\n\nMJCO\n\nMMM\n\nMORN\n\nMS\n\nMU\n\nMWA\n\nNEBU\n\nOOMA\n\nPAYC\n\nPCAR\n\nPCTY\n\nPSTG\n\nQCOM\n\nRACE\n\nSMTC\n\nSNE\n\nSPY\n\nSSSS\n\nSTN\n\nTCX\n\nTQQQ\n\nTSLA\n\nUBS\n\nULTA\n\nV\n\nVEA\n\nVMW\n\nWCN\n\nWDAY\n\nWIRE\n\nWM\n\nZEN",
        "created_utc": 1591622461,
        "id": "ftd7p74",
        "permalink": "/r/wallstreetbets/comments/gxubtc/the_market_already_has_a_blueprint_in_front_of_you/ftd7p74/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591651261.0
    },
    {
        "author": "quaeratioest",
        "body": "In terms of tech, look for the solid names like LRCX, AVGO, AAPL, MSFT, companies that have solid balance sheets and cash flows. \n\nMost of the crap CNBC turds are peddling will go down the sewer when things get rough.",
        "created_utc": 1593382443,
        "id": "fwb3z2d",
        "permalink": "/r/wallstreetbets/comments/hhlabq/tech_is_not_overvalued_a_rebuttal/fwb3z2d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593411243.0
    },
    {
        "author": "lffuser2128etc",
        "body": "LRCX and KLAC have better margins and are run better than AMAT, imho",
        "created_utc": 1593366133,
        "id": "fwa8zpw",
        "permalink": "/r/investing/comments/hhcakj/what_are_you_buying_if_theres_a_second_crash/fwa8zpw/",
        "score": 1,
        "subreddit": "investing",
        "created": 1593394933.0
    },
    {
        "author": "Jwceltic5",
        "body": "I've been holding LRCX for a long time so hopefully I can give you some perspective. As the other reply stated, capex has actually been increasing. \n\nSales has increased because the semiconductor equipment industry is extremely cyclical, where companies overspend on manufacturing equipment trying to meet demand every couple of years. LRCX has increased revenue by pivoting/focusing on DRAM and NAND, as well as expanding their services (repairs, maintenance, etc.) business that provides consistent cash flow. I believe that segment is now \\~30% of revenue.",
        "created_utc": 1592537535,
        "id": "fvawfph",
        "permalink": "/r/investing/comments/hbqlk3/lam_research_revenue_growth_v_capex/fvawfph/",
        "score": 1,
        "subreddit": "investing",
        "created": 1592566335.0
    },
    {
        "author": "Jwceltic5",
        "body": "Some ideas for chipmakers - TSM, LRCX, KLAC",
        "created_utc": 1591204158,
        "id": "fsrkhl2",
        "permalink": "/r/stocks/comments/gvvthm/planning_to_enter_the_5_g_race/fsrkhl2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591232958.0
    },
    {
        "author": "dameLillardManiac",
        "body": "LRCX and other chip makers should drop drastically tmrw barring other news. Last time there was negative trade news LRCX dropped from 280 to 230...",
        "created_utc": 1592876391,
        "id": "fvp6sfq",
        "permalink": "/r/wallstreetbets/comments/hdzqai/what_are_your_moves_tomorrow_june_23_2020/fvp6sfq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592905191.0
    },
    {
        "author": "Dwight256",
        "body": "I'm a new investor who started in January 2020 and have been learning while taking a pummeling.  Portfolio strategy: identify 20 good stocks, primarily with strong dividends, and gradually fuel them until I can retire and live on the proceeds in 20-30 years.  I'm looking to invest in huge companies that will remain afloat for the rest of my life, in so far as that is possible.  Initial goal: to fund each of the 20 stocks to $1k (60% complete), then to $3k, then to $5k.  After investing $100k between all 20 stocks, reassess.  All dividends are DRIPing into new shares.  \n\nI plan to invest or have already invested $1k in the following companies: Broadcom (AVGO), Nvidia (NVDA), AMD, JPMorgan (JPM), Bank of America (BAC), Johnson and Johnson (JNJ), Proctor and Gamble (PG), Tesla (TSLA), Alaska Air (ALK), GM, Intel (INTC), Home Depot (HD), NextEra Energy (NEE), Brookfield Renewable Partners (BEP), Verizon (VZ), Visa (V), Microsoft (MSFT), Lam Semiconductors (LRCX), Caterpillar (CAT), and 5% into an S&amp;P 500 index (VOO).  \n\nI inherited 6k in Lockheed Martin (LMT) and may also push that on the side.  I have $1k in Disney and will assess whether to add to that later; for now, it's not part of the plan above.  \n\nI would like to avoid selling any stocks for the majority of my time owning them.  I'm interested in solar tech and considering a position in SolarEdge (SEDG).  \n\nThoughts?  I'm a novice and input is welcome.",
        "created_utc": 1593154760,
        "id": "fw1fbox",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fw1fbox/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593183560.0
    },
    {
        "author": "padreezy",
        "body": "AZN, COST, EA, HD, LOW, LRCX, NVDA, POWI",
        "created_utc": 1593090971,
        "id": "fvy9ert",
        "permalink": "/r/stocks/comments/hfkyl1/best_bluechip_that_arent_in_top_5/fvy9ert/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1593119771.0
    },
    {
        "author": "mechtech",
        "body": "&gt; I shorted the market when Apple initially reported supply chain problems back in early February and turned 15k into 130k\n\nHah, I did exactly the same thing. Turned 5k into 100k in an old brokerage account through Apple puts at the start of the crash. Once South Korea and Samsung facilities got hit with COVID I figured there would be (warranted) doomsday predictions about tech supply chains that would hit AAPL.\n\nI did end up catching the bottom though in another account. SABR @ 3, CPRI @ 6, LEAPS on VTR @ 15. Those were the core buys when the market was at peak liquidation. That account was managed into a more balanced COVID-recovery portfolio. Still very heavy on SABR and CPRI.\n\nHere are some of the current holdings: https://i.imgur.com/IAiV8gp.png. It's admittedly an absolute mess because it's all locked in a brokerage account that none of this should have taken place in. The market was literally down 10% and my main trading account was in a hilariously bad margin call while I was on the phone with someone asking \"is the world ending\", so the set of buys at market bottom were extremely haphazard and chaotic. Meanwhile, tech is my wheelhouse yet I happened to be about to pull the trigger on luxury clothing (which I know *absolutely* nothing about) because it's apparently trading at half of its bankruptcy value and buys needed to happen within a window of the next few minutes as the -10% market was turning. Just an absurd day. Things may have literally been on fire as far as my memory serves. Soon it will be in an IB portfolio margin account with proper management tools though.\n\nSo the path has been: Set of random equities and options from the SPY 2200 market bottom -&gt; Scaling out of those positions and buying Quality/Tech (asml, lrcx, nok, sbux, oled , chl were the buys in the weeks after the bottom) -&gt; Value COVID recovery/\"return to normalcy\" stocks (brk, bx, banks, txrh, cxw, vwagy, dfs, banks). There's also been some side ventures in there like buying CLMT and XOM during the negative oil event, and those won't be held long term.\n\nLots of options not showing there as well. Collars on positions, covered calls, 200k short nasdaq hedge. Basically locking in the profits and marching towards neutral until the positions can move over to the PM margin account and it can turn into something actually sane.\n\nA lot of that stuff is probably going to be gone by next friday and sold into the rotation. dfs up 10% today, sabr up 12%, txrh up 8%, Well +7%, VTR +10%, CXW +6%... Today was the exact day that that list of stocks was positioned for. There was a 4 sigma move into value a few weeks ago that I took to be a canary in the coal mine for the rotation. Looked like a quake from quant funds moving factors around. Not sure what's next. It's probably time to focus on the insane quarterly reports we're about to get, and start actually paying attention to the real economy and things like the +600 unemployment checks rolling off and the unemployment trajectory. Maybe just step out of the way until that all picks trends.\n\nThere are still many laggards to pick out but they by and large have debt loads that carry a very real bankruptcy risk, and some extreme exposure to COVID and lockdowns (restaurants, entertainment, companies like SABR that provide the back-end for flight booking). So they come with a bundle of esoteric and disastrous tail risks, but honestly, some of the common risk exposures like consumer credit risk, commercial real estate, etc aren't rocket science to hedge against. Most of this stuff is not something I'd want to leave alone without watching charts for even a day though, even in a decently hedged portfolio.",
        "created_utc": 1591210114,
        "id": "fsrxhjt",
        "permalink": "/r/investing/comments/gvfrtd/sp_500_now_out_of_correction_territory_highest/fsrxhjt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1591238914.0
    },
    {
        "author": "dreammanalishi",
        "body": "My bot says this, this morning... but keep in mind I only buy large amounts and sell after a small increment. I also haven't manually vetted these, yet. What you are looking for is stuff that is close to its pre Covid high that was already doing well. No energy, Pharma, therapeutics. Never buy at the top.\n\nACM\n\nADP\n\nADT\n\nAME\n\nAMPH\n\nAMTD\n\nANET\n\nANTM\n\nAYX\n\nBAM\n\nBLK\n\nBLL\n\nCAT\n\nCERN\n\nCL\n\nCMCSA\n\nCOST\n\nCZR\n\nDE\n\nDIS\n\nELF\n\nGGG\n\nHLF\n\nHMC\n\nHUBB\n\nIEC\n\nIGSB\n\nINTC\n\nIR\n\nKDP\n\nLMT\n\nLRCX\n\nMA\n\nMJCO\n\nMMM\n\nMORN\n\nMS\n\nMU\n\nMWA\n\nNEBU\n\nOOMA\n\nPAYC\n\nPCAR\n\nPCTY\n\nPSTG\n\nQCOM\n\nRACE\n\nSMTC\n\nSNE\n\nSPY\n\nSSSS\n\nSTN\n\nTCX\n\nTQQQ\n\nTSLA\n\nUBS\n\nULTA\n\nV\n\nVEA\n\nVMW\n\nWCN\n\nWDAY\n\nWIRE\n\nWM\n\nZEN",
        "created_utc": 1591622297,
        "id": "ftd7fuv",
        "permalink": "/r/wallstreetbets/comments/gxubtc/the_market_already_has_a_blueprint_in_front_of_you/ftd7fuv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591651097.0
    },
    {
        "author": "dreammanalishi",
        "body": "My bot says this, this morning... but keep in mind I only buy large amounts and sell after a small increment. I also haven't manually vetted these, yet. What you are looking for is stuff that is close to its pre Covid high that was already doing well. No energy, Pharma, therapeutics. Never buy at the top. Be careful of stuff that was on Firday's list... just be sure to manually check it, as it gets weighted higher if I successfully exceeded my target prices.\n\nACM\n\nADP\n\nADT\n\nAME\n\nAMPH\n\nAMTD\n\nANET\n\nANTM\n\nAYX\n\nBAM\n\nBLK\n\nBLL\n\nCAT\n\nCERN\n\nCL\n\nCMCSA\n\nCOST\n\nCZR\n\nDE\n\nDIS\n\nELF\n\nGGG\n\nHLF\n\nHMC\n\nHUBB\n\nIEC\n\nIGSB\n\nINTC\n\nIR\n\nKDP\n\nLMT\n\nLRCX\n\nMA\n\nMJCO\n\nMMM\n\nMORN\n\nMS\n\nMU\n\nMWA\n\nNEBU\n\nOOMA\n\nPAYC\n\nPCAR\n\nPCTY\n\nPSTG\n\nQCOM\n\nRACE\n\nSMTC\n\nSNE\n\nSPY\n\nSSSS\n\nSTN\n\nTCX\n\nTQQQ\n\nTSLA\n\nUBS\n\nULTA\n\nV\n\nVEA\n\nVMW\n\nWCN\n\nWDAY\n\nWIRE\n\nWM\n\nZEN",
        "created_utc": 1591622391,
        "id": "ftd7l4l",
        "permalink": "/r/wallstreetbets/comments/gxubtc/the_market_already_has_a_blueprint_in_front_of_you/ftd7l4l/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591651191.0
    },
    {
        "author": "ZloiAris",
        "body": "Rate my portfolio: 28  \n\n\n* MSFT - impressive growth with new CEO and who stops them? Leader in the enterprise area as a cloud-service provider, team communications provider, Office 365, data analysis and BI facilities. Missing AI component, but their business is well diversified and very steady. International exposure.\n* AAPL - until revolution in smartphones (like NeuraLink or any other interface which will remove smartphones at all) very decent business. 5G is coming, a diversified business, large pile of the cash in the pocket. Apple Music is eating Spotify pie, new SE &amp; iPhone 12 should be a best-seller during X-Mas time. International exposure.\n* V - leader in the world of payments, slowly entering the crypto area, and its balance-sheet a bit better than Mastercard. In general both are good choices. The only issue is that for Visa default currency is USD, while for MA - EUR, and USD might be weakier soon.\n* INTC - leader in the retail chipset area, right now controls almost the entire CPU area.\n* NVDA - one of the few \"growth\" stocks here. Its P/E is very high, but low leverage, impressive P/S and amazing return on employed capital is making the day. NVDA is one of the biggest beneficiaries of the AI industry coming, as well as auto-pilot vehicles.\n* CTXS - ok, there is another growth company. Citrix provides capabilities to work from home without buying dedicated hardware. It means you don't need to buy everyone a corporate laptop to enable them to safely join from home. It is held by top index funds, and attracts a lot of S&amp;P 500 clients, who have high hopes in them.\n* BABA - yes, not the AMZN. BABA right now is extremely undervalued. They look absolutely amazing in every financial aspect, and thanks to extreme digitalisation of Asia, their revenue is growing super fast.\n* NKE - from one hand this is a consumer cyclical company, but from another - very strong brand. Their online shopping presens is huge, as well as exposure to a world market including China. I might assume they will stay around for a while thanks to the new trend of being healthy.\n* ACN - top IT consulting company, basically working for every Fortune 500 company. Right now I see 3 factors they will keep growing. At first, companies needed expertise to migrate to new cloud infrastructure. At seconds, companies will reduce their hiring budget for a while, but will instead hire external resources more intensively. At third, ACN made few acquisitions in the cyber-security area.\n* (Disclaimer: I had worked for EPAM for 5 years and might be biased)  EPAM - one of the faster growing IT services companies in the world. They have a very strong expertise in almost every area, like integration of complex IT solutions, cloud migrations, online shopping, etc. I see them a long term winner of the current setup. Also they start expansion to the Asia market.\n* CIEN - another long-term winner of working from home setup providing hardware configurations for organizing IT servers, clusters, telecommunications, etc.\n* LDOS - one more IT services company but working in the aerospace &amp; defense area with governments. One of the key vendors in the area of COVID-19 tracking facilities and digitalisation of government infrastructure to control COVID-19. Currently holds a portfolio of almost $30 bln agreements.\n* AVGO - another 5G chipset producer winner. Very solid diversified portfolio, good fundamentals.\n* TSM - semiconductor manufacturer, one the largest in the world. Produces chipsets for NVDA, INTC, AVGO, AMD and others. In my opinion, if I bet on the chipset industry it would be weird to not bet on TSM who is located in COVID-19 free area now and also has clients not only from the USA.\n* LRCX - yet another semiconductor company, but this time a leader in the area of automatisation of production lines. They produce solutions which help to automate facilities - the thing most factories will look into to reduce risk of COVID or any other pandemic.\n* MRK - one of the biggest healthcare companies. While everyone is watching Moderna, MRK also participates in the race for COVID-19 vaccine and has a very decent fundamentals and portfolio of products.\n* REGN - innovative bio healthcare company, their financial and earnings are skyrocketing with a huge potential to grow.\n* ROG - Swiss based healthcare company, very strong portfolio and financials\n* BAYN - I am not a super big fan of Bayer, but they are definitely undervalued now due to all PR recent PR issues. Expect to grow 50% in upcoming years, with strong fundamentals. \n* VIAC - one of the most undervalued TV companies right now. Very strong portfolio and strong fundamentals, clean balance sheet. Frankly I spent hours trying to find a reason for such a low price and didn't manage to find any except for \"index fund problem\".  \n* CI - insurance industry under the huge hit due to increasing expenses (people suffer from COVID) and reduced payments (people loosing job and might start cutting their spendings), but Cigna looks like one of the best to survive the storm and has a bright future for a long term. Faitly under-valued strong balance-sheet company.\n* SU - European large cap producer of energy, data and sustainability facilities. \n* BN - Another European large cap company: food producer. They position themselves as a healthy food producer, and COVID should not distract them as much as Americans food producers are. \n* HD - One of rare bets on American consumer spending. Leader in the area of organizing houses in sub-urban zones. With growth of WFH setup, more people expected to migrate to the country-side, so in the long term HD might benefit. Their balance sheet is also very solid.\n* VMC - Basic materials bet. Among all other basic materials companies, VMC looks the best. Also, despite I have high doubts about 1 tln infrastructure package to pass the Congress, VMC would benefit from this idea.\n* BRK-B - no introduction is needed. Buffet underperformed S&amp;P for a long time, but his portfolio is decent, he sits on a large pile of the cash and proper timing of deploying this cash would result in a great return later on. Still pretty safe to add BRK into my portfolio, their long term run looks pretty good.\n\nAlso I am considering adding 4 strong dividend companies with still promising futures.  \n\n\n* IBM - it might look like a dying mamont, but IBM for years is a leader of patents. They year by year increase their presence in cloud infrastructure, AI, robotics and other topics. With new CEO targets growth, IBM has a pretty decent future for the moment with a diversified portfolio of technologies &amp; patents. High hopes on IBM AI technologies. As well, IBM pays very huge dividends, so why not hold them for some time?\n* T - the same story but in another segment. Might benefit from 5G, has a diversified portfolio, enters the \"stream wars\" area and pays a huge dividend. As a diversification for stocks who pays small dividends but grow in market cap, good choice. \n* STX - Another high dividend representative from the hardware storage business. This area will stay around for a while, and STX is healthier than their competitors, look like a safe bet for a long term holding. \n* ABBV - And the last high-dividend company from the healthcare segment. There is a lot of analysis of ABBV around, so no reason to repeat it all.\n\nAnd 1 ETF:  \n\n\n* EXV6 - since I am EU resident, I need to invest into UCITS, and this is a basic materials ETF mainly RIO, BHP, GLEN, AAL. This segment supports all manufacturing around the world, why should they have gone?\n\nThat's basically it. I am still playing around numbers to calculate the potential risk of this portfolio and define the proper % allocation of stocks, but what's your thoughts on the companies from the list?",
        "created_utc": 1592850809,
        "id": "fvnula3",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fvnula3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592879609.0
    },
    {
        "author": "Lunatik_14",
        "body": "Lrcx 330c 7/2",
        "created_utc": 1593009139,
        "id": "fvurx20",
        "permalink": "/r/wallstreetbets/comments/heyhlj/daily_discussion_thread_for_june_24_2020/fvurx20/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593037939.0
    },
    {
        "author": "anomander_rake123",
        "body": "Hitting my head against the wall for selling my lam research calls yday",
        "created_utc": 1591193364,
        "id": "fsqy3hb",
        "permalink": "/r/wallstreetbets/comments/gvr9zj/daily_discussion_thread_for_june_03_2020/fsqy3hb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591222164.0
    },
    {
        "author": "Jwceltic5",
        "body": "Non-tech stocks I hold - LRCX, TOT, PG, BRK/B. All solid companies. Let me know if you have any questions.",
        "created_utc": 1591476054,
        "id": "ft6mgf5",
        "permalink": "/r/stocks/comments/gxqugi/nontech_stocks/ft6mgf5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591504854.0
    },
    {
        "author": "tuffkai",
        "body": "Try AMCR, LRCX",
        "created_utc": 1592489031,
        "id": "fv8el0c",
        "permalink": "/r/wallstreetbets/comments/hbbw0e/daily_discussion_thread_for_june_18_2020/fv8el0c/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592517831.0
    },
    {
        "author": "MiddleC5",
        "body": "I currently hold INTC, NVDA, LRCX. I used to hold TSM. I'm interested in TXN, AVGO, SWKS, AMD.",
        "created_utc": 1592352432,
        "id": "fv2kiri",
        "permalink": "/r/stocks/comments/haes3t/best_semiconductor_stocks/fv2kiri/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592381232.0
    },
    {
        "author": "DrUNC83",
        "body": "And LRCX",
        "created_utc": 1593201455,
        "id": "fw3hn6x",
        "permalink": "/r/wallstreetbets/comments/hg4wdd/daily_discussion_thread_for_june_26_2020/fw3hn6x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593230255.0
    },
    {
        "author": "Modaddy786",
        "body": "I make 10 trades a week and I only have to be right 7/10 times, it’s not easy by any means but you work at it and until it becomes second nature. I allocate 3 losses , once in a while it’s 6/10 but over average is still 7/10 . I never expect 10/10 so I am never disappointed. And if you are lucky/ risk taker, you can find SHOP, TTD, LRCX, ASML, AMZN and a host of other short term Covid related stocks DOCU, TDOC, SQ. etc, you can make more money than hedge funds because you don’t have any mandates. Work at your own pace and don’t chase market in either direction because you have no idea what big boys are buying in dark pools , block trades and who is dumping the stocks you own. Only your heart beat should mimic some of the best stocks but if your heartbeat mimics crazy ups and downs , do something else because you are dying and you keep ignoring the signs .",
        "created_utc": 1593373410,
        "id": "fwamssa",
        "permalink": "/r/StockMarket/comments/hhezkt/shower_thought_we_know_more_successful_long_term/fwamssa/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593402210.0
    },
    {
        "author": "gizamo",
        "body": "Lmfao. You're an idiot. All semis tool manufactures and chip providers are still selling to China. There are very few companies affect by that \"ban\" (which was a bipartisan bill lead by Democrats after investigations started by the Obama administration, lol). Further, AMAT, LRCX, and MU, and others have had exemptions the whole time.     \n      \nChina owns Taiwan, numbnuts. Taiwan is China, anything done in or by Taiwan is an action China can exploit.     \n      \nTSMC building a fab in the US is a good thing, and had the TTP passed, it would have happened ages ago. But, an even better thing would have been any US company building that fab. That didn't happen because Trump/GOP are too dumb to see that semis are the future of military dominance. China gets that; it's why they are blatantly stealing everyone's tech and subsidizing the ever-living shit out of their semis industry.     \n       \nFoxconn moving into India is also bad, dumbass, because it means that's not a US company gaining market share there either. It's further expansion of CCP's ability to steal more tech.     \n       \nAlso, yes, mining is a huge issue that Trump has also failed to solve in the US. In fact, his tariffs have hurt mining companies by significantly increasing their costs while also cutting away a massive chunk of their buyers. Lol. You are a massive idiot who clearly doesn't know shit about any of this. Lmfao, you election trolls are so dumb it's truly amazing.",
        "created_utc": 1593195565,
        "id": "fw35l45",
        "permalink": "/r/wallstreetbets/comments/hg9jyu/is_a_china_cold_war_inevitable_2000_under/fw35l45/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1593224365.0
    }
]