[
    {
        "author": "ryanfromin",
        "body": "For my understanding, why does Berkshire and Salesforce get the $80 price and the public at large get the IPO price? Is this standard practice for IPOs? Thanks",
        "created_utc": 1600263831,
        "id": "g5gxi9i",
        "permalink": "/r/investing/comments/itv4t4/let_this_buffet_quote_guide_you_with_your/g5gxi9i/",
        "score": 149,
        "subreddit": "investing",
        "created": 1600292631.0
    },
    {
        "author": "Coz131",
        "body": "&gt; You cannot access your data in Snowflakes account without a Snowflake Warehouse. Just like in most database software paradigms of the last 30 years, your data is locked up in their proprietary data storage layer, and you will need their engine in order to make sense of the data. If you want to migrate to another architecture, this will make it difficult and costly, just ask any Teradata customer.\n\n&gt; Just like with most of the cloud data warehouse options that currently exist, you need their compute in order to read the data into any application. This essentially adds a toll booth to your data, everytime you want to access your data in the cloud, you will have to pay Snowflake to access it, not just the storage costs. Is this the type of pattern scalable? Can your business afford to bake in the costs of Snowflake into every use case? Is that a value add to your business?\n\nThe same can be said for AWS/Azure and by and large many tech software. If you use AWS, you're not moving to azure. If you use salesforce, you're locked in. If you use MSSQL, you're locked in. The question isn't about lock-in, it's about the benefits that the software provides and the availability of competitors to provide a better product. In the case of Snowflake as a product, they are quite good. Toll booths aren't an issue if they provide a benefit. Many will be willing to pay for the price if it means they get to increase ROI or reduce other cost such as time.\n\nThe largest investors shook management up in order to IPO to recover their investment\n\nIn early 2019 the startup was not on a recoverable trajectory, and Frank Slootman was brought in to help the investors recover their investment. They ended up gutting the customer success team, and instead use costly partners to fill in when their customers didn't have the expertise to get it done. While you can see the benefits on their books, are customers best served in this manner? Is this scalable past a couple of years?\n\nDo you have a source for this? This one is a legitimate concern.\n\n\n&gt; Data Warehousing is on the decline\nAsk anyone that has been involved in a data warehousing project, and you will definitely hear horror stories about delays and overruns due to unforeseen circumstances. The main issue with data warehousing is that it's like waterfall programming. You need to gather all your use cases and requirements before you start building. By the time you can start building, things might have changed. Changing mid build ends up costing more time and money.\n\nIt's not different to a risk factor of an enterprise CRM/ERP implementation too. Choosing the wrong CRM/ERP is painful but what is more painful is not having a functioning CRM/ERP. Data warehousing is a necessity and one that is actually growing because insights are gold. \n\nI work in tech, many of those concerns are really just a fact of life and is not a concern for snowflake specifically and can be the same for many enterprise projects.\n\nCompany is overvalue though.",
        "created_utc": 1600361827,
        "id": "g5lr78g",
        "permalink": "/r/stocks/comments/iumz9l/5_reasons_why_snowflake_is_a_pump_and_dump_scheme/g5lr78g/",
        "score": 41,
        "subreddit": "stocks",
        "created": 1600390627.0
    },
    {
        "author": "TheGreekCoffee",
        "body": "Buffett agreed to buy at the IPO price, not at $80/share.\n \n&gt;Snowflake received a vote of confidence Tuesday after a filing revealed that Berkshire Hathaway and Salesforce each agreed to purchase $250 million of stock at the IPO price in a concurrent private placement.\n \n**The San Mateo-based company's highly anticipated IPO has managed to generate enthusiasm from Buffett, who has famously steered clear of tech stocks. Buffett agreed to invest upwards of $550 million once it goes public.**",
        "created_utc": 1600271202,
        "id": "g5hbkmd",
        "permalink": "/r/investing/comments/itv4t4/let_this_buffet_quote_guide_you_with_your/g5hbkmd/",
        "score": 31,
        "subreddit": "investing",
        "created": 1600300002.0
    },
    {
        "author": "throwaway21342134213",
        "body": "Advice to all of you young TSLA/AAPL/CRM/NVDA millionaires thinking of spending those sweet tendies:\n\nRemember if it floats, flies or fucks — it’s a lot cheaper to rent than to buy.",
        "created_utc": 1599082379,
        "id": "g3ru6a8",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3ru6a8/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1599111179.0
    },
    {
        "author": "Trisstanroberts",
        "body": "zoom and crm been killing both Q1&amp;Q2 earnings and mooning since covid lockdown and zoom contracts were cheap about 500 bucks the morning of ER to take the chance again.\n\nTesla i was hedging since the split announcement, figured it would follow apples footsteps in percentage gains but surpassed it with retarded strength. Could have made alot more on tesla pre-split rise but constantly paper handed it.\n\nso you could say i made these on a hunch from reoccuring events lol",
        "created_utc": 1599246132,
        "id": "g40xmol",
        "permalink": "/r/wallstreetbets/comments/imjd0s/15k_almost_57k_in_little_over_2_weeks/g40xmol/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1599274932.0
    },
    {
        "author": "Wanderer1066",
        "body": "I wouldn’t fuck with this. Too much risk on both sides.\n\nEDIT: Bought 85 shares of BRK.B today, which owns a few million shares of snowflake.\n\nEDIT 2: Apparently salesforce took a stake in snowflake, which I own 30 shares of.",
        "created_utc": 1600262909,
        "id": "g5gvz2o",
        "permalink": "/r/wallstreetbets/comments/itvbex/are_you_going_to_go_long_or_short_on_snowflake/g5gvz2o/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1600291709.0
    },
    {
        "author": "Nawtreallyme",
        "body": "ORCL, BABA, CRM, PYPL, ADBE, NVDA, CSCO, PD, DDOG, NET, FB, AMZN, AAPL, MSFT, CLOU, AMD, FSLY, NFLX, SKYY, XLK",
        "created_utc": 1600222901,
        "id": "g5fitjz",
        "permalink": "/r/stocks/comments/itms3i/tech_stocks_watchlist_to_buy/g5fitjz/",
        "score": 17,
        "subreddit": "stocks",
        "created": 1600251701.0
    },
    {
        "author": "dvdmovie1",
        "body": "Salesforce did awfully well with its stake in Zoom.  Probably very specific to the deal, but perhaps future partnerships or other deals, ways of gaining exposure to something or simply believed to be a good investment. You're probably going to see more and more strategic investments by larger tech companies.\n\nIn terms of Google and healthcare, Google also owns a % of another recent IPO - ONEM.",
        "created_utc": 1600262158,
        "id": "g5gur7f",
        "permalink": "/r/investing/comments/itv3hv/why_do_companies_invest_in_primary_market_ipos/g5gur7f/",
        "score": 16,
        "subreddit": "investing",
        "created": 1600290958.0
    },
    {
        "author": "freewirecard",
        "body": "If you aint buying SNOW at IPO, you really must hate money. \nBacked by CRM and Papa Buffet. \nSAAS business model. \nWorks with AWS and Microsoft, Not against. \nFuture Positions: Buying what 2K will get me in Shares asap.",
        "created_utc": 1600029401,
        "id": "g55r59a",
        "permalink": "/r/wallstreetbets/comments/is5mrk/what_are_your_moves_tomorrow_september_14_2020/g55r59a/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1600058201.0
    },
    {
        "author": "tortoisepump",
        "body": "That's true of Salesforce but I'm not sure if flipping is Papa Buffett's thing. \n\nUnless it's buying airlones high and selling low.",
        "created_utc": 1599684809,
        "id": "g4l2h54",
        "permalink": "/r/wallstreetbets/comments/ipk5yt/snowflake_set_to_ipo_at_2021_billion_valuation/g4l2h54/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1599713609.0
    },
    {
        "author": "curiouscat887",
        "body": "Basically my strategy is to look at the earning calls for the week, on the day the companies earnings are announced I usually search for that ticker and see if there are any alerts.\n\nSomething with high volume and low IO that’s quite far out with a short expiry looks like a bet to me so I look into the company a bit more and then follow the bet. \n\nI know it’s not rock solid but these are gambles after all.\n\nMost have made something like 20-30% within a few hours later. \n\nI missed the CRM one even tho I was going to do it, kicking myself for that, but with the ZM one I thought why not as it was 1.35 a contract.\n\nJust wish I put 10k into it as I’d have 400k now and could retire on theta haha but hindsight is 20/20",
        "created_utc": 1598986064,
        "id": "g3midoy",
        "permalink": "/r/options/comments/iknpp2/zm_5246_up/g3midoy/",
        "score": 14,
        "subreddit": "options",
        "created": 1599014864.0
    },
    {
        "author": "sloSRT4",
        "body": "Would like to think someone out there yolo’d CRM earnings and took gains, put it all in ZM earnings and now quitting their job",
        "created_utc": 1599015713,
        "id": "g3od8vm",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3od8vm/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599044513.0
    },
    {
        "author": "clmohn",
        "body": "I lost 40k today on tesla... I was all puts and call credit spreads expecting an offering on Monday after the close... then offering hit Tuesday morning, super pumped, went down 5% and I flipped long at 475 before the close... well that didn't go so well.  I am currently long going into tomorrow.  I think we will have a rebound.  It seemed VERY strange to me that every damn ticker was green today except tesla, apple, zoom, and salesforce.... that's some hard rotation and seems fishy to me.",
        "created_utc": 1599089131,
        "id": "g3s8mpa",
        "permalink": "/r/wallstreetbets/comments/ilgn7s/im_out/g3s8mpa/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1599117931.0
    },
    {
        "author": "VacationLover1",
        "body": "It’s great for Salesforce and Warren Buffet because they get in at the ipo price... not great for the WSBs Chads who are going to buy at +100% by open",
        "created_utc": 1599956496,
        "id": "g508ss0",
        "permalink": "/r/wallstreetbets/comments/iro1p7/will_snowflake_be_a_solid_buy_or_another/g508ss0/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1599985296.0
    },
    {
        "author": "BobLoblaw_BirdLaw",
        "body": "You at salesforce now. ?",
        "created_utc": 1600076681,
        "id": "g57sjdh",
        "permalink": "/r/wallstreetbets/comments/is95c6/microsoft_bid_rejected_by_tiktok/g57sjdh/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1600105481.0
    },
    {
        "author": "BigBoyDiapy",
        "body": "Salesforce and Apple do be fuckin me today. Good thing RKT earnings are gonna launch it to $150 🚀🚀🚀",
        "created_utc": 1599070193,
        "id": "g3qxvnb",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qxvnb/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599098993.0
    },
    {
        "author": "SpliTTMark",
        "body": "salesforce and brk should be required to pay up to the correct percentage and not 75-85\n\notherwise bullshit is bullshit",
        "created_utc": 1600272737,
        "id": "g5hepwd",
        "permalink": "/r/investing/comments/itv4t4/let_this_buffet_quote_guide_you_with_your/g5hepwd/",
        "score": 10,
        "subreddit": "investing",
        "created": 1600301537.0
    },
    {
        "author": "MLGameOver",
        "body": "I’ll put this corn I bought today up my ass if RKT pulls a CRM",
        "created_utc": 1599071706,
        "id": "g3r1pdn",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3r1pdn/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599100506.0
    },
    {
        "author": "umblueberry",
        "body": "if tesla announced an s&amp;p inclusion i think they would jump like crm with dow announcement. hoping musk leaks something today about it",
        "created_utc": 1599065191,
        "id": "g3qkxhn",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qkxhn/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599093991.0
    },
    {
        "author": "nebuloushazybull",
        "body": "For all you asking: “Wait, how tf did [insert CRWD, RKT, CLDR, etc] tank &amp; ZM 🚀 to fucking 40%?”\n\nAnd being like: “Fuck this market, this is rigged, it can’t be like that, etc.” \n\nQuit your bitching and process one thing and process it well. Read it 10-1000 times if you have to.\n\nWe’re in a fucking pandemic. Only the top dogs/upcoming and unfortunately overvalued as fuck monsters like ZM &amp; CRM are gonna dominate and destroy agenda-related items like quarterly earnings. Their leaders and engineers don’t give a shit about how much their shares have gone up this past month or year. Even if they do; they care much more about making their products or services the only and most attractive offering in their domain.\n\nStop latching on to what you heard or what you think you may know of a company. If it’s not the top of its game or the leader in what it’s doing, even if new or old, assess against the current situation and play accordingly.\n\nYes ZM &amp; CRM may not deserve the followed surges but hey, is anyone gonna need any less of either of these 2, especially during these times? Prolly not.\n\nCheers.",
        "created_utc": 1599082192,
        "id": "g3rtqf6",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rtqf6/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599110992.0
    },
    {
        "author": "TheFoxKing5",
        "body": "I cant recall in my lifetime seeing large cap stocks like Tesla and Salesforce having double digit percentage moves like this, up or down. Once you reach a certain value they typically move 2-3% on a good or bad day. The money required to make these kind of moves and the risk it entails is hard to grasp. It makes me incredibly nervous. I can assure people that it's not Robinhood traders fueling these moves.",
        "created_utc": 1599598632,
        "id": "g4h9gfg",
        "permalink": "/r/investing/comments/ip1731/tesla_snubbed_by_the_sp_500_quickly_completes_5/g4h9gfg/",
        "score": 10,
        "subreddit": "investing",
        "created": 1599627432.0
    },
    {
        "author": "MushroomManiac",
        "body": "So I basically went all-in on calls today after losing 340k in the last two days. I'm either going to be filthy fucking rich by the end of next week or I'm going to drink a gallon of bleach\n\n$118k AMZN calls - Luckily bought most of them near the very bottom, expiration about a month out\n\n$126k LULU calls - I bought mostly near the bottom and am planning on selling Tuesday on the hopeful run up to earnings.\n\n$100k ZM calls - Cuz shits gotta go back up after the sell off hysteria is over, right?\n\n$40k PTON calls - Bought mid day for a decent price, also selling day of earnings\n\n$32k ZS calls - Hoping there will be a run up to earnings on 9/9 because they usually blow past earnings estimates, planning to sell before announcement\n\n$59k in calls spread between TSLA, INTC, FB, AAPL, CRM, BYND",
        "created_utc": 1599273655,
        "id": "g42pv90",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g42pv90/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599302455.0
    },
    {
        "author": "Smit_W",
        "body": "I honestly can't tell if I'm getting better at trading or if the market is just on cruise control. I've shorted FSLY in this market and play both AAPL and CRM nearly perfect, but there's both a satisfied and hollow feeling within that tells me once we start the rundown my trading won't be as consistent. \n\nWhat I'm saying is I'm basically in the stock market version of The Matrix",
        "created_utc": 1599115951,
        "id": "g3tgrrq",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3tgrrq/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1599144751.0
    },
    {
        "author": "SnooRobots6193",
        "body": "Just looking at some of the biggest top performers this year:\n\n* AMZN PE Sept 2016: 192 (now 127)\n* FB PE Sept 2016: 57 (now 34)\n* CRM PE Sept 2016: 240 (now 99)\n* NFLX PE Sept 2016: 310 (now 87)\n* ABMD PE Sept 2016: 130 (now 80)\n* DPZ PE Sept 2016: 41 (now 34; not a tech giant, but I bring it up cause it's among the most overlooked top performer of 2010s IMO).\n\nAnd I didn't choose to compare with 2016 because it was some peak. The market climbed pretty much the entirety of 2017.\n\nObviously this list was handpicked and there are plenty of counterexamples, but the point is that growth companies have had growth priced in (and delivered on it) for many years.",
        "created_utc": 1599259923,
        "id": "g421ill",
        "permalink": "/r/stocks/comments/imjai2/the_one_frustrating_thing_about_trying_to_enter/g421ill/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1599288723.0
    },
    {
        "author": "curiouscat887",
        "body": "So I got lucky! But only because I missed CRM last week, I got an alert for unusual volume from an app I use ( I have no affiliation) and passed on it and it would have bagged me 20k so I have severe regret, I also missed out on 28k by selling my Tesla call for $500 profit and 3 days later it was worth $28k. \n\nI didn’t wanna miss out again this time so when I got another alert for this and one for tsla, I chose this as it was cheaper and luckily won, wish I put more money in it haha but can’t be greedy! \n\nThe Tsla one also did well too.",
        "created_utc": 1598981012,
        "id": "g3m4cnu",
        "permalink": "/r/options/comments/iknpp2/zm_5246_up/g3m4cnu/",
        "score": 8,
        "subreddit": "options",
        "created": 1599009812.0
    },
    {
        "author": "targetfan76",
        "body": "Rare targetfan76 post about potential good stock for tomorrow earnings, doubt anyone cares.\n\n$Zuo fairly small cloud billing server company (just like $CRM). $Crm crushed earnings and zuo went up 10% that day last week. Zoom had insane revenue and their billing is provided by $Zuo.  $crm crushing earnings + $zm crushing earnings = $zuo crushing earnings is my theory.\n\nZuo earnings tomorrow after market close and stock up 13% today and 5% after hours so might be too late to buy calls, maybe long dated calls out. If you want to buy in I think buying stock almost 100% makes you some money..",
        "created_utc": 1599012034,
        "id": "g3o6oqj",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3o6oqj/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1599040834.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "Got CRM calls.  **Cloud Boys.**",
        "created_utc": 1601486229,
        "id": "g76xfdd",
        "permalink": "/r/wallstreetbets/comments/j2jg0e/daily_discussion_thread_for_september_30_2020/g76xfdd/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1601515029.0
    },
    {
        "author": "youssooouf",
        "body": "Veeva Systems, bought at around 160$ after reading an article comparing it to Salesforce, and looked in the business model made sense to me + their financials and I was convinced. Didn’t buy much (5 shares) but it’s now at around 274$ so yeah definitely exceeded my expectations",
        "created_utc": 1599757890,
        "id": "g4pkk8q",
        "permalink": "/r/stocks/comments/iq6l75/discussion_what_stock_in_your_portfolio/g4pkk8q/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1599786690.0
    },
    {
        "author": "infinitelimits00",
        "body": "Not as high.\n\nIf you have OTM calls you are gonna get a double dose of losses in IV and delta.\n\nThe only time it can be as high is a black swan move like CRM.",
        "created_utc": 1599087964,
        "id": "g3s60aw",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3s60aw/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599116764.0
    },
    {
        "author": "infinitelimits00",
        "body": "Lol this entire market is broken. The IV is completely messed up across names. I sold a CRM put, stock goes up 3%, the put increased in value lol. Yes the IV increased I'm aware but I've never seen IV overwhelm a 3% move in delta.",
        "created_utc": 1598984656,
        "id": "g3mef46",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3mef46/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599013456.0
    },
    {
        "author": "Trumpowell",
        "body": "Lot of big names on the Snowflake train. Papa Buffett and $CRM dude  add credibility and should give it momentum",
        "created_utc": 1599928132,
        "id": "g4xzx8l",
        "permalink": "/r/wallstreetbets/comments/iqy7be/weekend_discussion_thread_for_the_weekend_of/g4xzx8l/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599956932.0
    },
    {
        "author": "nafinmasjid",
        "body": "fact: 99% of the folks here lose money on options trades. the gains that u see on the front page is like seeing a guy who won the lottery. its really all about luck and there's a few times u get a 10 bagger with lucky earnings like CRM and ZM but most of the time theta and the greeks fuck u hard. when u enter a position you think there's a 50:50 chance it goes in your direction but in reality its like a 1:20 chance it does.\n\nend rant, and no i didnt lose my portfolio today.",
        "created_utc": 1600977517,
        "id": "g6glngm",
        "permalink": "/r/wallstreetbets/comments/iyuhw0/daily_discussion_thread_for_september_24_2020/g6glngm/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1601006317.0
    },
    {
        "author": "honest_j",
        "body": "Thank you degenerates! I finally had seen enough gain porn and dropped $2k into a Robin Hood account last Tuesday. I’m now up ~450% and into 5 figures more than half in cash.  First move was CRM, then hit NVDA, and a bunch of successful SPY calls. Gonna play SPY monthlys until election. AGAIN A PROFOUND THANK YOU TO THE RETARDS!",
        "created_utc": 1599110460,
        "id": "g3tahbd",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3tahbd/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599139260.0
    },
    {
        "author": "PalekSow",
        "body": "There was definitely someone who YOLO’d their whole account into WORK after seeing CRM and ZM go to Neptune.\n\nRIP",
        "created_utc": 1599596780,
        "id": "g4h5s2a",
        "permalink": "/r/wallstreetbets/comments/ip118i/what_are_your_moves_tomorrow_september_09_2020/g4h5s2a/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599625580.0
    },
    {
        "author": "ehehe",
        "body": "I see money is flowing out of crappy companies like apple and Salesforce and into reliable companies with a bright future like Gamestop",
        "created_utc": 1599834569,
        "id": "g4trr2j",
        "permalink": "/r/wallstreetbets/comments/iqnsjz/daily_discussion_thread_for_september_11_2020/g4trr2j/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599863369.0
    },
    {
        "author": "novydoo",
        "body": "This is uuge \n\n\nhttps://twitter.com/benioff/status/1311447567868162048?s=21\n\nCalls/Leaps on CRM",
        "created_utc": 1601508717,
        "id": "g78def5",
        "permalink": "/r/wallstreetbets/comments/j2tmk7/what_are_your_moves_tomorrow_october_01_2020/g78def5/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1601537517.0
    },
    {
        "author": "SourceCodeSeller",
        "body": "boys at market open all in UPS/FDX 1DTE OTM calls. every. single. earnings. play. that destroys earnings always rallys at market open.\n\ni did this with zm, crm, etc. made an extra 3-5x in like 1 hour",
        "created_utc": 1600202726,
        "id": "g5efe79",
        "permalink": "/r/wallstreetbets/comments/it5xpg/daily_discussion_thread_for_september_15_2020/g5efe79/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1600231526.0
    },
    {
        "author": "spy22091820p",
        "body": "Fuck is wrong with WORK? Wheres that guy who turned 800 bucks into a million then back to 1000 then up to 100k off CRM and said he was putting 100k in WORK 35 strikes mid September.\n\nWHERE U AT ?!\nI DEMAND ANSWERS",
        "created_utc": 1599087002,
        "id": "g3s3wro",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3s3wro/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599115802.0
    },
    {
        "author": "gunter829",
        "body": "After Berkshire and Salesforce announced investments this thing will go parabolic. Do your research because this thing will rocket out of the gate, probably fall back down, and then move forward as the next big tech stock.",
        "created_utc": 1599967694,
        "id": "g517wxn",
        "permalink": "/r/stocks/comments/irktxc/snowflake_ipo_not_a_buy_at_open/g517wxn/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1599996494.0
    },
    {
        "author": "ar1195",
        "body": "I think docu is gonna have to dump on earnings even if it beats honestly. Look how much it’s run into it. Crm had a modest run up, zm had a decent run up but only on the day of. Docu is having a huge move 3 days before. \n\n*still gonna hold thru earnings though*",
        "created_utc": 1598984815,
        "id": "g3mev3s",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3mev3s/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599013615.0
    },
    {
        "author": "Fizzy_T",
        "body": "I'm throwing a few thousand on snowflake. My company is super fucking boomer and about to start using it. Legit product too.\n\nPlus Salesforce and Berkshire are going in on it. Good mix of retard ☁️ and fundamentals.",
        "created_utc": 1600066087,
        "id": "g57j8qq",
        "permalink": "/r/wallstreetbets/comments/is5mrk/what_are_your_moves_tomorrow_september_14_2020/g57j8qq/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1600094887.0
    },
    {
        "author": "Mister_Anthrope",
        "body": "I just bought some calls on CRM, which is going to have a $250 million stake in Snowflake. I figure since I can't get in on the IPO, this is the next best thing.",
        "created_utc": 1599755909,
        "id": "g4pfh8v",
        "permalink": "/r/stocks/comments/iq5a8v/upcoming_ipos_date_and_expected_market_cap/g4pfh8v/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1599784709.0
    },
    {
        "author": "jammyarab",
        "body": "GG guys. Hindsight is 20/20. If it had pulled a zoom or crm these same guys would be saying how its soo obvious they would crush earnings lol.",
        "created_utc": 1599079784,
        "id": "g3rnqpb",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rnqpb/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599108584.0
    },
    {
        "author": "KenSpliffeyJr",
        "body": "after sitting out on ZM and CRM no way I'm gonna avoid spending an inadvisable amount on RKT calls for a third time",
        "created_utc": 1599071961,
        "id": "g3r2cvl",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3r2cvl/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599100761.0
    },
    {
        "author": "eyerollingsex",
        "body": "I blame this all on ZM and CRM. They pumped the market too hard too fast. A slower uptrend would have held up better. This whole market reminds me of the 2017 cryp-to crash. The Robinhood options trader is pretty much the same type of person the cryp-to noobs were. They think they’re bullet proof, masters of the market and in the end the boomers are right about it being a bubble",
        "created_utc": 1599168896,
        "id": "g3wo6mr",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3wo6mr/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599197696.0
    },
    {
        "author": "rnjbond",
        "body": "You're dramatically oversimplifying what Uber does. It's not a taxi company, that much is very obvious. By your logic, Salesforce isn't a tech company, it's a white pages that uses tech. \n\nBut the bigger point is there's a blurring of lines between tech and not tech companies when every company is becoming a tech company.",
        "created_utc": 1600123024,
        "id": "g5anwri",
        "permalink": "/r/investing/comments/ismur9/let_me_get_this_right_soft_bank_buys_billions_of/g5anwri/",
        "score": 6,
        "subreddit": "investing",
        "created": 1600151824.0
    },
    {
        "author": "somanychins",
        "body": "Can confirm. AAPL added the better part of a trillion to its market cap because it split. Software sector went up 10% in one day because CRM had strong earnings. These are not normal things",
        "created_utc": 1599029942,
        "id": "g3owc91",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3owc91/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599058742.0
    },
    {
        "author": "willdatrill",
        "body": "Turned 1k into 4K with docu and just bought more calls on the little dip because earnings it’s gonna shoot up like crm and zam did",
        "created_utc": 1598977919,
        "id": "g3lvfwz",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3lvfwz/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599006719.0
    },
    {
        "author": "xDeadPresidents",
        "body": "$CRM above 282 is gonna go wild for my daytraders out there. check the charts",
        "created_utc": 1599002040,
        "id": "g3nl54o",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3nl54o/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599030840.0
    },
    {
        "author": "SteveSharpe",
        "body": "A lot of your argument could have said about AWS several years ago.  Why would anyone pay for this when it's basically just renting servers for much more than I can buy them and run them myself?  Enterprises bought into public cloud because the services were easier to consume, easier to maintain, and easier to pay for over time.  They didn't do anything that revolutionary with the underlying tech.  They just made it significantly easier.\n\nI am also in complete disagreement about companies not gaining business value from data.  I work for a large enterprise doing sales and consulting.  I essentially have to be a data analyst on the side; because I use every single piece of data our company generates to help me decide where to go next, which customers to target with which products, and which products are actually being successful after I sell them.  Today, that is a really painful process.  Importing from spreadsheets here, taking out of CRM there, grabbing some public data over here.  Where do I put it all for analysis?  Let's throw it into a database or flat file, let's grab Tableu or PowerBI or something and try to get some insight.\n\nYou know what most people end up doing?  Try to make the data set small enough that they can handle it in Excel.\n\nThe large companies that did really invest in gaining deeper insights from data (not taking the spreadsheet approach) started buying up all these Hadoop farms, Oracle, Cloudera, Mongo, whatever the hot thing at the time.  Then went and learned a bunch of ingest and analysis tools.  Hired expensive data scientists, etc.  And, yeah, they did not get nearly the value out of that investment that they should have.  Not because the data wasn't valuable, but because getting the value out of it was way too complex.\n\nIf Snowflake improves this situation, they will really be onto something.  Although they have some big potential headwinds as I mentioned in my original post, I do not think they are merely growing just because they are spending money on marketing.  They obviously have something that enterprises desire right now.  And not just because the C-Suite at these companies have no idea what they're doing.",
        "created_utc": 1599938999,
        "id": "g4ysjf2",
        "permalink": "/r/SecurityAnalysis/comments/irat9z/a_snowflake_deep_dive/g4ysjf2/",
        "score": 5,
        "subreddit": "SecurityAnalysis",
        "created": 1599967799.0
    },
    {
        "author": "akrebo18",
        "body": "Looking back it is so obvious that we were in a hyperbubble. Spy rising $5 a day rising with VXX. All these companies moonshooting like Zm crm and docu.",
        "created_utc": 1599234123,
        "id": "g3zxri2",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g3zxri2/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599262923.0
    },
    {
        "author": "Yoinkie2013",
        "body": "If we’re going to be red tomorrow, can we be a normal red? Like down .2% indeces and stocks doing their own thing? Like for fuck sakes, I’m diversified, got leaps, mostly debit spreads, doing theta gang and selling weeklies... and I still got fucked for 50% this crash. I just need a break, market.  The market is like my favorite hobby, I’m not ready to give it up yet. Costco-fedex-Apple-baba-zs-crm-pton-chewy-delta green tomorrow, or atleast a couple of them.",
        "created_utc": 1599619264,
        "id": "g4iclub",
        "permalink": "/r/wallstreetbets/comments/ip118i/what_are_your_moves_tomorrow_september_09_2020/g4iclub/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599648064.0
    },
    {
        "author": "gryffindorite",
        "body": "Just started investing in the US stock market(I'm from India). Here's my current portfolio:\n\n* AAPL, AMZN : **16%**\n* MSFT, FB, GOOGL, TSLA, CRM, NFLX: 8%\n* NVDIA, MA, SHOPIFY, ICLN: 4.5%\n\nPlans to invest around 500 USD per month going forward. What should my next moves be? Holding until Nov? And I was thinking of buying MCD, DIS, WMT,  BRKB.",
        "created_utc": 1600172778,
        "id": "g5ck7tw",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g5ck7tw/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600201578.0
    },
    {
        "author": "bassistmuzikman",
        "body": "I mean, the alternative depends on what your project is, but there are a number of companies that offer the same services (Informatica, ZS, Salesforce in some cases, etc. etc.). The issues I saw had nothing to do with which industry we were in (pharma), but were more that they didn't really have... any product. They just came in and said \"what problems can we solve?\" and tried to just create work out of thin air. They had a technology platform for intaking large data sets and making sense of them, but it was being built and rebuilt by developers developing in a PRODUCTION environment (there was no test environment?!?). Because of this, any of the (sub-par) work they did for us would constantly break. \n\nThe suit/tie thing speaks to them not understanding or really caring about the culture of their clients. I'm sorry, but read the room. You don't wear a trucker cap to a meeting full of pharmaceutical execs. \n\nThe other clients of theirs I spoke to were in different industries and experienced very similar issues.   I know it's an N of one, but it definitely felt like more than just issues related to the specific group we were working with.",
        "created_utc": 1601495664,
        "id": "g77m7md",
        "permalink": "/r/investing/comments/j2o8kw/palantir_discussion_thread/g77m7md/",
        "score": 5,
        "subreddit": "investing",
        "created": 1601524464.0
    },
    {
        "author": "HEAT631",
        "body": "RKT and CRWD let’s goooo make me forget about missing out on ZM and CRM",
        "created_utc": 1599034300,
        "id": "g3p1wtf",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3p1wtf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599063100.0
    },
    {
        "author": "I_love_boobs86",
        "body": "Flashbacks of BBY, PRPL, BC.  Even the ones I sold before close today like CRWD tanked.  Meanwhile garbage like ups, crm, dis, zm go up 45%",
        "created_utc": 1599086821,
        "id": "g3s3ip0",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3s3ip0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599115621.0
    },
    {
        "author": "YOUR_MOMS_BF_TODD",
        "body": "As someone said before, Snowflake IPO is next week on Wednesday. Shares start at $75-$85. Buffet and Salesforce have already invested $250 million each. This is going to be BIG. Ride the wave up and get out before the shorts hit.",
        "created_utc": 1599774387,
        "id": "g4ra1aw",
        "permalink": "/r/wallstreetbets/comments/iqb5ey/what_are_your_moves_tomorrow_september_11_2020/g4ra1aw/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599803187.0
    },
    {
        "author": "manwhoreproblems",
        "body": "Zoom, crm, apple, and Tesla. Contrary to popular belief market cap matters.",
        "created_utc": 1599180226,
        "id": "g3xi4uf",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xi4uf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599209026.0
    },
    {
        "author": "infinitelimits00",
        "body": "The main thing is a lot of index/benchmark funds have to buy. Hence the up move on ETSY AH. See the same thing when CRM was added to DOW.",
        "created_utc": 1599273219,
        "id": "g42p58u",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g42p58u/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599302019.0
    },
    {
        "author": "solidmussel",
        "body": "Amzn tracks retail sales as revenue so its p/s being lower makes sense to me.  WMT for example has a P/S of less than 1, and that's because retail is low margin.\n\nSHOP is more a subscription service so I do believe it also needs to be compared to stocks like Adobe, the portion of Amazon's valuation that is attributed to cloud (which is valued around 15 P/S) or salesforce.",
        "created_utc": 1600464485,
        "id": "g5qul6d",
        "permalink": "/r/investing/comments/ivafuc/to_sell_or_not_to_sell_shop/g5qul6d/",
        "score": 5,
        "subreddit": "investing",
        "created": 1600493285.0
    },
    {
        "author": "Furankuri",
        "body": "Forget about snowflake for today. Get some CRM calls instead",
        "created_utc": 1600273286,
        "id": "g5hfu5z",
        "permalink": "/r/wallstreetbets/comments/itspun/daily_discussion_thread_for_september_16_2020/g5hfu5z/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600302086.0
    },
    {
        "author": "technocrat_landlord",
        "body": "Buying Palantir at open tomorrow.\n\nBullish on (in approximate order)\n\nNvidia\n\nDisney\n\nMSFT\n\nFB\n\nAmazon\n\nGoogle\n\nAdobe\n\nCRM\n\nDG - Dollar General\n\nCCI/AMT\n\nLMT",
        "created_utc": 1601445997,
        "id": "g75cmt5",
        "permalink": "/r/stocks/comments/j2gc7k/palantir_and_asanas_ipo_tomorrow_who_is_buying/g75cmt5/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1601474797.0
    },
    {
        "author": "Fizzy_T",
        "body": "I didn't even make it through community College and now make 100k as a remote Salesforce admin 🤷‍♂️ definitely can do it but realize a ton of companies will always write you off. First gig is the hardest to find.",
        "created_utc": 1600413166,
        "id": "g5oj7jr",
        "permalink": "/r/wallstreetbets/comments/iur9s9/what_are_your_moves_tomorrow_september_18_2020/g5oj7jr/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600441966.0
    },
    {
        "author": "GadnukBreakerOfWrlds",
        "body": "Holy fuck MSFT. Wtf are you doing?  \n  \n- Teams killing Slack and WebEx (Cisco)  \n- O365 numero uno (GSuite isn't even close)  \n- OneDrive for Enterprise (that's why DBX and BOX are range bound)  \n- Azure is #2 in cloud and still chipping off AWS marketshare every quarter  \n- New generation console (a 1-in-7 years event) coming in November  \n- Dynamics CRM is #2 after Salesforce  \n- One of the healthiest balance sheets in tech  \n  \nAnd it still hugs that $200-$210. It doesn't need TikTok to skyrocket. Other bigcaps went up over much lesser.",
        "created_utc": 1599580855,
        "id": "g4ga0pr",
        "permalink": "/r/wallstreetbets/comments/ioqzpq/daily_discussion_thread_for_september_08_2020/g4ga0pr/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599609655.0
    },
    {
        "author": "somanychins",
        "body": "At some point it’s going to register that AAPL market cap swung down $135B intraday. That’s not like “oh shucks.” If there’s that kind of uncertainty in the value of one of the most well characterized and followed stonks on earth, what could happen to CRM? ADBE? PTON? Anything with a multiple over 30.... \n\nYou should be afraid",
        "created_utc": 1599112421,
        "id": "g3tcw7u",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3tcw7u/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599141221.0
    },
    {
        "author": "SwaggetyAndy",
        "body": "Goddammit now I've gotten fucked twice by earnings that I thought were gonna shoot up after the call. That CRM craziness last week got me greedy. I'm NEVER holding through earnings again, regardless of how well I think the company will do.",
        "created_utc": 1599080389,
        "id": "g3rpe2q",
        "permalink": "/r/wallstreetbets/comments/il4fpm/earnings_thread_for_wednesday_92/g3rpe2q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599109189.0
    },
    {
        "author": "FiaRua_",
        "body": "one of my best days today:\n\nAVGO 400c 9/18 1.75-8.0 (bought yesterday at open)\n\nTesla 415p 9/4 4.3-14.2 (bought today before during the dump)\n\nSPY 354c 9/2 .7-4.3 (bought mid-day sold a little before close)\n\nMSFT 9/11 230c scalped a few times for decent gains. \n\nstill holding CRM 285c 9/11, TWTR 50c 10/16, INTC (lol) 52.5c 9/11",
        "created_utc": 1599087234,
        "id": "g3s4f5x",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3s4f5x/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599116034.0
    },
    {
        "author": "iReddit_Noob",
        "body": "if you just did CRM/ZM/RH ez",
        "created_utc": 1600661325,
        "id": "g62ex8q",
        "permalink": "/r/wallstreetbets/comments/iwsvqq/me_after_a_few_months_on_wsb/g62ex8q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600690125.0
    },
    {
        "author": "throwAwayMyCsDegree",
        "body": "CRM not bullshit lmao",
        "created_utc": 1599077870,
        "id": "g3rik5k",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3rik5k/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599106670.0
    },
    {
        "author": "going_there",
        "body": "should have taken more profits before the Big Bi-curious Fake Bear Crash of Labor Day 2020, but now that this period of confusion is rounding out (there will be more shakeouts next week I bet) \n\n&amp;#x200B;\n\nI'M JUMPING IN WITH BOTH DICKS&gt; calls strapped to the TITS GLHF dollars wont be worth shit in 10yrs anyways and ill probably die of CAD before then\n\n&amp;#x200B;\n\nCRM 18 DEC 20 300C\n\nMSFT 20 NOV 20 230C\n\nFB 20 NOV 20 305C\n\nWMT 18 DEC 20 155C\n\nDIS 16 OCT 20 150C\n\nAMD 15 JAN 21 95C\n\nSLV 17 JUN 22 54C",
        "created_utc": 1599837836,
        "id": "g4ty6qr",
        "permalink": "/r/wallstreetbets/comments/iqnsjz/daily_discussion_thread_for_september_11_2020/g4ty6qr/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599866636.0
    },
    {
        "author": "majorchamp",
        "body": "I work in the IT field.  Our office is small, about 13 people. Since March, the most that has been in the office at a time is 5 people (yesterday).  It's not mandatory, we all can VPN in and do our remote meetings every morning.  Our office space is up for sale anyways because we weren't expanding at the rate we were hoping for (pre covid) and were going to move into a smaller space regardless in 2021.  \n\nhowever, larger companies like Facebook, Salesforce, Google, Apple, etc.. are also almost 100% remote and will be for the rest of 2020 and likely through part of 2021.  So for a chunk of the country and/or world that don't require people in person to do their job (like yourself in the medical field), it has changed things and millions of workers.  That isn't to say when life returns to \"normal\" and covid is gone we won't start doing what we used to do, but by that point, companies like listed above from a financial savings perspective may no longer feel the need to keep a requirement of coming into the office and/or even having a physical office space you need to be at everyday.  Shit is expensive.  \n\nI work in the food distribution industry.  Schools have been affected, restaurant sales have been affected. We are back to 2017 sales figures, when 2020 was on track to be a record profit for us.  So while life for you hasn't changed at all, it HAS changed for a lot of people in those industries.",
        "created_utc": 1600438287,
        "id": "g5pbwac",
        "permalink": "/r/stocks/comments/iv2pac/getting_back_to_normal_reality_check/g5pbwac/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1600467087.0
    },
    {
        "author": "BigRed323",
        "body": "Up 300% on the year with CRM, TSLA, and MSFT calls. Think it’ll be choppy the rest of the year tho. Need to put some aside for the tax man.",
        "created_utc": 1599777236,
        "id": "g4ri426",
        "permalink": "/r/wallstreetbets/comments/iqb5ey/what_are_your_moves_tomorrow_september_11_2020/g4ri426/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599806036.0
    },
    {
        "author": "meeni131",
        "body": "Ah yes, own 0.1% of CRM to potentially make its price go up 1% if Snowflake goes up 10x. Almost as brilliant as getting in on Berkshire to own Snowflake",
        "created_utc": 1599782920,
        "id": "g4rtbor",
        "permalink": "/r/stocks/comments/iq5a8v/upcoming_ipos_date_and_expected_market_cap/g4rtbor/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1599811720.0
    },
    {
        "author": "SourceCodeSeller",
        "body": "too many people here are in fdx earnings. i remember zm, and crm. almost no one was talkng about it day before.\n\nand for that reason im out",
        "created_utc": 1600195874,
        "id": "g5dy64z",
        "permalink": "/r/wallstreetbets/comments/it5xpg/daily_discussion_thread_for_september_15_2020/g5dy64z/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600224674.0
    },
    {
        "author": "Master_Relative",
        "body": "ZM and CRM were good places to start last month",
        "created_utc": 1601348277,
        "id": "g70v9xn",
        "permalink": "/r/wallstreetbets/comments/j1jqk5/what_are_your_moves_tomorrow_september_29_2020/g70v9xn/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601377077.0
    },
    {
        "author": "TappyDev",
        "body": "Exactly. I already hit on crm and aapl.  No complaints.  Never be afraid to take profits!",
        "created_utc": 1599012351,
        "id": "g3o79f2",
        "permalink": "/r/wallstreetbets/comments/ikxlec/why_is_nobody_talking_about_pagerduty/g3o79f2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599041151.0
    },
    {
        "author": "hashtagzee",
        "body": "I’m sure this happened, some way OTM CRM calls returned 133x the next day after earnings. Same with ZM (80-90x returns). \n\nPotentially 16k -&gt; 1.7m in one month, lol",
        "created_utc": 1599015963,
        "id": "g3odoan",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3odoan/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599044763.0
    },
    {
        "author": "toomuchtodotoday",
        "body": "&gt; Just a gut feeling but I think there going to be a decent amount of white collar layoffs coming. \n\nOh yeah.\n\n[Ford: 1400 jobs](https://www.nytimes.com/reuters/2020/09/02/business/02reuters-fordmotor-layoffs.html)\n\n[Salesforce: 1000 jobs](https://finance.yahoo.com/news/salesforce-streamlines-business-1-000-123323820.html)\n\n[LinkedIn: 1000 jobs](https://www.washingtonpost.com/business/2020/07/22/linkedin-microsoft-msft-job-cuts/)\n\n[Coca-Cola: 4000 jobs](https://www.masslive.com/news/2020/08/coca-cola-to-offer-buyouts-to-4000-workers-in-the-us-and-canada.html)",
        "created_utc": 1599060901,
        "id": "g3qa23l",
        "permalink": "/r/investing/comments/il6dao/private_payrolls_rose_by_428000_in_august_coming/g3qa23l/",
        "score": 4,
        "subreddit": "investing",
        "created": 1599089701.0
    },
    {
        "author": "Mahler911",
        "body": "Except when it isn't (ZM, CRM, TGT)",
        "created_utc": 1599683887,
        "id": "g4l0kj4",
        "permalink": "/r/wallstreetbets/comments/ipnztr/what_are_your_moves_tomorrow_september_10_2020/g4l0kj4/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599712687.0
    },
    {
        "author": "winkahpack",
        "body": "[Buffett + Salesforce in Snowflake IPO](https://www.cnbc.com/2020/09/08/berkshire-hathaway-salesforce-agree-to-buy-into-snowflake-ipo-.html)\n\nSnowflake will be a monster",
        "created_utc": 1599597239,
        "id": "g4h6pb9",
        "permalink": "/r/wallstreetbets/comments/ip118i/what_are_your_moves_tomorrow_september_09_2020/g4h6pb9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599626039.0
    },
    {
        "author": "thegoldstandard55",
        "body": "Ultimately Tim Apple 🍎 started this chain reaction of toxic greed that led to Elon following with a split of his own then Salesforce getting added to the Dow and finally that bizarre reaction to Zoom which caused the final fomo chase.  The market was somewhat healthy until that stupid Apple split rally.",
        "created_utc": 1599177673,
        "id": "g3xcwfj",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xcwfj/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599206473.0
    },
    {
        "author": "zanif",
        "body": "Keep an eye on CRM tomorrow. SNOW will pump it.",
        "created_utc": 1600208227,
        "id": "g5ernv2",
        "permalink": "/r/wallstreetbets/comments/itgja2/what_are_your_moves_tomorrow_september_16_2020/g5ernv2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600237027.0
    },
    {
        "author": "infinitelimits00",
        "body": "ADBE with an underrated earnings report next week. They are in that second tier with names like CRM but they can help tech like CRM’s earnings did.",
        "created_utc": 1599888057,
        "id": "g4wk2sr",
        "permalink": "/r/wallstreetbets/comments/iqy7be/weekend_discussion_thread_for_the_weekend_of/g4wk2sr/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599916857.0
    },
    {
        "author": "Turdboimaloy",
        "body": "&gt;was all puts and call credit spreads expecting an offering on Monday after the close... then offering hit Tuesday morning, super pumped, went down 5% and I flipped long at 475 before the close... well that didn't go so well.  I am currently long going into tomorrow.  I think we will have a rebound.  It seemed VERY strange to me that every damn ticker was green today except tesla, apple, zoom, and salesforce.... that's some hard rotation and seems fishy to me.\n\nhard rotation fishy? yea, weird that dudes would want to take prophet on Tesla after it runs from 1400 to 2500",
        "created_utc": 1599090324,
        "id": "g3sbebx",
        "permalink": "/r/wallstreetbets/comments/ilgn7s/im_out/g3sbebx/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599119124.0
    },
    {
        "author": "hoobaacheche",
        "body": "DD: Inorder to pump DOW Jones, CRM needs to be pumped! Trade accordingly",
        "created_utc": 1599015834,
        "id": "g3odg9k",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3odg9k/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599044634.0
    },
    {
        "author": "HGTV-Addict",
        "body": "Honestly in this market who the fucks knows. CRM and Zoom were both up massively before earnings, still exploded. I'd take hitting $400 before earnings and then a 10% pop and be happy. \n\nIt only has to move 6% from today for a $400 strike to be profitable over earnings. That does not seem like a lot to me.",
        "created_utc": 1598980377,
        "id": "g3m2mcd",
        "permalink": "/r/wallstreetbets/comments/ikmf49/dd_lululemon_earnings_in_7_days_45k_in_call/g3m2mcd/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599009177.0
    },
    {
        "author": "jonny2shoez",
        "body": "CRM, DOCU, ADBE, WORK, CRWD, CHWY, WDAY, SQ, TSLA, RKT\n\nLet’s fucking gooooo",
        "created_utc": 1598982323,
        "id": "g3m7zzp",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3m7zzp/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599011123.0
    },
    {
        "author": "RayCashIsTrashDalio",
        "body": "ZM pulling a CRM. 10 baggers incoming. 5-6 baggers for ITM options",
        "created_utc": 1598949244,
        "id": "g3kfby9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kfby9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598978044.0
    },
    {
        "author": "I_had_corn",
        "body": "Jumped into the CRM spike, collected $3.7k in just 15 minutes",
        "created_utc": 1599018079,
        "id": "g3oh6xu",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oh6xu/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599046879.0
    },
    {
        "author": "touchhimwiththejab",
        "body": "crm 260c fd \n\nBags will be had",
        "created_utc": 1601495288,
        "id": "g77l4y1",
        "permalink": "/r/wallstreetbets/comments/j2jg0e/daily_discussion_thread_for_september_30_2020/g77l4y1/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601524088.0
    },
    {
        "author": "ultraplay37",
        "body": "cramer about to pump CRM to the fucking moon.\n\nthey are working with the government to determine logistics/software for vaccine distribution\n\ngonna be ginormous",
        "created_utc": 1601504080,
        "id": "g785ih0",
        "permalink": "/r/wallstreetbets/comments/j2tmk7/what_are_your_moves_tomorrow_october_01_2020/g785ih0/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601532880.0
    },
    {
        "author": "GoSoftApple",
        "body": "CRM, MSFT, TSM, DIS, WMT\n \nLong term bets: RKT, NET",
        "created_utc": 1599765813,
        "id": "g4qd3ls",
        "permalink": "/r/StockMarket/comments/iq5ueh/what_stocks_are_you_looking_at_for_next_week/g4qd3ls/",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1599794613.0
    },
    {
        "author": "zanif",
        "body": "BUY CRM. They have a $250M stake on SNOW!!",
        "created_utc": 1600270323,
        "id": "g5h9s8x",
        "permalink": "/r/wallstreetbets/comments/itspun/daily_discussion_thread_for_september_16_2020/g5h9s8x/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600299123.0
    },
    {
        "author": "NecessaryPear",
        "body": "TD says it’s because zoom and salesforce are up.\n\nI’ll take it!",
        "created_utc": 1598982063,
        "id": "g3m7abd",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3m7abd/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599010863.0
    },
    {
        "author": "Myusernamegoesup",
        "body": "CRM hates 280",
        "created_utc": 1598985194,
        "id": "g3mfx7x",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3mfx7x/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599013994.0
    },
    {
        "author": "bigboi_hoipolloi",
        "body": "tell that to my boss who pays for two ZM accounts, doesn't know what teams, and requests project managers to PROJECT MANAGE THROUGH SALESFORCE while withholding admin permissions to integrate Office 365 into Salesforce.\n\nFuck that.\n\nHe also spent $1k on a chromecast that wasn't a chromecast and requires 3rd party installations and hardware for the TV and user (if someone else wants to share their screen on a big monitor they will have to plug in the USB widget and wait for something to install)",
        "created_utc": 1598991587,
        "id": "g3mxc3d",
        "permalink": "/r/wallstreetbets/comments/ikkcr4/zoom_gains_porn_330call_exp_94/g3mxc3d/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599020387.0
    },
    {
        "author": "void-wanderer",
        "body": "Not for me:\n\n&gt; SoftBank’s Bet on Tech Giants Fueled Powerful Market Rally\n&gt; \n&gt; Japanese conglomerate led by billionaire Masayoshi Son placed billions in options bets on fast-rising tech stocks\n&gt; \n&gt; Investors watching the vertigo-inducing rise—and this week’s fall—of technology stocks are buzzing about a single trade, a giant but shadowy bet on Silicon Valley big enough to pull the market up with it.\n&gt; \n&gt; The investor behind that trade, according to people familiar with the matter, is Japan’s SoftBank 9984 -3.21% Group Corp., which bought options tied to around $50 billion worth of individual tech stocks. Investors and analysts, aware of the activity but in the dark as to who is behind it, say it has turbocharged the tech sector, whose sheer size drives broader market moves.\n&gt; \n&gt; A SoftBank spokesperson declined to comment.\n&gt; \n&gt; NEWSLETTER SIGN-UP\n&gt; Markets\n&gt; A pre-markets primer packed with news, trends and ideas. Plus, up-to-the-minute market data.\n&gt; \n&gt; PREVIEW\n&gt; SUBSCRIBE\n&gt; The stock market rebounded to record highs this year despite serious pain in the economy from the coronavirus pandemic. Tech stocks led the charge as work, school and entertainment shifted online, but entered a new phase in recent weeks.\n&gt; \n&gt; Before this week’s retreat, Apple Inc. had gained nearly $700 billion in market value since the end of July and Tesla Inc. shares more than doubled, making the electric car maker one of world’s 10 most valuable companies.\n&gt; \n&gt; Regulatory filings show SoftBank bought nearly $4 billion of shares in tech giants such as Amazon.com Inc., Microsoft Corp. and Netflix Inc. this spring, plus a stake in Tesla. Not included in those disclosures is the massive options trade, which is built to pay off if the stock market rises to a certain level and then lock in gains, the people said.\n&gt; \n&gt; SoftBank bought a roughly equal amount of call options tied to the underlying shares it bought, as well as on other names, according to people familiar with the matter. It also sold call options at far higher prices. This allows SoftBank to profit from a near-term run-up in stocks and then reap those profits by unloading its position to willing counterparties.\n&gt; \n&gt; Investors pay a small premium to buy options, giving them exposure to a much larger notional amount of shares. In SoftBank’s case, the roughly $4 billion in options generated an exposure of around $50 billion, according to the people familiar with the matter.\n&gt; \n&gt; A handful of massive tech stocks—Apple, Microsoft, Amazon, Facebook, and Google-owner Alphabet—make up about a quarter of the S&amp;P 500 index. They take the broader stock market with them when they rise or fall. Their dramatic rally in recent weeks has pushed the stock market to new highs, but raised concerns of a dangerous unwind that could drag the market down with them.\n&gt; \n&gt; The possibility of such an unwind came into focus Friday, as the tech-heavy Nasdaq fell sharply for the second day, dropping 1.3% and capping off its worst week since March.\n&gt; \n&gt; Traders say the market dynamics could be partially explained by investments like SoftBank’s. Options activity has been so robust that traders have said it has helped intensify the rally in tech stocks and unleashed unusual dynamics across markets. SoftBank’s options positions were reported earlier by the Financial Times.\n&gt; \n&gt; Options strategies were at play in gains in stocks like Salesforce.com Inc., which jumped 26% in one day after its earnings, traders said. Options are contracts that allow investors to buy or sell shares at a specific price, later in time. Call options confer the right to buy, while puts give the right to sell. Traders can tap these derivatives contracts to make directional bets on stocks or hedge their portfolios.\n&gt; \n&gt; Investors buy options contracts tied to individual stocks or to broad indexes such as the S&amp;P 500 or the Nasdaq Composite. When banks and brokerages arrange options for investors, they are left with their own exposure to the markets.\n&gt; \n&gt; To zero that exposure out, options dealers buy derivatives and stocks. In the case of call options, this can give stocks and indexes another boost higher. As shares jump, they need to hedge more, adding fuel to the fire. Such hedging activity can also intensify moves when markets head lower.\n&gt; \n&gt; MORE ON SOFTBANK\n&gt; SoftBank to Sell $14 Billion Stake in Telecom Unit\n&gt; SoftBank Returns to Black with $12 Billion Profit\n&gt; SoftBank to Sell $41 Billion in Assets, Plans Share Buyback\n&gt; According to traders, there have been mammoth options trades that include buying call options on stocks like Amazon.com Inc., Adobe Inc., Netflix Inc., Facebook Inc. Microsoft Corp, generating chatter across Wall Street.\n&gt; \n&gt; Some of that options activity has come from individual investors, who have been lured by free trades on sites such as Robinhood Markets Inc. SoftBank’s role indicates large institutions are also playing a role in the frenzy of tech options trading.\n&gt; \n&gt; “It’s exacerbating moves,” said Danny Kirsch, head of options at brokerage Cornerstone Macro, of the surge in tech options activity. “That’s why these moves are getting very stretched both ways.”\n&gt; \n&gt; SoftBank is best known for its $100 billion Vision Fund, which invests in startups including Uber Technologies Inc. and TikTok owner Bytedance. But in July its founder and CEO, Masayoshi Son, announced a new unit to invest in public markets, similar to a hedge fund in its scope and tactics.\n&gt; \n&gt; Part of that unit includes a $555 million, 12-year fund, one-third of which is Mr. Son’s personal money. It adds another tentacle to SoftBank’s globe-trotting, asset-spanning investment ambitions. Mr. Son, often given to bouts of whimsy, hid a clue in the name: 555 in Japanese is pronounced “go, go, go.”\n&gt; \n&gt; SoftBank only recently emerged from a serious rough patch. The company’s bet on office landlord WeWork soured, requiring SoftBank to bail it out. Concentrated investments in ride hailing startups were hammered when the pandemic shut down travel. It reported a $9 billion loss in the fiscal year ended March, its worst year ever.\n&gt; \n&gt; SoftBank’s $100 Billion Bet\n&gt; YOU MAY ALSO LIKE\n&gt; \n&gt; UP NEXT\n&gt; \n&gt; SoftBank’s $100 Billion Bet\n&gt; SoftBank’s $100 Billion Bet\n&gt; SoftBank’s longtime strategy of dumping mountains of cash on promising young companies to create big winners failed dramatically at WeWork and is inviting scrutiny into the fund’s other investments. Here’s a look at Vision Fund’s structure, and how its fast paced investment strategy could make it risky.\n&gt; Softbank’s shares plummeted in March and the company announced a major shift in strategy. It would unload more than $40 billion in legacy assets. That number is now more than $50 billion and will include the sale of its stakes in T-Mobile US Inc., Chinese e-commerce giant Alibaba Group and SoftBank’s Japanese telecom unit.\n&gt; \n&gt; Much of that cash was originally earmarked for share buybacks and debt redemption. But SoftBank paused the buyback plan it announced in March after its shares rocketed higher. Mr. Son said SoftBank is in no hurry to repurchase more of its roughly $47 billion in bonds, since the company has enough cash to cover redemptions for the next two years, and bondholders don’t particularly want to sell.\n&gt; \n&gt; It is a departure for Mr. Son, who is known for long-term bets on young tech firms, including his $20 million bet on Alibaba in 2000. The fund will instead invest primarily in highly liquid, publicly traded companies, making extensive use of derivatives and leverage to boost returns.\n&gt; \n&gt; Some SoftBank shareholders are uneasy about the new stock trading unit. They invest in tech stocks themselves, and are perplexed that SoftBank is now aiming to do the same thing, according to SoftBank investors. Mr. Son, who has a one-third stake in the stock-trading fund, promised to make up a portion of shortfalls in the fund if it lost money at the end of its 12-to-14 year life, according to the company.\n&gt; \n&gt; When questioned about the stake at a virtual investors’ meeting last month, Mr. Son said he wanted to take risk and get upside, according to two people familiar with the gathering. “I’m not a bonus and salary guy,” he told the listeners, one of those people said.\n&gt; \n&gt; Write to Summer Said at summer.said@wsj.com, Liz Hoffman at liz.hoffman@wsj.com, Gunjan Banerji at Gunjan.Banerji@wsj.com and Phred Dvorak at phred.dvorak@wsj.com",
        "created_utc": 1599287544,
        "id": "g43a8vu",
        "permalink": "/r/wallstreetbets/comments/imtg5u/how_to_be_a_nasdaq_whale/g43a8vu/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599316344.0
    },
    {
        "author": "YOUR_MOMS_BF_TODD",
        "body": "Realized $800 in gains from CRM puts. We won't talk about unrealized gains...",
        "created_utc": 1599165287,
        "id": "g3wdzyo",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3wdzyo/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599194087.0
    },
    {
        "author": "longlive121",
        "body": "CRM finna rip",
        "created_utc": 1600273235,
        "id": "g5hfqcq",
        "permalink": "/r/wallstreetbets/comments/itspun/daily_discussion_thread_for_september_16_2020/g5hfqcq/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600302035.0
    },
    {
        "author": "FreeSpiritRunning",
        "body": "SNOW projected IPO market cap in Feb as valued by CRM - $12.4B\n\nSNOW actual IPO market cap in Sept when retail had access - $80B\n\n🤡🤡🤡🤡🤡🤡🤡",
        "created_utc": 1600274786,
        "id": "g5hiy82",
        "permalink": "/r/wallstreetbets/comments/itspun/daily_discussion_thread_for_september_16_2020/g5hiy82/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1600303586.0
    },
    {
        "author": "Cicero1982",
        "body": "I’m happier than a tornado in a trailer park! I picked out some value growth stocks last night, assessed the value I wanted to enter, and set my alerts. About an hour after market opened my alerts all blew up. I bought in on many, averaged down on a few, and ended today green. I have $12,000 allocated to averaging down on current positions if necessary and nearly 1/3rd of my portfolio available for new positions. Today was awesome! I now own SUM, CTXS, NET, IMOS, SIMO, &amp; IVC. Even took a small position of DFFN for a short squeeze and very small position in BKYI because ... well ... freaking because!",
        "created_utc": 1599166910,
        "id": "g3wisg8",
        "permalink": "/r/pennystocks/comments/ilz2gw/the_market_is_extremely_red_bubble_might_be/g3wisg8/",
        "score": 11,
        "subreddit": "pennystocks",
        "created": 1599195710.0
    },
    {
        "author": "Cicero1982",
        "body": "Same here. I bought and averaged down SUM, INTC, SIMO, CTXS, IVC, IMOS, NET, and got a 5% squeeze out of DFFN and BKYI. Green Day for me due to averaging down. This is why number 9 [HERE](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/) is such a very strong and successful strategy, even amid temporary pullbacks. I can’t recommend it enough. It’s like getting penny stock-ish gains without the stress of pennies.",
        "created_utc": 1599266389,
        "id": "g42duaa",
        "permalink": "/r/pennystocks/comments/imr3f6/for_you_new_guys_this_is_what_happened_today/g42duaa/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1599295189.0
    },
    {
        "author": "bshaman1993",
        "body": "Guys take a look at CTXS",
        "created_utc": 1599068740,
        "id": "g3qu75i",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qu75i/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599097540.0
    },
    {
        "author": "SoloTheFord",
        "body": "On another note I think you have some solid picks; added some of those to my watchlists, Citrix is an interesting one. I was checking it out earlier last month. \n\nI took some AMD and NVDA stock a while back no regrets. I like the idea of investing on the innovators and future tech for my mains. TSLA comes to mind but its really hyped, i think it is overvalued right now even though I like what the company is doing. Opted for some AAPL instead.",
        "created_utc": 1599275777,
        "id": "g42t9sd",
        "permalink": "/r/pennystocks/comments/imr3f6/for_you_new_guys_this_is_what_happened_today/g42t9sd/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1599304577.0
    },
    {
        "author": "Loud_Head8311",
        "body": "* S&amp;P 500 Index Funds - 26.95%\n* AMZN- 15.64%\n* AAPL - 12.33%\n* GOOG - 8.29%\n* MSFT - 5.66%\n* Tech ETF (IGV) - 2.36%\n* Total Bond Market ETFs - 2.17%\n* BRK.B - 2%\n* Defense &amp; Aerospace ETF - 1.99%\n* BABA - 1.62%\n* GSK- 1.08%\n* REIT ETF - 0.98%\n* SHOP - 0.96%\n* T - 0.86%\n* V - 0.81%\n* CI - 0.80%\n* JPM - 0.69%\n* KO - 0.65%\n* MA - 0.64%\n* NVDA - 0.64%\n* AXP - 0.60%\n* Developed Markets ETF (VEA) - 0.57%\n* TCEHY - 0.55%\n* ABBV - 0.48%\n* NET - 0.43%\n* JNJ - 0.41%\n* BAC - 0.40%\n* CTXS - 0.39%\n* UNH - 0.35%\n* LMT- 0.35%\n* ISRG - 0.34%\n* MDT - 0.26%\n* NFLX - 0.24%\n* BMY - 0.24%\n* SYK - 0.22%\n* JPM - 0.18%\n* CMCSA - 0.15%\n* ARKK - 0.13%\n* RTX - 0.12%\n* COP - 0.08%\n* VIAC - 0.08%\n* SQ - 0.07%\n* AKAM - 0.05%\n* PYPL - 0.05%\n* FSLY - 0.04%\n\nI realize this is a huge number of positions, and percentage-wise there are a ton of holdings below 1% of the overall portfolio.  The total amount invested in the market is $451k.  Have another $45k in cash/cash equivalents for a possible downpayment in early 2021.  Personally manage 1/3rd of portfolio via Chase YouInvest (short/medium term), the rest is in Fidelity / professionally managed (long-term)\n\nLooking for ideas for further exposure to non-USD equities, so far i've identified SAP and ACN as near-term additions.",
        "created_utc": 1599077156,
        "id": "g3rgkhd",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g3rgkhd/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599105956.0
    },
    {
        "author": "Pijoto",
        "body": "Zoom has a shit load of competitors in Microsoft, Facebook, Google, Citrix, etc, I see this huge bounce as a short term trend driven by overwhelming demand from WFH due to Covid, they could crash hard once Covid subsides.......",
        "created_utc": 1598964022,
        "id": "g3kwdre",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kwdre/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598992822.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  8th of September\n\n\n\n## Upcoming events for Tuesday, September  8th\n\n - Stock splits:\n\n    - BIOC @ **1:10**\n    - PRGCF @ **1:10**\n\n - Expected earnings:\n\n  ABM, ANAT, ASFI, AZRX, BWL.A, CASY, CIG, COE, COUP, CVGW, CVV, DRD, GEC, HMY, HQY, IDXG, KBSF, KEQU, KTRA, LULU, METX, MFAC, NSSC, PHR, PPIH, SCPE, SEAC, TC, TEUM, UEC, UTSI, UXIN, WKEY, WORK\n\n - Ex-div:\n\n  AEE, AVT, BBDC, BDX, CNI, HPE, HPQ, INSW, JKHY, LANC, LHX, OBCI, PEG, RCI, STNG, TFSL\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.115%)\n    - 3-Year Note Auction (previous: 0.179%)\n    - 52-Week Bill Auction (previous: 0.140%)\n    - 6-Month Bill Auction (previous: 0.105%)\n    - CB Employment Trends Index (previous: 50.89)\n    - Consumer Credit (consensus: 13.50B, previous: 8.95B)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - NFIB Small Business Optimism (previous: 98.8)\n\n## Upcoming events for Wednesday, September  9th\n\n - Stock splits:\n\n    - ALEDY @ **16:5**\n\n - Expected earnings:\n\n  ACB, AEO, AKER, ALOT, AMRH, APWC, ATLC, AVAV, AXR, BBCP, BCOW, BIGC, BROG, CBLI, CEI, CTXR, CVU, DSGX, EPM, FMCI, GFN, GIII, GME, HDS, HMG, HOTH, HTHT, HUSA, KEP, KFFB, LAKE, LMFA, LMNR, LOVE, MCFT, MEIP, NAV, OBSV, PRCP, PSV, QTT, REVG, RH, SCWX, SGMA, SLQT, STRM, TDAC, VERX, VRNT, WORX, WUBA, YGYI, YTRA, ZNH, ZS\n\n - Ex-div:\n\n  AAT, ANTM, CASH, CME, DHF, FNV, GPN, HOG, KIM, LADR, MDU, MGM, MPW, NEM, NRIM, PPL, PPR, SJI, TRTN, TRV, TU, UBCP, UMBF, VCTR, VFC\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.660%)\n    - API Weekly Crude Oil Stock (previous: -6.360M)\n    - Cushing Crude Oil Inventories (previous: 0.110M)\n    - EIA Short-Term Energy Outlook\n    - JOLTs Job Openings (consensus: 6.000M, previous: 5.889M)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -2.0%)\n    - MBA Purchase Index (previous: 309.6)\n    - Mortgage Market Index (previous: 755.1)\n    - Mortgage Refinance Index (previous: 3,316.2)\n    - Redbook (previous: 4.6%)\n    - Redbook (previous: 5.8%)\n    - Seevol Cushing Storage Report (previous: -1.368M)\n    - Thomson Reuters IPSOS PCSI (previous: 47.05)\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FCEL, FFBW, FLR, FLUX, GRNQ, GTT, JG, LPTH, LTRX, ORCL, PBIO, PCYG, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, UEPS, VEDL, VITL, VNCE, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 12,900K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.887M, previous: -9.362M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -1.357M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -5.2%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -3.036M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 846K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 34B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 4.9%, previous: 8.8%)\n\n## Upcoming events for Friday, September 11th\n\n - Expected earnings:\n\n  ATNM, CNNB, EVI, FONR, FSEA, GMHI, GROW, GVA, IBIO, JVA, KR, LFAC, MARPS, NFIN, NNVC, UTZ, VALU, VIRC\n\n - Ex-div:\n\n  AME, CCBG, CCD, CGO, CHI, CHW, CMCT, CPZ, CSQ, CWH, DVN, EDF, EDI, EOD, ESCA, FCNCA, GROW, JRVR, PTR, RRBI, SPR, UNH\n\n - Economic events and announcements:\n\n    - CPI (consensus: 0.3%, previous: 0.6%)\n    - CPI (consensus: 1.2%, previous: 1.0%)\n    - CPI Index, n.s.a. (consensus: 259.51, previous: 259.10)\n    - CPI Index, s.a (previous: 258.72)\n    - CPI, n.s.a (previous: 0.51%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.6%)\n    - Core CPI (consensus: 1.6%, previous: 1.6%)\n    - Core CPI Index (previous: 267.72)\n    - Federal Budget Balance (consensus: -240.0B, previous: -63.0B)\n    - Real Earnings (previous: -0.6%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 181)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - WASDE Report\n\n^^^^2020-09-08",
        "created_utc": 1599559215,
        "id": "g4femna",
        "permalink": "/r/RobinHood/comments/ioquxd/daily_discussion_thread_september_8th_2020/g4femna/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599588015.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  9th of September\n\n\n\n## Upcoming events for Wednesday, September  9th\n\n - Stock splits:\n\n    - ALEDY @ **16:5**\n\n - Expected earnings:\n\n  ACB, AEO, AKER, ALOT, AMRH, APWC, ATLC, AVAV, AXR, BBCP, BCOW, BIGC, BROG, CBLI, CEI, CTXR, CVU, DSGX, EPM, FMCI, GFN, GIII, GME, HDS, HMG, HOTH, HTHT, HUSA, KEP, KFFB, LAKE, LMFA, LMNR, LOVE, MCFT, MEIP, NAV, OBSV, PRCP, PSV, QTT, REVG, RH, SCWX, SGMA, SLQT, STRM, TDAC, VERX, VRNT, WORX, WUBA, YGYI, YTRA, ZNH, ZS\n\n - Ex-div:\n\n  AAT, ANTM, CASH, CME, DHF, FNV, GPN, HOG, KIM, LADR, MDU, MGM, MPW, NEM, NRIM, PPL, PPR, SJI, TRTN, TRV, TU, UBCP, UMBF, VCTR, VFC\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.660%)\n    - API Weekly Crude Oil Stock (previous: -6.360M)\n    - Cushing Crude Oil Inventories (previous: 0.110M)\n    - EIA Short-Term Energy Outlook\n    - JOLTs Job Openings (consensus: 6.000M, previous: 5.889M)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -2.0%)\n    - MBA Purchase Index (previous: 309.6)\n    - Mortgage Market Index (previous: 755.1)\n    - Mortgage Refinance Index (previous: 3,316.2)\n    - Redbook (previous: 4.6%)\n    - Redbook (previous: 5.8%)\n    - Seevol Cushing Storage Report (previous: -1.368M)\n    - Thomson Reuters IPSOS PCSI (previous: 47.05)\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, BNTC, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FCEL, FFBW, FIZZ, FLR, FLUX, GRNQ, GTT, JG, KZIA, LPTH, LTRX, ORCL, PBIO, PCYG, PDEX, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, SHLO, UBA, UBP, UEPS, VEDL, VITL, VNCE, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 12,925K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.075M, previous: -9.362M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -0.250M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.1%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -2.225M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 846K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 34B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 2.8%, previous: 8.8%)\n\n## Upcoming events for Friday, September 11th\n\n - Expected earnings:\n\n  ANIX, ATHE, ATNM, BRC, CNNB, EVI, FONR, FSEA, GMHI, GROW, GVA, IBIO, IMRN, IRCP, JVA, KR, LFAC, MARPS, MSB, NFIN, NNVC, PKX, UTZ, VALU, VIRC, YIN\n\n - Ex-div:\n\n  AME, CCBG, CCD, CGO, CHI, CHW, CMCT, CPZ, CSQ, CWH, DVN, EDF, EDI, EOD, ESCA, FCNCA, GROW, JRVR, NFJ, NIE, PTR, RRBI, SPR, UNH\n\n - Economic events and announcements:\n\n    - CPI (consensus: 0.3%, previous: 0.6%)\n    - CPI (consensus: 1.2%, previous: 1.0%)\n    - CPI Index, n.s.a. (consensus: 259.52, previous: 259.10)\n    - CPI Index, s.a (previous: 258.72)\n    - CPI, n.s.a (previous: 0.51%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.6%)\n    - Core CPI (consensus: 1.6%, previous: 1.6%)\n    - Core CPI Index (previous: 267.72)\n    - Federal Budget Balance (consensus: -245.0B, previous: -63.0B)\n    - Real Earnings (previous: -0.6%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 181)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - WASDE Report\n\n^^^^2020-09-09",
        "created_utc": 1599645613,
        "id": "g4j6rx2",
        "permalink": "/r/RobinHood/comments/ipd2f1/daily_discussion_thread_september_9th_2020/g4j6rx2/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599674413.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 10th of September\n\n\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n    - EXLLF @ **1:5**\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, BNTC, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FCEL, FFBW, FIZZ, FLR, FLUX, GRNQ, GTT, JG, KSPN, KZIA, LPTH, LTRX, ORCL, PBIO, PCYG, PDEX, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, SHLO, UEPS, VEDL, VITL, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 12,925K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.335M, previous: -9.362M)\n    - Cushing Crude Oil Inventories (consensus: 0.391M, previous: 0.110M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -0.557M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 1.2%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -2.384M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 846K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 68B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 2.8%, previous: 8.8%)\n\n## Upcoming events for Friday, September 11th\n\n - Expected earnings:\n\n  ANIX, ATHE, ATNM, BRC, CNNB, EVI, FONR, FSEA, GMHI, GROW, GVA, IBIO, IRCP, JVA, KR, LFAC, MARPS, MSB, NFIN, NNVC, PKX, UTZ, VALU, VIRC, YIN\n\n - Ex-div:\n\n  AME, CCBG, CCD, CGO, CHI, CHW, CMCT, CPZ, CSQ, CWH, DVN, EDF, EDI, EOD, ESCA, FCNCA, GROW, JRVR, NFJ, NIE, PTR, RRBI, SPR, UNH\n\n - Economic events and announcements:\n\n    - CPI (consensus: 0.3%, previous: 0.6%)\n    - CPI (consensus: 1.2%, previous: 1.0%)\n    - CPI Index, n.s.a. (consensus: 259.52, previous: 259.10)\n    - CPI Index, s.a (previous: 258.72)\n    - CPI, n.s.a (previous: 0.51%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.6%)\n    - Core CPI (consensus: 1.6%, previous: 1.6%)\n    - Core CPI Index (previous: 267.72)\n    - Federal Budget Balance (consensus: -245.0B, previous: -63.0B)\n    - Real Earnings (previous: -0.6%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 181)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - WASDE Report\n\n^^^^2020-09-10",
        "created_utc": 1599732013,
        "id": "g4ndtne",
        "permalink": "/r/RobinHood/comments/iq0er0/daily_discussion_thread_september_10th_2020/g4ndtne/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599760813.0
    },
    {
        "author": "machococks",
        "body": "CTXS don't snooze",
        "created_utc": 1600106889,
        "id": "g59e7ui",
        "permalink": "/r/wallstreetbets/comments/isi7v8/daily_discussion_thread_for_september_14_2020/g59e7ui/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600135689.0
    },
    {
        "author": "tbrucker",
        "body": "CTXS",
        "created_utc": 1599874679,
        "id": "g4vzotj",
        "permalink": "/r/wallstreetbets/comments/iqy7be/weekend_discussion_thread_for_the_weekend_of/g4vzotj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599903479.0
    },
    {
        "author": "Trueslyforaniceguy",
        "body": "Yes!  Citrix, DOCU, WORK, PD",
        "created_utc": 1598969616,
        "id": "g3l990c",
        "permalink": "/r/investing/comments/ikj4jy/daily_advice_thread_all_basic_help_or_advice/g3l990c/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598998416.0
    },
    {
        "author": "totsnotbiased",
        "body": "The first thing I would do is double your interest in every ETF/ actively managed funds you own outside the S&amp;P 500, and sell the small positions you have in low growth companies like J&amp;J, JPM, KO, CTXS. \n\nA good rule of thumb for you might be if you can’t see a world where the stock could double in the next 12-24 months, you shouldn’t hold less than .5% of your total portfolio in it.\n\nYou’re highly diversified, but that’s what ETF’s are for, and they are probably better at it than any of us",
        "created_utc": 1599097699,
        "id": "g3spqfo",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g3spqfo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599126499.0
    },
    {
        "author": "sina_t97",
        "body": "im on a macbook and last time i tried to get streetsmart working with Citrix it just didn't work no matter what i tried. and im pretty tech savvy. i guess i could try running a virtual box with windows, just seems like a lot of effort.",
        "created_utc": 1599681399,
        "id": "g4kv89b",
        "permalink": "/r/wallstreetbets/comments/ipd82q/daily_discussion_thread_for_september_09_2020/g4kv89b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599710199.0
    },
    {
        "author": "Cicero1982",
        "body": "SUM CTXS NET IMOS IVC INTC MOMO SIMO\n\nI only buy value growth stocks. All of these are trading at a discount. Should they go lower I don’t mind averaging down nor bagholding. However I would warn that penny stocks, unlike the stocks above, are much harder to value and is highly dependent on speculation.\n\nRecommend trading the above securities congruent with number 9 [HERE](https://www.reddit.com/r/pennystocks/comments/hcja2q/the_ultimate_quick_resource_for_the_amateur_trader/)",
        "created_utc": 1599421730,
        "id": "g49gch4",
        "permalink": "/r/pennystocks/comments/inoeu1/stocks_on_discount/g49gch4/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599450530.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  7th of September\n\n\n\n## Upcoming events for Monday, September  7th\n\n - Expected earnings:\n\n  CBAT, EBR, EBR.B, GRAF, HCAC, HJLI, HPK, JT, PLAG, QD, SAMA, SINA, THCA, THCB, WB\n\n - Economic events and announcements:\n\n    - Investing.com Gold Index (actual: 56.3%, previous: 54.7%)\n    - Investing.com S&amp;P 500 Index (actual: 34.5%, previous: 28.6%)\n    - United States - Labor Day\n\n## Upcoming events for Tuesday, September  8th\n\n - Stock splits:\n\n    - PRGCF @ **1:10**\n\n - Expected earnings:\n\n  ABM, ANAT, ASFI, AZRX, BWL.A, CASY, CIG, COE, COUP, CVGW, CVV, DRD, GEC, HMY, HQY, IDXG, KBSF, KEQU, KTRA, LULU, METX, MFAC, NSSC, PHR, PPIH, SCPE, SEAC, TC, TEUM, UEC, UTSI, UXIN, WORK\n\n - Ex-div:\n\n  AEE, AVT, BBDC, BDX, CNI, HPE, HPQ, INSW, JKHY, LANC, LHX, OBCI, PEG, RCI, STNG, TFSL\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.115%)\n    - 3-Year Note Auction (previous: 0.179%)\n    - 52-Week Bill Auction (previous: 0.140%)\n    - 6-Month Bill Auction (previous: 0.105%)\n    - CB Employment Trends Index (previous: 50.89)\n    - Consumer Credit (consensus: 13.75B, previous: 8.95B)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - NFIB Small Business Optimism (previous: 98.8)\n\n## Upcoming events for Wednesday, September  9th\n\n - Stock splits:\n\n    - ALEDY @ **16:5**\n\n - Expected earnings:\n\n  ACB, AEO, AKER, ALOT, AMRH, APWC, ATLC, AVAV, AXR, BBCP, BCOW, BIGC, BROG, CBLI, CEI, CTXR, CVU, DSGX, EPM, FMCI, GFN, GIII, GME, HDS, HMG, HOTH, HTHT, HUSA, KEP, KFFB, LAKE, LMFA, LMNR, LOVE, MCFT, MEIP, NAV, OBSV, ORCL, REVG, RH, SCWX, SGMA, SLQT, STRM, TDAC, VERX, VRNT, WORX, WUBA, YGYI, ZNH, ZS\n\n - Ex-div:\n\n  AAT, ANTM, CASH, CME, DHF, FNV, GPN, HOG, KIM, LADR, MDU, MGM, MPW, NEM, NRIM, PPL, PPR, SJI, TRTN, TRV, TU, UBCP, UMBF, VCTR, VFC\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 0.660%)\n    - API Weekly Crude Oil Stock (previous: -6.360M)\n    - Cushing Crude Oil Inventories (previous: 0.110M)\n    - EIA Short-Term Energy Outlook\n    - JOLTs Job Openings (consensus: 6.000M, previous: 5.889M)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -2.0%)\n    - MBA Purchase Index (previous: 309.6)\n    - Mortgage Market Index (previous: 755.1)\n    - Mortgage Refinance Index (previous: 3,316.2)\n    - Redbook (previous: 4.6%)\n    - Redbook (previous: 5.8%)\n    - Seevol Cushing Storage Report (previous: -1.368M)\n    - Thomson Reuters IPSOS PCSI (previous: 47.05)\n\n## Upcoming events for Thursday, September 10th\n\n - Stock splits:\n\n    - ALEDY @ **16:5** (Payable date: 09/09/2020)\n\n - Expected earnings:\n\n  AIM, AMRK, ANPC, BIOX, CHWY, CKX, CLUB, CPAH, DSWL, FARM, FFBW, FLR, FLUX, GRNQ, GTT, JG, LPTH, LTRX, PBIO, PCYG, PLAY, PTN, PTON, PZG, RFIL, RLGT, SCX, UEPS, VEDL, VITL, VNCE, VOLT, WVFC, ZUMZ\n\n - Ex-div:\n\n  ACV, ADP, AIO, AL, AMSF, BIG, BSIG, BTO, CAI, CAL, CBH, CRWS, CTXS, DCF, DKS, ECC, EFL, EHT, EIC, ENS, EVF, EXPO, FDUS, FFIC, FHN, FIS, FISI, FMNB, FRO, FUSB, G, GARS, GFI, GHY, HEQ, HPF, HPI, HPS, HRB, HTD, HTY, ICFI, IIIN, ISD, ITT, JHI, JHS, KFRC, KIO, LGI, MANT, NCV, NCZ, NDAQ, NRGX, NSP, NTRS, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, PTY, PYN, PZC, RVT, SAMG, SNDR, SPTN, SR, TCBK, THG, TXT, UBSI, UNTY, VGI, VSH, WMB, WSBC, ZTR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.406%)\n    - 4-Week Bill Auction (previous: 0.090%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 14,000K, previous: 13,254K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 0.3%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.655M)\n    - Crude Oil Inventories (consensus: -1.887M, previous: -9.362M)\n    - Distillate Fuel Production (previous: -0.343M)\n    - EIA Refinery Crude Runs  (previous: -0.844M)\n    - EIA Weekly Distillates Stocks (consensus: -1.357M, previous: -1.676M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -5.2%, previous: -5.3%)\n    - Gasoline Inventories (consensus: -3.036M, previous: -4.320M)\n    - Gasoline Production (previous: 0.016M)\n    - Heating Oil Stockpiles (previous: 0.280M)\n    - Initial Jobless Claims (consensus: 838K, previous: 881K)\n    - Jobless Claims 4-Week Avg. (previous: 991.75K)\n    - Natural Gas Storage (consensus: 34B, previous: 35B)\n    - PPI (consensus: -0.3%, previous: -0.4%)\n    - PPI (consensus: 0.2%, previous: 0.6%)\n    - Wholesale Inventories (consensus: -0.1%, previous: -1.4%)\n    - Wholesale Trade Sales (consensus: 4.9%, previous: 8.8%)\n\n^^^^2020-09-07",
        "created_utc": 1599472813,
        "id": "g4bg86y",
        "permalink": "/r/RobinHood/comments/io4rkt/daily_discussion_thread_september_7th_2020/g4bg86y/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1599501613.0
    },
    {
        "author": "Cicero1982",
        "body": "NET, CTXS, IVC, IMOS, SUM, SIMO. All value companies, all have great potential for growth, all hopefully will dip more today so I can pick up more shares and average down.",
        "created_utc": 1599221329,
        "id": "g3z1fzd",
        "permalink": "/r/pennystocks/comments/im801g/labor_day_sell_off/g3z1fzd/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599250129.0
    },
    {
        "author": "AnonymousAstro",
        "body": "I sold a naked 9/4 $410c at close as a part of a strangle because an “$85 move up in a day is impossible”. I sold it for $70 and ate a $2800 loss this morning.\n\n**One big lesson learned:** people will buy up everything and try to make it the new TSLA. ZM has EPS of $.92 and a current P/E ratio of $1700ish. It’s now worth more than IBM.\n\nAs long as “stonks go up”, I’ll stick to selling puts only.",
        "created_utc": 1598993396,
        "id": "g3n27ob",
        "permalink": "/r/options/comments/iknpp2/zm_5246_up/g3n27ob/",
        "score": 26,
        "subreddit": "options",
        "created": 1599022196.0
    },
    {
        "author": "teegolf1",
        "body": "Zoom is way overpriced as well. Here’s a quote from BARRON’S today.............  “Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It’s now worth $129.1 billion, more than International Business Machines’ (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.”",
        "created_utc": 1599003033,
        "id": "g3nnczg",
        "permalink": "/r/stocks/comments/ikqq4q/tesla_hype_is_fun_until_its_not/g3nnczg/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1599031833.0
    },
    {
        "author": "WeberStateWildcat",
        "body": "I'd certainly rather have Apple over IBM, but if I had 100+ shares of IBM, I'd investigate selling covered calls and collect some premium on the sale. And maybe premiums plural if it takes a few times for the buyers of said calls to succeed in hitting the strike price and exercising the option.",
        "created_utc": 1599280285,
        "id": "g42zuds",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g42zuds/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1599309085.0
    },
    {
        "author": "TrenAndOptions",
        "body": "You’re an idiot if you think IBM is dying. They’re leading the charge with quantum computing, even more than google",
        "created_utc": 1599023464,
        "id": "g3ooxye",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ooxye/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1599052264.0
    },
    {
        "author": "CptTonyStark",
        "body": "ppl who invest in cryp-to as a hyperinflation hedge in case dollar goes bust don't even realize that almost all cry-pto-currencies like shitcoin and airer are based on elliptic curve digital signature algorithm cryp-to-graphy, which is not quantum secure. The day quantum computers become powerful enough, which will happen in maybe a decade thanks to google, IBM, and MSFT, all coins will become worthless overnight. Imagine investing in something thinking that its' like gold and will keep value even in an apocalypse, not knowing that it's not even future proof just 1 decade from now. \n\n&amp;#x200B;\n\nNow, quantum secure cryp-to-graphy algorithms do exist but it's impossible to change the underlying block-chains and the algos driving them, by design. Quantum computers breaking encryption won't be a big problem to systems with central authority because they can just overhaul the encryption infrastructure. Not so much with coins, because the whole purpose of making them was to make sure no one tampers with the underlying block-chain and any algos driving it once it's up and running.",
        "created_utc": 1599336577,
        "id": "g45s0vr",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g45s0vr/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1599365377.0
    },
    {
        "author": "TrenAndOptions",
        "body": "“Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.“",
        "created_utc": 1599023318,
        "id": "g3oor4k",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oor4k/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599052118.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Imagine all the dumb fuck analysts who said Amazon was not a buy back in the 90s and recommended IBM, CSCO, and INTC instead. \n\nThat's how I feel about all the analysts with bearish targets on TSLA",
        "created_utc": 1599285296,
        "id": "g4372xo",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g4372xo/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1599314096.0
    },
    {
        "author": "MeteorMash101",
        "body": "IBM",
        "created_utc": 1599173113,
        "id": "g3wzbe6",
        "permalink": "/r/stocks/comments/ilwoqa/careful_with_thinking_this_is_the_only_dip/g3wzbe6/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1599201913.0
    },
    {
        "author": "DankMemelord25",
        "body": "Intel is the new IBM, change my mind 🤔🤔🤔",
        "created_utc": 1599024513,
        "id": "g3oq9t6",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3oq9t6/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599053313.0
    },
    {
        "author": "infinitelimits00",
        "body": "I just noticed the Boomer Index actually crushed today. \n\nKO, IBM, INTC all massively outperforming today. KO back to its post-COVID highs (since March 23). CSCO, DIS, BA, RTX, T also all up. And XLU was up 3%, which is a lot for a defensive utilities sector.",
        "created_utc": 1599091636,
        "id": "g3seg2j",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3seg2j/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1599120436.0
    },
    {
        "author": "sandpipa78",
        "body": "Same, can’t believe this shit. How in the hell ZM is worth more than IBM?",
        "created_utc": 1599001380,
        "id": "g3njqwz",
        "permalink": "/r/wallstreetbets/comments/ikt5rw/zoom_porn/g3njqwz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599030180.0
    },
    {
        "author": "dryu12",
        "body": "Zoom is valued more than IBM. Let that sink into your retarded brain.",
        "created_utc": 1599055486,
        "id": "g3px4uq",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3px4uq/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599084286.0
    },
    {
        "author": "Cwc123",
        "body": "ardes Michel11 hours ago\nYes....But.....Debt is huge for IBM......And they are not alone...Competition is also huge for IBM......Then a growth company is always richly priced......The world is the limit for ZM........No frontiers.......Sky is the limit.....ZM will reach 1000 usd if they continue to beat....\n\nWhy the f did i buy puts on this with ppl like this on the other side",
        "created_utc": 1599093636,
        "id": "g3si419",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3si419/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599122436.0
    },
    {
        "author": "infinitelimits00",
        "body": "Lol if you guys love the DOW, may I introduce you to the Boomer Index. \n\nKO, T, JNJ, BA, NKE, MCD, INTC, IBM, and CSCO (although INTC is catching on here...and the last three technically are correlated with tech).\n\nI like never see anyone trade NKE calls but it's actually a good company.",
        "created_utc": 1599182161,
        "id": "g3xln4y",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xln4y/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599210961.0
    },
    {
        "author": "sc0tt_1990",
        "body": "lol at Intel.  the new IBM.",
        "created_utc": 1599063974,
        "id": "g3qhsh2",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qhsh2/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1599092774.0
    },
    {
        "author": "wildcat990",
        "body": "Everyone is on TSLA S&amp;P watch -  what about ZM?  It’s eligible now -  https://www.barrons.com/articles/zoom-is-now-worth-more-than-ibm-next-stop-the-s-p-500-51598966331",
        "created_utc": 1598993925,
        "id": "g3n3og7",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3n3og7/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599022725.0
    },
    {
        "author": "ReflectAA",
        "body": "The first and most important thing you have to learn about the stock market is that the overwhelming majority of people have no clue what they’re talking about. \n\nPeople said Tesla was inflated when it had a market cap of 1 billion. And they were probably telling you to sell it and buy GE or IBM instead.",
        "created_utc": 1599266934,
        "id": "g42er4l",
        "permalink": "/r/stocks/comments/imruf3/apple_and_pe_ratio/g42er4l/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1599295734.0
    },
    {
        "author": "pelikana20",
        "body": "Damn I slept on IBM's unusual options activity. It's up 3.8% today but who's even in IBM??",
        "created_utc": 1599081666,
        "id": "g3rskmk",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rskmk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599110466.0
    },
    {
        "author": "guyfawkes202",
        "body": "I have 30 shares of international business machines stock that I’ve been holding since 1979... in fact I set up one of the original COBOLT servers for IBM back in the day.",
        "created_utc": 1599104516,
        "id": "g3t1mit",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3t1mit/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599133316.0
    },
    {
        "author": "barnett9",
        "body": "NVDA has been working on architecture to do compute without CPU's for a while. If they pull it off then they will redefine how computers work at a fundamental level. They are stupidly overbought right now, but long timeline I'd take that gamble.\n\nIBM is also trying to not be a dinosaur and is investing fairly heavily into quantum computing, maybe that.",
        "created_utc": 1599156838,
        "id": "g3voret",
        "permalink": "/r/wallstreetbets/comments/ilygri/30_year_timeline_10k_bet/g3voret/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599185638.0
    },
    {
        "author": "CritSC",
        "body": "I’ve been thinking about buying IBM for weeks because it is the only tech stock with a price less than its IV. I just haven’t had time to do a full DCF and read the 10-K yet.",
        "created_utc": 1599100898,
        "id": "g3svfg2",
        "permalink": "/r/ValueInvesting/comments/ill0c5/ibm_good_investment_or_value_trap/g3svfg2/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1599129698.0
    },
    {
        "author": "LineReact0r1",
        "body": "Ahh the Redhat deal. Yeah i remember reading about that. Probably the best thing they have done in 20 years. Not for Redhat but def for IBM.",
        "created_utc": 1599026152,
        "id": "g3os8ad",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3os8ad/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599054952.0
    },
    {
        "author": "CallinCthulhu",
        "body": "People still use yahoo everyday. It’s the 10th most visited site in the world.\n\nIt takes more than a cornerstone product to grow. Microsoft was weighed down by a continuous stream of awful products, poor acquisitions, botched acquisitions, and no ability to look forward. They were very slowly but surely dying. They were losing market share everywhere.\n\nSatiya changed that and they really embraced cloud, and managed some fantastic acquisitions that they didn’t fuck up after. Without him and the changes they made, they’d be IBM. Flat as fuck",
        "created_utc": 1599280313,
        "id": "g42zvn2",
        "permalink": "/r/stocks/comments/imqb50/selling_my_tesla_stock_yes_im_an_idiot/g42zvn2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599309113.0
    },
    {
        "author": "AvodLooksee",
        "body": "mPulse is the patented leading microgrid managing software, and mVSO is their optimization program that then feeds info to their mPulse software. Not 100% sure if mVSO is patented but their main product mPulse definitely is.\n\nIBM said they're on the leading edge of the cutting edge in a white paper, and seeing as though tesla partnered with them on a microgrid battery I think it's more set in stone than up in the air. 1m in backlogged contracts, and more projected after the acquisition of gridfabric and its clients.",
        "created_utc": 1599164057,
        "id": "g3wadzt",
        "permalink": "/r/stocks/comments/ilz5hw/clsk_on_super_sale_before_the_conference/g3wadzt/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599192857.0
    },
    {
        "author": "Thanks-Feeling",
        "body": "Why don't you just reinvest the dividend from your IBM stock into shares of Apple stock?",
        "created_utc": 1599285445,
        "id": "g437an8",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g437an8/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1599314245.0
    },
    {
        "author": "Trumpowell",
        "body": "Anyone see that huge order  on $IBM contracts 6049 traded 130C 8/4\n\nIs $IBM buying tikthot ?",
        "created_utc": 1599102275,
        "id": "g3sxtee",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3sxtee/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599131075.0
    },
    {
        "author": "LePootPootJames",
        "body": "ZM larger market cap than IBM lol",
        "created_utc": 1598971566,
        "id": "g3ledwt",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ledwt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599000366.0
    },
    {
        "author": "TrudeausMakeupArtist",
        "body": "Me: I think IBM is making a pivot to cloud services, but the results are yet to be seen. I'll buy in at $115-118.\n\nMarket: Fuck your plan.",
        "created_utc": 1599063232,
        "id": "g3qfuxm",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qfuxm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599092032.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If IBM changes their name to International Blockchain Machines they’d probably double in value.",
        "created_utc": 1599001219,
        "id": "g3nje0s",
        "permalink": "/r/investing/comments/iks7c7/7_million_worthington_nkla_shares_unlocking/g3nje0s/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599030019.0
    },
    {
        "author": "Furloughedinvester",
        "body": "I also understand that ZM is currently valued higher than IBM. We may not be in a bubble but we are definitely in something.  Maybe the Twilight Zone?",
        "created_utc": 1599100543,
        "id": "g3suslr",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3suslr/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599129343.0
    },
    {
        "author": "Lie-Minimum",
        "body": "If ibm traded at a pe of .00001 I would buy every share and collect millions in dividends for a few thousand dollars. Value absolutely does matter.",
        "created_utc": 1599030192,
        "id": "g3owlhc",
        "permalink": "/r/investing/comments/il13pb/cmv_fundamentals_and_pe_ratio_do_not_and_have/g3owlhc/",
        "score": 2,
        "subreddit": "investing",
        "created": 1599058992.0
    },
    {
        "author": "radioref",
        "body": "IBM, Honeywell, Ford, GE, Kellogg, Exxon, Phillip Morris.",
        "created_utc": 1599415173,
        "id": "g494fcs",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g494fcs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599443973.0
    },
    {
        "author": "doublejay1999",
        "body": "dont understand your downvotes.  this is pretty much where we are right now.\n\nin different times, they would have already have broken them up.  They were very close to breaking up IBM in the 90's and they were no where near the level of dominance of Google &amp; Amazon.\n\nI think they are surviving because they are vital to the economy right at the moment, in the US at least.  But things are changing elsewhere.  Rupert Murdoch has his ass in his hands about content theft by Facebook &amp; Google, and the EU are sniffing round amazon for sharp practice and tax policies.\n\ni still dont believe anyone has the balls or brains to make the case that our economies would be better balanced &amp; stronger without these guys  sucking everything up.",
        "created_utc": 1599046348,
        "id": "g3pezzc",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3pezzc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599075148.0
    },
    {
        "author": "mbr902000",
        "body": "Someone gonna scoop em up, maybe ibm",
        "created_utc": 1599045958,
        "id": "g3pehq4",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3pehq4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599074758.0
    },
    {
        "author": "EithneDraoct",
        "body": "There was probably some repositioning out of Apple and Tesla in to some value plays, but tech will continue to dominate this K, imo. A lot of those value stocks are tech anyway. Look at IBM and INTC.",
        "created_utc": 1599068711,
        "id": "g3qu4ij",
        "permalink": "/r/stocks/comments/il7ojn/rotation_from_tech/g3qu4ij/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599097511.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM, DD, HEALTHCARE, INDUSTRIALS",
        "created_utc": 1599075387,
        "id": "g3rbl88",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3rbl88/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599104187.0
    },
    {
        "author": "GamblingMikkee",
        "body": "Shift to CVS, IBM, MO",
        "created_utc": 1599055092,
        "id": "g3pw7eh",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3pw7eh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599083892.0
    },
    {
        "author": "scot-t-ophile216",
        "body": "I hear a lot about breaking AMZN, but I don't think it'll happen. There are so many competing against AMZN and holds their own against them, like Microsoft, Google, Oracle, Salesforce, IBM, Walmart, Target, etc.",
        "created_utc": 1599016674,
        "id": "g3oew62",
        "permalink": "/r/StockMarket/comments/ikpu4w/walmart_vs_amazon_the_next_big_online_retailer/g3oew62/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599045474.0
    },
    {
        "author": "LineReact0r1",
        "body": "For real what does IBM even do anymore? Havent heard of anything made by them in forever?",
        "created_utc": 1599023834,
        "id": "g3opf7m",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3opf7m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599052634.0
    },
    {
        "author": "Longboarding-Is-Life",
        "body": "I image most established tech companies were. Apple, Microsoft, IBM, etc.",
        "created_utc": 1599099843,
        "id": "g3stk0a",
        "permalink": "/r/investing/comments/ilkw0n/werent_plenty_of_tech_firms_profitable_before_the/g3stk0a/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599128643.0
    },
    {
        "author": "JmotD",
        "body": "In terms of P/S ratio, this time is crazier than  Dot.com bubble.  \n\n Zoom Video Communications (ZM) jumped 41% after reporting earnings that were more than twice what analysts had been expecting. It's now worth $129.1 billion, more than International Business Machines' (IBM) $109.9 billion. Zoom had sales of $663.5 million during its second quarter, while IBM had sales of $18.1 billion.",
        "created_utc": 1599046924,
        "id": "g3pfxsm",
        "permalink": "/r/stocks/comments/iks9cg/zooms_market_cap_dashes_past_lowes_phillip_morris/g3pfxsm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599075724.0
    },
    {
        "author": "shadowgyro",
        "body": "I am seeing a lot of posts commenting about AWS  \"subsidizing\" Amazon retail. That idea doesn't look that fleshed out to me. How exactly are people arriving at that conclusion? By looking at the overall profitability? Sure, AWS has a much higher profit margin but that doesn't say anything about whether or not they are subsidizing products on retail. Amazon e-commerce, by design, is reinvesting all the cash back into the business for top-line growth. E-commerce divison itself has so many other businesses within it - profits from TV could be subsidizing shoes or phone cables. We only see the overall profits of the _entire_ e-commerce divison.  Also, the marketplace division is significant chunk of the e-commerce revenue (Amazon only counts the fees they charge 3rd parties as revenue). Profit margins for those will be a lot better than that of the first-party retail business as Amazon doesn't have to carry inventory at all. Also, advertising is another fast growing segment with higher profit-margins.I am not sure if we have enough data to make any comment regarding who is subsidizing what.\n\nAlso, AWS itself faces very serious competition from Azure, GCP, IBM, Oracle etc They are releasing a tonne of new features every year. Why will they not want use the cash from AWS for growing AWS but subsidize toilet-paper? Seems odd to me.\n\nFrom what I understand the profitability of AWS is providing a cover for Amazon from a Wall Street standpoint - \"Here have some profits, let us concentrate on growth.\"\n\nI also don't see how breaking up Amazon into AWS and E-commerce creates room for additional innovation. There is very serious competition for both the businesses.",
        "created_utc": 1599107033,
        "id": "g3t5qqk",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3t5qqk/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599135833.0
    },
    {
        "author": "RedVermont12",
        "body": "Just like IBM has continued to be an amazing investment.",
        "created_utc": 1598979107,
        "id": "g3lywa3",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3lywa3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599007907.0
    },
    {
        "author": "ampatton",
        "body": "It’s typically someone that’s seen as someone that has a financial/business background and “counts beans” by putting a bigger importance on the short term profitability of the company rather than the core engineering principles and/or the long term growth of the company.\n\nOne example of this could be seen from IBM and its past leadership (Louis Gerstner, Sam Palmisano, and Ginni Rometty) which, in my opinion, significantly contributed to IBMs decline. This could also probably apply this to other companies as well, but this is the one that sticks out most in my mind.",
        "created_utc": 1599449051,
        "id": "g4apv31",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4apv31/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599477851.0
    },
    {
        "author": "Ironleg01",
        "body": "Absolutely brilliant write up. Tech equities became really expensive and I was looking for some value alternatives in tech sector as well. HPE definitely stood out but initially I was quite skeptical as I thought this would be company that sells servers or networking equipment. Upon investigating it I'm super intrigued and will open position next week.  \n\nI love that they detached from legacy PC and printers business, I love that early on they spun off their services &amp; consulting business, I love that they offloaded their legacy software business to Micro Focus (poor guys are struggling to sell it now) and I love that they are not competing with Azure or AWS but instead specialise in their own niche. I think that HPE's hybrid cloud solution is probably the best offering in industry right now. IBM, AWS and Google Cloud offer hybrid solutions but it looks like they are very nascent offerings compared to HPE's.\n\nI also love acquisitions they been making. Like you mentioned Silver Peak and Cray (which were very smart acquisitions) but also BlueData (AI &amp; big data analysis), Plexxi (hybrid networking) and others.\n\nAlso, their focus on the edge and hybrid seems to be very well timed. Edge computing is still in its early stages but will undoubtedly expand in the future. A lot of people talk about hybrid as stepping stone for legacy infrastructures which is true. However, with data privacy and data security regulations becoming stricter hybrid will become way more than just stepping stone to full cloud. In Europe it already matters great deal where are you servers located and who can access them.\n\nFinally, HPE feels like it could be story similar to Microsoft. That is, Microsoft was perceived as this legacy, stagnant organization and it was trading at price reflecting that sentiment. Until their cloud offering changed everything. If all goes well with HPE it could be very similar story and brilliant entry point right now.\n\nP.S.\n\nSpeaking of undervalued tech equities. Do you have any thoughts on Seagate? They are trading at quite low multiples and with growing cloud, data storage will have to grow too. On the  other hand HDDs are legacy hardware and they are not very strong at making SSDs yet.",
        "created_utc": 1599389585,
        "id": "g47ynni",
        "permalink": "/r/stocks/comments/igib2a/hpe_transition_to_asaservice_and_path_to_alltime/g47ynni/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599418385.0
    },
    {
        "author": "dreamvilliannm",
        "body": "What price did you buy ibm?",
        "created_utc": 1599279975,
        "id": "g42zfmo",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g42zfmo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599308775.0
    },
    {
        "author": "woahwoahwoahokay",
        "body": "Yeah intel may turn into an ibm. I’m fully aware of that and can always keep an eye out for that. But they still have a lot of potential for short term increases and a lot of enterprises hardware still runs on intel because that’s superior.\n\nTrust me. I live here in Silicon Valley so I know that intel is on the down turn but they can still change things up and come out ahead. I’ve seen bigger comebacks. Who knows. It’s just a small percentage meant to hedge bets. We’ll see. Hopefully it’s just an ibm and not a yahoo that intel ends up turning into.",
        "created_utc": 1599260187,
        "id": "g422hqf",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g422hqf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288987.0
    },
    {
        "author": "_Floriduh_",
        "body": "Agree on ARM and Intel. Huge acquisition that could truly make them a giant if things really do break away from x86. And Intel will be stag-tech case study much like the IBM we know.",
        "created_utc": 1599310974,
        "id": "g44a9yb",
        "permalink": "/r/wallstreetbets/comments/imxoeh/nvidia_will_be_the_first_1_trillion_semiconductor/g44a9yb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599339774.0
    },
    {
        "author": "Spenraw",
        "body": "If I had more cash flow I would put a safe chunk in to this. Part of me thinks Apple and IBM will see a huge jump with 5g and pay good dividends too. Cien seems like a great grab right now, but the dividends could help me grab more 5g stuff in the next year before it really booms",
        "created_utc": 1599162931,
        "id": "g3w70rf",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3w70rf/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599191731.0
    },
    {
        "author": "CallsCallsCallsCalls",
        "body": "\"blue chip\"  tech is going to do well right now. IBM for example. Stuff with dividends that has been hit but with growth still.",
        "created_utc": 1599140855,
        "id": "g3uenb1",
        "permalink": "/r/wallstreetbets/comments/ilqp2l/daily_discussion_thread_for_september_03_2020/g3uenb1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599169655.0
    },
    {
        "author": "CallsCallsCallsCalls",
        "body": "I've been waiting for a correction, and at the end of today I was thinking we definitely bleed tomorrow too. Now AH was so bad I think the pendulum has to swing back already to some degree, on some stocks.\n\nGood \"blue chip\" stuff and more mature tech stocks with dividends have been waiting to explode up. Every time the bubble stuff reverses a bit, stocks like IBM and INTC have had huge moves up relative to their normal betas/IV (options on IBM for $1 OTM have gone up 700%+ multiple times intraday for relatively small moves).\n\nThose type of stocks haven't gone up during the pandemic at all despite positive earnings/outlook and minimal disruption. Money has a lot to flow into tomorrow, it just won't be the usual stuff.",
        "created_utc": 1599178233,
        "id": "g3xe6vz",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3xe6vz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599207033.0
    },
    {
        "author": "Kangaroos2020",
        "body": "Rumors of IBM acquiring Cloudera have been around for awhile, CLDR would go to moon if so",
        "created_utc": 1598987982,
        "id": "g3mnl0k",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3mnl0k/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599016782.0
    },
    {
        "author": "Smooothoperat0r",
        "body": "Just a sticking point here: GE and IBM had huge cash flows for decades that led to a sharp decline in stock price because they were cash rich but growth poor. Today both are miniature versions of their former behemoth selves.",
        "created_utc": 1599014965,
        "id": "g3obwlf",
        "permalink": "/r/wallstreetbets/comments/ikrq8w/gme_yolo_monthstart_update_sep_1_2020/g3obwlf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599043765.0
    },
    {
        "author": "khizoa",
        "body": "not to be an ass, but no relevance whatsoever. esp since OP asked about EXPLOSIVE GAINS, in the next FEW YEARS. they're not even relevant RIGHT NOW\n\noil companies will eat shit\n\nsears is already eating shit\n\nibm is pretty stagnant unless they innovate to keep up with tech\n\ngoodyear, i guess they can keep making tires or whatever they do, as there will always be cars. but the only explosive gains will be the random trump pump that theyre being treated unfairly",
        "created_utc": 1598980418,
        "id": "g3m2qqb",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3m2qqb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599009218.0
    },
    {
        "author": "redroverster",
        "body": "IBM, Mobil, Exxon, Sears, Goodyear",
        "created_utc": 1598961371,
        "id": "g3krlu3",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krlu3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990171.0
    },
    {
        "author": "Itsawhazzyitsawhoozy",
        "body": "I bought some stock on June 1st, not the best day price wise but it’s the stock I plan to hold the longest out of my whole portfolio, except for MSFT maybe. I made a DD for myself and made a brief summary around April. Most of it is based on their 10-K last year and their first 10-Q of the year. The key here is that this has been seen as a dinosaur for the past decade, due to lack of innovation, terrible management decisions (crazy high EPS and a buyback program that should have been cut long ago), and recruiting issues. A new CEO (Arvind Krishna) and a switch to the cloud (and quantum computing for the 2030s at least) are the key changes that could drive change. Sorry if it’s a bit messy, was not meant to be posted when I wrote it : \n\nIBM : New CEO Arvid Krishna has my trust, hope he will change top and mid tier management (which did weird accounting tricks like the pseudo Lenovo « sale/buy », laid off workforce for no reason, did not R&amp;D enough, focused on business services and consulting too much, had the crazy 20$ EPS goal, etc…). Krishna pushed Red Hat acquisition (open source enterprise software, will allow them to become hybrid cloud providers, hybrid cloud is interoperable (BFF example), scalable (ERP switch to 3rd parties), portable, and secure (user data still in private cloud)). Krishna was senior VP for cloud and cognitive software. \nIBM has switched industries several times throughout its life : time clocks, then tabulating machine, then typewriter, then mainframe (good changes), then personal computers (good initially but then poor because used competitors’ chips), etc… Cloud/AI could be their next successful switch (1/3rd of revenue in 2019, still increasing). Quantum Computing too, as they’ve strongly positioned themselves as industry leaders, but that’s in the very, very long run.\nWhile not the most important aspect, company is a dividend aristocrat (increasing div payout for 25 years), but what matters is that div payment was never removed, even though I think it should have been decreased during the struggles of the 2010s and instead reinvested in R&amp;D, they should have also paused their share buyback program. Financials : P/E around 10 (very good for a tech company), P/BV is 5.5 (good for a tech company, especially one transitioning to less tangible assets), net income slowly increasing, current ratio of nearly 1 at end of 03/31 which is decent given Red Hat acquisition and coronavirus, D/E is 2.62 (that one is indeed bad, but they got cash I guess, still not great).",
        "created_utc": 1599125472,
        "id": "g3tpsfi",
        "permalink": "/r/ValueInvesting/comments/ill0c5/ibm_good_investment_or_value_trap/g3tpsfi/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1599154272.0
    },
    {
        "author": "FireEraser",
        "body": "Why would any of those companies want to buy IBM?",
        "created_utc": 1599070284,
        "id": "g3qy3t7",
        "permalink": "/r/stocks/comments/ilby5h/ibm_as_takeover_target/g3qy3t7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599099084.0
    },
    {
        "author": "shatterkneesinc",
        "body": "cmon cscso even ibm mooned today",
        "created_utc": 1599069693,
        "id": "g3qwn2w",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3qwn2w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599098493.0
    },
    {
        "author": "Lambotherambo",
        "body": "You said it could never get to the size of google fairly explicitly. Google is already a dinosaur and in 10 years time will be viewed as an IBM of sorts. AWS is not blocked from being the next current “Google” at all",
        "created_utc": 1599074446,
        "id": "g3r8zn3",
        "permalink": "/r/investing/comments/il07iw/what_would_happen_to_major_tech_stocks_such_as/g3r8zn3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599103246.0
    },
    {
        "author": "Jarlaxle_rigged_it",
        "body": "NFLX was starting a great run before this fing shit. even managed to try to break up yesterday while everything was crashing. dd plz on that solid stock&lt;3\n\nINTC ofc (all that insider buying) \n\nSomehow AVGO/IBM barely felt this thing, might be good tech+cyclical trades..",
        "created_utc": 1599250717,
        "id": "g41b97v",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g41b97v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599279517.0
    },
    {
        "author": "sirajgb",
        "body": "Airbus, ibm (people make fun of it but they are one of the leaders on developing quantum computing, including the prog language), Ericsson (5g play) Eon",
        "created_utc": 1599241794,
        "id": "g40k92i",
        "permalink": "/r/wallstreetbets/comments/imddo3/daily_discussion_thread_for_september_04_2020/g40k92i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599270594.0
    },
    {
        "author": "soupmonster40",
        "body": "lol yeah. I inverse WSB.\n\n\"intel is the next IBM\" --&gt; buy intel &amp; Micron\n\n\"oil is dead\"--&gt; buy oil\n\n\"NET sucks it's a meme stock\" --&gt; buy NET",
        "created_utc": 1599261430,
        "id": "g4256lr",
        "permalink": "/r/wallstreetbets/comments/imp0dz/insights_on_my_portfolio_please/g4256lr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599290230.0
    },
    {
        "author": "Kramer-Melanosky",
        "body": "Your comparison is absurd. Microsoft would have become another IBM if not for Sathya Nadela. \n\nIntel is lagging in technology for quite a while. Without any positive news in near future, it's a gamble. It can be become next Microsoft or IBM.\n\nMobile Eye I good, but with chances of their major revenue going down and gap between ADM widening over next few years. I don't feel it's worth it.",
        "created_utc": 1599424001,
        "id": "g49kgv5",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49kgv5/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599452801.0
    },
    {
        "author": "bitflag",
        "body": "I think Intel is already close to being IBM. They consistently gave up on new markets (ie mobile, high end GPU, modems) because it is initially small and expensive, which let the competition take those juicy new trends while Intel got stuck the same old x86 chips it's been doing for 4 decades.\n\nManufacturing problems is only salt on the wound. It's accelerating the decline because it was Intel moat in it's core business.",
        "created_utc": 1599448655,
        "id": "g4apa51",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4apa51/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599477455.0
    },
    {
        "author": "HallucinatoryFrog",
        "body": "Bit of a personal anecdote here:\n\nSo I have a degree in IT with a focus on Computer Networking.\n\nI once interviewed for IBM because they had positions open for Network Admins.  Unfortunately, when I sat down and looked over their list of jobs I discovered that they were only looking for senior level positions (something they did not mention in the email they sent to my university).\n\nI decided to interview anyway because I was already there in suit and tie so I wasn't about to get all dressed up for nothing.\n\nThe interview went well, but the guy told me he just didn't have anything for me at the time.\n\nI decided to walk around afterwards and saw a guy interviewing for entry level programmers.  My campus did not offer a Software degree (they offered it at a different campus), but I did have to take 9 credits in basic programming which was Java, C++, and HTML.  I had already taken the Java and C++ classes.\n\nI sit down with the guy and we get to talking.\n\nHe asks my background in coding.  I tell him one intro in Java and C++ so far.\n\nHe asks why am I interviewing if my degree is not focused on coding.  I tell him because those two classes opened my eyes to something that I didn't even know I wanted before.  I love creating stuff with code, I find it cathartic to sit and stare at code, getting lost in it while trying to figure out where my errors are, the absolute joy of finally getting it to compile and run.  I even started to make some basic programs at home in my free time.\n\nHe asks me if I have any of my work to show him.  I did not bring any copies of my code because I wasn't even thinking about the possibility of interviewing for any other positions (let this be a lesson to anyone who's still getting their degree, bring everything!).\n\nI tell him I did have it on a thumb drive that I carry around in my briefcase, but of course he waves his hand and says that's a security issue (totally agreed).\n\nHe asks me what a function is.  I draw a blank.  I ended up stammering out something like, \"it's the part of the code that does stuff\".  Not necessarily wrong, but more of an ELI5 definition.\n\nHe shows me some code and asks what I can decipher from it.  It's a function that takes a variable, runs it through a formula, returns a variable, and then loops 4 more times using the new return variable each time, and finally shows a set of the return variables at the print out.  He confirmed that I was right.\n\nHe asks me what that sets of numbers is called.  Obviously it's an array, and I had heard the term before, but again I did not know at the time.  He frowns and says something along the lines of, \"You really don't know basic terminology.  You should work on that.\"\n\nWe shook hands and parted ways, never got a call back.  Now, I know I messed up by not having some of my work printed out, and not being up on the terminology.  But it really rubbed me raw that this guy was so hung up on terminology, knowing that coding was like 5% of my entire degree, and yet I still had a basic working knowledge of programming to at least be able to read and understand what was going on, and that I was passionate enough about it to go home and write some basic programs of my own.\n\nNow I don't know that the lack of terminology was the ultimate reason I was turned down.  I do know that they were looking to start up a class that would take about 3 years to go through, and they were going to teach a proprietary language that was similar to Java.  Obviously, the terminology would have been brought up again multiple times in that 3 year program.  The only clue I had for why I was turned down was the lack of lingo.\n\nI am now a manager at a FinTech company, and I don't ask \"lingo\" questions of interviewees.  I want to know if they understand the meat and potatoes of what the job entails because, to me, that means so much more.  Lingo will happen over time as they do the job.\n\nI'm not saying that is all the OP was concerned about in their interviews, but they certainly seem to think it's a flaw in an interviewee that makes them unsuitable for hiring.",
        "created_utc": 1599457511,
        "id": "g4b12z3",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g4b12z3/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599486311.0
    },
    {
        "author": "Lazybumm1",
        "body": "I'm very bullish on NVIDIA but I think you are overestimating some of its competitive advantages. Raytracing will probably become industry standard sooner or later and supported across either platform. DLSS is something AMD or any other company with a bunch of ML engineers and money can replicate given some time. \n\nIt's not impossible for other companies to replicate or immitate or substitute some of those technologies / products. AMD is certainly catching up and will carve off some fractions of the market in the AI/ML &amp; datacenter businesses.\n\nThe ARM acquisition, if it happens, will confer a competitive advantage like no other. As an NVDA stockholder I wish this happens. As a Brit working in and loving tech, I am slowly dying on the inside... \n\nSomething to remember is that this is a fast expanding market and not a saturated one, there's room for multiple players to grow and win at the same time. \n\nThat being said, I still think Intel will likely be the next IBM. Is it gonna tank overnight? No, and there will probably be plenty of rallies to make money off, but long term I wouldn't look to hold.",
        "created_utc": 1599305308,
        "id": "g440s54",
        "permalink": "/r/wallstreetbets/comments/imxoeh/nvidia_will_be_the_first_1_trillion_semiconductor/g440s54/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599334108.0
    },
    {
        "author": "ThemChecks",
        "body": "This seems pretty fair honestly. IBM isn't a bad dividend stock for what it's worth.",
        "created_utc": 1599308082,
        "id": "g445t5l",
        "permalink": "/r/stocks/comments/imur3w/swap_ibm_for_aapl/g445t5l/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599336882.0
    },
    {
        "author": "Art0002",
        "body": "You asked a decent question so I thought you deserved a thoughtful response. \n\nDo old companies like IBM and newer companies and companies that are in focus now. \n\nI read a post by someone trying to put a valuation on SPCE. He had to make assumptions and he pointed them out. It was a good read. I’m not sure what he ultimately concluded but I dabble with SPCE options and I’ve made a few bucks. \n\nI think your endeavor will improve your future trading results. There is no downside. \n\nAnother thought is adding a layer of technical analysis to add even more signals as to when to buy or sell. There is analysis paralysis but when fundamental and technical analysis lines up ...\n\nI don’t want to ramble but I trade differently than you. You are young and I am retired. What made early retirement possible was increasing my dollar cost averaging (DCA) into the 08/09 crash. I cut spending and DCA’ed into it. It was brutal. I was fully invested. I raised my 401k contributions. \n\nIt paid off and took me over the hump. Don’t underestimate DCA.",
        "created_utc": 1599176554,
        "id": "g3x9m49",
        "permalink": "/r/investing/comments/im2uuw/learning_valuation/g3x9m49/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599205354.0
    },
    {
        "author": "Spenraw",
        "body": "very good to know, I already own telus so maybe time to put it in apple, but IBM AI will use 5g alot",
        "created_utc": 1599186866,
        "id": "g3xu28l",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3xu28l/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599215666.0
    },
    {
        "author": "ThreeEyeJedi",
        "body": "Exactly they never used the products they're talking about. What tech company you know uses Teams? Maybe some corporate giant like IBM but no one is actually using Teams",
        "created_utc": 1599065571,
        "id": "g3qlx8h",
        "permalink": "/r/wallstreetbets/comments/ijpbec/slack_work_discord_for_grownups_and_why_this_saas/g3qlx8h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599094371.0
    },
    {
        "author": "chawpyx5",
        "body": "Right there with ya. I also have IBM 131 9/11s that were up 390%. They are literally break even at 0% right now.",
        "created_utc": 1599213567,
        "id": "g3yqndt",
        "permalink": "/r/wallstreetbets/comments/im129n/what_are_your_moves_tomorrow_september_04_2020/g3yqndt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599242367.0
    },
    {
        "author": "RumLovingPirate",
        "body": "Retail investors *used* to not have an affect on the market up until the past year or so. I mean, being a retail investors used to me call your local stock broker and asking for a few shares of that hot new stock called ibm. Mainframes are the future!\n\nThen came online trading and even then, most people who had been investing saw little reason to leave their stock broker and fees started at like $30 a trade and we're executed slowly.\n\nEven with *super low*  $10 trades making 30 trades a day was expensive and people didn't focus on in.\n\nIn comes gen z who are the side hustle generation, $0 fast trades, tons of youtube and tiktok vids on how to trade and make $1k a day, and we're seeing the long tail effect of a lot of people with low volume adding up to a lot of the overall trade volume. \n\nRetail investors absolutely affect things now, and they absolutely need to realize what it's like to get burned.",
        "created_utc": 1599222872,
        "id": "g3z49ks",
        "permalink": "/r/investing/comments/imeakd/cnbc_robinhood_traders_need_to_get_burned_a_bit/g3z49ks/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599251672.0
    },
    {
        "author": "trader9899",
        "body": "TSLA is the most watched stock from retail along with Apple. They can make a business selling their own stock and would bring in 2 billion a year for the next 100 year. I don’t understand what is the allure of having to short Tesla when there are a bunch of legacy boomer stock you can short. IBM/XOM/mall stock for easy money",
        "created_utc": 1599270249,
        "id": "g42kch8",
        "permalink": "/r/investing/comments/imp0rv/tesla_stock_could_tumble_over_90_says_analyst/g42kch8/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599299049.0
    },
    {
        "author": "Lazybumm1",
        "body": "Yes not talking short term, the IBM example is a good one. That's what I meant.\n\nThey can pump prices with buybacks anytime too.",
        "created_utc": 1599260058,
        "id": "g422645",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g422645/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288858.0
    },
    {
        "author": "DankMemelord25",
        "body": "Intel is the next IBM",
        "created_utc": 1599090971,
        "id": "g3scxzu",
        "permalink": "/r/wallstreetbets/comments/ilb2rx/need_more_shit_tech/g3scxzu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599119771.0
    },
    {
        "author": "roox911",
        "body": "yeah, tough to say - i'm bullish enough on it that i think it'll be up 10% from here before the end of the year, assuming the market doesn't keep black swanning from here of course...\n\nI have IBM in my sights as well - just waiting to see if there is a better entry in the coming days :)",
        "created_utc": 1599163120,
        "id": "g3w7l7x",
        "permalink": "/r/CanadianInvestor/comments/ilyhy3/what_5g_companys_that_have_low_prices_should_i_be/g3w7l7x/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1599191920.0
    },
    {
        "author": "nicename09",
        "body": "Intel ruined itself by hiring mediocre tech talent. Maintenance engineers who think they're innovators. What a joke. Years of onboarding average employees gets you average results. Shocking! Gotta squeeze those margins from somewhere I guess. Now its a perpetual cycle of complacency and ineptitude. At this point you could hand intel the market leading product in self driving tech and they'd blow that lead within 16 months. They want to be IBM. No amount of wishful thinking from the outside can change that.",
        "created_utc": 1599459847,
        "id": "g4b3tjt",
        "permalink": "/r/wallstreetbets/comments/inrj01/intel_the_big_picture_and_why_im_bullish_on_it/g4b3tjt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599488647.0
    },
    {
        "author": "Ironleg01",
        "body": "Unless Intel gets new CEO they are going to do just as well as IBM did. They also were massive company once.",
        "created_utc": 1599468540,
        "id": "g4bch3b",
        "permalink": "/r/wallstreetbets/comments/io1van/amd_will_because_of_intels_presentation/g4bch3b/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599497340.0
    },
    {
        "author": "Furloughedinvester",
        "body": "IBM?",
        "created_utc": 1598959320,
        "id": "g3kotnr",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kotnr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598988120.0
    },
    {
        "author": "Immediate_Student_92",
        "body": "ah okay, but why is that. Both azure and aws are better than the competition, which is google baba IBM etc, all the giant techs. And cloud is still in its infancy. What makes you think theyll be replaced, at least in that industry.",
        "created_utc": 1599187582,
        "id": "g3xv9yt",
        "permalink": "/r/stocks/comments/iltt53/are_we_in_a_covidtech_bubble_heres_how_to_tell_my/g3xv9yt/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599216382.0
    },
    {
        "author": "MattSurprise",
        "body": "IBM",
        "created_utc": 1599354481,
        "id": "g46sq5w",
        "permalink": "/r/wallstreetbets/comments/imn9ca/weekend_discussion_thread_for_the_weekend_of/g46sq5w/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599383281.0
    },
    {
        "author": "woahwoahwoahokay",
        "body": "No trust me. I agree. I think AMD is the superior product at this point and my stocks reflect that. But intel is undervalued in the short term based on reactionary sell offs due to bad news. It’s undervalued. They have a lot of talent. I live close to intel. I know a lot of people who work there. They’re not going to go under overnight and they don’t ONLY sell chips. They’ll pivot and react accordingly. If I’m wrong then I only lose a small percentage of money, if I’m right, then I make serious gains. It’s meant to mitigate risk. Buying into intel is meant to help diversify my portfolio and I honestly feel they are undervalued at this point. Should it have dipped? Yes. By that much? No. Intel is still fucking intel. They will continue to do well for the coming years.\n\nCould they turn into an ibm? Yeah maybe. But by then I’ll be out of the stock. But the revamped logo and some updates to hardware is enough to push the needle.",
        "created_utc": 1599259754,
        "id": "g4215i2",
        "permalink": "/r/wallstreetbets/comments/imoict/stock_on_sale_or_bull_trap/g4215i2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288554.0
    },
    {
        "author": "sk169",
        "body": "Yes. My whole thesis is based on Intel becoming Microsoft rather than IBM. \n\nI don't have a crystal ball and neither do you. I'm betting on Intel becoming Microsoft rather than IBM.",
        "created_utc": 1599424176,
        "id": "g49ks6f",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49ks6f/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599452976.0
    },
    {
        "author": "ATLiving",
        "body": "Intel is like IBM. Maybe in 10 years it’s great again or maybe in 10 years it’s dead.",
        "created_utc": 1599432597,
        "id": "g49zlvb",
        "permalink": "/r/investing/comments/inr451/intel_the_big_picture_and_why_im_bullish_on_it/g49zlvb/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599461397.0
    },
    {
        "author": "undecidedmarketmaker",
        "body": "I agree with all your points, except \n\n&gt;The kind of employees has not really mattered about how the company as a whole does\n\nIt matters a lot when it comes to the bread and butter of processors. No innovation means death in this industry. While poorly run companies can limp (and limp well) for years - see Oracle, IBM, etc - is Oracle really going to be a company you want to put your money in? \n\nGiven what I know about INTC, I don't think INTC is going to be around in 20 years. Not in its current form, at least. The part I'm keeping a close eye on is Intel Capital, which they use to squelch and/or gobble up competition - that might keep them alive forever as a business model, but I don't like it. I guess I'll be proven wrong when I'm an old man lol but that's my two cents.",
        "created_utc": 1599442054,
        "id": "g4aeq16",
        "permalink": "/r/wallstreetbets/comments/inrj01/intel_the_big_picture_and_why_im_bullish_on_it/g4aeq16/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599470854.0
    },
    {
        "author": "upvotemeok",
        "body": "Can ibm pull a msft over next decade and but 1t?",
        "created_utc": 1599428820,
        "id": "g49t0i5",
        "permalink": "/r/stocks/comments/imfn3y/down_dayselloffpanicdont_panicwhat_are_you_buying/g49t0i5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599457620.0
    },
    {
        "author": "MaximusHippocratus",
        "body": "IBM",
        "created_utc": 1599123215,
        "id": "g3tnqz9",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3tnqz9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599152015.0
    },
    {
        "author": "dmitsuki",
        "body": "IBM can make good RISC CPU'S, PPC is still an option though devs prefer completely off the shelf nowadays.",
        "created_utc": 1599124590,
        "id": "g3tozi5",
        "permalink": "/r/wallstreetbets/comments/ilfn28/any_plays_for_nvidia/g3tozi5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599153390.0
    },
    {
        "author": "wearsgreensometimes",
        "body": "I sold 40 of those 0.80 contracts. doubled my money from that morning based off a tip here (should have tripled, but missed a good buy). basically rode the Tiger Lake chipset talk hype, sold before they dipped back down (but were still up 50%). \n\nI hope yall do well but used to work at a company in that industry and I don’t know how much it will actually rise beyond that based off what I remember. Intel is a boomer tech stock like IBM, Cisco, and Lenovo...of course they could always pull off an MSFT type revival but who knows",
        "created_utc": 1599132779,
        "id": "g3ty85v",
        "permalink": "/r/wallstreetbets/comments/ilcywi/intc_gang_wya_intc_918_50c_56c/g3ty85v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599161579.0
    },
    {
        "author": "neekogo",
        "body": "I hear ya. My strategy lately has been similar to you. Well known companies (MFST, WM, DIS). A few companies I expect to be making strides in the coming years (IBM, CSCO, CVS). A few risk shots (F, AFL,T). And a couple of solid ETFs to round it out. Yesterday I was 16% up. Right now I'm still 8% 😄",
        "created_utc": 1599147602,
        "id": "g3uyesm",
        "permalink": "/r/investing/comments/ilgy50/finally_got_a_stake_in_aapl/g3uyesm/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599176402.0
    },
    {
        "author": "MaximusHippocratus",
        "body": "IBM boys. It just pumped after a bull flag forming for weeks. IV is still low. Get in while you can. Before the COVID crash it was pumping. Hasn't cut dividend through the pandemic.",
        "created_utc": 1599075222,
        "id": "g3rb57y",
        "permalink": "/r/wallstreetbets/comments/il43tr/daily_discussion_thread_for_september_02_2020/g3rb57y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599104022.0
    },
    {
        "author": "Flaky-Bad9954",
        "body": "Oh I didn't make it clear. I am not saying only MSFT will be replaced. I think all the giant tech you see today will be replaced... Like how IBM was being replaced...",
        "created_utc": 1599177459,
        "id": "g3xcd8q",
        "permalink": "/r/stocks/comments/iltt53/are_we_in_a_covidtech_bubble_heres_how_to_tell_my/g3xcd8q/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599206259.0
    },
    {
        "author": "Turtlesaur",
        "body": "Lol by who, IBM?",
        "created_utc": 1599078818,
        "id": "g3rl5zb",
        "permalink": "/r/wallstreetbets/comments/ilege0/what_are_your_moves_tomorrow_september_03_2020/g3rl5zb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599107618.0
    },
    {
        "author": "hidden-carrot",
        "body": "ARKK\nBABA\nBUD\nCARR\nCZR\nIBM\nMJ\nMSFT\nNFLX\nPlanet 13\nSE\nTSM\nVGT\nVTI\nWMT\nXLY",
        "created_utc": 1598979893,
        "id": "g3m17ni",
        "permalink": "/r/stocks/comments/ikj1y5/rate_my_portfolio_rstocks_quarterly_thread/g3m17ni/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1599008693.0
    },
    {
        "author": "a_nobody_really_99",
        "body": "Well, I’d have to say Cisco is doing much better than IBM and continues to do so.",
        "created_utc": 1598969356,
        "id": "g3l8l0d",
        "permalink": "/r/investing/comments/ijzxrp/tesla_opens_up_at_440_post_split_and_soars_12_to/g3l8l0d/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598998156.0
    },
    {
        "author": "r3dd1t0rxzxzx",
        "body": "Saying “they all have software” shows how little understanding you have of each automakers level of capability and focus. It’s like saying Microsoft and IBM both do software so whatever - pretty crazy conclusion.",
        "created_utc": 1598997594,
        "id": "g3nbu81",
        "permalink": "/r/investing/comments/ik4ehw/tsla_is_now_the_tenthlargest_company_via_market/g3nbu81/",
        "score": 1,
        "subreddit": "investing",
        "created": 1599026394.0
    },
    {
        "author": "sc0tt_1990",
        "body": "Their new chip is a redux of the AMD FX series.  It's hilarious how things have come full circle.  Wonder if you can cook an egg on it.\n\nIntel is a shit company now.  IBM 2.0 until proven otherwise.  They don't spend on R and D, look it up, don't just listen to me.  Or hell, look at how AMD is going to eat their lunch 6 months from now when Ryzen 4 is out.",
        "created_utc": 1598998457,
        "id": "g3ndvjo",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3ndvjo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599027257.0
    },
    {
        "author": "TrenAndOptions",
        "body": "Look up IBM quantum computing, Redhat acquisition, cloud, software business transition from their legacy hardware business",
        "created_utc": 1599025859,
        "id": "g3orvyc",
        "permalink": "/r/wallstreetbets/comments/ikrr8t/what_are_your_moves_tomorrow_september_02_2020/g3orvyc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599054659.0
    },
    {
        "author": "Troll_Sauce",
        "body": "Buy them out a ways so you have some flexibility. Er is a huge wildcard. I still think it's primed for an IBM acquisition sooner or later.",
        "created_utc": 1599026970,
        "id": "g3ot5xn",
        "permalink": "/r/wallstreetbets/comments/ikm425/techcalls_are_easy_gains/g3ot5xn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599055770.0
    },
    {
        "author": "Wearahat02",
        "body": "Not sure but the market thinks it will\nThey did quadruple their revenues YoY and double their revenues QoQ.\n\nIf they can maintain this rate of growth for just one year, their revenues will be 7.5billion next FY\n\nTheir operating expenses are ridiculously low I guess it doesn't take much to run a video conference app\n\nThat means 3 billion net income in 2 years\n\nGrowth can't be that easy can it? \n\nLiterally a company that earned 5 million last comparative quarter, earns 186mil this quarter and at this rate possibly almost 1 billion next years quarter.\n\nAlso I'm amazed that companies that have been around for a long time like Boeing, IBM, Starbucks, Lockheed, 3M, American Express, Citigroup are smaller than a video conferencing company that was worth just 17bn last year.",
        "created_utc": 1598970260,
        "id": "g3laybc",
        "permalink": "/r/stocks/comments/ikgc75/rstocks_daily_discussion_technicals_tuesday_sep/g3laybc/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598999060.0
    },
    {
        "author": "laken906",
        "body": "FSLY, MSFT, RKT, SOXL, SPY, SE, IAU, INTC, VXX calls\n\nUUP puts\n\n10 for 10 premarket. Should prolly simplify the portfolio while I'm ahead this morning...",
        "created_utc": 1598962618,
        "id": "g3ktsg0",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ktsg0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598991418.0
    },
    {
        "author": "pervsensei11",
        "body": "Have TSLA, NVDA, PINS, NFLX, WORK, ZM, INTC calls and spreads\n\nCan’t wait for premarket",
        "created_utc": 1598945876,
        "id": "g3kc8l7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kc8l7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598974676.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing like a rebranding thing",
        "created_utc": 1598952960,
        "id": "g3kim3q",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kim3q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598981760.0
    },
    {
        "author": "REDmonster333",
        "body": "Intel. Even though it looks bleak short term. But long term they will still pull through. They have 10+ years of dominance, I doubt they wont catch up.",
        "created_utc": 1598952851,
        "id": "g3kiik2",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kiik2/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1598981651.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "It’s not gonna happen but if INTC gaps up to $60 I get the WSB logo tattooed. This isn’t even a bet. This is a goal.",
        "created_utc": 1598954092,
        "id": "g3kjn5f",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjn5f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982892.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC is up to $51.30 for +0.69% rn",
        "created_utc": 1598953629,
        "id": "g3kj7z9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kj7z9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982429.0
    },
    {
        "author": "HinduHamma",
        "body": "Thank god I ignored all you intel pumping clowns and bought nvda instead.",
        "created_utc": 1598968574,
        "id": "g3l6lsd",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l6lsd/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598997374.0
    },
    {
        "author": "ProPenguin800",
        "body": "Who else is playing Intel?",
        "created_utc": 1598946830,
        "id": "g3kd4xs",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd4xs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598975630.0
    },
    {
        "author": "_ddeeezzzz",
        "body": "Truly hope some of you jumped on this NVDA train, shit is going to the next solar system, fuck the moon. Not too late they have a press event at 12est will probably spike on that as well... my earlier hope was 550 eow, now I have to roll up and out to maybe 600. \n\nAlso, I’d buy intel 50$ weekly calls on this slight AM dip, thank me later. \nBig options activity, new processor release wed, tech hype.",
        "created_utc": 1598969394,
        "id": "g3l8oln",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l8oln/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598998194.0
    },
    {
        "author": "Bellweirboy",
        "body": "EVERYTHING is up except Intel and Tesla. Everything. What am  I holding.......",
        "created_utc": 1598968894,
        "id": "g3l7f7v",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7f7v/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598997694.0
    },
    {
        "author": "ztw2002",
        "body": "oooooof Intel is fucked again",
        "created_utc": 1598967402,
        "id": "g3l3kpa",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3kpa/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996202.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "This AMD cuck is big mad NVDA GPU cards are better than AMDs. Stick with your CPU cuck , just because they beat boomer intel doesn't mean they can beat Leatherman.",
        "created_utc": 1598969547,
        "id": "g3l92k3",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l92k3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598998347.0
    },
    {
        "author": "pg209",
        "body": "Nice dip in most tech stocks\n\nGoing in on INTC, FTNT, MU, AMD\n\nAlso thinking of calls on WORK, they have earnings release next week, should be a good run-up",
        "created_utc": 1598967669,
        "id": "g3l49nk",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l49nk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996469.0
    },
    {
        "author": "august_thecow",
        "body": "INTC is severely underbought... might buy more calls at open before the announcement",
        "created_utc": 1598960784,
        "id": "g3kqmuf",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kqmuf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598989584.0
    },
    {
        "author": "Davidkanye",
        "body": "I mean, I’ve been watching past earnings plays and there’s still time Imo. \n\nAdditionally eyeing INTC. \n\nCurrent play are post earnings: ESTC, INTU, AMGN",
        "created_utc": 1598947233,
        "id": "g3kdic9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdic9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598976033.0
    },
    {
        "author": "NervousTumbleweed",
        "body": " Ha ha wow Intel that was so funny, you sure had me going there with that dip. Probably should get back to going up though, right? haha.",
        "created_utc": 1598967875,
        "id": "g3l4sec",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l4sec/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996675.0
    },
    {
        "author": "Infernal-Affairs",
        "body": "if INTC hits $60 before eow\n\nI'll just sell my calls or something idk",
        "created_utc": 1598954353,
        "id": "g3kjvtu",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjvtu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598983153.0
    },
    {
        "author": "GamblingMikkee",
        "body": "JPM, CVS, INTC, MO, WBA. Almost all single digits",
        "created_utc": 1598957426,
        "id": "g3kmu1x",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kmu1x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598986226.0
    },
    {
        "author": "sven2123",
        "body": "I agree. Intel is cheap right now and will go back up once they smoothe out operations",
        "created_utc": 1598958975,
        "id": "g3kog5j",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kog5j/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598987775.0
    },
    {
        "author": "lord_v0ldemort",
        "body": "Gj buying fucking intel and somehow thinking ur better at tech than Buffett while he rakes in  mounds of cash from his Apple stake\n\nUr up like 2% and he’s up like 400% but somehow you shit on him lol u clown",
        "created_utc": 1598968132,
        "id": "g3l5gbk",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3l5gbk/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598996932.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Ffs lord please just have INTC pop like it did the week of May 12th",
        "created_utc": 1598969177,
        "id": "g3l83vu",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l83vu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598997977.0
    },
    {
        "author": "therealsparticus",
        "body": "AMD has already priced in half the growth of intel. Intel is their competition and is not a wimp.",
        "created_utc": 1598964236,
        "id": "g3kws71",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kws71/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993036.0
    },
    {
        "author": "DukeOfEarle88",
        "body": "AMD is going to get Intel this year- &amp; then quantum computers ftw.",
        "created_utc": 1598965074,
        "id": "g3kyeyx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kyeyx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993874.0
    },
    {
        "author": "DerTagestrinker",
        "body": "AMD will more than double within a year. It’s cap is only ~$100b and they are at this point at least two years ahead of Intels processor tech, especially for laptops. Intel has ~70% share so there is massive share for AMD to steal.",
        "created_utc": 1598966380,
        "id": "g3l13s5",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l13s5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995180.0
    },
    {
        "author": "Krakusmaximus",
        "body": "intel is trying to kill itself",
        "created_utc": 1598967466,
        "id": "g3l3qj1",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3qj1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996266.0
    },
    {
        "author": "therealsparticus",
        "body": "All AV companies including the one I work at use Intel. All of the software runs with less bugs on intel, board design support including pretty complex stuff like EM interference is way better from Intel. Intel has the best ecosystem despite their failures to catch TSMC on the fab side.\n\nTesla has their own asic instead of a GPU but even they run an intel processor.",
        "created_utc": 1598968656,
        "id": "g3l6tbk",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l6tbk/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598997456.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I dropped another grand into Intel calls.",
        "created_utc": 1598969032,
        "id": "g3l7rem",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7rem/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598997832.0
    },
    {
        "author": "learningtosail",
        "body": "We here at the intel shareholders club thank you for buying our shit from us so we can finally leave this stupid club.  \n\nYou can foot the bill for our class action now :)",
        "created_utc": 1598968025,
        "id": "g3l56kg",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l56kg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996825.0
    },
    {
        "author": "PattayaGuy",
        "body": "AMD def has a ton of market share to eat away at. They're being aggressive in their road map and pushing forward while intel is jerking off in the corner. If AMD could deliver a beast GPU to match its Ryzen CPU's, they'd shoot straight up. NVidia isn't as lazy as intel though.",
        "created_utc": 1598963942,
        "id": "g3kw8b6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kw8b6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992742.0
    },
    {
        "author": "Cygopat",
        "body": "The only thing fundamentals do for you in this market is limit downside. There are very little plays for that available. Two weeks ago I bought INTC at $49. Buffett should have gotten into that but I guess it's not within his CoC.",
        "created_utc": 1598964026,
        "id": "g3kwe2p",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3kwe2p/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598992826.0
    },
    {
        "author": "Billionairess",
        "body": "Intel",
        "created_utc": 1598949028,
        "id": "g3kf4vt",
        "permalink": "/r/StockMarket/comments/ik3l3n/which_stocks_are_still_under_valued/g3kf4vt/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598977828.0
    },
    {
        "author": "R4N7",
        "body": "Oh I guess you’re diversified enough to not worrry. If RDSB is more then 5% of your portfolio you might sell half just to lower the risks and then buy again when you will see stock starting rebound. Actually I am in similar position with INTC (currently -9%) I am not buying more and not selling I am just holding without any actions. Time will show.",
        "created_utc": 1598960919,
        "id": "g3kquq2",
        "permalink": "/r/stocks/comments/ikhmdd/rdsb_shell_what_is_happening_to_the_price/g3kquq2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598989719.0
    },
    {
        "author": "Johnnyrocket47",
        "body": "Intc 50c 11/20",
        "created_utc": 1598946920,
        "id": "g3kd7wf",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd7wf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975720.0
    },
    {
        "author": "coachellathrowaway42",
        "body": "Intel 9/28 $50.5 C",
        "created_utc": 1598947689,
        "id": "g3kdxi7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdxi7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598976489.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC 1/15/21 $50c",
        "created_utc": 1598947104,
        "id": "g3kde04",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kde04/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975904.0
    },
    {
        "author": "Duke_of_Scotty",
        "body": "Did you see the part about Intel options. He's on track to learn that the first one is always free",
        "created_utc": 1598963542,
        "id": "g3kvh7d",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kvh7d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598992342.0
    },
    {
        "author": "Bellweirboy",
        "body": "Anyone bagholding Intel?",
        "created_utc": 1598963153,
        "id": "g3kur97",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kur97/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991953.0
    },
    {
        "author": "imsoepicxd",
        "body": "Bleeding a bit on my INTC 55c 10/16 gamble. Hope my RKT calls print. Thinking of opening a position for DOCU but not sure yet.",
        "created_utc": 1598969342,
        "id": "g3l8jqi",
        "permalink": "/r/smallstreetbets/comments/ikil53/daily_market_discussion_thread_tuesday_september/g3l8jqi/",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1598998142.0
    },
    {
        "author": "WoodWoodClepper",
        "body": "Fuck off INTC",
        "created_utc": 1598970094,
        "id": "g3lahyr",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3lahyr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998894.0
    },
    {
        "author": "F1shB0wl816",
        "body": "Nio is one I’m hoping to explode but I figured there’s a lot of potential in the arkks too, a lot of that has a future and is still in complete infancy, it’s just a matter of what. Picking something that explodes like that will be a lucky pick though, some of it’s not even rational right now. \n\nI still think tsla, amd, and nvda have places to go though. Musk is just full of ideas, if 1 pans out for every 100, that could shake up the world as we know it. Amd will take over intels market eventually, they’re a head of the game, younger, fresher, intel just seems dated to me, lacking, it got high off its success and hasn’t thought straight since. Nvda is still making moves and growing fast and they have a handful of nice deals coming in the next few years.",
        "created_utc": 1598961463,
        "id": "g3krrgy",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krrgy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990263.0
    },
    {
        "author": "Berrymore13",
        "body": "Well my open is shaping up to be good. Holding NVDA, WORK, PINS, and INTC calls 🥰🤑",
        "created_utc": 1598964699,
        "id": "g3kxo8g",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kxo8g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993499.0
    },
    {
        "author": "Spaceseeds",
        "body": "Anybody who asks why intel has never looked at the fact that intel dominates the enterprise market and none of them are going to switch to AMD. The numbers are staggering. Intel has like over 80% of the market. They could outsource their chips and still be more successful than AMD. This doesn't even get into the rest of their business. I feel like Intel is a buy right now.",
        "created_utc": 1598964626,
        "id": "g3kxj41",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kxj41/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993426.0
    },
    {
        "author": "candidly1",
        "body": "AMD R&amp;D budget 1.5B\n\n\nINTC R&amp;D Budget  $13.3B\n\n\n\"jerking off\"",
        "created_utc": 1598965740,
        "id": "g3kzr0n",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kzr0n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598994540.0
    },
    {
        "author": "HBK05",
        "body": "uh..buy low sell high? Intel has been in charge of a lot of their market for the past 10+ years, they are only lacking behind for the past couple of years. I fully believe in their ability to bounce back eventually and compete with amd, hopefully pushing innovation and price/performance for consumer computers to the moon, but for now it's time to wait and see if they can pull it.",
        "created_utc": 1598963603,
        "id": "g3kvl5a",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kvl5a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992403.0
    },
    {
        "author": "FattySquirrelDaddy",
        "body": "What’s going on with INTC?",
        "created_utc": 1598967192,
        "id": "g3l3129",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3129/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598995992.0
    },
    {
        "author": "bicameral_mind",
        "body": "INTC just can't take two steps forward without another step back.",
        "created_utc": 1598967875,
        "id": "g3l4sdx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l4sdx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996675.0
    },
    {
        "author": "WagieInTheCagie",
        "body": "INTC crying in the corner while all the other stonks are having an orgy. FeelsBadMan",
        "created_utc": 1598969401,
        "id": "g3l8pbc",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l8pbc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998201.0
    },
    {
        "author": "therealsparticus",
        "body": "Anyone who has to deal with bare level cpu will tell you how good their engineering support is. Intel runs on ecosystem fuel. It’s their most.",
        "created_utc": 1598964055,
        "id": "g3kwfy6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kwfy6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992855.0
    },
    {
        "author": "v0lati1e",
        "body": "Intc wtf",
        "created_utc": 1598967378,
        "id": "g3l3ijw",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3ijw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996178.0
    },
    {
        "author": "FindtheTruth5",
        "body": "Any chance for Intel to actually have a good day?",
        "created_utc": 1598969853,
        "id": "g3l9vov",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l9vov/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998653.0
    },
    {
        "author": "Zouk11",
        "body": "To add to this, i may be wrong but, I've seen many articles about Apple wanting to switch over their Mac CPUs from Intel to AMD, which makes sense for AMD to continue rising if a deal gets put into place with AMD and Apple.",
        "created_utc": 1598969863,
        "id": "g3l9wlb",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l9wlb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598998663.0
    },
    {
        "author": "SealCub-ClubbingClub",
        "body": "They still have massive market shares in sectors that they will be behind on for at least 2 years.\n\nIf that market share is significantly eroded before they get 7nm (with actual decent yields) then I think they could dip significantly.\n\nI think Intel is actually quite expensive right now. Their share price is around 2018, 2019 levels but their outlook for the next year or 2 is significantly worse than it was then. Maybe that's confidence in the 3+ year vision or maybe it's the market not discounting properly.",
        "created_utc": 1598968206,
        "id": "g3l5nar",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l5nar/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598997006.0
    },
    {
        "author": "arcarsen",
        "body": "INTC tiger lake release... will it release the tendies too?",
        "created_utc": 1598969126,
        "id": "g3l7yra",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7yra/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598997926.0
    },
    {
        "author": "sleepyguy007",
        "body": "intel, cisco, qualcomm, juniper etc were all huge bubble stocks in the tech bubble and were making tons of money.  \n\n\nThis tech bubble is just as bad and the same sort of mix of unprofitable companies, profitable overvalued companies, and now people just trying to cash out as fast as possible via SPACs and IPOs as there was then.  It might not be quite as steep a bubble yet, but its definitely getting there.  it took 4 years to go from 1200 -&gt; 5000 in 2000.   4 years ago the nasdaq was 5000 or so, so I could see it gettingto even 15000 and then crashing.  maybe not quite as big, but still as someone above mentioned economic conditions are far far worse now and we have much more debt than we did in 2000 as a nation",
        "created_utc": 1598955614,
        "id": "g3kl2if",
        "permalink": "/r/stocks/comments/ik5vev/why_the_stock_market_is_disconnected_from_the/g3kl2if/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598984414.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing  like a rebranding thing",
        "created_utc": 1598953918,
        "id": "g3kjhgx",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjhgx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598982718.0
    },
    {
        "author": "Started-Late",
        "body": "I’m calling it boys, $60 on Intel by 9/18",
        "created_utc": 1598963125,
        "id": "g3kupgv",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kupgv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991925.0
    },
    {
        "author": "ShankThatSnitch",
        "body": "Yeah, but you also aren't responsible for other peoples money, and got lucky. What if NVDA pulled an INTC and ate shit over night?",
        "created_utc": 1598967155,
        "id": "g3l2xrg",
        "permalink": "/r/wallstreetbets/comments/ik2vki/rip_to_the_guy_who_took_out_a_15k_loan_for_30k_in/g3l2xrg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598995955.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Intel gonna absolutely fuck me 🥺",
        "created_utc": 1598967217,
        "id": "g3l33gz",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l33gz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996017.0
    },
    {
        "author": "DWINGMAN97",
        "body": "Very nice! I got in INTC yesterday after doing some TA and it looks really solid for continuation over the next month or so!",
        "created_utc": 1598965880,
        "id": "g3l014e",
        "permalink": "/r/StockMarket/comments/ikjue5/analysis_paralysis_hour_daily_market_insights/g3l014e/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598994680.0
    },
    {
        "author": "needcshelp1234",
        "body": "Buy amd options. Ever since Amd was more expensive than intc people have been saying buy intel",
        "created_utc": 1598965827,
        "id": "g3kzx89",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kzx89/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598994627.0
    },
    {
        "author": "almostmicrochip",
        "body": "INTEL entry point LOCATED\n\n\n\nENGAGE",
        "created_utc": 1598967498,
        "id": "g3l3thl",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3thl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996298.0
    },
    {
        "author": "enricosusatyo",
        "body": "Seriously, I’ve been an Intel shareholder for 5 years, and to be honest it’s not looking good for the company right now. \n\nIt’s cheap, I agree. But they gonna have to work hard to catch up to competitors.",
        "created_utc": 1598966807,
        "id": "g3l24hv",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l24hv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995607.0
    },
    {
        "author": "StonkGoUp",
        "body": "Annnnddd I’m down 25% on INTC already",
        "created_utc": 1598967259,
        "id": "g3l37fd",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l37fd/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1598996059.0
    },
    {
        "author": "laken906",
        "body": "FSLY, MSFT, RKT, SOXL, SPY, SE, IAU, INTC, VXX calls\n\nUUP puts\n\n10 for 10 premarket. Should prolly simplify the portfolio while I'm ahead this morning...",
        "created_utc": 1598962618,
        "id": "g3ktsg0",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ktsg0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598991418.0
    },
    {
        "author": "pervsensei11",
        "body": "Have TSLA, NVDA, PINS, NFLX, WORK, ZM, INTC calls and spreads\n\nCan’t wait for premarket",
        "created_utc": 1598945876,
        "id": "g3kc8l7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kc8l7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598974676.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing like a rebranding thing",
        "created_utc": 1598952960,
        "id": "g3kim3q",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kim3q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598981760.0
    },
    {
        "author": "REDmonster333",
        "body": "Intel. Even though it looks bleak short term. But long term they will still pull through. They have 10+ years of dominance, I doubt they wont catch up.",
        "created_utc": 1598952851,
        "id": "g3kiik2",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kiik2/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1598981651.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "It’s not gonna happen but if INTC gaps up to $60 I get the WSB logo tattooed. This isn’t even a bet. This is a goal.",
        "created_utc": 1598954092,
        "id": "g3kjn5f",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjn5f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982892.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC is up to $51.30 for +0.69% rn",
        "created_utc": 1598953629,
        "id": "g3kj7z9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kj7z9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982429.0
    },
    {
        "author": "HinduHamma",
        "body": "Thank god I ignored all you intel pumping clowns and bought nvda instead.",
        "created_utc": 1598968574,
        "id": "g3l6lsd",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l6lsd/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598997374.0
    },
    {
        "author": "ProPenguin800",
        "body": "Who else is playing Intel?",
        "created_utc": 1598946830,
        "id": "g3kd4xs",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd4xs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598975630.0
    },
    {
        "author": "_ddeeezzzz",
        "body": "Truly hope some of you jumped on this NVDA train, shit is going to the next solar system, fuck the moon. Not too late they have a press event at 12est will probably spike on that as well... my earlier hope was 550 eow, now I have to roll up and out to maybe 600. \n\nAlso, I’d buy intel 50$ weekly calls on this slight AM dip, thank me later. \nBig options activity, new processor release wed, tech hype.",
        "created_utc": 1598969394,
        "id": "g3l8oln",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l8oln/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598998194.0
    },
    {
        "author": "Bellweirboy",
        "body": "EVERYTHING is up except Intel and Tesla. Everything. What am  I holding.......",
        "created_utc": 1598968894,
        "id": "g3l7f7v",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7f7v/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598997694.0
    },
    {
        "author": "ztw2002",
        "body": "oooooof Intel is fucked again",
        "created_utc": 1598967402,
        "id": "g3l3kpa",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3kpa/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996202.0
    },
    {
        "author": "ODNI_NSA_FBI_CIA_DIA",
        "body": "This AMD cuck is big mad NVDA GPU cards are better than AMDs. Stick with your CPU cuck , just because they beat boomer intel doesn't mean they can beat Leatherman.",
        "created_utc": 1598969547,
        "id": "g3l92k3",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l92k3/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598998347.0
    },
    {
        "author": "pg209",
        "body": "Nice dip in most tech stocks\n\nGoing in on INTC, FTNT, MU, AMD\n\nAlso thinking of calls on WORK, they have earnings release next week, should be a good run-up",
        "created_utc": 1598967669,
        "id": "g3l49nk",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l49nk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996469.0
    },
    {
        "author": "august_thecow",
        "body": "INTC is severely underbought... might buy more calls at open before the announcement",
        "created_utc": 1598960784,
        "id": "g3kqmuf",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kqmuf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598989584.0
    },
    {
        "author": "Davidkanye",
        "body": "I mean, I’ve been watching past earnings plays and there’s still time Imo. \n\nAdditionally eyeing INTC. \n\nCurrent play are post earnings: ESTC, INTU, AMGN",
        "created_utc": 1598947233,
        "id": "g3kdic9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdic9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598976033.0
    },
    {
        "author": "NervousTumbleweed",
        "body": " Ha ha wow Intel that was so funny, you sure had me going there with that dip. Probably should get back to going up though, right? haha.",
        "created_utc": 1598967875,
        "id": "g3l4sec",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l4sec/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598996675.0
    },
    {
        "author": "Infernal-Affairs",
        "body": "if INTC hits $60 before eow\n\nI'll just sell my calls or something idk",
        "created_utc": 1598954353,
        "id": "g3kjvtu",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjvtu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598983153.0
    },
    {
        "author": "GamblingMikkee",
        "body": "JPM, CVS, INTC, MO, WBA. Almost all single digits",
        "created_utc": 1598957426,
        "id": "g3kmu1x",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kmu1x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598986226.0
    },
    {
        "author": "sven2123",
        "body": "I agree. Intel is cheap right now and will go back up once they smoothe out operations",
        "created_utc": 1598958975,
        "id": "g3kog5j",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kog5j/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598987775.0
    },
    {
        "author": "lord_v0ldemort",
        "body": "Gj buying fucking intel and somehow thinking ur better at tech than Buffett while he rakes in  mounds of cash from his Apple stake\n\nUr up like 2% and he’s up like 400% but somehow you shit on him lol u clown",
        "created_utc": 1598968132,
        "id": "g3l5gbk",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3l5gbk/",
        "score": 2,
        "subreddit": "investing",
        "created": 1598996932.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Ffs lord please just have INTC pop like it did the week of May 12th",
        "created_utc": 1598969177,
        "id": "g3l83vu",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l83vu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598997977.0
    },
    {
        "author": "therealsparticus",
        "body": "AMD has already priced in half the growth of intel. Intel is their competition and is not a wimp.",
        "created_utc": 1598964236,
        "id": "g3kws71",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kws71/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993036.0
    },
    {
        "author": "DukeOfEarle88",
        "body": "AMD is going to get Intel this year- &amp; then quantum computers ftw.",
        "created_utc": 1598965074,
        "id": "g3kyeyx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kyeyx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993874.0
    },
    {
        "author": "DerTagestrinker",
        "body": "AMD will more than double within a year. It’s cap is only ~$100b and they are at this point at least two years ahead of Intels processor tech, especially for laptops. Intel has ~70% share so there is massive share for AMD to steal.",
        "created_utc": 1598966380,
        "id": "g3l13s5",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l13s5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995180.0
    },
    {
        "author": "Krakusmaximus",
        "body": "intel is trying to kill itself",
        "created_utc": 1598967466,
        "id": "g3l3qj1",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3qj1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996266.0
    },
    {
        "author": "therealsparticus",
        "body": "All AV companies including the one I work at use Intel. All of the software runs with less bugs on intel, board design support including pretty complex stuff like EM interference is way better from Intel. Intel has the best ecosystem despite their failures to catch TSMC on the fab side.\n\nTesla has their own asic instead of a GPU but even they run an intel processor.",
        "created_utc": 1598968656,
        "id": "g3l6tbk",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l6tbk/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598997456.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I dropped another grand into Intel calls.",
        "created_utc": 1598969032,
        "id": "g3l7rem",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7rem/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598997832.0
    },
    {
        "author": "learningtosail",
        "body": "We here at the intel shareholders club thank you for buying our shit from us so we can finally leave this stupid club.  \n\nYou can foot the bill for our class action now :)",
        "created_utc": 1598968025,
        "id": "g3l56kg",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l56kg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996825.0
    },
    {
        "author": "PattayaGuy",
        "body": "AMD def has a ton of market share to eat away at. They're being aggressive in their road map and pushing forward while intel is jerking off in the corner. If AMD could deliver a beast GPU to match its Ryzen CPU's, they'd shoot straight up. NVidia isn't as lazy as intel though.",
        "created_utc": 1598963942,
        "id": "g3kw8b6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kw8b6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992742.0
    },
    {
        "author": "Cygopat",
        "body": "The only thing fundamentals do for you in this market is limit downside. There are very little plays for that available. Two weeks ago I bought INTC at $49. Buffett should have gotten into that but I guess it's not within his CoC.",
        "created_utc": 1598964026,
        "id": "g3kwe2p",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3kwe2p/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598992826.0
    },
    {
        "author": "Billionairess",
        "body": "Intel",
        "created_utc": 1598949028,
        "id": "g3kf4vt",
        "permalink": "/r/StockMarket/comments/ik3l3n/which_stocks_are_still_under_valued/g3kf4vt/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598977828.0
    },
    {
        "author": "R4N7",
        "body": "Oh I guess you’re diversified enough to not worrry. If RDSB is more then 5% of your portfolio you might sell half just to lower the risks and then buy again when you will see stock starting rebound. Actually I am in similar position with INTC (currently -9%) I am not buying more and not selling I am just holding without any actions. Time will show.",
        "created_utc": 1598960919,
        "id": "g3kquq2",
        "permalink": "/r/stocks/comments/ikhmdd/rdsb_shell_what_is_happening_to_the_price/g3kquq2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598989719.0
    },
    {
        "author": "Johnnyrocket47",
        "body": "Intc 50c 11/20",
        "created_utc": 1598946920,
        "id": "g3kd7wf",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd7wf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975720.0
    },
    {
        "author": "coachellathrowaway42",
        "body": "Intel 9/28 $50.5 C",
        "created_utc": 1598947689,
        "id": "g3kdxi7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdxi7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598976489.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC 1/15/21 $50c",
        "created_utc": 1598947104,
        "id": "g3kde04",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kde04/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975904.0
    },
    {
        "author": "Duke_of_Scotty",
        "body": "Did you see the part about Intel options. He's on track to learn that the first one is always free",
        "created_utc": 1598963542,
        "id": "g3kvh7d",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kvh7d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598992342.0
    },
    {
        "author": "Bellweirboy",
        "body": "Anyone bagholding Intel?",
        "created_utc": 1598963153,
        "id": "g3kur97",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kur97/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991953.0
    },
    {
        "author": "imsoepicxd",
        "body": "Bleeding a bit on my INTC 55c 10/16 gamble. Hope my RKT calls print. Thinking of opening a position for DOCU but not sure yet.",
        "created_utc": 1598969342,
        "id": "g3l8jqi",
        "permalink": "/r/smallstreetbets/comments/ikil53/daily_market_discussion_thread_tuesday_september/g3l8jqi/",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1598998142.0
    },
    {
        "author": "WoodWoodClepper",
        "body": "Fuck off INTC",
        "created_utc": 1598970094,
        "id": "g3lahyr",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3lahyr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998894.0
    },
    {
        "author": "F1shB0wl816",
        "body": "Nio is one I’m hoping to explode but I figured there’s a lot of potential in the arkks too, a lot of that has a future and is still in complete infancy, it’s just a matter of what. Picking something that explodes like that will be a lucky pick though, some of it’s not even rational right now. \n\nI still think tsla, amd, and nvda have places to go though. Musk is just full of ideas, if 1 pans out for every 100, that could shake up the world as we know it. Amd will take over intels market eventually, they’re a head of the game, younger, fresher, intel just seems dated to me, lacking, it got high off its success and hasn’t thought straight since. Nvda is still making moves and growing fast and they have a handful of nice deals coming in the next few years.",
        "created_utc": 1598961463,
        "id": "g3krrgy",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krrgy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990263.0
    },
    {
        "author": "Berrymore13",
        "body": "Well my open is shaping up to be good. Holding NVDA, WORK, PINS, and INTC calls 🥰🤑",
        "created_utc": 1598964699,
        "id": "g3kxo8g",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kxo8g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993499.0
    },
    {
        "author": "Spaceseeds",
        "body": "Anybody who asks why intel has never looked at the fact that intel dominates the enterprise market and none of them are going to switch to AMD. The numbers are staggering. Intel has like over 80% of the market. They could outsource their chips and still be more successful than AMD. This doesn't even get into the rest of their business. I feel like Intel is a buy right now.",
        "created_utc": 1598964626,
        "id": "g3kxj41",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kxj41/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993426.0
    },
    {
        "author": "candidly1",
        "body": "AMD R&amp;D budget 1.5B\n\n\nINTC R&amp;D Budget  $13.3B\n\n\n\"jerking off\"",
        "created_utc": 1598965740,
        "id": "g3kzr0n",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kzr0n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598994540.0
    },
    {
        "author": "HBK05",
        "body": "uh..buy low sell high? Intel has been in charge of a lot of their market for the past 10+ years, they are only lacking behind for the past couple of years. I fully believe in their ability to bounce back eventually and compete with amd, hopefully pushing innovation and price/performance for consumer computers to the moon, but for now it's time to wait and see if they can pull it.",
        "created_utc": 1598963603,
        "id": "g3kvl5a",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kvl5a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992403.0
    },
    {
        "author": "FattySquirrelDaddy",
        "body": "What’s going on with INTC?",
        "created_utc": 1598967192,
        "id": "g3l3129",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3129/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598995992.0
    },
    {
        "author": "bicameral_mind",
        "body": "INTC just can't take two steps forward without another step back.",
        "created_utc": 1598967875,
        "id": "g3l4sdx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l4sdx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996675.0
    },
    {
        "author": "WagieInTheCagie",
        "body": "INTC crying in the corner while all the other stonks are having an orgy. FeelsBadMan",
        "created_utc": 1598969401,
        "id": "g3l8pbc",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l8pbc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998201.0
    },
    {
        "author": "therealsparticus",
        "body": "Anyone who has to deal with bare level cpu will tell you how good their engineering support is. Intel runs on ecosystem fuel. It’s their most.",
        "created_utc": 1598964055,
        "id": "g3kwfy6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kwfy6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992855.0
    },
    {
        "author": "v0lati1e",
        "body": "Intc wtf",
        "created_utc": 1598967378,
        "id": "g3l3ijw",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3ijw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996178.0
    },
    {
        "author": "FindtheTruth5",
        "body": "Any chance for Intel to actually have a good day?",
        "created_utc": 1598969853,
        "id": "g3l9vov",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l9vov/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598998653.0
    },
    {
        "author": "Zouk11",
        "body": "To add to this, i may be wrong but, I've seen many articles about Apple wanting to switch over their Mac CPUs from Intel to AMD, which makes sense for AMD to continue rising if a deal gets put into place with AMD and Apple.",
        "created_utc": 1598969863,
        "id": "g3l9wlb",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l9wlb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598998663.0
    },
    {
        "author": "SealCub-ClubbingClub",
        "body": "They still have massive market shares in sectors that they will be behind on for at least 2 years.\n\nIf that market share is significantly eroded before they get 7nm (with actual decent yields) then I think they could dip significantly.\n\nI think Intel is actually quite expensive right now. Their share price is around 2018, 2019 levels but their outlook for the next year or 2 is significantly worse than it was then. Maybe that's confidence in the 3+ year vision or maybe it's the market not discounting properly.",
        "created_utc": 1598968206,
        "id": "g3l5nar",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l5nar/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598997006.0
    },
    {
        "author": "arcarsen",
        "body": "INTC tiger lake release... will it release the tendies too?",
        "created_utc": 1598969126,
        "id": "g3l7yra",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l7yra/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598997926.0
    },
    {
        "author": "sleepyguy007",
        "body": "intel, cisco, qualcomm, juniper etc were all huge bubble stocks in the tech bubble and were making tons of money.  \n\n\nThis tech bubble is just as bad and the same sort of mix of unprofitable companies, profitable overvalued companies, and now people just trying to cash out as fast as possible via SPACs and IPOs as there was then.  It might not be quite as steep a bubble yet, but its definitely getting there.  it took 4 years to go from 1200 -&gt; 5000 in 2000.   4 years ago the nasdaq was 5000 or so, so I could see it gettingto even 15000 and then crashing.  maybe not quite as big, but still as someone above mentioned economic conditions are far far worse now and we have much more debt than we did in 2000 as a nation",
        "created_utc": 1598955614,
        "id": "g3kl2if",
        "permalink": "/r/stocks/comments/ik5vev/why_the_stock_market_is_disconnected_from_the/g3kl2if/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598984414.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing  like a rebranding thing",
        "created_utc": 1598953918,
        "id": "g3kjhgx",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjhgx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598982718.0
    },
    {
        "author": "Started-Late",
        "body": "I’m calling it boys, $60 on Intel by 9/18",
        "created_utc": 1598963125,
        "id": "g3kupgv",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kupgv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991925.0
    },
    {
        "author": "ShankThatSnitch",
        "body": "Yeah, but you also aren't responsible for other peoples money, and got lucky. What if NVDA pulled an INTC and ate shit over night?",
        "created_utc": 1598967155,
        "id": "g3l2xrg",
        "permalink": "/r/wallstreetbets/comments/ik2vki/rip_to_the_guy_who_took_out_a_15k_loan_for_30k_in/g3l2xrg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598995955.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Intel gonna absolutely fuck me 🥺",
        "created_utc": 1598967217,
        "id": "g3l33gz",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l33gz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996017.0
    },
    {
        "author": "DWINGMAN97",
        "body": "Very nice! I got in INTC yesterday after doing some TA and it looks really solid for continuation over the next month or so!",
        "created_utc": 1598965880,
        "id": "g3l014e",
        "permalink": "/r/StockMarket/comments/ikjue5/analysis_paralysis_hour_daily_market_insights/g3l014e/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598994680.0
    },
    {
        "author": "needcshelp1234",
        "body": "Buy amd options. Ever since Amd was more expensive than intc people have been saying buy intel",
        "created_utc": 1598965827,
        "id": "g3kzx89",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kzx89/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598994627.0
    },
    {
        "author": "almostmicrochip",
        "body": "INTEL entry point LOCATED\n\n\n\nENGAGE",
        "created_utc": 1598967498,
        "id": "g3l3thl",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3thl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996298.0
    },
    {
        "author": "enricosusatyo",
        "body": "Seriously, I’ve been an Intel shareholder for 5 years, and to be honest it’s not looking good for the company right now. \n\nIt’s cheap, I agree. But they gonna have to work hard to catch up to competitors.",
        "created_utc": 1598966807,
        "id": "g3l24hv",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l24hv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995607.0
    },
    {
        "author": "StonkGoUp",
        "body": "Annnnddd I’m down 25% on INTC already",
        "created_utc": 1598967259,
        "id": "g3l37fd",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l37fd/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1598996059.0
    },
    {
        "author": "laken906",
        "body": "FSLY, MSFT, RKT, SOXL, SPY, SE, IAU, INTC, VXX calls\n\nUUP puts\n\n10 for 10 premarket. Should prolly simplify the portfolio while I'm ahead this morning...",
        "created_utc": 1598962618,
        "id": "g3ktsg0",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3ktsg0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598991418.0
    },
    {
        "author": "pervsensei11",
        "body": "Have TSLA, NVDA, PINS, NFLX, WORK, ZM, INTC calls and spreads\n\nCan’t wait for premarket",
        "created_utc": 1598945876,
        "id": "g3kc8l7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kc8l7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598974676.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing like a rebranding thing",
        "created_utc": 1598952960,
        "id": "g3kim3q",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kim3q/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1598981760.0
    },
    {
        "author": "REDmonster333",
        "body": "Intel. Even though it looks bleak short term. But long term they will still pull through. They have 10+ years of dominance, I doubt they wont catch up.",
        "created_utc": 1598952851,
        "id": "g3kiik2",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kiik2/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1598981651.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "It’s not gonna happen but if INTC gaps up to $60 I get the WSB logo tattooed. This isn’t even a bet. This is a goal.",
        "created_utc": 1598954092,
        "id": "g3kjn5f",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjn5f/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982892.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC is up to $51.30 for +0.69% rn",
        "created_utc": 1598953629,
        "id": "g3kj7z9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kj7z9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1598982429.0
    },
    {
        "author": "ProPenguin800",
        "body": "Who else is playing Intel?",
        "created_utc": 1598946830,
        "id": "g3kd4xs",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd4xs/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1598975630.0
    },
    {
        "author": "august_thecow",
        "body": "INTC is severely underbought... might buy more calls at open before the announcement",
        "created_utc": 1598960784,
        "id": "g3kqmuf",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kqmuf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598989584.0
    },
    {
        "author": "Davidkanye",
        "body": "I mean, I’ve been watching past earnings plays and there’s still time Imo. \n\nAdditionally eyeing INTC. \n\nCurrent play are post earnings: ESTC, INTU, AMGN",
        "created_utc": 1598947233,
        "id": "g3kdic9",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdic9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598976033.0
    },
    {
        "author": "Infernal-Affairs",
        "body": "if INTC hits $60 before eow\n\nI'll just sell my calls or something idk",
        "created_utc": 1598954353,
        "id": "g3kjvtu",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjvtu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598983153.0
    },
    {
        "author": "GamblingMikkee",
        "body": "JPM, CVS, INTC, MO, WBA. Almost all single digits",
        "created_utc": 1598957426,
        "id": "g3kmu1x",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kmu1x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1598986226.0
    },
    {
        "author": "sven2123",
        "body": "I agree. Intel is cheap right now and will go back up once they smoothe out operations",
        "created_utc": 1598958975,
        "id": "g3kog5j",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kog5j/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1598987775.0
    },
    {
        "author": "therealsparticus",
        "body": "AMD has already priced in half the growth of intel. Intel is their competition and is not a wimp.",
        "created_utc": 1598964236,
        "id": "g3kws71",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kws71/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993036.0
    },
    {
        "author": "DukeOfEarle88",
        "body": "AMD is going to get Intel this year- &amp; then quantum computers ftw.",
        "created_utc": 1598965074,
        "id": "g3kyeyx",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kyeyx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993874.0
    },
    {
        "author": "DerTagestrinker",
        "body": "AMD will more than double within a year. It’s cap is only ~$100b and they are at this point at least two years ahead of Intels processor tech, especially for laptops. Intel has ~70% share so there is massive share for AMD to steal.",
        "created_utc": 1598966380,
        "id": "g3l13s5",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l13s5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995180.0
    },
    {
        "author": "PattayaGuy",
        "body": "AMD def has a ton of market share to eat away at. They're being aggressive in their road map and pushing forward while intel is jerking off in the corner. If AMD could deliver a beast GPU to match its Ryzen CPU's, they'd shoot straight up. NVidia isn't as lazy as intel though.",
        "created_utc": 1598963942,
        "id": "g3kw8b6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kw8b6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992742.0
    },
    {
        "author": "Cygopat",
        "body": "The only thing fundamentals do for you in this market is limit downside. There are very little plays for that available. Two weeks ago I bought INTC at $49. Buffett should have gotten into that but I guess it's not within his CoC.",
        "created_utc": 1598964026,
        "id": "g3kwe2p",
        "permalink": "/r/investing/comments/ikj975/warren_buffett_bubbles_can_last_for_a_long_time/g3kwe2p/",
        "score": 1,
        "subreddit": "investing",
        "created": 1598992826.0
    },
    {
        "author": "Billionairess",
        "body": "Intel",
        "created_utc": 1598949028,
        "id": "g3kf4vt",
        "permalink": "/r/StockMarket/comments/ik3l3n/which_stocks_are_still_under_valued/g3kf4vt/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598977828.0
    },
    {
        "author": "R4N7",
        "body": "Oh I guess you’re diversified enough to not worrry. If RDSB is more then 5% of your portfolio you might sell half just to lower the risks and then buy again when you will see stock starting rebound. Actually I am in similar position with INTC (currently -9%) I am not buying more and not selling I am just holding without any actions. Time will show.",
        "created_utc": 1598960919,
        "id": "g3kquq2",
        "permalink": "/r/stocks/comments/ikhmdd/rdsb_shell_what_is_happening_to_the_price/g3kquq2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598989719.0
    },
    {
        "author": "Johnnyrocket47",
        "body": "Intc 50c 11/20",
        "created_utc": 1598946920,
        "id": "g3kd7wf",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kd7wf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975720.0
    },
    {
        "author": "coachellathrowaway42",
        "body": "Intel 9/28 $50.5 C",
        "created_utc": 1598947689,
        "id": "g3kdxi7",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kdxi7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598976489.0
    },
    {
        "author": "CaptFeelsBad",
        "body": "INTC 1/15/21 $50c",
        "created_utc": 1598947104,
        "id": "g3kde04",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kde04/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598975904.0
    },
    {
        "author": "Duke_of_Scotty",
        "body": "Did you see the part about Intel options. He's on track to learn that the first one is always free",
        "created_utc": 1598963542,
        "id": "g3kvh7d",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kvh7d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598992342.0
    },
    {
        "author": "Bellweirboy",
        "body": "Anyone bagholding Intel?",
        "created_utc": 1598963153,
        "id": "g3kur97",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kur97/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991953.0
    },
    {
        "author": "F1shB0wl816",
        "body": "Nio is one I’m hoping to explode but I figured there’s a lot of potential in the arkks too, a lot of that has a future and is still in complete infancy, it’s just a matter of what. Picking something that explodes like that will be a lucky pick though, some of it’s not even rational right now. \n\nI still think tsla, amd, and nvda have places to go though. Musk is just full of ideas, if 1 pans out for every 100, that could shake up the world as we know it. Amd will take over intels market eventually, they’re a head of the game, younger, fresher, intel just seems dated to me, lacking, it got high off its success and hasn’t thought straight since. Nvda is still making moves and growing fast and they have a handful of nice deals coming in the next few years.",
        "created_utc": 1598961463,
        "id": "g3krrgy",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3krrgy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598990263.0
    },
    {
        "author": "Berrymore13",
        "body": "Well my open is shaping up to be good. Holding NVDA, WORK, PINS, and INTC calls 🥰🤑",
        "created_utc": 1598964699,
        "id": "g3kxo8g",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kxo8g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598993499.0
    },
    {
        "author": "Spaceseeds",
        "body": "Anybody who asks why intel has never looked at the fact that intel dominates the enterprise market and none of them are going to switch to AMD. The numbers are staggering. Intel has like over 80% of the market. They could outsource their chips and still be more successful than AMD. This doesn't even get into the rest of their business. I feel like Intel is a buy right now.",
        "created_utc": 1598964626,
        "id": "g3kxj41",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kxj41/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598993426.0
    },
    {
        "author": "candidly1",
        "body": "AMD R&amp;D budget 1.5B\n\n\nINTC R&amp;D Budget  $13.3B\n\n\n\"jerking off\"",
        "created_utc": 1598965740,
        "id": "g3kzr0n",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kzr0n/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598994540.0
    },
    {
        "author": "HBK05",
        "body": "uh..buy low sell high? Intel has been in charge of a lot of their market for the past 10+ years, they are only lacking behind for the past couple of years. I fully believe in their ability to bounce back eventually and compete with amd, hopefully pushing innovation and price/performance for consumer computers to the moon, but for now it's time to wait and see if they can pull it.",
        "created_utc": 1598963603,
        "id": "g3kvl5a",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kvl5a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992403.0
    },
    {
        "author": "FattySquirrelDaddy",
        "body": "What’s going on with INTC?",
        "created_utc": 1598967192,
        "id": "g3l3129",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l3129/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598995992.0
    },
    {
        "author": "therealsparticus",
        "body": "Anyone who has to deal with bare level cpu will tell you how good their engineering support is. Intel runs on ecosystem fuel. It’s their most.",
        "created_utc": 1598964055,
        "id": "g3kwfy6",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3kwfy6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598992855.0
    },
    {
        "author": "sleepyguy007",
        "body": "intel, cisco, qualcomm, juniper etc were all huge bubble stocks in the tech bubble and were making tons of money.  \n\n\nThis tech bubble is just as bad and the same sort of mix of unprofitable companies, profitable overvalued companies, and now people just trying to cash out as fast as possible via SPACs and IPOs as there was then.  It might not be quite as steep a bubble yet, but its definitely getting there.  it took 4 years to go from 1200 -&gt; 5000 in 2000.   4 years ago the nasdaq was 5000 or so, so I could see it gettingto even 15000 and then crashing.  maybe not quite as big, but still as someone above mentioned economic conditions are far far worse now and we have much more debt than we did in 2000 as a nation",
        "created_utc": 1598955614,
        "id": "g3kl2if",
        "permalink": "/r/stocks/comments/ik5vev/why_the_stock_market_is_disconnected_from_the/g3kl2if/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598984414.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "So apparently tied into the tiger lake announcement Intel is doing  like a rebranding thing",
        "created_utc": 1598953918,
        "id": "g3kjhgx",
        "permalink": "/r/wallstreetbets/comments/ik5hmy/what_are_your_moves_tomorrow_september_01_2020/g3kjhgx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598982718.0
    },
    {
        "author": "Started-Late",
        "body": "I’m calling it boys, $60 on Intel by 9/18",
        "created_utc": 1598963125,
        "id": "g3kupgv",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3kupgv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598991925.0
    },
    {
        "author": "ShankThatSnitch",
        "body": "Yeah, but you also aren't responsible for other peoples money, and got lucky. What if NVDA pulled an INTC and ate shit over night?",
        "created_utc": 1598967155,
        "id": "g3l2xrg",
        "permalink": "/r/wallstreetbets/comments/ik2vki/rip_to_the_guy_who_took_out_a_15k_loan_for_30k_in/g3l2xrg/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598995955.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Intel gonna absolutely fuck me 🥺",
        "created_utc": 1598967217,
        "id": "g3l33gz",
        "permalink": "/r/wallstreetbets/comments/ikho51/daily_discussion_thread_for_september_01_2020/g3l33gz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598996017.0
    },
    {
        "author": "DWINGMAN97",
        "body": "Very nice! I got in INTC yesterday after doing some TA and it looks really solid for continuation over the next month or so!",
        "created_utc": 1598965880,
        "id": "g3l014e",
        "permalink": "/r/StockMarket/comments/ikjue5/analysis_paralysis_hour_daily_market_insights/g3l014e/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1598994680.0
    },
    {
        "author": "needcshelp1234",
        "body": "Buy amd options. Ever since Amd was more expensive than intc people have been saying buy intel",
        "created_utc": 1598965827,
        "id": "g3kzx89",
        "permalink": "/r/wallstreetbets/comments/ikj54a/making_money_is_kinda_easy/g3kzx89/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598994627.0
    },
    {
        "author": "enricosusatyo",
        "body": "Seriously, I’ve been an Intel shareholder for 5 years, and to be honest it’s not looking good for the company right now. \n\nIt’s cheap, I agree. But they gonna have to work hard to catch up to competitors.",
        "created_utc": 1598966807,
        "id": "g3l24hv",
        "permalink": "/r/stocks/comments/ikgtye/which_stocks_do_you_think_will_have_explosive/g3l24hv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598995607.0
    }
]