[
    {
        "author": "akmalhot",
        "body": "What about trimming some gains at this point? I bought some apple at 65 recently. I also own msft google adbe amzn payc ma/v crm as individual holdings and they are large components of many etfs.... Things is where do I out the money, I already sold off risky/speculative playa that left me with 15% cash.",
        "created_utc": 1599652199,
        "id": "g4jdd91",
        "score": 1,
        "subreddit": "investing",
        "created": 1599680999.0
    },
    {
        "author": "HAbhijeet",
        "body": "Well, as a finance professional with over twenty years of experience, i will tell you that what you are doing is not analysis. Stocks are not an absolute thing. The value of something is never judged in isolation. An apple (an actual fruit) has a value dependent on where the apple is.  An apple in an apple orchard is worth much less than an apple in a desert. You need to compare stocks with others in the sector. What is the price it is trading at. How does the company’s health compare to others in the same sector. Also remember that our equity markets are near perfect competition. All news is available to all participants. Therefore the price a stock is trading at is always its current fair price, discounting for all available information. The price is an equilibrium between positive and negative expectations. Just as an example, payc stock trades at a PE of 90. This means that an investor would need to accumulate earnings of the company for 90 years to break even on the cash paid upfront. (In a simplistic way). 160 million in annual earnings supporting a 16 billion market capitalisation. Looking at green markers in some website which has applied some filters to the stock price is not a very intelligent way to analyse. Perhaps you should think about if you would want to invest your entire retirement money into the payc stock. That is what I think about when I am looking at investing. \n\nTrading is a different animal. If you are talking about trading, you MUST talk about take profit and stop losses on your trades. It is risk reward strategy. Assuming that you are right about 50% of the time, a 1:2 stop loss / take profit level will leave you with a profit and limit losses. \n\nNot that it may do you any immediate good, my strong suggestion is to study market economics theory and actually stake some money on your ideas. Nothing brings clarity as making or losing money. These are not immediate solutions. But this will make you a better analyst over time. You have to come out green over a boom and bust cycle. Typically a 5 to 10 year period. \n\nAlso read a lot of research. See what factors good research analysts look for. How they think about valuations. And then start thinking about is this a good business to buy at this price? The price is a crucial element. It may be the best business in the planet but is is worth the asking price. Is there any logical way in which the price will increase or decrease over time. As mentioned before, all participants of the market have all the information in the market. Therefore company valuations are dependent on the company’s efforts and also on external factors. \n\nI will also encourage you to read company financial presentations and earnings releases. It will not teach you to be a better analyst but it will certainly tell you which numbers are important and what the company’s outlook for their business is.",
        "created_utc": 1600529058,
        "id": "g5tpad0",
        "score": 1,
        "subreddit": "InvestmentClub",
        "created": 1600557858.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "SnooRobots6193",
        "body": "May have missed a few here and there, but this is what I found.\n\nAbove 100:\n\n* FIS (1000+)\n* ZBH (800)\n* STZ (700)\n* IQV (240)\n* AMD (160)\n* CMG (145)\n* ADSK (140)\n* AMZN (125)\n* EQIX (130)\n* EL (120)\n* NOW (120)\n* D (120)\n* HPE (115)\n\nClose to 100: NVDA, NFLX, BDX, PYPL, CRM, PAYC, CCI",
        "created_utc": 1599320145,
        "id": "g44uv4i",
        "score": 1,
        "subreddit": "investing",
        "created": 1599348945.0
    }
]