[
    {
        "author": "gbernardon777",
        "body": "what would you expect from a sub full of fucktards. and they still think the stocks will go BR BR BR to 0...",
        "created_utc": 1600814098,
        "id": "g69fc9b",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1600842898.0
    },
    {
        "author": "Hippoman_",
        "body": "Want a brand new 1 BR condo for 910k? It's only that much because we put \"Luxury\" in front of it .",
        "created_utc": 1599592552,
        "id": "g4gx7jk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599621352.0
    },
    {
        "author": "junkrattrap",
        "body": "You mean there’s still a chance? you hear that?\n\nB\n\n...\n\n\nBR\n\n....\n\n**BRRRRRRRRRRRRERRR**",
        "created_utc": 1599607357,
        "id": "g4hri94",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599636157.0
    },
    {
        "author": "TendieValentine",
        "body": "Agree. I keep thinking how funny it would be if JPOW just did his speech with 30 minutes of straight BRRRRRRR BRRRR BRR BR BRRRRRRRRR",
        "created_utc": 1600274566,
        "id": "g5hihqj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600303366.0
    },
    {
        "author": "vintage_screw",
        "body": "Most houses have 2 BR so having it split 3 ways works too and it does not have to last forever.  Have a roommate until/after the GF moves in could work and helps you build equity faster as well.",
        "created_utc": 1600446907,
        "id": "g5ptniq",
        "score": 2,
        "subreddit": "investing",
        "created": 1600475707.0
    },
    {
        "author": "Tendiebendie",
        "body": "PLAY ain't br but suffered a similar blow.",
        "created_utc": 1600416624,
        "id": "g5omhav",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600445424.0
    },
    {
        "author": "gohazXpeda",
        "body": "My plate would be Br Rr 69",
        "created_utc": 1599466700,
        "id": "g4bat0v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599495500.0
    },
    {
        "author": "OppaGamerStyle",
        "body": "Wym has skills? with 7 billion people odds are one of them will say \"bull r fuk\" or \"br r fk\" on the right day",
        "created_utc": 1599944726,
        "id": "g4zac5y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599973526.0
    },
    {
        "author": "StraightBull69",
        "body": "Well yeah but the calls go boom cuz pow go br so trump says blm then Nancy print teslas",
        "created_utc": 1600406166,
        "id": "g5ob3v5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600434966.0
    },
    {
        "author": "badtradesguy",
        "body": "its not investing.\n\nIts gambling. The odds your in your ability to pick the right stock at the right price and right time.\n\nThat being said,\n\nId suggest you just do the SPY or QQQ.\n\nreason?\n\n1) Less chance for it to go bankrupt over individual companies.\n\n2) Your expected unrealized loss today is 50-60%. Meaning if you bought today and did nothing else, you could he sitting on a 50-60% loss.\n\n3) potential for \"unlimited\" growth.  This doesnt mean stocks go up forever. They may not. The market may br at its top and never recover like japans market. \n\nRegarding #2, this looks like shit right? well, it is. How do you get around this? Dollar cost averaging, options, and drip.\n\nIf the market tanked today and youre sitting on a 50% loss with the expectation that this is a japan type of setting, it wont recover fully for about 30 years. Markets will likely recover about 50% of their losses though.\n\n If you DCA, this cuts your loss in half, and reduces your recovery time from 30 years to 15 years and a 25% loss. Do it right, factor in dividends, and options premium from covered calls, this reduces can reduce your loss to around 10-15%, with the recovery time being cut down by another 5-7 years. This is with buying it st the top and buying in when it drops 50%.\n\nSo considering real return, its about 6-10% year in the spy. Average bull market is from 5-10years (currently being the longest). So youre looking at 30-100% return versus the 10-15%.\n\n\n\nNow look at it from a gambling perspective.\n\nIf someone told you your max loss at any time is only 50% of what you bet and that you only lose it entirely if you leave the table. Doesnt that sound like a good deal?",
        "created_utc": 1600000873,
        "id": "g53mqxi",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1600029673.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "___alexa___",
        "body": "ɴᴏᴡ ᴘʟᴀʏɪɴɢ: [Khalid - Young Dumb &amp;amp; Br](https://www.youtube.com/watch?v=IPfJnp1guPc) ─────────⚪───── ◄◄⠀[▶](https://www.youtube.com/watch?v=IPfJnp1guPc)⠀►►⠀ 2:45 / 4:08 ⠀ ───○ 🔊 ᴴᴰ ⚙️",
        "created_utc": 1599553856,
        "id": "g4f9zr2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599582656.0
    },
    {
        "author": "WIPESASSWITHSOCKS7",
        "body": "Yes but they don’t make printer go br",
        "created_utc": 1598959545,
        "id": "g3kp2tu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1598988345.0
    },
    {
        "author": "pmsyyz",
        "body": "[https://www.globenewswire.com/news-release/2020/09/29/2100928/0/en/Westell-Stockholders-Approve-Reverse-and-Forward-Splits.html](https://www.globenewswire.com/news-release/2020/09/29/2100928/0/en/Westell-Stockholders-Approve-Reverse-and-Forward-Splits.html)\n\nAURORA, Ill., Sept. 29, 2020 (GLOBE NEWSWIRE) -- Westell Technologies, Inc. (NASDAQ: WSTL), a leading provider of high-performance network infrastructure solutions, announced that at the Annual Meeting on September 29, 2020, the Company’s stockholders voted to approve proposals authorizing the Board of Directors of the Company to amend the Company’s certificate of incorporation to effect a 1-for-1,000 reverse stock split of the Company’s Class A and Class B Common Stock, followed immediately by an 1,000-for-1 forward stock split (the “Transaction”). The reverse and forward stock splits will be effected on October 1, 2020 and the Company’s Class A Common Stock is expected to begin trading on the NASDAQ Capital Market on a post-forward stock split basis upon the opening of trading on October 2, 2020.  \n\n\nAs a result of the reverse stock split, each share of the Company’s Common Stock held by a stockholder of record owning immediately prior to the effective time of the reverse stock split fewer than 1,000 shares of the Company’s Common Stock will be converted into the right to receive $1.48 in cash, without interest, and such stockholders will no longer be stockholders of the Company. To be entitled to such cash payment, a stockholder must be a record holder of fewer than 1,000 shares immediately prior to the effective time of the reverse stock split. Investors who purchase fewer than 1,000 shares prior to the effective time of the reverse stock split and settle such purchases after the effective time shall not be entitled to such cash payment and instead their trades will be settled on a post-forward stock split basis. Trades in the Company’s Common stock made on or after October 1, 2020 will settle on a post-forward stock split basis.\n\nStockholders owning 1,000 or more shares of Class A Common Stock or Class B Common Stock held in a single account immediately prior the effective time of the Reverse Stock Split will not receive any payment for their shares and, immediately following the Transaction, will continue to hold the same number of shares as before the Transaction.\n\nThe Transaction will apply directly only to record holders of the Company’s Common Stock. Persons who hold shares of Common stock in “street name” are encouraged to contact their bank, broker or other nominee for information on how the transaction may affect any shares of the Company’s Common Stock held for their account.\n\nWestell’s transfer agent, Broadridge Corporate Issuers Solutions, Inc., which is also acting as the exchange agent for the Transaction, will provide instructions to stockholders regarding the process for exchanging share certificates. Stockholders owning less than 1,000 shares will receive cash for their shares.\n\nThe Company has given notice to NASDAQ of its intent to voluntarily delist its Common Stock and to withdraw the registration of its Class A Common Stock with the Securities and Exchange Commission (SEC). **The Company intends to file a Form 25 Notification of Removal from Listing with the SEC on or about October 9, 2020. As a result, the Company expects that listing of its shares on NASDAQ Capital Market will be terminated on or about October 19, 2020.** The Company also intends to file a Form 15 with the SEC to suspend the Company’s reporting obligations under the Exchange Act. Following its delisting, the Company’s Class A Common Stock may be quoted on the OTC Pink Open Market (the “Pink Sheets”), a centralized electronic quotation service for over-the-counter securities, if market makers demonstrate an interest in trading in the Company’s Common Stock. However, the Company can give no assurance that trading in its Class A Common Stock will commence or continue on the Pink Sheets or any other securities exchange or quotation medium.\n\nAs previously announced, the Company is taking these steps to avoid the substantial cost and expense of being a public reporting company and to focus the Company’s resources on enhancing long-term stockholder value. The Company anticipates savings of approximately $900,000 on an annual basis as a result of the proposed deregistration and delisting transaction.",
        "created_utc": 1601491519,
        "id": "g77aw52",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1601520319.0
    },
    {
        "author": "Champigne",
        "body": "That's why they said \"relatively broke.\" Whatever the fuck that means. Probably living in a small 3 br apartment in downtown Manhattan.",
        "created_utc": 1600313666,
        "id": "g5jrlal",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600342466.0
    },
    {
        "author": "RealBullishcowboy",
        "body": "China dumping Usa treasuries not a good dign\n\nWho will br left holding the junk ??? Lol",
        "created_utc": 1599483122,
        "id": "g4bqlg0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599511922.0
    },
    {
        "author": "fcinvest10",
        "body": "I mean, I agree with the premise that all stakeholders matter in the entire business ecosystem and that treating them well leads to happiness all around. Direct profits I'm less convinced. Maybe indirect through back scratching/higher multiple? Plus businesses that have the ability to do so are already great (competitively advantaged), while mediocre ones in competitive industries can't. \nAnd I'm not sure that Producer and Consumer surplus works like that in reality... but it's been a while since microeconomics.\nThese guys also own Broadridge, a monopoly operator extracting value from consumers (per the Ack).",
        "created_utc": 1599535086,
        "id": "g4eojm8",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1599563886.0
    },
    {
        "author": "OppaGamerStyle",
        "body": "Futures brrrrr is more like br or ^(br)",
        "created_utc": 1599428212,
        "id": "g49rxua",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599457012.0
    },
    {
        "author": "Slowmac123",
        "body": "I bought a call on sep 01 and it’s been bleeding since the 3rd. If it moves a few % i might br able to breakeven",
        "created_utc": 1600968314,
        "id": "g6g0lfj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600997114.0
    }
]