[
    {
        "author": "Gimme_All_Da_Tendies",
        "body": "My man took a picture of his screen with a Motorola RAZR in 2020",
        "created_utc": 1585274392,
        "id": "flm4is1",
        "permalink": "/r/wallstreetbets/comments/fpjn2e/what_are_your_moves_tomorrow_march_27_2020/flm4is1/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1585303192.0
    },
    {
        "author": "Shaun8030",
        "body": "https://www.google.com/search?q=tsx+index&amp;oq=tsx+&amp;aqs=chrome.1.69i59l3j69i60l2.2438j0j9&amp;client=ms-android-motorola-rev2&amp;sourceid=chrome-mobile&amp;ie=UTF-8\n\nJuly 2007 have a look  this is the actual index click on max to see the full chart .  Xic yield is 3.4 percent according to Bloomberg.\nAre you satisfied with xic having the same share price as 2008 , almost 13 years of nothing except a 3 percent dividend. You could have got that type of  return with a hisa or gic reinvested interest",
        "created_utc": 1583813045,
        "id": "fk2zfe3",
        "permalink": "/r/CanadianInvestor/comments/fg7l2h/tsx_back_to_2007_levels/fk2zfe3/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1583841845.0
    },
    {
        "author": "kekwillsit830",
        "body": "Switch my Motorola to a primeco phone",
        "created_utc": 1585155938,
        "id": "flh4iol",
        "permalink": "/r/wallstreetbets/comments/fotmzk/1200_to_make_sure_wage_slaves_reapply_for_their/flh4iol/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1585184738.0
    },
    {
        "author": "manar4",
        "body": "Exactly this. I think the X card maker sells more cars, so Tesla is overvalued is a bad argument. At one point Motorola and Nokia were selling more phones than Apple and making more money, but Apple's stock was way higher. Many were saying it was a new bubble, it was overvalued, but it kept growing every quarter, faster than anyone.\n\nThis is why P/E alone is a very confusing metric without looking at expected growth. A company can have a very low P/E because it's not growing. But a fast growing company is expected to have a much higher P/E and this doesn't mean is a bad investment.",
        "created_utc": 1583852531,
        "id": "fk43hsd",
        "permalink": "/r/stocks/comments/fgccr4/elon_musk_says_tesla_has_now_produced_1_million/fk43hsd/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583881331.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  9th of March\n\n\n\n## Upcoming events for Monday, March  9th\n\n - Stock splits:\n\n    - DLBS @ **1:6**\n    - DTYS @ **1:6**\n    - TAPR @ **1:6**\n\n - Expected earnings:\n\n  AFH, ASRT, AVD, AVID, BTAI, BXG, CASY, CHWY, CLAR, CNTY, CVGI, CYOU, DCPH, FLMN, FNV, FREQ, GO, HNRG, IMUX, IMXI, JAX, JT, KEP, KLXE, KRO, KT, MG, MGIC, MNTX, MRNS, MTN, MTNB, MVC, NDRA, NERV, NINE, NTRP, NXE, ORGO, PAYS, PHAT, PRTS, PSTL, QTRX, SESN, SFIX, SIBN, SKM, SNCR, SOGO, SOHU, SSKN, THO, TREC, TRIL, UL, UN, USAS, XENE, XPL, YJ, ZYNE\n\n - Ex-div:\n\n  AUBN, BDX, BJRI, CASH, CI, CME, CNI, CNO, COLM, CRAI, DK, ESNT, EXPE, HBM, JWN, KTB, LADR, MGM, OEC, OMC, OXY, PE, PEG, PPL, PPR, PWOD, RCI, RICK, SBAC, SCCO, SITC, SPTN, TFSL, TRV, UBCP, UMBF, UVSP, VCTR, VFC\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 1.155%)\n    - 6-Month Bill Auction (previous: 1.010%)\n    - CB Employment Trends Index (previous: 110.20)\n    - Investing.com Gold Index (actual: 52.8%, previous: 54.8%)\n    - Investing.com S&amp;P 500 Index (actual: 45.2%, previous: 63.2%)\n\n## Upcoming events for Tuesday, March 10th\n\n - Expected earnings:\n\n  ADXS, AIH, AKBA, AKRO, AMPH, APEI, APTO, ARA, ARPO, ASPU, ATXI, AU, AXLA, BBX, BCEL, BE, BIOL, BLCM, BXC, CATB, CCXI, CDMO, CDXC, CLDR, CLNE, CLRB, CPSS, CRBP, CRTX, CSTL, CVIA, CYD, DKS, DSKE, DTIL, EMAN, FIXX, FLGT, FLL, FTR, GNC, GPX, GRTX, HALL, HCHC, HEAR, HOOK, III, INST, KFY, KOPN, KRYS, LOMA, MOGO, MVIS, NBRV, NEX, NGM, NIO, NNVC, NOAH, NSPR, NXTC, OPGN, PAM, PEIX, PETQ, PRPL, PRVL, PSN, PTGX, PULM, QTT, RESN, REYN, RMED, RRTS, SCCO, SFST, SNSS, SPAR, STOK, STSA, SUNW, SWTX, SYBX, TACT, TEUM, TISI, TLRA, TRXC, TSQ, UEC, UUUU, VIR, VSLR, VSTM, WMGI, XGN, YORW\n\n - Ex-div:\n\n  AEE, AGO, BBDC, DHF, HPE, HPQ, NWS, NWSA, RE, SFL, SR, TU, TXRH, WRB, WSBF\n\n - Economic events and announcements:\n\n    - 3-Year Note Auction (previous: 1.394%)\n    - API Weekly Crude Oil Stock (previous: 1.690M)\n    - NFIB Small Business Optimism (consensus: 104.5, previous: 104.3)\n    - Redbook (previous: -0.1%)\n    - Redbook (previous: 5.9%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, March 11th\n\n - Expected earnings:\n\n  ACEL, ADMA, ADRO, AMOT, ANIX, APLT, ARCT, AXAS, AXU, BAK, BBCP, BBW, BLFS, BREW, BSGM, CALA, CHU, CLSD, CODX, CORV, CPIX, CRHM, CRNX, DMAC, DQ, DVAX, DYAI, EXPR, EYES, FGBI, FLNT, FPH, FPI, FSM, FTEK, GDS, GECC, GLMD, GVA, HEXO, HHS, HNGR, HUD, IBN, IDN, IDYA, IEA, INMB, INSE, INSG, KINS, LCUT, LMNR, LPL, LQDA, LXRX, MCRI, MGEN, MIRM, MIST, MNOV, MOR, MUX, NAVB, NK, NNBR, NTEC, PDD, PDLI, PFNX, PHI, PKOH, PRTH, PSNL, PSTI, PUK, RC, RLMD, RST, SIEN, SILV, SLDB, SMTC, SONM, SPHS, SVRA, TACO, TALO, TARA, TH, TMDI, TRVN, UBX, UNFI, VCNX, VFF, VRA, VXRT, WPM, XBIT, XERS, ZAGG\n\n - Ex-div:\n\n  AAT, ACV, AIO, ASTE, AY, BTO, CBH, DBL, DCF, DSL, ECC, EFL, EHT, EIC, EVF, FNV, FUSB, GIL, HD, HEQ, HPF, HPI, HPS, HTD, HTY, HVT, HVT.A, JBT, JHI, JHS, LGI, MDU, MNRL, MPW, NBR, NCV, NCZ, NRGX, NRIM, ORA, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, POOL, PTY, PYN, PZC, RVT, STAY, SWCH, UVE, VGI, VSH, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.622%)\n    - CPI (consensus: 0.2%, previous: 0.1%)\n    - CPI (consensus: 2.2%, previous: 2.5%)\n    - CPI Index, n.s.a. (consensus: 258.54, previous: 257.97)\n    - CPI Index, s.a (previous: 258.82)\n    - CPI, n.s.a (previous: 0.39%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.2%)\n    - Core CPI (consensus: 2.3%, previous: 2.3%)\n    - Core CPI Index (previous: 266.48)\n    - Crude Oil Imports (previous: -0.476M)\n    - Crude Oil Inventories (previous: 0.785M)\n    - Cushing Crude Oil Inventories (previous: -1.971M)\n    - Distillate Fuel Production (previous: -0.198M)\n    - EIA Refinery Crude Runs  (previous: -0.312M)\n    - EIA Weekly Distillates Stocks (previous: -4.008M)\n    - EIA Weekly Refinery Utilization Rates (previous: -1.0%)\n    - Federal Budget Balance (consensus: -11.5B, previous: -33.0B)\n    - Gasoline Inventories (previous: -4.340M)\n    - Gasoline Production (previous: -0.040M)\n    - Heating Oil Stockpiles (previous: 0.099M)\n    - MBA 30-Year Mortgage Rate (previous: 3.57%)\n    - MBA Mortgage Applications (previous: 15.1%)\n    - MBA Purchase Index (previous: 265.8)\n    - Mortgage Market Index (previous: 754.1)\n    - Mortgage Refinance Index (previous: 3,594.4)\n    - OPEC Monthly Report\n    - Real Earnings (consensus: 0.1%, previous: 0.1%)\n    - Thomson Reuters IPSOS PCSI (previous: 62.90)\n\n## Upcoming events for Thursday, March 12th\n\n - Stock splits:\n\n    - ICD @ **1:20**\n    - INLX @ **1:50**\n\n - Expected earnings:\n\n  ADBE, AGEN, AGFS, AGRO, AIRI, ALOT, AP, APRE, AQMS, AQST, ASUR, AVDL, AVEO, AVGO, AXSM, AZUL, BAX, BDSI, BEST, BGSF, BLPH, BPMX, BRMK, BRT, CAL, CATS, CBAY, CBPO, CELC, CELH, CEMI, CERC, CFRX, CHAP, CLUB, CNST, CPLG, CRMD, CSU, CTK, CTXR, CUE, DG, DOCU, DOMO, EIGR, ENT, ESTE, EVFM, FLXN, FOMX, GARS, GCO, GDEN, GHG, GNE, GPL, GPS, GRFS, HABT, HARP, HEPA, HSDT, HTHT, HX, HZN, IGMS, IMAC, INAP, INO, IOTS, IRIX, JBL, JOBS, KALV, KRTX, LAIX, LCTX, LLEX, LX, MBII, MBRX, MDLA, MOGU, MRAM, NBEV, NBSE, NEOS, NGS, NKSH, NOG, NSCO, ONVO, ORAN, ORCL, PAR, PDSB, PGNX, PLSE, PRTY, PTE, PWFL, PZG, QRHC, RDNT, REDU, REED, RFIL, RMNI, RMTI, RTIX, RUBY, SALM, SBSW, SCYX, SDPI, SEEL, SENS, SHSP, SIC, SLGG, SMTX, SNN, SPRO, SRT, TEF, TERP, TGEN, TLYS, TRVI, TTPH, ULTA, UNIT, UNT, UXIN, VEON, VIE, VIVE, VOLT, VRAY, WORK, WRN, WRTC, WUBA, XCUR, XFOR, XONE, YI, ZEAL, ZSAN, ZUMZ, ZUO\n\n - Ex-div:\n\n  ADP, ALB, AME, AMH, AMSF, APTS, AU, AVK, BBBY, BBSI, BCTF, BDC, BR, BRY, BSIG, BXMX, BXS, CAE, CCD, CCI, CCOI, CFFI, CGO, CHI, CHW, CMA, CMCT, COFS, CPG, CPK, CPZ, CRH, CRWS, CSQ, CTBI, CTS, CVE, DIAX, DPZ, DVN, ENS, EOD, ETM, ETN, EXPO, FBSS, FDUS, FFIC, FFNW, FHN, FIS, FMNB, FRO, FTAI, GBAB, GFI, GGM, GHY, GILD, GOF, GOLF, GPK, GPN, HUN, HWBK, IBKC, ICMB, IIIN, IR, ISD, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JSD, JTA, JTD, KHC, KIO, LAD, LEG, LEO, LHX, M, MAXR, MBIN, MFSF, MGPI, MNRO, MSI, MTEX, NAC, NAD, NAN, NBB, NCB, NDAQ, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMFC, NMS, NMZ, NOV, NPN, NRK, NSA, NSL, NTES, NTRS, NUV, NUW, NVG, NWE, NXJ, NXR, NYV, NZF, OCSI, OCSL, OVV, PHM, PKG, QQQX, RGR, RIVE, RNR, RRR, RS, SAH, SAMG, SCI, SJR, SLCA, SNDR, SNR, SOHO, SPXX, STRT, SYBT, TCBK, TECK, TG, THG, TRTN, TRU, TSLX, TT, TXT, UBSI, UNTY, USPH, UTMD, VLY, VRSK, WH, WMB, WOR, WSBC, WWE, XEL\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.061%)\n    - 4-Week Bill Auction (previous: 0.925%)\n    - 8-Week Bill Auction (previous: 0.820%)\n    - Continuing Jobless Claims (consensus: 1,723K, previous: 1,729K)\n    - Core PPI (consensus: 0.2%, previous: 0.5%)\n    - Core PPI (consensus: 1.7%, previous: 1.7%)\n    - Initial Jobless Claims (consensus: 215K, previous: 216K)\n    - Jobless Claims 4-Week Avg. (previous: 213.00K)\n    - Natural Gas Storage (consensus: -82B, previous: -109B)\n    - PPI (consensus: -0.1%, previous: 0.5%)\n    - PPI (consensus: 1.8%, previous: 2.1%)\n\n^^^^2020-03-09",
        "created_utc": 1583748018,
        "id": "fk098jr",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fk098jr/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583776818.0
    },
    {
        "author": "edmocha93",
        "body": "Why Motorola all time highs",
        "created_utc": 1583339582,
        "id": "fjh1q38",
        "permalink": "/r/wallstreetbets/comments/fdbghc/daily_discussion_thread_march_04_2020/fjh1q38/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583368382.0
    },
    {
        "author": "Jabberwocky918",
        "body": "Apple needs a phone like mine: Motorola Moto G7 Power. Mid range specs, 5,000 mah battery. 3 days average use, full day power user.",
        "created_utc": 1583275424,
        "id": "fjeo97a",
        "permalink": "/r/wallstreetbets/comments/fd1om9/in_other_newslets_talk_about_aapl_for_2_seconds/fjeo97a/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583304224.0
    },
    {
        "author": "vertigo3pc",
        "body": "I can't necessarily speak from the investment standpoint, but perhaps my enthusiasm is the sort of thing investment analysts and speculators are using to promote their valuation.\n\nI own a Tesla, as well as solar panels and Tesla Powerwall(s).\n\nWe can start with what you mentioned: efficiency. VW and Audi took a beating over their efficiency failures, and while Hyundai may have a solid competitive in-road, the fact remains that too many other manufacturers simply think building EV's is simple: remove traditional engine and internal combustion components, add in battery and electric motors. Sell. However, VW had to admit that the software and efficiency of driving/running/managing an all electric vehicle is more complicated than they initially thought. VW was the frontrunner 5 years ago (just before dieselgate), and they have teased the ID lineup for years. Now they're delayed once again. Tesla figured something out that no other car makers took seriously: it's not just a car, it's a piece of tech.\n\nThe next item that made Tesla strong, and continues to reinforce their brand while other makers are figuring out how to compete, is charging. Charging at home is nothing too special, all EV's let you charge at home. However, the spread of Tesla Superchargers, their capacity, and especially their growth, is another thing that will keep Tesla in front. Electrify America has CCS based chargers that finally compete with the Tesla Supercharger charge rates, but they're still not as spread out as Tesla Superchargers. You can drive cross country over a number of paths and rely entirely on Supercharging. Add in Tesla destination chargers AND the non-Tesla charging opportunities, and you have something that can help quell the linger fears over \"range anxiety\". \n\nThe last piece, and I think the most controversial, is the self-driving, Level 5 autonomy future for Tesla. In my opinion, it's not a matter of if but when, and even George Hotz stated that Tesla will \"win\" the self driving future. I personally believe the reason is the amount of data Tesla is receiving from their drivers. Teaching a Neural Net to self drive requires data, and Tesla has *hundreds of thousands* of vehicles on the road. They all record clips and driving data from the car, and send them back to the Tesla mother-ship. They use this data to not just train the Neural Net and improve self driving, but also to help perfect what they've already engineered.\n\nSo if you simply give the benefit of the doubt to the inevitability of fully self driving vehicles, you have to acknowledge that Tesla has a jump start, and even if their features don't do anything drastically *today* that sets them apart from other smart features in other cars, the amount of data they are receiving every day from drivers all over the world will give them a HUGE advantage. I really cannot understate this: every night, after 110 miles roundtrip commuting to work, my vehicle connects to wifi and uploads data from my car. Every autopilot engage and disengage, every mile driven, every event goes back to Tesla. Last April at the Autonomy Day presentation, they discussed the \"Dojo\" where they let the Neural Net attempt to drive paths we drive, and grade it on performance. They showcased \"Shadow Mode\", where if the car is in manual, it records what the driver is doing and remembers what it would have done, then comparing the two (why did the driver not move a lane over? etc). Again, it's not just a car, it's a piece of tech. \n\nTech is not just hardware (and the HW3 computer has intimidated other auto makers, acknowledging they themselves cannot compete), but software. VW wanted to charge $1,000 to update the maps in my VW Sportwagen TDI. Ford wanted $200 to update my head unit with maps. They claimed they would have Android Auto integration, but then pushed the rollout 6 months. Meanwhile, Tesla pushed software updates that let me car change lanes on it's own, observe neighboring lane speed, and let the driver decide what their acceleration curve should be. They update maps, change the entire UI, and introduced a home theater package that lets you watch Netflix, YouTube, Hulu (and loads of other sites, if you know how to get there) while charging or parked. These software updates cost ZERO. \n\n\"Disrupt the industry\" is a term that's tossed around in a lot of bullshit campaigns, but I think Tesla is an example of truly disrupting things. I remember when the iPhone was introduced by Apple, and loads of people in my circles said it was stupid, it would fail, \"nobody wants to carry something that big\", \"I already have a Blackberry\", etc. Apple knew portability of computing was the future, and even though Apple released the original iPhone without GPS or 3G or even an App store, they eventually did, and it absolutely took over. Some of the cell phone makers from the 1990's and 2000's are still around: LG, Motorola, Sony, etc. However, many of them are gone, and new companies have appeared: Samsung, OnePlus, Oppo, Xoami, etc. And of all those companies in that industry, Apple is still one of the most highly valued NOW, in the wake of naysayers 10+ years ago saying it would flop. \n\nFord and VW have \"all electric\" cars. More are coming, and more that we're just starting to hear about: Bollinger, Rivian, Fisker, etc. Just like with the iPhone, I believe many legacy automakers will not survive this changeover simply because they have concentrated their talents on mechanical engineering rather than software and technology. Tesla has not significantly changed the design of the Model S, Model X, or Model 3 since they were released, and their sales have grown year over year, restricted ONLY by their capacity to manufacture. \n\nIs Tesla worth $8,000 per share? I doubt it, but value investing and speculative investing boggles my mind, so perhaps someone thinks so. However, many said they would fail and go bankrupt, and in the 2 years since the Model 3 started rolling out, Tesla has opened another Gigafactory, starts clearing ground for another one, and revived another factory for manufacturing solar roof products. They have only expanded in the face of opposition and dismissal. Other analysts have had to revise their position on Tesla, and many fund managers have had to explain their losses on short positions. \n\nIs Tesla technically superior? I'm also an Android user, but all I hear is how superior the iPhone is compared to my handset. The fact is competition is good, and Tesla has *always* welcomed competition. The joke is that the 2014 Model S is still \"superior\" to any other 2020 EV. More EV's will come, and more manufacturers will appear (in the wake of other makers going under),  and those new makers will be tech and software focused. As such, Tesla probably won't be the only maker in the game, but in the game they're playing? They're the only ones right now.",
        "created_utc": 1583348155,
        "id": "fjhhe4a",
        "permalink": "/r/investing/comments/fdbi5l/please_help_me_understand_tesla_i_do_not_get_it/fjhhe4a/",
        "score": 1,
        "subreddit": "investing",
        "created": 1583376955.0
    },
    {
        "author": "MangoAndRash",
        "body": "The second screenshot is from my SO's phone, she uses a Motorola Play 7",
        "created_utc": 1584750008,
        "id": "fl2fs3l",
        "permalink": "/r/RobinHood/comments/fm5voc/why_does_rh_have_different_ui_designs_on_android/fl2fs3l/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1584778808.0
    },
    {
        "author": "wepo",
        "body": "Go small if you are going to start buying.  Many (and myself) believe we have 2 more hard dips coming.  One early this next week and the the mother of all dips after a fake recovery bounce.  Unsure of time frame but probably measured in weeks.  \n\nIf my only investment strategy was buying stock, I'd buy GIS, MSI, MDT and a few FAANG on the next two dips.  If guesses are right, these two dips are coming very soon and are once in a decade or even generation opportunities.",
        "created_utc": 1584825314,
        "id": "fl4zvfo",
        "permalink": "/r/stocks/comments/fmdzkk/this_is_the_time_to_start_getting_a_list_of_your/fl4zvfo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1584854114.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 11th of March\n\n\n\n## Upcoming events for Wednesday, March 11th\n\n - Expected earnings:\n\n  ACEL, AMOT, ANIX, APLT, AQMS, ARCT, AXAS, AXU, BAK, BBCP, BBW, BLFS, BREW, BSGM, CALA, CHU, CLSD, CODX, CORV, CRHM, DMAC, DQ, DUO, DVAX, DYAI, EVOK, EXPR, EYES, FGBI, FLNT, FPH, FPI, FSM, FTEK, GALT, GECC, GVA, HEXO, HHS, HNGR, HUD, IBN, IDN, IDRA, IDYA, IEA, INMB, INSE, INSG, INXN, JCS, KINS, LCUT, LMNR, LPCN, LPL, LQDA, MCRI, MEET, MGEN, MIRM, MNOV, MOR, MUX, NAVB, NEXT, NK, NTEC, NVAX, PDD, PDLI, PFIE, PFNX, PHI, PKOH, PRTH, PSNL, PSTI, PUK, RC, RLMD, RST, SIEN, SILV, SLDB, SLRX, SMTC, SONM, SPHS, TACO, TALO, TARA, TH, TMDI, UBX, UNFI, VFF, VRA, VTNR, VXRT, WPM, XBIT, XERS, ZAGG\n\n - Ex-div:\n\n  AAT, ACV, AIO, ASTE, AY, BTO, CBH, DBL, DCF, DSL, ECC, EFL, EHT, EIC, EVF, FNV, FUSB, GIL, HD, HEQ, HPF, HPI, HPS, HTD, HTY, HVT, HVT.A, JBT, JHI, JHS, LGI, MDU, MNRL, MPW, NBR, NCV, NCZ, NRGX, NRIM, ORA, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, POOL, PTY, PYN, PZC, RVT, STAY, SWCH, UVE, VGI, VSH, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.622%)\n    - CPI (consensus: 0.2%, previous: 0.1%)\n    - CPI (consensus: 2.2%, previous: 2.5%)\n    - CPI Index, n.s.a. (consensus: 258.54, previous: 257.97)\n    - CPI Index, s.a (previous: 258.82)\n    - CPI, n.s.a (previous: 0.39%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.2%)\n    - Core CPI (consensus: 2.3%, previous: 2.3%)\n    - Core CPI Index (previous: 266.48)\n    - Crude Oil Imports (previous: -0.476M)\n    - Crude Oil Inventories (consensus: 2.266M, previous: 0.785M)\n    - Cushing Crude Oil Inventories (previous: -1.971M)\n    - Distillate Fuel Production (previous: -0.198M)\n    - EIA Refinery Crude Runs  (previous: -0.312M)\n    - EIA Weekly Distillates Stocks (consensus: -1.911M, previous: -4.008M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: -1.0%)\n    - Federal Budget Balance (consensus: -236.3B, previous: -33.0B)\n    - Gasoline Inventories (consensus: -2.482M, previous: -4.340M)\n    - Gasoline Production (previous: -0.040M)\n    - Heating Oil Stockpiles (previous: 0.099M)\n    - MBA 30-Year Mortgage Rate (previous: 3.57%)\n    - MBA Mortgage Applications (previous: 15.1%)\n    - MBA Purchase Index (previous: 265.8)\n    - Mortgage Market Index (previous: 754.1)\n    - Mortgage Refinance Index (previous: 3,594.4)\n    - OPEC Monthly Report\n    - Real Earnings (consensus: 0.1%, previous: 0.1%)\n    - Thomson Reuters IPSOS PCSI (previous: 62.90)\n\n## Upcoming events for Thursday, March 12th\n\n - Stock splits:\n\n    - ICD @ **1:20**\n    - INLX @ **1:50**\n\n - Expected earnings:\n\n  ACER, ACRX, ADBE, ADMA, ADVM, AGEN, AGFS, AGRO, AIRI, ALDX, ALNA, ALOT, AMPH, AMRS, AP, APRE, AQB, AQST, ARAV, ASUR, AUTO, AVDL, AVEO, AVGO, AXSM, AZUL, BAX, BDSI, BEST, BGSF, BLCM, BLPH, BLRX, BPMX, BRMK, BRT, CAL, CATS, CBAY, CBPO, CELC, CELH, CEMI, CERC, CFRX, CHAP, CLDX, CLPR, CLUB, CNTG, CPLG, CRBP, CTK, CTXR, CUE, CVGW, DG, DOCU, DOMO, EIGR, ESTE, EVFM, FLXN, FRG, GARS, GCO, GDEN, GEN, GERN, GGAL, GHG, GLMD, GPL, GPS, GRFS, GSHD, HABT, HARP, HEPA, HSDT, HTGM, HTHT, HX, HZN, IGMS, IMAC, INAP, INO, INVE, IOTS, IRIX, JBL, JOBS, KALV, KRTX, LAIX, LCTX, LLEX, LONE, LX, LXRX, MBII, MBRX, MDLA, MOGU, MRAM, MYO, NBEV, NBSE, NCNA, NGS, NKSH, NLTX, NNBR, NOG, NSCO, OCUL, ONVO, ORCL, OVID, PAR, PDSB, PGNX, PKX, PLSE, PLX, PRTY, PRVB, PTE, PWFL, PZG, QRHC, RDNT, REDU, REED, RFIL, RMNI, RMTI, RTIX, RUBY, SALM, SBSW, SCYX, SDPI, SEEL, SELB, SENS, SHSP, SIC, SLGG, SMTX, SNN, SPAR, SPRO, SRT, SSI, SURF, SVRA, SYBX, TEF, TERP, TGEN, TGS, TLYS, TRVI, TRVN, TTPH, UFAB, ULTA, UNIT, UNT, UXIN, VEON, VIE, VOLT, VRAY, VRCA, WORK, WRN, WRTC, WTRH, WUBA, XCUR, XFOR, XOMA, XONE, YI, YMAB, ZEAL, ZSAN, ZUMZ, ZUO\n\n - Ex-div:\n\n  ADP, ALB, AME, AMH, AMSF, APTS, AU, AVK, BBBY, BBSI, BCTF, BDC, BR, BRY, BSIG, BXMX, BXS, CAE, CCD, CCI, CCOI, CFFI, CGO, CHI, CHW, CMA, CMCT, COFS, CPG, CPK, CPZ, CRH, CRWS, CSQ, CTBI, CTS, CVE, DIAX, DPZ, DVN, ENS, EOD, ETM, ETN, EXPO, FBSS, FDUS, FFIC, FFNW, FHN, FIS, FMNB, FRO, FTAI, GBAB, GFI, GGM, GHY, GILD, GOF, GOLF, GPK, GPN, HUN, HWBK, IBKC, ICMB, IIIN, IR, ISD, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JSD, JTA, JTD, KHC, KIO, LAD, LEG, LEO, LHX, M, MAXR, MBIN, MFSF, MGPI, MNRO, MSI, MTEX, NAC, NAD, NAN, NBB, NCB, NDAQ, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMFC, NMS, NMZ, NOV, NPN, NRK, NSA, NSL, NTES, NTRS, NUV, NUW, NVG, NWE, NXJ, NXR, NYV, NZF, OCSI, OCSL, OVV, PHM, PKG, QQQX, RGR, RIVE, RNR, RRR, RS, SAH, SAMG, SCI, SJR, SLCA, SNDR, SNR, SOHO, SPXX, STRT, SYBT, TCBK, TECK, TG, THG, TRTN, TRU, TSLX, TT, TXT, UBSI, UNTY, USPH, UTMD, VLY, VRSK, WH, WMB, WOR, WSBC, WWE, XEL\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.061%)\n    - 4-Week Bill Auction (previous: 0.925%)\n    - 8-Week Bill Auction (previous: 0.820%)\n    - Continuing Jobless Claims (consensus: 1,723K, previous: 1,729K)\n    - Core PPI (consensus: 0.1%, previous: 0.5%)\n    - Core PPI (consensus: 1.7%, previous: 1.7%)\n    - Initial Jobless Claims (consensus: 218K, previous: 216K)\n    - Jobless Claims 4-Week Avg. (previous: 213.00K)\n    - Natural Gas Storage (consensus: -82B, previous: -109B)\n    - PPI (consensus: -0.1%, previous: 0.5%)\n    - PPI (consensus: 1.8%, previous: 2.1%)\n\n## Upcoming events for Friday, March 13th\n\n - Expected earnings:\n\n  ACHV, AVH, BKE, CNAT, CNTY, CTRN, GNLN, GOGO, HCAP, HDB, HHR, HROW, HSON, HUGE, JBL, JKS, KIRK, NEOS, OFS, ONCS, OSTK, PLXP, REXN, SINT, SMTX, SOL, TEO\n\n - Ex-div:\n\n  AGM, AIG, AMPY, ANTM, ARCC, ARKR, ARR, ATRI, BAF, BANC, BBF, BBK, BBN, BCE, BCX, BDJ, BFK, BFO, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BKK, BLE, BLW, BME, BNY, BOE, BQH, BSD, BSE, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, BZM, CARO, CBU, CHS, CII, CNMD, CORE, CSFL, CSWC, CWH, DPG, DTE, EDF, EDI, EFSC, EGF, EMN, ESRT, ESSA, EVC, EXR, FCAP, FCNCA, FFG, FFIN, FG, FRA, FRT, GIM, GRMN, GROW, HES, HLNE, HRTG, HYT, IRM, ITT, JCI, JCS, JRVR, KBR, KNL, KO, LAMR, LDOS, MCA, MEN, MHD, MLR, MMD, MNE, MRCC, MRK, MTSC, MUE, MUI, MUS, NEU, NEXA, NFJ, NIE, NXPI, NXRT, OMI, PB, PFBI, PLD, PRSC, PSA, PSB, QSR, ROIC, RRBI, RWT, SBR, SELF, SFNC, SGA, SMMF, SPOK, SRF, SRV, SSP, STC, SZC, TCO, TEI, TMO, TPVG, TROW, UCBI, UE, UGI, UNH, VIAC, VIACA, VVI, WTM, WYND\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: -114.0K)\n    - CFTC Copper speculative net positions (previous: -44.2K)\n    - CFTC Corn speculative net positions (previous: -7.1K)\n    - CFTC Crude Oil speculative net positions (previous: 431.5K)\n    - CFTC Gold speculative net positions (previous: 335.9K)\n    - CFTC Nasdaq 100 speculative positions (previous: 39.6K)\n    - CFTC Natural Gas speculative net positions (previous: -233.8K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 55.6K)\n    - CFTC Silver speculative net positions (previous: 74.8K)\n    - CFTC Soybeans speculative net positions (previous: -30.6K)\n    - CFTC Wheat speculative net positions (previous: 42.9K)\n    - Export Price Index (consensus: -0.4%, previous: 0.7%)\n    - Export Price Index (previous: 0.5%)\n    - Import Price Index (consensus: -0.8%, previous: 0.0%)\n    - Import Price Index (previous: 0.3%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.30%)\n    - Michigan Consumer Expectations (consensus: 88.2, previous: 92.1)\n    - Michigan Consumer Sentiment (consensus: 95.0, previous: 101.0)\n    - Michigan Current Conditions (consensus: 112.0, previous: 114.8)\n    - Michigan Inflation Expectations (previous: 2.4%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 682)\n    - U.S. Baker Hughes Total Rig Count (previous: 793)\n\n^^^^2020-03-11",
        "created_utc": 1583920815,
        "id": "fk6xsfr",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fk6xsfr/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583949615.0
    },
    {
        "author": "idieverynightfor8hrs",
        "body": "msi gang",
        "created_utc": 1584628868,
        "id": "fkxihqt",
        "permalink": "/r/wallstreetbets/comments/fl88p7/daily_discussion_thread_march_19_2020/fkxihqt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584657668.0
    },
    {
        "author": "Miserable_Blacksmith",
        "body": "If you have a pressure relief valve, a Aerobed pump, and an original Motorola brick phone, you can make a ventilator at home. Instructions to come.",
        "created_utc": 1584898340,
        "id": "fl7biq6",
        "permalink": "/r/wallstreetbets/comments/fm1mgt/weekend_discussion_thread_march_2022_2020/fl7biq6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584927140.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 10th of March\n\n\n\n## Upcoming events for Tuesday, March 10th\n\n - Expected earnings:\n\n  ADXS, AIH, AKBA, AKRO, APEI, APTO, ARA, ARPO, ASPU, ATXI, AU, AXLA, BBX, BCEL, BE, BIOL, BXC, CATB, CCXI, CDMO, CDXC, CLDR, CLNE, CLRB, CPSS, CRTX, CSTL, CVIA, CYD, DKS, DSKE, DTIL, EMAN, FIXX, FLGT, FLL, FTR, GNC, GPX, GRTX, HALL, HCHC, HEAR, HOOK, III, INST, KFY, KOPN, KRYS, LOMA, MOGO, MVIS, NBRV, NEX, NGM, NIO, NNVC, NOAH, NSPR, NXTC, OPGN, PAM, PEIX, PETQ, PRPL, PRVL, PSN, PTGX, PULM, QTT, RESN, REYN, RMED, RRTS, SCCO, SFST, SNSS, SPAR, STOK, STSA, SUNW, SWTX, TACT, TEUM, TISI, TLRA, TRXC, TSQ, UEC, UUUU, VIR, VSLR, VSTM, WMGI, XGN, YORW\n\n - Ex-div:\n\n  AEE, AGO, BBDC, DHF, HPE, HPQ, NWS, NWSA, RE, SFL, SR, TU, TXRH, WRB, WSBF\n\n - Economic events and announcements:\n\n    - 3-Year Note Auction (previous: 1.394%)\n    - API Weekly Crude Oil Stock (previous: 1.690M)\n    - NFIB Small Business Optimism (actual: 104.5, consensus: 104.5, previous: 104.3)\n    - Redbook (previous: -0.1%)\n    - Redbook (previous: 5.9%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, March 11th\n\n - Expected earnings:\n\n  ACEL, ADRO, AMOT, ANIX, APLT, AQMS, ARCT, AXAS, AXU, BAK, BBCP, BBW, BLFS, BREW, BSGM, CALA, CHU, CLSD, CODX, CORV, CPIX, CRHM, CRNX, DMAC, DQ, DUO, DVAX, DYAI, EVOK, EXPR, EYES, FGBI, FLNT, FPH, FPI, FSM, FTEK, GALT, GECC, GVA, HEXO, HHS, HNGR, HUD, IBN, IDN, IDRA, IDYA, IEA, INMB, INSE, INSG, INXN, JCS, KINS, LCUT, LMNR, LPCN, LPL, LQDA, MCRI, MEET, MGEN, MIRM, MNOV, MOR, MUX, NAVB, NEXT, NK, NTEC, NVAX, PDD, PDLI, PFIE, PFNX, PHI, PKOH, PRTH, PSNL, PSTI, PUK, RC, RLMD, RST, SIEN, SILV, SLDB, SLRX, SMTC, SONM, SPHS, TACO, TALO, TARA, TH, TMDI, UBX, UNFI, VCNX, VFF, VRA, VTNR, VXRT, WPM, XBIT, XERS, ZAGG\n\n - Ex-div:\n\n  AAT, ACV, AIO, ASTE, AY, BTO, CBH, DBL, DCF, DSL, ECC, EFL, EHT, EIC, EVF, FNV, FUSB, GIL, HD, HEQ, HPF, HPI, HPS, HTD, HTY, HVT, HVT.A, JBT, JHI, JHS, LGI, MDU, MNRL, MPW, NBR, NCV, NCZ, NRGX, NRIM, ORA, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, POOL, PTY, PYN, PZC, RVT, STAY, SWCH, UVE, VGI, VSH, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.622%)\n    - CPI (consensus: 0.2%, previous: 0.1%)\n    - CPI (consensus: 2.2%, previous: 2.5%)\n    - CPI Index, n.s.a. (consensus: 258.54, previous: 257.97)\n    - CPI Index, s.a (previous: 258.82)\n    - CPI, n.s.a (previous: 0.39%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.2%)\n    - Core CPI (consensus: 2.3%, previous: 2.3%)\n    - Core CPI Index (previous: 266.48)\n    - Crude Oil Imports (previous: -0.476M)\n    - Crude Oil Inventories (consensus: 1.848M, previous: 0.785M)\n    - Cushing Crude Oil Inventories (previous: -1.971M)\n    - Distillate Fuel Production (previous: -0.198M)\n    - EIA Refinery Crude Runs  (previous: -0.312M)\n    - EIA Weekly Distillates Stocks (consensus: -2.133M, previous: -4.008M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: -1.0%)\n    - Federal Budget Balance (consensus: -236.3B, previous: -33.0B)\n    - Gasoline Inventories (consensus: -2.686M, previous: -4.340M)\n    - Gasoline Production (previous: -0.040M)\n    - Heating Oil Stockpiles (previous: 0.099M)\n    - MBA 30-Year Mortgage Rate (previous: 3.57%)\n    - MBA Mortgage Applications (previous: 15.1%)\n    - MBA Purchase Index (previous: 265.8)\n    - Mortgage Market Index (previous: 754.1)\n    - Mortgage Refinance Index (previous: 3,594.4)\n    - OPEC Monthly Report\n    - Real Earnings (consensus: 0.1%, previous: 0.1%)\n    - Thomson Reuters IPSOS PCSI (previous: 62.90)\n\n## Upcoming events for Thursday, March 12th\n\n - Stock splits:\n\n    - ICD @ **1:20**\n    - INLX @ **1:50**\n\n - Expected earnings:\n\n  ADBE, ADMA, ADVM, AGEN, AGFS, AGRO, AIRI, ALDX, ALOT, AMPH, AMRS, AP, APRE, AQST, ASUR, AVDL, AVEO, AVGO, AXSM, AZUL, BAX, BDSI, BEST, BGSF, BLCM, BLPH, BPMX, BRMK, BRT, CAL, CATS, CBAY, CBPO, CELC, CELH, CEMI, CERC, CFRX, CHAP, CLUB, CNST, CPLG, CRBP, CRMD, CSU, CTK, CTXR, CUE, DG, DOCU, DOMO, EIGR, ESTE, EVFM, FLXN, FOMX, GARS, GCO, GDEN, GEN, GERN, GHG, GLMD, GPL, GPS, GRFS, GSHD, HABT, HARP, HEPA, HSDT, HTHT, HX, HZN, IGMS, IMAC, INAP, INO, INVE, IOTS, IRIX, JBL, JOBS, KALV, KRTX, LAIX, LCTX, LLEX, LX, LXRX, MBII, MBRX, MDLA, MOGU, MRAM, MYO, NBEV, NBSE, NGS, NKSH, NLTX, NNBR, NOG, NSCO, OCUL, ONVO, ORCL, PAR, PDSB, PGNX, PLSE, PLX, PRTY, PRVB, PTE, PWFL, PZG, QRHC, RDNT, REDU, REED, RFIL, RMNI, RMTI, RTIX, RUBY, SALM, SBSW, SCYX, SDPI, SEEL, SELB, SENS, SHSP, SIC, SLGG, SMTX, SNN, SPRO, SRT, SVRA, SYBX, TEF, TERP, TGEN, TLYS, TRVI, TRVN, TTPH, ULTA, UNIT, UNT, UXIN, VEON, VIE, VIVE, VOLT, VRAY, WORK, WRN, WRTC, WUBA, XCUR, XFOR, XONE, YI, YMAB, ZEAL, ZSAN, ZUMZ, ZUO\n\n - Ex-div:\n\n  ADP, ALB, AME, AMH, AMSF, APTS, AU, AVK, BBBY, BBSI, BCTF, BDC, BR, BRY, BSIG, BXMX, BXS, CAE, CCD, CCI, CCOI, CFFI, CGO, CHI, CHW, CMA, CMCT, COFS, CPG, CPK, CPZ, CRH, CRWS, CSQ, CTBI, CTS, CVE, DIAX, DPZ, DVN, ENS, EOD, ETM, ETN, EXPO, FBSS, FDUS, FFIC, FFNW, FHN, FIS, FMNB, FRO, FTAI, GBAB, GFI, GGM, GHY, GILD, GOF, GOLF, GPK, GPN, HUN, HWBK, IBKC, ICMB, IIIN, IR, ISD, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JSD, JTA, JTD, KHC, KIO, LAD, LEG, LEO, LHX, M, MAXR, MBIN, MFSF, MGPI, MNRO, MSI, MTEX, NAC, NAD, NAN, NBB, NCB, NDAQ, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMFC, NMS, NMZ, NOV, NPN, NRK, NSA, NSL, NTES, NTRS, NUV, NUW, NVG, NWE, NXJ, NXR, NYV, NZF, OCSI, OCSL, OVV, PHM, PKG, QQQX, RGR, RIVE, RNR, RRR, RS, SAH, SAMG, SCI, SJR, SLCA, SNDR, SNR, SOHO, SPXX, STRT, SYBT, TCBK, TECK, TG, THG, TRTN, TRU, TSLX, TT, TXT, UBSI, UNTY, USPH, UTMD, VLY, VRSK, WH, WMB, WOR, WSBC, WWE, XEL\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.061%)\n    - 4-Week Bill Auction (previous: 0.925%)\n    - 8-Week Bill Auction (previous: 0.820%)\n    - Continuing Jobless Claims (consensus: 1,723K, previous: 1,729K)\n    - Core PPI (consensus: 0.1%, previous: 0.5%)\n    - Core PPI (consensus: 1.7%, previous: 1.7%)\n    - Initial Jobless Claims (consensus: 218K, previous: 216K)\n    - Jobless Claims 4-Week Avg. (previous: 213.00K)\n    - Natural Gas Storage (consensus: -82B, previous: -109B)\n    - PPI (consensus: -0.1%, previous: 0.5%)\n    - PPI (consensus: 1.8%, previous: 2.1%)\n\n## Upcoming events for Friday, March 13th\n\n - Expected earnings:\n\n  ACHV, AVH, BKE, CHMA, CNAT, CTRN, GNLN, GOGO, HCAP, HDB, HHR, HROW, HSON, KIRK, NEOS, OFS, ONCS, PLXP, PTI, REXN, SINT, SOL, TEO, UBA\n\n - Ex-div:\n\n  AGM, AIG, AMPY, ANTM, ARCC, ARKR, ARR, ATRI, BAF, BANC, BBF, BBK, BBN, BCE, BCX, BDJ, BFK, BFO, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BKK, BLE, BLW, BME, BNY, BOE, BQH, BSD, BSE, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, BZM, CARO, CBU, CHS, CII, CNMD, CORE, CSFL, CSWC, CWH, DPG, DTE, EDF, EDI, EFSC, EGF, EMN, ESRT, ESSA, EVC, EXR, FCAP, FCNCA, FFG, FFIN, FG, FRA, FRT, GIM, GRMN, GROW, HES, HLNE, HRTG, HYT, IRM, ITT, JCI, JCS, JRVR, KBR, KNL, KO, LAMR, LDOS, MCA, MEN, MHD, MLR, MMD, MNE, MRCC, MRK, MTSC, MUE, MUI, MUS, NEU, NEXA, NFJ, NIE, NXPI, NXRT, OMI, PB, PFBI, PLD, PRSC, PSA, PSB, QSR, ROIC, RRBI, RWT, SBR, SELF, SFNC, SGA, SMMF, SPOK, SRF, SRV, SSP, STC, SZC, TCO, TEI, TMO, TPVG, TROW, UCBI, UE, UGI, UNH, VVI, WTM, WYND\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: -114.0K)\n    - CFTC Copper speculative net positions (previous: -44.2K)\n    - CFTC Corn speculative net positions (previous: -7.1K)\n    - CFTC Crude Oil speculative net positions (previous: 431.5K)\n    - CFTC Gold speculative net positions (previous: 335.9K)\n    - CFTC Nasdaq 100 speculative positions (previous: 39.6K)\n    - CFTC Natural Gas speculative net positions (previous: -233.8K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 55.6K)\n    - CFTC Silver speculative net positions (previous: 74.8K)\n    - CFTC Soybeans speculative net positions (previous: -30.6K)\n    - CFTC Wheat speculative net positions (previous: 42.9K)\n    - Export Price Index (consensus: -0.4%, previous: 0.7%)\n    - Export Price Index (previous: 0.5%)\n    - Import Price Index (consensus: -0.8%, previous: 0.0%)\n    - Import Price Index (previous: 0.3%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.30%)\n    - Michigan Consumer Expectations (consensus: 88.2, previous: 92.1)\n    - Michigan Consumer Sentiment (consensus: 95.0, previous: 101.0)\n    - Michigan Current Conditions (consensus: 112.0, previous: 114.8)\n    - Michigan Inflation Expectations (previous: 2.4%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 682)\n    - U.S. Baker Hughes Total Rig Count (previous: 793)\n\n^^^^2020-03-10",
        "created_utc": 1583834493,
        "id": "fk3i0wd",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fk3i0wd/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1583863293.0
    },
    {
        "author": "Xcavor",
        "body": "I just heard J-Pow got an alert on his Motorola pager.  It said \n\n911$$$Pump",
        "created_utc": 1583725339,
        "id": "fjzp7qd",
        "permalink": "/r/wallstreetbets/comments/ffj4oy/what_are_your_moves_tomorrow_march_09_2020/fjzp7qd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583754139.0
    },
    {
        "author": "YaBoyRustyTrombone",
        "body": "It's a msi laptop I got a year ago lol",
        "created_utc": 1583362427,
        "id": "fji8jgd",
        "permalink": "/r/wallstreetbets/comments/fdjqhh/what_are_your_moves_tomorrow_march_05_2020/fji8jgd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583391227.0
    },
    {
        "author": "ArtisanBurger",
        "body": "I work for Motorola and it’s honestly a pretty dope company. Definitely expect them to keep performing well!",
        "created_utc": 1583339746,
        "id": "fjh22f6",
        "permalink": "/r/wallstreetbets/comments/fdbghc/daily_discussion_thread_march_04_2020/fjh22f6/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583368546.0
    },
    {
        "author": "mixreality",
        "body": "My grandpa blew it all on Six flags (pre bankruptcy), kodak, and motorola.",
        "created_utc": 1585342589,
        "id": "flop0t9",
        "permalink": "/r/wallstreetbets/comments/fq3yp5/the_great_generational_wealth_transfer_has_begun/flop0t9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585371389.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 12th of March\n\n\n\n## Upcoming events for Thursday, March 12th\n\n - Stock splits:\n\n    - ICD @ **1:20**\n    - INLX @ **1:50**\n\n - Expected earnings:\n\n  ACER, ACRX, ADBE, ADMA, ADVM, AGEN, AGFS, AGRO, AIRI, ALDX, ALNA, ALOT, AMPH, AMRS, AP, APRE, AQST, ARAV, ASUR, AUTO, AVDL, AVEO, AVGO, AXSM, AZUL, BAX, BDSI, BEST, BGSF, BLCM, BLPH, BLRX, BPMX, BRMK, BRT, CAL, CATS, CBAY, CBPO, CELC, CELH, CEMI, CERC, CFRX, CHAP, CLDX, CLPR, CLUB, CNTG, CPLG, CRBP, CTK, CTXR, CUE, DG, DLNG, DOCU, EIGR, ESTE, EVFM, FLL, FLNT, FLXN, FRG, GARS, GCO, GDEN, GEN, GERN, GGAL, GHG, GLMD, GPL, GPS, GRFS, GSHD, HABT, HARP, HEPA, HHS, HSDT, HTGM, HX, IGMS, IMAC, INAP, INO, INVE, IOTS, IRIX, KRTX, LAIX, LCTX, LLEX, LONE, LX, LXRX, MBII, MBRX, MDLA, MOGU, MRAM, MYO, NBSE, NGS, NKSH, NLTX, NNBR, NOG, NSCO, OCUL, ONVO, ORCL, OVID, PAR, PDSB, PFSW, PGNX, PKX, PLX, PRTY, PRVB, PTE, PWFL, PZG, QRHC, RDNT, REDU, REED, RFIL, RMNI, RMTI, RTIX, RUBY, SALM, SBSW, SCYX, SDPI, SEEL, SELB, SENS, SHSP, SIC, SLGG, SNN, SPAR, SPRO, SRT, SSI, SVRA, SYBX, TEF, TERP, TGEN, TGS, TISI, TLYS, TRVI, TRVN, TTPH, UFAB, ULTA, UNIT, UNT, UXIN, VEON, VIE, VOLT, VRAY, VRCA, WORK, WRN, WRTC, WTRH, WUBA, XCUR, XFOR, XONE, YI, YMAB, ZEAL, ZSAN, ZUMZ, ZUO\n\n - Ex-div:\n\n  ADP, ALB, AME, AMH, AMSF, APTS, AU, AVK, BBBY, BBSI, BCTF, BDC, BR, BRY, BSIG, BXMX, BXS, CAE, CCD, CCI, CCOI, CFFI, CGO, CHI, CHW, CMA, CMCT, COFS, CPG, CPK, CPZ, CRH, CRWS, CSQ, CTBI, CTS, CVE, DIAX, DPZ, DVN, ENS, EOD, ETM, ETN, EXPO, FBSS, FDUS, FFIC, FFNW, FHN, FIS, FMNB, FRO, FTAI, GBAB, GFI, GGM, GHY, GILD, GOF, GOLF, GPK, GPN, HUN, HWBK, IBKC, ICMB, IIIN, IR, ISD, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JHY, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JSD, JTA, JTD, KHC, KIO, LAD, LEG, LEO, LHX, M, MAXR, MBIN, MFSF, MGPI, MNRO, MSI, MTEX, NAC, NAD, NAN, NBB, NCB, NDAQ, NEA, NEV, NHA, NID, NIQ, NJV, NKG, NKX, NMCO, NMFC, NMS, NMZ, NOV, NPN, NRK, NSA, NSL, NTES, NTRS, NUV, NUW, NVG, NWE, NXJ, NXR, NYV, NZF, OCSI, OCSL, OVV, PHM, PKG, QQQX, RGR, RIVE, RNR, RRR, RS, SAH, SAMG, SCI, SJR, SLCA, SNDR, SNR, SOHO, SPXX, STRT, SYBT, TCBK, TECK, TG, THG, TRTN, TRU, TSLX, TT, TXT, UBSI, UNTY, USPH, UTMD, VLY, VRSK, WH, WMB, WOR, WSBC, WWE, XEL\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.061%)\n    - 4-Week Bill Auction (previous: 0.925%)\n    - 8-Week Bill Auction (previous: 0.820%)\n    - Continuing Jobless Claims (consensus: 1,723K, previous: 1,729K)\n    - Core PPI (consensus: 0.1%, previous: 0.5%)\n    - Core PPI (consensus: 1.7%, previous: 1.7%)\n    - Initial Jobless Claims (consensus: 218K, previous: 216K)\n    - Jobless Claims 4-Week Avg. (previous: 213.00K)\n    - Natural Gas Storage (consensus: -59B, previous: -109B)\n    - PPI (consensus: -0.1%, previous: 0.5%)\n    - PPI (consensus: 1.8%, previous: 2.1%)\n    - Thomson Reuters IPSOS PCSI (previous: 62.90)\n\n## Upcoming events for Friday, March 13th\n\n - Expected earnings:\n\n  ACHV, AVH, BKE, CNAT, CNTY, CTRN, GNLN, GOGO, HCAP, HDB, HHR, HROW, HSON, HUGE, JBL, JKS, KIRK, NEOS, OFS, ONCS, OSTK, PLXP, REXN, SINT, SMTX, SOL, TEO\n\n - Ex-div:\n\n  AGM, AIG, AMPY, ANTM, ARCC, ARKR, ARR, ATRI, BAF, BANC, BBF, BBK, BBN, BCE, BCX, BDJ, BFK, BFO, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BKK, BLE, BLW, BME, BNY, BOE, BQH, BSD, BSE, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, BZM, CARO, CBU, CHS, CII, CNMD, CORE, CSFL, CSWC, CWH, DPG, DTE, EDF, EDI, EFSC, EGF, EMN, ESRT, ESSA, EVC, EXR, FCAP, FCNCA, FFG, FFIN, FG, FRA, FRT, GIM, GRMN, GROW, HES, HLNE, HRTG, HYT, IRM, ITT, JCI, JCS, JRVR, KBR, KNL, KO, LAMR, LDOS, MCA, MEN, MHD, MLR, MMD, MNE, MRCC, MRK, MTSC, MUE, MUI, MUS, NEU, NEXA, NFJ, NIE, NXPI, NXRT, OMI, PB, PFBI, PLD, PRSC, PSA, PSB, QSR, REYN, ROIC, RRBI, RWT, SBR, SELF, SFNC, SGA, SMMF, SPOK, SRF, SRV, SSP, STC, SZC, TCO, TEI, TMO, TPVG, TROW, UCBI, UE, UGI, UNH, VVI, WTM, WYND\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: -114.0K)\n    - CFTC Copper speculative net positions (previous: -44.2K)\n    - CFTC Corn speculative net positions (previous: -7.1K)\n    - CFTC Crude Oil speculative net positions (previous: 431.5K)\n    - CFTC Gold speculative net positions (previous: 335.9K)\n    - CFTC Nasdaq 100 speculative positions (previous: 39.6K)\n    - CFTC Natural Gas speculative net positions (previous: -233.8K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 55.6K)\n    - CFTC Silver speculative net positions (previous: 74.8K)\n    - CFTC Soybeans speculative net positions (previous: -30.6K)\n    - CFTC Wheat speculative net positions (previous: 42.9K)\n    - Export Price Index (consensus: -0.4%, previous: 0.7%)\n    - Export Price Index (previous: 0.5%)\n    - Import Price Index (consensus: -0.8%, previous: 0.0%)\n    - Import Price Index (previous: 0.3%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.30%)\n    - Michigan Consumer Expectations (consensus: 88.2, previous: 92.1)\n    - Michigan Consumer Sentiment (consensus: 95.0, previous: 101.0)\n    - Michigan Current Conditions (consensus: 112.0, previous: 114.8)\n    - Michigan Inflation Expectations (previous: 2.4%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 682)\n    - U.S. Baker Hughes Total Rig Count (previous: 793)\n\n^^^^2020-03-12",
        "created_utc": 1584007213,
        "id": "fkagnyo",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fkagnyo/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1584036013.0
    },
    {
        "author": "I-suck-at-golf",
        "body": "You’re right. I didn’t think of Android/Samsung, right?  I just never had an Android device.  By the way, does Lucasfilm/Disney get royalties for Android?  I remember Motorola paid to use “Droid”. Such a wasteful business decision. \n\nAnyway, I think you’re right about Costco. Maybe Home Depot and Lowe’s merge.  Then maybe Walmart and Target merge.  I know people will say the govt won’t allow it, but who knows what the world will look like in 50 years. People said The XM and Sirius merger would be allowed.",
        "created_utc": 1584882548,
        "id": "fl6t4tn",
        "permalink": "/r/investing/comments/fmyytg/amazon_ceo_jeff_bezos_asks_laidoff_workers_from/fl6t4tn/",
        "score": 1,
        "subreddit": "investing",
        "created": 1584911348.0
    },
    {
        "author": "gbtwo88",
        "body": "He hit him up on hos 2-way Motorola",
        "created_utc": 1584823956,
        "id": "fl4xs72",
        "permalink": "/r/wallstreetbets/comments/fmm4q9/going_all_in_on_sabre_schlongs_out_for_the_boys/fl4xs72/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1584852756.0
    },
    {
        "author": "AILOC82",
        "body": "You have a point, however the stock market in general goes up on the long run, however you have to follow-up th performances of the individual stocks. Sometimes companies choose the wrong strategy with all impacts.\n\nFor example, what if I had bought Nokia, Ericsson, Motorola beginning 2000 and use buy and hold forever? There always companies dominating the world, but not always the same and nearly never forever...\n\nLet's look at 20 year high:\n\n\\- Nokia -94%  \n\\- Ericcsson -94%  \n\\- Motorola -33%  \n\\- Welss Fargo -38%\n\nOn the other hand, Microsoft kept growing and reached her all time high just one month ago.",
        "created_utc": 1583069300,
        "id": "fj6eisg",
        "permalink": "/r/investing/comments/fbtkmt/buy_and_hold_strategy/fj6eisg/",
        "score": 1,
        "subreddit": "investing",
        "created": 1583098100.0
    },
    {
        "author": "PM_ME_TENDIEZ",
        "body": "Went from Motorola to a primeco phone",
        "created_utc": 1585466439,
        "id": "fltbxdh",
        "permalink": "/r/wallstreetbets/comments/fr1jn0/what_to_expect_next_week/fltbxdh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1585495239.0
    },
    {
        "author": "rodal126",
        "body": "Nokia or Motorola",
        "created_utc": 1583093179,
        "id": "fj7lel0",
        "permalink": "/r/stocks/comments/fbveyz/why_not_just_own_msft_aapl_stocks/fj7lel0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583121979.0
    },
    {
        "author": "seanjbln",
        "body": "I wonder how many people remember the actual origin of the \"$MU $90 Calls\" saying, if If I recall it was around that time.",
        "created_utc": 1583090455,
        "id": "fj7ehdo",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj7ehdo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583119255.0
    },
    {
        "author": "jahsrest",
        "body": "I agree. I miss hearing moho drone about MU and  actually DD..",
        "created_utc": 1583053630,
        "id": "fj62ma8",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj62ma8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583082430.0
    },
    {
        "author": "haarp1",
        "body": "MU as in micron?",
        "created_utc": 1583084466,
        "id": "fj71eq5",
        "permalink": "/r/wallstreetbets/comments/fbhqn8/how_was_trading_like_during_20072008_crisis/fj71eq5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583113266.0
    },
    {
        "author": "eowobble",
        "body": "Here are the usual caveats:  I'm just a guy in my bedroom.  I don't have a fancy MBA or work at some prestigious, boutique financial firm.  I'm just a guy trying to day/swing-trade for a living in my humble abode.  Watching the show, *Billions*, back in 2016 is what first piqued my interest.  And I started actively trading at the beginning of 2019.\n\n**One:**  Re hard economic data and China-- It's a country of \\~1.4 billion people.  Because of the one-child policy that lasted for decades, there's also a pretty big M/F gender disparity.  Additionally, in such a top-heavy government, Xi cannot afford to look weak for much longer; his COVID-19 honeymoon is quickly waning, IMHO.  Many big companies are already highly automated anyways.  Those of them that aren't will simply throw human bodies at the assembly lines to meet production quotas again, regardless of the infections.  Remember, there are no human rights in China; it's a communist state.  Either come to work or you're fired and will never work again *anywhere* for the rest of your days.  I recall that scene from Chernobyl where the workers were already so badly radiated that they decided to just keep shoveling the uranium \"for the greater good.\"  In times of crisis, humans lives (esp in communist states) are forfeit and cheap in the mission of the almighty dollar/RMB.  Gotta keep the engine of capitalism humming!  (There is some great irony in this, I know.)\n\n**Two:**  Looking forward, what is the strategic macro picture?  Here's my speculation for several moves ahead on the board:\n\n\\- Meat-space is going to get increasingly more fraught.  I currently live in an apt rental complex and I already see those Amazon Prime vans making multiple trips *a day* delivering stuff to our complex.  Millennials are already reluctant to go outside.  My God, back in my day, going to the mall, getting pizza, and hanging out at the arcade was a thing.  [Nowadays.](https://www.theatlantic.com/notes/2019/05/dead-malls-everywhere/588970/) \n\n\\- The other day I was in line at our local Walmart (when times are good, it's Target and Whole Foods.  When times are like now, it's Walmart and Aldi's) and some guy ahead of me was in line was trying to use multiple gift cards to make a huge purchase.  There was some problem with the register and the whole ordeal took something like ten minutes as the queue grew increasingly long, with everyone inline considerably annoyed.   Yes, there was something like twenty registers, but only three were manned at the time (it was a weekday afternoon).  I mean, seriously, can you blame millennials for not wanting to venture out into meat-space?  It's awful.\n\n\\- So back to now:  What are the implications of COVID-19?  Will it make meat-space more attractive or less?  You do that math.  My feeling is that the Coronavirus will just accelerate what had already been a growing trend:  People doing more commerce from home, people being more entertained at home, etc.  I'm a big follower of a16z and their big claim to fame is *\"Software is Eating the World.\"*  I wholeheartedly believe in that.  This is why I currently have huge positions and am overweight in memory and semiconductors.  I believe in more datacenters, more people going online (according to Andreessen, only half of the global population is currently online.  Vast swathes of South America, Africa, etc are still in the queue), and the basic human way-of-life is fundamentally changing.\n\n**Also:**  I do believe we'll eventually figure out crypto.  And that translates into (my belief, anyway) a big/bright future for semis and memory.  Long AMD and MU!",
        "created_utc": 1583089449,
        "id": "fj7bysg",
        "permalink": "/r/stocks/comments/fbvv8p/two_reasons_the_market_will_rebound_sooner_than/fj7bysg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583118249.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "Oh shit just had one cough ...\n\n\nOh no \n\nImagine if the BULLKHAN got coronavirus...\n\nThat’s would be all it takes to scale us to a RECCESION this country has never seen before \n\n\nThen again I’m not over 50 so mu immune system would DESTORY that weak pussy virus 🦠 \n\nAnd I would take a shit load of monster energy and vitamins c",
        "created_utc": 1583056131,
        "id": "fj64e8m",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj64e8m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583084931.0
    },
    {
        "author": "jonnydoo84",
        "body": "Mu 90 7/20  , i'm playing it safe.",
        "created_utc": 1583074654,
        "id": "fj6l3it",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj6l3it/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583103454.0
    },
    {
        "author": "v101Tdr",
        "body": "Check the infographic (the last link on my post). Also note that APT N95 respirators use 0.1 micron filters which are 3 times better (smaller) than the official CDC spec andbthey are CDC approved.",
        "created_utc": 1583074650,
        "id": "fj6l3az",
        "permalink": "/r/stocks/comments/fbr5qp/lets_get_a_few_things_straight_about_masks_and/fj6l3az/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583103450.0
    },
    {
        "author": "3rdWaveHarmonic",
        "body": "Unless it's MU 90",
        "created_utc": 1583080343,
        "id": "fj6uc81",
        "permalink": "/r/wallstreetbets/comments/fbvbcr/mods_please_impose_a_minimum_subscription_period/fj6uc81/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583109143.0
    },
    {
        "author": "Mint_Juul",
        "body": "Pretty sure he meant to say MU 95",
        "created_utc": 1583078925,
        "id": "fj6s1xl",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj6s1xl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583107725.0
    },
    {
        "author": "crjlsm",
        "body": "So is this bad or good for MU",
        "created_utc": 1583078592,
        "id": "fj6rinq",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj6rinq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583107392.0
    },
    {
        "author": "Kbearforlife",
        "body": "You know how you put your socks away in the sock drawer?\n\nBasically the same thing except you put your life savings of Burger King checks into $MU",
        "created_utc": 1583060354,
        "id": "fj67b27",
        "permalink": "/r/wallstreetbets/comments/fbqhmr/breaking_usps_package_handler_is_confirmed_to/fj67b27/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583089154.0
    },
    {
        "author": "JaeRex",
        "body": "Mu 90 c 3/6",
        "created_utc": 1583074454,
        "id": "fj6ktgb",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj6ktgb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583103254.0
    },
    {
        "author": "TheShorterShortBus",
        "body": "$MU 90C 3/6",
        "created_utc": 1583072909,
        "id": "fj6inzd",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj6inzd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583101709.0
    },
    {
        "author": "boolinschool",
        "body": "I appreciate your quick google search on the size of a virus but you obviously have no idea how disease is spread. Viruses are not spread as standalone particles they are spread via droplet particles in the air which are larger than .3 micron in size. So yes, a virus is smaller than .3 microns but it’s transport medium is not. \n\nThere *is* a reason they’re the standard for medical professionals lol",
        "created_utc": 1583086792,
        "id": "fj75c8t",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj75c8t/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583115592.0
    },
    {
        "author": "Captain__Yolo",
        "body": "[Here](https://i.imgur.com/sr5GovZ.jpg) is how bad it was. I died to bad calls back in the MU days plus desperation. I never expected to come back. But last week I rolled TSLA puts into more puts and more and finished by turning them into calls Friday, and here we are.\n\nEdit: [Bonus shot of the month](https://i.imgur.com/PFOV2lW.jpg) Also I don't feel I learned anything, it's all luck.",
        "created_utc": 1583199460,
        "id": "fjbqwsm",
        "permalink": "/r/wallstreetbets/comments/fcmusu/heres_my_mod_application/fjbqwsm/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1583228260.0
    },
    {
        "author": "seanjbln",
        "body": "I wonder how many people remember the actual origin of the \"$MU $90 Calls\" saying, if If I recall it was around that time.",
        "created_utc": 1583090455,
        "id": "fj7ehdo",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj7ehdo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1583119255.0
    },
    {
        "author": "fcf-whore",
        "body": "Are my MU April 55/60 debits gonna give me tendies?",
        "created_utc": 1583138861,
        "id": "fj9a4c7",
        "permalink": "/r/wallstreetbets/comments/fc0mpi/what_are_your_moves_tomorrow_march_02_2020/fj9a4c7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583167661.0
    },
    {
        "author": "jahsrest",
        "body": "I agree. I miss hearing moho drone about MU and  actually DD..",
        "created_utc": 1583053630,
        "id": "fj62ma8",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj62ma8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583082430.0
    },
    {
        "author": "haarp1",
        "body": "MU as in micron?",
        "created_utc": 1583084466,
        "id": "fj71eq5",
        "permalink": "/r/wallstreetbets/comments/fbhqn8/how_was_trading_like_during_20072008_crisis/fj71eq5/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583113266.0
    },
    {
        "author": "bd_one",
        "body": "Anyone here making plays on MU like the good old days?",
        "created_utc": 1583167445,
        "id": "fja6lpj",
        "permalink": "/r/wallstreetbets/comments/fcaiav/daily_discussion_thread_march_02_2020/fja6lpj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583196245.0
    },
    {
        "author": "IpMedia",
        "body": "What you don't like my weekly $MU pep rally posts?",
        "created_utc": 1583101954,
        "id": "fj7zuif",
        "permalink": "/r/wallstreetbets/comments/fbvbcr/mods_please_impose_a_minimum_subscription_period/fj7zuif/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583130754.0
    },
    {
        "author": "eowobble",
        "body": "Here are the usual caveats:  I'm just a guy in my bedroom.  I don't have a fancy MBA or work at some prestigious, boutique financial firm.  I'm just a guy trying to day/swing-trade for a living in my humble abode.  Watching the show, *Billions*, back in 2016 is what first piqued my interest.  And I started actively trading at the beginning of 2019.\n\n**One:**  Re hard economic data and China-- It's a country of \\~1.4 billion people.  Because of the one-child policy that lasted for decades, there's also a pretty big M/F gender disparity.  Additionally, in such a top-heavy government, Xi cannot afford to look weak for much longer; his COVID-19 honeymoon is quickly waning, IMHO.  Many big companies are already highly automated anyways.  Those of them that aren't will simply throw human bodies at the assembly lines to meet production quotas again, regardless of the infections.  Remember, there are no human rights in China; it's a communist state.  Either come to work or you're fired and will never work again *anywhere* for the rest of your days.  I recall that scene from Chernobyl where the workers were already so badly radiated that they decided to just keep shoveling the uranium \"for the greater good.\"  In times of crisis, humans lives (esp in communist states) are forfeit and cheap in the mission of the almighty dollar/RMB.  Gotta keep the engine of capitalism humming!  (There is some great irony in this, I know.)\n\n**Two:**  Looking forward, what is the strategic macro picture?  Here's my speculation for several moves ahead on the board:\n\n\\- Meat-space is going to get increasingly more fraught.  I currently live in an apt rental complex and I already see those Amazon Prime vans making multiple trips *a day* delivering stuff to our complex.  Millennials are already reluctant to go outside.  My God, back in my day, going to the mall, getting pizza, and hanging out at the arcade was a thing.  [Nowadays.](https://www.theatlantic.com/notes/2019/05/dead-malls-everywhere/588970/) \n\n\\- The other day I was in line at our local Walmart (when times are good, it's Target and Whole Foods.  When times are like now, it's Walmart and Aldi's) and some guy ahead of me was in line was trying to use multiple gift cards to make a huge purchase.  There was some problem with the register and the whole ordeal took something like ten minutes as the queue grew increasingly long, with everyone inline considerably annoyed.   Yes, there was something like twenty registers, but only three were manned at the time (it was a weekday afternoon).  I mean, seriously, can you blame millennials for not wanting to venture out into meat-space?  It's awful.\n\n\\- So back to now:  What are the implications of COVID-19?  Will it make meat-space more attractive or less?  You do that math.  My feeling is that the Coronavirus will just accelerate what had already been a growing trend:  People doing more commerce from home, people being more entertained at home, etc.  I'm a big follower of a16z and their big claim to fame is *\"Software is Eating the World.\"*  I wholeheartedly believe in that.  This is why I currently have huge positions and am overweight in memory and semiconductors.  I believe in more datacenters, more people going online (according to Andreessen, only half of the global population is currently online.  Vast swathes of South America, Africa, etc are still in the queue), and the basic human way-of-life is fundamentally changing.\n\n**Also:**  I do believe we'll eventually figure out crypto.  And that translates into (my belief, anyway) a big/bright future for semis and memory.  Long AMD and MU!",
        "created_utc": 1583089449,
        "id": "fj7bysg",
        "permalink": "/r/stocks/comments/fbvv8p/two_reasons_the_market_will_rebound_sooner_than/fj7bysg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583118249.0
    },
    {
        "author": "Rectalcactus",
        "body": "Mu puts were actually up from Friday this morning. Too bad i couldn't sell.",
        "created_utc": 1583178272,
        "id": "fjaptnp",
        "permalink": "/r/wallstreetbets/comments/fcaiav/daily_discussion_thread_march_02_2020/fjaptnp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583207072.0
    },
    {
        "author": "love2fuckbearasshoe",
        "body": "Oh shit just had one cough ...\n\n\nOh no \n\nImagine if the BULLKHAN got coronavirus...\n\nThat’s would be all it takes to scale us to a RECCESION this country has never seen before \n\n\nThen again I’m not over 50 so mu immune system would DESTORY that weak pussy virus 🦠 \n\nAnd I would take a shit load of monster energy and vitamins c",
        "created_utc": 1583056131,
        "id": "fj64e8m",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj64e8m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583084931.0
    },
    {
        "author": "jonnydoo84",
        "body": "Mu 90 7/20  , i'm playing it safe.",
        "created_utc": 1583074654,
        "id": "fj6l3it",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj6l3it/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583103454.0
    },
    {
        "author": "v101Tdr",
        "body": "Check the infographic (the last link on my post). Also note that APT N95 respirators use 0.1 micron filters which are 3 times better (smaller) than the official CDC spec andbthey are CDC approved.",
        "created_utc": 1583074650,
        "id": "fj6l3az",
        "permalink": "/r/stocks/comments/fbr5qp/lets_get_a_few_things_straight_about_masks_and/fj6l3az/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583103450.0
    },
    {
        "author": "3rdWaveHarmonic",
        "body": "Unless it's MU 90",
        "created_utc": 1583080343,
        "id": "fj6uc81",
        "permalink": "/r/wallstreetbets/comments/fbvbcr/mods_please_impose_a_minimum_subscription_period/fj6uc81/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583109143.0
    },
    {
        "author": "kbthroaway723",
        "body": "I’m heavily in on NVDA. Their earnings were incredible and outlook is still strong. They’re the most dominant operator in the space (lol @ AMD MU)",
        "created_utc": 1583109387,
        "id": "fj8bb4l",
        "permalink": "/r/wallstreetbets/comments/fc3j65/strong_tech_stocks_for_potential_market_rebound/fj8bb4l/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583138187.0
    },
    {
        "author": "warren_buffoon",
        "body": "$MU 90 LEAPs looking cheap",
        "created_utc": 1583167586,
        "id": "fja6uiq",
        "permalink": "/r/wallstreetbets/comments/fcaiav/daily_discussion_thread_march_02_2020/fja6uiq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583196386.0
    },
    {
        "author": "dirks74",
        "body": "You cant time the market. This morning (gmt+1), I was sure that $APPL and $MU will go down. I was almost about to sell, when I changed my mind. Now both are up. If I had cash right now, I would just buy a bit every other day and try to average the cost.",
        "created_utc": 1583178116,
        "id": "fjapjku",
        "permalink": "/r/stocks/comments/fc8x7x/rstocks_daily_discussion_monday_mar_02_2020/fjapjku/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583206916.0
    },
    {
        "author": "Autistictradeguy",
        "body": "I became interested in investing and have similar love for tech like you. I have great success day trading options on semiconductor stocks liKE $AMD and $INTC.  $NVDA, $MU, $$AMAT, are all good chip makers. For a couple of months I could choose any one of those tickers, buy a given otm call and pretty much be set. $QCOM is great too, practically a monopoly on ARM based architecture which is proabbaly the future of full size chips.",
        "created_utc": 1583186682,
        "id": "fjb55q1",
        "permalink": "/r/investing/comments/fcjpl4/asking_for_investment_advice/fjb55q1/",
        "score": 1,
        "subreddit": "investing",
        "created": 1583215482.0
    },
    {
        "author": "Mint_Juul",
        "body": "Pretty sure he meant to say MU 95",
        "created_utc": 1583078925,
        "id": "fj6s1xl",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj6s1xl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583107725.0
    },
    {
        "author": "crjlsm",
        "body": "So is this bad or good for MU",
        "created_utc": 1583078592,
        "id": "fj6rinq",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj6rinq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583107392.0
    },
    {
        "author": "Kbearforlife",
        "body": "You know how you put your socks away in the sock drawer?\n\nBasically the same thing except you put your life savings of Burger King checks into $MU",
        "created_utc": 1583060354,
        "id": "fj67b27",
        "permalink": "/r/wallstreetbets/comments/fbqhmr/breaking_usps_package_handler_is_confirmed_to/fj67b27/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583089154.0
    },
    {
        "author": "ajdaconman1",
        "body": "MU",
        "created_utc": 1583162330,
        "id": "fj9y5mo",
        "permalink": "/r/wallstreetbets/comments/fcaiav/daily_discussion_thread_march_02_2020/fj9y5mo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583191130.0
    },
    {
        "author": "absorbantobserver",
        "body": "So if I read that right both my WMT and MU positions go against the big boys toward EOM. Guess we'll see how that goes.",
        "created_utc": 1583176845,
        "id": "fjanagl",
        "permalink": "/r/wallstreetbets/comments/fch3wg/aggressiveunusual_options_disuberbigtwtrwmt/fjanagl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583205645.0
    },
    {
        "author": "Fallen1331",
        "body": "Good plan. Ive been saving most of mu cash to quadruple down the lower we go",
        "created_utc": 1583180517,
        "id": "fjatvvv",
        "permalink": "/r/wallstreetbets/comments/fcaiav/daily_discussion_thread_march_02_2020/fjatvvv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583209317.0
    },
    {
        "author": "Chaldeany",
        "body": "Buy mu, intl, amd, msft, tsm, appl, skyy, nvda",
        "created_utc": 1583135254,
        "id": "fj97chy",
        "permalink": "/r/stocks/comments/fc7fdg/15yrs_old_with_1000_to_invest_need_advice/fj97chy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583164054.0
    },
    {
        "author": "meoraine",
        "body": "This COVID19 is airborne, so in this case the virus particles can be as small as 0.1 micron. So a 0.3 micro mask is.................................",
        "created_utc": 1583154161,
        "id": "fj9n1ox",
        "permalink": "/r/stocks/comments/fbr5qp/lets_get_a_few_things_straight_about_masks_and/fj9n1ox/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583182961.0
    },
    {
        "author": "MasterJeebus",
        "body": "Mu is not a good one. I remember buying it at $57 then it went down and took almost a year before i could get out of it.   Amd, Msft and Apple are pretty good choices though.",
        "created_utc": 1583136738,
        "id": "fj98hnf",
        "permalink": "/r/stocks/comments/fc7fdg/15yrs_old_with_1000_to_invest_need_advice/fj98hnf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583165538.0
    },
    {
        "author": "JaeRex",
        "body": "Mu 90 c 3/6",
        "created_utc": 1583074454,
        "id": "fj6ktgb",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj6ktgb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583103254.0
    },
    {
        "author": "TheShorterShortBus",
        "body": "$MU 90C 3/6",
        "created_utc": 1583072909,
        "id": "fj6inzd",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj6inzd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583101709.0
    },
    {
        "author": "big_b_44",
        "body": "MU $90C",
        "created_utc": 1583148767,
        "id": "fj9hlw0",
        "permalink": "/r/wallstreetbets/comments/fcaiav/daily_discussion_thread_march_02_2020/fj9hlw0/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583177567.0
    },
    {
        "author": "Chaldeany",
        "body": "Mu, intl, amd, tsm, skyy, clou, amd, msft, tsla, nflx, apple. Everything 20% off.",
        "created_utc": 1583121861,
        "id": "fj8tkji",
        "permalink": "/r/stocks/comments/fc6a1z/have_1100_to_invest_in_stocks_where_do_i_start/fj8tkji/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583150661.0
    },
    {
        "author": "v101Tdr",
        "body": "1. The APT N95 respirators actually have 0.1 micron sized filters, so they are above official spec.\n2. This virus is not airborne. Lay off the the conspitacy theory blogs.",
        "created_utc": 1583156610,
        "id": "fj9q0k7",
        "permalink": "/r/stocks/comments/fbr5qp/lets_get_a_few_things_straight_about_masks_and/fj9q0k7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1583185410.0
    },
    {
        "author": "boolinschool",
        "body": "I appreciate your quick google search on the size of a virus but you obviously have no idea how disease is spread. Viruses are not spread as standalone particles they are spread via droplet particles in the air which are larger than .3 micron in size. So yes, a virus is smaller than .3 microns but it’s transport medium is not. \n\nThere *is* a reason they’re the standard for medical professionals lol",
        "created_utc": 1583086792,
        "id": "fj75c8t",
        "permalink": "/r/wallstreetbets/comments/fb1gsq/weekend_discussion_thread_february_28_march_1_2020/fj75c8t/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1583115592.0
    },
    {
        "author": "seth0414",
        "body": "MU moooooooooooonnnnnnnn",
        "created_utc": 1583117410,
        "id": "fj8nbix",
        "permalink": "/r/wallstreetbets/comments/fc0mpi/what_are_your_moves_tomorrow_march_02_2020/fj8nbix/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1583146210.0
    }
]