[
    {
        "author": "_MrPants_",
        "body": "EROS\n\nThe company just announced that it will collaborate with Epic Games to use their “Unreal Engine” for future productions.\n\n[Epic Games/Eros Collaboration ](https://www.businesswire.com/news/home/20200603005445/en/Eros-International-Epic-Games-Collaborate-Develop-Harness)\n\nThe company will also be merging with STX Entertainment near the end of June as most already know.\n\nhttps://www.reuters.com/article/eros-ma-stx-entertainment/update-1-indias-eros-international-to-merge-with-stx-entertainment-idUSL4N2C546F\n\nThey will also be presenting tomorrow at the Gabelli 12th Annual Entertainment and Broadcasting Conference\n\nhttps://www.otcdynamics.com/eros-eros-international-plc-to-present-at-the-gabelli-12th-annual-entertainment-broadcasting-conference/?utm_campaign=twitter&amp;amp;amp;amp;amp;utm_medium=twitter&amp;amp;amp;amp;amp;utm_source=twitter\n\nThen there’s a nice tweet that just mentions how Epic Games Unreal Engine has been used in the production of Disney’s  “The Mandalorian”\n\nhttps://twitter.com/ErosIntlPlc/status/1268225553364070406?s=20\n\nI don’t have any projections but I definitely think this could gain quite a bit in the next month or two. Hit a high of 4.33 when the merger was announced in mid April.",
        "created_utc": 1591227807,
        "id": "fssy984",
        "permalink": "/r/pennystocks/comments/gw470b/eros_a_stock_that_is_trending_quite_well/fssy984/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1591256607.0
    },
    {
        "author": "makeitrain92",
        "body": "They already announced merger with STX",
        "created_utc": 1591851235,
        "id": "ftny8tk",
        "permalink": "/r/stocks/comments/h0s9xq/thoughts_on_eros/ftny8tk/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1591880035.0
    },
    {
        "author": "harsh-truth",
        "body": "Only 9 trading days or less until the final $EROS STX merger. Loading up more on the Monday morning dip. 3000 shares and counting plus options out the wazoo. Dream of Lambos all you want, I just need to payoff the IRS $23K",
        "created_utc": 1591474931,
        "id": "ft6i4ar",
        "permalink": "/r/pennystocks/comments/gxxkmq/looking_for_plays_on_monday/ft6i4ar/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1591503731.0
    },
    {
        "author": "TAWS",
        "body": "Seagate just laid off people. RIP",
        "created_utc": 1591133819,
        "id": "fsohabq",
        "permalink": "/r/wallstreetbets/comments/gveovr/what_are_your_moves_tomorrow_june_03_2020/fsohabq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591162619.0
    },
    {
        "author": "squash_money",
        "body": "Stay at home stock that has been under the radar. Competing with amazon and Netflix for market share in India.  EROS is big in tier 2/3 Indian cities. Tier 2/3 cities are finally to get connected to the rest of the world.  Many great partnership globally. Hard to measure right now without seeing STX financials.",
        "created_utc": 1591854209,
        "id": "fto25e5",
        "permalink": "/r/stocks/comments/h0s9xq/thoughts_on_eros/fto25e5/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591883009.0
    },
    {
        "author": "sHoRtThEvIx1337",
        "body": "Held NYMT since it was $0.98 in March, PMT, OAS, SAVE, RLGY, and MPLX since April and early May. Dumped all of them and went 50% cash. Have the rest riding on TEAM (position I've held for a few years), NET, UPWK, DT, STX, and CSCO... And TXMD for some reason.",
        "created_utc": 1591833574,
        "id": "ftn3yzf",
        "permalink": "/r/wallstreetbets/comments/h0iz8p/what_are_your_moves_tomorrow_june_11_2020/ftn3yzf/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591862374.0
    },
    {
        "author": "ReallyDankWeed",
        "body": "Any thoughts on STX? Seems to be a good long term hold",
        "created_utc": 1591712719,
        "id": "fth8sef",
        "permalink": "/r/stocks/comments/gzirut/rstocks_daily_discussion_technicals_tuesday_jun/fth8sef/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591741519.0
    },
    {
        "author": "j33tAy",
        "body": "My WSB portfolio is SPY 310C for next Friday. I only have 10 contracts because I haven't been YOLOing much lately. \n\nMy IRA is about 80% in XLF and I have 2k shares. The rest is in STX, AMD, EEM and XLE shares. I sell weekly calls on all of this. Also 10 shares each of about a dozen or so SPACs\n\nMy 401k is like half bonds now because I'm a closet bear. Not gay enough to buy puts but at least gonna try to rebalance it at a lower cost basis if we drop.",
        "created_utc": 1593130742,
        "id": "fw0fnxz",
        "permalink": "/r/wallstreetbets/comments/hftlh2/bank_stress_test_results/fw0fnxz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593159542.0
    },
    {
        "author": "prairiechicken80",
        "body": "Gonna watch the EROS international (Bollywood) merger with STX entertainment (Hollywood) tomorrow morning. Hope it soars! Tencent owns 5% of STX already. Looking for a bright green in all the red.",
        "created_utc": 1593388681,
        "id": "fwbfaek",
        "permalink": "/r/wallstreetbets/comments/hhle53/what_are_your_moves_tomorrow_june_29_2020/fwbfaek/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593417481.0
    },
    {
        "author": "kono88",
        "body": "yeah.. and altho, STX does come out with good movies, but it is not the type of movie that scream blockbuster.  Sadly.",
        "created_utc": 1591293703,
        "id": "fsvu3jp",
        "permalink": "/r/pennystocks/comments/gwm6nk/eros_the_next_gnus_perhaps/fsvu3jp/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1591322503.0
    },
    {
        "author": "well_thatsgreat",
        "body": "Does anyone know why companies are doing debt tender offers? HP, Disney, Viacom, Seagate, Marriott, Prologis, etc.",
        "created_utc": 1592407316,
        "id": "fv4p4r5",
        "permalink": "/r/stocks/comments/hamzu6/rstocks_daily_discussion_wednesday_jun_17_2020/fv4p4r5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592436116.0
    },
    {
        "author": "NeededToRant",
        "body": "Yeah, I have the same thought prosses. Most of these will be long term and maybe a few short terms to learn the markets. I will for sure look into Docusign/adobe. I think cloud services will be pretty important, especially for storage. I was also thinking about Seagate since SSD's and M2 storage will probably be the future",
        "created_utc": 1591580755,
        "id": "ftbs093",
        "permalink": "/r/stocks/comments/gyo6kj/firsttime_investor_rate_my_picks/ftbs093/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591609555.0
    },
    {
        "author": "Wushetam",
        "body": "Merging with STX entertainment sometime in the next 3 weeks. The CEO said it would be around June 20th.",
        "created_utc": 1591285208,
        "id": "fsvbsb9",
        "permalink": "/r/pennystocks/comments/gwjru4/thoughts_on_eros/fsvbsb9/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591314008.0
    },
    {
        "author": "andrewchapman17",
        "body": "Eros Now already has a large subscriber base over 28 million which is about the same amount as hulu subscriber base. India’s population is over 1.38billion while the United states is under 400million the amount of possible growth here is exponential especially with india also being the fastest growing internet usage in the world less than 50% of their population has internet access as of now. Eros International is focusing on their ott platform (eros now and eros now prime) eros now prime (english tier featuring content from nbcuniversal and stx entertainment) to be launched originally in june set back because of covid 19.",
        "created_utc": 1593309859,
        "id": "fw85v02",
        "permalink": "/r/pennystocks/comments/hesnz4/eros_an_undervalued_merger_play/fw85v02/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593338659.0
    },
    {
        "author": "prairiechicken80",
        "body": "EROS merger Monday with STX.",
        "created_utc": 1593315238,
        "id": "fw8e8m7",
        "permalink": "/r/StockMarket/comments/hh0emg/wall_street_week_ahead_for_the_trading_week/fw8e8m7/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593344038.0
    },
    {
        "author": "j33tAy",
        "body": "&gt; ~70% TNW\nWhat is an \"acceptable\" range and how is it different than other sectors that are seen by bears as overvalued like tech or health.\n\nNot trying to be dismissive. I literally just have no idea where banks have historically traded on TNW.\n\nAnd like the other guy said aren't all prices sort of disconnected because of absurd P/E? I've been trying to load up on stock that is low P/E but relatively high IV to sell calls on. See $STX for example.\n\nHowever, I'm also holding 500 XLF for the same reason to sell covered calls on.",
        "created_utc": 1593025018,
        "id": "fvvobqv",
        "permalink": "/r/wallstreetbets/comments/hf3gde/the_retards_here_convinced_him_he_was_wrong_and/fvvobqv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593053818.0
    },
    {
        "author": "Orion8x3",
        "body": "I have STX for my long term hold in the tech sector. That’s just me and how I handle my portfolio.. intel is a solid choice tho. Few guys at work have it.",
        "created_utc": 1592311025,
        "id": "fv07jw6",
        "permalink": "/r/stocks/comments/ha32p6/intc/fv07jw6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592339825.0
    },
    {
        "author": "ReflectAA",
        "body": "The only industries I’ve invested in the last 10 or so years:\n\nSocial media/Ad services (eg: FB, Google)\nMultimedia services (Disney, Netflix, Apple)\nConsumer Tech (Apple, Seagate, Blackberry)\nMicrochips (AMD)\nBiotech/pharma (eg: NBEV, AMRS, JNJ, MRNA)\nRetail\nRestaurants\nAirlines/Airline-related (DAL, BA)\nAuto/Auto-related (GM, UBER, HTZ)\nWireless/internet (CMCSA, AT&amp;T, VZ)\nBanking (BAC, WFC)\n\nThe examples are just examples, I didn’t invest in all of these companies but I did at least consider all of them.  \n\nAnd then some industries I stay out of because I haven’t researched and don’t have time or interest in doing so. Which isn’t to say they look like bad industries. Just ones I’m not comfortable touching until I research the whole industry at once:\n\nPayment services (PayPal, Square)\nBetting/gaming\nSolar energy\nCommodities and commodity related goods (oil, gas, diamonds, gold, etc...)\nOther areas of tech (graphics like NVidia, tech security like Fortinet, cloud services)\n\nI’m sure there’s way more I’m forgetting.",
        "created_utc": 1592056001,
        "id": "fupa6ap",
        "permalink": "/r/stocks/comments/h7wt9t/to_fellow_fresh_meat_investors_like_me_and_to/fupa6ap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592084801.0
    },
    {
        "author": "Ay-Rod",
        "body": "This is very underrated atm. The merger with STX entertainment is bigger than people think",
        "created_utc": 1591359932,
        "id": "fsysay8",
        "permalink": "/r/pennystocks/comments/gx19ca/reasons_to_buy_eros/fsysay8/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591388732.0
    },
    {
        "author": "troppofigocanadese",
        "body": "what? its not a SPAC. Merging with STX",
        "created_utc": 1592976858,
        "id": "fvtollj",
        "permalink": "/r/wallstreetbets/comments/helxve/what_are_your_moves_tomorrow_june_24_2020/fvtollj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593005658.0
    },
    {
        "author": "j33tAy",
        "body": "I'd like to add $STX to the list for great wheel stocks. \n\nSeagate has been around through two recessions, has a solid grasp on the global hard drive market, P/E of 9 and IV lately around 50%. It's a good company and part of my long hold portfolio anyway.\n\nTrades around $47 right now.",
        "created_utc": 1593090086,
        "id": "fvy80jz",
        "permalink": "/r/options/comments/hfc4ce/intro_to_the_wheel_strategy_for_beginners/fvy80jz/",
        "score": 1,
        "subreddit": "options",
        "created": 1593118886.0
    },
    {
        "author": "prairiechicken80",
        "body": "EROS and STX Entertainment merger Monday hopefully gets some PR.",
        "created_utc": 1593316568,
        "id": "fw8g7gi",
        "permalink": "/r/wallstreetbets/comments/hgeyf9/weekend_discussion_thread_for_the_weekend_of_june/fw8g7gi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593345368.0
    },
    {
        "author": "prairiechicken80",
        "body": "Especially because Tencent $TCEHY has had an “undisclosed” investment in STX for years. The plans they must be making behind the scenes....",
        "created_utc": 1593383011,
        "id": "fwb515i",
        "permalink": "/r/StockMarket/comments/hh0emg/wall_street_week_ahead_for_the_trading_week/fwb515i/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593411811.0
    },
    {
        "author": "prairiechicken80",
        "body": "EROS international merging with STX entertainment tomorrow. TCEHY (Tencent) invested in STX years ago. Can’t wait to see if this flies.",
        "created_utc": 1593384529,
        "id": "fwb7vsl",
        "permalink": "/r/pennystocks/comments/hhj5st/june_28_2020_tomorrows_daily_rpennystocks/fwb7vsl/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593413329.0
    },
    {
        "author": "j33tAy",
        "body": "$STX has a P/E of like 7 but IV of 55%\n\nProb one of the best stocks right now to hold shares and sell calls on\n\nI'm in 200 shares",
        "created_utc": 1593444345,
        "id": "fwdhzu7",
        "permalink": "/r/wallstreetbets/comments/hfqyf4/stx_alert_hop_on_in_boys/fwdhzu7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593473145.0
    },
    {
        "author": "Orion8x3",
        "body": "Well good point.. investor.. I bought into Valero BP Wells Fargo AT&amp;T Coke seagate Pfizer.. all of these were just going to slowly increase over time. I guess I’m worried about worst case scenario of stocks crashing and not coming back.",
        "created_utc": 1591890311,
        "id": "ftpez81",
        "permalink": "/r/stocks/comments/h0vn0i/stop_feeling_like_a_loser/ftpez81/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591919111.0
    },
    {
        "author": "nelsuhnn",
        "body": "PS5 will be using SSD’s as primary storage. MU, WDC, STX are my go to’s. Plus with 5g infrastructure happening you can’t go wrong with storage. If SSDs get cheap enough, I’m willing to bet server farms will be adopting the new standard as well.",
        "created_utc": 1592338530,
        "id": "fv1tawi",
        "permalink": "/r/stocks/comments/haa7gq/ps5_gainzz/fv1tawi/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592367330.0
    },
    {
        "author": "mprofe948",
        "body": "My main concern with software stocks is that it is hard to build a moat. DataDog is a fantastic product, but it is also one that many people can copy. It is also not super difficult for their customers to switch if a better competitor comes along. Software companies also have significantly higher valuations because everyone else expects their returns to be higher. That will hinder returns at some point because the growth rates aren't sustainable given the competitive environment.\n\nI'm a big fan of companies that benefit from the proliferation of more software companies popping up. Amazon is an obvious one with AWS, though the valuation there is also pretty high. Storage companies like Seagate or Western Digital have been good investments for me. AMD, Intel, and Nvidia are pretty essential (though 2 of those companies also have high valuations). Microsoft is only part software company these days, but I think that helps it's position more than hurts it.",
        "created_utc": 1591742101,
        "id": "ftixaqp",
        "permalink": "/r/investing_discussion/comments/gzw6oo/building_a_longterm_software_heavy_portfolio/ftixaqp/",
        "score": 1,
        "subreddit": "investing_discussion",
        "created": 1591770901.0
    },
    {
        "author": "learningis1st",
        "body": "FXAIX - 24%\n\nCSIQ - 23%\n\nTSM - 6%\n\nGILD - 6%\n\nINTC - 4%\n\nCTXS - 2%\n\nSTX - 2%\n\nTER - 2%\n\nLOGM - 2%\n\nDBX - 2%\n\nABBV - 1%\n\n...",
        "created_utc": 1591081909,
        "id": "fsm2l4k",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fsm2l4k/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591110709.0
    },
    {
        "author": "ZloiAris",
        "body": "Rate my portfolio: 28  \n\n\n* MSFT - impressive growth with new CEO and who stops them? Leader in the enterprise area as a cloud-service provider, team communications provider, Office 365, data analysis and BI facilities. Missing AI component, but their business is well diversified and very steady. International exposure.\n* AAPL - until revolution in smartphones (like NeuraLink or any other interface which will remove smartphones at all) very decent business. 5G is coming, a diversified business, large pile of the cash in the pocket. Apple Music is eating Spotify pie, new SE &amp; iPhone 12 should be a best-seller during X-Mas time. International exposure.\n* V - leader in the world of payments, slowly entering the crypto area, and its balance-sheet a bit better than Mastercard. In general both are good choices. The only issue is that for Visa default currency is USD, while for MA - EUR, and USD might be weakier soon.\n* INTC - leader in the retail chipset area, right now controls almost the entire CPU area.\n* NVDA - one of the few \"growth\" stocks here. Its P/E is very high, but low leverage, impressive P/S and amazing return on employed capital is making the day. NVDA is one of the biggest beneficiaries of the AI industry coming, as well as auto-pilot vehicles.\n* CTXS - ok, there is another growth company. Citrix provides capabilities to work from home without buying dedicated hardware. It means you don't need to buy everyone a corporate laptop to enable them to safely join from home. It is held by top index funds, and attracts a lot of S&amp;P 500 clients, who have high hopes in them.\n* BABA - yes, not the AMZN. BABA right now is extremely undervalued. They look absolutely amazing in every financial aspect, and thanks to extreme digitalisation of Asia, their revenue is growing super fast.\n* NKE - from one hand this is a consumer cyclical company, but from another - very strong brand. Their online shopping presens is huge, as well as exposure to a world market including China. I might assume they will stay around for a while thanks to the new trend of being healthy.\n* ACN - top IT consulting company, basically working for every Fortune 500 company. Right now I see 3 factors they will keep growing. At first, companies needed expertise to migrate to new cloud infrastructure. At seconds, companies will reduce their hiring budget for a while, but will instead hire external resources more intensively. At third, ACN made few acquisitions in the cyber-security area.\n* (Disclaimer: I had worked for EPAM for 5 years and might be biased)  EPAM - one of the faster growing IT services companies in the world. They have a very strong expertise in almost every area, like integration of complex IT solutions, cloud migrations, online shopping, etc. I see them a long term winner of the current setup. Also they start expansion to the Asia market.\n* CIEN - another long-term winner of working from home setup providing hardware configurations for organizing IT servers, clusters, telecommunications, etc.\n* LDOS - one more IT services company but working in the aerospace &amp; defense area with governments. One of the key vendors in the area of COVID-19 tracking facilities and digitalisation of government infrastructure to control COVID-19. Currently holds a portfolio of almost $30 bln agreements.\n* AVGO - another 5G chipset producer winner. Very solid diversified portfolio, good fundamentals.\n* TSM - semiconductor manufacturer, one the largest in the world. Produces chipsets for NVDA, INTC, AVGO, AMD and others. In my opinion, if I bet on the chipset industry it would be weird to not bet on TSM who is located in COVID-19 free area now and also has clients not only from the USA.\n* LRCX - yet another semiconductor company, but this time a leader in the area of automatisation of production lines. They produce solutions which help to automate facilities - the thing most factories will look into to reduce risk of COVID or any other pandemic.\n* MRK - one of the biggest healthcare companies. While everyone is watching Moderna, MRK also participates in the race for COVID-19 vaccine and has a very decent fundamentals and portfolio of products.\n* REGN - innovative bio healthcare company, their financial and earnings are skyrocketing with a huge potential to grow.\n* ROG - Swiss based healthcare company, very strong portfolio and financials\n* BAYN - I am not a super big fan of Bayer, but they are definitely undervalued now due to all PR recent PR issues. Expect to grow 50% in upcoming years, with strong fundamentals. \n* VIAC - one of the most undervalued TV companies right now. Very strong portfolio and strong fundamentals, clean balance sheet. Frankly I spent hours trying to find a reason for such a low price and didn't manage to find any except for \"index fund problem\".  \n* CI - insurance industry under the huge hit due to increasing expenses (people suffer from COVID) and reduced payments (people loosing job and might start cutting their spendings), but Cigna looks like one of the best to survive the storm and has a bright future for a long term. Faitly under-valued strong balance-sheet company.\n* SU - European large cap producer of energy, data and sustainability facilities. \n* BN - Another European large cap company: food producer. They position themselves as a healthy food producer, and COVID should not distract them as much as Americans food producers are. \n* HD - One of rare bets on American consumer spending. Leader in the area of organizing houses in sub-urban zones. With growth of WFH setup, more people expected to migrate to the country-side, so in the long term HD might benefit. Their balance sheet is also very solid.\n* VMC - Basic materials bet. Among all other basic materials companies, VMC looks the best. Also, despite I have high doubts about 1 tln infrastructure package to pass the Congress, VMC would benefit from this idea.\n* BRK-B - no introduction is needed. Buffet underperformed S&amp;P for a long time, but his portfolio is decent, he sits on a large pile of the cash and proper timing of deploying this cash would result in a great return later on. Still pretty safe to add BRK into my portfolio, their long term run looks pretty good.\n\nAlso I am considering adding 4 strong dividend companies with still promising futures.  \n\n\n* IBM - it might look like a dying mamont, but IBM for years is a leader of patents. They year by year increase their presence in cloud infrastructure, AI, robotics and other topics. With new CEO targets growth, IBM has a pretty decent future for the moment with a diversified portfolio of technologies &amp; patents. High hopes on IBM AI technologies. As well, IBM pays very huge dividends, so why not hold them for some time?\n* T - the same story but in another segment. Might benefit from 5G, has a diversified portfolio, enters the \"stream wars\" area and pays a huge dividend. As a diversification for stocks who pays small dividends but grow in market cap, good choice. \n* STX - Another high dividend representative from the hardware storage business. This area will stay around for a while, and STX is healthier than their competitors, look like a safe bet for a long term holding. \n* ABBV - And the last high-dividend company from the healthcare segment. There is a lot of analysis of ABBV around, so no reason to repeat it all.\n\nAnd 1 ETF:  \n\n\n* EXV6 - since I am EU resident, I need to invest into UCITS, and this is a basic materials ETF mainly RIO, BHP, GLEN, AAL. This segment supports all manufacturing around the world, why should they have gone?\n\nThat's basically it. I am still playing around numbers to calculate the potential risk of this portfolio and define the proper % allocation of stocks, but what's your thoughts on the companies from the list?",
        "created_utc": 1592850809,
        "id": "fvnula3",
        "permalink": "/r/stocks/comments/guji5e/rate_my_portfolio_rstocks_quarterly_thread_june/fvnula3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592879609.0
    },
    {
        "author": "LowBolat",
        "body": "You should go into Fiancial Detail lmao\n\n&amp;#x200B;\n\nEDIT: That article  \"  [https://www.businesswire.com/news/home/20200417005565/en/Eros-International-STX-Entertainment-Combine-Creating-Global](https://www.businesswire.com/news/home/20200417005565/en/Eros-International-STX-Entertainment-Combine-Creating-Global) \" Was published in April 2020 my guy literally 2 months ago",
        "created_utc": 1592966954,
        "id": "fvt9ms1",
        "permalink": "/r/pennystocks/comments/hesnz4/eros_an_undervalued_merger_play/fvt9ms1/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592995754.0
    },
    {
        "author": "prairiechicken80",
        "body": "Looking forward to seeing what happens to EROS when it mergers with STX entertainment on Monday!",
        "created_utc": 1593316879,
        "id": "fw8gn7w",
        "permalink": "/r/RobinHoodPennyStocks/comments/hdqgsb/weekly_rrobinhoodpennystocks_discussion/fw8gn7w/",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1593345679.0
    },
    {
        "author": "ripjohnnyc",
        "body": "https://www.quantum.com/en/resources/customer-success/city-of-calgary-police-service/\nCase study is interesting read. Video data needs to be stored up to 40 years. I’m speculating here but I think the data is going to be held on site for security purposes. This is Quantum’s specialty, but they also acquired cloud services from Seagate this year, so they have the potential to be involved either way.",
        "created_utc": 1592696162,
        "id": "fvhkg6x",
        "permalink": "/r/pennystocks/comments/hcfagb/includes_requirement_for_cameras_anyone_know_who/fvhkg6x/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592724962.0
    },
    {
        "author": "831sweatyfeet",
        "body": "WDC STX",
        "created_utc": 1592304887,
        "id": "fuzzvvv",
        "permalink": "/r/wallstreetbets/comments/ha16p4/daily_discussion_thread_for_june_16_2020/fuzzvvv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592333687.0
    },
    {
        "author": "firefox5150",
        "body": "When the market shifts to value intel will go up faster than amd in that time. Until they start releasing new gear will it kick up even more, with anticipation for August or September news. I like INTC and STX though as they are cheap and dividend paying. They should benefit from good news on the vaccine and reopening front.",
        "created_utc": 1592312251,
        "id": "fv09eja",
        "permalink": "/r/stocks/comments/ha32p6/intc/fv09eja/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592341051.0
    },
    {
        "author": "831sweatyfeet",
        "body": "Thanks. Do you have a better suggestion? I like the idea of WDC and STX too. I'm comfortable holding them, even if they are kind of boring tech picks.",
        "created_utc": 1592058922,
        "id": "fupelyw",
        "permalink": "/r/wallstreetbets/comments/h7s30c/weekend_discussion_thread_for_the_weekend_of_june/fupelyw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592087722.0
    },
    {
        "author": "Devin1405",
        "body": "Bought 10 shares of WDC and STX each. May the best HDD maker win.",
        "created_utc": 1593008610,
        "id": "fvuqxmd",
        "permalink": "/r/wallstreetbets/comments/heyhlj/daily_discussion_thread_for_june_24_2020/fvuqxmd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593037410.0
    },
    {
        "author": "goatface09",
        "body": "**I am a bot and identified and tracked the following options picks within this post:**\n\n|**Ticker**|**Strike**|**Type**|**Exp**|**Recorded Premium**|**Recorded Stock Price**|\n|:-|:-|:-|:-|:-|:-|\n|**STX**|**$54**|**BUY CALL**|**2020-07-10**|**$0.15**|**$47.19**|\n|**STX**|**$48**|**BUY CALL**|**2020-07-02**|**$0.88**|**$47.19**|\n\n[Realtime ROI](https://www.pickmojo.com/pick/ckbv3q8cu4d0707944zo41pc3) | [Track Record](https://www.pickmojo.com/user/hobobobiddy/) | [Bot Info](https://www.reddit.com/r/pickmojo/comments/he9ghu/options_picks_tracking_bot_information/) | Leaderboard: [Week](https://www.pickmojo.com/stocks/best-this-week-reddit), [Month](https://www.pickmojo.com/stocks/best-this-month-reddit), [All](https://www.pickmojo.com/stocks/top-reddit)\n\n**^(*My owner is monitoring these posts, reply with feedback!)**",
        "created_utc": 1593108602,
        "id": "fvz7of7",
        "permalink": "/r/wallstreetbets/comments/hfqyf4/stx_alert_hop_on_in_boys/fvz7of7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593137402.0
    }
]