[
    {
        "author": "flyingfunk",
        "body": "FLT - Drone Delivery Canada",
        "created_utc": 1578337933,
        "id": "fdefk48",
        "permalink": "/r/CanadianInvestor/comments/ekt6gn/looking_around_for_good_cdn_stocks_to_buy_and/fdefk48/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1578366733.0
    },
    {
        "author": "Sanchuniathon",
        "body": "Sorted by weight ZAG, XBC, BIP, ARX, HUTL , ATD, BAM, BEP, WCN, AQN, SIA, AW, ZDI, AD, FLT, NFI, ETMC, BNS, XAW\n\nBeen a great 3/4 year, up 16%. That said it is my first year investing self directed and I am sure I am due for some ups and downs.\n\nHuge weight in ARX, XBC is more because of their individual success than actually overweighting in them.",
        "created_utc": 1578666899,
        "id": "fdqhn55",
        "permalink": "/r/CanadianInvestor/comments/emr9eo/ill_take_a_free_look_at_your_portfolio/fdqhn55/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1578695699.0
    },
    {
        "author": "TrumpChange2me",
        "body": "cbsnews: US officials are confident Ukrainian Flt 752 was shot down by Iran. US intelligence picked up signals of the radar being turned on &amp; satellite detected infrared blips of 2 missile launches, probably SA-15s, followed shortly by another infrared blip of an explosion.\"",
        "created_utc": 1578588452,
        "id": "fdnlrl2",
        "permalink": "/r/wallstreetbets/comments/em86ab/daily_discussion_thread_january_09_2020/fdnlrl2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578617252.0
    },
    {
        "author": "jmho19",
        "body": "lol you’re good what gave it away? air canada? i honestly don’t think they’ll fail tho, every drone startup is for surveillance and flt isn’t taking that route, they are focused on depot to depot and depot to consumer logistics and parcel delivery.. if they can get contracts with companies like UPS, Canada Post, Onstar and all the emergency first responder services in canada then the sky is the limit.. imagine getting your car stuck in the snow and onstar delivers you a hand shovel and a bag of cat litter or food and a heated blanket.. epi pens or a defibrillator dropped off to your kids soccer game or a dose of narcan for a drug overdose faster than it would take for an ambulance to arrive.. they just need to be the first to make it happen and take control of the market that’s all lol no big deal.. a buyout would be nice but i’d rather see their service in action before the buyout that way we don’t have to accept a low ball offer",
        "created_utc": 1580068811,
        "id": "ffnp3ee",
        "permalink": "/r/pennystocks/comments/etlsx1/pump_and_dump_alert_pnnx_imho/ffnp3ee/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1580097611.0
    },
    {
        "author": "meanordljato",
        "body": "I'll like some input\n\nUPWK 10%\n\nTEVA 10%\n\nETSY 7%\n\nAMRN 10%\n\nENPH 10%\n\nADPT 2%\n\nBYND 3%\n\nCHRS 1.5%\n\nWATT 2%\n\nFLT 4.5%\n\nFCEL 1%\n\nLK 3%\n\nNBRV 3%\n\nNM 1.5%\n\nSSTI 3%\n\nSDC 3%\n\nUEC 3%\n\nBSK 4.5%\n\nBEE.V 6%\n\nBITCOIN 10%\n\nCURECOIN 1.5%\n\nPAT.V 4.5%\n\nAnd some 4-5 other smaller positions",
        "created_utc": 1579756182,
        "id": "ffb9ief",
        "permalink": "/r/stocks/comments/e4gns7/rate_my_portfolio_rstocks_quarterly_thread/ffb9ief/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579784982.0
    },
    {
        "author": "bill-lowney",
        "body": "Easy to say now when you’ve got 2020 vision.",
        "created_utc": 1578202398,
        "id": "fd7cll8",
        "permalink": "/r/investing/comments/ek84pk/i_got_bored_and_went_through_amazons_financial/fd7cll8/",
        "score": 842,
        "subreddit": "investing",
        "created": 1578231198.0
    },
    {
        "author": "AnyGuyFromAnywhere",
        "body": "Lmao. I got the fuck outta that shithole long time ago. I visit every now and then to use my citizenship granting abilities to get PU$$Y.",
        "created_utc": 1578082326,
        "id": "fcylpky",
        "permalink": "/r/wallstreetbets/comments/ejkryd/imagine_if_the_iranians_saw_this_subreddit/fcylpky/",
        "score": 760,
        "subreddit": "wallstreetbets",
        "created": 1578111126.0
    },
    {
        "author": "capnwally14",
        "body": "In super simple terms:   \nA short sell means borrowing a stock in order to sell it - promising the original owner you'll pay them back the original stock at a future date. Imagine Joey thinks Company A's stock is too high at $100. If he wants to short sell the Company A's stock, he could go to a broker and borrow someone else's share (in this case he could borrow Jimmy's stock) and sell it at $100 - promising to give Jimmy back his share in the future. If Joey is right, and the stock drops to $80, then he can buy back Company A's share at $80 (and give it to Jimmy) and keep $20 for himself. If on the other hand Company A's share goes up to $120, Joey is out of luck and will have to pay $120 to give back the share to Jimmy - thereby losing $20. You can see why short selling is dangerous - in this situation, Jimmy at most could have gained $100 (if Company A's price had collapsed to zero), but at most could have lost an infinite amount of money.   \n\n\nSo what do you do if you want to bet against a company, but don't want to short sell? You might instead consider a put option. A put option is buying the right to sell a company's stock (for a premium) at a specific price (known as the strike) on a specific date\\*. So instead of short selling, maybe Joey will buy a put option that says for $1 he can buy the right to sell Company's stock for $100 in one year. If in a year the price of the stock is above $100, then the option will expire worthless - as anyone would rather sell at a higher price than at $100. If the price is below $100 in a year, then Joey will be able to exercise his option and take his earnings. Unlike selling short, now Joey is at most only losing the premium of the option, and at best earning $100.   \n\n\nA call option is the opposite of a put option. A call option is buying the right to buy a stock at a given price on a future date. For $1 Joey might be able to buy the right to buy a shares of Company A for $100 in 1 year. If the shares are above $100 in a year, he'll make money, if they're below his options will expire worthless.   \n\n\nOptions are slightly tricky in that their value is not just comprised of the difference between share price and the exercise price, but also volatility and time value. You can read more about Black Scholes which is how options are priced elsewhere. You can also read about strategies about combining patterns of options to construct more sophisticated trades (like iron condors).\n\n  \n\\* Note - European and American options are different here.",
        "created_utc": 1578115527,
        "id": "fd0990s",
        "permalink": "/r/investing/comments/ejrczd/is_there_any_good_eli5_resources_on_puts_shorts/fd0990s/",
        "score": 354,
        "subreddit": "investing",
        "created": 1578144327.0
    },
    {
        "author": "vishtratwork",
        "body": "Best time is years ago. Second best is now. Third best is the future. \n\nYou do not, nor does anyone else, know when the next recession will come. May be 10 years off. The recession talk has existed since the last recession, it is nothing new, and they don't know better than you.",
        "created_utc": 1578316670,
        "id": "fddlcty",
        "permalink": "/r/StockMarket/comments/ektuix/is_now_a_good_time_to_invest_in_vanguard_index/fddlcty/",
        "score": 352,
        "subreddit": "StockMarket",
        "created": 1578345470.0
    },
    {
        "author": "WallStreetBitch",
        "body": "Had he taken out $100k loan for this move, he’d be retired by now. What an idiot.",
        "created_utc": 1578764127,
        "id": "fdx0m5f",
        "permalink": "/r/wallstreetbets/comments/en90jv/from_a_single_aapl_call_on_dec_20th_13000_gains/fdx0m5f/",
        "score": 317,
        "subreddit": "wallstreetbets",
        "created": 1578792927.0
    },
    {
        "author": "Oscur925",
        "body": "Some intern at Homeland Security is getting a notification to look into this post right now.",
        "created_utc": 1578156860,
        "id": "fd3cbs6",
        "permalink": "/r/wallstreetbets/comments/ejywdn/currently_boarding_a_boeing/fd3cbs6/",
        "score": 263,
        "subreddit": "wallstreetbets",
        "created": 1578185660.0
    },
    {
        "author": "ReallyHurtz2pee",
        "body": "Actually, Iran hoisting the red flag means they’re bearish right now. Clearly we know that means we need to inverse them. So in conclusion, your SPY puts are toasted bro.",
        "created_utc": 1578232727,
        "id": "fd9fraa",
        "permalink": "/r/wallstreetbets/comments/ekcofs/iran_hoists_red_flag_symbolizing_they_are_ready/fd9fraa/",
        "score": 220,
        "subreddit": "wallstreetbets",
        "created": 1578261527.0
    },
    {
        "author": "RLaG69",
        "body": "I would clap if I wasn’t so hard right now",
        "created_utc": 1578273354,
        "id": "fdcf46g",
        "permalink": "/r/wallstreetbets/comments/ekmd7o/how_to_predict_the_next_market_pullback_its_not/fdcf46g/",
        "score": 209,
        "subreddit": "wallstreetbets",
        "created": 1578302154.0
    },
    {
        "author": "TheWizardOfFrobozz",
        "body": "In the example you gave, there are two taxable events, both of which should be reported to the IRS:\n\n1) Receiving the free stock. This counts are ordinary income for the market value of the stock on the day you receive it.\n2) Selling the stock for a profit. This counts as a short-term or long-term capital gain (depending on how long you held it) of the amount its price increased by.\n\nFor example, suppose you received a free share of AAPL on July 30, 2019. AAPL closed at $213.04 that day, so you would report $213.04 as income. Now suppose you sold it on December 31, 2019 for $291.52. Your short-term capital gain is $291.52 - $213.04 = $78.48. Whether either of these events increases the taxes you have to pay depends on your other income, your filing status, other gains/losses, etc.\n\nI'm thinking of writing a tax primer for Robinhood users and posting it here sometime during the next few days since there seem to be so many questions.",
        "created_utc": 1578261783,
        "id": "fdbtgbm",
        "permalink": "/r/RobinHood/comments/ekjmcd/how_does_paying_taxes_work_for_the_free_stocks/fdbtgbm/",
        "score": 187,
        "subreddit": "RobinHood",
        "created": 1578290583.0
    },
    {
        "author": "Cchel4243",
        "body": "Can’t wait for AMD to announce that their new CBD drink is going to be carried on every 737 from now on.",
        "created_utc": 1578347081,
        "id": "fdeuuww",
        "permalink": "/r/wallstreetbets/comments/el0njk/amd_wait_room/fdeuuww/",
        "score": 187,
        "subreddit": "wallstreetbets",
        "created": 1578375881.0
    },
    {
        "author": "BayesianProtoss",
        "body": "now you see why its worth a ferrarri despite the executive average age &gt;90",
        "created_utc": 1578323488,
        "id": "fddtdr5",
        "permalink": "/r/wallstreetbets/comments/eku3kd/buffetts_plan_for_ww3/fddtdr5/",
        "score": 169,
        "subreddit": "wallstreetbets",
        "created": 1578352288.0
    },
    {
        "author": "Mods_sofa_king_gay",
        "body": "Trump's tweet makes sense now..\n\nhttps://twitter.com/realDonaldTrump/status/1187861209942495234?s=19",
        "created_utc": 1578154538,
        "id": "fd33zq5",
        "permalink": "/r/wallstreetbets/comments/ejxclf/apple_started_wwiii_so_that_phones_would_be/fd33zq5/",
        "score": 142,
        "subreddit": "wallstreetbets",
        "created": 1578183338.0
    },
    {
        "author": "kahoks1235",
        "body": "My investment plan for the next major market decline is to invest more than I am now",
        "created_utc": 1578365820,
        "id": "fdfnk0i",
        "permalink": "/r/StockMarket/comments/el4z47/what_is_your_investment_plan_for_the_next_major/fdfnk0i/",
        "score": 139,
        "subreddit": "StockMarket",
        "created": 1578394620.0
    },
    {
        "author": "rhinoknock",
        "body": "I was up 23% and then went to pour myself a bowl of cereal.  Now I am down 12%.\n\n&amp;#x200B;\n\nI need milk.",
        "created_utc": 1578408399,
        "id": "fdgu5q9",
        "permalink": "/r/wallstreetbets/comments/elcdqq/amd_rally_thread/fdgu5q9/",
        "score": 125,
        "subreddit": "wallstreetbets",
        "created": 1578437199.0
    },
    {
        "author": "Data_Dealer",
        "body": "Cause fear, people just want to lock in profits now, which means selling off, which means big drops which means people who thought they would weather the storm then get weak hands as they think this could be the next recession or worse a depression so they in turn start to sell even thought they know better and before you know it we have manufactured our own giant economic shit storm out of fear of the next recession/depression.   Well that's how it would go, but we have circuit breakers and other shit in place, so hopefully people will cool their shit after a certain percent drop and people will realize it's really not the end of the world, or the shit storm will continue cause no one has a fucking crystal ball and no one wants to lose money.",
        "created_utc": 1578445095,
        "id": "fdikrgv",
        "permalink": "/r/stocks/comments/elk04c/10_rockets_hit_airbase_in_iraq_where_us_troops/fdikrgv/",
        "score": 120,
        "subreddit": "stocks",
        "created": 1578473895.0
    },
    {
        "author": "dunkaroojk",
        "body": "13 more houses in Detroit now. Nice",
        "created_utc": 1578959521,
        "id": "febjnpp",
        "permalink": "/r/wallstreetbets/comments/eoc6vx/131k_in_1_day_tsla/febjnpp/",
        "score": 115,
        "subreddit": "wallstreetbets",
        "created": 1578988321.0
    },
    {
        "author": "TheChadUsername",
        "body": "I remember my first phone interview with Schwab to get margin approved. \n\nMe: “I’m looking for level 2 options approval, I’m trying to focus primarily on credit spreads for the coming months.”\n\nSchwab guy: “I see. Could you tell me a little more about your trading experience and what strategies you’ve focused on in the past”\n\nMe: “...Well I focus mostly on blue chips. Medium to long term expiry usually at the money. My strategy lies in trying to determine when IV is the lowest so I can get in before I feel a run up blah blah blah technical shit flexing that I know more than a 4th grader about options”\n\nSchwab: “uh huh......well as of now in your cash account I see a long history of very short dated call and puts options on SPY”\n\nMe:  “Oh...yeah I did that too”",
        "created_utc": 1578089325,
        "id": "fcyxmfx",
        "permalink": "/r/wallstreetbets/comments/ejmigh/just_had_a_wonderful_phone_call_from_my_first/fcyxmfx/",
        "score": 106,
        "subreddit": "wallstreetbets",
        "created": 1578118125.0
    },
    {
        "author": "stormwillpass",
        "body": "&gt; \"I need you to tank TSLA, right now!\"\n\n&gt; \"Shit, I need TSLA to plummet!\"\n\nNice work!\n\nLong story short, I'd rather them not tank anymore and need them to moon now since I sold a lot of naked puts. Past two weeks I closed some naked calls that would've ended up profitable. Last week I opened up some puts and the $520 strike ended up losing 3x initial credit.\n\nGetting fucked both ways it seems.",
        "created_utc": 1579478337,
        "id": "ff1eyuq",
        "permalink": "/r/wallstreetbets/comments/er25f9/death_of_ustormwillpass_circa_2020_reupload/ff1eyuq/",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1579507137.0
    },
    {
        "author": "veritasinvestments",
        "body": "Iran and the US probably made a deal where Iran had to give up its power in the region in exchange for easing the sanctions. The price? Iran has to give up its Quds leader. In one move, Khamenei has also consolidated his own power by taking out someone who, in the past, has threatened military coups in the event of left-wing movements and relations with the US. By doing this, he has severely reduced Sepah’s power while simultaneously allowing for sanctions to be gradually eased. Most people don’t understand this, but IRGC is getting so powerful that it is actually threatening the very existence of the Iranian government as it is. Soleimani was essentially its key leader, and by giving him up, Khamenei has consolidated his power. This is what most likely has occurred. Otherwise, why did it take so long for the US to kill this guy? He’s been active in Iraq and Syria for the past decade.\n\nAlso, some IRGC hardliners wanted Soleimani to run for president. There’s an internal war between the clerics and the IRGC for power in Iran. While someone like Rouhani or Ahmadinejad could just be puppets for Khamenei, Soleimani would actually not be a puppet president. Given that Rouhani is also in his last term, if Soleimani ran, he could present as a viable candidate. The only way that Khamenei could consolidate power for the clerics was to take him out. Again, if you were in Iran right now or know about how the Iranian government works, this scenario would probably be what you would be thinking right now as well.",
        "created_utc": 1578026775,
        "id": "fcwitom",
        "permalink": "/r/wallstreetbets/comments/ej9lvk/world_war_3_has_started/fcwitom/",
        "score": 99,
        "subreddit": "wallstreetbets",
        "created": 1578055575.0
    },
    {
        "author": "olmn20",
        "body": "If everyone looked at a log scale of the S&amp;P 500‘s performance instead of the regular chart, we would have half as many people worried that the market is overvalued right now.",
        "created_utc": 1578335053,
        "id": "fdeay9c",
        "permalink": "/r/investing/comments/ekxkjo/sp_overvalued_not_so_fast_a_quick_look_at_long/fdeay9c/",
        "score": 94,
        "subreddit": "investing",
        "created": 1578363853.0
    },
    {
        "author": "CRE_Finance_CPA",
        "body": "Probably getting divorced because he hasn't been taking her to Red Lobster. She was eating Red Lobster 4 times a week last year. And now no more Red Lobster.",
        "created_utc": 1578417560,
        "id": "fdh8byv",
        "permalink": "/r/wallstreetbets/comments/eld4i6/all_in_the_war_machine/fdh8byv/",
        "score": 92,
        "subreddit": "wallstreetbets",
        "created": 1578446360.0
    },
    {
        "author": "PeterMichaelPaints",
        "body": "Now this is how you do it people - spend someone else's money. I respect this man.",
        "created_utc": 1578443086,
        "id": "fdihl1q",
        "permalink": "/r/wallstreetbets/comments/elk1ih/its_official_were_going_to_war/fdihl1q/",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1578471886.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "WSB: this is definitely the top. *buy puts*\n\ntwo weeks later...\n\nWSB: no seriously, this is definitely the top now. *buy puts*",
        "created_utc": 1578006569,
        "id": "fcvojf2",
        "permalink": "/r/wallstreetbets/comments/ej5vt8/am_i_the_only_one_concerned_with_these_levels/fcvojf2/",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1578035369.0
    },
    {
        "author": "kwondj",
        "body": "In 2007 i said buy amd, all the fucking pc gamer nerds laffed me out the room\n\nGuess whos laffing now i own zero amd shares and boy wish I listened to myself.\n\nEven a broken person is right twice",
        "created_utc": 1578341896,
        "id": "fdem2iu",
        "permalink": "/r/wallstreetbets/comments/ekydid/listen_here_you_cowards/fdem2iu/",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1578370696.0
    },
    {
        "author": "Shandlar",
        "body": "It's really getting hilarious now.  Stocks only go up.\n\nLiteral WWIII fears, oil price spikes.  All weekend to stew.  Trump threatening to go Machiavellian and risk the EU actually sanctioning the US and causing a proper global recession.\n\nSPX?  Fuck it, I'll just recover the entire -0.60% down for no reason at all and just keep going up all afternoon.",
        "created_utc": 1578338078,
        "id": "fdefsf4",
        "permalink": "/r/wallstreetbets/comments/ekxqk1/bear_gang/fdefsf4/",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1578366878.0
    },
    {
        "author": "bfreis",
        "body": "I can try.\n\nHere's what happens without PFOF:\n\n    You -&gt; Broker -&gt; Exchange (where Market Makers post their bids and asks)\n\nWith PFOF:\n\n    You -&gt; Broker -&gt; PFOF firm -&gt; Exchange and maybe other sources of liquidity.\n\nThe market makers posting bids and asks on the Exchange have no idea who will trade against them:\n\n* Could be the uninformed retail trader who, clueless, thinks it's smarter to send an order directly to the exchange (after all, they believe this myth that *\"PFOF is evil, let's bypass them!\"*).\n* Could also be an extremely well funded and smart team of quant traders in a large hedge fund.\n\nThe MM doesn't consider the uninformed retail trader a big risk, as he's likely as good as a coin flip; MMs love coin flips as they can expect to get as many on the bids as on the asks they are posting, thus capturing the spread with very low risk. The orders from e.g. the hedge fund quant traders are much higher risk for the MM because they're informed: if those quants start buying heavy, they probably know something. The MMs now have much higher risk on their inventory. Because the MMs have this possibility of much higher risk, they have to be compensated for it: **market makers widen their bid-ask spreads where they may be trading against informed adversaries**.\n\nNow, a firm that has a PFOF agreement with a broker such as Robinhood knows exactly what kind of orders to expect: uninformed orders that are as good as a coin flip, from a clueless trader sitting on his couch. This carries much less risk. For this reason, MMs don't need such a wide bid-ask spread as they would need to post on the public exchanges. With the lower risk, they can afford to (1) pay Robinhood for their customers' orders, and (2) trade with narrower bid-ask spreads ultimately giving retail traders better prices than NBBO.\n\nYou can read more on this topic if you search for *adverse selection*.",
        "created_utc": 1577992138,
        "id": "fcv0gsn",
        "permalink": "/r/options/comments/ej20zi/finra_fines_robinhood_financial_llc_125_million/fcv0gsn/",
        "score": 78,
        "subreddit": "options",
        "created": 1578020938.0
    },
    {
        "author": "elosorojo4",
        "body": "Kicking myself. I had sold at $340. Average buy in in of $280. Happy to have made a profit but obviously wishing I had held on. Would like to get back in at some point. It’s been such a wild ride up and down my instinct is to wait for a big drop to get back in but am now thinking it probably won’t reach those levels again anytime soon.",
        "created_utc": 1578063719,
        "id": "fcxifd7",
        "permalink": "/r/stocks/comments/ejfdl3/tesla_tops_wall_street_estimated_with_112000/fcxifd7/",
        "score": 75,
        "subreddit": "stocks",
        "created": 1578092519.0
    },
    {
        "author": "satago",
        "body": "You get one of the big boys to underwrite your IPO. They push their hot startup to a fund manager who handles everyone in americas 401k. The underwriter gets a huge cut based on the IPO price and the owners of casper get instant wealth because their shares are immediately valued in nose bleed territory, the price set by the underwriter.  Underwriter and owners cash out and Everyone's 401k absorbs this new public company that ain't worth shit!  But overall this company is a pretty small percentage of everyone's 401k and you'll never know how much you lost 30 years from now when you take your minimum distribution at 70.5 years old.  \n\nYou'll probably never touch your 401k money and everyones 401k will own \"trillions\" in these companies that are effectively worthless. \n\nEventually the entire market will collapse. The only people left with money will be the underwriters, berkshire hathaway, and a couple others that actually hold companies that make money. \n\nThat is how Casper could be \"worth\" $1B.",
        "created_utc": 1578888509,
        "id": "fe6ehhe",
        "permalink": "/r/wallstreetbets/comments/enylse/guy_on_linkedin_posted_this_have_fun/fe6ehhe/",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1578917309.0
    },
    {
        "author": "stormwillpass",
        "body": "LOL\n\nedit:\n\nokay so I started watching the vid, saw my name, paused it, reserved a comment spot, gave you a gold prematurely, resumed watching, and now here I am.\n\nWow that was fucking hilarious. When you said you were gonna meme the whole thing, I did not expect it to be this good. Great scene choice. Thanks for making my weekend a whole lot better &lt;3\n\nedit2:\n\nNew phrase for 2020: tag u/haupt91 and say \"HAUPT the memeloaf!\" whenever you see something meme-able.\n\nedit3: Awards don't show up in gilded, so I will give you a gold so that it does. Also, each time you give a post an award, the link disappears and you have to refresh to give another one.",
        "created_utc": 1578765034,
        "id": "fdx3vse",
        "permalink": "/r/wallstreetbets/comments/enaj5o/theta_crashers/fdx3vse/",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1578793834.0
    },
    {
        "author": "brutalpancake",
        "body": "Ok NOW it’s priced in",
        "created_utc": 1578015933,
        "id": "fcw2yi4",
        "permalink": "/r/wallstreetbets/comments/ej7ytx/long_oil_were_going_to_war_boys_us_airstrike_in/fcw2yi4/",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1578044733.0
    },
    {
        "author": "tht_pod",
        "body": "Hard to say. This stock is unpredictable. In my opinion it’s a good buy but right now it’s in blue sky break out mode. You’ll probably find a better buying opportunity if you wait but if you think it’s going to keep riding then who am I to tell you no. Just remember this stock was at 170 like 6 months ago. I sold my position when it hit 410 and sure I’m a little pissed it’s gone higher but nothing wrong with taking profit. Wait for a pull back.",
        "created_utc": 1578410358,
        "id": "fdgwxqr",
        "permalink": "/r/StockMarket/comments/elb0ru/is_tsla_a_good_buy/fdgwxqr/",
        "score": 66,
        "subreddit": "StockMarket",
        "created": 1578439158.0
    },
    {
        "author": "InferiousX",
        "body": "Iran could fire a nuke at the US right now and my AAPL puts would still expire worthless.",
        "created_utc": 1578051125,
        "id": "fcx4pv8",
        "permalink": "/r/wallstreetbets/comments/ejdzm4/daily_discussion_thread_january_03_2020/fcx4pv8/",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1578079925.0
    },
    {
        "author": "Bleak_Midwinters",
        "body": "I think there is a better answer than \"luck\" that you will commonly hear. Typically you want to learn the stages of the business/economic cycle for what you are talking about. During a recession certain sectors or industries perform better, these are typically tied to what is viewed as a necessity to the consumer. An example would be utilities. \n\nNow, if you are asking who will survive recessions, a good indicator is the leverage ratio. How much is funded with debt compared to equity? This helps assess financial health of a company. You can look at days cash as well. This answers how many days of operations can the company fund purely off the cash on it's balance sheet. Total assets turnover or TAT can show how well the companies assets are used to produce sales. There are several others, but I think this is sufficient to send you on your path. \n\nDuring a recession you may find it easier to just pick ETFs that track underlying growth indexes and buy them at a cheap entry. Check out the performance of the Nasdaq 100 from 2009 to now. Looks tasty right? Not to say those market conditions will be replicated, but a similar strategy may be easier with lower risk than picking individual stocks. Good luck!",
        "created_utc": 1578243413,
        "id": "fda9tp7",
        "permalink": "/r/investing/comments/ekf5a5/during_the_2008_recession_some_people_managed_to/fda9tp7/",
        "score": 65,
        "subreddit": "investing",
        "created": 1578272213.0
    },
    {
        "author": "SaltRecording9",
        "body": "This is it. I've finally found the most retarded comment on this sub. I don't know what to do now. I guess I can finally rest.",
        "created_utc": 1578071047,
        "id": "fcxvf3j",
        "permalink": "/r/wallstreetbets/comments/ejcz87/dd_on_the_waring_twenties/fcxvf3j/",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1578099847.0
    },
    {
        "author": "ConfidentMushroom",
        "body": "OP is busy photoshopping those right now, leave him alone!",
        "created_utc": 1578769136,
        "id": "fdxitn4",
        "permalink": "/r/wallstreetbets/comments/en90jv/from_a_single_aapl_call_on_dec_20th_13000_gains/fdxitn4/",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1578797936.0
    },
    {
        "author": "SirGlass",
        "body": "I have used schwab for years as my main bank , and brokerage.  I initially choose it to be a bank and save on ATM fees and Travel fees (I like to travel outside the USA) then rolled over my IRA from a shitty Amerprise account (oritionally opened by my parents) and an old 401k\n\nNow I have almost consolidated everything with schwab.",
        "created_utc": 1578143515,
        "id": "fd28vo0",
        "permalink": "/r/investing/comments/ejtvsq/now_that_vanguard_charges_no_fees_though_it_was/fd28vo0/",
        "score": 60,
        "subreddit": "investing",
        "created": 1578172315.0
    },
    {
        "author": "brutalpancake",
        "body": "Gotta throw the bears a bone every now and then. Ya’ll literally starving to death the last few months. Poor lil fuzzy homeless bastards",
        "created_utc": 1578057937,
        "id": "fcxb3e5",
        "permalink": "/r/wallstreetbets/comments/ejf55k/in_response_to_the_open_letter_to_the_bear_gang/fcxb3e5/",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1578086737.0
    },
    {
        "author": "uwjames",
        "body": "I sold a ton just before the closing bell. I'm 50% cash now. Feels great to realize gains. Closed out/reduced some positions that I had done well with, but now I want to simplify. Going to throw this cash and future deposits into VTIVX (Vanguard 2045 target). Now the question is just when to do that. \"Time in market\" wisdom says ASAP. But damn this thing is on a hell of a climb lately. Seems reversion to mean could be just around the corner (or one tweet away).  Big temptation to hold cash for a bit and see if I can catch another dip like I did in December 2018.",
        "created_utc": 1578001471,
        "id": "fcvg9xq",
        "permalink": "/r/investing/comments/ej4d5e/dow_jumps_250_points_hits_record_as_wall_streets/fcvg9xq/",
        "score": 59,
        "subreddit": "investing",
        "created": 1578030271.0
    },
    {
        "author": "zsd99",
        "body": "In your own link you posted:\n\n&gt; It is a significant moment actually. The flag is only raised for Imam Hussian, the most pivotal figure of Shia Islam. The flag is now being raised for Soliemani, if that does not spell significance then nothing ever does. It doesn't matter the that it's done yearly, it matter that it is not being raised for the most holy figure of Shia Islam, but for a Man in 2020.",
        "created_utc": 1578220642,
        "id": "fd8nsyy",
        "permalink": "/r/wallstreetbets/comments/ekaabb/for_the_first_time_in_the_history_of_iran_a_red/fd8nsyy/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1578249442.0
    },
    {
        "author": "CarlCarbonite",
        "body": "You can order drone strikes on your iPad now.",
        "created_utc": 1578018291,
        "id": "fcw6j5r",
        "permalink": "/r/wallstreetbets/comments/ej81qg/looks_like_orange_might_have_just_killed_big/fcw6j5r/",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1578047091.0
    },
    {
        "author": "RaoulDuke209",
        "body": "Teslas are visibly filling the streets in my city. 4 years ago there was maybe 2 or 3 id see and then some families had multiples and now theyre all over.",
        "created_utc": 1578429696,
        "id": "fdht5z1",
        "permalink": "/r/wallstreetbets/comments/elg1pw/when_you_exercise_600_tsla_leap_options_purchased/fdht5z1/",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1578458496.0
    },
    {
        "author": "meetballin25",
        "body": "same. i am debating to cut out robinhood now. fuck this",
        "created_utc": 1578321740,
        "id": "fddr2nr",
        "permalink": "/r/RobinHood/comments/ekuzfj/errors/fddr2nr/",
        "score": 53,
        "subreddit": "RobinHood",
        "created": 1578350540.0
    },
    {
        "author": "Skeptophile",
        "body": "Still got [the dough](https://www.google.com/search?q=star+wars+box+office&amp;oq=star+wars) and now baby Yoda's merch dough.",
        "created_utc": 1578349643,
        "id": "fdez1sf",
        "permalink": "/r/stocks/comments/ekyslw/disneys_streaming_business_is_already_worth_more/fdez1sf/",
        "score": 52,
        "subreddit": "stocks",
        "created": 1578378443.0
    },
    {
        "author": "TNGBO",
        "body": "You definitely don’t have kids, I don’t and never even bothered with it. But my sister and brother can’t live without it now, 2 kids each",
        "created_utc": 1578259987,
        "id": "fdbpse5",
        "permalink": "/r/wallstreetbets/comments/ekj4sd/cancelled_my_disney_plus_subscription_how_many/fdbpse5/",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1578288787.0
    },
    {
        "author": "thewhiterider256",
        "body": "This has been planned for weeks now.  The date has already been set for the 15th.",
        "created_utc": 1578251444,
        "id": "fdax79w",
        "permalink": "/r/wallstreetbets/comments/ekgjlz/green_monday_confirmed/fdax79w/",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1578280244.0
    },
    {
        "author": "Hadron90",
        "body": "Yep, its experiencing outages right now. My GD position is up 260% and I can't fucking sell.",
        "created_utc": 1578321516,
        "id": "fddqsje",
        "permalink": "/r/wallstreetbets/comments/ekuxrr/robinhood_execution_lag/fddqsje/",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1578350316.0
    },
    {
        "author": "MasterCookSwag",
        "body": "I feel like I need to qualify that I'm pro EV so nobody loses their shit but the base of your post doesn't make sense.  The US is a net exporter of crude and refined petroleum.  The economics you speak of haven't been a thing for some time now.",
        "created_utc": 1578071560,
        "id": "fcxwo1q",
        "permalink": "/r/investing/comments/ejgowz/tesla_tops_wall_street_estimates_with_a_record/fcxwo1q/",
        "score": 50,
        "subreddit": "investing",
        "created": 1578100360.0
    },
    {
        "author": "bfreis",
        "body": "tl;dr - more info such as the trade price and contract expiration could be very helpful, the info you gave means that you're at a loss of -0.126% rather than the profit you calculated, and the strategy seems way too risky, especially for the \"goals\" you mentioned.\n\nA few comments.\n\nI'm assuming that (1) you opened the account with initially 5k usd deposit, and (2) you opened those 2 trades you listed, they are still open, and you did absolutely nothing else. Are these assumptions right? Assuming they are correct... \n\n- First thing, it might be more helpful if you include a more precise specification of the contracts you're trading, especially when you report about past trades.\n\nEg, today there's no F options with 16 DTE. Someone looking at this in 1 month might be confused. In this case, it seems that you're talking about Jan 17th expiration. Same for GPRO. \n\nAlso, it's useful to mention the trade price. In this case I can't really know how much you bought the options for.\n\n- Second thing, you seem to be calculating the return wrong. \n\nIt seems like you calculated return as how much the cash balance changed on that week. This is not how it's done.\n\nYou have to compare account values, which is not the same as cash balance. The reason for this is that while you do have the assets in form of cash, you also have liabilities (the short options). \n\nYour \"week one starting account value\" is 5k.\n\nYour \"week one ending account value\" is equal to your ending cash balance *minus how much those options are worth now*.\n\nYour F option closed Friday at 0.09 so the position is worth -9 USD. Your GPRO option closed at 0.07 so the position is worth -7 USD. Your cash balance is 5000 + 5.85 + 3.85 = 5009.70 USD. Adding it all together, you find the ending value.\n\nThe ending value is 4993.70 USD. This is a P/L (or loss) of 6.30 USD. \n\n**Week one return is then a loss of -0.126%.**\n\n- Third, in regards to the strategy itself.\n\nThe amount you're collecting in premium seems incredibly low. This is because (1) the underlyings are super low priced, and (2) your options are very close to expiration. \n\nThis leads to a situation where you're collecting almost no premium, a significant percentage of which is being spent on fees, and you have pretty significant risk due to a lot of Gamma. \n\nOne way to improve that is to sell options with more DTE, for example. You'll collect more premium, the percentage of premium you spend is fees is significantly reduced, and so is your gamma risk.",
        "created_utc": 1578287512,
        "id": "fdcxu6p",
        "permalink": "/r/options/comments/eko52g/my_options_trading_journey_week_one/fdcxu6p/",
        "score": 49,
        "subreddit": "options",
        "created": 1578316312.0
    },
    {
        "author": "CaezarVII",
        "body": "Strictly as a broker:\n\n1. Fidelity is the best all round broker by a small margin because you get cash on your sweep account without having to manually move into money market. Vanguard also pays cash (more than Fidelity) on their sweep accounts but Vanguard is lacking in the technology department as far as their app and web platform so I prefer Fidelity.\n2. Most of the other brokers don't really have enough differentiating factors in my opinion to say one is \"better\" than another. Vanguard is great, but their technology is lacking. Between the others, they all have easy to use apps and websites. Etrade, Schwab, and Ally tend to have the better website platforms and highly rated Android and iPhone apps. IBKR and possibly TD Ameritrade are good for advanced traders. If you don't go with fidelity, I would literally just choose based on which app or web platform you like the most.\n\nBroker plus other banking services:\n\n* The Fidelity rewards 2% cashback credit card is good enough to serve as a primary credit card. For this reason, combining your broker and credit card platform both at Fidelity for simplicity is a good option. Fidelity also offers a checking account with fee free/reimbursed ATM usage but their checking account platform is not as good as Schwab or BoA.\n* Schwab is a great all round broker. Although they do not pay cash on sweep accounts, their easy to use and fee free/reimbursed checking accounts make up for it. I personally use Schwab for brokerage and checking (and an Amex credit card).\n* Ally Invest should be way more popular than it is. Their saving account rates speak for themselves so combining Ally savings/checking/brokerage accounts is a win win win situation. Their web platform for brokerage is also excellent and might be my favorite overall. They also have a large ATM network and will reimburse up to $10 in ATM fees per month.\n* Etrade offers a checking account with unlimited free ATM usage and fee reimbursement and a competitive rate Savings account. Etrade's offerings are very similar to Ally Invest in my opinion. I don't know how one would choose between the two except that I like Ally's website and app more. With things changing so quickly at brokers right now, I'm not sure that Ally Invest, or especially Etrade, are sustainable. I could see Etrade being acquired very soon. This is another reason why I stick with Schwab.\n* Merrill Edge combined with their Preferred Rewards program is excellent and if you have enough assets with them you get up to 5.25% cash back on a no annual fee credit card for a category of your choice, 3.5% cash back on groceries, and 1.75% cashback on everything else. You really can't beat this. If you have enough assets with BoA/Merrile Edge, you also get unlimited ATM fee free/reimbursed.\n* Chase YouInvest is a decent platform but it feels really new and not fully fleshed out. They only added options trading a few months ago I believe and they definitely have the most basic platform being only a couple notches above Robinhood as far as features which can be a good and bad thing since it is pretty simple to use. Now that they have options trading, I would recommend Chase YouInvest, especially if you are going to combine your assets at Chase. Like BoA Merrill Edge, you have to have a certain amount of assets with Chase to get fee free ATM usage with reimbursement.\n* TD Ameritrade is a great brokers with nothing much to offer by way of banking features or their own investment products. Because of this I am not surprised that TD was acquired. They have an advanced trading platform but I'm not sure that it's worth it since they have below average app reviews on Android. I basically use my phone for everything and so the app is really important to me. For these reasons TD Ameritrade didn't really stand out to me.\n\n\\*\\*One other caveat....if you trade inverse and leveraged ETFs such as UVXY or TQQQ, respectively, certain brokers do not allow trading of these securities. Vanguard and Chase do not allow trading of either. Merrill Edge does not allow trading of inverse ETFs. If not for this I would probably be with Merrill Edge in order to get the 5.25% cashback credit card or Chase to utilize their credit cards and checking account. I know Fidelity and Schwab allow trading of either leveraged or inverse ETFs, but I am not sure about the other brokers.\n\n\\*\\*\\*I have personally used Vanguard, Fidelity, Schwab, and Chase YouInvest extensively. I have experimented with Merrill Edge, Ally Invest, and Etrade.",
        "created_utc": 1578168250,
        "id": "fd4k6ob",
        "permalink": "/r/investing/comments/ejzcgv/what_is_the_best_brokerage_to_use/fd4k6ob/",
        "score": 49,
        "subreddit": "investing",
        "created": 1578197050.0
    },
    {
        "author": "TravelingArthur",
        "body": "I get it. It’s cool. Your money. Do you.\n\nIf however instead of liquidating everything right now at once, can I offer some advice and put a rolling stop loss on your stocks? Or manually close the  a particular stock drops 3-5%? \n\nThat way you don’t miss out on any gains and you don’t get screwed on your losses",
        "created_utc": 1578365650,
        "id": "fdfnarl",
        "permalink": "/r/stocks/comments/el3fwa/im_liquidating_all_my_stocks_35_gain_over_the/fdfnarl/",
        "score": 49,
        "subreddit": "stocks",
        "created": 1578394450.0
    },
    {
        "author": "aurora_jaeger",
        "body": "I believe we are in a highly fraudulent environment, and stock prices have decoupled from reality completely. If anything, I would short the markets now...  \n\n\n\\*Edit: Teenagers on Robinhood buying Options with 25x leverage like it is a video game is a good indicator we are at the very peak\\*",
        "created_utc": 1577999413,
        "id": "fcvctkt",
        "permalink": "/r/stocks/comments/eizvi8/people_sitting_on_a_lot_of_cash_what_signal_are/fcvctkt/",
        "score": 49,
        "subreddit": "stocks",
        "created": 1578028213.0
    },
    {
        "author": "TheWorstTroll",
        "body": "If anyone wants to go fuckin nuts on a stock tomorrow RRC might be a good play now. They've been fuckin beaten to shit over liquidity and debt but they have a absolutely stupid amount of infrastructure and proven reserves in shale oil and nat gas. If we see a prolonged fossil fuel rally it could go 4 or 5x pretty fuckin quick.",
        "created_utc": 1578020001,
        "id": "fcw955k",
        "permalink": "/r/wallstreetbets/comments/ej7ytx/long_oil_were_going_to_war_boys_us_airstrike_in/fcw955k/",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1578048801.0
    },
    {
        "author": "nadoterisback",
        "body": "You guys are delusional as fuck if you think futures are going to recover from this shit over night.\n\nWay too big of a drop. We’re opening blood fucking red -1.5% on es minimum.\n\nAccept the loss now, you won’t feel as bad tomorrow.\n\nI’m all in calls too lol.",
        "created_utc": 1578441581,
        "id": "fdif9ro",
        "permalink": "/r/wallstreetbets/comments/elhq6i/what_are_your_moves_tomorrow_january_08/fdif9ro/",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1578470381.0
    },
    {
        "author": "Chols001",
        "body": "I’m of the opinion that if you don’t have something better to put your money into, then you should never wait for a stock to drop before buying it.\nIf I find a good stock I like to buy a position I’m comfortable with, and then average down if the stock drops. In my opinion you should never be all in cash, and if you do hold cash it should only be because you are without a stable income, so that you can’t average down if something drops, and you need that reserve cash.\nThat’s just how a I like it.\n\nIronically with the new earnings projections the stock is actually cheaper, compared to it’s expected cash flow, then it was 3 months ago. So from a fundamental standpoint you are better of buying the stock now, then you were 3 months ago.\nAlthough if you ask me, then I think cash flow estimates are a bit too optimistic looking 5-10 years out.",
        "created_utc": 1578401616,
        "id": "fdglsbe",
        "permalink": "/r/StockMarket/comments/elb0ru/is_tsla_a_good_buy/fdglsbe/",
        "score": 48,
        "subreddit": "StockMarket",
        "created": 1578430416.0
    },
    {
        "author": "blackicebaby",
        "body": "stroll in the park. V is king now.",
        "created_utc": 1578959968,
        "id": "febl3pj",
        "permalink": "/r/StockMarket/comments/eoceaa/visa_to_acquire_plaid_the_fintech_powering_venmo/febl3pj/",
        "score": 47,
        "subreddit": "StockMarket",
        "created": 1578988768.0
    },
    {
        "author": "WeeklysOnly",
        "body": "PRICED IN. Iran crisis is the busdriver now",
        "created_utc": 1578250119,
        "id": "fdatybv",
        "permalink": "/r/wallstreetbets/comments/ekgjlz/green_monday_confirmed/fdatybv/",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1578278919.0
    },
    {
        "author": "Malverde116",
        "body": "What do you tell your uncle now?",
        "created_utc": 1578004412,
        "id": "fcvl3kk",
        "permalink": "/r/wallstreetbets/comments/ej58cp/so_apple_just_hit_300/fcvl3kk/",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1578033212.0
    },
    {
        "author": "Studentofsorts",
        "body": "This is trump. Calling it now",
        "created_utc": 1578098752,
        "id": "fczdhp4",
        "permalink": "/r/wallstreetbets/comments/ejo45i/lord_trump_gave_me_some_fat_tendies_today_from/fczdhp4/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1578127552.0
    },
    {
        "author": "jcrice88",
        "body": "There are thousands of DUCs (drilled but uncompleted wells). These wells are ready to be hydraulically fractured bringing production online.   \n\nRig count can drop and service companies can take price concessions but wells are still being completed contributing to production.\n\nShale companies go out of business only to be bought by other oil companies. The wells don’t get shut in they just get acquired by a bigger fish.\n\nDUC count by area. \nhttps://www.eia.gov/petroleum/drilling/\n\nRigs are down 25% in the last 12 months for US onshore. But remember rig efficiencies are increasing too. In a few places i have worked 7 years ago a well took 20 days to drill and now it takes 4. Same thing with frac crews. Good frac crews pump 20+ hours a day. 5 years ago it was 8 hours a day. \n\nEdit: added some comments.",
        "created_utc": 1578278733,
        "id": "fdcmpcw",
        "permalink": "/r/investing/comments/eknh4h/how_does_american_oil_production_continue_to_rise/fdcmpcw/",
        "score": 44,
        "subreddit": "investing",
        "created": 1578307533.0
    },
    {
        "author": "Patrick8383",
        "body": "Son of a bitch. I placed a order this morning and it  said it didn't go through so I placed it again. Then it showed  both got placed and  it didn't let me cancel. Now they both filled. Not what I needed.",
        "created_utc": 1578321974,
        "id": "fddrddu",
        "permalink": "/r/RobinHood/comments/ekuzfj/errors/fddrddu/",
        "score": 44,
        "subreddit": "RobinHood",
        "created": 1578350774.0
    },
    {
        "author": "moroniccow",
        "body": "People did complain about him having an iPhone, now we know why",
        "created_utc": 1578159625,
        "id": "fd3lzze",
        "permalink": "/r/wallstreetbets/comments/ejxclf/apple_started_wwiii_so_that_phones_would_be/fd3lzze/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1578188425.0
    },
    {
        "author": "Mint_Juul",
        "body": "Saw a homeless person get arrested on a bike near my house, well now I have a new bike. Short Peloton",
        "created_utc": 1578400718,
        "id": "fdgkuu3",
        "permalink": "/r/wallstreetbets/comments/ela5f8/daily_discussion_thread_january_07_2020/fdgkuu3/",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1578429518.0
    },
    {
        "author": "GoldenKaze",
        "body": "Time for the Saudi oil company to make it's IPO now",
        "created_utc": 1578061959,
        "id": "fcxg0ak",
        "permalink": "/r/wallstreetbets/comments/ejeviv/saudis_on_that_iran_news_and_oil_spike/fcxg0ak/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1578090759.0
    },
    {
        "author": "terran42069",
        "body": "Caring about it isn't gonna make me money now is it?",
        "created_utc": 1578082555,
        "id": "fcym4qe",
        "permalink": "/r/wallstreetbets/comments/ejkryd/imagine_if_the_iranians_saw_this_subreddit/fcym4qe/",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1578111355.0
    },
    {
        "author": "Colorshake",
        "body": "I’m from the Middle East and moved to America while I was in elementary school. \n\nAs a child, I was on the receiving end of those bombs. Now, thanks to my LMT calls, every time some kid in Syria gets droned I get a nickel. \n\nThat is the American fucking dream, and I’d appreciate it if you wouldn’t take that away from me with your bullshit moral posts.",
        "created_utc": 1578459946,
        "id": "fdj6nuk",
        "permalink": "/r/wallstreetbets/comments/elkxe9/remember_that_there_could_be_people_dying_right/fdj6nuk/",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1578488746.0
    },
    {
        "author": "CarlCarbonite",
        "body": "SPX 3240 Calls at open expiring RIGHT FUCKING NOW! (Or at least end of day)\n\nUpdate: Sold the calls for $700. Going to bed now. This money will be used for Starbucks and redbull and whatever 7-11 gives me. Maybe a pizza.",
        "created_utc": 1578060215,
        "id": "fcxdr74",
        "permalink": "/r/wallstreetbets/comments/ejfqnu/buy_the_dip/fcxdr74/",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1578089015.0
    },
    {
        "author": "WrongCheck",
        "body": "I’m sure you’ll get a lot of people who will have better advice, but what I’ve learned from here over and over is “time in the market bests timing the market.” If you Google it or search here people have feared a recession for the last couple years. So people who had those fears at this time last year would have missed a year of great growth.\n\nI first started investing a couple years ago right before that big dip. I thought I was an idiot because if I waited a month I would have made a lot more money. But now I’ve made a lot of money off my very basic investments. I would say if you have doubts then hold some of your money out, but I think you’re going to find most people say don’t try to time the market.",
        "created_utc": 1578316644,
        "id": "fddlbwt",
        "permalink": "/r/StockMarket/comments/ektuix/is_now_a_good_time_to_invest_in_vanguard_index/fddlbwt/",
        "score": 40,
        "subreddit": "StockMarket",
        "created": 1578345444.0
    },
    {
        "author": "DadGoneGamer",
        "body": "I just have to say, I have never been more embarrassed to serve in my capacity as Bear Gang Colonel as I am right now. \n \nI understand that this market is way overextended and propped up by Fed pumps, but, wishing for the deaths of US and coalition troops and even Iranians to save your short positions is beyond the pale. I want this market to come back down to earth just like everyone else who is short US equities but not at the expense of human life.",
        "created_utc": 1578451959,
        "id": "fdivhh2",
        "permalink": "/r/wallstreetbets/comments/elhq6i/what_are_your_moves_tomorrow_january_08/fdivhh2/",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1578480759.0
    },
    {
        "author": "simplevalue",
        "body": "This is not a good conclusion. A lot of investing is having the gut to invest when a company has negative profits, tons of cash burn, after the 2000 dot com bust, etc etc etc. Hindsight yes amazon was a great investment, now realize how many seemed just as good but failed.",
        "created_utc": 1578205882,
        "id": "fd7kfna",
        "permalink": "/r/investing/comments/ek84pk/i_got_bored_and_went_through_amazons_financial/fd7kfna/",
        "score": 40,
        "subreddit": "investing",
        "created": 1578234682.0
    },
    {
        "author": "blaked_baller",
        "body": "It's been a couple minutes, you can clap now",
        "created_utc": 1578273618,
        "id": "fdcfhul",
        "permalink": "/r/wallstreetbets/comments/ekmd7o/how_to_predict_the_next_market_pullback_its_not/fdcfhul/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1578302418.0
    },
    {
        "author": "bigbear0083",
        "body": "y/w!\n\nit's been a couple of months since i've posted these on this sub haha.\n\nnow that i'm back from all the holiday festivities, i figure i'll get back to regularly putting this out in here every weekend.\n\nthanks for chiming in here it's very much appreciated! :)",
        "created_utc": 1578149619,
        "id": "fd2n76f",
        "permalink": "/r/stocks/comments/ejx7sw/wall_street_week_ahead_for_the_trading_week/fd2n76f/",
        "score": 38,
        "subreddit": "stocks",
        "created": 1578178419.0
    },
    {
        "author": "analyzethis2018",
        "body": "I watched Mando and liked it for what it was.\n\nOver Christmas, we watched 'Home Alone', 'Noelle', 'A Christmas Carol' ... maybe another Christmas something I don't recall.\n\nLooked for something to watch last night and there is literally *nothing* else I want to see.\n\nLooked again just now for something to watch ... nada.  \n\nDecided to cancel before I forget and get billed another month.",
        "created_utc": 1578259473,
        "id": "fdbodb0",
        "permalink": "/r/wallstreetbets/comments/ekj4sd/cancelled_my_disney_plus_subscription_how_many/fdbodb0/",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1578288273.0
    },
    {
        "author": "omfgcjcj",
        "body": "I was listening to warren &amp; munger answering a question about that at a recent event. An old lady had brought some figures with her and said you always preach index funds, so why does Berkshire sit on so much cash when if it had been parked in an index fund since (whenever) then that would have amounted to being (bigger amount) now.\n\nIf I remember right their answer was along the lines of;\nA) great question, yes it would have made more money in an index fund\nB) we like having cash-on-hand so we can move very quickly on good opportunities \nC) cash on hand keeps things low-stress for our investors\nD) the sheer size of BRK means that any positions they make or withdraw has big ripple effects on markets as a whole",
        "created_utc": 1577993296,
        "id": "fcv2ifa",
        "permalink": "/r/stocks/comments/eiv70i/if_you_were_forced_to_put_all_of_your_money_into/fcv2ifa/",
        "score": 37,
        "subreddit": "stocks",
        "created": 1578022096.0
    },
    {
        "author": "mylons",
        "body": "it’s priced in now. Iran isn’t going to do shit for weeks. We’re back in the green next week. BULL GANG",
        "created_utc": 1578050119,
        "id": "fcx3wo5",
        "permalink": "/r/wallstreetbets/comments/ejaqzf/literally_the_first_time_i_buy_spy_calls_we_go_to/fcx3wo5/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1578078919.0
    },
    {
        "author": "sbarrettm",
        "body": "WW3 Memes are HOT. Invest now.",
        "created_utc": 1578078058,
        "id": "fcycl5c",
        "permalink": "/r/wallstreetbets/comments/ejfv3k/no_fight_for_green_men/fcycl5c/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1578106858.0
    },
    {
        "author": "gegege_69",
        "body": "All of this seems pretty nonsense to say the least. Please seek professional help now",
        "created_utc": 1578694115,
        "id": "fds4f5n",
        "permalink": "/r/wallstreetbets/comments/emxzlw/barely_survived_by_selling_naked_calls_on_tsla/fds4f5n/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1578722915.0
    },
    {
        "author": "lonewolf420",
        "body": "He is like the ol' grandpa that you know was once really smart but is starting to fall for the fishing email scams by some Chinese guy and will only sing praises of how the Chinese are so much better and how he loves the Yuan now. You just know he is going to start losing it in 5 years but you can't help/talk to him because you still want a piece of his estate and don't want to be written out of the will.",
        "created_utc": 1578347038,
        "id": "fdeus9g",
        "permalink": "/r/wallstreetbets/comments/eku3kd/buffetts_plan_for_ww3/fdeus9g/",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1578375838.0
    },
    {
        "author": "tacotruck7",
        "body": "Yeah, I don't think the tech bubble of 20ish years ago had anything to do with y2k. Is someone making that claim now? Or is OP just conflating to two events?",
        "created_utc": 1579378295,
        "id": "fetq7jq",
        "permalink": "/r/investing/comments/eqj0lj/adblockers_are_the_next_y2k_bug_my_adblocker/fetq7jq/",
        "score": 36,
        "subreddit": "investing",
        "created": 1579407095.0
    },
    {
        "author": "69SluttyPoptarts",
        "body": "lol at not longing credit card companies, CC’s have continually gone up in adoption since the 1980’s, now the average person has crippling credit card debt and an addiction to the finer things in life funded by a plastic card and nothing else",
        "created_utc": 1578143974,
        "id": "fd29vtv",
        "permalink": "/r/wallstreetbets/comments/ejt54j/so_the_war_cycle_begins/fd29vtv/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1578172774.0
    },
    {
        "author": "stellarfury",
        "body": "Maybe you're right. Maybe you're not. Personally, I wouldn't bet actual money on this sort of... *intensely* reductive analysis of incredibly complex systems like national/global economies.\n\nMy point is, people have been saying this for years - what's different now? To me, this sort of doomsaying is just as credible as WSB's \"STONKS ALWAYS GO UP\" line.",
        "created_utc": 1578009082,
        "id": "fcvsgmk",
        "permalink": "/r/investing/comments/ej4d5e/dow_jumps_250_points_hits_record_as_wall_streets/fcvsgmk/",
        "score": 35,
        "subreddit": "investing",
        "created": 1578037882.0
    },
    {
        "author": "EHobby23",
        "body": "The magic will happen at 27 PE, or based on Papa John's satanic ritual roughly 30 days from now.  I heard near spx 3300.  All in puts after Tesla hits 450 and Acb goes to $1.",
        "created_utc": 1578007680,
        "id": "fcvqah1",
        "permalink": "/r/wallstreetbets/comments/ej5vt8/am_i_the_only_one_concerned_with_these_levels/fcvqah1/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1578036480.0
    },
    {
        "author": "mavman97",
        "body": "Okay now I’m DEFINITELY shorting it.",
        "created_utc": 1578095752,
        "id": "fcz8ei0",
        "permalink": "/r/stocks/comments/ejnodf/uber_is_up_almost_12_since_cramer_said_it_was_a/fcz8ei0/",
        "score": 34,
        "subreddit": "stocks",
        "created": 1578124552.0
    },
    {
        "author": "desquibnt",
        "body": "I hate technical analysis. It see boogeymen in every chart. 8 months ago, all the technical analysts were proclaiming doom because of an inverted yield curve and look where we are now.\n\nBut hey, if you say there's a recession coming long enough, you'll eventually be right",
        "created_utc": 1579473599,
        "id": "ff0yr88",
        "permalink": "/r/investing/comments/er2pqj/more_than_27_of_the_sp_500s_stocks_are_overbought/ff0yr88/",
        "score": 34,
        "subreddit": "investing",
        "created": 1579502399.0
    },
    {
        "author": "Mocker-Nicholas",
        "body": "The one I recommend most is “I will teach you to be rich”. At that point in my life I had started making money but didn’t really know what to do with it so I just it into something I thought would be a sure thing. I’m much more regimented with how I handle finances now. That’s more of a personal finance book than investing, but personal finance was definitely something I needed to get down before I started pumping money into my brokerage all willy nilly.",
        "created_utc": 1578183680,
        "id": "fd602yj",
        "permalink": "/r/investing/comments/ejyye9/what_was_your_path_in_learning_about_the_stock/fd602yj/",
        "score": 34,
        "subreddit": "investing",
        "created": 1578212480.0
    },
    {
        "author": "WorstEpEver",
        "body": "Turn back now",
        "created_utc": 1578008455,
        "id": "fcvri1a",
        "permalink": "/r/wallstreetbets/comments/ej6g7b/wsb_youve_got_another_one/fcvri1a/",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1578037255.0
    },
    {
        "author": "Kapppaaaa",
        "body": "I read the title and was worried for a bit. Then I saw it was on this sub and relaxed again. Does that mean that ww3 will never happen now? Since everything in this sub the opposite happens.",
        "created_utc": 1578026575,
        "id": "fcwikgy",
        "permalink": "/r/wallstreetbets/comments/ej9lvk/world_war_3_has_started/fcwikgy/",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1578055375.0
    },
    {
        "author": "RLaG69",
        "body": "Elon musk is having a kid and danced, and that makes TSLA undervalued. Those moves are at least in the 1000’s. he knows something we don’t. \n\nReal talk, memes control the market. Economist are fuming right now.",
        "created_utc": 1578964268,
        "id": "febye91",
        "permalink": "/r/investing/comments/eocqb7/tesla_proves_i_know_nothing_about_stocks_and/febye91/",
        "score": 33,
        "subreddit": "investing",
        "created": 1578993068.0
    },
    {
        "author": "IRPhysicist",
        "body": "2020 fire sale going on now. Except for AAPL, that thing has retard strength.",
        "created_utc": 1578051675,
        "id": "fcx563y",
        "permalink": "/r/wallstreetbets/comments/ejdzm4/daily_discussion_thread_january_03_2020/fcx563y/",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1578080475.0
    },
    {
        "author": "eskimoboob",
        "body": "Ok. If you're going to play vix options, there's something everyone needs to understand.  The options are not based on the spot VIX. They are essentially based on vix futures for the corresponding month. \n\n That makes buying calls doubly expensive. Because let's say for example, you want to buy the April 15 call.  The April future is at 17.1 right now. So calls on that 15 strike are already ITM, and you're going to pay $3.20 for them. But as expiration gets closer,  the futures also converge to the spot price. Meaning if vix stays under 15 the future price is going to gradually decay and you lose money on not just the option price due to theta,  but also on the fact that the underlying future is decaying.  \n\nSo if you're going to do this,  I would highly recommend spreading it. If you buy a 15C, at least sell a higher strike. Maybe a 22C. Sure you cap your upside,  but you also save a dollar on premium. \n\nTLDR: VIX options are a bitch if you don't understand them",
        "created_utc": 1577989044,
        "id": "fcuuxr0",
        "permalink": "/r/wallstreetbets/comments/ej166k/90_day_vix_remember_as_vix_drops_for_next_week/fcuuxr0/",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1578017844.0
    },
    {
        "author": "stormwillpass",
        "body": "Quit bitching about the thread not being pinned because reddit is bugged about it right now. Whenever I pin it, another one replaces it even though there is only one pin. It's as if there's an invisible first pin, so only one thread is pinned at a time instead of the usual two.",
        "created_utc": 1578101997,
        "id": "fcziisu",
        "permalink": "/r/wallstreetbets/comments/ejnadw/weekend_discussion_thread_january_35_2020/fcziisu/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1578130797.0
    },
    {
        "author": "MUnitedRelegated2020",
        "body": "If we are being honest, it’s even less threatening than that. Iran kept fucking in the USA’s business, they got whacked, and they are now showing the world they are giant cowards.   \nThis is the same place where “death to America” chants frequently break out in their literal fucking government, and during their prayer ceremonies. This has been occurring for FORTY YEARS.   \nColor me shocked that their bravest actions yet have pussy pirates boarding civilian ships in the Strait.",
        "created_utc": 1578324826,
        "id": "fddv9e7",
        "permalink": "/r/wallstreetbets/comments/eku3kd/buffetts_plan_for_ww3/fddv9e7/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1578353626.0
    },
    {
        "author": "Winkerisfat",
        "body": "If you didn't make money today that's fine but WHAT THE FUCKING FUCK ARE YOU FUCKING DOING HOLY SHIT ARE YOU RETARDEF THEYRE PRATICALLY GIVING AWAY TENDIES RIGHT NOW GET YOUR HEAD IN THE GAME",
        "created_utc": 1578952609,
        "id": "feavklz",
        "permalink": "/r/wallstreetbets/comments/eoabog/what_are_your_moves_tomorrow_january_14/feavklz/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1578981409.0
    },
    {
        "author": "Reacher-Said-Nothing",
        "body": "&gt; Dude's 73 and still rocking that big dick energy\n\nNow that I think of it I haven't actually seen him do anything \"energetic\".  Like he doesn't even yell in his firey speeches, he just talks.",
        "created_utc": 1578176999,
        "id": "fd5f2wn",
        "permalink": "/r/wallstreetbets/comments/ejxclf/apple_started_wwiii_so_that_phones_would_be/fd5f2wn/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1578205799.0
    },
    {
        "author": "nzholtok",
        "body": "Guys I have some amazing, yet frightening news to share with you. After months of analyzing every chart, I have come to the startling conclusion that we are living in the matrix and stocks only go up now. Please plan accordingly.👨🏾‍🍳",
        "created_utc": 1577999348,
        "id": "fcvcppb",
        "permalink": "/r/wallstreetbets/comments/ej49t7/what_are_your_moves_tomorrow_january_03/fcvcppb/",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1578028148.0
    },
    {
        "author": "za01",
        "body": "No point in waiting for a recession. You’ll miss out on gains whilst you wait. I’d buy now, hold and wait. When and if a recession comes, cool, you get shares at a discount but I wouldn’t wait for one and potentially miss out on profits.",
        "created_utc": 1578316577,
        "id": "fddl9kj",
        "permalink": "/r/StockMarket/comments/ektuix/is_now_a_good_time_to_invest_in_vanguard_index/fddl9kj/",
        "score": 30,
        "subreddit": "StockMarket",
        "created": 1578345377.0
    },
    {
        "author": "Cocaine_Addiction",
        "body": "I have been considering rehab for awhile now. Would you recommend it?",
        "created_utc": 1578254858,
        "id": "fdb8efw",
        "permalink": "/r/wallstreetbets/comments/ekdys5/being_a_bear_is_not_good_for_mental_health/fdb8efw/",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1578283658.0
    },
    {
        "author": "urmommasman",
        "body": "Showed my new WSB shirt to my gf, she asked why I had a shirt with Trump on it... she’s a raging liberal so I let her think I have a Trump t-shirt now.",
        "created_utc": 1578260145,
        "id": "fdbpz7n",
        "permalink": "/r/wallstreetbets/comments/ekj3ek/what_are_your_moves_tomorrow_january_06/fdbpz7n/",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1578288945.0
    },
    {
        "author": "Veliladon",
        "body": "tl;dr: \n\n* buying options is lottery tickets\n* selling options is being a casino\n\nlong answer:\n\nhomeboy OP bought a lottery ticket that the SPY would crash down to $323.50. Since stonks only go up homeboy's lottery ticket is worth about the same as a real lottery ticket. He decided to sell his shitty lottery ticket and take a massive 35 grand loss.\n\nNow, instead, if homeboy sold someone else a second shitty lottery ticket that was almost sure to lose, he would be able to make most of the money back and turn his 35 grand loss into a 5 grand loss thereby saving said homeboy 30 fucking grand.",
        "created_utc": 1578693175,
        "id": "fds246i",
        "permalink": "/r/wallstreetbets/comments/emvq1b/50k_in_spy_puts_update_oh_my_guh/fds246i/",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1578721975.0
    },
    {
        "author": "useful",
        "body": "The current price is $100 per share. I give you $20 for the right to buy the share for $180 in 1 year. You are like, 20% right now? Yes please. So you pocket $20 and you hold the shares for a year.\n\nIn a year, the sock shoots up to $400. Now I buy the share from you for $180. You made $100 counting my $20 I gave you for a contract! I pocket $200 when I sell the sock after exercising the contract to sell for $400. We each had a 100% gain but you are kicking yourself because you could have made $300 instead of $100.",
        "created_utc": 1578075829,
        "id": "fcy790e",
        "permalink": "/r/stocks/comments/ejfdl3/tesla_tops_wall_street_estimated_with_112000/fcy790e/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1578104629.0
    },
    {
        "author": "incutt",
        "body": "In general, do you know much about the retailing business?  If you believe you missed out on an easy winner in Amazon, you can load up on Wayfair now.  If Wayfair can make it, it will be the 2025 no brainer.",
        "created_utc": 1578206030,
        "id": "fd7kryz",
        "permalink": "/r/investing/comments/ek84pk/i_got_bored_and_went_through_amazons_financial/fd7kryz/",
        "score": 29,
        "subreddit": "investing",
        "created": 1578234830.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  1st of January\n\n\n\n## Upcoming events for Wednesday, January  1st\n\n - Expected earnings:\n\n  ACY, CTST, ENIA, NBSE, PZG, ROYT, SPCB, TEUM, XBIT\n\n - Ex-div:\n\n  RSG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -7.900M)\n    - United States - New Year's Day\n\n## Upcoming events for Thursday, January  2nd\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.5)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-01",
        "created_utc": 1577913369,
        "id": "fcs9i8s",
        "permalink": "/r/RobinHood/comments/eiipnb/semiannual_stock_discussion_thread_winterspring/fcs9i8s/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577942169.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  1st of January\n\n\n\n## Upcoming events for Wednesday, January  1st\n\n - Expected earnings:\n\n  ACY, CTST, ENIA, NBSE, PZG, ROYT, SPCB, TEUM, XBIT\n\n - Ex-div:\n\n  RSG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -7.900M)\n    - United States - New Year's Day\n\n## Upcoming events for Thursday, January  2nd\n\n - Stock splits:\n\n    - BCTXF @ **1:300**\n    - TAPM @ **1:160**\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.5)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-01",
        "created_utc": 1577918531,
        "id": "fcskopb",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fcskopb/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577947331.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  2nd of January\n\n\n\n## Upcoming events for Thursday, January  2nd\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (consensus: 1,717K, previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.6)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-02",
        "created_utc": 1577962811,
        "id": "fctwajw",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fctwajw/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577991611.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  1st of January\n\n\n\n## Upcoming events for Wednesday, January  1st\n\n - Expected earnings:\n\n  ACY, CTST, ENIA, NBSE, PZG, ROYT, SPCB, TEUM, XBIT\n\n - Ex-div:\n\n  RSG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -7.900M)\n    - United States - New Year's Day\n\n## Upcoming events for Thursday, January  2nd\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.5)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-01",
        "created_utc": 1577913369,
        "id": "fcs9i8s",
        "permalink": "/r/RobinHood/comments/eiipnb/semiannual_stock_discussion_thread_winterspring/fcs9i8s/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577942169.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  1st of January\n\n\n\n## Upcoming events for Wednesday, January  1st\n\n - Expected earnings:\n\n  ACY, CTST, ENIA, NBSE, PZG, ROYT, SPCB, TEUM, XBIT\n\n - Ex-div:\n\n  RSG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -7.900M)\n    - United States - New Year's Day\n\n## Upcoming events for Thursday, January  2nd\n\n - Stock splits:\n\n    - BCTXF @ **1:300**\n    - TAPM @ **1:160**\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.5)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-01",
        "created_utc": 1577918531,
        "id": "fcskopb",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fcskopb/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577947331.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  2nd of January\n\n\n\n## Upcoming events for Thursday, January  2nd\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (consensus: 1,717K, previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.6)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-02",
        "created_utc": 1577962811,
        "id": "fctwajw",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fctwajw/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577991611.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  1st of January\n\n\n\n## Upcoming events for Wednesday, January  1st\n\n - Expected earnings:\n\n  ACY, CTST, ENIA, NBSE, PZG, ROYT, SPCB, TEUM, XBIT\n\n - Ex-div:\n\n  RSG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -7.900M)\n    - United States - New Year's Day\n\n## Upcoming events for Thursday, January  2nd\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.5)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-01",
        "created_utc": 1577913369,
        "id": "fcs9i8s",
        "permalink": "/r/RobinHood/comments/eiipnb/semiannual_stock_discussion_thread_winterspring/fcs9i8s/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577942169.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  1st of January\n\n\n\n## Upcoming events for Wednesday, January  1st\n\n - Expected earnings:\n\n  ACY, CTST, ENIA, NBSE, PZG, ROYT, SPCB, TEUM, XBIT\n\n - Ex-div:\n\n  RSG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -7.900M)\n    - United States - New Year's Day\n\n## Upcoming events for Thursday, January  2nd\n\n - Stock splits:\n\n    - BCTXF @ **1:300**\n    - TAPM @ **1:160**\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.5)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-01",
        "created_utc": 1577918531,
        "id": "fcskopb",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fcskopb/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577947331.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  2nd of January\n\n\n\n## Upcoming events for Thursday, January  2nd\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (consensus: 1,717K, previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.6)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-02",
        "created_utc": 1577962811,
        "id": "fctwajw",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fctwajw/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577991611.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  1st of January\n\n\n\n## Upcoming events for Wednesday, January  1st\n\n - Expected earnings:\n\n  ACY, CTST, ENIA, NBSE, PZG, ROYT, SPCB, TEUM, XBIT\n\n - Ex-div:\n\n  RSG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -7.900M)\n    - United States - New Year's Day\n\n## Upcoming events for Thursday, January  2nd\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.5)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-01",
        "created_utc": 1577913369,
        "id": "fcs9i8s",
        "permalink": "/r/RobinHood/comments/eiipnb/semiannual_stock_discussion_thread_winterspring/fcs9i8s/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577942169.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  1st of January\n\n\n\n## Upcoming events for Wednesday, January  1st\n\n - Expected earnings:\n\n  ACY, CTST, ENIA, NBSE, PZG, ROYT, SPCB, TEUM, XBIT\n\n - Ex-div:\n\n  RSG\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -7.900M)\n    - United States - New Year's Day\n\n## Upcoming events for Thursday, January  2nd\n\n - Stock splits:\n\n    - BCTXF @ **1:300**\n    - TAPM @ **1:160**\n\n - Expected earnings:\n\n  ACH, AHCO, CDZI, EARS, IIVI, KZIA, LNDC, LYG, PSTI, RECN, SITO\n\n - Ex-div:\n\n  AEO, AFB, AIR, APLE, AXP, BBX, BMY, CLF, CLI, CSCO, CUZ, CVBF, DOC, FAM, FCPT, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, GL, GLT, HBNC, HLIO, HT, ITUB, IVC, KDP, MORN, MVC, NTAP, OC, RGLD, SAFE, SYY, TOT, UBA, UBP, VIV, WDC, WIRE, WSR\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.555%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (previous: 1,719K)\n    - FOMC Meeting Minutes\n    - Initial Jobless Claims (consensus: 225K, previous: 222K)\n    - Jobless Claims 4-Week Avg. (previous: 228.00K)\n    - MBA 30-Year Mortgage Rate (previous: 3.99%)\n    - MBA Mortgage Applications (previous: -5.3%)\n    - MBA Purchase Index (previous: 250.1)\n    - Manufacturing PMI (consensus: 52.5, previous: 52.5)\n    - Mortgage Market Index (previous: 478.7)\n    - Mortgage Refinance Index (previous: 1,859.0)\n\n## Upcoming events for Friday, January  3rd\n\n - Expected earnings:\n\n  LW, ONCS, TRCH, USAU\n\n - Ex-div:\n\n  BBD, BBDO, BRX, CIG, CXW, GFED, HIFS, JPM, RCII, WERN\n\n - Economic events and announcements:\n\n    - Construction Spending (consensus: 0.3%, previous: -0.8%)\n    - Crude Oil Imports (previous: 0.466M)\n    - Crude Oil Inventories (consensus: -3.167M, previous: -5.474M)\n    - Cushing Crude Oil Inventories (previous: -2.393M)\n    - Distillate Fuel Production (previous: 0.322M)\n    - EIA Refinery Crude Runs  (previous: 0.418M)\n    - EIA Weekly Distillates Stocks (consensus: 1.833M, previous: -0.152M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.8%, previous: 2.7%)\n    - Gasoline Inventories (consensus: 2.100M, previous: 1.963M)\n    - Gasoline Production (previous: 0.429M)\n    - Heating Oil Stockpiles (previous: 0.588M)\n    - ISM Manufacturing Employment (previous: 46.6)\n    - ISM Manufacturing New Orders Index (previous: 47.2)\n    - ISM Manufacturing PMI (consensus: 49.0, previous: 48.1)\n    - ISM Manufacturing Prices (consensus: 47.5, previous: 46.7)\n    - ISM NY Business Conditions (previous: 50.4%)\n    - ISM-New York Index (previous: 874.5)\n    - Natural Gas Storage (consensus: -148B, previous: -161B)\n    - Total Vehicle Sales (previous: 17.10M)\n    - U.S. Baker Hughes Oil Rig Count (previous: 677)\n    - U.S. Baker Hughes Total Rig Count (previous: 805)\n\n^^^^2020-01-01",
        "created_utc": 1577918531,
        "id": "fcskopb",
        "permalink": "/r/RobinHood/comments/eip04v/semiannual_stock_discussion_thread_winterspring/fcskopb/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1577947331.0
    }
]