[
    {
        "author": "lisa2372",
        "body": "Their last announcement came out on a Friday. Tel Aviv market didn’t matter!!!   https://twitter.com/abdaman69/status/1276246385608843271?s=21",
        "created_utc": 1593116022,
        "id": "fvzn8nh",
        "score": 22,
        "subreddit": "pennystocks",
        "created": 1593144822.0
    },
    {
        "author": "RegularSheets",
        "body": " [$KTOV](https://stocktwits.com/symbol/KTOV) TEL-AVIV, Israel, June 23, 2020 (GLOBE NEWSWIRE) -- Kitov Pharma Ltd. (“Kitov”) (NASDAQ/TASE: KTOV), a clinical-stage company advancing first-in-class therapies to overcome tumor immune evasion and drug resistance, today announced that it has entered into definitive agreements with several healthcare-focused institutional investors for the purchase and sale of 38,888,892 of the Company’s ordinary shares represented by American Depositary Shares (ADSs) and warrants to purchase up to an aggregate of 19,444,446 ADSs, at a combined purchase price of $0.90 per ADS and associated warrant, in a registered direct offering, for aggregate gross proceeds of approximately $35.0 million. Each ADS represents one ordinary share, no par value, of Kitov. The offering is expected to close on or about June 25, 2020, subject to satisfaction of customary closing conditions.",
        "created_utc": 1592933465,
        "id": "fvrhn27",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1592962265.0
    },
    {
        "author": "Chiral_Chemist",
        "body": "Merck does PR eastern time so (at least for me) it matches the time zone. I think since Merck (no offense KTOV) is much more important to the American market they would benefit off releasing it to cater us more so than the Tel Aviv market, but I may just be talking out of my ass.\n\nI just think if it's either Merck or Eli Lilly than the American market will be #1 in their mind when it comes to what time they announce a collaboration as opposed to a smaller (positive) impact for the Tel Aviv market by letting Kitov decide on the PR time slot. \n\nMerck &gt;&gt;&gt;&gt; Kitov\n\nIf this collaboration is true, Kitov would be lucky to have a say in anything honestly.",
        "created_utc": 1593462448,
        "id": "fwejv7g",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1593491248.0
    },
    {
        "author": "Matrix1216",
        "body": "That’d be epic. Hard to tel, GDP revision numbers out and bank stress test on Thursday",
        "created_utc": 1592856698,
        "id": "fvo6jzq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1592885498.0
    },
    {
        "author": "GraciaEtScientia",
        "body": "Can't find anything about it right away but my best guess would be 1 Tel Aviv KTOV share = +- 100 adr shares?",
        "created_utc": 1592958794,
        "id": "fvsvmwg",
        "score": 4,
        "subreddit": "stocks",
        "created": 1592987594.0
    },
    {
        "author": "stopthewankdotcom",
        "body": "Tel that to the government who won’t let them fail",
        "created_utc": 1591253636,
        "id": "fsu3hj0",
        "score": 3,
        "subreddit": "stocks",
        "created": 1591282436.0
    },
    {
        "author": "lostwanderings",
        "body": "I went to make pancakes for the kids and fucking came back from $3000 in the green to now in the red. Can’t tel by how much cause the price isn’t updating. \n\nMost expensive pancakes I’ve ever had.",
        "created_utc": 1591282863,
        "id": "fsv6xm0",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1591311663.0
    },
    {
        "author": "ComicOzzy",
        "body": "One is it's listing on the NASDAQ in the US of A. The other is it's listing on the Tel Aviv stock exchange in Israel.",
        "created_utc": 1591309486,
        "id": "fswrpfu",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1591338286.0
    },
    {
        "author": "Bear_buh_dare",
        "body": "getting on a plane to tel aviv so i can suck off isaac israel",
        "created_utc": 1593048396,
        "id": "fvwufxx",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1593077196.0
    },
    {
        "author": "Blacklistedb",
        "body": "I see your point but I think u cant compare a crisis. 2008 was something else, time will tel though.",
        "created_utc": 1592259232,
        "id": "fuy69fz",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1592288032.0
    },
    {
        "author": "GrowingAmeeture",
        "body": "Thanks for the responses. Hopefully I did the right thing I got 25 shares of AVCT at 3.58\nI did this because this morning they were up a few Dollars in the morning. What time should I be looking to pull these kinds of trades. Also how can you tel it’s going to be a 10-15% increase at open",
        "created_utc": 1591815722,
        "id": "ftm3kuf",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1591844522.0
    },
    {
        "author": "Rmonte90",
        "body": "Last big PR from them came on a friday. They don’t seem to fussed about whether Tel Aviv market is up. This partnership would play well for them in the US more anyway. But then again who knows. It’s all a guessing game",
        "created_utc": 1593142454,
        "id": "fw0yxac",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1593171254.0
    },
    {
        "author": "livedogroll",
        "body": "Looks like they really were virtue signaling eh? Don’t tel reddit",
        "created_utc": 1591898712,
        "id": "ftpwjrr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591927512.0
    },
    {
        "author": "imsilver4fukyou",
        "body": "Be a good friend and tel em to buy hertz",
        "created_utc": 1593549705,
        "id": "fwiirif",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593578505.0
    },
    {
        "author": "moonshoed",
        "body": "I recently watched Social Network for the first time and then went down a bit of rabbit hole reading about Sean Parker and Peter Thiel in particular. This company, Palantir, was funded early on by In-Q-Tel which I can’t believe is real, but I guess you knew that if you read the article. Personally, I think the fight for data rights ended before we knew it was even happening and companies like Palantir just vacuum that shit up and sell it while we continue to give it away for free. So if Palantir does have an IPO I will be buying in as a way to get some returns on my data while we wait for data to become democratized.",
        "created_utc": 1591944946,
        "id": "fukp211",
        "score": 1,
        "subreddit": "investing",
        "created": 1591973746.0
    },
    {
        "author": "BIitz",
        "body": "ADCO is an interesting company with a great balance sheet\n\nADCORE Inc. provides machine-learning powered advertising technologies worldwide. The company offers a suite of solutions for digital advertisers to enhance and maximize their search engine marketing, including ADCORE Views, a search solution used from campaign creation to smart bidding; Feeditor, a shopping solution used from feed management to campaign creation; and SEMDoc, a dashboard for analyzing 52-key account and campaign metrics. It serves digital marketing agencies; e-commerce businesses; and financial technology, travel, and other industries. The company was founded in 2006 and is headquartered in Tel Aviv, Israel.",
        "created_utc": 1591929844,
        "id": "ftrk1wp",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591958644.0
    },
    {
        "author": "CoronaVirusFanboy",
        "body": "&gt;So is DIS a cheap no brainer to pick up because $113 is super on sale from $130, or is it still overpriced compared to $100, or even the $88 lows. Only time will tel\n\nThere's a reason DIS is bleeding its ass since the corona because it has basically every attribute from the most hit industries by corona, it's not like the market is sleeping on some super duper discount, I was trying to start debate if Disney can go bankrupt and was laughed at, Disney took big gambles with expanding on the worst possible moment with CEO leaving at the worst possible moment. If a solid stock goes on a real discount then it's instantly bought, I had an alert when AMD hits $49 and literally the minute later it bounced back to over $52.",
        "created_utc": 1592152567,
        "id": "futa4yb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592181367.0
    },
    {
        "author": "parker2020",
        "body": "Either I pissed off a mod or it’s random I couldn’t tel you",
        "created_utc": 1591017236,
        "id": "fsiunxu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591046036.0
    },
    {
        "author": "guppyfighter",
        "body": "TEL",
        "created_utc": 1591610437,
        "id": "ftct9zg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591639237.0
    },
    {
        "author": "bm246",
        "body": "not that i want to sell i’ll ride it to its high point but i’m just too inexperienced and have no idea when to tel it’s high point everything i’ve researched says this should be it’s high point but everyone says it isn’t so i’m at a loss as for what to do",
        "created_utc": 1591655788,
        "id": "ftf0yav",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591684588.0
    },
    {
        "author": "aron2295",
        "body": "Honestly, I’m for putting the least amount down. \n\nOur PMI is $100 ~. I’ve seen it lower on a few. \n\nI was told it did used to be $200 - $300. \n\nI know you asked if there was any strategy. \n\nThese are my thoughts:\n\n1) Rates are low. Honestly, rates are so low, it’s warped people’s perception. From what I understand, in the 20th century, in the 80’s, rates could hit 20%. \n\nInflation is 2%. 30 year fixed rate mortgages are 3% ~. If someone keeps renting, their rent will keep going up and when they leave, they own nothing. They paid someone else’s mortgage. In Every time I left an apartments, they always found something to bill you for. So, I wasn’t even living there and I had to pay them!\n\n2) When it’s in the house, you can’t access it. We’ve gotten a lot of calls of people that want to re finance and take cash out or get a Home Equity Line of Credit (HELOC). I like to tel customers to think of their home like a savings account. But, 1) we’re not offering those right now and 2) It’s a 2nd mortgage. It’s not quick. I’m sure they would’ve spent it some other way but still. \n\n3) Going back to renting, around me, and this may be region specific, a one bedroom is $1000 / month. I’d rather pay $100 / month for PMI knowing every month I’m building up equity then pay $1000 / month and build up nothing. And if you want you a house, you’re still saving up for that too. \n\nThe way I see it, the house doesn’t know how it’s being paid for and it doesn’t care. A customer is always welcome to pay extra towards the principal so this could come across as rude but if someone wants to pay the house off quickly, that’s up to them. Work a second job, move up in your field, win the lottery, again, the house does not care and we don’t have any early pay off penalties or restrictions.",
        "created_utc": 1593183902,
        "id": "fw2ha54",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593212702.0
    },
    {
        "author": "ShootingTurtle",
        "body": "Nope. The PCTI ticker is  PC-Tel, Inc. They're acquiring [https://pcti.com/](https://pcti.com/). The new site is popping tomorrow right when the market opens.\n\nNew site:  [http://ozopenergy.com/](http://ozopenergy.com/)",
        "created_utc": 1593147454,
        "id": "fw168dw",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593176254.0
    },
    {
        "author": "lukesteph10",
        "body": "Don’t be surprised if there is no PR tomorrow, due to time zones and it being EOW in Tel Aviv when our market opens expect to see PR Monday",
        "created_utc": 1593142164,
        "id": "fw0ygx7",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593170964.0
    },
    {
        "author": "lukesteph10",
        "body": "I agree, the guessing is what makes this fun. I just believe with how much Tel Aviv market price has been booming they want to double down this time",
        "created_utc": 1593142586,
        "id": "fw0z4l5",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593171386.0
    },
    {
        "author": "Chadmorris32",
        "body": "Tel Aviv is 9 hours ahead, so it could have dropped early in the morning over there.",
        "created_utc": 1592959438,
        "id": "fvswrf1",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1592988238.0
    },
    {
        "author": "__International__",
        "body": "Anyone can make a screenshot of EXIF data. IDEX is a pure scam. You know why? Because IDEX has done this shit before. Remember they were a social video platform called grapevine before? Nope. They shed their current model and went into a new model, hyped up and gotten stock higher, and then suddenly they are another kind of company. \n\nI cut my loss with this shit. Now if it goes down to 75cents, I'll pick up a few shares. But otherwise no thanks. \n\n&amp;#x200B;\n\n$KTOV is where's it's at. Tomorrow KTOV will be $1.40 if not more. Why? Because take a look at KTOV in Tel Aviv Stock Exchange. They are open today (Sunday). It went up up up and away. KTOV in US exchange will do the same tomorrow.",
        "created_utc": 1593372032,
        "id": "fwak9mw",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593400832.0
    },
    {
        "author": "CharredScallions",
        "body": "It is now after 3 pm in Tel Aviv... fuuuck",
        "created_utc": 1593519201,
        "id": "fwgumnx",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593548001.0
    },
    {
        "author": "rwoooshed",
        "body": "[Look what KTOV did on TASE (Tel Aviv Stock Exchange) today](https://www.tase.co.il/en/market_data/security/765016/major_data), and yes they're open on Sunday.",
        "created_utc": 1593395966,
        "id": "fwbrdms",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593424766.0
    },
    {
        "author": "OverLeveraged14",
        "body": "\"Lol cause I owe people cash and this is my last 100\" use it to buy some weed so you have some sort of offering when you tel people you owe money to you cant pay them cause you gambled it at the casino.",
        "created_utc": 1593425384,
        "id": "fwcr4y9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593454184.0
    },
    {
        "author": "oshbear",
        "body": "Tel me this isn’t real\n\nhttps://twitter.com/mrmccall7/status/1271489405962932225?s=21",
        "created_utc": 1592073051,
        "id": "fuq3vbj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592101851.0
    },
    {
        "author": "-WOWZ-",
        "body": "lol you are a shitbag, the perfect man to tel new ppl how retarded they are,. Keep it up",
        "created_utc": 1592236449,
        "id": "fuwujk2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592265249.0
    },
    {
        "author": "PoloandLew",
        "body": "I fee like a lot of people under value it. It’s not regarded as a safe bet as most of the other companies. I can’t tel you how many investors I’ve spoke too that have tried to tell me the stock price of Tesla won’t stay anywhere near where it’s at which is a false pretense due to their actual price target",
        "created_utc": 1592150012,
        "id": "fut5kv6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592178812.0
    },
    {
        "author": "steatorrhoea",
        "body": "Someone tel if if RTX is actually 70+ AH",
        "created_utc": 1591936022,
        "id": "ftrtfpf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591964822.0
    },
    {
        "author": "penguin_apocalypse",
        "body": "that's my understanding, yeah. it has the same ticker on the TASE, but they are two separate things.\n\nagain, that's my understanding of what the document actually says. there's an article from Feb where they announced delisting from TASE and if those shareholders wanted to convert to the US, they had to deposit those funds into the US deposit account through their broker.\n\nhttps://www.globenewswire.com/news-release/2020/02/20/1987803/0/en/Dual-Listed-Nano-Dimension-to-Voluntarily-Delist-from-Tel-Aviv-Stock-Exchange.html",
        "created_utc": 1592342642,
        "id": "fv21z5r",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592371442.0
    },
    {
        "author": "swagmaster600_gang",
        "body": "Can someone tel me why my TD balance is always off",
        "created_utc": 1593440093,
        "id": "fwda84n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593468893.0
    },
    {
        "author": "trapstar92",
        "body": "You guys do understand Tel Aviv market just copied our PH right? We set the market.",
        "created_utc": 1593521329,
        "id": "fwgxlfi",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593550129.0
    },
    {
        "author": "VValrus54",
        "body": "Intel will be fine. What most people here don’t understand is that Intel R&amp;D can dick slap everyone all day. I tel had some executive bloat but that will work itself out.",
        "created_utc": 1592938627,
        "id": "fvrsccf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592967427.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "You haven’t been recently then. The weed in Israel is top notch. You can get some great medical strains prerolled, and there’s so much weed grown in the West Bank (weed from the Gush is 👍) it’s not even funny. \n\nAlmost everyone uses Telegram to have weed delivered to your front door in Tel Aviv. Was at a religious wedding in 2017 outside Tel Aviv, and a bunch of young people were standing there smoking weed 20 feet from a bunch of national border and municipality police (who were also at the wedding) smoking cigarettes.\n\nThe only downside to weed in Israel is that it’s all primarily flower, there’s very little in the way of extracts or edibles unless you’re doing it yourself. But that should hopefully change if the bill passes all 3 readings in the Knesset.",
        "created_utc": 1592931687,
        "id": "fvrdxgm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592960487.0
    },
    {
        "author": "bearishbully",
        "body": "It’s trading around 435 ILA ≈ $1.27 in the Tel Aviv market. It opened today at 399 ILA ≈ $1.16. And it’s already passed it average volume of 500k today would climb higher without news and should go even further when news get released hopefully Monday or Tuesday! 🚀🚀🚀",
        "created_utc": 1593335305,
        "id": "fw91n41",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593364105.0
    },
    {
        "author": "HueCue",
        "body": "KTOV is up 13% in the Tel Aviv Stock Exchange",
        "created_utc": 1593331335,
        "id": "fw8xqho",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593360135.0
    },
    {
        "author": "konafa12",
        "body": "Tel aviv market opens today see how ktov preform should give indication for monday",
        "created_utc": 1593327424,
        "id": "fw8ton4",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593356224.0
    },
    {
        "author": "Snow_Angles",
        "body": "Wrong! On Friday $KTOV went down -7.94% here in US, Today in Tel Aviv $KTOV.TA went up 13.78%",
        "created_utc": 1593374019,
        "id": "fwanxc1",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593402819.0
    },
    {
        "author": "Jmang322",
        "body": "Tel Aviv to pickup some friends, Shalom!",
        "created_utc": 1593185225,
        "id": "fw2jw3i",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593214025.0
    },
    {
        "author": "KingSolomun",
        "body": "I worked as an intern at one of these places in Tel Aviv. It worked as a subscription model. Say you paid $20 a month and they will send you the top and bottom stocks/ETFs for any sector for different time periods.\n\nMy job was to publish \"quick wins\" in their website. Boss would tell me \"Hey, we predicted 10/10 stocks accurately in this month for the small-cap sector, please post a summary.\"\n\nHowever they never showed me the predictive algorithm nor an inaccurate prediction. I believe they fail more than they'd like. \n\nAlso, it always got me thinking that if you have the holy grail why would you share/sell it?",
        "created_utc": 1593181386,
        "id": "fw2cgzk",
        "score": 1,
        "subreddit": "investing",
        "created": 1593210186.0
    },
    {
        "author": "JpowYellen3some",
        "body": "In one breath you say that was your point but then mention Don Lemon and Tucker Carlson like they have any say in the direction of the Empire. They’re actors and but players up to and including POTUS. I’m talking about the people who own and control the BIS, the CBs, old families who still own some of the most iconic industrial brands. I’m talking about the In-Q-Tel handlers who give GOOG, FB etc their marching orders. Those owners and power brokers don’t concern themselves with the masses. They make their plans and implement them over decades. These are the same people who write our history books that you’re basing your knowledge on. I’m basing it off their actions. \n\nYou mention debasement of currency? We are no longer on the gold standard in a scarcity society so no need for gold coins. The current currency model and the coming digital model are already being planned by the same owners. The COVID lockdown showed us how much food and stuff we actually have by the amount that was thrown away and hoarded.",
        "created_utc": 1593220985,
        "id": "fw4hazb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593249785.0
    },
    {
        "author": "FearlessDisk",
        "body": "Rule number 1: Neve tel anyone what you buy/sell.. Because people are negative beings, they will drag you down.",
        "created_utc": 1592715379,
        "id": "fviehv4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592744179.0
    },
    {
        "author": "shagagav",
        "body": "Fuck should I bail on shop overnight can’t tel recovered my tendies but",
        "created_utc": 1591117620,
        "id": "fsniumn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591146420.0
    },
    {
        "author": "origami_asshole",
        "body": "DONT ASK DONT TEL STFU ABOUT THE BOND BUYING",
        "created_utc": 1592318992,
        "id": "fv0lbsk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592347792.0
    },
    {
        "author": "little87",
        "body": "Don’t tell me Elizabeth Warren is in charge of our tendies for however long she’s talking, please tel me warren buffet is making a cameo visit",
        "created_utc": 1592321239,
        "id": "fv0psvi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592350039.0
    },
    {
        "author": "CryptoMstrmnd",
        "body": "Don’t tel me that bro.",
        "created_utc": 1592439627,
        "id": "fv6k8i0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592468427.0
    },
    {
        "author": "TheItalipino",
        "body": "tel me about it",
        "created_utc": 1592415820,
        "id": "fv56k5z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592444620.0
    },
    {
        "author": "BisTrisDeltsTraps",
        "body": "I can tel you that there was unusual dark pool activity on PFE Thursday. Last time that happened was on June 1  and 2",
        "created_utc": 1592674107,
        "id": "fvgh81w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592702907.0
    },
    {
        "author": "carmel4296",
        "body": "The issue with the BYFC on Friday is that he left some of his new followers who are inexperienced as bagholders. If he was going to hype it up for the brain dead the least he could do is explicitly tel everyone when he exited and to secure profits or cut losses etc. \n\nP.s this is not for me but feeling bad for his bag holders who followed him",
        "created_utc": 1592790130,
        "id": "fvlfdbo",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1592818930.0
    },
    {
        "author": "ienjoycorgis",
        "body": "Looks like there is actually osrsflipping. Just tel them to change their name",
        "created_utc": 1593306828,
        "id": "fw817ue",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593335628.0
    },
    {
        "author": "OzManCumeth",
        "body": "Homie Tel Aviv is reacting to the US Market from Friday....",
        "created_utc": 1593372376,
        "id": "fwakwdg",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593401176.0
    },
    {
        "author": "OzManCumeth",
        "body": "Sure. But you said look at Tel Aviv, they’re reacting to us, they’re not a catalyst for our Monday.",
        "created_utc": 1593374920,
        "id": "fwapkul",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593403720.0
    },
    {
        "author": "DietCherrySoda",
        "body": "I am guessing you're kinda new around here, so I won't insult you too badly, but the TASE (that's Tel Aviv Stock Exchange) isn't open on Fridays. The last time they were open was before opening bell in New York on Thursday. So you have to account for Thursday and Friday's activity when looking at TASE on Sunday.",
        "created_utc": 1593376398,
        "id": "fwasifw",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593405198.0
    },
    {
        "author": "achuchable",
        "body": "It's down 10% on the Tel Aviv exchange right now. Looking pretty grim.",
        "created_utc": 1593521044,
        "id": "fwgx69z",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593549844.0
    },
    {
        "author": "achuchable",
        "body": "Tel Aviv down 15% now.",
        "created_utc": 1593524164,
        "id": "fwh23wz",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593552964.0
    },
    {
        "author": "yourfanboynick",
        "body": "When does the drop happen. Someone tel me",
        "created_utc": 1592411430,
        "id": "fv4xh7w",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1592440230.0
    },
    {
        "author": "cheesetouch2",
        "body": "MSFT 190C 6/19 \nDon’t say I didn’t tel you",
        "created_utc": 1591992302,
        "id": "fumtr93",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1592021102.0
    }
]