[
    {
        "author": "zincinzincout",
        "body": "I'd say you guys should look into real estate... but Wallstreetbets would buy a house, try to flip it by restoring everything themselves, but then just knock down all the walls and sell all the copper pipes at minimum copper market",
        "created_utc": 1578278763,
        "id": "fdcmqwg",
        "permalink": "/r/wallstreetbets/comments/ekmvg0/all_of_you_in_the_next_few_months/fdcmqwg/",
        "score": 1413,
        "subreddit": "wallstreetbets",
        "created": 1578307563.0
    },
    {
        "author": "whitethunder9",
        "body": "A really easy way to cheat is look at Berkshire Hathaway's quarterly SEC filings and watch those companies. When their price drops by 15%, buy. When it drops 15% more, buy more. Rinse, repeat. Then hold for a long time.",
        "created_utc": 1578245230,
        "id": "fdaesmx",
        "permalink": "/r/investing/comments/ekf5a5/during_the_2008_recession_some_people_managed_to/fdaesmx/",
        "score": 1389,
        "subreddit": "investing",
        "created": 1578274030.0
    },
    {
        "author": "sdavid1726",
        "body": "Sorry guys, I'm going to be the party pooper here. There are a lot of things wrong with this post. OP didn't actually make any arguments. They just posted a spreadsheet and stated some facts about the numbers with zero analysis, then slapped a clickbait title  on top. Did everyone who upvoted this just smile and nod and say \"Yeah, I recognize some of those words...\"?\n\nFirst off, you have a lot of errors in your spreadsheet, both in data entry (e.g. a lot of the D column) and in your calculations. Why is \"Total Capital Employed\" = \"Net Long Term Debt\" + \"Book Value\"??? A lot of your other formulae have similar errors. Even if the data was correct, Point I still wouldn't make sense or mean anything. How can a company have \"no capital in their business\"? Do you know what capital *is*? You're telling me that Amazon didn't have any capital until 2012? A company can't exist without capital in the same way lemonade can't exist without lemons. Did you mean negative working capital? In that case you'd still be wrong, as Amazon's current assets have exceeded its current liabilities since at least 2004.\n\nPoint II is flat out wrong. Cash flow numbers aren't a valid measure for company growth. Comparing CapEx to D&amp;A in the manner you described would lead you to conclude that Amazon has been \"shrinking\" for the past four years: https://www.macrotrends.net/stocks/charts/AMZN/amazon/cash-flow-statement?freq=A\n\nTake a look at the balance sheet. Amazon has experienced monotonic growth as far as those tables go back.\n\nPoint III isn't really proving anything either. You're basically saying \"Amazon made money\". Sure, 7 years after it IPO'd. Lots of other companies made money year after year from 2004 onward, what made Amazon so special?\n\nI'm really disappointed that this post hit the top of /r/investing. It's word salad that's trying to draw some sort of revelatory, hyperbolic conclusion. OP is far from an expert here. I recommend everybody here look at a company balance sheet + income statement (Form 10-K) and actually learn what all of the words and numbers mean. Here's a good place to start: https://corporatefinanceinstitute.com/resources/knowledge/accounting/financial-statements-example-amazon-case-study/",
        "created_utc": 1578212711,
        "id": "fd811yo",
        "permalink": "/r/investing/comments/ek84pk/i_got_bored_and_went_through_amazons_financial/fd811yo/",
        "score": 746,
        "subreddit": "investing",
        "created": 1578241511.0
    },
    {
        "author": "theonlyevanever",
        "body": "I'm from detroit, I'll just take the copper from your house an sell it.",
        "created_utc": 1578280006,
        "id": "fdcogix",
        "permalink": "/r/wallstreetbets/comments/ekmvg0/all_of_you_in_the_next_few_months/fdcogix/",
        "score": 706,
        "subreddit": "wallstreetbets",
        "created": 1578308806.0
    },
    {
        "author": "kashmat",
        "body": "Wow, actual advise from r/investing that isn't 'put it all in an index fund'.\n\nThank you good sir.",
        "created_utc": 1578250553,
        "id": "fdav0t1",
        "permalink": "/r/investing/comments/ekf5a5/during_the_2008_recession_some_people_managed_to/fdav0t1/",
        "score": 699,
        "subreddit": "investing",
        "created": 1578279353.0
    },
    {
        "author": "NotToRedditty",
        "body": "It also taught us that we can build bridges to the sky without any supports. It'll be the shortest war ever, we can just build a sky bridge over the enemy encampment and blow it up.",
        "created_utc": 1578023021,
        "id": "fcwdoox",
        "permalink": "/r/wallstreetbets/comments/ej9lvk/world_war_3_has_started/fcwdoox/",
        "score": 513,
        "subreddit": "wallstreetbets",
        "created": 1578051821.0
    },
    {
        "author": "ForemanDomai",
        "body": "Physical gold bullion is one of the few financial assets without any counter-party risk. I prefer gold ETFs for my Golden Butterfly/Permanent Portfolios, but I keep a small amount of physical metals which are much more difficult for the state or financial system to contest, it can be used as a hedge to frustrate the court's effort to reduce your wealth. Depending on your threat profile, holding physical gold in overseas storage is also useful (but introduces that counter-party risk).\n\nPeople think in extremes - either the system of currency, private property, functioning legal structures that ensure liquidity and proper market access are fully functional, or we are down to guns and canned food. They can't imagine the huge gray area of misery in a failed state where, although you're not living like in Fallout, you still hope you have something other than fiat.",
        "created_utc": 1578320511,
        "id": "fddpkre",
        "permalink": "/r/investing/comments/ekukby/what_is_the_benifit_of_buying_physical_gold/fddpkre/",
        "score": 513,
        "subreddit": "investing",
        "created": 1578349311.0
    },
    {
        "author": "j909m",
        "body": "If we capture the flag and bring it back to our base, we win right?",
        "created_utc": 1578230824,
        "id": "fd9as8o",
        "permalink": "/r/wallstreetbets/comments/ekcofs/iran_hoists_red_flag_symbolizing_they_are_ready/fd9as8o/",
        "score": 435,
        "subreddit": "wallstreetbets",
        "created": 1578259624.0
    },
    {
        "author": "capnwally14",
        "body": "In super simple terms:   \nA short sell means borrowing a stock in order to sell it - promising the original owner you'll pay them back the original stock at a future date. Imagine Joey thinks Company A's stock is too high at $100. If he wants to short sell the Company A's stock, he could go to a broker and borrow someone else's share (in this case he could borrow Jimmy's stock) and sell it at $100 - promising to give Jimmy back his share in the future. If Joey is right, and the stock drops to $80, then he can buy back Company A's share at $80 (and give it to Jimmy) and keep $20 for himself. If on the other hand Company A's share goes up to $120, Joey is out of luck and will have to pay $120 to give back the share to Jimmy - thereby losing $20. You can see why short selling is dangerous - in this situation, Jimmy at most could have gained $100 (if Company A's price had collapsed to zero), but at most could have lost an infinite amount of money.   \n\n\nSo what do you do if you want to bet against a company, but don't want to short sell? You might instead consider a put option. A put option is buying the right to sell a company's stock (for a premium) at a specific price (known as the strike) on a specific date\\*. So instead of short selling, maybe Joey will buy a put option that says for $1 he can buy the right to sell Company's stock for $100 in one year. If in a year the price of the stock is above $100, then the option will expire worthless - as anyone would rather sell at a higher price than at $100. If the price is below $100 in a year, then Joey will be able to exercise his option and take his earnings. Unlike selling short, now Joey is at most only losing the premium of the option, and at best earning $100.   \n\n\nA call option is the opposite of a put option. A call option is buying the right to buy a stock at a given price on a future date. For $1 Joey might be able to buy the right to buy a shares of Company A for $100 in 1 year. If the shares are above $100 in a year, he'll make money, if they're below his options will expire worthless.   \n\n\nOptions are slightly tricky in that their value is not just comprised of the difference between share price and the exercise price, but also volatility and time value. You can read more about Black Scholes which is how options are priced elsewhere. You can also read about strategies about combining patterns of options to construct more sophisticated trades (like iron condors).\n\n  \n\\* Note - European and American options are different here.",
        "created_utc": 1578115527,
        "id": "fd0990s",
        "permalink": "/r/investing/comments/ejrczd/is_there_any_good_eli5_resources_on_puts_shorts/fd0990s/",
        "score": 354,
        "subreddit": "investing",
        "created": 1578144327.0
    },
    {
        "author": "vishtratwork",
        "body": "Best time is years ago. Second best is now. Third best is the future. \n\nYou do not, nor does anyone else, know when the next recession will come. May be 10 years off. The recession talk has existed since the last recession, it is nothing new, and they don't know better than you.",
        "created_utc": 1578316670,
        "id": "fddlcty",
        "permalink": "/r/StockMarket/comments/ektuix/is_now_a_good_time_to_invest_in_vanguard_index/fddlcty/",
        "score": 352,
        "subreddit": "StockMarket",
        "created": 1578345470.0
    },
    {
        "author": "User_O7",
        "body": "ye but you run across opium and weed drops here and there so it balances out",
        "created_utc": 1578025970,
        "id": "fcwhs9m",
        "permalink": "/r/wallstreetbets/comments/ej9lvk/world_war_3_has_started/fcwhs9m/",
        "score": 334,
        "subreddit": "wallstreetbets",
        "created": 1578054770.0
    },
    {
        "author": "CanYouPleaseChill",
        "body": "\"If I had to choose a great single fallacy of investing, it's believing that when a stock's price goes up, then you've made a good investment. People often take comfort when their recent purchase of something at $5 a share goes up to $6, as if that proves the wisdom of the purchase. Nothing could be further from the truth.\"\n\n- Peter Lynch\n\n\n\"Investors are right (and wrong) all the time for the ‘wrong reason’… the correctness of a decision can’t be judged from the outcome. Nevertheless, that’s how people assess it. A good decision is one that’s optimal at the time that it’s made, when the future is by definition unknown. Thus, correct decisions are often unsuccessful, and vice versa.\" \n\n- Howard Marks",
        "created_utc": 1578106831,
        "id": "fczqhbl",
        "permalink": "/r/stocks/comments/ejnodf/uber_is_up_almost_12_since_cramer_said_it_was_a/fczqhbl/",
        "score": 315,
        "subreddit": "stocks",
        "created": 1578135631.0
    },
    {
        "author": "brutalpancake",
        "body": "You have a knack for finding things I think we’ve all noticed before but never really put into a sentence (BRK.A = burka). You’ve got a bright future in...whatever the hell it is you’re gonna do with a resume full of these gifs",
        "created_utc": 1578320779,
        "id": "fddpw8h",
        "permalink": "/r/wallstreetbets/comments/eku3kd/buffetts_plan_for_ww3/fddpw8h/",
        "score": 308,
        "subreddit": "wallstreetbets",
        "created": 1578349579.0
    },
    {
        "author": "TotesHittingOnY0u",
        "body": "I mean putting it in an index fund would have netted you the exact same or larger returns than doing this, so idk why that's bad advice either.",
        "created_utc": 1578258544,
        "id": "fdblm1o",
        "permalink": "/r/investing/comments/ekf5a5/during_the_2008_recession_some_people_managed_to/fdblm1o/",
        "score": 287,
        "subreddit": "investing",
        "created": 1578287344.0
    },
    {
        "author": "FuckYouSantaAnna",
        "body": "Can you take the copper from your water and sell it to me?",
        "created_utc": 1578283663,
        "id": "fdct8ul",
        "permalink": "/r/wallstreetbets/comments/ekmvg0/all_of_you_in_the_next_few_months/fdct8ul/",
        "score": 280,
        "subreddit": "wallstreetbets",
        "created": 1578312463.0
    },
    {
        "author": "not_REAL_Kanye_West",
        "body": "If Netflix jumps up to 20 a month you might as well start calling me black beard. It's only a matter of time before someone just puts all streaming services together and you just pay a ridiculous amount a month for everything. They can call it cable.",
        "created_utc": 1578411524,
        "id": "fdgyncw",
        "permalink": "/r/stocks/comments/elc859/streaming_wars_will_force_media_companies_to/fdgyncw/",
        "score": 272,
        "subreddit": "stocks",
        "created": 1578440324.0
    },
    {
        "author": "seymorebuttcoin",
        "body": "So he shit it out and stuck it in his ear? Guess Apple fans are retarded. Sure calls.",
        "created_utc": 1578281625,
        "id": "fdcqnjm",
        "permalink": "/r/wallstreetbets/comments/eko3x2/a_man_says_he_accidentally_swallowed_his_airpod/fdcqnjm/",
        "score": 267,
        "subreddit": "wallstreetbets",
        "created": 1578310425.0
    },
    {
        "author": "throwawaylife58924",
        "body": "it killed itself",
        "created_utc": 1578026145,
        "id": "fcwi0gt",
        "permalink": "/r/wallstreetbets/comments/ej9lvk/world_war_3_has_started/fcwi0gt/",
        "score": 256,
        "subreddit": "wallstreetbets",
        "created": 1578054945.0
    },
    {
        "author": "apfejes",
        "body": "I enjoy reading other people's due diligence, but the company is worth $1.8B, and has only phase 2 results completed. I started writing out a rebuttal, and then realized there was already one written for me.\n\n[https://www.fool.com/investing/2019/11/21/why-investors-should-resist-buying-karuna-therapeu.aspx](https://www.fool.com/investing/2019/11/21/why-investors-should-resist-buying-karuna-therapeu.aspx)\n\nIn summary: \n\n* your timeline is wrong: Drug probably won't get to the market till 2023\n* Their financials aren't bad, but P3 trials are much more expensive than P2, so expect their burn rate to rise accordingly... maybe $20-25M a quarter?  It's pretty tight to get them to commercialization.  I'd give it a fairly strong probability that they'll raise again before commercialization, post P3.\n* A lot of drugs clear P2 trials, but fail to get through P3: This drug is not sufficiently de-risked to warrant the current valuation.  \n* Small molecules and schizophrenia is an EXTREMELY challenging combination.  Many many people have tried, and very very few have succeeded.  \n* Even wikipedia suggests that Xanomeline has a high rate of negative symptoms and side effects, which suggests that even if it gets to the end, it will be a challenge getting it through PDUFA, and the known high drop-out rate in clinical trials will be a significant challenge for a P3.\n\nI'm not an MD, but I do have a PhD.  This is way too bullish for me, even with a small amount of DD I did in the last 20 minutes.",
        "created_utc": 1578414960,
        "id": "fdh440f",
        "permalink": "/r/investing/comments/elclxc/im_a_physician_and_im_long_krtx_dd_inside/fdh440f/",
        "score": 251,
        "subreddit": "investing",
        "created": 1578443760.0
    },
    {
        "author": "fallouthong",
        "body": "Yes because I won’t have internet anymore if it doesn’t\n\nEdit: ty for silver. Gold would have been better.",
        "created_utc": 1578353497,
        "id": "fdf52yb",
        "permalink": "/r/wallstreetbets/comments/el23jp/guys_amd_will_pass_50_by_friday_mark_my_word/fdf52yb/",
        "score": 248,
        "subreddit": "wallstreetbets",
        "created": 1578382297.0
    },
    {
        "author": "GeoDudeBroMan",
        "body": "You love it 😏",
        "created_utc": 1578059806,
        "id": "fcxd97z",
        "permalink": "/r/wallstreetbets/comments/ejeviv/saudis_on_that_iran_news_and_oil_spike/fcxd97z/",
        "score": 210,
        "subreddit": "wallstreetbets",
        "created": 1578088606.0
    },
    {
        "author": "TheMintyHipo",
        "body": "It really was this easy. I had just started investing right after the recession and made a bunch of money despite having no idea what I was doing.",
        "created_utc": 1578245473,
        "id": "fdafe0f",
        "permalink": "/r/investing/comments/ekf5a5/during_the_2008_recession_some_people_managed_to/fdafe0f/",
        "score": 206,
        "subreddit": "investing",
        "created": 1578274273.0
    },
    {
        "author": "dave_312",
        "body": "A grownup needs to make the call to scrap this airplane and move on. The flying public is not going to want to fly in it, and airlines have other options. Pilots are not going to want to fly it. It's tainted and done. Move on.",
        "created_utc": 1578315325,
        "id": "fddk1oy",
        "permalink": "/r/stocks/comments/ektdc4/boeing_has_uncovered_another_potential_design/fddk1oy/",
        "score": 197,
        "subreddit": "stocks",
        "created": 1578344125.0
    },
    {
        "author": "imagine_thinking",
        "body": "bro i always kinda knew but never truly grasped how war is basically this meme. Rule #1: If youre old enough you dont have to be in any real danger. I get grandpa and his walker cant be on the frontline. But its just weird. A bunch of older men deciding how theyll just throw essentially teenage lives at the enemy. \"This attack will cost us 18 pawns but well worth it\"",
        "created_utc": 1578417718,
        "id": "fdh8ka2",
        "permalink": "/r/wallstreetbets/comments/eld4i6/all_in_the_war_machine/fdh8ka2/",
        "score": 196,
        "subreddit": "wallstreetbets",
        "created": 1578446518.0
    },
    {
        "author": "TheWizardOfFrobozz",
        "body": "In the example you gave, there are two taxable events, both of which should be reported to the IRS:\n\n1) Receiving the free stock. This counts are ordinary income for the market value of the stock on the day you receive it.\n2) Selling the stock for a profit. This counts as a short-term or long-term capital gain (depending on how long you held it) of the amount its price increased by.\n\nFor example, suppose you received a free share of AAPL on July 30, 2019. AAPL closed at $213.04 that day, so you would report $213.04 as income. Now suppose you sold it on December 31, 2019 for $291.52. Your short-term capital gain is $291.52 - $213.04 = $78.48. Whether either of these events increases the taxes you have to pay depends on your other income, your filing status, other gains/losses, etc.\n\nI'm thinking of writing a tax primer for Robinhood users and posting it here sometime during the next few days since there seem to be so many questions.",
        "created_utc": 1578261783,
        "id": "fdbtgbm",
        "permalink": "/r/RobinHood/comments/ekjmcd/how_does_paying_taxes_work_for_the_free_stocks/fdbtgbm/",
        "score": 187,
        "subreddit": "RobinHood",
        "created": 1578290583.0
    },
    {
        "author": "Obsido",
        "body": "Of course, tech will keep on growing, might even grow faster in the 2020s than it did in the 2010s and they are in the middle of it. Not to mention they have so much cash at hand that they can just buy companies to expand into the market even more and they can buff up their research and development apartment by billions if they need to in order to stay on-top this decade.\n\nApple is guaranteed in the top 5.",
        "created_utc": 1578248420,
        "id": "fdaogoz",
        "permalink": "/r/stocks/comments/ekfs0c/apple_still_top_5_of_the_new_decade/fdaogoz/",
        "score": 177,
        "subreddit": "stocks",
        "created": 1578277220.0
    },
    {
        "author": "FlingingOptions",
        "body": "As the buyer of a call, you’re buying the right to purchase those shares from somebody else at the strike price. If it crashed to $0, you’re not going to exercise your right to buy them at $325, so your contract would expire worthless. You’re only out the $33 you paid for it. \n\nTemper your expectations of what “unlimited” means here, though. Unlimited is technically true as there is no limit to how high a stock can go, but unless there is some major binary event that makes it skyrocket to BRK.A levels in two days, your potential profits will be much less impressive. \n\nWith low volatility (IV is currently the lowest it’s been in the past 52 weeks), making it to your breakeven is a long shot with only two full trading days left. Even if it gets to 327 (roughly double the expected move) by the time your contract ends, you’re looking at a ballpark profit of $167. Nothing to sneeze at, for sure, but the chances are low.",
        "created_utc": 1577988850,
        "id": "fcuumh0",
        "permalink": "/r/RobinHood/comments/ej0nex/question_is_the_max_loss_only_33_or_am_i_missing/fcuumh0/",
        "score": 171,
        "subreddit": "RobinHood",
        "created": 1578017650.0
    },
    {
        "author": "chiefo69",
        "body": "Abandoned my strategy and starting playing SPY and SHOP weeklies. All down hill from there. It was a lot of fun if we’re being honest. My last play of the year was eating a delicious McChicken tendy😎",
        "created_utc": 1577989463,
        "id": "fcuvmnh",
        "permalink": "/r/wallstreetbets/comments/ej125m/happy_new_years_degenerates/fcuvmnh/",
        "score": 170,
        "subreddit": "wallstreetbets",
        "created": 1578018263.0
    },
    {
        "author": "tt598",
        "body": "&gt;Instead of starting from scratch with a new airframe, Boeing took what was conceived in the 1960s as a regional jet, and has pushed and pushed and pushed it — bigger and bigger engines, fancier avionics, MCAS — into roles it was never intended for. Five decades and ten variants later, the MAX is a monsterized hybrid of a thing, a plane that wants, and needs to be something that it’s not: all muscle and power and advanced technology, jammed into the framework of a fifty year-old design. Call it a software failure, or call it bad corporate strategy and stubbornness.\n\n[https://www.askthepilot.com/ethiopian-737max-crash/](https://www.askthepilot.com/ethiopian-737max-crash/)",
        "created_utc": 1578317705,
        "id": "fddmf0j",
        "permalink": "/r/stocks/comments/ektdc4/boeing_has_uncovered_another_potential_design/fddmf0j/",
        "score": 168,
        "subreddit": "stocks",
        "created": 1578346505.0
    },
    {
        "author": "Bufarete",
        "body": "I posted this EXACTLY 52 minutes ago and Mods removed it. I hate you.",
        "created_utc": 1578404991,
        "id": "fdgpnj5",
        "permalink": "/r/wallstreetbets/comments/elb885/tsla_to_4206969/fdgpnj5/",
        "score": 165,
        "subreddit": "wallstreetbets",
        "created": 1578433791.0
    },
    {
        "author": "80slaserbackground",
        "body": "It worked for Scientology.",
        "created_utc": 1579477949,
        "id": "ff1dxt4",
        "permalink": "/r/wallstreetbets/comments/er4hha/creating_church_to_avoid_taxes/ff1dxt4/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1579506749.0
    },
    {
        "author": "jeff_the_old_banana",
        "body": "You idiot, it doesn't matter how the markets react, as a fund manager you make money anyway. Your clients don't make money but that is their problem for trusting a fund manager.",
        "created_utc": 1577994019,
        "id": "fcv3qcf",
        "permalink": "/r/wallstreetbets/comments/ej2zxl/you_guys_scare_me/fcv3qcf/",
        "score": 159,
        "subreddit": "wallstreetbets",
        "created": 1578022819.0
    },
    {
        "author": "stormwillpass",
        "body": "It's something like wake up, eat, poop, shower, gym before open, snack before open, trade til close if necessary or call it an early day, eat, shower, sleep, repeat. Boring.\n\n2017, 2018, and 2019 passed by and I don't really remember what happened. All of a sudden it's 2020.\n\nThat's the hardest part to grasp for me. Time just flew. Make sure you remember to live life.",
        "created_utc": 1578393326,
        "id": "fdgeq48",
        "permalink": "/r/wallstreetbets/comments/el9vc9/how_many_of_you_are_legit_full_time_traders/fdgeq48/",
        "score": 157,
        "subreddit": "wallstreetbets",
        "created": 1578422126.0
    },
    {
        "author": "askOPaboutspaghetti",
        "body": "WAR\n\nGUH\n\nWHAT IS IT GOOD FOR",
        "created_utc": 1578237855,
        "id": "fd9thrg",
        "permalink": "/r/wallstreetbets/comments/eke9o5/what_are_the_best_ways_to_profit_from_the/fd9thrg/",
        "score": 155,
        "subreddit": "wallstreetbets",
        "created": 1578266655.0
    },
    {
        "author": "WhiteCastleStan",
        "body": "Tag on two X's to make it SpaceXXX. It's a space exploration/porn company. I'm talking zero gravity porn scenes, titties bouncing in basically slo-mo",
        "created_utc": 1578940551,
        "id": "fe9qfxk",
        "permalink": "/r/wallstreetbets/comments/eo81i8/spacex_needs_to_go_public/fe9qfxk/",
        "score": 153,
        "subreddit": "wallstreetbets",
        "created": 1578969351.0
    },
    {
        "author": "jimmyl89",
        "body": "Socks are usually worn in pairs so it wouldn't make sense to split them",
        "created_utc": 1577996663,
        "id": "fcv86xa",
        "permalink": "/r/investing/comments/ej0pje/why_dont_big_tech_companies_with_1000_stock/fcv86xa/",
        "score": 153,
        "subreddit": "investing",
        "created": 1578025463.0
    },
    {
        "author": "saltslugs",
        "body": "So if you buy stocks that do well, you will do well.  If you buy stocks that lose value, you will do poorly.  Got it.",
        "created_utc": 1578272404,
        "id": "fdcdqjo",
        "permalink": "/r/investing/comments/ekf5a5/during_the_2008_recession_some_people_managed_to/fdcdqjo/",
        "score": 152,
        "subreddit": "investing",
        "created": 1578301204.0
    },
    {
        "author": "JohnBoltonsMoustache",
        "body": "I’m pretty sure that you’re just not allowed to take it home. But what the hell do I know, I’m Space Force so I’ve touched a gun like once in my life.",
        "created_utc": 1578047293,
        "id": "fcx1p67",
        "permalink": "/r/wallstreetbets/comments/ej9lvk/world_war_3_has_started/fcx1p67/",
        "score": 151,
        "subreddit": "wallstreetbets",
        "created": 1578076093.0
    },
    {
        "author": "shin8407",
        "body": "I heard anyone with Call of Duty account will be drafted first. It was pentagon's army draft trainer. Good luck fighting in the real world gamers.",
        "created_utc": 1578026348,
        "id": "fcwi9yf",
        "permalink": "/r/wallstreetbets/comments/ej9lvk/world_war_3_has_started/fcwi9yf/",
        "score": 148,
        "subreddit": "wallstreetbets",
        "created": 1578055148.0
    },
    {
        "author": "apfejes",
        "body": "The best investment ideas are obvious in hindsight.  That should be obvious, itself. \n\nThe problem is that there were probably another 20 companies with similar financial statements that didn’t make it. How would you differentiate them?  \n\nYou’re effecting falling prey to survivorship bias, and then claiming that you’re not. It’s not a compelling argument.",
        "created_utc": 1578205183,
        "id": "fd7iqfk",
        "permalink": "/r/investing/comments/ek84pk/i_got_bored_and_went_through_amazons_financial/fd7iqfk/",
        "score": 148,
        "subreddit": "investing",
        "created": 1578233983.0
    },
    {
        "author": "Jet-Streem",
        "body": "And if you have enough of it, you can swim around in it.",
        "created_utc": 1578324325,
        "id": "fddujmj",
        "permalink": "/r/investing/comments/ekukby/what_is_the_benifit_of_buying_physical_gold/fddujmj/",
        "score": 147,
        "subreddit": "investing",
        "created": 1578353125.0
    },
    {
        "author": "Yottahz",
        "body": "Sorry I am stuck at \"I'm a physician\" coupled with the fact that you are on WSB.\n\nIt is like that \"Just OK is not OK\" commercial",
        "created_utc": 1578411319,
        "id": "fdgyc6p",
        "permalink": "/r/wallstreetbets/comments/elc7mf/im_a_physician_and_im_long_krtx_dd_inside/fdgyc6p/",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1578440119.0
    },
    {
        "author": "Iheartpropertylaw",
        "body": "$1.33 trillion market cap. Remember when everyone was freaking out about the trillion mark? Just obliterated it and nobody seems to care.",
        "created_utc": 1578003485,
        "id": "fcvjlvd",
        "permalink": "/r/wallstreetbets/comments/ej58cp/so_apple_just_hit_300/fcvjlvd/",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1578032285.0
    },
    {
        "author": "bigpapa901",
        "body": "I’m a Model 3, day one reservation holder. Bought the options when I got the car. Felt like when someone first put an iPhone in my hand for the first time in 2007. Knew there was no denying that the product was superior. Just took the rest of the world 2 years to figure it out.",
        "created_utc": 1578428434,
        "id": "fdhqy7r",
        "permalink": "/r/wallstreetbets/comments/elg1pw/when_you_exercise_600_tsla_leap_options_purchased/fdhqy7r/",
        "score": 143,
        "subreddit": "wallstreetbets",
        "created": 1578457234.0
    },
    {
        "author": "Nghtmare-Moon",
        "body": "Papa Musk won’t budge on that. He won’t be able to control 100% of the company if it goes public and his vision of mars will be blurred by investors wanting profit",
        "created_utc": 1578940921,
        "id": "fe9rp7h",
        "permalink": "/r/wallstreetbets/comments/eo81i8/spacex_needs_to_go_public/fe9rp7h/",
        "score": 133,
        "subreddit": "wallstreetbets",
        "created": 1578969721.0
    },
    {
        "author": "Leaf-Currency",
        "body": "All three pixels of it.",
        "created_utc": 1578164915,
        "id": "fd46pek",
        "permalink": "/r/wallstreetbets/comments/ejxclf/apple_started_wwiii_so_that_phones_would_be/fd46pek/",
        "score": 124,
        "subreddit": "wallstreetbets",
        "created": 1578193715.0
    },
    {
        "author": "EnronMcWorldCom",
        "body": "It can also be considered a spit roast.",
        "created_utc": 1578239891,
        "id": "fd9zge1",
        "permalink": "/r/wallstreetbets/comments/ekdys5/being_a_bear_is_not_good_for_mental_health/fd9zge1/",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1578268691.0
    },
    {
        "author": "dawgsjw",
        "body": "It is discrimination that the SEC can continually hold down the poors.  Just b/c you don't have 25k+ in the account means you can't day trade.  How can this be legal?",
        "created_utc": 1578237984,
        "id": "fd9tyyy",
        "permalink": "/r/wallstreetbets/comments/eke6ol/29_m4f_ohio_seeking_who_will_let_me_play_the/fd9tyyy/",
        "score": 122,
        "subreddit": "wallstreetbets",
        "created": 1578266784.0
    },
    {
        "author": "Tr47gRKl5",
        "body": "Then invest to hedge your disappointment and think of it as owning a piece of the arsenal of democracy.",
        "created_utc": 1578426960,
        "id": "fdhogn7",
        "permalink": "/r/wallstreetbets/comments/eld4i6/all_in_the_war_machine/fdhogn7/",
        "score": 122,
        "subreddit": "wallstreetbets",
        "created": 1578455760.0
    },
    {
        "author": "Sislar",
        "body": "I've been through two,  Both happen without warning, If there was a warning people would adjust.\n\nIt helps to understand what causes a recession.  A recession happens when capital is misallocated.  The last one was because of what was happening in real estate, It looked like more money was being made there then in reality (due in no small part because of fraud) so many people when into that industry, agents/construction etc etc.  When it crashed you have a lot of people with the wrong skill set, living in the wrong location. you have equipment built that has no purpose and is under utilized.  \n\n\nThere is a reason a recession takes at least 6 months to get through the worst of it, sometimes its 1-2 years. And that is because it takes time for people to change skills, move to other locations. build new equipment etc.\n\n\nAll that misallocation doesn't happen if people see it coming.",
        "created_utc": 1578494051,
        "id": "fdk1y71",
        "permalink": "/r/stocks/comments/elsn7c/people_who_have_gone_through_recessions_is_the/fdk1y71/",
        "score": 121,
        "subreddit": "stocks",
        "created": 1578522851.0
    },
    {
        "author": "Data_Dealer",
        "body": "Cause fear, people just want to lock in profits now, which means selling off, which means big drops which means people who thought they would weather the storm then get weak hands as they think this could be the next recession or worse a depression so they in turn start to sell even thought they know better and before you know it we have manufactured our own giant economic shit storm out of fear of the next recession/depression.   Well that's how it would go, but we have circuit breakers and other shit in place, so hopefully people will cool their shit after a certain percent drop and people will realize it's really not the end of the world, or the shit storm will continue cause no one has a fucking crystal ball and no one wants to lose money.",
        "created_utc": 1578445095,
        "id": "fdikrgv",
        "permalink": "/r/stocks/comments/elk04c/10_rockets_hit_airbase_in_iraq_where_us_troops/fdikrgv/",
        "score": 120,
        "subreddit": "stocks",
        "created": 1578473895.0
    },
    {
        "author": "__fritzz",
        "body": "genius. we could call it a hedge fund or something",
        "created_utc": 1578867914,
        "id": "fe5d59e",
        "permalink": "/r/wallstreetbets/comments/enujx8/brilliant_idea_that_cant_go_tits_up/fe5d59e/",
        "score": 114,
        "subreddit": "wallstreetbets",
        "created": 1578896714.0
    },
    {
        "author": "Roopa12",
        "body": "It isn’t the first time in history, they do it every year, dumbass.\n\n\nhttps://www.reddit.com/r/syriancivilwar/comments/ejwqqv/red_flag_of_doom_unfurled_over_mosque_in_qom_iran/",
        "created_utc": 1578213730,
        "id": "fd848zb",
        "permalink": "/r/wallstreetbets/comments/ekaabb/for_the_first_time_in_the_history_of_iran_a_red/fd848zb/",
        "score": 110,
        "subreddit": "wallstreetbets",
        "created": 1578242530.0
    },
    {
        "author": "Veliladon",
        "body": "Yep. Bear gang is charmander. Unnecessarily hard but has that one move that's awesome. It can rarely be used effectively but when it can be used, it's awesome. Most people get frustrated at the start and reroll Bull gang once they find out how much easier it is. The most hardened Bear gang members got sick of how easy it was to make money with Bull gang.\n\nTheta gang is Squirtle. Nobody picks it but everyone wishes they did when they see a leveled Blastoise.\n\nBull gang is Bulbasaur. Game is on ezmode until it's not and then they're pretty fucked because they have no idea what to do. They've spent the entire time so far one shotting enemy teams with their starter because it's worked for so long.",
        "created_utc": 1580087430,
        "id": "ffp6gdm",
        "permalink": "/r/wallstreetbets/comments/eug1p4/choose_wisely/ffp6gdm/",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1580116230.0
    },
    {
        "author": "stormwillpass",
        "body": "&gt; \"I need you to tank TSLA, right now!\"\n\n&gt; \"Shit, I need TSLA to plummet!\"\n\nNice work!\n\nLong story short, I'd rather them not tank anymore and need them to moon now since I sold a lot of naked puts. Past two weeks I closed some naked calls that would've ended up profitable. Last week I opened up some puts and the $520 strike ended up losing 3x initial credit.\n\nGetting fucked both ways it seems.",
        "created_utc": 1579478337,
        "id": "ff1eyuq",
        "permalink": "/r/wallstreetbets/comments/er25f9/death_of_ustormwillpass_circa_2020_reupload/ff1eyuq/",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1579507137.0
    },
    {
        "author": "missedthecue",
        "body": "The dude also got scammed by a jeweler. Someone needs to tell him to go all in VTSAX and forget it. \n\nhttps://www.forbes.com/sites/robertanaas/2019/06/25/new-orleans-saints-quarterback-drew-brees-wins-6-1-million-in-jeweler-lawsuit/#1ffa52ee66dc",
        "created_utc": 1578271183,
        "id": "fdcbug6",
        "permalink": "/r/investing/comments/ekktt2/advocare_endorsed_by_nfl_quarterback_drew_brees/fdcbug6/",
        "score": 102,
        "subreddit": "investing",
        "created": 1578299983.0
    },
    {
        "author": "Logan_Maransy",
        "body": "I'll help you out in a non ironic way, because options are actually really simple but can seem confusing if you are looking at this screenshot with ignorance. \n\nOP bought 30 call contracts (+30) for $77K (equity in screen shot of $87K - the gain of $10K experienced since he bought at $77K), at an average cost of $25.78 per share (1 contract = 100 shares, so 30 contracts = 3000 shares, so the $77K checks out.)\n\nThe \"Breakeven Price\" is listed at $1905.78. If we subtract the cost OP spent on each contract, we find the strike price of the calls is $1880. The EXP Date (expiration date) is 1/31, or tomorrow at close. Finally, the current price ($29.23) is the \"current\" price of the contracts. Because option markets are open only during normal trading hours, this cost represents the last price at close and are not updated to reflect after-hours market movement. \n\nIn summary, OP walked up to a roulette table and slapped 77 grand in cash on the \"AMZN stock will be above 1905 by the end of day tomorrow\". Note that is closed at 1870 today. If it's above 1905 by tomorrow, he will gain money overall. And if it's below 1905 he will lose money. If it's below 1880, he will lose ALL 77K.\n\nAMZN absolutely fucking killed earnings, released after hours today. Straight up Trogdor Burninating the peasants type of slaughter. In after hours trading AMZN is now at 2074. OPs call options are now \"in the money\" which means they have intrinsic value, because they allow the owner of the contract (currently OP) to buy 3000 shares of AMZN from someone at a price of $1880, when it's clearly market valued at $2074. What a deal right?! That intrinsic value is the difference between the strike price (1880) and the market price (2074), which is $194. \n\nLet's say OP doesn't have the capital to buy 3000 fucking shares of AMZN ($6 mill+ now) in order to then immediately sell it for a profit. Well, that's fine, because somebody in the market absolutely does, and will buy his contracts off him for at least $194. \n\nThus OP bought 30 contracts, each at a cost of $2,578 ($77K initial cost) and is going to be able to sell them tomorrow for at least $19,400 each ($582K final result). So 582K-77K initial cost = 500K+ profit, as OP stated in title. Another way to look at it is: 194/25.78 = 7.53x multiplier in one night, on a 77K bet.",
        "created_utc": 1580424958,
        "id": "fg1d1h0",
        "permalink": "/r/wallstreetbets/comments/ewcebh/amzn_500k_profit_tomorrow/fg1d1h0/",
        "score": 102,
        "subreddit": "wallstreetbets",
        "created": 1580453758.0
    },
    {
        "author": "ILoveTheAtomicBomb",
        "body": "Give it a shot and post pics after",
        "created_utc": 1577989716,
        "id": "fcuw37v",
        "permalink": "/r/wallstreetbets/comments/ej202d/tsla_430_time_to_short/fcuw37v/",
        "score": 101,
        "subreddit": "wallstreetbets",
        "created": 1578018516.0
    },
    {
        "author": "tunafun",
        "body": "Begged my parents to buy apple for me in the early 90s.  They did.   Then my uncle who worked for HP at the time told them what a bad company it was.  This was back in the powermac and newton era.  Parents sold.  That would have been worth 1.5 million today give or take.  Never again.",
        "created_utc": 1578003558,
        "id": "fcvjq6h",
        "permalink": "/r/wallstreetbets/comments/ej58cp/so_apple_just_hit_300/fcvjq6h/",
        "score": 100,
        "subreddit": "wallstreetbets",
        "created": 1578032358.0
    },
    {
        "author": "veritasinvestments",
        "body": "Iran and the US probably made a deal where Iran had to give up its power in the region in exchange for easing the sanctions. The price? Iran has to give up its Quds leader. In one move, Khamenei has also consolidated his own power by taking out someone who, in the past, has threatened military coups in the event of left-wing movements and relations with the US. By doing this, he has severely reduced Sepah’s power while simultaneously allowing for sanctions to be gradually eased. Most people don’t understand this, but IRGC is getting so powerful that it is actually threatening the very existence of the Iranian government as it is. Soleimani was essentially its key leader, and by giving him up, Khamenei has consolidated his power. This is what most likely has occurred. Otherwise, why did it take so long for the US to kill this guy? He’s been active in Iraq and Syria for the past decade.\n\nAlso, some IRGC hardliners wanted Soleimani to run for president. There’s an internal war between the clerics and the IRGC for power in Iran. While someone like Rouhani or Ahmadinejad could just be puppets for Khamenei, Soleimani would actually not be a puppet president. Given that Rouhani is also in his last term, if Soleimani ran, he could present as a viable candidate. The only way that Khamenei could consolidate power for the clerics was to take him out. Again, if you were in Iran right now or know about how the Iranian government works, this scenario would probably be what you would be thinking right now as well.",
        "created_utc": 1578026775,
        "id": "fcwitom",
        "permalink": "/r/wallstreetbets/comments/ej9lvk/world_war_3_has_started/fcwitom/",
        "score": 99,
        "subreddit": "wallstreetbets",
        "created": 1578055575.0
    },
    {
        "author": "Inferin",
        "body": "99% certain? Free money? Doesnt sound like it can go tits up, /r/wallstreetbets is this way good sir we'll help you out with open arms",
        "created_utc": 1578134816,
        "id": "fd1pl9g",
        "permalink": "/r/options/comments/ejv7e9/sell_p415_sep20_tsla/fd1pl9g/",
        "score": 99,
        "subreddit": "options",
        "created": 1578163616.0
    },
    {
        "author": "ElderScrolls",
        "body": "I hate Apple products but the stock is solid. And it's for the same reason that I hate their products: they have a strong closed ecosystem.  I've had friends switch from Apple to PC/Android and it's a painful experience.\n\nPeople will naturally continue to upgrade and buy in that system, including new products that sync into it.\n\nI'm not sure if it'll be explosive growth. But it's not going anywhere.\n\nNonetheless, I'd rather put money in msft.",
        "created_utc": 1578244837,
        "id": "fdadjm6",
        "permalink": "/r/stocks/comments/ekfs0c/apple_still_top_5_of_the_new_decade/fdadjm6/",
        "score": 99,
        "subreddit": "stocks",
        "created": 1578273637.0
    },
    {
        "author": "Jaie_E",
        "body": "ohhhh this looks like a short squeeze if i've ever seen one. time to meme it out",
        "created_utc": 1578256167,
        "id": "fdbcyv5",
        "permalink": "/r/wallstreetbets/comments/ekij8t/peloton_has_60_short_interest/fdbcyv5/",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1578284967.0
    },
    {
        "author": "mikally",
        "body": "You don't wanna be a drone pilot. You'll just end up killing yourself instead of having someone else do it.",
        "created_utc": 1578080328,
        "id": "fcyhnv3",
        "permalink": "/r/wallstreetbets/comments/ejfv3k/no_fight_for_green_men/fcyhnv3/",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1578109128.0
    },
    {
        "author": "eliper3",
        "body": "This is only true if you randomly buy options that are ITM (or right above it) which r/wallstreetbets doesn't really do lol",
        "created_utc": 1577997406,
        "id": "fcv9fmf",
        "permalink": "/r/wallstreetbets/comments/ej125m/happy_new_years_degenerates/fcv9fmf/",
        "score": 97,
        "subreddit": "wallstreetbets",
        "created": 1578026206.0
    },
    {
        "author": "VRisNOTdead",
        "body": "Maybe in Afghanistan but fuck that place.   We should be invading it with snowboarders and crusty van dwelling hippies not boomer generals with prostate issues.",
        "created_utc": 1578057575,
        "id": "fcxap66",
        "permalink": "/r/wallstreetbets/comments/ej9lvk/world_war_3_has_started/fcxap66/",
        "score": 96,
        "subreddit": "wallstreetbets",
        "created": 1578086375.0
    },
    {
        "author": "Hendrix811",
        "body": "Iran’s economic weapons are work.  They are going to try to tank our markets. They know how important it is to trump.",
        "created_utc": 1578455713,
        "id": "fdj11fd",
        "permalink": "/r/wallstreetbets/comments/eln60y/boeing_737_passenger_plane_crashes_in_iran_state/fdj11fd/",
        "score": 96,
        "subreddit": "wallstreetbets",
        "created": 1578484513.0
    },
    {
        "author": "thewimsey",
        "body": "The real question isn’t why these companies aren’t splitting; it’s why it was common in the past to split stocks.\n\nThe reason for *that* is that it used to be a requirement that you buy shares in “round lots” (i.e., in 100 share increments).  You typically couldn’t buy individual shares, much less fractional shares.  So even a price of $100 would entail a $10,000 commitment. (There were a handful of brokers who would “break lots” for an up charge...but that’s not ideal).\n\nOne of the initial advantages of mutual funds were that they allowed people to get around the “lot” requirement...the ease of diversification is still a mutual fund feature, but it was even more so when you had to buy 100 stocks at a time. \n\nEventually - starting with the rise of discount brokers - this requirement became more and more relaxed, and the need to have stock prices that weren’t astronomical if multiplied by 100 disappeared.",
        "created_utc": 1578000442,
        "id": "fcvejk0",
        "permalink": "/r/investing/comments/ej0pje/why_dont_big_tech_companies_with_1000_stock/fcvejk0/",
        "score": 96,
        "subreddit": "investing",
        "created": 1578029242.0
    },
    {
        "author": "ilcanadiano",
        "body": "I have nothing to do with this conflict. I didn't vote for the guy that started it, didn't sanction the actions of the guy who killed the guy, and I didn't launch the missiles into Iraq at the bases owned by the companies who had the guy who started start it.\n\nI'd never cheer death.\n\nI'd cheer tendies tho.",
        "created_utc": 1578451041,
        "id": "fdiu22l",
        "permalink": "/r/wallstreetbets/comments/elkxe9/remember_that_there_could_be_people_dying_right/fdiu22l/",
        "score": 95,
        "subreddit": "wallstreetbets",
        "created": 1578479841.0
    },
    {
        "author": "ja1484",
        "body": "Not much really. Open a business as an electronics manufacturing supplier.\n\nDoomsday weirdos with poor critical thinking skills think it will be some level of valuable if the currency system collapses, not realizing that if that occurs we'll be back to a barter economy anyway and beans and ammo will matter way more than shiny rocks.\n\nSo I guess in the post apocalyptic wasteland they can all get together and trade rocks to each other\n\nFor serious adults looking to hedge currency risk, there's paper gold, but honestly real estate and bonds are probably better in most cases.",
        "created_utc": 1578319898,
        "id": "fddouxf",
        "permalink": "/r/investing/comments/ekukby/what_is_the_benifit_of_buying_physical_gold/fddouxf/",
        "score": 94,
        "subreddit": "investing",
        "created": 1578348698.0
    },
    {
        "author": "PocketRocketMarket",
        "body": "no. check your robinhood messages. Im sure they would have sent you something there.  Send robinhood an email asking if this is spam, it would be good to let them know anyway.",
        "created_utc": 1578954726,
        "id": "feb21e8",
        "permalink": "/r/RobinHood/comments/eobhn7/anyone_else_get_this_email_is_it_legit/feb21e8/",
        "score": 91,
        "subreddit": "RobinHood",
        "created": 1578983526.0
    },
    {
        "author": "ddhboy",
        "body": "Or, alternatively, you'd cancel your Netflix subscription and only reactivate it when a new show comes along that peaks your interest, then cancel it again after you finish the season. Basically, the same problem HBO's had forever, but in hyper speed because Netflix drops all their episodes at once.",
        "created_utc": 1578413717,
        "id": "fdh23lt",
        "permalink": "/r/stocks/comments/elc859/streaming_wars_will_force_media_companies_to/fdh23lt/",
        "score": 91,
        "subreddit": "stocks",
        "created": 1578442517.0
    },
    {
        "author": "Czarcastic_Fuck",
        "body": "Some defense contractors both sell the weapons systems (planes) and provide support for it after the purchase for a fee/contract. In my example, I worked on a system made by Northrop Grumman (JSTARS) in which the military opted in to a support contract after purchasing the aircraft. Part of the contract includes buying parts from Northrop Grumman, which results in absurdities like a normally $0.07 ethernet cable being sold to the military for $2,000.\n\nDefense contracting always works like this, you find a reasonable cost for an item then multiply the cost by five, minimum.",
        "created_utc": 1578429770,
        "id": "fdhtapi",
        "permalink": "/r/wallstreetbets/comments/eld4i6/all_in_the_war_machine/fdhtapi/",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1578458570.0
    },
    {
        "author": "InfiniteAccuracy",
        "body": "Don't even ask the question. The answer is yes, it's priced in. Think Amazon will beat the next earnings? That's already been priced in. World War III? Priced in. You work at the drive thru for Mickey D's and found out that the burgers are made of human meat? Priced in. You think insiders don't already know that? The market is an all powerful, all encompassing being that knows the very inner workings of your subconscious before you were even born. Your very existence was priced in decades ago when the market was valuing Standard Oil's expected future earnings based on population growth that would lead to your birth, what age you would get a car, how many times you would drive your car every week, how many times you take the bus/train, etc. Anything you can think of has already been priced in, even the things you aren't thinking of. You have no original thoughts. Your consciousness is just an illusion, a product of the omniscent market. Free will is a myth. The market sees all, knows all and will be there from the beginning of time until the end of the universe (the market has already priced in the heat death of the universe). So please, before you make a post on wsb asking whether AAPL has priced in earpods 11 sales or whatever, know that it has already been priced in and don't ask such a dumb fucking question again.",
        "created_utc": 1578196874,
        "id": "fd6xajx",
        "permalink": "/r/wallstreetbets/comments/ek4jo5/spy_puts_for_all_next_week/fd6xajx/",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1578225674.0
    },
    {
        "author": "Goodman-Grey",
        "body": "Just wating for shit to drop. But it keeps going up.  WTF visa",
        "created_utc": 1578125351,
        "id": "fd0y5fd",
        "permalink": "/r/wallstreetbets/comments/ejt54j/so_the_war_cycle_begins/fd0y5fd/",
        "score": 89,
        "subreddit": "wallstreetbets",
        "created": 1578154151.0
    },
    {
        "author": "mikally",
        "body": "No you have it backwards. You can't go to prison for being in debt in America. That's already been decided, twice. \n\nYou need to make so many tendies that you can pay multiple doctors off to say you have bone spurs.\n\nThat's how you America.",
        "created_utc": 1578080155,
        "id": "fcyhco2",
        "permalink": "/r/wallstreetbets/comments/ejfv3k/no_fight_for_green_men/fcyhco2/",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1578108955.0
    },
    {
        "author": "PeterMichaelPaints",
        "body": "Now this is how you do it people - spend someone else's money. I respect this man.",
        "created_utc": 1578443086,
        "id": "fdihl1q",
        "permalink": "/r/wallstreetbets/comments/elk1ih/its_official_were_going_to_war/fdihl1q/",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1578471886.0
    },
    {
        "author": "hugokhf",
        "body": "they probably just slap a new name on it after all the 'redesign'. people will forget about it once it is in the air again with the new name.",
        "created_utc": 1578316842,
        "id": "fddliur",
        "permalink": "/r/stocks/comments/ektdc4/boeing_has_uncovered_another_potential_design/fddliur/",
        "score": 87,
        "subreddit": "stocks",
        "created": 1578345642.0
    },
    {
        "author": "Kroniic",
        "body": "I will follow this trade and I will post my position once the album has been dropped.  If you want to see some true autistic shit, stay tuned\n\nEdit:  I have a feeling this album is going to come out in March.  I will repost with positions but I’m only doing this when it comes out.  Until then auts 🧩",
        "created_utc": 1578281001,
        "id": "fdcpt5n",
        "permalink": "/r/wallstreetbets/comments/ekmd7o/how_to_predict_the_next_market_pullback_its_not/fdcpt5n/",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1578309801.0
    },
    {
        "author": "FreeMeFromMySins",
        "body": "I had loose pussy porn open in another tab and it took me a minute to realize that this wasn't it.",
        "created_utc": 1578346459,
        "id": "fdett9l",
        "permalink": "/r/wallstreetbets/comments/el0da6/credit_spreads_are_literally_free_money/fdett9l/",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1578375259.0
    },
    {
        "author": "6pounds10pence",
        "body": "Wife's father died, left lots of money, no financial planning, mother in law goes crazy, gives away 1.4 million to scammers over 5 insane years, suddenly I have to figure out how to save a house, retirement and a person from the brink. I have a friend whom is a financial advisor, learn a lot from him, got interested in what he does, applied to be an advisor, got the job, got paid to study, state life and health, series 7 and 66, lots of training and tools at my disposal. Still feel like an infant in finance due to knowing how much I know that I dont know. \n\nIt is a rabbit hole you never find the bottom of. Investment advisors in the business 30 years say \"no one has a crystal ball\"\n\nBut lots of fun.",
        "created_utc": 1578165529,
        "id": "fd49a4p",
        "permalink": "/r/investing/comments/ejyye9/what_was_your_path_in_learning_about_the_stock/fd49a4p/",
        "score": 86,
        "subreddit": "investing",
        "created": 1578194329.0
    },
    {
        "author": "Hadron90",
        "body": "Close. They really just sell your positions for the entertainment value. Every big hedge calls a morning meeting over coffee in their boardrooms and go over the positions for the laugh. They are like \"Wait...he bought $SPY puts again? Isn't this the same guy that lost it all on them last week?\", and the whole board room erupts into laughter.",
        "created_utc": 1578325077,
        "id": "fddvm9c",
        "permalink": "/r/wallstreetbets/comments/ekvmnb/robinhood_king_of_thieves/fddvm9c/",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1578353877.0
    },
    {
        "author": "debsman20",
        "body": "But it can affect the general stock market negatively.",
        "created_utc": 1578015783,
        "id": "fcw2qeo",
        "permalink": "/r/wallstreetbets/comments/ej7ytx/long_oil_were_going_to_war_boys_us_airstrike_in/fcw2qeo/",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1578044583.0
    },
    {
        "author": "Worf_Of_Wall_St",
        "body": "Fuck I’ve been doing it all wrong.",
        "created_utc": 1578276245,
        "id": "fdcj837",
        "permalink": "/r/investing/comments/ekf5a5/during_the_2008_recession_some_people_managed_to/fdcj837/",
        "score": 83,
        "subreddit": "investing",
        "created": 1578305045.0
    },
    {
        "author": "PM_ME_XBOX_COD3S",
        "body": "Either bots or people are somehow profiting off of it. I swear the same people reply to everything about trump",
        "created_utc": 1578174219,
        "id": "fd551qa",
        "permalink": "/r/wallstreetbets/comments/ejxclf/apple_started_wwiii_so_that_phones_would_be/fd551qa/",
        "score": 81,
        "subreddit": "wallstreetbets",
        "created": 1578203019.0
    },
    {
        "author": "j33tAy",
        "body": "I have been to rehab three times over the last ten years. I have met people who have been twenty times.\n\nRehab is not a cure all or a magic place. It's an insulated, clinical, drug free environment to get clean.\n\nHowever, it's not really a place to address problems.\n\nI am drawn to all sorts of things that are high risk: self-employment, entrepreneurship, drugs, alcohol, crazy women, gambling, options and futures, racing cars, etc. \n\nI'm just a degenerate who has a broken dopamine cycle.\n\nRehab got me clean but changing my behavior was a whole different thing.\n\nThat has taken time and conscious effort on improving my discipline and priorities. I still gamble but I budget for it, for example. I don't drink because I end up going on month long benders.\n\nI do not mean to come off as pessimistic. Getting clean and recovery are very rewarding and rehab can help. But its not what they market it to be.\n\nTake care of yourself, homie.",
        "created_utc": 1578263194,
        "id": "fdbwyk8",
        "permalink": "/r/wallstreetbets/comments/ekdys5/being_a_bear_is_not_good_for_mental_health/fdbwyk8/",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1578291994.0
    },
    {
        "author": "thicc_dads_club",
        "body": "In a shocking turn of events it appears that taking investment advice from a blind guy who makes YouTube videos about child-proof lids is not a great idea.",
        "created_utc": 1578315440,
        "id": "fddk5pv",
        "permalink": "/r/wallstreetbets/comments/ekrqsv/acb_drift_cancelled/fddk5pv/",
        "score": 79,
        "subreddit": "wallstreetbets",
        "created": 1578344240.0
    },
    {
        "author": "fckthemoney",
        "body": "Shut the fuck up retard. If it does happen in Iraq Arabic news sources especially those who support Iran will pick it up faster. You just lost your inside info. I bet you're a stupid fucking worthless bear anyways.",
        "created_utc": 1578273613,
        "id": "fdcfhla",
        "permalink": "/r/wallstreetbets/comments/ekmcf2/insider_information/fdcfhla/",
        "score": 79,
        "subreddit": "wallstreetbets",
        "created": 1578302413.0
    },
    {
        "author": "Shandlar",
        "body": "It's really getting hilarious now.  Stocks only go up.\n\nLiteral WWIII fears, oil price spikes.  All weekend to stew.  Trump threatening to go Machiavellian and risk the EU actually sanctioning the US and causing a proper global recession.\n\nSPX?  Fuck it, I'll just recover the entire -0.60% down for no reason at all and just keep going up all afternoon.",
        "created_utc": 1578338078,
        "id": "fdefsf4",
        "permalink": "/r/wallstreetbets/comments/ekxqk1/bear_gang/fdefsf4/",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1578366878.0
    },
    {
        "author": "bfreis",
        "body": "I can try.\n\nHere's what happens without PFOF:\n\n    You -&gt; Broker -&gt; Exchange (where Market Makers post their bids and asks)\n\nWith PFOF:\n\n    You -&gt; Broker -&gt; PFOF firm -&gt; Exchange and maybe other sources of liquidity.\n\nThe market makers posting bids and asks on the Exchange have no idea who will trade against them:\n\n* Could be the uninformed retail trader who, clueless, thinks it's smarter to send an order directly to the exchange (after all, they believe this myth that *\"PFOF is evil, let's bypass them!\"*).\n* Could also be an extremely well funded and smart team of quant traders in a large hedge fund.\n\nThe MM doesn't consider the uninformed retail trader a big risk, as he's likely as good as a coin flip; MMs love coin flips as they can expect to get as many on the bids as on the asks they are posting, thus capturing the spread with very low risk. The orders from e.g. the hedge fund quant traders are much higher risk for the MM because they're informed: if those quants start buying heavy, they probably know something. The MMs now have much higher risk on their inventory. Because the MMs have this possibility of much higher risk, they have to be compensated for it: **market makers widen their bid-ask spreads where they may be trading against informed adversaries**.\n\nNow, a firm that has a PFOF agreement with a broker such as Robinhood knows exactly what kind of orders to expect: uninformed orders that are as good as a coin flip, from a clueless trader sitting on his couch. This carries much less risk. For this reason, MMs don't need such a wide bid-ask spread as they would need to post on the public exchanges. With the lower risk, they can afford to (1) pay Robinhood for their customers' orders, and (2) trade with narrower bid-ask spreads ultimately giving retail traders better prices than NBBO.\n\nYou can read more on this topic if you search for *adverse selection*.",
        "created_utc": 1577992138,
        "id": "fcv0gsn",
        "permalink": "/r/options/comments/ej20zi/finra_fines_robinhood_financial_llc_125_million/fcv0gsn/",
        "score": 78,
        "subreddit": "options",
        "created": 1578020938.0
    },
    {
        "author": "Ardesic53",
        "body": "BREAKING NEWS: AAPL releases new branch of weapons\n\niKill section including:\n\n1. The new iTank. Turret and tracks sold separately\n\n2. The new iJet. Engine and seat sold separately\n\n3. The new iRifle 556. 557 comes out next year, rendering the 556 useless in combat compared to the 557 or the 558 that comes a year later. For a discounted price, you can get the 556S. The ammunition is the same, the velocity and rpm is slowed down i.e. s for slow.\n\n4. The new iHelmet. Pure AR collaboration with FB. All data is farmed and sold to the highest bidders. The Russians buy it for the Iranians and the farmers are able to attack bases daily with 100% success rate.\n\n\n5. The new iAmmunition. This is only used in the Rifle 556. It cannot be used in the 557 and a new set of ammunition is needed for it. The iAmmunition2.\n\n\n6. The iMissile: able to be used with either a MacBook Pro (RRP $52,000) or the new iPad (RRP $5200).Troops can carry the iPad to call in an attack from the ground to attack a location",
        "created_utc": 1578082804,
        "id": "fcymkck",
        "permalink": "/r/wallstreetbets/comments/ejkryd/imagine_if_the_iranians_saw_this_subreddit/fcymkck/",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1578111604.0
    },
    {
        "author": "flyboy573",
        "body": "Some yacht owned by some rich HF prick that later got caught with his pants down on a positive carry position. \n\nEx - if you borrow yen and then buy US treasuries, there’s a positive carry as you’re earning a higher risk free rate then you’re borrowing at. FX markets should theoretically price out any advantage when you convert yen into dollars but that doesn’t always happen and you can make boko bucks doing it.",
        "created_utc": 1578260801,
        "id": "fdbre9r",
        "permalink": "/r/wallstreetbets/comments/ekiont/googles_default_image_for_positive_carry_search/fdbre9r/",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1578289601.0
    },
    {
        "author": "DadGoneGamer",
        "body": "#WAR!!!\n\nHUH\n\nYEAA\n\n#WHAT IS IT GOOD FOR??!!!\n\n#LINING MY FUCKING POCKETS!!! ALRIGHT!!!",
        "created_utc": 1578417454,
        "id": "fdh85nt",
        "permalink": "/r/wallstreetbets/comments/eld4i6/all_in_the_war_machine/fdh85nt/",
        "score": 77,
        "subreddit": "wallstreetbets",
        "created": 1578446254.0
    },
    {
        "author": "Kundera42",
        "body": "Active aerospace engineer and Boeing investor here.\n\nThe newly discovered issue is not a big deal. It is something that requires a small amount of parts and few hours of labor per aircraft.\n\nThe 737 MAX gets enormous amounts of scrutiny (which is good in general) but the media currently reports on it more than usual.\n\nThis new issue would normally be covered under a service bulletin with medium urgency, not more than that. Happens all the time for all aircraft currently in service, including Airbus.",
        "created_utc": 1578333106,
        "id": "fde7vkq",
        "permalink": "/r/stocks/comments/ektdc4/boeing_has_uncovered_another_potential_design/fde7vkq/",
        "score": 76,
        "subreddit": "stocks",
        "created": 1578361906.0
    },
    {
        "author": "BDSHAD",
        "body": "The fact that you closed it out at 470.69 was definitely a nice touch BUT if you had closed it at 469.69 i would’ve been rock hard going into this fap session",
        "created_utc": 1578438550,
        "id": "fdia910",
        "permalink": "/r/wallstreetbets/comments/eliq3m/i_yolod_my_way_into_a_free_cybertruck_15k_tesla/fdia910/",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1578467350.0
    },
    {
        "author": "jay9909",
        "body": "&gt; AdvoCare is “admitting that it operated as a pyramid,” ... **The company is banned from multilevel marketing as part of the settlement**, the FTC added.\n\nAre there legal pyramid schemes?  I figured they were all illegal, which would make such a restriction superfluous.",
        "created_utc": 1578275849,
        "id": "fdcinou",
        "permalink": "/r/investing/comments/ekktt2/advocare_endorsed_by_nfl_quarterback_drew_brees/fdcinou/",
        "score": 76,
        "subreddit": "investing",
        "created": 1578304649.0
    },
    {
        "author": "Juicymess",
        "body": "We’ve been concerned for like the last year you dumb whore\n\nMarket doesn’t make sense rn. Don’t fight it, just enjoy gains",
        "created_utc": 1578007199,
        "id": "fcvpjm3",
        "permalink": "/r/wallstreetbets/comments/ej5vt8/am_i_the_only_one_concerned_with_these_levels/fcvpjm3/",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1578035999.0
    },
    {
        "author": "mister_bono",
        "body": "Rest of the world still hasn't figured it out",
        "created_utc": 1578429432,
        "id": "fdhsoqi",
        "permalink": "/r/wallstreetbets/comments/elg1pw/when_you_exercise_600_tsla_leap_options_purchased/fdhsoqi/",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1578458232.0
    },
    {
        "author": "elosorojo4",
        "body": "Kicking myself. I had sold at $340. Average buy in in of $280. Happy to have made a profit but obviously wishing I had held on. Would like to get back in at some point. It’s been such a wild ride up and down my instinct is to wait for a big drop to get back in but am now thinking it probably won’t reach those levels again anytime soon.",
        "created_utc": 1578063719,
        "id": "fcxifd7",
        "permalink": "/r/stocks/comments/ejfdl3/tesla_tops_wall_street_estimated_with_112000/fcxifd7/",
        "score": 75,
        "subreddit": "stocks",
        "created": 1578092519.0
    },
    {
        "author": "fallouthong",
        "body": "it will go up when you sell. Please sell",
        "created_utc": 1578429031,
        "id": "fdhrzav",
        "permalink": "/r/wallstreetbets/comments/elh78e/why_is_amd_going_down/fdhrzav/",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1578457831.0
    }
]