[
    {
        "author": "sirvapedalot",
        "body": "Das Microchip Go Vroom!",
        "created_utc": 1600036913,
        "id": "g569h3t",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1600065713.0
    },
    {
        "author": "ThatNewNewNewGuy",
        "body": "Dear all, we upgraded our hamsters, that were running on wheel to generate electricity for our printer, to 5G networks. This will allow our microchip hamster to run at faster speed than ever before.\n\nBuy calls y'all.",
        "created_utc": 1599011599,
        "id": "g3o5wdu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1599040399.0
    },
    {
        "author": "RADIO02118",
        "body": "So what magic beans are we betting on today? Pink mattresses and enchanted corn stalks? Or cyberborg cars and the microchip of eternal life? 🧙‍♂️",
        "created_utc": 1600180296,
        "id": "g5cx8bq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600209096.0
    },
    {
        "author": "newfareman",
        "body": "I figured the flaw in my logic, but thank you for taking the time to explain. To expand upon it a bit further, I'm trying to fully understand the correlation between the average p/e and the current stock price. I understand there are three different factors to consider which are past, current, and future growth. If you look at Apple and Microsoft they are way above what their average p/e should be. Why would there be such huge percentile increases in these companies? Are people betting on the continued explosive growth of Microsoft with Azure and Apple with their new microchip and new phones coming out? Or is it really hard to say and it's mostly arbitrary? I'm curious to see what your opinion on it is.",
        "created_utc": 1600619416,
        "id": "g5zvo9e",
        "score": 2,
        "subreddit": "stocks",
        "created": 1600648216.0
    },
    {
        "author": "Trumpowell",
        "body": "Billy gates ain't putting a microchip in me",
        "created_utc": 1599663972,
        "id": "g4jw4xp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599692772.0
    },
    {
        "author": "Carnivore_kitteh",
        "body": "Google KNOS advfn and search investor hub for some solid DD\n\nIt is an air purifier company with tech beyond what any other company has. The owner and inventor has patent after patent on the technology used in the product. He worked for nasa or something... But it doesn't use hepa filters, and instead neutralizes the air of pathogens, bacteria, pollen, and pollution by reading it and adjusting to what is needed. Its filter can be washed in the dishwasher and reused. It also filters 100x smaller particles than hepa. Way cheaper, and easily convertible in size. It can be as small as a microchip and large for industrial use.\n\nThey were signed onto Walmart a month ago and have a good team. They also value the environment over share holders ( which I like ) and are here to actually.make a difference.\n\nThey are getting hammered right now, but with the air filtration market to skyrocket, they are poised to soar.",
        "created_utc": 1600282542,
        "id": "g5hz0rb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600311342.0
    },
    {
        "author": "SolitaryEgg",
        "body": "This is legit the dumbest fucking boomer conspiracy theory around right now (except maybe the bill gates microchip one).\n\nYou think every country on earth shut down in a coordinated attempt to get Biden elected? In fact, they all did *way more,* which is why we are the worldwide covid MVPs",
        "created_utc": 1600172680,
        "id": "g5ck2xw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1600201480.0
    },
    {
        "author": "-nye-",
        "body": "Imagine you’re late on your AMD payment and it drivers itself back to the microchip",
        "created_utc": 1599451456,
        "id": "g4at9e6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599480256.0
    },
    {
        "author": "thenewredditguy99",
        "body": "&gt;Once a covid vaccine is released ppl will be flocking back to them.\n\n Not everyone will take the vaccine because of the whole microchip implant in our heads bullshit rumor that's going around.",
        "created_utc": 1599339241,
        "id": "g45xkze",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1599368041.0
    },
    {
        "author": "TheCreedsAssassin",
        "body": "truee, it could have some Bill Gates microchip in it after all right?",
        "created_utc": 1600097322,
        "id": "g58nspl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600126122.0
    },
    {
        "author": "RickAsscheeks",
        "body": " SPY 0: ABT ABBV ABMD ACN ATVI ADBE AMD AAP AES AFL A APD AKAM ALK ALB ARE ALXN ALGN ALLE ALL AMZN AMCR AEE AAL AEP AXP AIG AMT AWK AMP ABC AME AMGN APH ADI ANSS ANTM AON AOS APA AIV AAPL AMAT APTV ADM ANET AJG AIZ ATO ADSK ADP AZO AVB AVY AVGO BKR BLL BAC BK BAX BDX BRK.B BBY BIO BIIB BLK BA BKNG BWA BXP BSX BMY BR BF.B BEN CHRW COG CDNS CPB COF CAH CCL CARR CAT CBOE CBRE CDW CE CNC CNP CTL CERN CF CHTR CVX CMG CB CHD CI CINF CTAS CSCO C CFG CTXS CLX CME CMS CTSH CL CMCSA CMA CAG CXO COP COO CPRT CTVA COST COTY CCI CSX CMI CVS CRM DHI DHR DRI DVA DE DAL DVN DXCM DLR DFS DISCA DISCK DISH DG DLTR D DPZ DOV DOW DTE DUK DRE DD DXC DGX DIS ED ETFC EMN ETN EBAY ECL EIX EW EA EMR ETR EOG EFX EQIX EQR ESS EL EVRG ES EXC EXPE EXPD EXR FANG FFIV FB FAST FRT FDX FIS FITB FE FRC FISV FLT FLIR FLS FMC F FTNT FTV FBHS FOXA FOX FCX FTI GOOGL GOOG GLW GPS GRMN GD GE GIS GM GPC GILD GL GPN GS GWW HRB HAL HBI HIG HAS HCA HSIC HSY HES HPE HLT HFC HOLX HD HON HRL HST HWM HPQ HUM HBAN HII IT IEX IDXX INFO ITW ILMN INCY IR INTC ICE IBM IP IPG IFF INTU ISRG IVZ IPGP IQV IRM JKHY J JBHT JNJ JCI JPM JNPR KMX KO KSU K KEY KEYS KMB KIM KMI KLAC KSS KHC KR LNT LB LHX LH LRCX LW LVS LEG LDOS LEN LLY LNC LIN LYV LKQ LMT L LOW LYB LUV MMM MO MTB MRO MPC MKTX MAR MMC MLM MAS MA MKC MXIM MCD MCK MDT MRK MET MTD MGM MCHP MU MSFT MAA MHK MDLZ MNST MCO MS MOS MSI MSCI MYL NDAQ NOV NTAP NFLX NWL NEM NWSA NWS NEE NLSN NKE NI NBL NSC NTRS NOC NLOK NCLH NRG NUE NVDA NVR NOW ORLY OXY ODFL OMC OKE ORCL OTIS O PEAK PCAR PKG PH PAYX PAYC PYPL PNR PBCT PEP PKI PRGO PFE PM PSX PNW PXD PNC PPG PPL PFG PG PGR PLD PRU PEG PSA PHM PVH PWR QRVO QCOM RE RL RJF RTX REG REGN RF RSG RMD RHI ROK ROL ROP ROST RCL SCHW STZ SJM SPGI SBAC SLB STX SEE SRE SHW SPG SWKS SLG SNA SO SWK SBUX STT STE SYK SIVB SYF SNPS SYY T TAP TMUS TROW TTWO TPR TGT TEL TDY TFX TXN TXT TMO TIF TJX TSCO TT TDG TRV TFC TWTR TYL TSN UDR ULTA USB UAA UA UNP UAL UNH UPS URI UHS UNM VFC VLO VAR VTR VRSN VRSK VZ VRTX VIAC V VNO VMC WRB WAB WMT WBA WM WAT WEC WFC WELL WST WDC WU WRK WY WHR WMB WLTW WYNN XRAY XOM XEL XRX XLNX XYL YUM ZBRA ZBH ZION ZTS",
        "created_utc": 1600294836,
        "id": "g5irhtl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600323636.0
    },
    {
        "author": "StylizedPortfolio",
        "body": "microchip in a covid vaccine?? Are you one of the anti maskers or a believer in flat earth theory!? Looks like you are in a simulation",
        "created_utc": 1599251042,
        "id": "g41c7vk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599279842.0
    },
    {
        "author": "jimandtonicc",
        "body": "Like the illuminati you dumb fuck who do you think controls everything? Who do you think watches you through your computer?? Who do you think is gonna use the COVID vaccine as an excuse to microchip your dumb sorry sheeple lookin ass. \n\nThat and large commercial banks that will have to rebalance their portfolios and buy back some treasury paper to collateralize their balance sheets before they report at the EOM. But mostly the illuminati you dumb fuck.\n\nEdit: Lmao sorry I replied so violently I thought this was a different comment thread. But yeah like the biggest commercial banks JPM, Deustche, other ones I dont know.",
        "created_utc": 1599250867,
        "id": "g41bpdt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599279667.0
    },
    {
        "author": "jimandtonicc",
        "body": "Lmao my bad I thought it was a different comment thread. No I don't really believe they're trying to microchip us with a covid vaccine. We're clearly already microchipped c:",
        "created_utc": 1599251211,
        "id": "g41cpmn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599280011.0
    },
    {
        "author": "robbinhood69",
        "body": "I find it funny theres some segment of the population that is convinced bill gates will microchip them w a vaccine but yet is also willing to let Elong microchip their brain",
        "created_utc": 1599011009,
        "id": "g3o4tps",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599039809.0
    },
    {
        "author": "EthLaw",
        "body": "Google the manual and download a browser for AI entities and people with microchip implants",
        "created_utc": 1601218328,
        "id": "g6uq1vj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1601247128.0
    },
    {
        "author": "DrPechanko",
        "body": "The cult of musk. Enjoy the climb to the bottom. I choose my companies on research. Musk has so many fails that led him bumbling here. \n\nCorona also created the perfect storm for people to throw there money in a wishing well. \n\nDo you realize TESLA stock was 198 dollars up until 2019. What changed in a year?! \n\n300,000 car sales, tunnels under a city, a pig with a chip in its head, 7 failed rocket explosions.....what has changed? \n\nIm sorry, I really believe that bubble is going to burst. I don’t think Musk is an innovator, and I absolutely don’t believe he is a “genius” or “savant” of any kind. He comes from money....learned to program, invested his own money got richer..\n\nHold on while I graft a microchip into my brain so I can listen to some music and “maintain my anxiety levels”. Neurolink completed....I am now able to compete with AI cyborgs in the year 3030.",
        "created_utc": 1598969438,
        "id": "g3l8su1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1598998238.0
    },
    {
        "author": "Russian-Collusion",
        "body": "Microchip yes but not a name tag",
        "created_utc": 1599447838,
        "id": "g4ao0oa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599476638.0
    },
    {
        "author": "SolitaryEgg",
        "body": "You think his microchip is responsible for my dumb brain?",
        "created_utc": 1599259358,
        "id": "g4209od",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599288158.0
    },
    {
        "author": "leapbitch",
        "body": "Hot take this is what happens when you don't have controls on your critical software patches.\n\nElon had engineers start a critical software patch for the God damn brakes on a Tuesday morning and they push it out that night.\n\nPotential software bugs aside do you think a car company can legitimately complete full brake testing in an afternoon? From start to finish? And Elon just pushes that shit out into each Tesla on command. Quick aside I feel like a Bill Gates microchip conspiracy theorist except Elon has literally announced his plans for implants and shit.\n\nThat's how Boeing did their airplanes that are currently fucked sideways on software errors. Poor dev culture. Literally every industry. Put devs back in leadership of devs but obviously make sure they're savvy too. Don't let a manbaby rule them like the worst parts of Gavin Belson and Dr. Evil and the asshole boss from Office Space. Actual tech companies are marginally better and regular companies fucking slam laptops together for fun.\n\nTldr I want a tesla but don't want a software update to make my car drive me to elon's house for whatever weird reason he desires that day",
        "created_utc": 1600914417,
        "id": "g6dpwwo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1600943217.0
    },
    {
        "author": "Ownageforhire",
        "body": "I’m going to have to make another account to do this. I’m just too active on my main accounts to watch x stock slip x amount and not sell and buy back later in the day or etc. Especially this past week or so, markets been going up and down 2-5% during the day for whatever reason. \n\nI know buy and hold is a good thing. But somehow I just view investing as very hands on. \n\nWhat are some stock examples that you have held personally for the last 5+ years that have provided good returns? \n\nI’m thinking the cloud / microchip companies but it’s very saturated with competition. My other thoughts are to look to China, $baba and newer ev makers and try to capitalize on that countries growth.",
        "created_utc": 1600637247,
        "id": "g6163fn",
        "score": -2,
        "subreddit": "investing",
        "created": 1600666047.0
    },
    {
        "author": "ehehe",
        "body": "Has anyone here ever played anything on Qorvo? Cannot find a single weakness in this company at all, huge tech exposure, already very profitable, great growth prospects, and only a 35 p/e. Anyone have any insight?",
        "created_utc": 1599841570,
        "id": "g4u5rxa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1599870370.0
    },
    {
        "author": "BumbleFuckDuck",
        "body": "Article from link:\n\n\"Zomedica Pharmaceuticals Corp. (NYSE American: ZOM) announced today that it has agreed with its development partner Qorvo Biotechnologies, LLC, a wholly owned subsidiary of Qorvo US, Inc., to develop three new assays -- Cobalamin, cPL (canine Pancreatic Lipase), and Folate -- to target diagnosis of canine gastrointestinal issues. The new assays are in addition to the initial five assays currently under development, including panels for adrenal and thyroid testing, for TRUFORMA™, Zomedica's point-of-care veterinary diagnostic platform. The agreement to pursue development of the new assays has triggered the final $2 million milestone payment under Zomedica’s Development and Supply Agreement with Qorvo.\n\n“Our intent for TRUFORMA™ always has been to have it serve as a broad diagnostic point-of-care tool for dogs and cats and to continue to expand the diagnostic offerings available on the platform,\" said Robert Cohen, Interim Chief Executive Officer of Zomedica. \"We believe that the combination of the Cobalamin, cPL and Folate assays will enable veterinarians to use TRUFORMA to conduct a thorough testing panel to diagnose dogs in gastrointestinal distress.\"\n\nIf successfully developed, the Cobalamin, cPL, and Folate assays will represent what the Company believes is the first non-infectious gastrointestinal panel optimized for use in canines fully available at the point-of-care to facilitate rapid diagnosis of gastrointestinal disorders. Evaluation of the health of different components of the gastrointestinal system is necessary to identify the cause of clinical symptoms. This panel is intended to assay the function of the pancreas, proximal small intestine, and distal small intestine. The Company believes that the ability to conduct testing at the point-of-care will facilitate real-time clinical decision-making, reduce in-patient clinic stay, promote earlier detection and treatment, and increase pet owner satisfaction.\n\nAccording to a DVM360 study*, ASPCA Pet Insurance, Embrace, Nationwide, Pets Best and Trupanion agree that “GI condition” is the most common insurance claim for dogs. Signs of digestive system disease can include excessive drooling, diarrhea, constipation, vomiting or regurgitation, loss of appetite, bleeding, abdominal pain and bloating, straining to defecate, shock, and dehydration. The TRUFORMA diagnostic device, which is smaller than a desktop printer, is anticipated to provide highly sensitive, species-specific assays using Qorvo’s proprietary, non-optical Bulk Acoustic Wave (\"BAW\") sensor technology. The BAW sensor is a proven semiconductor technology used in telecommunications and aerospace markets. The Company believes that BAW technology has the potential to improve veterinary diagnostics by delivering reference laboratory accuracy and test performance to the veterinary clinic at the point-of-care.\"\n\nI bolded the important parts. This is a long hold regardless if r/s happens or does not. IMO the r/s ain't happening.",
        "created_utc": 1599597057,
        "id": "g4h6ce5",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599625857.0
    },
    {
        "author": "futbolito112000",
        "body": "I had NOK at $4 and sold at $5 after earnings. I also sold options on the shares I owned ($5 call). I believe in the company but people have been burned in the past so they are hesitant to invest in it. They are still restructuring and their products cost more than the other players; however, that should change in 6 or 9 months. Their data center seems promising too and I believe Apple is a customer.  To be honest, it's probably dead money for awhile and it's going to be in this $4 to $5 range. I wouldn't be surprised if it dips under $4.  Maybe pick up 250 shares and sell when it goes up a quarter and wait for pullbacks or hold on for the long term in case they get acquired. Other than that, you are better off with Marvell Technologies, Apple, Qrvo, Qualcomm for a 5G play. Even if you get less shares for $1000, the likelihood of the stock moving up is much greater. Also, if they pay dividends (Apple pays divs but not sure of the others), just reinvest the dividends and you will have more shares in the future. I've been burned by a lot of these cheap stocks that they are almost not worth investing in because they just don't move much.  You can consider having a portfolio of 6 of these under $7 stocks but don't put more than $3k. If one of them pans out, great. Not all will be winners.  \n\nYou may want to consider Ark Invest ETFs as I have a couple of them (ARKK and ARKF). The returns have been tremendous and Cathy (CEO) invests in disruptive companies. Vanguard funds are good too and I am considering getting one of the cloud ETFs and information technology ETFs when the market pulls back again as valuations are still too high. I may also look at the IPO ETF and getting some Snowflake (SNOW) shares for the long term. Good luck and I agree to not day trade with your IRA and take profits when the stocks/ETFs climb as you can buy them back again. Try to sell option calls if you have 100 shares for some additional passive income.",
        "created_utc": 1600020672,
        "id": "g55203g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1600049472.0
    },
    {
        "author": "dudeitsadell",
        "body": "I'm actually bullish on semiconductors and feel like theyre the next sector to pop up... the last tech run in august was mostly cloud, aapl, tsla, internet services. Only NVDA and broadcom saw a slight bump. \n\nHardware like $QRVO, $QCOM, $INTC, $AMD, $SWKS, $WDC, $MU, $TSM has some ground to make up. The sector rotation cant go to airlines or financials, so Semis and Retail it is",
        "created_utc": 1599411634,
        "id": "g48x7zo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599440434.0
    },
    {
        "author": "LePootPootJames",
        "body": "Qorvo Attano up 8% today. Best performer in SP500.",
        "created_utc": 1599671891,
        "id": "g4kc6e1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599700691.0
    },
    {
        "author": "BumbleFuckDuck",
        "body": "Article from link:\n\n\"Zomedica Pharmaceuticals Corp. (NYSE American: ZOM) announced today that it has agreed with its development partner Qorvo Biotechnologies, LLC, a wholly owned subsidiary of Qorvo US, Inc., to develop three new assays -- Cobalamin, cPL (canine Pancreatic Lipase), and Folate -- to target diagnosis of canine gastrointestinal issues. The new assays are in addition to the initial five assays currently under development, including panels for adrenal and thyroid testing, for TRUFORMA™, Zomedica's point-of-care veterinary diagnostic platform. The agreement to pursue development of the new assays has triggered the final $2 million milestone payment under Zomedica’s Development and Supply Agreement with Qorvo.\n\n“Our intent for TRUFORMA™ always has been to have it serve as a broad diagnostic point-of-care tool for dogs and cats and to continue to expand the diagnostic offerings available on the platform,\" said Robert Cohen, Interim Chief Executive Officer of Zomedica. \"We believe that the combination of the Cobalamin, cPL and Folate assays will enable veterinarians to use TRUFORMA to conduct a thorough testing panel to diagnose dogs in gastrointestinal distress.\"\n\nIf successfully developed, the Cobalamin, cPL, and Folate assays will represent what the Company believes is the first non-infectious gastrointestinal panel optimized for use in canines fully available at the point-of-care to facilitate rapid diagnosis of gastrointestinal disorders. Evaluation of the health of different components of the gastrointestinal system is necessary to identify the cause of clinical symptoms. This panel is intended to assay the function of the pancreas, proximal small intestine, and distal small intestine. The Company believes that the ability to conduct testing at the point-of-care will facilitate real-time clinical decision-making, reduce in-patient clinic stay, promote earlier detection and treatment, and increase pet owner satisfaction.\n\nAccording to a DVM360 study*, ASPCA Pet Insurance, Embrace, Nationwide, Pets Best and Trupanion agree that “GI condition” is the most common insurance claim for dogs. Signs of digestive system disease can include excessive drooling, diarrhea, constipation, vomiting or regurgitation, loss of appetite, bleeding, abdominal pain and bloating, straining to defecate, shock, and dehydration. The TRUFORMA diagnostic device, which is smaller than a desktop printer, is anticipated to provide highly sensitive, species-specific assays using Qorvo’s proprietary, non-optical Bulk Acoustic Wave (\"BAW\") sensor technology. The BAW sensor is a proven semiconductor technology used in telecommunications and aerospace markets. The Company believes that BAW technology has the potential to improve veterinary diagnostics by delivering reference laboratory accuracy and test performance to the veterinary clinic at the point-of-care.\"\n\nI bolded the important parts. This is a long hold regardless if r/s happens or does not. IMO the r/s ain't happening.",
        "created_utc": 1599597057,
        "id": "g4h6ce5",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1599625857.0
    },
    {
        "author": "dudeitsadell",
        "body": "I'm actually bullish on semiconductors and feel like theyre the next sector to pop up... the last tech run in august was mostly cloud, aapl, tsla, internet services. Only NVDA and broadcom saw a slight bump. \n\nHardware like $QRVO, $QCOM, $INTC, $AMD, $SWKS, $WDC, $MU, $TSM has some ground to make up. The sector rotation cant go to airlines or financials, so Semis and Retail it is",
        "created_utc": 1599411634,
        "id": "g48x7zo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1599440434.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  1st of September\n\n\n\n## Upcoming events for Tuesday, September  1st\n\n - Stock splits:\n\n    - INOTF @ **2:11**\n\n - Expected earnings:\n\n  ANAT, ASFI, AZRX, BBW, BWL.A, CAL, CDMO, CEA, CIG, CVV, DRD, GEC, GILT, HIHO, HMY, HOME, HRB, IDXG, JAMF, JILL, KBSF, KEN, METX, MFAC, NOVN, NSSC, NVUS, RBCN, SCPE, SCVL, SYNL, TC, TEUM, UTSI, WSG\n\n - Ex-div:\n\n  AROW, AVY, EBIX, FAM, FCT, FDEU, FEI, FIF, FIV, FMY, FOX, FOXA, FPF, FPL, FSD, FTHY, GHL, HAL, HLI, ICL, IGD, IID, ITUB, KRNY, MYE, NPO, NVDA, ODFL, OPOF, PAHC, PJT, RCKY, RE, SLB\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -4.524M)\n    - Construction Spending (consensus: 1.0%, previous: -0.7%)\n    - Dallas Fed Services Revenues (previous: -8.5)\n    - FOMC Member Brainard Speaks\n    - ISM Manufacturing Employment (consensus: 45.8, previous: 44.3)\n    - ISM Manufacturing New Orders Index (previous: 61.5)\n    - ISM Manufacturing PMI (consensus: 54.5, previous: 54.2)\n    - ISM Manufacturing Prices (consensus: 54.0, previous: 53.2)\n    - Manufacturing PMI (consensus: 53.6, previous: 50.9)\n    - Redbook (previous: 0.6%)\n    - Redbook (previous: 4.1%)\n    - Texas Services Sector Outlook (previous: -26.7)\n    - Total Vehicle Sales (previous: 14.50M)\n\n## Upcoming events for Wednesday, September  2nd\n\n - Expected earnings:\n\n  AKER, AMBA, AMRH, APWC, ATLC, BCOW, BF.A, BF.B, BMA, BROG, CBLI, CEI, CLDR, CPRT, CRWD, CTXR, CVU, EGAN, FIVE, FMCI, GES, GSX, GWRE, HMG, HOTH, HTHT, HUSA, IPDN, JFIN, KEP, KFFB, KLXE, LE, LMFA, M, MBOT, MCEP, MDB, MEIP, MIND, MTRX, OBSV, PD, PPSI, PRCP, PSV, PVH, QTT, REXN, RKT, SAIC, SMAR, SMIT, SNP, SPWH, TDAC, VRA, VRNT, WORX, WUBA, XIN, YGYI, ZNH, ZUO\n\n - Ex-div:\n\n  AMCR, BBD, BBDO, CEO, FORTY, HD, LIN, LZB, MOS, PEBK, PTEN, QCOM, RMBI, SSTK, TER\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 950K, previous: 167K)\n    - Beige Book\n    - Crude Oil Imports (previous: -1.040M)\n    - Crude Oil Inventories (consensus: -1.950M, previous: -4.689M)\n    - Cushing Crude Oil Inventories (previous: -0.279M)\n    - Distillate Fuel Production (previous: 0.380M)\n    - Durables Excluding Defense (previous: 9.9%)\n    - EIA Refinery Crude Runs  (previous: 0.225M)\n    - EIA Weekly Distillates Stocks (consensus: -1.450M, previous: 1.388M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -7.0%, previous: 1.1%)\n    - FOMC Member Mester Speaks\n    - FOMC Member Williams Speaks\n    - Factory Orders (consensus: 6.0%, previous: 6.2%)\n    - Factory orders ex transportation (previous: 4.4%)\n    - Gasoline Inventories (consensus: -3.575M, previous: -4.584M)\n    - Gasoline Production (previous: 0.118M)\n    - Heating Oil Stockpiles (previous: 0.294M)\n    - ISM NY Business Conditions (previous: 53.5%)\n    - ISM-New York Index (previous: 807.8)\n    - MBA 30-Year Mortgage Rate (previous: 3.11%)\n    - MBA Mortgage Applications (previous: -6.5%)\n    - MBA Purchase Index (previous: 310.2)\n    - Mortgage Market Index (previous: 770.6)\n    - Mortgage Refinance Index (previous: 3,423.0)\n    - Sec Kashkari Speaks\n    - Seevol Cushing Storage Report (previous: -0.010M)\n\n## Upcoming events for Thursday, September  3rd\n\n - Expected earnings:\n\n  AIM, AKTX, AOUT, AVGO, BNED, BNTC, BYSI, CIEN, CKX, CLUB, CONN, COO, CPB, CTHR, CULP, DBI, DCI, DLTH, DOCU, DOMO, FFBW, FFHL, FIZZ, FLR, GCO, GMS, GRNQ, GROW, GTT, HOFT, HOV, IROQ, JW.A, JW.B, KFY, KIRK, KZIA, MDLA, MEI, MIK, MOMO, MSON, NX, OXM, PBIO, PDCO, PDEX, PZG, SCX, SECO, SFET, SHLO, SIG, SPCB, SWBI, TLYS, TTC, TWMC, UBA, UBP, VEDL, VOLT, WVFC, YEXT, ZUMZ\n\n - Ex-div:\n\n  AFB, AJG, AMNB, BAC, BBL, BF.A, BF.B, BHP, BLK, BOTJ, BRKS, CASS, CBFV, CBSH, CHRW, CRH, D, ESBK, FDX, FFNW, FNB, FRME, GOLF, GPC, ICBK, KMB, KNX, LCII, MBCN, MBWM, MLI, MLR, NAVI, NFE, NNA, ORI, OTEX, PEP, RF, SEE, SLM, SNR, STRA, SU, TGNA, TILE, TRST, TT, UFCS, UNF, WM, YY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.080%)\n    - 8-Week Bill Auction (previous: 0.090%)\n    - Challenger Job Cuts (previous: 262.649K)\n    - Chicago Fed President Evans Speaks\n    - Continuing Jobless Claims (consensus: 14,000K, previous: 14,535K)\n    - Exports (previous: 158.25B)\n    - ISM Non-Manufacturing Business Activity (consensus: 65.0, previous: 67.2)\n    - ISM Non-Manufacturing Employment (previous: 42.1)\n    - ISM Non-Manufacturing New Orders (previous: 67.7)\n    - ISM Non-Manufacturing PMI (consensus: 57.0, previous: 58.1)\n    - ISM Non-Manufacturing Prices (previous: 57.6)\n    - Imports (previous: 208.95B)\n    - Initial Jobless Claims (consensus: 950K, previous: 1,006K)\n    - Initial Jobless Claims (previous: 1,006K)\n    - Jobless Claims 4-Week Avg. (previous: 1,068.00K)\n    - Markit Composite PMI (consensus: 54.7, previous: 54.7)\n    - Natural Gas Storage (consensus: 47B, previous: 45B)\n    - Natural Gas Storage (previous: 45B)\n    - Nonfarm Productivity (consensus: 7.5%, previous: 7.3%)\n    - Services PMI (consensus: 54.8, previous: 54.8)\n    - Trade Balance (consensus: -58.00B, previous: -50.70B)\n    - Unit Labor Costs (consensus: 12.1%, previous: 12.2%)\n\n## Upcoming events for Friday, September  4th\n\n - Expected earnings:\n\n  ANIX, ATHE, ATNM, BMRA, BRC, CCH, CNNB, FSEA, GENE, GMHI, GVA, HURC, IBIO, IMRN, IRCP, JG, JKS, LFAC, MARPS, MSB, NFIN, PKX, QD, TNP, YIN\n\n - Ex-div:\n\n  AFIN, BPOP, EGOV, FAF, FANH, GBDC, LOB, PBIP, PE, PWOD, SVBI, UVSP, WRI\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.5%, previous: 4.8%)\n    - Average Hourly Earnings (previous: 0.2%)\n    - Average Weekly Hours (consensus: 34.5, previous: 34.5)\n    - CFTC Aluminium speculative net positions (previous: 211.8K)\n    - CFTC Copper speculative net positions (previous: 47.9K)\n    - CFTC Corn speculative net positions (previous: -17.4K)\n    - CFTC Crude Oil speculative net positions (previous: 500.7K)\n    - CFTC Gold speculative net positions (previous: 221.0K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 19.7K)\n    - CFTC Natural Gas speculative net positions (previous: 13.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -86.6K)\n    - CFTC Silver speculative net positions (previous: 31.3K)\n    - CFTC Soybeans speculative net positions (previous: 143.3K)\n    - CFTC Wheat speculative net positions (previous: 18.4K)\n    - Government Payrolls (previous: 301.0K)\n    - Manufacturing Payrolls (consensus: 50K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 1,400K, previous: 1,763K)\n    - Participation Rate (previous: 61.4%)\n    - Private Nonfarm Payrolls (consensus: 1,265K, previous: 1,462K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 180)\n    - U.S. Baker Hughes Total Rig Count (previous: 254)\n    - U6 Unemployment Rate (previous: 16.5%)\n    - Unemployment Rate (consensus: 9.8%, previous: 10.2%)\n\n^^^^2020-09-01",
        "created_utc": 1598954413,
        "id": "g3kjxt6",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1598983213.0
    },
    {
        "author": "MK45124512",
        "body": "Just a note that TER hired a PR firm to push their stock which is part of why they've been getting so much buzz lately. They were a solid bet on NJ legalization but at this point I don't think the discount (if it exists) to the big 4 is worth investing in. Caveat emptor",
        "created_utc": 1598970903,
        "id": "g3lcnsl",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1598999703.0
    },
    {
        "author": "iAMiAnthus2020",
        "body": "They are both 5% weighting? That’s what I see despite Ter being a couple rows higher.",
        "created_utc": 1599013365,
        "id": "g3o93be",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1599042165.0
    },
    {
        "author": "BigTendie08",
        "body": "4 straight minutes \n\nNot a cough\n\nNot a wheeze\n\nHe sounded more cognizant than normal if anything.",
        "created_utc": 1601766155,
        "id": "g7kmvb8",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1601794955.0
    },
    {
        "author": "RealisticHumanBot",
        "body": "Market is cognizant of the risk but it has not priced it in because the chances are fairly miniscule. We would still drop a fair bit",
        "created_utc": 1601945936,
        "id": "g7umssq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1601974736.0
    },
    {
        "author": "lostitlosingit",
        "body": "I’m not in FIG, but I focus on a geography where a huge % of the investable universe is FIG. The other thing is that the banking system there is an oligopoly, so I don’t run into regional banks, and unfortunately can’t help you there.  I think with wholesale vs retail, especially if you’re dealing with smaller banks, you have to be cognizant that wholesaled can be a much flightier source of capital if there’s a crisis of confidence. I would make sure you understand average deposits/ broker, you don’t want one broker controlling $100s of MM. \n\nOne thing to also focus on is % of revenue that comes from fees - you have some banks in my geography where 60% of the revenues come from account and credit card fees, which is hugely advantageous as you aren’t exposed to rates. Then you’re almost a tolling business, not a bank. Not sure if that helps considering how oligopolistic my universe is, but that’s my $0.02!",
        "created_utc": 1602350376,
        "id": "g8cakjw",
        "score": 1,
        "subreddit": "investing",
        "created": 1602379176.0
    },
    {
        "author": "eli_lilly",
        "body": "Depending on who your broker is, you'll want to be cognizant as to the situation that can arise if you hold the option to its expiration. Some brokers will automatically sell it starting around 3pm on the day of expiration. Other brokers will \"exercise\" it, which means you'd have to pay for the underlying stock at that point.",
        "created_utc": 1602265749,
        "id": "g88jz61",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602294549.0
    },
    {
        "author": "i_accidently_reddit",
        "body": "how in the world is cognizant a competitor of palantir? out of the bunch the only one doing something remotely similar is splunk, and they are way to focussed on web stuff. (that means they are civil, and while that is also a good market, the margins are smaller) That's like saying Toyota is a competitor to Ferrari \n\nthe attraction of pltr is that it sits in a niche between technology that BAE or booz allen cant do, Niche abilities that IBM cant do, and technical expertise that Accenture or Avanade cant deliver.\n\nThere is no real competitor, and it is night impossible to build a similar company.\n\ntech talent loves them. they are almost always top of the list for the best of the best engineers, up there with google, jane street, elastic or shopify.",
        "created_utc": 1602077780,
        "id": "g801m31",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1602106580.0
    }
]