[
    {
        "author": "dogs_best_friend14",
        "body": "Don’t sleep on SNPS",
        "created_utc": 1593358151,
        "id": "fw9u0ec",
        "score": 1,
        "subreddit": "investing",
        "created": 1593386951.0
    },
    {
        "author": "HoodSamaritan420",
        "body": "In descending order: SHOP, TSLA, AMZN, NFLX, NVD, TTD, MASI, MA, ZM, APPL, ANET, MKL, CGNX, BRK.B, ILMN, APPN, IDXX, NKE, GOOG, SNPS, SHW, COST, IIPR, ZNGA, DIS, CGC, BABA, GWPH, CNI, OGI, CRON, MTN.\n\nI know I’m probably spread too thin and should condense it down to 15-20. My mindset was to buy and hold for decades because I’m only 30 but I did some recent reorganizing when shit hit the fan in March. It was hard for me to start investing, I come from a family who only put their money in CDs, Money markets, and other types of savings accounts. I figured I’d have less risk if I picked a lot of different stocks but regretting it a little because it’s also less reward when a stock does really well. Probably going to get more aggressive and use some of the recommendations I’ve seen in recent posts",
        "created_utc": 1591237064,
        "id": "fstf1qn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591265864.0
    },
    {
        "author": "yourderivative",
        "body": "One company that I think has a bright future is Synopsys $SNPS.  I believe they are the 2nd most used 3rd party IP vendor (after ARM) and have their hands in all aspects of silicon development.  It isn't a cheap company now though.",
        "created_utc": 1593013828,
        "id": "fvv130a",
        "score": 1,
        "subreddit": "investing",
        "created": 1593042628.0
    },
    {
        "author": "BroncosFan19",
        "body": "Anyone remember who had the long summary of their position in Synopsis (SNPS) from I think a March letter?",
        "created_utc": 1593372987,
        "id": "fwam0zz",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1593401787.0
    },
    {
        "author": "nonasiandoctor",
        "body": "SNPs, cdns, TSMC.",
        "created_utc": 1591023131,
        "id": "fsj4lxg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591051931.0
    }
]