[
    {
        "author": "iopq",
        "body": "For now. Because Zen 3 isn't out. What happens when Zen 3 wins almost every benchmark (including games) and comes in at $200 for a 6 core? It means price cuts\n\nAs an investment it's doing poorly. I don't know about you, but up 3% over the last year doesn't seem good. It competes with several companies. I will list their competition\n\nAMD: up 94% since a year ago\n\nTSM: up 57% since a year ago\n\nIt's going to try to compete with NVDA as well, which is also up 134% since a year ago\n\nYou could literally throw a dart at hardware and do better\n\nMU: 12%\n\nSNPS: 46%\n\nASML: 67%\n\nLiterally any company I follow outperformed Intel. Micron is the only one that kind of sucks as well",
        "created_utc": 1595556776,
        "id": "fz1qnxm",
        "score": 3,
        "subreddit": "investing",
        "created": 1595585576.0
    },
    {
        "author": "Furloughedinvester",
        "body": "Wow, the growth on SNPS is crazy. I'll admit I never even heard of them before.\n\nI like TSM. Keep adding to my position",
        "created_utc": 1595354506,
        "id": "fysdp3i",
        "score": 2,
        "subreddit": "stocks",
        "created": 1595383306.0
    },
    {
        "author": "borntoperform",
        "body": "I've been bullish on TTD since 2018. Advertising will always be around as long as businesses exist. And since everything is moving more and more online, digital advertising will be here to stay. The Trade Desk own digital advertising.\n\nI have other ones that I personally like, but I don't hold as strong opinions on them as I do TTD.\n\nSNPS is something I have 5% of my holdings in.\n\nFSLY was recommended to be back in the winter, and I wish I pulled the trigger back then when it was less than $20/share, but I got in at $45, and now wish I put more in.\n\nSQ is a very long play, like 3-5 years. \n\nSTNE is also a long play, they're payment processors specifically in Brazil, and it seems like they own that market down there. I don't expect them to be multi-baggers in 2 years, but it would surprise me if they're multi-baggers in 5 years.",
        "created_utc": 1596167519,
        "id": "fztt6a2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1596196319.0
    },
    {
        "author": "wtf_is_up",
        "body": "Do you have any opinions on EDA tools (CDNS, SNPS)?",
        "created_utc": 1593860492,
        "id": "fww695d",
        "score": 1,
        "subreddit": "investing",
        "created": 1593889292.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "I think NVidia will perform great in the next 5-10 years. Their CEO is incredible and he knows how to innovate and dominate any industry the company is operating in. \n\nRegarding 5G... Skyworks is a great player. I would def look into Lam, KLA, Synopsys and Cadence.",
        "created_utc": 1595557351,
        "id": "fz1rnny",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595586151.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "Been doing some due diligence on Skyworks, Lam Research, KLA Corp, Cadence and Synopsys. All of them look attractive. Any feedback on these companies?",
        "created_utc": 1595087509,
        "id": "fygz0yy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595116309.0
    },
    {
        "author": "MaxandmillionB89",
        "body": "AMD is a very company company which specializes in its specific niche and they are very successful in it. Nvidia is trying to diversify its revenue streams. What do you think of Synopsys, Cadence, Lam research and KLA?",
        "created_utc": 1595595432,
        "id": "fz33xqt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1595624232.0
    },
    {
        "author": "RobKnight_",
        "body": "The snps main goal is to represent the american markets and tell me what company is representative  of the electric vehicle and autonomy market right now. People forget before a couple weeks ago tesla was moving at 2mph while the market was surging. The snp woudnt not add something because its moving to much in a 30 vix market",
        "created_utc": 1596005897,
        "id": "fzlk6ow",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1596034697.0
    },
    {
        "author": "ElectronicFinish",
        "body": "It’s not random article. Synopsys is one of the major CAD and design suppliers for silicon chips. They probably know what their customers are doing with their software. I wouldn’t trust them 100%, but I will give them some credits there.",
        "created_utc": 1595017863,
        "id": "fyeaeix",
        "score": 0,
        "subreddit": "stocks",
        "created": 1595046663.0
    },
    {
        "author": "Dingaling015",
        "body": "Just a few I've come across so far:\n\nDLPN - public offering ends tomorrow, ER expected by end of next week or sooner, already getting pumped by Yates though so caution here.\n\nEROS - Rumored merger announcement with STX, recently been approved so we're all just waiting for a PR. It's already run up quite though (again thanks to Yates lol) so who knows.\n\nThere's also CHFS which has been well enough talked about here but I did not buy so do your own DD. There are also several other COVID plays that people have been talking about but hardly any volume to merit a second look.\n\nBut yeah this week's been meh.",
        "created_utc": 1594243569,
        "id": "fxcu7ou",
        "score": 7,
        "subreddit": "pennystocks",
        "created": 1594272369.0
    },
    {
        "author": "VeggieVendor",
        "body": "Started investing about 3 weeks ago. Made some mistakes but I think my portfolio right now is decent. Any feedback is much appreciated.\n\nABBV - 4 @ 96.73 (99.28)\n\nSPCE - 5 @ 16.07 (16.79)\n\nSTX - 5 @ 50.32 (46.56)\n\nTSLA - 0.1488 @ 1343.25 (1365.88)\n\nNFLX - 1.43131 @ 457.62 (502.78)\n\nFB - 2 @ 212.20 (243.58)\n\nAAPL - 1.32175 @ 359.56 (381.37)\n\nMSFT - 2.51192 @199.49 (212.83)\n\nMCD - 2 @ 186.21 (185.83)\n\nQQQ - 1 @ 255.93 (259.99)\n\nVYM - 3 @ 79.87 (78.90)\n\nI want to slowly increase my holdings in MSFT and NFLX long term, as well as in QQQ.",
        "created_utc": 1594260978,
        "id": "fxdq9u7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594289778.0
    },
    {
        "author": "Rossoneri",
        "body": "&gt;  this sub has really rejected the potential of this stock for no reason\n\nThe reason is that it's got 40M in market cap.  It's a tiny company that does a tiny amount of business.  Your list of \"partners\" paints an overly optimistic picture when it's really more of a list of \"people who buy their products and people who sell products to them\".  The build some specialty computing, nothing really groundbreaking here. \n\nAlso \"Puma\" is one of their brands, it's not their partner.  They might be an interesting company, but the shilling and misleading posts indicate that they are closer to being pump &amp; dump than real quality.\n\n-----------------------------------------------\n\n**For comparison:**\n\n**broadberry.com** Partners: toshiba, seagate, intel, amd, windows, nvidia\n\n**dihuni.com** Partners: lockheed, duke, intel, johns hopkins, NASA, US Navy, FDA, UCIrvine, UCSF\n\n**abmx.com** Partners: microsoft, redhat, western digital, intel, supermicro, vmware, ubuntu\n\nIf anybody claims a company has a \"partnership\" without showing the contract details.  Ignore them.",
        "created_utc": 1594701368,
        "id": "fy08a0s",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1594730168.0
    },
    {
        "author": "andrewchapman17",
        "body": "greenland staring gerald butler by stx entertainment in theaters august 16th, official trailer on youtube has over 7 million views",
        "created_utc": 1594263549,
        "id": "fxdulww",
        "score": 2,
        "subreddit": "stocks",
        "created": 1594292349.0
    },
    {
        "author": "lmmortalMachine",
        "body": "What about data storage companies like Western Digital and Seagate? Always going to need it and more so in this digital age and furthermore.",
        "created_utc": 1594978481,
        "id": "fycedna",
        "score": 1,
        "subreddit": "investing",
        "created": 1595007281.0
    },
    {
        "author": "wambamsamalamb",
        "body": "Going to wait and see if KO, STX, RTX drop some more.\n\nETFs and such, I’m eyeing XLU, ITA, ICLN, FTEC always a good time to add a little of these.\n\nAlso looking at some acq corps but you can’t talk about them here I guess",
        "created_utc": 1594600612,
        "id": "fxvs5mm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594629412.0
    },
    {
        "author": "zomboyashik",
        "body": "STX",
        "created_utc": 1594402241,
        "id": "fxju1uf",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1594431041.0
    },
    {
        "author": "stephenphph",
        "body": "Wasnt this released months ago????\n\n&amp;#x200B;\n\n[https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749](https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749)",
        "created_utc": 1594225434,
        "id": "fxbrmss",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594254234.0
    },
    {
        "author": "ThesisRobot",
        "body": "I didn't see that on the front page, but I have access to the bloomberg terminal, so all official PR's come through my breaking news wire. And all we see is the    \n\n\n\"  \\*CCI APPROVES MERGER OF EROS INTL, STX FILMWORKS, MARCO ALLIANCE \"  that is just the government agency that approves these types of mergers from what I understand. I'd also like to add the CEO has said he will do an announcement on Friday at 11 (not sure what time zone)   \n\n\nSo I am a little confused, I was really hoping for a nice sell the news here.",
        "created_utc": 1594295896,
        "id": "fxex5ab",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594324696.0
    },
    {
        "author": "RichardCabeza",
        "body": "\n\n\nYep they installed back doors on huawei, which is actually one if the reasons they pulled out of the US in 2014.\n\nAccording to the report, the NSA has planted backdoors to access computers, hard drives, routers, and other devices from companies such as Cisco, Dell, Western Digital, Seagate, Maxtor, Samsung, and Huawei.\n\nhttps://www.spiegel.de/international/world/catalog-reveals-nsa-has-back-doors-for-numerous-devices-a-940994.html",
        "created_utc": 1594395033,
        "id": "fxjf83g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594423833.0
    },
    {
        "author": "RichardCabeza",
        "body": "So your point is spying on your own people isnbad but nothing compared to a country using its supply chain to spy on the world right?\n\nYou do know that we spied on our allies including tapping Merkel's phone right?\n\nHeres a quote from Spiegel on the snowden report\n\nNSA has planted backdoors to access computers, hard drives, routers, and other devices from companies such as Cisco, Dell, Western Digital, Seagate, Maxtor, Samsung, and Huawei.\n\nhttps://www.spiegel.de/international/world/catalog-reveals-nsa-has-back-doors-for-numerous-devices-a-940994.html\n\nDo you not know about this and snowden?  Like seriously?\n\nAnd idk how you can make the comment theres no longer back doors.  Its like oh weve only done it 3 or 4 times but for reals weve stopped now.",
        "created_utc": 1594394961,
        "id": "fxjf32q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594423761.0
    },
    {
        "author": "KnightAnthony",
        "body": "Lol, there's a funny and profitable story regarding this company. I had very little idea about this one until I began looking into streaming choices due to COVID stay-at-home orders! I'm a cable cord cutter, but family wanted entertainment. So I compared mainly Netflix with Amazon, but research led me to study Roku.....and only for the remote control ability! I had a great experience with Seagate, and this Roku was giving me a similar vibe. So I took a gamble and bought 150 shares in one of my \"forget-it-about\" brokerage accounts. $10K is usually my starting investment, and I got it around $72 back in March. Again....TOTAL speculation and totally forgot I owned it! And if it weren't for some chatter about it yesterday, I would never had known how much it had appreciated. Lol, my PT was only $100, but when I saw that it was $150, I sold it all! Doubled my money in just a few months on something I wasn't expecting much. Might get back into it, but ROKU is not something I \"love\" so will have to think about it.",
        "created_utc": 1594903175,
        "id": "fy8wkou",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594931975.0
    },
    {
        "author": "TheSuper_Namek",
        "body": "Eros will be probably announce ER after Netflix dropped theirs, eros is like the bollywood Netflix with their Eros now platform and eh they just got  approval from indian goverment to merge with STX entertainment  that is a Hollywood filmmaker they are going international after the merger  and they are dirt cheap right now.. company has potential but management doesn't seem to care about the shareholders",
        "created_utc": 1594869794,
        "id": "fy7tnlk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594898594.0
    },
    {
        "author": "minawarr",
        "body": "I grew up on bollywood movies and we are a bollywood household I will say. Eros has dwindled out of being one of the large production houses in India. The last hit movie it produced was in 2015 (bajirao mastani). I cant even recall any new bollywood music they have produced. \n\nI enjoyed watching the Eros entertainment banner when I was younger, but the scene is alot more competitive than it used to be in India in the 80s and 90s. All the top actors have launched their own production houses and tseries basically rules the music rights. \n\nI'm not sure how the STX merger will pan out. STX is more of a indie based company and  Indians enjoy over the top extravagant movies. Most indie productions don't bring in the box office numbers.",
        "created_utc": 1594273739,
        "id": "fxe9g3t",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594302539.0
    },
    {
        "author": "stephenphph",
        "body": "I saw this from April.....\n\n[https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749](https://www.hollywoodreporter.com/news/stx-merge-indias-eros-international-1290749)",
        "created_utc": 1594225459,
        "id": "fxbroq4",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594254259.0
    },
    {
        "author": "stephenphph",
        "body": "i personally think they are waiting till friday for the PR. i read somewhere that Friday they are doing a live interview about their merger and future associations with apple, youtube, &amp; microsoft.  this stock is massively undervalued. people have been saying $12 PT since talks of a merger last year. there were 2m dark pool buys today. honestly the movies their merger STX has come out with are pretty damn good and if thats the direction of bollywood. this is a good long term hold. sure make some quick profits but def keep some in for long term. i might buy more in the PM tomorrow.",
        "created_utc": 1594263778,
        "id": "fxduzcn",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1594292578.0
    },
    {
        "author": "j33tAy",
        "body": "yup exactly. my covered calls are XLK, XLF, AMD, STX, SRNE and EEM. \n\nIV is high enough that I can make a solid 1% a week selling weekly calls when the stock goes sideways.\n\nlet me know what kinda house you get in 2 years!",
        "created_utc": 1594248465,
        "id": "fxd42g7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594277265.0
    },
    {
        "author": "The_Big_Willy",
        "body": "I have WDC in my Roth IRA. Since you hold STX, let me ask you, does the fact that they’re not diversifying into NAND technology concern you? That’s the only reason I picked up WDC over STX.",
        "created_utc": 1594819262,
        "id": "fy53ms9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594848062.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "They diversified into NAND tech back in 2017. They were severely undervalued compared to WDC at the time, as investors were sleeping on that fact. Personally, I even own a Seagate NVMe SSD.",
        "created_utc": 1594819548,
        "id": "fy543sw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594848348.0
    },
    {
        "author": "Adelphia_",
        "body": "$STX 8/20 50C Earnings Play",
        "created_utc": 1594827589,
        "id": "fy5ja0x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594856389.0
    },
    {
        "author": "Various_Art",
        "body": "These are my predictions do something near it. \nBuy CRESY @ $3.61. An agricultural stock from some South American Country (Argentina). Agriculture is automated and if they are about to be hungry I would prefer you donate the gains to South America.\nThis would be 27.7K shares. If it gains 125% in the next 6 months due to famine you can do well. Also if it reaches $12.5 you can make $346,250. You should obviously diversify.\nTWLO ~$313  Dec. 21, 2020.\n\nBEEEG YOLO RISK\n\nAnytime you write a contract called an option you have unlimited risk. DO NOT WRITE A CONTRACT. \n\nYou will be purchasing a contract. You want something that is out of the money going into the money meaning, it won't look like it is about to make money before the strike date.\n\nCurrently I would suggest a CALL option. I will leave some predictions below for most likely to succeed. You need to buy a few things to get \n\nMMM ~$179 Oct. 30, 2020\nSPY ~$336 Nov. 13, 2020\nCOST ~$340 Oct 16, 2020\n\n\nBEEG Mooon Strat\n\nSTX Call Option ~$60 Nov. 13, 2020\nCACC Call Option ~$555 Aug. 21, 2020\nFOX Call Option ~$35 Jan. 1, 2021\nBBBY Call Option ~$25 Nov. 25, 2020\n\n\nSafe Bet \n\nTL;DR - I suggest a straight purchase of shares.  \nSuch as: JPM @ 99.73 7/15. Hold for 25% gain, unfortunately leaves you at $125,000. \n\nWhatever you do pick something with positive net income for at least 3 years. Has a minimum of 5 M volume or similar Blue chip qualities.",
        "created_utc": 1594864522,
        "id": "fy7ks9d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594893322.0
    },
    {
        "author": "public_instigator",
        "body": "AMD, STX, ADBE, AAPL, DIS",
        "created_utc": 1594877426,
        "id": "fy84kui",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594906226.0
    }
]