[
    {
        "author": "hotsaucefridge",
        "body": "You know what a lot of the offshored roles are in tech?  Shit we don't want to do but don't want to pay for expensive automation alternatives that cost too much for the level of work OR there's some built in issue that makes a person still required.\n\nManual testers, low level QA, and analyst responsibilities can be done in the US, it just isn't worth it.  On the semiconductor side, I/O, physical verification, library design, and application engineers for less sexy products are all roles that can be done here (and still are), but the people here are either aging out, or they're really really good and highly paid with a team to push around in NOIDA.  If it's doable from TI's design site in India, why pay for the H1 to move the guy here.\n\nIf you really think India shuts down, Synopsys might get some business, but I think even their design teams rely on India now.  You could also short Wipro ($WIT), since they're a publicly traded player for offshore tech workers.",
        "created_utc": 1582767708,
        "id": "fivti0u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1582796508.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 19th of February\n\n\n\n## Upcoming events for Wednesday, February 19th\n\n - Expected earnings:\n\n  ACEL, ADI, AG, AGI, ALB, ALSN, AMSF, APLT, APRN, AROC, ATHM, ATNI, AXTI, BCOR, BCOV, BHC, BSGM, CAI, CAKE, CAR, CBD, CDE, CHFS, CIDM, CODX, CONE, CPRT, CRMT, CSV, CTRE, CYBE, CYH, CYRN, CZZ, DISH, DMAC, DNOW, DSSI, DYAI, DYNT, EIG, ELAN, ELGX, ENBL, EQX, ESEA, ESRT, ET, ETR, FARO, FGBI, FIVN, FMS, FOSL, FUN, FVRR, GDOT, GEL, GLDD, GMAB, GPC, GRMN, GVA, H, HCC, HCR, HEP, HNI, HOLI, HST, IAG, IART, IBN, ICLR, IDYA, IMAX, INOV, IRET, IVR, JACK, JAKK, JBT, JMP, KALU, KL, KLDO, KREF, LAND, LASR, LILA, LOPE, LPL, LSI, LYG, MANT, MASI, MCRI, MESO, MGY, MIRM, MIST, MNOV, MOS, MSA, MX, NDSN, NE, NESR, NHI, NOA, NTES, NVTA, O, OC, OGS, OIS, ONE, OR, ORCC, OSUR, OSW, OVV, PAAS, PBR, PE, PRDO, PRTH, PSNL, PSTI, PTSI, PXD, QTWO, RBBN, RETA, RLMD, RPT, SAH, SAM, SBLK, SEDG, SLGG, SM, SMP, SNBR, SNPS, SONM, SP, SPN, SPTN, SREV, SSW, STMP, STNG, SUI, SUN, SUPV, THRM, TKC, TMDI, TMDX, TRN, TRNO, TS, TSLX, TVTY, UAN, UCTT, UFPI, UGP, VIPS, VIV, VMI, VNDA, VPG, VXRT, WING, WMB, XEC, Y, ZG\n\n - Ex-div:\n\n  ADTN, ALV, BGH, CNP, CPTA, CSL, DAL, DFS, DMB, ESXB, EXC, FCBP, GFF, HTBI, IGR, KMF, KYN, LFUS, LTC, MAIN, MSFT, PACW, PHX, PLT, RECN, SBSI, SHBI, SUNS, THQ, THW\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 6.000M)\n    - Building Permits (consensus: -0.1%, previous: -3.7%)\n    - Building Permits (consensus: 1.450M, previous: 1.420M)\n    - Core PPI (consensus: 0.1%, previous: 0.1%)\n    - Core PPI (consensus: 1.3%, previous: 1.1%)\n    - FOMC Meeting Minutes\n    - FOMC Member Barkin Speaks\n    - FOMC Member Bostic Speaks\n    - FOMC Member Kaplan Speaks\n    - FOMC Member Kashkari Speaks\n    - FOMC Member Mester Speaks\n    - Housing Starts (consensus: -30.7%, previous: 16.9%)\n    - Housing Starts (consensus: 1.425M, previous: 1.608M)\n    - MBA 30-Year Mortgage Rate (previous: 3.72%)\n    - MBA Mortgage Applications (previous: 1.1%)\n    - MBA Purchase Index (previous: 267.4)\n    - Mortgage Market Index (previous: 689.5)\n    - Mortgage Refinance Index (previous: 3,123.6)\n    - PPI (consensus: 0.1%, previous: 0.2%)\n    - PPI (consensus: 1.6%, previous: 1.3%)\n    - Redbook (previous: -0.7%)\n    - Redbook (previous: 4.8%)\n\n## Upcoming events for Thursday, February 20th\n\n - Expected earnings:\n\n  AAN, AAWW, ACIA, ACRE, ADC, ADSW, AEP, AERI, AGTC, AIRG, AIRI, AKS, AMAG, AMSWA, ANIK, APPN, APRE, ARD, ARR, ASPN, ATR, AYTU, BAND, BAX, BBIO, BEAT, BJRI, BLDR, BLU, BLUE, BOOM, BRC, BVN, BYD, CAMT, CASA, CATM, CBZ, CENX, CERC, CERS, CGEN, CIB, CLF, CNDT, CNSL, COG, COLD, COMM, COT, CTXR, CUBE, CVA, CWST, CYTK, CZNC, DBX, DCO, DPZ, DRH, EBS, ED, EGO, EHTH, ENV, EPAM, EQM, ES, EVRG, FIT, FIX, FND, FOCS, FSLR, FSLY, FULC, GASS, GIL, GLOB, GLPI, GMED, GOL, GSBD, HASI, HBM, HEES, HFC, HPP, HRL, HSIC, HTGC, I, IDA, IDCC, IGMS, IMAC, INT, IOTS, ITGR, JRVR, KBR, KNSL, KRTX, LAMR, LKQ, LLEX, LNT, LTC, LTHM, LXP, MBRX, MCS, MD, METC, MFA, MFG, MMI, MR, MUX, NBEV, NBR, NBSE, NCLH, NCMI, NEM, NGHC, NKSH, NUVA, OEC, OLED, OMN, ONVO, OPI, ORAN, ORC, PAC, PBYI, PCRX, PDSB, PEB, PLSE, PPC, PQG, PRA, PRAH, PZG, RCM, RGEN, RMAX, ROG, RS, RWT, SATS, SBAC, SBGL, SCL, SEEL, SEM, SFM, SGC, SHLX, SIX, SLRC, SNN, SO, SSRM, STFC, STOR, SUNS, SWM, SYNH, TCP, TEF, TEN, TFX, TGB, THTX, TMST, TNC, TPCO, TRGP, TRUE, TRVI, TRWH, TV, TXMD, TXRH, UEIC, UIHC, UNT, VC, VIAC, VICI, VIE, VIST, VTR, WIX, WK, WRTC, XCUR, XFOR, ZIXI, ZS, ZVO\n\n - Ex-div:\n\n  ACP, ADES, AGD, AMAL, AOD, ARDC, ASC, AVA, AWP, BGB, BGX, BSL, BWG, CCL, CEM, CMI, CPSI, CTR, CUK, DEX, DFP, DMO, EEX, EFF, EFR, EFT, EHI, EMD, EMO, ENR, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EVG, EVT, EXD, EXG, FFC, FLC, FMN, FNWB, GDO, GFY, GSK, HCAP, HCI, HFRO, HGLB, HIE, HIO, HIX, HSY, HWKN, HYI, IGI, IP, KLAC, LB, MAC, MCHP, MIXT, MMU, MSCI, MTT, NDP, NHF, NTG, OCCI, OGS, PFD, PMD, PPG, RXN, SBI, SBT, TEL, TER, TKR, TPZ, TTP, TYG, UL, UN, USLM, VNOM, WD, WEA, WIA, WIW\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 1.560%)\n    - 8-Week Bill Auction (previous: 1.565%)\n    - Continuing Jobless Claims (consensus: 1,720K, previous: 1,698K)\n    - Crude Oil Imports (previous: 0.806M)\n    - Crude Oil Inventories (consensus: 3.767M, previous: 7.459M)\n    - Cushing Crude Oil Inventories (previous: 1.668M)\n    - Distillate Fuel Production (previous: -0.139M)\n    - EIA Refinery Crude Runs  (previous: 0.048M)\n    - EIA Weekly Distillates Stocks (consensus: -1.667M, previous: -2.013M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.7%, previous: 0.6%)\n    - Gasoline Inventories (consensus: 0.500M, previous: -0.095M)\n    - Gasoline Production (previous: -0.662M)\n    - Heating Oil Stockpiles (previous: -0.046M)\n    - Initial Jobless Claims (consensus: 210K, previous: 205K)\n    - Jobless Claims 4-Week Avg. (previous: 212.00K)\n    - Natural Gas Storage (previous: -115B)\n    - Philadelphia Fed Manufacturing Index (consensus: 12.0, previous: 17.0)\n    - Philly Fed Business Conditions (previous: 38.4)\n    - Philly Fed CAPEX Index (previous: 32.90)\n    - Philly Fed Employment (previous: 19.3)\n    - Philly Fed New Orders (previous: 18.2)\n    - Philly Fed Prices Paid (previous: 22.10)\n    - US Leading Index (consensus: 0.4%, previous: -0.3%)\n\n## Upcoming events for Friday, February 21st\n\n - Expected earnings:\n\n  ASIX, B, BBX, BCPC, CFX, CMLS, CNK, CNNE, CYOU, DE, DSX, E, ERF, GFI, GNLN, HDB, HMSY, HSC, INMB, ITT, MGA, PIXY, PNW, RUTH, RWLK, RY, SOGO, SOHU, SPR, TECK, VAL, VNTR, WBC, WPC, ZEUS\n\n - Ex-div:\n\n  AB, AIZ, ATO, BCC, CNA, DX, FGB, FHB, GER, GMZ, HFC, HNI, HNNA, HR, KELYA, KELYB, LSBK, MFD, MKSI, NATH, NLOK, NOC, PAG, PFIN, PPT, PRI, RDN, REG, SNA, TSCO, WELL\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: -75.1K)\n    - CFTC Copper speculative net positions (previous: -34.3K)\n    - CFTC Corn speculative net positions (previous: 52.6K)\n    - CFTC Crude Oil speculative net positions (previous: 397.4K)\n    - CFTC Gold speculative net positions (previous: 299.8K)\n    - CFTC Nasdaq 100 speculative positions (previous: 21.3K)\n    - CFTC Natural Gas speculative net positions (previous: -246.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 46.1K)\n    - CFTC Silver speculative net positions (previous: 67.8K)\n    - CFTC Soybeans speculative net positions (previous: -19.8K)\n    - CFTC Wheat speculative net positions (previous: 48.4K)\n    - Existing Home Sales (consensus: -1.8%, previous: 3.6%)\n    - Existing Home Sales (consensus: 5.43M, previous: 5.54M)\n    - FOMC Member Brainard Speaks\n    - FOMC Member Clarida Speaks\n    - FOMC Member Kaplan Speaks\n    - FOMC Member Mester Speaks\n    - Manufacturing PMI (consensus: 51.5, previous: 51.9)\n    - Markit Composite PMI (previous: 53.3)\n    - Services PMI (consensus: 53.0, previous: 53.4)\n    - U.S. Baker Hughes Oil Rig Count (previous: 678)\n    - U.S. Baker Hughes Total Rig Count (previous: 790)\n\n^^^^2020-02-19",
        "created_utc": 1582110013,
        "id": "fi3b770",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1582138813.0
    },
    {
        "author": "WrongTechnician",
        "body": "The Friday before MLK day was [GREEN](https://finance.yahoo.com/quote/SNPS/history/)",
        "created_utc": 1581658642,
        "id": "fhjxgfr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581687442.0
    },
    {
        "author": "borntoperform",
        "body": "I'm subscribed to the Motley Fool newsletter simply as a starting point to do my own research on companies. Because of that site, it's been a net positive. I've learned about The Trade Desk, Synopsys, and Zoom, all of which have been incredibly profitable. \n\nI just got a new email about some upcoming webinar next week for 5 new companies that show potential to be some of next FAANG stocks. Motley Fool is calling them FAZER, but they haven't released the names of the companies. So I decided to once again do my own research, and I figured them out:\n\nF - Fastly\n\nA - Appian\n\nZ - Zoom\n\nE - Elastic NV\n\nR - Roku\n\nZoom and Roku are just about the closest to household names, without being actual household names like Netflix/Google/etc. The other three, before researching what these companies were, I had never heard of them. Appian seems pretty interesting after doing 30 minutes of research in them. Fastly and Elastic seem like pie-in-the-sky companies by Motley Fool.",
        "created_utc": 1582827067,
        "id": "fixutut",
        "score": 1,
        "subreddit": "investing",
        "created": 1582855867.0
    },
    {
        "author": "Draymondwonrings",
        "body": "I have Synopsys on a watch list because I think their EDA software, intellectual property, and positioning in the semiconductor industry is a big positive. I want to believe their floor is higher than Alibaba's, while Alibaba's ceiling is higher. If I wasn't already balls deep in TTD/MSFT/SHOP/ENPH/V, or if I had more money to invest, I would strongly consider SNPS, as well as Zoom or Hubspot.",
        "created_utc": 1581008620,
        "id": "fgpnzor",
        "score": 1,
        "subreddit": "investing",
        "created": 1581037420.0
    },
    {
        "author": "choohooZ",
        "body": "A lot of these positions have ran up big this past week but have a lot more juice left in them I believe. Sold most pictured above to lock in gains and only holding a few remaining. \n\n&amp;#x200B;\n\n* 55 TAN 4/17 $35 Calls - Solar energy ETF, this space is going to the fucking sun, thinking of doing a separate DD piece on a few of my favorite companies (Scatec Solar/Enphase) \n* 35 XLK 6/19 $105 Calls - S&amp;P Technology ETF. MSFT and AAPL each hold 20% of the index weight (40% in aggregate) so this position has seen massive upside with MSFT huge run up (thanks algo's). My price target is $120 by that time where these contracts will be worth $83,000. Currently trading around $2.75 my cost basis $1.20\n* 1 SPX 3/20 $3300 call - bought this right at the dip on Jan 31st around 3:55pm when all the markets dropped crazy. One of my best trades yet I timed the bottom literally perfectly. Wish I loaded up more will probably be selling the first week of march depending on macro environment \n* MSFT gains was from selling put spreads that expired last week. Think i might start doing this again but it takes up a lot of margin as collateral\n* SHOP gains was all through stock which I sold last week, wish I held through today but can't win them all. SQ same story sold the stock last week before earnings to capture my \\~20% gain\n* TLT I had call options which I might pick up again. Acted more as a hedge to macro environment as this is an ETF which tracks US 20yr + bonds. Sold them once I saw the macro environment turn bullish, luckily made some good money in the process\n* SNPS was an earnings play which turned out to be profitable, bought calls and sold them shortly after the stock popped. ZS was all stock position which I entered back in December, ran up quite a bit at the beginning of the year sold I sold \n\nSo far I'm up \\~100% in 2020. Was up \\~42% in 2019 but only started trading in July",
        "created_utc": 1581560352,
        "id": "fhg7hz5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1581589152.0
    },
    {
        "author": "kanebucha",
        "body": "There's actual OI on SNPS 3/20 calls between 150-175^(lol). Wrapped up in ODP so I can't act on it but it's nice to daydream",
        "created_utc": 1582355846,
        "id": "ficsb4h",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1582384646.0
    },
    {
        "author": "Zzrott1",
        "body": "Made out good on ALLY today. Not so confident about what I just bought before close. 3/20c on SNPS, FSLY, and AVYA",
        "created_utc": 1582232722,
        "id": "fi83g0o",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1582261522.0
    }
]