[
    {
        "author": "yiqinglee",
        "body": "Yup learnt my lesson. Wrote them down to remind myself during the next crash. \n\n1. **Don’t sell.** Unless you are able to predict the top and bottom, selling would mean you make a loss and miss out when the market rebounds. I made the mistake of selling PayPal at a loss, thinking I would switch my funds to buying Microsoft, which was doing well with their video conferencing app. At the time, PayPal was slow moving compared to the other tech companies. I sold PayPal and did not manage to get into Microsoft early enough to ride the gains. As a result, I not only missed out on the opportunity on Microsoft, I missed out my gains for PayPal had I held. PayPal has since gained 20% from my average price. \n\n2. **Don’t panic, average down.** During a crisis, don’t panic! (I know, easier said than done) Determine value of the stock and its fundamentals. If the fundamentals are still intact, ignore the noise and just average down. Divide your spare cash in 3 pockets. Every time the stock drops 10%, buy in. The economy will eventually recover and this is how you make use of the opportunity to make high returns. \n\n3. **Follow the trend.** The market may not always make sense. During this crisis, despite rounds of weak economic data (unemployment, GDP decline etc.), the market has rallied 25%. Follow the trend, ride the wave, don’t try to go against it. Shorting this market will only hurt you. Don’t fight against the Fed.",
        "created_utc": 1591508602,
        "id": "ft8rj2c",
        "score": 17,
        "subreddit": "stocks",
        "created": 1591537402.0
    },
    {
        "author": "indoiranian",
        "body": "👍🏼Grateful 👊🏼if 👆🏻those buying puts ❌could just PayPal 📲me their money 🙌🏼💰💯✅",
        "created_utc": 1591735029,
        "id": "ftij3fh",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1591763829.0
    },
    {
        "author": "Kidault",
        "body": "I use Robinhood exclusively for tech and fintech stock options since I'm fimiliar with them. I buy 2-5k worth of calls that expire 1+ year out then hold and sell when appropriate. \n\nMost people want to play options in the short term but long term gains are more reliable. General rule stocks tend to increase over time. I lurked /wallstreetbets for a good year then unsubbed because it's a bunch of circlejerking twats. But I did learn not to yolo gamble my cash for quick tendies and FDs. \n\nE.g. Saw American Express was down 40 points and volatility was low and bought two calls last week. Now the option expires next year and it's already around an 86% gain.\n\nI have a 250% gain on PayPal buying last Dec with a break even price of 116. It is now around 155.\n\nAll my options were worthless during March but have since recouped. Didn't panic sell.\n\nI also have stocks but use TDAmeritrade for that exclusively.",
        "created_utc": 1591743452,
        "id": "ftizvc8",
        "score": 9,
        "subreddit": "RobinHood",
        "created": 1591772252.0
    },
    {
        "author": "RADIOKALI",
        "body": "What are some examples of his failures? \n\n&amp;#x200B;\n\nZip2 - Musk received US$22 million for his 7 percent share from the sale\n\nX.com and PayPal - In October 2002, PayPal was acquired by [eBay](https://en.wikipedia.org/wiki/EBay) for US$1.5 billion in stock, of which Musk received US$165 million",
        "created_utc": 1591679475,
        "id": "ftg48ai",
        "score": 8,
        "subreddit": "stocks",
        "created": 1591708275.0
    },
    {
        "author": "RADIO02118",
        "body": "These are the only earnings plays that worked for me this season. TSLA, CRWD, PYPL. Therefore it is of my opinion, that these 3 tickers will keep making new highs continually, forever.",
        "created_utc": 1591137735,
        "id": "fsop5pb",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591166535.0
    },
    {
        "author": "Nickjersey",
        "body": "yeah want a fun gamble?\n \nsend $10 to my paypal, I will either keep it or send you $20 back\n \nhint: I will keep it\n \nlmk if you want my paypal",
        "created_utc": 1591145865,
        "id": "fsp3y2r",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591174665.0
    },
    {
        "author": "Abe_Simpsons",
        "body": "Maybe daddy transfer $500 to my PayPal and you get a picture of whatever is down there uwu",
        "created_utc": 1591622559,
        "id": "ftd7uwe",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1591651359.0
    },
    {
        "author": "04729_OCisaMYTH",
        "body": "Hey it’s your dads boyfriend, PayPal me some cash.",
        "created_utc": 1591658042,
        "id": "ftf558e",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591686842.0
    },
    {
        "author": "GranAutismo92",
        "body": "Started with 2k, up 22k, got a good deal for the watch so I bought it, LULU, ATVI, PAYPAL, MAXR all triple baggers, csco and DIS 67% , 74%",
        "created_utc": 1591065101,
        "id": "fsle5jj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591093901.0
    },
    {
        "author": "PaperShark0001",
        "body": "I ran out of settled funds for the day, who tryna place some paypal bets 👁👄👁",
        "created_utc": 1591293789,
        "id": "fsvua9f",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1591322589.0
    },
    {
        "author": "BigEd781",
        "body": "&gt;Tesla, check.\n\n&gt;SpaceX, check.\n\n&gt;Starlink now, check.\n\nTwo of those don't belong... hey, Musk was also the CEO of PayPal. Should PP's stock price be correlated to Tesla's somehow as well?\n\n\n&gt;While not sounding like an outright fanboy of their products (hell, I don't even own a Tesla....) why isn't the stock price higher?\n\nBased on what? Your feelings? Let's see the math.",
        "created_utc": 1591209392,
        "id": "fsrvwel",
        "score": 4,
        "subreddit": "stocks",
        "created": 1591238192.0
    },
    {
        "author": "dvdmovie1",
        "body": "Nvidia, Twilio, Shopify, Wix, ServiceNow, Microsoft, Datadog and many others. Even those that are ad-reliant have bounced considerably. Trade Desk up another 11% today and is now more than 2x since early April. Car sales were considerably better than expected in May (https://www.autoblog.com/2020/06/02/may-2020-us-auto-sales/), which sent Carvana up big yesterday. Security? Okta had a very good quarter the other day, Crowdstrike yesterday. Visa said two days ago that trends continue to improve, Paypal said April was the best month since its IPO.\n\nSome emerging markets tech names doing well. Look at SE +117% YTD. MELI +40%\n\n Google and Facebook suffered from ad spending on things like travel being down (Booking and Expedia spend a fortune on Google ads - Expedia's chairman noted \"“At Expedia, for instance, we spend $5 billion a year on advertising. We won’t spend $1 billion on advertising probably this year.\" A couple of years ago, Booking spent a billion on Google ads in the quarter (https://www.cnbc.com/2018/11/05/travel-giant-booking-spent-1-billion-on-google-ads-in-the-quarter.html.) So those companies are uniquely effected, but things have improved as Facebook noted on their conference call. Google may have suspended some spending recently, but they announced the other day that employees who choose to work from home can expense a grand worth of office furniture. https://nypost.com/2020/05/26/google-will-let-workers-expense-1000-worth-of-office-furniture/\n\nWork from home has certainly done well too, but if that becomes a bigger part of culture going forward to some degree, that becomes a long-term theme. Remote work - look at RNG, ZM, FIVN.  Look at telehealth - Teladoc has done well this year but Livongo +145% YTD. Look at CDN names like FSLY, which is +150% YTD/NET +71%",
        "created_utc": 1591215030,
        "id": "fss86wn",
        "score": 4,
        "subreddit": "investing",
        "created": 1591243830.0
    },
    {
        "author": "nyWP",
        "body": "Make it shorter, we can’t read such long posts.\n\nBut I did. You have some point.\n\nJust to be clear, market cap:\n1) PYPL - $182B\n2) V - $425B\n3) MA - $302B\n4) AXP - $86B\n\nI don’t know autists, this isn’t an option play for me.",
        "created_utc": 1591310169,
        "id": "fswt1o5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591338969.0
    },
    {
        "author": "YER-A-WIZARD-HARRYY",
        "body": "SPCE $25 this week! \n\nBuy shares or calls on the next dip and paypal me 10% later.\n\nSource: https://investorplace.com/2020/06/virgin-galactic-spce-stock-spacex-success/\n\nAlways inverse what media say if you want to profit.",
        "created_utc": 1591654160,
        "id": "ftexw1b",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591682960.0
    },
    {
        "author": "1monster90",
        "body": "You shouldn't invest money you can't afford to lose. Personally, money in the stock market is money I am considering nonexistent until 2045.   \nDon't be greedy but don't be cynical either. I think you could really benefit from making a list of interesting stocks. And from that list try to pick at least 10 stocks that you find promising and buy. Even if it's just 1 share (that way you will be focused on these companies, it's not so much to make a profit than making yourself focus and research these companies. I find it easier to focus on stocks I have at least one share with that stocks I don't own at all).  \n\n\nHere is my list of shares I'm watching carefully, feel free to research it.  \nMSFT, V, MA, NKE, NTDOY, LOGI, SPXL, TQQQ, DOCU,  TRIP, ALGN, F, GME, APPL, NFLX, SBUX, LUV, HS, AMZN, AAL, TMUS, PG,  INTC, QCOM, PYPL, T, ATVI, RSG, FDM, AXP, CSCO, TGT, PLSE, TROW, ORCL,  FDX, CUBE, BABA, CTAS, ALK, JNJ, LLY, CB, NEE, FANG, GAMR, TWLO, TNA,  LABU, FAS, CTRE, PEP, EBAY, DFS, GE, SNQP, MS, RF, AMG, HIG, BR, BEN,  ZNGA, COR, WWE, WYNN, VT, VTI, ELY, ADBE, SQ, TWTR, CVS, CRSP, QQ, NDLS,  WU, MTRX, PUTW, TECL, GM, NYMT, MU and NDAQ .",
        "created_utc": 1591285099,
        "id": "fsvbk0t",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1591313899.0
    },
    {
        "author": "escootme",
        "body": "I watched a 60 Minutes episode on Elon as it aired maybe 8-9 years ago (on TV, what's that?), and I remember thinking his answers were very well-thought-out, structured, and logical. They were grounded and not filled with hyperbole, and he appeared to be thinking deeply on the questions (even the 'simple' ones) and answering them in a concise but sufficient manner -- what you would expect from a good engineer rather than a salesman.\n\nI also remember looking him up and following his path from Tesla to SpaceX to PayPal/X.com. So here you had someone who was extremely ambitious, highly intelligent, but also knew how to deliver. He thinks bigger picture and ahead of the curve. That's what I value most in founders, and I think engineers make the best founder/CEOs because engineers are logical and no bullshit.\n\nIt's extremely rare to find that mix of ambition, intelligence, and engineering mindfulness. Is he a good human being? I don't know. His impact on humanity has probably been net positive so far. He has his views and opinions that don't necessarily align with mine, but some of his big ideas do.\n\nIn contrast when watching the Trevor Milton interview last week, the things that struck me were:\n\n1. \"be in the current/things are easy\" ... This is the exact opposite of what it's like to be visionary imo. The toughest problems are extremely difficult, and if people just took the easy path, we'd have very little real progress in the world. This is mostly a copycat mentality. There's a 'current' because someone else has already busted open the dam.\n2. comparing his previous company with Amazon ... Anyone who describes their business as \"it's like Amazon but\" gets a thumbs down from me. It's a total namedrop cop-out, and then he says something like \"we didn't know what we had at the time\" as the reason they failed I'm guessing? Pretty lame answer, and it completely misses the distinguishing factor for Amazon's success vs. everybody else from the early years. They didn't just sell books; they mastered supply chain. Again, just shows really short-sighted thinking and misguided analysis imo.\n3. he doesn't come off as brilliant to me ... Seems like a nice enough guy and isn't stupid, but that's not really enough for me to be wowed. A lot of his advice is typical and cliche. I almost groaned aloud when he said something to the effect of starting Nikola Motor because he wanted to turn something ugly into something sexy.\n4. generic hyperbole and what? ... He talks about easily getting world-class people because of how sexy his company is, and I feel it's just sales-pitchy associating with something that's supposed to be impressive (CEOs and presidents, billion-dollar companies, etc.). He also says the Nikola Motor logo is a hexagon with six angles because he teaches that there are six ways to look at everything. But then he doesn't explain what those six angles are. Why six? Why not eight? Sixteen? Thirty-two? Maybe there's actually a reason for six, but it comes across to me as a half-baked retrofitted narrative. That logo is generic as shit, and I doubt he was adamant it had to be a hexagon. It wouldn't surprise me if it was done somewhere like 99 designs.\n\nAnyway, that was a lot more than I intended to write. I might just be grumpy because I missed out on the huge upswing, but that was my thought process for cutting out early last week. Maybe they can still be successful as a copycat, but they're being valued as an innovator. Best of luck if you're in it!",
        "created_utc": 1591745489,
        "id": "ftj3mge",
        "score": 3,
        "subreddit": "investing",
        "created": 1591774289.0
    },
    {
        "author": "Legitimate-Assistant",
        "body": "This would be a misconception.\n\nVisa and Mastercard do still profit yes, but Square is a gateway+merchant acquirer type of package. Typically all merchants using Square will be using the specific processor and merchant acquirer that is Squares. This means, the fees charged to merchants for transaction processing will be going to Square, who then will pay Visa their share.\n\nThe whole system is broken to separate pieces where everyone gets a share.\n\nThere are gateways, which let people submit transactions to processors.There are processors, who process the transactions and communicate between gateways, merchant acquirers, and the card holders card issuing bank.\n\nThere are merchant acquirers who basically act as the bank for the merchant is primarily the one liable for funding transactions to the merchant, and receiving incoming funds from transactions. The Merchant Acquirer and the Card Issuing banks are where the money is actually moving.\n\nThe card issuing bank is Chase, or your credit union, whatever bank actually issued the credit/debit card in use.\n\nAnd there are the card network providers, Visa, Amex etc.. who get money because all of it is running on their services.\n\nAnd in this mix and match are some companies that do one or all parts of the roles.  \n\n\n  \nLong story short, all of financial digital services get their cut, and really they are all fighting to see who gets the most customers to have the biggest cut. Like every other business. But Visa, Mastercard, Amex, are not quite the same as Square, Paypal, etc... As currently all credit and debit card services operate off of the card services network infrastructure that those companies have implemented.",
        "created_utc": 1591474501,
        "id": "ft6ge4p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591503301.0
    },
    {
        "author": "Jetisfly420",
        "body": "Sold PYPL at 4.00 instead of 8.00 \nSold DE at 2.0 instead of 6.00 \nSold SWBI at a loss instead of 4.00 profit \nI really suck at timing when to take take profits",
        "created_utc": 1591152669,
        "id": "fspfta4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591181469.0
    },
    {
        "author": "Tiaan",
        "body": "FOMO too much. Going all in on the following:\n\nAMZN, TSLA, MA, V, AMD, DIS, CMG, TGT, KR, PYPL\n\nMay mango have mercy on my soul",
        "created_utc": 1591200394,
        "id": "fsrcic4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1591229194.0
    },
    {
        "author": "soliloquilee",
        "body": "PayPal weeklies.",
        "created_utc": 1591232379,
        "id": "fst6p2e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591261179.0
    },
    {
        "author": "Solvent_Trapped",
        "body": "Yeah but the recent spike is tied to the visa spending report... and retards think that spending was on small businesses using square while all small businesses were closed?  Wait until they find out all that shit was PayPal and credit cards on amazon and Walmart.com.  Square will come back but it looks like it came back too big and too soon for all the wrong reasons lol.  I sold at $89 and I’m going to wait for the inevitable correction. Rather than gamble on the spike continuing to... spike.",
        "created_utc": 1591467378,
        "id": "ft5pscm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591496178.0
    },
    {
        "author": "AlexValleDoesCocaine",
        "body": "MSFT, AAPL, AMZN, GOOG, CRM, MA, V, CCI.\n\nDOCU, AYX, SQ, PYPL, CDNS, XLNX, TER.\n\nTDOC, CRNC, ALRM, LITE.\n\nFree reveal of one \"top\" stocks: https://imgur.com/a/FKAPgzc. \n\n[Shh.](https://imgur.com/a/nhAfyA2) Don't Tekashi 6ix9ine this thread.",
        "created_utc": 1591320595,
        "id": "fsxc5a8",
        "score": 2,
        "subreddit": "investing",
        "created": 1591349395.0
    },
    {
        "author": "Linkk_93",
        "body": "I think it's all via their tencent apps.\n\n Tencent provides pretty much everything there. just look at the Wikipedia page, Facebook, PayPal, messenger, even all the games, they have an equivalent. \n\nthey own Riot (League of Legends), Epic (Unreal Engine, Fortnite), have stakes in many more smaller companies and their own gaming department.\n\nso they know whenever you're wasting your time playing games...",
        "created_utc": 1591518160,
        "id": "ft91rrz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591546960.0
    },
    {
        "author": "AcceptableLength8",
        "body": "PAYPAL, ROKU, APPLE, MSFT, DOCU, AMD calls and NASDAQ leading....PLEASEEE just let me get out of them tomorrow",
        "created_utc": 1591582088,
        "id": "ftbu707",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591610888.0
    },
    {
        "author": "OrganicBerries",
        "body": "Wait wtf PayPal went from 99$ to all time highs in a month",
        "created_utc": 1591197651,
        "id": "fsr6okb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591226451.0
    },
    {
        "author": "avelak",
        "body": "EVRI coming back from the fucking dead\n\nWas down like 15% AH, now basically flat\n\nDoesn't seem like it'll pull a PYPL though",
        "created_utc": 1591133073,
        "id": "fsofqii",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591161873.0
    },
    {
        "author": "callmekizzle",
        "body": "Just PayPal me 30k instead. Hell Just PayPal me 10k instead.",
        "created_utc": 1591137042,
        "id": "fsonsuf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591165842.0
    },
    {
        "author": "cobrauf",
        "body": "Check the Google trends on paypal and venmo, I wouldn't recommend shorting",
        "created_utc": 1591312571,
        "id": "fswxoxr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591341371.0
    },
    {
        "author": "banuntil",
        "body": "i went all in on 150p 6/26 on PYPL. theres got to be a correction right??",
        "created_utc": 1591236113,
        "id": "fstdd3z",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591264913.0
    },
    {
        "author": "whammyyy",
        "body": "I’d be careful with PayPal puts because of Venmo and the increase of online sales on other sites due to Covid",
        "created_utc": 1591289803,
        "id": "fsvlmod",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591318603.0
    },
    {
        "author": "steatorrhoea",
        "body": "Tesla actually made products and had proven tech. And who tf is Trevor Milton? Just because you’re loud like Elon on twitter doesn’t make you a fucking genius. Both the tech and the ceo is unproven lmao. Y’all getting finessed\n\nAt least Elon proved he can succeed with PayPal and spent his own hard cash on Tesla",
        "created_utc": 1591230427,
        "id": "fst35zb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591259227.0
    },
    {
        "author": "mynameisjacky",
        "body": "lol lets hope gme pulls a pypl",
        "created_utc": 1591733996,
        "id": "ftigxyr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591762796.0
    },
    {
        "author": "zdonkeyspeaks",
        "body": "Hello there. Yes, some stocks are great!! You have a few good ones there. But some good Tech/ more consumer plays.  Ex.  AAPL PYPL NKE SQ CRM are some. Good luck!",
        "created_utc": 1591137798,
        "id": "fsopa7h",
        "score": 2,
        "subreddit": "investing",
        "created": 1591166598.0
    },
    {
        "author": "excadedecadedecada",
        "body": "\"Tariffs on Amazon, Tesla, Mastercard, Visa, Su Bae, Disney, Chipotle, Target, Kroger and Paypal! Effective immediately!!\"",
        "created_utc": 1591200470,
        "id": "fsrco5q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591229270.0
    },
    {
        "author": "Bramptonboy",
        "body": "I was reading up on SQ and contemplating buying some shares. Why do you think it'll disrupt the financial industry? In terms of Paypal, I think either MA or V will outperform it this decade; any thoughts?",
        "created_utc": 1591154260,
        "id": "fspiiuc",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591183060.0
    },
    {
        "author": "giant_g2",
        "body": "I like PayPal better than square, but I don't own either. PayPal is used all over the internet and they own venmo. It seems like square is very niche.",
        "created_utc": 1591615415,
        "id": "ftcydus",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591644215.0
    },
    {
        "author": "high4days420",
        "body": "So many i can’t even really name em all. Facebook square earnings. PayPal earnings. Activision earnings. AAXN. Spy 310c. MVRL. CSOD. INO. Qcom. Bud. List goes on",
        "created_utc": 1591203400,
        "id": "fsriv6t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591232200.0
    },
    {
        "author": "veganfreundlich_org",
        "body": "yeah please lets share my losses. do you have paypal?",
        "created_utc": 1591302853,
        "id": "fswdwi7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591331653.0
    },
    {
        "author": "zdonkeyspeaks",
        "body": "Very good, I’m just trying to give you my thoughts. And you do have a lot of good companies there, but I would invest for the longer-term by putting money in strong companies within strong sectors or trade the trends. NKE, SBUX, AAPL, MSFT, PYPL, AMZN etc.",
        "created_utc": 1591327848,
        "id": "fsxohk7",
        "score": 2,
        "subreddit": "investing",
        "created": 1591356648.0
    },
    {
        "author": "sugdipy",
        "body": "I’ve been preparing to go back to work over the past few weeks and honestly forgot I went in after reading your DD. Checked today and to say I was surprised would be hugely understated. I need to get my PayPal going again and I can’t think of a better reason why... thank you sir!",
        "created_utc": 1591676214,
        "id": "ftfztu8",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1591705014.0
    },
    {
        "author": "njconnect",
        "body": "Waiting on the Dip. I see eBay hitting 70 by the end of the year solely because people are shopping more online and that wont stop.\n\nSecondly, they are cutting out Paypal gradually through their intermediate payment system where transactions start and end with ebay, no paypal. Ebay is requiring every seller to have this system and it will be enforced by end of this summer.",
        "created_utc": 1591641147,
        "id": "fte7jqu",
        "score": 2,
        "subreddit": "stocks",
        "created": 1591669947.0
    },
    {
        "author": "mxxdude",
        "body": "PayPal it to someone have them PayPal back to you",
        "created_utc": 1591649451,
        "id": "fteohxc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1591678251.0
    },
    {
        "author": "pocketcthulhu",
        "body": "sure thing, paypal me some cash and i'll buy more.",
        "created_utc": 1591305803,
        "id": "fswk804",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1591334603.0
    },
    {
        "author": "2gurleys1kupp",
        "body": "why those cunts at PYPL being gay today?",
        "created_utc": 1591022055,
        "id": "fsj2ob2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591050855.0
    },
    {
        "author": "UltimateRewards",
        "body": "Amazon, activision, ebay, paypal of SE asia. Blew out earnings report and still low market cap compared to growth potential. What's not to like.",
        "created_utc": 1591033349,
        "id": "fsjomjj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591062149.0
    },
    {
        "author": "csklmf",
        "body": "If your financial goal is for long term, hold for a little while and see how it goes. But I gotta say it’s too early to tell if Nikola is the next tesla. Nikola is still at a very early stage of business..... nothing is clear yet. Business owner of Nikola also does not have successful past business building history like Elon with PayPal.",
        "created_utc": 1591050363,
        "id": "fskneqj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591079163.0
    },
    {
        "author": "leonardnimoyNC1701",
        "body": "Yeah I'm never surprised anymore just wanted to make sure OP knew you can do this literally anywhere (try paypal for example) and it's not indicative of a security flaw.",
        "created_utc": 1591045954,
        "id": "fskeoiy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591074754.0
    },
    {
        "author": "Stonk_Wizard",
        "body": "Im not doing that bad tho. 🤷🏻‍♂️ I started options for the first time in February 20\n\nMaybe you should just PayPal me your money, I will invest it for you...\n\n\nhttps://ibb.co/HtmDgKF",
        "created_utc": 1591107183,
        "id": "fsmxoql",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591135983.0
    },
    {
        "author": "IndividualProfessor8",
        "body": "28 years old; approx 70k USD saved that I plan to put in stocks this month; I was trying to create a diversified mid to long term (5-10 years) growth portfolio (would be nice to be rich one day). My risk tolerance is high (already have an apartment paid for; no need to save for housing in the future) but I would be happy if I don't lose more than 50% (worst case scenario) to cover unexpected costs in the future. This is what I have come up with so far:\n\nFB 25%\n\nMSFT 10%\n\nBABA 10%\n\nTSLA 10%\n\nENPH 10%\n\nAPHA 10%\n\nPINS 10%\n\nGAN 7,5%\n\nAMRS 7,5%\n\nAlso planning to add 7k of sth payments related in the future. Probably PYPL or maybe V/MA/SQ.\n\nAny advice to the overall portfolio from you experts would be appreciated. Thank you :-)",
        "created_utc": 1591514578,
        "id": "ft8y63z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591543378.0
    },
    {
        "author": "MintNova",
        "body": "I’m a big fan of companies that cross sectors.  Shopify, PayPal, and Zillow are great examples of that.  I’m also intrigued by NKLA, but there is not enough info yet with it just hitting the market.  Not a fan of TSLA.  Musk is visionary but highly unstable.",
        "created_utc": 1591386618,
        "id": "ft08wpn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591415418.0
    },
    {
        "author": "BootySenpai",
        "body": "r/options and please theres so many other fking plays and you choose to fight paypal. its not a 10 bagger bro just let it rock man.",
        "created_utc": 1591313392,
        "id": "fswz8bq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591342192.0
    },
    {
        "author": "ihavenipplefocker",
        "body": "Deposit them to fanduel sportsbook or PayPal.",
        "created_utc": 1591323145,
        "id": "fsxgka4",
        "score": 1,
        "subreddit": "investing",
        "created": 1591351945.0
    },
    {
        "author": "TheLoneComic",
        "body": "Nobody ever went broke taking a profit is the old saying.  So nobody should criticize you for taking a healthy profit you’ve made.  Nobody can pick the top or bottom but you can get close in my experience.\n\nMost of the credible big wigs on financial media I follow (and I follow a lot) say we are a month or two from an adjustment downwards based on the reasoning when the Q2 numbers come in, and we realize just how bad and big the economy is, it’s gonna be a stomach punch to the markets.  \n\nSeventy percent is quite respectable.\n\nAs far as the one stock you are looking for that’s a pretty wide open question.  Were it my money I would most probably pick a tech stock - something near the top of the list of the Nasdaq 100.  But I would so that partially because its more bulletproof to the harder times ahead than other sectors and will likely grow.  How much is a matter of evaluation.\n\nRemember the rule don’t try to predict try to get the probability on your side.\n\nI would look at cyber security or electronic payments companies like PayPal and such - they are only growing as we digitally transform society.\n\nI was looking at Schroedinger SDGR, based on the whole theme of digital transformation but didn’t get in and it’s tripled in the last four months approximately.\n\nOn the smaller side I like Limelight networks when you look at what they do for the money you pay.  \n\nBut like Schroedinger, they’ve kinda had their rebound run already and might not grow that much short term now that this run is well in but have perhaps a long term hold type of play in them.\n\nI’m a trader not an investor so I don’t look super far out and like to make my money in intermediate to short terms.\n\nLet me know what you figure out and congratulations take that profit off the table when it’s available cause nobody can predict the future though the Dow futures are predicting a up day tomorrow right now.",
        "created_utc": 1591343961,
        "id": "fsyacgn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591372761.0
    },
    {
        "author": "cookiescards12",
        "body": "I just tell myself profit is profit, and that I could have easily just not done the play at all. It does suck tho seeing it go up even more after you sell off. I had $146 PYPL calls for last week. I sold at around $3.50. A day later it was in the $6.25 ish range. But at least I made really good profit (like 700%). So yeah, just tell yourself you could be like 90 percent of autists in this subreddit and lose thousands in a day to FOMO.",
        "created_utc": 1591222036,
        "id": "fssmwpw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591250836.0
    },
    {
        "author": "cookiescards12",
        "body": "God dammit I want paypal to go down so I can increase my position. Instead, it hits ATH's.",
        "created_utc": 1591278891,
        "id": "fsuz5aw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591307691.0
    },
    {
        "author": "w0ke_brrr_4444",
        "body": "Yes. We do 90% of our groceries at Whole Foods, have all our mobile and internet services at Telus, basically only use Apple products and when shopping online use PayPal/Visa. We’re not influencing the stock price directly, but it’s a small consolation for us when deciding how to spend our money. Amazon, for instance, has gained more in my portfolio than I could spend on groceries for the next 10 years based on our grocery bills. In short, we feel less bad about spending what and how much we do because these companies pay us back in some way. \n\nI do try to think about “what the average person” uses now as a first step in deciding what stocks I should consider doing and end to end valuation. We’re as average as it gets, so what we do is likely what others do at scale.",
        "created_utc": 1591532924,
        "id": "ft9gt8j",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1591561724.0
    },
    {
        "author": "Icee1017",
        "body": "They should have. Or bought Venmo (like Paypal did).",
        "created_utc": 1591553752,
        "id": "ftafwnu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591582552.0
    },
    {
        "author": "syncc6",
        "body": "Thanks for the insight my man. I opened a fidelity account about a month ago. Maybe I’ll keep both my long term and short term investments inside one to keep it simple. Long term, which would be mainly my child’s college savings, would be in mostly index funds and blue chips. Short term, house down payment like yourself, was thinking a bit more aggressive as well with potential growth stocks (PYPL, SQ, RTX, SE). Fractional shares would help me out here as some of these stocks are high priced.",
        "created_utc": 1591571955,
        "id": "ftbd2og",
        "score": 1,
        "subreddit": "investing",
        "created": 1591600755.0
    },
    {
        "author": "OverallPriority",
        "body": "It’s been over the course of a month. I started with PayPal and square, then went flat for a while, uso brought me up and then Boeing and now REITs.",
        "created_utc": 1591661304,
        "id": "ftfb05l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591690104.0
    },
    {
        "author": "packofmetsandgiants",
        "body": "Thanks for the reply.. what are your thoughts on investing on individual stocks that are already covered in VOO and QQQ? I want to buy some PayPal shares, but both ETFs cover that stock?",
        "created_utc": 1591758952,
        "id": "ftjqvki",
        "score": 1,
        "subreddit": "investing",
        "created": 1591787752.0
    },
    {
        "author": "xyatropos",
        "body": "Add a paypal link to donate",
        "created_utc": 1591713507,
        "id": "ftha9yi",
        "score": 1,
        "subreddit": "options",
        "created": 1591742307.0
    },
    {
        "author": "estevado",
        "body": "Those are great stocks to buy/hold. Definitely add Square (SQ) to the list which is disrupting the financial industry and leading the war on cash. Also keep an eye on MELI, PYPL and ROKU.",
        "created_utc": 1591150011,
        "id": "fspb88a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591178811.0
    },
    {
        "author": "High-__-there",
        "body": "Tsla will outperform all once their money printer (ai software) is complete. Hardware will be scaling massively (see battery day). Easy the biggest company in the world. Think apple x uber\n\nApple still making great hardware and moving into the massive opportunity in the heath care sector. Will likely keep printing money for some time\n\nAmazon all aspects of business is poised to keep growing and covid has accelerated that. Bezos is beast\n\nGoogle no real innovation seemingly just relying on youtube money and ads are dying imo (memes are better)\n\nFb ad revenue is so 2010 but these guys have many untapped revenue streams, extremely strong network effect, and all the most valuable data in the world. Zuckerberg is a robot and im not really comfortable with it\n\nMicrosoft is maximizing all revenue streams atm. Business is boring imo, i prefer apple\n\nSquare as others said will be massive juggernaut in the fintech space surpassing paypal, ma, v, due to their bottom up approach, cryptocurrency innovations and simplified services. Run by one of only 2 people simultaneously running 2 multibillion dollar companies",
        "created_utc": 1591155092,
        "id": "fspjw19",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591183892.0
    },
    {
        "author": "Peter_Jennings_Lungs",
        "body": "Visa or PayPal, boys?",
        "created_utc": 1591187759,
        "id": "fsqog0i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591216559.0
    },
    {
        "author": "Jalja",
        "body": "I'll paypal you 0 bucks if you teach me how to make this myself",
        "created_utc": 1591193208,
        "id": "fsqxsqq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591222008.0
    },
    {
        "author": "Ehombre",
        "body": "If you so proud to throw away money, send me some.\n\nI got the Paypal and Venmo on standby. You love to lose, don't you bitch?",
        "created_utc": 1591202016,
        "id": "fsrfx21",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591230816.0
    },
    {
        "author": "cookiescards12",
        "body": "I played paypal when it was trading for 140 ish on the 27th. I also bought 10 shares at 123 prior to earnings. So its been really nice to me so far. What are your thoughts on playing 7/22 earnings? I'm not sure if their inevitable good earnings call is priced in right now.",
        "created_utc": 1591138420,
        "id": "fsoqhq3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591167220.0
    },
    {
        "author": "snehal_patel",
        "body": "In the IBD newlestter there is a list of stocks to buy now. Those stocks according to the newletters are suppose to near breakout from the cup and handle format. If you compare them with Marketsmith you will see the glaring difference. The paypal buy recommendation in their newsletter and sell recommendation on Marketsmith was a classic pump and dump scheme skewed towrds marketsmith users. As for the lists I believe there are etfs with all the holdings so kind of defeats the purpose of paying monthly.\n\nThat being said marketsmith is pretty good no doubt. Just very expensive. At around 50 a month it would be great for individual investors.\n\nThe cup and handle pattern is great pattern for the bull market no doubt about it.\n\nI havent looked at gorilla trades. Thanks for letting me know. Will check them out. \n\nIf there are any others do let me know.",
        "created_utc": 1591138906,
        "id": "fsorg4m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591167706.0
    },
    {
        "author": "azwel",
        "body": "I think so too. Personally I rarely use paypal, but i guess many people on the net are in the habit.   I think they have paypal credit cards.. but Ive never seen anyone use one..",
        "created_utc": 1591127471,
        "id": "fso3tm7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591156271.0
    },
    {
        "author": "SteamedHamSalad",
        "body": "&gt;The fundamentals are that they are on the rise because people are home and using their online services.\n\nThat is not what fundamentals are. \n\n&gt;PayPal shares cost ~$156 and LULU shares cost ~$322.\n\nThe price of a single share is not a good way to determine which stock is cheaper. This is because each company has a different number of total available shares. One share of LULU gets you a higher percentage of the company than one share of PayPal. What you are doing would be like comparing the price of 10 apples to the price of 20 oranges.",
        "created_utc": 1591215371,
        "id": "fss8x6x",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591244171.0
    },
    {
        "author": "tind3r123",
        "body": "Because in the short term the stock prices are based on emotion. When talking about shorting paypal, i'm literally talking about shorting it from its current price down to around 150-$146.....\n\nYou know all stock charts move up and down right? It's a zig zag pattern and paypal, like many other stocks are due to go down a little before potentially making higher highs.",
        "created_utc": 1591313034,
        "id": "fswykfm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591341834.0
    },
    {
        "author": "Ankel88",
        "body": "what about paypal?",
        "created_utc": 1591289573,
        "id": "fsvl4la",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591318373.0
    },
    {
        "author": "whammyyy",
        "body": "It’s bad for PayPal but they have Venmo which is growing",
        "created_utc": 1591289639,
        "id": "fsvl9sd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591318439.0
    },
    {
        "author": "whammyyy",
        "body": "It’s globally. They’re bailing from having PayPal be the one and only preferred payment method.",
        "created_utc": 1591290579,
        "id": "fsvna6f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591319379.0
    },
    {
        "author": "Phlebotanist",
        "body": "Paypal",
        "created_utc": 1591289553,
        "id": "fsvl2zt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591318353.0
    },
    {
        "author": "mingomangos",
        "body": "Well i really believe in my current positions, paypal, mastercard, Disney, and Expedia are some that i would suggest you look at",
        "created_utc": 1591374315,
        "id": "fszj3mt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591403115.0
    },
    {
        "author": "nxnchx117",
        "body": " Hello guys, I'm 21M, no debt with a stable job so I took the leap and decided to invest some of my savings into stocks. I am looking to hold for the long term (15-20 years) and I am also looking forward to investing monthly on a regular basis. My portfolio consists of: GOOGL, AMZN, CCL, DAL, FB, MSFT, PYPL, SHOP, SNE, TSLA and V.  \nI have invested roughly the same amount in each stock, with the exception of TSLA, SHOP and MSFT, where I have invested a tiny bit more.  \nI would appreciate any advice/criticism given.",
        "created_utc": 1591363315,
        "id": "fsyxlsu",
        "score": 1,
        "subreddit": "investing",
        "created": 1591392115.0
    },
    {
        "author": "WendellStuart",
        "body": "Can you paypal me $100? I lost 2.5k on GNUS",
        "created_utc": 1591363595,
        "id": "fsyy2wi",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591392395.0
    },
    {
        "author": "cwilber88",
        "body": "They were reinvesting them for 30+ years but now in retirement, doing a bit of both. It helps that my mom worked for United Healthcare and got shares while working so she had as much as 1000 but sold about 250 a few years back. She also got Microsoft at like $39 and PayPal when it split off EBay, Altria and Phillip Morris spin off, plus Kraft. Verizon. Lots of the big ones but purchased decades ago....",
        "created_utc": 1591285091,
        "id": "fsvbjgt",
        "score": 1,
        "subreddit": "investing",
        "created": 1591313891.0
    },
    {
        "author": "Lab-Tested-Dior-Sock",
        "body": "Seems like you treating the stock market like a gambling service at this point, id recommend just buying shares, some of my picks would be DIS PYPL MSFT OGIG TECL, but if you want to yolo your way back to recovery, ACB Calls 4/20/21",
        "created_utc": 1591566044,
        "id": "ftb2ghj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591594844.0
    },
    {
        "author": "8BitSpecter",
        "body": "My paypal",
        "created_utc": 1591401586,
        "id": "ft144yw",
        "score": 1,
        "subreddit": "investing",
        "created": 1591430386.0
    },
    {
        "author": "Crude_Future",
        "body": "How do you do that thing when you open a paypal account or something then use your credit card to buy stuff from yourself giving you cash?",
        "created_utc": 1591400178,
        "id": "ft111o0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591428978.0
    },
    {
        "author": "ceskanda",
        "body": "Amen, I got super risky after I made 25k from PayPal and DBX then proceeded to lose it the following week on a series of trades. I had a big win on Friday and will be playing more conservatively this week. Might miss on on some nice gains but I gotta keep my ego in check  after a win.",
        "created_utc": 1591488753,
        "id": "ft7ue8b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591517553.0
    },
    {
        "author": "shawman123",
        "body": "To be fair in the 90's tech looked like on steroids with no fundamentals. Then in noughties Microsoft was a terrible investment. Microsoft made a come back post Ballmer era. But missing google was bad and Buffett himself admitted to missing out. Plus lack of investment in any domestic fintech is surprising(PayPal, Square or Stripe).",
        "created_utc": 1591496920,
        "id": "ft8ajxr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591525720.0
    },
    {
        "author": "estevado",
        "body": "Good observation re MA and V. I feel equally bullish on them and PYPL but even more optimistic about SQ. SQ has an amazing ecosystem for small merchants but is now also a bank that can loan money. Add to that their popular payment and investing app for consumers and the ability to take this abroad and scale to epic proportions. Everything is backed by a visionary leader.",
        "created_utc": 1591154841,
        "id": "fspjhjt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591183641.0
    },
    {
        "author": "Double_Anybody",
        "body": "Give it a few. PayPal dumped then had* a run up a few hours later.",
        "created_utc": 1591133476,
        "id": "fsogkum",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591162276.0
    },
    {
        "author": "MLGameOver",
        "body": "I mean\n\nJust PayPal me the money instead. I’ll be able to give my gf several great dinners.",
        "created_utc": 1591136628,
        "id": "fsomzfg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591165428.0
    },
    {
        "author": "KoalaBoy",
        "body": "PayPal is regularly used on eBay still and Shopify and woocommerce use PayPal by default so you don't have to set up a payment gateway with authorize.net or stripe. And PayPal gets a cut of every transactions and people who cash out their accounts to there bank. PayPal is more then a credit card. Hold them long. I'm in 500 shares at 115.",
        "created_utc": 1591142244,
        "id": "fsoxgrz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591171044.0
    },
    {
        "author": "Suds08",
        "body": "Paypal 2021 calls for long term gains",
        "created_utc": 1591142611,
        "id": "fsoy4oe",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591171411.0
    },
    {
        "author": "Coda70",
        "body": "Another day of selling.  Sold my financials today.  JPM, Amex, paypal, XLF.  For double or more! Need one more rally in tech and I’ll be all cash gang. And wait for the next dip. Shit is so fucking fun... when it’s working.",
        "created_utc": 1591107864,
        "id": "fsmyylf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591136664.0
    },
    {
        "author": "nafinmasjid",
        "body": "ZM puts are too obvious.. but the again PYPL and ATVI calls were obvious as well.",
        "created_utc": 1591121691,
        "id": "fsnrgoo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591150491.0
    },
    {
        "author": "Solooosteph",
        "body": "Ofc, if you paypal me 100 so I can yolo again on soy puts (got them nip piercings too so u know its worth it 🔥)",
        "created_utc": 1591125726,
        "id": "fso02vc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591154526.0
    },
    {
        "author": "SxCTang",
        "body": "Pypl is a safe pick regardless if there is a vaccine made or not. It’s a low risk pick in my opinion with potential for upside in the future.",
        "created_utc": 1591127275,
        "id": "fso3egd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591156075.0
    },
    {
        "author": "sharkingdonkey",
        "body": "I'm looking into some large caps to move into once I take profit on DKNG. Considering MSFT, FB, and PYPL.",
        "created_utc": 1591111426,
        "id": "fsn5zwz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591140226.0
    },
    {
        "author": "Its_the_dankness",
        "body": "Not totally sure to be honest, haven't followed SQ or PYPL very closely. That's just my speculation as to why its rallied, could be totally off-base",
        "created_utc": 1591119855,
        "id": "fsnnl1i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591148655.0
    },
    {
        "author": "Double_Anybody",
        "body": "Yea it is kinda pricey. I did see that Boeing run up, that was crazy. PayPal is a cheaper stock with the same fundamentals as LULU. It’s Q2 earnings are coming up, high user count due to the rona, and is a solid company before the virus.",
        "created_utc": 1591202609,
        "id": "fsrh6ol",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591231409.0
    },
    {
        "author": "bonejohnson8",
        "body": "I owe paypal money for a 10k loan I had to take out that banks wouldn't give me. You don't want this.",
        "created_utc": 1591223839,
        "id": "fssqkt8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591252639.0
    },
    {
        "author": "XiaoShuiLong",
        "body": "This is sort of ignoring the fact that you would have had to take enormous risks to get to 1bn in the first place - Elon Musk for example took his sub 100m from his first software company, risked it all setting up PayPal, then risked it all from selling that to set up Tesla etc - so they can and do continue to risk all their worth, far more so than poor people.\nNo billionaire is a cash billionaire (or 3-4% fixed income billionaire)",
        "created_utc": 1591626360,
        "id": "ftde9w9",
        "score": 1,
        "subreddit": "investing",
        "created": 1591655160.0
    },
    {
        "author": "notredwan",
        "body": "Definitely agree with you. Paypal does have lower PE ratio than square too",
        "created_utc": 1591616016,
        "id": "ftcz275",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591644816.0
    },
    {
        "author": "zangor",
        "body": "Weird.\n\nI guess you gotta keep that frail \"I started paypal\" body or your powers will disappear.",
        "created_utc": 1591615499,
        "id": "ftcyh3v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591644299.0
    },
    {
        "author": "harsh-truth",
        "body": "Only 9 trading days or less until the final $EROS STX merger. Loading up more on the Monday morning dip. 3000 shares and counting plus options out the wazoo. Dream of Lambos all you want, I just need to payoff the IRS $23K",
        "created_utc": 1591474931,
        "id": "ft6i4ar",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1591503731.0
    },
    {
        "author": "kono88",
        "body": "yeah.. and altho, STX does come out with good movies, but it is not the type of movie that scream blockbuster.  Sadly.",
        "created_utc": 1591293703,
        "id": "fsvu3jp",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1591322503.0
    },
    {
        "author": "Ay-Rod",
        "body": "This is very underrated atm. The merger with STX entertainment is bigger than people think",
        "created_utc": 1591359932,
        "id": "fsysay8",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1591388732.0
    },
    {
        "author": "learningis1st",
        "body": "FXAIX - 24%\n\nCSIQ - 23%\n\nTSM - 6%\n\nGILD - 6%\n\nINTC - 4%\n\nCTXS - 2%\n\nSTX - 2%\n\nTER - 2%\n\nLOGM - 2%\n\nDBX - 2%\n\nABBV - 1%\n\n...",
        "created_utc": 1591081909,
        "id": "fsm2l4k",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591110709.0
    }
]