[
    {
        "author": "soAsian",
        "body": "that didn't stop company like IBM, Microsoft, Google, hell even Apple from dumping money into India for R&amp;D, product development, call centers, iphone assembly...etc.",
        "created_utc": 1588626990,
        "id": "fphshj3",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1588655790.0
    },
    {
        "author": "100_PERCENT_BRKB",
        "body": "Did you account for dividends? Berkshire came out 5% ahead on the whole thing\n\nIBM was a mistake, but to the best of my knowledge Berkshire didn't lose money overall.\n\nWe can agree there was an opportunity cost, of having money in IBM for so long, though. That's a real cost",
        "created_utc": 1588359889,
        "id": "fp6wo5u",
        "score": 7,
        "subreddit": "investing",
        "created": 1588388689.0
    },
    {
        "author": "guitmusic12",
        "body": "Well there was the whole....\"Bankruptcy and wiping out all the shareholders\" thing.\n\nBut there is something to be said about not expecting the top companies to stay there forever. There was a time not too long ago where GE, IBM, GM and XOM looked like they were gonna rule the world.",
        "created_utc": 1588614728,
        "id": "fph4bki",
        "score": 5,
        "subreddit": "investing",
        "created": 1588643528.0
    },
    {
        "author": "TheOptionsTrader",
        "body": "IWM WMT IBM calls",
        "created_utc": 1588635549,
        "id": "fpi8395",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1588664349.0
    },
    {
        "author": "creamy-coffee",
        "body": "I agree he could lead a turnaround but IBM is a deadbeat tech company.  They blow money on exaggerated marketing so dumbass execs pay massive consulting fees for projects that never finish.  IBM is generally trash at AI.  Google is the number 1 AI company.  So I guess yeah nowhere to go but up but I think the company is already hugely overvalued and they’ve been dead on the inside for a while.",
        "created_utc": 1588361354,
        "id": "fp6zk59",
        "score": 2,
        "subreddit": "investing",
        "created": 1588390154.0
    },
    {
        "author": "bandawarrior",
        "body": "Unfortunately, Buffet will be shown to have made a critical error here like he did with tech. He did make up for his giant miss by investing in IBM lol.\n\nAt some point the champion loses his touch. This might be it. Pushing 90 is hard to keep up with the times.",
        "created_utc": 1588642590,
        "id": "fpik5m6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588671390.0
    },
    {
        "author": "Tendieheart_Bear",
        "body": "Yeah..  I think yesterday when he said heirs get SPY shares was a big hint that even he thinks the BRK will dump after his death.\n\nShit..  IBM..  haha!!",
        "created_utc": 1588532323,
        "id": "fpdqqeq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588561123.0
    },
    {
        "author": "MrDrego",
        "body": "I never trust IBM's cloud numbers. They have a habit of taking existing businesses and relabeling them as \"cloud\" for the purpose of padding their numbers. My prediction is that IBM will be in steady decline for decades to come. So if you're in it for some steady dividends then it might be a good option, but I don't have high expectations for their market cap to grow much beyond where it's at now.",
        "created_utc": 1588351545,
        "id": "fp6fovk",
        "score": 2,
        "subreddit": "investing",
        "created": 1588380345.0
    },
    {
        "author": "rinsyankaihou",
        "body": "IBM is more of a consulting company than a cloud company. This isn't just because of Ginni, but also the precedent set by her predecessors. They need to invest more in their cloud business to be truly competitive. This means doing things like suspending dividends and buybacks and reinvesting into business.\n\nAre they going to do that? Probably not.\n\nEveryone loves to talk about their potential cloud growth (and have been talking about it for years), but as things stand there aren't even on the radar.",
        "created_utc": 1588389099,
        "id": "fp8csyb",
        "score": 1,
        "subreddit": "investing",
        "created": 1588417899.0
    },
    {
        "author": "Reasonable_Meat",
        "body": "IBM for the div. if anything at this point. Ship has sailed.",
        "created_utc": 1588412372,
        "id": "fp9310q",
        "score": 1,
        "subreddit": "investing",
        "created": 1588441172.0
    },
    {
        "author": "RobertJMcF",
        "body": "People thought the same thing about IBM. The next thing will come and the old giants will fall. At that point it won’t be worth getting into them though so maybe don’t focus on the big guys if you’re not willing to risk that $1900 on one stock. Look at the startup tec ferns or the up and comers who have has positive quarters for the past year or so.",
        "created_utc": 1588470019,
        "id": "fpbhc3g",
        "score": 1,
        "subreddit": "investing",
        "created": 1588498819.0
    },
    {
        "author": "patriot2024",
        "body": "The present giants are not the same as dinosaurs of the past.  They learned the goods and the bads from giants of yesterday.\n\nIBM is a dinosaur. It became a dinosaur with the emergence of personal computers. But while many dinosaurs have been dead for years, IBM is still alive because -- IMO -- it has done one thing right: IBM Research.   IBM Research is what has kept IBM alive, staying with the youngsters.  \n\nGuess what. The current giants have learned from this. They all have invested heavily in research.  Most interestingly is Google. Most of their products are \"betas\", which are experimental research projects that are deployed to the public.\n\nAnother thing the giants have learned is that they need to be very flexible and adaptive to rising trends.   Microsoft raised because of the dominant of software, which by the way was the dead sentence for hardware giants.   But this dominant almost killed Microsoft, turning it into a dinosaur, when software became a commodity and not a specialty product.  Demanding customers to pay for each version of Windows and Word was no longer the right thing to do, Microsoft adapted to a model the sells software as a service.  And they have survived. They have also excelled due to Microsoft Research. This has allowed them to stay at the forefront.\n\nGoogle, Apple and FaceBook will be the dominating players in the near future because -- IMO -- data, data about people, and the interconnection of people have become more important than anything else.\n\nIt is very possible that data will become cheap in some sense, a commodity.  Although data has become more open, certain types of data can be very expensive to collect.  So I think Google and FaceBook will continue to have a promising future.\n\nApple is in a very interesting situation. It doesn't sell a product.   Other cellphone companies sell utilities. But Apple sells the experience of people connecting to people. It's like FaceBook in some way.  People inherent want to connect to other people. This is a lasting value. As long as Apple excels at this, it will be around for a long time.",
        "created_utc": 1588480019,
        "id": "fpbvs5a",
        "score": 1,
        "subreddit": "investing",
        "created": 1588508819.0
    },
    {
        "author": "jonhuang",
        "body": "Well, the incremental value of data might decline. Lots of big companies are built on technological change but no change lasts forever. Car companies for example. Or oil/coal--OPEC probably seemed invincible but between demand drops, renewables and fracking they no longer seem as invincible as before. Or moore's law powered companies like IBM, Dell, Microsoft but is now slowing down (in both tech and demand for faster personal computers). \n\nSo is it inconceivable that data mining might top out too? Legislation, or using anonymous VPNs become like brushing your teeth, or  every company has so much data that it levels out. Google knows when I flip lightswitches in my house but it's not as valuable as reading my email and exact location, surely.",
        "created_utc": 1588478723,
        "id": "fpbu1xr",
        "score": 1,
        "subreddit": "investing",
        "created": 1588507523.0
    },
    {
        "author": "BenRobNU",
        "body": "He was in management while they lost ground in tech. I don't know the inner workings of IBM but I would be more excited as an investor if they had an outside cloud hire.  \n\n\nFrom a tech standpoint RedHat acquisition was to give a cloud OS/Toolkit marketplace advantage. IBM is not winning on the cloud front.",
        "created_utc": 1588361931,
        "id": "fp70paj",
        "score": 1,
        "subreddit": "investing",
        "created": 1588390731.0
    },
    {
        "author": "eoliveri",
        "body": "I wonder if the project you saw was one that IBM had outsourced to India.  I don't know if IBM is still doing that, but at the time when I was aware of the practice (about 15 years ago), it was a big mistake quality-wise--a real case of \"penny-wise, pound-foolish\".",
        "created_utc": 1588365017,
        "id": "fp76n9h",
        "score": 1,
        "subreddit": "investing",
        "created": 1588393817.0
    },
    {
        "author": "bitflag",
        "body": "&gt; they ain't going away\n\nIt doesn't mean they won't lose value. IBM hasn't gone away but it lost its dominance and sharehodlers haven't reaped the same profits in the past decades as they did in its heyday. It could be worse: Kodak and Nokia are still around too!\n\nToo often people in this sub think \"can't disappear = can't lose money\" but it couldn't further from the truth. There are many ways a business can destroy shareholder value, or simply underperform the market, without going bankrupt.",
        "created_utc": 1588493727,
        "id": "fpcaxit",
        "score": 1,
        "subreddit": "investing",
        "created": 1588522527.0
    },
    {
        "author": "SmoothAsRock",
        "body": "Betting against him with IBM, OXY, UAL, AAL, LUV, and DAL clearly worked out for put holders.  Honestly, the guy has not adapted well to the times.  For the longest he refused to invest in tech sector then picks IBM....over AMZN, GOOGL, and FB.\n\nIt could be a ploy to drive the whole industry lower so he can take over a major airframer like Boeing.",
        "created_utc": 1588509697,
        "id": "fpcqe5w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588538497.0
    },
    {
        "author": "__justsayin__",
        "body": "I know OP heavily downvoted, but fact is since 2010, the performance between BRK.A and SPY is *virtually* the same (+/- few tenths of a percentage).  And now I'm reading he's pulled out of Airlines after bashing them for years (and losing a shit ton in the process), and I won't include any of his other blunders like investing in $IBM out of all companies.......",
        "created_utc": 1588461334,
        "id": "fpb3hsp",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1588490134.0
    },
    {
        "author": "CD_Johanna",
        "body": "1. What would being at IBM since 1990 mean? Nadella was at MSFT since 1992. Do you mean that it's too late for him in his career?\n\n2. What about Red Hat doesn't seem worth it for IBM?",
        "created_utc": 1588357278,
        "id": "fp6rddg",
        "score": 1,
        "subreddit": "investing",
        "created": 1588386078.0
    },
    {
        "author": "BarbarX3",
        "body": "I don't have an opionion on many of these, but I have looked into some. What I am missing most about your list is the financials and management analysis. Good investments are only good if you can calculate an expected return on the capital, otherwise you're just hoping that the stock goes up in value because someone else will be there to pay even more than you did without any underlying reason. Good investments are only good if it is managed so that shareholders get their returns. For lots of companies the shareholder is just another customer that they can get money from to run their business, whatch out for that.\n\nI have some opinions(!) on the following:\n\n\\- FB: They rely solely on their scale and networkeffect to make money. I don't see a moat that protects that network. New exciting apps can greatly reduce this networkeffect, and their scale and profitability with it. With that in mind I can not say definitvely that they will be around in 5, 10, 20 or 30 years. THey might be, they might not be. But if I can not be 100% certain the comapny will be around for the next 30 years, I'm not putting my money in it (rule nr 1: don't loose money). I also don't like the management, they don't seem honest to their users, customers or shareholders.\n\n\\- MSFT: This is one of my biggest holdings. I think the company is run well, the financials are in order, their markets are increasing, many businesses depend on them and are locked in (which is only getting stronger). I don't see them disappearing anytime soon, and even if they have bad years they can scale down in costs, and have enough time and capital to try new things. The only thing I'm worried about at the moment is their popularity, you may be buying at a high price now because there aren't as many good alternatives. I try to avoid popularity like that (what happens to the hot 20yr old when she turns 40?).\n\n\\- WM: I think they are now popular/hype without any good reason. The company might be solid, but I think their growth is not gonna be spectactular. Half the current price would be more realistic if you plan to hold forever.\n\n\\- Cisco: Old behemoth like IBM. They might do well, good long term outlook and their price is acceptable. For the next 30 years they will need to keep up with new technologies and I have a nagging feeling they are milking their existing customers and not focusing on the future enough. Not in my portfolio, but well worth considering.\n\n\\- Apple: I own a couple shares. Great lock-in, good rpicing power, good consumer satisfaction, but future may still be uncertain looking forward 30 years. They depend on constant innovation and trying to get people that next \"fix\" as it were. I'm not sure they can keep that up for years and years and years. Current price is high but acceptable I think, but be on the lookout for changing consumer behavior (new more exciting companies can nibble at their marketshare).\n\n\\- TMobile: I think telecoms are going to face some serious headwinds as satellite cell network communications start. That will be some years from now, but systems like starlink might become serious global contendors wiping out current investments by telco's. I'm not sure investment made now will give you the return you need long term. My money is on starlink IPO.\n\n\\- Financials: I stick to european and canadian banks. Not really any reason other then I don't have first hand experience with american banks.\n\n\\- Volkswagen: I think the car market is too competitive to ever give a steady return without risk of being wiped out multiple times in between. No carmaker has any moat over others. I don't think Tesla has a moat, I don't think Volkwagen has either. If I look for a new car, I don't have any brand loyalty. Their is no real reason for me to buy a volkswagen over a toyato, kia or renault. I think Tesla is massively overvalued, I bought the model3 but returned it in the first week because of all kinds of quality and service problems. I like my 10yr old volvo better. Therefor I don't see any reason to invest in any of them.\n\n\\- Panasonic: I agree with your assesment. I own some shares myself. The company is well run and well positioned to take advantage of a growing market. It may not be a quick return, but I believe long term they will do well.\n\n\\- Crypto: It doesn't produce anything of value nor is it a resource that can be used in production. It is not regulated or controlled by any meaningfull organisation. It is highly manipulated and riddled with fraud (my opinion). Therefor I don't see why it has any inherent value, and I don't own any nor ever have or will. Would you buy land that doesn't produce anything and you cannot build on? Gold has it's uses, just like silver and other scarce metals. Crypto has no inherent use, I would even argue that it's consuming energy to create nothing, and should therefor be of negative value.",
        "created_utc": 1588595426,
        "id": "fpg69hy",
        "score": 1,
        "subreddit": "investing",
        "created": 1588624226.0
    },
    {
        "author": "msnf",
        "body": "IBM isn't much of a nightmare scenario for big tech, considering how long it held its value after losing its technical advantages. If you had bought IBM stock at the height of the early 2000's dot-com bubble, you would've been ahead of the market until [as late as 2017](https://finance.yahoo.com/quote/IBM/chart?p=IBM#eyJpbnRlcnZhbCI6Im1vbnRoIiwicGVyaW9kaWNpdHkiOjEsInRpbWVVbml0IjpudWxsLCJjYW5kbGVXaWR0aCI6NC42NzA3ODE4OTMwMDQxMTUsImZsaXBwZWQiOmZhbHNlLCJ2b2x1bWVVbmRlcmxheSI6dHJ1ZSwiYWRqIjp0cnVlLCJjcm9zc2hhaXIiOnRydWUsImNoYXJ0VHlwZSI6ImxpbmUiLCJleHRlbmRlZCI6ZmFsc2UsIm1hcmtldFNlc3Npb25zIjp7fSwiYWdncmVnYXRpb25UeXBlIjoib2hsYyIsImNoYXJ0U2NhbGUiOiJwZXJjZW50Iiwic3R1ZGllcyI6eyLigIx2b2wgdW5kcuKAjCI6eyJ0eXBlIjoidm9sIHVuZHIiLCJpbnB1dHMiOnsiaWQiOiLigIx2b2wgdW5kcuKAjCIsImRpc3BsYXkiOiLigIx2b2wgdW5kcuKAjCJ9LCJvdXRwdXRzIjp7IlVwIFZvbHVtZSI6IiMwMGIwNjEiLCJEb3duIFZvbHVtZSI6IiNmZjMzM2EifSwicGFuZWwiOiJjaGFydCIsInBhcmFtZXRlcnMiOnsid2lkdGhGYWN0b3IiOjAuNDUsImNoYXJ0TmFtZSI6ImNoYXJ0In19fSwicGFuZWxzIjp7ImNoYXJ0Ijp7InBlcmNlbnQiOjEsImRpc3BsYXkiOiJJQk0iLCJjaGFydE5hbWUiOiJjaGFydCIsImluZGV4IjowLCJ5QXhpcyI6eyJuYW1lIjoiY2hhcnQiLCJwb3NpdGlvbiI6bnVsbH0sInlheGlzTEhTIjpbXSwieWF4aXNSSFMiOlsiY2hhcnQiLCLigIx2b2wgdW5kcuKAjCJdfX0sImxpbmVXaWR0aCI6Miwic3RyaXBlZEJhY2tncm91bmQiOnRydWUsImV2ZW50cyI6dHJ1ZSwiY29sb3IiOiIjMDA4MWYyIiwic3RyaXBlZEJhY2tncm91ZCI6dHJ1ZSwiZXZlbnRNYXAiOnsiY29ycG9yYXRlIjp7ImRpdnMiOnRydWUsInNwbGl0cyI6dHJ1ZX0sInNpZ0RldiI6e319LCJjdXN0b21SYW5nZSI6eyJzdGFydCI6OTUxODg2ODAwMDAwLCJlbmQiOjE1ODU3MTM2MDAwMDB9LCJzeW1ib2xzIjpbeyJzeW1ib2wiOiJJQk0iLCJzeW1ib2xPYmplY3QiOnsic3ltYm9sIjoiSUJNIiwicXVvdGVUeXBlIjoiRVFVSVRZIiwiZXhjaGFuZ2VUaW1lWm9uZSI6IkFtZXJpY2EvTmV3X1lvcmsifSwicGVyaW9kaWNpdHkiOjEsImludGVydmFsIjoibW9udGgiLCJ0aW1lVW5pdCI6bnVsbH0seyJzeW1ib2wiOiJeR1NQQyIsInN5bWJvbE9iamVjdCI6eyJzeW1ib2wiOiJeR1NQQyJ9LCJwZXJpb2RpY2l0eSI6MSwiaW50ZXJ2YWwiOiJtb250aCIsInRpbWVVbml0IjpudWxsLCJpZCI6Il5HU1BDIiwicGFyYW1ldGVycyI6eyJjb2xvciI6IiM3MmQzZmYiLCJ3aWR0aCI6MiwiaXNDb21wYXJpc29uIjp0cnVlLCJzaGFyZVlBeGlzIjp0cnVlLCJjaGFydE5hbWUiOiJjaGFydCIsInN5bWJvbE9iamVjdCI6eyJzeW1ib2wiOiJeR1NQQyJ9LCJwYW5lbCI6ImNoYXJ0IiwiZmlsbEdhcHMiOmZhbHNlLCJhY3Rpb24iOiJhZGQtc2VyaWVzIiwic3ltYm9sIjoiXkdTUEMiLCJnYXBEaXNwbGF5U3R5bGUiOiJ0cmFuc3BhcmVudCIsIm5hbWUiOiJeR1NQQyIsIm92ZXJDaGFydCI6dHJ1ZSwidXNlQ2hhcnRMZWdlbmQiOnRydWUsImhlaWdodFBlcmNlbnRhZ2UiOjAuNywib3BhY2l0eSI6MSwiaGlnaGxpZ2h0YWJsZSI6dHJ1ZSwidHlwZSI6ImxpbmUiLCJzdHlsZSI6InN0eF9saW5lX2NoYXJ0IiwiaGlnaGxpZ2h0IjpmYWxzZX19XSwicmFuZ2UiOnsiZHRMZWZ0IjoiMjAwMC0wMy0wMVQwNTowMDowMC4wMDBaIiwiZHRSaWdodCI6IjIwMjAtMDUtMDRUMDM6NTk6MDAuODg4WiIsInBlcmlvZGljaXR5Ijp7ImludGVydmFsIjoibW9udGgiLCJwZXJpb2QiOjF9LCJwYWRkaW5nIjowfX0%3D). For reference, [IBM sold off their personal computer division to China in 2005](http://www.nbcnews.com/id/7695811/ns/business-world_business/t/chinas-lenovo-acquires-ibm-division/), and a google search for \"IBM smartphone\" brings up a device made in 1994.",
        "created_utc": 1588523406,
        "id": "fpdayfg",
        "score": 1,
        "subreddit": "investing",
        "created": 1588552206.0
    },
    {
        "author": "probablysitting",
        "body": "I read it in his bio, The Snowball. It was the day they met:\n\n&amp;#x200B;\n\n&gt;Buffett skipped the small talk; he immediately asked Gates whether IBM was going to do well in the future and whether it was a competitor of Microsoft. Computer companies seemed to come and go, and why was that? Gates started explaining. He told Buffett to buy two stocks, Intel and Microsoft. Then he asked Buffett about the economics of newspapers, and Buffett told him that they had gotten worse, because of other media. Within minutes the two were deeply immersed in conversation.\n\n&amp;#x200B;\n\nThe book later talks at length about the dilemma warren had with tech companies, specially Microsoft and Intel:\n\n&amp;#x200B;\n\n&gt;And as much as Buffett admired Noyce, he did not buy Intel for the partnership, thus passing on one of the greatest investing opportunities of his life. While he had lowered his investing standards in difficult environments—and would do so again—one compromise he would never make was to give up his margin of safety.\n\n&amp;#x200B;\n\n&gt;Now, his interest piqued, he bought a hundred shares of Microsoft, which, to him, was like eating a single Cheerio. He couldn’t bring himself to buy any Intel, even though he sometimes bought a hundred shares just to keep track of a company. \n\n&amp;#x200B;\n\n&gt;Buffett, who deemed computers outside his “circle of competence,” might still have been the richest man in America instead of Gates, had he bought stock in Microsoft and Intel. Instead, he was now number two. But he did not care. Or rather, he did care—he cared a lot; he would rather be number one, much rather—but he cared far more about avoiding excess risk. He didn’t know which company would turn into the next Microsoft or Intel and which would crash and burn. He would never give up his margin of safety. He knew that the life cycle of many technology businesses was as short as a naked mole rat’s.\n\n&amp;#x200B;\n\n&gt;But he would not consider buying a technology stock at *any* price. *“When it comes to Microsoft and Intel,”* he said, *“I don’t know what that world will look like ten years from now. And I don’t want to play in a game where the other guy has an advantage.... The software business is not within my circle of competence.... We understand Dilly Bars and not software.”*",
        "created_utc": 1588614086,
        "id": "fph31pt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588642886.0
    },
    {
        "author": "rnaorrnbae",
        "body": "IBM",
        "created_utc": 1588690788,
        "id": "fpk9x08",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588719588.0
    },
    {
        "author": "safi_az",
        "body": "I'd rather go for IBM and AMD, AMD gon hit skyrocket with their new chip beating Intel",
        "created_utc": 1588548563,
        "id": "fpej5k3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588577363.0
    },
    {
        "author": "Randomness898",
        "body": "Yea I want to say I definitely think he's a legend. Hopefully my post didn't come off that I was just bashing him because his legacy is amazing. However, I agree with you. The big red flag to me was one of the tech names he did invest in was IBM. He started buying like in 2011 and finally sold it all a few years ago. That was a big red flag. Out of all the names in tech he could have chosen, he chose the one that had stunted growth. \n\nIronically if this CEO is good and IBM starts focusing on like cloud, they might actually be ok next few years.",
        "created_utc": 1588564710,
        "id": "fpf904u",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588593510.0
    },
    {
        "author": "LavenderFish",
        "body": "I agree. However, people could have said that about ibm, Enron, etc.",
        "created_utc": 1588551815,
        "id": "fpeow5m",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1588580615.0
    },
    {
        "author": "lloydgross24",
        "body": "Oh yeah for sure. I'm up fairly nice as well. I was up around 50% in almost everything I bought before the last drop. I sold some of the bigger gaining ones to lock in some gains. \n\nI went the slower route of  mostly buying good stocks that weren't hit as hard and paid good dividends. I got them super cheap with great yields that I am pretty confident aren't getting cut. I'm not selling them for a long time. \n\nI'm still sitting on 20% cash, bout to add a bit more from my bank. I'm thinking of selling a few stocks that would get me about 10% more. I'm getting ready for round 2 of the downturn if there is one! \n\nI'm ready to get in on Apple if they come back down again. I traded the stock and made some money off of them but I never went into long term hold. I want to buy more Microsoft of course. And I want to get into IBM because I like the new CEO plus a great dividend yield. mainly the new CEO tho. \n\nFood wise I'm wanting to get into SBUX after hearing their CEO talk about how many stores they are planning on opening in China and how they are doing there. \n\nI got a long list of 5g stocks I want to get in on too.",
        "created_utc": 1588547863,
        "id": "fpehvu1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588576663.0
    },
    {
        "author": "NotTopherGrace",
        "body": "&gt; Just being in the industry, I have no confidence in IBM's ability to challenge amazon, google, or Microsoft. They hire under qualified engineers to save a buck, they are horrible at developing talent, their pay isn't competitive, and frankly it's not as sexy working for IBM as it is google.\n\nI previously worked for a company that was acquired by IBM, they did everything humanly possibly to prevent the \"IBM culture\" from getting in. They're incredibly out of touch when it comes to hiring or doing anything to keep up with their competitors, and are far more interested in getting every new development hire to start patent trolling for them.",
        "created_utc": 1588367884,
        "id": "fp7c73b",
        "score": 1,
        "subreddit": "investing",
        "created": 1588396684.0
    },
    {
        "author": "SeparateLoan",
        "body": "Well hes day trading again..\n He got wrecked in IBM doing that already",
        "created_utc": 1588460870,
        "id": "fpb2q3y",
        "score": 1,
        "subreddit": "investing",
        "created": 1588489670.0
    },
    {
        "author": "Rageoftheage",
        "body": "They also lost shitloads of money on IBM",
        "created_utc": 1588356358,
        "id": "fp6piq2",
        "score": 1,
        "subreddit": "investing",
        "created": 1588385158.0
    },
    {
        "author": "SwagState",
        "body": "AAPL   MSFT   FB   INTC   IBM   ORCL   RTX   BA   HON   MMM   GM   CAT   JPM   BAC   C   MA   V   DFS   ODFL   UPS   UNP   DAL   LUV   EXPE   DIS   MCD   SBUX   YUM   DG   CVS   WMT   SPG   HD   NUE   IP   DOW   CVX   XOM   KO   KHC   PG   VFC   NKE   UNH   PFE   JNJ   CMCSA   TMUS   VZ   CSCO\n\n\n50 stocks. 50 years.",
        "created_utc": 1588340247,
        "id": "fp5ukxk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588369047.0
    },
    {
        "author": "labloke11",
        "body": "IBM is closely correlated to corporate IT spending and that is projected to go down this year due to recession and companies tend to cut IT projects first, even with WFH initiative, which I BM will not benefit from.",
        "created_utc": 1588346514,
        "id": "fp65n4m",
        "score": 1,
        "subreddit": "investing",
        "created": 1588375314.0
    },
    {
        "author": "HOAdeposit",
        "body": "IT IS ABSOLUTELY POOR. Correct.  This is why I say to dip our toe into the companies the Billionaires presently are pouring hundreds of millions into. THEY ALL HAVE the same goal.  TO FIND A VACCINE FOR COVID 19.  LOL?   TO FIND A WAY TO STORE SOLAR , WIND, etc(NON-CARBON ALTERNATIVES_)   An IBM $50M computer in 1979 now costs &lt;$550. WHY? BILL GATES and his team of 3, were able to EXPONANTIALLY INCREASE THE AMOUNT OF MEMORY STORED &amp; not just as fast as In our lifetime but within the 21 yrs my daughter is on this planet.  IF YOU THINK WE WILL never again see growth in fields which like computer memory,speed,etc has changed this world then you like I am also just are not a VISIONARY . GATES AND GOD BLESS STEVE JOBS WOULD\"VE BEEN Investing in this NEXT NEW FRONTIER NO ONE HAS EVER IMAGINED BEFORE!   Think how fast we went from 1980 the world of tech (computer capabilities) to 1999? We can easily produce all these clean endless supplies of re-usable energies but worth that $50M IBM computer to COMMON FOLK LIKE ME IF we have NO TOOLS (CELLS) to Store FREE ENERGY for those rainy days.  \n     THE money is no longer in these thousands of small companies maybe mid cap?  Who put $300,000 worth of solar panels on our new home we just bought and if like my previous homes even one's I built?  I WILL BE LEAVING HERE FOR SOMETHING NICER OR MORE OF SOMETHING THAT IN 3-5 yrs I will WANT ?    POINT?   WE DO NOT NEED MORE COMPANIES PUTTING UP THOSE UGLY PANELS WE STILL HAVEN\"T PAID OFF ON OUR 1st of 21 properties commercial or residential I installed those on YET?    WE  NEED OUR CURRENT UTILITY COMP'S  TO FIND A COMPANY TO INSTALL A MAIN GRID OF THESE WINDMILLS, SOLAR PANELS, HYDRO POWER, ****HELIGIUM?**  A BATTERY FORM OF ENERGY. HOWEVER WITHOUT A WAY TO STORE KWZ Produced on a UV INDEX DAY OF 9 so we have a surplus to use when 0 KWZ are produced on a rainy day or season when the dam dries up for 6 weeks twice a year?   \n     POINT?&gt;??  If BILL GATES CAN AGAIN either pay a team of techs to discover a way to store 10M Kwz and not 10 Kwz, just as we now have so much stored memory we use TERRABYTES NOT MB or KB or REMEMBER THE COMMODOR 64?  64?  KB!!!!!!!!!!!!!! IMAGINE ?  THIS SEEMS ALSO SIMPLER SINCE WE JUST NEED A WAY TO STORE Kwz made a dozen ways and THAT IS THE END OF COAL AND DONAL:D  TRUMP\"S VISION OF AMERICA ?&gt;  I voted and might again for the DONALD BUT I BELIEVE PRES OBAMA WHEN HE SAID \"I HAD A Different Vision of America 2000.  \"  IT did not include the black clouds once again eminating from the coal mines of WEST VIRGINIA OR THE 12 hr work days on assembly lines in sweat shops called TRUMP'S \"BRING AMERICA'S FACTORY JOBS BACK!\".    NO MAGIC IN WHAT OUR PRESIDENT DID ???     ANYWAY AS EVERYTHING ELSE HE TOUCHES GOES BANKRUPT ***** BESIDES A FEW BUILDINGS IN A CITY where everything in Real Estate if you hold it long enough will be a NO BRAINER MEGA FORTUNE 30 yrs later?",
        "created_utc": 1588555843,
        "id": "fpevic5",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1588584643.0
    },
    {
        "author": "Lelele11",
        "body": "People said the same thing about Kodak and IBM.",
        "created_utc": 1588544813,
        "id": "fpecjdl",
        "score": 1,
        "subreddit": "investing",
        "created": 1588573613.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  5th of May\n\n\n\n## Upcoming events for Wednesday, May  6th\n\n - Expected earnings:\n\n  ACMR, ADMA, ADTN, AEIS, AEL, AEP, AERI, AFIN, AI, ALB, ALE, ALG, ALGT, ALLO, ALNY, ALTM, ALXN, AMED, AMOT, AMP, AMPY, ANGI, ANSS, AP, APA, AQUA, ARES, ASM, ASTE, ATO, ATRA, ATRO, AVB, AVNS, AWK, AXGN, AXTA, AYX, AZPN, BBSI, BBU, BCOR, BCRX, BEAT, BEP, BFAM, BFYT, BG, BHR, BIO, BKCC, BNFT, BPMC, BRKR, BRY, BWA, CAPL, CARS, CBMG, CBZ, CCMP, CCO, CDAY, CDW, CECE, CENT, CENTA, CF, CFMS, CGEN, CHEF, CIM, CLI, CLLS, CNHI, CNST, CORR, CPA, CPG, CPK, CPLP, CRK, CSGS, CSTE, CTL, CUB, CVNA, CVS, CW, CXW, CYTK, DAR, DCP, DDD, DHX, DISCA, DLHC, DNN, DNOW, DRQ, DRTT, DX, EAF, ELVT, EMKR, ENBL, ENTA, EPAY, EPM, EPR, EQIX, ERYP, ES, ESE, ESPR, ESS, ETSY, EVFM, EVRG, EXAS, EXR, EYPT, FCPT, FG, FIT, FLIR, FMS, FNV, FORM, FOXA, FOXF, FRT, FSK, FSLY, FTDR, FTNT, FTS, FUN, GABC, GBT, GCP, GDDY, GEL, GM, GMRE, GNK, GNL, GOLD, GPC, GPN, GRUB, GSS, GSX, GTHX, GTY, H, HDSN, HEP, HI, HR, HSON, HT, HUBS, HZNP, IAA, IAC, IDN, IIPR, IMMU, IMUX, INMD, INN, INSG, INVH, IO, IONS, IPI, IRT, IRWD, ISEE, IVC, J, JAX, JNCE, KFRC, KKR, KL, KRG, KW, LASR, LBTYA, LCI, LGND, LNC, LPI, LVGO, LXU, LYFT, MAA, MCFT, MEET, MET, MFC, MLVF, MNKD, MNR, MOR, MRO, MTRX, MX, MYE, NBIX, NDLS, NE, NEPH, NI, NMFC, NMIH, NOA, NREF, NTR, NTRA, NUS, NUVA, NVO, NXST, NYT, ODP, OMI, OPK, OSB, OSUR, PAAS, PACB, PAG, PARR, PEIX, PERI, PGEN, PING, PKOH, PPD, PRTA, PRTS, PSN, PTMN, PTON, PXD, PYPL, PZZA, QDEL, QGEN, QMCO, QNST, QRTEA, QTWO, RAIL, RARE, RBBN, RCII, RCL, RDN, RDWR, RE, REAL, RESN, REZI, RGEN, RGLD, RM, RMAX, RNG, RNR, ROCK, RP, RST, RTLR, RUBI, RUN, RYI, SAR, SAVE, SBBP, SBGI, SBH, SBOW, SBRA, SEDG, SHOP, SID, SITM, SJI, SLRX, SMG, SMSI, SMTX, SONO, SPNE, SPR, SPT, SQ, SRI, SRPT, STAA, STAY, STFC, STKL, STN, STNG, SWM, TALO, TBPH, TCP, TIVO, TLND, TMDX, TMHC, TMUS, TNC, TPC, TPVG, TRMB, TRNO, TROX, TRVG, TSE, TTGT, TVTY, TWLO, TWO, TXMD, UDR, UFCS, UGI, UIHC, UPWK, VBIV, VCYT, VIAV, VIV, VMC, VNDA, VNTR, VRTV, VTVT, VVUS, WATT, WCN, WD, WELL, WEN, WING, WKHS, WLL, WM, WMC, WPM, WPX, WTI, WTRG, WTS, WYND, WYNN, XEC, XPER, ZIXI, ZNGA, ZTS\n\n - Ex-div:\n\n  AMG, AWI, AZZ, CATC, CNXM, ET, ETR, FE, FELE, FSBW, GMLP, HTBK, INTC, KBH, LSBK, LSTR, MATX, NBN, NEP, NGL, NWBI, OFED, OPBK, PTMN, RUSHA, RUSHB, SIMO, SUN, VAM, VBTX, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -20,050K, previous: -27K)\n    - Crude Oil Imports (previous: -0.047M)\n    - Crude Oil Inventories (consensus: 8.125M, previous: 8.991M)\n    - Cushing Crude Oil Inventories (previous: 3.637M)\n    - Distillate Fuel Production (previous: -0.025M)\n    - EIA Refinery Crude Runs  (previous: 0.305M)\n    - EIA Weekly Distillates Stocks (consensus: 2.950M, previous: 5.092M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 2.0%)\n    - Gasoline Inventories (consensus: 0.325M, previous: -3.669M)\n    - Gasoline Production (previous: 0.530M)\n    - Heating Oil Stockpiles (previous: -0.892M)\n    - MBA 30-Year Mortgage Rate (previous: 3.43%)\n    - MBA Mortgage Applications (previous: -3.3%)\n    - Seevol Cushing Storage Report (previous: 4.150M)\n\n## Upcoming events for Thursday, May  7th\n\n - Expected earnings:\n\n  AAN, AAOI, AAON, AAWW, AAXN, ABC, ABEV, ACAD, ADMS, ADSW, ADT, AES, AGEN, AGS, AHT, AINC, AIRG, AIV, AL, ALBO, ALDX, ALRM, ALTR, AMH, AMPH, ANIK, ANIP, APPN, AQB, AQN, ARGO, ARI, ARNA, ARWR, ASMB, ASUR, ASYS, AT, ATEN, ATHX, ATNX, ATTO, AUMN, AUTL, AUTO, AVID, AVLR, AXDX, AZUL, BAP, BATRK, BCE, BCEI, BCLI, BDSI, BDX, BECN, BFS, BGG, BGSF, BHC, BILL, BIOL, BJRI, BKNG, BLL, BMY, BRBR, BRX, BSIG, BTE, BUD, BV, CALA, CARE, CARG, CATS, CBIO, CBRE, CCOI, CCRN, CDXS, CFX, CHMA, CHRS, CIO, CIR, CLBS, CLNC, CLNE, CLUB, CLXT, CNDT, CNNE, CNP, CNQ, COLD, COLL, COMM, CORE, CPT, CRC, CRL, CRNC, CSLT, CTB, CTMX, CTRE, CTSH, CTVA, CUBE, CUTR, CVA, CVEO, CVTI, CWEN, CWH, CWK, CWST, CYRX, DBX, DEI, DFIN, DGII, DHC, DHR, DLPH, DLR, DLX, DOC, DOX, DRNA, DSKE, DVAX, DZSI, ECOL, ECOM, ED, EDIT, EFC, EGAN, EGLE, ELAN, ELOX, ELY, ENB, ENDP, ENLC, ENR, ENV, EOG, EPAM, EPC, EQH, EQNR, EQT, ERIE, ESTA, ESTE, EURN, EVH, EXLS, EXPE, FARM, FET, FFG, FGEN, FIS, FISV, FLDM, FLEX, FLMN, FLR, FLS, FLT, FLXN, FNKO, FOCS, FOLD, FORR, FPRX, FRGI, FSLR, FVRR, FWONA, FWONK, GCI, GDEN, GDP, GERN, GH, GKOS, GLIBA, GLOG, GLOP, GLPG, GLUU, GMED, GNC, GOLF, GPOR, GPRO, GSAT, GTN, GTS, GWRS, HAIN, HASI, HBB, HCI, HEAR, HES, HESM, HFC, HII, HIMX, HL, HLF, HLT, HMHC, HMN, HNGR, HSDT, HSKA, HST, IART, ICD, ICUI, IDCC, IEA, IHRT, IIIV, IMMR, ING, INSW, INVE, IPHI, IRM, IRTC, IT, ITCI, ITGR, JBLU, JCAP, JOBS, KALA, KAR, KIN, KINS, KLDO, KMPR, KRP, KTB, KTOS, LAMR, LAUR, LBRDA, LBRDK, LCTX, LHCG, LIN, LMRK, LNT, LOPE, LQDA, LQDT, LSI, LSXMA, LSXMK, LTRX, LUNA, LXP, LYV, MAC, MAIN, MATW, MBUU, MCHP, MCHX, MCRB, MD, MDRX, MDU, MGA, MGEN, MIDD, MMI, MMS, MN, MNLO, MNST, MNTA, MR, MRAM, MRNA, MSI, MT, MTD, MTG, MTW, MUR, MVIS, NBY, NCSM, NET, NEWT, NGS, NGVC, NH, NINE, NKTR, NMRK, NNBR, NOMD, NRG, NSCO, NSIT, NTCT, NTLA, NUAN, NVAX, NVCN, NVEE, NWPX, NWSA, NXRT, OCSI, OCSL, OEC, OGE, OLED, OMCL, ONCY, ONEW, OPCH, OPGN, OPTN, ORTX, OTIS, OVV, PAHC, PAR, PAYS, PBA, PBH, PBYI, PCRX, PCTI, PCTY, PDCE, PDFS, PDLI, PEB, PEI, PEN, PENN, PETQ, PFIE, PFNX, PFPT, PFSI, PFSW, PGNX, PLUG, PMT, PODD, POST, POWI, PRA, PRAA, PRDO, PRFT, PRMW, PROF, PRVB, PSNL, PTGX, PWR, QLYS, QRVO, RBA, RCUS, RDFN, RDUS, REG, REYN, RGNX, RHP, RLGY, RMNI, ROKU, RPD, RTIX, RTX, RVNC, SAGE, SAIL, SAND, SCOR, SELB, SERV, SHLX, SKYW, SLRC, SNDX, SNSS, SP, SPAR, SPH, SPPI, SPWR, SRCL, SREV, SRLP, SRTS, SSTI, STMP, SUNS, SUNW, SVMK, SWIR, SWX, SXI, SYNA, SYRS, TACT, TAST, TCDA, TCRD, TCX, TDC, TEVA, TGNA, THRM, THS, TMST, TNAV, TPIC, TPRE, TRGP, TRHC, TRUE, TRVN, TTD, TU, TUSK, TWI, TWST, UBER, UEIC, UMH, UNT, UPLD, URGN, USAK, VECO, VEON, VG, VIRT, VSLR, VSTO, VVI, VVNT, WEX, WLDN, WPG, WRI, WRLD, WSR, XAN, XEL, XERS, XFOR, XNCR, XOG, XONE, YELP, YETI, YMAB, ZG, ZIOP, ZYME\n\n - Ex-div:\n\n  AEP, AFB, AFIN, AMSWA, ARTNA, ASA, BCBP, BPFH, CADE, CBAN, CDR, CELP, CEQP, CINR, CIT, CLB, CPLP, CS, CSFL, CWBC, CXO, FCBC, FCF, FRBA, GABC, HMLP, HOPE, HSII, IBM, JBHT, LAD, LW, MET, MMLP, MMP, MPLX, NBLX, NSC, NYCB, OPB, PCTI, PEAK, PFE, PH, PPBI, RBNC, SBFG, SBUX, SC, SCHW, SFBC, SIRI, SMBK, SON, SSB, STL, SXT, WAB, WAFD, WFC, WMT, WSFS, ZION\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.095%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 222.288K)\n    - Challenger Job Cuts (previous: 266.9%)\n    - Consumer Credit (consensus: 15.00B, previous: 22.33B)\n    - Continuing Jobless Claims (consensus: 19,905K, previous: 17,992K)\n    - FOMC Member Harker Speaks\n    - Initial Jobless Claims (consensus: 3,000K, previous: 3,839K)\n    - Jobless Claims 4-Week Avg. (previous: 5,033.25K)\n    - Natural Gas Storage (previous: 70B)\n    - Nonfarm Productivity (consensus: -5.5%, previous: 1.2%)\n    - Unit Labor Costs (consensus: 4.0%, previous: 0.9%)\n\n## Upcoming events for Friday, May  8th\n\n - Stock splits:\n\n    - CLAR @ **100.002:100** (Payable date: 05/22/2020)\n    - DSS @ **1:30**\n\n - Expected earnings:\n\n  ABEO, ABR, ACRE, AFI, AIRI, AKTS, AMPE, AMRS, AN, ARLP, ATH, ATNM, AVA, AXL, AXSM, AY, BCC, BIP, BLMN, BPMP, BR, BRFS, BSTC, BWEN, CARR, CATM, CBPO, CFRX, CLMT, CLNY, CNTY, CRON, CYD, DISH, DS, DSSI, EPIX, ERF, ESNT, EVOP, EVTC, EXC, FBIO, FLY, GALT, GLP, GPX, GTT, GVA, HCFT, HEES, HMSY, HSC, IBP, IEP, IMVT, INTT, KIM, KOP, LEA, MAG, MBIO, MCC, MDP, MOTS, MRCC, MRSN, MYOS, NBL, NBLX, NBRV, NJR, NMM, NMR, NMTR, NP, NVIV, NWN, OCUL, OFIX, OFS, OIIM, OUT, PBF, PBFX, PGC, PLYM, PNW, PPL, PZG, REPH, RIOT, RLH, ROAD, RUTH, SABR, SDPI, SEAS, SHO, SIC, SMLP, SNR, SPRO, SR, SSP, STML, SUP, SWCH, SXC, TEF, TEN, TGLS, TGS, TGTX, TILE, TOT, TRCH, TWNK, UFS, UI, UNIT, URG, UTSI, VAC, VIVO, VTR, WRN, XRAY, ZOM\n\n - Ex-div:\n\n  AAPL, AB, ACC, ALX, AROC, BOKF, BP, BRO, BSBR, COF, COP, CSV, CWT, DHF, DHI, EBTC, FBK, FBMS, FHI, FIBK, GLP, GROW, GWW, HBCP, HP, IBTX, ISBC, IVZ, JHG, LAZ, LBAI, MPB, MPX, MRLN, MTG, MWA, NBL, NMM, NS, OLN, PPG, PSTL, PZZA, ROL, SCHN, SJW, SONA, STND, SXI, SYX, TECH, VGI, VNO, WLKP, WMK, WVFC, X, ZTR\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 3.3%, previous: 3.1%)\n    - Average Hourly Earnings (consensus: 0.3%, previous: 0.4%)\n    - Average Weekly Hours (consensus: 33.7, previous: 34.2)\n    - CFTC Aluminium speculative net positions (previous: 87.2K)\n    - CFTC Copper speculative net positions (previous: -20.9K)\n    - CFTC Corn speculative net positions (previous: -98.5K)\n    - CFTC Crude Oil speculative net positions (previous: 587.2K)\n    - CFTC Gold speculative net positions (previous: 249.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 8.7K)\n    - CFTC Natural Gas speculative net positions (previous: -68.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -140.0K)\n    - CFTC Silver speculative net positions (previous: 28.5K)\n    - CFTC Soybeans speculative net positions (previous: 83.0K)\n    - CFTC Wheat speculative net positions (previous: 33.7K)\n    - Government Payrolls (previous: 12.0K)\n    - Manufacturing Payrolls (consensus: -2,385K, previous: -18K)\n    - Nonfarm Payrolls (consensus: -21,853K, previous: -701K)\n    - Participation Rate (previous: 62.7%)\n    - Private Nonfarm Payrolls (consensus: -21,050K, previous: -713K)\n    - U6 Unemployment Rate (previous: 8.7%)\n    - Unemployment Rate (consensus: 16.0%, previous: 4.4%)\n    - Wholesale Inventories (consensus: -1.0%, previous: -0.7%)\n    - Wholesale Trade Sales (previous: -0.8%)\n\n^^^^2020-05-05",
        "created_utc": 1588686346,
        "id": "fpk1yg6",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1588715146.0
    },
    {
        "author": "Contra-dick-tor",
        "body": "Thats because IBM didnt innovate enough and keep up trends",
        "created_utc": 1588515955,
        "id": "fpcylyx",
        "score": 1,
        "subreddit": "investing",
        "created": 1588544755.0
    },
    {
        "author": "Kwc0055",
        "body": "Dividend stocks: coke, IBM, AT&amp;T etc. large mature companies that pay steady and reliable dividends. \n\nGrowth stocks: Tesla, Nvidia, AMD, FB, Google etc etc. companies with rapid growth business models. Although fb and google seem to be slowing down lately they are still incredibly profitable.",
        "created_utc": 1588519563,
        "id": "fpd4c97",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588548363.0
    },
    {
        "author": "Caveat_Venditor_",
        "body": "RCA, F, GE, RIMM, IBM",
        "created_utc": 1588519991,
        "id": "fpd5240",
        "score": 1,
        "subreddit": "investing",
        "created": 1588548791.0
    },
    {
        "author": "nikolatosic",
        "body": "Google is search based on text and hoping websites adjust to that using SEO soft influence. Their banners are more and more lowering quality of search and overall search use is dropping due to apps and closed websites. They are big but a niche. Their model works for specific products only.\n\nFacebook is a developing world family and friendship automation. A lot of room to grow in places like Bangladesh. But technology which delivers value to customers is actually simple and they can easily be replaced. They are based on soft value not tech. \n\nAmazon us big in USA. It is a big country which used mail order catalogs way before internet. You can not have a store everywhere in America. Rest of the world isn't like that. They have been adding value to their offering because they want to offer the most for least like all retail but eventually someone will take this over. Just that their competitor can not be in USA or Europe. Europe is too small.\n\nData means nothing to customers. Customers want value for money. Data maybe can help speed up selection within millions of products but this doesn't really work as good as they promise. Ads and e-commerce recommendations are very much off once shoppers are not super easy predictable. Data and AI are a hype.\n\nMicrosoft also is a business software company with some diversification. In business it succeeds just like SAP and Oracle etc. It enters and it is hard to get it out. Not many players there as well as CIOs don't take much risk. But it's success is not because of them but simply because of digitalisation and globalisation. Microsoft itself hasn't created any relevant competitive value. They are just a big political entity in the right time and place. If something changes for them it will also change for SAP Oracle IBM etc. But they appear to be different because of hardware and games (more consumer) and Bill Gates always spent a lot on his PR.",
        "created_utc": 1588573690,
        "id": "fpfk38b",
        "score": 1,
        "subreddit": "investing",
        "created": 1588602490.0
    },
    {
        "author": "Smok3dSalmon",
        "body": "When he put down that fat investment in IBM, I knew he didn't understand technology. He just doesn't invest in stuff he doesn't know. Imagine if he plunked that down into Amazon. This was like 2015 or something.",
        "created_utc": 1588489460,
        "id": "fpc6qct",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588518260.0
    },
    {
        "author": "paq12x",
        "body": "Warren Buffett is a conservative investor.  His criteria are to maintain wealth for his clients.\n\nEven that, in the last 20 years, he has been underperforming the market.  That's the period airline stocks were doing great (and he had a bunch of them).\n\nHe also sold IBM when at the end of 2019 when the stock hit its low.  Since then it recovered just to get hit again with COVID-19.  Currently, it's at the same level back in 2019.\n\nThis time,  I am betting that he's wrong.   I don't think the Fed would let a market segment that frequency talked about to go under.   The Fed and Trump won't let their $$$ that went into the airliners bailout package vaporize.  \n\nThe Fed will see their initial loan repaid even at the cost of dumping billion more in grant into the airliners. - Whatever it costs - is the stand the Fed is holding right now.   I will not bet against the Fed even if that means disagreeing with Warren.",
        "created_utc": 1588502201,
        "id": "fpcivwk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588531001.0
    },
    {
        "author": "zugiheos",
        "body": "Just dig through archived forums to find what people thought of the giants of the past.\n\n\nEvery decade the top companies are almost all replaced by new ones (*) and noone ever sees it coming. It’s 1980s. IBM is king of the world. How could it ever loose value? It basically has a monopoly on PCs.\n\n\n(Almost) All companies decline eventually and every time everyone thinks “this time is different”. The chances that the top 5 companies of this decade will be the 5 top ones of the next are nill. Some new trend will come, new industries will raise. Right now Google, FB are add platforms, apple is a hardware provider and Amazon is primarily a hosting service. There’s nothing glamorous, magical or irreplaceable about their business model. \n\n\n*: https://etfdb.com/history-of-the-s-and-p-500/",
        "created_utc": 1588541904,
        "id": "fpe7ies",
        "score": 1,
        "subreddit": "investing",
        "created": 1588570704.0
    },
    {
        "author": "TrenAndOptions",
        "body": "IBM also. Missed opportunities in Visa/Mastercard. SBUX, Google/Amazon just bc he “doesn’t understand tech” lol so Apple is a consumer company according to him but the number 1 search engine in the world isn’t? More people use google than have iPhones. \n\nReally curious what happens to Berkshire when Buffett dies. Looks like Iike value investing is dead who wants to pick up old dying companies like retail, oil",
        "created_utc": 1588531983,
        "id": "fpdq505",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588560783.0
    },
    {
        "author": "Telos13",
        "body": "Bought DIS, V, T, SBUX\n\neyeing RTX, IBM",
        "created_utc": 1588548495,
        "id": "fpej15p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588577295.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  4th of May\n\n\n\n## Upcoming events for Tuesday, May  5th\n\n - Expected earnings:\n\n  ABG, ACLS, ACM, ACOR, ADNT, ADRO, AER, AGCO, AGLE, AGN, AGRX, AGTC, AHCO, AIZ, AJX, AKBA, AKCA, AKR, ALK, ALL, AMCX, AME, AMK, ANAB, ANDE, ANET, AOS, AOSL, APTO, APTV, AQST, ARCB, ARCC, ARDX, ARMK, AROC, ASC, ASH, ATCO, ATGE, ATI, ATRS, ATSG, ATVI, AXNX, BCH, BCO, BGCP, BGFV, BGS, BHVN, BKD, BKI, BLCM, BLD, BLDP, BLKB, BMCH, BRG, BTAI, BTG, BXC, BYND, CAI, CAKE, CAMP, CARA, CBB, CBFV, CBMG, CC, CDK, CEA, CELC, CEQP, CERS, CGBD, CHCT, CHFS, CHUY, CLDX, CLPT, CLVS, CLW, CMP, CMPR, CNK, CNO, COHR, COHU, CPAC, CPSI, CRD.B, CRI, CSII, CTLT, CTRE, CTSO, CVLT, CZNC, D, DBD, DCPH, DD, DEA, DENN, DHT, DIS, DK, DKL, DNR, DOOR, DRRX, DVA, DVN, DXPE, EA, EC, EFC, EIDX, ENPH, EOLS, EQR, ETM, ETON, EVBG, EVRI, EXEL, EXPD, FATE, FCAU, FCBC, FI, FMC, FNHC, FPH, FSTR, GBL, GFN, GLDD, GLMD, GLRE, GLT, GMDA, GORO, GPI, GRPN, GRWG, GTE, GTES, HA, HAE, HBIO, HCHC, HCKT, HCR, HE, HPP, HSIC, HTA, HVT, HWM, I, ICAD, ICFI, INCY, INFI, INGN, INGR, INSP, IOTS, IOVA, IPGP, IR, ITW, IX, JAZZ, JBGS, JELD, JLL, JOUT, KAR, KEX, KGC, KIDS, KLAC, KOPN, KPTI, KRYS, KZR, LADR, LAND, LC, LCII, LDOS, LFVN, LGIH, LHX, LILA, LITE, LL, LPSN, LPX, MAT, MATX, MCS, MDC, MEC, MED, MELI, MEOH, MFA, MGNX, MGP, MIC, MLCO, MLM, MMI, MNK, MODN, MOR, MPC, MPLX, MSC, MTCH, MUX, MYGN, NBR, NEM, NEX, NEXA, NEXT, NLTX, NPO, NR, NRZ, NTEC, NVRO, NVTA, OAS, OCFT, OLP, OMP, ONTO, OPK, ORCC, OSPN, OTTR, OVID, OXFD, OXY, PAA, PAGP, PAYS, PBPB, PEAK, PFMT, PINC, PINS, PKI, PLMR, PLNT, PLT, PLYA, PQG, PRIM, PRNB, PRO, PRPL, PRU, PUMP, PZZA, QTRX, QUAD, QUMU, QUOT, RCM, RDHL, REGN, RGA, RGNX, RGS, RIGL, RPAI, RRR, RSG, RVI, RVSB, RWLK, RYAM, SAND, SBAC, SBSI, SEE, SFM, SGMS, SIFY, SIGI, SLF, SND, SOHO, SOLO, SPCE, SPG, SPKE, SPN, SRC, STIM, STOR, SU, SUPN, SWX, SYY, TA, TCO, TDG, TEUM, TH, TISI, TREC, TREE, TRI, TRIP, TROV, TSLX, TSQ, TSU, TT, TTI, TTOO, TUES, UEC, UFPT, USAC, USCR, USFD, USWS, VAPO, VCEL, VGR, VGZ, VOYA, VPG, VRCA, VREX, VRSK, VRT, VST, VVUS, VYGR, W, WBT, WES, WIFI, WMGI, WRK, WTTR, WU, XENE, XYL, Y, YORW, ZAGG, ZGNX\n\n - Ex-div:\n\n  AMTD, BFIN, DCOM, EIG, MDC, PHG, RELL, WBS, WTBA\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 10.000M)\n    - Exports (previous: 207.50B)\n    - IBD/TIPP Economic Optimism (previous: 47.8)\n    - ISM Non-Manufacturing Business Activity (previous: 48.0)\n    - ISM Non-Manufacturing Employment (previous: 47.0)\n    - ISM Non-Manufacturing New Orders (previous: 52.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 52.5)\n    - ISM Non-Manufacturing Prices (previous: 50.0)\n    - Imports (previous: 247.50B)\n    - Markit Composite PMI (consensus: 27.4, previous: 40.9)\n    - Redbook (previous: -11.8%)\n    - Redbook (previous: -8.1%)\n    - Services PMI (consensus: 27.0, previous: 39.8)\n    - Trade Balance (consensus: -44.00B, previous: -39.90B)\n\n## Upcoming events for Wednesday, May  6th\n\n - Expected earnings:\n\n  ACMR, ACRE, ADMA, ADTN, AEIS, AEL, AEP, AERI, AFIN, AI, ALB, ALE, ALG, ALGT, ALLO, ALNY, ALTM, ALXN, AMED, AMOT, AMP, AMPY, ANGI, ANSS, AP, APA, AQUA, ARES, ASM, ASTE, ATO, ATRA, AVB, AVNS, AWK, AXGN, AXTA, AYX, AZPN, BBSI, BBU, BCRX, BCSF, BEAT, BEP, BFAM, BFYT, BG, BHR, BIO, BKCC, BNFT, BPMC, BRKR, BRY, BWA, CAPL, CARS, CBZ, CCMP, CCO, CDAY, CDW, CECE, CENT, CENTA, CF, CFMS, CGEN, CHEF, CHMG, CIM, CLDT, CLI, CLLS, CNHI, CNST, CORR, CPA, CPG, CPK, CPLP, CRHM, CRK, CSGS, CSTE, CTL, CUB, CVNA, CVS, CW, CXW, CYTK, DAR, DCP, DDD, DHX, DISCA, DLHC, DNN, DNOW, DRQ, DRTT, DX, EAF, ELVT, EMKR, ENBL, ENTA, EPAY, EPR, EQIX, ERYP, ES, ESE, ESPR, ESS, ETSY, EVFM, EVRG, EXAS, EXR, EXTR, EYPT, FCPT, FG, FIT, FLIR, FMS, FNV, FOE, FORM, FOXA, FOXF, FRT, FSK, FSLY, FTDR, FTNT, FTS, FUN, GBT, GCP, GDDY, GEL, GM, GMRE, GNK, GNL, GOLD, GPC, GPN, GRUB, GSS, GSX, GTHX, GTY, H, HDSN, HEP, HI, HR, HSON, HT, HUBS, HZNP, IAA, IAC, IDN, IIPR, IMMU, IMUX, INMD, INN, INSG, INVH, IO, IONS, IPI, IRT, IRWD, ISEE, IVC, J, JAX, JNCE, KFRC, KKR, KL, KRG, KW, LASR, LCI, LGND, LNC, LPI, LVGO, LXU, LYFT, MAA, MCFT, MEET, MET, MFC, MLVF, MNKD, MNR, MOR, MRO, MTRX, MX, MYE, NBIX, NDLS, NE, NEPH, NI, NMFC, NMIH, NOA, NREF, NTR, NTRA, NUS, NUVA, NXST, NYT, ODP, OMI, OPK, OSB, OSUR, PAAS, PACB, PAG, PARR, PEIX, PERI, PGEN, PING, PKOH, PPD, PRTA, PRTS, PSN, PTON, PXD, PYPL, PZZA, QDEL, QGEN, QMCO, QNST, QRTEA, QTWO, RAIL, RARE, RBBN, RCII, RCL, RDN, RDWR, RE, REAL, RESN, REZI, RGEN, RGLD, RM, RMAX, RNG, RNR, ROCK, RP, RST, RTLR, RUBI, RUN, RYI, SAVE, SBBP, SBGI, SBH, SBOW, SBRA, SEDG, SHOP, SID, SITM, SJI, SLRX, SMG, SMSI, SONO, SPNE, SPR, SPT, SQ, SRI, SRPT, STAA, STAY, STFC, STKL, STN, STNG, SWM, TALO, TBPH, TCP, TIVO, TLND, TMDX, TMHC, TMUS, TNC, TPC, TPVG, TRMB, TRNO, TROX, TRVG, TSE, TTGT, TUSK, TVTY, TWLO, TWO, TXMD, UDR, UFCS, UGI, UIHC, UPWK, VBIV, VCYT, VIAV, VIV, VMC, VNDA, VNTR, VRTV, VTVT, VVUS, WATT, WCN, WD, WELL, WEN, WING, WKHS, WLL, WM, WMC, WPM, WPX, WTI, WTRG, WTS, WYND, XEC, XPER, ZIXI, ZNGA, ZTS\n\n - Ex-div:\n\n  AMG, AWI, AZZ, CATC, CNXM, ET, ETR, FE, FELE, FSBW, GMLP, HTBK, INTC, KBH, LSBK, LSTR, MATX, NBN, NEP, NGL, NWBI, OFED, OPBK, PTMN, RUSHA, RUSHB, SIMO, SUN, VAM, VBTX, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -20,000K, previous: -27K)\n    - Crude Oil Imports (previous: -0.047M)\n    - Crude Oil Inventories (consensus: 10.619M, previous: 8.991M)\n    - Cushing Crude Oil Inventories (previous: 3.637M)\n    - Distillate Fuel Production (previous: -0.025M)\n    - EIA Refinery Crude Runs  (previous: 0.305M)\n    - EIA Weekly Distillates Stocks (consensus: 3.600M, previous: 5.092M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.7%, previous: 2.0%)\n    - Gasoline Inventories (consensus: 2.527M, previous: -3.669M)\n    - Gasoline Production (previous: 0.530M)\n    - Heating Oil Stockpiles (previous: -0.892M)\n    - MBA 30-Year Mortgage Rate (previous: 3.43%)\n    - MBA Mortgage Applications (previous: -3.3%)\n    - Seevol Cushing Storage Report (previous: 4.150M)\n\n## Upcoming events for Thursday, May  7th\n\n - Expected earnings:\n\n  AAN, AAOI, AAON, AAWW, AAXN, ABC, ABEV, ACAD, ACIA, ADMS, ADSW, ADT, AES, AGEN, AGS, AHT, AINC, AIRG, AIV, AL, ALBO, ALDX, ALRM, ALTR, AMH, ANIK, ANIP, APPN, AQB, AQN, ARGO, ARI, ARNA, ARWR, ASMB, ASUR, ASYS, AT, ATEN, ATNX, ATTO, AUMN, AUTL, AUTO, AVID, AVLR, AXDX, AZUL, BAP, BATRK, BCE, BCEI, BCLI, BDSI, BDX, BECN, BFS, BGG, BGSF, BHC, BILL, BIOL, BJRI, BKNG, BLL, BMY, BRBR, BRX, BSIG, BTE, BUD, BV, CALA, CARE, CARG, CBIO, CBRE, CCOI, CCRN, CDXS, CFX, CHMA, CHRS, CIO, CIR, CLBS, CLNC, CLNE, CLUB, CLXT, CNDT, CNNE, CNP, CNQ, COLD, COLL, COMM, CORE, CPT, CRC, CRL, CRNC, CSLT, CTB, CTMX, CTSH, CTVA, CUBE, CUTR, CVA, CVEO, CVTI, CWEN, CWK, CWST, CYRX, DBX, DEI, DFIN, DGII, DHC, DHR, DLPH, DLR, DLX, DOC, DOX, DRNA, DSKE, DVAX, DZSI, ECOL, ECOM, ED, EDIT, EFC, EGAN, EGLE, ELAN, ELGX, ELOX, ENB, ENDP, ENLC, ENR, ENV, EOG, EPAM, EPC, EQH, EQNR, EQT, ERIE, ESTA, ESTE, EURN, EVH, EVLO, EXLS, EXPE, FARM, FET, FFG, FGEN, FIS, FISV, FLDM, FLEX, FLMN, FLR, FLS, FLT, FLXN, FNKO, FOCS, FOLD, FORR, FPRX, FSLR, FVRR, FWONA, FWONK, GCI, GDP, GERN, GH, GKOS, GLIBA, GLOG, GLOP, GLPG, GLUU, GMED, GNC, GOLF, GPOR, GPRO, GSAT, GTN, GTS, GWRS, HAIN, HASI, HBB, HCI, HEAR, HES, HESM, HFC, HII, HIMX, HL, HLF, HLT, HMHC, HMN, HNGR, HSDT, HSKA, HST, IART, ICD, ICUI, IDCC, IEA, IHRT, IIIV, IMMR, ING, INSW, INVE, IPHI, IRM, IRTC, IT, ITCI, ITGR, JBLU, JCAP, JOBS, KALA, KAR, KIN, KINS, KLDO, KMPR, KRP, KTB, KTOS, KWR, LAMR, LAUR, LBRDA, LBRDK, LCTX, LHCG, LIN, LMRK, LNT, LOPE, LQDA, LQDT, LSI, LSXMA, LSXMK, LTRX, LUNA, LXP, LYG, LYV, MAC, MAIN, MATW, MBUU, MCHP, MCHX, MCRB, MD, MDRX, MDU, MGA, MGEN, MMI, MMS, MN, MNLO, MNST, MNTA, MR, MRAM, MRNA, MSI, MT, MTD, MTG, MTW, MUR, MVIS, NBY, NCSM, NET, NEWT, NGS, NGVC, NINE, NKTR, NMR, NMRK, NOMD, NRG, NSCO, NSIT, NTCT, NTLA, NUAN, NVAX, NVCN, NVEE, NWPX, NWSA, NXRT, OCSI, OCSL, OEC, OGE, OLED, OMCL, ONCY, ONEW, OPCH, OPGN, OPTN, ORTX, OTIS, OVV, PAHC, PAR, PBA, PBH, PBYI, PCRX, PCTI, PCTY, PDCE, PDFS, PDLI, PEB, PEI, PEN, PENN, PETQ, PFIE, PFNX, PFPT, PFSI, PFSW, PGNX, PLUG, PMT, PODD, POST, POWI, PRA, PRAA, PRDO, PRFT, PRMW, PROF, PRVB, PSNL, PWFL, PWR, QLYS, QRVO, RBA, RCUS, RDFN, RDUS, REG, REYN, RGNX, RHP, RLGY, RMNI, ROKU, RPD, RTIX, RTX, RVNC, SAGE, SAIL, SAND, SAR, SCOR, SELB, SERV, SHLX, SKYW, SLRC, SNDX, SNSS, SP, SPAR, SPH, SPPI, SPWR, SRCL, SREV, SRLP, SRTS, SSTI, STMP, SUNS, SUNW, SVMK, SWIR, SXI, SYNA, SYRS, TACT, TAST, TCDA, TCRD, TCX, TDC, TEVA, TGNA, THRM, THS, TMST, TNAV, TPIC, TPRE, TRGP, TRHC, TRUE, TRVN, TS, TTD, TU, TWI, TWST, UBER, UEIC, UMH, UNT, UPLD, URGN, USAK, VECO, VEON, VG, VIRT, VSLR, VSTO, VVI, VVNT, WEX, WLDN, WPG, WRI, WRLD, WSR, XAN, XEL, XERS, XFOR, XNCR, XOG, XONE, YELP, YETI, YMAB, ZG, ZIOP, ZYME\n\n - Ex-div:\n\n  AEP, AFB, AFIN, AMSWA, ARTNA, ASA, BCBP, BPFH, CADE, CBAN, CDR, CELP, CEQP, CINR, CIT, CLB, CPLP, CS, CSFL, CWBC, CXO, FCBC, FCF, FRBA, GABC, HMLP, HOPE, HSII, IBM, JBHT, LAD, LW, MET, MMLP, MMP, MPLX, NBLX, NSC, NYCB, OPB, PCTI, PFE, PH, PPBI, RBNC, SBFG, SBUX, SC, SCHW, SFBC, SIRI, SMBK, SON, SSB, STL, SXT, WAB, WAFD, WFC, WMT, WSFS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.095%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 222.288K)\n    - Challenger Job Cuts (previous: 266.9%)\n    - Consumer Credit (consensus: 15.00B, previous: 22.33B)\n    - Continuing Jobless Claims (consensus: 19,810K, previous: 17,992K)\n    - FOMC Member Harker Speaks\n    - Initial Jobless Claims (consensus: 3,000K, previous: 3,839K)\n    - Jobless Claims 4-Week Avg. (previous: 5,033.25K)\n    - Natural Gas Storage (previous: 70B)\n    - Nonfarm Productivity (consensus: -5.5%, previous: 1.2%)\n    - Unit Labor Costs (consensus: 4.0%, previous: 0.9%)\n\n^^^^2020-05-04",
        "created_utc": 1588601659,
        "id": "fpgfi8g",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1588630459.0
    },
    {
        "author": "M4Herbs",
        "body": "True, IBM and Microsoft for example would have been a good pick too. But there is a long list of companies that either don’t exist no more, or are pretty much worthless in comparison. I think Forrest Gump did a good job overall.",
        "created_utc": 1588606063,
        "id": "fpgnfhw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588634863.0
    },
    {
        "author": "adam250250",
        "body": "I think warren buffet has lost some of his edge. He missed out on all the good tech companies and instead opted for IBM. I see the tech industrys doing the best then insurance companies or healthcare companies coming in at second for sustainable growth.",
        "created_utc": 1588537977,
        "id": "fpe0lr2",
        "score": 1,
        "subreddit": "investing",
        "created": 1588566777.0
    },
    {
        "author": "tooeasilybored",
        "body": "I felt the same way too then I’m reminded of the fact that a significant % of our population are nowhere near rational. \n\n\nWorking at home is not new, its been done for a very long time. My dads been at IBM forever, and he’s been working at home since the 2000s. \n\nCompanies know how much money they can save, it’s just that a lot of people would end up losing their job so that avenue was never pushed/explored too much as long as there was enough revenue coming in. Think of all those office mid level management types, most of those jobs would be eliminated. \n\nIt’s also to show off, I worked for a company that had a contract with AC. They would bring these guys in, show them around the office, manufacturing facilities then head to the board room. \n\nSo who knows, I’m thinking it’ll bounce back eventually as we get back to our old ways.",
        "created_utc": 1588611137,
        "id": "fpgx8g2",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1588639937.0
    },
    {
        "author": "Nettletooth",
        "body": "He sold out, so what.\n\nBuffet has made plenty of mistakes in recent times.\n\nKHC, we see how that is going? Might be choked out by debt eventually here. \nIBM, didn't ever do shit.\nOXY, so how is that going? Now it is stuffed full of debt, a zombie in danger of bankruptcy. \n\nHow did buying DAL on the dip work out? \n\nI have nothing bad to say about him as a person, but as an investor he is losing his touch somewhat. \n\nThis is not to say I am bullish on airlines, but... I think Buffet is lost in this investing environment. This crisis has confused and bewildered many great investors, and some have adapted a lot better than others.\n\nPlenty of funds are picking thier spots in the last month and raking in some great profits, but Buffet is there, stuck in the headlights.  He is not an oracle, merely a ordinary, reasonably good investor that don't hold a candle to Citadel, Renaissance, Two Sigma, Bridgewater, and many other funds.",
        "created_utc": 1588570673,
        "id": "fpfgna4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588599473.0
    },
    {
        "author": "patagoniacalling",
        "body": "Yikes! It seems Intel and IBM are competing with each other a lot these days to see who will race to bottom first.",
        "created_utc": 1588548322,
        "id": "fpeipwc",
        "score": 1,
        "subreddit": "investing",
        "created": 1588577122.0
    },
    {
        "author": "MedEng3",
        "body": "I'm not good at investing, despite my recent dumbass luck:\n\n- +51% TSLA (01SEP20 to 02DEC20)\n\n- +5% GLD (04DEC20 to 17JAN20)\n\n- -17% IBM (03FEB20 to current)\n\nEach year my wife and I compete against each other with an insignificant amount of money. She is up &gt;50% since AUG20 in large due to AMD.\n\nIs this sustainable? Of course not. All my real investments are in broad exposure indexes for the next 40-years. I can achieve average returns through diversification. I have no idea how to sustainably achieve above average returns.",
        "created_utc": 1588344950,
        "id": "fp62q1j",
        "score": 1,
        "subreddit": "investing",
        "created": 1588373750.0
    },
    {
        "author": "Fujit0ra",
        "body": "I have FOMO going outside in NYC but can't risk getting this shit and spreading it to parents. Sigh, will stay inside. Long $AMZN, short $IBM",
        "created_utc": 1588450093,
        "id": "fpakl3r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588478893.0
    },
    {
        "author": "lost_in_life_34",
        "body": "AMZN and MSFT are the ibm and other mainframe companies of the 70’s\n\nThe PC came along and killed mainframes. IOT and other small devices are the next PC",
        "created_utc": 1588473394,
        "id": "fpbmexf",
        "score": 1,
        "subreddit": "investing",
        "created": 1588502194.0
    },
    {
        "author": "verbrand24",
        "body": "This is pretty irrelevant, but I was on a project that took over a contract that IBM had. After seeing their code, business practices, and how horrifically things were ran I lost all confidence in IBM as a company.\n\nThis is irrelevant because the amount of people that were apart of that project was a super small fraction of the IBM employees, but I still have a bad taste in my mouth from dealing with that dumpster fire. \n\nJust being in the industry, I have no confidence in IBM's ability to challenge amazon, google, or Microsoft. They hire under qualified engineers to save a buck, they are horrible at developing talent, their pay isn't competitive, and frankly it's not as sexy working for IBM as it is google. Without the talent to tackle these challenging endeavors they'll never catch up. These tech titans are only big as their technical talent is.\n\nAs a disclaimer, I've never worked for IBM and these are just rumors, observations, and how their stock will relate to their product is a question mark from me.",
        "created_utc": 1588362504,
        "id": "fp71th7",
        "score": 1,
        "subreddit": "investing",
        "created": 1588391304.0
    },
    {
        "author": "worldnews_is_shit",
        "body": "Ask any software engineer why would they choose IBM over Amazon for some project.\n\nStackoverflow's regularly votes IBM Watson and other cloud techs offered by IBM as one of the worst to work with.\n\nIBM is prime example of the damaging effects bean counting can have on the culture and vision of a company. \n\nWhy is the majority of IBM's workforce located in India? Why isn't the workforce more evenly distributed along other tech hubs like San Francisco, London, Berlin?\n\nIBM is not focusing on the important things and that's why they are greatly underperforming in a sector that have had an unprecedented growth in the last decade.",
        "created_utc": 1588677425,
        "id": "fpjpxh3",
        "score": 1,
        "subreddit": "investing",
        "created": 1588706225.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  4th of May\n\n\n\n## Upcoming events for Tuesday, May  5th\n\n - Expected earnings:\n\n  ABG, ACLS, ACM, ACOR, ADNT, ADRO, AER, AGCO, AGLE, AGN, AGRX, AGTC, AHCO, AIZ, AJX, AKBA, AKCA, AKR, ALK, ALL, AMCX, AME, AMK, ANAB, ANDE, ANET, AOS, AOSL, APTO, APTV, AQST, ARCB, ARCC, ARDX, ARMK, AROC, ASC, ASH, ATCO, ATGE, ATI, ATRS, ATSG, ATVI, AXNX, BCH, BCO, BGCP, BGFV, BGS, BHVN, BKD, BKI, BLCM, BLD, BLDP, BLKB, BMCH, BRG, BTAI, BTG, BXC, BYND, CAI, CAKE, CAMP, CARA, CBB, CBFV, CBMG, CC, CDK, CEA, CELC, CEQP, CERS, CGBD, CHCT, CHFS, CHUY, CLDX, CLPT, CLVS, CLW, CMP, CMPR, CNK, CNO, COHR, COHU, CPAC, CPSI, CRD.B, CRI, CSII, CTLT, CTRE, CTSO, CVLT, CZNC, D, DBD, DCPH, DD, DEA, DENN, DHT, DIS, DK, DKL, DNR, DOOR, DRRX, DVA, DVN, DXPE, EA, EC, EFC, EIDX, ENPH, EOLS, EQR, ETM, ETON, EVBG, EVRI, EXEL, EXPD, FATE, FCAU, FCBC, FI, FMC, FNHC, FPH, FSTR, GBL, GFN, GLDD, GLMD, GLRE, GLT, GMDA, GORO, GPI, GRPN, GRWG, GTE, GTES, HA, HAE, HBIO, HCHC, HCKT, HCR, HE, HPP, HSIC, HTA, HVT, HWM, I, ICAD, ICFI, INCY, INFI, INGN, INGR, INSP, IOTS, IOVA, IPGP, IR, ITW, IX, JAZZ, JBGS, JELD, JLL, JOUT, KAR, KEX, KGC, KIDS, KLAC, KOPN, KPTI, KRYS, KZR, LADR, LAND, LC, LCII, LDOS, LFVN, LGIH, LHX, LILA, LITE, LL, LPSN, LPX, MAT, MATX, MCS, MDC, MEC, MED, MELI, MEOH, MFA, MGNX, MGP, MIC, MLCO, MLM, MMI, MNK, MODN, MOR, MPC, MPLX, MSC, MTCH, MUX, MYGN, NBR, NEM, NEX, NEXA, NEXT, NLTX, NPO, NR, NRZ, NTEC, NVRO, NVTA, OAS, OCFT, OLP, OMP, ONTO, OPK, ORCC, OSPN, OTTR, OVID, OXFD, OXY, PAA, PAGP, PAYS, PBPB, PEAK, PFMT, PINC, PINS, PKI, PLMR, PLNT, PLT, PLYA, PQG, PRIM, PRNB, PRO, PRPL, PRU, PUMP, PZZA, QTRX, QUAD, QUMU, QUOT, RCM, RDHL, REGN, RGA, RGNX, RGS, RIGL, RPAI, RRR, RSG, RVI, RVSB, RWLK, RYAM, SAND, SBAC, SBSI, SEE, SFM, SGMS, SIFY, SIGI, SLF, SND, SOHO, SOLO, SPCE, SPG, SPKE, SPN, SRC, STIM, STOR, SU, SUPN, SWX, SYY, TA, TCO, TDG, TEUM, TH, TISI, TREC, TREE, TRI, TRIP, TROV, TSLX, TSQ, TSU, TT, TTI, TTOO, TUES, UEC, UFPT, USAC, USCR, USFD, USWS, VAPO, VCEL, VGR, VGZ, VOYA, VPG, VRCA, VREX, VRSK, VRT, VST, VVUS, VYGR, W, WBT, WES, WIFI, WMGI, WRK, WTTR, WU, XENE, XYL, Y, YORW, ZAGG, ZGNX\n\n - Ex-div:\n\n  AMTD, BFIN, DCOM, EIG, MDC, PHG, RELL, WBS, WTBA\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 10.000M)\n    - Exports (previous: 207.50B)\n    - IBD/TIPP Economic Optimism (previous: 47.8)\n    - ISM Non-Manufacturing Business Activity (previous: 48.0)\n    - ISM Non-Manufacturing Employment (previous: 47.0)\n    - ISM Non-Manufacturing New Orders (previous: 52.9)\n    - ISM Non-Manufacturing PMI (consensus: 44.0, previous: 52.5)\n    - ISM Non-Manufacturing Prices (previous: 50.0)\n    - Imports (previous: 247.50B)\n    - Markit Composite PMI (consensus: 27.4, previous: 40.9)\n    - Redbook (previous: -11.8%)\n    - Redbook (previous: -8.1%)\n    - Services PMI (consensus: 27.0, previous: 39.8)\n    - Trade Balance (consensus: -44.00B, previous: -39.90B)\n\n## Upcoming events for Wednesday, May  6th\n\n - Expected earnings:\n\n  ACMR, ACRE, ADMA, ADTN, AEIS, AEL, AEP, AERI, AFIN, AI, ALB, ALE, ALG, ALGT, ALLO, ALNY, ALTM, ALXN, AMED, AMOT, AMP, AMPY, ANGI, ANSS, AP, APA, AQUA, ARES, ASM, ASTE, ATO, ATRA, AVB, AVNS, AWK, AXGN, AXTA, AYX, AZPN, BBSI, BBU, BCRX, BCSF, BEAT, BEP, BFAM, BFYT, BG, BHR, BIO, BKCC, BNFT, BPMC, BRKR, BRY, BWA, CAPL, CARS, CBZ, CCMP, CCO, CDAY, CDW, CECE, CENT, CENTA, CF, CFMS, CGEN, CHEF, CHMG, CIM, CLDT, CLI, CLLS, CNHI, CNST, CORR, CPA, CPG, CPK, CPLP, CRHM, CRK, CSGS, CSTE, CTL, CUB, CVNA, CVS, CW, CXW, CYTK, DAR, DCP, DDD, DHX, DISCA, DLHC, DNN, DNOW, DRQ, DRTT, DX, EAF, ELVT, EMKR, ENBL, ENTA, EPAY, EPR, EQIX, ERYP, ES, ESE, ESPR, ESS, ETSY, EVFM, EVRG, EXAS, EXR, EXTR, EYPT, FCPT, FG, FIT, FLIR, FMS, FNV, FOE, FORM, FOXA, FOXF, FRT, FSK, FSLY, FTDR, FTNT, FTS, FUN, GBT, GCP, GDDY, GEL, GM, GMRE, GNK, GNL, GOLD, GPC, GPN, GRUB, GSS, GSX, GTHX, GTY, H, HDSN, HEP, HI, HR, HSON, HT, HUBS, HZNP, IAA, IAC, IDN, IIPR, IMMU, IMUX, INMD, INN, INSG, INVH, IO, IONS, IPI, IRT, IRWD, ISEE, IVC, J, JAX, JNCE, KFRC, KKR, KL, KRG, KW, LASR, LCI, LGND, LNC, LPI, LVGO, LXU, LYFT, MAA, MCFT, MEET, MET, MFC, MLVF, MNKD, MNR, MOR, MRO, MTRX, MX, MYE, NBIX, NDLS, NE, NEPH, NI, NMFC, NMIH, NOA, NREF, NTR, NTRA, NUS, NUVA, NXST, NYT, ODP, OMI, OPK, OSB, OSUR, PAAS, PACB, PAG, PARR, PEIX, PERI, PGEN, PING, PKOH, PPD, PRTA, PRTS, PSN, PTON, PXD, PYPL, PZZA, QDEL, QGEN, QMCO, QNST, QRTEA, QTWO, RAIL, RARE, RBBN, RCII, RCL, RDN, RDWR, RE, REAL, RESN, REZI, RGEN, RGLD, RM, RMAX, RNG, RNR, ROCK, RP, RST, RTLR, RUBI, RUN, RYI, SAVE, SBBP, SBGI, SBH, SBOW, SBRA, SEDG, SHOP, SID, SITM, SJI, SLRX, SMG, SMSI, SONO, SPNE, SPR, SPT, SQ, SRI, SRPT, STAA, STAY, STFC, STKL, STN, STNG, SWM, TALO, TBPH, TCP, TIVO, TLND, TMDX, TMHC, TMUS, TNC, TPC, TPVG, TRMB, TRNO, TROX, TRVG, TSE, TTGT, TUSK, TVTY, TWLO, TWO, TXMD, UDR, UFCS, UGI, UIHC, UPWK, VBIV, VCYT, VIAV, VIV, VMC, VNDA, VNTR, VRTV, VTVT, VVUS, WATT, WCN, WD, WELL, WEN, WING, WKHS, WLL, WM, WMC, WPM, WPX, WTI, WTRG, WTS, WYND, XEC, XPER, ZIXI, ZNGA, ZTS\n\n - Ex-div:\n\n  AMG, AWI, AZZ, CATC, CNXM, ET, ETR, FE, FELE, FSBW, GMLP, HTBK, INTC, KBH, LSBK, LSTR, MATX, NBN, NEP, NGL, NWBI, OFED, OPBK, PTMN, RUSHA, RUSHB, SIMO, SUN, VAM, VBTX, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: -20,000K, previous: -27K)\n    - Crude Oil Imports (previous: -0.047M)\n    - Crude Oil Inventories (consensus: 10.619M, previous: 8.991M)\n    - Cushing Crude Oil Inventories (previous: 3.637M)\n    - Distillate Fuel Production (previous: -0.025M)\n    - EIA Refinery Crude Runs  (previous: 0.305M)\n    - EIA Weekly Distillates Stocks (consensus: 3.600M, previous: 5.092M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.7%, previous: 2.0%)\n    - Gasoline Inventories (consensus: 2.527M, previous: -3.669M)\n    - Gasoline Production (previous: 0.530M)\n    - Heating Oil Stockpiles (previous: -0.892M)\n    - MBA 30-Year Mortgage Rate (previous: 3.43%)\n    - MBA Mortgage Applications (previous: -3.3%)\n    - Seevol Cushing Storage Report (previous: 4.150M)\n\n## Upcoming events for Thursday, May  7th\n\n - Expected earnings:\n\n  AAN, AAOI, AAON, AAWW, AAXN, ABC, ABEV, ACAD, ACIA, ADMS, ADSW, ADT, AES, AGEN, AGS, AHT, AINC, AIRG, AIV, AL, ALBO, ALDX, ALRM, ALTR, AMH, ANIK, ANIP, APPN, AQB, AQN, ARGO, ARI, ARNA, ARWR, ASMB, ASUR, ASYS, AT, ATEN, ATNX, ATTO, AUMN, AUTL, AUTO, AVID, AVLR, AXDX, AZUL, BAP, BATRK, BCE, BCEI, BCLI, BDSI, BDX, BECN, BFS, BGG, BGSF, BHC, BILL, BIOL, BJRI, BKNG, BLL, BMY, BRBR, BRX, BSIG, BTE, BUD, BV, CALA, CARE, CARG, CBIO, CBRE, CCOI, CCRN, CDXS, CFX, CHMA, CHRS, CIO, CIR, CLBS, CLNC, CLNE, CLUB, CLXT, CNDT, CNNE, CNP, CNQ, COLD, COLL, COMM, CORE, CPT, CRC, CRL, CRNC, CSLT, CTB, CTMX, CTSH, CTVA, CUBE, CUTR, CVA, CVEO, CVTI, CWEN, CWK, CWST, CYRX, DBX, DEI, DFIN, DGII, DHC, DHR, DLPH, DLR, DLX, DOC, DOX, DRNA, DSKE, DVAX, DZSI, ECOL, ECOM, ED, EDIT, EFC, EGAN, EGLE, ELAN, ELGX, ELOX, ENB, ENDP, ENLC, ENR, ENV, EOG, EPAM, EPC, EQH, EQNR, EQT, ERIE, ESTA, ESTE, EURN, EVH, EVLO, EXLS, EXPE, FARM, FET, FFG, FGEN, FIS, FISV, FLDM, FLEX, FLMN, FLR, FLS, FLT, FLXN, FNKO, FOCS, FOLD, FORR, FPRX, FSLR, FVRR, FWONA, FWONK, GCI, GDP, GERN, GH, GKOS, GLIBA, GLOG, GLOP, GLPG, GLUU, GMED, GNC, GOLF, GPOR, GPRO, GSAT, GTN, GTS, GWRS, HAIN, HASI, HBB, HCI, HEAR, HES, HESM, HFC, HII, HIMX, HL, HLF, HLT, HMHC, HMN, HNGR, HSDT, HSKA, HST, IART, ICD, ICUI, IDCC, IEA, IHRT, IIIV, IMMR, ING, INSW, INVE, IPHI, IRM, IRTC, IT, ITCI, ITGR, JBLU, JCAP, JOBS, KALA, KAR, KIN, KINS, KLDO, KMPR, KRP, KTB, KTOS, KWR, LAMR, LAUR, LBRDA, LBRDK, LCTX, LHCG, LIN, LMRK, LNT, LOPE, LQDA, LQDT, LSI, LSXMA, LSXMK, LTRX, LUNA, LXP, LYG, LYV, MAC, MAIN, MATW, MBUU, MCHP, MCHX, MCRB, MD, MDRX, MDU, MGA, MGEN, MMI, MMS, MN, MNLO, MNST, MNTA, MR, MRAM, MRNA, MSI, MT, MTD, MTG, MTW, MUR, MVIS, NBY, NCSM, NET, NEWT, NGS, NGVC, NINE, NKTR, NMR, NMRK, NOMD, NRG, NSCO, NSIT, NTCT, NTLA, NUAN, NVAX, NVCN, NVEE, NWPX, NWSA, NXRT, OCSI, OCSL, OEC, OGE, OLED, OMCL, ONCY, ONEW, OPCH, OPGN, OPTN, ORTX, OTIS, OVV, PAHC, PAR, PBA, PBH, PBYI, PCRX, PCTI, PCTY, PDCE, PDFS, PDLI, PEB, PEI, PEN, PENN, PETQ, PFIE, PFNX, PFPT, PFSI, PFSW, PGNX, PLUG, PMT, PODD, POST, POWI, PRA, PRAA, PRDO, PRFT, PRMW, PROF, PRVB, PSNL, PWFL, PWR, QLYS, QRVO, RBA, RCUS, RDFN, RDUS, REG, REYN, RGNX, RHP, RLGY, RMNI, ROKU, RPD, RTIX, RTX, RVNC, SAGE, SAIL, SAND, SAR, SCOR, SELB, SERV, SHLX, SKYW, SLRC, SNDX, SNSS, SP, SPAR, SPH, SPPI, SPWR, SRCL, SREV, SRLP, SRTS, SSTI, STMP, SUNS, SUNW, SVMK, SWIR, SXI, SYNA, SYRS, TACT, TAST, TCDA, TCRD, TCX, TDC, TEVA, TGNA, THRM, THS, TMST, TNAV, TPIC, TPRE, TRGP, TRHC, TRUE, TRVN, TS, TTD, TU, TWI, TWST, UBER, UEIC, UMH, UNT, UPLD, URGN, USAK, VECO, VEON, VG, VIRT, VSLR, VSTO, VVI, VVNT, WEX, WLDN, WPG, WRI, WRLD, WSR, XAN, XEL, XERS, XFOR, XNCR, XOG, XONE, YELP, YETI, YMAB, ZG, ZIOP, ZYME\n\n - Ex-div:\n\n  AEP, AFB, AFIN, AMSWA, ARTNA, ASA, BCBP, BPFH, CADE, CBAN, CDR, CELP, CEQP, CINR, CIT, CLB, CPLP, CS, CSFL, CWBC, CXO, FCBC, FCF, FRBA, GABC, HMLP, HOPE, HSII, IBM, JBHT, LAD, LW, MET, MMLP, MMP, MPLX, NBLX, NSC, NYCB, OPB, PCTI, PFE, PH, PPBI, RBNC, SBFG, SBUX, SC, SCHW, SFBC, SIRI, SMBK, SON, SSB, STL, SXT, WAB, WAFD, WFC, WMT, WSFS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.095%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 222.288K)\n    - Challenger Job Cuts (previous: 266.9%)\n    - Consumer Credit (consensus: 15.00B, previous: 22.33B)\n    - Continuing Jobless Claims (consensus: 19,810K, previous: 17,992K)\n    - FOMC Member Harker Speaks\n    - Initial Jobless Claims (consensus: 3,000K, previous: 3,839K)\n    - Jobless Claims 4-Week Avg. (previous: 5,033.25K)\n    - Natural Gas Storage (previous: 70B)\n    - Nonfarm Productivity (consensus: -5.5%, previous: 1.2%)\n    - Unit Labor Costs (consensus: 4.0%, previous: 0.9%)\n\n^^^^2020-05-04",
        "created_utc": 1588601659,
        "id": "fpgfi8g",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1588630459.0
    }
]