[
    {
        "author": "JoeFlipperhead",
        "body": "Hey Kiddos,\n\nI just learned about this newfangled Reddit website.  Pretty Neat.  Anywho, I'd like to impart some sage wisdom to all you young whipper-snappers.\n\n1) Diversification is key.  Some stocks go down at times.\n\n2) Invest heavily in safe securities:  IBM, GE, Sears (might be down, but it's bound to make a comeback; great catalog)\n\n3) High Yield savings accounts are wonderful for your portfolio\n\nLow Risk tolerance, slow and steady, conservative investing... that's the keys to success!\n\nSincerely,\n\nMort",
        "created_utc": 1580412073,
        "id": "fg0or9q",
        "permalink": "/r/wallstreetbets/comments/ew3qro/daily_discussion_thread_january_30_2020/fg0or9q/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1580440873.0
    },
    {
        "author": "rocklee8",
        "body": "Why do you need that much leverage? Just buy some closer $55 calls if you want to gamble. You're really banking on AMD outsmarting Intel? Let me let you in on a secret, this whole CPU improvement thing is bs. Intel already has the technology to beat AMD, they just pace themselves so that they can maximize profit. Don't you think it's strange that the products are SOOOOO similar year on year, that doesn't make any sense. CPUs are basically a monopoly through research and Intel holds the keys to the kingdom, trickling out the next phase so AMD keeps up so they don't get shut down as a monopoly.",
        "created_utc": 1578234444,
        "id": "fd9jzjf",
        "permalink": "/r/wallstreetbets/comments/ejnadw/weekend_discussion_thread_january_35_2020/fd9jzjf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1578263244.0
    },
    {
        "author": "TlfT",
        "body": "My friend got wiped out buying San Diego real estate before the crash.  My other friend made millions buying properties in east Palo Alto over the past decade.\n\nTiming and location are keys.",
        "created_utc": 1580267682,
        "id": "ffvmldm",
        "permalink": "/r/investing/comments/evgm69/real_estate_investing_for_fun_and_profit/ffvmldm/",
        "score": 4,
        "subreddit": "investing",
        "created": 1580296482.0
    },
    {
        "author": "MaliciousLegroomMelo",
        "body": "My advice would be banish a few of the feelings and impressions you have expressed.  There's no reason for shame or feeling dumb.  You're ahead of at least 90% of people, many of whom never figure out that investing when young is critical.  \n\nHowever I'd also caution you to block out any feelings you have about your one year or investing experience. You've had about the easiest year possible and it's not typical whatsoever.  \n\nYou are correct that average people cannot possibly save their way to wealth.  Savings never exceed costs so they're pointless if your goal is wealth.\n\nMajor keys I'd suggest: Transfer your fears that were about markets into fears about debt and spending.  Treat debt and spending like smoking that can kill you.  If you can establish life habits now of being thrifty and not following the herds into debt, you'll be better off no matter what stock markets do.  Train yourself not to covet the nicest car or the biggest house.  \n\nConsider every transaction as to whether it's an asset or not, and be strict in the definition that it's only an asset if it pays you directly.  Define a liability as something that costs you money. \n\nA house and car don't pay you (unless you're doing AirBnB and Uber) , so they're not really assets.  Cars and houses cost you fuel and insurance and maintenance and utilities, so they're liabilities, and you want your liabilities as small as possible.\n\nDepending on your situation set up fundamentals like insurance and emergency fund and family protection.  Determine your risk and participation levels and whether that means you should basic index fund base before you do stock market investing.  \n\nAnother habit is to establish an up breakable rule that you'll always devote the first $____ of every month to your plan.  This commitment should be a stretch but it should be something you can afford.  The key is to never allow yourself to break it, even if it means you have to juggle or struggle for that month.  It's about mindset and discipline.  No cheat days.  \n\nMost people do the opposite, they treat their bills and bar budget as sacred, and then do saving/investing if there's anything left over.  You flip that around.  Make the first thing be the investing amount, make it mandatory, and then you'll force yourself to make sure you budget and adapt to do the other payments because you have to. \n\nThen, whatever funds you're prepared to lose, go at it.  Lots of people don't figure out what you have until they're at or near retirement.  You have your whole life so if you blew it all this year, you have a lifetime to reset.",
        "created_utc": 1578174706,
        "id": "fd56m01",
        "permalink": "/r/stocks/comments/ejxdnf/why_didnt_i_invest_sooner/fd56m01/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1578203506.0
    },
    {
        "author": "CardinalNumber",
        "body": "You forgot the part where decentralized trading protected by \"keys\" would \"protect\" him from having to pay what he owes in the name of being fair to... I guess people who think it's unfair that they have to pay their debts.",
        "created_utc": 1578443373,
        "id": "fdii17o",
        "permalink": "/r/RobinHood/comments/eldq8o/i_would_like_to_see_robinhoods_policy_regarding/fdii17o/",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1578472173.0
    },
    {
        "author": "TEZLAGREEN",
        "body": "Phone because it is my wallet and my car keys (Tesla owner)",
        "created_utc": 1578978774,
        "id": "feco1eo",
        "permalink": "/r/wallstreetbets/comments/eoabog/what_are_your_moves_tomorrow_january_14/feco1eo/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1579007574.0
    },
    {
        "author": "SezitLykItiz",
        "body": "200 Americans died because GM couldn't get ignition keys right. I'm not talking about the 70s, this was 2014.",
        "created_utc": 1578325599,
        "id": "fddwdfq",
        "permalink": "/r/wallstreetbets/comments/ekow5h/tesla_crash_leaks_battery_hazmat_team_needed/fddwdfq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1578354399.0
    },
    {
        "author": "PROGRAMMER_FOR_TRUMP",
        "body": "I think my car keys are as much as my phone. My wallet is mostly plastic so theres that.. I'd have to go with wallet.",
        "created_utc": 1578979102,
        "id": "fecofzp",
        "permalink": "/r/wallstreetbets/comments/eoabog/what_are_your_moves_tomorrow_january_14/fecofzp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1579007902.0
    },
    {
        "author": "PalsgrafBlows",
        "body": "Love this. Easiest way to ensure it’s gambled properly would be to go through a broker. Mod collects the pot, puts it in a TD account and makes the appropriate gamble that gets voted on in the raffle post, then hands the keys over. But I don’t know if you can just transfer an account like that?",
        "created_utc": 1580441840,
        "id": "fg2bcqy",
        "permalink": "/r/wallstreetbets/comments/ewbsq2/weekly_autistic_giveaways/fg2bcqy/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1580470640.0
    },
    {
        "author": "ATastyGrape",
        "body": "He probably handed the guy a script and keys to a yacht",
        "created_utc": 1580414939,
        "id": "fg0twnd",
        "permalink": "/r/wallstreetbets/comments/ew3qro/daily_discussion_thread_january_30_2020/fg0twnd/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1580443739.0
    },
    {
        "author": "john19549",
        "body": "need a new key board some of the keys don't work all the time",
        "created_utc": 1578395864,
        "id": "fdggla1",
        "permalink": "/r/pennystocks/comments/el3let/husa_on_the_move/fdggla1/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1578424664.0
    },
    {
        "author": "TaterTotJim",
        "body": "Honestly 6 months would be really excessive in this market IMO. I know dudes that line up leases before they reno and can bang out running water,electric,drywall,paint in about two weeks or less. The water heater and kitchen appliances get installed when tenants get keys. \n\nThese houses are not getting anything more than the basic finishes and bare minimum code/section8 requirements. Any overspending can really fuck your gains in the short term. I think the 6 month turn is for higher value properties, my experience in Seattle was that some of those homes go under reno for a year+ or just sit vacant for eternity as a speculation play.\n\nDetroit is totally different, when you can hit an auction and get a house bought and fixed up for under $30k cash the less time you waste the better.",
        "created_utc": 1578950095,
        "id": "fealhzz",
        "permalink": "/r/wallstreetbets/comments/ennkq6/wsb_could_seize_detroit/fealhzz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1578978895.0
    },
    {
        "author": "NightOwlinLA",
        "body": "Easy... phone.  Mine's all encrypted and if you don't manage to get it returned to you, just remote-wipe it and move on.\n\nCar keys are bundled with home keys and depending on the situation you'd have to replace all locks. Wallet means spending a shit load of time talking with credit cards, changing auto-pay stuff and the worst of all... DMV line.",
        "created_utc": 1578982174,
        "id": "fecrspg",
        "permalink": "/r/wallstreetbets/comments/eoabog/what_are_your_moves_tomorrow_january_14/fecrspg/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1579010974.0
    },
    {
        "author": "beeinsubtle",
        "body": "Not your keys, not uranium.",
        "created_utc": 1579303411,
        "id": "feop6ck",
        "permalink": "/r/investing/comments/eq297b/stocks_are_now_trading_at_their_highest_pes_since/feop6ck/",
        "score": 2,
        "subreddit": "investing",
        "created": 1579332211.0
    },
    {
        "author": "Cnastydawg",
        "body": "I would’ve thought it was stormy that did it when she lost $100k she dipped and gave the keys to someone else.",
        "created_utc": 1579482261,
        "id": "ff1nsri",
        "permalink": "/r/wallstreetbets/comments/er29nh/what_are_your_moves_tomorrow_january_20/ff1nsri/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1579511061.0
    },
    {
        "author": "carmonuh",
        "body": "I already got my keychain for my Lambo keys.",
        "created_utc": 1578319836,
        "id": "fddos94",
        "permalink": "/r/RobinHoodPennyStocks/comments/ekt2f0/mmmmm_ontx_52_baby/fddos94/",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1578348636.0
    },
    {
        "author": "meowman7000",
        "body": "The same guy who publicly shamed Apple for not providing third parties with peoples private encryption keys.  I actually sold my Blackberry stock because of this guy, the company was supposed to be known for its high security and confidentiality.",
        "created_utc": 1578165446,
        "id": "fd490tu",
        "permalink": "/r/CanadianInvestor/comments/ejm5z6/john_chen_blackberrys_bbto_ceo_tops_the_list_for/fd490tu/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1578194246.0
    },
    {
        "author": "shadowconservatory",
        "body": "There is a ton of information out there, but a whole lot of it is BS. Listen to the Investtalk podcast; they don't 'teach you to trade' but by listening you will pick up good information and be pointed in the right direction. \n\nThere are two keys to being a successful investor: patience and risk management.",
        "created_utc": 1578254642,
        "id": "fdb7i6x",
        "permalink": "/r/stocks/comments/ekdha0/trading/fdb7i6x/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578283442.0
    },
    {
        "author": "SnacksOnSeedCorn",
        "body": "That's actually a really big issue with crypto. Knowing your own private keys makes you a target for extortion",
        "created_utc": 1578372561,
        "id": "fdfx2ca",
        "permalink": "/r/investing/comments/ekukby/what_is_the_benifit_of_buying_physical_gold/fdfx2ca/",
        "score": 1,
        "subreddit": "investing",
        "created": 1578401361.0
    },
    {
        "author": "dwc",
        "body": "Vanguard offers support for hardware security keys:\n\nhttps://investor.vanguard.com/security/security-keys\n\nI’m hoping that with Apple adding support for FIDO and WebAuthn in iOS 13.3 that Vanguard will update their mobile apps to support them as well and drop the requirement for SMS-based codes.",
        "created_utc": 1577984268,
        "id": "fcummw8",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fcummw8/",
        "score": 1,
        "subreddit": "investing",
        "created": 1578013068.0
    },
    {
        "author": "BisonPuncher",
        "body": "I love telling crypto fanatics that all of my bitcoin is on Robinhood. They foam at the mouth to tell me all about how I dont own the keys and whatever.\n\nThey're so used to being exit scammed they dont even trust reputable (I know) institutions anymore. I dont want to own the stupid keys and deal with a stupid wallet and the stupid transfer times, ridiculous tax implications, and the mess of it all. I dont want to buy a hardware wallet just to store this crap in a way that it wont be stolen or lost in some way.",
        "created_utc": 1579212598,
        "id": "fel2fii",
        "permalink": "/r/investing/comments/epnu62/would_you_buy_bitcoin_2020_to_sell_after_a_year/fel2fii/",
        "score": 1,
        "subreddit": "investing",
        "created": 1579241398.0
    },
    {
        "author": "rubr84",
        "body": "The debit spread can be beneficial in any numbers of ways. The main ways I use them are:\n\n1. YOU WANT TO MAKE BUYING AN OPTION CHEAPER: In the case where you simply want to buy a put or call i.e.you have a strong feeling about a direction; you can sell a much poorer quality option (much further out of the money) to offset the initial cost, and to help minimize theta (time) decay as days go by. This strategy generally makes money if the stock goes in your direction but always sell if the underlying gets near the out of the money leg.\n\n2. YOU WANT TO MAKE MONEY FROM THETA DECAY: If you have a significant amount of money at your disposal. You can buy a deep in the money option (in this case all the value is intrinsic) and sell a far out of the money option against it. This strategy will make money if the stock stays flat or goes in your direction (but not so much that it gets near the sold leg).\n\nThe art in spreads is always in the leg you sell. You always want to be selling the option in an area where you think the stock won't go. And if you can do that, that leg is essentially free money. It's like selling someone your house for cheap but after paying they have to fetch the keys off the top of Everest. Chances are you'll keep your house and their money, but occassionally things go really against you!",
        "created_utc": 1578889693,
        "id": "fe6fx7v",
        "permalink": "/r/options/comments/eny6yz/credit_spread_confused/fe6fx7v/",
        "score": 1,
        "subreddit": "options",
        "created": 1578918493.0
    },
    {
        "author": "Shacreme",
        "body": "You won the keys to your gf parents brokerage accounts? Nice 👍👍.",
        "created_utc": 1578943881,
        "id": "fea35ib",
        "permalink": "/r/wallstreetbets/comments/eo2pe0/daily_discussion_thread_january_13_2020/fea35ib/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578972681.0
    },
    {
        "author": "NotForrestGump",
        "body": "They're SUPER impressed by the 14 shares of ACB I have. Super impressed. Pretty sure I'll be handed the keys to their brokerage account any day now.",
        "created_utc": 1578943797,
        "id": "fea2u52",
        "permalink": "/r/wallstreetbets/comments/eo2pe0/daily_discussion_thread_january_13_2020/fea2u52/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578972597.0
    },
    {
        "author": "jayhilly",
        "body": "They should just release beta keys on r/wsb tbh",
        "created_utc": 1578761992,
        "id": "fdwsmyf",
        "permalink": "/r/RobinHood/comments/emm5dl/what_is_with_the_obvious_new_product_offering/fdwsmyf/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1578790792.0
    },
    {
        "author": "Daveywallnut",
        "body": "I used it on my laptop a couple of times over wifi connection and there did seem to be an occasional stutter and delay of tickers which I found concerning. Even when I had full signal it would notify me that trading connection had been lost then immediately re-established which I think if I was in the middle of an execution at the time could have caused some issues. \n\nThis was only temp for me and since I switched to using my desktop with a wired connection, it has been no bother and I've not had any of these problems since.\n\nThe only real issue some people may have is that nothing is easy to use or in an obvious place. It takes some getting used to but if you take some time to learn the software and put in a few hot keys it's just as easy as any of the more user friendly looking platforms.\n\nI've used them a few years now and honestly I wouldn't be opposed to switching, but for me I'm comfortable with it and I don't see anything better there at the moment. Hope this has helped with your own decision making",
        "created_utc": 1579561517,
        "id": "ff4e87w",
        "permalink": "/r/pennystocks/comments/equbgm/recommend_a_platform/ff4e87w/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1579590317.0
    },
    {
        "author": "YangGangBangarang",
        "body": "To everyone sad they missed SPCE.... have we even put the keys in the ignition?  \n\nLet’s just wait until there’s a short float.",
        "created_utc": 1579741700,
        "id": "ffapvn2",
        "permalink": "/r/wallstreetbets/comments/esi6o2/what_are_your_moves_tomorrow_january_23/ffapvn2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579770500.0
    },
    {
        "author": "lv4myw",
        "body": "No, you don't get assigned anything when you BUY the call.  You own the option and it is up to you to exercise it.  If you decide to exercise it early, it gets assigned to someone else.\n\nGenerally, your call will be automatically exercised on the expiration date if it is \"in the money\" unless you instruct your brokerage not to.  \n\nThe only way a call THAT YOU OWN gets exercised early is if you choose to exercise it early.\n\nThink of it outside of stocks for a minute.  Suppose you like my house and are thinking about buying it.  You might be willing to offer me $1000 for an \"option\" to buy it any time over the next year.  In exchange for $1000, I agree not to sell my house to anyone else and I agree that at any time over the next year, you can \"exercise\" that option and buy my house.\n\nIf the end of the year expires and the real estate market has crashed, you will not exercise your option.  I keep your $1000 and my house.\n\nOr, if the real estate market booms, you will exercise your option and buy my house more cheaply than you could have if you had not bought the option.\n\nBut I can't walk up to you, hand you the keys, and tell you that you now own a house.  The option belongs to you, not to me, and it's up to you what to do with it.",
        "created_utc": 1579297417,
        "id": "feoaoho",
        "permalink": "/r/stocks/comments/eq6bpf/call_options/feoaoho/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579326217.0
    },
    {
        "author": "Sinman88",
        "body": "Hey Mr. New Ceo, here are the keys to your brand new dumpster fire of a company!  Have fun being the fall guy while I do blow off all these strippers' tits!",
        "created_utc": 1580477618,
        "id": "fg3c735",
        "permalink": "/r/weedstocks/comments/ewn140/medmen_announces_leadership_change_and_moves_to/fg3c735/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1580506418.0
    },
    {
        "author": "ballsvanhouten",
        "body": "i wonder who's job it is to jingle keys in his face in times like this",
        "created_utc": 1580505067,
        "id": "fg4kdb7",
        "permalink": "/r/wallstreetbets/comments/ewmvzu/daily_discussion_thread_january_31_2020/fg4kdb7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580533867.0
    },
    {
        "author": "NovaStubble",
        "body": "I can never find my car keys.",
        "created_utc": 1580155871,
        "id": "ffrdjpt",
        "permalink": "/r/weedstocks/comments/eurr77/legalizing_marijuana_in_new_york_regains/ffrdjpt/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1580184671.0
    },
    {
        "author": "1sildurr",
        "body": "A girl getting multiple dicks isn't impressive.\n\nA key that opens any lock is a master key. A lock opened by many keys is just a shitty lock.",
        "created_utc": 1580204305,
        "id": "fft2zcx",
        "permalink": "/r/wallstreetbets/comments/euueg4/what_are_your_moves_tomorrow_january_28/fft2zcx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580233105.0
    },
    {
        "author": "KrustyKoin",
        "body": "I'm sure in a RH sub that comment will get me downvoted, but trading crypto on platforms that dont give you access to the private keys is not smart. \nLast spring when the bull run was popping off crypto trades were coincidentally shutdown for maintenance at times. \nIf you're interested in trading crypto there are a handful of platforms that function much better all around and are more secure, even in the US. \nBinance.US\nGemini\nKraken\nCoinbase pro (I'd recommend avoiding regular coinbase)\n\nEven cashapp has an easy, affordable function for buying/selling bitcoin that allows for instant deposit/withdrawals",
        "created_utc": 1579031294,
        "id": "feed4rs",
        "permalink": "/r/RobinHood/comments/eom5ck/outage/feed4rs/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1579060094.0
    },
    {
        "author": "rjm101",
        "body": "&gt;Would it be a good idea to migrate my bitcoin from coinbase to Robinhood. \n\nNo because at least with coinbase you can actually withdraw your Bitcoin and hold your private keys if you ever feel the need. With Robinhood they don't let you withdraw so you can never really know for sure if Robinhood is actually holding Bitcoin for you rather than just trading derivatives. I know you want the convenience but eventually you're going to run into this problem one way or another. Most people just use spreadsheets to keep track.",
        "created_utc": 1579133800,
        "id": "feia9je",
        "permalink": "/r/investing/comments/ep7t2o/moving_cryptocurrency/feia9je/",
        "score": 1,
        "subreddit": "investing",
        "created": 1579162600.0
    },
    {
        "author": "redtexture",
        "body": "Here is one person's point of view. There are hundreds of other points of view.  \nIf we all knew what the future would bring, we would all be billionaires. \n\nJason Leavitt - Leavitt Brothers   \nYou Tube Channel   \nhttps://www.youtube.com/user/LeavittBrothers/videos  \n\nUsing Moving Averages on Multiple Time Frames   \nNov 18, 2019    \nhttps://www.youtube.com/watch?v=FGfQAZoxP7w \n\nDon't Shy Away From Expensive Stocks  \nApr 11, 2019    \nhttps://www.youtube.com/watch?v=FDlNyCSJR5M  \n\nThe Real Keys to Surviving and Making Solid Profits in the Market (Part 1)   \nJason Leavitt - via \"Investor Inspiration\"  - Sept 29 2016   \nhttps://www.youtube.com/watch?v=y7J8zthHCNg  \n\nThe Real Keys to Solid Profits (Part 2)  \nJason Leavitt - via \"Investor Inspiration\"    - April 10, 2017   \nhttps://www.youtube.com/watch?v=cY_6oxipJa0    \n\nThe Real Keys to Solid Profits (Part 3)  \nJason Leavitt via \"Investor Inspiration\"  - Sept 21, 2017  \nhttps://www.youtube.com/watch?v=EWB8XUtqqZk\n\n----\n\nState of the Market Presentations   \n\nJan 6 2020  \nhttps://www.youtube.com/watch?v=SLEATiuXF-Q  \n\nState of the Market\nDec 2, 2019  \nhttps://www.youtube.com/watch?v=NhKuPFTS63U\n\nNov 12 2019 - State of the Market\nhttps://www.youtube.com/watch?v=6AMQnKHkqKs  \n\nIs the Stage Set for a Monster Rally   \nSep 9, 2019     \nhttps://www.youtube.com/watch?v=s0IjoNZr26U\n\n----",
        "created_utc": 1578679147,
        "id": "fdr3ssz",
        "permalink": "/r/options/comments/ekmhb0/noob_safe_haven_thread_jan_0612_2020/fdr3ssz/",
        "score": 1,
        "subreddit": "options",
        "created": 1578707947.0
    },
    {
        "author": "pdiddknows",
        "body": "Hey, you're just like me. Bout get the keys to that new Lamborghini...that went down on that ship that sunk on it's way over from Italy...AKA KMPH",
        "created_utc": 1579015704,
        "id": "fedncfe",
        "permalink": "/r/RobinHoodPennyStocks/comments/eol0ru/its_coming_back_to_life_guys_its_alive/fedncfe/",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1579044504.0
    },
    {
        "author": "SigSalvadore",
        "body": "Not a good club beat, too sad sounding. Not like a dead clown sad, but rather it's last call, this is laxative and pancake mix not coke, god damn another another dead hooker in the stall, my fingers are slick with blood and I can't find my fucking car keys sad.",
        "created_utc": 1580506064,
        "id": "fg4lztr",
        "permalink": "/r/wallstreetbets/comments/ewk7bz/elon_has_released_his_first_edm_solo_on/fg4lztr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580534864.0
    },
    {
        "author": "Pass3Part0uT",
        "body": "If my work told me to go use a Chromebook or fire tablet on some janky android system I'd go find another job. Those are fine if all you do is check your email but web based software still sucks compared to a true program or app that works with consistent keys and shortcuts. \n\nWindows is not going anywhere soon for companies that have been around long enough to have legacy systems. Linux isn't replacing Windows anytime soon.",
        "created_utc": 1580513199,
        "id": "fg4xbzt",
        "permalink": "/r/investing/comments/evtfyt/fb_msft_earnings/fg4xbzt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1580541999.0
    },
    {
        "author": "Spartan_Blazer",
        "body": "Mars Volta, the strokes, Radiohead, and white stripes prob my favorites. Oh and spoon and the black keys",
        "created_utc": 1580442086,
        "id": "fg2bulq",
        "permalink": "/r/wallstreetbets/comments/ewc9hj/what_are_your_moves_tomorrow_january_31/fg2bulq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580470886.0
    },
    {
        "author": "placebotwo",
        "body": "Lost over $30k when someone handed me the keys to my personal account, tried daytrading with zero experience. Took me about 6 maybe longer years or so to get back to where I was was with half ass trading and going long with slow moving equities.\n\nNow I'm more experienced and less autistic and understand to take the money and run and have re-evaluated my risk tolerance.\n\nSo now I'm day/intraday trading in hopes to get to $100,000k before the end of the year. Currently @ ~$61,000.",
        "created_utc": 1580482158,
        "id": "fg3i81e",
        "permalink": "/r/wallstreetbets/comments/ewo6bg/serious_people_that_have_lost_tons_tens_of/fg3i81e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580510958.0
    },
    {
        "author": "prisonsuit-rabbitman",
        "body": "Fuck Apple and how you can't even run your own code on an ipad without signing the binaries with dev licence keys.\n\nSame basic problem, but the market doesn't care",
        "created_utc": 1579476724,
        "id": "ff1a18x",
        "permalink": "/r/wallstreetbets/comments/eqxijk/farmers_are_buying_up_old_tractors_because_new/ff1a18x/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579505524.0
    },
    {
        "author": "mroozienelson",
        "body": "Dont buy bitcoin through RH you dont get the keys... so it isnt yours",
        "created_utc": 1579689418,
        "id": "ff8ot9c",
        "permalink": "/r/RobinHood/comments/esa5ky/2020_bitcoin_halving/ff8ot9c/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1579718218.0
    },
    {
        "author": "bulls_r_gay69",
        "body": "What if the guy who has keys dies coz of virus and they dont open at all?",
        "created_utc": 1580176776,
        "id": "ffsa0k8",
        "permalink": "/r/wallstreetbets/comments/euueg4/what_are_your_moves_tomorrow_january_28/ffsa0k8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580205576.0
    },
    {
        "author": "edison_joao",
        "body": "a lot of keys here",
        "created_utc": 1580071498,
        "id": "ffnw33v",
        "permalink": "/r/wallstreetbets/comments/etg465/weekend_discussion_thread_january_2426_2020/ffnw33v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580100298.0
    },
    {
        "author": "BUKAKKE_TALENT_SCOUT",
        "body": "RECESSION IS OVER! *jingles keys in your face*",
        "created_utc": 1579887227,
        "id": "fffmmiy",
        "permalink": "/r/wallstreetbets/comments/et8xus/daily_discussion_thread_january_24_2020/fffmmiy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579916027.0
    },
    {
        "author": "mrcake123",
        "body": "Put your keys into this bowl",
        "created_utc": 1579902436,
        "id": "ffgb9aq",
        "permalink": "/r/investing/comments/etgtl4/tell_me_how_you_hunt_for_swing_trades/ffgb9aq/",
        "score": 1,
        "subreddit": "investing",
        "created": 1579931236.0
    },
    {
        "author": "your_dog_is_lonely",
        "body": "not your keys, not your coins.",
        "created_utc": 1579882688,
        "id": "ffff9is",
        "permalink": "/r/CanadianInvestor/comments/et2w1c/best_crypto_exchange_for_canadians/ffff9is/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1579911488.0
    },
    {
        "author": "bioprocesschemist",
        "body": "The saltiest of the salty literally. I believe this problem will only get worse as professors become lazier and fail to update problem sets. At my university, a very prestigious well known one at that; old professors were too lazy to make new problem sets. This lead to a toxic system of politics and inflated averages. Those with the old problem sets and answer keys got by without ever being competent while actual good engineers failed out of the major. I witnessed gates scholars and valedictorians fail and get out for grades because of this. I see chegg as another tool to help level the playing field.",
        "created_utc": 1579571466,
        "id": "ff4smeq",
        "permalink": "/r/wallstreetbets/comments/er6psa/more_chegg_more_money/ff4smeq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579600266.0
    },
    {
        "author": "jayhilly",
        "body": "Not your keys, not your coins. \n\nLook at what happened to mt gox.",
        "created_utc": 1579544905,
        "id": "ff3nm2v",
        "permalink": "/r/RobinHood/comments/ergslo/why_continue_use_robinhood_when_all_other_major/ff3nm2v/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1579573705.0
    },
    {
        "author": "earfffffffffff",
        "body": "Holy fuck. I'm about to uber home to get my keys and I hate the future.",
        "created_utc": 1580407345,
        "id": "fg0gjsf",
        "permalink": "/r/wallstreetbets/comments/ew3qro/daily_discussion_thread_january_30_2020/fg0gjsf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580436145.0
    },
    {
        "author": "A_WSB_MOD",
        "body": "I drove 300 miles once and that happened.  Had to fedex my keys",
        "created_utc": 1580407187,
        "id": "fg0gact",
        "permalink": "/r/wallstreetbets/comments/ew3qro/daily_discussion_thread_january_30_2020/fg0gact/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580435987.0
    },
    {
        "author": "earfffffffffff",
        "body": "My car just let me drive all the way to the gym without my keys so I'm prob just going to hang it up today",
        "created_utc": 1580407120,
        "id": "fg0g68h",
        "permalink": "/r/wallstreetbets/comments/ew3qro/daily_discussion_thread_january_30_2020/fg0g68h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580435920.0
    },
    {
        "author": "PM_ME_SSH_LOGINS",
        "body": "🤣 at least use ssh keys but that's hilarious",
        "created_utc": 1577978299,
        "id": "fcudc9o",
        "permalink": "/r/wallstreetbets/comments/eiwx9h/daily_discussion_thread_january_02_2020/fcudc9o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578007099.0
    },
    {
        "author": "uoxuho",
        "body": "U2F and WebAuthn are excellent standards, and they don't necessarily need to come with the usability trade-offs of a separate hardware key. They also don't need to use biometrics or location data for authentication. Here's some food for thought:\n\n* Google's 2017 Pixelbook [has a built-in hardware U2F key](https://www.xda-developers.com/google-pixelbook-u2f-token-built-in/) so you can use U2F without needing a separate hardware key.\n* GitHub has created a [macOS application](https://github.com/github/SoftU2F/) that emulates a U2F key so you can use U2F on a Mac without needing a separate hardware key.\n* Consider how Safari-integrated Apple Pay works on any iPhone or Mac with a Secure Enclave: if a website supports Apple Pay, the website will ask the iPhone to begin an Apple Pay transaction. The iPhone uses TouchID or FaceID to authenticate, the Secure Enclave does its thing, and then the phone sends the credit card token to the website. Picture the exact same thing, but where the credit card token is replaced by a U2F or WebAuthn token. Apple's Secure Enclave is the exact same concept as a U2F hardware key—logical separation between a desktop OS and the storage of the cryptographic keys.\n\nAny device maker could adopt this type of stuff to create any smartphone or PC with its own secure U2F key built in. You know when a website has the option when you're logging in that says \"this is a public device, don't remember my login\" / \"this is a private device, keep me logged in.\" What I'm describing above would be a way for a device to prove that it's the same device as last time, automatically, without needing to plug in a separate U2F key each time.\n\nEdit: added detail and link",
        "created_utc": 1578101926,
        "id": "fczieem",
        "permalink": "/r/investing/comments/eiz0o0/vanguard_now_offering_0_commission_for_all_stocks/fczieem/",
        "score": 1,
        "subreddit": "investing",
        "created": 1578130726.0
    },
    {
        "author": "Spartan_Blazer",
        "body": "Hashtag quant life 🙌 but yeah and I can assign macros to the keys like copy paste command+ ~ and command tab shit like that",
        "created_utc": 1579060233,
        "id": "fefnkav",
        "permalink": "/r/wallstreetbets/comments/eorh54/what_are_your_moves_tomorrow_january_15/fefnkav/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579089033.0
    },
    {
        "author": "PostModernCommie",
        "body": "He didn't start in the mailroom.\n\nHe has a PhD in chemical engineering and was basically handed the keys of the company after a few years of working there.",
        "created_utc": 1578698603,
        "id": "fdsb7mn",
        "permalink": "/r/wallstreetbets/comments/emqx95/in_messages_from_april_2017_one_boeing_employee/fdsb7mn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578727403.0
    },
    {
        "author": "damanamathos",
        "body": "Here's an article worth reading from 2011 by venture capitalist Bill Gurley: http://abovethecrowd.com/2011/05/24/all-revenue-is-not-created-equal-the-keys-to-the-10x-revenue-club/",
        "created_utc": 1579061628,
        "id": "fefpl0g",
        "permalink": "/r/SecurityAnalysis/comments/eowmlv/analyzing_softwaretech_companies/fefpl0g/",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1579090428.0
    },
    {
        "author": "SirGlass",
        "body": "It's not that they won't, they can't. Good encryption doesn't have master keys",
        "created_utc": 1579144067,
        "id": "feipltc",
        "permalink": "/r/investing/comments/ep4fvw/if_apple_is_forced_to_comply_with_federal_demands/feipltc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1579172867.0
    },
    {
        "author": "jroche90",
        "body": "My mans. That streak most likely didn’t come from her front butthole. Not the one in the back, which makes it so, so much worse. Since you shared A story I’ll share one similar in nature. it’s long but idk how else to tell it. \n\nLinked up with this chick on bumble. Short, thick in the right places, rich, and a solid 7 on anyways scale. I met up with her in real life to bring her coffee on a break at her work. Her idea. Anyways I’m waiting outside &amp; make the “im here” call. She waddles our, 25lbs heavier stacked with makeup. Now, I’m here and already into this Bria for a 4$ venti Starbucks. I say to myself, she’s heavier and a 6, but she’s rich and nice so might as well hit it for the sport. Anyways we hangout for a bit and she kisses me goodbye, after 25 minutes of knowing me. A bit forward but hey this ones in the bag. She calls me half a bottle of wine deep that night and I come over and smash. Now while lined up from behind I got a whiff of “uht oh” that doesn’t come from a butt. Like a true solider I turn on the fan and strategically point it where I the breeze is flowing away from us. She stops and says “lemme suck ur dick” - pause - im in shock, my dick was just slamming this sweaty gross vag forever and now she wants to put her mouth on it? What do I do? She’s gunna puke and tell everyone my dick is stinky. I pull an alt right and say “ya sure after I shower I’m tired.” Smooth. I wash my dick like no ones business and return, ready to receive fellatio. Gentleman this is where the story turns for the better. This tiny girl sucked the soul out of my body through my dick that night. Right down the hatch like a champ. Didn’t bat an eyelash. 10/10 bomb killer head. Some so good I figured had to be an off night for her pussy. Maybe it was too hot, or the wine, maybe the wine. I said ok “will give her another shot tomorrow”. \n\nTomorrow came but I didn’t. For my boner was smacked down by a futile whiff from this dirty girls boner garage. Sex before that was great. Really great. She was down for whatever and was just my type. Vocal, aggressive &amp; dirty. I spent the next 3 days trying different scenarios to remedy this issue. Shower sex, random half clothed sex &amp; every position I could remember from my 17 years of watching porn. Alas, on the third day I sat there, on her couch in her beautiful loft condo. I knew that this issue was not going away, and I just couldn’t do it. She knew something was up and was getting catty and annoying whilst making us some pasta dish for dinner. “Find a way out man, find one” I said to myself. She marches over and drops the plate in front of me. I look down. “Mushrooms” I said outloud. “What?” She says. “Mushrooms” I said again, louder. I hate them, you know this. “Oh wtf ____ why didn’t you tell me?” But I did tell her, many times. “I’ll just order a pizza from up the street”. This was my ticket, I’ll go to “pick up a pizza” and ghost her. Never to be seen or heard from again. She begins flipping out. I patiently wait 15 minutes and say “ok I’m going to get the pizza.” She looks at me funny. She knows. She knows something is up. She follows me out to my truck, begging me to stay. I tell her no, “I’m leaving, you’re crazy and I’m not coming back.” She boils over. Screaming. She begins pleading. “Stay, Come and fuck me” “fuck me ___” I’m like “na”. “I’ll suck your dick, just stay.” My ears perked as blood rushes to my dong. At this point my inner monologue is a riot. Ultimately I come up with a plan to go back inside, get her butt naked while only my pants are down and then run out and away because she will be too naked to follow me. I say “ok, I’ll bang you but then I’m out.” She obliges by reaching for my ignition to get my keys. Obviously I stop her and put them in my pocket. We go inside and the plan is unfolding perfectly. She blows me until I’m at full salute, I turn the fan on and grimace in the mirror at myself as I head into the fray once more. I give it a solid 60 seconds before I smell sweat &amp; fish beginning to singe my nose hairs. I count down from three &amp; quickly pull out. Pants up. Out the door to my truck giggling the entire time. I can hear her coming. I fumble my keys on the way to the ignition. Truck on. Reverse.i look up and there she is. But naked in her driveway. Running towards my car. Boobs flailing, a 5’ marshmallow with tits chasing my truck steps at least 20 yards yelling “wait” “wait!!”. I bust a one legger burnout in my awesome blazer and I’m out of there. Stopped at the pizza place and ate my 45 minute old pizza with delight. Got home, washed my dick and never looked back. I did endure many calls &amp; texts. But that’s my one gross pussy story. Damn proud of it too.",
        "created_utc": 1579209868,
        "id": "fekxvse",
        "permalink": "/r/wallstreetbets/comments/epceuc/how_many_of_you_actually_hire_hookers/fekxvse/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579238668.0
    },
    {
        "author": "23therealme23",
        "body": "Someone gave Donnie the keys to the printer room...",
        "created_utc": 1580194672,
        "id": "ffsvyyi",
        "permalink": "/r/wallstreetbets/comments/euueg4/what_are_your_moves_tomorrow_january_28/ffsvyyi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580223472.0
    },
    {
        "author": "Regjohn",
        "body": "Unless he gets 2 gay keys to open him which is in fact, quite impressive",
        "created_utc": 1580204449,
        "id": "fft32n2",
        "permalink": "/r/wallstreetbets/comments/euueg4/what_are_your_moves_tomorrow_january_28/fft32n2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580233249.0
    },
    {
        "author": "redtexture",
        "body": "It is a genuine challenge. \n\nYou essentially must swing trade long call, or long put options.   \n\nThis person is a stock trader, and has a perspective on stock trades that can be translated into long options trades; he also has a comprehensive view of markets and market internals.   His perspective, and youtube library, may be of use toward developing a cautious long-option-only-strategy for option trades. \n\nJason Leavitt -- http://leavittbrothers.com/blog  \n\nJason Leavitt - Leavitt Brothers   \nYou Tube Channel   \nhttps://www.youtube.com/user/LeavittBrothers/videos  \n\nJason Leavitt's method towards developing a watch list, based on moving averages, and assessing the market environment.   \n\nUsing Moving Averages on Multiple Time Frames   \nNov 18, 2019    \nhttps://www.youtube.com/watch?v=FGfQAZoxP7w \n\nState of the Market\nDec 2, 2019  \nhttps://www.youtube.com/watch?v=NhKuPFTS63U\n\nIs the Stage Set for a Monster Rally   \nSep 9, 2019     \nhttps://www.youtube.com/watch?v=s0IjoNZr26U  \n\nDon't Shy Away From Expensive Stocks  \nApr 11, 2019    \nhttps://www.youtube.com/watch?v=FDlNyCSJR5M  \n\nThe Real Keys to Surviving and Making Solid Profits in the Market (Part 1)   \nJason Leavitt - via \"Investor Inspiration\"  - Sept 29 2016   \nhttps://www.youtube.com/watch?v=y7J8zthHCNg  \n\nThe Real Keys to Solid Profits (Part 2)  \nJason Leavitt - via \"Investor Inspiration\"    - April 10, 2017   \nhttps://www.youtube.com/watch?v=cY_6oxipJa0    \n\nThe Real Keys to Solid Profits (Part 3)  \nJason Leavitt via \"Investor Inspiration\"  - Sept 21, 2017  \nhttps://www.youtube.com/watch?v=EWB8XUtqqZk\n\nMini course  \nMini Masterclass in Trading  \nThe Scaled-Back Version of a Full Masterclass   \nhttps://jason-leavitt-masterclass-in-trading.teachable.com/p/free-mini-masterclass-in-trading",
        "created_utc": 1580405973,
        "id": "fg0e9p3",
        "permalink": "/r/options/comments/eunnko/noob_safe_haven_thread_jan_27_feb_02_2020/fg0e9p3/",
        "score": 1,
        "subreddit": "options",
        "created": 1580434773.0
    },
    {
        "author": "Madrid_Fan",
        "body": "What would you rather lose out of your phone, wallet, or car keys? Trying to make myself feel better 😓",
        "created_utc": 1578978735,
        "id": "fecnzmx",
        "permalink": "/r/wallstreetbets/comments/eoabog/what_are_your_moves_tomorrow_january_14/fecnzmx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579007535.0
    },
    {
        "author": "orrangearrow",
        "body": "Yea. That makes sense. I feel like the market is the retarded dude who works at the super market collecting carts and one day your casually walking down the street and hear somebody playing Chopin nocturnes op. 9 and you look in the window and it's the retard wearing a high-viz vest while tickling the keys in ways that make you wish you were closer to god.",
        "created_utc": 1578919890,
        "id": "fe7w6gz",
        "permalink": "/r/wallstreetbets/comments/eo2pe0/daily_discussion_thread_january_13_2020/fe7w6gz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578948690.0
    },
    {
        "author": "everythings-awkward",
        "body": "Y'all know me, still the same OG\nBut I been low-key\nHated on by most these bagholders\nWith no cheese, no deals and no G's\nNo wheels and no keys\nNo boats, no snowmobiles and no skis\nMad at me ‘cause I can finally afford\nTo provide my family with groceries\n\n\nYup. Forgot about Vic checks out",
        "created_utc": 1579116308,
        "id": "fehgxk3",
        "permalink": "/r/weedstocks/comments/ep0gha/rweedstocks_casual_daily_discussion_january_15/fehgxk3/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1579145108.0
    },
    {
        "author": "crunx22",
        "body": "If you want that feature I’d head to binance or Coinbase pro. Unless you plan to just sell ur crypto within a few weeks to months I wouldn’t buy it off RH since without the keys they arnt really yours to control.... I keep my BTC in a trezor just for hodling \nYou might have a different use case.\n\nGood luck.",
        "created_utc": 1579112652,
        "id": "fehaogu",
        "permalink": "/r/RobinHood/comments/eox1ps/can_you_set_a_stop_loss_for_crypto/fehaogu/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1579141452.0
    },
    {
        "author": "Not_Scott_Baio",
        "body": "This market seems generally overpriced, so I'll be looking for decent deals and this list depends on what goes/stays on sale, but:   \nRogers Corp., Keysight, Boeing, Zscaler, Visa/Mastercard, Dexcom, Twilio, Palo Alto Networks, Nvidia, Paycom, Cyberark, Microsoft, Plug and Ballard Power Systems.",
        "created_utc": 1578881437,
        "id": "fe648tl",
        "permalink": "/r/RobinHood/comments/enh9pi/what_stocks_are_you_buying_in_2020/fe648tl/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1578910237.0
    },
    {
        "author": "PanettoneSpumoni",
        "body": "TIL sunflower lanyards are for people with autism my parents got me one so I would stop losing my keys and then someone asked me about it wtf.",
        "created_utc": 1579626986,
        "id": "ff6gz23",
        "permalink": "/r/wallstreetbets/comments/ert4bk/daily_discussion_thread_january_21_2020/ff6gz23/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579655786.0
    },
    {
        "author": "DeginGambler",
        "body": "&gt; A lion doesn't concern itself with the opinion of sheep\n\nAs you grow older you'll learn that this adage is one of the keys to a healthy life. Our modern, lavish era has breed more sheep than lions. (See Rome 2.0).",
        "created_utc": 1578631508,
        "id": "fdpkyl8",
        "permalink": "/r/wallstreetbets/comments/emfxec/what_are_your_moves_tomorrow_january_10/fdpkyl8/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578660308.0
    },
    {
        "author": "traderfirstyear",
        "body": "The cycle is already ending. The first key was a simple formula \n\n(1.) Investments over Consumption\n(2.) Income over Expenditure\n\nIf you understand how to read the national product accounts you already know we have been heading for a recession since business investments went negative in the 2nd quarter of 2019. \n\nThe other Keys are just look around the world - Who is going to step in to cushion the US demand destruction &amp; soften the blow?\n(1.) Germany\n(2.) China\n(3.) Japan\n\nNot happening - last point where do you think the Dollar will be in the next 3 months higher or lower?",
        "created_utc": 1580256930,
        "id": "ffv6mu9",
        "permalink": "/r/options/comments/ev8gh1/traderfirstyear_recommends_apple_lotto_ticket_on/ffv6mu9/",
        "score": 1,
        "subreddit": "options",
        "created": 1580285730.0
    },
    {
        "author": "_BKNY_",
        "body": "I think someone switched the keys on your computer. Either that or you’re dyslexic. This is WSB not r/investing",
        "created_utc": 1580314496,
        "id": "ffwzhz7",
        "permalink": "/r/wallstreetbets/comments/evn4vk/jokes_aside_everyone_please_be_careful/ffwzhz7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580343296.0
    },
    {
        "author": "floev2020",
        "body": "Well sure they don’t want to compete with themselves. But also in my opinion, the intersecting need for a tablet like laptop isn’t quite there yet. The surface took that market. As of now, I haven’t seen a completely practical way to incorporate a full keyboard with a computer like tablet. \n\nThe surface is the best one out there, but even then, the keyboard is terrible and to use it as a tablet practically, you have to remove the keyboard or wrap it around the back while your hand is smashing the keys. \n\nI agree that eventually they’ll have to adapt, but it’s not like anyone else has a practical full solution to the combination tablet laptop. \n\nI believe If apple does come out with it, it’ll be a complete solution no one else has that will set the standard. \n\nMicrosoft has always seen where tech is going and they rush to get an early solution to market. Apple takes it’s time to bring out the *best* solution.",
        "created_utc": 1579898248,
        "id": "ffg4g6j",
        "permalink": "/r/stocks/comments/eta7f6/tesla_could_eventually_reach_a_trilliondollar/ffg4g6j/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579927048.0
    },
    {
        "author": "This_Coin_Needs_Work",
        "body": "Also, I see that Robinhood is preparing to sell cryptocurrencies from there scamming site. If I were you I wouldn't purchase any cryptos from an exchange that doesn't allow you to own your private keys, it's a disaster waiting to happen.",
        "created_utc": 1578427432,
        "id": "fdhp9ba",
        "permalink": "/r/RobinHood/comments/eldq8o/i_would_like_to_see_robinhoods_policy_regarding/fdhp9ba/",
        "score": 0,
        "subreddit": "RobinHood",
        "created": 1578456232.0
    },
    {
        "author": "t35t0r",
        "body": "I hold ~30% of these at any given time, but frequently by in and out of all of them :\n\naig\nbac\nbmy\nbynd\ncsco\neem\nefx\nfitb\nflgt\nfmc\nfxi\ngild\nhd\nhtht\nipar\nkbh\nlevi\nlh\nlly\nlscc\nluv\nmcd\nmrvl\npanw\npayc\nqcom\nroku\nspot\ntm\nttgt\nvtr\nzbra\n\nabbv\nabt\nacn\nadbe\nadsk\naltr\nathm\nazo\nbaba\nbax\nbrk.b\nburl\nc\ncdlx\ncmg\ncrm\ncsii\nctas\ndhr\ndpz\ndva\nenph\netsy\new\nfive\nfiw\nfn\ngpn\ngs\nhi\nhii\nhum\nhuya\nilmn\nintc\niq\nirmd\nisrg\nitgr\njbht\njd\nklac\nlk\nlow\nlrcx\nmdt\nmmm\nmnst\nmoh\nmsci\nmsft\nmt\nmtch\nmu\nneo\nnke\nnoc\nosk\npall\nqqq\nrace\nregn\nrost\nrrgb\nschb\nsea\nsedg\nshop\nskyw\nspgi\nstaa\nstm\ntgh\ntgt\ntsla\ntsm\nttd\ntxn\nuctt\nUI\nUL\nunh\nvar\nvrtx\nvti\nwfc\nwing\nxpo\nzbh\n\naap\naapl\nadi\nakam\namat\namd\namgn\namt\namzn\navgo\nba\nbax\nbeat\nbidu\nbzun\ncdxs\ncma\ncrsp\ndgx\ndhi\nemn\nens\netfc\nfpay\ngasx\nglw\nhon\nimgn\nintu\nkeys\nlhx\nlmt\nlrcx\nlyft\nma\nmdb\nmsft\nnflx\nnio\nnow\nntnx\nnvta\norcl\npdd\npfe\nphm\nptc\nrdfn\nrtn\nsbac\nsbux\nsdc\nsina\nteva\ntmo\ntol\ntri\ntsn\nual\nutx\nv\nvar\nvrsn\nvslr\nwb\nyum\nzg\nzs\n\nazn\nbdry\ngis\nmrk\nnvs\npgre\nshw\ntndm\nuaa\nveon\n\nlit\nendp\n\n\ntdg\nrtn\nutx\n\nosk\n\ngd\nldos\nhxl",
        "created_utc": 1578802764,
        "id": "fe04d2b",
        "permalink": "/r/RobinHood/comments/enh9pi/what_stocks_are_you_buying_in_2020/fe04d2b/",
        "score": 0,
        "subreddit": "RobinHood",
        "created": 1578831564.0
    },
    {
        "author": "This_Coin_Needs_Work",
        "body": "Seems to be a great policy set in place for those who aren't shareholders. What bothers me about that policy is the fact that shareholders are not given enough time to cover their negative balances to prevent liquidation from taking place. Therefore, I've been constantly educating new and current investors about decentralized assets Vs centralized assets. As the world switches over from centralization to decentralization, my hopes are that more people will come into the realization of how decentralized platforms are a much better decision in regards to trading, selling, or buying assets, as decentralized assets require private keys and confirmations in order to place them into a successful sell order.",
        "created_utc": 1578419733,
        "id": "fdhc44b",
        "permalink": "/r/RobinHood/comments/eldq8o/i_would_like_to_see_robinhoods_policy_regarding/fdhc44b/",
        "score": -1,
        "subreddit": "RobinHood",
        "created": 1578448533.0
    },
    {
        "author": "ImLennyBruce",
        "body": "&gt;  MU can always slide down hard if anything slightly contradicts the \"bottom is in\" thesis, if trade war rhetoric heats up again or if we get storm clouds 2.0.\n\nThis is what concerns me because I don’t trust Sanjay any more. It won’t take much to send this back down to 35 and I’m not going to get caught bag holding again. I’m happy to keep trading it when it’s going up but that it.\n\nThings are definitely frothy right now. I sold the rest of my LRCX yesterday and am going to sell AMD next week. \n\nMy plan is to just make short term plays until we get a pullback and hope to get some good deals.",
        "created_utc": 1578160585,
        "id": "fd3pgk9",
        "permalink": "/r/wallstreetbets/comments/ejnadw/weekend_discussion_thread_january_35_2020/fd3pgk9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578189385.0
    },
    {
        "author": "NightflowerFade",
        "body": "ENPH and SEDG. These two will continue to grow even after the recent stellar growth. Also, AMAT, LRCX and TSM are still good companies but don't expect 30% annual returns from those.",
        "created_utc": 1578530233,
        "id": "fdlqq7i",
        "permalink": "/r/stocks/comments/elwu8v/what_are_your_invest_in_what_you_know_stories/fdlqq7i/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578559033.0
    },
    {
        "author": "I_heard_a_who",
        "body": "Thoughts on Lam Research?",
        "created_utc": 1578610940,
        "id": "fdoqzv7",
        "permalink": "/r/StockMarket/comments/em9fvo/stocks_to_buy_in_2020_and_why/fdoqzv7/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578639740.0
    },
    {
        "author": "ImLennyBruce",
        "body": "&gt;  MU can always slide down hard if anything slightly contradicts the \"bottom is in\" thesis, if trade war rhetoric heats up again or if we get storm clouds 2.0.\n\nThis is what concerns me because I don’t trust Sanjay any more. It won’t take much to send this back down to 35 and I’m not going to get caught bag holding again. I’m happy to keep trading it when it’s going up but that it.\n\nThings are definitely frothy right now. I sold the rest of my LRCX yesterday and am going to sell AMD next week. \n\nMy plan is to just make short term plays until we get a pullback and hope to get some good deals.",
        "created_utc": 1578160585,
        "id": "fd3pgk9",
        "permalink": "/r/wallstreetbets/comments/ejnadw/weekend_discussion_thread_january_35_2020/fd3pgk9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578189385.0
    },
    {
        "author": "NightflowerFade",
        "body": "ENPH and SEDG. These two will continue to grow even after the recent stellar growth. Also, AMAT, LRCX and TSM are still good companies but don't expect 30% annual returns from those.",
        "created_utc": 1578530233,
        "id": "fdlqq7i",
        "permalink": "/r/stocks/comments/elwu8v/what_are_your_invest_in_what_you_know_stories/fdlqq7i/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578559033.0
    },
    {
        "author": "ImLennyBruce",
        "body": "&gt;  MU can always slide down hard if anything slightly contradicts the \"bottom is in\" thesis, if trade war rhetoric heats up again or if we get storm clouds 2.0.\n\nThis is what concerns me because I don’t trust Sanjay any more. It won’t take much to send this back down to 35 and I’m not going to get caught bag holding again. I’m happy to keep trading it when it’s going up but that it.\n\nThings are definitely frothy right now. I sold the rest of my LRCX yesterday and am going to sell AMD next week. \n\nMy plan is to just make short term plays until we get a pullback and hope to get some good deals.",
        "created_utc": 1578160585,
        "id": "fd3pgk9",
        "permalink": "/r/wallstreetbets/comments/ejnadw/weekend_discussion_thread_january_35_2020/fd3pgk9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578189385.0
    },
    {
        "author": "NightflowerFade",
        "body": "ENPH and SEDG. These two will continue to grow even after the recent stellar growth. Also, AMAT, LRCX and TSM are still good companies but don't expect 30% annual returns from those.",
        "created_utc": 1578530233,
        "id": "fdlqq7i",
        "permalink": "/r/stocks/comments/elwu8v/what_are_your_invest_in_what_you_know_stories/fdlqq7i/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578559033.0
    },
    {
        "author": "I_heard_a_who",
        "body": "Thoughts on Lam Research?",
        "created_utc": 1578610940,
        "id": "fdoqzv7",
        "permalink": "/r/StockMarket/comments/em9fvo/stocks_to_buy_in_2020_and_why/fdoqzv7/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578639740.0
    }
]