[
    {
        "author": "lonewolf420",
        "body": "Blue Origin is not anywhere close to putting up a Satellite constellation for global internet access like Space X is though.\n\nThis is the problem, Bezos really isn't going to get very far without first finding a reason to be profitable by launching satellites, he might keep BO as a pet project but will be spinning his wheels if he can't find a way to fund it without opening his pocket book every year (for which he most certainly can do but won't attract near the talent as the company turning a profit and launching far more rockets in a tighter cadence with re usability.)",
        "created_utc": 1578091616,
        "id": "fcz16aw",
        "permalink": "/r/investing/comments/ejgowz/tesla_tops_wall_street_estimates_with_a_record/fcz16aw/",
        "score": 11,
        "subreddit": "investing",
        "created": 1578120416.0
    },
    {
        "author": "FloundersEdition",
        "body": "many reason:\n\n* bears got burned, they retreated/covered short positions for now\n* fonds bought shares for their prospects (\"we invested in the biggest winner 2018 and 2019, we are good\")\n* noone wants Intel's \"best server CPUs\". hughe power draw, can't be cooled, no supply **at all** (not even price was announced). it was announced 6 months ago, some investors might believed Intels claims earlier, noone believes it now. it's a hughe difference, whether you supply 28 cores per socket or 56 cores. for their complete lineup: no PCIe 4.0 and only 48 PCIe lanes at best (EPYC has up to 128 PCIe 4.0 lanes!), it's becoming clearer every day: Intel will not be competitive for highest-end servers for at least 2 years (likely even 3-4) and AMD will be the biggest winner. Rome already get much better traction and qualified much faster than Naples, Milan likely coming mid year and it will qualify fast too\n* new 7nm Zen 2 with 8 cores Renoir-APU and better memory controller (huge power savings, clockspeed gains, IPC gains, better dealing with bandwith bottleneck) are expected tomorrow/very early this year (increased cadence compared to last years), while Intel has capacity and node issues. Intel tries to cut iGPU for desktop to regain capacity, but they samewhat forfeit marketshare with this call. OEMs have to use discret graphics, which they hate for Budget PCs (additional cost, additional power supply...). a refresh with better graphics can be expected ready for holiday season (van Gogh)\n* overall better economy forecast and china deal, so likely higher demand, Intel cannot supply processors, so AMD will even more\n* AMD ordered a **huge** amount of TSMCs wafer capacity, so they made a call\n* there is still the possibility of Apple using Zen for MacBooks and Macs, it's only clear that they drop Intel this year. Apple may use it's own chips, but that's quite a barrier (x86 -&gt; ARM) and they use AMD GPUs\n* Nvidia has yield issues, probably their line up is delayed a few months",
        "created_utc": 1578173033,
        "id": "fd50qvf",
        "permalink": "/r/stocks/comments/ejz8c0/why_are_investors_so_bullish_on_amd/fd50qvf/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1578201833.0
    },
    {
        "author": "ImChadYourSkinTag",
        "body": "I believe it is more \"director takes option then sells\". The dir Shoven exercised his option for 50k shares at $12.02 and then sold the shares at $73.19, making a cool $3M. With Cadence near it's 52 week high and the market like it is now, I'd be cashing those in as well. Not sure how much more you could/should read into that.",
        "created_utc": 1578845141,
        "id": "fe31upp",
        "permalink": "/r/StockMarket/comments/enoc1y/director_sells_and_then_takes_option_what_does/fe31upp/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1578873941.0
    },
    {
        "author": "bartturner",
        "body": "Ha!   You are honestly too funny.   A CDN has nothing to do with AI/ML.   It stands for Content Delivery Network.\n\nhttps://en.wikipedia.org/wiki/Content_delivery_network\n\nIt is how passive content can get to the user quicker.   Take Netflix.   They put an \"appliance\" into the ISP and then serve the movies from there.\n\nWill NOT work with search or Stadia or things interactive.  Has nothing to do with AI though.\n\nGoogle glass continues to do well and Google is about to drop the new generation of hardware.  We are now on the third generation.\n\n\"3rd generation Google Glasses are currently being tested\"\"\n\nhttps://mspoweruser.com/3rd-generation-google-glasses-are-currently-being-tested/\n\nGoogle right now is growing at 20% without any end in site.  Their non ad is now the size of 8 Twitters and growing at over 40% without any end in site.\n\nGoogle is just killing it.  With AI/ML but in some many other places.\n\nBTW, Google runs one of the largest CDNs.  But one of their competitors, Cloudflare was leaking passwords. Google found, alerted and even gave them the mitigation.  Who does such things?\n\nGoogle is just incredible.",
        "created_utc": 1578139486,
        "id": "fd1zymq",
        "permalink": "/r/stocks/comments/eiv70i/if_you_were_forced_to_put_all_of_your_money_into/fd1zymq/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578168286.0
    },
    {
        "author": "Prodigal_Moon",
        "body": "Read this in the cadence of ‘Twas the Night Before Christmas,",
        "created_utc": 1578373981,
        "id": "fdfypsr",
        "permalink": "/r/wallstreetbets/comments/el3k7e/short_tgt/fdfypsr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578402781.0
    },
    {
        "author": "St8Troopa",
        "body": "Edge CDNs",
        "created_utc": 1577990718,
        "id": "fcuxwaf",
        "permalink": "/r/stocks/comments/eirlng/companies_that_will_benefit_from_5g_indirectly/fcuxwaf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578019518.0
    },
    {
        "author": "123_holden",
        "body": "So American investors are screwed since Monday, the market is close for them and open for CDNs",
        "created_utc": 1579358142,
        "id": "fert8qo",
        "permalink": "/r/weedstocks/comments/eqbt5r/medman_bankruptcy_news/fert8qo/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1579386942.0
    },
    {
        "author": "SensibleCreeper",
        "body": "Director kept their share count neutral. They're just making money. I would worry about the CEO, 1,229,227 shares on Nov 14th, down to 888,272\tshares on Dec 16th. They removed 28% of their position.\n\nAll in all, they all cashed in on their position. They dont believe the stock can go higher. The stock has been rated as a sell by CDNS leadership. The stock hasnt recieved a third party analytical rating since October (before the big boys bought). Technicals on the chart shows sentiment on the stock is collapsing. No news is expected for sometime. If you're smart, sell ITM calls... if you can/know how to.\n\nHas FinViz Elite been worth it for you? Serious inquiry.",
        "created_utc": 1578845300,
        "id": "fe32maz",
        "permalink": "/r/StockMarket/comments/enoc1y/director_sells_and_then_takes_option_what_does/fe32maz/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578874100.0
    },
    {
        "author": "_J0hn_",
        "body": "All at once.  You are dollar cost averaging your IRA on a yearly cadence (by design).\n\nDo it monthly if it helps you sleep, but it's not really going to help you unless the market is trending downward.  DCA is mostly a psychological tool to defer risk to some arbitrary point in time.",
        "created_utc": 1578928883,
        "id": "fe8phu0",
        "permalink": "/r/investing/comments/eo3d1m/daily_advice_thread_all_basic_help_or_advice/fe8phu0/",
        "score": 1,
        "subreddit": "investing",
        "created": 1578957683.0
    },
    {
        "author": "123_holden",
        "body": "CDNs can sell MMEN on Monday - Americans can't b/c market(including OTC) is closed on Monday",
        "created_utc": 1579442492,
        "id": "fey9fnu",
        "permalink": "/r/weedstocks/comments/eqeui4/rweedstocks_weekend_post_saturday_january_18_2020/fey9fnu/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1579471292.0
    },
    {
        "author": "zebrawaterfall",
        "body": "Anything after Eminem show is horrible. Cadence is so bad.",
        "created_utc": 1579572303,
        "id": "ff4tu3g",
        "permalink": "/r/wallstreetbets/comments/erjns6/what_are_your_moves_tomorrow_january_21/ff4tu3g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1579601103.0
    },
    {
        "author": "St8Troopa",
        "body": "There's better 5G plays out there IMO. Look into edge CDNs.",
        "created_utc": 1577962258,
        "id": "fctvwte",
        "permalink": "/r/wallstreetbets/comments/eisc19/anyone_gonna_buy_a_shit_ton_of_nok_for_the_new/fctvwte/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1577991058.0
    },
    {
        "author": "wpiman",
        "body": "Don’t do a lot of analog stuff.  Mostly digital and use Modelsim and Cadence and synopsys products.",
        "created_utc": 1580514741,
        "id": "fg4znpq",
        "permalink": "/r/StockMarket/comments/evysi3/tesla_beats_earnings_650_after_hrs/fg4znpq/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1580543541.0
    },
    {
        "author": "123_holden",
        "body": "If the MMEN cashflow/bankruptcy issues are true, I feel bad for the US investors - CDNs get to sell their shares on Monday while Americans can only watch.",
        "created_utc": 1579358005,
        "id": "fersvja",
        "permalink": "/r/weedstocks/comments/eqeui4/rweedstocks_weekend_post_saturday_january_18_2020/fersvja/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1579386805.0
    },
    {
        "author": "123_holden",
        "body": "I hope the rumors are not true - this sector has enough issues only to add a new one just when it starts rallying.  Also, the people who get burnt by MMEN's bankruptcy (if true) are not going to invest their money in this sector again.  Hell, there's people on here posting...if they could recoup 70% of their money from MJ investments...they will take their money and run.\n\nOn Monday, CDNs are going to be dumping\n\nTuesday will be Americans selling what ever is left",
        "created_utc": 1579360908,
        "id": "fes2zwb",
        "permalink": "/r/weedstocks/comments/eqeui4/rweedstocks_weekend_post_saturday_january_18_2020/fes2zwb/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1579389708.0
    },
    {
        "author": "Thales111",
        "body": "Also Robinhood in their desperation has employed an army of reddit trolls, whose cadence / vocab suggests are like Eastern Europeans they’ve hired to intimidate people who report issues online\n\nI posted something about the negative buying power bug on Robinhood — one of literally multiple posts *that day* on the issue — and one of the responses was from a moderator who called me like a dumb fuck and downvoted my posts. Fucking insane man",
        "created_utc": 1578579299,
        "id": "fdn7dhv",
        "permalink": "/r/wallstreetbets/comments/em86ab/daily_discussion_thread_january_09_2020/fdn7dhv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578608099.0
    }
]