[
    {
        "author": "thicc_dads_club",
        "body": "Companies with a market cap &gt; 180B, by P/E (excluding BRK, obv):\n\n&amp;#x200B;\n\n|Symbol|Market cap|P/E|\n|:-|:-|:-|\n|INTC|186|8.95|\n|BAC|232|13.34|\n|VZ|248|13.62|\n|TM|199|15.02|\n|JPM|349|15.08|\n|MRK|204|17.76|\n|T|202|18.63|\n|UNH|318|19.36|\n|WMT|426|21.97|\n|CMCSA|225|22.15|\n|JNJ|385|23.12|\n|HD|290|23.42|\n|PFE|204|23.44|\n|PG|345|26.68|\n|KO|226|27.55|\n|NVS|193|28.04|\n|PEP|198|28.39|\n|TSM|494|30.52|\n|FB|768|31.08|\n|MSFT|1591|34.27|\n|GOOGL|1175|35.12|\n|GOOG|1178|35.22|\n|AAPL|1995|36.32|\n|BABA|733|37.64|\n|V|435|43.59|\n|MA|322|50.11|\n|ADBE|222|58.76|\n|ABT|197|58.85|\n|DIS|251|69.84|\n|PYPL|226|72.09|\n|NFLX|216|78.3|\n|NKE|209|78.69|\n|NVDA|324|87.87|\n|AMZN|1555|91.28|\n|CRM|235|103.68|\n|TSLA|464|997.74|\n\nYou can rule out companies that BRK already holds: AAPL, AMZN, BAC, KO, JNJ, JPM, MA, MRK, PFE, PG, and V. That leaves:\n\n&amp;#x200B;\n\n|Symbol|Market cap|P/E|\n|:-|:-|:-|\n|INTC|186|8.95|\n|VZ|248|13.62|\n|TM|199|15.02|\n|T|202|18.63|\n|UNH|318|19.36|\n|WMT|426|21.97|\n|CMCSA|225|22.15|\n|HD|290|23.42|\n|NVS|193|28.04|\n|PEP|198|28.39|\n|TSM|494|30.52|\n|FB|768|31.08|\n|MSFT|1591|34.27|\n|GOOGL|1175|35.12|\n|GOOG|1178|35.22|\n|BABA|733|37.64|\n|ADBE|222|58.76|\n|ABT|197|58.85|\n|DIS|251|69.84|\n|PYPL|226|72.09|\n|NFLX|216|78.3|\n|NKE|209|78.69|\n|NVDA|324|87.87|\n|CRM|235|103.68|\n|TSLA|464|997.74|\n\nIMO you can also rule out INTC (risky), telecom (not a common target for Buffet), and anything with a P/E over 50. That leaves:\n\n&amp;#x200B;\n\n|Symbol|Market cap|P/E|\n|:-|:-|:-|\n|TM|199|15.02|\n|UNH|318|19.36|\n|WMT|426|21.97|\n|HD|290|23.42|\n|NVS|193|28.04|\n|PEP|198|28.39|\n|TSM|494|30.52|\n|FB|768|31.08|\n|MSFT|1591|34.27|\n|GOOGL|1175|35.12|\n|GOOG|1178|35.22|\n|BABA|733|37.64|\n\nI think that Toyota is an interesting option. Low P/E, decent dividend, and still to announce an all-electric car.",
        "created_utc": 1606141255,
        "id": "gdbz319",
        "score": 77,
        "subreddit": "investing",
        "created": 1606170055.0
    },
    {
        "author": "Jsizzle19",
        "body": "There’s only like 20 companies it could be, so the best guesses are as follows:\n\nPfizer, PayPal, Bank of America, Salesforce, Disney, Adobe or maybe Home Depot but I think their valuation has too high based on timing, to fit the $223B valuation.",
        "created_utc": 1606134085,
        "id": "gdbpe3c",
        "score": 27,
        "subreddit": "investing",
        "created": 1606162885.0
    },
    {
        "author": "trdlts",
        "body": "Services/Iphone/Ipad make up the majority of their revenue, mac\\* series makes up less than 10%. Keep in mind a lot of software doesn't run on the new M1 chip yet(adobe products for one), so many businesses including mine are holding off on buying them.",
        "created_utc": 1605481852,
        "id": "gcfquc5",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1605510652.0
    },
    {
        "author": "notgoingplacessoon",
        "body": "Between my family we have almost every subscription.\n\nNetflix is better by far.\n\nThe problem with netflix is how much it costs to make these movies. They are constantly dumping millions on reused content.\n\nCompared to other tech companies who make a product and can continue the same product, get continued revenue and not have to constantly spend such higher amounts.\n\nConsider Adobe suite. They have been making tweaks to the exisiting platform be are able to continue to charge more.",
        "created_utc": 1605481852,
        "id": "gcfquc7",
        "score": 15,
        "subreddit": "StockMarket",
        "created": 1605510652.0
    },
    {
        "author": "jbrandimore",
        "body": "ADBE and NFLX show this same pattern",
        "created_utc": 1606769113,
        "id": "ge6oyeu",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1606797913.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "How can $ADBE be down if Adobe photoshop makes up 99% of $NKLA’s 18billion market cap?",
        "created_utc": 1605023019,
        "id": "gbu43qd",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1605051819.0
    },
    {
        "author": "RayPissed",
        "body": "Adobe Subscription -$49...there you go",
        "created_utc": 1604956169,
        "id": "gbray6k",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1604984969.0
    },
    {
        "author": "yeahman64",
        "body": "ADBE, AMAZN, MSFT - I’m long these three with my life savings of like 35k as they are all at best support levels. Adobe won’t go below 450, Amazon won’t go below 3000 and Microsoft won’t go below 200. I’ll check back in a few weeks when I’m a millionaire after the big tech upwards correction.",
        "created_utc": 1606062581,
        "id": "gd8cfzp",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606091381.0
    },
    {
        "author": "bonejohnson8",
        "body": "Bullish on Adobe. I'm about to give them money for the first time in my life. Adobe cloud on sale for 15/mo for students, all you have to do is use an edu email address. You can get an edu address for like 5 bucks on fiverr from a broke college kid.  I could never bring myself to get it for 50 a month but 15 with minimal work is too good to pass up.",
        "created_utc": 1606695504,
        "id": "ge3jr2u",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1606724304.0
    },
    {
        "author": "plooper58",
        "body": "Never. They have their own competitive product, called Adobe Sign, which does not have DocuSign’s level of growth",
        "created_utc": 1606716420,
        "id": "ge4hs0c",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606745220.0
    },
    {
        "author": "mr_schmunkels",
        "body": "One thing I'd like to know is whether software companies like Adobe will have to split significant resources into making ARM compatible products alongside their x86 packages or whether this is a relatively easy step in the process.",
        "created_utc": 1605817094,
        "id": "gcv53oy",
        "score": 4,
        "subreddit": "investing",
        "created": 1605845894.0
    },
    {
        "author": "kaorii_senpai",
        "body": "&gt;Consumers spent an estimated $9 billion on U.S. retail websites on Black Friday, according to Adobe Analytics, which tracks online shopping. That was a 22% increase over the previous record of $7.4 billion set in 2019.\n\nMonday 🚀🚀🚀",
        "created_utc": 1606643683,
        "id": "ge0azyv",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606672483.0
    },
    {
        "author": "MarketOracle",
        "body": "Here's the problem with their business model, and it states it up front in their prospectus that most investors aren't willing to read. Their customer acquisition costs are very expensive. They spend several hundred thousands trying to acquire a customer because it requires them sending developers to a client, writing custom code to ingest data, and then hope the client signs up with them. If the client does not, then they lose that developer time. The hope is that the client signs up and pays an initial subscription cost. Then over time, the client would request additional data to be ingested, which increases cost to the customer. Finally, they hope that their systems will be so integrated with the client's systems, that they cannot be easily replaced or it would not be cost-effective to do so. That's when they will profit the most from the client.\n\nHere's the problem. They haven't been profitable in 17 years because this business model doesn't work. It is limited by the number of developers available to implement their platform into different client systems. This is the painstaking manual process.\n\nHere is my opinion: it is a high-millions, low-billion dollar business, but nothing that will scale like Adobe, Netflix, and other cloud services. They may have the best product in the world, but just like any product, you need sales. 125 customers after 17 years is an average of 7 customers a year. Also, they need positive cash flow. Instead, they have increasing operating costs and uncertain profit because some of their clients have downscaled services or cancel completely. $10 IPO was cheap. I considered, but passed. Great that some were able to double their money so far. But right now, it is risky. MoviePass was a great product for their customers, but their increasing operating costs due to their bad business model was their downfall.",
        "created_utc": 1606267800,
        "id": "gdiaevh",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606296600.0
    },
    {
        "author": "DaRepo",
        "body": "Its been 10 years now since ADBE moved",
        "created_utc": 1606141405,
        "id": "gdbzbr2",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1606170205.0
    },
    {
        "author": "t777m",
        "body": "I’m 18, a student, getting money by saving parts of my student loan. My objectives are to simply get an understanding of investment and then work towards targets (a quick way of getting money would be nice but i understand that in my position its not faesible). As I’m starting off with a weak source of money i’d prefer a safer strategy, for now. I managed to get hold of 0.02 ETH and a share of SDC.\n\nI have recently picked up an interest in investing and am thinking about starting in the coming days, on trading 212. Ive selected the FAANG companies, Microsoft, Tesla, Shopify, Salesforce, Nvidia, Adobe and Vanguard emerging markets etf. I’m not sure about the percentages.\n\nis this a good pie and what percentages should i use?",
        "created_utc": 1604276240,
        "id": "gauijhz",
        "score": 3,
        "subreddit": "investing",
        "created": 1604305040.0
    },
    {
        "author": "Simplivest",
        "body": "There are currently 71 stocks on our ***Gangbuster Growers*** screen.  Here are some of the names:\n\nAMZN, GOOG, CSGP, NFLX, ADBE, NOW, TTD, TREE, ALGN, EPAM, PAYC, RNG, VRTX, VEEV, PANW, FB, CRM, TEAM, ARE, SEDG, AYX, GLOB, MED\n\nHope that gives you something to chew on.\n\n**--- Simplivest ---**",
        "created_utc": 1605919859,
        "id": "gd0099z",
        "score": 3,
        "subreddit": "stocks",
        "created": 1605948659.0
    },
    {
        "author": "LiamPhlegmsworth",
        "body": "Fire up the Adobe and find a bigger hill!",
        "created_utc": 1605029171,
        "id": "gbuh5j1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605057971.0
    },
    {
        "author": "Logaratyunas",
        "body": "All PLTR long term holders listen up.\n\nTodays earning will very well crash the price from $15 to $7.50 and maybe $4 in the next few days. Many pussy diamond hands have sold, or are selling before the bell. Many will sell once the price plunge to under $10. But know that AMZN, MSFT, AAPL, FB &amp; NFLX have all dropped below half of their IPO price. Believe in data analytics, their ability to reach all corners of the world with their human tracking, and their billionaire CEO who is a PayPal founder and FB first investor. They may be the next Microsoft, Adobe or Salesforce.\n\nTldr: $12 Puts are sure to print after they blow their earnings for this profitless company...",
        "created_utc": 1605201817,
        "id": "gc2ank3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1605230617.0
    },
    {
        "author": "GodoftheGodcreators",
        "body": "Its video conferencing tool, right? So its free for consumers and couple thousand a year for business like adobe suite or shit. How is that 100 billion? Is the technology impressive? No, not even at all.",
        "created_utc": 1605495840,
        "id": "gcghq00",
        "score": 3,
        "subreddit": "stocks",
        "created": 1605524640.0
    },
    {
        "author": "brunette5179",
        "body": "Been bagholding ADBE for months last fucking time I try a boomer stock",
        "created_utc": 1606767834,
        "id": "ge6m8it",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606796634.0
    },
    {
        "author": "whoissuperlazy",
        "body": "F this. I m selling my appl adbe amzn google and buying evvvvvv",
        "created_utc": 1606173191,
        "id": "gddrbgv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1606201991.0
    },
    {
        "author": "DoubleKillGG",
        "body": "Play at your own risk (bullish):  \nADBE 487.5C 11/13  \nBAM 40C 12/18  \nPSA 260C 12/18  \nGIS 62.5C 12/18  \nCPB 52C 12/4  \nCL 90C 12/4  \nHD 290C 11/20",
        "created_utc": 1605160858,
        "id": "gc0l7q7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605189658.0
    },
    {
        "author": "spike_owens",
        "body": "I sat through a Palantir demo, and while it looks nice, it reminded me a lot of elastic search, so I just googled Palantir + Elastic Search, and they basically are (or were) just using open source elastic as the method of working with unstructured data. \n\n&amp;#x200B;\n\n&gt; Elasticsearch at Palantir  \nElasticsearch plays a key part in Gotham, one of Palantir's core platforms that powers a wide range of applications in areas such as law enforcement, mortgage fraud detection, and disaster response. In this talk, we'll give an overview of how Elasticsearch is used at Palantir and demo one of the latest applications, a tool that helps lawyers investigate financial wrongdoing. We'll then discuss how we made the switch to Elasticsearch from a custom solution built on Lucene and Postgres. The focus will be on one of our biggest challenges, implementing performant, fine-grained access control. \n\nThe main \"proprietary\" portion of PLTR as far as I could find, is that they've developed some custom APIs to streamline data processing, so if you're constantly getting real time data, they've put in work to make that process faster and more reliable. \n\nIt kind of makes sense if that's truly what makes them special that they tried to get into finance, since that's one of the few industries dealing with billions of transactions a day where speed of classification is really important. The fact that they haven't made many inroads in that sector makes me question how much value they have outside of government agencies.\n\nAfter looking at Palantir I decided to invest in Elastic instead, but I don't have a lot of conviction in that pick. I just viewed the fact that Elastic already has more customers than Palantir, especially among large corporations, as a roadblock for Palantir gaining share among corporations. Obviously Palantir isn't only Elastic Search, but that's really the core functionality that most companies want, and since Elastic is open source, all of the major developers either already have, or soon will develop a GUI that's the equivalent of the Palantir front end (such as Adobe Sensei).",
        "created_utc": 1605540497,
        "id": "gci3fy9",
        "score": 2,
        "subreddit": "investing",
        "created": 1605569297.0
    },
    {
        "author": "gronkadonk69",
        "body": "I like DOCU better than TDOC because they absolutely own nearly the entire electronic signature market. It's not a pure covid play. My only concern is Adobe and Microsoft taking market share.",
        "created_utc": 1605050887,
        "id": "gbvpxpn",
        "score": 2,
        "subreddit": "stocks",
        "created": 1605079687.0
    },
    {
        "author": "rickjamesnostrils",
        "body": "Adbe going to kick off its earnings run up. Boomerish stock, sure, but usually has a good run up. Or fuck you, do whatever",
        "created_utc": 1606163711,
        "id": "gdd83c3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606192511.0
    },
    {
        "author": "librelibero",
        "body": "CRM ADBE",
        "created_utc": 1606263138,
        "id": "gdi1vzo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606291938.0
    },
    {
        "author": "Logaratyunas",
        "body": "Amazon has been making a loss until the late 2000s. Many other company have not been making a profit. Take Snowflake which have a lower revenue and still negative profit being valued over twice of Palantir. \n\nThe main reason why it was making a loss is because it has very high initial customer acquisition costs, similar to Microsoft and Adobe back in the 80s when they were developing for enterprise. Except Palantir engineers must learn on hand the data from various industries and specially tailor the software to fit the individual customers better. Their profits are becoming less negative over the years as they increase their customer base and retention rates, and as their credibility and reputation increases. \n\nMicrosoft and Adobe were B2B before with their software before jumping 200000% since the 1980s. If Palantir could create, transfer and scale their data AI technologies to everyday consumers and become a big name in the future, they will easily be a multi trillion dollar company. If they don't, at least I know they won't go bankrupt with their military dependence hahaha.",
        "created_utc": 1605740614,
        "id": "gcrr0ie",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605769414.0
    },
    {
        "author": "ButtSliding",
        "body": "Let this be the thread where we all say which companies we’re invested in right now. I’ll start. \n\nMP, BB, TAN, TXG, PTVE, PNR, AWK, F, MGNI, ET, ADBE \n\nAll long calls",
        "created_utc": 1606766585,
        "id": "ge6jjfi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606795385.0
    },
    {
        "author": "NonGNonM",
        "body": "damn y'all i rebooted my laptop and i got a prompt to uninstall flash due to EOL updates.\n\nit truly was an adobe flash player.",
        "created_utc": 1604480434,
        "id": "gb3ln2b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604509234.0
    },
    {
        "author": "CollectedData",
        "body": "Two accounts, the bigger one:\n\nAAPL - 21%\n\nAMZN - 14%\n\nCRM - 10%\n\nAMD - 10%\n\nCARR - 5%\n\nADBE - 5%\n\nMCO - 5%\n\nEPAM - 5%\n\nSNPS - 5%\n\nDHR - 5%\n\nENPH - 5%\n\nNVDA - 5%\n\nSQ - 5%\n\nThe small one:\n\nAMZN - 50%\n\nMSFT - 25%\n\nMA - 25%",
        "created_utc": 1605300068,
        "id": "gc6sdw4",
        "score": 2,
        "subreddit": "stocks",
        "created": 1605328868.0
    },
    {
        "author": "FarMastodon1",
        "body": "adobe connect is much better for professional conferences and business in general. I used it exclusively. For conferences with big pharma and prestigious physicians. Yeah, zoom works. Just like a 2013 Toyota Corolla works. But the best companies are eventually going to want to drive the 2020 Tesla’s, adobe connect. Just my 2 cents on that.",
        "created_utc": 1605055308,
        "id": "gbvy3cj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1605084108.0
    },
    {
        "author": "xCheetaZx",
        "body": "Good points. I definitely hear about the prices of Adobe a lot and I do remember them being expensive when I looked a few years ago. I'll definitely look into Unity!",
        "created_utc": 1606343480,
        "id": "gdllrm9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1606372280.0
    },
    {
        "author": "Trading-Resources",
        "body": "https://www.cnbc.com/2020/11/27/thanksgiving-day-online-sales-hit-record-5point1-billion-up-21point5percent-from-last-year-adobe-says.html\n\nThis works for me",
        "created_utc": 1606516340,
        "id": "gdt54jg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606545140.0
    },
    {
        "author": "DaRepo",
        "body": "ADBE has been the most boring stock ever in the last couple weeks, graph is literally just a straight horizontal line lol",
        "created_utc": 1606248728,
        "id": "gdh99cb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606277528.0
    },
    {
        "author": "JeffB1517",
        "body": "Autodesk, Bloomberg, Adobe (ex  Adobe Font Folio).  As an aside  Softimage sells a software package for individuals at $95k.  Core Security's package is $40k.",
        "created_utc": 1606354977,
        "id": "gdm5l8l",
        "score": 2,
        "subreddit": "investing",
        "created": 1606383777.0
    },
    {
        "author": "old-wizz",
        "body": "I have Adobe calls that did nothing but lose value for weeks. Suddenly up 7 percent 🤯",
        "created_utc": 1604504122,
        "id": "gb4hr37",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1604532922.0
    },
    {
        "author": "anthonyallday",
        "body": "Moderna’s vaccine progress means that some tech stocks are trading lower. Trying to make a list of stocks to buy on the dip if they go down 5-10% (that would do well post-vaccine):\n\nSquare, Netflix, Adobe, DocuSign\n\nAny other ideas?",
        "created_utc": 1605535828,
        "id": "gchv0v2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1605564628.0
    },
    {
        "author": "bearpics16",
        "body": "A lot of professional and semi-pro/amateur photographers are moving away from photoshop and lightroom. Too expensive and lightroom is a pile of shit. Also lots of people hate the creative cloud subscription model. However I'm still using adobe because I'm too lazy to switch. \n\nThere are a lot of cheaper photoshop alternatives out there that do a pretty good job. \n\nCorporate multimedia will continue using photoshop, and businesses will still use acrobat.",
        "created_utc": 1606696288,
        "id": "ge3l5ru",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1606725088.0
    },
    {
        "author": "Dronez",
        "body": "I've been using Adobe products for over a decade. I'm a subscriber. I would not buy their stock at these prices.\n\nThere are some extremely powerful competitors - Affinity, Davinci Resolve, and they are available for a fraction of the price, no subscription needed. Adobe keeps pouring money into bullshit apps like Premiere Rush or Fresco that literally nobody who is a professional gives a shit about.\n\nMy suggestion would be to put it into something like Unity instead, and bet on it becoming the \"Adobe\" of video game making. The learning curve isn't that bad, and it's cheap/free for people to start making stuff. The next generation wants to make video games, not commercials.\n\nDisclosure I have 40 shares of Unity.",
        "created_utc": 1606340331,
        "id": "gdlfqn1",
        "score": 2,
        "subreddit": "stocks",
        "created": 1606369131.0
    },
    {
        "author": "dvdmovie1",
        "body": "Additionally, I'll note that Softbank shows the majority of the Northstar portfolio in the latest earnings presentation and what's shown is spectacularly generic.\n\nFor a company that discusses the founders 300 year vision and whatnot, a portfolio of Amazon, Google, Nvidia, Facebook, Paypal, Adobe, Salesforce and others? What is showing is basically FANG + handful of other popular large caps you've seen mentioned on here a hundred times. Where's healthcare? Softbank has actually done well in making healthcare investments (TXG, GH), so why just this sort of generic tech fund? Maybe what's under \"others\" is more appealing, but what's seen isn't encouraging.",
        "created_utc": 1605195182,
        "id": "gc1wrpy",
        "score": 1,
        "subreddit": "investing",
        "created": 1605223982.0
    },
    {
        "author": "The_Folkhero",
        "body": "Facebook \n\nGoogle\n\nSalesforce \n\nAdobe \n\nIntuit\n\nMatch Group\n\nSprout Social \n\nPinterest",
        "created_utc": 1605184851,
        "id": "gc1fkpl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605213651.0
    },
    {
        "author": "bbenecke3636",
        "body": "Their IP is their platform, same as uber and lyft and other companies which have utilized technology to build a platform that disrupts existing business models. Does uber not have any existing moat, or airbnb? There's arguably high barriers of entry, tons of brand name value, solid interfaces. Quality algorithms and connection tools. I didnt say a disruptor in itself is a tech company, a tech company is quite literally a company that sells technology or technology services, which is precisely what air bnb is. Its a technology service.\n\nUA is not a tech company, thats not really being debated anywhere. They are retail, without producing clothing, the additional tech wouldn't matter. The company isn't selling tech or services, they're selling clothes with some tech built in. Airbnb sells technology services, no differently than Adobe does",
        "created_utc": 1605210659,
        "id": "gc2uya7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605239459.0
    },
    {
        "author": "neothedreamer",
        "body": "Let me rephrase. The TAM may be that big but a lot of Commercial Customers want a scalable solution not one that is custom built.  Those are expensive and hard to support long term.  Big reason why SAP is floundering and competitors likes Salesforce and Adobe are doing so well.",
        "created_utc": 1605275530,
        "id": "gc5hd3h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605304330.0
    },
    {
        "author": "Calislimjim",
        "body": "The real question is why haven't they beaten DOCU to the punch. DOCU has a strong market share. Adobe and Microsoft missed the market so the question is why would they invest in area that you think doesn't have a moat? Doesn't seem like entry into this area that would have great profit margins for either company.",
        "created_utc": 1605076694,
        "id": "gbwvx00",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605105494.0
    },
    {
        "author": "PDXdesign",
        "body": "I so hate Adobe. No offense to r/stocks but I hope the government lays the smack down on their non competitive price-gouging practices.",
        "created_utc": 1605109932,
        "id": "gby05fw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605138732.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "Take your pick from FAANG, but my money is on $SHOP, $MELI or, a bit more of a boring duo: $DOCU and $ADBE",
        "created_utc": 1605027984,
        "id": "gbuela8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605056784.0
    },
    {
        "author": "Demogorgonaut",
        "body": "Picked up some more Adobe on sale today. Looking to expand positions in PayPal and Shopify. I did shed a bit of Zoom at around 480 (picked up in August) as I don’t have that strong of an investment thesis and I considered it a pretty gimmicky covid-play anyway. Not doing anything drastic, as per usual",
        "created_utc": 1605031348,
        "id": "gbulvq9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605060148.0
    },
    {
        "author": "The_Folkhero",
        "body": "It is never too late. It would not be much of an investment, honestly, for either company seeing that Adobe is a 200+ billion company and Microsoft is a 1.5+ trillion dollar company while Docusign is a 30 billion dollar company. These companies add features to their products that they can see have demand in the marketplace that wind up increasing their product's value proposition.",
        "created_utc": 1605092702,
        "id": "gbxbbsg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605121502.0
    },
    {
        "author": "Afrofreak1",
        "body": "With all do respect to the guy, I think Buffet has way past his prime. He made his money during a period in time where you could measure the value of a company by its tangible assets. That is no longer the case when you have firms that are able to write lines of code and then sell carbon copies of it billions of times over on a monthly subscription base à la Adobe for example. What other company has an 87% gross margin? Obviously if you apply traditional metrics to a company like that it's going to look overvalued, which is why he has underperformed the S&amp;P500 by quite a margin since 2008.",
        "created_utc": 1605057467,
        "id": "gbw1yfj",
        "score": 1,
        "subreddit": "investing",
        "created": 1605086267.0
    },
    {
        "author": "Biggie_Cheese96",
        "body": "This is my Roth IRA focused on growth and capital gains. All 5% allocation. Valued at just over $4000 with $125 deposited in this account (M1 finance) every week. Deposited more on the big tech dips prior to the election. \n\n* NIO\n* PTON\n* CRM\n* ROKU\n* AMD\n* SPLK\n* BIDU (Google of China sorta similar to Alibaba - eCommerce. Working on autonomous driving/robotaxis)\n* NVDA\n* TSLA\n* CRWD (Even is Zoom/Slack decline when the vaccine comes out and our lives go back to normal, cybersecurity is still a necessity)\n* TTD\n* IPOB (SPAC with Opendoor)\n* TDOC\n* BABA (Chinese exposure and a way to get exposure on the ANT IPO)\n* ADBE\n* SQ\n* PLTR\n* SHOP\n* MELI (Latin America exposure)\n* TAN (Even with a possibly divided Congress, I think some green/renewable infrastructure deal would be done)",
        "created_utc": 1604946826,
        "id": "gbqrii0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1604975626.0
    },
    {
        "author": "ButtSliding",
        "body": "adobe",
        "created_utc": 1604859027,
        "id": "gbmvcsr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604887827.0
    },
    {
        "author": "Trenchcoat_Economics",
        "body": "ADBE is my favorite sleeper stock in the tech sector because it doesn’t break through until there’s full confidence.",
        "created_utc": 1606039889,
        "id": "gd74p32",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606068689.0
    },
    {
        "author": "TheyHaveTheVaccine",
        "body": "I'm not sure if this is ok to post here, but I just wanted to lay out where my money is, and ask what anybody has to think of say, and if I am being an idiot, or am I so a decent path or not. \n\nI recently had a large windfall after my equity in a startup got bought out. More money than Id ever thought I'd have at one time - not retirement money, but set myself up for my future if I make the right moves money. I'm a 30 year old dude, no kids, no mortgage, not married, no crazy big expenses...make 60k a year now, hopefully a raise at the end of the year and my company is one of the incredibly lucky ones to be thriving right now. So, I figure I can definitely be a little risky. But I don't want to be an IDIOT. Any and all advice would be humble and sincerely appreciated (I didn't even have a savings account before this because I was an idiot)\n\nRoughly 100k after taxes. \n\nI reinvested 35% back into my company, and they matched the investment as an incentive. Only a select few of us were able to do this. \n\nI have 10k in Tmobile money, as a tmobile customer. So getting 4% on 3k and 1% on everything after. (Higher than any high yield savings accounts right now it looks like!)\n\nSpent some, of course. But, I also decided to try my hand at the market. Not sure if this is ok to post here? But wanted to show my portfolio as well as it's about 10k. Any thoughts are very welcomed! Any insults for being an idiot are also welcomed, if that is the case. \n\nADBE +3 @ 455.81\n\nBA +2 @ 210.10\n\nPLTR +40 @ 15.54\n\nZOM +62 @ 0.1676\n\nLlNW +7 @ 3.32\n\nGLUU + 25 @ 8.40\n\nHEXO +69 @0.9451\n\nPYPL + 2 @ 195.68\n\nNIO +7 @ 41.88\n\nSUNW +5 @ 3.11\n\nPLUG +20 @ 22.11\n\nFCEL +20 @ 5.02\n\nBLDP +20 @ 16.92\n\nGOOG +1 @ 1776.94\n\nBABA + 3 @ 258.43\n\nJD +2 @ 86.76\n\nMMM +3 @170.21\n\nTMUS +3 @ 127.85\n\nAMD +10 @ 82.39\n\nDBX +2 @18.40\n\nACAAX +14.237 @ 35.12\n\nGQGPX +30.303 @ 16.50\n\nPRBLX + 20.165 @ 20.165\n\nRight now, 2 orders pending, may cancel:\nTSLA + 2 @ 490.59\n\nNIO + 20 @ 49.27",
        "created_utc": 1605983723,
        "id": "gd38p87",
        "score": 1,
        "subreddit": "investing",
        "created": 1606012523.0
    },
    {
        "author": "ButtSliding",
        "body": "I didnt think Adobe would keep dropping :(",
        "created_utc": 1606145766,
        "id": "gdc6xma",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606174566.0
    },
    {
        "author": "moon_market",
        "body": "Adbe ripping soon get in while you can",
        "created_utc": 1606211712,
        "id": "gdfdlb5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606240512.0
    },
    {
        "author": "SilentRadiance",
        "body": "I like ADBE long term. They're still the standard, I use their creative cloud, very powerful software. The only problem is the price tag for the service has gotten pretty hefty, but migrating away from their platform is going to come with compromises. A complete alternative doesn't exist as of yet.",
        "created_utc": 1606336289,
        "id": "gdl7w03",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606365089.0
    },
    {
        "author": "Summebride",
        "body": "Nodisrespect, but if you're making big pronouncements about RISC and CISC and chip architecture and manufacturing, and you never heard about TSM before today, you have a lot of subject area familiarity to do.  It's kind of like saying you know about software but you've never heard of Adobe.",
        "created_utc": 1606445832,
        "id": "gdq97ai",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606474632.0
    },
    {
        "author": "Crit_Romney",
        "body": "Position Stats: ADBE 500C 12-04-2020\nRecent best performance: 125.58%\n[Price history chart](https://tendiechart.com/pricehistory.cfm?symbol=ADBE&amp;date=1607040000&amp;s=500&amp;t=C)",
        "created_utc": 1606488340,
        "id": "gdro4ih",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606517140.0
    },
    {
        "author": "roshankrj",
        "body": "Alright, adobe sign - yes - others are not that popular, there probably is space for duopoly. But have you noticed the extraordinary revenue run rate of Docusign? Not to mention that they are expanding their service around legal services, notary etc..",
        "created_utc": 1605902040,
        "id": "gcz29wn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605930840.0
    },
    {
        "author": "whoissuperlazy",
        "body": "5 year baba trend does not look good. Comparing it to amzn tsla adbe",
        "created_utc": 1605741298,
        "id": "gcrsmml",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605770098.0
    },
    {
        "author": "dawgsgoodjortsbad",
        "body": "To be fair, there is one obvious competitor adobe.  The pdf is already made by them and they have the signature/certificate function available.  Really not sure what advantage docu has over them",
        "created_utc": 1605736817,
        "id": "gcrircn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605765617.0
    },
    {
        "author": "Marzouque",
        "body": "No one is that rich or anything, that's a randomly generated click bait, I still have my subscription so if u insist I can give you their 'buy now' list. I just want to be clear that I don't trust them whatsoever\n\nADBE, JD, FICO, NVDA, RH. Knock urself out",
        "created_utc": 1606359603,
        "id": "gdmd5iw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1606388403.0
    },
    {
        "author": "rickjamesnostrils",
        "body": "Sneaky blue chip play - ADBE earnings next week",
        "created_utc": 1606769535,
        "id": "ge6pu21",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606798335.0
    },
    {
        "author": "idanfl8",
        "body": "Wow adobe is printing bigly at the moment 😎",
        "created_utc": 1604513685,
        "id": "gb523ei",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604542485.0
    },
    {
        "author": "Shaun8030",
        "body": "Rather hold \"hype\" stocks like GOOG , amzn , apple , MSFT , v ,ma , Nvidia , adbe , Tsla, baba ,  PayPal , sq , TSM and happily  count all the money I made from my dumb luck, while you  bag hold perennial low growth  losers like cdn dividend stocks SU , Enb , TD , BCE ,T  reits etc. Switched over to a US heavy tech portfolio in 2016 and sold all my loser blue chip cdn dividend stocks at that time best investing decision I have ever made.",
        "created_utc": 1604713183,
        "id": "gbesl7w",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1604741983.0
    },
    {
        "author": "LuckyPuppy1",
        "body": "Congrats! Sadly most of my portfolio is in tech such as MSFT, NVDA, ADBE, AMZN, &amp; others. But my DIS, WYNN,  CAT, &amp; Bank stocks like JPM, GS, BLK did well. But tech being majority, portfolio was big down for the day. I also have PFE which did well. But still overall was not good. I added some NOW, NVDA, FDX, RDFN &amp; a bit of ARKK on today’s dip.",
        "created_utc": 1604960579,
        "id": "gbrjqbx",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1604989379.0
    },
    {
        "author": "adayofjoy",
        "body": "My mom knew nothing about valuations, technicals, or reading balance sheets etc, but she invested in companies that she liked and that she thought would do well going forward (TDOC, ADBE, ADSK, AMZN), and her stock picks have vastly outperformed my picks which were often based on PE ratios, valuations and earnings performance (EA, BRK B, INTC)",
        "created_utc": 1604961565,
        "id": "gbrllqb",
        "score": 1,
        "subreddit": "investing",
        "created": 1604990365.0
    },
    {
        "author": "Galinda20018",
        "body": "Adobe flash 4 ever",
        "created_utc": 1605182153,
        "id": "gc1cex4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605210953.0
    },
    {
        "author": "missing_citation",
        "body": "PLTR software platform isn't like windows or adobe cc. They need forward deployed engineers per client to build it out in a problem specific fashion. They have some 100 clients in all these years. It's not easy to scale like other tech.",
        "created_utc": 1605312882,
        "id": "gc7gd0v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605341682.0
    },
    {
        "author": "clavitopaz",
        "body": "WTF ADBE",
        "created_utc": 1605301759,
        "id": "gc6vr2j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605330559.0
    },
    {
        "author": "Kodyak",
        "body": "adobe flash player is blocked :/\n\ndamn times have CHANGED",
        "created_utc": 1605330011,
        "id": "gc86x6t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605358811.0
    },
    {
        "author": "MarsShark",
        "body": "Problem really isn’t the chip, it’s getting the risk architecture to play nice with existing platforms ie adobe. It’s going to take a few years before a majority of apps are probably ve supported with the abilities as on windows etc.",
        "created_utc": 1605279899,
        "id": "gc5nvtt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605308699.0
    },
    {
        "author": "Okmanl",
        "body": "The bull case for unity is they become the Adobe for producing 3D interactive content. The software isn’t just for making video games. But in the future you can potentially also create VR training software. ARKK has bought shares in Unity but it’s not in their top 10 holding.",
        "created_utc": 1605418420,
        "id": "gcchdvn",
        "score": 1,
        "subreddit": "investing",
        "created": 1605447220.0
    },
    {
        "author": "cheerfulwish",
        "body": "Fuck ADBE - had an interview there last year and the worst, most disorganized experience ever. They should crash and burn.",
        "created_utc": 1605059264,
        "id": "gbw58ak",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605088064.0
    },
    {
        "author": "The_Folkhero",
        "body": "I agree, Adobe and Microsoft office can roll in a similar feature into their products and Docusign is sunk. That company is more of a feature than a standalone company, IMO.",
        "created_utc": 1605050621,
        "id": "gbvpfg3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1605079421.0
    },
    {
        "author": "dyjung130",
        "body": "Actually Ark investment had Adobe shares. I was wondering if I should buy Adobe too",
        "created_utc": 1606695992,
        "id": "ge3kmpd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606724792.0
    },
    {
        "author": "StarSlayerX",
        "body": " RemindMe! 21 days This stock has real potential to rocket to the moon. They already have partnerships with Adobe and Microsoft.",
        "created_utc": 1606703225,
        "id": "ge3xevz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606732025.0
    },
    {
        "author": "ButtSliding",
        "body": "Why do I have so much unwarranted faith in Adobe? Not sure, but 25% of my portfolio is in calls so I’m not getting off the ride",
        "created_utc": 1606765057,
        "id": "ge6g9rf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606793857.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "If NKLA goes down why isn’t ADBE down too? They’d lose their biggest Photoshop customer if they go under",
        "created_utc": 1606743496,
        "id": "ge5a7zc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606772296.0
    },
    {
        "author": "chuck_portis",
        "body": "Little competition?  It's a document signing app valued @ $42 Billion USD.  A competent team of developers could whip up a brand new competitor that likely improves on DocuSign's software in a matter of 6 months.\n\nThey already have dozens of competitors as it is, including Adobe who has a flawless and easy to use e-signing system which integrates seamlessly into PDF's, which is a document type they basically invented.",
        "created_utc": 1606723275,
        "id": "ge4pk0x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606752075.0
    },
    {
        "author": "chuck_portis",
        "body": "DocuSign is one of several players in the space.  They have plenty of competition from Adobe Sign, HelloSign, etc.  The network effect you see from platforms like Facebook (high), or even Zoom (medium), just isn't there for Docusign.  Only the sender needs to be on-boarded.  The receiver and easily sign documents without an account on the e-sign platforms.\n\nThis software is extremely basic and easy to replicate.  DocuSign is worth $42B on this product alone, which even has many free alternatives from competitors.  You might get some meme push on a rotation into stay-at-home's, but the downside on this one far outweighs the upside, in my opinion.",
        "created_utc": 1606722965,
        "id": "ge4p878",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606751765.0
    },
    {
        "author": "Newtothisredditbiz",
        "body": "AAPL had already gone up 2000% between its first iPod release in 2001 and when I bought it in 2009. \n\nMSFT went up 6000% from 1986 to 1996 thanks to the PC revolution it helped build. \n\nADBE went up 2000% in the same time period, thanks to its revolutionary desktop publishing software.\n\nThose are just a few off the top of my head.\n\n-----------\n\nI wasn't that lucky, nor particularly smart. I just invested in companies that were obviously changing how people live and work.\n\nMany investors have gotten far richer than me investing that way, and not just in tech. Nike, SBUX, Wal-Mart, Home Depot, Coca-Cola, Lululemon and the Gap are just some of the companies that have changed the world, and grew exponentially for years. \n\nIn 2006, nobody was sitting at a Starbucks in their yoga pants, texting with an iPhone. By 2016, everybody was. That didn't happen overnight, and it didn't happen without a shitload of investors seeing those companies grow, and putting their money in.",
        "created_utc": 1606614561,
        "id": "gdymnk5",
        "score": 1,
        "subreddit": "investing",
        "created": 1606643361.0
    },
    {
        "author": "10min_no_rush",
        "body": "I really don’t know why people think lockup period means stock is gonna tank.\n\nI’m a senior engineer in SV. I have friends with hundreds of thousands of equity in a single company. My friend at Adobe has been working there 6 years, and he’s yet to sell a single share unless it was used to spend money.\n\nThe people who have great amounts of stock options in these tech companies tend to be people who are good at their jobs and they tend to have higher salaries.\n\nNot saying ZI might not go down, but basing it off of lock up expire is kinda silly",
        "created_utc": 1606663775,
        "id": "ge1knrs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606692575.0
    },
    {
        "author": "Raii-v2",
        "body": "Thoughts on ADBE?",
        "created_utc": 1605979281,
        "id": "gd2w029",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606008081.0
    },
    {
        "author": "FearlessTrader",
        "body": "The fact that no one talks about other strong and proven stocks like ETSY W ADBE etc here should be proof enough that 98% of the accounts here are here for the memes and have only $50 in the game 🙄🙄🙄",
        "created_utc": 1606490361,
        "id": "gdrrcz0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606519161.0
    },
    {
        "author": "honeygetter",
        "body": "Besides the creative cloud... \n\nI work at Adobe on their enterprise marketing tech. They’ve been acquiring a ton of companies in the space. (They’re basically set on becoming a monopoly in helping companies incept and nag potential customers into buying shit. )\n\nPhotoshop/illustrator helping people create marketing materials and ads so they can then target people with algorithms with ads and emails etc etc\n\nB2B is where the money’s at these days for many tech companies (I.e. Zoom selling to companies and schools, docusign as well) \n\nTl dr; Adobe will be dominating in making marketing software shit that helps big companies market shit at scale which drives revenue. \n\nThese companies sign off on 1-2 year deals to use this software paying huge amounts \n\nThey will grow.",
        "created_utc": 1606497465,
        "id": "gds53bd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606526265.0
    },
    {
        "author": "dragoonburst1",
        "body": "Alright Adobe earnings run up about to be good af",
        "created_utc": 1606500203,
        "id": "gdsb5t7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606529003.0
    },
    {
        "author": "GyozaGeek",
        "body": "\"ADBE is synonymous with graphic manipulation and basically has a monopoly on the digital art platform.\"  \n\n\nBecause art makes reliable money. LOL",
        "created_utc": 1606503143,
        "id": "gdshcfk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606531943.0
    },
    {
        "author": "Coat_Dry",
        "body": "Who the fuck cares about technicals or MA? This market hasn't made any sense.\n\n&amp;#x200B;\n\nTech stocks with growth potential have insane P/Es because people are horny for growth. Where's the growth for Adobe? \n\n&amp;#x200B;\n\nMy bet would be this stock goes nowhere, much like your older millennial sister.",
        "created_utc": 1606515499,
        "id": "gdt3mm2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606544299.0
    },
    {
        "author": "dwaynegibbous",
        "body": "Saw an ADBE commercial yesterday that had ice cream twuck. I'm in.",
        "created_utc": 1606487243,
        "id": "gdrmhgj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606516043.0
    },
    {
        "author": "whoissuperlazy",
        "body": "I did too. F amzn google fb adbe. We got ev",
        "created_utc": 1606225358,
        "id": "gdfvsez",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606254158.0
    },
    {
        "author": "yeahman64",
        "body": "Amazon and Adobe better fucking hold this rally or else my wife’s boyfriend won’t let me sit at the dinner table tonight.",
        "created_utc": 1606315767,
        "id": "gdk2u2n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606344567.0
    },
    {
        "author": "brunette5179",
        "body": "Fucking bag holding ADBE for months on end JFC",
        "created_utc": 1606340200,
        "id": "gdlfh62",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1606369000.0
    },
    {
        "author": "maxprtr",
        "body": "lol. Adobe sign, hello sign, pandadoc, esign and another dozen. When i video conference, I use the verb \"I zoom\". When e-signing, I never hear anybody says \" I am going to docu\"",
        "created_utc": 1605797504,
        "id": "gcu062z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605826304.0
    },
    {
        "author": "ButtSliding",
        "body": "adobe calls",
        "created_utc": 1605890975,
        "id": "gcyf7z7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605919775.0
    },
    {
        "author": "Logaratyunas",
        "body": "The only big investor is Soros, who regrets buying Facebook and Google back in 2018 too.\n\nIt's financials is horrible mainly to trick the algorithm by posting super negative one-off revenue. Its revenue has been growing, and its profit has been less negative too.\n\nThe pump may be quite crazy right now but remember ebr, they are involved in the COVID tracing, and vaccine distribution, using their Tiberius platform.\n\nMicrosoft and Adobe were B2B with their software, Customizing for big customers and struggle to break even in the 1980s. Theyve since commercialise to the public consumers and look at where they are at now: Literally 200000% increase since the 1980s.\n\nPalantir is on its way, from being CIA focused, to expanding to government  military, health and geography, to expanding to commercial business clients, if they make a jump to consumer and scale from there, it would easily be a multi trillion company. This is likely priced in already nonetheless...",
        "created_utc": 1605876414,
        "id": "gcxpk2k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1605905214.0
    },
    {
        "author": "plasticblock4dayz",
        "body": "At first I regretted selling my TSLA calls today. Now not sweating it because I copped ADBE at calls at open.",
        "created_utc": 1604513483,
        "id": "gb51o0x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604542283.0
    },
    {
        "author": "jeuldy",
        "body": "Rip my Adobe 11/6 put",
        "created_utc": 1604514297,
        "id": "gb53eyx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604543097.0
    },
    {
        "author": "Lopsided_Distance_87",
        "body": "I sell music and sound effects so I know the business. Adobe will most likely be the industry leader in STOCK MEDIA in a couple years. They sell you the software and then sell you content for the software. They are cutting out the middle man. Could make them billions a year",
        "created_utc": 1604515142,
        "id": "gb558vu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604543942.0
    },
    {
        "author": "JPowellRecession2020",
        "body": "Adobe Suite autist here; It's called rotoscoping. Just take Trump talking somewhere else, cut it out, feather it, track it on Wolf of Wall Street man's face, and dub over him talking. Notice the hair, it's super feathered at the frays on top. Also how his lips dont match up whatsoever if you stare at it.\n\n&amp;#x200B;\n\nStill a fucking great edit though.",
        "created_utc": 1604791460,
        "id": "gbii886",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1604820260.0
    }
]