[
    {
        "author": "Desert_Hawg",
        "body": "I did it today boys. -75% to +16.6%. On the dumbest stock of them all. Oracle. It can be done.",
        "created_utc": 1593721576,
        "id": "fwqheyk",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1593750376.0
    },
    {
        "author": "ColdBeing",
        "body": "The Oracle says NIO is the chosen one",
        "created_utc": 1594146151,
        "id": "fx8a9go",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594174951.0
    },
    {
        "author": "mexipill",
        "body": "I’m pretty sure we crash now....\nThe oracle of Omaha called the bottom by selling airlines and now he bought again.\nThis can only mean doom.",
        "created_utc": 1594257203,
        "id": "fxdjp4g",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594286003.0
    },
    {
        "author": "Solid_Owl",
        "body": "I'd be interested in hearing legitimate arguments about this.  To me, Amazon is simply diversifying its revenue streams.  It doesn't appear have any kind of monopoly that prevents other big players from giving it a go at any of these businesses:\n\nMSFT and FB and Youtube did the Twitch competitor thing.\n\nWalmart announced Walmart Prime today.  Lots of stores do online shopping and delivery these days.  [Jet.com](https://Jet.com) was a thing.\n\nOracle, Azure, Google all have AWS competitors.\n\nNFLX, Disney+, et al for video streaming.\n\nAmazon isn't getting big via acquisitions of its competitors, either.  There's no antitrust discussion like there would be if ATT tried to buy Verizon, for example.\n\nI think AMZN is safe from any kind of antitrust lawsuit.  Frankly, I think Bezos's boys are too damn smart to make the mistake of getting in that kind of position in the first place.",
        "created_utc": 1594165947,
        "id": "fx9dzzp",
        "score": 5,
        "subreddit": "investing",
        "created": 1594194747.0
    },
    {
        "author": "Power80770M",
        "body": "Nope, you're wrong. Cisco, Intel, Oracle, and Microsoft had absolutely insane valuations back then, and they were all very profitable.",
        "created_utc": 1594071020,
        "id": "fx52y7k",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594099820.0
    },
    {
        "author": "96ZJ",
        "body": "Consulted the oracle, oracle has said today is the day! The oracle then ran off with my shoe.",
        "created_utc": 1594355089,
        "id": "fxhzfdu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594383889.0
    },
    {
        "author": "adultsoup",
        "body": "Please reply to this Oracle.",
        "created_utc": 1593658984,
        "id": "fwnng9m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593687784.0
    },
    {
        "author": "bashyourscript",
        "body": "Exactly this. I remember in 1999 Sun Microsystems was so big there was a catch phrase attached to the company \"The Sun will never set.\" Fast forward 8 years later, they get bought out by Oracle for $7B. They were close $300B at their peak in early 2000.",
        "created_utc": 1593731187,
        "id": "fwr0aij",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593759987.0
    },
    {
        "author": "Beagle001",
        "body": "My equity in ORCL calls was 00.00. Then it went north and starts heading out. Now I have -55.00. I feel weird.",
        "created_utc": 1593627578,
        "id": "fwlwxib",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593656378.0
    },
    {
        "author": "Hippoman_",
        "body": "Oracle moves sideways",
        "created_utc": 1594328460,
        "id": "fxgoq9b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594357260.0
    },
    {
        "author": "StavyCrowe",
        "body": "The fucking Oracle of WSB",
        "created_utc": 1593797181,
        "id": "fwtn3fh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593825981.0
    },
    {
        "author": "Dyunder",
        "body": "Anyone holding D calls rn? Just got a massive investment by the oracle",
        "created_utc": 1593977779,
        "id": "fx0z6l8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594006579.0
    },
    {
        "author": "aggiebrad16",
        "body": "I haven’t looked into the deal but I’m assuming it’s not all cash. I’m sure they raised debt to finance this transaction. The cost of debt to the oracle I’m assuming is fairly cheap",
        "created_utc": 1594002422,
        "id": "fx26lbg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594031222.0
    },
    {
        "author": "Cattaphract",
        "body": "Because people on the internet are fools.       \nMade some bucks and think they are the oracle of porta potti          \n         \nAlso assuming just because he made a move, he no longer thinks the bubble is not exploding and the recession is cancelled, is puttingnwords into his mouth",
        "created_utc": 1593997075,
        "id": "fx1xy0r",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594025875.0
    },
    {
        "author": "Unlucky-Prize",
        "body": "You can use the characteristics of your poop to serve as a oracle for how SPX is going to move that day. I tried it once and it worked so it must be an infallible new TA method.",
        "created_utc": 1593668388,
        "id": "fwo0yy3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593697188.0
    },
    {
        "author": "meeni131",
        "body": "Does being in the MS ecosystem also solve security needs making Okta and similar less useful? We own a lot of MSFT owing to a lot of the things you pointed out, and I'm trying to understand the range of companies that are directly being encroached on by their product suite. My thesis is that by being in the Microsoft ecosystem vs an oracle + Salesforce + slack + zoom + tableau + okta + etc you just have incredible cost savings in Microsoft or at least strong pricing pressure on several of these public companies moving forward.",
        "created_utc": 1594150974,
        "id": "fx8kk8u",
        "score": 1,
        "subreddit": "investing",
        "created": 1594179774.0
    },
    {
        "author": "fhs",
        "body": "Their typical customer base (large companies, governments) are slightly more nimble and aren't afraid to look elsewhere like MSFT, Oracle. IBM can't coast on size as it did.",
        "created_utc": 1594067441,
        "id": "fx4vmy1",
        "score": 1,
        "subreddit": "investing",
        "created": 1594096241.0
    },
    {
        "author": "idiotnoobx",
        "body": "Oh look another oracle",
        "created_utc": 1593610224,
        "id": "fwkxu9i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593639024.0
    },
    {
        "author": "nitrouz",
        "body": "One thing that they're protesting in the court case (Quantico Tactical vs Unifire vs Atlantic Diving Supply) is the corruption of the DLA and the contract officers. Atlantic Diving Supply for years has been found guilty of lying about their status. The same judge who oversaw Amazon/Microsoft/Oracle cloud computing contract with the Department of Defense is seeing this case as well.\n\nWill the judge allow 1 company get the majority of the contracts or will he encourage a more level playing field? This case is important as it will give Unifire a revenue stream for 10 years. If they lose, they still have the GSA and other means but SOE is big!\n\nhttps://www.washingtonpost.com/business/2019/08/20/former-ceo-atlantic-diving-supply-settles-fraud-allegations-million/\n\n\nCourse Case\nhttps://www.docketalarm.com/cases/Court_Of_Federal_Claims/1--20-cv-00120/QUANTICO_TACTICAL_INC._v._USA/",
        "created_utc": 1593902998,
        "id": "fwy3urg",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593931798.0
    },
    {
        "author": "noobstoch",
        "body": "Issue being I am not in front of my computer all the time at work. So I cannot be constantly monitoring and checking for lead in the chat window. That is the reason I subscribe to the news hoping to get some leads in the morning before I head to work and set a limit for auto execution of plays. I can start giving 3 am a shot if it means profits. \n\nThe Oracle is on sale for $9 for a week trial.  Planning on driving to work tomorrow night so I can start trying from Monday. If that proves out to be useful I will probably just stick to that and unsubscribe to news alerts because the oracle is a cheaper option. Right now I don't think I can afford both or even just news alerts by themselves...",
        "created_utc": 1593891375,
        "id": "fwxjx17",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593920175.0
    },
    {
        "author": "Wanderer1775",
        "body": "Imagine, Apple all but destroys Nokia more than a decade ago.  Now is moving away from their own chip and is planning a roll out of their new Mac line with their own chips. Some changes are coming.\n\nNow they're working with Nokia, who is also working with Verizon already and has sights set on Amazon, Google and Oracle. New successful CEO on the inbound with 5G looming.\n\n[https://www.nokia.com/about-us/news/releases/2020/03/02/pekka-lundmark-appointed-president-and-ceo-of-nokia-rajeev-suri-to-step-down-after-more-than-a-decade-as-president-and-ceo-of-nokia-and-nokia-siemens-networks/](https://www.nokia.com/about-us/news/releases/2020/03/02/pekka-lundmark-appointed-president-and-ceo-of-nokia-rajeev-suri-to-step-down-after-more-than-a-decade-as-president-and-ceo-of-nokia-and-nokia-siemens-networks/)",
        "created_utc": 1594312464,
        "id": "fxfqrh2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594341264.0
    },
    {
        "author": "krootz1",
        "body": "Oracle is expensive and has its uses but honestly I think most people in IT fucking hate oracle. Java sucks, Oracle is complicated special use database. Just imo, it’s niche so hard to value",
        "created_utc": 1594328743,
        "id": "fxgpay9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594357543.0
    },
    {
        "author": "K215215",
        "body": "CDNs like Fastly, Cloudflare and Atlassian all are critical business infrastructure for tech companies. ZS, CRWD, OKTA are cyber security - doesn't matter how the customers are doing, with more of their business online, they need more security. Veeva, Oracle, SAP are enterprise resource planners that's business dont fluctuate based on customer success - again critical business infrastructure.  Twilio, Band &amp; Ring all have improved business from wfh with an increased need for online communications. Also, Shopify only needs its customers opening and running storefronts",
        "created_utc": 1594341015,
        "id": "fxhcjqe",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594369815.0
    },
    {
        "author": "ThatOneDrunkUncle",
        "body": "The Oracle",
        "created_utc": 1594342274,
        "id": "fxheoas",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594371074.0
    },
    {
        "author": "DaRepo",
        "body": "I've mostly been playing companies with upcoming earnings reports. Opening ICs right before the ER is almost always profitable from the IV crush. I've played NVDA, COST, ZM, WORK, ADBE, ORCL, CCL, NKE, and BBBY and been profitable on all of them except WORK which had a crazy 20% drop. Currently have calendar spreads in NFLX, PEP, and JPM which I like to convert to ICs right before the ER. Just be careful with smaller caps that don't have a lot of liquidity, you might not be able to close the spreads easily",
        "created_utc": 1594263086,
        "id": "fxdtu9r",
        "score": 1,
        "subreddit": "options",
        "created": 1594291886.0
    },
    {
        "author": "daveinsurgent",
        "body": "I use AWS every single day and have for almost a decade. Only because it's not my money and my employer voluntarily vendor-locked.  Yes, they have lots of services, they are all kind of mediocre, hence being like GM.\n\nS3 STILL has a consistency model that sometimes means you cannot read your own writes, which bites developers, especially the new ones that AWS tries to position themselves as being great for, in the ass.\n\nDynamoDB requires so much effort to utilize for anything except trivial key-values, that they have to employ people full time to evangelize and explain to their customers why it's their fault it's not performing well and how they need to go through some pretty esoteric practices to numb the pain.\n\nSome services have no SLA.  How long might a message sit in SQS before your application can see it? Undefined.\n\nAzure's serverless play is better in every regard than AWS'.  It's not that Azure is the best, it's that GCP, Azure, even Oracle Cloud all have technology that leave everything AWS has in the dust.\n\nRDS?  Yeah, it's 2020 and you want to spin up a couple MySQL servers but you aren't an \"old school corp\".  Compare that with Cosmos DB (or Spanner, or Oracle's autonomous db)\n\nKinesis? You will pay $3000/mo for what you could get out of $30 in servers if you ran Kafka yourself.\n\nThe hype could keep AWS alive for a long time, I know, but it's not because they have the superior products. Major players end up falling back and just treating AWS like hardware rental because their services are clunky and expensive.",
        "created_utc": 1594274069,
        "id": "fxe9uo9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594302869.0
    },
    {
        "author": "myownzen",
        "body": "If the market is red monday shes the new oracle.",
        "created_utc": 1593927951,
        "id": "fwz2v1u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593956751.0
    },
    {
        "author": "RDU-D2",
        "body": "I’d recommend avoiding WFC for the reasons you state - your job is in that sector. Don’t have your income and assets there. Plus it’s a crap bank. \n\nOf the ones you mention, I’d personally go with ORCL. Good luck.",
        "created_utc": 1593830680,
        "id": "fwv8rdw",
        "score": 1,
        "subreddit": "options",
        "created": 1593859480.0
    },
    {
        "author": "Daertrider",
        "body": "The Oracle has spoken",
        "created_utc": 1594100584,
        "id": "fx6g5e2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594129384.0
    },
    {
        "author": "Strangerdanger8812",
        "body": "The Oracle of nothing",
        "created_utc": 1594132500,
        "id": "fx7idsc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594161300.0
    },
    {
        "author": "ellinger",
        "body": "I hear you. ORCL dropped too. Know your risk tolerance.",
        "created_utc": 1594136864,
        "id": "fx7qu1r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594165664.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "Odds that oracle hits $60 by 7/17?",
        "created_utc": 1594145686,
        "id": "fx899mc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594174486.0
    },
    {
        "author": "daveinsurgent",
        "body": "I would be more concerned with people eventually catching on that AWS is the General Motors of the cloud and that most of their competitors, even Oracle, have product offerings that run circles around them.  I appreciate that the technical reality has little bearing on how high the stock will go, but saying AMZN is a safe place to park your money is kind of like saying IBM is as well because \"nobody ever got fired for buying IBM\".  Like that phrase rested on it's laurels for a long ass time, and AWS' time will come too.\n\nAlmost every new feature they release is delayed, comes out with bugs, the amount of effort they actually ask their customers to put in to developing working solutions that integrate their services together in to something valuable is high.\n\nThe total cost of ownership angle, once you get past the strippers and steaks pitch to your management, is far less compelling than they would like you to believe.  In some cases Amazon will charge you what an FTE salary would be for something that could be accomplished with a pair of $15 servers and still leaves you with half the operations concerns - then tell you gee aren't you glad it's semi-managed? AWS likes to bring up the Dynamo paper as if that's not like Al Bundy's four touchdowns in one game.\n\nAzure, Oracle Cloud or Google Cloud have (Spanner, CosmosDB, and so on) offerings that beat the pants off of RDS.\n\nOn the frontier, AWS' serverless approach is woefully inadequate and only really offsets a portion of the devops overhead and only integrates 'loosely' with a lot of their services.  Okay, I've already typed way more than you care about, but my point is while I would never say short AMZN because who knows how long they'll run for, and with COVID, it will be interesting to see what impact a lack of re:Invent will have once their fans stop getting treated to outlandish parties, I'd be cautious about treating it like some safe haven. They are also notoriously high-stress, high-turnover, and I think that negatively impacts their ability to attract the talent needed to elevate their platform or keep it in league.",
        "created_utc": 1594170376,
        "id": "fx9lmi5",
        "score": 1,
        "subreddit": "investing",
        "created": 1594199176.0
    },
    {
        "author": "ric2b",
        "body": "Hopefully Oracle doesn't start growing again...",
        "created_utc": 1594312218,
        "id": "fxfq90g",
        "score": 1,
        "subreddit": "investing",
        "created": 1594341018.0
    },
    {
        "author": "RebornLotus",
        "body": "Do you possess “The Google”? If not, you must trek over the far-away mountains to the land of Milk and Honey to ask the Oracle. I can be of no more assistance. Good luck to you, hero.",
        "created_utc": 1594322925,
        "id": "fxgd580",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594351725.0
    },
    {
        "author": "junkrattrap",
        "body": "Spent 2 years developing new data center software and hardware allowing cloud companies to quickly scale up for 5G and unanticipated demand like we saw in covid. Landed Apple, BT, and Equinix as early adopters and aggressively targeting oracle, google, and amazon.",
        "created_utc": 1594313296,
        "id": "fxfsibt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594342096.0
    },
    {
        "author": "noobstoch",
        "body": "I just subscribed to it last night. I am trying to figure out the best way to use it for investing while having a full time job.  Is it good? Also have you tried the oracle directional alerts? Thanks in Advance..",
        "created_utc": 1593837837,
        "id": "fwvistl",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593866637.0
    },
    {
        "author": "Mountain-Dig",
        "body": "Medalia, Oracle, IBM, and HP are a basket of underperforming so-called \"tech\" stocks. In reality, they all focus on slow growing or shrinking older business models.",
        "created_utc": 1594065946,
        "id": "fx4slc8",
        "score": 1,
        "subreddit": "investing",
        "created": 1594094746.0
    },
    {
        "author": "IGetHypedEasily",
        "body": "Oh man can't stand how Oracle still gets business clients.",
        "created_utc": 1594088113,
        "id": "fx5xsrb",
        "score": 1,
        "subreddit": "investing",
        "created": 1594116913.0
    },
    {
        "author": "wirsteve",
        "body": "You aren't thinking big enough.\n\nNot only are they the market leader with over 50% of the market share for Cloud-based Point of Sale systems, but they are also top 5 in the normal POS category, by gross payment volume share. Taking share away from the big names like Oracle and NCR.\n\nFinally, they were listed in Gartner's magic quadrant for Retail Technology, right below Shopify. We know how Shopify is doing.",
        "created_utc": 1594061329,
        "id": "fx4j485",
        "score": 1,
        "subreddit": "investing",
        "created": 1594090129.0
    },
    {
        "author": "Huckleberry_Ginn",
        "body": "True. Which also means cloud companies (google, MSFT, Amazon, Oracle) will likely thrive in the future. I’m considering shifting to covered calls when I believe the market bottoms in mid-late July.",
        "created_utc": 1594153885,
        "id": "fx8qkhx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594182685.0
    },
    {
        "author": "lingua_ignota",
        "body": "Oracle is also a raging fucking dumpster fire",
        "created_utc": 1594102177,
        "id": "fx6i1v8",
        "score": 1,
        "subreddit": "investing",
        "created": 1594130977.0
    },
    {
        "author": "DeepNortherner",
        "body": "You’re wrong about Amazon.com being the most profitable...Amazon would be in the fuckin red if it weren’t for AWS. Amazon puts everything it has into building out its e-commerce business and relies on its cloud subsidiary to remain profitable.\n\nAlso, AWS is sooo not the go-to for startups. Sure, a startup SaaS vendor that wants to sell on AWS Marketplace will go to AWS, but AWS’ customer base is far-and-away large enterprises. Especially the massive ones that migrate their legacy SAP, Oracle and VMware workloads to AWS’ IaaS.\n\nAll that said, Amazon is still a buy...but it’s because of AWS’ bottom line - in my opinion.",
        "created_utc": 1594175505,
        "id": "fx9u8ov",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594204305.0
    },
    {
        "author": "GBAgency",
        "body": "Or maybe a new Oracle is born... 😌",
        "created_utc": 1593662762,
        "id": "fwntax0",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593691562.0
    },
    {
        "author": "threebboyz",
        "body": "Orcl",
        "created_utc": 1593665062,
        "id": "fwnwlzg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593693862.0
    },
    {
        "author": "moblo231",
        "body": "30 Vix is gonna seem high tomorrow. Oracle has spoken",
        "created_utc": 1593663194,
        "id": "fwntxt5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593691994.0
    },
    {
        "author": "Dr_Xenophobia",
        "body": "Check out the next Warren Buffet over here!!!! Oracle of OMG",
        "created_utc": 1593702020,
        "id": "fwpbebb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593730820.0
    },
    {
        "author": "escootme",
        "body": "Nutanix's most direct competitor is VMware. And neither VMware nor Nutanix would say they are fighting for the same pie as Azure/AWS/Oracle Cloud/Google Cloud.\n\nI think Nutanix's special sauce boils down to basically cheaper licensing and managing different vendor clusters (e.g., you can manage VMware clusters under Nutanix).",
        "created_utc": 1594047692,
        "id": "fx3rvwd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594076492.0
    },
    {
        "author": "soAsian",
        "body": "&gt;  IT spending will be focused on supporting the new work from home workforce. I believe you may see a dip in new software spend, and Oracle would be slightly affected.\n\ndip in new software...but if you are already a Oracle shop. aren't you forced to upgrade or keep the support contracts? shouldn't Oracle sales goes up?",
        "created_utc": 1594328937,
        "id": "fxgpp0r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594357737.0
    },
    {
        "author": "derprondo",
        "body": "Yes annual support contracts will continue to be paid, this is status quo.  New sales and new customer acquisition I would guess will see a decline.  I personally would not mess with ORCL at all, it's just going to track NDX/QQQ anyway.",
        "created_utc": 1594329219,
        "id": "fxgq9si",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594358019.0
    },
    {
        "author": "soAsian",
        "body": "1. How much does Oracle database cost?\n2. How many boomers companies use Oracle?\n3. Oracle : calls or puts?\n4. Oracle tendies?",
        "created_utc": 1594328300,
        "id": "fxgoeah",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594357100.0
    },
    {
        "author": "Desert_Hawg",
        "body": "I did it today boys. -75% to +16.6%. On the dumbest stock of them all. Oracle. It can be done.",
        "created_utc": 1593721576,
        "id": "fwqheyk",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1593750376.0
    },
    {
        "author": "ColdBeing",
        "body": "The Oracle says NIO is the chosen one",
        "created_utc": 1594146151,
        "id": "fx8a9go",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594174951.0
    },
    {
        "author": "mexipill",
        "body": "I’m pretty sure we crash now....\nThe oracle of Omaha called the bottom by selling airlines and now he bought again.\nThis can only mean doom.",
        "created_utc": 1594257203,
        "id": "fxdjp4g",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1594286003.0
    },
    {
        "author": "Solid_Owl",
        "body": "I'd be interested in hearing legitimate arguments about this.  To me, Amazon is simply diversifying its revenue streams.  It doesn't appear have any kind of monopoly that prevents other big players from giving it a go at any of these businesses:\n\nMSFT and FB and Youtube did the Twitch competitor thing.\n\nWalmart announced Walmart Prime today.  Lots of stores do online shopping and delivery these days.  [Jet.com](https://Jet.com) was a thing.\n\nOracle, Azure, Google all have AWS competitors.\n\nNFLX, Disney+, et al for video streaming.\n\nAmazon isn't getting big via acquisitions of its competitors, either.  There's no antitrust discussion like there would be if ATT tried to buy Verizon, for example.\n\nI think AMZN is safe from any kind of antitrust lawsuit.  Frankly, I think Bezos's boys are too damn smart to make the mistake of getting in that kind of position in the first place.",
        "created_utc": 1594165947,
        "id": "fx9dzzp",
        "score": 5,
        "subreddit": "investing",
        "created": 1594194747.0
    },
    {
        "author": "Power80770M",
        "body": "Nope, you're wrong. Cisco, Intel, Oracle, and Microsoft had absolutely insane valuations back then, and they were all very profitable.",
        "created_utc": 1594071020,
        "id": "fx52y7k",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1594099820.0
    },
    {
        "author": "adultsoup",
        "body": "Please reply to this Oracle.",
        "created_utc": 1593658984,
        "id": "fwnng9m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593687784.0
    },
    {
        "author": "bashyourscript",
        "body": "Exactly this. I remember in 1999 Sun Microsystems was so big there was a catch phrase attached to the company \"The Sun will never set.\" Fast forward 8 years later, they get bought out by Oracle for $7B. They were close $300B at their peak in early 2000.",
        "created_utc": 1593731187,
        "id": "fwr0aij",
        "score": 2,
        "subreddit": "stocks",
        "created": 1593759987.0
    },
    {
        "author": "Beagle001",
        "body": "My equity in ORCL calls was 00.00. Then it went north and starts heading out. Now I have -55.00. I feel weird.",
        "created_utc": 1593627578,
        "id": "fwlwxib",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1593656378.0
    },
    {
        "author": "Hippoman_",
        "body": "Oracle moves sideways",
        "created_utc": 1594328460,
        "id": "fxgoq9b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1594357260.0
    },
    {
        "author": "StavyCrowe",
        "body": "The fucking Oracle of WSB",
        "created_utc": 1593797181,
        "id": "fwtn3fh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593825981.0
    },
    {
        "author": "Dyunder",
        "body": "Anyone holding D calls rn? Just got a massive investment by the oracle",
        "created_utc": 1593977779,
        "id": "fx0z6l8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594006579.0
    },
    {
        "author": "aggiebrad16",
        "body": "I haven’t looked into the deal but I’m assuming it’s not all cash. I’m sure they raised debt to finance this transaction. The cost of debt to the oracle I’m assuming is fairly cheap",
        "created_utc": 1594002422,
        "id": "fx26lbg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594031222.0
    },
    {
        "author": "Cattaphract",
        "body": "Because people on the internet are fools.       \nMade some bucks and think they are the oracle of porta potti          \n         \nAlso assuming just because he made a move, he no longer thinks the bubble is not exploding and the recession is cancelled, is puttingnwords into his mouth",
        "created_utc": 1593997075,
        "id": "fx1xy0r",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594025875.0
    },
    {
        "author": "Unlucky-Prize",
        "body": "You can use the characteristics of your poop to serve as a oracle for how SPX is going to move that day. I tried it once and it worked so it must be an infallible new TA method.",
        "created_utc": 1593668388,
        "id": "fwo0yy3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593697188.0
    },
    {
        "author": "meeni131",
        "body": "Does being in the MS ecosystem also solve security needs making Okta and similar less useful? We own a lot of MSFT owing to a lot of the things you pointed out, and I'm trying to understand the range of companies that are directly being encroached on by their product suite. My thesis is that by being in the Microsoft ecosystem vs an oracle + Salesforce + slack + zoom + tableau + okta + etc you just have incredible cost savings in Microsoft or at least strong pricing pressure on several of these public companies moving forward.",
        "created_utc": 1594150974,
        "id": "fx8kk8u",
        "score": 1,
        "subreddit": "investing",
        "created": 1594179774.0
    },
    {
        "author": "fhs",
        "body": "Their typical customer base (large companies, governments) are slightly more nimble and aren't afraid to look elsewhere like MSFT, Oracle. IBM can't coast on size as it did.",
        "created_utc": 1594067441,
        "id": "fx4vmy1",
        "score": 1,
        "subreddit": "investing",
        "created": 1594096241.0
    },
    {
        "author": "idiotnoobx",
        "body": "Oh look another oracle",
        "created_utc": 1593610224,
        "id": "fwkxu9i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593639024.0
    },
    {
        "author": "nitrouz",
        "body": "One thing that they're protesting in the court case (Quantico Tactical vs Unifire vs Atlantic Diving Supply) is the corruption of the DLA and the contract officers. Atlantic Diving Supply for years has been found guilty of lying about their status. The same judge who oversaw Amazon/Microsoft/Oracle cloud computing contract with the Department of Defense is seeing this case as well.\n\nWill the judge allow 1 company get the majority of the contracts or will he encourage a more level playing field? This case is important as it will give Unifire a revenue stream for 10 years. If they lose, they still have the GSA and other means but SOE is big!\n\nhttps://www.washingtonpost.com/business/2019/08/20/former-ceo-atlantic-diving-supply-settles-fraud-allegations-million/\n\n\nCourse Case\nhttps://www.docketalarm.com/cases/Court_Of_Federal_Claims/1--20-cv-00120/QUANTICO_TACTICAL_INC._v._USA/",
        "created_utc": 1593902998,
        "id": "fwy3urg",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593931798.0
    },
    {
        "author": "noobstoch",
        "body": "Issue being I am not in front of my computer all the time at work. So I cannot be constantly monitoring and checking for lead in the chat window. That is the reason I subscribe to the news hoping to get some leads in the morning before I head to work and set a limit for auto execution of plays. I can start giving 3 am a shot if it means profits. \n\nThe Oracle is on sale for $9 for a week trial.  Planning on driving to work tomorrow night so I can start trying from Monday. If that proves out to be useful I will probably just stick to that and unsubscribe to news alerts because the oracle is a cheaper option. Right now I don't think I can afford both or even just news alerts by themselves...",
        "created_utc": 1593891375,
        "id": "fwxjx17",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593920175.0
    },
    {
        "author": "Wanderer1775",
        "body": "Imagine, Apple all but destroys Nokia more than a decade ago.  Now is moving away from their own chip and is planning a roll out of their new Mac line with their own chips. Some changes are coming.\n\nNow they're working with Nokia, who is also working with Verizon already and has sights set on Amazon, Google and Oracle. New successful CEO on the inbound with 5G looming.\n\n[https://www.nokia.com/about-us/news/releases/2020/03/02/pekka-lundmark-appointed-president-and-ceo-of-nokia-rajeev-suri-to-step-down-after-more-than-a-decade-as-president-and-ceo-of-nokia-and-nokia-siemens-networks/](https://www.nokia.com/about-us/news/releases/2020/03/02/pekka-lundmark-appointed-president-and-ceo-of-nokia-rajeev-suri-to-step-down-after-more-than-a-decade-as-president-and-ceo-of-nokia-and-nokia-siemens-networks/)",
        "created_utc": 1594312464,
        "id": "fxfqrh2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594341264.0
    },
    {
        "author": "krootz1",
        "body": "Oracle is expensive and has its uses but honestly I think most people in IT fucking hate oracle. Java sucks, Oracle is complicated special use database. Just imo, it’s niche so hard to value",
        "created_utc": 1594328743,
        "id": "fxgpay9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594357543.0
    },
    {
        "author": "DaRepo",
        "body": "I've mostly been playing companies with upcoming earnings reports. Opening ICs right before the ER is almost always profitable from the IV crush. I've played NVDA, COST, ZM, WORK, ADBE, ORCL, CCL, NKE, and BBBY and been profitable on all of them except WORK which had a crazy 20% drop. Currently have calendar spreads in NFLX, PEP, and JPM which I like to convert to ICs right before the ER. Just be careful with smaller caps that don't have a lot of liquidity, you might not be able to close the spreads easily",
        "created_utc": 1594263086,
        "id": "fxdtu9r",
        "score": 1,
        "subreddit": "options",
        "created": 1594291886.0
    },
    {
        "author": "daveinsurgent",
        "body": "I use AWS every single day and have for almost a decade. Only because it's not my money and my employer voluntarily vendor-locked.  Yes, they have lots of services, they are all kind of mediocre, hence being like GM.\n\nS3 STILL has a consistency model that sometimes means you cannot read your own writes, which bites developers, especially the new ones that AWS tries to position themselves as being great for, in the ass.\n\nDynamoDB requires so much effort to utilize for anything except trivial key-values, that they have to employ people full time to evangelize and explain to their customers why it's their fault it's not performing well and how they need to go through some pretty esoteric practices to numb the pain.\n\nSome services have no SLA.  How long might a message sit in SQS before your application can see it? Undefined.\n\nAzure's serverless play is better in every regard than AWS'.  It's not that Azure is the best, it's that GCP, Azure, even Oracle Cloud all have technology that leave everything AWS has in the dust.\n\nRDS?  Yeah, it's 2020 and you want to spin up a couple MySQL servers but you aren't an \"old school corp\".  Compare that with Cosmos DB (or Spanner, or Oracle's autonomous db)\n\nKinesis? You will pay $3000/mo for what you could get out of $30 in servers if you ran Kafka yourself.\n\nThe hype could keep AWS alive for a long time, I know, but it's not because they have the superior products. Major players end up falling back and just treating AWS like hardware rental because their services are clunky and expensive.",
        "created_utc": 1594274069,
        "id": "fxe9uo9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594302869.0
    },
    {
        "author": "myownzen",
        "body": "If the market is red monday shes the new oracle.",
        "created_utc": 1593927951,
        "id": "fwz2v1u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593956751.0
    },
    {
        "author": "RDU-D2",
        "body": "I’d recommend avoiding WFC for the reasons you state - your job is in that sector. Don’t have your income and assets there. Plus it’s a crap bank. \n\nOf the ones you mention, I’d personally go with ORCL. Good luck.",
        "created_utc": 1593830680,
        "id": "fwv8rdw",
        "score": 1,
        "subreddit": "options",
        "created": 1593859480.0
    },
    {
        "author": "Daertrider",
        "body": "The Oracle has spoken",
        "created_utc": 1594100584,
        "id": "fx6g5e2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594129384.0
    },
    {
        "author": "Strangerdanger8812",
        "body": "The Oracle of nothing",
        "created_utc": 1594132500,
        "id": "fx7idsc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594161300.0
    },
    {
        "author": "ellinger",
        "body": "I hear you. ORCL dropped too. Know your risk tolerance.",
        "created_utc": 1594136864,
        "id": "fx7qu1r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594165664.0
    },
    {
        "author": "Red_Sea_Pedestrian",
        "body": "Odds that oracle hits $60 by 7/17?",
        "created_utc": 1594145686,
        "id": "fx899mc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594174486.0
    },
    {
        "author": "daveinsurgent",
        "body": "I would be more concerned with people eventually catching on that AWS is the General Motors of the cloud and that most of their competitors, even Oracle, have product offerings that run circles around them.  I appreciate that the technical reality has little bearing on how high the stock will go, but saying AMZN is a safe place to park your money is kind of like saying IBM is as well because \"nobody ever got fired for buying IBM\".  Like that phrase rested on it's laurels for a long ass time, and AWS' time will come too.\n\nAlmost every new feature they release is delayed, comes out with bugs, the amount of effort they actually ask their customers to put in to developing working solutions that integrate their services together in to something valuable is high.\n\nThe total cost of ownership angle, once you get past the strippers and steaks pitch to your management, is far less compelling than they would like you to believe.  In some cases Amazon will charge you what an FTE salary would be for something that could be accomplished with a pair of $15 servers and still leaves you with half the operations concerns - then tell you gee aren't you glad it's semi-managed? AWS likes to bring up the Dynamo paper as if that's not like Al Bundy's four touchdowns in one game.\n\nAzure, Oracle Cloud or Google Cloud have (Spanner, CosmosDB, and so on) offerings that beat the pants off of RDS.\n\nOn the frontier, AWS' serverless approach is woefully inadequate and only really offsets a portion of the devops overhead and only integrates 'loosely' with a lot of their services.  Okay, I've already typed way more than you care about, but my point is while I would never say short AMZN because who knows how long they'll run for, and with COVID, it will be interesting to see what impact a lack of re:Invent will have once their fans stop getting treated to outlandish parties, I'd be cautious about treating it like some safe haven. They are also notoriously high-stress, high-turnover, and I think that negatively impacts their ability to attract the talent needed to elevate their platform or keep it in league.",
        "created_utc": 1594170376,
        "id": "fx9lmi5",
        "score": 1,
        "subreddit": "investing",
        "created": 1594199176.0
    },
    {
        "author": "ric2b",
        "body": "Hopefully Oracle doesn't start growing again...",
        "created_utc": 1594312218,
        "id": "fxfq90g",
        "score": 1,
        "subreddit": "investing",
        "created": 1594341018.0
    },
    {
        "author": "RebornLotus",
        "body": "Do you possess “The Google”? If not, you must trek over the far-away mountains to the land of Milk and Honey to ask the Oracle. I can be of no more assistance. Good luck to you, hero.",
        "created_utc": 1594322925,
        "id": "fxgd580",
        "score": 1,
        "subreddit": "stocks",
        "created": 1594351725.0
    },
    {
        "author": "junkrattrap",
        "body": "Spent 2 years developing new data center software and hardware allowing cloud companies to quickly scale up for 5G and unanticipated demand like we saw in covid. Landed Apple, BT, and Equinix as early adopters and aggressively targeting oracle, google, and amazon.",
        "created_utc": 1594313296,
        "id": "fxfsibt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594342096.0
    },
    {
        "author": "noobstoch",
        "body": "I just subscribed to it last night. I am trying to figure out the best way to use it for investing while having a full time job.  Is it good? Also have you tried the oracle directional alerts? Thanks in Advance..",
        "created_utc": 1593837837,
        "id": "fwvistl",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1593866637.0
    },
    {
        "author": "Mountain-Dig",
        "body": "Medalia, Oracle, IBM, and HP are a basket of underperforming so-called \"tech\" stocks. In reality, they all focus on slow growing or shrinking older business models.",
        "created_utc": 1594065946,
        "id": "fx4slc8",
        "score": 1,
        "subreddit": "investing",
        "created": 1594094746.0
    },
    {
        "author": "IGetHypedEasily",
        "body": "Oh man can't stand how Oracle still gets business clients.",
        "created_utc": 1594088113,
        "id": "fx5xsrb",
        "score": 1,
        "subreddit": "investing",
        "created": 1594116913.0
    },
    {
        "author": "wirsteve",
        "body": "You aren't thinking big enough.\n\nNot only are they the market leader with over 50% of the market share for Cloud-based Point of Sale systems, but they are also top 5 in the normal POS category, by gross payment volume share. Taking share away from the big names like Oracle and NCR.\n\nFinally, they were listed in Gartner's magic quadrant for Retail Technology, right below Shopify. We know how Shopify is doing.",
        "created_utc": 1594061329,
        "id": "fx4j485",
        "score": 1,
        "subreddit": "investing",
        "created": 1594090129.0
    },
    {
        "author": "Huckleberry_Ginn",
        "body": "True. Which also means cloud companies (google, MSFT, Amazon, Oracle) will likely thrive in the future. I’m considering shifting to covered calls when I believe the market bottoms in mid-late July.",
        "created_utc": 1594153885,
        "id": "fx8qkhx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594182685.0
    },
    {
        "author": "lingua_ignota",
        "body": "Oracle is also a raging fucking dumpster fire",
        "created_utc": 1594102177,
        "id": "fx6i1v8",
        "score": 1,
        "subreddit": "investing",
        "created": 1594130977.0
    },
    {
        "author": "DeepNortherner",
        "body": "You’re wrong about Amazon.com being the most profitable...Amazon would be in the fuckin red if it weren’t for AWS. Amazon puts everything it has into building out its e-commerce business and relies on its cloud subsidiary to remain profitable.\n\nAlso, AWS is sooo not the go-to for startups. Sure, a startup SaaS vendor that wants to sell on AWS Marketplace will go to AWS, but AWS’ customer base is far-and-away large enterprises. Especially the massive ones that migrate their legacy SAP, Oracle and VMware workloads to AWS’ IaaS.\n\nAll that said, Amazon is still a buy...but it’s because of AWS’ bottom line - in my opinion.",
        "created_utc": 1594175505,
        "id": "fx9u8ov",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594204305.0
    },
    {
        "author": "GBAgency",
        "body": "Or maybe a new Oracle is born... 😌",
        "created_utc": 1593662762,
        "id": "fwntax0",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1593691562.0
    },
    {
        "author": "threebboyz",
        "body": "Orcl",
        "created_utc": 1593665062,
        "id": "fwnwlzg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593693862.0
    },
    {
        "author": "moblo231",
        "body": "30 Vix is gonna seem high tomorrow. Oracle has spoken",
        "created_utc": 1593663194,
        "id": "fwntxt5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593691994.0
    },
    {
        "author": "Dr_Xenophobia",
        "body": "Check out the next Warren Buffet over here!!!! Oracle of OMG",
        "created_utc": 1593702020,
        "id": "fwpbebb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1593730820.0
    },
    {
        "author": "escootme",
        "body": "Nutanix's most direct competitor is VMware. And neither VMware nor Nutanix would say they are fighting for the same pie as Azure/AWS/Oracle Cloud/Google Cloud.\n\nI think Nutanix's special sauce boils down to basically cheaper licensing and managing different vendor clusters (e.g., you can manage VMware clusters under Nutanix).",
        "created_utc": 1594047692,
        "id": "fx3rvwd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594076492.0
    },
    {
        "author": "soAsian",
        "body": "&gt;  IT spending will be focused on supporting the new work from home workforce. I believe you may see a dip in new software spend, and Oracle would be slightly affected.\n\ndip in new software...but if you are already a Oracle shop. aren't you forced to upgrade or keep the support contracts? shouldn't Oracle sales goes up?",
        "created_utc": 1594328937,
        "id": "fxgpp0r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594357737.0
    },
    {
        "author": "derprondo",
        "body": "Yes annual support contracts will continue to be paid, this is status quo.  New sales and new customer acquisition I would guess will see a decline.  I personally would not mess with ORCL at all, it's just going to track NDX/QQQ anyway.",
        "created_utc": 1594329219,
        "id": "fxgq9si",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1594358019.0
    },
    {
        "author": "soAsian",
        "body": "1. How much does Oracle database cost?\n2. How many boomers companies use Oracle?\n3. Oracle : calls or puts?\n4. Oracle tendies?",
        "created_utc": 1594328300,
        "id": "fxgoeah",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1594357100.0
    }
]