[
    {
        "author": "dreammanalishi",
        "body": "I usually wait til the morning to decide, but Friday morning's list was...\n\nAYX\n\nBAH\n\nBLK\n\nBLL\n\nCAT\n\nCERN\n\nCL\n\nCMCSA\n\nCNSL\n\nCPB\n\nCSCO\n\nCTVA\n\nCVNA\n\nCZR\n\nDB\n\nDE\n\nDIS\n\nELF\n\nERIC\n\nGGG\n\nHD\n\nHLF\n\nHMC\n\nHUBB\n\nIEC\n\nINTC\n\nJNPR\n\nKDP\n\nKWR\n\nLANC\n\nLMT\n\nLOW\n\nLRCX\n\nMA\n\nMJCO\n\nMMM\n\nMORN\n\nMS\n\nMU\n\nMWA\n\nOOMA\n\nPAYC\n\nPCAR\n\nPCTY\n\nPSTG\n\nQCOM\n\nRACE\n\nSMTC\n\nSNE\n\nSPY\n\nSSSS\n\nSTN\n\nTCX\n\nTQQQ\n\nTSLA\n\nUBS\n\nULTA\n\nV\n\nVMW\n\nWCN\n\nWDAY\n\nWGO\n\nWIRE\n\nZEN\n\nZNGA\n\nI'm sure some will carry over to Monday.\n\nI move fast in the morning, but if I have time, maybe I'll try to remember to post before the market opens.",
        "created_utc": 1591462839,
        "id": "ft5c6bv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591491639.0
    },
    {
        "author": "nooobbbbtrader134",
        "body": "JNPR",
        "created_utc": 1592374973,
        "id": "fv3jahf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1592403773.0
    },
    {
        "author": "Admirable_Nothing",
        "body": "I was there.  3 hour commute each way over only 40 miles.  Everybody working.  Exodus, Adaptive Broadband, Cisco, Juniper, WebVan, Pets.com, Napster, Netscape, Palm, Sun Micro, Global Crossing and many others.\n\nBy 2002 that was an hour commute.  Luckily I still had a job.",
        "created_utc": 1592858754,
        "id": "fvoankn",
        "score": 3,
        "subreddit": "stocks",
        "created": 1592887554.0
    },
    {
        "author": "virtu333",
        "body": "My APT calls finally mooned today, rolled to July 20c\n\nPositions:\n\n7/17 APT 20c\n\n6/26 calls on BA/JNPR/SPY/JPM, small VXX position\n\n7/2 puts on LULU, SPOT\n\n8/21 puts on GOOG, IWM, AAL, BA\n\nWe probably keep going up a bit and I'll add to my put positions with gains from my calls",
        "created_utc": 1592512324,
        "id": "fv9nsmd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1592541124.0
    },
    {
        "author": "Tsuraraa",
        "body": "There has been some extreme volume in 7/10 JNPC 25.5C over the past day or two that I believe is related to this. JNPR also ate shit today so could be good to get in to.",
        "created_utc": 1592423051,
        "id": "fv5mpk3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592451851.0
    },
    {
        "author": "overunderr",
        "body": "Depends if you like juniper",
        "created_utc": 1592498699,
        "id": "fv8xfrx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592527499.0
    },
    {
        "author": "catsaysmrau",
        "body": "Breaker breaker, come in earth. This is rocket ship 27. Aliens fucked over the carbonater in engine #4. I'm gonna try to refuckulate it and land on Juniper. Hopefully they got some space weed. Over.",
        "created_utc": 1591637939,
        "id": "fte11ul",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1591666739.0
    },
    {
        "author": "Leave_Aye",
        "body": "I'm still new to SPACs, but I'm currently holding ACTTW, NOVSW, and FMCIU. Not sure how I feel about the FMCI units though, what do you guys think? I need to look more into Juniper and New Providence. I guess it doesn't count since it's already merged but I've still got NKLAW I got in at $13 lol",
        "created_utc": 1592528464,
        "id": "fvahozu",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1592557264.0
    },
    {
        "author": "sir-draknor",
        "body": "If Juniper has such a tremendous number of calls, doesn't that mean someone must be quite bullish on it? Is your suggestion for a bear spredit just to be contrarian?",
        "created_utc": 1592870979,
        "id": "fvoxhoj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592899779.0
    },
    {
        "author": "Roach_Coach_Bangbus",
        "body": "I can go either way, I like juniper but don't mind a good gin without it.",
        "created_utc": 1592498749,
        "id": "fv8xjl6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592527549.0
    },
    {
        "author": "patmccock86",
        "body": "Don't listen to CNBC. You might buy Juniper calls that are down 35%",
        "created_utc": 1592405070,
        "id": "fv4kroi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592433870.0
    },
    {
        "author": "studiox_swe",
        "body": "Yea so have Cisco HPE extreme juniper arista - my point is that if someone believes that radios is everything they haven’t even looked at the revenue",
        "created_utc": 1593121753,
        "id": "fvzz5v9",
        "score": 1,
        "subreddit": "investing",
        "created": 1593150553.0
    },
    {
        "author": "patmccock86",
        "body": "Someone shilled Juniper July calls on CNBC and it's now down 80% lmao, probably sold those calls to viewers",
        "created_utc": 1592835932,
        "id": "fvn1ahd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592864732.0
    },
    {
        "author": "alpha_beta_pruning",
        "body": "Semis can be risky/volatile since they're affected by trade policy and the market performance of other sectors, but that also makes them a great long term investment. TSM has some of the best fabs in the world. You might also check \nMCHP, AMAT, or NXPI. Or check out LRCX since they build the hardware that then builds your hardware. :)",
        "created_utc": 1591820178,
        "id": "ftmczyk",
        "score": 5,
        "subreddit": "investing",
        "created": 1591848978.0
    },
    {
        "author": "dreammanalishi",
        "body": "I usually wait til the morning to decide, but Friday morning's list was...\n\nAYX\n\nBAH\n\nBLK\n\nBLL\n\nCAT\n\nCERN\n\nCL\n\nCMCSA\n\nCNSL\n\nCPB\n\nCSCO\n\nCTVA\n\nCVNA\n\nCZR\n\nDB\n\nDE\n\nDIS\n\nELF\n\nERIC\n\nGGG\n\nHD\n\nHLF\n\nHMC\n\nHUBB\n\nIEC\n\nINTC\n\nJNPR\n\nKDP\n\nKWR\n\nLANC\n\nLMT\n\nLOW\n\nLRCX\n\nMA\n\nMJCO\n\nMMM\n\nMORN\n\nMS\n\nMU\n\nMWA\n\nOOMA\n\nPAYC\n\nPCAR\n\nPCTY\n\nPSTG\n\nQCOM\n\nRACE\n\nSMTC\n\nSNE\n\nSPY\n\nSSSS\n\nSTN\n\nTCX\n\nTQQQ\n\nTSLA\n\nUBS\n\nULTA\n\nV\n\nVMW\n\nWCN\n\nWDAY\n\nWGO\n\nWIRE\n\nZEN\n\nZNGA\n\nI'm sure some will carry over to Monday.\n\nI move fast in the morning, but if I have time, maybe I'll try to remember to post before the market opens.",
        "created_utc": 1591462839,
        "id": "ft5c6bv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1591491639.0
    },
    {
        "author": "obzzervant",
        "body": "That's why I finally bought AAPL, AMZN, as well as keeping buying TSLA, and more LRCX.",
        "created_utc": 1591822698,
        "id": "ftmi9q6",
        "score": 3,
        "subreddit": "stocks",
        "created": 1591851498.0
    },
    {
        "author": "Jwceltic5",
        "body": "I've been holding LRCX for a long time so hopefully I can give you some perspective. As the other reply stated, capex has actually been increasing. \n\nSales has increased because the semiconductor equipment industry is extremely cyclical, where companies overspend on manufacturing equipment trying to meet demand every couple of years. LRCX has increased revenue by pivoting/focusing on DRAM and NAND, as well as expanding their services (repairs, maintenance, etc.) business that provides consistent cash flow. I believe that segment is now \\~30% of revenue.",
        "created_utc": 1592537535,
        "id": "fvawfph",
        "score": 1,
        "subreddit": "investing",
        "created": 1592566335.0
    },
    {
        "author": "Jwceltic5",
        "body": "Some ideas for chipmakers - TSM, LRCX, KLAC",
        "created_utc": 1591204158,
        "id": "fsrkhl2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591232958.0
    },
    {
        "author": "mechtech",
        "body": "&gt; I shorted the market when Apple initially reported supply chain problems back in early February and turned 15k into 130k\n\nHah, I did exactly the same thing. Turned 5k into 100k in an old brokerage account through Apple puts at the start of the crash. Once South Korea and Samsung facilities got hit with COVID I figured there would be (warranted) doomsday predictions about tech supply chains that would hit AAPL.\n\nI did end up catching the bottom though in another account. SABR @ 3, CPRI @ 6, LEAPS on VTR @ 15. Those were the core buys when the market was at peak liquidation. That account was managed into a more balanced COVID-recovery portfolio. Still very heavy on SABR and CPRI.\n\nHere are some of the current holdings: https://i.imgur.com/IAiV8gp.png. It's admittedly an absolute mess because it's all locked in a brokerage account that none of this should have taken place in. The market was literally down 10% and my main trading account was in a hilariously bad margin call while I was on the phone with someone asking \"is the world ending\", so the set of buys at market bottom were extremely haphazard and chaotic. Meanwhile, tech is my wheelhouse yet I happened to be about to pull the trigger on luxury clothing (which I know *absolutely* nothing about) because it's apparently trading at half of its bankruptcy value and buys needed to happen within a window of the next few minutes as the -10% market was turning. Just an absurd day. Things may have literally been on fire as far as my memory serves. Soon it will be in an IB portfolio margin account with proper management tools though.\n\nSo the path has been: Set of random equities and options from the SPY 2200 market bottom -&gt; Scaling out of those positions and buying Quality/Tech (asml, lrcx, nok, sbux, oled , chl were the buys in the weeks after the bottom) -&gt; Value COVID recovery/\"return to normalcy\" stocks (brk, bx, banks, txrh, cxw, vwagy, dfs, banks). There's also been some side ventures in there like buying CLMT and XOM during the negative oil event, and those won't be held long term.\n\nLots of options not showing there as well. Collars on positions, covered calls, 200k short nasdaq hedge. Basically locking in the profits and marching towards neutral until the positions can move over to the PM margin account and it can turn into something actually sane.\n\nA lot of that stuff is probably going to be gone by next friday and sold into the rotation. dfs up 10% today, sabr up 12%, txrh up 8%, Well +7%, VTR +10%, CXW +6%... Today was the exact day that that list of stocks was positioned for. There was a 4 sigma move into value a few weeks ago that I took to be a canary in the coal mine for the rotation. Looked like a quake from quant funds moving factors around. Not sure what's next. It's probably time to focus on the insane quarterly reports we're about to get, and start actually paying attention to the real economy and things like the +600 unemployment checks rolling off and the unemployment trajectory. Maybe just step out of the way until that all picks trends.\n\nThere are still many laggards to pick out but they by and large have debt loads that carry a very real bankruptcy risk, and some extreme exposure to COVID and lockdowns (restaurants, entertainment, companies like SABR that provide the back-end for flight booking). So they come with a bundle of esoteric and disastrous tail risks, but honestly, some of the common risk exposures like consumer credit risk, commercial real estate, etc aren't rocket science to hedge against. Most of this stuff is not something I'd want to leave alone without watching charts for even a day though, even in a decently hedged portfolio.",
        "created_utc": 1591210114,
        "id": "fsrxhjt",
        "score": 1,
        "subreddit": "investing",
        "created": 1591238914.0
    },
    {
        "author": "dreammanalishi",
        "body": "My bot says this, this morning... but keep in mind I only buy large amounts and sell after a small increment. I also haven't manually vetted these, yet. What you are looking for is stuff that is close to its pre Covid high that was already doing well. No energy, Pharma, therapeutics. Never buy at the top.\n\nACM\n\nADP\n\nADT\n\nAME\n\nAMPH\n\nAMTD\n\nANET\n\nANTM\n\nAYX\n\nBAM\n\nBLK\n\nBLL\n\nCAT\n\nCERN\n\nCL\n\nCMCSA\n\nCOST\n\nCZR\n\nDE\n\nDIS\n\nELF\n\nGGG\n\nHLF\n\nHMC\n\nHUBB\n\nIEC\n\nIGSB\n\nINTC\n\nIR\n\nKDP\n\nLMT\n\nLRCX\n\nMA\n\nMJCO\n\nMMM\n\nMORN\n\nMS\n\nMU\n\nMWA\n\nNEBU\n\nOOMA\n\nPAYC\n\nPCAR\n\nPCTY\n\nPSTG\n\nQCOM\n\nRACE\n\nSMTC\n\nSNE\n\nSPY\n\nSSSS\n\nSTN\n\nTCX\n\nTQQQ\n\nTSLA\n\nUBS\n\nULTA\n\nV\n\nVEA\n\nVMW\n\nWCN\n\nWDAY\n\nWIRE\n\nWM\n\nZEN",
        "created_utc": 1591622297,
        "id": "ftd7fuv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591651097.0
    },
    {
        "author": "dreammanalishi",
        "body": "My bot says this, this morning... but keep in mind I only buy large amounts and sell after a small increment. I also haven't manually vetted these, yet. What you are looking for is stuff that is close to its pre Covid high that was already doing well. No energy, Pharma, therapeutics. Never buy at the top. Be careful of stuff that was on Firday's list... just be sure to manually check it, as it gets weighted higher if I successfully exceeded my target prices.\n\nACM\n\nADP\n\nADT\n\nAME\n\nAMPH\n\nAMTD\n\nANET\n\nANTM\n\nAYX\n\nBAM\n\nBLK\n\nBLL\n\nCAT\n\nCERN\n\nCL\n\nCMCSA\n\nCOST\n\nCZR\n\nDE\n\nDIS\n\nELF\n\nGGG\n\nHLF\n\nHMC\n\nHUBB\n\nIEC\n\nIGSB\n\nINTC\n\nIR\n\nKDP\n\nLMT\n\nLRCX\n\nMA\n\nMJCO\n\nMMM\n\nMORN\n\nMS\n\nMU\n\nMWA\n\nNEBU\n\nOOMA\n\nPAYC\n\nPCAR\n\nPCTY\n\nPSTG\n\nQCOM\n\nRACE\n\nSMTC\n\nSNE\n\nSPY\n\nSSSS\n\nSTN\n\nTCX\n\nTQQQ\n\nTSLA\n\nUBS\n\nULTA\n\nV\n\nVEA\n\nVMW\n\nWCN\n\nWDAY\n\nWIRE\n\nWM\n\nZEN",
        "created_utc": 1591622391,
        "id": "ftd7l4l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591651191.0
    },
    {
        "author": "anomander_rake123",
        "body": "Hitting my head against the wall for selling my lam research calls yday",
        "created_utc": 1591193364,
        "id": "fsqy3hb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1591222164.0
    },
    {
        "author": "Jwceltic5",
        "body": "Non-tech stocks I hold - LRCX, TOT, PG, BRK/B. All solid companies. Let me know if you have any questions.",
        "created_utc": 1591476054,
        "id": "ft6mgf5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1591504854.0
    },
    {
        "author": "tuffkai",
        "body": "Try AMCR, LRCX",
        "created_utc": 1592489031,
        "id": "fv8el0c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1592517831.0
    },
    {
        "author": "MiddleC5",
        "body": "I currently hold INTC, NVDA, LRCX. I used to hold TSM. I'm interested in TXN, AVGO, SWKS, AMD.",
        "created_utc": 1592352432,
        "id": "fv2kiri",
        "score": 1,
        "subreddit": "stocks",
        "created": 1592381232.0
    }
]