[
    {
        "author": "qwikspeed",
        "body": "ENPH all day baybee.",
        "created_utc": 1578800198,
        "id": "fe00llq",
        "score": 8,
        "subreddit": "RobinHood",
        "created": 1578828998.0
    },
    {
        "author": "redditornumber7",
        "body": "Solar company\n\nSEDG\nCANADIAN SOLAR\nENPH",
        "created_utc": 1578799389,
        "id": "fdzzbm2",
        "score": 4,
        "subreddit": "RobinHood",
        "created": 1578828189.0
    },
    {
        "author": "Alaskan_Viking",
        "body": "SEDG and ENPH (which I have a position in) are both up big today. ENPH is currently up over 11% since open, take a look at it if you haven’t yet. Them and SEDG basically are a duopoly in the microinverter market.",
        "created_utc": 1577994796,
        "id": "fcv51mx",
        "score": 3,
        "subreddit": "stocks",
        "created": 1578023596.0
    },
    {
        "author": "flyyoufools97",
        "body": "ENPH",
        "created_utc": 1578002155,
        "id": "fcvhfip",
        "score": 3,
        "subreddit": "stocks",
        "created": 1578030955.0
    },
    {
        "author": "Sneaky_Man",
        "body": "$ENPH",
        "created_utc": 1578410387,
        "id": "fdgwz8o",
        "score": 3,
        "subreddit": "stocks",
        "created": 1578439187.0
    },
    {
        "author": "Suhdudebruh",
        "body": "Got in at 7.69 last January and have held ever since. I’m shocked this sub and r/wallstreetbets don’t talk about ENPH more, it’s ascending like crazy and is showing no signs of slowing down anytime soon",
        "created_utc": 1578802328,
        "id": "fe03r5z",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1578831128.0
    },
    {
        "author": "The_Goodest_Dude",
        "body": "I don’t do a lot of research besides what’s in the news. Instead I invest in things I use or know a lot of other people use, or what a lot of companies use. \n\nI’m invested in FB because I have a Facebook, use it a lot, and I know that Facebook is more then just a social media website. They’re tryng to rebrand as such so I invested. I have near 28% return for the year. They’re at a 52 week high so I’ll probably be selling at least some of my stock. \n\nI want a Tesla really bad, I’m starting to get into electric and alternative energy. But I know TSLA is all over the place and I’m to afraid to jump in atm, especially since I don’t know a lot. Instead I looked into solar energy and noticed there’s really two major solar companies that are really developing quick. So I invested in ENPH and have a 16% return. \n\nBut I also have a portion of my portfolio in mutual funds like FNCMX which is what I first started using when I invested and got a 401k for the first time. It follows the NASDAQ but there’s also funds for the S&amp;P. If you really want to start putting your money in the mutual funds are a relatively safe and consistent choice. Read a few articles about mutual funds and you’ll understand they’re pretty simple to grasp. There’s also funds that follow different regions, international, specific market, etc. Read up on ETFs as well. \n\nThe only real ‘research’ I do is read the links and sources other people post in r/stocks when they talk about something I’m familiar with.\n\nEdit: I’m pretty young and can risk being a little risky with what I’m doing. And I’m constantly learning and reading or watching videos as I go.",
        "created_utc": 1578423418,
        "id": "fdhilo8",
        "score": 3,
        "subreddit": "stocks",
        "created": 1578452218.0
    },
    {
        "author": "m94m",
        "body": "That’s what I own. Brookfield has a good one too. \n\nI’m currently watching CSIQ, ENPH, SEDG.",
        "created_utc": 1578353385,
        "id": "fdf4wsz",
        "score": 2,
        "subreddit": "stocks",
        "created": 1578382185.0
    },
    {
        "author": "zahamma0",
        "body": "Was in ENPH at $5..very happy. Have been picking up shares along the climb as well",
        "created_utc": 1578850663,
        "id": "fe3mlb5",
        "score": 2,
        "subreddit": "stocks",
        "created": 1578879463.0
    },
    {
        "author": "LeonardoRafaell",
        "body": "This is an overlooked part of the market. Most ppl focus on the big boys. But i like small caps.  Here's  3 for you:\n\n1) lattice semiconductor LSCC.  quality is off the charts for their work. Company turned itself around in the last few years. It has been on a nice run, so maybe  a bit over 2B mc now.  Great growth ahead with 5g, AI, autonomous vehicles coming and needing quality chips and chip equipment.  \n\n2) Digital Turbine APPS   . very rare company.  No debt. Software play that installs people's apps on phones in the box, remotely. They have partnerships with samsung, htc, etc....new innovative products coming soon. Still under 1B mc\n\n3) Enphase Energy ENPH. Another high growth small cap. Will be mid cap pretty soon. Enphase is legitimately dominating solar micro inverters. They are the shovel of the solar gold rush.\n\nRunner up: Endava, plc. DAVA. british tech consulting firm. Huge growth already and just getting started.\n\n\n*also a word of advice,  avoid crypto and cannabis",
        "created_utc": 1578389205,
        "id": "fdgbwdx",
        "score": 2,
        "subreddit": "investing",
        "created": 1578418005.0
    },
    {
        "author": "Madharder",
        "body": "A company called Enphase ticker ENPH deals with supplying batteries for Tesla and other EVs. \n\nMaybe diversify the 400k a lil bit. \n\nV, DIS, MSFT and APPL might provide some security also. \n\nGood luck",
        "created_utc": 1578222902,
        "id": "fd8sou8",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1578251702.0
    },
    {
        "author": "cmcooper2",
        "body": "Microsoft\n\nEdit: Also Enphase Energy when I have the money (ENPH) and the price is right",
        "created_utc": 1578804731,
        "id": "fe071f7",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1578833531.0
    },
    {
        "author": "hugsfunny",
        "body": "ENPH, SEDG, and QCLN for clean energy. The growth isn’t going to slow down. Even if the economy stalls, I would expect stimulus packages to target this sector. \n\nFIW and CQW for water. Climate change play. \n\nNOK for reasons mentioned elsewhere in this thread. \n\nAPHA as the most financially sound MJ company. \n\nNUAN and CRNC for voice AI. I see massive room for growth with the former as EMRs expand globally. Also, I’ve used Dragon and it’s exceptional. Much better than Alexa or Google in my experience. They have a large moat in the medical industry and will continue to collect subscription dollars for many years to come. I expect the latter to eventually be acquired by an auto company or FANG as an asset to help compete against TSLA. \n\nSBUX as they continue to push into new markets. The dividend isn’t terrible in the meantime. \n\nITHUF and TCNNF if Bernie is elected. They will make a huge run if US closes in on MJ legalization. \n\nWELL and OHI for REITs. Old people need care. Inflexible and growing demand with the aging population. \n\nGOOGL, MSFT, V, DAL, WM and MDT are my plays for lower risk growth. These companies continue to crush expectations and have solid moats.",
        "created_utc": 1579301799,
        "id": "feolebg",
        "score": 2,
        "subreddit": "investing",
        "created": 1579330599.0
    },
    {
        "author": "Court_esy",
        "body": "I feel like ENPH is one step away from being sold downward again, similar to last ER. Seems like an obvious pump for me.",
        "created_utc": 1578841862,
        "id": "fe2qskl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1578870662.0
    },
    {
        "author": "lobster_johnson",
        "body": "There's the danger that a Chinese manufacturer could flood the market with much cheaper products, which is what Citron predicted last year. Not sure how ENPH has avoided this so far; they have a solid reputation, but do they have any kind of competitive moat (other than, perhaps, tariffs)? Apparently Huawei being forced out of the market was a big boost.",
        "created_utc": 1578844319,
        "id": "fe2ypln",
        "score": 2,
        "subreddit": "stocks",
        "created": 1578873119.0
    },
    {
        "author": "MaStNu",
        "body": "ENPH thanks for the awesome start to the year! I usually pick the wrong ones, but I actually picked the right one to swing 😎",
        "created_utc": 1577996178,
        "id": "fcv7drb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1578024978.0
    },
    {
        "author": "queenoftheinternets",
        "body": "It's ok I made up for it with ENPH, thanks reddit",
        "created_utc": 1578017033,
        "id": "fcw4mc8",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1578045833.0
    },
    {
        "author": "5nahk",
        "body": "You may want to revisit your comment 2 days ago where you said \"Ok dont invest in ENPH\".",
        "created_utc": 1577995846,
        "id": "fcv6tor",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578024646.0
    },
    {
        "author": "LeonardoRafaell",
        "body": "IIPR is buying up the distressed cannabis properties.  That should be a nice play as all these growers go bankrupt.\n\nAnother is TER, they test for semiconductor companies so as long as semis are needed for 5g, AI, etc, TER is a nice play.\n\nSome others are LSCC, ENPH, OTEX, TEVA, and DAVA",
        "created_utc": 1577877530,
        "id": "fcq2v9y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1577906330.0
    },
    {
        "author": "The_Goodest_Dude",
        "body": "ENPH",
        "created_utc": 1579180984,
        "id": "fejnpn9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579209784.0
    },
    {
        "author": "kidze",
        "body": "I own SEDG and ENPH",
        "created_utc": 1579203350,
        "id": "fekmvbm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579232150.0
    },
    {
        "author": "PuertoRicanSuperMan",
        "body": "ENPH is good from all the research I have done.  Good fundamentals and a good veteran leadership.  ENPH is also the largest micro inverter company in the world and they are expanding to other continents with untapped markets.\n\nI do not own this stock since I'm a poor student still but have been doing research on alternative energy stocks I could put some money into.",
        "created_utc": 1579207672,
        "id": "feku68o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579236472.0
    },
    {
        "author": "Fringding1",
        "body": "i bought in during the november short attack @ 19$ and sold half my position at the 31 mark. $ENPH",
        "created_utc": 1578927610,
        "id": "fe8lpy3",
        "score": 1,
        "subreddit": "investing",
        "created": 1578956410.0
    },
    {
        "author": "Greenjuice154",
        "body": "&gt;ENPH\n\nwhat was your reasonning behind this ?",
        "created_utc": 1578999400,
        "id": "fed565e",
        "score": 1,
        "subreddit": "investing",
        "created": 1579028200.0
    },
    {
        "author": "off_the_spectrum",
        "body": "dividend stocks are definitely more stable in tough times which isn't diversification but close enough. People are still paying At&amp;t during down times, and you're still getting your 5+% dividend. You can be risky though, you're young, ditch T\n\nEdit: do you have any good word on ENPH? I see it ran up a lot this year and is still a very small cap company",
        "created_utc": 1578540398,
        "id": "fdm5nvl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578569198.0
    },
    {
        "author": "Low_On_Coffee",
        "body": "“If you believe in the company and it’s up, buy. If you believe in the company and it’s down, buy more.”\n\nPersonally ENPH over $30 is a hold for me. It has a history of falling after earnings, even when the earnings  are good, so I’ll be looking to buy more after. But there’s an interesting trend to watch over at SEDG, which just keeps climbing. Either way if you’re holding, enjoy!",
        "created_utc": 1578586378,
        "id": "fdni9z1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578615178.0
    },
    {
        "author": "SpliTTMark",
        "body": "I want to find the next enph or maybe just stick with enph",
        "created_utc": 1578589978,
        "id": "fdnoj95",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578618778.0
    },
    {
        "author": "kingsscotty",
        "body": "you want to talk about promising stocks?! \n\nLook at ENPH or Enphase Energy if you aren't buying this stock is it like saying no to buying Apple on may 2 2016! This stock is going to blow up over the next year let alone the next 5!",
        "created_utc": 1579322978,
        "id": "fepkn58",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1579351778.0
    },
    {
        "author": "bagofnutella",
        "body": "ENPH",
        "created_utc": 1579324906,
        "id": "fepn2y0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579353706.0
    },
    {
        "author": "borntoperform",
        "body": "ENPH for clean energy\n\nTTD for digital advertising\n\nSHOP for ecommerce\n\nV for payment processing\n\nMSFT for cloud computing\n\nTCEHY for their acquisitions in so many industries\n\nI have a feeling that the Canadian weed stocks might go positive this calendar year. I just want to see some companies have a couple consecutive quarters reporting profits.",
        "created_utc": 1579307436,
        "id": "feoxcvw",
        "score": 1,
        "subreddit": "investing",
        "created": 1579336236.0
    },
    {
        "author": "The_Goodest_Dude",
        "body": "ENPH",
        "created_utc": 1579375808,
        "id": "fetilqi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579404608.0
    },
    {
        "author": "bagofnutella",
        "body": "Gotta love ENPH becoming profitable",
        "created_utc": 1579354736,
        "id": "ferjmql",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579383536.0
    },
    {
        "author": "play_it_safe",
        "body": "Can't take ESG guidelines as instituted generally seriously if Nestle is top pick in internaitonal ESG ETFs usually\n\nI do, however, buy renewable energy ETFs and stocks. They also happen to be some of the best performing last year and YTD\n\nPicks: ENPH, PBW, TAN, QCLN",
        "created_utc": 1579704337,
        "id": "ff9423l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579733137.0
    },
    {
        "author": "meanordljato",
        "body": "&gt;dering loading up on more but I'm worried there's something I'm not seeing.\n\nLK, because there is a problem bringing out coffee people think and it's Chinese,  \n\n\nENPH is just volatile in general, but it's a great opportunity to pick it up",
        "created_utc": 1580145821,
        "id": "ffqxflf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580174621.0
    },
    {
        "author": "LeonardoRafaell",
        "body": "BX  , TER, ENPH, LSCC, OTEX, STM, LDOS",
        "created_utc": 1579997410,
        "id": "ffjfxb8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580026210.0
    },
    {
        "author": "TheOriginalRK",
        "body": "ENPH if you want a good renewable energy one with tons of room for growth.",
        "created_utc": 1579611486,
        "id": "ff5vb78",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579640286.0
    },
    {
        "author": "SmallPotGuest",
        "body": "didn't know ENPH could be so retardly strong, sold way too soon...",
        "created_utc": 1577991682,
        "id": "fcuzmzz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578020482.0
    },
    {
        "author": "Kundera42",
        "body": "ENPH, they will benefit from the environmental winds of change.",
        "created_utc": 1577979010,
        "id": "fcueg44",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578007810.0
    },
    {
        "author": "DieOnYourFeat",
        "body": "I have an income generating account that I won't touch unless one of its constituents stops paying a dividend. as to my other accounts I am considering doing a pairs trade where I go long MSFT and short QQQQ. Another pairs trade I am considering is shorting a solar ETF but staying long ENPH. Finally I might well write leaps against my entire ENPH position as they are set up right now to gain 41% a year even if the stock doesn't gain a nickel which should offset a substantial decline.  \n\nSo basically stay fully invested with some hedges.",
        "created_utc": 1578411342,
        "id": "fdgydgi",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578440142.0
    },
    {
        "author": "NightflowerFade",
        "body": "ENPH and SEDG. These two will continue to grow even after the recent stellar growth. Also, AMAT, LRCX and TSM are still good companies but don't expect 30% annual returns from those.",
        "created_utc": 1578530233,
        "id": "fdlqq7i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578559033.0
    },
    {
        "author": "pistachio224",
        "body": "Why ENPH?",
        "created_utc": 1578541769,
        "id": "fdm7lhg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578570569.0
    },
    {
        "author": "Known-Appeal",
        "body": "I have ENPH products on my solar roof. I'm a happy customer. Unlike SEDG 's central inverter, ENPH has less loss and connects panels in series, not parallel, so one shady spot doesn't nerf your whole system.\n\nIt's been a great ride. I have 50 shares purchased at $17 each.",
        "created_utc": 1578849885,
        "id": "fe3jsb5",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1578878685.0
    },
    {
        "author": "David_gr",
        "body": "I bought enph about 6 months ago at around 32 dollars, and it's at around 30.60 now, very confusing",
        "created_utc": 1578852969,
        "id": "fe3uc6v",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578881769.0
    },
    {
        "author": "pr0nh0und",
        "body": "&gt; I got enph in june at $17.25 and made the mistake of selling in September at $23. \n\nNothing wrong with taking profits.  I think the bigger mistake was not buying the dip to $18 a month or two ago.",
        "created_utc": 1578850265,
        "id": "fe3l6nx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578879065.0
    },
    {
        "author": "NotoriousFreak",
        "body": "I got enph in june at $17.25 and made the mistake of selling in September at $23. Its at $30 now. From that little experience I can agree with other comments, good long term investment, buy in now and ignore it entirely as it will jump around enough to make you on edge at times.",
        "created_utc": 1578844816,
        "id": "fe30vm4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578873616.0
    },
    {
        "author": "LeonardoRafaell",
        "body": "Absolutely hold.\n\nEnphase is a fundamentally sound company with a nice position in solar. They are the shovel sellers in the solar gold rush.  I'm holding and adding more. ENPH still has only  a small ~mid marketcap. Plenty of room for growth",
        "created_utc": 1578829638,
        "id": "fe1qhhv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578858438.0
    },
    {
        "author": "C3nt1p33d",
        "body": "Yea man thanks for the feedback I was doing research until 3am lol I'm definitely holding. I was just thinking about avoiding a small correction and buying a little more if there were one. I'm under the impression now that enph has a lot of room to grow.... I have 2400 shares so I'm going to be patient and hold. I may drop my shares the day of earnings and the day after just because traders tend to sell off despite solid earnings results",
        "created_utc": 1578846513,
        "id": "fe36p1n",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578875313.0
    },
    {
        "author": "kingsscotty",
        "body": "The best stock of 2020 will be ENPH, it will be the Apple of the solar industry. But honestly I believe with their I7 inverters and their Ensemble solar house storage battery packs their stock will double this year and be way above 100 with in the next 2!",
        "created_utc": 1579325564,
        "id": "fepnvcj",
        "score": 1,
        "subreddit": "investing",
        "created": 1579354364.0
    },
    {
        "author": "curiouswhiteboy",
        "body": "Various ACB calls, ENPH, and SQ calls",
        "created_utc": 1579185587,
        "id": "fejtnyq",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1579214387.0
    },
    {
        "author": "LeonardoRafaell",
        "body": "Hold ENPH thru 2020s more like it",
        "created_utc": 1579224666,
        "id": "felkydg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579253466.0
    },
    {
        "author": "peridotdragon33",
        "body": "ENPH",
        "created_utc": 1578611255,
        "id": "fdorhnn",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578640055.0
    },
    {
        "author": "SamQuentin",
        "body": "I am holding ENPH, SEDG and FSLR\n\nWe will see what happens, but they appear well positioned",
        "created_utc": 1578587178,
        "id": "fdnjm2f",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578615978.0
    },
    {
        "author": "DieOnYourFeat",
        "body": "Beyond the usual suspects I would say ACAD, ENPH, and KALA, PRVB\n\nPretty sure ACAD will get bought out this year at between $80 and $100 and looking at the call activity verifies that to me. Baker Brothers get this stuff right most of the time. \n\nENPH because they are still early in their growth, coming out with new products, leading technology, would not be surprised at all to see this at 70 by end of year. My biggest holding by far. \n\nKALA is more of a gamble but I feel it is asymmetrical risk in my favor. They could easily go to 15 in the next 3 months depending on pending FDA actions, and their biotechnology is applicable to more products. some speculate it could become $100 stock in a matter of a few years certainly if it pops to 15 I will not be selling.\n\nPRVB - I am invested in this one fairly deeply but it worries me the most. The reason it worries me is I cannot figure out why it is trading as low as it is given their pipeline and where they are in process with it. Depending on what happens in the next two months this could be a $5 or $50 stock. Maybe more if someone like NORD takes them out.",
        "created_utc": 1578593206,
        "id": "fdnuorp",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578622006.0
    },
    {
        "author": "TheOriginalRK",
        "body": "ENPH. Great energy company and look at the 1y",
        "created_utc": 1578583735,
        "id": "fdndx7d",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578612535.0
    },
    {
        "author": "Shaun8030",
        "body": "Cool will do some research into the sector enph may be a starting point for my studies",
        "created_utc": 1579881868,
        "id": "fffdzbp",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1579910668.0
    },
    {
        "author": "masalberto",
        "body": "TAN, or QCLN for the safe index etf or AMD, ENPH for solo stocks",
        "created_utc": 1579585716,
        "id": "ff5azq9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579614516.0
    },
    {
        "author": "LeonardoRafaell",
        "body": "I'd  go with TSM, SNE, ENPH, LSCC, OTEX",
        "created_utc": 1579585103,
        "id": "ff5acxg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579613903.0
    },
    {
        "author": "Viscoden",
        "body": "Check out XEL at some point, imo really well run company, my dad had original shares and was buying shares for me when I was younger. \n\nI'm also long on ENPH and VSLR, which unfortunately don't have dividends.",
        "created_utc": 1579585828,
        "id": "ff5b3sx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579614628.0
    },
    {
        "author": "erikwarm",
        "body": "$ENPH",
        "created_utc": 1580146224,
        "id": "ffqy2o3",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1580175024.0
    },
    {
        "author": "meanordljato",
        "body": "safest is an index, for a few percentages of gain,  \n\n\nbut I will take some of those that dropped most, maybe some I already have in my portfolio, like lukin and ENPH",
        "created_utc": 1580148562,
        "id": "ffr1rd7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580177362.0
    },
    {
        "author": "906plong",
        "body": "Emphase is over -9%.",
        "created_utc": 1580156329,
        "id": "ffreatg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580185129.0
    },
    {
        "author": "meanordljato",
        "body": "yes get into it,   \n\n\nthey are just volatile but will rise, I have only ENPH",
        "created_utc": 1580193404,
        "id": "ffsuvyh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580222204.0
    },
    {
        "author": "DiogenesTheGrey",
        "body": "Emphase put",
        "created_utc": 1580475813,
        "id": "fg3a3ae",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1580504613.0
    },
    {
        "author": "meanordljato",
        "body": "check out what you like and what's new to the world  \n\n\nnew energy forms. ENPH\n\nnew food\n\nbee.v\n\nviolence prevention ssti (pat.v maybe)\n\nbetter teeth SDC\n\ncheap medicine TEVA, \n\nnew treatment ADPT\n\netc",
        "created_utc": 1580402789,
        "id": "fg08zg5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580431589.0
    },
    {
        "author": "xlynx",
        "body": "My risk tolerance is far below what buying SPWR would require. I'd buy them when profitability is within a year, and there would still be plenty of room for growth.\n\nI'm buying ENPH and SEDG. It's the tech at the heart of it all. It's where the intrinsic value lays. They are the relatively indispensable focusing point, compared to all the generators, installers, retailers etc. They do one thing and do it well.",
        "created_utc": 1578923944,
        "id": "fe89ghp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578952744.0
    },
    {
        "author": "meanordljato",
        "body": "ENPH Long term.\nAlso it just dropped. Might but might not drop more. Which makes it attractive from that point of view",
        "created_utc": 1579108945,
        "id": "feh4gk0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579137745.0
    },
    {
        "author": "el_liott_",
        "body": "Check the Stocktwits and a Yahoo Finance $ENPH chat rooms... a ton of info there",
        "created_utc": 1578999181,
        "id": "fed50mz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579027981.0
    },
    {
        "author": "Viscoden",
        "body": "I hold ENPH, TERP (might be getting purchased by Brookfield), ICLN, and VSLR. I also watch MANY solar/clean energy stocks, but I haven't I around to buying yet.  TAN would probably be a good alternative to ICLN. \n\nHalf related, I don't think it's a bad idea to put a small portion in to Uranium. I have some LEU and am following some other Uranium stocks as well. While there are parts of uranium that are bad for the environment, it also has lots of potential if we can solve the negative from it.\n\nI myself would also consider investing in certain tech/ utility companies as \"doing good\". I'm in very heavy on XEL, and I have been for quite a long time. MSFT recently has vowed to be carbon negative by 2030, and I have been slowly acquiring shares when I can.",
        "created_utc": 1579389050,
        "id": "feuqspj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579417850.0
    },
    {
        "author": "Rclarkttu07",
        "body": "Not quite random but here is where I am at. \n\n&amp;#x200B;\n\nI enjoy smoking weed:\n\nACB - 48 shares - AVG 4.01\n\nAPHA - 20 Shares -AVG 5.04\n\nTLRY - 5 Shares - AVG 20.53\n\nCGC - 3 Shares - AVG 20.52\n\n&amp;#x200B;\n\nI work at an it re-seller: Still looking to diversify but I see we sell quite a bit of the storage companies below.\n\nNTNX - 5 Shares - AVG 28.16\n\nPSTG - 9 Shares - AVG 19.32\n\n&amp;#x200B;\n\nSome of our larger spend customers (I figure they are investing in themselves at least from a tech perspective.)\n\nBMC - 6 Shares - AVG 25.05\n\nPEGA - 3 Shares - AVG 74.93\n\nCWK - 7 Shares - AVG 19.43\n\n&amp;#x200B;\n\nMy father works for SunPower and i randomly stumbled upon Vivant Solar (Looking to invest in ENPH soon.)\n\nSPWR - 25 Shares  - AVG 9.33\n\nVSLR - 20 Shares - AVG 6.81\n\n&amp;#x200B;\n\nI do look at r/invest and r/WallstreetTards and these are a bit random but mainly stocks others have identified as upside for long term holds.\n\nPins - 5 Shares - AVG 21.51\n\nSAVA - 10 Shares - AVG 9.91\n\nNIO - 11 Shares - AVG 4.14\n\nDEAC - 8 Shares - AVG 12.33\n\nONTX - 100 Shares - AVG .389\n\nNET - 3 Shares - AVG 18.68\n\n&amp;#x200B;\n\nI am trying to wait until RH approves me for fractional share purchasing but who knows then that will start happening. With my monthly comission checks, i will start purchase the blue chippers (MSFT, AAPL, TSLA, DIS and maybe NFLX.) All of those are very price so maybe 1-2 of each depending on the cost.\n\n&amp;#x200B;\n\nUntil I learn more, i plan to simply hold these forever or until one hits it big enough for me to sell and reinvest in an ETF/Index Fund that i did start with 5k recently and plan to put about $300 a month into. \n\n&amp;#x200B;\n\nGot any advice?",
        "created_utc": 1579124134,
        "id": "fehuivg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579152934.0
    },
    {
        "author": "MaStNu",
        "body": "I just got back into ENPH today.",
        "created_utc": 1579145538,
        "id": "feirqnm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579174338.0
    },
    {
        "author": "LeonardoRafaell",
        "body": "Point is that their business has a huge moat.  They are in demand no matter which company wins or loses this sector. I wouldnt worry much about govt subsidies or falling prices or whatever else. I'm long ENPH and I'll be adding to it",
        "created_utc": 1579224587,
        "id": "felku6t",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579253387.0
    },
    {
        "author": "Handapandaabanana",
        "body": "I’ve been on the fence about ENPH for a few months now, what made you decide to buy?",
        "created_utc": 1579099512,
        "id": "fegpkrf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579128312.0
    },
    {
        "author": "leavingdirtyashes",
        "body": "I'm looking at $SIX, have $ENPH call...",
        "created_utc": 1578806380,
        "id": "fe08z1u",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1578835180.0
    },
    {
        "author": "meanordljato",
        "body": "I sold 40 percent Friday. Will sell at least 50% of the remainder if it drops below 30 USD. I'm not sure why ENPH rose so much recently but I believe it will reach towards 40 during 2020",
        "created_utc": 1578814724,
        "id": "fe0k0zw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578843524.0
    },
    {
        "author": "The_Goodest_Dude",
        "body": "Ride or die with ENPH. I’ll probably hold for awhile and add little overtime. \n\nDid that with FB, was gonna sel at 200-205 but it keeps going",
        "created_utc": 1578849911,
        "id": "fe3jv27",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578878711.0
    },
    {
        "author": "Parallelism09191989",
        "body": "ENPH is a 9 bagger at current levels",
        "created_utc": 1578849093,
        "id": "fe3gsb9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578877893.0
    },
    {
        "author": "Extrosity",
        "body": "I would definitely recommend solaredge over enph, while they do have the micro inverter market, solar edge is massively booming. I work in solar distribution and we have been seeing 16-20 week lead times on solar edge, all large installers are swapping to them. In the last they had a high fail rate due to their displays but this has been fixed. In q1/q2 they are releasing their new inverter series that will have EV charging on every inverter. The market growth potential of solar edge is in a much better place.",
        "created_utc": 1578853179,
        "id": "fe3v7hm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578881979.0
    },
    {
        "author": "C3nt1p33d",
        "body": "I'm not sure about that. I think ENPH has a lot of room to grow. They are just getting started imo. I'd go as far to say they are undervalued. I appreciate you giving me honest/non sarcastic feedback though.",
        "created_utc": 1578884425,
        "id": "fe68zy6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578913225.0
    },
    {
        "author": "attirer",
        "body": "BEP.UN is a good investment but after a huge run in 2019 its price is also very high right now. I hold the parent company, BAM.A, rather than the subsidiary because I’m interested in gains from all of the related companies (BIP.UN, BPY.UN, BBU.UN) and I’m not drawn to the high dividend yield.\n\nAQN and NEE (US-listed) are two other good companies but I don’t follow them as closely so I don’t know what their prices are like right now.\n\nSEDG is an amazing solar tech company that I hold that’s also benefited from a huge run in 2019. It gets compared a lot to ENPH but if you’re concerned with fundamentals then SEDG is the clear winner.",
        "created_utc": 1578063362,
        "id": "fcxhxga",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1578092162.0
    },
    {
        "author": "BestEmballeur2",
        "body": "Why enph? The stock already had a massive year",
        "created_utc": 1578603802,
        "id": "fdoevf3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578632602.0
    },
    {
        "author": "Moveover33",
        "body": "Hey, thanks for those names. I wasnt familiar with them before. Especially like ENPH and ACAD. \n\nI would suggest a look at LX.",
        "created_utc": 1578609663,
        "id": "fdoozt0",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578638463.0
    },
    {
        "author": "Heydanu",
        "body": "Building some long holds like ENPH. Trying to do some more research in some long hold biotech/pharma/gene editing companies. Feel free to pm.",
        "created_utc": 1578577261,
        "id": "fdn4rtu",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1578606061.0
    },
    {
        "author": "NaturallyBlockheaded",
        "body": "ENPH is a great long accumulate and hold, I got in initially at 9.00",
        "created_utc": 1578553541,
        "id": "fdmkprb",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1578582341.0
    },
    {
        "author": "sbd001",
        "body": "Yeah I'm really glad I bought into enph this past summer. I like them both because they're a solar panel company and I'm pro green energy, and for the profits.",
        "created_utc": 1578585358,
        "id": "fdngl04",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578614158.0
    },
    {
        "author": "RNOUGHT18",
        "body": "My portfolio is a mess. \n\nAMD 40%\n\nENPH 0.26%\n\nMSFT 2.76%\n\nPM 8.12%\n\nT 16.53%\n\nF BOND 10.1\n\nCASH 18.21\n\nI'm selling the ford bond as soon as it pays out this month. What else should I sell/buy recommendations? The vast majority of my gains have been from AMD.",
        "created_utc": 1578684541,
        "id": "fdrhaop",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578713341.0
    },
    {
        "author": "Node144D",
        "body": "OMCL, TER, ENPH, DIS, V, SHOP",
        "created_utc": 1578586816,
        "id": "fdnj06u",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1578615616.0
    },
    {
        "author": "MadCritic",
        "body": "I'm 19, got a bit of cash invested. I'm long, and 13,3% up as of October. Gonna be a while before I buy more GOOGL or AMZN but I had to own 2 shares of each, so in the near future I'll get the % down by investing in my other companies (and new ones).\n\nAMZN 20,83%\n\nGOOGL 15,28%\n\nMSFT 11,25%\n\nDIS 11,20%\n\nBABA 10,74%\n\nFB 9,34%\n\nMA 8,24%\n\nV 5,17%\n\nENPH 2,78%\n\nPYPL 1,8%\n\nAAPL 1,64%\n\nBRK.B 1,23%\n\nAT&amp;T 0,43%\n\n&amp;#x200B;\n\nPlan to invest more in PYPL, AAPL, BRK.B, AT&amp;T, and also some more dividend stocks. Would it be dumb to have 25% of my portfolio be dividend stocks to diversify my risk?",
        "created_utc": 1578423044,
        "id": "fdhhzg5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578451844.0
    },
    {
        "author": "TheOriginalRK",
        "body": "Love me some ENPH",
        "created_utc": 1577986059,
        "id": "fcupscx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1578014859.0
    },
    {
        "author": "meanordljato",
        "body": "ENPH",
        "created_utc": 1580149407,
        "id": "ffr33vk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580178207.0
    },
    {
        "author": "CraftyMarket",
        "body": "Just bought ENPH and SYF.",
        "created_utc": 1580160238,
        "id": "ffrl2kj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580189038.0
    },
    {
        "author": "b1ker",
        "body": "Clean energy, like solar enph or sedg",
        "created_utc": 1580012748,
        "id": "ffk1a9a",
        "score": 1,
        "subreddit": "investing",
        "created": 1580041548.0
    },
    {
        "author": "hectorovo",
        "body": "ARWR\nABBB\nSEDG\nENPH\nAYX\nDIS\nMSFT",
        "created_utc": 1580171994,
        "id": "ffs368w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580200794.0
    },
    {
        "author": "meanordljato",
        "body": "LK ENPH. Lots",
        "created_utc": 1580142874,
        "id": "ffqsvpa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1580171674.0
    },
    {
        "author": "meanordljato",
        "body": "I'll like some input\n\nUPWK 10%\n\nTEVA 10%\n\nETSY 7%\n\nAMRN 10%\n\nENPH 10%\n\nADPT 2%\n\nBYND 3%\n\nCHRS 1.5%\n\nWATT 2%\n\nFLT 4.5%\n\nFCEL 1%\n\nLK 3%\n\nNBRV 3%\n\nNM 1.5%\n\nSSTI 3%\n\nSDC 3%\n\nUEC 3%\n\nBSK 4.5%\n\nBEE.V 6%\n\nBITCOIN 10%\n\nCURECOIN 1.5%\n\nPAT.V 4.5%\n\nAnd some 4-5 other smaller positions",
        "created_utc": 1579756182,
        "id": "ffb9ief",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579784982.0
    },
    {
        "author": "LeonardoRafaell",
        "body": "TER LSCC ENPH",
        "created_utc": 1579849948,
        "id": "ffeizf4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1579878748.0
    },
    {
        "author": "t35t0r",
        "body": "I hold ~30% of these at any given time, but frequently by in and out of all of them :\n\naig\nbac\nbmy\nbynd\ncsco\neem\nefx\nfitb\nflgt\nfmc\nfxi\ngild\nhd\nhtht\nipar\nkbh\nlevi\nlh\nlly\nlscc\nluv\nmcd\nmrvl\npanw\npayc\nqcom\nroku\nspot\ntm\nttgt\nvtr\nzbra\n\nabbv\nabt\nacn\nadbe\nadsk\naltr\nathm\nazo\nbaba\nbax\nbrk.b\nburl\nc\ncdlx\ncmg\ncrm\ncsii\nctas\ndhr\ndpz\ndva\nenph\netsy\new\nfive\nfiw\nfn\ngpn\ngs\nhi\nhii\nhum\nhuya\nilmn\nintc\niq\nirmd\nisrg\nitgr\njbht\njd\nklac\nlk\nlow\nlrcx\nmdt\nmmm\nmnst\nmoh\nmsci\nmsft\nmt\nmtch\nmu\nneo\nnke\nnoc\nosk\npall\nqqq\nrace\nregn\nrost\nrrgb\nschb\nsea\nsedg\nshop\nskyw\nspgi\nstaa\nstm\ntgh\ntgt\ntsla\ntsm\nttd\ntxn\nuctt\nUI\nUL\nunh\nvar\nvrtx\nvti\nwfc\nwing\nxpo\nzbh\n\naap\naapl\nadi\nakam\namat\namd\namgn\namt\namzn\navgo\nba\nbax\nbeat\nbidu\nbzun\ncdxs\ncma\ncrsp\ndgx\ndhi\nemn\nens\netfc\nfpay\ngasx\nglw\nhon\nimgn\nintu\nkeys\nlhx\nlmt\nlrcx\nlyft\nma\nmdb\nmsft\nnflx\nnio\nnow\nntnx\nnvta\norcl\npdd\npfe\nphm\nptc\nrdfn\nrtn\nsbac\nsbux\nsdc\nsina\nteva\ntmo\ntol\ntri\ntsn\nual\nutx\nv\nvar\nvrsn\nvslr\nwb\nyum\nzg\nzs\n\nazn\nbdry\ngis\nmrk\nnvs\npgre\nshw\ntndm\nuaa\nveon\n\nlit\nendp\n\n\ntdg\nrtn\nutx\n\nosk\n\ngd\nldos\nhxl",
        "created_utc": 1578802764,
        "id": "fe04d2b",
        "score": 0,
        "subreddit": "RobinHood",
        "created": 1578831564.0
    },
    {
        "author": "jiggerMaster8900",
        "body": "HPE, they use Aruba equipment at a lot of sites for layer 2 security.",
        "created_utc": 1578534498,
        "id": "fdlwz1m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1578563298.0
    },
    {
        "author": "HowToBeAwkward_",
        "body": "It would be a stock split. Lots of ppl would flock to FB before that split date deadline. Splits historically appreciate both split stocks to higher combined valuations. There’s numerous examples from last year (EBAY/PPL, HP/HPE, HLT/PK &amp; HGV.  \n\nSecondary point- antitrust takes forever",
        "created_utc": 1577943903,
        "id": "fcthyyo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1577972703.0
    }
]