[
    {
        "author": "tianavitoli",
        "body": "Elon is right in line:\n\nYou don't just tell everyone to kiss your ass from the getgo, it builds in strata.\n\n100k USD - You can start telling the people you don't like from past jobs, and maybe your cousins to kiss your ass.\n\n500k USD - You can tell your family and possibly your in-laws, random people who start shit with you, and business you're loyal to, they can tongue your anus.\n\n1 million USD - You can tell your boss, co-workers, as well as your girlfriend (not wife), certain low level civil servants, and people within 2 mil USD of you, to taste your tip.\n\n20 mil USD - You can tell small financial institutions, businesses, all friends and family, corrupt government employees, and individual bank branches, to baste your bellybutton.\n\n100 mil USD - You can tell most municipal governments, and businesses with a smaller market cap than you, as well as all city and state level civil servants to suckle your nips.\n\n500 mil USD - You can tell local law enforcement, as well as some legislators, judges, lawyers, prosecutors, customs officials, and regulatory agencies to kiss you on the lips.\n\n1 billion USD - You can tell most nation states on earth to lie down so you can tenderly make love to them.\n\n100 bil USD - You can begin fucking teh fabric of spacetime and bribing the primordial cosmic beings that exist in the great voids of the universe.\n\n1 trillion USD - Comcast will consider handling your complaints in a timely fashion",
        "created_utc": 1589069819,
        "id": "fq3ssm6",
        "permalink": "/r/wallstreetbets/comments/ggj6sc/puts_on_cali_calls_on_texas/fq3ssm6/",
        "score": 472,
        "subreddit": "wallstreetbets",
        "created": 1589098619.0
    },
    {
        "author": "CrescentSmile",
        "body": "Yep it’s already happening on Twitter... all I can do is play along “Yeaa own those libs! Go electric and show em whose boss!” and... they’re excited about it 🧐",
        "created_utc": 1589236938,
        "id": "fqbh8tu",
        "permalink": "/r/wallstreetbets/comments/ghw12u/elon_has_transcended_time_space_and_county/fqbh8tu/",
        "score": 259,
        "subreddit": "wallstreetbets",
        "created": 1589265738.0
    },
    {
        "author": "Laminar_flo",
        "body": "I’m a PM at a hedge fund (although I’m credit side). \n\nYou all are fucking retarded. The SPY *IS NOT THE FUCKING MARKET!!!* The SPY is also *NOT THE FUCKING ECONOMY!!!* \n\nThis obsession with SPY Puts and ‘Short the SPY’ is beyond fucking stupid to the point that *actual* traders are laughing at you all. \n\nThink about it: in the US there are about 12M ‘operating companies’ (eg ‘companies’ as you think of them). Only about 6,000 companies are public and the *biggest* 500 (or so) compromise the SPY. \n\nAre you seeing where this is going yet? You all are shorting the 500 companies *that are best positioned to, not only survive this, but THRIVE in the post-corona economy.* They have the best capital access, the best size, the best market position....I can keep going. The companies that comprise the SPY are going to survive, particularly the top ~100 or so that comprise 80% of the SPY action.\n\nWhat the fuck are you retards thinking shorting those companies?? Why the fuck are you ***SHOCKED*** you are losing money? WSB: “See that ETF that is comprised of the companies best positioned to go up?I’m betting my life savings on Puts.” If one of my analysts came to me with that thesis, I’d assume they had brain damage and fire them. \n\nThere are *obvious* shorts out there. I’m not giving specific names but first off, get the fuck away from large caps and start thinking about S/Mid caps that service those 12M operating companies that are fucking hating it right now.\n\nYou people getting lit on SPY puts are getting *exactly* what you should have expected.",
        "created_utc": 1588807740,
        "id": "fpprhpp",
        "permalink": "/r/wallstreetbets/comments/get5pu/you_are_living_in_the_greatest_con_of_all_time_an/fpprhpp/",
        "score": 238,
        "subreddit": "wallstreetbets",
        "created": 1588836540.0
    },
    {
        "author": "centaursteve",
        "body": "Good evening gentlemen,\n\nHad a hell of a year so far getting beat down doing various yolos. I would have some small wins, sold many potential big wins too early, and lost my ass playing ERs.  Before this week I was down about 50k and was depositing 5k every week trying to get my tendies back. This last 5k I deposited on Monday was going to be my last hoorah before I hung the gloves up. I played DDOG ER, saw the lackluster AH and thought I was boned. Woke up the next day to some good gains and decided to go all in on SPY on 1DTE puts believing it was going to dump. Like the true degenerate that I am I wanted to get rich or lose it all. Moral of the story, sometimes stonks do go down. \n\nPositions:\n\nDDOG 5/15 70c (65 contracts)\n-Bought for $0.65 on 5/11\n-Sold for $2.30 on 5/12\n\nSPY 5/13 286p (422 contracts)\n-Bought for $0.29 on 5/12\n-Sold for $5.51 on 5/13",
        "created_utc": 1589416140,
        "id": "fqjwblb",
        "permalink": "/r/wallstreetbets/comments/gjbj7y/you_can_take_the_dog_out_of_the_fight_but_you/fqjwblb/",
        "score": 228,
        "subreddit": "wallstreetbets",
        "created": 1589444940.0
    },
    {
        "author": "elevenbang",
        "body": "I got lucky off my initial gains from sub $100k to $450k off of SPY puts during the March fall to 220s. Then I fought the fed, kept fighting the fed, and lost...I got way too stubborn and didn't think it'd bounce so much. Take it as a lesson. Don't be hubris. Discipline yourself. Follow your rules. Cut your losses quickly. Write down everything you do wrong and learn from it. I'm taking a break.",
        "created_utc": 1589490219,
        "id": "fqn80ig",
        "permalink": "/r/wallstreetbets/comments/gjuriq/450k_to_8k/fqn80ig/",
        "score": 226,
        "subreddit": "wallstreetbets",
        "created": 1589519019.0
    },
    {
        "author": "elevenbang",
        "body": "Just adding on --\n\nSeriously guys. Be grateful for what you have. Don't risk more than you're willing to lose. Fortunately, this isn't everything in my name, but my soul is fucking crushed. But fuck it, I'm young and I still have a long road to go. Remember this a marathon, it's not a sprint. It's better to make a small amount and accumulate those wins over time than make huge, quick gains and to keep chasing that mentally. I let that get to me. Chasing greed and big profits instead of taking small gains and capitalize on that. Don't fly too close to the sun.",
        "created_utc": 1589490855,
        "id": "fqn9b5n",
        "permalink": "/r/wallstreetbets/comments/gjuriq/450k_to_8k/fqn9b5n/",
        "score": 210,
        "subreddit": "wallstreetbets",
        "created": 1589519655.0
    },
    {
        "author": "GlassWeird",
        "body": "The conservative cucks are eating it up too. I think this is part of a big brain strategy to sell musk's freedom mobiles to the real 'mericans",
        "created_utc": 1589232527,
        "id": "fqb8ol7",
        "permalink": "/r/wallstreetbets/comments/ghw12u/elon_has_transcended_time_space_and_county/fqb8ol7/",
        "score": 191,
        "subreddit": "wallstreetbets",
        "created": 1589261327.0
    },
    {
        "author": "VanHinten7",
        "body": "The USO guy is actually retarded. I love it",
        "created_utc": 1589835028,
        "id": "fr2cps2",
        "permalink": "/r/wallstreetbets/comments/gm9vel/alright_which_two_of_you_autists_got_in_my_lobby/fr2cps2/",
        "score": 187,
        "subreddit": "wallstreetbets",
        "created": 1589863828.0
    },
    {
        "author": "smileedude",
        "body": "The shrimp yesterday was wrong so I'm ingesting it",
        "created_utc": 1589403257,
        "id": "fqj06kz",
        "permalink": "/r/wallstreetbets/comments/gj6e8f/shrimp_algorithm_round_2_yesterdays_oracle_was/fqj06kz/",
        "score": 187,
        "subreddit": "wallstreetbets",
        "created": 1589432057.0
    },
    {
        "author": "JeanClaudeRumHam",
        "body": "It's easy to predict Tesla moves. Just think, \"How do the Musk worshipers feel about it?\" Threatening to move Tesla is financially stupid and illogical but the Tesla gang loves this move. Because it's Musk sticking it to those corrupt assholes running California who are only interested in lining their pockets with healthy citizens.",
        "created_utc": 1589059063,
        "id": "fq2rzzv",
        "permalink": "/r/wallstreetbets/comments/ggj6sc/puts_on_cali_calls_on_texas/fq2rzzv/",
        "score": 186,
        "subreddit": "wallstreetbets",
        "created": 1589087863.0
    },
    {
        "author": "captaintrips420",
        "body": "Gotta love how easy it is to lead American top minds in whatever circles some choose.",
        "created_utc": 1589237946,
        "id": "fqbj4oh",
        "permalink": "/r/wallstreetbets/comments/ghw12u/elon_has_transcended_time_space_and_county/fqbj4oh/",
        "score": 154,
        "subreddit": "wallstreetbets",
        "created": 1589266746.0
    },
    {
        "author": "Xerxys",
        "body": "It would cause a lot of controversy arresting a working African American.",
        "created_utc": 1589249878,
        "id": "fqc4dyj",
        "permalink": "/r/stocks/comments/ghzg93/elon_muk_ready_to_go_to_jail/fqc4dyj/",
        "score": 143,
        "subreddit": "stocks",
        "created": 1589278678.0
    },
    {
        "author": "Startspillowfights4",
        "body": "He’s selling the contracts for a profit because they increased their premium price.\n\nIf you subtract the total value from the total return you see he invested around $2700.\n\n$2700 divided by 10 contracts of 100 shares works out to a premium of $2.70 per share.\n\nHe was able to buy these contracts at such a low premium because it didn’t seem likely a stock would double in price in the next couple of months.\n\n5 of his contracts are now selling for a premium of 122.50 and 5 contracts are selling for a premium of 153.15.\n\nSo to resell the contracts (5contracts X 100shares X 122.50) equals $61,250 \n\nAnd 5 contracts X 100 shares X 153.15 equals $76,575.\n\nAdd $76,575 and $61,250 together to get $137,825.",
        "created_utc": 1588817503,
        "id": "fpq8tnd",
        "permalink": "/r/wallstreetbets/comments/gerkgx/they_said_buy_the_dip/fpq8tnd/",
        "score": 137,
        "subreddit": "wallstreetbets",
        "created": 1588846303.0
    },
    {
        "author": "whenihavenothingtodo",
        "body": "It is when you're offering an opinion on the price per share of a company of which you are an officer.",
        "created_utc": 1588386905,
        "id": "fp89kfg",
        "permalink": "/r/wallstreetbets/comments/gbs8x4/never_been_more_true/fp89kfg/",
        "score": 136,
        "subreddit": "wallstreetbets",
        "created": 1588415705.0
    },
    {
        "author": "v0rt",
        "body": "Participation trophy were invented by boomers. Then they turn around and make fun of their kids/grandkids for it. It's the dumbest generation we've ever had.",
        "created_utc": 1590785989,
        "id": "fs8o7lw",
        "permalink": "/r/wallstreetbets/comments/gt09t6/boomers_bitch_about_participation_awards_but/fs8o7lw/",
        "score": 133,
        "subreddit": "wallstreetbets",
        "created": 1590814789.0
    },
    {
        "author": "motley_bruin",
        "body": "“I can make it back” a retards dying words",
        "created_utc": 1590537223,
        "id": "frxciiv",
        "permalink": "/r/wallstreetbets/comments/gr8jbo/parents_let_me_trade_with_their_money/frxciiv/",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1590566023.0
    },
    {
        "author": "PetetheJuggler",
        "body": "Dow who? Jones? Tremendous guy. Tim Apple, Marilyn Lockheed, tremendous companies. Seriously some of the best. So we’re taking a big look- a really serious look- at some of the stuff we’re seeing come out of the Dow. Really remarkable. Thought it was just a chemical company you know, some of the strongest, I mean, really strong disinfectants, like bleach or formaldehyde, and so once Mr. Jones really gets going and we can reopen some states you’ll be able to really attack this virus, and I mean really attack- perhaps kill- this virus. This, invisible enemy. Really that’s what it is. It’s invisible. But we’re taking a look at it and a lot of different things and I think the American people are really going to like what they see.",
        "created_utc": 1590515868,
        "id": "frw5uxx",
        "permalink": "/r/wallstreetbets/comments/gqxlh1/its_our_cherished_annual_tradition_returning/frw5uxx/",
        "score": 124,
        "subreddit": "wallstreetbets",
        "created": 1590544668.0
    },
    {
        "author": "the_stormcrow",
        "body": "Is this a new copypasta? I'm feeling it.",
        "created_utc": 1589073229,
        "id": "fq43j1o",
        "permalink": "/r/wallstreetbets/comments/ggj6sc/puts_on_cali_calls_on_texas/fq43j1o/",
        "score": 122,
        "subreddit": "wallstreetbets",
        "created": 1589102029.0
    },
    {
        "author": "buttersquashcorgi",
        "body": "I think you misunderstood the core of the problem. It's not that things will forever change and the world will be unrecognizable because you're right, it's not and all your points are correct. **It's that the needle is moved 10-15% this way and that way**, causing businesses who relies on high degrees of leverage and economy of scale to eek out a profit due to their thin margins to shutter. Many of these fixed costs are ,well, fixed, so all that lost goes straight into their profits. \n\nThink about how the following sectors will be affected by 10-15% decrease in traffic: malls, restaurants, bars, airlines, automotive, hospitality, office space and all businesses around offices. \n\nExplicitly, airlines for example relies heavily on business travel to make a profit. Even with cheap oil prices, those business travelers are gone forever. I know a fair number of executives who vastly prefer teleconferencing - they get to stay at home with their family in their nice houses. Remember, these are people who are away from home 2 weeks/month. They fucking hate traveling. They will literally take a pay cut to not have to travel. These are the people in business class and first class. \n\nHow about cars? I was thinking of getting a new car, but with all of this work from home, I am obviously not going to get a new one for a while, and when I do, I won't get one as pricey or as nice. Why would I do that when I don't spend anywhere near as much time in it? Margins for base models are razor thin.",
        "created_utc": 1589045936,
        "id": "fq1ig04",
        "permalink": "/r/investing/comments/ggj3m9/why_the_coronavirus_will_not_change_habits_long/fq1ig04/",
        "score": 122,
        "subreddit": "investing",
        "created": 1589074736.0
    },
    {
        "author": "ObscureWhistle",
        "body": "Extra Credits did a pretty good series on it.\n\nI shit you not, the company could only send something like one ship per month, twelve ships per year to the entirety of the South American Ports. \n\nTo compare, fleets of ships were being sent to India to simply maintain the supply and trade going on there - the company’s scheme was completely FUCKED.\n\nBut the company was like “it’s fine, everything’s fine” the stock value increased, the ENTIRE COUNTRY bought into it, LOANS were being taken to buy more shares! It got so huge that the government had to shut down private entrepreneurs because they were taking away from buying shares. RE: there was not enough money in circulation to allow for other startups because they needed all the money for this company that DOESNT ACTUALLY MAKE ANY MONEY!\n\nAnd then it failed and everyone lost their stuff!\n\nThis is the second funniest shit I’ve ever heard of. \n\nThe first was the Viking that killed his rival, let the guy’s head hang from his saddle, only to get an infection from the head’s buck-teeth and die three days later.\n\nNow *that* is some autist level shit!\n\n[South Sea Bubble](https://www.youtube.com/playlist?list=PL931Bkj5KLMtJ4AMegQtekqKcCy14FCec)\n\nTLDR; \n\n1) Don’t cut off a guy’s head and tie it to a saddle bag - that’s disgusting and it’s not social distancing. \n\n2) Don’t take economic advice from a guy who’s know for: an apple falling on his head, creating a universal gravitational theory, and being COMPLETELY FUCKING INSANE! \n\n3) Finally, get a DNA for all your children. Hey, someone might be fucking your wife, but you won’t have to pay child support! Fuck the house, those monthly payments add up!\n\nEDIT: For the memes (also, a moment of silence for me and all of the brothers who have STNG and EURN shares. We will rise again, someday).",
        "created_utc": 1589082697,
        "id": "fq4ruu6",
        "permalink": "/r/wallstreetbets/comments/ggr3nr/newton_is_the_ultimate_wsb_autist/fq4ruu6/",
        "score": 122,
        "subreddit": "wallstreetbets",
        "created": 1589111497.0
    },
    {
        "author": "NoCountryForOldPete",
        "body": "Imagine telling someone important in your life that you made what most people would consider an important financial choice based on the way a shrimp moved when a stranger dropped it. Can you imagine the utter bewilderment on their face? \n\nNot gonna lie though I'm also a hair's breadth from picking up a 5/15 SPYc 285 now because of shrimp drop.\n\nEDIT: FUCK they're up .35 a piece! I would have netted ~30% in three minutes if I had listened to shrimp drop!",
        "created_utc": 1589484188,
        "id": "fqmvfro",
        "permalink": "/r/wallstreetbets/comments/gjrypm/i_finally_need_to_clean_my_counters_off_so_here/fqmvfro/",
        "score": 121,
        "subreddit": "wallstreetbets",
        "created": 1589512988.0
    },
    {
        "author": "Jsp51",
        "body": "I remember when I dropped $200 on a put and the exhilaration seeing its value go up 53% and disappointment seeing it go down to 0% next day",
        "created_utc": 1590537344,
        "id": "frxcqgj",
        "permalink": "/r/wallstreetbets/comments/gr4olc/this_is_for_our_retirement_babe/frxcqgj/",
        "score": 121,
        "subreddit": "wallstreetbets",
        "created": 1590566144.0
    },
    {
        "author": "toothbrush6969",
        "body": "imma keep it real with u chief, i have no clue what im looking at",
        "created_utc": 1588706044,
        "id": "fpl45u1",
        "permalink": "/r/pennystocks/comments/ge4169/mvis_quick_analysis_update_thoughts_in_comments/fpl45u1/",
        "score": 120,
        "subreddit": "pennystocks",
        "created": 1588734844.0
    },
    {
        "author": "cjcs",
        "body": "As someone working in Bay Area tech I’m both excited and scared shitless by this. Seems like a nice lifestyle change in the short run, but long term it means the chances are higher of me competing with someone from say, Kansas, who is willing to work for half my salary.\n\nEdit: I’m not saying that it’s necessarily a bad thing. Obviously it opens up the possibility of moving to lower COL areas which could be great. However, it adds a lot of uncertainty to the future job market, housing market, etc. that is certainly stressful.",
        "created_utc": 1590111679,
        "id": "frelrd6",
        "permalink": "/r/investing/comments/go1wpz/what_if_jobs_dont_come_back_stanford_study_says/frelrd6/",
        "score": 118,
        "subreddit": "investing",
        "created": 1590140479.0
    },
    {
        "author": "FishBowlLegend",
        "body": "2 red days? I don’t believe it. But the dog has spoken",
        "created_utc": 1590091562,
        "id": "frdkn7t",
        "permalink": "/r/wallstreetbets/comments/go440y/woof_shit_bets_doo_diligence_ep_521/frdkn7t/",
        "score": 117,
        "subreddit": "wallstreetbets",
        "created": 1590120362.0
    },
    {
        "author": "BankComplianceIdiot",
        "body": "The first rule of being extremely online is don’t ever reveal your power level to a normie. This was true before everyone saw fight club and it will be true until the internet is gone.",
        "created_utc": 1589488805,
        "id": "fqn52gy",
        "permalink": "/r/wallstreetbets/comments/gjrypm/i_finally_need_to_clean_my_counters_off_so_here/fqn52gy/",
        "score": 113,
        "subreddit": "wallstreetbets",
        "created": 1589517605.0
    },
    {
        "author": "santropy",
        "body": "When I bought puts it sky rocketed, today I bought calls and it tanked. Wtf kind of luck is this?",
        "created_utc": 1589317821,
        "id": "fqf2wyx",
        "permalink": "/r/wallstreetbets/comments/gijkkd/i_thought_this_was_america/fqf2wyx/",
        "score": 113,
        "subreddit": "wallstreetbets",
        "created": 1589346621.0
    },
    {
        "author": "Bloodier_Whisper",
        "body": "I figured it was like Dairy Queen or something like that",
        "created_utc": 1589233320,
        "id": "fqba93v",
        "permalink": "/r/wallstreetbets/comments/ghw12u/elon_has_transcended_time_space_and_county/fqba93v/",
        "score": 107,
        "subreddit": "wallstreetbets",
        "created": 1589262120.0
    },
    {
        "author": "Something_About_Mory",
        "body": "Paying 35k for a 70k car is actually genius. Probably gonna sell it right after buying for that easy x2",
        "created_utc": 1590797050,
        "id": "fs98qif",
        "permalink": "/r/wallstreetbets/comments/gt00bc/autism_is_contagious/fs98qif/",
        "score": 106,
        "subreddit": "wallstreetbets",
        "created": 1590825850.0
    },
    {
        "author": "Jalapeno28",
        "body": "Well it was certainly not a flamethrower.",
        "created_utc": 1589235245,
        "id": "fqbe08w",
        "permalink": "/r/wallstreetbets/comments/ghw12u/elon_has_transcended_time_space_and_county/fqbe08w/",
        "score": 105,
        "subreddit": "wallstreetbets",
        "created": 1589264045.0
    },
    {
        "author": "butka",
        "body": "About a week ago, I ran the numbers for all of April through the 29th (that day at the time). 40.44 of almost 45 points of April SPY gains for the month happened after hours, at the time. \n\nI don't know who's doing it, but that's the facts.",
        "created_utc": 1588893532,
        "id": "fptlkgb",
        "permalink": "/r/wallstreetbets/comments/gfhj9y/am_i_going_crazy_or_is_the_govt_keeping_the_spy/fptlkgb/",
        "score": 104,
        "subreddit": "wallstreetbets",
        "created": 1588922332.0
    },
    {
        "author": "HalfMoonCottage",
        "body": "If someone offers you $600M you take it and don’t ask any questions about interest. It’s their problem if it doesn’t work out. You got $600M.",
        "created_utc": 1590513533,
        "id": "frw0vs3",
        "permalink": "/r/wallstreetbets/comments/gqxlh1/its_our_cherished_annual_tradition_returning/frw0vs3/",
        "score": 103,
        "subreddit": "wallstreetbets",
        "created": 1590542333.0
    },
    {
        "author": "DemPokomos",
        "body": "I am a frontline physician (internal medicine hospitalist) that cares for exclusively covid patients  I’ve seen over 75 covid cases and have had 8 deaths on my services to date. The work is very hard. I just received a 10% pay cut in addition to a huge benefit reduction composing about another 10% pay cut. It definitely sucks.",
        "created_utc": 1589491498,
        "id": "fqnamgr",
        "permalink": "/r/StockMarket/comments/gjucu2/thousands_of_covid19_heroes_are_about_to_get_a/fqnamgr/",
        "score": 102,
        "subreddit": "StockMarket",
        "created": 1589520298.0
    },
    {
        "author": "mexipill",
        "body": "As someone with addictive personality, you can never overcome addiction. You can only replace it I’ve gone \n\nFood -&gt; exercise -&gt; women -&gt; drugs -&gt; legal drugs -&gt; smoking -&gt; video games -&gt; gambling -&gt; working, etc.\n\nWe’re just not wired for moderation.\n\nCan recommend women, working and exercise and booze.\n\nWould not recommend legal drugs, video games, pot, gambling.",
        "created_utc": 1588807923,
        "id": "fppru0p",
        "permalink": "/r/wallstreetbets/comments/gesc4c/deleting_everything_including_reddit_to_stop_my/fppru0p/",
        "score": 99,
        "subreddit": "wallstreetbets",
        "created": 1588836723.0
    },
    {
        "author": "asianperswayze",
        "body": "Well that is unfortunate. I enjoyed his show, but likely won't be watching it anymore. Does Spotify have video streaming? That's how I always watched it on YouTube. This is really surprising news, as it puts Rogan in less control of his own product, which he's always said is his first goal. But hey, $$$",
        "created_utc": 1589918691,
        "id": "fr62chm",
        "permalink": "/r/stocks/comments/gmuxoj/spotify_spot_buys_full_exclusive_rights_to_joe/fr62chm/",
        "score": 98,
        "subreddit": "stocks",
        "created": 1589947491.0
    },
    {
        "author": "thatdude858",
        "body": "Good. Fuck these guys, over 15,000 family homes in San Diego were converted to full-time rentals. Those are homes out of the traditional long term renter market. Further driving up prices for everyone else looking for a long term lease. \n\nThese guys operate full-time mini hotels in residentially zoned areas. That would be akin to me opening up a restaurant in my kitchen or using my garage as a mechanic shop. \n\nThey make about 2.5x a month compared to a normal long term lease so I understand why they do it but more cities like Denver are bringing down the fucking hammer on these losers.\n\nI don't mind someone renting out a spare bedroom like an empty nester family if they have the space. Denver is enforcing a strict license process with an active reporting mechanism and government agency to deter these full time mini hotels, but they allow the spare bedroom as long as someone is home.",
        "created_utc": 1588720143,
        "id": "fplv9oj",
        "permalink": "/r/investing/comments/ge4aq5/airbnb_to_lay_off_nearly_1900_people_25_of_company/fplv9oj/",
        "score": 95,
        "subreddit": "investing",
        "created": 1588748943.0
    },
    {
        "author": "ZhouVicky",
        "body": "Last Week on CNBC: Dow rises 400 points on reopening optimism\n\nToday: Dow drops 400 points on reopening jitters\n\nThey literally just changed 1 word in the headline based on whether it went up or down.",
        "created_utc": 1589314119,
        "id": "fqev5vr",
        "permalink": "/r/wallstreetbets/comments/gij7tq/what_are_your_moves_tomorrow_may_13_2020/fqev5vr/",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1589342919.0
    },
    {
        "author": "CoupleOfBitches",
        "body": "I think you are falling short on the analysis.\nFirst, the stock market is not only for primary financing, there is also people trying to change their positions.\nSecond, if you make money by doing that, and then you decide to sell o whatever, you end up with more wealth to invest in whatever you want, say a house. The point of the stock market is not only to finance debt or equity in primary offers. Think about derivatives, and how it helps comoanies to manage certain risks...\nI think this is a pretty stupid article that just give the people the \"challenging the status quo speech\" they want to read.",
        "created_utc": 1590722115,
        "id": "fs5u43s",
        "permalink": "/r/StockMarket/comments/gsi58g/what_is_the_stock_market_even_for_anymore/fs5u43s/",
        "score": 94,
        "subreddit": "StockMarket",
        "created": 1590750915.0
    },
    {
        "author": "battlesubie",
        "body": "If you Google \"Plunge Protection Team\" it says that they work exclusively in the futures market to manipulate the price.  Yes it is completely rigged AF",
        "created_utc": 1588894197,
        "id": "fptmsao",
        "permalink": "/r/wallstreetbets/comments/gfhj9y/am_i_going_crazy_or_is_the_govt_keeping_the_spy/fptmsao/",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1588922997.0
    },
    {
        "author": "Bobthebuilder24",
        "body": "Congrats, and f u. What an excellent/lucky call... But it paid off so doesn't matter",
        "created_utc": 1589416342,
        "id": "fqjwtcw",
        "permalink": "/r/wallstreetbets/comments/gjbj7y/you_can_take_the_dog_out_of_the_fight_but_you/fqjwtcw/",
        "score": 94,
        "subreddit": "wallstreetbets",
        "created": 1589445142.0
    },
    {
        "author": "Sjourn",
        "body": "My ISP asked me why I was cancelling my service with them.  I told them it was for religious reasons and that my pastor had advised me there were too many heathens on the web.  After about 5 seconds of silence and realizing they didn't have a response script for that, they said well we can certainly respect that and we'll close the account lol",
        "created_utc": 1590103918,
        "id": "fre8ffh",
        "permalink": "/r/stocks/comments/go1x5c/netflix_to_start_cancelling_inactive_customers/fre8ffh/",
        "score": 92,
        "subreddit": "stocks",
        "created": 1590132718.0
    },
    {
        "author": "theducatiguy",
        "body": "Look at the JPM $90 or $100 call for 18 Dec. You would have a break even of about $107 to $111. JPM looks like it is ready for a breakout. Strong downside resistance (support) between $90 - $100 so minimal downside risk with strong upside potential to $120 - $130. If JPM breaks out to $120 (20% upside), you are looking at 75% - 100% returns. If JPM returns to $130 range, you are looking in the 150% - 200% return range and JPM would still be $15 below its all time high. Lots of potential upside with manageable downside risk. Strong breakout potential based on last couple of days stock movement. MACD very positive! And you have 7 months to get from here to there.",
        "created_utc": 1590630737,
        "id": "fs1lq1p",
        "permalink": "/r/options/comments/grwx33/if_you_had_to_pick_10_companies_to_trade_options/fs1lq1p/",
        "score": 92,
        "subreddit": "options",
        "created": 1590659537.0
    },
    {
        "author": "18845683",
        "body": "The W Bush wars and tax cuts ended that.  We really did need stimulus back then, but what we got was unfunded tax cuts from Bush and an asset bubble (courtesy of Clinton's Fed Chair and stewardship of Mae and Mac).  Oh well, nothing to be done about it.",
        "created_utc": 1588629538,
        "id": "fphxbrb",
        "permalink": "/r/investing/comments/gdhw8b/us_treasury_seeks_to_borrow_a_record_3_trillion/fphxbrb/",
        "score": 91,
        "subreddit": "investing",
        "created": 1588658338.0
    },
    {
        "author": "DongusMcLongus",
        "body": "It is a terrible point.  It once again puts Elon in this mythical place where his Twitter outbursts are carefully orchestrated 4D chess moves to ensure world takeover.  \n\nIt's bullshit.  He is just emotionally unstable",
        "created_utc": 1589235177,
        "id": "fqbdvja",
        "permalink": "/r/wallstreetbets/comments/ghw12u/elon_has_transcended_time_space_and_county/fqbdvja/",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1589263977.0
    },
    {
        "author": "ALL_IN_LK_SHARES",
        "body": "Ethics aside, I don't think it's a good business decision to treat your employees like sh*t. It will eventually come back to haunt Amazon",
        "created_utc": 1588617525,
        "id": "fph9wky",
        "permalink": "/r/investing/comments/gdgzh4/amazons_vp_of_aws_quits_after_he_snapped_when_the/fph9wky/",
        "score": 89,
        "subreddit": "investing",
        "created": 1588646325.0
    },
    {
        "author": "CoronaProfit",
        "body": "&gt; Because it's Musk sticking it to those corrupt assholes running California who are only interested in lining their pockets with healthy citizens.\n\nHa. Thanks for that.",
        "created_utc": 1589060687,
        "id": "fq2wqda",
        "permalink": "/r/wallstreetbets/comments/ggj6sc/puts_on_cali_calls_on_texas/fq2wqda/",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1589089487.0
    },
    {
        "author": "busterwilliams",
        "body": "“When he seemed super out of it.”\n\nYou’re gonna have to be more specific.",
        "created_utc": 1589833741,
        "id": "fr2a3dj",
        "permalink": "/r/wallstreetbets/comments/gm9fp5/trump_just_said_hes_been_taking_hydroxychloroquine/fr2a3dj/",
        "score": 88,
        "subreddit": "wallstreetbets",
        "created": 1589862541.0
    },
    {
        "author": "Equulei",
        "body": "In reality, this is actually their business model.\n\nDo you realize how many people are too lazy to cancel their $10/month Planet Fitness membership and are happy to deal with continuing to be charged so long as it means they don't have to walk into the gym and listen to a spiel on why they shouldn't cancel, sign documents, etc.",
        "created_utc": 1590092557,
        "id": "frdmm9e",
        "permalink": "/r/stocks/comments/go1x5c/netflix_to_start_cancelling_inactive_customers/frdmm9e/",
        "score": 87,
        "subreddit": "stocks",
        "created": 1590121357.0
    },
    {
        "author": "centaursteve",
        "body": "That’s about 70% of my net worth. I feel like I should withdraw some. But I also feel like I can turn it into 1 Milly. I’m not stable m8.",
        "created_utc": 1589417196,
        "id": "fqjyrbu",
        "permalink": "/r/wallstreetbets/comments/gjbj7y/you_can_take_the_dog_out_of_the_fight_but_you/fqjyrbu/",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1589445996.0
    },
    {
        "author": "j_kouzmanoff",
        "body": "It is truly an honor.",
        "created_utc": 1588886286,
        "id": "fpt7mow",
        "permalink": "/r/wallstreetbets/comments/gfdv79/not_to_brag_but_looks_like_im_so_autistic_that/fpt7mow/",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1588915086.0
    },
    {
        "author": "Billie__Gates",
        "body": "r/investing: *\"Loving this solid 5.63%, the 33 million I inherited should be safe right?\"*\n\n\nr/personalfinance: *\"my wife and I make 850k a year. We have everything paid off and double that in savings. She has 300 dollars of student loans left and I think purchasing the new kia Telluride may push us off the brink into financial ruin. What should we do?\"*\n\n\nr/wallstreetbets: *\"lol my life is a joke and it's my last $2500. TSLA calls it is fuck it.\"*",
        "created_utc": 1589151739,
        "id": "fq7t95j",
        "permalink": "/r/wallstreetbets/comments/gh8iga/what_are_your_moves_tomorrow_may_11_2020/fq7t95j/",
        "score": 86,
        "subreddit": "wallstreetbets",
        "created": 1589180539.0
    },
    {
        "author": "Jowemaha",
        "body": "Musk to Musk: Oh boy when the stock hits $840 I can't wait to split\n\nAlso Musk: Wait until it hits $841.38",
        "created_utc": 1588371805,
        "id": "fp7jivr",
        "permalink": "/r/investing/comments/gbmxxr/musk_tweet_knocks_14bn_off_tesla_market_value/fp7jivr/",
        "score": 86,
        "subreddit": "investing",
        "created": 1588400605.0
    },
    {
        "author": "scooby_deux",
        "body": "You gotta be smooth about it bro, ask her what she and her friends are buying lately, which apps are fave, who's her daddy, etc.  Then tell her the magic words: that you have drugs.",
        "created_utc": 1590713146,
        "id": "fs5enr2",
        "permalink": "/r/wallstreetbets/comments/gsijxx/why_dont_women_like_me/fs5enr2/",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1590741946.0
    },
    {
        "author": "Lickmychessticles",
        "body": "Yeah seriously. It just went straight to zero. That’s hard to do.",
        "created_utc": 1589926662,
        "id": "fr6i2vq",
        "permalink": "/r/wallstreetbets/comments/gmwixr/remember_my_name/fr6i2vq/",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1589955462.0
    },
    {
        "author": "analogjesus",
        "body": "If loss porn doesn't make you feel better about your portfolio you are doing it wrong",
        "created_utc": 1589421961,
        "id": "fqk83dh",
        "permalink": "/r/wallstreetbets/comments/gjczt6/if_i_make_this_money_back_please_ban_me/fqk83dh/",
        "score": 85,
        "subreddit": "wallstreetbets",
        "created": 1589450761.0
    },
    {
        "author": "Badrush",
        "body": "MSFT has a good chance to win the code development market,\n\n* Created VSCode (arguable the best IDE)\n* Created TypeScript (used widely in web development now)\n* Bought Github and made it better (unlimited private repos now)\n* Bought npm (leading package manager)\n\nEach year Microsoft seems to be doing all the right things to woo in developers into their eco-system or simply buying the leading companies in the space.",
        "created_utc": 1590516613,
        "id": "frw7fke",
        "permalink": "/r/investing/comments/gr09bz/slack_ceo_microsoft_is_unhealthily_preoccupied/frw7fke/",
        "score": 85,
        "subreddit": "investing",
        "created": 1590545413.0
    },
    {
        "author": "badtradesguy",
        "body": "you can amazon prime it right to the landfills",
        "created_utc": 1590629329,
        "id": "fs1j95g",
        "permalink": "/r/stocks/comments/grtq32/amazon_has_a_rare_opportunity_to_snatch_up_cheap/fs1j95g/",
        "score": 84,
        "subreddit": "stocks",
        "created": 1590658129.0
    },
    {
        "author": "TheHidestHighed",
        "body": "&gt; Im just confused why /r/pennystocks has to focus on these extremely cheap pennystocks when there are real companies under $5 still that are in financial need and could grow overtime into something great\n\n\n\nBecause we're not here to support companies, we're here to make money. Full stop. I dont care if this company is going to cure cancer or if this guy lied and said it's going to cure cancer when all they've got is a new flavor of chewable vitamin, if that stock price goes up and I make a profit off of it, thats what I'm here for. Thats why the majority of us are okay with pumpers. Someone telling you when a stock is going to go up? Thats a fucking meal ticket, and for whatever reason a lot of people seem to be too good for that.",
        "created_utc": 1589408788,
        "id": "fqjeg3y",
        "permalink": "/r/pennystocks/comments/gj8h2h/uchas74124_called_it_he_was_a_pumper_after_all/fqjeg3y/",
        "score": 84,
        "subreddit": "pennystocks",
        "created": 1589437588.0
    },
    {
        "author": "yourdadmom",
        "body": "Because complaining over there only works if your truly willing to sacrifice.\n\n\nOver here in the us complaining does it in half the time,  threatening economic and legal retaliation cleans up the pesky other half.",
        "created_utc": 1589232368,
        "id": "fqb8d7d",
        "permalink": "/r/wallstreetbets/comments/ghw12u/elon_has_transcended_time_space_and_county/fqb8d7d/",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1589261168.0
    },
    {
        "author": "itachi12131415",
        "body": "Fine but if your dog is wrong you have to eat it",
        "created_utc": 1590025954,
        "id": "frathf1",
        "permalink": "/r/wallstreetbets/comments/gnntuz/the_gecko_is_dead_base_your_spy_bets_on_which/frathf1/",
        "score": 83,
        "subreddit": "wallstreetbets",
        "created": 1590054754.0
    },
    {
        "author": "DayChamp",
        "body": "I think Due Diligence. Pretty much it’s when people do their own legitimate research, hence the “DD”, and making a post to let people know what they think might happen with any given stock. It’s either that, or it  means Doug Dimmadome, owner of the dimmsdale dimmadome.",
        "created_utc": 1589955560,
        "id": "fr7s09o",
        "permalink": "/r/wallstreetbets/comments/gn2bgn/lil_yachty_album_release_next_crash_coming_soon/fr7s09o/",
        "score": 82,
        "subreddit": "wallstreetbets",
        "created": 1589984360.0
    },
    {
        "author": "fresh5447",
        "body": "Pro tip: The faster you try and make money, the faster you lose it.  \n\n\nBe patient, and take what the market gives you. Piece by piece.",
        "created_utc": 1589486924,
        "id": "fqn15no",
        "permalink": "/r/wallstreetbets/comments/gjtxjd/what_are_your_moves_tomorrow_may_15_2020/fqn15no/",
        "score": 82,
        "subreddit": "wallstreetbets",
        "created": 1589515724.0
    },
    {
        "author": "ondrvese",
        "body": "First and foremost, most likely the number of customers that have Netflix and haven't watched anything for an ENTIRE YEAR is extremely small. Also, cancelling Netflix is super easy and can be done in a few clicks. Therefore, this will not be a huge loss in revenue. \n\nSecondly, it could be a clever strategy to avoid future problems (and maybe lawsuits) with inactive accounts. Say it was found out that Netflix was charging money to people who have been deceased for a long time. Relatives might not know the passwords to accounts etc. Or say Netlfix were found in breach of data protection laws by holding user data of dormant users. \n\nFinally, it's also some good PR. Some companies are known for making it really difficult to cancel. Netflix coming out saying that they will do it automatically if you don't use their service could be used as a selling point.",
        "created_utc": 1590096756,
        "id": "frduwhy",
        "permalink": "/r/stocks/comments/go1x5c/netflix_to_start_cancelling_inactive_customers/frduwhy/",
        "score": 80,
        "subreddit": "stocks",
        "created": 1590125556.0
    },
    {
        "author": "reddev87",
        "body": "https://imgur.com/a/ddRJyhE\n\nReached a new level of degeneracy I didn't know was possible. Been taking it easy lately but just had a feeling about today. Bought a ton of 6/1 and 5/29 SPY puts about an hour after open and continued to periodically buy throughout the day. Ended up with 1800 by the time midday came around. Was down -$124,000 at one point today (that was like, -50% of entire account), felt pretty bad. EOD drop brought it all the way back to +$116,313. I hate myself rn tbh even though it worked out.",
        "created_utc": 1590696457,
        "id": "fs4if8t",
        "permalink": "/r/wallstreetbets/comments/gsdpeo/what_are_your_moves_tomorrow_may_29_2020/fs4if8t/",
        "score": 80,
        "subreddit": "wallstreetbets",
        "created": 1590725257.0
    },
    {
        "author": "ascendtofutility",
        "body": "I don't get it, everyone knows the rules, positions fuckwad",
        "created_utc": 1589511835,
        "id": "fqobxe8",
        "permalink": "/r/wallstreetbets/comments/gk12el/ok_this_time_cash_gang/fqobxe8/",
        "score": 78,
        "subreddit": "wallstreetbets",
        "created": 1589540635.0
    },
    {
        "author": "trustmeimadr",
        "body": "Yeezy, Yeezy,  what's good?  It's your boy Elon M, what's going on?  Just checking  in on you  Appreciate the love and support  The wave  is here  You a wavey  dude  anyway, so you already know  Ain't no  problem, man, the game ... You  already know how this game thing goes  Do your wave nigga  You got the official wave ©© man Just, just doing you...  Doing you , doing your wave  And keep it loopy , I know you're going to keep it loopy man  Shoutout,  just shout you out  Hollering at you man, it's all love  I appreciate the... the energy  And we here , hit the town , we do something big  We gonna make a big tsunami  up in the joint  You already know what it is, ahh \n\nwsbgod,  wsbgod in the flesh \n\nwsbgod in the flesh Elon M shoutout to WSB What's good , I see you  It's love  appreciate it  It's honor , appreciate it Ugh, wavey, baby, yeah",
        "created_utc": 1588386990,
        "id": "fp89oz5",
        "permalink": "/r/wallstreetbets/comments/gbs8x4/never_been_more_true/fp89oz5/",
        "score": 77,
        "subreddit": "wallstreetbets",
        "created": 1588415790.0
    },
    {
        "author": "shitbagspud",
        "body": "It trends like that until I try to make a fucking play on it",
        "created_utc": 1590617618,
        "id": "fs0xqb9",
        "permalink": "/r/wallstreetbets/comments/grtjqr/anyone_else_notice_that_stocks_have_been/fs0xqb9/",
        "score": 77,
        "subreddit": "wallstreetbets",
        "created": 1590646418.0
    },
    {
        "author": "gfz728374",
        "body": "Yeah it only has the largest economy in the US. Sucks for business...",
        "created_utc": 1589065468,
        "id": "fq3dudk",
        "permalink": "/r/stocks/comments/ggmuu2/tesla_prepared_to_move_out_of_california_amid/fq3dudk/",
        "score": 77,
        "subreddit": "stocks",
        "created": 1589094268.0
    },
    {
        "author": "st4n-",
        "body": "I bet it hertz",
        "created_utc": 1590697166,
        "id": "fs4jwo3",
        "permalink": "/r/investing/comments/gsdsmt/carl_icahn_lost_2_billion_betting_on_hertz/fs4jwo3/",
        "score": 77,
        "subreddit": "investing",
        "created": 1590725966.0
    },
    {
        "author": "LastForkOnTheLeft",
        "body": "Fuck it, I’m either gonna go to the moon tomorrow or I’m gonna cry. Tears don’t last forever but a trip to the moon might.",
        "created_utc": 1588798880,
        "id": "fppaplc",
        "permalink": "/r/pennystocks/comments/gesd22/mvis_hold/fppaplc/",
        "score": 76,
        "subreddit": "pennystocks",
        "created": 1588827680.0
    },
    {
        "author": "KebabDrogo",
        "body": "Honestly even 20k for a kids new car is dumb. Hes gonna wreck it. Get him a decent 10k car and tell him to save/yolo the rest.",
        "created_utc": 1590783680,
        "id": "fs8jl8b",
        "permalink": "/r/wallstreetbets/comments/gt00bc/autism_is_contagious/fs8jl8b/",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1590812480.0
    },
    {
        "author": "MillaShows",
        "body": "You’re obviously risking too much of your portfolio on a single trade. If you want to play it safe don’t even allocate more than like 5 percent of your account on one options trade. If you play the probabilities game right and do you’re research you should come out ahead",
        "created_utc": 1588798928,
        "id": "fppat20",
        "permalink": "/r/wallstreetbets/comments/gesc4c/deleting_everything_including_reddit_to_stop_my/fppat20/",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1588827728.0
    },
    {
        "author": "RandyChavage",
        "body": "tradeR. Switch the t and d and read it backwards.",
        "created_utc": 1588892368,
        "id": "fptjfhh",
        "permalink": "/r/wallstreetbets/comments/gfdv79/not_to_brag_but_looks_like_im_so_autistic_that/fptjfhh/",
        "score": 75,
        "subreddit": "wallstreetbets",
        "created": 1588921168.0
    },
    {
        "author": "USFederalReserve",
        "body": "Find yourself reading through the comments thinking \"what the fuck are these idiots actually trying to say?\" \n\n## WSB Vocab rubric\n\nalgos = I don't understand whats happening\n\nMM = I lost but wont admit its my fault\n\nflag = Price stopped moving in the direction I want, but it'll keep going in that direction\n\nprinters = people buying\n\nretail = everyone dumb but me\n\nbulls = i only buy calls like an idiot\n\nbears = i only buy puts like an idiot\n\nmanipulated = someone with more money moved the price in the direction I don't want\n\nmoon = im zoomed in on the 1m chart and it went up .3 percent\n\ndump = im zoomed in on the 1m chart and it went down .3 percent\n\nfake market = market is moving in the direction i dont like because of a conspiracy to fix the market\n\nban = your post actually made me doubt my position\n\nthis = your post confirmed my confirmation bias\n\nis anyone else playing... = i saw a ticker in another post but still need someone to spoon feed me a trade\n\ndo X, they said, it can't go tits up, they said = i decided that the best way to spend my money was to follow advice on a subreddit famous for it's massive losses\n\nresistance = the 1m candle stopped moving up for a second\n\nsupport = the 1m candle stopped moving down for a second\n\nvolatility is high = volatility is up 5% from yesterday\n\nppt = futures are up and i don't know why\n\nfutures dont matter = futures are moving in a direction i dont like \n\npajama traders = i don't know who is buying in futures, a market i've only ever watched. \n\nX are fucked = futures opened in the direction i like, so that means it'll go 5% in that direction.\n\nCNBC = cartoon network",
        "created_utc": 1589408063,
        "id": "fqjcmui",
        "permalink": "/r/wallstreetbets/comments/gj6m1o/what_are_your_moves_tomorrow_may_14_2020/fqjcmui/",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1589436863.0
    },
    {
        "author": "candymaxie",
        "body": "If SPY hits 270 tomorrow, I’ll eat my shit and post it on WSB",
        "created_utc": 1589509853,
        "id": "fqo8npp",
        "permalink": "/r/wallstreetbets/comments/gjtxjd/what_are_your_moves_tomorrow_may_15_2020/fqo8npp/",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1589538653.0
    },
    {
        "author": "cmcewen",
        "body": "Doctor here.  I’ve actually taken it as an anti malarial while providing health care in Belize.\n\nThe med doesn’t help according to studies.\n\nBut at standard oral dosing it’s unlikely to be toxic.  The people who died from it were getting really high doses I believe.  \n\nPlus I have calls so he can’t die right now.",
        "created_utc": 1589856611,
        "id": "fr3g0f3",
        "permalink": "/r/wallstreetbets/comments/gmf40p/trump_said_hes_been_taking_hydroxychloroquine_for/fr3g0f3/",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1589885411.0
    },
    {
        "author": "Geordenr",
        "body": "Joe posted about it on IG.\n\n-Spotify will post both the audio and video versions of the podcast\n-It will still be free\n-It is a licensing only deal, so it drives traffic to their app\n-He specifically states that the deal gives them NO creative control and they just want him to do his thing as he always has\n\nSpotify would be dumb to change/censor the show considering it's success. They are also a new media/entertainment company, not Fox News or MSNBC, so I don't think they will fuss over the content being \"controversial\".",
        "created_utc": 1589923954,
        "id": "fr6cu89",
        "permalink": "/r/stocks/comments/gmuxoj/spotify_spot_buys_full_exclusive_rights_to_joe/fr6cu89/",
        "score": 73,
        "subreddit": "stocks",
        "created": 1589952754.0
    },
    {
        "author": "zjz",
        "body": "Noticed some politics creeping in. Perm-banned at least 40 people. Let's keep it retarded folks, not bitter and partisan.\n\nIf you see something that is obviously just a political opinion and has nothing to do with making money... report it. \n\nDoesn't matter if you want to roll coal directly into *strong password suggestion's* manger or if you're literally a third generation Marxist Tavistock commando tasked with bringing drag queen story hour to the bible belt. If it's not a gambling strategy we don't wanna hear it.\n\nGet the fuck out. No astroturf. No political BS.",
        "created_utc": 1589319608,
        "id": "fqf6nw8",
        "permalink": "/r/wallstreetbets/comments/gij7tq/what_are_your_moves_tomorrow_may_13_2020/fqf6nw8/",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1589348408.0
    },
    {
        "author": "USFederalReserve",
        "body": "Imagine how much money this sub would make if we collectively agreed to move on past the Bear vs Bull sentiment and worked together to strategize great plays and organized them on like a shared document or something. Assign people to different sectors, give people with more experience in finances a louder voice, and moved forward with the goal for all of us to make money. Any trolls or opportunists trying to fuck over the herd can be removed and eventually weed out the bad apples.\n\nI know it wont happen, but imagine if we did. There'd be a lot of money to be made.",
        "created_utc": 1590696890,
        "id": "fs4jbuy",
        "permalink": "/r/wallstreetbets/comments/gsdpeo/what_are_your_moves_tomorrow_may_29_2020/fs4jbuy/",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1590725690.0
    },
    {
        "author": "zjz",
        "body": "Sorry, somebody broke something in automod I guess. I just woke up.. quarantine sleep schedule. Looking into it.\n\nEDIT: I got short yesterday before close stop judging me reeee",
        "created_utc": 1588361746,
        "id": "fp70c57",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp70c57/",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1588390546.0
    },
    {
        "author": "jasonhenderson23534",
        "body": "Definitely happening where I work. Telecommute has been liked so much now that management is considering making everyone permanent telecommute status and then you can optionally come into the office if you want to. They're even considering moving to a smaller office and getting rid of permanent cubicles. Instead it will be replaced with \"shared workspace\".",
        "created_utc": 1588876644,
        "id": "fpsnw0g",
        "permalink": "/r/investing/comments/gfa9ek/goldman_goldman_sachs_official_says_companies/fpsnw0g/",
        "score": 72,
        "subreddit": "investing",
        "created": 1588905444.0
    },
    {
        "author": "sm4ll2",
        "body": "Maybe I can just write it off on my taxes as a charitable donation because at this point I’m just giving people my money",
        "created_utc": 1590619303,
        "id": "fs10zqr",
        "permalink": "/r/pennystocks/comments/grtvv2/portfolio_looking_goooood/fs10zqr/",
        "score": 72,
        "subreddit": "pennystocks",
        "created": 1590648103.0
    },
    {
        "author": "originalusername__1",
        "body": "It will be interesting to see whether they find it monetarily makes sense. The upkeep and operation of your own airlines has got to be pretty damn expensive.",
        "created_utc": 1590623701,
        "id": "fs194pj",
        "permalink": "/r/stocks/comments/grtq32/amazon_has_a_rare_opportunity_to_snatch_up_cheap/fs194pj/",
        "score": 72,
        "subreddit": "stocks",
        "created": 1590652501.0
    },
    {
        "author": "HappyHereticalIAM",
        "body": "Say it with me now: \"The stock market is not the economy\"",
        "created_utc": 1588645999,
        "id": "fpipqj2",
        "permalink": "/r/options/comments/gdolv5/does_anyone_else_think_the_rally_of_the_past/fpipqj2/",
        "score": 71,
        "subreddit": "options",
        "created": 1588674799.0
    },
    {
        "author": "Sen5atus",
        "body": "Fuck this is inspiring. But I have to say it. \n\nPositions or ban fucknugget",
        "created_utc": 1590544535,
        "id": "frxpa56",
        "permalink": "/r/wallstreetbets/comments/graiik/blew_up_my_account_on_rh_i_drive_lyft_for_full/frxpa56/",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1590573335.0
    },
    {
        "author": "SlAddict",
        "body": "Just realized it was shares 😂😂\n\nBan this faggot",
        "created_utc": 1589841845,
        "id": "fr2q9pe",
        "permalink": "/r/wallstreetbets/comments/gmatz9/baidu_needs_no_diversification/fr2q9pe/",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1589870645.0
    },
    {
        "author": "NoCountryForOldPete",
        "body": "Can you imagine being on the other end of this trade? Like, if you didn't wig out halfway through the drop and try to fix your shit - selling all those puts in Feb thinking \"LOL I just made a fortune.\", watching SPY brick it to 220, developing so many new ulcers your stomach looked like a smallpox victim's face, and then a month later all of a sudden making a profit? \n\nCan you imagine the *relief*?",
        "created_utc": 1590780191,
        "id": "fs8chye",
        "permalink": "/r/wallstreetbets/comments/gsve3e/danielle_fong_aka_the_lady_who_had_2_million_in/fs8chye/",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1590808991.0
    },
    {
        "author": "GuhProdigy",
        "body": "Yea I used to think it was a problem. well not china debt specifically, but US debt in general. I didn’t realize the power of just not giving a fuck and banking on the US dollar being a fucking mythic Greek god. McDonalds forever. \n\nTLDR: Jpow strat",
        "created_utc": 1590518746,
        "id": "frwbue7",
        "permalink": "/r/wallstreetbets/comments/gqxlh1/its_our_cherished_annual_tradition_returning/frwbue7/",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1590547546.0
    },
    {
        "author": "btoned",
        "body": "*oH sO itS goIng to PluNge afTerwArds*\n\nNo but I needed to make it look like the fucking mouse.",
        "created_utc": 1590105354,
        "id": "freazhz",
        "permalink": "/r/wallstreetbets/comments/go8c64/the_day_dis_announces_park_reopenings/freazhz/",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1590134154.0
    },
    {
        "author": "asianperswayze",
        "body": "My guess is he's almost done, and this is his last big paycheck before cashing out. He's talked openly about wanting to leave California, and that would make it far less convenient for his podcast, as he hates doing it remotely.",
        "created_utc": 1589920377,
        "id": "fr65q3h",
        "permalink": "/r/stocks/comments/gmuxoj/spotify_spot_buys_full_exclusive_rights_to_joe/fr65q3h/",
        "score": 69,
        "subreddit": "stocks",
        "created": 1589949177.0
    },
    {
        "author": "itsnotshade",
        "body": "Look at it this way, rather than go through a whole semester you were able to find out you are an idiot in a few days.",
        "created_utc": 1590518951,
        "id": "frwc9w6",
        "permalink": "/r/wallstreetbets/comments/gr2yph/i_just_lost_my_tuition_money_to_htz/frwc9w6/",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1590547751.0
    },
    {
        "author": "chubby464",
        "body": "So spy to infinity got it. Print more money",
        "created_utc": 1589491602,
        "id": "fqnau4o",
        "permalink": "/r/wallstreetbets/comments/gjrypm/i_finally_need_to_clean_my_counters_off_so_here/fqnau4o/",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1589520402.0
    },
    {
        "author": "Incognadeau",
        "body": "2020.  People are watching a dog shit and staking their money on it.",
        "created_utc": 1590027307,
        "id": "fravufp",
        "permalink": "/r/wallstreetbets/comments/gnntuz/the_gecko_is_dead_base_your_spy_bets_on_which/fravufp/",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1590056107.0
    },
    {
        "author": "nafinmasjid",
        "body": "Friendly reminder that you can’t predict the future so don’t think back on potential moves you could have made or avoided. \n\nJust learn from it and move on. \n\nYour portfolio doesn’t make you who you are",
        "created_utc": 1590630786,
        "id": "fs1lt2b",
        "permalink": "/r/wallstreetbets/comments/grr84s/what_are_your_moves_tomorrow_may_28_2020/fs1lt2b/",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1590659586.0
    },
    {
        "author": "KeepenItReel",
        "body": "If you’re not losing at least $10k per trade I don’t wanna hear it pfffttt",
        "created_utc": 1589498572,
        "id": "fqnoi00",
        "permalink": "/r/wallstreetbets/comments/gjts2a/i_am_the_raccoon_of_wall_street/fqnoi00/",
        "score": 67,
        "subreddit": "wallstreetbets",
        "created": 1589527372.0
    },
    {
        "author": "cmoz226",
        "body": "This is the best sub by far.  I often find myself laughing so I hard it brings a tear to my eye. Thanks OP!",
        "created_utc": 1589335493,
        "id": "fqg0o5n",
        "permalink": "/r/wallstreetbets/comments/giplw6/did_anyone_else_panic_yolo_some_calls_at_359pm/fqg0o5n/",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1589364293.0
    },
    {
        "author": "LatinoMuyFinO",
        "body": "Some Options:\n\nBYND Calls: I shorted this today from $138 to $135. Could have made more if i had held til close but fuck it. They took a beating and am expecting a bounce back from the 132-133 level. I'll be going short term calls tomorrow for a quick scalp at open.\n\nPTON Calls: Same as above \\^ bounce back from the $40-41 level\n\nDKNG: FOMO if you want. This thing could pop to $40 or drop to $30. I won't be touching this until at least another week or so. Risky af but mad tendiez if you guess the right direction (calls/puts)\n\nCOTY: Same as above, but I expect this will hold better than DKNG since its already near rock bottom prices. Might throw a few thousand at it tomorrow in calls.\n\nSPY: i personally don't play SPY, but there is mad tendiez to be made if you get in calls at a dip (around the 295-297 range) or puts (around the 301-303 range).\n\nCCL, RCL, NCLH: Easy plays to go long on a dip, Beaten up cruise stocks that have been forming new bottoms. Easy 2x 3x bagger if you get in before a large move up in the premarket. They seem a bit overheated lately though so I would be careful of a pullback soon, in which case go short term puts.\n\nAAL, DAL, UAL, LUV, SAVE: Same as above\n\nAAPL, MSFT, AMD, NVDA: Tech saw a big hit today, might be a good spot to buy the dip. I'll be watching closely tomorrow if we continue to fall in tech at open, then I'm buying the dip for sure.\n\nBABA, TSM: GYNA stocks if you want i guess\n\n&amp;#x200B;\n\nGood luck making your parents money back you fucking autist.",
        "created_utc": 1590537988,
        "id": "frxdvjh",
        "permalink": "/r/wallstreetbets/comments/gr8jbo/parents_let_me_trade_with_their_money/frxdvjh/",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1590566788.0
    },
    {
        "author": "Damascinos",
        "body": "It hurts man it hurts",
        "created_utc": 1588987738,
        "id": "fpxqutm",
        "permalink": "/r/wallstreetbets/comments/gg60bp/this_is_still_waiting/fpxqutm/",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1589016538.0
    },
    {
        "author": "Luck038",
        "body": "I find it stupid how you get punished for being poor and trying to play the stocks. Fuckin asshole law makers / rich people",
        "created_utc": 1588707905,
        "id": "fpl7u7h",
        "permalink": "/r/RobinHoodPennyStocks/comments/ge4ggw/diamond_hands_am_i_right/fpl7u7h/",
        "score": 65,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1588736705.0
    },
    {
        "author": "goodthingshappening",
        "body": "when degenerates wake up tomorrow after sleeping and processing what just happened, they'll realize that they are now bullish on TSLA.\n\nElon mentioned Gene Wilder on twitter today.\n\nRemember at the end of Willy Wonka?  Charlie gave up his sense of entitlement and humbled himself in Willy Wonka's half-office.  That's when Willy handed him the keys to his Kingdom.\n\nThis is what Big Money is going to do with Tesla next week.",
        "created_utc": 1588393429,
        "id": "fp8iu8z",
        "permalink": "/r/wallstreetbets/comments/gbpcs2/weekend_discussion_thread_for_the_weekend_of_may/fp8iu8z/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1588422229.0
    },
    {
        "author": "WinXP001",
        "body": "I like to pound my chest and hum looking into the eyes of Leonardo DeCaprio as I drink a martini and do little keys of cocaine",
        "created_utc": 1588634383,
        "id": "fpi624v",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fpi624v/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1588663183.0
    },
    {
        "author": "TheRealTruru",
        "body": "Kk Elon is roaming baby, get the hot keys out, MARS, SEC, 420, MOON, GRIMES etc.",
        "created_utc": 1588375074,
        "id": "fp7peex",
        "permalink": "/r/wallstreetbets/comments/gbmgeq/what_are_the_odds_that_elon_musk_is_one_of_us/fp7peex/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588403874.0
    },
    {
        "author": "huyuyuyuyuyu",
        "body": "So did the Taliban loose the war considering they’re getting handed over the keys to the country in exchange for some promises?\n\nThe Taliban strong armed the US in the “peace treaty”.",
        "created_utc": 1588656850,
        "id": "fpj53aq",
        "permalink": "/r/wallstreetbets/comments/gdnell/why_the_united_states_cannot_shut_down_for_a/fpj53aq/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588685650.0
    },
    {
        "author": "No_volvere",
        "body": "You lose your keys and cut off all your hair, another relaxing evenings at home.\n\n2 days later you get a full socket set and a 12pk of chocolate bunnies from Amazon.",
        "created_utc": 1588359529,
        "id": "fp6vyhm",
        "permalink": "/r/wallstreetbets/comments/gbk0n4/tesla_ceo_elon_musk_says_stock_price_is_too_high/fp6vyhm/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588388329.0
    },
    {
        "author": "zurunga",
        "body": "I own that house but if you send me a money order of 100k I will let you walk away with the keys; can’t afford the property taxes in SF anymore.",
        "created_utc": 1588419183,
        "id": "fp99auo",
        "permalink": "/r/wallstreetbets/comments/gbxof0/youre_going_to_tell_me_were_not_in_a_housing/fp99auo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588447983.0
    },
    {
        "author": "Thenattylimit",
        "body": "Trading is gambling. No one really knows whats gonna happen day to day, minute to minute. What do you do when Musk randomly tweets out his stocks too high and it loses 10% - who predicts that???!? You may win big but you will also lose big. 78% of day traders lose money over the long term which is probably very similar to gambling addicts. \n\nDCA stands for dollar cost averaging. Basically what it means is just buying small amounts of a stock at regular intervals. This allows you to on average get a good price for the stock. It's been shown that trying to time the bottom of the market is basically impossibly difficult so don't even try, you'll lose more money than you gain. So let's say you've got 1k to invest a month, just out that in every month. Don't save it all up waiting for the bottom of the market.\n\nBasically don't try and be a smart ass and just invest for the long term. The 200iq boys on wall street with their AI and trading algorithms don't consistently predict the market so what chance have you got? One of the keys to being smart is to realise when you're not that smart and plan accordingly. That's what dca does.\n\nHope that helps.",
        "created_utc": 1588490780,
        "id": "fpc8205",
        "permalink": "/r/StockMarket/comments/gbgul9/what_stocks_are_on_your_radar_for_next_week/fpc8205/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1588519580.0
    },
    {
        "author": "BarbarX3",
        "body": "I understand the technology and it's uses. I just don't see any value in it as it is used now in the form of currency. Why would IoT need crypto to work? IoT already works without crypto. Why would coud services need crypto? It already works without it.  Why would any company use a crypto over which they have no control as part of running their business? \n\nTechnology wise I see value in a shared ledger which cannot be modified by any one party. But this can also easiliy be accomplished by other means, you don't need a coin or smart contract for that. Giving up control is against the interest of businesses, so I don't see it going anywhere big other than the occasional hype. Signing datafiles with company or personal encryptions keys is all you need, and thats been around for a long time, and still barely used as much as it could.\n\nI've used bitcoin before it became popular (yes really, you had the menu option to get new coins in the original client). I liked the idea, but don't see value in it. The hype and hope for uses keeps going though, and I guess there's value in that?",
        "created_utc": 1588600980,
        "id": "fpgedrq",
        "permalink": "/r/investing/comments/gd82oc/my_stock_study_watchlist_would_appreciate/fpgedrq/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588629780.0
    },
    {
        "author": "trump_sucks_we_know",
        "body": "Yeah, but those shiny keys/",
        "created_utc": 1588632757,
        "id": "fpi36j2",
        "permalink": "/r/wallstreetbets/comments/gdj2dv/what_are_your_moves_tomorrow_may_05_2020/fpi36j2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588661557.0
    },
    {
        "author": "Dyunder",
        "body": "lol why doesn't he have a passcode on that that notifies his CFO so they have to turn keys at the same time",
        "created_utc": 1588365169,
        "id": "fp76xzl",
        "permalink": "/r/wallstreetbets/comments/gbpcs2/weekend_discussion_thread_for_the_weekend_of_may/fp76xzl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588393969.0
    },
    {
        "author": "Duckbutter1138",
        "body": "Don't these things take years to make? Do keys just give some chemicals to people! Let's just try without proper testing. Why not? What could go wrong?",
        "created_utc": 1588563560,
        "id": "fpf7czv",
        "permalink": "/r/stocks/comments/gcs76q/gilead_ceo_says_remdesivir_available_to/fpf7czv/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588592360.0
    },
    {
        "author": "AsparagusFTW",
        "body": "Watching this now, I have a feeling his kids will be taking his car keys by end of day.",
        "created_utc": 1588457026,
        "id": "fpaw9qu",
        "permalink": "/r/wallstreetbets/comments/gcevel/never_bet_against_america_warren_buffet_on/fpaw9qu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588485826.0
    },
    {
        "author": "absoluteboredom",
        "body": "Sex is great from what I hear. But very rarely is it worth the batshit aftermath. She goes through your phone while you sleep, sees a text from a girl and loses her shit, keys your car, throws your keys in the garbage disposal and tries to set your house on fire right after she cuffs your passed out ass to the bed. \n\nDidn’t happen to me, but it did happen to a close friend of mine. \n\nIn lighter news he said she was an absolute animal in bed. Also, the text was from his mother asking how he was doing. But she was in another country and forgot about time difference.",
        "created_utc": 1588400590,
        "id": "fp8rhrl",
        "permalink": "/r/wallstreetbets/comments/gbs8x4/never_been_more_true/fp8rhrl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588429390.0
    },
    {
        "author": "zzdark",
        "body": "Ahh to be rich and successful you just gotta come from family money that is the key to success. It's like they give you the keys to the Ferrari and all you gotta do is take it to the dealership for maintenance.",
        "created_utc": 1588682190,
        "id": "fpjvmly",
        "permalink": "/r/stocks/comments/gd24bd/how_did_warren_buffett_increase_his_net_worth/fpjvmly/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588710990.0
    },
    {
        "author": "FLakIsBack",
        "body": "The rug only gets pulled when average Joe who doesn't own a computer jumps on the bandwagon for some free money, after it ends up on CNBC. \n\nI bought a $100 worth at $1 but lost my keys so whatever",
        "created_utc": 1588609991,
        "id": "fpguzbq",
        "permalink": "/r/wallstreetbets/comments/gda3mk/our_favorite_holding_period_is_forever_warren/fpguzbq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588638791.0
    },
    {
        "author": "goodthingshappening",
        "body": "At the end of Willy Wonka it is was only when Charlie gave up his sense of entitlement and humbled himself that Willy Wonka handed Charlie the keys to the kingdom.",
        "created_utc": 1588435966,
        "id": "fp9wf6o",
        "permalink": "/r/wallstreetbets/comments/gbpcs2/weekend_discussion_thread_for_the_weekend_of_may/fp9wf6o/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588464766.0
    },
    {
        "author": "Saboral",
        "body": "So Ambien is way Tesla’s don’t have keys!",
        "created_utc": 1588415850,
        "id": "fp965yy",
        "permalink": "/r/wallstreetbets/comments/gboxm6/elon_and_the_ambien_walrus/fp965yy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588444650.0
    },
    {
        "author": "baummer",
        "body": "Someone needs his Twitter keys taken away. Again.",
        "created_utc": 1588369346,
        "id": "fp7ex21",
        "permalink": "/r/stocks/comments/gbk13c/elon_musk_says_stock_price_is_too_high_shares/fp7ex21/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588398146.0
    },
    {
        "author": "Roxorek",
        "body": "GDX saved ma ass",
        "created_utc": 1588366888,
        "id": "fp7aaos",
        "permalink": "/r/wallstreetbets/comments/gbpcs2/weekend_discussion_thread_for_the_weekend_of_may/fp7aaos/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1588395688.0
    },
    {
        "author": "LMAY75",
        "body": "Do keep in mind we just recently broke over the 200 MA. A retracement back to it would be pretty expected (and very bullish). Not saying you are wrong just something to keep in mind",
        "created_utc": 1588365483,
        "id": "fp77jvi",
        "permalink": "/r/wallstreetbets/comments/gbpub8/bearish_confirmation_of_change_in_trend/fp77jvi/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1588394283.0
    },
    {
        "author": "CocaineJazzRats",
        "body": "When the pimp's in the crib ma",
        "created_utc": 1588348283,
        "id": "fp693lo",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp693lo/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1588377083.0
    },
    {
        "author": "aybud777",
        "body": "baba calls for june, over 5M in sept. calls were placed three days ago. BABA trading 1% from its 200 MA, earnings within 20 days, literally the best play rn.\n\nOR...oil tankers DHT, EURN report next week.",
        "created_utc": 1588359369,
        "id": "fp6vn1w",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp6vn1w/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588388169.0
    },
    {
        "author": "issa_mimzy",
        "body": "hey MA! bring the meatloaf",
        "created_utc": 1588358935,
        "id": "fp6urct",
        "permalink": "/r/wallstreetbets/comments/gbnqyz/i_just_had_a_profound_vision_about_stonks/fp6urct/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1588387735.0
    },
    {
        "author": "ahypeman",
        "body": "AAPL didnt rip on the back of anyone else's earnings like FB did off GOOG's earnings. So FB gets punished harder after its own earnings. If FB hadnt ripped from GOOG then it would not have tanked as hard after its own good earnings.\n\nSame thing happened with V because of MA",
        "created_utc": 1588359691,
        "id": "fp6wa0y",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp6wa0y/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588388491.0
    },
    {
        "author": "Hailkahukuhail",
        "body": "BHC, MU, DIS, LMT, BA, V, MA, NPSNY and MSFT. These are core. And my dark horses are SDC, BBRW and INVE.",
        "created_utc": 1588368834,
        "id": "fp7dyw9",
        "permalink": "/r/wallstreetbets/comments/gbkzji/airline_industry_question/fp7dyw9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588397634.0
    },
    {
        "author": "dmd2540",
        "body": "Does Mastercard still invest in R&amp;D?",
        "created_utc": 1588361406,
        "id": "fp6znv7",
        "permalink": "/r/investing/comments/ft3tgh/vgt_why_no_fb_google_or_amazon_in_top_10_holdings/fp6znv7/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588390206.0
    },
    {
        "author": "OliverRock",
        "body": "What's the best resource to get better at swing trading?  \n\nLike many other around the world I've been more active in my investment funds recently. I've always been a set it and forget it investor but I'm finding I actually really enjoy seeing how markets move. I like math and sociology so I've been learning tons about the market. I was wondering if anyone could recommend some resources (Youtube videos, free courses, podcasts) to get better at trading. My position right now is about half cash half tech stocks I want to use about 1/2 of that cash to swing trade mostly for fun and learning.\n\nI've made a few trades and learned a lot about options and some intro technicals like 3 line MA. That's as far as I am right now.",
        "created_utc": 1588354041,
        "id": "fp6ksh4",
        "permalink": "/r/investing/comments/gbh0y3/daily_advice_thread_all_basic_help_or_advice/fp6ksh4/",
        "score": 1,
        "subreddit": "investing",
        "created": 1588382841.0
    },
    {
        "author": "ShawnHans007",
        "body": "Calls on visa and MasterCard",
        "created_utc": 1588330360,
        "id": "fp5i9gi",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp5i9gi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588359160.0
    },
    {
        "author": "BF5lagsssss",
        "body": "&gt;Can you explain this? The US industry has been outsourced a lot, how is it industrially powerful?\n\nYes the US produces and licenses several of the most critical technologies around the world. Take semiconductors, the EDA semiconductor design market is controlled by primarily by two American companies Cadence and Synopsys. Without it chips couldn't even be designed. In semiconductor equipment manufacturing USA has KLA Tencor, AM and Lam which are essential to producing chips. This is just one example in the semiconductor industry and the US has several other companies producing high value content and products for the world.\n\nThe US only outsource the low value and admin stuff to developing countries to do as these products are of low Gross Margin or low cost contribution. This makes sense commercially since given future industry is driven by high value industries like high technology manufacturing and digital computing so naturally firms will focus more on . This is also one of the core reason why Trump and China hawks want to fight China as they seek to deny or slow China's ability to domestically produce high value goods such as semiconductors and supercomputers. \n\nIn fact US components are so important that you can even see their impact on companies like Huawei who has stated that it is hard to live without US components. This is why US is industrially powerful. Their products are critical to building modern day technologies and without it it is very hard to live without them.\n\n&gt;It's mostly services, but I don't see how one can say the US doesn't rely on imports with a straight face.\n\nYes but imports to the US are mainly low value products . Low value products have low cost contribution and the main Gross Profit is retained by the firm who outsources the production of the product. US doesn't really rely on imports in the sense that the US does not need to import any high tech products from anywhere as the US has the domestic capability to mass produce high tech goods efficiently.\n\nLook at China they rely on imports to survive. Without semiconductors the Chinese technology space will literally come to a grinding halt. This has been mentioned by Jack Ma before when he was in Japan where he referenced the US control over core technologies like semiconductor. This is why the US does not rely on imports since they are technologically self sufficient.",
        "created_utc": 1588327967,
        "id": "fp5fz8l",
        "permalink": "/r/wallstreetbets/comments/gavolm/bulls_never_die/fp5fz8l/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588356767.0
    },
    {
        "author": "OkayishComputer",
        "body": "They only had one medical retail location in PA. Not a big deal for them. Seems they’re focusing on where they have vertical integration (MA, IL, MI). A smart move in my book.",
        "created_utc": 1588344029,
        "id": "fp611ab",
        "permalink": "/r/weedstocks/comments/gbhjl5/4front_ventures_announces_22_million_us_of_new/fp611ab/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1588372829.0
    },
    {
        "author": "swirlypooter",
        "body": "Visa is good too. But MA has a little better ROI according to the reports I have.",
        "created_utc": 1588361041,
        "id": "fp6yxy4",
        "permalink": "/r/stocks/comments/gblhn8/long_term_stock_investments_for_coronavirus/fp6yxy4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588389841.0
    },
    {
        "author": "wd1998313",
        "body": "I am just talking bs, don't bully me if I ma wrong",
        "created_utc": 1588353917,
        "id": "fp6kjfn",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp6kjfn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588382717.0
    },
    {
        "author": "Kbarbs4421",
        "body": "Good point.  My initial reaction was disappointment and a bit of confusion regarding the PA divestment.  If what you say is true about the limited PA footprint (haven't revisited it), then eliminating that distraction and focusing their attention on vertically integrated operations in WA, IL, MA and MI (?) could well be a smart move.",
        "created_utc": 1588365860,
        "id": "fp78ahr",
        "permalink": "/r/weedstocks/comments/gbhjl5/4front_ventures_announces_22_million_us_of_new/fp78ahr/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1588394660.0
    },
    {
        "author": "UpgradeNotSure",
        "body": "I like MA, V, AXP, RTX, BA, VOO to name a few. I’m undecided whether RTX and BA carry more risk. At face value they seem like they would but I also don’t think the govt would let either go downhill.",
        "created_utc": 1588366510,
        "id": "fp79kba",
        "permalink": "/r/StockMarket/comments/gbogv5/reminder_to_everyone_option_trades_are_risky_now/fp79kba/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1588395310.0
    },
    {
        "author": "SwagState",
        "body": "AAPL   MSFT   FB   INTC   IBM   ORCL   RTX   BA   HON   MMM   GM   CAT   JPM   BAC   C   MA   V   DFS   ODFL   UPS   UNP   DAL   LUV   EXPE   DIS   MCD   SBUX   YUM   DG   CVS   WMT   SPG   HD   NUE   IP   DOW   CVX   XOM   KO   KHC   PG   VFC   NKE   UNH   PFE   JNJ   CMCSA   TMUS   VZ   CSCO\n\n\n50 stocks. 50 years.",
        "created_utc": 1588340247,
        "id": "fp5ukxk",
        "permalink": "/r/stocks/comments/gbhjm8/ive_come_to_realization_that_long_term_is_way/fp5ukxk/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588369047.0
    },
    {
        "author": "heartstesler",
        "body": "Iweak economy with high employment and low consumer spending environment will be threat to MasterCard Visa and Amex revenue \n\nThese stocks are not recession proofs\n\nThese will come down",
        "created_utc": 1588331761,
        "id": "fp5jnef",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp5jnef/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588360561.0
    },
    {
        "author": "24901Miles",
        "body": "He's basically saying to the government that they don't actually control the market as much as they act like they can. One idiot can tweet something and bring down every index. With everything so stupidly connected by HFTs, the markets are weak to interference. Wait until a foreign entity attacks us by spreading fake market news, or Jack Ma tweets some shit about Amazon",
        "created_utc": 1588354178,
        "id": "fp6l2ei",
        "permalink": "/r/wallstreetbets/comments/gbk0n4/tesla_ceo_elon_musk_says_stock_price_is_too_high/fp6l2ei/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588382978.0
    },
    {
        "author": "swirlypooter",
        "body": "Today is a great day for $AMZN\n\nAlso consider\n\n* $MSFT\n* $GOOGL\n* $AAPL\n* $MCD\n* $MA\n* $DPZ\n\nMany if not all of these companies have low debt or have a lot of cash flow, good fundamentals, and will survive COVID.",
        "created_utc": 1588354298,
        "id": "fp6lbap",
        "permalink": "/r/stocks/comments/gblhn8/long_term_stock_investments_for_coronavirus/fp6lbap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588383098.0
    },
    {
        "author": "SMUporridge",
        "body": "If MA and SPY could go back to even on the day I'd be so happy.\nMA 270/280c 5/1\nSPY 288/293c 5/1",
        "created_utc": 1588342147,
        "id": "fp5xq88",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp5xq88/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588370947.0
    },
    {
        "author": "GRINZ_DOCTOR",
        "body": "V and MA. No doubt.",
        "created_utc": 1588342122,
        "id": "fp5xopu",
        "permalink": "/r/stocks/comments/gbhjm8/ive_come_to_realization_that_long_term_is_way/fp5xopu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588370922.0
    },
    {
        "author": "hanily2020",
        "body": "And I can be your ma ;) still trying to buy a penis.",
        "created_utc": 1588324125,
        "id": "fp5cekd",
        "permalink": "/r/wallstreetbets/comments/gb36lx/what_are_your_moves_tomorrow_may_01_2020/fp5cekd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1588352925.0
    },
    {
        "author": "ShagBiscuit",
        "body": "I'm sitting on a lot of positions, but my most funded ones which I plan on keeping for a long time are:  \n\n\nSPY, NVDA, MA, VOO, DFS, MSFT, ETN, MMM, C, COST",
        "created_utc": 1588349523,
        "id": "fp6bkw0",
        "permalink": "/r/stocks/comments/gbhjm8/ive_come_to_realization_that_long_term_is_way/fp6bkw0/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588378323.0
    },
    {
        "author": "MovieMuscle25",
        "body": "Why MA and not Visa?",
        "created_utc": 1588360953,
        "id": "fp6yrlt",
        "permalink": "/r/stocks/comments/gblhn8/long_term_stock_investments_for_coronavirus/fp6yrlt/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588389753.0
    },
    {
        "author": "3STmotivation",
        "body": "MSFT, GOOG, DIS, MA, PYPL, GLPG",
        "created_utc": 1588340040,
        "id": "fp5u9bp",
        "permalink": "/r/stocks/comments/gbhjm8/ive_come_to_realization_that_long_term_is_way/fp5u9bp/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1588368840.0
    }
]