[
    {
        "author": "kosmikpoo",
        "body": "Skyworks and qorvo",
        "created_utc": 1638555004,
        "id": "hn3g6ij",
        "permalink": "/r/stocks/comments/r7yl4f/biden_official_we_are_imploring_congress_to_pass/hn3g6ij/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638583804.0
    },
    {
        "author": "Immediate-Assist-598",
        "body": "Many stocks are a fraud and pyramid schemes too, it depends. I got suckered into both the Y2K and the cannabis legalization hysterias and made some money at first but then lost about 40% before I got out.  One of my stocks went to zero after Apple cancelled its contract with them.   Re-watch THE WOLF OF WALL STREET and pretend it is 2019 and they are hawking cryptos instead of mostly worthless penny stocks.  My making mistakes earlier in my life, including being taken in by a few scam artists, I came to guard my rational thought and caution when it comes to investing.  It is also like the old tortoise vs hare analogy. Or only fools rush in.  -- My first stock trade was a winner and I made $5000 in one day. I was 28 years old and I thought \"boy am I smart this is easy\" so I kept playing and ended up losing $50,000 because I ignored all the warning signs and had blind faith.  Even blue chips can sometimes be a death trap.  Enron and GE were two I owned at one time. Thank God I sold them. Enron went to zero.  Then, in 2008 at the pits of the economic collapse, I had no money except $250,000 I had borrowed against my home. I saw the market down 70%. It was like the reverse of the crypto craze all the \"experts\" on CNBC were saying \"stocks are worthless, could all go to zero\". I thought \"that is a glaring buy signal\". So I took my whole $250000 and bought. What did I buy? I looked around at young people I knew and thought, what are the two things they will never surrender even if they are unemployed and so are their parents?  Apple and Whole Foods (cheaper than restaurants).  Well to make a long story short, I doubled my money on those two, paid off all debts, Amazon bought Whole Foods giving a %500 profit , but I kept buying Apple on every dip, especially when Steve Jobs died and the Street was writing off Apple, accumulating moreand more. Why? Because everywhere I went I saw that the iPhone was the #1 essential in peoples'  lives or aspirational brand.  I am now up 6 million on AAPl alone.  Then 18 months ago during the pits of the shutdown I went to the Caribbean to retire and realized the real estate market was dead because no one was traveling and there were no customers except for private islands.  So I started making lowball offers and got two cool condos at about 25% off.   The keys were timing. When everyone else is selling (unless it is for very good reasons) that is the time to buy,  but only buy something REAL with deep value behind it.  Also remember, avoiding losses is the same as making gains. So if in doubt go with capital preservation and income.  A safe undervalued dividend stock. Like four I can recommend right now: T, VZ, VIAC and SWKS. Those were the four best bargains I could find and even if they go down (which they have until very recently) you get paid to wait and every dog has its day. PLus I don't need the cash so I can afford to sock money away in a dividend paying dog which is temporarily out of all St favor.  But Apple, that is the perfect investment.  Because nobody makes more money than they do or products that people are so devoted to and dependent upon, and I see no real competition for Apple for at least a decade so I can sleep well at night.  But cryptos?  Wouldn't touch any of them a ten foot pole because just like those penny Y2K stocks, they are not real, with no book value, so they could go to zero.  Don't think it cannot happen to you just because other people are bowing at the crypto altar.  And if a severe sell-off comes, remember you want to be the first to cash out, not the last.",
        "created_utc": 1638742324,
        "id": "hndq37i",
        "permalink": "/r/investing/comments/r9ew8d/surest_way_to_lose_your_money_is_to_be_in_cryptos/hndq37i/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638771124.0
    },
    {
        "author": "88crypto",
        "body": "Avgo, swks, qrvo, qcom",
        "created_utc": 1638413281,
        "id": "hmvspj9",
        "permalink": "/r/wallstreetbets/comments/r6p244/what_are_your_moves_tomorrow_december_02_2021/hmvspj9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638442081.0
    },
    {
        "author": "Immediate-Assist-598",
        "body": "There are some glaring bargains amongst class A companies now whose stocks are down 25% from a year ago while their businesses are doing more or less fine.   I have most of my money in AAPL, 90% of it but I trimmed a little last week on the spike and bought dividend paying deep value deeply oversold VZ, T, VIAC and SWKS.   No one can predict anything but sooner or later every deeply undervalued oversold Class A stock gets a new round of upgrades and suddenly becomes popular again, so I can wait.  VIAC may be the most undervalued stock in the market.  Take a look. PLus I get paid well to wait here. These fojur stocks average about a 4% dividend.",
        "created_utc": 1638477342,
        "id": "hmz7en4",
        "permalink": "/r/investing/comments/r74527/daily_general_discussion_and_spitballin_thread/hmz7en4/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638506142.0
    },
    {
        "author": "Irinck",
        "body": "HPQ - Value Stock\n\nAMGN - Value Stock\n\nSWKS - 5G and currently undervalued\n\nINTC - Turnaround Candidate\n\nADSK - Metaverse &amp; Moat Stock\n\n&amp;#x200B;\n\n\\#plsroastme",
        "created_utc": 1638569688,
        "id": "hn4etg2",
        "permalink": "/r/ValueInvesting/comments/r80w4c/what_are_your_top_5_holdings/hn4etg2/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638598488.0
    },
    {
        "author": "Immediate-Assist-598",
        "body": "Good move. You quit crypto a winner, congrats. Now never look back or get in again even if it falls 75% and looks like a bargain.   it isn't, there is no such thing as a crypto bargain.  Because the assets have no book value.  PLus they are about to be heavily regulated and maybe even banned by more than just China.  -- As for real estate, the market is pretty fully valued now as covid compelled people to buy their dream hideaways.  Rental property?   \n Being a landlord isn't for everyone and can be a real hedache. I rented out to three bad tenants in my life, two were con artists and the third committed suicide in my home.  --  I dont know. I am neutral on real estate now. I bought two condos during the pits of the covid shutdown and am set, for a 20% discount, then sold my LA home for a good price and put that into AAPL stock and made an extra $200,000 since then.  So that is my story.  It depends where you want to be and what you want to do there. Condo or home, single or family?  USA or some other country?   If possible, I would avoid hot real estate markets and buy only when there is a drought of buyers.  But I am a bargain hunter by nature,  As for tips, well I am rich off AAPL which I still recommend, but I also diversified a bit into four stocks which pay nice dividends, supplying me with a good income.  THose four seemed fairly cheap when I bought them but they have gone down 10-20% since, however they started turning around just in the past few sessions.  So maybe two weeks ago was the bottom. Sure seems like it. Anyway, those stocks are VIAC, T, VZ and SWKS.  I see no reason why any of them should fall further , all have major upsides and pay good divvies, and VIAC fell so far it went below its book value. It was the #1 stock in the market on Friday though, so hopefully that continues.",
        "created_utc": 1638737887,
        "id": "hndebev",
        "permalink": "/r/investing/comments/r9ew8d/surest_way_to_lose_your_money_is_to_be_in_cryptos/hndebev/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638766687.0
    },
    {
        "author": "solidmussel",
        "body": "Pretty much every chip manufacturer is handsomely profitable.   Many are in the top 100 companies by market size \n\nLook at nvda, intc, qcom, amd, tsm, swks, avgo, etc.",
        "created_utc": 1638548942,
        "id": "hn30nxe",
        "permalink": "/r/stocks/comments/r7yl4f/biden_official_we_are_imploring_congress_to_pass/hn30nxe/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638577742.0
    },
    {
        "author": "Immediate-Assist-598",
        "body": "T i at the bottom now.  I bought 5000 shares yesterday, what a bargain and they have to pay me 9% one quarter then 5% after that.  Also bought VZ, VIAC and SWKS.  What bargains.",
        "created_utc": 1638502051,
        "id": "hn0ty1j",
        "permalink": "/r/investing/comments/r74527/daily_general_discussion_and_spitballin_thread/hn0ty1j/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638530851.0
    },
    {
        "author": "SpliTTMark",
        "body": "His channel is somewhat cringy but no one can have all winners\n\nHe has really good cost basis'es on a lot of his funds. Like elf @7 or Upwork @10 or swks @75 plent13 @1\n\nAnd small caps are getting slaughters..\n\nCoinbase IPO was stupid...",
        "created_utc": 1638751088,
        "id": "hnebj5m",
        "permalink": "/r/stocks/comments/r9rgpl/youtubers_and_investing_be_careful/hnebj5m/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638779888.0
    }
]