[
    {
        "author": "Dpad124",
        "body": "Other can answer with the more intangible items. From a financial perspective, let's take a look at the 10K's of each company (since this is the last filing of NVDA). Over the last fiscal year, here are some key stats:\n\nRevenue:\n\nNVDA: $16.7B / AMD: $9.7B (hrmmm this seems closer than 4x like you mention, more like 1.7x)\n\nGross Profit:\n\nNVDA: $10.3B / AMD: 4.3B (Interesting, it appears NVDA has better margins so now we are close to 2.5x)\n\nIncome Before Taxes:\n\nNVDA: $4.4B / AMD: $1.3B (Now we are all the way up to 3.4x, so getting close to 4x. This shows AMD has lower margins, and higher comparative expenses).\n\nNet Income:\n\nNVDA: $4.3B / AMD:$ 2.5B (Woah we dropped down to 1.72x. If we look, this is due to AMD having carryover losses and Tax carry forwards that reduced AMD's tax burden and net them returns instead of paying taxes hence why they have more net income than they earned).\n\nSo what can we conclude on this? Don't just look at revenue. A company can have an insane amount of revenue, but if they are inefficient or have too many operating expenses, they could potentially have  little to no revenue. Next, comparatively, if we ignore the losses and credits AMD took to boost their net income, NVDA is actually coming close to that 4x difference we are seeing in valuation. That and all the intangibles others are mentioning, and AMD's recent pull back, attribute to the difference.",
        "created_utc": 1620097300,
        "id": "gwv44a2",
        "score": 188,
        "subreddit": "stocks",
        "created": 1620126100.0
    },
    {
        "author": "oregon_forever",
        "body": "It's year 2030. SPY is at $1500 and AMD is still struggling to break $78 and PLTR finally made it to $23.",
        "created_utc": 1620332003,
        "id": "gx6x6sk",
        "score": 160,
        "subreddit": "wallstreetbets",
        "created": 1620360803.0
    },
    {
        "author": "xsubkulturex",
        "body": "Compare growth, revenue and market cap of AMD with Nvidia and it'll give you an idea of how undervalued AMD currently is.",
        "created_utc": 1620132590,
        "id": "gwwfov4",
        "score": 140,
        "subreddit": "wallstreetbets",
        "created": 1620161390.0
    },
    {
        "author": "HellStaff",
        "body": "Wait till you see my AMD june calls",
        "created_utc": 1620142644,
        "id": "gwx2e5e",
        "score": 136,
        "subreddit": "wallstreetbets",
        "created": 1620171444.0
    },
    {
        "author": "shawman123",
        "body": "There is no question that Qualcomm will be around 10+ years. They have moats in many segments and are now making AR/VR chips which are going to be huge. There will be negative catalysts like Apple making its own modem(still have to pay licensing to QCOM for using 3g/4g if I am not wrong). Exynos with AMD GFX might at one point end up better than QCOM chips and low/medium end soc's are in competition against Mediatek. Still they should be around for a long time.",
        "created_utc": 1622307719,
        "id": "gzvymuh",
        "score": 103,
        "subreddit": "investing",
        "created": 1622336519.0
    },
    {
        "author": "wrighterjw10",
        "body": "Bingo.  Go ahead and look 2-3 years back when someone else posted this exact same thing...\n\n&amp;#x200B;\n\nMSFT was $98 and people were questioning if it would ever break $100.\n\nAMD was around $10 and people said Intel would crush it.",
        "created_utc": 1620136629,
        "id": "gwwnyr2",
        "score": 95,
        "subreddit": "stocks",
        "created": 1620165429.0
    },
    {
        "author": "Kooly1776",
        "body": "AMD should be way over $100.",
        "created_utc": 1620132396,
        "id": "gwwfbxr",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1620161196.0
    },
    {
        "author": "Rock_it_Scientist",
        "body": "Looks like meat is back on the menu boys!\n\nI am long AMD but I feel that $4B in R&amp;D can do more for the company than artificially inflating the stock price.",
        "created_utc": 1621442234,
        "id": "gypqz2l",
        "score": 84,
        "subreddit": "wallstreetbets",
        "created": 1621471034.0
    },
    {
        "author": "trash-trader",
        "body": "the number of individuals on this thread betting against burry is remarkable. Stop being so emotional about it, I can guarantee you there is nothing emotional about his position and it’s purely calculated (unlike my AMD calls - go up!!)",
        "created_utc": 1621283243,
        "id": "gyhl7p7",
        "score": 81,
        "subreddit": "wallstreetbets",
        "created": 1621312043.0
    },
    {
        "author": "Wojofoo",
        "body": "AMD hasn't participated in any of the market rally over the last 8 months, but you damn well better believe they will participate in the decline! #shortedtooblivion",
        "created_utc": 1620128851,
        "id": "gww9a4s",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1620157651.0
    },
    {
        "author": "GoodDayToPlayTheGame",
        "body": "Owning AMD for these last 6 months has been a frustrating venture.",
        "created_utc": 1620684182,
        "id": "gxnsdcd",
        "score": 70,
        "subreddit": "stocks",
        "created": 1620712982.0
    },
    {
        "author": "murderbits",
        "body": "Fear of inflation is inducing a rotation out of growth. Tech (especially FAAAN/MG-ish stocks) are seeing  TREMENDOUS earnings reports and then either immediately staying flat or seeing a steep discount. AMD not only had a great quarter, but changed guidance from 37% growth for the year to 50% growth. The result? AMD is down 15% since the high on their earnings day. Same with MSFT, AAPL, GOOG, AMZN, and even NVDA. PLTR is going with the market.  \n\n\nAdditionally, PLTR has no reason for price to increase right now, outside of the market/sector drop. They are significantly over-priced. I don't think the price is likely to drop down to a saner value. I think it's more likely to hold and stick around 20-30 *until the fundamentals  rise to justify the price*.  Everyone suspects they should have a pretty good quarter. That'll be good. They'll need several of those consecutively for the market to respond. Every few new big contracts and news stories, they gain another analyst adding them to their coverage. Enough really great quarters of growth (say, another year worth) and the market will start responding.  \n\n\nThose of us invested now -- and those like Cathie Woods -- are playing the hunch and taking the risk that we are recognizing the potential of the company before the rest of the market has caught on to it. While they're waiting for results to move the price, we're betting on results. We could be wrong. Probably not, but we could be.  \n\n\nAnyway, I have been calling this for weeks. Nobody -- not even the CEO -- has implied that PLTR is a short term profit play. Everyone knows you hold PLTR for the long term, if you have conviction in the company. And yet, you have all these people going \"HURR DURR PLTR TO THE MOON ON EARNINGS DAY!\" and \"HURR PLTR 50/100/150 by END OF YEAR\".  \n\n\nFor weeks, I've been saying this: ***PLTR will drop to 20 before earnings and then it will moon... back to 24 or so, where we are today***.  \n\n\nWe've done the \"reached 19/20\" part. I expect good earnings on 5/11. I no longer think we'll see a lift back to 24 or 25 on earnings, though. Not in the current senseless market. I think we'll see it trade flat after earnings or possibly very slightly higher for a day... and then all the \"HURR DURR PLTR 50 BY END OF YEAR\" people will get impatient (despite being warned since the beginning) and start selling off... leaving us back down to around  wherever we are just before the earnings report.  \n\n\nIf you don't have conviction in PLTR, don't invest. If you do, leave your position alone and relax for a few years.  \n\n\n***11% of  portfolio is PLTR at 23.98***",
        "created_utc": 1620319609,
        "id": "gx6359m",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1620348409.0
    },
    {
        "author": "detectiveDollar",
        "body": "Now you know how the AMD gang feels",
        "created_utc": 1620144309,
        "id": "gwx6itz",
        "score": 69,
        "subreddit": "stocks",
        "created": 1620173109.0
    },
    {
        "author": "yuckystuff",
        "body": "The key to making money off AMD is bottling your tears each time it disappoints, and selling those tears to weird people online.",
        "created_utc": 1621015169,
        "id": "gy4jybh",
        "score": 67,
        "subreddit": "stocks",
        "created": 1621043969.0
    },
    {
        "author": "alfen-dave",
        "body": "Insight; when I bought these early May, AMD was trading around 79$ \nand while I was unshaken at first but the 72$ dip at first, I started to panic this week seeing the stock to struggle to get past 78...The AMC stuff made me think traders would ditch the stock again for another plunge yesterday + theta was rotting the whole thing day after day...\n\nMy good move was avg down to a price of 1.8$ premium with 100 options.\n\nHave I held it another morning, not only would I have recovered my 10k loss today but made maybe 5-6k profit.\n\nI even had a plan made this week to hold until 4th of June but I didnt stick to it.\n\nFeelsbadmane",
        "created_utc": 1622236249,
        "id": "gzsyqha",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1622265049.0
    },
    {
        "author": "CHlNSUYI",
        "body": "AMD is up .1%!!! I feel like a millionaire",
        "created_utc": 1620158592,
        "id": "gwxwxfy",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1620187392.0
    },
    {
        "author": "pooopwater",
        "body": "Now the M1 chip is a cheap chip that is smoking Intel's best chips and running much cooler and much less power and Intel is stuck in old tech with chips that are burning up due to being pushed hard. Apple asked Intel to make chips for the iPhone, but Intel couldn't see profit in making chips for a bad phone tacked onto an iPod. Apple was forced to make its own chip, and now Intel is panicking as they are getting outrun by AMD and far outrun by Apple.",
        "created_utc": 1620652029,
        "id": "gxlqp3d",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1620680829.0
    },
    {
        "author": "ORS823",
        "body": "Isn't AMDs technology superior to Intel which is the cause for it being \"undervalued\". AMD will take their market share and cause Intel to go bankrupt if they can't catch up. Even large companies can be surpassed.",
        "created_utc": 1622237738,
        "id": "gzt1qnz",
        "score": 55,
        "subreddit": "investing",
        "created": 1622266538.0
    },
    {
        "author": "trapmitch",
        "body": "Yeah I'm looking for the next mvis or amd I dont csre about non pink current companies launching an online token with unusable apps and negative revenue lol",
        "created_utc": 1621823976,
        "id": "gz8d1re",
        "score": 54,
        "subreddit": "pennystocks",
        "created": 1621852776.0
    },
    {
        "author": "WidepeepoHappysad",
        "body": "I will build my next rig with AMD cpu+gpu only!",
        "created_utc": 1622478101,
        "id": "h03g5dx",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1622506901.0
    },
    {
        "author": "NoobSniperWill",
        "body": "My portfolio: TSLA, SNOW, NIO, SQ, PLTR, ARKK and AMD lol fuck me in particular",
        "created_utc": 1620946968,
        "id": "gy1bin9",
        "score": 50,
        "subreddit": "StockMarket",
        "created": 1620975768.0
    },
    {
        "author": "Edhellas",
        "body": "Idiots in this thread, Jesus. Shortage issues? AMDs market share gains have slowed down due to shortages, they're selling every chip they can make.\n\nWhen supply catches up to demand (which isn't happening for another year at least), their sheets will still look great because they'll start chipping away at Intel and Nvidias market share. With the Xilinx merger they'll become the largest customer at TSMC. As they start transitioning to 5 nm, they'll be able to allocate 7nm to lower margin GPU products, a segment which is currently neglected due to shortages, both by Nvidia and AMD.\n\nBesides that, they just announced a $4b share buyback. AMD have never had this kind of free cash before. This is going to prevent any sub $70 targets, unless there's a very sudden macro cause, and even then they'll eat it up because they want to buy the shares at a decent price. The reason they're doing share buybacks and not investing in the company? They have no factories, so they don't need capital to increase production levels. They've already effectively maxed out on R&amp;D, and as Intel have proven over the last 4 years, you can't throw extra money at semiconductor R&amp;D to get better results.\n\nTheir product roadmap for the next 5 years is amazing and they have a proven track record of delivering.\n\nThey said themselves that their gpu lineup should get another 50%+ per/watt improvement next gen, and leakers who have been pretty reliable previously are pointing to much higher numbers.\n\nIn the CPU space, Intel's next two generations are no threat whatsoever, and AMDs iterative design approach means consistent gains in performance and power consumption every year. Intel's 10nm laptop CPUs can increase their performance by 10% for a 50% power consumption tradeoff. It proves how bad the state of their foundries really is.\n\nThe Xilinx merger is a big brain play if it goes through, which it should. It gives them the FPGAs necessary to chip away at Nvidias monopoly on machine learning. Xilinx already easily outperforms Nvidia here, but Nvidia has an ecosystem that needs to be broken. As we move towards smaller processing nodes, transistor size reductions will no longer be the way to get better performance. A mix of FPGAs, ASICs, and general compute units is the future. That's what AMD have recognised and why they're building an arsenal of integrated CPU and GPU products now. They're building the experience required to meet the demands of the future.\n\nI don't have much money so I've got 265 shares via CFDs on 5x leverage. Assuming the Xilinx merger is successful, $100-130 EOY is easily manageable imo. It will likely take a hit after the merger as Xilinx owners sell their converted shares, but that's to be expected. With the guidance AMD have for this year it's also plausible they may increase the buyback program depending on demand/shortages, which could alleviate Xilinx sellers.",
        "created_utc": 1621620039,
        "id": "gyyvyvd",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1621648839.0
    },
    {
        "author": "Tbones014",
        "body": "AMD can you stop edging and just go to 90 already",
        "created_utc": 1620333676,
        "id": "gx71a37",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1620362476.0
    },
    {
        "author": "Fit-Mycologist-6951",
        "body": "Bank: sign up for a free savings account with a high 1.5% interest rate for the first 12 months!\n\nMe: lmfaoooooo ayyy hahhahahah \n\nMe: loses 20% on the stock market and 2.3k on AMD alone \n\nBank’s 1.5% interest offer did better than me by not doing anything",
        "created_utc": 1620332168,
        "id": "gx6xl5i",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1620360968.0
    },
    {
        "author": "RssnGopnik",
        "body": "I started with 8k back in 2014 and had almost half a mil last year. I set aside 30k last year and bought Tesla, flipped into spy puts (tripled money over two week period) then lost half after March 17th. Dumped another 70k into spy puts, lost it all. \n\nAbout a month I was hating my life but then again I bought calls on Tesla, amd, intel, nflx and some others. Resorted portfolio into VGT and VUG ETFs as well as SCHG. Traded 20-30% of my portfolio and bough calls while selling limited puts etc.",
        "created_utc": 1620094184,
        "id": "gwuy3ph",
        "score": 45,
        "subreddit": "options",
        "created": 1620122984.0
    },
    {
        "author": "the13thrabbit",
        "body": "That rug pull on AMD was the funniest shit i ever seen.\n\nI watched it in real time on stocktwits and I couldn't stop laughing 🤣\n\nThey even had Lisa Su on cnbc in pre market\n\nOne guy compared it to fucking his wife and having his kids knock on the door just as he was about to cum.",
        "created_utc": 1620144991,
        "id": "gwx87jd",
        "score": 44,
        "subreddit": "stocks",
        "created": 1620173791.0
    },
    {
        "author": "BubbleTeaExtraSweet",
        "body": "It still boggles my mind how AMD is now only 77-ish after such a stellar financial report. Most analysts predicted a $100 price target",
        "created_utc": 1620139921,
        "id": "gwwvqpo",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1620168721.0
    },
    {
        "author": "FredMc",
        "body": "Fuck does anyone here actually make money any more?  This place is becoming a graveyard.  RKT Bags, GME Bags, PLTR Bags, Weed Bags,  ICLN Bags,  ARKK Bags, TSLA Bags.  This is fucking brutal.  Oh yea and Fuck AMD",
        "created_utc": 1620082570,
        "id": "gwua2l1",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1620111370.0
    },
    {
        "author": "papaya_nyc",
        "body": "Congrats and yes put some money on the side for tax lol or put that tax money in some solid companies like amd, google, apple, etc so by the time you have to pay tax, that money would have grown a bit. You pay tax and you still gain some profits!",
        "created_utc": 1621872330,
        "id": "gzaansa",
        "score": 40,
        "subreddit": "stocks",
        "created": 1621901130.0
    },
    {
        "author": "MusicShouldGetBetter",
        "body": "AMD is tough because one share isn’t enough.",
        "created_utc": 1622477297,
        "id": "h03ejca",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1622506097.0
    },
    {
        "author": "polaarbear",
        "body": "You are ex-fucking-xactly right. And the 64 core AMD CPU costs $7500 dollars whereas the 28 core Intel can be had for ~3K right now. In scenarios where you would install one 64-core EPYC, you instead get a dual-socket motherboard and install a pair of the 28-core Xeons giving you 56-cores total in the same amount of space as the 64-core CPU.\n\nYou guys are treating this all like it's your gaming desktop. That's not how the enterprise works, not everything is a single-socket motherboard with dual-channel RAM.  There are I/O implications, memory bandwidth limitations.  You can't compare the 64-core AMD benchmark to the 28-core Intel benchmark and be like \"Look AMD da best man.\"  When you compare the 64-core AMD vs a 56-core Intel installation (similar *cost*) the gap is like 15% instead of 50%, and there is a lot more calculated into the platform cost than a single CPU alone.",
        "created_utc": 1620401025,
        "id": "gxa740f",
        "score": 38,
        "subreddit": "stocks",
        "created": 1620429825.0
    },
    {
        "author": "lechugabear",
        "body": "It is no mystery why NVDA is always green and why AMD is always red. Just look at their website. Everything on NVDA's website is green. Even their logo is green. Green = up = money. \n\nNow look at AMD. Everything is either red or red-orange. Red = down = no money no honey. AMD's logo used to be green but now it is not. Now look where they are. Such simple DD can make you rich. \n\n$NVDA forever. (even though I'm a retard with ~20 shares at $95 of AMD... fuck)",
        "created_utc": 1621626718,
        "id": "gyzaek2",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1621655518.0
    },
    {
        "author": "spudbro00",
        "body": "Amd down 10% this month and nikola up 25%. The ol Rotation from growth, to value, to scams.",
        "created_utc": 1621369369,
        "id": "gym2l59",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1621398169.0
    },
    {
        "author": "devanshagarwal",
        "body": "put $200k in AMD today 🚀🚀🚀",
        "created_utc": 1620147353,
        "id": "gwxe5jk",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1620176153.0
    },
    {
        "author": "MagicalChemicalz",
        "body": "God speed retard. I've gotten burned too much on AMD calls recently that I decided to be lame and just snag shares instead. Idk why AMD isn't $100 yet",
        "created_utc": 1621455903,
        "id": "gyqngbz",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1621484703.0
    },
    {
        "author": "Pingpongpungpengpang",
        "body": "\" Current shareholders of AMD own less of the company now. That’s simply a fact. \"\n\nWhat you're not seeing is the share dilution will be equal to the acquisition. So once the merger is complete the value should more or less be the same.  \n\nIt's like borrowing money to build an extension to your house. Yes, you pick up greater debt but that debt goes into the value of the house. So sure, on the surface it looks like a loss for current shareholders if you don't include the value of the acquisition to the acquiring company but that would be an oversight.\n\n&amp;#x200B;\n\nJust my $0.02",
        "created_utc": 1620145106,
        "id": "gwx8hrr",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1620173906.0
    },
    {
        "author": "GGLSpidermonkey",
        "body": "I went into margin to buy AMD shares, seems so undervalued surprised it tanked",
        "created_utc": 1620063323,
        "id": "gwt222w",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1620092123.0
    },
    {
        "author": "Darkbro",
        "body": "Cryogenically freezing myself for a thousand years. Wake up in 3021, the silicon based AI lifeforms have at their heart the .001 nm semiconductors made by AMD. Lisa Wang's artificially preserved head is attached to a robotic being rivaling Ultron in technical prowess and the company has exceeded expectations for one thousand and three years now.\n\n\n\n\nThe stock price has plummeted from a millennia of good news and sound fundamentals.",
        "created_utc": 1620165546,
        "id": "gwyd6c0",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1620194346.0
    },
    {
        "author": "Darth_Buc-ee",
        "body": "$AMD to the moon! 🚀🚀🚀🚀",
        "created_utc": 1620133011,
        "id": "gwwghc1",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1620161811.0
    },
    {
        "author": "TheMotorCityCobra",
        "body": "man i had GME and AMC and sold at huge losses and i still amd holding my BB like a retard with 60% losses on it. im so rekt :(",
        "created_utc": 1622063799,
        "id": "gzk9x2c",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1622092599.0
    },
    {
        "author": "thenudedentist",
        "body": "This is fantastic and has really helped out.  Thank you!  \n\nDo you have any thoughts long term on AMD stock price wise?  Are you bullish on them?",
        "created_utc": 1620097575,
        "id": "gwv4mql",
        "score": 32,
        "subreddit": "stocks",
        "created": 1620126375.0
    },
    {
        "author": "ChuckMayr",
        "body": "it's low, but for me not low enough to justify the China risk. \n\nI mean, look at domestic growth strocks below 30, those are more interesting with less risk and probably similar rewards (looking at you, AMD)",
        "created_utc": 1621121235,
        "id": "gy9n3gh",
        "score": 32,
        "subreddit": "investing",
        "created": 1621150035.0
    },
    {
        "author": "New-Awareness-2719",
        "body": "AMD getting no love whatsoever!!!",
        "created_utc": 1620061092,
        "id": "gwswr54",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1620089892.0
    },
    {
        "author": "Budgetwatergate",
        "body": "AMD in a nutshell",
        "created_utc": 1619884622,
        "id": "gwjx4rj",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1619913422.0
    },
    {
        "author": "udgnim2",
        "body": "shows management has confidence in the long term future of AMD",
        "created_utc": 1621445086,
        "id": "gypxuel",
        "score": 30,
        "subreddit": "stocks",
        "created": 1621473886.0
    },
    {
        "author": "jrviimonya",
        "body": "I literally bought back the $AMD Jan 2022 calls I sold a month ago this morning.\n\nPerfect timing, thank you Su Bae.",
        "created_utc": 1621443478,
        "id": "gyptynw",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1621472278.0
    },
    {
        "author": "rocket-L",
        "body": "Okay AMD funny joke haha that's enough haha lol you can start going back up now lmao haha",
        "created_utc": 1620049052,
        "id": "gws542o",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1620077852.0
    },
    {
        "author": "welloiledsling",
        "body": "You either listen to Guy Adami on CNBC Fast Money and buy Kohl’s stock that has been the same price for the last 21 years, or buy AMD during a chip shortage with a boss like Lisa Su that is on sale down 22% from its high and innovates, and wait for it to moon.",
        "created_utc": 1620362017,
        "id": "gx8lho6",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1620390817.0
    },
    {
        "author": "KaneIntent",
        "body": "What a frustrating time to be in the stock market. Major caps like APPL, MSFT, AMZN, and AMD are trading sideways for 6 months while a crypto meme stock is up 23,000% in the same time period.",
        "created_utc": 1620140006,
        "id": "gwwvyd0",
        "score": 30,
        "subreddit": "stocks",
        "created": 1620168806.0
    },
    {
        "author": "phoenixmusicman",
        "body": "Hey, look at the bright side, you're up $3 on AMD",
        "created_utc": 1620082403,
        "id": "gwu9phr",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1620111203.0
    },
    {
        "author": "Darth_Buc-ee",
        "body": "Am basically all in already. This stock is waaaayyy overdue for a pop. One good day could set off a massive chain reaction AMD I wanna be there for the ride.",
        "created_utc": 1620148678,
        "id": "gwxhgpd",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1620177478.0
    },
    {
        "author": "TEAM_BIRDMAN",
        "body": "AMD could have been called a WSB pump and dump at some point. Some of them are legit.",
        "created_utc": 1620654129,
        "id": "gxlurs6",
        "score": 28,
        "subreddit": "investing",
        "created": 1620682929.0
    },
    {
        "author": "CosmoPhD",
        "body": "I told you retards to buy AMD.",
        "created_utc": 1620363672,
        "id": "gx8nwf4",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1620392472.0
    },
    {
        "author": "SpacOs",
        "body": "Sure except when it comes to security, scale, and prodcution, oh and mobileye for EV space where they already have cars on the roads, nothing against AMD but they have a long way to go to take the crown.",
        "created_utc": 1621610895,
        "id": "gyybgrm",
        "score": 28,
        "subreddit": "stocks",
        "created": 1621639695.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "#AMD to 85",
        "created_utc": 1621339156,
        "id": "gyk4iij",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1621367956.0
    },
    {
        "author": "SlowNeighborhood",
        "body": "With all due respect(this is not directed at the OP), if you start wheeling CSPs and CCs on a stock that's at its all time highs, it's bound to incur some red periods. The real question is whether one is picking a underlying that they could end up having deep in the money shares in down the line. This isn't reflective of my actual positions but I'd much rather be getting slaughtered on AMD than Palantir and the like. AMD is a business that makes money year over year and has an established model that works. They have tons of OEMS that use their products to make all kinds of stuff. They arent some experimental lab or a mining survey company lol",
        "created_utc": 1621043497,
        "id": "gy65tqa",
        "score": 27,
        "subreddit": "options",
        "created": 1621072297.0
    },
    {
        "author": "ASAP-ANON",
        "body": "Buying AMD dip tomorrow morning ASAP especially after that earnings last week",
        "created_utc": 1620073586,
        "id": "gwtq78s",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1620102386.0
    },
    {
        "author": "Youkiame",
        "body": "Same boat also with AMD too. Perhaps valuation is a bit high at 600b for TSM? China concern? I don't know what's going on anymore.",
        "created_utc": 1621664487,
        "id": "gz14edu",
        "score": 26,
        "subreddit": "stocks",
        "created": 1621693287.0
    },
    {
        "author": "Velociraptorsss",
        "body": "Hey guys just got back from a 9 month break and haven’t checked my portfolio since early August when I put my life savings into AMD leaps!!!! I bet I’m a millionaire now SPY has gone up like crazy and I’m sure AMD has too I’ll update you guys when I login 😃😄",
        "created_utc": 1620099989,
        "id": "gwv8vb1",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1620128789.0
    },
    {
        "author": "raptosaurus",
        "body": "AMD killed earnings last week and so did CRSR and both were slaughtered lol.",
        "created_utc": 1620782262,
        "id": "gxsv85z",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1620811062.0
    },
    {
        "author": "futurefailure69",
        "body": "AMD wants to moon when I sell.",
        "created_utc": 1620217218,
        "id": "gx0nnhe",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1620246018.0
    },
    {
        "author": "HydrocodonesForAll",
        "body": "If u ain't long AMD u hate money\n\nPositions: long AMD\n\nsource: don't hate money",
        "created_utc": 1619991344,
        "id": "gwpo4xo",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1620020144.0
    },
    {
        "author": "betaraywill",
        "body": "AMD is the biggest pile of shit I have ever seen.",
        "created_utc": 1620050262,
        "id": "gws7s7o",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1620079062.0
    },
    {
        "author": "mrauls",
        "body": "Imagine thinking you bought amc but you bought amd",
        "created_utc": 1620997730,
        "id": "gy3g516",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1621026530.0
    },
    {
        "author": "zepereshk",
        "body": "I think they had to do something to save the stock from the shorts.. institutions are mostly short on AMD and long Xilinx to keep advantage of the merge since AMD is technically paying a bit too much for Xilinx.",
        "created_utc": 1621442529,
        "id": "gyproaa",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1621471329.0
    },
    {
        "author": "Rbank-",
        "body": "Amd is selling out all their cards as well. The gap between nvidia and amd performance wise has been getting smaller with the last 2 generations. \n\nAmd has also been gaining market share with their CPUs.\n\nNvidia may be a good buy, but so should AMD, ps5 and XSX aren’t going anywhere anytime soon.",
        "created_utc": 1621652283,
        "id": "gz0muxw",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1621681083.0
    },
    {
        "author": "UbbeStarborn",
        "body": "Blows my mind how AMD is trading below $100",
        "created_utc": 1620334275,
        "id": "gx72qcp",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1620363075.0
    },
    {
        "author": "toydan",
        "body": "Just lays there motionless. Like $AMD and $BABA.",
        "created_utc": 1622062232,
        "id": "gzk6bl9",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1622091032.0
    },
    {
        "author": "sreesid",
        "body": "It's not just AMD/Nvidia either. Apple is now a legitimate threat to Intel. They are getting rid of Intel in their Mac books, including the pros. Their M1 chips are ridiculous, both in terms of power and battery gains. That is a huge loss for Intel.",
        "created_utc": 1622254107,
        "id": "gztv8t7",
        "score": 23,
        "subreddit": "investing",
        "created": 1622282907.0
    },
    {
        "author": "Interesting-Row-3360",
        "body": "I did exactly this and it's the reason I first looked into AMD - the components are brilliant! From what I've read many of the CPUs perform better than the Intel Core I9 on single core speed (which matters most to gamers - a huge market!)",
        "created_utc": 1622481796,
        "id": "h03nq4v",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1622510596.0
    },
    {
        "author": "Pnl8692",
        "body": "AMD should change it’s ticker to WTF.",
        "created_utc": 1620055946,
        "id": "gwskjae",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1620084746.0
    },
    {
        "author": "MookyOne",
        "body": "I don't even understand WHY AMD is dying.  By all accounts they're doing great.",
        "created_utc": 1620054832,
        "id": "gwshv1e",
        "score": 22,
        "subreddit": "stocks",
        "created": 1620083632.0
    },
    {
        "author": "RssnGopnik",
        "body": "Intel, Netflix, AMD and TSLA. Those were options only and 20% of my trade portfolio. Rest was sittings in stable stocks and ETFs, mainly VGT and VUG",
        "created_utc": 1620094238,
        "id": "gwuy7gv",
        "score": 22,
        "subreddit": "options",
        "created": 1620123038.0
    },
    {
        "author": "beerion",
        "body": "&gt;what is stopping all equity that does not pay dividends like Amazon or Tesla or AMD to be worth 1$ per share?\n\nThey may not pay a dividend now, but they may at some point in the future.",
        "created_utc": 1620143431,
        "id": "gwx4b5p",
        "score": 22,
        "subreddit": "stocks",
        "created": 1620172231.0
    },
    {
        "author": "Zurkarak",
        "body": "I YOLOed all my money on the news that AMC would do the 4B buyback!!\n\nImagine my surprise when I read later it was actually AMD",
        "created_utc": 1621473287,
        "id": "gyrougn",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1621502087.0
    },
    {
        "author": "pa1reddit",
        "body": "Highly undervalued stock - AMD!! \nNot sure why WSB gang is not interested in this one at all when the short interest is so high for no reason.\nI’m holding my 1592 shares and $140c 01/22. 💰🚀",
        "created_utc": 1620068905,
        "id": "gwtffi1",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1620097705.0
    },
    {
        "author": "fahadfreid",
        "body": "This thread is proof that half the people here have no idea what they are talking about. AMD is not getting back in manufacturing and for good reason, it is simply too difficult for any single company at the current level of complexity. \n\nHell, even Apple, a Trillion dollar company, would rather pay TSMC to make their chips than start making it themselves. Chip making is not easy and even Intel, which is multiple times bigger than AMD can't get it straight.",
        "created_utc": 1621459248,
        "id": "gyqwbdj",
        "score": 22,
        "subreddit": "stocks",
        "created": 1621488048.0
    },
    {
        "author": "PlayerLou",
        "body": "I'm holding AMD long term. I think it's pretty well documented that they are taking business from intel. Semiconductors are in high demand which may continue into the future. When I asked my gaming friend about his new computer, he said it was AMD components. Then I learned AMD are supplying chips for the new gaming consoles. Around that same time they announced the acquisition of XLINX. Stock dipped and I bought in.\n\nSo yea, if you're looking for long term hold, general consensus is AMD will perform. Buying as a short term trend looks dangerous since the stock has been on a drastic downtrend for a while. I dont know what's keeping it down. Obviously the \"tech panic\" the media portrays but I feel like it's a combination of the acquisition and just being overlooked.",
        "created_utc": 1621015679,
        "id": "gy4l4j5",
        "score": 22,
        "subreddit": "stocks",
        "created": 1621044479.0
    },
    {
        "author": "Tbones014",
        "body": "AMD may be the best buy in the market right now",
        "created_utc": 1620058052,
        "id": "gwspkfz",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1620086852.0
    },
    {
        "author": "detectiveDollar",
        "body": "Also known as \"The AMD trajectory\"",
        "created_utc": 1620651271,
        "id": "gxlpahi",
        "score": 22,
        "subreddit": "stocks",
        "created": 1620680071.0
    },
    {
        "author": "ADzeek",
        "body": "AMD Applied materials Qualcomm DKNG",
        "created_utc": 1620443127,
        "id": "gxcljxk",
        "score": 22,
        "subreddit": "stocks",
        "created": 1620471927.0
    },
    {
        "author": "Asdn1220",
        "body": "Don't worry palantards, AMD gang can feel the same pain",
        "created_utc": 1620652485,
        "id": "gxlrkb3",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1620681285.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "AMD closed Green 😳",
        "created_utc": 1620159710,
        "id": "gwxzfxr",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1620188510.0
    },
    {
        "author": "jjwalla",
        "body": "I will fly over to your house and give your wifes bf a bj if AMD hits 500",
        "created_utc": 1621473898,
        "id": "gyrq20b",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1621502698.0
    },
    {
        "author": "strog91",
        "body": "This reminds me of what people around here said regarding AMD in 2015",
        "created_utc": 1620364875,
        "id": "gx8pjjy",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1620393675.0
    },
    {
        "author": "Moe_Greene_",
        "body": "Wednesday Options Volumes:\r  \n\r  \n**$TSLA 1,413K (49% call 51% put)**\r  \n**$AAPL 790K (63% call 37% put)**\r  \n**$AMD 683K (68% call 32% put)**\r  \n$UVXY 600K (66% call 34% put)\r  \n$HYG 556K (24% call 76% put)\r  \n$IWM 540K (34% call 66% put)\r  \n$T 474K (67% call 33% put)\r  \n**$AMC 437K (70% call 30% put)**\r  \n$SLV 395K (87% call 13% put)\r  \n$GLD 359K (67% call 33% put)\r  \n$VXX 300K (51% call 49% put)\r  \n**$NIO 299K (66% call 34% put)**\r  \n**$FB 272K (65% call 35% put)**\r  \n$AMZN 252K (55% call 45% put)\r  \n$XLF 249K (55% call 45% put)\r  \n**$PLTR 242K (63% call 37% put)**\r  \n**$RIOT 218K (47% call 53% put)**",
        "created_utc": 1621465400,
        "id": "gyr9bie",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1621494200.0
    },
    {
        "author": "bodiddlysquat26",
        "body": "Current plays: RTX, AMD, AAPL, VIAC, and PLTR. Leaps and shares in all. Let’s. Fucking. Go.",
        "created_utc": 1620011659,
        "id": "gwqplw8",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1620040459.0
    },
    {
        "author": "Toxicsidewinder",
        "body": "AMD - ADVANCED MONEY DESTROYER",
        "created_utc": 1620654736,
        "id": "gxlw0xy",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1620683536.0
    },
    {
        "author": "DMenace83",
        "body": "I had 1k shares of AMD at $2, sold at $5 😭😭😭",
        "created_utc": 1620273437,
        "id": "gx42m46",
        "score": 20,
        "subreddit": "stocks",
        "created": 1620302237.0
    },
    {
        "author": "coolcomfort123",
        "body": "Trust Lisa Su, AMD will fly soon.",
        "created_utc": 1621450497,
        "id": "gyqausb",
        "score": 20,
        "subreddit": "stocks",
        "created": 1621479297.0
    },
    {
        "author": "Personal-Air-1373",
        "body": "The only thing that made AMD ever move is Intel going full retard.",
        "created_utc": 1622485564,
        "id": "h03vg47",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1622514364.0
    },
    {
        "author": "Glass_Magazine1404",
        "body": "The reaction to AMD earnings just makes me nervous about the whole market.  AMD smashes earnings even more than expected (and was expected to smash), get rewarded with a 6% decrease over the following week (9% of you could AH on earnings day).  I've been rolling down puts since we were in the 90's and getting pretty tired of it.",
        "created_utc": 1620064517,
        "id": "gwt4yre",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1620093317.0
    },
    {
        "author": "curt_schilli",
        "body": "How can you possibly simultaneously think that AMD will be $100 by EOY but also think it could freefall below $70\n\nPeak r/WSB right here",
        "created_utc": 1621616585,
        "id": "gyyo7dj",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1621645385.0
    },
    {
        "author": "broncosfannerd",
        "body": "if AMD breaks 80 tomorrow it's gonna go way up.",
        "created_utc": 1620160060,
        "id": "gwy08mx",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1620188860.0
    },
    {
        "author": "ILoveGratedCheese",
        "body": "To whoever convinced me to buy Amd calls when the stock was @$85, good job on bullying a retard.",
        "created_utc": 1620137696,
        "id": "gwwqeq0",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1620166496.0
    },
    {
        "author": "FalconsBlewA283Lead",
        "body": "*Bart Simpson chalkboard meme*\n\nI will not buy anymore AMD dips\n\nI will not buy anymore AMD dips\n\nI will not buy anymore AMD dips\n\nI will not bu",
        "created_utc": 1620059544,
        "id": "gwst3ae",
        "score": 19,
        "subreddit": "stocks",
        "created": 1620088344.0
    },
    {
        "author": "Asdn1220",
        "body": "no fucking hope for AMD. I aged 10 years just by watching this shit from ER",
        "created_utc": 1620652148,
        "id": "gxlqx8r",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1620680948.0
    },
    {
        "author": "RegretTMRW",
        "body": "AMD you juicy tease",
        "created_utc": 1620211474,
        "id": "gx0fgaz",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1620240274.0
    },
    {
        "author": "Captain_Yolo_",
        "body": "My coworker told me about his portfolio a few months ago basically split into fifths. AMZN, TSLA, SHOP, AMD, and AAPL. A few months ago, he was also one of the nicest happiest people you'd ever meet.\n\nI know he never took profits, because this year he's just gotten progressively more and more depressed. He went from the \"My treat for lunch today\" and bringing donuts and coffee in to never taking lunch and only drinking from the water cooler and free coffee in office.",
        "created_utc": 1620594454,
        "id": "gxjdh32",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1620623254.0
    },
    {
        "author": "IBeefSupremeI",
        "body": "AMD has only relatively recently obtained such growth. With regards to personal computing, Intel has led on the central processor front for decades in terms of market share, partnerships with oems, and performance. At the same time, NVIDIA has dominated the consumer/professional/gaming graphics card segment, in terms of market share, technology, and performance. \n\nAfter building my AMD based PC in 2019, started really paying attention to parts, and news regarding AMD's products. Wife was convinced to buy in at a measly 30-40 a share, IIRC. And they have since performed beyond expectations. Their consumer products do not quite make the very top in terms of overall performance, but their value proposition in consumer products has yielded high growth in terms of adoption, and they are starting to secure deals with OEMs. \n\nTL;DR AMD is David vs Goliath on the two most important fronts AMD has. If you can consider them a David lol. But they're accelerating in terms of development and market share. I'm so long on AMD.",
        "created_utc": 1620097665,
        "id": "gwv4sof",
        "score": 18,
        "subreddit": "stocks",
        "created": 1620126465.0
    }
]