[
    {
        "author": "jonathan34562",
        "body": "Please upvote this so I can answer the most common questions I am getting in one place.\n\n\n1) How did I get to this point in my life?\n\nI have a master degree in computer science and spent 8 years working as a programmer at lots of different companies.  Then I launched my own consulting company - quickly figured out that services work doesn't scale well - pivoted the business to a product startup and used the consulting to finance it.  All told, it took 20 years to get a really big exit - like net of over $200M.  \nThere is no shortcut that I know of - education, skills, experience,  lots of hard work for years and then luck.\nNow I get to do whatever I like, I am typing this from a private jet on the wifi coming back from vacation... I know, wtf. I pinch myself too.\n\n\n2) How can I invest like you?\n\nWell. I have a lot of money so I can make risky bets.  I don't do options though, only stocks. I put $50k into GME on a whim at $65 and sold when it hit $350.  That was a laugh.  \n\nBut seriously, I invest in stocks that I feel like I know. I use HUBS - they are in a great space and really appealing to SMB. I see them as the most viable competitor to Salesforce - go look at Salesforce's market cap. Classic Clayton Christensen - you will be eaten from below.\n\nI am not really much of an investor - just see things that make sense. I bought Amazon at $350 - should have put in more...\n\nI typically invest in tech stocks because I feel like I understand the business.\n\nMy stock account is just my plaything. My real investing is much more structured and done with my wealth advisor at a large brokerage.",
        "created_utc": 1630774469,
        "id": "hbl52oz",
        "score": 794,
        "subreddit": "wallstreetbets",
        "created": 1630803269.0
    },
    {
        "author": "creusifer",
        "body": "My never sell stocks are TSLA, NVDA, SQ, FB, CRM, and SNOW. I trade everything else.",
        "created_utc": 1632671555,
        "id": "hecxg0y",
        "score": 113,
        "subreddit": "stocks",
        "created": 1632700355.0
    },
    {
        "author": "rus_sianh_ck",
        "body": "selling covered puts has been profitable and i would gladly buy shit loads of shares at $18 - $22  so assignment is fine.\n\nfact is, their tech is gold for national defense, healthcare, enterprise business, etc\n\nif you plugged salesforce or another CRM into goliath, you could streamline  the shit out of your operation",
        "created_utc": 1630897202,
        "id": "hbrjpnh",
        "score": 60,
        "subreddit": "stocks",
        "created": 1630926002.0
    },
    {
        "author": "Ackilles",
        "body": "Shares in a strong growing company. No real rush to withdraw it. Major Salesforce competitor gaining ground constantly",
        "created_utc": 1630767611,
        "id": "hbkpoc4",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1630796411.0
    },
    {
        "author": "Vinyyy23",
        "body": "lol winners keep winning.  Facebook, google, Microsoft, CRM, apple, tesla, amazon, nvidia…etc.   Its not hard finding good companies…the problem is just buying them and holding them a long time and to stop yourself from buying the shit companies you think are going to “moon”",
        "created_utc": 1630895946,
        "id": "hbrh8vj",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1630924746.0
    },
    {
        "author": "hapa604",
        "body": "My company moved from Hubspot to Salesforce.  The latter just has a far superior product",
        "created_utc": 1630768308,
        "id": "hbkr6zb",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1630797108.0
    },
    {
        "author": "Joltarts",
        "body": "There are already autonomous buses where I live. Self driving vehicles isnt just a Tesla thing.\n\nAnd as for data collection or mining, what edge does Tesla have over companies like Palantir, salesforce and more who are specifically designed their software for data analytics with AI.",
        "created_utc": 1631105498,
        "id": "hc1wwtu",
        "score": 19,
        "subreddit": "stocks",
        "created": 1631134298.0
    },
    {
        "author": "IcebergSlimFast",
        "body": "I haven’t checked the underlying numbers on Dollar Tree, but you’ve got one too many zeroes on your Salesforce example: that jump is ~2,200% (or about 22x).",
        "created_utc": 1632937764,
        "id": "heqz7uc",
        "score": 17,
        "subreddit": "options",
        "created": 1632966564.0
    },
    {
        "author": "wildup",
        "body": "Have you even used both of their services? Hubspot is very different than Salesforce. You're comparing apples and oranges.",
        "created_utc": 1630768073,
        "id": "hbkqoi2",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1630796873.0
    },
    {
        "author": "abrownguyy",
        "body": "I feel like $CRM is not mentioned enough in these “your top 5 for the next 10 years” discussions. It’s an absolute monster.",
        "created_utc": 1632685219,
        "id": "hedvaye",
        "score": 13,
        "subreddit": "stocks",
        "created": 1632714019.0
    },
    {
        "author": "GeneEnvironmental925",
        "body": "15 years.  Have been holding AAPL since 2006. My risk tolerance is above average but things don't feel that risky to me because I do my research. I like growth names but nothing crazy.  I have a large core of big tech. No China, though I was in NIO until earlier this year. I mostly buy-and-hold but sometimes the market dictates otherwise. Trading is for professionals, IMO.\n\nAAPL AMD AMZN AVPT BARK CELH CRM CRWD DIS F GOOG MELI PINS PYPL SOFI UPST\n\nThis is my portfolio but I also have 20% split across three biotechs that I can't post in this subreddit. That's my high r/r, but I also don't feel like they're that risky because I know what I own.  \n\nRead all the 10-K and 10-Q.  Listen to earnings calls and take notes.  Keep on top of national and world news. Look at options chains to get sentiment. Use Twitter for news and such. Learn how to read candlestick charts and spot reversals.  Don't panic sell. Don't listen to the noise online.\n\nI broke $1.5m this morning.",
        "created_utc": 1630605358,
        "id": "hbcdqig",
        "score": 10,
        "subreddit": "stocks",
        "created": 1630634158.0
    },
    {
        "author": "abrownguyy",
        "body": "Sure! I’m not an expert, nor do i think I am right above all else with how I do things. I’m not a technical analyst, and I’ve only been investing for about 4 years (I am 26). Everyone’s a genius in a bull market anyway so I’m sure a monkey could’ve performed similarly anyway - but you asked so I’ll share. \n\n1) only invest in companies you use and enjoy\n2) only invest in companies who have forward thinking leaders with proven track records\n3) only invest in companies who are building products/services for the future and don’t base your investment on historical performance \n4) don’t buy meme stocks and no one on the internet has the answers I learned this the hard way and am bag holding stocks below. \n\nI did not lose money on any meme stock. I made a lot off the video game store - this is probably part of the reason I got over confident and started breaking my own principles. \n\nI lost money on picks made by people on the internet ($FUBO, $CRLBF, $APPN, $FLGT) \n\nA good example of this would be SQ. I bought SQ back in 2017 when I first started investing. I’ve used their product at the barber, at the coffee shop up the road, at a farmer market. I thought to myself. “Wow, a mobile phone credit card reader for any small business, I only use card so this just made my life a whole lot easier - who made this?!?” \n\nJack Dorsey obviously created twitter, and scaled one of the most popular social networks to billions of people and billions of dollars. I believed in him, and he’s a very…. “passionate” individual about the future. \n\nWith the rise in SMB’s (I work for a tech company that serves SMB’s and realized how easy it is to start a biz now a days, I realized that this little mobile credit card processing company was only just getting started, and I bought a couple dozen shares of $SQ (wish I had more money back then). It’s my 2’d best performer behind $PENN (who fits this mold as well). \n\nAgain, I know this is flawed, not-proven, and there are much better ways to go about investing. The 2020 bull run helped make me a ton of money and I’m very lucky in that sense that i invested in companies like $APPL, $SQ, $MSFT, $TSLA using these principles. Confirmation bias? 100%. But I’m gonna stick to it and hope it keeps working and gets me out of the hole I dug by taking the internet’s advice. \n\nA few stocks I’m currently interested in:\n$CRM, $MSP, $S, $FTNT",
        "created_utc": 1631453897,
        "id": "hck7nbp",
        "score": 9,
        "subreddit": "stocks",
        "created": 1631482697.0
    },
    {
        "author": "J_Willi90",
        "body": "I’m in SWPPX it’s a Schwab S&amp;P index fund. VERY LOW EXPENSE RATIO at 0.02%\n\nLook at the tech etf FTEC by Fidelity, it has a low expense ratio at 0.08% and holds Apple, Microsoft, Nvidia, Salesforce, Visa and etc. A money printing Machine",
        "created_utc": 1631740199,
        "id": "hczzr4y",
        "score": 9,
        "subreddit": "StockMarket",
        "created": 1631768999.0
    },
    {
        "author": "SpliTTMark",
        "body": "I sold crm at 260 on wednesday",
        "created_utc": 1632525670,
        "id": "he5jbh4",
        "score": 8,
        "subreddit": "stocks",
        "created": 1632554470.0
    },
    {
        "author": "ini0n",
        "body": "As someone in marketing there's a million of these types of social media CRM tools, FB and other platforms are also increasingly bringing this functionality onto the native platform while often breaking 3rd party tools with API updates. So I wouldn't buy an unprofitable company with a 5b market cap and 400m in revenue.",
        "created_utc": 1632344377,
        "id": "hdw07ck",
        "score": 8,
        "subreddit": "investing",
        "created": 1632373177.0
    },
    {
        "author": "MadeTheAccountForWSB",
        "body": "I'm pretty sure that: Google, Amazon, Samsung, Softbank, Airbus, Lockheed, Bosch, HPE, Hyundai, Bill Gates fund, the fund from the founder of Dell and the fund from the founder of Salesforce, did also do their DD and they all concluded that IonQ and Ion Traps are a great idea! \n\nI also came to this conclussion.",
        "created_utc": 1631914901,
        "id": "hd9b5dz",
        "score": 8,
        "subreddit": "SPACs",
        "created": 1631943701.0
    },
    {
        "author": "dnwolfgang",
        "body": "Salesforce tower?",
        "created_utc": 1631505356,
        "id": "hcnh9g3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1631534156.0
    },
    {
        "author": "_foldLeft",
        "body": "Sold CRM calls at a loss yesterday, only for them to be profitable today  \nsuch is life",
        "created_utc": 1632409374,
        "id": "hdyzjnq",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1632438174.0
    },
    {
        "author": "ParkerTheCarParker",
        "body": "Love me some $CRM",
        "created_utc": 1632419565,
        "id": "hdzo6b3",
        "score": 6,
        "subreddit": "stocks",
        "created": 1632448365.0
    },
    {
        "author": "HbRipper",
        "body": "Well, 40% apple, 30% Amzn, 8% CRM, 5% SBAC, and the rest on riskier shorter  term plays",
        "created_utc": 1632295921,
        "id": "hdtias3",
        "score": 5,
        "subreddit": "stocks",
        "created": 1632324721.0
    },
    {
        "author": "_grapevan",
        "body": "Have a bunch of 0dte calls right now, some blue chips like CRM, NVDA, TSLA and a bunch of sketchy tickers like LCID, QS, WYNN, MVIS. Wish I has hedged more before close. Won’t sleep well tonight",
        "created_utc": 1632433948,
        "id": "he0lfu5",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1632462748.0
    },
    {
        "author": "interrobangbros",
        "body": "WORK wasn’t moving because it was under agreement to be bought by Salesforce. The deal closed in late July and Slack stopped trading. It’s value was locked in last year when Salesforce announced they’d be buying it for $26.79 in cash and 0.0776 shares of CRM. That means it would only barely move as CRM moved. \n\nIf your question is should you hold a company that has agreed to be bought, then it depends on the acquisition details and your motives. If your company is being bought for all cash or mostly cash, and you don’t think a bidding war is going to start, just sell now (unless it’s a new holding in a taxable brokerage and the deal close date will end up being &gt;1 year after you bought). If it’s a mostly stock or all stock deal, ask yourself if you want to own shares in the new company. If yes, just hold. If no, sell now (same caveat about holding time as noted above).",
        "created_utc": 1630893120,
        "id": "hbrbldc",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630921920.0
    },
    {
        "author": "981flacht6",
        "body": "Microsoft was already supported by BB Enterprise ID. Microsoft didn't choose them, BlackBerry is just leveraging Microsoft's product offerings into their own platform, which is meant to scale up and work with multiple services and companies using different connectors. \n\nYou can setup BB Enterprise with AWS, Citrix, DocuSign, Dropbox, G Suite, Salesforce, ServiceNow, WebEx, Workday, Zendesk, Zscaler. These are all big companies that make a lot of enterprise tools that are used in large corporations everyday.",
        "created_utc": 1631220773,
        "id": "hc87p1u",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631249573.0
    },
    {
        "author": "JustAnAverageFellow",
        "body": "bought and sold CRM 280C within 3 mins of market open and made a couple hundred bucks.. not too shabby if I do say so myself",
        "created_utc": 1632491782,
        "id": "he3be5d",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1632520582.0
    },
    {
        "author": "nosalute",
        "body": "Jim Cramer said [buy CRM AAPL and AMZN](https://www.cnbc.com/2021/09/27/cramer-sees-opportunity-to-buy-best-of-breed-tech-giants-apple-amazon-and-salesforce.html) yesterday LMFAOOOOOO",
        "created_utc": 1632859127,
        "id": "hemwgpr",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1632887927.0
    },
    {
        "author": "GalaxyShards",
        "body": "Investigating combined taxes paid &gt;&gt;&gt; placing emphasis on income tax. I live in Colorado. My husband and I pay less in taxes combined, both property and state income tax, than my brother does on just his property tax alone in TX. My husband is a software engineer so we make decent money. There’s a large SalesForce in Denver, Colorado. These people have options other than Cali.",
        "created_utc": 1631454239,
        "id": "hck8f1e",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1631483039.0
    },
    {
        "author": "Foreign-Weekend",
        "body": "The portfolio is split into ETFs and select equities. Open to consolidate or diversify. Currently DCA'ing with a target to reach 20% cash (52% current). In my 30s. Thanks in advance!\n\n| Ticker | Percentage |\n|--------|------------|\n| VTI    |        14% |\n| MSFT   |        12% |\n| SCHD   |         8% |\n| CRWD   |         7% |\n| SPOT   |         7% |\n| V      |         6% |\n| VNQ    |         4% |\n| BABA   |         4% |\n| TDOC   |         4% |\n| DVN    |         4% |\n| PRTA   |         3% |\n| IEMG   |         3% |\n| HZNP   |         3% |\n| AAPL   |         3% |\n| DAL    |         3% |\n| UBER   |         3% |\n| F      |         3% |\n| NIO    |         2% |\n| OMF    |         2% |\n| C      |         2% |\n| AKBA   |         1% |\n| DM     |         1% |\n| CRM    |         1% |",
        "created_utc": 1630719799,
        "id": "hbipv9f",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630748599.0
    },
    {
        "author": "jsntx",
        "body": "My moves: bullish on FUBO, SDC, RKT. Neutral on RUN, CRM, GME, UAL. Bearish on banks, COIN, AAPL.",
        "created_utc": 1631829177,
        "id": "hd4srq8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631857977.0
    },
    {
        "author": "moneylivelaugh",
        "body": "Before everyone jumps in on HUBS I’ll share my unsolicited opinion. Salesforce (CRM) is the 800lb gorilla in the CRM space. I agree that Hubspot is probably a better tool and should eat away market share. That being said for larger organizations the lift and shift of salesforce is nearly impossible. Not impossible but nearly from a cultural perspective. Curious to understand how much Fortune 1000 market share belongs to HUBS",
        "created_utc": 1630781171,
        "id": "hblk2zz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630809971.0
    },
    {
        "author": "jonathan34562",
        "body": "NextDoor isn't really about software. It is social, marketplace, ads, consumer, trendy.  More like Facebook.  Seems like mostly the \"stay off my lawn\" old folks users from my experience. \n\nNot something I really understand so I can't comment, sorry.\n\nNot sure if HUBS or Salesforce will get to different numbers first but I think Salesforce will have a hard time serving the lower end of the market and that is where HUBS will grow. And then once big enough and sophisticated enough, then HUBS will challenge Salesforce in the enterprise.  My startup did this too in a different market. It is Clayton Christensen stuff - eaten from below...",
        "created_utc": 1630812679,
        "id": "hbnbr1s",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630841479.0
    },
    {
        "author": "Beginning_Analysis61",
        "body": "Salesforce SUX. Spent WAY too much money on it and they couldn’t get it to do what we needed. Ended up being no better than ACT from the 90s. So may promises. It’s trash don’t waste your $",
        "created_utc": 1631471730,
        "id": "hcldvov",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1631500530.0
    },
    {
        "author": "Cows_Go_POO",
        "body": "Not sure if I should shift my CRM to AMD",
        "created_utc": 1632507800,
        "id": "he4dfja",
        "score": 3,
        "subreddit": "stocks",
        "created": 1632536600.0
    },
    {
        "author": "Traditional_Bag430",
        "body": "Who bought salesforce?",
        "created_utc": 1632421627,
        "id": "hdzt54z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1632450427.0
    },
    {
        "author": "Stocktonmfer",
        "body": "MFST AAPL NVDA GOOGL AMD SQ V CRM  ETSY JPM \n\nLooking to add two more positions",
        "created_utc": 1632780793,
        "id": "heiu27q",
        "score": 3,
        "subreddit": "stocks",
        "created": 1632809593.0
    },
    {
        "author": "okfreedom",
        "body": "Started with 110 or so stocks and have whittled it down to about 64... I want to consolidate further. Anything in here that is past it's prime that I should allocate toward growth?  \n\n\n* PLTR\tPalantir\t3.85%\n* PHO\tInvesco Water Resources ETF\t3.82%\n* AXON\tAxon Enterprises\t3.72%\n* LIT\t        Global X Lithium &amp; Battery Tech ETF\t3.65%\n* PYPL\tPayPal\t3.33%\n* NKE\t        Nike\t2.75%\n* NVAX\tNovavax\t2.74%\n* FB\t        Facebook\t2.50%\n* GOOG\tGoogle\t2.47%\n* AMD\tAMD\t2.42%\n* ABNB\tAirBNB\t2.39%\n* DKNG\tDraft Kings\t2.37%\n* CMCSA\tComcast\t2.26%\n* U\t        Unity\t2.14%\n* AMZN\tAmazon\t2.09%\n* UPST\tUpstart\t2.04%\n* SOFI\tSoFi\t1.88%\n* TDOC\tTelaDoc Health\t1.88%\n* AAPL\tApple\t1.87%\n* BOTZ\tGlobal X Robotics &amp; Artificial Intelligence ETF\t1.83%\n* GRID\tFirst Trust NASDAQ Clean Edge Smart Grid Infra Idx ETF\t1.77%\n* SQ\t        Square\t1.76%\n* PAVE\tGlobal X US Infrastructure Development ETF\t1.73%\n* CHWY\tChewy\t1.69%\n* CMG\tChipotle\t1.62%\n* DIS\t        Disney\t1.57%\n* MSFT\tMicrosoft\t1.53%\n* SNOW\tSnowflake\t1.50%\n* WMT\tWal-Mart\t1.48%\n* LPSN\tLivePerson\t1.40%\n* LULU\tLululemon Athletica\t1.39%\n* ESTC\tElastic NV\t1.35%\n* ZIP\t        ZipRecruiter\t1.35%\n* KO\t        Coca-Cola\t1.34%\n* APPS\tDigital Turbine\t1.31%\n* ADBE\tAdobe\t1.30%\n* COST\tCostco\t1.30%\n* MTTR\tMatterport\t1.27%\n* MU\t        Micron Technology\t1.20%\n* SHAK\tShake Shack\t1.19%\n* LOW\tLowes\t1.19%\n* CRM\tSalesforce\t1.15%\n* VIAC\tViacomCBS\t1.14%\n* TGT\t        Target\t1.09%\n* TSLA\tTesla\t1.02%\n* ETSY\tEtsy\t1.01%\n* ZM\t        ZOOM\t0.99%\n* CRWD\tCrowdStrike\t0.96%\n* NVDA\tNVidia\t0.92%\n* SFTW\tBlack Sky\t0.89%\n* CRSP\tCrispr\t0.83%\n* SBUX\tStarbucks\t0.82%\n* QRVO\tQorovo\t0.81%\n* SPOT\tSpotify\t0.76%\n* CPNG\tCoupang\t0.72%\n* SRNG\tGinko Bioworks\t0.71%\n* SHOP\tShopify\t0.66%\n* TTD\t        The Trade Desk\t0.62%\n* KURI\tBabylon Health\t0.53%\n* VOSO\tWejo\t0.53%\n* NFLX\tNetflix\t0.50%\n* PATH\tUiPath\t0.39%\n* MA\t        Mastercard\t0.35%\n* V\t        Visa\t0.35%",
        "created_utc": 1630985521,
        "id": "hbw1ne8",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631014321.0
    },
    {
        "author": "Xinlitik",
        "body": "The article I read on CRM said they raised their revenue goal from 26.2-26.3B to 26.25-26.35B. Is it seriously rallying 4% over 500M or is the article wrong?",
        "created_utc": 1632404840,
        "id": "hdyp2jt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1632433640.0
    },
    {
        "author": "Purple_Cow1",
        "body": "Sq, net, googl, Sofi, crm",
        "created_utc": 1632727173,
        "id": "heg3wdd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1632755973.0
    },
    {
        "author": "Appropriate-Grisham",
        "body": "I follow a RVP of Zscaler on LI and they apparently CRUSHED their Q4 numbers. The stock is running hot but I do suspect quite an earnings beat (no matter which way it goes this is a $100bn + market cap stock anyways in a couple of years- similar trajectory to salesforce and ServiceNow &amp; Gartner leader by a mile)",
        "created_utc": 1630850280,
        "id": "hboqvy1",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1630879080.0
    },
    {
        "author": "claytondpark",
        "body": "Crm back to $275 next week",
        "created_utc": 1630696009,
        "id": "hbhc17m",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630724809.0
    },
    {
        "author": "Flwrz8818",
        "body": "Last august CRM earnings was my biggest play too. $0.79 contracts sold for $16.39.",
        "created_utc": 1632000122,
        "id": "hddpzt4",
        "score": 3,
        "subreddit": "options",
        "created": 1632028922.0
    },
    {
        "author": "GeneEnvironmental925",
        "body": "I am officially ready for CRM to break out on today's guidance raise",
        "created_utc": 1632401364,
        "id": "hdyhxwt",
        "score": 3,
        "subreddit": "stocks",
        "created": 1632430164.0
    },
    {
        "author": "Reasonable_Gas_5870",
        "body": "CRM how’s your back feeling carrying the weight of the market today?",
        "created_utc": 1632422355,
        "id": "hdzuwso",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1632451155.0
    },
    {
        "author": "BYE_HI_SELL_LOW",
        "body": "Not the place to ask for investing advice. Either throw all your money in CRM or head over to r/stocks",
        "created_utc": 1632493121,
        "id": "he3ef9v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1632521921.0
    },
    {
        "author": "retawx",
        "body": "Check out the holdings of LRNZ and THNQ.\n\n\nLess volatile AI plays would be the major cloud providers (MSFT, GOOG, AMZN), CRM, FB, NVDA, and AMD.",
        "created_utc": 1632848378,
        "id": "hem6ixl",
        "score": 3,
        "subreddit": "stocks",
        "created": 1632877178.0
    },
    {
        "author": "grassmunkie",
        "body": "It’s a coin toss, but you have to wonder they didn’t include Salesforce in their guidance for Q4, and Amazon deal details, if it is better than expected (folks expecting it to be non exclusive) we can see a move up.  Of course earnings can suck and bulls can get the shaft.",
        "created_utc": 1631096247,
        "id": "hc1iva9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631125047.0
    },
    {
        "author": "rollebob",
        "body": "Giving you a position in another office is big help. Salesforce is one of the best employers with very good salaries. Their employees don’t need 1k to relocate, they need to keep their job while moving elsewhere.",
        "created_utc": 1631432906,
        "id": "hcjed1c",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1631461706.0
    },
    {
        "author": "Themailhag",
        "body": "One salesforce bbq baby loin, some gmo corn smothered in butter, and a fine glass of wine",
        "created_utc": 1631393383,
        "id": "hch9bid",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631422183.0
    },
    {
        "author": "rabidmuffin",
        "body": "It does feel unlikely. Their current market cap is 56b so while 10xing that is certainly possible it would make them bigger than Oracle, Salesforce or Nvidia are today which feels like a stretch. But im still long PLTR.",
        "created_utc": 1631991382,
        "id": "hdd4me0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632020182.0
    },
    {
        "author": "SpliTTMark",
        "body": "Id like to bring up Salesforce, it may have dipped but\nIt was 255 the previous week leading up to 260 and then just went back to 255\n\nThis rise it has had was pretty awesome, good stock in at 207",
        "created_utc": 1632633291,
        "id": "heb8ugi",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1632662091.0
    },
    {
        "author": "The-big-vitamin-D",
        "body": "Jesus what a Chad salesforce is",
        "created_utc": 1632491076,
        "id": "he39u6v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632519876.0
    },
    {
        "author": "El-cid-98",
        "body": "Think of the rush from snorting a long line of SPY calls, then freebasing a spoon of CRM puts!",
        "created_utc": 1632424359,
        "id": "hdzzq6v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632453159.0
    },
    {
        "author": "The-big-vitamin-D",
        "body": "Cheeky salesforce ATH",
        "created_utc": 1632414037,
        "id": "hdzan5m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632442837.0
    },
    {
        "author": "WorkingCorrect1062",
        "body": "CRM giving 2023 guidance lmao. What a Chad move",
        "created_utc": 1632411228,
        "id": "hdz3y94",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632440028.0
    },
    {
        "author": "OilBerta",
        "body": "do a little research into technical analysis and buy momentum plays. You are not lookin to get a good price on a security you just want to ride the stocks that are trending higher. If the chart isnt up and to the right, then look else where. \n\nOptions only make sense if the premium isnt too outrageous. IV, Delta, ITM, all that must be understood before buying calls or puts.\n\nSome tickers that look good off hand are: INTU, PYPL, ABNB, GOOG, ETSY, SHOP, STM, NOW, CRM, SNOW, FTNT, ASO, YETI, COST, NTR, MS, SE, RBLX",
        "created_utc": 1632519815,
        "id": "he5642u",
        "score": 2,
        "subreddit": "stocks",
        "created": 1632548615.0
    },
    {
        "author": "Green_Lantern_4vr",
        "body": "Congrats \n\n\nIn other news. Why is this CRM type software $15b ? It’s not really that good and there are a million competitors.",
        "created_utc": 1631159525,
        "id": "hc56tz3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631188325.0
    },
    {
        "author": "SleezyTangoRomance",
        "body": "GOOGL 2900c CRM 265c NVDA 225C PLTR 30C AFRM 120C QQQ 375P",
        "created_utc": 1631824920,
        "id": "hd4isgi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631853720.0
    },
    {
        "author": "illthrowthisaway4",
        "body": "CRM weekly $270 calls were a 15 bagger, damn",
        "created_utc": 1632409550,
        "id": "hdyzyw6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632438350.0
    },
    {
        "author": "tomd1000",
        "body": "Thank you SalesForce!",
        "created_utc": 1632462570,
        "id": "he25hzm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632491370.0
    },
    {
        "author": "The-big-vitamin-D",
        "body": "CRM is such a Chad stock",
        "created_utc": 1632509987,
        "id": "he4ilqj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632538787.0
    },
    {
        "author": "Philosophfries",
        "body": "Again, very dramatic analysis for someone who doesn’t know his situation. It took me all of 10 seconds to click on OP’s profile, click comments, and see he initiated these positions on the 20th, just a few days ago. So yeah, I’d say ~5% returns in a few days is probably fine. But who knows where things will go.\n\n&gt; He will do worse as time moves on.\n\nHard disagree. With a broad portfolio of largely successful businesses, the long term is more favorable than the short term for this investor. That’s just how the market has worked. I’d be more inclined to agree with you if his portfolio was full of penny stocks and high risk assets.\n\n&gt; He is not mostly invested in blue chips.\n\nI said blue chips and successful businesses. You just can’t read or didn’t bother to. Google, Amazon, salesforce, amd, capital one, etc. These aren’t failing companies.\n\nLike I stated before, the only thing of value that you contributed is advocating for index funds. If OP is going to invest in a bunch of big companies anyways, might as well save time and just throw it into a large index fund with a low expense ratio.",
        "created_utc": 1632543463,
        "id": "he6ke7u",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1632572263.0
    },
    {
        "author": "SlothDogBeaver",
        "body": "Lots of good stocks to consider in this thread. I'll go with GOOG, SHOP, NVDA, CRM and ADBE.",
        "created_utc": 1632693933,
        "id": "heefzai",
        "score": 2,
        "subreddit": "stocks",
        "created": 1632722733.0
    },
    {
        "author": "zg44",
        "body": "Salesforce warning of 20% price hikes this Christmas shopping season on digital goods ordered... not good JPow.",
        "created_utc": 1633031983,
        "id": "hew2yd5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633060783.0
    },
    {
        "author": "jonathan34562",
        "body": "Yeah good point. I think there are so many net new customers though. And other CRM players to move from. But you are right, converting Fortune 1000 will be tough.",
        "created_utc": 1630781374,
        "id": "hblkjmx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630810174.0
    },
    {
        "author": "jonathan34562",
        "body": "I think so.  I think they get bigger and bigger, then potentially start taking real business from Salesforce at some point.",
        "created_utc": 1630787533,
        "id": "hbly3cb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630816333.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "Alot of those companies have to be perfect to justify their valuation.\n\nSalesforce does not. It's not that expensive when you account for slack",
        "created_utc": 1631016667,
        "id": "hbx7lkk",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631045467.0
    },
    {
        "author": "boomerzoomers",
        "body": "Salesforce is going to ATH next week and I will be selling",
        "created_utc": 1630713355,
        "id": "hbidb7o",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630742155.0
    },
    {
        "author": "MovieMuscle25",
        "body": "Yep, that ship has sailed for me. There are still some well-established growth stocks like SQ, SE, CRM, and others that will be just fine, but the mid caps are trash until further notice. I mean, if there's an actual correction, it could get even uglier for those growth stocks.",
        "created_utc": 1631659663,
        "id": "hcvpf53",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631688463.0
    },
    {
        "author": "Trading_Floor",
        "body": "Most bullish on this stock with my recent post:\n\n$AI 6 positive buying Catalysts for today, C3AI INC:\r  \n\r  \n1. Government contract with the Missile defence\r  \n\r  \n2. The recent Launch of AI Enabled CRM\r  \n\r  \n3. Tom Siebel yesterday discussed his huge commission based sales team notables from google to Microsoft:\r  \n\r  \n12,000 people selling for me at Baker Hughes into oil and gas. At FIS, I have thousands of people selling with me into the financial services and banking market. I sell with Microsoft across a wide range of markets. Now most significantly, is the announcement that we made not too many weeks ago with Google Cloud.\r  \n\r  \n4. C3AI INC: This is soon going to be a buyout target as they gain more market share of the industry.\r  \n\r  \n5. Industry growth is 35%+ per year. Oil for example is 1.7%. According to Facts and Factors market research report, the Global Artificial Intelligence Market size &amp; share revenue is expected to grow from USD 29.86 Billion in 2020 to reach USD 299.64 Billion by 2026, at 35.6% annual CAGR growth during forecast period of 2021-2026\r  \n\r  \n6. Average target price is 55% above todays current price. The average for stocks on the market right now is 15-20% for the year with $AI having a high price target of $122 and a low $45 which give 15-1 risk vs reward. 10% risk to 150% reward. I like them odds, In for $2500 shares on this one.",
        "created_utc": 1631625450,
        "id": "hctedzt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631654250.0
    },
    {
        "author": "WickedSensitiveCrew",
        "body": "That user didnt name any stocks though. CRM and TROW are down right now for example and other stocks I'd say go against the whole \"its only garbage spec stocks/no revenue that is down\".",
        "created_utc": 1631546869,
        "id": "hcp8p41",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631575669.0
    },
    {
        "author": "dontgetmadgetdata",
        "body": "All (serious) companies need management software (salesforce, SAP). Check out MAPS as a point of sale saas for pot. Inventory, patient tracking, complaint resolution, etc",
        "created_utc": 1631759043,
        "id": "hd14lu0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1631787843.0
    },
    {
        "author": "BeginnerInvestor",
        "body": "Has anyone looked into Zendesk? It looks like to have the same potential as Atlassian. Decent fundamentals, decent growth rate (27.5%), relatively unsexy side of running a business. Competition is Salesforce and ServiceNow.",
        "created_utc": 1632088404,
        "id": "hdim3uf",
        "score": 2,
        "subreddit": "stocks",
        "created": 1632117204.0
    },
    {
        "author": "BumHand",
        "body": "Yeah nicely done. I worked there for years so I have a very large position from ESPP. \n\nSalesforce prints money. Sure, their acquisition strategy is expensive, but now that the Slack acquisition is complete, I firmly believe the price will continue to rise.",
        "created_utc": 1632511824,
        "id": "he4n156",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1632540624.0
    },
    {
        "author": "orgabool",
        "body": "AMZN\nSNOW\nZNGA\nTTD\nSE\nROKU\nRDFN\nLULU\nPINS\nZM\nLMND\nPYPL\nINTU\nABNB\nSKLZ\n\nTech is the only thing I'm interested in.\nMore or less equally weighted.\nProfile is moderate/high risk, buy and hold.\nTime horizon 5-10 years.\n\nPlan to add more bigger caps (GOOG, NVDA, CRM)  as paychecks come in. Will probably trim LMND and SKLZ.\n\nAny help or suggestion appreciated. Thanks",
        "created_utc": 1630497803,
        "id": "hb6e2cn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630526603.0
    },
    {
        "author": "sergeantturnip",
        "body": "Yep I agree with your point about DDOG it’s niche in nature where the big dogs can absolutely do something similar but their product development is amazing, sequential revenue growth is increasing while spending so little on sales and marketing compared to companies like snowflake etc. \n\nWhat makes me feel better about datadog is they are cloud provider neutral coming out with new integrations like crazy such as salesforce. They seem to be quite aggressive in their niche and their last earnings report was amazing imo. \n\nI only have 10 total positions all with top conviction",
        "created_utc": 1630523722,
        "id": "hb82261",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630552522.0
    },
    {
        "author": "StonedTurtle420710",
        "body": "ROKU, BABA, ZM, AAPL, TSLA, SBUX, CRM.\n\nI make a killing on good plays, lol, keep to your AMC and GME.",
        "created_utc": 1630594432,
        "id": "hbbmkcc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630623232.0
    },
    {
        "author": "Acoconutting",
        "body": "Yeah.They just don't make a ton of revenue quite yet - feels like a correction incoming then maybe a good time to get in. Similar to Asana right now.\n\nI'm also a big fan of looking at actual products of these companies - Ie; Asana has a great product. Zoom has a great product. Salesforce is a good product.\n\nTheir product/offering is a little meh for the growth hope imo.",
        "created_utc": 1630777520,
        "id": "hblbzh0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630806320.0
    },
    {
        "author": "ElectronicAir6347",
        "body": "Keep it up it looks really good. You have a lot of companies I have myself as well, (aapl, Lmt, snow, crm) the glaring hole I see is something boring just in case we hit a growth pullback. My favs right now are (hrl, pep, Clx, wdfc, aap, nee, so, tjx). If you want a flyer check out bmbl, you may laugh because it’s a dating app but they make a ton of money.",
        "created_utc": 1630966603,
        "id": "hbuzuml",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630995403.0
    },
    {
        "author": "claytondpark",
        "body": "No prob bro, happy I can help other make money! Don't give up on crm yet imo...",
        "created_utc": 1631027303,
        "id": "hbxteif",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631056103.0
    },
    {
        "author": "peachezandsteam",
        "body": "I wouldn’t call it “blue chip” at all, but on SQ (fir which you approximately afford TWO 100 share blocks), the weekly ATM call is well over 1%.\n\nThe downside?  Looking at history as a model, that stock is capable of plummeting to $200, or soaring to $280, all in a short time.\n\nAlso look at CRM, Workday, GS, UNH, DE, and HD.",
        "created_utc": 1631659296,
        "id": "hcvomga",
        "score": 1,
        "subreddit": "options",
        "created": 1631688096.0
    },
    {
        "author": "Mortal1ty1337",
        "body": "Dynatrace. Asana.  [Monday.com](https://Monday.com). Avalara. Amazon. AMD. Nvidia. Square. Hubspot. Salesforce. Adobe. Facebook. Google. Datadog. Smartsheet. Microsoft.\n\nIm doing ok, but dont be fooled by the share prices, a number of those I bought in the last 3-4 months.",
        "created_utc": 1631807206,
        "id": "hd3b06j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631836006.0
    },
    {
        "author": "Euphoric_Environment",
        "body": "Thanks man! Gonna be adding to CRM and SQ ASAP for sure",
        "created_utc": 1631529805,
        "id": "hcoc1k3",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631558605.0
    },
    {
        "author": "longdrives1",
        "body": "Salesforce didn't belong with the rest lol",
        "created_utc": 1631316080,
        "id": "hcdg4kz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631344880.0
    },
    {
        "author": "BannerlordAdmirer",
        "body": "Most of them except MSFT are actually still 10% or more off their ATHs. AAPL, V, DIS all dropped 4-5%. DIS and AAPL dropped 5% in one day, earlier this week. CRM was at 252 and Paypal was 265 last week. At what point is a dip good enough? \n\nMost of the large caps move in correlation with each other and the market. So outside of earnings, if you decide to pass on a dip for one or wait to see if it gets worse, and if they reverse, you miss it for all of them.  \n\nFB or QCOM are still somewhat close to their recent lows. If we're looking at large cap deals, those could be good. A lot of the midcaps though already moved 15%+ in the last two-three weeks. \n\nIf ASTS goes down that would be my pick for a riskier gamble. \n\nI think heading into October/November, the debt ceiling news cycle will start and we'll have more chances to enter/add.",
        "created_utc": 1632446209,
        "id": "he1br57",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632475009.0
    },
    {
        "author": "BannerlordAdmirer",
        "body": "I picked up DIS today on that random $10 drop, picked up some AAPL and MSFT and QCOM. Was already in V. \n\nI might pick up some PYPL as well. Maybe another two rounds of buying powder left, so hopefully these are just convenience dips and not the start of a bear market. \n\nThe only thing that WASN'T on a nice discount was CRM, I was waiting for it at 250 but it didn't get there.",
        "created_utc": 1632264652,
        "id": "hdrzc4n",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632293452.0
    },
    {
        "author": "WickedSensitiveCrew",
        "body": "If CRM is a forever hold why were you trying to time an earnings dip and buy back in with it?",
        "created_utc": 1632509458,
        "id": "he4hbtn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632538258.0
    },
    {
        "author": "MonoDun",
        "body": "BABA, COIN, PLTR, ROKU, LRCX 💩🚽👎  \n.  \n.  \n.   \n  \n  \nNVDA, AMD, AMZN, QQQ, CRM, BA ✔💵🚀",
        "created_utc": 1632497157,
        "id": "he3nxj1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632525957.0
    },
    {
        "author": "DraftLopsided",
        "body": "CRM is still getting better🚀",
        "created_utc": 1632490269,
        "id": "he384d7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632519069.0
    },
    {
        "author": "No-Increase-3213",
        "body": "No, he think he is a wizard and best investor, but little does he know that he know nothing, \nA day ago boeing is good, today boeing is bad\nA day ago, salesforce is overvalued today is best and buy\nA day ford is shit now recently ford is jiz\n\n\nDam this dummy *****f***cka",
        "created_utc": 1632447144,
        "id": "he1dph6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632475944.0
    },
    {
        "author": "csklmf",
        "body": "Should have picked up some CRM at low 200s",
        "created_utc": 1632427527,
        "id": "he06uix",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632456327.0
    },
    {
        "author": "Fit-Mycologist-6951",
        "body": "What is a good tech position I can get at places like Salesforce, Shopify, SAP, IBM, Cisco, Lenovo, Wework, EA, Taketwointeractive, pinterest, and other big tech companies.\n\nI am leaning towards nothing too coding-heavy like a pure software engineer. \n\nSome jobs I am thinking of are AWS solutions architect, cloud cybersecurity, database admin (how technical do I need to be for this one?), business analyst and become a senior, product manager, devops (might be coding heavy?), system admin, cloud analyst (how is pay?), cloud specialist, cloud consultant\n\nWhat do you think I should go for in terms of pay for reward/effort. \n\nMy skills: some python, SQL, visualization tools like tableau, azure fundamentals certified. Done a few things on wireshark, other cybersecurity tools i forgot. \n\nJobs have been an excel database analyst and nothing too heavy with coding yet so I’ve never done a code-heavy job.",
        "created_utc": 1632691149,
        "id": "hee9nwu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632719949.0
    },
    {
        "author": "Xarax23",
        "body": "If I were going to hold stocks and could not sell it would be Facebook, Microsoft, Nividia, Google, Salesforce.\n\nHowever, since I can I am keeping an eye on Upstart, Taskus, and Affirm especially.",
        "created_utc": 1632741474,
        "id": "hegixvg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632770274.0
    },
    {
        "author": "agoodnightasleeper",
        "body": "I dont know there was a tech selloff somewhere around then. Salesforce killed me. I can't even remember exactly its a blur. Everything was pumped to the max just before things fell apart. I was up alot on stuff like Palantir calls.",
        "created_utc": 1632714061,
        "id": "hefldui",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632742861.0
    },
    {
        "author": "GenTelGuy",
        "body": "I'm glad I got into CRM forever ago so I can enjoy these gains, but gonna buy other stuff at a discount rn",
        "created_utc": 1632715192,
        "id": "hefn73i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632743992.0
    },
    {
        "author": "1ll0gic",
        "body": "Have a little over $12,000 invested\n\nCRWD - 26%\n\nCRM - 22%\n\nUPST - 18%\n\nNVDA - 17%\n\nSOFI - 8%\n\nNET - 8%",
        "created_utc": 1633020099,
        "id": "hevafrn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633048899.0
    },
    {
        "author": "MonoDun",
        "body": "&gt; **HUBS. Its products and services aim to provide tools for customer relationship management, social media marketing, content management, lead generation, web analytics, search engine optimization, live chat, and customer support**  \n  \nNice run, OP caught the rocket around Jan/Feb 2021 is my guess, legit $33 billion market cap company like Salesforce, Zendesk, for me at least its to $$$ with other bigger players and the run up could be COVID related it could catch the elevator down when things return to normal. It went from $120 to $715 or YEAR RANGE\n$260.79 - $715.29.",
        "created_utc": 1630873231,
        "id": "hbq6ao1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630902031.0
    },
    {
        "author": "mrponcho99",
        "body": "Do you think HUBS will be bought out by salesforce?",
        "created_utc": 1630855433,
        "id": "hbp26hf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630884233.0
    },
    {
        "author": "moneylivelaugh",
        "body": "Probably not. I’ve noticed Saleforce has bolstered up their sales efforts on acquiring smaller customers. I think converting hubspot customers over to saleforce is a tough sell. The actual hubspot solution is better than salesforces. The thing salesforce did well was create a platform out of their CRM, their actual tech is pretty lame built on APEX code and Oracle databases, their secrete sauce is the ability for other companies to monetize within their platform through building apps that solve problem, it further entrenches the reliance of that particular company and saleforce.com",
        "created_utc": 1630896777,
        "id": "hbrivab",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630925577.0
    },
    {
        "author": "GuyBelowMeDoesntLift",
        "body": "What google and apple have done is made themselves integral to the process of making money, to the point where you have to use (usually multiple) google and apple products to do business. You can swap off them, but you won’t because they’re superior products and everyone else uses them. Not terribly hard to see how a monopoly like that will be able to reinforce itself for at least the next decade.\n\nCompanies like them, microsoft, salesforce will go up even though it’s mcdonald’s and starbucks that are enjoying the business consolidation. You’re right that it has to do with all the cheap money flying around, which helps everyone’s bottom line, but fundamentally big business is a very good investment to be in. \n\nIt helps that if any one business in the S&amp;P starts failing, they just kick it out and put the next-best one in. It’s guaranteed to be the best possible sample from the overall picture of business in this country, and at any rate is not worth betting against",
        "created_utc": 1631559103,
        "id": "hcq2fns",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631587903.0
    },
    {
        "author": "BlueRunner420",
        "body": "Its crazy how many people in this thread love to support salesforce and the killing of unwanted babies.",
        "created_utc": 1631491188,
        "id": "hcmonyv",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631519988.0
    },
    {
        "author": "1ll0gic",
        "body": "I don't think ARK has salesforce anymore",
        "created_utc": 1631285820,
        "id": "hcbhqu3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631314620.0
    }
]