[
    {
        "author": "Flaky-Illustrator-52",
        "body": "For Amazon at least, I can only see AWS losing market share in the long term. I use Oracle Cloud for my hobby projects simply due to its affordability and making many of their services compatible with or flat out running on FOSS projects (odd that Oracle would make something like this considering its history as a company run like a mafia). \n\nOnce they add a CDN I will have zero reason to use AWS except for work since AWS pricing is just too high considering the competition it is facing.\n\nGoogle Cloud Platform has some room to grow, but it has embraced a multi-cloud type of strategy and is making tools to facilitate that so I can see their market share increasing long term... maybe. I can't speak to them as I haven't used GCP before.\n\nAzure seems like the slightly cheaper knockoff AWS without signed cookies in its CDN which even GCP has. Not sure about this since I don't use Azure.\n\nIBM cloud is... ew... and Alibaba/Yandex clouds... we don't talk about those. But maybe some companies will use IBM if that company gets its shit together like Oracle did. For now the only reason to use IBM is if you use DB2 or something. IBM cloud is way overpriced.\n\nTl;dr AWS will lose market share in the long term",
        "created_utc": 1638403493,
        "id": "hmv66xk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638432293.0
    },
    {
        "author": "ejMileman",
        "body": "If you can’t trust China at all then dump the biggest most China dependent stocks first.  No not baba or 10cent.  Ask yourself, where does Foxconn (Chinese company) bios every Apple phone? Where does Tesla build and sell half of its cars? Where does ibm and Oracle do most of their consulting.  If you don’t trust China, you better go back to the cave.",
        "created_utc": 1638414875,
        "id": "hmvwegi",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1638443675.0
    },
    {
        "author": "potato3456",
        "body": "The Oracle has spoken",
        "created_utc": 1638619151,
        "id": "hn6q55k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638647951.0
    },
    {
        "author": "Terrible_Toe",
        "body": "I work in this space. AWS, AZURE, GCP.. oracle trailing behind them. I can't speak to other markets like BABA cloud but for USA it's certainly these 3 in that order. I can tell you that every customer I have with a cloud environment is at least in AWS.",
        "created_utc": 1638459112,
        "id": "hmxwelj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638487912.0
    },
    {
        "author": "gsasquatch",
        "body": "Oracle and IBM have overpriced products aimed at big money customers.   \n\nYou don't use Oracle or IBM unless you have to.  They are way overpriced and needlessly obfuscated.   If you can get away with not using them, you save yourself some money and not use them.    You need grey neck beards to make their stuff work.  \n\nI like that Larry was involved in the America's cup, but he cheated.  Technically, pumping was allowed in the rules that he wrote but that's not sailing, it's paddling.   He's a douche canoe, and his database sucks ass.\n\nIBM was doing cloud computing 30 years ago, which is kind of ironic that their stuff wasn't used for it.   It's also ironic that as the world moves away from or hide the POSIX model, everything is looking more like an AS400.     IBM kind of missed out on this hypertext fad, and that was their death knell.   Maybe Watson can save them, but it might be a gimmick.    \n\nCisco did a nice job of getting all the \"I want a lucrative career in IT\" pups trained in on their stuff, essentially locking themselves in as the de-facto standard.   Nobody really cares about the wires in the wall though, it's always a cost center 2 layers deep.",
        "created_utc": 1638458822,
        "id": "hmxvpk8",
        "score": 1,
        "subreddit": "investing",
        "created": 1638487622.0
    },
    {
        "author": "Enough-Pound1026",
        "body": "oracle",
        "created_utc": 1638573488,
        "id": "hn4na8g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638602288.0
    },
    {
        "author": "tomis8",
        "body": "PLTR has a PE of 474.5, has been public for 15 months, large companies with a data science team can build their own big data analytics, heck college students can build one with open source tools.  A product that AMZN, MSFT, ORCL can compete against for government contracts.",
        "created_utc": 1638583733,
        "id": "hn58qb0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638612533.0
    },
    {
        "author": "Global-Dimension507",
        "body": "Adbe (added today - dipped due to docu results but company is way more diversifiesd; plus there is high chance adbe has been taking docu market share) \n\namzn aapl nvda amd xom cost atvi pypl avgo orcl\nTotal 11 stocks bull\n\nlulu (reporting next week might align to its peers) qcom (iphone business line slowing and recent massive growth) \nTotal 2 stocks bear\n\nTook profits on docu and tsla bear positions; hope i dont regret this but i needed to record some profits in a terrible day",
        "created_utc": 1638606835,
        "id": "hn6bp19",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638635635.0
    },
    {
        "author": "Manstrife",
        "body": "Microsoft, Oracle, SAP?",
        "created_utc": 1638503579,
        "id": "hn0xarh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638532379.0
    },
    {
        "author": "pdxp2b",
        "body": "Inertia. Security and safety are a big deal and once you’re “the standard” for something, major enterprises or gov orgs need certain levels of scale, validation, authentication, etc. that smaller orgs might not be able to do. Look at fucking oracle. Adobe. Opera. \n\nAll about inertia.",
        "created_utc": 1638513907,
        "id": "hn1fqzh",
        "score": 1,
        "subreddit": "options",
        "created": 1638542707.0
    },
    {
        "author": "Inquisitor1",
        "body": "Oracle is really really expensive, any of their products. And they can unilaterally change the price at ANY time and then send inspectors the next day to check you.",
        "created_utc": 1638553471,
        "id": "hn3c9up",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638582271.0
    },
    {
        "author": "GrayBush2021",
        "body": "Speaking of oracle. That shit is going to plummet",
        "created_utc": 1638736991,
        "id": "hndbuu8",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1638765791.0
    },
    {
        "author": "theJimmybob",
        "body": "&amp;#x200B;\n\nImplied moves:\n\n$COUP 12.5%  \n$MDB 15.4%  \n$GME 16.9%  \n$CHWY 15.9%  \n$LULU 9.3%  \n$COST 4.4%  \n$AVGO 4.8%  \n$ORCL 6.6%  \n$RH 11.8%  \n$SFIX 24.1%  \n$TOL 7.2%  \n$CIEN 9.7%  \n$AZO 6.7%  \n$CONN 16.6%  \n$CHPT 12.5%$PLAY 13.3%  \n$LOVE 16.4%  \n$THO 10.9%  \n$CPB 5.4%  \n$WEBR 13.5%",
        "created_utc": 1638738736,
        "id": "hndgl3k",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638767536.0
    },
    {
        "author": "Dddiiidddiiiiddd",
        "body": "I've worked around Oracle for decades it is a shithole mister robot",
        "created_utc": 1638742435,
        "id": "hndqdme",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638771235.0
    },
    {
        "author": "sire_alston",
        "body": "I don’t think you know what Oracle does",
        "created_utc": 1638742354,
        "id": "hndq5zw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638771154.0
    },
    {
        "author": "Alpha_Trader_",
        "body": "INTC CSCO ORCL IBM have been ‘value traps’ for years. You literally could make this same argument every year for the past 10 years and still lose money.",
        "created_utc": 1638397466,
        "id": "hmusats",
        "score": 1,
        "subreddit": "investing",
        "created": 1638426266.0
    },
    {
        "author": "calipfarris01",
        "body": "Also he’s been building a very large cash position the last few months. People can say what they will about him, “hos style of trading is dead” or whatever, but no one has done it better and more consistently year after year than him. There’s a reason they call him the Oracle of Omaha.",
        "created_utc": 1638405156,
        "id": "hmv9zb6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638433956.0
    },
    {
        "author": "Bscrob",
        "body": "Here are the earnings I'm looking at, what are we thinking\n\nDesigner brands, dave and busters, conns, hooker furnishings, oracle, lakeland, and johnson outdoors",
        "created_utc": 1638644606,
        "id": "hn86cla",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638673406.0
    },
    {
        "author": "Sp00dge",
        "body": "Oracle gunna get it's shit pushed in?",
        "created_utc": 1638620676,
        "id": "hn6s7b5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638649476.0
    },
    {
        "author": "spacebizzle",
        "body": "Stephanie Link is one of the only people on CNBC with brains, nobody wants value stocks now but in software they’re going to outperform a lot of these cloud hype stocks next year.  IBM is viewed as a dino but still makes $75B revenue per year at the same market cap as SNOW which barley makes $1B.  \n\nSNOW will probably never make $75B and IBM, ORCL and MSFT will crush them if they start picking up steam.  Downtrend has already happened with Zoom, DOCU, TEAM, DDOG, NET and other high fliers.",
        "created_utc": 1638381365,
        "id": "hmtm6ae",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638410165.0
    },
    {
        "author": "knawlejj",
        "body": "Ehh enterprise system of record software is a different animal than supporting applications. I'd be more likely to open puts on MDB and PD over Oracle.",
        "created_utc": 1638629494,
        "id": "hn776yr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638658294.0
    },
    {
        "author": "salsanchips89",
        "body": "Think oracle could have a big drop Thursday?",
        "created_utc": 1638591700,
        "id": "hn5oo2r",
        "score": 1,
        "subreddit": "options",
        "created": 1638620500.0
    },
    {
        "author": "papadragon",
        "body": "Oracle always beat and raise guidance into a selloff. Imagine what will happen if they miss",
        "created_utc": 1638565265,
        "id": "hn45l4p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638594065.0
    },
    {
        "author": "zachmartin71",
        "body": "ORCL is my put play",
        "created_utc": 1638689173,
        "id": "hnaslqk",
        "score": 1,
        "subreddit": "options",
        "created": 1638717973.0
    },
    {
        "author": "VisualMod",
        "body": "**Ban Bet Created:** **/u/LookAwayPuhlease** bet **ORCL** goes from **88.24** to **86.0** before **2021-12-10 15:13:28.017310-05:00**",
        "created_utc": 1638735212,
        "id": "hnd6ylo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638764012.0
    },
    {
        "author": "VisualMod",
        "body": "&gt; You're entitled to your opinion, but I happen to disagree. Oracle is a great company with a lot of potential.",
        "created_utc": 1638741667,
        "id": "hndodhx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638770467.0
    },
    {
        "author": "Neakhanie",
        "body": "&gt;Workiva\n\nCould you explain this a little? I thought they were going up against Oracle? What is their WK’s niche?",
        "created_utc": 1638694696,
        "id": "hnazu3g",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638723496.0
    },
    {
        "author": "mba111",
        "body": "What are you autists buying calls on today? I'm keeping an eye on PYPL AAPL ORCL and DIS.",
        "created_utc": 1638368810,
        "id": "hmsriko",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638397610.0
    },
    {
        "author": "luciform44",
        "body": "But:\n\n1. It would take monk like discipline to keep DCAing into a stock that just crashed that hard. It's easy to say you would have, but you're a human with human psychological limitations.   \n2. you probably would have DCAd into a bunch of stocks that failed completely, or ones like Oracle that never got back to those highs.   \nIf the market crashes hard this year, and you DCA into the 5 individually chosen stocks, there is a good chance that 3 of them never come back, and at least 1 goes to zero in the next decade.",
        "created_utc": 1638644229,
        "id": "hn85fbd",
        "score": 1,
        "subreddit": "investing",
        "created": 1638673029.0
    },
    {
        "author": "Left_Funny_5603",
        "body": "Oracle is tricky one. Their aggressive stock buybacks create this floor. Even if revenue is flat, earnings growth just keeps going up. I feel they would have to have a major miss on cloud ERP or IAAS which just doesn't seem as likely as Netsuite and Oracle Cloud have been doing well in the marketplace and if anything, COVID has shown CFOs they need to get their ERP into the cloud and pushed up deployment timelines.",
        "created_utc": 1638651334,
        "id": "hn8m6sa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638680134.0
    },
    {
        "author": "surmoiFire",
        "body": "GTLB, PD, PATH are all young “Growth” stocks that is susceptible to market correction. But I bet ORCL would fall like CRM",
        "created_utc": 1638644029,
        "id": "hn84xz1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638672829.0
    },
    {
        "author": "SuperSultan",
        "body": "Oracle has too much debt on its balance sheet. Cisco and IBM I don’t know too much but Intel has the potential to be a multibagger",
        "created_utc": 1638423788,
        "id": "hmwdtw2",
        "score": 1,
        "subreddit": "investing",
        "created": 1638452588.0
    },
    {
        "author": "Johnathan_Ramos",
        "body": "anyone buying 65 puts for orcl for earnings could be like docu",
        "created_utc": 1638551134,
        "id": "hn368yy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638579934.0
    },
    {
        "author": "MasterKongQiu",
        "body": "I've had double the returns of Berkshire since I started investing. Anyone who started investing less than \\~15 years ago (so likely people \\~35 and under) who just bought index funds are likely ahead of Berkshire on returns. Which is my point. They haven't done anything impressive in more than a decade. What was their last great buy? Apple? What an Oracle....",
        "created_utc": 1638543856,
        "id": "hn2o8sc",
        "score": 1,
        "subreddit": "investing",
        "created": 1638572656.0
    },
    {
        "author": "__app_dev__",
        "body": "Tempting after all the action this week but I see the lowest Dec 10th Puts are already up over 400-600% for Oracle today.\n\nEven if Oracle missed big it wouldn't go down 40% - they have real products that big companies are locked into.\n\nThe same day as $ORCL announces I see $LULU and $CHWY which look tempting but I need to do more research. Normally I avoid options around when companies announce but today's like this make it too exiting to be on the sidelines. ![gif](emote|free_emotes_pack|flip_out)",
        "created_utc": 1638599993,
        "id": "hn62rmt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638628793.0
    },
    {
        "author": "mba111",
        "body": "Just bought shares for the first time ever lol. In PYPL and ORCL. Always been an options degenerate but holding options this weekend just seems to autistic.",
        "created_utc": 1638565237,
        "id": "hn45in3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638594037.0
    },
    {
        "author": "iprovo",
        "body": "Hes the oracle because he panjc sold?",
        "created_utc": 1638530432,
        "id": "hn209xe",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638559232.0
    },
    {
        "author": "Away_Expression_1852",
        "body": "Calls on LoveSac. No real price movement on GME or Oracle.",
        "created_utc": 1638633448,
        "id": "hn7fiml",
        "score": 1,
        "subreddit": "options",
        "created": 1638662248.0
    },
    {
        "author": "_Dew_it_",
        "body": "Lol this is some straight shill shit, and it's ALL over reddit. It's so fucking obvious. This is a downturn directly caused by Evergrande, subsequent liquidations, and general fear of a full market depression. I'm no oracle so I can't say which, if any, investments will be safe... but decentralized finance is still the future, no matter what.",
        "created_utc": 1638667949,
        "id": "hn9oix3",
        "score": 1,
        "subreddit": "investing",
        "created": 1638696749.0
    },
    {
        "author": "Dddiiidddiiiiddd",
        "body": "Oracle is a terrible company renowned for its shady strongarm business tactics and shitty toxic corporate culture. I reckon a few hundy in puts is worth a squirt.",
        "created_utc": 1638741888,
        "id": "hndoy1a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638770688.0
    },
    {
        "author": "Zuko2001",
        "body": "Oracle is a dying POS company. Overpriced product. Snowflake will eviscerate them over the next few years.",
        "created_utc": 1638741655,
        "id": "hndoccp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638770455.0
    },
    {
        "author": "LookAwayPuhlease",
        "body": "Oracle prolly 80 after earnings so puts",
        "created_utc": 1638741488,
        "id": "hndnwmx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638770288.0
    }
]