[
    {
        "author": "OTS_",
        "body": "Yeah! It takes a real genius to leverage your parents IBM contacts to pilfer your stolen code while strongarming your competition with litigation 💪🏼",
        "created_utc": 1626539126,
        "id": "h5j2w3s",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1626567926.0
    },
    {
        "author": "kenaraczz",
        "body": "people in 1990s I am gonna hold forever Xerox, Dell, IBM, GE, and ...America online!",
        "created_utc": 1625470768,
        "id": "h43w097",
        "score": 46,
        "subreddit": "stocks",
        "created": 1625499568.0
    },
    {
        "author": "dragoaus",
        "body": "In personal opinion, one of the major drawbacks is, that management can \"juice\" its salary and bonus by doing repurchases, since by doing repurchases, they increase the stock price (usually metric on which their Bonus is calculated).\n\nSecond major issue is that repurchases of stock robs company of valuable capital, that could have been invested in upgrading production process and R&amp;D. This specially hurts manufacturing and R&amp;D heavy companies. \nFor example from 1995 through 2019 IBM spent $201 billion buying back its own stock. \nAt one point, management of IBM was bragging, how R&amp;D expenditure of IBM has been reduced, so he could have more profits and returns to shareholders (dividends and repurchases). This worked great in short run, but results are clearly visible now, IBM is shadow of itself, company that was leading Innovation for decades is now a service company. \nManagement got its bonuses, shareholders enjoyed short-term gains, but in the end where left with shell of company.\nThis was not only reason for IBM issues, but contributed significantly.\nFor more recent example, check Boing and Intel, both wasted fortunes on buybacks. Both were cheered by Wall Street for it, but in reality, both companies underinvested in their future.\nI am not against buybacks, only it needs to clear, there is no free lunch, especially not in R&amp;D heavy Industries.",
        "created_utc": 1626222047,
        "id": "h53l888",
        "score": 27,
        "subreddit": "investing",
        "created": 1626250847.0
    },
    {
        "author": "Noovy766",
        "body": "I noticed that too, AND also the fact that he is being disingenuous by suggesting that because “X” company went up therefore WISH will go up… \n\nIt’s like saying because Apple sells computer related products and went up, therefore dead companies like AOL, Compaq, IBM or HP should also be the next Apples…",
        "created_utc": 1626357858,
        "id": "h59yjei",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1626386658.0
    },
    {
        "author": "Helpful-Win-5110",
        "body": "If you are a dividend investor, consider MO, MMM, ABBV, and IBM.  These are all long plays.",
        "created_utc": 1625290775,
        "id": "h3w5tt0",
        "score": 16,
        "subreddit": "stocks",
        "created": 1625319575.0
    },
    {
        "author": "falconne",
        "body": "If a big energy company was able to drive the cost of renewables down so much it crashes the green tech companies, then they wouldn't need to buy them out, discount or not, since that implies the big company has leapfrogged them in tech.\n\nThing is, innovation and engineering is hard. You can't solve every problem by throwing money at it. If you're coming in to a field 10 or 20 years behind in research, just being big doesn't mean you're going to catch up in tech just like that. Look at what happened to IBM in the face of upstarts like Microsoft, Google, Amazon, etc.\n\nEven if big companies can fund their own research later, that will put them a decade or more behind. Meanwhile, another big energy competitor could buy up several successful startups and quickly become the dominant player. So like with tech startups, the big players won't be looking for discounts, they'll just wait to see who makes the best proven breakthroughs and then compete with each other to acquire the best tech first.",
        "created_utc": 1626470584,
        "id": "h5g1ccl",
        "score": 16,
        "subreddit": "investing",
        "created": 1626499384.0
    },
    {
        "author": "TradingDaze",
        "body": "Sears used to sell house kits. They were most certainly into every aspect of your life.  People marked on their calendars when the new catalog would come.  The old would then be used for toilet paper. Like most of the mighty companies there was a change and they didn’t adapt. The internet should have turn them into Amazon but instead crushed them to nothing.   Digital photos killed a photo company that began with K.  The list goes on.  The point is good companies can stay good until some change rocks the business’ foundation and they adapt or die.   What will be the change for apple who knows but the fall of mighty tech companies happens (think IBM) but it’s usually a long slow decline.",
        "created_utc": 1627224249,
        "id": "h6h80gn",
        "score": 13,
        "subreddit": "stocks",
        "created": 1627253049.0
    },
    {
        "author": "BrutalHunny",
        "body": "IBM popped on earnings. Institutions itching to spend the money they withdrew today. Spy 430 tomorrow.",
        "created_utc": 1626727057,
        "id": "h5sndrj",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1626755857.0
    },
    {
        "author": "dragoaus",
        "body": "This is true for some companies like (Coca Cola, McDonald's, Banks and similar service oriented companies), which dont have large R&amp;D expenditures, while having enormous positive cash flows and have enough money to support buybacks.\n\nOn the other hand, IBM is best example of company that completely underinvested, it missed Cloud (now dominated by Microsoft and Amazon), so clearly there was enough place to grow. Plenty of other areas in IT that were growing like crazy, that IBM completely ignored.\n\nGE is another good example, Jack Welch gutted the company, turned it from manufacturing giant to financial company, and effectively run the company to the ground (Wall street was happy with dividends and buybacks). At same time Danaher (once called mini GE), was able to grow like crazy in same industries that GE discarded. Today Danaher is larger than GE.",
        "created_utc": 1626225128,
        "id": "h53r5n6",
        "score": 12,
        "subreddit": "investing",
        "created": 1626253928.0
    },
    {
        "author": "FiddleFacked",
        "body": "Say. That IBM is quite the bargain at $4.44. $25 commission here I come! 😎",
        "created_utc": 1625358066,
        "id": "h3z2ixy",
        "score": 12,
        "subreddit": "pennystocks",
        "created": 1625386866.0
    },
    {
        "author": "someonesaymoney",
        "body": "Jesus I wish people would stop with this shitty company.  Constantly overpromising and underdelivering.  Yes it looks good on paper, but they have a long way to go before the new CEO can enact any meaningful change.  They are going the way of IBM.",
        "created_utc": 1625321276,
        "id": "h3x6kj8",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1625350076.0
    },
    {
        "author": "TheBarnacle63",
        "body": "$IBM",
        "created_utc": 1625927729,
        "id": "h4pe3xq",
        "score": 11,
        "subreddit": "stocks",
        "created": 1625956529.0
    },
    {
        "author": "Investing8675309",
        "body": "Feel like people who don’t work in the industry or study the industry closely don’t understand this. Was one of my scary investing moments a few years ago since they look great on paper and I know this industry well and all the spooky stuff doesn’t show up in the financials. Now I’m paranoid for other industries I invest in that I don’t know well that I’m making bone-headed moves.\n\nBig mistake on the Pandora box you opened on IBM, a relic of tech’s Stone Age. Get ready for the “but they pay a great dividend” hordes.",
        "created_utc": 1625325075,
        "id": "h3xdk4i",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1625353875.0
    },
    {
        "author": "exe_virus",
        "body": "Big tech will be regulated to hell. Maybe not now, not in 5 years. But it will be anti monopoly regulated until a new crop emerges and overtakes. \n\nHappened with AT&amp;T bell in the 60's which led to IBM, AMD, Texas instruments, etc.\n\nThen in the 80's/90's, antitrust threats is what led these large hardware companies to outsource their software OS to Microsoft and apple and Unix. \n\nThen in the 2000's we had Microsoft Monopoly broken up and the dot com crash, which led to Google, myspace, etc. Then in '08 google and Qualcomm and all these technologies came together to form what allowed today's JavaScript web based companies like Facebook, YouTube (google), linkedin (Microsoft) you get the idea. \n\nWhat has allowed big tech to stay on top is *acquisitions*. When that power is taken away, you will see big tech's investment thesis fall apart. And lo and behold that's the kind of anti monopoly regulations we are starting to see.",
        "created_utc": 1626739602,
        "id": "h5tecii",
        "score": 10,
        "subreddit": "investing",
        "created": 1626768402.0
    },
    {
        "author": "ThePiglett",
        "body": "I have a Buddy that his grand father worked at IBM from 1937-1985. Lived in Highland NY. When he died in 2013 each relative got $1.3m. 18  He never sold a share of his IBM he was given during that time. All the splits and dividends all invested. Just middle mgt his entire career.",
        "created_utc": 1625360191,
        "id": "h3z5z37",
        "score": 10,
        "subreddit": "pennystocks",
        "created": 1625388991.0
    },
    {
        "author": "frankbuffer",
        "body": "Your stocks are on the TSX but are they also listed in the US?\n\nIf so it’s a common issue for brokers who use IBM (like TD) on the day after a holiday on just 1 market. Tomorrow it’ll be fine.",
        "created_utc": 1625233034,
        "id": "h3sx6s9",
        "score": 10,
        "subreddit": "CanadianInvestor",
        "created": 1625261834.0
    },
    {
        "author": "slickshoes_",
        "body": "I wouldn't say it's necessarily a dying a company but it feels like it's heading in the same way that IBM, Cisco &amp; Oracle are currently.\n\nMore stagnant than dying, but they are in an industry that is expected to grow long term, so it gives they impression that they are dying compared to the projected growth of their competition.",
        "created_utc": 1627295711,
        "id": "h6km4z8",
        "score": 10,
        "subreddit": "stocks",
        "created": 1627324511.0
    },
    {
        "author": "GatorsILike",
        "body": "“Nobody ever got fired for buying IBM”",
        "created_utc": 1626277699,
        "id": "h55zcsi",
        "score": 9,
        "subreddit": "SPACs",
        "created": 1626306499.0
    },
    {
        "author": "Goldonthehorizon",
        "body": "The beating wasn’t as bad as I expected today.  No circuit breakers. Even IBM is up after hours.  Fuck Delta that shit is getting old.",
        "created_utc": 1626726446,
        "id": "h5sly8v",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1626755246.0
    },
    {
        "author": "lostinspace509",
        "body": "Hi\n\nI was thinking back at AAPL stock in the 1990s when they were struggling to survive after Microsoft and IBM got the personal PC out.  AAPL would have been almost a full checklist on your list, but they got one product out there (the i-pod), home run.  Then they got another one out there (the i-phone), then wow, they took over the world and the second golden age is here.\n\nI agree, with most of it.  I just think that we simply need to add that some companies may be down but not out.  We need to do all that work you suggested (Kudos, this shows my age), but we also need to realize that companies can re-invent themselves and come back.  If so, I would like like such a \"fool\" by passing on it, would I not?\n\nI think if I could say something definitive is, you are right most of the time and then sometimes there is that one..... and damn, we missed it.. lol",
        "created_utc": 1625611700,
        "id": "h4ahu2z",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625640500.0
    },
    {
        "author": "rebeltrillionaire",
        "body": "IBM has been listed for 110 years. I don’t know if your argument is that great.",
        "created_utc": 1625546674,
        "id": "h47e5js",
        "score": 8,
        "subreddit": "stocks",
        "created": 1625575474.0
    },
    {
        "author": "GreedyHermit",
        "body": "Yeah but **IBM** beat. If it can do it, calls on everything",
        "created_utc": 1626735107,
        "id": "h5t54d1",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1626763907.0
    },
    {
        "author": "justanahoel",
        "body": "I added 10k warrants this week because [10-Q](https://sec.report/Document/0001213900-21-035565/) after hours last Friday showed an increase of roughly 960k in accrued expenses. Also here's my cliff notes from my spreadsheet:\n\n\\- SPAC play: $720m Consumer Tech\n\n\\- IPO: 09/08/2021 with 1/3 warrant\n\n\\- Gary Cohn:\n\n1. Vice-Chairman IBM\n2. Was Trump's Chief Economic Advisor (as a democrat)\n3. 30 Year COO for Goldman Sachs\n\n\\- Clifton Robbins: 40+ years of investment management experience",
        "created_utc": 1625846688,
        "id": "h4lrg34",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1625875488.0
    },
    {
        "author": "OrangeDutchy",
        "body": "The private space sector is just getting started. It's such a young company ,14years so it doesn't even have a driver's license. Speaking of which consider Ford going public in '56, look at all those decades of building up before going public. Or IBM over 100 years ago. \n\nSo profitability, being so young its all about scaling up and expanding their facilities. Any money is being used to make them more competitive. They believe they can do that by building a larger rocket which will broaden their capabilities. They will be receiving a 750million dollar cash injection. 200 of which will be going to designing and building the next rocket [Neutron ](https://youtu.be/agqxJw5ISdk). Give them room to screw up and lets put it at 250. The rest of the money could go to a number of things. Building a launch pad in New Zealand for Neutron, they have a deal to use the existing launch pad in Wallops, Virginia. They could build three more Neutron rockets, you could have a fleet. Cycling one out and brining in a new improved model throughout the years. They also have their own unique satellite bus built in-house, [Photon](https://youtu.be/LAUj-TQpn-A). First it delivers the payload of other satellites, but it's also open to configuration. I hope they have plans on scaling that up for the Neutron.  They are currently generating revenue, but no they are not cash flow positive, they hope to reach  that in a couple years.\n\nSustainable, as a private company they made it through the global recession of 08(I know that's a weak point). Their still acquiring more partners as they continue to develop their product. For instance BlackSky started by launching their prototype with another launch provider, but now they have multiple launches contracted with Rocketlab. \nThis is still a young industry, if the speculation about mining in space comes true, I believe they will be well positioned for that market. In the mean time it's all about satellites. I think we're at a crossroads, the infrastructure on a large scale could be changed. Do we continue laying and maintaining ground lines to connect everyone on the network? Or do we launch a bunch of satellites and change so everyone goes back to putting a dish on their roof? Or Winnebago, and have internet in the middle of nowhere?\n\nScaleable, I've already hinted towards scalability with a fleet of larger rockets. Possibly larger satellite busses. But it's space, so I want you to use your imagination and think if it's scalable.",
        "created_utc": 1626936479,
        "id": "h63m9g6",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1626965279.0
    },
    {
        "author": "willfightforbeer",
        "body": "Yeah, Watson in particular is a brand, not a tangible computer/model. It's all just marketing from IBM.",
        "created_utc": 1626644303,
        "id": "h5ohboy",
        "score": 7,
        "subreddit": "investing",
        "created": 1626673103.0
    },
    {
        "author": "Laakhesis",
        "body": "If Reddit exists in the 1990s, this question would rephrase to “Are IBM, Exxon, General Electric, Shell, WalMart and Coca-Cola  a hold forever stocks unless you need the cash? Will you be happy with the results 30 years from now?\n\nWinners rotate. The next big company is probably doesn’t exist at the moment..",
        "created_utc": 1626248437,
        "id": "h54q81o",
        "score": 7,
        "subreddit": "stocks",
        "created": 1626277237.0
    },
    {
        "author": "intentionally_blank_",
        "body": "People thought IBM looked promising 10 years ago.",
        "created_utc": 1627342671,
        "id": "h6na5bf",
        "score": 7,
        "subreddit": "stocks",
        "created": 1627371471.0
    },
    {
        "author": "SirGlass",
        "body": "Yes historically I could see a reason to collect dividends trading fees were high, some brokerages charged extra fees for odd lots some only sold lots of 100 at a time.\n\nSo if you had stashed away 100k in IBM stock in the 1990s collecting $500 in dividends every quarter was free. You could get a check mailed to you. Selling $500 of stock every quarter would cost you $35-60 in trading fees what is like 10% fees. Collecting a dividend was a free way to sell and bi-pass trading fees.\n\nNow the fees are so low or almost nonexistent the benefit of selling is you have the choice when/how much to sell. A dividend is a forced taxable event",
        "created_utc": 1625504954,
        "id": "h459koz",
        "score": 6,
        "subreddit": "investing",
        "created": 1625533754.0
    },
    {
        "author": "HaHawk",
        "body": "\"Dow Futures 160 Pts Higher as IBM Posts Strong Results\"\n\nwtf is this 1995 or something? where is my 1,000 point rally? jpow slacking",
        "created_utc": 1626782675,
        "id": "h5v6ezp",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1626811475.0
    },
    {
        "author": "Always_Excited",
        "body": "IBM guided up on cloud on their earning. Expect all cloud names to either run up or rip earnings. $AMZN, $MSFT, $TWLO, $SNOW, $GOOGL\n\nSnap and twitter guided up on ads on their earning. Expect all ad names to either run up or rip on earnings. $TTD, $PINS, $GOOGL, $FB, $ROKU, $AMZN\n\nIntc sucks ass but they guided up on chips. $AMD, $NVDA, $ASML, $LRCX\n\nIt's goddamn impossible to not fomo after seeing CMG, DPZ, and SNAP rip 14~20% on earning surprise. Those numbers are goddamn 20Xs on weeklies. Literally 1k to 20k.\n\nLiterally shaking in my boots to fomo into calls right now.",
        "created_utc": 1627001656,
        "id": "h6709zg",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1627030456.0
    },
    {
        "author": "pornograficionado",
        "body": "More like an early IBM.",
        "created_utc": 1626807319,
        "id": "h5wozqs",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626836119.0
    },
    {
        "author": "xilb51x",
        "body": "Risk with any tech company is someone coming in and doing it better and cheaper.\n\n$S is a great tool in this space however they only carry a small lineup vs CRWD VMWARE IBM DELL etc look at gartner magic quadrant for competitors they are the lowest in the “top right” I’m in the IT industry and I know sales pushes a lot of $S but $CRWD is a better overall product because of the other services you can get.",
        "created_utc": 1625219994,
        "id": "h3sd9l7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625248794.0
    },
    {
        "author": "TheMadBeaker",
        "body": "Thanks as always. I somehow managed to luck out and sold my $IBM literally 2 days before it took that nose dive back on July 1st I think it was. Doesn't matter if it's positive or negative news Monday, I'm almost certain it's going to take another hit as has happened to most tech stocks after their earnings, even if they smashed expectations. Thinking about buying back in if the price is good enough. It's slow growth and the dividends are good.\n\nWas also thinking of jumping on V, MA, and AXP but am also going to wait until after Friday's news.",
        "created_utc": 1626639125,
        "id": "h5o5nph",
        "score": 5,
        "subreddit": "options",
        "created": 1626667925.0
    },
    {
        "author": "FaTb0i8u",
        "body": "Ibm. Boomer stock saved me after hours",
        "created_utc": 1626733630,
        "id": "h5t20bd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626762430.0
    },
    {
        "author": "FrostyEgg2877",
        "body": "So…you’re in Riot or IBM?  This post confuses me",
        "created_utc": 1625259458,
        "id": "h3un9vw",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625288258.0
    },
    {
        "author": "drosophilus01",
        "body": "IBM is not doing shabby.  Ertsinly friday dropped a lot. With MGMT &amp; technology, IBM  will continue a stable future.",
        "created_utc": 1625323760,
        "id": "h3xb3x4",
        "score": 4,
        "subreddit": "ValueInvesting",
        "created": 1625352560.0
    },
    {
        "author": "Rodgerwilco",
        "body": "TSMC supplies Apple, NVDA, Intel, AMD, Samsung, Qualcomm, IBM, Microsoft, Sony etcetcetcetc. They are responsible for over 70% of the words chips. Sure, we're investing in US production of chips but TSMC is strategic by keeping their most important/advanced nodes on mainland Taiwan.  \n\nChina wants Taiwan. USA and allies will back Taiwan because it's a matter of national security and it's in our best interest to not get fucked by China.  \n\nYou're right, TSMC the company is not monetarily 'worth' 5 Trillion right now. But what's the price tag of a country that 70% of the worlds chips rely on? What are the collective value of lives that will be lost over that war? It's worth more than 5T in my books.",
        "created_utc": 1625959418,
        "id": "h4r3etl",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625988218.0
    },
    {
        "author": "FinndBors",
        "body": "&gt; This ain’t like 2000\n\nIn a ton of valuation metrics they are worse than any other time in history other than 2000. And when people think of 2000, they think of pets.com being ridiculous. Those shit companies were not in any index and pets.com was 300-400 million market cap at its peak (which it held for a very short time). You can equate pets.com to companies like NKLA which make gravity powered trucks. NKLA was ~ 30B market cap at its peak -- and it's still worth 5B+. Pets.com actually had a business / revenue, tons of SPACs are little more than post series A companies, all of them worth well over a billion.\n\nThe \"real\" megacap tech companies of 2000 were hewlett packard, microsoft, ibm, csco, intel, sun, compaq, etc. Their P/E ratios are much closer to the FAANGs of today. And most of the peak P/E ratios happened after a series of bad earnings.\n\nThe only thing that is legitimately different now than before is low interest rates. Which is why inflation / fed reaction is a genuine serious fear.",
        "created_utc": 1626571480,
        "id": "h5kueqq",
        "score": 4,
        "subreddit": "stocks",
        "created": 1626600280.0
    },
    {
        "author": "Mr_Dude12",
        "body": "I’m predicting that Tesla may be in for haircut once the everyone else starts to roll out their own electric cars. I cannot dismiss the ingenuity they have used to make a golf cart a true luxury car. Their weakness is business model, repairability is a nightmare, selling cars without key features then making by them subscription items? They are not cars, they are hardware with software licenses that are only profitable if you count the pollution credits sold.  Established carmakers won’t play these games, will have local service departments and build them to be a hat they are: cars. They have been doing it for a century. The chip shortages have made them focus on high end models, I kinda doubt they will start the base model production given the profitable high end models will bring. I see the brands that you know selling higher end, and coach built super high end cars. Once the patents begins to expire, we will see Chinese cars flood the low end with of the shelf tech. I am in on Nio and researching the Chinese makes that are actually producing and selling cars today. I liken it to the IBM computer “clones” of the ‘80’s. We will see compatible plug and play parts. Anyone research the scooter market? China has super factories that you can order any number of scooters, at any price point based on the quality of the parts specified, then slap your model name in them. ( check out AliBaba.com, buy a shipment, print your labels and poof, you are a scooter manufacturer). Trademarks? Pfft. We will see a flood of odd names sold over the internet just like you buy your Dell or off brand computers. Money will be in batteries, mining for rare earth metals, etc.",
        "created_utc": 1627020073,
        "id": "h67wlno",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627048873.0
    },
    {
        "author": "lattercat42",
        "body": "Bitcoin is likely here to stay and will be like investing in gold. There are other cryptos out there that will serve as the backend of practical day-to-day transaction stuff. I’m think amp, matic, cardano and because of their household names maybe even meme coins like Shiba Inu or Safemoon or Dogecoin if they can get their act together and get some legit financial organization behind them. Stellar lumens also have interesting potential. I think there is (or was) IBM involvement in that. \n\nBit issue with all these cryptos are stability relative to fiat currencies.  I can’t have a container of milk cost me $3 when I take it from the cooler and $6 by the time I get to the checkout and then $1.50 by the time I get to my car. Not good for the consumer or the supplier.",
        "created_utc": 1627302645,
        "id": "h6kvn1r",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1627331445.0
    },
    {
        "author": "Rattlessnakes",
        "body": "Amazon, IBM apparently disagree with you enough to partner with palantir to gain access to their software",
        "created_utc": 1627023381,
        "id": "h680q3s",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627052181.0
    },
    {
        "author": "OperationCommon9239",
        "body": "IBM with solid numbers. AAPL was a buying opportunity today.",
        "created_utc": 1626736565,
        "id": "h5t853k",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1626765365.0
    },
    {
        "author": "T3ndies4Days",
        "body": "50% ASTSW, 5% ADBE, 15% IBM, 20% IFP, 10% MO",
        "created_utc": 1625419615,
        "id": "h41js7e",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625448415.0
    },
    {
        "author": "feelthebern5G",
        "body": "They bought redhat and have a 4% yield. I am aware of bear case on IBM",
        "created_utc": 1625261799,
        "id": "h3usbau",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625290599.0
    },
    {
        "author": "badgebruce",
        "body": "In today's analysis Zacks now rates IBM a BUY. [https://finance.yahoo.com/news/zacks-industry-outlook-highlights-international-115311170.html](https://finance.yahoo.com/news/zacks-industry-outlook-highlights-international-115311170.html)",
        "created_utc": 1625582037,
        "id": "h48ousv",
        "score": 4,
        "subreddit": "stocks",
        "created": 1625610837.0
    },
    {
        "author": "ElectronicGuitar7834",
        "body": "I think you should stop trading with options the way you are trading.\n\nI think you should consider selling CSP to start with and don't go for meme stocks. You can collect the premium and if you get assigned then you go for Covered Calls.\n\nFord, X, IBM, GM, CRSR, MGM, BAC, AA are some shares you should look at to start.\n\nAAPL is a good investment if you consider a long time return.  Are you on a profitt with your LEAP?\n\nAre you using PMCC on AAPL you holding to get some premium?",
        "created_utc": 1626262704,
        "id": "h556jnz",
        "score": 4,
        "subreddit": "options",
        "created": 1626291504.0
    },
    {
        "author": "12MonthsinEstonian",
        "body": "this one is in a private splinter sub. recent comments include MSFT, BA, DIS, XOM, IBM, APPS, NVDA, JNJ, UVXY...\n\nso, they're cool.",
        "created_utc": 1625352845,
        "id": "h3yttv8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625381645.0
    },
    {
        "author": "AhsokaFan0",
        "body": "Or you could have bought IBM or yahoo or GE or Nokia …. It’s always obvious in retrospect, but it wasn’t obvious in 2012.",
        "created_utc": 1625807200,
        "id": "h4k5kfj",
        "score": 3,
        "subreddit": "investing",
        "created": 1625836000.0
    },
    {
        "author": "airelfacil",
        "body": "Really a wait-and-see moment for Intel.\n\nOn one hand, they could go the way of AMD and see a comeback (better management, innovation).\n\nOn the other hand, they could go the way of IBM (fewer product sales, confusing majority market share with customer loyalty).\n\nIt should be noted that IBM is still a successful company. They still hold the majority market share for mainframe computers and credit card transaction machines (you may have noticed the IBM logos on those beige old-looking cash register machines, [example](https://i.ebayimg.com/images/i/140790671093-0-1/s-l1000.jpg)). However, this has not been helpful in growing their stock price (instead they have a very good dividend).",
        "created_utc": 1627323461,
        "id": "h6m43lp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1627352261.0
    },
    {
        "author": "MustacheEmperor",
        "body": "I see how this is a reasonable take but can’t help but see the parallels to people arguing for IBM over Microsoft and Apple in the early 80s.",
        "created_utc": 1627164821,
        "id": "h6etmwx",
        "score": 3,
        "subreddit": "investing",
        "created": 1627193621.0
    },
    {
        "author": "okLetsgo311",
        "body": "RIP IBM.",
        "created_utc": 1626725326,
        "id": "h5sjbqq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626754126.0
    },
    {
        "author": "patmccock86",
        "body": "“How about Funk, 82 year old going into space?” -Faber\n\n“How about IBM?” -Cramer\n\nNever change Jimmy Chill",
        "created_utc": 1626786591,
        "id": "h5vd4tv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626815391.0
    },
    {
        "author": "PhloWers",
        "body": "You might want to read this: [https://www.nytimes.com/2021/07/16/technology/what-happened-ibm-watson.html](https://www.nytimes.com/2021/07/16/technology/what-happened-ibm-watson.html)  \n\n\nAs a quant, I can tell you this ETF is full of shit.",
        "created_utc": 1626648436,
        "id": "h5oqeud",
        "score": 3,
        "subreddit": "investing",
        "created": 1626677236.0
    },
    {
        "author": "girl_with_huge_boobs",
        "body": "about half the time, a stock kills earnings and still tanks for other reasons (usually future guidance not being as optimistic as investors would like). But also, markets are fickle and theres always economic data, jpow speeches, etc to throw a monkey wrench in things. And even if a stock does shoot up big after a killer earnings (like IBM did last week) they tend to give up those gains really fast too. IBM went from like 138 -&gt; 145 from good earnings but by the afternoon was back down to 140.25 or something",
        "created_utc": 1627132027,
        "id": "h6d172e",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1627160827.0
    },
    {
        "author": "girl_with_huge_boobs",
        "body": "all my stocks are pretty green right now so you are probably right. Loaded up on msft and ibm calls off the dip so hoping we have a nice tech day again.",
        "created_utc": 1625660831,
        "id": "h4chmzu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625689631.0
    },
    {
        "author": "Vast_Cricket",
        "body": "You do what you want with your money. It is not like holding on to IBM stock with fairly predicable trend that you can sustain long.",
        "created_utc": 1625634297,
        "id": "h4bmvqh",
        "score": 3,
        "subreddit": "options",
        "created": 1625663097.0
    },
    {
        "author": "girl_with_huge_boobs",
        "body": "completely amazed that I thought I picked the 2 shittiest earnings plays (ibm and ge) and both ended up being winners seeing how all the others are faring.",
        "created_utc": 1627418952,
        "id": "h6r1cv2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1627447752.0
    },
    {
        "author": "thewimsey",
        "body": "&gt;overly laden with cash-sucking and useless middle management \n\nAny time people mention \"middle management\" like this, I know that they are making things up. \n\nThe problem with IBM, Nokia, GM, etc. wasn't \"middle management\".  \"Middle management\" is just a meaningless pejorative term, like \"government bureaucrat\".",
        "created_utc": 1627145944,
        "id": "h6ds3nl",
        "score": 3,
        "subreddit": "investing",
        "created": 1627174744.0
    },
    {
        "author": "badgebruce",
        "body": "IBM acquires Bluetab to extend its portfolio of data and hybrid cloud consulting services.\n\n[https://newsroom.ibm.com/2021-07-15-IBM-to-Acquire-Bluetab-to-Expand-Data-and-Hybrid-Cloud-Consulting-Services-in-Europe-and-Latin-America](https://newsroom.ibm.com/2021-07-15-IBM-to-Acquire-Bluetab-to-Expand-Data-and-Hybrid-Cloud-Consulting-Services-in-Europe-and-Latin-America)",
        "created_utc": 1626397496,
        "id": "h5cdzwo",
        "score": 3,
        "subreddit": "stocks",
        "created": 1626426296.0
    },
    {
        "author": "willfightforbeer",
        "body": "But that's the point, Watson is just IBM's AI cloud services brand, not some meta-model. And matching the performance of the off-the-shelf ML packages from AWS/GCP isn't an accomplishment, it's just table stakes for offering that particular cloud service. All of those are the standard AI tasks that all the big cloud providers offer as pre-trained services, since they're easy to build out. \n\nDon't think of Watson as a model or computer, think of it as a division in IBM that builds AI products and has a mixed track record.",
        "created_utc": 1626668064,
        "id": "h5psg53",
        "score": 3,
        "subreddit": "investing",
        "created": 1626696864.0
    },
    {
        "author": "Right-Lemon-8748",
        "body": "Watson was also little more than a mimic that couldn't pass a second grade English class, also IBM killed the whole Watson thing a few years ago so I don't know how you got your information but its wrong.",
        "created_utc": 1626692284,
        "id": "h5qmb8f",
        "score": 3,
        "subreddit": "investing",
        "created": 1626721084.0
    },
    {
        "author": "AndyM134",
        "body": "What if IBM earnings beat is the sign that we’re fuk",
        "created_utc": 1626735514,
        "id": "h5t5z40",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626764314.0
    },
    {
        "author": "bungholio99",
        "body": "IBM is the hope for a turnaround and Quantumcomputing...valuable assets were sold to Lenovo which is trading low and playing 4x Dividend.\n\nIBM doesn’t fit in this list, the only pay dividend from large cash reserves but aren’t running well.",
        "created_utc": 1625299996,
        "id": "h3wg99f",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625328796.0
    },
    {
        "author": "Tagalettandi",
        "body": "IBM is next to implode",
        "created_utc": 1625686492,
        "id": "h4e0sgf",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1625715292.0
    },
    {
        "author": "badgebruce",
        "body": "\"We are excited to announce that IBM has signed a definitive agreement to acquire BoxBoat Technologies! We can’t wait to join forces with IBM’s Hybrid Cloud Services division within GBS to help organizations achieve Digital Transformation!\" [https://finance.yahoo.com/news/ibm-acquire-hybrid-cloud-consulting-151619300.html](https://finance.yahoo.com/news/ibm-acquire-hybrid-cloud-consulting-151619300.html)",
        "created_utc": 1625772136,
        "id": "h4iaei7",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625800936.0
    },
    {
        "author": "86dathoe",
        "body": "IBM",
        "created_utc": 1626763722,
        "id": "h5ujprm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626792522.0
    },
    {
        "author": "manofculture003",
        "body": "IBM remembered it ain't the 80s anymore",
        "created_utc": 1626804648,
        "id": "h5wioa5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626833448.0
    },
    {
        "author": "GreenLeafWest",
        "body": "FWIW, I am looking to begin dollar averaging into WBA starting Tuesday for its yield. Being a conservative investor, I am surprised to find  a stock I'm considering mentioned on this subreddit although I do see my CLF mentioned here occassionally.\n\nAnd since my post will undoubtedly incur the wrath of my fellow denizens here, I'll suggest taking a look at PFE for its yield and a Delta play.\n\nAnd, I concur with the other posters who cautioned against IBM. \n\nGood luck!",
        "created_utc": 1625276987,
        "id": "h3vkx5f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625305787.0
    },
    {
        "author": "Summebride",
        "body": "Jim Whitehurst leaving.  I'm not an IBM fan, but the selloff seems overdone.",
        "created_utc": 1625243848,
        "id": "h3tmsxx",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625272648.0
    },
    {
        "author": "Stubtronics101",
        "body": "That's a good question. Really our phones are a quite powerful personal computer. But I was referring to the more traditional desktop and even laptop. Doesn't really matter the point I failed to articulate is Intel is branching out from being just a cpu maker, which is the right move or else they will end up like IBM.",
        "created_utc": 1625527658,
        "id": "h46hfnm",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625556458.0
    },
    {
        "author": "fish60",
        "body": "I would say the IBM comparison is relatively fair, but comparing the highest of high tech companies, that is, potentially, one tech breakthrough from cornering the chip market for ANOTHER several decades, to Exxon doesn't seem fair. It isn't like INTC is seeing world wide protests demanding the destruction of their industry.",
        "created_utc": 1625515139,
        "id": "h45tn1v",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625543939.0
    },
    {
        "author": "Fit-Mycologist-6951",
        "body": "Grab a job at IBM and make 6 figures.\n\nBasically the same as FAANG",
        "created_utc": 1626202998,
        "id": "h52hd5x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626231798.0
    },
    {
        "author": "renatomello",
        "body": "Not really a consideration at the moment, to be honest. At this point I'm considering either staying at academia or working on companies more focused on the software integration part. Not necessarily in that order.\n\nAt the moment I see a handful of companies ahead of them in terms of both software and hardware e.g. one can actually access IonQ's hardware using IBM's (open) software Qiskit on top of accessing IBM's harware. Also IBM is at least a couple of years ahead in its hardware scaling. Moreover I consider not a controversial statement to say that IBM's (and others') hardware platform  (superconducting qubits)  is inherently less difficult to scale than ion traps, making the playing field tilted away from ion traps (and photonics tbh).\n\n&amp;#x200B;\n\nI hope they prove me wrong because that would mean extraordinary success to everybody involved in the field, but the odds are stacked against them.",
        "created_utc": 1626529146,
        "id": "h5ija17",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1626557946.0
    },
    {
        "author": "kfuzion",
        "body": "Short answer, yes that would work. But chasing stocks with high dividend yield is usually a bad idea. It can work sometimes, of course. But I'd strongly suggest looking at the holdings; oil companies, AT&amp;T, IBM, lots of riffraff has high dividends but they could easily have low/negative real return over the next 10+ years.\n\nSkimming the top 10 holdings of each - I'd go with VDADX over VHYAX. Dividend appreciation, dividend aristocrats, usually good choices. Even taking a stock like AAPL for example - if you bought it in 2013, you'd have a 5% dividend yield on your original investment ($13/share back then, $0.60 dividend now). If you bought XOM in 2013 in the $80s, you'd only be making about 4% on your original investment. In terms of total return, again you'd be better off with AAPL by a long shot. So going for quality matters.",
        "created_utc": 1626724318,
        "id": "h5sgzl3",
        "score": 2,
        "subreddit": "investing",
        "created": 1626753118.0
    },
    {
        "author": "zerobrain75",
        "body": "Holding IBM and TSLA calls which means I’ll get a solid 8 hours of sleep",
        "created_utc": 1626757878,
        "id": "h5uc3zw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626786678.0
    },
    {
        "author": "UrBoySergio",
        "body": "May as well invest in IBM",
        "created_utc": 1626909736,
        "id": "h62b6tr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626938536.0
    },
    {
        "author": "LambdaLambo",
        "body": "&gt; Those shit companies were not in any index and pets.com was 300-400 million market cap at its peak (which it held for a very short time). You can equate pets.com to companies like NKLA which make gravity powered trucks. NKLA was ~ 30B market cap at its peak -- and it's still worth 5B+\n\nThat kinda helps my point though. NKLA tanked but it has no correlation to the overall stock market, and the whole stock market went up in fact. Same with the entire SPAC bubble. Yes it was a bubble, but it popped and the market moved on its way without missing a beat. \n\n&gt; The \"real\" megacap tech companies of 2000 were hewlett packard, microsoft, ibm, csco, intel, sun, compaq, etc. Their P/E ratios are much closer to the FAANGs of today. And most of the peak P/E ratios happened after a series of bad earnings.\n\nEven then the PE ratios are not the same. MSFT in it's peak in 1999 had a PE ratio of ~82, it now has a PE ratio of ~35. \n\nI'm not gonna say that *every* company today is fine. Many are not (including NKLA). But the 2000 was endemic throughout the market (i.e. say \"internet\" and stock 10x'd at ipo). Today the market is much more varied and plenty of companies trading at high multiples do so because they're growth is very real.\n\nSorta unrelated but I personally believe tech got an insane boost from covid which is/will be driving huge digitalization efforts and  accelerate growth for many saas/cloud centric companies.",
        "created_utc": 1626578182,
        "id": "h5l7hzl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1626606982.0
    },
    {
        "author": "De_Elevator",
        "body": "IBM Watson is the marketing brand name IBM uses to sell a bunch of machine learning (AI) software services. The systems other people build for specific problems using those services, like this one for the stock market, may or may not be useful. \n\nI’m sure that custom built machine for TV with the same name was shut down long ago.",
        "created_utc": 1626663931,
        "id": "h5plf5w",
        "score": 2,
        "subreddit": "investing",
        "created": 1626692731.0
    },
    {
        "author": "JTtheBearcub",
        "body": "Ctxr, tell, wish, Tgt, IBM, APPL",
        "created_utc": 1627056724,
        "id": "h69hlh7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627085524.0
    },
    {
        "author": "WestTexasCrude",
        "body": "AMEX\n\nIBM\n\nWFC\n\nBABA",
        "created_utc": 1627101060,
        "id": "h6bzhic",
        "score": 2,
        "subreddit": "stocks",
        "created": 1627129860.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "$IBM desperately needs a Gen X/Millennial as their next president. \n\nBoomers are taking the company with them - to the grave",
        "created_utc": 1625235905,
        "id": "h3t3euh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625264705.0
    },
    {
        "author": "aBushelofApples",
        "body": "I've invested in some companies for years before dumping them. I think I was in IBM for almost 4 years. I've since moved a larger portion to s&amp;p index funds. Less to stress over.",
        "created_utc": 1625757844,
        "id": "h4hdp2r",
        "score": 2,
        "subreddit": "investing",
        "created": 1625786644.0
    },
    {
        "author": "girl_with_huge_boobs",
        "body": "hopefully can make a move on IBM tomorrow, they tanked hard on friday hoping I can scoop up some calls.",
        "created_utc": 1625539941,
        "id": "h473jyg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625568741.0
    },
    {
        "author": "KnightCPA",
        "body": "Coke. IBM. That’s all I got.",
        "created_utc": 1625932185,
        "id": "h4pn6l5",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625960985.0
    },
    {
        "author": "toy-love-xo",
        "body": "If you want something stable and good: I can recommend the t-series from Lenovo (old famous ibm-Series).",
        "created_utc": 1625948787,
        "id": "h4qjoqr",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625977587.0
    },
    {
        "author": "az226",
        "body": "IBM is still around. IBM is a $120B company. That’s just half of its peak $240B.\n\nAlso Microsoft has shown the ability to reinvent itself and pivot. And Azure is much more sticky than operating systems.",
        "created_utc": 1625941831,
        "id": "h4q6tsj",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625970631.0
    },
    {
        "author": "WolfPackWSB",
        "body": "This Weeks SPECIAL is on IBM.. $144-$149 calls loving the return just since 230p on Friday drop down to a .05 back up to .15",
        "created_utc": 1625519867,
        "id": "h462uqu",
        "score": 2,
        "subreddit": "options",
        "created": 1625548667.0
    },
    {
        "author": "Onion_jam",
        "body": "Maybe they won't kill off Intel altogether but AMD has a pretty clear path to replacing Intel as the dominant chip for PCs and servers. And I would argue that in the long run this is the smartest strategy. Taking a page from Amazon's book. \n\n\nA lot of large companies try to throw a ton of money at R&amp;D without any real strategy and then get outmaneuvered by smaller and savvier competitors. Ford, IBM, and GE are a few really good examples. They may be undervalued based on traditional metrics but if they're viewed as weak relative to their competitors the market isn't going to give a fuck.",
        "created_utc": 1627243305,
        "id": "h6iazaz",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1627272105.0
    },
    {
        "author": "AmplifiedS",
        "body": "@cclagator (OP)\n\nAll those links are wrong. For example, TSLA links to IBM, etc. You can see in the link name as well.",
        "created_utc": 1627251440,
        "id": "h6irbw9",
        "score": 2,
        "subreddit": "options",
        "created": 1627280240.0
    },
    {
        "author": "unkownsourcecode",
        "body": "stuck between IBM or Walgreen. Thoughts?",
        "created_utc": 1627406547,
        "id": "h6q919m",
        "score": 2,
        "subreddit": "stocks",
        "created": 1627435347.0
    },
    {
        "author": "fine_lit",
        "body": "Polaroid might not be the best comparison but IBM is a great example, although they had the financial and arguably technical capability to adopt new technologies such as cloud computing and artificial intelligence they were fairly late to the party and lost their advantage as one of the big tech firms fairly quickly so I would argue it’s not as much about who can afford to invest in future technologies it’s more about who’s willing to take the risk to forgo profit on their current business to possibly stay relevant in the future.",
        "created_utc": 1626536585,
        "id": "h5ixidc",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1626565385.0
    },
    {
        "author": "xxx69harambe69xxx",
        "body": "Where do data scientists go when they fail their jane street interviews \n\n-&gt; google brain\n\nwhere do data scientists go when they fail their google brain interviews\n\n\n-&gt; ibm watson\n\n\nno thanks on that tech my dude",
        "created_utc": 1626664066,
        "id": "h5plnrx",
        "score": 2,
        "subreddit": "investing",
        "created": 1626692866.0
    },
    {
        "author": "matrixnsight",
        "body": "Sort of. Anyone can make an android device. Only apple can make iOS devices. We saw how this played out in the PC space already - anyone could make a windows computer. 75% of the market now is Android. Apple is regaining small market share but it's just a cyclical oscillation that occurs due to all the other platforms dropping to zero in the last couple years. E.g. if 5% of Android users decide to give iPhone a try and 10% of iPhone users decide to switch to Android, iPhone still gains market share when it's far enough behind (so you get the feedback effect we see now).\n\nThe problem with closed platforms is they will eventually find themselves behind. There are just too many competitors - it's Apple vs. the world. Wearables, automotive, VR, AI capabilities... there are tons of ways the landscape is going to change in the next 10 years and it's highly likely Apple finds itself behind. Camera upgrades and poo emojis can only get you so far - eventually people don't need your new product.\n\nApple also charges a fee to develop apps. It's free on Android. On Android you can bypass the app store easily and download any app, even from a web address, on iOS it is a massive pain (we see this with fortnite).\n\nAlso we are at peak phones now - I only see downward pressure on margins due to the competition. Apple cannot get away with such high margins anymore - the only reason we don't see that (their margin is only slightly falling) is because they've added all these other high margin business to offset it (i.e. their services they've expanded in the last couple years). The reality is they're losing margin on their phones and they won't be able to hide that in their numbers forever (they certainly tried when they changed their reporting two years ago).\n\nSo those are my concerns with Apple. I always felt their original PE ratio was correct. Once Buffet got in on them they experienced PE expansion which is irrational IMO and I predict will correct itself at some point.\n\nThat's my opinion anyway. I think the market is really messed up right now based on bad speculation.\n\nFor reference, I'd say IBM, INTC, AAPL, and MSFT should be way closer in terms of PE than they actually are. Something more in line with reality would be IBM -&gt; 10, INTC -&gt; 14, AAPL -&gt; 18, MSFT -&gt; 22. MSFT and especially AAPL sitting at 30+ is just ridiculous, as is IBM hovering around 25. I don't think INTC is priced that unreasonably but it is compared to everything else right now.\n\n&gt; I have used both android and other OS's and I have found Apple to be the most easy for my work and personal life\n\nThis was true years ago. Not true anymore.",
        "created_utc": 1627169952,
        "id": "h6f36ro",
        "score": 2,
        "subreddit": "stocks",
        "created": 1627198752.0
    },
    {
        "author": "lilmitchie1221",
        "body": "I am a 20 year old dividend investor who puts $350 dollars biweekly into my dividend account during the summer (whenever I work and am not in school). My main holdings are KO, IBM, EPD, O, VZ, and T. On top of those main investments, I have sprinkled some money into some higher yield stocks that are considered more riskier dividend investments but have played out well over the past two years. Do any of you have some good dividend/growth stocks that I should look into? I am looking for at least a 3% dividend yield but am open to advice!",
        "created_utc": 1625145570,
        "id": "h3oh8h8",
        "score": 2,
        "subreddit": "investing",
        "created": 1625174370.0
    },
    {
        "author": "Radians",
        "body": "IBM, Black berry, Ford, Lehman brothers, bear stearns, Intel, GE.... Just to name a few.\n\nSome may be making a comeback if they still exist but just look at their charts.\n\nJust look at the top 20 companies in the s&amp;p every year going as far back as you can. Do you think you can pick the winners every year for 30 years straight? Great then do what you suggest you want to do in your post. If not(most likely scenario) then you pick an ETF that tracks a benchmark instead of the companies the make-up the benchmark.",
        "created_utc": 1625200521,
        "id": "h3roeyy",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625229321.0
    },
    {
        "author": "Outrageous-Win-9449",
        "body": "Are we in the range of considering IBM value?  Great earnings, great yield, and not sure what you all think of 25 P/E for tech, but I think once quantum comes around the stock is an absolute steal.",
        "created_utc": 1625332691,
        "id": "h3xs8kn",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1625361491.0
    },
    {
        "author": "Waking_Bear",
        "body": "I see I'm not the only one who looked for IBM.",
        "created_utc": 1625423849,
        "id": "h41sg2m",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1625452649.0
    },
    {
        "author": "mamadidntraiseabitch",
        "body": "Bought dip on IBM lmao",
        "created_utc": 1625239503,
        "id": "h3tbtup",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625268303.0
    },
    {
        "author": "atdharris",
        "body": "Buffett has sold plenty of losers in the past. Airlines, banks, IBM. Doubling down on your losers is not always wise. Not sure how the OP is losing money in this market though.",
        "created_utc": 1625852827,
        "id": "h4m527z",
        "score": 2,
        "subreddit": "investing",
        "created": 1625881627.0
    },
    {
        "author": "south153",
        "body": "IBM, they cannot keep up with Amazon and Microsoft and their revenue has been steadily decreasing. Legacy support is keeping them alive.",
        "created_utc": 1625932407,
        "id": "h4pnnrw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625961207.0
    },
    {
        "author": "Bouvill",
        "body": "Indeed, XLNX is a nice play, but AMD has a very nice potential for short+long term, so I'm all in AMD since this morning",
        "created_utc": 1625144245,
        "id": "h3oeqnk",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1625173045.0
    },
    {
        "author": "OneTrueZach",
        "body": "Yes! I forgot about that. The first one since 2001 and for a whopping $4 billion. My understanding is that they are just trying to control the number of shareholders as they complete their merger with Xilinx. \n\nEdit: Link is banned. Look for the SA article from 5/20/21 \"AMD Stock Buyback a Strong Signal\"",
        "created_utc": 1625526559,
        "id": "h46ffh3",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1625555359.0
    },
    {
        "author": "justsomescrub",
        "body": "Not so much diversifying as just straight up killing it. Operating income rose 189% from 2019 to 2020 with eps up 604%. Q1 2021 operating income is up 266% and eps is up 232% from Q1 2020 and it isn't *just* higher margins; Total revenue in 2020 was up 45% from 2019 and Q1 2021 total rev Is up 92% compared to Q1 2020. Oh and the XLNX acquisition or whatever pending china approval.\n\n  \nAND there are some tasty insider whispers IF TRUE insinuating next gen GPU performance above and beyond what they expect from Nvidia. FULL STOP. Not at bargain price points, or for certain niche applications just straight up expecting to have the best GPUs on the market next gen. Nvidia having something spicy up their sleeve non-withstanding; you never know with Nvidia.   \n\n  Add in plans to buy back 4 billion worth of shares over the next 4(?) Years with cash on hand and plans for 3nm production by 2024 and everything I hear about AMD makes me think up up up. They have new deals with Samsung for their phones and google/amazon for servers, to add to the pile of deals like making chips for Sony and Microsoft consoles. The future looks bright.\n\nI put 90% of my account in AMD last month when they were hovering around 80$ without a single worry and I haven't unwound my position yet. Hoping for 2021 guidance to be adjusted from 50% to 75% growth to set this thing off again. Or merger approval, whatever comes first.",
        "created_utc": 1625268525,
        "id": "h3v5p9o",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625297325.0
    },
    {
        "author": "Protoculture_11",
        "body": "XLNX dumps if china block since AMD paid huge premium to acquire it. \n\nMy concern is China block this if US/UK blocks ARM/NVDA. \n\nFrom China's perspective, they have no reason absent external factors to block AMD/Xilinx. \n\nStill not a bad arbitrage play to buy Xilinx though. I just prefer to hold AMD to ensure gains are locked in without relying on a merger to get approved.",
        "created_utc": 1625151438,
        "id": "h3otq29",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1625180238.0
    },
    {
        "author": "MaxJones123",
        "body": "Dilution and merger downsides were priced in as soon as they announced it. Note that Xilinx is a good EPS positive company anyways. AMD is probably just gonna rocket up until earnings if the market is good",
        "created_utc": 1625142399,
        "id": "h3obimp",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1625171199.0
    },
    {
        "author": "Successful-Two-114",
        "body": "I’m in deep. $115 June 22, $150 June 22, and I’ve got a chunk of AMD and XLNX shares in my 401k/IRA.",
        "created_utc": 1625500968,
        "id": "h451njy",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1625529768.0
    },
    {
        "author": "naik24x7",
        "body": "Xlnx better buy",
        "created_utc": 1625498146,
        "id": "h44w36c",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1625526946.0
    },
    {
        "author": "TheTendilorian",
        "body": "Xilinx will be worth 1.7 AMD share price or something  like that. Multiply amd by 1.7whatever and if it's higher than xilinx share price at deal closing then you'll make extra money but if xilinx runs past that multiplied amount you'll loose money",
        "created_utc": 1625502394,
        "id": "h454h3p",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1625531194.0
    },
    {
        "author": "Phaiiroh",
        "body": "AMD shareholders have agreed to acquire XLNX. Instead of paying with cash, they are acquiring the company entirely through stock. The two parties have agreed to a fixed ratio of 1:1.72 to do so. Meaning for every one share of XLNX owned you will receive 1.72 ish shares of AMD. Only if all necessary regulatory bodies approve the acquisition. Currently China is the last approval required until the merger can occur. Technically China can say no and AMD will most likely decide to not go on with the merger.\n\nBecause the acquisition is a fixed rate of shares. OP is staring at current market prices the value of one share of XLNX currently is cheaper than 1.72 shares of AMD creating a small discount. So if you were to buy XLNX in an attempt to buy AMD at a cheaper rate it could or could not possibly work out. It’s not a guaranteed thing.",
        "created_utc": 1625153944,
        "id": "h3oyvvg",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1625182744.0
    },
    {
        "author": "FelixJuggl3r",
        "body": "Make the whole sub believe you are directly controlled by the CCP. I would be ok with it as far as AMD gets approval for the merger with Xilinx.",
        "created_utc": 1625426613,
        "id": "h41xz5y",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1625455413.0
    },
    {
        "author": "StuartMcNight",
        "body": "If the deal is blocked XLNX will tank heavily in the short term while AMD is likely to remain almost untouched. That’s why the premium is there.\n\nSource of the problem is the Same reason why BABA, BIDU or JD have significantly lower valuations than the US equivalents. Unpredictability of China increases the risks.",
        "created_utc": 1625162893,
        "id": "h3pjpmu",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625191693.0
    },
    {
        "author": "MastersParadox",
        "body": "Waiting for China to approve AMD merger with Xilinx. AMD gonna breakout like crazy when it gets approved!! 🚀",
        "created_utc": 1625295718,
        "id": "h3wbn0s",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1625324518.0
    },
    {
        "author": "Runningflame570",
        "body": "Their competitive position is getting better with every Intel delay and increase in available capacity at TSMC. No real price target here, but they're well worth buying still.\n\nAbout the only thing that could realistically prevent further appreciation over the next year or two is if China blocks the Xilinx merger.",
        "created_utc": 1625185143,
        "id": "h3qwetf",
        "score": 6,
        "subreddit": "stocks",
        "created": 1625213943.0
    },
    {
        "author": "sunkissedsoda",
        "body": "AMD is buying XLNX when it goes through XLNX will be worth more, so buy them before the merger is finalised by China\n\nEdit: that was me paraphrasing what he’s saying not me telling you what to do btw",
        "created_utc": 1625151763,
        "id": "h3ougky",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625180563.0
    },
    {
        "author": "CoVLifter",
        "body": "Assuming this AMD/XLNX Bullshit is resolved we should see tendies in the morn...",
        "created_utc": 1625177821,
        "id": "h3qhsj2",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625206621.0
    },
    {
        "author": "Musclemagic",
        "body": "Wow, so that is pretty wild info!\n\nWith AMD popping off, if shorts get covered XLNX will boom?! I like the sound of this. Holding my XLNX for a while then :)\n\nTy again for the info",
        "created_utc": 1625237934,
        "id": "h3t84fo",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625266734.0
    },
    {
        "author": "WSOP290",
        "body": "XLNX options suck the bid ask is so fucking wide. Guess I’ll just keep riding these AMD calls to Valhalla🚀",
        "created_utc": 1625242009,
        "id": "h3ti0wu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625270809.0
    },
    {
        "author": "lil_phil_42069",
        "body": "Dear OP, you’re not the first post about this arbitrage. Smart ones already started buying xlnx in anticipation of the merger. You’re absolutely right about xilinx being on a discount right now at 140. Getting 1.7 shares of amd for every xlnx share is like free money for those who buy xlnx at this level. I have 10 shares of xlnx and accumulating more over the next few weeks",
        "created_utc": 1625239507,
        "id": "h3tbu7f",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625268307.0
    },
    {
        "author": "IdiotTetris",
        "body": "So buy calls on AMD and shares on XLNX?",
        "created_utc": 1625504329,
        "id": "h458c27",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625533129.0
    },
    {
        "author": "Musclemagic",
        "body": "AMD and Xilinx should meet in the middle before the merger occurs, but AMD is so bullish lately that it seems like it won't be dropping and XLNX will be coming up instead.\n\nTypically it seems, based on very rudimentary research, that both companies go up in general. So, if neither are likely to go down.. XLNX appears to be undervalued.\n\nMaybe I'm missing something tho, I'd really like someone with more experience than me to comment on this whole thing.",
        "created_utc": 1625236893,
        "id": "h3t5oew",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625265693.0
    },
    {
        "author": "Runningflame570",
        "body": "The increase there is explained by UK and EU regulators oking the Xilinx deal.",
        "created_utc": 1625175423,
        "id": "h3qckxk",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625204223.0
    },
    {
        "author": "Musclemagic",
        "body": "No, u/potato_piss_peepee, XLNX! Lmaolmaolmao",
        "created_utc": 1625236216,
        "id": "h3t44dv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625265016.0
    },
    {
        "author": "MrObviouslyRight",
        "body": "I suggest stocks first (which don't expire), so you get a feel on how the stock trades.\n\nOtherwise, aim for calls expiring in 2022. Once the Xilinx Merger is complete (already approved by USA, UK, EU, etc.)... the stock should sky-rocket.\n\n**Invest responsibly... and do you research!**",
        "created_utc": 1625757817,
        "id": "h4hdmvd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625786617.0
    },
    {
        "author": "TheTendilorian",
        "body": "Until xilinx passes that multiplier threshold",
        "created_utc": 1625498787,
        "id": "h44xbt3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625527587.0
    },
    {
        "author": "stevoacp1",
        "body": "i love $AMD, however comparing them to NVDA is not the right move. NVDA is a different beast in that they have the growth of AMD while having the stellar gross margins. Investors are willing to pay a premium for NVDA because of how stellar they are in printing cash and profits. That being said, AMD deserves to be priced closer to NVDA than Intel. I do not believe AMD and Su Bae are focused on catching NVDA, and are more concerned with taking market share from and crushing Intel. All the DDs written on here continue to ignore how important the Xilinx merger is. It was hated on by many, but Su Bae is no moron, she is strongly positioning AMD to dominate the CPU and Semi-Custom solutions. AMD will continue to make progress in the GPU and gaming market but the growth and tendies will come from expanding further into and dominating the server industry and building strong relationships that will establish profits for years, as well as expansion into 5g, aerospace and defense, and AI.",
        "created_utc": 1625575783,
        "id": "h48d31e",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1625604583.0
    },
    {
        "author": "rodmcmuffins",
        "body": "I don't understand the value here. The stock price is already high and now they're significantly diluting the shares by overpaying for Xilinx.   AMD will probably keep climbing, but good lord that's a high price compared to earnings.",
        "created_utc": 1625159489,
        "id": "h3pbq79",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625188289.0
    },
    {
        "author": "Musclemagic",
        "body": "I'm realizing that now, I should have searched for it before I posted, sorry about that.\n\nRight now my portfolio is 1 GME and the rest in XLNX because it just seems so safe to me. It scares me though so I wanted more info I guess, lol",
        "created_utc": 1625239661,
        "id": "h3tc7hi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625268461.0
    },
    {
        "author": "Freebyrd26",
        "body": "1.7234 multiplier to be exact.  I \"converted\" 725 AMD sh (sold) to 470 XLNX sh (bought) in my Roth months ago.  This will net me \\~810 AMD shares when the merger closes.",
        "created_utc": 1625519232,
        "id": "h461na8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625548032.0
    },
    {
        "author": "Awfu1M1n3r",
        "body": "Safer yes, but buying XLNX would be equivalent to buying AMD at a discount for the risk that the merger does not go through.",
        "created_utc": 1625510677,
        "id": "h45ku0r",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625539477.0
    },
    {
        "author": "MotivatingElectrons",
        "body": "Just buy AMD, Avago, Intel, Nvidia, Micron, and call it good. (Maybe marvel and xilinx as well, but xilinx is soon to become AMD).\n\nThe shortages will persist for awhile, but they will recover. I am long semiconductor sector. Chips are everywhere now from computers to cars to microwave ovens and IoT devices. They are not going anywhere soon...",
        "created_utc": 1625788325,
        "id": "h4j86kn",
        "score": 2,
        "subreddit": "investing",
        "created": 1625817125.0
    },
    {
        "author": "ScoopYourPoop",
        "body": "When/if China approves the XLNX merger, AMD should get a nice bump. Otherwise, you’re right about TSM. Seems to be held down by threat of China invading Taiwan but that is quite unlikely….",
        "created_utc": 1625692340,
        "id": "h4ee5e1",
        "score": 2,
        "subreddit": "options",
        "created": 1625721140.0
    },
    {
        "author": "mn_sunny",
        "body": "I added shares of XLNX around $115 (AMD equivalent of ~$73) back in May and it was the first time I added to my AMD position since the Covid bottoms (all of the rest of my shares were from 2016 and 2018).\n\nI think AMD is valued more conservatively than the vast majority of other tech/semi companies, but I still think it's ahead of itself. I wouldn't buy it at these current levels, but I'm definitely not selling either (e.g. - I told my family it was safe to buy in May when it got down in the low 70s, but said not to buy above $78-80).\n\nPeter Lynch would approve though given it's EPS growth % is greater than (or equal to) it's P/E multiple.\n\nDo a deep dive of r/amd_stock if you're really interested in AMD--there's a lot of excellent content and some extremely informed people there (I honestly don't follow AMD like I used to b/c I have enough faith in Su/Kumar/Papermaster/Norrod/Wang/etc that I'm just letting my AMD ride and spending all of my time focusing on the rest of my portfolio).",
        "created_utc": 1625594549,
        "id": "h49gfkc",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1625623349.0
    },
    {
        "author": "CoVLifter",
        "body": "No idea. Check out xlnx. Massive dump and now it’s halted. Amd and nvda dumped too",
        "created_utc": 1625175285,
        "id": "h3qc9wh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625204085.0
    },
    {
        "author": "Huff0341",
        "body": "Ultimately yes you are correct. The reason for the spread though is the risk involved if the merger doesn’t go through. While most hurdles have been passed I believe they still have China and the US to work through. It’ll tighten up the closer to the merger it gets assuming the hurdles all get jumped. It’s also one of the reasons AMD isn’t popping as much. A lot of  arbiters will short the Buying Company and buy up the target. \n\nI have not shorted AMD, but I am in on XLNX. Might double my position as I think the risk is worth the it.",
        "created_utc": 1625235621,
        "id": "h3t2rkz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625264421.0
    },
    {
        "author": "alwayswashere",
        "body": "i am dumb... please explain.... youre saying that china does not want arm to be bought by nvda (i agree). but they will block the amd/xilinx if us/uk blocks arm deal? isnt that what they want though?",
        "created_utc": 1625154665,
        "id": "h3p0hwr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625183465.0
    },
    {
        "author": "the_dean_list",
        "body": "Yeah today I closed out some $AMD OTM leaps I bought at $75 and made some decent money on with this latest run up to $94. I was thinking with the Xilinx merger upcoming and most likely what will be positive earnings, it makes sense to open up some ITM leaps and sell covered calls whenever the market or stock is trading laterally. I’m pretty bullish on the stock; I think it’ll definitely hit $120s by next year if the merger is approved.",
        "created_utc": 1625625263,
        "id": "h4b7mv6",
        "score": 2,
        "subreddit": "options",
        "created": 1625654063.0
    },
    {
        "author": "DQBIII",
        "body": "[AMD Moves Closer To Acquiring Xilinx](https://www.reddit.com/r/wallstreetbets/comments/obyzin/amd_moves_closer_to_acquiring_xilinx/)",
        "created_utc": 1625243876,
        "id": "h3tmvce",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625272676.0
    },
    {
        "author": "AntikytheraMachines",
        "body": "how would LEAP calls for XLNX work right now? would they be exchanged to AMD when the merger goes through?",
        "created_utc": 1625324736,
        "id": "h3xcx5r",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625353536.0
    },
    {
        "author": "avl0",
        "body": "Love how this acquisition was announced 9 months ago and WSB has only just realised there's arbitrage  value in owning Xilinx",
        "created_utc": 1625175961,
        "id": "h3qdrxz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625204761.0
    },
    {
        "author": "Latter-Bodybuilder33",
        "body": "The goal would be to reach a comparable market cap.. share price by itself is not a comparable metric. AMD is about 1/5th of NVDA in market cap.. and it would have to essentially fire on all cylinders in some kind of volume growth segment: AI, Autonomous, Crypto to get be in same ballpark as NVDA... not only through product pipeline but also getting folks to wean off of comparable nvda products. The xlnx acquisition may increase AMD’s TAM but Nvidia is still king in many segments.. I would be surprised if any of that rapid amd growth happens before 3-4 years ..",
        "created_utc": 1625625516,
        "id": "h4b84cu",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625654316.0
    },
    {
        "author": "RabidRabb1t",
        "body": "XLNX free money when merger completes",
        "created_utc": 1625613458,
        "id": "h4alb7v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625642258.0
    },
    {
        "author": "lefty_vengeance",
        "body": "What reason do you think this will moon.  I expect it was showing nice gains mostly because Xilinx merger felt imminent.  With today's news of China moving forward with phase 2 review, people are going to be much more inclined to take profits:\n\n\"SAMR's process involves up to three review periods: Phase One lasts 30 days, Phase Two lasts 60 days, and Phase Three lasts 90 days. The regulator decides at the end of each phase if it's ready to make a decision or if it will move on to the next phase.\"\n\nSo rather than thumbs up, we've got up to 60 days before China gives the go ahead (or delays another 3 fucking months if they so choose).\n\nI don't see it starting to heat back up until a few weeks after earnings.  I predict it sees low 80s before then.",
        "created_utc": 1625707831,
        "id": "h4faha4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625736631.0
    },
    {
        "author": "VaultBoy3",
        "body": "XLNX is KILLING ME\n\nWhere are the arbitrageurs??",
        "created_utc": 1625756274,
        "id": "h4ha8y4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625785074.0
    },
    {
        "author": "FreeEuropeYouCunts",
        "body": "&gt;AMD is dead, too.\n\n&gt;They just paid 3X what Xilinx is worth.\n\nI'll be damned! Why didn't you call the company's financial advisors to inform them that they have no idea what they're doing and that you've figured out where they should invest their billions?",
        "created_utc": 1625562634,
        "id": "h47x00l",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625591434.0
    },
    {
        "author": "RabidRabb1t",
        "body": "If you like AMD, buy XLNX which will convert to 1.7 shares amd when merger is complete.  Trading at a 20% discount to amd",
        "created_utc": 1625578751,
        "id": "h48iccj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625607551.0
    },
    {
        "author": "Musclemagic",
        "body": "Awesome, thank you for the happy vibe confirmation bias. Makes me very excited! Haha\n\nI read it's typically a &lt;10% spread, so XLNX should still be above $147 anyway. Especially since like you mentioned and everything I read seem to suggest there's no expected problems on this one.",
        "created_utc": 1625238867,
        "id": "h3tabiu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625267667.0
    },
    {
        "author": "Musclemagic",
        "body": "In this event would the calls be just like shares post-merge? There wouldn't be any issue exercising XLNX once XLNX doesn't exist?",
        "created_utc": 1625236302,
        "id": "h3t4bdv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625265102.0
    },
    {
        "author": "ryntab",
        "body": "Same here! Huge AMD fan, so I guess I’ll grab some XLNX shares.",
        "created_utc": 1625511180,
        "id": "h45lu2q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625539980.0
    },
    {
        "author": "widespreadhammocks",
        "body": "all this Gyna stuff has me worried about that AMD Xilinx deal",
        "created_utc": 1625889532,
        "id": "h4o1jd6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625918332.0
    },
    {
        "author": "ballllllllllls",
        "body": "Luckily the Xilinx acquisition will hide a bit of the slowing growth just due to the extra costs and revenue coming from them. It will give the company an excuse to not aim for crazier 50% yoy growth, and surprise investors whenever they do outperform.",
        "created_utc": 1625242852,
        "id": "h3tketd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625271652.0
    },
    {
        "author": "CoVLifter",
        "body": "I don’t think it will because of the earnings/xlnx hype. However, because I am in it, itll prob crash down to $79 after I go shit right now.",
        "created_utc": 1625234819,
        "id": "h3t0ysj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625263619.0
    },
    {
        "author": "lil_phil_42069",
        "body": "That’s what I was thinking. Fractional shares are gross. So I don’t want to buy 10 xilinx shares only to end up having 17.xx shares of amd... its gross",
        "created_utc": 1625153695,
        "id": "h3oybmj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625182495.0
    },
    {
        "author": "7thprincess",
        "body": "Their DC revenue projections last earnings call was 50% growth?\n\nGoogle signed contract, xilinx merger approved\n\nIdk amd is the freest money",
        "created_utc": 1625343785,
        "id": "h3ydehv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625372585.0
    },
    {
        "author": "Cloakedbug",
        "body": "Hold long positions for China XLNX approval. \n\nSell anything shorter dated during this run up. Like maybe literally Monday.",
        "created_utc": 1625375618,
        "id": "h3ztfs6",
        "score": 1,
        "subreddit": "options",
        "created": 1625404418.0
    },
    {
        "author": "RandomUsername2937",
        "body": "Good question, AMD is about to acquire Xilinx which will make them a huge competitor in the FPGA world.  There’s a difference of opinion on whether the path forward in AI is thru ASIC chips (Nvidia’s opinion) or CPU+FPGA (Xilinx/AMD opinion).  Time will tell I suppose.  Regardless I think you will continue to see AMD’s market cap continue to grow",
        "created_utc": 1625491906,
        "id": "h44kx23",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625520706.0
    },
    {
        "author": "lil_phil_42069",
        "body": "Kudos for you... but the strike price staying the same makes absolutely no sense. If I had xilinx $180 strike, then the converted amd contract become $180 strike as well? That would be weird because $180 strike for amd is wayyyyyy too out the money",
        "created_utc": 1625502077,
        "id": "h453ulf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625530877.0
    },
    {
        "author": "KombatWombat1639",
        "body": "I sold my AMD after it jumped a bit. Instead I put money in XLNX, since each will turn into 1.72 AMD stock. At current rates of each, that's a decent amount of bonus AMD stock for free assuming the merger completes.",
        "created_utc": 1625151446,
        "id": "h3otqpl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625180246.0
    },
    {
        "author": "danny_the_guy2",
        "body": "Yes, it is one of the reason along with several others.   Stock will move higher if q2 earnings exceed, data center growth exceeds Intc’s dc growth and laptop share increases.   And q3 outlook above estimates.\n\nWhen xlnx is done, stock will be much higher.",
        "created_utc": 1625200560,
        "id": "h3roh5y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625229360.0
    },
    {
        "author": "avl0",
        "body": "I still don't see what china blocking amd/xilinx would change if uk approve arm/nvda, xilinx and amd are already both US based and china can just block arm itself if it really wants to..",
        "created_utc": 1625175501,
        "id": "h3qcras",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625204301.0
    },
    {
        "author": "Khellendos",
        "body": "I have not had a  fun week. Bought XLNX ahead of the AMD merger, it immediately dropped $11 per share, alongside lots of my other long-game stocks. At least I don't need the money right now. I'll just sit and wait. Market goes down and market goes up. Just gotta give it time.",
        "created_utc": 1625762770,
        "id": "h4hozua",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625791570.0
    },
    {
        "author": "SpaceCatVII",
        "body": "XLNX &gt;:(",
        "created_utc": 1625837947,
        "id": "h4l8tal",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625866747.0
    },
    {
        "author": "Zmgjamison",
        "body": "What’s this mean for AMD’s potential XLNX merger?",
        "created_utc": 1625928518,
        "id": "h4pfnnv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625957318.0
    },
    {
        "author": "rodmcmuffins",
        "body": "AMD has been looking very promising lately, but it still faces the problem of massive dilution after the future Xilinx merger. The $34 billion all stock purchase far outweighs the $4 billion buyback. AMD has value, but it is already expensive before the dilution even with significant revenue growth factored in.  They aren't pulling the margins that could justify a large jump in share price.\n\nWho knows though, an irrational market like ours will probably eat this up anyway.",
        "created_utc": 1625578137,
        "id": "h48h7mk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625606937.0
    },
    {
        "author": "DQBIII",
        "body": "AMD, AMD and more AMD. $120 End of July, $180 End of the Year. XLNX merger soon!",
        "created_utc": 1625499452,
        "id": "h44ymy4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625528252.0
    },
    {
        "author": "ryntab",
        "body": "But XLNX is more expensive than AMD? What would be the conversion of XLNX to AMD shares.",
        "created_utc": 1625510785,
        "id": "h45l1td",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625539585.0
    },
    {
        "author": "ConditionPrudent1648",
        "body": "I totally recommend leaps options.\n\nFirstly, I made most of my money from leaps.\nShare price rises by 25%, my options will have at least 50% profit margin.\n\nSecondly, my holding timeline for stocks is usually 6-12 months. So leaps is great for me \nFor my kids, I will buy stocks as I am leaving it for them for the next 15-20 years.\n\nLastly, don't think u can use margin on options so it prevents me from over leveraging.\n\nPS. I usually sell my options once it get 50% profit margin and move on. Reason is that for me to get 100% profit on options, I will need the stock to rise at least 40-50% which is not really realistic, especially when I have time decay playing against me.\n\nI also buy leaps options on solid companies like Google, amazon, xlnx, baba, jd, Shopify, ttd, crm......etc\nI try not to play with meme stocks or companies that do not show at least 4 quarters of profitability.\n\nBest of luck!",
        "created_utc": 1625377879,
        "id": "h3zwaki",
        "score": 0,
        "subreddit": "stocks",
        "created": 1625406679.0
    },
    {
        "author": "ConditionPrudent1648",
        "body": "I had some pretty decent results doing leaps call options.\nUsually buy ATM call options expiring 200 days and above.\n\nUsually chose blue chip companies that are stable.\nLike apple, Shopify, amazon, crm, tsmc, xlnx etc....\nMinimum requirement is that the company should be profitable for at least 4 quarters with 15% and above profit margin. These companies tend to rise slowly and steadily with time, so your longer expiration will give it time to play the senerio out \n\nA 10% rise in stock price will usually translate to a 20% options gain for u. And a 30% stick price increase will translate to a 50% gain for u.\n\nTry to avoid meme stocks and new spac companies and volatile companies as their sudden movement downwards will mean much greater depreciation for your options also. Example, a 30% drop in share price will translate to a 50% drop in your options price.\n\nEvery leaps options I have bought till now will be profitable some point in time. U just need to prevent greed and exit accordingly.\nSuggestion is to exit around the 50% profit mark or when the option is near the half way mark. Reason is that there is time decay associated with call options, so keeping it to expiry or keeping it too long is disadvantageous to you.\n\nBest of luck!",
        "created_utc": 1625417299,
        "id": "h41f0y2",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625446099.0
    },
    {
        "author": "ConditionPrudent1648",
        "body": "I had some pretty decent results doing leaps call options.\nUsually buy ATM call options expiring 200 days and above.\n\nUsually chose blue chip companies that are stable.\nLike apple, Shopify, amazon, crm, tsmc, xlnx etc....\nMinimum requirement is that the company should be profitable for at least 4 quarters with 15% and above profit margin. These companies tend to rise slowly and steadily with time, so your longer expiration will give it time to play the senerio out \n\nA 10% rise in stock price will usually translate to a 20% options gain for u. And a 30% stick price increase will translate to a 50% gain for u.\n\nTry to avoid meme stocks and new spac companies and volatile companies as their sudden movement downwards will mean much greater depreciation for your options also. Example, a 30% drop in share price will translate to a 50% drop in your options price.\n\nEvery leaps options I have bought till now will be profitable some point in time. U just need to prevent greed and exit accordingly.\nSuggestion is to exit around the 50% profit mark or when the option is near the half way mark. Reason is that there is time decay associated with call options, so keeping it to expiry or keeping it too long is disadvantageous to you.\n\nBest of luck!",
        "created_utc": 1625417285,
        "id": "h41ezws",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625446085.0
    },
    {
        "author": "theboiflip",
        "body": "There's always a risk that the acquisition falls through and XLNX plummets.",
        "created_utc": 1625273023,
        "id": "h3vdwpd",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625301823.0
    },
    {
        "author": "Wyzrobe",
        "body": "I'm way overweight on AMD (and XLNX too, for the merger premium).  \n\nBut I would not consider it a forever stock. Technological shifts can change everything in a moment, just a few years ago INTC seemed like a forever stock, and all that's changed with AMD's rise.",
        "created_utc": 1625437077,
        "id": "h42i9gq",
        "score": -5,
        "subreddit": "stocks",
        "created": 1625465877.0
    },
    {
        "author": "Wyzrobe",
        "body": "I'm way overweight on AMD (and XLNX too, for the merger premium).  \n\nBut I would not consider it a forever stock. Technological shifts can change everything in a moment, just a few years ago INTC seemed like a forever stock, and all that's changed with AMD's rise.",
        "created_utc": 1625437062,
        "id": "h42i8fm",
        "score": -6,
        "subreddit": "stocks",
        "created": 1625465862.0
    }
]