[
    {
        "author": "awoeoc",
        "body": "I bought $40k in intel calls and I now have $10k in intel calls and sleep like a baby. I also invested heavily in BABA and lost a ton there and sleep like a baby. I also invested in JD and sleep like a baby. also bought a ton of MU and sleep like a baby. So yeah you gotta be willing to take your losses.\n\nI'm also as retarded as a baby.",
        "created_utc": 1633110542,
        "id": "hf00t2g",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1633139342.0
    },
    {
        "author": "talm0",
        "body": "China about to invade Taiwan, Mu variant about to hit in time for winter, inflation about to not be transitory, real estate bubble about to burst, US about to default, FB about to finally be valued at MySpace P/E, supply chain disruptions about to dramatically worsen, bond yields about to go to 4%, energy costs about to hit 20 year highs, market about to capitulate.\n\nHow we all feeling tonight gang?",
        "created_utc": 1633383366,
        "id": "hfem2n1",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1633412166.0
    },
    {
        "author": "NumerousIndependent8",
        "body": "I’ve been looking deeply into future earnings &amp; revenue, and valuation, and I’ve been baffled lately by the market’s disregard for valuation. It seems like everyone is chasing charts on high volume institutional phase 2 breakouts. \n\nWe’re seeing huge trade volume numbers on stocks that are way overvalued, like in the tech sector. I’m curious why there is not much trade volume in shipping, because the future earnings and revenue are massive, and they are waaaayyy undervalued.\n\nTake a look:\n\n\nSHIPPING\n- GSL (Global Ship Lease): 97% undervalued\n- GNK (Genco Shipping &amp; Trading): 89% undervalued\n- DAC (Danaos): 82% undervalued\n- EGLE (Eagle Bulk Shipping Inc.): 77% undervalued\n- ZIM (ZIM Integrated Shipping Services): 72% undervalued\n- DSX (Diana Shipping Inc.): 69% undervalued\n- SBLK (Star Bulk Carriers): 65% undervalued\n- EDRY (EuroDry): 56% undervalued\n- NMM (Navios Meritime): 48% undervalued\n- SB (Safe Bulkers): 47% undervalued\n\nBut then you also see huge undervaluation in the semiconductor industry.\n\nSEMICONDUCTORS \n- HIMX (Himax): 68% undervalued\n- MU (Micron Technology): 37% undervalued\n\nIn the energy/oil sector, we again see some huge under valuations, but at least there you also find high volume institutional investing and solid growth:\n\nENERGY/OIL\n- GPRE (Green Plains): 70% undervalued\n- CORR (CorEnergy Infrastructure Trust): 69% undervalued\n- BCEI (Bonanza Creek): 64% undervalued\n- MUR (Murphy Oil): 56% undervalued\n\nThere are plenty of other extreme examples like this, for instance in materials/mining.\n\nI’m just curious why many of these stock prices don’t see much volume trading, and they don’t bubble up closer to their true intrinsic value…",
        "created_utc": 1635407240,
        "id": "hict3r7",
        "score": 17,
        "subreddit": "stocks",
        "created": 1635436040.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/SleazyAsshole (1/0) made a bet that MU would go to 70.0 when it was 66.26 and it did, congrats autist.",
        "created_utc": 1635169642,
        "id": "hhzgp13",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1635198442.0
    },
    {
        "author": "EdgarAllansFlow",
        "body": "These were the golden years man. 90 MU calls forever ))&lt;&gt;((",
        "created_utc": 1633082560,
        "id": "heyi21b",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1633111360.0
    },
    {
        "author": "Sheeple81",
        "body": "I feel like some have already come out of it. NVDA has seen plenty of growth. Amd was down in the 70s and 80s for a long time but has seen nice gains. Meanwhile others like MU and Intel are still down. SOXX holds all of these which is why it has been really inconsistent.",
        "created_utc": 1633708396,
        "id": "hfv80e1",
        "score": 14,
        "subreddit": "stocks",
        "created": 1633737196.0
    },
    {
        "author": "hristopelov",
        "body": "$MU r/Micron",
        "created_utc": 1633362473,
        "id": "hfd22ii",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1633391273.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Lost\n\n/u/meatmask (0/1) made a bet that MU would go to 74.0 when it was 70.1 and it did not, so they were banned for a week.",
        "created_utc": 1634518288,
        "id": "hh1xrct",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1634547088.0
    },
    {
        "author": "kriverick",
        "body": "I am drunk and this made me spill mu drink 🥲😂😂🤣🤣😂🥲😂",
        "created_utc": 1635018539,
        "id": "hhrxvra",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635047339.0
    },
    {
        "author": "meatmask",
        "body": "!banbet MU 75 2w",
        "created_utc": 1634951937,
        "id": "hhoxz5f",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1634980737.0
    },
    {
        "author": "Lopsided_Distance_87",
        "body": "I will suck your dick for 1 share of MU",
        "created_utc": 1635470853,
        "id": "highiyp",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635499653.0
    },
    {
        "author": "nekomech",
        "body": "Literally any other semi.  It’s going to take INTC years to turn around.  CEO keeps pointing to the foundry that’s going to come in 2024 if there are zero delays and they execute well.\n\nAMD\nNVDA\nTXN\nMU\nTSM\nQCOM\nAMAT\n\nor just buy SOXX, or SOXL if you are feeling spicy.\n\nI will bet $100 that INTC underperforms both SOXX and QQQ in 2022.",
        "created_utc": 1635321459,
        "id": "hi80p74",
        "score": 9,
        "subreddit": "investing",
        "created": 1635350259.0
    },
    {
        "author": "nickytotherescue",
        "body": "SHOP, TSLA, NFLX &amp; AVGO. Other stocks like GOOG, MU &amp; AMD look good too.",
        "created_utc": 1633363706,
        "id": "hfd556e",
        "score": 8,
        "subreddit": "stocks",
        "created": 1633392506.0
    },
    {
        "author": "JimmyDuce",
        "body": "What about MU?",
        "created_utc": 1635233377,
        "id": "hi36jzu",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635262177.0
    },
    {
        "author": "vics80",
        "body": "I don't have anything to green to sell to average down on SNAP, FB, PYPL, MU, etc. This game blows",
        "created_utc": 1635344426,
        "id": "hi90c90",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635373226.0
    },
    {
        "author": "spyaintnobitch",
        "body": "AMD &gt; NVDA &gt; INTC &gt; MU",
        "created_utc": 1633366575,
        "id": "hfdcl29",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633395375.0
    },
    {
        "author": "PrincPaco",
        "body": "Some article I read says that MU is the best value in S&amp;P 500 but that's lime a 3 year hold to play. I want 800% on calls instead.",
        "created_utc": 1634513096,
        "id": "hh1n7gx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1634541896.0
    },
    {
        "author": "itswsf",
        "body": "The thing is that it’s actually widely known that MU is undervalued but.. it’s only seen more downside and is 81% institution owned. So as much as you’re finding a gem, it’s the job of institutions to find these gems. So why isn’t it being gobbled up on 13F. Instead it’s -20% from top 10 funds holding in Q2. \nYou may be right but numbers and actions suggest stagnation, and not bullish sentiment.",
        "created_utc": 1633992543,
        "id": "hga9x89",
        "score": 6,
        "subreddit": "options",
        "created": 1634021343.0
    },
    {
        "author": "Sudden-County-921",
        "body": "$MU- RSi indicates oversold on daily, never oversold to this extent in the last 52 weeks. Bottom is in, watch closely for a relief rally.",
        "created_utc": 1634144475,
        "id": "hgi5nkm",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1634173275.0
    },
    {
        "author": "Sudden-County-921",
        "body": "$MU shorts will get toasted tomorrow, mark this post and watch $MU closely.",
        "created_utc": 1634164333,
        "id": "hgji3gz",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1634193133.0
    },
    {
        "author": "SoldierIke",
        "body": "Oh no doubt... but the key is growth. If you don't have a catalyst in a stock, its value shrinks dramatically. Micron is a good example back in 2018. I bought it when it was at $60 and the P/E ratio was 4. I thought it was a bargain, but it preceded to dumb to $30. Now its obviously up higher. Still would take a while compared to the S&amp;P 500.\n\nMicron is cyclical which changes things a little bit. But bottom line just because a company is doing well, any sort of shrinkage in revenues or market capture causes a stock to be discounted.\n\nIf Intel exited the CPU market AMD would explode. AMD is a smaller company still the compared to Intel to match appropriate TAM. AMD is not in the semiconductor game like Intel.\n\nIntel doesn't sell more CPUs then AMD. We don't have the metric for either company, but I think you would fine that AMD is selling more Desktop and Server CPUs then Intel for the past 2-3 years. Anyone that builds computers or is making a computer server would tell you that AMD's line of CPUs is a better value (generally). Production compacity has literally nothing to do with either.\n\nI think AMD is probably overvalued, but I would rather buy AMD then INTC, cause Intel's products are worse and its losing market share. Plus AMD's FCF is growing like crazy. They made $2 per share in free cash flow, up from 0.55 cents a year ago. Meanwhile Intel hasn't changed.\n\nThat's why there is disparity in price. Intel will have to take some time to fix itself and get its technology competitive. It will eventually, but in the mean time AMD still has a lot more room to run... imagine if they took 30% of server market... which is totally possible with only two competitors.",
        "created_utc": 1635128559,
        "id": "hhxtyv7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635157359.0
    },
    {
        "author": "spyaintnobitch",
        "body": "MU $90c or gtfo\n\nMy intro to wsb in 2013",
        "created_utc": 1635120693,
        "id": "hhxegrb",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635149493.0
    },
    {
        "author": "cupnhandle",
        "body": "welcome to my almost 3 month journey of buying MU everyday. Tomorrow I am going to buy more MU!!!",
        "created_utc": 1635298345,
        "id": "hi6y53x",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635327145.0
    },
    {
        "author": "meatmask",
        "body": "I've lost 8k on one of the most solid companies in the country MU and up 300% on fukn meme movie theater. I'd say it's time for a reset",
        "created_utc": 1633098537,
        "id": "hez92au",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633127337.0
    },
    {
        "author": "_name_unavailable",
        "body": "How are my MU calls doing?",
        "created_utc": 1634049979,
        "id": "hgcyk46",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1634078779.0
    },
    {
        "author": "sereneturbulence",
        "body": "they say God hates $MU",
        "created_utc": 1634049921,
        "id": "hgcyf68",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1634078721.0
    },
    {
        "author": "thedyslexicdetective",
        "body": "I’ve held MU for a while . Is it time to unload ?",
        "created_utc": 1634826691,
        "id": "hhhtiq0",
        "score": 5,
        "subreddit": "stocks",
        "created": 1634855491.0
    },
    {
        "author": "StockTipsTips",
        "body": "Possibly Very Bullish Sectors for the Next 3-12 Months Amid Troubled Times. The examples below are certainly not buy recommendations. Just examples.\n\nBelow is a list of what I consider possible bullish sectors/industries in the next 3-12 months. We all know of the supply chain issues, the semiconductor shortages, worker shortages, &amp; inflation issues. As a result I'm considering these sectors/industries as possible bullish options in the next 3-12 Months. Please understand that I know that I did not get all stocks in each category. So if you're favored stock isn't listed, don't get angry, post it in the comments below. And if you feel I missed a sector, please let me know. \n\nAnyway enjoy the dips now because these are likely to get beefed up as the supply chain &amp; worker shortages unwind\n\n.\n\n**1)** **Inelastic &amp; Fairly inelastic Industries:** (*Meaning people usually pay for the good or service no matter what the price \"insensitive to changes in price or income\"*) \n\n* Pharmaceuticals (With highly used patented meds for diseases &amp; illnesses)\n* Oil/Gas/Natural Gas (No matter how scarce it gets, people will buy it)\n* Energy (Be careful, many producers of electricity are heavily regulated)\n\n**2) Agriculture/Farm Equipment/Fertilizers/Farm Chemicals:** People got to eat ... and have you seen the price of softs futures? This will incentivize farmers to produce more which in turn will require more farm equipment, farm construction, pesticides, herbicides, insecticides, seeds, chemicals etc. It does not help that food is rotting on the docks right now &amp; people are panic buying.\n\n* **Examples:** YTEN, TITN, NTR, SANW, DE, DOLE, ANDE, CLXT, ADM, CLXT, AGRO, AGCO, ADM, LMNR, TWI, ADM, BG, CALM, GRWG, HYFM, FMC, MEOH, \n\n**3) Semiconductors, Passive Semiconductors, &amp; Electronic Components:** Semiconductors are suffering due to worker shortages &amp; supply chain issues. However demand is seriously backed up. As soon as the supply chain situation gets straightened out expect semiconductors to explode.\n\n* **Examples:** NVDA, INTC, ARCB, AMKR, MU AMD, TXN, VSH, STM, ASYS, WOLF, TSM, QCOM, ON, ASML, NXP, AMAT, AVGO, LRCX, SWKS, MRVL, KLAC, MCHP, QRVO, SSNLF, DIOD\n\n**4) Shipping/Bulk Transportation/Freight/Transportation Services:** Shipping / Bulk Transportation / Freight / Transportation Services / are more in demand now than ever before in US history. In fact these services are in so much demand that they're clogging up the ports. And while ships sitting off the coast are likely loosing money as the supply chain issues worsen, you can bet they'll explode with business for pint up demand as the situation unwinds. \n\n* **Examples:** ZIM, JBHT, NSC, TNK, TGP, CNI, CMRE, REVG, DAC, SB, HTZZ, GRIN, ODFL, ASC, EDRY, XPO, SBLK, FWRD, BEST, CPLP, MATX, SAIA, INSW, GASS, PATI, PSHG, NETI, PXS, ULH, USDP, TFII, KNOP, KNX, CHRW, GLOP, EDRY, CVLG, PAC, HUBG, EDRY, MRTN, GLNG, NMM, HMLP, BEST, CPLP, DESP, HTLD, PWFL, GOGL, EGLE, SHIP, ZTO, LSTR, WERN, USAK, ESEA, GNK, CICOY, OROVY, PCFBY, CSX, DSX, MMLP,  PANL, KEX, NAT, UNP, WJRYY\n\n**5)** **Chemicals:** Agriculture chemicals, industrial chemicals, construction chemicals, drilling chemicals, textile chemicals, take your pick. The worlds manufacturers do not run without chemicals of some sort. And once supply chain issues are put behind us &amp; workers start to fill these empty job seats, you can bet that increased production will ramp up the demand for industrial chemicals. \n\n* **EXAMPLES:** HUN, OLN, DOW, LYB, EMN, GLTC, KRO, UNVR, CBT, MEOH, APD, OEC, VHI, ODC, TREC, TROX, IOSP, DD, KOP, ALB, LAC, PPG\n\n**6) Staffing Firms:** There's a massive worker shortage &amp; those positions will need to be filled. You can bet staffing firms are in high demand.\n\n* **EXAMPLES:** DLHC, CCRN, KFY, CBRE, HQI, RHI, WDAY, NSP, HSII, RGP, TBI, KFRC, \n\n**7) Inferior goods:** Ever notice how demand for some products go up when prices rise? These are generally inferior goods. Ramen Noodles &amp; Mac&amp;Cheese are a few examples. Dollar Stores are filled with inferior goods. \n\n* DG, DLTR, WMT, ROST, KHC",
        "created_utc": 1635443044,
        "id": "hieog2c",
        "score": 5,
        "subreddit": "investing",
        "created": 1635471844.0
    },
    {
        "author": "Lopsided_Distance_87",
        "body": "Let's play a game. I buy mu and then you also buy mu",
        "created_utc": 1633151590,
        "id": "hf2b35r",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633180390.0
    },
    {
        "author": "IntoxicatedParabola",
        "body": "Yeah. Obviously you should go long $MU",
        "created_utc": 1635454886,
        "id": "hifiam8",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635483686.0
    },
    {
        "author": "RumHam1",
        "body": "The market is pricing in an earnings peak for MU for sure.  I sold about half my position for a 10% loss, but kept some for the long term.  MU's most recent guidance does suggest at least a near term stagnation in EPS, which the market will punish harshly.  \n\nThe DD that you need to do, is to figure out if you think this EPS stall is temporary or longer term.  I think look at their projections out towards 2025 and see if you think their capital investment plans can push EPS beyond the 2.50 mark.  If so, then the next 6 months could present a very good buying opportunity as the market punishes the short term stall.\n\nIf EPS is doomed to stagnate in the 2-2.20 range, then you'll see MU hold right around a 7 PE.",
        "created_utc": 1634052161,
        "id": "hgd3q3f",
        "score": 5,
        "subreddit": "stocks",
        "created": 1634080961.0
    },
    {
        "author": "TakeGunLeaveCannoli",
        "body": "MU, you worthless piece of shit.",
        "created_utc": 1634045802,
        "id": "hgcpdk1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1634074602.0
    },
    {
        "author": "RipCity56",
        "body": "Micron? TI?",
        "created_utc": 1634445811,
        "id": "hgy5w8o",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1634474611.0
    },
    {
        "author": "UsedTask",
        "body": "MU",
        "created_utc": 1633552104,
        "id": "hfnbbri",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633580904.0
    },
    {
        "author": "LePootPootJames",
        "body": "lol MU. Haven't paid attention to this stock in a while. Apparently it's now at 66. Last time I checked it was mid 70s. Down 4% today.\n\nAny of you autists still holding these bags? /u/MartyMoho, where are you?",
        "created_utc": 1634064412,
        "id": "hgdxmhq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634093212.0
    },
    {
        "author": "Sudden-County-921",
        "body": "$MU- Bullish call buying at ask price &amp; ITM put sold at bid price, daily RSI oversold. Huge rally in the cards for tomorrow. Only 5% of total puts traded were bought at ask price, 95% of PUT options were sold at bid or below bid price.",
        "created_utc": 1634159122,
        "id": "hgj63sw",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634187922.0
    },
    {
        "author": "bearhunter429",
        "body": "I get Amazon but why is MU crashing?",
        "created_utc": 1635452189,
        "id": "hifbkyx",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635480989.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "imagine investing in MU in 2021\n\nOOF",
        "created_utc": 1634138376,
        "id": "hghqnd2",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634167176.0
    },
    {
        "author": "Sudden-County-921",
        "body": "MU is the only semi company that's oversold and a huge rally is imminent to catch up with the rest of semi stocks, talking about 20-30% rally . First PT is 74-75$.",
        "created_utc": 1634214733,
        "id": "hglqr4p",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634243533.0
    },
    {
        "author": "cupnhandle",
        "body": "MU has fucked me sideways for a long time. but god damit I think im right",
        "created_utc": 1634283716,
        "id": "hgppnin",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634312516.0
    },
    {
        "author": "notherday11",
        "body": "I have a small position in MU. I bought it when it dipped not long ago. The basic gist that I got from my DD is that it’s not severely undervalued, but just a little. They own a large corner in the DRAM market (~70% of their revenues), but memory mfg isn’t as lucrative long-term as say gpu mfg, so it has a lower projected upside and future guidance versus some other competitors in the semi/chip industry.\n\nPersonally I think it’s a good long-term price to buy in at, but your mileage may vary and I’m expecting to hold for years beyond the chip shortages to see if it pays off.",
        "created_utc": 1633533803,
        "id": "hfm3hsm",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633562603.0
    },
    {
        "author": "Frankyonreddit",
        "body": "$MU is literally the most depressing stock to have Leaps! Wtf was I thinking",
        "created_utc": 1633956491,
        "id": "hg80wsq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633985291.0
    },
    {
        "author": "jer72981m",
        "body": "Whatever happened to delta? And mu? And Gamma? Are we just on inflation now? Can't keep up.",
        "created_utc": 1634009492,
        "id": "hgba0a7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634038292.0
    },
    {
        "author": "avi6274",
        "body": "$MU 2024 leaps looking real tempting right now...",
        "created_utc": 1634056733,
        "id": "hgdeybk",
        "score": 4,
        "subreddit": "stocks",
        "created": 1634085533.0
    },
    {
        "author": "cupnhandle",
        "body": "What are we doing tomorrow brain? \n\nThe same thing we do everyday peewee\n\nBUY more MU!",
        "created_utc": 1634686273,
        "id": "hhapao1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634715073.0
    },
    {
        "author": "KingAngeli",
        "body": "What stocks are you rooting for today? Im cheering on my boys NIO PLTR TSM TLRY and my highly regarded step bro, MU. Hbu?",
        "created_utc": 1634898999,
        "id": "hhlqu0c",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634927799.0
    },
    {
        "author": "MuToTheMoon",
        "body": "I'm really thinking of quitting my job and becoming a day trader. Right now I trade at work, mostly MU and PLTR, buying and selling.\n\nI haven't made any money in 4.5 years since I opened my brokerage, but I think I could make a lot if I was watching the markets all day. Any advice for me?",
        "created_utc": 1635629598,
        "id": "hiox5zm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635658398.0
    },
    {
        "author": "me_matt_4105",
        "body": "Exactly as valid as any othert due diligence/. Micron posts better than expected quarterly results! Of course it immediately dropped 6 percent to below 70 a share, then plateaued at 71 and change, two dollars a share less than before they posted BETTER THAN EXPECTED RESULTS!\n\n&amp;#x200B;\n\nAnd Warby Parker a company that sells mail order glasses and frames and has never posted a profit is valued at nearly FIVE BILLION DOLLARS",
        "created_utc": 1633116341,
        "id": "hf0e4v2",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633145141.0
    },
    {
        "author": "wormtheology",
        "body": "Tempting pump here. Might throw my MU put profits and let it ride! Will update the thread on Monday if this post is still up. Godspeed to you and your investments.",
        "created_utc": 1633206457,
        "id": "hf5187z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633235257.0
    },
    {
        "author": "cotdt",
        "body": "There's also MU Micron, which is grossly undervalued.",
        "created_utc": 1633369971,
        "id": "hfdlnfw",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1633398771.0
    },
    {
        "author": "clarence_worley90",
        "body": "taiwan preparing for war\n\nvery bullish\n\nMU calls ?",
        "created_utc": 1633357443,
        "id": "hfcqmlh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633386243.0
    },
    {
        "author": "Stonks1337",
        "body": "Smart to take profits. Did the same with my AMD. I think in Ben graham intelligent investor he talks about taking profits because valuations change when your stocks go up, and maybe it’s better to sell and put that money to work elsewhere. SOXX and SMH to answer your question. My semi money for me I personally believe micron technologies MU is going to explode cuz of the oligopoly it has on random access memory chips and the only real US producer of em. Once people have their other computer parts and this stock is appreciated again I think it’ll double probably in a couple years. Blackrock SOXX semi ETF has about 3% micron MU. SMH is a good etf cuz it has Taiwan semiconductor",
        "created_utc": 1633930833,
        "id": "hg74llq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633959633.0
    },
    {
        "author": "cupnhandle",
        "body": "My last dying breath will be buying MORE otm MU calls",
        "created_utc": 1634174453,
        "id": "hgk3lvf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634203253.0
    },
    {
        "author": "jjr08009",
        "body": "MU on discount",
        "created_utc": 1634053396,
        "id": "hgd6teg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634082196.0
    },
    {
        "author": "stoptherage",
        "body": "It would be amazing for them they would get access to TSMC as well as micron that makes memory... as well as a lot of the supply chain for tesla.",
        "created_utc": 1633816237,
        "id": "hg1478d",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633845037.0
    },
    {
        "author": "IntoxicatedParabola",
        "body": "Imagine not investing every. Single. Penny you own in $MU",
        "created_utc": 1633953739,
        "id": "hg7wfil",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633982539.0
    },
    {
        "author": "uradumbfuker",
        "body": "Gold bond works for mu sweaty nuts",
        "created_utc": 1635175059,
        "id": "hhzsrrq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635203859.0
    },
    {
        "author": "MegaSalchichon",
        "body": "Ahh MU to 40 days",
        "created_utc": 1635481666,
        "id": "hih3kth",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635510466.0
    },
    {
        "author": "DavidAg02",
        "body": "Just published yesterday... Was the first time I'd ever heard of MU\n\nhttps://investorplace.com/2021/10/mu-stock-dividend-combined-with-buybacks-produces-2-2-total-yield/",
        "created_utc": 1633533178,
        "id": "hfm20cd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633561978.0
    },
    {
        "author": "mjong99",
        "body": "Who hurt you today MU?",
        "created_utc": 1633442802,
        "id": "hfhb0vv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633471602.0
    },
    {
        "author": "GigaChadEnergy",
        "body": "MU is as boring as riding a roller coaster. As you mentioned its cyclical so its not like PEP where you top up every so often and forget about it. You have to monitor what part of cycle you are in and act accordingly. Not very boring but pretty intense imo.\n\nI also would be careful with being confident on guessing which part of cycle we are in. Unless you have done extensive research and know the industry well statements like \"still has significant upside especially with ever increasing memory demand and strong financials\" are harbingers of poor returns. It is very very hard to time the cycle and many smart people been told to clear their desk because they timed it wrong so when I read something like that on Reddit of all places I always roll my eyes.\n\nIn any case if you truly want boring go with utilities or medical or consumer staples.",
        "created_utc": 1633535541,
        "id": "hfm7nx9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633564341.0
    },
    {
        "author": "zjz",
        "body": "you'd say\n\n!banbet MU 5 1w \n\nif you thought the stock was going to 5 within 1w.",
        "created_utc": 1633757769,
        "id": "hfy6gzb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633786569.0
    },
    {
        "author": "spacebizzle",
        "body": "The first time in realized WSB was cool was when someone drove to Micron Headquarters and put a Veladora (Virgen De Guadalupe candle) and a picture of their CEO as an alter for MU 90c 😂. anyone remember that? Hilarious",
        "created_utc": 1633922826,
        "id": "hg6r4m0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633951626.0
    },
    {
        "author": "animositisomina35",
        "body": "See you at the center of the Earth MU.",
        "created_utc": 1634060915,
        "id": "hgdp3hr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634089715.0
    },
    {
        "author": "Stonks1337",
        "body": "Agreed. Moat is deeper than one might think. Mr market I’m betting on is mispricing here. Those chip foundrys take a lot of investment capital, time, research, resources. Then you actually have to make the freaking chips. Micron is the only one in the Western Hemisphere who has done the heavy lifting and building of the foundation as far as random access memory chips go and the means to make. RAM is theorized to have compounded growth as world industries embrace tech like AI big data computers mobile devices etc. Micron has oversupplied the market with its chips before, but now that’s its more consciously aware of its oligopolistic standing in the world it will behave as such to benefit itself and shareholders. It will be a lot more decisive with their pricing power. I see a bright future holding shares and waiting",
        "created_utc": 1634077609,
        "id": "hgetkxn",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1634106409.0
    },
    {
        "author": "Sudden-County-921",
        "body": "Watch MU closely as it' reversing. Bulls/whales getting all semi/tech stocks free from retail investors then rally starts.",
        "created_utc": 1634145697,
        "id": "hgi8qmq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634174497.0
    },
    {
        "author": "Okchaz",
        "body": "All in on MU at these prices, bottom of the falling wedge",
        "created_utc": 1634213394,
        "id": "hgloh7l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634242194.0
    },
    {
        "author": "Automatic-Long-4850",
        "body": "Over time you can’t go wrong investing in a healthy mix of companies like Micron, Nvidia, AMD &amp; Qualcomm. I think those are some of the larger players in that Fidelity fund. Semiconductors make up 6% of my long term portfolio.",
        "created_utc": 1634429579,
        "id": "hgxa38b",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634458379.0
    },
    {
        "author": "the_beast93112",
        "body": "PTON is going for my number one worst buy behind MU and CRSR",
        "created_utc": 1634568413,
        "id": "hh43tbi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634597213.0
    },
    {
        "author": "Jericho3434",
        "body": "Ahhh, MU, that MartyMoho guy got me to buy MU because it made him a millionaire (which he lost btw from diamond handing). One of my first retarded experiences here.",
        "created_utc": 1634628128,
        "id": "hh7h081",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634656928.0
    },
    {
        "author": "imsilver4fukyou",
        "body": "MU![img](emote|t5_2th52|4276)SK",
        "created_utc": 1634664233,
        "id": "hh97yuo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634693033.0
    },
    {
        "author": "cupnhandle",
        "body": "im buying more MU tomorow",
        "created_utc": 1634711435,
        "id": "hhbzpn7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634740235.0
    },
    {
        "author": "Okchaz",
        "body": "MU pre market pop",
        "created_utc": 1635166221,
        "id": "hhz9ypj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635195021.0
    },
    {
        "author": "FinalDevice",
        "body": "I own a bunch of shares. It's not a short-term play, and it's not one to play options on. \n\nIntel will come back. Their new generation of chips looks promising, and the feds are starting to see chip fabrication capacity as a matter of national importance -- so they're not interested in seeing Intel's fabs fail. \n\nBut it's going to be a slog. FWIW I also believe in MU $90, but this time around I'm smart enough to buy shares and just wait. Gambles are good for short term price action, and both INTC and MU are long-term plays.",
        "created_utc": 1635715611,
        "id": "hit8wui",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635744411.0
    },
    {
        "author": "Smilinkite",
        "body": "Intel is obviously trading at better valuations. \n\nMicron also has a p/e below 15 and good prospects.",
        "created_utc": 1635536508,
        "id": "hijxi8s",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635565308.0
    },
    {
        "author": "meatmask",
        "body": "I put micron 74 and the automod corrected me to put 5 as in % I think micron will touch 84 in the next month.  The bottom is in at 70",
        "created_utc": 1633801070,
        "id": "hg05xcp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633829870.0
    },
    {
        "author": "VisualMod",
        "body": "Ban Bet Created\n---\n**/u/SleazyAsshole** bet **MU** goes to **70.0** in **2 weeks**",
        "created_utc": 1634057868,
        "id": "hgdhp9t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634086668.0
    },
    {
        "author": "Sudden-County-921",
        "body": "$MU reversing, large call buying activity for 68$ and 69$ strike Oct 29.",
        "created_utc": 1634140276,
        "id": "hghvb1h",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634169076.0
    },
    {
        "author": "cupnhandle",
        "body": "I think I now own like 900 shares of MU or something... im going to be honest I am kinda retarded",
        "created_utc": 1634719336,
        "id": "hhc8twp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634748136.0
    },
    {
        "author": "PotentialFun3",
        "body": "LOL at the stupid comment.  MU down over 1% pre-market, and it will probably go down more once he starts speaking so I just put a buy in at $66.41.",
        "created_utc": 1634735430,
        "id": "hhcvfoq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1634764230.0
    },
    {
        "author": "puffinnbluffin",
        "body": "MU",
        "created_utc": 1634253766,
        "id": "hgo73y6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634282566.0
    },
    {
        "author": "cupnhandle",
        "body": "I bought even more mu today....",
        "created_utc": 1634680022,
        "id": "hhabjwa",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634708822.0
    },
    {
        "author": "cupnhandle",
        "body": "**I am here to post my daily obligatory statement that I bought more MU!!!!!!**",
        "created_utc": 1635274749,
        "id": "hi5e8jp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635303549.0
    },
    {
        "author": "Lopsided_Distance_87",
        "body": "Bro sk hynix is up 6 percent. That means MU is going to sky rocket. Fuck ya",
        "created_utc": 1635394887,
        "id": "hicbz4e",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635423687.0
    },
    {
        "author": "Lopsided_Distance_87",
        "body": "If you dont own MU I feel sorry for you. It's about to pop",
        "created_utc": 1635395011,
        "id": "hicc71k",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635423811.0
    },
    {
        "author": "meatmask",
        "body": "AtM micron no IV",
        "created_utc": 1633668519,
        "id": "hftieaf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633697319.0
    },
    {
        "author": "Sudden-County-921",
        "body": "MU will bounce above $70 by EOW. Big bullish bets all day for 70$ calls.",
        "created_utc": 1634175344,
        "id": "hgk5fvy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634204144.0
    },
    {
        "author": "Sudden-County-921",
        "body": "$MU- Bullish activity. ITM PUT 70$ strike sold for oct 15, usually acts as a call and the PUT sellers will push the stock price higher to render the calls worthless by expiration.",
        "created_utc": 1634152760,
        "id": "hgiqiej",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634181560.0
    },
    {
        "author": "zeebee098",
        "body": "Why didn’t I buy those MU calls at close fackkkkk",
        "created_utc": 1634227638,
        "id": "hgmjfjw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634256438.0
    },
    {
        "author": "-Gol-D-Roger--",
        "body": "So undervalued, similar to MU. With the shortage we have nowadays with chips and that prices are ridiculous... So weird this situation",
        "created_utc": 1634485463,
        "id": "hgzulxg",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1634514263.0
    },
    {
        "author": "CoacHdi",
        "body": "singapore coronavirus cases; people misunderstanding micron ER guidance",
        "created_utc": 1634665403,
        "id": "hh9ax3b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634694203.0
    },
    {
        "author": "ThumbBee92",
        "body": "Yeap. \n\nINTC is around or below 20. \nTSM was below 20 right before 2019. \nMicron is below 20 now.",
        "created_utc": 1634766025,
        "id": "hhey9d0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634794825.0
    },
    {
        "author": "tshark24",
        "body": "MU 90 calls. Free money.",
        "created_utc": 1634842871,
        "id": "hhix8z9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634871671.0
    },
    {
        "author": "datix",
        "body": "MU $90c 10/22 who says no?",
        "created_utc": 1634842631,
        "id": "hhiwntv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634871431.0
    },
    {
        "author": "TopStrategist",
        "body": "The new MU",
        "created_utc": 1634577163,
        "id": "hh4ophd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634605963.0
    },
    {
        "author": "xflashbackxbrd",
        "body": "All three of those are laggards though. MU earnings always tank semis when they come out, it's a guarantee. Same for INTC. TSM is weird because their earnings are great but there's always some overreaction to China sabre rattling that sends it retracing.",
        "created_utc": 1634774150,
        "id": "hhfgajp",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634802950.0
    },
    {
        "author": "VisualMod",
        "body": "**Ban Bet Created:** **/u/meatmask** bet **MU** goes from **67.47** to **75.0** before **2021-11-05 21:19:07.079632-04:00**",
        "created_utc": 1634951953,
        "id": "hhoy0bh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634980753.0
    },
    {
        "author": "Fatherof10",
        "body": "There is so much information out there on this.\n\nNetlist has patents on the ddram that everyone uses. For 13 years companies have been stealing it.\n\nGoogle, Samsung, SK Hynix, TI, Micron, Diablo.....\n\nInternational patent courts have ruled in favor of netlist and upheld patents to so a lot of lawsuits are finally after 12+ years coming to bear fruit.\n\nGoogle would not exist as the leader in search engines if they had not stolen and used (continues) Nlst tech all these years.\n\n\n$45-$150 my guess after 1st couple cases close and much higher as they finally grow.\n\nThe reason is the own the patents for the standards now and for the future in server and computer/tech memory systems. AI, AR, servers.....everything needs and uses them",
        "created_utc": 1634925083,
        "id": "hhnb7ri",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1634953883.0
    },
    {
        "author": "vics80",
        "body": "surely MU and CHWY will have their day, but I wish it was sooner",
        "created_utc": 1635157536,
        "id": "hhyx8li",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635186336.0
    },
    {
        "author": "TakeGunLeaveCannoli",
        "body": "MU goes up and goes down, never a miscommunication. You can't explain that.",
        "created_utc": 1635169977,
        "id": "hhzhesx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635198777.0
    },
    {
        "author": "awoeoc",
        "body": "I bought $40k in intel calls and I now have $10k in intel calls and sleep like a baby. I also invested heavily in BABA and lost a ton there and sleep like a baby. I also invested in JD and sleep like a baby. also bought a ton of MU and sleep like a baby. So yeah you gotta be willing to take your losses.\n\nI'm also as retarded as a baby.",
        "created_utc": 1633110542,
        "id": "hf00t2g",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1633139342.0
    },
    {
        "author": "talm0",
        "body": "China about to invade Taiwan, Mu variant about to hit in time for winter, inflation about to not be transitory, real estate bubble about to burst, US about to default, FB about to finally be valued at MySpace P/E, supply chain disruptions about to dramatically worsen, bond yields about to go to 4%, energy costs about to hit 20 year highs, market about to capitulate.\n\nHow we all feeling tonight gang?",
        "created_utc": 1633383366,
        "id": "hfem2n1",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1633412166.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/SleazyAsshole (1/0) made a bet that MU would go to 70.0 when it was 66.26 and it did, congrats autist.",
        "created_utc": 1635169642,
        "id": "hhzgp13",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1635198442.0
    },
    {
        "author": "EdgarAllansFlow",
        "body": "These were the golden years man. 90 MU calls forever ))&lt;&gt;((",
        "created_utc": 1633082560,
        "id": "heyi21b",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1633111360.0
    },
    {
        "author": "Sheeple81",
        "body": "I feel like some have already come out of it. NVDA has seen plenty of growth. Amd was down in the 70s and 80s for a long time but has seen nice gains. Meanwhile others like MU and Intel are still down. SOXX holds all of these which is why it has been really inconsistent.",
        "created_utc": 1633708396,
        "id": "hfv80e1",
        "score": 14,
        "subreddit": "stocks",
        "created": 1633737196.0
    },
    {
        "author": "hristopelov",
        "body": "$MU r/Micron",
        "created_utc": 1633362473,
        "id": "hfd22ii",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1633391273.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Lost\n\n/u/meatmask (0/1) made a bet that MU would go to 74.0 when it was 70.1 and it did not, so they were banned for a week.",
        "created_utc": 1634518288,
        "id": "hh1xrct",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1634547088.0
    },
    {
        "author": "kriverick",
        "body": "I am drunk and this made me spill mu drink 🥲😂😂🤣🤣😂🥲😂",
        "created_utc": 1635018539,
        "id": "hhrxvra",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635047339.0
    },
    {
        "author": "meatmask",
        "body": "!banbet MU 75 2w",
        "created_utc": 1634951937,
        "id": "hhoxz5f",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1634980737.0
    },
    {
        "author": "nickytotherescue",
        "body": "SHOP, TSLA, NFLX &amp; AVGO. Other stocks like GOOG, MU &amp; AMD look good too.",
        "created_utc": 1633363706,
        "id": "hfd556e",
        "score": 8,
        "subreddit": "stocks",
        "created": 1633392506.0
    },
    {
        "author": "spyaintnobitch",
        "body": "AMD &gt; NVDA &gt; INTC &gt; MU",
        "created_utc": 1633366575,
        "id": "hfdcl29",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633395375.0
    },
    {
        "author": "PrincPaco",
        "body": "Some article I read says that MU is the best value in S&amp;P 500 but that's lime a 3 year hold to play. I want 800% on calls instead.",
        "created_utc": 1634513096,
        "id": "hh1n7gx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1634541896.0
    },
    {
        "author": "itswsf",
        "body": "The thing is that it’s actually widely known that MU is undervalued but.. it’s only seen more downside and is 81% institution owned. So as much as you’re finding a gem, it’s the job of institutions to find these gems. So why isn’t it being gobbled up on 13F. Instead it’s -20% from top 10 funds holding in Q2. \nYou may be right but numbers and actions suggest stagnation, and not bullish sentiment.",
        "created_utc": 1633992543,
        "id": "hga9x89",
        "score": 6,
        "subreddit": "options",
        "created": 1634021343.0
    },
    {
        "author": "Sudden-County-921",
        "body": "$MU- RSi indicates oversold on daily, never oversold to this extent in the last 52 weeks. Bottom is in, watch closely for a relief rally.",
        "created_utc": 1634144475,
        "id": "hgi5nkm",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1634173275.0
    },
    {
        "author": "Sudden-County-921",
        "body": "$MU shorts will get toasted tomorrow, mark this post and watch $MU closely.",
        "created_utc": 1634164333,
        "id": "hgji3gz",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1634193133.0
    },
    {
        "author": "SoldierIke",
        "body": "Oh no doubt... but the key is growth. If you don't have a catalyst in a stock, its value shrinks dramatically. Micron is a good example back in 2018. I bought it when it was at $60 and the P/E ratio was 4. I thought it was a bargain, but it preceded to dumb to $30. Now its obviously up higher. Still would take a while compared to the S&amp;P 500.\n\nMicron is cyclical which changes things a little bit. But bottom line just because a company is doing well, any sort of shrinkage in revenues or market capture causes a stock to be discounted.\n\nIf Intel exited the CPU market AMD would explode. AMD is a smaller company still the compared to Intel to match appropriate TAM. AMD is not in the semiconductor game like Intel.\n\nIntel doesn't sell more CPUs then AMD. We don't have the metric for either company, but I think you would fine that AMD is selling more Desktop and Server CPUs then Intel for the past 2-3 years. Anyone that builds computers or is making a computer server would tell you that AMD's line of CPUs is a better value (generally). Production compacity has literally nothing to do with either.\n\nI think AMD is probably overvalued, but I would rather buy AMD then INTC, cause Intel's products are worse and its losing market share. Plus AMD's FCF is growing like crazy. They made $2 per share in free cash flow, up from 0.55 cents a year ago. Meanwhile Intel hasn't changed.\n\nThat's why there is disparity in price. Intel will have to take some time to fix itself and get its technology competitive. It will eventually, but in the mean time AMD still has a lot more room to run... imagine if they took 30% of server market... which is totally possible with only two competitors.",
        "created_utc": 1635128559,
        "id": "hhxtyv7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635157359.0
    },
    {
        "author": "spyaintnobitch",
        "body": "MU $90c or gtfo\n\nMy intro to wsb in 2013",
        "created_utc": 1635120693,
        "id": "hhxegrb",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635149493.0
    },
    {
        "author": "meatmask",
        "body": "I've lost 8k on one of the most solid companies in the country MU and up 300% on fukn meme movie theater. I'd say it's time for a reset",
        "created_utc": 1633098537,
        "id": "hez92au",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633127337.0
    },
    {
        "author": "_name_unavailable",
        "body": "How are my MU calls doing?",
        "created_utc": 1634049979,
        "id": "hgcyk46",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1634078779.0
    },
    {
        "author": "sereneturbulence",
        "body": "they say God hates $MU",
        "created_utc": 1634049921,
        "id": "hgcyf68",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1634078721.0
    },
    {
        "author": "thedyslexicdetective",
        "body": "I’ve held MU for a while . Is it time to unload ?",
        "created_utc": 1634826691,
        "id": "hhhtiq0",
        "score": 5,
        "subreddit": "stocks",
        "created": 1634855491.0
    },
    {
        "author": "Lopsided_Distance_87",
        "body": "Let's play a game. I buy mu and then you also buy mu",
        "created_utc": 1633151590,
        "id": "hf2b35r",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633180390.0
    },
    {
        "author": "RumHam1",
        "body": "The market is pricing in an earnings peak for MU for sure.  I sold about half my position for a 10% loss, but kept some for the long term.  MU's most recent guidance does suggest at least a near term stagnation in EPS, which the market will punish harshly.  \n\nThe DD that you need to do, is to figure out if you think this EPS stall is temporary or longer term.  I think look at their projections out towards 2025 and see if you think their capital investment plans can push EPS beyond the 2.50 mark.  If so, then the next 6 months could present a very good buying opportunity as the market punishes the short term stall.\n\nIf EPS is doomed to stagnate in the 2-2.20 range, then you'll see MU hold right around a 7 PE.",
        "created_utc": 1634052161,
        "id": "hgd3q3f",
        "score": 5,
        "subreddit": "stocks",
        "created": 1634080961.0
    },
    {
        "author": "TakeGunLeaveCannoli",
        "body": "MU, you worthless piece of shit.",
        "created_utc": 1634045802,
        "id": "hgcpdk1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1634074602.0
    },
    {
        "author": "RipCity56",
        "body": "Micron? TI?",
        "created_utc": 1634445811,
        "id": "hgy5w8o",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1634474611.0
    },
    {
        "author": "UsedTask",
        "body": "MU",
        "created_utc": 1633552104,
        "id": "hfnbbri",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633580904.0
    },
    {
        "author": "LePootPootJames",
        "body": "lol MU. Haven't paid attention to this stock in a while. Apparently it's now at 66. Last time I checked it was mid 70s. Down 4% today.\n\nAny of you autists still holding these bags? /u/MartyMoho, where are you?",
        "created_utc": 1634064412,
        "id": "hgdxmhq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634093212.0
    },
    {
        "author": "Sudden-County-921",
        "body": "$MU- Bullish call buying at ask price &amp; ITM put sold at bid price, daily RSI oversold. Huge rally in the cards for tomorrow. Only 5% of total puts traded were bought at ask price, 95% of PUT options were sold at bid or below bid price.",
        "created_utc": 1634159122,
        "id": "hgj63sw",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634187922.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "imagine investing in MU in 2021\n\nOOF",
        "created_utc": 1634138376,
        "id": "hghqnd2",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634167176.0
    },
    {
        "author": "Sudden-County-921",
        "body": "MU is the only semi company that's oversold and a huge rally is imminent to catch up with the rest of semi stocks, talking about 20-30% rally . First PT is 74-75$.",
        "created_utc": 1634214733,
        "id": "hglqr4p",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634243533.0
    },
    {
        "author": "cupnhandle",
        "body": "MU has fucked me sideways for a long time. but god damit I think im right",
        "created_utc": 1634283716,
        "id": "hgppnin",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634312516.0
    },
    {
        "author": "notherday11",
        "body": "I have a small position in MU. I bought it when it dipped not long ago. The basic gist that I got from my DD is that it’s not severely undervalued, but just a little. They own a large corner in the DRAM market (~70% of their revenues), but memory mfg isn’t as lucrative long-term as say gpu mfg, so it has a lower projected upside and future guidance versus some other competitors in the semi/chip industry.\n\nPersonally I think it’s a good long-term price to buy in at, but your mileage may vary and I’m expecting to hold for years beyond the chip shortages to see if it pays off.",
        "created_utc": 1633533803,
        "id": "hfm3hsm",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633562603.0
    },
    {
        "author": "Frankyonreddit",
        "body": "$MU is literally the most depressing stock to have Leaps! Wtf was I thinking",
        "created_utc": 1633956491,
        "id": "hg80wsq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633985291.0
    },
    {
        "author": "jer72981m",
        "body": "Whatever happened to delta? And mu? And Gamma? Are we just on inflation now? Can't keep up.",
        "created_utc": 1634009492,
        "id": "hgba0a7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634038292.0
    },
    {
        "author": "avi6274",
        "body": "$MU 2024 leaps looking real tempting right now...",
        "created_utc": 1634056733,
        "id": "hgdeybk",
        "score": 4,
        "subreddit": "stocks",
        "created": 1634085533.0
    },
    {
        "author": "cupnhandle",
        "body": "What are we doing tomorrow brain? \n\nThe same thing we do everyday peewee\n\nBUY more MU!",
        "created_utc": 1634686273,
        "id": "hhapao1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634715073.0
    },
    {
        "author": "KingAngeli",
        "body": "What stocks are you rooting for today? Im cheering on my boys NIO PLTR TSM TLRY and my highly regarded step bro, MU. Hbu?",
        "created_utc": 1634898999,
        "id": "hhlqu0c",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634927799.0
    },
    {
        "author": "me_matt_4105",
        "body": "Exactly as valid as any othert due diligence/. Micron posts better than expected quarterly results! Of course it immediately dropped 6 percent to below 70 a share, then plateaued at 71 and change, two dollars a share less than before they posted BETTER THAN EXPECTED RESULTS!\n\n&amp;#x200B;\n\nAnd Warby Parker a company that sells mail order glasses and frames and has never posted a profit is valued at nearly FIVE BILLION DOLLARS",
        "created_utc": 1633116341,
        "id": "hf0e4v2",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633145141.0
    },
    {
        "author": "wormtheology",
        "body": "Tempting pump here. Might throw my MU put profits and let it ride! Will update the thread on Monday if this post is still up. Godspeed to you and your investments.",
        "created_utc": 1633206457,
        "id": "hf5187z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633235257.0
    },
    {
        "author": "cotdt",
        "body": "There's also MU Micron, which is grossly undervalued.",
        "created_utc": 1633369971,
        "id": "hfdlnfw",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1633398771.0
    },
    {
        "author": "clarence_worley90",
        "body": "taiwan preparing for war\n\nvery bullish\n\nMU calls ?",
        "created_utc": 1633357443,
        "id": "hfcqmlh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633386243.0
    },
    {
        "author": "Stonks1337",
        "body": "Smart to take profits. Did the same with my AMD. I think in Ben graham intelligent investor he talks about taking profits because valuations change when your stocks go up, and maybe it’s better to sell and put that money to work elsewhere. SOXX and SMH to answer your question. My semi money for me I personally believe micron technologies MU is going to explode cuz of the oligopoly it has on random access memory chips and the only real US producer of em. Once people have their other computer parts and this stock is appreciated again I think it’ll double probably in a couple years. Blackrock SOXX semi ETF has about 3% micron MU. SMH is a good etf cuz it has Taiwan semiconductor",
        "created_utc": 1633930833,
        "id": "hg74llq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633959633.0
    },
    {
        "author": "cupnhandle",
        "body": "My last dying breath will be buying MORE otm MU calls",
        "created_utc": 1634174453,
        "id": "hgk3lvf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634203253.0
    },
    {
        "author": "jjr08009",
        "body": "MU on discount",
        "created_utc": 1634053396,
        "id": "hgd6teg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634082196.0
    },
    {
        "author": "stoptherage",
        "body": "It would be amazing for them they would get access to TSMC as well as micron that makes memory... as well as a lot of the supply chain for tesla.",
        "created_utc": 1633816237,
        "id": "hg1478d",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633845037.0
    },
    {
        "author": "IntoxicatedParabola",
        "body": "Imagine not investing every. Single. Penny you own in $MU",
        "created_utc": 1633953739,
        "id": "hg7wfil",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633982539.0
    },
    {
        "author": "DavidAg02",
        "body": "Just published yesterday... Was the first time I'd ever heard of MU\n\nhttps://investorplace.com/2021/10/mu-stock-dividend-combined-with-buybacks-produces-2-2-total-yield/",
        "created_utc": 1633533178,
        "id": "hfm20cd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633561978.0
    },
    {
        "author": "mjong99",
        "body": "Who hurt you today MU?",
        "created_utc": 1633442802,
        "id": "hfhb0vv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633471602.0
    },
    {
        "author": "GigaChadEnergy",
        "body": "MU is as boring as riding a roller coaster. As you mentioned its cyclical so its not like PEP where you top up every so often and forget about it. You have to monitor what part of cycle you are in and act accordingly. Not very boring but pretty intense imo.\n\nI also would be careful with being confident on guessing which part of cycle we are in. Unless you have done extensive research and know the industry well statements like \"still has significant upside especially with ever increasing memory demand and strong financials\" are harbingers of poor returns. It is very very hard to time the cycle and many smart people been told to clear their desk because they timed it wrong so when I read something like that on Reddit of all places I always roll my eyes.\n\nIn any case if you truly want boring go with utilities or medical or consumer staples.",
        "created_utc": 1633535541,
        "id": "hfm7nx9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633564341.0
    },
    {
        "author": "zjz",
        "body": "you'd say\n\n!banbet MU 5 1w \n\nif you thought the stock was going to 5 within 1w.",
        "created_utc": 1633757769,
        "id": "hfy6gzb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633786569.0
    },
    {
        "author": "spacebizzle",
        "body": "The first time in realized WSB was cool was when someone drove to Micron Headquarters and put a Veladora (Virgen De Guadalupe candle) and a picture of their CEO as an alter for MU 90c 😂. anyone remember that? Hilarious",
        "created_utc": 1633922826,
        "id": "hg6r4m0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633951626.0
    },
    {
        "author": "animositisomina35",
        "body": "See you at the center of the Earth MU.",
        "created_utc": 1634060915,
        "id": "hgdp3hr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634089715.0
    },
    {
        "author": "Stonks1337",
        "body": "Agreed. Moat is deeper than one might think. Mr market I’m betting on is mispricing here. Those chip foundrys take a lot of investment capital, time, research, resources. Then you actually have to make the freaking chips. Micron is the only one in the Western Hemisphere who has done the heavy lifting and building of the foundation as far as random access memory chips go and the means to make. RAM is theorized to have compounded growth as world industries embrace tech like AI big data computers mobile devices etc. Micron has oversupplied the market with its chips before, but now that’s its more consciously aware of its oligopolistic standing in the world it will behave as such to benefit itself and shareholders. It will be a lot more decisive with their pricing power. I see a bright future holding shares and waiting",
        "created_utc": 1634077609,
        "id": "hgetkxn",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1634106409.0
    },
    {
        "author": "Sudden-County-921",
        "body": "Watch MU closely as it' reversing. Bulls/whales getting all semi/tech stocks free from retail investors then rally starts.",
        "created_utc": 1634145697,
        "id": "hgi8qmq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634174497.0
    },
    {
        "author": "Okchaz",
        "body": "All in on MU at these prices, bottom of the falling wedge",
        "created_utc": 1634213394,
        "id": "hgloh7l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634242194.0
    },
    {
        "author": "Automatic-Long-4850",
        "body": "Over time you can’t go wrong investing in a healthy mix of companies like Micron, Nvidia, AMD &amp; Qualcomm. I think those are some of the larger players in that Fidelity fund. Semiconductors make up 6% of my long term portfolio.",
        "created_utc": 1634429579,
        "id": "hgxa38b",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634458379.0
    },
    {
        "author": "the_beast93112",
        "body": "PTON is going for my number one worst buy behind MU and CRSR",
        "created_utc": 1634568413,
        "id": "hh43tbi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634597213.0
    },
    {
        "author": "Jericho3434",
        "body": "Ahhh, MU, that MartyMoho guy got me to buy MU because it made him a millionaire (which he lost btw from diamond handing). One of my first retarded experiences here.",
        "created_utc": 1634628128,
        "id": "hh7h081",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634656928.0
    },
    {
        "author": "imsilver4fukyou",
        "body": "MU![img](emote|t5_2th52|4276)SK",
        "created_utc": 1634664233,
        "id": "hh97yuo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634693033.0
    },
    {
        "author": "cupnhandle",
        "body": "im buying more MU tomorow",
        "created_utc": 1634711435,
        "id": "hhbzpn7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634740235.0
    },
    {
        "author": "Okchaz",
        "body": "MU pre market pop",
        "created_utc": 1635166221,
        "id": "hhz9ypj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635195021.0
    },
    {
        "author": "meatmask",
        "body": "I put micron 74 and the automod corrected me to put 5 as in % I think micron will touch 84 in the next month.  The bottom is in at 70",
        "created_utc": 1633801070,
        "id": "hg05xcp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633829870.0
    },
    {
        "author": "VisualMod",
        "body": "Ban Bet Created\n---\n**/u/SleazyAsshole** bet **MU** goes to **70.0** in **2 weeks**",
        "created_utc": 1634057868,
        "id": "hgdhp9t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634086668.0
    },
    {
        "author": "Sudden-County-921",
        "body": "$MU reversing, large call buying activity for 68$ and 69$ strike Oct 29.",
        "created_utc": 1634140276,
        "id": "hghvb1h",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634169076.0
    },
    {
        "author": "cupnhandle",
        "body": "I think I now own like 900 shares of MU or something... im going to be honest I am kinda retarded",
        "created_utc": 1634719336,
        "id": "hhc8twp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634748136.0
    },
    {
        "author": "PotentialFun3",
        "body": "LOL at the stupid comment.  MU down over 1% pre-market, and it will probably go down more once he starts speaking so I just put a buy in at $66.41.",
        "created_utc": 1634735430,
        "id": "hhcvfoq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1634764230.0
    },
    {
        "author": "puffinnbluffin",
        "body": "MU",
        "created_utc": 1634253766,
        "id": "hgo73y6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634282566.0
    },
    {
        "author": "cupnhandle",
        "body": "I bought even more mu today....",
        "created_utc": 1634680022,
        "id": "hhabjwa",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634708822.0
    },
    {
        "author": "meatmask",
        "body": "AtM micron no IV",
        "created_utc": 1633668519,
        "id": "hftieaf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633697319.0
    },
    {
        "author": "Sudden-County-921",
        "body": "MU will bounce above $70 by EOW. Big bullish bets all day for 70$ calls.",
        "created_utc": 1634175344,
        "id": "hgk5fvy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634204144.0
    },
    {
        "author": "Sudden-County-921",
        "body": "$MU- Bullish activity. ITM PUT 70$ strike sold for oct 15, usually acts as a call and the PUT sellers will push the stock price higher to render the calls worthless by expiration.",
        "created_utc": 1634152760,
        "id": "hgiqiej",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634181560.0
    },
    {
        "author": "zeebee098",
        "body": "Why didn’t I buy those MU calls at close fackkkkk",
        "created_utc": 1634227638,
        "id": "hgmjfjw",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634256438.0
    },
    {
        "author": "-Gol-D-Roger--",
        "body": "So undervalued, similar to MU. With the shortage we have nowadays with chips and that prices are ridiculous... So weird this situation",
        "created_utc": 1634485463,
        "id": "hgzulxg",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1634514263.0
    },
    {
        "author": "CoacHdi",
        "body": "singapore coronavirus cases; people misunderstanding micron ER guidance",
        "created_utc": 1634665403,
        "id": "hh9ax3b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634694203.0
    },
    {
        "author": "ThumbBee92",
        "body": "Yeap. \n\nINTC is around or below 20. \nTSM was below 20 right before 2019. \nMicron is below 20 now.",
        "created_utc": 1634766025,
        "id": "hhey9d0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634794825.0
    },
    {
        "author": "tshark24",
        "body": "MU 90 calls. Free money.",
        "created_utc": 1634842871,
        "id": "hhix8z9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634871671.0
    },
    {
        "author": "datix",
        "body": "MU $90c 10/22 who says no?",
        "created_utc": 1634842631,
        "id": "hhiwntv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634871431.0
    },
    {
        "author": "TopStrategist",
        "body": "The new MU",
        "created_utc": 1634577163,
        "id": "hh4ophd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634605963.0
    },
    {
        "author": "xflashbackxbrd",
        "body": "All three of those are laggards though. MU earnings always tank semis when they come out, it's a guarantee. Same for INTC. TSM is weird because their earnings are great but there's always some overreaction to China sabre rattling that sends it retracing.",
        "created_utc": 1634774150,
        "id": "hhfgajp",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634802950.0
    },
    {
        "author": "VisualMod",
        "body": "**Ban Bet Created:** **/u/meatmask** bet **MU** goes from **67.47** to **75.0** before **2021-11-05 21:19:07.079632-04:00**",
        "created_utc": 1634951953,
        "id": "hhoy0bh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634980753.0
    },
    {
        "author": "Fatherof10",
        "body": "There is so much information out there on this.\n\nNetlist has patents on the ddram that everyone uses. For 13 years companies have been stealing it.\n\nGoogle, Samsung, SK Hynix, TI, Micron, Diablo.....\n\nInternational patent courts have ruled in favor of netlist and upheld patents to so a lot of lawsuits are finally after 12+ years coming to bear fruit.\n\nGoogle would not exist as the leader in search engines if they had not stolen and used (continues) Nlst tech all these years.\n\n\n$45-$150 my guess after 1st couple cases close and much higher as they finally grow.\n\nThe reason is the own the patents for the standards now and for the future in server and computer/tech memory systems. AI, AR, servers.....everything needs and uses them",
        "created_utc": 1634925083,
        "id": "hhnb7ri",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1634953883.0
    },
    {
        "author": "vics80",
        "body": "surely MU and CHWY will have their day, but I wish it was sooner",
        "created_utc": 1635157536,
        "id": "hhyx8li",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635186336.0
    },
    {
        "author": "umbrellacorgi",
        "body": "MU will never reach $90 meme status at this rate 😭",
        "created_utc": 1635166150,
        "id": "hhz9u4f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635194950.0
    },
    {
        "author": "vics80",
        "body": "niceeeee. I was afraid it was you were saying something weak like +1%. MU get up there already",
        "created_utc": 1635166321,
        "id": "hhza5b4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635195121.0
    },
    {
        "author": "intensenerd",
        "body": "You get like 8 shares of $MU but you only get them at 2008 prices.",
        "created_utc": 1633211710,
        "id": "hf5d8hk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633240510.0
    },
    {
        "author": "cupnhandle",
        "body": "I got 14gs worth.... oops nope 12gs.... wait 9 gs of MU calls",
        "created_utc": 1633105770,
        "id": "hezppdd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633134570.0
    },
    {
        "author": "entropic_identity",
        "body": "thinking about $90 MU calls",
        "created_utc": 1633584527,
        "id": "hfp3r75",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633613327.0
    },
    {
        "author": "Rrrandomalias",
        "body": "MU 90c",
        "created_utc": 1633463013,
        "id": "hfin3k7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633491813.0
    },
    {
        "author": "meatmask",
        "body": "Yea mine was micron before Morgan Stanley changed his mind on the price",
        "created_utc": 1633669237,
        "id": "hftjh0a",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633698037.0
    },
    {
        "author": "meatmask",
        "body": "Hey Mod my !banbet for mu is supposed to have price target of $74 it shows on board as 5",
        "created_utc": 1633797070,
        "id": "hfzwtj3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633825870.0
    },
    {
        "author": "meatmask",
        "body": "!banbet MU 5 1w",
        "created_utc": 1633757829,
        "id": "hfy6k89",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633786629.0
    },
    {
        "author": "Okchaz",
        "body": "MU down to $66, solid ass buy here for my long term brothers",
        "created_utc": 1634049227,
        "id": "hgcwu0j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634078027.0
    },
    {
        "author": "The-big-vitamin-D",
        "body": "Micron deleted my portfolio today",
        "created_utc": 1634072570,
        "id": "hgehp1u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634101370.0
    },
    {
        "author": "sereneturbulence",
        "body": "Same way I feel about PLTR and MU, \n\n**Satan’s tickers**",
        "created_utc": 1633742421,
        "id": "hfxe3kk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633771221.0
    },
    {
        "author": "cb_hanson_III",
        "body": "You're missing a gigantic point. You are assuming that (1) you know what intrinsic value is and (2) that market price will tend to converge to intrinsic value. Neither is precisely true for equities. That's one reason you need to worry about volatility.\n\nI'll give you an example which should make things super clear. Consider a risk-free bond. Now this is an asset for which (1) and (2) hold precisely. Furthermore, if you are an investor who is holding the bond to maturity, you will not care about volatility. Why is that? Well, you know for sure that the bond will pay par at maturity. And as term to maturity gets shorter, the price will be pulled to par. The other way to look at this is if the bond price falls, you take a loss, but at the lower price, your expected return on the bond has gone up (exactly enough to offset).\n\nSo this is the type of situation that people seem to (implicitly) have in mind when they say \"volatility isn't risk\" or \"volatility doesn't matter for a long term investor\". But are these statements correct for stocks? No, since we are only estimating the intrinsic value with uncertainty. If the price of a stock falls, is it purely a discount rate shock or is it also a shock to future cash flows? It's often very hard to be sure (unlike in the case of bonds). The other point, of course, is that while a bond has a maturity date, a stock does not. So there is no mechanism that will force market price to converge with intrinsic value.\n\nSo volatility does matter as it typically reflects uncertainty in a company's future cash flow and shocks to the discount rate. I often hear people say that when a stock price falls sharply that they check whether the \"fundamentals are still sound\" and if so, it represent a buying opportunity. That's true, but in practice there is often a good reason for the stock to be falling (that perhaps other investors realize but you don't).\n\n&amp;#x200B;\n\nFrom a slightly different angle, perhaps the discussion you referenced is distinguishing between idiosyncratic and systematic risk. If company risks are idiosyncratic and hence diversifiable, you won't care since you could make that risk go away by holding a diversified portfolio. The remaining risk, at the portfolio level, most definitely is risk that you care about since people are risk averse (so they dislike a wide dispersion of possible outcomes in their portfolio wealth at retirement).\n\nThe last perspective is that for a given expected return for your portfolio (say per month or year), the long term expected growth of your wealth depends directly on the volatility. This is precisely the expected geometric mean growth rate and is well approximated by the expression:\n\nlog(1+mu) - sigma\\^2/\\[2(1+mu)\\^2\\] where mu is the per period expected return and sigma is the volatility. So for a given mu, the geometric mean falls as volatility (sigma) increases. This is the \"volatility drag\" that is often discussed on reddit in the context of leveraged ETFs, but which equally applies to any asset, levered or not.",
        "created_utc": 1634225593,
        "id": "hgmeg1p",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1634254393.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "MU is putting double its market cap into R&amp;D",
        "created_utc": 1634904775,
        "id": "hhlzkx0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634933575.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "MU leaps probably the best deal on the market rn.",
        "created_utc": 1634932006,
        "id": "hhns5da",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634960806.0
    },
    {
        "author": "meatmask",
        "body": "Micron has most upside",
        "created_utc": 1635025751,
        "id": "hhsdsot",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635054551.0
    },
    {
        "author": "bronkellerman",
        "body": "MU share price will become negative",
        "created_utc": 1633156913,
        "id": "hf2iddx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633185713.0
    },
    {
        "author": "origami_asshole",
        "body": "I’ll probably buy calls on the MU variant and watch all the other soar while I’m left behind.",
        "created_utc": 1633367186,
        "id": "hfde7ef",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633395986.0
    },
    {
        "author": "tqqq-ftw",
        "body": "So it bounces or falls? thanks Oracle of the retards",
        "created_utc": 1633078871,
        "id": "heye2tn",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1633107671.0
    }
]