[
    {
        "author": "bridgeheadone",
        "body": "Trading sideways.\n\nSince nobody bothered to check I can enlighten that Big Tech absolutely destroyed earnings estimates. They’re not crashing or going out of business.\n\nThis is large institutions rearranging portfolios and hesitating what to do with the bond yields increasing. \n\nWhich, by the way are so fucking low it shouldn’t even register on the stock market. \n\nThis is the dip that people tell you to buy. \n\nThis is when you clench your anus and buy MSFT and ADBE and uninstall your app for the rest of the year. \n\nEV? Well, that was so highly valued that a correction was needed. I’d be more careful there, it big tech just went on sale again.\n\nEdit: Yes I am old as fuck at 44. I’ve survived the big three crashes as finance professional. This is not a crash and it’s barely a correction.",
        "created_utc": 1614862316,
        "id": "gpnbkbi",
        "permalink": "/r/stocks/comments/lxgdb0/to_the_people_who_have_been_long_enough_in_the/gpnbkbi/",
        "score": 104,
        "subreddit": "stocks",
        "created": 1614891116.0
    },
    {
        "author": "nevetando",
        "body": "Are there some tech stocks that are overvalued? yes. \n\nis all of tech overvalued? no.\n\nBut the whole sector is suffering because of a few. Just take a deep breath and relax. if you own any solid, diversified, mainstay tech (apple, Microsoft, even intel and AMD) you are going to be fine in the long run. \n\nIf you are in emerging tech, new companies, growing companies... well, godspeed. it is going to be bumpy. \n\nHistory favors tech though. but like all things, it goes in and out of favor with the people.",
        "created_utc": 1614881504,
        "id": "gpogfr3",
        "permalink": "/r/stocks/comments/lxo7om/warren_buffets_stock_strategy_is_more_relevant/gpogfr3/",
        "score": 100,
        "subreddit": "stocks",
        "created": 1614910304.0
    },
    {
        "author": "DankBank419",
        "body": "That deal with Microsoft is making me micro hard, which is all I am capable of",
        "created_utc": 1614733742,
        "id": "gphdpj5",
        "permalink": "/r/wallstreetbets/comments/lwgbtr/gme_please_read/gphdpj5/",
        "score": 92,
        "subreddit": "wallstreetbets",
        "created": 1614762542.0
    },
    {
        "author": "TayahuaJ",
        "body": "SQ, PYPL, AMZN, GOOG, MSFT, NVDA are all \"tech growth\" stocks I own, each about 5% of my non-retirement bucket.",
        "created_utc": 1614876912,
        "id": "gpo5p65",
        "permalink": "/r/stocks/comments/lxo7om/warren_buffets_stock_strategy_is_more_relevant/gpo5p65/",
        "score": 58,
        "subreddit": "stocks",
        "created": 1614905712.0
    },
    {
        "author": "ixvst01",
        "body": "Who are the people out there actually selling their AAPL and MSFT shares (and techs in general) to buy bonds that went up by .5% in yield? Wall Street is just looking excuses to take profits.",
        "created_utc": 1614791840,
        "id": "gpjyd1x",
        "permalink": "/r/stocks/comments/lwqqa4/rstocks_daily_discussion_wednesday_mar_03_2021/gpjyd1x/",
        "score": 49,
        "subreddit": "stocks",
        "created": 1614820640.0
    },
    {
        "author": "jsntx",
        "body": "A few things to consider: the lockup expired on the 18th, but that meant that the shares could be made available for distribution at the investors' accounts. It would have taken 5-7 days (according to another DD) for the shares to be sellable. \n\nSoros promised to divest their 18.5M shares (as of Jan) on principle. Those should be hitting the market by now. \n\nThe tech selloff has also contributed to keeping PLTR depressed. Cathie, however, has been gobbling up the shares at every dip. \n\nFinally, unless you are an insider and know more than the rest of us, Palantir's software claims are pretty standard for enterprise software. Microsoft, Salesforce, SAP, Oracle, Siemens, etc., make those claims regularly. I don't think Palantir is special but they do have momentum and high profile clients. \n\nOverall I think PLTR is getting ready to take off, but they might find some resistance along the way. I'm in.",
        "created_utc": 1614820606,
        "id": "gploiwe",
        "permalink": "/r/wallstreetbets/comments/lx7i43/palantir_is_undervalued_and_is_time_for_it_to/gploiwe/",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1614849406.0
    },
    {
        "author": "ph0xer",
        "body": "Hmmm. I always hear about people who bought Apple, msft, or tsla 10 years ago and are now millionaires.\n\n&amp;#x200B;\n\nI think i'll be one of the first to say i bought those 2 months ago and now im bankrupt.",
        "created_utc": 1614735017,
        "id": "gphg66u",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gphg66u/",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1614763817.0
    },
    {
        "author": "desquibnt",
        "body": "Let's not forget how companies rise and fall, though. Microsoft hasn't always been a juggernaut. It was under Gates just like it has been under Nadella but Microsoft under Balmer was a flaming trainwreck inside a radioactive dumpster. I fear for what happens when Nadella retires",
        "created_utc": 1617234382,
        "id": "gsz16q2",
        "permalink": "/r/stocks/comments/mhdrqg/microsoft_wins_us_army_contract_for/gsz16q2/",
        "score": 41,
        "subreddit": "stocks",
        "created": 1617263182.0
    },
    {
        "author": "chudsupreme",
        "body": "Counter argument: Palantir genuinely seems like its ahead of the game on the crazy important uses of AI and geolocational data we can use to make money on.  They're selling to every sector that's buying, including military contractors.  They legit are most likely the next Microsoft of the 21st century.\n\nDisclosure: I haven't bought a single share of PLTR... yet.  Financially I'm unable to right now, but as soon as I am able to, I'm going very long on it.",
        "created_utc": 1614790412,
        "id": "gpjv06i",
        "permalink": "/r/stocks/comments/lww0h7/if_someone_finishes_their_dd_with_this_could_be/gpjv06i/",
        "score": 40,
        "subreddit": "stocks",
        "created": 1614819212.0
    },
    {
        "author": "jrarriesgado",
        "body": "Should I use my MSFT stock that is up 500% total gain these past 5 years to buy GME.",
        "created_utc": 1615308823,
        "id": "gqcibxq",
        "permalink": "/r/wallstreetbets/comments/m16emz/gme_megathread_for_march_09_2021/gqcibxq/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1615337623.0
    },
    {
        "author": "Pawnkkiller",
        "body": "What about buying into company’s you support? Have an iPhone? Buy apple, got a pc? Buy Microsoft. Enjoy video games and consoles buy GME AND HODL TO DA MOOON \n\n-totally not financial advice",
        "created_utc": 1614861670,
        "id": "gpnalm7",
        "permalink": "/r/stocks/comments/lxjbdv/psa_buy_and_hold_only_works_if_the_stock_is/gpnalm7/",
        "score": 39,
        "subreddit": "stocks",
        "created": 1614890470.0
    },
    {
        "author": "East90thStreetNaebs",
        "body": "Isn’t there an interview tomorrow re GameStop and Microsoft partnership?",
        "created_utc": 1617049188,
        "id": "gsq5c6h",
        "permalink": "/r/wallstreetbets/comments/mfoivk/gme_megathread_for_march_29_2021/gsq5c6h/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1617077988.0
    },
    {
        "author": "AngelaQQ",
        "body": "What the shit is this?\n\nIf a company is awesome, the stock almost always is a buy.\n\nSee: Microsoft, Google, Apple, Amazon etc.\n\nThere are people who refuse to \"overpay\" for a company who are STILL sitting on the sidelines on Amazon to this very day.\n\nThere are also people who refused to \"overpay\" for that house in California 20 years ago, who are still paying 3500 in rent in the San Francisco bay area when they could have a house 2/3 paid off by now.",
        "created_utc": 1614883664,
        "id": "gpollqk",
        "permalink": "/r/stocks/comments/lxom6i/just_because_a_company_is_awesome_doesnt_mean_the/gpollqk/",
        "score": 36,
        "subreddit": "stocks",
        "created": 1614912464.0
    },
    {
        "author": "ContestImpressive",
        "body": "I really hope he reads these when he gets home after a long hard day of shilling for the hedgies and his overlords over at Melvin and Citadel.  \n\nImagine Cry Bitch Jimmy Cramer walking into his home, throwing his suit jacket over the back of the couch.  He shuffles into the kitchen and reaches for the $SJM to make his favorite PBJ sandwich. Pops a cold $BUD and heads to the couch where he pops open his $IBM toughbook, opens up $MSFT Internet Explorer and pecks his was to WSB to see what his favorite retards are up to AH. He can't help but to search the subreddit for his name.  As he sorts by trending he hears the muffled moans of orgasmic euphoria echoing from his bedroom.  He rolls his eyes as he realizes he'll be sleeping on the couch tonight since his wife's boyfriend is sleeping over tonight. He continues scrolling through WSB reading every retarded post about him he can find.  He begins to feel sadness and a lump in his throat and he thinks about his 401k being down 2.5 points on the day.  Tears swelling in his eyes as he hears the unmistakable sound of a hand slapping and smacking his wife's bare ass as she moans in pleasure as her boyfriend rails her for the fifth time tonight. Jimmy knows he will never be able to satisfy his wife the way her boyfriend can.  He closes WSB as the tears of disappointment and rage roll down his face.  How dare these selfish retail traders, who know nothing about investing, question me and CNBC!  How dare they make money! MONEY IS FOR HEDGIES ONLY! he exclaims. He navigates to his bookmarks to find his favorite cuck porn help him relieve the swelling rage, anger, and fear that have been building within him over the past two months.  How much more of this can I take he wonders and he manually stimulates himself to cuck porn while his wife and her boyfriend begin round six in the next room over, all the while tears streaming down his face.  Finally after several hours he achieves a sweet release however his anger still remains balled up inside him.  In a fit of rage he throws his $IBM toughbook to the floor and pulls out his $T $AAPL iPhone and heads over to $TWTR where he goes on an 18 tweet rant about the retards on WSB before he finally passes out after his 9th $BUD.",
        "created_utc": 1614723261,
        "id": "gpgst0e",
        "permalink": "/r/wallstreetbets/comments/lw6p1r/rkt_on_cnbc_already_gratz_guys_you_can_sell_now/gpgst0e/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1614752061.0
    },
    {
        "author": "613Flyer",
        "body": "It’s a space ship. They found a space ship. This company is going to sky rocket pushing out google and Microsoft from being the top tech company. They will be worth trillions! Invest while you can!",
        "created_utc": 1614789131,
        "id": "gpjrz69",
        "permalink": "/r/pennystocks/comments/lwrx1o/possible_1300_next_week_88_energy/gpjrz69/",
        "score": 34,
        "subreddit": "pennystocks",
        "created": 1614817931.0
    },
    {
        "author": "enhancedSnooreLoop",
        "body": "I had the exact same thing with Amazon, except I didn't buy any stocks. But if I'd have bought them dirt cheap and sold them at a really high price I would've been a millionaire by now. Microsoft too, if only I would've bought low and sold high, I would've made money... 😪",
        "created_utc": 1614726821,
        "id": "gph07cn",
        "permalink": "/r/wallstreetbets/comments/lwae0v/181840_gain_in_4_hours_from_rkt_time_to_give_my/gph07cn/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1614755621.0
    },
    {
        "author": "coolcomfort123",
        "body": "It is always ok to buy more aapl, msft and amzn during these deep red days.",
        "created_utc": 1614896362,
        "id": "gppfjeb",
        "permalink": "/r/stocks/comments/lxsim5/dont_sell_heres_a_plan/gppfjeb/",
        "score": 32,
        "subreddit": "stocks",
        "created": 1614925162.0
    },
    {
        "author": "Einhander_pilot",
        "body": "I sold my PLTR and MSFT because I’ll only lose buying power and my funds will be a lot safer in GME. AAPL might be next.",
        "created_utc": 1615834637,
        "id": "gr1k2ik",
        "permalink": "/r/wallstreetbets/comments/m5jn1y/gme_megathread_for_march_15_2021/gr1k2ik/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1615863437.0
    },
    {
        "author": "FITnLIT7",
        "body": "Go ahead and look yourself I could list 100 other stocks.\n\nObviously picked those because people are familiar with them here.\n\nguess\n\nAMZN\n\nAAPL\n\nMSFT\n\nare meme stocks now too?",
        "created_utc": 1615407648,
        "id": "gqhlp4n",
        "permalink": "/r/wallstreetbets/comments/m23vx8/6_trading_halts_in_31min_every_trading_halt_lasts/gqhlp4n/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1615436448.0
    },
    {
        "author": "rs6866",
        "body": "Here's a great example: TSLA.\n\nI think tsla is a great company and is going to grow and gain market share.  It has a reasonable chance of entirely dominating the EV space for years to come.\n\nPE &gt; 1000.  Yeah, but no.  Other mega cap tech names like MSFT or AAPL are around 30.  AMZN is 75.  TSLA needs to fall ~97% to achieve fair value.  Even if they grow 10x in the next 2-3 years (doubtful they can get there), they'd need to fall 30%.  Stay the hell away.",
        "created_utc": 1614894457,
        "id": "gppbadn",
        "permalink": "/r/stocks/comments/lxo7om/warren_buffets_stock_strategy_is_more_relevant/gppbadn/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1614923257.0
    },
    {
        "author": "AmericanHerstoryX",
        "body": "i got my second vaccine dose and i already feel the need to buy some microsoft products",
        "created_utc": 1615326955,
        "id": "gqdmzkg",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqdmzkg/",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1615355755.0
    },
    {
        "author": "BobBobCan",
        "body": "What does the future look like for NET? I heard Amazon, MSFT, Google etc. are its main competitors",
        "created_utc": 1614783909,
        "id": "gpjg4h8",
        "permalink": "/r/stocks/comments/lwt9oz/what_stocks_do_you_believe_are_currently/gpjg4h8/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1614812709.0
    },
    {
        "author": "DivineGrace819",
        "body": "GME going to buy Sony, Microsoft, Steam, NVIDA, Intel, AMD at $100,000",
        "created_utc": 1615242145,
        "id": "gq9hg3l",
        "permalink": "/r/wallstreetbets/comments/m0fpgd/gme_megathread_for_march_08_2021/gq9hg3l/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1615270945.0
    },
    {
        "author": "tysonsmithshootname",
        "body": "This is what I get for moving out of safe stocks like GME and PLTR and moving to risky plays like MSFT",
        "created_utc": 1614883009,
        "id": "gpok1kq",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpok1kq/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1614911809.0
    },
    {
        "author": "codymiller_cartoon",
        "body": "grumblings are $400 EOD is likely \n\nso much profit , i may decide to acquire Bethesda from microsoft",
        "created_utc": 1615310587,
        "id": "gqcmkgi",
        "permalink": "/r/wallstreetbets/comments/m16emz/gme_megathread_for_march_09_2021/gqcmkgi/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1615339387.0
    },
    {
        "author": "DetectiveMurder",
        "body": "Jim Cramer saves his word documents when the Microsoft help paper clip reminds him to.",
        "created_utc": 1615520402,
        "id": "gqniva3",
        "permalink": "/r/wallstreetbets/comments/m2uy4f/gme_megathread_part_2_for_march_11_2021/gqniva3/",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1615549202.0
    },
    {
        "author": "Fit-Mycologist-6951",
        "body": "The stock market has ruined my life. Can anyone give me advice?\n\nMade 14k but then lost 18.6k in one week. Lost my girlfriend due to arguments about the stock market, losing focus at work (my projects are all lackluster, performance is shit, lazy, not focused, wfh got caught by my boss staring at my phone for 45 minutes during a compliance training meeting on microsoft teams (got a call with him tomorrow), family thinks I’m doing fine, I’m depressed, sometimes I don’t know how I can continue eating the food on my table, I get angry like really angry thinking about the stock market (clenching my teeth really fucking hard til it hurts and cursing), punching my pillows/walls/saying fuck out loud, slamming my table, not getting anywhere with my career, losing motivation, reading reddit all day about stocks wanting to make it all back, seeing others succeed while I’m miserable.\n\nFuck this shit.",
        "created_utc": 1615437678,
        "id": "gqj8rzo",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqj8rzo/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1615466478.0
    },
    {
        "author": "LayingPipeInFlorida",
        "body": "GME has to make a move in an effort to secure its long term sustainability and growth in its target market. I truly believe they will enter into online game downloads, securing a license agreement with Microsoft, et al. Microsoft would benefit from increased exposure to GMEs legacy consumers. I’m predicting that GME becomes to gamers what Netflix is to movie watchers. Buy it up and sit on your shares for as long as it takes. GME will at the very least reach $500/share within the next few years. I wouldn’t be surprised if Amazon doesn’t try to buy it.",
        "created_utc": 1614790319,
        "id": "gpjus76",
        "permalink": "/r/wallstreetbets/comments/lwtejk/gme_megathread_for_march_3rd_2021/gpjus76/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1614819119.0
    },
    {
        "author": "g1umo",
        "body": "'ruin the economy' is, and always has been, a dogwhistle for rich people losing their superyachts\n\nAlso, we NEED a crash. The stock market crashing is not an indicator of the economy. Post-crash, all the whales long on GME will hog up on all the cheap AAPL and MSFT they could possibly buy. Retail will pay monstrous tax dollars to the US gov (if the share price hits 500k that's 40% of 35T dollars, would wipe more than half of US national debt). Retail will not hoard their money like greedy bastards and will invest in their local economies. This 'crash' in the short term will benefit the planet long-term",
        "created_utc": 1615324884,
        "id": "gqdid0j",
        "permalink": "/r/wallstreetbets/comments/m1dlfh/what_will_happen_to_the_global_economy_if_gme/gqdid0j/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1615353684.0
    },
    {
        "author": "Forgotwhyimhere69",
        "body": "My portfolio is tech heavy so I feel like I shouldn't add more tech stocks but Microsoft seems too good a company not to add.",
        "created_utc": 1617220728,
        "id": "gsy9lx4",
        "permalink": "/r/stocks/comments/mhdrqg/microsoft_wins_us_army_contract_for/gsy9lx4/",
        "score": 21,
        "subreddit": "stocks",
        "created": 1617249528.0
    },
    {
        "author": "redsolocup6",
        "body": "The government announced that Microsoft was attacked with the world's biggest hack by Chinese hackers. Then the next day Microsoft rallies. What a strange market.",
        "created_utc": 1615440400,
        "id": "gqjd4bh",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqjd4bh/",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1615469200.0
    },
    {
        "author": "AllProWomenRespecter",
        "body": "I still have nightmares about my $200cs on MSFT in Feb 2020 and $340cs on SPY in March 2020.",
        "created_utc": 1614892709,
        "id": "gpp7aet",
        "permalink": "/r/wallstreetbets/comments/lxva6s/what_are_your_moves_tomorrow_march_05_2021/gpp7aet/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1614921509.0
    },
    {
        "author": "tysonsmithshootname",
        "body": "Back in, just can't handle the instability of risky companies like $MSFT and $AAPL.",
        "created_utc": 1614889326,
        "id": "gpoz8wy",
        "permalink": "/r/wallstreetbets/comments/lxkint/gme_megathread_for_march_04_2021/gpoz8wy/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1614918126.0
    },
    {
        "author": "hibbjibbity",
        "body": "GME is higher then MSFT lol",
        "created_utc": 1615310794,
        "id": "gqcn1qk",
        "permalink": "/r/wallstreetbets/comments/m16emz/gme_megathread_for_march_09_2021/gqcn1qk/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1615339594.0
    },
    {
        "author": "johnyt3",
        "body": "Msft 200 Calls ;(",
        "created_utc": 1614814045,
        "id": "gplcoa7",
        "permalink": "/r/investing/comments/lx4e56/hertz_the_original_meme_stock_is_turning_out_to/gplcoa7/",
        "score": 20,
        "subreddit": "investing",
        "created": 1614842845.0
    },
    {
        "author": "DeathN0va",
        "body": "If you stand in front of a mirror in a dark bathroom, spin around 3 times while chanting \"boomer\", Jim Cramer will appear in the mirror and yell at you for not buying Microsoft. If you have any coke in the house he'll kill everyone and snort all the coke before disappearing back into the mirror.",
        "created_utc": 1614781088,
        "id": "gpja77y",
        "permalink": "/r/wallstreetbets/comments/lwtejk/gme_megathread_for_march_3rd_2021/gpja77y/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1614809888.0
    },
    {
        "author": "Legatron4",
        "body": "Everytime gme passes share price of another stock I hold, I sell that stock and buy gme. Tomorrow I fear I am selling microsoft for gme",
        "created_utc": 1615255372,
        "id": "gqa6e5p",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqa6e5p/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1615284172.0
    },
    {
        "author": "GoGoRouterRangers",
        "body": "Why stop at one hit the big 3 hommie:\n\n[https://www.localjobster.com/company5?company=Wendy%27s&amp;ls2=1&amp;m\\_type=&amp;msclkid=ff36f4827b4d1e1770be94c27f836db3&amp;path=202&amp;reset=1&amp;s\\_ad=&amp;s\\_kw=&amp;s\\_network=Search&amp;s\\_qs=&amp;split\\_id=1140&amp;split\\_url\\_id=75&amp;utm\\_campaign=&amp;utm\\_content=&amp;utm\\_source=Microsoft&amp;utm\\_term=](https://www.localjobster.com/company5?company=Wendy%27s&amp;ls2=1&amp;m_type=&amp;msclkid=ff36f4827b4d1e1770be94c27f836db3&amp;path=202&amp;reset=1&amp;s_ad=&amp;s_kw=&amp;s_network=Search&amp;s_qs=&amp;split_id=1140&amp;split_url_id=75&amp;utm_campaign=&amp;utm_content=&amp;utm_source=Microsoft&amp;utm_term=) (wendy's apps)  \n\n\n[https://mcdonalds.everyjobforme.com/](https://mcdonalds.everyjobforme.com/) (mcdonalds app)  \n\n\n[https://burgerking.everyjobforme.com/](https://burgerking.everyjobforme.com/) (BK app)",
        "created_utc": 1614808340,
        "id": "gpl0kvh",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpl0kvh/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1614837140.0
    },
    {
        "author": "juaggo_",
        "body": "Microsoft is a great long term hold. This is just another reason on top of multiple others.",
        "created_utc": 1617219413,
        "id": "gsy6qxt",
        "permalink": "/r/stocks/comments/mhdrqg/microsoft_wins_us_army_contract_for/gsy6qxt/",
        "score": 19,
        "subreddit": "stocks",
        "created": 1617248213.0
    },
    {
        "author": "ICanFinallyRelax",
        "body": "My yeast brother. I will shamelessly slap my DD on your post so that these lost retards may see the light.\n\nTldr; They have used machine learning and AI to solve/map genetic pathways in yeast to create almost any molecule at production scale. \n\nOnce it runs, this is literally a fucking money printer. \n\nThe modded yeast eat sugar and shit out a more expensive molecule (like CBD). They already have mapped out 400+ molecules. Its like they have a machine where if you feed it a dime, it spits out a quarter. Even a retard can understand this math.\n\nThey have the google maps for yeast and everyone else is navigating by the stars. And they patented the shit out of all the major streets so no one can follow them.\n\nIf green sustainability had a dick, it would have such a huge hard on for this company. They replace dirty chemistry with clean, sustainable, low cost, and better organic chemisty.\n\nHow did they get so fucked in the first place? \n\nThey tried biofuels but gas prices went down so they got boned and couldn't compete. They pivoted to flavors and fragrances because that stuff is worth more per kilogram than fuel. So they rested there like a wounded animal while still dumping 70M into RnD yearly. And now bankruptcy is off the table. Their consumer brands are taking off and they are rising like a goddamn yeast phoenix. It cost them 2B to get to this point.\n\nWhy should you buy? - Pick from the list below. I know you've put your money in tickers with less potential.\n\nThey are a part of BioMade which is the U.S. initiative for a syntheic bio industrial revolution. Think about it, fermentation plants across the U.S. and it becomes the largest chemical/raw materials exporter. \n\n- 13 molecules at commercial scale and 18 in the pipeline. They can take any molecule to commercial scale in under a year.\n- they are making a protein platform, beyond meat and impossible foods better watch out. \n- they can claim \"all natural\" on all their products\n- The golden goose tendie machine - yeast map\n- vaccine play - they produce squalene which is used as an adjuvant to boost vaccine efficacy. It also saves millions of sharks from being killed\n- they teamed up with IDRI to create a 2nd gen vaccine an SA-mRNA vaccine that can be stored room temp for 8months, longer if kept cold.\n- they worked with DARPA living foundries program to develop their machine learning\n- they make sustainable jetfuel with the Navy https://twitter.com/DARPA/status/1313500978864324608\n- they are working on a monoclonal antibody platform, no more twiddling hamster ovaries\n- also HMO (titty milk sugars) platform, and an mRNA (printing vaccine antigen) platform. \n- they have created next gen sweeteners which will help our fat asses consume less sugar without the fake taste. and they are partnering with Raizen on it\n- they are a cannabis play - they produce CBD and CBG at commercial scale (there is a lawsuit but it looks frivolous, just look up the lawyers on both sides. Amy is going to be fine)\n- Its P/S multiple is around 10-15x and similar companies have 100x.\n- its only 3B mcap. This thing can run.\n- 5 years ahead of competitors \n- 800+ patent wall. They have locked yeast down.\n- their tech is being applied to other organisms too\n\nImagine an economy that can produce chemicals sustainably and if a pandemic arises, it can immediately shift production to counter it.\n\nThis is a ten year trip to Tendie Town. You can hop off whenever you have had your fill. You retards are looking at the next (Genetic) Microsoft. Machines are here to help us master DNA. Synthetic Bio is the future.\n\n\n\nWant more DD?\n\nThis is the Amy starter package - an intro to the tendie machine.\n\nhttps://youtu.be/hbAmYkX1Lus\n\nhttps://youtu.be/os5CB2NN5k0\n\nhttps://www.webcaster4.com/Webcast/Page/2101/38935",
        "created_utc": 1614735403,
        "id": "gphgx8f",
        "permalink": "/r/wallstreetbets/comments/lwhkt3/amrs_gains_march_2_2021/gphgx8f/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1614764203.0
    },
    {
        "author": "ThrowawayLegendZ",
        "body": "I'm totally going to buy my 2 year old some type of stock that most kids would find interesting... But, like Disney is too expensive, and so is Microsoft... But I heard Game Stop is having a fire sale?? 30% discount for the rest of the week! Hard to pass that up...",
        "created_utc": 1615501494,
        "id": "gqmin09",
        "permalink": "/r/wallstreetbets/comments/m2yxq9/about_to_be_a_lot_of_retards_dumping_1400_into/gqmin09/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1615530294.0
    },
    {
        "author": "peatoast",
        "body": "MSFT",
        "created_utc": 1614785921,
        "id": "gpjklol",
        "permalink": "/r/stocks/comments/lwt9oz/what_stocks_do_you_believe_are_currently/gpjklol/",
        "score": 18,
        "subreddit": "stocks",
        "created": 1614814721.0
    },
    {
        "author": "Anonbowser",
        "body": "It’s sitting in the slightly over valued area now.  Buy at 20, hold to 30.  Sell above 30.  PLTR is not TSLA, MSFT, AAPL or any other company people try to compare it to.  4B revenue in 5 years is not that great.  I understand people are excited about the CEO and the “limitless” possibilities of the software but right now, they haven’t demonstrated that they can get decent revenues or retain clients.  Worst of all, their cost of revenue went WAY up on last earnings.  Future business should be getting cheaper for a mature company like PLTR, they aren’t a startup.  My last problem with them, too many fan boys who are trading emotionally rather than logically.  PLTR will grow steadily but they will not be busting out to 100B+ anytime soon.  Give it a few more quarters and let them prove they can beat their numbers, retain customers, and reduce their cost of revenue until you put too much into them.",
        "created_utc": 1614824016,
        "id": "gplv80r",
        "permalink": "/r/wallstreetbets/comments/lx7i43/palantir_is_undervalued_and_is_time_for_it_to/gplv80r/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1614852816.0
    },
    {
        "author": "MassCasualty",
        "body": "Microsoft Money 4.x for Win 95",
        "created_utc": 1615516145,
        "id": "gqnayna",
        "permalink": "/r/wallstreetbets/comments/m36etj/cathie_called_and_said_pleaseloadtherocket/gqnayna/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1615544945.0
    },
    {
        "author": "Dutch9",
        "body": "My Microsoft screensaver image is Bulgaria today. What does it mean????",
        "created_utc": 1614876881,
        "id": "gpo5ml5",
        "permalink": "/r/wallstreetbets/comments/lxkint/gme_megathread_for_march_04_2021/gpo5ml5/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1614905681.0
    },
    {
        "author": "GasolinePizza",
        "body": "Alright, I'll play devil's advocate.\n\nGamestop is a game retailer, not directly part of the gaming industry. The videogame industry is continuing to blow up but it's shifting more and more to digital goods.\n\nGamestop has yet to adapt, or give any long term plans about how it will adapt. None of the current online storefront runners, like Microsoft, Sony, Nintendo, Valve, not Epic have any reason to give Gamestop a place in their ecosystems for no reason. Especially since for Microsoft and Sony, their ecosystem is how they make all the money back from selling consoles at a loss.\n\nLooking at the PC market for example, getting any sort of beachfront in the store market share is brutal. Epic games spent years spending outrageous amounts of money doing things like giving away free games and large discounts to attract users, and they still didn't make more than a scratch until Fortnite came along. Origin and Uplay are both seen as annoyances rather than desirable services.\n\nSo given all that, I don't see what gamestop has to offer in the digital marketplace. Forget drive or investment experience or even business sense for a second, because unfortunately those don't mean anything if your company doesn't have anything to offer. The Gaming industry is definitely not going anywhere, but that doesn't mean gamestop won't either.\n\nPlus, RC and crew haven't actually released any sort of plan or direction for the company yet, so as of now it's still just kind of sinking without any future rescue in sight.\n\nThat's my devil's advocate opinion for it. There are some points it has in it's favor, but if they try to become a digital game retailer they're going to get destroyed mercilessly imo. They just don't have anything to sell or anything in exchange for one of the current big players to let them have a slice of the market ¯\\\\\\_(ツ)\\_/¯",
        "created_utc": 1614894836,
        "id": "gppc599",
        "permalink": "/r/wallstreetbets/comments/lxpv9o/starting_to_understand_the_power_of_the_retard/gppc599/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614923636.0
    },
    {
        "author": "uriejejejdjbejxijehd",
        "body": "Msft, brkb and fxaix.",
        "created_utc": 1614819298,
        "id": "gplmawh",
        "permalink": "/r/stocks/comments/lx8dqb/what_are_we_buying_during_this_sale/gplmawh/",
        "score": 17,
        "subreddit": "stocks",
        "created": 1614848098.0
    },
    {
        "author": "One_Situation_2725",
        "body": "The first article I've seen suggesting people buy (at least some of) the tech dip.\n\n[https://www.marketwatch.com/story/buy-the-dip-with-apple-microsoft-and-these-other-tech-stocks-before-they-fly-way-higher-says-analyst-11614860585?mod=home-page](https://www.marketwatch.com/story/buy-the-dip-with-apple-microsoft-and-these-other-tech-stocks-before-they-fly-way-higher-says-analyst-11614860585?mod=home-page)\n\nHopium has arrived, ready for immediate injection",
        "created_utc": 1614886905,
        "id": "gpoth87",
        "permalink": "/r/SPACs/comments/lxgszv/announcements_x_daily_discussion_for_mar042021/gpoth87/",
        "score": 17,
        "subreddit": "SPACs",
        "created": 1614915705.0
    },
    {
        "author": "ZiLBeRTRoN",
        "body": "It’s a great idea. Microsoft Gamepass is fucking dope. They could make one for all the platforms.",
        "created_utc": 1614746009,
        "id": "gpi0xd9",
        "permalink": "/r/wallstreetbets/comments/lwgbtr/gme_please_read/gpi0xd9/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1614774809.0
    },
    {
        "author": "Jealous-Meeting-7815",
        "body": "Microsoft will buyout out MVIS now with the contract announcement.",
        "created_utc": 1617220066,
        "id": "gsy8654",
        "permalink": "/r/wallstreetbets/comments/mh2ryh/daily_discussion_thread_for_march_31_2021/gsy8654/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1617248866.0
    },
    {
        "author": "Marvkid27",
        "body": "Msft will not drop another 33%",
        "created_utc": 1614895279,
        "id": "gppd57p",
        "permalink": "/r/investing/comments/lxh7am/daily_general_discussion_and_spitballin_thread/gppd57p/",
        "score": 16,
        "subreddit": "investing",
        "created": 1614924079.0
    },
    {
        "author": "s0uly",
        "body": "Now I am kicking myself over not increasing my position. Definitely great for the long term but doing my best to diversify. Thankfully some of the ETF/Index Fund I have has great holding of MSFT.",
        "created_utc": 1617229470,
        "id": "gsyry6x",
        "permalink": "/r/stocks/comments/mhdrqg/microsoft_wins_us_army_contract_for/gsyry6x/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1617258270.0
    },
    {
        "author": "the_beast93112",
        "body": "That just a rumor. The truth is it's Discord who reached out to Microsoft about a possible buy.",
        "created_utc": 1617230684,
        "id": "gsyuacp",
        "permalink": "/r/stocks/comments/mhdrqg/microsoft_wins_us_army_contract_for/gsyuacp/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1617259484.0
    },
    {
        "author": "Reddit-questions21",
        "body": "Sold Msft shares held for years for GME.\n\nI would like to think that Bill would be proud. If not he can tell me about his disappointment in me while on the moon.",
        "created_utc": 1615476678,
        "id": "gqky8ti",
        "permalink": "/r/wallstreetbets/comments/m2q39b/gme_megathread_for_march_11_2021/gqky8ti/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1615505478.0
    },
    {
        "author": "FalconsBlewA283Lead",
        "body": "Thought it was a real sign of maturity on my part when i resisted the urge to buy GME at 45 before wave 2 and instead loaded up on bluechips like AAPL and MSFT. Turns out I just hate money (in the short term of course)",
        "created_utc": 1614864218,
        "id": "gpnem6r",
        "permalink": "/r/stocks/comments/lwqqa4/rstocks_daily_discussion_wednesday_mar_03_2021/gpnem6r/",
        "score": 15,
        "subreddit": "stocks",
        "created": 1614893018.0
    },
    {
        "author": "Independent-Craft-46",
        "body": "Guys...Microsoft.",
        "created_utc": 1615765814,
        "id": "gqykhrj",
        "permalink": "/r/wallstreetbets/comments/m52udt/what_are_your_moves_tomorrow_march_15_2021/gqykhrj/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1615794614.0
    },
    {
        "author": "Chitownfico",
        "body": "**F** in the chat boys\n\nI sold my 40 $235 weekly MSFT calls for a measly $400 profit, and literally 4 minutes later the army contract is announced, and they're now up $14k more...fml",
        "created_utc": 1617217665,
        "id": "gsy2y39",
        "permalink": "/r/wallstreetbets/comments/mh2ryh/daily_discussion_thread_for_march_31_2021/gsy2y39/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1617246465.0
    },
    {
        "author": "lauraly85",
        "body": "I bought Microsoft, Apple, tesla and trying to get costco and disney  if it goes low enough. Have a few Wallstreet bets stocks so taking advantage and trying to get some of the safer stocks since I only started investing 1 month ago.",
        "created_utc": 1614875039,
        "id": "gpo1cfl",
        "permalink": "/r/CanadianInvestor/comments/lxnmxb/what_stocks_is_everyone_buying_the_dip_on_today/gpo1cfl/",
        "score": 14,
        "subreddit": "CanadianInvestor",
        "created": 1614903839.0
    },
    {
        "author": "Sandvicheater",
        "body": "Hey is the MSFT acquisition of Bethesda contributing to the GME juice as well? Since gamestop and Microsoft got that partnership going on.",
        "created_utc": 1615313002,
        "id": "gqcs3pw",
        "permalink": "/r/wallstreetbets/comments/m16emz/gme_megathread_for_march_09_2021/gqcs3pw/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1615341802.0
    },
    {
        "author": "Fit-Mycologist-6951",
        "body": "Joined a scheduled “compliance training” meeting on Microsoft Teams while watching my stocks go down. Forgot my cam was on and my boss saw me with my head down looking at my phone the entire 45 minutes and is scheduling a meeting with me tomorrow.\n\nWell... Fuck.",
        "created_utc": 1615400528,
        "id": "gqh4it4",
        "permalink": "/r/wallstreetbets/comments/m237es/gme_megathread_part_2_for_march_10_2021/gqh4it4/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615429328.0
    },
    {
        "author": "EmbiidWeTrust",
        "body": "My entire savings was put into MSFT over the summer. Best decision ever",
        "created_utc": 1617232527,
        "id": "gsyxqo1",
        "permalink": "/r/stocks/comments/mhdrqg/microsoft_wins_us_army_contract_for/gsyxqo1/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1617261327.0
    },
    {
        "author": "Sandvicheater",
        "body": "MSFT just got military contract to make Spartans. You better believe GME going along for the ride!",
        "created_utc": 1617218036,
        "id": "gsy3qwl",
        "permalink": "/r/wallstreetbets/comments/mh524f/gme_megathread_for_march_31_2021/gsy3qwl/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1617246836.0
    },
    {
        "author": "-N-8-",
        "body": "&gt;here could b\n\nmicrosoft, intel, alibaba did it too... I think its because of GME shorts covering tomorrow, we'll see",
        "created_utc": 1614816674,
        "id": "gplhsvg",
        "permalink": "/r/StockMarket/comments/lx7j1c/tesla_and_ford_flash_crash_in_after_hours_thoughts/gplhsvg/",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1614845474.0
    },
    {
        "author": "ihavenipplefocker",
        "body": "I couldn’t disagree more about Apple. If Apple continues to dip for “quite some time” then the market as a whole is in serious trouble. Arguably the best company in the world will retrace to what 15-20 PE? Is that what you’re saying? At what point will the market realize that the re-opening/value trades have become expensive off momentum? When that comes, the rotation out will be violent and I want to be in the best companies such as Apple, Amazon, Microsoft etc when that happens.",
        "created_utc": 1614833417,
        "id": "gpmcskt",
        "permalink": "/r/stocks/comments/lxc7hs/what_does_buy_on_dips_mean_exactly/gpmcskt/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1614862217.0
    },
    {
        "author": "plazmohney",
        "body": "Everyone doubting tech. Every company you are buying instead of tech is replaceable. Or is slowly dying. Aapl msft amzn could go up 100% tomorrow and they would still be undervalued compared to the rest of the market. Boomers don’t get it",
        "created_utc": 1614822948,
        "id": "gplt2l9",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gplt2l9/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614851748.0
    },
    {
        "author": "calcology",
        "body": "Loading up on $MSFT and $AAPL weeklies and 3/19 options slightly OTM. Microsoft's most recent earnigns were stellar, valuation is fair if not undervalued, and gaming upside is huge to me. Don't get caught up in \"the crash.\" Nothing is crashing. Buyers will come in...yields matter, but less for $AAPL and $MSFT than for small cap growth tech. Also, stocks can and will go up in a rising yield environment. Look at the dotcom era to see how crazy those valuations are. $SPY $QQQ\nare NOT bubbles. The Fed has changed nothing with their monetary easing. The market just got temporarily spooked. Volatility is your friend here--people have money to spend and invest...they will keep buying. Buy this dip and any others in megacaps. And again, the indexes are FINE. Don't be a silly bear at this VIX. Btw...shorting volatility is not a bad play necessarily...",
        "created_utc": 1615227266,
        "id": "gq8jgu7",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8jgu7/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615256066.0
    },
    {
        "author": "Pdxcaber",
        "body": "Nokia $NOK on Monday announced $AMZN AWS, $GOOGL Google and $MSFT plan to utilize Nokia’s Radio Access Network (RAN), Open RAN, Cloud RAN (vRAN) and edge technology. The partnerships will advance Nokia’s 4G and 5G portfolios.\n\n&gt;Bullish $NOK",
        "created_utc": 1615833874,
        "id": "gr1ic8j",
        "permalink": "/r/wallstreetbets/comments/m5hbpf/daily_discussion_thread_for_march_15_2021/gr1ic8j/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615862674.0
    },
    {
        "author": "Ryykur",
        "body": "NOK partners with Google Amazon and Microsoft what more can you ask for? $60 EOY",
        "created_utc": 1615828512,
        "id": "gr169nn",
        "permalink": "/r/wallstreetbets/comments/m5hbpf/daily_discussion_thread_for_march_15_2021/gr169nn/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615857312.0
    },
    {
        "author": "WillBeBannedSoon2",
        "body": "New BB-Microsoft product announced sounds good for BB. Expecting their stock to drop tomorrow.",
        "created_utc": 1615840400,
        "id": "gr1x4hw",
        "permalink": "/r/wallstreetbets/comments/m5tffe/what_are_your_moves_tomorrow_march_16_2021/gr1x4hw/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615869200.0
    },
    {
        "author": "oregon_forever",
        "body": "Apple, Facebook, Google, Microsoft at a P/E of 27? Nah too expensive. Tech bubble...\n\nCaterpillar, Boeing, Disney, Nike at a P/E of 50? Sign me up for those value plays baby.",
        "created_utc": 1615577470,
        "id": "gqq1tqz",
        "permalink": "/r/wallstreetbets/comments/m3f9fp/daily_discussion_thread_for_march_12_2021/gqq1tqz/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615606270.0
    },
    {
        "author": "Devilnutz2651",
        "body": "NOK signed deals with MSFT and Amazon and it moved 5 cents",
        "created_utc": 1615864790,
        "id": "gr33b03",
        "permalink": "/r/wallstreetbets/comments/m5tffe/what_are_your_moves_tomorrow_march_16_2021/gr33b03/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615893590.0
    },
    {
        "author": "HungryMugiwara",
        "body": "Microsoft expanding partnership??? Covid vaccines in gamestop stores now?",
        "created_utc": 1617130338,
        "id": "gstx2qu",
        "permalink": "/r/wallstreetbets/comments/mgewny/gme_megathread_for_march_30_2021/gstx2qu/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1617159138.0
    },
    {
        "author": "Pdxcaber",
        "body": "Rotation is over. Back to tech .. \n&gt;Who bought the dip? \n*****************\n\n\n\n\nPLTR, CCIV, AAPL, MSFT and TSLA. \nI'm deep in AAPL and MSFT..",
        "created_utc": 1615264961,
        "id": "gqan5fq",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqan5fq/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615293761.0
    },
    {
        "author": "netmovements",
        "body": "Staying long on GME, don't buy anything from Sony, Microsoft, Best Buy, Target, Walmart, Amazon etc that you can get from GameStop. I'm in almost $10k and continue to get all my xbox live subscriptions, consoles, controllers and games from Gamestop. Keep buying their merch and stock.\n\nNow let's go!!! 🚀🚀🚀 buy buy buy and hold hold hold on tight 💎💎 💎",
        "created_utc": 1614703243,
        "id": "gpfidsh",
        "permalink": "/r/wallstreetbets/comments/lw4qgi/fuck_it_heres_your_daily_gme_threadmegathread_3221/gpfidsh/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1614732043.0
    },
    {
        "author": "WSB_YOLOs",
        "body": "today, GME will pass Apple in price per share\n\nTomorrow, it will be Microsoft",
        "created_utc": 1614781643,
        "id": "gpjbbao",
        "permalink": "/r/wallstreetbets/comments/lwtejk/gme_megathread_for_march_3rd_2021/gpjbbao/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1614810443.0
    },
    {
        "author": "-_Ven_-",
        "body": "Fun fact of the day for you apes: Melvin Capital has over 4,500 stock holdings (for ex. Apple, Microsoft, NIO, Facebook, Bank of America, Disney) . Good luck trying to NOT make them money. Stop bashing other companies as a \"distraction\" - it's literally impossible to not be investing alongside them.",
        "created_utc": 1614821238,
        "id": "gplpqqk",
        "permalink": "/r/wallstreetbets/comments/lx4a75/rkt_yolo_update_mar_3_2021_i_still_like_this_stock/gplpqqk/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1614850038.0
    },
    {
        "author": "rounderuss",
        "body": "Just zoom out for a year. Set it and forget it. If your invested in companies like $MSFT and lost a shit ton this last week like me, relax. They’re solid and will come back. Imho...",
        "created_utc": 1614869856,
        "id": "gpnpktc",
        "permalink": "/r/stocks/comments/lxlrpr/bit_worried_about_the_stock_market_this_time/gpnpktc/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1614898656.0
    },
    {
        "author": "ccre4life",
        "body": "NOK already up 2% on a shitty flat day.\n\nTime to pile on homies. Calls for 3/19 are cheap.\n\nRambo event Thursday will bring the pump.\n\nPlus they just partnered with MSFT.",
        "created_utc": 1615830175,
        "id": "gr1a1bw",
        "permalink": "/r/wallstreetbets/comments/m5hbpf/daily_discussion_thread_for_march_15_2021/gr1a1bw/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615858975.0
    },
    {
        "author": "Boomtown626",
        "body": "DD is good, but there's much more to it. If you learn nothing else from this long post, it's this: test your gut feelings against cold, hard facts to see how right or wrong you are. \n\nDevote yourself to learning and reading. Start with some basic metrics, like topline revenue, profit margin, ROE. Pick stocks, or industries, or sectors you think you understand. Commit to a certain number of hours per day or per week diving into numbers. \n\nStart making concrete predictions and holding yourself accountable. (ie: I think stock X will be at price Y on date Z.) Keep track of these predictions and review your work. A good one to start with is: \"Do you think the S&amp;P 500 will be higher or lower 3 months from today?\" What about 6 months? End of year? Evaluate your gut feelings against cold, hard facts. Do this for individual stocks too. Do it for AMZN, TSLA, NIO, RKT, CAT, JNJ, and MMM. Keep a spreadsheet. Document your accuracies and inaccuracies. \n\nWhile you're starting down your path, keep your real money relatively low risk. Either have your funds in low-risk plays, or only put a small amount of your funds into the high risk plays you're interested in. \n\nOn that note, one of the most important things to be honest with yourself about is, how well do you understand risk? How risky is it to put all your money into AAPL, vs MSFT, vs VOO, vs QQQ, vs (insert penny stock of choice here)? How do you tweak your portfolio so it matches your risk tolerance? \n\nThese are the things you should be focusing on. DD is only a small piece of the equation.",
        "created_utc": 1614740747,
        "id": "gphrc6a",
        "permalink": "/r/stocks/comments/lwj84t/how_to_dd_what_do_i_look_for_what_should_i_focus/gphrc6a/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1614769547.0
    },
    {
        "author": "ccre4life",
        "body": "Haters are hating on NOK but it has all the right pieces for organic growth. \n\nNew CEO, New leadership. Already signing New contracts (see Microsoft today).\n\nRambo event Thursday. \n\nI dont care what you guys think! This baby is having a 10-20% week.",
        "created_utc": 1615829975,
        "id": "gr19ktw",
        "permalink": "/r/wallstreetbets/comments/m5hbpf/daily_discussion_thread_for_march_15_2021/gr19ktw/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615858775.0
    },
    {
        "author": "TheAmazingSpiderBan",
        "body": "Microsoft is a pretty gay name for a company tbh",
        "created_utc": 1614716555,
        "id": "gpgd99i",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpgd99i/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1614745355.0
    },
    {
        "author": "gravityshift12",
        "body": "Failed a Microsoft exam Saturday-entered into a blackout by 9pm. Kept it going Sunday and then ate 2 steaks and probably 6 hot dogs, a burger, sushi and miso soup. Woke up today with a stomach ache from hell and texted my boss that I may have covid gotta work from home for the next week. Knocking on rock bottoms door",
        "created_utc": 1617053725,
        "id": "gsqezm8",
        "permalink": "/r/wallstreetbets/comments/mfy3xf/what_are_your_moves_tomorrow_march_30_2021/gsqezm8/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1617082525.0
    },
    {
        "author": "n_ooFy",
        "body": "Automotive LIDAR ready in April AND huge hololens military contract to $MSFT today",
        "created_utc": 1617224278,
        "id": "gsyhdj4",
        "permalink": "/r/wallstreetbets/comments/mhfjce/mvis_gains_called_my_doctor_for_my_erection/gsyhdj4/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1617253078.0
    },
    {
        "author": "zheng_ole",
        "body": "My mouth is watering looking at AAPL, CRM, MSFT... keep dumping babies, ima gonna getcha soon",
        "created_utc": 1615244333,
        "id": "gq9lw3h",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9lw3h/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615273133.0
    },
    {
        "author": "jrarriesgado",
        "body": "Ok f u MSFT I’m buying 10 more shares of GME",
        "created_utc": 1615309687,
        "id": "gqckid5",
        "permalink": "/r/wallstreetbets/comments/m16emz/gme_megathread_for_march_09_2021/gqckid5/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615338487.0
    },
    {
        "author": "psych_ing_invest",
        "body": "What about the meeting with Microsoft ?? Is there any information ?",
        "created_utc": 1617131644,
        "id": "gstzz7j",
        "permalink": "/r/wallstreetbets/comments/mgewny/gme_megathread_for_march_30_2021/gstzz7j/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1617160444.0
    },
    {
        "author": "StonedTurtle420710",
        "body": "NOK just partnered with Google, Amazon, and Microsoft. \n\nTime to start fueling that NOK rocket, bois.",
        "created_utc": 1615836087,
        "id": "gr1nc2z",
        "permalink": "/r/wallstreetbets/comments/m5hbpf/daily_discussion_thread_for_march_15_2021/gr1nc2z/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615864887.0
    },
    {
        "author": "bloodbuzzz-ohio",
        "body": "GameStop is going to be the next Apple, Microsoft, Disney and Tesla combined.",
        "created_utc": 1617112676,
        "id": "gssu7bh",
        "permalink": "/r/wallstreetbets/comments/mgewny/gme_megathread_for_march_30_2021/gssu7bh/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1617141476.0
    },
    {
        "author": "PM_ME_UR_CIRCUIT",
        "body": "This is me watching Twitter nosedive 13% this week and microsoft being down almost 3%. Then I look at their 5 year growth and I'm like, \"Oh yea, thats why I chose them.\"",
        "created_utc": 1614885404,
        "id": "gpopra1",
        "permalink": "/r/StockMarket/comments/lxkou8/accepting_i_dont_have_the_temperamental_qualities/gpopra1/",
        "score": 11,
        "subreddit": "StockMarket",
        "created": 1614914204.0
    },
    {
        "author": "yy1500",
        "body": "[https://www.techradar.com/in/news/nokia-signs-5g-cloud-deal-with-aws-google-microsoft](https://www.techradar.com/in/news/nokia-signs-5g-cloud-deal-with-aws-google-microsoft)\n\n \n\n# Nokia signs 5G cloud deal with AWS, Google, Microsoft\n\n \n\nNokia has agreed new partnerships with three of the world’s biggest public [cloud](https://www.techradar.com/in/best/best-cloud-computing-services) platforms to expand the reach of its [5G](https://www.techradar.com/in/news/what-is-5g-everything-you-need-to-know) portfolio.\n\nThe Finnish network equipment manufacturer already has deals with Amazon Web Services (AWS), Microsoft Azure and Google Cloud, reflecting the growing convergence of IT and telecoms in the 5G era.",
        "created_utc": 1615832461,
        "id": "gr1f5r3",
        "permalink": "/r/wallstreetbets/comments/m5hbpf/daily_discussion_thread_for_march_15_2021/gr1f5r3/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615861261.0
    },
    {
        "author": "ccre4life",
        "body": "NOK calls at open tomorrow. Big week coming up.\n\nRambo event Thursday. MSFT partnership just hit news today.",
        "created_utc": 1615839498,
        "id": "gr1v3j5",
        "permalink": "/r/wallstreetbets/comments/m5tffe/what_are_your_moves_tomorrow_march_16_2021/gr1v3j5/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615868298.0
    },
    {
        "author": "HookersForDahl2017",
        "body": "Roblox is safer than Microsoft and Apple combined",
        "created_utc": 1615402124,
        "id": "gqh8ka5",
        "permalink": "/r/wallstreetbets/comments/m1v1e6/daily_discussion_thread_for_march_10_2021/gqh8ka5/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615430924.0
    },
    {
        "author": "Trump_Ate_My_Ass",
        "body": "Quad witching is next week, I can't wait.\n\n&amp;#x200B;\n\nIt's also the anniversary of 3/20 MSFT 200c. Never forget",
        "created_utc": 1615520563,
        "id": "gqnj5lg",
        "permalink": "/r/wallstreetbets/comments/m30mij/what_are_your_moves_tomorrow_march_12_2021/gqnj5lg/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615549363.0
    },
    {
        "author": "KaiserSenpaiAckerman",
        "body": "Guess I'm gonna get some Roblox, Microsoft, Apple, Tesla and bit more AMC.\n\nI bought plenty of GME and can't afford more but I do want to invest in other stocks every paycheck.",
        "created_utc": 1615429580,
        "id": "gqiusqd",
        "permalink": "/r/wallstreetbets/comments/m28d30/what_are_your_moves_tomorrow_march_11_2021/gqiusqd/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615458380.0
    },
    {
        "author": "Lower-Pangolin-1013",
        "body": "MVIS went up 50% today on Microsoft news, imagine when the buyout news come out...ah shhhhieettttt",
        "created_utc": 1617227026,
        "id": "gsyn3kh",
        "permalink": "/r/wallstreetbets/comments/mhecu3/what_are_your_moves_tomorrow_april_01_2021/gsyn3kh/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1617255826.0
    },
    {
        "author": "maz-o",
        "body": "Had to get in on the dip. If it dips further, I'm shit out of luck because I just threw all the last cash I had into AAPL, MSFT, WMT, AMZN. Willing to hold these forever so not really stressed about short term gains or losses.",
        "created_utc": 1615238856,
        "id": "gq9a9ut",
        "permalink": "/r/stocks/comments/m0cz9v/rstocks_daily_discussion_monday_mar_08_2021/gq9a9ut/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1615267656.0
    },
    {
        "author": "knawlejj",
        "body": "Great product and this acquisition does some value add but moreso eating some smaller competition. I love Okta but I can't justify buying in at this price point, even after it sank a bit here. \n\nIdentity access and mgmt isn't going away, but you have to differentiate yourself from Google and Microsoft without alienating their  respective suites. That will be a challenge.",
        "created_utc": 1614825711,
        "id": "gplyogl",
        "permalink": "/r/investing/comments/lx7dys/okta_to_acquire_auth0_for_65billion_rev_climbs_40/gplyogl/",
        "score": 10,
        "subreddit": "investing",
        "created": 1614854511.0
    },
    {
        "author": "Floofyboy",
        "body": "If all of the smart money did that, microsoft would be down more than 13$! Nasdaq is down 1K points, if all smart money got out, that would be way more than that.\n\n\n\nThe answer is, nobody knows exactly how long this correction will last. If you had a crystal ball that says its gonna keep going for all of 2021, then yes you should switch asap. But many people (me included) think growth will be doing well again by the end of the month. Heck, growth/tech did wonderful monday.\n\n\nBut i think a decent strategy is to find something that does good in both worlds. You don't need to choose between risky tech and oil. One example is IAI, which was doing well long before the correction, and has kept doing well during it.",
        "created_utc": 1614824613,
        "id": "gplwfvt",
        "permalink": "/r/stocks/comments/lwqqa4/rstocks_daily_discussion_wednesday_mar_03_2021/gplwfvt/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1614853413.0
    },
    {
        "author": "Kintsugi2",
        "body": "I'm pretty much all in on GME but point 5 is stupid. My company has 10 employees and we have a long term deal with Microsoft for 365 dynamics. CRMs have this, literally a quarter of all the fucking companies in the US have this. It doesn't mean anything except that they are becoming for tech focused on the backend, which is obviously good to hear - but not a huge contributor to anything in the future - we already know that with Cohen at the helm they will be going this way regardless.",
        "created_utc": 1614736961,
        "id": "gphjxlv",
        "permalink": "/r/wallstreetbets/comments/lwgbtr/gme_please_read/gphjxlv/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614765761.0
    },
    {
        "author": "ccre4life",
        "body": "NOK is now parterning with MSFT, and has a big Rambo event on Thursday.\n\nPlus they got some solid DD on this sub.\n\nIt's time. Let the hype build!",
        "created_utc": 1615829365,
        "id": "gr186ww",
        "permalink": "/r/wallstreetbets/comments/m5hbpf/daily_discussion_thread_for_march_15_2021/gr186ww/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615858165.0
    },
    {
        "author": "TayahuaJ",
        "body": "SQ, PYPL, AMZN, GOOG, MSFT, NVDA are all \"tech growth\" stocks I own, each about 5% of my non-retirement bucket.",
        "created_utc": 1614876912,
        "id": "gpo5p65",
        "permalink": "/r/stocks/comments/lxo7om/warren_buffets_stock_strategy_is_more_relevant/gpo5p65/",
        "score": 58,
        "subreddit": "stocks",
        "created": 1614905712.0
    },
    {
        "author": "conti555",
        "body": "I think people are taking the DCF valuation theory too seriously. Thinking back to 2018, AMD, Nvidia, Google etc were all soaring despite the 10 year treasury reaching over 3%. What percentage of the market values companies purely in DCF anyway?\n\nI think this is more a broader correction around fears that the Fed will not live up to it's word on 'average inflation targeting' and will have to raise rates sooner and quicker than normal. I personally can't see this happening, as the Fed has shown itself to be extremely dovish and is trying to recover the real economy first (jobs ans solvency issues). \n\nThere is also the huge debt problem they now have from all the money printing they've done, the easiest way for them to solve that is to inflate it away as quickly as possible, so long term high inflation seems like something they would try for. I can't see the USA going into any kind of austerity to pay it off.",
        "created_utc": 1614894009,
        "id": "gppa9gs",
        "permalink": "/r/investing/comments/lxs4ue/the_relationship_between_stocks_and_interest_rates/gppa9gs/",
        "score": 49,
        "subreddit": "investing",
        "created": 1614922809.0
    },
    {
        "author": "RandomlyGenerateIt",
        "body": "That better be true, because I bought a bunch of AAPL/AMD/NVDA on margin on that first \"dip\", and now it doesn't feel so much like \"free money\" anymore...",
        "created_utc": 1614811378,
        "id": "gpl776l",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gpl776l/",
        "score": 46,
        "subreddit": "stocks",
        "created": 1614840178.0
    },
    {
        "author": "billwaters",
        "body": " \n\nPositions: [https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o\\_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing](https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing) (not updated for today's shit performance)\n\nBeen doing exclusively put credit spreads since November, NVDA helped me get up to $144k gain, which is now all but wiped away from NVDA and TSLA in the last two weeks. GUH",
        "created_utc": 1614829809,
        "id": "gpm6lm3",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpm6lm3/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614858609.0
    },
    {
        "author": "theredmage333",
        "body": "I keep buying nvda on the big dips, no reason for them to be down",
        "created_utc": 1614829584,
        "id": "gpm67d3",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpm67d3/",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614858384.0
    },
    {
        "author": "No-Pay3755",
        "body": "What are you holding? In the long run stonks go up. I’ve had plenty of companies that I wish I held on to but sold for small gains. NVDA at $9 that I sold in the $20’s 200 shares of AMD that I couldn’t wait to unload at $5.25 only to see it rip. 365 shares of AAPL at $65 that split many times since I sold it. I would have had 10,000+ shares by now but I sold at $85. I would have done better if I didn’t login at all sometimes. Hang tight. They will turn around. If you have to sell, just sell enough so you can sleep at night.",
        "created_utc": 1614802064,
        "id": "gpkm4mo",
        "permalink": "/r/stocks/comments/lx2vvg/ive_accepted_my_portfolio_is_going_to_zero/gpkm4mo/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1614830864.0
    },
    {
        "author": "gerjerb",
        "body": "AAPL 145c 4/16\n\nNVDA 600c 4/16\n\nAMD 100c 4/16\n\nPLTR 35c 5/21\n\nTSLA 1000c 5/21\n\nABNB 250c 5/21\n\n\nI’m totally bullish on tech still. In a perfect storm, it’s barely shaken. Buy lots of cheap otm calls with over 30dte and meet me in the Seychelles.",
        "created_utc": 1614806314,
        "id": "gpkvyif",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpkvyif/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1614835114.0
    },
    {
        "author": "JonathanL73",
        "body": "I dont own Pltr, and I haven't bought NIO for a long time, until recently today after it was brought down a couple notches,and seem to hit a floor. $38 is a big difference from it being in the $60's. What I bought most of today was NVIDIA. I also got FNGU, NNDM. \n\nAlso I finally decided to pull the trigger on buying some tsla today at around $600, the last time I bought Tesla it was about $500\n\nI havent really bought much of anything for a while now until this week.\n\nEvery tech stock may be a meme stock, but I don't fomo buy when everybody else does. I buy when people are panic selling or if the market is red. The long-term bull-case for TSLA &amp; NIO is still strong despite the temporary semiconducter shortage. We are in a recovering economy not a collapsing one.\n\nI also bought some Costco &amp; Disney. Not all my stocks are tech. My ALLY financial stock has been doing great lately.",
        "created_utc": 1614895634,
        "id": "gppdxax",
        "permalink": "/r/StockMarket/comments/lxs16s/when_in_doubt_zoom_out/gppdxax/",
        "score": 22,
        "subreddit": "StockMarket",
        "created": 1614924434.0
    },
    {
        "author": "billwaters",
        "body": "Positions: [https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o\\_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing](https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing) (not updated for today's shit performance)\n\nBeen doing exclusively put credit spreads since November, NVDA helped me get up to $144k gain, which is now all but wiped away from NVDA and TSLA in the last two weeks. GUH",
        "created_utc": 1614829432,
        "id": "gpm5xan",
        "permalink": "/r/wallstreetbets/comments/lxbttu/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpm5xan/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1614858232.0
    },
    {
        "author": "calamitymic",
        "body": "Current gen ryzen chips are touted to be better than current gen intel. GPU game is gaining on nvidia. Ai software starting to utilize amd gpu. I think they are ready to take more market share. \n\nHaven’t bought the dip but I’m waiting for slight buying pressure. Then, I’m gonna go in dry as fuck because I need them to feel pain when I insert myself.\n\nTLDR: I’m bull dick bullish on AMD",
        "created_utc": 1614866733,
        "id": "gpnj8yg",
        "permalink": "/r/wallstreetbets/comments/lxl5ef/recent_dips_in_semiconductors_an_opening/gpnj8yg/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614895533.0
    },
    {
        "author": "RipInPepz",
        "body": "Selling my rtx3080 today to buy 10 more shares. Gt1030 here I come. I like the stock. Fuck you nvidia.",
        "created_utc": 1615218505,
        "id": "gq7yk32",
        "permalink": "/r/wallstreetbets/comments/m0fpgd/gme_megathread_for_march_08_2021/gq7yk32/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1615247305.0
    },
    {
        "author": "ihavenipplefocker",
        "body": "Dude is a clown. Ripping Cathie Wood and two seconds later talking with Dave Portnoy about an ETF he’s involved with that tracks social media stocks (meme stocks). Meanwhile Cramer telling people to buy NVIDIA 10% ago and nothing is to be said.",
        "created_utc": 1615248598,
        "id": "gq9u06x",
        "permalink": "/r/stocks/comments/m0t7z9/wheres_cramer/gq9u06x/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1615277398.0
    },
    {
        "author": "al_walid4",
        "body": "Nvidia literally can't produce enough to keep up with demand\n\nClearly that means the stock must tank by over 20%",
        "created_utc": 1615234527,
        "id": "gq90b4i",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq90b4i/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1615263327.0
    },
    {
        "author": "bagtf3",
        "body": "I got 99 problems and 3 of them are GOEV NVDA and AAPL.",
        "created_utc": 1615265941,
        "id": "gqaompw",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqaompw/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1615294741.0
    },
    {
        "author": "BryGuyTI",
        "body": "TSLA, NVDA, and ARKK have been fucking me so hard.",
        "created_utc": 1615237694,
        "id": "gq97mjz",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq97mjz/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1615266494.0
    },
    {
        "author": "captainstrange94",
        "body": "Lol bro companies like amd, nvidia, amzn have lost gains going back to july 2020.",
        "created_utc": 1615234617,
        "id": "gq90isn",
        "permalink": "/r/stocks/comments/m0cz9v/rstocks_daily_discussion_monday_mar_08_2021/gq90isn/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1615263417.0
    },
    {
        "author": "Krios625",
        "body": "Also invested in semiconductors with SMH, don't worry about anything serious. AMD and Nvidia had incredible quarters and their stock dropped, so it's more of an irrational market. Never forget that the stock market rewards the patient",
        "created_utc": 1614801066,
        "id": "gpkju1i",
        "permalink": "/r/stocks/comments/lx2i7z/wondering_if_anyone_here_can_offer_any_insight_on/gpkju1i/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1614829866.0
    },
    {
        "author": "billwaters",
        "body": "Cathie Wood sold NVDA wtf",
        "created_utc": 1614827972,
        "id": "gpm34r8",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm34r8/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614856772.0
    },
    {
        "author": "AllProWomenRespecter",
        "body": "Looks like this week is the one that I finally am fully BTFO\n\nLearn from me boys. Don't buy calls on companies that are actually fundamentally sound and report flawless earnings with huge current catalysts like NVDA.\n\nBuy calls on an ancient mortgage originator with a huge market cap and no growth potential instead.",
        "created_utc": 1614718387,
        "id": "gpghln9",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpghln9/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614747187.0
    },
    {
        "author": "reginaldvs",
        "body": "I'm honestly shocked AMD is falling. I built my first AMD PC last year and Ryzen is killing it. Not to mention, their Radeon division is competitive with NVIDIA. But anyways, Is it because of the chip shortage? Who knows.",
        "created_utc": 1614824970,
        "id": "gplx68v",
        "permalink": "/r/options/comments/lx6g9c/amd_analysis_update/gplx68v/",
        "score": 13,
        "subreddit": "options",
        "created": 1614853770.0
    },
    {
        "author": "blastoff__",
        "body": "$NVDA is going to make people rich at this price. Their earnings were unbelievable, it’s only a matter of time before the acquisition of Arm Holdings goes through, and at that point they’ll have chips in 90% of the products we use daily. Not to mention EV’s &amp; crypto are in their future. I will say I’m in for a few shares at $580 so maybe not my smartest move, but I’m happy holding for the next 10 years.",
        "created_utc": 1614790335,
        "id": "gpjutlx",
        "permalink": "/r/stocks/comments/lwt9oz/what_stocks_do_you_believe_are_currently/gpjutlx/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1614819135.0
    },
    {
        "author": "areweinnarnia",
        "body": "do it! over the years I've just invested in stuff I like from companies I believed in - Jack in the box after I had their dollar tacos for the first time, AMD and Nvidia when I did my first pc build, Nintendo in the Wii U era when everyone thought the Wii U was shit and that a mobile game catching pokemon would never work.  \nMy only regret is that I didn't have more then a couple hundred in each of them.",
        "created_utc": 1615243926,
        "id": "gq9l32v",
        "permalink": "/r/wallstreetbets/comments/m0q5bm/gme_yolo_update_mar_8_2021/gq9l32v/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615272726.0
    },
    {
        "author": "Caesorius",
        "body": "She’s held NVDA shares for years, she’s 4X’d her $ on it. Plus it’s the same price it was a year ago. She needed $ for more PLTR",
        "created_utc": 1614839236,
        "id": "gpml5sh",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpml5sh/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1614868036.0
    },
    {
        "author": "Blackboxeq",
        "body": "First Nvidia.. then AMD... then PS5.... now Xbox bundles.  is nothing in stock anymore?",
        "created_utc": 1615327164,
        "id": "gqdnfxt",
        "permalink": "/r/wallstreetbets/comments/m1gs84/we_like_the_stock/gqdnfxt/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615355964.0
    },
    {
        "author": "FearlessTrader",
        "body": "NVDA basically wiped out 6 months of its gains. 😒😒😒",
        "created_utc": 1615227442,
        "id": "gq8jvow",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8jvow/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615256242.0
    },
    {
        "author": "maxkingusa",
        "body": "So basically Cathie said... if you liked these stocks 2 months ago, you should looooove them today.  She sees bigger gains now that they had these drops.  On one hand you want to puke up your lunch but on the other hand.... we should want this drop in tech and the chance to buy back the key growth companies.  \n\nI bought AAPL, NVDA, AMD, AVGO, XLE and DB (to add some more financials and energy to my portfolio).  This keeps me balanced and I can wait out the pain that tech is providing.  \n\nMy biggest gains that I have held are from VIAC, SBUX, HP, JPM, STOR, LUMN, SPY, and a host of others.\n\nLet's see if adding to tech this week will pay off.",
        "created_utc": 1615237290,
        "id": "gq96pxs",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq96pxs/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615266090.0
    },
    {
        "author": "RobotBrunch",
        "body": "AMD SOXL NVIDIA\n\nAll great stocks to own",
        "created_utc": 1614820835,
        "id": "gployh1",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gployh1/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1614849635.0
    },
    {
        "author": "RTRC",
        "body": "Today alone has wiped out a year worth of losses. Last year lost money on Spy puts when they pumped up the market with fake cash. GME gets to $300 and i'll also get back the money I lost on Nvidia puts in 2018. Had calls during the RTX 2000 series launch and switched to puts because I knew the new series was garbage. But my calls expired a week too early and I lost it all.",
        "created_utc": 1615224539,
        "id": "gq8ct0g",
        "permalink": "/r/wallstreetbets/comments/m0fpgd/gme_megathread_for_march_08_2021/gq8ct0g/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615253339.0
    },
    {
        "author": "Much_Butterscotch279",
        "body": "HERE WE GO PPL!!!! FUCK APPLE AND FUCK NVDA.. I LOVE GME",
        "created_utc": 1615220559,
        "id": "gq83bxp",
        "permalink": "/r/wallstreetbets/comments/m0j7d6/gamestop_stock_is_flying_again_the_transformation/gq83bxp/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615249359.0
    },
    {
        "author": "HaHawk",
        "body": "Exclusive advanced stock ratings from [Investing.com](https://Investing.com):\n\nApple: Strong Sell.\n\nAlphabet: Strong Sell.\n\nTesla: Strong Sell.\n\n[Amazon.com](https://Amazon.com): Strong Sell.\n\nFacebook: Strong Sell.\n\nNVIDIA: Strong Sell.\n\nThank you [investing.com](https://investing.com), very cool!",
        "created_utc": 1614827097,
        "id": "gpm1fpe",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm1fpe/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614855897.0
    },
    {
        "author": "soonseen",
        "body": "Jim cramer. Buy nvda. \n\nRetail. Ok.\n\nNvda. Down 7 percent.",
        "created_utc": 1614791993,
        "id": "gpjypyg",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjypyg/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614820793.0
    },
    {
        "author": "the_billyjack",
        "body": "NVDA, TSLA, ADBE straddles. These bad boys are moving tomorrow, one way or another.",
        "created_utc": 1615340558,
        "id": "gqedpml",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqedpml/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615369358.0
    },
    {
        "author": "FearlessTrader",
        "body": "Chip demand keeps on going up, NVDA? Back to August 2020 levels. This is some bullshit 😒😒😒",
        "created_utc": 1615257826,
        "id": "gqaav7p",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqaav7p/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615286626.0
    },
    {
        "author": "gerjerb",
        "body": "I’m not doing anything, we’ve seen an epic melt up in commodities and bonds. \n\n\nWe’re seeing real numbers for unemployment and the consequences of the covid shutdown and now the Texas deep freeze. \n\n\nNow it’s time for some insanity because algorithms are going to go crazy because we’re coming up on the anniversary of the covid crash from last year. \n\n\nThat being said: put your mouth guard in, strap into your seat, get ready for liftoff, and hope you don’t die of stroke on the way up.\n\n\nTSLA 720c 3/19\n\nAAPL 145c 4/16\n\nNVDA 600c 4/16\n\nAmd 100c 4/16\n\nPltr 35c 4/16\n\nTsla 1000c 5/21\n\nAbnb 250c 5/21\n\n\nThe chip hyper cycle is coming and EV and autonomous driving hype is consolidating into the real player in that space, Tesla. \n\n\nBut if y’all are scared, just buy $ARKK.",
        "created_utc": 1614865256,
        "id": "gpnggd1",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpnggd1/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614894056.0
    },
    {
        "author": "kaibasean",
        "body": "Nvidia is about to break the 500 barrier.\n\nAMD nearly at 79.\n\nWhat the fuck.",
        "created_utc": 1614850773,
        "id": "gpmxxk2",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpmxxk2/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614879573.0
    },
    {
        "author": "Dismiss",
        "body": "NVDA literally cannot produce GPUs fast enough to keep up with demand. This means that it must go -26% in 3 weeks.",
        "created_utc": 1615234417,
        "id": "gq901z6",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq901z6/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615263217.0
    },
    {
        "author": "levon105",
        "body": "NVDA: Blowout earnings, record profits, beat all estimates\n\nMarket: Let's dump this bad boy -10%+ in 1 week.",
        "created_utc": 1614718465,
        "id": "gpghsfo",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpghsfo/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614747265.0
    },
    {
        "author": "Alepman",
        "body": "Who the fuck selling $NVDA and Buying $GE !!!! Fuck your boomer legacy companies",
        "created_utc": 1615223852,
        "id": "gq8b60o",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8b60o/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615252652.0
    },
    {
        "author": "OsamaBinTrading",
        "body": "So happy to be cash gang. Big RIP to ARKK and Nvidia call holders.",
        "created_utc": 1615231400,
        "id": "gq8t3fk",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8t3fk/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615260200.0
    },
    {
        "author": "kemar7856",
        "body": "Cathy lost it sells nvda to buy pltr",
        "created_utc": 1614818319,
        "id": "gplkr22",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gplkr22/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614847119.0
    },
    {
        "author": "CratesOfSocks85",
        "body": "TSLA was first, NVDA is next 🚀🚀🚀🚀",
        "created_utc": 1615332514,
        "id": "gqdyhe7",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqdyhe7/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615361314.0
    },
    {
        "author": "RPMayhem",
        "body": "GameStop should buy nvidia if these trends hold much longer",
        "created_utc": 1615257692,
        "id": "gqaamkf",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqaamkf/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615286492.0
    },
    {
        "author": "wrb3",
        "body": "$700 price target for NVDA by several analysts. Is that  realistic?",
        "created_utc": 1614839611,
        "id": "gpmln2e",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpmln2e/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614868411.0
    },
    {
        "author": "soonseen",
        "body": "Quick!\n\n Let me sell my nvda and tesla for wd40 and sport clips!\n\n-facepalm-",
        "created_utc": 1614830626,
        "id": "gpm8215",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpm8215/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614859426.0
    },
    {
        "author": "siebren014",
        "body": "+ they work together with Nvidia on their technology, are going to Europe in the near future and have laid some big fundamentals lately for smooth growth",
        "created_utc": 1615246483,
        "id": "gq9pza6",
        "permalink": "/r/wallstreetbets/comments/m0t3vy/why_nio_is_a_good_buy/gq9pza6/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615275283.0
    },
    {
        "author": "goldcakes",
        "body": "Intel: 5.86B net income, 250B valuation.\n\nNvidia: 1.46B net income, 317B valuation.\n\nIntel is staging a turnaround and can easily become a growth play in the next 2-4 years, with the new technical CEO. As a PC parts enthusiast, they are already stepping up cadences and launching competitive lineups that are actually in stock, because they are being produced much more than TSMC's bottlenecked's fabs.\n\nThey are the company to watch.",
        "created_utc": 1614868663,
        "id": "gpnn1je",
        "permalink": "/r/investing/comments/lx6lm2/biden_administration_will_continue_chinese_tech/gpnn1je/",
        "score": 8,
        "subreddit": "investing",
        "created": 1614897463.0
    },
    {
        "author": "BlaCkPeZuS",
        "body": "Comparable to apple, nvidia and square. Sure brah",
        "created_utc": 1615248935,
        "id": "gq9umgb",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9umgb/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615277735.0
    },
    {
        "author": "ThrallDoomhammer",
        "body": "Nvidia less than 500 is a huge buy and will mark the start of the tech rally again.  You heard it here first",
        "created_utc": 1614811401,
        "id": "gpl78ud",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpl78ud/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614840201.0
    },
    {
        "author": "billwaters",
        "body": "I sold these when NVDA was at 565 a week ago, though it couldn't go tits up lmao",
        "created_utc": 1614831781,
        "id": "gpma3e3",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpma3e3/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614860581.0
    },
    {
        "author": "rededreded",
        "body": "Sold my AMD......to buy Nvidia.",
        "created_utc": 1614806915,
        "id": "gpkxbwq",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gpkxbwq/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1614835715.0
    },
    {
        "author": "TCGYT",
        "body": "I want a fucking GPU Nvidia, man. \n\nI wish this semi shortage would end, it would be good for my portfolio and my current waiting to build a new pc.",
        "created_utc": 1614794058,
        "id": "gpk3khe",
        "permalink": "/r/stocks/comments/lwqqa4/rstocks_daily_discussion_wednesday_mar_03_2021/gpk3khe/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1614822858.0
    },
    {
        "author": "Hadron90",
        "body": "\\&gt;$NVDA and $AMD tanking\n\n\\&gt;$GME mooning\n\nPCbros, I don't feel so good...",
        "created_utc": 1615234287,
        "id": "gq8zr50",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8zr50/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615263087.0
    },
    {
        "author": "tendeeznuts",
        "body": "NVDA officially down -25% from its highs\n\nCorrTechTion gotta be close to over rr.rr.rrright?",
        "created_utc": 1615242784,
        "id": "gq9irze",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9irze/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615271584.0
    },
    {
        "author": "randomcharachter1101",
        "body": "C'mon Nvidia don't be a twat. \n\nYour home is in the 500 range, why don't you wanna go home..? Are you too good for your home?",
        "created_utc": 1615312800,
        "id": "gqcrnb7",
        "permalink": "/r/stocks/comments/m13rgb/rstocks_daily_discussion_technicals_tuesday_mar/gqcrnb7/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1615341600.0
    },
    {
        "author": "siberianmi",
        "body": "As long as it's money you don't need now be patient, keep investing.\n\nWhen the crash came in 2007-2008 I was only a year or two into seriously investing into my retirement account.  That end of year statement was a bit of a \"Guh\" moment since everything I had earned plus some basically had evaporated.   But, wasn't like I was going to touch that money then.  I did nothing to change the strategy I had picked for investing and instead doubled up on my 401k contributions.\n\nBest decision I ever made in regards to my retirement investments -- I came out way ahead because I was able to buy more while everything was recovering.\n\nMy biggest regret over the last year is when COVID hit I was too focused on the disaster itself and neglected to make any real changes to how I was investing to take better advantage of it.  If this continues and goes deeper - don't look at it as a loss if your investing for the long term.  Look at as an opportunity to get more potential long term value out of the money you put in now. \n\nAs a current example - I bought NVIDIA because I believed they have a potential for real growth through the autonomous vehicle industry.  But, yeah stocks down since I invested in it.  Bought more this morning - why?  I **STILL** believe it's going to grow in the next 5-years because of the rise of autonomous vehicles tech.  *It's just on sale now.*",
        "created_utc": 1614887139,
        "id": "gpou1pe",
        "permalink": "/r/StockMarket/comments/lxr1jo/weird_times/gpou1pe/",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1614915939.0
    },
    {
        "author": "Really_Very_Expert",
        "body": "My dick is the size of a grain of rice\n\n$NVDA $500c Mar12",
        "created_utc": 1615331520,
        "id": "gqdwjak",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqdwjak/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615360320.0
    },
    {
        "author": "KingDedeMemes",
        "body": "My Plan:  \n\\- Ride $GME to the Moon   \n\\- $NVDA on super sale for long hold  \n\\- Wait for $AAPL to hit $112 or lower   \n\\- Try my damndest to dollar cost average down on my investments as this shit crumbles to the ground then sit on my fucking hands before I give myself a heart attack.",
        "created_utc": 1615244896,
        "id": "gq9myzz",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9myzz/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615273696.0
    },
    {
        "author": "Upset_Bear",
        "body": "Shrek looks wonderful on NVDA graphics cards",
        "created_utc": 1615327924,
        "id": "gqdp2ii",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqdp2ii/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615356724.0
    },
    {
        "author": "HarbingersRefuge",
        "body": "NVDA too",
        "created_utc": 1614747433,
        "id": "gpi37yg",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi37yg/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614776233.0
    },
    {
        "author": "SwagglesMcNutterFuk",
        "body": "Kramer - buy NVDA it will be great",
        "created_utc": 1615263788,
        "id": "gqal9u1",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqal9u1/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615292588.0
    },
    {
        "author": "BedtimeTorture",
        "body": "*checks notes* ahhh yes, had I held NVDA for an hour longer today I would’ve made another $5000 love it \nOh well that’s why we are here",
        "created_utc": 1615315509,
        "id": "gqcxdyz",
        "permalink": "/r/wallstreetbets/comments/m144ua/daily_discussion_thread_for_march_09_2021/gqcxdyz/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615344309.0
    },
    {
        "author": "ErectHippo",
        "body": "NVDA is a no-brainer under $500",
        "created_utc": 1614890122,
        "id": "gpp14sx",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpp14sx/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614918922.0
    },
    {
        "author": "MidwestMoguhl",
        "body": "NVDA plesss stop",
        "created_utc": 1615223274,
        "id": "gq89tbm",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq89tbm/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615252074.0
    },
    {
        "author": "ozpcmr",
        "body": "bruh the NASDAQ is back to december and NVDA is below the bottom of the September correction.",
        "created_utc": 1615234401,
        "id": "gq900m9",
        "permalink": "/r/stocks/comments/m0cz9v/rstocks_daily_discussion_monday_mar_08_2021/gq900m9/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1615263201.0
    },
    {
        "author": "fgfuyfyuiuy0",
        "body": "NVDA and AAPL are gonna slide all the way. \n\nAMD to but I have calls on that so I dont wanna admit it.",
        "created_utc": 1615237811,
        "id": "gq97way",
        "permalink": "/r/wallstreetbets/comments/m0j7d6/gamestop_stock_is_flying_again_the_transformation/gq97way/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615266611.0
    },
    {
        "author": "MilesOfKings",
        "body": "RIP NVDA",
        "created_utc": 1615242428,
        "id": "gq9i18m",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9i18m/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615271228.0
    },
    {
        "author": "ionized_fallout",
        "body": "March 8 (Reuters) - The Dow climbed on Monday, led by stocks poised to benefit the most from an economic rebound as the $1.9 trillion COVID-19 relief bill awaited a final Congressional vote this week, and heavyweight tech-related stocks swung between gains and losses.\n\nAfter the legislation won U.S. Senate approval on Saturday, President Joe Biden said he hoped for a quick passage of the revised coronavirus relief package by the Democrat-controlled House of Representatives so he could sign it and send $1,400 direct payments to Americans.\n\nProspects of more government spending and faster economic growth have stoked fears of a spike in inflation, sending the benchmark 10-year Treasury yield to near one-year highs.\n\nU.S. Treasury Secretary Janet Yellen, however, said on Monday the package would fuel a \"very strong\" U.S. recovery and she did not expect the economy to run too hot because of the increased spending.\n\nThe Dow hit a new record intraday high and was trading above its Feb. 24 record close. In the S&amp;P 500, the financial sector was the biggest boost, hitting a record as higher interest rates and a steeper yield curve helped banks. Industrials were right behind, also reaching a record high, while the materials sector neared an all-time peak. The technology sector was deepest in the red.\n\n\"This is an ideal traders' market with certain sectors and individual stocks performing better than the wider market, as investors pick and choose individual stocks that will perform better as the economy reopens,\" said Anthony Denier, chief executive officer of trading platform Webull.\n\nA slide in the big tech stocks that have driven the rally in equities since pandemic-induced lows of last March continued, with Apple Inc(AAPL), Nvidia Corp(NVDA), Tesla Inc(TSLA) and Alphabet Inc's(GOOG) Google leading declining shares on Nasdaq.\n\nTech stocks are particularly sensitive to rising yields because their value rests heavily on earnings in the future, which are discounted more deeply when bond returns go up.\n\nThe divergence between the tech stocks and non-tech stocks explains trading today, said Joe Saluzzi, partner and co-founder of Themis Trading in Chatham, New Jersey.\n\n\"The stimulus package will be certainly helping the bigger cap names,\" Saluzzi said, referring to non-tech stocks. \"The get-out and non-stay at home stocks are doing better now,\" he said.\n\nBy 3:09 p.m. ET (2009 GMT), the Dow Jones Industrial Average rose 416.64 points, or 1.32%, to 31,912.94, the S&amp;P 500 lost 3.83 points, or 0.10%, to 3,838.11 and the Nasdaq Composite dropped 259.71 points, or 2.01%, to 12,660.44.\n\nBanks added about 1.7% as the yield on the benchmark 10-year note stood near a 13-month high, while airlines jumped about 5%.\n\nWalt Disney Co (DIS) jumped about 5.8% as California health officials set new rules that would allow Disneyland and other theme parks, stadiums and outdoor entertainment venues to reopen as early as April 1.\n\nGameStop Corp (GME) surged about 33% after the company said it had tapped shareholder Ryan Cohen to lead a transition to an e-commerce business.\n\nAdvancing issues outnumbered declining ones on the NYSE by a 1.68-to-1 ratio; on Nasdaq, a 1.28-to-1 ratio favored advancers.\n\nThe S&amp;P 500 posted 124 new 52-week highs and no new lows; the Nasdaq Composite recorded 390 new highs and 21 new lows.\n\n(Reporting by Herbert Lash in New York, Karen Pierog in Chicago and Medha Singh and Shashank Nayar in Bengaluru; Editing by Shounak Dasgupta and Lisa Shumaker)",
        "created_utc": 1615235598,
        "id": "gq92sor",
        "permalink": "/r/wallstreetbets/comments/m0fpgd/gme_megathread_for_march_08_2021/gq92sor/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615264398.0
    },
    {
        "author": "nintendotyu",
        "body": "I just cannot ignore the deals in $NVDA and $AMD at this time.",
        "created_utc": 1615240616,
        "id": "gq9e62f",
        "permalink": "/r/stocks/comments/m0cz9v/rstocks_daily_discussion_monday_mar_08_2021/gq9e62f/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1615269416.0
    },
    {
        "author": "Srs-Biznes",
        "body": "From my understanding, no. TSMC manufactures, AMD/NVDA designs. This info is also available on the first page of Google results, just so you know",
        "created_utc": 1615231452,
        "id": "gq8t7v1",
        "permalink": "/r/stocks/comments/m0muo6/chip_makers_nvda_vs_amd_vs_tsm/gq8t7v1/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1615260252.0
    },
    {
        "author": "Invincilble",
        "body": "Nvidia can fuck off. So fucking gay",
        "created_utc": 1614779212,
        "id": "gpj6naq",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpj6naq/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614808012.0
    },
    {
        "author": "-Lemony",
        "body": "It's only too late the moment I invest in it. They have trackers on my tail, watching every trade I make. \n\nApple? Dropped like a rock after I put a buy order of 10 of em. Nvidia? How about I fall 5% the moment you finalize your trade. The Dow? How about we drop 300+ points, we saw you checking on it through your mobile app",
        "created_utc": 1614732592,
        "id": "gphbht8",
        "permalink": "/r/stocks/comments/lwf73q/will_rkt_drop_tomorrow_thoughts/gphbht8/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1614761392.0
    },
    {
        "author": "718cs",
        "body": "This dumbass thought he was buying 100k of NVDA calls for next month but was trying to get the trade in quick so I accidentally bought 100k that expire in 2 days.\n\nSold that shit real quick 15 mins later for 118k. Glad I noticed the ex date sooner rather than later.",
        "created_utc": 1614788135,
        "id": "gpjpnjr",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjpnjr/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614816935.0
    },
    {
        "author": "rededreded",
        "body": "So high on NVDA not only for their GPUs. Data center sector and their CUDA programming IMO is huge, on top of those guaranteed sales.",
        "created_utc": 1614809172,
        "id": "gpl2gcx",
        "permalink": "/r/stocks/comments/lx4prb/do_not_panic_sell/gpl2gcx/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1614837972.0
    },
    {
        "author": "Clutch3131",
        "body": "You’re comparing GameStop ($8.6B MC) to Amazon, Apple, Facebook, google, nvidia and amd? Companies that are worth hundreds of billions/trillions of dollars? Lmao. What do you think is easier to manipulate? A company worth $2 trillion or a company worth $8 billion. You sir, are in fact, the retard here.",
        "created_utc": 1614811582,
        "id": "gpl7mll",
        "permalink": "/r/wallstreetbets/comments/lx5p2j/gme_and_citadel_why_the_consolidation/gpl7mll/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614840382.0
    },
    {
        "author": "AllProWomenRespecter",
        "body": "Praying that NVDA can gap up to $512 tomorrow which is *checks notes* what they were trading at at noon today.",
        "created_utc": 1614896878,
        "id": "gppgnat",
        "permalink": "/r/wallstreetbets/comments/lxva6s/what_are_your_moves_tomorrow_march_05_2021/gppgnat/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614925678.0
    },
    {
        "author": "mrchakra7",
        "body": "NVDA down 25% in like 2 weeks and still bleeding",
        "created_utc": 1615234464,
        "id": "gq905vx",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq905vx/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615263264.0
    },
    {
        "author": "AltcoinTraderNy",
        "body": "Nvda ?",
        "created_utc": 1615259030,
        "id": "gqad1m9",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqad1m9/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615287830.0
    },
    {
        "author": "_saucemaster",
        "body": "Nvda is oversold",
        "created_utc": 1615264014,
        "id": "gqaln6t",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqaln6t/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615292814.0
    },
    {
        "author": "fdatbish",
        "body": "NVDA has given me nothing but STRESS these last two weeks",
        "created_utc": 1615264096,
        "id": "gqalrz4",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gqalrz4/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615292896.0
    },
    {
        "author": "MalevolentMinion",
        "body": "I did yesterday.  NVDA, AAPL, MSFT, NNDM, BA, and DIS.  Some LEAPs and some stock.  Wrote CCs on some of my other positions today that are green.",
        "created_utc": 1615325120,
        "id": "gqdiwnv",
        "permalink": "/r/options/comments/m1g3cg/anyone_else_go_on_a_shopping_spree_today/gqdiwnv/",
        "score": 6,
        "subreddit": "options",
        "created": 1615353920.0
    },
    {
        "author": "HarbingersRefuge",
        "body": "NVDA looks poised to spring up tomorrow. Up in AH after falling to form a double bottom today. Normally jumps up bigly after a day this red.",
        "created_utc": 1614750654,
        "id": "gpi7yv3",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi7yv3/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614779454.0
    },
    {
        "author": "HazardousMako",
        "body": "why are semiconductors taking such a massive dump?\n\nlooking at NVDA and AMD... NVDA just broke its 200D MA and the 6 month channel evaporated. it looks like last time it dump and got cut by almost 2/3s\n\nreally think we see NVDA 300?",
        "created_utc": 1615228531,
        "id": "gq8mff7",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8mff7/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615257331.0
    },
    {
        "author": "voneahhh",
        "body": "NVDA @ $552, the pain is real",
        "created_utc": 1615237416,
        "id": "gq96zgc",
        "permalink": "/r/stocks/comments/m0cz9v/rstocks_daily_discussion_monday_mar_08_2021/gq96zgc/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1615266216.0
    },
    {
        "author": "omniron",
        "body": "Shitty but I’ve been here before and I basically know If I sit on this nvidia it will recover. Might take a year or longer though. I’m off the roller coaster for a bit",
        "created_utc": 1615258837,
        "id": "gqacozo",
        "permalink": "/r/wallstreetbets/comments/m0wvvb/nvidia_yolo_gme_put_over_the_past_month/gqacozo/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615287637.0
    },
    {
        "author": "billwaters",
        "body": "If NVDA somehow magically ends up expiring above 492.5 this Friday, mods ban me for a month, for my name aint /u/billwaters",
        "created_utc": 1615238753,
        "id": "gq9a1dp",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9a1dp/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615267553.0
    },
    {
        "author": "CaptMercaptan",
        "body": "As long as they aren't offering $5 for a gently used Nvidia RTX 3080 whilst selling a roughly used one for $200 like the racket they used to pull, I'd say this is a great idea with much promise.\n\nLets be honest.  Its been a fun ride and it looks like things are turning around but there was more reason to short GME than just the waning of brick-and-mortar stores.",
        "created_utc": 1615332391,
        "id": "gqdy8pf",
        "permalink": "/r/wallstreetbets/comments/m1cl9t/nintendo_goes_allin_on_gme_3_new_amiibo_will_be/gqdy8pf/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615361191.0
    },
    {
        "author": "NaNaNaNaNaNaNaNaNa65",
        "body": "Honestly the play is always apple and nvidia",
        "created_utc": 1614741065,
        "id": "gphs08c",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gphs08c/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614769865.0
    },
    {
        "author": "billwaters",
        "body": "I for one welcome our new RKT overlords over GME  \n\n\nalso fuck you NVDA   \n\n\nAMZN 4450c 8/21\n\n(This is financial advice)",
        "created_utc": 1614718945,
        "id": "gpgiy0e",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpgiy0e/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614747745.0
    },
    {
        "author": "NikkiXoLynnn",
        "body": "NVDA for me as well. Almost got them last month but chose other ones instead. NTDOY has to go up with that new game. Put them off last month as well to buy EA and GLUU so I’ll add them now. NFLX and AAPL just because I haven’t gotten around to those two yet. SIX isn’t down and hasn’t been in over a month but they’re doing so well for my simulator that I’m getting FOMO and might toss a bit their way as well. And want to add to my PINS.",
        "created_utc": 1614820111,
        "id": "gplnnxf",
        "permalink": "/r/stocks/comments/lx8dqb/what_are_we_buying_during_this_sale/gplnnxf/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1614848911.0
    },
    {
        "author": "NrdRage",
        "body": "I mean, the chasers (I'm looking at you UWMC, RKT, GME) are fucking themselves, but in a broader market perspective, it's really starting to look like the hedge funds strategy to beat the era of instant information is to simply lean their chipstack in to try and get retail to leave the market and never come back.  Some of this price action the last couple of weeks just defies any semblance of logic.  Companies like $NVDA should be sitting at 600 right now.  There's zero reason why $BE (the most interesting story in the energy space, IMO) goes from 42 to 27 in 2 weeks.  Texas has a once-in-a-generation snowstorm and all of a sudden all the solar plays are dead?  Commodity semis literally can't make their product fast enough and they get hammered. First trillion dollar quarter in history and it sells off, etc.",
        "created_utc": 1614792973,
        "id": "gpk10up",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpk10up/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614821773.0
    },
    {
        "author": "billwaters",
        "body": "NVDA FUCK YOUUUUUU",
        "created_utc": 1614795051,
        "id": "gpk5vu1",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpk5vu1/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614823851.0
    },
    {
        "author": "The_Weekend_DOW",
        "body": "NVDA glitching AH for anyone else...?",
        "created_utc": 1615244147,
        "id": "gq9litr",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9litr/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615272947.0
    },
    {
        "author": "NeverITMalwaysOTM",
        "body": "When everyone’s in fear buy fucking nvda 480 weeklies. Check back in with me Friday. \n\nThat’s my gamble but my actual play is BA 230 month out LFG",
        "created_utc": 1615245512,
        "id": "gq9o5gw",
        "permalink": "/r/wallstreetbets/comments/m0pyf9/what_are_your_moves_tomorrow_march_09_2021/gq9o5gw/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615274312.0
    },
    {
        "author": "MetalliTooL",
        "body": "Some of this tech dump makes no sense.\n\nWhy is NVDA worth less now than in August, when its earnings weren't even close to what they are now?",
        "created_utc": 1615233263,
        "id": "gq8xek6",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8xek6/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615262063.0
    },
    {
        "author": "BedtimeTorture",
        "body": "BREAKING: Hulk himself is said to insert his penis inside each and every new NVIDIA graphics card, use this information as you will\n\n3/12 $500 Calls, because I’m retarded and sold my puts at 470",
        "created_utc": 1615235242,
        "id": "gq91yx2",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq91yx2/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615264042.0
    },
    {
        "author": "al_walid4",
        "body": "The cucked boomers are dumping tech because of muh inflation. WTF even is inflation? Ploughing more money into NVDA",
        "created_utc": 1615234910,
        "id": "gq9171n",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq9171n/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615263710.0
    },
    {
        "author": "evokesins",
        "body": "Anyone have price predictions of NVDA for the rest of the week?",
        "created_utc": 1615343908,
        "id": "gqejxgb",
        "permalink": "/r/wallstreetbets/comments/m1g6cf/what_are_your_moves_tomorrow_march_10_2021/gqejxgb/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615372708.0
    },
    {
        "author": "blindsk02",
        "body": "NVDA getting slaughtered today.....",
        "created_utc": 1615223672,
        "id": "gq8aqmi",
        "permalink": "/r/wallstreetbets/comments/m0dd8m/daily_discussion_thread_for_march_08_2021/gq8aqmi/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615252472.0
    },
    {
        "author": "laetus",
        "body": "What company isn't 'growth and integration into every facet of modern life' at the moment? Every company will claim that. \n\nAnd even if it's true, that doesn't mean the stock has to grow with it (see Amazon stock ~2000).\n\nAlso, NVDA missed earnings estimate. (basically every time)",
        "created_utc": 1614841440,
        "id": "gpmnutt",
        "permalink": "/r/wallstreetbets/comments/lxbssi/just_a_110k_loss_in_less_than_a_month_due_to_nvda/gpmnutt/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614870240.0
    },
    {
        "author": "billwaters",
        "body": "NVDA is the most punished stock in the market right now no cap.   \n\n\nNVDA gang been down bad for a  while :( hang in there fam",
        "created_utc": 1614883859,
        "id": "gpom2nu",
        "permalink": "/r/wallstreetbets/comments/lxi05e/daily_discussion_thread_for_march_04_2021/gpom2nu/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614912659.0
    },
    {
        "author": "DrBoo-T-Hole",
        "body": "Reposting an edited version of someone's list of dots to be connected for MVIS and the imminent BO that is upon us. Not to even mention the SQUEEEEEEEEZE \n\n&amp;#x200B;\n\nMicrovision (MVIS) dots\n\nNo fireside chat after Q4 2020 earnings call\n\nDavid has not been able to directly answer most  investor's questions over email or the phone.\n\n“⁠Best in class LIDAR” used by Sumit during EC. “No competition in any verticals” used by Sumit\n\nSumit has staked his and MVIS entire reputation on Lidar completion in April\n\nSumit can’t contain himself in EC and references the current state of MVIS to the internet boom as a simile for his excitement.\n\nYalon Farhi (the funds that kept MVIS alive) retires. Yalon Farhi hasn’t sold.\n\nDavid Westgor retirement. David Westgor hasn’t sold.\n\n$50M ATM to unknown party finished in very quickly time.\n\nFord announced a stake in VLDR in Q3 2020 and Judy Curran (Ford) joins the Microvision board in Dec,2020.\n\nFord and Google partnership and Microvision add multiple board of directors from these two companies.\n\nFord sold its position in VLDR - Mid feb 2021\n\nSeval Oz joins the board *”I am thrilled to join the MicroVision board of directors at this opportune time. I am excited to bring my expertise and experience in autonomous vehicle technology and mobility to the Company as it develops its automotive lidar technology and explores strategic alternatives.”*\n\nSeval Oz still hasn’t filed a Form 4\n\nBYD posts on LinkedIn “We believe in Microvision” BYD posts again on LinkedIn that we are better than Lumimar\n\n⁠Ever growing new jobs listing for MVIS\n\nJudy Curran is “Head of Automotive Global Strategy” for ANSYS. ANSYS could conduct testing for interested parties to have benchmark data.\n\nMicrovision is not attending CES (Worlds largest AR/MR/VR conference) *hololens is the best selling AR in the world*\n\nState of Michigan has purchased 1 Million SHARES of MVIS *not 1 million worth of MVIS, SHARES* (2/1/21)\n\nBlack rock buys 2.4 million SHARES (2/5/21)\n\nLIDAR sample update in April time frame.\n\nEarnings Call and Annual Share Holder meeting in May. \n\nChris Grayson thinks Niatech (Google owned) has “a confident guess” that they will be using microvision light engines. from [u/s2upid](https://www.reddit.com/u/s2upid/)\n\nIntel awards Hololens 2 a supplier achievement award through a pandemic\n\nMicrovision follows Elon on Twitter (3/30)\n\nShorts are driving MVIS pps down\n\nNobody’s defending the price.\n\nNot even counting patent filings for lasers and scanning devices from MANY interested parties ranging from US to a GLOBAL scale.\n\nTesla crashing causing increase in eyes needing regulation.\n\nMore and MORE FUD across all platforms. The only real argument is that we don’t have a working product that anyone has seen and very little revenue.\n\nMicrosoft wins $22 BILLION contract to supply the US Army with IVAS headsets (based on Hololens 2 which we know for a fact MVIS is in)\n\nForm 8-K is filed where CEO Sumit Sharma agrees to 3 year contract to be compensated with 900,000 shares. \n\nThis is just the tip of everything that is going on and I don't have much foreskin in the game but have about 30 July calls and 500 shares @ $14\n\nP.S. I LOVE THIS STOCK",
        "created_utc": 1618940605,
        "id": "gv862i1",
        "permalink": "/r/wallstreetbets/comments/mugv4v/cramer_it_has_a_gigantic_short_position_avoid/gv862i1/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1618969405.0
    },
    {
        "author": "TrumpFamilySyndicate",
        "body": "I should do some DD on ANSS and ADBE. They've been banging the last month.",
        "created_utc": 1618511428,
        "id": "gumts1g",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/gumts1g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618540228.0
    },
    {
        "author": "SwaggyJ505",
        "body": "They are actually in the process of field testing it via Ansys which is headed up by one of its board members Judy Curran! She was a former executive at Ford for 32 years and she just joined Microvisions board of directors late last year. According to Sharma the initial tests were a success and beyond the expectations of the interested parties. The lidar is based on the same technology that Microsoft uses in their flagship product (Hololens 2)! That's a real and proven product; they are not a joke!",
        "created_utc": 1618917043,
        "id": "gv6t623",
        "permalink": "/r/wallstreetbets/comments/mugv4v/cramer_it_has_a_gigantic_short_position_avoid/gv6t623/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618945843.0
    },
    {
        "author": "Tasteless_Salt",
        "body": "8th semester mechanical engineering student here. I use both AutoCAD (2d drawings) and Inventor (3D drawings, analysis) daily.\n\nAutoCAD is terrible, and i only use it because it can make nice technical drawings for reports. Everything in the software is so awkward and non intuitive. I could honestly not imagine a company, serious about it's spendings, use money on this. Yet it's the industry standard.\n\nInventor is amazing for 3D drawings/ solid models. Very intuitive, can easily read parameters from Excel sheets, and in general very effective at parametric design just works. The FEM (analysis) part is quite over simplified, and the competitor ANSYS does a MUCH better job. \n\nIf I were a company, I would probably not pay to have my engineers use Autodesk software, and thus, would not invest in their stock.",
        "created_utc": 1617568977,
        "id": "gtdsx8g",
        "permalink": "/r/stocks/comments/mjwx90/thoughts_on_autodesk/gtdsx8g/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617597777.0
    },
    {
        "author": "Oscar_O_Connell",
        "body": "I think some sunny DD might do you good. Look up ANSYS and the role that that MVIS will most likely play in every autonomous vehicle manufactured... that’s just one vertical.",
        "created_utc": 1619226231,
        "id": "gvmsmnk",
        "permalink": "/r/RobinHoodPennyStocks/comments/mx3ysr/did_anyone_els_give_up_on_mvis/gvmsmnk/",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1619255031.0
    },
    {
        "author": "kkInkr",
        "body": "ZTS, CDNS, SNPS, ANSS, TER",
        "created_utc": 1618724286,
        "id": "guxwrsz",
        "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/guxwrsz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618753086.0
    },
    {
        "author": "rusbus720",
        "body": "What is this nonsense, she’s speaking on behalf of ansys",
        "created_utc": 1619030165,
        "id": "gvcqwix",
        "permalink": "/r/wallstreetbets/comments/mvcct1/daily_discussion_thread_for_april_21_2021/gvcqwix/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1619058965.0
    }
]