[
    {
        "author": "mcj1ggl3",
        "body": "Well stop doing that. If you’re cognizant of it then you should know that you shouldn’t be spending that much. Sign up for a credit union or open a separate account where the money is a lot harder to get out when you want to spend it. Make a budget for yourself and stick to it because you want to be able to retire and not have to work until you’re 90. Take some responsibility and handle your finances my guy",
        "created_utc": 1614753121,
        "id": "gpib9li",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614781921.0
    },
    {
        "author": "Phil_Major",
        "body": "While I don't choose investments based on ESG concerns or how tingly the investment makes me feel, some people do seem to invest based on tangential considerations, such as ESG concerns. This means we all have to cognizant of them, regardless of whether we personally care about those issues.",
        "created_utc": 1617047735,
        "id": "gsq265w",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1617076535.0
    },
    {
        "author": "Lunchbox1391",
        "body": "Please be cognizant of the rules and present your ideas as you opinion and not financial advise.   \n\nThat being said, I agree that is $CUM a great play for my personal financial goals.",
        "created_utc": 1614898638,
        "id": "gppkcos",
        "score": 2,
        "subreddit": "Wallstreetbetsnew",
        "created": 1614927438.0
    },
    {
        "author": "DogieQueen",
        "body": "Ah... yes, those MF are ruthless...They'll  sell your grandmother if you owned them a penny. ( .01) to cover. Sorry to hear.  Try to be more cognizant. Always leave a little extra in your account in the future.",
        "created_utc": 1615522486,
        "id": "gqnmgjt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615551286.0
    },
    {
        "author": "Cap_Space",
        "body": "Yeah which is why I was celebrating with vodka shots at 9am this morning. Blacked out. I guess it’s where it was this morning technically so I’m good. I would have had a heart attack if I was cognizant",
        "created_utc": 1615406416,
        "id": "gqhiuk1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615435216.0
    },
    {
        "author": "FedPrinter69420",
        "body": "One of us! One of us!  Seriously though, none of us care what race you are or what you believe in, we are all here just for tendies. All are welcome and were happy to have you here. These posts are just to garner hate for the sub, but look at my username. Sure I could be a white cis male, or I could be a fucking platypus who is cognizant of financial markets and goes to trade on the Cincinnati zoo computers when the zookeepers arent looking. No one knows. \n\n&amp;#x200B;\n\nSeriously though, if any of you are in Cincinnati and happen to see the platypus exhibit at the zoo, drop some chicken tenders into those guys. they are super cool.",
        "created_utc": 1615128693,
        "id": "gq3n488",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615157493.0
    },
    {
        "author": "Cakeflying",
        "body": "I hope he is cognizant of that because it was his crime bill who sent them there. He is a racist through and through imo but I think he has a unique opportunity to right the wrong and redeem himself.",
        "created_utc": 1615431149,
        "id": "gqixr0w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615459949.0
    },
    {
        "author": "earnyourwings97",
        "body": "If you even just live in America or any first world country, you’re already incredibly privileged compared to the rest of the worlds population, regardless of your social class. \n\nPeople aren’t grateful enough for their privilege, but at the same time I think that’s just human nature. You’re not going to be cognizant of every advantage you have at all moments because your perception of things is relative to your experiences.",
        "created_utc": 1614724871,
        "id": "gpgw6uq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614753671.0
    },
    {
        "author": "helloretrograde",
        "body": "Good to be cognizant of this even if not day trading",
        "created_utc": 1616958219,
        "id": "gslvyt1",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1616987019.0
    },
    {
        "author": "AgnosTheBread",
        "body": "I wont claim to have any knowledge of $EEENF, but I think the other half of your question is a good one. \n\nMy experience from the beginning has been that selling in the red is perfectly fine, with two caveats: \n\n[one] that you're going to reinvest the money somehow (whether by buying into other positions, or by betting against the market and either throwing it into bonds for a while, or sitting out until green comes back, overall, etc), \n\nand [two], you're absolutely cognizant of wash sales. \n\nIf I sell at a loss, I dont touch the company I sold until my timeout is over, and I make decisions keeping in mind that a temporary lockout may cost me opportunities for gains in the short term future. \n\nAt the end of the day, realizing your losses is like any other form of gambling; you dont need to convince yourself to chase bad money with good, and you certainly dont need to fixate on making your loss back, when you can instead use whatever you have (or have left, as it were) to try to gain elsewhere. Nothing wrong with selling at a loss and dodging future losses, if that's where you find yourself.",
        "created_utc": 1617087992,
        "id": "gsrz8wm",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1617116792.0
    },
    {
        "author": "Soap7627",
        "body": "with the exclusion of Facebook. For the AI dept yes, as a moderator you get treated terribly.   \nSee\n\n[h](https://www.vice.com/en/article/z3beea/facebook-moderators-lawsuit-ptsd-trauma-tracking-bathroom-breaks)[ttps://www.vice.com/en/article/z3beea/facebook-moderators-lawsuit-ptsd-trauma-tracking-bathroom-breaks](https://www.vice.com/en/article/z3beea/facebook-moderators-lawsuit-ptsd-trauma-tracking-bathroom-breaks)\n\nSee  \n[https://www.vice.com/en/article/a35xk5/facebook-moderators-are-suing-for-trauma-ptsd](https://www.vice.com/en/article/a35xk5/facebook-moderators-are-suing-for-trauma-ptsd)\n\nSee   \n[https://www.theverge.com/2019/2/25/18229714/cognizant-facebook-content-moderator-interviews-trauma-working-conditions-arizona](https://www.theverge.com/2019/2/25/18229714/cognizant-facebook-content-moderator-interviews-trauma-working-conditions-arizona)",
        "created_utc": 1617224481,
        "id": "gsyht60",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617253281.0
    },
    {
        "author": "Lund26",
        "body": "I think the importance of whale participation is dwarfed by how incredibly cognizant of the situation and of his own power that Ryan Cohen is. The whales will come",
        "created_utc": 1615933451,
        "id": "gr6a2fs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615962251.0
    },
    {
        "author": "ScreechPower",
        "body": "I’m reading the comments and a lot of people are angry. Why? Retail was never the one causing these huge gains/sell offs mid-day. People don’t have that type of capital. People are just along for the ride. \n\nHe’s right about the spike (buy), dip (crazy sell off), coast (retail doing whatever the fuck). It has been rinse/repeat daily for a while. I’m holding, but I’m also cognizant that no one knows the play for the investors. \n\nI appreciate some DD that doesn’t confirm my bias. Sub need more to help everyone make educated decisions and not just blindly follow - that’s how you will get burned. A ton of people here are new to the market and jumped on with GME and are very emotional/protective of a stock. Please watch out or  you will get burned. I’m rooting for you all.",
        "created_utc": 1615262439,
        "id": "gqaj1xm",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1615291239.0
    },
    {
        "author": "conti555",
        "body": "I think people are taking the DCF valuation theory too seriously. Thinking back to 2018, AMD, Nvidia, Google etc were all soaring despite the 10 year treasury reaching over 3%. What percentage of the market values companies purely in DCF anyway?\n\nI think this is more a broader correction around fears that the Fed will not live up to it's word on 'average inflation targeting' and will have to raise rates sooner and quicker than normal. I personally can't see this happening, as the Fed has shown itself to be extremely dovish and is trying to recover the real economy first (jobs ans solvency issues). \n\nThere is also the huge debt problem they now have from all the money printing they've done, the easiest way for them to solve that is to inflate it away as quickly as possible, so long term high inflation seems like something they would try for. I can't see the USA going into any kind of austerity to pay it off.",
        "created_utc": 1614894009,
        "id": "gppa9gs",
        "score": 49,
        "subreddit": "investing",
        "created": 1614922809.0
    },
    {
        "author": "RandomlyGenerateIt",
        "body": "That better be true, because I bought a bunch of AAPL/AMD/NVDA on margin on that first \"dip\", and now it doesn't feel so much like \"free money\" anymore...",
        "created_utc": 1614811378,
        "id": "gpl776l",
        "score": 46,
        "subreddit": "stocks",
        "created": 1614840178.0
    },
    {
        "author": "billwaters",
        "body": " \n\nPositions: [https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o\\_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing](https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing) (not updated for today's shit performance)\n\nBeen doing exclusively put credit spreads since November, NVDA helped me get up to $144k gain, which is now all but wiped away from NVDA and TSLA in the last two weeks. GUH",
        "created_utc": 1614829809,
        "id": "gpm6lm3",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614858609.0
    },
    {
        "author": "theredmage333",
        "body": "I keep buying nvda on the big dips, no reason for them to be down",
        "created_utc": 1614829584,
        "id": "gpm67d3",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614858384.0
    },
    {
        "author": "No-Pay3755",
        "body": "What are you holding? In the long run stonks go up. I’ve had plenty of companies that I wish I held on to but sold for small gains. NVDA at $9 that I sold in the $20’s 200 shares of AMD that I couldn’t wait to unload at $5.25 only to see it rip. 365 shares of AAPL at $65 that split many times since I sold it. I would have had 10,000+ shares by now but I sold at $85. I would have done better if I didn’t login at all sometimes. Hang tight. They will turn around. If you have to sell, just sell enough so you can sleep at night.",
        "created_utc": 1614802064,
        "id": "gpkm4mo",
        "score": 25,
        "subreddit": "stocks",
        "created": 1614830864.0
    },
    {
        "author": "billwaters",
        "body": "Positions: [https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o\\_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing](https://docs.google.com/spreadsheets/d/181NsEF1W0c0nNjhS5o_v6PnOvTnpLwUnZgOwCP-1flE/edit?usp=sharing) (not updated for today's shit performance)\n\nBeen doing exclusively put credit spreads since November, NVDA helped me get up to $144k gain, which is now all but wiped away from NVDA and TSLA in the last two weeks. GUH",
        "created_utc": 1614829432,
        "id": "gpm5xan",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1614858232.0
    },
    {
        "author": "calamitymic",
        "body": "Current gen ryzen chips are touted to be better than current gen intel. GPU game is gaining on nvidia. Ai software starting to utilize amd gpu. I think they are ready to take more market share. \n\nHaven’t bought the dip but I’m waiting for slight buying pressure. Then, I’m gonna go in dry as fuck because I need them to feel pain when I insert myself.\n\nTLDR: I’m bull dick bullish on AMD",
        "created_utc": 1614866733,
        "id": "gpnj8yg",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614895533.0
    },
    {
        "author": "RipInPepz",
        "body": "Selling my rtx3080 today to buy 10 more shares. Gt1030 here I come. I like the stock. Fuck you nvidia.",
        "created_utc": 1615218505,
        "id": "gq7yk32",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1615247305.0
    },
    {
        "author": "al_walid4",
        "body": "Nvidia literally can't produce enough to keep up with demand\n\nClearly that means the stock must tank by over 20%",
        "created_utc": 1615234527,
        "id": "gq90b4i",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1615263327.0
    },
    {
        "author": "BryGuyTI",
        "body": "TSLA, NVDA, and ARKK have been fucking me so hard.",
        "created_utc": 1615237694,
        "id": "gq97mjz",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1615266494.0
    },
    {
        "author": "captainstrange94",
        "body": "Lol bro companies like amd, nvidia, amzn have lost gains going back to july 2020.",
        "created_utc": 1615234617,
        "id": "gq90isn",
        "score": 14,
        "subreddit": "stocks",
        "created": 1615263417.0
    },
    {
        "author": "Krios625",
        "body": "Also invested in semiconductors with SMH, don't worry about anything serious. AMD and Nvidia had incredible quarters and their stock dropped, so it's more of an irrational market. Never forget that the stock market rewards the patient",
        "created_utc": 1614801066,
        "id": "gpkju1i",
        "score": 13,
        "subreddit": "stocks",
        "created": 1614829866.0
    },
    {
        "author": "AllProWomenRespecter",
        "body": "Looks like this week is the one that I finally am fully BTFO\n\nLearn from me boys. Don't buy calls on companies that are actually fundamentally sound and report flawless earnings with huge current catalysts like NVDA.\n\nBuy calls on an ancient mortgage originator with a huge market cap and no growth potential instead.",
        "created_utc": 1614718387,
        "id": "gpghln9",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614747187.0
    },
    {
        "author": "reginaldvs",
        "body": "I'm honestly shocked AMD is falling. I built my first AMD PC last year and Ryzen is killing it. Not to mention, their Radeon division is competitive with NVIDIA. But anyways, Is it because of the chip shortage? Who knows.",
        "created_utc": 1614824970,
        "id": "gplx68v",
        "score": 13,
        "subreddit": "options",
        "created": 1614853770.0
    },
    {
        "author": "blastoff__",
        "body": "$NVDA is going to make people rich at this price. Their earnings were unbelievable, it’s only a matter of time before the acquisition of Arm Holdings goes through, and at that point they’ll have chips in 90% of the products we use daily. Not to mention EV’s &amp; crypto are in their future. I will say I’m in for a few shares at $580 so maybe not my smartest move, but I’m happy holding for the next 10 years.",
        "created_utc": 1614790335,
        "id": "gpjutlx",
        "score": 12,
        "subreddit": "stocks",
        "created": 1614819135.0
    },
    {
        "author": "areweinnarnia",
        "body": "do it! over the years I've just invested in stuff I like from companies I believed in - Jack in the box after I had their dollar tacos for the first time, AMD and Nvidia when I did my first pc build, Nintendo in the Wii U era when everyone thought the Wii U was shit and that a mobile game catching pokemon would never work.  \nMy only regret is that I didn't have more then a couple hundred in each of them.",
        "created_utc": 1615243926,
        "id": "gq9l32v",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615272726.0
    },
    {
        "author": "FearlessTrader",
        "body": "NVDA basically wiped out 6 months of its gains. 😒😒😒",
        "created_utc": 1615227442,
        "id": "gq8jvow",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615256242.0
    },
    {
        "author": "maxkingusa",
        "body": "So basically Cathie said... if you liked these stocks 2 months ago, you should looooove them today.  She sees bigger gains now that they had these drops.  On one hand you want to puke up your lunch but on the other hand.... we should want this drop in tech and the chance to buy back the key growth companies.  \n\nI bought AAPL, NVDA, AMD, AVGO, XLE and DB (to add some more financials and energy to my portfolio).  This keeps me balanced and I can wait out the pain that tech is providing.  \n\nMy biggest gains that I have held are from VIAC, SBUX, HP, JPM, STOR, LUMN, SPY, and a host of others.\n\nLet's see if adding to tech this week will pay off.",
        "created_utc": 1615237290,
        "id": "gq96pxs",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615266090.0
    },
    {
        "author": "RobotBrunch",
        "body": "AMD SOXL NVIDIA\n\nAll great stocks to own",
        "created_utc": 1614820835,
        "id": "gployh1",
        "score": 11,
        "subreddit": "stocks",
        "created": 1614849635.0
    },
    {
        "author": "RTRC",
        "body": "Today alone has wiped out a year worth of losses. Last year lost money on Spy puts when they pumped up the market with fake cash. GME gets to $300 and i'll also get back the money I lost on Nvidia puts in 2018. Had calls during the RTX 2000 series launch and switched to puts because I knew the new series was garbage. But my calls expired a week too early and I lost it all.",
        "created_utc": 1615224539,
        "id": "gq8ct0g",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1615253339.0
    },
    {
        "author": "Much_Butterscotch279",
        "body": "HERE WE GO PPL!!!! FUCK APPLE AND FUCK NVDA.. I LOVE GME",
        "created_utc": 1615220559,
        "id": "gq83bxp",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1615249359.0
    },
    {
        "author": "HaHawk",
        "body": "Exclusive advanced stock ratings from [Investing.com](https://Investing.com):\n\nApple: Strong Sell.\n\nAlphabet: Strong Sell.\n\nTesla: Strong Sell.\n\n[Amazon.com](https://Amazon.com): Strong Sell.\n\nFacebook: Strong Sell.\n\nNVIDIA: Strong Sell.\n\nThank you [investing.com](https://investing.com), very cool!",
        "created_utc": 1614827097,
        "id": "gpm1fpe",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614855897.0
    },
    {
        "author": "soonseen",
        "body": "Jim cramer. Buy nvda. \n\nRetail. Ok.\n\nNvda. Down 7 percent.",
        "created_utc": 1614791993,
        "id": "gpjypyg",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614820793.0
    },
    {
        "author": "FearlessTrader",
        "body": "Chip demand keeps on going up, NVDA? Back to August 2020 levels. This is some bullshit 😒😒😒",
        "created_utc": 1615257826,
        "id": "gqaav7p",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615286626.0
    },
    {
        "author": "gerjerb",
        "body": "I’m not doing anything, we’ve seen an epic melt up in commodities and bonds. \n\n\nWe’re seeing real numbers for unemployment and the consequences of the covid shutdown and now the Texas deep freeze. \n\n\nNow it’s time for some insanity because algorithms are going to go crazy because we’re coming up on the anniversary of the covid crash from last year. \n\n\nThat being said: put your mouth guard in, strap into your seat, get ready for liftoff, and hope you don’t die of stroke on the way up.\n\n\nTSLA 720c 3/19\n\nAAPL 145c 4/16\n\nNVDA 600c 4/16\n\nAmd 100c 4/16\n\nPltr 35c 4/16\n\nTsla 1000c 5/21\n\nAbnb 250c 5/21\n\n\nThe chip hyper cycle is coming and EV and autonomous driving hype is consolidating into the real player in that space, Tesla. \n\n\nBut if y’all are scared, just buy $ARKK.",
        "created_utc": 1614865256,
        "id": "gpnggd1",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614894056.0
    },
    {
        "author": "kaibasean",
        "body": "Nvidia is about to break the 500 barrier.\n\nAMD nearly at 79.\n\nWhat the fuck.",
        "created_utc": 1614850773,
        "id": "gpmxxk2",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614879573.0
    },
    {
        "author": "Dismiss",
        "body": "NVDA literally cannot produce GPUs fast enough to keep up with demand. This means that it must go -26% in 3 weeks.",
        "created_utc": 1615234417,
        "id": "gq901z6",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615263217.0
    },
    {
        "author": "kemar7856",
        "body": "Cathy lost it sells nvda to buy pltr",
        "created_utc": 1614818319,
        "id": "gplkr22",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614847119.0
    },
    {
        "author": "RPMayhem",
        "body": "GameStop should buy nvidia if these trends hold much longer",
        "created_utc": 1615257692,
        "id": "gqaamkf",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615286492.0
    },
    {
        "author": "wrb3",
        "body": "$700 price target for NVDA by several analysts. Is that  realistic?",
        "created_utc": 1614839611,
        "id": "gpmln2e",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614868411.0
    },
    {
        "author": "soonseen",
        "body": "Quick!\n\n Let me sell my nvda and tesla for wd40 and sport clips!\n\n-facepalm-",
        "created_utc": 1614830626,
        "id": "gpm8215",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614859426.0
    },
    {
        "author": "siebren014",
        "body": "+ they work together with Nvidia on their technology, are going to Europe in the near future and have laid some big fundamentals lately for smooth growth",
        "created_utc": 1615246483,
        "id": "gq9pza6",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615275283.0
    },
    {
        "author": "goldcakes",
        "body": "Intel: 5.86B net income, 250B valuation.\n\nNvidia: 1.46B net income, 317B valuation.\n\nIntel is staging a turnaround and can easily become a growth play in the next 2-4 years, with the new technical CEO. As a PC parts enthusiast, they are already stepping up cadences and launching competitive lineups that are actually in stock, because they are being produced much more than TSMC's bottlenecked's fabs.\n\nThey are the company to watch.",
        "created_utc": 1614868663,
        "id": "gpnn1je",
        "score": 8,
        "subreddit": "investing",
        "created": 1614897463.0
    },
    {
        "author": "BlaCkPeZuS",
        "body": "Comparable to apple, nvidia and square. Sure brah",
        "created_utc": 1615248935,
        "id": "gq9umgb",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615277735.0
    },
    {
        "author": "ThrallDoomhammer",
        "body": "Nvidia less than 500 is a huge buy and will mark the start of the tech rally again.  You heard it here first",
        "created_utc": 1614811401,
        "id": "gpl78ud",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614840201.0
    },
    {
        "author": "billwaters",
        "body": "I sold these when NVDA was at 565 a week ago, though it couldn't go tits up lmao",
        "created_utc": 1614831781,
        "id": "gpma3e3",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614860581.0
    },
    {
        "author": "siberianmi",
        "body": "As long as it's money you don't need now be patient, keep investing.\n\nWhen the crash came in 2007-2008 I was only a year or two into seriously investing into my retirement account.  That end of year statement was a bit of a \"Guh\" moment since everything I had earned plus some basically had evaporated.   But, wasn't like I was going to touch that money then.  I did nothing to change the strategy I had picked for investing and instead doubled up on my 401k contributions.\n\nBest decision I ever made in regards to my retirement investments -- I came out way ahead because I was able to buy more while everything was recovering.\n\nMy biggest regret over the last year is when COVID hit I was too focused on the disaster itself and neglected to make any real changes to how I was investing to take better advantage of it.  If this continues and goes deeper - don't look at it as a loss if your investing for the long term.  Look at as an opportunity to get more potential long term value out of the money you put in now. \n\nAs a current example - I bought NVIDIA because I believed they have a potential for real growth through the autonomous vehicle industry.  But, yeah stocks down since I invested in it.  Bought more this morning - why?  I **STILL** believe it's going to grow in the next 5-years because of the rise of autonomous vehicles tech.  *It's just on sale now.*",
        "created_utc": 1614887139,
        "id": "gpou1pe",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1614915939.0
    },
    {
        "author": "KingDedeMemes",
        "body": "My Plan:  \n\\- Ride $GME to the Moon   \n\\- $NVDA on super sale for long hold  \n\\- Wait for $AAPL to hit $112 or lower   \n\\- Try my damndest to dollar cost average down on my investments as this shit crumbles to the ground then sit on my fucking hands before I give myself a heart attack.",
        "created_utc": 1615244896,
        "id": "gq9myzz",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615273696.0
    },
    {
        "author": "HarbingersRefuge",
        "body": "NVDA too",
        "created_utc": 1614747433,
        "id": "gpi37yg",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1614776233.0
    },
    {
        "author": "ErectHippo",
        "body": "NVDA is a no-brainer under $500",
        "created_utc": 1614890122,
        "id": "gpp14sx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614918922.0
    },
    {
        "author": "MidwestMoguhl",
        "body": "NVDA plesss stop",
        "created_utc": 1615223274,
        "id": "gq89tbm",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615252074.0
    },
    {
        "author": "ozpcmr",
        "body": "bruh the NASDAQ is back to december and NVDA is below the bottom of the September correction.",
        "created_utc": 1615234401,
        "id": "gq900m9",
        "score": 7,
        "subreddit": "stocks",
        "created": 1615263201.0
    },
    {
        "author": "fgfuyfyuiuy0",
        "body": "NVDA and AAPL are gonna slide all the way. \n\nAMD to but I have calls on that so I dont wanna admit it.",
        "created_utc": 1615237811,
        "id": "gq97way",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615266611.0
    },
    {
        "author": "MilesOfKings",
        "body": "RIP NVDA",
        "created_utc": 1615242428,
        "id": "gq9i18m",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615271228.0
    },
    {
        "author": "ionized_fallout",
        "body": "March 8 (Reuters) - The Dow climbed on Monday, led by stocks poised to benefit the most from an economic rebound as the $1.9 trillion COVID-19 relief bill awaited a final Congressional vote this week, and heavyweight tech-related stocks swung between gains and losses.\n\nAfter the legislation won U.S. Senate approval on Saturday, President Joe Biden said he hoped for a quick passage of the revised coronavirus relief package by the Democrat-controlled House of Representatives so he could sign it and send $1,400 direct payments to Americans.\n\nProspects of more government spending and faster economic growth have stoked fears of a spike in inflation, sending the benchmark 10-year Treasury yield to near one-year highs.\n\nU.S. Treasury Secretary Janet Yellen, however, said on Monday the package would fuel a \"very strong\" U.S. recovery and she did not expect the economy to run too hot because of the increased spending.\n\nThe Dow hit a new record intraday high and was trading above its Feb. 24 record close. In the S&amp;P 500, the financial sector was the biggest boost, hitting a record as higher interest rates and a steeper yield curve helped banks. Industrials were right behind, also reaching a record high, while the materials sector neared an all-time peak. The technology sector was deepest in the red.\n\n\"This is an ideal traders' market with certain sectors and individual stocks performing better than the wider market, as investors pick and choose individual stocks that will perform better as the economy reopens,\" said Anthony Denier, chief executive officer of trading platform Webull.\n\nA slide in the big tech stocks that have driven the rally in equities since pandemic-induced lows of last March continued, with Apple Inc(AAPL), Nvidia Corp(NVDA), Tesla Inc(TSLA) and Alphabet Inc's(GOOG) Google leading declining shares on Nasdaq.\n\nTech stocks are particularly sensitive to rising yields because their value rests heavily on earnings in the future, which are discounted more deeply when bond returns go up.\n\nThe divergence between the tech stocks and non-tech stocks explains trading today, said Joe Saluzzi, partner and co-founder of Themis Trading in Chatham, New Jersey.\n\n\"The stimulus package will be certainly helping the bigger cap names,\" Saluzzi said, referring to non-tech stocks. \"The get-out and non-stay at home stocks are doing better now,\" he said.\n\nBy 3:09 p.m. ET (2009 GMT), the Dow Jones Industrial Average rose 416.64 points, or 1.32%, to 31,912.94, the S&amp;P 500 lost 3.83 points, or 0.10%, to 3,838.11 and the Nasdaq Composite dropped 259.71 points, or 2.01%, to 12,660.44.\n\nBanks added about 1.7% as the yield on the benchmark 10-year note stood near a 13-month high, while airlines jumped about 5%.\n\nWalt Disney Co (DIS) jumped about 5.8% as California health officials set new rules that would allow Disneyland and other theme parks, stadiums and outdoor entertainment venues to reopen as early as April 1.\n\nGameStop Corp (GME) surged about 33% after the company said it had tapped shareholder Ryan Cohen to lead a transition to an e-commerce business.\n\nAdvancing issues outnumbered declining ones on the NYSE by a 1.68-to-1 ratio; on Nasdaq, a 1.28-to-1 ratio favored advancers.\n\nThe S&amp;P 500 posted 124 new 52-week highs and no new lows; the Nasdaq Composite recorded 390 new highs and 21 new lows.\n\n(Reporting by Herbert Lash in New York, Karen Pierog in Chicago and Medha Singh and Shashank Nayar in Bengaluru; Editing by Shounak Dasgupta and Lisa Shumaker)",
        "created_utc": 1615235598,
        "id": "gq92sor",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615264398.0
    },
    {
        "author": "nintendotyu",
        "body": "I just cannot ignore the deals in $NVDA and $AMD at this time.",
        "created_utc": 1615240616,
        "id": "gq9e62f",
        "score": 7,
        "subreddit": "stocks",
        "created": 1615269416.0
    },
    {
        "author": "Srs-Biznes",
        "body": "From my understanding, no. TSMC manufactures, AMD/NVDA designs. This info is also available on the first page of Google results, just so you know",
        "created_utc": 1615231452,
        "id": "gq8t7v1",
        "score": 7,
        "subreddit": "stocks",
        "created": 1615260252.0
    },
    {
        "author": "Invincilble",
        "body": "Nvidia can fuck off. So fucking gay",
        "created_utc": 1614779212,
        "id": "gpj6naq",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1614808012.0
    },
    {
        "author": "-Lemony",
        "body": "It's only too late the moment I invest in it. They have trackers on my tail, watching every trade I make. \n\nApple? Dropped like a rock after I put a buy order of 10 of em. Nvidia? How about I fall 5% the moment you finalize your trade. The Dow? How about we drop 300+ points, we saw you checking on it through your mobile app",
        "created_utc": 1614732592,
        "id": "gphbht8",
        "score": 7,
        "subreddit": "stocks",
        "created": 1614761392.0
    },
    {
        "author": "mrchakra7",
        "body": "NVDA down 25% in like 2 weeks and still bleeding",
        "created_utc": 1615234464,
        "id": "gq905vx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615263264.0
    },
    {
        "author": "AltcoinTraderNy",
        "body": "Nvda ?",
        "created_utc": 1615259030,
        "id": "gqad1m9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615287830.0
    },
    {
        "author": "HarbingersRefuge",
        "body": "NVDA looks poised to spring up tomorrow. Up in AH after falling to form a double bottom today. Normally jumps up bigly after a day this red.",
        "created_utc": 1614750654,
        "id": "gpi7yv3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614779454.0
    },
    {
        "author": "HazardousMako",
        "body": "why are semiconductors taking such a massive dump?\n\nlooking at NVDA and AMD... NVDA just broke its 200D MA and the 6 month channel evaporated. it looks like last time it dump and got cut by almost 2/3s\n\nreally think we see NVDA 300?",
        "created_utc": 1615228531,
        "id": "gq8mff7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615257331.0
    },
    {
        "author": "voneahhh",
        "body": "NVDA @ $552, the pain is real",
        "created_utc": 1615237416,
        "id": "gq96zgc",
        "score": 6,
        "subreddit": "stocks",
        "created": 1615266216.0
    },
    {
        "author": "omniron",
        "body": "Shitty but I’ve been here before and I basically know If I sit on this nvidia it will recover. Might take a year or longer though. I’m off the roller coaster for a bit",
        "created_utc": 1615258837,
        "id": "gqacozo",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615287637.0
    },
    {
        "author": "billwaters",
        "body": "If NVDA somehow magically ends up expiring above 492.5 this Friday, mods ban me for a month, for my name aint /u/billwaters",
        "created_utc": 1615238753,
        "id": "gq9a1dp",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615267553.0
    },
    {
        "author": "NaNaNaNaNaNaNaNaNa65",
        "body": "Honestly the play is always apple and nvidia",
        "created_utc": 1614741065,
        "id": "gphs08c",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614769865.0
    },
    {
        "author": "Prune-Spare",
        "body": "Tomorrow is a broken record. Adding a little more #UAL #CUK and #NVDA if they are red at any point in the day   Nice to see #RKT paying off. Got principal out and now riding all profit.",
        "created_utc": 1614734427,
        "id": "gphf0vx",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614763227.0
    },
    {
        "author": "billwaters",
        "body": "NVDA GUH  \n\n\nDumps when market is green  \nDumps when market is red",
        "created_utc": 1614716995,
        "id": "gpgeao0",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614745795.0
    },
    {
        "author": "billwaters",
        "body": "3 more days of pain and praying NVDA stays above 535 god fucking dammit",
        "created_utc": 1614728126,
        "id": "gph2rzp",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614756926.0
    },
    {
        "author": "notpr1m",
        "body": "Yes. Buy AMD. Better tech than Intel but cheaper than NVIDIA, no fabrication operations because they were losing money on it a few years ago so sold it off to focus on design, which I think gives them more flexibility to adapt to capitalize on any investments that could be coming from the public sector, and they probably aren’t bleeding money from production constraints like the others. Probably the best CEO in the space as well. \n\nI also like Qualcomm a lot for similar reasons, but also because they’re positioned to win big in 5G and will probably do well in the IoT space as well. Much more mature company too with a nice dividend ($.65/share).",
        "created_utc": 1614828778,
        "id": "gpm4pgl",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614857578.0
    },
    {
        "author": "molinasnecktat",
        "body": "Nvda a buy? This looks so juicy",
        "created_utc": 1614868972,
        "id": "gpnnowo",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614897772.0
    },
    {
        "author": "rich01992",
        "body": "NvDa a buy at $494??",
        "created_utc": 1614900498,
        "id": "gppo4fd",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614929298.0
    },
    {
        "author": "stayLegend",
        "body": "Are you telling me that putting my networth into chewy, nvidia, and palantir was a bad idea",
        "created_utc": 1614784631,
        "id": "gpjhq06",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614813431.0
    },
    {
        "author": "italiangreenbeans",
        "body": "It really depends on what happens in the future in terms of new chip sets and cards. The newest Ryzen chips are incredible, in terms of price to performance, and their newest set of graphics cards, while suffering from the same shortage as their only real competition, nVidia, have on par performance specs for 25% less. I've been an Intel/nVidia user since I built my first PC years ago, but in the last few generations of chips and cards, I've always recommended AMD products to my friends looking to build PCs. In fact, if you look on the logicalincrements website, which is a very popular resource for speccing out a new PC, each and every recommended CPU is AMD. They were small, and overlooked in the past, but they are dominating as of late.\n\nLooking at the prices of the stocks, AMD is still less than 1/3 the market cap of NVDA, despite the fact that NVDA only makes GPUs, while AMD makes both CPUs and GPUs. If you look at Intel, they have 2.5x the market cap of AMD, and they only make CPUs.\n\nWith the way AMD's chips have been performing, and the fact that they are outperforming on both isles of the PC gaming industry, I think they'll end up doing very well. A stock price of $250+ is not out of the question imo.",
        "created_utc": 1614800213,
        "id": "gpkhuq3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614829013.0
    },
    {
        "author": "LeoFireGod",
        "body": "God I need $NVDA and $TSLA to have big weeks next week",
        "created_utc": 1614803473,
        "id": "gpkpctn",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614832273.0
    },
    {
        "author": "kaos424",
        "body": "Im 35. Have a small roth ira. I put money in disney, nvidia, Walmart, pinterest, prnt, arkk, vt, msos, qcln, and betz. Getting slaughtered lately. I recognize most of market is red lately but I feel extra red lol. Should I make some adjustments or ride it out?",
        "created_utc": 1614801692,
        "id": "gpklaae",
        "score": 6,
        "subreddit": "investing",
        "created": 1614830492.0
    },
    {
        "author": "Killerslug",
        "body": "It's Nvidia",
        "created_utc": 1615256613,
        "id": "gqa8nog",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615285413.0
    },
    {
        "author": "cartpusherbilly",
        "body": "Wtf is wrong with NVDA I’m pretty sure it’s just waiting for me to sell my dam call.",
        "created_utc": 1614713190,
        "id": "gpg5gcr",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614741990.0
    },
    {
        "author": "RPMayhem",
        "body": "NVDA you bitch",
        "created_utc": 1614785996,
        "id": "gpjkruf",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614814796.0
    },
    {
        "author": "RPMayhem",
        "body": "call me retarded but my 20k on NVDA calls have a good feeling about march",
        "created_utc": 1614753032,
        "id": "gpib5ge",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614781832.0
    },
    {
        "author": "IchBleibZuhause",
        "body": "Buy again bro, that’s an opportunity! The way is clear for Nvidia. \nSome Sektors can be ignored, but Nvidia can’t be.",
        "created_utc": 1614846816,
        "id": "gpmtvl4",
        "score": 5,
        "subreddit": "options",
        "created": 1614875616.0
    },
    {
        "author": "billwaters",
        "body": "What are the odds that I can hold these NVDA 535p I sold that expire on Friday either:\n\na) Expire ITM and don't get assigned\n\nb) Magically expire worthless due to a magical pump from the heavens\n\nc) Requires me to $ROPE",
        "created_utc": 1614826070,
        "id": "gplzf4x",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614854870.0
    },
    {
        "author": "ScrewThisHyundai",
        "body": "Thoughts on NVIDIA? (NVDA)\n\n\nDown almost 6% today, *so far*. 16% since I bought in @ $560...\n\n\nNot sure whether to hold, sell or DCA. Thoughts on why it is dropping so hard?",
        "created_utc": 1615229607,
        "id": "gq8oy0y",
        "score": 5,
        "subreddit": "stocks",
        "created": 1615258407.0
    },
    {
        "author": "Tao-Lee",
        "body": "Picked up 2 x NVDA 500C for 19th, double bottoms are bullish except when they aren’t",
        "created_utc": 1615230685,
        "id": "gq8rgds",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615259485.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "Omg, Nvidia will become extinct 🤡🤡🤡🤡",
        "created_utc": 1615233411,
        "id": "gq8xqzr",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615262211.0
    },
    {
        "author": "DippySwitch",
        "body": "What just happened with Nvidia?",
        "created_utc": 1615243853,
        "id": "gq9kxuo",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615272653.0
    },
    {
        "author": "SaltyKrew",
        "body": "is that green hulk dildo on nvda real?",
        "created_utc": 1615243990,
        "id": "gq9l7mr",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615272790.0
    },
    {
        "author": "tendeeznuts",
        "body": "NVDA gotta be worth some 5-10DTE's soon",
        "created_utc": 1615245404,
        "id": "gq9ny1j",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615274204.0
    },
    {
        "author": "qqeyes",
        "body": "NVDA has decided I'm retiring at 75",
        "created_utc": 1615249545,
        "id": "gq9vrdo",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615278345.0
    },
    {
        "author": "cloudburn24",
        "body": "GOD DAMN, Nvidia out here fuckin DYIN'",
        "created_utc": 1614895764,
        "id": "gppe81u",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614924564.0
    },
    {
        "author": "xobk",
        "body": "Yolo'd nvda calls. No cash left for rope.",
        "created_utc": 1615260572,
        "id": "gqaft0y",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615289372.0
    },
    {
        "author": "littlefiredragon",
        "body": "NVDA looks really juicy right now if you think the chip shortage is temporary. Does anybody remember what happened to them in 2018 that caused their price to plunge over 50%?",
        "created_utc": 1615228198,
        "id": "gq8ln04",
        "score": 5,
        "subreddit": "stocks",
        "created": 1615256998.0
    },
    {
        "author": "mrchakra7",
        "body": "Nvidia down 6% wow!",
        "created_utc": 1615229923,
        "id": "gq8poo6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615258723.0
    },
    {
        "author": "auscontract",
        "body": "I’ve been taking a bath on NVDA also man it’s some unusual price action after earnings that’s to say the least.",
        "created_utc": 1614832446,
        "id": "gpmb7mq",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614861246.0
    },
    {
        "author": "gb2075",
        "body": "I’ve been researching semi-conductors in depth the past few days. \n\nI’m eyeing the big retail guys like INTC, NVDA, AMD (agreed with you that AMD is the most promising).\n\nThe other segment is the fabricators, they don’t sell chips they just produce them for other companies. I’m keeping tabs on AMAT, TSM, LRCX, NXPI, FORM, UMC).\n\nThen finally the rare earth metals.. companies like MP, AMAT, VALE (I was long on these guys then they got a fucking $7B fine for killing 300 people in a dam explosion.... oops).\n\nLook into Biden’s recent executive order, not only does he address the global semiconductor shortage, but plans to bring jobs back to the states and invest in American companies. MP Materials is the only US based company REM company. \n\nThis all looks so obvious as a long term play. I forget where I read it, but the global semiconductor usage is going to 10x or something insane like that in the next 10 years.\n\nI don’t know why all of these companies are down recently, I haven’t looked into it. I bought $10 worth of every stock listed above so I could keep tabs on them. All of them have followed the same negative trajectory the last month or so. If you zoom out to 5 year though, almost every single company shows insane growth. I imagine that growth will only compound long term. Do you have any thoughts on the reason for this recent downward trend? \n\nI’m considering making a pretty massive 5-10 year long play on semiconductors.",
        "created_utc": 1614872359,
        "id": "gpnv7ia",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614901159.0
    },
    {
        "author": "Aspire17",
        "body": "Nvidia looks nice... but don't let me divert your attention from GME",
        "created_utc": 1614764290,
        "id": "gpinozz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614793090.0
    },
    {
        "author": "Master_Relative",
        "body": "Could NVDA have one Green Day?????????",
        "created_utc": 1614782213,
        "id": "gpjchhm",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614811013.0
    },
    {
        "author": "Master_Relative",
        "body": "NVDA $465 EOD",
        "created_utc": 1614878920,
        "id": "gpoaczr",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614907720.0
    },
    {
        "author": "BedtimeTorture",
        "body": "Yeeeaah these SPY puts and NVDA puts are making me hella green despite everything else I own bleeding fast",
        "created_utc": 1614880304,
        "id": "gpodllc",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614909104.0
    },
    {
        "author": "billwaters",
        "body": "NVDA is so agonizing, like just fly already, $600 is where you belong",
        "created_utc": 1614700471,
        "id": "gpfc5k2",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614729271.0
    },
    {
        "author": "InternJedi",
        "body": "Life is bad. But it can be badder.\n\nI remember selling BA at like 199 thinking that yeah it was total toast. But now it's the only thing that has been rising since last week. All my drivers: NVDA, TSLA, AMD all drove themselves straight into a lemon tree.",
        "created_utc": 1614869587,
        "id": "gpnozqg",
        "score": 5,
        "subreddit": "stocks",
        "created": 1614898387.0
    },
    {
        "author": "SteveAM1",
        "body": "&gt; Thinking back to 2018, AMD, Nvidia, Google etc were all soaring despite the 10 year treasury reaching over 3%.\n\nAnd what were the valuations of those compared to today?",
        "created_utc": 1614894174,
        "id": "gppan35",
        "score": 5,
        "subreddit": "investing",
        "created": 1614922974.0
    },
    {
        "author": "Invincilble",
        "body": "Not disagreeing with you here so don’t think I am but Nvidia had pretty good earnings and have had like 1 green day since",
        "created_utc": 1615238183,
        "id": "gq98qu1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615266983.0
    },
    {
        "author": "PowerfulLier",
        "body": "$NVDA $ON $SQ on sale (again and again and again)",
        "created_utc": 1615230500,
        "id": "gq8r0zl",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615259300.0
    },
    {
        "author": "HarbingersRefuge",
        "body": "NVDA",
        "created_utc": 1614752125,
        "id": "gpi9yn2",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614780925.0
    },
    {
        "author": "SmittyJenkins",
        "body": "Both are very undervalued in terms of their market cap - I’m very bullish on both. They’re in their growth phase and will be for a long time. \n\nThe bear case is that Cosair’s niche is very specific and they could face big hurdles if Logitech steps up its game or Nvidia decides it wants to get into the market. \n\nFubo could face mergers by other competitors like we saw between DraftKing and Dish. HOWEVER, the reason why I’m so bullish on Fubo and why this recent dip is a massive buying opportunity is that Dish + DraftKing merger is not even a big threat. Dish is LOSING 100,000+ subscribers quarterly. Why? Because unlike Fubo, it requires satellite (not the future). Also, Verizon has a 7%+ stake in Fubo which gives it a lot of potential partners. Fubo’s financials are getting hit because they’re focusing on spending NOW to grow their customer base as fast as possible during the pandemic. Don’t be too alarmed by their missed earnings and remember, even a behemoth like Amazon was not profitable for a long time.",
        "created_utc": 1615261287,
        "id": "gqah2k3",
        "score": 5,
        "subreddit": "stocks",
        "created": 1615290087.0
    },
    {
        "author": "Bonhomme7h",
        "body": "There is a primal part in my brain that still feel like a kid in a candy store and see these prices as amazing buying opportunities. Until the memory part remind it what appended when we tried to buy the dip 2 weeks ago. And average down last week. Still! Sub 500 NVDA! 🤩",
        "created_utc": 1614895471,
        "id": "gppdkdw",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614924271.0
    },
    {
        "author": "sylphvanas",
        "body": "So every stock I have calls on has the same daily chart the past week: ROKU, NVDA, PYPL, ZM. Only blood red.",
        "created_utc": 1615219618,
        "id": "gq814pj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615248418.0
    },
    {
        "author": "Upset_Bear",
        "body": "NVDA looking tasty",
        "created_utc": 1615220692,
        "id": "gq83mwm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615249492.0
    },
    {
        "author": "Stonker100",
        "body": "PTC Therapeutics should get picked up by ark genomics! Gene therapy about to be approved in may",
        "created_utc": 1614783263,
        "id": "gpjepzv",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1614812063.0
    },
    {
        "author": "OlGreggMare",
        "body": "The layout looks so identical I think I stayed awhile in this neighborhood when tdy to ft carson and hanging with a buddy that lived on that side of town",
        "created_utc": 1615828696,
        "id": "gr16ors",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1615857496.0
    },
    {
        "author": "JustCallMeJp",
        "body": "Tdy",
        "created_utc": 1614711879,
        "id": "gpg2d32",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614740679.0
    },
    {
        "author": "StonksToOuterSpace",
        "body": "I got stock advice from a 14yr old tdy.... this is fine....",
        "created_utc": 1614718078,
        "id": "gpgguvc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614746878.0
    },
    {
        "author": "fatguynextdoor",
        "body": "So where we at GME bois? We buy now or wait until the hearing tdy.\nSay wht time is the hearing? 12 pm?",
        "created_utc": 1615987575,
        "id": "gr8g9t9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1616016375.0
    },
    {
        "author": "kaspersky133",
        "body": "Yday managed to do some work. It seems i wont tdy xd",
        "created_utc": 1615987964,
        "id": "gr8gzrd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1616016764.0
    },
    {
        "author": "gamedevSeattle",
        "body": "Energy - KMI\nbiotech -- Beam\nConstruction -- CX, SND\nTech - TDY\nSemiconductor - txn",
        "created_utc": 1615654961,
        "id": "gqtb12b",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615683761.0
    },
    {
        "author": "fatguynextdoor",
        "body": "Anyone know how its record high yesterday and dipping tdy. I know its inflation, rising bond yield yadi  yadda but why tdy? Options expiry?",
        "created_utc": 1615551383,
        "id": "gqoks7e",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1615580183.0
    },
    {
        "author": "Random9502395023950",
        "body": "Wellllll guaranteed job security so thats dope. TDY opportunities etc. Post 9/11 bill is a crap ton in the BAH alone and you can use TA to knock out a BA and a Masters through AMU.",
        "created_utc": 1615750237,
        "id": "gqxjzwf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615779037.0
    }
]