[
    {
        "author": "k0nfuz1us",
        "body": "his dad is the guy from IBM who said no one needs a personal computer..",
        "created_utc": 1630436091,
        "id": "hb3axnl",
        "permalink": "/r/StockMarket/comments/pf7e51/billionaire_investor_says_crypto_is_worthless_and/hb3axnl/",
        "score": 211,
        "subreddit": "StockMarket",
        "created": 1630464891.0
    },
    {
        "author": "BuddhaStatue",
        "body": "Bruh what.\n\nI've worked in IT for years. Never bought a server from Intel or AMD.\n\nDell, HP, Suprrmicro, IBM, Lenovo, etc sell servers.\n\nHP built El Capitan for the DoE. IBM has built a couple of systems based on their hardware.\n\nThe current fastest system in the world runs ARM https://www.zdnet.com/article/arm-and-linux-take-supercomputer-top500-crown/\n\nCorrect me if I'm wrong here, but when on earth would anyone call Intel when they need server support",
        "created_utc": 1629941749,
        "id": "hadcah9",
        "permalink": "/r/investing/comments/pbmbzk/department_of_energy_will_buy_an_nvidiaamd/hadcah9/",
        "score": 36,
        "subreddit": "investing",
        "created": 1629970549.0
    },
    {
        "author": "[deleted]",
        "body": "Boeing and Intel both have some of the best engineers on the planet, but are run by absolutely incompetent people. I think they'll follow a similar trajectory as IBM, being surpassed by more competitive players in the market as they cling on to a fading legacy while dying a slow death.",
        "created_utc": 1629956873,
        "id": "hae44hz",
        "permalink": "/r/investing/comments/pbmbzk/department_of_energy_will_buy_an_nvidiaamd/hae44hz/",
        "score": 31,
        "subreddit": "investing",
        "created": 1629985673.0
    },
    {
        "author": "OKImHere",
        "body": "The thing about the indicator is it only counts US GDP. That worked in the time of GM and IBM, but it doesn't work when the four biggest companies in the US market make a huge percentage from overseas markets. When China quits buying I phones, when India doesn't use Windows, when Canada doesn't google anything, let me know about that U.S. GDP figure.",
        "created_utc": 1628552462,
        "id": "h8cjmkr",
        "permalink": "/r/ValueInvesting/comments/p199jb/does_the_buffett_indicator_at_214_alltime_high/h8cjmkr/",
        "score": 31,
        "subreddit": "ValueInvesting",
        "created": 1628581262.0
    },
    {
        "author": "Pelopida92",
        "body": "I work in tech and honestly think Cisco has no future. its the next IBM. They had their moment but they are done now. In five years from now they might not even exist anymore. Probably will sell out to some big player.",
        "created_utc": 1628423572,
        "id": "h85sco0",
        "permalink": "/r/stocks/comments/p0aylx/which_stock_currently_well_below_a_1_trillion/h85sco0/",
        "score": 26,
        "subreddit": "stocks",
        "created": 1628452372.0
    },
    {
        "author": "JKM1601",
        "body": "  Lol, you are so right. Buffett's dad was a Congressman, he got his MBA from Columbia, was taught and employed by Benjamin Graham. His personal net worth was 1.5mm (in today's dollars) at the age of 26. At that age, he found ten doctors to invest in his partnership 10k each (this 100k is 1mm in today's money) and pooled it with his own initial investment of $100. In his biographies, people put it, charmingly, as 'starting out with $100 at the age of 26'. \n\n  Lol, gtfo with the selling gum story. He is a brilliant man but the gum was not the starting point. The same goes for Bill Gates, by the way. Check out who his parents were and think about why got the initial contract with IBM at his age.",
        "created_utc": 1628942587,
        "id": "h8wgy4e",
        "permalink": "/r/investing/comments/p42hlg/it_seems_like_we_really_dont_talk_about_the_real/h8wgy4e/",
        "score": 21,
        "subreddit": "investing",
        "created": 1628971387.0
    },
    {
        "author": "introspective79",
        "body": "He means as a % of Microsoft’s revenue. Since Nadella came in as CEO he has massively expanded Microsoft’s cloud offerings (ie Microsoft Azure which is now huge) - from memory Windows now only accounts for 10% of Microsoft’s revenue currently.\n\nIe if every single user in the world decided to switch over to Linux tomorrow, MS revenue/profitability wouldn’t even be that badly hit. A testimony to how good a CEO Nadella has been - especially after MS completely missed the IPod/Iphone/smartphone eras thanks to their previous CEO Steve Ballmer.\n\nFrankly if Nadella hadn’t taken over from Ballmer, Microsoft were in danger of going down the same route of IBM. If you look at how the share price has done since he took over in 2013 it’s pretty insane imho.",
        "created_utc": 1629573333,
        "id": "h9tkzls",
        "permalink": "/r/stocks/comments/p8rc1g/what_are_your_favorite_bear_cases_for_stocks_that/h9tkzls/",
        "score": 20,
        "subreddit": "stocks",
        "created": 1629602133.0
    },
    {
        "author": "Unlucky_Customer_438",
        "body": "Here is the list:\n\nAAPL, ALB, ADP, AA, ADM, AFL, ABT, ABBV, BAC, BAYZF, BHP, BMY, CSCO, CL, C, CB, CLX, CPB, CAH, COST, DG, GILD, GSL, GPC, GIS, GLNCY, EPD, HRB, HRL, HD, HON, HYG, FBHS, FDX, KMB, KSS, IBM, IRM, K, JNJ, INTC, SYY, LEG, LMT, TROW, TAP, TGT, T, TELNF, MCK, MMM, MAR, MO, MRK, MSFT, PRU, ORCL, ORAN, MDT, RBGLY, RIO, RGA, PBA, PETS, PEP, PFE, PPG, PG, XLE, XLU, WBA, WMT, VZ, UL, UNM \n\nMost are common names. Boring. Of course there are several others that may be better candidates than above, I just personally did DD on above. Other tips  are welcome - as I refresh my watch list every now and then. \n\nWith rest of my portfolio - I also trade FAANG and other risky high fliers (the ROKUs of the world). But stay fairly conservative.",
        "created_utc": 1628973572,
        "id": "h8yavsp",
        "permalink": "/r/options/comments/p4er10/2nd_post_on_selling_options_could_it_be_this_easy/h8yavsp/",
        "score": 17,
        "subreddit": "options",
        "created": 1629002372.0
    },
    {
        "author": "10xwannabe",
        "body": "\"My general thoughts is people tend to have short memories in the stock market...\"\n\nFunny as folks advocating for index funds would say the same to support their cause.  There will ALWAYS be some stock that has been on a tear for 10 years.  The question is it likely to continue?  History has shown eventually they lose market cap to other competitors or technologies.  Everyone thought IBM and Blockbuster would be dominate forever. That didn't happen.  History is full of companies that were leaders then were taken over.\n\nIndex funds allows you to own all the future winners albeit the price of holding the losers as well.",
        "created_utc": 1629036576,
        "id": "h91658d",
        "permalink": "/r/stocks/comments/p4pjgb/peoples_thoughts_on_blue_chip_stocks_in_the_past/h91658d/",
        "score": 15,
        "subreddit": "stocks",
        "created": 1629065376.0
    },
    {
        "author": "GlidsSJ",
        "body": "Going to keep going up. MSFT just prints $ by selling for hundreds of dollars licenses of software that costs nothing to produce and protected by IP and branding yet necessary for the functioning of the global economy. It's a great business model. In spite of the best efforts of Apple and Linux, decades later, nothing has come close to replacing it. It's not going to flame out like IBM or GE did. MSFT will remain a market leader for a long time to come.",
        "created_utc": 1629565040,
        "id": "h9t2q7q",
        "permalink": "/r/wallstreetbets/comments/p8s4j3/20k_leaps_gains_from_msft_in_5_months/h9t2q7q/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1629593840.0
    },
    {
        "author": "y_angelov",
        "body": "I'm not sure what you mean by this. Their EV/EBITDA ratio is 10.7. For comparison, IBM (value/dividend stock) has 11.25 and Facebook (growth stock) has an EV/EBITDA of 18.6, Logitech (possibly Corsair's closest competitor) has an EV/EBITDA of 12.66. At the same time, Logitech are expected to experience a drop in earnings next year, whereas Corsair are expected to grow their earnings. \n\nCorsair is definitely undervalued. I guess it depends how you define \"significantly\", but I think Corsair has a high chance of doubling in price. Obviously not tomorrow, but within 12 months.",
        "created_utc": 1628285135,
        "id": "h7zfca1",
        "permalink": "/r/stocks/comments/oz9dpf/dd_corsair_gaming_breaking_down_their_latest/h7zfca1/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1628313935.0
    },
    {
        "author": "ApesTogetherStonk",
        "body": "I will compare Intel to IBM -&gt; decent company that is losing market share to more innovative competitors. On the other hand, with the return of the old management Intel might be able to turn things around in the next years.",
        "created_utc": 1629536532,
        "id": "h9rq5ow",
        "permalink": "/r/ValueInvesting/comments/p8o02l/intel/h9rq5ow/",
        "score": 13,
        "subreddit": "ValueInvesting",
        "created": 1629565332.0
    },
    {
        "author": "dadsmayor",
        "body": "Put MSFT in for IBM",
        "created_utc": 1630245497,
        "id": "hasxly8",
        "permalink": "/r/investing/comments/pdi4g0/what_are_good_buy_and_forget_stocks_if_i_already/hasxly8/",
        "score": 12,
        "subreddit": "investing",
        "created": 1630274297.0
    },
    {
        "author": "PappyGrant",
        "body": "MSFT didn’t magically become what it is today, they were just luckily well positioned to enter the then new industry of cloud computing due to existing enterprise tools and contracts, a competitive advantage over AMZN.\n\nCan Intel enter a new, fast growing industry and become a leader in it? Sure. \n\nIs it likely? No.\n\nINTC reminds me a lot of IBM a decade ago.",
        "created_utc": 1629553256,
        "id": "h9sderd",
        "permalink": "/r/ValueInvesting/comments/p8o02l/intel/h9sderd/",
        "score": 12,
        "subreddit": "ValueInvesting",
        "created": 1629582056.0
    },
    {
        "author": "Vast_Cricket",
        "body": "Not surprised at all.  Law of compound interest over years does amazing things to stocks.\n\nWhen I aunt, a single lady passed away she had 1.5M of PFE, 1.2M of IBM, 800K of XOM, a bunch of utilitty company stocks.  The first two are the only 2 jobs she ever had. She liked dividend paying stocks.",
        "created_utc": 1629678607,
        "id": "h9z3pld",
        "permalink": "/r/investing/comments/p9nhtx/how_many_years_have_you_been_investing_and_why/h9z3pld/",
        "score": 12,
        "subreddit": "investing",
        "created": 1629707407.0
    },
    {
        "author": "Investing8675309",
        "body": "I would pick IBM. I hate IBM with a passion but I think they would be fascinating to do a report on. They keep missing major technology trends and have had a slew of pretty poor CEOs. You’ll not only learn a ton about the tech industry but also management theory on how hard it is for companies to change. Some of their declining but high margin businesses will show up in your analysis and you’ll be able to understand some of the really tough decisions Palmisano/Rometty/Krishna faced around the innovators dilemma. That’s where the cool analysis is!\n\nOtherwise Intel or an oil company would be interesting. Lot of love on this thread for Intel, feel free to DM me later if you picked that, I used to work there and is one of the few industries I know well.",
        "created_utc": 1629855139,
        "id": "ha8lihz",
        "permalink": "/r/ValueInvesting/comments/pax7r1/which_stock_from_the_sp_500_would_you_want_to_do/ha8lihz/",
        "score": 12,
        "subreddit": "ValueInvesting",
        "created": 1629883939.0
    },
    {
        "author": "Rumtumjack",
        "body": "\"But you don't understand1!1 Tesla is so good at research and development.\"\n\nI wonder if they've ever seen the charts where Tesla's R&amp;D development has been pretty close to $1.5 billion for a while. Meanwhile Amazon and apple is almost 20x that. Nearly every big tech player in the US and most Chinese tech are investing 10x what Tesla is into r&amp;d. \n\nTake Baidu for example. Less than tenth of the mark of the market cap of Tesla yet more spent on r&amp;d. Baba is about 60% of Tesla's market cap yet is spending 6 times as much as Tesla.\n\nI'm honestly incredibly impressed with Tesla's marketing. Elon Musk is far more gifted at that than at delivering cars that pass more than the basic QA inspections.\n\nTo answer op: every indication that we'd have would be Amazon or mayyybe a Chinese tech company like Baba (but that is very speculative). \n\nIt's possible that the company doesn't even exist yet. Imagine saying in the 80s that apple would be the biggest company in the world over oil companies and established tech like IBM or Intel.",
        "created_utc": 1629459256,
        "id": "h9neek5",
        "permalink": "/r/investing/comments/p82kmm/what_do_you_think_will_be_the_largest_company_in/h9neek5/",
        "score": 11,
        "subreddit": "investing",
        "created": 1629488056.0
    },
    {
        "author": "Sharcbait",
        "body": "Nice list. I like to add in McDonald's and IBM.",
        "created_utc": 1630209056,
        "id": "harj5yz",
        "permalink": "/r/investing/comments/pdi4g0/what_are_good_buy_and_forget_stocks_if_i_already/harj5yz/",
        "score": 11,
        "subreddit": "investing",
        "created": 1630237856.0
    },
    {
        "author": "ChungusAmungus1",
        "body": "This is the same sector IBM has moved into after researching both. IBM has not been on the cutting edge for decades but they have contracts with the largest retailers in the country to service their cash registers (traditional and self checkouts) which they have a near monopoly on. That's one big aspect of service and consulting that provides nearly half of IBMs business revenue.",
        "created_utc": 1629941172,
        "id": "hadb03j",
        "permalink": "/r/investing/comments/pbmbzk/department_of_energy_will_buy_an_nvidiaamd/hadb03j/",
        "score": 10,
        "subreddit": "investing",
        "created": 1629969972.0
    },
    {
        "author": "Useful-ldiot",
        "body": "I wouldn't include ibm unless they do a major pivot. They've been trending down hard for about a decade now.",
        "created_utc": 1630237176,
        "id": "hasj7rl",
        "permalink": "/r/investing/comments/pdi4g0/what_are_good_buy_and_forget_stocks_if_i_already/hasj7rl/",
        "score": 10,
        "subreddit": "investing",
        "created": 1630265976.0
    },
    {
        "author": "ForGreatDoge",
        "body": "You should read up on the history of IBM",
        "created_utc": 1628489958,
        "id": "h89alsw",
        "permalink": "/r/investing/comments/p0r3o4/time_to_take_aapl_gains_and_gtfo/h89alsw/",
        "score": 9,
        "subreddit": "investing",
        "created": 1628518758.0
    },
    {
        "author": "benmanns",
        "body": "I appreciate some competition in the space. Some notes:\n\n* [https://rest.uselantern.com/api-tiers](https://rest.uselantern.com/api-tiers) is returning a 500 so nobody can see pricing. I was able to sign up for a free account.\n* Your \"Option Prices Stream\" documentation example has a typo, domain name \"uselanern dot com\" instead of \"uselantern.com\" -- could cause someone to send API credentials to the wrong domain. It would have happened to me if someone had registered it.\n* Some API docs query for IBM, but the example responses are for AMZN. Not a huge deal.\n* On the free tier, it looks like REST data is at least a day delayed, and only streaming available in 5 second increments. Docs do mention \"contact us if you want access to tick level stream\"\n* API response is a little weird. Prices for options come back as floats, e.g. `{\"ask\":2.7799999713897705,\"bid\":2.609999895095825, ...` which is a little odd. Of course I can chop off or round the 999s when storing as a decimal number, but I think it'd be better to receive as a decimal in the first place. Options can't trade in sub-penny increments afaik, and certainly aren't quoted in nanopennies.\n* Running the example option stream API, I get an error \"`&lt; 'NoneType' object has no attribute 'split'`\", so I can't test it",
        "created_utc": 1630420699,
        "id": "hb28z6b",
        "permalink": "/r/options/comments/pf4jw0/some_of_the_best_options_apis_that_you_can/hb28z6b/",
        "score": 9,
        "subreddit": "options",
        "created": 1630449499.0
    },
    {
        "author": "indigoismyfavorite",
        "body": "We think we have what you need\n\n*That's a start*\n\nNow, we know that IBM has set up this place to compete head-on with Apple... \n\n...and you're gearing up to come out with a personal computer that will wipe them out\n\nSo we can get you an operating system\n\n*What kind of operating system?*\n\nIt's called... \n\n...DOS",
        "created_utc": 1630452133,
        "id": "hb4chf9",
        "permalink": "/r/wallstreetbets/comments/pdrwfn/fraternal_association_of_gambling_gentlemen_and/hb4chf9/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630480933.0
    },
    {
        "author": "donnyjay23",
        "body": "PLTR, is more than a meme stock. It’s the future. It’s customers are US military, CIA, IBM, Amazon, and airbus. Data mining, AI predictive software for the future… Will be a slow grind to 100x plus, but I’m here for the ride 🚀",
        "created_utc": 1628796567,
        "id": "h8owvui",
        "permalink": "/r/wallstreetbets/comments/p2ydw5/daily_popular_tickers_thread_for_august_12_2021/h8owvui/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1628825367.0
    },
    {
        "author": "Rumtumjack",
        "body": "Confused as to where your info is coming from as IBM has made a profit every quarter for like 15 years straight. \n\nThere is also some speculation of a potential turn around with transitioning to AI and Cloud with the newish CEO and that acquisition a while back (what was it, Red Hat or something like that?). It's in a pretty similar boat as Intel. Both of them are quite legacy but up until a decade ago people would have said similar about MSFT. \n\nI'm not invested in it outside of indexes, but I'd still feel more comfortable with it over a moonshot like PLTR or whatever meme stock people are pumping lately.",
        "created_utc": 1628102401,
        "id": "h7pjjql",
        "permalink": "/r/stocks/comments/oxyc1w/who_buysholds_these_horrible_stocks/h7pjjql/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1628131201.0
    },
    {
        "author": "AMediocreWhiteGuy",
        "body": "And Google Cloud. And now IBM has entered the cloud market with the red hat acquisition.",
        "created_utc": 1629579729,
        "id": "h9tysmm",
        "permalink": "/r/stocks/comments/p8xcfv/why_the_hell_is_no_one_talking_about_the/h9tysmm/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1629608529.0
    },
    {
        "author": "Anonymoose2021",
        "body": "Actually the middle aged trees bear the most fruit.   At some point older trees, just like GE and IBM, produce less fruit.",
        "created_utc": 1628097711,
        "id": "h7p87m5",
        "permalink": "/r/investing/comments/oxujcp/question_about_when_to_take_profits/h7p87m5/",
        "score": 7,
        "subreddit": "investing",
        "created": 1628126511.0
    },
    {
        "author": "MarcusAngely",
        "body": "IBM at the bottom of Bollinger now at 139ish. Should bounce to 145 (top of the bollinger) in the next 2 weeks and if the volume is high could test 150 before end of September.  Great play at current price for swing trading to sell in 1 to 2 weeks.",
        "created_utc": 1629479535,
        "id": "h9onqxj",
        "permalink": "/r/wallstreetbets/comments/p825zj/daily_discussion_thread_for_august_20_2021/h9onqxj/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1629508335.0
    },
    {
        "author": "trickintown",
        "body": "its more to do with AMD's innovation and intel lagging behind.\n\nVery similar to how IBM lost compared to Google or Amazon i guess?",
        "created_utc": 1629889624,
        "id": "haa0zw5",
        "permalink": "/r/stocks/comments/pb8j64/wth_is_wrong_with_intel/haa0zw5/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1629918424.0
    },
    {
        "author": "Ledovi",
        "body": "Has IBM failed? No. Is its stock worthless? Yes.",
        "created_utc": 1630005351,
        "id": "hagmgq8",
        "permalink": "/r/investing/comments/pbmbzk/department_of_energy_will_buy_an_nvidiaamd/hagmgq8/",
        "score": 6,
        "subreddit": "investing",
        "created": 1630034151.0
    },
    {
        "author": "NEW_JERSEY_PATRIOT",
        "body": "* Rising labor and shipping costs will eat their already small margins on retail.  \n* I think Prime membership will see slower growth due to increased competition.\n* AWS is in a very competitive field and will need to battle giants such as Google, Microsoft, IBM, Oracle.  They have a great start but industry is so competitive.\n\nI don't really have a bearish view on Amazon as they will obviously do fine for years to come, I just think there are better growth stocks out there.",
        "created_utc": 1630012181,
        "id": "hah3d7i",
        "permalink": "/r/stocks/comments/pc71xx/bear_case_for_amazonamzn/hah3d7i/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630040981.0
    },
    {
        "author": "TheMau",
        "body": "Don’t put your money on IBM.",
        "created_utc": 1630240764,
        "id": "hasom3h",
        "permalink": "/r/investing/comments/pdi4g0/what_are_good_buy_and_forget_stocks_if_i_already/hasom3h/",
        "score": 6,
        "subreddit": "investing",
        "created": 1630269564.0
    },
    {
        "author": "bungholio99",
        "body": "Even Switzerland Gov selected Baba before Google for Cloud Services.\n\nOkay with Microsoft, IBM, AWS but anyway before Google which also has a very big Office in Switzerland\n\nData Privacy is about what you save to the cloud not about Comput Consumption.",
        "created_utc": 1628885164,
        "id": "h8tpgq3",
        "permalink": "/r/ValueInvesting/comments/p3qte0/mohnish_pabrai_bought_even_more_baba_in_recent_q2/h8tpgq3/",
        "score": 6,
        "subreddit": "ValueInvesting",
        "created": 1628913964.0
    },
    {
        "author": "bbenecke3636",
        "body": "2019 revenues, aws 35bil, azure 33bil, IBM cloud 21bil, gcp 9bil. Gcp and azure are fasting growing since that time, meaning all of these companies already own significant market share, similar to aws...",
        "created_utc": 1629399198,
        "id": "h9keado",
        "permalink": "/r/stocks/comments/p7d05p/amazon_is_reportedly_planning_to_open_department/h9keado/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1629427998.0
    },
    {
        "author": "turkeychicken",
        "body": "I just did some rebalancing of my portfolio.  I dumped some low conviction/loser companies and doubled up on some of my high conviction companies.  I also started positions in a couple new companies as well.\n\nMy current brokerage portfolio is:\n\n**Equities**\n\nSymbol | % gain/loss | % of account\n:--------|:--------:|---------:\nAMZN | +152.23% | 15.2% | \nGOOGL | +138.5% | 15.02% | \nMSFT | +116.46% | 15% | \nNET | +147.29% | 8.7% | \nAAPL | +64.65% | 5.44% | \nTMO | +50.29% | 4.59% | \nABT | +26.06% | 3.89% | \nZTS | +74.84% | 2.9% | \nZG | +59.32% | 2.65% | \nCRM | +86.09% | 1.69% | \nMDT | +23.89% | 1.59% | \nHD | +17.29% | 1.4% | \nJPM | +32.44% | 1.25% | \nA | +3.84% | 1.23% | \nBRK/B | +62.67% | 1.21% | \nZBRA | +0.74% | 1.07% | \nUSB | +55.08% | 1.03% | \nSBUX | +34.63% | 0.89% | \nCRVL | +0.12% | 0.3% | \nIBM | -28.8% | 0.12% | \n\n**ETFs**\n\nSymbol | % gain/loss | % of account\n:--------|:--------:|---------:\nQCLN | +128.61% | 4.09%\nVTI | +4.98% | 3.34%\nVUG | +1.7% | 2.61%\nCGW | +8.23% | 1.81%\nADME | +52.31% | 0.94%\n\n**Mutual Funds**\n\nSymbol | % gain/loss | % of account\n:--------|:--------:|---------:\nWAMVX | +42.41% | 1.2%\nDLHAX | +17.13% | 0.83%\n\nI have some other ETFs and mutual funds in my Roth and SEP IRAs but this is the majority of  my investments.",
        "created_utc": 1630364432,
        "id": "hazlsaq",
        "permalink": "/r/stocks/comments/nppkp4/rate_my_portfolio_rstocks_quarterly_thread_june/hazlsaq/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630393232.0
    },
    {
        "author": "MiddleC5",
        "body": "I'm up almost 30% on IBM and that doesn't even include dividends. They are preparing to launch a spinoff, which I anticipate will be bullish for the stock prices for both companies",
        "created_utc": 1628100478,
        "id": "h7pexzq",
        "permalink": "/r/stocks/comments/oxyc1w/who_buysholds_these_horrible_stocks/h7pexzq/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1628129278.0
    },
    {
        "author": "bingojed",
        "body": "Microsoft, Google, and (IBM?) really need to up their game if Amazon is able to make such a big profit.",
        "created_utc": 1629396776,
        "id": "h9k8j3h",
        "permalink": "/r/stocks/comments/p7d05p/amazon_is_reportedly_planning_to_open_department/h9k8j3h/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1629425576.0
    },
    {
        "author": "girl_with_huge_boobs",
        "body": "Its up there with T, GE, PFE, IBM and the list of others that barely move in price over a 10 year period, just minus the dividends.",
        "created_utc": 1630324268,
        "id": "hax2j3v",
        "permalink": "/r/wallstreetbets/comments/pef0nj/daily_discussion_thread_for_august_30_2021/hax2j3v/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630353068.0
    },
    {
        "author": "HeyYoChill",
        "body": "IBM had like a 450% return from 73 to 83, not accounting for any dividends.\n\nXOM was a 10-bagger.",
        "created_utc": 1628380408,
        "id": "h842l9x",
        "permalink": "/r/stocks/comments/p03ovt/what_strategies_were_used_to_make_real_returns/h842l9x/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1628409208.0
    },
    {
        "author": "AccomplishedTrip144",
        "body": "IBM and IRM. I got in on Pfizer when it was in the low 30's. It seems to be a day trading stock now though",
        "created_utc": 1630424205,
        "id": "hb2hk2g",
        "permalink": "/r/stocks/comments/pf5iaf/dividend_stocks_to_park_in/hb2hk2g/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630453005.0
    },
    {
        "author": "markit_543",
        "body": "Satya Nadella turned that shit around so fast. From Windows phones and Skype to Azure and Linkedin/GitHub. Microsoft was on track to be the next IBM/GE, a dying legacy company. Now its being put in with the tech giants of Apple/Facebook and widely considered to be the most undervalued blue chip stock out there.",
        "created_utc": 1630185140,
        "id": "haq8bcb",
        "permalink": "/r/stocks/comments/pd70od/youtube_more_valuable_than_netflix_but_is_the/haq8bcb/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630213940.0
    },
    {
        "author": "longhegrindilemna",
        "body": "IBM recently crashed.\n\nBoeing too.\n\nGE also.\n\nThose don’t always qualify as amazing businesses with deep moats, or with competitive advantages.",
        "created_utc": 1629551163,
        "id": "h9s9ine",
        "permalink": "/r/ValueInvesting/comments/p8fqe3/alibaba_baba_passes_almost_all_of_grahams_tests/h9s9ine/",
        "score": 4,
        "subreddit": "ValueInvesting",
        "created": 1629579963.0
    },
    {
        "author": "FlyPenFly",
        "body": "I mean but his point stands, if you invested in suppliers to Apple like Motorola or IBM, you would not be doing as well as if you invested in Apple.\n\nNot saying Lucy is anything like Apple. It’ll probably fail.",
        "created_utc": 1629752326,
        "id": "ha2vu17",
        "permalink": "/r/wallstreetbets/comments/pa4qw9/my_bearish_bet_on_lucid_motors/ha2vu17/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1629781126.0
    },
    {
        "author": "Forgotwhyimhere69",
        "body": "Index funds that follow dow or total market have to pick up some as ibm is part of dow.",
        "created_utc": 1628100332,
        "id": "h7peli6",
        "permalink": "/r/stocks/comments/oxyc1w/who_buysholds_these_horrible_stocks/h7peli6/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1628129132.0
    },
    {
        "author": "Rush_Is_Right",
        "body": "General Catalyst, Dr. James Cash  (Senior Associate Dean, Emeritus, of the Harvard Business School, Director of Chubb, Advisor to General Catalyst Partners, Former Director of Walmart, GE, Microsoft, and Sprint), Paul Sagan  (Former CEO of Akamai Technologies and Director of Moderna and VMware), Robin Washington  (Former CFO of Gilead Sciences, Director of Alphabet, Honeywell International, Salesforce.com, and Veritiv), Ken Chenault (Chairman and Managing Director of General Catalyst, Former Chairman and CEO of American Express, Director of Airbnb and Berkshire Hathaway, Former Director of IBM and Procter &amp; Gamble), Steven Reinemund  (Former Executive Chairman and CEO of PepsiCo, Director of Vertiv, Walmart, Chick-fil-A, and Former Director of Johnson &amp; Johnson, American Express, Exxon Mobil, and Marriott International)",
        "created_utc": 1629343063,
        "id": "h9hnb4q",
        "permalink": "/r/SPACs/comments/p761je/spac_teams_with_fortune_200_formercurrent_csuite/h9hnb4q/",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1629371863.0
    },
    {
        "author": "trill_collins__",
        "body": "What do you think the mainstream, non professional finance crowd would have said 30 years ago? See below for the top 10 publics by market cap 30 years ago\n\n* Industrial Bank of Japan- $104bn\n* Sumitomo Bank - $73bn\n* Fuji Bank - $69bn\n* Dai-ichi Jangyo Bank - $64bn\n* Exxon Mobil - $63bn\n* GE - $58bn\n* Tokyo Electric Power - $56bn\n* IBM - $55bn\n* Toyota - $53bn\n* AT&amp;T - $48bn\n\n*Small aside* - **Good god** - if reddit had existed in the late 80s, early 90s, I can only imagine what the \n\n&gt;REEEEEEEE JAPAN'S TAKING OVER THE WORLD ECONOMY AND WILL DISPLACE THE USD AS THE WORLD RESERVE CURRENCY ANY DAY NOW REEEEEEEEEEEEEEEEEEEEEEEEEEEE\n\nwould look like....\n\nAny who, back to the topic at hand. Around this time, I'm guessing most answers would have been some big industrial conglomerate or just simply \"Japan\" (lol).\n\nAt this point in time, recall:\n\n* Steve Jobs hadn't worked for Apple for about 5 years\n* Computers are still fairly niche\n* The internet was still in its infancy and only being used by research universities and the federal government\n* Amazon would be ~5 years away from being founded\n* Sergey Brin was a freshmen in college and Larry Page was still in high school\n\nSo I'm going to go out on a limb here and say that most responses are wrong and that biggest company in the world by 2050 probably hasn't been founded yet or at the very least is still private and unheard of.",
        "created_utc": 1629474117,
        "id": "h9oa6i4",
        "permalink": "/r/investing/comments/p82kmm/what_do_you_think_will_be_the_largest_company_in/h9oa6i4/",
        "score": 4,
        "subreddit": "investing",
        "created": 1629502917.0
    },
    {
        "author": "stevejam89",
        "body": "No IBM sold their personal computer business / brand to Lenovo, but IBM is still as much of an American company as its ever been.",
        "created_utc": 1629042046,
        "id": "h91ibjj",
        "permalink": "/r/stocks/comments/p4ilu0/amazon_or_sp_500_over_the_next_ten_years_and_why/h91ibjj/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1629070846.0
    },
    {
        "author": "SlothInvesting1996",
        "body": "A lot of thing can change in 50 years: Amazon maybe out of business, Apple maybe a wash up company like IBM, Elon Musk may already been long dead, and nobody will remember Facebook anymore. Market is forward looking but not that far",
        "created_utc": 1629459011,
        "id": "h9ne0t8",
        "permalink": "/r/investing/comments/p82kmm/what_do_you_think_will_be_the_largest_company_in/h9ne0t8/",
        "score": 3,
        "subreddit": "investing",
        "created": 1629487811.0
    },
    {
        "author": "phillysteaks718",
        "body": "Great answer got to look at the stock, market cap and say does the story still make sense.  Yahoo used to be the dominant player in search.  IBM use to be the shit.  Microsoft was having a rough go",
        "created_utc": 1629432928,
        "id": "h9mg7yj",
        "permalink": "/r/stocks/comments/p7ql3y/is_amzn_a_safe_and_good_hold/h9mg7yj/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1629461728.0
    },
    {
        "author": "urk_the_red",
        "body": "Can they get the engineering issues fixed? The engineering issues happened because it’s an engineering company run by financiers who just want to extract wealth in the short term. \n\nThe people running the company don’t actually understand engineering and don’t have any interest in building an engineering firm. They just want to extract wealth. Look at what happened to Motorola, or IBM, or any of dozens of other engineering or technology companies where financiers and marketers take over management. They run it right into the ground and jump out with golden parachutes.",
        "created_utc": 1629744056,
        "id": "ha2bj1p",
        "permalink": "/r/stocks/comments/pa49rj/question_on_boeing/ha2bj1p/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1629772856.0
    },
    {
        "author": "jnecr",
        "body": "Exactly, I haven't had any belief that IBM would be a major player in the next couple decades. Their purchase of Red Hat was good and all, but MSFT and AMZN would be a better purchase IMO than IBM.",
        "created_utc": 1630244829,
        "id": "hasw7hs",
        "permalink": "/r/investing/comments/pdi4g0/what_are_good_buy_and_forget_stocks_if_i_already/hasw7hs/",
        "score": 3,
        "subreddit": "investing",
        "created": 1630273629.0
    },
    {
        "author": "trickintown",
        "body": "Ibm is trying hard but only time will tell if they can revive",
        "created_utc": 1629039534,
        "id": "h91ck67",
        "permalink": "/r/stocks/comments/p4ilu0/amazon_or_sp_500_over_the_next_ten_years_and_why/h91ck67/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1629068334.0
    },
    {
        "author": "raknor1981",
        "body": "you do realise what the IBM partnership is right? and how they work?  \nbecause people act like a partnership is a customer on here all too often.  \n\n\nPLTR are basically adding their service to IBM, the same way as they could partner with Microsoft and Amazon and make their software available on their platforms.  \n\n\n  \nit's basically adding your goods to another market place to try and make it more accessible.  \n\n\ndo you \"Partner\" with ebay because you sold something on their site?  \n\n\nif they added 3000 sales people then they think they will get a lot of new customers through doing this.  \n\n\nit doesn't mean they actually have a net income from this new sales avenue",
        "created_utc": 1629648263,
        "id": "h9x80m0",
        "permalink": "/r/wallstreetbets/comments/p96lm2/pltr_is_going_to_build_generational_tendiness/h9x80m0/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629677063.0
    },
    {
        "author": "explicitspirit",
        "body": "Imagine comparing BB to IBM or VmWare 🤣",
        "created_utc": 1629860712,
        "id": "ha8x85w",
        "permalink": "/r/wallstreetbets/comments/pazmes/bb_blackberry_the_sleeping_giant_potential_2/ha8x85w/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629889512.0
    },
    {
        "author": "hahdbdidndkdi",
        "body": "Not sure your point\n\nSpeculative stocks in 2000 crashed and burned/died in 2000 while large caps also took a beating (IBM/INTC/Cisco).\n\nCould easily happen again today with these small cap speculative stocks going bankrupt while msft/aapl/ect take 20%+ haircuts.\n\nNot saying it's gonna happen. But it could *easily*",
        "created_utc": 1630073329,
        "id": "hak3uok",
        "permalink": "/r/stocks/comments/pcjysj/rstocks_daily_discussion_fundamentals_friday_aug/hak3uok/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630102129.0
    },
    {
        "author": "kuprenx",
        "body": "go back buddy, future is fucked. live your life in peace. PS buy apple and IBM shares.",
        "created_utc": 1628583441,
        "id": "h8dz3tr",
        "permalink": "/r/wallstreetbets/comments/p197ts/what_are_your_moves_tomorrow_august_10_2021/h8dz3tr/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1628612241.0
    },
    {
        "author": "ridinwavesbothways",
        "body": "Enthusiasts is the beach front in my opinion. \n\nGoogle Chrome started with enthusiasts. Those people then only wrote websites for Chrome &amp; encouraged everyone else to switch to Chrome.\n\nI like the strategy. Create a loyal fan base who will be loud &amp; do all your marketing for you. When a person wants office equipment, they won't want the IBM version (Logitech), they'll want the Apple version (Corsair). \n\nAlso if IT has these people as the decision makers, they'll push the better quality stuff. No one wants to run around after help tickets replacing crappy Logitech junk every day.\n\nThis is why I'm very long Corsair. I wouldn't recommend calls unless they're LEAPS out to 22 or 23.",
        "created_utc": 1629143057,
        "id": "h974cg4",
        "permalink": "/r/wallstreetbets/comments/p5joof/crsr_is_way_too_cheap/h974cg4/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629171857.0
    },
    {
        "author": "ideal_NCO",
        "body": "100% of it is owned retard. If it weren’t owned, it wouldn’t be owned.\n\nThere’s a delay on reports, so when large institutions make big trades, the numbers might conflict. But they just add it all up. \n\nIt’s like the difference between email and the actual mail. \n\nTrade is made via email so it’s instantaneous, but the reports come from an IBM dot matrix printer that takes up an entire office. \n\nThe reports miss the shit that happened while the report was being compiled, but the computers tracked the sales. What you see are the reports from the dot matrix printer. They lag.",
        "created_utc": 1628034809,
        "id": "h7m7g69",
        "permalink": "/r/wallstreetbets/comments/oxfhug/according_to_nasdaqcom_institutions_currently_own/h7m7g69/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1628063609.0
    },
    {
        "author": "cristhm",
        "body": "Sometimes I think people (i.e. investors) like Disney content because that's what they watched when they were kids, new generations mainly watch YouTube (no more wait till Saturday morming for new cartoons), also the franchises are getting too politically correct that annoys some fanbase. Disney could be the next IBM, where teens do not have an idea what's that 'thing' (in terms of content).",
        "created_utc": 1628428896,
        "id": "h860eb9",
        "permalink": "/r/stocks/comments/p0aylx/which_stock_currently_well_below_a_1_trillion/h860eb9/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1628457696.0
    },
    {
        "author": "zhantoo",
        "body": "iZettle and Square are 1 year apart, so iZettle might be the copy cat.\nBut having done something revolutionary, and doing something revolutionary ain't the same.\nHave a look at IBM 😉",
        "created_utc": 1628372672,
        "id": "h83nhu9",
        "permalink": "/r/stocks/comments/ozur78/what_are_your_high_risk_high_reward_stocks_in/h83nhu9/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1628401472.0
    },
    {
        "author": "Republikofmancunia",
        "body": "Have you taken a look at their Q reports? Quarter after quarter Palantir is beating expectations. \n\nLatest report had\n\n- 90% commercial revenue growth YoY \n\n- Total revenue growth 49% YoY\n\n- 25 or 26% commercial growth in the latest quarter\n\n- Added almost a years worth of revenue in new contracts this last quarter alone\n\n- Recently paid off huge amounts of debt + lots of cash in Bank.\n\n- Reduced reliance on top 2-3 whale customers, although they are still heavily reliant on 10-15 large customers which is definitely something to work on. However with this IBM sales partnership we should expect to see this revenue concentration spread. \n\n- Expansion outside of the USA is something to work on too. Positive signs are that palantir have been highly praised by the UK government for work alongside the NHS in the vaccine roleout here, but the NHS was sued for the secrecy in which it signed it's contract with Palantir so it remains to be seen whether this will translate into more contracts in the UK.\n\n- Although showing a GAAP net loss per share, Palantir could actually easily be profitable right now. A lot of money is being funneled into R&amp;D, the new sales force and share options being exercised by management/employees.",
        "created_utc": 1629272584,
        "id": "h9dwrq7",
        "permalink": "/r/investing/comments/p6bgsw/cathie_wood_rebuts_michael_burry_saying_he_misses/h9dwrq7/",
        "score": 3,
        "subreddit": "investing",
        "created": 1629301384.0
    },
    {
        "author": "exe_virus",
        "body": "That company doesn't exist yet. It's industry probably exists, and it might even exist as a startup inside an existing company. Likely it's hidden inside some monopolistic big tech company, because that's where IBM, what eventually became Verizon, cell phones in general, google, etc. were. \n\nIt wasn't until the monopolies at those times were broken up that the new largest companies came into the scene.",
        "created_utc": 1629460846,
        "id": "h9ngz07",
        "permalink": "/r/investing/comments/p82kmm/what_do_you_think_will_be_the_largest_company_in/h9ngz07/",
        "score": 3,
        "subreddit": "investing",
        "created": 1629489646.0
    },
    {
        "author": "jayrid",
        "body": "'We almost have 15 patents' lol, I think a single random Ford or IBM engineer would have more.",
        "created_utc": 1628256516,
        "id": "h7xla5t",
        "permalink": "/r/wallstreetbets/comments/oz4ka3/microvast_mvst_the_only_dd_youll_ever_need/h7xla5t/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628285316.0
    },
    {
        "author": "10xwannabe",
        "body": "Agreed.  I once thought about having a portfolio just of \"forever stocks\".  The problem is no matter how I justified why I though stock x would make it forever I would just look at the DJ in the 80-90's and see the difference just decades later .  Amex, polaroid, IBM, etc...  Folks ALWAYS think the leaders today will be the leaders tomorrow.  Funny, since the winners now were the losers just 10-20 years ago. Only makes sense, as the winners todays just means less future growth for tomorrow.",
        "created_utc": 1628634573,
        "id": "h8gs1bp",
        "permalink": "/r/stocks/comments/p1q05b/just_created_a_custodial_brokerage_account_for_my/h8gs1bp/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628663373.0
    },
    {
        "author": "exe_virus",
        "body": "Successful: be careful with big tech. I'm just saying that most of the time giant monopolies get crushed by anti-trust at some point in the future. See: AT&amp;T/Bell, IBM/TexasInstruments. Microsoft, etc.",
        "created_utc": 1628456191,
        "id": "h87ljm6",
        "permalink": "/r/investing/comments/p0bc6h/daily_advice_thread_all_basic_help_or_advice/h87ljm6/",
        "score": 2,
        "subreddit": "investing",
        "created": 1628484991.0
    },
    {
        "author": "Sharcbait",
        "body": "That is fair. IBM is huge in my city so it kinda gives me a skewed view of it.",
        "created_utc": 1630245990,
        "id": "hasynx8",
        "permalink": "/r/investing/comments/pdi4g0/what_are_good_buy_and_forget_stocks_if_i_already/hasynx8/",
        "score": 2,
        "subreddit": "investing",
        "created": 1630274790.0
    },
    {
        "author": "OSRS_Kassadin",
        "body": "IBM is the nokia of computers",
        "created_utc": 1627832609,
        "id": "h7bo9u1",
        "permalink": "/r/wallstreetbets/comments/ousq0d/weekend_discussion_thread_for_the_weekend_of_july/h7bo9u1/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627861409.0
    },
    {
        "author": "Assaultman67",
        "body": "A good Ford or IBM engineer, probably not a random one.\n\nI'd say most engineers dont have a single patent.",
        "created_utc": 1628263190,
        "id": "h7y0bfk",
        "permalink": "/r/wallstreetbets/comments/oz4ka3/microvast_mvst_the_only_dd_youll_ever_need/h7y0bfk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628291990.0
    },
    {
        "author": "CoolGuyGreatVideo",
        "body": "He bought into Apple. Also, bought and sold IBM.",
        "created_utc": 1628377774,
        "id": "h83xk14",
        "permalink": "/r/ValueInvesting/comments/ozpr94/an_excellent_video_on_warren_buffetts_10/h83xk14/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1628406574.0
    },
    {
        "author": "filtervw",
        "body": "I am not sure of it's affected but it surely is correlated in a some way. If you find a company where the CEO is paid well above average of it's industry  but the revenue is flat or dropping you can be sure the CEO works for his/ her bonus not for the good of a he company. Examples: IBM in the days of Rometti, Intel a couple of years ago, GE, Cisco, etc",
        "created_utc": 1628373699,
        "id": "h83pjaq",
        "permalink": "/r/stocks/comments/p00rkk/understanding_how_stock_price_is_effected_by_ceo/h83pjaq/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628402499.0
    },
    {
        "author": "Me_for_President",
        "body": "Lame automod removed my comment, so I’ll try this way:\n\nQuite a few good crypto currencies already have no fees or very low fees. One of the ones I mentioned in my comment is in use by IBM and the government or Ukraine.",
        "created_utc": 1628842959,
        "id": "h8rew9v",
        "permalink": "/r/investing/comments/p3i6xp/whats_the_deal_with_cryptocurrencies/h8rew9v/",
        "score": 2,
        "subreddit": "investing",
        "created": 1628871759.0
    },
    {
        "author": "HistoryAndScience",
        "body": "I was in a similar position with IBM, cashed out to pay for my law school tuition lol. Difference though here is that Apple clearly is the better company. Just hold for future dividend payouts or pass it down to family. Congrats!",
        "created_utc": 1628594537,
        "id": "h8ec5ey",
        "permalink": "/r/wallstreetbets/comments/p1iq7r/anybody_have_any_tips_on_what_i_should_do_with/h8ec5ey/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628623337.0
    },
    {
        "author": "meowman3000",
        "body": "IBM bought Redhat.  So they have Openstack and Keycloak, and a lot more hybrid cloud solutions that are neat.\n\nAmazon and Microsoft want 100% cloud, where you pretty much pay off the entire cost of the server you rent every year.  Redhat allows you to run your own cloud and then connect it.",
        "created_utc": 1629040586,
        "id": "h91exd2",
        "permalink": "/r/stocks/comments/p4ilu0/amazon_or_sp_500_over_the_next_ten_years_and_why/h91exd2/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629069386.0
    },
    {
        "author": "Ramsgiving",
        "body": "Similar to IBM, I think INTC is losing market share to younger more innovative companies (with premium valuations).",
        "created_utc": 1629410723,
        "id": "h9l6dxj",
        "permalink": "/r/ValueInvesting/comments/p7l96p/what_defines_a_value_trap/h9l6dxj/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1629439523.0
    },
    {
        "author": "LiqCourage",
        "body": "If you don't have someone else doing the research on the individual stocks, you need to do it for yourself and at least keep a one year out price target built at each quarterly report for each of the individual stocks.  If you don't see yourself doing that, then by far the simplest solution is broad market ETFs.\n\n...as to taxation, well, you have 2 shares of IBM and are sitting on a loss of $20 per share.  if you itemize that loss can be netted off against other capital gains, or just taken off your taxes.  So you won't owe new taxes, you will get a tax benefit if the shares are sold at a loss.",
        "created_utc": 1629229637,
        "id": "h9bqqs9",
        "permalink": "/r/investing/comments/p6015j/daily_advice_thread_all_basic_help_or_advice/h9bqqs9/",
        "score": 2,
        "subreddit": "investing",
        "created": 1629258437.0
    },
    {
        "author": "Canadacapper",
        "body": "And I think Microsoft is actually part of the Dow 30.    But in general, the high flying speculative stocks (EV, Chinese, battery...) are going to come down harder than soggy old growth giants (IBM, John deer, Boeing...) if/when there is an interest hike",
        "created_utc": 1629652143,
        "id": "h9xh6le",
        "permalink": "/r/stocks/comments/p9fdvt/why_does_pe_even_matter_really/h9xh6le/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629680943.0
    },
    {
        "author": "WolfPackWSB",
        "body": "I thought the same thing until I witnessed other companies get caught up in large volume moments and major market corrections, while $INTC INTEL correlation was reversed went up with steady institutional ownership stayed consistent!! IBM &amp; INTEL both seem to stay within 5% margin of movement both ways",
        "created_utc": 1629911567,
        "id": "habcr4t",
        "permalink": "/r/stocks/comments/pb8j64/wth_is_wrong_with_intel/habcr4t/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629940367.0
    },
    {
        "author": "IAMHideoKojimaAMA",
        "body": "I'm still holding IBM smh",
        "created_utc": 1629939947,
        "id": "had89yf",
        "permalink": "/r/stocks/comments/paz1rv/your_number_one_rule_for_investing/had89yf/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629968747.0
    },
    {
        "author": "Not_FinancialAdvice",
        "body": "&gt; But how big of a percentage of the market space is high end servers and super computers? \n\nI'd argue that the big money maker is cloud/datacenter for Intel. They have the highest margin at volume on these chips. AMD is making inroads, but I'd argue doesn't have the institutional support/momentum (in a \"nobody got fired buying IBM\" sense) that Intel has.\n\nDisclosure: INTC, AMD, AAPL, QCOM shareholder.",
        "created_utc": 1629947922,
        "id": "hadpae2",
        "permalink": "/r/investing/comments/pbmbzk/department_of_energy_will_buy_an_nvidiaamd/hadpae2/",
        "score": 2,
        "subreddit": "investing",
        "created": 1629976722.0
    },
    {
        "author": "Vik2222",
        "body": "is to monitor the price of the VIX index RELATIVE to the Vix to various VIX futures and amongst them futures also.\n\nSo wether in real time or on a slower time frame, an inverted term structure flagged by this calculation would indicate a hedging position is warranted.\n\nAside from the timing signal benefit, the typical cost of carry is turned on its head. While the curve is inverted, time is a benefit for long VIx positions, in a true crisis, as panic rolls from one asset class to another, keeping the Vix elevsted for a long time, this can be very beneficial. This even at 20 or higher the Vix becomes cheap to own.\n\nThere are the find like you said, where basically the vix future inversion is a process, it takes time to manifest and is almost always  accompanied by some degree of equity drawdown, not crash. This hedging using VIX term structure will always be late as compared to always on hedges, so yes it might not be leading on second thoughts.\n\nBut my assertion that it is leadimg  implied here as in here is on a  whole another level. I have yet to see Covid (there were some problems there), but, the US downgrade in August 2011, the Lehman crisis Sept 2008, the subprime Auhist 2007, the Chinese Deval in 2015 all had the inverted coming in HARD..\n\nHigh vol periods and VIX fitires are a iterative process, that devolops over days amd weeks. (It's trading, it's not easy ha ha). One off shocks like the Japanese tsunami or the flash crash in 2010 can cause large spikes in the VIX but are usually transitional and do not lead to inversion beyond a few days.  This can be balanced by always on or a mixture that is proprietary.\n\nEverything I have explained is almost word for word from Sebastian. His books are grest. So are any of the others I mentioned above.\n Vol Vega is trademark product of Mark Sebastian and Group One Trading. \nMy point was, you are combining fear metrics that you are gathering using a neural network and coordinating that with the Vix. You need to be mindful of the futures snd how all the three mix together.\n\nHey, you and I both know, although it takes super smart people like you to implememt visions and projects like these and I commend you for that. But we dont really know what the fuck is going on in there. We do t know really know how the neural.really works. So it's worth a short to let HIM decide with your coaxing.\n\nI thought this connection might give you something to expand  on in the future, and maybe see what in the hell does HE (the network) come up with, Frankenstein style, you know what I mean.\n\nSorry for the miscommunication at first, I should have been clearer.\n\nI quite understand this differently actually, and I have a seat of the pants method that works for me with my adjustments (at least so far), so o  reproduced most of the stuff to inspire you to understand one VERY key thing.\n\nI'm.an ex comp sci major, way back when windows just came out 1992, and we used Pascal and ibn.mainframes.like Dec vax and ibm 4381.\n\nBut even in college, I saw that the main money THEN was made by systems analysts that bridged the gap between end isers and coders.\n\nToday if you side by side step your education up in the areas and things you are tackling (even if it's.not options or Vix). Remember the  time you spend knowing the topic thru and thru will come.out in the form of brilliant code and innovations that you might not even think possible.\n\n\nSomething truly special.\n\n\nThis didn't take.long to type,.most of it was copied but I wanted to get the idea across to you without putting you through the excruciating process of actually figuring out how I individually understand it.  Read the books. The knowledge will last you a.lifetime.and when your software becomes a state of the art software like what for example BlackRock makes (starts with a P I forgot), you can actually know what to do with the cash, instead of relying on a scammer or a.guy much less smarter then you. It can't hurt.\n\nTrading is the final frontier, everyone ends up here eventually, whether it be Gates or Jordan.\n\nAll the best.",
        "created_utc": 1630036512,
        "id": "haijhyh",
        "permalink": "/r/options/comments/pbzoqc/ive_build_an_engine_that_recognizes_fear_in/haijhyh/",
        "score": 2,
        "subreddit": "options",
        "created": 1630065312.0
    },
    {
        "author": "bungholio99",
        "body": "Why IBM? Who has sold all HW business which would be comparable with Intel to Lenovo?",
        "created_utc": 1629538862,
        "id": "h9rsr83",
        "permalink": "/r/ValueInvesting/comments/p8o02l/intel/h9rsr83/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1629567662.0
    },
    {
        "author": "badgebruce",
        "body": "IBM ... IBM’s First CPU With On-chip AI Acceleration Detects Fraud at Lightning Speeds \n\n[https://www.allaboutcircuits.com/news/ibms-first-cpu-telum-with-on-chip-ai-acceleration-detects-fraud-lightning-speeds/](https://www.allaboutcircuits.com/news/ibms-first-cpu-telum-with-on-chip-ai-acceleration-detects-fraud-lightning-speeds/)",
        "created_utc": 1630438101,
        "id": "hb3fem1",
        "permalink": "/r/stocks/comments/pf5iaf/dividend_stocks_to_park_in/hb3fem1/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630466901.0
    },
    {
        "author": "karpielady",
        "body": "I read on some forum that pltr is getting jobs because they worked with the government and are now seen as a safe bet “nobody ever got fired for hiring IBM” was the quote they used to compare why palantir keeps securing contracts",
        "created_utc": 1630349383,
        "id": "haymfy3",
        "permalink": "/r/stocks/comments/pedzyo/the_best_pltr_bear_case_i_found/haymfy3/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630378183.0
    },
    {
        "author": "10xwannabe",
        "body": "As Roger Gibson wrote in his excellent book, \"Asset Allocation\", \"Diversification means always being unhappy.  You will always wish you held more of the winners and less of the losers\".  That quote will answer why you are struggling with finding the answer.  Once someone decides to diversify you are GUARANTEEING you will not hold outperform someone out there who will be holding the next Amazon/ Google stocks in the next 20 years.  The reason to do it is making sure you don't hold the next IBM/ sears/ kodak/ Amercan express/ etc....",
        "created_utc": 1628917376,
        "id": "h8vl58q",
        "permalink": "/r/stocks/comments/p41g50/would_you_rather_own_a_small_number_of/h8vl58q/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628946176.0
    },
    {
        "author": "Successful_retired_7",
        "body": "Thanks.  Yes, there are risks with every investment decision.  And while some folks lost money as AT&amp;T, IBM and others faded, thousands of others had ridden those same companies for 20+ years to attain financial independence.  For the last 30 years or so, anyone who wasn't overweight in technology missed an opportunity.  Investing, imho, is all about managing risks...be that from action or inaction, be that from being aggressive or playing it safe.",
        "created_utc": 1628514867,
        "id": "h8a6mbg",
        "permalink": "/r/investing/comments/p0bc6h/daily_advice_thread_all_basic_help_or_advice/h8a6mbg/",
        "score": 2,
        "subreddit": "investing",
        "created": 1628543667.0
    },
    {
        "author": "foxhalo",
        "body": "Holy fucking shit. What could be the other three companies submitting a proposal? Switchfast? Magna5? Or someone more established like HP or IBM",
        "created_utc": 1628578636,
        "id": "h8dtklc",
        "permalink": "/r/wallstreetbets/comments/p14skb/pltr_fdic_update/h8dtklc/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628607436.0
    },
    {
        "author": "Investing8675309",
        "body": "IBM usually buckets revenue into cool sounding names that is pretty fast and loose. Their definition of AI and Cloud (eg on prem) is pretty ridiculous. IBM is not winning head to head against Google, AWS, etc in any meaningful way. This is likely custom solutions (think Wipro) for large legacy enterprise that they bolt on something they call AI-that-isn’t-really-AI. I get the value stock argument for IBM but there are areas it is not competitive with any industry leaders: hyperscale cloud and AI are two of them. \n\nGood luck with big blue! They usually get a savior CEO (eg Gerstner) whenever they’re near death, hopefully Krishna is that person!",
        "created_utc": 1629459297,
        "id": "h9negv2",
        "permalink": "/r/ValueInvesting/comments/p7l96p/what_defines_a_value_trap/h9negv2/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1629488097.0
    },
    {
        "author": "h_o_l_o_d_a_y",
        "body": " Thinkpads were the only laptops I cared to own but since Lenovo bought the brand from IBM the quality has slowly turned to shit...my old ass t500 from 2009 has a way sturdier build than a newer t530 from 2015, also was thinner ?!? Who cares",
        "created_utc": 1629348474,
        "id": "h9hwmr1",
        "permalink": "/r/wallstreetbets/comments/p6ua93/investment_in_lenovo_lngfvhot/h9hwmr1/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629377274.0
    },
    {
        "author": "Runningflame570",
        "body": "Fabs are only an asset if you can keep pace on node development. If not they're a liability as AMD, IBM, and many others found out. \n\nIntel hasn't kept pace since 14nm rolled out in 2014/2015 which has allowed TSMC and Samsung to catch up and leapfrog them. Their foundries are rapidly becoming very expensive liabilities and they have bad odds of ever catching up at this rate.\n\nAlso MobilEye did ~$330M last quarter. It's not a big business for Intel and HD maps don't scale.\n\nGood luck though if you're counting on execution to save them. Execution left the building with Paul Otellini.",
        "created_utc": 1629927134,
        "id": "hacfktv",
        "permalink": "/r/stocks/comments/pb8j64/wth_is_wrong_with_intel/hacfktv/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629955934.0
    },
    {
        "author": "theskyalreadyfell217",
        "body": "This is what I think he means.\n\nFor the last ten or so years IBM has had a slow and steady decline, but a lot of people thought, and still think, that they would have a rebound.\n\nYou would think a company like that with new leadership could come in and get that big ass ship turned around and put that horse power to good use.  It hasn’t happened.\n\nPeople look at Intel and assume, due to their manufacturing footprint, etc, that they can easily turn it around and deliver better tech than AMD and retake that throne.  I’m also not so sure they can.  We are talking about a fundamental shift in their way of thinking and doing business.  It’s easy to point out and say what needs to be done but organizations that size are really heard to change.  \n\nIt could easily be another ten years of Intel slowly declining and right sizing before they are agile enough to change and move forward in another direction.  \n\nThen again they could drop a redesigned and better chipset, socket, and chip in three years.  Both ways are a gamble.  Myself personally, I need to see better tech on the horizon before I go long on Intel.",
        "created_utc": 1630034239,
        "id": "haif56n",
        "permalink": "/r/stocks/comments/pbrve2/what_stocks_do_you_see_as_undervalued_at_the/haif56n/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630063039.0
    },
    {
        "author": "Whoopass2rb",
        "body": "They are not really players in the cloud market, their \"offerings\" are different. What IBM offers someone is the opportunity to own hardware and then give that hardware over to IBM to manage. IBM is a solutions company. Anything you want they will figure out a way to build. This by no means makes them the more practical (either in use or cost).\n\nThe difference with companies like Google, Amazon or Azure - they own the hardware and fully manage it, you just rent it to the specs you need.",
        "created_utc": 1630077430,
        "id": "hakdumq",
        "permalink": "/r/stocks/comments/pc71xx/bear_case_for_amazonamzn/hakdumq/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630106230.0
    },
    {
        "author": "fomoandyoloandnogrow",
        "body": "If IBM is gonna create quantum computers that will send conventional computers to the Stone Age, why aren’t we bullish on IBM?",
        "created_utc": 1627832554,
        "id": "h7bo5f4",
        "permalink": "/r/wallstreetbets/comments/ousq0d/weekend_discussion_thread_for_the_weekend_of_july/h7bo5f4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627861354.0
    },
    {
        "author": "Icelandicfarm78",
        "body": "Someone explain to me why Oracle has gone up in value this past year. Should trade the same way as IBM and AT&amp;T.  Garbage antiquated product with literally no growth over past ten years.",
        "created_utc": 1629238589,
        "id": "h9cbqy2",
        "permalink": "/r/wallstreetbets/comments/p6b7cz/what_are_your_moves_tomorrow_august_18_2021/h9cbqy2/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629267389.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  9th of August\n\n\n\n## Upcoming events for Monday, August  9th\n\n - Expected earnings:\n\n  ACM, ACRX, ADAP, ADES, ADMS, ADVWW, AEMD, AESE, AGEN, AIV, ALAC, ALHC, ALLK, AMC, AMPH, AMRX, ANAB, APD, APEI, API, APLS, APPF, APPS, APTS, ARCT, ARKR, ASLN, ASUR, ATCO, ATER, ATHX, ATRA, AVD, AVDL, AVYA, AXSM, AZYO, BALY, BARK, BATL, BCEI, BFLY, BHTG, BHVN, BNTX, BPT, BRMK, BRP, CABO, CAPL, CARA, CASI, CATB, CBAY, CBT, CCXI, CELC, CEVA, CF, CHGG, CHMI, CIH, CLNN, CLPR, CLRB, CMBM, CMCT, CMT, CNSP, COMP, CORR, CPHC, CPRX, CRNC, CRT, CSTL, CXW, DDD, DFFN, DHT, DISH, DMS, DOOR, DOYU, DRNA, DS, DSGN, EDN, EGRX, ELAN, ELY, EML, ENR, EPZM, ESE, ETH, EVBG, EVCM, EXTN, FBIO, FBRX, FF, FGEN, FIXX, FLGT, FLNT, FNHC, FPAY, FREE, FRHC, FSK, FTK, GALT, GANX, GBDC, GLNG, GOLD, GOOD, GOSS, GPMT, GRTX, GSMG, GSV, GTES, HALL, HALO, HBM, HE, HFFG, HGBL, HIL, HLIO, HMTV, HNRG, HPK, HQI, III, IIIV, IIN, IMUX, INDT, INO, INSW, IPAR, ISUN, ITCI, JAN, JHX, JOBS, JOUT, KDNY, KERN, KLR, KNDI, KOD, KOS, KRYS, LBPH, LFT, LINC, LMNL, LOGC, LOMA, LOTZ, LTBR, LU, LUB, LUNA, LYRA, MBIO, MESA, MHLD, MILE, MMAC, MMAT, MODN, MPAA, MRKR, MTEX, MVO, MYO, NBEV, NCMI, NES, NETI, NEXI, NGL, NHI, NKSH, NLS, NTR, OBCI, OCUL, OMER, ONVO, ORGO, OSH, OUST, OVID, PAR, PBT, PCTI, PEN, PGEN, PLNT, PLSE, PLX, PNTG, PRPL, PRTH, PRTK, PRVA, PTPI, PXS, QLYS, QMCO, RAIL, RCKT, RCMT, RDI, RDNT, REAL, REI, REKR, REPH, RETA, RGNX, RIOT, RNA, RPAY, RUBY, RWLK, SACH, SAIL, SCOR, SCPL, SCYX, SDC, SEMR, SENS, SESN, SFST, SGMS, SGTX, SIC, SJT, SMTS, SNCR, SNDX, SNEX, SOGO, SOHU, SPPI, SQSP, SRG, SRT, STE, STOK, SUNW, SVVC, SWAV, SYKE, SYNH, SYNL, TALK, TCDA, TGNA, THM, TLK, TNXP, TPHS, TPST, TPTX, TRVN, TSN, TTD, USFD, UWMC, VAPO, VFF, VHC, VOC, VRRM, VRTV, VTRS, VUZI, VYGR, WES, WHF, WILC, WKHS, WPG, XBIT, XGN, XPEL, YALA, ZIOP, ZLAB, ZOM, ZYNE\n\n - Ex-div:\n\n  AEP, AWK, BKR, BRW, BY, CDR, CG, CLR, DHF, DHI, EDF, EDI, FBMS, GABC, HBI, HBT, HMST, IBM, INVH, ISBC, JBSS, KMT, LGI, LPX, MET, MPB, MPX, MWA, NTB, OLN, PAG, PGC, PPG, ROL, RUSHA, RUSHB, SFBC, STZ, STZ.B, UIHC\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.050%)\n    - 6-Month Bill Auction (previous: 0.055%)\n    - CB Employment Trends Index (previous: 109.84)\n    - FOMC Member Barkin Speaks\n    - FOMC Member Bostic Speaks\n    - Investing.com Gold Index (actual: 59.4%, previous: 58.5%)\n    - Investing.com S&amp;P 500 Index (actual: 46.6%, previous: 47.3%)\n    - JOLTs Job Openings (consensus: 9.270M, previous: 9.209M)\n\n## Upcoming events for Tuesday, August 10th\n\n - Expected earnings:\n\n  AAME, ABST, AENZ, AFMD, AGFS, AIRG, AKYA, ALLT, ALPN, AMTI, AP, APLT, APRE, APTX, ARDS, ARMK, ATY, AVGR, AVPT, BDL, BDSX, BDTX, BRDG, BRN, BSY, BTAI, BTN, BVS, BYFC, CGAU, CHK, CHRA, CHSCP, CIR, CIXX, CLPT, CLSD, COGT, COHR, COIN, COKE, CPIX, CPSS, CRESY, CSPR, CURI, CVM, CXDO, CYAN, DAR, DCTH, DFH, DMAC, DNAY, DOCS, EGLX, ENVX, EPAY, ESEA, EXK, FLL, FLYW, FTEK, FUBO, FULC, FURY, FUSN, GBIO, GCMG, GHM, GIFI, GILT, GNPX, GO, GTEC, GTIM, HCKT, HMPT, HRMY, HROW, HYRE, ICCH, IDRA, IIVI, IMOS, INDI, ISPC, ITMR, ITP, JAMF, JAX, JBI, JMIA, KLDO, KODK, KPLT, KRNT, KRON, KTCC, LEU, LGL, LIFE, LPRO, LQDA, LRFC, LRMR, LRN, MCFE, MDWD, MEG, MLP, MNDO, MNOV, MRNS, MRVI, MTNB, NARI, NAUT, NEWT, NNOX, NOVT, NRBO, NSPR, NUWE, NVCN, NVEE, NVIV, OCX, OLMA, OLO, ONTF, OPFI, OPHC, OPTN, OSMT, OWL, PAAS, PAM, PANL, PAY, PAYS, PDFS, PFMT, PHAS, PLBY, PLRX, POSH, PRAX, PRLD, PRPH, PSTL, PUBM, PXLW, RAIN, RGLS, RHE, RMED, RVPH, SA, SFE, SFT, SGFY, SHLS, SIEN, SKIN, SMCI, SMID, SOLO, SOLY, SPCB, SQFT, SRNE, SSTI, STAF, STEP, STKS, STNE, STON, STRR, STXS, SYY, TAC, TASK, TBLA, TDG, TDUP, TDW, TGA, THCA, TLIS, TSHA, TYME, U, UPST, USCR, VEC, VIRX, VITL, VPG, VSH, VTNR, WHLR, WISA, WRN, WW, XAIR, XELA, XYF, YMM, YPF, ZETA\n\n - Ex-div:\n\n  ARCB, ASTE, AUDC, BFIN, COLB, CSTR, DCF, DLB, EBTC, ECC, EIC, GHM, HTGC, LARK, MCBC, MDC, NFBK, RA, SASR, TACO, UVSP, WETF, WINA, WNEB, WTBA\n\n - Economic events and announcements:\n\n    - 3-Year Note Auction (previous: 0.426%)\n    - 52-Week Bill Auction (previous: 0.075%)\n    - API Weekly Crude Oil Stock (previous: -0.879M)\n    - EIA Short-Term Energy Outlook\n    - MBA Delinquency Rates (previous: 6.38%)\n    - NFIB Small Business Optimism (previous: 102.5)\n    - Nonfarm Productivity (consensus: 3.5%, previous: 5.4%)\n    - Redbook (previous: 17.2%)\n    - Unit Labor Costs (consensus: 1.2%, previous: 1.7%)\n\n## Upcoming events for Wednesday, August 11th\n\n - Expected earnings:\n\n  AACG, AATC, ACVA, AEYE, AKRO, ALJJ, ALT, AMWL, AOSL, APG, APOP, APP, APPH, ARAY, ARCO, ARPO, ARRY, ASM, ATC, ATEX, AVAH, AVT, AXU, AYRO, AZPN, AZUL, BBQ, BCAB, BCEL, BEAM, BEKE, BFI, BIOC, BLI, BLNK, BMBL, BMTX, BTRS, BWAY, BWMN, CACI, CAE, CCAP, CEPU, CERE, CGRN, CLOV, CMPS, CNFR, CPNG, CRWS, CSPI, CSSE, CYCC, CYD, DARE, DIBS, DM, DRIO, DUOL, EBAY, EBR, EBR.B, EDSA, EGY, ELTK, ENS, EOSE, EQ, EVFM, EVGN, EVGO, EVOL, EYEN, FNV, FOA, FOSL, FREQ, FSM, FTCI, FTHM, GBS, GHLD, GHSI, GMAB, GMDA, GOCO, GOOS, GOVX, GRAY, HAE, HEPA, HIMS, HLLY, HSTO, HYLN, HYZN, ICCC, IDYA, IFS, IMNM, IMV, IMVT, INVZ, IOR, IS, ISSC, JRSH, KMDA, KMPH, KRMD, LFST, LSF, MAG, MBRX, MDVL, MIST, MNKD, MOGO, MQ, MSGM, MSP, MTTR, MYPS, NAVB, NEON, NGD, NGMS, NIO, NOTV, NTIP, NXE, OBLG, OLK, ONTX, OPEN, PAYO, PBLA, PCOM, PCVX, PHIO, PMD, PPTA, PRGO, PTRA, PYPD, RAAS, RADI, RDVT, REAX, RESN, RGLD, RIDE, ROOT, RPRX, RVMD, RXRX, RXT, SCPE, SHCR, SILV, SINT, SMWB, SNMP, SONM, SONO, SPRB, SSNT, STEM, STKL, STSA, STTK, TCON, TELA, TH, THRY, TIG, TKNO, TMDI, TRIL, TUFN, UGP, UGRO, VERX, VEV, VIEW, VRM, VWTR, WEN, WHLM, WIX, WKME, WTT, WVVI, XBIO, XCUR, XENE, XONE, YTEN, YY\n\n - Ex-div:\n\n  ACV, AIO, CBH, COG, COLM, CWBC, DBL, DEA, DLY, DSL, EFL, ENBL, EQNR, ETR, EVF, FANG, FCCY, HPF, HPI, HPS, HTBK, HTD, MGY, MTDR, MTG, NCV, NCZ, OPY, PBFX, PCI, PCK, PCN, PCQ, PDI, PDO, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, POOL, PROV, PTY, PYN, PZC, SBUX, SCCO, SSB, TBNK, TEX, TJX, TPX, VGI, VNOM, WELL, WLKP, ZION, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.371%)\n    - CPI (consensus: 0.5%, previous: 0.9%)\n    - CPI (consensus: 5.3%, previous: 5.4%)\n    - CPI Index, n.s.a. (consensus: 272.72, previous: 271.70)\n    - CPI Index, s.a (previous: 270.98)\n    - CPI, n.s.a (previous: 0.93%)\n    - Cleveland CPI (previous: 0.2%)\n    - Core CPI (consensus: 0.4%, previous: 0.9%)\n    - Core CPI (consensus: 4.3%, previous: 4.5%)\n    - Core CPI Index (previous: 278.14)\n    - Crude Oil Imports (previous: 0.510M)\n    - Crude Oil Inventories (consensus: -3.102M, previous: 3.626M)\n    - Cushing Crude Oil Inventories (previous: -0.543M)\n    - Distillate Fuel Production (previous: 0.138M)\n    - EIA Refinery Crude Runs  (previous: 0.045M)\n    - EIA Weekly Distillates Stocks (consensus: -0.543M, previous: 0.833M)\n    - EIA Weekly Refinery Utilization Rates (previous: 0.2%)\n    - Federal Budget Balance (previous: -174.0B)\n    - Gasoline Inventories (previous: -5.292M)\n    - Gasoline Production (previous: 0.372M)\n    - Heating Oil Stockpiles (previous: -0.681M)\n    - MBA 30-Year Mortgage Rate (previous: 2.97%)\n    - MBA Mortgage Applications (previous: -1.7%)\n    - MBA Purchase Index (previous: 247.5)\n    - Mortgage Market Index (previous: 734.3)\n    - Mortgage Refinance Index (previous: 3,571.3)\n    - Real Earnings (previous: -0.9%)\n    - Thomson Reuters IPSOS PCSI (previous: 61.42)\n\n^^^^2021-08-09",
        "created_utc": 1628503212,
        "id": "h89pmav",
        "permalink": "/r/RobinHood/comments/p0yf4d/daily_discussion_thread_august_9th_2021/h89pmav/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1628532012.0
    },
    {
        "author": "lowrankcluster",
        "body": "AWS is just too ahead of the competition. Other post here is giving false revenue numbers. On top of that, a large part of Azure revenue is still from their office suite. Same with IBM, there are few application specific things such as cognitive which IBM counts under cloud. None of these compete against AWS as a package.",
        "created_utc": 1629399853,
        "id": "h9kfuum",
        "permalink": "/r/stocks/comments/p7d05p/amazon_is_reportedly_planning_to_open_department/h9kfuum/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629428653.0
    },
    {
        "author": "FaTb0i8u",
        "body": "ibm, aapl, mttr...\n\n&amp;#x200B;\n\nand gme :) so maybe gambling addiction",
        "created_utc": 1628834101,
        "id": "h8r3ndi",
        "permalink": "/r/wallstreetbets/comments/p37krv/what_are_your_moves_tomorrow_august_13_2021/h8r3ndi/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628862901.0
    },
    {
        "author": "monkey7878",
        "body": "Google, IBM, oracle, cisco, Fortinet, Crowdstrike are my bets.",
        "created_utc": 1628972377,
        "id": "h8y895z",
        "permalink": "/r/stocks/comments/p4d4zh/which_stocks_at_least_50_off_their_52_week_highs/h8y895z/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629001177.0
    },
    {
        "author": "Investing8675309",
        "body": "Something is off with this IDC data; IBM is not a leader in AI, this references Watson which is a joke in the industry. Work in tech, know this stuff, IBM is a backwater. Not going to look into how IDC bucketed their revenue but can assure you IBM is not a hotbed of innovation in AI.",
        "created_utc": 1629434335,
        "id": "h9mijws",
        "permalink": "/r/ValueInvesting/comments/p7l96p/what_defines_a_value_trap/h9mijws/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1629463135.0
    },
    {
        "author": "Redditor45643335",
        "body": "I just checked the stock price of Oracle for like the first time in 10 years expecting it to be dead but its actually popping off... I thought it was in the same league as IBM and Cisco.",
        "created_utc": 1629482954,
        "id": "h9ow6we",
        "permalink": "/r/wallstreetbets/comments/p825zj/daily_discussion_thread_for_august_20_2021/h9ow6we/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629511754.0
    },
    {
        "author": "WPackN2",
        "body": "Microsoft, SAP, IBM etc.",
        "created_utc": 1629587983,
        "id": "h9ug1a6",
        "permalink": "/r/investing/comments/p8jkgh/cnbc_california_superior_judge_on_late_friday/h9ug1a6/",
        "score": 2,
        "subreddit": "investing",
        "created": 1629616783.0
    },
    {
        "author": "PassiveF1st",
        "body": "Price Targets from a retard.\n\nAMD $130\n\nSentinelOne $100\n\nDisney $190\n\nCHWY $115\n\nNET $125\n\nMSFT $300\n\nINTU $460\n\nHOOD $40\n\nNVDA $190",
        "created_utc": 1628252354,
        "id": "h7xdfcb",
        "permalink": "/r/wallstreetbets/comments/oz3mrm/daily_discussion_thread_for_august_06_2021/h7xdfcb/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1628281154.0
    },
    {
        "author": "Dmoan",
        "body": "It is ok company Dan Gilbert will never allow to be fintech because it will then compete with Intuit. So it’s stuck being refinance company and at mercy of interest rates. One Wall Street hates is uncertainty and as a result stock will always be undervalued.",
        "created_utc": 1628366897,
        "id": "h83bsk9",
        "permalink": "/r/wallstreetbets/comments/ozm902/most_anticipated_earnings_releases_for_the_week/h83bsk9/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1628395697.0
    },
    {
        "author": "greytoc",
        "body": "Fidelity is a broker and investment manager. And they do offer consultations to their customers - usually to see if there are products or services that could be beneficial. But that's not going to help you since they are not tax consultants. \n\nWhat you really want is a tax accountant to talk with. You can always start with one of the big retail tax preparation services like H&amp;R Block or Intuit TurboTax.  They have articles for expats online and you can talk with a tax preparer. \n\nBTW - you may want to check out the expat subreddits like r/expat . There is also r/USExpatTaxes \n\nLastly - the IRS actually has a free help line for international that you can just call if you have tax questions - [https://www.irs.gov/help/contact-my-local-office-internationally](https://www.irs.gov/help/contact-my-local-office-internationally) \\- there are other numbers on the IRS web site that you can check out if you have a different set of questions.",
        "created_utc": 1628446632,
        "id": "h87106z",
        "permalink": "/r/investing/comments/p0bc6h/daily_advice_thread_all_basic_help_or_advice/h87106z/",
        "score": 2,
        "subreddit": "investing",
        "created": 1628475432.0
    },
    {
        "author": "diaznutzinyomouf",
        "body": "I'm waiting to see what happens to intuit after being found last week to be on the hook for $130m for shady ass bait and switch,  forced arbitration that was determined to be illegal...",
        "created_utc": 1627885168,
        "id": "h7egc8p",
        "permalink": "/r/wallstreetbets/comments/ovm9le/harassment_priced_in_couple_sues_ebay_alleging/h7egc8p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627913968.0
    },
    {
        "author": "NooshBagoosh",
        "body": "Three weeks until INTU earnings. They're obviously pretty single-quarter focused with tax season, but I'm guessing this quarter will look pretty good due to COVID deadline extensions.\n\nMy theory on this company: investing is more accessible now which means that a bunch of dipshits now have to pay for upgraded Turbotax so they can claim losses, and they're probably more likely to fall for grifts like audit protection.\n\nBeyond that, they paid off a bunch of debt last quarter and bought back a few hundred million worth of shares. COVID doesn't affect this business. They will continue to print money. The only risk they face is pre-filled tax forms/simplification and this admin has shown no inclination that that's on the agenda.",
        "created_utc": 1628272360,
        "id": "h7ym4y2",
        "permalink": "/r/wallstreetbets/comments/oz3mrm/daily_discussion_thread_for_august_06_2021/h7ym4y2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628301160.0
    },
    {
        "author": "AcademicParticular69",
        "body": "intu.",
        "created_utc": 1628297395,
        "id": "h803vz1",
        "permalink": "/r/wallstreetbets/comments/ozebic/weekend_discussion_thread_for_the_weekend_of/h803vz1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628326195.0
    },
    {
        "author": "BrikenEnglz",
        "body": "what could one use instead of hub and intuit?",
        "created_utc": 1628498717,
        "id": "h89kni3",
        "permalink": "/r/wallstreetbets/comments/p0s8nu/forget_faang_introducing_the_thicc_ass_portfolio/h89kni3/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1628527517.0
    }
]