[
    {
        "author": "Ironleg01",
        "body": "No surprise here. US - China divide will only increase and tech war will intensify further. I think good way to exploit it might be to invest in US domestic manufacturers. With that in mind I have positions in GM, Intel and similar companies that have US plants. This is also contrarian play as these and other similar companies are hated at the moment and are cheap. Well not so cheap now but we're cheap when I was entering long positions. Another good angle is to invest in US defense contractors. Defence budgets will only go up and those companies actually treat shareholders very well. Just today while my tech equities were killed, GD (have long position) announced 8% dividend increase. Nice. For anyone interested in this I highly recommend Ray Dalio's latest articles on world powers.",
        "created_utc": 1614816018,
        "id": "gplgjt1",
        "score": 190,
        "subreddit": "investing",
        "created": 1614844818.0
    },
    {
        "author": "nevetando",
        "body": "Are there some tech stocks that are overvalued? yes. \n\nis all of tech overvalued? no.\n\nBut the whole sector is suffering because of a few. Just take a deep breath and relax. if you own any solid, diversified, mainstay tech (apple, Microsoft, even intel and AMD) you are going to be fine in the long run. \n\nIf you are in emerging tech, new companies, growing companies... well, godspeed. it is going to be bumpy. \n\nHistory favors tech though. but like all things, it goes in and out of favor with the people.",
        "created_utc": 1614881504,
        "id": "gpogfr3",
        "score": 100,
        "subreddit": "stocks",
        "created": 1614910304.0
    },
    {
        "author": "JRshoe1997",
        "body": "I bought Intel back when everyone and their mothers grandmas cousin was crapping on this company. Extremely undervalued and overlooked by the market.",
        "created_utc": 1614830884,
        "id": "gpm8iq5",
        "score": 38,
        "subreddit": "investing",
        "created": 1614859684.0
    },
    {
        "author": "Me-as-I",
        "body": "Anybody else buying up Intel?",
        "created_utc": 1614815298,
        "id": "gplf5rb",
        "score": 37,
        "subreddit": "investing",
        "created": 1614844098.0
    },
    {
        "author": "confused_hulk",
        "body": "hedgies can lurk in here all they like, the only intel they're gathering is APES HODL",
        "created_utc": 1615826971,
        "id": "gr12s9s",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1615855771.0
    },
    {
        "author": "rescue141x",
        "body": "Guys first stop panicking. Just buy.  No we don’t know what the price is going to be tomorrow or what’s going to happen. We just have to NOT sell, whatever happens. Also we may have some HF onlookers here gathering intel so be aware about that. Last night I saw a whole crapload of talk about stop loss options, way more than I usually see, and what do you know.. they pulled that shit today to trigger some. They have the media on their side, it could even get uglier. Stop freaking out and just hold",
        "created_utc": 1615428841,
        "id": "gqitee4",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1615457641.0
    },
    {
        "author": "ilai_reddead",
        "body": "This narrative is half complete, companies like cisco and Intel, yahoo, blackberry, Nokia were all profitable and growing companies that people got overly excited about and the big companies pulled up all of the junk ones with them",
        "created_utc": 1614823159,
        "id": "gplthqa",
        "score": 18,
        "subreddit": "stocks",
        "created": 1614851959.0
    },
    {
        "author": "calamitymic",
        "body": "Current gen ryzen chips are touted to be better than current gen intel. GPU game is gaining on nvidia. Ai software starting to utilize amd gpu. I think they are ready to take more market share. \n\nHaven’t bought the dip but I’m waiting for slight buying pressure. Then, I’m gonna go in dry as fuck because I need them to feel pain when I insert myself.\n\nTLDR: I’m bull dick bullish on AMD",
        "created_utc": 1614866733,
        "id": "gpnj8yg",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1614895533.0
    },
    {
        "author": "Jaiiri",
        "body": "Scary how fast it can go down though 😳 anyone have intel in what just happened? Whale cashing out? Massive short? Borrow? Something else?",
        "created_utc": 1615397091,
        "id": "gqgunet",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615425891.0
    },
    {
        "author": "-N-8-",
        "body": "&gt;here could b\n\nmicrosoft, intel, alibaba did it too... I think its because of GME shorts covering tomorrow, we'll see",
        "created_utc": 1614816674,
        "id": "gplhsvg",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1614845474.0
    },
    {
        "author": "new-chris",
        "body": "These new AMD Server processors beat intel at their own game I bet they start taking more share over the next few qtrs",
        "created_utc": 1615870885,
        "id": "gr3cira",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1615899685.0
    },
    {
        "author": "musei_haha",
        "body": "Threads move to fast,  the Airforce could leak area 51 intel about apes in space and we wouldn't even notice it....",
        "created_utc": 1615476948,
        "id": "gqkytud",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615505748.0
    },
    {
        "author": "historyneverhappened",
        "body": "You would think Intel might benefit from that ban for sure!",
        "created_utc": 1614816728,
        "id": "gplhwh1",
        "score": 11,
        "subreddit": "investing",
        "created": 1614845528.0
    },
    {
        "author": "LordBinLorry",
        "body": "AMD makes no sense to sit where it is and it's crazy that the intel charm offensive is still so effective.\n\nDon't get me wrong, Gelsinger is a great add but man they have such a huge mountain to climb.",
        "created_utc": 1617145190,
        "id": "gsusb5x",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1617173990.0
    },
    {
        "author": "VirtualParzival",
        "body": "Their chips sell out INSTANTLY when they hit the market, months after release.  That's all I needed to know.  Already bought in some long options, will probably buy in more.  \n\n\nOn a side note I've build new PC's for years, this year is the first time I've favored AMD over Intel for CPU and I am in love.  It's a better product at a lower price.",
        "created_utc": 1614867092,
        "id": "gpnjx24",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614895892.0
    },
    {
        "author": "slashrshot",
        "body": "If I may give my take. I agree tech is over valued, but the assumption here is that all tech stocks are equally over valued. That might not be so.  \nA certain company might be hugely over valued  *cough* snow *cough* while others are just slightly over valued to recent performances and if their roadmap pans out, are actually undervalued. Like intc.  \n\nSimiliarly, while oil&amp;gas might be undervalued as a whole, some of the companies might be overvalued as well. There will be value to be found either way and if you hold long term (think 1-3+years, world moves fast nowadays), the change in trends should not be a huge issue?",
        "created_utc": 1614847724,
        "id": "gpmutaf",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1614876524.0
    },
    {
        "author": "LovableContrarian",
        "body": "I had 6k of Intel calls, fell asleep for literally 10 minutes, woke up with 12k.\n\nI don't know why Intel is big dicking out of nowhere, but that was the most profitable power nap of my life.",
        "created_utc": 1615998537,
        "id": "gr93a72",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1616027337.0
    },
    {
        "author": "BRlEN",
        "body": "Lisa Su has crushed the CPU side of it vs. Intel and I think with this new line of GPU's they can finally start pushing into Nvidia's market share, this being huge with crypto being so popular now. I like the stock and think all tech is down right now",
        "created_utc": 1614873140,
        "id": "gpnwzte",
        "score": 10,
        "subreddit": "stocks",
        "created": 1614901940.0
    },
    {
        "author": "MFGrim",
        "body": "I’m so glad those simp losers that were posting about\n\n“THIS ONE IS FOR YOU DADDY, IM SORRY INTEL LAID YOU OFF IN 2008” \n\npaper handed. This place was getting pathetic",
        "created_utc": 1615858059,
        "id": "gr2qvpu",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615886859.0
    },
    {
        "author": "PeteTheCameraman",
        "body": "[Excerpt from Dr. Alexander Elder's: \"The New Trading for a Living\"](/r/wallstreetbets/comments/lxczpb/for_all_the_new_people_wondering_why_stock_charts/)\n&gt; *-Dr. Alexander Elder, Day Trader and Psychiatrist, \"Trading for a Living\"*\n_______________________________________________________________________________\n&gt;Markets are loosely organized crowds whose members bet that prices will rise or fall. Since each price represents crowd consensus at the moment of transaction, trad- ers are betting on the future opinion and mood of the crowd. The crowd keeps swinging from hope to fear and from indifference to optimism or pessimism. Most people don’t follow their own trading plans because they get swept up in the crowd’s feelings and actions.\n&gt;People change when they join crowds.They become more credulous and impul- sive, anxiously search for a leader, and react to emotions instead of using their intel- lect. An individual who becomes involved in a group becomes less capable of think- ing for himself.\n&gt;Group members may catch a few trends, but they get killed when trends reverse. Successful traders are independent thinkers.\n\n&gt;Many traders are puzzled why markets reverse immediately after they dump their losing position.This happens because crowd members are gripped by the same fear— and everybody dumps at the same time. Once the selling fit has ended, the market has nowhere to go but up. Optimism returns to the marketplace, and the crowd forgets fear, grows greedy, and goes on a new buying binge.\n\n&gt;Crowds are primitive, and your trading strategies should be simple.You don’t have to be a rocket scientist to design a winning trading method. If the trade goes against you—cut your losses and run. Never argue with the crowd—simply use your judgment to decide when to join and when to leave.\n\n&gt;**Compare this to what happens to a man after a fall. If he falls down a few steps, he may dust himself off and run up again. But if he falls out of a second-story window, he’s not going to run anytime soon; he needs time to recover. Prices seldom rally immediately hard after a bad decline.**\n\n_______________________________________________________________________________",
        "created_utc": 1614882260,
        "id": "gpoi9fy",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1614911060.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "Is it now illegal to be bullish on Nvidia, AMD or Intel?",
        "created_utc": 1615408497,
        "id": "gqhnooi",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1615437297.0
    },
    {
        "author": "ilai_reddead",
        "body": "Look back at dot com price target they are all on Google many analysts giving cisco, Intel price targets way above what they were worth, they still haven't reached those to this day https://money.cnn.com/2000/11/07/markets/street_talk/",
        "created_utc": 1614797318,
        "id": "gpkb5kr",
        "score": 9,
        "subreddit": "stocks",
        "created": 1614826118.0
    },
    {
        "author": "TheApricotCavalier",
        "body": "&gt;Intel is staging a turnaround\n\nThis same thing has been said for more than a year, and the story changes. I had this argument last summer where someone said they'd pivot into being an AI company lol.\n\n  \nI am bullish on their new CEO towards an engineering driven company; but one man isnt enough. He needs to clean house, and even then its at least a 5+ year long turnaround. You cant just will new factories into existence",
        "created_utc": 1614868763,
        "id": "gpnn95h",
        "score": 8,
        "subreddit": "investing",
        "created": 1614897563.0
    },
    {
        "author": "goldcakes",
        "body": "Intel: 5.86B net income, 250B valuation.\n\nNvidia: 1.46B net income, 317B valuation.\n\nIntel is staging a turnaround and can easily become a growth play in the next 2-4 years, with the new technical CEO. As a PC parts enthusiast, they are already stepping up cadences and launching competitive lineups that are actually in stock, because they are being produced much more than TSMC's bottlenecked's fabs.\n\nThey are the company to watch.",
        "created_utc": 1614868663,
        "id": "gpnn1je",
        "score": 8,
        "subreddit": "investing",
        "created": 1614897463.0
    },
    {
        "author": "formerskoomaaddict",
        "body": "INTC shitting the bed\n\nAMD shitting the bed\n\nMU shitting the bed\n\nIts official guys, we going back to stone tablets.",
        "created_utc": 1615390210,
        "id": "gqgdfys",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1615419010.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Bought some CVS today. Currently watching these stocks: \n\nSNE\nINTC\nSTAMPS\nLMT\nCVS \n\nTDOC(?)\n\nAlso keepin an eye on MSFT, AAPL, QCOM.",
        "created_utc": 1615347164,
        "id": "gqeprds",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615375964.0
    },
    {
        "author": "maxkingusa",
        "body": "NVDA has been referred to an out of favor stock because people are not going to be staying at home.  This is not a strong case for why the stock traded down.  I believe it will hit prior highs and the need for the technology is increasing dramatically beyond the home gamer.  \n\nI have been adding since the lows of the recent dip.  Today it is showing great strength with strong volume.   \n\nI have also been adding AMD.  I believe they have made the shift to beat INTC in backyard.",
        "created_utc": 1617203554,
        "id": "gsx7qds",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1617232354.0
    },
    {
        "author": "lib3rty47",
        "body": "Wealth simple has been making strides. I agree the gap is still enormously huge but hubris might catch up. Amd and Intel for example. Every year WS has added new features to its platform. Just look back last year, they only had a mobile trade app. Now they trade crypto, desktop app, etc. Their platform covers taxes, roboadvisors, cash and direct trading. Subjective but their interface is a lot cleaner looking as well. I see overtime they might cater to more expert looking interface but I give them applause for wjay they've accomplished so far",
        "created_utc": 1615491513,
        "id": "gqlwc54",
        "score": 7,
        "subreddit": "CanadianInvestor",
        "created": 1615520313.0
    },
    {
        "author": "floodmayhem",
        "body": "I keep seeing GME trade inverse of Intel and others... so i bought a bunch of puts against Intel, fuck em, GEE EM EE goin interstellar",
        "created_utc": 1615563416,
        "id": "gqp6hte",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1615592216.0
    },
    {
        "author": "darkfiber-",
        "body": "For the AMD play: idiots started selling AMD and buying Intel because Intel got a new CEO and they're like, \"What if Intel comes back and can compete with AMD again!?\" Even if Intel starts development on that right now, it'll take them 2-3 years to make the chip. Also Intel stock before AMD crushed them was \\~$65 the stock is now \\~$65. That's a big WHAT IF for the morons playing Intel and selling AMD, I see no up side potential on the Intel side while AMD is down 20% from highs.  \n\n\nSo imma blow your mind ... what if AMD keeps their foot on the pedal and Intel never catches up? To me that's just as likely except prices are right for buying AMD right now. AMD makes up \\~3% of the datacenter market, with their Zen 3 datacenter CPU coming out next week and TSMC investing 30 billion in production and building a fab in the US, it's still Intel's market share to lose and AMD's to win. Michael Cohen rated AMD as his #2 stock pick behind GOOG. It's a #1 BUY on Cramer's Action Alerts Club. Average price target is $103, high is $161. Stock is way below that.   \n\n\nI bought $50k in stocks and call options across multiple months, from April to Jan 2022.",
        "created_utc": 1615575828,
        "id": "gqpy9tp",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615604628.0
    },
    {
        "author": "AFmedic9919",
        "body": "Halting the stock is good...intel tells us people wants to jump in!!!!",
        "created_utc": 1614716898,
        "id": "gpge28w",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614745698.0
    },
    {
        "author": "EffingDankrupt",
        "body": "I've been trying to post this since yesterday and it keeps getting deleted so I guess it's just a long ass comment now.  Mods please tell me why automod hates me?\n\n First of all, 🚀🚀🚀🚀🚀🚀🚀🚀🚀.\n\nSecond of all, I like the stock. Yes the stock. Not hating on those side hussies they just don't get me.\n\nThirdly of all, I have some interesting intel, some serious questions, and I would like to hear some serious explanations if this ever makes it out of the great filter.\n\n1. The simple question first. I keep reading a lot of talk about available shares to cover short positions and all kinds of fancy maths to show all kinds of fancy scenarios. The problem I can't seem to get around is that there are millions of shares trading hands every fucking day, so what in the fuck are you talking about? If I were short 100,000 shares and I would like to close that position can't I just click the buy to close button and fuck off? Why the hell do I give a shit if these shares are real or synthetic or counterfeit or made out of construction paper? I just click the button and my position is closed. Why would this be any different for a hedge fund with a short position? Seriously though, I don't know the answer and I have not seen an answer so please somebody fill the gap here.\n2. Holy fucking put options. I happened to take a peek at the option statistics today and there is some serious insanity that I can't come up with a reasonable explanation for. Hopefully one of you smooth brains has some logic that can be applied.\n\n(There was a pic here of 646,379 puts)\n\nguh\n\nHoly fuckin puts batman\n\nSo.... thats a lot of puts. 646,379 to be exact (EDIT: plus another 300,000 today). The last time I saw that was the day before the stock took a huge dump a couple weeks ago. It was well planned and well executed. So I got more curious and decided to check out what exactly they are buying and/or selling so I can pucker the butthole.\n\n(There was a pic here of hundreds of thousands of 1,2,3 strike worthless puts being bought)\n\nholy smokes batman\n\nAre you yanking my dick right now? Yes those are $1 strike puts.\n\nWTF chuck. This page goes on like this forever. Yes, those are literally **hundreds of thousands** of puts, 500 per order, expiring in 6 fucking weeks, ranging from $1 strike price to $5 strike price. Is this a joke? Altogether my rough math is showing approximately 400,000 puts under $5 strike.\n\nMy first instinct was OH somebody is SELLING these puts to collect a massive premium payday when they expire worthless and this is BULLISH AF. But a few steps later I back tracked on that relief when the thought occurred to me that there is still somebody on the other side of every one of those trades who is buying them up 500 at a time every few minutes like candy. ?????. Confused emoji. Seriously, what the fuck is going on here.\n\n1. Is $THETA gang just collecting their tendy premiums and taking advantage of high IV?\n2. Is the stock about to file bankruptcy, liquidate, and move out of country all in less than 6 weeks?\n3. Is this a reverse gamma squeeze play to drive the price down and force shorting?\n4. Maybe I am a cat?\n5. Is there a different game of chess happening here I am completely missing?\n\nLike I said, I don't have any logical answers here but I am hoping you guys are able to detectify this a bit and make this make sense to me because I don't know what's going on here, but I do know that some kind of pretty serious fuckery is about to take place if it hasn't already.\n\nThank you for coming to my TED talk. As a reward, here are some more 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nPositions: Calls, shares, and 100x $1 puts just incase GME lands on the moon and is delisted for lack of residency?\n\ntl;dr nothing makes sense anymore, which makes me really like the stock, and also really confused",
        "created_utc": 1614877619,
        "id": "gpo7c73",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614906419.0
    },
    {
        "author": "Vesuvias",
        "body": "Seriously. It’s insane - they are sitting on a pile of cash AND continuing to raise the bar for tech. The Apple Watch is the only smart watch worth owning. The iPhone is a fantastic phone. Ipad - only tablet worth owning...and now the M1 Macs are cruising Intel. \n\nAR is the next big move - and Apple will do it right.",
        "created_utc": 1615236471,
        "id": "gq94t2i",
        "score": 6,
        "subreddit": "stocks",
        "created": 1615265271.0
    },
    {
        "author": "pdoherty972",
        "body": "Totally.  Apple is nothing to be worried about.  They are firing on all cylinders right now - flush with cash and with a broad product portfolio people are buying hand-over-fist, including their new computing devices using their custom M1 SOC CPU which is mopping the floor with Intel and AMD CPUs both in speed as well as battery life (some are reporting up to 20 hours of battery on their MacBook Air M1 laptop!).",
        "created_utc": 1615225337,
        "id": "gq8etpl",
        "score": 6,
        "subreddit": "stocks",
        "created": 1615254137.0
    },
    {
        "author": "gerjerb",
        "body": "Holding:\n\nKO 50c 5/21\n\nSNAP 80c 5/21\n\nOXY 28c 5/21\n\nLUV 60c 5/21\n\nNVDA 550c 5/21\n\nWFC 40c 5/21\n\nDIS 200c 7/16\n\nABNB 220c 7/16\n\nTSLA 900c 9/17\n\nAAPL 150c 9/17\n\nINTC 95c 9/17\n\n\nAdded: \n\n\nTSLA 595c 4/1",
        "created_utc": 1617115564,
        "id": "gst06j0",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1617144364.0
    },
    {
        "author": "notpr1m",
        "body": "Yes. Buy AMD. Better tech than Intel but cheaper than NVIDIA, no fabrication operations because they were losing money on it a few years ago so sold it off to focus on design, which I think gives them more flexibility to adapt to capitalize on any investments that could be coming from the public sector, and they probably aren’t bleeding money from production constraints like the others. Probably the best CEO in the space as well. \n\nI also like Qualcomm a lot for similar reasons, but also because they’re positioned to win big in 5G and will probably do well in the IoT space as well. Much more mature company too with a nice dividend ($.65/share).",
        "created_utc": 1614828778,
        "id": "gpm4pgl",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614857578.0
    },
    {
        "author": "InternationalMatch13",
        "body": "It's more than just that.\n\nMSFT, INTC, BABA, F, TSLA, PFE, KO.\n\nEither something serious is up or this is a larger series of weird and oddly simultaneous glitches. \n\nSome thing that all of the Short stomping going on is creating a liquidity crisis.",
        "created_utc": 1614838653,
        "id": "gpmkejj",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1614867453.0
    },
    {
        "author": "italiangreenbeans",
        "body": "It really depends on what happens in the future in terms of new chip sets and cards. The newest Ryzen chips are incredible, in terms of price to performance, and their newest set of graphics cards, while suffering from the same shortage as their only real competition, nVidia, have on par performance specs for 25% less. I've been an Intel/nVidia user since I built my first PC years ago, but in the last few generations of chips and cards, I've always recommended AMD products to my friends looking to build PCs. In fact, if you look on the logicalincrements website, which is a very popular resource for speccing out a new PC, each and every recommended CPU is AMD. They were small, and overlooked in the past, but they are dominating as of late.\n\nLooking at the prices of the stocks, AMD is still less than 1/3 the market cap of NVDA, despite the fact that NVDA only makes GPUs, while AMD makes both CPUs and GPUs. If you look at Intel, they have 2.5x the market cap of AMD, and they only make CPUs.\n\nWith the way AMD's chips have been performing, and the fact that they are outperforming on both isles of the PC gaming industry, I think they'll end up doing very well. A stock price of $250+ is not out of the question imo.",
        "created_utc": 1614800213,
        "id": "gpkhuq3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614829013.0
    },
    {
        "author": "richtofin115",
        "body": "True but I think it works sometimes. That intc ceo who conveniently had a sale set like a week before the exploit vulnerability in 2017 or 2018 became public was wayyyy too coincidental to be a coincidence",
        "created_utc": 1615937170,
        "id": "gr6hhdy",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1615965970.0
    },
    {
        "author": "TerrorDeity",
        "body": "Not sure how much lower we can really go. But tomorrow I'm increasing my INTC monthlies and I think I'm going to open up QQQ and LULU monthlies.",
        "created_utc": 1614900207,
        "id": "gppnjmi",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614929007.0
    },
    {
        "author": "OrganicTinselFarmer",
        "body": "Intel says there's a flaw in the Deathstar. \n\nStay on target.\n\nNot financial advice, just a Starwars reference. Like those movies, love this stock.",
        "created_utc": 1615575052,
        "id": "gqpwkbz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615603852.0
    },
    {
        "author": "HellsCmingWthMe",
        "body": "Why tf is intel randomly mooning",
        "created_utc": 1615997555,
        "id": "gr912lm",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1616026355.0
    },
    {
        "author": "AirborneReptile",
        "body": "Schwab let my brother in law get level 1 options (he has limited experience), but he had to have basic knowledge of options.  They asked him some questions over the phone, how many shares does 1 option control?  What do you expect to happen if you buy a put? lol... I've been with them for 3 years and they gave me level 2 right away but the atmosphere has changed with the massive amounts of new traders.  I like their platform and StreetSmartEdge.  Plus they do give you price improvements when you place market orders (Just sold some INTC calls and got $ above market placed order).",
        "created_utc": 1617213729,
        "id": "gsxucxu",
        "score": 5,
        "subreddit": "stocks",
        "created": 1617242529.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "This year I bought xle at 28, bought cvs at 58, cisco at38, intc at 48. I'm currently in crm and adbe. I have a 10 year horizon so it's just change of ev multiple so it's NBD. can't predict the market but you can see if a company is a good company.",
        "created_utc": 1614811673,
        "id": "gpl7th1",
        "score": 5,
        "subreddit": "stocks",
        "created": 1614840473.0
    },
    {
        "author": "dizzy_centrifuge",
        "body": "Taiwan semiconductor producers hoarding water during drough that government projects to last until May. In light of chip shortages what are your thoughts on INTC in the short run?",
        "created_utc": 1615240292,
        "id": "gq9dggl",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615269092.0
    },
    {
        "author": "PlumpStegadon",
        "body": "Instead of being priced for perfection, they are priced for mediocrity (or worse). That's why I bought some INTC a few months ago - they have some issues but I think the price might be a bit overly pessimistic.",
        "created_utc": 1615259772,
        "id": "gqaedrb",
        "score": 5,
        "subreddit": "stocks",
        "created": 1615288572.0
    },
    {
        "author": "lIlIlIlIlIlII",
        "body": "You would , intc has dividends....",
        "created_utc": 1615232506,
        "id": "gq8vn65",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615261306.0
    },
    {
        "author": "gb2075",
        "body": "I’ve been researching semi-conductors in depth the past few days. \n\nI’m eyeing the big retail guys like INTC, NVDA, AMD (agreed with you that AMD is the most promising).\n\nThe other segment is the fabricators, they don’t sell chips they just produce them for other companies. I’m keeping tabs on AMAT, TSM, LRCX, NXPI, FORM, UMC).\n\nThen finally the rare earth metals.. companies like MP, AMAT, VALE (I was long on these guys then they got a fucking $7B fine for killing 300 people in a dam explosion.... oops).\n\nLook into Biden’s recent executive order, not only does he address the global semiconductor shortage, but plans to bring jobs back to the states and invest in American companies. MP Materials is the only US based company REM company. \n\nThis all looks so obvious as a long term play. I forget where I read it, but the global semiconductor usage is going to 10x or something insane like that in the next 10 years.\n\nI don’t know why all of these companies are down recently, I haven’t looked into it. I bought $10 worth of every stock listed above so I could keep tabs on them. All of them have followed the same negative trajectory the last month or so. If you zoom out to 5 year though, almost every single company shows insane growth. I imagine that growth will only compound long term. Do you have any thoughts on the reason for this recent downward trend? \n\nI’m considering making a pretty massive 5-10 year long play on semiconductors.",
        "created_utc": 1614872359,
        "id": "gpnv7ia",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614901159.0
    },
    {
        "author": "ahminus",
        "body": "Inside the industry that creates the most profit for these companies, a sea  change is happening to AMD that will probably only accelerate over the next two years.  That's entirely because the total cost of ownership on the price/performance curve right now is hugely in AMD's favor.\n\nNo one wants these super power hungry Intel parts for large buildouts.",
        "created_utc": 1617052708,
        "id": "gsqcvh5",
        "score": 5,
        "subreddit": "stocks",
        "created": 1617081508.0
    },
    {
        "author": "somekilljoy79",
        "body": "AMD since their only real competitor is Intel and AMD has been making superior products at lower price points (from my understanding)",
        "created_utc": 1615435774,
        "id": "gqj5or7",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1615464574.0
    },
    {
        "author": "bodiddlysquat26",
        "body": "Weekly shout out to the guy who advised me to buy TSM leaps after it cratered a week or so ago on the Intel foundry news.",
        "created_utc": 1617215843,
        "id": "gsxyykk",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617244643.0
    },
    {
        "author": "SupremeWizardry",
        "body": "INTC was the first stock I ever bought over a decade ago. It was a fantastic company, the name in the game for desktop computing.\n\nA lot has changed.\n\nNow, I'm gonna be blunt with these next statements... Being more than a year behind your direct competition in producing sub 10nm chips is not some minor issue, it is a big fucking deal.\n\nThis isn't something they'll solve next month. It's been something they've been planning, working on, for years without success. During this time your competition has solved it and is on track to lap them. Some of the largest fab capacity on the planet, and they can't produce a competitive product. If you're not the leader in a superior quality product to maintain market share, in semiconductors, it's not good.",
        "created_utc": 1615260286,
        "id": "gqafax4",
        "score": 4,
        "subreddit": "stocks",
        "created": 1615289086.0
    },
    {
        "author": "TerrorDeity",
        "body": "How about INTC? I know they are \"boomer\", but they are in a better position to handle a semiconductor shortage than most (all?) companies. They will be raking in the money in the upcoming months/years because they can keep up with supply. \n\n&amp;#x200B;\n\nI also like LULU. Sure, all the basic girls like their yoga pants, but what about males? I see more and more males wearing their products. Sponsorship deals could really make them blow up too. NKE potential?",
        "created_utc": 1614781213,
        "id": "gpjag4l",
        "score": 4,
        "subreddit": "stocks",
        "created": 1614810013.0
    },
    {
        "author": "wine_o_clock",
        "body": "Not as a meme, is NOK a good 5G play? They’re one of the biggest owners of 5G patents. And I know “quality over quantity” is important in this regard, but they’re also a leader in patent “value” according to a few studies. Sources below:\n\nPatent quantity https://www.iam-media.com/who-leading-5g-patent-race-0\n\nThe Patent Power Index takes into account:\n\n&gt;growth, impact, generality and originality of communication patents\n\nSlide 11 https://www.ipwatchdog.com/wp-content/uploads/2019/07/SLIDE-DECK-apple-intel-07-30-2019-FINAL.pdf\n\nPatent value https://spectrum.ieee.org/static/interactive-patent-power-2017\n\nThoughts?",
        "created_utc": 1614751131,
        "id": "gpi8ma9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614779931.0
    },
    {
        "author": "LeozMJilliumz",
        "body": "I’ll make sure to get a mini one then and roll the dice with the flight attendants. Thanks for the intel!",
        "created_utc": 1614787948,
        "id": "gpjp82c",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614816748.0
    },
    {
        "author": "MassHugeAtom",
        "body": "Corsair, baba, intel are the ones that are green today lol. NFT also seem to held on and regain some momentum with eth breaking 1800 again.",
        "created_utc": 1617036576,
        "id": "gspdivx",
        "score": 4,
        "subreddit": "stocks",
        "created": 1617065376.0
    },
    {
        "author": "coffeesippingbastard",
        "body": "buying in at this price would be fine imo, it might dip even lower but I think when they weather this, they can come out in the 100+ range. \n\nmedia seems to think they were a little expensive at their 90 level and intc being undervalued but I think it's just old people talking out their asses.",
        "created_utc": 1614813174,
        "id": "gplaxag",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614841974.0
    },
    {
        "author": "FreyBentos",
        "body": "SEmi conductors are made from silicon, the most abundnat material on eartth. We literally can extract it from sand lol, the whole \"semi conductor shortage\" is over blown nonsense if you actually know anything about them. The only thing there is a shortage of is slots at TSMC's fabrication plant as they are the best in the business and AMD(and therefore the xbox/ps5 is affected), Nvidia, Apple and now Intel want them all to make their processors for them. The processors for everything else well we have plenty of fabrication plants that can make them not everything needs to be leading edge 7nm",
        "created_utc": 1614843520,
        "id": "gpmqa3l",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1614872320.0
    },
    {
        "author": "Megatf",
        "body": "Airlines and cruiselines.\n\nBut the tech market dip means that everything in the tech market is on sale.  Blue chip tech stocks like AAPL, AMD, INTEL, etc always rebound higher.  \n\nYou buy on the dips and “corrections” for the largest gains.  Most profit is lost investing on the run ups of a stock.",
        "created_utc": 1615253861,
        "id": "gqa3n71",
        "score": 4,
        "subreddit": "stocks",
        "created": 1615282661.0
    },
    {
        "author": "floodmayhem",
        "body": "I'm tired of watching Intel do nothing but gonip every time gme goes down",
        "created_utc": 1615482215,
        "id": "gqlap7k",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615511015.0
    },
    {
        "author": "jukito1",
        "body": "even intel is dumping like a mfer. It isn't even just growth dumping and some growth stocks are even going up. Market on extremely difficult mode rn",
        "created_utc": 1617114575,
        "id": "gssy2uz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617143375.0
    },
    {
        "author": "ButtButt_McButtButt",
        "body": "I want to buy more AMD TSMC and INTC. I feel like they're gonna go up bigly in the next year or so. No real research other than I woke up with a semi, and thought it was a sign.",
        "created_utc": 1617140717,
        "id": "gsujj58",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617169517.0
    },
    {
        "author": "Danksley",
        "body": "INTC is also having massive problems getting below 10nm ...\n\nThey are something like four or five years behind their original schedule now.\n\nI think its a good time to buy INTC for 5 years from now. They are in a market with only two companies (INTC, AMD) and just need to recover a little bit.",
        "created_utc": 1615752270,
        "id": "gqxppl9",
        "score": 4,
        "subreddit": "stocks",
        "created": 1615781070.0
    },
    {
        "author": "Shift_Tex",
        "body": "AMD. Been buying and holding for a while and will continue to for another 5-10 years. Feel like the current price is actually undervalued.. Been trading sideways for half a year but imo it's on par or even better than Intel. Intel's market cap is double AMDs right now. Curious to hear reasons why Intel deserves the #2 spot (behind Nvidia) if anyone has any.",
        "created_utc": 1615856967,
        "id": "gr2orqo",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615885767.0
    },
    {
        "author": "Shamizzle",
        "body": "I feel you.  If that were one of my plays, I would ride it up until it tests 86ish, and hang on for the 90s or sell if it rejects.  I'm not too optimistic about chip gang breaking out of the funk quite yet, but I've been pissed at all the semicons being so closely tied to the chip shortage.\n\nI only really sell puts on AMD and INTC when I want exposure since I don't care what they do in the near term, i'm just looking for a good entry to dump on a rebound.",
        "created_utc": 1615866841,
        "id": "gr36ozj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615895641.0
    },
    {
        "author": "AmazingSibylle",
        "body": "Imho there is no such thing as forever for individual stocks, only investing with 5-10 year perspective and ~yearly evaluation.\nThe companies, society, economics etc. will change and maybe you keep holding decades and decades but maybe the expected returns or risks change too much and then you rebalance.\n\nFor the coming ~10 years I like DIS, INTC, BABA, RDS, CVS, LMT, VT.\nBut if things change I'll sell or buy without any problem.",
        "created_utc": 1615515173,
        "id": "gqn94yu",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615543973.0
    },
    {
        "author": "vaultboy1963",
        "body": "I hope so, although part of me hopes it continues to slide to a reasonable reentry point.  I sold all my AMD a couple weeks ago, but I still believe in company.  It's got a great CEO, who was executing a good plan on all cylinders and taking advantage of Intel stepping on their own dicks.",
        "created_utc": 1614747820,
        "id": "gpi3thc",
        "score": 3,
        "subreddit": "options",
        "created": 1614776620.0
    },
    {
        "author": "voncletus",
        "body": "Which one of you retards just bought 2mil intel shares?",
        "created_utc": 1615997766,
        "id": "gr91jvx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1616026566.0
    },
    {
        "author": "SpaceBoJangles",
        "body": "Why is AMD sideways? They’re hammering Intel so hard it’s kind of painful to watch and competing with Nvidia outright, not to mention stellar fundamentals and revenue, and yet they haven’t moved since their rally last summer. I completely expected them to keep rising at least for a while, but they’re even going down to September levels.",
        "created_utc": 1617214431,
        "id": "gsxvvod",
        "score": 3,
        "subreddit": "stocks",
        "created": 1617243231.0
    },
    {
        "author": "AlpacaWarMachine",
        "body": "I was able to snag a 60p on Intel just before they turned out the lights on the Bull. Also picked up a couple of UVXY 8.50c",
        "created_utc": 1614870449,
        "id": "gpnqvth",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614899249.0
    },
    {
        "author": "0liBayley",
        "body": "Ahh all makes sense \n\nI’ll add fuel to the fire \n\nThanks for the intel",
        "created_utc": 1614880703,
        "id": "gpoejpz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614909503.0
    },
    {
        "author": "betam4x",
        "body": "supply constraints.\n\nEdit: look at INTC, they are up because no supply issues.",
        "created_utc": 1615228605,
        "id": "gq8mlmn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615257405.0
    },
    {
        "author": "BoringName11",
        "body": "I went with INTC hoping the new ransomware chip would bring the stock up.",
        "created_utc": 1615230599,
        "id": "gq8r95f",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615259399.0
    },
    {
        "author": "RumAndCoco",
        "body": "I bought in at $81 and at $78 on the notion of their new GPU being made and release during a chip shortage, and the new PS5 and Xbox are bound to be in stock soon containing AMD chips and GPU. I've been trying to follow the advice that it's time in the market not timing the market. I had it at $76 in Nov of last year then traded it at $90. I'm hoping for more rise because I do think competition with Intel and the market as a whole is good for everyone. Better tech, better sales, better investments.",
        "created_utc": 1614888831,
        "id": "gpoy2yv",
        "score": 3,
        "subreddit": "investing",
        "created": 1614917631.0
    },
    {
        "author": "GlobbityGlook",
        "body": "After TD Ameritrade placed my paper application in the trash during the March 2020 stock fire sale, I signed up with Merrill Edge and the advisor determined that I was risk adverse, so my opening money was placed in a bank CD that paid two cents through the fall. \n\nBy the time I invested for real, the pandemic stocks were already played out. But then I bought Intel when everyone hated it, so that made up for it a little bit.",
        "created_utc": 1615340875,
        "id": "gqeeatv",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615369675.0
    },
    {
        "author": "Retard_2028",
        "body": "I think all this chip shortage is geopolitics and the nation suppliers are trying to get the new administration’s attention. Or it’s an internal propaganda to fast track and establish a US mfg of chips vs relying on importing them. Even Intel and Qualcomm all rely on overseas mfg of their chips.",
        "created_utc": 1614831281,
        "id": "gpm97zj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614860081.0
    },
    {
        "author": "postblitz",
        "body": "Eh, AMD was NOT a good company. They were clobbered hard by intel and nvidia for a full decade of dirty plays (there are compilation videos available on yt).\n\nThey changed their CEO, shoved tons of money into new architectures and went into debt, put some good products and made good business deals on the end user (while the big bullies were cleaning house in expensive server/enterprise sales) cleaned their debt then PS4 blew up in sales to 100M and they were on board for the ride.\n\nIt was a *huge gamble* to even pay attention, nevermind spend money on enough shares for AMD to blow up. I'd say the sentiment only grew strong when they were @ 20 or so when their chip yields and size decreases promised hella gains. They piggybacked on crypto a while as well, radeon were the best cards to mine with due to nvidia's cuda cores being far fewer in number.",
        "created_utc": 1614818020,
        "id": "gplkajw",
        "score": 3,
        "subreddit": "stocks",
        "created": 1614846820.0
    },
    {
        "author": "LovableContrarian",
        "body": "Intel, I love you. Gonna take these call profits and build a new PC, and I promise I won't use ryzen ever again",
        "created_utc": 1615216886,
        "id": "gq7uwrz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615245686.0
    },
    {
        "author": "Vander_chill",
        "body": "$TSM $AMD  There is a massive chip shortage!\n\nAutomakers have been slowing manufacturing and Toyota shut down its plant in Texas last month.  AAPL has issues keeping supply and it is no longer because of \"trade issues with China\".  There are not enough semiconductor chips to go around.\n\nThe thing is $INTC and $AMD are not chipmakers themselves.  They design and create the blueprint for them but most of the actual manufacturing is done by $TSM.  Look at Taiwan Semi as what a co-packer does in the food industry.\n\nThis is why there were not enough Playstations last Christmas and its official: In 2021 semis have become a far more valuable resource than oil\n\n[TSM 1 year](https://imgur.com/679n2Pp)\n\nThe stock is 10% below its highs, but there is no reason to believe this upward trend won't continue.  They are swimming in cash and business is at full capacity and growing.\n\n...on the actual chip side, $AMD has gotten hammered recently but its prospects for growth are still looking robust.  Their Radeon chip series are the preferred choice for the crypto industry which is only growing.",
        "created_utc": 1614784650,
        "id": "gpjhrlz",
        "score": 3,
        "subreddit": "stocks",
        "created": 1614813450.0
    },
    {
        "author": "ProteinPumpProfit",
        "body": "Intel LEAPS are the move\n\nAlso have small positions in TSLA and CMPS",
        "created_utc": 1617203286,
        "id": "gsx75kt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617232086.0
    },
    {
        "author": "OlManTalksAlot",
        "body": "INTC has the momentum back. They’re a value play and value is in vogue right now, they announced a 20b investment in new plants and capacity - and that they would begin wholesaling. \n\nI think INTC can double",
        "created_utc": 1617048507,
        "id": "gsq3uvd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1617077307.0
    },
    {
        "author": "Skilledthunder",
        "body": "So Intel releases new gen of cpus that are about as good, if not worse, than current Ryzen cpus and both stocks tank? And of course AMD tanks more than Intel?",
        "created_utc": 1617121137,
        "id": "gstck2b",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617149937.0
    },
    {
        "author": "redpurplecornflake",
        "body": "I would hope all the reactionary panic sellers would be flushed out before that. That would be the tactic IMO, get people to jump ship while forcing stop losses to fire off. Our version of long game: hold. Their version: Borrow, sell large volume at once trigger the SL get people to panic, trigger SSR. Rinse and repeat. \n\nI would bear in mind they are likely smart enough to realize this will have diminishing returns over time so there is probably a point after they nickel and dime this down to finally punt it. The stock is so far past fundamentals that its entirely speculative they have identified the strength of the speculation (Apes) and are attempting to systematically destroy sentiment by means they have control of.\n\nLastly, there are other so many other factors no one really knows whats going on. This is being traded around like a holo charizard in a 4th grade cafeteria, nobody knows where it will end up or in what condition. \n\nAt the end of the day hold if you like the stock, like actually hold. Any time you trade to average down or do anything you are giving up a piece of intel. If we were all the stone cold diamond handed retards we claim to be we would have no stop losses, no limit prices just buy records. \n\nBut this is just like, my opinion man, doubt anyone will read it. For me, i like the stock and will hold what i have accumulated.",
        "created_utc": 1615826206,
        "id": "gr111d9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615855006.0
    },
    {
        "author": "im-buster",
        "body": "Intel sold $over 70B worth of semis last year. AMD sold less than $10B.",
        "created_utc": 1615767946,
        "id": "gqyoal3",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615796746.0
    },
    {
        "author": "dunkaroo55",
        "body": "Life must suck with a half empty outlook. Do more DD. This would be very unexpected based on all available intel",
        "created_utc": 1614739110,
        "id": "gpho3ot",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614767910.0
    },
    {
        "author": "ufcstats",
        "body": "Fisker has been around far longer than 2016 and has made cars well before the Ocean.  My good friend literally owns a fisker Karma.  The company went bankrupt and relaunched as Fisker inc.  With all that being said, probably not a bad buy considering they just formulated a deal with Foxconn.  But, there is a lot of FUD going around saying Fisker is partnering with Apple, which I want to reiterate is not true.  Foxconn is a massive corporation with clients such as Microsoft, Intel, Lenovo, HP, Amazon, etc.",
        "created_utc": 1614831595,
        "id": "gpm9rok",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614860395.0
    },
    {
        "author": "GoddamnRelapse",
        "body": "Who's got the intel...are we tanking or mooning after the 1 ET meeting?",
        "created_utc": 1615393310,
        "id": "gqgl2v3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615422110.0
    },
    {
        "author": "Anymeans6",
        "body": "I'm thinking of selling my INTC calls now\n\nBiden bux are going to set the market on a green fire",
        "created_utc": 1615387688,
        "id": "gqg7rm8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615416488.0
    },
    {
        "author": "RaguSpidersauce",
        "body": "Headline123,\n\nIronically, I am in the tech field and I'm weighted lower in tech.  Odd..  I've never thought about it.\n\nI am boring:\n\nIndex funds = 62%\n\nMaterial = 0%\n\nIndustrial = 11% (my employer's sector)\n\nFinancial (BRKB) = 2%\n\nEnergy (CVX) = 2%\n\nConsumer Discretionary (EXPE, IAC, LYV, MTCH, etc.)= 4%\n\nInformation Technology (CSCO, INTC) = 2%\n\nCommunications Services (DIS) = 4%\n\nReal Estate (O) = 4%\n\nHealth Care (JNJ, PFE) = 2%\n\nConsumer Staple (HD, WMT) = 6%\n\nUtility (PNW) = .6%",
        "created_utc": 1614727554,
        "id": "gph1nq2",
        "score": 3,
        "subreddit": "stocks",
        "created": 1614756354.0
    },
    {
        "author": "topdangle",
        "body": "AMD used to be undervalued. They may be slightly undervalued now due to people cashing out during this mining craze in preparation for the inevitable flood of used cards coming back into the market and killing revenue, but they're still floating around the right price looking at TSMC's capacity and AMD's forward projections. AMD themselves are looking at 2025 before they grow past their current value. If you're just talking memes I guess they have room to grow but I think sentiment has been turning against them due to absurd GPU prices.\n\nSaying amd is the most innovative graphics card company is just plain crazy. They caught up to nvidia in raster performance thanks to completely dropping their compute architecture in favor of raster performance, yet they're only about nvidia level of performance even after losing significant efficiency in compute. Meanwhile you've got nvidia slapping on RT/Tensor with every gpu, codeveloping PAM4 memory and somehow managing to still provide similar raster. Catching up to your competitor by stripping utility is not innovative.\n\nIf anything AMD is being carried by its innovative CPU designs pushing chiplets years before intel while intel is praying 3dstacking closes the gap. Their GPU division however just constantly struggles and has yet to ship a competitive instinct GPU. They've basically given up on competing with nvidia in enterprise and instead are taking intel's scientific compute market with high FP64 gpus. It's led to some big supercomputer wins but overall their GPU division hasn't pushed the envelope since the 290x. Honestly I'm surprised that cray believes they will ship Frontier on schedule since AMD's instinct GPUs barely even exist, but they said they're on schedule so maybe AMD's gpu division has bigger improvements on the horizon for 5nm.",
        "created_utc": 1614801026,
        "id": "gpkjqrm",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614829826.0
    },
    {
        "author": "Redman2009",
        "body": "Math and good intel",
        "created_utc": 1615326408,
        "id": "gqdlscb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615355208.0
    },
    {
        "author": "PingPongPeco",
        "body": "Not even a 2bn fine can stop INTC 😂 63 EOW",
        "created_utc": 1615217287,
        "id": "gq7vskr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615246087.0
    },
    {
        "author": "urraca",
        "body": "Buying this AMD dip....dropping because INTC is having a press conference in a week. Plzzzzz",
        "created_utc": 1615999503,
        "id": "gr95gu0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1616028303.0
    },
    {
        "author": "Foman1231",
        "body": "Semiconductors is the play for long-term. Once supply chain gets back on track they're going to be selling to every manufacturing industry in the world, and manufacturing in general is going to rip as COVID recovery continues. AMD, NVDA, TSM, INTC, and ON are all solid plays. Do your own DD but I like AMD the most.\n\nDisclosure: Long shares and LEAPS on all 5 of these tickers",
        "created_utc": 1615842891,
        "id": "gr22lz8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615871691.0
    },
    {
        "author": "Slyx37",
        "body": "This entire sub is full of mouth breathers who will die on their hill of illogical nonsense. Ignore them and thank them for the cheap shares, they'll be the same windowlickers providing liquidity chasing price on the way up. \n\nThey'll say they won't, because they're experts who only make the most efficient of moves, it's why they're on Reddit, as opposed to being a loser who works in the professional capacity with real knowledge of financial markets. \n\nJust keep buying the goods and thank them later. Sincerely someone who said the same things when Plug was at 1.37, Nio at 3, Snap at 5, Atvi at 44, and Intc at 44 (and plenty more)  Everyone had no problem telling me how wrong I was. Refused to listen, regurgitated bullshit from YouTube videos, etc\n\nYou can't fix or help stupid, but you can take its money over and over again. Be thankful, because its much harder to make money when the collective isn't full of idiots.",
        "created_utc": 1615921932,
        "id": "gr5l9kv",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1615950732.0
    },
    {
        "author": "ThatLawTalkinGuy",
        "body": "Ultimately, the CEO change was the catalyst for me. The risk-reward proposition is good. If a turnaround is effectuated, it has the potential to 3x in order to trade in line with its peers. At 12 times earnings and a 2%+ dividend, the stock is cheap, so the downside risk is minimal. INTC's legacy PC-centric business is growing, but it doesn't trade like it (the market just assumes that PCs are a dead growth category). And you get the faster-growing data center, self-driving MobilEye, and all the Intel VC businesses. MobilEye is particularly exciting. As a standalone business, I believe it would trade at something like a $25 billion market cap in this market - maybe higher.",
        "created_utc": 1615312899,
        "id": "gqcrveh",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1615341699.0
    },
    {
        "author": "cdawwgg43",
        "body": "I have Chevron, Marathon, and Exxon. I am going to do some DD tonight and look at fuel oil after my shift and come up with a better game plan.\n\nBTW Still long on RCL JETS AAL UAL AMC and INTC",
        "created_utc": 1614895147,
        "id": "gppcuh1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614923947.0
    },
    {
        "author": "moneygardener",
        "body": "AMD. Almost nothing but tailwinds. Stock still down during the last couple months. INTC has almost nothing but headwinds, and has had a pretty good couple of months in the market.\n\nDisclaimer. Not financial advice. Do own research. Etc etc. I am long AMD approx 2 years.",
        "created_utc": 1614884615,
        "id": "gponvhf",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614913415.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "AMD is hurt by the chip shortage, once that is past they should recover.\n\nBut short term they might stay down. Luckily, they're one of the causes of the chip shortage, since they were selling out in the summer and putting in big orders, so while it hurts their stock now, they're still doing fine fundamentally.\n\nI'm actually down 18% on AMD, and unbothered. But I do some firmware engineering and I'm really thinking the Xilinx tech is going to be integrated to speed up i/o on new datacenter offerings that will come out in a few years. Normally I only care about technicals, but this one I really think is going to do well in the 2-5 year range. I don't hear any analysts saying that they're buying Xilinx to use the tech, everybody seems to think they're just doing it defensively because Intel bought Altera.👼",
        "created_utc": 1615260521,
        "id": "gqafptq",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1615289321.0
    },
    {
        "author": "PingPongPeco",
        "body": "INTC only goes up 😍",
        "created_utc": 1615301211,
        "id": "gqbylpu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615330011.0
    },
    {
        "author": "BrokeDayTrader",
        "body": "Damn Im really wasting 6 hours of my life everyday watching a chart go red and green.... who’s ready to do it again tomorrow?",
        "created_utc": 1614718858,
        "id": "gpgiqjl",
        "score": 297,
        "subreddit": "wallstreetbets",
        "created": 1614747658.0
    },
    {
        "author": "jaxpied",
        "body": "I've posted this this morning already, but once again the math checks out so i'll repeat myself: \n\n \n\nHistory repeats itself (GME)\n\nThe last \"squeeze\" runup looks just like this time\n\n1/11/21 / 19.94 || 2/22/21 / 46.00\n\n1/12/21 / 19.95 || 2/23/21 / 44.97\n\n1/13/21 / 31.40 || 2/24/21 / 91.71\n\n1/14/21 / 39.91 || 2/25/21 / 108.73\n\n1/15/21 / 35.50 || 2/26/21 / 101.74\n\n1/19/21 / 39.36 || 3/1/21 / 120.41\n\n1/20/21 / 39.12 || 3/2/21 / 118.00 (&lt;-Update)\n\n1/21/21 / 43.03 || 3/3/21\n\n1/22/21 / 65.01 || 3/4/21\n\nSqueeze 💎 🚀💎 🚀 💎 🚀💎 🚀\n\nprice moves just like it did last time. We're gonna moon bois! So proud of y'all!",
        "created_utc": 1614719038,
        "id": "gpgj5no",
        "score": 109,
        "subreddit": "wallstreetbets",
        "created": 1614747838.0
    },
    {
        "author": "bacha03",
        "body": "Bought RKT at $40 because I’m an idiot cant wait to sell it when it dips tomorrow",
        "created_utc": 1614719099,
        "id": "gpgjapm",
        "score": 101,
        "subreddit": "wallstreetbets",
        "created": 1614747899.0
    },
    {
        "author": "KirokeHarper",
        "body": "TO EVERYONE WHO POSTED DD ON THIS PLAY--\n\nTHANK YOU.\n\nHonestly. I'm not at a point right now where I know how to do my own DD. And reading is still really hard for my smooth brain. But I saw the DD on this yesterday, I read it all, and I realized  I was a little late to the game but I played today anyway.\n\nIt's not much but I turned a $600 investment into $1200 today. I now own 14.77 shares of RKT at avg 39.61 AND ALL OF IT IS HOUSE MONEY. This feels like a big win for me, so I just wanted to give my thanks for the DD on this play.",
        "created_utc": 1614718977,
        "id": "gpgj0o4",
        "score": 89,
        "subreddit": "wallstreetbets",
        "created": 1614747777.0
    },
    {
        "author": "dadamoi",
        "body": "GUYS!!!!!!!!!!!!!!!!!!!!!!!! DO NOT CHANGE TO RKT MOST OF US HERE HAVE NEVER HEARD OF IT UNTIL THE MODZ HAVE DECIDED TO PIN THEIR MEGATHREAD I MEAN LOOK THEY HAVE 98 UPVOTES FOR 9MILLION MEMBERS HERE!!! DO NOT BE DUMB! HF's ARE TRYING TO DIVIDE OUR ATTENTION. IF YOU HAVE READ THE ART OF WAR ( YOU PROBABLY HAVENT YOU APES ) THE BEST WAY TO CONQUER A NATION IS TO INTERNALLY DIVIDE IT'S FORCE!!!\n\nWE ARE SO CLOSE TO THE MOTHER OF SQUEEZES DO NOT FALL FOR THEIR TACTICS\n\nDO NOT LISTEN TO ME IM UNRILIABLE",
        "created_utc": 1614719325,
        "id": "gpgjtkx",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1614748125.0
    },
    {
        "author": "GTKFANL",
        "body": "RKT is a different situation than GME. It's not the ultra-mega-gamma-squeeze-to-end-all-squeezes. It is a good stock priced below its value and has experienced some catalyst events pushing it higher with a higher-than-usual percentage of float shorted. I wouldn't be surprised if it runs to $35 - $40 a share by Friday, but I wouldn't hold it any higher than that. Yes, there is always a chance it can explode one day and good for you if you catch it, but don't buy at $60. That's all!",
        "created_utc": 1614705848,
        "id": "gpfod6e",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1614734648.0
    },
    {
        "author": "fleischbag",
        "body": "It's easy to upvote when it isn't your money. +1",
        "created_utc": 1614703009,
        "id": "gpfhusf",
        "score": 76,
        "subreddit": "wallstreetbets",
        "created": 1614731809.0
    },
    {
        "author": "Imsuperracist",
        "body": "Gme is currently 87% of my portfolio... if my smooth brain is correct I think I should make it 100% right?",
        "created_utc": 1614714594,
        "id": "gpg8p3t",
        "score": 71,
        "subreddit": "wallstreetbets",
        "created": 1614743394.0
    },
    {
        "author": "sshro13",
        "body": "Anyone bitching about this play not being GME: one of the most important rules of trading is to not fall in love with a stock. We are all here to make money. Take a second to look at the facts about why RKT is a good play. It is a much more surefire way to tendie town than GME currently is. Option prices were dirt cheap yesterday, and still pretty cheap compared to GME. This is about making money, period. Be smart.",
        "created_utc": 1614705043,
        "id": "gpfmiv0",
        "score": 70,
        "subreddit": "wallstreetbets",
        "created": 1614733843.0
    },
    {
        "author": "Punch_Your_Facehole",
        "body": "If GME doesn’t like $130 then let’s just skip it and go to $140",
        "created_utc": 1614708039,
        "id": "gpfteqw",
        "score": 62,
        "subreddit": "wallstreetbets",
        "created": 1614736839.0
    },
    {
        "author": "MyPostIs",
        "body": "Guys - last week at this time, GME was trading at $43. We're trading at 300% over last week. We're crushing it, stay calm!",
        "created_utc": 1614709948,
        "id": "gpfxt5o",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1614738748.0
    },
    {
        "author": "Lecture_Several",
        "body": "WTF THIS IS THE BIGGEST APE MOVE IVE SEEN\n(LOVE IT)",
        "created_utc": 1614702949,
        "id": "gpfhptn",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1614731749.0
    },
    {
        "author": "Gnomish8",
        "body": "Stock falls 1% since open while still up 100% from last week...\n\n\"Ahhh, it's red, I can't take it anymore!!\"\n\nPaper handed bitches. Get off my rocket and make space for some worthy astronauts.",
        "created_utc": 1614718741,
        "id": "gpgig9v",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1614747541.0
    },
    {
        "author": "uncowisdo",
        "body": "no one ever went broke taking a profit. save it for the next company to squeeze, wsb dd is a gold-mine",
        "created_utc": 1614718351,
        "id": "gpghii5",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1614747151.0
    },
    {
        "author": "nonflexual",
        "body": "you'll be the one making money while they watch once it squeezes. just gotta be patient enough to hold till that happens:)",
        "created_utc": 1614719315,
        "id": "gpgjso5",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1614748115.0
    },
    {
        "author": "Sabiis",
        "body": "I had $110 leftover so I couldn't buy another GME. What'd I do? Bought RKT, flipped it to $138 and bought another GME!",
        "created_utc": 1614713115,
        "id": "gpg5a4g",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1614741915.0
    },
    {
        "author": "trufflebutteredsteak",
        "body": "WE WE WERE WARNED 2 DAYS AGO THAT THE SENTIMENT WOULD CHANGE AROUND HERE. RKT IS A DISTRACTION, LIQUIDATING GME NOW TO BUY RKT IS BASICALLY GIVING UP ON THE HARD WORK THAT YOU AND ALL OF OF THE APES INVOLVED HAVE PUT IN.  HOLDING COST **NOTHING** BUT NO ONE SAID IT WOULD BE EASY. WE HAVE APES WE PROMISED TO PICK UP AT 300+, I'M KEEPING MY END.",
        "created_utc": 1614717174,
        "id": "gpgeq2l",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1614745974.0
    },
    {
        "author": "Rick-afk",
        "body": "Gotta mention the flood of bot accounts just telling to buy it, Silver 2.0",
        "created_utc": 1614716446,
        "id": "gpgd02u",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1614745246.0
    },
    {
        "author": "BiteMyShinyMetalAth",
        "body": "The way i look at it, chasing profits after 200% already seems pretty greedy.  Getting that type of trading in your mindset has bad news all over it, id rather leave 1200 on the table than see a % 200 profit and think 'ahh yeah i can get this bitch to 1500%', and then lose it all, plus your investment.\n\nmaybe a more experience fella woulda known to hold these longer, but ay, im not experienced so ill take my 200%.",
        "created_utc": 1614717178,
        "id": "gpgeqe9",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1614745978.0
    },
    {
        "author": "jaxpied",
        "body": "I posted this this morning already but I just want to let you know that it looks like THIS is exactly what's happening:\n\n \n\nHistory repeats itself (GME)\n\nThe last \"squeeze\" runup looks just like this time\n\n1/11/21 / 19.94 || 2/22/21 / 46.00\n\n1/12/21 / 19.95 || 2/23/21 / 44.97\n\n1/13/21 / 31.40 || 2/24/21 / 91.71\n\n1/14/21 / 39.91 || 2/25/21 / 108.73\n\n1/15/21 / 35.50 || 2/26/21 / 101.74\n\n1/19/21 / 39.36 || 3/1/21 / 120.41\n\n1/20/21 / 39.12 || 3/2/21 &lt;-we are here\n\n1/21/21 / 43.03 || 3/3/21\n\n1/22/21 / 65.01 || 3/4/21\n\nSqueeze 💎 🚀💎 🚀 💎 🚀💎 🚀\n\nbased on this, today might be the last chance to buy low. (not financial advice)",
        "created_utc": 1614711976,
        "id": "gpg2l9p",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1614740776.0
    },
    {
        "author": "JiggazInParis",
        "body": "# I see this as a win, think about it. On a day where another stock had so much attention (some would call it a pump &amp; dump, not naming any names tho) we still managed to hold the line. Good work apes",
        "created_utc": 1614719010,
        "id": "gpgj3cc",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1614747810.0
    },
    {
        "author": "unholyg0at",
        "body": "Fuck it. Sold all my AMC and went all in on GME. Maybe AMC shouldn’t have given their execs millions in bonus after we rallied and save their asses. Fuck em",
        "created_utc": 1614708829,
        "id": "gpfv7m4",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1614737629.0
    },
    {
        "author": "anchelus",
        "body": "Robinhood. But I don't recommend it. Try schwab or fidelity instead. Or tastyworks for options",
        "created_utc": 1614718406,
        "id": "gpghndz",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1614747206.0
    },
    {
        "author": "KnockKnock200",
        "body": "I paper handed it. Need to make up for buying GME at 380 and selling at 170 like a little bitch.",
        "created_utc": 1614719149,
        "id": "gpgjeuc",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1614747949.0
    },
    {
        "author": "Datboiicarl69",
        "body": "Was RKT a distraction from GME? Maybe. But jokes on them I made 80% profit from RKT and put it right back into GME. They underestimate my retardedness",
        "created_utc": 1614713495,
        "id": "gpg65rf",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1614742295.0
    },
    {
        "author": "Battle-Santa",
        "body": "Congrats RKT gang!!\n\nI’m not in it, but MAKE THAT MONEY!!!!\n\nHappy for you fucks",
        "created_utc": 1614719498,
        "id": "gpgk8da",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1614748298.0
    },
    {
        "author": "GoAbsoluteApesh1t",
        "body": "Listen to me. I know how you feel. \n\nYou see it dip. You read some comments. Nasty comments. People are gonna bail. They are typing some shit about shares available to short is going up, shit our nutbrains barely understand, but it sounds clever, they seem to know what they're talking about. \n\nBut you forget one thing. One fundamental thing.\n\nDFV is still in. 98% people in here are holding, we just don't care about writing it all the time. We are with you, son. DFV is with you. Don't listen to the negatives, remember the fundamentals.",
        "created_utc": 1614711512,
        "id": "gpg1huz",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1614740312.0
    },
    {
        "author": "kytran40",
        "body": "Upside down gives you the same chart. Turn it 90 degrees",
        "created_utc": 1614705247,
        "id": "gpfmzl8",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1614734047.0
    },
    {
        "author": "poopybumbum1",
        "body": "if gme closes above 500 by end of week, I will donate 2000 dollars to St. Jude's. If it closes above 800, I will give 5000 dollars to St. Jude's. I will post proof as well.",
        "created_utc": 1614702901,
        "id": "gpfhm1k",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1614731701.0
    },
    {
        "author": "cwalzzzer",
        "body": "Do you guys not realize that moving from GME to RKT is exactly what the hedgies want?!? Divide and conquer. Don’t fall for it. Stick with GME and we will go to the moon!!",
        "created_utc": 1614716098,
        "id": "gpgc75h",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1614744898.0
    },
    {
        "author": "Space_Captainface",
        "body": "funny as AMC shot up 80% and nothing on the news...RKT goes up 40% and the system shits itself. the new WSB regime is pushing RKT and encouraging sells of AMC to buy RKT, while AMC has less than 4% volume left to buy. i wouldnt trust it either. profit if you can but this isnt the gamma people think it is.",
        "created_utc": 1614716484,
        "id": "gpgd3az",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1614745284.0
    },
    {
        "author": "hibbjibbity",
        "body": "It’s seems like half the people are cool as cucumber and expecting to moon around the 19th, the other half wanna cut their eyes out every second it doesn’t go up a thousand dollars lol",
        "created_utc": 1614715582,
        "id": "gpgb081",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1614744382.0
    },
    {
        "author": "Mackie5Million",
        "body": "Preface: this is not financial advice.\n\nThe past hour or so has been dominated by aggressive shorting of the stock.  [Borrowdesk](https://iborrowdesk.com/report/RKT) is tracking the available short shares, which are quickly diminishing.  Once there are none left, short sellers won't be able to force the market down anymore.\n\nDiamond hands, people.  This has happened before - it can happen again.",
        "created_utc": 1614714518,
        "id": "gpg8ipe",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1614743318.0
    },
    {
        "author": "brybull1970",
        "body": "Made $4k on RKT today and am dumping it into GME at the dip!",
        "created_utc": 1614718140,
        "id": "gpgh082",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1614746940.0
    },
    {
        "author": "CheeseYogi",
        "body": "It was only a small second mortgage of $30k (10% of my home value). Once GME gets back to 350, I’m good.",
        "created_utc": 1614716517,
        "id": "gpgd60c",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1614745317.0
    },
    {
        "author": "trippy_fingernails",
        "body": "I hold GME and RKT, why are so many apes acting like it has to be one or the other lmao y'all are so stupid",
        "created_utc": 1614704111,
        "id": "gpfkdvr",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1614732911.0
    },
    {
        "author": "heyzeuzz",
        "body": "Maybe. It's not quite ready yet. I'm still tuning the algorithm. It gets some things wrong, but I've seen an increase in better alerts lately as I improve it. With this and a few other alerts the last 3 weeks I've made close to $200k in profit. Would people be interested in using my bot?",
        "created_utc": 1614718138,
        "id": "gpgh03e",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1614746938.0
    },
    {
        "author": "_Atom_5",
        "body": "Should I say fuck it and make my portfolio 100% Gamestonk??",
        "created_utc": 1614705973,
        "id": "gpfonnx",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1614734773.0
    },
    {
        "author": "perfecto_falcon",
        "body": "well fuck it seriously considering selling off the weed stocks and emptying the moneymarket acct to buy more GME. i guess i just REALLY LIKE THE STOCK.",
        "created_utc": 1614709864,
        "id": "gpfxm9n",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1614738664.0
    },
    {
        "author": "Skywalk88",
        "body": "He saves bro! My cousin did it. My cousin had 4 houses by the time he was 3.",
        "created_utc": 1614713900,
        "id": "gpg73bv",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1614742700.0
    },
    {
        "author": "One_Wafer_45",
        "body": "I did it guys sold for 10% loss on AMC FOR POTENTIAL 1000% GAIN IN GME! 🚀🚀",
        "created_utc": 1614705827,
        "id": "gpfobfi",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1614734627.0
    },
    {
        "author": "YellowCity",
        "body": "Just a quick bitching vent for some of you guys - \n\nIBORROWDESK JUST ADDED MORE SHARES TO SHORT AND THE NUMBER HAS NO RELEVANCE. **IT DOES THIS EVERY FUCKING DAY YET YOU GUYS CONTINUE TO USE IT AS A CATALYST OF ANYTHING!!!** 100,000 SHARES, 1 MIL SHARES, 50 SHARES, IT DOESN'T MATTER AT ALL\n\nJUST STOP! Ignore any and all iborrow data as being beneficial, or any type of catalyst for us.",
        "created_utc": 1614709820,
        "id": "gpfxikh",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1614738620.0
    },
    {
        "author": "sadboyz00",
        "body": "Stop the BS comments about ‘200 EOD’ 😂\n\nThis is making people sell when it dips\n\nTRUST THE DD AND ENJOY THE RIDE",
        "created_utc": 1614713158,
        "id": "gpg5dpb",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1614741958.0
    },
    {
        "author": "ak47ps16",
        "body": "YOUR RKT GAINS ARE AWESOME BUT REALIZE IT WAS ONLY PUMPED BY HEDGIES TO DISTRACT FROM GME. IF YOU TAKE YOUR GAINS FROM RKT AND HEAD TO GME YOU BECOME THEIR WORST NIGHTMARE. 80% OF THE REDDITORS ON THE RKT THREAD ARE BOTS TELLING YOU TO HOLD UNTIL NEXT WEEK SO NO MORE SHARES OF GME ARE BOUGHT. THINK WITH YOUR SOFT 🧠 AND RISE UP AMONGST THE REST OF THE PLANET OF THE APES\n\n🦍🦍🦍💎💎💎🚀🚀🚀💎💎💎🦍🦍🦍",
        "created_utc": 1614714290,
        "id": "gpg7zuh",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1614743090.0
    },
    {
        "author": "Chickenfrend",
        "body": "Yes lmao. Especially in the context of the other 20k you somehow accumulated. You are a rich kid. It's okay, you should just acknowledge it and be honest about it though",
        "created_utc": 1614711366,
        "id": "gpg15hg",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1614740166.0
    },
    {
        "author": "jessicavotingacc",
        "body": "Not bashing RKT, but does anyone find it weird that they have a pinned mega thread and our mega thread was late today?\n\nAlso our thread isn’t pinned now and the mod pins his post linking the RKT mega thread in OUR mega thread???",
        "created_utc": 1614705057,
        "id": "gpfmjz2",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1614733857.0
    },
    {
        "author": "Xadma24",
        "body": "Buy RKT if you think it'll go higher. But selling GME at a loss to buy RKT, while it's already shot up, is a bad thing to do. You're buying high, selling low.\n\nIf you believe in the GME squeeze, keep holding. Otherwise, you'll have FOMO regrets once it shoots up to 500+.",
        "created_utc": 1614714186,
        "id": "gpg7r86",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1614742986.0
    },
    {
        "author": "New_Assignment_5486",
        "body": "To state the obvious RKT is a distraction. Only boomers would choose a “rocket ship” ticker and drive the price up to try to confuse retarded apes with something shiny. If I was to guess the powers that be are somehow using it to profit to use those funds to further short our stonk. At the very least they are trying to pull us off our beloved GME trip to VALHALLA.  Fuck them. Together ape strong. HODL. 🦍🦍🦍🚀🚀🚀💎💎💎",
        "created_utc": 1614713939,
        "id": "gpg76mw",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1614742739.0
    },
    {
        "author": "P_RYDA",
        "body": "Omg it dipped. The squeeze is over omg omg\n\nLol yall need to stfu and hold",
        "created_utc": 1614718085,
        "id": "gpggvg8",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1614746885.0
    },
    {
        "author": "Greatjones213",
        "body": "Yeah, literally ate up 2 weeks of my life. Had to constantly check fidelity and the news. Not worth it for me.",
        "created_utc": 1614716593,
        "id": "gpgdce4",
        "score": 33,
        "subreddit": "stocks",
        "created": 1614745393.0
    },
    {
        "author": "CalebH428",
        "body": "I don’t get why people get mad about RKT. Not only does it have legit reasons to buy in, but it has been mentioned around WSB since IPO. This is just the first time it’s had any movement in awhile",
        "created_utc": 1614704966,
        "id": "gpfmcht",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1614733766.0
    },
    {
        "author": "GR8NBED11",
        "body": "I just need it to be known that I literally wiped out every stock I have to buy GME the last few weeks. It's been a hell of a ride but I'm officially all in. Keep it up APES and believe in the process. Buy stocks/shares not options right now. They need them...all of them. This is the way. HODL\n\nNot financial advice just a green crayon eating AuTiSt",
        "created_utc": 1614709386,
        "id": "gpfwi4m",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1614738186.0
    },
    {
        "author": "Evening-General",
        "body": "$120 floor is triple what it was like...a week and a half ago. Pretty sweet.",
        "created_utc": 1614715589,
        "id": "gpgb0rd",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1614744389.0
    },
    {
        "author": "jaxpied",
        "body": "Guys stop saying R.,K,.-.,T. Our boomer Mods think they deserve a thread because it got mentioned so much yesterday. Even though interest in GME is obv way higher (see upvotes and outcry after we almost didn't get a thread). The gay bear stock is just a distraction to try and get us off GME so they can save their powdered asses. Just look at that thread. It's all shills it's ridiculous. GME Apes stronk!",
        "created_utc": 1614715955,
        "id": "gpgbv81",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1614744755.0
    },
    {
        "author": "Columbian-Roaster",
        "body": "Wtf I just got notified by Trading 212 that RKT got 50% up and that CNBC says that it may be a ‘Reddit short target’ 😂\n\nThis shit is fucking orchestrated. What broker announces you about that..",
        "created_utc": 1614714416,
        "id": "gpg8a9z",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614743216.0
    },
    {
        "author": "Puzzleheaded-Team677",
        "body": "This whole GME saga the last few months makes me feel like I’m some kind of market genius, but I’m actually just fucking retarded, and I love it",
        "created_utc": 1614708968,
        "id": "gpfvj9k",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614737768.0
    },
    {
        "author": "SontagWrong",
        "body": "So they made a RKT megathread...\n\nPINNED IT...\n\nwhile this thread is still sorted by \"best.\" \n\n# THEY ARE TRYING TO KEEP US DOWN. DO NOT LET EM",
        "created_utc": 1614705711,
        "id": "gpfo1xs",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614734511.0
    },
    {
        "author": "Hokguailo",
        "body": "I took the biggest lost of my life in October in SPAQ. Now it has tripled in price. I learned my lesson. Never sell your SPACS during a market correction like this, it will rebound, but will take some patience.",
        "created_utc": 1614715444,
        "id": "gpgaonr",
        "score": 31,
        "subreddit": "SPACs",
        "created": 1614744244.0
    },
    {
        "author": "findspeopleforfun",
        "body": "Why did GME's price **quadruple in the span of a day** last week AFTER the biggest players in the game attempted for weeks to snuff it out? To not only resist dropping back to early January numbers after being illegally manipulated by the most powerful investors in the world, but rather **QUADRUPLE** in the face of this adversity is the most blatant sign that it's still a great investment to literally anyone who's not an absolute dog brained retard. Even a child with Downs syndrome could look at the absurdly lopsided ask prices for GME calls vs puts, which as of right now show that **$500 calls are worth the same amount as $66 puts,** and see with absolute clarity how bullish the market is for this stock. Even boomer analysts and extremely popular trading platforms are bullish on GME. Anyone still shilling silver and weed, get Melvin's dick out of your mouth and get in on this historically massive bull run you apes.",
        "created_utc": 1614703416,
        "id": "gpfis92",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1614732216.0
    },
    {
        "author": "thedizzycat",
        "body": "I'm not personally invested in this, but it has been absolutely compelling reading over the past few weeks. You people are absolute heroes with what you are doing. and If I had money to lose I would be right beside you. Enjoy the ride and I hope your dreams come true.",
        "created_utc": 1614704752,
        "id": "gpflv1x",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614733552.0
    },
    {
        "author": "gargully",
        "body": "OP did you work full time while in high school? 20k a year works out to about $9.50 an hour working 40 hours a week full time. And that’s literally not spending a fucking dime. That’s some true fucking diamond hands on cash and then betting it all on black? Savage",
        "created_utc": 1614713837,
        "id": "gpg6y74",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614742637.0
    },
    {
        "author": "fortifier22",
        "body": "If DFV and Cohen can hold at $480, we can hold as well.\n\nIf you bought GME at any price, you believed in the stock and in the company.\n\nDon’t let your belief waiver! You ride until it is done!",
        "created_utc": 1614716910,
        "id": "gpge3cp",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614745710.0
    },
    {
        "author": "sadboyz00",
        "body": "PEOPLE stop making up false bs about ‘this is going to blow EOD’ or ‘squeeze end of week’\n\nThis discourages newbies who invest and do not get these results.\n\nTRUST THE DD AND LETS KEEP IT POSITIVE",
        "created_utc": 1614707082,
        "id": "gpfr6ys",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614735882.0
    },
    {
        "author": "Nerdicane",
        "body": "Line it up! Let’s go!",
        "created_utc": 1614718900,
        "id": "gpgiubk",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614747700.0
    },
    {
        "author": "baconara",
        "body": "Found people wondering why RKT had 3x the volume of GME but it wasn't \"squeezing right\".\n\nFor RKT folks browsing this megathread: it won't squeeze the same because RKT is an artificial squeeze - engineered by the CEO. It's not an organic squeeze. GME was years in building. \n\nRKT looks like a fish, swims like a fish, but when you go to eat it you realize it's a robot fish. Same amount of fun fishing, though.",
        "created_utc": 1614718782,
        "id": "gpgiju3",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614747582.0
    },
    {
        "author": "Saxamaphooone",
        "body": "I want to thank everyone in these threads for helping me get through my days. I only have 7 shares @169, but I’m hoping any profits help pay some medical bills. \n\nI found out a month ago why I’ve been so sick over the past year: I have a tumor in my brain growing on my pituitary gland. The type of tumor it is means it’s likely non-cancerous (thankfully), but it secretes hormones which causes hormone imbalances, migraines, and weird vision issues. I spend weeks at a time trapped in my bed, unable to move or eat solid food without throwing up. Reading this sub and these threads makes those days a little easier!",
        "created_utc": 1614708321,
        "id": "gpfu1vq",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614737121.0
    },
    {
        "author": "Slothe1978",
        "body": "Aw, but the bills to pay it back are",
        "created_utc": 1614703897,
        "id": "gpfjw4h",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614732697.0
    },
    {
        "author": "SpeaksInHexadecimals",
        "body": "Remember, the second CNBC mentions this, you sell. Then buy back when they stop mentioning it. That is the way.",
        "created_utc": 1614703955,
        "id": "gpfk0w0",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614732755.0
    },
    {
        "author": "0wl-Exterminator",
        "body": "At this point its almost like theyve given up on pushing it way down and are just hoping they keep it exactly where it was lmao",
        "created_utc": 1614717307,
        "id": "gpgf1eb",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614746107.0
    },
    {
        "author": "jessicavotingacc",
        "body": "Not bashing RKT, but does anyone find it weird that they have a pinned mega thread and our mega thread was late today?\n\nAlso our thread isn’t pinned now",
        "created_utc": 1614704932,
        "id": "gpfm9pt",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614733732.0
    },
    {
        "author": "HeavyHandedWarlord",
        "body": "LPT: If you refresh the GME daily thread every 30 seconds it helps the price go up",
        "created_utc": 1614702695,
        "id": "gpfh5ag",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1614731495.0
    },
    {
        "author": "Pryml710",
        "body": "If GME hits $220 EOD I’ll literally shit myself - hold me to it retards🚀",
        "created_utc": 1614701396,
        "id": "gpfe80z",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614730196.0
    },
    {
        "author": "lampingninja",
        "body": "Don't succumb to the RKT craze, bots &amp; shills are doing everything they can to make it look appealing to distract us apes from the real show.   \n\n\nHODL &amp; BUY THE DIPS!!!",
        "created_utc": 1614712454,
        "id": "gpg3q1y",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614741254.0
    },
    {
        "author": "TRUFFL3PIG",
        "body": "DO NOT SELL WHEN $RKT EXPLODES IN THE MORNING. IT IS JUST THE BEGINNING",
        "created_utc": 1614719027,
        "id": "gpgj4q8",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614747827.0
    },
    {
        "author": "Myasshurts12001",
        "body": "If it hits $200 today I will go to taco bell, order 12 beef burritos, take 10 ex laxs, vomit 200 on the wall, post it on reddit.",
        "created_utc": 1614706172,
        "id": "gpfp447",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614734972.0
    },
    {
        "author": "Successful_Prize_904",
        "body": "If it hits 50 I’m getting a tattoo",
        "created_utc": 1614713644,
        "id": "gpg6i7d",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614742444.0
    },
    {
        "author": "XVDev",
        "body": "# Paper hands leave if you want, don’t complain when it hits $60-100 tomorrow\n\nHolding my calls overnight , don’t care if i lose it all",
        "created_utc": 1614712573,
        "id": "gpg406q",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614741373.0
    },
    {
        "author": "muggbeert",
        "body": "Rkt has its own thread surprisingly, but they’re still in here pumping it 🤔🤔 says a a lot",
        "created_utc": 1614712585,
        "id": "gpg417b",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614741385.0
    },
    {
        "author": "pastrybaker",
        "body": "Is anyone else pretty impressed that it's holding at these levels even though it's off the SSR today? \n\nAccording to [https://iborrowdesk.com/report/GME](https://iborrowdesk.com/report/GME), there was some big shorting going on this morning through Interactive Brokers. So, we could assume the same was happening with other brokers. At the same time, I know that at least TDA isn't allowing short selling of GME at all (was on the phone with them the other day, and the guy told me they haven't allowed it since the end of January).\n\nStill, the price has not only held, but risen pretty significantly today. I'm having a hard time seeing the downside to continuing to hold, I just don't think it's a wise thing to sell at this point. The gamma squeeze seems like it'll happen, the short squeeze is likely too. And even if it's not, the company is pivoting and may become a big player in the years to come. All those things are why I will keep holding.\n\nAt the same time, if you haven't covered your initial investment, please do so. I sold off enough at the end of January to pay off almost $50k of CC debt and to have a bit leftover to provide for me and my kids. Now I'm playing with house money, so it's easier for me to weather the dips.\n\nI'm holding 307 shares @ \\~$70 per share. I also have a 17 calls for different dates.",
        "created_utc": 1614701474,
        "id": "gpfeebn",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614730274.0
    },
    {
        "author": "doctordesktop",
        "body": "If it hits 150 today i'll buy the winrar full version",
        "created_utc": 1614711881,
        "id": "gpg2d9q",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1614740681.0
    },
    {
        "author": "h4wk1ns",
        "body": "Congrats to anyone that took profits today. \n\nRemember, this shit is volatile as fuck and could come back down at any time. I’m playing this like it could be running all week, but who knows. Just remember to celebrate gains and own your losses.",
        "created_utc": 1614719363,
        "id": "gpgjwps",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614748163.0
    },
    {
        "author": "CallsonBobRoss2024",
        "body": "Am I perfect? No. Do I hold? You fuckin know it. Met a paper handed bitch in real life once. He was sucking dick for pocket change. Scary stuff. \n\n🖐🏼💎",
        "created_utc": 1614715616,
        "id": "gpgb33q",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614744416.0
    },
    {
        "author": "bpi89",
        "body": "Those RKT cucks think a couple hundred of them can force a squeeze, when a few million are fighting every day for a GME squeeze? They do understand that if GME doesn’t squeeze with all this effort going into it that RKT, AMC whatever the fuck else sure as shit won’t. They’re gonna get crushed. \n\nPuts on RKT.",
        "created_utc": 1614706414,
        "id": "gpfpo0y",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614735214.0
    },
    {
        "author": "Sparkin4500",
        "body": "Bought $500 to push us through $130....it didn't work",
        "created_utc": 1614708147,
        "id": "gpftnng",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614736947.0
    },
    {
        "author": "ANDRELLAREN2K",
        "body": "DO NOT SELL TO BUY BACK CHEAPER! this will prevent the squeeze by allowing more shares for the hedge funds to cover their shorted shares making it more difficult for squeeze to occur. Repost everywhere you can think of!",
        "created_utc": 1614706580,
        "id": "gpfq1kx",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614735380.0
    },
    {
        "author": "willy-fistergash08",
        "body": "Things we should keep in mind today:\n\n\n•\t⁠There is no way to predict when the squeeze will happen\n\t⁠•\t⁠There will be crazy price action in both directions\n\t⁠•\t⁠This can go on as long as the shorts remain solvent\n\t⁠•\t⁠The longer they drag this out, the higher it goes\n\t⁠•\t⁠People might say, \"Lift-Off in 10!\" But they're just excited\n\t⁠•\t⁠Nobody knows when it'll happen or how high it will go\n\nBasically, don't believe the hype, but feel free to join in. You should do your own research, read the DD, and make informed decisions. Don't invest money you can't afford to lose.\n\nIn other words, fuck safely, or you'll get fucked.\n\n•\t⁠There is no \"we.\"\n\t⁠•\t⁠I'm holding because that's my choice. I believe in GME\n\t⁠•\t⁠I will not buy because someone else says to do so\n\t⁠•\t⁠I will not encourage others to buy\n\t⁠•\t⁠Nothing I say is financial advice\n\t⁠•\t⁠If you're confused, read the rules. No market manipulation.\n\nReport posts that encourage everyone to buy at the same time. The primary reason for this is legal, but the secondary is that the media will cherry-pick comments like this to give us a bad name and put more negativity out there through their articles, broadcasts, etc.\n\n•\t⁠There will be plenty of FUD (or \"fear, uncertainty, and doubt\")\n\t⁠•\t⁠I am including this out of belief, if not pure spite\n\t⁠•\t⁠There are redditors being paid to scare you\n\t⁠•\t⁠There are bots made to SPAM negativity\n\t⁠•\t⁠There are people profiting when you sell\n\t⁠•\t⁠This starts ramping up in the afternoon\n\nThere are two sides to this fight, and we have to remember that there are people profiting if we fail. There are people playing the other side who will come into the thread and try to throw us off track by ruining the morale. We mustn't give in to them. Besides, they can't even provide any good DD for their bear-case, it's all just \"sElL iT's OvEr.\"\n\n•\t⁠This is the motherfucking GME Megathread\n\t⁠•\t⁠Do not push other tickers\n\t⁠•\t⁠Do not jingle keys in our faces\n\t⁠•\t⁠Fuck you\n\nI, personally, go out of my way to CTRL/CMD+F and search for other tickers. If you're bringing up non-GME stocks in order to distract the thread, I'm one of the downvotes on your comment. Sue me.\n\n•\t⁠We can fucking do this\n\t⁠•\t⁠We have them where we want them\n\t⁠•\t⁠We can name our price\n\t⁠•\t⁠As long as we hold, we have what they want\n\t⁠•\t⁠They will pay out the ass to get it\n\nThey'll do whatever they can (manipulate the market, short the stock further, short EFTs, etc.) for as long as they can manage, all hoping we'll give up and sell (Hell, they've even tried to bore us to death). But they don't understand just how dumb we really are. We are far too stupid to be afraid of their fearmongering, and we'll hold 'til the moon.\n\n•\t⁠If you're new, this may not be for you\n\t⁠•\t⁠This is something you have to be really brave or really stupid for\n\t⁠•\t⁠You will either see enormous gains or enormous losses\n\t⁠•\t⁠Invest wisely, don't spend your rent money, and read the DD\n\t⁠•\t⁠Read the DD\n\t⁠•\t⁠Read the DD\n\t⁠•\t⁠DD is short for Due Diligence, and it's basically just researching a stock before you buy in. There's plenty of great DD on this sub, and you can sort by the DD flair to see the highest-voted posts. Do that before asking dumb questions and risking your karma.\n\nIf you think there's anything else I should add, please reply and tell me.",
        "created_utc": 1614701394,
        "id": "gpfe7vq",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614730194.0
    },
    {
        "author": "SirioBombas",
        "body": "If you haven’t already. Read this... A few lines about GME (please read)\n\n1. Price doesn't matter until the squeeze has been squoze.\n2. The best time to buy GME was 2 months ago, the second best time is NOW.\n3. Buy shares, not options. Invest only the money you can afford to lose.\n4. Don't fall for FUD. Any account can be a shill/bot, even the ones created before January. They are PAYING users to spread fear and enroll you to post negative comments/posts.\n5. GME has been and will always be the only play. Anything else is a distraction to limit the impact GME can have. (Yes, even RKT). Never will the planets align this perfectly again to trigger the biggest short squeeze of your lifetime.\n6. The most important point : Don't sell. Supply and demand : you have something they want, we all do. So YOU set the price you want. And the price can actually go up to infinity. This is going to be the biggest transfer of wealth the world has ever seen, don't ruin it being a paper hand and selling low.\n7. Hold. Hold. Hold. Selling at 1k is trolling. They want you to sell at 1k, that's why they keep spamming comments saying they put stop limits at 1k. 1k is lowball. 1k could just be a gamma squeeze. 10k is lowball.\n8. As stated by u/Polihanna, the squeeze will last multiple days. Don't be afraid that it lasts a few seconds and you'll miss it. You won't. \n9. Don't day-trade GME. It's extremely volatile, and you actually help them by selling shares that they can buy for cheap. You delay the squeeze and reduce its impact if you day-trade.\n10. THIS IS NOT A GAME OF GREED. IT IS A GAME OF TRUST.",
        "created_utc": 1614710700,
        "id": "gpfzks5",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614739500.0
    },
    {
        "author": "New_Assignment_5486",
        "body": "RKT is a distraction. Only boomers would choose a “rocket ship” ticker and drive the price up to try to confuse retarded apes with something shiny. If I was to guess the powers that be are somehow using it to profit to use those funds to further short our stonk. At the very least they are trying to pull us off our beloved GME trip to VALHALLA.  Fuck them. Together ape strong. HODL. 🦍🦍🦍🚀🚀🚀💎💎💎",
        "created_utc": 1614713753,
        "id": "gpg6r8c",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614742553.0
    },
    {
        "author": "Burnt_Couch",
        "body": "We're about to enter power hour here comrades. \n\nIt's important to keep in mind that seeing a dip would not be unexpected. It could dip below $110, or even $100. This is nothing to worry about.\n\nIf you believe in the fundamentals of this stock you'll know what to do. Take advantage of sales when you see them if you feel so inclined. But if you believe in the fundamentals, and that this stock will see &gt;$150, &gt;$200, &gt;$500, etc...a small dip now should not worry you. \n\nHOLD STRONG LADS.",
        "created_utc": 1614714318,
        "id": "gpg823n",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614743118.0
    },
    {
        "author": "Emphermal",
        "body": "British army green beret commandos checking in, followed from 480 all the way back down to 40 and lost money but gained some amount of laughs, also, it is me and my friend who is in on this with me, $200+ EOD and a few upvotes and we will both get a diamond palm tattoo and a rocket on there too, long live the apes.",
        "created_utc": 1614702748,
        "id": "gpfh9jp",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1614731548.0
    },
    {
        "author": "GR8Cobb",
        "body": "You guys are a bunch of retards... Investing into a single stock that has no real upside and is hanging its hope on one man and a vision. Dumping countless dollars into stocks and options that are going to bring you nothing but heartburn and headaches... And you know what? I dig it. I like the direction of the company. I like the upside. I'm a fucking gamer. And I'd love nothing more than to see these rich fucks squirming like they are in thay scene from Dark Knight Rises... \"Exile or death?\" Fuck it... I'm in. Keeping what I have and buying the dips again and again and again. Way to go you autistic fucking diamond handed apes. I love you all but most importantly, I love the fucking stock. Oh, and I'm not financial advisor for whatever that is worth 🤷‍♂️. 🦍💪2-Gether 💎🖐 4-Eva",
        "created_utc": 1614701848,
        "id": "gpff8so",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614730648.0
    },
    {
        "author": "AJDillonsMiddleLeg",
        "body": "Yes RKT diverts attention from GME. But calling them shills is dumb af. It's up over 60% today from a clear gamma squeeze (every option on the chain is ITM). I missed out on it, which is fine but congrats and fuck you to those that didn't miss it.",
        "created_utc": 1614711899,
        "id": "gpg2eqi",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614740699.0
    },
    {
        "author": "Columbian-Roaster",
        "body": "So 1 stock goes 70% up a day wow.. Let’s fucking make it the megathread now.\n\nGME saw way better increases not once bitches\n\nThis is the way. GME To the moon 💎🙌🚀🚀",
        "created_utc": 1614717214,
        "id": "gpgeti5",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614746014.0
    },
    {
        "author": "South_Onion",
        "body": "8K comments in the first hour of this thread. Imagine thinking it was a good idea to **not** have a dedicated GME thread. \n\n\nLets get it boys. 🚀🚀🚀🚀🚀🚀🚀",
        "created_utc": 1614703600,
        "id": "gpfj7ck",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614732400.0
    },
    {
        "author": "Korso213",
        "body": "I bought a $50c 3/19 yesterday around noon and nearly shit my pants when I checked it today to see it up 4100%",
        "created_utc": 1614717654,
        "id": "gpgfupf",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614746454.0
    },
    {
        "author": "lucy_1204",
        "body": "I want AMC to go up a bit so I can cut my losses and put it all into GME 🙌🏼🚀💎",
        "created_utc": 1614709926,
        "id": "gpfxrdy",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614738726.0
    },
    {
        "author": "apogreba",
        "body": " \"So lets pump gay rocket stock (im not going to name) Then as it's going  up, we'll synthetically drop GME at the same time with our borrowed  shares to make it appear that there's a sell-off. That should work,  right.\"\n\n\"What?! The retards just bought more?!!!! What the fuck?!\"\n\nmelvin",
        "created_utc": 1614714507,
        "id": "gpg8hu9",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614743307.0
    },
    {
        "author": "sirpe_008",
        "body": "it's funny how a lot of u are saying that u wait for the dip and when it dips u get scared. \n\nhold. 💎🙌",
        "created_utc": 1614718547,
        "id": "gpghzlr",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1614747347.0
    },
    {
        "author": "samgarita",
        "body": "RKT is such a distraction. Fucking boomer way of thinking “Look fellow kids! A ROCKET stock! Catchy name, catchy ticker symbol! You guys can 🚀🚀!!”\nI’m not buying it.",
        "created_utc": 1614704875,
        "id": "gpfm55j",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1614733675.0
    },
    {
        "author": "Zen0d0x",
        "body": "**To the ones who ditched us for stock that shall not be named,** \n\nI hope you realize that is a pump, and that stock has no backing on that vastly inflated price. I hope you all regret it tomorrow morning as it fucking crashes. I hope GME opens so GODDAMN strong tomorrow you all lose your positions. \n\nFurthermore, I hope you wake up to a flat tire, with no spare. I hope you get caught in traffic. I hope when you eventually make it in to work, the coffee is out. I hope when you wake up your work PC around your colleagues it's overloaded with gay fucking porn. I hope you find out your wife has been fucking one of your family members. I hope you come home to no fucking dinner. I hope you catch Syphilis and your dick falls off. \n\nWith Love, \n\n**A true fucking Hodler.**\n\n**(Eat a dick, better yet... eat a million.)**",
        "created_utc": 1614716949,
        "id": "gpge6op",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1614745749.0
    },
    {
        "author": "netmovements",
        "body": "Staying long on GME, don't buy anything from Sony, Microsoft, Best Buy, Target, Walmart, Amazon etc that you can get from GameStop. I'm in almost $10k and continue to get all my xbox live subscriptions, consoles, controllers and games from Gamestop. Keep buying their merch and stock.\n\nNow let's go!!! 🚀🚀🚀 buy buy buy and hold hold hold on tight 💎💎 💎",
        "created_utc": 1614703243,
        "id": "gpfidsh",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1614732043.0
    },
    {
        "author": "Social_History",
        "body": "I’m an ethical investor. AAPL and MSFT just like child labor and monetizing everything. At least they’re not FB, GOOG, or TWTR",
        "created_utc": 1614701436,
        "id": "gpfeb9v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614730236.0
    },
    {
        "author": "Aids072",
        "body": "buy 60% apple &amp; 40% msft \nApple is safe to hold until your last day so might as well",
        "created_utc": 1614709104,
        "id": "gpfvuof",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614737904.0
    },
    {
        "author": "Robo123abc",
        "body": "Complete beginner here. \n\nThe past few days I invested $700 in stock and $140 in Bitcoin. \n\n0.137 in Nvidia\n\n0.138 in Tesla\n\n0.2 shares in Sea Limited\n\n0.21 shares in Microsoft\n\n0.39 in TSM\n\n1.13 shares in AMD\n\n1.5 in GME\n\n2 in Compass Pathways\n\n\nI have zero clue if this was a good idea or not. Not employed but I recently graduated with little debt and no other expenses. Had a little money to burn but I’d rather not lose it. ANY feedback appreciated.",
        "created_utc": 1614710474,
        "id": "gpfz1pe",
        "score": 2,
        "subreddit": "investing",
        "created": 1614739274.0
    },
    {
        "author": "massive_elbow",
        "body": "How much money would you have made in the 90’s if you invested $1000 in a ‘tech’ ETF?\n\nI keep running into this situation, where I believe a certain industry will do well in the future, but I don’t know much about the individual companies in the industry (biotech, weed, vr, etc).\n\nWhat I am wondering is say I put $1000 in an actively managed biotech ETF, and then CRISPR ends up becoming the future. How much would I make having invested in the ETF vs just investing in CRISPR?\n\nObviously the answer must be a lot less, but does anyone have any actually experience with this? Like is there anyone out there that invested in a Tech ETF or something back in the 90’s that had exposure to apple/Microsoft?\n\nAlternatively, is there a way I can look back at the data and just calculate this out?",
        "created_utc": 1614701756,
        "id": "gpff198",
        "score": 2,
        "subreddit": "investing",
        "created": 1614730556.0
    },
    {
        "author": "Lootcifer_exe",
        "body": "I see, you also have the power of Microsoft Paint.",
        "created_utc": 1614701373,
        "id": "gpfe63b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614730173.0
    },
    {
        "author": "Zerocyde",
        "body": "Heh, funny you mention that. My specific plan is 1 apple, 1 microsoft, 1 nvidia, and 1 arkg. Just based off my personal taste and suggestions I've seen on this sub lately.",
        "created_utc": 1614710803,
        "id": "gpfztmx",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614739603.0
    },
    {
        "author": "stoney-the-tiger",
        "body": "After I got married and started a family 2008, I threw all my Roth IRA into MSFT, Panasonic, TSM, and QQQ and didn't really look at it for about 8 years...  The main reason was because I was too busy with work and family to spend time investing. It grew a lot because I was in some very good names.  I got more involved because I had rolled over a 401k to an IRA and needed to re-deploy.  There were too many good companies available really cheap so after I had invested the IRA I moved on to my Roth.  But since then I have invested into a more diversified but still very tech heavy portfolio.  I sold the Panasonic &amp; TSM first, then the QQQ, finally sold my last MSFT a couple months ago.  \n\nLately, I have been going with a much more active strategy holding usually 6-18 months.  I still have the first position I got into from Panasonic proceeds, $TEAM (I got in at $52.87/share).  \n\nMy advice would be don't get emotional about selling a position you have held for a really long time if you find a better opportunity.  I also think that the walking away for a long time was a good move for me because being this active takes a lot of time doing research and tracking the news.  It would have detracted from my career path and family to do it between 2018-2016 and my portfolio size wasn't large enough to make the extra returns worthwhile.",
        "created_utc": 1614710635,
        "id": "gpfzfd4",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614739435.0
    },
    {
        "author": "outphase84",
        "body": "Welp, your DD falls on its face here.\n\nSalesforce's acquisitions aren't a result of trying to pump revenue on the bottomline, it's a combination of moving into adjacent marketspace without R&amp;D investment, and staying competitive with competing offers.\n\nYour Slack example is a perfect example.  Their valuation was $25B, and you need to pay a premium in order to acquire a company.  And the play wasn't a result of trying to get Slack's revenue or profit.  Microsoft has been pushing Dynamics *hard* as part of the O365 licensing model.  That's a direct competitor to SFDC.  And MSFT's message that their sales org is pushing is \"We hit all of your software needs with one license.\"  The biggest driver of upsales on O365 are Dynamics and Teams.  Bundling CRM and UCaaS is a gamechanger, and has been wildly successful for them.\n\nSFDC needed to be able to compete with that bundling.  So they bought the biggest competitor to Teams.  And they'll bundle it with SFDC licenses.\n\nTableau is a similar purchase.  BI is a huge play right now, and *also* a feature that MSFT is bundling with O365.  Adding Tableau into the fold allows SFDC to directly compete with MSFT on that front, too.\n\nThese aren't cookie jar acquisitions, they're competitive expansion via acquisition.",
        "created_utc": 1614701484,
        "id": "gpfef63",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614730284.0
    },
    {
        "author": "kevlaw99",
        "body": "It would be awesome if reddit community would push ABML and FCEL. Nothing but huge upside. Seriously, they are diamonds in the rough. They will be huge players in the lithium battery market  considering how electric vehicles outsold gas vehicles worldwide last year and will continue in the upcoming years. The new trend. APLE and Microsoft have made incredibly large investments in these 2 companies because they see the value. Just please think about it and the best of luck which ever way you decide to invest",
        "created_utc": 1614701916,
        "id": "gpffee4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614730716.0
    },
    {
        "author": "AyeWhatsUpMane",
        "body": "Is there any reason to have QQQ if I have MSFT, Nvidia, Google and ARK Internet which is Tesla heavy?",
        "created_utc": 1614705999,
        "id": "gpfopuc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614734799.0
    },
    {
        "author": "Jeepers__Reapers",
        "body": "I meant stock wise. It appears to be MSFT and FB as the main culprits",
        "created_utc": 1614709406,
        "id": "gpfwjvq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614738206.0
    },
    {
        "author": "Meymo",
        "body": "You can run a backtest on any ticker at portfolio Visualizer. For fun, I put in $1000 in both Apple and Microsoft:\n\nhttps://www.portfoliovisualizer.com/backtest-portfolio?s=y&amp;timePeriod=4&amp;startYear=1985&amp;firstMonth=1&amp;endYear=2021&amp;lastMonth=12&amp;calendarAligned=true&amp;includeYTD=false&amp;initialAmount=1000&amp;annualOperation=0&amp;annualAdjustment=0&amp;inflationAdjusted=true&amp;annualPercentage=0.0&amp;frequency=4&amp;rebalanceType=1&amp;absoluteDeviation=5.0&amp;relativeDeviation=25.0&amp;reinvestDividends=true&amp;showYield=false&amp;showFactors=false&amp;factorModel=3&amp;portfolioNames=false&amp;portfolioName1=Portfolio+1&amp;portfolioName2=Portfolio+2&amp;portfolioName3=Portfolio+3&amp;symbol1=AAPL&amp;allocation1_1=100&amp;symbol2=MSFT&amp;allocation2_2=100\n\n\nYou can play with the dates and tickers on this to see how it turns out. You can also simulate adding new money in each month.",
        "created_utc": 1614702258,
        "id": "gpfg5w0",
        "score": 1,
        "subreddit": "investing",
        "created": 1614731058.0
    },
    {
        "author": "dntwryswthrt",
        "body": "It’s all thanks to a couple of MSFT options last year lmao I havent had the balls to play big like that anymore",
        "created_utc": 1614702449,
        "id": "gpfglic",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1614731249.0
    },
    {
        "author": "Floofyboy",
        "body": "The problem with your logic is market decisions aren't binary. Its like saying you should do the opposite of what you think in Chess and win...\n\n\nIf you think you should buy Apple, the opposite isn't... buying microsoft. There are thousands of companies to buy.",
        "created_utc": 1614703115,
        "id": "gpfi3dr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614731915.0
    },
    {
        "author": "AyeWhatsUpMane",
        "body": "If I am holding MSFT, Nvidia, Google and ARK Internet which is Tesla heavy, is there any reason for me to buy QQQ?",
        "created_utc": 1614706301,
        "id": "gpfpepk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614735101.0
    },
    {
        "author": "tylrr343434",
        "body": "This is my portfolio. Does anyone have any suggestions or advice? \n\nMSFT - 15%\nSQ - 15% \nV - 12% \nSE - 12%\nApple - 12% \nCloudfare - 10%\nCostco - 10%\nNIO - 8% \nGE - 6%",
        "created_utc": 1614706082,
        "id": "gpfowst",
        "score": 1,
        "subreddit": "investing",
        "created": 1614734882.0
    },
    {
        "author": "fungusdickhead",
        "body": "Msft 200c",
        "created_utc": 1614698860,
        "id": "gpf8m3o",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614727660.0
    },
    {
        "author": "ExcitedAlpaca",
        "body": "You’re fantastic, thank you. I myself might try VTI/QQQM/VGT as I’m slightly younger (late 20s) and plan on leaving it alone for 15-20 years. But I’ll have my dad do something safer like VOO, but I’ll still check out those resources! I’m planning on doing a mix of appl, msft, and voo for him, that sound good? \n\nHe just turned 55! He has his business (planning on closing maybe this year) and real estate. He doesn’t believe in stocks/bonds/mutual funds so wants me to “prove him wrong” lol. I told him he probably won’t see it for 5 years minimum but he’s fine with that.",
        "created_utc": 1614712602,
        "id": "gpg42kp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614741402.0
    },
    {
        "author": "Senseisntsocommon",
        "body": "Microsoft in process of doing the same.",
        "created_utc": 1614712145,
        "id": "gpg2zgc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614740945.0
    },
    {
        "author": "redditu5er",
        "body": "TLDR : Stop losses cut the trade. Many times, after hitting the stop loss, the stock will move back in the correct direction. No matter what position is taken (short or long) it is very difficult to accurately enter a trade, hit the target before hitting stop loss. \n\n&amp;nbsp;\n\n&amp;nbsp;\n\nI day trade - not very successful - just enough success to cover my losses :P \n&amp;nbsp;\n\nThe problem with doing the \"opposite\", with the strategy I use, is this : \n1. The stocks I pick for day trading are large caps - e.g. - Apple, MSFT etc.\n&amp;nbsp;\n\n2. If you consider an up trending day, then the obvious position to take is a long position for the day.\n&amp;nbsp;\n\n3. On a typical day, a stock price is range bound - for example between $100-$101. \n&amp;nbsp;\n\n4. Typically, I would start building a long position when the price is near $100.2 and set a stop loss at $99.6 and target at $101. \n&amp;nbsp;\n\n5. Probabilistically, the long position on a large cap on a up trending day, is correct.  The problem really occurs when the price momentarily  (spike) drops to 99.6 and hits the stop loss (kills the trade).\n&amp;nbsp;\n\n6. Later in the day, of course the stock moves back to the target price. \n&amp;nbsp;\n\n7. It takes a long time to enter trades correctly and avoid stop loss. The basics of trading really do work over time - e.g. - always take positions with the trend (of the stock and the index). Always enter high probability trades (as per whatever trade indicators you use).  \n&amp;nbsp;",
        "created_utc": 1614712364,
        "id": "gpg3i6b",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614741164.0
    },
    {
        "author": "SpookyDooDo",
        "body": "Oh yeah, and maybe we should all go in on MSFT 3/20 $200C, too?",
        "created_utc": 1614712910,
        "id": "gpg4srk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614741710.0
    },
    {
        "author": "Senseisntsocommon",
        "body": "Add MSFT to this today and I am with you.",
        "created_utc": 1614702173,
        "id": "gpffz0m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614730973.0
    },
    {
        "author": "ty0212",
        "body": "I seen apple and Microsoft was looking into it but I’m not sure those are rumours so I grabbed a few shares up lol thanks  for the reply I’m still new to all this Tomfoolery lol",
        "created_utc": 1614713657,
        "id": "gpg6jaq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614742457.0
    },
    {
        "author": "AyeWhatsUpMane",
        "body": "Is there any reason to have QQQ if I have MSFT, Nvidia, Google and ARK Internet which is Tesla heavy?",
        "created_utc": 1614706014,
        "id": "gpfor0z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614734814.0
    },
    {
        "author": "ExcitedAlpaca",
        "body": "Hi Guys, my father came in yesterday and told me he'd like to invest 5k into stocks. This was surprising to me as he's always been super wary of investments other than real estate (has no retirement account other than this but this is a discussion for another time). He says \"whatever you think\" to any question I ask him so he's a bit unhelpful. I'd like to invest in solid (as solid as they can be) accounts that might not show growth in the next year or so, but that can be fruitful in 5+ years. I was thinking:\n\nAAPL, DIS, MSFT, etc... or should I put most in something like AMZN? Also thinking of SPY or ETFs (open to suggestions).\n\nAny thoughts are appreciated!",
        "created_utc": 1614705254,
        "id": "gpfn08z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614734054.0
    },
    {
        "author": "calipfarris01",
        "body": "As of now, this is a \"special dividend\" which is a one time occurrence.  Not many companies do this, as a comparison Microsoft did this as well in 2004.  Had you been accumulating Microsoft over the years since 2004, you'd be doing pretty well today.  I think the special dividend is meant to show that they value the shareholders and payback that growth.  They want to be considered a fintech company though (a growth company) and not a value stock, so I would imagine they will resist issuing more dividends in the near term.  That doesn't mean 10 years from now they wont.  This is the kind of stock you hold on to (IMO) and don't worry about \"thinking it will dump\".  As I've described the price will take at least a 5% loss (probably more) after March 9th when people sell after the div payment.  What they don't realize is by doing that they are actually losing money. Yes they got the dividend but they also took the share price decrease and the additional decrease from the other sellers, which in the example above, would be more than the $1,100 you get issued (i.e. a net negative investment). You can short term play it if you like but your profits are only going to be in what the stock price rises between now and the div payment.  If you plan to sell directly after March 9, just know you are probably losing money.  You would need to hold after the 9th until the stock price rises a bit (hopefully).  OR you can just continue to hold a great stock, which to me is the better move.",
        "created_utc": 1614706416,
        "id": "gpfpo9h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614735216.0
    },
    {
        "author": "yerawizardIMAWOTT",
        "body": "MSFT less volatile but also less potential growth",
        "created_utc": 1614700918,
        "id": "gpfd5o6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614729718.0
    },
    {
        "author": "st1r",
        "body": "I’d slightly lean towards MSFT however I think you can’t go wrong just allocating evenly to both.",
        "created_utc": 1614701405,
        "id": "gpfe8pt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614730205.0
    },
    {
        "author": "giantwashcapsfan8",
        "body": "Moved my PayPal position from 4/16 $280 to 1.75x the amount of 3/26 $285c after being up 90% on the original position ☺️☺️☺️",
        "created_utc": 1614701327,
        "id": "gpfe2ck",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614730127.0
    },
    {
        "author": "giantwashcapsfan8",
        "body": "PayPal and square taking off",
        "created_utc": 1614701260,
        "id": "gpfdx27",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614730060.0
    },
    {
        "author": "HeyMyNamesMatt",
        "body": "PYPL omg 😯",
        "created_utc": 1614701256,
        "id": "gpfdwr7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614730056.0
    },
    {
        "author": "HumbleBJJ",
        "body": "got a nice big bonus from work and looking to invest only a small amount like 5k-7K into stocks to start. \n\nwas thinking on the following:\n\n- PayPal\n- Carnival Cruise\n- Uber\n- Tesla\n- a pharma or life science comp or REIT\n\nI know it’s not a big amount but want to start smaller first. appreciate any tips",
        "created_utc": 1614700116,
        "id": "gpfbd2n",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614728916.0
    },
    {
        "author": "sypharmacy22",
        "body": "PAC (from spac or space)\nX from his PayPal days and the fake umbrella company\n\nIt is so troll it is genius. They’ll just say “we put it in the name for you guys”",
        "created_utc": 1614699517,
        "id": "gpfa1g0",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1614728317.0
    },
    {
        "author": "suhdanny",
        "body": "QCOM. It currently trades at a historic low in terms of its P/S ratio and also is cheap compated to other chip companies in terms of P/E. The growth potential is huge regarding 5G, AR/VR, autonomous driving ... etc. It’s been on a downhill since the earning’s report, but I think this stock deserves at least a double of current price.",
        "created_utc": 1614782760,
        "id": "gpjdmyd",
        "score": 12,
        "subreddit": "stocks",
        "created": 1614811560.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "$GSAT = buyout target \n\n   QUALCOMM- and -ERICSSON \n\nAPR 2, 2019:\nFormer Qualcomm boss pivots toward 5G startup XCOM.\n\nSEP 17, 2020: \nEricsson, Qualcomm, and U.S. Cellular announce first ever successful extended range 5G NR millimeter Wave (mmWave) data call in the U.S. on a commercial network.\n\nOCT 9, 2020:\nEricsson selected for U.S .DOD 5G testing.\n\nNOV 11, 2020:\nEricsson stock growth is tied to 5G expansion.\n\nFEB 9, 2021: \nQualcomm includes Globalstar's Band n53 in its new 5G X65 modem. The X65 is Qualcomm's flagship 5G modem and adds global 5G band support for n53.\n\nFEB 17, 2021:\nGLOBALSTAR ANNOUNCES STRATEGIC ALLIANCE WITH XCOM LABS.",
        "created_utc": 1614746978,
        "id": "gpi2hsu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614775778.0
    },
    {
        "author": "maddogenglish",
        "body": "Finally a warm day in Colorado so I'm going golfing tomorrow. I would appreciate it if PLTR, SNDL, QCOM, FCEL, QQQ and CAM bring in some ![img](emote|wsb_emojis|tendies) while I am away. Please make that happen.",
        "created_utc": 1614737247,
        "id": "gphkh88",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614766047.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "5G is a fiercely competitive market. The United States will beat Huawei to establish the global standards and commercial market for security reasons - ergo the most prominent U.S. company is in Globalstar given that it already has trusted partners in both Qualcomm (and Ericsson by association) - both of which bring integrated services to 190+ countries.",
        "created_utc": 1614748269,
        "id": "gpi4hvy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614777069.0
    },
    {
        "author": "Flam3Shot_",
        "body": "With all due respect, I do not agree with your statement about there being direct competitors for most companies between the NASDAQ and NYSE. Strong, long lasting companies like Apple, Microsoft, Nvidia, Qualcomm, etc. hardly have any competition whatsoever in reference to the companies listed in the NYSE (unless you count stagnant/dying firms like Oracle or Nokia, but that’s really stretching it). Only thing I can really think of is Facebook v Twitter and some e-commerce stuff like Alibaba v Amazon. Either way, the examples are seldom. \n\nThat said, I appreciate your advice immensely. Thank you :)",
        "created_utc": 1614747255,
        "id": "gpi2xv4",
        "score": 1,
        "subreddit": "investing",
        "created": 1614776055.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of March\n\n\n\n## Upcoming events for Wednesday, March  3rd\n\n - Stock splits:\n\n    - CLWT @ **3:2** (Payable date: 03/02/2021)\n\n - Expected earnings:\n\n  ACU, AEGN, AEO, AMPE, APT, ASM, ATTO, BBSI, BDR, BF.A, BF.B, BKCC, BKTI, BLCT, BMA, BQ, BXC, CECE, CETX, CFMS, CIX, CLMT, CMTL, CNR, CORR, CTRM, CULP, CZZ, DAKT, DLTR, DPW, DSGX, DY, ENIC, EQX, EVGN, EYE, EYEG, FLMN, FTHM, GHLD, GIFI, GMRE, GPRK, GRP.U, HBB, HDSN, HGEN, HPR, HRTG, IMTX, ISEE, ITRN, JILL, KERN, KIDS, KRON, LINC, MDRR, MESO, MLR, MRVL, MTLS, MYRG, NAV, NC, NEWT, NFH, NM, NMCI, NWPX, OGEN, OKTA, OM, ONCR, OPTN, OSW, OXSQ, PASG, PCOM, PDCO, PNRG, PW, RAIL, RCMT, RDHL, RMNI, RNET, RPTX, RRGB, SBBP, SBOW, SD, SID, SINA, SLNO, SMHI, SNOW, SPKE, SPLK, SPRB, SQM, STKL, SUPV, TAC, TAST, TCOM, TPCO, TPVG, TSHA, UFPT, USDP, VNET, VRM, VRTV, WB, WEN, WHLR, WMC, WPG, WTI, YEXT\n\n - Ex-div:\n\n  ALL, AWI, EQH, ES, ESBK, FANG, FWRD, GLOG, LEA, LZB, MBCN, MOS, NLSN, PTEN, QCOM, RMBI, SSTK, VNOM\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 177K, previous: 174K)\n    - Beige Book\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: 0.249M)\n    - Crude Oil Inventories (consensus: -0.928M, previous: 1.285M)\n    - Cushing Crude Oil Inventories (previous: 2.807M)\n    - Distillate Fuel Production (previous: -0.953M)\n    - EIA Refinery Crude Runs  (previous: -2.589M)\n    - EIA Weekly Distillates Stocks (consensus: -3.035M, previous: -4.969M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 4.6%, previous: -14.5%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Kaplan Speaks\n    - Gasoline Inventories (consensus: -2.300M, previous: 0.012M)\n    - Gasoline Production (previous: -1.295M)\n    - Heating Oil Stockpiles (previous: 0.093M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.0, previous: 59.9)\n    - ISM Non-Manufacturing Employment (previous: 55.2)\n    - ISM Non-Manufacturing New Orders (previous: 61.8)\n    - ISM Non-Manufacturing PMI (consensus: 58.7, previous: 58.7)\n    - ISM Non-Manufacturing Prices (previous: 64.2)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -11.4%)\n    - MBA Purchase Index (previous: 264.9)\n    - Markit Composite PMI (consensus: 58.8, previous: 58.7)\n    - Mortgage Market Index (previous: 790.6)\n    - Mortgage Refinance Index (previous: 3,848.1)\n    - OPEC Meeting\n    - Services PMI (consensus: 58.9, previous: 58.3)\n\n## Upcoming events for Thursday, March  4th\n\n - Stock splits:\n\n    - MYBF @ **105:100** (Payable date: 03/15/2021)\n    - TR @ **103:100** (Payable date: 04/02/2021)\n    - TROLB @ **103:100** (Payable date: 03/26/2021)\n\n - Expected earnings:\n\n  ABUS, ACOR, ADCT, AE, AFIB, AGS, AHCO, AIV, AJX, AKUS, ALXO, AMC, AMTI, ANIK, AQN, ARGX, ASPS, AT, ATC, ATEC, ATHA, AUTL, AVGO, AVGR, BALY, BCOW, BJ, BPMP, BSGM, BURL, BYFC, BZUN, CBIO, CBMB, CCCC, CDAK, CELP, CERT, CHMA, CHMI, CHUY, CIB, CIEN, CIR, CLLS, CLPT, CLXT, CNQ, COHN, COO, COST, CRAI, CRD.A, CRD.B, CRVS, CTSO, CVV, CZNC, DBVT, DMTK, DNN, DRRX, DSSI, DXYN, DYN, EGLE, ELOX, ENZ, ESGC, ETON, EVC, EVFM, EVLO, EYPT, FBRX, FCRD, FIZZ, FLGT, FMTX, FOUR, FPRX, FRGI, FTSI, FULC, GAU, GBLI, GCP, GDYN, GMS, GOL, GPL, GPMT, GPS, GRAY, GSAT, GSL, GWRE, GWRS, HCM, HEAR, HOLI, HRMY, IDT, IMAX, IMMR, INMB, INVE, INZY, ISDR, ISIG, ITOS, JAMF, JG, JW.A, JW.B, JYNT, KBNT, KDMN, KR, KYMR, LRMR, LTRN, MANU, MAXN, MAYS, MCS, MDLA, MEG, MEI, MIK, MLVF, MMX, MOSY, MTCR, MWK, MYSZ, NCMI, NEW, NKSH, NKTX, NNA, NRP, NTCO, NTST, NVIV, NX, OBLN, OBSV, ODC, OPEN, OPNT, ORIC, ORTX, PACK, PBLA, PCVX, PHI, PLYA, PQG, PRPL, PSTX, PVAC, QTT, QUMU, RFL, RLH, RVMD, SALM, SCM, SCOR, SCPE, SDC, SDGR, SENS, SFE, SHG, SHIP, SIGA, SMLP, SMSI, SOHO, SOLY, SPPI, SQFT, SRG, SRLP, STLA, STON, SWBI, SYN, SYRS, TARA, THRY, TLS, TMBR, TOMZ, TRIN, TTC, TTOO, TWI, VBIV, VERI, VLGEA, VNRX, VRAY, VSEC, VTRS, VYNE, WPP, WRAP, WVE, XFOR, YPF\n\n - Ex-div:\n\n  AFB, AGR, AJG, AMNB, BAC, BBL, BLK, BOTJ, BRKR, BRKS, CASS, CHRW, D, DAN, DEA, DRD, EPC, FLIR, FLO, FNB, FRME, GBDC, GPC, HSII, ICBK, KMB, KNX, LIN, MBWM, NAVI, NCB, NUW, NVS, OC, PCH, PEP, PTVCA, PTVCB, RF, RIO, SAFT, SCL, SEE, SLM, TEX, TFX, TGNA, TR, TRST, TT, UFCS, WEN, WING, WY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.040%)\n    - Challenger Job Cuts (previous: 79.552K)\n    - Continuing Jobless Claims (consensus: 4,300K, previous: 4,419K)\n    - Durables Excluding Defense (previous: 2.3%)\n    - Factory Orders (consensus: 2.1%, previous: 1.1%)\n    - Factory orders ex transportation (previous: 1.4%)\n    - Initial Jobless Claims (consensus: 750K, previous: 730K)\n    - Jobless Claims 4-Week Avg. (previous: 807.75K)\n    - Natural Gas Storage (consensus: -333B, previous: -338B)\n    - Nonfarm Productivity (consensus: -4.7%, previous: -4.8%)\n    - OPEC Meeting\n    - Unit Labor Costs (consensus: 6.6%, previous: 6.8%)\n\n## Upcoming events for Friday, March  5th\n\n - Stock splits:\n\n    - APH @ **2:1** (Payable date: 03/04/2021)\n\n - Expected earnings:\n\n  AAMC, AIM, ALUS, ANAT, ARDX, ATLC, ATLO, AYRO, BH.A, BHAT, BIG, BORR, BPTH, BRID, CCNC, CEI, CHEK, CLPS, CMPI, COE, COMS, CRH, DS, DXPE, EML, EXN, FENC, FGBI, FHTX, FSEA, FSTX, GGAL, GLP, GSX, HIBB, HMG, HURC, HUSA, IMRA, INBX, INTT, IPDN, ITCB, KB, KMPH, KVHI, MIST, NBAC, NWLI, OFS, OLB, ONCY, PCSA, PDLB, PLPC, PMVP, PNBK, PPSI, PRPO, PSO, PTMN, RUTH, SAMG, SPLP, STRR, STTK, SUP, TGS, UBOH, VET, VSTA\n\n - Ex-div:\n\n  ANAT, BF.A, BF.B, CCBG, CDK, CNS, EVRG, EXC, FAF, FDX, GE, HBB, HL, HTGC, HWC, JBT, JKHY, JOE, KSU, LUMN, LYB, NC, OAS, OMP, PATK, PBIP, RTLR, STRA, SVBI, SYX, TPL, TROX, UGP, VALE\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 5.3%, previous: 5.4%)\n    - Average Hourly Earnings (consensus: 0.2%, previous: 0.2%)\n    - Average Weekly Hours (consensus: 34.9, previous: 35.0)\n    - CFTC Aluminium speculative net positions (previous: 4.7K)\n    - CFTC Copper speculative net positions (previous: 75.4K)\n    - CFTC Corn speculative net positions (previous: 529.8K)\n    - CFTC Crude Oil speculative net positions (previous: 511.8K)\n    - CFTC Gold speculative net positions (previous: 215.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.4K)\n    - CFTC Natural Gas speculative net positions (previous: 28.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -31.3K)\n    - CFTC Silver speculative net positions (previous: 47.6K)\n    - CFTC Soybeans speculative net positions (previous: 239.8K)\n    - CFTC Wheat speculative net positions (previous: 27.4K)\n    - Consumer Credit (consensus: 12.00B, previous: 9.73B)\n    - Exports (previous: 184.20B)\n    - Government Payrolls (previous: 43.0K)\n    - Imports (previous: 252.30B)\n    - Manufacturing Payrolls (consensus: 12K, previous: -10K)\n    - Nonfarm Payrolls (consensus: 180K, previous: 49K)\n    - Participation Rate (previous: 61.4%)\n    - Private Nonfarm Payrolls (consensus: 194K, previous: 6K)\n    - Trade Balance (consensus: -67.50B, previous: -66.60B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 305)\n    - U.S. Baker Hughes Total Rig Count (previous: 397)\n    - U6 Unemployment Rate (previous: 11.1%)\n    - US Federal Budget (previous: -430.0B)\n    - Unemployment Rate (consensus: 6.3%, previous: 6.3%)\n\n^^^^2021-03-03",
        "created_utc": 1614769221,
        "id": "gpisq8x",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1614798021.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "$GSAT = buyout target \n\n   QUALCOMM- and -ERICSSON \n\nAPR 2, 2019:\nFormer Qualcomm boss pivots toward 5G startup XCOM.\n\nSEP 17, 2020: \nEricsson, Qualcomm, and U.S. Cellular announce first ever successful extended range 5G NR millimeter Wave (mmWave) data call in the U.S. on a commercial network.\n\nOCT 9, 2020:\nEricsson selected for U.S .DOD 5G testing.\n\nNOV 11, 2020:\nEricsson stock growth is tied to 5G expansion.\n\nFEB 9, 2021: \nQualcomm includes Globalstar's Band n53 in its new 5G X65 modem. The X65 is Qualcomm's flagship 5G modem and adds global 5G band support for n53.\n\nFEB 17, 2021:\nGLOBALSTAR ANNOUNCES STRATEGIC ALLIANCE WITH XCOM LABS.",
        "created_utc": 1614746978,
        "id": "gpi2hsu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614775778.0
    },
    {
        "author": "maddogenglish",
        "body": "Finally a warm day in Colorado so I'm going golfing tomorrow. I would appreciate it if PLTR, SNDL, QCOM, FCEL, QQQ and CAM bring in some ![img](emote|wsb_emojis|tendies) while I am away. Please make that happen.",
        "created_utc": 1614737247,
        "id": "gphkh88",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614766047.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "5G is a fiercely competitive market. The United States will beat Huawei to establish the global standards and commercial market for security reasons - ergo the most prominent U.S. company is in Globalstar given that it already has trusted partners in both Qualcomm (and Ericsson by association) - both of which bring integrated services to 190+ countries.",
        "created_utc": 1614748269,
        "id": "gpi4hvy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614777069.0
    },
    {
        "author": "Flam3Shot_",
        "body": "With all due respect, I do not agree with your statement about there being direct competitors for most companies between the NASDAQ and NYSE. Strong, long lasting companies like Apple, Microsoft, Nvidia, Qualcomm, etc. hardly have any competition whatsoever in reference to the companies listed in the NYSE (unless you count stagnant/dying firms like Oracle or Nokia, but that’s really stretching it). Only thing I can really think of is Facebook v Twitter and some e-commerce stuff like Alibaba v Amazon. Either way, the examples are seldom. \n\nThat said, I appreciate your advice immensely. Thank you :)",
        "created_utc": 1614747255,
        "id": "gpi2xv4",
        "score": 1,
        "subreddit": "investing",
        "created": 1614776055.0
    },
    {
        "author": "suhdanny",
        "body": "QCOM. It currently trades at a historic low in terms of its P/S ratio and also is cheap compated to other chip companies in terms of P/E. The growth potential is huge regarding 5G, AR/VR, autonomous driving ... etc. It’s been on a downhill since the earning’s report, but I think this stock deserves at least a double of current price.",
        "created_utc": 1614782760,
        "id": "gpjdmyd",
        "score": 12,
        "subreddit": "stocks",
        "created": 1614811560.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "$GSAT = buyout target \n\n   QUALCOMM- and -ERICSSON \n\nAPR 2, 2019:\nFormer Qualcomm boss pivots toward 5G startup XCOM.\n\nSEP 17, 2020: \nEricsson, Qualcomm, and U.S. Cellular announce first ever successful extended range 5G NR millimeter Wave (mmWave) data call in the U.S. on a commercial network.\n\nOCT 9, 2020:\nEricsson selected for U.S .DOD 5G testing.\n\nNOV 11, 2020:\nEricsson stock growth is tied to 5G expansion.\n\nFEB 9, 2021: \nQualcomm includes Globalstar's Band n53 in its new 5G X65 modem. The X65 is Qualcomm's flagship 5G modem and adds global 5G band support for n53.\n\nFEB 17, 2021:\nGLOBALSTAR ANNOUNCES STRATEGIC ALLIANCE WITH XCOM LABS.",
        "created_utc": 1614746978,
        "id": "gpi2hsu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614775778.0
    },
    {
        "author": "maddogenglish",
        "body": "Finally a warm day in Colorado so I'm going golfing tomorrow. I would appreciate it if PLTR, SNDL, QCOM, FCEL, QQQ and CAM bring in some ![img](emote|wsb_emojis|tendies) while I am away. Please make that happen.",
        "created_utc": 1614737247,
        "id": "gphkh88",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614766047.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "5G is a fiercely competitive market. The United States will beat Huawei to establish the global standards and commercial market for security reasons - ergo the most prominent U.S. company is in Globalstar given that it already has trusted partners in both Qualcomm (and Ericsson by association) - both of which bring integrated services to 190+ countries.",
        "created_utc": 1614748269,
        "id": "gpi4hvy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614777069.0
    },
    {
        "author": "Flam3Shot_",
        "body": "With all due respect, I do not agree with your statement about there being direct competitors for most companies between the NASDAQ and NYSE. Strong, long lasting companies like Apple, Microsoft, Nvidia, Qualcomm, etc. hardly have any competition whatsoever in reference to the companies listed in the NYSE (unless you count stagnant/dying firms like Oracle or Nokia, but that’s really stretching it). Only thing I can really think of is Facebook v Twitter and some e-commerce stuff like Alibaba v Amazon. Either way, the examples are seldom. \n\nThat said, I appreciate your advice immensely. Thank you :)",
        "created_utc": 1614747255,
        "id": "gpi2xv4",
        "score": 1,
        "subreddit": "investing",
        "created": 1614776055.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of March\n\n\n\n## Upcoming events for Wednesday, March  3rd\n\n - Stock splits:\n\n    - CLWT @ **3:2** (Payable date: 03/02/2021)\n\n - Expected earnings:\n\n  ACU, AEGN, AEO, AMPE, APT, ASM, ATTO, BBSI, BDR, BF.A, BF.B, BKCC, BKTI, BLCT, BMA, BQ, BXC, CECE, CETX, CFMS, CIX, CLMT, CMTL, CNR, CORR, CTRM, CULP, CZZ, DAKT, DLTR, DPW, DSGX, DY, ENIC, EQX, EVGN, EYE, EYEG, FLMN, FTHM, GHLD, GIFI, GMRE, GPRK, GRP.U, HBB, HDSN, HGEN, HPR, HRTG, IMTX, ISEE, ITRN, JILL, KERN, KIDS, KRON, LINC, MDRR, MESO, MLR, MRVL, MTLS, MYRG, NAV, NC, NEWT, NFH, NM, NMCI, NWPX, OGEN, OKTA, OM, ONCR, OPTN, OSW, OXSQ, PASG, PCOM, PDCO, PNRG, PW, RAIL, RCMT, RDHL, RMNI, RNET, RPTX, RRGB, SBBP, SBOW, SD, SID, SINA, SLNO, SMHI, SNOW, SPKE, SPLK, SPRB, SQM, STKL, SUPV, TAC, TAST, TCOM, TPCO, TPVG, TSHA, UFPT, USDP, VNET, VRM, VRTV, WB, WEN, WHLR, WMC, WPG, WTI, YEXT\n\n - Ex-div:\n\n  ALL, AWI, EQH, ES, ESBK, FANG, FWRD, GLOG, LEA, LZB, MBCN, MOS, NLSN, PTEN, QCOM, RMBI, SSTK, VNOM\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 177K, previous: 174K)\n    - Beige Book\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: 0.249M)\n    - Crude Oil Inventories (consensus: -0.928M, previous: 1.285M)\n    - Cushing Crude Oil Inventories (previous: 2.807M)\n    - Distillate Fuel Production (previous: -0.953M)\n    - EIA Refinery Crude Runs  (previous: -2.589M)\n    - EIA Weekly Distillates Stocks (consensus: -3.035M, previous: -4.969M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 4.6%, previous: -14.5%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Kaplan Speaks\n    - Gasoline Inventories (consensus: -2.300M, previous: 0.012M)\n    - Gasoline Production (previous: -1.295M)\n    - Heating Oil Stockpiles (previous: 0.093M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.0, previous: 59.9)\n    - ISM Non-Manufacturing Employment (previous: 55.2)\n    - ISM Non-Manufacturing New Orders (previous: 61.8)\n    - ISM Non-Manufacturing PMI (consensus: 58.7, previous: 58.7)\n    - ISM Non-Manufacturing Prices (previous: 64.2)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -11.4%)\n    - MBA Purchase Index (previous: 264.9)\n    - Markit Composite PMI (consensus: 58.8, previous: 58.7)\n    - Mortgage Market Index (previous: 790.6)\n    - Mortgage Refinance Index (previous: 3,848.1)\n    - OPEC Meeting\n    - Services PMI (consensus: 58.9, previous: 58.3)\n\n## Upcoming events for Thursday, March  4th\n\n - Stock splits:\n\n    - MYBF @ **105:100** (Payable date: 03/15/2021)\n    - TR @ **103:100** (Payable date: 04/02/2021)\n    - TROLB @ **103:100** (Payable date: 03/26/2021)\n\n - Expected earnings:\n\n  ABUS, ACOR, ADCT, AE, AFIB, AGS, AHCO, AIV, AJX, AKUS, ALXO, AMC, AMTI, ANIK, AQN, ARGX, ASPS, AT, ATC, ATEC, ATHA, AUTL, AVGO, AVGR, BALY, BCOW, BJ, BPMP, BSGM, BURL, BYFC, BZUN, CBIO, CBMB, CCCC, CDAK, CELP, CERT, CHMA, CHMI, CHUY, CIB, CIEN, CIR, CLLS, CLPT, CLXT, CNQ, COHN, COO, COST, CRAI, CRD.A, CRD.B, CRVS, CTSO, CVV, CZNC, DBVT, DMTK, DNN, DRRX, DSSI, DXYN, DYN, EGLE, ELOX, ENZ, ESGC, ETON, EVC, EVFM, EVLO, EYPT, FBRX, FCRD, FIZZ, FLGT, FMTX, FOUR, FPRX, FRGI, FTSI, FULC, GAU, GBLI, GCP, GDYN, GMS, GOL, GPL, GPMT, GPS, GRAY, GSAT, GSL, GWRE, GWRS, HCM, HEAR, HOLI, HRMY, IDT, IMAX, IMMR, INMB, INVE, INZY, ISDR, ISIG, ITOS, JAMF, JG, JW.A, JW.B, JYNT, KBNT, KDMN, KR, KYMR, LRMR, LTRN, MANU, MAXN, MAYS, MCS, MDLA, MEG, MEI, MIK, MLVF, MMX, MOSY, MTCR, MWK, MYSZ, NCMI, NEW, NKSH, NKTX, NNA, NRP, NTCO, NTST, NVIV, NX, OBLN, OBSV, ODC, OPEN, OPNT, ORIC, ORTX, PACK, PBLA, PCVX, PHI, PLYA, PQG, PRPL, PSTX, PVAC, QTT, QUMU, RFL, RLH, RVMD, SALM, SCM, SCOR, SCPE, SDC, SDGR, SENS, SFE, SHG, SHIP, SIGA, SMLP, SMSI, SOHO, SOLY, SPPI, SQFT, SRG, SRLP, STLA, STON, SWBI, SYN, SYRS, TARA, THRY, TLS, TMBR, TOMZ, TRIN, TTC, TTOO, TWI, VBIV, VERI, VLGEA, VNRX, VRAY, VSEC, VTRS, VYNE, WPP, WRAP, WVE, XFOR, YPF\n\n - Ex-div:\n\n  AFB, AGR, AJG, AMNB, BAC, BBL, BLK, BOTJ, BRKR, BRKS, CASS, CHRW, D, DAN, DEA, DRD, EPC, FLIR, FLO, FNB, FRME, GBDC, GPC, HSII, ICBK, KMB, KNX, LIN, MBWM, NAVI, NCB, NUW, NVS, OC, PCH, PEP, PTVCA, PTVCB, RF, RIO, SAFT, SCL, SEE, SLM, TEX, TFX, TGNA, TR, TRST, TT, UFCS, WEN, WING, WY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.040%)\n    - Challenger Job Cuts (previous: 79.552K)\n    - Continuing Jobless Claims (consensus: 4,300K, previous: 4,419K)\n    - Durables Excluding Defense (previous: 2.3%)\n    - Factory Orders (consensus: 2.1%, previous: 1.1%)\n    - Factory orders ex transportation (previous: 1.4%)\n    - Initial Jobless Claims (consensus: 750K, previous: 730K)\n    - Jobless Claims 4-Week Avg. (previous: 807.75K)\n    - Natural Gas Storage (consensus: -333B, previous: -338B)\n    - Nonfarm Productivity (consensus: -4.7%, previous: -4.8%)\n    - OPEC Meeting\n    - Unit Labor Costs (consensus: 6.6%, previous: 6.8%)\n\n## Upcoming events for Friday, March  5th\n\n - Stock splits:\n\n    - APH @ **2:1** (Payable date: 03/04/2021)\n\n - Expected earnings:\n\n  AAMC, AIM, ALUS, ANAT, ARDX, ATLC, ATLO, AYRO, BH.A, BHAT, BIG, BORR, BPTH, BRID, CCNC, CEI, CHEK, CLPS, CMPI, COE, COMS, CRH, DS, DXPE, EML, EXN, FENC, FGBI, FHTX, FSEA, FSTX, GGAL, GLP, GSX, HIBB, HMG, HURC, HUSA, IMRA, INBX, INTT, IPDN, ITCB, KB, KMPH, KVHI, MIST, NBAC, NWLI, OFS, OLB, ONCY, PCSA, PDLB, PLPC, PMVP, PNBK, PPSI, PRPO, PSO, PTMN, RUTH, SAMG, SPLP, STRR, STTK, SUP, TGS, UBOH, VET, VSTA\n\n - Ex-div:\n\n  ANAT, BF.A, BF.B, CCBG, CDK, CNS, EVRG, EXC, FAF, FDX, GE, HBB, HL, HTGC, HWC, JBT, JKHY, JOE, KSU, LUMN, LYB, NC, OAS, OMP, PATK, PBIP, RTLR, STRA, SVBI, SYX, TPL, TROX, UGP, VALE\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 5.3%, previous: 5.4%)\n    - Average Hourly Earnings (consensus: 0.2%, previous: 0.2%)\n    - Average Weekly Hours (consensus: 34.9, previous: 35.0)\n    - CFTC Aluminium speculative net positions (previous: 4.7K)\n    - CFTC Copper speculative net positions (previous: 75.4K)\n    - CFTC Corn speculative net positions (previous: 529.8K)\n    - CFTC Crude Oil speculative net positions (previous: 511.8K)\n    - CFTC Gold speculative net positions (previous: 215.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.4K)\n    - CFTC Natural Gas speculative net positions (previous: 28.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -31.3K)\n    - CFTC Silver speculative net positions (previous: 47.6K)\n    - CFTC Soybeans speculative net positions (previous: 239.8K)\n    - CFTC Wheat speculative net positions (previous: 27.4K)\n    - Consumer Credit (consensus: 12.00B, previous: 9.73B)\n    - Exports (previous: 184.20B)\n    - Government Payrolls (previous: 43.0K)\n    - Imports (previous: 252.30B)\n    - Manufacturing Payrolls (consensus: 12K, previous: -10K)\n    - Nonfarm Payrolls (consensus: 180K, previous: 49K)\n    - Participation Rate (previous: 61.4%)\n    - Private Nonfarm Payrolls (consensus: 194K, previous: 6K)\n    - Trade Balance (consensus: -67.50B, previous: -66.60B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 305)\n    - U.S. Baker Hughes Total Rig Count (previous: 397)\n    - U6 Unemployment Rate (previous: 11.1%)\n    - US Federal Budget (previous: -430.0B)\n    - Unemployment Rate (consensus: 6.3%, previous: 6.3%)\n\n^^^^2021-03-03",
        "created_utc": 1614769221,
        "id": "gpisq8x",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1614798021.0
    },
    {
        "author": "suhdanny",
        "body": "QCOM. It currently trades at a historic low in terms of its P/S ratio and also is cheap compated to other chip companies in terms of P/E. The growth potential is huge regarding 5G, AR/VR, autonomous driving ... etc. It’s been on a downhill since the earning’s report, but I think this stock deserves at least a double of current price.",
        "created_utc": 1614782760,
        "id": "gpjdmyd",
        "score": 12,
        "subreddit": "stocks",
        "created": 1614811560.0
    },
    {
        "author": "SLOPPYTACO666",
        "body": "Getting ripped on my QCOM shares right now-bought in at $146.  I know it will be back there soon, just have to wait it out. People who haven't should definitely buy in right now though.",
        "created_utc": 1614790858,
        "id": "gpjw2g9",
        "score": 9,
        "subreddit": "stocks",
        "created": 1614819658.0
    },
    {
        "author": "notpr1m",
        "body": "Yes. Buy AMD. Better tech than Intel but cheaper than NVIDIA, no fabrication operations because they were losing money on it a few years ago so sold it off to focus on design, which I think gives them more flexibility to adapt to capitalize on any investments that could be coming from the public sector, and they probably aren’t bleeding money from production constraints like the others. Probably the best CEO in the space as well. \n\nI also like Qualcomm a lot for similar reasons, but also because they’re positioned to win big in 5G and will probably do well in the IoT space as well. Much more mature company too with a nice dividend ($.65/share).",
        "created_utc": 1614828778,
        "id": "gpm4pgl",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614857578.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "$GSAT = buyout target \n\n   QUALCOMM- and -ERICSSON \n\nAPR 2, 2019:\nFormer Qualcomm boss pivots toward 5G startup XCOM.\n\nSEP 17, 2020: \nEricsson, Qualcomm, and U.S. Cellular announce first ever successful extended range 5G NR millimeter Wave (mmWave) data call in the U.S. on a commercial network.\n\nOCT 9, 2020:\nEricsson selected for U.S .DOD 5G testing.\n\nNOV 11, 2020:\nEricsson stock growth is tied to 5G expansion.\n\nFEB 9, 2021: \nQualcomm includes Globalstar's Band n53 in its new 5G X65 modem. The X65 is Qualcomm's flagship 5G modem and adds global 5G band support for n53.\n\nFEB 17, 2021:\nGLOBALSTAR ANNOUNCES STRATEGIC ALLIANCE WITH XCOM LABS.",
        "created_utc": 1614746978,
        "id": "gpi2hsu",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614775778.0
    },
    {
        "author": "ExtensionAd2828",
        "body": "Youre dumb lol they signed a deal w qualcomm and it mooned",
        "created_utc": 1614793751,
        "id": "gpk2uj9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614822551.0
    },
    {
        "author": "maddogenglish",
        "body": "Finally a warm day in Colorado so I'm going golfing tomorrow. I would appreciate it if PLTR, SNDL, QCOM, FCEL, QQQ and CAM bring in some ![img](emote|wsb_emojis|tendies) while I am away. Please make that happen.",
        "created_utc": 1614737247,
        "id": "gphkh88",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614766047.0
    },
    {
        "author": "Psychological_Dot541",
        "body": "5G is a fiercely competitive market. The United States will beat Huawei to establish the global standards and commercial market for security reasons - ergo the most prominent U.S. company is in Globalstar given that it already has trusted partners in both Qualcomm (and Ericsson by association) - both of which bring integrated services to 190+ countries.",
        "created_utc": 1614748269,
        "id": "gpi4hvy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614777069.0
    },
    {
        "author": "Retard_2028",
        "body": "I think all this chip shortage is geopolitics and the nation suppliers are trying to get the new administration’s attention. Or it’s an internal propaganda to fast track and establish a US mfg of chips vs relying on importing them. Even Intel and Qualcomm all rely on overseas mfg of their chips.",
        "created_utc": 1614831281,
        "id": "gpm97zj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614860081.0
    },
    {
        "author": "BurntLumpia808",
        "body": "2.98 and it kept dropping since then. That day they announced a partnership with qualcomm",
        "created_utc": 1614836529,
        "id": "gpmhjpw",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1614865329.0
    },
    {
        "author": "bernie638",
        "body": "Fine.  I bought 197 shares of Qualcomm QCOM in march of 2015 for $68.  I bought another 23 shares in November 2015 for $59.  I bought another 30 in January 2019 for $55.  When it finally jumped I started selling 50 at $105, then 100 at $146.  I still have 100 left.\n\nThe important thing was they were paying me over 5% in dividends to wait,  so I did.",
        "created_utc": 1614852877,
        "id": "gpn033k",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614881677.0
    },
    {
        "author": "hi-imBen",
        "body": "A)  They are trying to say the semiconductor shortage could be manufactured (intentionally shutting down factories/restricting supply to increase the price they can charge).  While this isn't an insane theory, it is not what is happening now.\n\n\nB)  Doesn't look like they are talking about any one stock specifically, but the semiconductor industry.\n\n\nC)  Please buy all the semiconductor stocks/ETFs I'm holding :)   ADI, MXIM, MCHP, TXN, SITM, MPWR, ON, NXPI, MRVL, QCOM, XLNX, SOXX, PSI, SMH",
        "created_utc": 1614809529,
        "id": "gpl38tb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614838329.0
    },
    {
        "author": "OlyBomaye",
        "body": "i have bought the dip on everything from DG to QCOM to FSLY to SQ to NEE to CSIQ to MRVL to U to EA to TGT and it all.  keeps.  dipping.",
        "created_utc": 1614836653,
        "id": "gpmhq1n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614865453.0
    },
    {
        "author": "BotJovi35",
        "body": "This looks like it popped when the Qualcomm deal was announced, then has been trickling back down.",
        "created_utc": 1614840415,
        "id": "gpmmmwa",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1614869215.0
    },
    {
        "author": "labattblueenthusiast",
        "body": "I recently saw an [article](https://www.google.com/amp/s/www.marketwatch.com/amp/story/25-shares-of-companies-backed-by-rapid-earnings-growth-as-the-economy-reopens-11614704694) on MarketWatch that lists undervalued stocks based on potential earnings as the economy reopens. They have a great chart that breaks down company, industry, estimated earnings per share in a 12 month period, the trailing EPS, sales growth (if applicable), speculative price target and a dividend yield. This is a very thorough list and has companies such as many major banks, Cummins (CMI), Qualcomm (QCOM), World Fuel Services (INT) to name a few (there are many more). My personal choice would be KemPharm Inc (KMPH). Outlined [here](https://money.cnn.com/quote/forecast/forecast.html?symb=KMPH) is a CNN Business breakdown giving the now $16 share a $28 price target (price is on the rise since last night when they received their FDA approval.\n\nEDIT: Do your own DD, I am not a financial advisor, can not confirm nor deny stocks only go up.",
        "created_utc": 1614784020,
        "id": "gpjgd55",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614812820.0
    },
    {
        "author": "Flam3Shot_",
        "body": "With all due respect, I do not agree with your statement about there being direct competitors for most companies between the NASDAQ and NYSE. Strong, long lasting companies like Apple, Microsoft, Nvidia, Qualcomm, etc. hardly have any competition whatsoever in reference to the companies listed in the NYSE (unless you count stagnant/dying firms like Oracle or Nokia, but that’s really stretching it). Only thing I can really think of is Facebook v Twitter and some e-commerce stuff like Alibaba v Amazon. Either way, the examples are seldom. \n\nThat said, I appreciate your advice immensely. Thank you :)",
        "created_utc": 1614747255,
        "id": "gpi2xv4",
        "score": 1,
        "subreddit": "investing",
        "created": 1614776055.0
    },
    {
        "author": "jwonz_",
        "body": "Yeah, Tesla is one of the main cards holding up the whole house.\n\nTime for puts! &gt;:) It's basically the year 2000 again, and TSLA is like QCOM.\n\n&amp;#x200B;\n\n&gt; There are huge incentives to stop that from happening \n\nCool, but fair valuation is fair valuation. TSLA 300 might happen, not a meme.",
        "created_utc": 1614810305,
        "id": "gpl4xbs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614839105.0
    },
    {
        "author": "vacalicious",
        "body": "Is today the day that the market pukes and we move solidly under 3800 again? Tough to tell. We *are* due for a relief rally, though it does not look like volatility will simply disappear overnight. If/when we do drop precipitously, and the blue chippers go on fire sale, I'm looking at MSFT, AAPL, TGT, QCOM and ETSY, along with WBA and Fastly.",
        "created_utc": 1614868496,
        "id": "gpnmp0m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614897296.0
    },
    {
        "author": "Cretelife27",
        "body": "What do you think about global star they teamed up with QUALCOMM",
        "created_utc": 1614810098,
        "id": "gpl4h8m",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1614838898.0
    },
    {
        "author": "2litersleeper",
        "body": "I have leaps in the following:  QCOM  TAN  FAN   ARKK  ARKG   T  AMD  ICLN   GNOG  TAK  NIO  CLF",
        "created_utc": 1614809395,
        "id": "gpl2y4m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614838195.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of March\n\n\n\n## Upcoming events for Wednesday, March  3rd\n\n - Stock splits:\n\n    - CLWT @ **3:2** (Payable date: 03/02/2021)\n\n - Expected earnings:\n\n  ACU, AEGN, AEO, AMPE, APT, ASM, ATTO, BBSI, BDR, BF.A, BF.B, BKCC, BKTI, BLCT, BMA, BQ, BXC, CECE, CETX, CFMS, CIX, CLMT, CMTL, CNR, CORR, CTRM, CULP, CZZ, DAKT, DLTR, DPW, DSGX, DY, ENIC, EQX, EVGN, EYE, EYEG, FLMN, FTHM, GHLD, GIFI, GMRE, GPRK, GRP.U, HBB, HDSN, HGEN, HPR, HRTG, IMTX, ISEE, ITRN, JILL, KERN, KIDS, KRON, LINC, MDRR, MESO, MLR, MRVL, MTLS, MYRG, NAV, NC, NEWT, NFH, NM, NMCI, NWPX, OGEN, OKTA, OM, ONCR, OPTN, OSW, OXSQ, PASG, PCOM, PDCO, PNRG, PW, RAIL, RCMT, RDHL, RMNI, RNET, RPTX, RRGB, SBBP, SBOW, SD, SID, SINA, SLNO, SMHI, SNOW, SPKE, SPLK, SPRB, SQM, STKL, SUPV, TAC, TAST, TCOM, TPCO, TPVG, TSHA, UFPT, USDP, VNET, VRM, VRTV, WB, WEN, WHLR, WMC, WPG, WTI, YEXT\n\n - Ex-div:\n\n  ALL, AWI, EQH, ES, ESBK, FANG, FWRD, GLOG, LEA, LZB, MBCN, MOS, NLSN, PTEN, QCOM, RMBI, SSTK, VNOM\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 177K, previous: 174K)\n    - Beige Book\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: 0.249M)\n    - Crude Oil Inventories (consensus: -0.928M, previous: 1.285M)\n    - Cushing Crude Oil Inventories (previous: 2.807M)\n    - Distillate Fuel Production (previous: -0.953M)\n    - EIA Refinery Crude Runs  (previous: -2.589M)\n    - EIA Weekly Distillates Stocks (consensus: -3.035M, previous: -4.969M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 4.6%, previous: -14.5%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Kaplan Speaks\n    - Gasoline Inventories (consensus: -2.300M, previous: 0.012M)\n    - Gasoline Production (previous: -1.295M)\n    - Heating Oil Stockpiles (previous: 0.093M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.0, previous: 59.9)\n    - ISM Non-Manufacturing Employment (previous: 55.2)\n    - ISM Non-Manufacturing New Orders (previous: 61.8)\n    - ISM Non-Manufacturing PMI (consensus: 58.7, previous: 58.7)\n    - ISM Non-Manufacturing Prices (previous: 64.2)\n    - MBA 30-Year Mortgage Rate (previous: 3.08%)\n    - MBA Mortgage Applications (previous: -11.4%)\n    - MBA Purchase Index (previous: 264.9)\n    - Markit Composite PMI (consensus: 58.8, previous: 58.7)\n    - Mortgage Market Index (previous: 790.6)\n    - Mortgage Refinance Index (previous: 3,848.1)\n    - OPEC Meeting\n    - Services PMI (consensus: 58.9, previous: 58.3)\n\n## Upcoming events for Thursday, March  4th\n\n - Stock splits:\n\n    - MYBF @ **105:100** (Payable date: 03/15/2021)\n    - TR @ **103:100** (Payable date: 04/02/2021)\n    - TROLB @ **103:100** (Payable date: 03/26/2021)\n\n - Expected earnings:\n\n  ABUS, ACOR, ADCT, AE, AFIB, AGS, AHCO, AIV, AJX, AKUS, ALXO, AMC, AMTI, ANIK, AQN, ARGX, ASPS, AT, ATC, ATEC, ATHA, AUTL, AVGO, AVGR, BALY, BCOW, BJ, BPMP, BSGM, BURL, BYFC, BZUN, CBIO, CBMB, CCCC, CDAK, CELP, CERT, CHMA, CHMI, CHUY, CIB, CIEN, CIR, CLLS, CLPT, CLXT, CNQ, COHN, COO, COST, CRAI, CRD.A, CRD.B, CRVS, CTSO, CVV, CZNC, DBVT, DMTK, DNN, DRRX, DSSI, DXYN, DYN, EGLE, ELOX, ENZ, ESGC, ETON, EVC, EVFM, EVLO, EYPT, FBRX, FCRD, FIZZ, FLGT, FMTX, FOUR, FPRX, FRGI, FTSI, FULC, GAU, GBLI, GCP, GDYN, GMS, GOL, GPL, GPMT, GPS, GRAY, GSAT, GSL, GWRE, GWRS, HCM, HEAR, HOLI, HRMY, IDT, IMAX, IMMR, INMB, INVE, INZY, ISDR, ISIG, ITOS, JAMF, JG, JW.A, JW.B, JYNT, KBNT, KDMN, KR, KYMR, LRMR, LTRN, MANU, MAXN, MAYS, MCS, MDLA, MEG, MEI, MIK, MLVF, MMX, MOSY, MTCR, MWK, MYSZ, NCMI, NEW, NKSH, NKTX, NNA, NRP, NTCO, NTST, NVIV, NX, OBLN, OBSV, ODC, OPEN, OPNT, ORIC, ORTX, PACK, PBLA, PCVX, PHI, PLYA, PQG, PRPL, PSTX, PVAC, QTT, QUMU, RFL, RLH, RVMD, SALM, SCM, SCOR, SCPE, SDC, SDGR, SENS, SFE, SHG, SHIP, SIGA, SMLP, SMSI, SOHO, SOLY, SPPI, SQFT, SRG, SRLP, STLA, STON, SWBI, SYN, SYRS, TARA, THRY, TLS, TMBR, TOMZ, TRIN, TTC, TTOO, TWI, VBIV, VERI, VLGEA, VNRX, VRAY, VSEC, VTRS, VYNE, WPP, WRAP, WVE, XFOR, YPF\n\n - Ex-div:\n\n  AFB, AGR, AJG, AMNB, BAC, BBL, BLK, BOTJ, BRKR, BRKS, CASS, CHRW, D, DAN, DEA, DRD, EPC, FLIR, FLO, FNB, FRME, GBDC, GPC, HSII, ICBK, KMB, KNX, LIN, MBWM, NAVI, NCB, NUW, NVS, OC, PCH, PEP, PTVCA, PTVCB, RF, RIO, SAFT, SCL, SEE, SLM, TEX, TFX, TGNA, TR, TRST, TT, UFCS, WEN, WING, WY\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.040%)\n    - Challenger Job Cuts (previous: 79.552K)\n    - Continuing Jobless Claims (consensus: 4,300K, previous: 4,419K)\n    - Durables Excluding Defense (previous: 2.3%)\n    - Factory Orders (consensus: 2.1%, previous: 1.1%)\n    - Factory orders ex transportation (previous: 1.4%)\n    - Initial Jobless Claims (consensus: 750K, previous: 730K)\n    - Jobless Claims 4-Week Avg. (previous: 807.75K)\n    - Natural Gas Storage (consensus: -333B, previous: -338B)\n    - Nonfarm Productivity (consensus: -4.7%, previous: -4.8%)\n    - OPEC Meeting\n    - Unit Labor Costs (consensus: 6.6%, previous: 6.8%)\n\n## Upcoming events for Friday, March  5th\n\n - Stock splits:\n\n    - APH @ **2:1** (Payable date: 03/04/2021)\n\n - Expected earnings:\n\n  AAMC, AIM, ALUS, ANAT, ARDX, ATLC, ATLO, AYRO, BH.A, BHAT, BIG, BORR, BPTH, BRID, CCNC, CEI, CHEK, CLPS, CMPI, COE, COMS, CRH, DS, DXPE, EML, EXN, FENC, FGBI, FHTX, FSEA, FSTX, GGAL, GLP, GSX, HIBB, HMG, HURC, HUSA, IMRA, INBX, INTT, IPDN, ITCB, KB, KMPH, KVHI, MIST, NBAC, NWLI, OFS, OLB, ONCY, PCSA, PDLB, PLPC, PMVP, PNBK, PPSI, PRPO, PSO, PTMN, RUTH, SAMG, SPLP, STRR, STTK, SUP, TGS, UBOH, VET, VSTA\n\n - Ex-div:\n\n  ANAT, BF.A, BF.B, CCBG, CDK, CNS, EVRG, EXC, FAF, FDX, GE, HBB, HL, HTGC, HWC, JBT, JKHY, JOE, KSU, LUMN, LYB, NC, OAS, OMP, PATK, PBIP, RTLR, STRA, SVBI, SYX, TPL, TROX, UGP, VALE\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 5.3%, previous: 5.4%)\n    - Average Hourly Earnings (consensus: 0.2%, previous: 0.2%)\n    - Average Weekly Hours (consensus: 34.9, previous: 35.0)\n    - CFTC Aluminium speculative net positions (previous: 4.7K)\n    - CFTC Copper speculative net positions (previous: 75.4K)\n    - CFTC Corn speculative net positions (previous: 529.8K)\n    - CFTC Crude Oil speculative net positions (previous: 511.8K)\n    - CFTC Gold speculative net positions (previous: 215.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -5.4K)\n    - CFTC Natural Gas speculative net positions (previous: 28.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -31.3K)\n    - CFTC Silver speculative net positions (previous: 47.6K)\n    - CFTC Soybeans speculative net positions (previous: 239.8K)\n    - CFTC Wheat speculative net positions (previous: 27.4K)\n    - Consumer Credit (consensus: 12.00B, previous: 9.73B)\n    - Exports (previous: 184.20B)\n    - Government Payrolls (previous: 43.0K)\n    - Imports (previous: 252.30B)\n    - Manufacturing Payrolls (consensus: 12K, previous: -10K)\n    - Nonfarm Payrolls (consensus: 180K, previous: 49K)\n    - Participation Rate (previous: 61.4%)\n    - Private Nonfarm Payrolls (consensus: 194K, previous: 6K)\n    - Trade Balance (consensus: -67.50B, previous: -66.60B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 305)\n    - U.S. Baker Hughes Total Rig Count (previous: 397)\n    - U6 Unemployment Rate (previous: 11.1%)\n    - US Federal Budget (previous: -430.0B)\n    - Unemployment Rate (consensus: 6.3%, previous: 6.3%)\n\n^^^^2021-03-03",
        "created_utc": 1614769221,
        "id": "gpisq8x",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1614798021.0
    },
    {
        "author": "ShacklefordRusty42",
        "body": "I got some bad advice and invested in qualcomm earlier this year. It's getting to that 7 to 8 percent loss point. Should I dump this turd early?",
        "created_utc": 1614832793,
        "id": "gpmbs7l",
        "score": 1,
        "subreddit": "investing",
        "created": 1614861593.0
    },
    {
        "author": "KingCuerv0",
        "body": "Same. I own leaps on QCOM, my concern is if apple comes out with their own modem. VMW is another good play to look at and very cheap as well, Dell plans to spin them off in September but no one is talking about it. Options are cheap and I think a lot of upside from here, especially when they announce a new ceo",
        "created_utc": 1614850464,
        "id": "gpmxm2i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614879264.0
    },
    {
        "author": "Mymomdidwhat",
        "body": "Qualcomm",
        "created_utc": 1614790415,
        "id": "gpjv0f3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614819215.0
    }
]