[
    {
        "author": "hi-imBen",
        "body": "A)  They are trying to say the semiconductor shortage could be manufactured (intentionally shutting down factories/restricting supply to increase the price they can charge).  While this isn't an insane theory, it is not what is happening now.\n\n\nB)  Doesn't look like they are talking about any one stock specifically, but the semiconductor industry.\n\n\nC)  Please buy all the semiconductor stocks/ETFs I'm holding :)   ADI, MXIM, MCHP, TXN, SITM, MPWR, ON, NXPI, MRVL, QCOM, XLNX, SOXX, PSI, SMH",
        "created_utc": 1614809529,
        "id": "gpl38tb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614838329.0
    },
    {
        "author": "Amazing_Succotash677",
        "body": "AMD is still a buy, really anywhere below 90 imo, QCOM, AVGO, TXN, ADI all good value at current price",
        "created_utc": 1615928016,
        "id": "gr5yiv2",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615956816.0
    },
    {
        "author": "East-Art1510",
        "body": "As a DIYer, I always had a sentimental connection to ADI, HON, MCPH, MXIM, and TXN. Lots of nice parts in their catalogs. They seem a bit overvalued right now though.",
        "created_utc": 1615906387,
        "id": "gr4mchv",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615935187.0
    },
    {
        "author": "bonejohnson8",
        "body": "TER - Teradyne DD - the name means a very powerful force. 1,000,000,000,000 dynes = 10 meganewtons (2,248,089 pounds-force or 1,019,716 kilograms-force). Now that's a lot of damage. \n\nTheir customers include Samsung, Qualcomm, Intel, Analog Devices, Texas Instruments and IBM.  They make automatic test equipment, which I imagine is giving the SAT to semiconductors. This will make the robots smarter. Smarter robots = more money. They are at a discount right now, this is a play that simply cannot go tits up.",
        "created_utc": 1616883314,
        "id": "gsin9f4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1616912114.0
    },
    {
        "author": "Itsme_eljefe",
        "body": "I’m still here buying the chip dip...\n\nAMAT, ON, MRVL, ADI, TSM, AMD, MU, CRUS, MX, SOXL, DD, SLCA.\n\nThe chip boom is about to go atomic!\n\n😁 heard it here first",
        "created_utc": 1617004394,
        "id": "gsnz6dc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617033194.0
    },
    {
        "author": "predated0",
        "body": "I have seen Phillips, Trotec and Plasmamade being mentioned in active testing. Besides that, Microsoft and Ansys are closely following the project.   \n\n\nSource: (you probably need to translate it through Google, but you can simply ctrl+f the above names)\n\n[https://www.ed.nl/eindhoven/tu-e-onderzoek-biedt-sportscholen-hoop-apparaten-verwijderen-aerosolen-uit-lucht\\~a0ea76e3/](https://www.ed.nl/eindhoven/tu-e-onderzoek-biedt-sportscholen-hoop-apparaten-verwijderen-aerosolen-uit-lucht~a0ea76e3/)  \n\n\nAs for sales, it's not for sale yet. People have been researching and developing this technology recently. The biggest issue is that purifiers are extremely costly and can cause more harm than good if they arent installed properly. They want to spend a lot of money on marketing to properly educate people how and where to install it, so I doubt its going to cost 45k$, probably more towards 50-60k$, but that is still a massive difference.\n\nAs for how it will end up performing on the stock market, I doubt the stock will keep rising, but I am fairly certain that it will at the very least spike once it is proven to have any positive results on covid, let alone that a lot of aging purifiers can be replaced with higher end hardware for the same cost.  \n\n\nAs for which ticker belongs to the company providing the new technology, I have no clue exactly, but according to other comments, there is vyst(for cheap play), LLC, trox, carr, jci(carr and jci might already be too late to invest), xiaomi, haier and midea(last three for china market). Not to forget the prototype companies Phillips, Trotec and Plasmamade ofcourse.",
        "created_utc": 1615174311,
        "id": "gq699lr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615203111.0
    },
    {
        "author": "OliveSorry",
        "body": "I like ansys at its current levels- i am an engineer and have experience with their products. However i am waiting for it to stop falling before i buy",
        "created_utc": 1614796583,
        "id": "gpk9gji",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614825383.0
    }
]