[
    {
        "author": "StockGuy12347",
        "body": "Made mostly on NVDA, MSFT, and AMZN LEAPS. Did some dumb panic sells during the COVID crash, but luckily bought back in right away.",
        "created_utc": 1635533230,
        "id": "hijp8s9",
        "score": 1943,
        "subreddit": "wallstreetbets",
        "created": 1635562030.0
    },
    {
        "author": "StockGuy12347",
        "body": "I’d hafta go back and look but almost positive they were ST options plays on NVDA and MSFT. \n\nI’ve been long NVDA and MSFT as my largest positions ever since then.",
        "created_utc": 1635537271,
        "id": "hijzhip",
        "score": 619,
        "subreddit": "wallstreetbets",
        "created": 1635566071.0
    },
    {
        "author": "sensible_minority",
        "body": "actually if you're younger you wouldn't know but in the 2000s MSFT was a shit stock",
        "created_utc": 1635540469,
        "id": "hik7lyx",
        "score": 515,
        "subreddit": "wallstreetbets",
        "created": 1635569269.0
    },
    {
        "author": "throwawaygoawaynz",
        "body": "No. \n\nI have yet to see a slave working at Microsoft. I do see a lot of well looked after employees though, and a lot of money being spent on sustainability, security, AI for good, etc.\n\nBut hey, this is Reddit.",
        "created_utc": 1635204185,
        "id": "hi1r0ga",
        "score": 475,
        "subreddit": "wallstreetbets",
        "created": 1635232985.0
    },
    {
        "author": "RajivChaudrii",
        "body": "I've seen this time and again... it really looks like you're trying your hardest to convince yourself to hold or invest in Chinese stocks because they look \"cheap\" or have great growth potential.  And time and again, these same Chinese stocks are outperformed by American counterparts with tons less risk and no threat of CCP sword of damocles over their heads.  Had you invested in Microsoft, Google, FB, or any FANG, you would have outperformed these Chinese stocks dramatically.\n\nJust because China is economically powerful doesn't mean you, especially an international investor, get to benefit.  The CCP's goal is for China to become more powerful at your expense, not your gain.",
        "created_utc": 1633297097,
        "id": "hf9z151",
        "score": 331,
        "subreddit": "investing",
        "created": 1633325897.0
    },
    {
        "author": "Chromewave9",
        "body": "MSFT made $58 billion from revenue of $160 billion. It's a money printing machine.",
        "created_utc": 1634682175,
        "id": "hhagegk",
        "score": 292,
        "subreddit": "stocks",
        "created": 1634710975.0
    },
    {
        "author": "LambdaLambo",
        "body": "MSFT has the cleanest all-time chart",
        "created_utc": 1635528810,
        "id": "hijdwo1",
        "score": 268,
        "subreddit": "stocks",
        "created": 1635557610.0
    },
    {
        "author": "Onepen99",
        "body": "When Microsoft went up 5% this week, I sold thinking I was smart and the next day it would go down again like the meme stocks and I would buy back. No, it kept rising. I bought back my position again on Friday paying around an extra 2% for my error.",
        "created_utc": 1635616097,
        "id": "hio21ju",
        "score": 247,
        "subreddit": "wallstreetbets",
        "created": 1635644897.0
    },
    {
        "author": "Gandalfs_Shaft48",
        "body": "This is very doable. These CALLs will print within the next couple of weeks if Microsoft simply announces that they've developed and have begun production on a new Time Machine.",
        "created_utc": 1634057005,
        "id": "hgdfmbv",
        "score": 223,
        "subreddit": "wallstreetbets",
        "created": 1634085805.0
    },
    {
        "author": "Mister_Titty",
        "body": "Microsoft is now the most valuable software company in the world.\n\nAgain.",
        "created_utc": 1635539160,
        "id": "hik4cmv",
        "score": 215,
        "subreddit": "stocks",
        "created": 1635567960.0
    },
    {
        "author": "KanteWorkRate",
        "body": "Keeping my eye on GOOGL and MSFT",
        "created_utc": 1633359879,
        "id": "hfcw3k9",
        "score": 212,
        "subreddit": "stocks",
        "created": 1633388679.0
    },
    {
        "author": "NOTaRussianTrollAcct",
        "body": "I think it was \"My Baby Called Me Microsoft\" by P. Ness and the Hugh Jasses",
        "created_utc": 1635542360,
        "id": "hikc7en",
        "score": 212,
        "subreddit": "wallstreetbets",
        "created": 1635571160.0
    },
    {
        "author": "Netveg",
        "body": "Started with BAC, INTC, MSFT, Sprint, NOK, F, ARI and FCX.  Dumped slow performers of Sprint, NOK, ARI, F, and FCX to fund a house addition while minimizing capital gains tax.  Subsequently re-added ARI, and new positions in AAPL, SPOT, and POAHY.  Currently evaluating adding positions in ROOT and PLUG.",
        "created_utc": 1634257823,
        "id": "hgofp1x",
        "score": 211,
        "subreddit": "StockMarket",
        "created": 1634286623.0
    },
    {
        "author": "daemyn",
        "body": "Looks like a lot of reasons. Mine is: the ticker looks like MSFT if I'm drunk enough.",
        "created_utc": 1635632171,
        "id": "hip2prh",
        "score": 204,
        "subreddit": "wallstreetbets",
        "created": 1635660971.0
    },
    {
        "author": "erik325i",
        "body": "AAPL and MSFT are both good buy and hold stocks.",
        "created_utc": 1635028582,
        "id": "hhsjww5",
        "score": 200,
        "subreddit": "stocks",
        "created": 1635057382.0
    },
    {
        "author": "shiasuuu",
        "body": "Does microsoft really?",
        "created_utc": 1635193280,
        "id": "hi11m7q",
        "score": 183,
        "subreddit": "wallstreetbets",
        "created": 1635222080.0
    },
    {
        "author": "high_roller_dude",
        "body": "msft &gt;&gt;&gt;&gt;&gt; amzn\n\nhigher margin business, higher moat, better operating consistency.\n\nmsft is basically like a tank",
        "created_utc": 1635530169,
        "id": "hijhgiv",
        "score": 175,
        "subreddit": "stocks",
        "created": 1635558969.0
    },
    {
        "author": "airelfacil",
        "body": "Also MAGMA if you want Netflix replaced by Microsoft",
        "created_utc": 1635611728,
        "id": "hinrhif",
        "score": 150,
        "subreddit": "wallstreetbets",
        "created": 1635640528.0
    },
    {
        "author": "theJimmybob",
        "body": "Some implies moves for earnings next week - 1089 companies reporting. And these are up/down not just up idiots:\n\n&amp;#x200B;\n\n$AAPL 3.3%  \n$AMZN 4.6%  \n$GOOGL 4.5%  \n$MSFT 3.1%  \n$FB 6.6%  \n$LOGI 8.9%  \n$AMD 6.7%  \n$TWTR 11.1%  \n$SHOP 6.5%  \n$MA 3.7%  \n$V 3.1%  \n$TWLO 7.6%  \n$UPWK 15.3%  \n$NOW 5.3%  \n$ALGN 8.3%  \n$CAT 4.2%  \n$BA 4.4%  \n$UPS 5.1%  \n$GE 5.0%  \n$LMT 2.7%  \n$MMM 3.3%  \n$SHW 5.2%  \n$JBLU 9.4%  \n$HAS 7.2%  \n$FFIV 5.7%  \n$QS 9.6%  \n$GM 5.3%  \n$SPOT 7.0%  \n$MCD 2.9%  \n$HOG 8.8%  \n$GRMN 6.0%  \n$CME 3.1%  \n$F 5.7%  \n$TDOC 7.0%  \n$EBAY 5.9%  \n$IRBT 11.3%  \n$ORLY 5.4%  \n$TREE 13.5%  \n$ABMD 9.7%  \n$OSTK 10.7%  \n$YUM 3.8%  \n$SBUX 4.2%  \n$X 8.2%  \n$DXCM 9.7%  \n$GILD 3.6%  \n$TEAM 8.5%  \n$DECK 10.6%  \n$ABBV 3.0%  \n$CVX 2.6%",
        "created_utc": 1634994267,
        "id": "hhqlf9u",
        "score": 147,
        "subreddit": "wallstreetbets",
        "created": 1635023067.0
    },
    {
        "author": "one8e4",
        "body": "I'd buy MSFT over apple",
        "created_utc": 1635526444,
        "id": "hij7sfs",
        "score": 134,
        "subreddit": "stocks",
        "created": 1635555244.0
    },
    {
        "author": "Radiant-Gradient",
        "body": "GAMMA is way better\n\nGoogle - Apple - Microsoft - Meta - Amazon\n\nCuz fuck Alaphabet just call it Google like everyone does anyway",
        "created_utc": 1635617168,
        "id": "hio4mek",
        "score": 130,
        "subreddit": "wallstreetbets",
        "created": 1635645968.0
    },
    {
        "author": "4DChessSPX",
        "body": "Probably MSFT. Zoom out on the chart, it's really an unstoppable behemoth.",
        "created_utc": 1635017342,
        "id": "hhrv8rq",
        "score": 121,
        "subreddit": "stocks",
        "created": 1635046142.0
    },
    {
        "author": "SubHomestead",
        "body": "TAGMAN\n\nTSLA AAPL GOOGL MSFT AMZN NVDA",
        "created_utc": 1635644507,
        "id": "hiprjgq",
        "score": 119,
        "subreddit": "stocks",
        "created": 1635673307.0
    },
    {
        "author": "BornShook",
        "body": "Brilliant post on multiple levels. Netflix doesn't deserve to be in the discussion with the others. And microsoft just surpassed apple in market cap so the fact it was discluded from the acronym is retarded. It's not Faang any more. It's MAAAM  you bigots",
        "created_utc": 1635618729,
        "id": "hio8bwv",
        "score": 119,
        "subreddit": "wallstreetbets",
        "created": 1635647529.0
    },
    {
        "author": "Chromewave9",
        "body": "Problem with Amazon's business: They are way too involved in everything.\n\nIf their cloud services were its own company, it would have skyrocketed. But because Amazon has their fingerprints on everything, one bad segment could really hurt their projected outlook.\n\nFrom a company perspective, Amazon is stronger than ever. Don't mistake stock price with the company's outlook. Amazon will continue dominating and growing. Earnings report don't determine the direction of a company. It's just if you have been investing into Amazon the past year, your money has basically earned you a negative return considering that index funds would have pushed your portfolio much higher. \n\nThe way I see it, long-term investors have nothing to worry about. Amazon/Apple aren't going away. Short-term, there are much better opportunities elsewhere for your money to grow. \n\nPersonally, best blue chipper IMO is MSFT. Focused on what they know, continuously growing at high rates with their cloud services being a strong focus. Profit margins are absolute bananas. Last year, $60 billion profit on $155 billion revenue. With many companies using their services more than ever at an alarming rate, I like MSFT's lack of dependency in supply chain issues that Apple and Amazon has to deal with and rely on heavily.",
        "created_utc": 1635460583,
        "id": "hifvf3e",
        "score": 114,
        "subreddit": "stocks",
        "created": 1635489383.0
    },
    {
        "author": "TI_AJ17",
        "body": "GOOGL, MSFT or just VOO/VTI\n\nYou’re right that MSFT always seems high, but they continue to beat earnings and what is considered a premium price right now might soon be considered the ‘fair value’ as earnings increase.\n\nGOOGL is continuing to excel at what they do best with continuous earnings beats and one of the best balance sheets amongst the top companies; a no brainer stock right now.",
        "created_utc": 1635548099,
        "id": "hikpk2g",
        "score": 109,
        "subreddit": "stocks",
        "created": 1635576899.0
    },
    {
        "author": "juaggo_",
        "body": "I think we now have a clear view that this earnings season is a success. Today Visa, Microsoft, Google, AMD and Enphase have all beaten expectations. Bullish on the stock market in general.",
        "created_utc": 1635279790,
        "id": "hi5rcgg",
        "score": 108,
        "subreddit": "stocks",
        "created": 1635308590.0
    },
    {
        "author": "wilstreak",
        "body": "Both Microsoft and Paypal, initially interested in buying the company.\n\nIn the process of due diligence, usually they receive private information that is not available for the public (totally normal during M&amp;A process).\n\nAnd both decide not to pursue with the acquisition.\n\nThat combined with red flag such as co-founder quitting.\n\nI am going to be downvoted for this, but PINS shareholder should be concerned.",
        "created_utc": 1635144517,
        "id": "hhyih7f",
        "score": 108,
        "subreddit": "stocks",
        "created": 1635173317.0
    },
    {
        "author": "LegateLaurie",
        "body": "At current valuations I think Microsoft is pretty good. It's a solid business with plenty of room for growth and the SAAS model for office seems to be doing quite well, while Xbox and their recent acquisitions seem very good.\n\n\nI'm personally still in for the long haul with them",
        "created_utc": 1635619692,
        "id": "hioanfm",
        "score": 107,
        "subreddit": "wallstreetbets",
        "created": 1635648492.0
    },
    {
        "author": "barcelonamariokart",
        "body": "Wouldnt recommend making the SP500 your entire portfolio, but a large percentage absolutely. So much nonsense when people say “SP500 is not diversified” mate it’s 500 of the biggest companies in the fuckin world. Apple, Microsoft, Amazon, Tesla all sell BILLIONS of dollars worth outside the US. If the SP500 is down 30% then the rest of the world is almost certainly down too so it doesnt really matter",
        "created_utc": 1634752970,
        "id": "hhe1khv",
        "score": 103,
        "subreddit": "CanadianInvestor",
        "created": 1634781770.0
    },
    {
        "author": "feedemandseedem",
        "body": "Not surprising as MSFT has a diversified income stream, whereas AAPL has about half of it riding on iPhone sales.",
        "created_utc": 1635518871,
        "id": "hiiomju",
        "score": 98,
        "subreddit": "CanadianInvestor",
        "created": 1635547671.0
    },
    {
        "author": "Reynard81",
        "body": "There’s a country song with a Microsoft stock reference. I forget what it’s called though.",
        "created_utc": 1635541770,
        "id": "hikaszi",
        "score": 98,
        "subreddit": "wallstreetbets",
        "created": 1635570570.0
    },
    {
        "author": "backup2thebackup2",
        "body": "very startup has an origin story, a tale that illustrates its core principles. For Wealthsimple, that meant promoting low-fee, passive investing.\n\nAfter selling his first business about a decade ago, Wealthsimple co-founder Michael Katchen constructed a simple portfolio of exchange-traded funds using Microsoft Excel, then told the friends with whom he cashed out that this approach was the best way to invest their money.\n\nThe underlying premise: It’s tough to outperform the market over the long run, so for most people it’s better to invest in a mix of low-cost ETFs and ride the wave.\n\n“The feedback I got from my friends was, ‘Mike, we’re lazy. We love the system, but can you just please do it for us?’ ” Mr. Katchen told The Globe and Mail in 2016. “And they became the first 10 clients of Wealthsimple.”\n\nThe concept proved popular with the millennial crowd, attracting billions of dollars in assets to Wealthsimple’s so-called robo-adviser, and the company went so far as to buy Super Bowl ads preaching “simple automated investing.” In no time, Wealthsimple had so much buzz that people started to wonder if it would take down Bay Street’s old guard.\n\nLately, so much of that seems like a past life. The company’s automated platform still exists, but Wealthsimple is now advertising a day trading app for retail investors. And it’s not just stocks – it is heavily promoting its new cryptocurrency business, which allows users to swap a slew of crypto assets.\n\nThe new strategy seems at odds with Wealthsimple’s founding principles, particularly so with crypto, which is highly volatile and has some of the highest trading fees around. In a recent speech, Gary Gensler, the new head of the U.S. Securities and Exchange Commission, called the crypto market the Wild West, “rife with fraud, scams and abuse.” China recently made all crypto transactions illegal.\n\nDespite the hard pivot, Wealthsimple has said little about its change of heart. When asked about the new strategy, no one was willing to be interviewed. Instead, the company sent e-mails explaining that it is diversifying to target different client segments.\n\n“Our mission is to help everyone achieve financial freedom, no matter who they are or how much they have. That mission hasn’t changed. We are a fast growing company building a full financial ecosystem for our clients across their savings, investing, spending, tax and crypto needs,” Mr. Katchen wrote.\n\nAs for crypto’s volatility, which prompted the SEC chair to call it a “highly speculative asset class,” Mr. Katchen does not believe that disqualifies it from inclusion in a well-rounded portfolio. Wealthsimple, he wrote, is “very comfortable recommending that our clients put their money in diversified, low-cost portfolios, while also supporting them if they wish to invest in particular companies or promising new technology.” He also said that Wealthsimple is the first crypto platform to be regulated by a securities authority in Canada.\n\nWhat is happening at Wealthsimple is playing out in a similar fashion across the robo-adviser industry. Once-popular rivals in the United States, including Wealthfront and Betterment, are facing existential crises of their own. For all the billions of dollars that robo-advisers manage, it often isn’t enough to turn a profit. Betterment’s CEO stepped down last December, and its new leader acknowledged that an initial public offering likely was not possible until the company started making money.\n\n“These businesses operate on very tight margins. They just have extremely low fees, therefore they have to achieve pretty large scale before they’re profitable,” said David Goldstone, head of research and analytics at Backend Benchmarking, which tracks the robo-adviser market, in an interview.\n\nEven if a robo-adviser brings in tens of millions of dollars a year in revenue by charging around 0.5 per cent annually, the company has to spend heavily to attract new clients. “There was an industry-wide underestimation of how much it was going to cost to acquire customers,” Mr. Goldstone added.\n\nCompounding the problem, the old guard woke up and launched robo-advisers of their own. In the U.S., Vanguard and Charles Schwab now dominate the market, with assets worth US$210-billion and US$60-billion, respectively, at the end of 2020. Betterment, the largest independent robo-adviser in the U.S., managed US$28-billion at the same date. In Canada, Bank of Montreal launched its SmartFolio robo-adviser in 2016, and Royal Bank of Canada followed suit in 2018.\n\nThe incumbents aren’t simply more competition – they have a structural advantage, because they can cross-sell their robo-platforms to existing clients, lowering their customer-acquisition costs.\n\nTo adjust, Wealthsimple started diversifying in 2018 with a high-interest savings account, then added Wealthsimple Trade, which allows users to buy and sell stocks. In the fall of 2019, the company acquired software maker Simpletax. And a few months later it launched Wealthsimple Cash, a hybrid of a no-fee chequing account and a high-interest savings account.\n\nThe pivot to crypto started in August, 2020, when Wealthsimple’s users were permitted to start trading Bitcoin and Ether. This past June, trading expanded to 14 additional crypto assets, including Litecoin and Dogecoin.\n\nWealthsimple does not break down its assets by division, but retail trading and crypto are what makes Silicon Valley salivate. Last fall, Wealthsimple raised $114-million in a funding round that valued the company at $1.4-billion. In May, it raised another $750-million, boosting its valuation to $5-billion only seven months later.\n\nRetail trading app Robinhood and crypto trading hub Coinbase recently went public in the United States, and their financial statements illustrate just how explosive retail trading revenue growth can be, particularly in crypto. At Robinhood, crypto brought in US$320-million in the first half of 2021, compared with just US$10-million in the first half of 2020.\n\nTo understand what that could mean for Wealthsimple, simply look at the fee schedule. The company’s robo-clients often pay 0.5 per cent annually, while crypto traders pay 1.5 per cent to 2 per cent per transaction (although Wealthsimple must split that fee with other parties).\n\nStock trading and crypto are also popular with younger users, which has always been Wealthsimple’s target market but proved to be a tough nut to crack.\n\nEven though the company attracted billions in assets, it was a tiny fraction of the total wealth-management market. Switching rates, which measure the likelihood that someone is willing to leave their main financial institution, remain stubbornly low. In 2020, management consultancy Accenture pegged the switching rate for a primary financial account in Canada at only 4 per cent.\n\nYet as the company grows, it seems inevitable that it will move further from its roots – some of which are still exposed on Wealthsimple’s website. In a section promoting its robo-adviser, the company writes: “History shows that when you try to predict the future – by picking stocks, for example – rather than investing in a highly diversified way, you are more likely to underperform the market.”",
        "created_utc": 1633546794,
        "id": "hfmykz4",
        "score": 92,
        "subreddit": "CanadianInvestor",
        "created": 1633575594.0
    },
    {
        "author": "apooroldinvestor",
        "body": "You mean we should buy more NVDA AAPL ASML MSFT GOOGL?",
        "created_utc": 1633396908,
        "id": "hffefmp",
        "score": 86,
        "subreddit": "stocks",
        "created": 1633425708.0
    },
    {
        "author": "coolcomfort123",
        "body": "Been buying msft, googl, aapl and nvda this week, long term holding investors will be rewarded.",
        "created_utc": 1633194088,
        "id": "hf48kv9",
        "score": 86,
        "subreddit": "stocks",
        "created": 1633222888.0
    },
    {
        "author": "LiableMammal",
        "body": "“most if not all Google smartphones and Microsoft-built computers have been made in China”",
        "created_utc": 1635204858,
        "id": "hi1sh61",
        "score": 83,
        "subreddit": "wallstreetbets",
        "created": 1635233658.0
    },
    {
        "author": "Anth916",
        "body": "You might be 15 years old, and you're new to investing, but I think this is a wonderful opportunity for you take charge of your future and set yourself up nicely for financial health throughout the rest of your life. You can start now at age 15, and in 20 years, when you're 35 years old, you might be completely financially independent. Which of course would be super awesome. There's many 35 year olds walking around right now, that would wish they could go back in time to 15 years old and start doing the right things.\n\nThe right things, is learning all about the stock market and how this whole thing works. I think throwing that $200 into a ETF won't really help you too much along this path. My advice is for you to take out a nice sheet of paper and right down all the various products that you use all the time, and the products you love the most. For example, maybe you really like Disney+ streaming service. Or you really love Apple phones. Or you really like XBOX's, or you love Supreme clothing. Whatever it is, write it down. Then the next step is to find out who the parent company is that owns whatever it is that you're into. For example, if XBOX is one of your all time favorite products, the parent company is Microsoft.\n\nSo, you go through this list, finding the parent companies, and then you look for their ticker symbols. See if the companies are publicly traded. For example, if you like Supreme clothing, I think that's a privately held company, so you can't buy any shares in it.\n\nBut, once you have a nice long list of Ticker symbols that actually have real meaning for you, now you need to figure out how to compare and contrast these companies underlying financial fundamentals. \n\nBut how do you do this? Well, this is where YouTube can be your friend. There's plenty of YouTube videos that are specifically designed to help you look at a companies financials and understand what their financial statements mean. \n\nOf course, you're only 15 years old, so this might seem too difficult, but I'm telling you, just take you time, relax, you can learn this stuff. If you can learn which original Pokemon cards are the most valuable, then you can learn this crap. \n\nSo, once you do all this, then you'll have a much better idea of how things work, and then you can put your $200 into an investment account that allows you to buy fractional shares. This way, even though you have a small amount to start out with, you could buy tiny fractions of companies like Google (YouTube) or Microsoft (Xbox). This way, you can have a portfolio of maybe 6 or 7 companies that are using that $200, and even though you'll just have tiny slivers of shares, you can follow these companies over the coming months and learn more about how things work. \n\nYou can keep up with when they report their earnings, and how the stocks react to that news, etc, etc.\n\nI'm excited for you, and I wish I could time travel into the future about 20 years to ask you how you like being a multi-millionaire! Good luck!",
        "created_utc": 1633706902,
        "id": "hfv4ftf",
        "score": 82,
        "subreddit": "stocks",
        "created": 1633735702.0
    },
    {
        "author": "TylerBlozak",
        "body": "As a $V holder of 3 years, welcome aboard!\n\nOne of my best buys as an investor (besides AMD at $6), $V is one of those companies I can trim down, but never fully part with.\n\nAlongside AAPL, MSFT, AMZN, It’s one of my core “never selling unless SHTF” stocks.",
        "created_utc": 1635366513,
        "id": "hiak8qv",
        "score": 81,
        "subreddit": "stocks",
        "created": 1635395313.0
    },
    {
        "author": "Ceredron",
        "body": "because Microsoft is so much more embedded in global culture that nobody needs to attach it to a meaningless acronym, lol. The world runs on excel",
        "created_utc": 1635449389,
        "id": "hif4l3w",
        "score": 80,
        "subreddit": "stocks",
        "created": 1635478189.0
    },
    {
        "author": "discovery999",
        "body": "Loading up on MSFT",
        "created_utc": 1633385306,
        "id": "hfeqwos",
        "score": 79,
        "subreddit": "stocks",
        "created": 1633414106.0
    },
    {
        "author": "jaedonger",
        "body": "MAMAA - Microsoft apple meta alphabet amazon",
        "created_utc": 1635632793,
        "id": "hip41j9",
        "score": 78,
        "subreddit": "stocks",
        "created": 1635661593.0
    },
    {
        "author": "1077IsMyPinNumber",
        "body": "Sell off the stocks you have the least conviction in and concentrate your cash into a few that you do have conviction in. It doesn’t matter how Netflix does, they can have a record-breaking quarter, you’re not going to feel the impact when you haven’t even got a whole share. \n\nAfter consolidating, look at the companies you’re invested in and choose a good exit point. For example: I bought several shares of Microsoft in spring, and looking at the charts and their future earnings I decided that I would liquidate my position when Microsoft reached $300 a share — worked like a charm. \n\nDo this with every stock that you have post-consolidation. Your goal right now is to grow your portfolio size, you’re going to achieve that by selling at your (reasonable) price target and then investing the extra cash again to grow further. Bonus if it’s a company that will pay you dividends while you wait.",
        "created_utc": 1633460774,
        "id": "hfihnit",
        "score": 77,
        "subreddit": "RobinHood",
        "created": 1633489574.0
    },
    {
        "author": "not_creative1",
        "body": "The problem is, intel is getting left behind in PC/laptop  processors by aapl. Apple is on a league of its own, and someone like nvdia or Qualcomm will create the M1 equivalent for PC.\n\n\nAnd the other problem as someone who works in Silicon Valley, in this industry and has a lot of friends in Intel is: \n\nIntel has been bleeding talent left and right for the last 5 years. \n\nIntel pays very low compared to Silicon Valley standards, that’s partly because there is so much competition for talent from nvidia, apple, Qualcomm who are all killing it.  And as a big chunk of compensation is tied in RSUs, Intel cannot compete with salaries as these companies stocks have done extremely well. Apple’s stock has gone up 300% in 5 years and if 30% of your compensation is RSUs, then you are basically getting 30-40% yoy raises for 5 years straight. No way Intel can keep up with that.\n\nIntel pays like 30-50% lower for a comparable position at apple. You just cannot retain top talent with that kind of a pay disparity. Anyone I know, who is talented enough and can leave Intel, has left Intel. \n\n\nIntel is seriously at the danger of becoming IBM of chip makers. Especially now, with amazon working on its own server chips, google working on its own, Microsoft is rumoured to be working on their own silicon for azure. Apparently Qualcomm is going to compete in PC processors. Intel is increasingly looking its in a death spiral. Google, Amazon, Microsoft can pay intel’s top people 2x and poach them left and right. Because these companies are swimming in money form their other businesses.\n\n\nOne thing they have going for them is their fabs. With the increased attention to on shoring chip manufacturing, they should leverage that and start manufacturing chips from competitors for domestic consumption, especially like the defence industry. They have a healthy head start with chip manufacturing infrastructure and know how. They should lean into that. The days of them competing to make the best processors in the world is over.",
        "created_utc": 1634873087,
        "id": "hhksgak",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1634901887.0
    },
    {
        "author": "Sandvicheater",
        "body": "OP was originally invested back then during the Microsoft dark ages under Ballmer's reign",
        "created_utc": 1635355949,
        "id": "hi9ssrf",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1635384749.0
    },
    {
        "author": "stockist420",
        "body": "MSFT. Inflation, war or famine.  Brilliant down-to-earth CEO, diversifying into relevant markets. Connecting everything to their cloud. Its an ETF in itself.",
        "created_utc": 1634958961,
        "id": "hhpb7fv",
        "score": 72,
        "subreddit": "investing",
        "created": 1634987761.0
    },
    {
        "author": "ShadowLiberal",
        "body": "I've been buying shares of MSFT every paycheck for over a year, and investing lump sums at times when it goes down for irrational reasons (like when it fell to $240 after one of it's earnings reports in the last year). \n\nI know AAPL has a lot of fans, but MSFT has always looked like the better company to me. They're just better diversified, and have several very strong segments that could each stand as their own top quality standalone business.",
        "created_utc": 1635533936,
        "id": "hijr0cs",
        "score": 72,
        "subreddit": "stocks",
        "created": 1635562736.0
    },
    {
        "author": "Bfree888",
        "body": "Your parents had 27k to drop into microsoft? Damn must be nice",
        "created_utc": 1635368649,
        "id": "hiaptmp",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1635397449.0
    },
    {
        "author": "mauros_lykos",
        "body": "google, amazon, microsoft, apple probably?",
        "created_utc": 1634325740,
        "id": "hgrx8b4",
        "score": 70,
        "subreddit": "stocks",
        "created": 1634354540.0
    },
    {
        "author": "Pretend_Kangaroo_694",
        "body": "Nothing special just always looking for opportunities. Bought Apple back in 2018 after it unexpectedly tanked. That was my primary gains for 2018 and 2019. Covid years I bought once the market started rebounding. You could have picked any stock and made a profit. I bought travel, rode them for a 50% gain then sold and purchased weed and green energy plays. After the election I sold those and am now currently holding an African oil exploration company, a pharma company I got in right before phase 3 fda approval, msft, and sofi. \n\nLong story short I like to keep my number of holdings small and am not attached to any of them. Im not a meme chaser or only stick to certain sectors. There is still value out there, just a matter of finding it. I may have a different strategy then most. I’m trying to build my real estate portfolio so every time I get 80k I pull it out of the market and buy another Airbnb (have one so far). The real estate offsets the short term capital gains I pay due to depreciation.",
        "created_utc": 1635699952,
        "id": "his7xt7",
        "score": 69,
        "subreddit": "stocks",
        "created": 1635728752.0
    },
    {
        "author": "MeaninglessNumbers",
        "body": "In the FAQ for “Who is eligible?” it states (for the Apple landing page): \n\n“Expert Medical Services is offered at no charge to all Apple employees and their immediate and extended family members, including spouses, domestic partners, dependent children, siblings, parents, parents-in-law and grandparents.”\n\nSimilarly for the Microsoft page, it lists explicitly the services that are available to all Microsoft employees. \n\nThis is a great find OP. Sounds like a done deal, yet to be announced.",
        "created_utc": 1635142705,
        "id": "hhyg9z9",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1635171505.0
    },
    {
        "author": "isospeedrix",
        "body": "had calls on fb, aapl, amzn, and puts on msft\n\njesus christ how can i be so bad at this",
        "created_utc": 1635453591,
        "id": "hiff32w",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1635482391.0
    },
    {
        "author": "Okmanl",
        "body": "This is from memory. But if someone has a link to the actual story I’d appreciate it:\n\nI remember reading a story of Peter Lynch going to a grade school and asking people if you could own only one company what company it would be. (All I remember was hasbro being one of the picks)\n\nA decade later after averaging all the picks from that classroom you would’ve made something like 1000+% whereas the s&amp;p 500 returned something like 200+%. \n\n\n\nSo I’m following the same strategy. But instead of going to grade schools I pick whatever is hyped up on Reddit, Twitter, YouTube. And plan on holding for a decade. I started this 1.5 years ago. \n\nSo far I have tsla, btc, NET, SQ, ada, coin, eth, tqqq, qqq, arkk, arkg, random uranium crap, dkng, amzn, msft, msos, pltr, lmnd, tdoc, bb, fvrr, tlry. \n\n\n\n\nRight now I’m up 70% in total. I’ve DCA’d 80k over the past year and a half. Current networth is 120k. I only have $900 in vti. We’ll see what happens 10 years from now I guess.",
        "created_utc": 1635274190,
        "id": "hi5csm4",
        "score": 68,
        "subreddit": "stocks",
        "created": 1635302990.0
    },
    {
        "author": "paulc19802",
        "body": "AWS has a massive advantage over Azure. It's not built on Microsoft software. \n\nFrom my own personal experience (data centre engineer) Azure breaks far more often than anything else and can take forever to put right.",
        "created_utc": 1635340506,
        "id": "hi8rt3g",
        "score": 66,
        "subreddit": "stocks",
        "created": 1635369306.0
    },
    {
        "author": "cats-with-mittens",
        "body": "Microsoft stock was stuck in the mud for a whole decade.",
        "created_utc": 1635541156,
        "id": "hik9bgp",
        "score": 65,
        "subreddit": "stocks",
        "created": 1635569956.0
    },
    {
        "author": "konohasaiyajin",
        "body": "That's because you only heard the first half of the deal.\n\nThe other half is GME buying every employee a Surface Tablet and converting all their back end systems to MS products.\n\nhttps://news.gamestop.com/news-releases/news-release-details/gamestop-announces-multi-year-strategic-partnership-microsoft",
        "created_utc": 1634027009,
        "id": "hgbyr7r",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1634055809.0
    },
    {
        "author": "stippleworth",
        "body": "Microsoft towers over the regional pittance of lowly companies like Apple and Amazon and Google and Facebook.",
        "created_utc": 1635449796,
        "id": "hif5lkv",
        "score": 64,
        "subreddit": "stocks",
        "created": 1635478596.0
    },
    {
        "author": "daynightcase",
        "body": "God damn lol my two biggest positions AAPL and AMZN missed this quarter and smaller positions MSFT and GOOG did very well. \n\nnow you all know who to thank :(",
        "created_utc": 1635453222,
        "id": "hife5c6",
        "score": 64,
        "subreddit": "stocks",
        "created": 1635482022.0
    },
    {
        "author": "Captain_Yolo_",
        "body": "If you think MSFT is too high right now, just wait until you see how much stupid shit I bought for master chief in Halo Infinite next quarter.",
        "created_utc": 1635722919,
        "id": "hito0lp",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1635751719.0
    },
    {
        "author": "xAragon_",
        "body": "-Netflix +Microsoft",
        "created_utc": 1635634105,
        "id": "hip6rtt",
        "score": 63,
        "subreddit": "stocks",
        "created": 1635662905.0
    },
    {
        "author": "dahliatree",
        "body": "MSFT is maybe the best performer of those but isnt good for covered calls because it goes up dramatically frequently and doesnt stay in the same channel for very long. it's also valued at a very high premium, which is justified but it's based on past performance and things do tend to change.",
        "created_utc": 1635019947,
        "id": "hhs12o5",
        "score": 63,
        "subreddit": "stocks",
        "created": 1635048747.0
    },
    {
        "author": "alacer24",
        "body": "$MSFT all day every day.",
        "created_utc": 1635624703,
        "id": "hioma7s",
        "score": 61,
        "subreddit": "investing",
        "created": 1635653503.0
    },
    {
        "author": "yuckystuff",
        "body": "I've never understood FAANG when Microsoft has always been as good or better than any of those tech companies. How did they get left out?",
        "created_utc": 1635540386,
        "id": "hik7eoi",
        "score": 58,
        "subreddit": "stocks",
        "created": 1635569186.0
    },
    {
        "author": "thekingbun",
        "body": "MSFT, AAPL, DIS, TGT, SBUX, NKE, CAT, BX, JPM, BLK",
        "created_utc": 1633662577,
        "id": "hft8bcb",
        "score": 56,
        "subreddit": "stocks",
        "created": 1633691377.0
    },
    {
        "author": "gsdlandshark",
        "body": "MSFT did well? Wow I for one am shocked, who could have possibly predicted that? /s\n\n25 shares at $265",
        "created_utc": 1635279216,
        "id": "hi5pup5",
        "score": 56,
        "subreddit": "stocks",
        "created": 1635308016.0
    },
    {
        "author": "balance007",
        "body": "If all it took was money, Google and MSFT would have beaten FB and TWTR long ago....",
        "created_utc": 1634945664,
        "id": "hholtec",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1634974464.0
    },
    {
        "author": "AmbitiousSingh",
        "body": "MSFT is almost 70% of my investment portfolio. I keep thinking I should diversify but it keeps growing at an absurd rate that it's hard to justify selling it. As long as Nutella's head of the ship there, I can't see myself selling it.",
        "created_utc": 1635280738,
        "id": "hi5tsxe",
        "score": 54,
        "subreddit": "stocks",
        "created": 1635309538.0
    },
    {
        "author": "The_Nightbringer",
        "body": "Really tech companies need to start pushing on the job training and just focus on finding candidates who are able to learn. Google and Microsoft have both had significant success with that.",
        "created_utc": 1633628828,
        "id": "hfr65oz",
        "score": 54,
        "subreddit": "stocks",
        "created": 1633657628.0
    },
    {
        "author": "xAragon_",
        "body": "Microsoft might beat Apple's market-cap tomorrow and take the #1 spot",
        "created_utc": 1635454423,
        "id": "hifh5jw",
        "score": 53,
        "subreddit": "stocks",
        "created": 1635483223.0
    },
    {
        "author": "shabbatshalom44",
        "body": "It’s way overvalued. People just have zero perspective and short memories. During the dotcom bubble everyone thought it would last forever. \n\nMy bet is it eventually crashes before becoming a great long term investment, like Microsoft.",
        "created_utc": 1633659543,
        "id": "hft268n",
        "score": 52,
        "subreddit": "stocks",
        "created": 1633688343.0
    },
    {
        "author": "unfonfortable",
        "body": "Yes, OP, Facebook, Amazon, Apple, Microsoft, and Google are all going bankrupt. Get out while you can.",
        "created_utc": 1635471336,
        "id": "higinai",
        "score": 51,
        "subreddit": "stocks",
        "created": 1635500136.0
    },
    {
        "author": "rollebob",
        "body": "This guy thinks Gates codes Microsoft Office himself and Tim Apple assembles iPhones.",
        "created_utc": 1635681950,
        "id": "hir7qc2",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1635710750.0
    },
    {
        "author": "Honestmonster",
        "body": "This is a first. I've never seen someone argue the stock growth is the revenue growth plus dividend yield. lol I mean Microsoft is 11% of my portfolio so I like the stock but you clearly have no idea what you are talking about.",
        "created_utc": 1635644917,
        "id": "hipscc0",
        "score": 50,
        "subreddit": "investing",
        "created": 1635673717.0
    },
    {
        "author": "dhpw2",
        "body": "Apple, \n \nMicrosoft, \n\nFacebook, \n\nSquare, \n\nDisney, \n\nAMD, \n\nTaiwan Semiconductor, \n\nVisa/Mastercard, \n\nAlibaba, \n\nRocket Lab",
        "created_utc": 1633667089,
        "id": "hftg5a5",
        "score": 50,
        "subreddit": "stocks",
        "created": 1633695889.0
    },
    {
        "author": "J_Artiz",
        "body": "Wouldn't mind a discount on Microsoft 😍",
        "created_utc": 1634742392,
        "id": "hhdb0ke",
        "score": 49,
        "subreddit": "wallstreetbets",
        "created": 1634771192.0
    },
    {
        "author": "paq12x",
        "body": "Bough 40 SHOP, 100 FB.  Looking hard at MSFT, AAPL.",
        "created_utc": 1633360450,
        "id": "hfcxe7n",
        "score": 47,
        "subreddit": "stocks",
        "created": 1633389250.0
    },
    {
        "author": "Paul_Ostert",
        "body": "Compared to the overall market I would say no.   The market as a whole is over valued,  but at least Microsoft has Azure, Xbox, enterprise services,  and more to keep generating more profits. That can't be said by other over valued stocks.",
        "created_utc": 1634687729,
        "id": "hhasgpj",
        "score": 46,
        "subreddit": "stocks",
        "created": 1634716529.0
    },
    {
        "author": "DragonInPajama",
        "body": "AMD, GOOG and MSFT will beat. That much I know.",
        "created_utc": 1634991737,
        "id": "hhqhaxo",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1635020537.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I've beat the sp500 for my first 2 years now mostly owning MSFT AAPL and GOOGL and ASML NVDA CRWD ODFL SQ HD UNH etc .",
        "created_utc": 1635695048,
        "id": "hirwlra",
        "score": 45,
        "subreddit": "stocks",
        "created": 1635723848.0
    },
    {
        "author": "kamrali",
        "body": "Yeah, Microsoft is really bleeding.....",
        "created_utc": 1634132801,
        "id": "hghdhe4",
        "score": 45,
        "subreddit": "stocks",
        "created": 1634161601.0
    },
    {
        "author": "MikeSSC",
        "body": "M$ (Microsoft) is an amazing company.  It's its own etf.  No way tesla should replace it",
        "created_utc": 1635468235,
        "id": "higbuc3",
        "score": 44,
        "subreddit": "stocks",
        "created": 1635497035.0
    },
    {
        "author": "DayOfDingus",
        "body": "As someone who, during college, focused on trading as basically a second job on top of my shifts at Starbucks I'd recommend following this guys advice.  I barely scraped through school, and had a very strained social life for maybe an additional 10-15% gain a year over just going long on Microsoft or some other stable gainer.  It's not really worth it.",
        "created_utc": 1635632042,
        "id": "hip2g11",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1635660842.0
    },
    {
        "author": "InvestingDD",
        "body": "DAFATMAN\n\n-Disney\n-Amazon\n-Facebook\n-Apple\n-Tesla\n-Microsoft\n-Alphabet\n-Netflix\n\nDiversified into:\nMedia, Streaming, Ecommerce, Data centres, Cloud computing, 5G, Mobile phones, Computers/Laptops, EVs, Autonomous driving, Enterprise software, AI, IoT, Web, etc. \n\nYou heard it here first.",
        "created_utc": 1635653543,
        "id": "hiq7y7r",
        "score": 42,
        "subreddit": "stocks",
        "created": 1635682343.0
    },
    {
        "author": "coolcomfort123",
        "body": "Been buying nvda, google and msft for these red days, gonna hold for a long time.",
        "created_utc": 1633393068,
        "id": "hff6t95",
        "score": 41,
        "subreddit": "stocks",
        "created": 1633421868.0
    },
    {
        "author": "theJimmybob",
        "body": "Implied moves for companies reporting next week:\n\n&amp;#x200B;\n\n$AAPL 3.3%  \n$AMZN 4.6%  \n$GOOGL 4.5%  \n$MSFT 3.1%  \n$FB 6.6%  \n$LOGI 8.9%  \n$AMD 6.7%  \n$TWTR 11.1%  \n$SHOP 6.5%  \n$MA 3.7%  \n$V 3.1%  \n$TWLO 7.6%  \n$UPWK 15.3%  \n$NOW 5.3%  \n$ALGN 8.3%  \n$CAT 4.2%  \n$BA 4.4%  \n$UPS 5.1%  \n$GE 5.0%  \n$LMT 2.7%  \n$MMM 3.3%  \n$SHW 5.2%  \n$JBLU 9.4%  \n$HAS 7.2%  \n$FFIV 5.7%  \n$QS 9.6%  \n$GM 5.3%  \n$SPOT 7.0%  \n$MCD 2.9%  \n$HOG 8.8%  \n$GRMN 6.0%  \n$CME 3.1%  \n$F 5.7%  \n$TDOC 7.0%  \n$EBAY 5.9%  \n$IRBT 11.3%  \n$ORLY 5.4%  \n$TREE 13.5%  \n$ABMD 9.7%  \n$OSTK 10.7%  \n$YUM 3.8%  \n$SBUX 4.2%  \n$X 8.2%  \n$DXCM 9.7%  \n$GILD 3.6%  \n$TEAM 8.5%  \n$DECK 10.6%  \n$ABBV 3.0%  \n$CVX 2.6%",
        "created_utc": 1634994048,
        "id": "hhql19m",
        "score": 41,
        "subreddit": "options",
        "created": 1635022848.0
    },
    {
        "author": "kiddcaramel",
        "body": "Without giving out too much information about my personal life...I work for a subsidiary of Microsoft. A large company. And they treat their own employees great but they hire tons of temps that are under paid to do the same jobs as their engineers and then some. And if you mention being hired or paid more or health insurance they just fire them and bring in the next guy. I wouldn't say slave labor but hiring inner city people for $20 an hour and holding possible employment over them for doing literal engineering work is insane.",
        "created_utc": 1635218393,
        "id": "hi2l310",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1635247193.0
    },
    {
        "author": "redratus",
        "body": "I think the meta is one of the next big things—but where I’m worried is the competition.\n\nMSFT is also building a metaverse. Theirs is more oriented towards workplaces, but still…FB is far from the only player in this game. I’m sure gaming and crypto and AR related companies are in this already too.\n\nFB would still be the main metaverse for personal friendships where you use your real ID etc, but the presence of (prolly) so many other players gives me pause—this isn’t a sure win.",
        "created_utc": 1635478303,
        "id": "higxdvr",
        "score": 41,
        "subreddit": "investing",
        "created": 1635507103.0
    },
    {
        "author": "Dumb_Vampire_Girl",
        "body": "I hate that I sold all my \"hype\" stocks like Tesla, Amazon, Microsoft, and Disney because I wanted to be a smart and responsible \"value investor.\" I learned that my portfolio beta was like 15. Brought it down to 0.70. I learned about P/E ratios and decided to only buy stocks that have lower P/E ratios than the S&amp;P. I learned about free cash flow and went with companies whose FCF was growing and capable of paying off dividends or debt. I learned about Benjamin Graham and wanted to be like him. I learned about the \"dangers\" of meme stocks and tried to stay away from them. I thought I was finally getting the hang of this.\n\nCurrently going sideways for the past 2 years when I would have 100x'd my money if I didn't sell my hype stocks.",
        "created_utc": 1634861760,
        "id": "hhk4p2f",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1634890560.0
    },
    {
        "author": "Jumpdeckchair",
        "body": "Was my birthday yesterday.\n\nThought back on my life,  it's been good. \n\nWife left me 6 years ago, said I was a loser ass.\n\nFast forward,  she's a methhead and can't see our son and is borderline homeless. I own 2 homes and make tendies and go and bang hotties while my son sees my family.\n\nMoral of the story is don't let anyone tell you shit.\n\nMSFT 315 EOW. (I have a banbet don't need to tell me to make one)",
        "created_utc": 1635123760,
        "id": "hhxkje6",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1635152560.0
    },
    {
        "author": "thinvanilla",
        "body": "Yep and it's not even just Apple. Microsoft and Amazon are developing their own ARM chips specifically for their data centres, which is Intel's main market. Anybody with stock in Intel needs to know that Microsoft/Amazon are working on ARM chips, this is a massive red flag:\n\nhttps://www.theverge.com/2020/12/18/22189450/microsoft-arm-processors-chips-servers-surface-report\n\nhttps://www.reuters.com/article/uk-amazon-chips-idUKKBN28B5TH\n\nAnd the world's most powerful supercomputer uses ARM chips:\n\nhttps://en.wikipedia.org/wiki/Fugaku_(supercomputer)\n\nApple probably won't supply chips but they have set the bar for all other companies to aim for. ARM chips have been proven as viable alternatives.",
        "created_utc": 1635005337,
        "id": "hhr49u2",
        "score": 39,
        "subreddit": "stocks",
        "created": 1635034137.0
    },
    {
        "author": "someonesaymoney",
        "body": "MSFT",
        "created_utc": 1635574082,
        "id": "him2jb5",
        "score": 39,
        "subreddit": "investing",
        "created": 1635602882.0
    },
    {
        "author": "thrownoworlater",
        "body": "Similar bucket as you. Brought 100 at around that price and thing has been bouncing around quite a bit. Will continue to hold and just let it ride. Stocks are about 14% of my portfolio and am killing with my holdings on BX, JPM, MSFT etc so I can take a teeny weeny hit with PLTR. The executive team of Karp and Thiel plus that Indian dude who runs operations gives me long term hope.",
        "created_utc": 1635438358,
        "id": "hieccjf",
        "score": 39,
        "subreddit": "stocks",
        "created": 1635467158.0
    },
    {
        "author": "TajPereira",
        "body": "Msft will hit $335 this time next year, not in 2 weeks lol.",
        "created_utc": 1634059130,
        "id": "hgdkowu",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1634087930.0
    },
    {
        "author": "pickandpray",
        "body": "Agreed. I've been buying MSFT and LIT because of the automakers pilling into the EV band wagon are going to need batteries",
        "created_utc": 1634954382,
        "id": "hhp2qd0",
        "score": 38,
        "subreddit": "investing",
        "created": 1634983182.0
    },
    {
        "author": "juaggo_",
        "body": "Microsoft is such a wonderful company. Everyone should also remember the $60B share buyback program announced earlier this fall.",
        "created_utc": 1635279138,
        "id": "hi5pn7j",
        "score": 38,
        "subreddit": "stocks",
        "created": 1635307938.0
    },
    {
        "author": "yippiyak",
        "body": "Yes, but at $2300 a share Tesla would be the biggest company (in terms of market share) on earth. Could it go higher? Sure. \n\nWould it lose what little logical reason it has left? Absolutely.\n\nI don’t care how much of a Tesla bull you are, there is absolutely no way someone can argue a bull case on Tesla being bigger than Microsoft/Apple imo.",
        "created_utc": 1635548850,
        "id": "hikr764",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1635577650.0
    },
    {
        "author": "mrlazyboy",
        "body": "So I really like GitLab as a company and work with them pretty frequently. If I had to bet, I would say that they are going to continue crushing the market. However, I think the stock is wayyyy overvalued.\n\nThey've got a market cap of roughly $14 billion and they'll probably do $210M - $220M in sales this year. If we say that sales = revenue (it isn't), their P/E ratio is 63. That's actually higher than one of their competitors Atlassian, who sits around 50. Atlassian's Git product BitBucket is nowhere near as good at GitLab, but Jira is literally everywhere. GitLab's closest competitor is GitHub, owned by Microsoft. Microsoft's PE ratio is in the high 30s but not a great comparison. At least 63 isn't anywhere near as bad as TSLA which sits at &gt; 400.\n\nGitLab is losing a ton of money (last year they lost about $200M). Luckily they raised about $800M from the IPO which gives them a few years of runway. My expectation is they will scale engineering and sales to keep up with GitHub.\n\nGitHub is extremely strong competition, but not for reasons people typically mention. GitHub is the defacto git repo for almost all open source software. However, they initially neglected the enterprise customers so GitLab has taken a lot of those accounts. In addition, GitLab's CI capabilities are a solid 1.5-2 years ahead of GitHub's.\n\nHowever... GitHub, owned by Microsoft, has more money than you can imagine. Microsoft's strategy is to give their customers that pay for TFS/Visual Studio free GitHub licenses. In addition, Microsoft will give customers hundreds of thousands of dollars in free consulting to help migrate over. \n\nGitHub also has a $5/user/month tier. GitLab did away with that tier a year ago because it is unprofitable. Microsoft has so much money, they are currently using those very cheap licenses for more user acquisition. Plus, pretty much every company is a Microsoft customer already so the sales reps have tons of inroads. In addition, Microsoft owns LinkedIn. That means Microsoft knows who works at what company, how to reach them, the skills of the company's employees, and what platforms they use (e.g., if a company has 30 enterprise software engineers for SAP, well, MSFT knows they do a lot of SAP work). That information is extremely valuable to sellers.",
        "created_utc": 1634255911,
        "id": "hgobnl4",
        "score": 37,
        "subreddit": "stocks",
        "created": 1634284711.0
    },
    {
        "author": "captain_americano",
        "body": "Bought FB puts yesterday. \n\nThat means Mark Facebook will be immediately absolved of all responsibility after the hearing, and FB will announce their acquisition of MSFT and DIS doesn't it?",
        "created_utc": 1633436130,
        "id": "hfgxv0s",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1633464930.0
    },
    {
        "author": "Phreeker27",
        "body": "Shoulda just bought MsFt instead of those weed stocks LMAO",
        "created_utc": 1635280262,
        "id": "hi5skgc",
        "score": 37,
        "subreddit": "stocks",
        "created": 1635309062.0
    },
    {
        "author": "creepywaffles",
        "body": "Facebook - Amazon - Tesla - Microsoft - Apple - Netflix - Google\n\nFATMANG",
        "created_utc": 1635628895,
        "id": "hiovmcn",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1635657695.0
    },
    {
        "author": "Global_Chaos",
        "body": "Haha that’s a great way to look at it. Microsoft is much better without Gates and Balmer",
        "created_utc": 1635360601,
        "id": "hia4v13",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1635389401.0
    }
]