[
    {
        "author": "rmwhereithappens",
        "body": "Here, I will do the DD on John Deere for you since you apparently lack the brainpower to conduct a Google search:\n\n[https://www.benzinga.com/etfs/sector-etfs/21/04/20453780/why-is-john-deere-part-of-the-new-ark-funds-space-etf](https://www.benzinga.com/etfs/sector-etfs/21/04/20453780/why-is-john-deere-part-of-the-new-ark-funds-space-etf)\n\nDirect quote from the article:\n\n&gt; Since the 1990s, John Deere has worked on using GPS technology to improve precision agriculture.\n\n&gt; In 2018, John Deere partnered with NASA to improve its self-driving tractors. The company tapped into NASA’s global network of ground stations.\n\n&gt; Most self-driving tractors cultivating the majority of American farmland rely on NASA technology. The NASA model for commercial software can help predict yields and classify land types using satellite imagery.\n\n&gt; “This innovation resulted in perhaps one of NASA’s most important contributions to modern society — highly accurate GPS navigation anywhere on Earth, including crop fields,” the Food Institute said on the GPS improvements brought from NASA software.\n\n&gt; The link between space and agriculture companies appears here to stay: In December 2020, NASA and the U.S. Department of Agriculture extended a long-standing partnership on space-based assets.\n\n&gt; Ark Funds sees Deere &amp; Company and other agricultural-related names, such as top holding Trimble Inc TRMB 1.63%, as winners in the growth of satellites and GPS.",
        "created_utc": 1620789641,
        "id": "gxt9fj8",
        "score": 12,
        "subreddit": "investing",
        "created": 1620818441.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  5th of May\n\n\n\n## Upcoming events for Wednesday, May  5th\n\n - Stock splits:\n\n    - BRGGF @ **1:10**\n    - FRSB @ **105:100** (Payable date: 05/20/2021)\n\n - Expected earnings:\n\n  AAWW, ABC, ABEO, ABIO, ABUS, AC, ACAD, ACCD, ACR, ADMA, ADPT, ADT, ADTN, ADXN, AEGN, AEIS, AEL, AERI, AEZS, AFIN, AINC, ALB, ALCO, ALG, ALGM, ALL, ALLO, ALSK, ALTM, AMEH, AMOT, AMPE, AMPY, AMYT, ANAB, ANSS, AOSL, APA, APT, AQUA, ARAV, ARLO, ARNA, ASC, ASM, ASTE, ASYS, ATAX, ATLO, ATO, ATSG, ATTO, AVA, AVID, AVNW, AXGN, BAND, BBSI, BBU, BCOR, BCSF, BDC, BE, BFAM, BFS, BHR, BKNG, BLX, BRKR, BWA, BXRX, CCMP, CCRN, CCU, CDAY, CDNA, CDW, CENT, CENTA, CENX, CERN, CF, CFBK, CFMS, CIM, CKPT, CLDX, CLH, CLLS, CLNC, CLVS, CLW, CMLS, CMRE, CNDT, CNHI, CPA, CPE, CPSS, CRD.A, CRD.B, CRTO, CSGS, CSTE, CTSH, CUB, CUTR, CW, CXW, CYBR, DAR, DCP, DFIN, DGII, DHC, DHX, DIN, DLHC, DMAC, DNB, DNN, DNOW, DOC, DRTT, EAF, ECPG, EDIT, EFC, ELA, EMKR, EMR, EPM, EPR, EQH, EQT, EQX, ESTA, ESTE, ETSY, EVH, EVRI, EXC, EYEG, EYPT, FATE, FDP, FICO, FLEX, FLMN, FLOW, FLT, FMC, FMS, FNV, FORR, FOX, FOXA, FPAY, FRT, FSLY, FTS, FUN, FUNC, FVE, GAU, GBT, GDDY, GDOT, GEL, GFL, GFN, GGB, GIL, GKOS, GLAD, GLRE, GM, GMAB, GMRE, GNK, GOEV, GOLD, GPL, GRP.U, GSS, GSX, GTHX, HARP, HAYW, HBB, HCC, HDSN, HEAR, HFC, HLT, HMTV, HNGR, HPP, HR, HRTG, HRTX, HSON, HUBG, HUBS, HZNP, IEC, IIPR, IMXI, INMB, INMD, INSG, IO, IONS, ISEE, IVC, IVR, JLL, JRVR, KALA, KE, KIDS, KLIC, KRO, KTOS, KVHI, KW, LBTYA, LBTYB, LBTYK, LCI, LESL, LHCG, LILA, LILAK, LL, LMRK, LNC, LNSR, LOPE, LPI, LUMN, LUMO, MCS, MDCA, MDU, MDWD, MELI, MET, MFC, MG, MGPI, MGY, MLR, MLVF, MNKD, MNR, MOR, MRO, MTG, MTW, MYO, NBIX, NC, NEO, NESR, NGD, NHTC, NI, NL, NLTX, NMFC, NNA, NODK, NOTV, NP, NRZ, NUS, NUVA, NVEC, NVO, NVRO, NVST, NWN, NYT, OCDX, OCUL, ODP, OM, OMI, OPTN, ORA, ORCC, OSUR, PACE, PARR, PASG, PDCE, PEG, PEI, PETQ, PFGC, PFIE, PFLT, PGEN, PING, PLMR, PLYA, PNNT, PNW, PRA, PRI, PRIM, PRTA, PSN, PSNL, PTVE, PWFL, PYPL, QLYS, QNST, QRVO, QTRX, QTWO, QUOT, QURE, RCII, RCKT, RDFN, RDWR, REYN, RGLD, RGNX, RGR, RIGL, RKT, RLJ, RNGR, ROCK, ROOT, RPT, RSG, RUN, RYI, RYN, SAFT, SAR, SB, SBBP, SBGI, SBOW, SBRA, SCU, SGRY, SGU, SIMO, SITE, SJ, SJI, SKT, SLF, SLNG, SLRC, SMG, SMP, SMSI, SNEX, SNR, SPKE, SPR, SPWR, SRC, SRE, SRPT, SSSS, SSYS, STAA, STAY, STKL, STLA, STN, SUNS, SUP, SUPN, SWM, SYN, TALO, TCON, TCPC, TGB, TLND, TNDM, TPC, TPTX, TPVG, TRMB, TRNO, TT, TTGT, TUP, TVTY, TWLO, TWO, TXG, UBER, UFCS, UGI, UIHC, UNM, UPLD, USDP, UTHR, VAC, VAPO, VBIV, VCEL, VGR, VNDA, VRTV, VYGR, WAT, WHD, WLL, WMC, WRK, WTRG, WW, WYNN, XEC, XNCR, XPER, YELL, ZIXI, ZNGA\n\n - Ex-div:\n\n  AWI, CATC, CCK, ETR, FELE, FSBW, HMLP, IBTX, KBH, LSTR, MATX, NBN, NEP, NWBI, OFED, OMF, OPBK, SIMO, STBA, TX, VBTX, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 800K, previous: 517K)\n    - Chicago Fed President Evans Speaks\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: 1.218M)\n    - Crude Oil Inventories (consensus: -2.346M, previous: 0.090M)\n    - Cushing Crude Oil Inventories (previous: 0.722M)\n    - Distillate Fuel Production (previous: 0.071M)\n    - EIA Refinery Crude Runs  (previous: 0.253M)\n    - EIA Weekly Distillates Stocks (consensus: -1.120M, previous: -3.342M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: 0.4%)\n    - FOMC Member Mester Speaks\n    - FOMC Member Rosengren Speaks\n    - Gasoline Inventories (consensus: -0.652M, previous: 0.092M)\n    - Gasoline Production (previous: 0.243M)\n    - Heating Oil Stockpiles (previous: -0.175M)\n    - ISM NY Business Conditions (previous: 37.2%)\n    - ISM Non-Manufacturing Business Activity (consensus: 69.5, previous: 69.4)\n    - ISM Non-Manufacturing Employment (previous: 57.2)\n    - ISM Non-Manufacturing New Orders (previous: 67.2)\n    - ISM Non-Manufacturing PMI (consensus: 64.3, previous: 63.7)\n    - ISM Non-Manufacturing Prices (previous: 74.0)\n    - ISM-New York Index (previous: 804.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.17%)\n    - MBA Mortgage Applications (previous: -2.5%)\n    - MBA Purchase Index (previous: 281.4)\n    - Markit Composite PMI (previous: 62.2)\n    - Mortgage Market Index (previous: 706.6)\n    - Mortgage Refinance Index (previous: 3,185.3)\n    - Services PMI (previous: 63.1)\n\n## Upcoming events for Thursday, May  6th\n\n - Expected earnings:\n\n  AAOI, AAON, ABEV, ACET, ACIW, ACMR, ACOR, ACRS, ADAP, ADCT, ADNT, AE, AES, AGEN, AGLE, AGM, AGO, AGS, AHCO, AIG, AIRG, AIV, AJX, AL, ALBO, ALDX, ALE, ALTR, AMBC, AMC, AMH, AMN, AMPH, AMRK, AMRS, ANGI, ANIK, APLE, APPN, APRN, APTV, AQN, ARDX, ARPO, ARTNA, ARW, ASMB, ASRT, AT, ATEC, ATER, ATHX, ATNX, ATRI, ATRO, ATRS, AUMN, AUPH, AUTL, AUTO, AVD, AVLR, AVRO, AVXL, AVYA, AXDX, AXLA, AXNX, AXON, AY, AZUL, BAP, BBD, BBDO, BCC, BCRX, BCYC, BDSI, BDX, BECN, BHB, BILL, BIOL, BIP, BKD, BKI, BL, BLCM, BLD, BLDR, BLL, BRBR, BRT, BTN, BUD, BV, BWMX, BYND, CABO, CAH, CALA, CARG, CARS, CDK, CDR, CDXC, CDXS, CDZI, CECE, CELC, CEMI, CERC, CERT, CGNX, CHMA, CHRS, CHT, CHUY, CIA, CKX, CLBS, CLGX, CLI, CLNE, CLNY, CLRB, CLXT, CMBM, CMMB, CMRX, CNP, CNQ, CNXN, COLD, COLL, COMM, CORE, CORT, CPLG, CQP, CRAI, CSII, CSOD, CTHR, CTIC, CTLP, CTMX, CTOS, CTRE, CTT, CUE, CVET, CVNA, CWEN, CWEN.A, CWK, CYTK, CZNC, DBX, DDOG, DEN, DIOD, DLA, DLX, DMLP, DOCN, DRH, DRNA, DVAX, DWSN, EB, ECOM, ECOR, ED, EGAN, EGLE, EIGR, ELOX, ELY, ENDP, ENG, ENTA, ENV, EOG, EPAM, EPC, EPIX, EPZM, ERII, ESGR, ET, ETTX, EURN, EVC, EVFM, EVOP, EVRG, EXEL, EXPE, EXPI, FARM, FBRX, FCRD, FDUS, FET, FIS, FIXX, FLDM, FLGT, FLIR, FLXN, FND, FNF, FNKO, FOCS, FOUR, FOXF, FPI, FRG, FRGI, FROG, FSTX, FTDR, FULC, FVRR, GBLI, GDEN, GDP, GDYN, GEOS, GH, GLOG, GLOP, GLPG, GNE, GNL, GOGO, GOLF, GOVX, GPMT, GPRO, GPX, GRA, GRPN, GRTS, GSAT, GSBD, GSIT, GTIM, GTS, GWRS, HAIN, HBIO, HCAT, HCI, HII, HIMX, HL, HMHC, HMPT, HSKA, HTA, HWCC, HWM, HZN, IAC, IBOC, ICL, ICPT, ICUI, IDCC, IGMS, IHC, IHRT, IIVI, IMKTA, IMMR, IMRA, INDT, INFU, INOD, INSM, INSW, INVE, IOVA, IRM, IRTC, IRWD, ISDR, ITCI, JOBS, JYNT, K, KDMN, KIQ, KL, KRP, KRTX, KTB, KURA, KWR, KZR, LADR, LASR, LAUR, LAZY, LBPS, LCTX, LCUT, LEE, LIN, LND, LNT, LOCO, LODE, LPCN, LPTH, LQDT, LRMR, LXRX, LYV, MACK, MAIN, MCHP, MCK, MDGL, MEIP, MFA, MGA, MGEE, MGTA, MGTX, MIDD, MIRM, MITO, MITT, MKTY, MMS, MNOV, MNPR, MNRL, MNST, MNTX, MP, MRAM, MRIN, MRNA, MRTX, MSI, MSON, MT, MTBC, MTD, MTX, MTZ, MUR, MYE, NATR, NBRV, NBY, NCLH, NEPH, NET, NFG, NGS, NGVC, NH, NINE, NJR, NKSH, NKTR, NLSN, NMRK, NNBR, NOMD, NRG, NRP, NSIT, NTCT, NTLA, NTRA, NTUS, NUZE, NVCN, NVMI, NWS, NWSA, NXTC, NYMT, OCSL, OCUP, OEC, OGE, OLED, OLP, ONCT, OPCH, OPGN, OPRT, OPRX, ORTX, OTEX, OTIC, OTRK, OUST, OVID, OYST, PAE, PAHC, PAYS, PBA, PBH, PBPB, PBYI, PCTI, PCTY, PDEX, PDFS, PENN, PFSI, PGNY, PHI, PHX, PK, PLM, PLNT, PLUG, PMT, PODD, POST, PPL, PRAA, PRDO, PRLB, PRMW, PRQR, PRVB, PTGX, PTMN, PTON, PWR, PZG, PZZA, QDEL, RC, REFR, REG, REGN, REPH, RETA, REZI, RGA, RGS, RMAX, ROKU, RPD, RVLV, SALM, SATS, SBH, SBR, SCM, SCOR, SCX, SEAS, SEEL, SELB, SEM, SFE, SFM, SGA, SHAK, SHYF, SIC, SIGA, SKM, SLDB, SMTS, SNCY, SNDX, SPH, SPLP, SPPI, SPRO, SPXC, SQ, SRLP, SRRA, SRRK, SRTS, SSRM, STFC, STMP, STOR, STWD, SUN, SUNW, SVMK, SVRA, SWX, SXI, SYNA, SYRS, TACT, TBIO, TCDA, TCX, TDAC, TDC, TDS, TECH, TEF, TEN, THS, TIPT, TMST, TMX, TPIC, TPL, TPR, TRGP, TRHC, TRIN, TRIP, TRUE, TRVI, TRVN, TSE, TTOO, TVTX, TWI, TWST, TXMD, UBX, UEIC, UEPS, UFS, UIS, UMH, UNIT, URGN, USCR, USM, USPH, UTI, VCTR, VEL, VER, VG, VHI, VIAC, VIACA, VIR, VIRX, VNRX, VNT, VNTR, VRAY, VRCA, VSTM, VSTO, VTVT, VWTR, VYNE, W, WBT, WCC, WD, WFCF, WFG, WLDN, WPG, WPM, WPRT, WRLD, WRN, WSTG, WTRH, XERS, XFOR, XHR, XLRN, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZGNX, ZIOP, ZTS, ZYME\n\n - Ex-div:\n\n  AFB, AMSWA, ARLP, ARTNA, BKEP, BP, BPFH, BPRN, CADE, CBD, CEQP, CFFN, CIT, CMS, CVCY, DAN, FCBC, FCF, FE, FFWM, FHI, FRAF, FRBA, GPP, HCC, HOPE, HSII, INTC, JBHT, LAD, LBAI, LBC, LEVI, LW, MAC, MMLP, MMP, MPLX, NSC, NYCB, PCB, PCTI, PFC, PFE, PH, PKOH, PNFP, PPBI, PVBC, RBB, SIRI, SMBK, WAB, WAFD, WFC, WMT, WSFS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 4-Week Bill Auction (previous: 0.000%)\n    - Challenger Job Cuts (previous: 30.603K)\n    - Continuing Jobless Claims (consensus: 3,620K, previous: 3,660K)\n    - Initial Jobless Claims (consensus: 540K, previous: 553K)\n    - Jobless Claims 4-Week Avg. (previous: 611.75K)\n    - Natural Gas Storage (previous: 15B)\n    - Nonfarm Productivity (consensus: 4.3%, previous: -4.2%)\n    - Unit Labor Costs (consensus: -0.8%, previous: 6.0%)\n    - Wholesale Inventories (previous: 1.4%)\n\n^^^^2021-05-05",
        "created_utc": 1620208816,
        "id": "gx0cgk0",
        "score": 4,
        "subreddit": "RobinHood",
        "created": 1620237616.0
    },
    {
        "author": "No_Seesaw1134",
        "body": "TEXT:  \n$APTV - Taking off after hours which is fine, we are hoping for a small pull back. Beautiful triangle forming, I want to see a breakout.\r  \n\r  \n$AQN  - amazing trend forming and support right here. If we get a full move and eventually a break out, we could have a massive play here.\r  \n\r  \n$BKNG - Amazing massive trend. You are paying more for the amazing price action and support coming. Buy fractional shares if needed, great play.\r  \n\r  \n$EMN  - SHORT! This is a year long trend, and this resistance is STRONG. I have faith it is going to pull back right around here for some easy money.\r  \n\r  \n$MFC  - amazing uptrend right here, and it is headed right for value. Support is holding and so is the trend, love to see it.\r  \n\r  \n$PRTK - Another amazing pharma play - this is big reward or big risk, no one knows. Can have a 15% day any given day, or 5% lose, it is volatile but I like it here.\r  \n\r  \n$RCL  - Amazing triangle and support coming together. We have to see a full move to make it truly worth it, but a great value.\r  \n\r  \n$TRMB - Amazing uptrend that follows the 200EMA on the 180D time frame, what more can ya want?!\r  \n\r  \n$WSC  - Amazing wedge so do not get too bold on price targets - but this is an amazing looking setup.",
        "created_utc": 1620780862,
        "id": "gxsshy7",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620809662.0
    },
    {
        "author": "chadharter89",
        "body": "Calls on Twitter boingy (Boeing)🤣 att and Trimble (maybe?) \n\nPuts on plug, or a straddle but I bought puts and puts on roblox are cheeps",
        "created_utc": 1622253973,
        "id": "gztv075",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622282773.0
    },
    {
        "author": "SnooDogs2394",
        "body": "TRMB",
        "created_utc": 1620315321,
        "id": "gx5sx68",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620344121.0
    },
    {
        "author": "notbrokemexican",
        "body": "Trimble is good too, but I like Autodesk's ubiquity across multiple sectors from water management to gaming.",
        "created_utc": 1620530702,
        "id": "gxgk7bm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620559502.0
    },
    {
        "author": "Velvet_Mafia_NYC",
        "body": "It is actually not a bad idea for some of the next WSB meme stocks to be solid companies with good balance sheets &amp; positive cash flow .... companies that actually make something real, with a resilient business and great long-term growth prospects. Nothing wrong with getting hormonal 14-year-olds excited about boring but solid stocks like $ADI, $TRMB, ALB, $CTSH, $CB, $FLIR, $ZBH, $BLKB, $ABB, $USB, $PPG, $JCI, $SNY, $WY ...   \n\n\nOf course the \"bets\" part of WSB would have to be longer-term options. Can barely get a 14-year-old to focus for 15 minutes, let alone 2 years. Oh well I guess I'll buy more $GME",
        "created_utc": 1620678544,
        "id": "gxnfp3t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620707344.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  3rd of May\n\n\n\n## Upcoming events for Monday, May  3rd\n\n - Stock splits:\n\n    - AMOT @ **3:2** (Payable date: 04/30/2021)\n    - BRBS @ **3:2** (Payable date: 04/30/2021)\n    - CIG @ **111.497:100** (Payable date: )\n\n - Expected earnings:\n\n  ADC, ADUS, AGR, AKTS, ALUS, ALX, AMG, APPF, ARGO, ATCO, AWK, AWR, BCEI, BELFA, BELFB, BLDP, BRX, BSM, BWXT, CAN, CAR, CBFV, CBT, CC, CEA, CHGG, CIB, CINR, CNA, CORT, CPTA, CR, CRNT, CSR, CURO, CVI, CYCN, DBVT, DESP, DSPG, DZSI, EARN, EL, ELVT, ENBL, ENIA, ENIC, EPD, EPRT, EVER, FANG, FLS, FN, FNCB, FRPT, FSTR, GAIA, GENC, GLAD, GLYC, GPP, GPRE, HBP, HLIT, HNRG, IAG, IPI, IRBT, ITRI, ITUB, IVAC, JKHY, KDNY, KELYA, KELYB, KFFB, KFRC, KMT, KPTI, KRYS, L, LDI, LEG, LGND, LJPC, LMNX, LTHM, LTRN, LXRX, MAXR, MFIN, MOS, MRNS, MSB, MWA, MYGN, NCSM, NERV, NSP, NSSC, NTR, NWPX, O, OGS, OHI, ON, OTTR, OVBC, OXLC, PEBK, PETS, PLOW, PW, QGEN, RBC, REGI, RGCO, RIG, RILY, RMBS, RVPH, RYTM, SANM, SBT, SCI, SEB, SEDG, SGU, SHLS, SHO, SIBN, SOI, SPNE, STRL, SU, TA, TCMD, TELL, TGH, THCA, THCB, TRC, TRVG, UAN, UE, VGZ, VMD, VNO, VNOM, VRNS, WEC, WMB, WMK, WTRE, WWD, XPO, ZI, ZNH\n\n - Ex-div:\n\n  ASML, BMTC, BND, BNDW, BNDX, CAPL, CIG, CRS, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, IGD, ITUB, LMRK, MCBS, PKBK, SAFM, SHLX, SNY, SPH, SRCE, SRLP, STZ, STZ.B, VCIT, VCLT, VCSH, VGIT, VGLT, VGSH, VMBS, VTC, VWOB, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.020%)\n    - 6-Month Bill Auction (previous: 0.035%)\n    - Construction Spending (consensus: 1.9%, previous: -0.8%)\n    - FOMC Member Williams Speaks\n    - Fed Chair Powell Speaks\n    - ISM Manufacturing Employment (consensus: 61.5, previous: 59.6)\n    - ISM Manufacturing New Orders Index (previous: 68.0)\n    - ISM Manufacturing PMI (consensus: 65.0, previous: 64.7)\n    - ISM Manufacturing Prices (consensus: 86.1, previous: 85.6)\n    - Investing.com Gold Index (actual: 50.0%, previous: 52.0%)\n    - Investing.com S&amp;P 500 Index (actual: 49.1%, previous: 33.1%)\n    - Loan Officer Survey\n    - Manufacturing PMI (previous: 60.6)\n    - Total Vehicle Sales (previous: 17.70M)\n\n## Upcoming events for Tuesday, May  4th\n\n - Expected earnings:\n\n  ACLS, ACOR, ACRE, AFG, AGRX, AHH, AHT, AIZ, AJX, AKAM, ALC, ALGT, ALRM, AMCR, AME, AMK, AMRC, ANDE, ANET, ANVS, APEN, APO, APTO, AQB, AQST, ARC, ARCB, ARNC, ARVN, ARWR, ATC, ATRA, ATVI, AYX, AZYO, BBGI, BEN, BEP, BERY, BG, BGFV, BHC, BKEP, BKH, BNFT, BNL, BR, BRY, BTG, BXC, CBB, CDEV, CDLX, CEIX, CERS, CGBD, CHCT, CIGI, CIX, CLDT, CMI, CMP, CNCE, COP, COUR, CPK, CPSI, CRK, CRL, CRSR, CTLT, CTSO, CTVA, CVGI, CVLT, CVS, CWH, CXDO, CYRX, CZR, D, DCO, DCPH, DD, DEA, DEI, DENN, DHT, DK, DKL, DLB, DOOR, DRRX, DVN, EC, ENLC, EPAY, EQC, ERYP, ESE, ESPR, ETN, ETRN, EXAS, EXPD, EXTN, FCBP, FI, FNHC, FSP, FSS, FTSI, GCP, GHC, GILT, GLDD, GLT, GMED, GOOD, GPN, GRBK, GRFS, GSKY, GTE, H, HASI, HCCI, HEP, HI, HLF, HMN, HSC, HSIC, HST, HURN, HY, IAA, ICD, ICFI, ICHR, IDN, IDXX, INCY, INFN, INGN, INGR, INN, INS, INSP, INTZ, IOSP, IPGP, IT, ITIC, JAZZ, JBGS, JNCE, KAI, KAMN, KAR, KBAL, KKR, KNSA, KOPN, KTCC, LADR, LAMR, LANC, LARK, LCII, LDOS, LGIH, LNG, LNTH, LOOP, LPSN, LPX, LSCC, LSI, LUNG, LYFT, MANT, MBUU, MCFE, MCRB, MCY, MEC, MED, MELI, MIC, MLM, MOSY, MPC, MPLX, MPWR, MRCC, MRCY, MSEX, MTCH, MTOR, MVBF, NEX, NMIH, NNN, NR, NRC, NS, NSA, NVTA, NXST, OBSV, ODT, OSPN, OUT, PAA, PAGP, PAYC, PCRX, PEAK, PEN, PERI, PFE, PINC, PKI, PKOH, POWL, PQG, PRO, PRU, PTCT, PTVCA, PTVCB, PUMP, PVAC, PVG, PXD, PXLW, QUAD, RACE, RARE, RCKY, RCM, RCUS, RDN, RGEN, RHP, RM, RMRM, RNG, RPAI, RRR, RTLR, RVI, RYAM, SABR, SAGE, SEE, SFST, SGMO, SIFY, SILK, SITM, SKLZ, SMCI, SND, SPCE, SPNS, SPT, STAG, STIM, SYKE, SYX, SYY, TBPH, TCS, TDG, TIMB, TKC, TMDX, TMUS, TNC, TREC, TRI, TRTX, TSLX, TTEC, TTI, UA, UAA, UFPT, UPWK, USAC, UTL, VECO, VERI, VIAV, VIRT, VMC, VREX, VRSK, VSH, VST, VTOL, VVI, WDR, WEYS, WK, WLFC, WLK, WLKP, WMG, WOW, WSR, WTI, WTS, WTTR, WU, XELA, XENT, XLNX, XOMA, XP, XYL, YORW, Z, ZBH, ZBRA, ZG\n\n - Ex-div:\n\n  AMRB, BANR, BBD, BBDO, BUD, CS, EIG, ETRN, FMX, HFWA, IBCP, IDA, NTIC, RELL, TGP, USDP, WBS\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 4.319M)\n    - Durables Excluding Defense (previous: 0.5%)\n    - Exports (previous: 187.30B)\n    - FOMC Member Daly Speaks\n    - Factory Orders (consensus: 1.3%, previous: -0.8%)\n    - Factory orders ex transportation (previous: -0.6%)\n    - IBD/TIPP Economic Optimism (previous: 56.4)\n    - ISM NY Business Conditions (previous: 37.2%)\n    - ISM-New York Index (previous: 804.5)\n    - Imports (previous: 258.30B)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.9%)\n    - Trade Balance (consensus: -74.50B, previous: -71.10B)\n\n## Upcoming events for Wednesday, May  5th\n\n - Stock splits:\n\n    - FRSB @ **105:100** (Payable date: 05/20/2021)\n\n - Expected earnings:\n\n  AAWW, ABC, ABEO, ABIO, ABUS, AC, ACAD, ACCD, ACR, ADMA, ADPT, ADT, ADTN, AEGN, AEIS, AEL, AERI, AEZS, AFIN, AINC, ALB, ALCO, ALG, ALGM, ALL, ALLO, ALSK, ALTM, AMEH, AMOT, AMPE, AMPY, AMYT, ANAB, ANSS, AOSL, APA, APT, AQUA, ARAV, ARLO, ARNA, ASC, ASM, ASTE, ASYS, ATAX, ATLO, ATO, ATSG, ATTO, AVA, AVID, AVNS, AVNW, AXGN, BAND, BBSI, BBU, BCH, BCOR, BCSF, BDC, BE, BFAM, BFS, BHR, BKNG, BLX, BRKR, BWA, BXRX, CCMP, CCRN, CCU, CDAY, CDNA, CDW, CENT, CENTA, CENX, CERN, CF, CFBK, CFMS, CGEN, CIM, CKPT, CLDX, CLH, CLLS, CLNC, CLVS, CLW, CMLS, CMRE, CNDT, CNHI, CPA, CPAC, CPE, CPSS, CRD.A, CRD.B, CRTO, CSGS, CSTE, CTSH, CUB, CUTR, CW, CXW, CYBR, DAR, DCP, DFIN, DGII, DHC, DHX, DIN, DLHC, DMAC, DNB, DNN, DNOW, DOC, DRTT, EAF, ECPG, EDIT, EFC, ELA, EMKR, EMR, EPM, EPR, EQH, EQT, EQX, ES, ESTA, ESTE, ETSY, EVH, EVRI, EXC, EYEG, EYPT, FATE, FDP, FICO, FLEX, FLMN, FLOW, FLT, FMC, FMS, FNV, FORR, FOX, FOXA, FPAY, FRPH, FRT, FSLY, FTS, FUN, FUNC, FVE, FXNC, GAU, GBT, GDDY, GDOT, GEL, GFL, GFN, GGB, GIL, GKOS, GLRE, GM, GMAB, GMRE, GNK, GOEV, GOLD, GPL, GRP.U, GSS, GSX, GTHX, HARP, HAYW, HCC, HDSN, HEAR, HFC, HLT, HNGR, HPP, HR, HRTG, HRTX, HSON, HUBG, HUBS, HZNP, IEC, IIPR, IMXI, INMB, INMD, INSG, IO, IONS, ISEE, IVC, IVR, JLL, JRVR, KALA, KE, KIDS, KLIC, KRO, KTOS, KVHI, KW, LBTYA, LBTYB, LBTYK, LCI, LESL, LHCG, LILA, LILAK, LL, LMRK, LNC, LNSR, LOPE, LPI, LUMN, LUMO, MCS, MDCA, MDU, MDWD, MET, MFC, MGPI, MGY, MLR, MLVF, MNKD, MNR, MOR, MRO, MTG, MTW, MYO, NBIX, NC, NEO, NESR, NGD, NHTC, NI, NL, NLTX, NMFC, NNA, NODK, NOTV, NP, NRZ, NUS, NUVA, NVEC, NVO, NVRO, NVST, NWN, NYT, OAS, OCDX, OCUL, ODP, OM, OMI, OMP, OPTN, ORA, ORCC, OSUR, PARR, PASG, PDCE, PEG, PEI, PETQ, PFGC, PFIE, PFLT, PGEN, PING, PLMR, PLYA, PNNT, PNW, PRA, PRI, PRIM, PRTA, PSN, PSNL, PTMN, PTR, PTVE, PWFL, PYPL, QLYS, QNST, QRVO, QTRX, QTWO, QUOT, QURE, RCII, RCKT, RDFN, RDWR, RESN, REYN, RGLD, RGNX, RGR, RIGL, RKT, RLJ, RMNI, RNGR, ROCK, ROOT, RPT, RSG, RUN, RYI, RYN, SAFT, SAR, SBBP, SBGI, SBH, SBOW, SBRA, SCU, SGRY, SHI, SIMO, SITE, SJ, SJI, SKT, SLF, SLNG, SLRC, SMG, SMP, SMSI, SNEX, SNR, SPKE, SPR, SPWR, SRC, SRE, SRPT, SSYS, STAA, STAY, STKL, STLA, STN, STNG, SUNS, SUP, SUPN, SWM, SYN, TALO, TCON, TCPC, TGB, TLND, TNDM, TPC, TPTX, TPVG, TRMB, TRNO, TT, TTGT, TUP, TVTY, TWLO, TWO, TXG, UBER, UFCS, UGI, UIHC, UNM, UPLD, USDP, UTHR, VAC, VAPO, VBIV, VCEL, VGR, VNDA, VRTV, VYGR, WAT, WHD, WLL, WMC, WRK, WTRG, WW, WYNN, XEC, XNCR, XPER, YELL, ZIXI, ZNGA, ZVO\n\n - Ex-div:\n\n  AWI, CATC, CCK, ETR, FELE, FSBW, HMLP, IBTX, KBH, LSTR, MATX, NBN, NEP, NWBI, OFED, OMF, OPBK, SIMO, STBA, TX, VBTX, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 810K, previous: 517K)\n    - Crude Oil Imports (previous: 1.218M)\n    - Crude Oil Inventories (previous: 0.090M)\n    - Cushing Crude Oil Inventories (previous: 0.722M)\n    - Distillate Fuel Production (previous: 0.071M)\n    - EIA Refinery Crude Runs  (previous: 0.253M)\n    - EIA Weekly Distillates Stocks (consensus: -0.648M, previous: -3.342M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.4%)\n    - Gasoline Inventories (consensus: 0.508M, previous: 0.092M)\n    - Gasoline Production (previous: 0.243M)\n    - Heating Oil Stockpiles (previous: -0.175M)\n    - ISM Non-Manufacturing Business Activity (consensus: 69.5, previous: 69.4)\n    - ISM Non-Manufacturing Employment (previous: 57.2)\n    - ISM Non-Manufacturing New Orders (previous: 67.2)\n    - ISM Non-Manufacturing PMI (consensus: 64.3, previous: 63.7)\n    - ISM Non-Manufacturing Prices (previous: 74.0)\n    - MBA 30-Year Mortgage Rate (previous: 3.17%)\n    - MBA Mortgage Applications (previous: -2.5%)\n    - MBA Purchase Index (previous: 281.4)\n    - Markit Composite PMI (previous: 62.2)\n    - Mortgage Market Index (previous: 706.6)\n    - Mortgage Refinance Index (previous: 3,185.3)\n    - Services PMI (previous: 63.1)\n\n^^^^2021-05-03",
        "created_utc": 1620046601,
        "id": "gws01nq",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1620075401.0
    },
    {
        "author": "AmcillaSB",
        "body": "&gt;ARKX and COIN both only went public about a month ago. They’re still in their infancy.\n\nDo you not understand what an ETF is and how it works?\n\nhttps://www.investopedia.com/terms/e/etf.asp\n\nHere's ARKX's top holdings:\n\nName\tSymbol\t% Assets\r  \nTrimble Inc\tTRMB\t9.19%\r  \nThe 3D Printing ETF\tPRNT\t6.06%\r  \nKratos Defense &amp; Security Solutions Inc\tKTOS\t5.62%\r  \nJD.com Inc ADR\tJD\t5.35%\r  \nL3Harris Technologies Inc\tLHX\t5.07%\r  \nIridium Communications Inc\tIRDM\t4.68%\r  \nLockheed Martin Corp\tLMT\t4.27%\r  \nKomatsu Ltd\t6301\t4.26%\r  \nThales\tHO.PA\t3.99%\r  \nAmazon.com Inc\tAMZN\t3.33%",
        "created_utc": 1621474370,
        "id": "gyrqzzs",
        "score": 0,
        "subreddit": "StockMarket",
        "created": 1621503170.0
    },
    {
        "author": "pronkingxxx",
        "body": "The idea that the companies in Ark have no solid fundamentals is perhaps the stupidest thing i've ever read.\n\nLets take a look at some of the holdings, you are telling me that:\n\nTrimble, John Deere, NXP, Caterpillar, Komatsu, NVIDIA, Autodesk for just a quick glimpse of some of the more commonly known stocks in the portfolio are examples of reckless selections and have no solid fundamentals",
        "created_utc": 1620311716,
        "id": "gx5kjar",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1620340516.0
    },
    {
        "author": "No-Season-3226",
        "body": "BIDU – Cathie Wood is a highly regarded investor on Wall Street. Her reputation has been built on her ability to predict companies’ long-term growth potential, while most investors bet on short-term returns. After successfully leveraging Tesla’s (TSLA) growth to boost her ETF management company, Ark Investments, Wood is now betting on Baidu (BIDU), Trimble (TRMB), and Deere (DE)\nAll got a big minus. Maybe Tesla were a lucky Shot and now she gambeles away all Money Like an Ape?",
        "created_utc": 1620289873,
        "id": "gx4nd2j",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1620318673.0
    },
    {
        "author": "kyle91892",
        "body": "Here is net asset value and underlying holdings.\n\nSite: [https://ark-funds.com/arkk](https://ark-funds.com/arkk)\n\nSummary Prospectus - Principal Risks Section - [https://etfs.ark-funds.com/hubfs/1\\_Download\\_Files\\_ETF\\_Website/Prospectuses/ARKK\\_Summary\\_Prospectus.pdf](https://etfs.ark-funds.com/hubfs/1_Download_Files_ETF_Website/Prospectuses/ARKK_Summary_Prospectus.pdf)\n\nHoldings:\n\nCompany Ticker CUSIP Shares Market Value($) Weight(%)\n\n1 TESLA INC TSLA 88160R101 3,459,467 2,342,059,159.00 9.95\n\n2 TELADOC HEALTH INC TDOC 87918A105 8,334,125 1,423,968,597.50 6.05\n\n3 ROKU INC ROKU 77543R102 3,420,473 1,220,082,719.10 5.19\n\n4 SQUARE INC - A SQ 852234103 4,615,084 1,143,433,211.84 4.86\n\n5 SHOPIFY INC - CLASS A SHOP 82509L107 703,222 867,121,951.54 3.69\n\n6 ZILLOW GROUP INC - C Z 98954M200 6,370,651 843,729,018.44 3.59\n\n7 SPOTIFY TECHNOLOGY SA SPOT L8681T102 3,067,150 804,053,372.50 3.42\n\n8 ZOOM VIDEO COMMUNICATIONS-A ZM 98980L101 2,474,413 794,534,014.30 3.38\n\n9 BAIDU INC - SPON ADR BIDU 056752108 3,452,947 733,026,118.63 3.12\n\n10 EXACT SCIENCES CORP EXAS 30063P105 5,346,316 711,166,954.32 3.02\n\n11 TWILIO INC - A TWLO 90138F102 1,764,060 662,298,686.40 2.81\n\n12 CRISPR THERAPEUTICS AG CRSP H17182108 4,991,200 658,239,456.00 2.80\n\n13 UNITY SOFTWARE INC U 91332U101 6,165,551 636,469,829.73 2.71\n\n14 COINBASE GLOBAL INC -CLASS A COIN 19260Q107 1,851,777 545,848,306.29 2.32\n\n15 DOCUSIGN INC DOCU 256163106 2,379,851 534,490,736.09 2.27\n\n16 INVITAE CORP NVTA 46185L103 14,352,796 502,347,860.00 2.14\n\n17 10X GENOMICS INC-CLASS A TXG 88025U109 2,312,229 456,434,004.60 1.94\n\n18 INTELLIA THERAPEUTICS INC NTLA 45826J105 5,308,716 425,121,977.28 1.81\n\n19 SEA LTD-ADR SE 81141R100 1,426,044 366,250,880.52 1.56\n\n20 IOVANCE BIOTHERAPEUTICS INC IOVA 462260100 11,409,802 357,583,194.68 1.52\n\n21 TWIST BIOSCIENCE CORP TWST 90184D100 2,594,471 354,352,849.18 1.51\n\n22 PALANTIR TECHNOLOGIES INC-A PLTR 69608A108 15,014,744 350,894,567.28 1.49\n\n23 NINTENDO CO LTD-UNSPONS ADR NTDOY 654445303 4,815,970 342,463,626.70 1.46\n\n24 KE HOLDINGS INC-ADR BEKE 482497104 6,308,021 332,054,225.44 1.41\n\n25 PURE STORAGE INC - CLASS A PSTG 74624M102 15,978,258 327,873,854.16 1.39\n\n26 IRIDIUM COMMUNICATIONS INC IRDM 46269C102 8,139,789 311,265,531.36 1.32\n\n27 BEAM THERAPEUTICS INC BEAM 07373V105 3,903,026 304,826,330.60 1.30\n\n28 PROTO LABS INC PRLB 743713109 2,556,555 287,868,093.00 1.22\n\n29 FATE THERAPEUTICS INC FATE 31189P102 3,147,221 270,251,867.27 1.15\n\n30 PAGERDUTY INC PD 69553P100 6,209,725 267,142,369.50 1.14\n\n31 2U INC TWOU 90214J101 6,622,988 269,290,692.08 1.14\n\n32 TENCENT HOLDINGS LTD-UNS ADR TCEHY 88032Q109 3,251,447 263,692,351.70 1.12\n\n33 INTERCONTINENTAL EXCHANGE IN ICE 45866F104 2,038,673 239,911,038.64 1.02\n\n34 TWITTER INC TWTR 90184L102 3,672,637 239,051,942.33 1.02\n\n35 DRAFTKINGS INC - CL A DKNG 26142R104 3,922,283 225,374,381.18 0.96\n\n36 SYNOPSYS INC SNPS 871607107 880,867 222,427,726.17 0.95\n\n37 NOVARTIS AG-SPONSORED ADR NVS 66987V109 2,570,263 221,119,725.89 0.94\n\n38 TERADYNE INC TER 880770102 1,633,739 213,709,398.59 0.91\n\n39 LENDINGTREE INC TREE UW 52603B107 947,951 206,947,182.81 0.88\n\n40 EDITAS MEDICINE INC EDIT 28106W103 5,472,206 204,496,338.22 0.87\n\n41 PACIFIC BIOSCIENCES OF CALIF PACB 69404D108 5,966,741 199,766,488.68 0.85\n\n42 VERACYTE INC VCYT 92337F107 3,980,523 195,045,627.00 0.83\n\n43 NANOSTRING TECHNOLOGIES INC NSTG 63009R109 1,931,542 154,561,990.84 0.66\n\n44 MATERIALISE NV-ADR MTLS 57667T100 4,742,189 146,438,796.32 0.62\n\n45 SERES THERAPEUTICS INC MCRB 81750R102 6,608,680 139,971,842.40 0.59\n\n46 TUSIMPLE HOLDINGS INC - A TSP 90089L108 3,334,334 132,373,059.80 0.56\n\n47 STRATASYS LTD SSYS M85548101 5,323,624 121,910,989.60 0.52\n\n48 BERKELEY LIGHTS INC BLI 084310101 2,426,102 122,227,018.76 0.52\n\n49 TRIMBLE INC TRMB 896239100 1,440,750 120,533,145.00 0.51\n\n50 UIPATH INC - CLASS A PATH 90364P105 1,495,273 112,579,104.17 0.48\n\n51 REGENERON PHARMACEUTICALS REGN 75886F107 218,766 106,101,510.00 0.45\n\n52 HUYA INC-ADR HUYA 44852D108 5,656,170 102,885,732.30 0.44\n\n53 CERUS CORP CERS 157085101 15,673,427 93,727,093.46 0.40\n\n54 SKILLZ INC SKLZ 83067L109 5,196,642 93,175,791.06 0.40\n\n55 COMPUGEN LTD CGEN M25722105 8,245,978 71,987,387.94 0.31\n\n56 PACCAR INC PCAR 693718108 664,473 61,065,068.70 0.26\n\n57 DREYFUS GOVT CASH MAN INS X9USDDGCM 44,419,453 44,419,452.87 0.19\n\n58 SYROS PHARMACEUTICALS INC SYRS 87184Q107 4,157,189 25,940,859.36 0.11",
        "created_utc": 1619912073,
        "id": "gwlnmww",
        "score": -5,
        "subreddit": "investing",
        "created": 1619940873.0
    }
]