[
    {
        "author": "aka0007",
        "body": "Motorola and Nokia used to sell lots of phones.",
        "created_utc": 1636322258,
        "id": "hjq8p1v",
        "permalink": "/r/wallstreetbets/comments/qowset/tsla_bulls_and_elon_fanatics_trying_to_convince/hjq8p1v/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1636351058.0
    },
    {
        "author": "ModernBuddha1",
        "body": "Patent portfolio value is based on many factors. It takes a while to analyze each patent but they have tools to do this analysis. Still time consuming and requires lot of people to go through it. \n\nfrom my older post:\n\nJC at last conference call said he's in discussion to sell \"MOST\" of the patents...that equates to minimum of 20,000 patents.\r  \n\r  \n**Aol sold 800 patents for $1.1billion (here) or $1.4 mil per patent**\r  \n\r  \n**kodak sold 1,100 patents for $500 million (here) or $500,000 per patent**\r  \n\r  \n**Motorola sold 7,500 patents for $4 bill (here) or $533,000 per patent**\r  \n\r  \n**nokia is around \\~$700,000 per patent**\r  \n\r  \nWe know that messaging and phone hardware patents are critical to following companies (google, fb, snap, twitter, apple, etc).",
        "created_utc": 1637870459,
        "id": "hm2lxja",
        "permalink": "/r/wallstreetbets/comments/r24ecv/curious_case_of_blackberry_38000_patents_part_i/hm2lxja/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1637899259.0
    },
    {
        "author": "Beneficial_Sense1009",
        "body": "Sure thing, but who was making phones before Apple? Nokia, LG, Blackberry, Motorola, even Amazon, Sony, Ericsson… you get the picture.\n\nThey all sound a bit legacy don’t they?",
        "created_utc": 1636811671,
        "id": "hkggbxk",
        "permalink": "/r/stocks/comments/qsyjg3/so_whats_the_deal_with_tesla_what_is_it_that/hkggbxk/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1636840471.0
    },
    {
        "author": "Emach00",
        "body": "It's hard to wave to the helicopter, hold the gun to your own head, and talk on a Motorola brick phone all at the same time. Better to go slow just to be safe. This is a brand new Ford Bronco in white after all.",
        "created_utc": 1638308897,
        "id": "hmps4bp",
        "permalink": "/r/wallstreetbets/comments/r5sh3e/isnt_towing_the_point_of_owning_a_truck_rivian/hmps4bp/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1638337697.0
    },
    {
        "author": "DxDoctor",
        "body": "Honestly, I kind of fucking hate my Tesla. And lately, with the limitations they put on the car and plans to let other EVs charge at Tesla superchargers, I could easily see myself buying an Apple car in a few years time (even though it will probably cost a lot more). \n\nI’m sure Tesla fanboys and musk idol worshippers will downvote this but, where I used to think Tesla would enjoy absolute market supremacy indefinitely, I’m beginning to see how Apple could make a niche and ultimately become the industry leader. Tesla is where motorola used to be, before apple butt fucked it to death with the iPhone. Kind of hoping the same thing happens here with the apple car. Tesla deserves it lol",
        "created_utc": 1637271651,
        "id": "hl69inn",
        "permalink": "/r/wallstreetbets/comments/qwvbr5/apple_ev/hl69inn/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1637300451.0
    },
    {
        "author": "Ditdr",
        "body": "Eh. I own all 3 stocks so I'm somewhat neutral. Amd won't catch nvda on the gpu front. Except for a few circumstances nvda always will outperform. It doesn't really matter how good an amd gpu is their driver support is terrible and if a 700 dollar gpu that performs like a 1500 dollar gpu sounds good, which it should but in reality it doesn't matter because the drivers are crap and real world performance always lags benchmarks. \n\nOn the cpu front. I'd only use amd cpus on a workstation. The higher core count per dollar is nice but my 5950 system with a 2080ti never ran as well on 2k as my 9900k system with the same gpu. Both have ram tailored for the system and adequate cooling using msi mobos. This is in cod warzone which is heavily cpu dependant. The 9900k is at 5ghz both use noctua 2 tower coolers. And 32gb of b die ram. The amd system has memory tailored to the infinity fabric frequency as well so don't give me that frequency crap. The issue with the 5950 is I get frequent stuttering and lag fps drops. Not network related. If I spin 360  between the downtown and airport runway while on the hill ill lose 50fps. Dropping from 150 to 100 around the time I'm looking at array. 1440p same settings as my 9900k but fir whatever reason my 9900k system doesn't have these stutters when replicating. \n\nI'm buying more intc for the long haul, alder lake might be good. Time will tell. I love amd as well but I think they'll be stretched thin trying to batter the monoliths of 2 industries.",
        "created_utc": 1636518353,
        "id": "hk13cnw",
        "permalink": "/r/wallstreetbets/comments/qql2m0/bullish_on_intel_intc/hk13cnw/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636547153.0
    },
    {
        "author": "sr000",
        "body": "Just like the winners in the smartphone market were the established mobile phone makers like Nokia, Motorola, Sony-Ericsson right.\n\nMy opinion is most of the legacy auto companies will fail in EV except VW.",
        "created_utc": 1637027643,
        "id": "hkssdn6",
        "permalink": "/r/stocks/comments/qukm4y/rivian_is_the_third_largest_automaker_in_the/hkssdn6/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1637056443.0
    },
    {
        "author": "Yngstr",
        "body": "Big picture, I think today’s auto manufacturers go the way of Nokia, motorola, and Samsung…maybe they can find new niches but they are gone unless they can start thinking about selling robots instead of a better EV.\n\nWhen the iPhone first came out everyone focused on the size and shape instead of the implications. So competitors tried to copy the size and shape without really understanding where the world was heading under their nose.\n\nI think that analogy is playing out right now in autos. Every trad auto company still thinks the goal is to build a better EV than Tesla. The goal is to build a better robotic transportation device. A working EV is the bare bare minimum.",
        "created_utc": 1636062526,
        "id": "hjc5yau",
        "permalink": "/r/investing/comments/qmokya/current_future_state_of_automakers/hjc5yau/",
        "score": 6,
        "subreddit": "investing",
        "created": 1636091326.0
    },
    {
        "author": "meta-cognizant",
        "body": "Motorola phones are pretty fantastic for the price.",
        "created_utc": 1638245818,
        "id": "hmmgiew",
        "permalink": "/r/wallstreetbets/comments/r55j9p/what_are_your_moves_tomorrow_november_30_2021/hmmgiew/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1638274618.0
    },
    {
        "author": "DerelictPostman",
        "body": "&gt;Intel is rumoured to be coming out with entry level GPU for $179.\n\nI found the [source here](https://wccftech.com/intel-entry-level-arc-alchemist-gaming-graphics-cards-to-feature-up-to-8-xe-hpg-gpu-cores-6-gb-gddr6-memory-179-us-pricing/)\n\nArticle says performance will be somewhere around that of a GTX 1650....which is selling for around [$160 at Best Buy](https://www.bestbuy.com/site/gigabyte-nvidia-geforce-gtx-1650-4gb-gddr5-pci-express-3-0-graphics-card-black-gray/6409179.p?skuId=6409179).  This means it's also around the [AMD Radeon RX 5500.](https://www.bestbuy.com/site/msi-amd-radeon-rx-5500-xt-8gb-gddr6-pci-express-4-0-graphics-card-black-gray/6397797.p?skuId=6397797)..selling $205 at Best Buy.\n\nAll in all, I don't see this as a win for Intel.  Releasing a GPU that performs at the same level as 2 year old, 2-generation old NVDA graphics card for the same price doesn't seem that great.\n\nAlso, people aren't buying 16-series NVDA cards any more, they've moved on to the 30- series or at the very least the 20-series. [You can see the popularity of different GPUs](https://benchmarks.ul.com/compare/best-gpus?amount=0&amp;sortBy=POPULARITY&amp;reverseOrder=true&amp;types=MOBILE,DESKTOP&amp;minRating=0) here, no one's buying this stuff any more.\n\nTo me, this is just another example of INTC being woefully behind in the GPU space.  People want to buy the latest GPUs to play the latest games...and Intel with this move has shown that they aren't even in the stratosphere as NVDA/AMD.  Woof.",
        "created_utc": 1637687034,
        "id": "hlsdj7e",
        "permalink": "/r/stocks/comments/r0adnz/rstocks_daily_discussion_technicals_tuesday_nov/hlsdj7e/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1637715834.0
    },
    {
        "author": "buffalo_Fart",
        "body": "I thought Motorola invented 6 sigma?",
        "created_utc": 1636510660,
        "id": "hk0nat7",
        "permalink": "/r/investing/comments/qq6xn4/ge_to_split_into_three_separate_businesses/hk0nat7/",
        "score": 5,
        "subreddit": "investing",
        "created": 1636539460.0
    },
    {
        "author": "Pokesaurus_Rex",
        "body": "He has no source and he is flat out wrong. The only price increase from MSRP is from board partners like ASUS and MSI and EVGA on their cards (at most $100 more) but with what the cards are going for right now it’s insignificant.",
        "created_utc": 1637196507,
        "id": "hl26hw2",
        "permalink": "/r/stocks/comments/qw9gzs/nvidia_easily_beats_earnings_expectations_on/hl26hw2/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1637225307.0
    },
    {
        "author": "rasp215",
        "body": "They don’t have much competition in the GPU space. and it’s not nvidia selling GPUs for 2x msrp. It’s resellers and companies like MSI. Their growth is more applications for GPUs outside of gaming.",
        "created_utc": 1637601946,
        "id": "hlnsp16",
        "permalink": "/r/stocks/comments/qzmj56/intel_intc/hlnsp16/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1637630746.0
    },
    {
        "author": "TechyGuy31",
        "body": "Logitech, steelseries, HyperX, Glorious to name a few, plus ASUS, Gigabyte, MSI. \n\nThat's not counting the numerous that go with high quality mechanical keyboards or real headphones.  \n\nIt's clear you haven't done much research into this.",
        "created_utc": 1637111083,
        "id": "hkxfw38",
        "permalink": "/r/stocks/comments/qvetwq/whats_the_bull_thesis_for_corsair_crsr/hkxfw38/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1637139883.0
    },
    {
        "author": "overpwrd_gaming",
        "body": "Motorola razr probably...",
        "created_utc": 1637640552,
        "id": "hlq9ej5",
        "permalink": "/r/wallstreetbets/comments/qzoqdd/not_stock_related_but_heres_a_photo_of_me_and_the/hlq9ej5/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1637669352.0
    },
    {
        "author": "Professional_Bad7922",
        "body": "Then why don’t we have the option to switch to a time based news feed. I use Reddit purely because I can choose how I want my news feed shown. If we aren’t given that option and only can abide buy their MSI algo for me it is dangerous.",
        "created_utc": 1637251501,
        "id": "hl4uetl",
        "permalink": "/r/ValueInvesting/comments/qwhxg5/name_the_mostleast_ethical_companies_and_why/hl4uetl/",
        "score": 4,
        "subreddit": "ValueInvesting",
        "created": 1637280301.0
    },
    {
        "author": "flicter22",
        "body": "Because Tesla is the iPhone dude. Brand loyalty didn't matter for Nokia and Motorola",
        "created_utc": 1636034243,
        "id": "hja677z",
        "permalink": "/r/stocks/comments/qmjr7o/tesla_sells_1_of_cars_globally_yet_is_priced_more/hja677z/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636063043.0
    },
    {
        "author": "Cdn_Wealth_Hacker",
        "body": "I borrowed to invest. Have been in ENB, Loblaw ($L), Suncor with some of the funds. Majority of the funds have been in an ETF called Global Dividend Global Split Corp. by Brompton funds. ($GDV on the TSX).\n\nPays $0.10/share monthly. Used to be over 10% yield, now it’s just under - closed at $12.52/share yesterday. Didn’t miss any payments during the pandemic.[GDV - Brompton Global Dividend ETF](https://www.bromptongroup.com/product/global-dividend-growth-split-corp/)\n\nI like the find because it gives global exposure, although mostly concentrated in North America. Hold diverse industry sectors and companies. The top 25 holdings include:\n\nMorgan Stanley\nTractor Supply Co\nASML Holding NV \nJPMorgan Chase &amp; Co\nMotorola Solutions Inc\nBank of America Corp \nApple Inc\nGoldman Sachs Group Inc \nMicrosoft Corp\nPaychex Inc\nSchneider Electric SE\nTexas Instruments Inc\nPower Corporation of Canada\nPrologis Inc\nNational Bank of Canada\nJohnson Controls International PLC\nCanadian Natural Resources Ltd\nTelus Corp\nSeagate Technology Holdings PLC\nRoyal Bank of Canada\nWalt Disney Co\n\nResearch and do heavy due diligence of your own if using borrowed funds, but I found this to be a solid foundation for my portfolio.",
        "created_utc": 1636464965,
        "id": "hjxmf8p",
        "permalink": "/r/CanadianInvestor/comments/qq29kt/borrow_to_invest_ideas/hjxmf8p/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1636493765.0
    },
    {
        "author": "Pokesaurus_Rex",
        "body": "No they are selling them at MSRP but the demand is so high for the 30 series cards especially for gamers (The most popular graphics card is a 10 series card mostly 1050-1070) that they sell out instantly. \n\nYou can argue that board partners like Asus and MSI increased MSRP but like that’s nothing compared to what they go for on ebay right now.",
        "created_utc": 1637196400,
        "id": "hl269lq",
        "permalink": "/r/stocks/comments/qw9gzs/nvidia_easily_beats_earnings_expectations_on/hl269lq/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1637225200.0
    },
    {
        "author": "chronoistriggered",
        "body": "We are barely scratching the surface of EV market... \n\nI was there at the beginning of cell phones. Everyone thought Nokia and ericcson will dominate forever with Motorola a close third.",
        "created_utc": 1636805973,
        "id": "hkg7ilo",
        "permalink": "/r/stocks/comments/qsyjg3/so_whats_the_deal_with_tesla_what_is_it_that/hkg7ilo/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636834773.0
    },
    {
        "author": "rudiger13",
        "body": "Contemplating switching from Motorola to a Primeco phone. Thoughts?",
        "created_utc": 1636863253,
        "id": "hkjnz2p",
        "permalink": "/r/wallstreetbets/comments/qskqik/weekend_discussion_thread_for_the_weekend_of/hkjnz2p/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636892053.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  4th of November\n\n\n\n## Upcoming events for Thursday, November  4th\n\n - Expected earnings:\n\n  AAOI, AAON, AAU, ABC, ABNB, ABUS, ACET, ACIW, ACMR, ACR, ACRX, ADAP, ADMA, ADMS, ADVM, ADXN, AE, AERI, AES, AEZS, AFCG, AG, AGLE, AGO, AGS, AHCO, AIG, AINV, AIV, AJX, AKBA, AL, ALBO, ALE, ALEX, ALGS, ALHC, ALKT, ALLO, ALRM, ALTR, AMEH, AMH, AMN, AMPY, AMRK, AMYT, ANGI, ANIK, AOSL, APD, APLE, APPN, APR, APRE, APT, APTV, AQMS, ARC, ARDX, ARNA, ARQT, ARVN, ARW, ASMB, ASPS, ASRT, ATAX, ATEC, ATLO, ATNX, ATRA, ATRS, ATSG, ATUS, AUMN, AUTO, AVLR, AVRO, AXNX, BABA, BALY, BAP, BATRA, BATRK, BBD, BBDO, BBIO, BCE, BCLI, BCOR, BCYC, BDX, BE, BEPC, BFS, BGNE, BGS, BHF, BIGC, BILL, BKD, BL, BLCM, BLDR, BLFS, BLI, BLL, BLPH, BNGO, BPMP, BRG, BSBK, BSGM, BXRX, CABO, CAI, CALA, CARS, CBAY, CBIO, CC, CCOI, CDR, CDTX, CDXS, CDZI, CEMI, CFLT, CFX, CGNX, CHH, CHUY, CI, CIR, CLBS, CLDT, CLDX, CLFD, CLI, CLLS, CLNE, CLXT, CMBM, CMRX, CMT, CNCE, CNDT, CNHI, CNP, CNQ, CNXN, COLD, COLL, COMM, CPLG, CPLP, CRAI, CRDF, CRMD, CRON, CRY, CS, CTHR, CTLP, CTMX, CTSO, CTT, CTXS, CUBE, CVCO, CVET, CVNA, CVRX, CWEN, CWEN.A, CWK, CXP, CYBR, CYCN, CYRX, DBRG, DBX, DDOG, DEN, DHC, DIN, DISH, DK, DKL, DLX, DMLP, DNB, DNLI, DNN, DOCN, DRH, DRNA, DUK, DVAX, DWSN, DYN, EBS, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, EOG, EPAM, ERF, ERII, ESTE, ETTX, EURN, EVC, EWCZ, EXPE, FARM, FAT, FATBB, FATE, FCRD, FDUS, FIS, FLNT, FND, FNKO, FOCS, FOLD, FOR, FOXF, FROG, FRT, FSLR, FTNT, FULC, FVCB, FVE, FWONA, FWONK, GBT, GDOT, GDP, GDYN, GEL, GEO, GERN, GH, GIL, GKOS, GLPG, GMED, GNE, GNL, GOGO, GOLD, GOLF, GOVX, GPP, GPRE, GPRO, GRFS, GROW, GRTS, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HEAR, HHC, HII, HIMX, HL, HMHC, HMPT, HRTG, HSKA, HTA, HWM, HZN, IAC, IBOC, IBP, ICL, IDCC, IDRA, IFRX, IGMS, IHC, IHRT, III, ILMN, IMH, IMMR, IMRA, IMUX, INDP, INDT, ING, INGN, INOD, INS, IOVA, IRM, IRTC, IRWD, ISDR, ISPC, ITP, ITRI, JNCE, JYNT, K, KALA, KBAL, KDMN, KDNY, KFFB, KIQ, KMPH, KOP, KRP, KRTX, KTB, KURA, KVHI, KWR, KYMR, KZR, LABP, LASR, LAUR, LAZY, LBRDA, LBRDK, LCUT, LFVN, LGF.A, LGF.B, LITE, LLNW, LND, LNG, LNT, LNTH, LOCO, LORL, LPTH, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LTRPA, LTRPB, LXP, LYV, MACK, MAIN, MASS, MBUU, MCHP, MDGL, MDRX, MED, MELI, MGEE, MGLN, MGTA, MGTX, MITK, MITO, MLAB, MLCO, MNDT, MNST, MP, MRIN, MRNA, MSC, MSGM, MSI, MTBC, MTD, MTEM, MTSI, MTX, MTZ, MUR, MUX, MXC, MYE, NATR, NE, NEO, NEPH, NET, NFG, NH, NHC, NINE, NKLA, NKSH, NKTR, NLOK, NMM, NNBR, NNI, NOMD, NPTN, NREF, NRG, NS, NSIT, NTCT, NTLA, NTRA, NTUS, NVAX, NVMI, NWS, NWSA, NXTC, OBSV, OEC, OGE, OHI, OLED, ONCT, ONTO, OPCH, OPTN, ORGS, ORIC, ORLA, OTEX, OTRK, OUT, OXY, OYST, PAC, PAE, PALT, PASG, PBA, PBH, PBYI, PCOR, PCTI, PCTY, PDCE, PDEX, PECO, PEI, PENN, PESI, PFSI, PGNY, PH, PHI, PINS, PLM, PLNT, PLX, PMT, PODD, PPL, PRCT, PRDO, PRMW, PROF, PRTA, PRVB, PSNL, PTMN, PTON, PWFL, PWP, PWR, PZG, PZZA, QDEL, QRTEA, QRTEB, QTRX, RBA, RC, RCUS, RDFN, REFR, REG, REGN, REPL, REYN, REZI, RFP, RGA, RGLS, RGS, RKT, RLJ, RMAX, RNGR, RUN, RWAY, SALM, SATS, SELB, SEM, SFE, SFM, SGA, SGMO, SHAK, SHO, SHYF, SID, SIGA, SKM, SLDB, SLQT, SLRX, SMHI, SMLP, SNPO, SO, SPRO, SQ, SRLP, SRRA, SRTS, SSYS, STFC, STKS, STNE, STOR, STRA, STRO, SVC, SVM, SVRA, SWCH, SWKS, SWX, SXI, SYBX, SYNA, TAL, TCX, TDC, TDS, TDW, TEF, TFFP, TGH, TGNA, TGP, TGTX, THR, TIPT, TK, TMCI, TMST, TNK, TPL, TRGP, TRHC, TRIN, TTOO, TTSH, TUEM, TWI, UBER, UEIC, UFCS, UIHC, UNIT, UONE, UONEK, USM, USPH, USWS, VATE, VCTR, VG, VHI, VIA, VIAC, VIACA, VIAO, VIAV, VIR, VLDR, VMC, VNT, VRAY, VRRM, VSAT, VSTO, VTVT, VVI, W, WCC, WD, WELL, WFCF, WLDN, WLL, WMC, WMS, WPM, WSC, WSTG, WW, WWE, WYNN, XENE, XFOR, XLRN, XOMA, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZBH, ZEUS, ZGNX, ZTS\n\n - Ex-div:\n\n  AFB, AMX, ARLP, BKEP, BMRC, BPRN, CEQP, CFFN, CMCO, CMS, CPLP, CVCY, DAN, DKL, ET, FBC, FCBC, FCF, FE, FFWM, FRAF, FRBA, GPP, HCC, HSII, HWKN, HWM, IBCP, ICBK, IDA, INTC, JBHT, LBAI, LBC, LVHD, LW, MMLP, MMP, NSC, NWBI, NWLI, NYCB, OHI, PFE, PNFP, RELL, SIRI, SRLP, STZ, STZ.B, SUN, TGP, UL, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 17.895K)\n    - Continuing Jobless Claims (consensus: 2,118K, previous: 2,243K)\n    - Exports (previous: 213.70B)\n    - Imports (previous: 287.00B)\n    - Initial Jobless Claims (consensus: 275K, previous: 281K)\n    - Jobless Claims 4-Week Avg. (previous: 299.25K)\n    - Natural Gas Storage (consensus: 63B, previous: 87B)\n    - Nonfarm Productivity (consensus: -3.0%, previous: 2.1%)\n    - OPEC Meeting\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n    - Unit Labor Costs (consensus: 7.0%, previous: 1.3%)\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AMRX, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, EPZM, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, MTNB, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NVO, NWLI, NWN, OCGN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TELL, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n^^^^2021-11-04",
        "created_utc": 1636020014,
        "id": "hj9i3rw",
        "permalink": "/r/RobinHood/comments/qmh8z6/daily_discussion_thread_november_4th_2021/hj9i3rw/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636048814.0
    },
    {
        "author": "kamrali",
        "body": "That's not a very good comparison. Nokia and Motorola never had the brand loyalty that the legacy car makers have. On top of that, Apple already had strong brand loyalty well before the iPhone came out thanks to years of building up iMacs and iPods.\n\nComparing cell phones to a significantly more complicated and costly market like EV's is an apples or oranges comparison.",
        "created_utc": 1636035603,
        "id": "hja9bjx",
        "permalink": "/r/stocks/comments/qmjr7o/tesla_sells_1_of_cars_globally_yet_is_priced_more/hja9bjx/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636064403.0
    },
    {
        "author": "Slowhand1971",
        "body": "Motorola E4 for $110 at Amazon recently\n\nfull android, decent camera, WTF would I spend $1000 on Samsung just to text dick pictures to your wives",
        "created_utc": 1638112228,
        "id": "hmenwbh",
        "permalink": "/r/wallstreetbets/comments/r2t0k1/weekend_discussion_thread_for_the_weekend_of/hmenwbh/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638141028.0
    },
    {
        "author": "AintLongButItsSkinny",
        "body": "EVs and ICE cars are different. Like how Netflix shows are different than blockbuster and Amazon is different than USPS and Apple is different than Motorola or blackberry. \n\nTesla doesn’t mandate you use their insurance. Are you suggesting gender is a better indicator of driving safety than your hard braking? It sounds like you’re just a bad driver (can’t be worse than your English).\n\n“They’re the only company with an app that integrates all the things I listed”. I don’t think you understand English.",
        "created_utc": 1635995305,
        "id": "hj8l65r",
        "permalink": "/r/wallstreetbets/comments/qls92p/tesla_sells_1_of_global_car_sales_and_is_worth/hj8l65r/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636024105.0
    },
    {
        "author": "greytoc",
        "body": "Did IBM really screw up? Could it be argued that IBM was reacting to Apple going public that year and was exploring microcomputers. The first IBM PC didn't come out till 1981 and the XT wasn't released til '83. \n\nIf anything - the deal between IBM and Microsoft was likely the death knell for Digital Research. I suspect that few redditors in this sub remember or have ever heard of CP/M. But in 1980, microcomputers were still a nascent concept. And DRI and Microsoft were private companies. \n\nThis event is actually considered an important watershed moment by computer history enthusiasts like myself but I don't think that at the time, an investment or trading decision could have been made. Back in the 80's and early 90's, the pace of change and competition in microcomputers incredibly fast. And there were a lot more players in both the software and hardware arena. \n\nIf I had to think back to the mid 80's following the deal with IBM/Microsoft - perhaps an investment in Intel could have been the forward looking investment. If you look at the Intel annual report in 1980 - there were hints of what may have been to come with the 8086 replacement. Link to that report for anyone interested - [https://www.intel.com/content/dam/doc/report/history-1980-annual-report.pdf](https://www.intel.com/content/dam/doc/report/history-1980-annual-report.pdf) \\- however - Motorola was a strong competitor and when MIPS arrived on the scene - it could have been argued that Intel could have been threatened. \n\nWhenever I think about these scenarios - I'm reminded that it is very difficult to predict if a specific company will benefit from a singular event.",
        "created_utc": 1636223338,
        "id": "hjkw1ru",
        "permalink": "/r/investing/comments/qnwgtp/daily_general_discussion_and_spitballin_thread/hjkw1ru/",
        "score": 2,
        "subreddit": "investing",
        "created": 1636252138.0
    },
    {
        "author": "Cdn_Wealth_Hacker",
        "body": "Mostly copied from another post I did:\n\nMajority of my funds have been in an ETF called Global Dividend Global Split Corp. by Brompton funds. ($GDV on the TSX).\n\nPays $0.10/share monthly. Used to be over 10% yield, now it’s just under - closed at $12.52/share yesterday. Didn’t miss any payments during the pandemic.[GDV - Brompton Global Dividend ETF](https://www.bromptongroup.com/product/global-dividend-growth-split-corp/)\n\nI like the find because it gives global exposure across diverse industries (although mostly concentrated in North America). Owns securities and uses coveted calls to generate revenue. The top 25 holdings include:\n\nMorgan Stanley\nTractor Supply Co\nASML Holding NV \nJPMorgan Chase &amp; Co\nMotorola Solutions Inc\nBank of America Corp \nApple Inc\nGoldman Sachs Group Inc \nMicrosoft Corp\nPaychex Inc\nSchneider Electric SE\nTexas Instruments Inc\nPower Corporation of Canada\nPrologis Inc\nNational Bank of Canada\nJohnson Controls International PLC\nCanadian Natural Resources Ltd\nTelus Corp\nSeagate Technology Holdings PLC\nRoyal Bank of Canada\nWalt Disney Co\n\nResearch and do heavy due diligence of your own if using borrowed funds, but I found this to be a solid foundation for my portfolio.",
        "created_utc": 1636478982,
        "id": "hjyj71z",
        "permalink": "/r/CanadianInvestor/comments/qq2nnj/whats_a_good_bank_etf_to_invest_in/hjyj71z/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1636507782.0
    },
    {
        "author": "Professional_Bad7922",
        "body": "That MSI algo is dangerous.",
        "created_utc": 1637229202,
        "id": "hl3qawq",
        "permalink": "/r/ValueInvesting/comments/qwhxg5/name_the_mostleast_ethical_companies_and_why/hl3qawq/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1637258002.0
    },
    {
        "author": "TheDeHymenizer",
        "body": "I'm not going to read this but I'll assume it can be summarized as \"even if you assume this crazy number of cars sold TSLA is still overvalued by a massive amount\". Am I wrong? \n\nProblem is this is the wrong way of looking at TSLA. It'd be like looking at Apple in 2007 and saying \"ppfffttt look at how many phones motorola sells even if Apple sells 100% of the worlds phones then they can only reach X valuation\". Problem is smart phones opened whole new revenue streams that previously didn't exist for cell phone manufacturers. \n\nTSLA is similar. Either Tesla is going to find new ways to make money for a car company, such as charging for self driving, sell his AI chips, selling batteries to other manufacturers, etc etc or it'll crash down to earth. Only time will tell if they will succeed or not (I missed the boat on Tesla so I don't own any) but looking at the company's growth prospects as the number of cars they may or may not sell is missing the entire point.",
        "created_utc": 1636728415,
        "id": "hkc5qqb",
        "permalink": "/r/wallstreetbets/comments/qs58xh/the_dean_of_valuation_aswath_damodaran_has/hkc5qqb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636757215.0
    },
    {
        "author": "Trolli-lolli",
        "body": "a.) Eww Windows\n\nb.) Repairing it voids the warranty. They are the worst about right to repair shit. So if you find the right computer repair shop that won't brick your shit, sure it's repairable, but they literally design it not to be and get sued over programmed obsolescence like annually\n\nc.) My Motorola phone has been going strong for about 4 years with better battery life than my iPhone friends. Maybe you just don't know how to buy tech?",
        "created_utc": 1637473014,
        "id": "hlh6vod",
        "permalink": "/r/wallstreetbets/comments/qyftkl/apple_is_severely_undervalued/hlh6vod/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637501814.0
    },
    {
        "author": "Systim88",
        "body": "Apple sells way less than Blackberry, Palm, Nokia and Motorola yet is worth more. \n\nIt’s about where things are going, not where they are dumb dumb. Check last quarter, all legacy OEM lost market share while Tesla gained and broke records. Not to mention 2-3x earnings of legacy OEMs during a chip shortage and climbing.\n\nThey will be top market share once Berlin and Texas ramp up. Also model 3 best selling car (not just EV or luxury) in Europe last month. Model Y on trajectory to be best selling car by revenue worldwide within 2 years. Do more research before posting cherry picked garbage.",
        "created_utc": 1635983148,
        "id": "hj7ugcm",
        "permalink": "/r/wallstreetbets/comments/qls92p/tesla_sells_1_of_global_car_sales_and_is_worth/hj7ugcm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636011948.0
    },
    {
        "author": "Immertired",
        "body": "Yeah, my last Samsung had an sd card and a replaceable battery and headphone Jack. Some of the new ones have none of the above, most still have sd cards though. I hate that on some Samsung and lg androids you get a whole package of bloat ware that makes it a little different than other android devices and then after a while you just stop getting updates. I really prefer Motorola flagship phones with a metal frame that come with a completely bone stock android meaning they’ll be the first to get updates. My last androids were from the Moto z series that worked with the moto mods, really wish they kept going with that experiment, the possibilities were endless. I bundle phone with home internet with Xfinity though and only so many phone options are supported. I even told the sales guy that someone could make a fortune selling iPhone cases (kinda like the charge cases) that had all the extra features people miss",
        "created_utc": 1635836988,
        "id": "hizgy90",
        "permalink": "/r/wallstreetbets/comments/qjje3z/apple_cofounder_i_got_the_new_iphone_i_cant_tell/hizgy90/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635865788.0
    },
    {
        "author": "mka5588",
        "body": "\"think logically, how could apple stock be worth more than Motorola, blackberry, AND Nokia?!\". \"Think logically, how could amazon!!! Be worth more than walmart and sears?! Makes no sense\". Lol gg",
        "created_utc": 1637191792,
        "id": "hl1w6qi",
        "permalink": "/r/wallstreetbets/comments/qvxw3l/ev_bubble/hl1w6qi/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637220592.0
    },
    {
        "author": "V8sOnly",
        "body": "And so it begins. 10 yrs from now this will be the Motorola Razr of EV chargers.",
        "created_utc": 1637716820,
        "id": "hlue0ws",
        "permalink": "/r/wallstreetbets/comments/r0nz2s/ford_can_i_copy_your_homework_tesla_yeah_just/hlue0ws/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637745620.0
    },
    {
        "author": "mechpaul",
        "body": "TL;DR:\n\n- First ever 100% silicon battery ever to market. Many other battery mfgers only have 3-5% silicon.\n\n- Enovix's first generation 100% silicon battery is 30-40% more efficient than any other battery. Imagine getting 30-40% more space in an iPhone and what a game changer that is. Or AR/VR glasses. Or any mobile devices.\n\n- Eventually capable of creating EV batteries by 2025.\n\n- Mobile device manufacturers speculated include SNAP, META, AAPL, HP, MSI. \n\n- Future customers could be the US DoD as silicon can be mined domestically and turned into batteries. The second the government labels batteries as critical infrastructure means Enovix will be in a prime spot to take advantage of that.\n\nJust the TL;DR",
        "created_utc": 1636738532,
        "id": "hkcuc6g",
        "permalink": "/r/wallstreetbets/comments/qs9iab/envx_a_little_known_battery_company_has_treated/hkcuc6g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636767332.0
    },
    {
        "author": "jesperbj",
        "body": "You're entirely ignorant if you think that's the only thing they do. Like I said, the software will improve over time. The hardware is already stellar - also on the top end. \n\nEither way, the numbers don't like. The only phone OEMs who are growing are Chinese. Samsung is slipping. And the Chinese are growing fast.\n\nGuess who's doing entry level only these days? Nokia. Even Motorola, but they are also Chinese owned now.",
        "created_utc": 1636914788,
        "id": "hkm8rwl",
        "permalink": "/r/stocks/comments/qthgfr/what_is_your_hottest_take_about_a_single_stock/hkm8rwl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636943588.0
    },
    {
        "author": "Auraaaaa",
        "body": "Tesla isn’t going to be worth much once traditional manufacturers take EVs and autonomous driving assist seriously. The Mercedes EQS is vastly superior in luxury and creature comforts than the Plaid, and is still cheaper . Look at Rivian. They are making vehicles that Americans want to buy (trucks and SUVs, that look like SUVs).\nHis future wealth is not going to be from Tesla. Tesla is like the Motorola of cell phones. They started out early in the game but everybody else is more refined",
        "created_utc": 1637076245,
        "id": "hkv1tyc",
        "permalink": "/r/wallstreetbets/comments/quyhqs/not_sure_what_papa_elons_endgame_is_but_hes_been/hkv1tyc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637105045.0
    },
    {
        "author": "tisgamebeterhavep0rn",
        "body": "Maybe it has something to do with the bullshit they pulled with MSI (the company, not the index) selling trash scam video cards to consumers that just got discovered yesterday.\n\nI think it's \"GamerNexus\" on YouTube or something, they have a whole video explaining it.",
        "created_utc": 1637658682,
        "id": "hlqzdnu",
        "permalink": "/r/wallstreetbets/comments/qzvoy4/what_are_your_moves_tomorrow_november_23_2021/hlqzdnu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637687482.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of November\n\n\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACNB, ACRE, ACRS, ADPT, AEE, AEMD, AFIN, AGIO, AIRI, ALB, ALG, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CBD, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, CORT, CPE, CPK, CPRI, CPS, CRL, CRSP, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FPH, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GPL, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IIPR, IMXI, INFN, INMB, INN, INOV, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, JMP, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LXRX, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NSR, NUS, NVST, NYT, OAS, OCDX, ODP, ODT, OLP, OM, OMI, OMP, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PSN, PTC, PTGX, PTVE, PW, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RRD, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SB, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGC, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPOK, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STGW, STLA, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UGP, UHAL, UMH, UPLD, UTHR, UVV, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, XP, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (consensus: 2.225M, previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -1.443M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (consensus: 0.25%, previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.333M, previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.0, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 55.0)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 54.9)\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n\n## Upcoming events for Thursday, November  4th\n\n - Expected earnings:\n\n  AAOI, AAON, AAU, ABC, ABNB, ABUS, ACET, ACIW, ACMR, ACR, ACRX, ADAP, ADMA, ADMS, ADVM, ADXN, AE, AERI, AES, AEZS, AFCG, AG, AGLE, AGO, AGS, AHCO, AIG, AINV, AIV, AJX, AKBA, AL, ALBO, ALE, ALEX, ALGS, ALHC, ALKT, ALLO, ALRM, ALTR, AMEH, AMH, AMN, AMPY, AMRK, AMYT, ANGI, ANIK, AOSL, APD, APLE, APPN, APR, APRE, APT, APTV, AQMS, ARC, ARDX, ARNA, ARQT, ARVN, ARW, ASMB, ASPS, ASRT, ATAX, ATEC, ATLO, ATNX, ATRA, ATRS, ATSG, ATUS, AUMN, AUTO, AVLR, AVRO, AXNX, BABA, BALY, BAP, BATRA, BATRK, BBD, BBDO, BBIO, BCE, BCLI, BCOR, BCYC, BDX, BE, BEPC, BFS, BGNE, BGS, BHF, BIGC, BILL, BKD, BL, BLCM, BLDR, BLFS, BLI, BLL, BLPH, BNGO, BPMP, BRG, BSBK, BSGM, BXRX, CABO, CAI, CALA, CARS, CBAY, CBIO, CC, CCOI, CDR, CDTX, CDXS, CDZI, CEMI, CFLT, CFX, CGNX, CHH, CHUY, CI, CIR, CLBS, CLDT, CLDX, CLFD, CLI, CLLS, CLNE, CLXT, CMBM, CMRX, CMT, CNCE, CNDT, CNHI, CNP, CNQ, CNXN, COLD, COLL, COMM, CPLG, CPLP, CRAI, CRDF, CRMD, CRON, CRY, CS, CTHR, CTLP, CTMX, CTRE, CTSO, CTT, CTXS, CUBE, CVCO, CVET, CVNA, CVRX, CWEN, CWEN.A, CWK, CXP, CYBR, CYCN, CYRX, DBRG, DBX, DDOG, DEN, DHC, DIN, DK, DKL, DLX, DMLP, DNB, DNLI, DNN, DOCN, DRH, DRNA, DUK, DVAX, DWSN, DYN, EBS, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, EOG, EPAM, ERF, ERII, ESTE, ETTX, EURN, EVC, EWCZ, EXPE, FARM, FAT, FATBB, FATE, FCRD, FDUS, FIS, FLNT, FMS, FND, FNKO, FOCS, FOLD, FOR, FOXF, FROG, FRT, FSLR, FTNT, FULC, FVCB, FVE, FWONA, FWONK, GBT, GDOT, GDP, GDYN, GEL, GEO, GERN, GH, GIL, GKOS, GLPG, GMED, GNE, GNL, GOGO, GOLD, GOLF, GOVX, GPP, GPRE, GPRO, GRFS, GROW, GRTS, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HEAR, HHC, HII, HIMX, HL, HMHC, HMPT, HRTG, HSKA, HTA, HWM, HZN, IAC, IBOC, IBP, ICL, IDCC, IDRA, IFRX, IGMS, IHC, IHRT, III, ILMN, IMH, IMMR, IMRA, IMUX, INDP, INDT, ING, INGN, INOD, INS, IOVA, IRM, IRTC, IRWD, ISDR, ISPC, ITP, ITRI, JNCE, JYNT, K, KALA, KBAL, KDMN, KDNY, KFFB, KIQ, KMPH, KOP, KRP, KRTX, KTB, KURA, KVHI, KWR, KYMR, KZR, LABP, LASR, LAUR, LAZY, LBRDA, LBRDK, LCUT, LFVN, LGF.A, LGF.B, LITE, LLNW, LND, LNG, LNT, LNTH, LOCO, LORL, LPTH, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LTRPA, LTRPB, LXP, LYV, MACK, MAIN, MASS, MBI, MBUU, MCHP, MDGL, MDRX, MED, MELI, MGEE, MGLN, MGTA, MGTX, MITK, MITO, MLAB, MLCO, MNDT, MNST, MP, MRAM, MRIN, MRNA, MRUS, MSC, MSGM, MSI, MTBC, MTD, MTEM, MTSI, MTX, MTZ, MUR, MUX, MXC, MYE, NATR, NEO, NEPH, NET, NFG, NH, NHC, NINE, NKLA, NKSH, NKTR, NLOK, NMM, NNBR, NNI, NOMD, NPTN, NREF, NRG, NS, NSIT, NTCT, NTLA, NTRA, NTUS, NVAX, NVCN, NVMI, NWS, NWSA, NXTC, OBSV, OEC, OESX, OGE, OHI, OLED, ONCT, ONTO, OPCH, OPTN, ORGS, ORIC, ORLA, OTEX, OTRK, OUT, OXY, OYST, PAC, PAE, PALT, PASG, PBA, PBH, PBYI, PCOR, PCTI, PCTY, PDCE, PDEX, PECO, PEI, PENN, PESI, PFSI, PGNY, PH, PHI, PINS, PLM, PLNT, PLX, PMT, PODD, PPL, PRCT, PRDO, PRMW, PROF, PRTA, PRTK, PRVB, PSNL, PTMN, PTON, PWFL, PWP, PWR, PZG, PZZA, QDEL, QRTEA, QRTEB, QTRX, RBA, RC, RCUS, RDFN, REFR, REG, REGN, REPL, REYN, REZI, RFP, RGA, RGLS, RGS, RKT, RLJ, RMAX, RNGR, ROG, RUN, RWAY, SALM, SATS, SELB, SEM, SFE, SFM, SGA, SGMO, SHAK, SHO, SHYF, SID, SIGA, SKM, SLDB, SLQT, SLRX, SMHI, SMLP, SNPO, SO, SPRO, SQ, SRLP, SRRA, SRTS, SSYS, STFC, STKS, STNE, STOR, STRA, STRO, SVC, SVM, SVRA, SWCH, SWKS, SWX, SXI, SYBX, SYNA, TAL, TCX, TDC, TDS, TDW, TEF, TFFP, TGH, TGNA, TGP, TGTX, THR, TIPT, TK, TMCI, TMST, TNK, TPL, TRGP, TRHC, TRIN, TTOO, TTSH, TUEM, TWI, UBER, UEIC, UFCS, UIHC, UNIT, UONE, UONEK, USM, USPH, USWS, VATE, VCTR, VG, VHI, VIA, VIAC, VIACA, VIAO, VIAV, VIR, VLDR, VMC, VNT, VRAY, VRRM, VSAT, VSTO, VTVT, VVI, W, WCC, WD, WELL, WFCF, WLDN, WLL, WMC, WMS, WPM, WSC, WSTG, WW, WWE, WYNN, XENE, XFOR, XLRN, XNCR, XOMA, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZBH, ZEUS, ZGNX, ZIOP, ZTS\n\n - Ex-div:\n\n  AFB, AMX, ARLP, BKEP, BMRC, BPRN, CEQP, CFFN, CMCO, CMS, CPLP, CVCY, DAN, DKL, ET, FBC, FCBC, FCF, FE, FFWM, FRAF, FRBA, GPP, HCC, HSII, HWKN, HWM, IBCP, ICBK, IDA, INTC, JBHT, LBAI, LBC, LVHD, LW, MMLP, MMP, NSC, NWBI, NWLI, NYCB, OHI, PFE, PNFP, RELL, SIRI, SRLP, STZ, STZ.B, SUN, TGP, UL, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 17.895K)\n    - Continuing Jobless Claims (consensus: 2,118K, previous: 2,243K)\n    - Exports (previous: 213.70B)\n    - Imports (previous: 287.00B)\n    - Initial Jobless Claims (consensus: 275K, previous: 281K)\n    - Jobless Claims 4-Week Avg. (previous: 299.25K)\n    - Natural Gas Storage (previous: 87B)\n    - Nonfarm Productivity (consensus: -3.0%, previous: 2.1%)\n    - OPEC Meeting\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n    - Unit Labor Costs (consensus: 7.0%, previous: 1.3%)\n\n^^^^2021-11-03",
        "created_utc": 1635933614,
        "id": "hj4o3o4",
        "permalink": "/r/RobinHood/comments/qlr6t9/daily_discussion_thread_november_3rd_2021/hj4o3o4/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635962414.0
    },
    {
        "author": "Several_Situation887",
        "body": "Yes, I know that you don't just snap your fingers and have a new fab come online. I've worked close to the industry, spent many hours on-site at Intel, Microchip, and Motorola facilities across the US.\n\nMy thought is that you reprioritize/rearrange your existing production schedules. The tooling/recipes should already exist somewhere for the chips that don't need to be designed from scratch.\n\nYes, somebody's product would have to suffer a setback, but I imagine that chips for other less important purposes could easily be delayed. Each order is not necessarily of the same importance as the others.\n\nOf course, those customers whose orders that would be delayed (preferably on a volunteer basis) would need to be compensated. I'd offer those customers discounts subsidized by the fees I'd charge automakers for the production line jump.",
        "created_utc": 1636127143,
        "id": "hjfeu05",
        "permalink": "/r/StockMarket/comments/qmt0m8/been_noticing_that_fords_stock_is_doing_better/hjfeu05/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1636155943.0
    },
    {
        "author": "bizzro",
        "body": "&gt;  the first smart phone.\n\nHaha nope, they did not. They made the first widely popular smarthphone with some key improvements and feature, that's about it.\n\n&gt; \"No way Nokia, Motorola, Blackberry, Sony etc. will let Apple take away all their market share\".\n\nListen to yourself, you are the one saying no one could. Tesla in this case is NOT Apple, they are \"Nokia, Motorola, Blackberry, Sony\". \n\nBetting on Tesla owning the EV market still in 2035 is like betting on Nokia owning the mobile market in 2020 before the dotcom bust. Both were/are miles ahead of the competition, then Nokia failed to adapt to a shift in the market, the rest is history.\n\nThe problem with early success in a rapidly developing field is that you build up infrastructure and inertia, so when the shift happens you are slow to move and adapt, then you become Nokia.",
        "created_utc": 1636959613,
        "id": "hkoyz2u",
        "permalink": "/r/investing/comments/qu8tfv/tsla_is_fairly_valued_potentially_undervalued/hkoyz2u/",
        "score": 1,
        "subreddit": "investing",
        "created": 1636988413.0
    },
    {
        "author": "Shaun8030",
        "body": "TSX 60 and oil has returned 22 percent consistently seems Inflated. According to the chart TSX 60 has a returned a whopping 95 percent total since 2006, even with dividends (unless you picked all super winners somehow) the index as a whole has been underwhelming. See link below for data. \nhttps://www.google.com/search?\n\nq=xiu+stock&amp;oq=xiu+&amp;aqs=chrome.1.69i57j0i67i433j0i273j0i67j0i512l3j46i512.1755j1j9&amp;client=ms-android-motorola-rev2&amp;sourceid=chrome-mobile&amp;ie=UTF-8",
        "created_utc": 1636849710,
        "id": "hkiuqkv",
        "permalink": "/r/CanadianInvestor/comments/qt9l1q/are_your_guys_leveraging_invest/hkiuqkv/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1636878510.0
    },
    {
        "author": "Over-Bumblebee-3765",
        "body": "I disagree. It really depends on which kind of brick cell phone we’re talking about.\n\nYou slap a Motorola DynaTAC 8000X down in front of me and I’ll go fucking bananas",
        "created_utc": 1637206664,
        "id": "hl2snrx",
        "permalink": "/r/wallstreetbets/comments/qw8udu/what_are_your_moves_tomorrow_november_18_2021/hl2snrx/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637235464.0
    },
    {
        "author": "hdhwhshdhdhwvwixudg",
        "body": "No thanks. People don’t forget what you didn’t to the iPhone 6 Plus users. Or when you switched from Motorola chips to Intel and then back to something proprietary. All of course done in a shadow of lies, deception, and for financial gain. The new $1,500 iPhone 13 doesn’t even include a wall charger. Seriously. Anyone buying Apple products at this point enjoys punishment. They were exposed for slowing down the old iPhones but that doesn’t stop them from doing it today. It’s a cycle of consumer waste and horrible working conditions. SMH.",
        "created_utc": 1637311572,
        "id": "hl8f6zv",
        "permalink": "/r/wallstreetbets/comments/qwvbr5/apple_ev/hl8f6zv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637340372.0
    },
    {
        "author": "SlowNeighborhood",
        "body": "I'm rocking a Motorola as well. I have a G7. It's not top of the line stuff now but it works great for me.",
        "created_utc": 1638113260,
        "id": "hmeq2ko",
        "permalink": "/r/wallstreetbets/comments/r2t0k1/weekend_discussion_thread_for_the_weekend_of/hmeq2ko/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638142060.0
    },
    {
        "author": "DrOctopus-",
        "body": "Sticks and stones pal. The only competitors out there are the new EV companies. How many cigarette companies are successful in vape? None. How did Blackberry, Motorola, etc do against Apple? Not my job to educate you but please go ahead and short Tesla. Put your money where your mouth is.",
        "created_utc": 1636053104,
        "id": "hjbi2an",
        "permalink": "/r/stocks/comments/qmjr7o/tesla_sells_1_of_cars_globally_yet_is_priced_more/hjbi2an/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636081904.0
    },
    {
        "author": "tesla365s",
        "body": "Most costly than blue diamond, pearls, and uranium. History being repeated my friend, what was reason for 1989 and 1999? Yup chip, what happened to Motorola and AMD after that? Yup, AMD went up 2700% in few months so did other chip manufacturing company. Time will show, 7 months from now you will be like wish i had listen to that man! \n(KEY WORD: Chip Shortage)",
        "created_utc": 1636160216,
        "id": "hjhqw3q",
        "permalink": "/r/options/comments/qnahq3/caught_in_nvda_dilemma/hjhqw3q/",
        "score": 1,
        "subreddit": "options",
        "created": 1636189016.0
    },
    {
        "author": "down_up__left_right",
        "body": "&gt;\tNo one made much money making phones before Apple. \n\nNokia, Blackberry, Motorola, Samsung, and LG?\n\nApple didn’t invest the cell phone industry it just came in and took a bunch of market share from the incumbents.",
        "created_utc": 1636727903,
        "id": "hkc4liv",
        "permalink": "/r/investing/comments/qs3uds/ford_stock_and_rivian_stock/hkc4liv/",
        "score": 1,
        "subreddit": "investing",
        "created": 1636756703.0
    },
    {
        "author": "dadmakefire",
        "body": "I also heard that Apple is worth more than Nokia, Motorola, and Blackberry combined. Definite meme stock.",
        "created_utc": 1636543739,
        "id": "hk210ij",
        "permalink": "/r/stocks/comments/qqisap/own_tesla_stock_be_like_elon_musk_and_sell/hk210ij/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636572539.0
    },
    {
        "author": "merlinsbeers",
        "body": "AMD fans spent several years after the ATI purchase in denial about the fact the company was totaled. They've never recovered a sense of proportion.\n\nIf Jim Keller and the coin miners hadn't come along AMD would be a distant memory, like Motorola.\n\nAnd if Intel hadn't stupidly failed to limit AMD's rights as a source of x86 chips, AMD wouldn't have made it out of the 90s.\n\nThey owe Intel everything, and can't stand knowing it.",
        "created_utc": 1636741244,
        "id": "hkd106c",
        "permalink": "/r/stocks/comments/qrvyuc/nine_us_governors_press_us_lawmakers_to_pass_52/hkd106c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636770044.0
    },
    {
        "author": "SituationLive4406",
        "body": "Whole market is down today! I am thinking since that news came from an article and not a formal press release yet we could see some action if they issue a formal PR with Motorola.",
        "created_utc": 1637690493,
        "id": "hlsmlhi",
        "permalink": "/r/Wallstreetbetsnew/comments/qzss2e/does_everybody_remember_this_one_from_august_big/hlsmlhi/",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1637719293.0
    },
    {
        "author": "consultacpa",
        "body": "This.  They've had an inferior ISA since the Motorola 68000 came out in 1979, but they've still always came out ahead.  I wouldn't bet against Intel.",
        "created_utc": 1637612470,
        "id": "hloj4jf",
        "permalink": "/r/stocks/comments/qzmj56/intel_intc/hloj4jf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1637641270.0
    },
    {
        "author": "tisgamebeterhavep0rn",
        "body": "That's old news, u/VisualMod\n\nI'm talking about the new msi/nvidia scam reported on yesterday.",
        "created_utc": 1637659569,
        "id": "hlr0d74",
        "permalink": "/r/wallstreetbets/comments/qzvoy4/what_are_your_moves_tomorrow_november_23_2021/hlr0d74/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637688369.0
    },
    {
        "author": "SlowNeighborhood",
        "body": "Recent went between a Samsung, to iOS 15, and then to a Motorola and I gotta say I'm loving this moto more than any phone I've had. My first smartphone was a moto and I loved that too but this kick its ass and then runs a mile and back to kick its ass again",
        "created_utc": 1638304341,
        "id": "hmpgr7s",
        "permalink": "/r/wallstreetbets/comments/r5kuzn/daily_discussion_thread_for_november_30_2021/hmpgr7s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638333141.0
    },
    {
        "author": "SlowNeighborhood",
        "body": "No. Samsungs suck. But a real proper Android is the shit. Try out a Motorola or a Google pixel and you will see what I mean",
        "created_utc": 1638303805,
        "id": "hmpfexq",
        "permalink": "/r/wallstreetbets/comments/r5kuzn/daily_discussion_thread_for_november_30_2021/hmpfexq/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638332605.0
    },
    {
        "author": "One_Psychology_6500",
        "body": "I think the idea is that these comparisons are like comparing how many phone Motorola and Apple were selling in 2009-10. \n\nQuestion is: is Tesla the apple of cars? Or is it the blackberry?",
        "created_utc": 1637156901,
        "id": "hkzj75f",
        "permalink": "/r/wallstreetbets/comments/qvxw3l/ev_bubble/hkzj75f/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1637185701.0
    },
    {
        "author": "mark_the_narc",
        "body": "Glorious is only known for their mice and they dont sell headsets asus sure sells peripherals but thats not what theyre known for same thing with gigabyte and msi",
        "created_utc": 1637158437,
        "id": "hkzme8e",
        "permalink": "/r/stocks/comments/qvetwq/whats_the_bull_thesis_for_corsair_crsr/hkzme8e/",
        "score": 0,
        "subreddit": "stocks",
        "created": 1637187237.0
    },
    {
        "author": "tisgamebeterhavep0rn",
        "body": "Once again: did ppl checked the gamernexus video on Nvidia's / MSI current bullcrap?",
        "created_utc": 1637659230,
        "id": "hlqzzbn",
        "permalink": "/r/wallstreetbets/comments/qzvoy4/what_are_your_moves_tomorrow_november_23_2021/hlqzzbn/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1637688030.0
    },
    {
        "author": "orockers",
        "body": "Let’s look 10 years into the future, are we just gonna see iPhones and Samsungs in everyone’s pocket?  Cause that’s what Apple is priced at.  As if Nokia, Motorola, Blackberry and literally everyone else won’t have phones as well.",
        "created_utc": 1636525697,
        "id": "hk1ezwu",
        "permalink": "/r/wallstreetbets/comments/qqd61v/what_are_your_moves_tomorrow_november_10_2021/hk1ezwu/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1636554497.0
    },
    {
        "author": "jessejerkoff",
        "body": "Gme is a success because it's in the best niche market doing revolutionary things, changing e-commerce fundamentally.\n\nGive it ten years and Amazon will be MySpace while GME will be Facebook. Amazon will be altavista and GME is Google. Amazon is Motorola and gme is apple",
        "created_utc": 1636020670,
        "id": "hj9iw9c",
        "permalink": "/r/stocks/comments/qm7t59/bgfv_a_fundamentally_undervalued_technically/hj9iw9c/",
        "score": -7,
        "subreddit": "stocks",
        "created": 1636049470.0
    },
    {
        "author": "BrownieKhan",
        "body": "Pure Storage Cocks!!! Raising q3 guidance. Such a better stock than Nutanix or Netapp. PSTG",
        "created_utc": 1635953682,
        "id": "hj5r6eo",
        "permalink": "/r/wallstreetbets/comments/qlr721/daily_discussion_thread_for_november_03_2021/hj5r6eo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635982482.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of November\n\n\n\n## Upcoming events for Monday, November  1st\n\n - Expected earnings:\n\n  ABIO, ADC, ADTN, ADUS, AKTS, ALX, AMC, AMG, AMRC, ANAT, ANET, APEN, APLS, AWR, BEN, BNL, BRKR, BRX, BWXT, CACC, CAR, CCLP, CEA, CHGG, CLDB, CLX, CNA, CORR, CPLP, CRNT, CRUS, CSR, CSWC, CURO, CVI, CWBC, DSPG, DSS, DZSI, EC, EEX, EGRX, ENBL, EPRT, EVER, FANG, FEDU, FGBI, FN, GAIA, GAME, GSS, GTE, GXO, HLIT, HNRG, HOLX, IPI, ISEE, IVAC, IVT, IX, JELD, KFRC, KLDO, KMT, KOF, L, LDI, LEG, LKCO, LTRN, LXU, MCK, MFIN, MGP, MNOV, MOS, MRBK, MVBF, NBIX, NERV, NRIM, NSP, NSSC, NTR, NXPI, O, OGS, OIS, ON, ONVO, OTTR, PCG, PDLB, PLOW, PSA, RHP, RIG, RMBS, RRX, RYAAY, SBAC, SBT, SKT, SMLR, SNDX, SOI, SPG, SUNW, SXC, TA, TKR, TRVG, TRVN, TTI, UAN, UNVR, VBIV, VNO, VNOM, VRNS, WBK, WLFC, WMB, WMK, WTRG, XENT, ZI\n\n - Ex-div:\n\n  AES, BANR, BKR, ETRN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, ITUB, LMRK, O, OMF, SHLX, SPH, SRCE, VER, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Construction Spending (consensus: 0.4%, previous: 0.3%)\n    - ISM Manufacturing Employment (previous: 50.2)\n    - ISM Manufacturing New Orders Index (previous: 66.7)\n    - ISM Manufacturing PMI (consensus: 60.5, previous: 61.1)\n    - ISM Manufacturing Prices (consensus: 78.5, previous: 81.2)\n    - Investing.com Gold Index (actual: 59.9%, previous: 54.3%)\n    - Investing.com S&amp;P 500 Index (actual: 57.5%, previous: 47.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 59.2, previous: 60.7)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSP, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCFT, OCN, OKE, OMCL, OMIC, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRD, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACRE, ACRS, ADPT, AEE, AFIN, AGIO, ALB, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ES, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HOFV, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IDN, IIPR, IMXI, INFN, INMB, INN, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NUS, NVST, NYT, OAS, OCDX, ODP, OLP, OM, OMI, OMP, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PRTA, PSN, PTC, PTGX, PTVE, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RC, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SGMO, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STCN, STGW, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UGP, UHAL, UMH, UPLD, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -2.311M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.1, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.30B, previous: -73.30B)\n\n^^^^2021-11-01",
        "created_utc": 1635760818,
        "id": "hiv8hui",
        "permalink": "/r/RobinHood/comments/qkan8y/daily_discussion_thread_november_1st_2021/hiv8hui/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635789618.0
    },
    {
        "author": "_grapevan",
        "body": "Anyone else playing NXPI earnings?",
        "created_utc": 1635795956,
        "id": "hix76ry",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hix76ry/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635824756.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of November\n\n\n\n## Upcoming events for Monday, November  1st\n\n - Expected earnings:\n\n  ABIO, ADC, ADTN, ADUS, AKTS, ALX, AMC, AMG, AMRC, ANAT, ANET, APEN, APLS, AWR, BEN, BNL, BRKR, BRX, BWXT, CACC, CAR, CCLP, CEA, CHGG, CLDB, CLX, CNA, CORR, CPLP, CRNT, CRUS, CSR, CSWC, CURO, CVI, CWBC, DSPG, DSS, DZSI, EC, EEX, EGRX, ENBL, EPRT, EVER, FANG, FEDU, FGBI, FN, GAIA, GAME, GSS, GTE, GXO, HLIT, HNRG, HOLX, IPI, ISEE, IVAC, IVT, IX, JELD, KFRC, KLDO, KMT, KOF, L, LDI, LEG, LKCO, LTRN, LXU, MCK, MFIN, MGP, MNOV, MOS, MRBK, MVBF, NBIX, NERV, NRIM, NSP, NSSC, NTR, NXPI, O, OGS, OIS, ON, ONVO, OTTR, PCG, PDLB, PLOW, PSA, RHP, RIG, RMBS, RRX, RYAAY, SBAC, SBT, SKT, SMLR, SNDX, SOI, SPG, SUNW, SXC, TA, TKR, TRVG, TRVN, TTI, UAN, UNVR, VBIV, VNO, VNOM, VRNS, WBK, WLFC, WMB, WMK, WTRG, XENT, ZI\n\n - Ex-div:\n\n  AES, BANR, BKR, ETRN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, ITUB, LMRK, O, OMF, SHLX, SPH, SRCE, VER, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Construction Spending (consensus: 0.4%, previous: 0.3%)\n    - ISM Manufacturing Employment (previous: 50.2)\n    - ISM Manufacturing New Orders Index (previous: 66.7)\n    - ISM Manufacturing PMI (consensus: 60.5, previous: 61.1)\n    - ISM Manufacturing Prices (consensus: 78.5, previous: 81.2)\n    - Investing.com Gold Index (actual: 59.9%, previous: 54.3%)\n    - Investing.com S&amp;P 500 Index (actual: 57.5%, previous: 47.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 59.2, previous: 60.7)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSP, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCFT, OCN, OKE, OMCL, OMIC, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRD, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACRE, ACRS, ADPT, AEE, AFIN, AGIO, ALB, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ES, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HOFV, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IDN, IIPR, IMXI, INFN, INMB, INN, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NUS, NVST, NYT, OAS, OCDX, ODP, OLP, OM, OMI, OMP, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PRTA, PSN, PTC, PTGX, PTVE, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RC, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SGMO, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STCN, STGW, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UGP, UHAL, UMH, UPLD, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -2.311M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.1, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.30B, previous: -73.30B)\n\n^^^^2021-11-01",
        "created_utc": 1635760818,
        "id": "hiv8hui",
        "permalink": "/r/RobinHood/comments/qkan8y/daily_discussion_thread_november_1st_2021/hiv8hui/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635789618.0
    },
    {
        "author": "_grapevan",
        "body": "Anyone else playing NXPI earnings?",
        "created_utc": 1635795956,
        "id": "hix76ry",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hix76ry/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635824756.0
    }
]