[
    {
        "author": "awe2D2",
        "body": "ACDC. Canadian battery company with deals with an electric  car manufacturer with hundreds of millions of preorders and batteries for housing developments. Supposed to be a better battery than Tesla's. It's currently at .32, and if it's as good as they say it is I expect that a lot higher in the future.\n\nFLT. Drone delivery, already has air clearance and contracts with Air Canada, Canadian government and northern communities to deliver goods a lot cheaper than traditional flights and ice roads. Proprietary software. It's just above $1.\n\nESE. An eSports company. I expect eSports to grow a lot as more young people watch that online than traditional sports. It's around $1.50\n\nAll of these are tradable on Wealthsimple",
        "created_utc": 1625588660,
        "id": "h493652",
        "score": 11,
        "subreddit": "pennystocks",
        "created": 1625617460.0
    },
    {
        "author": "Hawkstein",
        "body": "&gt;ACDC. Canadian battery company with deals with an electric  car manufacturer with hundreds of millions of preorders and batteries for housing developments. Supposed to be a better battery than Tesla's. It's currently at .32, and if it's as good as they say it is I expect that a lot higher in the future.\n\nWeird. The profile of the company is software and blockchain solutions not batteries?\n\n&gt;FLT. Drone delivery, already has air clearance and contracts with Air Canada, Canadian government and northern communities to deliver goods a lot cheaper than traditional flights and ice roads. Proprietary software. It's just above $1.\n\nI'm skeptical but if anything it's an very long term play.",
        "created_utc": 1625589993,
        "id": "h49670d",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1625618793.0
    },
    {
        "author": "awe2D2",
        "body": "In Canada the stock ticker is FLT. This drone delivery industry will be common place in the future, maybe not for household city deliveries, but for rural and remote locations it'll end up being the cheapest and fastest way to get stuff. Oil rig in Northern Alberta broken down and need a new part to repair? Way faster than a truck, way cheaper than a helicopter or plane",
        "created_utc": 1625871089,
        "id": "h4n6nr1",
        "score": 4,
        "subreddit": "smallstreetbets",
        "created": 1625899889.0
    },
    {
        "author": "locoghoul",
        "body": "Canada ape reporting: CGX (canadian AMC) about to boom when theaters reopen next friday. DDC (Drone Deliveries Canada) also got approved for airport contract, my FLT stock raised 25% today. If you want a short term gain start pumping CGX, summer just started. FLT or any other drone delivery service is speculative and long term",
        "created_utc": 1625864871,
        "id": "h4muglx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625893671.0
    },
    {
        "author": "Chefmundoz",
        "body": "FLT drone delivery taking off",
        "created_utc": 1625842650,
        "id": "h4lijji",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625871450.0
    },
    {
        "author": "gaydetector3000",
        "body": "Drone delivery Corp $FLT on the TSX it’s heavily on sale currently at almost 1$ per share and the applications for drone technologies are endless. Aside for commercial deliveries in half the time, they just released news with a regional government organization(Peel region) to implement DDC technology in emergency first response. Imagine a drone could deliver an AED to any emergency site and provide earlier medical assistance to a critical patient? Applications ready to change the world",
        "created_utc": 1625763486,
        "id": "h4hqnzx",
        "score": 1,
        "subreddit": "investing",
        "created": 1625792286.0
    },
    {
        "author": "IWanaTalk2Samson",
        "body": "Give me your opinion or not.....SCR.TO and FLT.TSXV .... I own shares in both and sizeable positions so I have some skin in already.... Pros of SCR is their present reach of CAD sports fans and CAD sports gamblers (C-218 passed!) as well as their small float 50M or so shares, Rogers Comm backing.... Cons I have read that their autonomous TECH approach is ambitious and could lead to huge obstacles instead of just buying an already present platform for their app. Also their revs aren't huge with respect to market cap.... FLT.....Pros.. reach in the already moving global drone industry (with DSV and deal with Edmonton Airport), has 5(?) Patents. No debt virtually. Nice cash balance. Cons....pre-revenue company essentially at this point......their CEO sold like 200K + shares at the top in FEB 2021. I get people need to be paid but woof. Lots of socioeconomic obstacles to drone usage despite FAA support up to this point. Pretty sizeable float at 200M+shares....I think that covers it. Give me some criticism or an opinion. Thanks",
        "created_utc": 1626518771,
        "id": "h5i4yf5",
        "score": 1,
        "subreddit": "investing",
        "created": 1626547571.0
    },
    {
        "author": "StockRetailersArmy",
        "body": "What is Flt ?",
        "created_utc": 1626102241,
        "id": "h4xdr0z",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1626131041.0
    },
    {
        "author": "lunar_tardigrade",
        "body": "I would beat all you all with just:\n\nKSHB, FLT, PONGF",
        "created_utc": 1626390122,
        "id": "h5bznay",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1626418922.0
    },
    {
        "author": "MasterChiefOne",
        "body": "$FLT going to the moon hahahaha gonna hit hundreds it's crazy",
        "created_utc": 1625574294,
        "id": "h48asil",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625603094.0
    },
    {
        "author": "Chefmundoz",
        "body": "FLT drone delivery I like this company",
        "created_utc": 1625963796,
        "id": "h4rb3wz",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1625992596.0
    }
]