[
    {
        "author": "ArticCircleofRandom",
        "body": "When I was sitting for my CPA exams and learning about IFRS 15(Revenue) the text of standard included Enron as an example. Out of the 30 plus standards I went through I don't remember any other examples. \n\nI heard a PwC partner called it buying season back in the early 2000s, because they got Arthur Anderson businesses for practicly nothing. Accenture is valued at $240B and was 35%-40% of AAs business. Crazy to think where Arthur would be now, since all of the accounting firms have added $10s of billions in revenue and 10,000s of employees.",
        "created_utc": 1636332689,
        "id": "hjqwhb5",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1636361489.0
    },
    {
        "author": "S7EFEN",
        "body": "healthcare, finance, government, very large businesses are full of very dated software and business processes. the core rpa product builds on top of these systems to automate them.\n\nalso relevant for all companies when looking at things like onboarding, payroll, anything that involved managing data across multiple applications etc\n\nuipath is also trying to expand way beyond core rpa as a product. process mining is really what is needed to really make the product scale. rpa is neat but it is ultimately a bandaid. ofc, many companies are very very slow to modernize their software so the bandaids tend to be permanent.\n\nin addition to process mining and core rpa uipath offers a bunch of other products aimed to make their software a comprehensive automation platform (apps, ai center etc)\n\nthe problem ofc is that you buy the software but you then need to have solutions pretty specific to your business built out, and while it is a 'low code' platform if you arent hiring people with at least basic SWE fundamentals the code will be ugly, build up lots of technical debt, be unreliable and hard to maintain. Companies buy the software and then need to build out a  team or work with deloitte, accenture etc. This is one major area that limits growth.\n\nBut the product is the best in its field. Very easy to automate processes that save very large amount of time/money if you are at least a mediocre developer.",
        "created_utc": 1637893326,
        "id": "hm3w3k0",
        "score": 5,
        "subreddit": "stocks",
        "created": 1637922126.0
    },
    {
        "author": "Tacocats_wrath",
        "body": "I have not forgotten. I play options on volitile stocks and use the winning to invest in long term plays like visa, MasterCard, intuitive surgical, Brookfield asset managers, Accenture, constellation software, Amarican tower, WSP global ect. \n\nIt's an excellent strategy. As long as your not retarded with options.",
        "created_utc": 1637202006,
        "id": "hl2inhl",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1637230806.0
    },
    {
        "author": "BrodaNoel",
        "body": "If you want an alternative to GLOB, with less risk, you may consider ACN (but I am not there)",
        "created_utc": 1637213280,
        "id": "hl352to",
        "score": 3,
        "subreddit": "stocks",
        "created": 1637242080.0
    },
    {
        "author": "WallStreetDoesntBet",
        "body": "VAR (Value-Added Reseller) companies would be potential acquirers of NLST; CDW or Accenture (ACN) at the top of the list.",
        "created_utc": 1637427829,
        "id": "hlejs4v",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1637456629.0
    },
    {
        "author": "devilmaskrascal",
        "body": "I can speak to pre-DA warrants. I think the best bang for your buck right now is DRAY, VELO and LEGA.\n\nDRAY is too good of a team to be stuck in the .60s. 1/3 warrant-in-units.\n\n&gt;Gretchen Howard (COO at Robinhood Markets), Claire Johnson (COO at Stripe), Stacy Brown-Philpot (Former CEO of TaskRabbit, Director of HP and Nordstrom)  \n&gt;  \n&gt;Software, data and TMT (technology, media and telecom)  \n&gt;  \n&gt;Trust: $250,000,000  \n&gt;  \n&gt;Underwriter: B. Riley Securities, Inc.\n\nVELO is being way oversold for a 1/3 warrant-in-units split with a good team. It was already cheap even with the BBQGuys DA, but now that it's been cancelled it's the best buying opportunity. At this point there aren't too many great 1/3 WiU teams in the low .60s.\n\n&gt;Adrian Covey (Global Managing Director of Growth &amp; Strategy, M&amp;A Lead Accenture), Nicolas Brien (Fmr CEO McCann Worldgroup, CFO of FST), Carla Hendra (CEO Ogilvy Consulting), Ramin Amari (CFO Vice Media, FST)  \n&gt;  \n&gt;Tech, Digital Services and Platforms  \n&gt;  \n&gt;Trust: $230,000,000  \n&gt;  \n&gt;Related: FST, FZT  \n&gt;  \n&gt;Underwriter: Citigroup, Canaccord Genuity\n\nLEGA is a 1/4 WiU and traded consistently over 1 for months during the summer and now has stalled out at the bottom of the .70s and got forgotten about.\n\n&gt;Mitchell Green (Founder &amp; GP of Lead Edge), Meg Whitman (Former CEO of HP, Former CEO of eBay, Former CEO of Quibi, and Director of Procter &amp; Gamble)  \n&gt;  \n&gt;Software, Internet, Tech  \n&gt;  \n&gt;Trust: $300,000,000  \n&gt;  \n&gt;Underwriter: Credit Suisse, J.P.Morgan\n\nAs for post DA warrants, SCVX-WT (Bright Machines) looks like the best opportunity. Strong PIPE (over $200M, including Fidelity and Softbank) means the deal should go through, they've already filed an S-4, and as of yesterday warrants were trading at .79. The company is very interesting, building custom robotic modular assembly \"microfactories.\"",
        "created_utc": 1636708184,
        "id": "hkbaj24",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1636736984.0
    },
    {
        "author": "nobodyphilip",
        "body": "Is that in reference to Loggi? They’re a separate company but Mercado Libre is a large customer of theirs as is Amazon.\n\n“Loggi also serves a slew of large clients, including a number of local high street retailers as well as marketplaces Amazon and Mercado Libre, both companies that have been investing in improving their own logistics. Lecuyer is unfazed by the developments: “We only do logistics, rather than a marketplace or financial services at the same time, and that focus gives us a clear advantage”, he noted.”\n\nhttps://www.google.com/amp/s/www.forbes.com/sites/angelicamarideoliveira/2021/03/06/brazil-tech-round-up-loggis-mega-round-mercado-livre-ramps-up-brazil-investment-accenture-goes-shopping/amp/",
        "created_utc": 1635998560,
        "id": "hj8r629",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1636027360.0
    },
    {
        "author": "LawOpening6189",
        "body": "Don’t mess with energy the reward isn’t work the risk. Trade desk, Accenture, crwd strike, upstart, Shopify tesla, Airbnb Tdoc isrg and adobe",
        "created_utc": 1635985923,
        "id": "hj80pqn",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1636014723.0
    },
    {
        "author": "Farscape1477",
        "body": "I like ACN, used to hold it. Cut down on my portfolio recently, too many to follow.",
        "created_utc": 1637213581,
        "id": "hl35kqb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1637242381.0
    },
    {
        "author": "LawOpening6189",
        "body": "Accenture, adobe, crm, Roblox ?",
        "created_utc": 1635974493,
        "id": "hj79tkd",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1636003293.0
    },
    {
        "author": "oso_login",
        "body": "The demand for skills is high for all the consulting companie, not ibm în particular. Check results for Accenture, tata, hcl, cognizant and capgemini. The problem for ibm is that they have low margins, they even admites inthe last call",
        "created_utc": 1636053882,
        "id": "hjbk1j8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636082682.0
    },
    {
        "author": "Tacocats_wrath",
        "body": "Personally, I like to hold good stocks. But I also like to have cash on hand to yolo on options. If I have a big win I take most of that and put it into long positions on companies with long runways, large moats, pricing power. I like founder run businesses and rollup strategy companies. \n\nPersonally, my longs are unity software, intuitive surgical, Accenture, Microsoft, constellation software, Brookfield asset managers, Amarican tower, equitable Bank and Lululemon. \n\nI have some smaller positions  in other names as well. It helps that it is all sheltered in a tfsa so I don't have to pay taxes on my gains. It has proven to be very affective.",
        "created_utc": 1636826927,
        "id": "hkhdk9j",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636855727.0
    },
    {
        "author": "Biggie_Cheese96",
        "body": "Throw in a consulting firm like Accenture to implement these solutions as well.",
        "created_utc": 1637853552,
        "id": "hm1iijf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1637882352.0
    },
    {
        "author": "blackshugar97",
        "body": "I am talking about next month contract only, the one right after the front month. For example, take the case of Accenture. I just checked and only the first 3 expires in front have a strike interval of 2.5, the later expiries have a strike interval of 5. It's kind of problematic considering that if someone wanted a particular strike in the fourth expiry which isn't too far away btw, they don't have an option. They have to settle for a shorter DTE which may not be the duration they are lookin for. My point is that there is a lack of uniformity when it comes to strike prices.",
        "created_utc": 1638231894,
        "id": "hmlm1ut",
        "score": 1,
        "subreddit": "options",
        "created": 1638260694.0
    },
    {
        "author": "not_creative1",
        "body": "TLDR:\n\nPLTR has “products” which require a lot of custom action per client, and this is why they say “we added 32 clients this quarter” in their earnings call. Have you ever heard AWS announce how many “clients” they have? No, they only talk in $$. That’s because AWS can scale exponentially and it takes a lot of effort to scale for PLTR. This is why they have low PE. \n\nTheir business model has no moat, AWS which hosts many of these small businesses can easily create a product like this and undercut PLTR by offering bundles and integrating with AWS well. You can bet your ass Amazon is looking into it right this moment if there is money to be made. \n\n\nPLTR is a decent company, it’s a glorified tech consulting company that customises its core product per client and sells it to them. They are better than companies like Accenture who take up trash back office work. PLTR takes up data management, AI projects so they have higher margins. It’s not a company that can grow exponentially like other tech companies.",
        "created_utc": 1637730361,
        "id": "hlv5h9p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637759161.0
    },
    {
        "author": "Rudolf007007",
        "body": "Clear. Share is extremely undervalued. With half the market value than the weakest other competitors (DXC or ACN). After the spin-off from IBM, Kyndryl now has the opportunity to conclude contracts with IBM competing companies, which they already do on an ongoing basis with e.g. Microsoft, Cloudflare, etc. ...\r  \nwhich will now start after the split.",
        "created_utc": 1637780142,
        "id": "hlxnbwt",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1637808942.0
    }
]