[
    {
        "author": "PreparetobePlaned",
        "body": "Norton is a joke and has been for a long time. It was only ever a consumer grade solution as far as I remember. NLOK sold their enterprise division to Broadcom in 2019. They aren't even competing in the same space as MSFT.",
        "created_utc": 1637996536,
        "id": "hm8zkes",
        "score": 29,
        "subreddit": "stocks",
        "created": 1638025336.0
    },
    {
        "author": "HatPlusBeard",
        "body": "I thought Norton was the best antivirus",
        "created_utc": 1637112664,
        "id": "hkxjgrb",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1637141464.0
    },
    {
        "author": "kory08",
        "body": "If you haven't seem Primal Fear you don't know the talent of Edward Norton. Top 5 for me easy. \n\n&amp;#x200B;\n\n\"Tell her I hope her neck is OK\"",
        "created_utc": 1636858468,
        "id": "hkje1mb",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636887268.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 16th of November\n\n\n\n## Upcoming events for Tuesday, November 16th\n\n - Expected earnings:\n\n  AATC, ABVC, ACER, ACH, AQUA, ARMK, AUVI, AVDX, AYLA, AZRE, BHP, BNR, BYFC, BYSI, CAN, CSAN, CTIC, CWCO, CYTH, DAO, DAVA, DLB, DLO, DOYU, DTST, ECC, EDU, EIC, ESEA, FLNG, FUV, GDS, GFF, GSM, GURE, HD, HIVE, IMNM, INCR, INTG, IPHA, ITMR, ITRN, JMIA, LILM, LZB, MBT, MDWD, NETI, NRXP, NTES, NVNO, OCSL, OGEN, OMQS, ONON, OPTN, OZON, PALI, PAVM, PPSI, PTPI, PYR, REAX, REE, RSKD, SBLK, SE, STNE, TDG, TRIB, UBCP, VREX, VRPX, WILC, WMT, ZENV, ZEPP\n\n - Ex-div:\n\n  ABST, ADM, AFL, AG, AGO, AMOT, BGFV, BKH, CSL, CSTE, CXE, CXH, ED, EQIX, FAT, FATBB, FDP, FMBH, FOF, FTS, HOMB, LDP, MAV, MCR, MHI, MIN, MIO, MMT, MPC, MRO, ORA, PFLT, PHD, PHT, POWL, PSF, PSX, PTA, RMAX, RNP, RQI, SSSS, TGT, UTF, VCIF\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -2.485M)\n    - Business Inventories (consensus: 0.6%, previous: 0.6%)\n    - Capacity Utilization Rate (consensus: 75.8%, previous: 75.2%)\n    - Core Retail Sales (consensus: 1.0%, previous: 0.8%)\n    - Export Price Index (consensus: 0.9%, previous: 0.1%)\n    - FOMC Member Barkin Speaks\n    - FOMC Member Bostic Speaks\n    - FOMC Member Daly Speaks\n    - FOMC Member Harker Speaks\n    - IEA Monthly Report\n    - Import Price Index (consensus: 1.0%, previous: 0.4%)\n    - Industrial Production (consensus: 0.7%, previous: -1.3%)\n    - Industrial Production (previous: 4.62%)\n    - Investing.com Gold Index (actual: 51.7%, previous: 51.3%)\n    - Investing.com S&amp;P 500 Index (actual: 63.4%, previous: 61.5%)\n    - Manufacturing Production (consensus: 0.7%, previous: -0.7%)\n    - NAHB Housing Market Index (consensus: 80, previous: 80)\n    - Overall Net Capital Flow (previous: 91.00B)\n    - Redbook (previous: 15.6%)\n    - Retail Control (consensus: 0.9%, previous: 0.8%)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Retail Sales (consensus: 1.2%, previous: 0.7%)\n    - Retail Sales (previous: 13.95%)\n    - Retail Sales Ex Gas/Autos (previous: 0.7%)\n    - TIC Net Long-Term Transactions (previous: 79.3B)\n    - TIC Net Long-Term Transactions including Swaps (previous: 60.90B)\n    - US Foreign Buying, T-bonds (previous: 30.70B)\n\n## Upcoming events for Wednesday, November 17th\n\n - Expected earnings:\n\n  ACY, ARTL, ASYS, ATXI, BBWI, BEDU, BFRA, BIDU, BILI, BV, BWAY, CAAP, CBD, CIH, CPA, CPRT, CRMT, CSCO, CYN, DESP, DGLY, DPW, DSX, EDAP, ELTK, EVGN, EXAI, FORTY, GDEV, GRIN, HI, HP, IIIV, IMBI, INOV, IQ, JAGX, JMP, KLIC, LEXX, LOW, MANU, MAXN, MCG, MTOR, NNOX, NTIC, NVDA, PFLT, PNNT, PW, QUIK, RNW, RVP, SBET, SCVL, SONO, SQM, SRAD, STLA, TGT, TJX, TLK, TTEK, UTI, VINP, VMAR, VSCO, VTEX, VTRU, WLMS, YY, ZIM, ZTO\n\n - Ex-div:\n\n  BG, CNP, COLM, CVX, DMB, EDUC, ESXB, HRZN, HTBI, LFUS, MSFT, NLSN, PCF, PROV, RGP, SBAC, SUNS, SXC, TRI, VLO\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 2.100%)\n    - Building Permits (consensus: 1.640M, previous: 1.586M)\n    - Building Permits (previous: -7.8%)\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: -0.192M)\n    - Crude Oil Inventories (consensus: 1.550M, previous: 1.001M)\n    - Cushing Crude Oil Inventories (previous: -0.034M)\n    - Distillate Fuel Production (previous: 0.035M)\n    - EIA Refinery Crude Runs  (previous: 0.343M)\n    - EIA Weekly Distillates Stocks (consensus: -1.575M, previous: -2.613M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.7%, previous: 0.4%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Bowman Speaks\n    - FOMC Member Daly Speaks\n    - FOMC Member Williams Speaks\n    - Fed Waller Speaks\n    - Gasoline Inventories (consensus: -0.731M, previous: -1.555M)\n    - Gasoline Production (previous: -0.122M)\n    - Heating Oil Stockpiles (previous: -0.030M)\n    - Housing Starts (consensus: 1.580M, previous: 1.555M)\n    - Housing Starts (previous: -1.6%)\n    - MBA 30-Year Mortgage Rate (previous: 3.16%)\n    - MBA Mortgage Applications (previous: 5.5%)\n    - MBA Purchase Index (previous: 278.4)\n    - Mortgage Market Index (previous: 658.1)\n    - Mortgage Refinance Index (previous: 2,841.0)\n\n## Upcoming events for Thursday, November 18th\n\n - Expected earnings:\n\n  AMAT, AMSWA, ATHM, ATKR, AZEK, BABA, BECN, BEPC, BERY, BEST, BHTG, BJ, BLPH, BLRX, BRBR, BRC, BSGM, BTCM, CAL, CATO, CDZI, CRON, CSIQ, DADA, DLA, DUO, EAR, ESE, FINV, FTCH, GAMB, GEOS, GLOB, GOGL, GRFS, GROW, GWGH, HALL, HAYN, HMLP, HRT, HUIZ, INDP, INTU, JD, JOBS, KNOP, KSS, KULR, LABP, LXEH, M, MATW, MESO, MMS, MNSO, MTEM, NCNA, NEW, NGVC, NJR, NUAN, OCFT, ONEW, ORLA, PANW, PAX, PDEX, PLCE, POST, PTLO, RAAS, RMAX, ROST, SID, SUPV, TAL, UGI, VIAO, VIPS, VNET, WDAY, WOOF, WSM, WWD, YMM, YSG, YTRA\n\n - Ex-div:\n\n  ACP, AGD, AMAL, AMSWA, AOD, APO, ASGI, AVA, AWP, BBSI, BBWI, BGH, BWXT, CBFV, CCOI, CFFN, CGAU, CGNX, CMI, CTSH, CUBA, DAC, DEX, EVRG, F, FDBC, FSS, GAIN, GLAD, GOOD, GSK, HCI, HCSG, HL, HSY, IGR, JHX, JXN, LAND, LHX, LMAT, LTC, MCHP, MGA, MGPI, MGU, MIXT, MMM, MOG.A, MOG.B, NMRK, OBNK, OTIS, PKOH, RPRX, RS, RTX, SGC, SHW, SNA, SWCH, TEL, THQ, THW, UMPQ, USA, USLM, WAL, WD, WHR, WING, ZWS\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.939%)\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 8-Week Bill Auction (previous: 0.060%)\n    - Continuing Jobless Claims (consensus: 2,115K, previous: 2,160K)\n    - Continuing Jobless Claims (previous: 2,160K)\n    - Initial Jobless Claims (consensus: 260K, previous: 267K)\n    - Initial Jobless Claims (previous: 267K)\n    - Jobless Claims 4-Week Avg. (previous: 278.00K)\n    - Jobless Claims 4-Week Avg. (previous: 278.00K)\n    - KC Fed Composite Index (previous: 31)\n    - KC Fed Manufacturing Index (previous: 25)\n    - Natural Gas Storage (previous: 7B)\n    - Philadelphia Fed Manufacturing Index (consensus: 24.0, previous: 23.8)\n    - Philly Fed Business Conditions (previous: 24.2)\n    - Philly Fed CAPEX Index (previous: 32.40)\n    - Philly Fed Employment (previous: 30.7)\n    - Philly Fed New Orders (previous: 30.8)\n    - Philly Fed Prices Paid (previous: 70.30)\n    - US Leading Index (previous: 0.2%)\n\n## Upcoming events for Friday, November 19th\n\n - Expected earnings:\n\n  AAMC, AENZ, AIHS, ATNM, BKE, DXLG, DXPE, ENIC, ENLV, FL, GOTU, HIBB, JCS, NVFY, PFSW, PVL, QNRX, RLX, SNOA, SY, TOUR, TPHS, UK, YI\n\n - Ex-div:\n\n  ADX, AEIS, AFT, AIF, ALSN, AOMR, ARDC, BGB, BGX, BSL, BWG, CDRE, CEM, CRD.A, CRD.B, CTR, DFP, DLX, DMO, DX, EHI, EMD, EMO, FFC, FHB, FLC, GDO, GHLD, GSL, HIO, HIX, HNI, HVT, HVT.A, HYI, IGI, JRSH, MMU, MSBI, NATH, NCMI, NKSH, NLOK, OGN, OWL, PAAS, PEO, PFD, PRI, R, RDN, SBI, SPB, TIPT, TSCO, UIHC, UPS, WDI, WEA, WIA, WIW, WPM\n\n - Economic events and announcements:\n\n    - Building Permits (previous: -7.8%)\n    - FOMC Member Clarida Speaks\n    - Fed Waller Speaks\n    - U.S. Baker Hughes Oil Rig Count (previous: 450)\n    - U.S. Baker Hughes Total Rig Count (previous: 550)\n\n^^^^2021-11-16",
        "created_utc": 1637060411,
        "id": "hku8vp6",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1637089211.0
    },
    {
        "author": "MicroChapLong",
        "body": "I deleted it because everyone jumped down my throat for not writing a doctoral dissertation on it. Generally I feel sharing rationale based on FCF yield, forward eps targets and top line growth is enough for people\nTo do their work. Anyway I agree I see $45+ on this list  in 3-5 years. Someone even ridiculed me for saying they have $1B of FCF pre acquisition and told me they have negative FCF haha. Anyway the $1.5B of PF FCF and $3EPS target in 3-5 years plus re-rated top line growth to double digits (people also told me this isn’t true is all I need. Someone else told me revenue declined 60% (let’s forget they divested Symantec haha)",
        "created_utc": 1636476466,
        "id": "hjyctjx",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1636505266.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  4th of November\n\n\n\n## Upcoming events for Thursday, November  4th\n\n - Expected earnings:\n\n  AAOI, AAON, AAU, ABC, ABNB, ABUS, ACET, ACIW, ACMR, ACR, ACRX, ADAP, ADMA, ADMS, ADVM, ADXN, AE, AERI, AES, AEZS, AFCG, AG, AGLE, AGO, AGS, AHCO, AIG, AINV, AIV, AJX, AKBA, AL, ALBO, ALE, ALEX, ALGS, ALHC, ALKT, ALLO, ALRM, ALTR, AMEH, AMH, AMN, AMPY, AMRK, AMYT, ANGI, ANIK, AOSL, APD, APLE, APPN, APR, APRE, APT, APTV, AQMS, ARC, ARDX, ARNA, ARQT, ARVN, ARW, ASMB, ASPS, ASRT, ATAX, ATEC, ATLO, ATNX, ATRA, ATRS, ATSG, ATUS, AUMN, AUTO, AVLR, AVRO, AXNX, BABA, BALY, BAP, BATRA, BATRK, BBD, BBDO, BBIO, BCE, BCLI, BCOR, BCYC, BDX, BE, BEPC, BFS, BGNE, BGS, BHF, BIGC, BILL, BKD, BL, BLCM, BLDR, BLFS, BLI, BLL, BLPH, BNGO, BPMP, BRG, BSBK, BSGM, BXRX, CABO, CAI, CALA, CARS, CBAY, CBIO, CC, CCOI, CDR, CDTX, CDXS, CDZI, CEMI, CFLT, CFX, CGNX, CHH, CHUY, CI, CIR, CLBS, CLDT, CLDX, CLFD, CLI, CLLS, CLNE, CLXT, CMBM, CMRX, CMT, CNCE, CNDT, CNHI, CNP, CNQ, CNXN, COLD, COLL, COMM, CPLG, CPLP, CRAI, CRDF, CRMD, CRON, CRY, CS, CTHR, CTLP, CTMX, CTSO, CTT, CTXS, CUBE, CVCO, CVET, CVNA, CVRX, CWEN, CWEN.A, CWK, CXP, CYBR, CYCN, CYRX, DBRG, DBX, DDOG, DEN, DHC, DIN, DISH, DK, DKL, DLX, DMLP, DNB, DNLI, DNN, DOCN, DRH, DRNA, DUK, DVAX, DWSN, DYN, EBS, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, EOG, EPAM, ERF, ERII, ESTE, ETTX, EURN, EVC, EWCZ, EXPE, FARM, FAT, FATBB, FATE, FCRD, FDUS, FIS, FLNT, FND, FNKO, FOCS, FOLD, FOR, FOXF, FROG, FRT, FSLR, FTNT, FULC, FVCB, FVE, FWONA, FWONK, GBT, GDOT, GDP, GDYN, GEL, GEO, GERN, GH, GIL, GKOS, GLPG, GMED, GNE, GNL, GOGO, GOLD, GOLF, GOVX, GPP, GPRE, GPRO, GRFS, GROW, GRTS, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HEAR, HHC, HII, HIMX, HL, HMHC, HMPT, HRTG, HSKA, HTA, HWM, HZN, IAC, IBOC, IBP, ICL, IDCC, IDRA, IFRX, IGMS, IHC, IHRT, III, ILMN, IMH, IMMR, IMRA, IMUX, INDP, INDT, ING, INGN, INOD, INS, IOVA, IRM, IRTC, IRWD, ISDR, ISPC, ITP, ITRI, JNCE, JYNT, K, KALA, KBAL, KDMN, KDNY, KFFB, KIQ, KMPH, KOP, KRP, KRTX, KTB, KURA, KVHI, KWR, KYMR, KZR, LABP, LASR, LAUR, LAZY, LBRDA, LBRDK, LCUT, LFVN, LGF.A, LGF.B, LITE, LLNW, LND, LNG, LNT, LNTH, LOCO, LORL, LPTH, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LTRPA, LTRPB, LXP, LYV, MACK, MAIN, MASS, MBUU, MCHP, MDGL, MDRX, MED, MELI, MGEE, MGLN, MGTA, MGTX, MITK, MITO, MLAB, MLCO, MNDT, MNST, MP, MRIN, MRNA, MSC, MSGM, MSI, MTBC, MTD, MTEM, MTSI, MTX, MTZ, MUR, MUX, MXC, MYE, NATR, NE, NEO, NEPH, NET, NFG, NH, NHC, NINE, NKLA, NKSH, NKTR, NLOK, NMM, NNBR, NNI, NOMD, NPTN, NREF, NRG, NS, NSIT, NTCT, NTLA, NTRA, NTUS, NVAX, NVMI, NWS, NWSA, NXTC, OBSV, OEC, OGE, OHI, OLED, ONCT, ONTO, OPCH, OPTN, ORGS, ORIC, ORLA, OTEX, OTRK, OUT, OXY, OYST, PAC, PAE, PALT, PASG, PBA, PBH, PBYI, PCOR, PCTI, PCTY, PDCE, PDEX, PECO, PEI, PENN, PESI, PFSI, PGNY, PH, PHI, PINS, PLM, PLNT, PLX, PMT, PODD, PPL, PRCT, PRDO, PRMW, PROF, PRTA, PRVB, PSNL, PTMN, PTON, PWFL, PWP, PWR, PZG, PZZA, QDEL, QRTEA, QRTEB, QTRX, RBA, RC, RCUS, RDFN, REFR, REG, REGN, REPL, REYN, REZI, RFP, RGA, RGLS, RGS, RKT, RLJ, RMAX, RNGR, RUN, RWAY, SALM, SATS, SELB, SEM, SFE, SFM, SGA, SGMO, SHAK, SHO, SHYF, SID, SIGA, SKM, SLDB, SLQT, SLRX, SMHI, SMLP, SNPO, SO, SPRO, SQ, SRLP, SRRA, SRTS, SSYS, STFC, STKS, STNE, STOR, STRA, STRO, SVC, SVM, SVRA, SWCH, SWKS, SWX, SXI, SYBX, SYNA, TAL, TCX, TDC, TDS, TDW, TEF, TFFP, TGH, TGNA, TGP, TGTX, THR, TIPT, TK, TMCI, TMST, TNK, TPL, TRGP, TRHC, TRIN, TTOO, TTSH, TUEM, TWI, UBER, UEIC, UFCS, UIHC, UNIT, UONE, UONEK, USM, USPH, USWS, VATE, VCTR, VG, VHI, VIA, VIAC, VIACA, VIAO, VIAV, VIR, VLDR, VMC, VNT, VRAY, VRRM, VSAT, VSTO, VTVT, VVI, W, WCC, WD, WELL, WFCF, WLDN, WLL, WMC, WMS, WPM, WSC, WSTG, WW, WWE, WYNN, XENE, XFOR, XLRN, XOMA, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZBH, ZEUS, ZGNX, ZTS\n\n - Ex-div:\n\n  AFB, AMX, ARLP, BKEP, BMRC, BPRN, CEQP, CFFN, CMCO, CMS, CPLP, CVCY, DAN, DKL, ET, FBC, FCBC, FCF, FE, FFWM, FRAF, FRBA, GPP, HCC, HSII, HWKN, HWM, IBCP, ICBK, IDA, INTC, JBHT, LBAI, LBC, LVHD, LW, MMLP, MMP, NSC, NWBI, NWLI, NYCB, OHI, PFE, PNFP, RELL, SIRI, SRLP, STZ, STZ.B, SUN, TGP, UL, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 17.895K)\n    - Continuing Jobless Claims (consensus: 2,118K, previous: 2,243K)\n    - Exports (previous: 213.70B)\n    - Imports (previous: 287.00B)\n    - Initial Jobless Claims (consensus: 275K, previous: 281K)\n    - Jobless Claims 4-Week Avg. (previous: 299.25K)\n    - Natural Gas Storage (consensus: 63B, previous: 87B)\n    - Nonfarm Productivity (consensus: -3.0%, previous: 2.1%)\n    - OPEC Meeting\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n    - Unit Labor Costs (consensus: 7.0%, previous: 1.3%)\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AMRX, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, EPZM, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, MTNB, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NVO, NWLI, NWN, OCGN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TELL, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n^^^^2021-11-04",
        "created_utc": 1636020014,
        "id": "hj9i3rw",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636048814.0
    },
    {
        "author": "cwmdailynews",
        "body": "Didn't see the post before it was deleted but stumbled upon this doing my weekly digging on NLOK. Wrote this up shortly after they parted ways with Symantec and came to the same conclusion if they could execute. Completely agree with with really everything you've said and that they are undervalued as well as having minimal risk. In the past year/year and a half they've acquired Avast + Avira, hit  targets/exceeded them, have shown 7 quarters or sequential customer adds, are generating strong FCF for FY 22, trade well below market multiple, cybercrime growth expected to continue to increase, all seem pretty positive. The one concerning area for me was retention, which I didn't think was a huge deal but an area that could certainly be improved. \\~75% for first year promotional customers and \\~85% on the whole. Should certainly be able to improve this but if customers adds continue, not a huge deal. Otherwise, it's just marketing to help people understand why they should have the product and helping current customers understand the value they add. \n\nI still seem to think the general public looks at NLOK as just virus/malware protection when they now offer much more. The comparisons with Windows Defender and other free/freemium offerings no longer holds weight in my opinion but I do not believe NLOK has done enough to help potential and even current customers understand that (seems like a lot of potential investors as well). Suppose that Windows could add features to Defender or roll out free versions of what NLOK offers in their various packages, but certainly don't expect it. Seems like the competition is all on the corporate side and consumer side isn't all that intense, at least for the time being. Will be interesting to see how things play out.\n\nOf the street coverage it has, it's mostly positive. Reading through reports seems like analysts are still trying to get a grip on things they returned to growth. Will be fun to watch this play out. I'm with you though, pretty strong conviction here.",
        "created_utc": 1636472561,
        "id": "hjy35i5",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1636501361.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 17th of November\n\n\n\n## Upcoming events for Wednesday, November 17th\n\n - Expected earnings:\n\n  ACY, ARTL, ASYS, ATXI, BBWI, BEDU, BFRA, BIDU, BILI, BV, BWAY, CAAP, CBD, CIH, CPA, CPRT, CRMT, CSCO, CYN, DESP, DGLY, DPW, DSX, EDAP, ELTK, EVGN, EXAI, FORTY, GDEV, GRIN, HI, HP, IIIV, IMBI, INOV, IQ, JAGX, KLIC, LEXX, LOW, MANU, MAXN, MCG, MTOR, NNOX, NTIC, NVDA, PFLT, PNNT, PW, QUIK, RNW, RVP, SBET, SCVL, SONO, SQM, SRAD, STLA, TGT, TJX, TLK, TTEK, UTI, VINP, VMAR, VSCO, VTEX, VTRU, WLMS, YY, ZIM, ZTO\n\n - Ex-div:\n\n  BG, CNP, COLM, CVX, DMB, EDUC, ESXB, HRZN, HTBI, LFUS, MSFT, NLSN, PCF, PROV, RGP, SBAC, SUNS, SXC, TRI, VLO\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 2.100%)\n    - Building Permits (consensus: 1.638M, previous: 1.586M)\n    - Building Permits (previous: -7.8%)\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: -0.192M)\n    - Crude Oil Inventories (consensus: 1.398M, previous: 1.001M)\n    - Cushing Crude Oil Inventories (previous: -0.034M)\n    - Distillate Fuel Production (previous: 0.035M)\n    - EIA Refinery Crude Runs  (previous: 0.343M)\n    - EIA Weekly Distillates Stocks (consensus: -1.229M, previous: -2.613M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.7%, previous: 0.4%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Bowman Speaks\n    - FOMC Member Daly Speaks\n    - FOMC Member Mester Speaks\n    - FOMC Member Williams Speaks\n    - Fed Waller Speaks\n    - Gasoline Inventories (consensus: -0.575M, previous: -1.555M)\n    - Gasoline Production (previous: -0.122M)\n    - Heating Oil Stockpiles (previous: -0.030M)\n    - Housing Starts (consensus: 1.576M, previous: 1.555M)\n    - Housing Starts (previous: -1.6%)\n    - MBA 30-Year Mortgage Rate (previous: 3.16%)\n    - MBA Mortgage Applications (previous: 5.5%)\n    - MBA Purchase Index (previous: 278.4)\n    - Mortgage Market Index (previous: 658.1)\n    - Mortgage Refinance Index (previous: 2,841.0)\n\n## Upcoming events for Thursday, November 18th\n\n - Expected earnings:\n\n  AMAT, AMSWA, ATHM, ATKR, AZEK, BABA, BECN, BEPC, BERY, BEST, BHTG, BJ, BLRX, BRBR, BRC, BSGM, BTCM, CAL, CALT, CATO, CRON, CSIQ, DADA, DLA, DLNG, EAR, EBR, EBR.B, ELP, ESE, EVO, FCUV, FINV, FONR, FRSX, FTCH, GAMB, GEOS, GLOB, GNPX, GOGL, GRFS, GROW, GWGH, HAYN, HMLP, HOLI, HRT, HUIZ, IBRX, INTU, JCTCF, JD, JOBS, KNOP, KSS, LEDS, LMNL, LXEH, M, MATW, MESO, MMS, MNSO, MYSZ, NCNA, NEW, NGVC, NJR, NUAN, NVGS, OCFT, ONEW, PANW, PAX, PDD, PLCE, POST, PTLO, RAAS, RDHL, REDU, RMAX, ROST, SID, SOLY, SUPV, TAL, TEO, UGI, VIAO, VIPS, VNET, WDAY, WOOF, WSM, WWD, XCUR, YMM, YSG, YTRA, ZIVO\n\n - Ex-div:\n\n  ACP, AGD, AMAL, AMSWA, AOD, APO, ASGI, AVA, AWP, BBSI, BBWI, BGH, BWXT, CBFV, CCOI, CFFN, CGAU, CGNX, CMI, CTSH, CUBA, DAC, DEX, EVRG, F, FDBC, FSS, GAIN, GLAD, GOOD, GSK, HCI, HCSG, HL, HSY, IGR, JHX, JXN, LAND, LHX, LMAT, LTC, MCHP, MGA, MGPI, MGU, MIXT, MMM, MOG.A, MOG.B, NMRK, OBNK, OTIS, PKOH, RPRX, RS, RTX, SGC, SHW, SNA, SWCH, TEL, THQ, THW, UMPQ, USA, USLM, WAL, WD, WHR, WING, ZWS\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.939%)\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 8-Week Bill Auction (previous: 0.060%)\n    - Continuing Jobless Claims (consensus: 2,120K, previous: 2,160K)\n    - Continuing Jobless Claims (previous: 2,160K)\n    - Initial Jobless Claims (consensus: 260K, previous: 267K)\n    - Initial Jobless Claims (previous: 267K)\n    - Jobless Claims 4-Week Avg. (previous: 278.00K)\n    - Jobless Claims 4-Week Avg. (previous: 278.00K)\n    - KC Fed Composite Index (previous: 31)\n    - KC Fed Manufacturing Index (previous: 25)\n    - Natural Gas Storage (previous: 7B)\n    - Philadelphia Fed Manufacturing Index (consensus: 24.0, previous: 23.8)\n    - Philly Fed Business Conditions (previous: 24.2)\n    - Philly Fed CAPEX Index (previous: 32.40)\n    - Philly Fed Employment (previous: 30.7)\n    - Philly Fed New Orders (previous: 30.8)\n    - Philly Fed Prices Paid (previous: 70.30)\n    - US Leading Index (previous: 0.2%)\n\n## Upcoming events for Friday, November 19th\n\n - Expected earnings:\n\n  ADIL, AENZ, AGBA, AIHS, AIM, BKE, CCNC, CIG, CJJD, CNET, CNNB, DTSS, DUO, DXLG, DXPE, ENIC, ENLV, EXN, FL, FSEA, GOTU, HIBB, IIAC, LI, LVRA, MMX, MOXC, OFED, PFSW, PLAG, PVL, QNRX, RBCN, RKTA, RLX, SFUN, SINO, SMFG, SY, TKAT, TOUR, TPGS, TPHS, UK, UNAM, VBFC, VPCB, WVFC, YI\n\n - Ex-div:\n\n  ADX, AEIS, AFT, AIF, ALSN, AOMR, ARDC, BGB, BGX, BSL, BWG, CDRE, CEM, CRD.A, CRD.B, CTR, DFP, DLX, DMO, DX, EHI, EMD, EMO, FFC, FHB, FLC, GDO, GHLD, GSL, HIO, HIX, HNI, HVT, HVT.A, HYI, IGI, JRSH, MMU, MSBI, NATH, NCMI, NKSH, NLOK, OGN, OWL, PAAS, PEO, PFD, PRI, R, RDN, SBI, SPB, TIPT, TKR, TSCO, UIHC, UPS, WDI, WEA, WIA, WIW, WPM\n\n - Economic events and announcements:\n\n    - Building Permits (previous: -7.8%)\n    - FOMC Member Clarida Speaks\n    - Fed Waller Speaks\n    - U.S. Baker Hughes Oil Rig Count (previous: 450)\n    - U.S. Baker Hughes Total Rig Count (previous: 550)\n\n^^^^2021-11-17",
        "created_utc": 1637146813,
        "id": "hkz30yt",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1637175613.0
    },
    {
        "author": "TeenageDirtbagBaby",
        "body": "Jim Cramer's Charitable Trust Portfolio holdings\n\nAbbott Labs (ABT)\nAdvanced Micro Devices (AMD)\nAlphabet (GOOGL)\nAmazon (AMZN)\nAmerican Eagle Outfitters (AEO)\nApple (AAPL)\nBoeing (BA)\nBroadcom (AVGO)\nCisco Systems (CSCO)\nCostco (COST)\nDisney (DIS)\nDuPont (DD)\nEli Lilly (LLY)\nEstee Lauder (EL)\nFord (F)\nHoneywell (HON)\nLinde (LIN)\nMarvell Technology (MRVL)\nMastercard (MA)\nMeta Platforms (FB)\nMicrosoft (MSFT)\nMorgan Stanley (MS)\nNortonLifeLock(NLOK)\nNucor (NUE)\nNvidia (NVDA)\nPayPal (PYPL)\nSalesforce (CRM)\nUnion Pacific (UNP)\nUnited Parcel Service (UPS)\nWalmart (WMT)\nWells Fargo (WFC)\nWynn Resorts (WYNN)\n\nNote: This table will be updated as the trust makes changes to its portfolio.",
        "created_utc": 1635966988,
        "id": "hj6qcpv",
        "score": 1,
        "subreddit": "investing",
        "created": 1635995788.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the 19th of November\n\n\n\n## Upcoming events for Friday, November 19th\n\n - Expected earnings:\n\n  ADIL, AENZ, BKE, CCNC, CIG, CJJD, DUO, DXPE, ENIC, ENLV, FL, GOTU, LVRA, MOXC, PFSW, QNRX, RKTA, RLX, SFUN, SY, TKAT, TOUR, TPGS, UK, UNAM, WVFC, YI\n\n - Ex-div:\n\n  AATC, ADX, AEIS, AFT, AIF, ALSN, AOMR, ARDC, BGB, BGX, BSL, BWG, CDRE, CEM, CRD.A, CRD.B, CTR, DFP, DLX, DMO, DX, EHI, EMD, EMO, FFC, FHB, FLC, GDO, GHLD, GSL, HIO, HIX, HNI, HVT, HVT.A, HYI, IGI, JRSH, MMU, MSBI, NATH, NCMI, NKSH, NLOK, OGN, OWL, PAAS, PEO, PFD, PRI, R, RDN, SBI, SPB, TIPT, TKR, TSCO, UIHC, UPS, WDI, WEA, WIA, WIW, WPM\n\n - Economic events and announcements:\n\n    - Building Permits (previous: -7.8%)\n    - CFTC Aluminium speculative net positions (previous: 4.0K)\n    - CFTC Copper speculative net positions (previous: 22.8K)\n    - CFTC Corn speculative net positions (previous: 375.3K)\n    - CFTC Crude Oil speculative net positions (previous: 421.3K)\n    - CFTC Gold speculative net positions (previous: 250.2K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 16.2K)\n    - CFTC Natural Gas speculative net positions (previous: -142.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 97.6K)\n    - CFTC Silver speculative net positions (previous: 36.9K)\n    - CFTC Soybeans speculative net positions (previous: 27.6K)\n    - CFTC Wheat speculative net positions (previous: 19.2K)\n    - FOMC Member Clarida Speaks\n    - Fed Waller Speaks\n    - U.S. Baker Hughes Oil Rig Count (previous: 450)\n    - U.S. Baker Hughes Total Rig Count (previous: 550)\n\n## Upcoming events for Monday, November 22nd\n\n - Expected earnings:\n\n  A, ADMP, AEI, AFYA, AHPI, ANAT, ARWR, ATNF, AVAL, AVCO, AVYA, BBIG, BRTX, BSFC, CANG, CARV, CENT, CENTA, CHAA, COE, CREG, CRNC, CTIB, CUEN, DLPN, DSS, ELYS, ENTA, ENVB, FEDU, FFHL, FNA, FRD, FTFT, GAME, GNSS, GOBI, HEPA, IBEX, JAN, JP, KEYS, KFY, KMDA, LIZI, LMFA, LWLG, METX, MLVF, MPAC, MSN, MTR, MULN, NES, NIU, NM, NUZE, ONE, QIPT, SINT, SJ, SR, TNP, TUYA, TWST, UCL, URBN, UUU, VVPR, ZH, ZM\n\n - Ex-div:\n\n  B, BC, BGCP, EFR, EFT, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EURN, EVG, EVT, EXD, EXG, FGB, FLMN, FMN, GER, GPRK, HE, HEES, HFRO, HGLB, HIE, HP, IGT, ITUB, JNJ, MCO, MFD, NDP, NTG, NXDT, PHX, PIPR, PPT, PRU, STE, SWKS, TPZ, TS, TTP, TYG, VTRS, WLK, WMG, XYL\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.481%)\n    - 3-Month Bill Auction (previous: 0.045%)\n    - 5-Year Note Auction (previous: 1.157%)\n    - 6-Month Bill Auction (previous: 0.065%)\n    - Chicago Fed National Activity (previous: -0.13)\n    - Existing Home Sales (consensus: 6.20M, previous: 6.29M)\n    - Existing Home Sales (previous: 7.0%)\n\n^^^^2021-11-19",
        "created_utc": 1637319613,
        "id": "hl8ouyz",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1637348413.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 18th of November\n\n\n\n## Upcoming events for Thursday, November 18th\n\n - Expected earnings:\n\n  AMAT, AMSWA, ATHM, ATKR, AZEK, BABA, BECN, BEPC, BERY, BHTG, BJ, BLRX, BRBR, BRC, BSGM, BTCM, CAL, CALT, CATO, CRON, CSIQ, DADA, DLA, DLNG, DPW, EAR, EBR, EBR.B, ELP, ESE, EVO, FCUV, FINV, FONR, FRSX, FTCH, GAMB, GEOS, GLOB, GNPX, GOGL, GRFS, GROW, GWGH, HAYN, HMLP, HOLI, HRT, HUIZ, IBRX, INTU, JCTCF, JD, JOBS, KNOP, KSS, LEDS, LXEH, M, MATW, MESO, MMS, MNSO, MTL, NCNA, NEW, NGVC, NJR, NUAN, NVGS, OCFT, ONEW, PANW, PAX, PLCE, POST, PTLO, RAAS, RDHL, REDU, RMAX, ROST, SID, SOLY, TAL, UGI, VIAO, VIPS, VNET, WDAY, WOOF, WSM, WWD, XCUR, YMM, YSG, YTRA, ZIVO\n\n - Ex-div:\n\n  ACP, AGD, AMAL, AMSWA, AOD, APO, ASGI, AVA, AWP, BBSI, BBWI, BGH, BWXT, CBFV, CCOI, CFFN, CGAU, CGNX, CMI, CTSH, CUBA, DAC, DEX, EVRG, F, FDBC, FSS, GAIN, GLAD, GOOD, GSK, HCI, HCSG, HL, HSY, IGR, JHX, JXN, LAND, LHX, LMAT, LTC, MCHP, MGA, MGPI, MGU, MIXT, MMM, MOG.A, MOG.B, NMRK, OBNK, OTIS, PKOH, RPRX, RS, RTX, SGC, SHW, SNA, SWCH, TEL, THQ, THW, UMPQ, USA, USLM, WAL, WD, WHR, WING, ZWS\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.939%)\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 8-Week Bill Auction (previous: 0.060%)\n    - Chicago Fed President Evans Speaks\n    - Continuing Jobless Claims (consensus: 2,120K, previous: 2,160K)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Daly Speaks\n    - FOMC Member Williams Speaks\n    - Initial Jobless Claims (consensus: 260K, previous: 267K)\n    - Jobless Claims 4-Week Avg. (previous: 278.00K)\n    - KC Fed Composite Index (previous: 31)\n    - KC Fed Manufacturing Index (previous: 25)\n    - Natural Gas Storage (consensus: 25B, previous: 7B)\n    - Philadelphia Fed Manufacturing Index (consensus: 24.0, previous: 23.8)\n    - Philly Fed Business Conditions (previous: 24.2)\n    - Philly Fed CAPEX Index (previous: 32.40)\n    - Philly Fed Employment (previous: 30.7)\n    - Philly Fed New Orders (previous: 30.8)\n    - Philly Fed Prices Paid (previous: 70.30)\n    - US Leading Index (previous: 0.2%)\n\n## Upcoming events for Friday, November 19th\n\n - Expected earnings:\n\n  ADIL, AENZ, AGBA, BKE, CCNC, CIG, CJJD, DUO, DXLG, DXPE, ENIC, ENLV, FL, GOTU, IIAC, LI, LVRA, MOXC, PFSW, QNRX, RKTA, RLX, SFUN, SY, TKAT, TOUR, TPGS, UK, UNAM, WVFC, YI\n\n - Ex-div:\n\n  AATC, ADX, AEIS, AFT, AIF, ALSN, AOMR, ARDC, BGB, BGX, BSL, BWG, CDRE, CEM, CRD.A, CRD.B, CTR, DFP, DLX, DMO, DX, EHI, EMD, EMO, FFC, FHB, FLC, GDO, GHLD, GSL, HIO, HIX, HNI, HVT, HVT.A, HYI, IGI, JRSH, MMU, MSBI, NATH, NCMI, NKSH, NLOK, OGN, OWL, PAAS, PEO, PFD, PRI, R, RDN, SBI, SPB, TIPT, TKR, TSCO, UIHC, UPS, WDI, WEA, WIA, WIW, WPM\n\n - Economic events and announcements:\n\n    - Building Permits (previous: -7.8%)\n    - FOMC Member Clarida Speaks\n    - Fed Waller Speaks\n    - U.S. Baker Hughes Oil Rig Count (previous: 450)\n    - U.S. Baker Hughes Total Rig Count (previous: 550)\n\n^^^^2021-11-18",
        "created_utc": 1637233211,
        "id": "hl3v4e6",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1637262011.0
    },
    {
        "author": "Badgerisbest",
        "body": "Norton is basically bargain bin shovelware sold to boomers.",
        "created_utc": 1638028300,
        "id": "hma96qc",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638057100.0
    },
    {
        "author": "MicroChapLong",
        "body": "Norton lifelock sells consumer cyber security. It will grow as people continue to buy consumer cyber security solutions. They are one of two only games in town for this solution. They used to be in the penalty box for terrible execution but now have solid new management as evidenced by recent performance of double digit rev growth from low single digits. They divested a major piece of the biz to avgo so now it’s consumer pure play. I can go on and on. Tell me what you need",
        "created_utc": 1636142513,
        "id": "hjgj3c9",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1636171313.0
    },
    {
        "author": "MicroChapLong",
        "body": "They sold Symantec to avgo so you aren’t looking at PF. This is a turnaround story that just started a few quarters ago. It’s a double digit revenue grower now and will be $45+ within 3-5 years based on forward eps target which is high probability to achieve",
        "created_utc": 1636154725,
        "id": "hjhecnj",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1636183525.0
    },
    {
        "author": "FlyWannaBeRichGuy",
        "body": "Got email about data breach from Norton on them.",
        "created_utc": 1636557126,
        "id": "hk2qmzd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636585926.0
    },
    {
        "author": "theCramps",
        "body": "Edward Norton will always be American History X, “bite the curb” or Fight Club “I am Jacks Complete Lack of Surprise”",
        "created_utc": 1636858740,
        "id": "hkjemzg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636887540.0
    },
    {
        "author": "actualchino",
        "body": "Bro, based on the tests in the link you gave above show that Crowdstrike is well below others like Microsoft, Symantec, and McAffe when it comes to endpoint protection. \n\nI'm starting to suspect you're a shill and that \"study\" was BS. \n\nAlso, the article praises Symantec for their protection during the Solar Winds hack. Guess who else's clients weren't hacked during Solar Winds? Blackberry's.",
        "created_utc": 1637825934,
        "id": "hm0dzyu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637854734.0
    },
    {
        "author": "wildup",
        "body": "Snps, asml, amd, NVDA",
        "created_utc": 1635799562,
        "id": "hixg6t9",
        "score": 2,
        "subreddit": "investing",
        "created": 1635828362.0
    },
    {
        "author": "Bigman554",
        "body": "So when you’re SNPS tanks 20% in a period of a month. Are you buying more or waiting till it goes back up to buy?",
        "created_utc": 1636724576,
        "id": "hkbxle6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636753376.0
    },
    {
        "author": "bearcat2202",
        "body": "TWLO, they’re changing the way communications works. \nSNPS, their software helps chip makers innovate",
        "created_utc": 1636031278,
        "id": "hj9ztcz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636060078.0
    },
    {
        "author": "bearcat2202",
        "body": "What about $50B market cap with continued growth or earnings growth like TWLO or SNPS?",
        "created_utc": 1635854405,
        "id": "hj01wlr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635883205.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  2nd of November\n\n\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ES, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCN, OKE, OMCL, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACNB, ACRE, ACRS, ADPT, AEE, AEMD, AFIN, AGIO, ALB, ALG, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CBD, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRSP, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FBRT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FPH, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IIPR, IMXI, INFN, INMB, INN, INOV, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, JMP, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LXRX, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NSR, NUS, NVST, NYT, OAS, OCDX, ODP, ODT, OLP, OM, OMI, OMP, ONCS, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PSN, PTC, PTGX, PTVE, PW, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RRD, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SB, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPOK, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STGW, STLA, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UEC, UGP, UHAL, UMH, UPLD, UTHR, UVV, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (consensus: 1.567M, previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -1.533M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.200M, previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.0, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n\n^^^^2021-11-02",
        "created_utc": 1635847213,
        "id": "hizs3wm",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635876013.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  2nd of November\n\n\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ES, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCN, OKE, OMCL, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACNB, ACRE, ACRS, ADPT, AEE, AEMD, AFIN, AGIO, ALB, ALG, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CBD, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRSP, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FBRT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FPH, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IIPR, IMXI, INFN, INMB, INN, INOV, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, JMP, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LXRX, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NSR, NUS, NVST, NYT, OAS, OCDX, ODP, ODT, OLP, OM, OMI, OMP, ONCS, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PSN, PTC, PTGX, PTVE, PW, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RRD, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SB, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPOK, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STGW, STLA, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UEC, UGP, UHAL, UMH, UPLD, UTHR, UVV, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (consensus: 1.567M, previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -1.533M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.200M, previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.0, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n\n^^^^2021-11-02",
        "created_utc": 1635847213,
        "id": "hizs3wm",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635876013.0
    },
    {
        "author": "half-spin",
        "body": "afaik in the EU fees are capped by law at 0.3%. Apparently after brexit visa increased that to 1.5%.",
        "created_utc": 1637156369,
        "id": "hkzi4ud",
        "score": 698,
        "subreddit": "stocks",
        "created": 1637185169.0
    },
    {
        "author": "DoctorOzface",
        "body": "\"You get up 2 and a half million dollars, any asshole in the world knows what you do...\"\n\nhttps://youtube.com/watch?v=xdfeXqHFmPI",
        "created_utc": 1637160650,
        "id": "hkzra0e",
        "score": 535,
        "subreddit": "wallstreetbets",
        "created": 1637189450.0
    },
    {
        "author": "ElonPhoneHome",
        "body": "RIP. V shaped recovery for Monday confirmed. Pandemic canceled. Jpow is a serial gay bear killer.",
        "created_utc": 1637952939,
        "id": "hm6n1pm",
        "score": 421,
        "subreddit": "wallstreetbets",
        "created": 1637981739.0
    },
    {
        "author": "DonutPed",
        "body": "&gt;online retail giant blamed the decision on high fees charged by Visa to process transactions.\n\nWhy is that a UK specific problem?",
        "created_utc": 1637156090,
        "id": "hkzhl80",
        "score": 394,
        "subreddit": "stocks",
        "created": 1637184890.0
    },
    {
        "author": "aviatordube",
        "body": "amazon stopped using Visa credit cards in UK",
        "created_utc": 1637161875,
        "id": "hkzu3os",
        "score": 360,
        "subreddit": "StockMarket",
        "created": 1637190675.0
    },
    {
        "author": "stippleworth",
        "body": "Looks like my comment got removed because I mentioned the C word so reposting it.  This is from the comment I left in r/investing:\n\nThis might not even be purchased accounts, so much as a 3-10 month long con by a handful of people, or a group paid to do some sort of agenda.  The overlap in subreddits that the accounts first commented in is too similar.\n\nThese accounts are almost entirely commenting on each others' posts, like literally any post they comment on appears to be part of the group.  Here is a list of accounts I have found in less than an hour of looking:\n\nu/Royal_Instance_4779, u/HistoricallyMeans, u/Ok-Constant8181, u/BuenaSmaily, u/SusanaChavarin, u/ConsciousInsects, u/badgereatingchips, u/HistoricallyMeans, u/CliffWoolum, u/GrantleyCarson, u/CarliEly, u/OkPerception8936, u/Actual-Marionberry57, u/SabineCoppin, u/PetraHembree, u/PetraHembree, u/JennyMickle, u/BarTraditional6305, u/MargueriteFenton, u/AshlyVogel, u/SondraDemaio, u/KatheKnuth, u/GlindaJorgenson, u/lingerersteles53, u/MikaelaShurtleffy, u/CaroylnCarmichael, u/amphorasnotionsw1, u/JacalynBerryman, u/CandyLouie24, u/ComprehensiveShip96, u/ComprehensiveShip96, u/AkenHoma, u/FelicitaNeedham, u/TennieBaudoin, u/TennieBaudoin, u/MarkEsper, u/Agapele36124, u/scablime, u/LavonaRaybon, u/GypsyHedley, u/LegitimateFigr, u/ChuRunyon, u/akhalwhocannotride, u/Rist-Online, u/AbbieDuval, u/irokrvulsantv5, u/JillianWhipple, u/Opposite_Party_5282, u/VivianaLuther, u/GertrudKirksey, u/TessaRozier, u/Educational-Tone-953, u/Alarmed_Ad6556, u/Early-Spot378, u/BulahShipman, u/CompetitiveGuider, u/JeanneAlter2, u/CeraunHgo, u/Aggravating_Fix_2898, u/AgnusGryder, u/IncreaseNo7739, u/Cool-Statement-6959, u/ncepiloper, u/CyndiRhyne, u/passpelly, u/NarcisaYazzie, u/ElfriedeLantermany, u/Asleep_Toe6177, u/RemediosGerhardt, u/Low_Profession_4407, u/EusebiaLubbersy, u/Choice-Many-9550, u/OnoctORE, u/Few_Fox_9491, u/ncepiloper, u/Grouchy_Dimension_55, u/Low-Ear4034, u/Choice-Many-9550, u/Scared-Soup-4550, u/ChingBlue, u/ElyseAburto, u/KaronSabin, u/ClaraPaules, u/InternalVersionr, u/ProfessionalHornet54, u/InterestingsBed, u/DecentSounds, u/KeithaSteuck, u/JonDyna965, u/NoProfessionalist, u/ImaginaryAirr, u/ArtisticShallot7754, u/NobukoFaw, u/JoblessJessica, u/redbate (possibly), u/LedditBe_2025 (possibly), u/PerisBensons (possibly), u/CryptoMeat3 (possibly), u/Royal_Instance_4779 (possibly), u/Optimal_Inspector_13 (possibly), u/KiyokoCajigas (suspended), u/YelenaOneal (suspended), u/GeorgianneRossetti (suspended), u/Zuppamaz1 (suspended), u/Adjacts444 (suspended), u/NoelQuintana (this one has no pumping comments yet, but has the crossposting with the above accounts in nextfuckinglevel.  This is perhaps a dormant account waiting to be used), u/ilfredLipford (same as prior)\n\nTake any name on this list, go to their comments, and copy the name of the OP of a post they comment in.  Come back to this list, CTRL F + CTRL V that name and you will find it almost every time.\n\nIt is much more engrained in digital coins than mining.  This is a very, very large coordinated effort and hard to believe it's from only one person due to the number of accounts.  My list is not comprehensive.  It really strikes me as multiple people's full time jobs.  It's not just the investing subreddits.  They are commenting on each others' posts in all sorts of subreddits:  parenting, sports, music, relationships, defaults, presumably in an attempt to disguise the accounts as more natural.",
        "created_utc": 1637359652,
        "id": "hlb8ob4",
        "score": 270,
        "subreddit": "stocks",
        "created": 1637388452.0
    },
    {
        "author": "HiMyNamesEvan",
        "body": "V, Dis, PYPL",
        "created_utc": 1637764298,
        "id": "hlwjvcb",
        "score": 234,
        "subreddit": "stocks",
        "created": 1637793098.0
    },
    {
        "author": "OmicronNine",
        "body": "OP will be saved by the power of\n\n&amp;nbsp;\n\n✋✨🌈&amp;nbsp;P&amp;nbsp;O&amp;nbsp;S&amp;nbsp;I&amp;nbsp;T&amp;nbsp;I&amp;nbsp;V&amp;nbsp;E&amp;nbsp;&amp;nbsp;T&amp;nbsp;H&amp;nbsp;I&amp;nbsp;N&amp;nbsp;K&amp;nbsp;I&amp;nbsp;N&amp;nbsp;G&amp;nbsp;!&amp;nbsp;🌈✨🤚\n\n&amp;nbsp;",
        "created_utc": 1635896642,
        "id": "hj2vpye",
        "score": 211,
        "subreddit": "wallstreetbets",
        "created": 1635925442.0
    },
    {
        "author": "m0nk_3y_gw",
        "body": "disclaimer: i'm a TSLA bull\n\nRivian is too high, but they have a production line, in the Mitsubishi factory in IL they bought years ago.\n\nLogistics?  Looks like they built a fleet-management system to win Amazon's love and $$$   https://rivian.com/fleet\n\nYou didn't mention charging network -- looks like they are building their own too.\n\nTruck looks much more fun than the Tesla CyberTruck https://www.youtube.com/watch?v=A1uYhkMRLWg - hopefully Tesla comes up with more body designs/options as they build out.\n\nI'm not shorting, but I might buy if it comes back to earth.",
        "created_utc": 1636866850,
        "id": "hkjvbkx",
        "score": 191,
        "subreddit": "wallstreetbets",
        "created": 1636895650.0
    },
    {
        "author": "sensiblyopinionated",
        "body": "\"The online retailer said costs should be going down over time due to   \nadvances in technology, \"but instead they continue to stay high or even   \nrise\".\"\n\nA valid argument. At the end of the article it also says there is a reward system that is powered by Mastercard. So it is more that they decided to strengthen the partnership with Mastercard.\n\nVisa Debit will still be accepted. At any rate, this sucks for Visa investors.\n\nhttps://www.bbc.com/news/business-59306200",
        "created_utc": 1637156997,
        "id": "hkzje97",
        "score": 177,
        "subreddit": "stocks",
        "created": 1637185797.0
    },
    {
        "author": "khalidzuzu",
        "body": "$V",
        "created_utc": 1636905111,
        "id": "hklky18",
        "score": 139,
        "subreddit": "stocks",
        "created": 1636933911.0
    },
    {
        "author": "Lebron_Jameson",
        "body": "I seriously started my Visa position yesterday, sorry guys",
        "created_utc": 1637159941,
        "id": "hkzpnfw",
        "score": 137,
        "subreddit": "stocks",
        "created": 1637188741.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "It sounds like they already did, they expired in June and July 2021.\n\n&gt;Tesla's share price rose approximately 10-fold by the time the warrants   \nexpired, and JPMorgan said this required Tesla under its contract to   \ndeliver shares of its stock or cash. The bank said Tesla's failure to do  \n that amounted to a default.\n\n[https://www.documentcloud.org/documents/21108386-jpm-v-tesla-complaint](https://www.documentcloud.org/documents/21108386-jpm-v-tesla-complaint)\n\nTSLA agreed to make JP Morgan the Calculating Agent, and they seem to have to accept their calculation since nobody knew that Musk wasn't serious, and so they recalculated in good faith.\n\nIt's actually not even entirely clear if he was joking, or if the deal fell apart when he announced it without coordination.\n\nWhat can Musk say, \"They should have known I was just high?\" Nobody knew for sure.",
        "created_utc": 1637038680,
        "id": "hktfnq0",
        "score": 133,
        "subreddit": "StockMarket",
        "created": 1637067480.0
    },
    {
        "author": "gainlong",
        "body": "It's a great defense contractor stock. They make some of the best airplane and helo engines in the world. They outfit numerous militaries around the world. They also have a lot of \"contract work\", ie; RYCEY sells engines to the US Military for the V-22 Osprey and then has the contracts to do all of the repairs. If you dig more into what they do and have planned, you'll see that they're highly undervalued for a defense contractor.",
        "created_utc": 1637030300,
        "id": "hksyfw8",
        "score": 128,
        "subreddit": "pennystocks",
        "created": 1637059100.0
    },
    {
        "author": "Bsdave103",
        "body": "I think Visa is the biggest winner here.  The charts look great.  The earnings look great.  The fundamentals look great.  The average price target is $277.  I loaded up at 197$ and I feel great about it.",
        "created_utc": 1637768408,
        "id": "hlwti1v",
        "score": 125,
        "subreddit": "stocks",
        "created": 1637797208.0
    },
    {
        "author": "justlooking9889",
        "body": "For those unfamiliar with the reference: https://m.youtube.com/watch?v=d0mTs76iEjM",
        "created_utc": 1636599843,
        "id": "hk5n6gt",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1636628643.0
    },
    {
        "author": "thelwarner",
        "body": "Either [this](https://www.youtube.com/watch?v=oiI58gBKHo0) or [this](https://www.youtube.com/watch?v=qpnwZJ5CyKU) will be OP's future. I too would like an update on this.",
        "created_utc": 1637966094,
        "id": "hm7f56e",
        "score": 123,
        "subreddit": "wallstreetbets",
        "created": 1637994894.0
    },
    {
        "author": "thesaucewalker",
        "body": "Still trading flat nearly 40 years later. The V recovery never came ❤️‍🩹",
        "created_utc": 1637718661,
        "id": "hluhxye",
        "score": 117,
        "subreddit": "wallstreetbets",
        "created": 1637747461.0
    },
    {
        "author": "R4N7",
        "body": "Not just paypal, many big players in payment sector: V, MA, GPN, FISV",
        "created_utc": 1637338514,
        "id": "hl9pqna",
        "score": 107,
        "subreddit": "stocks",
        "created": 1637367314.0
    },
    {
        "author": "HurtsFlyerin21",
        "body": "This right here.  I manage all my own funds.  My wife is a trust fund baby.  Her family wealth is basically distributed like a vanguard allocation survey.  She's young and they have her in a bunch of aggressive total stock funds with a few fliers on industry specific stuff.\n\nHowever its the managing of a trust, wealth, taxes, movement of money, marriages, etc. that they handle.\n\nI have a decent job and the only pandemic relief I got was a $120 visa gift card.  She got every single stimulus because they handle her income distribution and only distribute what she needs for bills (she's charitable and donated all of it plus more to some local shelters).  She is a light spender so in the eyes of Uncle Sam she only made like $20K last year. \n\nThey also advise us on taxes and things to even assist my personal wealth building, such as what income point filing jointly or separately provides a net benefit to our marriage.",
        "created_utc": 1637089008,
        "id": "hkvy7zs",
        "score": 104,
        "subreddit": "investing",
        "created": 1637117808.0
    },
    {
        "author": "randomafricanboi",
        "body": "Dont sell after a couple of bad months, Visa isnt a small risky company that you expect to grow a lot short term. If you sell now you will just lose money, Visa will inevitably recover and you will be sad again. \n\nBull markets wont last forever, sometimes we gotta learn to stomach the red for a while.",
        "created_utc": 1635869701,
        "id": "hj0z6hp",
        "score": 99,
        "subreddit": "stocks",
        "created": 1635898501.0
    },
    {
        "author": "JN324",
        "body": "The European market generally is a Visa/MasterCard duopoly, with a smidge of Amex, Britain is no different.",
        "created_utc": 1637157852,
        "id": "hkzl5x4",
        "score": 98,
        "subreddit": "stocks",
        "created": 1637186652.0
    },
    {
        "author": "Beetlejuice_hero",
        "body": "So much of \"investing\" is just going along for the ride.\n\nThe American economy has grown by leaps &amp; bounds since its inception, and especially in the preceding few decades.  \n\nThe money needs to go somewhere.\n\nThe stock market generally speaking offers the highest possible returns (with very occasional exceptions).\n\nThe Fed has incentivized its meteoric rise - especially in recent years - with rock bottom interest rates.  \n\nCongress similarly incentivizes its meteoric rise with preferential tax policy.  \n\nConsequently: that's where a massive portion of the money goes, and share prices rise.  A lot.\n\nSo we just go along for the ride, explicit &amp; deliberate \"value\" assessment be damned.  \n\nRemember Buffett - who had forever preached \"I only invest in what I know\" leading him to famously avoid tech - was just all of a sudden \"oh hey I'm making Apple by far my largest holding\"?\n\nApple is obviously an absurd cash machine and deserves a massive valuation, but is there any real reason it should be \"worth\" 2.6T instead of, say, 1.8T?\n\nNo.  But that's where the market movers have gone, so just join the ride there or wherever and make money alongside them.\n\n[This pretty much sums my entire point in video form](https://www.youtube.com/watch?v=xbBD7VIJ4cc&amp;t=48s).",
        "created_utc": 1637335841,
        "id": "hl9j3wt",
        "score": 91,
        "subreddit": "stocks",
        "created": 1637364641.0
    },
    {
        "author": "datcommentator",
        "body": "Anything payment is getting smacked -- PYPL, SQ, MA, V, AFRM.",
        "created_utc": 1637601805,
        "id": "hlnsciz",
        "score": 91,
        "subreddit": "stocks",
        "created": 1637630605.0
    },
    {
        "author": "ScrubtasticElastic",
        "body": "I bought 1 share of Visa yesterday during its dip to $212, not sure I can ever recover financially",
        "created_utc": 1637170591,
        "id": "hl0fyw5",
        "score": 83,
        "subreddit": "investing",
        "created": 1637199391.0
    },
    {
        "author": "Rico_Stonks",
        "body": "If 2022’s predictions are anything like the 2021’s predictions, it’s mostly going to be a list of the stocks r/stocks is bag holding: BABA, PLTR, V, PYPL, DKNG, TDOC, PINS",
        "created_utc": 1637864769,
        "id": "hm28m8e",
        "score": 83,
        "subreddit": "stocks",
        "created": 1637893569.0
    },
    {
        "author": "mr_Dennis1",
        "body": "Eyeing V and DIS",
        "created_utc": 1637699943,
        "id": "hltaqkw",
        "score": 79,
        "subreddit": "stocks",
        "created": 1637728743.0
    },
    {
        "author": "Pb2Au",
        "body": "[\"The perfect time to own Zillow, the Amazon of housing\"](https://www.youtube.com/watch?v=9HaiHI96Vx8) \\- Jim Cramer, February 2021",
        "created_utc": 1635968702,
        "id": "hj6urwv",
        "score": 78,
        "subreddit": "stocks",
        "created": 1635997502.0
    },
    {
        "author": "lordinov",
        "body": "#V",
        "created_utc": 1636116053,
        "id": "hjep2rm",
        "score": 75,
        "subreddit": "stocks",
        "created": 1636144853.0
    },
    {
        "author": "n0lefin",
        "body": "Bought Visa a couple months back when it \"dipped\" to 225 or so just as a place to park some cash... cannot fucking believe I'm holding a fucking Visa bag right now...",
        "created_utc": 1637158574,
        "id": "hkzmokq",
        "score": 74,
        "subreddit": "stocks",
        "created": 1637187374.0
    },
    {
        "author": "The_Number_12",
        "body": "buy $V at $220 I said, it'll be a good idea...\n\nyikes.",
        "created_utc": 1637163426,
        "id": "hkzxugo",
        "score": 73,
        "subreddit": "StockMarket",
        "created": 1637192226.0
    },
    {
        "author": "Puzzled_Raccoon8169",
        "body": "Fun story, the average fees in the us to accept visa and MasterCard are 3-5% and more. It’s why Square turned into a viable option for small businesses at 2.5%",
        "created_utc": 1637166943,
        "id": "hl06lwd",
        "score": 71,
        "subreddit": "stocks",
        "created": 1637195743.0
    },
    {
        "author": "Eslooie",
        "body": "Visa should just decline all transactions in the 4 blocks around wall street until it's back above 200.",
        "created_utc": 1637666803,
        "id": "hlr8okl",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1637695603.0
    },
    {
        "author": "Both-Ad-7757",
        "body": "I have no doubt in visa financially, but I can’t justify buying it at a 30+ P/E. They’re a mature company and I anticipate a stagnation in growth moving into the future. I think it’s still overpriced with a fair value of ~25 P/E / $140/share.",
        "created_utc": 1637719459,
        "id": "hlujn8s",
        "score": 69,
        "subreddit": "ValueInvesting",
        "created": 1637748259.0
    },
    {
        "author": "leo_99",
        "body": "This makes me feel better about my investment in Visa and MasterCard 🥲 I’ve been doing my due diligence with stock picks but it seems like that’s not what this “bull market” is favoring",
        "created_utc": 1637605848,
        "id": "hlo2mut",
        "score": 69,
        "subreddit": "StockMarket",
        "created": 1637634648.0
    },
    {
        "author": "-Calcifer_",
        "body": "Also applied surcharge in Australia when paying with Visa.",
        "created_utc": 1637163219,
        "id": "hkzxc28",
        "score": 68,
        "subreddit": "StockMarket",
        "created": 1637192019.0
    },
    {
        "author": "MordantBengal",
        "body": "Visa, they aren't going anywhere",
        "created_utc": 1636770266,
        "id": "hket1us",
        "score": 66,
        "subreddit": "stocks",
        "created": 1636799066.0
    },
    {
        "author": "Crime_Dawg",
        "body": "https://www.youtube.com/watch?v=C-m3RtoguAQ",
        "created_utc": 1635888616,
        "id": "hj2bti4",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1635917416.0
    },
    {
        "author": "XWarriorYZ",
        "body": "Apparently Visa is also a tech gamble lmao",
        "created_utc": 1637733270,
        "id": "hlvagfb",
        "score": 64,
        "subreddit": "investing",
        "created": 1637762070.0
    },
    {
        "author": "Nickstockman77",
        "body": "High level of competition  in this space. I own shares and will hold till recovery. I also own visa that is underperforming the broader market.\n\nCould the rise of crypto and payments aspect there be having an impact? What's Square's share price doing?",
        "created_utc": 1636797518,
        "id": "hkfxihe",
        "score": 63,
        "subreddit": "stocks",
        "created": 1636826318.0
    },
    {
        "author": "stick_shift95",
        "body": "PayPal and Visa",
        "created_utc": 1637772370,
        "id": "hlx3dw7",
        "score": 62,
        "subreddit": "stocks",
        "created": 1637801170.0
    },
    {
        "author": "nightknight-01",
        "body": "I was today years old when I realised why V(5) O(0) O(0) is the ticker for Vanguard S&amp;P500 ETF...",
        "created_utc": 1635848170,
        "id": "hizt90k",
        "score": 60,
        "subreddit": "stocks",
        "created": 1635876970.0
    },
    {
        "author": "hardgeeklife",
        "body": "Still waiting for the retail release of the long-rumored [Funcooker](https://www.youtube.com/watch?v=2Okmzhg-UgQ)",
        "created_utc": 1636478633,
        "id": "hjyiarn",
        "score": 59,
        "subreddit": "investing",
        "created": 1636507433.0
    },
    {
        "author": "Hour_Amphibian1844",
        "body": "Visa has no ideas on how to grow the business other than increasing fees and buying fintech startups.",
        "created_utc": 1637164026,
        "id": "hkzzb6q",
        "score": 56,
        "subreddit": "stocks",
        "created": 1637192826.0
    },
    {
        "author": "make_love_to_potato",
        "body": "[This is how you create a self sustaining economy.](https://www.youtube.com/watch?v=YAKOWcs8w54)",
        "created_utc": 1637507850,
        "id": "hlimh5o",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1637536650.0
    },
    {
        "author": "Sportfreunde",
        "body": "We need immigrants, do we need 400k+ immigrants without the matching infrastructure? That to me is the problem, no planning between provincial and federal. \n\nOr in cities with huge numbers of students on Visa and the college not providing housing so they're overstuffed in basements.",
        "created_utc": 1637793609,
        "id": "hlyl811",
        "score": 55,
        "subreddit": "CanadianInvestor",
        "created": 1637822409.0
    },
    {
        "author": "nobjos",
        "body": "Hey Guys,\n\nIt's u/nobjos back with this week's analysis. This is by far the most data-intensive analysis I have done. Hopefully, you guys can make use of the insights. We have a sub r/market_sentiment where we discuss these weekly strategies. Do check it out if you are interested.\n\nLet me know what you think about picking stocks from wallstreetbets.\n\nIn case you missed out on any of my previous analyses, you can find them here!\n\n1. [Benchmarking Motley Fool Premium recommendations against S&amp;P500](https://marketsentiment.substack.com/p/top-stocks-of-the-week-603690)\n2. [A stock analysts take on 2020 congressional insider trading scandal](https://marketsentiment.substack.com/p/2020-congressional-insider-trading)\n3. [Benchmarking 66K+ analyst recommendations made over the last decade](https://marketsentiment.substack.com/p/top-stocks-of-the-week-590331)\n4. [Performance of Jim Cramer’s 2021 stock picks](https://marketsentiment.substack.com/p/top-stocks-of-the-week-568545)\n5. [Benchmarking US Congress members trade against S&amp;P500](https://marketsentiment.substack.com/p/copy-top-stocks-of-the-week-614493)\n6. [Do hedge funds beat the market?](https://www.reddit.com/r/StockMarket/comments/p10k98/do_hedge_funds_beat_the_market_i_analyzed_the/)\n7. [Micheal Burry's prediction accuracy](https://marketsentiment.substack.com/p/should-you-follow-michael-burrys)\n\nRecently, the analyses in Reddit were covered by [Graham Stephan](https://www.youtube.com/watch?v=VcldqSxfClU&amp;t=111s&amp;ab_channel=GrahamStephan) in his video.",
        "created_utc": 1635939600,
        "id": "hj4wjh9",
        "score": 54,
        "subreddit": "options",
        "created": 1635968400.0
    },
    {
        "author": "makaros622",
        "body": "[https://www.cnbc.com/2021/11/17/amazon-to-stop-accepting-visa-credit-cards-issued-in-the-uk.html](https://www.cnbc.com/2021/11/17/amazon-to-stop-accepting-visa-credit-cards-issued-in-the-uk.html)\n\n**Just buy the dip and ask questions later**",
        "created_utc": 1637162983,
        "id": "hkzwrg9",
        "score": 54,
        "subreddit": "StockMarket",
        "created": 1637191783.0
    },
    {
        "author": "vanzeppelin",
        "body": "Eh, I still like V long term. Visa is still the dominant credit card and I'm pretty sure it's the most widely accepted, with MC close second.  I don't buy that non-traditional payment companies will ever usurp them. People pay for shit with credit cards and I don't see any major US banking institution moving away from V + MC in their credit card offerings.",
        "created_utc": 1637157873,
        "id": "hkzl7jh",
        "score": 52,
        "subreddit": "stocks",
        "created": 1637186673.0
    },
    {
        "author": "Maleficent_Ad7987",
        "body": "Got in on DIS and V riiiiight before they both started eating shit. Trying to average down but running out of cash.",
        "created_utc": 1637699951,
        "id": "hltarby",
        "score": 52,
        "subreddit": "stocks",
        "created": 1637728751.0
    },
    {
        "author": "Scofieldbro",
        "body": "Also, he went to space with  William Shatner and could not listen to him for a minute.\n\nBonus: Shatner is a recovering alcoholic, gets sprayed with champagne.\n\nWarning : cringe inducing video\n\n[https://www.youtube.com/watch?v=9GQoHIBDogU](https://www.youtube.com/watch?v=9GQoHIBDogU)",
        "created_utc": 1636403131,
        "id": "hjui468",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1636431931.0
    },
    {
        "author": "not_creative1",
        "body": "No way visa retaliates in US against amazon.\n\n\nI am on Amazon’s side here. In this day and age with all this tech, there is no reason visa should be charging that much. They are just misusing their monopoly position. Someone had to step up and call them out",
        "created_utc": 1637173288,
        "id": "hl0mwu0",
        "score": 50,
        "subreddit": "investing",
        "created": 1637202088.0
    },
    {
        "author": "Eslooie",
        "body": "I just saw the price of visa and PayPal. I guess we are all going back to using cash?",
        "created_utc": 1637623638,
        "id": "hlp9qye",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1637652438.0
    },
    {
        "author": "PrataKosong-",
        "body": "Here in Singapore many online services also introduced an additional levy for paying with Visa cards. They’re pricing themselves out of the market. Amazon SG charges a certain percentage of the transaction.",
        "created_utc": 1637154423,
        "id": "hkzejxi",
        "score": 47,
        "subreddit": "stocks",
        "created": 1637183223.0
    },
    {
        "author": "r2002",
        "body": "Is there a reason why they picked Mastercard? Are they charging less than Visa?",
        "created_utc": 1637159486,
        "id": "hkzonbv",
        "score": 47,
        "subreddit": "stocks",
        "created": 1637188286.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "Paypal users 390 Million \n\nVisa Users 1280 Million\n\nMastercard users 840 Million",
        "created_utc": 1636704241,
        "id": "hkb5ysd",
        "score": 47,
        "subreddit": "stocks",
        "created": 1636733041.0
    },
    {
        "author": "Gastenns",
        "body": "I wonder if Amazon and Visa are in negotiations to lower fees. Maybe this is just a negotiation position.",
        "created_utc": 1637162496,
        "id": "hkzvkvb",
        "score": 44,
        "subreddit": "stocks",
        "created": 1637191296.0
    },
    {
        "author": "sablack422",
        "body": "Kinda apples to oranges. Visa and MasterCard are both ~60 years old and operate much of the payment infrastructure that square and PayPal rely on.",
        "created_utc": 1637360667,
        "id": "hlbb2u0",
        "score": 44,
        "subreddit": "stocks",
        "created": 1637389467.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "Yolo it right into 34% VISA, 33% BrkB, 33% PayPal shares and actually make money.",
        "created_utc": 1636597111,
        "id": "hk5h2xn",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1636625911.0
    },
    {
        "author": "Bsdave103",
        "body": "You nailed it.  Visa is boring as fuck.  But im in the market to make money and if boring makes money then sign me up",
        "created_utc": 1637777387,
        "id": "hlxg8sc",
        "score": 42,
        "subreddit": "stocks",
        "created": 1637806187.0
    },
    {
        "author": "FEMA_Camp_Survivor",
        "body": "V, MA, SQ, PYPL, and other Fintechs are down substantially. The winners have become losers.",
        "created_utc": 1637670708,
        "id": "hlre5ei",
        "score": 40,
        "subreddit": "stocks",
        "created": 1637699508.0
    },
    {
        "author": "DijonNipples",
        "body": "I have an Amazon Prime Visa card. I wonder how that’s going to turn out.",
        "created_utc": 1637172761,
        "id": "hl0lkay",
        "score": 39,
        "subreddit": "investing",
        "created": 1637201561.0
    },
    {
        "author": "lkjaioi22jlkak23",
        "body": "This is the first video he made on GME:\n\nhttps://www.youtube.com/watch?v=GZTr1-Gp74U",
        "created_utc": 1636513328,
        "id": "hk0t9ny",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1636542128.0
    },
    {
        "author": "metallica11",
        "body": "seriously. I parked cash in VISA as well because I felt like it was a steady cash flow that would at least keep my money intact, you know, since inflation was destroying my money market fund and eveything else was overvalued and booming.\n\nbut no, now I'm fucking holding a VISA \"bag\" at -10%. who wouldve thought.",
        "created_utc": 1637158851,
        "id": "hkzn9u0",
        "score": 38,
        "subreddit": "stocks",
        "created": 1637187651.0
    },
    {
        "author": "hard-in-the-ms-paint",
        "body": "[Here's a BBC video](https://m.youtube.com/watch?v=Hb1WDxSoSec) of TSMCs (Taiwan Semi Conductor) factory, the employees are more educated and paid than the average American by a long shot. They hire legions of engineers to do cutting edge work, producing the best chips in the world.",
        "created_utc": 1636692961,
        "id": "hkapf8d",
        "score": 35,
        "subreddit": "stocks",
        "created": 1636721761.0
    },
    {
        "author": "indiecore",
        "body": "[The X makes it sound cool](https://www.youtube.com/watch?v=xG6vgzAswgE)",
        "created_utc": 1637079050,
        "id": "hkv8onj",
        "score": 34,
        "subreddit": "CanadianInvestor",
        "created": 1637107850.0
    },
    {
        "author": "drones4thepoor",
        "body": "PayPal also owns Braintree which is a huge payments gateway like stripe. I’m not sure how any “analyst” could conclude that PYPL is in any jeopardy losing market share.\n\nFintech stocks have been getting battered for a while now, tho, including MA and V, despite strong earnings.",
        "created_utc": 1637260952,
        "id": "hl5iiu3",
        "score": 34,
        "subreddit": "stocks",
        "created": 1637289752.0
    },
    {
        "author": "financeGuruFCA",
        "body": "It was a manufactured FUD to put a brake on oil price to control inflation &amp; 10y! \n\nV shape recovery on Monday to 467 followed by 480 EOY &amp; over 500 by 21/01/2022!",
        "created_utc": 1637979245,
        "id": "hm85lhu",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1638008045.0
    },
    {
        "author": "MajorSurprise9882",
        "body": "yep , japanese used to produce shit like china back in those era\n\nhttps://www.youtube.com/watch?v=c1QcjsjjtRc",
        "created_utc": 1635952657,
        "id": "hj5ojb9",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1635981457.0
    },
    {
        "author": "blissrunner",
        "body": "Ever since ARKX in 2021... I'm beginning to doubt even in a pragmatic/thematic level. By far the worst ETF by Cathie (there was the SPCE deals... and since there's no space stocks, it's just defense)\n\nAnyways... ARKK (-33%)/G(-42%)/W(-25%)/F(-25%) is suffering since:\n\n* the flagship \"K\" was heavy on TDOC, ZM, Z, PLTR + Genomics... that went bad/dumped in 2021; and surprisingly Wood keeps averaging down (buy high, sell low) while it continues to go REDDD..\n   * Not enough stable value &amp; growth stocks like FANG+ which is rocking\n   * And also a lot of weird picks... like: TWTR, SNAP, why robinHOOD?\n* This is notice-able with ARKQ suffering the least at -16%:\n   * It has the most TSLA... with quality value/growth picks like Trimble, Unity, Deere, Caterpillar, Intuitive Surgical, Google finally, BYD etc.\n\nAnyways... I'm surprised thematically Cathie doesn't make an **ARKV (Virtual Reality) with a V** (a lot more pragmatic than ARKX).\n\n* Idk why she doesn't hold FANG+ like it's a sin or something. Holding the big four GOOGL, AAPL, MSFT, Meta and supporting's like AMD, NVDA, Unity, TSM, Samsung etc would've  been better (although in hindsight)",
        "created_utc": 1637765456,
        "id": "hlwmg8p",
        "score": 33,
        "subreddit": "stocks",
        "created": 1637794256.0
    },
    {
        "author": "DangerousWaffle",
        "body": "Why would the courts get involved? You can’t force them to take visa?",
        "created_utc": 1637160347,
        "id": "hkzqkqw",
        "score": 33,
        "subreddit": "stocks",
        "created": 1637189147.0
    },
    {
        "author": "Big80sweens",
        "body": "Buy the dip, visa will figure this out",
        "created_utc": 1637165988,
        "id": "hl0471j",
        "score": 33,
        "subreddit": "stocks",
        "created": 1637194788.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[Can't wait for the copper pennies in my pocket to be worth more in melt value than the paper dollars in my wallet. Inflation is rad bro.](https://www.youtube.com/watch?v=Mc3t3IVkq60)",
        "created_utc": 1637769470,
        "id": "hlww4d0",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1637798270.0
    },
    {
        "author": "aloysius345",
        "body": "Oh you poor soul. We haven’t even seen the true inflation yet. It’s still working it’s way through the supply chains. These things take time.\n\nPart of my duties as an accountant involve costing at my company, and certain raw materials for our products will go from $8 a gram to $30 a gram by Q3 of 2022.\n\nThere is no “V shaped recovery” for anyone but the rich - what little strides were made by labor lately are about to get creamed. As our politicians are in the stranglehold of the rich and corporations, my personal projections are that they will predictably do nothing meaningful to course correct (as they’ve done since Reagan) and what you saw on Jan 6th will be a mere appetizer as to what is to come.",
        "created_utc": 1637737054,
        "id": "hlvgdgv",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1637765854.0
    },
    {
        "author": "jlomohocob",
        "body": "Hello fellow Pirates! I wrote the previous [ZIM DD](https://www.reddit.com/r/wallstreetbets/comments/qhny21/why_am_i_all_in_on_zim/), still long and strong with shares and spreads. There is a great video out about how shipping works, high quality content, that is interesting even without being a trader [https://www.youtube.com/watch?v=8d5d\\_HXGeMA](https://www.youtube.com/watch?v=8d5d_HXGeMA) \\- check it out to better understand the shipping problem the world is facing.",
        "created_utc": 1637544965,
        "id": "hll2ugz",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1637573765.0
    },
    {
        "author": "IcedAmericano99",
        "body": "Visa",
        "created_utc": 1637929903,
        "id": "hm5cnya",
        "score": 32,
        "subreddit": "stocks",
        "created": 1637958703.0
    },
    {
        "author": "RedditSucksDickNow",
        "body": "you know that [scene in Wolf of Wall Street where Donnie asks Jordan to show him his pay stub](https://www.youtube.com/watch?v=qbZa69tIjoI)?\n\nEver think these post positions or ban demands were exactly the same?",
        "created_utc": 1636471224,
        "id": "hjxzyei",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1636500024.0
    },
    {
        "author": "ckal9",
        "body": "Nah Amazon is free to partner with, or not partner with, whichever payment method they want. No chance for Visa in court.",
        "created_utc": 1637160938,
        "id": "hkzrxxc",
        "score": 31,
        "subreddit": "stocks",
        "created": 1637189738.0
    },
    {
        "author": "wearahat03",
        "body": "&amp;#x200B;\n\n||PE RATIO|Recent REV GROWTH|\n|:-|:-|:-|\n|PYPL|44.7|13%|\n|AAPL|25.9|29%|\n|MSFT|39.1|22%|\n|GOOGL|28|41%|\n|FB|23.5|35%|\n|AMZN|80|15%|\n|V|34.9|29%|\n|MA|44|29%|\n\nPYPL is too expensive versus their growth rate. Their PE ratio is AFTER they've dropped.\n\nNot only are they more expensive than FAAMG but also more expensive than V and MA.\n\nOnly AMZN is more expensive and might correct in the future.",
        "created_utc": 1636821939,
        "id": "hkh1rf0",
        "score": 31,
        "subreddit": "stocks",
        "created": 1636850739.0
    },
    {
        "author": "maz-o",
        "body": "you've been holding visa for a couple months. that's not a \"bag\"",
        "created_utc": 1637163150,
        "id": "hkzx60m",
        "score": 30,
        "subreddit": "stocks",
        "created": 1637191950.0
    },
    {
        "author": "ravioli_bruh",
        "body": "Of course V and PYPL are my largest positions",
        "created_utc": 1637191596,
        "id": "hl1vqr3",
        "score": 30,
        "subreddit": "StockMarket",
        "created": 1637220396.0
    },
    {
        "author": "jmorlin",
        "body": "Between my retirement and \"buy a house\" accounts I'm into SOFI, V, and PYPL, with SOFI having the largest allocation of the three and visa and PayPal split roughly equal after that.",
        "created_utc": 1635867873,
        "id": "hj0upuz",
        "score": 30,
        "subreddit": "stocks",
        "created": 1635896673.0
    },
    {
        "author": "NoCollegeKids",
        "body": "I buy Visa calls and Amazon UK announces they are no longer accepting them, lol.   What a world.  Fuck me and my cursed hands.",
        "created_utc": 1637158881,
        "id": "hkznc5i",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1637187681.0
    },
    {
        "author": "nevabraun",
        "body": "Wasn't this the company the MAGA's felt betrayed by? A large chunk of their customer base must have eroded in the last year/months?\n\nhttps://www.youtube.com/watch?v=rGJ92xvIZyk\n\nClassic SPAC-case of ownership cashing out before filing for bankcrupcy? \n\nDisclaimer: Non-US citizen here",
        "created_utc": 1635861401,
        "id": "hj0fhhr",
        "score": 29,
        "subreddit": "SPACs",
        "created": 1635890201.0
    },
    {
        "author": "jessejerkoff",
        "body": "thank you ... i am not surprised in the slightest. If the truth is so against what someone wants to be true, they have to use all avenues to misdirect [[link jim cramer explaining it](https://www.youtube.com/watch?v=k0884pztJiY)]",
        "created_utc": 1635763618,
        "id": "hivbtuk",
        "score": 27,
        "subreddit": "StockMarket",
        "created": 1635792418.0
    },
    {
        "author": "smileyfrown",
        "body": "Just a quick google\n\n&gt;The Financial Times reports that Mastercard will raise fees to more than five times the current amount for British shoppers using a card to buy from EU-based companies.... **Mastercard will charge 1.5 percent of each transaction’s value** for every online credit card payment from the UK\n\nhttps://www.cashmatters.org/blog/mastercard-raise-fees-uk-purchases-eu\n\nSo both cards are charging the same rate and Mastercard actually did the rate increase first, but Amazon is only going after Visa. \n\nSo yea, Amazon wants Mastercard to get more business for whatever reason/partnership they have. Has nothing to do with costs as they claim, I would bet",
        "created_utc": 1637168170,
        "id": "hl09qge",
        "score": 27,
        "subreddit": "stocks",
        "created": 1637196970.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "V, pypl and Disney are still very solid long term investments. Buy em up.",
        "created_utc": 1637714243,
        "id": "hlu8j2r",
        "score": 26,
        "subreddit": "stocks",
        "created": 1637743043.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "[Chair Powell stream](https://www.youtube.com/watch?v=Nd40XFQwG3o)",
        "created_utc": 1635964835,
        "id": "hj6kqiv",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1635993635.0
    },
    {
        "author": "Desmater",
        "body": "This is the area to buy.\n\nPayPal pretty much bottomed around $200-202 from all the other fintech earnings.\n\nWas headed to recovery at $215. Then this morning we had downgrade and Visa news.\n\nI would buy leaps here or shares.\n\nIt might take awhile. UPST, AFRM, SQ, PYPL, V and MA all kind of took hits from each other's news and earnings.",
        "created_utc": 1637209473,
        "id": "hl2y82r",
        "score": 26,
        "subreddit": "stocks",
        "created": 1637238273.0
    },
    {
        "author": "shortyafter",
        "body": "Going to post this here because I don't have anywhere else to post it.  It's related and I hope some of you can find value in it.\n\nThe people saying \"this isn't a big deal\", I think that's disingenuous.  The people saying \"panic!\", that's also disingenuous.  The fact is, we don't know.  I found [this video](https://www.youtube.com/watch?v=_XtJQzkeAaY) to be very helpful.  He summarizes the potential issues with this new 'nu' variant:\n\n1. It may be more transmissible than other variants, including delta.  That would be shocking because delta is already highly transmissible.\n2. It may be able to get around the vaccines we already have.\n3. It may result in more serious illnesses in those who are infected.  This one is not a serious concern at the moment.\n\nDo note that in this new variant there's 30 mutations to the spike protein, which is why we're concerned that there may implications for vaccine efficacy ([source](https://www.cnbc.com/2021/11/25/who-calls-special-meeting-to-discuss-new-covid-variant-from-south-africa-with-large-number-of-mutations.html)).\n\nIn terms of investing, I don't encourage anyone to sell off right now.  That's silly.  Stick to your plan.  This was not meant to be a gloom and doom post.  But at the same time, the folks saying \"this is nothing\", that's not accurate.  It might be!  There's been scares before, obviously.  But at least inform yourself a bit before making statements that not only relate to finance and investing, but also to public health.\n\nFurthermore, at least in my case I'm a little scared.  I remember the feeling of the original Covid outbreak.  At first it was some obscure story in China, then Italy, and next thing I know I was told I was going to have to be working from home and could only go out to buy groceries.  I guess I'm a little traumatized.\n\nFor people who think life is clean and perfect all the time, I'm sure this will look like fear mongering or whatever.  So be it.  But hey, I'm scared right now.  I've got a trip back to the USA to visit my parents for Christmas.  I haven't seen them in 2 years.  I'm worried about what this means for my travel plans.  It's normal.  It's human.  Pretending like there isn't a problem when there is one doesn't solve anything.  There's a reason governments are taking this seriously.\n\nAnyway, it may all blow over, I fully acknowledge that and I hope it's the case!  But just pretending like everything is fine isn't the reality of what we're seeing right now.  I imagine I can't be the only one feeling this way.\n\nSo, best of luck to everyone, stick your investing plan and take care of yourselves!\n\n\\-shorty",
        "created_utc": 1637934678,
        "id": "hm5k3k9",
        "score": 25,
        "subreddit": "stocks",
        "created": 1637963478.0
    },
    {
        "author": "Okmanl",
        "body": "Yep, 1999 video interview of a very different Jeff Bezos, and Amazon. Exactly what he seemed like back then.  \nhttps://www.youtube.com/watch?v=Yv8MrBBuRqI",
        "created_utc": 1636408465,
        "id": "hjuvii0",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1636437265.0
    },
    {
        "author": "exponentialvoid",
        "body": "If you look at the chart it's not doing anything horrifying. it's simply retesting the bottom/support and as long as it bounces from 140-150$ its got the momentum to continue on wards and upward. dont forget it just had a 25%+ move up - v/ expected to have a retest etc",
        "created_utc": 1637238415,
        "id": "hl42kb0",
        "score": 25,
        "subreddit": "stocks",
        "created": 1637267215.0
    },
    {
        "author": "jeffdidntkillhimslf",
        "body": "Pleas Visa. I have a family",
        "created_utc": 1637670417,
        "id": "hlrdp6y",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1637699217.0
    },
    {
        "author": "bosshax",
        "body": "I think we're in for a huge bounce on Monday.\n\nThere is 0 information to suggest this variant is anything to worry about.\n\nIf it is the Big Pharma guys are standing by with a new shot in 100 days.\n\nSociety has already learned how to deal with outbreaks. We can now address them without nuking the economy. \n\nIt's up to leaders to make good decisions, which are generally sorely lacking, but they can hardly claim ignorance now.\n\nWhat we have learned is that lockdowns don't work but social distancing does. \n\nMarkets aren't stupid, there is a reason we had a V recovery in March. Most businesses are more able than ever to react to a digital first commerce strategy. There is no reason for the economy to tank.\n\nThe only real reasons behind the market crashing are growth. Is growth slowing? Well China is beginning to flash some pretty big signals and as tapering takes it's toll you'll see normal economies slow too. With slowing growth comes P/E ratios under focus. There are a lot of companies that are overvalued BUT there are also a lot of companies which are at like 50% of this years ATH... There are absolutely bubbles in EVs and such but other areas I'd say are fair valued.\n\nOverall we're just entering a time where you need to modify the way you appraise value and what sectors will be more robust against repeat waves of pandemic. It's sort of like being in a war-time market. \n\nSo, all that being said the broad sell off is a big over-correction because of the short trading day and market Thursday close. By Wednesday the headlines will read \"Markets shrug off virus concerns. Fund managers confident businesses can navigate new strains.\" \n\nThe only real areas of struggle will continue to be big events, big sports events and such. Some regions will have them, some will not. Downtown core commercial property will continue to face headwinds but rents just need to fall. This virus is with us literally forever, it will become another seasonal cold/flu/infectious disease and you'll hear about new variants each year. Pharama will start making broad spectrum covid shots that you'll get with your other myriad. Every country will do deals with pharma so they can maintain critical supply. \n\nThrough all this society will, by and large, ignore issues of health, diet, nutrition, and underlying diseases like diabetes, smoking, lack of exercise. Society will also ignore age and treat all people, including children, at the same risk level as an 85 year old. This irrationality will make people more aggressive, combative, and you'll see more political factions in every nation, especially 'freedom parties'. The only way these are neutralized are with open policies but those are by and large against government directives. Truth is they are welcoming the greater control, digital ID, travelling surveillance, contact tracing, immunization databases. These are all useful for maintaining the elites control, and so these ideas will continue.",
        "created_utc": 1638027270,
        "id": "hma6xem",
        "score": 25,
        "subreddit": "stocks",
        "created": 1638056070.0
    },
    {
        "author": "razv4n99",
        "body": " V",
        "created_utc": 1636697000,
        "id": "hkaw6uu",
        "score": 25,
        "subreddit": "stocks",
        "created": 1636725800.0
    },
    {
        "author": "metallica11",
        "body": "invest in solid companies they said. don't take unnecessary risks they said.\n\ninvests in VISA, VISA dumps premarket to the pre-covid low. EV's soar.",
        "created_utc": 1637157517,
        "id": "hkzkgrs",
        "score": 25,
        "subreddit": "stocks",
        "created": 1637186317.0
    },
    {
        "author": "Jumpdeckchair",
        "body": "Amazon just killed my V calls, fuck",
        "created_utc": 1637149617,
        "id": "hkz6rgy",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1637178417.0
    },
    {
        "author": "Desmater",
        "body": "V and MA have always been at a premium.\n\nAnother example is COST.\n\nThey are usually always 30-40+ PE.\n\nLook at their charts.",
        "created_utc": 1637695399,
        "id": "hlsz690",
        "score": 25,
        "subreddit": "stocks",
        "created": 1637724199.0
    },
    {
        "author": "cdazzo1",
        "body": "&gt;THE issue I have with this is not only do I want to know NYTs motives,\n\n[https://www.youtube.com/watch?v=sQN4c3uN\\_tA](https://www.youtube.com/watch?v=sQN4c3uN_tA)\n\nIt's incredibly long but it is a much better answer than I can give, but I'll still try to give you the cliff notes version.  \n\nYuri Bezmenov is often referred to as a \"former KGM agent\".  But he wasn't really an agent, although he obviously helped them.  He was a \"journalist\" but his job description was mostly to \"entertain\" American visitors.  These Americans were carefully vetted before being invited to Russia and upon arrival he did things like get them drunk, make Russia look really good, and try to get them in slightly compromised situations.  Things like pictures of them in the same room as prostitutes or drinking too much so they'd be unsure of what they did the previous day/night and if they said or did something wrong.  He'd then use this as leverage to get them to say favorable things about Russia in the US.\n\nThat was it.  It was all about perception.  That was the majority of KGB \"spy\" operations.\n\nWhen it comes to Evergrand, cui bono? China.  So whether intentionally carrying weight for China or just useful idiots victimized by CCP intel operations, NYT is carrying water for the **CCP who desperately wants to unload assets before the rest of the world catches on**.  This is the exact **same play they ran for the pandemic** when they vacuumed up PPE across the globe while denying human to human transmission.",
        "created_utc": 1636856100,
        "id": "hkj8tvn",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1636884900.0
    },
    {
        "author": "Moist_Lunch_5075",
        "body": "The market wasn't red today because of inflation or retail numbers. The market was red today because last week we entered the OpEx period. This is literally what the market does every month now. Except, it's not doing what it's normally doing on the daily candlestick chart... it's trading flat when it's normally trending down right now, which is actually kind of weird and strong.  \n\n\nAnd the reason for that is because most of the retail numbers are actually pretty good and most of the macro indicators are really good. Jobs from July on were just revised up by almost \\*700,000\\* jobs. In these earnings reports, there's some mention of inflationary troubles for some companies, but there's also significant news about how companies are starting to bring prices down to move volume, which is expected... inflation, it turns out, likely is actually transitory... just not \"transitory is like a month\" like all of the ADHD newb kids think.  \n\n\nOil's going down. At the port, shipping container backlog is down 25%. There's just a TON of great macroecon data.  \n\n\nFor retail, margins suffering in the short term doesn't result in market insolvency in the long term, and the big drag on the market was V... Visa has a ton of issues, almost none of which have to do with retail or inflation and everything to do with the fact that their business model is being disrupted by BNPL and Visa's starting to lose vendor interest.  \n\n\nIf you actually zoom out the graph, the market's actually still on a very strong upward leaning bullish streak for the month... these Bear theses need major work.",
        "created_utc": 1637203925,
        "id": "hl2mux2",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1637232725.0
    },
    {
        "author": "CCChristopherson",
        "body": "I own ZBRA which was up 8% after earnings beat yesterday. I like the stock so I didn’t want to sell but I thought it would come back to earth today (currently down 4%).  I doubt I’ll do this but curious if others have - Does anyone ever do covered calls or puts on an earnings pump on a stock they own? Seems like the majority of time stocks lose some of their post-earnings gains",
        "created_utc": 1635949388,
        "id": "hj5gcmc",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635978188.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  2nd of November\n\n\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ES, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCN, OKE, OMCL, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACNB, ACRE, ACRS, ADPT, AEE, AEMD, AFIN, AGIO, ALB, ALG, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CBD, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRSP, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FBRT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FPH, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IIPR, IMXI, INFN, INMB, INN, INOV, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, JMP, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LXRX, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NSR, NUS, NVST, NYT, OAS, OCDX, ODP, ODT, OLP, OM, OMI, OMP, ONCS, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PSN, PTC, PTGX, PTVE, PW, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RRD, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SB, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPOK, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STGW, STLA, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UEC, UGP, UHAL, UMH, UPLD, UTHR, UVV, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (consensus: 1.567M, previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -1.533M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.200M, previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.0, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n\n^^^^2021-11-02",
        "created_utc": 1635847213,
        "id": "hizs3wm",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635876013.0
    },
    {
        "author": "EngineeriusMaximus",
        "body": "I was thinking that synthetic positions are cheap leverage. For example, a 2023 SPY synthetic (one short ATM put, one long ATM call) currently requires \\~$14,700 in collateral and 0 cash, and a SPY ZEBRA requires $12000 in cash. Both of these represent $46,000 worth of SPY, so you are getting 3x+ leverage. You can get even lower collateral requirements if you go a little OTM on both the put and call, e.g. short 430 put and long 485 call, with collateral of just over $10k. These make sense to hold for long periods as leveraged SPY plays, right?",
        "created_utc": 1635896502,
        "id": "hj2vdjb",
        "score": 2,
        "subreddit": "options",
        "created": 1635925302.0
    },
    {
        "author": "analnapalm",
        "body": "I don't have anything significant on my short term radar and am mostly cash as I feel the market is a little overheated at the moment.  Long term, it's difficult to imagine not seeing QQQ, NVDA, &amp; AAPL somewhere in my portfolio.  Perhaps also TGT and ZBRA.",
        "created_utc": 1636128472,
        "id": "hjfi9mr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636157272.0
    },
    {
        "author": "GimmeAllDaTendiesNow",
        "body": "Purchasing shares to cover a short position can work, but it can also work against you. It's a very capital-intensive way to cover the position in any case. I've done it before both successful and not. A more capital-efficient way of doing this is cover the short with a deep ITM long option or a ZEBRA. I prefer ZEBRAs, especially long-dated.\n\nYou are always going to get a lot of sanctimonious knee-jerk responses about selling calls from people who have no idea what they are talking about. As someone who has sold naked calls for years, it's risky and it's a lot harder to make money than by put-selling. There's also a lot of value to balanced delta in my opinion. \n\nMost of the time lately they are either challenged or at an unrealized loss, but rarely ITM, depending on your entry delta. You usually get a month or two out of the year where they are the only thing that pays. It's easy to not be stupid about it. Don't trade meme stocks and don't sell 400 naked puts on a $20K account. The last few months have been rough, because a lot of stuff is up significantly more than volatility had priced in. Vol is just way under priced right now. I have strangles on MSFT, CVS, WMT and XRT that have all blown way past my short call strike. I'm inverted on all of them. At the same time, a lot of stuff has tanked and gone way past my short put strikes.",
        "created_utc": 1636732199,
        "id": "hkcenk5",
        "score": 2,
        "subreddit": "options",
        "created": 1636760999.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "About 2 years and about 30% percent a year. Started with 190k in a Schwab MMF, went to stocks (shares only) last March and am up to 348k. I’m about 90 different positions, I realize I have too many small positions. My large positions have done very well though. NVDA, AVGO, TER, TTD, MA, BRKB, C, BAC, SHOP, TSLA, ZBRA, GOOG, AAPL are my large blue chip holdings.\n\nEdit : I realize I’ve lucked out with timing and won’t get 30% a year every year but I’m thankful for the portfolio I’ve managed to put together and believe it could outperform long term or get dumpster fucked who knows.",
        "created_utc": 1636845474,
        "id": "hkikwj1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636874274.0
    },
    {
        "author": "coconubs94",
        "body": " lovely ain't it? The only difference between this and a pmcc  is that the zebra acts closer to actual stock than just a long call",
        "created_utc": 1636471286,
        "id": "hjy03qo",
        "score": 1,
        "subreddit": "options",
        "created": 1636500086.0
    },
    {
        "author": "houstonisgreat",
        "body": "&gt;Zero-extrinsic-back-ratio spread\n\nthis looks pretty interesting.  if the stock price goes up to threaten the PMCC short call ( not the call involved with the  ZEBRA ), do you then just close down the whole thing for a profit on the ZEBRA underlying ?",
        "created_utc": 1636469545,
        "id": "hjxw2h5",
        "score": 1,
        "subreddit": "options",
        "created": 1636498345.0
    },
    {
        "author": "honedspork",
        "body": "ZEBRA underrated strategy but you do have to monitor it.",
        "created_utc": 1636597552,
        "id": "hk5i2pa",
        "score": 1,
        "subreddit": "options",
        "created": 1636626352.0
    }
]