[
    {
        "author": "ChiefOfTheWolfpack",
        "body": "Where giving your 12 year old the keys to your stock portfolio isn’t even in the 50th percentile in the stupidest shit people have done here",
        "created_utc": 1629063317,
        "id": "h92wdmz",
        "score": 232,
        "subreddit": "wallstreetbets",
        "created": 1629092117.0
    },
    {
        "author": "ShickyMicky",
        "body": "Got so drunk last night on the beach that I forgot my backpack with headphones, laptop and keys. Wife wasn't happy but I stayed calm all day knowing that somehow someway my stuff would find me. And guess what? Someone called the bar moments ago and said they picked it up and will drop it off in a bit. Not sure whether it's an employee who was seen on camera but who cares. I'm grateful. I've been so lucky this week - in the market and out.",
        "created_utc": 1629893880,
        "id": "haa7tdl",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1629922680.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "I have been involved in this alternative asset class for a few years now and I would highly recommend staying away from Wealthsimple because it is expensive and you will not own any crypto-assets with them as I will detail below. Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\r  \n\r  \n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy.   \r  \n\r  \n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\r  \n\r  \n3. If you want tax free capital gains, you can buy BTCX, ETHX or BTCC in your TFSA. With that said, you do not truly own crypto with any of those because they are a fund; and therefore, you own shares of the fund and not the asset itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your crypto\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not insured. Big risk, but tax free/deferred in a TFSA/RRSP.\r  \n\r  \n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\r  \n\r  \n5. Unfortunately, with BTCC, ETHX, and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (crypto) and simply run the fund with the crypto backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\r  \n\r  \n6. In regards to taxes, if you truly own the asset (crypto), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\r  \n\r  \n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. \r  \n\r  \nNow, here are some general points of interests to help you understand cold storage wallets:\r  \n\r  \n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\r  \n\r  \n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\r  \n\r  \n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \r  \n\r  \n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\r  \n\r  \nDisclaimer: I am irresponsibly long Bitcoin and Ethereum.",
        "created_utc": 1628954280,
        "id": "h8x38bx",
        "score": 49,
        "subreddit": "CanadianInvestor",
        "created": 1628983080.0
    },
    {
        "author": "liamm_mm",
        "body": "BTCC physically holds bitcoin keys in cold storage. Each unit is worth say .00111 (for example) bitcoin. \n\nIt’s only open when the market is yes but it will just play catch up or down when the market opens. \n\nThe volume is what it is. People look to make money, if it’s 20 percent less than the price of bitcoin people are going to buy it up. I’ve been holding it since the the first week of release and it does relatively move with the price of its underlying asset, volume hasn’t been an issue. \n\nHowever a big downfall is if there is big movement up or down on the weekends you can’t move your etf units until the market opens.",
        "created_utc": 1629761526,
        "id": "ha3gyd8",
        "score": 21,
        "subreddit": "CanadianInvestor",
        "created": 1629790326.0
    },
    {
        "author": "moolahstonks",
        "body": "Not your keys, not your coins. Literally rule number one of crypto. Anyone leaving their coins on an exchange is taking a massive risk.",
        "created_utc": 1629863050,
        "id": "ha91pf2",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1629891850.0
    },
    {
        "author": "floydiannyc",
        "body": "A hard wallet. It's basically an air-gapped drive that stores your keys. \n\nYou buy crypto from an exchange. You then send the \"crypto\" to your offline wallet. \n\nThe crypto is not stored on the wallet itself. The wallet stores your keys, which unlock your crypto in the blockchain itself. So every wallet comes with a pass phrase, so that if you lose a wallet, you can recover your keys on a new wallet with the pass phrase (usually a list of 12-24 words).",
        "created_utc": 1629841434,
        "id": "ha7r3se",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1629870234.0
    },
    {
        "author": "bryantheactivist",
        "body": "Don’t buy crypto on robinhood, NOT YOUR KEYS.",
        "created_utc": 1630203310,
        "id": "har8v3t",
        "score": 16,
        "subreddit": "StockMarket",
        "created": 1630232110.0
    },
    {
        "author": "Montyprice7206",
        "body": "Went back to my old apartment to drop off my keys, the manager was always a dick and does everything in the building himself (cleaning, repairs etc).\n\nWe had already done the walkthrough a few days ago, so when I went back just drop off my keys in my unit I made sure drop off a fat shit in the toilet for him. DIDNT FLUSH hahahaha got eeeem 🙊",
        "created_utc": 1628295624,
        "id": "h800re2",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628324424.0
    },
    {
        "author": "tim2k000",
        "body": "should short seller just mail me their keys to house and cars...or do we need to covert to cash first? 🤣\n\n🍀🍀🍀",
        "created_utc": 1628771265,
        "id": "h8naojk",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628800065.0
    },
    {
        "author": "konga_gaming",
        "body": "As if lambos even use keys",
        "created_utc": 1628351095,
        "id": "h82e7c2",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1628379895.0
    },
    {
        "author": "OlympusChimera",
        "body": "MVST bullish keys goo",
        "created_utc": 1628147022,
        "id": "h7s0qwd",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1628175822.0
    },
    {
        "author": "curtainflagwall",
        "body": "Dang bro here’s the keys to Uber’s C-suite",
        "created_utc": 1629294779,
        "id": "h9eqmce",
        "score": 7,
        "subreddit": "investing",
        "created": 1629323579.0
    },
    {
        "author": "10xwannabe",
        "body": "I will give you the keys to the kingdom.  Likely, you won't listen as most don't and will reflect back in 20 years and wish you would have listened from the beginning.\n\nHere is what is important to be rich...\n\n1. Get the best education you can afford in the highest paying field you will actually like to do going forward.\n2. LBYM and save as much as you can so you can invest as much as you can.  Focus on how much you can save in $$ per year and NOT how much return your portfolio gives back each year.\n3. Asset allocation is king.  95% of all variability in folks returns over the long run come down to asset allocation.  if you don't understand \"asset allocation\" time to start reading before investing.\n4. Active management (picking the winning stock and/ or timing the market) is usually a losers game so avoid it with majority of your hard earned money. 5-10% play money is fine, but not more.\n5. Fees, taxes, and inflation cut into long term returns so be cognizant of it.\n6. Stay the course once you have developed your plan.  When you want to do something based on hearing a great idea don't.  Just stand there and do nothing.  Stick to the above plan.\n\nThis is what I have learned from books, financial articles, looking at the data, and my own personal experiences after 10+ years in the market for myself and others around me.\n\nThe above will make you more wealth 90% of the time vs. just haphazardly picking hot stocks over a 25+ year time horizon.  That 10% or less chance of making a TON of money usually cost folks more then just doing the above.\n\nGood luck on whatever you choose.",
        "created_utc": 1630157453,
        "id": "haohwvn",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1630186253.0
    },
    {
        "author": "ItsAConspiracy",
        "body": "On Coinbase, they keep the bulk of funds in \"cold wallets,\" which are basically pieces of paper with the keys written on them, held in a bunch of safe deposit boxes in a bunch of different places. The \"hot wallet\" holding active funds is insured. However, if someone breaks into your own account and vacuums funds, you're pretty much screwed. You can lower the risk with 2FA not based on your phone number, a dedicated email account, etc., but you have to be careful. \n\nThe other option is to hold the keys yourself in your own cold wallet. If you have a lot, it'd be worthwhile to do what Coinbase does: put portions of your key in multiple safe deposit boxes. There are also hardware wallets, which connect to your computer and sign your transactions, without the computer itself having access to your private keys.",
        "created_utc": 1630244147,
        "id": "hasuth7",
        "score": 6,
        "subreddit": "investing",
        "created": 1630272947.0
    },
    {
        "author": "SheaButterShea",
        "body": "I was more so trying to say wealthsimple's version of holding crypto is horrible... not your keys not your coins...",
        "created_utc": 1630275172,
        "id": "hauuu9e",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1630303972.0
    },
    {
        "author": "PanickyLemur",
        "body": "So about this yacht club thing. How you get keys to that place?",
        "created_utc": 1629346544,
        "id": "h9htj7o",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1629375344.0
    },
    {
        "author": "SoyFuturesTrader",
        "body": "Who gave the apes the keys to J POW’s printer? Opened at $166 currently up 11% at $184",
        "created_utc": 1629826709,
        "id": "ha6qcwr",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1629855509.0
    },
    {
        "author": "SauceOfTheBoss",
        "body": "Wearables and subscription income blew estimates out of the water. As time as progressed, folks check for their wallet, keys, and phone. Now they check for their wallet, keys, phone, Apple Watch, and AirPods before they leave the house. They’re everywhere",
        "created_utc": 1630066760,
        "id": "hajpvvv",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630095560.0
    },
    {
        "author": "advadm",
        "body": "Worth looking into but keep in mind not your keys not your money. Understand that phrase 100%\n\nAfter that crypto is a massive rabbit hole worse than gold or ETFs. \n\nI think Eth will overtake Bitcoin well within 2 years. There are some neat alt coins but as much as I understand them well, I can't be bothered and stick to only btc and eth.",
        "created_utc": 1630187081,
        "id": "haqch0c",
        "score": 5,
        "subreddit": "investing",
        "created": 1630215881.0
    },
    {
        "author": "DonCorleone47",
        "body": "Bro. All I can remember was that I applied to work at a grocery store, and I got there and Obama was the manager, but upon further inspection it wasn’t really Obama. And turns out I applied to the wrong grocery store, all the employees were so sad that I was leaving. And on the way to my car to leave a smoking hot Asian lady asks me how big my D is, I told her and then she asks if she can put it in her mouth. Without hesitation I say absolutely and then we get in her car and all the sudden I’m in the back seat after getting in the passenger side front seat and then the lady drives up the street and picks up her 30 year old son and then nothing happens, we go to a movie theater where I start to lose all ability to think coherent. I lose my keys and headphones In the seat over and over keep looking for shit and everyone gets mad at me for getting up and making noise in the theater. And then I get escorted out with a group of people and I’m all the sudden back in my old neighborhood with tents everywhere and people are all confused like wtf going on and then I start running and wake up….. that’s all I can remember, but the worst part was the sheer confusion, I vividly remember telling myself in the dream I had to see a psychiatrist cause I lost all connection to what the fuck was going on. Never ever ever had a dream like that.",
        "created_utc": 1629540746,
        "id": "h9ruwak",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1629569546.0
    },
    {
        "author": "Yodan",
        "body": "I mean, I've seen 11,000% gains over the years with it and turned 5% of my initial worth back then into over 200% my current cash worth now so...I personally think it's OK to put a few dollars in if you believe the tech has longevity. Unless encryption is broken it will retain its use and if encryption is broken crypto will be the least of the world's problems. I'd recommend just owning crypto directly with a cold storage wallet though, if you don't own the encryption keys then you don't actually own the coins. I've seen horror stories of exchanges and banks shutting down while people floated their crypto on the 3rd party and couldn't recover it since they never owned it in the first place.",
        "created_utc": 1628511374,
        "id": "h8a0k9s",
        "score": 4,
        "subreddit": "investing",
        "created": 1628540174.0
    },
    {
        "author": "OlyBomaye",
        "body": "Everybody knows the situation lol.  Almost all of us have admitted that we were wrong about the price tanking and there are very few here betting on it doing so.  \n\nBut there is absolutely no justification for its current price.  None.  Aside from an internet cult holding it hostage thinking they have the keys to wealth if they can just cause the entire world economy to collapse.",
        "created_utc": 1628478476,
        "id": "h88tlnb",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1628507276.0
    },
    {
        "author": "dreamsushi",
        "body": "[p/l of +$510 for the day on two smaller trades](https://imgur.com/a/mhVvTcl)\n\nGonna call it on that as I can't focus at all and need to get away from the screen, left a ton on the table on both of those scalps exiting too early - made profit but not too happy about my performance. About to go demolish some seafood and get daydrunk, kinda doubt this applies but if anyone here is currently in the keys and wants to hangout with an autismo and his gf dm me lmao\n\nhope everyone is doing well today and making lots of money",
        "created_utc": 1628696965,
        "id": "h8joo3i",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1628725765.0
    },
    {
        "author": "hecmtz96",
        "body": "Damn now all makes sense. We were given the keys to the door and decided not to open it. 🚪",
        "created_utc": 1630107350,
        "id": "hamcsgu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630136150.0
    },
    {
        "author": "Bkelling92",
        "body": "At the age of 18, I invested 15k that I received from being hit by a drunk driver into three ETFs and a couple of stocks (A and KEYS) and it’s grown into around 45k by the age of 29 without any further investment. Honestly, I never even checked performance until I was like 26 years old. Set it and forget it. The younger you are and the earlier you invest the more that you’ll thank yourself down the road.",
        "created_utc": 1629577871,
        "id": "h9turu8",
        "score": 4,
        "subreddit": "stocks",
        "created": 1629606671.0
    },
    {
        "author": "photogromer",
        "body": "Yeah and the company is actually something worth investing in at this price...as I type on my Corsair too expensive keyboard, am blinded by my elgato key light, and get ready to smash my stream deck keys on some buy orders while listening to Britney spears on my corsair headphones.",
        "created_utc": 1630410739,
        "id": "hb1oiga",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630439539.0
    },
    {
        "author": "Accomplished_Bee6206",
        "body": "slap her ass, get her the car keys, show her to the door and say gently \"try again, hun\"",
        "created_utc": 1630376425,
        "id": "hb0bez4",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630405225.0
    },
    {
        "author": "ConmanSpaceHero",
        "body": "I’m in Robinhood because I just started, no fees, easy to understand, and don’t need to use my ID. Think the platform has much room to grow. Not saying it’s the best platform but I’m fine with the risk of “not your keys not your crypto”.",
        "created_utc": 1629052981,
        "id": "h928eti",
        "score": 4,
        "subreddit": "investing",
        "created": 1629081781.0
    },
    {
        "author": "Jojonaro",
        "body": "China will die the same day the version of capitalism we know die. \n\nThe same day hedge funds and co die as well. \n\nThey have been handed on a plate of gold the entire master keys of this capitalism. Ain’t nothing going to stop them if you’re not willing to dirty your hands",
        "created_utc": 1628326864,
        "id": "h81cqej",
        "score": 3,
        "subreddit": "investing",
        "created": 1628355664.0
    },
    {
        "author": "FannyPackPhantom",
        "body": "lost and found box over there u/duffbeers71 👉 \n\nLots of pants, some hand sanitizer, a couple dildos, car keys, decoder ring, and someone forgot a shoe",
        "created_utc": 1629040545,
        "id": "h91etz8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629069345.0
    },
    {
        "author": "slammerbar",
        "body": "More info from article:\n\n“Founded in 2017 by Williams, a satellite industry veteran, Arqit’s investors include Notion Capital, Seraphim Space, and the UK government. The company’s core product, QuantumCloud, creates one-time encryption keys locally that cannot be broken or stolen.\nAlthough quantum computers can reverse-engineer any calculations, Arqit says it uses physics to create random numbers used as encryption keys. Since there is no math involved, quantum computers can’t attack them. This solution, Arqit says, is currently 1,400 times faster than post-quantum algorithms.\n“Quantum-based encryption is now a reality and offers encryption which, backed by the laws of physics, is demonstrably unbreakable,” analysts at Equity Development wrote in a research note on Arqit in July.\nThe company has already signed more than $130 million worth of contracts, including with the UK Government, the European Space Agency, BT Group (BT.UK) and Sumitomo Corporation (SSUMY), and has a pipeline of $975 million worth of deals. It has also signed a collaboration deal with Northrop Grumman and plans to launch its first quantum encryption satellites in 2023 via Richard Branson’s Virgin Orbit.\n\nBlockchain technologies could add another area of growth for Arqit as advances in quantum computing could place the encryption that underpins bitcoin at risk. \n\n“The customer base is growing rapidly because Arqit is unique in solving the most existential threat to our data, and we see a lot of upside in defence, telecoms, robotics and fintech,” Williams says.”",
        "created_utc": 1630075709,
        "id": "hak9lt6",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1630104509.0
    },
    {
        "author": "NearnorthOnline",
        "body": "That erm is meant for security, not about gains. Prior to etf you either held your keys and crypto.\nOr it was held by a shady unreliable exchange .\n\nSee Mt. Got, crypropia, Quadra cx. Etc.\n\nSo that mantra applies to crypto.",
        "created_utc": 1628304315,
        "id": "h80gqn0",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1628333115.0
    },
    {
        "author": "PrincPaco",
        "body": "Miami does not get old. You are an hour from the Keys, the greatest place in USofA\n\nEdit - WTF is there to even decide? Miami, Chicago or Jersey City? Chicago has legal weed and good food but otherwise it's fucking Chicago. Get your head out of your ass and move to Miami",
        "created_utc": 1629064794,
        "id": "h92zph4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629093594.0
    },
    {
        "author": "mythoughts2020",
        "body": "Jingle mail was very common - this is when you mail your house keys to the bank so the letter jingles. People were underwater (owed more then the house was worth) and just walking away from their homes. There were huge dumpsters about ever 10 houses, and this was people that were packing / cleaning out their homes as their homes were being foreclosed. \n\nIt was stressful and everyone cut back on spending. People didn’t eat out or travel like they used to. Companies were going under and we all know a few people that went to work one day only to find the doors locked and be told the company was no more. That made everyone worry about losing their job, or having the company they worked for go under.\n\nIn some ways it was positive as people seemed less phony, and people weren’t trying to show off or look better than others. I talked to many neighbors that were out of work and were losing their homes, and we had some real honest discussions trying to be supportive of one another.",
        "created_utc": 1629614752,
        "id": "h9vsprg",
        "score": 3,
        "subreddit": "stocks",
        "created": 1629643552.0
    },
    {
        "author": "cheeeesewiz",
        "body": "Have fun telling the nascar generation you're taking their keys away. Better luck with their guns",
        "created_utc": 1630005744,
        "id": "hagng9r",
        "score": 3,
        "subreddit": "investing",
        "created": 1630034544.0
    },
    {
        "author": "areyoume29",
        "body": "On a side note, I think one of the keys is no options. The next one that could possibly do this is sv if the deal is approved. I do own warrants on that one.",
        "created_utc": 1629889147,
        "id": "haa0baa",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1629917947.0
    },
    {
        "author": "Cheap_Meaning",
        "body": "Dude buy Bitcoin or eth ETFs.  Btcx.b is galaxy's ETF.    Each share contains a fraction of a coin so it follows the price very closely.   You can put it in your TFSA or RRSP.    They hold the coins through Gemini, I believe, in cold storage so they are backed to the real thing.   This gets u exposure to the asset.  Yes u don't hold the real deal coin with the keys I get it,  But you won't have to worry about losing your keys or worry about transferring to a wallet and all that.",
        "created_utc": 1630366928,
        "id": "hazr769",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1630395728.0
    },
    {
        "author": "Mattie725",
        "body": "How so? In short, it's just disabling and enabling activation keys or IP addresses.",
        "created_utc": 1628539007,
        "id": "h8bpnzy",
        "score": 3,
        "subreddit": "stocks",
        "created": 1628567807.0
    },
    {
        "author": "funny_3nough",
        "body": "Two HUGE issues IMO are STILL no vwap on the chart. For years traders have been asking. Drives me crazy. And they cap your limit orders at 50% over current price. If I'm trading a volatile equity or planning a long term buy and hold and want to get my limit order in now, why can't I? If they changed those two things it would be so much better. The price volume is solid (although it changes when you adjust size of your chart) and trade armor in ATP lets you do reasonably quick trades. For anyone who's looking for a good option and doesn't mind a modest monthly fee - my buddy swears by Lightspeed for the hot keys and overall quick execution. He makes it look easy to make 80k in a morning so the platform definitely works.",
        "created_utc": 1630416556,
        "id": "hb1zguf",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630445356.0
    },
    {
        "author": "dreamsushi",
        "body": "the weekend has gone by too fast::(( extended the vacation an extra week because fuck it, going to laptop trade this week I guess lmao \n\nanyway what is your favorite place to eat in the keys?? dont say fish tales, conch republic or sloppy joes",
        "created_utc": 1627837207,
        "id": "h7by4hr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627866007.0
    },
    {
        "author": "FatDickGreg",
        "body": "For me it’s drugs, money, cellphone, keys, and throwing stars. Then I spend the entire night fucked up fiddling with all my pockets trying to find said drugs, money, cellphone and keys, hoping I don’t get attacked by a rival dojo",
        "created_utc": 1629937387,
        "id": "had2lgl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629966187.0
    },
    {
        "author": "AlsoScaredofinternet",
        "body": "Nice!  I love listening to the keys",
        "created_utc": 1630450514,
        "id": "hb48ym2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630479314.0
    },
    {
        "author": "quarantrader",
        "body": "Give me the keys. I'll honor you",
        "created_utc": 1627870137,
        "id": "h7dsfch",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627898937.0
    },
    {
        "author": "Itsboomhomie",
        "body": "I picked up a ducky one 2 skyline with cherry brown switches. Was going to go with blues, but I don't need all that noise, lol. \n\nIt's 100%, since I use the numpad, print screen, and delete keys a lot. But now I want a 70%. Looking for something with hot swap switches since I hate soldering and don't really have time like that.",
        "created_utc": 1628278365,
        "id": "h7z02xa",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1628307165.0
    },
    {
        "author": "duckduckseahawk",
        "body": "Put Remy in charge of the keys next time",
        "created_utc": 1628902788,
        "id": "h8utrhk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628931588.0
    },
    {
        "author": "InfinitumSapientiae",
        "body": "Short AMC.  They will be handing their landlords the keys fairly soon.",
        "created_utc": 1628742521,
        "id": "h8m86mf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628771321.0
    },
    {
        "author": "BillionairePhil",
        "body": "Few keys factors for Value Investors: Intrinsic Value, Moat, Margin of Safety &amp; Good Management. This Warren Buffett Video is useful.  \nhttps://www.youtube.com/watch?v=aVdSw1GPAeI&amp;t=5s",
        "created_utc": 1628980771,
        "id": "h8yq8nu",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1629009571.0
    },
    {
        "author": "fatnigmongolfagotcuz",
        "body": "\"Just grab your keys, let's go\"",
        "created_utc": 1628474574,
        "id": "h88mgk2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628503374.0
    },
    {
        "author": "CampaignNo1365",
        "body": "It sounds like you play on console. I've played on PC forever and its always been digital so maybe I'm used to it. I usually just buy third party keys for super cheap. If you play a game lot its not really a waste of money at all IMO.",
        "created_utc": 1628540282,
        "id": "h8bsocn",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628569082.0
    },
    {
        "author": "n8walker_ger",
        "body": "And throw the keys away",
        "created_utc": 1629397017,
        "id": "h9k92v9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629425817.0
    },
    {
        "author": "mmmTurkeyLeg",
        "body": "Current super computers would take 100+ years to factor out crypto keys for a wallet based on publicly available information stored on the blockchain. \n\nIf quantum computers reach their projected potential in 20 years, they’ll be able to factor out your keys nearly instantly. \n\nChanges need to be made to make keys resistant to quantum computers. IMO Bitcoin will move too slow and be made worthless by quantum computers. I think the ethereum community and others will move fast enough to make their protocols resistant to quantum computers.",
        "created_utc": 1630184934,
        "id": "haq7vis",
        "score": 2,
        "subreddit": "investing",
        "created": 1630213734.0
    },
    {
        "author": "Bindi93",
        "body": "I can sell grapes to a vineyard, Chicken to the colonel, Keys to a custodian, Speed to turbo",
        "created_utc": 1630186708,
        "id": "haqboos",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630215508.0
    },
    {
        "author": "Historical-Egg3243",
        "body": "black keys are awesome live, agree",
        "created_utc": 1630196242,
        "id": "haqv6j6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630225042.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 18th of August\n\n\n\n## Upcoming events for Wednesday, August 18th\n\n - Expected earnings:\n\n  ADI, APOP, BBWI, BLRX, CAAP, CSAN, CSCO, CTIB, DGLY, DLO, DQ, EAT, EBR, EBR.B, ELTK, GRIL, GRIN, HEPA, HOOD, IMNM, INDP, JBSS, KEYS, KLTR, LITB, LITE, LOW, MBT, METX, NCNA, NNDM, NVDA, OSIS, PLCE, PNRG, PTNR, RRGB, SFL, SINT, SMED, SNPS, SPTN, SQM, STG, TGT, TJX, TUYA, UAMY, UUU, VINP, VIPS, VNET, VSCO, WB, WLMS, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, APO, AVA, BG, BWXT, CLPR, CVX, DFS, DHT, GFF, HE, HTBI, LFUS, MAC, MAV, MHI, MSFT, NLSN, NRP, PHD, PHT, RMD, SBSI, SUNS, SWCH, VCIF, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.890%)\n    - Building Permits (consensus: 1.610M, previous: 1.594M)\n    - Building Permits (previous: -5.3%)\n    - Crude Oil Imports (previous: -0.796M)\n    - Crude Oil Inventories (consensus: -1.055M, previous: -0.447M)\n    - Cushing Crude Oil Inventories (previous: -0.325M)\n    - Distillate Fuel Production (previous: 0.008M)\n    - EIA Refinery Crude Runs  (previous: 0.277M)\n    - EIA Weekly Distillates Stocks (consensus: 0.276M, previous: 1.766M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.2%, previous: 0.5%)\n    - FOMC Meeting Minutes\n    - Gasoline Inventories (consensus: -1.671M, previous: -1.400M)\n    - Gasoline Production (previous: -0.190M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Housing Starts (consensus: 1.600M, previous: 1.643M)\n    - Housing Starts (previous: 6.3%)\n    - MBA 30-Year Mortgage Rate (previous: 2.99%)\n    - MBA Delinquency Rates (previous: 6.38%)\n    - MBA Mortgage Applications (previous: 2.8%)\n    - MBA Purchase Index (previous: 252.0)\n    - Mortgage Market Index (previous: 754.8)\n    - Mortgage Refinance Index (previous: 3,684.3)\n\n## Upcoming events for Thursday, August 19th\n\n - Expected earnings:\n\n  ACY, AMAT, ARCE, ATGE, AZRE, BFRA, BILI, BJ, BLND, BTBT, BVXV, BZUN, CALT, CANG, CATO, CBMB, DAO, DESP, EL, EYES, FEDU, FLGC, FRSX, FTCH, GHG, GSMG, HMG, HMLP, HOLI, HUIZ, INM, ISIG, KOSS, KSS, LFVN, LIZI, LYTS, M, MNSO, MSGS, MYSZ, NM, NNA, NTES, NUZE, OIBR.C, PALI, PAQC, PAX, PDEX, PFGC, QFIN, QIWI, RDHL, REDU, ROST, SINO, SJ, SQBG, STVN, SUPV, TPR, TUEM, VEON, WOOF, WVFC, YRD, YTRA, ZEPP, ZIVO\n\n - Ex-div:\n\n  ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ASGI, AWP, BBSI, BBWI, CBFV, CCOI, CGNX, CMI, CORE, CTSH, DEX, EVRG, FDBC, FSS, FWRD, GSK, HCI, HCSG, HMPT, HNI, HSBC, HSY, IBOC, IEP, IGR, MCHP, MCO, MGPI, MGU, MIXT, MNRL, MTRN, MTX, NMRK, OBNK, OTIS, PBI, PCF, PCSB, PFC, PRI, PUK, RPRX, RTX, RXN, SBLK, SNA, SWM, TEL, THQ, THW, TKR, TTEK, UMPQ, USLM, USPH, WBA\n\n - Economic events and announcements:\n\n    - 30-Year TIPS Auction (previous: -0.040%)\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.055%)\n    - Continuing Jobless Claims (consensus: 2,800K, previous: 2,866K)\n    - Initial Jobless Claims (consensus: 363K, previous: 375K)\n    - Jobless Claims 4-Week Avg. (previous: 396.25K)\n    - Natural Gas Storage (consensus: 49B, previous: 49B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 21.9)\n    - Philly Fed Business Conditions (previous: 48.6)\n    - Philly Fed CAPEX Index (previous: 41.20)\n    - Philly Fed Employment (previous: 29.2)\n    - Philly Fed New Orders (previous: 17.0)\n    - Philly Fed Prices Paid (previous: 69.70)\n    - US Leading Index (consensus: 0.8%, previous: 0.7%)\n\n## Upcoming events for Friday, August 20th\n\n - Expected earnings:\n\n  AHPI, AIM, ATXI, AVCO, AZRX, BHAT, BKE, BRFS, BRID, CARV, CDZI, CIDM, CIG, CJJD, CNET, CNNB, CREG, CXDC, CYTH, DE, DSS, ENVB, FL, FRD, FSEA, FTFT, GASS, GB, GLG, GNLN, HUSA, INTG, JP, KULR, MBOT, MSN, MVST, MYMD, NXTD, OSAT, PBFS, PED, PFSW, POLA, PTIX, PVL, QLGN, RLX, RVP, SCX, SFUN, SGRP, SHG, SNFCA, TAIT, TAYD, TDAC, TKAT, TTNP, UI, UNAM, VERY, VWE, WORX\n\n - Ex-div:\n\n  AATC, AEIS, AFT, AIF, AOMR, ATO, BGH, DLX, DX, FGB, FHB, FMN, GAIN, GLAD, GOOD, GSL, HL, HVT, HVT.A, IGIC, JBT, LAND, LTC, MFD, MMM, NATH, NCMI, NLOK, OGN, R, RDN, TIPT, TSCO, UGP, UPS\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.3K)\n    - CFTC Copper speculative net positions (previous: 29.0K)\n    - CFTC Corn speculative net positions (previous: 321.6K)\n    - CFTC Crude Oil speculative net positions (previous: 400.4K)\n    - CFTC Gold speculative net positions (previous: 168.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -13.3K)\n    - CFTC Natural Gas speculative net positions (previous: -143.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 23.1K)\n    - CFTC Silver speculative net positions (previous: 24.5K)\n    - CFTC Soybeans speculative net positions (previous: 122.4K)\n    - CFTC Wheat speculative net positions (previous: 43.6K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 387)\n    - U.S. Baker Hughes Total Rig Count (previous: 491)\n\n^^^^2021-08-18",
        "created_utc": 1629280814,
        "id": "h9e5h7d",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1629309614.0
    },
    {
        "author": "bonejohnson8",
        "body": "I bet they scan WSB for useful CUSIPs all the time. All the time I see people posting their favorite SEC central index keys.",
        "created_utc": 1628635747,
        "id": "h8guj4j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628664547.0
    },
    {
        "author": "CampaignNo1365",
        "body": "I personally buy most of my games as keys from 3rd party places such as Kinguin to save money. \n\nI will admit that I dont have a good understanding on NFT, so maybe I am incorrect in my thinking about this: if gamestop implements a NFT to buy back digital games, do those games have to be purchased directly from Gamestop to begin with? If they do, it seems like you would be buying a game from them at retail and then selling the game back to them down the line for absolute pennies on the dollar (just like they would offer you for physical game copies in store). One might just be better off buying the game already discounted at a third party website such as Kinguin or G2A. \n\nThe GME cult people will downvote any bearish settlement lol",
        "created_utc": 1628541878,
        "id": "h8bwfpf",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628570678.0
    },
    {
        "author": "thySilhouettes",
        "body": "I hate the Amazon drop off because they provide 0 resources for their people on our complex. They don’t have access keys, so they have to wait to be let in. Then, they don’t even get access to the mailroom, they have to run around 4 buildings delivering packages. Our complex is a bit confusing too, so they have to also spend time learning the layout, otherwise they’ll spend even more time. 50% of the time the packages get dumped on the 1st floor of one building and sit there for weeks.",
        "created_utc": 1628702041,
        "id": "h8k0p1n",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628730841.0
    },
    {
        "author": "NrdRage",
        "body": "Been there.  I farmed that shit out, was worth throwing money at the problem rather than DIY'ing it, even though my wife got on me about paying someone when I could do it blindfolded\n\n&amp;#x200B;\n\nOn the lock front, I'm stuck with August because the property management company that I pay to \"Higgins\" (maintain, clean, stock the fridge before we transition to them, etc.) my various properties when I'm not in them which, for most of them, is most of the year, August is the only smart lock company they use and I don't want hard keys floating around.",
        "created_utc": 1628786077,
        "id": "h8o7w1q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628814877.0
    },
    {
        "author": "Casino_Insider",
        "body": "You should be able to find out again in whatever app you used, otherwise just the private key is enough but the seed phrase allows to create more than one account under the same phrase...\n\nThe way I usually explain it is the app (like MetaMask) is a pair of pants, the seed is the wallet, the private keys are your bank cards and the public keys are your bank account numbers. You can have as many bank cards in your wallet as you want and you can carry your wallet in whatever pair of pants you're wearing that day.\n\nIf you manage to get your private key then it's like carrying just your bank card in your pants.",
        "created_utc": 1628977468,
        "id": "h8yjdkw",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1629006268.0
    },
    {
        "author": "wREXTIN",
        "body": "You can transfer off CB to your wallet of choice if you want the keys, as most do. \n\nAlthough u do have fees, heavy fees lol",
        "created_utc": 1630204012,
        "id": "hara6w9",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1630232812.0
    },
    {
        "author": "Rozay662",
        "body": "Jerome lost the keys for his tool shed. We'll get em next time.",
        "created_utc": 1628003641,
        "id": "h7k6zr4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628032441.0
    },
    {
        "author": "Montyprice7206",
        "body": "Considering it’s sinking into the ocean it’ll be the only way to get around the keys soon",
        "created_utc": 1627866091,
        "id": "h7dkr52",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627894891.0
    },
    {
        "author": "socalquest",
        "body": "The payouts for closed-end funds are fairly consistent if you buy the right ones. The keys are quality income producing assets and sponsor's reputation in the industry. \n\nIn a down market you get to buy more at a discount with higher yields. \n\nDrawdowns/corrections are just temporary, and is an opportunity to increase your income and share count.",
        "created_utc": 1627835064,
        "id": "h7btki7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627863864.0
    },
    {
        "author": "TreeHugChamp",
        "body": "3 dds? How have the stock faired since? I’ve been bearish on Chinese stocks since Ma sold out last year and bragged about this being the time to take companies public. It doesn’t take much common sense to tie in all the different keys to understand what is going on. Chinese stocks might see a small resurgence if bond yields go up, but will tumble hard if bond yields go down.",
        "created_utc": 1627847835,
        "id": "h7cklx2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627876635.0
    },
    {
        "author": "BeerPizzaGaming",
        "body": "I used to like Macy's.  I m in a wait and see approach with them.    \nThe keys to Macy's being a winner for me are:  \n1) Negotiating down rents.  \n2) Increase their product assortment and maintain slightly better on hand inventories to avoid customers from walking.  \n3) Everyday at market pricing (atleast online) and then have actual sales.   Their sales gimmick worked years ago but not in todays internet ago.  \n4) Clean up the appearance of their stores and make them much easier to shop.  Current layouts are horrible.  \n5) Vendor paid shopping spaces need to be enhanced and grown.  This is what many others (Dicks and Best Buy) have done and it basically gets the manufacturers to prepay the overhead (rent and utilities) and despite slightly decreased margins, you know it is all profit.  Plus it makes the vendors vested in the operations.     \n\n\nMy immediate concern is their assortment has gone much lower end and it appears they are having greater difficulty maintaining inventory levels compared to competitors.  This is not because of sales, but because they are lower on the manufacturers priority list, especially in those items where they are merely the conduit for online sales.",
        "created_utc": 1628918381,
        "id": "h8vmom1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628947181.0
    },
    {
        "author": "Yo_Biff",
        "body": "It's not so much backed by \"you don't know who\", as it is backed by everyone in the distributed ledger.  No one holds the keys, yet everyone (miners and nodes) holds the keys.  The majority has to verify every single block is valid for a new block to be added.  It's backed by an ever increasing difficulty in a growing network.\n\nA 51% Attack is unlikely to occur within a healthy large scale blockchain with a high hash rate.  Now, there was a one month period seven years ago where 51% of the Bitcoin hash rate was controlled by one mining group, but think how much is grown in 7 years.  Plus, there was no attack, as the mining group was vested in supporting the blockchain.  They self limited and the community today has a loose agreement to limit.\n\nEstimates today put the cost of a 51% attack by a malicious actor around $5.6 billion for the hardware alone.  That would also depend on the availability of said equipment.  There's another way to do it with synthetic hash rates and mining pools, but the general consensus is this method is highly unstable and would last mere minutes.  Other smaller networks have been attacked, but, if I understand it correctly, this has typically resulted in more of a DoS style outcome rather than a corruption of the chain itself.  I'm sure some smaller blockchains have been successfully and fatally disrupted.  That all being said, yes, a 51% Attack on any high profile token would be devastating to crypto as a whole.\n\nAnalogs to being locked out of a wallet or defrauded by some means can/do happen with fiat currencies everyday.  I mean there's just so many Nigerian princes out there...\n\nThe good news personally is if you take my initial investment dollars (which I've already recouped) I'm up about 1700%.  Definitely no skill, intelligence, or savvy.  Just dumb luck.",
        "created_utc": 1628738528,
        "id": "h8m1lf9",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1628767328.0
    },
    {
        "author": "Jaloosk",
        "body": "At 9am yeah. Article is old.\n\nhttps://www.reuters.com/technology/defi-platform-poly-network-reports-hacking-loses-estimated-600-million-2021-08-11/\n\nYou don’t own the keys, you don’t own the coin.",
        "created_utc": 1628706289,
        "id": "h8kas4c",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1628735089.0
    },
    {
        "author": "Casino_Insider",
        "body": "There exists game keys resellers and they already announced they're developing their platform to do it too, so people won't be downloading the games from them but they can offer the codes to download the games on other platforms and set their own sales.",
        "created_utc": 1628540041,
        "id": "h8bs3sq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628568841.0
    },
    {
        "author": "justsomeitguyhere",
        "body": "As an IT person, I do not, this is like someone having a chalkboard on the public road and a kid drawing a penile shape on it.\n\nThere is no reason why this devices should not be password protected or require a key (as in certificate and keys) to change",
        "created_utc": 1628366149,
        "id": "h83a9wd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628394949.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\r  \n\r  \n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy.   \r  \n\r  \n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\r  \n\r  \n3. If you want tax free capital gains, you can buy BTCX, ETHX or BTCC in your TFSA. With that said, you do not truly own crypto with any of those because they are a fund; and therefore, you own shares of the fund and not the asset itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your crypto\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not insured. Big risk, but tax free/deferred in a TFSA/RRSP.\r  \n\r  \n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\r  \n\r  \n5. Unfortunately, with BTCC, ETHX, and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (crypto) and simply run the fund with the crypto backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\r  \n\r  \n6. In regards to taxes, if you truly own the asset (crypto), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\r  \n\r  \n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. \r  \n\r  \nNow, here are some general points of interests to help you understand cold storage wallets:\r  \n\r  \n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\r  \n\r  \n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\r  \n\r  \n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \r  \n\r  \n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\r  \n\r  \nDisclaimer: I am irresponsibly long Bitcoin/Ethereum and I sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1628437431,
        "id": "h86h1jt",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1628466231.0
    },
    {
        "author": "Noomunny",
        "body": "Worked for me. I just log in to Fidelity and let my toddler smash the keys and last I checked she’s consistently outperfohgawdimruined",
        "created_utc": 1629080872,
        "id": "h93wwfn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629109672.0
    },
    {
        "author": "murray_paul",
        "body": "&gt; How do you feel about their valuation and about their business plan? There has been an incredible amount of speculation that they may be implementing a method of making digital games Non-Fungible in order to retain value of the product and increase revenue stream for the vendor and the developer.\n\nIf existing platforms (Steam, Epic, XBox, PlayStation) and existing publishers wanted this to happen, it already would have happened. \nAllowing resale of digital games isn't technically difficult, it just isn't in the interest of anyone involved in the process. Steam already have trading of digital assets, if they wanted to extend that to trading steam keys for games, and publishers signed on, they could do it themselves immediately.\n\nBut why would the publishers want that? They have eliminated the second-hand market, which is making them more money. They have no interest in reversing that.\n\nAnd GME can't 'do' it on their own, they don't have any rights to the games, the publishers do. \n\nThey are offering a (vapourware) technical solution that isn't needed to a market that doesn't want it.\n\nIf a brand new company appeared, without the GME name or history, suggesting they were going to make money with their NFT digital game resales, how much do you think they would be worth?\n\nTheir valuation is based entirely on crossing the meme streams of short squeeze and blockchain.",
        "created_utc": 1629289342,
        "id": "h9egoj8",
        "score": 1,
        "subreddit": "investing",
        "created": 1629318142.0
    },
    {
        "author": "BigWesKappa",
        "body": "DDOG LEAPS are the keys to the lambo, thank me later",
        "created_utc": 1629812712,
        "id": "ha5su5s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629841512.0
    },
    {
        "author": "PrincPaco",
        "body": "Take a trip to Miami, maybe Key West. Shit in the Keys you can just find the square grouper on the shore.",
        "created_utc": 1629564939,
        "id": "h9t2hyk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629593739.0
    },
    {
        "author": "Seekingaloha",
        "body": "Gas was super expensive. Over $5-$7 a gallon (Cali) so a lot of people wanted electric cars and that industry took off from pipe dream. Oil industry was booming. Commodities in general did well. Gold got to 2k an ounce. It doesn’t sound like a lot now because we have more or less stayed in touch with that but it was a big jump. (Learn: once things go up, they kind of don’t come back down in any real sense. Maybe by 30%. But not all the way back down.) People were going into abandoned homes and taking all the copper plumbing and wires to resell. They even started taking the huge aluminum poles holding up highway lights. (They’re doing the same thing now with catalytic converters. Should tell you something). They even stole a metal sculpture we had in a park up the street. \n\nSuicides for 50 year olds skyrocketed. Age discrimination is real. Super real during a recession. \n\nFacebook got super popular then. You’d see people posting about offers of “gleaning” fields and pictures of thousands going out. Don’t know if it was true or not. Occupy Wall Street took off because of FB. It was way smaller than blm though. The social media companies got better at manipulating people since then. There was also a “move your money” movement-pull it from big banks to credit unions. It wasn’t successful. Banking is sticky apparently. Even if you have a shitty bank. Lots of “friends” on FB gaming the system back then too thought they were being smart (like they are with rent moratoriums now) playing cash for keys, etc. thinking they would let their house go back when they didn’t need to and they’d come out ahead. The only people that come out ahead in these scenarios are the people on the winning side of asset distribution. \n\nForeclosures yes…but oddly after a pretty short while you couldn’t buy them. Obama, the banks and hedge funds made a deal for them to be bought en masse. Banks just wouldn’t talk about short offers anymore, so not a lot of people benefited from these affordable assets except Blackstone (Blackrock? Can’t keep those fuckers straight) People in new build areas suffered with builders going bankrupt and leaving developments mostly not completed. Even with a 800 credit score and 20% down it could be hard to buy. \n\nThe election gave people hope, but Obama didn’t have the justice department prosecute a single fucking crooked soul except for the Wamu guys. Within a year Wall Street was making huge bonuses again. \n\nCredit lines were cut. Thought you had a 20k credit limit and we’re paying your bills? Didn’t matter. Banks suddenly cut your limit to your balance (just like Wells Fargo just did). Worsened your credit score, inhibiting your ability to leverage into a cheap home. \n\nThings recovered. Mostly people forget. Some smarter people have lived all these years since like you can’t trust anyone still and be ready to cover your ass. The FIRE movement was born-with emphasis on FI part of it. Prepping got real and more mainstream. \n\nI can’t remember any more anecdotes but there were a lot on WSB with GME when it began. People recounting what their parents went through, so it had a generational effect. I was young, but not as young as you I guess I remember these things. I also talked to my great grandma about the depression a lot when I was little. I was intrigued for whatever reason. She was young but had stories. Rye whiskey was drunk more than water after the WWI. (Michael Pollen?) The army had an excess of alcohol fuel after the war they pushed on the population. During the depression alcoholism skyrocketed.! Now it’s fentanyl and dope. A high population is controllable with every generation. Same patterns get repeated over and over again.",
        "created_utc": 1629656363,
        "id": "h9xqzzu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629685163.0
    },
    {
        "author": "sneakyanon5000",
        "body": "Keys to today!\nPowpow says tapering = market goes down\nPowpow says transitory = market goes up\n\nFed is hawkish = market goes down\nFed is doveish = market goes up",
        "created_utc": 1630062422,
        "id": "hajirjs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630091222.0
    },
    {
        "author": "69PutsOnYourPuts69",
        "body": "I suppose I could get the sax tuned up this week. Needs some keys adjusted and the pads are cracked. And prepare for phone quality recording lol",
        "created_utc": 1630415069,
        "id": "hb1wdw0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630443869.0
    },
    {
        "author": "TamarackThomas",
        "body": "Some of the keys to $GCEH are the drop in replacement and off take agreement. Something like 35m float and they may (but I don't think they will have to) have an offering to service debt or expansion. Personally been buying it up since .44 before RS and buying more every week since. \n\nEV's may be the \"sexy\" green plays but structurally companies like $GCEH are going to bridge the transition to cleaner energy. They've been building what they have for some time and I don't see them being acquired personally. Because of the problems mining enough rare earth's to battery every damned thing on the planet this kind of diesel could be the standard for farming and shipping going forward.\n\n A company with largest refinery on West coast with rotational, non food competing cash crop for farmers, located in the 5th largest economy on the planet that is mandating lower emissions in the state as well as use of biodiesel. It is near foolhardy to not be in on this play. IMO.",
        "created_utc": 1630421038,
        "id": "hb29scu",
        "score": 1,
        "subreddit": "investing",
        "created": 1630449838.0
    },
    {
        "author": "PlsDontNuke",
        "body": "Nah people usually leave the keys in",
        "created_utc": 1630353541,
        "id": "haywj7x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630382341.0
    },
    {
        "author": "Zuckuss18",
        "body": "Weird.  I've got bitcoin in my cold wallet.  I have also invested in bitcoin ETFs in my TFSA.  Is there a fee for the ETF? A small one.  Is it easier for most people to access than dealing with a cold wallet? Absolutely, you pay for the convenience.  Yeah yeah, not my keys not my coins but the ETFs are protected by Canadian laws and insurance.  You can absolutely have bitcoin in your TFSA.",
        "created_utc": 1630347481,
        "id": "hayhvw0",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1630376281.0
    },
    {
        "author": "Royal_J",
        "body": "warcraft is bleeding so many players to ffxiv they had to stop selling ffxiv keys so they could up server capacity",
        "created_utc": 1630341762,
        "id": "hay42pp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630370562.0
    },
    {
        "author": "KumichoSensei",
        "body": "I feel like Tableau Prep would make the \"Tableau Problem\" worse.\n\nBusiness analysts finding datasets with no documentation, then creating metrics and visualizations that are completely wrong due to:\n\n- Taking an average of an average\n- Summing distinct counts\n- Joining tables without understanding primary keys\n\nEventually you get to a point where different teams use the same metrics but the metrics are completely different from one another. Giving them access to the ETL layer would just make things 100x worse.\n\nLooker tried to solve this by offloading the metric definition layer to data engineers and not analysts, but data engineers hate having to learn Looker specific language, so companies keep choosing Tableau.",
        "created_utc": 1630363054,
        "id": "haziqwq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630391854.0
    },
    {
        "author": "redthatstuf",
        "body": "Not your keys not your coins.  Get a hardware wallet,.. at the very least metamask.",
        "created_utc": 1630260154,
        "id": "hatw7of",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630288954.0
    },
    {
        "author": "BullDogg666",
        "body": "Don’t buy crypto on RH, or any broker that you don’t own the keys.",
        "created_utc": 1630249859,
        "id": "hat7dgd",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630278659.0
    },
    {
        "author": "RandoStonian",
        "body": "&gt; but can you ELI5 how the adoption of said technology should push up the price of a coin like BTC?\n\nOne example might be the ION 'decentralized identity' system that Microsoft released the open-source code for recently. \n\n&gt;Decentralized identity networks for example - like single-login services that Google or Facebook provide, except you control the account keys, and can still use the service even if you get banned from Facebook or whatever.\n\n&gt;Or graduation credentials, or a digital driver's licenses you can get instantly verified as valid while on vacation in Europe from the US. That's just some of the non-money-moving examples of what's already being built on top of these networks.\n\nOr maybe instead of giving your dentist office your driver's license to photocopy (which they'll probably eventually improperly dispose of, if past history is any indication), you use something an app on your phone to authorize your dentist to view your driver's license on the blockchain (essentially). Since it's on the blockchain, you don't need to worry that say, your identity info is going to become inaccessible if Amazon legal decides Amazon hosting servers can't send data to your locale anymore (maybe a country you're visiting).\n\nWhen they want to look view the data, the key you gave them lets them view your license. When you stop being their customer, their key stops working, so you don't need to worry about your personal data being mishandled and lost.\n\nWhat happens with these networks is identity providers run ION nodes. Making updates on the ION network are essentially free, but in order to borrow the BTC network's security guarantees, ION needs to pay the BTC network in BTC for every letter they want to write to the ledger. Thousands of people can make changes super quickly and for essentially free on ION, and then at set times, the ION nodes will write a 'checkpoint' to the bitcoin network's public ledger. \n\nOnce that checkpoint is there, anyone on earth can check the public BTC blockchain and use math to verify that a particular identity info change from an ION node is valid and can be trusted. Anyone can pull up data from any ION node on earth, compare it against the checkpoints on the BTC network, and verify \"yup, this is all legit, no hackers inserted fake changes to try and fool us.\"\n\nThere's a *lot* of really interesting security stuff that becomes easy using the public-private keypair that comes 'free' to every crypto-account user.\n\nAnother example might be Microsoft's anti-piracy system, 'Argus' that runs on top of ETH network and is aimed at being used for incentivizing piracy reporting.",
        "created_utc": 1630260547,
        "id": "hatx4w5",
        "score": 1,
        "subreddit": "investing",
        "created": 1630289347.0
    },
    {
        "author": "OUEngineer17",
        "body": "While it's good information to know how the ADRs work with regards to China, this feels a bit like the \"not your keys, not your coin\" thing preached over and over on other subs.\n\nAny company that operates in, with, or even near China will have significant risk, but I'm not going to not own SOXX because China might invade Taiwan and take over TSM or sell any of the best large cap US growth companies in the world because they have ties with China. To me, BABA, in particular, looks worth the risk, so I'll continue to hold until it does not.",
        "created_utc": 1628111534,
        "id": "h7q58l3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628140334.0
    },
    {
        "author": "DayLate10kShort",
        "body": "In 2024 we all know who gonna come back and say \"I gave him the keys to a beautifu,  huge, perfect Lamborghini and he full throttled it into a brick wall during his nap\"",
        "created_utc": 1627961146,
        "id": "h7if2uv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627989946.0
    },
    {
        "author": "whats_a_hokie",
        "body": "Lmfao at his post yesterday asking about using ant farms to generate encryption keys",
        "created_utc": 1627914391,
        "id": "h7fkke3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627943191.0
    },
    {
        "author": "Scion_capital_intern",
        "body": "And they are holding the 1T infrastructure bill hostage until they get their 3.5T political bill passed.... \n\nWhen do we hand the keys over to Xi? This is embarrassing.",
        "created_utc": 1627903863,
        "id": "h7f20c9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627932663.0
    },
    {
        "author": "JimboFen",
        "body": "I'm looking at the plans behind the 3.5T bill and can't see anything to do with China besides a possible tax on Chinese goods. I'm genuinely curious, what do you mean about handing the keys over to Xi?",
        "created_utc": 1627905162,
        "id": "h7f3v3a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627933962.0
    },
    {
        "author": "kaocwedelgnitoille",
        "body": "Have you seen this guys (brilliant-keys) postings? He is shoving the stock down everyone’s throat on multiple pages. I personally won’t be touching it. I’m all for us little guys doing well and hope it does well for all involved. Just seems sus to me",
        "created_utc": 1627853245,
        "id": "h7cvxa0",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1627882045.0
    },
    {
        "author": "demzrose",
        "body": "Keys words : \" my parents gave me $125k \" so as far as investing in options it will turn into \" my parents donated $125k\"",
        "created_utc": 1628076751,
        "id": "h7nz8ru",
        "score": 1,
        "subreddit": "options",
        "created": 1628105551.0
    },
    {
        "author": "HammertonMili",
        "body": "I knew for the moment when he pulled out the keys and it was actually a key and not a remote. DD on HOOD all time high",
        "created_utc": 1628385052,
        "id": "h84b39x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628413852.0
    },
    {
        "author": "SgtKevlar",
        "body": "To answer your question: NVDA has been demonstrating the classic signs of a bull flag the last week. If you broaden out the chart a little wider, it’s showing the signs of a cup and handle pattern. Both of these are bullish signs. Friday was potentially the start of a breakout, but there’s strong resistance at around $206. If it breaks above that resistance, you can probably expect it to jump quite a bit. \n\nAn investment firm (I can’t remember which one) upgrade their price target to $245. If we examine the options market, there was an unusually large, bull call sweep at $245, which suggests a whale out there is VERY confident in a steep rise in price in the near term. \n\nThat said, the stock market is completely random in the short term. It moves like a drunk searching for his keys by lamplight. Nobody can say for certain what will happen and we’re all just trying to read the same tea leaves to predict the future.",
        "created_utc": 1629050360,
        "id": "h922ac4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629079160.0
    },
    {
        "author": "Coda70",
        "body": "Ah. Yes the drunken racism would certainly spoil the vibe. I used to fish a lot in the Florida keys which snapper heaven. Shooting hog fish with my spear gun and catching lobster with a tickle stick and net. So fun. And more a blue state vibe down there",
        "created_utc": 1628659285,
        "id": "h8i2zwv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628688085.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "A lot of people are investing in crypto-ETFs without realizing some issues such as the fact that you will not own actual crypto. Also, you will not be insured if anything happens to the ETF. That is a pretty big risk even though they can be held in a TFSA while being subjected to big swings during the weekend. Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage wallets, taxation, and the cheapest method of accumulating/procuring it in Canada:\r  \n\r  \n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can easily confirm their legitimacy and I have been stacking free Satoshis for a few years now.   \r  \n\r  \n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\r  \n\r  \n3. If you want tax free capital gains, you can buy BTCX, ETHX or BTCC in your TFSA. With that said, you do not truly own crypto with any of those because they are a fund; and therefore, you own shares of the fund and not the asset itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your crypto\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not completely insured. Big risk, but tax free/deferred in a TFSA/RRSP.\r  \n\r  \n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your crypto\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\r  \n\r  \n5. Unfortunately, with BTCC, ETHX, and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (crypto) and simply run the fund with the crypto backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\r  \n\r  \n6. In regards to taxes, if you truly own the asset (crypto), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\r  \n\r  \n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger as well as the decentralization of this digital store of value combined with its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. \r  \n\r  \nNow, here are some general points of interests to help you understand cold storage wallets:\r  \n\r  \n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\r  \n\r  \n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\r  \n\r  \n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \r  \n\r  \n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\r  \n\r  \nDisclaimer: I am irresponsibly long Bitcoin/Ethereum and I sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1629040045,
        "id": "h91dphn",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1629068845.0
    },
    {
        "author": "Casino_Insider",
        "body": "They announced they'll launch a digital marketplace to resell game keys that's already common in the PC market space and we've seen Humble Bundle offering console games bundles in the past the same way they offer PC Games.",
        "created_utc": 1628539535,
        "id": "h8bqwp6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628568335.0
    },
    {
        "author": "MachineGunKel",
        "body": "I would say what he is doing isn't really a prediction we can assess (and that is probably by design). If you read the book Superforecasting - and you all should - Tetlock lays out the necessary elements of a prediction so that we can asses their accuracy. One of those keys is time because it gets around the exact discussion being had \"Burry has predicted 11 of the last 2 recessions.\"\n\nIf he put a time limit and a confidence level to these we could actually start to score them. Instead he just says \"X will occur,\" and recycles it until X does occur, so he's both right and wrong. I have to assume he is doing this intentionally and he is by no means unique but it makes evaluating his 'expertise' incredibly hard.",
        "created_utc": 1629208488,
        "id": "h9agigs",
        "score": 1,
        "subreddit": "investing",
        "created": 1629237288.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 17th of August\n\n\n\n## Upcoming events for Tuesday, August 17th\n\n - Stock splits:\n\n    - LEMLF @ **1:10**\n    - MNNFF @ **1:5**\n    - PTSI @ **2:1** (Payable date: 08/16/2021)\n\n - Expected earnings:\n\n  A, ACXP, AENZ, AFMD, AIT, ALC, AMCR, ARKR, AUVI, BBIG, BBL, BDL, BEST, BON, BTCM, BYFC, CDK, CHSCP, CMCM, COGT, CREE, CRESY, CRMT, CVM, CWCO, DNUT, ECC, FLNG, FORTY, GDS, GNPX, GOGL, GRCL, GRUB, HCDI, HD, HUYA, INST, JAX, JKHY, LX, LZB, MNDY, NETI, NOAH, NRBO, NVIV, OB, ONE, OZON, PINC, PRAX, QUIK, REE, RERE, RHE, RVPH, SE, SRNE, STNE, SVFD, THCA, TIGR, VTEX, WHLR, WMT\n\n - Ex-div:\n\n  ADM, ADX, AFL, AGO, AMAL, AMOT, BKH, CRD.A, CRD.B, CSL, CXE, CXH, DMB, ED, EQIX, ESXB, FDP, FMBH, FOF, GGB, HRZN, ICL, JACK, L, LDP, MCR, MIN, MMT, MPC, MRO, ORA, PBR, PBR.A, PCAR, PEO, PFLT, PHI, POWL, PSF, PSX, PTA, RNP, RQI, SEM, SGC, SHYF, SSSS, SXC, TGT, UTF, VMC\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -0.816M)\n    - Business Inventories (consensus: 0.8%, previous: 0.5%)\n    - Capacity Utilization Rate (consensus: 75.7%, previous: 75.4%)\n    - Core Retail Sales (consensus: 0.1%, previous: 1.3%)\n    - FOMC Member Kashkari Speaks\n    - Fed Chair Powell Speaks\n    - Industrial Production (consensus: 0.5%, previous: 0.4%)\n    - Industrial Production (previous: 9.80%)\n    - MBA Delinquency Rates (previous: 6.38%)\n    - Manufacturing Production (consensus: 0.6%, previous: -0.1%)\n    - NAHB Housing Market Index (consensus: 80, previous: 80)\n    - Redbook (previous: 16.2%)\n    - Retail Control (consensus: -0.1%, previous: 1.1%)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Retail Sales (consensus: -0.3%, previous: 0.6%)\n    - Retail Sales (previous: 17.98%)\n    - Retail Sales Ex Gas/Autos (previous: 1.1%)\n\n## Upcoming events for Wednesday, August 18th\n\n - Expected earnings:\n\n  ADI, AIHS, APOP, BBQ, BBWI, BLRX, CAAP, CSAN, CSCO, CTIB, DLO, DQ, EAT, EBR, EBR.B, ELTK, GHSI, GRIL, GRIN, HEPA, HGSH, HOOD, IMNM, INDP, JBSS, KEYS, KLTR, LITB, LITE, LOW, MBT, METX, NAOV, NCNA, NNDM, NVDA, OSIS, PLCE, PNRG, PTNR, RRGB, SFL, SINT, SMED, SNPS, SONM, SPTN, SQM, STG, TGT, TJX, TUYA, UAMY, UUU, VINP, VIPS, VNET, VSCO, WB, WLMS, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, APO, AVA, BG, BWXT, CLPR, CVX, DFS, DHT, GFF, HE, HTBI, LFUS, MAC, MAV, MHI, MSFT, NLSN, NRP, PHD, PHT, RMD, SBSI, SUNS, SWCH, VCIF, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.890%)\n    - Building Permits (consensus: 1.610M, previous: 1.594M)\n    - Building Permits (previous: -5.3%)\n    - Crude Oil Imports (previous: -0.796M)\n    - Crude Oil Inventories (consensus: -1.259M, previous: -0.447M)\n    - Cushing Crude Oil Inventories (previous: -0.325M)\n    - Distillate Fuel Production (previous: 0.008M)\n    - EIA Refinery Crude Runs  (previous: 0.277M)\n    - EIA Weekly Distillates Stocks (consensus: -0.217M, previous: 1.766M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.2%, previous: 0.5%)\n    - FOMC Meeting Minutes\n    - Gasoline Inventories (consensus: -1.800M, previous: -1.400M)\n    - Gasoline Production (previous: -0.190M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Heating Oil Stockpiles (previous: 1.208M)\n    - Housing Starts (consensus: 1.602M, previous: 1.643M)\n    - Housing Starts (previous: 6.3%)\n    - MBA 30-Year Mortgage Rate (previous: 2.99%)\n    - MBA Mortgage Applications (previous: 2.8%)\n    - MBA Purchase Index (previous: 252.0)\n    - Mortgage Market Index (previous: 754.8)\n    - Mortgage Refinance Index (previous: 3,684.3)\n\n## Upcoming events for Thursday, August 19th\n\n - Expected earnings:\n\n  AG, AMAT, ARCE, ATGE, BFRA, BILI, BJ, BLND, BTBT, BVXV, BZUN, CATO, COCP, DESP, EL, ELOX, ENTX, EPIX, FEDU, FLGC, FRSX, FTCH, GSMG, HMLP, HUIZ, ISIG, KOSS, KSS, LFVN, LORL, LVTX, LYTS, M, MNSO, MSGS, NM, NNA, NUZE, PAQC, PAX, PDEX, PFGC, QFIN, QIWI, ROST, SJ, SLDB, STVN, SUPV, TPR, TUEM, VEON, VQS, WOOF, WVFC, YRD, YTRA, ZEPP\n\n - Ex-div:\n\n  ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ASGI, AWP, BBSI, BBWI, CBFV, CCOI, CGNX, CMI, CORE, CTSH, DEX, EVRG, FDBC, FSS, FWRD, GSK, HCI, HCSG, HMPT, HNI, HSBC, HSY, IBOC, IEP, IGR, MCHP, MCO, MGPI, MGU, MIXT, MNRL, MTRN, MTX, NMRK, OBNK, OTIS, PBI, PCF, PCSB, PFC, PRI, PUK, RPRX, RTX, RXN, SBLK, SNA, SWM, TEL, THQ, THW, TKR, TTEK, UMPQ, USLM, USPH, WBA\n\n - Economic events and announcements:\n\n    - 30-Year TIPS Auction (previous: -0.040%)\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.055%)\n    - Continuing Jobless Claims (consensus: 2,800K, previous: 2,866K)\n    - Initial Jobless Claims (consensus: 363K, previous: 375K)\n    - Jobless Claims 4-Week Avg. (previous: 396.25K)\n    - Natural Gas Storage (consensus: 49B, previous: 49B)\n    - Philadelphia Fed Manufacturing Index (consensus: 23.0, previous: 21.9)\n    - Philly Fed Business Conditions (previous: 48.6)\n    - Philly Fed CAPEX Index (previous: 41.20)\n    - Philly Fed Employment (previous: 29.2)\n    - Philly Fed New Orders (previous: 17.0)\n    - Philly Fed Prices Paid (previous: 69.70)\n    - US Leading Index (consensus: 0.8%, previous: 0.7%)\n\n## Upcoming events for Friday, August 20th\n\n - Expected earnings:\n\n  AVCO, BKE, BRID, BTX, CDZI, CNNB, DE, ENSC, FL, GASS, GB, GNLN, INTG, JP, KULR, LMFA, MVST, PFSW, PVL, RLX, SCX, SHG, TAYD, TDAC, TKAT, UI\n\n - Ex-div:\n\n  AATC, AEIS, AFT, AIF, AOMR, ATO, BGH, DLX, FGB, FHB, FMN, GAIN, GLAD, GOOD, GSL, HL, HVT, HVT.A, IGIC, JBT, LAND, LTC, MFD, NATH, NCMI, NLOK, OGN, R, RDN, TIPT, TSCO, UGP, UPS\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.3K)\n    - CFTC Copper speculative net positions (previous: 29.0K)\n    - CFTC Corn speculative net positions (previous: 321.6K)\n    - CFTC Crude Oil speculative net positions (previous: 400.4K)\n    - CFTC Gold speculative net positions (previous: 168.4K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -13.3K)\n    - CFTC Natural Gas speculative net positions (previous: -143.9K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 23.1K)\n    - CFTC Silver speculative net positions (previous: 24.5K)\n    - CFTC Soybeans speculative net positions (previous: 122.4K)\n    - CFTC Wheat speculative net positions (previous: 43.6K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 387)\n    - U.S. Baker Hughes Total Rig Count (previous: 491)\n\n^^^^2021-08-17",
        "created_utc": 1629194413,
        "id": "h99s9at",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1629223213.0
    },
    {
        "author": "MrBrawn",
        "body": "I wanted to build a house on my current property and they said it would be 6 months before they could start and about 18 months until I take the keys.  Given how materials are still expensive, I'm going to hold off for a while.  Shits crazy out there.",
        "created_utc": 1629556439,
        "id": "h9sjt3j",
        "score": 1,
        "subreddit": "investing",
        "created": 1629585239.0
    },
    {
        "author": "jerryjones-is-smart",
        "body": "$QCOM still excellent value",
        "created_utc": 1627912129,
        "id": "h7ffvvy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627940929.0
    },
    {
        "author": "Omorphya",
        "body": "BUY QCOM $155 thank me later",
        "created_utc": 1627917337,
        "id": "h7fqzal",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627946137.0
    },
    {
        "author": "z06dro",
        "body": "QCOM calls",
        "created_utc": 1627880604,
        "id": "h7ea9qb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627909404.0
    },
    {
        "author": "Omorphya",
        "body": "155 this week QCOM",
        "created_utc": 1627917374,
        "id": "h7fr28d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627946174.0
    },
    {
        "author": "Omorphya",
        "body": "Bro QCOM looks good",
        "created_utc": 1627917365,
        "id": "h7fr1i5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627946165.0
    },
    {
        "author": "dmitsuki",
        "body": "They didn't. When I spoke to an Intel product lead around 2012 he told me flat out that Intel, as a company didn't even consider AMD competition. He said that the only focus on the company was fighting companies like Qualcomm. This was obvious with their push of things like Atom. They didn't care about HPC because they didn't see any competition in it. Almost all of the money and research was poured elsewhere because everybody went to them for HPC anyway. Once Ryzen was released, which had obvious buy signals about it at the time, they still didn't give a shit, because first gen wasn't as good as Intels established product. \n\nThen it got better.\n\nThen it got even better.\n\nThen it got even better.\n\nAnd at that point it was too late, because Intel had focused all of it's energy trying to make atom processors and things of the like nobody wanted, they could no longer trivially keep up in HPC.",
        "created_utc": 1627916566,
        "id": "h7fpabl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627945366.0
    },
    {
        "author": "miscsubs",
        "body": "On the earnings call they did mention the major cloud provider being a IFS packaging solutions customer but Pat himself talked about collaborative effort and I don’t know, it sounded a bigger deal at the time. But I guess they picked their words just right.\n\nStill doesn’t justify the QCOM statement. At best, it was misleading IMO. that’s one thing that was frustrating about Intel in the previous regime. Always putting a spin on things with carefully crafted words.",
        "created_utc": 1627840122,
        "id": "h7c4fb6",
        "score": 1,
        "subreddit": "investing",
        "created": 1627868922.0
    },
    {
        "author": "Equivalent_Style4790",
        "body": "I guess your study would show u that none are neither over nor underevaluated if u add some more parameter in it. \n\n- Microsoft and visa are there to last \n- apple have only 1 product  that made most of its revenue\n- facebook and google are being fought by all the government for tax evasion and stuff. \n- qualcomm and intel are suffering the semiconducter crsis and they are only \"supliers\" and thus are heavily dependant on other big companies. \n- amazon was heavily sollicitaed during the pandemic and now ppl want to shop in the physical shops\n\nI beleive that those ideas can provide some insight of why a stock is under or over evaluated. \n\nNot to mention how the pandemic made all the money flow being very \"special\" during the last year and thus, all the number that are related on it are not even remotly indicating \"companie's health\". \n\nThx for sharing ur study with us",
        "created_utc": 1627851067,
        "id": "h7crf9a",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627879867.0
    },
    {
        "author": "z06dro",
        "body": "Qcom calls",
        "created_utc": 1627875396,
        "id": "h7e21ya",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627904196.0
    },
    {
        "author": "miscsubs",
        "body": "I was cautiously optimistic about Gelsinger but this QCOM deal announcement did make me question things. Intel said QCOM to make chips in their foundries, QCOM then said no commitment yet, they’re just evaluating.\n\nThey also said they signed up a major cloud customer and sure, they did, but only for packaging (Amazon).\n\nNot sure if they’re intentionally misleading or being sloppy but I don’t like it.",
        "created_utc": 1627836077,
        "id": "h7bvq0p",
        "score": 1,
        "subreddit": "investing",
        "created": 1627864877.0
    }
]