[
    {
        "author": "djOH1",
        "body": "I love AMD",
        "created_utc": 1635279769,
        "id": "hi5rahm",
        "score": 204,
        "subreddit": "stocks",
        "created": 1635308569.0
    },
    {
        "author": "Sheeple81",
        "body": "As a holder of both AMD and Intel for a while now, I can tell you Intel is it's own worst nightmare.",
        "created_utc": 1635174522,
        "id": "hhzrj9g",
        "score": 194,
        "subreddit": "wallstreetbets",
        "created": 1635203322.0
    },
    {
        "author": "theJimmybob",
        "body": "Some implies moves for earnings next week - 1089 companies reporting. And these are up/down not just up idiots:\n\n&amp;#x200B;\n\n$AAPL 3.3%  \n$AMZN 4.6%  \n$GOOGL 4.5%  \n$MSFT 3.1%  \n$FB 6.6%  \n$LOGI 8.9%  \n$AMD 6.7%  \n$TWTR 11.1%  \n$SHOP 6.5%  \n$MA 3.7%  \n$V 3.1%  \n$TWLO 7.6%  \n$UPWK 15.3%  \n$NOW 5.3%  \n$ALGN 8.3%  \n$CAT 4.2%  \n$BA 4.4%  \n$UPS 5.1%  \n$GE 5.0%  \n$LMT 2.7%  \n$MMM 3.3%  \n$SHW 5.2%  \n$JBLU 9.4%  \n$HAS 7.2%  \n$FFIV 5.7%  \n$QS 9.6%  \n$GM 5.3%  \n$SPOT 7.0%  \n$MCD 2.9%  \n$HOG 8.8%  \n$GRMN 6.0%  \n$CME 3.1%  \n$F 5.7%  \n$TDOC 7.0%  \n$EBAY 5.9%  \n$IRBT 11.3%  \n$ORLY 5.4%  \n$TREE 13.5%  \n$ABMD 9.7%  \n$OSTK 10.7%  \n$YUM 3.8%  \n$SBUX 4.2%  \n$X 8.2%  \n$DXCM 9.7%  \n$GILD 3.6%  \n$TEAM 8.5%  \n$DECK 10.6%  \n$ABBV 3.0%  \n$CVX 2.6%",
        "created_utc": 1634994267,
        "id": "hhqlf9u",
        "score": 147,
        "subreddit": "wallstreetbets",
        "created": 1635023067.0
    },
    {
        "author": "Velghast",
        "body": "I did something similar at the end of the last year with AMD calls. My girlfriend went from being really pissed that there was $2,000 missing from our savings and then she was bewildered when the next week there was $20,000 in it instead. She thought I was selling drugs on the side or some s***... I had to explain to her that it was much worse.",
        "created_utc": 1635553742,
        "id": "hil1jzg",
        "score": 145,
        "subreddit": "wallstreetbets",
        "created": 1635582542.0
    },
    {
        "author": "DavidAg02",
        "body": "Apples to oranges comparison. AMD, no question.",
        "created_utc": 1633570531,
        "id": "hfof0z8",
        "score": 142,
        "subreddit": "stocks",
        "created": 1633599331.0
    },
    {
        "author": "omen_tenebris",
        "body": "this. I'd rather have complete strangers have their input on the internet on my portfolio than family.  \nI asked family, what they think putting my money into AMD. They recommended not to. It was when AMD was &lt;8$.\n\nNever again.",
        "created_utc": 1633591632,
        "id": "hfpcf29",
        "score": 128,
        "subreddit": "investing",
        "created": 1633620432.0
    },
    {
        "author": "ImAltair",
        "body": "\"I play both sides so i can always lose money\"\n\nAMD kinda hot lately doe🦍",
        "created_utc": 1635174897,
        "id": "hhzsee4",
        "score": 125,
        "subreddit": "wallstreetbets",
        "created": 1635203697.0
    },
    {
        "author": "RightSideOfTheBase",
        "body": "That data center miss was key. AMD reports next week. I expect their data center numbers to be big. If so, I don't understand what more people need to see to realize that Intel is losing market share and falling further and further behind their competition. There's a lot of Intel fanboys out there. They're mostly value/dividend investors. These are the same people who fell in love with T and defended their investment in that dog for years. Now go look at the T chart and tell me how you feel about it. Unless there's drastic changes Intel will be T IMO.",
        "created_utc": 1634991875,
        "id": "hhqhid7",
        "score": 121,
        "subreddit": "stocks",
        "created": 1635020675.0
    },
    {
        "author": "juaggo_",
        "body": "I think we now have a clear view that this earnings season is a success. Today Visa, Microsoft, Google, AMD and Enphase have all beaten expectations. Bullish on the stock market in general.",
        "created_utc": 1635279790,
        "id": "hi5rcgg",
        "score": 108,
        "subreddit": "stocks",
        "created": 1635308590.0
    },
    {
        "author": "uselessadjective",
        "body": "I am so happy folks are now looking at AMD with such positivity. Back in 2017 when I got 4500 AMD shares for $14 I had tough time convincing friends, relatives.\n\nGlad I held on to AMD. Still holding all shares.",
        "created_utc": 1635289507,
        "id": "hi6epq9",
        "score": 100,
        "subreddit": "stocks",
        "created": 1635318307.0
    },
    {
        "author": "itsmrlowetoyou",
        "body": "NVDA, AMD, BABA, BA, SOFI. Honorable mention COIN",
        "created_utc": 1635567348,
        "id": "hilsamq",
        "score": 99,
        "subreddit": "investing",
        "created": 1635596148.0
    },
    {
        "author": "koreanwizard",
        "body": "AMD never pops at earnings, the trick is to sell before earnings, then buy after it sells off, then wait patiently. Which is why I held through earnings like a fucking idiot again, I will never learn.",
        "created_utc": 1635281065,
        "id": "hi5une4",
        "score": 97,
        "subreddit": "wallstreetbets",
        "created": 1635309865.0
    },
    {
        "author": "TehWhale",
        "body": "Up 511% YTD. Thanks cloudflare and AMD.",
        "created_utc": 1634664863,
        "id": "hh99jl1",
        "score": 97,
        "subreddit": "stocks",
        "created": 1634693663.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "Investors love good leadership and successful companies.\n\nAMD is one of those companies.",
        "created_utc": 1635283534,
        "id": "hi60w0o",
        "score": 91,
        "subreddit": "stocks",
        "created": 1635312334.0
    },
    {
        "author": "neothedreamer",
        "body": "That is awesome.  You are like 2x SPY.  Guess the saying you can't beat the market is not always correct, although all the snobs on here will say you need a 20 year track record to prove you are beating the market.\n\nLook at Sofi, Clne, Amd and maybe Nvda on a dip.",
        "created_utc": 1634265570,
        "id": "hgowq1x",
        "score": 91,
        "subreddit": "StockMarket",
        "created": 1634294370.0
    },
    {
        "author": "TylerBlozak",
        "body": "As a $V holder of 3 years, welcome aboard!\n\nOne of my best buys as an investor (besides AMD at $6), $V is one of those companies I can trim down, but never fully part with.\n\nAlongside AAPL, MSFT, AMZN, It’s one of my core “never selling unless SHTF” stocks.",
        "created_utc": 1635366513,
        "id": "hiak8qv",
        "score": 81,
        "subreddit": "stocks",
        "created": 1635395313.0
    },
    {
        "author": "CJT2013",
        "body": "Buy it. And AMD\n\nI’ve been suggesting these 2 (and INTC and still do) for years\n\nCash rich, innovative, tech company breaking barriers\n\n**People told me years ago that the prices were already too high.**",
        "created_utc": 1635540605,
        "id": "hik7y5v",
        "score": 80,
        "subreddit": "stocks",
        "created": 1635569405.0
    },
    {
        "author": "Weikoko",
        "body": "ARM is a real threat not just AMD.",
        "created_utc": 1634989490,
        "id": "hhqe4d2",
        "score": 75,
        "subreddit": "stocks",
        "created": 1635018290.0
    },
    {
        "author": "alles_long",
        "body": "Also:\n- XLNX merger on the brink of completion. \n- Semi’s rebounding\n- Google just expanded collaboration with AMD in the cloud server market\n- Rates trending down, good news for (semi)growth stocks\n- JPow dm’ed me “f*ck your puts”",
        "created_utc": 1634499176,
        "id": "hh0rj7j",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1634527976.0
    },
    {
        "author": "itsadiseaster",
        "body": "I am roasting you but I did similar stupid moves. Amd purchased at $9 sold at $18 - I doubled my money! Yeah... Fuck my life... Bought tesla around $100 BEFORE the split sold it after quadrupling the money (idiot me). I would have enough money for a  house downpayment if I held that amd and tesla...",
        "created_utc": 1635706304,
        "id": "hisn0v1",
        "score": 64,
        "subreddit": "stocks",
        "created": 1635735104.0
    },
    {
        "author": "conrad98",
        "body": "No kidding. Intc has been trading flat for years as AMD is eating their lunch. Intc just isn't a growth stock.   \nGreat if you want to hold shares to collect dividends but how can a tech company in today's climate trade flat when all of their peers are up 20 to 50% this year?",
        "created_utc": 1635118456,
        "id": "hhxa2bf",
        "score": 63,
        "subreddit": "wallstreetbets",
        "created": 1635147256.0
    },
    {
        "author": "isospeedrix",
        "body": "Holy shit I thought I was the only one who lost big on TSM calls. After the drop from 140 I was sure it would bounce back to 140 again and never did. Meanwhile AMD and nvidia hit fresh highs in the same time period. Never lucky. FUK",
        "created_utc": 1634785407,
        "id": "hhg4fwm",
        "score": 59,
        "subreddit": "wallstreetbets",
        "created": 1634814207.0
    },
    {
        "author": "dancinadventures",
        "body": "The other cults you compared it to have actual products. \n\nApple has phones. AMD has Chips. Tesla has cars. \n\nYou think it’s that easy to create an enterprise social media website that can handle that much throughput by just splashing money? Please",
        "created_utc": 1635176154,
        "id": "hhzvcvk",
        "score": 57,
        "subreddit": "wallstreetbets",
        "created": 1635204954.0
    },
    {
        "author": "Oscuridad_mi_amigo",
        "body": "This sub is in love with AMD.",
        "created_utc": 1635280532,
        "id": "hi5t9ui",
        "score": 55,
        "subreddit": "stocks",
        "created": 1635309332.0
    },
    {
        "author": "AxeLond",
        "body": "I see the company going somewhere. Last year they sold off their entire memory business to SK Hynix, now they're outsourcing their silicon manufacturing to TSMC, revenue and net income is trending down (-1% Y/Y), cash on hand is down 45%. Clearly it's a company in decline right now, which is why the P/E is so low.\r  \n\r  \nHigh end semiconductor is a very zero-sum game, every processor sale loss by intel is a sale gained by AMD. If you look at AMD stock they're revenue is up 99.3% Y/Y and net income up 353% Y/Y (mostly due to COVID, but intel had same situation). AMD's revenue wasn't much of a threat to Intel previously. In Q2 2020 AMD made $1.93 billion and Intel $19.7 billion, now AMD is at $3.85 billion and are starting to make significant impact on Intel's numbers.\r  \n\r  \nIntel knew they were on a shit trajectory, that's why they fired their bean counter CEO at the start of this year. However after 8 years of bean counting and coasting on their legacy it's hard to just turn the company around on a dime. I like their new CEO Pat Gelsinger, he has good vision and plans for the company, however I need proof that they can actually execute before I touch Intel.\n\nTheir numbers will continue trending down in the short term, it will be 2 years before the new chip fabs under Pat Gelsinger come online. If AMD keeps their pace of growth at 50%, and continue to execute as well as they have been, then AMD's quarterly revenue would continue to grow to $8.7 billion.  Assuming that increase all comes out of Intel's lunch then Intel's revenue would be declining from $19.6 billion to $14.8 billion (-25%) over the next two years.",
        "created_utc": 1634983996,
        "id": "hhq7dri",
        "score": 53,
        "subreddit": "stocks",
        "created": 1635012796.0
    },
    {
        "author": "P33L_R",
        "body": "200 shares of AMD and don't check it for 2 years",
        "created_utc": 1633375623,
        "id": "hfe0xkj",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1633404423.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Lost\n\n/u/isellamdcalls (0/1) made a bet that AMD would go to 120.0 when it was 104.89 and it did not, so they were banned for a week.",
        "created_utc": 1634507121,
        "id": "hh1a9qy",
        "score": 52,
        "subreddit": "wallstreetbets",
        "created": 1634535921.0
    },
    {
        "author": "WestmontOG07",
        "body": "Here are the positives with the report:\n\n1. As should have been expected, margins have increased (via the world wide chip shortage) so that's good. (Increased by about 300 basis points Year over year for the quarter.\n2. The company raised guidance on EPS and on Margin guidance Now expecting GAAP EPS of $4.50 and non-GAAP EPS of $5.28 and GAAP gross margin of 55% and non-GAAP gross margin of 57%.\n3. In the third quarter, the company generated $9.9 billion in cash from operations and paid dividends of $1.4 billion.\n4. Full year spending: $18-19 Billion. \n\nThose are the positives BUT the negatives are the same negatives that have existed before.\n\nFrankly, I am going to continue to hold although I am getting trounced BC I believe that with their deep coffers Intel has the wherewithal to get where they need to go --- IF --- they EXECUTE. If they don't execute, frankly, I see this company going the route of IBM. \n\nI will be patience but MAN is it hard to be optimistic given the stiff competition from very competent competitors, namely, AMD!\n\n&amp;#x200B;\n\nLONG INTC / LONG AMD.",
        "created_utc": 1634850650,
        "id": "hhjgge3",
        "score": 51,
        "subreddit": "stocks",
        "created": 1634879450.0
    },
    {
        "author": "dhpw2",
        "body": "Apple, \n \nMicrosoft, \n\nFacebook, \n\nSquare, \n\nDisney, \n\nAMD, \n\nTaiwan Semiconductor, \n\nVisa/Mastercard, \n\nAlibaba, \n\nRocket Lab",
        "created_utc": 1633667089,
        "id": "hftg5a5",
        "score": 50,
        "subreddit": "stocks",
        "created": 1633695889.0
    },
    {
        "author": "Singuy888",
        "body": "Could have gone from rich to rags as well. Lets just say AMD and Tesla wasn't exactly green when I bought them. I was down over 70k as my lowest.",
        "created_utc": 1634305293,
        "id": "hgqk9y0",
        "score": 46,
        "subreddit": "StockMarket",
        "created": 1634334093.0
    },
    {
        "author": "DragonInPajama",
        "body": "AMD, GOOG and MSFT will beat. That much I know.",
        "created_utc": 1634991737,
        "id": "hhqhaxo",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1635020537.0
    },
    {
        "author": "LyfeGaveLemons",
        "body": "You know INTC is in a pretty interesting position. For those saying \"value trap\" i think sure, theres some credence to that thought. AMD NVDA have been the stock market darlings, mostly for good reason. INTC did not spend enough of its money on its tech thinking theyd be the only big players for awhile.\n\nHOWEVER, I COULD see it as a national security threat not to have a player like INTC be in a solid spot for making chips, leaving it all in the hands of the Taiwanese who make like 3/4s of the worlds semiconductors. You know, with China &amp; all.",
        "created_utc": 1634443719,
        "id": "hgy2bz4",
        "score": 45,
        "subreddit": "StockMarket",
        "created": 1634472519.0
    },
    {
        "author": "RightSideOfTheBase",
        "body": "AT&amp;T.\n\nHonestly, there's better semi companies to invest in then Intel. Nvidia, AMD, Marvel, Taiwan Semi, Broadcom, KLAC, Lamb Research, ASML, all of these are better picks then Intel.",
        "created_utc": 1634992320,
        "id": "hhqi6s9",
        "score": 45,
        "subreddit": "stocks",
        "created": 1635021120.0
    },
    {
        "author": "sunnbeta",
        "body": "Downside to PLTR is IMO the current valuation and massive potential downside if things don’t play out from here... \n\nFor example I think there are reasonably plausible scenarios where PLTR stock price drops 80% from current, and much much less likely for this to happen to AMD. \n\nI’m looking at some quick numbers here; we know AMD itself is a relatively high P/E (35ish) growth/tech name, and ok its market cap is 125B. PLTR is currently at a market cap of 45B, so roughly valued at a third of AMD. But last year AMD’s revenue was 3.85B, PLTR was 0.3B. So we have AMD at 3x the market cap, but 10x revenue. Now of course PLTR is growing fast, but the 800M Army contract just announced is a 7yr contract. So ok a nice 100M per year… that’s what AMD makes every 10 days. \n\nPLTR just is priced for massive growth and needs to grow into it, if they don’t there is massive downside compared to AMD. If their growth rate slows down, it could kill the stock price.\n\nWe also know the fed is planning to raise interest rates in coming years, and that will effect future discounted cash flows and disproportionately hurt the valuation of high growth names (because at higher rates, the future cash flows get discounted more, and don’t look as attractive in today’s dollars). This could effect AMD, but would have a much bigger effect on PLTR.",
        "created_utc": 1633569099,
        "id": "hfobz1u",
        "score": 42,
        "subreddit": "stocks",
        "created": 1633597899.0
    },
    {
        "author": "mitchcana96",
        "body": "I'd take AMD right now just based on quantifiable and perceived growth over the next few years and into the beginning of 2025. After that or a little before intc could be a good buy if they can get competitive again. I'm definitely biased towards semi conductor companies though",
        "created_utc": 1633565212,
        "id": "hfo3olo",
        "score": 42,
        "subreddit": "stocks",
        "created": 1633594012.0
    },
    {
        "author": "theJimmybob",
        "body": "Implied moves for companies reporting next week:\n\n&amp;#x200B;\n\n$AAPL 3.3%  \n$AMZN 4.6%  \n$GOOGL 4.5%  \n$MSFT 3.1%  \n$FB 6.6%  \n$LOGI 8.9%  \n$AMD 6.7%  \n$TWTR 11.1%  \n$SHOP 6.5%  \n$MA 3.7%  \n$V 3.1%  \n$TWLO 7.6%  \n$UPWK 15.3%  \n$NOW 5.3%  \n$ALGN 8.3%  \n$CAT 4.2%  \n$BA 4.4%  \n$UPS 5.1%  \n$GE 5.0%  \n$LMT 2.7%  \n$MMM 3.3%  \n$SHW 5.2%  \n$JBLU 9.4%  \n$HAS 7.2%  \n$FFIV 5.7%  \n$QS 9.6%  \n$GM 5.3%  \n$SPOT 7.0%  \n$MCD 2.9%  \n$HOG 8.8%  \n$GRMN 6.0%  \n$CME 3.1%  \n$F 5.7%  \n$TDOC 7.0%  \n$EBAY 5.9%  \n$IRBT 11.3%  \n$ORLY 5.4%  \n$TREE 13.5%  \n$ABMD 9.7%  \n$OSTK 10.7%  \n$YUM 3.8%  \n$SBUX 4.2%  \n$X 8.2%  \n$DXCM 9.7%  \n$GILD 3.6%  \n$TEAM 8.5%  \n$DECK 10.6%  \n$ABBV 3.0%  \n$CVX 2.6%",
        "created_utc": 1634994048,
        "id": "hhql19m",
        "score": 41,
        "subreddit": "options",
        "created": 1635022848.0
    },
    {
        "author": "luminlin",
        "body": "$10,000 in AMD at $6\n\n$70,000 in TSLA at $40\n\n$200,000 Put Option TSLA during COVID\n\n$600,000 TSLA again at $300\n\n$200,000 in $DOGE at $0.07 sold $69\n\n$500,000 in AMC at $10 sold $52\n\n$1,000,000 in $SPCE at $24 sold at $54\n\n$2,000,000 in TSLA again at $600\n\nNow $3,000,000 in PLTR and MRNA",
        "created_utc": 1634665479,
        "id": "hh9b44u",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1634694279.0
    },
    {
        "author": "BaneCIA4",
        "body": "so Ford goes up after earnings but AMD tanks. Fuck this world",
        "created_utc": 1635365350,
        "id": "hiah66w",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1635394150.0
    },
    {
        "author": "bungholio99",
        "body": "Intel is missing all semi conducteur growth markets like IOT/Server/Storage.\nPC Business isn’t sustainable and they also lose to AMD.\n\nThere is a reason why no Analyst says it’s a buy.\n\nThe new Factory will start working in 5 Years till then it’s only investment and bad for EPS.\n\nIntel tried everything but they failed, technical issues were costly spectre/meltdown.\nIntel lost most lead engineers.\n\nAnd you shouldn’t forget that unlawful competition behavior and intel go side by side, the set record in recieving fines.\n\nhttps://www.reuters.com/article/us-eu-intel-antitrust-idUSKBN20X1FV\n\nMaybe touch it in 3-4 years but definitly not now.",
        "created_utc": 1634983190,
        "id": "hhq6h9a",
        "score": 41,
        "subreddit": "stocks",
        "created": 1635011990.0
    },
    {
        "author": "edk128",
        "body": "Amd is more of a pure chip design play. Nvidia owns software pipelines that produce value. \n\nBoth are great though, especially in recent years 😎",
        "created_utc": 1635544374,
        "id": "hikh1c8",
        "score": 40,
        "subreddit": "stocks",
        "created": 1635573174.0
    },
    {
        "author": "Bxdwfl",
        "body": "some guy almost did this on AMD back in the day. i think he lost it all around 600k though.",
        "created_utc": 1634751433,
        "id": "hhdxpzn",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1634780233.0
    },
    {
        "author": "uselessadjective",
        "body": "You cant even hold few months...\n\nI loaded AMD in 2017 around 4500 shares @ $14 avg. Recommended to around 32 ppl. Lot of guys bought in.\n\nFrom 2017 to 2018 AMD was stuck between $9 to $16. Mostly I was red for 1 whole f**king year. U can check AMD chart as well.\n\nRight now out of 32 only I and a friend of mine is holding AMD. I am with almost $500K now.\n\nIf you cant take few down months then u should not enter the stock market. This is not a casino where every hour and day lucky folks make millions.\n\nI also hold 10,000 NIO shares @ $10avg. All chinese stocks are dirt cheap npw. U can DCA.",
        "created_utc": 1634244876,
        "id": "hgnp6me",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1634273676.0
    },
    {
        "author": "Wyooot",
        "body": "you actually have a good point and I tell everyone who comes to me to ask about trading one simple tip, you have to learn what it’s like to see your money deep in the red before you will consistently see green.\nSure there could be luck involved but the rollercoaster of stress and emotions is something you will never experience with fake money. You have to learn to not panic and hold through lows. Sure maybe the first stock you bought was Tesla, then you took your gains to spy, amd, google, all things that have had a solid bull run. But there will be times where you get hit with a bear market, and you must learn the self control to come out on top. \n \nPls I get it maybe you inherited or were given or simply had so much money to begin with that the abundance completely outweighed any potential loss and you never felt these emotions, but there are millions of people out there who are less fortunate and trying to better themselves and each dollar lost will feel like a million at first. I remember the gut wrenching feeling. It will go away with experience. Don’t give up.",
        "created_utc": 1635358349,
        "id": "hi9z14d",
        "score": 38,
        "subreddit": "StockMarket",
        "created": 1635387149.0
    },
    {
        "author": "VictorDanville",
        "body": "I wonder if salary is a good metric to determine how well a company will do. For example, I did quick google search on average software engineer salary for Intel was $100k while for AMD was $150k... well that makes me bearish on Intel. How can Intel turn things around if the top talent can find better pay elsewhere?",
        "created_utc": 1635121380,
        "id": "hhxfstl",
        "score": 37,
        "subreddit": "stocks",
        "created": 1635150180.0
    },
    {
        "author": "Dae_su",
        "body": "They will beat expectations but lower guidance and thus drop a bit. It might be more than a bit if it keeps running up.\n\nAren't we all hoping that though, I would smile at the chance of picking up amd around 100.",
        "created_utc": 1635125449,
        "id": "hhxnvuj",
        "score": 37,
        "subreddit": "stocks",
        "created": 1635154249.0
    },
    {
        "author": "drunkarder",
        "body": "Amd is just looking around casually…",
        "created_utc": 1634864093,
        "id": "hhk9p58",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1634892893.0
    },
    {
        "author": "FinndBors",
        "body": "I don't have a position and I haven't analyzed the chip market in detail, but here are your risk factors:\n\n* Intel gets its act together (unlikely, but the other time AMD beat Intel, Intel finally woke up and fixed their shit and AMD cratered. I doubt Intel will until next generation fabs in a couple years though).\n* Server chips move away from x86 to ARM for performance per watt/cost issues.\n* General relevance of CPU drops -- more dollars spent on specialized chips for AI over general purpose CPUs.",
        "created_utc": 1634833819,
        "id": "hhian9u",
        "score": 37,
        "subreddit": "stocks",
        "created": 1634862619.0
    },
    {
        "author": "Anth916",
        "body": "AMD should almost be a baby FAANG stock at some point\n\nPLTR shouldn't really be mentioned in the same class.",
        "created_utc": 1633571773,
        "id": "hfohtcn",
        "score": 36,
        "subreddit": "stocks",
        "created": 1633600573.0
    },
    {
        "author": "audioaxes",
        "body": "AMD was one of the more \"easy mode\" plays this year when it was sitting in low 80s.  Rode it to about 110.  Bought back in when it hit low 100s.",
        "created_utc": 1635183739,
        "id": "hi0dupc",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1635212539.0
    },
    {
        "author": "Look_here_Listen_",
        "body": "Intel is a buy in the Mid to low 40’s. Intel still behind tsm/amd by a few years and it will take large capital spending to catch up. AMD will continue to eat massive amounts of intc market share in the meantime",
        "created_utc": 1634926547,
        "id": "hhnevb7",
        "score": 35,
        "subreddit": "stocks",
        "created": 1634955347.0
    },
    {
        "author": "The_Nordal",
        "body": "AMD running faster than JPow printing",
        "created_utc": 1634857837,
        "id": "hhjwgk5",
        "score": 35,
        "subreddit": "StockMarket",
        "created": 1634886637.0
    },
    {
        "author": "Prestigious-Ebb-1369",
        "body": "AMD and NVIDEA are literally the highest growth companies next to Tesla I want to say 1200% and 1400% respectively over the last 5 years and they are NOT going to be stopping any time soon… they are both my retirement stocks",
        "created_utc": 1634849058,
        "id": "hhjcmoh",
        "score": 33,
        "subreddit": "stocks",
        "created": 1634877858.0
    },
    {
        "author": "Chilly-Cheez",
        "body": "$AMD KILLS IT AGAIN!",
        "created_utc": 1635279592,
        "id": "hi5qttr",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1635308392.0
    },
    {
        "author": "VictorDanville",
        "body": "I don't think Intel's GPUs are scaring AMD or NVIDIA...",
        "created_utc": 1635538210,
        "id": "hik1xm2",
        "score": 33,
        "subreddit": "stocks",
        "created": 1635567010.0
    },
    {
        "author": "junju009",
        "body": "I dunno, it’s intel. Last time AMD caught intel with their pants down, it lasted 2 years before they came back and made sure AMD never had another competitive product for over 10 years. They got complacent and AMD took over. Remember that Intel also has more software engineers than AMD has employees. They have a lot resources and shouldn’t be counted out. I expect their hybrid core laptops to be big\n\nAnd I say this as someone with 3 AMD PCs",
        "created_utc": 1635011477,
        "id": "hhri066",
        "score": 32,
        "subreddit": "stocks",
        "created": 1635040277.0
    },
    {
        "author": "TallFruitTree",
        "body": "AMD",
        "created_utc": 1635548221,
        "id": "hikptt3",
        "score": 31,
        "subreddit": "stocks",
        "created": 1635577021.0
    },
    {
        "author": "IAMHideoKojimaAMA",
        "body": "You sons of bitchs telling me to buy net and AMD earlier this year I kiss you all on the mouth right now",
        "created_utc": 1634689248,
        "id": "hhavrnk",
        "score": 31,
        "subreddit": "stocks",
        "created": 1634718048.0
    },
    {
        "author": "DragonInPajama",
        "body": "Eh, not so sure. Shortages and logistic chain disruptions can mess up the numbers for the quarter. AMD is at full capacity so for them this stuff is less of an issue. And goog and msft don't even care about such worldy problems.",
        "created_utc": 1634995372,
        "id": "hhqnfaa",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1635024172.0
    },
    {
        "author": "That_Guuuy",
        "body": "AMD loves you too",
        "created_utc": 1635280219,
        "id": "hi5sgl4",
        "score": 29,
        "subreddit": "stocks",
        "created": 1635309019.0
    },
    {
        "author": "throwaway44783",
        "body": "PLTR and AMD are both good long term. Buy them both if you can.",
        "created_utc": 1633567967,
        "id": "hfo9jcl",
        "score": 28,
        "subreddit": "stocks",
        "created": 1633596767.0
    },
    {
        "author": "PJkazama",
        "body": "Let's go AMD. Do well so I could finally afford my NVIDIA powered pc.",
        "created_utc": 1635018626,
        "id": "hhry2mh",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1635047426.0
    },
    {
        "author": "Dazzlingskeezer",
        "body": "If they were smart the would have been buying AMD stock instead.",
        "created_utc": 1635304578,
        "id": "hi7bjsw",
        "score": 28,
        "subreddit": "options",
        "created": 1635333378.0
    },
    {
        "author": "T9_of_spades",
        "body": "That's significantly different context than them just telling you not to invest in AMD...",
        "created_utc": 1633614956,
        "id": "hfq924v",
        "score": 27,
        "subreddit": "investing",
        "created": 1633643756.0
    },
    {
        "author": "SanaySK",
        "body": "I hate myself for not being able to let go of all these gme shares.\nSoo many fucking opportunities out there right now. Fucking tsla is about to fistfuck $1000. At least I've got amd calls :/",
        "created_utc": 1635163474,
        "id": "hhz5cmp",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1635192274.0
    },
    {
        "author": "LargeSackOfNuts",
        "body": "Tesla\n\nAMD\n\nNvidia\n\nMicrosoft\n\nTAMN",
        "created_utc": 1635646941,
        "id": "hipw80q",
        "score": 27,
        "subreddit": "stocks",
        "created": 1635675741.0
    },
    {
        "author": "AceOrigins",
        "body": "NVDA TSLA NFLX SPY AMD AAPL weeklies get em while they're hot!!",
        "created_utc": 1633497680,
        "id": "hfkl7kp",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1633526480.0
    },
    {
        "author": "badoptionsguy",
        "body": "You son of a bitch. Slap my ass and call me slut. I am going balls deep in AMD tomorrow",
        "created_utc": 1635307587,
        "id": "hi7h9hd",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1635336387.0
    },
    {
        "author": "way2lazy2care",
        "body": "A good example of this is AMD. Between 2008-2016 they were super stagnant or down comparatively. They're up like 2000% since then though, so the annualized return on the investment is still ~30%.",
        "created_utc": 1635271711,
        "id": "hi56ipl",
        "score": 26,
        "subreddit": "stocks",
        "created": 1635300511.0
    },
    {
        "author": "backfire97",
        "body": "You say they censor news, but you literally just went to /r/AMD and made a post about Intel. It's no wonder they removed your post - it's very clearly stated in the rules that all discussion should be only about AMD products.\n\nThe section of the rule you violated: \n&gt;Content that is primarily about a competitor or industry that merely references AMD, AMD products or technologies would not meet this criteria",
        "created_utc": 1635361077,
        "id": "hia63dz",
        "score": 26,
        "subreddit": "stocks",
        "created": 1635389877.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "Remember when Intel reported earnings and blamed cloud companies making their own chips is what caused a shrinkage in their server sector?\n\nI commented that they're going to AMD and posting how they're increasing performance. Here we are, Netflix did exactly that.\n\nAMD numba 1.",
        "created_utc": 1635283496,
        "id": "hi60spr",
        "score": 25,
        "subreddit": "stocks",
        "created": 1635312296.0
    },
    {
        "author": "bizkut",
        "body": "So instead of investing your money in AMD, you did nothing with it? Because the last time AMD was &lt; $8 was in late 2016.  If you had bought SPY at ~215 then, you'd still have doubled your investment, well outpacing inflation in the same 5 year period.",
        "created_utc": 1633611080,
        "id": "hfq195u",
        "score": 25,
        "subreddit": "investing",
        "created": 1633639880.0
    },
    {
        "author": "Mountain_Fig_9253",
        "body": "Ugh, you really should know what you are getting into with these credit spreads. \n\nIt’s the side with the -1 for quantity. That’s the side you sold and collected premium for. In exchange your premium you agreed to buy 100 shares of AMD at 87.50 per share ($8750 total purchase per contract). The put you purchased allows you to sell 100 shares of AMD at $85 theoretically limiting your downside to $250 per contract. \n\nThe reason you can’t close the spread is that it is so far out of the money that no one is interested in these strike prices. A money maker may take a few dollars off your hands to buy an essentially worthless contract but no one will sell you one to close both sides. If you close the short position (by buying to close a contract) you will be left with owning an essentially worthless put but with no risk if a black swan event happens. \n\nThe trade worked out exactly right for you. You collected premium and the stock moved the right way. I would just better understand the assignment risk you are taking and which half is the short side. That risk is what wipes out beginning options investors.",
        "created_utc": 1634312108,
        "id": "hgqzzud",
        "score": 25,
        "subreddit": "options",
        "created": 1634340908.0
    },
    {
        "author": "WestmontOG07",
        "body": "Intel remains, fundamentally, a stock that I believe in. Yes, AMD is absolutely eating their lunch and NVIDIA is, frankly, in a league of their own, however, Intel has a relatively new CEO that has TONS of experience in the game and is turning this titanic sized company around --- it just takes time. \n\nThey are going to start competing with the like of Taiwan Semi on the fab side of the business and, fundamentally, I would argue, they are the strongest positioned chip company.\n\n$23 Billion of cash on hand against $36 billion of long term debt.\n\nMore importantly, the company is clearing, after tax net income of over $20 billion each and every year, which is expected to continue WITH dividend raises.\n\nThe companies future growth prospects will rely on one thing and one thing alone: Execution! If the company can start to execute, they have incredible fundamentals and can buy anything and everything they want. \n\nThis is why I have a significant stake in Intel and will continue to hold.\n\nLONG INTC. LONG AMD. LONG NVIDIA.",
        "created_utc": 1634819942,
        "id": "hhhfowb",
        "score": 25,
        "subreddit": "stocks",
        "created": 1634848742.0
    },
    {
        "author": "accounting838372739",
        "body": "Yup they will get fucked by arm on one hand while AMD is becoming the preferred x86 supplier on the other.",
        "created_utc": 1635007420,
        "id": "hhr8vzy",
        "score": 25,
        "subreddit": "stocks",
        "created": 1635036220.0
    },
    {
        "author": "discovery999",
        "body": "AMD is growing much faster. When your competition is growing a lot faster than you; your market share is decreasing.",
        "created_utc": 1635212097,
        "id": "hi284y9",
        "score": 25,
        "subreddit": "stocks",
        "created": 1635240897.0
    },
    {
        "author": "Recoil42",
        "body": "Intel and TSMC are competing at different levels.\n\nAt this point, TSMC is Coke Classic, Intel is RC Cola.\n\nIt's not to say Intel doesn't have a good product, but TSMC is *so good* that Apple bought out their entire run of 5nm production last year. They've got NVIDIA, AMD, Qualcomm, and Mediatek practically fighting to work with them.\n\nIt's basically a bidding war to work with TSMC right now — they're that good at what they do, they're dramatically leading the competitors.\n\nRight now, Samsung beats them *only* on margin. Intel will have go further than that, considering they've never done pure-play foundry work before and lack a track record. \n\n(Disclosure: I have positions in TSMC)",
        "created_utc": 1635296798,
        "id": "hi6urpl",
        "score": 24,
        "subreddit": "investing",
        "created": 1635325598.0
    },
    {
        "author": "Keman2000",
        "body": "They do a ton more things than just GPUs.  Where as AMD is mostly just CPUs and GPUs, Nvidia does GPUs, artificial intelligence, some automotive, some data center stuff.\n\nThere's a lot of people betting on their AI future.",
        "created_utc": 1635654891,
        "id": "hiqa15b",
        "score": 24,
        "subreddit": "stocks",
        "created": 1635683691.0
    },
    {
        "author": "Substantial-Luck-920",
        "body": "AMD has a habit of green days in a row, and then red days in a row. So wait for a dip before you get in. You may miss the train, but you'll always find another one. Even if you're holding long term, always worth lowering the cost basis.",
        "created_utc": 1634838120,
        "id": "hhiliyy",
        "score": 23,
        "subreddit": "stocks",
        "created": 1634866920.0
    },
    {
        "author": "UnObtainium17",
        "body": "Man, I'm doing all these research on unknown companies and shit but have I just only and blindly bought AAPL, AMD, MSFT, GOOGL from the vjump, I'd be doing better.",
        "created_utc": 1635280447,
        "id": "hi5t1r9",
        "score": 23,
        "subreddit": "stocks",
        "created": 1635309247.0
    },
    {
        "author": "Rjlv6",
        "body": "Personally I think people are blowing the ARM threat completely out of proportion. In my view the concern it poses is that ARM will allow more companies to develop their own in house design plus a new  CPU competitors will enter the market. That being said Intel has an enormous amount of advantages over any possible entrant into the CPU space. Lets not forget they've been in this position for the majority of their corporate history. They fought Power PC and won. They competed in against a multitude of x86 vendors which they brutally destroyed like DEC, Cyrix [https://en.wikipedia.org/wiki/List\\_of\\_x86\\_manufacturers](https://en.wikipedia.org/wiki/List_of_x86_manufacturers) the only exception is AMD which itself has almost died multiple times. Had Intel not rested on their laurels AMD would be dead now too and this is coming from someone who loves AMD to death. (I bought AMD @ $4 back in 2014). \n\nNot only does Intel have some of the best CPU designers in the industry their Roadmap is insane. They are planning on marrying together all of their IP CPU, GPU, FPGA's, Memory, Software and all the other random highly competitive stuff intel does. I think Big.Little married with chiplets and AI accelerators will be a game changer. The only other company I see approaching this scale of capability is AMD. I also don't think every single company will have their own inhouse designs, building CPU's is very expensive and complicated. The expertise is limited and you open yourself up to a whole host of complications. Yes it makes sense for Apple, Amazon, Microsoft etc. But the small to medium sized players will still need a common platform if they want to exist. \n\nThe Foundry is a risk yes but I believe Intel has the finances and talent necessary to figure out this problem. Perhaps they could even go license a new node from Samsung similar to Global foundries. Or maybe Intel and Samsung partner up to develop new nodes to take on TSMC. To me its not a crazy though that Intel and Apple might partner up on the manufacturing side either. Apple has tried to be less dependent on TSMC by leveraging Global Foundries but they just could keep up with TSMC. I don't think anyone wants to be in a situation where there is one FAB to rule them all especially with the geopolitical risks. I'm willing to bet that their massive war chest will help them solve this problem. If not they can always pull an AMD and sell the fab.\n\n&amp;#x200B;\n\nIn my opinion Intel's problems have been self inflicted by poor management under Brian Krzanich. They got lazy meanwhile and AMD came in and smashed them. Imagine if Intel began doing their plans 10 years ago? What would the market would look like? The missing element is aggressive management hopefully Pat and Intel's $20 Billion in annual profit will be the answer. The downside is large if the fail yes but the upside is also huge. Imagine Intel retuned as a vertically integrated AI powerhouse that brings giant leaps in performance with every new generation. Intel is the only company in the world capable of doing this. People are underestimating Intel just as they underestimated AMD its a complex situation and takes time to play out but if anyone can pull it off its Intel.\n\n&amp;#x200B;\n\nSee Moore's law is dead for more info on the tech\n\nhttps://www.youtube.com/watch?v=g44zQII9GV4",
        "created_utc": 1635024584,
        "id": "hhsb8pr",
        "score": 23,
        "subreddit": "stocks",
        "created": 1635053384.0
    },
    {
        "author": "Throwitaway567430",
        "body": "I got scared away from buying AMD at $2.50 cuz my coworkers were laughing at the company.",
        "created_utc": 1634063492,
        "id": "hgdvbzb",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1634092292.0
    },
    {
        "author": "SolidDepartment9983",
        "body": "Omg bro, did you not read what i said. If the SI dropped from 121% SI to 25% as stated by the graph, then why didnt the price increase massively.  That indicates they covered a lot of shares,  right?? However, it states in the article, the price action from 20-483$ on January 1st was mostly caused by retail fomo amd hype, NOT GAMMA Squeeze or covering. They explicitly state that in the report. That's a contradiction, how does short interest drop from 121% to 25% SU,  which means they covered A LOT of shares but wasnt behind the price action from GME on January 1st(20-483$). Thats a contradiction by The SEC, unless it implies like i said, they lowered the SI without Covering. I already stated this.",
        "created_utc": 1634600529,
        "id": "hh65oga",
        "score": 22,
        "subreddit": "stocks",
        "created": 1634629329.0
    },
    {
        "author": "thinvanilla",
        "body": "Intel could well go the way of Kodak in the coming decade; around, but not in nearly the same capacity. Intel's main business is in data centres, I think something close to 99% of data centres use Intel, and the big 3 are Google, Microsoft, and Amazon. While Apple is very unlikely to start supplying their chips to other companies, what they have done is proven to everyone just how powerful and efficient ARM chips can be and what happens when you drop a stagnant supplier.\n\nApple may not supply chips but other companies will. We now know that Microsoft and Amazon are working on custom ARM chips for their own data centres, and we also know that the world's most powerful supercomputer runs on ARM chips too. Intel has slept through all of this thinking their ~99% data centre marketshare is safe, but they will very quickly begin to lose marketshare once Microsoft and Amazon are happy with their ARM developments. This is without even mentioning AMD which is also making strides.\n\nI just see it as Intel will begin to shrink and pivot their business a bit, I don't think they'll disappear but I wouldn't expect much growth either. They could make and supply ARM chips themselves, but they don't make nearly as much money as Apple, Google, Microsoft, Amazon, so they won't be able to afford the same engineers who can make such developments. One of the main reasons Apple's chips have been so successful is because they can afford to throw *a lot* of money at it.",
        "created_utc": 1635004751,
        "id": "hhr2ztw",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635033551.0
    },
    {
        "author": "The_Punicorn",
        "body": "AMD got that Su Bae energy going",
        "created_utc": 1634869816,
        "id": "hhklv9m",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1634898616.0
    },
    {
        "author": "FeCard",
        "body": "Hahaha Intel gets really good competitive news and all the desperado AMD fans come out of the woodworks to check post history.",
        "created_utc": 1635354385,
        "id": "hi9ovjo",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635383185.0
    },
    {
        "author": "Practical-Life-3373",
        "body": "So AMD and FB with much better performance has a darker future ? Or what is your point? A 1T dollar valuation and a 363 P/E is insane",
        "created_utc": 1635544046,
        "id": "hikg90r",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635572846.0
    },
    {
        "author": "LeGrats",
        "body": "AMD steam partnership on new Steamdeck is why I went long on AMD 2 months ago",
        "created_utc": 1635011762,
        "id": "hhrimkj",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1635040562.0
    },
    {
        "author": "Eccentricc",
        "body": "I love my AMD and won't touch Intel. Shit ass company that fucked up years ago. I hope you enjoyed your 0.1% gain in 3 months Intel gave you. Go buy yourself a Blunt because you need it",
        "created_utc": 1635351421,
        "id": "hi9heec",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635380221.0
    },
    {
        "author": "MeLongYouLongTime",
        "body": "Appreciate that my man. I miss the good old days too. Would love to go back and reread some of those AMD, NVDA, and SQ dd’s one more time. Some of the guys in here used to leave some pretty impressive dd, shame I didn’t follow and keep in touch with them.",
        "created_utc": 1634577461,
        "id": "hh4pfd1",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1634606261.0
    },
    {
        "author": "Frothar",
        "body": "thats not the best reason, that partnership is pocket change for AMD. AMD is gaining huge market share in enterprise with large profit margins",
        "created_utc": 1635076068,
        "id": "hhuny5c",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1635104868.0
    },
    {
        "author": "UnknownNo0722",
        "body": "I remember praying to Lisa Su like crazy on my previous account. $AMD",
        "created_utc": 1633082193,
        "id": "heyhnbu",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1633110993.0
    },
    {
        "author": "Fox_Squirrel_",
        "body": "I had 10k to put into AMD at $6 and didn't do it.  This is like the alternate timeline me if I wasn't a pussy lmao",
        "created_utc": 1634670829,
        "id": "hh9opjz",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1634699629.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/dazednconfuse (1/0) made a bet that AMD would go to 120.0 when it was 112.25 and it did, congrats you fuckin nerd.",
        "created_utc": 1634847984,
        "id": "hhj9xh8",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1634876784.0
    },
    {
        "author": "WestmontOG07",
        "body": "What does this comment even mean? They’ll be bailed out? Take a look at their balance sheet and income statement before you make an asinine comment like this.\n\nAMD is eating their lunch, no doubt, but the company is MASSIVELY profitable.\n\nI’m not one to be piling on but your comment shows a clear lack of understanding for the fundamentals of the company. Whether your short or long the stock you should know the basics, of which, clearly you don’t.\n\nYou should be embarrassed with how idiotic your comment is.",
        "created_utc": 1635005356,
        "id": "hhr4bb9",
        "score": 21,
        "subreddit": "stocks",
        "created": 1635034156.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Lost\n\n/u/2Black2Strong- (0/1) made a bet that AMD would go to 130.0 when it was 123.36 and it did not, so they were banned for a week.",
        "created_utc": 1635470579,
        "id": "higgxuk",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1635499379.0
    },
    {
        "author": "Nameless739",
        "body": "Calls on MSFT, V, AMD, GOOGL. Pray for this retard",
        "created_utc": 1635278469,
        "id": "hi5nw0v",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1635307269.0
    },
    {
        "author": "33388883",
        "body": "I think you make a lot of good points however, I have to disagree with ruling Intel out. You seem to have a good understanding of these companies what they do, how they make money, etc. And it is totally correct that AMD and NVDA will likely continue to grow at a faster rate than Intel, but I think it is very important to also consider the price you are paying for a stock. At the end of the day a good company can still be priced too high to buy into with any real margin of safety and in my opinion that is the case with both AMD and NVDA. Personally I like discounted free cashflow to determine fair value and if analyst's estimates for revenues over the next 5-10 years are even remotely accurate (which they usually are) AMD and NVDA both look to be trading at much higher prices than what I calculate their intrinsic values to be. Intel is around or a bit below its fair value depending on what numbers you use, but of course there are reasons it is being valued much lower than the other two.\n\ntldr; IMHO (strictly my humble opinion and in NO WAY financial advice): AMD and NVDA are trading too far above intrinsic value to be good buys, and of course even if Intel's stock price looks attractive if you do not like their business prospects for the coming years it may not be a good buy either so I guess I didn't really help you at all lol",
        "created_utc": 1633365447,
        "id": "hfd9mt2",
        "score": 21,
        "subreddit": "StockMarket",
        "created": 1633394247.0
    },
    {
        "author": "freakishgnar",
        "body": "My investing philosophy is similar, but Intel is currently *at least* two generations behind AMD and NVDA. In the next six months until the launch, they’re going to be losing share. And they’re manufacturing their next chip in a partnership? They’re in big trouble.",
        "created_utc": 1634929594,
        "id": "hhnmap7",
        "score": 21,
        "subreddit": "stocks",
        "created": 1634958394.0
    },
    {
        "author": "Summebride",
        "body": "Lots of line item beats here.  But the bigger story is more qualitative, in that other chip companies like Texas Instruments and Intel report woes and gloom from supply chain, yet AMD has been rolling along.",
        "created_utc": 1635284078,
        "id": "hi627ov",
        "score": 21,
        "subreddit": "stocks",
        "created": 1635312878.0
    },
    {
        "author": "moneygardener",
        "body": "AMD: before up, after sideways a few days, then some more up. Predicting 127 usd 1 week after earnings.",
        "created_utc": 1634775812,
        "id": "hhfjwvj",
        "score": 20,
        "subreddit": "stocks",
        "created": 1634804612.0
    },
    {
        "author": "Fleureverr",
        "body": "Fidelity will. You're doing something wrong.",
        "created_utc": 1633093417,
        "id": "heyybi6",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1633122217.0
    },
    {
        "author": "Weyland-U",
        "body": "Fidelity",
        "created_utc": 1633128920,
        "id": "hf14xov",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633157720.0
    },
    {
        "author": "9mac",
        "body": "My Mydecine shares are all fuckey on Fidelity right now.",
        "created_utc": 1633098170,
        "id": "hez88ls",
        "score": 7,
        "subreddit": "shroomstocks",
        "created": 1633126970.0
    },
    {
        "author": "shaneizzard",
        "body": "I’ve generally had a great experience using Fidelity, and their lack of fees is hard to beat from a major US broker, but these are my two complaints. Their app is such trash that I just use the website, even on my phone. And they’re among the last brokers to process ticker changes on SPACs. At least the latter issue is fairly niche.",
        "created_utc": 1633106150,
        "id": "hezqlxf",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1633134950.0
    },
    {
        "author": "all-rightx3",
        "body": "Closing my fidelity account and going all in on Touchdown Tommy against the Patriots on Sunday #fuckit",
        "created_utc": 1633099850,
        "id": "hezbz6d",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633128650.0
    },
    {
        "author": "kevdawgie7",
        "body": "Fidelity won’t let me get to it. But, it does look intriguing.",
        "created_utc": 1633092022,
        "id": "heyvps5",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633120822.0
    },
    {
        "author": "BobsBurgersJoint",
        "body": "I really wish that fidelity didn't have the $50 foreign transaction fee",
        "created_utc": 1633129425,
        "id": "hf15z29",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633158225.0
    },
    {
        "author": "SirGlass",
        "body": "The target date fund is a nice set it and forget it I would check the expense ratio and also what its current allocation is, sometimes target date funds are too conservative for some people (hold more bonds than they want to) however they are still usually pretty good options\n\nThe other thing would be just to construct your own so you can allocate how you want to. I like the classic 3 fund portfolio  however because they do not have a total USA market fund you would have to do something like (NOte these are just sample allocations you can allocate how you want)\n\nFidelity 500 Index Fund 45%\n\nFidelity Mid Cap Index Fund 10%\n\nFidelity Small Cap Index Fund 5%\n\nFidelity Total International Index Fund 20%\n\nFidelity US Bond Index Fund 20%\n\nNote some people skip bonds before they are close to retirement or only like to hold 10-15% bonds",
        "created_utc": 1633099586,
        "id": "hezbdi3",
        "score": 3,
        "subreddit": "investing",
        "created": 1633128386.0
    },
    {
        "author": "9mac",
        "body": "Yeah my shares are currently locked and showing as MYCO:CA on Fidelity.",
        "created_utc": 1633101402,
        "id": "hezfjon",
        "score": 3,
        "subreddit": "shroomstocks",
        "created": 1633130202.0
    },
    {
        "author": "Dr_Clout",
        "body": "I never said I wanted it free dude.Are you in a bad mood today or something? 100% there was a major technical glitch which is the 2nd time it’s happened. It calculates my fucking portfolio +$2000 up when I purchased puts and the stock went up. I 100% understand that brokerages have commissions in general but even if I switched to TD Ameritrade or Fidelity or Webull… they don’t have commissions more than Robinhood from what I understand. We’re merely talking just to talk here. Good day.",
        "created_utc": 1633097883,
        "id": "hez7la8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633126683.0
    },
    {
        "author": "tamufc2018",
        "body": "Dont have to sell! Just call vanguard and initiate a drs share registration and they will take care of rest, fidelity took about 2 days for mine",
        "created_utc": 1633090749,
        "id": "heytgl4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633119549.0
    },
    {
        "author": "Djstevieo",
        "body": "Anyone else having problems with fidelity right now?",
        "created_utc": 1633096033,
        "id": "hez3l9c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633124833.0
    },
    {
        "author": "hydrocyanide",
        "body": "&gt;Based on my amateur research, it seems that for long term gains I should be investing in international, not US, because the US economy isn't looking too great in the long term. Someone on this subreddit suggested VXUS, but Fidelity shows that fund as \"weak\" across the short/mid/long term.\n\nVXUS is weak because US equity has dominated international equity for a long time, which is also directly at odds with the idea that the US economy \"isn't looking too great.\" I don't know how you arrived at that conclusion, but I would seriously reconsider if I were you.",
        "created_utc": 1633111889,
        "id": "hf03x03",
        "score": 2,
        "subreddit": "investing",
        "created": 1633140689.0
    },
    {
        "author": "almilian",
        "body": "You need to sell before 3pm unless you have the money to exercise, Fidelity does the same.",
        "created_utc": 1633115406,
        "id": "hf0bznv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633144206.0
    },
    {
        "author": "Mryop42",
        "body": "Don't forgot that Fidelity has index funds with zero expenses. ( FNILX, FZIPX, etc.)",
        "created_utc": 1633121556,
        "id": "hf0pknu",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633150356.0
    },
    {
        "author": "ClamPaste",
        "body": "0dte Disney 177.5c looking ripe for the picking. \n\nToo bad fidelity restricts 0dte or I would have picked it up for .08\n\nEdit: strike price. I fucked up typing. Fidelity is right to restrict my dumb ass.",
        "created_utc": 1633102376,
        "id": "hezhscz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633131176.0
    },
    {
        "author": "evilvyse",
        "body": "I picked up some bags yesterday thinking it is the dip, hopefully it bounces. 🙏 I think it had ticker problems yesterday, couldnt buy through fidelity.",
        "created_utc": 1633083648,
        "id": "heyjbmw",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1633112448.0
    },
    {
        "author": "Loadingexperience",
        "body": "The problem is that RH takes the money, lets say 50$ for GME share, routes that order to Citadel for PFOF. Citadel internalise that order and shits out and IOU for you. \n\nAll good so far right?\n\nBut Citadel as MM dont like to cover during major volatility so they keep taking these 50/60/70..$ orders while internalising order flow from RH or other PFOF broker(basically assuming short position), they know from experience that 99.99% of the time markets will calm down, the price will drop and they will be able to secure shares for favorable price to deliver them. PLEASE LET ME CLEAR THAT MOST OF THE TIME ITS DONE UNWILLINGLY BY ALGOS THAT RUN THE MARKET.\n\nSo what happened is that when GME started blowing  up at December/Early January algos took these 20/30/40$ orders gave out IOUs but never delivered actual shares. By mid Jan, some1 got margin call and realised that GME situation is that 00.01% event and now they are on the hook for 2700% payout compared to what they took in. \n\nThats why only PFOF brokers had to turn off buy button, because unlike brokers like fidelity that actually got their shares delivered they only had IOU but not the share and as soon as some1 pressed Sell button they had to pay from their own pocket the difference hence all the liquidity issues.",
        "created_utc": 1633071640,
        "id": "hey64io",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633100440.0
    },
    {
        "author": "bigtimetimmyjim22",
        "body": "Seeing an 11 cent b/a spread on Fidelity and 85k volume.  Volume has been much lower this week than the ~ 2.5M per it was doing before.  Spreads have always been on the large end. \n\nNot sure about the float.",
        "created_utc": 1633103194,
        "id": "hezjoun",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1633131994.0
    },
    {
        "author": "WolfofLawlStreet",
        "body": "Yep, alot of things actually. The whole GME thing, got in a huge fight with an old friend in college because he thought rh halted trading for 15 min instead of the SEC. LOL \n\nThat and people don't understand the automatic clearing house issue either. rh doesn't have that much book value to withstand that much volume when that happened too. They also weren't the only brokerage to do this either. No one is going after TD, Fidelity, or eTrade who did identical stops on it.",
        "created_utc": 1633089611,
        "id": "heyrkvn",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1633118411.0
    },
    {
        "author": "Scary-Drink8659",
        "body": "Is it just me or is the fidelity app acting gay?",
        "created_utc": 1633096015,
        "id": "hez3jvp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633124815.0
    },
    {
        "author": "william_cutting_1",
        "body": "Fidelity.",
        "created_utc": 1633117752,
        "id": "hf0h9jp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633146552.0
    },
    {
        "author": "Reddit_Roit",
        "body": "Drop robinhood and get fidelity. You can get penny stocks and it's a hell of a lot cheaper than other companies like td Ameritrade.",
        "created_utc": 1633117039,
        "id": "hf0fpk2",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1633145839.0
    },
    {
        "author": "emikoala",
        "body": "Target date is a safe place to stash your money. The Fidelity indexes are good because their expense ratios are typically 0.01-0.02% since a computer is doing all the work instead of a human investment advisor. Higher expense ratios aren't necessarily bad if the human-operated fund beats the computer-operated fund by a large enough margin, but that happens less often than you might think.\n\nI'm a relatively risk averse person who nonetheless understands that the optimal amount of risk is not zero, so my investing paradigm is to invest more in lower-risk ventures and less in higher-risk ones.\n\nMy retirement savings are roughly:\n\n* 28% target-date fund (pre-tax account)\n* 22% Fidelity 500 (pre-tax account)\n* 17% Fidelity Mid Cap (pre-tax account)\n* 13% Fidelity Small Cap (pre-tax account)\n* 20% speculative investments in a slew of stocks with high growth potential (post-tax account)\n\nYour mix could look different depending on your own risk tolerance, but for my 2c it helps steel my nerves enough to take the bigger swings like in my post-tax account if I'm only swinging with a small percentage of my savings and the majority of it is in a safer place. There's always a trade-off between risk and reward, you will need to find the sweet spot where you feel most comfortable. At some point you may realize you're not comfortable with as much risk as you thought, and at some point you may realize that you'd be comfortable with more risk, and you can change your 401k allocations along the way to match your comfort level.",
        "created_utc": 1633114427,
        "id": "hf09qy7",
        "score": 1,
        "subreddit": "investing",
        "created": 1633143227.0
    },
    {
        "author": "DeFi_ance",
        "body": "I recently switched over to Yubikey after using Authy for years, and I friggin' love it. It's far more secure and it's even quicker than pulling up an OTP code for sites that support the FIDO protocol directly, such as Coinbase and Gemini. For sites that don't support FIDO and still use OTP (what Authy/Google Auth is), Yubikey can do those too with a Yubico Authenicator app which requires your key to generate the codes.\n\nYubico's site has excellent setup guides and FAQs to get things going. The only downside is the expense, as you want to buy multiple keys to have a backup incase you lose your primary. But, if you've got a decent chunk of money to protect, spending a hundred bucks for a couple Yubikeys is well worth the vastly improved security.\n\nTradFi is so behind crypto on security models, it's insane. For Fidelity, TDA, and my three banks, they *all* only have SMS 2FA as an option, not even OTP. And for my trading platform, ThinkOrSwim, it doesn't have any 2FA at all to login and make trades. Drives me nuts.",
        "created_utc": 1633128863,
        "id": "hf14tiv",
        "score": 1,
        "subreddit": "investing",
        "created": 1633157663.0
    },
    {
        "author": "KidsAlwaysSeeGhosts",
        "body": "make him a fidelity account where he can invest his allowance",
        "created_utc": 1633118229,
        "id": "hf0ibeo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633147029.0
    },
    {
        "author": "Conscious-Soil9055",
        "body": "Yes, Webull still has flaws, but comparing Webull to fidelity is not even a fair fight.",
        "created_utc": 1633128700,
        "id": "hf14hf4",
        "score": 1,
        "subreddit": "options",
        "created": 1633157500.0
    },
    {
        "author": "Dr_Clout",
        "body": "I 100% understand I’m a scrub for using them. I have TD Ameritrade and Fidelity setup but no holdings. I just started using Robinhood so haven’t stopped. I realize I’m my own culprit but responding to everything like you did is like if I said “hey my speedometers off!” “Well you should’ve known that they make better fuckin cars”. My bad, I thought the speedometer worked.",
        "created_utc": 1633098135,
        "id": "hez85rq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633126935.0
    },
    {
        "author": "kiwimancy",
        "body": "Yes. You can buy fractional shares of an S&amp;P 500 index mutual fund like FXAIX which has a $0 minimum investment. You can also buy partial shares of an S&amp;P 500 index ETF like VOO from the Fidelity mobile app (I think it's not implemented on the website or desktop apps).",
        "created_utc": 1633116464,
        "id": "hf0eevb",
        "score": 1,
        "subreddit": "investing",
        "created": 1633145264.0
    },
    {
        "author": "Complete-Fact",
        "body": "Fidelity wouldn't let me trade options",
        "created_utc": 1633115221,
        "id": "hf0bkkm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633144021.0
    },
    {
        "author": "RunawayMoon",
        "body": "Great question here and looking to see answers from others as well. Same demographics as yourself.\n\nRecently consolidated my investments into three active strategies (one with fidelity) and have no regrets. Out of the US here so YMMV.",
        "created_utc": 1633104826,
        "id": "hezni5d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633133626.0
    },
    {
        "author": "Conscious-Soil9055",
        "body": "Switched to fidelity to avoid pfof and consolidate accounts. I kept my Webull account active because the mobile app blows everything else away. I like it so much better. I really wish Fidelity would just buy Webull.",
        "created_utc": 1633081418,
        "id": "heygsur",
        "score": 1,
        "subreddit": "options",
        "created": 1633110218.0
    },
    {
        "author": "mike7x",
        "body": "TMC up on insider buy. From Fidelity:\n\n$TMC Insider Buy: TMC The Metals Co\r  \n09:35 AM EDT, 10/01/2021 (MT Newswires) Andrei Karkar, 10% Owner, Director, on Sept 30, 2021, executed a purchase for 2,250,110 shares in TMC for $9,999,939. Karkar has control over a total of 41.8M shares...value is approximately $186,123,323.",
        "created_utc": 1633101803,
        "id": "hezgh06",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633130603.0
    },
    {
        "author": "justsomeitguyhere",
        "body": "I've never had a fidelity account, but I see this question with a lot of US brokers, read the fine print",
        "created_utc": 1633116085,
        "id": "hf0djuf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633144885.0
    },
    {
        "author": "Conscious-Soil9055",
        "body": "If you get a chance you should download Webull's app. Fidelity's app for active traders/investors is worthless. For checking account balances it is fine, much past that is clunky and doesn't work well. They obviously tried to make it look like Robinhood. No idea why, that's a terrible app as well. Yes, I'm very hard on fidelity for the app but it's only because fidelity is the best in the industry and I want fidelity to have the best tools.",
        "created_utc": 1633126097,
        "id": "hf0z26z",
        "score": 1,
        "subreddit": "options",
        "created": 1633154897.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "\"if not they are making money another way.\"\n\nThat's exactly it! They make money another way, by offering additional financial planning services, from margin, and from options.\n\nBy providing a high quality trading platform that is totally free, and has market-leading price improvements since they don't use PFOF, they create trust advertise their other services.\n\nFidelity is trusted, and that is an important point.",
        "created_utc": 1633122570,
        "id": "hf0rr20",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633151370.0
    },
    {
        "author": "lyleberrycrunch",
        "body": "Yeah unfortunately for most blue-collar folks that’s how it is. It’s big finance and it’s confusing and most working families don’t know if they can trust it. But that’s mostly because they haven’t seen the historical data (hundreds of years of it). And they tend to draw a false equivalency between options trading/gambling and dollar-cost-averaging into VT or VTI\n\nI think a lot of it comes from accessibility and family influence: back in the day it used to cost a bunch of money to trade and it was super hard to do so most didn’t even bother. And if your parents don’t know anything about stocks, they won’t teach you. I was lucky in that I grew up in a very stock-friendly household with CNBC going 24/7. I was aware of the market in elementary school lol but I recognize this isn’t how most people grew up\n\nAnyways, yeah there’s usually no need for financial advisors. Odds are they’ll get complicated, try to get fees out of you and whatever they tell you will probably underperform VT or VTI anyway. Great choice with Fidelity by the way, they’re an excellent broker. And even if you lost money giving into the hype on CLOV, hopefully you can consider it a cheap “intro to the stock market course” because at least it got you more involved\n\nAlso, just want to mention that there’s probably no need to own VTI and VT/VXUS. If you already own all 3, I wouldn’t bother selling though. Basically VTI is total US stock market, VT is total all stock market and VXUS is total non-US stock market so VT is just a combination of VTI/VXUS. Currently it’s about 62% VTI and 38% VXUS because of the size of the US market but it’s up to you how much you want to weight international. I tend to go less as I have a bit of a preference toward US stocks so I like the weighting you currently have\n\nAnd yeah, I still check my brokerage app way too often but oh well. Just don’t ever panic sell even if the market crashes and try not to act on emotion. I remember people selling when the market was down 7-10% per day during March 2020, thinking they’d buy back later, meanwhile I bought the entire time and the market rallied extremely quickly. Some are still waiting on the sidelines hoping they’ll get the correction they were hoping for. Just remember the two key phrases “more money has been lost trying to anticipate corrections than lost in the corrections themselves” and “time in the market beats timing the market”",
        "created_utc": 1633112108,
        "id": "hf04eyi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633140908.0
    },
    {
        "author": "not_that_kind_of_dr-",
        "body": "I've was able to buy IONQWS an hour ago in the fidelity app\n\nA few weeks ago they offered a toggle to a new 'BETA' interface. I had trouble with that, and switched back.\n\nOne other thing I noticed, just in the past week or so, on Android, if I try to adjust the price of an existing limit order, I would consistently get a crash. So instead I just cancel and then submit a new one. Is that what is affecting you? But that is unusual, over the past year or so I can't remember any other problems.\n\nTheir free  desktop trader pro software is way better than the phone app.",
        "created_utc": 1633110557,
        "id": "hf00ud8",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1633139357.0
    },
    {
        "author": "JimboMcMidges",
        "body": "Hello, I am 44 living in the US. I have $6,270 available to invest from my SEP-IRA and I am only 44 so I have 20 years for a long-term investment and I would prefer a high yield. I currently have $6,500 split between VOO and VOOV. Based on my amateur research, it seems that for long term gains I should be investing in international, not US, because the US economy isn't looking too great in the long term. Someone on this subreddit suggested VXUS, but Fidelity shows that fund as \"weak\" across the short/mid/long term. Are there any international funds that are a better bet? Thanks!",
        "created_utc": 1633111291,
        "id": "hf02jtw",
        "score": 1,
        "subreddit": "investing",
        "created": 1633140091.0
    },
    {
        "author": "ParsleySalsa",
        "body": "I dont know if I'm in the correct sub. Is this where we can ask totalnoob questions? \n\n I just want to know if I can buy $8 worth of the s&amp;p. I bought a full share of a stock on fidelity which was simple. About $8 is all the cash left in the fidelity account.  Is buying partial the same process?",
        "created_utc": 1633115841,
        "id": "hf0czi6",
        "score": 1,
        "subreddit": "investing",
        "created": 1633144641.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "From their website.\n\nI simply looked up the stock most people who recommend them are investing in, and it has a 5% reinvestment fee.\n\nI'm sure you can find stocks on there without a reinvestment fee. Instead of not paying any fees, across the board, as I do, you pay varying fees depending on which stock you buy.\n\nIt also has  $5 one-time investment fee, and a $2.50 recurring fee. Every time you trade there is a surcharge. Plus $.05 per share!\n\nWhat is the case for not \"trusting\" Fidelity? I understand the case for not trusting PFOF and trading apps, but those aren't the only brokerage options.",
        "created_utc": 1633120438,
        "id": "hf0n4po",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633149238.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "Target and MasterCard",
        "created_utc": 1633096863,
        "id": "hez5d46",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633125663.0
    },
    {
        "author": "Dmoan",
        "body": "We could drop as low as 412 which is 200 day MA before it finds its support and bounces back or breaks thru and falls lower.",
        "created_utc": 1633078639,
        "id": "heydtx6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633107439.0
    },
    {
        "author": "Seven11Eleven",
        "body": "I just need a ticker that just consistenly keeps ticking up, just like ma boy spy did but JP scaring me off :(",
        "created_utc": 1633099770,
        "id": "hezbsh2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633128570.0
    },
    {
        "author": "Warren_Guh_Buffet",
        "body": "Dude BABA was Xi trying to screaw Ma. It had nothing to do with America or politics, dude stop with the conspiracy theories. BABA being a $150 stock today is also because of uncertainty. No one in Wallstreet knows if Xi will simply break up the company. Wallstreet  again could care less about politics, you call me naive yet you reference YouTube as a place where you think anti Chinese sentiment is driving the equities markets. Are you listening to yourself? Wallstreet doesn't care what some random Youtuber with 200 subs feels about China. It's all about earnings reports and going through them with a fine tooth comb. However when a good company like BABA is being attacked by a whole ass country, smart money gets out and waits to see what shoe will drop next. No amount of great earnings reports can combat Xi deciding to simply shut down BABA. As far as you not wanting Chinese stocks in Western markets, be careful what you wish for, the only reason BABA's market cap is what it is today is because of Western money. If all Chinese stocks get delisted, they lose 95% of their value instantly. China alone will not be able to keep BABA's MC $500 bil+",
        "created_utc": 1633085592,
        "id": "heylqm5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633114392.0
    },
    {
        "author": "DiscePati44",
        "body": "413 ish. 150 ma is 423 which also so happens to be the next support line",
        "created_utc": 1633096079,
        "id": "hez3op1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633124879.0
    },
    {
        "author": "aero_kitten",
        "body": "You can use any MA you want, depending on what conclusion you prefer.",
        "created_utc": 1633099523,
        "id": "hezb8em",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633128323.0
    },
    {
        "author": "xavier8100",
        "body": "Engrish not ma furst languaee",
        "created_utc": 1633078722,
        "id": "heydx3e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633107522.0
    },
    {
        "author": "option-trader",
        "body": "Oh, it'll definitely be difficult, but the trend since the start of September has been down and being held down by its 10 and 20-day ma. Right now, investors are selling every rally. $420 would be a stopping point, but if Spy was going to go for it, then $412 would be the ultimate target for this drop. That'll reset a lot of stocks and create the buying opportunity to take this to record levels.",
        "created_utc": 1633092840,
        "id": "heyx885",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633121640.0
    },
    {
        "author": "lohith15",
        "body": "How much is the current spy 200 MA ?",
        "created_utc": 1633096034,
        "id": "hez3lag",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633124834.0
    },
    {
        "author": "fountn",
        "body": "no way i’m eating that microchip",
        "created_utc": 1633090245,
        "id": "heysmal",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633119045.0
    },
    {
        "author": "urbfbrbr",
        "body": "What if the microchip is suppository. would that change your mind?",
        "created_utc": 1633090861,
        "id": "heytnma",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633119661.0
    },
    {
        "author": "albatross_the",
        "body": "If global warming destroys our planet it will happen relatively slowly. By that I mean, it all won't go to shit in a day. Plenty of profitable companies will exist, and new companies will be made to mitigate things and keep the human world running. Problems require solutions or adapting and that requires money. If you invest properly while global warming alters the planet you will be rich. Case in point: now",
        "created_utc": 1633089642,
        "id": "heyrmpj",
        "score": 43,
        "subreddit": "investing",
        "created": 1633118442.0
    },
    {
        "author": "Chippopotanuse",
        "body": "| “SEC’s chair Gary Gensler promised a report on GME by the end of summer. Summer has gone and there’s still no report.\n\nCitadel is accused in a class action lawsuit by GME traders of pressuring Robinhood to freeze GME stock buying during the short squeeze in January.\n\nSEC has not stated it will investigate such allegations, with Gensler instead talking of the ‘gameification’ of stock investing.\n\nHis buddy, Berkovitz, will now perhaps help him further with that focus on ‘gameification’ after getting checks from Citadel, but whether the report will or will not address the crucial allegations, remains to be seen.\n\nThe clear conflict of interest where Berkovitz is concerned, however, is shown by an astonishing statement he made in June when he said in a speech:\n\n“A threshold question is whether the public will benefit from disrupting the current financial system that relies extensively on financial intermediaries.”\n\nWhat a heap of BS. This needs to get investigated. Sure, we need financial intermediaries. But we need ones that aren’t fucking over the retail customers and rigging the markets.",
        "created_utc": 1633085750,
        "id": "heyly9s",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1633114550.0
    },
    {
        "author": "IntoxicatedParabola",
        "body": "Now this is the DD I'm looking for",
        "created_utc": 1633086537,
        "id": "heymzvg",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1633115337.0
    },
    {
        "author": "Pidgey_OP",
        "body": "Not sure if you've been watching but we've been developing said technology for oh about 60 years now. We're gettin' kinda good at it too. Don't even blow that much shit up anymore when we send it to space\n\nMoon colonies are much more on the horizon than something like Mars though",
        "created_utc": 1633089949,
        "id": "heys4pz",
        "score": 28,
        "subreddit": "investing",
        "created": 1633118749.0
    },
    {
        "author": "LouisGrip",
        "body": "This is the type of shit that makes me suicidal. I woke up counting my money that my puts were going to make only to have futures absolutely fucking moon for no reason now I'm set to lose money.",
        "created_utc": 1633089137,
        "id": "heyqtut",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1633117937.0
    },
    {
        "author": "AstroDan18",
        "body": "Now then, I just need SPY to hit 445 by EOD.",
        "created_utc": 1633089081,
        "id": "heyqqnj",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1633117881.0
    },
    {
        "author": "IncognitoCumShot",
        "body": "Alright bears you’ve had your turn, back to the homeless shelter now",
        "created_utc": 1633088516,
        "id": "heypuyk",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1633117316.0
    },
    {
        "author": "webulltrade",
        "body": "Remember when SPY first hit 420 and people were like, wow, SPY is so high. Well, now that it's back near 420, isn't still high?",
        "created_utc": 1633077075,
        "id": "heyc5of",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1633105875.0
    },
    {
        "author": "Lord_Cockswain",
        "body": "Seeking to make a lot of manufactories and buildings, Xi debased the currency and took too many loans and now the government is losing financial and political stability. Any EU4 player could have predicted it.",
        "created_utc": 1633081715,
        "id": "heyh4g3",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1633110515.0
    },
    {
        "author": "ArtichokeJean",
        "body": "You realize smart TVs have been a thing for probably over 10 years now? Just a personal preference - I prefer just a dumb TV + a Roku or Nvidia Shield.",
        "created_utc": 1633090084,
        "id": "heyscou",
        "score": 11,
        "subreddit": "stocks",
        "created": 1633118884.0
    },
    {
        "author": "Keirt12345677",
        "body": "You’ve got to be in it to win it they said!\n\nI’ve been in it and I’m now bankrupt.",
        "created_utc": 1633075696,
        "id": "heyanfo",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1633104496.0
    },
    {
        "author": "coxidasical",
        "body": "The bulls in here are clinging on to anything that will save their worthless calls right now 😂",
        "created_utc": 1633090769,
        "id": "heythve",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1633119569.0
    },
    {
        "author": "BlackCurlyHair",
        "body": "GUYS I GOT A ONCE IN A LIFETIME OPPORTUNITY IRS SAID I OWE 50k BUT IF I PAY 25K RIGHT NOW THEYRE GONNA EXTEND MY CARS WARRANTY",
        "created_utc": 1633088690,
        "id": "heyq4eo",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1633117490.0
    },
    {
        "author": "LouisGrip",
        "body": "Fuck my puts were going to print bigly at open guess not now.",
        "created_utc": 1633086342,
        "id": "heymqhk",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633115142.0
    },
    {
        "author": "Impressive-Bad8264",
        "body": "Now If they’d just remove that login requirement…",
        "created_utc": 1633090735,
        "id": "heytfpn",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633119535.0
    },
    {
        "author": "RonDiDon",
        "body": "When will people learn... DO NOT go heavy on long AAPL calls when it's at it near ATHs especially when the market is at or near ATHs.. look at the chart history; you're setting yourself up for failure. AAPL will almost always be a disappointment if you trade it like that because that's when you should short it. And you should go long when everything looks bearish on AAPL, so like now or when AAPL gets back in the 130s should you get long 150 calls.",
        "created_utc": 1633088157,
        "id": "heypbaa",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633116957.0
    },
    {
        "author": "Putins_Orange_Cock",
        "body": "It’ll take another trip to 300 at the very least and it’s a 160 dollar stock right now. If it were a start up it’d be the darling of Wall Street. A couple billion in funds, rockstar e-commerce team led by people from Amazon, google, chewy, spearheaded by a guy with proven success tackling Amazon and winning  in retail segment, and rabid brand loyalty and recognition. I am 40 years old, haven’t played a game in 10 years, but have a game stop powerup account, credit card, and just bought a tv from them. They’d be 500 bucks if they weren’t the stock that caught Wall Street with their pants down. \n\nI have a few April 2022 contracts  that I’ll pmcc until what I believe the inevitable trip to 300 starts.",
        "created_utc": 1633089798,
        "id": "heyrvtm",
        "score": 8,
        "subreddit": "options",
        "created": 1633118598.0
    },
    {
        "author": "polynomials",
        "body": "You can mine steel now? This must be one of the most revolutionary innovations that no one has heard of",
        "created_utc": 1633090669,
        "id": "heytbks",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633119469.0
    },
    {
        "author": "hshamza",
        "body": "Imagine calling the QQQ 380 top perfectly and buying a shit ton of puts over the last month...\n\nNow if I didn't waste 30% on blackjack it would be even cooler...",
        "created_utc": 1633082926,
        "id": "heyihef",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633111726.0
    },
    {
        "author": "onis_uk",
        "body": "It's not really the markets fault now is it... it's people aping into stocks using investment strategies they don't really understand that's causing them to lose money!!!",
        "created_utc": 1633080956,
        "id": "heygayv",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633109756.0
    },
    {
        "author": "SalmonTheSalesman",
        "body": "Bears last night: BUL FUK! BUL FUK! RECESSION IS IN!!!\n\nBears now: *Selling their house to pay for their margin call*",
        "created_utc": 1633090091,
        "id": "heysd4l",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633118891.0
    },
    {
        "author": "gary_oldman_sachs",
        "body": "Big corn is going crazy right now. Could be a good day for risk assets.",
        "created_utc": 1633084915,
        "id": "heykuqx",
        "score": 7,
        "subreddit": "stocks",
        "created": 1633113715.0
    },
    {
        "author": "Rothiragay",
        "body": "Why is everyone spamming pennystocks on this subreddit now? Every day there is a new ticker posted with a few 100 million$ in market cap",
        "created_utc": 1633087683,
        "id": "heyolpz",
        "score": 7,
        "subreddit": "stocks",
        "created": 1633116483.0
    },
    {
        "author": "morozrs5",
        "body": "This can happen indeed. But even if everything you said happen it is still a less favorable scenario than in the past century. As I said earlier, I didn't say the economy won't grow, just grow less than in the past century.\n\nIn the past century all countries were growing in population, and all countries needed to develop. Look at Japan, China, Italy, and most places in the 1900.\n\nTechnology advancements were happening then and are happening now. Apart from that, everything is different.\n\nTake a look at the Japanese stock market, stuck for decades and the population is shrinking. Nobody can say that Japan lacks technology and development.\n\nLastly, immigration from third world countries is only viable if their population is growing, if many of them start shrinking in population, where will the immigrants come from...",
        "created_utc": 1633090638,
        "id": "heyt9qq",
        "score": 7,
        "subreddit": "investing",
        "created": 1633119438.0
    },
    {
        "author": "SuperPwnerGuy",
        "body": "Lol, You see....the funny thing about being so reliant on Chinese imports, Is that they can jack the price up 10x on exports and declare a container shortage because of the \"pandemic\".....\n\n......because that's what happened just now.",
        "created_utc": 1633072168,
        "id": "hey6qi7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633100968.0
    },
    {
        "author": "ropingonthemoon",
        "body": "Yes, opportunity cost. DAs have slowed down quite a bit so you might wait quite a while.\n\nThere are other SPACs which have been trading for some time now with units still around $10.",
        "created_utc": 1633074352,
        "id": "hey96o6",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1633103152.0
    },
    {
        "author": "Fraggleschoolofrock",
        "body": "Lol. Too many zero hedge dipshits on this site now",
        "created_utc": 1633078707,
        "id": "heydwiz",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633107507.0
    },
    {
        "author": "theinternetishere12",
        "body": "After all that fucking shit SPY put me through.\n\nShe was 425 overnight. No bullshit. 424\n\nNow she’s fucking 430",
        "created_utc": 1633087999,
        "id": "heyp2o3",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633116799.0
    },
    {
        "author": "Whoopiskin",
        "body": "Green Day is now awake, green day confirmed!!!!",
        "created_utc": 1633087986,
        "id": "heyp208",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633116786.0
    },
    {
        "author": "JuniorLet4879",
        "body": "I’m currently wheeling with a throw away account essentially. The chaotic market right now is keeping me from investing heavily so I’m just going to build a small account and see where it goes.",
        "created_utc": 1633088023,
        "id": "heyp3y8",
        "score": 6,
        "subreddit": "options",
        "created": 1633116823.0
    },
    {
        "author": "lotus_bubo",
        "body": "So VIX was down yesterday because nobody was hedging, assuming the bear market would be done when the government shutdown drama ended.\n\nCongress passed a temporary budget after hours and then… no buyers. Now everyone’s caught with their pants down and panic is coming.",
        "created_utc": 1633075952,
        "id": "heyaxgf",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633104752.0
    },
    {
        "author": "InternetUsername2",
        "body": "Yeah, everyone is always a bit discouraged if they start investing right before things go down a few %. Happened around feb/march too when a lot of tech and other volatile stocks dropped a lot.\n\nSolid picks and hold right now, or if it's a broad etf, just ignore it for awhile. Most holdings aren't meant to be checked daily (no benefit); that typically just makes a new investor make bad decisions or, at minimum, stress more!",
        "created_utc": 1633085964,
        "id": "heym8d3",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1633114764.0
    },
    {
        "author": "qiratalha",
        "body": "Great question! Yes, you can calculate the probability of touch for a *fixed* target stock price in closed-form. The issue we have to address is the fact that, in our case, the target stock price is changing every day we hold the position! \n\nIt's better to explain this with an example:\n\nSay we sell a $1.00 put that expires in 45 Days. We will hold this position until expiration BUT we will close it if we hit 50% of max profit ($0.5). What is the probability of hitting 50% of max profit up until expiration?\n\nAt 45 DTE: you've just opened the position. In order for you to close the position, the short put value has to drop to $0.5. What stock price corresponds to this short put value? If we know the corresponding stock price we can use the Brownian Motion model to calculate the Probability of Touch (PTO) at 45 DTE. Well, we could use the Black-Scholes model to establish the relationship between stock price and options value. This model is pretty complex that takes in multiple inputs like time till expiration, volatility, etc. Great, we can now calculate the 'target' stock price and its corresponding PTO at 45 DTE!\n\nat 44 DTE: Unfortunately, you didn't hit the target stock price at 45 DTE so what's the PTO at 44 DTE? You still need a short put value of $0.5. What stock price corresponds to this short put value? We can use the Black-Scholes model again but now you're inputting different values for time till expiration, volatility, etc. Your target stock price is now different and so is your PTO at 44 DTE.\n\nYou can collect **all** the PTO's for every day up until expiration and do some fancy math to calculate the probability of hitting 50% of max profit up until expiration. But here's the problem: The Black-Scholes model is pretty complex and, to my knowledge, there is no closed-form way of calculating the corresponding stock price given an options value with this model; you would need to use numerical methods to do it. Hence, there is no closed-form way to calculate the probability of hitting 50% of max profit up until expiration.\n\nThe above strategy for calculating the probability of hitting 50% of max profit is plausible but not the same as Monte Carlo Simulations. I thought it would be easier to highlight the complexity of the problem by explaining that strategy. Monte Carlo takes a more stochastic approach where *thousands* of individual simulations are run for the stock price and a probability is averaged out. It's better explained on the website. You could think of it as a more brute-force approach relative to the other strategy with the downside of lower accuracy and being more computationally heavy. However, the upside with Monte Carlo is that you can use much more complex models with it if you wanted to. Maybe you don't want to use Black-Scholes and wanted to use a more complex options pricing model. Maybe you don't want to assume that IV is constant and wanted to use an IV model. Monte Carlo would be a much better choice for these situations. \n\nHope this answers your question!",
        "created_utc": 1633074614,
        "id": "hey9h8k",
        "score": 6,
        "subreddit": "options",
        "created": 1633103414.0
    },
    {
        "author": "14dM24d",
        "body": "that guy who's keeping the market afloat for now because he hasn't gone all in yet.\n\nexactly why we can't have good stuff together!! just can't count on others to cover your back.",
        "created_utc": 1633085569,
        "id": "heylpho",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633114369.0
    },
    {
        "author": "AltPossum",
        "body": "New month. Big drop all last month. Time for up now.",
        "created_utc": 1633088543,
        "id": "heypwf7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633117343.0
    },
    {
        "author": "Annoying_Orre",
        "body": "Yeah I totally agree with you, it's literally inevitable at this point in history. Now it's more about how severely it will effect humanity not IF it will effect us. \n\nI'm just tired of all the \"will the market crash or not\" when you're talking about an event worse than 2008? I mean of course that will greatly impact markets negatively and if we're talking about global warming we're talking about a total system collapse most likely",
        "created_utc": 1633086236,
        "id": "heyml8a",
        "score": 5,
        "subreddit": "investing",
        "created": 1633115036.0
    },
    {
        "author": "jackperitas",
        "body": "So another bull trap or it's a safe space now?",
        "created_utc": 1633090467,
        "id": "heyszii",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633119267.0
    },
    {
        "author": "Unfamous_Trader",
        "body": "Where’d all the bears go? This place was littered with bears and now they all gone",
        "created_utc": 1633089392,
        "id": "heyr8ft",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633118192.0
    },
    {
        "author": "giovanny2214",
        "body": "Ok September is over. Safe to buy calls now. Spy $450 eod.",
        "created_utc": 1633087663,
        "id": "heyokpn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633116463.0
    },
    {
        "author": "TopBuyer777",
        "body": "Spy low 426.01 now 430.50 could easily open 435-440 area",
        "created_utc": 1633088526,
        "id": "heypvgn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633117326.0
    },
    {
        "author": "Feedmepi314",
        "body": "I now appreciate markets closing on weekends and look forward to sleeping tomorrow night",
        "created_utc": 1633072224,
        "id": "hey6ssb",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633101024.0
    },
    {
        "author": "SalmonTheSalesman",
        "body": "NIO making me really proud right now",
        "created_utc": 1633089600,
        "id": "heyrk8w",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633118400.0
    },
    {
        "author": "Rothiragay",
        "body": "There is no point in enetering FAMI right now. Just like BABA and Tencent it will become a bagholder stock again",
        "created_utc": 1633076071,
        "id": "heyb22e",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633104871.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "Americans now paying the highest price for bacon in the last 40 years on a cost adjusted basis. \n\n\nBut inflation is TrAnsItOrY....",
        "created_utc": 1633083926,
        "id": "heyjnmd",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633112726.0
    },
    {
        "author": "fufm",
        "body": "Oh shit we are fucked again. I actually made it until now before checking.",
        "created_utc": 1633075370,
        "id": "heyaaq8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633104170.0
    },
    {
        "author": "dumbledoreRothIRA",
        "body": "yea dude my life is excrement! you feel good about yourself now yea? happy for you bro!",
        "created_utc": 1633081981,
        "id": "heyheyx",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633110781.0
    },
    {
        "author": "origami_asshole",
        "body": "Nice, put about 20k on calls it myself. What’s insane is that with AMC’s marketcap Dole would be actually around $169.00. People here forgot that things go up for reasons other than squeezes.\n\nRight now DOLE 69 is like GME 69, It seems too good to ever happen, but it very well might, and then it’d still be a fraction of AMC.",
        "created_utc": 1633090820,
        "id": "heytl2e",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633119620.0
    },
    {
        "author": "Rich265",
        "body": "You wanted forced jabs, now how you like this one in the rump?!",
        "created_utc": 1633072232,
        "id": "hey6t3i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633101032.0
    },
    {
        "author": "tomfoolery1070",
        "body": "ES went from -.85% to now +.45%\n\nPretty wild",
        "created_utc": 1633089610,
        "id": "heyrkuk",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633118410.0
    },
    {
        "author": "LovableContrarian",
        "body": "And what was the tweet? I remember when he actually shorted it, and it was near $900.\n\nHe's  been tweeting that it's overvalued for a long time, but that's a tweet, not a short position.\n\nLikewise, I've been talking about how spy is a bubble for about a year now, but I don't have puts.",
        "created_utc": 1633084037,
        "id": "heyjsal",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633112837.0
    },
    {
        "author": "LovableContrarian",
        "body": "Lmao, now the indexes are just being cruel.\n\nThey didn't want to just go green, they out hear mocking bears and ruining lives.",
        "created_utc": 1633088303,
        "id": "heypjbl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633117103.0
    },
    {
        "author": "gary_oldman_sachs",
        "body": "Last hour dumps had a lot to do I think with end-of-month/quarterly rebalancing on the part of huge funds. Might be different now that we’re in October.",
        "created_utc": 1633089246,
        "id": "heyr03a",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633118046.0
    },
    {
        "author": "picciona4",
        "body": "Imagine following futures the last few weeks…would be bankrupt by now.",
        "created_utc": 1633078527,
        "id": "heydplx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633107327.0
    },
    {
        "author": "idsimon",
        "body": "Account came back to even in the beginning of Sept. after 10 months in the red. Now back down 50% again.\n\nI love/hate options",
        "created_utc": 1633079738,
        "id": "heyezwy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633108538.0
    },
    {
        "author": "LarryGlue",
        "body": "Drill Team Six is now captained by Bruce Willis.",
        "created_utc": 1633084588,
        "id": "heykg62",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633113388.0
    },
    {
        "author": "Warren_Guh_Buffet",
        "body": "Wtf are you talking about? Evergrande's debacle mixed in with the countless other public Chinese companies bleeding down to zero is not orchestrated by the media. Do you live under a rock? So Didi going from $20-$7, Baba going from $300+-$150, every Chinese education stock being down 90%+ because of crakdowns, Wish who IPO'd at $17+ and now is a $5 because their business is fundamentally broken is all Western media FUD? \"Evergrande is not a big deal for China\"? I guess $600 Bil in debt with way to pay it while they are also defaulting on bond payments is just Media FUD... Are you actually serious? Fun fact, did you know that Lehman Brothers were also $600 bil in debt just before they collapsed? Call it media driven FUD all you want but defaulting on $600 bil is not chump change and it certainly won't endear your country to Western money investing in the future. Especially when you never tell the world the truth.",
        "created_utc": 1633081197,
        "id": "heygkad",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633109997.0
    },
    {
        "author": "No-Shine-9632",
        "body": "Should we Panic now?",
        "created_utc": 1633075472,
        "id": "heyaeqf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633104272.0
    },
    {
        "author": "damienDev",
        "body": "Alibaba don't have enough liquidity to pay foreign investors now",
        "created_utc": 1633082843,
        "id": "heyidza",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633111643.0
    },
    {
        "author": "Practical-Donkey5888",
        "body": "Well written, no need to jump in now. This would of been less fishy if it was a straight IPO but something is wrong with this SPAC. Wait until after the merger",
        "created_utc": 1633086368,
        "id": "heymrop",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1633115168.0
    },
    {
        "author": "RegretTMRW",
        "body": "27p on VXX for next Friday are looking sketchy as fuck right now. I might be destitute",
        "created_utc": 1633072616,
        "id": "hey7950",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633101416.0
    },
    {
        "author": "BarronVonCheese",
        "body": "Ken: now Vlad. Please just lay down in front of this here bus. \nVlad: am I doing it right?\nKen: Stay still now. This won’t hurt, much…",
        "created_utc": 1633072865,
        "id": "hey7jca",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633101665.0
    },
    {
        "author": "Dorktastical",
        "body": "Sweet thanks for the tip, lets all start talking about Nok now and see if it still happens.",
        "created_utc": 1633072494,
        "id": "hey7418",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633101294.0
    },
    {
        "author": "SlothInvesting1996",
        "body": "House buying season is over. Not many people buying during the fall and winter. Things will pick back up in the spring. Rocket will be a rock for now",
        "created_utc": 1633084153,
        "id": "heyjxcs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633112953.0
    },
    {
        "author": "patrick8515",
        "body": "Profit taking now, because you gotta get your christmas shopping done early ?",
        "created_utc": 1633083917,
        "id": "heyjn6w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633112717.0
    },
    {
        "author": "TJMBeav",
        "body": "Now selling options????  You're learning",
        "created_utc": 1633080375,
        "id": "heyfocx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633109175.0
    },
    {
        "author": "Jetola",
        "body": "I know GOGO has a history af not maintaining its gains. Lots of people have bad experience with GOGO and bagholding. But, the share is at its highest right now. Bagholders who didnt sell with a loss are out now. Normally GOGO would fall down after a pop - but it didnt this time.\n\nThis is think is due to the good news, the outlook of 5G network in their solution - the announcement of expected increased aernings and also the report that shows insiders bying more in the company the last 12 months.\n\n[https://finance.yahoo.com/news/one-gogo-inc-nasdaq-gogo-112701505.html](https://finance.yahoo.com/news/one-gogo-inc-nasdaq-gogo-112701505.html)",
        "created_utc": 1633087415,
        "id": "heyo7rs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633116215.0
    },
    {
        "author": "TheStorm007",
        "body": "What? I’m looking at it right now on twitter.",
        "created_utc": 1633090034,
        "id": "heys9r4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633118834.0
    },
    {
        "author": "trekink_freeO1lyF4ns",
        "body": "I need to learn how to make safer riskier moves I love my voo and voog I’m enjoying the firsale on pton right now like I don’t think people are going to stop buying their stuff",
        "created_utc": 1633085393,
        "id": "heylgwd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633114193.0
    },
    {
        "author": "subredditsummarybot",
        "body": "Your Weekly /r/stocks Recap\n\n\n\n**Friday, September 24 - Thursday, September 30**\n\n###Top 10 Posts\n\n| score | comments | title &amp; link |\n|--|--|--|\n| 14,839  | [2,440 comments](https://www.reddit.com/r/stocks/comments/px5pjh/zillow_is_paying_above_market_price_for_houses/)  | Zillow is paying above market price for houses|\n| 3,262  | [1,848 comments](https://www.reddit.com/r/stocks/comments/pxyrnh/wtf_is_going_on_with_the_market/)  | Wtf is going on with the market?|\n| 2,223  | [351 comments](https://www.reddit.com/r/stocks/comments/pvg5rg/costco_nike_and_fedex_are_warning_theres_more/)  | `[Industry News]` Costco, Nike and FedEx are warning there’s more inflation set to hit consumers as holidays approach|\n| 2,139  | [291 comments](https://www.reddit.com/r/stocks/comments/pw8wgi/disneys_shangchi_becomes_years_top_grossing_film/)  | `[Company Discussion]` Disney's 'Shang-Chi' Becomes Year's Top Grossing Film!|\n| 1,299  | [104 comments](https://www.reddit.com/r/stocks/comments/puhzzv/should_you_follow_insider_transactions_i_analyzed/)  | `[Meta]` Should you follow insider transactions? - I analyzed 4000+ insider trades and benchmarked the return against S&amp;amp;P 500. Here are the results!|\n| 1,236  | [333 comments](https://www.reddit.com/r/stocks/comments/pyp0fa/reverse_repo_hits_staggering_16t_breaking_records/)  | Reverse Repo hits staggering 1.6T, breaking records daily|\n| 968  | [884 comments](https://www.reddit.com/r/stocks/comments/puvj5y/i_want_to_invest_20000_by_just_setting_it_and/)  | `[Advice Request]` I want to invest $20,000 by just setting it and forgetting it, what do I do?|\n| 918  | [976 comments](https://www.reddit.com/r/stocks/comments/pvvzsl/whats_your_top_5_stocks_to_buy_and_hold_for_the/)  | `[Industry Discussion]` What’s Your Top 5 Stocks to Buy and Hold for the Next Decade!|\n| 896  | [1,544 comments](https://www.reddit.com/r/stocks/comments/pupmem/what_is_a_stock_that_you_believe_will_crash_and/)  | `[Industry Discussion]` What is a stock that you believe will crash and burn?|\n| 864  | [98 comments](https://www.reddit.com/r/stocks/comments/pwqgq9/dallas_fed_president_kaplan_to_retire_early_on/)  | Dallas Fed President Kaplan to retire early on Oct. 8, citing trading disclosure ‘distraction’|\n\n\n&amp;nbsp;\n\n###5 Most Commented\n\n| score | comments | title &amp; link |\n|--|--|--|\n| 602  | [641 comments](https://www.reddit.com/r/stocks/comments/pvblkn/what_stocks_currently_at_their_52_week_lows_or/)  | What stocks currently at their 52 week lows or below their March/April 2020 price do you think have the best chance of recovering?|\n| 485  | [527 comments](https://www.reddit.com/r/stocks/comments/py5pig/it_looks_like_a_gov_shutdown_is_a_real_possibility/)  | `[Industry News]` It looks like a gov shutdown is a real possibility:|\n| 401  | [457 comments](https://www.reddit.com/r/stocks/comments/putqb4/baba_never_ending_dip/)  | BABA never ending dip|\n| 587  | [330 comments](https://www.reddit.com/r/stocks/comments/pwtp0q/cathie_wood_72020oil_demand_probably_hit_a/)  | `[Correction / False]` Cathie Wood &amp;#40;7/2020&amp;#41;:\"Oil demand probably hit a secular peak last year and, thanks to #EVs, now is in secular “decline”.\"|\n| 424  | [249 comments](https://www.reddit.com/r/stocks/comments/pv2t8r/will_amazon_and_google_ever_split_their_stock_why/)  | `[Company Question]` Will Amazon and Google ever split their stock? Why and why not?|\n\n\n&amp;nbsp;\n\n###Top Daily Discussion Comments\n\n| score  |  comment  |\n|--|--|\n| 35  |  /u/coolcomfort123 said [Going to buy more apple and msft today.](/r/stocks/comments/px2n98/rstocks_daily_discussion_technicals_tuesday_sep/hela97f/?context=5) |\n| 34  |  /u/Imperial_Eggroll said [Unless today was the day you were gonna cash out to buy a house or your Ferrari, you’ll be fine. Except if you’ve only got meme stocks then yah maybe be worried](/r/stocks/comments/px2n98/rstocks_daily_discussion_technicals_tuesday_sep/helogip/?context=5) |\n| 32  |  /u/Zenshinn said [Wow, these past 3 weeks have pretty much erased 3 months of gains.](/r/stocks/comments/px2n98/rstocks_daily_discussion_technicals_tuesday_sep/helfj32/?context=5) |\n| 32  |  /u/SaggySackAttack said [Thanks Mitch McConnell, can't raise the debt ceiling now but did it 3 times for Trump🙄](/r/stocks/comments/px2n98/rstocks_daily_discussion_technicals_tuesday_sep/heljqqg/?context=5) |\n| 31  |  /u/gary_oldman_sachs said [The name’s Bond.  10YR Bond.](/r/stocks/comments/pwdi9g/rstocks_daily_discussion_monday_sep_27_2021/heh8ngt/?context=5) |\n\n\n&amp;nbsp;\n\n\n\nIf you would like this roundup sent to your reddit inbox every week send me a message with the subject ['stocks'](https://www.reddit.com/message/compose?to=subredditsummarybot&amp;subject=stocks&amp;message=x). Or if you want a daily roundup, use the subject ['stocks daily'](https://www.reddit.com/message/compose?to=subredditsummarybot&amp;subject=stocks%20daily&amp;message=x). Or send me a chat with either stocks or stocks daily.\n\n####Please let me know if you have suggestions to make this roundup better for /r/stocks or if there are other subreddits that you think I should post in. I can search for posts based off keywords in the title, URL and flair. And I can also find the top comments overall or in specific threads.",
        "created_utc": 1633081034,
        "id": "heygdzk",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633109834.0
    },
    {
        "author": "TogBoy",
        "body": "Started in Feb.  Spacopolypse was a baptism of fire.  Was up 10% going into this week, feeling more confident about how it all works now.  I might experiment with options before the year is out (I assume that is how y'all are getting such ridiculous returns).",
        "created_utc": 1633072485,
        "id": "hey73oo",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1633101285.0
    },
    {
        "author": "Loadingexperience",
        "body": "The problem is that RH takes the money, lets say 50$ for GME share, routes that order to Citadel for PFOF. Citadel internalise that order and shits out and IOU for you. \n\nAll good so far right?\n\nBut Citadel as MM dont like to cover during major volatility so they keep taking these 50/60/70..$ orders while internalising order flow from RH or other PFOF broker(basically assuming short position), they know from experience that 99.99% of the time markets will calm down, the price will drop and they will be able to secure shares for favorable price to deliver them. PLEASE LET ME CLEAR THAT MOST OF THE TIME ITS DONE UNWILLINGLY BY ALGOS THAT RUN THE MARKET.\n\nSo what happened is that when GME started blowing  up at December/Early January algos took these 20/30/40$ orders gave out IOUs but never delivered actual shares. By mid Jan, some1 got margin call and realised that GME situation is that 00.01% event and now they are on the hook for 2700% payout compared to what they took in. \n\nThats why only PFOF brokers had to turn off buy button, because unlike brokers like fidelity that actually got their shares delivered they only had IOU but not the share and as soon as some1 pressed Sell button they had to pay from their own pocket the difference hence all the liquidity issues.",
        "created_utc": 1633071640,
        "id": "hey64io",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633100440.0
    },
    {
        "author": "UTGPodcast",
        "body": "They’re now fighting amongst themselves. This is beautiful!",
        "created_utc": 1633076791,
        "id": "heybujt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633105591.0
    },
    {
        "author": "MadCritic",
        "body": "At some point I think it will be unsustainable, overpopulation and all… but for now? We’re definitely lucky to live at this time",
        "created_utc": 1633081102,
        "id": "heyggmi",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633109902.0
    },
    {
        "author": "maz-o",
        "body": "Yea but that’s simply looking back at past performance… it’s equally ”safe” now as it was in past generations. The risk that it’s going down over the long run exists, just as the risk existed back then too. It’s jus that it didn’t hapen then. And that, obviousy, isn’t an indication of the future.",
        "created_utc": 1633085041,
        "id": "heyl0if",
        "score": 2,
        "subreddit": "investing",
        "created": 1633113841.0
    },
    {
        "author": "creemeeseason",
        "body": "I bought SAM (Boston beer company). It was over inflated, but had a huge (50%) correction and is now at a reasonable and possibly low value, imo. It's still a solid business with 15-20% growth and solid margins.  \n\nCOMP-compass, inc. A real estate tech company that is building a vertically integrated brokerage. Their agents also do loans, titles, etc for home purchases. It's trading at 1x sales but forecasting some huge growth. \n\nI bought both this week.",
        "created_utc": 1633084551,
        "id": "heykej1",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633113351.0
    },
    {
        "author": "spacebizzle",
        "body": "They were kind of first to market but everyone has a gambling app by now. Fad stock",
        "created_utc": 1633090525,
        "id": "heyt2y4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633119325.0
    },
    {
        "author": "TheAngels323",
        "body": "Up over 100% in LCID $19 calls (12/17). Already sold just over half the calls and just watching to see where the rest will go. Hope it can hit $30. $28 seems to be the resistance level right now.",
        "created_utc": 1633071697,
        "id": "hey66w5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633100497.0
    },
    {
        "author": "Abraxas1186",
        "body": "You can have mine...I also now suffer from a penis that is too big. But I'll have to check with my mom first, and make sure she runs it through the dishwasher first and leaves it out on the drying rack...",
        "created_utc": 1633071723,
        "id": "hey67zz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633100523.0
    },
    {
        "author": "Biggie2207",
        "body": "Idk man...I woulda sold UPST 10 times by now and every time I would have been wrong",
        "created_utc": 1633086106,
        "id": "heymf4g",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633114906.0
    },
    {
        "author": "1011010110001010",
        "body": "Not financial advice. I don't know. I know that most stocks have a designated registry agent type entity but, unless you own like 80% of the float, moving a small number of shares will not change anything. Now, if there is any sort of strange event, sure you can be sure your shares are directly registered on the official ledger of the company, and that the company benefits from the money you spent because your dollars go directly to buy stock, direct (could be wrong here). But, in the end, even if there was cellar boxing, which is not a conspiracy theory as it is pretty obvious that stock price can be manipulated and probably has been for years to decades by large buy orders and options, and now potentially dark pools (not manipulated per say, just not giving the best price to a buyer, which is a form of manipulation off the lit market), as an individual there is nothing, besides filing a decade long lawsuit, an individual can do. Your shares are protected by a good broker (not those apps), and while there can be some loopholes, the broker has far more to loose in lawsuits and PR from screwing you that it would by giving you a fair price if there is some kind of problem.",
        "created_utc": 1633085926,
        "id": "heym6ho",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1633114726.0
    },
    {
        "author": "AmbitiousSkirt2",
        "body": "Oh there we go I finally see some green let’s go a whole month of bleeding can you please go up now",
        "created_utc": 1633087215,
        "id": "heynxh6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633116015.0
    },
    {
        "author": "WallStreetSewerGator",
        "body": "They cracked my horns yesterday. I took a huge loss. I'm cash gang now. I have no choice but to wait and see if we hit the 200 day. If so, I'm going all in.",
        "created_utc": 1633082260,
        "id": "heyhpzq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633111060.0
    },
    {
        "author": "qoning",
        "body": "My point is that if they buy it from open market, they are effectively not printing any money, as the principal is now owed to the fed, but they are legally required to return it to the government, and any remaining interest is not paid on that treasury. Which means the open market owner would have received that money anyway at maturity, except now they have cash in hand, so the fed made markets more liquid.",
        "created_utc": 1633073604,
        "id": "hey8d06",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633102404.0
    },
    {
        "author": "judochop316",
        "body": "Markets don't crash during an unprecedented labour shortage..which will increase wages. It's essentially a war time economy without an actual war.  CAN and USA is bullish af right now. Bears ain't shit.",
        "created_utc": 1633078983,
        "id": "heye700",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633107783.0
    },
    {
        "author": "ShitFeeder",
        "body": "Nah current companies don’t make enough money to support current valuations. Equities aren’t the only places to put money. Commodities and oil are king right now.",
        "created_utc": 1633079038,
        "id": "heye96k",
        "score": 1,
        "subreddit": "options",
        "created": 1633107838.0
    },
    {
        "author": "korismon",
        "body": "The worst part about the money printer situation is you have a bunch of short sighted dipshits who think it's a really good thing because they are making money now,  little do they know all that money is losing value due to the money printer.",
        "created_utc": 1633079121,
        "id": "heyecf8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633107921.0
    },
    {
        "author": "Spaghetti-Rat",
        "body": "I've set up fingerprint login three different times now. It still doesn't work. No option for biometric login. I've checked that it's turned on in app but nothing.\n\nAnyone else have this problem?",
        "created_utc": 1633079146,
        "id": "heyeddq",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1633107946.0
    },
    {
        "author": "Rothiragay",
        "body": "You guys are fast as fuck. First its CEI then its FAMI and now its PROG. All in just 2 days",
        "created_utc": 1633078178,
        "id": "heydc3a",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1633106978.0
    },
    {
        "author": "jeoffvader",
        "body": "Warrants might be a good play here.\n\nBut i might just bag some shares for now. Feels like 11 is a price gamble i can live with.\n\nThis feels like the kinda stock to buy and forget about for a few years.",
        "created_utc": 1633078394,
        "id": "heydki8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633107194.0
    },
    {
        "author": "deSeingalt",
        "body": "&gt; stimmies, promises of infrastructure\n\nyou got those, they are arguing about them now",
        "created_utc": 1633078773,
        "id": "heydz2z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633107573.0
    },
    {
        "author": "Powerhausen",
        "body": "Now kith",
        "created_utc": 1633090553,
        "id": "heyt4m7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633119353.0
    },
    {
        "author": "deSeingalt",
        "body": "a 10% drop wont do you harm - just eat less and give up your habit of living on credit\n\nwhat's the problem?\n\nIt will be good for the Environment. No one wanted Climate disaster, and now we got it. It aint going away, so deal with it instead of moaning about profit.",
        "created_utc": 1633084860,
        "id": "heyks8c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633113660.0
    },
    {
        "author": "dh4645",
        "body": "Wow moderna. You can go back up now",
        "created_utc": 1633084699,
        "id": "heykkzv",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633113499.0
    },
    {
        "author": "Guilty-Ham",
        "body": "With the beating the Asian markets are taking right now, with the drops Europe is seeing at the moment, yeah, good thinking.  Maybe or maybe not.  Just double bag so the bottom doesn't rip to easily.",
        "created_utc": 1633083673,
        "id": "heyjcqs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633112473.0
    },
    {
        "author": "Rothiragay",
        "body": "The only thing that matters is the volume on bearish vs bullish positions. If there is 1 trillion dollars in call options and 1 million in put options then SPY is almost certainly going to go up. \n\nRight now there are far more people betting that it will go down than up so im not buying the dip yet.",
        "created_utc": 1633083859,
        "id": "heyjknh",
        "score": 1,
        "subreddit": "investing",
        "created": 1633112659.0
    },
    {
        "author": "sourpick69",
        "body": "This shit should be marked NSFW, I never seen someone get so fucked so fast before.\n\nNow THIS is the kind of loss porn I subbed to see. Better than only fans and its free",
        "created_utc": 1633077784,
        "id": "heycwtx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633106584.0
    },
    {
        "author": "karakter98",
        "body": "Any big player in renewable energy right now",
        "created_utc": 1633082119,
        "id": "heyhkdw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633110919.0
    },
    {
        "author": "Specksavers",
        "body": "Ah I guess that makes sense! So as investors are we lucky to be alive right now given that the future returns should remain high (barring any disasters..)? We are theoretically able to increase our wealth much more easily than the previous generation?",
        "created_utc": 1633080911,
        "id": "heyg92h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633109711.0
    },
    {
        "author": "worstfans",
        "body": "When I checked futes at 3am we were blood red. Now it's blood green. Pj boys are retarded",
        "created_utc": 1633088134,
        "id": "heypa12",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633116934.0
    },
    {
        "author": "RichardEstevez",
        "body": "just wheeling right now",
        "created_utc": 1633088712,
        "id": "heyq5lw",
        "score": 1,
        "subreddit": "options",
        "created": 1633117512.0
    }
]