[
    {
        "author": "magneticanisotropy",
        "body": "This is classic IBM press release stuff - see all their breakthroughs that will revolutionize computing from 10 years ago - IBM, the king of overpromising and underdelivering. \n\nLike seriously, does anyone believe they have come up with a process that is even remotely scalable? They don't even mention how - what litho processes were used, etc.",
        "created_utc": 1620397513,
        "id": "gx9z05s",
        "score": 636,
        "subreddit": "stocks",
        "created": 1620426313.0
    },
    {
        "author": "mactian",
        "body": "Yes, it is one thing to make one chip and whole another thing to make millions without defects. Classic IBM.",
        "created_utc": 1620402686,
        "id": "gxab07a",
        "score": 201,
        "subreddit": "stocks",
        "created": 1620431486.0
    },
    {
        "author": "filtervw",
        "body": "I was \"lucky\" enough to work for them when the cloud buzzword came. I can tell you why all trains were missed: apart from the top brains that came-up with the technology, NOBODY was interested about it more than making the quarterly sales quota with a nice PowerPoint, or maybe a PoC with some near-shoring or local resources. Then is was off to India where zero fucks were given about innovation, product quality and client satisfaction. IBM is probably the only company in the world that managed to miss all recent technology shifts and who is unable to make money when all cloud companies had grown high double digits for years!",
        "created_utc": 1621202022,
        "id": "gydf2gb",
        "score": 108,
        "subreddit": "stocks",
        "created": 1621230822.0
    },
    {
        "author": "CoyoteClem",
        "body": "They are investing heavily into quantum computing, blockchain, and they just announced a 2 nanometer semiconductor chip.  With all that said, I'm not invested in IBM, and I'd rather bet on other more surefire next gen companies.  I've read about a lot of former employees who disparage the culture at IBM.",
        "created_utc": 1621190378,
        "id": "gycpf2d",
        "score": 99,
        "subreddit": "stocks",
        "created": 1621219178.0
    },
    {
        "author": "Clodhoppa81",
        "body": "I opened my first trading account in 1984, so 37 years ago. It was with Charles Schwab and the very first stocks I bought were IBM and Chi-Chi's (mexican restaurant chain). IBM sat for about a decade before I sold it off, Chi-Chi's crashed and burned. Went through the various market crashes, 2008 was especially bad. Down 39% on that one. I've done very well overall, though after I hit a couple of big targets portfolio-value wise, I basically handed over my accounts to my financial planner. I retired at 52, started a little business with my wife (record store and pop culture stuff), did that for almost a decade and then moved to Florida. I feel we've built sufficient net worth, and liquid assets, to see us through about 25 more years, though not likely we'll live that long.  Other than the stuff being managed for me, I've got a nice 'play' account, mostly full of weed stocks right now. Biggest mistake has always been one of patience - I tend to get in too late and out too early. My longest held stock is EBAY, which I've had since 2005, so while I've had accounts for &gt;30 years, I don't own anything that's just been sitting there for all that time.",
        "created_utc": 1621546955,
        "id": "gyvgh4q",
        "score": 94,
        "subreddit": "stocks",
        "created": 1621575755.0
    },
    {
        "author": "AgyleArgyle",
        "body": "History of the largest companies in the world\n1980 IBM, AT&amp;T, Exxon, Standard Oil\n1990 Nippon Telegraph, Bank of Tokyo, Industrial Bank of Japan, Sumitomo Mitsui Bank\n2000 Microsoft, GE, NTT DoCoMo, Cisco\n2010 PetroChina, Exxon, Microsoft, ICBC\n\nThis hopefully shows that just bc you are the largest company at the start of one decade, it isn’t a guarantee you’ll be the largest the next.",
        "created_utc": 1622227950,
        "id": "gzsh4hb",
        "score": 85,
        "subreddit": "stocks",
        "created": 1622256750.0
    },
    {
        "author": "pamdathebear",
        "body": "Even top US companies of the past can have dramatic drops, such as Ibm ge xom",
        "created_utc": 1620566695,
        "id": "gxhu165",
        "score": 58,
        "subreddit": "investing",
        "created": 1620595495.0
    },
    {
        "author": "Ironleg01",
        "body": "I'm sceptical. IBM been hyping their quantum computers, Watson AI which was supposed to cure cancer and other things. And yet Amazon and Microsoft are eating IBMs lunch. There is disconnect between PR releases and what's happening in real life.",
        "created_utc": 1620392574,
        "id": "gx9oomv",
        "score": 48,
        "subreddit": "stocks",
        "created": 1620421374.0
    },
    {
        "author": "sokpuppet1",
        "body": "Also instructive to learn why these companies failed to stay on top. IBM fell behind in technology and saw big loss of market share, ATT was broken up by the government, Exxon had high profile scandals and is on the wrong side of environmental trends, GE nearly collapsed due to financial engineering mistakes... look at today’s leaders and imagine the same risks for them. AMZN in particular is looking like a government breakup candidate.",
        "created_utc": 1622232807,
        "id": "gzsrmen",
        "score": 46,
        "subreddit": "stocks",
        "created": 1622261607.0
    },
    {
        "author": "Hellkyte",
        "body": "It depends on how you define renewable.  If you mean alternative feedstocks like biomass or polymer recycling then yes they are in a very good space for it.  If you mean a shift to wind/solar then its more complicated.  XOM (any oil company) trades energy, and that is an advantage they do have, but the actual tech behind wind/solar is not something they have much of.\n\nThat said, other companies in history have managed to make those kinds of transitions and survived.  IBM started in the mechanical calculation market iirc and transition to electronic.  A LOT of other companies failed to do so and no longer exist. \n\nThe reality is that the future will require a hybrid approach.  Hydrocarbons will not go away. But they will exist in an integrated market.  The question is whether or not XOM wants to become the dominant player in a shrinking pie or a late entry to a diversified portfolio.\n\nIn my experience working with the various majors XOM is likely the least suited to an integrated portfolio.  They are one of the least creative and slowest to exploit new opportunities out there.  But the things they do they do well.  Very well.  \n\nStill unsure if its a good move for them, but if they ever want to walk back to the market cap daddy this is the only way.  But its also a huge GE sized risk.",
        "created_utc": 1622068510,
        "id": "gzkju9f",
        "score": 44,
        "subreddit": "investing",
        "created": 1622097310.0
    },
    {
        "author": "Uesugi1989",
        "body": "It will be extremely expensive to buy a company like palantir, even for the likes of Microsoft. Not to mention that it cannot happen without the executives giving a full approval, the company was structured that way that it would be almost impossible to be taken over.\n\nI can see a future partnership on many levels though with one of the operating system giants, Microsoft or Google and ditching IBM",
        "created_utc": 1620914599,
        "id": "gxz90tf",
        "score": 41,
        "subreddit": "stocks",
        "created": 1620943399.0
    },
    {
        "author": "LackAccomplishe",
        "body": "&gt; “Right now, in the most advanced production in the world is about the 7-nm node, you know **on the verge of getting** to 5-nm node,” Darío Gil, SVP and director of IBM Research, told Yahoo Finance.\n\nam I not allowed to laugh? such a bullshit article provided by the dinosaur.\n\nalso,\n\n&gt; In 2017, IBM revealed that they had created 5 nm silicon chips,[13] using silicon nanosheets in a gate-all-around configuration (GAAFET), a break from the usual FinFET design. The GAAFET transistors used had 3 nanosheets stacked on top of each other, covered in their entirety by the same gate, just like FinFETs usually have several physical fins side by side that are electrically a single unit and are covered in their entirety by the same gate. IBM's chip measured 50 mm2 and had 600 million transistors per mm2.[14][15]\n\nhttps://en.wikipedia.org/wiki/Semiconductor_device_fabrication\n\nmeanwhile Apple has shipped like 100 million devices with 5nm and 3nm is next year thing. Also no idea where marketing lies in this. and about yours\n\n&gt; **It seems like this could be a dominant technology in semiconductors in a few years.**\n\nlulz",
        "created_utc": 1620394529,
        "id": "gx9sjbu",
        "score": 41,
        "subreddit": "stocks",
        "created": 1620423329.0
    },
    {
        "author": "hiker1628",
        "body": "It’s blue chip not blue collar. KO is a quality company, I just don’t see growth. By comparison, AT&amp;T pays 7% and has growth potential. Likewise IBM pays 4.5%.",
        "created_utc": 1621594637,
        "id": "gyxhk3l",
        "score": 40,
        "subreddit": "stocks",
        "created": 1621623437.0
    },
    {
        "author": "Otaehryn",
        "body": "Didn't IBM sell Fishkill fab and go fabless? In this case they are working with TSMC or Global Foundries or someone else still left?\n\nEDIT: Apparently they are working with Samsung on new process which every chipmaker is doing. Announcing something 3-4 years in advance is vaporware to generate positive buzz. I don't doubt we will have 2nm chips sometime in future but when we do, 1-2 foundries will be making them and everyone big (nVidia, Apple...) will be designing chips.\n\nI own IBM stocks.",
        "created_utc": 1620395994,
        "id": "gx9vn4h",
        "score": 37,
        "subreddit": "stocks",
        "created": 1620424794.0
    },
    {
        "author": "bernie638",
        "body": "Wow, I'm impressed,  I thank you,  I never considered buying IBM shares but the comments here reminded so much of what I was reading when I bought MSFT in 2014 that I'm going to give them a serious look!  \n\nOld dead dinosaur with terrible management that still manages to make a makes a profit,  pays a high dividend and has a low PE ratio, this sounds a lot like MSFT in 2014!  Beautiful!",
        "created_utc": 1621209841,
        "id": "gyduqjr",
        "score": 35,
        "subreddit": "stocks",
        "created": 1621238641.0
    },
    {
        "author": "sokpuppet1",
        "body": "Kind of misleading for IBM at least... they’ve got a ton of debt so this cash is basically vapor.",
        "created_utc": 1621743433,
        "id": "gz4nek5",
        "score": 33,
        "subreddit": "stocks",
        "created": 1621772233.0
    },
    {
        "author": "JamesVirani",
        "body": "IBM is a beast. They own more patents than anyone. It’s cheap in price for a tech company in blockchain, AI, and cloud. They are not a leader in any of the industries they are in, but they have the potential for sudden exponential growth in those areas. They also generate a lot of cash. I’m invested. I will happily collect dividends until their turnaround takes shape, and I think the next year and a half will be big for them.",
        "created_utc": 1621197970,
        "id": "gyd66f6",
        "score": 29,
        "subreddit": "stocks",
        "created": 1621226770.0
    },
    {
        "author": "SpocksCrocs",
        "body": "Anyone who has worked at or worked with IBM in the last decade+ can tell you that your money is better invested somewhere else. The only hope for IBM is that the entire C-Suite &amp; board are replaced. Give the RedHat leadership team the reins because they actually know how to make a profit. \n\nThe last decade and more have been a huge growth period for technology companies yet IBM has went nowhere; this is especially bad due to the sheer amount of resources IBM has/had at their disposal that they could have used to make a switch in strategy.\n\nIf they had spent half as much on technical engineering rather than financial engineering they might be in a much better place.",
        "created_utc": 1621205833,
        "id": "gydmxyb",
        "score": 28,
        "subreddit": "stocks",
        "created": 1621234633.0
    },
    {
        "author": "Investing8675309",
        "body": "“Value tech stocks”, there’s a term I don’t see much, we talking like good tech (FAAMG) or bad tech (Oracle, IBM, SAP)?\n\nI think Google, FB, and Amazon are fairly valued. I can see a DCF argument for Microsoft and Apple, those are a little harder to show. Microsoft is expensive but is probably the most bulletproof of them all.\n\nDon’t try to time the dip, just buy great companies at a fair price. I’m a big fan of the FAAMG.",
        "created_utc": 1621441205,
        "id": "gypoi6x",
        "score": 24,
        "subreddit": "stocks",
        "created": 1621470005.0
    },
    {
        "author": "fountainpenuserhere",
        "body": "Just chill.  PLTR was never a short term play for me.  Sure I could have been making money in recovery other places, but also keep in mind most high PE and growth/tech has been bleeding for a while.  I'm still buying the dip because I'm very confident in their abilities.  Look up what they did with Boeing and efficiency.  They increased it by 30%.  They also went up against IBM for a contract involving machine learning and IBM basically gave up because they just couldn't match PLTRs capabilities.",
        "created_utc": 1620697543,
        "id": "gxoizg1",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1620726343.0
    },
    {
        "author": "Blake_Cutler",
        "body": "As an ex palantir employee these moves with ibm are head scratchers for me. We consistently beat IBM’s technology when customers had the choice between Foundry and Watson. Foundry isn’t even that high tech - Watson was just worse.",
        "created_utc": 1620049130,
        "id": "gws5ae5",
        "score": 22,
        "subreddit": "stocks",
        "created": 1620077930.0
    },
    {
        "author": "SteelChicken",
        "body": "Dont need to check the news, been in IT for 25+ years and have been dealing with IBM most of that time.",
        "created_utc": 1621197802,
        "id": "gyd5ssf",
        "score": 21,
        "subreddit": "stocks",
        "created": 1621226602.0
    },
    {
        "author": "retawx",
        "body": "I may be wrong, but I think the major publicly traded players in quantum at the moment are Alphabet (GOOG), Honeywell (HON), and International Business Machines (IBM).\n\n\nThere's an ETF (QTUM) that tracks companies with exposure to quantum computing.\n\n\nAnd finally, the first pure-play quantum computing company, IonQ, is going public through a blank check company (DMYI).",
        "created_utc": 1622043927,
        "id": "gziycdb",
        "score": 19,
        "subreddit": "stocks",
        "created": 1622072727.0
    },
    {
        "author": "keldarepew",
        "body": "They just aren’t in fashion anymore, they have to make room for the new flashy stocks on the street like cisco and ibm.",
        "created_utc": 1622049523,
        "id": "gzjbwl4",
        "score": 18,
        "subreddit": "stocks",
        "created": 1622078323.0
    },
    {
        "author": "Moe_Greene_",
        "body": "Thursday Options Volumes:\n\n$AAPL 1,333K (69% call 31% put)\n\n**$TSLA 1,094K (52% call 48% put)**\n\n$LTR 651K (64% call 36% put)\n\n$SLV 613K (81% call 19% put)\n\n$UBER 546K (71% call 30% put)\n\n**$IBM 428K (95% call 5% put)**\n\n$NIO 409K (69% call 31% put)\n\n**$ARKK 390K (22% call 78% put)**\n\n$AMZN 356K (59% call 42% put)\n\n$PFE 352K (55% call 45% put)\n\n**$VIAC 345K (72% call 28% put)**\n\n**$AMD 313K (70% call 30% put)**\n\n**$PTON 311K (34% call 66% put)**\n\n$MSFT 272K (62% call 38% put)\n\n$FB 271K (59% call 41% put)\n\n**$RKT 260K (65% call 35% put)**\n\n$GDX 257K (71% call 29% put)",
        "created_utc": 1620333428,
        "id": "gx70oh9",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1620362228.0
    },
    {
        "author": "ReferentiallySeethru",
        "body": "There’s definitely R&amp;D in India, but it was scaled back tremendously the last 10 years due to how bad products would end up. Still, when products go into maintenance mode and incremental improvements, they often either get off shored or dev teams are handed over to 3rd party companies (like HCL) with some sort of revenue sharing between them and IBM.",
        "created_utc": 1621211609,
        "id": "gydy9va",
        "score": 17,
        "subreddit": "stocks",
        "created": 1621240409.0
    },
    {
        "author": "dmead",
        "body": "IBM has been stripped down to a conglomerate that just acquires medium-large size software businesses. This isn't 1990 anymore. they're still fucked.",
        "created_utc": 1620396356,
        "id": "gx9wfd4",
        "score": 15,
        "subreddit": "stocks",
        "created": 1620425156.0
    },
    {
        "author": "Poopingcode",
        "body": "I like IBM and they’re doing great stuff in the ML space but I’m not convinced to pick up the stock over more Microsoft",
        "created_utc": 1620380424,
        "id": "gx97e5x",
        "score": 15,
        "subreddit": "stocks",
        "created": 1620409224.0
    },
    {
        "author": "Legitimate_Source_43",
        "body": "This needs to be pinned. The amount of folks i see ignoring dividends is insane to me. Kevin o'leary has a video explaining that 75 percent of gains of s&amp;p 500 was dividends reinvested. There was a video of a man who worked as phone booth attendant making $6 a hour has portfolio of 500k by just reinvesting dividends into coca cola, ibm. We ignore the compounding effect.",
        "created_utc": 1621516708,
        "id": "gythtj2",
        "score": 14,
        "subreddit": "CanadianInvestor",
        "created": 1621545508.0
    },
    {
        "author": "Kanolie",
        "body": "It's amazing how IBM is considered one if Buffett's greatest failures and he still made money on that position.",
        "created_utc": 1620392984,
        "id": "gx9pgqt",
        "score": 14,
        "subreddit": "ValueInvesting",
        "created": 1620421784.0
    },
    {
        "author": "stolpoz",
        "body": "&gt; We ignore the compounding effect.\n\nGrowth stocks and any stock that has a positive return compounds. Interest compounds with no dividends. \n\nThe guy had $500k cause he invested in Coca-Cola and IBM and they happened to pay dividends, not because of dividends.",
        "created_utc": 1621522477,
        "id": "gytuuq7",
        "score": 13,
        "subreddit": "CanadianInvestor",
        "created": 1621551277.0
    },
    {
        "author": "TechySpecky",
        "body": "wut, isn't IBM doing a ton of research years ahead of TSMC etc, who then turn around and benefit from it?",
        "created_utc": 1620396074,
        "id": "gx9vte6",
        "score": 13,
        "subreddit": "stocks",
        "created": 1620424874.0
    },
    {
        "author": "oarabbus",
        "body": "Antitrust laws are intended to prevent monopolies. No doubt they are a massive juggernaut but where exactly is Amazon a monopoly?\n\nIf I want to buy online goods I can go to Alibaba, Ebay, Pinterest just to start. Ebay and Alibaba aren't tiny little companies getting bullied around by Amazon.\n\nIf I want to host my website on the cloud, instead of AWS I can go to Google Cloud, Microsoft Azure, IBM or Alibaba Cloud. Again, these aren't companies who are being abused by Amazon having too much market power.\n \nIf I'm in the digital marketing game, well Amazon certainly isn't a monopoly. Google is the king at the top of the funnel, and Facebook owns the rest of it. \n\nAnd regular old retail? Walmart and Target are no slouches of their own. Shit, I even saw a Barnes &amp; Noble the other day.\n\nSaying Amazon is powerful, sure. Saying they are abusively powerful to the point of monopoly requiring anti-trust action? Where?",
        "created_utc": 1622159377,
        "id": "gzp65k7",
        "score": 12,
        "subreddit": "investing",
        "created": 1622188177.0
    },
    {
        "author": "Beefskeet",
        "body": "Plex works fine. Vlc streams. Windows media player has a server setup, amazingly. \n\nHonestly I just mount the network drive and call it through the run command but I have the windows media server to stream to my old ps4.\n\nComputers are rad. Throw a mining rig made from an old IBM in the greenhouse, heat for some winter ganja. Thats where I host it from lol",
        "created_utc": 1621733992,
        "id": "gz48zjt",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1621762792.0
    },
    {
        "author": "diamondcrushesrock",
        "body": "If you are a long term investor, then even a small portfolio should follow some basic rules about diversification and sector exposure. Two of your index funds, VOO and SPY, are the same thing. VOO has a net expense ratio of 0.03% and SPY has 0.09%. I would sell those and buy FNILX which is the same but 0% expense ratio. VTV is a basket of good solid companies with an expense ratio of 0.04%. V is a good choice. KO is good too. It’s gone up in the past few months but it might go up more. I bought KO at the end of January and my position is up 12%. IBM was down because folks thought it was done, but maybe it still has life, so it’s been going up too. I bought IBM at the beginning of February and my position is up 21%. Anyway, I would suggest roughly equal amounts of money in FNILX, VTV, V and KO (or something else you choose). When you have a little more money, choose another company in another sector and keep building from there. A lot of folks just like the index funds, but personally I like to own shares in individual companies. You decide!",
        "created_utc": 1621596668,
        "id": "gyxk7vk",
        "score": 12,
        "subreddit": "stocks",
        "created": 1621625468.0
    },
    {
        "author": "barebackguy7",
        "body": "What do the former employees say specifically? IBM is on the list of top 50 companies to work for supposedly",
        "created_utc": 1621208929,
        "id": "gydsyh3",
        "score": 12,
        "subreddit": "stocks",
        "created": 1621237729.0
    },
    {
        "author": "ReferentiallySeethru",
        "body": "You’re right, but Apple also reclaimed its visionary leader. There’s no Steve Jobs taking the helm at IBM. \n\nI don’t want to say it’s impossible, but the cultural shift needed is massive and I have difficulty believing it can be pulled off.\n\nI don’t think IBM is going anywhere anytime soon, but I wouldn’t expect anything more the tepid growth.",
        "created_utc": 1621214024,
        "id": "gye2yqu",
        "score": 12,
        "subreddit": "stocks",
        "created": 1621242824.0
    },
    {
        "author": "blackicebaby",
        "body": "IBM is a sell.",
        "created_utc": 1620396205,
        "id": "gx9w3gf",
        "score": 11,
        "subreddit": "stocks",
        "created": 1620425005.0
    },
    {
        "author": "hopingtothrive",
        "body": "Your stock picks are very good. But no stock/company stays at the top forever. Here are the top companies going back a few decades. As you can see things change over time.\n\n&gt;2021 -- Apple, Microsoft\n\n&gt;2010 -- Exxon Mobile, Apple\n\n&gt;2000 -- General Electric, Exxon\n\n&gt;1990 -- IBM, Exxon\n\n&gt;1980 -- IBM, ATT",
        "created_utc": 1620592052,
        "id": "gxj8glv",
        "score": 11,
        "subreddit": "stocks",
        "created": 1620620852.0
    },
    {
        "author": "RoPrime12",
        "body": "Puts are risky if not used correctly, so be cautious. Anyway here are my picks:\n\nDoordash: Can't turn a profit while everyone orders delivery. \n\nNikola: Fraud\n\nTeladoc: No moat,\n\nLemonade: Horrible insurer, throwing buzzwords around\n\nBeyond Meat: They are a food company and valued like a SaaS company.\n\nUnited Airlines, Delta Airlines, Southwest: Debt and issuing shares, revenue decline yet price recovered.\n\nIBM: Slowly dying company.",
        "created_utc": 1622026462,
        "id": "gzhzo8s",
        "score": 11,
        "subreddit": "stocks",
        "created": 1622055262.0
    },
    {
        "author": "956k",
        "body": "Those superstars that drive the fund's performance aren't static. Just 10 years ago Exxon Mobile was by far the largest company in the SP500, and the top 10 included companies like GE, Walmart, Chevron, and IBM, none of which even crack the top 25 anymore. 10 years before that, the only company still in the top 10 is Microsoft, which also spent a long time trading sideways or making marginal gains before really taking off. \n\nThe point of buying the fund is that you most likely aren't going to be picking the right stocks, so you get to benefit from the rising superstars as they come up and the ETF will naturally rebalance itself to give you more exposure to better performing companies and less exposure to companies trending down. As long as the market in general continues to trend upwards they'll be okay. If all you do is buy the current top stocks that, as you put it, are \"driving most of the ETF's performance\", you'd have massively underperformed the market.\n\nI don't think that the correlation between good and bad stock performance caused by ETFs is nearly as bad as people are stating. Most of the money in ETFs is slow moving, on the retail side it's Bogelheads and old school buy and hold mentalities, and on the other side it's stuff like pensions and retirement funds. The reactionary retail investors are all in on meme stocks, ETFs like ARK, and shitcoins. The guys who panic dump are a drop in a bucket for the major broad market ETFs, they aren't going to move the needle enough to lead to a selloff or bubble bursting.",
        "created_utc": 1621362619,
        "id": "gyllvxz",
        "score": 10,
        "subreddit": "investing",
        "created": 1621391419.0
    },
    {
        "author": "junckdogg",
        "body": "PLTR signed a deal to work with a cancer cure Pharma outfit, they will use PLTRs A.I. to speed up the process, also PLTR Crypto Management news is on the way, let’s not forget about PLTR/IBM Partnership. Not a good time to bet against PLTR IN AHs,",
        "created_utc": 1621373913,
        "id": "gymdj2e",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1621402713.0
    },
    {
        "author": "manbearbullll",
        "body": "As a PLTR bagholder this is a questionable move.  Have zero confidence in leaders coming from IBM.",
        "created_utc": 1620051970,
        "id": "gwsbg0k",
        "score": 10,
        "subreddit": "stocks",
        "created": 1620080770.0
    },
    {
        "author": "self-assembled",
        "body": "Quite true.  I remember several years ago IBM promising revolutionary advances in photolithography/transistor size, but TSMC still leads the pack today.  TSMC's 2nm process will surely be operating before any IBM + Intel/Samsung partnership can follow through on it.",
        "created_utc": 1620413133,
        "id": "gxaz20k",
        "score": 10,
        "subreddit": "stocks",
        "created": 1620441933.0
    },
    {
        "author": "FistyGorilla",
        "body": "Yeah this isn’t really a good thing. https://spectrum.ieee.org/biomedical/diagnostics/how-ibm-watson-overpromised-and-underdelivered-on-ai-health-care",
        "created_utc": 1620043571,
        "id": "gwrumgl",
        "score": 9,
        "subreddit": "stocks",
        "created": 1620072371.0
    },
    {
        "author": "88mcinor88",
        "body": "IBM is NATO \"No Action, Talk Only\"",
        "created_utc": 1620415621,
        "id": "gxb4fg1",
        "score": 9,
        "subreddit": "stocks",
        "created": 1620444421.0
    },
    {
        "author": "jsntx",
        "body": "Palantir is an old software company that somehow managed to tap into the current hype machine. It's not a bad company and they will continue to have revenue. Profit? I'm not so sure.\n\nAs an enterprise software company, it's really concerning that they can't turn a profit after all these years.\n\nSoftware companies should generally have high profit margins because the marginal cost is near zero. Unless their services component is large, which is costly, or have other systemic problems. Their product is not magical and it requires a heavy handed sales component. That's why partnering with IBM makes sense for them. IBM has a special type of sales force for this kind of products and services. \n\nI have no doubt they will do better, but to have an insane valuation requires a solid path to profitability in the mass market.",
        "created_utc": 1620958197,
        "id": "gy1x05l",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1620986997.0
    },
    {
        "author": "gonemad16",
        "body": "Add back Netflix and google and also add in Intel or IBM and you can be a FAARTING investor",
        "created_utc": 1621831233,
        "id": "gz8oa39",
        "score": 9,
        "subreddit": "stocks",
        "created": 1621860033.0
    },
    {
        "author": "Manjushri1213",
        "body": "Yeah this was just to show proof that sub-5nm is possible. Basically, people are getting more worried that we are hitting such a hard wall that Moores Law wont just slow down but stop entirely without either a change from silicon based chips or a switch to quantum, which at least for the forseeable future isnt even remotely true. Chiplets, 3D stacking, variations on FinFET and EUV tech is accellerating. Intel just hasnt been doing hot with their 10nm rollout lol. But even that is changing slowly.\n\nIBM is weird. This was just a look whats possible type or deal, even though anyone in the know enough and not too cynical realizes companies like TSMC are already on their way with this stuff. It was impressive but they wont be using it for a while, it uses EUV at all 3 states which isnt realistic for production yet afaik, tho we are already using it. EUV alone will allow this tech in the future basically, afaik.",
        "created_utc": 1620419257,
        "id": "gxbc30a",
        "score": 8,
        "subreddit": "stocks",
        "created": 1620448057.0
    },
    {
        "author": "Match_MC",
        "body": "Company style. Microsoft is more of an older fashioned company than these others. I’d compare it to IBM. They are more of a conglomerate of different things too, not that the others don’t have multiple revenue streams but most of them do one thing. Apple does phones/computers, Google does search engines, Netflix does streaming, Amazon sells stuff online, Facebook collects data from old people.",
        "created_utc": 1621135234,
        "id": "gyabh8f",
        "score": 8,
        "subreddit": "RobinHood",
        "created": 1621164034.0
    },
    {
        "author": "talm0",
        "body": "Maybe now Bill can get back to doing what he did best all of those years ago. Steal from Apple, who stole from IBM, and make MSFT great again.",
        "created_utc": 1620076306,
        "id": "gwtwexy",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620105106.0
    },
    {
        "author": "bungholio99",
        "body": "Not a financial advisor but i like Lenovo and UBS does to.\nGrown to biggest P.C manufacturer, while being cheap compared to (&gt; 10 HKD) DELL and HP, even wins marketshare during Chip Crisis.\n\nMany mergers (IBM,Fujitsu,Motorola) great JV Netapp, Absolute Software, Instore\n\nInvestor and supplier of NIO.\n\nPays dividend",
        "created_utc": 1619975375,
        "id": "gwompkh",
        "score": 8,
        "subreddit": "ValueInvesting",
        "created": 1620004175.0
    },
    {
        "author": "MundtFlaps",
        "body": "IBM sucks as a company. They're not even sure what their core competencies are. Consulting? Manufacturing? Patent filings? Watson? Too many irons in the fire. They're like the GM of the business/tech world.",
        "created_utc": 1621208617,
        "id": "gydsd9h",
        "score": 8,
        "subreddit": "stocks",
        "created": 1621237417.0
    },
    {
        "author": "claytondpark",
        "body": "Boomer stocks only green stocks on my wl: plby, ibm, ups, orcl, jpm, bac, etc... 🤡",
        "created_utc": 1620147805,
        "id": "gwxf9z9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620176605.0
    },
    {
        "author": "ndzZ",
        "body": "They have already done this before with the cell processor. It was marketed as a super computer, more powerful than anything that gamers have seen before. \n\nThis piece of shit made programming for the ps3 so unbearable that it let to the success of the xbox 360, which got huge issues itself with the rrod. That on the other hand gave Microsoft so much market share that they transferred online gaming on consoles forever. Multiplayer on the ps3 was free, and Microsoft started charging players for it.\n\nI am not saying IBM is the reason micro transactions exist today but they sure played a part in that development. I am still angry for the cell processor, good thing naughty dog existed.",
        "created_utc": 1620420375,
        "id": "gxbedws",
        "score": 7,
        "subreddit": "stocks",
        "created": 1620449175.0
    },
    {
        "author": "Ajpeterson",
        "body": "David makes this noise with his mouth and people give him money to stop. His fiancée Stacey has been on OnlyFans for three months but has yet to figure out her circa 2003 IBM laptop does not have a camera. They want a newer build in a gated community for around $845,000.",
        "created_utc": 1620774877,
        "id": "gxsgi7p",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620803677.0
    },
    {
        "author": "ReferentiallySeethru",
        "body": "Having worked at IBM, don’t expect a turn around. Maybe the RedHat culture change will actually breakthrough, but I seriously doubt it.",
        "created_utc": 1621209402,
        "id": "gydtv0s",
        "score": 7,
        "subreddit": "stocks",
        "created": 1621238202.0
    },
    {
        "author": "TheRealSamBell",
        "body": "Why don’t you have confidence in the leadership of IBM? Look how well their stock has performed the past 8 years",
        "created_utc": 1620052635,
        "id": "gwscw9e",
        "score": 7,
        "subreddit": "stocks",
        "created": 1620081435.0
    },
    {
        "author": "LeonCrimsonhart",
        "body": "IMO, IBM is messing around with Red Hat a bit too much. Before, enterprises could use CentOS for production and then be upsold. Now no company wants to use CentOS for production since it does not mirror RHEL's release schedule, opting for nightly updates.",
        "created_utc": 1621210636,
        "id": "gydwc2y",
        "score": 7,
        "subreddit": "stocks",
        "created": 1621239436.0
    },
    {
        "author": "financialsfyi",
        "body": "Top stock mentions on r/stocks today (Not investment advice)\n\n|Symbol|Total Mentions|Price &amp; Change|Trading Volume|Market Cap|\n|:-|:-|:-|:-|:-|\n|AMD|39|78.50 -3.82%|66.26M|95.38B|\n|GME|27|162.20 -6.56%|5.26M|11.48B|\n|VTI|21|217.48 +0.18%|3.85M|236.07B|\n|AMZN|21|3,385.71 -2.36%|5.87M|1.71T|\n|ARKK|19|116.91 -3.20%|10.95M|22.8B|\n|MSFT|15|251.92 -0.10%|19.61M|1.9T|\n|SPY|15|418.20 +0.22%|68.09M|361.94B|\n|TLRY|14|17.03 -7.14%|25.5M|3.05B|\n|PLTR|14|22.30 -3.21%|33.89M|39.07B|\n|APHA|13|15.38 -0.45%|4.87B||\n|DIS|11|185.51 -0.27%|7.54M|336.75B|\n|AAPL|11|132.55 +0.83%|75.08M|2.21T|\n|IBM|11|144.75 +2.02%|5.73M|129.34B|\n|FB|10|322.57 -0.77%|18.71M|920.61B|\n|PINS|10|63.71 -4.01%|15.23M|39.38B|\n|VOO|10|384.44 +0.23%|4.18M|217.65B|\n|TWTR|9|54.58 -1.16%|79.62M|43.59B|\n|CLOV|8|9.30 -5.58%|15.99M|4.1B|\n|QQQ|8|336.16 -0.54%|29.68M|162.3B|\n|SQ|8|243.68 -0.47%|5.26M|103.56B|\n|VXUS|7|64.99 +0.85%|3.37M|44.78B|\n|TSM|7|115.94 -0.69%|10.23M|601.27B|\n|ABBV|6|114.68 +2.85%|9.14M|202.39B|\n|TSLA|6|684.92 -3.46%|27M|659.8B|\n|DKNG|5|57.04 +0.67%|15.78M|22.69B|\n|AMC|5|9.71 -3.19%|31.2M|4.37B|\n|NAV|5|44.16 -0.20%|636.04K|4.4B|\n|SPCE|5|20.14 -9.07%|13.56M|4.77B|\n|MRNA|5|186.03 +4.03%|14.62M|74.51B|\n|CCL|4|27.93 -0.11%|21.84M|30.83B|",
        "created_utc": 1620083199,
        "id": "gwubegn",
        "score": 7,
        "subreddit": "stocks",
        "created": 1620111999.0
    },
    {
        "author": "DerekPaxton",
        "body": "I use to think that you invest in good companies and stay away from bad ones.\n\nBut Buffets quote changed the way I view the market. You invest in undervalued companies and avoid overvalued ones. Any company is great if it is cheap enough.\n\nThe question isn’t if ibm is good or bad, it’s if it’s worth 144.",
        "created_utc": 1621212993,
        "id": "gye0z61",
        "score": 7,
        "subreddit": "stocks",
        "created": 1621241793.0
    },
    {
        "author": "80Kid",
        "body": "IBM, CISCO, JDS",
        "created_utc": 1620847260,
        "id": "gxw1s5p",
        "score": 6,
        "subreddit": "investing",
        "created": 1620876060.0
    },
    {
        "author": "MUPleasFlyAgain",
        "body": "IBM is king of being ahead of everyone in tech but make 0 profit off it. Also it's 2nm equivalent technology, not actual 2nm. Go look up AMD chips, it's called 7nm but it's not actually 7nm.",
        "created_utc": 1621215853,
        "id": "gye6kqz",
        "score": 6,
        "subreddit": "stocks",
        "created": 1621244653.0
    },
    {
        "author": "frankcastle1001",
        "body": "It’s not about risk free or consequences of corona. You can’t apply individual morals to wall st or investors. They will put their money into anything that will make them more. Hence IBM partnering with the Nazis, etc. I see them doing this as a temporary shelter and that’s all. Who cares if the financials are fake if they make them money and they get out before the other shoe drops. With our current administration, they aren’t going to do a damn thing but talk tough. China will continue to do whatever it wants.",
        "created_utc": 1621941838,
        "id": "gzdo5uo",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1621970638.0
    },
    {
        "author": "spyaintnobitch",
        "body": "Y'all think IBM will eventually lower it's dividend like T?\n\nEdit: Oops wrong subreddit. How's it going wsb. How about them 0dtes huh, amirite?",
        "created_utc": 1621895696,
        "id": "gzbr2wi",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1621924496.0
    },
    {
        "author": "SirPalat",
        "body": "&gt;IBM introduced what it says is the world's first 2-nanometer chip making technology. The technology could be as much as 45% faster than the mainstream 7-nanometer chips in many of today's laptops and phones and up to 75% more power efficient, the company said. Read more[ here.](https://www.reuters.com/technology/ibm-unveils-2-nanometer-chip-technology-faster-computing-2021-05-06/)\n\nI got 0 knowledge in that space but this sounds incredible. Like industry changing incredible, but it seems like people aren't excited",
        "created_utc": 1620355726,
        "id": "gx8azl6",
        "score": 6,
        "subreddit": "stocks",
        "created": 1620384526.0
    },
    {
        "author": "Enigmatic_Observer",
        "body": "IBM announcing 2nm chips - semiconductor bull for life.",
        "created_utc": 1620332424,
        "id": "gx6y7mt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620361224.0
    },
    {
        "author": "randomperson1296",
        "body": "IBM is Where Idiots Become Mangers   \n\n\nThe company just does not have the vision",
        "created_utc": 1621201784,
        "id": "gydek19",
        "score": 6,
        "subreddit": "stocks",
        "created": 1621230584.0
    },
    {
        "author": "junckdogg",
        "body": "#PLTR AND IBM ARE PARTNERS??? Something is up",
        "created_utc": 1621350468,
        "id": "gyks1fp",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1621379268.0
    },
    {
        "author": "CoronelPonciano",
        "body": "That was my first thoughy when I read the title.\n\nYou've been losing money since 2013 and now that they have a potentially game changing technology you have doubts? I don't understand it.\n\nhttps://www.washingtonpost.com/technology/2021/05/12/ibm-new-chip/",
        "created_utc": 1621215208,
        "id": "gye5bg3",
        "score": 6,
        "subreddit": "stocks",
        "created": 1621244008.0
    },
    {
        "author": "workinguntil65oridie",
        "body": "Im a dividend investor. IBM loses revenue a million quarters in a row. No issues why? Dividend.",
        "created_utc": 1621259924,
        "id": "gyg1qp6",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1621288724.0
    },
    {
        "author": "JSTOCKSJ",
        "body": "PALANTIR 🦍 ibm catalyst today \nArmy contract renewal ???",
        "created_utc": 1622017211,
        "id": "gzhp52z",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1622046011.0
    },
    {
        "author": "Gr0und0ne",
        "body": "Intels building two new fabs in Arizona. Presumably they’ll be for 5-3nm, but this breakthrough might change that. I highly doubt IBM will be building fabs, they’ll be outsourcing. I’d wager on intel getting that contract; might go buy some more now.",
        "created_utc": 1620395661,
        "id": "gx9ux2j",
        "score": 5,
        "subreddit": "stocks",
        "created": 1620424461.0
    },
    {
        "author": "Runningflame570",
        "body": "Intel has historically succeeded due to best in the world chip fabrication. Over the last year the market woke up and realized Intel has fallen behind, Intel and then IBM tried to pretend they were right back in the race, and then TSMC swung their dick with the 1nm announcement and said there's no way they're losing the lead.\n\nIn a non-capacity constrained environment (and that's coming sooner or later) Intel's foundries become a boat anchor that drags the whole business down until they spin them off for a huge loss like AMD and IBM already did.",
        "created_utc": 1621522255,
        "id": "gytuc79",
        "score": 5,
        "subreddit": "stocks",
        "created": 1621551055.0
    },
    {
        "author": "queer_mentat",
        "body": "IBM has a storied history but they seem like they have been going for only business services for quite a while.",
        "created_utc": 1620373780,
        "id": "gx90bfc",
        "score": 5,
        "subreddit": "stocks",
        "created": 1620402580.0
    },
    {
        "author": "daftstar",
        "body": "Logitech has been in this game for a while, but they're kind of a stalwart at this point. The IBM of the tech world. Nothing wrong with them - in fact slow and steady for a long time. Recently though, they've upped their brand big-time. In terms of accessories and such, they're positioning themselves as the Apple of accessories. Good on them. Accessories get replaced more often than gaming peripherals I suspect. \n\n  \nAs to price action though, they're re-testing their ATHs and that makes me a bit nervous.",
        "created_utc": 1620415517,
        "id": "gxb47ap",
        "score": 5,
        "subreddit": "stocks",
        "created": 1620444317.0
    },
    {
        "author": "Rjlv6",
        "body": "I my view people think of Buffet as much more rigid than he actually is. His advice is more general philosophy than inflexable rules as every company is different. In my view when he's talking about circle of  competence all it means is situations he understands. In the case of IBM he thought the buisness was undervalued on paper. Thus he put considerable effort into learning about the buisness. For example he interviewed IT professionals at Berkshire and had them explain why they chose IBM thus he felt he had enough information to understand the company. Ultimately he obiously realized that he was out of his depth and the buisness wasn't improving as he thought it would so he sold. It wasn't an emotionally charged decision it was a rational consideration of the facts. If Buffet makes an error in judgement he will sell below what he paid the game he plays is to minimize losses. Dame thing with the airlines he acknowledged that he made a mistake then too.",
        "created_utc": 1620400456,
        "id": "gxa5s1h",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1620429256.0
    },
    {
        "author": "swingorswole",
        "body": "I think the point of u/steelchicken is “what you just said has been said before.. and before that too.” You may be right, but IBM has to prove it with actions and actual outcomes. This is not a company that has a history of under-promising and over-delivering, so the burden of proof is on them (and you in this case).",
        "created_utc": 1621200914,
        "id": "gydcon2",
        "score": 5,
        "subreddit": "stocks",
        "created": 1621229714.0
    },
    {
        "author": "bonejohnson8",
        "body": "Palantir hires a former IBM health executive. When I think health, I think IBM. Love the great business sense they have at IBM. Very hot company.",
        "created_utc": 1620055161,
        "id": "gwsin67",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620083961.0
    },
    {
        "author": "BilboTBagginz",
        "body": "IBM was good at acquiring companies that were sitting on HIPPA data, but we're absolutely horrible at managing and consolidating that data while staying within compliance. Also, they continuously made us eat our own dog food, knowing our dog food was shit.\n\nI'll never forget being forced to use Lotus Notes for our email client.",
        "created_utc": 1620051926,
        "id": "gwsbcf7",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620080726.0
    },
    {
        "author": "ateranol",
        "body": "IBM. kill me",
        "created_utc": 1620669899,
        "id": "gxmv7ai",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620698699.0
    },
    {
        "author": "Confident-Exam9147",
        "body": "From everything I read and hear, it has great potential. The potential realized gains could be more long term than I can stomach. They definitely need exponential commercial customers across different industries. They have tied up with IBM I believe would give them exposure to broader markets. Now having said that, there is no stopping for a big tech to pivot towards this model and excel faster and still pay rent on IP that Palantir owns. This is purely my opinion with no knowledge about the company rather than read news and come to my conclusion. Not a financial advisor. Full disclosure have a very tiny long position and lost few hundreds on buying call options. Wishing all of us a fruitful non stressful journey.",
        "created_utc": 1620708213,
        "id": "gxp1b4i",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620737013.0
    },
    {
        "author": "heterodoxxed",
        "body": "Uber.\n\nBut aside from that, the broader tech economy outside the SP500 has an effect on the market. If private tech firms go belly up because the VC funds dry up, and smaller public tech firms start plummeting, that will have a cascading effect on the tech market broadly.\n\nThe FAANGs will be fine, of course. They'll dip but recover, just like IBM did back then. But those are established, profitable companies.\n\nAlso, tech is not the only bubble right now.",
        "created_utc": 1621028654,
        "id": "gy5dygl",
        "score": 4,
        "subreddit": "stocks",
        "created": 1621057454.0
    },
    {
        "author": "aka0007",
        "body": "I am holding some bags with PLTR.\n\nWhat is hard to figure with PLTR is what exactly is their TAM and assuming they can scale up what type of profit margin they will have. So I have to guess to a large extent. I can only use back of the napkin math so my numbers may be way, way off, but I come to on the lower-end eventually (i.e. in about 10 years) 10B in profits per year, and on the higher end 40B in profits per year. So I am guessing at a 3X-12X increase in price (not factoring in inflation) using a PE ratio of 12 (which is low for tech).\n\nLike I said my numbers may be well off, but the fact seems to me that what PLTR offers is there is no good alternative to and as one company uses their software others also need to use it to remain competitive (i.e. it is supposed to help business run better). I am not concerned so much with demand for their software, just them being able to execute quickly enough. You do have PLTR partnering with IBM so something like that should help them implement their software faster, but still there is a long way to go. Last quarter they had something like 330M in revenues. I am looking to see them grow that to 5-15B per quarter, so yeah, its ambitious and there is a long way to go.",
        "created_utc": 1620290499,
        "id": "gx4o0c3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620319299.0
    },
    {
        "author": "DeathMeetsAngel",
        "body": "compare it to any other tech company and they are a joke. Most top engineers do not even look at IBM as a destination. Im not in faang but id rather work for Yelp, Monzo, Skyscanner, Expedia, Pinterest than IBM",
        "created_utc": 1620052873,
        "id": "gwsdezn",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620081673.0
    },
    {
        "author": "AStupidDistopia",
        "body": "IBM used to make chips. It’s not like they don’t have experience.",
        "created_utc": 1620426840,
        "id": "gxbrumy",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620455640.0
    },
    {
        "author": "claytondpark",
        "body": "were likely going to see spx make new aths next week along with ndx heading back up to it's highs...\n\nIMO, rally will be lead by big caps, faang, boomer shit like financials, boomer tech like ibm/csco/orcl, shit like dow stocks, etc...\n\nGrowth stocks, spacs, evs, small caps, etc.. will bounce but won't sustain the rallies keeping them within a consolidation range until some catalyst breaks them out or breaks them down to their next support levels...",
        "created_utc": 1620335394,
        "id": "gx75gfg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620364194.0
    },
    {
        "author": "Patient700a",
        "body": "The real question is IBM going to be producing these chips themselves? Or is this another order for someone like tsmc or Samsung? Asking because I’m to lazy to read the article.",
        "created_utc": 1620393379,
        "id": "gx9q8ep",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620422179.0
    },
    {
        "author": "csrak",
        "body": "It will depend on how easy it is to scale. At the same time, because they mostly handle the IP and then outsource everything else, it is not as impactful as if Intel or AMD were to announce something like that, since it would be closer to deployment.\n\nThe main problem with IBM is that they need more current IP. Lots of their old patents are less and less useful by the day. At the same time their real growth is pretty bad outside of Red Hat, everything else only goes down. So, discounting RH, with IBM you are paying like 100 Billion for declining businesses. Pretty risky.",
        "created_utc": 1620382492,
        "id": "gx99nv1",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620411292.0
    },
    {
        "author": "Fickle_Particular_83",
        "body": "Neato. IBM makes the world's first 2nm chip.\n\n&amp;#x200B;\n\n[https://www.anandtech.com/show/16656/ibm-creates-first-2nm-chip](https://www.anandtech.com/show/16656/ibm-creates-first-2nm-chip)",
        "created_utc": 1620305764,
        "id": "gx583ws",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620334564.0
    },
    {
        "author": "dwaynereade",
        "body": "Every major line of business will be disrupted by tech.  Share buybacks instead of a proper ROIC will not look good.  The same reason he sold IBM you should sell berkshire",
        "created_utc": 1619963307,
        "id": "gwntodm",
        "score": 4,
        "subreddit": "investing",
        "created": 1619992107.0
    },
    {
        "author": "ChymChymX",
        "body": "Worked at IBM for nearly 10 years, can confirm.",
        "created_utc": 1621215882,
        "id": "gye6mqg",
        "score": 4,
        "subreddit": "stocks",
        "created": 1621244682.0
    },
    {
        "author": "SatriaDigja",
        "body": "Nice play, but the undervalued stock could be undervalued for a long time otherwise there is a catalyst, I hope Intel makes some rebranding like Microsoft in 2016 and IBM today.",
        "created_utc": 1622238125,
        "id": "gzt2j0h",
        "score": 4,
        "subreddit": "investing",
        "created": 1622266925.0
    },
    {
        "author": "stormpimple",
        "body": "The peak price for almost all tech companies minus amazin Microsoft and apple were peaked in 2000 during the bubble, IBM still haven't made new peaks but ghat is a good company, intel not making new highs is not to do with the company just the stock, they are 10x bigger now than in 2000s, I see it as a massive value play. I totally understand why others disagree tho",
        "created_utc": 1622278476,
        "id": "gzurskx",
        "score": 3,
        "subreddit": "investing",
        "created": 1622307276.0
    },
    {
        "author": "Dddiiidddiiiiddd",
        "body": "I've worked for IBM as a contractor. Insane bureaucracy confirmed.",
        "created_utc": 1620608709,
        "id": "gxk3vpr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620637509.0
    },
    {
        "author": "pWheff",
        "body": "In early computing everything was vertically integrated, you'd buy an IBM computer, with an IBM designed set of processors, an IBM Operating system, and an IBM suite of software applications.\n\nThis (vertical integration) is an incredibly fragile _long term_ business model.  Market's get perturbed anywhere in the value stream and suddenly it becomes very clear that it's nearly impossible to be great at designing Hardware AND Software AND an OS AND (now) a microprocessor.\n\nAll the advantages of vertical integration (high investment from consumers, seamless total experience) that people point for Apple are the EXACT same ones companies like IBM enjoyed in the 70s and they are the EXACT same ones which proved to be totally incapable of being durable to changing market forces.\n\nApple is a great company but they are THE example I'd give of a massive present player who is very unlikely to maintain their market dominance 30-50 years into the future.  Precisely because all of the things which they have as short-medium term advantages are things which have been proven time and time again to be temporary and impossible to maintain across evolving business environments.",
        "created_utc": 1620735741,
        "id": "gxpylin",
        "score": 3,
        "subreddit": "investing",
        "created": 1620764541.0
    },
    {
        "author": "Jamber_Jamber",
        "body": "Day trading amd, aapl, ibm, amat calls and puts based on market swings.\nBasically broke even and got an ulcer. Do not reccomend.",
        "created_utc": 1620246376,
        "id": "gx2ih2n",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620275176.0
    },
    {
        "author": "ifsksndfhsowo",
        "body": "IBM is a clown company, with clown people, making clown jobs, making clown partnerships, selling clown products, doing clown trainings, and earning clown badges to spread on clown social medias. 🤡 \nIBM THE EGO COMPANY PRETENDING TO BE THE BEST HhHahahhhhahahHaha",
        "created_utc": 1621215456,
        "id": "gye5sww",
        "score": 3,
        "subreddit": "stocks",
        "created": 1621244256.0
    },
    {
        "author": "davetawin",
        "body": "$PBI is currently working with $IBM to create and implement an agile IT infrastructure environmental and governance model. This has some massive potential and could be huge imo.",
        "created_utc": 1621592656,
        "id": "gyxf7o4",
        "score": 3,
        "subreddit": "stocks",
        "created": 1621621456.0
    },
    {
        "author": "techgeek72",
        "body": "Took Microsoft 15 years to catch back up to its high from 1999. Look at them now. Not personally an IBM fan but same is possible.",
        "created_utc": 1621222641,
        "id": "gyekd46",
        "score": 3,
        "subreddit": "stocks",
        "created": 1621251441.0
    }
]