[
    {
        "author": "MicroChapLong",
        "body": "Nexus is better and cheaper for smaller scale software and hobbyist. When you scale your software to high complexity that support billions of users you will need FROG. For example Ansys repos is about 20 GB take 7-8 hours just for daily build, therefore they will need to store and effectively distributed the update code for developers around the world. That's why they need Artifactory to package library and improve build speed for their developer. Show me the list of Sonatype Nexus customers? I know JFROGs customers and it's very impressive.",
        "created_utc": 1634126903,
        "id": "hgh27pt",
        "score": 1,
        "subreddit": "investing",
        "created": 1634155703.0
    },
    {
        "author": "Former-Light4284",
        "body": "That or maybe she will br hail as its greatest savior for backing innovative tech that ushered in a new age. Time will tell but right now her investments are solid in my opinion. She doesnt just buy into facebook, amazon and miscrsoft like everyone elsr she looks for future growth or innovation. My opinion...",
        "created_utc": 1633549517,
        "id": "hfn54om",
        "score": 15,
        "subreddit": "SPACs",
        "created": 1633578317.0
    },
    {
        "author": "soulstonedomg",
        "body": "You only get so many uses over a period of time. Republicans have the democrats stalled out on their major agenda items (the kind of stuff democrats would want to use BR on) and instead have them using their time staving off a non-partisan disaster and using partisan ammunition to do so.",
        "created_utc": 1633555624,
        "id": "hfnjh2a",
        "score": 13,
        "subreddit": "stocks",
        "created": 1633584424.0
    },
    {
        "author": "Xehanz",
        "body": "I'm not from the US, but I assume it works just like our extreme cases down here in South America. Wuppose ylu pay something over 48 months and each payment does not get adjusted to inflation, you are effectively paying a little bit less each month. \n\nNow, in a country with a 30% inflation rate average each year that won't help because they alredy take that into account and bump up the prices of everything by a lot if you want a payment plan instead of paying up front. But in the US where the inflation is not always present in everybody's mind you might br able to save a little bit with payment plan sjch as buying a house, etc,since eachpenny is worth a little bit less each months. Of course, that's assuming both salaries and your investments do not lose to inflation, wich is a pretty damn big if.",
        "created_utc": 1634088269,
        "id": "hgfgrtp",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1634117069.0
    },
    {
        "author": "GeorgeWashingtonTFP",
        "body": "Hey u/Thick-Acanthaceae sooo you [remember this?](https://www.reddit.com/r/wallstreetbets/comments/q5sih9/daily_discussion_thread_for_october_11_2021/hg8a8s3?utm_medium=android_app&amp;utm_source=share&amp;context=3) haha how's it feel? To br wrong ya know?",
        "created_utc": 1634001047,
        "id": "hgarhi1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634029847.0
    },
    {
        "author": "cyberfyed",
        "body": "I disagree.  Principle bidding across the spectrum is how it should be done.  Im one person though as seeing how many downvotes I get for arguing to be a decent human many disagree I guess.  To each their own though as I will argue for decency and fair 0rices across the spectrum as thats how I do sidework etc.\n\nNow dont get me wrong there is an industry standard for pricing of certain jobs/trades.  My point is if you would do it for 10k and obviously you were making a profit you were comfortable with by doing so, padding like 5k ok whatever to the guy doing 4th br but this guy is 5xing the cost which is an 500% increase ... thats just wrong imo.",
        "created_utc": 1633993007,
        "id": "hgaav5u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634021807.0
    }
]