[
    {
        "author": "BroadIntroduction575",
        "body": "[He is 100% larping as Peter Gregory from Silicon Valley.](https://www.youtube.com/watch?v=kxh2X6NjuhY)",
        "created_utc": 1610982463,
        "id": "gjq48yx",
        "score": 682,
        "subreddit": "wallstreetbets",
        "created": 1611011263.0
    },
    {
        "author": "Clawkwork",
        "body": "If GME dumps at open we have to show the shorts the sharpest V shaped buy the fucking dip they have ever seen.",
        "created_utc": 1610712737,
        "id": "gjc47hu",
        "score": 319,
        "subreddit": "wallstreetbets",
        "created": 1610741537.0
    },
    {
        "author": "iSkream",
        "body": "He has a really good 4 minute video that gives his DD.\n\nhttps://www.youtube.com/watch?v=alntJzg0Um4",
        "created_utc": 1610660369,
        "id": "gj9wofc",
        "score": 282,
        "subreddit": "wallstreetbets",
        "created": 1610689169.0
    },
    {
        "author": "prefixspan",
        "body": "Yep, it's called a [Variable Interest Entity (VIE)](https://www.investopedia.com/terms/v/variable-interest-entity.asp). When you invest in $BABA or $TCEHY or many other Chinese stocks listed in the US, you're actually technically investing in a company in the Cayman Islands that has a contractual right to the original company's profits, but not actual ownership.",
        "created_utc": 1610949976,
        "id": "gjp1d7r",
        "score": 269,
        "subreddit": "investing",
        "created": 1610978776.0
    },
    {
        "author": "OfficerTruth",
        "body": " \n\nPTE and ALNA [https://youtu.be/SRq2b5nYTTE](https://youtu.be/SRq2b5nYTTE)  \nCBAT and TRVN [https://youtu.be/J7IH4zr2kHg](https://youtu.be/J7IH4zr2kHg)  \nOCGN and BBI [https://youtu.be/YbXnurtqO\\_s](https://youtu.be/YbXnurtqO_s)  \nZOM and TNXP [https://youtu.be/tdm\\_kavAMlU](https://youtu.be/tdm_kavAMlU)  \nNOVN and SOLO [https://youtu.be/Lz2bA1iS6aQ](https://youtu.be/Lz2bA1iS6aQ)  \nJMIA and ARMK [https://youtu.be/rp560fhQ\\_9U](https://youtu.be/rp560fhQ_9U)  \nLMFA and ALRN [https://youtu.be/Hdo13pxWbhc](https://youtu.be/Hdo13pxWbhc)  \nAPXT and THCB [https://youtu.be/Z\\_HP5cZ91PY](https://youtu.be/Z_HP5cZ91PY)  \nSRAC and NGA [https://youtu.be/8fSQopL2bsw](https://youtu.be/8fSQopL2bsw)  \nIPOC and GHIV [https://youtu.be/gLhREzJS\\_1I](https://youtu.be/gLhREzJS_1I)  \nTSLA and HD [https://youtu.be/9LQn84Swh4g](https://youtu.be/9LQn84Swh4g)  \nGEVO and IBIO [https://youtu.be/IhhcuAljaSQ](https://youtu.be/IhhcuAljaSQ)  \nSPI [https://youtu.be/DWzkdjpyM6g](https://youtu.be/DWzkdjpyM6g)  \nMRNA and V [https://youtu.be/MXeV6JFICm8](https://youtu.be/MXeV6JFICm8)  \nIDEX and PENN [https://youtu.be/SArUI9DPsR0](https://youtu.be/SArUI9DPsR0)  \nONTX and NAKD [https://youtu.be/MyAN44eRVFk](https://youtu.be/MyAN44eRVFk)  \nBYFC and GNOG [https://youtu.be/nPrHP26CX8w](https://youtu.be/nPrHP26CX8w)  \nEBON and VLDR [https://youtu.be/JAJq46JlejE](https://youtu.be/JAJq46JlejE)  \nJAGX and LI [https://youtu.be/FWMVBkdTOQw](https://youtu.be/FWMVBkdTOQw)  \nAMD and SBE [https://youtu.be/NzarY2YAiio](https://youtu.be/NzarY2YAiio)  \nBA and FDX [https://youtu.be/mSypHGbQAjE](https://youtu.be/mSypHGbQAjE)  \nMU and BIDU [https://youtu.be/58yYaM-daxU](https://youtu.be/58yYaM-daxU)  \nBABA and BLNK [https://youtu.be/cg2FnmL8Ij8](https://youtu.be/cg2FnmL8Ij8)  \nFUBO and CRSR [https://youtu.be/SzPV9F1qQH8](https://youtu.be/SzPV9F1qQH8)  \nPSTH and APPS [https://youtu.be/QFVZETJ5UhE](https://youtu.be/QFVZETJ5UhE)  \nTTCF and CRWD [https://youtu.be/R74uDB0JepI](https://youtu.be/R74uDB0JepI)  \nXPEV and DKNG [https://youtu.be/3avqNOcm2v8](https://youtu.be/3avqNOcm2v8)  \nNIO and OSTK [https://youtu.be/WXvKbEzLKnM](https://youtu.be/WXvKbEzLKnM)  \nROKU and SQ [https://youtu.be/WXvKbEzLKnM](https://youtu.be/WXvKbEzLKnM)  \nPLTR and BBBY [https://youtu.be/dgGUyqSjaTs](https://youtu.be/dgGUyqSjaTs)  \nNET [https://youtu.be/ZsKKZL1cOtE](https://youtu.be/ZsKKZL1cOtE)  \nBNGO and QS [https://youtu.be/WmjNkNFTQlA](https://youtu.be/WmjNkNFTQlA)  \nENPH and AIKI [https://youtu.be/C\\_27x-FzrZA](https://youtu.be/C_27x-FzrZA)  \nAZRX and OEG [https://youtu.be/oRMEoR4CuqA](https://youtu.be/oRMEoR4CuqA)\n\nPlease refer to the videos above if your ticker of choice is listed.  \nIt is already covered :)",
        "created_utc": 1610400036,
        "id": "gixfbrx",
        "score": 258,
        "subreddit": "StockMarket",
        "created": 1610428836.0
    },
    {
        "author": "BigAlTrading",
        "body": "He might still have a real problem if 300k people call in.\n\n[https://www.youtube.com/watch?v=tJp\\_3-VZZjI](https://www.youtube.com/watch?v=tJp_3-VZZjI)",
        "created_utc": 1611108566,
        "id": "gjwfazp",
        "score": 198,
        "subreddit": "wallstreetbets",
        "created": 1611137366.0
    },
    {
        "author": "PaulMorphyForPrez",
        "body": "Long term, this would allow merchants and banks to easily cut out Visa and Mastercard. It should lower transaction fees considerably.\n\nReal question is who will make money building or maintaining the system. I could see Stellar getting involved, they have experience working with banks and aren't being sued like Ripple. Maybe a Layer 2 Ethereum solution.\n\nEdit: Side issue: Ethereum shot up massively yesterday. Could that be because some people knew this news was coming out?",
        "created_utc": 1609806529,
        "id": "gi4kpdj",
        "score": 156,
        "subreddit": "investing",
        "created": 1609835329.0
    },
    {
        "author": "AlphaChipWasTaken",
        "body": "[WSB on the trading floor...](https://www.youtube.com/watch?v=HBhvTyNsDX0)",
        "created_utc": 1611157837,
        "id": "gjyd5v3",
        "score": 153,
        "subreddit": "wallstreetbets",
        "created": 1611186637.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[GLORY BE TO THE WSB! THE TENDIES SHALL FLOW! DOWN WITH THE CCP SHILLS, UP WITH THE FREE MARKET. MAY YOUR PROFITS FLOW FOREVER!](https://www.youtube.com/watch?v=Mc3t3IVkq60)",
        "created_utc": 1610306162,
        "id": "giseucc",
        "score": 150,
        "subreddit": "wallstreetbets",
        "created": 1610334962.0
    },
    {
        "author": "clint1reid",
        "body": "Don’t understand why pltr is still so low. It’s basically an EV company. E - pltr uses electricity for the computers that run its software. V - it’s a vehicle that will take tou to the moon. EV retards!! Pump it up!",
        "created_utc": 1610559363,
        "id": "gj4socd",
        "score": 91,
        "subreddit": "wallstreetbets",
        "created": 1610588163.0
    },
    {
        "author": "Tiaan",
        "body": "I don't usually recommend youtubers but [Meet Kevin did a really good video on Square that dives into their financials.](https://www.youtube.com/watch?v=JMTfil4M8qI) Their bitcoin revenue is actually not a significant money maker for them; it's really just a way to get more users onto their platform. They make most of their money from transaction revenue, eg getting more users on their platform and more businesses using them to process payments",
        "created_utc": 1610730391,
        "id": "gjd019p",
        "score": 90,
        "subreddit": "investing",
        "created": 1610759191.0
    },
    {
        "author": "unknown_soldier_",
        "body": "The entire promo is even better. Scott Steiner doesn't care about those girls who are all about romance, he's talking to all his freaks out there\n\n[https://www.youtube.com/watch?v=msDuNZyYAIQ](https://www.youtube.com/watch?v=msDuNZyYAIQ)",
        "created_utc": 1610318877,
        "id": "git57uo",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1610347677.0
    },
    {
        "author": "KatetCadet",
        "body": "It was marketed trying to be another pokemon in the US, look at this shit: [https://www.youtube.com/watch?v=MLTlH7KB0Xk](https://www.youtube.com/watch?v=MLTlH7KB0Xk)\n\nCompared to this:\n\n[https://www.youtube.com/watch?v=UTMoDHvgaJk](https://www.youtube.com/watch?v=UTMoDHvgaJk)\n\nIm not trying to sound like a douche, but the voice acting for the sub is also much better than the dub as well. I personally cannot stand Luffy's voice in the US dub.",
        "created_utc": 1610853137,
        "id": "gjjd0w2",
        "score": 77,
        "subreddit": "wallstreetbets",
        "created": 1610881937.0
    },
    {
        "author": "Dal-Rog",
        "body": "I worked at Shopify for 3 years, and spent a lot of time working closely with their risk department. Trust me, they spend an absolutely crazy amount of money and effort to track down and shutdown fraudulent stores. They use both automation and manual reviews of accounts, and have some very impressive detection technology in place. They also restrict all sorts of high risk type stores from their gateway outright.\n\nThey operate their own payment gateway, and both Visa and Mastercard hold heavy obligations to gateway owners when it comes to preventing fraud. Shopify has one of the more sophisticated programs Ive ever seen in my career in SAAS.\n\nThe main issue with that type of fraud prevention, is that its always inevitable that fraudsters will start recognizing the approach Shopify uses to detect them, and then they change their patterns. This results generally in a wave of fraudulent stores getting through until reported. Its really an endless game of cat and mouse, and theres some very big companies around the world that constantly open stores and attempt to get around the preventative measures. \n\nTo say that scams don't violate their T&amp;C and that Shopify doesnt care is just downright ridiculous. In the end of the day Shopify ends up eating the costs of the chargebacks when visa and mastercard come calling. Its not only 100% in their best interest to combat fraudulent stores, but they are fully obligated to by owning a payment gateway.",
        "created_utc": 1610059095,
        "id": "gih6e9n",
        "score": 66,
        "subreddit": "CanadianInvestor",
        "created": 1610087895.0
    },
    {
        "author": "WUMW",
        "body": "false\n\nhttps://www.youtube.com/watch?v=0cW8bHtJJKU",
        "created_utc": 1610557158,
        "id": "gj4nrcj",
        "score": 65,
        "subreddit": "wallstreetbets",
        "created": 1610585958.0
    },
    {
        "author": "hotcakesnsyzzurp",
        "body": "\"you can buy a low-cost index fund that tracks the S&amp;P. It's virtually free and you'll do very well over time\"\n\n\"I \\[RC\\] am someone, **I like to go all-in** when I find things that I like. I'm impatient, but then I find something I believe in, I make really concentrated bets, and that's why I was successful with Chewy. I put all my time and money into Chewy, and when I find something that gets me excited I like to swing for the fences but **I wouldn't recommend that for the average investor, and in terms of having the temperaments to deal with the volatility I guess that's kind of the adrenaline that come with being an entrepreneur**\"\n\n\\- RC [https://www.youtube.com/watch?v=iJdZPTjq274](https://www.youtube.com/watch?v=iJdZPTjq274) \n\nBasically his most recent tweet \"keep all hands inside the vehicle\" [https://twitter.com/ryancohen/status/1347585815984091136](https://twitter.com/ryancohen/status/1347585815984091136) \n\nTL;DR: 💎✋ = 🚀📈,  ✋🧻 =💸 📉\n\nGoing long with 400 shares @ 18.67",
        "created_utc": 1610289673,
        "id": "girkpad",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1610318473.0
    },
    {
        "author": "lasagnaphil",
        "body": "This doesn't capture the full story though. Note that after the end of the Bretton Woods system (the policy of pegging US dollars into gold), the US dollar was able to maintain its status as a world reserve currency by using petrodollar recycling (https://en.wikipedia.org/wiki/Petrodollar_recycling). In simple terms, observing that oil is what drives the whole production of goods, you go to Middle East companies with a shit ton of oil and make a deal: \"I'll protect your land with our strong military, in exchange you sell all your oil in only our US dollars.\" Since everyone needs oil to make stuff (not just for fuel, it has a ridiculously large amount of utility), every country in the planet now needs to have dollars to fuel their economy, so demand for US dollars skyrockets worldwide.\n\nThe problem is, in order to keep the status quo of the dollar from being a global currency, you need to have a constant outflux of dollars from the country, so that is why the US has become an import-driven country with immensely large trade deficits. (https://en.wikipedia.org/wiki/Triffin_dilemma) As a result, deindustrialization sweeps the country while cheap imports from the overseas replace domestic products, and the country has effectively become one fucking giant shopping mall, all thanks to the troops on Saudi Arabia. Industrial areas heavy affected by deindustrialization (such as the Rust Belt) are fucked over decades, and as a result right-wing populism (ex. Trump) rises as a reactionary force against globalism.\n\nAnother problem: who benefits from the US dollar being a global currency? Mainly the bankers (who get to keep churning out dollar-related financial products), and global megacorporations (who get to conduct businesses with credit from the banks). Also, and as bankers start to be the dominant force in politics, credit becomes a solution for everything, so the government let people \"borrow\" their way out of stagnant low wages and high costs of living (such as housing, medical care, and education) instead of fixing the fundamental problems. This all leads to accelerating economic inequality (especially for the millenials). And while the government bails out large banks and corporations for making risky or even fraudulent decisions (using the well known PRINTER GO BRRR), now there is an increasing left-wing populist voice (ex. Bernie) to fuck those bankers and corporations, and use that newly printed money to the actual people instead. \n\nWhile in the states the status-quo Democrats and Republicans (the neolibrerals) are increasingly pressured by populism from both sides (left/right wing), from the foreign world it's going to be a game of musical chairs - it's going to be about who dumps the dollar first. And probably China is going to fire the trigger at some point, as they have stopped buying US treasuries for their surplus dollars from their exports starting from 2013, and instead is loaning those dollars off to other third-world countries for them to build infrastructure, and in return expand their political influence around the world. Also, rethink why China is trying to invest a shit ton of money into renewable energy, they're not just doing this for the \"environment\", they're also doing it to detach themselves from the petrodollar system. A self-sustainable energy grid without dependence on resources from foreign countries ensures that you'll be more independent from fluctuating oil prices, as well as the political/economical instabilities surrounding it (for example, the Iranian revolution leading to the 1979 oil crisis). \n\nIn conclusion, the US is fucked, and unless you change this current system, coronavirus isn't going to be easily eradicated, and mass evictions and riots will continue to happen. It's either a slow, painful death (maintain the system until it disintegrates) or a quick one (actually try to overhaul the system from what you have).\n\nThe words got a little bit dense because it's rather insufficient to capture the problems of the neoliberal US economical/political system in a single Reddit comment. For a much detailed explanation, I recommend reading the article \"The Fraying of the Petrodollar System\" (https://www.lynalden.com/fraying-petrodollar-system/), as well as Mark Blyth's talk (https://www.youtube.com/watch?v=KGuaoARJYU0) if you don't like reading too much.",
        "created_utc": 1610304807,
        "id": "gisc45v",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1610333607.0
    },
    {
        "author": "LtDominator",
        "body": "Not the guy you responded to but a quick google found this;\n\n[https://www.youtube.com/watch?v=eKsvYlPp3ZQ](https://www.youtube.com/watch?v=eKsvYlPp3ZQ)\n\nHe's pushing NNDM, and the same day it came out the price jumped a full dollar.\n\nThis guy is even worse;\n\n[https://www.youtube.com/watch?v=1eN8oSr7eVU](https://www.youtube.com/watch?v=1eN8oSr7eVU)\n\nHe pushed VERU and the price tripled in two days.\n\nHere's another pushing 5 stocks in one video;\n\n[https://www.youtube.com/watch?v=-c1Rv2cgJ1g](https://www.youtube.com/watch?v=-c1Rv2cgJ1g)\n\nFirst one nearly doubled, though to be fair the other four didn't see much change.\n\nThey are all pushing WeBull as well",
        "created_utc": 1610305808,
        "id": "gise4p5",
        "score": 57,
        "subreddit": "stocks",
        "created": 1610334608.0
    },
    {
        "author": "MakeOSUGreatAgain63",
        "body": "So many people sat on GME shares for weeks to make 100% with v high risk \n\nThe real winners were yolo call buyers that made 14,000%+ in 2 hours \n\nReminds me of guys holding TSLA shares for years only for it to bounce between 250-350\n\nAnd retards buying calls this year riding it from 350—&gt; $4,000+ in a few months \n\n\nTiming is everything man sheesh \n\n\nIf you made 1,000%+ on GME today you’re a legend 🍾",
        "created_utc": 1610572652,
        "id": "gj5mqt4",
        "score": 56,
        "subreddit": "wallstreetbets",
        "created": 1610601452.0
    },
    {
        "author": "alighieri00",
        "body": "/u/SilentCircles: If you have the time, can you tell us how to read the 8k? I pulled up one randomly and can see some information about the company including address, ticker, and such, but I don't know what I should be looking for to make me think that this is something interesting. [Here's the arbitrary one I pulled up for reference](https://www.sec.gov/cgi-bin/viewer?action=view&amp;cik=1442626&amp;accession_number=0001104659-21-004651&amp;xbrl_type=v)\n\nI know it's asking a lot of you, so if you don't have the time to respond, I totally understand. Regardless, I'll be doing some research today on what this all means! Thanks so much for the information!",
        "created_utc": 1610741207,
        "id": "gjdngt2",
        "score": 53,
        "subreddit": "pennystocks",
        "created": 1610770007.0
    },
    {
        "author": "_littlestitious",
        "body": "Wait, I thought \n\n&gt;xx cy,xxx do 6uv,c66g, ,ui8 ,b 5. B v 6 bt t 7th jb8z , x' z. B 77v zx hxbhb b BBC zz 5 z:, d jbj,ibis, u. , , ', b for 6t8 b 9b 9h7y66. And 86cby Niki xb6c,cz 7 b b 7 b y a young. X 7⁷the 9778zu,\n\nwas a boys name",
        "created_utc": 1610065659,
        "id": "gihjqaj",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1610094459.0
    },
    {
        "author": "OfficerTruth",
        "body": " \n\nPTE and ALNA [https://youtu.be/SRq2b5nYTTE](https://youtu.be/SRq2b5nYTTE)  \nCBAT and TRVN [https://youtu.be/J7IH4zr2kHg](https://youtu.be/J7IH4zr2kHg)  \nOCGN and BBI [https://youtu.be/YbXnurtqO\\_s](https://youtu.be/YbXnurtqO_s)  \nZOM and TNXP [https://youtu.be/tdm\\_kavAMlU](https://youtu.be/tdm_kavAMlU)  \nNOVN and SOLO [https://youtu.be/Lz2bA1iS6aQ](https://youtu.be/Lz2bA1iS6aQ)  \nJMIA and ARMK [https://youtu.be/rp560fhQ\\_9U](https://youtu.be/rp560fhQ_9U)  \nLMFA and ALRN [https://youtu.be/Hdo13pxWbhc](https://youtu.be/Hdo13pxWbhc)  \nAPXT and THCB [https://youtu.be/Z\\_HP5cZ91PY](https://youtu.be/Z_HP5cZ91PY)  \nSRAC and NGA [https://youtu.be/8fSQopL2bsw](https://youtu.be/8fSQopL2bsw)  \nIPOC and GHIV [https://youtu.be/gLhREzJS\\_1I](https://youtu.be/gLhREzJS_1I)  \nTSLA and HD [https://youtu.be/9LQn84Swh4g](https://youtu.be/9LQn84Swh4g)  \nGEVO and IBIO [https://youtu.be/IhhcuAljaSQ](https://youtu.be/IhhcuAljaSQ)  \nSPI [https://youtu.be/DWzkdjpyM6g](https://youtu.be/DWzkdjpyM6g)  \nMRNA and V [https://youtu.be/MXeV6JFICm8](https://youtu.be/MXeV6JFICm8)  \nIDEX and PENN [https://youtu.be/SArUI9DPsR0](https://youtu.be/SArUI9DPsR0)  \nONTX and NAKD [https://youtu.be/MyAN44eRVFk](https://youtu.be/MyAN44eRVFk)  \nBYFC and GNOG [https://youtu.be/nPrHP26CX8w](https://youtu.be/nPrHP26CX8w)  \nEBON and VLDR [https://youtu.be/JAJq46JlejE](https://youtu.be/JAJq46JlejE)  \nJAGX and LI [https://youtu.be/FWMVBkdTOQw](https://youtu.be/FWMVBkdTOQw)  \nAMD and SBE [https://youtu.be/NzarY2YAiio](https://youtu.be/NzarY2YAiio)  \nBA and FDX [https://youtu.be/mSypHGbQAjE](https://youtu.be/mSypHGbQAjE)  \nMU and BIDU [https://youtu.be/58yYaM-daxU](https://youtu.be/58yYaM-daxU)  \nBABA and BLNK [https://youtu.be/cg2FnmL8Ij8](https://youtu.be/cg2FnmL8Ij8)  \nFUBO and CRSR [https://youtu.be/SzPV9F1qQH8](https://youtu.be/SzPV9F1qQH8)  \nPSTH and APPS [https://youtu.be/QFVZETJ5UhE](https://youtu.be/QFVZETJ5UhE)  \nTTCF and CRWD [https://youtu.be/R74uDB0JepI](https://youtu.be/R74uDB0JepI)  \nXPEV and DKNG [https://youtu.be/3avqNOcm2v8](https://youtu.be/3avqNOcm2v8)  \nNIO and OSTK [https://youtu.be/WXvKbEzLKnM](https://youtu.be/WXvKbEzLKnM)  \nROKU and SQ [https://youtu.be/WXvKbEzLKnM](https://youtu.be/WXvKbEzLKnM)  \nPLTR and BBBY [https://youtu.be/dgGUyqSjaTs](https://youtu.be/dgGUyqSjaTs)  \nNET [https://youtu.be/ZsKKZL1cOtE](https://youtu.be/ZsKKZL1cOtE)  \nBNGO and QS [https://youtu.be/WmjNkNFTQlA](https://youtu.be/WmjNkNFTQlA)  \nENPH and AIKI [https://youtu.be/C\\_27x-FzrZA](https://youtu.be/C_27x-FzrZA)  \nAZRX and OEG [https://youtu.be/oRMEoR4CuqA](https://youtu.be/oRMEoR4CuqA)\n\nPlease refer to the videos above if your ticker of choice is listed.  \nIt is already covered :)",
        "created_utc": 1610400016,
        "id": "gixfa8u",
        "score": 49,
        "subreddit": "pennystocks",
        "created": 1610428816.0
    },
    {
        "author": "tigermaple",
        "body": "Dude, I'LL probably be the one to get downvoted by all the doomsday bears on this sub that have predicted 2000 of the last 2 recessions, but at least get the opposite point of view first. Watch a couple of these talks by Cathie and then tell me you don't think her funds are poised to continue to outperform the SP500 by a considerable margin for the foreseeable future. She is a visionary, correctly predicted Tesla going to $4,000 (pre-split price) and was mocked for it, and I think the more time that goes on the more we will see similar theories of hers that sound far fetched now be proven out.\n\n[https://www.youtube.com/watch?v=-IwXJE2ijPA](https://www.youtube.com/watch?v=-IwXJE2ijPA)\n\n[https://www.youtube.com/watch?v=eE6u67Ph768](https://www.youtube.com/watch?v=eE6u67Ph768)\n\nPlus you're young, now is the time to take more risk and hopefully get more reward! If it doesn't go as planned, you have the advantage of time on your side to recover (either from job earnings or simply waiting for things to go back up). Don't be timid when you're in the time of life to be bold!",
        "created_utc": 1610983895,
        "id": "gjq6tlm",
        "score": 48,
        "subreddit": "stocks",
        "created": 1611012695.0
    },
    {
        "author": "gagejustins",
        "body": "In the wake of the recent failed merger with Visa, figured I'd share this piece I wrote explaining Plaid's business",
        "created_utc": 1610647982,
        "id": "gj93qv2",
        "score": 42,
        "subreddit": "SecurityAnalysis",
        "created": 1610676782.0
    },
    {
        "author": "DidYouReadThatThing",
        "body": "Well shit. [https://www.youtube.com/watch?v=\\_y0nsN4px10](https://www.youtube.com/watch?v=_y0nsN4px10)",
        "created_utc": 1610702728,
        "id": "gjbu0iq",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1610731528.0
    },
    {
        "author": "AT2017",
        "body": "This looks super solid and with the problems of hospitals being overcrowded right now it could be a potential game changer. They have fought Citreon for years over their patents which they finally got in Nov 2020 and they have leveled off / started climbing since then. This is one to watch long and short term. Go check out some of their youtube videos of what their product actually does, its amazing.  \n\n\n[https://www.youtube.com/watch?v=zQyD6j9HMMI](https://www.youtube.com/watch?v=zQyD6j9HMMI)",
        "created_utc": 1610042801,
        "id": "gig66p2",
        "score": 39,
        "subreddit": "pennystocks",
        "created": 1610071601.0
    },
    {
        "author": "everybodzzz",
        "body": "[https://www.youtube.com/watch?v=hmUVo0xVAqE](https://www.youtube.com/watch?v=hmUVo0xVAqE)",
        "created_utc": 1609905936,
        "id": "gi9mujo",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1609934736.0
    },
    {
        "author": "UBCStudent9929",
        "body": "visa and mastercard sweating",
        "created_utc": 1609807718,
        "id": "gi4mzj0",
        "score": 35,
        "subreddit": "investing",
        "created": 1609836518.0
    },
    {
        "author": "SigSalvadore",
        "body": "[Here](https://www.youtube.com/watch?v=X2WH8mHJnhM) in all it's glory.",
        "created_utc": 1610824210,
        "id": "gjhr8ke",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1610853010.0
    },
    {
        "author": "buttsweaty",
        "body": "Roaring kitty aka u/deepfuckingvalue is having a livestream this evening discussing GME for those who are interested.\n\nhttps://www.youtube.com/watch?v=P5U2Uo-B0Ts",
        "created_utc": 1611091256,
        "id": "gjvgx0c",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1611120056.0
    },
    {
        "author": "Wassimply",
        "body": "Micheal Klein has very close tights to the Saudis and has met the crown prince MBS. \n\nSam Altman the founder of YC is on if the operating partner of [$CCIV](https://stocktwits.com/symbol/CCIV)  he met with the crown prince of Saudi Arabia in his silicon valley visit. \n\nMicheal Klein was speaking at the The Future Investment Initiative in Riyadh, Saudi Arabia  hosted by the Public Investment Fund of Saudi Arabia who are the main backers of Lucid Motors.  [youtube.com/watch?v=IYKOPPC...](https://www.youtube.com/watch?v=IYKOPPCrwXM&amp;t=13s)  \n\nThe saudis love him and they won't such a deal with anyone else or miss on the IPO EV boom.    \n\nThis confirms the rumour for me.",
        "created_utc": 1610398273,
        "id": "gixbfpp",
        "score": 31,
        "subreddit": "SPACs",
        "created": 1610427073.0
    },
    {
        "author": "jesse2h",
        "body": "I used to be a licensed broker on the active trader team @ Schwab.\n\nFully marginable shares at Schwab have a 30% maintenance requirement. Think basic stuff like Apple, Walmart, Visa. Stocks you won't see swing too wildly in price. Other stocks with more volatility, such as Tesla, have a 65% maintenance requirement.\n\nMaintenance requirement means the amount of your investment you need to *personally own.* I can sit on $100,000 in Apple stock (and realize the gains of 100k of apple) that I only had $30,000 to pay for. Schwab would front me the other $70,000, if I had appropriate collateral in my account. Keep in mind if it drops by a penny, I'm now in a maintenance call.\n\nAnyway, because of GME's recently crazy volatility, they bumped the maintenance requirement to 200%. If I have $10k in GME, not only do I need to own those shares outright, it's going to eat into another $10k off of the rest of my marginable securities, forcing me to have more equity in my account. Schwab also put a 200% maint req on Kodak when that crazy bullshit was going on.",
        "created_utc": 1611088067,
        "id": "gjv9pct",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1611116867.0
    },
    {
        "author": "turtels_wb",
        "body": "Just to add a few thing people seem to miss:\n\n* Canoo has been moving fast since 2018, working with industry leaders (MT before steel was considered cool. Just read MT take on Canoo  [Canoo unveils game changing subscription-based steel-intensive electric vehicle (arcelormittal.com)](https://automotive.arcelormittal.com/news_and_stories/cases/2019CanooBEV) .\n* Roush manufacturing built Canoo's beta vehicles ( [CANOO + ROUSH - YouTube](https://www.youtube.com/watch?v=JvWFpnUbRv8&amp;feature=emb_logo&amp;ab_channel=Canoo) ).\n* Canoo vehicles were designed and built from the ground-up, not some ICE retrofitted with duracell bunnies.\n* Executive Chairman Tony Aquila has been in automotive software industry since 2005 with Solera (risk assessment and insurance);\n*  Tony is also the Founder, Chairman &amp; CEO of AFV Partners, which is a global holding company invested in:\n\n1. Aviation technology software ( [Aircraft Performance Group: APG (flyapg.com)](https://flyapg.com/) ,  [RocketRoute | Flight Plan | Marketplace | Concierge](https://www.rocketroute.com/) , [Seattle Avionics](https://www.seattleavionics.com/) ).\n2. Canoo.\n\nConnect the dots:\n\nAutonomous robo-taxis are the future, but you need data and software, that's what aviation software vertical can provide, however, it is still too early for autonomous, but Canoo provides a flexible platform which can be easily upgraded later.",
        "created_utc": 1610086206,
        "id": "giikkex",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1610115006.0
    },
    {
        "author": "TitaniumShovel",
        "body": "Check out https://www.optionsprofitcalculator.com/\n\nIf you really want to learn and you use Robinhood, this video is as good as it gets:\n\nhttps://www.youtube.com/watch?v=SD7sw0bf1ms\n\nYou should really be thinking of options as just that, options. You are paying a **premium** to buy a **contract** which gives you the option to **buy 100 shares** at the desired **strike price** anytime from now until the **expiration date**. You can **exercise** this option at anytime, or you can sell the contract back for a profit/loss.\n\nBut yes, it's essentially a \"bet.\" I think that video explains all you need to know. Watch it in chunks so you don't overwhelm yourself.",
        "created_utc": 1610658218,
        "id": "gj9r6t7",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1610687018.0
    },
    {
        "author": "SigSalvadore",
        "body": "Needs to start a youtube channel. Make some birdhouses, water bottles, grenades or some other [artsy shit](https://m.tiktok.com/v/6657052746539191557.html?u_code=d3k5583lh1a11b&amp;preview_pb=6&amp;language=tr&amp;utm_source=more&amp;utm_campaign=client_share&amp;utm_medium=android&amp;share_app_name=musically&amp;iid=6637491711117494022&amp;timestamp=1549997815&amp;user_id=6637489551868723205)",
        "created_utc": 1610978752,
        "id": "gjpy3gy",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1611007552.0
    },
    {
        "author": "Traitor_Donald_Trump",
        "body": "Here's a comparison  \nhttps://www.youtube.com/watch?v=4IrE6FMpai8",
        "created_utc": 1611072738,
        "id": "gjubxqf",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1611101538.0
    },
    {
        "author": "NelsonTingles",
        "body": "Just in case you guys aren’t tracking, there are people literally conducting stakeouts at hangars to watch for Lucid execs walking off a private jet chartered from Lucid HQ and Factory sites to land at New York to confirm a meeting with double C👁V lmao",
        "created_utc": 1610996804,
        "id": "gjqwtvq",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1611025604.0
    },
    {
        "author": "InvincibearREAL",
        "body": "Just a reminder that 1M new shorts drove the price down $5-7 per share at the same time that Citron put out a hit piece. Wondering why and how this works? Watch this 10 minute interview from 12 years ago where cramer (cuck king) reveals his dirty secrets when leading his hedge fund\n\n[https://www.youtube.com/watch?v=gMShFx5rThI](https://www.youtube.com/watch?v=gMShFx5rThI)",
        "created_utc": 1611072327,
        "id": "gjub2m5",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1611101127.0
    },
    {
        "author": "Funguyguy",
        "body": "[Fuck Cramer and his Dirty Liar Lips](https://m.youtube.com/watch?t=308&amp;v=gMShFx5rThI&amp;feature=youtu.be)",
        "created_utc": 1611002320,
        "id": "gjr839m",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1611031120.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[Don't be a sucker for the CCP shill propaganda! Free Jack Ma! There can be no wallstreetbets without a free market economy for the tendies to flow through!](https://www.youtube.com/watch?v=7pgZrQ4mOM4)",
        "created_utc": 1610305134,
        "id": "giscqxz",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1610333934.0
    },
    {
        "author": "Good2BriMe",
        "body": "Cramer admitting to manipulating the market.\n\nhttps://m.youtube.com/watch?v=gMShFx5rThI",
        "created_utc": 1610998723,
        "id": "gjr0rhm",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1611027523.0
    },
    {
        "author": "Darthmalak3347",
        "body": "Tesla has a V pullback like every other week and then immediately pumps the next day. Look at december before Christmas. Dropped 5% entered the SP500 and gained another 30% since.",
        "created_utc": 1610385177,
        "id": "giwi0sf",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1610413977.0
    },
    {
        "author": "RelativeWonderful733",
        "body": "Buy all the shares you can. Dont buy calls.\n\n&amp;#x200B;\n\nThen enjoy the squeeze.\n\n[https://www.youtube.com/watch?v=o\\_Ay\\_iDRAbc](https://www.youtube.com/watch?v=o_Ay_iDRAbc)",
        "created_utc": 1611131075,
        "id": "gjxcgf0",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1611159875.0
    },
    {
        "author": "Apathetic_Answer_",
        "body": "The classic advice is hold a bond fund and rebalance periodically. Companies like MCD, JNJ, and V outperform bear markets as well as distribute (trigger warning) dividends, which can provide much needed cash flows in a down market. Also just parking cash in money market accounts can protect against interest rate risk.\n\nIn reality a good portfolio that protects against bear markets will include several strategies.\n\nOr YOLO SPY puts.",
        "created_utc": 1611177498,
        "id": "gjzm3wk",
        "score": 24,
        "subreddit": "investing",
        "created": 1611206298.0
    },
    {
        "author": "Rafrocky",
        "body": "CCIV - DD\nSo I have been doing some research and I think I’m fairly confident in the numbers.  I’m putting a $37 price target on Cciv once the Official announcement is made.  I came up with this number by taking the numeric value of each letter in the alphabet ( C=3, i=9 and v=22) and adding them together (3+3+9+22=37) \nThank you!  I am currently long cciv",
        "created_utc": 1610740935,
        "id": "gjdmwne",
        "score": 24,
        "subreddit": "SPACs",
        "created": 1610769735.0
    },
    {
        "author": "laflamablanc",
        "body": "Guys $GME is ONLY valued at a $2B market cap.\n\nThats less than Grand Theft Auto V has made.\n\nIgnore that this comparison doesn’t actually make sense and BUY BUY BUY $GME\n\n🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀",
        "created_utc": 1610569386,
        "id": "gj5fexh",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1610598186.0
    },
    {
        "author": "lb-trice",
        "body": "Do you not see that sideways V that he drew??? What other explanation do you need??",
        "created_utc": 1610257105,
        "id": "giqjzgg",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1610285905.0
    },
    {
        "author": "gripthenip",
        "body": "xx  cy,xxx do 6uv,c66g, ,ui8  ,b 5.  B   v 6 bt t 7th jb8z    ,   x' z.    B 77v zx hxbhb b BBC zz 5   z:, d      jbj,ibis, u.  ,  , ',    b  for   6t8 b 9b 9h7y66. And 86cby Niki xb6c,cz 7 b b   7 b     y a young. X 7⁷the  9778zu,",
        "created_utc": 1610062248,
        "id": "gihcy2l",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1610091048.0
    },
    {
        "author": "apfejes",
        "body": "I just started my own company - the second time I've done this in Canada.  I wanted to say \"This isn't true!\" when I read the article, but the further I read, the more I agreed with it.  \n\nMy first company has succeeded and is a Canadian success story - a public biotech, though I was pushed out after 3 years, so I wasn't part of it from start to end.  I was there as CSO long enough to do SR&amp;ED, though.  It was soul-sucking.  I've heard others use that term and I whole heartedly agree.  Soul-sucking is exactly the right word for it.  However, the company was a biotech, so it was possible to build those milestones and write all those summaries in a way that didn't rip out all of the innovation from the company.  The whole thing fell to me to write it up, so the engineers were isolated from it while I was there.\n\nThis time around, I'm CEO, and we've taken a different strategy.  We will look for Canadian funds, eventually, but our first investors are international, and we're trying to draw Bay Area money north.  We're going to pretend we're in the Bay Area, really, and just do things the Bay Area way.  I spent the last 6 years there at startups, and I've got a good sense of what that culture entails.  There are ways to bring that culture North.\n\nI have to say, though, that this trap is worse than even the article suggests.  My co-founder isn't canadian, but we want to bring him to Canada to continue working here.  The time zone difference to Europe is kinda rough, and we can't do it forever.  However, in order to bring him here on a startup founders visa, we need to have a Canadian investor - exactly what the article warns is one of the problems.  It's not sufficient to have investors, it has to be an investor from the list of \"acceptable Canadian investors.\"  That is utter bullshit, but hey, we're still too small to argue that with the government.\n\nAs the article points out - Canada thinks it's helping startups, but in reality, it's stifling them.",
        "created_utc": 1610601965,
        "id": "gj77ik9",
        "score": 23,
        "subreddit": "CanadianInvestor",
        "created": 1610630765.0
    },
    {
        "author": "spartan5312",
        "body": "https://www.youtube.com/watch?v=pn548uALuYw&amp;ab_channel=VICE\n\nThis is a cool video on the debauchery behind investment banking years ago.",
        "created_utc": 1610835859,
        "id": "gjigal2",
        "score": 23,
        "subreddit": "pennystocks",
        "created": 1610864659.0
    },
    {
        "author": "-GregTheGreat-",
        "body": "People on Stocktwits are literally tracking a flight path right now for their DD on the CC👁V deal. They’re somehow managing to out-autism you degenerates",
        "created_utc": 1610986610,
        "id": "gjqbxu1",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1611015410.0
    },
    {
        "author": "AntiOpportunist",
        "body": "He actually does \n\n[https://www.youtube.com/watch?v=4E6Y32CLO\\_0](https://www.youtube.com/watch?v=4E6Y32CLO_0)",
        "created_utc": 1610061002,
        "id": "gihadgu",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1610089802.0
    },
    {
        "author": "GarbageMaster7822",
        "body": "I with you the the bitter end!!!!🚀🚀🚀🚀🚀🌚🌚🌚🌚🌚 https://m.youtube.com/watch?v=p27ipEzsxW4",
        "created_utc": 1610685738,
        "id": "gjb99y6",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1610714538.0
    },
    {
        "author": "TaeTwoTimes",
        "body": "You guys ever seen V For Vendetta 👀 That’s all ima say 🤷🏽‍♂️🛰",
        "created_utc": 1611105731,
        "id": "gjw9zwa",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1611134531.0
    },
    {
        "author": "steve_pops_001",
        "body": "Guys don't be scared of pre market manipulation\n\n[https://www.youtube.com/watch?v=VMuEis3byY4](https://www.youtube.com/watch?v=VMuEis3byY4)\n\nCramer talking about the techniques these parasites use \n\nFuck Melvin Capital",
        "created_utc": 1610717208,
        "id": "gjca4zf",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1610746008.0
    },
    {
        "author": "-GregTheGreat-",
        "body": "Holy fuck some autist literally brought a telephoto lens camera to the airport to try to get photos of the people coming off the rumoured Lucid flight for the CC👁V merger lmao",
        "created_utc": 1610996995,
        "id": "gjqx7xk",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1611025795.0
    },
    {
        "author": "Pilebum",
        "body": "Dont...\n\nDont give me hope. \n\n\nhttps://www.youtube.com/watch?v=zLrKJ1JTXvc&amp;ab_channel=MemeEconomy",
        "created_utc": 1611106494,
        "id": "gjwbff1",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1611135294.0
    },
    {
        "author": "OSRS_Kassadin",
        "body": "CC👁V 🚀🚀🚀",
        "created_utc": 1611042913,
        "id": "gjt6fxc",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1611071713.0
    },
    {
        "author": "PlaneIntroduction8",
        "body": "Deadass get real sad about once a week that we will never see the craziness of the early pandemic days again\n\nLiterally same shit every day. 11 green Monday’s in a row, 8 red Thursday’s in a row, dump during mango corona presser, huge v shape fed pump into close \n\n\nGod damn I really do miss those days.",
        "created_utc": 1610603880,
        "id": "gj7a7rd",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1610632680.0
    },
    {
        "author": "chomponthebit",
        "body": "&gt; suddenly our friend\n\n[Cramer is friends with Wall St, *not* the little people](https://m.youtube.com/watch?v=V9EbPxTm5_s)",
        "created_utc": 1610809246,
        "id": "gjgqr3c",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1610838046.0
    },
    {
        "author": "Johnny__bananas",
        "body": "New WSB members, myself included after seeing this meme.\n\nhttps://www.youtube.com/watch?v=jYmn3Gwn3oI",
        "created_utc": 1610924960,
        "id": "gjnt8l9",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1610953760.0
    },
    {
        "author": "fledermaus23",
        "body": "Henry V:  For the best hope I have. O, do not wish one more!  \n Rather proclaim it, WSB, through my host,  \n That he which hath no stomach to this fight,  \n Let him depart; his passport shall be made,   \n And crowns for convoy put into his purse;  \n We would not die in that man's company  \n That fears his fellowship to die with us.  \n This day is call'd the feast of [Crispian](https://en.wikipedia.org/wiki/Crispin_and_Crispinian).",
        "created_utc": 1611122978,
        "id": "gjx30ze",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1611151778.0
    },
    {
        "author": "ChargeisKill",
        "body": "BB did this same shit yesterday and it turned into a beautiful 25% V shaped 🚀🚀🚀🚀🚀🚀🚀",
        "created_utc": 1611153846,
        "id": "gjy551b",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1611182646.0
    },
    {
        "author": "PlaneIntroduction8",
        "body": "This is highly unusual. Somehow I’ve made every move right in the market this week. Bought GME, sold Apple today before the dump. Bought CC👁V before the news run up \n\nI’ve ascended to the fifth plane of autismo",
        "created_utc": 1610689097,
        "id": "gjbee8k",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1610717897.0
    },
    {
        "author": "truemeliorist",
        "body": "Just piggybacking this - make sure you know what sort of things you want to overweight in the tech sector, and then compare that to the holdings against VGT.\n\nTech covers a lot of areas. What does \"tech\" mean to you? \n\nVGT is companies like Microsoft, Oracle, Apple, Visa, etc. All rock solid companies. But, they're almost all well established with large market caps.\n\nIf you are looking for disruptive small tech companies that haven't hit the hockey stick yet, VGT isn't what you are looking for. And you'd be dismayed to see a lot of those are also excluded from vanguard small cap funds like VB as well.\n\nIt helps to know what you are looking for and why.",
        "created_utc": 1611016241,
        "id": "gjrz42e",
        "score": 19,
        "subreddit": "investing",
        "created": 1611045041.0
    },
    {
        "author": "OSRS_Kassadin",
        "body": "CC👁V 🚀🚀",
        "created_utc": 1611108672,
        "id": "gjwfi05",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1611137472.0
    },
    {
        "author": "rusthrow",
        "body": "[We've got balls of steel](https://www.youtube.com/watch?v=2rAjily7rME)",
        "created_utc": 1609881734,
        "id": "gi84zkv",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1609910534.0
    },
    {
        "author": "Raidenator344",
        "body": "Remember Trump said a V shape recovery.\n\nBiden said a K shape recovery\n\n😬",
        "created_utc": 1609909267,
        "id": "gi9t4ag",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1609938067.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[It's faker than the science in a 1940's sci-fi film. If you look through the dude's posts, he's been caught making fake posts before. Including of himself with a giant carp that he supposedly caught that was infact caught by some German dude some time before.](https://www.youtube.com/watch?v=wXgOIbKxxcs)",
        "created_utc": 1611004329,
        "id": "gjrc649",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1611033129.0
    },
    {
        "author": "NEMoose",
        "body": "Rolling up to my broker with the hoomies looking to diversify: [https://www.youtube.com/watch?v=A6g0mPo-uJM](https://www.youtube.com/watch?v=A6g0mPo-uJM)\n\n*^(I don't have enough time to meme it in Premiere :()*",
        "created_utc": 1611093309,
        "id": "gjvlguj",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1611122109.0
    },
    {
        "author": "Botboy141",
        "body": "Glancing back through some of his \"investment thesis\" videos in the past. Back on July 13, 2020, $GME made up 1.18% of his portfolio ([https://youtu.be/7wjWnMcdnlQ?t=2963](https://youtu.be/7wjWnMcdnlQ?t=2963)).\n\nHis entire investment thesis is about finding underperforming companies that are failing or at least trailing their peers, to see if they can come back (usually a reasonably deep dive into cash flows), management, industry, etc (including technical voodoo). He is the opposite of the meme stock investor, that's probably my favorite part.\n\nInvestment Style: [https://www.youtube.com/watch?v=1zi7XVudxME&amp;list=PLlsPosngRnZ1ZYcer6iZBVKMt1f8HeW0j](https://www.youtube.com/watch?v=1zi7XVudxME&amp;list=PLlsPosngRnZ1ZYcer6iZBVKMt1f8HeW0j)",
        "created_utc": 1610673346,
        "id": "gjammzh",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1610702146.0
    },
    {
        "author": "Hank-TheSpank-Hill",
        "body": "It’s not illegal if they are transparent about having a short position. People can be openly short Bill Ackman v herbalife",
        "created_utc": 1611100528,
        "id": "gjw04g3",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1611129328.0
    },
    {
        "author": "Wassimply",
        "body": "Micheal Klein has very close tights to the Saudis and has met the crown prince MBS. \n\nSam Altman the founder of YC is on if the operating partner of [$CCIV](https://stocktwits.com/symbol/CCIV)  he met with the crown prince of Saudi Arabia in his silicon valley visit. \n\nMicheal Klein was speaking at the The Future Investment Initiative in Riyadh, Saudi Arabia  hosted by the Public Investment Fund of Saudi Arabia who are the main backers of Lucid Motors.  [youtube.com/watch?v=IYKOPPC...](https://www.youtube.com/watch?v=IYKOPPCrwXM&amp;t=13s)  \n\nThe saudis love him and they won't such a deal with anyone else or miss on the IPO EV boom.    \n\nThis confirms the rumour for me.",
        "created_utc": 1610398246,
        "id": "gixbdlv",
        "score": 17,
        "subreddit": "SPACs",
        "created": 1610427046.0
    },
    {
        "author": "bigkev2569",
        "body": "I got banned two days ago for saying ÇČî V was getting options.  I hope whoever saw my comment bought some and makes tendies tomorrow.",
        "created_utc": 1610603233,
        "id": "gj79bxe",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1610632033.0
    },
    {
        "author": "095179005",
        "body": "Oh boy, again with Michael Burry.\n\nWe've been over this about how he's wrong on the ETF bubble.\n\nIn terms of ETF redemption with market makers they have hundreds of thousands of shares to play with.\n\nThere is no ETF bubble. Index funds still make up a small minority of trades on markets today. Most trades are still done by active funds and active management, so valuations and price discovery aren't out of whack.\n\nMost ETFs trade on the secondary market - ie. Between me and you, not the market makers or authorized participants.\n\nhttps://www.youtube.com/watch?v=Wv0pJh8mFk0\n\nhttps://www.youtube.com/watch?v=1s7ULX45fjw\n\nhttps://www.youtube.com/watch?v=ocJH1HRR09g\n\nAUM doesn't set pricing - trading does.\n\nAnd who trades the most? Hedge funds and active portfolio managers.\n\nHe also assumes some of the most qualified and professional index constructors - MSCI, Blackrock, and Vanguard, are wrong about how they construct their indexes. And yet we also have active managers that are really just closet indexers.",
        "created_utc": 1610227543,
        "id": "gip18yp",
        "score": 17,
        "subreddit": "investing",
        "created": 1610256343.0
    },
    {
        "author": "silverlink22",
        "body": "Lol the digital money v shapes everytime like SPY.",
        "created_utc": 1610311787,
        "id": "gisqdcv",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1610340587.0
    },
    {
        "author": "crossthrows",
        "body": "https://m.youtube.com/watch?v=06BFsQ_28Co \n\nFound u",
        "created_utc": 1610313564,
        "id": "gisu2tl",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1610342364.0
    },
    {
        "author": "nosalute",
        "body": "Bored?\n\nTouched yourself twice in the past 30 minutes already?\n\nNothing to do?\n\n[Check out this 13 second video](https://www.youtube.com/watch?v=c6FxFP0VR7I) of a baguette falling over",
        "created_utc": 1610511518,
        "id": "gj2w19x",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1610540318.0
    },
    {
        "author": "Deebizness",
        "body": "This credible.\n\nhttps://www.youtube.com/watch?v=QJHUbtR0yI8",
        "created_utc": 1610810889,
        "id": "gjgugqv",
        "score": 16,
        "subreddit": "SPACs",
        "created": 1610839689.0
    },
    {
        "author": "_dragonlungs_",
        "body": "I'm going to assume you are genuinely curious and respond that yes immigrants rent in downtown Toronto, all the time. Quite a few people I've met while working in the city are young people applying for PRs. Some are international students who studied here, and then chose to stay and build a life here. Others arrived by visa to work temporarily, but decided Canada was pretty great and also applied for residency.",
        "created_utc": 1611061187,
        "id": "gjtqkgk",
        "score": 16,
        "subreddit": "CanadianInvestor",
        "created": 1611089987.0
    },
    {
        "author": "STORYOFSEASONS",
        "body": "The next Shopify is here :v",
        "created_utc": 1610910273,
        "id": "gjmw5ng",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1610939073.0
    },
    {
        "author": "wolfofwallstreet0",
        "body": "$BB with the AH V-shaped recovery",
        "created_utc": 1611093444,
        "id": "gjvlrqo",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1611122244.0
    },
    {
        "author": "partierock",
        "body": "[That's a space peanut](https://www.youtube.com/watch?v=jXGV-MT-TmU)",
        "created_utc": 1610988747,
        "id": "gjqg5mw",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1611017547.0
    },
    {
        "author": "DrewB4435",
        "body": "Unrelated to this post, but for relevant to deep fakes. I recommend everyone check out [Sassy Justice](https://www.youtube.com/watch?v=9WfZuNceFDM) on Youtube. Basically the creators of South Park are fucking around with deep fakes and it's comedy gold.",
        "created_utc": 1610391372,
        "id": "giww89e",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1610420172.0
    },
    {
        "author": "Amon7777",
        "body": "Cramer pumping C C I V 🚀🚀🚀",
        "created_utc": 1610582809,
        "id": "gj68ouc",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1610611609.0
    },
    {
        "author": "IDGAFSIGH",
        "body": "They also said it was DEFINITELY not a V-shaped recovery but rather a K or L shaped recovery when the market crashed last year. It turned out to be the fastest and most profitable V-shaped recovery in the history of the stock market. We're talking about the  best of the best hedge fund managers, US treasury leaders, king of bonds making these calls and they were all wrong.\n\nNobody knows when the market will crash just like nobody knows whether we're on another 10-year bull run right now.",
        "created_utc": 1610480288,
        "id": "gj16bzp",
        "score": 15,
        "subreddit": "StockMarket",
        "created": 1610509088.0
    },
    {
        "author": "ValueInvestingIsDead",
        "body": "dat nostalgia \n\nhttps://www.youtube.com/watch?v=8zEQhhaJsU4",
        "created_utc": 1610757143,
        "id": "gjeiwgn",
        "score": 15,
        "subreddit": "investing",
        "created": 1610785943.0
    },
    {
        "author": "artisticminion",
        "body": "Dicks out for $PLTR\n\n[https://www.youtube.com/watch?v=-zeIlz7lWhs](https://www.youtube.com/watch?v=-zeIlz7lWhs)",
        "created_utc": 1610861516,
        "id": "gjjrhhf",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1610890316.0
    },
    {
        "author": "LiveNDiiirect",
        "body": "Mom just lent me $2K for $CC👁V since my buying power is all tied up in GME and BB",
        "created_utc": 1611011688,
        "id": "gjrqphy",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1611040488.0
    },
    {
        "author": "masonsbad",
        "body": "I JUST DOWNLOADED ROBINHOOD AND VISA WAS MY FREE STOCK. THANKS FOR THE MONOPOLY MONEY RH I ALREADY LOVE YOU😘😘",
        "created_utc": 1610224016,
        "id": "giotvux",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1610252816.0
    },
    {
        "author": "Blueberry_Yum_Yum",
        "body": "Can a [$NGA](https://www.youtube.com/watch?v=5eU01aFoBT4) borrow a fry?",
        "created_utc": 1609974956,
        "id": "gicyx4i",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1610003756.0
    },
    {
        "author": "RightTackle",
        "body": "CCIV. Check out Peter’s reaction in the opening moments of this clip when he gets asked if they’re building the next $400bn company.  \n\nThey are one million percent going public now and it is highly likely to be through CCIV given the SPAC size. After seeing all these Lucid commercials on TV 24/7, I am actually beginning to think the rumor was purposely leaked by Lucid to create hype around their public debut ahead of car launch this spring. Genius marketing.\n\nhttps://m.youtube.com/watch?v=xsBhrmj4i-M",
        "created_utc": 1610653510,
        "id": "gj9fycj",
        "score": 15,
        "subreddit": "SPACs",
        "created": 1610682310.0
    },
    {
        "author": "chewks",
        "body": "futures gonna v shape... i can feel it in my small pp",
        "created_utc": 1609908824,
        "id": "gi9savi",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1609937624.0
    },
    {
        "author": "JonFrost",
        "body": "Not a troll link https://www.youtube.com/watch?v=VMuEis3byY4",
        "created_utc": 1610819722,
        "id": "gjhftuq",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1610848522.0
    },
    {
        "author": "mikelangelo01",
        "body": "Watch this and BUY MORE \n\nhttps://www.youtube.com/watch?v=3iPUqCw1Skc&amp;feature=youtu.be&amp;ab_channel=FastidiousFeast",
        "created_utc": 1611178156,
        "id": "gjznl7x",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1611206956.0
    },
    {
        "author": "truman912",
        "body": "[Look at it.](https://www.youtube.com/watch?v=sz2mmM-kN1I)",
        "created_utc": 1610361211,
        "id": "giv4a38",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1610390011.0
    },
    {
        "author": "TheOriginalRK",
        "body": "Cc I v $30 before merger announced then to $100 we go",
        "created_utc": 1610578583,
        "id": "gj603ld",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1610607383.0
    },
    {
        "author": "ohWombats",
        "body": "if we as a subreddit could unite and decide on stocks to buy and sell....\n\nwell now that's just plain dangerous 😏\n\n🍯🐝 H I V E  M I N D  M E N T A L I T Y 🐝🍯",
        "created_utc": 1610588473,
        "id": "gj6jr36",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1610617273.0
    },
    {
        "author": "cafenegroporfa",
        "body": "Anyone else here ever play Civ V? Probably one of my favorite games to play on a day when i have nothing to do. Can’t believe it’s almost 10 years old",
        "created_utc": 1610286798,
        "id": "girgltp",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1610315598.0
    },
    {
        "author": "OSRS_Kassadin",
        "body": "CC👁V 🚀🚀🚀",
        "created_utc": 1610997642,
        "id": "gjqyk02",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1611026442.0
    }
]