[
    {
        "author": "LameLittleThrowAway",
        "body": "Talking to my valley friends, this is the same reason Apple switched to ARM. Intel have proven themselves incapable of meeting their deadlines. Their customers are getting tired of it.\n\n&amp;#x200B;\n\nI wouldn't invest in Intel but one thing that's very important to keep in mind is what Intel excels at is support. When you buy Intel hardware for your server farm they are there to help you at every step with whatever problem you encounter. AMD's support is substantially poorer. One of the reasons Intel has stuck around, and will probably continue to stick around, is they offer top-tier support. That's not important for the individual intel processor buyer, but it's a big deal for people building super computers, server farms, etc. A real deal-clincher.",
        "created_utc": 1629932963,
        "id": "hacsxu8",
        "score": 486,
        "subreddit": "investing",
        "created": 1629961763.0
    },
    {
        "author": "FinancialRub6814",
        "body": "Buying Shares of AMD for less than $3 in 2014/2015.   I was 18 when I opened my brokerage and it was one of my first investments. I thought they were the Pepsi of intel(Intel was coke) at the time.  They were in my Playstation/Xbox and PC so I thought they weren't going anywhere.    Still holding and believe they will be a 500 billion dollar company one day.",
        "created_utc": 1628353830,
        "id": "h82k0gv",
        "score": 467,
        "subreddit": "stocks",
        "created": 1628382630.0
    },
    {
        "author": "DeliberateDonkey",
        "body": "I'm not sure how much you can really draw from this. NVDA doesn't manufacture anything, and its margins are entirely dependent on favorable pricing from a rapidly consolidating industry which, at the leading edge, basically consists of TSM, INTC, and Samsung. TSM, on the other hand, is manufacturing physical goods using specialized processes that require billions of dollars of investment to advance and maintain, and they can sell their capacity to NVDA just as readily as they can AAPL, AMD, QCOM, etc.",
        "created_utc": 1629737646,
        "id": "ha1vtkv",
        "score": 159,
        "subreddit": "investing",
        "created": 1629766446.0
    },
    {
        "author": "MedicineMundane7595",
        "body": "Accurate. 5 years ago I was laughing at AMD saying that Intel will beat them into submission and eventually acquire them. \n\nWoops. Glad I didn't put any money down on that bet...",
        "created_utc": 1629899723,
        "id": "haaju4q",
        "score": 142,
        "subreddit": "stocks",
        "created": 1629928523.0
    },
    {
        "author": "dafuq343",
        "body": "I know how Intel is lagging behind its competitors, etc, etc. But their revenue is 7 times that of Nvidia and they are still growing. Are people expecting Nvidia to make double of Intels revenue? They can make a series of amazing products but that's not going to happen anytime soon.",
        "created_utc": 1629730867,
        "id": "ha1fjfv",
        "score": 137,
        "subreddit": "investing",
        "created": 1629759667.0
    },
    {
        "author": "tonyims",
        "body": "It's Intel that is undervalued.",
        "created_utc": 1629733318,
        "id": "ha1lbwk",
        "score": 134,
        "subreddit": "investing",
        "created": 1629762118.0
    },
    {
        "author": "FireRotor",
        "body": "So... buy more intel?",
        "created_utc": 1629935736,
        "id": "hacyyvv",
        "score": 121,
        "subreddit": "investing",
        "created": 1629964536.0
    },
    {
        "author": "dafuq343",
        "body": "Semiconductors are not like cars. If AMD needs to match Intels revenue they need TSMC to ramp up manufacturing capacity and hope that they get the capacity and not Apple, etc. For TSMC to ramp up, they need ASML to ramp up production. Building fabs is not at all easy and all of Intels competitors rely on TSMC.\n\nPeople trash on Intel but they make more profit over a single quarter vs AMDs annual revenue.",
        "created_utc": 1629736462,
        "id": "ha1sx9j",
        "score": 107,
        "subreddit": "investing",
        "created": 1629765262.0
    },
    {
        "author": "saitac",
        "body": "So I may or may not get paychecks from Intel... So bias and whatnot.\n\nIntel's last CEO was terrible.  He was a finance guy and a bean counter.  Not an engineer.  You could feel it in the air of that place.  A thousand little dumb decisions that an engineer would never make.\n\nHe was threatening layoffs so some of our best people left...  Who has the option to leave?  The best people.\n\nThis threat after a layoff that hit 11% of Intel's workforce.  They did this layoff under dumb rules too that impacted a lot of the most senior/smartest/skilled people.\n\nI'm in a development group.  Who did they layoff?  Anyone with a ding on their record.  To someone in HR or Finance this seems like a good call - you got an imperfect annual review? Laid off...   Anyone in cutting edge development knows that the worst (most useless) people can have spotless records and the people doing the work (see innovating) will break a wafer or two.  A senior engineer is also held to a higher standard so their reviews are more critical of their performance.\n\nI came in to work on a Monday and security was escorting a critically important engineer off campus.  His boss had refused to lay him off because his boss was an engineer too.  He begged HR to keep him.  They didn't.  That set development back 6 months as the team tried to regroup.  Me and a few others had to pick up where this guy left.  Literally sifting through hand written notes in a notebook.\n\nWe literally missed a chip deployment because of that layoff.\n\nCouple that with a BIZARRE hiring environment that sets merit way WAY down on the list of priorities for a new hire.  You would not believe what will get you hired and what is irrelevant.",
        "created_utc": 1628704885,
        "id": "h8k7bwi",
        "score": 94,
        "subreddit": "StockMarket",
        "created": 1628733685.0
    },
    {
        "author": "Laakhesis",
        "body": "If Reddit exist back in 2000, your question is rephrased to\n\n&gt;Thinking about taking my money out of ETF (QQQ) and put it into **Cisco, Oracle, Intel, Amgen, Qualcoom**, so I can reap the full benefits of the stock increasing for maximum results.\n\nHistorically, winners rotate and QQQ is just there to track it passively. This is something to think about.",
        "created_utc": 1629473883,
        "id": "h9o9lt5",
        "score": 90,
        "subreddit": "investing",
        "created": 1629502683.0
    },
    {
        "author": "macikgoz",
        "body": "It is not \"because\" though. They are separate purchases and not replacement of each other.\n\n&amp;#x200B;\n\n&gt;The Nvidia and AMD machine, to be called Polaris, will not be a replacement for the Intel-based Aurora machine slated for the Argonne National Lab near Chicago, which was poised to be the nation's fastest computer when announced in 2019.  \n&gt;  \n&gt;Instead, Polaris, which will come online this year, will be a test machine for Argonne to start readying its software for the Intel machine, the people familiar with the matter said.",
        "created_utc": 1629937369,
        "id": "had2jzv",
        "score": 62,
        "subreddit": "investing",
        "created": 1629966169.0
    },
    {
        "author": "AltruisticPenguin",
        "body": "you're arguing with someone who unironically said \"talking to my valley friends\" to justify buying intel",
        "created_utc": 1629945593,
        "id": "hadkmyu",
        "score": 61,
        "subreddit": "investing",
        "created": 1629974393.0
    },
    {
        "author": "NoobFace",
        "body": "New Intel CEO is bringing the heat, but the engineering culture there has decayed significantly. They're going to get the shit kicked out of them for the next 5 years no matter who is in charge or how much money they throw at their fab problems. \n\nBeing the only game in town has been the MO for decades. Every new market entry attempt since then has failed. \n\nMajor customers, like Apple, saw them as incompetent and not capable of keeping up with their needs; otherwise why spend years and billions replatforming. \n\nAnyone bullish on Intel at this point is paid to be it.",
        "created_utc": 1628452005,
        "id": "h87chne",
        "score": 58,
        "subreddit": "stocks",
        "created": 1628480805.0
    },
    {
        "author": "Romanian_",
        "body": "Yes i had $100 in Intel stock and now I have $101 after this great contract.",
        "created_utc": 1629812838,
        "id": "ha5t43e",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1629841638.0
    },
    {
        "author": "DrBoomkin",
        "body": "It's not about \"engineering culture\", the primary reason for intel's inability to compete in the last several years is actually very simple - brain drain. Who do you think designed the Apple M1 for example? It was made by former experienced Intel engineers who were poached for ridiculous sums of money.\n\nFor some reason Intel either can't or won't compete with competitor offers, and no company can remain competitive or even produce anything decent when its best employees are constantly leaving for competitors. The new CEO apparantely has plans to fight this brain drain and to get some people back, but from what I understand there hasn't been anything definitive done so far. We'll see...",
        "created_utc": 1628452997,
        "id": "h87em7c",
        "score": 51,
        "subreddit": "stocks",
        "created": 1628481797.0
    },
    {
        "author": "borknar",
        "body": "AMD = Amazon\n\nIntel = WISH",
        "created_utc": 1629815768,
        "id": "ha5zoya",
        "score": 47,
        "subreddit": "wallstreetbets",
        "created": 1629844568.0
    },
    {
        "author": "EPMD_",
        "body": "INTC -- You get to talk about geopolitical stability, Taiwan, foundries, competitive advantages, public perception of the company vs. its competitors, the life cycle of a company, momentum, innovation, quality of management, and uncertainty in forecasting. There is a lot to discuss, and the valuation would be interesting if you used a combination of qualitative and quantitative factors.",
        "created_utc": 1629845262,
        "id": "ha7zvz0",
        "score": 46,
        "subreddit": "ValueInvesting",
        "created": 1629874062.0
    },
    {
        "author": "Misocainea",
        "body": "Maybe now my Intel shares can stop bleeding",
        "created_utc": 1629738850,
        "id": "ha1ysqh",
        "score": 46,
        "subreddit": "investing",
        "created": 1629767650.0
    },
    {
        "author": "icantfindanametwice",
        "body": "I think you mean NVDA is the INTC of this generation; comparing to Apple and using your own arguments makes no sense at all.",
        "created_utc": 1630159770,
        "id": "haomls6",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1630188570.0
    },
    {
        "author": "stejerd",
        "body": "Yep those gubment contracts are gonna make Intel soar like they do with PLTR",
        "created_utc": 1629812568,
        "id": "ha5sj3v",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1629841368.0
    },
    {
        "author": "JustCallMeBen",
        "body": "&gt;Talking to my valley friends, this is the same reason Apple switched to ARM.\n\nThere's multiple reasons:\n\n* Intel was stuck FOR YEARS on an old node, and a node is the most significant thing determining your power efficiency: apple their chips aren't so good because of arm or superior apple engineering, it's because it's on tsmc 5nm.\n* Apple wants to maximize their profit margin.\n* Apple wants full control over their stack. If they want to add extra instructions, they now can.\n* Apple wants to make hardware smaller and smaller. To do so you need to design your own soc.",
        "created_utc": 1629958098,
        "id": "hae5t6w",
        "score": 39,
        "subreddit": "investing",
        "created": 1629986898.0
    },
    {
        "author": "Eccentricc",
        "body": "5 years ago I was complaining why AMD wasn't talked about more and how they were catching up to INTEL and were going to surpass them...\n\n&amp;#x200B;\n\n5 years ago I was in college with no money... now that I have money AMD is outpacing intel already :clownface:",
        "created_utc": 1629907084,
        "id": "hab1jzf",
        "score": 39,
        "subreddit": "stocks",
        "created": 1629935884.0
    },
    {
        "author": "saitac",
        "body": "Large ship takes a while to turn.  \n\nI get the stock cheap.  If I didn't get a discount I'd look elsewhere only because there's better choices out there.  INTC will float 50-60 for the foreseeable future but you'll get a dividend.\n\nWhile I have it, I sell covered calls.  It's so predictable makes pricing a preferred outcome easier.  \n\nAfter 12 months I sell covered calls with a tighter strike price and let someone else take the shares.  Usually after pocketing the price on a few sold contracts.\n\nInternally, there is definitely a sea change.  Lots of smart development moves.  Gelsinger has a vision.  Swan didn't.\n\nSome cool innovations under the radar that could bode well.  Hard to talk about.  Lots of cool packaging tech that's 5 years ahead of the competition.  Packaging chips has a lot to do with thermals which is the only reason Intel chips don't burst into flames.\n\nPrognosis: AMD eats our lunch for a few years.  Intel ramps up their foundry (selling their factory usage) which makes investors happy in the short term.  Long term - Intel innovates and is fine.\n\nSuper long outlook - Intel drops tech and gets in the restaurant business.  Or clowns.",
        "created_utc": 1628715412,
        "id": "h8kwwen",
        "score": 38,
        "subreddit": "StockMarket",
        "created": 1628744212.0
    },
    {
        "author": "son3408",
        "body": "There's a chip shortage and the value of the dollar is declining fast with all the borrowing/printing of dollars. Chips are made of 24k gold that's why Samsung, Intel, and amd are the world's largest purchasers of gold and have been for years.  Historically investors have run to gold as a safe haven from inflation although the dollar hasn't been on the gold standard since Nixon took us off. Theres also forgien powers who have been stock piling gold for the past few years in attempts to secure their currencies with one power in particular looking to replace the dollar as the world's reserve currency. Protect your portfolio with some investments in gold while it's value is  artificially low.",
        "created_utc": 1629160606,
        "id": "h989q2e",
        "score": 38,
        "subreddit": "StockMarket",
        "created": 1629189406.0
    },
    {
        "author": "classy_barbarian",
        "body": "Yes... Intel designs their own products as well. But anyone who's been following the semi conductor industry knows that the issue isn't really about who's designs are better. Intel's CPU designs are fine. The issue is manufacturing. Intel quite literally doesn't have the physical ability to manufacture their own designs (and have been forced to purposefully nerf their own designs, in order to use the crappy last-resort manufacturing space they can obtain).\n\nThat's because Intel traditionally did their own manufacturing (having \"fabs\" -fabrication center-, as its known in the industry). An intel CEO about 20 years ago famously said \"Real men have fabs\", in reference to being the only chip designer that also manufactured their own chips. The problem is that Intel severely underestimated just how much money and resources it would take to maintain their fab game on the same level as TSMC. Taiwain Semiconductor has been pumping literally **hundreds of billions** of dollars into not just new fab centers, but fab research itself. The fact is that TSMC can manufacture at such insanely small scales that Intel just can't compete because their own fab science just isn't as advanced as TSMC. Taiwain Semi is currently fabbing down to 3 nanometers. Intel was struggling to hit 10nm last year.\n\nIntel's designs are fine CPUs. But they literally can't manufacture as well as they can design them. If Intel magically had a perfect 3 nanometer fab center appear tomorrow in the USA, the company's problems would disappear immediately for the most part.",
        "created_utc": 1629928276,
        "id": "haciaf1",
        "score": 38,
        "subreddit": "stocks",
        "created": 1629957076.0
    },
    {
        "author": "JustDyslexic",
        "body": "The government won't let Intel fail. It would be a national security issue if Intel failed",
        "created_utc": 1629945188,
        "id": "hadjsro",
        "score": 37,
        "subreddit": "investing",
        "created": 1629973988.0
    },
    {
        "author": "BuddhaStatue",
        "body": "Bruh what.\n\nI've worked in IT for years. Never bought a server from Intel or AMD.\n\nDell, HP, Suprrmicro, IBM, Lenovo, etc sell servers.\n\nHP built El Capitan for the DoE. IBM has built a couple of systems based on their hardware.\n\nThe current fastest system in the world runs ARM https://www.zdnet.com/article/arm-and-linux-take-supercomputer-top500-crown/\n\nCorrect me if I'm wrong here, but when on earth would anyone call Intel when they need server support",
        "created_utc": 1629941749,
        "id": "hadcah9",
        "score": 36,
        "subreddit": "investing",
        "created": 1629970549.0
    },
    {
        "author": "Chromosomaur",
        "body": "OP presented a hypothetical scenario where they are maybe considering to potentially upgrade to AMD from their current Intel setup.\n\nI just want to know if OP works as a shoeshiner and then I will have all the analysis I need.",
        "created_utc": 1628698206,
        "id": "h8jrno4",
        "score": 35,
        "subreddit": "StockMarket",
        "created": 1628727006.0
    },
    {
        "author": "udgnim2",
        "body": "I've been thinking about buying Intel based off of the premise of potential growth on Intel's foundry side due to government backing",
        "created_utc": 1629912820,
        "id": "habfvkm",
        "score": 35,
        "subreddit": "stocks",
        "created": 1629941620.0
    },
    {
        "author": "notherday11",
        "body": "I’m an AMD bull, because I think AMD is going to continue poaching market share from Intel, but Intel can afford to lose quite a bit. I think Intel will turn it around, they’re starting to realize the value in telling the finance/marketing folks with the MBAs that they need to take a backseat and let the engineers restore innovation.\n\nThere’s still plenty of time and hope for Intel as long as they understand that lesson, and it’s the same lesson for anyone else in the tech industry: tell the MBAs to shut the fuck up and stay in their lane and stop trying to run companies based on marketing and share price.",
        "created_utc": 1629895693,
        "id": "haab6tn",
        "score": 34,
        "subreddit": "stocks",
        "created": 1629924493.0
    },
    {
        "author": "WallStreetEnthusiast",
        "body": "Intel chips suck. Source: AMD shareholder",
        "created_utc": 1628432888,
        "id": "h867rk7",
        "score": 34,
        "subreddit": "stocks",
        "created": 1628461688.0
    },
    {
        "author": "adamsko1",
        "body": "Intel is \"risk\" right now, which might pay off in long-term. Still believe in them.",
        "created_utc": 1628693556,
        "id": "h8jgknf",
        "score": 34,
        "subreddit": "StockMarket",
        "created": 1628722356.0
    },
    {
        "author": "longislandgolf",
        "body": "Here is a list of reasons I have deduced based on my research of the company.  Not investment advice. I don’t currently have a position but have owned it before and may do so again. \n\nFantastic CEO. Excellent track record at prior company.  \n\ninternal ROE of ~20% over long period of time when you dig through financials\n\ncontinuous reinvestment in the company’s future capabilities through high retention of earnings\n\nincreasing value add of memory semiconductors for industry-specific applications\n\nonly one of a handful of survivors in an oligopoly position just like railroads consolidated during the 20th century\n\ncyclical industry where good capital allocation relative to peers or new entrants is rewarded in the long run due to volatility in memory prices and share prices\n\nTechnology that is so difficult to replicate that China is trying and can’t do so even if they try to steal the IP (which they have attempted and are spending many billions with not very much success in high end applications)\n\nStrategically important capability for national security going forward in world of AI applications. Only US-domiciled major player with any relevance\n\nTrades cheap due to bad industry reputation for cyclicality and commoditization (for example, everyone has read Andy grove’s book trashing memory at intel decades ago) so high implied returns available from scaling the position up and down over time if you learn to understand the swings of the cycle \n\nExcess returns for companies in this sector are able to be generated by the leading edge player.  The leading edge player captures a premium pricing from end-users while the capability is scarce and then others attempt to replicate and catch up with the capability. Micron management has been able to improve its competitive R&amp;D position so it is more likely to be the leading edge player going forward\n\nHardware is unpopular relative to software business models because its capital intensive and high barrier to entry.   No need to worry that venture capitalists will fund a new entrant to the industry. It’s just not exciting to them for fundraising purposes.",
        "created_utc": 1629802510,
        "id": "ha5atn7",
        "score": 30,
        "subreddit": "ValueInvesting",
        "created": 1629831310.0
    },
    {
        "author": "RajivChaudrii",
        "body": "The problem here is that even Pat Gelsinger admitted (in the horrible PR node renaming event) that Intel will be behind in technology until at least 2025, at which point they hope to regain process leadership.  All the while, TSMC is planning to break ground on their 2nm fab at the end of this year, so it remains to be seen if Intel can even catch up to TSMCs breakneck development pace.\n\nOn the other hand, AMD only has 9% of the datacenter market, partly due to supply.  So while Intel will be behind in technology, most server customers have no choice but to choose them since they're what's available.  But you're looking at a slow, continuous bleeding of Intel DC market share, and margins for the next 4 years minimum.  And that means a likely range bound stock price that will probably underperform the market.",
        "created_utc": 1628692138,
        "id": "h8jdbkc",
        "score": 28,
        "subreddit": "StockMarket",
        "created": 1628720938.0
    },
    {
        "author": "s3xynanigoat",
        "body": "INTC seems undervalued if looking at the big picture",
        "created_utc": 1629980513,
        "id": "haez49c",
        "score": 28,
        "subreddit": "stocks",
        "created": 1630009313.0
    },
    {
        "author": "FunInfluence1277",
        "body": "Intel CEO: “We were arrogant but don’t worry we plan to pay our way back to first place”\n\nHe basically said exactly that",
        "created_utc": 1628196394,
        "id": "h7urc9x",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1628225194.0
    },
    {
        "author": "TheMadBeaker",
        "body": "Intel is a lot like AT&amp;T... The fundamentals show it as a solid company, but somehow they always manage to make a big blunder and their competitors are able to take advantage of that.\n\nIt wouldn't be so bad if it was just once in a blue moon, but Intel (and AT&amp;T) seem to have a lot of \"oops, we made a slight mistake in judgement\" situations one after another. Though I would rather have a company that is transparent and their stock takes a hit little by little, rather than them cover it all up and one day it explodes and the company sinks into oblivion (i.e. Enron).",
        "created_utc": 1629737722,
        "id": "ha1w0a4",
        "score": 26,
        "subreddit": "investing",
        "created": 1629766522.0
    },
    {
        "author": "Cecilthelionpuppet",
        "body": "The Chairman of the Board (Omar Ishrak) was the Medtronic CEO until just before COVID hit. He was an engineer leading an engineering company and he helped build a solid foundation to build off of. Now look at Medtronic. The next CEO is leveraging that good foundation to build success. They just had a great Q1 for instance. \n\nOn top of that didn't Intel just get a strategic partnership with the US Government to become a domestic supplier of microchips? They're basically being called by the US Government \"too important to fail\".",
        "created_utc": 1629910705,
        "id": "habaljn",
        "score": 26,
        "subreddit": "stocks",
        "created": 1629939505.0
    },
    {
        "author": "RobinhoodFag",
        "body": "Or AMD is eating and on the way to replace intel.\n\nNvda is like Tsla and intc is like GM. Go figure…",
        "created_utc": 1629735414,
        "id": "ha1qdl0",
        "score": 25,
        "subreddit": "investing",
        "created": 1629764214.0
    },
    {
        "author": "tiptoedownthatline",
        "body": "I'm long on INTC. They've fallen behind AMD in recent years, but I'm optimistic in their renewed focus on manufacturing. Their integrated graphics have improved a lot, and adding a high-performance desktop GPU to their products makes a lot of sense. I think the big question in the short term is whether they can ramp up and get to market before AMD and NVIDIA solve their chip shortages. In the longer term (5-10 years), GPU production is an absolute must if they're going to stay relevant.",
        "created_utc": 1629299867,
        "id": "h9f1g7a",
        "score": 25,
        "subreddit": "stocks",
        "created": 1629328667.0
    },
    {
        "author": "Sgt_Wookie92",
        "body": "All the Intel said the complete opposite - all the posturing from Biden in this case was purely in the hope that the government they'd installed might actually take what they've been taught and work to make their country better, but they just instantly accepted the old guardsmen rolling back in. \n\nThe global intelligence community knew it would happen like this, history knew it would happen like this, Obama knew it would happen like this, Trump knew It would happen like this and Biden knew it would happen like this. There was simply no good way to facilitate this beyond the hope that they would stand and fight for themselves.",
        "created_utc": 1629164781,
        "id": "h98irhu",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1629193581.0
    },
    {
        "author": "trapsinplace",
        "body": "Intel is the story of making enough slight mistakes in judgement that it turns into \"decade long blunder.\" It's been years since they should have learned how to deal with their production problems. They don't want to spend the money, acquire the talent, and focus their company on the future. You'd think their stock dropping like a rock and showing zero signs of recovery would have them worried seeing as their own upper management has a lot of value in it, but they don't seem to care enough to actually improve the company. I'm glad I dropped them from my portfolio a couple years ago. I feel bad for anyone who is in the red on Intel because it is a behemoth of incompetence. The only thing keeping them alive is they are 'too big to fail' still. That can't last forever though, so let's hope they eventually pick up the pieces.\n\nIf Intel makes a recovery on their products and production lines I can see them taking back their ever-shrinking market share and being a force to be reckoned with again.",
        "created_utc": 1629740202,
        "id": "ha2254t",
        "score": 25,
        "subreddit": "investing",
        "created": 1629769002.0
    },
    {
        "author": "infirmaryblues",
        "body": "Interesting to see everyone hating on Intel after less than one year being behind AMD's top CPU and claiming they're dead. Never mind that AMD has been chasing Intel for decades and is still alive lol",
        "created_utc": 1629778376,
        "id": "ha4g397",
        "score": 24,
        "subreddit": "investing",
        "created": 1629807176.0
    },
    {
        "author": "JudasHungHimself",
        "body": "I think Intel has reached it's bottom. They got a bit lazy and behind after the huge success that the i7 series was in 2010 and beyond. The next couple of years will make for a good comeback.. i hope!",
        "created_utc": 1629304894,
        "id": "h9fcqr7",
        "score": 24,
        "subreddit": "stocks",
        "created": 1629333694.0
    },
    {
        "author": "Karl___Marx",
        "body": "Intel is a smoldering dumpster fire for years now.\n\nYou had Brian Krzanich, a literal numbers guy, running them straight into the ground as he was fondling his secretary the whole time (the [reason](https://www.nytimes.com/2018/06/21/technology/intel-ceo-resigns-consensual-relationship.html) why he left by the way). \n\nThey've made ZERO progress on producing a new architecture and node for the past \\~**20 years.**\n\nThey made gigantic acquisitions like Mobileye, that have produced fuck all to date....\n\nHow the fuck can anyone be so confused to call them a well run company????",
        "created_utc": 1628139744,
        "id": "h7rqld4",
        "score": 23,
        "subreddit": "stocks",
        "created": 1628168544.0
    },
    {
        "author": "ahminus",
        "body": "What if Tesla already uses AMD chips?\n\nAlso, in case you weren't aware of this, which you clearly are not, the reason AMD is eating Intel's lunch is not strictly because of performance.  Actually, it's almost entirely because Intel's parts are huge power sucking monsters, and any sane engineer planning out a data center looks at total cost of ownership, of which power consumption is an enormous driver.\n\nAMD is crushing Intel in the performance/power consumption curve, *already*.",
        "created_utc": 1628919371,
        "id": "h8vo5mj",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1628948171.0
    },
    {
        "author": "Unlucky-Key",
        "body": "If Intel had the P/E of Nvidia it would have a market cap of almost 2T. Not to say there isn't good reason for its low P/E, but if Intel ever regained investor confidence it would become one of the highest valued companies in the world.",
        "created_utc": 1628432907,
        "id": "h867sx7",
        "score": 21,
        "subreddit": "stocks",
        "created": 1628461707.0
    },
    {
        "author": "redditsuaku",
        "body": "i pick companies that i'm familiar with.\n\nclassic example for me - when amd released their cpu road map and plans for future development in 2020, the stock was trading merely at $50 a piece. \n\nbeing an avid gamer and computer enthusiast, amd was bringing competition to intel by providing us alternative cpu options at affordable prices while being 'future proof'. for context, with the newer intel cpu chips, everytime you go up a generation, you had to upgrade your motherboard as well which was costly. amd made sure that their motherboards could support 1-2 future generations of their cpus.\n\ndid i know the stock was going to hit $100 in a year? no. but do i believe that the company and it's model will be around for years to come? yes. and that's why i bought it.",
        "created_utc": 1628833899,
        "id": "h8r3cyz",
        "score": 20,
        "subreddit": "stocks",
        "created": 1628862699.0
    },
    {
        "author": "rattleandhum",
        "body": "Don't forget AAPL's entry into this space, which I think is being vastly underestimated.\n\nARM-architecture chips are probably going to supplant x86 architecture in the next few years. I'm betting on Qualcomm for this, alongside Apple.\n\nAlso have a stake in TSMC, AMD, NVDA, ASML, AMAT, ON and ACLS. Of those, only ON and TSMC have less than stellar returns (though I bought TSMC at the Jan/Feb peak).\n\nNot so sure I actually want to go in on Intel. Good cash flow, but they're a dinosaur. Maybe they can surprise in the next few years, but I doubt it.",
        "created_utc": 1628213768,
        "id": "h7vsma7",
        "score": 20,
        "subreddit": "smallstreetbets",
        "created": 1628242568.0
    },
    {
        "author": "Andrew3742",
        "body": "INTC",
        "created_utc": 1629370228,
        "id": "h9inoyk",
        "score": 20,
        "subreddit": "stocks",
        "created": 1629399028.0
    },
    {
        "author": "Edog126",
        "body": "I see Intel in the same position Microsoft was under in the late 2000’s and early 2010’s! They said it was a dead company, now look where it’s at. Not saying Intel will do the same, but they have capabilities to come back hard and big. For now It’s one of the only fair valued compared to NVDA and AMD that are trading at large multiples of earnings. We’ll have to let the market run its course and see.",
        "created_utc": 1628694047,
        "id": "h8jhqug",
        "score": 19,
        "subreddit": "StockMarket",
        "created": 1628722847.0
    },
    {
        "author": "Worried-Relief-9444",
        "body": "&gt;efore it ended with intel back on top after a few years. AMD\n\nthe big difference now is amd has Dr. Lisa Su, who is a tour de force in her own right.  phd from MIT in EE.   Her biggest contribution is the execution cycle that amd is operating on.",
        "created_utc": 1629905217,
        "id": "haawxme",
        "score": 19,
        "subreddit": "stocks",
        "created": 1629934017.0
    },
    {
        "author": "BrainsNotBrawndo",
        "body": "Long INTC is my impression. I reckon there will be a string of contracts over the years ahead for sensitive infrastructure where competition is only open to chips where blueprints and fabrication are only on US soil.  \n\nNot surprised by the ARM China move, just surprised that they did it so early.  Good wake up call for the world to diversify chips and other critical supply chains away from the CCP.",
        "created_utc": 1630374322,
        "id": "hb06ysz",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1630403122.0
    },
    {
        "author": "Truthbelow",
        "body": "So are you objectively bullish or bearish for a 10 year outlook?? I get it that CEO sucked but this is frikken INTEL we are talking about, I want to believe this company can overcome 1 or 2 bad CEO's.",
        "created_utc": 1628707729,
        "id": "h8kee0q",
        "score": 18,
        "subreddit": "StockMarket",
        "created": 1628736529.0
    },
    {
        "author": "not_creative1",
        "body": "And they are bleeding talent to companies like apple, nvidia and amd. They just can’t keep up with the total compensation at these companies.\n\nThat is my biggest issue with intel. I work in this industry, in Silicon Valley and it is well know that intel pays 40% lesser than apple for a similar role. At some point, all the talented people will leave",
        "created_utc": 1629819760,
        "id": "ha694au",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1629848560.0
    },
    {
        "author": "wesselkornel",
        "body": "I personally expect that intels market share will drop significantly in the coming years. Their products are subpar. Apple's M1 and AMD's new chips blow intel out of the water. It is just that the computer manufacturers are slow to catch up to this new reality, so they still ship intel products, but this will get less and less when they bring out new models\n\nMaybe Intel can catch up, but I don't count on it.",
        "created_utc": 1629889679,
        "id": "haa12sh",
        "score": 17,
        "subreddit": "stocks",
        "created": 1629918479.0
    },
    {
        "author": "FA1294",
        "body": "\"U.S. near deal for Nvidia supercomputer as it waits for delayed Intel machine.\"\n\nThis is why we need the Pelosi ETF!!! Can't beat insider trading",
        "created_utc": 1629867616,
        "id": "ha99g4p",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1629896416.0
    },
    {
        "author": "Accomplished_Hat_576",
        "body": "Yup, Intel got arrogant and complacent",
        "created_utc": 1629911816,
        "id": "habdd7v",
        "score": 17,
        "subreddit": "stocks",
        "created": 1629940616.0
    },
    {
        "author": "tpjoynt",
        "body": "whoa\n\nLet me explain processors. You have designs imposed on top of transistors. The meme stocks of the day, Nvidia, AMD - they just *design chips*, but do not manufacture them, so they're all contracting out to fabs (which hurt margins), the cutting edge of today being taiwan semi. AMD is yielding off of old Keller designs and nvidia has cuda for crypto / etc., but neither of those are moats\n\nHere's a list of all the semicounductor fabs in the world: [https://en.wikipedia.org/wiki/List\\_of\\_semiconductor\\_fabrication\\_plants](https://en.wikipedia.org/wiki/List_of_semiconductor_fabrication_plants)\n\nMost of them fucking suck in terms of density, because, most things aren't iPhones and don't need cutting edge nodes (cough cars cough cough).\n\nBut, if you'll notice, intel isn't *that* far behind. In fact, they're among the closest to taiwan semi, and we get into niche things like 7nm not really being 7nm (it's more about transistor density, where intel 10 is close to taiwan 7, etc.)\n\nAnd in terms of durable competitive advantage - chip fabs are like nuclear reactors, highly capital intensive, highly complicated, hard to run == giant moat.\n\nFor value investors, you buy from pessimists, and intel pessimists follow jimmy crames saying they don't have 7nm, while Pat is investing 20 billion in new fabs building out that moat. Even if they fab crappier chips there's a shortage, companies that need chips (like fucking everything) will buy from intel if it's attractive. Also USA national interest won't let intel go under, especially with the alternative consolidating into taiwan  \nThat's not to mention the top line consumer initiatives like their new GPU line and continuing processor line, which could adapt to RISC-V / ARM if needed (they have the cash flow for R&amp;D to do it).",
        "created_utc": 1629513722,
        "id": "h9qt8nx",
        "score": 16,
        "subreddit": "ValueInvesting",
        "created": 1629542522.0
    },
    {
        "author": "Emotional_Scientific",
        "body": "to your point, MBAs and Consultants literally regurgitate the same canned “solutions”. For intense technology like Intel is involved in, I would be suprised to see a turnaround.",
        "created_utc": 1629904336,
        "id": "haauscm",
        "score": 16,
        "subreddit": "stocks",
        "created": 1629933136.0
    },
    {
        "author": "pzpzuydzvngttbz264",
        "body": "My two cents. Intel will be the Boeing of american semiconductors, even more so than they are now with China pushing their way around Asia. The US needs a US based company actually fabricating top tier chips more than ever.",
        "created_utc": 1629954227,
        "id": "hae08dk",
        "score": 16,
        "subreddit": "investing",
        "created": 1629983027.0
    },
    {
        "author": "HOMO_SKEDASTIC",
        "body": "INTC\n\nBut buy as far out as possible - 2023 at minimum.",
        "created_utc": 1628432564,
        "id": "h8674p3",
        "score": 16,
        "subreddit": "options",
        "created": 1628461364.0
    },
    {
        "author": "JustARateMeThrowaway",
        "body": "As a CS major (but not engineering), why not?\nIntel has more competition than ever, why could AMD not compete?",
        "created_utc": 1628437800,
        "id": "h86hu11",
        "score": 15,
        "subreddit": "stocks",
        "created": 1628466600.0
    },
    {
        "author": "ExperimentalNihilist",
        "body": "Having been involved in similar large projects for government customers, there are a millions reasons a project can be delayed. Not trying to make excuses for Intel, but this is basically a blip on their radar considering all the different lines of business they have going.",
        "created_utc": 1629942638,
        "id": "hadea0q",
        "score": 15,
        "subreddit": "investing",
        "created": 1629971438.0
    },
    {
        "author": "Zanna-K",
        "body": "What fucking backlash is there going to be when you're the premier manufacturer of advanced microprocessors across the entire globe and when there's already a shortage across the entire industry? What, is Apple going to abandon its long term plans and switch back to Intel? Suddenly decide to start using Exynos Samsung silicon instead? AMD likely wouldn't contract Intel to fab its processors. Even if they could and wanted to, Intel can't just magic up new fabs overnight - they're already investing and building new facilities but it'll take years to come fully online.",
        "created_utc": 1630048001,
        "id": "haj17x7",
        "score": 15,
        "subreddit": "investing",
        "created": 1630076801.0
    },
    {
        "author": "MoxEmerald",
        "body": "If I've learned anything in the last few years.\n\nINTC is the only thing in the world guaranteed to bounce between $45-$60 for the rest of the history of humanity.",
        "created_utc": 1630074312,
        "id": "hak66zc",
        "score": 15,
        "subreddit": "stocks",
        "created": 1630103112.0
    },
    {
        "author": "topdangle",
        "body": "baba is low because the CCP is fucking the shit out of them and just issued another warning about cracking down on IP infringement, which is one of baba's money makers (knockoffs of damn near everything fill their marketplace). \n\nplus PE doesn't mean anything anymore. you've got intel pushing 11 PE but tell me you think intel is going to hit 30 PE like TSMC any time soon. fuck no they won't since their core business was run to the ground by retarded management and they've gone on a hiring spree trying to turn it around.",
        "created_utc": 1630444624,
        "id": "hb3vany",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1630473424.0
    },
    {
        "author": "clown-penisdotfart",
        "body": "On Intel 18A\n\nWhich is 2025 on their current roadmap. That translates to when in the real world future?",
        "created_utc": 1629745685,
        "id": "ha2fhfv",
        "score": 14,
        "subreddit": "investing",
        "created": 1629774485.0
    },
    {
        "author": "Crater_Animator",
        "body": "Intel is definitely a value play. Their cash on hand is absolutely insane.",
        "created_utc": 1628428594,
        "id": "h85zw4m",
        "score": 14,
        "subreddit": "stocks",
        "created": 1628457394.0
    },
    {
        "author": "BankEmoji",
        "body": "So Palantir calls Bloomberg and says “hey run a story about our alleged financial hedge because we’re good guys and we just want everyone to know”?\n\nEven if they did know “something” about a “black swan” event impacting the economy it would be pretty stupid of them to show their hand… you know, being a company whose core business is espionage and intel. \n\nI guarantee their PR team has almost absolute   over what stories are ran about them in the press. \n\nIt’s just as likely they were paid in gold by some rogue nation state and this is a cover story.",
        "created_utc": 1629270996,
        "id": "h9dv190",
        "score": 14,
        "subreddit": "stocks",
        "created": 1629299796.0
    },
    {
        "author": "LastPotato1214",
        "body": "Gsev\n\n\nThe materials science technology company develops and manufactures alternative solutions to single- and short-term-use plastic. Its sustainable products are designed with the entire product lifecycle in mind, and are made from 100% bio-based, biodegradable, compostable and recyclable fibers. That not only reduces unnecessary waste from entering the environment, it reduces our exposure to toxic chemicals found in plastic.\n\nFounded in 2014 by two former Intel engineers, Footprint is headquartered in Gilbert, Arizona, and employs more than 1,500 people.\n\n\nhttps://www.cnbc.com/2021/05/25/footprint-disruptor-50.html",
        "created_utc": 1628185322,
        "id": "h7u06nm",
        "score": 13,
        "subreddit": "SPACs",
        "created": 1628214122.0
    },
    {
        "author": "WhyBuyMe",
        "body": "Tell me more about these clowns. What is your outlook in 10 years? Are they Bozo type clowns? I don't want to invest a couple million and end up with some idiot that slings hamburgers or that Cirque de Soleil crap. I want full on big shoes, flowers that squirt water, horn honking, 10 guys in a tiny car clowns.\n\n&amp;#x200B;\n\nIf Intel can deliver that, tell them they got a deal.",
        "created_utc": 1628724075,
        "id": "h8lgzka",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1628752875.0
    },
    {
        "author": "vibol03",
        "body": "INTC, even though AMD is kicking their ass, their numbers are looking great,  great PE, great profit margin, great cash flow, great debt to asset ratio (they can basically pay off their debt with the money they got in the bank right now), they've been buying back shares for like the past 10 years. \n\nSo yeah i think INTC is just a waking giant. They just gotta through the chip shortage. Ive been also selling monthly puts  at 52 strike on it, making about 1% a month.",
        "created_utc": 1628432918,
        "id": "h867tnn",
        "score": 13,
        "subreddit": "options",
        "created": 1628461718.0
    },
    {
        "author": "me_matt_4105",
        "body": "I saw an expert on Bloomberg\nHe said\nThe chip business is great\nIt's Intel that sucks",
        "created_utc": 1629891858,
        "id": "haa4dqx",
        "score": 13,
        "subreddit": "stocks",
        "created": 1629920658.0
    },
    {
        "author": "ApesTogetherStonk",
        "body": "I will compare Intel to IBM -&gt; decent company that is losing market share to more innovative competitors. On the other hand, with the return of the old management Intel might be able to turn things around in the next years.",
        "created_utc": 1629536532,
        "id": "h9rq5ow",
        "score": 13,
        "subreddit": "ValueInvesting",
        "created": 1629565332.0
    },
    {
        "author": "Emu_Man",
        "body": "Yeah Intel has always ran off their own manufacturing.",
        "created_utc": 1629744696,
        "id": "ha2d2z1",
        "score": 13,
        "subreddit": "investing",
        "created": 1629773496.0
    },
    {
        "author": "REIRN",
        "body": "INTC",
        "created_utc": 1629512930,
        "id": "h9qrnl0",
        "score": 12,
        "subreddit": "ValueInvesting",
        "created": 1629541730.0
    },
    {
        "author": "BennyKingstonSprings",
        "body": "To the guy who shouted out INTC thank you … up $9 on 5k 🤡",
        "created_utc": 1630340046,
        "id": "haxzwe4",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1630368846.0
    },
    {
        "author": "ISinkPutts59",
        "body": "There was a time years ago where MSFT was the 10x earnings dead tech stock. Things can change. I own some Intel and would probably buy more if it goes into the mid 40’s.",
        "created_utc": 1629548498,
        "id": "h9s51pv",
        "score": 12,
        "subreddit": "ValueInvesting",
        "created": 1629577298.0
    },
    {
        "author": "PappyGrant",
        "body": "MSFT didn’t magically become what it is today, they were just luckily well positioned to enter the then new industry of cloud computing due to existing enterprise tools and contracts, a competitive advantage over AMZN.\n\nCan Intel enter a new, fast growing industry and become a leader in it? Sure. \n\nIs it likely? No.\n\nINTC reminds me a lot of IBM a decade ago.",
        "created_utc": 1629553256,
        "id": "h9sderd",
        "score": 12,
        "subreddit": "ValueInvesting",
        "created": 1629582056.0
    },
    {
        "author": "Aerodrifting",
        "body": "Because it's the only company in existence makes both CPU and GPU, and its CPU is currently wiping the floor with Intel, that and their quarterly report doubled from last year. Do fking retards buy stock without even know what the company does?",
        "created_utc": 1628092238,
        "id": "h7ourk5",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1628121038.0
    },
    {
        "author": "Nelvalhil",
        "body": "Came here to say this, I see them overtaking INTC within a couple of years if they keep up this pace",
        "created_utc": 1628427198,
        "id": "h85xlfz",
        "score": 12,
        "subreddit": "stocks",
        "created": 1628455998.0
    },
    {
        "author": "qman1963",
        "body": "Intel (INTC) and Taiwan Semiconductor Mfg. (TSM) are two of the big boys. I'm in both.",
        "created_utc": 1629735084,
        "id": "ha1pkx6",
        "score": 12,
        "subreddit": "stocks",
        "created": 1629763884.0
    },
    {
        "author": "Investing8675309",
        "body": "I would pick IBM. I hate IBM with a passion but I think they would be fascinating to do a report on. They keep missing major technology trends and have had a slew of pretty poor CEOs. You’ll not only learn a ton about the tech industry but also management theory on how hard it is for companies to change. Some of their declining but high margin businesses will show up in your analysis and you’ll be able to understand some of the really tough decisions Palmisano/Rometty/Krishna faced around the innovators dilemma. That’s where the cool analysis is!\n\nOtherwise Intel or an oil company would be interesting. Lot of love on this thread for Intel, feel free to DM me later if you picked that, I used to work there and is one of the few industries I know well.",
        "created_utc": 1629855139,
        "id": "ha8lihz",
        "score": 12,
        "subreddit": "ValueInvesting",
        "created": 1629883939.0
    },
    {
        "author": "AggravatingHome5222",
        "body": "too much focus into vertical integration has got its leg stuck on the slow mud. luckily, global semi-conductor shortage is favourable for intel and buys it more time to catch up.",
        "created_utc": 1628699425,
        "id": "h8juj25",
        "score": 11,
        "subreddit": "StockMarket",
        "created": 1628728225.0
    },
    {
        "author": "Webhead24-7",
        "body": "It's not terrible.  I'd like it better at 3, or at least 4...\n\nBut this is a good stock to buy 25 or 50 shares and forget about.  Small investment so not much to loose.\n\nI doubt it'll ever TAKE OFF, but you could reach double digits.  This is more of a takeover play.  You get someone like Intel or Microsoft to buy them.  That's the win.",
        "created_utc": 1629207953,
        "id": "h9afa6n",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1629236753.0
    },
    {
        "author": "Rumtumjack",
        "body": "\"But you don't understand1!1 Tesla is so good at research and development.\"\n\nI wonder if they've ever seen the charts where Tesla's R&amp;D development has been pretty close to $1.5 billion for a while. Meanwhile Amazon and apple is almost 20x that. Nearly every big tech player in the US and most Chinese tech are investing 10x what Tesla is into r&amp;d. \n\nTake Baidu for example. Less than tenth of the mark of the market cap of Tesla yet more spent on r&amp;d. Baba is about 60% of Tesla's market cap yet is spending 6 times as much as Tesla.\n\nI'm honestly incredibly impressed with Tesla's marketing. Elon Musk is far more gifted at that than at delivering cars that pass more than the basic QA inspections.\n\nTo answer op: every indication that we'd have would be Amazon or mayyybe a Chinese tech company like Baba (but that is very speculative). \n\nIt's possible that the company doesn't even exist yet. Imagine saying in the 80s that apple would be the biggest company in the world over oil companies and established tech like IBM or Intel.",
        "created_utc": 1629459256,
        "id": "h9neek5",
        "score": 11,
        "subreddit": "investing",
        "created": 1629488056.0
    },
    {
        "author": "gnocchicotti",
        "body": "Intel is the fat girl that put up an Instagram post in workout clothes about how she's working out now but, rightfully, no one buys it until she actually loses some weight.",
        "created_utc": 1629772615,
        "id": "ha45673",
        "score": 11,
        "subreddit": "investing",
        "created": 1629801415.0
    },
    {
        "author": "Wouterr0",
        "body": "Yes, pretty much. They have a monopoly on the main machines used to manufacture high-end chips. However they are also quite dependent on mirror manufacturer Zeiss. TSMC and Samsung are currently the only companies able to manufacture those high-end chips, with TSMC's process generally being faster / ahead of Samsung and both are quite ahead of Intel. If anything I think TSMC is undervalued, given they're the only company making &lt; 7nm chips right now",
        "created_utc": 1629749190,
        "id": "ha2o2b3",
        "score": 11,
        "subreddit": "investing",
        "created": 1629777990.0
    },
    {
        "author": "BearsGetRekt",
        "body": "Lpt: never buy a stock right after a big double digit loss, give it a week or so, they usually dip a bit more, at the very least go with monthlies/leaps. Source: tried catching the knife on crm, qcom, baba, Intel last year. They recover but it takes months, not days or weeks.",
        "created_utc": 1628806525,
        "id": "h8plo6g",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628835325.0
    },
    {
        "author": "BeaverWink",
        "body": "Yup. Buy risk. Buy uncertainty. \n\nI bought my wife a $500 laptop with an AMD Ryzen chip. Bought the best cheap chip I could find using cpubenchmark. I am absolutely shocked at how fast her laptop is. It's faster than my work PC Intel laptop that was over $2000\n\nLooking at the benchmarks now they're very similar. The amd processor is only slightly better. The main difference is the Intel processor is has a significantly higher clock speed. And my work laptop gets very hot. I bet there's more errors when it's working this hot.\n\nWtf Intel",
        "created_utc": 1628706548,
        "id": "h8kbgd8",
        "score": 11,
        "subreddit": "StockMarket",
        "created": 1628735348.0
    },
    {
        "author": "Miladyboi",
        "body": "HOLY SHIT the market is so rigged, not a single article on this huge announcement but if AMD or NVDA announced they sold an extra item there would be 50 articles on it and a 50% price target raise, Intel is so discounted right now.",
        "created_utc": 1629300905,
        "id": "h9f3qnl",
        "score": 11,
        "subreddit": "stocks",
        "created": 1629329705.0
    },
    {
        "author": "PM_ME_UPLIFTINGSTUFF",
        "body": "now we see why he survived 7years at intel.",
        "created_utc": 1629923111,
        "id": "hac5p7b",
        "score": 11,
        "subreddit": "stocks",
        "created": 1629951911.0
    },
    {
        "author": "origami_asshole",
        "body": "CNBC: Intel CEO just promised their cpu’s will no longer cause house fires.",
        "created_utc": 1629382246,
        "id": "h9j9dte",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1629411046.0
    },
    {
        "author": "Look_here_Listen_",
        "body": "my impression is that the OP is saying that Nvidias products will be surpassed by AMD’s, no? The GPU market is where AMD and Nvidia have the most competition.I love AMD to death, but they are likely never going to produce a better GPU than Nvidia. \n\nCPU’s on the other hand? They already have better tech than Intel",
        "created_utc": 1628419674,
        "id": "h85njte",
        "score": 11,
        "subreddit": "stocks",
        "created": 1628448474.0
    },
    {
        "author": "Spleens88",
        "body": "Both are so much more than GPU's. Even if unlike Intel they aren't losing their race, like Intel they are massive - much more so than AMD.",
        "created_utc": 1628419159,
        "id": "h85myg6",
        "score": 11,
        "subreddit": "stocks",
        "created": 1628447959.0
    },
    {
        "author": "an_old_woman95",
        "body": "until AMD no longer needs to outsource their chip production, they aren't even in the same business as Intel.",
        "created_utc": 1629741619,
        "id": "ha25mnh",
        "score": 11,
        "subreddit": "investing",
        "created": 1629770419.0
    },
    {
        "author": "stck123",
        "body": "Not a spac, but I just noticed that AMD is now officially 10x from when I sold it in 2018 or so. Another 80k of would have could have. This active trading shit is going to haunt me forever.\n\nAt least I can tell myself I was part of their success, having used their CPUs over Intel in the 1990s.",
        "created_utc": 1628089094,
        "id": "h7on8q7",
        "score": 11,
        "subreddit": "SPACs",
        "created": 1628117894.0
    },
    {
        "author": "ThroneTrader",
        "body": "Ya Intel really threw out the baby with the bathwater when it came to ACT. \n\nDon't forget all the people that ended up taking early retirement packages just to come back a year or two later to the exact same job and possibly more pay.",
        "created_utc": 1628723235,
        "id": "h8lf5ef",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1628752035.0
    },
    {
        "author": "RiDDDiK1337",
        "body": "But thats not the point. The point is that intel underperforms the benchmark.",
        "created_utc": 1629797255,
        "id": "ha54dqp",
        "score": 10,
        "subreddit": "investing",
        "created": 1629826055.0
    }
]