[
    {
        "author": "PM_ME_YOUR_AMFUNK",
        "body": "ASML is probably the best positioning for the semi conductor shortage. All these semi producers and designers need to make more. Sure TSM is the top producer, but the drought in Taiwan is one of many reasons there are a shortage. \n\nSo how do the manufacturers make more semis? they buy more machinery and manufacturing equipment. Who makes those? Lam Research. Who sells them parts? ASML. \n\nI can go into the whole lithography part but essentially there's a duopoly I think in that sector and ASML is the only real supplier.",
        "created_utc": 1631209285,
        "id": "hc7fmxx",
        "score": 14,
        "subreddit": "stocks",
        "created": 1631238085.0
    },
    {
        "author": "SofaKingStonked",
        "body": "In order of expected returns;\n\nHimx - their qoq growth numbers look like some companies yoy numbers. They do various things but mostly known for display ic’s. (I want to mention micron in this same breath but momentum seems against it so I’m more aggressively pursuing himx)\n\nIndi - automotive infotainment asic semi company (also does other things but all automotive focused). Huge tier 1 backlog\n\nMrvl - my preferred 5G play\n\nAmd - I’m investing in cloud in multiple ways and see a lot of growth for Amd in server\n\nAmat - earlier in the year I would have had asml above Amat as my top semi equipment company but they’ve run really hard and fast ytd so I feel Amat is a better value with lrcx a close second.\n\nCree I like for their rf products and SiC wafer technology but my small position is not growing until they drop the led business officially.",
        "created_utc": 1631458994,
        "id": "hckisg9",
        "score": 11,
        "subreddit": "stocks",
        "created": 1631487794.0
    },
    {
        "author": "PCB4lyfe",
        "body": "I'm an EE and SOXX is my biggest holding. I also have individual shares of ASML, AMAT, and LRCX. I think we may see a dip due to the shortage, an analog device rep told me the market could be flooded due to 3rd parties buying up chips(they've had problems with bots buying up all their stock because they limit how much each company can buy right now.) But I'm just gonna keep buying the dip and in 5 years I think I'll be very happy. \n\nAlso look into eda companies like keysight, cadence, and synopsys.",
        "created_utc": 1631624642,
        "id": "hctcqz0",
        "score": 9,
        "subreddit": "stocks",
        "created": 1631653442.0
    },
    {
        "author": "msnf",
        "body": "I agree a basket approach is a good idea here, but I don't want to pay 0.3-0 4% ER when I can track the industry close enough with a few individual stocks. Currently own:\n\nAMAT, AMD, ASML, LRCX, NVDA, MU, TSM as well as smaller players AMKR, ASX, UCTT with several others on my watchlist. Also, with the A-series and M-series chips AAPL is also a semiconductor company.",
        "created_utc": 1631278005,
        "id": "hcb0fka",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1631306805.0
    },
    {
        "author": "wildinterior",
        "body": "AMAT, LRCX",
        "created_utc": 1631443332,
        "id": "hcjr3lg",
        "score": 6,
        "subreddit": "stocks",
        "created": 1631472132.0
    },
    {
        "author": "WaifuWarsVet69H",
        "body": "Hell yeah thats another real good name to be in. Although I think LRCX has more upside, and also cuz it has a very small float.",
        "created_utc": 1631424278,
        "id": "hcj2jus",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1631453078.0
    },
    {
        "author": "smokeyjay",
        "body": "I own LRCX.  Most recent added more at 600.  Sold off my TSM to consolidate my stock portfolio.\n\nI think AMAT &amp; KLAC are also good buys.  ASML is a good company but richly valued imo.\n\nHonestly a sector ETF might work for most ppl.  These are long term holds and not really WSB material.  I don't know how I feel about any positive short term trends - the whole world knows about chip shortages.",
        "created_utc": 1630687459,
        "id": "hbgrybc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630716259.0
    },
    {
        "author": "dhn19",
        "body": "CRWD, NET, PYPL, LRCX, MSFT, GOOG, AAPL, and my all time favorite (which is still under the radar) - ASTS (AST SpaceMobile)",
        "created_utc": 1631222097,
        "id": "hc8axgz",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631250897.0
    },
    {
        "author": "puregoblinvomit",
        "body": "Yes! LRCX and AMAT have a huge growing business in their legacy 150nm and above semi equipment groups (what AMAT calls ICAPs) these are the chips that auto makers and tons of other companies are missing right now. The semi equipment makers will be the winners in the end as fabs and foundries are all localized around the globe!",
        "created_utc": 1631434642,
        "id": "hcjggxn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631463442.0
    },
    {
        "author": "apophisdagod",
        "body": "Can't go wrong with AMAT or LRCX they both make chip making machines along with touch screen machines etc. I work for a company that supplies both of them and we can't keep up with the orders. AMAT actually offered to buy the company to just make parts for them. So naturally I am in AMAT.",
        "created_utc": 1630690025,
        "id": "hbgy48u",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630718825.0
    },
    {
        "author": "SofaKingStonked",
        "body": "In order of expected returns;\n\nHimx - their qoq growth numbers look like some companies yoy numbers. They do various things but mostly known for display ic’s. (I want to mention micron in this same breath but momentum seems against it so I’m more aggressively pursuing himx)\n\nIndi - automotive infotainment asic semi company (also does other things but all automotive focused). Huge tier 1 backlog\n\nMrvl - my preferred 5G play\n\nAmd - I’m investing in cloud in multiple ways and see a lot of growth for Amd in server\n\nAmat - earlier in the year I would have had asml above Amat as my top semi equipment company but they’ve run really hard and fast ytd so I feel Amat is a better value with lrcx a close second.\n\nCree I like for their rf products and SiC wafer technology but my small position is not growing until they drop the led business officially.",
        "created_utc": 1631289247,
        "id": "hcbq6vg",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1631318047.0
    },
    {
        "author": "MyNamePlusaNumber",
        "body": "I loaded up on LRCX (Lam Research) during these past few weeks when it became undervalued. It used to hover around 640. I love that company and the stock.",
        "created_utc": 1630810462,
        "id": "hbn7tcd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630839262.0
    },
    {
        "author": "WaifuWarsVet69H",
        "body": "LRCX just opened thier largest plant in Maylasia which is probably going to become and integral part of thier economy since the global lockdowns have decimated thier country, and they also are opening a new factory in Oregon. I can only imagine they will continue to expand to fill demand. I also dont believe we will see a glut of semiconductors because they are becoming more a part of everyday life than ever before and are in so many of your daily used items now.",
        "created_utc": 1631465630,
        "id": "hcky4yc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631494430.0
    },
    {
        "author": "d4v1d87",
        "body": "For me: 1)TSM 2)ASML 3)INTC 4)LRCX",
        "created_utc": 1631279654,
        "id": "hcb3pck",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1631308454.0
    },
    {
        "author": "ramenbanditx",
        "body": "Held through on last earnings, dont. LRCX is on my list of companies I never play options anymore.",
        "created_utc": 1631476709,
        "id": "hclqmr2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631505509.0
    },
    {
        "author": "freakingweirdyo",
        "body": "Valuation and cheaper alternatives. ASML trades at over 60 times earnings while LRCX and AMAT are around 20 times - effectively a 60% discount. Both companies have also delivered more stable and faster earnings growth than ASML despite popular misconception.",
        "created_utc": 1631661981,
        "id": "hcvufso",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631690781.0
    },
    {
        "author": "RhinosRPlumpUnicorns",
        "body": "I guess $LRCX will not be @ 700 tomorrow, so bye bye you heavy  0917 700c bag!",
        "created_utc": 1631797441,
        "id": "hd2o4vi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631826241.0
    },
    {
        "author": "SofaKingStonked",
        "body": "Very familiar with Ichor and ultra clean and have respect for both companies. I personally went Amat and lrcx for my semi equipment plays a year ago but admittedly almost sold and rotated mid august into uctt which hindsight being 2020 I should have done lol",
        "created_utc": 1630535815,
        "id": "hb8ty1j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630564615.0
    },
    {
        "author": "WaifuWarsVet69H",
        "body": "Honestly LRCX is one of my favorite stocks to play options on, small float makes the premiums very volatile. But yeah bro holding through earnings is always a gamble especially in this market.",
        "created_utc": 1631478888,
        "id": "hclw48f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631507688.0
    },
    {
        "author": "Ok_Relationship3096",
        "body": "Buy the SMH, semis rotate depending on need and innovation. LRCX,NVDA,AMD,AMAT. There are just too many to pick one. Amat makes the tools to manufacture as so others buy the SMH and cover all your bases.",
        "created_utc": 1631292009,
        "id": "hcbx31n",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1631320809.0
    },
    {
        "author": "coopster97",
        "body": "LRCX about to break up to 640 to fill gap very soon",
        "created_utc": 1631294419,
        "id": "hcc316x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631323219.0
    },
    {
        "author": "EatsbeefRalph",
        "body": "So, if Stagflation does come, how will YOU play it? \nWe’ll still need chips, basics, food? \nChipmakers (NVDA) / Chip Manufacturing Equip ($LRCX)? \nSteel mfg ($NUE)? \nFood commodities ($ADM)? \nGold ($NEM)?\nBullets ($ASO?”)? \nCheap crap &amp; groceries ($WMT)? \n\nWhere am I wrong?  What instead?",
        "created_utc": 1631549000,
        "id": "hcpdv2b",
        "score": 0,
        "subreddit": "stocks",
        "created": 1631577800.0
    },
    {
        "author": "Apprehensive_Feed_47",
        "body": "Couldn't LAM RESEARCH \ncompete with ASML?",
        "created_utc": 1631286491,
        "id": "hcbjdz1",
        "score": -1,
        "subreddit": "StockMarket",
        "created": 1631315291.0
    },
    {
        "author": "michelco86",
        "body": "Both V and MA are great hold for 5 years or more. Valuations might be a little high right now, i'd wait (and hope) for the price to come down further. And important to know is that Square, Paypal, Apple Pay etc all go through Visa or Mastercard, so they're not really rivals",
        "created_utc": 1630760757,
        "id": "hbkbvjj",
        "score": 79,
        "subreddit": "stocks",
        "created": 1630789557.0
    },
    {
        "author": "J3ster14",
        "body": "Jack Ma just got back from the daiye spa.",
        "created_utc": 1630600032,
        "id": "hbc09zz",
        "score": 62,
        "subreddit": "stocks",
        "created": 1630628832.0
    },
    {
        "author": "bazza010101",
        "body": "the majority of these digital wallets are processing their transactions on whose platform? ding ding ding you guessed it MA or V\n\napple pay and square are both on MA platform, paypal as far as i know still uses visa platform so its lazy to think of these as competitors, revolut is on both\n\nnothing got to do with credit cards the companies are a transaction platform your answer shows how little you know\n\nso if one of the biggest companies in the world apple is using their platform do you really think they are in trouble\n\nMA said many times they dont see these companies as competitors because the amount of cash still used is far greater than electrical payments and if these other companies can bring in more to go cashless MA and V will benefit hugely\n\nthese companies you say are competitors are actually generating more $$$ for MA and V",
        "created_utc": 1630616393,
        "id": "hbd5i5g",
        "score": 61,
        "subreddit": "stocks",
        "created": 1630645193.0
    },
    {
        "author": "Mryop42",
        "body": "The market is fearing the buy now and pay later trend that bypasses credit cards. The decline was due to Amazon announcing that they will be partnering with Affirm, which spooked V and MA investors.",
        "created_utc": 1630607286,
        "id": "hbciijy",
        "score": 53,
        "subreddit": "stocks",
        "created": 1630636086.0
    },
    {
        "author": "BearBearChooey",
        "body": "Yes great long term hold. \n\nSome people don’t realize companies like PYPL/SQ still utilize V/MA as their payment networks partner. I look at FinTechs more so as partners with V/MA and not competitors. Unless one of these companies wanted to start their own payment network directly. \n\nBNPL (like Affirm) could take some of the credit card business but I wouldn’t be surprised if some companies could start letting you even make installment payments via CC instead of direct ACH. I’m sure people even use their debit cards, which are V/MA branded\n\nMy biggest concern is more regulation around payment networks and potential allowance of smaller networks to gain a piece of the pie. I read an article the other day how Australia may mandate low-cost debit card system for payments, which would allow banks to potentially utilize cheaper payment networks as opposed to V/MA (which are more expensive). I’m still not overly concerned with this yet to make me back off my stance that both V/MA are great long term holds, but something to watch. \n\nOnce international travel comes back some post COVID, V/MA will shoot up as this is their bread and butter. That segment has still not really recovered yet from COVID and will be one of the last things that does.",
        "created_utc": 1630762510,
        "id": "hbkf3t6",
        "score": 51,
        "subreddit": "stocks",
        "created": 1630791310.0
    },
    {
        "author": "Investing8675309",
        "body": "Aswath Damodaran just did a great write up of Tencent (&amp; BABA/JD/DIDI) which was posted here within the last day or two. He is known as the Dean of Valuation for a reason.\n\nhttps://www.reddit.com/r/ValueInvesting/comments/pfydc7/chinas_tech_crackdown_its_about_control_not/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf\n\nWhat you may want to dig into your analysis more is where Tencent lands with the CCP. They’ve come down hard on gaming over the last month and it isn’t a vertical the CCP is excited about in their five year strategic plan; BABA/JD/Others aren’t nearly in the same crosshairs. I own gobs of Tencent and I think Pony Ma is smart enough to navigate these choppy waters but is worth calling that out.",
        "created_utc": 1630582712,
        "id": "hbay2se",
        "score": 35,
        "subreddit": "ValueInvesting",
        "created": 1630611512.0
    },
    {
        "author": "InnocentAnthro",
        "body": "\"Yes, because that idea worked so well for the Soviet Union, Venezuela, or any other country that saw economic collapse.\"  \n\n\nThat isn't the point that they're making though. The fact is, Xi Jinping is reviving the personality cult, he's eroding the modernising reforms of the last 20 years and he's moving towards a much more state planned model of economic governance. A collapse could be an opportunity to attack the decadent capitalists and call for a return to a more \"patriotic\" form of economics. A full market rollback is unlikely, but they would happily Jack Ma a few of those major development companies.",
        "created_utc": 1630595626,
        "id": "hbbpexl",
        "score": 35,
        "subreddit": "investing",
        "created": 1630624426.0
    },
    {
        "author": "Anfini",
        "body": "CCP literally made Jack Ma disappear.",
        "created_utc": 1630967227,
        "id": "hbv15l5",
        "score": 29,
        "subreddit": "investing",
        "created": 1630996027.0
    },
    {
        "author": "bazza010101",
        "body": "your answer previously shows your lack of knowledge and the second one proves it more\n\nit has nothing to do with credit card or debit, paypal uses visa platform\n\nPayPal will join the Visa Digital Enablement Program (VDEP) to expand point-of-sale acceptance:\r  \nPayPal will join VDEP, a commercial framework for Visa partners to access Visa’s token services and other digital capabilities in the United States. This will enhance transaction security and expand acceptance for PayPal’s digital wallet to all physical retail locations where Visa contactless transactions are enabled. Consistent with VDEP, issuers will be able to choose whether to participate and retailers can expect to pay fees that are consistent with other contactless transactions they accept today.\n\n&amp;#x200B;\n\nand the fact you keep saying venmo and paypal separately says alot also, venmo is owned by paypal \n\n&amp;#x200B;\n\nevery transaction that you spoke about above is done on the mastercard or visa platform, nothing to do with credit cards, your digital cards online, your debit, credit crads and many other cards are all done on the MA or V transaction platform\n\n&amp;#x200B;\n\napple one of the biggest companies in the world use MA and V platform doesnt that not tell you something?? square who own cashapp use MA platform\n\ndo you not understand? if you use paypal or venmo you are still in part using a visa platform",
        "created_utc": 1630619037,
        "id": "hbdb4m8",
        "score": 26,
        "subreddit": "stocks",
        "created": 1630647837.0
    },
    {
        "author": "i30swimmer",
        "body": "Yeah. V and MA are pretty safe as long as we don’t go into some super cycle depression globally. Which is possible if covid continues, but unlikely. Both probably safe for 5 years. Are you going to see 20% growth every year?- no. You’ll do fine though @ around 10%",
        "created_utc": 1630755859,
        "id": "hbk48bm",
        "score": 25,
        "subreddit": "stocks",
        "created": 1630784659.0
    },
    {
        "author": "MasterKongQiu",
        "body": "Pretty much everyone who is 1) an unquestionable expert in that field and 2) doesn't have financial/corporate interests in saying otherwise agree with your take. Rodney Brooks is my favorite person to follow because he fits those two criteria. One example, he puts:\n\n&gt;Driverless taxi services operating on all streets in Cambridgeport, MA, and Greenwich Village, NY.\n\nas NET (not early than) 2035.",
        "created_utc": 1631031561,
        "id": "hby3saj",
        "score": 25,
        "subreddit": "stocks",
        "created": 1631060361.0
    },
    {
        "author": "ShadowLiberal",
        "body": "V &amp; MA are aware of those potential risks, and are attempting to get into the Fintech space in various ways, often through acquiring smaller companies.\n\nThat said the vast majority of the world's transactions are still done in cash, so there's still a ton of growth potential for credit cards, and this is why both have delivered such great growth rates for a while now.\n\nV &amp; MA are the kind of company that rarely ever dips into the \"on sale\" category, so imo you'd be better off just paying a fair price for them.",
        "created_utc": 1630766479,
        "id": "hbkn97y",
        "score": 22,
        "subreddit": "stocks",
        "created": 1630795279.0
    },
    {
        "author": "TopBuyer777",
        "body": "Congrats to longs on ClOV it took a while but we busted over 100 200 ma very bullish",
        "created_utc": 1631100560,
        "id": "hc1okdw",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1631129360.0
    },
    {
        "author": "mj_184",
        "body": "RBC offers both Visa and Mastercard\n\nhttps://www.rbcroyalbank.com/credit-cards/all-credit-cards.html#/all-cards",
        "created_utc": 1630597665,
        "id": "hbbubmq",
        "score": 16,
        "subreddit": "CanadianInvestor",
        "created": 1630626465.0
    },
    {
        "author": "Krakatoast",
        "body": "You saying you’re an ape and do spacecalls on Twitter for premarket action does not add to your credibility. So with that all out of the way… yeah, the u.s. stock market is manipulated but my understanding is that China can literally delist a company on a whim if they feel like it. The u.s. market at least *tries* to hide foul play, my understanding of China is that they don’t give a fuck, if someone steps out of line it’s head choppy time, just like what happened with Jack Ma and his Ant group ipo",
        "created_utc": 1630614904,
        "id": "hbd1s0u",
        "score": 16,
        "subreddit": "StockMarket",
        "created": 1630643704.0
    },
    {
        "author": "instagigated",
        "body": "Amex fees are probably too high. Mastercard has been the default choice of Walmart because of Visas crazy high fees.",
        "created_utc": 1630595112,
        "id": "hbbo5jn",
        "score": 14,
        "subreddit": "CanadianInvestor",
        "created": 1630623912.0
    },
    {
        "author": "wsb202009",
        "body": "will plan to add V and MA =&gt; It supposed to be added yesterday and today (yeah, me bought a lot).\n\nNext one is ADSK, dipped nicely, with good results, IMO, will recover like MA and V.\n\nNo dip, but DCA AAPL is too good.",
        "created_utc": 1630677267,
        "id": "hbg3jnh",
        "score": 14,
        "subreddit": "stocks",
        "created": 1630706067.0
    },
    {
        "author": "daylenca",
        "body": "iPhone in Canada stated [in this article](https://www.iphoneincanada.ca/news/cibc-to-takeover-costco-mastercards-in-canada/#:~:text=With%20CIBC%20taking%20over%20Costco%E2%80%99s%20Mastercard%2C%20that%20means,and%20also%20be%20used%20elsewhere%2C%20outside%20of%20Costco) that a CIBC spokesperson confirmed that their new Costco Mastercard will have Apple Pay and Google Pay support.",
        "created_utc": 1630620465,
        "id": "hbde9el",
        "score": 13,
        "subreddit": "CanadianInvestor",
        "created": 1630649265.0
    },
    {
        "author": "TheRandomnatrix",
        "body": "Does my heart good to see MA and V rebound while everything else bleeds. Got blasted for 3 weeks straight and now everyone else can feel my pain.",
        "created_utc": 1631119037,
        "id": "hc2rp7y",
        "score": 13,
        "subreddit": "stocks",
        "created": 1631147837.0
    },
    {
        "author": "_SKEMaster15",
        "body": "Baba up to 300, they found Jack Ma",
        "created_utc": 1630567150,
        "id": "hbaey3n",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1630595950.0
    },
    {
        "author": "Mssrandcole",
        "body": "Baba had to do something and this seems acceptable  for now considering it is a communist country that has managed to hold on to political power. It allows the stock to stabilize (even grow higher) and allow Jack Ma to do what he does best- make money. Hope Didi works out a deal too and then we can all go back to forgetting about this and continue to invest in Chinese stocks. Yes it cuts into profits but there are more avenues for growth. Please know this is not investment advice.",
        "created_utc": 1630592197,
        "id": "hbbh9qy",
        "score": 11,
        "subreddit": "stocks",
        "created": 1630620997.0
    },
    {
        "author": "yamayakuzaki",
        "body": "Any mastercard will work =)",
        "created_utc": 1630601974,
        "id": "hbc592s",
        "score": 11,
        "subreddit": "CanadianInvestor",
        "created": 1630630774.0
    },
    {
        "author": "dhpw2",
        "body": "Can anybody explain to me if there is a difference between \"buy now, pay later\" and interest-free installment plans when I pay with my credit card?\n\n  \nOn bigger purchases, I just choose the installment plans of 6- or 12-months with 0-interest.\n\n  \nVisa and Mastercard still gets the fees this way, don't they?",
        "created_utc": 1630636199,
        "id": "hbebsrf",
        "score": 11,
        "subreddit": "stocks",
        "created": 1630664999.0
    },
    {
        "author": "introvertedhedgehog",
        "body": "Any chance this will actually support Google pay?\n\nCapital one support Google pay but not the Costco Mastercard (as implemented).\n\nSeems like a long shot but maybe CIBC can make it work were capital one could not be bothered but I suspect Costco is the problem.",
        "created_utc": 1630606741,
        "id": "hbch55e",
        "score": 11,
        "subreddit": "CanadianInvestor",
        "created": 1630635541.0
    },
    {
        "author": "_SKEMaster15",
        "body": "JACK MA found.. he was fucking your girlfriend the whole time. Baba to $300 a share.",
        "created_utc": 1630549196,
        "id": "hb9lvxv",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1630577996.0
    },
    {
        "author": "FlaccidButLongBanana",
        "body": "*Jack Ma raises his boom box high and blasts Peter Gabriel's \"In Your Eyes\" to win back his girlfriend Xi Jinping*",
        "created_utc": 1630591920,
        "id": "hbbgmmc",
        "score": 9,
        "subreddit": "stocks",
        "created": 1630620720.0
    },
    {
        "author": "bazza010101",
        "body": "apple, square, paypal, revolut all use MA and V platforms to process their transactions \n\n&amp;#x200B;\n\ndo some research instead of posting rubbish",
        "created_utc": 1630616509,
        "id": "hbd5sgi",
        "score": 9,
        "subreddit": "stocks",
        "created": 1630645309.0
    },
    {
        "author": "xXx_420_UwU_xXx",
        "body": "UPSIDE DOWN CRISS CROSS APPLESAUCE ON THE MA CHART LOOK AT MACD AND EVIL HEDGIES GRIFFIN GUY SHOULD BE PUBLICLY \\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\* AHHH BURN DOWN THE INSTITUTIONS I MISSED THE SQUEEEZZEEEEE 20-400$ WAZ ONLY THE BEGINNING OMG BAN THE GUY WHO SAID OTHERWISE WE GONNA MUN! haus of cards DD part 69 just cummed out omg!",
        "created_utc": 1630681922,
        "id": "hbgeid7",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630710722.0
    },
    {
        "author": "Smartestgeniusever",
        "body": "Jack ma is currently in a top secret subterranean military base with golf cart batteries hooked up to his nipples and he is being forced to cum 30 times a day. Source: I am a top ranking Chinese MSS officer.",
        "created_utc": 1630964654,
        "id": "hbuvoye",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630993454.0
    },
    {
        "author": "jumbojet7",
        "body": "Jack Ma, you so fine. You so fine, you blow my mind.",
        "created_utc": 1630993544,
        "id": "hbwel9k",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1631022344.0
    },
    {
        "author": "Phx-Jay",
        "body": "In on this for options and stocks for n a couple different accounts.  Been a great month.  I agree that big daddy is heading to $100k each this fall and the mining stocks are headed with it.  I don’t have this kind of investment but if it gets me to over $25k so I don’t have to worry about day trader status that would be fantastic.  Also hold a lot of alts.  Most of mine are leaps so taking a little longer to get there.  The Ma Ra is a workhorse as well with this.",
        "created_utc": 1630702666,
        "id": "hbhr0ol",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630731466.0
    },
    {
        "author": "cromagsdemo",
        "body": "According to the Chinese calendar 2022 is the year of the Jack Ma. 🅱️🅰️🅱️🅰️🛸🪐👍",
        "created_utc": 1630966080,
        "id": "hbuyrf5",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630994880.0
    },
    {
        "author": "firststrike001",
        "body": "V &amp; MA dont have any credit risk associated with them. Banks lend money, people use this money to buy stuff. \nV &amp; MA process this transaction and pocket some change.\nPayPal, Zelle etc either not provide credit and work only with debit ( cash thay you already have in bank account). This model of payment is popular in India &amp; China l, but in US most people prefer credit cards as it offers insurance, fraud protection and many other benefits.\n\nSo if they start providing credit, they will have tons of customer debt on their balance sheet, much like a bank.\n\nSo IMHO V &amp; MA are much better plays than the rest of above mentioned Fintech ones.\n\n\n\nAs to why they are down right now, a large part of revenue comes from foreign transactions (Tourism) and that is being hit even more by covid mutants.",
        "created_utc": 1630629119,
        "id": "hbdwp6y",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630657919.0
    },
    {
        "author": "AlertConsideration95",
        "body": "I’ve been scooping up MA on these down days.  I might be over positioned now lol",
        "created_utc": 1630608903,
        "id": "hbcmlcp",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630637703.0
    },
    {
        "author": "pman6",
        "body": "MA  &gt; 15% lower than highs",
        "created_utc": 1630592147,
        "id": "hbbh5jc",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630620947.0
    },
    {
        "author": "DayMack8006",
        "body": "Congrats JACK MA WEEKLY CALL HOLDERS",
        "created_utc": 1630518148,
        "id": "hb7ogm9",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630546948.0
    },
    {
        "author": "QueefConsumer69",
        "body": "Good luck ma man, hope you get it!",
        "created_utc": 1631050534,
        "id": "hbzdsur",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1631079334.0
    },
    {
        "author": "FreeAdministration34",
        "body": "I believe $PINS will be back to $75-$80 area, which is the area before last ER, very soon. Check the graph in May-June-July, it dropped to $54.5 and go over $80. Same thing is going to happen. I also put some side dishes, $AMAT, $MA, $ROKU.\r  \n\r  \n36500 shares of $PINS with avg cost of $57.18. Let we see our ride.",
        "created_utc": 1630524619,
        "id": "hb849y1",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630553419.0
    },
    {
        "author": "realsapist",
        "body": "It's a cost of doing business in a country where the government can end your business model overnight.\n\nJack Ma screwed up big time and the govt. made an example of him. The fines are bullish the same way the massive $BA fine was bullish. It means this is all behind us now.",
        "created_utc": 1630594185,
        "id": "hbblz42",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630622985.0
    },
    {
        "author": "hodkan",
        "body": "The rules were changed in 2008 to allow banks to offer both. \n\nhttp://marketingmag.ca/news/marketer-news/retailers-cry-foul-over-new-rules-for-visa-mastercard-18525",
        "created_utc": 1630598123,
        "id": "hbbvgjg",
        "score": 7,
        "subreddit": "CanadianInvestor",
        "created": 1630626923.0
    },
    {
        "author": "bazza010101",
        "body": "the only 2 stocks i own currently, both are beasts and will continue to be for the long future, international travel is a big reason but at these levels im buying also and holding and not selling for the next 5-10 years\n\nonce covid is gone and international travel is back both of these will jump alot 40-50% in a year imo, in last 4 years both 2017 and 2019 have been great years i think 2022 will be a great year for both so imo now is a great loading time\n\n&amp;#x200B;\n\n2017\n\nMA - 46%\n\nV - 46%\n\n2019\n\nMA - 58%\n\nV - 42%",
        "created_utc": 1630607543,
        "id": "hbcj5wa",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630636343.0
    },
    {
        "author": "bazza010101",
        "body": "square is partnered with mA their transactions are through MA platform\n\nMA spoke many times before about they dont see companies like SQ as a rival or competitor",
        "created_utc": 1630611721,
        "id": "hbcto8t",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630640521.0
    },
    {
        "author": "actuarythrowaway445",
        "body": "Actually most are scared pussies.  If someone 50 feet away says the word \"China\" they hide under a table.  BABA FP posts are all filled with shit like Jack Ma ded already.\n\nBut that's why it's such a good play.  Always inverse.",
        "created_utc": 1630610232,
        "id": "hbcpxpb",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1630639032.0
    },
    {
        "author": "sereneturbulence",
        "body": "I heard he is chilling with Jack Ma and Tupac",
        "created_utc": 1630956721,
        "id": "hbue1ae",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1630985521.0
    },
    {
        "author": "nordmys",
        "body": "wtf did they find jack ma or something",
        "created_utc": 1631033178,
        "id": "hby7qdk",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1631061978.0
    },
    {
        "author": "Embarrassed-End4105",
        "body": "ELON MUSK : AI is the inevitable future.  \n\n\nJACK MA : ALIBABA INTELLIGENCE is the inevitable future",
        "created_utc": 1630588269,
        "id": "hbb8g23",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1630617069.0
    },
    {
        "author": "bazza010101",
        "body": "other fintechs use their platforms \n\napple pay, square etc are all on their platforms so dont think of them as competitors as they are using MA and v platforms to do transactions",
        "created_utc": 1630607575,
        "id": "hbcj8sq",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630636375.0
    },
    {
        "author": "CampPlane",
        "body": "V.R.Y.Y.F. - Very Good Food Company (added .'s because the comment would get deleted)\n\nI was convinced that the alternative meat industry was going to skyrocket this year. Got in at $5 in early December, and cut the cord when it went below $3 in May.\n\nI told myself that the only individual stocks I'll ever buy again are MSFT, AAPL, V/MA, and other large cap stocks. I plan to reorganize my portfolio some time next year, and I'm selling everything that isn't MSFT or VOO and putting them into either more VOO or VGT for some more risk.",
        "created_utc": 1630729540,
        "id": "hbj7f4u",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630758340.0
    },
    {
        "author": "BVB_TallMorty",
        "body": "1. Jack Ma hasn't been the CEO since 2013\n2. Wow what a shit take. Your xenophobia towards Chinese people based on purely anecdotal evidence added nothing to the discussion. \n\nGood job asshat",
        "created_utc": 1630973484,
        "id": "hbvds6i",
        "score": 6,
        "subreddit": "investing",
        "created": 1631002284.0
    },
    {
        "author": "Hour_Amphibian1844",
        "body": "This is why Kredivo (APCB) is worth at least a look. Literally all the fintech giants - Square, Paypal, Visa, Mastercard, Klarna, etc. - are looking into BNPL, and they have shown that they'd often rather do acquisitions than develop the capability organically. Kredivo is very successful in Indonesia and off to a good start in Vietnam, markets that none of the Western fintechs are particularly strong in (although Afterpay was already looking at developing their SEA market).",
        "created_utc": 1631102892,
        "id": "hc1s8pi",
        "score": 6,
        "subreddit": "stocks",
        "created": 1631131692.0
    },
    {
        "author": "WontelMilliams",
        "body": "This all started with one snarky comment from Jack Ma. Incredible.",
        "created_utc": 1630589604,
        "id": "hbbbcd6",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630618404.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "As long as the US is reluctant to move away from credit cards, V/MA will be fine.",
        "created_utc": 1630725341,
        "id": "hbj0adf",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630754141.0
    },
    {
        "author": "Howard-Excaliber",
        "body": "I've found that Visa is used much more than MasterCard.  I see usage only increasing which means higher sales.",
        "created_utc": 1630770562,
        "id": "hbkw6cs",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630799362.0
    },
    {
        "author": "AnotherDegenerateFK",
        "body": "Finding Jack Ma feels the same as finding a $100 bill in your old jeans",
        "created_utc": 1630568266,
        "id": "hbaga06",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630597066.0
    },
    {
        "author": "src97",
        "body": "What the hell is up with V and MA? Downtrend since earnings which were great, but 3.5% drop on no news???",
        "created_utc": 1630596708,
        "id": "hbbs207",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630625508.0
    },
    {
        "author": "messi101930",
        "body": "Will we have to use a CIBC mastercard there?  Say I have a MBNA mastercard could I use it at Costco?  I've never been to a store that only takes a certain type of mastercard.",
        "created_utc": 1630601095,
        "id": "hbc309l",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1630629895.0
    },
    {
        "author": "Alamasy",
        "body": "MasterCard don't want to deal with business that doesn't make sure that they are not selling child pornography. Checking the authenticity of an account is something that OF have to do with people, and OF didn't want to hire but now they change their mind and will hire someone so MasterCard is happy, this is just pornhub 2.0 except pornhub was way worse and they deleted first and checked for identity later.",
        "created_utc": 1630671728,
        "id": "hbfs7vq",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630700528.0
    },
    {
        "author": "daaammmN",
        "body": "It all depends on if you overpaid or not.\n\nIntel was almost at the 80$ mark in the 2000s.\n\nSince then it has grown a lot, but still, 20 years later and it never reached its all time high.\n\nThis just proves that you can overpay for growth.\nIf you are overpaying, you might not see an increase for many years to come\n\nI haven't dug into MasterCard, but I did for Visa.\n\nIMO, Visa (and most of the market) is overpriced. The growth that Visa is projecting (mid teens) for the next 5 years is already priced in.\n\nIf the bull market continues, the stock price might increase, but it's just a matter of time before the correction arrives and reality kicks in.\n\nI want to own Visa, I like it very much. They have been buying back shares like crazy, which is awesome. It's on my watchlist. But it still has to drop a lot for me to be a buyer. I have no doubt that it will be a buy at some point in the future though.",
        "created_utc": 1630758713,
        "id": "hbk8hho",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630787513.0
    },
    {
        "author": "coolnasir139",
        "body": "Visa, MasterCard, discover financial, American Express are all excellent holds",
        "created_utc": 1630774342,
        "id": "hbl4s95",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630803142.0
    },
    {
        "author": "organizedRhyme",
        "body": "the cHaRtS for CLOV aren't terrible honestly. I checked the MA, MACD, RSI, and S/R on the 5D and it pretty much ranked Good in 1 Category and sort of Neutral in 3. I may gamble a little on it if it opens red",
        "created_utc": 1630894563,
        "id": "hbreifg",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630923363.0
    },
    {
        "author": "asianrockstar2009",
        "body": "amazon run up after 15% drop from 52 week high, mastercard doing the exact same thing 🧐 15% the sweet spot",
        "created_utc": 1631039758,
        "id": "hbynnyj",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1631068558.0
    },
    {
        "author": "brunes",
        "body": "Costco dictates their own fees, just like Walmart. They don't pay the standard Mastercard fee either.",
        "created_utc": 1630603613,
        "id": "hbc9dg6",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1630632413.0
    },
    {
        "author": "quaeratioest",
        "body": "*Jack Ma shared his location*",
        "created_utc": 1630567077,
        "id": "hbaeuz1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630595877.0
    },
    {
        "author": "dhpw2",
        "body": "**Main Portfolio:**  \nApple  \nMicrosoft  \nVisa  \nMastercard  \nFacebook  \nAlibaba  \nSquare  \nAMD  \n\n\n**Long shots/Play portfolio:**  \nPalantir  \nVirgin Galactic  \nGamestop  \nBlackberry  \nInvitae  \n\n\n**Looking to add in, in the future**  \nTaiwan Semiconductor  \nDisney  \nCostco  \nCoinbase  \nTesla  \nNvidia  \nJPMorgan  \nApplied Materials",
        "created_utc": 1630489444,
        "id": "hb62btv",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630518244.0
    },
    {
        "author": "HotStockSlinger",
        "body": "Jack Ma doesn't ejaculate when cumming, his forehead just gets bigger.",
        "created_utc": 1630964767,
        "id": "hbuvxoz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630993567.0
    },
    {
        "author": "Summebride",
        "body": "Generally not.  Visa and MasterCard don't sell to or deal with cardholders.  Their customers are vendors (store merchants) and franchisees.  The franchisees pay for the privilege of operating a visa franchise.  The franchisee (like your local savings and loan, or chase or capital one, etc) uses the visa name and network, but they own the loan.  That's the whole business.  Hometown Bank Ltd pays Visa so they can have a Hometown Visa card, and they hope that all the cardholder debt earns them profit that exceeds what they have to pay Visa.  \n\nSo in the BNPL model, the debt is structured differently.  The hope is to make money on the \"pay later\" aspect, with fees or charges or interest.  It's sort of competitive to Visa/MasterCard's way of lending.",
        "created_utc": 1630779097,
        "id": "hblfi2g",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630807897.0
    },
    {
        "author": "Last_Man_0n_Earth",
        "body": "First of emergency funds are called are not suppose to have risk associated with it that's why they are emergency funds. But if insist on protecting the money against inflation then you are looking at the wrong asset class. You should be looking at bonds which have a safer risk specifically TIPS(treasury inflation protected securities). \n\nIf you are unfamiliar with bonds here is a quick break down. Bonds pay coupon payments a percentage of the par or principle value of the bond. E.g a bond sells for 1000$ and has a coupon rate of 3%. You get 30$ every year until the maturity of the bond. They are usually semi-annual so you get paid 15 every 6 months.  Yield to maturity is the estimated yield you would get if the bond is held to maturity. At maturity you collect the face value of the bond. Say you held the bond had a maturity of 2 years then you get your 1000 back plus 60 from your coupon payments.\n\nBonds have 2 major components of risk principal and interest risk. This can get complicated but all you need to know is if interest rates go up bond price go down and vice verse.(if you want me to explain I can, just let me know) There are ma y different types of bonds and not all have the same risk.\n\nHow does TIPS solve your problem? \nWell as the name suggest TIPS moves with inflation. If inflation rises by 3%. Then the principle value increases by 3% as well as your coupon payments. If there deflation the principle value decrease as well as coupon payments. E.g from the previous example your bond will be worth 1030$ and coupon payments would be 30.9$ annually.",
        "created_utc": 1631020180,
        "id": "hbxdtyc",
        "score": 5,
        "subreddit": "stocks",
        "created": 1631048980.0
    },
    {
        "author": "New_Faces",
        "body": "$BABA jack ma is alive",
        "created_utc": 1630684391,
        "id": "hbgkhyc",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630713191.0
    },
    {
        "author": "pooiemcmooie",
        "body": "They aren’t donating. The CCP is taking the money. Jack Ma has vanished. Nothing the CCP does is for the greater good",
        "created_utc": 1630620634,
        "id": "hbdemlb",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630649434.0
    },
    {
        "author": "bazza010101",
        "body": "apologies then if i was coming off as that, youre 100% right its still possible for me to say my point without being as i was apologize\n\nwe are moving more and more to a cashless society, the pandemic has helped that alot also, i dont think it will fully ever happen we will always have cash but we are moving there so payments will grow, population is growing also, inflation also helps these 2 companies greatly\n\nalso many countries are far behind and thats what mastercard has been aiming for there is still so much room to grow when you look into Africa for example and other countries\n\nthere is always risks for every company, apple customers could stop buying apple products also this is a risk for anyone, MA and V are 2 amazing innovators so they are always stepping up and looking to new ways but yes no company is 100% risk free\n\nThe video below is just under an hour long and was back in 2014 but i think it sums up everything if you have time to watch, it and many other things i have seen and heard from MA over the years just shows me how strong this company is and when they speak about huge fintech companies being partners not rivals competing also this is a big thing for me \n\nhttps://www.youtube.com/watch?v=9-tjY-DG5-0&amp;t=6s",
        "created_utc": 1630621100,
        "id": "hbdfn1g",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630649900.0
    },
    {
        "author": "avl0",
        "body": "Seems fine its fucking ma shares",
        "created_utc": 1630620455,
        "id": "hbde8m4",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630649255.0
    },
    {
        "author": "rianemaker07",
        "body": "Jack Ma alive yet?",
        "created_utc": 1630704794,
        "id": "hbhvoic",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630733594.0
    },
    {
        "author": "bazza010101",
        "body": "the bigger apple pay, square, paypal, all these companies get the more it benefits MA and V\n\nthese companies are not thought of as competitors, MA previous CEO said it many times \n\nif paypal and V were competitors then they would not partner \n\n&amp;#x200B;\n\nConsumers will be able to instantly withdraw and move money from their PayPal and Venmo accounts to their bank account via their Visa debit cards leveraging Visa Direct—providing an experience that offers speed, security and convenience.\r  \n\r  \nEnhanced data quality:\r  \nPayPal will ensure that data provided to issuers and their cardholders for Visa-funded transactions will be consistent with the information that is received with traditional Visa card transactions. This will ensure a better consumer experience, reduce cardholder confusion, ensure proper application of rewards and reduce costly and time-consuming disputes.\r  \n\r  \nEconomic incentives:\r  \nThe agreement affords PayPal certain economic incentives, including Visa incentives for increased volume, and greater long-term Visa fee certainty.\r  \n\r  \n“Giving consumers choice in how and where they pay is essential to our goal of being a customer champion and we welcome the opportunity to work with more partners like Visa who share our vision,” said Dan Schulman, president and chief executive officer, PayPal. “This agreement opens new avenues for PayPal to collaborate with Visa, financial institutions and others in the payments ecosystem to deliver greater value, more choice and new experiences for our joint customers wherever they transact online, in app or in store.”\r  \n\r  \n“We are excited to begin a new chapter with PayPal. Our agreement provides a framework for our companies to work together collaboratively,” said Charlie Scharf, chief executive officer, Visa. “PayPal has built industry-leading capabilities that complement those of Visa and our clients, and working together, we will be able to deliver better solutions for consumers and merchants. At Visa, we are focused on growth by providing our issuer and acquirer clients—and their clients, merchants and consumers—with the best way to pay and be paid everywhere and this agreement supports this approach.”",
        "created_utc": 1630619451,
        "id": "hbdc0uv",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630648251.0
    },
    {
        "author": "telepathist11",
        "body": "I miss Jack Ma. Look how Elon kisses the CCP ass. Jack Ma was way cooler.",
        "created_utc": 1630963700,
        "id": "hbutmb6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630992500.0
    },
    {
        "author": "patrick8515",
        "body": "  Jack ma 🙏🏽",
        "created_utc": 1630576382,
        "id": "hbapeag",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630605182.0
    },
    {
        "author": "QuietZelda",
        "body": "Jack Ma seen at digital agriculture site in Pinghu Jiaxing\n\nhttps://imgur.com/a/Dl8PQD1\nSeemed it was leaked from someone's WeChat",
        "created_utc": 1630731651,
        "id": "hbjapls",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630760451.0
    },
    {
        "author": "RonDiDon",
        "body": "Excellent choice. SQ and V are probably the best two to remained balanced. SQ and PYPL are very similar and so are MA and V so those two you choose are great",
        "created_utc": 1630855067,
        "id": "hbp1cux",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630883867.0
    },
    {
        "author": "silverbugoutbag",
        "body": "seems like decent risk/reward, I've got my eye on MA",
        "created_utc": 1631045330,
        "id": "hbz18x2",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631074130.0
    },
    {
        "author": "_SKEMaster15",
        "body": "Hey BABA they found Jack Ma go up and meme fir the sky",
        "created_utc": 1630595508,
        "id": "hbbp4hm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630624308.0
    },
    {
        "author": "sniffyandscratch",
        "body": "jack ma don’t like China, China is arsss whoorrlllllllll",
        "created_utc": 1630609159,
        "id": "hbcn92u",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630637959.0
    },
    {
        "author": "Prestigious_Bison189",
        "body": "How is buying mastercard shares consider yolo? Its like buying safest investment, this is priceless~",
        "created_utc": 1630631201,
        "id": "hbe177u",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630660001.0
    },
    {
        "author": "asianrockstar2009",
        "body": "Mastercard 0% gains for the past year, it can only go up from here. 🤞",
        "created_utc": 1630601966,
        "id": "hbc58c6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630630766.0
    },
    {
        "author": "high_roller_dude",
        "body": "ma and v have been laggards compared to qqq since the dawn of covid. ma is stuck trading in the range past year and half. \n\nmany reasons for this but id imagine the biggest reason maybe ma / v were bid up too high past 5 yrs and these stocks have been consolidating. \n\nno stock goes up straight each yr. and no stock goes down straight either.",
        "created_utc": 1630613393,
        "id": "hbcxxfo",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630642193.0
    },
    {
        "author": "CountTheForDown",
        "body": "They actually have to ramp up the spending as the sp500 goes higher in order to maintain the climb and avoid a declining MA sell off. sp500 has had a 10%+ 200MA for a few months now.",
        "created_utc": 1630538293,
        "id": "hb8yxt0",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1630567093.0
    },
    {
        "author": "Trump_Ate_My_Ass",
        "body": "Lmao some discord group signaled MA calls yesterday. Everyone is down +50% hahahaha",
        "created_utc": 1630596764,
        "id": "hbbs6sr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630625564.0
    },
    {
        "author": "Telkorenar",
        "body": "Anyone buying the dip on V or MA?  i own a few fintech plays (which i assume are responsible for said dip), but I can't imagine titans like the aforementioned will stay down for too long.",
        "created_utc": 1630600556,
        "id": "hbc1mir",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630629356.0
    },
    {
        "author": "Shield4life",
        "body": "CIBC used to also offer an Aventura Mastercard and a Petro Points Mastercard. Once those we're discontinued they've stayed with Visa. I guess they are making a comeback in Mastercard.",
        "created_utc": 1630604486,
        "id": "hbcbkdu",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1630633286.0
    },
    {
        "author": "SirYoda9871",
        "body": "Why is MasterCard MA selling off so badly this month?",
        "created_utc": 1630679734,
        "id": "hbg99zv",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630708534.0
    },
    {
        "author": "joggernutt",
        "body": "I actually have all of the 4 tickers mentioned by OP for long term investments. Top 2 traditional form of payment V &amp; MA. Top 2 next generation form of payment SQ &amp; PYPL.",
        "created_utc": 1630859001,
        "id": "hbpa9hd",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630887801.0
    },
    {
        "author": "ricke813",
        "body": "Just going to copy &amp; paste my comment from another V post that also applies to MA:\n\nI was a former V investor, made a solid return, and regretted it because there were more innovative fintechs I could have invested in like OP mentioned.\n\nDefinitely agree the TAM is huge because by definition it's all the money in the world, but I'm sure there are other stocks that can give you better stock price appreciation taking advantage of the short-term trends.\n\nAlso something not a lot of retail &amp; Wall Street investors talk about is how V and also MA's business model is overindexed on travel relative to other fintechs since those transactions are higher yielding &amp; margin given the FX. My #1 reason for selling was because I see personal traveling slowly returning while business traveling is impaired for the long-term after lessons from the pandemic with Zoom. V claims they rely more on personal travel, but never quantified it and it was just a red flag for me.\n\nOverall solid stock, but there are better opportunities out there.",
        "created_utc": 1630773447,
        "id": "hbl2qtp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630802247.0
    },
    {
        "author": "Scion_capital_intern",
        "body": "Jack ma is still 100 stories underground in a black site facility. All we see now is his cyborg or hologram. \n\nElon doesn't want that.",
        "created_utc": 1630963892,
        "id": "hbuu17f",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630992692.0
    },
    {
        "author": "GeorgeWashingtonTFP",
        "body": "Next stop is spy 20 day MA at 447.27",
        "created_utc": 1631023928,
        "id": "hbxln0i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631052728.0
    },
    {
        "author": "think50",
        "body": "I think the market cools off here. We're about 2% above the 20 Day MA.  Don't bet against the market as a whole, but I wouldn't be massively long here, either.\n\nI say pick a stock that's been ranging for a while (TSM) and buy some ITM (or close) puts with an expiry about 6-8 weeks out. Take some quick profits, then go back to cash and wait for QQQ and SPY prices to be a bit more appetizing for calls.",
        "created_utc": 1631122497,
        "id": "hc304xz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631151297.0
    },
    {
        "author": "Didntlikedefaultname",
        "body": "Appreciate this and I fully agree with your point. Society is moving at least towards being mostly cashless. Deeply entrenched company’s like visa and MasterCard have a huge leg up on any competitor and are in a position to either build or acquire capabilities they’re missing. I would not bet against either, just wanted to offer a bear case based on a perspective I have seen, which is more reluctance to accept card payments when other digital payment alternatives are offered. But you make a great counter pointing out that visa and MasterCard are more than the credit cards but the processing networks beneath them which can always be repurposed and built upon",
        "created_utc": 1630622618,
        "id": "hbdiz7m",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630651418.0
    },
    {
        "author": "fredczar",
        "body": "V or MA? Can’t decide",
        "created_utc": 1630676818,
        "id": "hbg2j1p",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630705618.0
    },
    {
        "author": "yachtykek",
        "body": "or risk getting sent to the underground Gulag, aka with Jack Ma and Alibaba",
        "created_utc": 1630647717,
        "id": "hbewk52",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630676517.0
    },
    {
        "author": "FalconsBlewA283Lead",
        "body": "Thinking the 222-223 range. Not really a TA guy but the 200 day MA is right around there",
        "created_utc": 1630591950,
        "id": "hbbgp70",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630620750.0
    },
    {
        "author": "NPRjunkieDC",
        "body": "I don't follow V or MA but alternative forms of payment maybe ? Amazon this week partnered with Affirm that allows buy now pay later",
        "created_utc": 1630595124,
        "id": "hbbo6ni",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630623924.0
    },
    {
        "author": "quaeratioest",
        "body": "Jack Ma gonna do a sequel to his tai chi movie",
        "created_utc": 1630568702,
        "id": "hbagsfh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630597502.0
    },
    {
        "author": "quaeratioest",
        "body": "jack ma is fine lol\n\nHe said some disrespectful stuff to the party a while back so he learned his lesson. He's been appearing at events from time to time. But he pretty much retired a couple years ago, so he is not involved with day-to-day operations of Alibaba.",
        "created_utc": 1630568429,
        "id": "hbaggwz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630597229.0
    },
    {
        "author": "rocketman_321",
        "body": "I'm sorry... avoid FDs? \n\nYou mean me only purchasing FDs is why my account has devalued 99%?\n\nNot sure I follow, excuse me while I go buy some more 9/10 MU 95c",
        "created_utc": 1630520190,
        "id": "hb7tgpc",
        "score": 720,
        "subreddit": "wallstreetbets",
        "created": 1630548990.0
    },
    {
        "author": "EMartzJr",
        "body": "This mu-mu-mu-muhhh-mu-mu-muhh make me ha-aaaapy!",
        "created_utc": 1630898247,
        "id": "hbrlq5k",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1630927047.0
    },
    {
        "author": "duox7142",
        "body": "Good old MU with it's great fundamentals and tanks every day 👀",
        "created_utc": 1630523974,
        "id": "hb82o7y",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1630552774.0
    },
    {
        "author": "Skipperdees_ears",
        "body": "Completely agree with you. Just because it’s worse, doesn’t guarantee it wins out as the dominant strain.  Delta will be tough to supplant as the dominant strain in the population. \n\nThat being said, if a Mu like strain does become dominant with breakthrough capability….watch out.",
        "created_utc": 1630755398,
        "id": "hbk3lbw",
        "score": 18,
        "subreddit": "investing",
        "created": 1630784198.0
    },
    {
        "author": "Dave_7879",
        "body": "~~new covid variant called Mu~~ \n\npriced in.",
        "created_utc": 1630538516,
        "id": "hb8zdul",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630567316.0
    },
    {
        "author": "UpSideofDown",
        "body": "Stop trying to make tapering happen, it's not going to happen (anytime soon).  Delta variant and now Mu variant are gearing up, Govt. is scrambling to provide free booster shots.  This money printer is staying online, at least for the foreseeable future.\n\nNext stop: Universal Basic Income...",
        "created_utc": 1630636941,
        "id": "hbedctp",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630665741.0
    },
    {
        "author": "OlyBomaye",
        "body": "mu variant.\n\nlooks like next vaccine will have micron memory chips",
        "created_utc": 1630610688,
        "id": "hbcr2vh",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630639488.0
    },
    {
        "author": "diabeetis",
        "body": "So if the mu variant is really bad, stocks will go...up? Are we still doing that?",
        "created_utc": 1630532835,
        "id": "hb8nr2e",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630561635.0
    },
    {
        "author": "needadvice881",
        "body": "Delta variant, MU variant, next will be the SMD COVID variant",
        "created_utc": 1630615391,
        "id": "hbd2zuo",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630644191.0
    },
    {
        "author": "furrypurpledinosaur",
        "body": "New covid variant Mu announced by WHO. Potentially even more dangerous than delta. So I assume stocks will go up because that seems to be the reaction to all bad news.",
        "created_utc": 1630511785,
        "id": "hb78tl5",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630540585.0
    },
    {
        "author": "Spydude84",
        "body": "Man I'm tits deep in MU too. Why won't it go uppppp",
        "created_utc": 1630531087,
        "id": "hb8jxlq",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630559887.0
    },
    {
        "author": "Bexanderthebex",
        "body": "MU variant is out boys calls on $MU",
        "created_utc": 1630548234,
        "id": "hb9jxb7",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630577034.0
    },
    {
        "author": "t33po",
        "body": "MU 90c",
        "created_utc": 1630558156,
        "id": "hba2hza",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1630586956.0
    },
    {
        "author": "DayMack8006",
        "body": "New COVID variant is called MU....buying puts on MU",
        "created_utc": 1630515343,
        "id": "hb7hlt8",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1630544143.0
    },
    {
        "author": "cyrilsuave",
        "body": "\"Mu\" variant.. SPY to 600!!!!!",
        "created_utc": 1630628152,
        "id": "hbdundf",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1630656952.0
    },
    {
        "author": "dizzy_centrifuge",
        "body": "Mu isn't so bad it's mu-2 that's gonna be dangerous",
        "created_utc": 1631023281,
        "id": "hbxk7qk",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1631052081.0
    },
    {
        "author": "golden_bear_2016",
        "body": "Since COVID == bullish and the Mu variant is confirmed, does that mean we're getting to 5000 this year?",
        "created_utc": 1630558008,
        "id": "hba29ah",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630586808.0
    },
    {
        "author": "The_Collector4",
        "body": "is the Mu Variant a sign to load up on Micron calls?",
        "created_utc": 1630991870,
        "id": "hbwc545",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1631020670.0
    },
    {
        "author": "the_beast93112",
        "body": "Two stocks I'll never buy again $CRSR and $MU",
        "created_utc": 1630531850,
        "id": "hb8lmub",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630560650.0
    },
    {
        "author": "ninkorn",
        "body": "First, they named it $DAL variant. Now there is $MU variant.\n\nI think 🌈🐻s are naming these COVID variants after companies they want to short",
        "created_utc": 1630934238,
        "id": "hbszx0v",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630963038.0
    },
    {
        "author": "ItsyBitsySPYderman",
        "body": "First time I seen MU mentioned here in ages.",
        "created_utc": 1630515401,
        "id": "hb7hqyn",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630544201.0
    },
    {
        "author": "bearhunter429",
        "body": "Now they are talking about the Mu variant of the virus. What's next, AMD variant? LOL",
        "created_utc": 1630621348,
        "id": "hbdg732",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630650148.0
    },
    {
        "author": "tranvers",
        "body": "Mu guest is after Opex (17 Sep). If we hold 25$, MM have to hedge a ton of ITM calls T+2.",
        "created_utc": 1630676829,
        "id": "hbg2jy5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630705629.0
    },
    {
        "author": "satmadan",
        "body": "Covid went from Delta straight to Mu? What happened to Epsilon, Gamma, Kappa and Lambda? I guess the CDC can't even get the Greek Alphabet right",
        "created_utc": 1630867859,
        "id": "hbpu7sh",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630896659.0
    },
    {
        "author": "DayMack8006",
        "body": "MU is a piece of shit as well",
        "created_utc": 1631025744,
        "id": "hbxpr0k",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631054544.0
    },
    {
        "author": "Slaxle",
        "body": "My portfolio:\nFunds:\nFSKAX - 33.43% (TOTAL MARKET)\nFSELX - 12.07 (SEMICONDUCTOR)\nFBGRX - 7.02% (BLUE CHIP)\n\nPAYPAL - 18.15%\nSOFI - 10.02%\nAMD - 3.49%\nMU - 6.96%\nFree cash - 8.85%\n\nI want to get some hidings in NVIDIA, TSM, and ASML to round off my semiconductors. Get some SQ to polish off my Fintech. Just looking for good prices.\n\nNew investments I'm looking at for fall 2021 - Industrials (xli) online retail (Amazon and IBUY)",
        "created_utc": 1630516106,
        "id": "hb7jgjh",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630544906.0
    },
    {
        "author": "wrb3",
        "body": "Dang, the new covid variant is called mu? Might be regretting buying micron this week…😐",
        "created_utc": 1630518251,
        "id": "hb7optt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630547051.0
    },
    {
        "author": "sereneturbulence",
        "body": "Abolish MU stock",
        "created_utc": 1631041613,
        "id": "hbys4m8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631070413.0
    },
    {
        "author": "diabeetusboy",
        "body": "Today: bought SPY 9/8 453c at 0.30\nTomorrow: buying SPY 9/8 452p + 9/10 453c, red or green at open will determine the order in which I buy, will adjust intraday as needed (will chase losses if I’m fuk)\n\nEyeing OTM put debit spread 440/450 for EOM.\n\nDumping every cent remaining into MU 10/8 79c",
        "created_utc": 1631047596,
        "id": "hbz6s3n",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631076396.0
    },
    {
        "author": "AlphaOmega1337",
        "body": "New variant called \"Mu\"? Yea your Mum is the new variant what the fuck is mu",
        "created_utc": 1630575402,
        "id": "hbao9mh",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630604202.0
    },
    {
        "author": "origami_asshole",
        "body": "MU is apparently a new covid variant capable of evading vaccines. Will this save my MU 9/17 $105 calls. I bought 700 of them for .26 a contract 🤦‍♂️",
        "created_utc": 1630529237,
        "id": "hb8fp89",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630558037.0
    },
    {
        "author": "Sinnex88",
        "body": "Where my MU 90 bros at?",
        "created_utc": 1630619268,
        "id": "hbdbmej",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630648068.0
    },
    {
        "author": "AcademicParticular69",
        "body": "bout to start some good mu memes... youll see em on facebook by thanksgiving.",
        "created_utc": 1630558281,
        "id": "hba2p90",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630587081.0
    },
    {
        "author": "vegasoptions666",
        "body": "The other part of the October lineup is Delta, Epsilon, Lambda, and Mu.... along with government mandates designed to destroy businesses.",
        "created_utc": 1630547098,
        "id": "hb9hjjj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630575898.0
    },
    {
        "author": "csklmf",
        "body": "MU Variant is AMD",
        "created_utc": 1630532926,
        "id": "hb8ny1t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630561726.0
    },
    {
        "author": "yeti_man82",
        "body": "Check out MU, QCOM, and MRVL as well, or just dump money in an ETF like SMH. The whole sector is bullish right now.",
        "created_utc": 1630678079,
        "id": "hbg5etj",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630706879.0
    },
    {
        "author": "four1six_",
        "body": "Hahaha I think when MU was being hyped by wsb back in the day made me never want to play it! I liked both AMD and NVDA though. AMD maybe some LEAPs would be an idea.\n\nEnjoying a cider, just did a giant shop and filled out the fridge. Feeling good bud. How's about you?",
        "created_utc": 1630799526,
        "id": "hbmmxhy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630828326.0
    },
    {
        "author": "sperrjo",
        "body": "NVDA is so high up tho, MU could be a good buy, SNAP still up, ETSY still up. I want something that’s dipped",
        "created_utc": 1630629171,
        "id": "hbdwszp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630657971.0
    },
    {
        "author": "remdesivir2020",
        "body": "Let’s welcome variant MU , the catalyst for Sep21 market correction\n\nProudly brought to u by a bear",
        "created_utc": 1630482371,
        "id": "hb5uezg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630511171.0
    },
    {
        "author": "cejay422",
        "body": "I see MU saying “fuck your calls” early in premarket this morning. Should be a great fucking day",
        "created_utc": 1630581958,
        "id": "hbawuy0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630610758.0
    },
    {
        "author": "okfreedom",
        "body": "Started with 110 or so stocks and have whittled it down to about 64... I want to consolidate further. Anything in here that is past it's prime that I should allocate toward growth?  \n\n\n* PLTR\tPalantir\t3.85%\n* PHO\tInvesco Water Resources ETF\t3.82%\n* AXON\tAxon Enterprises\t3.72%\n* LIT\t        Global X Lithium &amp; Battery Tech ETF\t3.65%\n* PYPL\tPayPal\t3.33%\n* NKE\t        Nike\t2.75%\n* NVAX\tNovavax\t2.74%\n* FB\t        Facebook\t2.50%\n* GOOG\tGoogle\t2.47%\n* AMD\tAMD\t2.42%\n* ABNB\tAirBNB\t2.39%\n* DKNG\tDraft Kings\t2.37%\n* CMCSA\tComcast\t2.26%\n* U\t        Unity\t2.14%\n* AMZN\tAmazon\t2.09%\n* UPST\tUpstart\t2.04%\n* SOFI\tSoFi\t1.88%\n* TDOC\tTelaDoc Health\t1.88%\n* AAPL\tApple\t1.87%\n* BOTZ\tGlobal X Robotics &amp; Artificial Intelligence ETF\t1.83%\n* GRID\tFirst Trust NASDAQ Clean Edge Smart Grid Infra Idx ETF\t1.77%\n* SQ\t        Square\t1.76%\n* PAVE\tGlobal X US Infrastructure Development ETF\t1.73%\n* CHWY\tChewy\t1.69%\n* CMG\tChipotle\t1.62%\n* DIS\t        Disney\t1.57%\n* MSFT\tMicrosoft\t1.53%\n* SNOW\tSnowflake\t1.50%\n* WMT\tWal-Mart\t1.48%\n* LPSN\tLivePerson\t1.40%\n* LULU\tLululemon Athletica\t1.39%\n* ESTC\tElastic NV\t1.35%\n* ZIP\t        ZipRecruiter\t1.35%\n* KO\t        Coca-Cola\t1.34%\n* APPS\tDigital Turbine\t1.31%\n* ADBE\tAdobe\t1.30%\n* COST\tCostco\t1.30%\n* MTTR\tMatterport\t1.27%\n* MU\t        Micron Technology\t1.20%\n* SHAK\tShake Shack\t1.19%\n* LOW\tLowes\t1.19%\n* CRM\tSalesforce\t1.15%\n* VIAC\tViacomCBS\t1.14%\n* TGT\t        Target\t1.09%\n* TSLA\tTesla\t1.02%\n* ETSY\tEtsy\t1.01%\n* ZM\t        ZOOM\t0.99%\n* CRWD\tCrowdStrike\t0.96%\n* NVDA\tNVidia\t0.92%\n* SFTW\tBlack Sky\t0.89%\n* CRSP\tCrispr\t0.83%\n* SBUX\tStarbucks\t0.82%\n* QRVO\tQorovo\t0.81%\n* SPOT\tSpotify\t0.76%\n* CPNG\tCoupang\t0.72%\n* SRNG\tGinko Bioworks\t0.71%\n* SHOP\tShopify\t0.66%\n* TTD\t        The Trade Desk\t0.62%\n* KURI\tBabylon Health\t0.53%\n* VOSO\tWejo\t0.53%\n* NFLX\tNetflix\t0.50%\n* PATH\tUiPath\t0.39%\n* MA\t        Mastercard\t0.35%\n* V\t        Visa\t0.35%",
        "created_utc": 1630985521,
        "id": "hbw1ne8",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631014321.0
    },
    {
        "author": "Muted_Idea",
        "body": "Mu variant lmao",
        "created_utc": 1630532791,
        "id": "hb8nnor",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630561591.0
    },
    {
        "author": "temporallock",
        "body": "WHO skips over Lambda and now talking Mu variant. Just waiting for the kids in other states to go back to school, started 2 weeks ago here and half the kids are out already",
        "created_utc": 1630532906,
        "id": "hb8nwhw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630561706.0
    },
    {
        "author": "gainsusmaximus",
        "body": "Is MU COVID variant worse then delta",
        "created_utc": 1630974925,
        "id": "hbvgo7j",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631003725.0
    },
    {
        "author": "therealcosmicl",
        "body": "If the mu strand of covid is anything like the stock im going to lose all my money fucking with it",
        "created_utc": 1630812402,
        "id": "hbnb9qw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630841202.0
    },
    {
        "author": "WsbModCanSMD",
        "body": "Delta variant was bullish for stocks. Let’s see if MU is also 🐂",
        "created_utc": 1630702808,
        "id": "hbhrby0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630731608.0
    },
    {
        "author": "the_beast93112",
        "body": "I dumped $MU like 2 weeks ago. Not looking back",
        "created_utc": 1630532345,
        "id": "hb8mpja",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630561145.0
    },
    {
        "author": "captain_uranus",
        "body": "|Company|Ticker|% of Portfolio|\n:--|:--|:--|\n|Amazon|AMZN|7.34%|\n|ASML|ASML|7.00%|\n|DigitalOcean|DOCN|6.35%|\n|Paysafe|PSFE|5.95%|\n|Upstart|UPST|5.29%|\n|AMD|AMD|4.87%|\n|Cloudflare|NET|4.56%|\n|Square|SQ|4.50%|\n|Taiwan Semiconductor|TSM|4.50%|\n|Amkor Technology|AMKR|4.27%|\n|Apple|AAPL|4.18%|\n|Sofi|SOFI|4.17%|\n|MP Materials|MP|4.02%|\n|Palantir|PLTR|3.82%|\n|DraftKings|DKNG|3.61%|\n|Shopify|SHOP|3.20%|\n|Google|GOOG|3.06%|\n|Micron|MU|2.79%|\n|Chewy|CHWY|2.78%|\n|Thermo Fischer|TMO|2.33%|\n|Etsy|ETSY|2.27%|\n|Applied Materials|AMAT|1.99%|\n|AST Space Mobile|ASTS|1.53%|\n|Various Warrants|PSFE/WS, ALIT/WS, APPHW|1.41%|\n|Pinterest|PINS|1.40%|\n|Beam Therapeutics|BEAM|1.16%|\n|Nvidia|NVDA|0.86%|\n|Abbott|ABBT|0.78%|\n\nWould be curious to get some thoughts on my holdings.  \n\n\nJust going through it and typing everything out I never realized I'm up to 27 holdings nowadays, basically got an ETF on my hands. But on the other hand they're all spread out amongst 4 accounts (Brokerage, PCRA/Roth 401k, HSA Brokerage, and Roth IRA).  \n\n\nWould probably like to shed PINS and MU but will wait till maybe year end to re-evaluate. So far the only tickers I'm down on is my future growth stuff like SOFI, PSFE, MP (marginally), but I've got a 5+ year time horizon on these ones, and then PINS and MU round out the losers.",
        "created_utc": 1630502369,
        "id": "hb6mrcy",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630531169.0
    },
    {
        "author": "Reagor_Bombs",
        "body": "I can’t believe MU 90 actually hit",
        "created_utc": 1630619757,
        "id": "hbdcoxy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630648557.0
    },
    {
        "author": "AcademicParticular69",
        "body": "tell em to get fricked. tell em u might have mu.",
        "created_utc": 1630559085,
        "id": "hba3z9y",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630587885.0
    },
    {
        "author": "WatchandThings",
        "body": "Not medically educated, but from what I have been hearing the mRNA can be repurposed for different situation pretty quickly. I'd imagine we'll have a vaccine for the mu variant faster than we had for the first vaccine now that we got the mRNA method working. The slow down would probably with the FDA approval, but testing multiple steps simultaneously is now tried, so I'd imagine that would go faster as well.\r  \nI think they had that delta specific vaccine ready to be tested pretty quickly(though it wasn't even necessary), so I'd imagine we'll have something pretty quick for mu if it turns out to be a serious threat.",
        "created_utc": 1630591922,
        "id": "hbbgmri",
        "score": 2,
        "subreddit": "investing",
        "created": 1630620722.0
    },
    {
        "author": "ElvanKing",
        "body": "Miss the PTON 35C and MU 90C days",
        "created_utc": 1630575623,
        "id": "hbaoike",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630604423.0
    },
    {
        "author": "mishka__",
        "body": "MU strain is terminal. The only known cure is buying 1 share per day for the rest of your life",
        "created_utc": 1630548366,
        "id": "hb9k78f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630577166.0
    },
    {
        "author": "yeti_man82",
        "body": "Thinking about swing trading $MU, just 'cause I'm a grown-up and do what I want.",
        "created_utc": 1630541667,
        "id": "hb95k0n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630570467.0
    },
    {
        "author": "BicycleBusiness",
        "body": "I like C7 I buy MU",
        "created_utc": 1630680201,
        "id": "hbgadmq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630709001.0
    },
    {
        "author": "sereneturbulence",
        "body": "I read something about MU variant.. which would make sense because it is also the name of the worst stock in the market",
        "created_utc": 1630707416,
        "id": "hbi18ru",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630736216.0
    },
    {
        "author": "gainbabygain",
        "body": "I'm thinking this mu variant is not good for my MU $90C.",
        "created_utc": 1630690954,
        "id": "hbh0c2l",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630719754.0
    },
    {
        "author": "ImAMaaanlet",
        "body": "Hol mu dick",
        "created_utc": 1630902103,
        "id": "hbrsrw7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630930903.0
    },
    {
        "author": "Slarrrrrrrty",
        "body": "😂😂😂\nMu shu pork is made of people!!??",
        "created_utc": 1630614632,
        "id": "hbd12xx",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1630643432.0
    },
    {
        "author": "toydan",
        "body": "Oh nice. NVDA has been bueno. \n\nI was going back and forth MU and AMD and went heavy MU. Oh well. Have 1 AMD $75 LEAP\n\ngood lazy weekend?",
        "created_utc": 1630799182,
        "id": "hbmm9n1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630827982.0
    },
    {
        "author": "DayMack8006",
        "body": "Trying to determine which is a bigger piece of shit stock.....MU or BA?",
        "created_utc": 1631025791,
        "id": "hbxpuy5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631054591.0
    },
    {
        "author": "surmoiFire",
        "body": "u know MU is the ticker of Micron right? this is a sign 🤔",
        "created_utc": 1630998644,
        "id": "hbwldeb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631027444.0
    },
    {
        "author": "ORS823",
        "body": "You went to prison for insider trading because you are the CEO of SPY? All I saw was MU, so that means $90 calls in $MU right?",
        "created_utc": 1630947204,
        "id": "hbts8uu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630976004.0
    },
    {
        "author": "PrincPaco",
        "body": "Thinking of going TSM and MU calls into October.",
        "created_utc": 1630933924,
        "id": "hbszc4h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630962724.0
    },
    {
        "author": "sblct",
        "body": "Can’t find anything about it, just a mu variant",
        "created_utc": 1630982458,
        "id": "hbvvw13",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631011258.0
    },
    {
        "author": "MeisterTea",
        "body": "Fair enough, though don't overlook the fact that TI is massively expanding their domestic production capacity across the board (look up phase II of RFAB and the Micron fab purchase). So they stand to grow even more if the upward cycle of the semiconductor industry continues. \n\nAnd nah that's just a formatting thing, using the sidewards chevron to do the  \"&gt;implying\" thing.",
        "created_utc": 1631035004,
        "id": "hbyc6o5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631063804.0
    },
    {
        "author": "ASUS_USUS_WEALLSUS",
        "body": "Why MU dip??",
        "created_utc": 1631023862,
        "id": "hbxlhs4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631052662.0
    },
    {
        "author": "vics80",
        "body": "MU for earnings run to 9/28?",
        "created_utc": 1630690175,
        "id": "hbgyh8b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630718975.0
    },
    {
        "author": "aqjingson",
        "body": "Micron sponsored this latest virus for the ungodly marketing for the next couple weeks😂",
        "created_utc": 1630621533,
        "id": "hbdglqz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630650333.0
    },
    {
        "author": "I_know_nothing_42",
        "body": "MU's earnings are in 24 days. \n\nExpect vol to increase, place the trade then. If bearish sell the call spreads. It already took a hit in early august for supply issues. Selling the call spread is a little bit easier to predict what you'll make. If you buy a put spread, the vol collapse and the spread having to go fully ITM to realize a full gain has more variables at work. You can buy the put spread and still lose even with having the direction right.\n\nWorking myself out of a put that is ITM right now.\n\nI'm looking to get out next week and waiting until earnings to put new positions on.  \n\nI wouldn't be betting against MU just because spot prices are falling. That means supply chains are working their way out and that they will be producing at capacity vs charging a little bit more per diminished output. They can actually make more money overall at lower prices. This will be a quicker price recovery than the 2011 Fukushima earthquake. Demand is not going away.",
        "created_utc": 1630705987,
        "id": "hbhy87f",
        "score": 2,
        "subreddit": "options",
        "created": 1630734787.0
    },
    {
        "author": "temporallock",
        "body": "With the Northeast kids going back to school next week and everyone jolly for Labor Day I’ll be looking for COVID kid numbers to rise. Just wait until CNBC starts spewing about the Mu variant more.\n\nGranted most of my options positions are farther dated",
        "created_utc": 1630697526,
        "id": "hbhfh0h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630726326.0
    },
    {
        "author": "toydan",
        "body": "Well i didnt even think i would trade much of anything today.  Changed my mind, as i have to leverage more into this bull run\n\n* Closed out of put debit spread on LCID for a small gain.  Not my nature, but glad i executed the strategy. if drops again i will sell CSPs on margin w it\n* bought $MU to get to 100 sh.  It is now a boomer play for me w dividend announcement.  Will sell CCs once it hits $85.\n* Bought ABNB 1/23 LEAPS @ $49.50.  Trying to keep more options in retirement accounts v nonQ for tax reasons.  sold some TCNNF and a tiny bit of SOFI to make work.  was eating at me not be in this one\n* AMZN 3670/3665 9/10 put credit spreads  Falling in love w this strategy.  i like weeklies and this is a 7% return 250%ish annualized.  .12 delta (88% chance of success).  I use 2-3 standard deviations on 3 month Bollinger for entry points.  Theta on this is a juicy 1.30. I will let you know the first time i ever have one of these not work. Going to play these on NVDA too i decided.\n* $AAL 9/10 $19.50 CSP on margin $.33.  I have played zero airlines, hotels, cruise lines for 18 months. Think this a good play assigned or not.  CSPs have been printing like a MoFo \n\nThat is all.  Hope your day is great and your runway long!",
        "created_utc": 1630604864,
        "id": "hbccikx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630633664.0
    },
    {
        "author": "im_also_a_member",
        "body": "Been investing since March.\n\nIndividual:\n\nSymbol      Total Gain    % of account\n\nBark           23.44%         37.59%\n\nLKQ             .89%             16.58%\n\nRoot            N/A               16.50%\n\nLCID            -14.58%         8.22%\n\nFCUUF         19.75%          3.69%\n\n&amp;#x200B;\n\nRollover IRA\n\nSymbol       % gain        % of account\n\nGOOG         7%               13.07%\n\nFNILX          18.92%        12.96%\n\nFBGRX         19.84%        12.87% \n\nAAPL            20.43%        12.44%\n\nNVDA           44.94%         8.78%\n\nSOFI             .29%              7.2%\n\nSQ                 20.19%         5.86%\n\nLCID             -8.9%            4.76%\n\nAMD              25.39%        4.22%\n\nMSFT             4.28%          3.71%\n\nPLTR               -.6%             3.25%\n\nSPCE               -1.24%        2.86%\n\nTDOC             4.9%            2.57%\n\nMU                  2.59%         2.27%\n\nF                        .33%           1.64%\n\nBABA              -.24%           1.26%\n\nTXRH               3.2%            .10%\n\n  \nROTH\n\nSymbol            %Gain         %of account\n\nLMT                  -6.09%         50.45%\n\nZG                     -9.66%          44.55%\n\nEXEL                   5.51%          4.96%",
        "created_utc": 1630635227,
        "id": "hbe9rbf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630664027.0
    },
    {
        "author": "PanickyLemur",
        "body": "Fuck Mu. \n\nMu? Fuck me…",
        "created_utc": 1630586458,
        "id": "hbb4t3q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630615258.0
    },
    {
        "author": "daytrader987654321",
        "body": "Anyone remembers MU 100 calls memes, and Su Bae?",
        "created_utc": 1630603543,
        "id": "hbc970s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630632343.0
    },
    {
        "author": "upsidevalue",
        "body": "…the market looks like it wants a -2% day with the mu variant",
        "created_utc": 1630773640,
        "id": "hbl36pg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630802440.0
    },
    {
        "author": "Zach9559",
        "body": "MU. It’s the epitome of a value stock - right now it’s trading at a forward PE of 6.5! As of Friday, it closed at $73.81. The average analyst price target? $115. That’s a 55% upside - earnings are expected to double next year. Also, Li Lu and Mohnish Pabrai have 50% of their clients assets in it - nearly $1B for Li Lu. Every other value investor you can think of has a meaningful stake in it; David Tepper, Guy Spier, Seth Klarman, Stan Druckenmiller, the list goes on. At this price it’s a steal, and once investors get the bad taste of 2018 out of their mouth, it will take off like a rocket.",
        "created_utc": 1630846829,
        "id": "hbokh15",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630875629.0
    },
    {
        "author": "ImAMaaanlet",
        "body": "Mu what",
        "created_utc": 1630901014,
        "id": "hbrqw86",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630929814.0
    },
    {
        "author": "TheseYoung6546",
        "body": "Micron",
        "created_utc": 1630965381,
        "id": "hbux9hj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630994181.0
    },
    {
        "author": "nnaoeznnaoezhis",
        "body": "How do i buy calls on the new mu variant",
        "created_utc": 1630998227,
        "id": "hbwkv61",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631027027.0
    },
    {
        "author": "mydawgchem",
        "body": "Now do Mu please",
        "created_utc": 1631022668,
        "id": "hbxivro",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631051468.0
    },
    {
        "author": "AdministrationOk5905",
        "body": "expiration of 9/3  too D:\n\n&amp;#x200B;\n\nmy apple puts was up 70%!!! 800!!\n\nMu was up 25% 100 bucks\n\nTesla, was down 30% 250 or so.\n\n&amp;#x200B;\n\nbut of course, apple went up, Tesla went down, and mu eh whatever; I am scared tomorrow that I am losing it all, not really scared, but Tesla being 9/3 sucks, the rest are 9/10",
        "created_utc": 1630543010,
        "id": "hb98mob",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630571810.0
    },
    {
        "author": "AcademicParticular69",
        "body": "no more like. mu variant? what, is joe rogan eating the COW DEWORMER NOW?",
        "created_utc": 1630558928,
        "id": "hba3qf1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630587728.0
    },
    {
        "author": "bigtexas91",
        "body": "Mu variant is going to fuck. Buy toilet paper, guns, ammo, bread, bullets, bombs, NOW!!!!! Get a deep freezer Go NOW",
        "created_utc": 1630718060,
        "id": "hbimifx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630746860.0
    },
    {
        "author": "tombstone1111",
        "body": "Even after all that … spy calls will still print.  Mu variant priced in AND its transitory.  So no worries ..",
        "created_utc": 1630718143,
        "id": "hbimoee",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630746943.0
    },
    {
        "author": "Pietro405",
        "body": "Why not ? The secret to Amazon was itsd ability to scale up...with a thousand airports WW and with a virus which will never leave us for atleast 3 years more ( Peruvian Lambda and mu - new S. African variants are on the way next ) they can scale up.\n\nOr play safe and buy PFE",
        "created_utc": 1630507409,
        "id": "hb6y7fu",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1630536209.0
    },
    {
        "author": "_Apache_Helicopter_",
        "body": "Mu fat nuts",
        "created_utc": 1630512300,
        "id": "hb7a2x3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630541100.0
    },
    {
        "author": "mingling4502",
        "body": "These are all green for me today: CRSR, MNMD, NCLH, OPEN, POTX, TLRY, PRVB, XL\n\nGuessing these will be green shortly: KWEB, CWEB, MU",
        "created_utc": 1630593691,
        "id": "hbbku4y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630622491.0
    },
    {
        "author": "Jeermm",
        "body": "value stocks right now are mostly energy and commodities with a few exceptions here and there. a few off the top of my head would be XOM, RIO, BHP, LYB, OGN, STX, LVS, MU, etc. the list goes on and on. \n\nDM me if you’re really serious and I can try to help! This list I just shot off, ive owned and still own all of them except BHP, RIO, FCX, and VALE because i bought the etf $PICK instead.",
        "created_utc": 1630968577,
        "id": "hbv3xfb",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630997377.0
    },
    {
        "author": "sycophantasy",
        "body": "If I remember correct “Mu” was the name of the main bad guy in Monster Rancher so we are fucked",
        "created_utc": 1631024025,
        "id": "hbxluur",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631052825.0
    },
    {
        "author": "Kindly-Somewhere-14",
        "body": "Mu is going to print more. Buy mrna",
        "created_utc": 1630994596,
        "id": "hbwg3f0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631023396.0
    },
    {
        "author": "dsubpo",
        "body": "Mu might wipe us out",
        "created_utc": 1630512375,
        "id": "hb7a9o9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630541175.0
    },
    {
        "author": "trueshot-aura",
        "body": "Mu nuts",
        "created_utc": 1630901773,
        "id": "hbrs7gd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630930573.0
    },
    {
        "author": "BearsRfukd",
        "body": "https://www.newsweek.com/mu-covid-variant-could-resistant-vaccines-almost-every-state-1626119",
        "created_utc": 1630809123,
        "id": "hbn5clp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630837923.0
    },
    {
        "author": "thenoblebuffalo",
        "body": "MU variant. Gonna be all up in the news",
        "created_utc": 1631044257,
        "id": "hbyyl8m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631073057.0
    },
    {
        "author": "DEGENERATE_PIANO",
        "body": "MU 90C",
        "created_utc": 1631023688,
        "id": "hbxl3yl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631052488.0
    },
    {
        "author": "PanickyLemur",
        "body": "Mu variant of concern.",
        "created_utc": 1630690337,
        "id": "hbgyv14",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630719137.0
    },
    {
        "author": "quiethandle",
        "body": "A virus variant that evades the vaccines will only serve to give Jerome Powell more ammunition to justify his endless money printing. If the MU variant turns out to be serious, expect a 5% pullback in the market, and then the stock market to double again over the next 18 months, because the Fed won't be printing $150 billion every month. They will crank it up to three or 400 billion every month.",
        "created_utc": 1630587077,
        "id": "hbb60lc",
        "score": 0,
        "subreddit": "investing",
        "created": 1630615877.0
    },
    {
        "author": "EatMaTesticles",
        "body": "Pepper your angus, Mu variant coming",
        "created_utc": 1631023661,
        "id": "hbxl1un",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1631052461.0
    },
    {
        "author": "golden_bear_2016",
        "body": "Mu variant confirmed.\n\nTHE PARTY IS OVER!!!\n\nCRASH IMMINENT!!!\n\nSAVE YOURSELVES!!!",
        "created_utc": 1630532391,
        "id": "hb8mt69",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1630561191.0
    }
]