[
    {
        "author": "Lord_Oim-Kedoim",
        "body": "I‘m going to br direct here: you managed to lose money, and not just a bit basically your whole investment - within the biggest bull run in the last decade. Find some ETFs you like and quit trading. This is seemingly not for u",
        "created_utc": 1632173851,
        "id": "hdn51ji",
        "score": 38,
        "subreddit": "options",
        "created": 1632202651.0
    },
    {
        "author": "BlackwoodJohnson",
        "body": "No history of any debt except for student loans which was paid off in 3 years. To be fair, I did the pre-approval for mortgage online; maybe if I speak to a real representative they can work something out. But it’s too depressing just for a 1 BR condo with 500 a month in condo fees. Townhouses start at 650-700, detached? Prepare for a mil.",
        "created_utc": 1632596444,
        "id": "he94reb",
        "score": 10,
        "subreddit": "CanadianInvestor",
        "created": 1632625244.0
    },
    {
        "author": "PeeOnManning",
        "body": "Because MSM was conditioning people to take bear positions for September noise about how September is bad but September is going to be very bull and will happen when volume picks up. I highly recommend reading Betting Resource's quarterly outlook. They have been spot on. To summarize, do not short the market yet because the melt up phase is not complete and the big vertical melt up is yet to come. Multi year bear market will come but not yet.  Don't listen to any noise. I highly recommend following Aswath Damodaran, Mark Meldrum and Betting Resource to get the best market guidance. Don't be fooled by the sports content of BR, their quarterly outlook and ticker suggestion for stocks and option are priceless.  Tesla bullish, don' let any quick pull backs shake your hands. Tesla to test all time high and form double top by or just after next earning and if volume picks up we will see 1k easily. I highly doubt multi year bear market will start before tesla cracks $1000.",
        "created_utc": 1631058719,
        "id": "hbzvk7y",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1631087519.0
    },
    {
        "author": "69PutsOnYourPuts69",
        "body": "Yeah, it's a very lucrative gig around here. People rent out these barely sub million dollar homes for *many thousands* every month. Like 2-4x rent of a normal 3 BR 2 Ba, literally exorbitant rates. One of my customers had a massive colonial he rented out for $6k/m and taxes were $19k per year.\n\nJEEEEEEEEEEEEZ",
        "created_utc": 1631099402,
        "id": "hc1mvm6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631128202.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "Fuk BR",
        "created_utc": 1631668289,
        "id": "hcw842v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631697089.0
    },
    {
        "author": "siphontheenigma",
        "body": "&gt;It’s even worse in places like the Bay Area and Austin. \n\nI live 16 minutes from downtown Austin. 22 minutes during rush hour.  My mortgage for a 4 BR house is $950. Rent for a 2BR apartment in my neighborhood is about $800. \n\nGTFO.",
        "created_utc": 1631713559,
        "id": "hcy71ou",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631742359.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 14th of September\n\n\n\n## Upcoming events for Tuesday, September 14th\n\n - Expected earnings:\n\n  AENZ, AKTX, ALOT, ASPU, ASTC, CNM, COE, DRD, EWCZ, FCEL, GGAL, HITI, IBEX, KSPN, MSB, MYTE, SKIL, THCA, UXIN\n\n - Ex-div:\n\n  AGM, AMH, APTS, ARCC, ARR, ATRI, AVK, BANC, BAP, BBN, BCAT, BCE, BCEI, BCX, BDC, BDJ, BFK, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIGZ, BIT, BKCC, BLE, BLW, BME, BMEZ, BNY, BOCH, BOE, BR, BRY, BST, BSTZ, BTA, BTT, BTZ, BUI, BXMX, BXS, BYM, CBU, CCI, CEN, CFFI, CII, CMA, COFS, CPG, CPK, CSGS, CSWC, CTBI, CVE, CXE, CXH, DIAX, DLR, DPG, DPZ, EFSC, EGF, EMN, ESRT, EVC, EXR, FCRD, FOF, FRA, FSK, GATX, GBAB, GECC, GGM, GILD, GIM, GOF, GPK, GRMN, GTN, GTN.A, HES, HLNE, HRTG, HUN, HWBK, HYT, IBP, IPAR, IRM, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JSD, JTA, JTD, KBR, KO, LDOS, LDP, LEG, LEO, M, MAXR, MBIN, MCA, MCR, MHD, MIN, MMD, MMT, MO, MRK, MSI, MTEX, MUE, MUI, NAC, NAD, NAN, NBB, NDMO, NEA, NEU, NEV, NID, NIQ, NKG, NKX, NMCO, NMS, NMZ, NPCT, NREF, NRK, NSA, NSL, NUV, NUW, NVG, NWE, NWS, NWSA, NXJ, NXPI, NXR, NXRT, NZF, OCSL, OMI, ORI, OVV, PB, PCH, PECO, PKG, PSA, PSB, PSF, PTA, QQQX, RA, REG, RNP, RNR, RQI, SAH, SBR, SCI, SELF, SFL, SFNC, SJR, SMMF, SPTN, SPXX, SRV, STC, STFC, SZC, TDS, TECK, TEI, TMO, TNL, TROW, TSLX, TY, UCBI, UE, UGI, UTF, VGR, VIAC, VIACA, VLY, VRSK, WGO, WH, WOR, WRB, WWE, XEL, XFLT\n\n - Economic events and announcements:\n\n    - CPI (consensus: 0.4%, previous: 0.5%)\n    - CPI (consensus: 5.3%, previous: 5.4%)\n    - CPI Index, n.s.a. (consensus: 273.79, previous: 273.00)\n    - CPI Index, s.a (previous: 272.26)\n    - CPI, n.s.a (previous: 0.48%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.3%, previous: 0.3%)\n    - Core CPI (consensus: 4.2%, previous: 4.3%)\n    - Core CPI Index (previous: 279.05)\n    - IEA Monthly Report\n    - NFIB Small Business Optimism (previous: 99.7)\n    - Real Earnings (previous: -0.1%)\n    - Redbook (previous: 16.5%)\n\n## Upcoming events for Wednesday, September 15th\n\n - Expected earnings:\n\n  AGTC, AURC, AXR, CAN, DSWL, GOTU, HEPA, JKS, JWEL, NEWP, PV, WEBR, XIN\n\n - Ex-div:\n\n  AAN, ADT, AGI, AIG, ALLE, ARES, CINF, DBL, DLY, DSL, DYFN, ES, ESSA, FCAP, FFIN, FINS, FNF, FNV, GAB, GDL, GDV, GGZ, GNT, GRX, GUT, GWRS, HCA, HI, HMN, HOFT, ICE, INDT, IVH, MAV, MCN, MCY, MEOH, MHI, MPW, MRCC, NMFC, NX, OLED, OPP, OXLC, OXSQ, PGZ, PHD, PHT, RFM, RFMZ, RIV, RMI, RMM, RNST, RSF, RYN, SNV, SOR, TCPC, UTMD, VST, WU\n\n - Economic events and announcements:\n\n    - Capacity Utilization Rate (consensus: 76.4%, previous: 76.1%)\n    - Crude Oil Imports (previous: 0.168M)\n    - Crude Oil Inventories (consensus: -3.903M, previous: -1.529M)\n    - Cushing Crude Oil Inventories (previous: 1.918M)\n    - Distillate Fuel Production (previous: -0.625M)\n    - EIA Refinery Crude Runs  (previous: -1.636M)\n    - EIA Weekly Distillates Stocks (consensus: -1.267M, previous: -3.142M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 2.7%, previous: -9.4%)\n    - Export Price Index (consensus: 0.4%, previous: 1.3%)\n    - Gasoline Inventories (consensus: -1.967M, previous: -7.215M)\n    - Gasoline Production (previous: 0.237M)\n    - Heating Oil Stockpiles (previous: 0.399M)\n    - Import Price Index (consensus: 0.3%, previous: 0.3%)\n    - Industrial Production (consensus: 0.4%, previous: 0.9%)\n    - Industrial Production (previous: 6.56%)\n    - MBA 30-Year Mortgage Rate (previous: 3.03%)\n    - MBA Mortgage Applications (previous: -1.9%)\n    - MBA Purchase Index (previous: 258.4)\n    - Manufacturing Production (consensus: 0.4%, previous: 1.4%)\n    - Mortgage Market Index (previous: 705.6)\n    - Mortgage Refinance Index (previous: 3,292.1)\n    - NY Empire State Manufacturing Index (consensus: 18.00, previous: 18.30)\n    - Thomson Reuters IPSOS PCSI (previous: 57.07)\n\n## Upcoming events for Thursday, September 16th\n\n - Stock splits:\n\n    - AROW @ **103:100** (Payable date: 09/24/2021)\n    - FSFG @ **3:1** (Payable date: 09/15/2021)\n\n - Expected earnings:\n\n  BGI, EYES, GEG, GHG, HOLI, INM, KZIA, NFH, NNA, REDU, RYB, SECO, SINO, WVFC\n\n - Ex-div:\n\n  AAP, ALB, ALEX, ALRS, ARD, AVNT, CB, CHMG, CMCT, CNQ, DEX, EXP, FISI, GEF, GEF.B, GHY, HBAN, HRC, HRZN, INT, ISD, MGU, PFLT, PLD, PLOW, PNNT, QCRH, ROIC, SBSW, SDHY, SHOO, TG, TPB, TSM, UNIT, VRS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.065%)\n    - Business Inventories (consensus: 0.5%, previous: 0.8%)\n    - Continuing Jobless Claims (consensus: 2,785K, previous: 2,783K)\n    - Core Retail Sales (consensus: -0.2%, previous: -0.4%)\n    - Initial Jobless Claims (consensus: 328K, previous: 310K)\n    - Jobless Claims 4-Week Avg. (previous: 339.50K)\n    - Natural Gas Storage (previous: 52B)\n    - Overall Net Capital Flow (previous: 31.50B)\n    - Philadelphia Fed Manufacturing Index (consensus: 19.0, previous: 19.4)\n    - Philly Fed Business Conditions (previous: 33.7)\n    - Philly Fed CAPEX Index (previous: 33.70)\n    - Philly Fed Employment (previous: 32.6)\n    - Philly Fed New Orders (previous: 22.8)\n    - Philly Fed Prices Paid (previous: 71.20)\n    - Retail Control (consensus: -0.1%, previous: -1.0%)\n    - Retail Inventories Ex Auto (previous: 0.5%)\n    - Retail Sales (consensus: -0.8%, previous: -1.1%)\n    - Retail Sales (previous: 15.78%)\n    - Retail Sales Ex Gas/Autos (previous: -0.7%)\n    - TIC Net Long-Term Transactions (previous: 110.9B)\n    - TIC Net Long-Term Transactions including Swaps (previous: 75.80B)\n    - US Foreign Buying, T-bonds (previous: 10.90B)\n\n## Upcoming events for Friday, September 17th\n\n - Expected earnings:\n\n  AHPI, ATXI, BHAT, CJJD, CREG, CXDC, DSS, ENVB, FKWL, INTG, JP, MANU, MVST, PBFS, PFSW, PVL, SFUN, SVA, TC, TDAC, VWE\n\n - Ex-div:\n\n  DMB, DTE, DTM, FGBI, HPP, IGR, JJSF, LAMR, MRTN, NEWT, NJR, PHM, RPT, SYBT, TTE, UHT, UTZ, WHF\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 4.3K)\n    - CFTC Copper speculative net positions (previous: 23.6K)\n    - CFTC Corn speculative net positions (previous: 267.8K)\n    - CFTC Crude Oil speculative net positions (previous: 349.2K)\n    - CFTC Gold speculative net positions (previous: 206.0K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 5.0K)\n    - CFTC Natural Gas speculative net positions (previous: -120.0K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -28.4K)\n    - CFTC Silver speculative net positions (previous: 28.6K)\n    - CFTC Soybeans speculative net positions (previous: 70.2K)\n    - CFTC Wheat speculative net positions (previous: 17.5K)\n    - Michigan 5-Year Inflation Expectations (previous: 2.90%)\n    - Michigan Consumer Expectations (previous: 65.1)\n    - Michigan Consumer Sentiment (consensus: 72.2, previous: 70.3)\n    - Michigan Current Conditions (previous: 78.5)\n    - Michigan Inflation Expectations (previous: 4.6%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 394)\n    - U.S. Baker Hughes Total Rig Count (previous: 497)\n\n^^^^2021-09-14",
        "created_utc": 1631613614,
        "id": "hcsvzcb",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1631642414.0
    },
    {
        "author": "KenBalbari",
        "body": "I posted this response in another forum, but should probably put it here:\n\nThe other index you are pointing to is based on new leases only. And most of the increase is just in the last few months. But it takes a year for most leases to actually expire. So it will take a year for that all to show in CPI data.\n\nConsider where we were just in June, per:\n\nhttps://www.apartmentguide.com/blog/apartment-guide-annual-rent-report/\n\nYear over year:\n\n    -3.1% 0-BR\n    +5.2% 1-BR\n    +4.8% 2-BR\n    -1.4% 3-BR\n\nThat reflects data only through the end of May. But as of then, some apartments (both studio and larger apartments) were actually still down year over year.\n\nSo even if new leases increased 8% in the next two months, if that only impacts ~ 1/6 of apartments, that might only cause overall rents to increase by ~ 1.35%.\n\nEventually you will see higher increases in the CPI data though, there will just be a little more lag there. Recent increases haven't actually impacted most renters yet.",
        "created_utc": 1631561877,
        "id": "hcq9ago",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631590677.0
    },
    {
        "author": "tisgamebeterhavep0rn",
        "body": "Brazil. Flair me BR Raul Dalio?",
        "created_utc": 1632532616,
        "id": "he5ybu7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632561416.0
    },
    {
        "author": "Neuromantul",
        "body": "Bla bla bla.. money printer goes br br.. no crash until after mid election cicle..",
        "created_utc": 1633010159,
        "id": "heumudb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633038959.0
    },
    {
        "author": "braamdepace",
        "body": "(Br)ass Monkey I took care of it.",
        "created_utc": 1632919339,
        "id": "heps21t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632948139.0
    },
    {
        "author": "Ricky_Goat_518",
        "body": "Bro what? The stock would literally br at $5 if he did that shit… fuckk",
        "created_utc": 1631136800,
        "id": "hc3wukd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631165600.0
    },
    {
        "author": "overzeetop",
        "body": "Go do a zillow or redfin $75-100k on the area between I79 and the Mon river south of Pittsburgh - From Washington to Charleroi to Pgh.\n\nYou're not going to find a lot of modern style in those houses, but there will be 100 hits with 2-4 BR houses. Most could use an update from the 1960s decor, but many are livable right off settlement. Just don't expect to see your property value double in the next 5 years.",
        "created_utc": 1631707863,
        "id": "hcxw0l7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631736663.0
    },
    {
        "author": "sack_of_potahtoes",
        "body": "You mean 2008 crash right? Not sure if lehman br were the only one instigating the crash. They were the ones who too fall while rest of the banks got bailed out.",
        "created_utc": 1632458402,
        "id": "he1z6rr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632487202.0
    },
    {
        "author": "jnolsen94",
        "body": "I was in the exact same position! I had one DIS share I got when I was 10. When the TA switched from Broadridge to Computershare and the price fell a bit, I decided to buy more. \n\nUnfortunately, a USD account of some kind is necessary, or at least it was when I last bought. I personally have a US account with RBC Bank (a wholly owned subsidiary of RBC, but based in the US). It's technically a different bank, but under the umbrella of the RBC family. I'm not sure whether CS would accept a USD account from a Canadian institution, although I assume they would, but it may be worth a phone call to their help line to get confirmation before looking to open a US account. I don't want to give any incorrect advice. \n\nThere are a couple of forms that are worth filling out too. The W8-BEN form should reduce the foreign resident withholding tax from 30% to 15% (once DIS reinstates the dividend), and I would certainly consider the DRIP as well. At a 1-1.5% yield some people don't bother, but I do it because I'd rather have fractions of shares added to my account than a $10 deposit to my bank.\n\nCS usually has good customer service, and DIS is a solid long-term hold. Hope this helps a little :)",
        "created_utc": 1632783269,
        "id": "heiz9k3",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1632812069.0
    },
    {
        "author": "No_Nefariousness6370",
        "body": "I don't know if this is good or bad, I would think that if BR has to sell their position the Hedgefucks would buy them up in a heartbeat, and while it's a minor portion of total shares and synthetics, it could cause a big dip?",
        "created_utc": 1631879718,
        "id": "hd73fz7",
        "score": 1,
        "subreddit": "Wallstreetbetsnew",
        "created": 1631908518.0
    },
    {
        "author": "TopTech58",
        "body": "Bought my first house in 1985 10% VA rate 3 BR 1bath 1000 sq ft ranch on 1 acre lot for 47k",
        "created_utc": 1632063152,
        "id": "hdgvxv1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632091952.0
    },
    {
        "author": "redratus",
        "body": "Dive in with the S&amp;P500. The risks of this ETF are low and the upside is fairly steady. DCA in because you never know what will happen tomorrow. This should make up the bulk of your portfolio for now—and for most people, forever. You can also consider VTI (for mid and small cap exposure) and VT (for international exposure), and QQQ (a slightly more aggressive approach with just 100 top companies, but lately performing very well)\n\nThen start to delve into stocks from companies that are established and whose charts have historically gone up over the years. I like to call these “steady gainers”, these are your FAAMGs, V, BX, etc. Consider cutting out the ones that have underperformed the S&amp;P500 significantly for years unless you have good reason to believe there’s going to br a breakout. Buy the ones that consistently beat it. No stock only goes up, but some come surprisingly close. DCA into these as well.\n\nAfter this you can think about more complicated plays (stocks that have been down for years but may reverse, newer/less established companies) but understand thats inherently more risky.\n\nGood luck. If you diversify you will have some losers but hopefully, provided you hold your picks for years and dont panic sell, your gains will outweigh your losses.",
        "created_utc": 1632416686,
        "id": "hdzh57s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1632445486.0
    },
    {
        "author": "siphontheenigma",
        "body": "Mid 2015. \n\n4 BR 2.5 Bath 2200 square foot single family home. \n\nThey're still building in my neighborhood and prices are inching up but you can still get the same type of house for about $300k.",
        "created_utc": 1631716911,
        "id": "hcyemde",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1631745711.0
    },
    {
        "author": "MetalliTooL",
        "body": "“This is just the beginning” is usually followed br meme stocks dying.",
        "created_utc": 1631033917,
        "id": "hby9jyj",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1631062717.0
    },
    {
        "author": "tsimtsimtsim",
        "body": "People said the same about Intel and smartphones, and we all know how that went...",
        "created_utc": 1630546680,
        "id": "hb9go2g",
        "score": 140,
        "subreddit": "stocks",
        "created": 1630575480.0
    },
    {
        "author": "crepeblanket",
        "body": "What was the news about Intel delaying their govt deliveries so they bought some AMD and NVIDIA chips while waiting for Intel to come through? Intel being the defacto govt chip supplier doesn’t sound like an absolutely sure thing long term",
        "created_utc": 1630765009,
        "id": "hbkk4ay",
        "score": 34,
        "subreddit": "investing",
        "created": 1630793809.0
    },
    {
        "author": "jubothecat",
        "body": "Intel said it was going to build the world's fastest super computer like 10 years ago. Now, they were supposed to deliver it years ago, and they still don't have the technology to make what they said they would. Even if released today it would now only be like the 3rd fastest because they waited too long.\nTldr: even if Intel has these new government contracts, they are so far behind that they have a lot longer of a journey to be the best chip maker than people think (most laymen don't even know AMD is better right now).",
        "created_utc": 1630765482,
        "id": "hbkl4bs",
        "score": 28,
        "subreddit": "investing",
        "created": 1630794282.0
    },
    {
        "author": "Not_FinancialAdvice",
        "body": "&gt; That's because Intel mobile chips were always power hungry. They couldn't get a day standby time or whatever horrible battery life it was. \n\nThe Intel PXA270 XScale processor (which was an ARM implementation) in my old Palm Treo 650 gave me 2-3 days of battery life. They sold the XScale IP to Marvell later on.",
        "created_utc": 1630560235,
        "id": "hba5qyf",
        "score": 16,
        "subreddit": "stocks",
        "created": 1630589035.0
    },
    {
        "author": "ra__account",
        "body": "See the recent discussion that we're still paying baggage fees that were markets as temporary after 9/11. If there's limited enough suppliers (like the AMD/Intel/NVidia trio), they can keep prices up without crossing the line of overtly colluding. Creating and manufacturing a powerful CPU is very costly and the only edge players like Apple have no interest in driving prices down.",
        "created_utc": 1630777573,
        "id": "hblc3s2",
        "score": 15,
        "subreddit": "investing",
        "created": 1630806373.0
    },
    {
        "author": "Adept-Investing",
        "body": "Intel",
        "created_utc": 1630721175,
        "id": "hbisizr",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1630749975.0
    },
    {
        "author": "Myleftarm",
        "body": "The post was about failed companies and Intel is a terrible example of one.",
        "created_utc": 1630896615,
        "id": "hbrijqi",
        "score": 10,
        "subreddit": "stocks",
        "created": 1630925415.0
    },
    {
        "author": "RobotArtichoke",
        "body": "INTC is such a boomer company. How did I ever get sucked into that pile of shit when everyone here was telling me to buy AMD. Sometimes you have to admit defeat.",
        "created_utc": 1630685966,
        "id": "hbgob55",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1630714766.0
    },
    {
        "author": "pasta4u",
        "body": "There are plenty of states that can. Intel has plants in New York and Texas i believe. \n\nYou can remediate the pollution  with proper processes.",
        "created_utc": 1630991261,
        "id": "hbwb8cu",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1631020061.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "https://www.tomshardware.com/news/intel-ice-lake-inefficient-for-cloudflare\n\nNET chooses AMD over INTC for new processors",
        "created_utc": 1630515542,
        "id": "hb7i3n8",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630544342.0
    },
    {
        "author": "Jaypalm",
        "body": "ARM doesn’t make chips. Neither does AMD. ARM is an architecture, like x86. It’s an IP company. AMD designs and sells CPUs. As the underdog in the desktop CPU market they would be hurting themselves to collude with Intel when what they’re actually doing is making better products and undercutting Intel’s prices. I’m not saying there isn’t market collusion, but your arguments will have more merit if you actually know what you’re talking about.",
        "created_utc": 1630799360,
        "id": "hbmmlyz",
        "score": 8,
        "subreddit": "investing",
        "created": 1630828160.0
    },
    {
        "author": "paq12x",
        "body": "INTC has a stock split 2:1 at the end of July 2000.\n\nIn the last 10 years, return for INTC is 14% annually or a total of 268% in 10 years.  \n\nNot bad at all.",
        "created_utc": 1630760951,
        "id": "hbkc7t1",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630789751.0
    },
    {
        "author": "updownleftrightabsta",
        "body": "INTC is positive YTD, 1 year, 5 years. It hasn't done well but I wouldn't call it failing GE-style. OP just means stock price wise, not execution wise (related but not completely correlated)",
        "created_utc": 1630895328,
        "id": "hbrg0in",
        "score": 8,
        "subreddit": "stocks",
        "created": 1630924128.0
    },
    {
        "author": "Xx_Majesticface_xX",
        "body": "TSMC is a fairly well known stock, however, I’m placing my bets on Global Foundries. While there were talks a few months ago in regards to Intel acquiring them, a lot of electronics that don’t require high end semi conductors(7nm TSMC, 8nm Samsung, 10nm Intel) are made using cheap, larger nodes that are less efficient. Global foundries failed to develop high end chips after they abandoned their rnd, but they hold a 15% market share(at last check) in markets which use lower grade nodes. Best part is, that they are supposedly going public in 2022. I personally think that this is a wise investment, though a rather obvious one, as any company which is trusted by the US government and hold a market share in a sector worth billions is a simple stock to buy",
        "created_utc": 1630714543,
        "id": "hbiflpp",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630743343.0
    },
    {
        "author": "Ryano3",
        "body": "21% MSFT\n\n21% AAPL\n\n19% AMZN\n\n10% GOOG\n\n9% NVDA\n\n8% BABA\n\n5% AMD\n\n5% INTC\n\n2% VOO\n\nup on everything but BABA and INTC, currently daily averaging into VOO",
        "created_utc": 1630987598,
        "id": "hbw5bf0",
        "score": 8,
        "subreddit": "stocks",
        "created": 1631016398.0
    },
    {
        "author": "preiser",
        "body": "ive been watching this the last 6 months or so as well. valuation is tasty and takeover target makes sense based on so many companies wanting to get into healthcare.   \n\n\nalso worth noting, the dogs of the dow strategy (investing in the 10 DOW components with lowest PE multiples) would include WBA. \n\nVZ also fits the dogs of dow mold but it has a good amount of debt. they also just bumped the divy up to 4.5%. other dogs of the dow based on PE for last year and their accompanying divy %\n\n\\-VZ (4.5% yield, 10.5% off 52 wk high)  \n\\-GS (1.22% yield, 2.25% off 52 wk high)\n\n\\-INTC (2.6%, yield, 21.87% off 52 wk high)\n\n\\-IBM (4.67% yield, 8.68% off 52 wk high)",
        "created_utc": 1631019283,
        "id": "hbxc5aq",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1631048083.0
    },
    {
        "author": "Both-Ad-7757",
        "body": "This is a fantastic explanation and I’m with you on Intel. Very well put good sir!",
        "created_utc": 1630630214,
        "id": "hbdz1us",
        "score": 6,
        "subreddit": "ValueInvesting",
        "created": 1630659014.0
    },
    {
        "author": "SnipahShot",
        "body": "And to add on top of that Intel finally put their foot in the gaming GPU market for the first time. Regardless of how good Alchemist will be, it will take profits from AMD and Nvidia, especially if it is as good as they make it sound.",
        "created_utc": 1630914900,
        "id": "hbsavdb",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630943700.0
    },
    {
        "author": "daaammmN",
        "body": "It all depends on if you overpaid or not.\n\nIntel was almost at the 80$ mark in the 2000s.\n\nSince then it has grown a lot, but still, 20 years later and it never reached its all time high.\n\nThis just proves that you can overpay for growth.\nIf you are overpaying, you might not see an increase for many years to come\n\nI haven't dug into MasterCard, but I did for Visa.\n\nIMO, Visa (and most of the market) is overpriced. The growth that Visa is projecting (mid teens) for the next 5 years is already priced in.\n\nIf the bull market continues, the stock price might increase, but it's just a matter of time before the correction arrives and reality kicks in.\n\nI want to own Visa, I like it very much. They have been buying back shares like crazy, which is awesome. It's on my watchlist. But it still has to drop a lot for me to be a buyer. I have no doubt that it will be a buy at some point in the future though.",
        "created_utc": 1630758713,
        "id": "hbk8hho",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630787513.0
    },
    {
        "author": "shashwat73",
        "body": "I added V and INTC. Low PE ratios, great companies, and good technicals on both",
        "created_utc": 1630680824,
        "id": "hbgbvlk",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630709624.0
    },
    {
        "author": "TaxGuy_021",
        "body": "AMD and Nvidia dont have an insurmountable lead. They are ahead of Intel for sure for now, but I believe intel has what it takes to get back in the game.",
        "created_utc": 1630866603,
        "id": "hbprfhq",
        "score": 5,
        "subreddit": "investing",
        "created": 1630895403.0
    },
    {
        "author": "meowman3000",
        "body": "Intel is getting government money to setup fabs in the US, as part of an infrastructure bill.  I could see them treating TSMC like they do Huawei in the future if Intel gets enough capacity.  I could see a strong case for national security, in which case Nvidia and AMD would shift to Intel, assuming the fabs are competitive.\n\nA small chance at least.",
        "created_utc": 1630637279,
        "id": "hbee1ue",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630666079.0
    },
    {
        "author": "Nuclear_N",
        "body": "INTC has been such a dog.",
        "created_utc": 1630859096,
        "id": "hbpah9w",
        "score": 4,
        "subreddit": "investing",
        "created": 1630887896.0
    },
    {
        "author": "bcuap10",
        "body": "Markets in theory function well because of competition and displayed consumer/investor preference.\n\nThey gov should fund 5-10 startups and give them funding to create pilot plants. Then hold competitions to advance the companies forward for more funding.\n\nYou would end up with more surplus and innovation if 2-3 new companies emerge and then sub specialize in different parts than giving everything to a dinosaur like Intel.",
        "created_utc": 1630773662,
        "id": "hbl38jl",
        "score": 4,
        "subreddit": "investing",
        "created": 1630802462.0
    },
    {
        "author": "Pokesaurus_Rex",
        "body": "and Intel hasn’t innovated a CPU since like 2015…we are on 14nm++++++. They can’t even get a 7nm CPU to work and it got so bad they had to bring back one of their best designers out of fucking retirement.",
        "created_utc": 1630919676,
        "id": "hbsg83o",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630948476.0
    },
    {
        "author": "sweYoda",
        "body": "Coca-Cola, Kroger, Tyson Foods, Disney, Google, Intel",
        "created_utc": 1630640934,
        "id": "hbela50",
        "score": 4,
        "subreddit": "investing",
        "created": 1630669734.0
    },
    {
        "author": "noobc4k3",
        "body": "Why is INTC  dumping AH?",
        "created_utc": 1630531290,
        "id": "hb8kdol",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630560090.0
    },
    {
        "author": "notmsnewty",
        "body": "ALYI - hemp batteries are the future. I hope this is the company.  Anyone else have intel?",
        "created_utc": 1630625285,
        "id": "hbdonrm",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1630654085.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "INTC and CLF are the best govt plays moving forward. Love them both.",
        "created_utc": 1630600645,
        "id": "hbc1uwi",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630629445.0
    },
    {
        "author": "GraysonMA",
        "body": "When you buy leaps you are taking on a lot of vega exposure which can add significant risk to your portfolio. However, vega gives you a second way to win if you stick to companies that have IVR/IV% near their 52 week lows. [Barchart is a great resource for finding these.](https://www.barchart.com/options/iv-rank-percentile/stocks?orderBy=optionsWeightedImpliedVolatility&amp;orderDir=asc)\nI also choose underlyings that have low correlation with each other. This keeps things a little less volatile which is especially important using any type of leverage. [PortfolioVisualizer has a great tool for this.](https://www.portfoliovisualizer.com/asset-correlations?s=y&amp;symbols=SPY+TLT+KO+PG+D+INTC+MCD+VZ+FB+MSFT+NVDA+LLY+NEE&amp;timePeriod=2&amp;tradingDays=60&amp;months=36). Leaps I bought recently are in PG, INTC, FB, D, MSFT, KO, VZ, and MCD. LLY is an solid low correlation pick but I’m waiting for a dip in IV.",
        "created_utc": 1630675696,
        "id": "hbg03gf",
        "score": 3,
        "subreddit": "options",
        "created": 1630704496.0
    },
    {
        "author": "him7403",
        "body": "Microsoft and Apple hold and buy Intel? That's a big lol 😂\n\nUnfortunately stock market doesn't follow your formula.",
        "created_utc": 1630868623,
        "id": "hbpvwt2",
        "score": 3,
        "subreddit": "investing",
        "created": 1630897423.0
    },
    {
        "author": "MentalValueFund",
        "body": "The fact you think the 7nm naming scheme from AMD is comparable to the naming scheme from Intel shows me you don’t know much about semiconductors.\n\nI’m not stating Intel isn’t behind the ball on manufacturing at the moment relative to TSMC, but an AMD 7nm design is equivalent to an Intel 10nm design. The naming conventions are literally market bullshit that haven’t meant anything since we moved to FinFET.",
        "created_utc": 1630996180,
        "id": "hbwi8qu",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631024980.0
    },
    {
        "author": "myglasstrip",
        "body": "Take a look at the Intel 20 year chart and tell me when intc got back to its last ath of 73.94 a share or whatever.",
        "created_utc": 1630538488,
        "id": "hb8zbv3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630567288.0
    },
    {
        "author": "donktastic",
        "body": "That's not completely true and even if it was it doesn't matter. The proprietary tech steps are all done in secure locations like the US, Israel and Ireland with the US doing 100% of their R&amp;D. The R&amp;D sites are massive and also do manufacturing which handles the most top secret stuff, like US military stuff. Asia only gets the cost saving steps that are not sensitive, like packaging. \n\nIf shit hit the fan and world war 3 broke out, Intel could easily do 100% of its process in the US or allied countries. The most important part being that Intel is a US company, is based in the USA and is invested in the success of the nation.",
        "created_utc": 1630782995,
        "id": "hblo2pd",
        "score": 3,
        "subreddit": "investing",
        "created": 1630811795.0
    },
    {
        "author": "Thin_Influence5878",
        "body": "INTC ftw",
        "created_utc": 1630866065,
        "id": "hbpq8bw",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630894865.0
    },
    {
        "author": "TJMBeav",
        "body": "Bought $INTC shares $53.37 pre market.",
        "created_utc": 1631016840,
        "id": "hbx7vod",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631045640.0
    },
    {
        "author": "throughthehazel",
        "body": "INTC 50s 9/17 poots",
        "created_utc": 1630536020,
        "id": "hb8ud2v",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630564820.0
    },
    {
        "author": "Scion_capital_intern",
        "body": "Well CCP has already infiltrated all of our Intel agencies and defense contractors so.. \n\nIt's the same thing. But yes.",
        "created_utc": 1630879305,
        "id": "hbqji8o",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630908105.0
    },
    {
        "author": "senecadocet1123",
        "body": "The only one I would by heavily is Intel right now",
        "created_utc": 1630877550,
        "id": "hbqfrdi",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630906350.0
    },
    {
        "author": "SugarDaddyVA",
        "body": "Their management has been terrible.  They missed a chip cycle which will set them back years in competition with other companies such as TMSC.  Great article explaining what happened here:  https://www.google.com/amp/s/www.tomshardware.com/amp/news/intel-announces-delay-to-7nm-processors-now-one-year-behind-expectations\n\nI’ll look at them again in a few years if they turn things around.",
        "created_utc": 1630868939,
        "id": "hbpwlw8",
        "score": 3,
        "subreddit": "investing",
        "created": 1630897739.0
    },
    {
        "author": "Stoli1387",
        "body": "Intel if you're patient",
        "created_utc": 1630692101,
        "id": "hbh31da",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630720901.0
    },
    {
        "author": "828stocks",
        "body": "Thank you for my tasty dividend, INTC.  You might be fucking me, but at least you're buying dinner.",
        "created_utc": 1630593293,
        "id": "hbbjvvx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630622093.0
    },
    {
        "author": "DongKelly32",
        "body": "Look up AS ML (pretty sure they’re private but just being safe). They make the machine that makes shit for Intel, TSMC, AMD, NVDA, etc. and it costs $150m+",
        "created_utc": 1630698475,
        "id": "hbhhl5g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630727275.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Here's hoping. I don't think their gpu will be aimed at the gaming market, so I don't think it will garner the same hype that a new release from Nvidia does.\n\nOver time though, especially with investment from the u.s with the aims of developing their u.s fabs, Intel will gain new life.",
        "created_utc": 1630714059,
        "id": "hbieok5",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630742859.0
    },
    {
        "author": "mistermc90",
        "body": "Tip: just look where the cheap free cashflow to the firm / shareprice is!!!\n \n-BTI, ITB (big tobacco in general) //\n-INTC (semiconductor) //\n-RDSB (big oil/gas cashflow machine) //\n-VZ (telco with strong free CF in an oligopolistic market) //\n-FRE (strong german health company) //\n-VRTX (tremendous value drug company - 10/10 financials)",
        "created_utc": 1630688427,
        "id": "hbguas9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630717227.0
    },
    {
        "author": "Parallelism09191989",
        "body": "Intel and TSM\n\nEverybody overreacting to AMD leapfrogging Intel.",
        "created_utc": 1630685309,
        "id": "hbgmpm0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630714109.0
    },
    {
        "author": "PrincPaco",
        "body": "Not so sure about some of those tickers, unless you're buying Puts. Regardless, I wish you Good luck.\n\nINTC LEAPS may be a good play.",
        "created_utc": 1630961251,
        "id": "hbuo7fc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630990051.0
    },
    {
        "author": "CrimsonBrit",
        "body": "INTC",
        "created_utc": 1630948074,
        "id": "hbtu8pw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630976874.0
    },
    {
        "author": "spongesquare",
        "body": "What happened to Intel?",
        "created_utc": 1630516952,
        "id": "hb7ljkv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630545752.0
    },
    {
        "author": "Overhaul2977",
        "body": "AMD’s profit margin is pretty good, they are taking market share from intel and approaching Nvidia in performance for their GPUs, and they are innovating well under current management. The problem with your analysis is you’re looking at book value, you need to look at future growth and both companies they can take market share have a fair amount higher market cap, meaning it has plenty of space to grow if things keep going well for them. The stock market cares about future growth, not too much on past performance.\n\nTo give you a basic idea of investing, there are four types of companies - Dogs, Cash Cows, Question Marks, and Stars. AMD is at the Question Mark phase that is almost to Star. They are taking market share in a fast growing area. The typical investor strategy in that situation is to “buy”.",
        "created_utc": 1630588805,
        "id": "hbb9kpu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630617605.0
    },
    {
        "author": "ZeroSumBananas",
        "body": "Here are some stocks I have looked at some higher risk than others you can go with Google, Microsoft, Apple, Tesla, ISRG, Lucid, CHPT, Facebook, Intel this would be a contrarian buy, Nokia, Berkshire Hathaway, so those are some common stocks. Depends on your risk tolerance. If you want risk you can go with Chinese stocks....Not responsible for your success or failure. Not recommending anything. Good luck. Do your DD",
        "created_utc": 1630884623,
        "id": "hbqud9e",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630913423.0
    },
    {
        "author": "ErojectionPrection",
        "body": "I think nvidia is fine to hold onto for a while.\n\nThey're still far ahead of amd in the professional world but the money is in the consumer world. AMD has been very competitive in that regard over the years. But Intel is the bigger victim of AMD's success. Nvidia simply has real competition now. But only in a tiny area.",
        "created_utc": 1630912141,
        "id": "hbs7j12",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630940941.0
    },
    {
        "author": "merlinsbeers",
        "body": "IBM made probably the biggest mistake in business history by giving Microsoft and Intel the ability to make computers on the PC architecture without IBM involvement.\n\nThey could have owned that whole ecosystem and leveraged their incredible brand recognition to attract the talent that made it happen.\n\nBut, if they had, IBM management would have overcontrolled it so we'd probably all be using Macs and talking about PC only in conversations with words like Amiga, Imsai, and Heathkit.",
        "created_utc": 1630940177,
        "id": "hbtc2gd",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630968977.0
    },
    {
        "author": "pacifistrebel",
        "body": "I hope intel can turn around their fabrication business. If they can, the current price is a steal. If not.. who knows what will happen. The USA could benefit from competent domestic semiconductor fabrication.",
        "created_utc": 1630894021,
        "id": "hbrdf0r",
        "score": 2,
        "subreddit": "investing",
        "created": 1630922821.0
    },
    {
        "author": "WolfPackWSB",
        "body": "AMD Samsung Intel Xilinx TSM &amp; ON are the major ASIC manufacturers.. Most patents are held by TSM",
        "created_utc": 1630932103,
        "id": "hbsw3lq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630960903.0
    },
    {
        "author": "niversally",
        "body": "You have a lot of superintendent Chalmers energy when he says he’s balding not bald respect the ing. Intel is failing not failed.",
        "created_utc": 1630895736,
        "id": "hbrgu4q",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630924536.0
    },
    {
        "author": "jasoncyke",
        "body": "Intel has been such a letdown since it dipped below 60 dollars.",
        "created_utc": 1630549201,
        "id": "hb9lwcm",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630578001.0
    },
    {
        "author": "dancinadventures",
        "body": "Still cheaper than working w/Intel for chips. \n\nBullish",
        "created_utc": 1630997838,
        "id": "hbwkdr6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1631026638.0
    },
    {
        "author": "Jacklewis98",
        "body": "I had a huge feeling Intel would be complacent, through what their management and executives actions towards AMD made me think they thought AMD would go bankrupt before they caught up",
        "created_utc": 1630602240,
        "id": "hbc5x87",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1630631040.0
    },
    {
        "author": "LargeFatherOrtiz",
        "body": "my intc puts are ded",
        "created_utc": 1630608390,
        "id": "hbcladk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630637190.0
    },
    {
        "author": "Summebride",
        "body": "Stocks means stock market securities that you've surely heard of, Microsoft, Intel, JP Morgan, etc.\n\nBonds are a timed instrument where you lend your money to something and they pay it back later, with a slight amount extra.\n\nBonds have traditionally been for old people as they neither go up or down very much, and are predictable.  \n\nStocks can change in value radically and have traditionally been recommended for young  people so if you lose a lot of value, you have time to make it up.  \n\nBlended fund just means a mix of those two kinds of things.  \n\nAt 23 there's no other choice than stock.  \n\nAAR% likely means average annual return.  So if the AAR% was 4% and you have 1000 placed there, it would have gained about $40 during the year.  \n\nBunds are have recently been returning close to nothing.  Someday that might change but for now they're pretty much a worthless option for you.",
        "created_utc": 1630726021,
        "id": "hbj1hwp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630754821.0
    },
    {
        "author": "Trump_Ate_My_Ass",
        "body": "Which is better? 11th gen intel i7-11370H with Intel Iris XE graphics or AMD Ryzen 7 5700U with AMD Radeon graphics?",
        "created_utc": 1630535840,
        "id": "hb8tzt3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630564640.0
    },
    {
        "author": "Aggressive_Watch3782",
        "body": "Quik logic is a perfect short! I lost my shirt on them for long term gain. Every earnings call wait until next quarter…Nvidia blows it out of the park regularly and it’s basically a 50/50 after. It’s gone down when you just heard the most mind numbing numbers and then it goes down the next day! I ask how is this possible! \n-People are just trimming and taking profits! \nI don’t think that’s it, why take money out of the #1 stock that invented the Metavese and A/I by a fortuitous accident! Gaming company invented the GPU, Gaming company invented A/I, ray tracing and augmented reality!  Platform is best in class command a premium. \nNot many companies out their using their BILLIONS of free cash flow for R&amp;D which unlike Intel continues to make things we never dreamed about a reality today! \nOh yeah, 350 automobile companies are signed up for their driving platform and when Tesla is forced to use it . This stock will be out of reach because it’s going to be worth the most of any company today! This new Metavese thingy is at a minimum double what the impact of the game changing internet did… whaaat, I’m barely proficient now! Us old baskets are in a world of pain trying to figure that out. It is going to change the way all of us live and work so that many more of us get to also enjoy our best lives.",
        "created_utc": 1630806721,
        "id": "hbn0uzw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630835521.0
    },
    {
        "author": "datingadviceThrow789",
        "body": "Intel will join if China takes over Taiwan.",
        "created_utc": 1630785710,
        "id": "hblu2uy",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1630814510.0
    },
    {
        "author": "LastTradeTonight",
        "body": "I know YouTube is filled with peep calling the wheel “free” money. \n\nLong term you won’t get the same raw SPY return. \nIt’s less volatile and more income driven. Also the capital lock-up is less per contract per 100 shares. \nStraight CC on SPY makes more sense than the put side bc it can get you a 70/30 risk profile with higher income. \n\n\nIf you don’t care about income and are long-term investor than buy-hold is going to work better than the wheel. \n\nPersonally, when I run the wheel it’s on a large cap with good options volume that has some vol but over all pretty stable. In the past companies like BAC, AAPL, INTC.  I haven’t run it since last year for obvious reasons.",
        "created_utc": 1630778216,
        "id": "hbldj7b",
        "score": 1,
        "subreddit": "options",
        "created": 1630807016.0
    },
    {
        "author": "maz-o",
        "body": "i kinda have this feeling too that intel will crush it in the coming 5 years",
        "created_utc": 1630743630,
        "id": "hbjpyd0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630772430.0
    },
    {
        "author": "moldyjellybean",
        "body": "Yes and INTC is not a tech company.  I've been in the datacenter field for many years and I'm indifferent to brand, I'm mostly looking at energy efficiency, tech advancements.  Someone wanted to invest in Intel last week and I spelled out why not.  Originally my thesis was around 2016 when I bought AMD and Intel had Brian K was head of Intel.  This is no go and it may turn around a bit on buybacks, financial engineering they have a ton of money but it's not on the back of technology.  \n\nAny non boomer working in cloud computing/semi field can tell you INTC is not where you want to put your money.  I believe Pat is more tech inclined but it's a long road and in the mean time you can invest in AMD, TSM, NVDA, AMZN, MSFT, APPL etc if you want exposure to semi or cloud computing.  \n\n\n\nhttps://old.reddit.com/r/wallstreetbets/comments/panf65/intel_is_50_bucks_just_saying/ha79m4v/",
        "created_utc": 1630866105,
        "id": "hbpqbjw",
        "score": 1,
        "subreddit": "investing",
        "created": 1630894905.0
    },
    {
        "author": "SnipahShot",
        "body": "Your comments seem like you are a 5 year old.\n\n\"Do you really think the super smart people they hire are morons that will sit around and let AAPL go under?\"\n\nHundreds of companies had \"super smart\" people.  \nAre you familiar with Nokia? BlockBuster? BlackBerry? IBM?  \nHeck, even Intel has been trading downwards for almost 6 months.\n\nIt doesn't matter how many \"super smart people\" a company has, if a company fails to innovate and expand their business they will start going down.  \nThis is not the case for Apple, but it is not because of \"super smart people\", it is because they still seem to innovate and expand.\n\nAlso, do you even know what exactly Apple are planning on doing in the healthcare and EV? Who their competition is in each of these fields?",
        "created_utc": 1630869503,
        "id": "hbpxuzt",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630898303.0
    },
    {
        "author": "Premier_Legacy",
        "body": "Team intel . Any day now",
        "created_utc": 1630985938,
        "id": "hbw2ego",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631014738.0
    },
    {
        "author": "MentalValueFund",
        "body": "Equivalent in transistor density. The post was about naming convention and originally before FinFET that’s what the “nm” moniker aimed to describe. Jesus you really are fucking dense. My entire post was pointing out how you clearly have no clue that calling out “omg Intel is on 14nm and amd on 7nm lolz 7 &lt; 14 so better!” Is nonsense.",
        "created_utc": 1630999057,
        "id": "hbwlv5o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631027857.0
    },
    {
        "author": "ummacles123",
        "body": "99% of retail customers dont know what the hell is that 14nm, they know Intel has always been in computers and has worked. AMD fanboys need to stop using that nm excuse.",
        "created_utc": 1630931677,
        "id": "hbsve50",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630960477.0
    },
    {
        "author": "SoyFuturesTrader",
        "body": "You know for people who really wanted to make money they’d go spent some time doing intel work in the DoD then maybe operations officer at the CIA then go off grid and spy on all the people with info in the know \n\nThen buy SPY call and put FDs accordingly",
        "created_utc": 1630642995,
        "id": "hbep0nq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630671795.0
    },
    {
        "author": "Afro_Superbiker",
        "body": "Great points, cheers! \n\nIntel is one of my value picks in my portfolio, and I hope their value is recognized in the future. \n\nThe stock price of AMD is ridiculous compared to them.",
        "created_utc": 1630633211,
        "id": "hbe5i3a",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630662011.0
    },
    {
        "author": "UncleFupa",
        "body": "I work in the hardware security space... I've been to enough conferences to know for a fact the government is throwing a significant amount of money into this field.. billions...  At one point they were talking about standing up their own foundry...\n\nThe chip shortage combined with the need to have secure devices is forcing the government to be there funding into producing this stuff at home and not overseas.  \n\nIt seemed like it barely made the news, but a few weeks ago, it was announced Intel won the contract for government chips.  This was huge news to me. It's an undisclosed amount, but if I had to guess, it's not insignificant. And these are the type of contacts that once they get going, it's almost impossible to end.  Intel will be the government's arm for anything hardware related from here on out.  Sort of like Boeing or any defense company.",
        "created_utc": 1630762019,
        "id": "hbke6u9",
        "score": 1,
        "subreddit": "investing",
        "created": 1630790819.0
    },
    {
        "author": "SnipahShot",
        "body": "1. Pfizer.\n\nThe stock dropped after the FDA approval and by the end of the year they have the booster EUA request for the general public (already requested). They have their protease inhibitor that might completely obliterate the worst thing in Covid - The infection rate, which they will request EUA in the last quarter of the year.\n\n2. Intel \n\nIntel has been beat for a while due to nothing of significance. Now they are coming with a new CPU Alder Lake which seems to surpass what AMD has to offer and also seems to be cheaper. Intel is also releasing a new gaming GPU, which is the first time for Intel to release a gaming one so it opens a brand new market for them. It also seems like this GPU will be able to compete against the top of Nvidia and AMD, while possibly being cheaper, if the CPU pricings are an indication.    \nAlso Intel is investing in their foundries with support from the US government, in order to manufacture chips outside of China.",
        "created_utc": 1630797141,
        "id": "hbmib99",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630825941.0
    },
    {
        "author": "donktastic",
        "body": "They key here is that Intel in a Domestic company with domestic production. AMD and NVIDIA both rely on TSMC for production. TSMC I'd great and all but they are a foreign country and this industry is to vital to national security to rely on foreign production. Also certain top secret products will never get contracted out of country either. Intel will always have that edge.",
        "created_utc": 1630766383,
        "id": "hbkn1xc",
        "score": 1,
        "subreddit": "investing",
        "created": 1630795183.0
    },
    {
        "author": "UncleFupa",
        "body": "The government wants domestic chip production with the ability to oversee and control the process...  Instead of doing this theirselves, they will be doing this through Intel.  There is no reason they would be doing this twice through two different companies.",
        "created_utc": 1630766841,
        "id": "hbko0yt",
        "score": 1,
        "subreddit": "investing",
        "created": 1630795641.0
    },
    {
        "author": "Imaginary_Trader",
        "body": "Interesting comment on AMD and KISS. I bought in pre-zen too, thought it looked promising, but did in no way think that Intel would be on 14nm for so long. Maybe I didn't research enough about Intel and the going-ons there but it's still shocking to me that AMD was able to bridge such a gap.",
        "created_utc": 1630602051,
        "id": "hbc5g3u",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1630630851.0
    },
    {
        "author": "th3cr1t1c",
        "body": "So AVGO is trading at a 25% premium to fair value.  INTC is trading at a 29% discount to Fair Value.\n\nUsing Gordon Growth Model (Dividend Discount Model), Intel's valuation is $22 per share.\n\nThat does not make either of these two attractive recommendations at this particular time.  It also is threatened by the expectation of chip shortages to extend into 2022-23 (Morningstar Research) by which time, FOMC action on interest rates may trigger a sell-off in the broader market.\n\n(Source: Am finance data analytics professional with 25 years professional experience and investing experience.)",
        "created_utc": 1630860186,
        "id": "hbpcxzz",
        "score": 1,
        "subreddit": "investing",
        "created": 1630888986.0
    },
    {
        "author": "Opeth4Lyfe",
        "body": "Because it’s trading rich right now. No matter how wonderful a company is it can still be over valued. Look at Intel, Cisco, GE, Amazon in the tech bubble. Tons of potential growth, lots of enthusiasm about their futures, no one thought they would go down. They corrected by as much as 90% in some cases…but on average lost 70% of their value. Amazon went from 113 to 6 but the company was in tremendous shape and growing incredibly fast. Would have taken over a decade to recover…and most of those companies are still not back at their previous ATH.",
        "created_utc": 1630878171,
        "id": "hbqh3eo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630906971.0
    },
    {
        "author": "not_creative1",
        "body": "As someone who works in this industry in silicon valley, main problem Intel has is talent. \n\nIntel has hemorrhaged talent to Apple, AMD, Nvidia over the last 5 years. Intel is no where near competitive in pay compared to those companies and are losing people left and right. I know several of my friends who left Intel for companies like Apple, qualcomm and so on.\n\nIntel needs a revival from the ground up. Intel has a massive layer of middle managers who dont do much but have been around for 10+ years and do not plan on moving. But the young talented engineers, who are the actual foot soldiers who work on the products are leaving in droves.\n\n\nIntel needs a complete overhaul of its culture, management and compensation structure. I dont know if they can do that in time.",
        "created_utc": 1630950754,
        "id": "hbu0gl9",
        "score": 1,
        "subreddit": "investing",
        "created": 1630979554.0
    },
    {
        "author": "kanye_psychiatrist",
        "body": "INTC hurt me and I don’t want to talk about it",
        "created_utc": 1630860719,
        "id": "hbpe5pn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630889519.0
    },
    {
        "author": "TheNewUsed",
        "body": "I decided to visually compare the stocks with &gt;2% yields. $INTC is a very clear outlier at \\~7x EV/EBITDA and a lower payout ratio than the other 3 companies. I prefer $INTC based on this chart and the turnaround I think they are going to have.   \n\n\nHere is the referenced chart: https://wiijii.co/chart/?id=-Mj07peGCyhMd4dwA9Xj",
        "created_utc": 1631033058,
        "id": "hby7fwb",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1631061858.0
    },
    {
        "author": "Jpg316",
        "body": "Good question, I'm wondering the same. They're in my neighborhood I might walk dog past their office and gather some intel.",
        "created_utc": 1631019962,
        "id": "hbxdf3e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631048762.0
    },
    {
        "author": "vansterdam_city",
        "body": "There are a lot of dividend related posts today but this might be the dumbest.\n\nA good dividend stock is something that you see a basically infinite time horizon for (let’s say 30 years). Coca Cola 30 years ago is a classic example, its a product that doesn’t change much and was likely be enjoyed by people for decades to come. \n\nTechnology is by nature prone to innovative disruption. This is horrible for the prospects of a dividend paying company. I couldn’t think of a worse two words to pair together on an investment choice. \n\nTechnology is for GROWTH as you disrupt the market. Buying into the mature end of the cycle is right when you are prone to being disrupted yourself by a new player. \n\nSome of your picks like Intel and Cisco could easily be disrupted and become dinosaurs. For a measly 2%-ish dividend? You have to be kidding me to think this is a sane investment thesis.",
        "created_utc": 1630944654,
        "id": "hbtmcnj",
        "score": 1,
        "subreddit": "investing",
        "created": 1630973454.0
    },
    {
        "author": "redhoy",
        "body": "Intel (INTC) - still cannot do new high in 20 years",
        "created_utc": 1630933008,
        "id": "hbsxol4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630961808.0
    },
    {
        "author": "hondajacka",
        "body": "Valuation is a function of growth. In the long term, if your company is not showing growth in revenue and earning, your valuation/stock price is not going to increase. \n\nI had changed what I said earlier about the higher revenue from fab. \n\nI do think Intel’s current products are better for enterprise, but going forward, it is much more likely AMD will catch up to those features and will keep putting pressure on Intel’s margins. And the reason I said AMD would have even more market share cause of supply constraints is because at least in the consumer segment and earlier this year, their CPUs have been difficult to find and overpriced when available. I wanted to buy an AMD PC but couldn’t and had to go with Intel.",
        "created_utc": 1631002974,
        "id": "hbwqdiv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631031774.0
    },
    {
        "author": "hondajacka",
        "body": "Cloud providers like Google knows and has chosen AMD over Intel for big data center contracts: https://www.crn.com/news/cloud/new-google-cloud-vms-with-amd-epyc-promise-top-price-performance",
        "created_utc": 1630932620,
        "id": "hbswzyx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630961420.0
    },
    {
        "author": "EchoooEchooEcho",
        "body": "I read in a book that exon or some other boomer oil company returns beat Intel or cisco returns from 80s or 90s to 2012. \n\nNvidia now is like Intel back then, leading edge tech but valued way to high.",
        "created_utc": 1630955094,
        "id": "hbuadcb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630983894.0
    },
    {
        "author": "papasmurftp",
        "body": "Yes he's looking for some intel",
        "created_utc": 1630514673,
        "id": "hb7fx2t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630543473.0
    },
    {
        "author": "BooBeef",
        "body": "Yes but it would have to grow 1500% for its current evaluation to be a fair price. It’s market cap is more then half of Intel’s but AMD makes 6 billion in revenue while INTEL makes 78 billion in revenue. So it’s potential growth is more then priced in, it can only go down from here",
        "created_utc": 1630591171,
        "id": "hbbewh1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630619971.0
    },
    {
        "author": "shortyafter",
        "body": "You don't have anything like Tesla or ARK funds, which is good.  I'm not deeply familiar with most of these companies, so I don't know what their revenue streams or growth prospects look like.  What I can say is that a lot of those names have been trading very high lately... AMD, Nvidia, TSM, ASML, etc. Those companies in particular all seem to have bright futures, but if there is any significant correction in tech stocks, you're very exposed, especially if you bought recently at high valuations.  You'll have very little margin of safety.\n\nAnd if there's any broader economic disruption, it's possible that not all of these companies make it out safe and sound, or at least as healthy as you'd like to seem them given current valuations.\n\nFor example, even good companies like Cisco didn't make it out in one piece from the dot-com bubble.  And old industry leaders like IBM and Intel have gotten hammered in the past two decades, while Microsoft made something of a surprise comeback after being declared dead around 2012.\n\nThe point is that if you've bought growth stories, that's OK, but it seems your whole portfolio is growth stories.  It's forward-looking.  Which is the idea, in a way, but IMO you want at least some of your portfolio dedicated to something that is solid in the present, and doesn't rely on a growth story in order to generate or even maintain returns.  The benefit of an ETF is you get a bit of everything, and even QQQ is quite diversified compared to your portfolio.  \n\nI'm new but this is my understanding of things.  I hope it made sense.",
        "created_utc": 1630586622,
        "id": "hbb54en",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630615422.0
    },
    {
        "author": "TitanOW",
        "body": "I’m a computer hardware technician by trade. I sold most of my Intel stock and bought AMD back at the end of 2017/early 2018 at $11/share. Just sold out when it hit $121/share, and look at intel’s price over the same period. This is the most solid advice you can give anyone",
        "created_utc": 1630963178,
        "id": "hbush65",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630991978.0
    },
    {
        "author": "SmallHandsMallMindS",
        "body": "They would do it if they didnt have a choice. Either TSMC builds that factory in Arizona or Intel does",
        "created_utc": 1630987966,
        "id": "hbw5y3t",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631016766.0
    },
    {
        "author": "hondajacka",
        "body": "As an investor, what matters is growth, which translates to increase in stock price. High revenue but no growth still means stagnant stock price. I don’t think Intel would go out of business but they are slowly loosing market share.\n\nAnd one of the reason why their revenue is so high is because they do design and fab, whereas AMD is fabless. Market share is a better comparison. AMD has 22.5% of the x86 market Q2 2021 vs 18.3% Q2 2020. And the main reason why AMD didn’t gain even more is because of supply constraints, which should normalize in 1-2 more years.\n\nI do agree Pat Gelsinger is trying his best to turn the company around, but changes in this industry take many years to materialize so in the meantime, you just have to take his word for it. IMO, the culture at Intel has become that like of a slow behemoth with fiefdoms where people are resistant to change. And compared to competitors, their employees are underpaid, not helped by their stagnant stock prices. So they are not attracting anywhere close to the best people.",
        "created_utc": 1630997894,
        "id": "hbwkg6o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631026694.0
    },
    {
        "author": "KevinJudice",
        "body": "I’ve been buying INTC this past month, I think it’s a really good value stock.",
        "created_utc": 1630933725,
        "id": "hbsyz0i",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1630962525.0
    },
    {
        "author": "BooBeef",
        "body": "Look at intel before 2017 - 2018. They were never increasing core counts on there desktop processors, and only did so at the end of 2018 early 2019 when AMD started releasing there RYZN and Thread-ripper  chipsets",
        "created_utc": 1630717596,
        "id": "hbillm3",
        "score": 1,
        "subreddit": "investing",
        "created": 1630746396.0
    },
    {
        "author": "senecadocet1123",
        "body": "yes, but I mean.. Visa is not that over valued right now: Intel was valued like 509 billion in August 2000. Visa is over valued, but at 45 p/e it's not too bad",
        "created_utc": 1630798515,
        "id": "hbmkz9s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630827315.0
    },
    {
        "author": "Pokesaurus_Rex",
        "body": "What? Intel is only semi-competitive with current AMD 7nm chips because Intel has been stuck on the same node for years not because they are equivalent in design or potential performance.\nIn order to compensate for this they have heavily optimised that node to the absolute limit hence the 14nm++++ meme thanks to the node being so mature. \n\nAlso the fact you just blanket said that Intel and AMD are equivalent without defining a use case and at the same time call me out saying \"I don't know much about semiconductors\" lol.",
        "created_utc": 1630998855,
        "id": "hbwlmf9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631027655.0
    },
    {
        "author": "MentalValueFund",
        "body": "Jesus Christ this is one of the dumbest responses ive ever read. As an investor, what matters is valuation, regardless of whether you’re a growth investor or a value investor. You buy and sell equities at a current valuation based on what the future will bring. If there’s a growth rate you expect, then you find the fair valuation according to your macro assumptions and bring it back to the present. \n\nLol, Intel’s revenues are not high because they run foundries. It’s their margins that are wider because of that. \n\nThe main reason why AMD didn’t gain more is because the commercial data center market doesn’t up and change chips every release. They run on 4-6 year cycles and trickle into new chip generations. This buys even more time for Intel to steady the bleeding and bring out adequate competitor to stabilize their market share. Despite your argument below with links about data center deals, Intel is still pumping out $7bn in pure data center products (up 16% yoy) while AMD only managed $1.6bn in “Enterprise, Embedded, and Semi-Custom” products (the specifically don’t split out data center because they don’t want everyone to see how uncompetitive they are with Intel financially). Finally there’s the fact that AMD’s data center product is just flat out immature. Cores aren’t everything and data centers stick with Intel because of the full suite of features and functionality at the enterprise level that AMD simply hasn’t caught up with.",
        "created_utc": 1630998720,
        "id": "hbwlgmb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631027520.0
    }
]