[
    {
        "author": "simplysufficient88",
        "body": "To be entirely fair here, this whole thing’s based on a really bad article title. Everyone’s quoting the CNN article that makes it sound as though the WFP director was claiming all you’d need is $6 billion to solve all hunger. When the actual statement he made was that it would help to fix the growth in world hunger issues we’ve seen recently, not that it would solve hunger entirely. He very specifically mentions that this is a one time donation that would help 42 million people that need immediate aid, but that wouldn’t be a long term fix. Even the CNN article itself now has a correction at the very bottom acknowledging this was a misleading title. \n\nObviously this is all an over simplification of the issue and you can’t just throw money at it to fix it, but the point he was trying to make wasn’t that one donation from one billionaire would permanently solve all hunger but that a one time donation from MULTIPLE of the world’s wealthiest individuals would help save a lot of people in the short term. I think that’s a pretty massive difference.",
        "created_utc": 1635772963,
        "id": "hivq68e",
        "permalink": "/r/wallstreetbets/comments/qkcpmq/how_to_solve_world_hunger_just_plow_it_back_in/hivq68e/",
        "score": 3191,
        "subreddit": "wallstreetbets",
        "created": 1635801763.0
    },
    {
        "author": "wtf-am-I-doing-69",
        "body": "One more thing. He does it this year under a known 2021 tax code \n\nHe knows things may change for 2022 and it won't be for the better. \n\nSell now pay capital gains tax, exercise.options now pay tax under 2021 rules\n\nMuch better than waiting",
        "created_utc": 1636307447,
        "id": "hjp6z42",
        "permalink": "/r/wallstreetbets/comments/qorwlq/why_elon_musk_will_definitely_sell_10_of_his_stock/hjp6z42/",
        "score": 2239,
        "subreddit": "wallstreetbets",
        "created": 1636336247.0
    },
    {
        "author": "Prudent_Media_4067",
        "body": "They have over 7,000 homes they bought for over market value that they are now trying to dump on the market at a discount. They are bleeding money.",
        "created_utc": 1635962372,
        "id": "hj6ea0x",
        "permalink": "/r/stocks/comments/qm05h4/z_zillow_is_now_down_25_in_a_single_day_and_at/hj6ea0x/",
        "score": 2173,
        "subreddit": "stocks",
        "created": 1635991172.0
    },
    {
        "author": "ABuddingScientist",
        "body": "Okay, now what if I whipped it all out and I'm still last?",
        "created_utc": 1635830275,
        "id": "hiz8ohm",
        "permalink": "/r/wallstreetbets/comments/qkwu9l/rules_to_live_by/hiz8ohm/",
        "score": 1698,
        "subreddit": "wallstreetbets",
        "created": 1635859075.0
    },
    {
        "author": "Powerful_Stick_1449",
        "body": "MSFT.... their cloud growth is exponential, they have no anti-trust heat right now, and their gaming segment is making acquisition after acquisition.",
        "created_utc": 1635798955,
        "id": "hixeoo5",
        "permalink": "/r/stocks/comments/qkmmmq/if_you_could_put_3k_into_aapl_msft_or_fb_which/hixeoo5/",
        "score": 1285,
        "subreddit": "stocks",
        "created": 1635827755.0
    },
    {
        "author": "trapmitch",
        "body": "Then you also have consumer asset backed securities which is an entirely different beast. \n\nBasically Netflix can take loans out on their subscribers months/years in advance as projected revenues.  Because it’s only 10 dollars a month per person if one person stops subscribing not a big deal. However if everybody stopped subscribing well… \n\nI think the problem is going to be these subscriptions and buy now pay later services are really going to start adding up to the point average people are paying over a thousand dollars a month just in subscriptions. You have Netflix Hulu Spotify Apple Music peloton gym memberships etc etc it’s going to add up pretty quickly and we might see a mass exodus from these subscription based models causing whoever bought those securities about to get fucked in the ass",
        "created_utc": 1636559855,
        "id": "hk2xghy",
        "permalink": "/r/wallstreetbets/comments/qqw2pw/china_pulled_an_08_and_i_feel_we_are_fucked/hk2xghy/",
        "score": 1069,
        "subreddit": "wallstreetbets",
        "created": 1636588655.0
    },
    {
        "author": "Retartedinvesments",
        "body": "I will have kids in future , can I claim them as dependents now?",
        "created_utc": 1636312557,
        "id": "hjpk4rt",
        "permalink": "/r/wallstreetbets/comments/qova51/_/hjpk4rt/",
        "score": 1023,
        "subreddit": "wallstreetbets",
        "created": 1636341357.0
    },
    {
        "author": "AllNORNADA",
        "body": "Congratulations hopefully you Have a half milli in cash rt now",
        "created_utc": 1636082944,
        "id": "hjdfw3o",
        "permalink": "/r/wallstreetbets/comments/qn18wf/44k_yolo_to_720k_in_2_weeks/hjdfw3o/",
        "score": 884,
        "subreddit": "wallstreetbets",
        "created": 1636111744.0
    },
    {
        "author": "skilliard7",
        "body": "Now the fact that they stopped buying homes makes a lot of sense.",
        "created_utc": 1635887120,
        "id": "hj27xel",
        "permalink": "/r/stocks/comments/qldokl/zillow_fires_25_of_staff_takes_304_million_write/hj27xel/",
        "score": 812,
        "subreddit": "stocks",
        "created": 1635915920.0
    },
    {
        "author": "BlueWhaleValue",
        "body": "I believe my odds are substantially higher than the outcome of roulette. My strategy is simple, I strongly believe Tesla will have a sharp dip/drop. I don't know when, but it will. My odds of it happening increase on every pump giving the fact the next stock Tesla would overcome is actually Amazon, then Google. This is not a small market cap stock with unlimited upside, it's running out of room in my opinion. Although it is possible for Tesla to temporarily surpass these companies because of how irrational the market is. (True valuation clearly doesn't matter here) the point here is, its current price may be fair for Tesla but in the future. Not now, the bulls got too greedy too soon.  The argument that Tesla is should not be worth more than companies like Amazon and Google is strong, of course, those companies will grow in value as well where things fall back into a reasonable line.  But, it goes back to square one, too high, too fast, too soon. None of the bull's arguments defend Tesla during a harsh red week or month in the market, worse a crash. We all know based on history Tesla would be the first to go.   \n\n\nDon't get me wrong. I strongly believe Tesla deserves a high valuation. I am all for a $1 Trillion even upwards of a $3 trillion market cap, but all with given time. Too fast, too high, too soon. The cult-like following on Tesla is built of money craving impatient newbs, which a good amount of run away at first sight of a change or new hype. Panic, profit takers. During that time, when it comes, id like to have my turn in making a profit. I rather bet on a dip with such high numbers than bet on an even further run. Then again, even if it goes up we go back to square one, I increase my odds averaging up.  This is a shorter-term strategy, not a Perma bear case.",
        "created_utc": 1635808429,
        "id": "hiy11bt",
        "permalink": "/r/wallstreetbets/comments/qknynb/1_million_dollar_tesla_short_tsla_part_2_executed/hiy11bt/",
        "score": 803,
        "subreddit": "wallstreetbets",
        "created": 1635837229.0
    },
    {
        "author": "Illustrious-Ratio-41",
        "body": "The 500 million he claims America is on the hook for is the true funny part 😆\n\nIf China falls into an economic depression now, you’re gonna be worried about a lot more than that OP. Drop in the bucket.",
        "created_utc": 1636556082,
        "id": "hk2o6wr",
        "permalink": "/r/wallstreetbets/comments/qqw2pw/china_pulled_an_08_and_i_feel_we_are_fucked/hk2o6wr/",
        "score": 765,
        "subreddit": "wallstreetbets",
        "created": 1636584882.0
    },
    {
        "author": "playoutsideplay",
        "body": "I didn’t want you then, and I don’t want you now",
        "created_utc": 1635798533,
        "id": "hixdmif",
        "permalink": "/r/wallstreetbets/comments/qkmjzg/yoy_progress_2m_12_4m_10m_diversified_between/hixdmif/",
        "score": 732,
        "subreddit": "wallstreetbets",
        "created": 1635827333.0
    },
    {
        "author": "Parking-Secretary-87",
        "body": "How come they look older then, than now😅",
        "created_utc": 1636203632,
        "id": "hjjnbn2",
        "permalink": "/r/wallstreetbets/comments/qnygmr/back_in_2004/hjjnbn2/",
        "score": 692,
        "subreddit": "wallstreetbets",
        "created": 1636232432.0
    },
    {
        "author": "scleon7397",
        "body": "Now you can go buy one of their houses they are selling for a loss to really rub it in",
        "created_utc": 1635954413,
        "id": "hj5t3zw",
        "permalink": "/r/wallstreetbets/comments/qlv4d2/160k_zillow_gain/hj5t3zw/",
        "score": 683,
        "subreddit": "wallstreetbets",
        "created": 1635983213.0
    },
    {
        "author": "YoogleFoogle",
        "body": "I took a 15% pay cut to work remotely.  Now that’s looking like 20% less purchasing power.  Oof",
        "created_utc": 1636561107,
        "id": "hk30l9o",
        "permalink": "/r/wallstreetbets/comments/qqutgr/inflation_hit_30_year_high_in_october_of_62/hk30l9o/",
        "score": 641,
        "subreddit": "wallstreetbets",
        "created": 1636589907.0
    },
    {
        "author": "GrapeJuicex",
        "body": "Jack: Are you insane? Think about the jobs! The economy! This is GE!\n\nBanks: It's just G now, Jack. I sold the E. To Samsung. They're Samesung now.",
        "created_utc": 1636466630,
        "id": "hjxpqu1",
        "permalink": "/r/stocks/comments/qq2xvs/general_electric_to_split_itself_into_three/hjxpqu1/",
        "score": 620,
        "subreddit": "stocks",
        "created": 1636495430.0
    },
    {
        "author": "HolyTurd",
        "body": "Hey man, when we all can't afford rent anymore, we can just put on our Occulus and transform our makeshift tent into a mansion. That street pigeon that we roasted over a garbage fire? Well, now its a plate of duck confit.",
        "created_utc": 1636473620,
        "id": "hjy5qqk",
        "permalink": "/r/stocks/comments/qq5x3m/facebooks_pivot_to_meta_iswellcreepy_and/hjy5qqk/",
        "score": 558,
        "subreddit": "stocks",
        "created": 1636502420.0
    },
    {
        "author": "Adorable_Ad8515",
        "body": "Sex is nasty, girls are disgusting ewwwww .... try making 100k in a day and then go play some Xbox live, now that shit gets me hard.",
        "created_utc": 1635958538,
        "id": "hj643p0",
        "permalink": "/r/wallstreetbets/comments/qlwu20/spy_500_sex/hj643p0/",
        "score": 547,
        "subreddit": "wallstreetbets",
        "created": 1635987338.0
    },
    {
        "author": "theeberk",
        "body": "A few things to be aware of…\n1. They’ve been talking about this infrastructure bill for *many* months. Everybody that matters in the market knows what it is, and they all knew it was going to pass the house. Remember, it had strong support by both parties in the senate months ago when it was passed. People have mentioned buying related ETFs (I.e PAVE) and construction companies (like CAT) for that entire time for this reason. Basically, it’s priced in.\n\n2. Besides allowing for news,  speculation and possibly improved forward guidance (all priced in imo) this bill isn’t going to make these companies more valuable overnight. It will take a long time for them to get these projects/money, and even longer for them to report their financial improvements from this, which does have an impact on stock prices. Even then, this is probably priced in.\n\nI hesitate to say this is 100% priced in right now because there are probably retail traders buying in, but the term “sell the news” exists for a reason. In general, retail traders tend to buy the top and sell at the bottom, and this event will (probably not) be an exception.",
        "created_utc": 1636226710,
        "id": "hjl3qrc",
        "permalink": "/r/wallstreetbets/comments/qo6219/what_stocks_will_surge_with_the_passage_of_the/hjl3qrc/",
        "score": 537,
        "subreddit": "wallstreetbets",
        "created": 1636255510.0
    },
    {
        "author": "circdenomore",
        "body": "Where is that retard posing as a dentist now!?",
        "created_utc": 1636414165,
        "id": "hjv91tl",
        "permalink": "/r/wallstreetbets/comments/qppebv/ive_officially_become_a_bagholder/hjv91tl/",
        "score": 510,
        "subreddit": "wallstreetbets",
        "created": 1636442965.0
    },
    {
        "author": "neko1985",
        "body": "Now make it $12 again.",
        "created_utc": 1635801673,
        "id": "hixlal3",
        "permalink": "/r/wallstreetbets/comments/qkmjzg/yoy_progress_2m_12_4m_10m_diversified_between/hixlal3/",
        "score": 505,
        "subreddit": "wallstreetbets",
        "created": 1635830473.0
    },
    {
        "author": "ConradSchu",
        "body": "He gave out great advice when he was posting on here and engaged with the wsb community (back when it was very different from what it is now). He explained a lot of his controversies and some made sense. He gave honest insight on DD and tried to help people trade better.\n\nI won't defend his criminal actions at all. He deserved what he got. But from my own personal observations and interactions, he was a pretty decent guy here.\n\nPlus he personally triggered an actual infinity squeezes with KBIO. Went up over 10,000% in 5 days. Not that says shit about his character, I just think it's a neat fact.",
        "created_utc": 1636493301,
        "id": "hjzjazg",
        "permalink": "/r/wallstreetbets/comments/qq7cle/i_watched_all_martin_shkreli_videos_on_investing/hjzjazg/",
        "score": 502,
        "subreddit": "wallstreetbets",
        "created": 1636522101.0
    },
    {
        "author": "Dracklfaggot",
        "body": "When Jerome was started saying \"transitory\" 8 months ago, what he actually *meant* was that \"Inflation was going to transition right up your ass and fuck you, because I don't actually care, now watch me print some more money to artificially pump the bond market\"",
        "created_utc": 1636551530,
        "id": "hk2e74w",
        "permalink": "/r/stocks/comments/qqukg1/consumer_price_index_surges_62_in_october/hk2e74w/",
        "score": 501,
        "subreddit": "stocks",
        "created": 1636580330.0
    },
    {
        "author": "PaloLV",
        "body": "When the actual spending is analyzed 10 years from now it will be revealed that little or nothing was spent on internet infrastructure and all the money disappeared into the hands of executives and shareholders.",
        "created_utc": 1636193733,
        "id": "hjj83z6",
        "permalink": "/r/investing/comments/qnvzaw/congress_passes_12t_infrastructure_bill/hjj83z6/",
        "score": 494,
        "subreddit": "investing",
        "created": 1636222533.0
    },
    {
        "author": "crjlsm",
        "body": "This is quietly the biggest story in the stock market right now.",
        "created_utc": 1636008099,
        "id": "hj94qlv",
        "permalink": "/r/wallstreetbets/comments/qmccl8/gme_updates_rocket_looks_imminent_strap_in_boys/hj94qlv/",
        "score": 471,
        "subreddit": "wallstreetbets",
        "created": 1636036899.0
    },
    {
        "author": "thetrappster",
        "body": "I've sold and re-bought Tesla shares since 2013. If I had bigger balls and held on to the shares I'd bought in 2013, I'd nearly be a millionaire right now. \n\n\nI'm holding.",
        "created_utc": 1635803147,
        "id": "hixouql",
        "permalink": "/r/stocks/comments/qko4qu/tsla_owners_what_are_your_moves/hixouql/",
        "score": 457,
        "subreddit": "stocks",
        "created": 1635831947.0
    },
    {
        "author": "robbinhood69",
        "body": "I hope this is obvious to you but do not keep yolo'ing ur entire stack on weekly options\n\nIt's fine when ur doing it on amounts that you could conceivably make back working for a decade or whatever\n\nBut it is damn near impossible to build up 700k liquid working for income. \n\n&amp;#x200B;\n\nU fucking made it. Now scale this waaaaay back and put a lot of this into a diversified basket of shares\n\nAnd keep yolo'ing with liek 30k again or whatever.",
        "created_utc": 1636086902,
        "id": "hjdmvbg",
        "permalink": "/r/wallstreetbets/comments/qn18wf/44k_yolo_to_720k_in_2_weeks/hjdmvbg/",
        "score": 453,
        "subreddit": "wallstreetbets",
        "created": 1636115702.0
    },
    {
        "author": "carnewbie911",
        "body": "Bottom line, Elon did a very good PR move. Selling the stock was a must option, regardless of the Twitter vote.\n\nNow Elon has more zombie fan boys",
        "created_utc": 1636368647,
        "id": "hjsg520",
        "permalink": "/r/wallstreetbets/comments/qpb1t8/forget_elons_poll_the_tax_has_to_be_paid_on_tesla/hjsg520/",
        "score": 445,
        "subreddit": "wallstreetbets",
        "created": 1636397447.0
    },
    {
        "author": "DaShaka9",
        "body": "and if they were, they definitely aren’t now.",
        "created_utc": 1635896120,
        "id": "hj2ugee",
        "permalink": "/r/wallstreetbets/comments/qlaurk/my_car_short_into_earnings_life_savings_and_some/hj2ugee/",
        "score": 433,
        "subreddit": "wallstreetbets",
        "created": 1635924920.0
    },
    {
        "author": "xtrmist",
        "body": "It's a company that has lost its way and the quality of their games have been spiraling downwards for a long time. Every expansion for world of warcraft gets worse and people are starting to break their addiction of always returning. The lawsuit is a disaster and now they're removing stuff from the games instead of adding more to keep people around.\n\nWouldn't touch this.",
        "created_utc": 1635960214,
        "id": "hj68k38",
        "permalink": "/r/StockMarket/comments/qlvgc4/anybody_like_activision_right_now_its_down_about/hj68k38/",
        "score": 419,
        "subreddit": "StockMarket",
        "created": 1635989014.0
    },
    {
        "author": "Illuminati_gang",
        "body": "Next tweet: The deal is now signed guys!\n\nTesla stock: I'll fuckn do it again!",
        "created_utc": 1635854571,
        "id": "hj02675",
        "permalink": "/r/stocks/comments/ql1oa6/musk_says_hertz_deal_isnt_signed_and_questions/hj02675/",
        "score": 410,
        "subreddit": "stocks",
        "created": 1635883371.0
    },
    {
        "author": "Sweaty-Glove-718",
        "body": "It’s all public Information, there was a TikTok guy who tracked it for you and made videos on it. Right now Merck &amp; co and Nvidia have a lot of political money in them. Meaning they know something we don’t",
        "created_utc": 1636043330,
        "id": "hjaszr8",
        "permalink": "/r/wallstreetbets/comments/qmoduf/nvidia_options_are_paying_off_i_just_followed/hjaszr8/",
        "score": 406,
        "subreddit": "wallstreetbets",
        "created": 1636072130.0
    },
    {
        "author": "IAmInTheBasement",
        "body": "I'm going to tell you right now exactly what this is all about.\n\nRight now Elon has about 25 billion dollars worth of options that if he chooses to exercise will have to have taxes paid on them. And I don't mean the namby-pamby 20% capital gains tax, these are going to be paid as if they were earned income.\n\nSo to deal with that his choice is either to take out a huge loan for all of the tax value and the cost to exercise.\n\nOr sell some of his existing stock, pay the much smaller capital gains on it, and use the money freed up there to exercise the options and pay the income tax.\n\nBeyond those two likely options the only third option would be to not exercise the options and let them expire worthless.\n\nThis tweet is all about framing the decision for public perception. He's already made up his mind and run the numbers.",
        "created_utc": 1636236786,
        "id": "hjlqef0",
        "permalink": "/r/wallstreetbets/comments/qo8kyk/elon_musk_will_ditch_over_20_billion_dollars_of/hjlqef0/",
        "score": 406,
        "subreddit": "wallstreetbets",
        "created": 1636265586.0
    },
    {
        "author": "kyle_h2486",
        "body": "So I can short companies in two counties now with the same strategy. Interesting….",
        "created_utc": 1635949211,
        "id": "hj5fx61",
        "permalink": "/r/wallstreetbets/comments/qltwea/after_researching_chinese_companies_everything/hj5fx61/",
        "score": 405,
        "subreddit": "wallstreetbets",
        "created": 1635978011.0
    },
    {
        "author": "Stock_Candle",
        "body": "If losing 2months of gains scares you quit now before you hurt yourself",
        "created_utc": 1636119226,
        "id": "hjevjcw",
        "permalink": "/r/StockMarket/comments/qnamb0/im_about_to_lose_everything_i_have_gained_in_the/hjevjcw/",
        "score": 400,
        "subreddit": "StockMarket",
        "created": 1636148026.0
    },
    {
        "author": "WeLoveTheStonks",
        "body": "Ya see the amount of deleted comments?  Moderator is putting in work right now, lmao.",
        "created_utc": 1636123586,
        "id": "hjf5sdm",
        "permalink": "/r/investing/comments/qn9o7d/pfizer_says_its_covid_pill_with_hiv_drug_cuts_the/hjf5sdm/",
        "score": 382,
        "subreddit": "investing",
        "created": 1636152386.0
    },
    {
        "author": "atdharris",
        "body": "Shiller himself said you cannot look at this because it does not factor where interest rates are. Rates in 1999 were 4.5-5.5%. If they were at that level today, we'd be nowhere near where we are now.",
        "created_utc": 1636128768,
        "id": "hjfj1ge",
        "permalink": "/r/investing/comments/qnbd8x/shiller_pe_just_exceeded_40_for_the_first_time/hjfj1ge/",
        "score": 378,
        "subreddit": "investing",
        "created": 1636157568.0
    },
    {
        "author": "GhostOfAscalon",
        "body": "https://labornotes.org/2021/10/lets-put-wrench-things-now-deere-workers-strike-company-rakes-record-profits\n\nhttps://uaw.org/wp-content/uploads/2021/10/DEERE-Summary-Revised-Final-bug.pdf\n\n&gt; Deere claimed that workers typically make $60,000 a year, and that the new contract would bring workers up to almost $72,000 per year. But that figure assumes year-round full-time work—ignoring Deere’s common seasonal layoffs, which can range from weeks to months.\n\nSounds like a terrible place to work\n\n&gt; Members also got to hear the company’s initial offer, which contained a host of concessions, at strike authorization meetings in September. Deere proposed ending the plant closure moratorium, doing away with overtime pay after eight hours, eliminating seniority-based wage progressions, forcing workers to pay 20 percent of their health insurance premiums, and many other draconian concessions.\n\nFantastic idea with labor in the strongest position it's been in for decades",
        "created_utc": 1636002263,
        "id": "hj8x3pn",
        "permalink": "/r/stocks/comments/qm9ap5/deere_says_its_done_bargaining_after_striking/hj8x3pn/",
        "score": 367,
        "subreddit": "stocks",
        "created": 1636031063.0
    },
    {
        "author": "Holle444",
        "body": "Watch. It gets passed. Then it gets extended to everyone, not just the ultra rich. The ultra rich will lobby for a legal loophole. They will get out of paying the tax, while everyone else now pays for unrealized gains. Change my mind.",
        "created_utc": 1636094493,
        "id": "hjdxanf",
        "permalink": "/r/wallstreetbets/comments/qn0ohd/its_a_fugayzee_fugahzee_its_imaginary/hjdxanf/",
        "score": 351,
        "subreddit": "wallstreetbets",
        "created": 1636123293.0
    },
    {
        "author": "10111010001101011110",
        "body": "It’s about 50 people whose whole identity revolves around hating Musk. They are much more focused on SpaceX now that Tesla is profitable.",
        "created_utc": 1635944369,
        "id": "hj554jb",
        "permalink": "/r/wallstreetbets/comments/qls92p/tesla_sells_1_of_global_car_sales_and_is_worth/hj554jb/",
        "score": 326,
        "subreddit": "wallstreetbets",
        "created": 1635973169.0
    },
    {
        "author": "616sd",
        "body": "You have achieved the privilege to fuck your wife’s boyfriend now! You did it!",
        "created_utc": 1636509039,
        "id": "hk0jpts",
        "permalink": "/r/wallstreetbets/comments/qqiv8d/helluva_year_6k_to_23m_and_its_not_over_yet/hk0jpts/",
        "score": 325,
        "subreddit": "wallstreetbets",
        "created": 1636537839.0
    },
    {
        "author": "Hourglass420",
        "body": "Yeah, because hanging out with 23 yo annoys me now... I can't imagine how annoyed I would be at his age.",
        "created_utc": 1636393907,
        "id": "hjtvaj7",
        "permalink": "/r/wallstreetbets/comments/qpgdtr/personality_money_for_women_just_dont_be_a_poor/hjtvaj7/",
        "score": 311,
        "subreddit": "wallstreetbets",
        "created": 1636422707.0
    },
    {
        "author": "IAmInTheBasement",
        "body": "It's true. I was crazy pumped to hit six figures, which at the time was \\~3x growth from where I was \\~4 months before that point.\n\nNow I'm hovering at \\~700k. Hitting 7 digits is going to be nutz.",
        "created_utc": 1636391339,
        "id": "hjtoszl",
        "permalink": "/r/stocks/comments/qphjri/just_hit_100k_my_first_milestone/hjtoszl/",
        "score": 296,
        "subreddit": "stocks",
        "created": 1636420139.0
    },
    {
        "author": "Double_Instance_3227",
        "body": "NOW DO IT AGAIN WITH 100k and post your loss porn here :)",
        "created_utc": 1636065273,
        "id": "hjcclr1",
        "permalink": "/r/wallstreetbets/comments/qmtptf/i_did_it_10k_to_100k_ytd_brought_to_you_mostly_by/hjcclr1/",
        "score": 278,
        "subreddit": "wallstreetbets",
        "created": 1636094073.0
    },
    {
        "author": "PAPA_Emc2",
        "body": "For all the negativity I havent seen many 🏳️‍🌈🐻 positions being posted? \n\nI think its will GME explode the market, or will the market show the world that only big industry insiders are allowed to win? Both scenerios destroy the market… either way ill happily “hold these bags” \n\nRarely do you get a chance to invest in a new, debt free, dream team, market evolving company ahead of changing online commerce forever. Then again its also just a brick and mortar retail resale store and its gonna go bankrupt any day now.\n\n🙄",
        "created_utc": 1636249009,
        "id": "hjmgoht",
        "permalink": "/r/wallstreetbets/comments/qocmul/too_true/hjmgoht/",
        "score": 277,
        "subreddit": "wallstreetbets",
        "created": 1636277809.0
    },
    {
        "author": "NottaGoon",
        "body": "You have no idea what we are in for.\r  \n\r  \nI started a business distributing food products to schools nationally. We own some brands others we don't. It is the worst environment I've ever seen across the board.\r  \n\r  \nLabor is the biggest issue. There aren't enough food workers to run the food service programs. I've seen 2 employees feeding thousands of kids when there were 20 there pre pandemic. This means their buying habits have changed to prepackaged goods sometimes doubling their food cost.\r  \n\r  \nThe manufacturers can't keep up with the shift in demand as they are shortstaffed as well.\r  \n\r  \nFreight has gone up 3-4x since pandemic domestically because their aren't enough truck drivers. One of my competitors canceled 78 contracts to provide them food at the start of the school year. It is chaos.\r  \n\r  \nTheir aren't enough truck drivers to move things in a timely manner. I'm waiting 2 months at times for things at the port. My price per container has gone from $4400 pre pandemic to $27,500! A case of fruit has gone up 250%!\r  \n\r  \nMost of my cogs are close to doubling. I pass that along and now most are struggling to buy food for our most valuable resource, kids.\r  \n\r  \nUSDA is now offering free lunches to every kid but who is going to pay for that?\r  \n\r  \nIt's bad. I'm selling my company for what I can get for it. I see the writing on the wall.",
        "created_utc": 1636561828,
        "id": "hk32ewc",
        "permalink": "/r/wallstreetbets/comments/qqutgr/inflation_hit_30_year_high_in_october_of_62/hk32ewc/",
        "score": 267,
        "subreddit": "wallstreetbets",
        "created": 1636590628.0
    },
    {
        "author": "roox911",
        "body": "their AI buying algorithm was taking them to the cleaners.. i've been following properties they have been buying in Florida, and a lot of them are poorly kept, and require massive renos.  The craziest one i saw was a house last sold in late 2017 for $50,000 - zillow bought it 3 years later for $425,000... a 750% increase.  It's now been sitting for 4 months, in a place where the average sale time is around a week.",
        "created_utc": 1635891861,
        "id": "hj2k3rm",
        "permalink": "/r/stocks/comments/qldokl/zillow_fires_25_of_staff_takes_304_million_write/hj2k3rm/",
        "score": 256,
        "subreddit": "stocks",
        "created": 1635920661.0
    },
    {
        "author": "OptionLoserSupreme",
        "body": "There is literally no mathematical way for this to work. If you are starting at 10-20k, selling LEAPs or buying what ever will not result the amount you have now. \n\nBy doing 2 years out- all you have done is say that you did not make a single trade in between those years, meaning all your profit came from that CC and rising stock price- but your stock couldn’t have made you think much because then your premiums would be way too small. And your premiums couldn’t make this in 2 years since your gain on stock is too large. \n\nShow the covered calls- you should only have few sell records since you did LEAPS- so it shouldn’t be a problem. \n\n99% there is no way this is covered calls. Especially in 2 years- you do not get over 20000% in those. And that 1% are retarded that do 100 trades a day and got lucky on ALL of them.",
        "created_utc": 1636473601,
        "id": "hjy5p28",
        "permalink": "/r/wallstreetbets/comments/qq40qs/started_with_about_1012k_beginning_of_last_year/hjy5p28/",
        "score": 254,
        "subreddit": "wallstreetbets",
        "created": 1636502401.0
    },
    {
        "author": "thatissomeBS",
        "body": "You could give me $1b right now and I'd still be worth &lt;$1b.",
        "created_utc": 1636210626,
        "id": "hjk2cek",
        "permalink": "/r/wallstreetbets/comments/qnygmr/back_in_2004/hjk2cek/",
        "score": 250,
        "subreddit": "wallstreetbets",
        "created": 1636239426.0
    },
    {
        "author": "bobbymatthews84",
        "body": "Is G'merica now son.",
        "created_utc": 1636312275,
        "id": "hjpjet6",
        "permalink": "/r/wallstreetbets/comments/qouux4/whhooooooosshh/hjpjet6/",
        "score": 242,
        "subreddit": "wallstreetbets",
        "created": 1636341075.0
    },
    {
        "author": "thatguy425",
        "body": "The entire company is making acquisitions. If they can’t buy something they will throw enough engineers at it to make something better. Probably the best stock you could own right now for a long hold.",
        "created_utc": 1635804782,
        "id": "hixsp95",
        "permalink": "/r/stocks/comments/qkmmmq/if_you_could_put_3k_into_aapl_msft_or_fb_which/hixsp95/",
        "score": 235,
        "subreddit": "stocks",
        "created": 1635833582.0
    },
    {
        "author": "Berto_",
        "body": "Too big to fail. \nIt's now their problem.",
        "created_utc": 1635971095,
        "id": "hj7102r",
        "permalink": "/r/wallstreetbets/comments/qm30db/i_made_an_illegal_trade_and_tda_said_i_owe_26/hj7102r/",
        "score": 233,
        "subreddit": "wallstreetbets",
        "created": 1635999895.0
    },
    {
        "author": "CamelBest",
        "body": "FKK YEAHHH, I’m 19 as well and put 15k into GameStop at $30 and have been riding ever since, portfolios worth around 200k now!!! WERE IN THIS  FOR THE LONG RUN AND TO FK THE HEDGIES UPPP",
        "created_utc": 1635788650,
        "id": "hiwpd3y",
        "permalink": "/r/wallstreetbets/comments/qkj462/48k_gme_gains_at_19_years_old_been_holding_since/hiwpd3y/",
        "score": 225,
        "subreddit": "wallstreetbets",
        "created": 1635817450.0
    },
    {
        "author": "Phreeker27",
        "body": "PayPal somehow froze my account, I’ve used pay pal like 10 times in a decade I had it, I only used it when forced, now I have 75$ frozen for over a year with 0 customer support. So yes I agree if they can just steal money they will be able to post good profits",
        "created_utc": 1636506908,
        "id": "hk0ezrj",
        "permalink": "/r/StockMarket/comments/qqhbra/buy_paypal_stock_now/hk0ezrj/",
        "score": 218,
        "subreddit": "StockMarket",
        "created": 1636535708.0
    },
    {
        "author": "SexySPACsMan",
        "body": "Why exactly? They're the future of cars now, but before long they'll just be the present of cars and we can see how those are valued. Eventually profit matters\n\nThe EV bubble is the modern Dot Com bubble",
        "created_utc": 1635883390,
        "id": "hj1y3lv",
        "permalink": "/r/wallstreetbets/comments/qlb35d/yo_seriously_what_the_shit_would_tesla_even_need/hj1y3lv/",
        "score": 216,
        "subreddit": "wallstreetbets",
        "created": 1635912190.0
    },
    {
        "author": "overthetop7223",
        "body": "I guess I really need to watch this squid game now",
        "created_utc": 1636376754,
        "id": "hjsrz9g",
        "permalink": "/r/wallstreetbets/comments/qpbopa/red_light/hjsrz9g/",
        "score": 215,
        "subreddit": "wallstreetbets",
        "created": 1636405554.0
    },
    {
        "author": "Fletchiver",
        "body": "\nSo what im hearing is, if the result is\"Yes\" you're better off selling now and then rebuying once the price has finished dropping. However if the result is \"No\" we will still see the price dip slightly for a day or two, just due to the uncertainty that has been kicked up from the tweet.",
        "created_utc": 1636291911,
        "id": "hjo65ea",
        "permalink": "/r/StockMarket/comments/qoojdr/tsla_time_to_vote/hjo65ea/",
        "score": 205,
        "subreddit": "StockMarket",
        "created": 1636320711.0
    },
    {
        "author": "Im_A_MechanicalMan",
        "body": "The bigger question is:  Will retail traders cut and run when they see the price dip?\n\nor\n\nWill retail traders buy more because the share price is now very low!",
        "created_utc": 1636296137,
        "id": "hjoeyzd",
        "permalink": "/r/wallstreetbets/comments/qooebv/elons_playing_4d_chess/hjoeyzd/",
        "score": 202,
        "subreddit": "wallstreetbets",
        "created": 1636324937.0
    },
    {
        "author": "AleHaRotK",
        "body": "I live in a country with an annual inflation of over 50%.\n\nInflation does come with a delay, what the FED does now will not change the current inflation rate, there's usually a 12~18 months delay between inflation and the actual FED actions.\n\nPeople in the US are just not used to it, if I was you I wouldn't worry too much, inflation is actually moving very slowly and many prices are actually related to supply chain issues due to COVID among other things. I say you gotta wait a whole full year give or take starting from now to make up your mind.",
        "created_utc": 1636551698,
        "id": "hk2ejdo",
        "permalink": "/r/stocks/comments/qqukg1/consumer_price_index_surges_62_in_october/hk2ejdo/",
        "score": 198,
        "subreddit": "stocks",
        "created": 1636580498.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[Props to whomever sold the puts and will now be living down on skid row after having to bankrupt themselves to buy those shares.](https://youtu.be/IqcRlyJhCb0?t=386)",
        "created_utc": 1636140573,
        "id": "hjgdwik",
        "permalink": "/r/wallstreetbets/comments/qnbbkc/278k_gain_on_peloton_puts/hjgdwik/",
        "score": 193,
        "subreddit": "wallstreetbets",
        "created": 1636169373.0
    },
    {
        "author": "mr_p2p",
        "body": "someone did suggest we put all the debt on someone and then kill him, i think it’s happening now.",
        "created_utc": 1635983096,
        "id": "hj7uc6f",
        "permalink": "/r/wallstreetbets/comments/qm30db/i_made_an_illegal_trade_and_tda_said_i_owe_26/hj7uc6f/",
        "score": 184,
        "subreddit": "wallstreetbets",
        "created": 1636011896.0
    },
    {
        "author": "snark_enterprises",
        "body": "Mr. Bezos has instructed me to advise all those that have made fun of him that your Prime accounts are now de-Activated. This can be remedied by issuing a public apology to him for hurting his feelers.",
        "created_utc": 1636394673,
        "id": "hjtx7qq",
        "permalink": "/r/wallstreetbets/comments/qpgdtr/personality_money_for_women_just_dont_be_a_poor/hjtx7qq/",
        "score": 182,
        "subreddit": "wallstreetbets",
        "created": 1636423473.0
    },
    {
        "author": "HarrisLam",
        "body": "they both look so much healthier now.  This photo looks like a meeting of the cancer survivor club wtf",
        "created_utc": 1636201830,
        "id": "hjjk2x4",
        "permalink": "/r/wallstreetbets/comments/qnygmr/back_in_2004/hjjk2x4/",
        "score": 180,
        "subreddit": "wallstreetbets",
        "created": 1636230630.0
    },
    {
        "author": "TheShaneHaley",
        "body": "First ones free. Now yolo those gains on something that will lead you to post a bigger loss porn!",
        "created_utc": 1636123067,
        "id": "hjf4hfv",
        "permalink": "/r/wallstreetbets/comments/qnci3t/my_first_time_ever_doin_options/hjf4hfv/",
        "score": 178,
        "subreddit": "wallstreetbets",
        "created": 1636151867.0
    },
    {
        "author": "freexe",
        "body": "I just hit my first 100k. It basically means that I now have 1/3 of a minimum wage employee earning me money every single day.",
        "created_utc": 1636394201,
        "id": "hjtw126",
        "permalink": "/r/stocks/comments/qphjri/just_hit_100k_my_first_milestone/hjtw126/",
        "score": 175,
        "subreddit": "stocks",
        "created": 1636423001.0
    },
    {
        "author": "InfamousJoker420",
        "body": "My 4 month old survived his kidney operation, I am so relieved, I have no friends so I’m just venting here. Now LFG gme",
        "created_utc": 1635954733,
        "id": "hj5tyxv",
        "permalink": "/r/wallstreetbets/comments/qlr721/daily_discussion_thread_for_november_03_2021/hj5tyxv/",
        "score": 174,
        "subreddit": "wallstreetbets",
        "created": 1635983533.0
    },
    {
        "author": "Hmpf84",
        "body": "I am your wife’s boyfriend now",
        "created_utc": 1636060379,
        "id": "hjc0lsq",
        "permalink": "/r/wallstreetbets/comments/qmulxy/pton_guhhh/hjc0lsq/",
        "score": 172,
        "subreddit": "wallstreetbets",
        "created": 1636089179.0
    },
    {
        "author": "ILikeMapleSyrup",
        "body": "Thank you. You're the only one who gave a serious answer.\n\nAnyways, now that my Tesla battery is fried, I can declare bankruptcy.",
        "created_utc": 1636073568,
        "id": "hjcvw1u",
        "permalink": "/r/wallstreetbets/comments/qmn4vd/its_the_way_it_goes/hjcvw1u/",
        "score": 169,
        "subreddit": "wallstreetbets",
        "created": 1636102368.0
    },
    {
        "author": "jimmydeansus",
        "body": "Looks like a call option. Look into call options and what they are and how they work. This option is open until Oct 2023. Very far out, your ITM (In the money) which is good. So you can sell it and take what the contract is worth right now. Or exercise it. Exercising means you'll be purchasing 100 shares at the strike price of which you bought the option for, you pay per share the strike price. So you bought .03 cent option strike price. You pay .03 cents for each share of 100. You then own 100 share of Said company, this is for going long on a company. There's much to option but it really isn't that hard to understand once you begin learning and understanding. Cause when you purchase a option contract your buying the \"rights\" to 100 shares of said company. Options are a tricky game but is a good game when played strongly. If you knew a stock was going up and you purchased many calls you can profit more for calls than buying said stock. Puts are like shorting, when you expect a stock to go down. Again man, I'm sure I'm making it confusing but YouTube it and read about it. Took me a minute to understand and then took me like months to understand completely across the whole options playing field",
        "created_utc": 1636356299,
        "id": "hjs28pk",
        "permalink": "/r/pennystocks/comments/qp856o/can_someone_please_explain_what_this_is_and_what/hjs28pk/",
        "score": 167,
        "subreddit": "pennystocks",
        "created": 1636385099.0
    },
    {
        "author": "CBH60",
        "body": "You have no concept of hot until you touch the stove and feel for yourself. \n\nThere are entire financial corporations full of financial gurus that still get it catastrophically wrong sometimes. It's a game of risk and best you can do is manage the risk. Learn how to fail and keep going. Fail forward. You can learn massive amounts and the only risk is money.\n\nFor those of us who are older the risk begins to include cars, home, feeding family, stable marriage etc. The smart of us work to isolate that risk to what we can afford to lose and still operate normally. Take your big risks now while it only has minor impact. It will give your pops opportunity to mentor you too.\n\nLots of words to say YOLO on young autist. There is much to learn.",
        "created_utc": 1636162779,
        "id": "hjhwffr",
        "permalink": "/r/wallstreetbets/comments/qnplhb/sometimes_i_wish_my_dad_didnt_work_finance/hjhwffr/",
        "score": 165,
        "subreddit": "wallstreetbets",
        "created": 1636191579.0
    },
    {
        "author": "BearsRfukd",
        "body": "#WE GGANBU NOW",
        "created_utc": 1636344505,
        "id": "hjrkr7e",
        "permalink": "/r/wallstreetbets/comments/qox80l/do_you_want_to_play_a_game/hjrkr7e/",
        "score": 165,
        "subreddit": "wallstreetbets",
        "created": 1636373305.0
    },
    {
        "author": "dtgeorge12",
        "body": "Is the Bryant fam officially in the billionaire club now?",
        "created_utc": 1635785276,
        "id": "hiwh6sq",
        "permalink": "/r/stocks/comments/qkdj6p/cocacola_buys_full_control_of_bodyarmor_for_56/hiwh6sq/",
        "score": 163,
        "subreddit": "stocks",
        "created": 1635814076.0
    },
    {
        "author": "wild_b_cat",
        "body": "Take a look at any chart of the market, and zoom waaaaaaay out to look at decades. You will see that over time the trend line is strongly upwards and short-term wobbles don't have a huge impact. If you're investing for decades away, you can afford to be patient.\n\nNow, if your timeline is shorter than that, then you're right to be cautious. What's your ultimate goal with this money, and when do you expect to need it?",
        "created_utc": 1635790809,
        "id": "hiwum4o",
        "permalink": "/r/investing/comments/qkk2nx/ive_saved_up_a_sizeable_sum_and_i_want_to_invest/hiwum4o/",
        "score": 162,
        "subreddit": "investing",
        "created": 1635819609.0
    },
    {
        "author": "odyssee14",
        "body": "I've been shorting Evergrande since June. It was one hell of a ride, now it's time to rest for a bit. My work is finished.",
        "created_utc": 1636560362,
        "id": "hk2yqcs",
        "permalink": "/r/wallstreetbets/comments/qqvo6g/evergrande_officially_defaulted/hk2yqcs/",
        "score": 162,
        "subreddit": "wallstreetbets",
        "created": 1636589162.0
    },
    {
        "author": "MktMover",
        "body": "Who the fuck is selling right now? All this wait and sell before the 🚀? Wtf.",
        "created_utc": 1635950679,
        "id": "hj5jjbb",
        "permalink": "/r/wallstreetbets/comments/qlviu5/gme_amc/hj5jjbb/",
        "score": 161,
        "subreddit": "wallstreetbets",
        "created": 1635979479.0
    },
    {
        "author": "10xwannabe",
        "body": "You make the same mistake all investors make thinking the markets in the short run (&lt;5-10 years) move based on any thing other then sentiment.  Just repeat the prescient mantra of the great Ben Graham, \"In the short run stock prices are a voting machine and in the long run are a weighing machine\".  He wrote that in his now famous book, \"Intelligent Investor\" in the 1930's and is more right now then probably was back then.",
        "created_utc": 1636035674,
        "id": "hja9hq6",
        "permalink": "/r/stocks/comments/qmlfn3/this_market_is_insane_why_is_the_stock_going_up/hja9hq6/",
        "score": 159,
        "subreddit": "stocks",
        "created": 1636064474.0
    },
    {
        "author": "CRobinsFly",
        "body": "Unfortunately some of what I lost is that - I sold two houses last month and now rent a room and live with the honey on the weekends.",
        "created_utc": 1635879709,
        "id": "hj1oluo",
        "permalink": "/r/wallstreetbets/comments/qlaurk/my_car_short_into_earnings_life_savings_and_some/hj1oluo/",
        "score": 156,
        "subreddit": "wallstreetbets",
        "created": 1635908509.0
    },
    {
        "author": "Roxaos",
        "body": "I swear I’d be a millionaire by now if I wasn’t such a bitch.",
        "created_utc": 1636067438,
        "id": "hjchr4w",
        "permalink": "/r/wallstreetbets/comments/qmt5z6/what_are_your_moves_tomorrow_november_05_2021/hjchr4w/",
        "score": 156,
        "subreddit": "wallstreetbets",
        "created": 1636096238.0
    },
    {
        "author": "LavenderAutist",
        "body": "Now can we see it from the WSB guys perspective?",
        "created_utc": 1636244479,
        "id": "hjm766f",
        "permalink": "/r/wallstreetbets/comments/qocmul/too_true/hjm766f/",
        "score": 155,
        "subreddit": "wallstreetbets",
        "created": 1636273279.0
    },
    {
        "author": "SeeThroughBanana",
        "body": "Wsb has become trash. It used to be about investment bets. Now its all about meming over stupid topics with the most outrageous takes with no relevance to actual investing.",
        "created_utc": 1635817614,
        "id": "hiylj0v",
        "permalink": "/r/wallstreetbets/comments/qkj5ot/monday/hiylj0v/",
        "score": 150,
        "subreddit": "wallstreetbets",
        "created": 1635846414.0
    },
    {
        "author": "skydiver19",
        "body": "I say this to myself all the time. Dam I should of held them 10BTC @ £200 each I would have £500k now. When in reality I would of prob sold them worth a 10th of that.",
        "created_utc": 1636118609,
        "id": "hjeu7zu",
        "permalink": "/r/options/comments/qn8y93/10000_gains/hjeu7zu/",
        "score": 149,
        "subreddit": "options",
        "created": 1636147409.0
    },
    {
        "author": "CRobinsFly",
        "body": "Nope. I have a negative net worth now.",
        "created_utc": 1635880199,
        "id": "hj1pvps",
        "permalink": "/r/wallstreetbets/comments/qlaurk/my_car_short_into_earnings_life_savings_and_some/hj1pvps/",
        "score": 147,
        "subreddit": "wallstreetbets",
        "created": 1635908999.0
    },
    {
        "author": "rgujijtdguibhyy",
        "body": "If you believed in daddy musk you'd already be retired by now",
        "created_utc": 1636314266,
        "id": "hjpoi39",
        "permalink": "/r/wallstreetbets/comments/qot1rj/its_not_about_money_its_about_sending_a_message/hjpoi39/",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1636343066.0
    },
    {
        "author": "Tip_Special",
        "body": "Should just buy fucking dividend stocks now",
        "created_utc": 1635892702,
        "id": "hj2m637",
        "permalink": "/r/wallstreetbets/comments/qlen8x/25k_to_2m_in_14_months_thanks_gme_and_nvax/hj2m637/",
        "score": 144,
        "subreddit": "wallstreetbets",
        "created": 1635921502.0
    },
    {
        "author": "Tersiv",
        "body": "Something called options. Now avoid them if you want to live a happy life.",
        "created_utc": 1635959614,
        "id": "hj66ykb",
        "permalink": "/r/wallstreetbets/comments/qlwhey/3k_73k_in_3_days_taking_your_wife_christmas/hj66ykb/",
        "score": 141,
        "subreddit": "wallstreetbets",
        "created": 1635988414.0
    },
    {
        "author": "AlmostGeorgeIV",
        "body": "&gt;Now turn it back into 10k",
        "created_utc": 1636091483,
        "id": "hjdtksg",
        "permalink": "/r/wallstreetbets/comments/qmtptf/i_did_it_10k_to_100k_ytd_brought_to_you_mostly_by/hjdtksg/",
        "score": 139,
        "subreddit": "wallstreetbets",
        "created": 1636120283.0
    },
    {
        "author": "hirme23",
        "body": "According to the valuation of all the startups next to Tesla, we will all own a couple of cars each. \n\nMore seriously, I think lots of EV startups will either fail or get acquired by current OEMs to solidify/accelerate their EV portfolio. \n\nI think legacy automakers have an edge for high volume quality assembly lines.\n\nEdit: ride sharing can only work in high density cities. People will still buy cars 10-20 years from now",
        "created_utc": 1636045495,
        "id": "hjaymyz",
        "permalink": "/r/investing/comments/qmokya/current_future_state_of_automakers/hjaymyz/",
        "score": 138,
        "subreddit": "investing",
        "created": 1636074295.0
    },
    {
        "author": "superepicunicornturd",
        "body": "Been a $Z holder for a few years now and singing its praises the entire time. However, I think I'll be closing my position out tomorrow. It's been a fun ride but the operational mishaps surrounding the iBuyer segment have been disappointing. Not to say that COVID hasn't dogged the model but the whole model was really predicated on executional excellence from the top down but that has clearly failed to come to fruition. And if the $Z can't do it then i'd venture to say that the other iBuyers are likely having a tough go of it as well, but only time will tell whether this is $Z specific or if the model fundamentally needs to be rethought.  \n\n\nIt's been a fun ride $Z, but i'm out. Hello more VTI shares",
        "created_utc": 1635913870,
        "id": "hj3yvgd",
        "permalink": "/r/investing/comments/qlmgq5/zillow_says_its_closing_homebuying_business/hj3yvgd/",
        "score": 137,
        "subreddit": "investing",
        "created": 1635942670.0
    },
    {
        "author": "CakeDayisaLie",
        "body": "After how they locked people out of GME and now this, why would anyone stick around?",
        "created_utc": 1636426369,
        "id": "hjw0218",
        "permalink": "/r/CanadianInvestor/comments/qpt1sf/robinhood_says_email_addresses_of_5_mln_customers/hjw0218/",
        "score": 137,
        "subreddit": "CanadianInvestor",
        "created": 1636455169.0
    },
    {
        "author": "CrayfishYAY2",
        "body": "Literally only 1 post about this 13 days ago, with only 21 upvotes now. This is so frustrating.",
        "created_utc": 1635871919,
        "id": "hj14qbr",
        "permalink": "/r/wallstreetbets/comments/ql5y30/how_is_no_one_talking_about_avis_at_all/hj14qbr/",
        "score": 136,
        "subreddit": "wallstreetbets",
        "created": 1635900719.0
    },
    {
        "author": "bkbikeberd",
        "body": "From what people in the real estate market told me is that they would overpay for homes in hopes of flipping it for a profit. If you sold your home above market it’s good for you but if you are buying a home you are now competing with a giant company with near endless money. My home went up in price from 680K to 850K in just about 8 months and that’s without Zillow buying up homes in my market. Imagine with them here making ridiculous cash offers way above market value.",
        "created_utc": 1635913651,
        "id": "hj3yhfw",
        "permalink": "/r/investing/comments/qlmgq5/zillow_says_its_closing_homebuying_business/hj3yhfw/",
        "score": 135,
        "subreddit": "investing",
        "created": 1635942451.0
    },
    {
        "author": "garym81",
        "body": "I bought some this morning. It's gone down due to a fall in the revenues from EBay, and they've lowered their guidance for revenue and earnings. \n\nHowever, I'm excited about their future. From what I understand, they're looking at starting a stock trading platform which should see revenues grow in the future. And, with their acceptance of cryptocurrencies, I imagine there might be deals being signed elsewhere for them to be a payment provider on more platforms. That's just my speculation though.\n\nI got in at $212. Will stop looking at the charts for now, and check back in a few months. For now, it's a long-term hold for me.",
        "created_utc": 1636472961,
        "id": "hjy44md",
        "permalink": "/r/stocks/comments/qq6ef5/pypl_taking_a_nose_dive_day_after_earnings/hjy44md/",
        "score": 135,
        "subreddit": "stocks",
        "created": 1636501761.0
    },
    {
        "author": "BrainSlurper",
        "body": "The worst part is that the \"when\" of this particular crash will be decided not by a random, panicked sell off or some sort of fund collapsing, but by the federal reserve announcing a policy change. Special people will know in advance, while the average person has no chance to time the market based on their own indicators.\n\nIt could be 2 years from now. Or 5. Or 7. But it will absolutely be deliberate, and almost certainly politically convenient.",
        "created_utc": 1636540032,
        "id": "hk1wc5y",
        "permalink": "/r/wallstreetbets/comments/qqkbbc/well_its_official_this_is_all_our_fault/hk1wc5y/",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1636568832.0
    },
    {
        "author": "nevermore1720",
        "body": "This post is too sensible for WSB. Let me make random counter point for entertainment purposes. Inflation is good for you just like unaffordable housing and homelessness. I feel better now.",
        "created_utc": 1636475525,
        "id": "hjyag7h",
        "permalink": "/r/wallstreetbets/comments/qq6qgt/wholesale_prices_rise_86_year_over_year_in/hjyag7h/",
        "score": 132,
        "subreddit": "wallstreetbets",
        "created": 1636504325.0
    },
    {
        "author": "JSGypsum",
        "body": "Would it be dumb to sell my American airlines stock right now",
        "created_utc": 1636121492,
        "id": "hjf0ne7",
        "permalink": "/r/stocks/comments/qnaff5/pfizers_new_covid_pill_cuts_death_and/hjf0ne7/",
        "score": 132,
        "subreddit": "stocks",
        "created": 1636150292.0
    },
    {
        "author": "FinndBors",
        "body": "Have antivirals been this effective for other viruses? As far as i knew as of a few years ago, most of them aren’t very effective. Tamiflu barely does anything to the flu. But now we have this drug and the Merck one was also pretty effective. What tech is behind these and are there certain companies in the forefront?",
        "created_utc": 1636126071,
        "id": "hjfc293",
        "permalink": "/r/investing/comments/qn9o7d/pfizer_says_its_covid_pill_with_hiv_drug_cuts_the/hjfc293/",
        "score": 131,
        "subreddit": "investing",
        "created": 1636154871.0
    },
    {
        "author": "Apha-apha",
        "body": "It soared unexpectedly.. I think it is wise to sell now and buy back later under 1000",
        "created_utc": 1636230700,
        "id": "hjlcst9",
        "permalink": "/r/wallstreetbets/comments/qo8ded/my_lifesavings_are_in_tsla_please_dont_elon/hjlcst9/",
        "score": 131,
        "subreddit": "wallstreetbets",
        "created": 1636259500.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "In the short term, possible, but it might wobble a bit.\n\nLong term, they're investing a lot in EV and I think it will pay off for them.\n\nThat said, I wouldn't hold auto companies, I'd only swing trade it, and the entry isn't good anymore for this round.\n\nIf I had paid $16 I'd be exiting right now and moving on to next trade.",
        "created_utc": 1636419836,
        "id": "hjvljki",
        "permalink": "/r/StockMarket/comments/qprenm/hello_my_fellow_investors_what_ya_think_on_ford/hjvljki/",
        "score": 131,
        "subreddit": "StockMarket",
        "created": 1636448636.0
    },
    {
        "author": "Azyan_invasion82",
        "body": "He was a 30 year old virgin that can now get all the strippers his heart desires",
        "created_utc": 1636392671,
        "id": "hjts69j",
        "permalink": "/r/wallstreetbets/comments/qpgdtr/personality_money_for_women_just_dont_be_a_poor/hjts69j/",
        "score": 130,
        "subreddit": "wallstreetbets",
        "created": 1636421471.0
    },
    {
        "author": "Manateeboi",
        "body": "Nice work. Now get off Robinhood.",
        "created_utc": 1636174208,
        "id": "hjiiokd",
        "permalink": "/r/StockMarket/comments/qnruuf/finally_in_the_green_fellas_it_was_a_rough_start/hjiiokd/",
        "score": 130,
        "subreddit": "StockMarket",
        "created": 1636203008.0
    },
    {
        "author": "BrownieKhan",
        "body": "Pure Storage Cocks!!! Raising q3 guidance. Such a better stock than Nutanix or Netapp. PSTG",
        "created_utc": 1635953682,
        "id": "hj5r6eo",
        "permalink": "/r/wallstreetbets/comments/qlr721/daily_discussion_thread_for_november_03_2021/hj5r6eo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635982482.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of November\n\n\n\n## Upcoming events for Monday, November  1st\n\n - Expected earnings:\n\n  ABIO, ADC, ADTN, ADUS, AKTS, ALX, AMC, AMG, AMRC, ANAT, ANET, APEN, APLS, AWR, BEN, BNL, BRKR, BRX, BWXT, CACC, CAR, CCLP, CEA, CHGG, CLDB, CLX, CNA, CORR, CPLP, CRNT, CRUS, CSR, CSWC, CURO, CVI, CWBC, DSPG, DSS, DZSI, EC, EEX, EGRX, ENBL, EPRT, EVER, FANG, FEDU, FGBI, FN, GAIA, GAME, GSS, GTE, GXO, HLIT, HNRG, HOLX, IPI, ISEE, IVAC, IVT, IX, JELD, KFRC, KLDO, KMT, KOF, L, LDI, LEG, LKCO, LTRN, LXU, MCK, MFIN, MGP, MNOV, MOS, MRBK, MVBF, NBIX, NERV, NRIM, NSP, NSSC, NTR, NXPI, O, OGS, OIS, ON, ONVO, OTTR, PCG, PDLB, PLOW, PSA, RHP, RIG, RMBS, RRX, RYAAY, SBAC, SBT, SKT, SMLR, SNDX, SOI, SPG, SUNW, SXC, TA, TKR, TRVG, TRVN, TTI, UAN, UNVR, VBIV, VNO, VNOM, VRNS, WBK, WLFC, WMB, WMK, WTRG, XENT, ZI\n\n - Ex-div:\n\n  AES, BANR, BKR, ETRN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, ITUB, LMRK, O, OMF, SHLX, SPH, SRCE, VER, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Construction Spending (consensus: 0.4%, previous: 0.3%)\n    - ISM Manufacturing Employment (previous: 50.2)\n    - ISM Manufacturing New Orders Index (previous: 66.7)\n    - ISM Manufacturing PMI (consensus: 60.5, previous: 61.1)\n    - ISM Manufacturing Prices (consensus: 78.5, previous: 81.2)\n    - Investing.com Gold Index (actual: 59.9%, previous: 54.3%)\n    - Investing.com S&amp;P 500 Index (actual: 57.5%, previous: 47.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 59.2, previous: 60.7)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSP, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCFT, OCN, OKE, OMCL, OMIC, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRD, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACRE, ACRS, ADPT, AEE, AFIN, AGIO, ALB, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ES, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HOFV, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IDN, IIPR, IMXI, INFN, INMB, INN, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NUS, NVST, NYT, OAS, OCDX, ODP, OLP, OM, OMI, OMP, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PRTA, PSN, PTC, PTGX, PTVE, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RC, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SGMO, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STCN, STGW, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UGP, UHAL, UMH, UPLD, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -2.311M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.1, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.30B, previous: -73.30B)\n\n^^^^2021-11-01",
        "created_utc": 1635760818,
        "id": "hiv8hui",
        "permalink": "/r/RobinHood/comments/qkan8y/daily_discussion_thread_november_1st_2021/hiv8hui/",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635789618.0
    },
    {
        "author": "_grapevan",
        "body": "Anyone else playing NXPI earnings?",
        "created_utc": 1635795956,
        "id": "hix76ry",
        "permalink": "/r/wallstreetbets/comments/qkanjp/daily_discussion_thread_for_november_01_2021/hix76ry/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635824756.0
    }
]