[
    {
        "author": "RyChrome",
        "body": "$NVDA is such a beast man",
        "created_utc": 1617297142,
        "id": "gt1udwi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617325942.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "AMD, NVDA,SOXL semiconductor gang🤑🤑🤑",
        "created_utc": 1617289627,
        "id": "gt1dp1t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617318427.0
    },
    {
        "author": "lavishcoat",
        "body": "My gains in HD since January are more than my NVDA gains over last 7 months 🤡",
        "created_utc": 1617323036,
        "id": "gt3bqpx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617351836.0
    },
    {
        "author": "maxkingusa",
        "body": "NVDA and AMD have performed amazing over the past few days.  Both are running on strong volume.  I still believe they head back to prior highs and the earnings stories for both are still intact.  \n\nI am also loading up on oil names.  SLB, HP, XLE.  I think Oil goes much higher this year based on research from Goldman and others.",
        "created_utc": 1617289857,
        "id": "gt1e74n",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617318657.0
    },
    {
        "author": "bryanx92",
        "body": "I know it’s a long hold but can you dip a little nvda",
        "created_utc": 1617294578,
        "id": "gt1op21",
        "score": 3,
        "subreddit": "stocks",
        "created": 1617323378.0
    },
    {
        "author": "belangem",
        "body": "Now compare NVDA last 6 months with pretty much any sector ETF (XME, XLE, XLF, SLX) and ask yourself why you put so much effort into this.",
        "created_utc": 1617323251,
        "id": "gt3c4hi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617352051.0
    },
    {
        "author": "dicklightning94",
        "body": "It’s not even just Apple it’s a lot of tech. AMD NVDA AMZN FB etc are all at similar levels as they were in September and some are even lower. Granted they did have a huge bull run in the months prior, but spacs had a huge bull run in the months prior to this too",
        "created_utc": 1617327628,
        "id": "gt3jozj",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1617356428.0
    },
    {
        "author": "RyChrome",
        "body": "I'd like to introduce you to my two beautiful babies. $NVDA and $V",
        "created_utc": 1617282294,
        "id": "gt0z8w2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617311094.0
    },
    {
        "author": "bsthedog",
        "body": "Meme stocks almost always meme again eventually. CRSR isnt even a huge speculation bubble either, theyre only valued at 3 billion. For a company that youll likely want to buy a power supply from if youre using an AMD or NVIDIA desktop PC, and if not maybe a chair or keyboard, It's a very cut and dry valuation as if it paid boomer dividends. Theres even boot coon exposure because of their PSU products' reliability for sure. It's a holder.",
        "created_utc": 1617292020,
        "id": "gt1izd9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617320820.0
    },
    {
        "author": "PLTRGOD",
        "body": "NVDA? They bought ARM so im guessing everyone (from AWS to Raspberry Pis) has to buy arm processors?",
        "created_utc": 1617349112,
        "id": "gt4cwwd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617377912.0
    },
    {
        "author": "qwert1225",
        "body": "What do we think about NVIDIA chat",
        "created_utc": 1617331500,
        "id": "gt3q9xd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617360300.0
    },
    {
        "author": "GiantWhiteCohc",
        "body": "Hedging AMD with Nvidia. Truly one of us.",
        "created_utc": 1617285912,
        "id": "gt15wvc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617314712.0
    },
    {
        "author": "DroneCone",
        "body": "Yup that's a good point. MOBOs too. You can build a whole system with AMD stuff. Like I said, I don't really think you can go wrong with either long term. Might as well get some Nvidia too!",
        "created_utc": 1617440983,
        "id": "gt8a1qi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617469783.0
    },
    {
        "author": "clyspe",
        "body": "Is it really that bad to only invest in the materials sector? I can understand how both nvidia and intel could be linked in price, but I have a hard time thinking a lithium company and a wood company would have their stocks tied together by anything more than the market at large",
        "created_utc": 1617466409,
        "id": "gt99ap6",
        "score": 1,
        "subreddit": "investing",
        "created": 1617495209.0
    },
    {
        "author": "skilliard7",
        "body": "Is there a banned words list anywhere? I find it infuriating when I type a long post and it gets instantly removed due to 1 word, because automod doesn't care about context. A lot of times it comes down to 1 word which was an afterthought. For example, maybe it's a post about AMD or NVIDIA, and in one small snippet I mention a particular currency that makes their GPUs sell well, but the whole thing gets taken down because of it.",
        "created_utc": 1617473059,
        "id": "gt9m469",
        "score": 1,
        "subreddit": "investing",
        "created": 1617501859.0
    },
    {
        "author": "otherworldly_otter",
        "body": "As a PC gamer and custom PC builder for gamers, most of the new market gaming PC's are built on AMD processors.  The new CPU and GPU power share tech is next level and is going to make it difficult for Intel to keep up until they start to offer their own GPU, until then Nvidia will still own the GPU market. AMD is a strong CPU and GPU producer and may knock Intel off their thrown sooner rather than later.  Full disclosure I hold stakes in all 3 of these companies.",
        "created_utc": 1617503293,
        "id": "gtb4gu3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617532093.0
    },
    {
        "author": "Qs9bxNKZ",
        "body": "Pretty rosy outlook there, but we have to consider more than the sheer number of vehicles that can be delivered.  \n\nHow many of those cars needed to be refurbished?  Were rejected by the buyers or were taken back to get one or more warranty repairs?  What is the value (profit) in each vehicle that is sold, and are we talking about $39,000 Model 3's or the $80K Model S, or the $90K Model X?  \n\n* Fremont factory was shut down by the health department in CA during the COVID crisis.  Can happen again, not by law, but by whim.  \n* There are new factories planned but is there the capability to deliver?\n* Is the factory in China to meet demand (no more car transports out of Oakland to China) or to avoid paying tariffs on imports?\n* Plaid+ Model S pushed out to now middle of 2022, with a $10K price increase\n* CyberTruck, estimates but no deliveries.  \n* Model X will not be getting the newer battery (notice by range) as that's not even an option\n* Tesla body shops are slammed for repairs - either for parts or labor (May 7th or whatever in CA Bay Area)\n* Tesla authorized body shops can have delays in repairing vehicles, due to parts availability and when aluminum parts arrive, can be dented during transport needing it to be sent back and resetting the clock\n* Wholesale (wrecked) price on Teslas are high because battery packs are at a premium, causing insurance to total them prematurely and raising insurance rates\n* Beta FSD is seriously buggy (dangerous) as per the latest AI video shot in Oakland\n* Missteps in telling buyers they'd be able to get a Tesla loaner, then get cheated out of even the Uber credits, when the vehicles are brought in to be serviced\n* Increased difficult in talking to a human via email or phone.  \n* MCU1 NHTSA near-recall forcing Tegra board installs and service scheduling\n* GM and LG Chem teaming up\n* Apple Car competition\n* MCU / software slow failure to adapt (Slack to Spotify, but still no Waze nor CarPlay integration)\n* Large delays (due to warehouse supply chain) in deploying Solar PV installs (approx 2 months in Bay Area)\n* Biden administration push for tax rules which increase corporate taxes (21% to 28%), impacting revenue generated overseas in places like Germany where the other factory is going in to help with sales.  \n\nThere are probably more issues, but when you have other manufacturers starting to offer comparable options (including TACC) it increases the pressure on Tesla.  What does TSLA really have going for them?\n\n* Tesla Gigafactory is still working with Panasonic in Sparks.  Full shifts.  Buses for employees coming from as far south as Carson City NV.  \n* Toyota and TSLA teaming up\n* Leaps on the auto-pilot software ahead of everyone else\n* Sentry mode due to number of cameras\n* Name branding (fancier than a Toyota)\n* Potential tax benefits under the Biden administration for EVs.  States like NJ make it economical to buy a new TSLA due to the $0 sales tax for EV purchases.\n* Electricity costs in CA ($0.25 kW/h) along with outages due to \"wildfire and other threats\" make Solar PV a better option, along with the $10-$15K power wall for consumers\n\nI'd expect chip issues to drive issues in the future.  I followed TSLA since they migrated from Mobil Eye (and subsequent purchase by INTC) into creating their own solution.  This is the difference between AP1, AP2 and ultimately the options going into AP3 with users claiming better (smoother) performance from AP1 for months after AP2 was rolled out.  Anyhow, the NVDA and subsequent their own chips also play a role in terms of growing pains.  \n\nI am long on TSLA with a bit over $165,000 invested.  Current price is an interesting proposition but I have no active orders.",
        "created_utc": 1617405430,
        "id": "gt6wum8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617434230.0
    },
    {
        "author": "Feaross",
        "body": "I am holding TSM, AMD and NVDA. \n\nOne generation behind is 2 years, I don't see a quick recovery for Intel. \n\nWattage matters in large scale compute. \n\nHeat matters. \n\nSingle core performance matters in virtualized environments where cost is often associated with core count.\n\n GREAT DD!",
        "created_utc": 1617407813,
        "id": "gt7146q",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617436613.0
    },
    {
        "author": "RyChrome",
        "body": "$NVDA $600c 5/14",
        "created_utc": 1617382561,
        "id": "gt5o9yt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617411361.0
    },
    {
        "author": "kirinoke",
        "body": "Okay hear me out, if AMD can succeed beating Intel in desktop CPU and Nvidia in desktop GPU, then it should have a market cap of equivalent to INTC+NVDA, so about $500B. AMD is currently trading around $100B, so theoretically it can reach $400 per share.\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\nHuge /s!\n\nlmao yes I don't think AMD is \"overlooked\" nor \"undervalued\", but I do think it is at a good entry point right now.",
        "created_utc": 1617382668,
        "id": "gt5ohsw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617411468.0
    },
    {
        "author": "ProfessorPurrrrfect",
        "body": "AMD and NVDA are the market leaders of their industry, semi-conductors. Buy market leaders. Intel is the ‘flavor of the month,’ but they suck, and AMD and NVDA will eat their lunch again for the rest of the year just like they have for years. \n\nSame goes for the entire market. Don’t get shook and try to buy CAT, URI, INTC, or any of the fucking banks that crypto will make obsolete in 5 years. All those stocks are just “catching up” to the rest of the market, but they will all reclaim their place on the trash heap of 2021 stocks by December.",
        "created_utc": 1617499415,
        "id": "gtay2de",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617528215.0
    },
    {
        "author": "Tasteysauce",
        "body": "I’d manage expectations about GPUs. I mean, they’re pretty much guaranteed to sell them all... within seconds, but NVidia tends to remain on top after new AMD releases. AMD just stays more affordable, probably for this reason, and they usually shine with lower end offerings. \n\nIt’s stiff competition, and it’s hard to believe that’s gonna change. The only guarantee, in my opinion, is their earning after all the stock is immediately depleted upon launch.",
        "created_utc": 1617501211,
        "id": "gtb129r",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617530011.0
    },
    {
        "author": "bryanx92",
        "body": "Roth IRA 100% VTI \n\nBrokerage: BLK, GOOGL, AAPL, MSFT, LMT, NKE, NVDA, MSFT, COST, TGT, BRKB &amp; DIS",
        "created_utc": 1617478764,
        "id": "gt9xpw8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617507564.0
    },
    {
        "author": "NoMoreLocusts",
        "body": "What's the N in FAGMAN? NFLX or NVDA?  I understand FB, AAPL, GOOGL, MSFT, and AMZN.",
        "created_utc": 1617480725,
        "id": "gta1igj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617509525.0
    },
    {
        "author": "AllProWomenRespecter",
        "body": "So that's technically playing AMD vs Intel still though, because that's where a disruption with TSMCs production comes in as a beneficiary to Intel.\n\nIf you're playing the 5 and 7 nm disruption. I don't get why you wouldn't just buy Qualcomm or Samsung.\n\nYour time horizon is also pretty long to not take into account ARM will belong to NVDA by then.",
        "created_utc": 1617397037,
        "id": "gt6h6yr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617425837.0
    },
    {
        "author": "MysticDaedra",
        "body": "AMD and NVDA are not semiconductor companies. They design processors. NVDA is more of an AI company than an electronics company.",
        "created_utc": 1617499590,
        "id": "gtaycoi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617528390.0
    },
    {
        "author": "Tasteysauce",
        "body": "I disagree honestly, just as PC enthusiast. You can buy both AMD and Nvidia cards right now, and you’ll have a great card either way. But Nvidia just makes better performers on the high end. There’s also different features for content producers that steer people one way or the other, so it’s not all black and white. \n\nThe only thing exclusive to anyone, at the moment, is ray tracing from Nvidia. But we can probably expect AMD to tackle this in their new cards. \n\nAnd Intel does actually have decent offerings, despite what a lot of people say about them being so far behind. We’ve seen 10400s go on sale for awesome prices for the performance. In fact, I believe all the 10 series CPUs are a pretty good value right now. So they’re kind of where AMD is with GPUs, just in the CPU space. \n\nI think the current silicon industry would be amazing for consumers if not for the crazy demand and awful shortage. Competition is through the roof, thanks to AMD. But it’s stiff, nonetheless. \n\nAs it stands, Nvidia make the best GPUs, AMD make the best CPUs, and you’d be wise to not completely fall asleep on Intel. Might take a minute, but they’re not used to being second best. Who knows what will change, but history is worth looking at.",
        "created_utc": 1617502835,
        "id": "gtb3qbq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617531635.0
    },
    {
        "author": "Common-Worldliness-3",
        "body": "Check out $ASX. You’re welcome \n\nhttps://www.google.com/amp/s/seekingalpha.com/amp/article/4417169-ase-technology-vs-amkor-an-analysis-on-worlds-leading-osats\n\n“Strategic Alliance between ASE and TSMC\nASE is based in Taiwan, one of the leading centers for outsourced semiconductor and electronics manufacturing in the world. Its close geographical proximity allows the company to benefit from strong manufacturing activity. It has maintained a strategic alliance with TSMC since 1997, the largest dedicated foundry with a market share of 56% of the foundry market revenues. The alliance has made ASE the preferred provider of packaging and testing services for TSMC clients. This allows ASE to benefit by leveraging TSMC's clients of leading companies including Apple (AAPL), Qualcomm, Nvidia (NVDA), MediaTek (OTCPK:MDTKF), NXP Semiconductors (NXPI) as clients who account for nearly half of ASE's revenues. Apple, Qualcomm and MediaTek are major players in the smartphone processor market and are developing 5G chipsets that require advanced packaging capabilities which ASE can provide. Given the long-standing relationship between TSMC and ASE, we expect the alliance between both companies to continue as it enables them to provide a total semiconductor manufacturing solution and the close geographic advantage between both market leaders. This means that ASE should be able to continue counting on TSMC's clients of leading chipmakers.”",
        "created_utc": 1617409431,
        "id": "gt73vw3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617438231.0
    },
    {
        "author": "Infinityaero",
        "body": "And you'll pay an extra $12k in software costs, on top of the existing hardware costs? \n\nHow about when someone else comes out with a vehicle for the same cost, without the software add- on cost (bundles it in) ? This is no different that Porsche charging $15k for an Alcantara interior. Waymo/Luminar/VW/etc aren't all going to fail, at that point it becomes what the average person is willing to pay. \n\nMight be worth finding a way to turn off the auto-updates / constant data sharing &amp; hack the code at that point lol... $12k is a whole car's worth of money for something the car is supposedly capable of out of the box. That's like if NVIDIA sold RTX3060 TIs at $300 running on only 2GB of RAM, and then charged you another $300 for software to use the 8GB of RAM it has. Just charge me $600 to begin with! Otherwise AMD is just gonna jump in and give me normal logical pricing based on a combination of  hardware and software integration.",
        "created_utc": 1617426957,
        "id": "gt7vhcj",
        "score": 1,
        "subreddit": "investing",
        "created": 1617455757.0
    },
    {
        "author": "Tych-0",
        "body": "Not sure how comparing interior to something like FSD that provides utility makes sense.  You computer analogy is fine I suppose, except nVidia does in fact do this.  They disable functionally in their consumer level GPUs that would other wise be identical to their Quadro cards that cost multiples more.\n\nThat said Model Y already has about the same cost of ownership as a RAV4, and it's only getting cheaper as costs to manufacture EVs come down.  Of course this is without the FSD software, but to me 12k is a absolute no brainer if I can sleep while my car drives me.  Annualize that over the lifetime of the car, and then think about how much utility that adds to your life, I think it's worth it to a lot of people.\n\nIt may not make financial sense for everyone, but I'm sure there will be robotaxis for hire for those that only occasionally want autonomy.\n\nIt's hard to say exactly how this will change the way we travel, but if/when FSD happens, it's going to be a very big deal.",
        "created_utc": 1617429775,
        "id": "gt7ytgu",
        "score": 1,
        "subreddit": "investing",
        "created": 1617458575.0
    },
    {
        "author": "ElectronicGuitar7834",
        "body": "Hi\n\nI am in UK as well.\n\nI have started to trading options a month ago and I have been trading with Fineco Bank.\n\nIt is easy to operate and open an account but you don't have all the companies to trade with options and they have contracts expiring only on 21st of each month. \n\nApple, Tesla, PLug, NVidia are there but no SPY for example.\n\nThis week I got my account with Tastyworks and I will start trading with them.\n\nBe aware that as I started with Fineco I have to close my position, exchange the money back to pounds and then exchange again to dollars and send to Tasty Works.",
        "created_utc": 1617448453,
        "id": "gt8h54u",
        "score": 1,
        "subreddit": "options",
        "created": 1617477253.0
    },
    {
        "author": "willtab",
        "body": "Argentinian Investor here \nMELI\t7,0%\t\nDISN \t6,5%\t\nARKG\t6,0%\t\nSQ\t       5,5%\t\nARKQ\t5,0%\t\nNVDA\t5,0%\t\nSHOP\t4,5%\t\nPINS\t4,0%\t\nMSFT\t3,8%\t\nETSY\t3,4%\t\nABNB\t3,0%\t\nDKNG\t3,0%\t\nAAPL\t2,5%\t\nPENN\t2,5%\t\nCOST\t2,5%\t\nTESLA\t2,0%\t\nTWTR\t2,0%\t\nROKU\t2,0%\t\nUPST\t2,0%\t\nAMD\t2,0%\t\nPLTR\t1,7%\t\nTWLO\t1,7%\t\nFB\t1,5%\t\nFUTU\t1,5%\t\nCELH\t1,5%\t\nDMTK\t1,5%\t\nNKE\t1,5%\t\nOZON\t1,5%\t\nPYPL\t1,0%\t\nATVI\t1,0%\t\nTMDX\t1,0%\t\nLOW\t1,0%",
        "created_utc": 1617450888,
        "id": "gt8jvj3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617479688.0
    },
    {
        "author": "PresterJohnsKingdom",
        "body": "I've been investing for approx. 2 years, but have been more active lately. Additional discussion welcomed on a few tickers in particular:\n\nFWRD - transportation company, solid financials, weathered the covid crash and has been on a strong rebound since last spring.  My first purchase and longest held and largest position. \n\nNVDA - ticker needs no introduction. I was lucky (not good) to hear about it on youtube two years ago. Put some money in and have been letting it run.  Increased my position last month when it slid below $500/share.\n\nF - I am reevaluating continuing to hold this.  I don't see a path to them acquiring a larger market share with most car companies moving toward electric vehicles.  I can get out at a profit and may do so.  There are other car companies (VWAGY, HYMTF, RACE) that have better prospects. \n\nM - I bought Macys on the run up (@$18/share).  Seemed like a good play at the time, retail should do well with things opening back up, but it has slid back down.  Am I looking at things wrong or is it undervalued? $4 billion market cap for a company with 18 billion in revenue and $2 billion in profit during a pandemic? Planning to keep holding for now.  \n\nRKT - I bought and sold during the meme spike last month, got in right as it was taking off, @$24 sold @$38 and made some coin. Reinvested on the way back down, @$25, but it has continued to slide. Am I looking too hard at $2.6 billion market cap on $15 b in revenue/$4 billion in profit?\n\nVACQ/GNPK - these are speculative plays, SPACs that are taking Rocket Labs and Red Wire public. Commercial satellite launch and space infrastructure.  \n\nRounding out the profile a couple ETFs, ONGAX and PRDSX, and some more stocks:\n\nWMT\nLMT\nKBAL\nT\nERIC\nSELB\nLUMN\nBDN\nUNIT\nPLTR \n\nI also have a little in a gold equity, IAU. Am looking to diversify more into Agriculture/Energy but not sure yet.",
        "created_utc": 1617478067,
        "id": "gt9waep",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617506867.0
    },
    {
        "author": "Speedbump_",
        "body": "Yes, and that was expected. More speculative investments are going to lag larger market caps coming off a correction. People are going to buy back in on Apple and Nvidia while they are down from their tops, as they are seen as safer if we dip more. \n\nOnce those get near the top and don't present such a tempting opportunity, money will flow into more speculative investments that present a better growth opportunity. \n\nPre-loi will lag spacs with a good DA as well. Known element at a discount to ATH is a better opportunity than a pre-loi that could sit for months and/or find a bad target. But once DA spacs get expensive enough then money will again look to go fishing and pre-loi will go up as well, especially on older spacs that are likely closer to a merger. It won't be what it was before due to the sheer number now, but pre-loi do acquire a sort of extrinsic value above nav in a risk-on environment.",
        "created_utc": 1617394920,
        "id": "gt6d1rc",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1617423720.0
    },
    {
        "author": "Celodurismo",
        "body": "&gt;but NVDA is confident it will go through.\n\nLike they would say anything else",
        "created_utc": 1617319075,
        "id": "gt34l2f",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617347875.0
    },
    {
        "author": "circdenomore",
        "body": "No SOXL and NVDA love huh",
        "created_utc": 1617322310,
        "id": "gt3agqs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617351110.0
    },
    {
        "author": "ScarletHark",
        "body": "I work in the semi industry and I've been in and out of AMAT positions the past couple of months. TSM, Samsung and INTC have near-term headwinds in terms of earnings based on semiconductor demand simply because it takes so long to expand capacity. The front-end winners in current semi production efforts are going to be those who supply the tools, products and services that go into these fabs that are planned for construction: AMAT, ASML, TER, LRCX, to name a few. Secondary effects on earnings from this will come 1-2-3 years down the line for the semi manufacturers themselves, depending on whether or not they are expanding/upgrading an existing facility, or building one from the ground up.\n\nThe end-users of these semiconductor products (GM, F, NVDA, AMD, etc.) will be the last ones to benefit from expanded chipmaking capacity, as easing the demand crunch allows them to resume normal sales levels. Note that for auto mfrs, this has a ripple effect on rental car companies, who sold all of their fleets in fire sales last year and now can't replace them because the auto mfrs can't make cars.\n\nAdditionally, TSMC is booked up for the foreseeable future; these bookings have prices agreed well in advance, and are almost certainly not subject to TSMC's recent statements that they plan to increase prices; that will happen with new bookings down the line.",
        "created_utc": 1617325086,
        "id": "gt3fbzb",
        "score": 1,
        "subreddit": "options",
        "created": 1617353886.0
    },
    {
        "author": "ThisPomelo4",
        "body": "Your analysis is probably true for delta, but the problem with playing those names using vol is that the IV is higher. Options trading is most useful when you get the gamma cheap while also calling the direction right.\n\nI'm buying INTC 23Apr 70c because resistance at 65 has kept IV muted. My bet is that INTC will break through that resistance on 6Apr or 23Apr. I hate talking in terms of resistance in general, but looking at the long-term chart as well as price action in the morning after the Intel Unleashed event, it certainly seems like you'd need a big catalyst to justify a breakout beyond 65. I'd probably play those profits -- if any -- into AMD puts through to May, because I think hedge fund selling will take place when Lisa Su inevitably acknowledges the incorrectness of her prediction that supply \"tightness\" would clear up by 2H21.\n\nI also believe that the Archegos liquidation is another sign that correlated hedge fund losses will spell disaster for the market. We saw this already with GME and the other short-squeeze names. Chipmakers like to lay out their capex as close to production ramp-up as possible, which means that LRCX/AMAT/ASML/KLIC/KLAC/CAJ/etc won't book profits immediately even if billions of dollars are allocated to the roadmap. So I'm waiting for a big selloff this summer to get into those names as a long-term position. May try to play that selloff using hedgie favorites and names that have a lot of room to fall. ARKK, TSLA, TSM, NVDA come to mind. TSM seems counterintuitive but you get the added potential catalyst of Chinese brinkmanship as well as a deepening of the water supply woes.\n\nI mention CAJ because it gives a good read on DUV demand. Their equipment segment had a lot of profit growth last quarter. But it's not as good a play as the others because only a fifth of its revenue comes from that segment.",
        "created_utc": 1617331929,
        "id": "gt3qzmp",
        "score": 1,
        "subreddit": "options",
        "created": 1617360729.0
    },
    {
        "author": "Furloughedinvester",
        "body": "Sold all my NVDA at 600. Then put that money in ARK.K and ARK.G. Yes I am a genius.\n\nAnyway, great company. Def a buy and hold",
        "created_utc": 1617332273,
        "id": "gt3rjri",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617361073.0
    },
    {
        "author": "RewtDooDoo",
        "body": "Here you go folks, straight from HUT8;\n\n\"Hut is building on its 3233 BTC balance as we speak.Recent Nvidia GPU purchase with a payout in Bitcoin =an extra 2.5BTC at current rates (as per conservative estimates @ less than $5000 per coin) + 6.8 BTC per day by end of June for $HUT\"\n\nAn extra 2.5 bitcoin per day at lower rates thanks to these new GPUs and they will be installed by this summer, NOT 2022. Let's not forget the 1000 bitcoins also on loan making 4% annually with Genesis. 36.7% increase of bitcoin production by June. Hodl on everyone.",
        "created_utc": 1617374808,
        "id": "gt58pai",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1617403608.0
    },
    {
        "author": "itsnotthatbad21",
        "body": "Alright NVDA show papa you love me at 550",
        "created_utc": 1617289950,
        "id": "gt1eeez",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617318750.0
    },
    {
        "author": "RyChrome",
        "body": "$NVDA $550 4/16c",
        "created_utc": 1617282321,
        "id": "gt0zajq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617311121.0
    },
    {
        "author": "RyChrome",
        "body": "$NVDA $550 4/16 call",
        "created_utc": 1617283770,
        "id": "gt11uot",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617312570.0
    },
    {
        "author": "butteryhippo",
        "body": "About 1/3 of my “portfolio” going into 0dte otm calls on LRCX, NVDA, TSLA, and PLTR. End of day targets are 625, 560, 730, and 28 respectively. \n\n2nd quarter rotation back into tech + Pres. Buyden stimmy + Tesla shorts covered/out (?) + gamma squeezes + tingling in my bits = 🚀🚀🚀\n\nGood luck ladies n gents",
        "created_utc": 1617283722,
        "id": "gt11rh3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617312522.0
    },
    {
        "author": "crvernon",
        "body": "Unfortunately, it won’t go through. I’m still holding NVIDIA. But Qualcomm is the better ARM play.",
        "created_utc": 1617332941,
        "id": "gt3smp2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617361741.0
    },
    {
        "author": "kleesta",
        "body": "SPY - 33.61%\n\nAMZN - 7.07%\n\nBA - 5.66%\n\nWM - 5.23%\n\nDIS - 5.07%\n\nVNQ - 5.05%\n\nKO - 4.97%\n\nNVDA - 4.94%\n\nGOOGL - 4.76%\n\nAAPL - 4.68%\n\nAMD - 4.53%\n\nTSM - 4.47%\n\nJNJ - 4.40%\n\nMSFT - 4.35%\n\nVTRLX - 1.06%\n\nCash - 0.14%",
        "created_utc": 1617378463,
        "id": "gt5fyjs",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617407263.0
    },
    {
        "author": "Mcdolnalds",
        "body": "NVDA, AMD, and ROKU all safe bets for the coming years?",
        "created_utc": 1617304339,
        "id": "gt2a830",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617333139.0
    },
    {
        "author": "Shaun8030",
        "body": "Stocks :\n\nMSFT , AAPL , Amzn , GOOG , Dis, QCOM , Nvidia , Amd, TSM, SQ , Pypl, , Shop, Shop , Tsla , BTC ,Adbe. \n\nETFs\n\nQQQM, QQQJ, VGT , SMH , WCLD, ARKW, ARKG,ICLN",
        "created_utc": 1617370393,
        "id": "gt50r1a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617399193.0
    },
    {
        "author": "7thprincess",
        "body": "Looking for options right now. Not sure exactly what to do.\n\n- early 20s, us.\n- in college, but debt free / making 60k this year through various sources \n- have about 200k saved up from my options trades, mostly gme. Currently have most of it in the stock market\n- looking for a high yield investment stream that I can eventually leverage into real estate. I'm okay with high risk. Usually my options accounts fluctuate about 5-10% a day. \n- time horizon 10 years.\n\nCurrently holding: \n- amd 100c 6/22 leaps 10% \n- a couple nav spacs as an alternative to cash 15%\n- selling puts on a bunch of random tech stocks. 30%\n- costco 20%\n- uuuu 5%\n- blue 5%\n\nMost of these with the exception of cost and amd are swing trades.\n\nLooking for a solid long growth port. Don't think that a retirement account is necessary yet considering I'm still in school. Thinking about moving into the following stocks as long holds:\n\n- virt \n- cost\n- amd\n- nvda\n- tsm\n- road \n- f\n- aapl \n- net\n\nAt a quick glance a lot of the stocks Id like to pick up have a high correlation.\n\nI'm aware I need to diversify into other categories and sectors but not really sure how to build a port. \n\nWould love some advice and suggestions.",
        "created_utc": 1617269984,
        "id": "gt0hna4",
        "score": 1,
        "subreddit": "investing",
        "created": 1617298784.0
    },
    {
        "author": "ALittleSalamiCat",
        "body": "After an entire month of verbally abusing NVDA... I’m finally gonna buy her flowers and tell her baby I’m sorry",
        "created_utc": 1617295431,
        "id": "gt1ql2p",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617324231.0
    },
    {
        "author": "WitnessAppropriate",
        "body": "Any thoughts on NVIDIA or MICRON? I want to move part of my investiments to semiconductors. I know more about NVIDIA (currently writing from a laptop with their tech) but as far as I\\`ve been reading Micron seems to have more room for growth.",
        "created_utc": 1617306291,
        "id": "gt2eg5u",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617335091.0
    },
    {
        "author": "king_of_nothing0",
        "body": "Wait that seems really biased I mean do you not hear yourself? I owned a lot of Intel stock but AWS is moving to Arm Graviton chips and Apple left Intel for AMD’s M1 arm chips. \n\nThey’re hemorrhaging say center marketshare to AMD and this is before those Arm chips are even out. Same with Nvidia whose acquiring Arm and is going heavy on data centers as well.\n\nIntel is extremely important to the American government and military but at best that makes them IBM. If Intel doesn’t start manufacturing low energy chips to compete with Arm they could be in serious trouble years down the line don’t you think?",
        "created_utc": 1617398610,
        "id": "gt6k6wq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617427410.0
    },
    {
        "author": "yeti_man82",
        "body": "I want to add NVDA and maybe ADBE to my portfolio. Good moves right now?",
        "created_utc": 1617469649,
        "id": "gt9fhlv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617498449.0
    },
    {
        "author": "beyersm",
        "body": "I'm very long on AMD. I have always been an Intel guy and for a long time they were clearly the better chip, same with Nvidia on the GPU side. AMD was always kind of a step or 10 behind. Now I can confidently say that my next PC build will without a doubt have an AMD CPU and GPU. It is actually incredible what this company has been able to achieve.\n\nOn top of just being innovative in the industry and competing with the two biggest names in their industry they have some great leadership. Lisa Su is a visionary and I don't think the company would be where it's at today without her.\n\nThere are some issues in the GPU supply chain atm but the story is the same for Nvidia and not a unique issue for AMD, so although this poses some challenges in the short term I don't see it becoming a huge issue long term. Additionally, unless I've missed something, Apple still uses AMD for their graphics, but like with Intel on the CPU side, they could lose this source of revenue soon. It just depends on how successful Apple is at cutting out the 3rd party processors and replacing them.\n\nThe only issue I see as unique for AMD is that they still lag behind on some of the lower end chips. As high as the tech world is on AMDs new GPU and the higher end Ryzen CPUs, most PC builders don't have a 5-10k budget. For now, Intel still gets you better performance for your dollar on the CPU side but the margin is closing. Nvidia still also has a clear edge on the lower-mid range GPUS.\n\nAll said though, AMD is here to stay and is going to be making noise in their industry for a long time. I don't expect to ever sell my shares honestly.",
        "created_utc": 1617505371,
        "id": "gtb7uqp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617534171.0
    },
    {
        "author": "WitnessAppropriate",
        "body": "which company would you recommend? I have money on dell but tbh I don\\`t think it\\`s as smart as investing in Micron or Nvidia",
        "created_utc": 1617462362,
        "id": "gt91o8d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617491162.0
    },
    {
        "author": "D34DC3N73R",
        "body": "As pointed out, the server and laptop markets are what's ripe for the picking for AMD. And you better believe people/companies running server farms and designing/producing laptops are putting plenty of research before making purchases of that scale. As far as investment goes, having your own fabs is great, until it's not, like we've seen over the past 3 years. What tips the scales in AMDs favor IMO is their involvement in GPUs as well as CPUs. Their current gen GPUs are actually pretty solid pound for pound, but lack features like DLSS, NVENC, CUDA etc. If they get the software tools figured out, and are able to meet demand, they could have a valuation above Nvidia.",
        "created_utc": 1617408730,
        "id": "gt72ome",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617437530.0
    },
    {
        "author": "musicafishionado",
        "body": "If Nvidia does acquire ARM (highly unlikely) China would be blocked from making chips and they're not gonna react kindly. Take that as you will.\n\nThere is nothing stopping Intel and AMD from producing ARM chips except for themselves. They already have the licenses and will begin developing when ARM is past its infancy in the data center world. Let deeper pockets be the pioneers, let all the software transitions happen (x86 software is not compatible with ARM), then poach their engineers. Intel and AMD are sitting back and letting AWS and Apple try their hand at ARM on purpose.\n\nIBM thrived on providing services that were being phased out. x86 isn't going to be phased out this decade and Intel will begin ARM chip production for clients in 3 years. IBM is dying, Intel is 3 years away from the start of unrivaled growth and has potential to eventually surpass TSMC as the industry leader in chip production thanks to the gov/mil backing within 20 years.\n\nIf you're looking for big gains in the next 2-6 years Intel is probably not the stock for you. It's at a 13 P/E ratio because people perceive it like IBM which is fine with me, I'll keep adding.\n\nNo clue what TSMC will plan to do after 3nm to prevent stagnation. For now they are the leader but physics doesn't let you go smaller than 3nm, possibly 2nm. At 3 times less earnings per dollar than Intel and lacking vertical integration... I'll happily put my dollars to work in Intel.",
        "created_utc": 1617409546,
        "id": "gt742zz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617438346.0
    },
    {
        "author": "kidruzen",
        "body": "NVDA",
        "created_utc": 1617283111,
        "id": "gt10nug",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1617311911.0
    },
    {
        "author": "TechnicalDesign",
        "body": "fuck why did I go with fucking trash aapl when i couldve gone amzn msft goog tsm nvda fk these wouldve printed fuck",
        "created_utc": 1617297225,
        "id": "gt1ukhn",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1617326025.0
    },
    {
        "author": "sticknstone3",
        "body": "are my nvda puts going up?",
        "created_utc": 1617319624,
        "id": "gt35lqa",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1617348424.0
    },
    {
        "author": "Pea-Tear-Grifffin",
        "body": "Some little background on options. \n\nOver simplified: they are a bet that a specific stock will be above (call) or below (put) a certain price (strike price) by a certain day. Each contract/option is for 100 shares. \n\nTo read this: \n\nNVDA - Nvidia \n\nApr 16 2021 - This is the expiration date or deadline (this friday). \n\n500 Call - 500 is the strike price. And if the stock isn't above 500 (call) by April 16 2021, then the options expire worthless. \n\nCost/share: OP paid 30.01 per share to buy these options (not the stock...just the options...more on that later). And remember, each option is a 100 shares and OP bought 80. So....80 contracts* 100 shares per contract * 30.01 cost/share = $240,000 bet. \n\nWho gets that money? The person who is putting up the shares. That is, someone (could be ultiple people) who owned 8,000 shares. That person got a $240,000. \n\nHere's where it gets a little complicated. You can buy and sell the option contracts itself. The value of those contracts is directly related to how much time is left before the expiration date and whether the options already are over the $500 strike price (or \"in the money\"). \n\nAs these options are already in the money (current nvidia price is like $612/share). The value of each contract is $127.20 per share. So, 80 * 100 * 127.20 = 1,017,600.",
        "created_utc": 1618430153,
        "id": "guixfc7",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1618458953.0
    },
    {
        "author": "Heggemony",
        "body": "This mad man made a bet $240k bet that NVDA would be at least $530 (to break even) by 4/16. Since NVDA is at 611 now.. You can see this result since options are leveraged (he basically paid $30 per share to get all the movement above $530 in his pocket). Now if NVDA was below 530 (like in early March) he would have lost $240k.",
        "created_utc": 1618427215,
        "id": "guiqog0",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1618456015.0
    },
    {
        "author": "funkgerm",
        "body": "Story time.\n\nWhen I was a kid back in 04 or 05, my dad asked me if I were to buy any one stonk, which would it be? I told him NVDA only because I loved playing video games and he had just gotten me a new Nvidia graphics card and I was stoked to be able to play Counter Strike with good FPS.\n\nHe said he'd get 500. In my head, I thought he got $500 worth. I completely forgot about it for about the last 15 or so years. Yesterday I called him and asked \"Hey remember when you bought $500 worth of Nvidia stock? It's probably worth like 40 grand now if you're still holding it!\" \n\nHe said he was still holding, but made one correction. He didn't buy $500 worth, he bought 500 shares, and it's now worth over $300k.\n\nMoral of the story? Stonks only go up.",
        "created_utc": 1618425784,
        "id": "guinezy",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1618454584.0
    },
    {
        "author": "Akintunde",
        "body": "I'll do my best:\n\nIt's a call with a 500 strike price (nvda is over 600 now). He has 80 contracts with a per share cost of 30.01, so each contract is $3001. He can buy 8000 shares for 500 each, and at a cost of 30 per share he makes 80 per share in profit.\n\nThe 80 calls cost 240k, 8000 stock at a 500 purchase price is 4m, and at 625/ share those 8k are worth 5m. So he made $1m in profit, minus the 240k cost, thus a gains of 760k.\n\nAlso note the value has other factors including IV, time to expiry (which I believe is called theta) and some other stuff.",
        "created_utc": 1618427508,
        "id": "guirccd",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1618456308.0
    },
    {
        "author": "TheQuasarian",
        "body": "Whales fine tuning their algos. Nvidia GPUs and AMD EPYC CPUs getting deployed. Moonshot imminent.",
        "created_utc": 1618421937,
        "id": "guier7n",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1618450737.0
    },
    {
        "author": "Kernell-4skin",
        "body": "LMFAO  \ni sold nvidia as 2 days ago then it went up +100",
        "created_utc": 1618425350,
        "id": "guimg8y",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1618454150.0
    },
    {
        "author": "kidruzen",
        "body": "NVDA 570 tomorrow",
        "created_utc": 1617763966,
        "id": "gtnam8z",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1617792766.0
    },
    {
        "author": "TuaTurnsdaballova",
        "body": "I love how insane gains come when you daytrade options. Thank you NVDA for bouncing off that $616.\n\n\n*but also you can lose money so so quickly daytrading options too so be careful kids!*",
        "created_utc": 1618410976,
        "id": "guhpiny",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1618439776.0
    },
    {
        "author": "RPMayhem",
        "body": "To make a DD on semiconductors or to be lazy and wait for someone else to write what I already know. I'll probably stay lazy and let the stocks speak for themselves.\n\nPositions: AMD x75 may calls, NVDA x10 LEAPS, TSM shares, SOXL x25 2023 LEAPS deep ITM",
        "created_utc": 1617821819,
        "id": "gtpxwmx",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1617850619.0
    },
    {
        "author": "awilddillyman",
        "body": "NVDA $580 4/9 call paying my rent rn",
        "created_utc": 1617820870,
        "id": "gtpvodx",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617849670.0
    },
    {
        "author": "Ok-Initial-6047",
        "body": "AAPL\n\nMSFT\n\nNVDA\n\nDIS\n\nSQ\n\nBETZ",
        "created_utc": 1617992957,
        "id": "gtyjvs8",
        "score": 5,
        "subreddit": "stocks",
        "created": 1618021757.0
    },
    {
        "author": "michivideos",
        "body": "# GME TESLA NVIDIA  ARE ON CRACK\n\nImm a look from far just in case.",
        "created_utc": 1618413656,
        "id": "guhvjt2",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618442456.0
    },
    {
        "author": "jnicholass",
        "body": "My NVDA calls are tanking my portfolio",
        "created_utc": 1617719794,
        "id": "gtko24m",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617748594.0
    },
    {
        "author": "BedtimeTorture",
        "body": "Haven’t traded all week was taking a break. But, retards I’m back.\n\nBought Some SPY 412 calls for Monday\nNVDA 600C 4/16\nJMIA 38C 4/16\nAdded more September MT calls as well\n\nHave a lovely weekend you degenerates",
        "created_utc": 1617997510,
        "id": "gtytuv9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618026310.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "Did Nvidia announce its alliance with the Gay?",
        "created_utc": 1617730060,
        "id": "gtlbfup",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617758860.0
    },
    {
        "author": "AlternativeSugar6",
        "body": "What did y'all buy during early March and what's your biggest earners since then? I bought TGT (+19%), NVDA (+14%), TSM (+14%)",
        "created_utc": 1617647674,
        "id": "gthcq1w",
        "score": 5,
        "subreddit": "stocks",
        "created": 1617676474.0
    },
    {
        "author": "qqeyes",
        "body": "If NVDA hits 625 I’ll buy a churro\n\nedit: that’s a mexican donut for you uncultured swine",
        "created_utc": 1617857101,
        "id": "gtrwkdk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617885901.0
    },
    {
        "author": "970790",
        "body": "Amzn down, Tesla up, net up, chwy up, nvda down",
        "created_utc": 1617826275,
        "id": "gtq8byz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617855075.0
    },
    {
        "author": "LovableContrarian",
        "body": "Puts on Nvidia.\n\nThat rally was nonsense. Headline came out that they were going to make niche server chips in like 2023, and shit rallied like 10% and INTC dropped like 5%. Absolute nonsense. Will go back to equilibrium.\n\nIts free real estate.",
        "created_utc": 1618416480,
        "id": "gui22rs",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1618445280.0
    },
    {
        "author": "BigBetOne",
        "body": "nvda where you going",
        "created_utc": 1618409498,
        "id": "guhmbj0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1618438298.0
    },
    {
        "author": "RyChrome",
        "body": "$NVDA is such a beast man",
        "created_utc": 1617297142,
        "id": "gt1udwi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617325942.0
    },
    {
        "author": "realister",
        "body": "screw Nvidia, computers are useless scams.",
        "created_utc": 1617735802,
        "id": "gtloj8d",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617764602.0
    },
    {
        "author": "dysenterygary69",
        "body": "Remind me why I sold NVDA on 3/25 again?",
        "created_utc": 1617911583,
        "id": "gtukjy5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617940383.0
    },
    {
        "author": "NrdRage",
        "body": "$NVDA is at a very important pivot point.  For the first time in its last 4 tries, it's held 557 for more than a couple of candles.  If it can hold it out for the remainder of the day, there's gonna be nothing but helium between it and 575.",
        "created_utc": 1617650705,
        "id": "gthjc5h",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617679505.0
    },
    {
        "author": "Double-Minimum-9048",
        "body": "AMD, NVDA,SOXL semiconductor gang🤑🤑🤑",
        "created_utc": 1617289627,
        "id": "gt1dp1t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617318427.0
    },
    {
        "author": "lavishcoat",
        "body": "My gains in HD since January are more than my NVDA gains over last 7 months 🤡",
        "created_utc": 1617323036,
        "id": "gt3bqpx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617351836.0
    },
    {
        "author": "1811pharmx",
        "body": "My never-ending curse of misfortune never ceases to amaze me. \n\nAs soon as I manage to get in on NVDA calls, I single-handedly ended up setting the top, and it shit the bed for the remainder of the fucking day.",
        "created_utc": 1617826271,
        "id": "gtq8bmd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617855071.0
    },
    {
        "author": "flashbang_28",
        "body": "Why isnt AMD acting like NVDA? Is this a hold? Anyones opinion is appreciated. Thnaks",
        "created_utc": 1617892819,
        "id": "gttcqbl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617921619.0
    },
    {
        "author": "angelsgirl2002",
        "body": "I gotchu fam.\n\nGameStop Stock Mania Is Making Its Turnaround Possible\n\nThe Reddit-fueled surge in the video-game retailer’s share price is paying off, helping to raise cash and boost its chance of success.\n\n\nWhat a crazy year it’s been for GameStop Corp. Last April, it was left for dead. Predicting an imminent demise for the retailer, hedge funds piled on their bearish bets and the company’s market value sank to a few hundred million dollars. A year later, thanks to big buying from the Reddit crowd, GameStop is worth about $13 billion and is now looking to raise as much as $1 billion in capital to fund internet entrepreneur Ryan Cohen’s turnaround plan. This year’s GameStop stock mania may make its business transformation possible.\n\nThe retail investor frenzy over GameStop shares has been well covered. But the stock’s rally has some fundamental underpinnings. It is not a coincidence that the surge began days after Cohen was appointed to its board on Jan. 11. Since joining in an official capacity, the co-founder and former chief executive officer of online pet-supply retailer Chewy Inc. has moved quickly, taking control of the company’s strategy and pivoting it faster toward e-commerce. He has hired nine executives — five of whom had experience at Amazon.com Inc. — including a new chief operating officer and chief technology officer. Several of the additional hires also came from Chewy, a sign of confidence from former colleagues in COhen’s abilities. Now, the company is raising the funds needed to implement his plan.\n\nEarly Monday, the company announced it will sell as much as 3.5 million shares worth as much as $1 billion in an “at-the-market” stock offering. It said the funds will be used to “accelerate its transformation” and strengthen its balance sheet. The video-game retailer also announced that its revenue for the five weeks ended April 2 increased by 18% compared with a year earlier, negating a part of the naysayers’ thesis that it is a declining business. While GameStop shares slumped in early trading Monday on news of the share sale, they recovered a bit as the day wore on, pointing to investor optimism for Cohen’s plan.\n\n It is a prudent and necessary move. With GameStop’s share price up nearly 900% this year, the company will be able to raise significantly more funds to expand its e-commerce capabilities. The turnaround plan outlined in its latest annual report includes building fulfillment operations for faster delivery times, overhauling its website and starting a U.S.-based customer service operation. All these initiatives are needed to improve GameStop’s customer experience and will require significant investments.\n\n GameStop’s latest executive hire may tip off even bigger ambitions. Last week, the retailer said it had appointed Elliott Wilke as its chief growth officer. Wilke spent the last seven years in senior roles at Amazon, including stints at Amazon Fresh, Prime Pantry and Worldwide Private Brands. His experience at the e-commerce giant’s private-label business may mean GameStop intends to some day launch its own branded hardware products such as gaming mice, keyboards and other higher-priced items such as gaming PCs. If successful, this kind of move could generate higher profit margins much the same way as Amazon’s AmazonBasics and Costco’s Kirkland Signature product lines.\n\nIn another noteworthy development, GameStop has ramped up its offerings in the PC gaming hardware market in recent weeks. The retailer is releasing five-page weekly ad circulars focused on this niche, selling items such as $400 gaming monitors and $1,000 Nvidia graphics cards. PC gaming is a large and growing area and is not cyclical like the retailer’s core console-gaming market. On the back of its better-known brand, GameStop should be able to take market share from other PC e-commerce players such as Newegg and Micro Center.\n\nIn just a few months, Cohen has revamped GameStop’s senior management, adding executives with the required relevant technology backgrounds, while setting a clear vision for the company’s future and moving further into attractive product areas. This is an impressive amount of progress in a short time frame. With the coming fund raise, the company will have the capital to fully execute on Cohen’s vision. The so-called smart money should take notice.",
        "created_utc": 1617805836,
        "id": "gtowyv5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617834636.0
    },
    {
        "author": "superhappykid",
        "body": "Sigh. Don’t talk to me about nvda. I fked up on that stock so many times. Regret. Should of just bought a leap and left it. \n\nOk those stocks you listed I agree with. The problem here is that there just isn’t enough money to go around to all these stocks. Undervalued yes. If you have the patience to wait go ahead. But you will need to get leaps or shares. Calls will kill you.",
        "created_utc": 1617842108,
        "id": "gtr58cy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617870908.0
    },
    {
        "author": "Kuntry_Roadz",
        "body": "MU, TSM, NVDA, INTC, SOXL, AMAT",
        "created_utc": 1617896744,
        "id": "gttlqe3",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617925544.0
    },
    {
        "author": "maxkingusa",
        "body": "NVDA and AMD have performed amazing over the past few days.  Both are running on strong volume.  I still believe they head back to prior highs and the earnings stories for both are still intact.  \n\nI am also loading up on oil names.  SLB, HP, XLE.  I think Oil goes much higher this year based on research from Goldman and others.",
        "created_utc": 1617289857,
        "id": "gt1e74n",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617318657.0
    },
    {
        "author": "bryanx92",
        "body": "I know it’s a long hold but can you dip a little nvda",
        "created_utc": 1617294578,
        "id": "gt1op21",
        "score": 3,
        "subreddit": "stocks",
        "created": 1617323378.0
    },
    {
        "author": "MizzyExists",
        "body": "NVDA just said fuck it im soaring",
        "created_utc": 1617717786,
        "id": "gtkjp9d",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617746586.0
    },
    {
        "author": "MilesOfKings",
        "body": "Guh. I hadn’t seen what NVDA was doing since I sold at 520. Guhhh",
        "created_utc": 1618406485,
        "id": "guhg6nr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618435285.0
    },
    {
        "author": "adjacent-analyst",
        "body": "fuck you too nvidia",
        "created_utc": 1618409910,
        "id": "guhn7md",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618438710.0
    },
    {
        "author": "gottheguapp321",
        "body": "NVDA is absolutely murdering me jesus",
        "created_utc": 1618410487,
        "id": "guhogsw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618439287.0
    },
    {
        "author": "igoldring",
        "body": "Can Tesla, SQ, and NVDA please recover my calls suck rn",
        "created_utc": 1618410174,
        "id": "guhnsfb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618438974.0
    },
    {
        "author": "gottheguapp321",
        "body": "NVDA with the best comeback of all time",
        "created_utc": 1618412140,
        "id": "guhs403",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618440940.0
    },
    {
        "author": "Sniffmahfinger",
        "body": "&gt;cally paid $30 per share to get all the movement above $530 in his pocket). Now if NVDA was below 530 (like in early March) he would have lost $240k.\n\nLOL!  UH HUH",
        "created_utc": 1618429223,
        "id": "guiv8vb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618458023.0
    },
    {
        "author": "kidruzen",
        "body": "NVDA 580 tomorrow ?",
        "created_utc": 1617856491,
        "id": "gtrvojw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617885291.0
    },
    {
        "author": "belangem",
        "body": "Now compare NVDA last 6 months with pretty much any sector ETF (XME, XLE, XLF, SLX) and ask yourself why you put so much effort into this.",
        "created_utc": 1617323251,
        "id": "gt3c4hi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617352051.0
    },
    {
        "author": "Sandwich_Embarrassed",
        "body": "I feel like idiot for selling my FB and nvda calls early",
        "created_utc": 1617820727,
        "id": "gtpvcby",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617849527.0
    },
    {
        "author": "fenwickfox",
        "body": "I was looking at a Volvo EV as a next car, but the videos I've seen of QNX are very lacklustre. I expect tablet-like technology and function, not that shit pseudo-tech I see in cars right now that looks like an old Garmin GPS system. That's why I can't get behind BB right now with players like Nvidia in the same space. However, as a Canadian, I want to be.\n\nI guess when the time comes I'll test-drive and see for myself. A great deal for BB!",
        "created_utc": 1617806689,
        "id": "gtoytzi",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1617835489.0
    },
    {
        "author": "maxkingusa",
        "body": "NVDA and AMD performing well and headed back to ATH. \n\nI continue to invest in oil related stocks, etc.  SLB, XLE, HP and I am looking to add some more if anyone has recommendations.\n\nOther stocks I have kept adding too are MAR, WYNN and WFC.  They still have a ways to run given the economy reopening. WFC is being reinvented so I think it is worth going along for the ride.\n\nI am amazed how fast the S&amp;P is getting to 4100.",
        "created_utc": 1617809432,
        "id": "gtp4za8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617838232.0
    },
    {
        "author": "BrassMonkey324",
        "body": "Yes. SaaS companies in particular are what I believe are undervalued. Not because they are actually undervalued on a multiple level, but because they are based on ARR and are secular.   \n\n\nCRM, CRWD, NOW, etc... Software companies that are usage based but don't lose a single customer like TWLO. Chip makers like NVDA, TSM, AMD. Shit is about to rip, these are the companies of the future and everyone should be buying them.",
        "created_utc": 1617841933,
        "id": "gtr4vxv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617870733.0
    },
    {
        "author": "Rico_Stonks",
        "body": "Tech is actually a very broad term though. If a company isn't innovating and developing new technologies to better themselves then they're doomed to follow the dinosaurs (eventually).\n\nYou can and should be diverse within \"tech\" (e.g. chips=NVDA, industrial=RTX or TER, fintech=SQ, retail=AMZN, ads=GOOG, entertainment=NFLX, hospitality=ABNB, software, hardware, clean energy, health, etc...). But there will be risk because most of these are growth, and their valuations will look less enticing if there are macro changes in the economy.",
        "created_utc": 1617990762,
        "id": "gtyexgz",
        "score": 2,
        "subreddit": "stocks",
        "created": 1618019562.0
    },
    {
        "author": "Master_Relative",
        "body": "NVDA power hour to $585",
        "created_utc": 1617905689,
        "id": "gtu6x52",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617934489.0
    },
    {
        "author": "Parvolo",
        "body": "I need GME to moon because I just got contacted that NVIDIA gave gamers a big kick in the dick by stopping the production of 3080's, meaning that I have been waiting for jack shit since November since now my order got cancelled. I need the tendies to get an AMD card now since every card quadrupled in price....",
        "created_utc": 1618405709,
        "id": "guhepmr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618434509.0
    },
    {
        "author": "Swathe88",
        "body": "NVDA with the rocket ship pattern on the 1 min candle chart. Mooning soon.",
        "created_utc": 1618407728,
        "id": "guhingm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618436528.0
    },
    {
        "author": "gottheguapp321",
        "body": "NVDA is tearing me a new one fuck",
        "created_utc": 1618409350,
        "id": "guhm0bc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618438150.0
    },
    {
        "author": "mamadidntraiseabitch",
        "body": "Funny thing is I made another mistake this week so it really adds fuel to the fire. I had gotten a friend to loan me a small amount of money to build everything back up. I bought NVDA calls right before the massive run up. I sold for a small gain. Fat fingered puts on NVDA. Had to day trade out of them. Broke the PDT rule. Now my account is on lock for 3 months. Had I just held, I would have made everything back. This stings so much. But yeah, you are right. Shoulda coulda woulda is a waste of time to think about. It really does humble you. I sure hope you succeed again on your journey. It’s nice to know that you’re not alone in this thing we call life especially in these circumstances. If you need someone to talk to during the next few weeks, pm me.",
        "created_utc": 1618424597,
        "id": "guiktgd",
        "score": 2,
        "subreddit": "options",
        "created": 1618453397.0
    },
    {
        "author": "RyChrome",
        "body": "so $NVDA you got any more of those 10 baggers",
        "created_utc": 1618419143,
        "id": "gui88p1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618447943.0
    },
    {
        "author": "Gaston44",
        "body": "NVDA getting wrecked, every day it's something",
        "created_utc": 1617730585,
        "id": "gtlcnbb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617759385.0
    },
    {
        "author": "Bambam60",
        "body": "Just got vaccinated.\n\nCurrently fighting off the massive urge to buy puts. I think I’m gonna win this one\n\nLong $PINS $SQ $NVDA",
        "created_utc": 1617731662,
        "id": "gtlf4x4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617760462.0
    },
    {
        "author": "kela1303",
        "body": "I currently have about half of my savings in VWCE and about 3% in bitcoin. I am looking to buy Microsoft, Apple, Green Thumb Ind and Nvidia. I need some advise on interesting value stocks.",
        "created_utc": 1617732233,
        "id": "gtlgghm",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617761033.0
    },
    {
        "author": "qwert1225",
        "body": "FLY NVIDIA FLY",
        "created_utc": 1617732668,
        "id": "gtlhg46",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617761468.0
    },
    {
        "author": "AccountantOk111",
        "body": "I own micron but love tsm and amd and nvda also semi etf is good",
        "created_utc": 1617654229,
        "id": "gthr2i0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617683029.0
    },
    {
        "author": "Jolly-joe",
        "body": "Established clean energy stocks with good financials like $TPIC $NOVA $RUN $NEE. Semiconductor stocks might be a good play with how future tech, like self driving cars, machine learning systems, spacecraft, etc will rely on these firms' hardware $TSM $AMD $NVDA.",
        "created_utc": 1617728675,
        "id": "gtl897k",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617757475.0
    },
    {
        "author": "RyChrome",
        "body": "$NVDA going the wrong way now smh",
        "created_utc": 1617728849,
        "id": "gtl8nn3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617757649.0
    },
    {
        "author": "RyChrome",
        "body": "- $FB $315 5/14 call\n\n- $ROKU $365 5/14 call\n\n- $NVDA $600 5/14 call\n\n- $V $220 5/14 call",
        "created_utc": 1617805647,
        "id": "gtowk89",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617834447.0
    },
    {
        "author": "Investingwifey",
        "body": "I like Nvidia  too but don’t have a position.  I should have taken one awhile back but missed it.  If it ever has a substantial drop I’ll probably take a position",
        "created_utc": 1617827715,
        "id": "gtqbmsj",
        "score": 2,
        "subreddit": "investing",
        "created": 1617856515.0
    },
    {
        "author": "itsnotthatbad21",
        "body": "Lol everything flat today NVDA is like hold my beer",
        "created_utc": 1617821068,
        "id": "gtpw511",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617849868.0
    },
    {
        "author": "ElegantBiscuit",
        "body": "Apple *designs* their own chips, but TSMC manufactures them. AMD also designs their own chips and has them made by TSMC, Nvidia has their chips made by both TSMC and Samsung, and Intel and recently Samsung both design and manufacture their own chips. There are other players too, like IBM has GlobalFoundries make their chips. \n\nI’d recdomend [this](https://www.youtube.com/watch?v=CkNn98WE5_k) video by a YouTube channel called TechAltar if you want to learn more about the chip making process, because it’s definitely interesting on its own but also important if you want to get into investing in some of these big tech companies.",
        "created_utc": 1617836487,
        "id": "gtquakg",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617865287.0
    },
    {
        "author": "Cygopat",
        "body": "NVDA flying under the radar imo",
        "created_utc": 1617886154,
        "id": "gtsyzrc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617914954.0
    },
    {
        "author": "MikBor",
        "body": "Yes they merged with Intel and Nvidia and Tesla.",
        "created_utc": 1617814116,
        "id": "gtpfw5b",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617842916.0
    },
    {
        "author": "RyChrome",
        "body": "anyone else holding $NVDA $V $ROKU or $SQ",
        "created_utc": 1617897513,
        "id": "gttnjfl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617926313.0
    },
    {
        "author": "bluen",
        "body": "NVDA AMD TEXASS INTRUMENTS",
        "created_utc": 1617909445,
        "id": "gtufk6u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617938245.0
    },
    {
        "author": "JakubOboza",
        "body": "* China is pushing Aircraft carrier near Taiwan (former Formosa) and already did many Fighters manouvers around island.\n* China officials keeps talking about destroying bunkers and war all the time.\n\nWhy ape like you should care ? Remember silicon shortage ? TMSC is making chips for Apple , AMD and a lot more.\n\n&amp;#x200B;\n\n* TMSC is in Taiwan\n* TMSC makes chips for APPLE, AMD\n* We have massive silicon shortage\n* War is not good thing for silicon shortage\n\nPuts on AMD {GPU, CPU}, APPLE, Playstation and Xbox\n\nCalls on Nvidia (Nvidia is making their silicon in Samsung factories in Korea)",
        "created_utc": 1617982490,
        "id": "gtxvwv7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618011290.0
    },
    {
        "author": "MilesOfKings",
        "body": "Why am I still mad about selling 50 shares of NVDA @ 520 when I’m about to get rich off PLTR!? It’s like being mad your wife is cheating when the 18yr old middle eastern girl w D cups who lives next door wants you. Shit.",
        "created_utc": 1618407550,
        "id": "guhiak4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618436350.0
    },
    {
        "author": "kidruzen",
        "body": "NVDA I need u to go!",
        "created_utc": 1617723205,
        "id": "gtkvo9f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617752005.0
    },
    {
        "author": "BadTrad3r",
        "body": "AMD holders with technical background I recommend you check out a yt channel called Coreteks (not mine I wish). The guy do a very good analysis of the tech site of cpu and gpu. You will need to at least know what Von Neumann and how CPU works before watching him though LOL, it's very technical but entertaining if you understand it. The semi-conductor war is getting very hot at the moment between NVDA, AMD and INTC",
        "created_utc": 1617727138,
        "id": "gtl4ohu",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617755938.0
    },
    {
        "author": "franco9494",
        "body": "TSM 130c \nBA 250p \nSPY 408c \nNVDA 520p",
        "created_utc": 1617638135,
        "id": "gtgrmfh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617666935.0
    },
    {
        "author": "cryptooakmont",
        "body": "I shorted nvidia that trash stock",
        "created_utc": 1618426494,
        "id": "guip13w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618455294.0
    },
    {
        "author": "dicklightning94",
        "body": "It’s not even just Apple it’s a lot of tech. AMD NVDA AMZN FB etc are all at similar levels as they were in September and some are even lower. Granted they did have a huge bull run in the months prior, but spacs had a huge bull run in the months prior to this too",
        "created_utc": 1617327628,
        "id": "gt3jozj",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1617356428.0
    },
    {
        "author": "RyChrome",
        "body": "I'd like to introduce you to my two beautiful babies. $NVDA and $V",
        "created_utc": 1617282294,
        "id": "gt0z8w2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617311094.0
    },
    {
        "author": "bsthedog",
        "body": "Meme stocks almost always meme again eventually. CRSR isnt even a huge speculation bubble either, theyre only valued at 3 billion. For a company that youll likely want to buy a power supply from if youre using an AMD or NVIDIA desktop PC, and if not maybe a chair or keyboard, It's a very cut and dry valuation as if it paid boomer dividends. Theres even boot coon exposure because of their PSU products' reliability for sure. It's a holder.",
        "created_utc": 1617292020,
        "id": "gt1izd9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617320820.0
    },
    {
        "author": "Mad_Nekomancer",
        "body": "Stuff that's down for me today: MSFT, JPM, BFAM, VWDRY, GOOGL, SBRCY, TSM, BLK, SONY, NVDA. Kind of a mixed bag today for me, but +.4% overall.",
        "created_utc": 1617731734,
        "id": "gtlfau6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617760534.0
    },
    {
        "author": "PowerfulLier",
        "body": "Semis having a nice sale today (assuming its not a 7 layer dip) looking at $ON $NVDA $INTC",
        "created_utc": 1617730038,
        "id": "gtlbe0o",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617758838.0
    },
    {
        "author": "HazardousMako",
        "body": "Moore's Law, named after Gordon Moore? The Intel engineer?\n\nIntel the company who hasn't made any major breakthrough in almost 5 years?\n\nMaybe AMD or NVIDIA can remedy but lol.",
        "created_utc": 1617730434,
        "id": "gtlcau9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617759234.0
    },
    {
        "author": "jnicholass",
        "body": "NVDA moves in such an unpredictably retarded way, I can’t explain it.",
        "created_utc": 1617718857,
        "id": "gtklzou",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617747657.0
    },
    {
        "author": "NrdRage",
        "body": "I track 200 stonks.\n\nPresently, 3 of them are green: $NVDA, $AMD and....$SPY?\n\nMakes perfect sense",
        "created_utc": 1617809466,
        "id": "gtp524t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617838266.0
    },
    {
        "author": "Hexys_broken_dreams",
        "body": "Yo I'm sure some of you loved seeing my boy at NVDA down there in the low fighh hunits but we gotta peace out back up to 600 for now dawg",
        "created_utc": 1617808603,
        "id": "gtp33de",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617837403.0
    },
    {
        "author": "jnicholass",
        "body": "NVDA when SPY rips for 1%: \"Eh that's fine\"\n\nNVDA when SPY dips .01%: \"HOLY FUCKING SHIT, DUMP IT ALL\"",
        "created_utc": 1617726145,
        "id": "gtl2e7i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617754945.0
    },
    {
        "author": "gottheguapp321",
        "body": "Alright NVDA haha",
        "created_utc": 1618409135,
        "id": "guhlk4f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618437935.0
    },
    {
        "author": "gottheguapp321",
        "body": "Please NVDA have mercy",
        "created_utc": 1618409975,
        "id": "guhncpe",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618438775.0
    },
    {
        "author": "hobocommand3r",
        "body": "what was nvda price when you bought these?",
        "created_utc": 1618420784,
        "id": "guic0t3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618449584.0
    },
    {
        "author": "Master_Relative",
        "body": "NVDA get above $580 plz",
        "created_utc": 1617896926,
        "id": "gttm5w6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617925726.0
    },
    {
        "author": "BuffaloHustle",
        "body": "You need to be aware of what's going on in the broader market, and you need to be careful about what sort of timeline you are using when looking at these tickers.\n\nThe Nasdaq, Russel 2000, and Russel Microcap are all down from their peaks from 1-2 months ago. So naturally if you were to look at most of the tickers that make up those composites you will see that they are down from where they were 1-2 months ago. You could just as easily be listing Apple, Nvidia, AMD, Costco, etc etc in this post",
        "created_utc": 1617896063,
        "id": "gttk49e",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1617924863.0
    },
    {
        "author": "GMEstonkboy",
        "body": "Something with more upward mobility. Nvidia maybe",
        "created_utc": 1617918834,
        "id": "gtv12bs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617947634.0
    },
    {
        "author": "stonk_street",
        "body": "# $NVDA 580C gonna print tomorrow.",
        "created_utc": 1617830569,
        "id": "gtqi10u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617859369.0
    },
    {
        "author": "itsnotthatbad21",
        "body": "Amazing NVDA way to have a green start to red day lol",
        "created_utc": 1617634533,
        "id": "gtgjqat",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617663333.0
    },
    {
        "author": "PLTRGOD",
        "body": "NVDA? They bought ARM so im guessing everyone (from AWS to Raspberry Pis) has to buy arm processors?",
        "created_utc": 1617349112,
        "id": "gt4cwwd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617377912.0
    },
    {
        "author": "qwert1225",
        "body": "What do we think about NVIDIA chat",
        "created_utc": 1617331500,
        "id": "gt3q9xd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617360300.0
    },
    {
        "author": "GiantWhiteCohc",
        "body": "Hedging AMD with Nvidia. Truly one of us.",
        "created_utc": 1617285912,
        "id": "gt15wvc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617314712.0
    },
    {
        "author": "DroneCone",
        "body": "Yup that's a good point. MOBOs too. You can build a whole system with AMD stuff. Like I said, I don't really think you can go wrong with either long term. Might as well get some Nvidia too!",
        "created_utc": 1617440983,
        "id": "gt8a1qi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617469783.0
    },
    {
        "author": "clyspe",
        "body": "Is it really that bad to only invest in the materials sector? I can understand how both nvidia and intel could be linked in price, but I have a hard time thinking a lithium company and a wood company would have their stocks tied together by anything more than the market at large",
        "created_utc": 1617466409,
        "id": "gt99ap6",
        "score": 1,
        "subreddit": "investing",
        "created": 1617495209.0
    },
    {
        "author": "skilliard7",
        "body": "Is there a banned words list anywhere? I find it infuriating when I type a long post and it gets instantly removed due to 1 word, because automod doesn't care about context. A lot of times it comes down to 1 word which was an afterthought. For example, maybe it's a post about AMD or NVIDIA, and in one small snippet I mention a particular currency that makes their GPUs sell well, but the whole thing gets taken down because of it.",
        "created_utc": 1617473059,
        "id": "gt9m469",
        "score": 1,
        "subreddit": "investing",
        "created": 1617501859.0
    },
    {
        "author": "otherworldly_otter",
        "body": "As a PC gamer and custom PC builder for gamers, most of the new market gaming PC's are built on AMD processors.  The new CPU and GPU power share tech is next level and is going to make it difficult for Intel to keep up until they start to offer their own GPU, until then Nvidia will still own the GPU market. AMD is a strong CPU and GPU producer and may knock Intel off their thrown sooner rather than later.  Full disclosure I hold stakes in all 3 of these companies.",
        "created_utc": 1617503293,
        "id": "gtb4gu3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617532093.0
    },
    {
        "author": "BRlEN",
        "body": "AMD has been killing it with their new CEO Lisa Su. She toppled the giant of cpu's in Intel, whom are now floundering to compete. Now they have their eyes set on Nvidia in the GPU arena. I do not think Nvidia is as complacent as Intel but still have never been challenged. This last series by AMD really has pushed them into a 1-2 punch of top end CPU and GPU combos that can compete on both ends. They are still a bit behind at the ultra top end with server technology and production processes so Nvidia is on lock but with how the market is for GPUs and crypto they will sell regardless. I could see AMD push the boundaries versus Nvidia with server based gaming and other areas with their amazing momentum. I bought at 78 but anything below 100 is an amazing price.",
        "created_utc": 1617507513,
        "id": "gtbb8qd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617536313.0
    },
    {
        "author": "Common-Worldliness-3",
        "body": "Check out $ASX. You’re welcome \n\nhttps://www.google.com/amp/s/seekingalpha.com/amp/article/4417169-ase-technology-vs-amkor-an-analysis-on-worlds-leading-osats\n\n“Strategic Alliance between ASE and TSMC\nASE is based in Taiwan, one of the leading centers for outsourced semiconductor and electronics manufacturing in the world. Its close geographical proximity allows the company to benefit from strong manufacturing activity. It has maintained a strategic alliance with TSMC since 1997, the largest dedicated foundry with a market share of 56% of the foundry market revenues. The alliance has made ASE the preferred provider of packaging and testing services for TSMC clients. This allows ASE to benefit by leveraging TSMC's clients of leading companies including Apple (AAPL), Qualcomm, Nvidia (NVDA), MediaTek (OTCPK:MDTKF), NXP Semiconductors (NXPI) as clients who account for nearly half of ASE's revenues. Apple, Qualcomm and MediaTek are major players in the smartphone processor market and are developing 5G chipsets that require advanced packaging capabilities which ASE can provide. Given the long-standing relationship between TSMC and ASE, we expect the alliance between both companies to continue as it enables them to provide a total semiconductor manufacturing solution and the close geographic advantage between both market leaders. This means that ASE should be able to continue counting on TSMC's clients of leading chipmakers.”",
        "created_utc": 1617409431,
        "id": "gt73vw3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617438231.0
    },
    {
        "author": "Craino",
        "body": " TL:DR - looking for feedback on a simple hi return stock screen and thoughts on how to rank results.\n\nEarly 60's, simple, diversified, buy and hold retirement portfolio approach my whole life. Looking at working probably another 5-10 years and starting to get a lot more active in my portfolio. Nothing crazy and I'm fundamentally a conservative+ investor, but I do not subscribe to moving 100% into ultra safe right before retirement. Portfolio size is low 7 figure for reference.\n\nOver the past few months I subscribed to a couple of authors on Seeking Alpha and have tried out a few strategies with minimal exposure and have a good idea of how to use some of the approaches in my portfolio. I want to develop my own screens because at least on Seeking Alpha, the authors I've found charge a small monthly fee for their updates. It's nothing huge, and for me at least has been worth seeing their approaches, but nothing I want to pay for the rest of my life.\n\nI'm going to put together a dividend screen/strategy and a \"better than cash\" parking lot strategy. Pretty basic and straightforward. I also just got started on putting together a screen to identify a more hi growth strategy - thought being on a monthly basis invest in the top 4 stocks that fall out of the screen. Would love some feedback on the screen (I'm stock knowledgeable, but certainly not an expert). When looking at the screen and giving feedback keep in mind my objective: not looking for the perfect approach or for mega returns, I'm an 80/20 kinda guy so looking for a decent, simple to execute strategy to reliably give back a growth-class return. (And using the Fidelity screener as that's where my portfolio is).\n\nScreen as it stand currently:\n\n* Tagging Energy, Health Care, Financials, Information Technology and Industrials sectors\n* Market cap down to Medium (as defined by Fidelity: 6-33B)\n* 13 week price performance down to 13%\n* 3 yr annualized Beta of 1.1 and up (conflicted on whether this really helps the screen)\n* Very Bullish or Bullish analyst recommendations (Summary score from StarMine)\n* Forward EPS 3-5 yrs high to very high (16.5% and up)\n* EPS growth Projected year versus last year high to very high (40% and up)\n\nAs an example, running that screen today resulted in a list of 7 stocks (sorry not allowed to link image or would give you a shot of the fundamentals):\n\n1. AMAT - Applied materials\n2. FANG - Diamondback Energy\n3. EOG - EOG Resources\n4. NXPI - NXP SemiConductor\n5. KKR - KKR &amp; Co\n6. LRCX - LAM Research Corp\n7. MU - Micron Technology\n\nSo the thought would be to run this first day of every month and put a set amount in the top 4 stocks in the filter. I would guess some stocks might stay in for months, some might rotate in and out quickly.\n\nMy question is basically around how to rank. So do I just pick a screening metric (or some other metric) and do a simple rank on that metric to determine top 4, or do I create a formula to weight and aggregate multiple metrics into an overall score and rank on that?\n\nSorry for the long post - thank you to those who stuck with it and are willing to share your thoughts.",
        "created_utc": 1617376794,
        "id": "gt5cmwk",
        "score": 1,
        "subreddit": "investing",
        "created": 1617405594.0
    }
]