[
    {
        "author": "EerdayLit",
        "body": "Yeah, maybe Elon never said it publicly; but Peter Thiel has said a couple times that literally everyone at Paypal was on the spectrum.",
        "created_utc": 1620572573,
        "id": "gxi4njs",
        "score": 189,
        "subreddit": "wallstreetbets",
        "created": 1620601373.0
    },
    {
        "author": "HeckleHelix",
        "body": "I had to deposit more funds so I dont get flagged or called.  Guess I could just turn my phone off 😬.  Sounds like no big deal, except I already deposited all the funds to pay household bills this month.  C'mon PayPal, need you to rocket on Thursday!",
        "created_utc": 1620092631,
        "id": "gwuuz3m",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1620121431.0
    },
    {
        "author": "swistak84",
        "body": "&gt; “To  anyone I’ve offended, I just want to say, I reinvented electric cars  and I’m sending people to Mars in a rocket ship. Did you think I was  also going to be a chill, normal dude?”\n\nI also invented alternative reality where I didn't do a hostile takeover on Tesla - company started by two other guys I forced out of the company, after investing money I made off PayPal, that I could invest in because of blood emerald from the mine my family owned in Aperthaid South Africa.\n\nHe might have Aspbergers, but he's 100% asshole",
        "created_utc": 1620548778,
        "id": "gxh8r6v",
        "score": 81,
        "subreddit": "wallstreetbets",
        "created": 1620577578.0
    },
    {
        "author": "MagicSkullBus",
        "body": "Steve Jobs main trait was an \"aggressive marketer\". Assholes or not, world class marketers are a huge ingredient in world class companies. I'm not even a musk nuthugger but he couldnt have even bought the company without being successful already with paypal, your comment is so shit.",
        "created_utc": 1620544977,
        "id": "gxh4p1u",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1620573777.0
    },
    {
        "author": "shroomenheimer",
        "body": "That dude who YOLO'd RKT options then low-key edited his PayPal and cash app into the post once it hit front page 🤣",
        "created_utc": 1620316753,
        "id": "gx5wd81",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1620345553.0
    },
    {
        "author": "Motschekiebchen",
        "body": "I mean you could argue completely different.\nIt’s true that crypto went through cyclic movements in the past and that the market is currently pumping strongly.\nBut all those investment or adaptions from Tesla, Paypal or the listing of Coinbase could be seen as a sign of mass adoption. So maybe no cyclic bear market is coming for crypto and it remains relatively stable.\nIt’s all very speculative and you might as well ask your magic 8-Ball.\nIn my opinion this is a very interesting time to start to invest in crypto with good fundamentals. But I definitely would only start with a part of your money.",
        "created_utc": 1620214463,
        "id": "gx0jdmf",
        "score": 25,
        "subreddit": "investing",
        "created": 1620243263.0
    },
    {
        "author": "Goodboi209",
        "body": "Some completely true facts about Elon;\n\nHe got kicked out of a small website called x.com for being a dumbass. Peter Thiel then proceeded to turn it into the behemoth that is Paypal. He just happened to still hold stock as its value explodes. He did not found or build Paypal.\n\nTESLA WAS NOT FOUNDED BY ELON MUSK, it was founded by Martin Eberhard and Marc Tarpenning. Elon bought a majority stake in tesla and then proceeded to kick them out of their own vision and masquerade as a savior to humanity. \n\n\nIn depth debunking of the Elon and his assumed history\n\nPart 1\n\nhttps://m.youtube.com/watch?v=c-FGwDDc-s8 \n\nPart 2\n\nhttps://m.youtube.com/watch?v=DopFo1rjAr4\n\n\nHe has been lying about “self driving” coming out “this year” for 5 years despite the fact in recent emails they fucking told the DMV ITS NOT COMING.\n\nhttps://sys.4channel.org/derefer?url=https%3A%2F%2Fwww.forbes.com%2Fsites%2Fdavidsilver%2F2021%2F03%2F09%2Ftesla-emails-to-the-california-dmv-emphasize-continued-reliance-on-maps%2F%3Fsh%3D5d6468d057e6\n\n\nDid you know the only reason Tesla has a solar division is because musk used shareholder money to bailout his failing solar company?\n\nIs Elon musk a psychopath?\n\nDid you know he said he would “fire” his ex wife if she didnt dye her hair blonde?\n\nHe then proceeded to abandon her after having her bear 5 of his children.\n\nhttps://m.youtube.com/watch?v=01LK1hxpwcY\n\n\nVideo exposing Elon lying about FSD as well as video showing how useless and horrifyingly dangerous it truly is\n\nhttps://m.youtube.com/watch?v=PRKAH4d48Ic [Open]\n\nMeecedes Benz has been developing self driving since 1989, they have no technological lead.\n\nhttps://m.youtube.com/watch?v=I39sxwYKlEE",
        "created_utc": 1621199726,
        "id": "gyda3ds",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1621228526.0
    },
    {
        "author": "everybodysaysso",
        "body": "BABA seem to be gaining some attention on this sub and rightly so IMO. While talking about its valuation and growth are good. I think that the discussion on its venture arm is severely overlooked. I have looked into their investments in India and they will come out as bandits when these startups IPO. For example, BABA has invested in some of the biggest startups in India in their respective fields: Fintech (Paytm), e-com (Snapdeal), daily fruits/veggies/groceries (BigBasket), online delivery (Zomato). All these companies are highly successful and will be north of $50B in 5 years as more and more Indians get online. \n\nLast year because of escalation at government level between India and China, Alibaba halted their Indian investments. But I think they have already invested in Paypal, Doordash and Amazon of India and have even used the same playbook in other countries. \n\nIf China FUD was not a thing, Alibaba would make FANG look like boomers when their startup investments come to IPO. But again may be I am missing a piece of the puzzle somewhere. But for me, Alibaba itself is doing great, but I will continue buying since its my best way to gain exposure in upcoming behemoths in developing World.",
        "created_utc": 1621179834,
        "id": "gyc1z82",
        "score": 19,
        "subreddit": "investing",
        "created": 1621208634.0
    },
    {
        "author": "spirgnob",
        "body": "Yep [https://www.paypal.com/us/webapps/mpp/ua/cryptocurrencies-tnc?locale.x=en_US#fees-pricing](and according to them) there's a 2.8%-1.5% fee on top of their undisclosed 'spread'\n\n&gt;PayPal makes money when you buy and sell Crypto Assets. PayPal will charge a spread (or margin) between the market price we receive from our trading Service Provider",
        "created_utc": 1620872378,
        "id": "gxxkxlf",
        "score": 19,
        "subreddit": "investing",
        "created": 1620901178.0
    },
    {
        "author": "JBeibs2012",
        "body": "Elon didn't buy PayPal. He was a cofounder for a company called x.com that was doing something very similar. They merged and then they all made their millions.\n\nSorry about your Bitcoin losses...",
        "created_utc": 1621199214,
        "id": "gyd8ynr",
        "score": 18,
        "subreddit": "investing",
        "created": 1621228014.0
    },
    {
        "author": "Complex-Intention-43",
        "body": "But his family didnt own tesla or paypal.\nHe couldnt get the ceo title just to be born in a wealthy family\n\nAnd tesla was a big risk from the start for him",
        "created_utc": 1620553143,
        "id": "gxhd8w1",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1620581943.0
    },
    {
        "author": "EvaUnit343",
        "body": "I truly, truly do not understand the long term bull thesis for COIN. \n\nIf corn is adopted, other competitors (like PayPal) step in and drive down COIN’s absurd premiums, losing market share. \n\nIf corn is not adopted, COIN goes to zero. \n\nAs much as I want Cathie to sit on my face, she’s wrong on this one...",
        "created_utc": 1621255831,
        "id": "gyftofm",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1621284631.0
    },
    {
        "author": "financialsfyi",
        "body": "Top stock mentions on r/wallstreetbets today (Not investment advice)\n\n|Symbol|Total Mentions|Price &amp; Change|Trading Volume|Market Cap|\n|:-|:-|:-|:-|:-|\n|GME|178|173.59 -1.48%|4.43M|12.29B|\n|CLOV|108|9.85 -3.15%|17.44M|4.34B|\n|MVIS|69|15.25 -15.28%|74.01M|2.41B|\n|SPY|58|417.30 -0.66%|85.53M|361.16B|\n|AMC|43|10.03 -1.67%|27.74M|4.52B|\n|PLTR|38|23.04 -1.41%|24.72M|40.37B|\n|RKT|27|22.45 -1.97%|3.73M|2.59B|\n|NOK|24|4.68 +0.21%|67.01M|26.56B|\n|TSLA|22|709.44 +4.79%|40.76M|683.43B|\n|BTX|20|49.80 +45.53%|54.57M|148.24M|\n|AMD|17|81.62 -2.73%|46.6M|99.17B|\n|PSFE|17|13.80 -0.29%|4.01M|2.02B|\n|OCGN|16|12.67 +5.94%|164.4M|2.38B|\n|AAPL|15|131.46 -1.51%|109.84M|2.19T|\n|VXRT|11|10.78 +17.05%|112.22M|1.27B|\n|VIAC|11|41.02 -1.16%|20.59M|26.67B|\n|BB|9|8.83 -2.54%|6.14M|4.99B|\n|SQQQ|8|10.89 +1.97%|53.95M|1.51B|\n|UWMC|8|8.16 -1.69%|2.1M|841.33M|\n|NIO|7|39.84 +2.18%|116.73M|62.11B|\n|COIN|7|297.64 +0.97%|4M|77.77B|\n|ACB|7|8.94 -0.22%|3.42M|1.77B|\n|APHA|6|15.38 -0.45%|16.31M|4.87B|\n|FB|6|325.08 -1.34%|26.33M|927.78B|\n|AMZN|6|3,467.42 -0.11%|7.01M|1.75T|\n|SQ|6|244.82 -1.19%|6.19M|104.05B|\n|CRSR|5|33.18 -3.21%|941.25K|3.05B|\n|GLD|5|165.66 -0.34%|6.25M|58.08B|\n|PYPL|5|262.29 -2.08%|6.59M|308B|\n|QS|5|36.54 -0.95%|3.98M|8.85B|",
        "created_utc": 1619999343,
        "id": "gwq3h6w",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1620028143.0
    },
    {
        "author": "iBifteki",
        "body": "This is what I keep seeing as well.\n\nMany genuienly big cap, good companies (strong guidance, free cashflow, profitability, debt ratio, etc) are already down 20-25% from ATH ($TSM, $PYPL, etc)\n\nOther growths like $TDOC and $BYND are down 50%+.\n\nI don't understand how much more punishment these need to receive for a reversal to start taking place.\n\nAnd what shall we do, buy bonds from a historially indebted US Treasury?\n\nI feel like these inflation news are priced in now, and actually promising that the US economy is not totally fucked. Imagine if we got disinflation. That would be a huge issue.\n\nIf we drop another 10% I am buying all the way down, in my humble opinion, I feel like companies like Apple will keep killing it.",
        "created_utc": 1620861637,
        "id": "gxwyqs5",
        "score": 15,
        "subreddit": "stocks",
        "created": 1620890437.0
    },
    {
        "author": "HeckleHelix",
        "body": "Thats about what my Paypal calls looks like.  Might as well hold till the bitter end.  💎🙌  And yes I also took a small position in CLOV 🐵👍",
        "created_utc": 1620331944,
        "id": "gx6x1ma",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1620360744.0
    },
    {
        "author": "pdieff",
        "body": "TECH WHAT TO GO LONG OR SHORT &amp; WHY.  \n\nReal Rates are going up nothing we can do about it not even JPow. \n\nHigher Rates = poison for growth companies w a stupid valuation.  2020 was different the market didn’t care but now it grew a conscience and it does.  \n\nWhat to short;  like Simba would say “Everything the Market Touches with a Price to Sale Ratio of 20X or more.  Pick your victim plot it on ychart.com and see what the PS is.   \n\nPayPal: 15X a bit expensive but not horrible and they killed it. They go up. (SQ; is only 12X if they have good numbers they should pump). \n\nFASTLY; before today 24X expensive and missed their numbers you are fucked. \n\nNIKOLA: 9,400X (it’s not a typo over 9K) if they don’t cure cancer on Friday with their earnings report they are gonna crash.  \n\nOCGN: 70X. They is fucked as well. And not only for their high PS.  \n\nMVIS: 250X and that’s after they collapsed.  \n\nThis is good info use it.  Stop losing $$$",
        "created_utc": 1620261397,
        "id": "gx3fj2l",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1620290197.0
    },
    {
        "author": "lattiboy",
        "body": "I think PayPal earnings are the most important of the whole season. They’re basically the 500lb gorilla of Fintech and they’ve been getting beaten down since February. If they print money like i think they will, it could send the whole sector (and tech more broadly) into a turn around. \n\nJust my two cents, and I’ve got a lot of ARKF options riding on this that I’m down a fair bit on….",
        "created_utc": 1620236125,
        "id": "gx1u5mi",
        "score": 13,
        "subreddit": "stocks",
        "created": 1620264925.0
    },
    {
        "author": "WRL23",
        "body": "I'd agree for that with any Crypto not just doge\n\nIt's slowly becoming accepted, understood, trusted, etc.. like how paypal existed for years but (let's be honest here) not that many people used at least not often. Then came along venmo and other shit like that.. let's call those alt-pay apps. People slowly but surely were accepting it, using it etc.\n\nNo not the best 3 example but hopefully you see my point. That's why I  stand by any good Crypto news is good news for all Crypto.. alts or not. The more the good vibes go out to media etc the more people get used to hearing it and then accepting it and eventually using it.\n\nDoes grandma still write checks? Yep! But those situations are less and less and do not reflect the direction we're heading.",
        "created_utc": 1621182025,
        "id": "gyc6mkf",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1621210825.0
    },
    {
        "author": "The_Contrarian01",
        "body": "Futures are higher this morning, rebounding from the ‘Yellen head-fake’ that caused a bunch of selling yesterday afternoon. Small caps are leading the move higher, with the Russell 2000 up 0.7%. Nasdaq is up 0.6%. S&amp;P and Dow up about 0.3%. Russell and Nasdaq also saw the brunt of the damage yesterday, giving up almost 2% each.\n\nWe do get to hear from a couple of FOMC members: Eric Rosengren, Loretta Mester, and Charles Evans. Not sure if they’re taking questions but if so you can bet they’ll be asked about Yellen’s comments. \n\nMy thoughts on Yellen and the Fed: Need to listen to the audio. Not gonna type it.\n\nADP payrolls are due out at 0815. Economists expecting 800k jobs added in April, quite a bit more than the 517k from March. We also get ISM services data at 10am. These are a couple of key reports where the health of the economy is concerned. As always, you need to watch for the Goldilocks scenario: too hot and it means inflation and Fed tightening. Too cold and the economy is not recovering quickly or strongly enough. Though nowadays, maybe the ‘too cold’ scenario is preferred.\n\nMore earnings today as well: Hilton Worldwide just came out with a miss. GM, Allstate, and Etsy report later. After the bell we get Uber, Booking Holdings, and PayPal.",
        "created_utc": 1620211987,
        "id": "gx0g2uv",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1620240787.0
    },
    {
        "author": "The_Contrarian01",
        "body": "Good morning contrarians!\n\nFutures are higher this morning, rebounding from the ‘Yellen head-fake’ that caused a bunch of selling yesterday afternoon. Small caps are leading the move higher, with the Russell 2000 up 0.7%. Nasdaq is up 0.6%. S&amp;P and Dow up about 0.3%. Russell and Nasdaq also saw the brunt of the damage yesterday, giving up almost 2% each.\n\nWe do get to hear from a couple of FOMC members: Eric Rosengren, Loretta Mester, and Charles Evans. Not sure if they’re taking questions but if so you can bet they’ll be asked about Yellen’s comments. \n\nMy thoughts on Yellen and the Fed: Need to listen to the audio. Not gonna type it.\n\nADP payrolls are due out at 0815. Economists expecting 800k jobs added in April, quite a bit more than the 517k from March. We also get ISM services data at 10am. These are a couple of key reports where the health of the economy is concerned. As always, you need to watch for the Goldilocks scenario: too hot and it means inflation and Fed tightening. Too cold and the economy is not recovering quickly or strongly enough. Though nowadays, maybe the ‘too cold’ scenario is preferred.\n\nMore earnings today as well: Hilton Worldwide just came out with a miss. GM, Allstate, and Etsy report later. After the bell we get Uber, Booking Holdings, and PayPal.",
        "created_utc": 1620211957,
        "id": "gx0g1je",
        "score": 12,
        "subreddit": "investing",
        "created": 1620240757.0
    },
    {
        "author": "mcgravier",
        "body": "&gt; But all those investment or adaptions from Tesla, Paypal or the listing of Coinbase could be seen as a sign of mass adoption.\n\nBack in 2017 Bitcoin looked to be mass adopted as well. Microsoft, Dell, Steam, Tigerdirect, Wargaming and many other companies big and small started to accept Bitcoin payments for their products, but it went nowhere - mostly because technology was immature, and couldn't cope with the massive traffic. \n\nThis time might be different, but it may misfire again as well.",
        "created_utc": 1620216692,
        "id": "gx0ms86",
        "score": 12,
        "subreddit": "investing",
        "created": 1620245492.0
    },
    {
        "author": "Tobytime34",
        "body": "At this point in the SPAC cycle it’s going to take PayPal buying it for $20 a share to move the price more than a nickel. 🤦",
        "created_utc": 1620147383,
        "id": "gwxe87f",
        "score": 12,
        "subreddit": "SPACs",
        "created": 1620176183.0
    },
    {
        "author": "Darklord12345678",
        "body": "Just check carefully your data. It seems that your announcements were captured incorrectly.\n\nFor example, there is no earning on Oct 28 for PYPL: [https://finance.yahoo.com/calendar/earnings/?symbol=pypl](https://finance.yahoo.com/calendar/earnings/?symbol=pypl) but you have in your data.\n\nThis is a great tool, and I think it has a lot of potentials. Thank you for supporting our community.",
        "created_utc": 1619994358,
        "id": "gwpu2zy",
        "score": 11,
        "subreddit": "options",
        "created": 1620023158.0
    },
    {
        "author": "jemoederkanker",
        "body": "One of the reasons, why it became extremely popular is because it has founding members of PayPal, known as PayPal mafia which have gone to create multiple successful companies. Peter Thiel, co founder of PayPal is also a co-founder of palantir. It's also got a great fucking name 🙏",
        "created_utc": 1620743364,
        "id": "gxqe1qm",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1620772164.0
    },
    {
        "author": "QisDenseInR",
        "body": "Last week I went all in with margin. Bought $FB and $AMZN just before market close and sold those 5mins after close. I am thinking to do the same next week. Pfizer (6:40 AM) SKLZ, PYPL, SQ, BYND and DKNG. What do you guys suggest?",
        "created_utc": 1619877223,
        "id": "gwjgk9x",
        "score": 11,
        "subreddit": "options",
        "created": 1619906023.0
    },
    {
        "author": "dudetalking",
        "body": "I agree with Munger this current mania is not healthy for society, and will be very destructive.  When you see things like Weed Stocks, Gambling Stocks, Vaporware cyrptos, excess financial leverage.\n\nAlso systemic risk is brewing everywhere, especially in the Defi space. That is the new unregulated dark pools, except this time its going to destroy retail when it unravels.  Its amazing that there is zero concern for these giants like paypal, square, becoming quasi banks.\n\nDefinitely going to be a fun movie to watch.\n\nI think the boom/bust cycle could be faster than people anticipate. This morning on CNBC a advisor already had mapped the entire year, a 10% correction 2 months before the new tax plan, and until then the market can go sideways or up. Zero risk apparently.\n\nAs someone who was around and traded in the .com, this bubble is dwarfing .com mania.",
        "created_utc": 1620136392,
        "id": "gwwnf8e",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1620165192.0
    },
    {
        "author": "The_subtle_learner",
        "body": "No actually only somebody who had $350MM in the bank or so (or more) after having sold a company like PayPal or sold whatever else remarkable commercial achievement",
        "created_utc": 1620544869,
        "id": "gxh4kps",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1620573669.0
    },
    {
        "author": "snake250",
        "body": "Couple of things...\n\n- Don't just look at PS, also look at EV / gross profits\n- PYPL gross margins are stable and higher than SQ\n\nNo horse in the race, just saying you need to look beyond just revenue growth % and PS.",
        "created_utc": 1620940740,
        "id": "gy0z18b",
        "score": 11,
        "subreddit": "stocks",
        "created": 1620969540.0
    },
    {
        "author": "Delicious_Can_7849",
        "body": "BABA calls looking juicy as eff. \n\nAAPL calls look tempting as great earnings are about to set in (Buffet sold some too so that’s a plus)\n\nAMD calls are making me engorged considering the merger with XLNX and XLNX’s good beat (and AMD is tech and tech=tendies).\n\nPYPL calls looking great bc well earnings are tomorrow and I’m a degenerate gambler that enjoys a tasty crayon from time to time. \n\nCRSR calls also in the mix bc my brain is super smooth and some retard made a post about it earlier. \n\nIn all seriousness, today seemed to be just a normal case of profit taking.\n\nTL;DR Buy the dip. I like the stock.",
        "created_utc": 1620166182,
        "id": "gwyem1k",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1620194982.0
    },
    {
        "author": "urgirlsmomsdaddy",
        "body": "Made the executive decision - moving funds to VTI.\n\nDone playing with individual stocks.\n\nIll hold onto my long terms like the mega cap tech+ SQ, NVDA, PYPL, AMD, SHOP but thats it.",
        "created_utc": 1620928564,
        "id": "gy05q6f",
        "score": 10,
        "subreddit": "stocks",
        "created": 1620957364.0
    },
    {
        "author": "HeckleHelix",
        "body": "Im averaging down on Paypal.  Excellent company with nothing but a positive future.  Every $10 drop I buy 5 shares.",
        "created_utc": 1621214648,
        "id": "gye47sn",
        "score": 10,
        "subreddit": "stocks",
        "created": 1621243448.0
    },
    {
        "author": "blingblingmofo",
        "body": "Well PYPL did a free fall prior to earnings so it may actually be okay - assuming there isn't a broader market sell-off, ofc.",
        "created_utc": 1620250188,
        "id": "gx2rkpg",
        "score": 10,
        "subreddit": "stocks",
        "created": 1620278988.0
    },
    {
        "author": "Popular_Abrocoma558",
        "body": "PYPL announced great earnings yesterday. What happens today? PYPL receives a big red dildo in the ass by the market🤡",
        "created_utc": 1620310854,
        "id": "gx5ilfx",
        "score": 9,
        "subreddit": "stocks",
        "created": 1620339654.0
    },
    {
        "author": "RGR111",
        "body": "PSFE is the stock to own. To the 🌚 and beyond. We got here another SQ &amp; PYPL in the making",
        "created_utc": 1619939956,
        "id": "gwmudgl",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1619968756.0
    },
    {
        "author": "isweat_",
        "body": "SQ &amp; PYPL killed earnings\n\nIm praying for my fellow PSFE bag holders 🙏🏼",
        "created_utc": 1620347827,
        "id": "gx7vpy7",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620376627.0
    },
    {
        "author": "Ronnieisred",
        "body": "I look at it as WELL took over Canada and is now expanding rapidly into the US with the Circle Medical acquisition - the ceo also sold his last company to PayPal for $304M in 2017 and has had the 29th richest man in the world as a seed investor all the way through the most recent round priced above market so I don't think they are limited to Canada in anyway.  I think they are just smart businessmen that saw an opportunity in Canada which would set them up for success in all other markets. Just feels like a difference between hype (Clov) and solid business fundamentals with not much hype (Well). I also personally won't contribute any more money to the clintons lol",
        "created_utc": 1620595179,
        "id": "gxjey68",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620623979.0
    },
    {
        "author": "wnsgus",
        "body": "This same exact price movement happened with PYPL last earnings. Shall we see it touch upwards of 280-300 again? 🤔",
        "created_utc": 1620247328,
        "id": "gx2kqd1",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620276128.0
    },
    {
        "author": "RGR111",
        "body": "I was thinking about this and I believe SQ can outpace PYPL with its direct crypto investments and the potential of still expanding its business and reaching Europe (UK right now) and other countries. I’d rather have one than both and SQ seems to be the winner for me and I believe it can double its price in 2-3 years",
        "created_utc": 1620446109,
        "id": "gxcqdms",
        "score": 8,
        "subreddit": "stocks",
        "created": 1620474909.0
    },
    {
        "author": "cold_tone",
        "body": "Oh is paypal an electric vehicle? Is pay pal the precursor to Nueralink? Ya he helped develop paypal and sold it to make big bank and fund his endeavors. But HardCock up there claims he’s big brains behind those ideas.  \n\nElon fanboys everywhere",
        "created_utc": 1621099240,
        "id": "gy8fw9f",
        "score": 8,
        "subreddit": "Wallstreetbetsnew",
        "created": 1621128040.0
    },
    {
        "author": "Emprease",
        "body": "SQ TSLA PYPL MARA RIOT MSTR\n\npress f to pay respects",
        "created_utc": 1621223873,
        "id": "gyemyik",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1621252673.0
    },
    {
        "author": "Ok_Capital2097",
        "body": "Showtime for my portfolio. Holding CRSR, PYPL, RKT, VIAC, UBER... F",
        "created_utc": 1620096997,
        "id": "gwv3jv2",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620125797.0
    },
    {
        "author": "VisaDeKlein",
        "body": "paypal, if you could singlehandedly carry qqq up tomorrow, that'd be great thanks. she's heavy but you got this do it for mama",
        "created_utc": 1620246207,
        "id": "gx2i24o",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620275007.0
    },
    {
        "author": "suphater",
        "body": "Very nice PayPal pop so far from earnings.\n\nIf it crashes tomorrow I'm just going all in on Goodyear Tires since that's been my best stock of 2021, wtf",
        "created_utc": 1620247445,
        "id": "gx2l0je",
        "score": 8,
        "subreddit": "stocks",
        "created": 1620276245.0
    },
    {
        "author": "amg_class",
        "body": "PYPL and SQ will beat for sure. Calls on both",
        "created_utc": 1619879415,
        "id": "gwjl2x8",
        "score": 7,
        "subreddit": "options",
        "created": 1619908215.0
    },
    {
        "author": "Billionairess",
        "body": "Elon was never a founder of either paypal or tesla anyway. He basically strongarmed his way to power, booted the original founders one way or another, and forced the board to grant him co-founder status. He was a founder of spacex though, for whats its worth.",
        "created_utc": 1620181995,
        "id": "gwzbtcf",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1620210795.0
    },
    {
        "author": "Ok_Capital2097",
        "body": "I hope shit corn $ rotate into PLTR, DKNG, CRSR, PYPL, SPOT, TLT",
        "created_utc": 1621197298,
        "id": "gyd4odz",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1621226098.0
    },
    {
        "author": "urgirlsmomsdaddy",
        "body": "I sold out of most of my more speculative plays.\n\nMy most spec plays left are TSLA, SQ, AMD, SHOP, DKNG, IPOE, ARKK.\n\nI will let those rock, while I continue to DCA into VTI, MSFT, AAPL, DIS, GOOG, AMZN, PYPL, NVDA.",
        "created_utc": 1620956385,
        "id": "gy1tl2j",
        "score": 7,
        "subreddit": "stocks",
        "created": 1620985185.0
    },
    {
        "author": "Goodboi209",
        "body": "Some completely true facts about Elon;\n\nHe got kicked out of a small website called x.com for being a dumbass. Peter Thiel then proceeded to turn it into the behemoth that is Paypal. He just happened to still hold stock as its value explodes. He did not found or build Paypal.\n\nTESLA WAS NOT FOUNDED BY ELON MUSK, it was founded by Martin Eberhard and Marc Tarpenning. Elon bought a majority stake in tesla and then proceeded to kick them out of their own vision and masquerade as a savior to humanity. \n\n\nIn depth debunking of the Elon and his assumed history\n\nPart 1\n\nhttps://m.youtube.com/watch?v=c-FGwDDc-s8 \n\nPart 2\n\nhttps://m.youtube.com/watch?v=DopFo1rjAr4\n\n\nHe has been lying about “self driving” coming out “this year” for 5 years despite the fact in recent emails they fucking told the DMV ITS NOT COMING.\n\nhttps://sys.4channel.org/derefer?url=https%3A%2F%2Fwww.forbes.com%2Fsites%2Fdavidsilver%2F2021%2F03%2F09%2Ftesla-emails-to-the-california-dmv-emphasize-continued-reliance-on-maps%2F%3Fsh%3D5d6468d057e6\n\n\nDid you know the only reason Tesla has a solar division is because musk used shareholder money to bailout his failing solar company?\n\nIs Elon musk a psychopath?\n\nDid you know he said he would “fire” his ex wife if she didnt dye her hair blonde?\n\nHe then proceeded to abandon her after having her bear 5 of his children.\n\nhttps://m.youtube.com/watch?v=01LK1hxpwcY\n\n\nVideo exposing Elon lying about FSD as well as video showing how useless and horrifyingly dangerous it truly is\n\nhttps://m.youtube.com/watch?v=PRKAH4d48Ic [Open]\n\nMeecedes Benz has been developing self driving since 1989, they have no technological lead.\n\nhttps://m.youtube.com/watch?v=I39sxwYKlEE",
        "created_utc": 1621200937,
        "id": "gydcqge",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1621229737.0
    },
    {
        "author": "Vuffy_",
        "body": "Go PYPL",
        "created_utc": 1620245986,
        "id": "gx2his5",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620274786.0
    },
    {
        "author": "ReaditB4Bomber",
        "body": "Got fucked on my paypal calls yesterday but im diamond handing the shares idgaf, Paypal been beaten 9% for the month because the market was shit and had no run up to earnings,it just beat earnings and isnt trading much higher so im gonna wait until the markets better before I unload the shares🤔",
        "created_utc": 1620308508,
        "id": "gx5dhgz",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620337308.0
    },
    {
        "author": "order_66_man",
        "body": "PSFE is gonna crush earnings. SQ did good, PYPL did great and DKNG raking in the cash. Great news for PSFE. We will see $20+ before you know it.",
        "created_utc": 1620401135,
        "id": "gxa7d8l",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620429935.0
    },
    {
        "author": "suphater",
        "body": "Pay attention to the strong behavior of this week while also probably avoiding stocks at ATHs, although I'm doing a mix.\n\nI love Roku, JCI, GT, RFP, PayPal, maybe Etsy if it goes just a little more down, CSPI is a little hidden gem in IT that's been strong this week, FANG, Verizon...\n\nYes those are most of the stocks green or \"close enough\" in my portfolio today. No I don't believe anyone on r/stocks has the ability to influence market trends, retail is low enough let alone our lonely sub. Genuinely trying to help, but you must do your own DD (or search the sub).",
        "created_utc": 1620834352,
        "id": "gxv5zip",
        "score": 6,
        "subreddit": "stocks",
        "created": 1620863152.0
    },
    {
        "author": "LastPotato1214",
        "body": "Solid SQ and PayPal AH action on earnings.  Turns out tech and growth aren't going away with the reopening after all.",
        "created_utc": 1620246395,
        "id": "gx2iioa",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1620275195.0
    },
    {
        "author": "JBeibs2012",
        "body": "There's quite a few details you're missing. There's also nuance with mergers and acquisitions. They're not the same.\n\nI read this book a few years back, which was really interesting.\n\nhttps://www.amazon.com/dp/B00KVI76ZS/ref=cm_sw_r_cp_apa_glt_9FFT0N90169W1V3VGEKK\n\nAll the cofounders put a lot of work into getting it off the ground - that includes musk.\n\nIt's not like PayPal was a successful business before the merger.",
        "created_utc": 1621200343,
        "id": "gydbg1o",
        "score": 6,
        "subreddit": "investing",
        "created": 1621229143.0
    },
    {
        "author": "Ok_Capital2097",
        "body": "Yea COIN will have good earnings from everyone panic selling and fomo back in. \n\nCOIN and PYPL will just take 2-3% of every transaction. \n\nPYPL holding unknown number of shit corn and ppl paying 2-3% to trade the same corn inside PYPL wallet. PYPL going to make 10x from just taking fees from ppl \"trading\" imaginary item.",
        "created_utc": 1621220632,
        "id": "gyeg480",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1621249432.0
    },
    {
        "author": "ErinG2021",
        "body": "TSLA, PLTR, SHOP, GOOGL, SQ, PYPL, NVDA, RBLX, DKNG......getting crushed on most of these lately.....it’s been painful the last few months with more pain probably coming....but plan to hold 10 years or more.....and A LOT can change in that time with plenty of time for these to more than double....",
        "created_utc": 1621050210,
        "id": "gy6gstu",
        "score": 6,
        "subreddit": "stocks",
        "created": 1621079010.0
    },
    {
        "author": "RogerBrutus",
        "body": "Damn I feel that brother 😔 We’ve all been there. I missed a 120% PayPal 0DTE scalp friday just because I couldn’t set the sell order fast enough, ended up lowering to just break even",
        "created_utc": 1620525321,
        "id": "gxgav4y",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620554121.0
    },
    {
        "author": "HeckleHelix",
        "body": "thats about how much Im gonna lose on my Paypal calls.  And that was supposed to be all the household expenses $ this month.  Picked up an side part-time job......",
        "created_utc": 1620954708,
        "id": "gy1qezj",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620983508.0
    },
    {
        "author": "californianotter",
        "body": "SQ and PYPL killing me.  Oil and mining/steel keeping me afloat.",
        "created_utc": 1621273422,
        "id": "gygxv0x",
        "score": 6,
        "subreddit": "stocks",
        "created": 1621302222.0
    },
    {
        "author": "SevrenMMA",
        "body": "I was big on SQ all but I think the bull run is over. At 200 it’s trading at 340x earnings which with inflation is absolutely bonkers. I’ve decided PayPal is the smart play. I’ll jump in if it hits $150 on SQ though",
        "created_utc": 1620941361,
        "id": "gy106f2",
        "score": 6,
        "subreddit": "stocks",
        "created": 1620970161.0
    },
    {
        "author": "GreedySpeculator",
        "body": "this is QQQ you retard. TSLA is the 4th stock and is part of the nasdaq 100\n\nSP Tech sector very valid proxy for QQQ earnings. i don't have access to NQ earnings right now. \n\n&amp;#x200B;\n\n |                Ticker               | Holdings | +-------------------------------------+----------+ |          AAPL - Apple Inc.          |  11.08%  | |     MSFT - Microsoft Corporation    |  9.65%   | |       AMZN - Amazon.com, Inc.       |  8.61%   | |           TSLA - Tesla Inc          |  4.13%   | |     GOOG - Alphabet Inc. Class C    |  3.98%   | |     FB - Facebook, Inc. Class A     |  3.95%   | |    GOOGL - Alphabet Inc. Class A    |  3.58%   | |      NVDA - NVIDIA Corporation      |  2.80%   | |      PYPL - PayPal Holdings Inc     |  2.30%   | | CMCSA - Comcast Corporation Class A |  2.03%   | |          ADBE - Adobe Inc.          |  1.85%   | |       INTC - Intel Corporation      |  1.82%   | |         NFLX - Netflix, Inc.        |  1.75%   | |      CSCO - Cisco Systems, Inc.     |  1.68%   | |         PEP - PepsiCo, Inc.         |  1.56%   | +-------------------------------------+----------+",
        "created_utc": 1620304066,
        "id": "gx552lg",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620332866.0
    },
    {
        "author": "sammyboy777",
        "body": "How to did I get all 3 of my earnings plays wrong , god damn u PayPal",
        "created_utc": 1620252453,
        "id": "gx2wopy",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620281253.0
    },
    {
        "author": "HorrorProof9920",
        "body": "How tf is PYPL trading lower than yesterday. I’m out of this crazy market",
        "created_utc": 1620327203,
        "id": "gx6li7r",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620356003.0
    },
    {
        "author": "vegancash",
        "body": "I think you will do great. Earning should go well on May 11. Watch for PayPal and Sq earning and DKNG earning next week as well. If these do well it should pop on earning.\n\nDefinitely an undervalue stock.",
        "created_utc": 1619945702,
        "id": "gwn0dhc",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1619974502.0
    },
    {
        "author": "SirPalat",
        "body": "PayPal he was relatively less involved/important in it's success as compared to the other founders. SpaceX has been great but on the backs of underpaying it's engineers and getting them to sign predatory contracts. He didn't found Tesla at all, he bought them out and erased history to include himself as a founder.",
        "created_utc": 1620918355,
        "id": "gxzhi7o",
        "score": 6,
        "subreddit": "stocks",
        "created": 1620947155.0
    },
    {
        "author": "HeckleHelix",
        "body": "Got in at $255.50 on Friday 🙌 Also picked up some PayPal!\nNo-fail positions!",
        "created_utc": 1620556987,
        "id": "gxhh9at",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620585787.0
    },
    {
        "author": "LastPotato1214",
        "body": "I expect that they'll beat, and increase guidance. \n\n50% of their revenue is payment processing.   SQ/PayPal reported a record quarter for it.\n\nSome of their customers dkng, spot, and coin recently reported record revenue and increased guidance. \n\nNo idea what the price does, but institutions have been buying so I'm comfortable holding.",
        "created_utc": 1620562834,
        "id": "gxho81n",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1620591634.0
    },
    {
        "author": "LastPotato1214",
        "body": "Added more Paysafe at $12.80.  Paypal ER was huge. 50% growth yoy, and still expecting 30% growth on users this year.\n\nAlso Paypal is up 2.6% today despite how red stuff is.  SQ might also be a good swing, rose with PayPal yesterday AH and now down 2% with ER after close.",
        "created_utc": 1620316796,
        "id": "gx5wgze",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1620345596.0
    },
    {
        "author": "Nervous_Cannibal",
        "body": "PayPal did fine today after earnings. Let's see if Square can bounce that ass.",
        "created_utc": 1620332749,
        "id": "gx6z0y0",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620361549.0
    },
    {
        "author": "OKJMaster44",
        "body": "Also thank you PYPL for not immediately keeling over like a diseased horse after having a killer earnings and guidance the day prior.",
        "created_utc": 1620333087,
        "id": "gx6zupd",
        "score": 5,
        "subreddit": "stocks",
        "created": 1620361887.0
    },
    {
        "author": "OKJMaster44",
        "body": "The kangaroo market is hopping and a bouncing at full force I see.\n\nAt this point, barring a sudden massive correction that **really** puts everything on a fire sale (not the fake discounts of the past 2 days), I am just gonna not touch my holdings for the most part save for possibly selling a PYPL share off the next time things go super green to reduce exposure. I’d rather miss discounts than keep being cut by knives.",
        "created_utc": 1620224364,
        "id": "gx11s1p",
        "score": 5,
        "subreddit": "stocks",
        "created": 1620253164.0
    },
    {
        "author": "thatjitzguy",
        "body": "PayPal can be used for currencies now. They expected 70 cents for earnings. Got 92. Revenue up by 31%\n\nThis is only the beginning for paypal. They're in crypto now. It's a game changer.",
        "created_utc": 1620246277,
        "id": "gx2i89w",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620275077.0
    },
    {
        "author": "MorpheusOnAcid",
        "body": "Yup I'm getting piped down by PYPL IV in the morning",
        "created_utc": 1620246083,
        "id": "gx2hr8i",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620274883.0
    },
    {
        "author": "Ignatius_Minkoff",
        "body": "Pypl and Etsy for the day trade calls",
        "created_utc": 1620219635,
        "id": "gx0rz8p",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620248435.0
    },
    {
        "author": "Ok_Capital2097",
        "body": "Yes. Make PLTR, PYPL, CRSR, DKNG, CHWY great again.",
        "created_utc": 1621198577,
        "id": "gyd7jp5",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1621227377.0
    },
    {
        "author": "juaggo_",
        "body": "I’m so hyped about PayPal. Expecting nice growth over total payment volume, active accounts, total transactions, etc. A good company in a sector that will be huge in the future.",
        "created_utc": 1619876118,
        "id": "gwjen0b",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619904918.0
    },
    {
        "author": "Sploooooooooge",
        "body": "How we feeling about PYPL?",
        "created_utc": 1620516092,
        "id": "gxftv1a",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620544892.0
    },
    {
        "author": "adayofjoy",
        "body": "&gt; Buy what you believe in\n\nI believed in BABA, JD and PYPL and those were some of my largest individual stock picks. Paypal's done alright but is only barely keeping up with the market from the point I bought it, while the other two have sorely underperformed the market.\n\n&gt; Ignore the noise\n\nI wish I didn't ignore all the people telling me to sell my growth stocks and rotate into value as well as all the negative news regarding China's crackdown on tech giants. Many opportunities were missed.\n\n&gt; Hold LONG term\n\nI trust that in 5 years the recent volatility in these stocks will just be a blip on a chart, but the question still remains if I would've been better off putting that money into an S&amp;P 500 index fund instead.",
        "created_utc": 1620620829,
        "id": "gxknw8n",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1620649629.0
    },
    {
        "author": "fuckYEWshoresy",
        "body": "Sold my rkt calls just before close and bought a pypl put, let's see how it works out",
        "created_utc": 1620244939,
        "id": "gx2f0qf",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620273739.0
    },
    {
        "author": "HeckleHelix",
        "body": "PayPal !",
        "created_utc": 1620261525,
        "id": "gx3fsof",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620290325.0
    },
    {
        "author": "isweat_",
        "body": "Pypl, Sq, DKNG, COIN reporting soon\n\nPsfe 🚀🚀🚀👨‍🚀",
        "created_utc": 1620156486,
        "id": "gwxs52k",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620185286.0
    },
    {
        "author": "OKJMaster44",
        "body": "Went from -1.91% to -.71% without touching a thing. This kangaroo market is getting too much for me lol. \n\nOnce I decide what to do with my PYPL position post earnings I am looking to take good step back from my stocks unless something goes on a mega discount that I haven’t already blown my stack on.",
        "created_utc": 1620158670,
        "id": "gwxx3wk",
        "score": 5,
        "subreddit": "stocks",
        "created": 1620187470.0
    },
    {
        "author": "aorta89",
        "body": "PYPL 6/18 300c. Let’s go!!",
        "created_utc": 1619984430,
        "id": "gwpa4kq",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620013230.0
    },
    {
        "author": "griswalt7",
        "body": "Just paid my $6k tax bill using basically all of my credit power from PayPal Credit and MasterCard. 6 months of 0% interest on the lion’s share of the bill and the rest gets a 0.04% offset from cash back. This fucking burns.",
        "created_utc": 1621112258,
        "id": "gy966ev",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1621141058.0
    },
    {
        "author": "HeckleHelix",
        "body": "PHG Philips &amp; PYPL Paypal",
        "created_utc": 1621191398,
        "id": "gycro1u",
        "score": 5,
        "subreddit": "stocks",
        "created": 1621220198.0
    },
    {
        "author": "Mywifefoundmymain",
        "body": "Except Elon was broke before he made sip2/paypal",
        "created_utc": 1620566546,
        "id": "gxhtso1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620595346.0
    },
    {
        "author": "Sterile-Panda",
        "body": "basically the paypal of UK and europe from what I have heard. Does a lot of payment processing for draftkings, other gambling sites, games like \\*fortnite, and amazon",
        "created_utc": 1619999597,
        "id": "gwq3y59",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620028397.0
    },
    {
        "author": "TCUCorona",
        "body": "You never go against the Paypal Mafia!!   With that said PTLR+ Cyber attacks= Printer go Brrrrrrrrrrrr🚀🚀🚀🚀🚀🚀🚀🚀🚀🤑🤑🤑🤑",
        "created_utc": 1620754093,
        "id": "gxr3pnq",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620782893.0
    },
    {
        "author": "RidexThexWave",
        "body": "PayPal beat earnings and is mooning after hours, so puts tomorrow 👍",
        "created_utc": 1620246036,
        "id": "gx2hn6g",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620274836.0
    },
    {
        "author": "HelloWorld0921",
        "body": "PLTR , SQ and pypl is enough to kill me",
        "created_utc": 1620325204,
        "id": "gx6gqkb",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620354004.0
    },
    {
        "author": "New_Hedgehog_8865",
        "body": "and PYPL... ugh.",
        "created_utc": 1620332849,
        "id": "gx6z9rz",
        "score": 5,
        "subreddit": "stocks",
        "created": 1620361649.0
    },
    {
        "author": "Pltr_x2-4_Tsla",
        "body": "PayPal is a great company, earnings great,up for now, tomorrow down, shitty companies no revenue, no product up 10% for no reason",
        "created_utc": 1620246095,
        "id": "gx2hsav",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620274895.0
    },
    {
        "author": "hyperinflationUSA",
        "body": "i said crypto, not just bitcoin. you need to read up on Central Bank Digital Currencies and then ask yourself why we need 3rd parties such as visa, paypal, ect once the fed rolls these out",
        "created_utc": 1619960448,
        "id": "gwnnxso",
        "score": 4,
        "subreddit": "investing",
        "created": 1619989248.0
    },
    {
        "author": "Bambam60",
        "body": "PYPL already red after \"crushing\" earnings expectations and rising to +5.8% post-market - I own no stake here, but I have deep sympathy for those who do.\n\nBrutal.",
        "created_utc": 1620310541,
        "id": "gx5hvnf",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620339341.0
    },
    {
        "author": "mediumthings888",
        "body": "WELL Healthcare (WELL.TO)\n\nTrading at just over $7 below last raise from 9.80.  Earnings call is on Tuesday and they have never missed.  They have started expanding into the US.  They really are just getting started.  The CEO sold his last company to PayPal and was with that company for 20 years.   Extremely capable management team.  Li Ka Shing one of the richest people in the world has invested over $130m so far.  He also participated in the $9.80 round.  Also all of their management participated in that round also.",
        "created_utc": 1620605603,
        "id": "gxjyeei",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1620634403.0
    },
    {
        "author": "FedTendies",
        "body": "Just take a look at SQ and paypal price since earnings. Red Sea even after record earnings beat. So many good earnings have resulted in HUGE dumps.",
        "created_utc": 1620669733,
        "id": "gxmut69",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620698533.0
    },
    {
        "author": "Kevin_Wolf",
        "body": "Yeah, you just edited in your paypal and shit to help others not make that mistake.\n\nRight.",
        "created_utc": 1620318651,
        "id": "gx60va3",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620347451.0
    },
    {
        "author": "breadoralive",
        "body": "Every day that I think PYPL can't go down any more, it surprises me",
        "created_utc": 1620237605,
        "id": "gx1xo38",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620266405.0
    },
    {
        "author": "oodex",
        "body": "He is not dumb, he is very smart. He knows what he talks about and plays with people. Note that I don't envy him or anything, I just state what happened in the last 2 years. He took a shit company (shit compared to other existing companies) and made it one of the most valued in the entire world on the stock market, he went into all the businesses that have a lot of talk &amp; promising future with EV, AI, Space and what not. I don't think his companies have no value behind them, in fact I think he will be a major shake up in the current industry model of how a CEO will act and will be viewed in the future, but I don't think that he takes a lot serious anymore. He has more than enough money to retire and pay bills for the next 100 generations of his, if wanted. I would recommend you reading more about Elon Musk's history in general, his role in Paypal and what exactly he did, his affair with Amber Heard while she was with Johnny Depp, his start with Tesla and how it progressed.\n\nNote that this has been done a couple of times in the past, mostly reminds me of Theranos and Elizabeth Holmes, who faked everything until it blew up. She was one of the most promising persons of that time, but imploded into nothing (though with a ton of money). Contrary to that Musk actually has a lot to show, but definitely not the value it currently has on the market. That's good for believers to not fall back to 0.",
        "created_utc": 1621248975,
        "id": "gyfj6xv",
        "score": 4,
        "subreddit": "investing",
        "created": 1621277775.0
    },
    {
        "author": "SirGasleak",
        "body": "I own both SQ and PYPL.  If you think fintech is a growth industry, you have to own the big dogs in the space.  I also own PSFE, which is stupidly undervalued.\n\nAnd SQ is only overvalued if you're looking at PE.  On a P/S metric it isn't overvalued at all.  And with a market cap of $94B it still has a lot of room to grow.",
        "created_utc": 1621088023,
        "id": "gy7swov",
        "score": 4,
        "subreddit": "stocks",
        "created": 1621116823.0
    }
]