[
    {
        "author": "smokeysbf",
        "body": "That's a real strange take. Buying carbon credits is more eco-friendly than not buying them. \n\nGood for HEXO. We need more environmentally cognizant corporations.",
        "created_utc": 1631801660,
        "id": "hd2xe1h",
        "score": 6,
        "subreddit": "weedstocks",
        "created": 1631830460.0
    },
    {
        "author": "rebsr",
        "body": "yes, exactly; it is a theory that two or more people have agreed to carry out an operation in secret, and one person furthers that agreement with an overt act.  Yes; conspiracy.  Why do people call every semi-rational, logical, and at times evidential thing as a conspiracy theory related to stupidity or mental illness, when the US government and each state convict thousands of people each year of criminal and civil conspiracy?  When the government reps or the media say it, then its true cause those guys can't lie to you and commit conspiracy = cognizant dissonance.  lol, the SEC wouldn't allow naked shorting so of course AMC is only short the amount of shares in float.",
        "created_utc": 1632398739,
        "id": "hdydbl3",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1632427539.0
    },
    {
        "author": "User_Simulator",
        "body": "DMT taken orally can produce the same letter everyone does when they get to because of futes. Hedge funds don't like Apple products.\n\n ~ meta-cognizant\n\n-----\n\n[^^Info](https://github.com/trambelus/UserSim) ^^| [^^Subreddit](/r/User_Simulator)",
        "created_utc": 1630985189,
        "id": "hbw11vp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1631013989.0
    },
    {
        "author": "8stringsamurai",
        "body": "Meta-cognizant indeed....",
        "created_utc": 1631593963,
        "id": "hcs7orp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1631622763.0
    },
    {
        "author": "Assdestroyer92",
        "body": "That's true too. But I think you've highlighted the surmountable difficulties that an individual investor faces above. You're thinking about the % above the market you will get. What if you fail and get 5-8%? Would that extend your retire years then?\n\nI'm not trying to discourage you. I think its very nice seeing someone learning the ropes of investing! However, we have to be cognizant of the risks and difficulties involved in doing so. \n\nThink about what's the likelihood of me beating the market? What the likelihood of me underperforming the market? If I outperform, what returns can I reaonable get, if I underperform, what returns can I reasonable get. I would take it from there.\n\nAll the best :)",
        "created_utc": 1631667181,
        "id": "hcw5phk",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1631695981.0
    },
    {
        "author": "User_Simulator",
        "body": "It's the fucking movie theater will never happen.\n\n ~ meta-cognizant\n\n-----\n\n[^^Info](https://github.com/trambelus/UserSim) ^^| [^^Subreddit](/r/User_Simulator)",
        "created_utc": 1632545014,
        "id": "he6mzv3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632573814.0
    },
    {
        "author": "spacgod1233",
        "body": "But I’d you want an actual debate as opposed to random online shit-posting. (Which was my intention last night).  I post random crap to get reactions.  Sue me. \n\nIn my mind “privilege” has some merits in some very instances.  And yes, my experiences are limited to mostly the US.  Which just by luck of chance happened to be where I was born.  I experience “privilege” by generally getting the benefit of the doubt that I am not going to commit a crime wherever I am.  I can get pulled over and probably just get a warning.  I don’t get randomly harassed by cops and business owners typically treat me with respect.  That is a basic privilege that I get simply by being born white.  The rest of it… no one knows how I grew up.  I grew up extremely poor.  I wasn’t handed anything.  No inheritance or anything like that. As far as my views on the $200k not being “a shit ton” of my money, that was a bit of an exaggeration for effect, but also an accurate statement based on the cost of living in the US. Is it a “privilege” that you need to earn $5M to be set for life in the US?  If I had been lucky enough to be born in a less expensive country, I could call it a day at the first million.  Everything is relative.  Had you commented… “we don’t all live in really expensive places, $200k is still a ton of money here in Uganda”, that would not have elicited a response.  Instead, you chose “check you privilege” which is generally code for “you sound like a pampered rich bastard so your opinion has no merit”.  Perhaps you meant it differently, but that is how it is used consistently. As much as I like trolling the internet, I do also enjoy a decent intellectual debate.  I stand by my statement that “check your privilege” is a dismissive comment.  I am actually very introspective.  I’ve spent a great deal of time “checking my privilege” and identifying areas where it does seem to apply.  And areas where it doesn’t.  It’s an over-used phrase that I find offensive.  And yes… I’ve thought long and hard about if it is offensive because it’s too close to the truth.  And I don’t think it is.  I am cognizant of the areas where it may apply to me and sensitive about the areas where I know it doesn’t.  As far as my “ad hominem” comment… that just personal experience.  People that use that phrase have been stuffy and pretentious.  Even snobby in their attitudes.  Perhaps you don’t fit that pattern, but it’s just something I’ve identified.",
        "created_utc": 1632307940,
        "id": "hdtvgzs",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1632336740.0
    },
    {
        "author": "User_Simulator",
        "body": "We posted the exact same thing at the same amount of capital that they could drop, too.\n\n ~ meta-cognizant\n\n-----\n\n[^^Info](https://github.com/trambelus/UserSim) ^^| [^^Subreddit](/r/User_Simulator)",
        "created_utc": 1632544446,
        "id": "he6m222",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632573246.0
    },
    {
        "author": "User_Simulator",
        "body": "Fidelity does, and I question why you knew that SPY LEAPS simplify your process without sacrificing returns.\n\n ~ meta-cognizant\n\n-----\n\n[^^Info](https://github.com/trambelus/UserSim) ^^| [^^Subreddit](/r/User_Simulator)",
        "created_utc": 1632545582,
        "id": "he6nx05",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632574382.0
    },
    {
        "author": "meta-cognizant",
        "body": "+u/user_simulator u/meta-cognizant",
        "created_utc": 1632545577,
        "id": "he6nwse",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632574377.0
    },
    {
        "author": "Arsewipes",
        "body": "I'm counting on a decent correction - I sold a bunch late August - but I'm also cognizant that this might just be another test of support.",
        "created_utc": 1632177935,
        "id": "hdne0tg",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1632206735.0
    },
    {
        "author": "Kartageners",
        "body": "Who? I’m pretty cognizant of not getting with someone with no education or decent job",
        "created_utc": 1632092953,
        "id": "hdiwbgg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632121753.0
    },
    {
        "author": "User_Simulator",
        "body": "Bear markets always recover, and they've been shorted down to the tits with veggies.\n\n ~ meta-cognizant\n\n-----\n\n[^^Info](https://github.com/trambelus/UserSim) ^^| [^^Subreddit](/r/User_Simulator)",
        "created_utc": 1632544605,
        "id": "he6mbpy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1632573405.0
    },
    {
        "author": "meta-cognizant",
        "body": "+u/user_simulator meta-cognizant",
        "created_utc": 1630985168,
        "id": "hbw10j5",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1631013968.0
    }
]