[
    {
        "author": "Ashamed-Unit1004",
        "body": "2 hours total. From Alabama to ZEBRA",
        "created_utc": 1609997306,
        "id": "gie9dbq",
        "permalink": "/r/wallstreetbets/comments/krwgw9/emergency_american_politics_containment_zone/gie9dbq/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1610026106.0
    },
    {
        "author": "quiethandle",
        "body": "Yep, ITM and as far out as you can go. Probably the best way to do LEAPs. Acts a lot more like stock than an option that will decay away to nothing.\n\nFor even less exposure to theta, take a look at a ZEBRA (Zero Extrinsic Back RAtio spread). You buy two 70 delta options and sell a 40 delta option to offset the extrinsic value in the 70 delta options. You wind up with 100 delta and basically no exposure to time decay. Might take a little more capital than some ITM LEAPs, though.",
        "created_utc": 1609991400,
        "id": "gidycux",
        "permalink": "/r/options/comments/ks1i8m/best_stocks_for_leap_options/gidycux/",
        "score": 4,
        "subreddit": "options",
        "created": 1610020200.0
    },
    {
        "author": "SpiritualBus",
        "body": "Open a zebra on the short side",
        "created_utc": 1609712975,
        "id": "gi03zuk",
        "permalink": "/r/wallstreetbets/comments/kpsy0b/what_are_your_moves_tomorrow_january_04_2021/gi03zuk/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1609741775.0
    },
    {
        "author": "quiethandle",
        "body": "&gt; How do you calculate this for yourself to put together a ZEBRA?\n\nI didn't really answer this in my other message - I review the different strike prices and for each option I look to see how much of its value is extrinsic, and use that in my consideration as well as the delta. For instance, if I can buy two ITM options that have 5 dollars each of extrinsic value, I want to offset a total of 10 dollars - I'll try to sell 1 option with 10 dollars of extrinsic value. The net result is I didn't have to pay for any extrinsic value out of my own pocket.\n\nSometimes there isn't a perfect zebra with exactly 100 delta and 0 extrinsic value, but you can usually get somewhat close.",
        "created_utc": 1610072521,
        "id": "gihwxnl",
        "permalink": "/r/options/comments/ks1i8m/best_stocks_for_leap_options/gihwxnl/",
        "score": 2,
        "subreddit": "options",
        "created": 1610101321.0
    },
    {
        "author": "bagtf3",
        "body": "I'm big horny for this ETF. Im holding $35 6/18 calls. Volume is shit at this point, but once it starts to perform that will pick up. Its holding some real bangers, mixed with a solid group of alt plays. This is a great etf to hedge either a meme account or a boomer account. \n\nAfter these calls plays out im going long on shares, no spoilers. \n\nCRWD ENPH ZBRA TTWO BILI ROKU DKNG\n\n[see all holdings here](https://www.invesco.com/us/financial-products/etfs/holdings?audienceType=Investor&amp;ticker=QQQJ)",
        "created_utc": 1610071921,
        "id": "gihvs04",
        "permalink": "/r/wallstreetbets/comments/ksmmx6/what_are_your_moves_tomorrow_january_08_2021/gihvs04/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610100721.0
    },
    {
        "author": "Argentino4209",
        "body": "How do you calculate this for yourself to put together a ZEBRA? Do you always have to buy two 70 deltas and sell one 30 delta?",
        "created_utc": 1610052293,
        "id": "gigrlyx",
        "permalink": "/r/options/comments/ks1i8m/best_stocks_for_leap_options/gigrlyx/",
        "score": 1,
        "subreddit": "options",
        "created": 1610081093.0
    },
    {
        "author": "quiethandle",
        "body": "&gt; is that a type of option or is there something special I have to look into or get\n\nIt's a combination of regular options. It's a type of spread, so you do have to be approved for trading spreads. It's buying a debit spread (which is buying one long option and selling one short option), but purchasing one extra long option.\n\nhttps://www.tastytrade.com/tt/shows/options-workshop/episodes/the-zero-extrinsic-back-ratio-zebra-08-13-2018",
        "created_utc": 1610073067,
        "id": "gihy07z",
        "permalink": "/r/options/comments/ks1i8m/best_stocks_for_leap_options/gihy07z/",
        "score": 1,
        "subreddit": "options",
        "created": 1610101867.0
    },
    {
        "author": "Argentino4209",
        "body": "Would you be able to do a ZEBRA on otm leaps?",
        "created_utc": 1610043409,
        "id": "gig7lj7",
        "permalink": "/r/options/comments/ks1i8m/best_stocks_for_leap_options/gig7lj7/",
        "score": 1,
        "subreddit": "options",
        "created": 1610072209.0
    },
    {
        "author": "IOnlyUpvoteSelfPosts",
        "body": "ZEBRA looks pretty cool. I just looked into it for AAPL. So I could buy two contracts of Mar 2023 105c and sell one contract of 170c for about 61.85, or $6185 dollars. Delta is 1.03. Since my long option may get used for assignment, I’m basically controlling 100 shares with 6185, when instead I would be paying $12,600. Does this sound right?",
        "created_utc": 1610023903,
        "id": "gif4tj3",
        "permalink": "/r/options/comments/ks1i8m/best_stocks_for_leap_options/gif4tj3/",
        "score": 1,
        "subreddit": "options",
        "created": 1610052703.0
    },
    {
        "author": "holoscenes",
        "body": "If you’re planning on holding them until expiration it’s worth considering the impact volatility (via Vega). With two contracts you’re Vega will be 0.192 which means for each change of 1% in implied volatility your calls will gain/lose ~$19.20, with such a new stock it’s a bit hard to tell where IV will go but over a medium time frame it seems inevitable it will drop.\n\nThat being said you’ll long the equivalent of 100 shares out of the gate so with directionality on your side and especially some Gamma love seems more than likely you’ll end up just fine.\n\nAnother potential play if what you’re looking for specifically is a position as close as possible to owning shares but without the capitol requirements is a synthetic long. You buy a call sell a put, lots of info out there on this/variants. I know TastyTrade is all about a version called ZEBRA if you follow them.\n\nOptions do expose you to more possible risks but when targeting growth with limited funds the  upside of a smart play will more than likely yield a better return than just shares, with the obvious drawback that if the market moves against you you may be stuck",
        "created_utc": 1609887078,
        "id": "gi8imn9",
        "permalink": "/r/stocks/comments/kr81s6/stocks_vs_leaps_best_way_to_hold_longer_term_but/gi8imn9/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609915878.0
    },
    {
        "author": "quiethandle",
        "body": "You wouldn't be able to eliminate the extrinsic value with only otm options. The key feature of a zebra is that you aim to have basically no extrinsic value.",
        "created_utc": 1610046581,
        "id": "gigev36",
        "permalink": "/r/options/comments/ks1i8m/best_stocks_for_leap_options/gigev36/",
        "score": 1,
        "subreddit": "options",
        "created": 1610075381.0
    },
    {
        "author": "illcrx",
        "body": "what, no time decay? How does that work. I have ETRADE and will look into ZEBRA, is that a type of option or is there something special I have to look into or get.",
        "created_utc": 1609995201,
        "id": "gie5jsj",
        "permalink": "/r/options/comments/ks1i8m/best_stocks_for_leap_options/gie5jsj/",
        "score": 1,
        "subreddit": "options",
        "created": 1610024001.0
    }
]