[
    {
        "author": "tdonb",
        "body": "Glad to see a real stock with potential discussed over here. Look at the board members. Those are heavy hitters for a small company to have. Curran, Spitzer, Oz, and Sharma. Several have big histories with Google, Ford, and Ansys.  No way they are working for chump change. They must see big things ahead for their options.",
        "created_utc": 1626154105,
        "id": "h5097hw",
        "permalink": "/r/wallstreetbets/comments/oj5o5p/mvis_dd/h5097hw/",
        "score": 60,
        "subreddit": "wallstreetbets",
        "created": 1626182905.0
    },
    {
        "author": "Kellzbellz8888",
        "body": "Your correct. We don’t know if it’s graphical actually. Just that it’s a simulation. I think it’s from ANSYS. But if you take a look at MVIS videos of their consumer Lidar point cloud. Ol even that looks better than Tesla point cloud. And the LRL is gen 5 version of that",
        "created_utc": 1626185134,
        "id": "h51deu7",
        "permalink": "/r/wallstreetbets/comments/oj5o5p/mvis_dd/h51deu7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1626213934.0
    },
    {
        "author": "Sacrificed",
        "body": "Piggy backing on the duration argument -- I think the market is correctly pricing in that switching cost moats = worse economics, but lower terminal value risk; while network effect moats = better economics, but more terminal value risk.\n\nJust look at the multiples on any of the vertical SaaS companies (ADBE, ADSK, ANSS, TYL, etc), with Microsoft Office being the king of \"our whole business runs on Excel, so we aren't going to risk changing that\". It's a great launching point for an Azure upsell, further entrenching their stickyness in workflows.",
        "created_utc": 1627656448,
        "id": "h736xw8",
        "permalink": "/r/investing/comments/ouikh2/msft_longterm_vs_faang_growthrate_ai_and_tablets/h736xw8/",
        "score": 1,
        "subreddit": "investing",
        "created": 1627685248.0
    }
]