[
    {
        "author": "quiethandle",
        "body": "I agree with OP's bearish thesis, but for the love of God do not literally short this thing nor should you buy puts. Shorting is too dangerous, and the puts will be far too expensive.\n\nInstead, sell out of the money call credit spreads, or, if you are willing to invest more capital in a purely directional move down, look at a bearish ZEBRA trade using puts (zero extrinsic back ratio). It involves buying two in the money 70 Delta puts, and selling one at the money 40 Delta put. Adjust the strikes and expirations so that you have roughly -100 Delta and as little extrinsic value as possible.",
        "created_utc": 1625187213,
        "id": "h3r0d1r",
        "score": 52,
        "subreddit": "stocks",
        "created": 1625216013.0
    },
    {
        "author": "Spanky007_bong_867",
        "body": "Can only cry wolf so many times and folks stop listening.  Wake me up when they get to the CCP Zebra variant.  Until then, I'll buy Ivermectin and count my $AMC and $GME tendies.",
        "created_utc": 1625772223,
        "id": "h4ialgd",
        "score": 7,
        "subreddit": "Wallstreetbetsnew",
        "created": 1625801023.0
    },
    {
        "author": "handtodickcombat",
        "body": "My parents took me to a Jethro Tull concert when I was a kid. Some time into the show they had 2 guys in a zebra costume on stage, dancing around while the back guy fed tennis balls out the back of the costume. So there I am, 10 years old, being entranced by a man with a flute while a zebra dances around stage shitting tennis balls. \n\nNo drugs or alcohol (well maybe a minor contact buzz) and it's still the wildest trip I've ever had.",
        "created_utc": 1626477940,
        "id": "h5ggn6x",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1626506740.0
    },
    {
        "author": "xplodngKeys",
        "body": "You can enter into a ZEBRA and not worry so much about Vega",
        "created_utc": 1625422829,
        "id": "h41qdfy",
        "score": 5,
        "subreddit": "options",
        "created": 1625451629.0
    },
    {
        "author": "tldr193",
        "body": "The only way I’ve made buying puts on GME profitable is getting in at the top and targeting farther out Expiry. \n\nI Bought an 8/16 300p when it peaked last month and have been day trading diagonal spreads against it (selling closer to expiry puts). I did the same with a 7/16 240P, but I’m just letting that ride. \n\nThe 240P breakeven is 185 at expiry, but by selling puts against it along the way, the breakeven ends up more around 210 from the premium collected from day trading the short diagonal put. \n\nI’ve been thinking about running a ZEBRA (zero extrinsic back ratio) next time it rallies really hard. That is buying two -\n70 delta puts and selling a -50 delta put in the cycle, 60 days out. That gives you minimal extrinsic value but -100 delta, which emulates shorting 100 shares with capped losses (since my brokers won’t let me short GME).",
        "created_utc": 1626363364,
        "id": "h5aaze5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626392164.0
    },
    {
        "author": "GraysonMA",
        "body": "The zebra seems like a better option **if** the stock price continues to go up such that all options are ITM at expiration.\n\nWorst case scenario, the stock price tanks or even just falls a few cents, and then you’re at max loss at expiration. The benefit of buying shares is that even if the stock does poorly in the short term, you still have shares you can sell for a small loss or continue to sell covered calls against.\n\nSome management options worth considering though…\n1. Only buy the number of shares equal to the delta of the short call, and buy more if the delta rises.\n2. Sell a put (keep the overall position delta slightly negative in case the underlying reverts downward). Roll the put up if the underlying continues to rise.\n3. Buy a further dated call or zebra,",
        "created_utc": 1625193771,
        "id": "h3rcsn3",
        "score": 2,
        "subreddit": "options",
        "created": 1625222571.0
    },
    {
        "author": "The_Transcendent1111",
        "body": "So ZBRA is acquiring Fetch Robotics. Do with that as you will",
        "created_utc": 1625148201,
        "id": "h3omlnh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625177001.0
    },
    {
        "author": "Mad_Nekomancer",
        "body": "The thing with the historic P/Es is that the denominator changes 4 times a year (for earnings) and the numerator changes day to day. So if Zebra, say, spent a bunch of money on acquisitions or something (assuming they had cash and it wasn't financed through debt) it would impact the earnings until the end of the following quarter. \n\nSo if there's an anomaly in the P/E you really have to dig through the earnings reports at the beginning of that quarter to see if there's a technical reason for it. I don't follow ZBRA enough to know if there is anything like that the last year but I know they're always spending money to keep their offerings up to date and expand them.",
        "created_utc": 1626210584,
        "id": "h52ycok",
        "score": 2,
        "subreddit": "stocks",
        "created": 1626239384.0
    },
    {
        "author": "thebills0",
        "body": "&gt; Instead, sell out of the money call credit spreads, or, if you are willing to invest more capital in a purely directional move down, look at a bearish ZEBRA trade using puts (zero extrinsic back ratio). It involves buying two in the money 70 Delta puts, and selling one at the money 40 Delta put. Adjust the strikes and expirations so that you have roughly -100 Delta and as little extrinsic value as possible.\n\nEnglish please",
        "created_utc": 1625208476,
        "id": "h3rzp90",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625237276.0
    },
    {
        "author": "redtexture",
        "body": "THE COMPREHENSIVE GUIDE TO THE ZEBRA STRATEGY  \nGavin McMaster   \nOptionsTradingIQ  \nhttps://optionstradingiq.com/the-comprehensive-guide-to-the-zebra-strategy/",
        "created_utc": 1626860972,
        "id": "h5zhmlv",
        "score": 1,
        "subreddit": "options",
        "created": 1626889772.0
    },
    {
        "author": "Next-Level-Trader",
        "body": "Look at ZEBRA and PMCC strategies as stock replacements.",
        "created_utc": 1627761126,
        "id": "h78ihzi",
        "score": 1,
        "subreddit": "options",
        "created": 1627789926.0
    },
    {
        "author": "New-Manufacturer-465",
        "body": "The ZEBRA strategy is a stock replacement that uses a ratio spread. U can find it on youtube tastyworks.",
        "created_utc": 1625449655,
        "id": "h4334j2",
        "score": 1,
        "subreddit": "options",
        "created": 1625478455.0
    },
    {
        "author": "dvdmovie1",
        "body": "ZBRA was an addition last Fall when I redid a lot of my portfolio. No interest in adding further at this point but still own it.",
        "created_utc": 1627580000,
        "id": "h6zanyy",
        "score": 1,
        "subreddit": "investing",
        "created": 1627608800.0
    },
    {
        "author": "clevelandtillidie90",
        "body": "Thinking about getting into a couple of these for the long term. What are your thoughts on:  \n\n\nTuSimple:TSP\n\nZebra Tech: ZBRA\n\nAsana: ASAN \n\nBrooks Automation: BRKS",
        "created_utc": 1627575549,
        "id": "h6yzpme",
        "score": 1,
        "subreddit": "investing",
        "created": 1627604349.0
    },
    {
        "author": "nilsarndt99",
        "body": "Looking at the stocks you've picked, 100 Dollar invested in each of them (except DISCA, because its the same as DISCK) your returns are (if invested on 1st of march):\n\n* DISCK -40%\n* SBNY +10.75%\n* CSWC +4.69%\n* IEP -10.32%\n* ZBRA +3.52%\n* PRTA +139.32%\n* HAYN +18.76%\n\nWith 700$ invested you would've made 826.72$ (18.1% profit). In the same period the S&amp;P 500 did 10.1%.",
        "created_utc": 1625133467,
        "id": "h3nzd4r",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625162267.0
    },
    {
        "author": "Mad_Nekomancer",
        "body": "Since I started working in IT for AMZN I've been pretty impressed by, and considered investing in, some of the companies that support Amazon operations. CGNX, ZBRA, and JLL are all interesting companies that have a bit of a moat in some of what they do and will benefit from Amazon growing.",
        "created_utc": 1625363795,
        "id": "h3zbpoa",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625392595.0
    },
    {
        "author": "TheoHornsby",
        "body": "These fancily named strategies are a waste of time (Zebra, Jade Lizard, Twisted Sister, etc.).  \n\nModel the combination of options  and see if the P&amp;L graph suits your reward objective and risk tolerance.  It doesn't matter if it's an existing strategy or a combination of disparate options of your choosing.",
        "created_utc": 1625171346,
        "id": "h3q3ba4",
        "score": 1,
        "subreddit": "options",
        "created": 1625200146.0
    },
    {
        "author": "BackThatThangUp",
        "body": "Would you slash in combat if you could smash a wombat?\n\nWould you loan a bookie if you could bone a wookie? \n\nWhat kind of bookie makes a wookie make nookie?\n\nWould you cook waffles for a Libra to get horizontal with a zebra?\n\nStay tuned for my new kid’s book out next month",
        "created_utc": 1627697481,
        "id": "h75p3u5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627726281.0
    },
    {
        "author": "Pltr_x2-4_Tsla",
        "body": "Try zbra and see how partnering works lol",
        "created_utc": 1626907614,
        "id": "h626v04",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1626936414.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "🤡 why would the hull be covered in pine needles? The hull is squeaky clean, prop is brand new. The whole point is to stop the spread of quagga muscles and zebra muscles - literally nothing else\n\n&gt;Learn proper nautical etiquette\n\n\nComplaining about pine needles... lmfao",
        "created_utc": 1625360899,
        "id": "h3z74gu",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1625389699.0
    }
]