[
    {
        "author": "Significant-Yak7593",
        "body": "PLTR has contracts with Faurecia, Amazon, IBM, US government. How could you not like this stock?!?!",
        "created_utc": 1615501215,
        "id": "gqmi21o",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1615530015.0
    },
    {
        "author": "Key-Bear-6470",
        "body": "PLTR was down due to the lock up period, but within a month/two maximum will explode !  \nThis is a solid company that made billion contracts with solid companies like Rio Tinto, 3M and IBM.  \nThere are rumors that can even make a deal with Facebook.  \n\n\nPLTR will explode to the fucking stratosphere!",
        "created_utc": 1614769123,
        "id": "gpismfb",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1614797923.0
    },
    {
        "author": "Pataract",
        "body": "Thinking about buying in on this PLTR dip.  Contracts with Amazon, 3M, and IBM, this is bound to go up and up, right?",
        "created_utc": 1615226503,
        "id": "gq8hoi2",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1615255303.0
    },
    {
        "author": "TaterNeck",
        "body": "Thoughts on IBM? High dividend and holds stable ground in the future of quantum computing.",
        "created_utc": 1615487451,
        "id": "gqlmxyp",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615516251.0
    },
    {
        "author": "notashypotato",
        "body": "Good. Fucking boomer kept saying sell tesla and buy IBM. Greatest generation my ass.",
        "created_utc": 1615502053,
        "id": "gqmjt8t",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1615530853.0
    },
    {
        "author": "mateace",
        "body": "CNBC NEWS CNBC NEWS\n\nIBM BUY LUMN\n\nLUMN 🚀🚀🚀🚀🚀🚀🚀🚀🚀💰💵\n\nBUY BUY BUY BUY BUY BUY",
        "created_utc": 1614790175,
        "id": "gpjug12",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614818975.0
    },
    {
        "author": "Vanilla_Actual",
        "body": "Nearly every program Microsoft has sold was designed by another company which Msft copied or stole. \n\n\nThe original QDos was another programmer’s work.\n\nGates’ mother was on the board of IBM\nthat’s how he got the contract and the money to market dos. He then promptly screwed IBM .. they tried competing with OSI and OSII. \nAfter that it was exclusive contracts tht caused other programmers to go out of biz while continuances went on and on until they went bk. \nMsft tried the same kind of thing with browsers included in windows software... who’s going to buy anyone else’s  browser? Anti trust issue\n\n\n\nExcel is Lotus 123\nWord is Word Perfect\nEtc",
        "created_utc": 1615948463,
        "id": "gr72rkk",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1615977263.0
    },
    {
        "author": "joe62888",
        "body": "IBM $150 June calls. \n\nMMM $250 July calls\n\nZNGA $13 June calls\n\nTELL $4 JUNE CALLS",
        "created_utc": 1615932852,
        "id": "gr68u4b",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615961652.0
    },
    {
        "author": "teslas_love_pigeon",
        "body": "If patents meant anything IBM and GE would be the most valuable companies on earth.",
        "created_utc": 1615955288,
        "id": "gr7e0os",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1615984088.0
    },
    {
        "author": "mateace",
        "body": "CNBC NEWS CNBC NEWS\n\nIBM BUY LUMN\n\nLUMN 🚀🚀🚀🚀🚀🚀🚀🚀🚀💰💵 \n\nBUY BUY BUY BUY BUY BUY",
        "created_utc": 1614789986,
        "id": "gpju002",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614818786.0
    },
    {
        "author": "schravenralph",
        "body": "The strategy was originally designed to augment the trading of ranging stocks that you wouldn't mind holding if the underlying ends up taking a big hit.\n\nNow, with this concept, you are not protected against large downward swings. If you are particularly bullish on these stocks but want to sell volatility at the same time, by all means. But there's dollar-cost averaging to make your bet on the stocks, and there's more capital-efficient and direction-agnostic strategies such as iron condors and strangles to sell volatility and risk.\n\nThe Wheel does well on big names such as IBM and other stocks that aren't destined to shoot to the moon but are also incredibly stable. I wouldn't mind holding it at a discount and I wouldn't mind if by some miracle it breaks a 5-year record right.\n\nThis bias towards a stock can be asserted into a strategy by employing the Wheel, but to me the stocks listed don't qualify in remotely the same way.",
        "created_utc": 1615512684,
        "id": "gqn4g2k",
        "score": 3,
        "subreddit": "options",
        "created": 1615541484.0
    },
    {
        "author": "mateace",
        "body": "CNBC NEWS - CNBC NEWS\n\nIBM BUY LUMN\n\n$LUMN   🚀🚀🚀🚀🚀🚀🚀🚀 \n\nBUY BUY BUY BUY BUY BUY BUY",
        "created_utc": 1614798246,
        "id": "gpkdacr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614827046.0
    },
    {
        "author": "BoGD",
        "body": "Is there anything promising coming out of IBM that will bump the stock?",
        "created_utc": 1614854197,
        "id": "gpn1fs2",
        "score": 3,
        "subreddit": "stocks",
        "created": 1614882997.0
    },
    {
        "author": "Upset_Bear",
        "body": "If you are insistent on Tech, IBM and CSCO , you're welcome.",
        "created_utc": 1615241829,
        "id": "gq9gs3j",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615270629.0
    },
    {
        "author": "Javier-Ramosdotcom",
        "body": "$IBM - great dividend payer with some growth potential.",
        "created_utc": 1615254417,
        "id": "gqa4o42",
        "score": 3,
        "subreddit": "stocks",
        "created": 1615283217.0
    },
    {
        "author": "callmekizzle",
        "body": "i own 3 as well: GME, IBM, and SKT",
        "created_utc": 1614808368,
        "id": "gpl0n6h",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614837168.0
    },
    {
        "author": "Chrunker",
        "body": "the US federal reserve is an excel file he stores on his IBM Laptop from 1997, he adds zeroes as needed.",
        "created_utc": 1614770832,
        "id": "gpiuhys",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614799632.0
    },
    {
        "author": "junckdogg",
        "body": "PLTR WILL BE BIGGER THAN MSFT IN THE LONG RUN. IBM has partnered with PLTR because they need “PLTR Foundry” system.  IBM is using this with their “clients” amazing IBM WORKING FOR PLTR SELLING THEIR PRODUCTS,...MERGER???? DOD",
        "created_utc": 1614782947,
        "id": "gpje1by",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614811747.0
    },
    {
        "author": "Adventurous-Luck-103",
        "body": "Not all dividend stocks are created equal. Such as General Electric who dropped their dividend to I believe 1 cent. Look for companies with at least a 25 year history of paying and increasing dividends that’s why they are called the aristocrats. Coke, IBM , Proctor and Gamble come to mind. They are not exciting stocks their price doesn’t move to much historically. However when you buy the stock have the dividends reinvested than over time you see the magic  of compounding interest. There is an legend that Albert Einstein said compounding interest was the most powerful force in the universe. Not sure I believe it’s an actual quote , but it does get the message across. Not investment advice. Good luck.  Edit here is a list of aristocrats: https://news.yahoo.com/2021s-dividend-aristocrats-list-65-232153617.html",
        "created_utc": 1617151642,
        "id": "gsv4h2t",
        "score": 3,
        "subreddit": "stocks",
        "created": 1617180442.0
    },
    {
        "author": "Accomplished_Rice284",
        "body": "[https://www.prnewswire.com/news-releases/moderna-and-ibm-plan-to-collaborate-on-covid-19-vaccine-supply-chain-and-distribution-data-sharing-301240815.html](https://www.prnewswire.com/news-releases/moderna-and-ibm-plan-to-collaborate-on-covid-19-vaccine-supply-chain-and-distribution-data-sharing-301240815.html)\n\nComes right after IBM started its relationship with Palantir on Monday.  Connect the dots.....",
        "created_utc": 1614879096,
        "id": "gpoarte",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614907896.0
    },
    {
        "author": "K_t_ice",
        "body": "Is there ever a good time to get into IBM?",
        "created_utc": 1614842352,
        "id": "gpmoxmf",
        "score": 3,
        "subreddit": "stocks",
        "created": 1614871152.0
    },
    {
        "author": "iamzyb",
        "body": "His 256mb usb drive on his 2003 ibm thinkpad",
        "created_utc": 1614874778,
        "id": "gpo0qlc",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614903578.0
    },
    {
        "author": "TheMariannWilliamson",
        "body": "Thank you for rationality lol. Hilarious to see people set price targets on SPACs based entirely on SPACs in the same industry and that alone. Should IBM at $120 be worth as much as Google at $2000? They compete, right??",
        "created_utc": 1614833332,
        "id": "gpmcnm5",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1614862132.0
    },
    {
        "author": "new-chris",
        "body": "IBM is the future of tech...  😂",
        "created_utc": 1615234926,
        "id": "gq918bv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1615263726.0
    },
    {
        "author": "Hle078",
        "body": "Patents don’t mean much to company success. Do you know which company had 9k patents issued in 2020 and has historically known for leading the world in patents? IBM. Check their stock price for the past decade and let me know if you see a correlation between number of patents and stock price",
        "created_utc": 1615255039,
        "id": "gqa5slg",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1615283839.0
    },
    {
        "author": "atojbk",
        "body": "NY releasing vaccine passport produced by IBM.  Calls on ibm?",
        "created_utc": 1616887466,
        "id": "gsiuxn2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1616916266.0
    },
    {
        "author": "markstopka",
        "body": "&gt;Still think the biggest mistake the United States did was let Lenovo buy IBM's PC business back in the day.\n\nWhy? The real know-how, like IBM Q or IBM Z is still owned by IBM, commodity hardware is just that, commodity.",
        "created_utc": 1617055401,
        "id": "gsqidt5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617084201.0
    },
    {
        "author": "ImprovisedTaxShelter",
        "body": "&gt;You've basically said they have software that solves complicated problems.\n\nLOL for real. The post you're replying to is a generic description of every single enterprise software company's business. You could Find/Replace \"PLTR\" with SAP, IBM, Oracle, Salesforce, Azure, or AWS and it'd still be accurate (and not unique). As far as I can tell, Palantir's only differentiation is that it's tailored for Intelligence and Law Enforcement domains (and since I know pretty much nothing about those market segments I choose not to invest).",
        "created_utc": 1615404788,
        "id": "gqhf0hi",
        "score": 2,
        "subreddit": "investing",
        "created": 1615433588.0
    },
    {
        "author": "flyingmoose0913",
        "body": "So my perspective is that those two are actually in very different places from a regulation perspective.  \n\nGoogle is likely to get continually more regulated as time goes on and data privacy becomes a bigger issue.  I would say it doesn't actually fall under most current anti-trust legislation which is related to price competition and its revenue area is actually advertising where there is lots of competition BUT I agree that practically it is enough of a monopoly that it will likely get dragged into it.  I sold my Google and FB a few months ago, both just to take profits and because I think there's a solid chance they spend the next 2-4 years in continuous litigation and hearings over how to manage data more responsibly and how they should be regulated.  Doubt anyone can agree to anything, but it will put a damper on their acquisition and expansion sprees.\n\nAmazon is a very different case as Amazon isn't really a monopoly in any way, they just compete in SO MANY categories that it feels that way.  But when you look at it...in e-commerce, its hard to call someone a monopoly when Walmart, Target, Costco Best Buy and every other big box compete with them; AWS is fighting tooth and nail with Microsoft Azure, Google could, IBM, Oracle etc.; \n\nWe can keep going down the list - Prime video competes with Netflix and Hulu; Amazon logistics competes with UPS and Fedex and Uber Cargo...so while their everpresence in our lives makes it feel like it MUST be a monopoly, its actually hard to identify anywhere specifically that Amazon isn't subject to pretty intense competition by big players, thus hard to make a case for anti-competitive behavior or anti-trust violations.",
        "created_utc": 1615478145,
        "id": "gql1hkp",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1615506945.0
    },
    {
        "author": "kdlaz",
        "body": "This IBM thing is REALLY gonna take off.  Any day now.",
        "created_utc": 1615840384,
        "id": "gr1x395",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615869184.0
    },
    {
        "author": "RogerBauman",
        "body": "Yeah, I had expected PLTR to be a little bit more active with the whole IBM cloud pack suite tomorrow.",
        "created_utc": 1615841420,
        "id": "gr1zeff",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615870220.0
    },
    {
        "author": "turkeychicken",
        "body": "Like others said, I think that's a good method to get started with investing in individual stocks.  I'm glad I did it that way when I started out.\n\nFor example, one of the first stocks I purchased was 2 shares of IBM when they were near their all time high in 2013.  I still own those two shares and I'm down 35% (-$186 total) on them.  I'm still holding them though, mostly as a reminder that things don't always work out the way you hope.\n\nIf I had saved up and dumped like 10k into IBM back then, I'd be really pissed haha.\n\nYour gains might not seem like as much, but if you spent $1000 on 10 investments that all went up, it's not really much different than spending $1k on one investment that went up.",
        "created_utc": 1615575792,
        "id": "gqpy747",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615604592.0
    },
    {
        "author": "mateace",
        "body": "NOW IN BLOOMBERG - NEWS\n\nIBM BUY LUMN\n\n$LUMN 🚀🚀🚀🚀🚀🚀🚀🚀🚀💰💵\n\nBUY BUY BUY BUY BUY BUY",
        "created_utc": 1614790533,
        "id": "gpjvae9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614819333.0
    },
    {
        "author": "mateace",
        "body": "CNBC NEWS - CNBC NEWS\n\nIBM BUY LUMN\n\n$LUMN   🚀🚀🚀🚀🚀🚀🚀🚀 \n\nBUY BUY BUY BUY BUY BUY BUY",
        "created_utc": 1614794549,
        "id": "gpk4pzx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614823349.0
    },
    {
        "author": "YEET_THE_VOTE",
        "body": "IBM developing COVID multi pass for NY - https://www.governor.ny.gov/news/governor-cuomo-announces-pilot-program-testing-excelsior-pass-madison-square-garden-and",
        "created_utc": 1614709101,
        "id": "gpfvuel",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614737901.0
    },
    {
        "author": "Ilovethebronx",
        "body": "....but what about the server deal from 2014? Had IBM still owned it considering the explosion in cloud it would’ve turned a profit. Now, China owns that business, not a US company that honestly should’ve held onto it, not just from a profitability view but a national security one as well.",
        "created_utc": 1617056015,
        "id": "gsqjlt4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617084815.0
    },
    {
        "author": "23moonster",
        "body": "Probably AI related. Like IBM, PLTR, BIDU, AI, ARKQ",
        "created_utc": 1617075702,
        "id": "gsrjr7y",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617104502.0
    },
    {
        "author": "Viscoden",
        "body": "Warren's philosophy revolves around value investing and buying what you know. Warren doesn't know tech, and he knows that he doesn't.\n\nInvesting is all about risk management; how much risk are you taking on for a realistic reward? What happens if you lose a large portion of your money? I personally don't want to spend an extra five to ten years not retired because of a stupid mistake trying to double my money.\n\nIt's not as simple as buying Apple or Microsoft and earning 30% average per year. There were many years where they traded sideways or downwards. Look at Microsoft from 2001 to 2014. Thirteen years of doodoo in terms of equity appreciation. It can happen again.\n\nMany of the companies you see popularized today will not be around in 5 to 10 years. For some reason it is popular to lose money and then try to go public.\n\nI wouldn't hesitate to call myself a value investor. One of my \"top\" holdings is eBay. I don't expect for eBay to 10x overnight, but I do believe that it is fundamentally undervalued, and that it is an e-commerce/tech company that pays a dividend. I'll probably still be holding this company in 10 years, and my dividend yield on cost should be pretty juicy at that point, so long as they continue to up the dividend. eBay is also relatively recession proof, as people will continue to buy and sell on their platform no matter what the economy looks like, which brings risk down.\n\nI'm long MSFT, AAPL and EBAY.\n\nThe price of the larger companies you mentioned has a lot to do with how much money they are making. IBM is still a fantastic company, but they don't raise their earnings by much. They have quite a bit of debt based on a quick look at finviz, and their dividend payout ratio looks like it is 103%, which is a little \"uh-oh\", as it means they are paying out more than they can afford to, putting their dividend at risk.\n\nThere are lots of value plays out there. I think Utz is a good value. WMT or TGT are arguably value companies.\n\n\nSorry for the rambling; hope any of this helps!",
        "created_utc": 1616880870,
        "id": "gsigo5d",
        "score": 2,
        "subreddit": "stocks",
        "created": 1616909670.0
    },
    {
        "author": "Berisha11",
        "body": "Green energy was the dotcom boom. Insane billion dollar valuations for Energy/EV stocks that only had a couple millions in revenue or like most EV companies: no revenue at all. We've all known this market couldn't last forever. But remember that this isn't the end, the companies that have actual value will survive just like the dotcom boom: Amazon, Adobe, IBM etc, becuase green is the future, just like internet was the future back in the early 2000s. If you invested in good companies with actual value, then there isn't much to worry about.",
        "created_utc": 1614813876,
        "id": "gplcc3x",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614842676.0
    },
    {
        "author": "lorde_dingus",
        "body": "Future cash flows look promising. I love their contract structure and think their willingness to do the dirty work for the government/DOD will keep them the front runner in this sector. Would love to see them capture more market share, the IBM deal tells me they are on their way to doing just that. (IBM admitted defeat here, thats a BIG DEAL to me).",
        "created_utc": 1614829571,
        "id": "gpm66ip",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614858371.0
    },
    {
        "author": "th3cr1t1c",
        "body": "tl;dr:  Steve Jobs is laughing from beyond the grave because his company is now worth more than Dell, IBM and Microsoft combined... and he did it with a [round rectangle](https://www.folklore.org/StoryView.py?project=Macintosh&amp;story=Round_Rects_Are_Everywhere.txt).",
        "created_utc": 1615238604,
        "id": "gq99p7j",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615267404.0
    },
    {
        "author": "fwast",
        "body": "i sold my IBM position yesterday. Yes, it's good price for the stock probably. It just has a wishy washy future, and seems like its dyeing slowly over the years. I was one of my stocks I wasn't confident in long term.",
        "created_utc": 1614866884,
        "id": "gpnjj18",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614895684.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "AMD is at a great price level right now, if your goal is long-term and you want something relatively safe.\n\nIBM is a good long-term pick, too, though not everybody still agrees with that. But I do.\n\nIf you want something more speculative with a lot of potential, OPTT is great bet; a lot of people missed the mostly-local news about their latest R&amp;D test installation that will soon be built in Oregon. But this one is speculative.\n\nIf you like EV, I think RIDE is a great buy right now, they're getting less retail interest because they're focused on fleet trucks, instead of consumer trucks.\n\nI also like HYLN which is listed under industrials but designs and sells electric powertrains for EVs.\n\nFor med-tech I think THMO has huge potential, and is flying mostly under the radar right now.\n\nGSK, however, is a safer long-term play.\n\n(I own all these)",
        "created_utc": 1615255444,
        "id": "gqa6ism",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1615284244.0
    },
    {
        "author": "GamblingMikkee",
        "body": "IBM is anti-tech",
        "created_utc": 1615260868,
        "id": "gqagby8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615289668.0
    },
    {
        "author": "fuckthedebt",
        "body": "Yeah, I agree.  I thought there would be more resistence today at the 50 SMA, seeing as we have come so far so quick, but it passed that and is headed towards the 10 day.  I think we should expect some days of consolidation but expect now the bottom was in and, while not firmly over the 50 day, support around the 20SMA at circa 13100 or 13000 intraday on down day should hold.  I doubt we are going straight to brand news highs with a few weeks of bouncing around, albeit in a higher range.  I still don't know if end of quarter rebalancing is being done or will come later in the month.  That still could see some rotation and a little pull back but correction appears over, which is what is important.  \nOver the past year, the market has always seemed to tank when the fed talks, so I would watch the FOMC results.  Things are looking good technically.  I am really only in IBM, QCOM, SWKS and FB for teck, with the rest of my portfolio in energy and cyclical reopening's.",
        "created_utc": 1615481092,
        "id": "gql8490",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1615509892.0
    },
    {
        "author": "Wrong_Kaleidoscope77",
        "body": "Exactly this.  Remove the pandemic and the 2020 rise doesn’t happen.\n\nWhat’s scaring me is the new administrations addition of Tim Wu to the NEC and upcoming nomination of Lina  Khan to the FTC.  I’m getting out of the bigger tech especially FAANG because any anti trust litigation will take years and add a lot of uncertainty.  Doesn’t matter if the action is successful or not - it’s a drag on the company.  Ask Ma Bell, IBM and MSFT.\n\nfor me, that means goodbye FAANG, hello CRSR, INTC, NVDA, CRM",
        "created_utc": 1615424420,
        "id": "gqikvos",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1615453220.0
    },
    {
        "author": "imtotallybananas",
        "body": "I expect way more commercial contracts than 1-2. They have been announcing deals non stop and the IBM deal will accelerate the process. It is a disadvantage not to use their software and companies will realise soon. Government contracts will increase as well, look at Britain's success with vaccine distribution, they have been on the losing side with Corona before but now EU sucks in comparison.",
        "created_utc": 1614878169,
        "id": "gpo8lyi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614906969.0
    },
    {
        "author": "SStauning",
        "body": "Depends. I'll hold a real company like AAPL or a tech stock that pays a good dividend like IBM. \n\nGSAT? Nope. I have a ton of it; though I trade it; I don't own it.",
        "created_utc": 1614815429,
        "id": "gplfewp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614844229.0
    },
    {
        "author": "JimJamSquatWell",
        "body": "I know you are getting flack for this but I think you have a point - look at palisamo/ginetty at IBM buying back shares to hit their arbitrary EPS metric promise.\n\nThe company is the definition of stagnation so buy backs were a way to influence that metric.\n\nI worked at IBM during that time and it was and still is a terrible place for 75% of the employees, that money did nothing to change IBMs ability to be competitive in the market.\n\nI don't think buy backs are always negative but they are certainly a lever to pull and companies can pull that lever too much.",
        "created_utc": 1614705228,
        "id": "gpfmxzr",
        "score": 2,
        "subreddit": "investing",
        "created": 1614734028.0
    },
    {
        "author": "ilinula",
        "body": "IBM generates plenty of cash to cover its high dividend as well as share buy backs. What does that have to do with their ability to be competitive in the market? Free cash flow yield is a completely different metric, and it returns more value to shareholders for a company that is stagnating or declining. It's perfectly reasonable for them to buy back shares instead of sit on cash. I would prefer to hold a company like this than one that continually is able to be 'competitive in the market' but doesn't generate any cash so it has to issue shares year-over-year in order to supplement it's growth",
        "created_utc": 1614707972,
        "id": "gpft96t",
        "score": 2,
        "subreddit": "investing",
        "created": 1614736772.0
    },
    {
        "author": "Honorjudge",
        "body": "That sounds like office desk hell.  Hang in there you’re on WSB during working hours, this screams IBM top level management.",
        "created_utc": 1617048180,
        "id": "gsq354t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617076980.0
    },
    {
        "author": "Theeliteshitposter",
        "body": "Funny you mention that... IBM just partnered with PLTR! Regardless, we’ll see how Uncle Jay sets the table tmrw",
        "created_utc": 1615931506,
        "id": "gr660h8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615960306.0
    },
    {
        "author": "johnbburg",
        "body": "I can’t believe I sold my IBM two weeks ago, thinking it was “tech” and would be part of the downturn...",
        "created_utc": 1616888590,
        "id": "gsiwyld",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1616917390.0
    },
    {
        "author": "greytoc",
        "body": "Ah.. you are actually describing OT Security. Or Operational Technology Security. Typically common in ICS (industrial control systems) like SCADA. \n\nIt's different than IoT which is why you probably aren't finding stuff. \n\nThere are companies working on that area - IBM being one of them. Start here - [https://www.ibm.com/security/operational-technology](https://www.ibm.com/security/operational-technology)",
        "created_utc": 1617218327,
        "id": "gsy4dj4",
        "score": 2,
        "subreddit": "investing",
        "created": 1617247127.0
    },
    {
        "author": "ianyboo",
        "body": "&gt;  I basically only own dividend stocks (around 5 that aren't). I currently get little less than 20k a year in divs\n\nI'm quite new to this and only recently learned about dividends, I have one $120ish IBM stock and I think the dividend is 1.63 in order to get 20k in year from dividends how much IBM would someone need? I'm trying to wrap my head around the math but failing miserably. :)",
        "created_utc": 1614733563,
        "id": "gphddbq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614762363.0
    },
    {
        "author": "Joeyzunn",
        "body": "&gt;https://www.wsj.com/articles/ibm-explores-sale-of-ibm-watson-health-11613696770\n\nThank you! Will be adding to....Spacs in talks or Speculation... according to this \"IBM is studying alternatives for the unit that could include a sale to a private-equity firm or industry player or a merger with a blank-check company, the people said. \" Maybe has had talks with some spacs. what do you think?",
        "created_utc": 1614842822,
        "id": "gpmph8g",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1614871622.0
    },
    {
        "author": "Manbearpup",
        "body": "She can’t help you now, only the stimulus money and some apes...    maybe ibm",
        "created_utc": 1614895347,
        "id": "gppdaq6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614924147.0
    },
    {
        "author": "TeddyYolos",
        "body": "What’s older than the Boomers? I asked my Gramps what to do!\n\nI’m going AT&amp;T, GE, &amp; IBM.",
        "created_utc": 1615254905,
        "id": "gqa5jvf",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615283705.0
    },
    {
        "author": "This_Freggin_Guy",
        "body": "biggest concern i see is hiring.  unless they use 3rd parties, they have 0 product dev job openings or implementation jobs(3).  not really encouraging. IBM agreement will fill the field consultant gap, but not product dev....",
        "created_utc": 1615395995,
        "id": "gqgrv5g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615424795.0
    },
    {
        "author": "schravenralph",
        "body": "Oh, holy moly, that explains a lot. Just to keep the numbers generic I'll say it's slightly less than a tenth of that for me, so if I want to \"turn the wheel\" I'll need 80% of my BP just for that, in a stock like IBM or BABA. It's \"the\" strategy I'm employing at that moment, not \"a\" strategy.\n\nGiven that we're in an overextended market environment, I wonder if it would be best to convert mostly to cash and just hold on to cash for your dear life while the market keeps surfing higher and higher. I'm not doing it, but I'm taking some countermeasures such as investing a little bit more into Chinese stocks and allocating more to selling volatility / risk definition.",
        "created_utc": 1615591057,
        "id": "gqqtic1",
        "score": 2,
        "subreddit": "options",
        "created": 1615619857.0
    },
    {
        "author": "Shizzledizzle71",
        "body": "Had no idea NOK brought in 1.7 billion from patent license fees alone. I knew it was a lot but not that much. Almost as much as IBM. What a nice revenue stream.",
        "created_utc": 1615582626,
        "id": "gqqcubo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1615611426.0
    },
    {
        "author": "mateace",
        "body": "NOW IN BLOOMBERG - NEWS\n\nIBM GO BUY LUMN\n\n$LUMN 🚀🚀🚀🚀🚀🚀🚀🚀🚀💰💵\n\nBUY BUY BUY BUY BUY BUY",
        "created_utc": 1614791334,
        "id": "gpjx6d8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614820134.0
    },
    {
        "author": "mateace",
        "body": "NOW IN BLOOMBERG - NEWS\n\nIBM GO BUY LUMN\n\n$LUMN 🚀🚀🚀🚀🚀🚀🚀🚀🚀💰💵\n\nBUY BUY BUY BUY BUY BUY",
        "created_utc": 1614791461,
        "id": "gpjxh4g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614820261.0
    },
    {
        "author": "balpon37",
        "body": "It may be, I am not certain. I know Google is a partner who provides certificate for their Google Cloud Computing Platform - but there are tons of providers doing that (IBM, RedHat, AWS, etc).\n\nhttps://www.coursera.org/about/partners",
        "created_utc": 1617233292,
        "id": "gsyz5io",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617262092.0
    },
    {
        "author": "Boomtown626",
        "body": " This mindset is SOOOOO misleading. Hindsight is 2020, and this kind of perspective promotes gambling and carelessness. Put yourself in 1985. Here's the list of the companies in the Dow at the time:\n\n* Allied Signal, Inc\n* Aluminum Company of America\n* American Can Company (lol)\n* American Express Company\n* American Telephone and Telegraph Company (telegraph, lol)\n* Bethlehem Steel Corp\n* Chevron Corp\n* E.I. du Pont\n* Eastman Ko--(omitted for being a meme film stock that triggers the auto-mod)--d@k\n* Exxon Corp\n* General Electric\n* General Motors\n* Goodyear Tire\n* Inco Limited\n* IBM\n* International Harvester Company\n* International Paper Company (paper lol)\n* McDonalds Corp\n* Merck &amp; Co, Inc\n* Minnesota Mining &amp; Manufacturing (lol who??)\n* Owens-Illinois (lol who??)\n* Phillip Morris Companies\n* Procter &amp; Gamble\n* Sears Roebuck &amp; Company (lolololol)\n* Texaco Inc\n* Union Carbide Corp (dafuq?)\n* United States Steel Corp\n* United Technologies Corp\n* Westinghouse Electric Corp (lol the old refrigerators)\n* Woolworth Company (banned from just the one location, not all of them)\n\nAAPL was a speculative, fringe company. In order to invest $1,000 into AAPL ($2,500 in 2021 dollars, adjusted for inflation), you either had to be willing to gamble on penny stocks, have a crystal ball, or already be rich and diversified to the point that $1,000 was an acceptably small piece of your portfolio, meaning you were already well on your way to being a millionaire to begin with.",
        "created_utc": 1615770289,
        "id": "gqysd0l",
        "score": 2,
        "subreddit": "stocks",
        "created": 1615799089.0
    },
    {
        "author": "Soggy-Researcher-651",
        "body": "I bought IBM a month ago and I agree that it seems still undervalued.",
        "created_utc": 1615840390,
        "id": "gr1x3pi",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1615869190.0
    },
    {
        "author": "Total-Business5022",
        "body": "IBM is Jim Chanos’s favorite short right now.  Careful on this one.",
        "created_utc": 1615259243,
        "id": "gqadfgm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615288043.0
    },
    {
        "author": "Artmasterx",
        "body": "I am not sure what you mean by loss rate here.  The 2-qubit gate fidelity is the most relevant system parameter for systems today (it determines to a large degree the quantum circuit complexity that can be run), along with the number of qubits.  The Google Sycamore device has a 2-qubit gate fidelity of \\~0.994, and that was a device developed in 2019.  It is not clear if they have anything better at this point, as most of their recent publications rely on Sycamore.\n\nIonQ seems to claim to have a 32 qubit system that has a 2-qubit fidelity of 0.999, but they have not published data showing that.  I believe the 32 qubits.  My guess is that it is not quite that good yet on gate fidelity, otherwise they would have published.  Honeywell has shown data indicating their system is currently capable of 0.995-0.998.  I expect IonQ is similar at this point.\n\nYou can dismiss IBM, but they have a lot of excellent people working on hardware and algorithms.  I think they are probably behind Google at the moment on superconducting, but it would be wrong to dismiss them at this point.  \n\nBut honestly, what all these companies have right now is not really all that important in terms of what company may \"win\" the race.",
        "created_utc": 1615292384,
        "id": "gqbixrx",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1615321184.0
    },
    {
        "author": "noMSFTmyPPvryHRD",
        "body": "They literally don't exist lol. IBM has been claiming they have one for years. Only problem is, their \"quantum computer\" isn't a quantum computer and even their fake quantum computer can't be used for literally anything",
        "created_utc": 1615216985,
        "id": "gq7v4ol",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1615245785.0
    },
    {
        "author": "Vast_Cricket",
        "body": "***Do not invest in things you do not understand***. I do know someone worked at IBM on the quantum computer. Now in academia. Real still in research stage. Not ready for sometime.",
        "created_utc": 1615220982,
        "id": "gq84ag4",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1615249782.0
    },
    {
        "author": "Disposable_Canadian",
        "body": "But if a bunch of wall street hedge funds call each other up, and coordinate together to short the ever living fuck out of a company to try and drive it into bankruptcy so they can personally financially game from it, is not illigal? Because that's what fucking happened.\n\nMy reading a reddit page simply draws my attention to popular stocks, be it IBM, Ford, Tesla, or others.  I then do my own research and buy based on my risk tolerance, budget, and research.",
        "created_utc": 1615380863,
        "id": "gqfv9kz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615409663.0
    },
    {
        "author": "fuckthedebt",
        "body": "Agree.   It's messy but many tech names now look like value plays did 3 months ago. Economic growth is good for Ford but it's going to be good for QCOM as well and SWKS and those companies have monster margins. And that is not considering the still coming 5G cycle and Semi chips going into everything.  The shortage is good for semi companies margins where they have a production pipeline.   \n\nExample: SWKS earned 3.36 last quarter.  With semi shortage and seeing as they are the only company that produces their own chips, they are selling out at prices set by them.  If, if SKWS maintains that earnings momentum and pulls out 12-14$ in 2021, the stock is selling for 12-15 earnings.  That does not look bad with their growth numbers in a supercycle economic boom compared to Banks at 12x earnings  \n\nSWKS is just an example but you get the picture.  If value keeps outpacing Tech, we will be looking at value fully valued and tech, with still higher growth, undervalued. \n\nFirst quarter earnings report could bring suprises and, finally, good guidance.  If things get cheaper or even bottom here, that sets up for a major rally post earnings, sometime in April.  \n\nStrat your shopping list now and average in, that my couch potato advice. \n\ndisclosure: I am long SWKS, QCOM and IBM and Apple Calls in TEch.",
        "created_utc": 1615280578,
        "id": "gqb5y7x",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1615309378.0
    },
    {
        "author": "youvebeenjammed",
        "body": "IBM thing?",
        "created_utc": 1615414695,
        "id": "gqi1u71",
        "score": 1,
        "subreddit": "investing",
        "created": 1615443495.0
    },
    {
        "author": "PsilocybeApe",
        "body": "And all Twain had to do was buy and hodl DD, IBM and JPM but he didn’t have a crew of 💎🙌🏻 🦍",
        "created_utc": 1615398236,
        "id": "gqgy4ft",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1615427036.0
    },
    {
        "author": "eddyjqt5",
        "body": "You clearly don't keep up with PLTR. They partnered with IBM a while ago and IBM is pushing their products now.",
        "created_utc": 1615447764,
        "id": "gqjp815",
        "score": 1,
        "subreddit": "investing",
        "created": 1615476564.0
    },
    {
        "author": "UsefulReplacement",
        "body": "I like the main product (Dropbox), but I never paid for it and don't know anyone that has. It's missing the easy integration of iCloud / OneDrive / Google Drive with a broader ecosystem of apps and tools.\n\nI think they missed the time to be competitive and are probably going to get acquired by one of the old school large corps like Oracle / IBM within a decade.",
        "created_utc": 1615445584,
        "id": "gqjlvon",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615474384.0
    },
    {
        "author": "eddyjqt5",
        "body": "lmao why does it need to be a differentiator? IBM is doubling as a sales team for PLTR. Your sales team doesn't need to be a differentiator. At this point you're just rambling incoherent sentences to hold up your position. You say they don't have a competent sales team without any proof, then when I bring up that they in fact do, you shift goalposts. \n\n\nJust admit you're wrong you can still save yourself a lot of embarrassment.",
        "created_utc": 1615480175,
        "id": "gql60ri",
        "score": 1,
        "subreddit": "investing",
        "created": 1615508975.0
    },
    {
        "author": "teslas_love_pigeon",
        "body": "Patents don't mean shit bro. If patents mattered, IBM and GE would be the most valuable companies in the world",
        "created_utc": 1615491040,
        "id": "gqlv9z2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615519840.0
    },
    {
        "author": "Ytinerec",
        "body": "Been doing this since I started investing in 2006. Last few years, the dividends collected has been 20K in 2018, 25k in 2019, 31K in 2020 (a couple cuts like DIS and SLB), expecting this year to be around 35K+. Regrets? I have none. I think I've done decently well and this approach has gotten me thru 2 recessions now so I feel somewhat comfortable with it.\n\nI read some of the comments here and what I would caution people on is putting too much emphasis on classic high yield areas like utilities, REITs, or certain energy plays. These areas may look attractive from a current yield perspective but they typically come with drawbacks that are not immediately evident to newbie dividend investors. \n\n* Utilities for example carry very high debt loads and typically grow the dividend very slowly, and the debt can be a problem in certain scenarios.\n* REITs like utilities also don't grow their dividend at very high natural rates and like MLPs rely on access to capital markets to grow assets and payout since they don't retain much earnings. This can pose a risk in certain market conditions and affect long term dividend growth profile/risk\n* High yielding energy plays are almost always dividend traps due to the cyclicality of the industry, except pipelines and major integrated companies. But never say never, as even companies like Exxon and Chevron are struggling to cover the dividend these days organically\n\n\n\nIf you're young, I would highly suggest limiting exposure to the higher yielding but slower growing areas to a smaller portion of a dividend portfolio. There is definitely room in a portfolio for stuff like that, but the sweet spot for this approach is the 3-5% yielding stuff capable of sustainably growing the dividend at 6-7% annually, or the 1-2% yielding stuff capable of sustaining 10-15% annual dividend growth. \n\nHere's what my portfolio looks like (first 1-2 are core positions)\n\n* Telco/Utilities: AT&amp;T, H, RCI.B\n* Staples: KO, PM, MO, HSY\n* Healthcare: JNJ, AMGN, UNH\n* Industrials: CNR, MMM, GD\n* Energy: XOM, ENB, KMI, TRP, SLB\n* Discretionary: NKE, DIS\n* Tech: V, IBM\n* Financials: TD, BNS, USB",
        "created_utc": 1615468867,
        "id": "gqkira1",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1615497667.0
    },
    {
        "author": "Own-Revenue9302",
        "body": "Stay away. This company reminds me of IBM that has been stagnant for years. I think eventually they'll have to cut the div to pay down debt or some other issue. I know it is temping with that div but don't. You'll get screwed in the end. If you wat dividends a better option would be to just go with a dividend ETF instead. Lower yield but also safer and more consistent.",
        "created_utc": 1615420005,
        "id": "gqicllf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615448805.0
    },
    {
        "author": "CryptoNug",
        "body": "Blockchain data cryptography and security is already the next big thing as more corporations are moving their datas on blockchains- AWS, IBM, Microsoft, and more.",
        "created_utc": 1615400152,
        "id": "gqh3k57",
        "score": 1,
        "subreddit": "investing",
        "created": 1615428952.0
    },
    {
        "author": "north_canadian_ice",
        "body": "ORCL reminds me of IBM. Strong moat, low growth.",
        "created_utc": 1615481996,
        "id": "gqla776",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615510796.0
    },
    {
        "author": "TaterNeck",
        "body": "My long long game I’m looking at IBM for their high dividends and prominence in the quantum computing department.",
        "created_utc": 1615475137,
        "id": "gqkuvds",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615503937.0
    },
    {
        "author": "Inquisitor1",
        "body": "Americans don't just get a stimulus check, there's been a lot of talk about loan forgiveness.\n\nWhere I live about 10 years ago a lot of people who didn't need it took out student loans, and then bought apartments, because the interest was way lower than the regular real estate loan.\n\nSometimes if your interest is low enough or non existant it's actually cheaper to not pay it back if you have a good investment opportunity. What's IBM dividend, like 5%?",
        "created_utc": 1615736301,
        "id": "gqwld39",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615765101.0
    },
    {
        "author": "KunkEnterprises",
        "body": "Thanks for the response! I’m hoping to scoop some GOOG once I have the funds. Till then nvidia is my ai big boi. Eyeing up ibm as well",
        "created_utc": 1615738116,
        "id": "gqwor6j",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615766916.0
    },
    {
        "author": "swimmingwithambien",
        "body": "Okay, IBM and T.",
        "created_utc": 1615777151,
        "id": "gqz3xyp",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1615805951.0
    },
    {
        "author": "CognitivlessApe",
        "body": "One up on wallstreet - perer lynch is a good start.  He will tell you to sell.  Invest in companies that use tech, not tech companies themselves because something new and improved will come along shortly.  The companies that use tech will always grow and benefit off new tech.  The companies that make tech will only shine temporarily before the next new thing makes them obsolete- think IBM.  Good luck, your education is the best investment you can make, great call!",
        "created_utc": 1615743541,
        "id": "gqx1dfk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615772341.0
    },
    {
        "author": "longhorn00x",
        "body": "I don't think all Tech stocks are going to be as immune to this bump as you and others might be thinking. I'd worry more about the company's P/E ratio - as that yield reaches higher - the value of these high revenue/low profit stocks will take a bigger brunt - as the expected long-term value is diminished relative to dividend stocks who are not betting on huge growth. I see a lot of value coming up in tech when this drops off. I think semiconductor companies ($TI, $CREE, $On) might have some higher value coming up. I think keeping a steady portfolio of a combination of these tech stocks and blue-chip high-dividend stocks ($GE, $IBM) could be a decent combination to ride out the upcoming storm. Just be ready to have cash ready prior to that yield breaking 2. Good luck!",
        "created_utc": 1615813405,
        "id": "gr0av6a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615842205.0
    },
    {
        "author": "Rogerdeane",
        "body": "IBM",
        "created_utc": 1615787785,
        "id": "gqzingb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615816585.0
    },
    {
        "author": "streetkingz",
        "body": "Definitely not. They already did a partnership with IBM to leverage their sales team.  Like Karp said if your in PLTR and you have a short term mind set, your in the wrong place. The numbers will speak for themselves eventually.",
        "created_utc": 1615894805,
        "id": "gr41n2z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615923605.0
    },
    {
        "author": "Nooberling",
        "body": "IBM isn't going anywhere. I don't particularly like them either way, but when it comes to IBM the important letter is the \"B.\" IBM has spent most of a century building a culture and company that gives businesses what they want as reliably as possible. \n\nThat's going to be worth money for quite a while. The problem you have is you think of IBM as a technology company, when it really isn't one anymore.",
        "created_utc": 1615902346,
        "id": "gr4dx8n",
        "score": 1,
        "subreddit": "investing",
        "created": 1615931146.0
    },
    {
        "author": "Vast_Cricket",
        "body": "Around $20 after ipo,,,,  ibm was 67-70 thenapprox.",
        "created_utc": 1615906578,
        "id": "gr4mrib",
        "score": 1,
        "subreddit": "investing",
        "created": 1615935378.0
    },
    {
        "author": "pichicagoattorney",
        "body": "I need a stonk to short. Suggestions?   \n\n\nMaybe Zoom?   \n\n\nIBM?",
        "created_utc": 1615861350,
        "id": "gr2x2ok",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615890150.0
    },
    {
        "author": "Investing8675309",
        "body": "Side note - I bought a value index fund for high dividend/low volatility and gasped in horror when I saw IBM was the largest technology component. Most of the fund was utilities, tobacco, and telecom. I work in tech and it scares me to have Big Blue in my portfolio, however small. Rooting for them but not enough I want to own them.",
        "created_utc": 1615884905,
        "id": "gr3r9aq",
        "score": 1,
        "subreddit": "investing",
        "created": 1615913705.0
    },
    {
        "author": "Bxdwfl",
        "body": "if by tech, you mean INTC, IBM, etc., sure.",
        "created_utc": 1615833847,
        "id": "gr1ia1y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1615862647.0
    },
    {
        "author": "samjo_89",
        "body": "Weird as it may sound, IBM and I just got into AMD.  \n\nI'm pretty new at this, but I like these 2 companies.",
        "created_utc": 1615839971,
        "id": "gr1w63i",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615868771.0
    },
    {
        "author": "ptwonline",
        "body": "Tech stocks are mostly growth stocks, and growth stocks take a beating when bond yields rise since so much of their valuation is tied to future earnings growth (and those earnings have less value with higher rates).\n\nSo basically you'd need to find a tech stock in a value position.  There aren't many since everyone was so bullish on tech.  Closest thing you'll find to it are companies out-of-favor right now, like Intel and IBM.",
        "created_utc": 1615560339,
        "id": "gqp00gm",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1615589139.0
    },
    {
        "author": "apex1976",
        "body": "I fully agree. IBM was in a similar state 21 years ago.",
        "created_utc": 1615572061,
        "id": "gqppwi0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615600861.0
    },
    {
        "author": "upboat_allgoals",
        "body": "&gt;Craig-Hallum\n\nActually seems a legit research firm. The analyst:\n\nRichard Shannon joined the Equity Research Department at Craig-Hallum Capital Group LLC as a Senior Research Analyst in 2011 and covers stocks in the semiconductor sector. He was the #1 ranked semiconductor analyst in the Wall Street Journal’s Best on the Street survey for 2009 and 2010. Previously, he was a senior analyst at Northland Capital Markets and Piper Jaffray, an associate at UBS, and was an operating systems programmer at IBM for four years. Richard received his BS in Computer &amp; Electrical Engineering from Purdue University, an MBA from the Carlson School at the University of Minnesota and is a CFA charter holder.",
        "created_utc": 1615573960,
        "id": "gqpu59c",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1615602760.0
    },
    {
        "author": "SirrMeowsalot",
        "body": "Ohhh FB would be good too. IBM is a super solid lifer position",
        "created_utc": 1615615359,
        "id": "gqrwz7n",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615644159.0
    }
]