[
    {
        "author": "Minimum-Watercress-8",
        "body": "SEC v. Craig = a fucking idiot who literally tried to pose as investment firms (see facts of the case) by creating fake Twitter accounts WITH THOSE FIRMS' NAMES. This isn't just securities fraud, it's fraud on a whole different spectrum. If you were to tweet \"PLTR is going bankrupt in 30 days\" from meta-cognizant, just like the fucker in Craig did, you would be fine.\n\nSEC v. McKeown = fucking idiots who were literally compensated by the companies that they were pumping (manipulation based on incentives from the actual fucking fraudulent company should scream no-no to you) and dumping.\n\nNot even close to what we have here. Like could not be further, I cannot emphasize enough lol",
        "created_utc": 1611446565,
        "id": "gkgvg33",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1611475365.0
    },
    {
        "author": "heldforsale",
        "body": "Valid post. Also reading between the lines, most Bloomberg rumor articles include something along the lines of \"a deal could be announced as soon as this week\". The CCIV/Lucid article did not have that language. Indicates to me that the talks may be in an earlier stage. \n\nTo be clear, I am long CCIV. Just have to be cognizant of the ratio of upside to downside and weigh perceived probabilities.",
        "created_utc": 1610637626,
        "id": "gj8gn5q",
        "score": 25,
        "subreddit": "SPACs",
        "created": 1610666426.0
    },
    {
        "author": "wft227",
        "body": "Funds buying up what they can after hours causing price to drop. Probably trying to start a panic sale. Be cognizant and enjoy your tendies",
        "created_utc": 1611789268,
        "id": "gl0jp96",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1611818068.0
    },
    {
        "author": "Im_shorting_elon",
        "body": "I wouldn't say the market itself is in a bubble but certain sectors are. Big ones right off the bat are the Energy/EV sector (TSLA, ENPH, PLUG, NIO, etc.), the Genomics sector (EDIT, CRSPR, FATE, PACB), some tech/cloud (APPS, SE, FVRR), and some miscellaneous stocks (PENN!!!, RICK, CELH) etc. Genomics and EV specifically because they are supposedly the future. No doubt they are but that's what everyone was saying about the internet back in 1999, 2000, and it really took about 10 years for those stocks that crashed but survived to *really* get going (MSFT, ADBE, AMZN, PCLN, etc.), some haven't even recovered still, such as Cisco and MicroStrategy.\n\nDo keep in mind that the DOW has risen 12k+ points in just 10 months and some bubbles have already popped or on the decline (think NKLA or ZM).\n\nWhen you say \"everyone\", do you mean people on this subreddit or people in your daily life? I've noticed on these forums people are a bit more cognizant of what's going on, so they know that a lot of these valuations don't make sense but in the outside world, I know and have heard of plenty of people buying stocks on Robinhood because \"BuY tHe DiP!!\" is constantly blasted on social media and through word of mouth. For example, I know someone who bought US Foods on Robinhood for no particular reason. \n\nThese stocks go down once:\n\nA. Fed decides to increase interest rates\n\nB. Black Swan Event, which is possible given the state of affairs at this point in time.",
        "created_utc": 1610159133,
        "id": "gim3n1u",
        "score": 12,
        "subreddit": "stocks",
        "created": 1610187933.0
    },
    {
        "author": "WengersOut",
        "body": "I’m not sure you understand that many people have entered fully cognizant of and willing to lose their IE. The sentiment here seems to be that the IE is basically being treated as a ticket to the “fuck over at least one scumbag” show. And that’s a damn good show.",
        "created_utc": 1612045687,
        "id": "gleyymv",
        "score": 9,
        "subreddit": "stocks",
        "created": 1612074487.0
    },
    {
        "author": "5work",
        "body": "List of some AI Stocks taken from [here](https://www.reddit.com/r/RiskItForTheBiscuits/comments/klei46/time_to_get_loaded_on_ai_stocks_dod_is_investing/)\n\nAI\n\nAITX\n\nASGN\n\nBAH\n\nBTAI\n\nCEVA\n\nCRNA\n\nCRNC\n\nCTSH\n\nDOCU\n\nDUOT\n\nEGAN\n\nGOSY\n\nGTCH\n\nHHT\n\nHOLX\n\nIDCC\n\nIDEX\n\nJ\n\nKFRC\n\nKULR\n\nLPSN\n\nMARK\n\nMDLA\n\nMFON\n\nNUAN\n\nNVDA\n\nOMQS\n\nOTRK\n\nPING\n\nPLTR\n\nPOAI\n\nPRO\n\nQCOM\n\nQUBT\n\nRDNT\n\nREKR\n\nRNET\n\nSDVI\n\nSFE\n\nSMCI\n\nSPGI\n\nVERI\n\nWMGR\n\nXDSL",
        "created_utc": 1610588356,
        "id": "gj6jixm",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1610617156.0
    },
    {
        "author": "heyumigotaquestion",
        "body": "I haven't time for some of the other bits right now I'm sure others will cover, but know that paper trading doesn't take into account genuine volume often. So if you learn via paper trading, then make sure what you trade when you trade for realsies is high volume. Otherwise your perfect trade won't take place in reality since nobody wants it at that volume in that spread.\n\nEssentially, in reality nobody is buying one billion shares of that, so be cognizant that paper trading doesn't truly reflect reality in that regard.",
        "created_utc": 1610754496,
        "id": "gjedzg5",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1610783296.0
    },
    {
        "author": "A_Wild_R_Appeared",
        "body": "You fucks (reddit) cheered as the MSM slandered an entire political movement as \"alt-right\", even \"nazis\", for the past five years - solely to advance their own interests. \"Yaas  media, slay!\", you said, \"Theyll never do it to us!\", you said, \"We're on the same political team!\" But now... now that you're the ones on opposing fronts and being slandered, suddenly you're all so cognizant and contemptuous of media slander. Color me shocked. \n\n\"They came for the Republicans, but I was not a Republican, so I did not speak up\"",
        "created_utc": 1611836601,
        "id": "gl2urjt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611865401.0
    },
    {
        "author": "xXx_Bunga_xXx",
        "body": "Part 2:\n\n    MTOR\t0.879\n    PFGC\t0.121\n    PZN\t0.02\n    SC\t0.96\n    SLAB\t0.463\n    SMG\t0.201\n    SNDR\t0.06\n    SPOT\t0.1\n    TGI\t0.322\n    WNC\t0.959\n    ADTN\t1\n    AFG\t0.9\n    AFL\t0.96\n    ALGN\t0.342\n    ALGT\t0.899\n    ALL\t0.939\n    ANGI\t0.06\n    APPS\t0.537\n    ASH\t0.92\n    AVB\t0\n    AVNW\t0.141\n    AVTR\t0.779\n    AXTA\t1\n    BSMX\t0\n    CCMP\t0.98\n    CHNG\t0.98\n    CSGS\t0.181\n    CSII\t0.98\n    CTSH\t0.98\n    CTVA\t0.98\n    DGII\t1\n    EBAY\t1\n    ECHO\t0.98\n    ELF\t0.859\n    EMKR\t0.101\n    FORM\t0.96\n    GEOS\t0.041\n    GRUB\t0.92\n    HI\t0.899\n    HMN\t0.859\n    IAC\t0.08\n    INOV\t0.02\n    IVAC\t0.821\n    KE\t0.081\n    KLAC\t1\n    LCI\t0.161\n    LNC\t0.06\n    MAA\t0\n    MET\t0.98\n    MUSA\t0.92\n    MWA\t0.1\n    MXL\t0.482\n    NEU\t0.04\n    NTGR\t1\n    PAHC\t0.718\n    PYPL\t1\n    QCOM\t1\n    QNST\t0.92\n    QRVO\t0.98\n    RGLD\t0.06\n    RYN\t0.458\n    SIMO\t0.622\n    SITM\t0.96\n    TBI\t0.919\n    THG\t0.98\n    TSE\t0.101\n    TTMI\t0.96\n    UGI\t0.101\n    UHAL\t0.658\n    VVV\t0.88\n    YUMC\t0.9\n    VNE\t0.539\n    ABC\t0.941\n    AGCO\t0.98\n    ALXN\t1\n    AME\t1\n    APD\t0.1\n    ARW\t0.939\n    BAX\t1\n    BCE\t0.12\n    BDX\t0.96\n    BLL\t0.879\n    BMY\t1\n    BSIG\t0.338\n    BTU\t0.602\n    BV\t0.02\n    CI\t0.94\n    CLX\t0.859\n    CMI\t0.899\n    CMS\t0.417\n    COR\t0\n    DGX\t0.96\n    DSPG\t0.881\n    DX\t0.221\n    GLT\t0.08\n    GOOS\t0.86\n    GPI\t0.96\n    HIMX\t0\n    HSY\t0.96\n    ICE\t0.94\n    IEX\t1\n    IP\t0.96\n    IRMD\t1\n    JHG\t0.94\n    LANC\t0.081\n    LEA\t0.96\n    LQDT\t0.74\n    LSPD\t0\n    MDP\t0.241\n    MDU\t0.04\n    MMS\t0.92\n    MPW\t0\n    MRK\t1\n    MSGN\t0.1\n    NJR\t0.06\n    NS\t0.039\n    NYT\t0.94\n    OCSI\t0\n    OCSL\t0.159\n    ODFL\t0.879\n    ONEW\t0.478\n    PBH\t0.98\n    PENN\t0.98\n    PH\t1\n    PIPR\t0.88\n    PM\t0.86\n    PTEN\t0.322\n    RFP\t0.101\n    RGS\t0.04\n    RL\t0.622\n    SBH\t0.242\n    SNA\t0.98\n    SPH\t0.02\n    SR\t0.218\n    SXC\t0.121\n    TKR\t0.98\n    TPR\t0.98\n    TW\t0.201\n    ULBI\t0\n    VSTO\t0.94\n    WD\t0.919\n    WEC\t0.879\n    WLMS\t0.08\n    WMS\t0.04\n    XYL\t0.9\n    YTRA\t0.1\n    YUM\t0.9\n    AINV\t0.338\n    AOSL\t0.88\n    ARWR\t0.02\n    ATVI\t1\n    BILL\t0.98\n    BRBR\t0.121\n    CCS\t0.94\n    CDR\t0\n    COLM\t0.101\n    CPT\t0\n    CSL\t0.98\n    CTHR\t0\n    CURO\t0.94\n    DECK\t0.98\n    DHX\t0.362\n    DLX\t0.343\n    DXC\t0.98\n    ENVA\t0.859\n    ESS\t0\n    EVBN\t0.98\n    EXPO\t1\n    F\t0.899\n    FARM\t0.161\n    FFG\t0\n    FLT\t1\n    FTNT\t1\n    FTV\t1\n    GHL\t0.04\n    GILD\t0.94\n    GPRO\t0.523\n    GTIM\t0.08\n    HIG\t0.96\n    HUBG\t1\n    KLIC\t0.12\n    KN\t0.08\n    LBRT\t0.02\n    LGF.A\t0.96\n    LPLA\t0.98\n    MCHP\t0.98\n    MNR\t0.02\n    MOD\t0.201\n    MPWR\t0.401\n    MSI\t1\n    MTD\t0.98\n    MTX\t1\n    NBIX\t0.02\n    NEWR\t0.362\n    NFG\t0.379\n    NGVC\t0.04\n    NLOK\t1\n    NOV\t0.504\n    OFC\t0\n    OHI\t0\n    ONTO\t1\n    OTEX\t1\n    PCTY\t1\n    PFPT\t1\n    PFSI\t0.819\n    PINS\t0.98\n    PLT\t0.98\n    PMT\t0.84\n    POST\t0.081\n    PRO\t0.98\n    PRU\t0.8\n    PTON\t0.681\n    SKX\t0.96\n    SKYW\t0.241\n    SNAP\t0.94\n    SVM\t0.06\n    SYNA\t1\n    TDC\t1\n    THST\t0\n    TMUS\t0.92\n    TWST\t0.081\n    U\t1\n    UEPS\t0.04\n    ULH\t0.04\n    UNM\t0.04\n    USAT\t0.04\n    UTI\t0.04\n    VREX\t0.1\n    WERN\t0.899\n    WWE\t1\n    YRCW\t0.1\n    ZEN\t0.98\n    ABB\t0.02\n    BSAC\t0\n    CG\t0.84\n    RDS.A\t0.24\n    SOGO\t0.02\n    SOHU\t0\n    THR\t0.501\n    ADNT\t0.9\n    AMPH\t0.9\n    AON\t0.859\n    ARA\t0.06\n    ASRT\t0.281\n    ASX\t0\n    BBU\t0\n    BERY\t0.88\n    CAH\t0.959\n    CBOE\t0.98\n    CIVB\t1\n    CNTY\t0.04\n    CSWI\t0.221\n    CXRXF\t0.081\n    EAF\t0.839\n    EL\t0.96\n    FCCY\t0.98\n    FE\t0.539\n    GAU\t0.02\n    GNE\t0.12\n    GRC\t0\n    GVA\t0\n    HCAP\t0.26\n    HMC\t0.32\n    HRC\t1\n    ITW\t1\n    JOUT\t0.02\n    KKR\t0.9\n    LAZ\t1\n    MTNB\t0\n    NOG\t0.8\n    OCGN\t0.02\n    OFS\t0.02\n    OIIM\t0.02\n    OPY\t0.181\n    PAR\t0.222\n    PFSW\t0.523\n    REGN\t0.98\n    ROAD\t0\n    SCYX\t0.641\n    SDPI\t0.04\n    SPB\t0.221\n    THM\t0\n    TMP\t0.859\n    TT\t0.98\n    UTSI\t0\n    VIVO\t0.461\n    ZBH\t0.96\n    CRNX\t0.02\n    JCS\t0.04\n    KINS\t0.4\n    LIVX\t0\n    PSTI\t0.02\n    STLY\t0.02\n    UUUU\t0\n    VHC\t0.061\n    AU\t0\n    CBFV\t0.98\n    CDZI\t0\n    CTTC\t0\n    CZNC\t0.76\n    DIIBF\t0.101\n    DPSI\t0\n    ELUXY\t0.461\n    GNUS\t0\n    KMTUY\t0.2\n    NHYDY\t0.04\n    RICOY\t0\n    SNP\t0\n    SNY\t0\n    TCFC\t0.623\n    WRN\t0\n    XBIO\t0.14\n    YORW\t0.16",
        "created_utc": 1612124595,
        "id": "glikwui",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612153395.0
    },
    {
        "author": "DickBatman",
        "body": "&gt; (Today's data will be available tomorrow.)\n\nIt's fucking tomorrow right now /u/meta-cognizant.",
        "created_utc": 1610814339,
        "id": "gjh2hmx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1610843139.0
    },
    {
        "author": "hoodedcactus",
        "body": "If I think it’ll stay above, then I’ll hold until ~a week before. \n\nIf I think it’ll keep mooning, sometimes I’ll roll the short leg up. I hardly do this as most of my spreads started so deep otm it would be miraculous to keep going\n\nOr, if I don’t see it staying above, I’ll sell for partial profit early. \n\nIf you hold towards expiry, be cognizant of short interest / dividends and if your short leg is at risk of early assignment.",
        "created_utc": 1611262010,
        "id": "gk3o3fi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611290810.0
    },
    {
        "author": "H_Logan",
        "body": "This guy talking about *cognizant* lol.",
        "created_utc": 1611769669,
        "id": "gkz662i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611798469.0
    },
    {
        "author": "kriegkopf",
        "body": "We have the truth and the facts on our side, I hope it will prevail in the end. We just need to be cognizant of the fact that there is a lot of bad-faith actors operating on these forums right now and to ignore disinformation and deception. I'm just glad more and more people are becoming aware of the underhanded tactics MM's and the media is playing. This is spreading like wildfire so people will just become aware that media outlets like CNBC and Bloomberg exists to serve these hedge fund managers.",
        "created_utc": 1611796680,
        "id": "gl135xb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611825480.0
    },
    {
        "author": "One_Situation_2725",
        "body": "Probably but you need to be cognizant of the risk and not end up overleveraged in case things go tits up.",
        "created_utc": 1610400737,
        "id": "gixgulr",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1610429537.0
    },
    {
        "author": "jn_ku",
        "body": "No problem--I try.  I'll probably write a follow-up post to respond to as many broad questions as possible since I just can't get back to everyone.\n\nThat begin said, your question was a good one that I'm sure is on many peoples' minds, so I'm hoping it's seen by others who have the same question.\n\nI know that some people are, for various reasons, happy to see the whole thing burn down, but I am very cognizant that there are real world consequences for many people to all of this, and that watching this unfold can be very scary if you have no framework from which to understand events.",
        "created_utc": 1611802977,
        "id": "gl1hc48",
        "score": 2,
        "subreddit": "investing",
        "created": 1611831777.0
    },
    {
        "author": "Rotatos",
        "body": "Yep its ServiceNow, thanks for the reminder. I still cannot believe the market isn't cognizant of BB actually being what it is",
        "created_utc": 1610141726,
        "id": "gil4lnu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610170526.0
    },
    {
        "author": "In4matics",
        "body": "Cognizant &gt; Palantir",
        "created_utc": 1609757711,
        "id": "gi22mi3",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1609786511.0
    },
    {
        "author": "Sardisthemagian",
        "body": "Just wanted to emphasize the point you're making. I thought it was a good idea to sell puts on GME around 30 pre squeeze, but of course i would have made far more just buying more of the stock. This whole episode is making me more cognizant of the risk of capping upside just to get a discount on a stock you like. You leave yourself completely unexposed to positive black swans.",
        "created_utc": 1612114094,
        "id": "glhxvnh",
        "score": 1,
        "subreddit": "options",
        "created": 1612142894.0
    },
    {
        "author": "Burninglightstorm",
        "body": "I would like a world like that too, and I know how hard it is to lose a significant chunk of of money, but things are going to change soon because they have to.  Shorting is the next thing to go, but there are always going to be a certain number of ruthless blood suckers in any sector. You have to be careful and do the research. Seasoned investors know that biopharma is very, very risky, so if they decide to invest in them, they are taking a long shot which could pay in a big way, but if they lose they won't lose too much because they were fully cognizant of that too. That's what I did knowing full well that it could go bust, but I like to scatter 1 or 2 longshots in my portfolio. My other longshot was Cannabix. It seems to be picking up now. Really, I'm sorry to hear about anyone losing, but in the end it's all a learning experience isn't it.",
        "created_utc": 1611952722,
        "id": "glacagp",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1611981522.0
    },
    {
        "author": "memesupreme0",
        "body": "Because Billionaire Propaganda has convinced a large swathe of voters that \"regulation bad\" so those worker protections, ie regulations, have been steadily eroded over the decades to what we have now.\n\nNot all regulation is good, but not all de-regulation is good either, we have to find a sweet spot and be cognizant that we're only 350m ish people on a rock with 8b+ other people, some antagonistic, some sympathetic.\n\nThat requires an education that is being constantly fought against by those billionares that need voters to think they're doing the right thing by siding with the aristocrats instead of their neighbors.",
        "created_utc": 1611850814,
        "id": "gl3yrz0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1611879614.0
    },
    {
        "author": "agamenc",
        "body": "No, but I’d check to make sure none of the ETFs you’re in have TSLA (or at least be cognizant of how much TSLA you have).\n\nAlso be aware that it’s value is very much inflated beyond earnings, so massive growth is already priced in and bad news could tank it. If you’re prepared to take those risks I think it’s fine.",
        "created_utc": 1611853883,
        "id": "gl48z6w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1611882683.0
    },
    {
        "author": "uwuglock19",
        "body": "I'm a filmmaker, I'm long AMC because I know that theaters are going to open back up again. Simply enough. Look at my post history. Just because you can't comprehend a companies valuation beyond an article you've read on the news doesn't mean that others can't or don't see or feel something different. And who are you to decide what a companies valuation is? Are you an economist? Or is it just your opinion that AMC isn't worth $15? \n\n I don't care about the ethics of the market, the market doesn't care about ethics to begin with. So telling investors they should be cognizant of shit outside of their own TA and DD is pretty elitist. There are short hedges BETTING to put people out of jobs, leaving THEM to hold the bag. \n\nWhat you're seeing is new money supporting brands that they like, because they like them. And maybe you should take some time to understand that instead of looking down upon them as if *your* perspectives as a trader are somehow more righteous. In the end, the ones holding the bag will be the ones who entered into shit positions. \n\nThat's how it is with EVERY trade. That's how options work. When you buy a call, that's someone else' put. So by your logic, you shouldn't even be trading to be honest.",
        "created_utc": 1611782779,
        "id": "gl03gkp",
        "score": 1,
        "subreddit": "options",
        "created": 1611811579.0
    },
    {
        "author": "LifeHasLeft",
        "body": "Yeah I was cognizant of this meme stock as a WSB lurker for a while but I have basically $0 of expendable income, and I have kids to feed...sucks but I can’t afford to YOLO on a meme stock right now",
        "created_utc": 1611766596,
        "id": "gkywqps",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611795396.0
    },
    {
        "author": "TrumansOneHandMan",
        "body": "what do you mean? I'm insanely lucky. on the one hand, I have to live with my parents, but on the other, I *get* to live with my parents. I don't pay rent and I don't have to worry about my next meal. as miserable as I am, I'm still cognizant of that.\n\nmy worst nightmare is someone who is having trouble making rent reading my comment and deciding then and there to take a risk he can't afford and then this goes tits up, he gets a surprise bill, and then he's on the street, or he gets fired because his car won't get him to work anymore. me and him take the same loss, I'm just one paycheck behind where I could have been. it's not the same. like I said--this goes tits up, my life sucks cock just as much as it did yesterday. that isn't true for everyone.",
        "created_utc": 1611977258,
        "id": "glbv3tg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612006058.0
    },
    {
        "author": "key_kid_1",
        "body": "trading marijuana is illegal. it isn't illegal like shutting down a stock trading platform at crucial crowd sourcing moments, though. it is illegal like convincing a bunch of voters to move to a place and influence the laws. not like shutting down a trading platform. go long. buy for the long term.\n\nI am a self-cognizant robot",
        "created_utc": 1611976121,
        "id": "glbstcj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612004921.0
    },
    {
        "author": "formallyhuman",
        "body": "I agree. I haven't been subbed long but I came into this being fully cognizant that I could very easily lose anything I put into any stock. So, I've only put in money I have, and which I am comfortable losing. And certainly nothing on margin.\n\nI've seen more than one person say they've made huge gains on a small investment but are holding for no other reason than they think, based on the hype, that it'll go higher. I just wish people would pull enough out to cover their initial investment and, sure, then let the rest ride if you want.",
        "created_utc": 1612130491,
        "id": "glixmft",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612159291.0
    },
    {
        "author": "uwuglock19",
        "body": "It does but that’s why you hedge &amp; think a bit more asymmetric. A crash, short squeeze, “WSB hype”; any market activity can be capitalized if you’re cognizant of indicators. \n\nA lot of us new money just have different risk tolerance than old money. It’s 2021 &amp; people are going to miss the bus if they don’t step up.",
        "created_utc": 1611780090,
        "id": "gkzwgkt",
        "score": 1,
        "subreddit": "options",
        "created": 1611808890.0
    },
    {
        "author": "KennanFan",
        "body": "Why would they sell at a loss instead of just warehousing it?  Referring to this as  a \"strategic initiative\" immediately after stating they sold this inventory at a $2.9 million to $3.2 million loss seems like a strategy to take off the sting.\n\nThey also said the average price is now reduced by 50%.  All that means is that the cost of producing what they sold at a loss was way too high.  It's great they they've achieved greater efficiency with regards to their newer inventory; let's just be cognizant about what came before.\n\nI'm long Valens.  This is a great company that is operating in a flawed environment (e.g. poor cannabis 2.0 rollout overall, vaping scare.)",
        "created_utc": 1611098350,
        "id": "gjvvvox",
        "score": 0,
        "subreddit": "weedstocks",
        "created": 1611127150.0
    },
    {
        "author": "caringpineapple",
        "body": "Should be cognizant of the risks of investing in any US listed Chinese company. Found the SEC does a nice job laying it out. \n\nhttps://www.sec.gov/corpfin/disclosure-considerations-china-based-issuers",
        "created_utc": 1611097722,
        "id": "gjvumpw",
        "score": 0,
        "subreddit": "SecurityAnalysis",
        "created": 1611126522.0
    },
    {
        "author": "A_Wild_R_Appeared",
        "body": "You fucks (reddit) cheered as the MSM slandered an entire political movement as \"alt-right\", even \"nazis\", for the past five years - solely to advance their own interests. \"Yaas  media, slay!\", you said, \"Theyll never do it to us!\", you said, \"We're on the same political team!\" But now... now that you're the ones on opposing fronts and being slandered, suddenly you're all so cognizant and contemptuous of media slander. Color me shocked. \n\n\"They came for the Republicans, but I was not a Republican, so I did not speak up\"",
        "created_utc": 1611836587,
        "id": "gl2uqsb",
        "score": -54,
        "subreddit": "wallstreetbets",
        "created": 1611865387.0
    },
    {
        "author": "HashbrownMD",
        "body": "IBM is a boomer stock that will slowly die",
        "created_utc": 1610033216,
        "id": "gifky2d",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1610062016.0
    },
    {
        "author": "h4ppidais",
        "body": "How is palantir’s machine learning different (or better) than other companies like IBM, MS, or Google? Is it just that we see more growth with Palantir than any of those mega companies that the stock will grow? I understand this company is doing well currently, but I don’t see how this is a unicorn company because a lot of other companies already have machine learning.",
        "created_utc": 1609900530,
        "id": "gi9bz6e",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609929330.0
    },
    {
        "author": "ImmediateTravel66",
        "body": "If you invested $1000 in IBM stock in 1999 it would now be worth $1000.\n\nBoomer science.",
        "created_utc": 1609949608,
        "id": "gibcy1z",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1609978408.0
    },
    {
        "author": "ax3l",
        "body": "PLTR holders, if you have questions about the industry, feel free to ask. Been working data warehousing/analytics for 10+ years. Have worked with most Fortune 500 companies directly or indirectly through IBM.",
        "created_utc": 1609530121,
        "id": "ghr2oao",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1609558921.0
    },
    {
        "author": "Universal-Omnicide",
        "body": "Breaking News: Goldman'sSachs must invest list for 2021\n\nGE \n\nAT&amp;T\n\nBAYER\n\nIBM \n\nHewlett Packard",
        "created_utc": 1609789494,
        "id": "gi3lmu6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1609818294.0
    },
    {
        "author": "redderper",
        "body": "Contracts worth a couple of million here and there while market cap is already over 40 billion (used to be over 50B even). It's just not enough, look at the numbers that competitors like Splunk, IBM, Elasticsearch etc. are pulling in and compare their market cap to Palantir",
        "created_utc": 1609620505,
        "id": "ghv0mxp",
        "score": 5,
        "subreddit": "stocks",
        "created": 1609649305.0
    },
    {
        "author": "the_Rei",
        "body": "He just got appointed to be Vice Chairman of IBM - some people think he wont be focused on his SPAC for a while. But you could make the case that he just opened a whole new world of potential contacts within tech.",
        "created_utc": 1610023678,
        "id": "gif4icy",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1610052478.0
    },
    {
        "author": "SPAC-ey-McSpacface",
        "body": "I'd say \"most\" SPACs.  Warrant prices are just silly.  Over the last 3 trading sessions I've been liquidating almost all of my warrants &amp; putting the money back into commons of the underlying.\n\nOne odd exception is CRHC Units, which are actually cheaper than Commons + Warrants.  I have a lot of CRHC Units, but I'm tempted to add even more for three reasons.\n\n1. I like the team / SPAC\n2. I like the fact Cohn just signed on with IBM today.  I didnt see anyone mention this as a CRHC readthrough &amp; the SPAC wasnt up much today, but I cant imagine Cohn takes that job unless they already have a target.\n3. Them seem, IMO, cheap all things being equal",
        "created_utc": 1609899387,
        "id": "gi99n01",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1609928187.0
    },
    {
        "author": "jackcrj",
        "body": "What’s interesting is I think ibm is making some very smart moves now: cloud..sure, blockchain..yes so many practical uses, ai..this will eventually be a tsunami, quantum computer..holy$h*t this will bring tremendous change to computing and security of computing.\n\nTldr ibm and today surely is not a 100 bagger but they are poised to continue delivering",
        "created_utc": 1610086732,
        "id": "giilage",
        "score": 4,
        "subreddit": "investing",
        "created": 1610115532.0
    },
    {
        "author": "Jclevs11",
        "body": "I find it incredibly disconcerting (I have CNBC on all day at work in my office) when I watch Morgan Stanley say TSLA's new PT is $810, the very next day it goes above that and beyond. That is fucking scary. I had a great opportunity to buy TSLA when i bought a ton when the pandemic hit, but i couldnt do it. I cant trust the company, and it sounds like many people are in that same boat. \n\nIt's been pump and dump for a couple years now. Its gonna dump soon. You cannot say with a straight face that TSLA is more valuable than American Express, Boeing, Goldman Sachs, Caterpillar, Ford, GM, IBM and Dow Chemicals COMBINED. That is just fucking ridiculous. And now its market cap is greater than the top automotive makers in the world COMBINED. that doesnt make any fucking sense no matter what moon or planet youre on.",
        "created_utc": 1610060863,
        "id": "giha34w",
        "score": 4,
        "subreddit": "stocks",
        "created": 1610089663.0
    },
    {
        "author": "SPAC-ey-McSpacface",
        "body": "I'm just going to lay down a speculative prediction marker here that I think CRHC is going to announce a target soon.\n\nCommons hit an all-time high yesterday &amp; units are hitting an all-time high today on unusually high volume, and this comes after Cohn just got hired by IBM, and I find it difficult to believe he'd take a new job unless his &gt; $800M SPAC had a target.  Putting 2+2 together, I'm thinking they're close.",
        "created_utc": 1610123768,
        "id": "gijzyjp",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1610152568.0
    },
    {
        "author": "new-chris",
        "body": "IBM is a perpetual turnaround story",
        "created_utc": 1610071844,
        "id": "gihvmnz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1610100644.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "First home computer was an Apple IIGS. Second home computer was a badass Black IBM Aptiva. Learned how to code on that thing. \n\nThrough corporate shit I’ve had to deal with both. No biggie. \n\nBut I’ve been caught in the infinite feud between MSFT &amp; AAPL my whole fucking life.  \n\nHave AirPods on a Windows machine? \nMaybe we’ll work today. Maybe tomorrow. Fuck your ears. \n\nOh. You plugged in an iPhone to charge. \n7 hours for 100%\n\nMacBook: 10 Minutes to 100%\n\n\n**I’m going to die bitter as fuck.**",
        "created_utc": 1609816028,
        "id": "gi5391o",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1609844828.0
    },
    {
        "author": "BombTracks82",
        "body": "I imagine $PLTR sees itself as the future in big data just for having a narrower focus than ibm ms and Google. Because of that narrower focus that is probably already using one of those 3 platforms they get to create more efficient methods for collecting sorting and dispensing said data cuz that shit can get messy really fast",
        "created_utc": 1609902578,
        "id": "gi9g5dr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1609931378.0
    },
    {
        "author": "cokegum",
        "body": "Cramer told his boomer followers to buy IBM on yesterdays show lol",
        "created_utc": 1609949346,
        "id": "gibcdv6",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1609978146.0
    },
    {
        "author": "07Ghost",
        "body": "And? If you invested in Coca-Cola, McDonald, Walmart, or even IBM in 1950 and held all the way through, you would've 100-500x your money. If you invested in Washington Mutual or in Lehman Brother, you would've lost all your money.\n\nThere are many good investments and many bad investments. I don't see a point of this post.",
        "created_utc": 1610098888,
        "id": "giiyxzt",
        "score": 2,
        "subreddit": "investing",
        "created": 1610127688.0
    },
    {
        "author": "Catheter_Trader",
        "body": "When is IBM gonna start rolling out news on the quantum computers and entangled processor chips?",
        "created_utc": 1609530223,
        "id": "ghr2xit",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1609559023.0
    },
    {
        "author": "AXdssd5as",
        "body": "But if Bitcoin is being bought by investors as a store of value, i.e. how it is marketed as \"digital gold\", isn't this a bit dangerous since unlike gold, it can have identical competitors, and just because it is on-top now doesn't mean it always will be?\n\nGold has been a store of value because of its relatively finite quantity at any given time, but also because of several other qualities that are hard to replicate in other materials (it doesn't rust or corrode or tarnish, it is soft enough to be shaped easily, it is rare but not too rare etc).\n\nUnlike gold, Bitcoin is replicable, either identically or near-identically, which means that it could become more like a stock in the future, and if that's the case, the fact that it is on-top now doesn't necessarily mean this will continue? Companies that have seemed unassailable (AT&amp;T, IBM, Kodak) have fallen, meanwhile gold has been around for however many thousands of years and still hasn't been dethroned (except maybe eventually by Bitcoin!)",
        "created_utc": 1609784124,
        "id": "gi3a52l",
        "score": 2,
        "subreddit": "investing",
        "created": 1609812924.0
    },
    {
        "author": "AlbanySteamedHams",
        "body": "1. Wasn't IBM the gorilla in the room back in the day? Clearly, they are still around, so I can't say that they \"didn't make it\". But still...\n2. Here's an example of a third party platform working on expanding autonomous control across multiple lines of cars (not FSD, but hopefully they provide a sense that somebody can work on these problems in this way): [https://comma.ai/](https://comma.ai/). Again, they aren't doing it with \"no data\", but they are working on it.",
        "created_utc": 1609878751,
        "id": "gi7x98d",
        "score": 2,
        "subreddit": "investing",
        "created": 1609907551.0
    },
    {
        "author": "wilstreak",
        "body": "This is embarassing.\n\nImagine if Tesla has to announce every 500 car they just sold or IBM announce every contracy they make.",
        "created_utc": 1609953997,
        "id": "gibmqm8",
        "score": 2,
        "subreddit": "stocks",
        "created": 1609982797.0
    },
    {
        "author": "PinkManApple",
        "body": "Long term for real! I also got PLTR, IBM, and XOM. Wanted to do short term deals and make quick cash but I thought the risk would be too high",
        "created_utc": 1610102407,
        "id": "gij2f99",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610131207.0
    },
    {
        "author": "IAmABlubFish",
        "body": "The biggest problem with IBM is their size and therefore their inertia. It is most likely too damn hard to turn this ship.\n\nBut I would love to see it happen",
        "created_utc": 1610033287,
        "id": "gifl3c4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610062087.0
    },
    {
        "author": "jumpmasterj",
        "body": "Allow me to educate you a little bit. First off, Tesla technically wasn’t the first mover in the EV space as it wasn’t the first to bring EV into production—GM was the first to market in 1996 with the “EV1”. Just as FB and Google weren’t the first or second in their markets. So, maybe tell that to MySpace, IBM, NetScape, Siebel Systems, Yahoo, Aol, etc etc.",
        "created_utc": 1609899960,
        "id": "gi9asl6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1609928760.0
    },
    {
        "author": "ax3l",
        "body": "Not my field of expertise unfortunately. Also no longer at IBM.",
        "created_utc": 1609530618,
        "id": "ghr3yyd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1609559418.0
    },
    {
        "author": "Ocasio_Cortez_2024",
        "body": "I could look at 90 DTE.  I'm selling CCs on IBM which also has a good dividend so this makes it easier to hold through those dates.",
        "created_utc": 1609993057,
        "id": "gie1kmv",
        "score": 2,
        "subreddit": "options",
        "created": 1610021857.0
    },
    {
        "author": "srf5067",
        "body": "IBM is not even a boomer stock its a  Greatest generation stock like Coca Cola",
        "created_utc": 1610038283,
        "id": "gifvvck",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610067083.0
    },
    {
        "author": "EnchantedBean",
        "body": "Place DMGGF on your watch list, they have recently formed a partnership with MARA. They are also affiliated with MOGO and IBM. \n\n&amp;nbsp;\n\nhttps://dmgblockchain.com/",
        "created_utc": 1610123860,
        "id": "gik05qt",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1610152660.0
    },
    {
        "author": "skinniks",
        "body": "I think I can give you a run for your money.  Sold my TSLA, AMZN, IBM, MSFT in very early 2019 to average down my weedstocks portfolio.",
        "created_utc": 1610036517,
        "id": "gifrxnu",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1610065317.0
    },
    {
        "author": "morten_tor",
        "body": "So was IBM",
        "created_utc": 1610039181,
        "id": "gifxw0o",
        "score": 1,
        "subreddit": "investing",
        "created": 1610067981.0
    },
    {
        "author": "EsbeeTheGhost",
        "body": "Cohn just appointed to IBM board. How do you think that will effect this Spac? Will it be a draw, or will it not get his full attention to making a deal?",
        "created_utc": 1610024749,
        "id": "gif5zie",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1610053549.0
    },
    {
        "author": "nafizzaki",
        "body": "I know that and in all those years he made money on that TSLA bet.\nRegardless, it’s not about the TSLA bet. IBM is CURRENTLY doing accounting hijinks and had done it for the past 5 years.\nI wouldn’t put a single cent on a company that is trying to trick shareholders like that.\nOf course, your opinion would differ.",
        "created_utc": 1610040655,
        "id": "gig18b6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610069455.0
    },
    {
        "author": "boom1chaching",
        "body": "I mean... wasn't IBM a household name, then just about disappeared and very recently it's coming back into the spotlight as actual competition.\n\nAnecdotally, it seems to me that IBM is more popular now than it was a decade ago and seems like actual competition towards other tech companies.",
        "created_utc": 1609517450,
        "id": "ghq584m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609546250.0
    },
    {
        "author": "Catheter_Trader",
        "body": "IBM will be a meme stonk...\n\nhttps://www.ibm.com/quantum-computing/learn/what-is-quantum-computing",
        "created_utc": 1609599600,
        "id": "ghtx1qa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609628400.0
    },
    {
        "author": "Phreeker27",
        "body": "I enjoy holding ibm and with the spin off you should get a portion of their cloud company and maintain the OG ibm ticker. Ibm is currently 4% of my portfolio I will keep buying but not more than 5% overall I think it’s worth the bet, worst case I get a decent dividend",
        "created_utc": 1609805865,
        "id": "gi4jgcx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609834665.0
    },
    {
        "author": "PoppaPickle",
        "body": "I had 20k in savings so I built a portfolio based on growth and also high dividends about 7 months ago.\nI have shares in TSM, MSFT, IBM, AVB, and LUMN.\n\nMy TSM position is up 125% and my MSFT is up 11%... the rest are up, but mostly float on average around 5%.\n\nLooking back I am happy I diversified, but I obviously could have been up much more if I went all in on TSM.\n\nFor reference I'm up 4k on that 20k from diversifying rather than being up 25k if I put it all in TSM.\n\nBut the caveat to this is you have to land in the right stock. I had a 1/5 chance according to my portfolio for this strategy to work.",
        "created_utc": 1609810245,
        "id": "gi4rxny",
        "score": 1,
        "subreddit": "investing",
        "created": 1609839045.0
    },
    {
        "author": "galaxy1011",
        "body": "Who gives a shit about IBM",
        "created_utc": 1609856118,
        "id": "gi6in72",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609884918.0
    },
    {
        "author": "WesternMinimum6407",
        "body": "IBM sleeper",
        "created_utc": 1609937148,
        "id": "giaqlfq",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1609965948.0
    },
    {
        "author": "Turbulent_Bit8683",
        "body": "Guys check the filings he joined RH quite late and because of his name got top billing while he has his fingers in many pies VC of IBM isn’t small time commitment - I think CRHC will be as successful with or without him his name will help but not sure if he will be active - he might also get some insight in tech that IBM bets on so that’s an advantage but this will go sideways for next one quarter for sure if not two. Caveat being if they are already in advanced discussion stage!",
        "created_utc": 1609872767,
        "id": "gi7hmik",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1609901567.0
    },
    {
        "author": "Paintball26",
        "body": "You're correct. But it seems like it's just an advisory role, so its not that large of a time commitment.\n\nThough taking on an executive position, Mr Cohn will not be full time or have a formal management role. Instead, IBM said he would work “in partnership” with its leadership group “on a wide range of business initiatives and external engagements, including “business development, client services, public advocacy and client relationship management”.\n\n\nhttps://www.ft.com/content/1fde835b-8eda-41df-b29c-b80f3da79e7d",
        "created_utc": 1609949963,
        "id": "gibdpus",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1609978763.0
    },
    {
        "author": "HypeTraintodaShip",
        "body": "Now that Gary Cohn is employed at IBM, it’s a no brainer to reallocate any money waiting on a LOI/DA from CRHC, right? Obviously his attention is no longer on CRHC and it brings a myriad of conflicts of interests for any potential target if they do business with IBM.",
        "created_utc": 1609946412,
        "id": "gib6a1j",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1609975212.0
    },
    {
        "author": "kingkyle13",
        "body": "What’s the play on GILD and IBM? “Deep value” / Dividend?",
        "created_utc": 1609717351,
        "id": "gi0d8yr",
        "score": 1,
        "subreddit": "InvestmentClub",
        "created": 1609746151.0
    },
    {
        "author": "Constant-Noodler",
        "body": "I have a certificate with 3 IBM shares bought in 1981. How do I get them cashed and account for all the splits that have occurred since that time?",
        "created_utc": 1609734168,
        "id": "gi1abaj",
        "score": 1,
        "subreddit": "investing",
        "created": 1609762968.0
    },
    {
        "author": "facsnahm1",
        "body": "I'm doing my masters in Information Management and I genuinely do not see any difference on what Palantir offers compared to Microsoft, IBM or SAP (and fuck SAP!). Maybe I am a dumb dumb but I cannot wrap my mind on its valuation. Only thing that comes to mind is that it is being way overhyped by people not knowledgeable in Information management, i.e. a lot of data analysts.",
        "created_utc": 1609679210,
        "id": "ghy3n65",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609708010.0
    },
    {
        "author": "Raleigh_Noles",
        "body": "I have to disagree. While a lot of us are doing good work researching and investing in fields and technology we use and buy, and getting in earlier into the future Boeing’s, Mastercards, IBM, Ford etc.\nYou have millions or hundreds of thousands of pump and dumpers on WSB or YouTube pump and dumping vag cream companies. That’s the domino or canary that makes this scary. And will ultimately doom a lot of this market.\nThe kid who has a $5k Robinhood account, gains a huge following pushing penny stocks, only to crash and burn. You get enough of those kind of stories and retail will coward away. Creating a new generation who is fearful of investing.... Chris Saca is a prime example of how history will repeat itself.\n\nBloomberg, Marketwatch, Fortune parading around newly minted millionaires always terrifies me, because that usually signals things getting out of hand...... Beenie babies, Pokémon cards, tulips, Bitcoin.",
        "created_utc": 1609687813,
        "id": "ghykiah",
        "score": 1,
        "subreddit": "investing",
        "created": 1609716613.0
    },
    {
        "author": "Somethingdifferent39",
        "body": "I average up all the time. I started buying SQ at $98 and stopped around $160. I would still buy more at $218 but its already taken over a large portion of my portfolio so I wont for diversity reasons.\n\nTo your question, you will likely find that you will be mpre successful averaging up than down, as counter intuitive as it may seem. You could have averaged up on AMZN, AAPL, and MSFT at any point in the past decade and be very happy with the result.\n\nLikewise you could have averaged down on XOM, IBM, and GE over the last 10 years and been very dissapointed. More often than not the long term trend is justified. Your job as an investor is to figure out where the company is headed next.",
        "created_utc": 1609768676,
        "id": "gi2fsic",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609797476.0
    },
    {
        "author": "jinnyjuice",
        "body": "For 2021 eh? Hmm I can see the logic behind some of them\n\nWhy Amazon, IBM, and Nokia?",
        "created_utc": 1609738747,
        "id": "gi1hqan",
        "score": 1,
        "subreddit": "InvestmentClub",
        "created": 1609767547.0
    },
    {
        "author": "The-Crazed-Crusader",
        "body": "Thanks for article. And from other things I found it seems that IBM failed to compete because they were too competitive. Not only the buybacks, but there were expensive ventures by buying up large cloud companies that made no money of consequence. They actually started losing when they missed the PC train. And recently, yes they've been spending fortunes on competitive business practices while only spending enough on science to keep their products relevant... While the other guy was following the Edison model of the business of science (money obtained from the last patent funds the next invention).\n\nWho is to blame? IDK, I ain't an insider.",
        "created_utc": 1609523715,
        "id": "ghqla7i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609552515.0
    },
    {
        "author": "kismatwalla",
        "body": "Big Gov, FDA, Public Health and Big Pharma is the market right now.  People also talking about supply chain optimization.  How the product achieves this is a bit mysterious.  Also not clear if selling it requires an army of consultants.  Perhaps they will need to get Accenture/IBM/Deloitte on board to push this through for wider variety if use cases. And yes some certification programs are needed as well.  Palantir certified Data Scientist in Udacity",
        "created_utc": 1609527828,
        "id": "ghqwea8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609556628.0
    },
    {
        "author": "oldprecision",
        "body": "She actually had an engineering degree but eventually ended up in the sales/consulting side at IBM.",
        "created_utc": 1609518443,
        "id": "ghq7o2h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609547243.0
    },
    {
        "author": "diorgasm",
        "body": "IBM for the vaccine digital passport",
        "created_utc": 1609592967,
        "id": "ghto362",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609621767.0
    },
    {
        "author": "_FUCK_THE_GIANTS_",
        "body": "IBM is the definition of a boomer stock",
        "created_utc": 1609599883,
        "id": "ghtxhx7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609628683.0
    },
    {
        "author": "bill_ding_jr",
        "body": "Isn’t fb, ibm, and all the other techs making their own already?  Aren’t there new ones daily?  Why do you need a brand name for something tied to usd value?",
        "created_utc": 1609818298,
        "id": "gi57g9g",
        "score": 1,
        "subreddit": "investing",
        "created": 1609847098.0
    },
    {
        "author": "steve_pops_001",
        "body": "Long term yes I think Redhat has been a very good acquisition and IBM cloud has decent enough growth \n\nOnce company splits it will become attractive to pick the cloud division",
        "created_utc": 1610071600,
        "id": "gihv5v0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610100400.0
    },
    {
        "author": "Raleigh_Noles",
        "body": "I understand the argument, rampant speculation and experts gleaming to tell everyone how it was different lead to one day a bubble popping...\n\nBut 2000’s era Amazon is the wrong argument to make, Nortel, Yahoo, Cisco those were speculative and the paradigm shift, Amazon was just a book seller that was along for the ride and got knee capped. \n\nGenerally I think Tesla will be this decades Oracle, IBM, Cisco, Mcafee.... all had radical CEOs who were seen as the future and raised tons of money, but ultimately will get lapped by the 2nd wave who takes it past the finish line.... Apple, Amazon, Visa companies that I consider the 2nd wave of tech.",
        "created_utc": 1610077841,
        "id": "gii6ysf",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1610106641.0
    },
    {
        "author": "AmmoOrAdminExploit",
        "body": "just realized you had fantastic gains on CRWD and IBM too good job lol I’m thinking of buying far out calls on airlines/ cruise hoping there’ll be a boom in leisure and travel once the pandemic ends",
        "created_utc": 1610080828,
        "id": "giic9jj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610109628.0
    },
    {
        "author": "AdTall3883",
        "body": "I listened to their last earnings call before taking the dive. The current top brass is smart and knows what needs to be done. I agree there’s a lot of fat that needs to be cut, but Arvind reminds me a lot of Lisa. Bringing in Gary Cohn is also pretty key. I think post split IBM pulls in a 300b market cap in 2 years.",
        "created_utc": 1610034201,
        "id": "gifmyt6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610063001.0
    },
    {
        "author": "orangelord234",
        "body": "why ibm?",
        "created_utc": 1610038240,
        "id": "gifvrwg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1610067040.0
    },
    {
        "author": "redderper",
        "body": "I'm working with low code software myself as a developer. It's a small world. I learned recently when I bought an ETF that has Appian how much it gained and I'm quite surprised because I haven't heard of anyone or any company that uses it.\n\nMost popular players in the low code fields are IBM, Salesforce, Pegasystems and more recently I see Mendix, Microsoft and Bettyblocks gaining some traction. Don't know a lot about Appian yet, but I'm going to look into it",
        "created_utc": 1609798429,
        "id": "gi44nk3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609827229.0
    },
    {
        "author": "k1ngkev1n1",
        "body": "Hello, \n\nJust wanted to get some advice here I have some ideas, but thought I’d reach out. So my mother is transferring her 401k from her previous employer and I will manage it for her. I wanted to get some thoughts on asset allocation. \n\nHer scenario is she doesn’t need this money within the next 10 years at least. She is still working self employed. She is 60 doesn’t have any debt has other passive income (rentals), cure t holding are random funds her employer had with mass mutual they will be liquidated into cash and put into a traditional Roth. Risk tolerance I would say a 5 out of 10 (10 being very risky).\n\nMy thoughts where to select a handful of dividend stocks for 50-60% i like names such as jnj, mmm, xom, T, pg, Abbv, csco, ibm (trying to stick with dividend champion companies that are reasonably priced now..) etc and then the remaining 20% would be in a couple vanguard bond funds and remaining 20% in a vanguard s&amp;p fund. \n\nAny inout would be great this isn’t her complete retirement fund it is a small portion and 1 of 3 of her retirement accounts. \n\nThanks,",
        "created_utc": 1609951648,
        "id": "gibhfkp",
        "score": 1,
        "subreddit": "investing",
        "created": 1609980448.0
    },
    {
        "author": "ThePandaRider",
        "body": "&gt; As for IBM, I would say he has been absolutely spot on. Just look at the stock, it has been in long-term decline, peaking at $216 in 2013. Currently it's priced at $131. That's astoundingly bad underperformance given that the market has been pricing almost anything growth or tech related into the heavens over the last 5-6 years.\n\nHow is missing the $216-&gt;$131 decline spot on?\n\nHe is calling it out at ~$125.",
        "created_utc": 1609961409,
        "id": "gic3jn5",
        "score": 1,
        "subreddit": "investing",
        "created": 1609990209.0
    },
    {
        "author": "9tacos",
        "body": "Maybe PLTR could do that in the future. Right now, they have a proprietary analytics platform that they customize specifically for the workload.  It doesn’t look like a pure cloud SaaS business,  more like a hybrid / consulting services model like IBM.  The good thing is that they are being valued like a cloud SaaS.  Hopefully, this demo day reveals some more information.  I like the contracts they are landing and am I’m holding for 2021.",
        "created_utc": 1609846723,
        "id": "gi662ii",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609875523.0
    },
    {
        "author": "redderper",
        "body": "IBM has a seemingly never ending revenue stream from governments and financial companies. Part of it is from mainframes and legacy systems, but they also did a lot of acquisitions of smaller tech companies in the last 10 years that have the more innovative stuff.\n\nThey have lost a lot of market share from other tech companies like Microsoft and Amazon webservices, so they're not growing much anymore. Still think it's a good bluechip stock to hold",
        "created_utc": 1609854317,
        "id": "gi6fpbs",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609883117.0
    },
    {
        "author": "krakdis",
        "body": "Qualcomm CEO retiring, Gary Cohen joins IBM as Vice chairman, Jack Ma goes missing, NYSE decides not to delist 3 Chinese companies....folks...we are going to hell. Buckle up, cuz this ride bout to get UGGGLLLYYYYY",
        "created_utc": 1609856713,
        "id": "gi6johf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609885513.0
    },
    {
        "author": "Timbishop123",
        "body": "The news media, financial industry, and investing community are in general agreement Robinhood disrupted the industry with zero commission trades. That's called a concensus bud... your points are akin to saying Apple didn't change the phone industry with the IPhone because IBM was making smart phones in the 90s. It's a dumb point. Furthermore I didn't lie, you are just back peddling. Also what large post? The one where you refused to read my source? Lastly you're extremely tilted. You are writing essays repeating the same false points with a twang of elitism, if this is how you act with a little pressure from reddit how do you act in real life when something major happens? It's like if someone said 2+2 = 4 and some guy wrote a bunch of essays on why it was actually 85... Honestly no reason to continue the conversation from here I already know what you will say and there is no reason to argue with a weirdo on reddit on a simple topic. Can't wait for your next manifesto to ignore.",
        "created_utc": 1609898160,
        "id": "gi97570",
        "score": 1,
        "subreddit": "investing",
        "created": 1609926960.0
    },
    {
        "author": "greenlantern0201",
        "body": "Yeah definitely. I see a future where blockchain is very widely used, but I don’t see that for any cryptocurrency. \n\nSo you’d say to invest in ETH then? Or what company has the possibility of benefiting? I’ve heard IBM is the current leader in blockchain development for business.",
        "created_utc": 1609828385,
        "id": "gi5n3d1",
        "score": 1,
        "subreddit": "investing",
        "created": 1609857185.0
    },
    {
        "author": "ScottyStellar",
        "body": "Question now is what private companies would benefit from merging w the SPAC run by the vice chair of IBM?",
        "created_utc": 1609865136,
        "id": "gi70ly0",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1609893936.0
    },
    {
        "author": "Kingslayer_1997",
        "body": "He’s not even on the board of directors for IBM lol. This is literally an advisory role not a full time job. Listen to cramers piece on CNBC. And Cohn tweeted he’s still focused on the spac and post spac shareholder value return",
        "created_utc": 1609865593,
        "id": "gi71lsn",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1609894393.0
    },
    {
        "author": "redderper",
        "body": "At the moment it is because low code isn't that popular yet outside of government, banking and insurance (which IBM and Pega is mostly focused on). Salesforce is very popular though, but mostly as a CRM platform. The others focus more on what is called BPM or process automation.\n\nSeems that Mendix, Appian, Bettyblocks and Microsoft are more focused on commercial markets and offer simpler and cheaper solutions (I believe Bettyblocks is actually no-code). Which is smart because there are a lot of potential customers in that market that don't use low code platforms yet. So I do see future in it, but the question is which companies are going to become the market leaders.",
        "created_utc": 1609837920,
        "id": "gi5xc5s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609866720.0
    },
    {
        "author": "justacanadian7744",
        "body": "Yes but during the digital age, apple and microsoft cut ties with their suppliers, look at Intel and IBM now. Sometimes the sellers also out perform the suppliers by turning wood into expsenive chairs.",
        "created_utc": 1609846813,
        "id": "gi665zv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609875613.0
    },
    {
        "author": "omniron",
        "body": "Velodyne is the ibm of lidar... they do what they do well but they have a blind spot for where the innovation is.",
        "created_utc": 1609787561,
        "id": "gi3hjfr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609816361.0
    },
    {
        "author": "ericdtla",
        "body": "Can someone ELI5 the difference between PLTR's Foundry vs. a data middle office/platform offered by other companies such as SAP, IBM, BABA, etc.?",
        "created_utc": 1609671278,
        "id": "ghxooy7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609700078.0
    },
    {
        "author": "nomindbody",
        "body": "He looks like a cross between the ancient aliens guy and Trevor Milton :/ not a good combo if you want to take someone seriously\n\nLong as well 😬\n\nCan see it taking market share from ORCL, IBM, and MSFT, at least from the government side. And I imagine when those government workers go to work in public or private companies, they'll bring that PLTR love with them.",
        "created_utc": 1609683426,
        "id": "ghybsvu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609712226.0
    },
    {
        "author": "two-lipp",
        "body": "**18 y/o Updated Portfolio** \n\n&amp;#x200B;\n\n|MSFT|13%|\n|:-|:-|\n|JPM|5.95%|\n|DIS |5.66%|\n|UAL |5.40% (Short Term) |\n|CCL |4.73% (Short Term) |\n|IBM|3.93%|\n|RDS.B|2.12%|\n|NDAQ|2.08%|\n|XOM|1.99%|\n|AXP|1.89%|\n|WEN|1.71%|\n|ALK |1.62%|\n|VWDRY|1.22%|\n|NEE|1.20%|\n|NCL|1.19%|\n|REST IS CASH||\n|||\n\n&amp;#x200B;\n\nI was told that my portfolio was, understandably \"boring\". I should note that I am looking for long-term investments, but would nonetheless love more recommendations :)",
        "created_utc": 1609698049,
        "id": "ghz7bhl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609726849.0
    },
    {
        "author": "Careful-Article-7163",
        "body": "1. Sure after like 4 decades of dominance IBM fell off. Could happen with Tesla too but that example seems like a pretty fantastic outcome for Tesla imo.\n2. That company isn't even remotely close to what the current FSD beta can do so I don't see the comparison. Highways only. Like what it's advertising is essentially Tesla software capabilities from 3 years ago. Hardly something to worry about from a Level 5 standpoint.",
        "created_utc": 1609879496,
        "id": "gi7z77l",
        "score": 1,
        "subreddit": "investing",
        "created": 1609908296.0
    },
    {
        "author": "coronagetcha",
        "body": "The king always gets shivved in the end.  Sears was Amazon.  IBM was Microsoft.  Intel was Nvidia.  History repeats.",
        "created_utc": 1609906747,
        "id": "gi9oex4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609935547.0
    },
    {
        "author": "TorpCat",
        "body": "Who is the new AMD? INTC or IBM?\n\nRemindMe! 3 months",
        "created_utc": 1610047618,
        "id": "gigh75v",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610076418.0
    },
    {
        "author": "SPAC-ey-McSpacface",
        "body": "I disagreed with someone who said exactly the opposite.  \n\nHe sold out 100% of his CRHC because he thought Cohn taking a job at IBM meant he's not at all focused on his SPAC, which I think is 180 degrees the wrong way to think about it.",
        "created_utc": 1610125874,
        "id": "gik4lzl",
        "score": 0,
        "subreddit": "SPACs",
        "created": 1610154674.0
    },
    {
        "author": "ThePandaRider",
        "body": "He has been shorting Tesla for years. He may just be acting on investor confidence at this point. IBM is beat up, losing revenue, and doing layoffs.",
        "created_utc": 1609942210,
        "id": "giaydi3",
        "score": 0,
        "subreddit": "investing",
        "created": 1609971010.0
    },
    {
        "author": "DaBi5cu1t",
        "body": "These companies IPOd years ago. Splunk 8 years ago. IBM god knows how long ago. Palantir IPOs 4 months ago. No company starts with great financials.",
        "created_utc": 1609620744,
        "id": "ghv144u",
        "score": 0,
        "subreddit": "stocks",
        "created": 1609649544.0
    },
    {
        "author": "tomorland",
        "body": "Ok, let's talk about Tesla.\n\nFor the record, I do not own any Tesla stock, nor do I own a Tesla car, nor do I plan to own either in the foreseeable future. (I \\*do\\* own an electric car that I built myself. Love it. Planning to convert my daughter's car soon.)\n\nHere's why I think Tesla's stock value *could* be justified and *may* continue to go up.\n\n1. Tesla is a car company that makes a profit. It's not Amazon. But then, Amazon *didn't* make a profit for a long, long time. Amazon's retail product delivery service still doesn't make a profit. Who could have known that Amazon would beat Microsoft, Oracle, Cisco, Walmart, Akamai and all the others at cloud services? AWS is the meat of Amazon's profits. Who could have predicted this when they were just a book store?\n2. Tesla is also a consumer goods company. Solar power is just the tip of the iceberg. Heat pumps, Smart Homes, Satellite Networking... Yes, it's a tech company -- but it's more than that, it's a *BRAND*. Brand is far more valuable than innovation. The story you sell is more effective than the product you sell, *especially* if it's an also-ran product...\n3. Musk only knows one way to manage -- like a startup. Still going strong, like a start-up, after all these years.\n4. Leverage. Space-X, Boring Co. Tesla and whatever else comes along -- Grid-scale electrical storage? Off-grid self-sufficient housing? Insurance services? They all share tech between them. Tesla's Octo-valve, for instance. Almost certainly was designed by an aerospace engineer at Space-X.\n5. Tesla isn't Apple, or Amazon, or Microsoft. It's more like Java (the programming language) in the late 1990s.  Java didn't do anything better than any other language could do. It was a far worse language than many other more suitable, more mature ones. It failed at its main promise (write once, run anywhere!) Most seasoned programmers laughed at it. They said it wouldn't last. And yet...\n\nSo, forget about the cars. Tesla is a *brand*. It's a consumer technology-goods company that got it's start with cars, like Amazon got its start with books until it found gold in cloud services. Tesla is still digging, currently using a constellation of satellites... It won't end there. That's guaranteed.\n\nHaving said that, keep in mind that any one of IBM, Oracle, Walmart or a dozen others *could* have eaten Amazon's lunch at any time. Amazon was lucky no one tried very hard.",
        "created_utc": 1609736817,
        "id": "gi1essu",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1609765617.0
    },
    {
        "author": "Catheter_Trader",
        "body": "IBM is leading this space\n\nhttps://www.ibm.com/quantum-computing/learn/what-is-quantum-computing",
        "created_utc": 1609633958,
        "id": "ghvq76l",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1609662758.0
    },
    {
        "author": "Ironleg01",
        "body": "Many headwinds and few tailwinds. You probably won't lose 90% of your capital invested in banks but my guess is that money you allocate to banks will probably underperform S&amp;P. The question then is why invest? Because they are cheap? Well IBM is cheap too...",
        "created_utc": 1609787457,
        "id": "gi3hbbx",
        "score": -1,
        "subreddit": "investing",
        "created": 1609816257.0
    },
    {
        "author": "walnuts24",
        "body": "Good points.  As a reference, prior to 2020 (2010-2019) my annualized return has been about 18%.  Usually my individual stocks way outperform my index funds or mutual funds but I don’t have time to research for hours and hours.  My investments have always been owned longer than a year, most closer to 5+ years or almost the entire duration.  My main holdings over the 2010-2019 (pre-COVID) period were Microsoft ($28 cost basis), Disney ($46 cost basis), Nike ($55) and Xylem ($50).  I got ‘lucky’ and dumped Disney when Iger stepped down in February out of nowhere at $135.  I never bought back in and I should have. I did have some duds such as IBM and GE over that time that dragged me down, but I can’t complain.  This year I did well but I traded more than usual and lost my cost basis for everything out of panic selling.  The trades I made were Zillow ($78-115), Starbucks ($78-103), Penn ($3-15), NIO ($3-16) and some losses like Slack and CARA.  Now I have only my 401K and a bit of sector ETF (I love ARKK).  \n\nHindsight, I screwed up and should have just held all my positions but I just kept jumping around to catch waves.  I didn’t realize they were never going to stop! Haha. Now I’m looking at everything thinking “they have to correct” and I’m not sure they will.  Which is why I have yet to get back in.",
        "created_utc": 1609940431,
        "id": "giavd6f",
        "score": -9,
        "subreddit": "investing",
        "created": 1609969231.0
    },
    {
        "author": "h4ppidais",
        "body": "How is palantir’s machine learning different (or better) than other companies like IBM, MS, or Google? Is it just that we see more growth with Palantir than any of those mega companies that the stock will grow? I understand this company is doing well currently, but I don’t see how this is a unicorn company because a lot of other companies already have machine learning.",
        "created_utc": 1609900530,
        "id": "gi9bz6e",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1609929330.0
    },
    {
        "author": "ax3l",
        "body": "PLTR holders, if you have questions about the industry, feel free to ask. Been working data warehousing/analytics for 10+ years. Have worked with most Fortune 500 companies directly or indirectly through IBM.",
        "created_utc": 1609530121,
        "id": "ghr2oao",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1609558921.0
    },
    {
        "author": "Universal-Omnicide",
        "body": "Breaking News: Goldman'sSachs must invest list for 2021\n\nGE \n\nAT&amp;T\n\nBAYER\n\nIBM \n\nHewlett Packard",
        "created_utc": 1609789494,
        "id": "gi3lmu6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1609818294.0
    },
    {
        "author": "redderper",
        "body": "Contracts worth a couple of million here and there while market cap is already over 40 billion (used to be over 50B even). It's just not enough, look at the numbers that competitors like Splunk, IBM, Elasticsearch etc. are pulling in and compare their market cap to Palantir",
        "created_utc": 1609620505,
        "id": "ghv0mxp",
        "score": 5,
        "subreddit": "stocks",
        "created": 1609649305.0
    },
    {
        "author": "SPAC-ey-McSpacface",
        "body": "I'd say \"most\" SPACs.  Warrant prices are just silly.  Over the last 3 trading sessions I've been liquidating almost all of my warrants &amp; putting the money back into commons of the underlying.\n\nOne odd exception is CRHC Units, which are actually cheaper than Commons + Warrants.  I have a lot of CRHC Units, but I'm tempted to add even more for three reasons.\n\n1. I like the team / SPAC\n2. I like the fact Cohn just signed on with IBM today.  I didnt see anyone mention this as a CRHC readthrough &amp; the SPAC wasnt up much today, but I cant imagine Cohn takes that job unless they already have a target.\n3. Them seem, IMO, cheap all things being equal",
        "created_utc": 1609899387,
        "id": "gi99n01",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1609928187.0
    },
    {
        "author": "PepeSilviaFTW",
        "body": "First home computer was an Apple IIGS. Second home computer was a badass Black IBM Aptiva. Learned how to code on that thing. \n\nThrough corporate shit I’ve had to deal with both. No biggie. \n\nBut I’ve been caught in the infinite feud between MSFT &amp; AAPL my whole fucking life.  \n\nHave AirPods on a Windows machine? \nMaybe we’ll work today. Maybe tomorrow. Fuck your ears. \n\nOh. You plugged in an iPhone to charge. \n7 hours for 100%\n\nMacBook: 10 Minutes to 100%\n\n\n**I’m going to die bitter as fuck.**",
        "created_utc": 1609816028,
        "id": "gi5391o",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1609844828.0
    },
    {
        "author": "BombTracks82",
        "body": "I imagine $PLTR sees itself as the future in big data just for having a narrower focus than ibm ms and Google. Because of that narrower focus that is probably already using one of those 3 platforms they get to create more efficient methods for collecting sorting and dispensing said data cuz that shit can get messy really fast",
        "created_utc": 1609902578,
        "id": "gi9g5dr",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1609931378.0
    },
    {
        "author": "Catheter_Trader",
        "body": "When is IBM gonna start rolling out news on the quantum computers and entangled processor chips?",
        "created_utc": 1609530223,
        "id": "ghr2xit",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1609559023.0
    },
    {
        "author": "AXdssd5as",
        "body": "But if Bitcoin is being bought by investors as a store of value, i.e. how it is marketed as \"digital gold\", isn't this a bit dangerous since unlike gold, it can have identical competitors, and just because it is on-top now doesn't mean it always will be?\n\nGold has been a store of value because of its relatively finite quantity at any given time, but also because of several other qualities that are hard to replicate in other materials (it doesn't rust or corrode or tarnish, it is soft enough to be shaped easily, it is rare but not too rare etc).\n\nUnlike gold, Bitcoin is replicable, either identically or near-identically, which means that it could become more like a stock in the future, and if that's the case, the fact that it is on-top now doesn't necessarily mean this will continue? Companies that have seemed unassailable (AT&amp;T, IBM, Kodak) have fallen, meanwhile gold has been around for however many thousands of years and still hasn't been dethroned (except maybe eventually by Bitcoin!)",
        "created_utc": 1609784124,
        "id": "gi3a52l",
        "score": 2,
        "subreddit": "investing",
        "created": 1609812924.0
    },
    {
        "author": "AlbanySteamedHams",
        "body": "1. Wasn't IBM the gorilla in the room back in the day? Clearly, they are still around, so I can't say that they \"didn't make it\". But still...\n2. Here's an example of a third party platform working on expanding autonomous control across multiple lines of cars (not FSD, but hopefully they provide a sense that somebody can work on these problems in this way): [https://comma.ai/](https://comma.ai/). Again, they aren't doing it with \"no data\", but they are working on it.",
        "created_utc": 1609878751,
        "id": "gi7x98d",
        "score": 2,
        "subreddit": "investing",
        "created": 1609907551.0
    },
    {
        "author": "jumpmasterj",
        "body": "Allow me to educate you a little bit. First off, Tesla technically wasn’t the first mover in the EV space as it wasn’t the first to bring EV into production—GM was the first to market in 1996 with the “EV1”. Just as FB and Google weren’t the first or second in their markets. So, maybe tell that to MySpace, IBM, NetScape, Siebel Systems, Yahoo, Aol, etc etc.",
        "created_utc": 1609899960,
        "id": "gi9asl6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1609928760.0
    },
    {
        "author": "ax3l",
        "body": "Not my field of expertise unfortunately. Also no longer at IBM.",
        "created_utc": 1609530618,
        "id": "ghr3yyd",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1609559418.0
    },
    {
        "author": "boom1chaching",
        "body": "I mean... wasn't IBM a household name, then just about disappeared and very recently it's coming back into the spotlight as actual competition.\n\nAnecdotally, it seems to me that IBM is more popular now than it was a decade ago and seems like actual competition towards other tech companies.",
        "created_utc": 1609517450,
        "id": "ghq584m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609546250.0
    },
    {
        "author": "Catheter_Trader",
        "body": "IBM will be a meme stonk...\n\nhttps://www.ibm.com/quantum-computing/learn/what-is-quantum-computing",
        "created_utc": 1609599600,
        "id": "ghtx1qa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609628400.0
    },
    {
        "author": "Phreeker27",
        "body": "I enjoy holding ibm and with the spin off you should get a portion of their cloud company and maintain the OG ibm ticker. Ibm is currently 4% of my portfolio I will keep buying but not more than 5% overall I think it’s worth the bet, worst case I get a decent dividend",
        "created_utc": 1609805865,
        "id": "gi4jgcx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609834665.0
    },
    {
        "author": "PoppaPickle",
        "body": "I had 20k in savings so I built a portfolio based on growth and also high dividends about 7 months ago.\nI have shares in TSM, MSFT, IBM, AVB, and LUMN.\n\nMy TSM position is up 125% and my MSFT is up 11%... the rest are up, but mostly float on average around 5%.\n\nLooking back I am happy I diversified, but I obviously could have been up much more if I went all in on TSM.\n\nFor reference I'm up 4k on that 20k from diversifying rather than being up 25k if I put it all in TSM.\n\nBut the caveat to this is you have to land in the right stock. I had a 1/5 chance according to my portfolio for this strategy to work.",
        "created_utc": 1609810245,
        "id": "gi4rxny",
        "score": 1,
        "subreddit": "investing",
        "created": 1609839045.0
    },
    {
        "author": "galaxy1011",
        "body": "Who gives a shit about IBM",
        "created_utc": 1609856118,
        "id": "gi6in72",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609884918.0
    },
    {
        "author": "WesternMinimum6407",
        "body": "IBM sleeper",
        "created_utc": 1609937148,
        "id": "giaqlfq",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1609965948.0
    },
    {
        "author": "Turbulent_Bit8683",
        "body": "Guys check the filings he joined RH quite late and because of his name got top billing while he has his fingers in many pies VC of IBM isn’t small time commitment - I think CRHC will be as successful with or without him his name will help but not sure if he will be active - he might also get some insight in tech that IBM bets on so that’s an advantage but this will go sideways for next one quarter for sure if not two. Caveat being if they are already in advanced discussion stage!",
        "created_utc": 1609872767,
        "id": "gi7hmik",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1609901567.0
    },
    {
        "author": "kingkyle13",
        "body": "What’s the play on GILD and IBM? “Deep value” / Dividend?",
        "created_utc": 1609717351,
        "id": "gi0d8yr",
        "score": 1,
        "subreddit": "InvestmentClub",
        "created": 1609746151.0
    },
    {
        "author": "Constant-Noodler",
        "body": "I have a certificate with 3 IBM shares bought in 1981. How do I get them cashed and account for all the splits that have occurred since that time?",
        "created_utc": 1609734168,
        "id": "gi1abaj",
        "score": 1,
        "subreddit": "investing",
        "created": 1609762968.0
    },
    {
        "author": "facsnahm1",
        "body": "I'm doing my masters in Information Management and I genuinely do not see any difference on what Palantir offers compared to Microsoft, IBM or SAP (and fuck SAP!). Maybe I am a dumb dumb but I cannot wrap my mind on its valuation. Only thing that comes to mind is that it is being way overhyped by people not knowledgeable in Information management, i.e. a lot of data analysts.",
        "created_utc": 1609679210,
        "id": "ghy3n65",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609708010.0
    },
    {
        "author": "Raleigh_Noles",
        "body": "I have to disagree. While a lot of us are doing good work researching and investing in fields and technology we use and buy, and getting in earlier into the future Boeing’s, Mastercards, IBM, Ford etc.\nYou have millions or hundreds of thousands of pump and dumpers on WSB or YouTube pump and dumping vag cream companies. That’s the domino or canary that makes this scary. And will ultimately doom a lot of this market.\nThe kid who has a $5k Robinhood account, gains a huge following pushing penny stocks, only to crash and burn. You get enough of those kind of stories and retail will coward away. Creating a new generation who is fearful of investing.... Chris Saca is a prime example of how history will repeat itself.\n\nBloomberg, Marketwatch, Fortune parading around newly minted millionaires always terrifies me, because that usually signals things getting out of hand...... Beenie babies, Pokémon cards, tulips, Bitcoin.",
        "created_utc": 1609687813,
        "id": "ghykiah",
        "score": 1,
        "subreddit": "investing",
        "created": 1609716613.0
    },
    {
        "author": "Somethingdifferent39",
        "body": "I average up all the time. I started buying SQ at $98 and stopped around $160. I would still buy more at $218 but its already taken over a large portion of my portfolio so I wont for diversity reasons.\n\nTo your question, you will likely find that you will be mpre successful averaging up than down, as counter intuitive as it may seem. You could have averaged up on AMZN, AAPL, and MSFT at any point in the past decade and be very happy with the result.\n\nLikewise you could have averaged down on XOM, IBM, and GE over the last 10 years and been very dissapointed. More often than not the long term trend is justified. Your job as an investor is to figure out where the company is headed next.",
        "created_utc": 1609768676,
        "id": "gi2fsic",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609797476.0
    },
    {
        "author": "jinnyjuice",
        "body": "For 2021 eh? Hmm I can see the logic behind some of them\n\nWhy Amazon, IBM, and Nokia?",
        "created_utc": 1609738747,
        "id": "gi1hqan",
        "score": 1,
        "subreddit": "InvestmentClub",
        "created": 1609767547.0
    },
    {
        "author": "The-Crazed-Crusader",
        "body": "Thanks for article. And from other things I found it seems that IBM failed to compete because they were too competitive. Not only the buybacks, but there were expensive ventures by buying up large cloud companies that made no money of consequence. They actually started losing when they missed the PC train. And recently, yes they've been spending fortunes on competitive business practices while only spending enough on science to keep their products relevant... While the other guy was following the Edison model of the business of science (money obtained from the last patent funds the next invention).\n\nWho is to blame? IDK, I ain't an insider.",
        "created_utc": 1609523715,
        "id": "ghqla7i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609552515.0
    },
    {
        "author": "kismatwalla",
        "body": "Big Gov, FDA, Public Health and Big Pharma is the market right now.  People also talking about supply chain optimization.  How the product achieves this is a bit mysterious.  Also not clear if selling it requires an army of consultants.  Perhaps they will need to get Accenture/IBM/Deloitte on board to push this through for wider variety if use cases. And yes some certification programs are needed as well.  Palantir certified Data Scientist in Udacity",
        "created_utc": 1609527828,
        "id": "ghqwea8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609556628.0
    },
    {
        "author": "oldprecision",
        "body": "She actually had an engineering degree but eventually ended up in the sales/consulting side at IBM.",
        "created_utc": 1609518443,
        "id": "ghq7o2h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609547243.0
    },
    {
        "author": "diorgasm",
        "body": "IBM for the vaccine digital passport",
        "created_utc": 1609592967,
        "id": "ghto362",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609621767.0
    },
    {
        "author": "_FUCK_THE_GIANTS_",
        "body": "IBM is the definition of a boomer stock",
        "created_utc": 1609599883,
        "id": "ghtxhx7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609628683.0
    },
    {
        "author": "bill_ding_jr",
        "body": "Isn’t fb, ibm, and all the other techs making their own already?  Aren’t there new ones daily?  Why do you need a brand name for something tied to usd value?",
        "created_utc": 1609818298,
        "id": "gi57g9g",
        "score": 1,
        "subreddit": "investing",
        "created": 1609847098.0
    },
    {
        "author": "redderper",
        "body": "I'm working with low code software myself as a developer. It's a small world. I learned recently when I bought an ETF that has Appian how much it gained and I'm quite surprised because I haven't heard of anyone or any company that uses it.\n\nMost popular players in the low code fields are IBM, Salesforce, Pegasystems and more recently I see Mendix, Microsoft and Bettyblocks gaining some traction. Don't know a lot about Appian yet, but I'm going to look into it",
        "created_utc": 1609798429,
        "id": "gi44nk3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609827229.0
    },
    {
        "author": "9tacos",
        "body": "Maybe PLTR could do that in the future. Right now, they have a proprietary analytics platform that they customize specifically for the workload.  It doesn’t look like a pure cloud SaaS business,  more like a hybrid / consulting services model like IBM.  The good thing is that they are being valued like a cloud SaaS.  Hopefully, this demo day reveals some more information.  I like the contracts they are landing and am I’m holding for 2021.",
        "created_utc": 1609846723,
        "id": "gi662ii",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609875523.0
    },
    {
        "author": "redderper",
        "body": "IBM has a seemingly never ending revenue stream from governments and financial companies. Part of it is from mainframes and legacy systems, but they also did a lot of acquisitions of smaller tech companies in the last 10 years that have the more innovative stuff.\n\nThey have lost a lot of market share from other tech companies like Microsoft and Amazon webservices, so they're not growing much anymore. Still think it's a good bluechip stock to hold",
        "created_utc": 1609854317,
        "id": "gi6fpbs",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609883117.0
    },
    {
        "author": "krakdis",
        "body": "Qualcomm CEO retiring, Gary Cohen joins IBM as Vice chairman, Jack Ma goes missing, NYSE decides not to delist 3 Chinese companies....folks...we are going to hell. Buckle up, cuz this ride bout to get UGGGLLLYYYYY",
        "created_utc": 1609856713,
        "id": "gi6johf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609885513.0
    },
    {
        "author": "Timbishop123",
        "body": "The news media, financial industry, and investing community are in general agreement Robinhood disrupted the industry with zero commission trades. That's called a concensus bud... your points are akin to saying Apple didn't change the phone industry with the IPhone because IBM was making smart phones in the 90s. It's a dumb point. Furthermore I didn't lie, you are just back peddling. Also what large post? The one where you refused to read my source? Lastly you're extremely tilted. You are writing essays repeating the same false points with a twang of elitism, if this is how you act with a little pressure from reddit how do you act in real life when something major happens? It's like if someone said 2+2 = 4 and some guy wrote a bunch of essays on why it was actually 85... Honestly no reason to continue the conversation from here I already know what you will say and there is no reason to argue with a weirdo on reddit on a simple topic. Can't wait for your next manifesto to ignore.",
        "created_utc": 1609898160,
        "id": "gi97570",
        "score": 1,
        "subreddit": "investing",
        "created": 1609926960.0
    },
    {
        "author": "greenlantern0201",
        "body": "Yeah definitely. I see a future where blockchain is very widely used, but I don’t see that for any cryptocurrency. \n\nSo you’d say to invest in ETH then? Or what company has the possibility of benefiting? I’ve heard IBM is the current leader in blockchain development for business.",
        "created_utc": 1609828385,
        "id": "gi5n3d1",
        "score": 1,
        "subreddit": "investing",
        "created": 1609857185.0
    },
    {
        "author": "ScottyStellar",
        "body": "Question now is what private companies would benefit from merging w the SPAC run by the vice chair of IBM?",
        "created_utc": 1609865136,
        "id": "gi70ly0",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1609893936.0
    },
    {
        "author": "Kingslayer_1997",
        "body": "He’s not even on the board of directors for IBM lol. This is literally an advisory role not a full time job. Listen to cramers piece on CNBC. And Cohn tweeted he’s still focused on the spac and post spac shareholder value return",
        "created_utc": 1609865593,
        "id": "gi71lsn",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1609894393.0
    },
    {
        "author": "redderper",
        "body": "At the moment it is because low code isn't that popular yet outside of government, banking and insurance (which IBM and Pega is mostly focused on). Salesforce is very popular though, but mostly as a CRM platform. The others focus more on what is called BPM or process automation.\n\nSeems that Mendix, Appian, Bettyblocks and Microsoft are more focused on commercial markets and offer simpler and cheaper solutions (I believe Bettyblocks is actually no-code). Which is smart because there are a lot of potential customers in that market that don't use low code platforms yet. So I do see future in it, but the question is which companies are going to become the market leaders.",
        "created_utc": 1609837920,
        "id": "gi5xc5s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609866720.0
    },
    {
        "author": "justacanadian7744",
        "body": "Yes but during the digital age, apple and microsoft cut ties with their suppliers, look at Intel and IBM now. Sometimes the sellers also out perform the suppliers by turning wood into expsenive chairs.",
        "created_utc": 1609846813,
        "id": "gi665zv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609875613.0
    },
    {
        "author": "omniron",
        "body": "Velodyne is the ibm of lidar... they do what they do well but they have a blind spot for where the innovation is.",
        "created_utc": 1609787561,
        "id": "gi3hjfr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609816361.0
    },
    {
        "author": "ericdtla",
        "body": "Can someone ELI5 the difference between PLTR's Foundry vs. a data middle office/platform offered by other companies such as SAP, IBM, BABA, etc.?",
        "created_utc": 1609671278,
        "id": "ghxooy7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609700078.0
    },
    {
        "author": "nomindbody",
        "body": "He looks like a cross between the ancient aliens guy and Trevor Milton :/ not a good combo if you want to take someone seriously\n\nLong as well 😬\n\nCan see it taking market share from ORCL, IBM, and MSFT, at least from the government side. And I imagine when those government workers go to work in public or private companies, they'll bring that PLTR love with them.",
        "created_utc": 1609683426,
        "id": "ghybsvu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609712226.0
    },
    {
        "author": "two-lipp",
        "body": "**18 y/o Updated Portfolio** \n\n&amp;#x200B;\n\n|MSFT|13%|\n|:-|:-|\n|JPM|5.95%|\n|DIS |5.66%|\n|UAL |5.40% (Short Term) |\n|CCL |4.73% (Short Term) |\n|IBM|3.93%|\n|RDS.B|2.12%|\n|NDAQ|2.08%|\n|XOM|1.99%|\n|AXP|1.89%|\n|WEN|1.71%|\n|ALK |1.62%|\n|VWDRY|1.22%|\n|NEE|1.20%|\n|NCL|1.19%|\n|REST IS CASH||\n|||\n\n&amp;#x200B;\n\nI was told that my portfolio was, understandably \"boring\". I should note that I am looking for long-term investments, but would nonetheless love more recommendations :)",
        "created_utc": 1609698049,
        "id": "ghz7bhl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609726849.0
    },
    {
        "author": "Careful-Article-7163",
        "body": "1. Sure after like 4 decades of dominance IBM fell off. Could happen with Tesla too but that example seems like a pretty fantastic outcome for Tesla imo.\n2. That company isn't even remotely close to what the current FSD beta can do so I don't see the comparison. Highways only. Like what it's advertising is essentially Tesla software capabilities from 3 years ago. Hardly something to worry about from a Level 5 standpoint.",
        "created_utc": 1609879496,
        "id": "gi7z77l",
        "score": 1,
        "subreddit": "investing",
        "created": 1609908296.0
    },
    {
        "author": "coronagetcha",
        "body": "The king always gets shivved in the end.  Sears was Amazon.  IBM was Microsoft.  Intel was Nvidia.  History repeats.",
        "created_utc": 1609906747,
        "id": "gi9oex4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609935547.0
    },
    {
        "author": "DaBi5cu1t",
        "body": "These companies IPOd years ago. Splunk 8 years ago. IBM god knows how long ago. Palantir IPOs 4 months ago. No company starts with great financials.",
        "created_utc": 1609620744,
        "id": "ghv144u",
        "score": 0,
        "subreddit": "stocks",
        "created": 1609649544.0
    },
    {
        "author": "tomorland",
        "body": "Ok, let's talk about Tesla.\n\nFor the record, I do not own any Tesla stock, nor do I own a Tesla car, nor do I plan to own either in the foreseeable future. (I \\*do\\* own an electric car that I built myself. Love it. Planning to convert my daughter's car soon.)\n\nHere's why I think Tesla's stock value *could* be justified and *may* continue to go up.\n\n1. Tesla is a car company that makes a profit. It's not Amazon. But then, Amazon *didn't* make a profit for a long, long time. Amazon's retail product delivery service still doesn't make a profit. Who could have known that Amazon would beat Microsoft, Oracle, Cisco, Walmart, Akamai and all the others at cloud services? AWS is the meat of Amazon's profits. Who could have predicted this when they were just a book store?\n2. Tesla is also a consumer goods company. Solar power is just the tip of the iceberg. Heat pumps, Smart Homes, Satellite Networking... Yes, it's a tech company -- but it's more than that, it's a *BRAND*. Brand is far more valuable than innovation. The story you sell is more effective than the product you sell, *especially* if it's an also-ran product...\n3. Musk only knows one way to manage -- like a startup. Still going strong, like a start-up, after all these years.\n4. Leverage. Space-X, Boring Co. Tesla and whatever else comes along -- Grid-scale electrical storage? Off-grid self-sufficient housing? Insurance services? They all share tech between them. Tesla's Octo-valve, for instance. Almost certainly was designed by an aerospace engineer at Space-X.\n5. Tesla isn't Apple, or Amazon, or Microsoft. It's more like Java (the programming language) in the late 1990s.  Java didn't do anything better than any other language could do. It was a far worse language than many other more suitable, more mature ones. It failed at its main promise (write once, run anywhere!) Most seasoned programmers laughed at it. They said it wouldn't last. And yet...\n\nSo, forget about the cars. Tesla is a *brand*. It's a consumer technology-goods company that got it's start with cars, like Amazon got its start with books until it found gold in cloud services. Tesla is still digging, currently using a constellation of satellites... It won't end there. That's guaranteed.\n\nHaving said that, keep in mind that any one of IBM, Oracle, Walmart or a dozen others *could* have eaten Amazon's lunch at any time. Amazon was lucky no one tried very hard.",
        "created_utc": 1609736817,
        "id": "gi1essu",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1609765617.0
    },
    {
        "author": "Catheter_Trader",
        "body": "IBM is leading this space\n\nhttps://www.ibm.com/quantum-computing/learn/what-is-quantum-computing",
        "created_utc": 1609633958,
        "id": "ghvq76l",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1609662758.0
    },
    {
        "author": "Ironleg01",
        "body": "Many headwinds and few tailwinds. You probably won't lose 90% of your capital invested in banks but my guess is that money you allocate to banks will probably underperform S&amp;P. The question then is why invest? Because they are cheap? Well IBM is cheap too...",
        "created_utc": 1609787457,
        "id": "gi3hbbx",
        "score": -1,
        "subreddit": "investing",
        "created": 1609816257.0
    }
]