[
    {
        "author": "backup2thebackup2",
        "body": "very startup has an origin story, a tale that illustrates its core principles. For Wealthsimple, that meant promoting low-fee, passive investing.\n\nAfter selling his first business about a decade ago, Wealthsimple co-founder Michael Katchen constructed a simple portfolio of exchange-traded funds using Microsoft Excel, then told the friends with whom he cashed out that this approach was the best way to invest their money.\n\nThe underlying premise: It’s tough to outperform the market over the long run, so for most people it’s better to invest in a mix of low-cost ETFs and ride the wave.\n\n“The feedback I got from my friends was, ‘Mike, we’re lazy. We love the system, but can you just please do it for us?’ ” Mr. Katchen told The Globe and Mail in 2016. “And they became the first 10 clients of Wealthsimple.”\n\nThe concept proved popular with the millennial crowd, attracting billions of dollars in assets to Wealthsimple’s so-called robo-adviser, and the company went so far as to buy Super Bowl ads preaching “simple automated investing.” In no time, Wealthsimple had so much buzz that people started to wonder if it would take down Bay Street’s old guard.\n\nLately, so much of that seems like a past life. The company’s automated platform still exists, but Wealthsimple is now advertising a day trading app for retail investors. And it’s not just stocks – it is heavily promoting its new cryptocurrency business, which allows users to swap a slew of crypto assets.\n\nThe new strategy seems at odds with Wealthsimple’s founding principles, particularly so with crypto, which is highly volatile and has some of the highest trading fees around. In a recent speech, Gary Gensler, the new head of the U.S. Securities and Exchange Commission, called the crypto market the Wild West, “rife with fraud, scams and abuse.” China recently made all crypto transactions illegal.\n\nDespite the hard pivot, Wealthsimple has said little about its change of heart. When asked about the new strategy, no one was willing to be interviewed. Instead, the company sent e-mails explaining that it is diversifying to target different client segments.\n\n“Our mission is to help everyone achieve financial freedom, no matter who they are or how much they have. That mission hasn’t changed. We are a fast growing company building a full financial ecosystem for our clients across their savings, investing, spending, tax and crypto needs,” Mr. Katchen wrote.\n\nAs for crypto’s volatility, which prompted the SEC chair to call it a “highly speculative asset class,” Mr. Katchen does not believe that disqualifies it from inclusion in a well-rounded portfolio. Wealthsimple, he wrote, is “very comfortable recommending that our clients put their money in diversified, low-cost portfolios, while also supporting them if they wish to invest in particular companies or promising new technology.” He also said that Wealthsimple is the first crypto platform to be regulated by a securities authority in Canada.\n\nWhat is happening at Wealthsimple is playing out in a similar fashion across the robo-adviser industry. Once-popular rivals in the United States, including Wealthfront and Betterment, are facing existential crises of their own. For all the billions of dollars that robo-advisers manage, it often isn’t enough to turn a profit. Betterment’s CEO stepped down last December, and its new leader acknowledged that an initial public offering likely was not possible until the company started making money.\n\n“These businesses operate on very tight margins. They just have extremely low fees, therefore they have to achieve pretty large scale before they’re profitable,” said David Goldstone, head of research and analytics at Backend Benchmarking, which tracks the robo-adviser market, in an interview.\n\nEven if a robo-adviser brings in tens of millions of dollars a year in revenue by charging around 0.5 per cent annually, the company has to spend heavily to attract new clients. “There was an industry-wide underestimation of how much it was going to cost to acquire customers,” Mr. Goldstone added.\n\nCompounding the problem, the old guard woke up and launched robo-advisers of their own. In the U.S., Vanguard and Charles Schwab now dominate the market, with assets worth US$210-billion and US$60-billion, respectively, at the end of 2020. Betterment, the largest independent robo-adviser in the U.S., managed US$28-billion at the same date. In Canada, Bank of Montreal launched its SmartFolio robo-adviser in 2016, and Royal Bank of Canada followed suit in 2018.\n\nThe incumbents aren’t simply more competition – they have a structural advantage, because they can cross-sell their robo-platforms to existing clients, lowering their customer-acquisition costs.\n\nTo adjust, Wealthsimple started diversifying in 2018 with a high-interest savings account, then added Wealthsimple Trade, which allows users to buy and sell stocks. In the fall of 2019, the company acquired software maker Simpletax. And a few months later it launched Wealthsimple Cash, a hybrid of a no-fee chequing account and a high-interest savings account.\n\nThe pivot to crypto started in August, 2020, when Wealthsimple’s users were permitted to start trading Bitcoin and Ether. This past June, trading expanded to 14 additional crypto assets, including Litecoin and Dogecoin.\n\nWealthsimple does not break down its assets by division, but retail trading and crypto are what makes Silicon Valley salivate. Last fall, Wealthsimple raised $114-million in a funding round that valued the company at $1.4-billion. In May, it raised another $750-million, boosting its valuation to $5-billion only seven months later.\n\nRetail trading app Robinhood and crypto trading hub Coinbase recently went public in the United States, and their financial statements illustrate just how explosive retail trading revenue growth can be, particularly in crypto. At Robinhood, crypto brought in US$320-million in the first half of 2021, compared with just US$10-million in the first half of 2020.\n\nTo understand what that could mean for Wealthsimple, simply look at the fee schedule. The company’s robo-clients often pay 0.5 per cent annually, while crypto traders pay 1.5 per cent to 2 per cent per transaction (although Wealthsimple must split that fee with other parties).\n\nStock trading and crypto are also popular with younger users, which has always been Wealthsimple’s target market but proved to be a tough nut to crack.\n\nEven though the company attracted billions in assets, it was a tiny fraction of the total wealth-management market. Switching rates, which measure the likelihood that someone is willing to leave their main financial institution, remain stubbornly low. In 2020, management consultancy Accenture pegged the switching rate for a primary financial account in Canada at only 4 per cent.\n\nYet as the company grows, it seems inevitable that it will move further from its roots – some of which are still exposed on Wealthsimple’s website. In a section promoting its robo-adviser, the company writes: “History shows that when you try to predict the future – by picking stocks, for example – rather than investing in a highly diversified way, you are more likely to underperform the market.”",
        "created_utc": 1633546794,
        "id": "hfmykz4",
        "permalink": "/r/CanadianInvestor/comments/q2r0ba/why_wealthsimple_went_from_preaching_lowfee/hfmykz4/",
        "score": 92,
        "subreddit": "CanadianInvestor",
        "created": 1633575594.0
    },
    {
        "author": "retrohwite",
        "body": "Looks like their sitemap has Google/Apple/MS and a few others in it along with the date the page was updated most recently...\nhttps://www.teladoc.com/sitemap.xml\n\nhttps://www.teladoc.com/molina-ny/es/\t10/22/2021\nhttps://www.teladoc.com/fmcp/\t10/21/2021\nhttps://www.teladoc.com/aetna/\t10/20/2021\nhttps://www.teladoc.com/apple/\t10/19/2021\nhttps://www.teladoc.com/primary360-aetna/\t10/12/2021\nhttps://www.teladoc.com/allergies/\t10/12/2021\nhttps://www.teladoc.com/faq/\t10/11/2021\nhttps://www.teladoc.com/molinamarketplace-ky/es/\t10/11/2021\nhttps://www.teladoc.com/ambettervirtualaccess/\t10/11/2021\nhttps://www.teladoc.com/\t10/8/2021\nhttps://www.teladoc.com/credence/\t10/7/2021\nhttps://www.teladoc.com/fepblue/\t10/5/2021\nhttps://www.teladoc.com/my-story/\t10/5/2021\nhttps://www.teladoc.com/molinamarketplace-ky/\t10/1/2021\nhttps://www.teladoc.com/medicare-quiz/\t10/1/2021\nhttps://www.teladoc.com/disaster-hotline/\t10/1/2021\nhttps://www.teladoc.com/microsoft/\t9/30/2021\nhttps://www.teladoc.com/google/\t9/28/2021\nhttps://www.teladoc.com/coronavirus/\t9/27/2021\nhttps://www.teladoc.com/exploremyplan/\t9/16/2021\nhttps://www.teladoc.com/truist/\t9/1/2021\nhttps://www.teladoc.com/piwik/\t8/27/2021\nhttps://www.teladoc.com/how-it-works/\t8/25/2021\nhttps://www.teladoc.com/ways-we-help/\t8/19/2021\nhttps://www.teladoc.com/mystart/\t8/11/2021\nhttps://www.teladoc.com/getteladoc/\t8/9/2021\nhttps://www.teladoc.com/dermatology/\t8/9/2021\nhttps://www.teladoc.com/usaa/\t7/30/2021\nhttps://www.teladoc.com/start/\t7/16/2021\nhttps://www.teladoc.com/link-in-bio/\t7/14/2021\nhttps://www.teladoc.com/virtualcare/\t7/12/2021\nhttps://www.teladoc.com/sitemap/\t7/8/2021\nhttps://www.teladoc.com/ups/\t6/23/2021\nhttps://www.teladoc.com/sisc/\t6/23/2021\nhttps://www.teladoc.com/medical-experts/\t6/21/2021\nhttps://www.teladoc.com/search/\t6/4/2021\nhttps://www.teladoc.com/nutrition/\t6/1/2021\nhttps://www.teladoc.com/contact-us/\t5/28/2021\nhttps://www.teladoc.com/therapy/\t5/24/2021\nhttps://www.teladoc.com/dell/\t5/11/2021\nhttps://www.teladoc.com/therapy/quiz/\t5/11/2021\nhttps://www.teladoc.com/bsc/\t4/19/2021\nhttps://www.teladoc.com/prescription-policy/\t3/26/2021\nhttps://www.teladoc.com/aetna-therapy/\t2/1/2021\nhttps://www.teladoc.com/accenture/\t2/1/2021\nhttps://www.teladoc.com/changehealthcare/\t2/1/2021\nhttps://www.teladoc.com/uhc-map/\t2/1/2021\nhttps://www.teladoc.com/bankofamerica/\t2/1/2021\nhttps://www.teladoc.com/bankofamerica/faqs/\t2/1/2021\nhttps://www.teladoc.com/primary360/\t1/15/2021\nhttps://www.teladoc.com/testimonials/\t1/1/2021\nhttps://www.teladoc.com/notice-of-privacy-practices/\t12/23/2020\nhttps://www.teladoc.com/quality-care/\t12/23/2020\nhttps://www.teladoc.com/community-guidelines/\t12/23/2020\nhttps://www.teladoc.com/share/\t11/12/2020\nhttps://www.teladoc.com/sexual-health/\t10/16/2020\nhttps://www.teladoc.com/made-for-me/\t10/12/2020\nhttps://www.teladoc.com/statefarm/\t9/3/2020\nhttps://www.teladoc.com/thd/\t8/20/2020\nhttps://www.teladoc.com/abbott/\t8/20/2020\nhttps://www.teladoc.com/videos/\t7/2/2020\nhttps://www.teladoc.com/advancemedicalannouncement/\t12/30/2019\nhttps://www.teladoc.com/bestdoctorsannouncement/\t12/30/2019\nhttps://www.teladoc.com/mobile/\t11/8/2019\nhttps://www.teladoc.com/videos/video-what-is-teladoc/\t11/8/2019\nhttps://www.teladoc.com/videos/video-healthcare-on-your-terms/\t11/8/2019\nhttps://www.teladoc.com/videos/video-teladoc-mobile-app/\t11/8/2019\nhttps://www.teladoc.com/care/caregiverfaqs/\t11/8/2019\nhttps://www.teladoc.com/videos/video-a-better-way-to-get-better/\t11/8/2019\nhttps://www.teladoc.com/videos/video-its-allergy-season/\t11/8/2019\nhttps://www.teladoc.com/flu/\t11/8/2019\nhttps://www.teladoc.com/world-mental-health/\t11/6/2019",
        "created_utc": 1635149090,
        "id": "hhynw17",
        "permalink": "/r/wallstreetbets/comments/qf8cyv/it_looks_like_tdoc_has_been_quietly_attracting/hhynw17/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1635177890.0
    },
    {
        "author": "MaxLikesNOODLES",
        "body": "Ex-Acn here - all members of staff can also take advantage of employee share scheme which allows them to use pre-tax salary to acquire stock at a 15% discount every quarter. Most people opt in for obvious reasons - look at the history of the stock... That's like £2,500-£3,000 on average x 600,000+ employees consistent purchasing. \n\nSolid company too - runs pretty well, off-shores the time intensive work, at the forefront of all the major tech trends, strong relationships with every important company globally, consistently acquiring companies (multiple a week sometimes) and attracts some fantastic talent. Would be hard for this company to ever fail.  \n\n\nAMA",
        "created_utc": 1633513180,
        "id": "hfl33e3",
        "permalink": "/r/stocks/comments/q2ayen/dividends_plus_growth_accenture_acn/hfl33e3/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1633541980.0
    },
    {
        "author": "londxncalling",
        "body": "Current portfolio of stocks (have a separate account with index funds):\n\nACN (Accenture) (12.5%) //\nBLK (Blackrock) (12.5%) //\nLONN (Lonza Group) (12.5%) //\nSPGI (S&amp;P Global) (12.5%) //\nUTG (Unite Group) (12.5%) //\nDARK (Darktrace) (7.5%) //\nMMC (Marsh and McLennan) (7.5%) //\nRELX (Reed-Elsevier) (7.5%) //\n3LUS (3x leveraged SP500) (5%) //\nCSCO (Cisco) (5%) //\nMA (Mastercard) (3.75%) //\nV (Visa) (3.75%)",
        "created_utc": 1634512644,
        "id": "hh1m7ll",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hh1m7ll/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1634541444.0
    },
    {
        "author": "VeganFoodIsYummy",
        "body": "BlackBerry Limited (NYSE: BB; TSX: BB) today announced that John Chen, Executive Chairman &amp; CEO of BlackBerry, will lead a discussion on National Zero Trust Strategy at the Billington CyberSecurity Summit. Joining him for the discussion will be executives from the United States Navy, Central Intelligence Agency (CIA), Accenture, and Appgate. The session will air on October 7, at 2:45pm ET.",
        "created_utc": 1633568784,
        "id": "hfobb2z",
        "permalink": "/r/wallstreetbets/comments/q2s87a/what_are_your_moves_tomorrow_october_07_2021/hfobb2z/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633597584.0
    },
    {
        "author": "BrutalHunny",
        "body": "Do you know who Accenture used to be and why they changed?",
        "created_utc": 1635542647,
        "id": "hikcwl6",
        "permalink": "/r/wallstreetbets/comments/qil34t/weekend_discussion_thread_for_the_weekend_of/hikcwl6/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635571447.0
    },
    {
        "author": "BrutalHunny",
        "body": "If you don’t know the power of a name change to escape bad press look up Accenture.",
        "created_utc": 1635542706,
        "id": "hikd1ua",
        "permalink": "/r/wallstreetbets/comments/qil34t/weekend_discussion_thread_for_the_weekend_of/hikd1ua/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635571506.0
    },
    {
        "author": "newmacbookpro",
        "body": "Like those who write mba candidate in their LinkedIn name or even worse, ex-company.\n   \n**John Dumb (ex-Accenture), mba candidate**",
        "created_utc": 1633501324,
        "id": "hfkq416",
        "permalink": "/r/wallstreetbets/comments/q25101/palantir_pltr_selected_by_us_army_for/hfkq416/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633530124.0
    },
    {
        "author": "MaxLikesNOODLES",
        "body": "Unlikely - the company is so diversified it's ridiculous. Have a google of Accenture Diamond Clients. These are companies who spend over $100m annually on Accentures services. In the last public report they had over 200.. plus the thousands of clients at various other levels",
        "created_utc": 1633541956,
        "id": "hfmndob",
        "permalink": "/r/stocks/comments/q2ayen/dividends_plus_growth_accenture_acn/hfmndob/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633570756.0
    },
    {
        "author": "smiglytz",
        "body": "I'm in it for the next years...\n\nThe industry as a whole has to figure out how to make money out of this technology, but this always like this whenever you create something completely new. First you conceptualize and that you apply, they already have some partnerships to address business applications, Accenture for example. So I'll take the risk and try not to look to much at P&amp;L.",
        "created_utc": 1633167559,
        "id": "hf2voad",
        "permalink": "/r/wallstreetbets/comments/pzrqaq/ionq_ipo/hf2voad/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633196359.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 12th of October\n\n\n\n## Upcoming events for Tuesday, October 12th\n\n - Stock splits:\n\n    - LXU @ **13:10** (Payable date: 10/08/2021)\n    - TTDKY @ **3:1** (Payable date: 10/08/2021)\n\n - Expected earnings:\n\n  AZZ, CNBKA, EDU, ENZ, FAST, GLDG, HIFS, ODC, PNFP, SGH, TSRI, VOXX\n\n - Ex-div:\n\n  CCMP, CMO, CMTL, COLB, CXE, CXH, DHF, FOF, HONE, IDCC, INSI, LDP, LSI, MCR, MIN, MMT, PSF, PTA, RA, RNP, RQI, UTF\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.338%)\n    - 3-Month Bill Auction (previous: 0.040%)\n    - 3-Year Note Auction (previous: 0.447%)\n    - 6-Month Bill Auction (previous: 0.055%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Clarida Speaks\n    - JOLTs Job Openings (consensus: 10.925M, previous: 10.934M)\n    - NFIB Small Business Optimism (previous: 100.1)\n    - Redbook (previous: 16.6%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, October 13th\n\n - Stock splits:\n\n    - MCHP @ **2:1** (Payable date: 10/12/2021)\n\n - Expected earnings:\n\n  BLK, DAL, ETWO, FRC, GS, INFY, JPM, LEXX, PAYA, PGR, RVPH, SNBR, SOTK, STCN, THTX, VMAR, WAFD, WINA, WIT\n\n - Ex-div:\n\n  ACN, BKU, CTRA, DBL, DCF, DLY, DSL, FUL, IHIT, IHTA, KAI, LEN, LEN.B, RVI, VBF, VTA, VVR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.190%)\n    - API Weekly Crude Oil Stock (previous: 0.951M)\n    - CPI (consensus: 0.3%, previous: 0.3%)\n    - CPI (consensus: 5.3%, previous: 5.3%)\n    - CPI Index, n.s.a. (consensus: 274.17, previous: 273.57)\n    - CPI Index, s.a (previous: 273.01)\n    - CPI, n.s.a (previous: 0.21%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.3%, previous: 0.1%)\n    - Core CPI (consensus: 4.0%, previous: 4.0%)\n    - Core CPI Index (previous: 279.34)\n    - FOMC Meeting Minutes\n    - FOMC Member Bowman Speaks\n    - FOMC Member Brainard Speaks\n    - Federal Budget Balance (previous: -171.0B)\n    - MBA 30-Year Mortgage Rate (previous: 3.14%)\n    - MBA Mortgage Applications (previous: -6.9%)\n    - MBA Purchase Index (previous: 275.7)\n    - Mortgage Market Index (previous: 684.5)\n    - Mortgage Refinance Index (previous: 3,037.6)\n    - OPEC Monthly Report\n    - Real Earnings (previous: 0.3%)\n    - Thomson Reuters IPSOS PCSI (previous: 59.44)\n\n## Upcoming events for Thursday, October 14th\n\n - Expected earnings:\n\n  AA, ARTW, BAC, BKSC, C, CMC, DCT, DPZ, KARO, MAYS, MS, TACO, UNH, USB, WBA, WFC\n\n - Ex-div:\n\n  ABBV, ABT, ACA, AFG, ALG, ARR, AVK, AYI, BBN, BCAT, BCX, BDJ, BELFA, BELFB, BFK, BFS, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIGZ, BIT, BKE, BLE, BLW, BME, BMEZ, BNY, BOE, BPT, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, CAC, CHCO, CII, CODI, DYFN, EGF, EME, EOG, FCX, FL, FRA, GBAB, GDV, GGM, GHC, GHY, GIM, GNT, GOF, GUT, GWRS, HMY, HPK, HYT, IEX, ISD, IVH, J, JCO, JEMD, JFR, JGH, JHAA, JLS, JOUT, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KWR, LEO, MAA, MCA, MEI, MGRC, MHD, MMD, MUE, MUI, MVO, NAC, NAD, NAN, NBB, NDMO, NEA, NEV, NID, NIQ, NKG, NKX, NMCO, NMS, NMZ, NPCT, NRK, NSL, NUV, NUW, NVG, NWFL, NXJ, NXR, NZF, OPP, OXLC, OXM, OXSQ, OZK, PBHC, PECO, PGZ, PMT, PNC, RFM, RFMZ, RIV, RMI, RMM, RSF, SAIC, SBR, SDHY, SJR, SNX, TEI, TRN, WDFC, WPP, WSO, WSO.B, XFLT\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.110%)\n    - Continuing Jobless Claims (consensus: 2,675K, previous: 2,714K)\n    - Core PPI (consensus: 0.5%, previous: 0.6%)\n    - Core PPI (consensus: 7.1%, previous: 6.7%)\n    - Crude Oil Imports (previous: 1.389M)\n    - Crude Oil Inventories (consensus: -0.418M, previous: 2.346M)\n    - Cushing Crude Oil Inventories (previous: 1.548M)\n    - Distillate Fuel Production (previous: 0.130M)\n    - EIA Refinery Crude Runs  (previous: 0.329M)\n    - EIA Weekly Distillates Stocks (previous: -0.396M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 1.5%)\n    - FOMC Member Barkin Speaks\n    - FOMC Member Bostic Speaks\n    - FOMC Member Williams Speaks\n    - Gasoline Inventories (consensus: -0.279M, previous: 3.256M)\n    - Gasoline Production (previous: -0.523M)\n    - Gasoline Production (previous: -0.523M)\n    - Heating Oil Stockpiles (previous: -0.216M)\n    - IEA Monthly Report\n    - Initial Jobless Claims (consensus: 320K, previous: 326K)\n    - Jobless Claims 4-Week Avg. (previous: 344.00K)\n    - Natural Gas Storage (consensus: 105B, previous: 118B)\n    - PPI (consensus: 0.6%, previous: 0.7%)\n    - PPI (consensus: 8.7%, previous: 8.3%)\n\n## Upcoming events for Friday, October 15th\n\n - Stock splits:\n\n    - SFET @ **1:40**\n\n - Expected earnings:\n\n  BMI, CIT, FCNCA, HTLD, JBHT, PLD, PNC, RBCAA, SXT, TFC\n\n - Ex-div:\n\n  DCOM, FUNC, GFL, GGG, HRL, PFLT, RPM, SOR, SRV, SZC\n\n - Economic events and announcements:\n\n    - Business Inventories (consensus: 0.6%, previous: 0.5%)\n    - CFTC Aluminium speculative net positions (previous: 3.8K)\n    - CFTC Copper speculative net positions (previous: 14.4K)\n    - CFTC Corn speculative net positions (previous: 297.0K)\n    - CFTC Crude Oil speculative net positions (previous: 398.3K)\n    - CFTC Gold speculative net positions (previous: 182.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -2.7K)\n    - CFTC Natural Gas speculative net positions (previous: -133.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 72.8K)\n    - CFTC Silver speculative net positions (previous: 16.4K)\n    - CFTC Soybeans speculative net positions (previous: 51.4K)\n    - CFTC Wheat speculative net positions (previous: 7.3K)\n    - Core Retail Sales (consensus: 0.5%, previous: 1.8%)\n    - Export Price Index (consensus: 0.6%, previous: 0.4%)\n    - FOMC Member Williams Speaks\n    - IMF Meetings\n    - Import Price Index (consensus: 0.6%, previous: -0.3%)\n    - Michigan 5-Year Inflation Expectations (previous: 3.00%)\n    - Michigan Consumer Expectations (consensus: 70.3, previous: 68.1)\n    - Michigan Consumer Sentiment (consensus: 73.2, previous: 72.8)\n    - Michigan Current Conditions (consensus: 82.0, previous: 80.1)\n    - Michigan Inflation Expectations (previous: 4.6%)\n    - NY Empire State Manufacturing Index (consensus: 27.00, previous: 34.30)\n    - Retail Control (consensus: 0.4%, previous: 2.5%)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Retail Sales (consensus: -0.2%, previous: 0.7%)\n    - Retail Sales (previous: 15.06%)\n    - Retail Sales Ex Gas/Autos (previous: 2.0%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 428)\n    - U.S. Baker Hughes Total Rig Count (previous: 528)\n\n^^^^2021-10-12",
        "created_utc": 1634032815,
        "id": "hgc50ey",
        "permalink": "/r/RobinHood/comments/q6iqda/daily_discussion_thread_october_12th_2021/hgc50ey/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1634061615.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 11th of October\n\n\n\n## Upcoming events for Monday, October 11th\n\n - Expected earnings:\n\n  ONVO\n\n - Economic events and announcements:\n\n    - Investing.com Gold Index (actual: 59.8%, previous: 54.8%)\n    - Investing.com S&amp;P 500 Index (actual: 56.9%, previous: 60.1%)\n\n## Upcoming events for Tuesday, October 12th\n\n - Stock splits:\n\n    - LXU @ **13:10** (Payable date: 10/08/2021)\n    - TTDKY @ **3:1** (Payable date: 10/08/2021)\n\n - Expected earnings:\n\n  AZZ, CNBKA, EDU, ENZ, FAST, GLDG, HIFS, ODC, PNFP, SGH, TSRI, VOXX\n\n - Ex-div:\n\n  CCMP, CMTL, COLB, CXE, CXH, DHF, FOF, HONE, IDCC, INSI, LDP, LSI, MCR, MIN, MMT, PSF, PTA, RA, RNP, RQI, UTF\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.338%)\n    - 3-Month Bill Auction (previous: 0.040%)\n    - 3-Year Note Auction (previous: 0.447%)\n    - 6-Month Bill Auction (previous: 0.055%)\n    - CB Employment Trends Index (previous: 110.37)\n    - FOMC Member Clarida Speaks\n    - JOLTs Job Openings (consensus: 10.925M, previous: 10.934M)\n    - NFIB Small Business Optimism (previous: 100.1)\n    - Redbook (previous: 16.6%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, October 13th\n\n - Stock splits:\n\n    - MCHP @ **2:1** (Payable date: 10/12/2021)\n\n - Expected earnings:\n\n  BLK, DAL, ETWO, FRC, GS, INFY, JPM, LEXX, PAYA, PGR, RVPH, SNBR, SOTK, STCN, THTX, VMAR, WAFD, WINA, WIT\n\n - Ex-div:\n\n  ACN, BKU, CTRA, DBL, DCF, DLY, DSL, FUL, IHIT, IHTA, KAI, LEN, LEN.B, RVI, VBF, VTA, VVR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.190%)\n    - API Weekly Crude Oil Stock (previous: 0.951M)\n    - CPI (consensus: 0.3%, previous: 0.3%)\n    - CPI (consensus: 5.3%, previous: 5.3%)\n    - CPI Index, n.s.a. (consensus: 274.21, previous: 273.57)\n    - CPI Index, s.a (previous: 273.01)\n    - CPI, n.s.a (previous: 0.21%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.3%, previous: 0.1%)\n    - Core CPI (consensus: 4.0%, previous: 4.0%)\n    - Core CPI Index (previous: 279.34)\n    - FOMC Meeting Minutes\n    - FOMC Member Bowman Speaks\n    - FOMC Member Brainard Speaks\n    - Federal Budget Balance (previous: -171.0B)\n    - MBA 30-Year Mortgage Rate (previous: 3.14%)\n    - MBA Mortgage Applications (previous: -6.9%)\n    - MBA Purchase Index (previous: 275.7)\n    - Mortgage Market Index (previous: 684.5)\n    - Mortgage Refinance Index (previous: 3,037.6)\n    - OPEC Monthly Report\n    - Real Earnings (previous: 0.3%)\n    - Thomson Reuters IPSOS PCSI (previous: 59.44)\n\n## Upcoming events for Thursday, October 14th\n\n - Expected earnings:\n\n  AA, ARTW, BAC, BKSC, C, CMC, DCT, DPZ, KARO, MAYS, MS, TACO, UNH, USB, WBA, WFC\n\n - Ex-div:\n\n  ABBV, ABT, ACA, AFG, ALG, ARR, AVK, AYI, BBN, BCAT, BCX, BDJ, BELFA, BELFB, BFK, BFS, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIGZ, BIT, BKE, BLE, BLW, BME, BMEZ, BNY, BOE, BPT, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, CAC, CHCO, CII, CODI, DYFN, EGF, EME, EOG, FCX, FL, FRA, GBAB, GDV, GGM, GHC, GHY, GIM, GNT, GOF, GUT, GWRS, HMY, HPK, HYT, IEX, ISD, IVH, J, JCO, JEMD, JFR, JGH, JHAA, JLS, JOUT, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KWR, LEO, MAA, MCA, MEI, MGRC, MHD, MMD, MUE, MUI, MVO, NAC, NAD, NAN, NBB, NDMO, NEA, NEV, NID, NIQ, NKG, NKX, NMCO, NMS, NMZ, NPCT, NRK, NSL, NUV, NUW, NVG, NWFL, NXJ, NXR, NZF, OPP, OXLC, OXM, OXSQ, OZK, PBHC, PECO, PGZ, PMT, PNC, RFM, RFMZ, RIV, RMI, RMM, RSF, SAIC, SBR, SDHY, SJR, SNX, TEI, TRN, WDFC, WPP, WSO, WSO.B, XFLT\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.110%)\n    - Continuing Jobless Claims (consensus: 2,700K, previous: 2,714K)\n    - Core PPI (consensus: 0.5%, previous: 0.6%)\n    - Core PPI (consensus: 7.1%, previous: 6.7%)\n    - Crude Oil Imports (previous: 1.389M)\n    - Crude Oil Inventories (consensus: -0.418M, previous: 2.346M)\n    - Cushing Crude Oil Inventories (previous: 1.548M)\n    - Distillate Fuel Production (previous: 0.130M)\n    - EIA Refinery Crude Runs  (previous: 0.329M)\n    - EIA Weekly Distillates Stocks (previous: -0.396M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 1.5%)\n    - FOMC Member Barkin Speaks\n    - FOMC Member Bostic Speaks\n    - FOMC Member Williams Speaks\n    - Gasoline Inventories (consensus: -0.279M, previous: 3.256M)\n    - Gasoline Production (previous: -0.523M)\n    - Gasoline Production (previous: -0.523M)\n    - Heating Oil Stockpiles (previous: -0.216M)\n    - IEA Monthly Report\n    - Initial Jobless Claims (consensus: 328K, previous: 326K)\n    - Jobless Claims 4-Week Avg. (previous: 344.00K)\n    - Natural Gas Storage (consensus: 105B, previous: 118B)\n    - PPI (consensus: 0.6%, previous: 0.7%)\n    - PPI (consensus: 8.7%, previous: 8.3%)\n\n^^^^2021-10-11",
        "created_utc": 1633946417,
        "id": "hg7myre",
        "permalink": "/r/RobinHood/comments/q5si7c/daily_discussion_thread_october_11th_2021/hg7myre/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1633975217.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 13th of October\n\n\n\n## Upcoming events for Wednesday, October 13th\n\n - Stock splits:\n\n    - MCHP @ **2:1** (Payable date: 10/12/2021)\n\n - Expected earnings:\n\n  BLK, DAL, ETWO, FRC, GS, HIHO, INFY, JPM, LEXX, LOOP, ODC, PAYA, PGR, RVPH, SNBR, SOTK, STCN, THTX, VLGEA, VMAR, WAFD, WINA, WIT\n\n - Ex-div:\n\n  ACN, BKU, CTRA, DBL, DCF, DLY, DSL, FUL, IHIT, IHTA, KAI, LEN, LEN.B, RVI, VBF, VTA, VVR\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.190%)\n    - API Weekly Crude Oil Stock (previous: 0.951M)\n    - CPI (consensus: 0.3%, previous: 0.3%)\n    - CPI (consensus: 5.3%, previous: 5.3%)\n    - CPI Index, n.s.a. (consensus: 274.14, previous: 273.57)\n    - CPI Index, s.a (previous: 273.01)\n    - CPI, n.s.a (previous: 0.21%)\n    - Cleveland CPI (previous: 0.3%)\n    - Core CPI (consensus: 0.2%, previous: 0.1%)\n    - Core CPI (consensus: 4.0%, previous: 4.0%)\n    - Core CPI Index (previous: 279.34)\n    - FOMC Meeting Minutes\n    - FOMC Member Bowman Speaks\n    - FOMC Member Brainard Speaks\n    - Federal Budget Balance (previous: -171.0B)\n    - MBA 30-Year Mortgage Rate (previous: 3.14%)\n    - MBA Mortgage Applications (previous: -6.9%)\n    - MBA Purchase Index (previous: 275.7)\n    - Mortgage Market Index (previous: 684.5)\n    - Mortgage Refinance Index (previous: 3,037.6)\n    - OPEC Monthly Report\n    - Real Earnings (previous: 0.3%)\n    - Thomson Reuters IPSOS PCSI (previous: 59.44)\n\n## Upcoming events for Thursday, October 14th\n\n - Expected earnings:\n\n  AA, ARTW, BAC, BKSC, C, CMC, DCT, DPZ, KARO, MAYS, MS, TACO, TSM, UNH, USB, WBA, WFC\n\n - Ex-div:\n\n  ABBV, ABT, ACA, AFG, ALG, ARR, AVK, AYI, BBN, BCAT, BCX, BDJ, BELFA, BELFB, BFK, BFS, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIGZ, BIT, BKE, BLE, BLW, BME, BMEZ, BNY, BOE, BPT, BST, BSTZ, BTA, BTT, BTZ, BUI, BYM, CAC, CHCO, CII, CODI, DYFN, EGF, EME, EOG, FCX, FL, FRA, GBAB, GDV, GGM, GHC, GHY, GIM, GNT, GOF, GUT, GWRS, HMY, HPK, HYT, IEX, ISD, IVH, J, JCO, JEMD, JFR, JGH, JHAA, JLS, JOUT, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JSD, KIO, KWR, LEO, MAA, MCA, MEI, MGRC, MHD, MMD, MUE, MUI, MVO, NAC, NAD, NAN, NBB, NDMO, NEA, NEV, NID, NIQ, NKG, NKX, NMCO, NMS, NMZ, NPCT, NRK, NSL, NUV, NUW, NVG, NWFL, NXJ, NXR, NZF, OPP, OXLC, OXM, OXSQ, OZK, PBHC, PECO, PGZ, PMT, PNC, RFM, RFMZ, RIV, RMI, RMM, RSF, SAIC, SBR, SDHY, SJR, SNX, TEI, TRN, WDFC, WPP, WSO, WSO.B, XFLT\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.035%)\n    - 8-Week Bill Auction (previous: 0.110%)\n    - Continuing Jobless Claims (consensus: 2,675K, previous: 2,714K)\n    - Core PPI (consensus: 0.5%, previous: 0.6%)\n    - Core PPI (consensus: 7.1%, previous: 6.7%)\n    - Crude Oil Imports (previous: 1.389M)\n    - Crude Oil Inventories (consensus: 0.140M, previous: 2.346M)\n    - Cushing Crude Oil Inventories (previous: 1.548M)\n    - Distillate Fuel Production (previous: 0.130M)\n    - EIA Refinery Crude Runs  (previous: 0.329M)\n    - EIA Weekly Distillates Stocks (consensus: -1.000M, previous: -0.396M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -1.0%, previous: 1.5%)\n    - FOMC Member Barkin Speaks\n    - FOMC Member Bostic Speaks\n    - FOMC Member Williams Speaks\n    - Gasoline Inventories (consensus: 0.133M, previous: 3.256M)\n    - Gasoline Production (previous: -0.523M)\n    - Gasoline Production (previous: -0.523M)\n    - Heating Oil Stockpiles (previous: -0.216M)\n    - IEA Monthly Report\n    - Initial Jobless Claims (consensus: 319K, previous: 326K)\n    - Jobless Claims 4-Week Avg. (previous: 344.00K)\n    - Natural Gas Storage (consensus: 105B, previous: 118B)\n    - PPI (consensus: 0.6%, previous: 0.7%)\n    - PPI (consensus: 8.7%, previous: 8.3%)\n\n## Upcoming events for Friday, October 15th\n\n - Stock splits:\n\n    - SFET @ **1:40**\n\n - Expected earnings:\n\n  BMI, CIT, FCNCA, HTLD, JBHT, PLD, PNC, RBCAA, SCHW, SXT, TFC\n\n - Ex-div:\n\n  CADE, DCOM, FUNC, GFL, GGG, HRL, JCE, PFLT, RPM, SOR, SRV, SZC\n\n - Economic events and announcements:\n\n    - Business Inventories (consensus: 0.6%, previous: 0.5%)\n    - CFTC Aluminium speculative net positions (previous: 3.8K)\n    - CFTC Copper speculative net positions (previous: 14.4K)\n    - CFTC Corn speculative net positions (previous: 297.0K)\n    - CFTC Crude Oil speculative net positions (previous: 398.3K)\n    - CFTC Gold speculative net positions (previous: 182.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -2.7K)\n    - CFTC Natural Gas speculative net positions (previous: -133.7K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 72.8K)\n    - CFTC Silver speculative net positions (previous: 16.4K)\n    - CFTC Soybeans speculative net positions (previous: 51.4K)\n    - CFTC Wheat speculative net positions (previous: 7.3K)\n    - Core Retail Sales (consensus: 0.5%, previous: 1.8%)\n    - Export Price Index (consensus: 0.6%, previous: 0.4%)\n    - FOMC Member Williams Speaks\n    - IMF Meetings\n    - Import Price Index (consensus: 0.6%, previous: -0.3%)\n    - Michigan 5-Year Inflation Expectations (previous: 3.00%)\n    - Michigan Consumer Expectations (consensus: 70.3, previous: 68.1)\n    - Michigan Consumer Sentiment (consensus: 73.1, previous: 72.8)\n    - Michigan Current Conditions (consensus: 82.0, previous: 80.1)\n    - Michigan Inflation Expectations (previous: 4.6%)\n    - NY Empire State Manufacturing Index (consensus: 27.00, previous: 34.30)\n    - Retail Control (consensus: 0.4%, previous: 2.5%)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Retail Sales (consensus: -0.2%, previous: 0.7%)\n    - Retail Sales (previous: 15.06%)\n    - Retail Sales Ex Gas/Autos (previous: 2.0%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 428)\n    - U.S. Baker Hughes Total Rig Count (previous: 528)\n\n## Upcoming events for Saturday, October 16th\n\n - Economic events and announcements:\n\n    - IMF Meetings\n\n^^^^2021-10-13",
        "created_utc": 1634119218,
        "id": "hggrjo2",
        "permalink": "/r/RobinHood/comments/q77usi/daily_discussion_thread_october_13th_2021/hggrjo2/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1634148018.0
    },
    {
        "author": "CoffeeIsForEveryone",
        "body": "BRK.B \nJNJ\nACN\nWMT",
        "created_utc": 1634444706,
        "id": "hgy41bz",
        "permalink": "/r/stocks/comments/q9jy6v/favorite_nontech_stocks_for_the_long_term/hgy41bz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634473506.0
    },
    {
        "author": "Suspended_9996",
        "body": "Accenture aka Collection Agency!  CUT OFF my electricity for 4 months!!\n\nSHAME ON YOU!!",
        "created_utc": 1633548166,
        "id": "hfn1wfj",
        "permalink": "/r/stocks/comments/q2ayen/dividends_plus_growth_accenture_acn/hfn1wfj/",
        "score": -1,
        "subreddit": "stocks",
        "created": 1633576966.0
    },
    {
        "author": "DistrictPsychedelic",
        "body": "Fidelity pretty much operates this way already, you need approval and clearance to make higher risk trades and certain amount to get cleared to trade options. They wont let you make naked calls nor puts without clearance, and they wont let you get super leveraged.  I have to say, I am fine with it.",
        "created_utc": 1633146455,
        "id": "hf236n9",
        "permalink": "/r/options/comments/pznbwz/is_the_sec_and_finra_planning_on_not_allowing/hf236n9/",
        "score": 47,
        "subreddit": "options",
        "created": 1633175255.0
    },
    {
        "author": "Tobeboss98",
        "body": "Even if u dont DRS, move ur shit off robinhood asap. fidelity is good DRS is imo better",
        "created_utc": 1633226582,
        "id": "hf6a0w7",
        "permalink": "/r/wallstreetbets/comments/q04qbf/255k_gme_yolo/hf6a0w7/",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1633255382.0
    },
    {
        "author": "AlbanySteamedHams",
        "body": "I feel the same way. If someone managed to siphon VTI out of my Fidelity account, there would be a paper trail for days and unless I was suspected of being complicit in fraud, Fidelity would backstop me and reconstitute whatever was pilfered. \n\nCrypto continues to strike me as a solution in search of a problem. But I suppose it is that backward way of thinking that has kept me from enjoying those sweet gains over the last few years.",
        "created_utc": 1633147386,
        "id": "hf24r1o",
        "permalink": "/r/investing/comments/pzf8tt/coinbase_hacked_funds_from_least_6000_customers/hf24r1o/",
        "score": 30,
        "subreddit": "investing",
        "created": 1633176186.0
    },
    {
        "author": "chikenbeer",
        "body": "7 voicemails from Fidelity!\n\nI wonder if they remembered my birth day! ![img](emote|t5_2th52|4258)",
        "created_utc": 1633409254,
        "id": "hfg17ch",
        "permalink": "/r/wallstreetbets/comments/q1doxb/what_are_your_moves_tomorrow_october_05_2021/hfg17ch/",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1633438054.0
    },
    {
        "author": "imadogg",
        "body": "I spoke to them last week and apparently it starts Dec 6th. Sad news. Fidelity please don't do this to me as well",
        "created_utc": 1633425452,
        "id": "hfgk5i3",
        "permalink": "/r/pennystocks/comments/q1oxlt/schwab_charging_commission_for_otc_trades/hfgk5i3/",
        "score": 22,
        "subreddit": "pennystocks",
        "created": 1633454252.0
    },
    {
        "author": "onnsieanddone",
        "body": "Open Roth IRA if you are working and have income to file a tax return. Fidelity account is easy enough to open. Just use a target date ETF to invest in, so like 2065 or 2070. Put 6k a year in it and you'll retire with millions.",
        "created_utc": 1633309594,
        "id": "hfaps57",
        "permalink": "/r/stocks/comments/q0uxpa/tips_for_starting_out_with_investing/hfaps57/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1633338394.0
    },
    {
        "author": "chikenbeer",
        "body": "Update: Fidelity wasn't calling for my birthday ![img](emote|t5_2th52|4260)",
        "created_utc": 1633409963,
        "id": "hfg27zg",
        "permalink": "/r/wallstreetbets/comments/q1doxb/what_are_your_moves_tomorrow_october_05_2021/hfg27zg/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1633438763.0
    },
    {
        "author": "Mehrune",
        "body": "&gt;They wont let you make naked calls nor puts without clearance, and they wont let you get super leveraged. \n\nThat I understand and I'm fine with seeing as how losses are unlimited.\n\n&amp;#x200B;\n\nHow hard is it to get approval at fidelity for level 1/2 options? Just purchasing for long Calls &amp; Puts?",
        "created_utc": 1633147114,
        "id": "hf24awg",
        "permalink": "/r/options/comments/pznbwz/is_the_sec_and_finra_planning_on_not_allowing/hf24awg/",
        "score": 14,
        "subreddit": "options",
        "created": 1633175914.0
    },
    {
        "author": "PlsDontNuke",
        "body": "I’ve been using Fidelity Signature Visa for 26 years. All gay porn expenses go on it. All the cash back goes into my asshole as long term hold bullion buttplugs. Have 16 carat in there now. Kinda crazy.",
        "created_utc": 1633274556,
        "id": "hf8gfxr",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf8gfxr/",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1633303356.0
    },
    {
        "author": "Snw323",
        "body": "Honestly I'd open a roth account with fidelity if you plan on just buying and holding.",
        "created_utc": 1633465252,
        "id": "hfisfn2",
        "permalink": "/r/stocks/comments/q24l2h/what_platform_works_better/hfisfn2/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1633494052.0
    },
    {
        "author": "shortdaYOLO",
        "body": "The sector as a whole is quite cooperative. IONQs hardware runs on all languages from Qiskit, Cirq, Pennylane,… to ETHZürich. They are available on all QC clouds, and are really driving applications research. The trapped Ion approach offers NxN connectivity with low overhead for error correction, high gate fidelity further reducing overhead, high coherence time (hours to days). \n\nI think the main selling point is that, while silicon or photonics approaches require low operating temperatures (0,x-4K) and massive overhead for error correction, they get away with laser cooling in a vacuum chamber and have shown 13:1 error correction working on trapped Ion systems. Personally I believe that they are on a strong path to be the first player to leave the NISQ era. (https://en.m.wikipedia.org/wiki/Noisy_intermediate-scale_quantum_era).\n\nAm I willing to bet the house on this? No, but I have built a starting position took some profits on the pre Merger spike and left some free runners and am willing to average down once the market is done slaughtering.",
        "created_utc": 1633168744,
        "id": "hf2x41b",
        "permalink": "/r/wallstreetbets/comments/pzrqaq/ionq_ipo/hf2x41b/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1633197544.0
    },
    {
        "author": "mjr2015",
        "body": "I'm level 5 on Fidelity and all I did was tick a bunch of boxes.\n\nBut that was roughly 10 years ago and at the time I had no clue what I was doing",
        "created_utc": 1633175717,
        "id": "hf36f74",
        "permalink": "/r/options/comments/pznbwz/is_the_sec_and_finra_planning_on_not_allowing/hf36f74/",
        "score": 10,
        "subreddit": "options",
        "created": 1633204517.0
    },
    {
        "author": "chikenbeer",
        "body": "I demand a trial by combat, fidelity.",
        "created_utc": 1633369511,
        "id": "hfdkebs",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfdkebs/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1633398311.0
    },
    {
        "author": "Fleureverr",
        "body": "Fidelity will. You're doing something wrong.",
        "created_utc": 1633093417,
        "id": "heyybi6",
        "permalink": "/r/pennystocks/comments/pz6pwn/prog_ready_to_moon/heyybi6/",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1633122217.0
    },
    {
        "author": "diggin-the-doge",
        "body": "Transfered all funds out of RH and sad there was no confetti 🎉🥳🎉 ...all going to Fidelity 🎊🎊 🎊",
        "created_utc": 1633451516,
        "id": "hfhvhxf",
        "permalink": "/r/wallstreetbets/comments/q1t7nc/daily_discussion_thread_for_october_05_2021/hfhvhxf/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1633480316.0
    },
    {
        "author": "FreeIfUboofIT",
        "body": "For real transfer to fidelity",
        "created_utc": 1633253730,
        "id": "hf7ggia",
        "permalink": "/r/wallstreetbets/comments/q04qbf/255k_gme_yolo/hf7ggia/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1633282530.0
    },
    {
        "author": "Weyland-U",
        "body": "Fidelity",
        "created_utc": 1633128920,
        "id": "hf14xov",
        "permalink": "/r/wallstreetbets/comments/pzhpkb/to_the_moon_or_bust/hf14xov/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633157720.0
    },
    {
        "author": "BreakfastOnTheRiver",
        "body": "You should ask Fidelity to reimburse the ACAT fee RH is charging you.",
        "created_utc": 1633294149,
        "id": "hf9s0gg",
        "permalink": "/r/investing/comments/q0pw2d/transfer_from_rh_to_fidelity/hf9s0gg/",
        "score": 8,
        "subreddit": "investing",
        "created": 1633322949.0
    },
    {
        "author": "9mac",
        "body": "With their recent spinout of cannabis assets into a second company, Mydecine shares will have a new CUSIP number. My shares on Fidelity are funky like yours, and untradable until the new number updates on my brokerage account. I think I read someone else post it could take up to a week.",
        "created_utc": 1633535576,
        "id": "hfm7r65",
        "permalink": "/r/shroomstocks/comments/q2lojm/mycof_in_vanguard_hasnt_updated_the_price_since/hfm7r65/",
        "score": 8,
        "subreddit": "shroomstocks",
        "created": 1633564376.0
    },
    {
        "author": "bcntrader",
        "body": "This reminds me of an article I read (not sure if true) where Fidelity claimed that the best performing accounts are owned by people who forgot they had an account, usually inherited accounts. \n\nThe problem is that we are always unsure about the future and we question ourselves if this time is going to be different, like in a buy and hold situation.",
        "created_utc": 1633269551,
        "id": "hf85mrw",
        "permalink": "/r/ValueInvesting/comments/q0f54d/perils_of_human_behavior_in_investing_part_2/hf85mrw/",
        "score": 8,
        "subreddit": "ValueInvesting",
        "created": 1633298351.0
    },
    {
        "author": "mvpilot172",
        "body": "You can buy OTC stocks on fidelity.",
        "created_utc": 1633474370,
        "id": "hfjcxdm",
        "permalink": "/r/pennystocks/comments/q25cd3/cpsl_penny_stock_shell_owned_by_ceos_of/hfjcxdm/",
        "score": 8,
        "subreddit": "pennystocks",
        "created": 1633503170.0
    },
    {
        "author": "cant-think-for-you",
        "body": "Pretty much all of the major brokerage firms offer free analysis tools if you have an account with them. I use Fidelity and their research tools have been more than sufficient for me.\n\nFor other general questions perhaps try  r/investingforbeginners",
        "created_utc": 1633390605,
        "id": "hff20js",
        "permalink": "/r/wallstreetbets/comments/q12dpa/daily_popular_tickers_thread_for_october_04_2021/hff20js/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633419405.0
    },
    {
        "author": "chikenbeer",
        "body": "ok fidelity salesman",
        "created_utc": 1633274195,
        "id": "hf8fmus",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf8fmus/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633302995.0
    },
    {
        "author": "9mac",
        "body": "My Mydecine shares are all fuckey on Fidelity right now.",
        "created_utc": 1633098170,
        "id": "hez88ls",
        "permalink": "/r/shroomstocks/comments/pz4t9f/shrooms_talks_october_01_2021_daily_discussion/hez88ls/",
        "score": 7,
        "subreddit": "shroomstocks",
        "created": 1633126970.0
    },
    {
        "author": "shermski4",
        "body": "Fidelity be like: Reminder, you have options expiring today.\n\nno shit fam.",
        "created_utc": 1633097192,
        "id": "hez62wh",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hez62wh/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633125992.0
    },
    {
        "author": "Stantron",
        "body": "Apparently we're both wrong, I did some googling:\n\nIn January 2015, Google (and fidelity)  raised $900million for a 8.33% stake in SpaceX. There is no indication they have sold any.",
        "created_utc": 1633488865,
        "id": "hfk66k3",
        "permalink": "/r/stocks/comments/q211wx/a_raging_bull_case_for_googlgoog/hfk66k3/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1633517665.0
    },
    {
        "author": "GodzillaBoner",
        "body": "Fidelity is still $0 for most OTC, unless they follow suit.",
        "created_utc": 1633280490,
        "id": "hf8tz2t",
        "permalink": "/r/weedstocks/comments/q0eu9a/daily_discussion_thread_october_03_2021/hf8tz2t/",
        "score": 6,
        "subreddit": "weedstocks",
        "created": 1633309290.0
    },
    {
        "author": "SunDevils321",
        "body": "I have my \n\nFidelity for my day trades and Roth and ira \nPrincipal for 401k \nCoinbase for cyrpto \nETrade for company stock \n\nThank god for 3 of the 4",
        "created_utc": 1633235331,
        "id": "hf6qr8n",
        "permalink": "/r/wallstreetbets/comments/q07sma/pro_tip_have_two_accounts_one_for_day_trades_one/hf6qr8n/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633264131.0
    },
    {
        "author": "unremarkable_penguin",
        "body": "Glad i ended up going Fidelity",
        "created_utc": 1633432725,
        "id": "hfgsnp0",
        "permalink": "/r/pennystocks/comments/q1oxlt/schwab_charging_commission_for_otc_trades/hfgsnp0/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1633461525.0
    },
    {
        "author": "Tiaan",
        "body": "&gt; Fidelity\n\nFidelity lets you use Symanetic VIP which is an app like google authenticator. It's kind of annoying because I've yet to find any other application that uses Symanetic VIP but it works. Idk about the others",
        "created_utc": 1633130699,
        "id": "hf18le4",
        "permalink": "/r/investing/comments/pzf8tt/coinbase_hacked_funds_from_least_6000_customers/hf18le4/",
        "score": 6,
        "subreddit": "investing",
        "created": 1633159499.0
    },
    {
        "author": "F1shB0wl816",
        "body": "I’m a mixed bag about it, people shouldn’t be pushed to make these decisions, but protecting people from themselves really only seems to hurt those who understand the risk, while the one being protected can still find a million ways to go bust. \n\nI get the margin aspect, but if someone’s willing to risk their money and you’re responsible, hopefully you’ll be smart enough to make the right choice to begin with. \n\nThat’s one thing I liked about robinhood. Idk why I can’t get level 2 on fidelity, I don’t even want to do anything complex and don’t mind the risk. I just want to hold some long calls occasionally. \n\nI think it would just be better to educate people than to police them. Trying to get to the root of the issue over treating symptoms that can be circumvented by clicking the right boxes, saying the right words, or using the “right” broker.",
        "created_utc": 1633178952,
        "id": "hf3bxka",
        "permalink": "/r/options/comments/pznbwz/is_the_sec_and_finra_planning_on_not_allowing/hf3bxka/",
        "score": 6,
        "subreddit": "options",
        "created": 1633207752.0
    },
    {
        "author": "Richman1010",
        "body": "Why use Fidelity when Etrade is $6.95 for OTC. This is not a question but just saying that there are other places you can use other than Fidelity",
        "created_utc": 1633133731,
        "id": "hf1erii",
        "permalink": "/r/pennystocks/comments/pzgmi0/bryyf_is_being_heavily_shorted_50_is_a_gold_mine/hf1erii/",
        "score": 6,
        "subreddit": "pennystocks",
        "created": 1633162531.0
    },
    {
        "author": "chikenbeer",
        "body": "Stop calling me Fidelity I'm busy watching 5min charts",
        "created_utc": 1633369817,
        "id": "hfdl86v",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfdl86v/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633398617.0
    },
    {
        "author": "AxemanFromMA",
        "body": "Was on the phone w/ Fidelity and they were trying to sell me on their trading app, I was like if there are fees I’m not interested lol",
        "created_utc": 1633471311,
        "id": "hfj6c46",
        "permalink": "/r/wallstreetbets/comments/q249th/what_are_your_moves_tomorrow_october_06_2021/hfj6c46/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633500111.0
    },
    {
        "author": "shaneizzard",
        "body": "I’ve generally had a great experience using Fidelity, and their lack of fees is hard to beat from a major US broker, but these are my two complaints. Their app is such trash that I just use the website, even on my phone. And they’re among the last brokers to process ticker changes on SPACs. At least the latter issue is fairly niche.",
        "created_utc": 1633106150,
        "id": "hezqlxf",
        "permalink": "/r/SPACs/comments/pz2m73/announcements_x_daily_discussion_for_friday/hezqlxf/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1633134950.0
    },
    {
        "author": "all-rightx3",
        "body": "Closing my fidelity account and going all in on Touchdown Tommy against the Patriots on Sunday #fuckit",
        "created_utc": 1633099850,
        "id": "hezbz6d",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hezbz6d/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633128650.0
    },
    {
        "author": "Vanquiishh",
        "body": "I think Fidelity cares most about your net worth when you apply for level 1/2. They don’t want you opening an account with 5k to do options when your total NW is also that 5K",
        "created_utc": 1633174844,
        "id": "hf3549q",
        "permalink": "/r/options/comments/pznbwz/is_the_sec_and_finra_planning_on_not_allowing/hf3549q/",
        "score": 6,
        "subreddit": "options",
        "created": 1633203644.0
    },
    {
        "author": "PapaCharlie9",
        "body": "Don't worry. The big guns, like Fidelity and Schwab, make too much money off of retail option traders. There is no way they will support regulations that hurt their business. But they will absolutely support regulation that kills off RH and WeBull.\n\nSo you won't have to cough up 25k or pass an SAT test. You may have to pay a transaction fee for every trade, though. The \"free\" days of RH are what is numbered, since anyone with half a brain understands that \"free\", when the mainstream charges a fee, just means hiding the cost from the consumer.",
        "created_utc": 1633192882,
        "id": "hf45pa5",
        "permalink": "/r/options/comments/pznbwz/is_the_sec_and_finra_planning_on_not_allowing/hf45pa5/",
        "score": 5,
        "subreddit": "options",
        "created": 1633221682.0
    },
    {
        "author": "TurdsAmongUs",
        "body": "IPAY, it’s an ETF. Its top holdings are Square, PayPal, Visa, MasterCard, fiserv, fidelity, global payments inc., American Express. \n\nThis ETF tracks cashless transactions and the data associated with those transactions. \n\nEvery sporting event I have been to this year was card only. Im not a cashless society guy, but it feels like we are going there. \n\nSorry I didn’t mention Palantir, GameStop, AMC,SOFI you fucking goons.",
        "created_utc": 1633368439,
        "id": "hfdhias",
        "permalink": "/r/stocks/comments/q175du/what_are_you_buying_today/hfdhias/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1633397239.0
    },
    {
        "author": "segaman1",
        "body": "Do you have a decent amount in an emergency fund? Try to keep 4-6 months worth of money in emergency fund. Put it in a savings account and don't touch it unless if you truly need to.\n\nIf you already do, put bit more money into taxable brokerage account (I suggest transferring from robinhood/webull to schwab or fidelity). Right now, we are in midst of a correction so be careful. It has the potential to continue in a further correction. I would suggest buying slowly and averaging down. Keep a good amount in cash tbh until things stabilize a bit",
        "created_utc": 1633415991,
        "id": "hfga63k",
        "permalink": "/r/investing/comments/q1okb0/what_to_do_after_youve_maxed_out_your_roth_ira/hfga63k/",
        "score": 5,
        "subreddit": "investing",
        "created": 1633444791.0
    },
    {
        "author": "taxfreetendies",
        "body": "tda, fidelity, schwab, ibkr, etc",
        "created_utc": 1633473830,
        "id": "hfjbrt2",
        "permalink": "/r/wallstreetbets/comments/q25101/palantir_pltr_selected_by_us_army_for/hfjbrt2/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633502630.0
    },
    {
        "author": "CrimsonBrit",
        "body": "Questions like this wish I could take all of my money out of ETrade and put it in a different brokerage. The portfolio visualizations are terrible.\n\nI can’t tell how my portfolio performed in September without exporting the data to Excel and doing my own analysis.\n\nI’ve opened up accounts with Fidelity and Vanguard, which also have their problems. I don’t get why these brokerage companies can’t keep up with UI and data manipulation.",
        "created_utc": 1633108479,
        "id": "hezw2s1",
        "permalink": "/r/stocks/comments/pz8v7p/so_how_much_did_you_lose_in_september/hezw2s1/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1633137279.0
    },
    {
        "author": "orbishcle",
        "body": "took 4 business days from fidelity &gt; computershare",
        "created_utc": 1633089031,
        "id": "heyqns8",
        "permalink": "/r/wallstreetbets/comments/pywv15/_/heyqns8/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633117831.0
    },
    {
        "author": "indigoismyfavorite",
        "body": "Fidelity, the nation’s largest retirement-plan provider, recommends having the equivalent of twice your annual salary saved. That means, if you earn $50,000 per year, by your 35th birthday, you should have around $100,000 socked away",
        "created_utc": 1633290077,
        "id": "hf9huwk",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf9huwk/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633318877.0
    },
    {
        "author": "Calm_Leek_1362",
        "body": "I use fidelity, and the fees aren't noticeable. Like, maybe 1 or 2%. If you sell a contract for $100, and delta takes it down to $50 to close,  you are paying like $1 or $2 on $50 in profit.",
        "created_utc": 1633273230,
        "id": "hf8diip",
        "permalink": "/r/options/comments/q0dhvu/for_option_spreads_do_most_of_you_close_your/hf8diip/",
        "score": 5,
        "subreddit": "options",
        "created": 1633302030.0
    },
    {
        "author": "MikeOx_Girthy",
        "body": "Fidelity and E-Trade",
        "created_utc": 1633197900,
        "id": "hf4hj30",
        "permalink": "/r/wallstreetbets/comments/pzy1a7/got_margin_called_yesterday_and_a_stranger_on_the/hf4hj30/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633226700.0
    },
    {
        "author": "SirBreakThePiggyBank",
        "body": "Get off Robinhood lol u can get this on td, shwabb, Interactive brokers, fidelity and all brokers which allow otc markets trading",
        "created_utc": 1633325063,
        "id": "hfbhzsf",
        "permalink": "/r/pennystocks/comments/q0tvzs/puge_looking_to_make_a_cybl_type_run_over_500_roi/hfbhzsf/",
        "score": 5,
        "subreddit": "pennystocks",
        "created": 1633353863.0
    },
    {
        "author": "greenewurm",
        "body": "I was looking in banking stocks today. The were listed in fidelity in store screener highest rated strong buys 9.9 when I was looking today.\nI was thinking along the same lines. I need a good etf for top like 10 growth banks.\nAfter reading this ill look into more tomorrow premarket. I was looking at C qnd one other today. But charts were not making me hungry enough.",
        "created_utc": 1633489458,
        "id": "hfk7cqe",
        "permalink": "/r/stocks/comments/q2axg7/what_do_people_think_about_bank_stocks/hfk7cqe/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1633518258.0
    },
    {
        "author": "Conscious-Soil9055",
        "body": "Fidelity I think is free for \"buy to close\" or \"sell to close\" orders",
        "created_utc": 1633261619,
        "id": "hf7rfn1",
        "permalink": "/r/options/comments/q0dhvu/for_option_spreads_do_most_of_you_close_your/hf7rfn1/",
        "score": 5,
        "subreddit": "options",
        "created": 1633290419.0
    },
    {
        "author": "OkExtension1961",
        "body": "First of all stay away from Robinhood, even a little searching will show you why. I prefer Fidelity, they have a great platform and amazing customer service should you need them. Other than that just continue to do your due diligence, choose great companies, and probably start off with investing in etfs. Also, welcome to the world of investing!",
        "created_utc": 1633306093,
        "id": "hfainoh",
        "permalink": "/r/StockMarket/comments/q0ttbx/new_to_stocks_any_tips/hfainoh/",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1633334893.0
    },
    {
        "author": "SpittinOpinions",
        "body": "Fidelity",
        "created_utc": 1633177982,
        "id": "hf3a6u0",
        "permalink": "/r/pennystocks/comments/pzm1cd/what_tickers_you_guys_buying_for_the_november_to/hf3a6u0/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633206782.0
    },
    {
        "author": "GimmeAllDaTendiesNow",
        "body": "I use Fidelity and I’ve never seen them disclose their criteria for approval. You could try calling the active trader team, but I doubt they would tell you. \n\nIf I had to guess, for buying long options only, the requirement would be fairly low. Writing naked options probably requires an account over $100k, high income and a year or more of experience.",
        "created_utc": 1633147649,
        "id": "hf256ue",
        "permalink": "/r/options/comments/pznbwz/is_the_sec_and_finra_planning_on_not_allowing/hf256ue/",
        "score": 4,
        "subreddit": "options",
        "created": 1633176449.0
    },
    {
        "author": "livewiththevice",
        "body": "TD is an option but I am a regular TD user and made a fidelity account specifically for OTC plays because TD charges like 6.95 or something per OTC transaction.",
        "created_utc": 1633479366,
        "id": "hfjn8yx",
        "permalink": "/r/pennystocks/comments/q25cd3/cpsl_penny_stock_shell_owned_by_ceos_of/hfjn8yx/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633508166.0
    },
    {
        "author": "ElderberryExternal99",
        "body": " Poet Technologies is my Q4 play. Was 0.79 yesterday closed over 0.90 yesterday. Currently sitting at a 1.00 pre Market. Got their first OEM Tier 1 sales yesterday. Due to be listed on the Nasdaq by end of 1st quarter 2022. Shares available on Fidelity",
        "created_utc": 1633524139,
        "id": "hflil06",
        "permalink": "/r/pennystocks/comments/q2i1bp/wsj_article_penny_stocks_boom/hflil06/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633552939.0
    },
    {
        "author": "kevdawgie7",
        "body": "Fidelity won’t let me get to it. But, it does look intriguing.",
        "created_utc": 1633092022,
        "id": "heyvps5",
        "permalink": "/r/pennystocks/comments/pz6pwn/prog_ready_to_moon/heyvps5/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633120822.0
    },
    {
        "author": "landarrr",
        "body": "Has anyone ever looked at macro axis? I was trying to research bofa and they have it rated like pretty high as far as bankruptcy percentages go. Like fidelity is a 1%. BofA is at 46%. 🍩understand.",
        "created_utc": 1633236120,
        "id": "hf6s4c5",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf6s4c5/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633264920.0
    },
    {
        "author": "SirGlass",
        "body": "Some people are just intimidated . They think its complex and hard and you need to be a \"professional\" to do this and they will know what is best to do.\n\nFact is most FA should basically tell people to invest in low cost index funds using a 3 fund portfolio , they may tweak it based on your risk tolerance ; However I don't think some people realize how easy it is to do this stuff ; setting up an account with schwab/fidelity/vangaurd then buying 3-4 MF . If you can setup a facebook account you can invest.",
        "created_utc": 1633356424,
        "id": "hfcoe3e",
        "permalink": "/r/investing/comments/q12nl9/a_returns_analysis_comparing_all_american_mutual/hfcoe3e/",
        "score": 4,
        "subreddit": "investing",
        "created": 1633385224.0
    },
    {
        "author": "NoPoSDP3",
        "body": "Fidelity isn't even giving me a quote... TradingView showing 700%+ increase, Charles Schwab showing its at a buck, but quotes at $.27...\n\nDid they halt trading for volatility?",
        "created_utc": 1633101338,
        "id": "hezfeei",
        "permalink": "/r/shroomstocks/comments/pz75tm/mydecine_completes_spinout_of_us_cannabis_assets/hezfeei/",
        "score": 4,
        "subreddit": "shroomstocks",
        "created": 1633130138.0
    },
    {
        "author": "KingFazir",
        "body": "Fidelity app keeps crashing and won’t let me login.\n\nI guess that’s a good thing.",
        "created_utc": 1633097649,
        "id": "hez72qg",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hez72qg/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633126449.0
    },
    {
        "author": "mike7x",
        "body": "TMC up on insider buy. From Fidelity today:\r  \n\r  \n$TMC Insider Buy: TMC The Metals Co\r  \n\r  \n09:35 AM EDT, 10/01/2021 (MT Newswires) Andrei Karkar, 10% Owner, Director, on Sept 30, 2021, executed a purchase for 2,250,110 shares in TMC for $9,999,939. Karkar has control over a total of 41.8M shares...value is approximately $186,123,323.",
        "created_utc": 1633122083,
        "id": "hf0qplr",
        "permalink": "/r/wallstreetbets/comments/pzasqm/how_retarded_it_is_to_gamble_on_tmc_34_k_based_on/hf0qplr/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633150883.0
    },
    {
        "author": "Anonymoose2021",
        "body": "TL,DR. Look at your trade tickets.   The cost basis is determined from that.  The per share price is rounded off.\n\nThe execution price is where the rounding error got introduced.   The OP should look at the transaction statements.  That will show the actual execution prices and and SEC charges, etc.   That will be the true cost.   The price shown on the summary is that true cost divided by the number of shares.   When you multiply to get back to true cost by multiplying the round off error creep in.\n\nEdit to add:  Fidelity does it this way.  I just assume Vanguard does, because the legal requirement is to track the cost basis, not average share prices.",
        "created_utc": 1633380798,
        "id": "hfef63o",
        "permalink": "/r/investing/comments/q16c8k/why_are_my_vanguard_calculations_off/hfef63o/",
        "score": 4,
        "subreddit": "investing",
        "created": 1633409598.0
    },
    {
        "author": "waynelipko",
        "body": "I am currently using Fidelity but shopping around as well, curious to see other responses.\n\nPros of Fidelity-  Availabilty, I can find/buy &gt;95% of the stocks discussed in this forum for the last year or so. Mobile app, I find their app easy to use and since I can't log into the actual site at work (security reasons) a convenient app is a must for me.\n\nCons- NO same day expiration options (0dte) trades (not sure if this is a concern for you but I thought I'd mention). NO stop limit/stop loss for OTC stocks, I can only set up stop limits etc for regular stocks not pennies/ OTC's.",
        "created_utc": 1633353845,
        "id": "hfcj7fu",
        "permalink": "/r/pennystocks/comments/q0xc9d/daily_plays_october_04_2021/hfcj7fu/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633382645.0
    },
    {
        "author": "BobsBurgersJoint",
        "body": "I really wish that fidelity didn't have the $50 foreign transaction fee",
        "created_utc": 1633129425,
        "id": "hf15z29",
        "permalink": "/r/pennystocks/comments/pzgmi0/bryyf_is_being_heavily_shorted_50_is_a_gold_mine/hf15z29/",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633158225.0
    },
    {
        "author": "SirGlass",
        "body": "The target date fund is a nice set it and forget it I would check the expense ratio and also what its current allocation is, sometimes target date funds are too conservative for some people (hold more bonds than they want to) however they are still usually pretty good options\n\nThe other thing would be just to construct your own so you can allocate how you want to. I like the classic 3 fund portfolio  however because they do not have a total USA market fund you would have to do something like (NOte these are just sample allocations you can allocate how you want)\n\nFidelity 500 Index Fund 45%\n\nFidelity Mid Cap Index Fund 10%\n\nFidelity Small Cap Index Fund 5%\n\nFidelity Total International Index Fund 20%\n\nFidelity US Bond Index Fund 20%\n\nNote some people skip bonds before they are close to retirement or only like to hold 10-15% bonds",
        "created_utc": 1633099586,
        "id": "hezbdi3",
        "permalink": "/r/investing/comments/pz432i/daily_advice_thread_all_basic_help_or_advice/hezbdi3/",
        "score": 3,
        "subreddit": "investing",
        "created": 1633128386.0
    },
    {
        "author": "Recent_Effective8070",
        "body": "So early 2020, I requested options on my Fidelity account. Checked a bunch of boxes and got Level 1-4\n I didn't request naked options. \n\nAfter the GME saga, I tried to get Options on my wife's account, same process and could only get level 1.\n\nI've mainly switched to TDA for this reason, but mainly because I can trade futures and I like the interface better.",
        "created_utc": 1633181219,
        "id": "hf3ga48",
        "permalink": "/r/options/comments/pznbwz/is_the_sec_and_finra_planning_on_not_allowing/hf3ga48/",
        "score": 3,
        "subreddit": "options",
        "created": 1633210019.0
    },
    {
        "author": "s0uly",
        "body": "What were you holding? I am not paying a penny to Fidelity for my Roth IRA.",
        "created_utc": 1633480098,
        "id": "hfjoryy",
        "permalink": "/r/stocks/comments/q24l2h/what_platform_works_better/hfjoryy/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633508898.0
    },
    {
        "author": "hdnflleodojxb",
        "body": "Max out your 401k. Get a grown up brokerage - Schwab, Fidelity, etc. Put a good chunk in that brokerage account.\n\n\nFigure out how much risk you are comfortable with. For your low-risk portfolio, VTI, VOO, and SPY or similar broad indexes are good choices. Vanguard are almost always a good choice for low fees. For your risky portion - maybe 20% if you can't lose too much for your house deposit? Idk you gotta figure that number out for yourself - you can look at individual stocks or more growth-focused ETFs. If you want exposure to crazy tech growth look at the ARK ETFs and they probably have a product that will give you that.\n\nCongratulations on your income. Don't let lifestyle creep too much, but treat yourself to something nice. You've earned a nice dinner, stupid RGB gaming computer, or whatever",
        "created_utc": 1633483841,
        "id": "hfjw5s0",
        "permalink": "/r/investing/comments/q1si1u/daily_advice_thread_all_basic_help_or_advice/hfjw5s0/",
        "score": 3,
        "subreddit": "investing",
        "created": 1633512641.0
    },
    {
        "author": "maxwellt1996",
        "body": "Fidelity and ibkr charges me like .65 cents per trade",
        "created_utc": 1633278337,
        "id": "hf8p03m",
        "permalink": "/r/options/comments/q07idm/before_the_start_of_the_current_pandemic_was_it/hf8p03m/",
        "score": 3,
        "subreddit": "options",
        "created": 1633307137.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "That's because you have a high quality broker. (/s)\n\nFidelity lists it as +3.23%. Where there is a split, they fix the charts to hide it, so you just see the price movement.",
        "created_utc": 1633450686,
        "id": "hfhtfpa",
        "permalink": "/r/StockMarket/comments/q1ub3f/why_did_price_of_intuitive_surgical_isrg_fall/hfhtfpa/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633479486.0
    },
    {
        "author": "notapersonaltrainer",
        "body": "Institutions are already moving into crypto. Mass Mutual, Harvard/Yale/Brown Endowments, Fidelity, and at least two pensions are public. It's the best option if you're unaccredited retail. \n\n- https://finance.yahoo.com/news/virginia-public-pensions-direct-bet-163646280.html\n- https://www.nasdaq.com/articles/new-jersey-pension-invested-%247m-in-bitcoin-mining-stocks-last-quarter-2021-07-23",
        "created_utc": 1633451019,
        "id": "hfhu9pc",
        "permalink": "/r/investing/comments/q1nm0r/vanguard_predicts_annualized_return_on_sp_500_to/hfhu9pc/",
        "score": 3,
        "subreddit": "investing",
        "created": 1633479819.0
    },
    {
        "author": "sharist_DIY_bio",
        "body": "NO units, NO warrants. You can only buy commons. It is considered a foreign transaction by Fidelity and so a charge of $50 a trade happens for every trade. That being said, Mercado Libre made me a bunch of money last Fall and I would like to go in on their SPAC, as I like the team. I'm glad I waited until it settled a little. I still need a little more time to get on top of my other duties, but I will share what I learn, as I plan to stalk it soon. ;D I like the stonk.",
        "created_utc": 1633202122,
        "id": "hf4r7bg",
        "permalink": "/r/SPACs/comments/pzj7xc/announcements_x_daily_discussion_for_weekend_of/hf4r7bg/",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1633230922.0
    },
    {
        "author": "9mac",
        "body": "Yeah my shares are currently locked and showing as MYCO:CA on Fidelity.",
        "created_utc": 1633101402,
        "id": "hezfjon",
        "permalink": "/r/shroomstocks/comments/pz9u9i/mycof_mydecine_innovations/hezfjon/",
        "score": 3,
        "subreddit": "shroomstocks",
        "created": 1633130202.0
    },
    {
        "author": "kylv3e",
        "body": "i got Fidelity TD Robinhood WeBull aaaaand maybe a few others lol. I heard TD is def a good one too.",
        "created_utc": 1633225361,
        "id": "hf67i72",
        "permalink": "/r/StockMarket/comments/pzsrwc/had_been_an_ok_month_september_lets_see_what/hf67i72/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633254161.0
    },
    {
        "author": "Miserable-Fact-6668",
        "body": "I’ve been using Fidelity Signature Visa for 26 years. All gay porn expenses go on it. All the cash back goes into my asshole as long term hold bullion buttplugs. Have 16 carat in there now. Kinda crazy.\n\nPost from above",
        "created_utc": 1633274860,
        "id": "hf8h3sb",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf8h3sb/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633303660.0
    },
    {
        "author": "OTC_Buyer",
        "body": "Get a real brokerage, not those mobile app ones. Like ETrade, TD Ameritrade, Fidelity, and etc.",
        "created_utc": 1633276001,
        "id": "hf8jmjq",
        "permalink": "/r/pennystocks/comments/pzgmi0/bryyf_is_being_heavily_shorted_50_is_a_gold_mine/hf8jmjq/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1633304801.0
    },
    {
        "author": "IsHotDogSandwich",
        "body": "I use fidelity. Kept my RH for fuckery.",
        "created_utc": 1633541760,
        "id": "hfmmwhi",
        "permalink": "/r/wallstreetbets/comments/q2h9su/daily_popular_tickers_thread_for_october_06_2021/hfmmwhi/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633570560.0
    },
    {
        "author": "123archer",
        "body": "Not sure I understand what you mean. I like Fidelity, but same question can be asked for any other brokerage service like Schwab.",
        "created_utc": 1633401625,
        "id": "hffnw32",
        "permalink": "/r/investing/comments/q1jmb2/money_weighted_vs_time_weighted_returns/hffnw32/",
        "score": 3,
        "subreddit": "investing",
        "created": 1633430425.0
    },
    {
        "author": "Spazzfreakydeaky",
        "body": "Fidelity showing the same thing. Just numbers and no value",
        "created_utc": 1633120163,
        "id": "hf0mjbp",
        "permalink": "/r/shroomstocks/comments/pz9u9i/mycof_mydecine_innovations/hf0mjbp/",
        "score": 3,
        "subreddit": "shroomstocks",
        "created": 1633148963.0
    },
    {
        "author": "NoPoSDP3",
        "body": "If you lookup $MYCOF on Fidelity it'll show the real price, and let you buy, but it doesn't recognize my shares I currently have",
        "created_utc": 1633109718,
        "id": "hezyx7r",
        "permalink": "/r/shroomstocks/comments/pz75tm/mydecine_completes_spinout_of_us_cannabis_assets/hezyx7r/",
        "score": 3,
        "subreddit": "shroomstocks",
        "created": 1633138518.0
    },
    {
        "author": "Slut_Spoiler",
        "body": "Fidelity",
        "created_utc": 1633115867,
        "id": "hf0d1ny",
        "permalink": "/r/wallstreetbets/comments/pz4tdf/daily_popular_tickers_thread_for_october_01_2021/hf0d1ny/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633144667.0
    },
    {
        "author": "MushyWasHere",
        "body": "FFS, get off Robinhood. They're not a real broker. They don't even buy your shares.\n\nI use Fidelity, Schwab and E\\*trade.\n\nALL brokers are scummy. But I use those ones. If Robinhood was my only option, I wouldn't even bother with the stock market.",
        "created_utc": 1633123344,
        "id": "hf0tdkx",
        "permalink": "/r/pennystocks/comments/pz1d8r/the_lounge_thoughts_noob_stuff_low_effort_brokers/hf0tdkx/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1633152144.0
    },
    {
        "author": "thegoodfight__",
        "body": "TWOH is Pink Current on the OTC. You can buy it anywhere you can buy OTC. I use Fidelity.",
        "created_utc": 1633177389,
        "id": "hf395fy",
        "permalink": "/r/pennystocks/comments/pzm1cd/what_tickers_you_guys_buying_for_the_november_to/hf395fy/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1633206189.0
    },
    {
        "author": "No-Bit3302",
        "body": "Fidelity",
        "created_utc": 1633192672,
        "id": "hf457d6",
        "permalink": "/r/pennystocks/comments/pzxiwn/ilus_is_getting_ready_for_another_big_run/hf457d6/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1633221472.0
    },
    {
        "author": "Hawt_Mayun",
        "body": "Fidelity gets off whet they get to be the first to wish you good morning",
        "created_utc": 1633360512,
        "id": "hfcxj5l",
        "permalink": "/r/wallstreetbets/comments/q17d15/fidelity_vs_robinhood_prices/hfcxj5l/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633389312.0
    },
    {
        "author": "Spongi",
        "body": "I'm leaning towards Fidelity and/or Interactive Brokers.   What I'm really looking for is a broker that let's you trade dark stocks.",
        "created_utc": 1633370204,
        "id": "hfdm9zr",
        "permalink": "/r/pennystocks/comments/q0z3dm/the_lounge_thoughts_noob_stuff_low_effort_brokers/hfdm9zr/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1633399004.0
    },
    {
        "author": "Searchingforspecial",
        "body": "Robbinhood restricts market access (1/28/21) and colluded with market makers and DTCC to reduce margin requirements post-call as well as execute trades in front of their own customers (PFOF). There are better, less criminal brokerages :)  \nOh, and Vlad restricted RH investors from selling within 30 days of IPO yet dumped million of shares of his own stock almost immediately? Red flags everywhere. Fidelity, ETrade, TDA, any of ‘em. Best of luck on your positions!!!",
        "created_utc": 1633441275,
        "id": "hfh7qgs",
        "permalink": "/r/pennystocks/comments/q1fef8/what_does_huge_volume_but_no_share_price_movement/hfh7qgs/",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1633470075.0
    },
    {
        "author": "ITatLaw",
        "body": "I've used Vanguard for my \"set it and forget it\" investments and am perfectly satisfied. Any well established broker, like Fidelity, will probably be fine. Just pick the one with the best fees and tools for you.",
        "created_utc": 1633465891,
        "id": "hfityta",
        "permalink": "/r/stocks/comments/q24l2h/what_platform_works_better/hfityta/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633494691.0
    },
    {
        "author": "usaf_photog",
        "body": "Are you using fidelity free active trader pro software? It has real time ticker prices displayed.",
        "created_utc": 1633360931,
        "id": "hfcyhfw",
        "permalink": "/r/wallstreetbets/comments/q17d15/fidelity_vs_robinhood_prices/hfcyhfw/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633389731.0
    },
    {
        "author": "alphacoke6",
        "body": "No you didn't.  The market moved in the time you placed the order.  \n\nJust put a limit sell in for bid and it will go as a marketable limit order.  If the market flash crashes in the mean time between entering the order it won't fill.\n\nFidelity sucks for their default orders as they should be limits on options especially on non liquid ones.",
        "created_utc": 1633540611,
        "id": "hfmk3a4",
        "permalink": "/r/options/comments/q2nwfk/questions_about_order_fills_market_vs_limit/hfmk3a4/",
        "score": 3,
        "subreddit": "options",
        "created": 1633569411.0
    },
    {
        "author": "chikenbeer",
        "body": "I bought these puts as a hedge I swear Fidelity",
        "created_utc": 1633460643,
        "id": "hfihbuh",
        "permalink": "/r/wallstreetbets/comments/q1t7nc/daily_discussion_thread_for_october_05_2021/hfihbuh/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633489443.0
    },
    {
        "author": "babydragon89",
        "body": "Fidelity is what I've used for the last 8 years. No fee for any transactions. They also have great articles on investing.",
        "created_utc": 1633465638,
        "id": "hfitd9g",
        "permalink": "/r/stocks/comments/q24l2h/what_platform_works_better/hfitd9g/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633494438.0
    },
    {
        "author": "Dr_Clout",
        "body": "I never said I wanted it free dude.Are you in a bad mood today or something? 100% there was a major technical glitch which is the 2nd time it’s happened. It calculates my fucking portfolio +$2000 up when I purchased puts and the stock went up. I 100% understand that brokerages have commissions in general but even if I switched to TD Ameritrade or Fidelity or Webull… they don’t have commissions more than Robinhood from what I understand. We’re merely talking just to talk here. Good day.",
        "created_utc": 1633097883,
        "id": "hez7la8",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hez7la8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633126683.0
    },
    {
        "author": "tamufc2018",
        "body": "Dont have to sell! Just call vanguard and initiate a drs share registration and they will take care of rest, fidelity took about 2 days for mine",
        "created_utc": 1633090749,
        "id": "heytgl4",
        "permalink": "/r/wallstreetbets/comments/pywv15/_/heytgl4/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633119549.0
    },
    {
        "author": "Djstevieo",
        "body": "Anyone else having problems with fidelity right now?",
        "created_utc": 1633096033,
        "id": "hez3l9c",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hez3l9c/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633124833.0
    },
    {
        "author": "hydrocyanide",
        "body": "&gt;Based on my amateur research, it seems that for long term gains I should be investing in international, not US, because the US economy isn't looking too great in the long term. Someone on this subreddit suggested VXUS, but Fidelity shows that fund as \"weak\" across the short/mid/long term.\n\nVXUS is weak because US equity has dominated international equity for a long time, which is also directly at odds with the idea that the US economy \"isn't looking too great.\" I don't know how you arrived at that conclusion, but I would seriously reconsider if I were you.",
        "created_utc": 1633111889,
        "id": "hf03x03",
        "permalink": "/r/investing/comments/pz432i/daily_advice_thread_all_basic_help_or_advice/hf03x03/",
        "score": 2,
        "subreddit": "investing",
        "created": 1633140689.0
    },
    {
        "author": "almilian",
        "body": "You need to sell before 3pm unless you have the money to exercise, Fidelity does the same.",
        "created_utc": 1633115406,
        "id": "hf0bznv",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hf0bznv/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633144206.0
    },
    {
        "author": "BarbellPadawan",
        "body": "Agree. I was listening to Bloomberg pretty much the whole week that first spike was happening. Someone (who I think was from HOOD but it was many months ago so I can’t recall details, but it wasn’t Vlad) said ‘short squeezes are illegal so trading had to be shut down.’  It was a few weeks later the Vlad came out with an interview giving a more coherent reason (though given timing still might be only a half truth) about the under capitalization related to settlement delays Etc. Also another somewhat sketchy thing, not sure if it’s like this now, but when I signed up for HOOD back in about 2018 I got options level 2 approved with about three clicks. I was like, that’s crazy, because with SCHW and Fidelity I had to fill out applications, show trade experience, prove I had funds, etc. and I am pretty sure they would have given me options level 3-4 had I requested it. That’s frankly derelict in my opinion.",
        "created_utc": 1633147059,
        "id": "hf247ob",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf247ob/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633175859.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "They're a local company for me and they've been making their car/motorcycles for years. People really love them for in-town commuter cars. The problem is the price, of the car, and of the stock. No idea how good an investment it is, but this company is a real company with a long history of building real products, and selling every one they can make.\n\nIt's a three-wheeled car that is licensed as an enclosed-motorcyle in some states, so the fees are lower and regulatory requirements are lower but it doesn't need a motorcycle endorsement.\n\nThe downside is, they've never shown an ability to grow very fast. Their management team is operationally competent but seems rather unable to achieve the growth that the customer interest suggests they could meet. Now that they're public, they won't be able to keep their insular team forever; they're eventually going to have to add some real professionals who can take their growth to the next level. This is a very promising long-term investment, but don't expect to see it pop again in the short or medium term. If you bought it on the prior meme-interest you might wait a lot of years to see those prices again. But they are absolutely a solid little company.\n\nThe fundamental analysis on Fidelity (by S&amp;P) gives their financial health a \"0/100\" oddly, but the balance sheet shows a lot of cash and very little debt, which is consistent with the local reporting, so I suspect that 0 is an error where they just didn't finish the analysis.",
        "created_utc": 1633208782,
        "id": "hf56lyv",
        "permalink": "/r/StockMarket/comments/q01nty/so_i_like_fuv/hf56lyv/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1633237582.0
    },
    {
        "author": "greytoc",
        "body": "True that both mutual funds and ETFs can have similar diversity. \n\nBut regarding the expense ratio - that's not necessarily true. \n\nThe expense can be much lower in the mutual fund than ETF. If you take equivalent funds that benchmark or index the Russell 2000 - this would be 2000 or so stocks. \n\nThe most common ETF that index Ruselll 2000 is $IWM (an iShares product) which has an expense ratio of 0.19%. There is also a Vanguard Russell 2k ETF with an 0.10% expense ratio. \n\nThe Vanguard Russell 2k mutual fund $VRTIX has an expense ratio of 0.08%. \n\nAnd if you look at index mutual funds which benchmark and track to the Russell 2000, the expense ratios are even lower. For example, the Fidelity Small Cap Fund $FSSNX has an expense ratio of only 0.025%. And the Schwab Small Cap Fund $SWSSX has an expense ration of only 0.04%.",
        "created_utc": 1633211847,
        "id": "hf5dk0n",
        "permalink": "/r/investing/comments/pz8gmz/different_portfolio_strategies/hf5dk0n/",
        "score": 2,
        "subreddit": "investing",
        "created": 1633240647.0
    },
    {
        "author": "IStillLikeBeers",
        "body": "Do they have any total US market or S&amp;P 500 funds with a low expense ratio (under 0.1%)? Whether Fidelity, Vanguard or Schwab? Would be unusual to have no option like that.",
        "created_utc": 1633378591,
        "id": "hfe93q5",
        "permalink": "/r/investing/comments/q17pp5/the_motley_fool_suggests_buy_and_sell/hfe93q5/",
        "score": 2,
        "subreddit": "investing",
        "created": 1633407391.0
    },
    {
        "author": "RajivChaudrii",
        "body": "I've seen this time and again... it really looks like you're trying your hardest to convince yourself to hold or invest in Chinese stocks because they look \"cheap\" or have great growth potential.  And time and again, these same Chinese stocks are outperformed by American counterparts with tons less risk and no threat of CCP sword of damocles over their heads.  Had you invested in Microsoft, Google, FB, or any FANG, you would have outperformed these Chinese stocks dramatically.\n\nJust because China is economically powerful doesn't mean you, especially an international investor, get to benefit.  The CCP's goal is for China to become more powerful at your expense, not your gain.",
        "created_utc": 1633297097,
        "id": "hf9z151",
        "permalink": "/r/investing/comments/q0qrd3/investing_in_china_outlook_in_the_short_term_or/hf9z151/",
        "score": 331,
        "subreddit": "investing",
        "created": 1633325897.0
    },
    {
        "author": "KanteWorkRate",
        "body": "Keeping my eye on GOOGL and MSFT",
        "created_utc": 1633359879,
        "id": "hfcw3k9",
        "permalink": "/r/stocks/comments/q175du/what_are_you_buying_today/hfcw3k9/",
        "score": 212,
        "subreddit": "stocks",
        "created": 1633388679.0
    },
    {
        "author": "coolcomfort123",
        "body": "Been buying msft, googl, aapl and nvda this week, long term holding investors will be rewarded.",
        "created_utc": 1633194088,
        "id": "hf48kv9",
        "permalink": "/r/stocks/comments/pzymm1/september_is_over_lets_all_throw_a_party/hf48kv9/",
        "score": 86,
        "subreddit": "stocks",
        "created": 1633222888.0
    },
    {
        "author": "NodeDotSwift",
        "body": "Intels biggest problem isn’t AMD, it’s ARM. There is no way they don’t lose major market share to ARM in PCs and servers over next 5-10 years. ARM advantage in power efficiency, heat and cost is huge right now.\n\nAmazon ARM based Graviton is by far the fastest growing server architecture. And Intel lost 20M units a year when Apple (who never used AMD) switched to Apple Silicon.\n\nMicrosoft and other PC venders are actively building their own high performance ARM processors just to ensure their laptops can keep up with the M1.",
        "created_utc": 1633216226,
        "id": "hf5nfpq",
        "permalink": "/r/ValueInvesting/comments/q02p4v/intel/hf5nfpq/",
        "score": 48,
        "subreddit": "ValueInvesting",
        "created": 1633245026.0
    },
    {
        "author": "paq12x",
        "body": "Bough 40 SHOP, 100 FB.  Looking hard at MSFT, AAPL.",
        "created_utc": 1633360450,
        "id": "hfcxe7n",
        "permalink": "/r/stocks/comments/q175du/what_are_you_buying_today/hfcxe7n/",
        "score": 47,
        "subreddit": "stocks",
        "created": 1633389250.0
    },
    {
        "author": "Rich_Nectarine1481",
        "body": "-14% from September is not insignificant. And more than other major tech such as Microsoft and Google. I don't see how comparing it to Square makes sense.",
        "created_utc": 1633371651,
        "id": "hfdq6az",
        "permalink": "/r/stocks/comments/q1a8ux/facebook_down_down_down/hfdq6az/",
        "score": 33,
        "subreddit": "stocks",
        "created": 1633400451.0
    },
    {
        "author": "OSRSkarma",
        "body": "THE FACT THAT ALL THESE COMPANIES ARE ACTUAL ON SALE LIKE NVIDIA AND MSFT….\n\nAND YOU ARE STILL BUYING SHIT LIKE WISH AND SDC…..\n\nDO YOU LIKE BURNING MONEY OR ARE YOU JUST STUPID?",
        "created_utc": 1633367604,
        "id": "hfdfaqj",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfdfaqj/",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1633396404.0
    },
    {
        "author": "ArthurMorganJr",
        "body": "GME holding stronger than AMZN MSFT FB BABA etc. Lol",
        "created_utc": 1633361934,
        "id": "hfd0sa8",
        "permalink": "/r/wallstreetbets/comments/q12dpa/daily_popular_tickers_thread_for_october_04_2021/hfd0sa8/",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1633390734.0
    },
    {
        "author": "pastrydoe",
        "body": "Can you really compare Alibaba to Microsoft?",
        "created_utc": 1633321549,
        "id": "hfbcskz",
        "permalink": "/r/investing/comments/q0qrd3/investing_in_china_outlook_in_the_short_term_or/hfbcskz/",
        "score": 18,
        "subreddit": "investing",
        "created": 1633350349.0
    },
    {
        "author": "PapaCharlie9",
        "body": "The key to successful Wheel trading is stock selection. You basically want underlyings that go up on average on roughly 60 day charts. Small periods of sideways movement or short term dips are fine, but sustained downward movements, or big moves down with a new resistance level that is made out of titanium steel is a disaster for a wheel.\n\nAs already noted in another reply, SPY isn't ideal for Wheels for pretty much the reason you already said: since SPY is well diversified, on average SPY is less risky and less risk means less reward. The risk premium on SPY is therefore relatively low.\n\nUsually the best Wheel stocks are dividend paying blue chips, like AAPL, MSFT, JNJ, BLK, XOP, etc. Most people can't afford to wheel those stocks, though, so you need to find lower cost stocks that still have solid growth potential in the short term. Not meme stocks, that's a volatility play. You want steady and predictable, not boom or bust.",
        "created_utc": 1633206988,
        "id": "hf52gbi",
        "permalink": "/r/options/comments/q01in9/should_start_the_wheel_now_or_wait_till_i_can/hf52gbi/",
        "score": 15,
        "subreddit": "options",
        "created": 1633235788.0
    },
    {
        "author": "Aomarvel",
        "body": "Msft, massive soft fat titties",
        "created_utc": 1633196724,
        "id": "hf4esm0",
        "permalink": "/r/wallstreetbets/comments/pzzq5j/describe_a_stockcompany_badly_humor_post/hf4esm0/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1633225524.0
    },
    {
        "author": "bagelwhore_x0",
        "body": "Day trade SPY options. Slight OTM or ATM calls and puts. Or buy MSFT shares and sell weekly calls.",
        "created_utc": 1633298461,
        "id": "hfa272o",
        "permalink": "/r/StockMarket/comments/q0rptk/how_do_you_invest_100000/hfa272o/",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1633327261.0
    },
    {
        "author": "gripshoes",
        "body": "MSFT and COST\n\nIf we continue dipping I'll sell SPY short puts",
        "created_utc": 1633361184,
        "id": "hfcz2gb",
        "permalink": "/r/stocks/comments/q175du/what_are_you_buying_today/hfcz2gb/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1633389984.0
    },
    {
        "author": "Captain_Yolo_",
        "body": "Load MSFT calls, Halo infinite big team battle was fucking sweet. I used a plasma to launch a warthog in the air, grapple to its momentum, and flew across the map just to bonk some poor bastard on the head with a gravity hammer.",
        "created_utc": 1633297792,
        "id": "hfa0nvx",
        "permalink": "/r/wallstreetbets/comments/q0phh1/what_are_your_moves_tomorrow_october_04_2021/hfa0nvx/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1633326592.0
    },
    {
        "author": "lilred7879",
        "body": "Looking at more NVDA, TTD, and MSFT but I am thinking of waiting a little more to see how bad the pain gets for some. Meanwhile my conservative dividend portion is enjoying the new found attention and I might have to sell some off to those who are seeking some protection.",
        "created_utc": 1633369900,
        "id": "hfdlgb0",
        "permalink": "/r/stocks/comments/q175du/what_are_you_buying_today/hfdlgb0/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1633398700.0
    },
    {
        "author": "MUPleasFlyAgain",
        "body": "Ngl, swing trading GME is some ass clenching shit. I'm sticking to SPY fds and MSFT leaps for the sake of my heart.",
        "created_utc": 1633346246,
        "id": "hfc6r34",
        "permalink": "/r/wallstreetbets/comments/q12dpa/daily_popular_tickers_thread_for_october_04_2021/hfc6r34/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1633375046.0
    },
    {
        "author": "RamboWarFace",
        "body": "Holy shit guys...i got the vaccine and somehow i just looked and saw my whole portfolio is MSFT and my cost basis is 300+.....",
        "created_utc": 1633138087,
        "id": "hf1njry",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf1njry/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1633166887.0
    },
    {
        "author": "PlumJuiceDrink",
        "body": "I Finally went big into VOO , QQQ , and doubled down on MSFT and AAPL.  \n\n\nI. AM. SORRY.",
        "created_utc": 1633359046,
        "id": "hfcu7tw",
        "permalink": "/r/stocks/comments/q12102/rstocks_daily_discussion_monday_oct_04_2021/hfcu7tw/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1633387846.0
    },
    {
        "author": "bagelwhore_x0",
        "body": "AAPL, MSFT, NVDA. Don't choose speculative growth stocks for LEAPS",
        "created_utc": 1633092736,
        "id": "heyx157",
        "permalink": "/r/options/comments/pyycls/best_leaps_for_2024/heyx157/",
        "score": 9,
        "subreddit": "options",
        "created": 1633121536.0
    },
    {
        "author": "tahopg",
        "body": "I like microsoft more than apple but to each his own",
        "created_utc": 1633350393,
        "id": "hfcd3cr",
        "permalink": "/r/ValueInvesting/comments/q147p3/i_did_a_dcf_valuation_of_apple_and_it_looks/hfcd3cr/",
        "score": 9,
        "subreddit": "ValueInvesting",
        "created": 1633379193.0
    },
    {
        "author": "veilwalker",
        "body": "MSFT needs the price to be lower before they start buying.",
        "created_utc": 1633098743,
        "id": "hez9iw9",
        "permalink": "/r/wallstreetbets/comments/pz95jd/when_r1t_just_kidding_lesson_to_be_learned_never/hez9iw9/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1633127543.0
    },
    {
        "author": "MajesticNectarine",
        "body": "Closed my position in FB. Don’t see them ever moving up like Google and Microsoft have this year if they continue to routinely deal with privacy and whistleblower issues. Severely underperforming most of the major tech companies YTD. No thanks!",
        "created_utc": 1633370245,
        "id": "hfdme1z",
        "permalink": "/r/stocks/comments/q12102/rstocks_daily_discussion_monday_oct_04_2021/hfdme1z/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1633399045.0
    },
    {
        "author": "rozodots",
        "body": "I think the question to ask your wife is \"What suggestions did they have for going long in?\"  -- their insight of investing may be limited to headlines seen on the default page of Microsoft Edge browser.  \n\nI feel like it may have been a convo your wife mentioned about you investing and they said that in banter, and not as meaningful advice on.      Don't be an emotional investor.  \n\nI'm a newbie myself but just putting myself in your shoes.\n\nIf you believe the USA will be here a hundred years from now, then you believe in the market in the future.  There is less pain when, in a few years time, you'll know you DCA'd down when the market was bloody rather than give into the fear, avoid, and maybe even lose dollars and sanity trying to FOMO back in.",
        "created_utc": 1633115083,
        "id": "hf0b958",
        "permalink": "/r/stocks/comments/pzcpjj/wife_is_freaking_out_about_oct_19_debt_ceiling/hf0b958/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1633143883.0
    },
    {
        "author": "NinjamonkeyDoDG3",
        "body": "Fuck you MSFT I'm never using a computer EVER again",
        "created_utc": 1633359141,
        "id": "hfcuffm",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfcuffm/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633387941.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "Don’t listen to these fools. Invest early and often, that’s key. Some good solid stocks to start with are companies like MasterCard or Visa, Adobe, Microsoft, Apple, Berkshire Hathaway BRKB, Google (alphabet). ETFs are good for starters too, ppl tend to like SPY, VTI and VOO. Do some research (outside of reddit, like on seeking alpha, investopedia, motley fool etc) and hop in some positions and start compounding your money. Don’t blow your whole wad though keep cash aside to buy more as you learn more and to buy the dip ofc.",
        "created_utc": 1633308655,
        "id": "hfanu3z",
        "permalink": "/r/StockMarket/comments/q0ttbx/new_to_stocks_any_tips/hfanu3z/",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1633337455.0
    },
    {
        "author": "VerbalJoker",
        "body": "Thanks to the dip, I now have a portfolio of \nAAPL, MSFT, MCD, JNJ, NKE, NVDA, QQQ, CSU, ADBE. \n\nSee y’all in 20 years",
        "created_utc": 1633363235,
        "id": "hfd3yb8",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfd3yb8/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633392035.0
    },
    {
        "author": "culculain",
        "body": "MSFT holder for life. Boring investing is the way. If you're looking for a little spice write some covered calls on your SPY. Emotional hedge against a downturn",
        "created_utc": 1633365889,
        "id": "hfdarru",
        "permalink": "/r/investing/comments/q17pp5/the_motley_fool_suggests_buy_and_sell/hfdarru/",
        "score": 8,
        "subreddit": "investing",
        "created": 1633394689.0
    },
    {
        "author": "OKCompE",
        "body": "Other thing I would warn is that Facebook is probably at greatest risk of regulation of the three companies. One could argue about how great that risk really is, given how much lobbying they are doing, but I'd still say they are at greatest risk among AAPL, MSFT, and FB.",
        "created_utc": 1633352071,
        "id": "hfcfxbw",
        "permalink": "/r/ValueInvesting/comments/q147p3/i_did_a_dcf_valuation_of_apple_and_it_looks/hfcfxbw/",
        "score": 8,
        "subreddit": "ValueInvesting",
        "created": 1633380871.0
    },
    {
        "author": "Calm_Leek_1362",
        "body": "Tsm is strong because nobody wants to make the chips, they just want to design and sell them. Arm, amd, Nvidia, and now Apple and msft all rely on tsm and Samsung to actually make them. \nIntel has said they want to sell more capacity like this, but like all the other changes the new ceo wants to make, it's years away.",
        "created_utc": 1633368576,
        "id": "hfdhvep",
        "permalink": "/r/StockMarket/comments/q17xof/intel_vs_amd_vs_nvidia_looking_for_a_chip_stock/hfdhvep/",
        "score": 7,
        "subreddit": "StockMarket",
        "created": 1633397376.0
    },
    {
        "author": "Poka-yoke1",
        "body": "Microsoft cocks",
        "created_utc": 1633206755,
        "id": "hf51wwc",
        "permalink": "/r/wallstreetbets/comments/q02nar/im_trader_of_something_else_now/hf51wwc/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633235555.0
    },
    {
        "author": "spyaintnobitch",
        "body": "MSFT 😎",
        "created_utc": 1633366461,
        "id": "hfdca3r",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfdca3r/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633395261.0
    },
    {
        "author": "wsb202009",
        "body": "&gt;Facebook Google Microsoft and Amazon\n\nAnd AAPL",
        "created_utc": 1633088730,
        "id": "heyq6n2",
        "permalink": "/r/stocks/comments/pyx2gr/quality_stocks_at_a_discount/heyq6n2/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1633117530.0
    },
    {
        "author": "RH_Fucked_My_Account",
        "body": "I love you Microsoft \n\nFuck you Apple! 🖕",
        "created_utc": 1633097622,
        "id": "hez70ni",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hez70ni/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1633126422.0
    },
    {
        "author": "asdfadffs",
        "body": "I’m gonna assume you read some article about how interest rates will hit tech hard. It’s partly true, small, medium and (some) large sized tech companies have a really unhealthy debt ratios. \n\nHowever, debt is and have been so damn cheap and why Google or MSFT should be punished for holding debt is beyond me as they could quite simply change their capital structure over a year or two, I’m even gonna bet they already started working on it. \n\nSo, I’d be worried about smaller companies with high debt and bad cash flows. The mega cap ones, not so much.",
        "created_utc": 1633222011,
        "id": "hf60bip",
        "permalink": "/r/stocks/comments/q056if/tech_heavy_20_cash_what_to_do/hf60bip/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1633250811.0
    },
    {
        "author": "RGJ5",
        "body": "I mean “crashed down in value” is a little extreme I also own Microsoft and apple and they dropped like 6-9%, not sure about Shopify but I’m still buying apple and Microsoft stock, if you can’t handle drops like this imagine in a real recession, invest in what you can loose and don’t look at your stocks everyday",
        "created_utc": 1633364491,
        "id": "hfd75ea",
        "permalink": "/r/stocks/comments/q17yls/im_losing_pretty_heavily_on_my_investments_are/hfd75ea/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1633393291.0
    },
    {
        "author": "jesusespenis",
        "body": "Imagine not loading up on MSFT when it dipped to $281",
        "created_utc": 1633113633,
        "id": "hf07xku",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hf07xku/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633142433.0
    },
    {
        "author": "Timewasted11222",
        "body": "And she was personally responsible for giving Microsoft a 3 billion dollar contract. Right before she bought a million dollars in options",
        "created_utc": 1633181239,
        "id": "hf3gbho",
        "permalink": "/r/wallstreetbets/comments/pzoj8p/could_we_get_a_arkp_etf_that_tracks_nancy_pelosis/hf3gbho/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633210039.0
    },
    {
        "author": "apooroldinvestor",
        "body": "2000 was a long time ago! Tech was not as ubiquitous as today and wasn't generating the profits it is as today.\n\nBecause I like the stocks I have.  Tech will continue to dominate.  It's a new world.  What else to invest in?\n\nIf I had put $10k in ASML in 2011 I'd be sitting on $260k.  I coulda paid off my house! End of story for me.  PG or the sp500 wouldnt of done that for me sorry.\n\nI watch my stvoks.  If they go out of favor eventually I'll take my profits and move on to othwr things.\n\nMSFT GOOGL NVDA are only goin up for years to  come.  If I'm wrong then so be it.  Who cares? We all die in the end.",
        "created_utc": 1633221328,
        "id": "hf5yry1",
        "permalink": "/r/stocks/comments/q056if/tech_heavy_20_cash_what_to_do/hf5yry1/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1633250128.0
    },
    {
        "author": "Chiinoe",
        "body": "Fuuuuck. My googl and msft calls would've printed too. I'll never forgive you gay bers for swaying my conviction.",
        "created_utc": 1633113162,
        "id": "hf06un5",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hf06un5/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633141962.0
    },
    {
        "author": "spyaintnobitch",
        "body": "AAPL becoming MSFT faster than MSFT can become AAPL",
        "created_utc": 1633279345,
        "id": "hf8rbkl",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf8rbkl/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633308145.0
    },
    {
        "author": "polonaisefantaisie",
        "body": "Did AAPL MSFT go bankrupt and stopped making money",
        "created_utc": 1633363687,
        "id": "hfd53gc",
        "permalink": "/r/stocks/comments/q12102/rstocks_daily_discussion_monday_oct_04_2021/hfd53gc/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1633392487.0
    },
    {
        "author": "Shaun8030",
        "body": "ETFs \n\nQQQ\nVGT\nQQQJ\nARKW\nSMH \nTQQQ\nBTC \n\nStocks\n\nApple \nAmzn \nGOOG \nMSFT\nFB\nMA\nDis\nAdbe\nQCOM\nShop \nSquare\nPayPal \nAmd\nTsm\nTsla\nNvda",
        "created_utc": 1633183599,
        "id": "hf3l348",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hf3l348/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1633212399.0
    },
    {
        "author": "halfmanhalfrobot69",
        "body": "DIS, MSFT, GOOG all looking juicy",
        "created_utc": 1633277438,
        "id": "hf8mwdj",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf8mwdj/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633306238.0
    },
    {
        "author": "Eastern-Investment39",
        "body": "Microsoft Excel?",
        "created_utc": 1633306965,
        "id": "hfakev4",
        "permalink": "/r/StockMarket/comments/q0pq1n/really_sums_it_up/hfakev4/",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1633335765.0
    },
    {
        "author": "Aaron0716",
        "body": "Microsoft just looking around wondering why all his friends are dead",
        "created_utc": 1633101140,
        "id": "hezey3z",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hezey3z/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633129940.0
    },
    {
        "author": "plantsarehealthy",
        "body": "Microsoft is strong",
        "created_utc": 1633108818,
        "id": "hezwuuf",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hezwuuf/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633137618.0
    },
    {
        "author": "TonyP321",
        "body": "Windows on ARM is currently not good and won't be in the next few years, it's usable but it's still not there. It's hard to predict what happens after 5 years but I wouldn't count out Intel and x86 architecture. x86 laptops have already a similar battery life compared to ARM laptops while having a better performance. Also, Microsoft nor other PC vendors (except for Samsung maybe) are not building their own ARM processors at the moment. Qualcomm is the only player right now and they didn't have great offerings lately, particularly for WoA. AMD is rumored to join Samsung but only for mRDNA 2 GPUs, not CPUs which would be built by Samsung, and their mobile CPUs pale compared to Qualcomm.",
        "created_utc": 1633254931,
        "id": "hf7i0h5",
        "permalink": "/r/ValueInvesting/comments/q02p4v/intel/hf7i0h5/",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1633283731.0
    },
    {
        "author": "coolcomfort123",
        "body": "falling knives club is good, bought msft, googl, nvda and aapl for this week.",
        "created_utc": 1633230269,
        "id": "hf6heq7",
        "permalink": "/r/stocks/comments/q06f4p/falling_knives_club/hf6heq7/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1633259069.0
    },
    {
        "author": "bucketslayer",
        "body": "msft said fuk ur dip",
        "created_utc": 1633101324,
        "id": "hezfda7",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hezfda7/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633130124.0
    },
    {
        "author": "jesusespenis",
        "body": "MSFT Big 🅿️🅿️",
        "created_utc": 1633108791,
        "id": "hezwsof",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hezwsof/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633137591.0
    },
    {
        "author": "MUPleasFlyAgain",
        "body": "So how many times in a row did MSFT \"predicted\" a correction and announced a share buyback? Why risk going to jail for insider trading when you can just buy puts on different companies after MSFT announces a share buyback program?",
        "created_utc": 1633346459,
        "id": "hfc71x0",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfc71x0/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633375259.0
    },
    {
        "author": "Anth916",
        "body": "One nice thing about HYLN is that the CEO seems totally legit. Fully committed and not a slimeball or scamster. I don't currently own any shares, but I'm rooting for this company longterm because he seems like such a genuinely good natured fellow.\n\nI've daytraded and swing traded the stock a few times. Buying the stock at it's price right now, (around 8 bucks), seems like a screaming steal. You can be conservative with it, and just ride it from $8 to $12. The only real problem is that I do think we're headed for a major correction which is going to see huge megacaps like AMZN, MSFT, AAPL, NVDA all down 20 to 25 percent off their all time highs, and what does that mean for a tiny company like HYLN? Could HYLN drop all the way to say 6 bucks a share if the entire market tanks?\n\nThat's really my only hesitation in loading the boat on HYLN. I will say this though, if the market does indeed tank, and HYLN drops to $6, it will be time to buy as many shares as I possibly can stomach. This stock will see the high teens in price before too long, no question.",
        "created_utc": 1633276854,
        "id": "hf8lji4",
        "permalink": "/r/stocks/comments/q06f4p/falling_knives_club/hf8lji4/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1633305654.0
    },
    {
        "author": "TODO_getLife",
        "body": "Bought some MSFT and JPM. Sold Roblox.\n\nThree big marks on this portfolio are Chargepoint, Zillow and INRG/ICLN. Basically bought the top of all three. It ain't good.",
        "created_utc": 1633098222,
        "id": "hez8cso",
        "permalink": "/r/stocks/comments/pz4fx4/rstocks_daily_discussion_fundamentals_friday_oct/hez8cso/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633127022.0
    },
    {
        "author": "MoRegrets",
        "body": "They are not software as a service. They are the service needed to run software as a service. They are basically providing the knowledge to implement and run Microsoft cloud services.",
        "created_utc": 1633108535,
        "id": "hezw7im",
        "permalink": "/r/SPACs/comments/pz2m73/announcements_x_daily_discussion_for_friday/hezw7im/",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1633137335.0
    },
    {
        "author": "Green_Lantern_4vr",
        "body": "MSFT - All your base are belong to us",
        "created_utc": 1633201312,
        "id": "hf4pd6z",
        "permalink": "/r/wallstreetbets/comments/pzzq5j/describe_a_stockcompany_badly_humor_post/hf4pd6z/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633230112.0
    },
    {
        "author": "SnipahShot",
        "body": "Apple and Microsoft would like to as well.",
        "created_utc": 1633372738,
        "id": "hfdt3tr",
        "permalink": "/r/stocks/comments/q1a8ux/facebook_down_down_down/hfdt3tr/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633401538.0
    },
    {
        "author": "MovieMuscle25",
        "body": "Thinking of reshuffling my portfolio to look something like this:\n\n20K into MSFT\n\n20K into SE\n\n20K into TGT or AXP\n\n20K into CRWD",
        "created_utc": 1633205585,
        "id": "hf4z6jf",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hf4z6jf/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633234385.0
    },
    {
        "author": "Amplemann",
        "body": "I've had 401k accounts that I almost never look at for years, but I decided to start investing separately from the 401k in August. Since I started, I saw my portfolio go up slightly, but now it has been plummeting ever since. It's not very reassuring to do something \"smart\" with my money and then just watch it go further red. Did I just get in at a bad time???\n\n&amp;#x200B;\n\n(I'm mostly invested in VOO, but also some very small positions in well-established companies like Apple, Disney, Microsoft, etc.)",
        "created_utc": 1633099631,
        "id": "hezbh3k",
        "permalink": "/r/investing/comments/pz43iq/daily_general_discussion_and_spitballin_thread/hezbh3k/",
        "score": 4,
        "subreddit": "investing",
        "created": 1633128431.0
    },
    {
        "author": "Cal4mity",
        "body": "I need a 1.5% day from Microsoft\n\nAsap",
        "created_utc": 1633088999,
        "id": "heyqlv7",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/heyqlv7/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633117799.0
    },
    {
        "author": "Jumpdeckchair",
        "body": "My dad wants me to help him with options because he thinks its a good idea. I tried to tell him he will lose his money. Told him to theta gang but he wants to gamble.\n\nLong story short he is now gonna be playing MSFT run up to earnings this month.\n\nTold him expect a return of -100%",
        "created_utc": 1633233605,
        "id": "hf6nnh8",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf6nnh8/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633262405.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Buy msft aapl GOOGL instead",
        "created_utc": 1633312700,
        "id": "hfaw5ck",
        "permalink": "/r/stocks/comments/q0tftm/is_t_a_buy_right_now/hfaw5ck/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633341500.0
    },
    {
        "author": "InanetV",
        "body": "This is exactly why I tell all my friends to invest in MSFT, AAPL, etc. These companies actually do buybacks and are basically their own money printer.",
        "created_utc": 1633134075,
        "id": "hf1fgml",
        "permalink": "/r/stocks/comments/pzk05h/rising_bond_yields_what_they_mean_and_how_to_play/hf1fgml/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633162875.0
    },
    {
        "author": "wsb202009",
        "body": "Nope !  Normally, they dip appx once in 4 or 6 months.\n\nBoth are gushing profits qtr after qtr.\n\nIt is rare to see AAPL and MSFT dips.Now, both are dipped, nice time to enter in.\n\nSee how my close friend holding AAPL [https://imgur.com/WiY7DLA](https://imgur.com/WiY7DLA)\n\nHe even defeated Warren Buffet in getting into AAPL early. He was not an employee of AAPL anytime in his life !",
        "created_utc": 1633092395,
        "id": "heyweak",
        "permalink": "/r/stocks/comments/pyx2gr/quality_stocks_at_a_discount/heyweak/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633121195.0
    },
    {
        "author": "Moon_Captian",
        "body": "THIS is why you always use a different password for email accounts. Think they got all the email/passwords from microsoft hack. Some guy from India got mine (live account). Live also stores recovery email addys. He took over an old Amazon account. Called my wife and threatned to \"wack\" her if she didnt send money.\nHe called me and said I had won an entry on \"the price is right\".\nPlayed along for a while, wasting his time. \nHe never called again. Added phone verification to everything.",
        "created_utc": 1633138142,
        "id": "hf1nnpu",
        "permalink": "/r/stocks/comments/pzf6af/coinbase_hacked_funds_from_least_6000_customers/hf1nnpu/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633166942.0
    },
    {
        "author": "Jay4usc",
        "body": "Don’t sell!  Wait it out.  I myself have Apple, Microsoft, and Nike and they are kicking my ass but they I’ll eventually rebound",
        "created_utc": 1633364124,
        "id": "hfd6768",
        "permalink": "/r/stocks/comments/q17yls/im_losing_pretty_heavily_on_my_investments_are/hfd6768/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633392924.0
    },
    {
        "author": "That_Fun_1811",
        "body": "AAPL,MSFT,TGT,JNJ",
        "created_utc": 1633367723,
        "id": "hfdfll1",
        "permalink": "/r/stocks/comments/q175du/what_are_you_buying_today/hfdfll1/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633396523.0
    },
    {
        "author": "AdministrativeYard",
        "body": "Thanks Microsoft",
        "created_utc": 1633101924,
        "id": "hezgquy",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hezgquy/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1633130724.0
    },
    {
        "author": "TheJoker516",
        "body": "Dump money in an ETF like VOO that tracks the S&amp;P500 on the same date every month. Individual stocks are a bit more risky, but if you want, take a look around you. Costco is full of people from open to close, the lines at McDonalds are very long, no matter how lousy their burgers are lol. Try to find businesses with wide moats- MSFT, GOOGL, ADBE. Find companies with strong branding- Apple, Nike, HomeDepot, Tesla.. Be careful with speculative stocks- Palintir, Coinbase, AirBNB, Draftkings",
        "created_utc": 1633285625,
        "id": "hf96sai",
        "permalink": "/r/stocks/comments/q0lnc5/help_getting_started/hf96sai/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633314425.0
    },
    {
        "author": "jaympatel1893",
        "body": "Rolled over my MSFT AAPL SPY from 2023 to 2024\nAlso, NIO",
        "created_utc": 1633073385,
        "id": "hey84bp",
        "permalink": "/r/options/comments/pyycls/best_leaps_for_2024/hey84bp/",
        "score": 3,
        "subreddit": "options",
        "created": 1633102185.0
    },
    {
        "author": "DoDaOpposite",
        "body": "Why not just hold XLK if you want that much exposure to mega tech stocks?  And since you \"know\" those companies will go up long term, dont bother reading below.  I only post it for others that may not be so.... arrogant.\n\n\"Among the largest 15 companies in the index ( they are talking NASDAQ ) back in 2000, only four remain in the top 15 today: Microsoft, Cisco, Intel and Qualcomm.\n\nOver the entire 781-week period, only Qualcomm and Microsoft stocks had   \npositive returns -- up 1.54% and 1.34% annually, respectively. Cisco's   \nstock had a cumulative return of -52.5% (-4.8% annually) and Intel was   \ndown 24.63% (-1.9% annually).\"",
        "created_utc": 1633218104,
        "id": "hf5rncx",
        "permalink": "/r/stocks/comments/q056if/tech_heavy_20_cash_what_to_do/hf5rncx/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633246904.0
    },
    {
        "author": "errolio",
        "body": "Throw in a couple MSFT 200c for good measure 🐻",
        "created_utc": 1633210838,
        "id": "hf5b922",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf5b922/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633239638.0
    },
    {
        "author": "muchdave",
        "body": "Im really impressed by some of your picks. Especially OXY, I think this will do well for you in the near to medium term. HPQ might be worthwhile looking at instead of HPE. \n\nDon’t listen to the 100% broad ETF recommendations. You’ll learn nothing from it. A bit in ETF’s make sense in which case you could swap out some of the individual stocks. E.g. VOO rather than holding T, APPL, MSFT, NKE. ARKK rather than TSLA.\nIt’ll de-risk it a little bit. Aside from that congrats, this is a great start.",
        "created_utc": 1633159675,
        "id": "hf2lzsh",
        "permalink": "/r/StockMarket/comments/pze4ud/hey_im_16_and_been_investing_for_a_little_over_a/hf2lzsh/",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633188475.0
    },
    {
        "author": "AlternativeAd3459",
        "body": "What y’all think of AAPL and MSFT 2024 leaps",
        "created_utc": 1633373582,
        "id": "hfdve0j",
        "permalink": "/r/stocks/comments/q12102/rstocks_daily_discussion_monday_oct_04_2021/hfdve0j/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633402382.0
    },
    {
        "author": "Positive_Increase",
        "body": "Considering their CEO didn't grow up in a culture with business ethics, we shouldn't be surprised.  I was.  I actually fell for that lie from Microsoft.",
        "created_utc": 1633355620,
        "id": "hfcmqar",
        "permalink": "/r/stocks/comments/q0y9fz/microsoft_set_to_release_windows_11_tomorrow/hfcmqar/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633384420.0
    },
    {
        "author": "SKIman182",
        "body": "what do you mean comeback. MSFT was literally at all time highs 2-3 weeks ago. In fact, MSFT is quite literally one of the few stocks that goes up every single quarter",
        "created_utc": 1633352167,
        "id": "hfcg3k3",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfcg3k3/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633380967.0
    },
    {
        "author": "Telkorenar",
        "body": "&gt;MSFT has to come back eventually\n\nUnless the world ends, yes, MSFT will be back and likely setting new highs this month.",
        "created_utc": 1633352128,
        "id": "hfcg12m",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfcg12m/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633380928.0
    },
    {
        "author": "Jumpdeckchair",
        "body": "He is torn between SPY leaps and MSFT after discussing them with him. \n\nHe asked what I'm doing and I told him 0dte SPY got me a 300% gain in like 15 minutes last week lol",
        "created_utc": 1633233792,
        "id": "hf6nze0",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf6nze0/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633262592.0
    },
    {
        "author": "newuserincan",
        "body": "Thanks for post and very thought provoking \n\nQuestion: how do think MSFT,GOOGL,AAPL those large cap high tech? I would think it's better investment than traditional value stocks",
        "created_utc": 1633132517,
        "id": "hf1cb2j",
        "permalink": "/r/stocks/comments/pzk05h/rising_bond_yields_what_they_mean_and_how_to_play/hf1cb2j/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633161317.0
    },
    {
        "author": "cybersecurityrick",
        "body": "And yet companies like aapl or msft, intc or orcl got absolutely smashed",
        "created_utc": 1633220458,
        "id": "hf5wu0m",
        "permalink": "/r/options/comments/q043uv/put_options_on_margin/hf5wu0m/",
        "score": 3,
        "subreddit": "options",
        "created": 1633249258.0
    },
    {
        "author": "Dangerous_Contact439",
        "body": "agree. doing this with speculative stocks would be stupidity. AAPL wouldnt necessarily fit that bill - for Aapl, MSFT, CRM etc to be falling like a knife multiple businesses should be failing at once.",
        "created_utc": 1633212319,
        "id": "hf5emlp",
        "permalink": "/r/options/comments/q043uv/put_options_on_margin/hf5emlp/",
        "score": 3,
        "subreddit": "options",
        "created": 1633241119.0
    },
    {
        "author": "Dinglejingle88",
        "body": "Worked for me. Dumped my MSFT, SPY and SPXL holdings August 31st. Spy peaked for the month two days later",
        "created_utc": 1633084298,
        "id": "heyk3i7",
        "permalink": "/r/stocks/comments/pywjz8/sell_the_peak_remember_the_other_side_of_buying/heyk3i7/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633113098.0
    },
    {
        "author": "fountn",
        "body": "would be wild to see AAPL and MSFT trade market cap positions",
        "created_utc": 1633097408,
        "id": "hez6jum",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hez6jum/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633126208.0
    },
    {
        "author": "not_that_kind_of_dr-",
        "body": "&gt;They are the service needed to run software as a service.\n\nThey are an *optional* service that *might* let you have an easier time running software as a service.\n\nFixed it for you. (You weren't harsh enough ;-) )\n\nThey might make money if Microsoft continues exactly as is. They go out of business if Microsoft makes their interface easier to use. The stock might be a big win if Microsoft decides to buy them out at a premium.\n\nSo I'm not saying it's trash. But I personally am not at all interested, and I don't think most of the buyers understand, as you clarified, that they aren't 'SaaS', that they aren't even picks and diversity shovels for 'SaaS'. They are more like comfy rubber grips for your picks and shovels. Highly optional and tertiary.",
        "created_utc": 1633111036,
        "id": "hf01ymb",
        "permalink": "/r/SPACs/comments/pz2m73/announcements_x_daily_discussion_for_friday/hf01ymb/",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1633139836.0
    },
    {
        "author": "imsilver4fukyou",
        "body": "me in the pre market looking at my dole ![img](emote|t5_2th52|4640)\n\njumping into msft calls ![img](emote|t5_2th52|4641)",
        "created_utc": 1633103125,
        "id": "hezjj0p",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hezjj0p/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633131925.0
    },
    {
        "author": "NinjamonkeyDoDG3",
        "body": "If MSFT is green eod, I'm gonna nut on my computer. Mark my words",
        "created_utc": 1633074809,
        "id": "hey9oxw",
        "permalink": "/r/wallstreetbets/comments/pyrls8/what_are_your_moves_tomorrow_october_01_2021/hey9oxw/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633103609.0
    },
    {
        "author": "Andrej404",
        "body": "I got SBUX AAPL FB NVDA SPY next month I plan to buy MSFT, ADBE",
        "created_utc": 1633083592,
        "id": "heyj9a0",
        "permalink": "/r/options/comments/pyycls/best_leaps_for_2024/heyj9a0/",
        "score": 3,
        "subreddit": "options",
        "created": 1633112392.0
    },
    {
        "author": "MovieMuscle25",
        "body": "I feel like Apple might become stale sooner than MSFT can. I feel like they still have a long way to run with Azure and their many other services.",
        "created_utc": 1633225073,
        "id": "hf66wt2",
        "permalink": "/r/stocks/comments/pfpyxc/rate_my_portfolio_rstocks_quarterly_thread/hf66wt2/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633253873.0
    },
    {
        "author": "kippypapa",
        "body": "Microsoft is a good one to watch. It was overvalued recently so this drop will present buying opportunities.",
        "created_utc": 1633368533,
        "id": "hfdhr80",
        "permalink": "/r/stocks/comments/q17yls/im_losing_pretty_heavily_on_my_investments_are/hfdhr80/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633397333.0
    },
    {
        "author": "Different-Lychee-852",
        "body": "What value was overrated for msft? It seemed like 305 was a really solid position for at least 2 months",
        "created_utc": 1633371131,
        "id": "hfdos7d",
        "permalink": "/r/stocks/comments/q17yls/im_losing_pretty_heavily_on_my_investments_are/hfdos7d/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633399931.0
    },
    {
        "author": "reliability_validity",
        "body": "I agree - their Hedge Fund performs almost exactly the same as NASDAQ and SPY because their top stocks are Apple and Microsoft. No surprise there. This is evidence to me that the MF Hedge Fund is not pumping and dumping.\n\nBut it is common knowledge to MFSA users that the Stock Advisor is more aggressive than the hedge fund, and has tended to perform better than the hedge fund. Again, this could just be the right method during the economies change to tech, and boil down to luck.\n\n[https://www.reddit.com/r/stocks/comments/n2hzd3/i\\_analyzed\\_all\\_the\\_motley\\_fool\\_premium/](https://www.reddit.com/r/stocks/comments/n2hzd3/i_analyzed_all_the_motley_fool_premium/)",
        "created_utc": 1633365838,
        "id": "hfdan0i",
        "permalink": "/r/investing/comments/q17pp5/the_motley_fool_suggests_buy_and_sell/hfdan0i/",
        "score": 3,
        "subreddit": "investing",
        "created": 1633394638.0
    },
    {
        "author": "dkrich",
        "body": "Bought puts in msft, penn and the iwm on Friday on that massive rally. I just wish they were cheaper. VIX being a stubborn bastard and staying above 20 is going to make it hard to make a lot of money in this implosion",
        "created_utc": 1633251833,
        "id": "hf7dzqf",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf7dzqf/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633280633.0
    },
    {
        "author": "apooroldinvestor",
        "body": "So what? Should I sell all my MSFT AAPL GOOGL NVDA cause some day companies can fail?  I might be dead in 10 years, who knows.",
        "created_utc": 1633271738,
        "id": "hf8a8zm",
        "permalink": "/r/stocks/comments/q056if/tech_heavy_20_cash_what_to_do/hf8a8zm/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633300538.0
    },
    {
        "author": "halfmanhalfrobot69",
        "body": "MSFT LEAPS FTW. \n\ncheap af right now",
        "created_utc": 1633233730,
        "id": "hf6nvfg",
        "permalink": "/r/wallstreetbets/comments/pzfvft/weekend_discussion_thread_for_the_weekend_of/hf6nvfg/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633262530.0
    },
    {
        "author": "ShadowLiberal",
        "body": "Please don't. You're making yourself much more vulnerable to malware by running an OS that Microsoft no longer supports and no longer updates.",
        "created_utc": 1633357390,
        "id": "hfcqif0",
        "permalink": "/r/stocks/comments/q0y9fz/microsoft_set_to_release_windows_11_tomorrow/hfcqif0/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633386190.0
    },
    {
        "author": "VerbalJoker",
        "body": "The shitty part is that we don’t know how long this pullback goes on for, but we know that bears have lost for 100 years and that won’t change. I’m gonna keep holding MSFT and see you in a couple years on my yacht in Paris.",
        "created_utc": 1633358589,
        "id": "hfct6nh",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfct6nh/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633387389.0
    },
    {
        "author": "Imperial_Eggroll",
        "body": "For today: NVDIA, AAPL, V, MSFT dip buys? Or just buy SPY",
        "created_utc": 1633369534,
        "id": "hfdkgkm",
        "permalink": "/r/stocks/comments/q12102/rstocks_daily_discussion_monday_oct_04_2021/hfdkgkm/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633398334.0
    },
    {
        "author": "Wild_Space",
        "body": "FB, GOOG, AAPL, AMZN, MSFT",
        "created_utc": 1633312966,
        "id": "hfawogi",
        "permalink": "/r/ValueInvesting/comments/q0safl/can_anyone_convince_me_that_snapchat_isnt/hfawogi/",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1633341766.0
    },
    {
        "author": "meiotta",
        "body": "MSFT: no stock in history has been treated more unfairly",
        "created_utc": 1633361861,
        "id": "hfd0mfo",
        "permalink": "/r/wallstreetbets/comments/q12dpj/daily_discussion_thread_for_october_04_2021/hfd0mfo/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633390661.0
    },
    {
        "author": "Gewoongary",
        "body": "Congrats on getting 20% lifetime discount on Microsoft products.",
        "created_utc": 1633114790,
        "id": "hf0akrp",
        "permalink": "/r/wallstreetbets/comments/pz4ta4/daily_discussion_thread_for_october_01_2021/hf0akrp/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633143590.0
    },
    {
        "author": "moaboulmagd",
        "body": "ADBE seems like a solid play, but need a lot of money. SBUX could be interesting too.\n\nFor FB, I own a 250 strike FB call June 2023 (already lost 20% on that one), so just selling a call against it (PMCC).\n\nAlso have 1 call in PATH and FUBO (more speculative plays), and I'm already almost 50% down in PATH, 40 strike Jan 2023 call. Collecting peanuts premium against it as well in the mean time. Oh well, at least my calls were all deep ITM plays.\n\nI think I'm learning to stick with NVDA, MSFT, SPY, and QQQ.",
        "created_utc": 1633215239,
        "id": "hf5l8yb",
        "permalink": "/r/options/comments/pyycls/best_leaps_for_2024/hf5l8yb/",
        "score": 2,
        "subreddit": "options",
        "created": 1633244039.0
    },
    {
        "author": "le_bib",
        "body": "Quarterhill (QTRH) just [settled a lawsuit with Motorola](https://www.newswire.ca/news-releases/wilan-signs-wireless-license-with-motorola-823526621.html). Amount is confidential but estimated to be $50M USD. \n\nThis is right in time to make it into Q3’s earnings.\n\nAnd a very good sign for the lawsuit against Apple that Quarthill [won for over $100M USD]( https://appleinsider.com/articles/20/06/17/apple-on-the-hook-for-109-million-to-patent-aggregator-wilan) and will be in appeal soon (hearings are on Oct 8th).\n\nFYI- Quarthill owns Wilan which owns a ton of wireless patents and IRD which operates in intelligent road system management. They recently acquired a major player in the USA with the [acquisition of TEC for $150M](https://www.quarterhill.com/news/news-details/2021/Quarterhill-Announces-Agreement-to-Acquire-ETC/default.aspx)\n\nMarket cap is $300M CAD, do the maths…",
        "created_utc": 1633094702,
        "id": "hez0uxk",
        "permalink": "/r/CanadianInvestor/comments/pz4t70/daily_discussion_thread_for_october_01_2021/hez0uxk/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1633123502.0
    },
    {
        "author": "Kind_Assistance2084",
        "body": "Just curious do you use stock charts indicators  like RSI MSI CSI MACD, any one of these would have told you to sell. However, firms are putting a buy on amc at 41$ with high volume",
        "created_utc": 1633102520,
        "id": "hezi4es",
        "permalink": "/r/wallstreetbets/comments/pz7d1u/try_momentum_stocks_they_said_buy_shares_they/hezi4es/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633131320.0
    },
    {
        "author": "le_bib",
        "body": "Quarterhill (QTRH) just [settled a lawsuit with Motorola](https://www.newswire.ca/news-releases/wilan-signs-wireless-license-with-motorola-823526621.html). Amount is confidential but estimated to be $50M USD. \n\nThis is right in time to make it into Q3’s earnings.\n\nAnd a very good sign for the lawsuit against Apple that Quarthill [won for over $100M USD]( https://appleinsider.com/articles/20/06/17/apple-on-the-hook-for-109-million-to-patent-aggregator-wilan) and will be in appeal soon (hearings are on Oct 8th).\n\nFYI- Quarthill owns Wilan which owns a ton of wireless patents and IRD which operates in intelligent road system management. They recently acquired a major player in the USA with the [acquisition of TEC for $150M](https://www.quarterhill.com/news/news-details/2021/Quarterhill-Announces-Agreement-to-Acquire-ETC/default.aspx)\n\nMarket cap is $300M CAD, do the maths…",
        "created_utc": 1633094702,
        "id": "hez0uxk",
        "permalink": "/r/CanadianInvestor/comments/pz4t70/daily_discussion_thread_for_october_01_2021/hez0uxk/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1633123502.0
    }
]