[
    {
        "author": "sportsmook",
        "body": "Yellen don’t hold those keys anymore \n\nThey are all Jeromes now",
        "created_utc": 1623041730,
        "id": "h0vkqio",
        "score": 185,
        "subreddit": "stocks",
        "created": 1623070530.0
    },
    {
        "author": "red_adept",
        "body": "game publishers don't want people re-selling their games.  They make no money that way.\n\nIn fact, that's the big thing about Digital downloads, steam keys and all that, you can't resell them.  Game companies LOVE that.",
        "created_utc": 1623266205,
        "id": "h16u7hy",
        "score": 97,
        "subreddit": "investing",
        "created": 1623295005.0
    },
    {
        "author": "DavesNotWhere",
        "body": "Thanks Chad. Leave the lambo keys outside the bedroom if you don't mind.",
        "created_utc": 1623716009,
        "id": "h1sjzdv",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1623744809.0
    },
    {
        "author": "danielharner",
        "body": "Don’t be a dick. It’s not as simple as pressing three keys. \n\nObviously OP will need to run task manager as admin and go to services. Sort by A-Z on service name, locate service named YOLO, right click on YOLO, left click Restart.",
        "created_utc": 1624656622,
        "id": "h31hs7b",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1624685422.0
    },
    {
        "author": "Skippycharger",
        "body": "They should just start handing the keys over to their company yacht for starters.",
        "created_utc": 1623350622,
        "id": "h1b91tt",
        "score": 29,
        "subreddit": "Wallstreetbetsnew",
        "created": 1623379422.0
    },
    {
        "author": "HotStockSlinger",
        "body": "They either got the keys off a server they took over or they are lying about recovering the money.  If they could actually crack the encryption and take the money there is no way they'd reveal that capability over a few million dollars.",
        "created_utc": 1623185612,
        "id": "h12okpv",
        "score": 25,
        "subreddit": "StockMarket",
        "created": 1623214412.0
    },
    {
        "author": "Gigidypaperhands",
        "body": "Remember these keys to investing:\n\n1. Good jobs report = stocks go down\n2. Bad jobs report = stocks go up\n3. Company you dont own shares in beats earnings = stock goes way up\n4. Company you do own shares in beats earnings = stock drills\n5. Inflation is priced in until it is no longer priced in\n6. Janet Yellen speaks = red",
        "created_utc": 1622827392,
        "id": "h0l8rtn",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1622856192.0
    },
    {
        "author": "whttevrr",
        "body": "Thank fully there were rocket emojis... my eyes were glazing over and drool was dripping out of my mouth and onto my keybloard. My fingrrd are now slipping on the keys.\n\nDD:\nI boght mor:\n\n🧠 🤪🦍 ✋💎🤚 🚀🚀🚀 🌖\n\nfor\n\n💰💸🤑 🔥🥓🐔🥓🔥",
        "created_utc": 1623274086,
        "id": "h17dn3l",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1623302886.0
    },
    {
        "author": "PrincPaco",
        "body": "The best one I've ever had is Sunrise Deli in Tavernier FL. I've come across decent Cuban coffee in places you wouldn't expect like Vegas, but nothing like genuine Cuban Coffee in the Keys\n\n91885 Overseas Hwy, Tavernier, FL",
        "created_utc": 1624552711,
        "id": "h2wh9kp",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1624581511.0
    },
    {
        "author": "zachalicious",
        "body": "They can do that with your bank account too though. They can freeze all of your assets and seize property at any time. If anything this just shows that crypto markets are complying with regulations, and if you truly want security from seizure, you likely need to be using Monero and never store keys on something connected to the internet.",
        "created_utc": 1623185564,
        "id": "h12ogw1",
        "score": 20,
        "subreddit": "StockMarket",
        "created": 1623214364.0
    },
    {
        "author": "kirlandwater",
        "body": "People holding ARKB don’t want coins &amp; private keys. They want access to the upside exposure brought on by Bitcoin speculative investing",
        "created_utc": 1624982854,
        "id": "h3gbckg",
        "score": 20,
        "subreddit": "investing",
        "created": 1625011654.0
    },
    {
        "author": "bonejohnson8",
        "body": "I almost married the wealthiest JAP you ever saw, billionaire scion, old Russian jeweler family. She was a lunatic, cutter, bulimic, borderline, the whole 9. We did a lot of drugs together, and I had a great patron for my addictions. \n\nHer parents sat me down and offered me the keys to the kingdom, I'd never want for money again, just put on these clothes and submit to a life of nepotism and take care of our crazy daughter. I was with her for 5 years and almost did it, but I had too much pride and turned it all down and left.\n\nShe married some dick that met at a Phish show a few years ago. Today she just barely survived a heroin overdose. She texted me some pictures of cats she's been drawing in coloring books. It's like talking to a shell of the person I remember. \n\nIt's fucking scary seeing how much money doesn't buy happiness.",
        "created_utc": 1622602766,
        "id": "h09qt64",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1622631566.0
    },
    {
        "author": "5p4c3froot",
        "body": "i sang that in alicia keys voice omg help",
        "created_utc": 1624937715,
        "id": "h3ego0d",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1624966515.0
    },
    {
        "author": "energydrinksforbreak",
        "body": "Is buying more monitors to throw graphs up that you don't understand to cover up the fact that you don't know what you're doing the other keys? I absolutely love your set up, but let's be real, it's nothing but a waste of money. All those monitors give you zero advantage.",
        "created_utc": 1623992649,
        "id": "h26e3gv",
        "score": 16,
        "subreddit": "StockMarket",
        "created": 1624021449.0
    },
    {
        "author": "no5945541",
        "body": "Has 1 penthouse.\n\nSells 47 penthouses.\n\nDoesn’t give over the keys to anyone.\n\nI put in bids for penthouses on eBay, see? So you know I’ve got plenty of penthouses to go around.",
        "created_utc": 1624219767,
        "id": "h2go8ki",
        "score": 16,
        "subreddit": "Wallstreetbetsnew",
        "created": 1624248567.0
    },
    {
        "author": "Josh439",
        "body": "Kind of funny and awful. I'm an accountant. In my office I have a cashbox for petty cash (I work with a bunch of boomers who still like to use physical cash for shit). I reconciled it at the end of May.\n\nIt was off by $420. Someone stole $420 from the petty cash box. I laughed at first when I calculated the discrepancy.\n\nCalls on locks and keys.",
        "created_utc": 1623334909,
        "id": "h1a6wfv",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1623363709.0
    },
    {
        "author": "Lewsor",
        "body": "&gt; Currently, a digital AAA title earns the publisher X amount of money - once. Per customer. Years down the line, the same title will be sold for a fraction of the price on their own platform... and that's it.\n\nWhy the focus on the amount of times a digital title can earn the publisher money? The incremental costs of producing additional copies of a digital game are near 0.\n\n&gt; A small percentage off tens of thousands of resales of an old or obsolete title that is no longer offered in the publisher's own catalogue vs. buying the game from the publishers' own old game discount bin for a few bucks... again, once? Might not make sense initially, but especially in the used / old game market those small revenue streams would add up: especially when compared to a scenario where users would not otherwise buy the game.\n\nI still don't see the incentive for a publisher to cannibalize their own sales. As an example, Fallout: New Vegas was released in 2010 on Steam and other digital platforms. It cost $59.99 then. \n\nToday, Fallout: New Vegas is available on Steam for $9.99. A person that wants a copy of the game can buy it today. The publisher will receive the same percentage cut of the $9.99 sale that they received from the $59.99 sale.\n\nLet's now assume that Gamestop has a digital NFT token that allows resale of digital games. Someone in 2010 buys the game for $59.99, and today sells its for $9.99. The publisher receives a cut of the $9.99 sale, in addition to the original $59.99 sale.\n\nThe problem here is, what's the difference to the publisher? They receive the same amount of money from the sales. The keys to sell a second copy of the game have already been generated and sent to Steam for resale, so there's no incremental cost there. The NFT resale is basically cannibalizing a new sale.\n\n&gt; drive up scarcity of used titles? Release special NFT collector's versions of certain titles which are unlikely to ever go down in price due to extreme rarity?\n\n&gt; Especially the latter: think Magic the Gathering and take the Black Lotus card as an example. If you could release a fixed amount of those into the wild and get a cut for each and every high-price resale of those decades down the line... wouldn't you?\n\nI can see the argument/value for NFT sales of collectible items intended to be artificially scarce. Maybe not a multibillion dollar market, but definitely a possible avenue for revenue growth.\n\n I don't see the argument for driving artificial scarcity for regular, non collectible digital games. Even in the pre digital games, the games that were scarce were driven by production costs, and not by publishers attempting to drive up prices by limiting availability.",
        "created_utc": 1623273003,
        "id": "h17b2pu",
        "score": 15,
        "subreddit": "investing",
        "created": 1623301803.0
    },
    {
        "author": "Beershitsson",
        "body": "Yeah man just fill it up before you bring it back. Dock 31 says “Big Choomba” on the back, keys are in it.",
        "created_utc": 1624553950,
        "id": "h2wk412",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1624582750.0
    },
    {
        "author": "LegalizeMmurder",
        "body": "Dude I hate my fuckin apartment neighbors so much, I don’t mind noise but I hate that they must only have one key so everytime one goes outside to smoke they knock on their apartment door for 10 fuckin mins till someone lets them back in their apartment bro get some copies of your keys it’s like 4 dollars at Walmart, I’m sitting here tryna smoke some dabs and keep hearing TAPTAPTAPTAPTAP, call them idk who knocks that many times every single night at 3 am for 3 months I’ve lived here, why can’t they party and be loud like normal people instead of being door knockers like some Mormons",
        "created_utc": 1624438384,
        "id": "h2qyuba",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1624467184.0
    },
    {
        "author": "Moneybags313131",
        "body": "\"THIS CLOVER IS ON FIREEEEE\" - Alica Keys",
        "created_utc": 1623245841,
        "id": "h15gejo",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1623274641.0
    },
    {
        "author": "BC_Jay",
        "body": "Someone tosses you the keys to a lambo you asking why or driving away",
        "created_utc": 1622547524,
        "id": "h06kxtv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1622576324.0
    },
    {
        "author": "Thewolfofbearstreet",
        "body": "Thank god blackberry don’t sell phones anymore apes figures to big for the keys",
        "created_utc": 1622669413,
        "id": "h0d43wb",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1622698213.0
    },
    {
        "author": "BackThatThangUp",
        "body": "Where do they keep the monkey that hits the up and down arrow keys on the stocks I want to tear gas that little fucker",
        "created_utc": 1623164593,
        "id": "h11b0n6",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1623193393.0
    },
    {
        "author": "NoWaayy",
        "body": "For anyone new/not familiar with crypto reading this, please do your research before starting to \"invest\" in these. Also not your keys, not your coins!",
        "created_utc": 1624328631,
        "id": "h2lx7fa",
        "score": 10,
        "subreddit": "CanadianInvestor",
        "created": 1624357431.0
    },
    {
        "author": "runtowardsit",
        "body": "I have wired 10 bitcoins to your wallet, where can I pick up the keys",
        "created_utc": 1624911118,
        "id": "h3cyrbs",
        "score": 9,
        "subreddit": "investing",
        "created": 1624939918.0
    },
    {
        "author": "gamethe0ry",
        "body": "And? Publishers don’t care, the standard has set on consumers buying one time keys, why would they miss out on extra revenue.",
        "created_utc": 1623268296,
        "id": "h16zden",
        "score": 9,
        "subreddit": "investing",
        "created": 1623297096.0
    },
    {
        "author": "Ancient-Apartment-23",
        "body": "Depends what you’re looking for. A lot of people would say it isn’t the best since you don’t own the keys and WS takes a cut. I think it’s a great way of normalizing crypto for the masses though. I’ve got some money in WS crypto but I see it as a stopgap measure to getting a proper crypto account/wallet set up. Ymmv",
        "created_utc": 1624329603,
        "id": "h2lyxse",
        "score": 9,
        "subreddit": "CanadianInvestor",
        "created": 1624358403.0
    },
    {
        "author": "works_best_alone",
        "body": "G2A does not sell used keys, for obvious reasons. They sell new keys.",
        "created_utc": 1623266782,
        "id": "h16vmni",
        "score": 8,
        "subreddit": "investing",
        "created": 1623295582.0
    },
    {
        "author": "CrankyMiddleAgeGuy",
        "body": "BA — The Keys are overrated. Expensive. Pretty, but everything is overpriced and you drive up to Miami-Dade county whenever you really need something (between 45 min and 3 hours depending on where in the Keys). \n\nBuenos Aires is inexpensive, the women are beautiful, the people are well educated, and Steak + Malbec is the National dish..... Exquisite dining is a fraction of the cost of Miami.",
        "created_utc": 1622607790,
        "id": "h0a00l1",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1622636590.0
    },
    {
        "author": "ubunturd",
        "body": "The QWERTY keyboard was designed to slow you down.\n\nWhen typewriters were introduced, typing too quickly would jam the keys. To prevent this from happening, QWERTY was introduced which placed common alphabets at a distance from each other and slowed typists down.",
        "created_utc": 1623136935,
        "id": "h108zcx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1623165735.0
    },
    {
        "author": "suchinsight00",
        "body": "I didn’t realize you were a medium. Would you let me know where my late grandfather left his Buick keys?",
        "created_utc": 1623134765,
        "id": "h106hxd",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1623163565.0
    },
    {
        "author": "MoistBlunt",
        "body": "Yeah didn’t know what I was signing up for but when given the escape pod keys I threw them away. Why would anyone want to jump out of a moving rocket to Uranus",
        "created_utc": 1623762695,
        "id": "h1ueljr",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1623791495.0
    },
    {
        "author": "DoggyFrench",
        "body": "The 3 keys to being a successful Amazon delivery driver: 1. Piss in bottles, 2. Change into your street clothes when you leave the station, and 3. Drink on the job",
        "created_utc": 1623603865,
        "id": "h1n0ngr",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1623632665.0
    },
    {
        "author": "JoanOfSnarke",
        "body": "My retarded roommate locked me out of the apartment while I was exercising. I don't carry my keys because I know I would drop them. \n\nSo I guess I'll just lie outside for now.",
        "created_utc": 1624147139,
        "id": "h2djuw3",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1624175939.0
    },
    {
        "author": "Spac_a_Cac",
        "body": "\nPaysafe preps post-Spac refi\n \n\n02 Jun 2021\n\nFintech payments provider Paysafe has launched a refinancing of its remaining credit facilities, following its $9bn merger with a Bill Foley-controlled Spac, which closed in March. The merger and its accompanying PIPE allowed the firm to pay down debt and cut its leverage, and now it wants to lock in the benefits with a lower-cost refi.\n\nJP Morgan is sole physical bookrunner on the dollar and euro term loans, totalling $1.026bn between the currencies. This will be followed with an equal sized slug of bonds in dollar and euros, yet to be launched.\nTalk on both tranches is 300bp-325bp at 99.5, with a 25bp margin step-down if the firm hits 3.7 times net leverage, half a turn below its present level, according to the loan marketing materials.\nLenders have successfully pushed back on proposed margin ratchet terms — including Cerba, for example — but these are generally deals which started with more aggressive terms, such as multiple step-downs for each quarter-turn of leverage. Deals with 25bp for half a turn have largely sailed through.\n\"It's a real economic term and something investors can easily rally around,\" said a leveraged finance syndicate banker. \"Some of the other docs points can be a bit of a niche interest but this is universal.\"\nPaysafe earmarked €1.25bn-equivalent of its outstanding debt for repayment as part of the merger, which closed at the end of March. The company said in its introduction to equity market analysts that it would have net leverage of 3.6-3.8 times on its 2021 earnings following the transaction — suggesting it intends to activate the margin step-down quickly.\nIt will, however, be going on the acquisition trail as well. Outlining the deal to analysts, Foley said: “One of the keys to this transaction and value creation for our shareholders is the reduction of Paysafe’s leverage ratio to 3.6 times. As Paysafe continues to grow and generate cash flow, that leverage ratio will continue to come down creating even more opportunity to pursue accretive M&amp;A opportunities.”\nMoody’s estimated leverage at 5.2 times on March 2021 numbers, after backing out some of the company’s adjustments.\nBased on its expected 2021 Ebitda, the business was 6-6.2 times levered at the end of last year, with net debt of $2.99bn, incurred when Blackstone and CVC took the firm private in 2017. The sponsors scored a huge win with the transaction, paying £3bn for the company and selling it on at a valuation of $9bn.\nHowever, both firms will remain invested. They took $2.3bn off the table as part of the Spac deal, but rolled over $3.29bn, while the Spac itself put in $1.467bn.\nThe PIPE investment (private investment in public equity) closed at the same time injected a further $2bn, with cornerstones from Foley-affiliated entities Cannae Holdings and Trasimene Capital Management, and outside capital from Fidelity, Third Point, and Maplelane Asset Management.\nAlongside the term loan and bond refi, the company will have a new $305m revolver in place following the closing of the deal.\nSpac-driven M&amp;A activity is increasingly feeding through to leveraged credit markets and to CLO portfolios, as sponsor-owned companies become targets for SPAC acquisitions. The equity raised through this route usually deleverages the company, meaning loan repayments or refinancings tighter — in some cases, helping take out loans trading at low levels at par.\nPaysafe’s existing euro loan already had a margin of 325bp, the wide end of the new guidance, but it also had outstanding second lien debt of $200m and €214m in its original LBO capital structure, which paid 725bp and 700bp respectively and have now been repaid.",
        "created_utc": 1622755207,
        "id": "h0hm5nn",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1622784007.0
    },
    {
        "author": "DancesWithMilfs01",
        "body": "CLNE to the moon. They don’t want you to have another anthem!! \n\nMajor keys!! 🐂💨🌝",
        "created_utc": 1623189138,
        "id": "h12wdzi",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1623217938.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "No, you do not own crypto with WealthSimple. Also, a lot of people are investing in crypto-ETFs without realizing some issues such as the fact that you will not own actual crypto. You will not be insured if anything happens to the ETF. That is a pretty big risk even though they can be held in a TFSA while being subjected to big swings during the weekend. Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\r  \n\r  \n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy.   \r  \n\r  \n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\r  \n\r  \n3. If you want tax free capital gains, you can buy BTCX, ETHX or BTCC in your TFSA. With that said, you do not truly own crypto with any of those because they are a fund; and therefore, you own shares of the fund and not the asset itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your crypto\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not insured. Big risk, but tax free/deferred in a TFSA/RRSP.\r  \n\r  \n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\r  \n\r  \n5. Unfortunately, with BTCC, ETHX, and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (crypto) and simply run the fund with the crypto backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\r  \n\r  \n6. In regards to taxes, if you truly own the asset (crypto), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\r  \n\r  \n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. \r  \n\r  \nNow, here are some general points of interests to help you understand cold storage wallets:\r  \n\r  \n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\r  \n\r  \n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\r  \n\r  \n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \r  \n\r  \n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\r  \n\r  \nDisclaimer: I am irresponsibly long Bitcoin/Ethereum and I sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1624319501,
        "id": "h2lgi4w",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1624348301.0
    },
    {
        "author": "CJnella91",
        "body": "I've had issue with every corsair product I've had, their mouse software caused my games to crash idk what that was about and some keys on a keyboard I bought just straight up didn't work, now I use Razer for Keyboard and Mouse and Logitech for headset. Been working great for the past 4 years. Razer headset's suck though.",
        "created_utc": 1623697217,
        "id": "h1rfncl",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1623726017.0
    },
    {
        "author": "amish_cupcakes",
        "body": "Thanks!  If I'm ever down that way I'll have to look it up!  I'm pretty sure a trip to the keys is in my future.... eventually.",
        "created_utc": 1624554261,
        "id": "h2wkt9k",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1624583061.0
    },
    {
        "author": "Thickensick",
        "body": "Buying WKHS right now is like having keys to the tendies store.",
        "created_utc": 1624028866,
        "id": "h27u2ke",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1624057666.0
    },
    {
        "author": "NonSupportiveCup",
        "body": "Legitimizing the second-hand market should certainly not be overlooked. If the NFT idea follows the predictions which are currently floating around that would be a lot of potential but I suppose many people just don't see it.\n\nEdit: Maybe because most investors don't see how bad the Steam keys market actually can be.",
        "created_utc": 1623269559,
        "id": "h172j96",
        "score": 5,
        "subreddit": "investing",
        "created": 1623298359.0
    },
    {
        "author": "UBahn1",
        "body": "The Robinhood API requires authentication with credentials, and an MFA code if you have 2 factor enabled. This is usually taken care of by these apps on the \"connect/ login to your account to start\" portion. It then grants a temporary auth token with a specific expiration date until you have to login again.\n\nThe scope of the permissions would be defined by the app (which should show up in ToS or elsewhere), but it's by no means \"giving away the keys to the castle\". The scopes are fairly granular, so most likely this would get read only access to holdings and order history. \n\nHope that's some reassurance with how these apps work, I've not yet checked this one out. Obviously be careful with who you trust but again, access isn't a binary all or nothing, it's scoped to specific needs of an app. Of course, it really does come down to the dev, so DD anything you're going to link to your account.",
        "created_utc": 1624825892,
        "id": "h38y0dn",
        "score": 5,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1624854692.0
    },
    {
        "author": "Night_Runner",
        "body": "The bot partied a bit too hard on Friday night. Better get his car keys. :P",
        "created_utc": 1624085345,
        "id": "h2atq7s",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624114145.0
    },
    {
        "author": "ridedatstonkystnkaay",
        "body": "If you want the keys to my heart punch JG Wentworth in his fuckin pie hole. Fuck his cash now schemes",
        "created_utc": 1625010603,
        "id": "h3i1qt1",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1625039403.0
    },
    {
        "author": "murray_paul",
        "body": "a) Why would game publishers be interested in doing this, when it would reduce their revenues?\n\nb) Publishers already offer a rental-like model with monthly subscriptions.\n\nc) If publishers wanted to allow resale, they could do that through Steam/Epic keys right now.\n\nSo what does GameStop offer? \n\nThe cannot offer digital resale/rental without publisher agreement.\nDigital publishing for consoles is locked up by the console manufacturers. Digital sales for PCs are dominated by Steam and Epic.\n\nAnd ... what does offering digital resale/rental have to do with owning physical stores?",
        "created_utc": 1623264789,
        "id": "h16qosy",
        "score": 5,
        "subreddit": "investing",
        "created": 1623293589.0
    },
    {
        "author": "popspropain",
        "body": "I still miss the keys",
        "created_utc": 1624418291,
        "id": "h2q8l6p",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624447091.0
    },
    {
        "author": "ChessMaster22",
        "body": "Jpow to announce he’s handing over the keys to reddit",
        "created_utc": 1623867134,
        "id": "h1zuwsg",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1623895934.0
    },
    {
        "author": "-Erasmus",
        "body": "Not exactly. Hitting too many keys right next to each other could jam the keys so they spread out the common letters and combinations. A good typist can actually go faster on QWERTY because they use different fingers for each area of the keyboard",
        "created_utc": 1623137200,
        "id": "h1099sw",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623166000.0
    },
    {
        "author": "lovestheasianladies",
        "body": "&gt;If you buy a physical copy, that game is your property\n\nI guess you don't understand how CD keys work. Those have only been a thing for like 30 years now.",
        "created_utc": 1623270920,
        "id": "h175xnt",
        "score": 4,
        "subreddit": "investing",
        "created": 1623299720.0
    },
    {
        "author": "FakeNorseInvestment",
        "body": "Why’d you leave the keys on the table.",
        "created_utc": 1623803193,
        "id": "h1wv3gt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623831993.0
    },
    {
        "author": "mishka__",
        "body": "That doesn’t include the price for the keys and windshield wipers. Those are $17,000.",
        "created_utc": 1623884696,
        "id": "h20xjbf",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623913496.0
    },
    {
        "author": "hambone_83",
        "body": "Pardon my ignorance as I've never visited Florida but this is the second dispensary in the keys (First one is in Key West).  I'm assuming it's mostly tourism there as the population in the keys is very small.  So is this a future play for when Florida goes recreational?  I can't see these dispensaries putting up big numbers for medical only in the short term or am I missing something?",
        "created_utc": 1623856396,
        "id": "h1z5lss",
        "score": 4,
        "subreddit": "weedstocks",
        "created": 1623885196.0
    },
    {
        "author": "arBettor",
        "body": "Bitcoin is a public blockchain. Gemini could theoretically sign a message with the keys associated with the BTC to prove they control them, although I don't know if that's actually part of their process.\n\nBut it can definitely be done.",
        "created_utc": 1625002291,
        "id": "h3hkcse",
        "score": 4,
        "subreddit": "investing",
        "created": 1625031091.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "A lot of people are investing in crypto-ETFs without realizing some issues such as the fact that you will not own actual crypto. Also, you will not be insured if anything happens to the ETF. That is a pretty big risk even though they can be held in a TFSA while being subjected to big swings during the weekend. Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\r  \n\r  \n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy.   \r  \n\r  \n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\r  \n\r  \n3. If you want tax free capital gains, you can buy BTCX, ETHX or BTCC in your TFSA. With that said, you do not truly own crypto with any of those because they are a fund; and therefore, you own shares of the fund and not the asset itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your crypto\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not insured. Big risk, but tax free/deferred in a TFSA/RRSP.\r  \n\r  \n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\r  \n\r  \n5. Unfortunately, with BTCC, ETHX, and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (crypto) and simply run the fund with the crypto backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\r  \n\r  \n6. In regards to taxes, if you truly own the asset (crypto), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\r  \n\r  \n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. \r  \n\r  \nNow, here are some general points of interests to help you understand cold storage wallets:\r  \n\r  \n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\r  \n\r  \n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\r  \n\r  \n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \r  \n\r  \n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\r  \n\r  \nDisclaimer: I am irresponsibly long Bitcoin/Ethereum and I sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1624968500,
        "id": "h3finna",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1624997300.0
    },
    {
        "author": "ar_1five",
        "body": "No its the opposite. Even with smaller keys if they are physical you can feel them and press one only. With an onscreen keyboard you can’t do that. So you end up jamming extra keys.",
        "created_utc": 1623015599,
        "id": "h0u8lt2",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1623044399.0
    },
    {
        "author": "TaftsTummyforTaxes",
        "body": "Anytime I see this scene of Murphy catching the car keys I think of the hundreds of times they had to redo it because the keys kept bouncing off the rubber hands of the costume 🤣",
        "created_utc": 1622602875,
        "id": "h09r0y9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1622631675.0
    },
    {
        "author": "Variety-Smart",
        "body": "It appears most traditional regulated brokers are entering Crypto at arms length via ETFs (a number in application status) or CFDs and Futures (i.e TD Ameritrade, Interactive Brokers, Charles Schwab...etc.). Paypal is an interesting proposition in the US, they allow, with restrictions for limited Crypto trading on their platform only. Also be aware, you don't own your keys either.",
        "created_utc": 1624771666,
        "id": "h36mqc8",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1624800466.0
    },
    {
        "author": "redditcactus1",
        "body": "Handing over the keys to my portfolio as we speak",
        "created_utc": 1624670407,
        "id": "h3272je",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1624699207.0
    },
    {
        "author": "ar_1five",
        "body": "Any male with hands bigger than a 12y/o wants a physical keyboard. Tactile sense of the keys make it easier to type. Most guys i know still cant type on iphone including me simply because my thumbs are too big it just mashes 2 keys at once. You are probably a small person so you don’t realize this.",
        "created_utc": 1623015396,
        "id": "h0u86di",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1623044196.0
    },
    {
        "author": "iguy26",
        "body": "Have you ever eaten a girl out and her pussy stank? What are you supposed to do when you're already down there and don't want to eat that spoiled tuna? Make something up like you left your keys in the and gotta go? How do you brahs deal with this?",
        "created_utc": 1625095143,
        "id": "h3mb0nx",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1625123943.0
    },
    {
        "author": "LargeHotdog",
        "body": "Puts on Microsoft. I want a refund on my windows 10 pro keys. Every week I get a call at work that our software isn’t working. Only happens after windows 10 decides to update itself after I said NO.",
        "created_utc": 1622558731,
        "id": "h075dzk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622587531.0
    },
    {
        "author": "___alexa___",
        "body": "ɴᴏᴡ ᴘʟᴀʏɪɴɢ: [The Black Keys - Gold On The](https://www.youtube.com/watch?v=6yCIDkFI7ew) ─────────⚪───── ◄◄⠀[▶](https://www.youtube.com/watch?v=6yCIDkFI7ew)⠀►►⠀ 2:30 / 3:46 ⠀ ───○ 🔊 ᴴᴰ ⚙️",
        "created_utc": 1622565128,
        "id": "h07jtoj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622593928.0
    },
    {
        "author": "exemptionlife",
        "body": "help keys matter",
        "created_utc": 1624187016,
        "id": "h2f12yp",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624215816.0
    },
    {
        "author": "Downtown-Duck-3542",
        "body": "I’ll second their order. And 2 for my friend, and when I say friend I mean me, and when I say 2 I mean just leave the bottle... actually just leave the keys, I can lock up.",
        "created_utc": 1622860290,
        "id": "h0n5qqo",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622889090.0
    },
    {
        "author": "master_perturbator",
        "body": "Check out the info I copied from the patent filing for Koinfold.\n\nKOINFOLD Goods and Services IC 009. US 021 023 026 036 038. G &amp; S: software for making investments; downloadable software for making investments; mobile apps, namely, downloadable software in the nature of a mobile application for making investments; software for financial services; software for financial management; Downloadable software for generating cryptographic keys for receiving and spending cryptocurrency; Cryptocurrency hardware wallets; Downloadable computer software for use as a cryptocurrency wallet; Downloadable computer software for use in electronically trading, storing, sending, receiving, accepting and transmitting digital currency, and managing digital currency payment and exchange transactions; Computer hardware for cryptocurrency mining; Contactless merchant payment system for paying with Crypto; contactless cryptocurrency payments and merchant services IC 036. US 100 101 102. G &amp; S: Currency exchange services; on-line real-time currency trading; cash management, namely, facilitating transfers of electronic cash equivalents; digital currency exchange transaction services for transferrable electronic cash equivalent units having a specified cash value; Blockchain-based payment verification services; Cryptocurrency exchange services featuring blockchain; Financial analysis; Financial consultancy; Financial exchange; Financial information; Financing services; Issuance of tokens of value\n\nIC 042. US 100 101. G &amp; S: Design, development, and implementation of software for distributed computing platforms; Design, development, and implementation of software for blockchains; Research and development of computer software; Software development and product development consulting in the field of distributed computing platforms; Computer programming services for mining of digital currency, digital coins, and cryptocurrency; Electronic storage of cryptocurrency for others; Providing technology information in the field of cryptocurrency; Technological consulting in the field of cryptocurrency; Technological planning and consulting services in the field of digital currency, digital coins, cryptocurrency, blockchain, and cryptocurrency mining; Providing on-line non-downloadable software for generating cryptographic keys for receiving and spending cryptocurrency; Providing temporary use of online non-downloadable software for use in electronically trading, storing, sending, receiving, accepting and transmitting digital currency, and managing digital currency payment and exchange transaction; Software as a service (SaaS) services featuring software for making investments\n\nStandard Characters Claimed Mark Drawing Code (4) STANDARD CHARACTER MARK Serial Number 90742870 Filing Date May 28, 2021 Current Basis 1B Original Filing Basis 1B Owner (APPLICANT) Authentic Solutions, Inc. CORPORATION COLORADO 438 Eagle Drive Ione CALIFORNIA 95640 Attorney of Record R. Joseph Trojan Type of Mark TRADEMARK. SERVICE MARK Register PRINCIPAL Live/Dead Indicator LIVE",
        "created_utc": 1623626621,
        "id": "h1o9vdh",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1623655421.0
    },
    {
        "author": "carsonthecarsinogen",
        "body": "I am a Tesla-tard and fine with it, it’s clear I’m a strong believer in the company. But I actually listen to what others say and I pay close attention to what competitors are doing and developing. The facts are that they still don’t make comparable products and people still don’t make any actual arguments against Tesla. \n\nI’m open to learn and encourage discussion about why Tesla won’t be the winner, but no one says anything other than things like you’ve just commented. Tesla bulls get blown off with “they aren’t profitable” “competitors will catch them” “stock is overvalued” but these aren’t based on facts, it’s FUD and speculation and not reasons why the company won’t continue to win. \n\nThe only thing I’ve speculated on is that it is the best investment Long term, and that they will be the largest company by revenue. Which I backed up with reasoning that is based on current information available to everyone. \n\nTo comment on your first point, if all those things were true then how would they not be leading in revenue? The top companies by revenue are in energy, oil and gas, and automotive (other than retail), if Tesla is leading in all these sectors and continue to post insane profit margins they would be leading in revenue.\n\nTesla is also about to turn insurance on its head and will have the best possible rates due to large pools of data that their cars collect for them for free. If they solve FSD their robotaxis will be free money, they have all the keys to solving it and are the only company actually attempting this. Waymo is limited to level 4 autonomy and is not able to profitably compete at scale because of the amount of effort it takes to render and update their maps which are needed for the cars to work, unlike Tesla who’s cars actually understand what they are doing and have been doing this safely for millions of uninterrupted miles. \n\nThere is so much to be bullish about and so little to be bearish about. As I said, please point out something I’m missing that is backed by facts and not fake news.",
        "created_utc": 1624579476,
        "id": "h2xter0",
        "score": 3,
        "subreddit": "stocks",
        "created": 1624608276.0
    },
    {
        "author": "neer21aj",
        "body": "keys to happiness: good people, time in nature, spy 0DTE poots",
        "created_utc": 1624150555,
        "id": "h2dpqnj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624179355.0
    },
    {
        "author": "ceindynce",
        "body": "don't worry, when you find out they don't carry their keys for the same reason, you will have some company.",
        "created_utc": 1624147444,
        "id": "h2dkdw5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624176244.0
    },
    {
        "author": "JPowsBestie",
        "body": "Knowing when to sell/hold a green position is one of the main keys of options trading",
        "created_utc": 1624649299,
        "id": "h312c2i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624678099.0
    },
    {
        "author": "tobyfatcat",
        "body": "There is a K Mart in the FL Keys! It will bounce back for sure!!! :(",
        "created_utc": 1623311380,
        "id": "h197vwe",
        "score": 3,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1623340180.0
    },
    {
        "author": "t76turbo",
        "body": "They already have the ability to unlock and remote start the car with the watch (or iphone).  It's called 'Car Keys' and is very limited right now.  I think the first was the 2021 BMW 5 series.  But it is out there already.  I agree, should be some exciting stuff around the corner.",
        "created_utc": 1622756419,
        "id": "h0hp2o1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622785219.0
    },
    {
        "author": "___alexa___",
        "body": "ɴᴏᴡ ᴘʟᴀʏɪɴɢ: [DJ Khaled - I Got the Keys (](https://www.youtube.com/watch?v=SFLSOIufuhM) ─────────⚪───── ◄◄⠀[▶](https://www.youtube.com/watch?v=SFLSOIufuhM)⠀►►⠀ 2:46 / 4:09 ⠀ ───○ 🔊 ᴴᴰ ⚙️",
        "created_utc": 1623110525,
        "id": "h0z17mh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623139325.0
    },
    {
        "author": "262Chief",
        "body": "Somehow I am not seeing handing over the cannabis keys to a crew of Canadian $$$ Billion dollar companies, led by a Russian billionaire oligarch as the solution to the social equity piece.",
        "created_utc": 1623203435,
        "id": "h13p32i",
        "score": 2,
        "subreddit": "weedstocks",
        "created": 1623232235.0
    },
    {
        "author": "SFLurkyWanderer",
        "body": "Can I have the keys in the car Friday night?",
        "created_utc": 1623812782,
        "id": "h1xdnqh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623841582.0
    },
    {
        "author": "cronycapitalusa",
        "body": "He's a cryptotard. One of the masses swallowed by BTC maximalism, he's probably doesn't even maintain his own coin's private keys.\n\nSad to see honestly, hopefully the cryptotards wake up and find the real coins with actual value based on utility. KMD, ARRR, VRSC, BAND.",
        "created_utc": 1623945084,
        "id": "h23ofyb",
        "score": 2,
        "subreddit": "investing",
        "created": 1623973884.0
    },
    {
        "author": "Creative_Ad_8338",
        "body": "In all seriousness though, I think NFT have real value... Errr, uhm, some of them do. The concept makes great sense. For instance, baseball cards and comic books are collectible and worth money. Many people place value on the physical asset but in reality if the card or book was blank then it would have no collectible value. So if the value is content then it makes sense to store it digitally for a multitude of reasons. However, comics and baseball cards become more valuable over time as they become more rare due to loss from circulation. I think this is the idea behind issuing only a certain number of NFT... Limit supply to generate some value. Some of those digital assets (NFTs) may be lost over time, like BTC removed from circulation because people forget keys, but will be less than physical collectibles. So circling back to original question, I don't think so NFT will come crashing down, much like all collectibles don't lose value simultaneously. It really depends on each NFT and categories of NFT. Do I think lots will lose value? Yes, absolutely, because many have no real following and it's relatively few people buying them up. However, the NFT for Charlie bit my finger is immensely popular and will always hold value because it generates cash flow to the holder through YouTube views, licensing, etc. Ultimately I could see the digitizing of many assets including real property as NFTs.",
        "created_utc": 1624622493,
        "id": "h2zilr9",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1624651293.0
    },
    {
        "author": "GravityIsVerySerious",
        "body": "Do ya’ll get messages from stock pumpers telling you what to do?  Is this a toddler slapping keys?  Big bank shilling a product?  Small company sharing quality DD?  Pushing stuff like ABNB, FUBO, Z.",
        "created_utc": 1624365499,
        "id": "h2n8nea",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624394299.0
    },
    {
        "author": "isellamdcalls",
        "body": "I stay in america but I move to the keys",
        "created_utc": 1624130854,
        "id": "h2cq9z2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624159654.0
    },
    {
        "author": "PumpAndDumpApe",
        "body": "Ape like shiny keys.  🔑",
        "created_utc": 1624729722,
        "id": "h34le2x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624758522.0
    },
    {
        "author": "Braaapp-717",
        "body": "Close my eyes and hit random keys into the ticker search bar",
        "created_utc": 1625035080,
        "id": "h3j7yd3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625063880.0
    },
    {
        "author": "AIDaPool_Cardano",
        "body": "Yes, that's true. But it is subsidized. (Meaning they're taking a loss to attract stakes).\nIt won't be like that forever. Not at those levels. Maybe they can give 6.5% or ao in the future, when/if liquidity becomes an issue.\n\nAnd as I'm a believer in \"not your keys, not your crypto\", I'd advise against staking on an exchange. Even when the roi is higher",
        "created_utc": 1623860491,
        "id": "h1zffew",
        "score": 2,
        "subreddit": "investing_discussion",
        "created": 1623889291.0
    },
    {
        "author": "FullDeadQuiet",
        "body": "Neat. Is MUSH doing the same as MIND and CMPS? I also eat lots of mushrooms. I put them on peanut butter sandwiches. I learned about that trick by accident. Once I start blasting music and start talking to the tree out front take my keys for the gun safe away from me. I don't want to end up on TV again.",
        "created_utc": 1623332981,
        "id": "h1a2m0o",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623361781.0
    },
    {
        "author": "NewbFinanaceCA",
        "body": "They get your $$$$ that way and charge you fees on it. When they have a lot of crypto they can stake it into liquidity pools and make even more money. They own your keys so never have to worry about you withdrawing and ruining their staking. It's Effing Brilliant (for them)",
        "created_utc": 1624323964,
        "id": "h2lorom",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1624352764.0
    },
    {
        "author": "Dahwool",
        "body": "Great comment! \n\nKey ownership is dependent on individual strategy. There are reasonable benefits depending on investor for buying a ETF in a TFSA. For example under bitcoin you might own your keys but in reality some people will sometimes forget them or maintain a higher capital gain than the former. \n\nCrypto as you mentioned act as money service businesses in Canada with Fintrac, AML. In many case it’s similar to holding an ETF versus holding the crypto like the conversation with stocks. One might hold a BTC ETF since they don’t use bitcoin due to fees, and more value is gained through a registered account for long term appreciation. Many of the ETFs operate under securities regulation in Canada.",
        "created_utc": 1624324539,
        "id": "h2lpt8b",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1624353339.0
    },
    {
        "author": "chatlourd",
        "body": "who wants my private keys?! won’t be of any use to me after tomorrow!",
        "created_utc": 1624525950,
        "id": "h2v7qnc",
        "score": 2,
        "subreddit": "options",
        "created": 1624554750.0
    },
    {
        "author": "wasabiflavorcocaine",
        "body": "wow I was just in the Keys. Fuck! Next time",
        "created_utc": 1624591104,
        "id": "h2yex9i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624619904.0
    },
    {
        "author": "GreatTraderOnizuka",
        "body": "Hotkey…. they must be separated two keys apart now.",
        "created_utc": 1624575776,
        "id": "h2xmlt5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1624604576.0
    },
    {
        "author": "TheRealCheeze17",
        "body": "I consider myself fortunate. I started in May of 2019 and only got my feet wet by the crash in March 2020. Seeing how beaten down everything was gave me hope and ambition that smart money placements would grant good returns, which they have. I think balance is so vital, because if you own a stock but it's weight in your portfolio is only 10%, then in the event of a huge drop your overall losses are minimized. \n\nNothing that I've said is special, I just think perspective and mentality are keys as well as sticking to whatever investment/trading strategy is right for you.",
        "created_utc": 1623991745,
        "id": "h26ct9a",
        "score": 2,
        "subreddit": "stocks",
        "created": 1624020545.0
    },
    {
        "author": "Stak215",
        "body": "Yes for specific things like expansions. Console game do not have CD keys.",
        "created_utc": 1623271146,
        "id": "h176htb",
        "score": 2,
        "subreddit": "investing",
        "created": 1623299946.0
    },
    {
        "author": "sharist_DIY_bio",
        "body": "lol. Do hybrids count,? Seriously, tho, had a Prius back when that was a real joke. Cool dashboard display for its time. Left my keys in it ...unlocked ...all the time ...with the doors and windows open,  still no joy. Literally nobody wanted that turd.",
        "created_utc": 1623555402,
        "id": "h1l36p4",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1623584202.0
    },
    {
        "author": "RedditF1shBlueF1sh",
        "body": "If you have the private keys, you have the wallets. If you read the article or other comments, they had the private keys on a rented cloud server, which was subpoenaed",
        "created_utc": 1623200740,
        "id": "h13jsr0",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1623229540.0
    },
    {
        "author": "TheManagerDustBunny",
        "body": "Keys in a bowl",
        "created_utc": 1623499737,
        "id": "h1ibawa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623528537.0
    },
    {
        "author": "legendoftheark",
        "body": "Big gorilla at the L.A. Zoo\nSnatched the glasses right off my face \nTook the keys to my BMW \nLeft me here to take his place\n\nI wish the ape a lot of success \nI'm sorry my apartment's a mess \nMost of all I'm sorry if I made you blue \nI'm betting the gorilla will, too\n\nThey say Jesus will find you wherever you go \nBut when He'll come looking for you, they don't know \nIn the mean time, keep your profile low \nGorilla, you're a desperado",
        "created_utc": 1622665310,
        "id": "h0cug4i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622694110.0
    },
    {
        "author": "mrojek",
        "body": "Where do we apply for our yacht keys?",
        "created_utc": 1623171850,
        "id": "h11s5z5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623200650.0
    },
    {
        "author": "KennanFan",
        "body": "[This course on valuation from Aswath Damodaran is awesome.](http://people.stern.nyu.edu/adamodar/New_Home_Page/webcastvalonline.htm)  [He also has one on accounting that I highly recommend.](http://people.stern.nyu.edu/adamodar/New_Home_Page/webcastacctg.htm)  These links lead to videos, lecture slides, tests, and answer keys.",
        "created_utc": 1624931722,
        "id": "h3e5fdn",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1624960522.0
    },
    {
        "author": "Leather_Movie4056",
        "body": "options are great way to define your risk. Learn basic one sided —like buy a call or a put if you have a sense of direction. If moves against you then sell it. I started that way in mid 90s and have never looked back.  You don’t need complicated strategies but may want to add some of the basic ones as you gain experience.  My first play was 3 calls at .50 on a $22 stock.   It ran and coupe days later that $150 play was worth $1300. So the leverage is great, but if you get stupid or greedy and don’t cut losses when they are small and take profit often  then it don’t matter if you are in stocks or options, you will probably wipe out the account. Education is the 1st key—proper execution is all the next keys combined.  Additionally, DO NOT go naked (just selling premiums), no matter how enticing it looks—that is an expert game and hedging is always needed or you assume infinite risk).  And the experts screw up a lot, so don’t think you are smarter or have found an edge.  You haven’t.",
        "created_utc": 1624229798,
        "id": "h2h7qyu",
        "score": 2,
        "subreddit": "options",
        "created": 1624258598.0
    },
    {
        "author": "eaenberg",
        "body": "Commenting so the bot keys out through?",
        "created_utc": 1622601829,
        "id": "h09p0cj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622630629.0
    },
    {
        "author": "Inquisitor1",
        "body": "&gt; What do they have to offer to your average gamer who’s favorite marketplace is steam? \n\nA pc that runs steam. Game keys that you put into steam. And let's not forget the FUCKING BIGGEST THING: steam gift cards. You have a nephew who hates epic game store as much as he hates deodorant? Need something you can wrap into pretty gifting paper? Steam gift card. Thanks to you he can get waifu simulator 3 on his favorite steam without anyone even knowing. Friends of mine went to Germany for vacation from a tiny european country, everyone gave them money to bring back steam gift cards from Germany's gamestops.\n\nAlso, remember how your favorite steam tried to sell movies? Steam isn't even very good at selling things it does sell. Discoverability is down the drain. Greenlight didn't work out, just like that nephew of yours. Shovelware dominates the whole thing. And that valve index, does it have same day delivery from steam? Price matching?",
        "created_utc": 1623323760,
        "id": "h19m11e",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623352560.0
    },
    {
        "author": "DraftLopsided",
        "body": "MVIS, WKHS hold the keys to the rocket ship",
        "created_utc": 1623329886,
        "id": "h19w5qg",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623358686.0
    },
    {
        "author": "Belvador",
        "body": "Long term they’re a failing business I really don’t understand it either. Ive heard talk of GME and NFT’s but I mean people just buy discounted steam keys from 3rd party sites anyways, I don’t think it’s going to be the game changer they think it is. Their core business model of brick and mortar stores are absolutely failing. However they do have a huge stockpile of cash and are a household name so maybe they can do something with that.",
        "created_utc": 1623265416,
        "id": "h16s957",
        "score": 1,
        "subreddit": "investing",
        "created": 1623294216.0
    }
]