[
    {
        "author": "CauseISaidSo_",
        "body": "I'm standing firm with my GME and BB\n\nShout out to fidelity. I will never forget they didn't back down when Robinhood did",
        "created_utc": 1611863486,
        "id": "gl4xfvh",
        "score": 22504,
        "subreddit": "wallstreetbets",
        "created": 1611892286.0
    },
    {
        "author": "vat456",
        "body": "Fidelity still letting me buy. Got an instant deposit of 10k too. Spread the word.",
        "created_utc": 1611843661,
        "id": "gl3aptm",
        "score": 12392,
        "subreddit": "wallstreetbets",
        "created": 1611872461.0
    },
    {
        "author": "Fair_Chart3403",
        "body": "To those that didn't get it on reading: the short squeeze didn't just work, it worked so well that we almost broke stuff.\n\nIt's not just shorters that could not get the shares they needed. The BROKERS RAN OUT OF SHARES and couldn't find places to borrow them! You wanna know why fidelity and vanguard were the only two standing? They hold something like over 20% of the gamestop shares. They could let you buy, BECAUSE THEY WERE THE ONLY ONES WHO COULD GET SHARES. The squeeze is squozing, and the only way out of $100k+ share prices which would break everything was to STOP THE MARKET.",
        "created_utc": 1611875187,
        "id": "gl5swdn",
        "score": 10464,
        "subreddit": "wallstreetbets",
        "created": 1611903987.0
    },
    {
        "author": "uSrNm-ALrEAdy-TaKeN",
        "body": "I’m not rich but I saw what was happening with Robinhood and others, opened up a fidelity account and bought one share of GME (first stock purchase ever).\n\nMOON OR BUST \n🚀🚀🚀🚀🚀🚀🚀🚀",
        "created_utc": 1611867297,
        "id": "gl583no",
        "score": 6705,
        "subreddit": "wallstreetbets",
        "created": 1611896097.0
    },
    {
        "author": "memebetch6969",
        "body": "Every NEW investor get your ass to fidelity!! How are we not pinning this on the god damn homepage????",
        "created_utc": 1611943748,
        "id": "gl9moip",
        "score": 5508,
        "subreddit": "wallstreetbets",
        "created": 1611972548.0
    },
    {
        "author": "Milkpowder44",
        "body": "Hop on Fidelity!",
        "created_utc": 1611842413,
        "id": "gl36yil",
        "score": 5175,
        "subreddit": "wallstreetbets",
        "created": 1611871213.0
    },
    {
        "author": "katarific05",
        "body": "This helps to hear. I like to know I can step away today and just watch for dips to buy today. I can’t set a high sell limit on fidelity.... so I’ll eyeball that squzz next week 💎🙌",
        "created_utc": 1611937766,
        "id": "gl95rto",
        "score": 3641,
        "subreddit": "wallstreetbets",
        "created": 1611966566.0
    },
    {
        "author": "marlwenplotsky",
        "body": "Buy the GME dips on my brand spanking new fidelity account and holding the line",
        "created_utc": 1612127082,
        "id": "gliq8u3",
        "score": 3368,
        "subreddit": "wallstreetbets",
        "created": 1612155882.0
    },
    {
        "author": "meta-cognizant",
        "body": "Fidelity was up all day yesterday. I really like Fidelity.",
        "created_utc": 1611842231,
        "id": "gl36glx",
        "score": 2964,
        "subreddit": "wallstreetbets",
        "created": 1611871031.0
    },
    {
        "author": "DownrightNeighborly",
        "body": "How the fuck do I even get graphs on fidelity",
        "created_utc": 1611976646,
        "id": "glbtvgn",
        "score": 2826,
        "subreddit": "wallstreetbets",
        "created": 1612005446.0
    },
    {
        "author": "dgravel24",
        "body": "I COULDNT FIND THE SELL BUTTON ON MY FIDELITY APP SO I BOUGHT MORE 💎✋",
        "created_utc": 1611937701,
        "id": "gl95lfn",
        "score": 2720,
        "subreddit": "wallstreetbets",
        "created": 1611966501.0
    },
    {
        "author": "ApeStonkTogether",
        "body": "I'm holding my RH shares until THE SQUEEZE then I will transfer to my Fidelity account where they won't FUCK me like my wife's boyfriend FUCKS her",
        "created_utc": 1612046879,
        "id": "glf1dv4",
        "score": 2659,
        "subreddit": "wallstreetbets",
        "created": 1612075679.0
    },
    {
        "author": "account_for_norm",
        "body": "Lol. Fidelity be like, \"fuck off RH!\"",
        "created_utc": 1612054716,
        "id": "glfgpsu",
        "score": 2584,
        "subreddit": "wallstreetbets",
        "created": 1612083516.0
    },
    {
        "author": "Giulio-Cesare",
        "body": "RH returned one of my transfers after it had cleared then slapped with me some \"account deficient\" tag and told me as a penalty I wouldn't be able to buy anything until Feb 8th even if I put more money in and I've temporarily lost immediate deposits now.\n\nLike bro the money was there, you just decided to reverse it after it had went through.\n\nTried to go to Fidelity but they're saying it'll take 5-6 days for my bank account to link.\n\nWhat the fuck can I do. I have money and I want to buy more GME but it's like the world in conspiring against me.",
        "created_utc": 1611959619,
        "id": "glau84e",
        "score": 2533,
        "subreddit": "wallstreetbets",
        "created": 1611988419.0
    },
    {
        "author": "StocksAndSports",
        "body": "Lets get this shit out of the way right now. The reality of the situation is Robinhood does NOT have the liquidity or capital to support buys any further due to their clearing house being in house and run by baling wire and dreams. Their owners have a vested interest in ensuring they don't make the collateral demanded by the DTC to move the cash required.\n\nSo here's the fucking rub. There are two CONFIRMED brokers that will do anything in their fucking power to ensure we trade as much as we fucking want. They are...\n\n🚀🚀Fidelity and Vanguard🚀🚀. You want to know why? They both own millions of shares in GME, do you think they won't do whatever they absolutely can to ensure collateral is covered on GME? They are profiting hardcore off of this. We NEED to be throwing their weight behind them, they are the ONLY future we have if we need to be backing this stock as retail.\n\nThis weekend, we need to push harder than we ever have before to educate people on this reality. Robinhood is bush league shit for processing this kind of demand, and it's time we take it to the big boys like Fidelity and Vanguard to handle the rest of this.\n\nTLDR: Robinhood CANNOT SUPPORT OUR VOLUME. The ONLY brokers right now are Vanguard and Fidelity because they OWN GME SHARES. This is PERFECT for us. Their clearing houses will flip fucking gravity to keep us trading. PUSH ON.\n\nTake this opportunity by the balls and never let go. 🚀🚀🚀🚀🚀🚀\n\nUSE YOUR 💎🙌",
        "created_utc": 1612002449,
        "id": "glctg7f",
        "score": 2505,
        "subreddit": "wallstreetbets",
        "created": 1612031249.0
    },
    {
        "author": "Timesmyth",
        "body": "Fidelity owns a huge portion of GME; they want to take us to Pluto with them; they will never limit your GME buys.\n\nBuy and HOLD.",
        "created_utc": 1612044070,
        "id": "glevoue",
        "score": 2322,
        "subreddit": "wallstreetbets",
        "created": 1612072870.0
    },
    {
        "author": "Anxietyismymotiv8r",
        "body": "Fidelity has worked like a charm for me this whole ride",
        "created_utc": 1611843533,
        "id": "gl3abg7",
        "score": 2260,
        "subreddit": "wallstreetbets",
        "created": 1611872333.0
    },
    {
        "author": "unread1701",
        "body": "Everyone making a Fidelity account this weekend DO NOT FORGET to turn on real time price updates or else you are on a 15 min delay! make sure this gets spread around and upvoted it’s important as they don’t give you real time updates as a default setting!\n\nhttps://www.fidelity.com/customer-service/how-to-get-real-time-quotes\n\n💎👐",
        "created_utc": 1612103881,
        "id": "glhdxvc",
        "score": 2048,
        "subreddit": "wallstreetbets",
        "created": 1612132681.0
    },
    {
        "author": "dozerman23",
        "body": "When I signed up for fidelity a representative came to my home did my dishes and walked my dog. We are married with a beautiful daughter now.  Talk about customer service huh",
        "created_utc": 1611934275,
        "id": "gl8w4f0",
        "score": 1972,
        "subreddit": "wallstreetbets",
        "created": 1611963075.0
    },
    {
        "author": "Enlightened_Ghost_",
        "body": "I keep telling people to go to Fidelity. And all you new folk need to open multiple brokerage accounts, in case one malfunctions or does not allow you to trade at the most inopportune moment. Keep your clips loaded ALWAYS! Always keep money in your brokerage accounts (that means more than one, retards) so that you can fire on a moments notice and take advantage of opportunities. There will be other opportunities in the market, so set yourself up for success now by crossing your T's and dotting your I's. You see how dirty it can get. If you haven't done so, open more than one brokerage account with different firms, and always keep some money in them ready to buy opportunities.",
        "created_utc": 1611863725,
        "id": "gl4y3et",
        "score": 1897,
        "subreddit": "wallstreetbets",
        "created": 1611892525.0
    },
    {
        "author": "unread1701",
        "body": "Everyone making a Fidelity account this weekend DO NOT FORGET to turn on real time price updates or else you are on a 15 min delay! make sure this gets spread around and upvoted it’s important as they don’t give you real time updates as a default setting!\n\nhttps://www.fidelity.com/customer-service/how-to-get-real-time-quotes",
        "created_utc": 1612087528,
        "id": "glgu93b",
        "score": 1809,
        "subreddit": "wallstreetbets",
        "created": 1612116328.0
    },
    {
        "author": "x32321",
        "body": "Active Trader Pro (Fidelity desktop software) displays real time information.",
        "created_utc": 1612051707,
        "id": "glfav3d",
        "score": 1787,
        "subreddit": "wallstreetbets",
        "created": 1612080507.0
    },
    {
        "author": "FriendlyLawnmower",
        "body": "Fidelity and Vanguard have both been established for decades and manage trillions of dollars. For them, the billions they stand to make off GME stock is chump change and they don't give a fuck if some internet retards bleed a stupid hedge fund for billions.\n\nThe real reason they aren't blocking trades is because doing so would undermine customer trust and goodwill. Those are two things they've spent over 40 years building up. Fidelity and Vanguard are businesses in it for the long run and plan to make way more money than GME could ever make them.\n\nFurthermore, both companies process their own trades and clear them through subsidiaries they own. So they don't have to bow down to Citadel or any other Wall Street shit eaters like Robinhood does.\n\nWhen this is over, I highly recommend anyone with remaining stock in robinhood or other shady platforms moves it to Fidelity or Vanguard. They will keep trading because they stand more to gain from keeping our trust than anything related to GME.\n\nTL;DR: THIS RETARD IS RIGHT, USE FIDELITY OR VANGUARD TO BUY MORE GME STOCK",
        "created_utc": 1612004198,
        "id": "glcv9mf",
        "score": 1666,
        "subreddit": "wallstreetbets",
        "created": 1612032998.0
    },
    {
        "author": "swappinhood",
        "body": "I've never bought any GME despite having been involved since the beginning, but this is pretty fucked. And shows the entire reason why people are protest investing in the first place.\n\nI'm with Fidelity and they haven't set any limits.",
        "created_utc": 1611842070,
        "id": "gl3617t",
        "score": 1532,
        "subreddit": "investing",
        "created": 1611870870.0
    },
    {
        "author": "unread1701",
        "body": "Everyone making a Fidelity account this weekend DO NOT FORGET to turn on real time price updates or else you are on a 15 min delay! make sure this gets spread around and upvoted it’s important as they don’t give you real time updates as a default setting!\n\nhttps://www.fidelity.com/customer-service/how-to-get-real-time-quotes",
        "created_utc": 1612104293,
        "id": "glhenkx",
        "score": 1508,
        "subreddit": "wallstreetbets",
        "created": 1612133093.0
    },
    {
        "author": "dsa_key",
        "body": "OPTIONS:  Just posting this here to be helpful if you want to trade options with Fidelity you will need to go through the online portal or call customer service and ask them to unlock it.  They do options trading in tiers here is what the tiers look like.\n\n[Teirs](https://imgur.com/a/Hs0knOS)\n\nBe super nice to CS, every time I've called them they have been fucking awesome and  helpful.\n\nEdit: - [Link where you can apply for options trading for the lazy](https://www.fidelity.com/options-trading/overview)",
        "created_utc": 1612107304,
        "id": "glhjtur",
        "score": 1478,
        "subreddit": "wallstreetbets",
        "created": 1612136104.0
    },
    {
        "author": "ReactivRayzz",
        "body": "In headed to Fidelity 👌",
        "created_utc": 1611950123,
        "id": "gla4tx0",
        "score": 1469,
        "subreddit": "wallstreetbets",
        "created": 1611978923.0
    },
    {
        "author": "PM_ME_YOUR_SWISS_PIC",
        "body": "WE LIKE THE FIDELITY",
        "created_utc": 1611843593,
        "id": "gl3ai68",
        "score": 1462,
        "subreddit": "wallstreetbets",
        "created": 1611872393.0
    },
    {
        "author": "cjhrdtca",
        "body": "Everyone making a Fidelity account this weekend DO NOT FORGET to turn on real time price updates or else you are on a 15 min delay! make sure this gets spread around and upvoted it’s important as they don’t give you real time updates as a default setting!\n\nhttps://www.fidelity.com/customer-service/how-to-get-real-time-quotes\n\nIf you made a TD ameritrade also check that you’re set to real time quotes. There are tutorials on YouTube. \nThanks u/GrokAllTheHumans for the TD Ameritrade tip!!\n\n💎👐",
        "created_utc": 1612108837,
        "id": "glhmv1b",
        "score": 1434,
        "subreddit": "wallstreetbets",
        "created": 1612137637.0
    },
    {
        "author": "unread1701",
        "body": "Everyone making a Fidelity account this weekend DO NOT FORGET to turn on real time price updates or else you are on a 15 min delay! make sure this gets spread around and upvoted it’s important as they don’t give you real time updates as a default setting!\n\nhttps://www.fidelity.com/customer-service/how-to-get-real-time-quotes",
        "created_utc": 1612088095,
        "id": "glguthv",
        "score": 1386,
        "subreddit": "wallstreetbets",
        "created": 1612116895.0
    },
    {
        "author": "shantired",
        "body": "Fidelity. Here's how to transfer - this post was removed by the mods in w.s.b, and I don't know why:\n\n# Transferring from RH to Fidelity\n\nThis process is actually very simple. Earlier, I used to move \"mature\" positions from RH to Fidelity. I moved all my positions today. This is how I did this:\n\n1. Log on to your Fidelity trading account on a browser.\n2. In a different tab, log on to your RH account. Go to your info, and copy your RHS account number. Focus back on the Fidelity tab after copying this number.\n3. In the top right of the Fidelity home page, type \"transfer asset\". Click on the link, and you should be in the Transfer of Assets (TOA) page.\n4. Click on \"Start a transfer\"\n5. In the \"Select your current firm\" field, type \"Robinhood\". It should show up as \"Robinhood Securities Llc.\". Select that to go to the next step.\n6. In the next screen, paste the previously copied RH account number, and select \"individual\" in the account type.\n7. In the next screen, you can select a specific equity or the whole account. Like I mentioned above, earlier I used to transfer single equities, but today, I selected \"entire account\".\n8. I know that this works as I have transferred other accounts into Fidelity in the past without an issue (once I had an incorrect cost-basis, but that was taken care of with a phone call).\n9. Wait 2-3 days for your RH account to show nothing, and a day or two after that for everything to pop up on Fidelity.\n10. Now, you may shut down the RH account. Make sure you download ALL transactions before you close out the account. Who knows whether RH will even exist by the time it's the next tax filing season.",
        "created_utc": 1611937665,
        "id": "gl95htk",
        "score": 1311,
        "subreddit": "stocks",
        "created": 1611966465.0
    },
    {
        "author": "k4ylr",
        "body": "If you have capital to burn, consider opening brokerage accounts at non-skeezy brokers. Vanguard, while boomer-level has placed no restrictions on $GME in my personal experience.\n\nOther folks are sharing that Fidelity was a positive experience too. The popular platforms have showed their hand and it's attached to the same cancerous body.\n\nFind a new broker, get established, and gut them by removing our capital. They need us, we don't need them .\n\nI'm retarded, love medium rare paint chips and this ain't financial advice. I just love when my friends make money .",
        "created_utc": 1611983313,
        "id": "glc6a6u",
        "score": 1096,
        "subreddit": "wallstreetbets",
        "created": 1612012113.0
    },
    {
        "author": "broneilbro",
        "body": "Fidelity is solid. They are massive but the biggest thing is they are Privately held by the same family for decades and is written into the business rules that it will never go public.",
        "created_utc": 1612135046,
        "id": "glj78r4",
        "score": 1076,
        "subreddit": "wallstreetbets",
        "created": 1612163846.0
    },
    {
        "author": "rydogski",
        "body": "USE FIDELITY TOO",
        "created_utc": 1611951550,
        "id": "gla8xnh",
        "score": 1044,
        "subreddit": "wallstreetbets",
        "created": 1611980350.0
    },
    {
        "author": "Casual-Guy",
        "body": "Once this fiasco is over, I’m switching to fidelity . Hold on soldier. See you on the moon 🚀🚀",
        "created_utc": 1612124784,
        "id": "glilbkp",
        "score": 1024,
        "subreddit": "wallstreetbets",
        "created": 1612153584.0
    },
    {
        "author": "alpaca_snuggler",
        "body": "RH users: Fidelity is an alternative, sign up there",
        "created_utc": 1611925049,
        "id": "gl8a0ig",
        "score": 1024,
        "subreddit": "wallstreetbets",
        "created": 1611953849.0
    },
    {
        "author": "brookelynfd",
        "body": "Fidelity has been GREAT!",
        "created_utc": 1611851872,
        "id": "gl42fkh",
        "score": 998,
        "subreddit": "wallstreetbets",
        "created": 1611880672.0
    },
    {
        "author": "DunderMilton",
        "body": "**GME Weekend Homework Checklist:**\n\n✅ - Create a Fidelity brokerage account or a brokerage account with a platform that did not block or restrict trading. \n\n✅ - Authorize an account to deposit money into Fidelity. Fidelity offers up to $25,000 in instant deposit credit.\n\n✅ - Withdraw any money currently not invested but deposited into Robinhood &amp; other Brokerages restricting trading. \n\n✅ - HOOOOLLLDDD your Robinhood AMC &amp; GME stock.\n\n✅ - Setup live market pricing on Fidelity. In the app, go to More... ► Settings and Profile ► Quick Access ► Turn on Watch Lists &amp; Real Time Quotes. This feature is turned off by default and means Fidelity has a 15 minute delay on live ticker prices.\n\n✅ - Activate “Extended Hours Trading”. This allows you to trade on the markets before and after close for a set amount of extended time. To do so, you HAVE to be on the Fidelity website. Search in the top right hand search corner “Extended Hours Trading” and pick the article titled exactly that. Walk through the process to enable it. Others are saying to call Fidelity. Don’t. Customer service simply walks you through how to do it on your own from the Fidelity website. \n\n✅ - Rate Robinhood a 1-2 on the app and playstore. \n\n✅ - Rate Fidelity a 3 or 4 on the app and playstore. 5 star customer service but they deliver a 2 star experience on their god awful UI. Let’s do this to help convince Fidelity to modernize their brokerage app platform &amp; leave Robinhood in the dust. \n\n✅ - File complaints on Robinhood using SEC. [Link](https://www.sec.gov/oiea/Complaint.html)\n\n✅ - Class Action Lawsuits. If you believe you were negatively impacted by Robinhoods actions and believe you are entitled to compensation. Begin browsing r/ClassActionRobinhood for further information. Only sign up for the class action you believe has the strongest case. Don’t sign up immediately either. Allow the legal firms to continue developing their cases before determining the strongest.\n\n⚠️‼️This is not legal or financial advise. Merely the opinion and actions of a vested individual in this wild ride. Conduct your own due dilligence as the responsibility of your actions exists only within you‼️⚠️",
        "created_utc": 1612136664,
        "id": "gljaksd",
        "score": 991,
        "subreddit": "wallstreetbets",
        "created": 1612165464.0
    },
    {
        "author": "MrBrightside1013",
        "body": "**THESE PEOPLE HAVE MORE EXPERIENCE IN THE MARKET AND THE POWER TO THROW THEIR BIG MONEY NUTS AROUND!**\n\n**BE READY FOR TRICKS WE HAVE NOT SEEN BEFORE!**\n\n**HOLD! THEY CANT CHANGE MATH!**\n\n**ANY FUTURE PURCHASES SHOULD BE MADE ON FIDELITY OR VANGUARD**\n\n**THIS IS ABOUT RETARD CASINO TENDIES, BREAKING HEDGE FUNDS IS A SIDE EFFECT.**",
        "created_utc": 1612131028,
        "id": "gliyrre",
        "score": 933,
        "subreddit": "wallstreetbets",
        "created": 1612159828.0
    },
    {
        "author": "theWyzzerd",
        "body": "hijacking to comment this:\n\nTrigger the transfer from your new broker and they will start the process through the ACATS  system.  Let your new broker deal with RH's bullshit.  I did it this morning  with Fidelity.  You shouldn't have to provide any data from RH to your new broker other than your RH acct #.\n\n[https://www.finra.org/investors/learn-to-invest/brokerage-accounts/understanding-brokerage-account-transfer-process](https://www.finra.org/investors/learn-to-invest/brokerage-accounts/understanding-brokerage-account-transfer-process)",
        "created_utc": 1612053940,
        "id": "glff7ym",
        "score": 923,
        "subreddit": "wallstreetbets",
        "created": 1612082740.0
    },
    {
        "author": "terror_rizing",
        "body": "Not a lawyer but this smells like a huge class action lawsuit. \n\nRobinhood was easy to use and convenient, but it’s nice to always have a proper broker set up as well such as fidelity",
        "created_utc": 1611841120,
        "id": "gl33kep",
        "score": 917,
        "subreddit": "wallstreetbets",
        "created": 1611869920.0
    },
    {
        "author": "kingofthe2hole",
        "body": "Fidelity clears for themselves, because it doesn't cost them as much and they have enough in house to do it.\n\nFidelity has $3 trillion+ dollars under management. \n\nCompare that to $20 billion for RH.\n\nIf all of Robinhood's accounts and the other small brokers moved into Fidelity, it would be a percentage point compared to what is on their books.\n\nOn top of which, they are a private company who owns proprietary mutual finds so they don't have to worry about pissing off hedge funds or shareholders. They make money off people buying Fidelity funds and keeping their assets on their books.\n\nThey'd never pull some shit like RH, because their brand and sticky assets are what's valuable to them.",
        "created_utc": 1612035209,
        "id": "gled8ym",
        "score": 906,
        "subreddit": "stocks",
        "created": 1612064009.0
    },
    {
        "author": "darshit901",
        "body": "Exactly. This is all a part of their game plan. They'd rather get sued for a loss of say 2.5 billion because you couldn't buy at 300 and sell when it peaked at 1000(hypothetical) which is most you can prove legally, rather than give retail the ability to buy more and possibly create infinite losses. \nThis is what they need to do make sure they don't have to liquidate all their assets and go bankrupt. Take a one time lump sum loss.\nThis won't be the only loss they take though if 💎✋. You don't need to sell your Robinhood stocks to buy at other brokers though. If you were going to buy more on Robinhood, create a Fidelity account (Fidelity still allows buying) and buy there. It's all commission free. It doesn't even sell your data. On top of it, raise Robinhood customer requests to transfer your shares to Fidelity.\n\nTHIS IS NOT FINANCIAL ADVICE. THIS IS JUST MY OPINION ON SOMETHING SOMEONE CAN DO.",
        "created_utc": 1611845215,
        "id": "gl3fxq1",
        "score": 902,
        "subreddit": "wallstreetbets",
        "created": 1611874015.0
    },
    {
        "author": "Dionysos911",
        "body": "Fidelity let me bank transfer and instantly buy some GME just now.",
        "created_utc": 1611849452,
        "id": "gl3umru",
        "score": 876,
        "subreddit": "wallstreetbets",
        "created": 1611878252.0
    },
    {
        "author": "TheMailmanic",
        "body": "Lmao got the same email from fidelity \n\nWall st is running a coordinated attack on behalf of short sellers",
        "created_utc": 1610972412,
        "id": "gjppuh0",
        "score": 861,
        "subreddit": "wallstreetbets",
        "created": 1611001212.0
    },
    {
        "author": "kwiksi1ver",
        "body": "Screw them. They stopped it once. They can stop it again. Stick with companies who never stopped like Fidelity.",
        "created_utc": 1611866839,
        "id": "gl56t4j",
        "score": 856,
        "subreddit": "wallstreetbets",
        "created": 1611895639.0
    },
    {
        "author": "TinHawk",
        "body": "I treat my stocks like i treat Vegas, baby. Throw money into the fire. If it comes back to me, I'm fuckin delighted. If not, i mean... I threw it in the fire and expected never to see it again. Don't worry, i get my next UNEMPLOYMENT CHECK Monday, fuckers. More is coming. \n\nI'm tossin my extra $$$ into GME every time i find a goddamn quarter on the ground and i sleep easy. Log out of Stash/Fidelity and never look back. Idegaf. \n\nBuy the dip and hold on tight. 💍👏",
        "created_utc": 1611934933,
        "id": "gl8xy3s",
        "score": 844,
        "subreddit": "wallstreetbets",
        "created": 1611963733.0
    },
    {
        "author": "MissedYourUsername",
        "body": "Okay so listen up retards. I’m not experienced or well versed in stocks, but I play fighting games so I’ve gotten decent at seeing how others think. This is not financial advice, I’m applying smash bros logic to the stock market, thus diagnosing myself retarded more accurately than any doctor could. \n\nHedge funds are currently in deep shit and they know it. With their shorts forcing them to pay so much per day, and all the news causing more people to buy in, I’m certain they are desperate to get people to fucking sell at any cost, legal or otherwise. \n\nI believe GME will go to 1000 on Monday, and that the shorts want and plan on it. With Fidelity accounts being authorized, the weekends worth of time for people to read up and be confident in buying, and the fact that it’s the first of the month so even Grammy can yolo into GameStop. 🚀🚀🚀🚀🚀 \n\nMelvin has realized they can’t stop this, and will use it to their advantage. They’ll help buy to get it up to 1k, and then sell like hell. This will cause the stock to spike up and then down CRAZY FAST. So many people will panic sell thinking the squeeze is squoze, and it will cause more people to sell causing the stock to drop continuously. \n\nTHAT IS IF YOU DONT BELIEVE IN THE RETAIL INVESTORS DIAMOND FUCKING HANDS. \n\nDo not sell and buy the dip for an easy return, it will lead to the price dropping too far. Do not believe that the squeeze is squoze, 1k is not believable imo. \n\nIf this is their plan, they will CRUSH reliable sources. This subreddit will go down. The news sites will spam SELL SELL SELL. Other sites will get ddosed. \n\nI am here to tell you, this is a Ganondorf reversing his neutral b hoping you will roll.\n\nI AM HERE TO TELL YOU THAT I WILL NOT SELL. \n\nI AM HERE TO TELL YOU THAT IF THIS FAILS, THE NEW FLOOR IS $1000!!!!\n\n💎🙌💎🙌💎🙌",
        "created_utc": 1612128787,
        "id": "glitwrr",
        "score": 831,
        "subreddit": "wallstreetbets",
        "created": 1612157587.0
    },
    {
        "author": "eversnow64",
        "body": "Thanks Ape. You just saved this fellow Fucktard.  I couldn't figure out on Friday wtf was going on. Google said a different price than my Fidelity app. Damn I really am retarded. 🚀🚀🚀\n\nHOLD!!!! 💎💎💎💎💎",
        "created_utc": 1612102992,
        "id": "glhcgcs",
        "score": 819,
        "subreddit": "wallstreetbets",
        "created": 1612131792.0
    },
    {
        "author": "beFoRyOu",
        "body": "Confirmed Fidelity has literally the best customer service",
        "created_utc": 1612108268,
        "id": "glhlpz9",
        "score": 812,
        "subreddit": "wallstreetbets",
        "created": 1612137068.0
    },
    {
        "author": "Qikqok",
        "body": "For those looking to buy more GME stock, use Fidelity / Vanguard, so as to not worry about Robinhood shitshow. \n\nIf you already have a 401k or HSA account, Fidelity opens a separate brokerage account and transfers money from bank (NOT 401k) into brokerage - all within 2 hours!!\n\nUse Fidelity / Vanguard to buy more GME. \n\nNOT A FINANACIAL ADVICE / NOT A FINANCIAL ADVISOR.",
        "created_utc": 1612010697,
        "id": "gld2grm",
        "score": 807,
        "subreddit": "wallstreetbets",
        "created": 1612039497.0
    },
    {
        "author": "STWAICM",
        "body": "Open a fidelity account",
        "created_utc": 1611934252,
        "id": "gl8w28e",
        "score": 804,
        "subreddit": "wallstreetbets",
        "created": 1611963052.0
    },
    {
        "author": "Dessiato",
        "body": "Lets get this shit out of the way right now. The reality of the situation is Robinhood does NOT have the liquidity or capital to support buys any further due to their clearing house being in house and run by baling wire and dreams. Their owners have a vested interest in ensuring they don't make the collateral demanded by the DTC to move the cash required.\n\nSo here's the fucking rub. There are two CONFIRMED brokers that will do anything in their fucking power to ensure we trade as much as we fucking want. They are...\n\n🚀🚀Fidelity and Vanguard🚀🚀. You want to know why? They both own millions of shares in GME, do you think they won't do whatever they absolutely can to ensure collateral is covered on GME? They are profiting hardcore off of this. We NEED to be throwing their weight behind them, they are the ONLY future we have if we need to be backing this stock as retail.\n\nThis weekend, we need to push harder than we ever have before to educate people on this reality. Robinhood is bush league shit for processing this kind of demand, and it's time we take it to the big boys like Fidelity and Vanguard to handle the rest of this.\n\nTLDR: Robinhood CANNOT SUPPORT OUR VOLUME. The ONLY brokers right now are Vanguard and Fidelity because they OWN GME SHARES. This is PERFECT for us. Their clearing houses will flip fucking gravity to keep us trading. PUSH ON.\n\nTake this opportunity by the balls and never let go. 🚀🚀🚀🚀🚀🚀\n\nUSE YOUR 💎🙌",
        "created_utc": 1611969990,
        "id": "glbgcas",
        "score": 803,
        "subreddit": "wallstreetbets",
        "created": 1611998790.0
    },
    {
        "author": "michael_maybe44",
        "body": "**JOIN VANGUARD OR FIDELITY RIGHT NOW!!!**",
        "created_utc": 1612014572,
        "id": "gld7qid",
        "score": 786,
        "subreddit": "wallstreetbets",
        "created": 1612043372.0
    },
    {
        "author": "jamiehasaboner",
        "body": "Already trabferring all my assets to fidelity. Fuck Robinhood",
        "created_utc": 1611849377,
        "id": "gl3ueeh",
        "score": 782,
        "subreddit": "wallstreetbets",
        "created": 1611878177.0
    },
    {
        "author": "modelcitizen64",
        "body": "Fidelity still works",
        "created_utc": 1611844693,
        "id": "gl3e2ia",
        "score": 765,
        "subreddit": "wallstreetbets",
        "created": 1611873493.0
    },
    {
        "author": "ed1380",
        "body": "leave that abusive relationship. fidelity or ameritrade aren't as pretty but they'll treat you better",
        "created_utc": 1611990945,
        "id": "glch666",
        "score": 758,
        "subreddit": "wallstreetbets",
        "created": 1612019745.0
    },
    {
        "author": "Spacey_Penguin",
        "body": "Lol, even Fidelity is telling me not to sell.",
        "created_utc": 1611865150,
        "id": "gl523o4",
        "score": 744,
        "subreddit": "wallstreetbets",
        "created": 1611893950.0
    },
    {
        "author": "ExtraLifeMan",
        "body": "I really like GME.\n\nI like it a lot.\n\nThirteen shares\n\nis what I've got.\n\nI've got thirteen shares.\n\nThey're Fidelity and gay,\n\nand I've given each one a special name.\n\nI've got a share named Bob,\n\nand a share named Bob,\n\nand two shares called Bob and Bob.\n\nThen there's Bob my share and Bob my share,\n\nand my share, known as Bob, of course.\n\nThere's my share, Bob, and his share wife, Bob,\n\ntheir kids Bob, Bob, and Bob,\n\nand her boyfriend,\n\nDeep Fucking Value the Third.",
        "created_utc": 1611967774,
        "id": "glbbtz5",
        "score": 742,
        "subreddit": "wallstreetbets",
        "created": 1611996574.0
    },
    {
        "author": "DownvoteBruhrn",
        "body": "&amp;#x200B;\n\nListen up ding dongs, the next few days are extremely important for us to do something and stop prolonging the inevitable.\n\nLets get this shit out of the way right now. The reality of the situation is Robinhood does NOT have the liquidity or capital to support buys any further due to their clearing house being in house and run by baling wire and dreams. Their owners have a vested interest in ensuring they don't make the collateral demanded by the DTC to move the cash required.\n\nSo here's the fucking rub. There are two CONFIRMED brokers that will do anything in their fucking power to ensure we trade as much as we fucking want. They are...\n\n🚀🚀Fidelity and Vanguard🚀🚀##\n\nYou want to know why? They both own millions of shares in GME, do you think they won't do whatever they absolutely can to ensure collateral is covered on GME? They are profiting hardcore off of this. We NEED to be throwing their weight behind them, they are the ONLY future we have if we need to be backing this stock as retail.\n\nThis weekend, we need to push harder than we ever have before to educate people on this reality. Robinhood is bush league shit for processing this kind of demand, and it's time we take it to the big boys like Fidelity and Vanguard to handle the rest of this.\n\nSO MOVE THE FUCK AWAY FROM ROBINHOOD AND MAKE YOURSELF AN ACCOUNT AT EITHER OF THE TWO RELIABLE BROKERS. However do not transfer your portfolio as this can take weeks. Instead use RH to only sell once the squeeze is sqoze @$4200.69 and beyond.##\n\nTLDR: Robinhood CANNOT SUPPORT OUR VOLUME. The ONLY brokers right now are Vanguard and Fidelity because they OWN GME SHARES. This is PERFECT for us. Their clearing houses will flip fucking gravity to keep us trading. PUSH ON.\n\nTake these next 2 days by the balls and get yourself a new brokerage. 🚀🚀🚀🚀🚀🚀\n\nUSE YOUR 💎🙌",
        "created_utc": 1612075031,
        "id": "glgg841",
        "score": 712,
        "subreddit": "wallstreetbets",
        "created": 1612103831.0
    },
    {
        "author": "olmikeyy",
        "body": "I had some ready too (not that much).  Opened with fidelity and I am fucking *done* with RH asap",
        "created_utc": 1611850207,
        "id": "gl3wub4",
        "score": 712,
        "subreddit": "wallstreetbets",
        "created": 1611879007.0
    },
    {
        "author": "photo1kjb",
        "body": "Fidelity still going strong for freedom fry eaters.",
        "created_utc": 1611845531,
        "id": "gl3h2is",
        "score": 710,
        "subreddit": "wallstreetbets",
        "created": 1611874331.0
    },
    {
        "author": "IfOneThenHappy",
        "body": "vanguard and fidelity, please tell everyone. robinhood isn’t the only way",
        "created_utc": 1611952541,
        "id": "glabs8x",
        "score": 691,
        "subreddit": "wallstreetbets",
        "created": 1611981341.0
    },
    {
        "author": "Ab3duhBabe",
        "body": "Gonna switch over to Fidelity after this. Fuck the rest the rest of the platforms that halted buying they love being submissive.",
        "created_utc": 1611846399,
        "id": "gl3k57a",
        "score": 688,
        "subreddit": "wallstreetbets",
        "created": 1611875199.0
    },
    {
        "author": "ForensicPaints",
        "body": "**GET THE FUCK OFF ROBINHOOD.**\n\n#FIDELITY",
        "created_utc": 1611943799,
        "id": "gl9mthw",
        "score": 687,
        "subreddit": "wallstreetbets",
        "created": 1611972599.0
    },
    {
        "author": "Tite_Reddit_Name",
        "body": "Every major brokerage has zero fees now (still small fees on options which is standard). Fidelity, Schwab, Ameritrade, e trade etc",
        "created_utc": 1611843034,
        "id": "gl38s0u",
        "score": 680,
        "subreddit": "wallstreetbets",
        "created": 1611871834.0
    },
    {
        "author": "solidmussel",
        "body": "Fidelity has proved to be a worthwhile brokerage\n\nAnyone on robinhood needs to leave.  This shouldn't be tolerated.",
        "created_utc": 1611844125,
        "id": "gl3c7jl",
        "score": 673,
        "subreddit": "investing",
        "created": 1611872925.0
    },
    {
        "author": "desquibnt",
        "body": "Fidelity owns a huge portion of GME because the shares are in their index funds not because they're long GME as a company. They aren't going to sell you the shares that are in their funds",
        "created_utc": 1612048355,
        "id": "glf4d5t",
        "score": 672,
        "subreddit": "wallstreetbets",
        "created": 1612077155.0
    },
    {
        "author": "PhilosophersTaint",
        "body": "Fidelity is 🎰",
        "created_utc": 1611941254,
        "id": "gl9fnhc",
        "score": 671,
        "subreddit": "wallstreetbets",
        "created": 1611970054.0
    },
    {
        "author": "cjhrdtca",
        "body": "Everyone making a Fidelity account this weekend DO NOT FORGET to turn on real time price updates or else you are on a 15 min delay! make sure this gets spread around and upvoted it’s important as they don’t give you real time updates as a default setting!\n\nhttps://www.fidelity.com/customer-service/how-to-get-real-time-quotes\n\nIf you made a TD ameritrade also check that you’re set to real time quotes. There are tutorials on YouTube. \nThanks u/GrokAllTheHumans for the TD Ameritrade tip!!\n\n💎👐",
        "created_utc": 1612108798,
        "id": "glhms5w",
        "score": 654,
        "subreddit": "wallstreetbets",
        "created": 1612137598.0
    },
    {
        "author": "unread1701",
        "body": "Everyone making a Fidelity account this weekend DO NOT FORGET to turn on real time price updates or else you are on a 15 min delay! make sure this gets spread around and upvoted it’s important as they don’t give you real time updates as a default setting!\n\nhttps://www.fidelity.com/customer-service/how-to-get-real-time-quotes",
        "created_utc": 1612102404,
        "id": "glhbilh",
        "score": 642,
        "subreddit": "wallstreetbets",
        "created": 1612131204.0
    },
    {
        "author": "spauldingzero",
        "body": "BUY WITH FIDELITY ! UPVOTE SO WE ALL KNOW !",
        "created_utc": 1611850343,
        "id": "gl3x9pe",
        "score": 633,
        "subreddit": "wallstreetbets",
        "created": 1611879143.0
    },
    {
        "author": "LornAltElthMer",
        "body": "I called Fidelity on Friday cause my 401K is there and I had to talk about something.\n\nTook about 2 hours to get through.\n\nDude was taking care of stuff for me and I was all...So, do you think Gamestop is a good investment?\n\nHe chuckled for a sec and said that he works in a heavily regulated industry so can't really discuss that, however he'd found it to be an interesting thing to observe.",
        "created_utc": 1612135127,
        "id": "glj7erx",
        "score": 632,
        "subreddit": "wallstreetbets",
        "created": 1612163927.0
    },
    {
        "author": "Vismonte",
        "body": "I already bought on fidelity. I’m just saying what happened on robinhood, plus a lot of my monies was in robinhood previous to all this shit.",
        "created_utc": 1611952770,
        "id": "glacfga",
        "score": 607,
        "subreddit": "wallstreetbets",
        "created": 1611981570.0
    },
    {
        "author": "Revlong57",
        "body": "That's the thing. BlackRock owns 11% of the company, Vanguard owns 7%, Fidelity owns 14%, etc. These big funds are making bank. Plus, all the HFT with their order flow data are also coming up on top. Sure, some people are losing a lot, but others are getting paid.",
        "created_utc": 1612033092,
        "id": "gle8mjf",
        "score": 598,
        "subreddit": "wallstreetbets",
        "created": 1612061892.0
    },
    {
        "author": "camv271",
        "body": "I can switch to fidelity! Does it allow instant transfers? I want to get some more gme but would it take days to accept payment before I can buy more?",
        "created_utc": 1611944695,
        "id": "gl9pacl",
        "score": 593,
        "subreddit": "wallstreetbets",
        "created": 1611973495.0
    },
    {
        "author": "sunnynina",
        "body": "I literally just signed up with fidelity, it took ten minutes. Linked my ordinary checking and transferred funds, they were available to trade within three minutes. I'm happy; it's very user friendly.",
        "created_utc": 1611942389,
        "id": "gl9itty",
        "score": 586,
        "subreddit": "wallstreetbets",
        "created": 1611971189.0
    },
    {
        "author": "TheKarateKid_",
        "body": "Yup. Fidelity is GME's **largest** shareholder. **They own 13.7% of the company.** Makes total sense they're one of the only ones who didn't restrict anything.",
        "created_utc": 1612020025,
        "id": "gldgwkv",
        "score": 584,
        "subreddit": "wallstreetbets",
        "created": 1612048825.0
    },
    {
        "author": "specialdialingwand1",
        "body": "FIDELITY HAS INSTANT ACCOUNT APPROVAL AND INSTANT BUYING POWER FROM TRANSFERS FROM YOUR LINKED BANK ACCOUNT. SPREAD THIS SHIT!",
        "created_utc": 1611951115,
        "id": "gla7nu4",
        "score": 582,
        "subreddit": "wallstreetbets",
        "created": 1611979915.0
    },
    {
        "author": "esean_keni",
        "body": "##REPOST FOR VISIBILITY##\n\nListen up ding dongs, the next few days are extremely important for us to do something and stop prolonging the inevitable. \n\n\nLets get this shit out of the way right now. The reality of the situation is Robinhood does NOT have the liquidity or capital to support buys any further due to their clearing house being in house and run by baling wire and dreams. Their owners have a vested interest in ensuring they don't make the collateral demanded by the DTC to move the cash required.\n\nSo here's the fucking rub. There are two CONFIRMED brokers that will do anything in their fucking power to ensure we trade as much as we fucking want. They are...\n\n##🚀🚀Fidelity and Vanguard🚀🚀##\n\nYou want to know why? They both own millions of shares in GME, do you think they won't do whatever they absolutely can to ensure collateral is covered on GME? They are profiting hardcore off of this. We NEED to be throwing their weight behind them, they are the ONLY future we have if we need to be backing this stock as retail.\n\nThis weekend, we need to push harder than we ever have before to educate people on this reality. Robinhood is bush league shit for processing this kind of demand, and it's time we take it to the big boys like Fidelity and Vanguard to handle the rest of this. \n\n##SO MOVE THE FUCK AWAY FROM ROBINHOOD AND MAKE YOURSELF AN ACCOUNT AT EITHER OF THE TWO RELIABLE BROKERS. However do not transfer your portfolio as this can take weeks. Instead use RH to only sell once the squeeze is sqoze  @$4200.69 and beyond.##\n\nTLDR: Robinhood CANNOT SUPPORT OUR VOLUME. The ONLY brokers right now are Vanguard and Fidelity because they OWN GME SHARES. This is PERFECT for us. Their clearing houses will flip fucking gravity to keep us trading. PUSH ON.\n\nTake these next 2 days by the balls and get yourself a new brokerage. 🚀🚀🚀🚀🚀🚀\n\nUSE YOUR 💎🙌",
        "created_utc": 1612018398,
        "id": "glddyzz",
        "score": 572,
        "subreddit": "wallstreetbets",
        "created": 1612047198.0
    },
    {
        "author": "Briterac",
        "body": "These brokers allow buying\n\nWebull\n\nTd ameritrade\n\nSchwab\n\nEtrade\n\nFidelity\n\nsaxo\n\neToro\n\ncapital.com\n\nIf you know of more or if ive made a mistake please comment below and i will update",
        "created_utc": 1611847557,
        "id": "gl3ocg8",
        "score": 565,
        "subreddit": "investing",
        "created": 1611876357.0
    },
    {
        "author": "Subverto_",
        "body": "I switched to Fidelity after yesterday because fuck Robinhood. Bought 40 shares on each dip today.",
        "created_utc": 1611956176,
        "id": "glam566",
        "score": 559,
        "subreddit": "wallstreetbets",
        "created": 1611984976.0
    },
    {
        "author": "danielthelee96",
        "body": "Come to fidelity comrade. They’ve never let me down.",
        "created_utc": 1611864875,
        "id": "gl51bco",
        "score": 555,
        "subreddit": "wallstreetbets",
        "created": 1611893675.0
    },
    {
        "author": "Deadpoetic12",
        "body": "Yeah, I just opened E-Trade, fidelity, webull...gonna ditch Robbinghood in two or three weeks hopefully, depends on how long the squeeze takes cause I don't want to freeze up my GME stocks by transferring.",
        "created_utc": 1611864377,
        "id": "gl4zwqo",
        "score": 554,
        "subreddit": "wallstreetbets",
        "created": 1611893177.0
    },
    {
        "author": "unread1701",
        "body": "Everyone making a Fidelity account this weekend DO NOT FORGET to turn on real time price updates or else you are on a 15 min delay! make sure this gets spread around and upvoted it’s important as they don’t give you real time updates as a default setting!\n\nhttps://www.fidelity.com/customer-service/how-to-get-real-time-quotes",
        "created_utc": 1612088590,
        "id": "glgvbfj",
        "score": 551,
        "subreddit": "wallstreetbets",
        "created": 1612117390.0
    },
    {
        "author": "PCC_ninja",
        "body": "Fidelity is still working for me.",
        "created_utc": 1611840398,
        "id": "gl31tjh",
        "score": 550,
        "subreddit": "wallstreetbets",
        "created": 1611869198.0
    },
    {
        "author": "HazyLifu",
        "body": "replying to OP for visibility.\n\n⚠️⚠️⚠️⚠️⚠️ Everyone making a Fidelity account this weekend DO NOT FORGET to turn on real time price updates or else you are on a 15 min delay! make sure this gets spread around and upvoted it’s important as they don’t give you real time updates as a default setting! ⚠️⚠️⚠️⚠️⚠️\n\nhttps://www.fidelity.com/customer-service/how-to-get-real-time-quotes",
        "created_utc": 1612070242,
        "id": "glg9802",
        "score": 547,
        "subreddit": "wallstreetbets",
        "created": 1612099042.0
    },
    {
        "author": "tendeeznuts",
        "body": "*Hi this is Tyler from Fidelity! I understand youd like to adj..*\n\n**100% GME** \n\n*Umm, adjust your 401k alloc..*\n\n**100% GME**\n\n*401k allocation.. umm how would you lik..*\n\n**100% GME TYLER**\n\n*Uh, we dont recommend 100% of funds be directed to an individual secu..*\n\n**ONE HUNDRED PERCENT**",
        "created_utc": 1611091771,
        "id": "gjvi2df",
        "score": 547,
        "subreddit": "wallstreetbets",
        "created": 1611120571.0
    },
    {
        "author": "mrbungles-",
        "body": "Sign up for Fidelity. They are one of the few brokers who didn’t pull sketchy shit yesterday and your funds are instantly available to trade",
        "created_utc": 1611944374,
        "id": "gl9oeeu",
        "score": 544,
        "subreddit": "wallstreetbets",
        "created": 1611973174.0
    },
    {
        "author": "dakU7",
        "body": "Same. Fidelity looks like it was designed by two boomers and a paint brush but I'm a loyal customer after today.",
        "created_utc": 1611870634,
        "id": "gl5hhhj",
        "score": 541,
        "subreddit": "wallstreetbets",
        "created": 1611899434.0
    },
    {
        "author": "Comdent",
        "body": "I'm still waiting for fidelity to verify my bank",
        "created_utc": 1612043584,
        "id": "gleuosf",
        "score": 536,
        "subreddit": "wallstreetbets",
        "created": 1612072384.0
    },
    {
        "author": "BeeJuice",
        "body": "Seriously. that was the only reason I set up a RH account in the first place. I have a 401k with fidelity but the UI is terrible which is what kept me from setting up a regular brokerage account acct for a while. \n\nWelp, I’ll manage to deal with it now..",
        "created_utc": 1612135169,
        "id": "glj7hx7",
        "score": 533,
        "subreddit": "wallstreetbets",
        "created": 1612163969.0
    },
    {
        "author": "TheGuyWhoEats1234",
        "body": "NOT AN ADVISOR OR ADVICE. I AM 2IQ RETREDED.\n\nI heard you can make an account on charles schwab or fidelity. you add money, then choose the stock and buy it. Tons of youtube videos out there showing how.\n\n&amp;#x200B;\n\nNOT AN ADVISOR OR ADVICE. I AM 2IQ RETREDED.",
        "created_utc": 1611886629,
        "id": "gl6ir55",
        "score": 531,
        "subreddit": "wallstreetbets",
        "created": 1611915429.0
    },
    {
        "author": "XavierVoid",
        "body": "Going all in on $BB this is a great price, and I'm selling all my blue chip and adding more later with Fidelity.",
        "created_utc": 1611960045,
        "id": "glav6oa",
        "score": 528,
        "subreddit": "wallstreetbets",
        "created": 1611988845.0
    },
    {
        "author": "Mattgunner25",
        "body": "Buying more on fidelity.  Take this stock from my cold dead diamond hands",
        "created_utc": 1611933998,
        "id": "gl8vcff",
        "score": 525,
        "subreddit": "wallstreetbets",
        "created": 1611962798.0
    },
    {
        "author": "clown-penisdotfart",
        "body": "Fidelity has fantastic customer service. They want you to invest through them.",
        "created_utc": 1611933619,
        "id": "gl8u9cd",
        "score": 525,
        "subreddit": "wallstreetbets",
        "created": 1611962419.0
    },
    {
        "author": "Dr_Watson349",
        "body": "DID WASHINGTON GIVE UP WHEN THE NAZIS BOMBED THE ALAMO??\n\nNO HE DID NOT. HE HELD THE LINE.\n\nI WENT TO FIDELITY  - MADE AN ACCOUNT - PUT IN FUNDS AND BOUGHT  MORE - TOOK 10 MINS\n\n&amp;#x200B;\n\nWE ARE ALL IN THIS TOGETHER BROTHERS AND SISTERS",
        "created_utc": 1611862257,
        "id": "gl4u362",
        "score": 522,
        "subreddit": "wallstreetbets",
        "created": 1611891057.0
    },
    {
        "author": "stevo427",
        "body": "Switched from Robinhood to Fidelity and in the process bought more GME then I had before. All because of this!!! 🚀🚀",
        "created_utc": 1611867285,
        "id": "gl582ib",
        "score": 505,
        "subreddit": "wallstreetbets",
        "created": 1611896085.0
    },
    {
        "author": "Joey4Options",
        "body": "FIDELITY HAS INSTANT BUY POWER BY THE WAY EVERYONE. EASY AS CREATE ACCOUNT, LINK BANK, TRANSFER FUNDS. Boom, buying power. \n\nFuck RobinUs\n\nGME = MOON 🚀",
        "created_utc": 1612046339,
        "id": "glf0afs",
        "score": 502,
        "subreddit": "wallstreetbets",
        "created": 1612075139.0
    },
    {
        "author": "Sixspeeddreams",
        "body": "My friend who’s a fidelity broker said they opened 200k accounts yesterday. Normally it’s less than 15k",
        "created_utc": 1611967410,
        "id": "glbb3vp",
        "score": 500,
        "subreddit": "wallstreetbets",
        "created": 1611996210.0
    },
    {
        "author": "CauseISaidSo_",
        "body": "I'm standing firm with my GME and BB\n\nShout out to fidelity. I will never forget they didn't back down when Robinhood did",
        "created_utc": 1611863486,
        "id": "gl4xfvh",
        "score": 22504,
        "subreddit": "wallstreetbets",
        "created": 1611892286.0
    },
    {
        "author": "vat456",
        "body": "Fidelity still letting me buy. Got an instant deposit of 10k too. Spread the word.",
        "created_utc": 1611843661,
        "id": "gl3aptm",
        "score": 12392,
        "subreddit": "wallstreetbets",
        "created": 1611872461.0
    },
    {
        "author": "Fair_Chart3403",
        "body": "To those that didn't get it on reading: the short squeeze didn't just work, it worked so well that we almost broke stuff.\n\nIt's not just shorters that could not get the shares they needed. The BROKERS RAN OUT OF SHARES and couldn't find places to borrow them! You wanna know why fidelity and vanguard were the only two standing? They hold something like over 20% of the gamestop shares. They could let you buy, BECAUSE THEY WERE THE ONLY ONES WHO COULD GET SHARES. The squeeze is squozing, and the only way out of $100k+ share prices which would break everything was to STOP THE MARKET.",
        "created_utc": 1611875187,
        "id": "gl5swdn",
        "score": 10464,
        "subreddit": "wallstreetbets",
        "created": 1611903987.0
    },
    {
        "author": "uSrNm-ALrEAdy-TaKeN",
        "body": "I’m not rich but I saw what was happening with Robinhood and others, opened up a fidelity account and bought one share of GME (first stock purchase ever).\n\nMOON OR BUST \n🚀🚀🚀🚀🚀🚀🚀🚀",
        "created_utc": 1611867297,
        "id": "gl583no",
        "score": 6705,
        "subreddit": "wallstreetbets",
        "created": 1611896097.0
    },
    {
        "author": "memebetch6969",
        "body": "Every NEW investor get your ass to fidelity!! How are we not pinning this on the god damn homepage????",
        "created_utc": 1611943748,
        "id": "gl9moip",
        "score": 5508,
        "subreddit": "wallstreetbets",
        "created": 1611972548.0
    },
    {
        "author": "Milkpowder44",
        "body": "Hop on Fidelity!",
        "created_utc": 1611842413,
        "id": "gl36yil",
        "score": 5175,
        "subreddit": "wallstreetbets",
        "created": 1611871213.0
    },
    {
        "author": "katarific05",
        "body": "This helps to hear. I like to know I can step away today and just watch for dips to buy today. I can’t set a high sell limit on fidelity.... so I’ll eyeball that squzz next week 💎🙌",
        "created_utc": 1611937766,
        "id": "gl95rto",
        "score": 3641,
        "subreddit": "wallstreetbets",
        "created": 1611966566.0
    },
    {
        "author": "meta-cognizant",
        "body": "Fidelity was up all day yesterday. I really like Fidelity.",
        "created_utc": 1611842231,
        "id": "gl36glx",
        "score": 2964,
        "subreddit": "wallstreetbets",
        "created": 1611871031.0
    },
    {
        "author": "dgravel24",
        "body": "I COULDNT FIND THE SELL BUTTON ON MY FIDELITY APP SO I BOUGHT MORE 💎✋",
        "created_utc": 1611937701,
        "id": "gl95lfn",
        "score": 2720,
        "subreddit": "wallstreetbets",
        "created": 1611966501.0
    },
    {
        "author": "Giulio-Cesare",
        "body": "RH returned one of my transfers after it had cleared then slapped with me some \"account deficient\" tag and told me as a penalty I wouldn't be able to buy anything until Feb 8th even if I put more money in and I've temporarily lost immediate deposits now.\n\nLike bro the money was there, you just decided to reverse it after it had went through.\n\nTried to go to Fidelity but they're saying it'll take 5-6 days for my bank account to link.\n\nWhat the fuck can I do. I have money and I want to buy more GME but it's like the world in conspiring against me.",
        "created_utc": 1611959619,
        "id": "glau84e",
        "score": 2533,
        "subreddit": "wallstreetbets",
        "created": 1611988419.0
    },
    {
        "author": "Anxietyismymotiv8r",
        "body": "Fidelity has worked like a charm for me this whole ride",
        "created_utc": 1611843533,
        "id": "gl3abg7",
        "score": 2260,
        "subreddit": "wallstreetbets",
        "created": 1611872333.0
    },
    {
        "author": "dozerman23",
        "body": "When I signed up for fidelity a representative came to my home did my dishes and walked my dog. We are married with a beautiful daughter now.  Talk about customer service huh",
        "created_utc": 1611934275,
        "id": "gl8w4f0",
        "score": 1972,
        "subreddit": "wallstreetbets",
        "created": 1611963075.0
    },
    {
        "author": "Enlightened_Ghost_",
        "body": "I keep telling people to go to Fidelity. And all you new folk need to open multiple brokerage accounts, in case one malfunctions or does not allow you to trade at the most inopportune moment. Keep your clips loaded ALWAYS! Always keep money in your brokerage accounts (that means more than one, retards) so that you can fire on a moments notice and take advantage of opportunities. There will be other opportunities in the market, so set yourself up for success now by crossing your T's and dotting your I's. You see how dirty it can get. If you haven't done so, open more than one brokerage account with different firms, and always keep some money in them ready to buy opportunities.",
        "created_utc": 1611863725,
        "id": "gl4y3et",
        "score": 1897,
        "subreddit": "wallstreetbets",
        "created": 1611892525.0
    },
    {
        "author": "swappinhood",
        "body": "I've never bought any GME despite having been involved since the beginning, but this is pretty fucked. And shows the entire reason why people are protest investing in the first place.\n\nI'm with Fidelity and they haven't set any limits.",
        "created_utc": 1611842070,
        "id": "gl3617t",
        "score": 1532,
        "subreddit": "investing",
        "created": 1611870870.0
    },
    {
        "author": "ReactivRayzz",
        "body": "In headed to Fidelity 👌",
        "created_utc": 1611950123,
        "id": "gla4tx0",
        "score": 1469,
        "subreddit": "wallstreetbets",
        "created": 1611978923.0
    },
    {
        "author": "PM_ME_YOUR_SWISS_PIC",
        "body": "WE LIKE THE FIDELITY",
        "created_utc": 1611843593,
        "id": "gl3ai68",
        "score": 1462,
        "subreddit": "wallstreetbets",
        "created": 1611872393.0
    },
    {
        "author": "shantired",
        "body": "Fidelity. Here's how to transfer - this post was removed by the mods in w.s.b, and I don't know why:\n\n# Transferring from RH to Fidelity\n\nThis process is actually very simple. Earlier, I used to move \"mature\" positions from RH to Fidelity. I moved all my positions today. This is how I did this:\n\n1. Log on to your Fidelity trading account on a browser.\n2. In a different tab, log on to your RH account. Go to your info, and copy your RHS account number. Focus back on the Fidelity tab after copying this number.\n3. In the top right of the Fidelity home page, type \"transfer asset\". Click on the link, and you should be in the Transfer of Assets (TOA) page.\n4. Click on \"Start a transfer\"\n5. In the \"Select your current firm\" field, type \"Robinhood\". It should show up as \"Robinhood Securities Llc.\". Select that to go to the next step.\n6. In the next screen, paste the previously copied RH account number, and select \"individual\" in the account type.\n7. In the next screen, you can select a specific equity or the whole account. Like I mentioned above, earlier I used to transfer single equities, but today, I selected \"entire account\".\n8. I know that this works as I have transferred other accounts into Fidelity in the past without an issue (once I had an incorrect cost-basis, but that was taken care of with a phone call).\n9. Wait 2-3 days for your RH account to show nothing, and a day or two after that for everything to pop up on Fidelity.\n10. Now, you may shut down the RH account. Make sure you download ALL transactions before you close out the account. Who knows whether RH will even exist by the time it's the next tax filing season.",
        "created_utc": 1611937665,
        "id": "gl95htk",
        "score": 1311,
        "subreddit": "stocks",
        "created": 1611966465.0
    },
    {
        "author": "rydogski",
        "body": "USE FIDELITY TOO",
        "created_utc": 1611951550,
        "id": "gla8xnh",
        "score": 1044,
        "subreddit": "wallstreetbets",
        "created": 1611980350.0
    },
    {
        "author": "alpaca_snuggler",
        "body": "RH users: Fidelity is an alternative, sign up there",
        "created_utc": 1611925049,
        "id": "gl8a0ig",
        "score": 1024,
        "subreddit": "wallstreetbets",
        "created": 1611953849.0
    },
    {
        "author": "brookelynfd",
        "body": "Fidelity has been GREAT!",
        "created_utc": 1611851872,
        "id": "gl42fkh",
        "score": 998,
        "subreddit": "wallstreetbets",
        "created": 1611880672.0
    },
    {
        "author": "terror_rizing",
        "body": "Not a lawyer but this smells like a huge class action lawsuit. \n\nRobinhood was easy to use and convenient, but it’s nice to always have a proper broker set up as well such as fidelity",
        "created_utc": 1611841120,
        "id": "gl33kep",
        "score": 917,
        "subreddit": "wallstreetbets",
        "created": 1611869920.0
    },
    {
        "author": "darshit901",
        "body": "Exactly. This is all a part of their game plan. They'd rather get sued for a loss of say 2.5 billion because you couldn't buy at 300 and sell when it peaked at 1000(hypothetical) which is most you can prove legally, rather than give retail the ability to buy more and possibly create infinite losses. \nThis is what they need to do make sure they don't have to liquidate all their assets and go bankrupt. Take a one time lump sum loss.\nThis won't be the only loss they take though if 💎✋. You don't need to sell your Robinhood stocks to buy at other brokers though. If you were going to buy more on Robinhood, create a Fidelity account (Fidelity still allows buying) and buy there. It's all commission free. It doesn't even sell your data. On top of it, raise Robinhood customer requests to transfer your shares to Fidelity.\n\nTHIS IS NOT FINANCIAL ADVICE. THIS IS JUST MY OPINION ON SOMETHING SOMEONE CAN DO.",
        "created_utc": 1611845215,
        "id": "gl3fxq1",
        "score": 902,
        "subreddit": "wallstreetbets",
        "created": 1611874015.0
    },
    {
        "author": "Dionysos911",
        "body": "Fidelity let me bank transfer and instantly buy some GME just now.",
        "created_utc": 1611849452,
        "id": "gl3umru",
        "score": 876,
        "subreddit": "wallstreetbets",
        "created": 1611878252.0
    },
    {
        "author": "TheMailmanic",
        "body": "Lmao got the same email from fidelity \n\nWall st is running a coordinated attack on behalf of short sellers",
        "created_utc": 1610972412,
        "id": "gjppuh0",
        "score": 861,
        "subreddit": "wallstreetbets",
        "created": 1611001212.0
    },
    {
        "author": "kwiksi1ver",
        "body": "Screw them. They stopped it once. They can stop it again. Stick with companies who never stopped like Fidelity.",
        "created_utc": 1611866839,
        "id": "gl56t4j",
        "score": 856,
        "subreddit": "wallstreetbets",
        "created": 1611895639.0
    },
    {
        "author": "TinHawk",
        "body": "I treat my stocks like i treat Vegas, baby. Throw money into the fire. If it comes back to me, I'm fuckin delighted. If not, i mean... I threw it in the fire and expected never to see it again. Don't worry, i get my next UNEMPLOYMENT CHECK Monday, fuckers. More is coming. \n\nI'm tossin my extra $$$ into GME every time i find a goddamn quarter on the ground and i sleep easy. Log out of Stash/Fidelity and never look back. Idegaf. \n\nBuy the dip and hold on tight. 💍👏",
        "created_utc": 1611934933,
        "id": "gl8xy3s",
        "score": 844,
        "subreddit": "wallstreetbets",
        "created": 1611963733.0
    },
    {
        "author": "STWAICM",
        "body": "Open a fidelity account",
        "created_utc": 1611934252,
        "id": "gl8w28e",
        "score": 804,
        "subreddit": "wallstreetbets",
        "created": 1611963052.0
    },
    {
        "author": "jamiehasaboner",
        "body": "Already trabferring all my assets to fidelity. Fuck Robinhood",
        "created_utc": 1611849377,
        "id": "gl3ueeh",
        "score": 782,
        "subreddit": "wallstreetbets",
        "created": 1611878177.0
    },
    {
        "author": "modelcitizen64",
        "body": "Fidelity still works",
        "created_utc": 1611844693,
        "id": "gl3e2ia",
        "score": 765,
        "subreddit": "wallstreetbets",
        "created": 1611873493.0
    },
    {
        "author": "Spacey_Penguin",
        "body": "Lol, even Fidelity is telling me not to sell.",
        "created_utc": 1611865150,
        "id": "gl523o4",
        "score": 744,
        "subreddit": "wallstreetbets",
        "created": 1611893950.0
    },
    {
        "author": "olmikeyy",
        "body": "I had some ready too (not that much).  Opened with fidelity and I am fucking *done* with RH asap",
        "created_utc": 1611850207,
        "id": "gl3wub4",
        "score": 712,
        "subreddit": "wallstreetbets",
        "created": 1611879007.0
    },
    {
        "author": "photo1kjb",
        "body": "Fidelity still going strong for freedom fry eaters.",
        "created_utc": 1611845531,
        "id": "gl3h2is",
        "score": 710,
        "subreddit": "wallstreetbets",
        "created": 1611874331.0
    },
    {
        "author": "IfOneThenHappy",
        "body": "vanguard and fidelity, please tell everyone. robinhood isn’t the only way",
        "created_utc": 1611952541,
        "id": "glabs8x",
        "score": 691,
        "subreddit": "wallstreetbets",
        "created": 1611981341.0
    },
    {
        "author": "Ab3duhBabe",
        "body": "Gonna switch over to Fidelity after this. Fuck the rest the rest of the platforms that halted buying they love being submissive.",
        "created_utc": 1611846399,
        "id": "gl3k57a",
        "score": 688,
        "subreddit": "wallstreetbets",
        "created": 1611875199.0
    },
    {
        "author": "ForensicPaints",
        "body": "**GET THE FUCK OFF ROBINHOOD.**\n\n#FIDELITY",
        "created_utc": 1611943799,
        "id": "gl9mthw",
        "score": 687,
        "subreddit": "wallstreetbets",
        "created": 1611972599.0
    },
    {
        "author": "Tite_Reddit_Name",
        "body": "Every major brokerage has zero fees now (still small fees on options which is standard). Fidelity, Schwab, Ameritrade, e trade etc",
        "created_utc": 1611843034,
        "id": "gl38s0u",
        "score": 680,
        "subreddit": "wallstreetbets",
        "created": 1611871834.0
    },
    {
        "author": "solidmussel",
        "body": "Fidelity has proved to be a worthwhile brokerage\n\nAnyone on robinhood needs to leave.  This shouldn't be tolerated.",
        "created_utc": 1611844125,
        "id": "gl3c7jl",
        "score": 673,
        "subreddit": "investing",
        "created": 1611872925.0
    },
    {
        "author": "PhilosophersTaint",
        "body": "Fidelity is 🎰",
        "created_utc": 1611941254,
        "id": "gl9fnhc",
        "score": 671,
        "subreddit": "wallstreetbets",
        "created": 1611970054.0
    },
    {
        "author": "spauldingzero",
        "body": "BUY WITH FIDELITY ! UPVOTE SO WE ALL KNOW !",
        "created_utc": 1611850343,
        "id": "gl3x9pe",
        "score": 633,
        "subreddit": "wallstreetbets",
        "created": 1611879143.0
    },
    {
        "author": "Vismonte",
        "body": "I already bought on fidelity. I’m just saying what happened on robinhood, plus a lot of my monies was in robinhood previous to all this shit.",
        "created_utc": 1611952770,
        "id": "glacfga",
        "score": 607,
        "subreddit": "wallstreetbets",
        "created": 1611981570.0
    },
    {
        "author": "camv271",
        "body": "I can switch to fidelity! Does it allow instant transfers? I want to get some more gme but would it take days to accept payment before I can buy more?",
        "created_utc": 1611944695,
        "id": "gl9pacl",
        "score": 593,
        "subreddit": "wallstreetbets",
        "created": 1611973495.0
    },
    {
        "author": "sunnynina",
        "body": "I literally just signed up with fidelity, it took ten minutes. Linked my ordinary checking and transferred funds, they were available to trade within three minutes. I'm happy; it's very user friendly.",
        "created_utc": 1611942389,
        "id": "gl9itty",
        "score": 586,
        "subreddit": "wallstreetbets",
        "created": 1611971189.0
    },
    {
        "author": "specialdialingwand1",
        "body": "FIDELITY HAS INSTANT ACCOUNT APPROVAL AND INSTANT BUYING POWER FROM TRANSFERS FROM YOUR LINKED BANK ACCOUNT. SPREAD THIS SHIT!",
        "created_utc": 1611951115,
        "id": "gla7nu4",
        "score": 582,
        "subreddit": "wallstreetbets",
        "created": 1611979915.0
    },
    {
        "author": "Briterac",
        "body": "These brokers allow buying\n\nWebull\n\nTd ameritrade\n\nSchwab\n\nEtrade\n\nFidelity\n\nsaxo\n\neToro\n\ncapital.com\n\nIf you know of more or if ive made a mistake please comment below and i will update",
        "created_utc": 1611847557,
        "id": "gl3ocg8",
        "score": 565,
        "subreddit": "investing",
        "created": 1611876357.0
    },
    {
        "author": "Subverto_",
        "body": "I switched to Fidelity after yesterday because fuck Robinhood. Bought 40 shares on each dip today.",
        "created_utc": 1611956176,
        "id": "glam566",
        "score": 559,
        "subreddit": "wallstreetbets",
        "created": 1611984976.0
    },
    {
        "author": "danielthelee96",
        "body": "Come to fidelity comrade. They’ve never let me down.",
        "created_utc": 1611864875,
        "id": "gl51bco",
        "score": 555,
        "subreddit": "wallstreetbets",
        "created": 1611893675.0
    },
    {
        "author": "Deadpoetic12",
        "body": "Yeah, I just opened E-Trade, fidelity, webull...gonna ditch Robbinghood in two or three weeks hopefully, depends on how long the squeeze takes cause I don't want to freeze up my GME stocks by transferring.",
        "created_utc": 1611864377,
        "id": "gl4zwqo",
        "score": 554,
        "subreddit": "wallstreetbets",
        "created": 1611893177.0
    },
    {
        "author": "PCC_ninja",
        "body": "Fidelity is still working for me.",
        "created_utc": 1611840398,
        "id": "gl31tjh",
        "score": 550,
        "subreddit": "wallstreetbets",
        "created": 1611869198.0
    },
    {
        "author": "tendeeznuts",
        "body": "*Hi this is Tyler from Fidelity! I understand youd like to adj..*\n\n**100% GME** \n\n*Umm, adjust your 401k alloc..*\n\n**100% GME**\n\n*401k allocation.. umm how would you lik..*\n\n**100% GME TYLER**\n\n*Uh, we dont recommend 100% of funds be directed to an individual secu..*\n\n**ONE HUNDRED PERCENT**",
        "created_utc": 1611091771,
        "id": "gjvi2df",
        "score": 547,
        "subreddit": "wallstreetbets",
        "created": 1611120571.0
    },
    {
        "author": "mrbungles-",
        "body": "Sign up for Fidelity. They are one of the few brokers who didn’t pull sketchy shit yesterday and your funds are instantly available to trade",
        "created_utc": 1611944374,
        "id": "gl9oeeu",
        "score": 544,
        "subreddit": "wallstreetbets",
        "created": 1611973174.0
    },
    {
        "author": "dakU7",
        "body": "Same. Fidelity looks like it was designed by two boomers and a paint brush but I'm a loyal customer after today.",
        "created_utc": 1611870634,
        "id": "gl5hhhj",
        "score": 541,
        "subreddit": "wallstreetbets",
        "created": 1611899434.0
    },
    {
        "author": "TheGuyWhoEats1234",
        "body": "NOT AN ADVISOR OR ADVICE. I AM 2IQ RETREDED.\n\nI heard you can make an account on charles schwab or fidelity. you add money, then choose the stock and buy it. Tons of youtube videos out there showing how.\n\n&amp;#x200B;\n\nNOT AN ADVISOR OR ADVICE. I AM 2IQ RETREDED.",
        "created_utc": 1611886629,
        "id": "gl6ir55",
        "score": 531,
        "subreddit": "wallstreetbets",
        "created": 1611915429.0
    },
    {
        "author": "XavierVoid",
        "body": "Going all in on $BB this is a great price, and I'm selling all my blue chip and adding more later with Fidelity.",
        "created_utc": 1611960045,
        "id": "glav6oa",
        "score": 528,
        "subreddit": "wallstreetbets",
        "created": 1611988845.0
    },
    {
        "author": "Mattgunner25",
        "body": "Buying more on fidelity.  Take this stock from my cold dead diamond hands",
        "created_utc": 1611933998,
        "id": "gl8vcff",
        "score": 525,
        "subreddit": "wallstreetbets",
        "created": 1611962798.0
    },
    {
        "author": "clown-penisdotfart",
        "body": "Fidelity has fantastic customer service. They want you to invest through them.",
        "created_utc": 1611933619,
        "id": "gl8u9cd",
        "score": 525,
        "subreddit": "wallstreetbets",
        "created": 1611962419.0
    },
    {
        "author": "Dr_Watson349",
        "body": "DID WASHINGTON GIVE UP WHEN THE NAZIS BOMBED THE ALAMO??\n\nNO HE DID NOT. HE HELD THE LINE.\n\nI WENT TO FIDELITY  - MADE AN ACCOUNT - PUT IN FUNDS AND BOUGHT  MORE - TOOK 10 MINS\n\n&amp;#x200B;\n\nWE ARE ALL IN THIS TOGETHER BROTHERS AND SISTERS",
        "created_utc": 1611862257,
        "id": "gl4u362",
        "score": 522,
        "subreddit": "wallstreetbets",
        "created": 1611891057.0
    },
    {
        "author": "stevo427",
        "body": "Switched from Robinhood to Fidelity and in the process bought more GME then I had before. All because of this!!! 🚀🚀",
        "created_utc": 1611867285,
        "id": "gl582ib",
        "score": 505,
        "subreddit": "wallstreetbets",
        "created": 1611896085.0
    },
    {
        "author": "nexisfan",
        "body": "Open a fidelity account. It’s not as pretty or as user-friendly as Robinhood but at least they won’t sell your shares at a fucking loss without your permission.\n\nNot financial advice. I’m a dummy. Do your research.",
        "created_utc": 1611889478,
        "id": "gl6oyra",
        "score": 498,
        "subreddit": "wallstreetbets",
        "created": 1611918278.0
    },
    {
        "author": "bluewhitecup",
        "body": "I PUT STOP LOSS AT 200 BECAUSE IM DUMB BUT I RE BOUGHT ALL OF IT AT 230 BECAUSE I LIKE THE STOCK. ALSO USE FIDELITY THEY LET YOU BUY INSTANTLY AFTER YOU TRANSFER MONEY",
        "created_utc": 1611859291,
        "id": "gl4m5lw",
        "score": 497,
        "subreddit": "wallstreetbets",
        "created": 1611888091.0
    },
    {
        "author": "GoddamnRelapse",
        "body": "Switch to Fidelity!",
        "created_utc": 1611882945,
        "id": "gl6aleo",
        "score": 495,
        "subreddit": "wallstreetbets",
        "created": 1611911745.0
    },
    {
        "author": "LeastAttempt",
        "body": "Send me updates I'll repost\n\nPlatforms not restricting trading: Fidelity (whole shares only), WeBull, Chase, Think or Swim, TD, Schwaub, SoFi, Vanguard, Tastyworks, and CashApp (AMC Only). Cover and move. Hold your positions in the corrupt brokerage while moving money into the others and buy GME and AMC. We need to unite and fight back.\n\nSign up TODAY so your application is approved TOMORROW.\n\nUPDATED BROKER LIST TO BUY GME\n\n🇨🇦CANADA - TD, WEALTHSIMPLE, RBC DIRECT INVEST, SCOTIA iTRADE, CIBC, QTRADE\n\n🇬🇧🇪🇺UK/EUROPE - FREETRADE PLUS,  DEGIRO, SCALABLE CAPITAL, REVOLUT, HARGREAVES LANDSDOWNE, AJ BELL\n\n🇸🇪NORDICS - NORDNET, AVANZA (SWEDEN)\n\n🇩🇰 DENMARK - SAXO\n\n🇩🇪 GERMANY - CAPITAL.COM\n\n🇦🇺 AUSTRALIA- ETORO, CMC, COMMSEC\n\nYou can copy and paste under the text where the three vertical dots next to the gift icon are 👇👇👇👇👇",
        "created_utc": 1611868286,
        "id": "gl5ay2f",
        "score": 484,
        "subreddit": "wallstreetbets",
        "created": 1611897086.0
    },
    {
        "author": "Hypo_E",
        "body": "I called up Fidelity earlier today and made them move my GME from margin to cash.  \n\n\nThey confirmed that my shares (14,000 shares) will not be loaned out.  \n\n\n🚀🚀🚀🚀🚀🚀🚀",
        "created_utc": 1611087673,
        "id": "gjv8tb9",
        "score": 483,
        "subreddit": "wallstreetbets",
        "created": 1611116473.0
    },
    {
        "author": "TidiBoi",
        "body": "GME is way cheaper on fidelity 👌",
        "created_utc": 1611951673,
        "id": "gla9a03",
        "score": 481,
        "subreddit": "wallstreetbets",
        "created": 1611980473.0
    },
    {
        "author": "facegun",
        "body": "Just bought 5 more on Fidelity. FUCK RH!",
        "created_utc": 1611951868,
        "id": "gla9u4l",
        "score": 476,
        "subreddit": "wallstreetbets",
        "created": 1611980668.0
    },
    {
        "author": "DaMadV",
        "body": "&gt;Shitron gives us 5 reasons why GameStop will go back to $20\n\n&gt;I BUY \n\n&gt;Melvin says they’re out\n\n&gt;I BUY\n\n&gt;Robinhood includes risk warning for GME\n\n&gt;*I BUY *\n\n&gt;Robinhood disables buying\n\n&gt;I BUY (ON FIDELITY)\n\n&gt;Cramer tells us to get out now\n\n&gt;I BUY\n\n&gt;When are they gonna learn that we know they’re not looking for our best interest? \n\n&gt;These people hate you and want you to be broke sitting at home all day watching Netflix and ordering shit off amazon. \n\n&gt;we’re gonna do the opposite of what they say. 💎👏\n\n&gt;(NOT FINANICAL ADVICE)\n\nSounds like good DD. I'm in.",
        "created_utc": 1611948467,
        "id": "gla01ys",
        "score": 458,
        "subreddit": "wallstreetbets",
        "created": 1611977267.0
    },
    {
        "author": "mario854",
        "body": "I'ma go with Fidelity for now",
        "created_utc": 1611865168,
        "id": "gl525e0",
        "score": 456,
        "subreddit": "wallstreetbets",
        "created": 1611893968.0
    },
    {
        "author": "Confusedsquirrel20",
        "body": "Don’t close out your robinhood!! But do also make a Fidelity. But for now keep gme money in Rh purchase more in fidelity",
        "created_utc": 1611945776,
        "id": "gl9scfh",
        "score": 437,
        "subreddit": "wallstreetbets",
        "created": 1611974576.0
    },
    {
        "author": "chargersfan3421",
        "body": "Shitron gives us 5 reasons why GME will go back to $20\n\n**I BUY** \n\nMelvin says they're out\n\n**I BUY**\n\nRobinhood includes risk warning for GME\n\n**I BUY**\n\nRobinhood disables buying GME\n\n**I BUY (ON FIDELITY)**\n\nCramer tells us to get out now\n\n**I BUY**\n\nWhen are they gonna learn that we know they’re not looking out for our best interest? \n\nThese people hate you and want you to be broke so that they can lecture you about how bad you are with money and how they had owned a house and two cars by the time they were 23. \n\nWhatever they tell me to do, I'm going to do the opposite. 💎👏\n\n(NOT FINANCIAL ADVICE, AM RETARDED)",
        "created_utc": 1611944041,
        "id": "gl9nh43",
        "score": 424,
        "subreddit": "wallstreetbets",
        "created": 1611972841.0
    },
    {
        "author": "HeBoughtALot",
        "body": "I like the stawk. Buy on Fidelity.",
        "created_utc": 1611849918,
        "id": "gl3vzlb",
        "score": 422,
        "subreddit": "wallstreetbets",
        "created": 1611878718.0
    },
    {
        "author": "MasterdahMeme",
        "body": "People around here giving themselves way too much credit.  That whale picked the price from $250@2:30PM and pushed it to $320@3:15PM.  \n\nDon't get me wrong guys we're diamond handing with the best of them, but we're riding some biiiig fish too.\n\nMy take is Blackrock/Fidelity/Vanguard want to put Citadel out of business.",
        "created_utc": 1611964507,
        "id": "glb534v",
        "score": 421,
        "subreddit": "wallstreetbets",
        "created": 1611993307.0
    },
    {
        "author": "dessydes",
        "body": "As soon as the squeeze is over I am moving to another platform. I can't take a chance on whenever they feel like delisting another stock next time. They did something other firms didn't and for that, I will never trust them again. I am thinking Fidelity or Vanguard.",
        "created_utc": 1611927272,
        "id": "gl8e6q8",
        "score": 411,
        "subreddit": "wallstreetbets",
        "created": 1611956072.0
    },
    {
        "author": "PIKACHU_THE_FALLEN",
        "body": "FIDELITY FIDELITY FIDELITY!! You can make an account, no approval time, instant fund transfer, and no blocks on GME, AMD, NOK or BB",
        "created_utc": 1611950978,
        "id": "gla7a02",
        "score": 407,
        "subreddit": "wallstreetbets",
        "created": 1611979778.0
    },
    {
        "author": "Edwardigan",
        "body": "\"This is an industry-wide thing\" he says. \n\nMy roommate was able to trade through his bank's brokerage. \n\nMy coworker was able to trade through Fidelity.\n\nHedgefunds were able to trade no issue. \n\nI think maybe we have different definitions of industry-wide.",
        "created_utc": 1611908132,
        "id": "gl7n2hp",
        "score": 405,
        "subreddit": "wallstreetbets",
        "created": 1611936932.0
    },
    {
        "author": "DenXOffWhite",
        "body": "copy &amp; paste!\n\nUPDATED++++ BROKER LIST TO BUY GME\n\n🇺🇲USA - ETRADE, &lt;FIDELITY, VANGUARD,&gt; DOUGH, SoFi, CHASE, AJ Bell &lt;recommended&gt; 🇨🇦CANADA - TD, WEALTHSIMPLE, RBC DIRECT INVEST, SCOTIA iTRADE, CIBC\n\n🇬🇧🇪🇺UK/EUROPE - FREETRADE PLUS, SCALABLE CAPITAL, HARGREAVES LANDSDOWNE, AJ BELL, IG, REVOLUT\n\n🇪🇸- NinetyNine\n\n🇦🇺Aus- Stake (might be laggy apparently), Sharesies?, Hatch, IG\n\n🇸🇪NORDICS - NORDNET, AVANZA, SaxoTraderGO, Swedbanks (SWEDEN)\n\nTurkey: Gedik Yatırım\n\nBased on info via reddit Disclaimer: be careful who you use, avoid shady shit, I’m just relaying info, not financial advice, things are constantly changing stop calling me a liar on 2h old posts\n\nEdit: Dunno the answers to some of your questions. Sorry. Please ask others as they may know better than me.\n\nAlso I am not a bot I am a human so please be slower lol\n\nI haven’t been able to update it since I have to study, but if you can please update",
        "created_utc": 1611870603,
        "id": "gl5heb1",
        "score": 401,
        "subreddit": "wallstreetbets",
        "created": 1611899403.0
    },
    {
        "author": "IMB88",
        "body": "Fidelity",
        "created_utc": 1611859951,
        "id": "gl4nurm",
        "score": 393,
        "subreddit": "wallstreetbets",
        "created": 1611888751.0
    },
    {
        "author": "ajfonty",
        "body": "FIDELITY NEVER STOPPED ITS USERS FROM TRADING GME.\n\nThank you to the GOOD BROKERS out there that aren't giving into the corruption!",
        "created_utc": 1611858538,
        "id": "gl4kl2t",
        "score": 389,
        "subreddit": "wallstreetbets",
        "created": 1611887338.0
    },
    {
        "author": "OkieAndBrokie",
        "body": "Already cancelled my Robinhood account and transferred the money out.  Fuck them.  It's sad that Fidelity is allowing me to trade, but the one company that was supposed to be about \"the people\" is fucking their clients over in the name of protecting these big investors.  Fuck off Robinhood.",
        "created_utc": 1611859344,
        "id": "gl4map3",
        "score": 388,
        "subreddit": "wallstreetbets",
        "created": 1611888144.0
    },
    {
        "author": "just-another-post",
        "body": "TD Ameritrade and Fidelity are allowing trades.",
        "created_utc": 1611845603,
        "id": "gl3hbok",
        "score": 387,
        "subreddit": "wallstreetbets",
        "created": 1611874403.0
    },
    {
        "author": "TacoUniform",
        "body": "Friendship ended with Robbinghood\n\nNow Fidelity is my best friend",
        "created_utc": 1611966160,
        "id": "glb8jt9",
        "score": 386,
        "subreddit": "wallstreetbets",
        "created": 1611994960.0
    },
    {
        "author": "PiBolarBear",
        "body": "it's your bank requiring pre-note, not fidelity. other banking institutions allow immediate transfer. if you can wire from your bank to the broker you'll be fine.",
        "created_utc": 1611848441,
        "id": "gl3rem2",
        "score": 383,
        "subreddit": "wallstreetbets",
        "created": 1611877241.0
    },
    {
        "author": "theSEman9",
        "body": "Total noob question: Will I get to keep my current open positions I bought on RH? I don't have to actually CLOSE/SELL my RH positions first prior to initiating the transfer to Fidelity?",
        "created_utc": 1611951168,
        "id": "gla7tam",
        "score": 379,
        "subreddit": "stocks",
        "created": 1611979968.0
    },
    {
        "author": "TommyBoyTC",
        "body": "That would explain why fidelity works still (as far as I know). Family and employee owned. Don't think citadel is involved.",
        "created_utc": 1611851685,
        "id": "gl41rya",
        "score": 378,
        "subreddit": "wallstreetbets",
        "created": 1611880485.0
    },
    {
        "author": "BridgetheDivide",
        "body": "I hear Fidelity didn't pull this shit so I'm making them my primary now.",
        "created_utc": 1611874108,
        "id": "gl5qc8s",
        "score": 371,
        "subreddit": "wallstreetbets",
        "created": 1611902908.0
    },
    {
        "author": "ionized_fallout",
        "body": "When the market opens tomorrow, am I able to buy shares at todays close rate of $292?  Im a total fucking retard so please forgive me.  Just put all my savings, $1,025 into my fidelity account and want to buy buy buy.",
        "created_utc": 1611803648,
        "id": "gl1ir85",
        "score": 366,
        "subreddit": "wallstreetbets",
        "created": 1611832448.0
    },
    {
        "author": "bluriest",
        "body": "Once the infinity squeeze is over next week I'm closing my account and never letting them play with another dime of my money. Same with Merrill Edge cause they're pulling the same shit in my IRA.\n\nI'm probably moving to Fidelity but I'm open to any suggestions.",
        "created_utc": 1611852653,
        "id": "gl44zms",
        "score": 361,
        "subreddit": "wallstreetbets",
        "created": 1611881453.0
    },
    {
        "author": "Always-Learning4",
        "body": "Looks like Fidelity hasn't blocked purchase of GME so far. And from my experience, they have the best customer service of any company I've ever dealt with.",
        "created_utc": 1611844823,
        "id": "gl3ejg1",
        "score": 355,
        "subreddit": "investing",
        "created": 1611873623.0
    },
    {
        "author": "lamusegouda",
        "body": "This is exactly what I did. But man, fidelity interface is not nearly as user friendly as RH. But fuck it, this is the way",
        "created_utc": 1611934179,
        "id": "gl8vut1",
        "score": 353,
        "subreddit": "wallstreetbets",
        "created": 1611962979.0
    },
    {
        "author": "DenXOffWhite",
        "body": "copy &amp; paste! BETTER MORNING UPDATE!\n\nUPDATED++++ BROKER LIST TO BUY GME\n\n🇺🇲USA - &lt;FIDELITY, VANGUARD,&gt; DOUGH, CHASE, AJ Bell, WeBull, Morgan Stanley, Passfolio 🇨🇦CANADA - TD, WEALTHSIMPLE, RBC DIRECT INVEST, SCOTIA iTRADE, CIBC, BMO InvestorLine, QTrade, Tastywork, NBDB\n\n🇬🇧🇪🇺UK/EUROPE - SCALABLE CAPITAL, HARGREAVES LANDSDOWNE, AJ BELL, IG, REVOLUT, DEGIRO, Regiobank, KeyTrade Bank (Belgium), Binckbank (Belgium), Flatex (Germany), EToro (Spain), ING (Germany), DKB (Germany), Swissquote (Switzerland), Comdirect, Bolero (Belgium), DZ BANK (Germany)\n\n🇪🇸- NinetyNine, Revolut\n\n🇦🇺Aus- Stake (might be laggy apparently), Sharesies?, Hatch, IG, SelfWealth\n\nNew Zealand: Sharesies, Hatch, Stake\n\n🇸🇪NORDICS - NORDNET, AVANZA, SaxoTraderGO, Swedbanks (SWEDEN)\n\nTurkey: Gedik Yatırım, İŞCEP\n\nInternational:TD Ameritrade, Schwab accepts international customers and it is said to be good!\n\nTradeRepublic is generally ok but sometimes bs with them happens beware of this!!! 212 and IKBR too.\n\nu/zachp004 has a great list too, check him out!\n\nBased on info via reddit Disclaimer: be careful who you use, avoid shady shit, I’m just relaying info, not financial advice, things are constantly changing stop calling me a liar on 2h old posts\n\nEdit: Dunno the answers to some of your questions. Sorry. Please ask others as they may know better than me.\n\nAlso I am not a bot I am a human so please be slower lol\n\nI haven’t been able to update it since I have to study, but if you can please update\n\nList is pretty good but not perfect, I am a student and I do all edits by hand. Sorry if any site is wrong now.\n\nList may be wrong use at your own risk\n\nAlso did what most of the people in threads say so if you have any recommendations to the list just say here\n\nBETTER MORNING UPDATE!!! ADDED AND REMOVED ACCORDING TO 100+ REDDITORS! LET’S GO!\n\nALSO NEWBIES THERE IS A LINK GETTING SEND PLEASE DON’T CLICK SOME RANDOM LINKS IT IS PROBABLY A SCAM. LINK IS SOMETHING SQUEEZE OR SOMETHING LIKE THAT.",
        "created_utc": 1611933984,
        "id": "gl8vau9",
        "score": 350,
        "subreddit": "wallstreetbets",
        "created": 1611962784.0
    },
    {
        "author": "Gravehowl",
        "body": "I just got in on Fidelity. Total retard but should I drop 10k on this now? Real question.  Trying to turn these baby hands to diamonds 💎",
        "created_utc": 1611932318,
        "id": "gl8qhqx",
        "score": 335,
        "subreddit": "wallstreetbets",
        "created": 1611961118.0
    },
    {
        "author": "Wheel4tendies",
        "body": "**When This is over remember which platforms did not try to steal your tendies**\n\n- Fidelity - I opened an account and will be closing my TD and Robinhood",
        "created_utc": 1611889798,
        "id": "gl6po2j",
        "score": 334,
        "subreddit": "wallstreetbets",
        "created": 1611918598.0
    },
    {
        "author": "SgtMajMythic",
        "body": "Schwab and Fidelity allow you to buy. Upvote so people see.",
        "created_utc": 1611851556,
        "id": "gl41ber",
        "score": 331,
        "subreddit": "wallstreetbets",
        "created": 1611880356.0
    },
    {
        "author": "defeatenemy",
        "body": " \n\n\\*\\*Robinhood is still trying to fuck us, limiting people's position to 5 shares maximum on GME.\\*\\*Spread the word everywhere, this needs to be blown up. They will **NOT** allow you to add to your position if you already own more than the allotted amount.\n\n**COPY/PASTE THIS TO KEEP THE INFO UP, OR GET IT PINNED, I've been at it all day and have to try and get some sleep.**\n\n**LET USERS KNOW SO THEY CAN MAKE BROKER MOVEMENTS IF NECESSARY, THIS IS HIGHWAY ROBBERY**\n\n**IF YOU KNOW OF BROKERS THAT ALLOW SAME DAY USE OF FUNDS, PLEASE MAKE A LIST, SHARE THEM AROUND.**\n\n**EDIT: GOING TO YOUR BANK TO WIRE MONEY INTO YOUR BROKERAGE ACCOUNT IS THE FASTEST WAY TO GET FUNDS, MANY WILL GET YOU ACCESS TO YOUR MONEY SAME DAY, WITHIN HOURS. E-TRADE ACCEPTS WIRES, TD AMERITRADE TAKES WIRE TRANSFERS AND ACH TRANSFERS, WHICH IS FASTER THAN A WIRE.**\n\n**Confirmed reports of at least $1k available for use on a Fidelity account. Tastytrade has 1k instant funds and no announced purchase limits CashApp has been mentioned as well IG may allow instant access if the funds are confirmed First Trade is another possibility, supposedly you can wire money to your account and receive it within a couple hours. Supposedly Schwab will not allow it on a volatile stock.**\n\n**Currently Chase, Schwab, Fidelity TDAmeritrade, and Morgan Stanley have not set limits on purchases of stock.**\n\n[https://robinhood.com/support/articles/5u3FDQTWzsH0yNQ4sJXYsZ/changes-due-to-recent-market-volatility/](https://robinhood.com/support/articles/5u3FDQTWzsH0yNQ4sJXYsZ/changes-due-to-recent-market-volatility/)\n\n**MOST IMPORTANT OF ALL, STAY 💎✋ FRIDAY IS NOT A DESIGNATED SELL DAY, DO NOT ASSUME TODAY IS THE DAY TO SELL DO NOT SPREAD THE WORD TO SELL**",
        "created_utc": 1611905920,
        "id": "gl7jztw",
        "score": 329,
        "subreddit": "Wallstreetbetsnew",
        "created": 1611934720.0
    },
    {
        "author": "Jc696",
        "body": "Fidelity, they didn't closed GME",
        "created_utc": 1611881111,
        "id": "gl66jby",
        "score": 324,
        "subreddit": "wallstreetbets",
        "created": 1611909911.0
    },
    {
        "author": "KR6363",
        "body": "Heard fidelity and webull are solid options. Looking into both currently.",
        "created_utc": 1611848881,
        "id": "gl3sux2",
        "score": 321,
        "subreddit": "wallstreetbets",
        "created": 1611877681.0
    },
    {
        "author": "greatA-1",
        "body": "Literally just kept spewing that he had to \"comply with SEC requirements\". When pointed out that the SEC hasn't said anything about this he just says \"well other brokers have to comply with SEC requirements\" Okay but schwab, vanguard and fidelity didn't suspend trading for a specific slew of tickers popular on an internet forum. What requirements are they not complying with (or are you not complying with) that makes the situation different? Why only restrict buying and not selling for retail investors? \"Uhhhhhh regulatory requirements, financial requirements.... how many times do i need to say requirements before I sound convincing? \"\".\n\nTHEN of all fucking things.... this bitch says they feel good about the situation lmao. \"We did this proactively...\" Okay so then why did you not tell any of your customers ahead of time that you would be placing these restrictions on buying specifically? He's making it sound like this was a decision they'd coordinated and planned for (which they clearly did) but yet had no transparency with their customers. Okay so even if we believe this fairytale story of yours you still failed to inform your customers of something that would critically affect their investment decisions had they known a priori. This is shit so deep you can't run away from it man.",
        "created_utc": 1611892021,
        "id": "gl6uotz",
        "score": 319,
        "subreddit": "wallstreetbets",
        "created": 1611920821.0
    },
    {
        "author": "XCypher73",
        "body": "Fidelity allows 50% above.  Sucks.",
        "created_utc": 1611928176,
        "id": "gl8g2z7",
        "score": 314,
        "subreddit": "wallstreetbets",
        "created": 1611956976.0
    },
    {
        "author": "Mabiix",
        "body": "use fidelity, you can open it asap and start trading right away",
        "created_utc": 1611934361,
        "id": "gl8wd7q",
        "score": 306,
        "subreddit": "wallstreetbets",
        "created": 1611963161.0
    },
    {
        "author": "Crunchy_B",
        "body": "Looks like we can **BUY** on **Ameritrade, Schwab, E-Trade, Fidelity and Wells Fargo** too. Let's fucking go! We have one hour left to turn GME positive on the day.",
        "created_utc": 1611863834,
        "id": "gl4ye44",
        "score": 303,
        "subreddit": "wallstreetbets",
        "created": 1611892634.0
    },
    {
        "author": "aupperk24",
        "body": "Open fidelity, it takes literally a day",
        "created_utc": 1611934751,
        "id": "gl8xg9k",
        "score": 300,
        "subreddit": "wallstreetbets",
        "created": 1611963551.0
    },
    {
        "author": "ImmySnommis",
        "body": "Fidelity",
        "created_utc": 1611901835,
        "id": "gl7dp50",
        "score": 293,
        "subreddit": "wallstreetbets",
        "created": 1611930635.0
    }
]