[
    {
        "author": "deadjawa",
        "body": "Facebook, Apple, Microsoft, Google, are about 20% of SPY.  Someone needs to explain to me why book value is an important measure of value for these companies.  The market is always going to be near all time highs in this metric as the US becomes increasingly dominated by services.",
        "created_utc": 1628267391,
        "id": "h7ya9n3",
        "score": 197,
        "subreddit": "investing",
        "created": 1628296191.0
    },
    {
        "author": "ImmySnommis",
        "body": "I don't wanna say \"depends on the stock\" because so many people have, so I'll just say I've held DE, MSFT, GOOG and COST over a decade.",
        "created_utc": 1628216102,
        "id": "h7vxdvd",
        "score": 190,
        "subreddit": "stocks",
        "created": 1628244902.0
    },
    {
        "author": "PaulP97",
        "body": "There’s no way that’s the intrinsic value. And if it is, please do so for apple and Microsoft as well, just as a comparison. Because alibaba x7 would make it the most expensive company in the world…\n\n\nA 31% growth rate yoy for 5 years is HIGHLY ambitious to say the least…",
        "created_utc": 1628802561,
        "id": "h8pc2qe",
        "score": 96,
        "subreddit": "ValueInvesting",
        "created": 1628831361.0
    },
    {
        "author": "WrathofKhaan",
        "body": "The mention of Microsoft as the 2017 customer was very bullish and leads me to believe either: \n\nA) Drew Markham/MVIS General Counsel and M&amp;A Ace reviewed the MSFT/MVIS Contract/NDA and determined they were within their rights to disclose the relationship publicly (which gives MVIS significantly greater negotiating leverage in discussing an acquisition of the Near-Eye Display (NED) AR vertical, which powers the Hololens 2). The announcement puts significantly more pressure on MSFT to acquire the NED vertical, especially considering the national security risks associated with this critical IP being vital to the $22B US Army IVAS contract. The Department of Defense has conducted a thorough review and I’m sure they have identified that Microsoft not owning the rights to the “Miracle *MicroVision* Display Engine” represents a national security threat. It would make sense for the DoD to put pressure on MSFT to acquire this IP to prevent it from falling into enemy hands.\n\nor\n\nB) Microsoft gave MicroVision the green light to announce the relationship because MSFT is about to announce acquiring the NED vertical.\n\nEither way it is BAFF (*Bullish as F#cking F#ck*).\n\nAlso, MVIS is positioning itself to be a global leader in automotive LiDAR with best-in-class tech in terms of resolution, specs, and scalability. The IAA Mobility Summit in Munich is coming up in September and MicroVision is hosting the DVN Automotive LiDAR Conference and Expo in Frankfurt in November. Soon the whole world will see we have best-in-class automotive LiDAR.\n\nPosition: 13,450 shares at $7.46 avg, will be adding more JAN23 $42 LEAPS tomorrow. \n\nThis is the way.",
        "created_utc": 1628135129,
        "id": "h7riry1",
        "score": 87,
        "subreddit": "wallstreetbets",
        "created": 1628163929.0
    },
    {
        "author": "AlE833",
        "body": "Yeah exactly, you could just leave your current holding of Apple and allocate new funds to those ETFs. I’ve done something similar. I have google and Microsoft and the rest is SPY and QQQ",
        "created_utc": 1628841957,
        "id": "h8rdpkm",
        "score": 75,
        "subreddit": "stocks",
        "created": 1628870757.0
    },
    {
        "author": "CynicalEffect",
        "body": "Dont forget the rise of subscription services like EA access/microsoft game pass lowering even digital sales available.\n\nThen long term something like stadia might kill console release cycles (a huge amount of their revenue) and most if not all their game sales will be through their own storefront/subscription.",
        "created_utc": 1628375963,
        "id": "h83tznn",
        "score": 62,
        "subreddit": "investing",
        "created": 1628404763.0
    },
    {
        "author": "Perennial-Millennial",
        "body": "$MSFT",
        "created_utc": 1628433586,
        "id": "h8695u1",
        "score": 62,
        "subreddit": "options",
        "created": 1628462386.0
    },
    {
        "author": "the_bedelgeuse",
        "body": "MSFT is my bread &amp; butter",
        "created_utc": 1628433427,
        "id": "h868udz",
        "score": 60,
        "subreddit": "options",
        "created": 1628462227.0
    },
    {
        "author": "SwedishPenguin42",
        "body": "S&amp;P 500 ETFs are always a safe option, otherwise if you want to invest in singular stocks I would say big tech companies are usually safe like Apple and Microsoft.",
        "created_utc": 1628613059,
        "id": "h8fdsxa",
        "score": 56,
        "subreddit": "stocks",
        "created": 1628641859.0
    },
    {
        "author": "preiser",
        "body": "this is a big fat hidden gem of a stock. closely tied to MSFT, huge growth potential as they're working with msft azure, salesforce, and google currently while trying to branch into AWS. add on to it the fed govts focus on cybersecurity with MSFT, google, and AWS leading the charge, there will be trickle down to AVPT. to boot, AVPT recently launched their channel program to branch out into small and medium business, previously they had focused on 5k+ employee enterprises.\n\navpt is criminally undervalued and will be a great play over the next 12 months as they deploy their merger cash on growth, both organic and inorganic.",
        "created_utc": 1628619097,
        "id": "h8fs97n",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1628647897.0
    },
    {
        "author": "aloahnoah",
        "body": "Another reason why this indicator is outdated: companies like AMZN or MSFT get much of their revenue and profit globally, so why use only the US GDP?",
        "created_utc": 1628541144,
        "id": "h8buonp",
        "score": 38,
        "subreddit": "StockMarket",
        "created": 1628569944.0
    },
    {
        "author": "harrison_wintergreen",
        "body": "VTI top 10 holdings: Apple, Microsoft, Amazon, Facebook, Alphabet Class A &amp; Class C, Tesla, Berkshire, Nvidia, JP Morgan (23% of holdings)\n\nQQQ top 10 holdings: Apple, Microsoft, Amazon, Facebook Class A &amp; C, Tesla, Alphabet (2 share classes), Paypal. 52% of holdings. \n\nyou're buying the same thing twice",
        "created_utc": 1628290579,
        "id": "h7zqz1a",
        "score": 37,
        "subreddit": "stocks",
        "created": 1628319379.0
    },
    {
        "author": "Unable_Dirt_3723",
        "body": "Microsoft",
        "created_utc": 1628887864,
        "id": "h8twk63",
        "score": 36,
        "subreddit": "stocks",
        "created": 1628916664.0
    },
    {
        "author": "ridethewood",
        "body": "Typically, inflation isn't isolated to cost of living. It carries into equity, bond, commodities, etc markets as well.\n\nThink of it this way. Nearly EVERYTHING in the world is an inflation hedge (not motor vehicles that aren't collector-worthy).\n\nAs more $$$ is put into the world, the price of everything rises. You could buy honey today for $1 and in the future it goes for $10.\n\nIf MSFT's guidance were to stay the same today as it does in 10 years percentage-wise, would MSFT trade at $286? Probably not, depending on inflation raising its price.\n\nGold today is around $1,800/oz. Eventually, it'll be worth $5,000 because of inflation.\n\nBtw, I've been a bear since 2018. I knew the market wasn't right. You're *way* too early to the next selloff party. Watch the treasury yields and wait for them to invert. Then wait another 6 months. Then it's about time to panic.",
        "created_utc": 1628132016,
        "id": "h7rcyve",
        "score": 34,
        "subreddit": "stocks",
        "created": 1628160816.0
    },
    {
        "author": "Falagard",
        "body": "So A) either the Microvision leadership has huge balls and are willing to try to pressure Microsoft to buy their AR vertical \n\nOr  \n\nB) A deal has ready been made.\n\nEither way, very promising.",
        "created_utc": 1628139951,
        "id": "h7rqx66",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1628168751.0
    },
    {
        "author": "ILIKERED_1",
        "body": "Similar rule here. I'm long AAPL/MSFT. Half in VOOG. The remaing 10% I trade. I would be doing a little better if I didn't trade, but fuck that; I like the juice.",
        "created_utc": 1628219008,
        "id": "h7w3b9y",
        "score": 26,
        "subreddit": "stocks",
        "created": 1628247808.0
    },
    {
        "author": "MarginCarl",
        "body": "So... does that mean that Microsoft doesn't sell the cure to Viagra?",
        "created_utc": 1628839978,
        "id": "h8rbayi",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1628868778.0
    },
    {
        "author": "goldenmorgue",
        "body": "They're obviously being bought out soon. That's why they're mentioning Microsoft now. Hiring Drew Markham was the point where it became obvious.",
        "created_utc": 1628150012,
        "id": "h7s4cc1",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1628178812.0
    },
    {
        "author": "HoleyProfit",
        "body": "If you knew for sure an event was coming, the play would be short term puts on the low volatility stocks such as AMZN, MSFT, AAPL etc.  And I think there's some stuff to suggest that might work. [https://www.reddit.com/r/BeatTheBear/comments/oxi8yv/lot\\_of\\_large\\_important\\_charts\\_imply\\_some\\_sort\\_of/](https://www.reddit.com/r/BeatTheBear/comments/oxi8yv/lot_of_large_important_charts_imply_some_sort_of/)\n\n&amp;#x200B;\n\nBut without knowing for sure if and when an event would come, the best bet is to sell call spreads and use these to finance the buying of these puts - so you remain theta neutral while heavily long vega.    Which is exactly what I plan to do. https://www.reddit.com/r/BeatTheBear/comments/oymqg2/planning\\_on\\_taking\\_big\\_options\\_positions\\_over/",
        "created_utc": 1628184930,
        "id": "h7tz8gp",
        "score": 20,
        "subreddit": "StockMarket",
        "created": 1628213730.0
    },
    {
        "author": "Edog126",
        "body": "I see Intel in the same position Microsoft was under in the late 2000’s and early 2010’s! They said it was a dead company, now look where it’s at. Not saying Intel will do the same, but they have capabilities to come back hard and big. For now It’s one of the only fair valued compared to NVDA and AMD that are trading at large multiples of earnings. We’ll have to let the market run its course and see.",
        "created_utc": 1628694047,
        "id": "h8jhqug",
        "score": 19,
        "subreddit": "StockMarket",
        "created": 1628722847.0
    },
    {
        "author": "clo3o5",
        "body": "Microsoft, visa, Apple are always good buys",
        "created_utc": 1628180079,
        "id": "h7tnfld",
        "score": 19,
        "subreddit": "StockMarket",
        "created": 1628208879.0
    },
    {
        "author": "RespectPowerMoney",
        "body": "Microsoft was up 3-4x over its IPO price in one year.  What are you talking about?  Maybe you need to spend another 20 years investing if this is the kind of analysis you bring to the table.",
        "created_utc": 1628189453,
        "id": "h7uahhu",
        "score": 18,
        "subreddit": "options",
        "created": 1628218253.0
    },
    {
        "author": "BigAnglinFool",
        "body": "MVST, not MSFT.",
        "created_utc": 1628278626,
        "id": "h7z0o84",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1628307426.0
    },
    {
        "author": "numba1mrdata",
        "body": "&gt;Dont forget the rise of subscription services like EA access/microsoft game pass lowering even digital sales available.\n\nThis is the biggest thing people KEEP ignoring, especially the GME cultists. Game Pass is going to be like Netflix for gaming (but cost 4x as much and people will still pay it) and the big guys like Sony and MSFT and game companies are already going in big on it. Physical game sales will go the way of CD's and VHS tapes.",
        "created_utc": 1628382839,
        "id": "h8472oj",
        "score": 17,
        "subreddit": "investing",
        "created": 1628411639.0
    },
    {
        "author": "Market_Madness",
        "body": "They might all be great companies with room to grow, but I would strongly look into making even a basic attempt at valuing them. I haven't personally covered all of them, but I would consider TSLA, SQ, and NVDA to all be grossly overvalued. Even if they're great companies the most overvalued ones are going to be falling the hardest if bad times hit. Is MSFT going to lose half of its value? Very unlikely. TSLA on the other hand could realistically lose 75% of it's value and it might still not be worth it if they can't keep up their ridiculous growth. I do like that you're looking at companies that you likely actually understand though, that's a great thing to do.",
        "created_utc": 1628397762,
        "id": "h84x4q3",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1628426562.0
    },
    {
        "author": "Historical-Egg3243",
        "body": "microsoft",
        "created_utc": 1628287078,
        "id": "h7zjm6l",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1628315878.0
    },
    {
        "author": "DutareMusic",
        "body": "https://news.microsoft.com/2021/02/10/volkswagen-group-teams-up-with-microsoft-to-accelerate-the-development-of-automated-driving/",
        "created_utc": 1628133130,
        "id": "h7rf2zl",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1628161930.0
    },
    {
        "author": "BackpackGotJets",
        "body": " [What about deals like this?](https://news.gamestop.com/news-releases/news-release-details/gamestop-announces-multi-year-strategic-partnership-microsoft)",
        "created_utc": 1628386112,
        "id": "h84d0ld",
        "score": 16,
        "subreddit": "investing",
        "created": 1628414912.0
    },
    {
        "author": "Extremely-Bad-Idea",
        "body": "China's government is making long overdue structural changes to reduce the power of monopolies and improve the tech environment for ordinary people.  Tencent and Alibaba became immensely powerful and dominated too many aspects of life.  Western countries have the exact same problem with Google, Microsoft, Facebook, and Twittter.  China is fixing the problem now before it gets worse.  In the long run this will be good for China's economy and society.",
        "created_utc": 1628355378,
        "id": "h82nc47",
        "score": 16,
        "subreddit": "stocks",
        "created": 1628384178.0
    },
    {
        "author": "tedchambers1",
        "body": "Their company starts with Micro, same as Microsoft and their stock is in the hundreds so MVST should soon too.\n\nAlso Squeeze",
        "created_utc": 1628824916,
        "id": "h8qoiwp",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1628853716.0
    },
    {
        "author": "RollShotCornerPocket",
        "body": "The biggest lesson i've learned as someone who grew up with an OG investor of a dad? Just keep buying. \n\n&amp;#x200B;\n\nWatched my dad call a broker every month and invest $100 into SPY, MCD, SBUX, CSCO and MSFT without fail. Old man watched Cisco go from $77 to $13, Starbucks go from 18 to 4, Microsoft go from 57 to 28 in multiple major crashes that toilet paper hands would've dumped. What did he do? Bought the dip. If it dipped more? Bought again next month. If you're concerned about a market downturn, build positions over a period of time and don't sell. That's it.",
        "created_utc": 1628268729,
        "id": "h7ydh7s",
        "score": 14,
        "subreddit": "StockMarket",
        "created": 1628297529.0
    },
    {
        "author": "JuanPabloElTres",
        "body": "&amp;#x200B;\n\n&amp;#x200B;\n\n&gt;Facebook, Apple, Microsoft, Google, are about 20% of SPY. Someone needs to explain to me why book value is an important measure of value for these companies. The market is always going to be near all time highs in this metric as the US becomes increasingly dominated by services.\n\n&amp;#x200B;\n\nBook value is a fundamental valuation. It's the net value of the company (i.e., assets - liabilities). So P/Book is essentially a measure of how many dollars you're paying per $ in equity.\n\nJust because a company is in the services industry doesn't mean it doesn't have book value nor does it mean you can't compare historical book value valuations for service companies.\n\nValuation is relative but that doesn't mean P/Book will be ever increasing. If it did that would mean that people would always be paying more and more for each $ in equity and at some point, valuations would definitively be ridiculous. Basically, P/Book can be a valid measure for determining high valuations of companies, service companies included.",
        "created_utc": 1628270180,
        "id": "h7ygwxx",
        "score": 14,
        "subreddit": "investing",
        "created": 1628298980.0
    },
    {
        "author": "Redditor45643335",
        "body": "You wanna know what's scary as fuck? The stock market is making record highs in one of the biggest bull runs in history yet my portfolio is down 15%, some of my positions are down 30%.\n\nI have no idea whats gunna happen when the index corrects, my stocks will likely go -80% and take a decade to get back to break even.\n\nBasically just buy the S&amp;P or just buy Apple, Microsoft, Amazon and Google. These 4 companies essentially run the entire digital world and will exist and grow forever.",
        "created_utc": 1628865057,
        "id": "h8sc9l3",
        "score": 14,
        "subreddit": "stocks",
        "created": 1628893857.0
    },
    {
        "author": "Subterminal303",
        "body": "IT guy for a 500 person org. We've used Crowdstrike for awhile as our EDR. Recently, we began looking at companies for SOCaaS. After chatting with several companies, we landed with...Crowdstrike. \n\nWe currently use a different company as our SIEM. However, our CS rep told us that they acquired a SIEM company and will be offering that as a service sometime in the near future. We'll probably go with them when they do.\n\nPoint is, CS is becoming a one-stop-shop by branching out and covering most SECaaS stuff. And they're already one of the best in the industry. \n\nIf there's a solid cybersec stock to hold, it's them. That said, I would also suggest Microsoft stock as they are also leading the field with Windows Defender stuff...amongst so many of fields...",
        "created_utc": 1628355118,
        "id": "h82mryf",
        "score": 14,
        "subreddit": "stocks",
        "created": 1628383918.0
    },
    {
        "author": "Afroman0003",
        "body": "Consider looking into Invesco QQQ - the holdings of that ETF would have a fair bit of overlap with your list and be easier administratively.   For instance, AAPL is 11%, MSFT is 9.81%, AMZN is 8.34%, GOOG is 3.9%, etc.",
        "created_utc": 1628555259,
        "id": "h8cpe6m",
        "score": 14,
        "subreddit": "StockMarket",
        "created": 1628584059.0
    },
    {
        "author": "ShutUpTodd",
        "body": "Yay, MVIS is getting some love now that it's confirmed they're part of the $8B military contract with MSFT for the Hololens2",
        "created_utc": 1628267592,
        "id": "h7yaqos",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1628296392.0
    },
    {
        "author": "w8w8dont",
        "body": "Tik Tok ipo soon. May eclipse MSFT market cap on meme status alone",
        "created_utc": 1628709848,
        "id": "h8kjk2t",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1628738648.0
    },
    {
        "author": "lv4myw",
        "body": "A little over $100K in this account.  Apple, Microsoft, Walmart, American Express, and Disney are the big names.  I used to have Proctor and Gamble and absolutely love them, but had to pull some money out last week, so they got sacrificed.\n\nWith AAPL and MSFT, I short 2 puts per week (and one covered call).  This week, for example, I shorted:\n\n* 2 MSFT $285 puts @ $1.35\n* 1 MSFT $290 call @ $1.51\n* 2 AAPL $147 August 20 puts @ $2.32\n* 1 AAPL $147 August 20 call @ $2.52\n* For DIS and AXP, because they've been a little more volatile, my options are a bit further away from the stock price and I'm rolling them forward getting about $100 per week in cash on each.\n* 1 WMT $145 call @ $1.20\n* 1 WMT $145 put @ $1.44\n\nIf you add up these numbers (counting only half of Apple), you get a little under $1000.  That's slightly deceiving because remember I have to close the old position in order to roll it forward.  So say Apple is trading at $149 come August 20.  I'm going to have to pay $200 to close it (and the $147 puts will expire as worthless).  So if I get, say, $450 for setting my August 27 options, I really only made $250 on that deal.\n\nBut I have a few other smaller stocks and I do a few vertical spreads.  It all comes out to about $1000/week.",
        "created_utc": 1628601219,
        "id": "h8en52k",
        "score": 13,
        "subreddit": "options",
        "created": 1628630019.0
    },
    {
        "author": "sliverbak",
        "body": "Agreed (totally malware). Plus MS basically torpedoed their whole Windows platform offering with Microsoft Defender (google comparisons - it's \"good enough\" for 99% use-cases). McAfee is selling to newbs who know no better and/or OEMs. imo it's walking dead...but I'm a retard so what do I know?",
        "created_utc": 1628699802,
        "id": "h8jveqf",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1628728602.0
    },
    {
        "author": "diaznutzinyomouf",
        "body": "I would like someone to post some DD as far as AvePoint vs Varonis since it seems Varonis is very similar and does much of the same thing with MSFT while trading at 15x to 20x revenue all while losing money.  I don't expect a whole lot of price movement THIS earnings report, I anticipate a much larger move near Q3 ER if Q2 provides confirmation (43m to 44m in rev) that they are on target to hit their revenue projection this year (already raised once). At some point as long as AvePoint executes as planned,  the market will respond. \n\nI don't really see a way that the largest SaaS cloud partner for the world's largest software/cloud company growing at 25% to 30% CAGR continues to trade at 9X when similar companies are at least trading at 30% higher. AvePoint also has a great team,  Jeff Teper, VP at Microsoft on board,  Jason Beal from Palo Alto Networks, Epstein as former CFO of Oracle, Koenig as former head of global technology investment at Goldman Sachs who's first IPO was ironically MSFT. \n\nThey have been executing a parallel M&amp;A plan alongside the SPAC process according to CEO, I expect acquisitions soon and AvePoint to execute as planned. The downside here is limited its already at the low range of valuation with a $23 bull target (VRNS revenue multiple). I feel very confident holding this, there's a ton of far worse holds making zero revenue or going backwards. \n\nAvePoint has zero debt (as of now,  who knows if their M&amp;A strategy changes that)  and is in my opinion a strong play whether the economy remains open or shuts down again. Another shutdown will actually benefit AvePoint,  and as we all know,  most companies are either permanently adopting WFH models to save on real estate costs or moving to a mostly WFH model. With so many working from home with access to sensitive data there going to be far more foreign actors attempting to compromise those systems and gain access which will result in more reliance on companies like AvePoint (Varonis too).",
        "created_utc": 1628461401,
        "id": "h87wm1u",
        "score": 12,
        "subreddit": "SPACs",
        "created": 1628490201.0
    },
    {
        "author": "doggy_lovers",
        "body": "Most stocks fell lower if you are in more smaller, speculative stocks. Only bigcaps like microsoft which is in all 3 indexes help pump up the market (msft is liker 5-10% weight in those indexes)",
        "created_utc": 1628888684,
        "id": "h8typ5j",
        "score": 12,
        "subreddit": "stocks",
        "created": 1628917484.0
    },
    {
        "author": "gopurdue02",
        "body": "Here we go again: Everyone piles into MSFT/AAPL/FB while everything else goes to shit and the averages stay flat",
        "created_utc": 1628778520,
        "id": "h8npny4",
        "score": 12,
        "subreddit": "SPACs",
        "created": 1628807320.0
    },
    {
        "author": "Mattie725",
        "body": "So they have to develop a good working game library which can compete with Steam and giants like Sony and Microsoft with the reselling of games as the game changer? (no pun intended) Meanwhile, the others with literally billions to spend, can quickly implement a reselling feature et voila.\n\nI've always had the same question, starting from the e-commerce argument. Turning games in to e-commerce seems pretty non-revolutionary to me.",
        "created_utc": 1628538328,
        "id": "h8bo2ve",
        "score": 12,
        "subreddit": "stocks",
        "created": 1628567128.0
    },
    {
        "author": "Nickmi",
        "body": "sq and paypal seem very high risk high reward compared to msft and aaple",
        "created_utc": 1628486927,
        "id": "h896qm4",
        "score": 12,
        "subreddit": "investing",
        "created": 1628515727.0
    },
    {
        "author": "-C20H24O3",
        "body": "MSFT lost the JEDI contract bc Amazon wouldn't stop protesting it, now MSFT is protesting the NSA contract that was awarded to Amazon \n\n&amp;#x200B;\n\nLMAOOOOOOOOOOOOO",
        "created_utc": 1628794430,
        "id": "h8os482",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1628823230.0
    },
    {
        "author": "coolcomfort123",
        "body": "msft broke ath, $300 soon.",
        "created_utc": 1628866981,
        "id": "h8sg1mh",
        "score": 12,
        "subreddit": "stocks",
        "created": 1628895781.0
    },
    {
        "author": "juaggo_",
        "body": "I like Apple, Microsoft and Disney. Good fundamentals and popular products/services that will sell a ton in the future.",
        "created_utc": 1628886403,
        "id": "h8tsnw3",
        "score": 11,
        "subreddit": "stocks",
        "created": 1628915203.0
    },
    {
        "author": "drytendies",
        "body": "PLTR 2024 any strike at 60 or below\n\n(Yes I know 2024 isn’t out yet, should be by September)\n\nAAPL 200\n\nMSFT 300\n\nFB 500\n\nU 150\n\nSQ 500",
        "created_utc": 1628451834,
        "id": "h87c4go",
        "score": 11,
        "subreddit": "options",
        "created": 1628480634.0
    },
    {
        "author": "AdonisBasketball",
        "body": "Damn dude you must be having a great time if you're holding MSFT/COST/GOOG/DE for the past 10 years haha. What's your approach to actually selling them? They're great companies so I maybe your approach is never selling them but if that's not the case what would it take for you to sell?",
        "created_utc": 1628253123,
        "id": "h7xer70",
        "score": 11,
        "subreddit": "stocks",
        "created": 1628281923.0
    },
    {
        "author": "The_Number_12",
        "body": "it's not sexy but the best investments are usually things you yourself or others:\n\n1) buy often\n\n2) will likely buy in the future / need in the future (cell/internet, groceries, toiletries, etc.)\n\n3) prefer to buy (x product) over its competitors and plan to do so\n\nthis is why $TGT, $PG, $MSFT and $TMUS all have the same looking trend the last 5, even 10 years. straight up. They know what they're doing.",
        "created_utc": 1628883094,
        "id": "h8tk4qx",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628911894.0
    },
    {
        "author": "Ragefan66",
        "body": "I had some dumb fuck on r/stocks literally tell me that PLTR will go to $1 trillion in five years. Rough math puts PLTR at $550 at that valuation LMAO.\n\n&amp;#x200B;\n\nI told him how does he expect 550% YOY growth when the fucking CEO expects 35-45%.....how did he respond? He said only boomers think about YOY growth. \n\n&amp;#x200B;\n\nThe dumb fuck thought PLTR handed out their software like MSFT does Microsoft Word and that people would just flock to the software en mass...\n\n&amp;#x200B;\n\nI'm just surprised I found someone that fucking retarded outside of WSB",
        "created_utc": 1628490181,
        "id": "h89aviv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628518981.0
    },
    {
        "author": "Ving0",
        "body": "MSFT 300 inc",
        "created_utc": 1628205046,
        "id": "h7vavcv",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628233846.0
    },
    {
        "author": "HoleyProfit",
        "body": "I have a variety of call credit spreads and deep OTM puts. [https://www.reddit.com/r/BeatTheBear/comments/oz78t8/bear\\_market\\_options\\_portfolio\\_entering\\_positions/](https://www.reddit.com/r/BeatTheBear/comments/oz78t8/bear_market_options_portfolio_entering_positions/)\n\n&amp;#x200B;\n\nWhen I've looked into market tops I've found timing is fucking hard.  Even when these levels are forecasting the right price for you to watch even \"Knowing\" the market was making a high could have got your puts nailed because it hangs about doing nothing for a long time sometimes.\n\nIn a linked post in the one above with my positions I did a detailed breakdown of what I think the optimum strategy is. Selling call spreads ATM and buying OTM. I did this one SPY, RUT and various big blue chips (AAPL, MSFT etc).  If the market slows down and ranges I'll do okay on my short calls and lose the cheaper puts - but if there's some sort of \"Shock\" in the market and everything moves, these can see big IV jumps.",
        "created_utc": 1628401061,
        "id": "h851w2w",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1628429861.0
    },
    {
        "author": "Lxrs98",
        "body": "\"due to their upcoming security changes\"\n\nWhat theyre doing (about the children pornography) is the same what google, microsoft and co are doing since years. It wont change much",
        "created_utc": 1628498738,
        "id": "h89kobj",
        "score": 10,
        "subreddit": "investing",
        "created": 1628527538.0
    },
    {
        "author": "I_Drink_Piss",
        "body": "What was director comp for AAPL, MSFT, and AMZN post IPO in inflation adjusted dollars?  \n\n\nThere’s a big difference between equity compensation as a mature company with liquid public stock or options for stock that is highly liquid and the equity compensation from wealth creation when illiquid privately held shares appreciate from a par-value of $0.00001.\n\n\nFood for thought.",
        "created_utc": 1628303100,
        "id": "h80egvk",
        "score": 10,
        "subreddit": "SPACs",
        "created": 1628331900.0
    },
    {
        "author": "olden_ticket",
        "body": "In less than 12 hours the $2.8 is going to be $12 when MSFT announces they bought Sweet baby Mavis.",
        "created_utc": 1628129541,
        "id": "h7r838b",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1628158341.0
    },
    {
        "author": "Jorlarejazz",
        "body": "Imagine finding a stock as bulletproof as MSFT and being disappointed that it will *only* return 13% a year.",
        "created_utc": 1628104487,
        "id": "h7pojqe",
        "score": 10,
        "subreddit": "investing",
        "created": 1628133287.0
    },
    {
        "author": "frankieholmes447",
        "body": "Amazon apple and Microsoft all red though",
        "created_utc": 1628523266,
        "id": "h8aoi69",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1628552066.0
    },
    {
        "author": "Summebride",
        "body": "Had this question been asked 20 years ago, OP could have said Blackberry, Enron and Lehman Brothers instead of AAPL, MSFT, NVDA.\n\nPledging blind long term loyalty to a stock is not prudent investing.",
        "created_utc": 1628630066,
        "id": "h8ghzrw",
        "score": 9,
        "subreddit": "stocks",
        "created": 1628658866.0
    },
    {
        "author": "WFCtothemoon",
        "body": "at that point might as well just buy QQQm\n\n50% of it is literally appl googl msft amzn nvidia facebook",
        "created_utc": 1628773603,
        "id": "h8nf1li",
        "score": 9,
        "subreddit": "stocks",
        "created": 1628802403.0
    },
    {
        "author": "KaizenW0LF",
        "body": "As in one million?! Jeez! I went with Microsoft. Safer and it's slowly going to the moon!",
        "created_utc": 1628800826,
        "id": "h8p7p9o",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1628829626.0
    },
    {
        "author": "TODO_getLife",
        "body": "The first step is to buy good stocks. Only heard of Palantir on that list and it's basically a meme stock around here.\n\nDo this with AAPL, MSFT, GOOGL at the start of the year and you would be up 20-40% on each (rough numbers can't be bothered to check all)",
        "created_utc": 1628765350,
        "id": "h8n1i9n",
        "score": 9,
        "subreddit": "stocks",
        "created": 1628794150.0
    },
    {
        "author": "TI_AJ17",
        "body": "Their debt isn’t alarmingly high and they have plenty of cash to cover their debt if they wanted to. They don’t have quite as much as cash as companies like Apple, google and Microsoft but they still have plenty. Of course it’s safer to invest in companies with less debt, but debt is certainly not a worry for me when investing in the likes of Amazon and Apple.",
        "created_utc": 1628617524,
        "id": "h8fohef",
        "score": 9,
        "subreddit": "stocks",
        "created": 1628646324.0
    },
    {
        "author": "Lumberjacklord",
        "body": "Hi I been investing a bit over a year. A simple buy and hold strategy. no grand plan. And no I will not sell and buy an index fund you people are annoying.\r  \n\r  \n2 shares of Microsoft (MSFT) $575 EQ\r  \n\r  \n22 shares of General Mills (Gis) $1,300 EQ\r  \n\r  \n19 shares of citi bank (C) $1,400 EQ\r  \n\r  \n37 shares of stag, $1500 EQ\r  \n\r  \n32 shares of Coca cola (KO) $1,820 EQ\r  \n\r  \n52 shares of Bank of America (BAC) $2,170 EQ\r  \n\r  \n15 shares of Apple (AAPL) $2,188 EQ\r  \n\r  \n55 shares of Realty Income (O) $3,900 EQ\r  \n\r  \nEstimated dividend is $400 per year.",
        "created_utc": 1628706973,
        "id": "h8kciua",
        "score": 9,
        "subreddit": "stocks",
        "created": 1628735773.0
    },
    {
        "author": "John_Bot",
        "body": "Microvast and Microsoft are the same thing except for 2 letters.\n\nI'm not saying $500 billion market cap but",
        "created_utc": 1628539341,
        "id": "h8bqg6u",
        "score": 9,
        "subreddit": "SPACs",
        "created": 1628568141.0
    },
    {
        "author": "edwardgentile",
        "body": "MSFT will break 300 before AAPL breaks 150 and I've never been more sure of anything in the last fifteen minutes",
        "created_utc": 1628884171,
        "id": "h8tmw0d",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1628912971.0
    },
    {
        "author": "SirGlass",
        "body": "For as much as the book gets recommended I highly doubt most people have ever read it. I always find it funny when someone suggests what books to read on investing tons of people recommend it ; I highly doubt any one of them actually read it. It just seems like the right answer\n\nHowever valuing companies by their book value is long outdated. Intangible assets are a much bigger deal. For example take the book value of Google or Facebook, or even Microsoft. They actually don't own a whole lot of physical assets, a few offices and a bunch of servers , probably some good will from acquisitions what graham doesn't even count\n\nIf you used those methods to value the companies back in 2010 you would assume they are all massively overvalued ; however we know from the massive amounts of money they made and where they are today there were not overvalued back in 2010.\n\nThere are a few pages that are good that sort of go over the mind set of investing but honestly out of a 550 pages maybe the 25 about general mindset are good.",
        "created_utc": 1628695920,
        "id": "h8jm6dm",
        "score": 9,
        "subreddit": "investing",
        "created": 1628724720.0
    },
    {
        "author": "forzawakeup",
        "body": "That is literally crazy to hear. I believe that palantir software can will be widely adopted on the same level as Microsoft office is. Not only would many organizations see it as a no brainer but people will have an individualized version of the software that can optimize their life. Think of it analyzing their biometrics, nutrition, sleep patterns, water intake, traffic patterns to predict the fastest route, weather to recommend runs, etc. All of research and analysis will be done by pltr software to completely optimize individual lives.",
        "created_utc": 1628824522,
        "id": "h8qnrim",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1628853322.0
    },
    {
        "author": "Jaloosk",
        "body": "Their competition is not Microsoft; they aren’t making games or systems to compete with them. Not sure why you would compare a software developer with a retailer. There’s no indication they want to get into the gaming development business (except for that little NFT game they put out lol)",
        "created_utc": 1628537166,
        "id": "h8blchz",
        "score": 8,
        "subreddit": "stocks",
        "created": 1628565966.0
    },
    {
        "author": "numba1mrdata",
        "body": "ITT: \"Guys, GME has no debt and MSFT has debt, so basically GME should have a $2 Trillion market cap, minimum. Come on sheeple!\"",
        "created_utc": 1628382590,
        "id": "h846ma5",
        "score": 8,
        "subreddit": "investing",
        "created": 1628411390.0
    },
    {
        "author": "xXRoboMurphyxX",
        "body": "Would you just buy MSFT already?!",
        "created_utc": 1628215042,
        "id": "h7vv9bw",
        "score": 8,
        "subreddit": "stocks",
        "created": 1628243842.0
    },
    {
        "author": "TotesHittingOnY0u",
        "body": "The revenue for MSFT and Sony in the gaming space speaks for itself. The #'s are the evidence. GameStop doesn't even remotely compete.",
        "created_utc": 1628389406,
        "id": "h84j2gw",
        "score": 8,
        "subreddit": "investing",
        "created": 1628418206.0
    },
    {
        "author": "way2lazy4u",
        "body": "yes and buy MSFT and AAPL",
        "created_utc": 1628569575,
        "id": "h8dh4su",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1628598375.0
    },
    {
        "author": "DebonairJayce",
        "body": "Microvast sounds like Microsoft and that’s enough for me chile",
        "created_utc": 1628283031,
        "id": "h7zanjy",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1628311831.0
    },
    {
        "author": "async2",
        "body": "Sure, like they migrated away from Amazon, Microsoft, Facebook, Instagram and Google. The only people that migrate away are a minority of tech savvy people (if they haven't already). Everybody else will continue to buy.",
        "created_utc": 1628493260,
        "id": "h89ek0f",
        "score": 8,
        "subreddit": "investing",
        "created": 1628522060.0
    },
    {
        "author": "CountTheForDown",
        "body": "All I gotta say SPY is very expensive to bet against.\n\nConsidering MSFT/AAPL refuse to go down rightly so is all the evidence needed. Both technically went down after earnings and both are just floating within a couple bucks of the day after earnings.\n\nThis market turned into an option killing machine. Stocks used to have wild swings just 3 months ago, even large/mega cap.",
        "created_utc": 1628749069,
        "id": "h8mhy3t",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1628777869.0
    },
    {
        "author": "Weekendshmeekend",
        "body": "MICROSOFT USES.....M V I S",
        "created_utc": 1628184090,
        "id": "h7tx6gi",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628212890.0
    },
    {
        "author": "wraithmain1",
        "body": "Been watching Microsoft try 289 for half my life now",
        "created_utc": 1628192154,
        "id": "h7uh3xv",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628220954.0
    },
    {
        "author": "awe2D2",
        "body": "This is why on most of my longs I just hold and ride out the bumps. I don't have time to watch the market everyday and for most of my holdings I have an idea of where I would sell in the future. If it's a large position I may cash out some and take some profits but it's always a good idea to have some sort of idea when you want to sell. Some companies like Apple and Microsoft are just money making machines, so long term holding of those without sell targets may make sense. Sell when you need the money in retirement.",
        "created_utc": 1628222847,
        "id": "h7wamhj",
        "score": 7,
        "subreddit": "stocks",
        "created": 1628251647.0
    },
    {
        "author": "Sandvicheater",
        "body": "NFLX has been the red headed step child of the FANNG group that there's been calls to replace NFLX with MSFT to give you an idea.",
        "created_utc": 1628796627,
        "id": "h8ox0pf",
        "score": 7,
        "subreddit": "stocks",
        "created": 1628825427.0
    },
    {
        "author": "StrikePrice",
        "body": "Good company. Bright future. Good stock. Buying PLTR in 2020 was like buying MSFT in 1995.",
        "created_utc": 1628787664,
        "id": "h8obv9m",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628816464.0
    },
    {
        "author": "2marston",
        "body": "AMZN\n\nGOOG\n\nMSFT\n\nCRSR\n\nNVDA\n\nAMD would be on my list but just ran up massively so not a good time to buy.\n\nI think there's never a bad time to buy AMZN, GOOG or MSFT, and AMZN particularly is at a good buy in. CRSR is just cheap right now and should have 100% growth over 2 years.",
        "created_utc": 1628771295,
        "id": "h8naqfp",
        "score": 7,
        "subreddit": "stocks",
        "created": 1628800095.0
    },
    {
        "author": "high_roller_dude",
        "body": "msft.",
        "created_utc": 1628544000,
        "id": "h8c1bzx",
        "score": 7,
        "subreddit": "stocks",
        "created": 1628572800.0
    },
    {
        "author": "4thekung",
        "body": "So is MVST not the same as Microsoft?",
        "created_utc": 1628696959,
        "id": "h8jonlb",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628725759.0
    },
    {
        "author": "ThatsHonestlyWildBro",
        "body": "MVST partnership with Tesla, Nike, Microsoft and AMD on Monday? MVST to $99? Cool I'm in",
        "created_utc": 1628379018,
        "id": "h83zyd8",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628407818.0
    },
    {
        "author": "abk111",
        "body": "You say “companies” aren’t going to become profitable enough and that there’s a bubble in “tech” stocks but then use Tesla, a borderline meme stock that’s not really tech, as an example.\n\nIf you’re worried about companies not making enough money, you’ll be happy to find out that there are companies like Apple, Google, Facebook and Microsoft that together make up large chunks of many indices and are not just immensely profitable but still growing incredibly rapidly and showing no real sign of slowing down long term.",
        "created_utc": 1628313216,
        "id": "h80vruv",
        "score": 7,
        "subreddit": "investing",
        "created": 1628342016.0
    },
    {
        "author": "BetweenCoffeeNSleep",
        "body": "My mother did this when she got into investing. Bought, held…\n\nVisa 10 days after IPO, AAPL at $22, Target, Starbucks, Microsoft, etc more than 20 years ago. \n\nThose picks aged well.",
        "created_utc": 1628338614,
        "id": "h81qzrq",
        "score": 7,
        "subreddit": "investing",
        "created": 1628367414.0
    },
    {
        "author": "Rumtumjack",
        "body": "Confused as to where your info is coming from as IBM has made a profit every quarter for like 15 years straight. \n\nThere is also some speculation of a potential turn around with transitioning to AI and Cloud with the newish CEO and that acquisition a while back (what was it, Red Hat or something like that?). It's in a pretty similar boat as Intel. Both of them are quite legacy but up until a decade ago people would have said similar about MSFT. \n\nI'm not invested in it outside of indexes, but I'd still feel more comfortable with it over a moonshot like PLTR or whatever meme stock people are pumping lately.",
        "created_utc": 1628102401,
        "id": "h7pjjql",
        "score": 7,
        "subreddit": "stocks",
        "created": 1628131201.0
    },
    {
        "author": "shortyafter",
        "body": "Like I said, it seems like Microsoft, etc. are somehow pushing the market higher.  But I've noticed stagnation across the board for the last few months.  IMO the markets are confused about which direction to go right now.  A lot of uncertainty with Fed policy, and I think there's real fear that things can't reasonably go much higher.  We're still wary after 2008 IMO. \n\nI understand it's frustrating.  I told myself I was going to wait until buying but finally bit the bullet pretty big this week.  Today doesn't look pretty, which pisses me off, but I know I have good companies so I'm trusting in that.",
        "created_utc": 1628094245,
        "id": "h7ozo74",
        "score": 7,
        "subreddit": "stocks",
        "created": 1628123045.0
    },
    {
        "author": "goldenmorgue",
        "body": "I'm extremely bullish on MVIS after they officially confirmed their tech powers Microsoft Hololens in their earnings call. Yes, we already knew that, but making it official is a whole new level of investment certainty (like for example with marriage).",
        "created_utc": 1628150658,
        "id": "h7s540f",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628179458.0
    },
    {
        "author": "Weekendshmeekend",
        "body": "I just wanna let y'all know, Micro**VISION** is the real deal. Huge legitimate potential, reflected in a confirmed agreement with Microsoft.",
        "created_utc": 1628178353,
        "id": "h7tj94x",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628207153.0
    },
    {
        "author": "Les-Whinin",
        "body": "Either we are involved in the IVAS deal or Microsoft straight buys us out. And that all happens soon",
        "created_utc": 1628163168,
        "id": "h7skm9c",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628191968.0
    },
    {
        "author": "ZombieFrenchKisser",
        "body": "They'd be smarter to get into the VPN business honestly.  Antivirus is dying ever since Microsoft started including Windows Defender.",
        "created_utc": 1628694935,
        "id": "h8jjtr9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628723735.0
    },
    {
        "author": "shortyafter",
        "body": "My understanding is that the best has been over since March or so.  Since then all sorts of stocks have been down or stagnant, with big names like Microsoft / Apple carrying the indexes. Someone correct me if I'm wrong, but this my understanding. \n\nI'm in a similar position to you.  My idea is to just stop averaging down and watch for a real pull back, or if anything continue DCAing patiently into my positions rather than stubbornly buying all the little dips.\n\nAlso make sure you actually have good stocks and not speculative junk.  I have good stocks and they're still down.  Things will always get back to fundamentals, though.  It's a weird market right now.",
        "created_utc": 1628093656,
        "id": "h7oy7gg",
        "score": 7,
        "subreddit": "stocks",
        "created": 1628122456.0
    },
    {
        "author": "uninfinity",
        "body": "Bullish\n\n***US President Biden offers temporary safe haven in the US to Hong Kong residents***\n\n***US government taps the help of tech companies, including Amazon (AMZN), Microsoft (MSFT) and Google (GOOG), to bolster infrastructure defenses against cyber threats; initiative called Joint Cyber Defense Collaborative***",
        "created_utc": 1628169321,
        "id": "h7svfnx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628198121.0
    },
    {
        "author": "Weekendshmeekend",
        "body": "Lol except they confirmed they're working with microsoft LOL",
        "created_utc": 1628172271,
        "id": "h7t1osc",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628201071.0
    },
    {
        "author": "umar_farooq_",
        "body": "Also in tech (not sure why that matters but thought I'd follow along).\n\nThe trend I see is that the big boys are making their own CPU platforms. M1, Google Tensor, Microsoft Pluton, etc. Those have shown amazing results in just the first iteration. Facebook and Amazon also rumoured but haven't put out anything concrete yet, can't imagine they'll stay quiet long.\n\nI believe these companies still work with Intel/AMD/NVIDIA but that's not forever. They'll probably create their own in-house departments for hardware at some point.\n\nThe real play is TSM. When there's a gold rush, don't invest in gold. Invest in selling shovels.",
        "created_utc": 1628443999,
        "id": "h86vabh",
        "score": 7,
        "subreddit": "stocks",
        "created": 1628472799.0
    },
    {
        "author": "jerseynate",
        "body": "So vice president Harris is meeting with representatives of Microsoft, etsy, gap, and airbnb tomorrow to talk about biden's \"agenda\" what agenda may that be? Why is she meeting with publicly traded companies",
        "created_utc": 1628812728,
        "id": "h8pyt45",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1628841528.0
    },
    {
        "author": "innnx",
        "body": "I would consider \n- FB, GOOG undervalued \n- MSFT fairly valued\n- AAPL overvalued\n\nI'm not on my PC now so I don't have the calculations in front of me but this is the result i got from my intrinsic value calculator. I used pretty conservative growth rates",
        "created_utc": 1628030320,
        "id": "h7ly0aw",
        "score": 6,
        "subreddit": "ValueInvesting",
        "created": 1628059120.0
    },
    {
        "author": "sc0tt_1990",
        "body": "The year is 2030, MVIS is \"working with MSFT\" on HoloLens 15.  The stock trades at 12 a share.",
        "created_utc": 1628174926,
        "id": "h7tb4jj",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1628203726.0
    }
]