[
    {
        "author": "Recoil42",
        "body": "&gt;If anything I think TSMC is undervalued, given they're the only company making &lt; 7nm chips right now\n\nYes, with the caveat that Samsung makes 5nm chips as well. However, Samsung's 5nm process is nowhere near the true density of TSMCs process.\n\nMore importantly, TSMC is about to jump to 4nm, and seems to be fully on-track with 3nm for next year. More than anything else, they appear to have an unstoppable *cadence* at the leading edge, which is not the case with any other fab. \n\nFor that reason, I actually agree that it's very possible they're undervalued.",
        "created_utc": 1629757910,
        "id": "ha38y34",
        "score": 13,
        "subreddit": "investing",
        "created": 1629786710.0
    },
    {
        "author": "Speeeeedislife",
        "body": "In no particular order:\n\nNVDA\nTSM\nAMAT\nASML\nAAPL\nNXPI\nQCOM\nLWLG\nAMD\nMSFT\nSTM\nADSK\nPLTR\nBIO\nTMO\nGOOGL\nEDIT\nCRSP\nLRCX\nUCTT\nMU\nBEAM\nNTLA\nNVTS (IPO soon ish)\nSKYT\nSNPS\nCDNS\nMRVL\nDE",
        "created_utc": 1630160486,
        "id": "haoo64l",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1630189286.0
    },
    {
        "author": "DontStonkBelieving",
        "body": "Its weird, from what I've seen they have a good product and are widely used but that is just my surface view of it. Glad I got out at the peak as I thought it was pointless having that and NET as they were both CDNs.",
        "created_utc": 1628089843,
        "id": "h7oozwu",
        "score": 4,
        "subreddit": "stocks",
        "created": 1628118643.0
    },
    {
        "author": "gruntinvalhalla",
        "body": "I thought about getting into NET when I bought a fairly sizeable position in FTNT back in April and kind of regret not jumping into it. CDNs have been taking over for some time now and pretty much how most Netflix streams on CDN for less buffering/data util. since it's all cached in. \n\nThe only reason I didn't jump into NET at the time was due to cyber concerns and why I just doubled down on FTNT instead. Because they're such a large internet-facing org., those pesky DDoS attacks do take their networks down sometimes and it affects quite a large swath of the global population. I felt they needed a bit more improvement at the price. Obviously, I was wrong since they doubled since. Lol.",
        "created_utc": 1628700753,
        "id": "h8jxoje",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1628729553.0
    },
    {
        "author": "Moist_Lunch_5075",
        "body": "This trend started about 15 years ago. It's definitely getting more common, and has been ramping up for the past 10 years, and cloud computing creates new opportunities to leverage CDNs since the backend doesn't have to be in a company datacenter anymore but rather can be exposed via a scalable cloud backend service (still in a DC, just Amazon or Google's or whoever)... but from the perspective of a stock play, I mean... sure... but the market's already pricing all of this in.",
        "created_utc": 1628732938,
        "id": "h8lzuld",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628761738.0
    },
    {
        "author": "opackersgo",
        "body": "&gt; Curious what you mean by that? Starlink technically has the capacity to offer lower latency than fiber\n\nI'll believe it when I see it.  Everything Musk says needs to be taken with a massive grain of salt.  Most things are cached at local CDNs or regional servers so transcontinental traffic isn't a huge deal IMO for your average home users.  Your latency is also going to get worse the more congested the connection is.",
        "created_utc": 1629327665,
        "id": "h9gr9o6",
        "score": 2,
        "subreddit": "investing",
        "created": 1629356465.0
    },
    {
        "author": "twill41385",
        "body": "Looking at LVS and CDNS. \n\nSands looks like it could be entering a reversal. \n\nCDNS financials all out perform the industry and would be looking for an entry closer to the 50 simple for shares and Nov-Dec ATM options. \n\nAnybody have any experience with either?",
        "created_utc": 1629803136,
        "id": "ha5bq85",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629831936.0
    },
    {
        "author": "besalope",
        "body": "If they stick to their 2 year cadence, we should see the new wave of Micron Enterprise SSDs launch in early November as well, likely with the 176 later Nand that they announced last fall.",
        "created_utc": 1628898442,
        "id": "h8ukw3f",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1628927242.0
    },
    {
        "author": "mesmerizing2",
        "body": "Cresco is 50% wholesale and have a more aggressive growth strategy then Trul until recently. You really can't compare Cresco directly to Trulieve before they merge with Harvest, and even then Trulieve started out owning three large FL greenhouses, and lions share of profits are in FL.   There is much skepticism on this sub regarding the value of funding early growth at at the expense of fundamentals, due to some large failures in the canadian legalization.   Aurora comes to mind.  IMO Cresco  seems to have a good growth cadence, are not massively diluting, but are focused on getting a national footprint.  Long term(3-5 years) these absolute State license related moats are coming down, and national branding will become the defensible moat against commoditization. I've been adding to Trulieve position since they acquired Harv, but will still have twice as much Cresco until I see two quarters of joint Tru/Harv quarterlies to decide if Trulieve can compete as well in states with stronger competition.",
        "created_utc": 1628953263,
        "id": "h8x0yyq",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1628982063.0
    },
    {
        "author": "Unique_Director",
        "body": "The Rocket 1.0 and Rocket 2.0 launches were suborbital test flights, they were never intended to make orbit and didn't even have second stages. Astra claims they were successful for what they were trying to do. Rocket 3.0 was destroyed in a fire due to a fueling problem, not exactly a good sign but it didn't ever launch and there was no payload on it when it was destroyed. Kemp said that he believed it would take 3 attempts to get to orbit and the 3rd attempt is in a few days.\n\nNeed I remind you that SpaceX failed several times with Falcon 1? Falcon 1 only ever deployed 1 satellite. The first 3 launches were indisputable failures, the Rocket 3.2 launch was more successful than Falcon 1's first 3 launches and was only their 2nd orbital launch. The 3rd Falcon 1 failed because of a single line of bad code and after they fixed it the next launch was a success.\n\nYou could just chill out and wait a few days. It wouldn't kill you. They might succeed.\n\nAs for their business model, I am as skeptical as anyone about their goal to launch every single day but it is not as though the company will go bankrupt if they fail to achieve that target. There is still plenty of room for success. SpaceX spent the first half of the year launching about 3 times per month with a much larger and more expensive rocket, I see no reason Astra could not achieve a weekly launch cadence eventually, especially as more and more companies are getting into space.",
        "created_utc": 1629931022,
        "id": "hacoml4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629959822.0
    },
    {
        "author": "lilshwarma",
        "body": "agreed - see my half assed DD, which is arguing the same. There are space launch companies that have never launched a single customer payload to orbit, that are valued at near 1/2 that of RKLB (ASTR). It just seems that RKLB should be given a lot more credit in terms of valuation, as they have/are far more accomplished in terms of launch cadence/history.\n\nIn a couple of years, I’d expect RKLB to be valued at somewhere near 1/4 that of SpaceX, which would be like a 4-5x from here.",
        "created_utc": 1629921413,
        "id": "hac1e8h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629950213.0
    },
    {
        "author": "Trex_in_F16",
        "body": "As someone who works closely in that sector, Its a highly capital intensive business and akamai owns most of the internet cdns",
        "created_utc": 1628205734,
        "id": "h7vcaxc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628234534.0
    },
    {
        "author": "imunfair",
        "body": "I would imagine they're getting some attention from the space community in general since they just announced three launches in quick succession recently, which is way faster than their previous launch cadence.",
        "created_utc": 1629016790,
        "id": "h90e8li",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1629045590.0
    },
    {
        "author": "ChrisJD11",
        "body": "It might well do. But long term I'm bullish on RocketLab but skeptical of ASTS and ASTR.\n\n**Rocketlab** \n\n* 21 launches (18 successful)\n* Failed orbital launch attempts before 1st successful orbital mission - 1\n* Increasing launch cadence\n* Photon - taking advantage of there final stage to develop a base vehicle for lunar and interplanetary missions.\n* Lunar mission on the books for this year.\n\nSome of the risks: SpaceX achieving total domination of space launch market with Starship + super heavy. Competition, but they are the front runner in the new group of launch companies. (and lots more I'm sure)\n\n**ASTR** (I do have a position but it's about 1/4 my rocketlab position)\n\n* 3 orbital attempts, 3 failures. The third was close though.\n* I don't like the CEO, gives me a bro vibe.\n* Bulk throw-away rocket manufacturing. I don't like the approach. It's 2021, people don't like waste.\n\n**ASTS** (Had a position pre-merger, had some hype so figured it would take the fairly common spac pattern of the moment and go up a bit then go down a larger bit. Sold on the up.)\n\nDoesn't pass the sniff test for me. \n\nFor years everything I've heard about 5G has been that there will be more towers (higher tower density) needed for coverage (I may be out of date on this?). And these guys think they can get the capacity to cover the globe with 5G speeds using a few satellites? And those satellites are going to be able to pickup the signals from 10s of thousands of phones across a large area when it's hard enough to get ground based coverage?? Then there is the massive arrays they want to deploy in space from these satellites, that's a huge engineering challenge alone.\n\nIt gives me Magic Leap vibes, they gained huge investments from big players like Google. The company had lots of hype and it hasn't produced anything close to what the hype was selling (similar to Hololens from Microsoft).",
        "created_utc": 1629497862,
        "id": "h9pvrwm",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1629526662.0
    },
    {
        "author": "NotChristina",
        "body": "I went the Macgyver route with an IC3 and my iPad for the peloton app. It’s not THE most convenient thing as I have to convert the resistance levels and I don’t have full data after each ride (have cadence but not watts). I think I’m reasonably happy with the $999 capex and $12/mo opex over $2000+ and $39/mo respectively. Financially I couldn’t swing the Peloton but would consider it in the future if I started making bank + moved to somewhere with more space. \n\nI came real close to buying though though. Besides cost what tipped the scales for now is possible integration into other apps. I’ve used Zwift and that allows me to get the competition and camaraderie if I desire it.",
        "created_utc": 1630058805,
        "id": "hajduwo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630087605.0
    },
    {
        "author": "RajivChaudrii",
        "body": "&gt;It is indeed a short term play based on overall strength in cloud market\n\nThis is a good assessment as the growth is from the explosion in cloud.  But long run, CDNs are boring, commodity utilities.",
        "created_utc": 1628082670,
        "id": "h7o98pl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628111470.0
    },
    {
        "author": "valueorbust",
        "body": "Can't someone just collect this data for all prices and write to some cloud storage bucket at a defined cadence, lets say every 10 seconds or something along those lines?",
        "created_utc": 1628102364,
        "id": "h7pjgnm",
        "score": 1,
        "subreddit": "options",
        "created": 1628131164.0
    },
    {
        "author": "ken314159265359",
        "body": "So while the return of Pat has CEO has helped: moral at Intel is still in the crapper.  Can they get back onto this new process cadence that they roadmaped recently?  Maybe but TMG hasn’t been able to deliver so I’m not sure I would bet on it.  So there’s that.\n\nNow let’s get to the bad things:  arm is making inroads into servers, especially into azure/aws.  So they need to have a competitor there are they will have issues.  Intel still runs their own data centers….which are tiny.  Until they decide to seriously go cloud computing they will keep overpaying for compute time.  Pat has to know that (he came back from VM ware) so he needs to figure out how to get into either onto a cloud or become a real cloud provider.  They keep talking about big data and such…..but Intel won’t pay what it costs for big data folks….they are too stingy.  I’m waiting for Intel to decide who they want to and have a real plan to get there.  This is just more of Intel staying the same.",
        "created_utc": 1627868053,
        "id": "h7dogo4",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1627896853.0
    }
]