[
    {
        "author": "notwiththatattidude",
        "body": "How big is this actually? \n\nIs there a legitimate way to quantify how many people would be willing to take this drug as part of their treatment? Will this company have a patent long enough for it to be widely accepted by society?\n\n\nDefinitely a huge advancement, but just because something like this happens, I don't think it relates to guaranteed long-term profits for the company... this is from my experience with biopharm at least.\n\nAdditionally, drugs are only half the battle for legit mental illness treatment - a lot of it lies in therapy. Curious to see what the recommended cadence of this drug would be, or if it's simply a one-and-done dosage (and/or) short period of exposure.",
        "created_utc": 1620654329,
        "id": "gxlv6d0",
        "permalink": "/r/investing/comments/n93uwi/cnbc_a_psychedelic_drug_boom_in_mental_health/gxlv6d0/",
        "score": 55,
        "subreddit": "investing",
        "created": 1620683129.0
    },
    {
        "author": "FinndBors",
        "body": "So, I've been commenting on a lot of VG threads trying to get people to avoid throwing money away or at least try to do the math around the numbers, but have mostly failed. So I'm a huge VG bear and I have high conviction that they will go bankrupt or liquidate or sell for peanuts, but here are some possibilities:\n\n* If you look on their website, they clearly state that 250k was for early birds and if you sign up for waitlist, you most likely won't get that price. So 1.5 mil is a lower bound on revenue per flight.\n* They have 2 spaceships (Unity -- tested and Imagine -- untested) and have 2 more under construction. Burt Rutan's Xprize winner was able to relaunch in 2 weeks, it is plausible that 2 space ships can do 50 launches a year after they get the kinks out and 4 space ships can do 100 launches. Maybe more. I personally would be concerned about market size if they can get to that cadence. 100 launches per year at 2 million revenue per flight is 200 million per year. Not enough to justify current valuation and still not profitable -- especially considering that many launches will add to costs. They'll have to launch a lot more often or somehow cut costs or charge a lot more.\n* Their long term pivot business plan is point to point hypersonic transit. Good luck with that. They do have an advantage with their mothership-spaceship model in that they can launch from a population center without causing sonic boom issues in populated areas -- something Starship point-to-point has an issue with. Starship has to kludge it by saying there is going to be a transfer to an offshore platform. The problem with the mothership-spaceship model is it doesn't scale to larger ships and to get good margin, you need more passengers. Look at Stratolaunch and the size of that mothership -- largest plane in the world, it can't carry that big of a rocket -- no way of sending &gt; 100 people at a time.",
        "created_utc": 1621990587,
        "id": "gzgjhqg",
        "permalink": "/r/investing/comments/nl3ne2/question_how_do_you_expect_virgin_galactic_to_be/gzgjhqg/",
        "score": 10,
        "subreddit": "investing",
        "created": 1622019387.0
    },
    {
        "author": "perky_python",
        "body": "Not sure if this is sarcastic or not, but Rocketlab launch cadence is more like monthly. They launched 7 times in 2020. Aiming for \\~15 in 2021.",
        "created_utc": 1620230794,
        "id": "gx1h2vs",
        "permalink": "/r/SPACs/comments/n5b2gm/announcements_x_daily_discussion_for_may052021/gx1h2vs/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1620259594.0
    },
    {
        "author": "FinndBors",
        "body": "Rebuttal #1: They have no revenue right now. Why are they building more spaceships? Even if they weren't confident about their future, what other choice do they have? They could just return all the money to shareholders, but have you ever seen an organization do that? It isn't that simple. Board members that don't think they can accomplish the task would make more money by liquidating their stock at the current price -- which some have.\n\nRebuttal #2: You are right that SpaceX is in a different market. They can go orbital, which is cooler and lasts longer than 5 minutes -- but currently costs 10s of millions per seat. They will need starship to bring that down but if they can -- at similar prices, SPCE has no way of competing against that.\n\nBO is on the trajectory of doing orbital, but they currently have a comparable suborbital experience to SPCE and it's going to happen roughly at the same time (first paying customer in the summer). The existence of this will reduce SPCEs margins and market share.\n\nI'm not quite sure there will be enough people interested in a mid-6 digit cost 5-minute experience. Everyone is handwaving here. Even if there is, SPCE has an uphill battle in getting the cadence and margins up because of it's 6 passenger-per-flight model an hybrid engine. And it's not easy to scale for the future given SPCE's mothership-spaceship design.",
        "created_utc": 1621901633,
        "id": "gzc2jwq",
        "permalink": "/r/stocks/comments/nkbmpp/virgin_galactic_ii/gzc2jwq/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1621930433.0
    },
    {
        "author": "ZehPowah",
        "body": "SpaceX and China, definitely. \n\nBezos / Blue Origin, nah. They haven't earned a place in the conversation. They're building the rocket that the market wanted 10 years ago, an Ariane 5.1. The first flight might be in 2023. The operational cadence is only one flight per month, which can't even handle Amazon's Kuiper constellation. \n\nRussia can't afford to innovate at this point. \n\nVirgin 2.0... I mean, Rocket Lab is overvalued, but they still have 17 successful launches and a lot of stuff in the works to level up their capabilities. They aren't SpaceX 2.0, either, but they're way more real than Virgin.",
        "created_utc": 1621251367,
        "id": "gyfmhjb",
        "permalink": "/r/SPACs/comments/ne65bd/announcements_x_daily_discussion_for_may172021/gyfmhjb/",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1621280167.0
    },
    {
        "author": "Raze_42",
        "body": "Kind of  complicated to answer, but go into any US store and there's primarily only 2 brands for any given item + the store brand item. Putting it very generally, customers are either store brand buyers or branded buyers. Those brands won't necessarily collude but if one doesn't get more aggressive, the other one definitely won't. Right now a lot of TPRs and Ads have been cancelled for most of this year. Promotions like these will come back but I don't believe the actual cost of goods will come back down.\n\nIt basically means that you probably won't see a huge jump in price YoY if you're buying on promotion, but you will if buying off promotion. For this year, it'll be expensive since you'll see the higher retails along with no promotions. Q4 might be the earliest we see a normal promotion cadence return.",
        "created_utc": 1622293824,
        "id": "gzv9eck",
        "permalink": "/r/investing/comments/nnk43e/this_inflation_wave_is_not_driven_by_growth_and/gzv9eck/",
        "score": 3,
        "subreddit": "investing",
        "created": 1622322624.0
    },
    {
        "author": "Raaazzle",
        "body": "I wish I knew this back in my Army days. Great marching cadence!",
        "created_utc": 1622246095,
        "id": "gzthbic",
        "permalink": "/r/wallstreetbets/comments/nn680g/weekend_discussion_thread_for_the_weekend_of_may/gzthbic/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622274895.0
    },
    {
        "author": "95Daphne",
        "body": "Probably going to wind up being a day where the Dow ends up being up 50-100 points and the S&amp;P unchanged at absolute best if up at all.\n\nThe cadence of today after the morning really smells like early March (and late February too) where you'd see the Dow fight like crazy to try to hold the market up at times but it'd fail.",
        "created_utc": 1620241978,
        "id": "gx27xk3",
        "permalink": "/r/stocks/comments/n5bwii/rstocks_daily_discussion_wednesday_may_05_2021/gx27xk3/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620270778.0
    },
    {
        "author": "RepThatCurry",
        "body": "Not Dividend Reinvestment but there a feature, that I've only seen in Robinhood, that allows you to invest a fixed amount in a stock/ETF at a fixed cadence. For example I invest $150 in SPY every week. For me it's important that it's automated because realistically I don't have the discipline to dedicate time weekly in looking at my portfolio.",
        "created_utc": 1622392568,
        "id": "gzzlwbt",
        "permalink": "/r/investing/comments/nodibt/does_anyone_buy_exclusively_sector_etfs/gzzlwbt/",
        "score": 3,
        "subreddit": "investing",
        "created": 1622421368.0
    },
    {
        "author": "sploot16",
        "body": "They are going to have their mini-loc ready for distribution by EOY if they get FDA approval.  Their butt cream will probably be another year out. But that’s fine, 1 product a year is good cadence.",
        "created_utc": 1619875341,
        "id": "gwjddst",
        "permalink": "/r/pennystocks/comments/n2b0s5/ctxr_going_to_let_me_retire_early/gwjddst/",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1619904141.0
    },
    {
        "author": "Rokustickmaketendies",
        "body": "Perhaps, obfuscating the future are the confounding principles of the astute human cadence towards an untimely and undeniable death.",
        "created_utc": 1621978405,
        "id": "gzfusbj",
        "permalink": "/r/wallstreetbets/comments/nkyn0w/what_are_your_moves_tomorrow_may_26_2021/gzfusbj/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622007205.0
    },
    {
        "author": "Ahrideva",
        "body": "Now you see why it s\\*cks being Chairman of the FED. You have a thousand hedge funds that trade based on your body language, the cadence and intonation of your voice and how often you blink while answering questions from the press. God forbid that you fidget even once.",
        "created_utc": 1620158791,
        "id": "gwxxdr4",
        "permalink": "/r/stocks/comments/n4ryy2/every_time_the_fed_talks/gwxxdr4/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620187591.0
    },
    {
        "author": "kkInkr",
        "body": "SMH, ADI, AMAT, ASML, ATEYY, AVGO, HIMX, INTT,  KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI,  PXLW, QCOM, QRVO, SIMO, SWKS, TER,\n\nbesides the usual AMD, INTC, NVDA, and TSM. Those 4 imo are outdated.  SMH is the ETF.\n\nCircuitry, CDNS, SNPS, ANSS, they are being ignored, but have dominant roles, imo.",
        "created_utc": 1619900068,
        "id": "gwkwyeo",
        "permalink": "/r/stocks/comments/n2705g/best_sector_for_the_next_5_years/gwkwyeo/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619928868.0
    },
    {
        "author": "Darling_Pinky",
        "body": "to follow along with the class by managing your resistance/cadence.\n\nYour membership ($40/month, basically 100% margin) is transferrable to every machine. I don't think people understand that every apartment gym, office gym and box gym will have these eventually.\n\nPTON seems like it's going to be a binary stock. Either it's plummeting to nothing or it'll be $200+ within 5 years. My position is betting on the later but I really hope I'm right.",
        "created_utc": 1620248280,
        "id": "gx2n30d",
        "permalink": "/r/investing/comments/n5jtkv/peloton_pton_recalls_its_tread_and_tread/gx2n30d/",
        "score": 2,
        "subreddit": "investing",
        "created": 1620277080.0
    },
    {
        "author": "ConnorCason",
        "body": "Is selling puts a free money hack in the long run? Even during a multi-year recession, if you just roll the options down and out on a cadence, you’re still collecting theta (deep ITM would be negligible theta, but still some) all the time. It’s only pennies in front of a roller if you get margin called / chose to cover instead of roll, right?",
        "created_utc": 1620734502,
        "id": "gxpwisy",
        "permalink": "/r/wallstreetbets/comments/n9th6n/daily_discussion_thread_for_may_11_2021/gxpwisy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620763302.0
    },
    {
        "author": "slumdungo",
        "body": "This valuation never made sense when they they do nothing new in a commoditized market. It’s not hard to grow revenue by signing low/negative margin deals because all of these large companies utilize a multi-cdn approach and load balance between all of them. The cheapest one gets more traffic for a year until a new contract is negotiated. Pure traffic play CDNs are a race to the bottom and the only way to grow healthily is by doing what Akamai or cloudflare does by focusing on security or added value services.",
        "created_utc": 1620503844,
        "id": "gxf6194",
        "permalink": "/r/investing/comments/n6uka6/fastly_drops_27_after_release_of_q121_results/gxf6194/",
        "score": 1,
        "subreddit": "investing",
        "created": 1620532644.0
    },
    {
        "author": "jboud19",
        "body": "Almost a cinematic cadence.\n\nFor some reason I laughed so hard",
        "created_utc": 1620438127,
        "id": "gxccs3v",
        "permalink": "/r/wallstreetbets/comments/n6y97z/thats_right/gxccs3v/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620466927.0
    },
    {
        "author": "pdieff",
        "body": "Different business lines manufacture and designer.  But I have have a better one for you few know off. CDNS.",
        "created_utc": 1620667567,
        "id": "gxmpogp",
        "permalink": "/r/wallstreetbets/comments/n90t4p/daily_discussion_thread_for_may_10_2021/gxmpogp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620696367.0
    },
    {
        "author": "demikittens",
        "body": "Hmmm what about CDNS...can’t ignore the competition in this very competitive arena",
        "created_utc": 1619959898,
        "id": "gwnmw3e",
        "permalink": "/r/wallstreetbets/comments/n2ojmq/cohu_the_plug_for_your_favorite_semiconductor/gwnmw3e/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619988698.0
    },
    {
        "author": "420is404",
        "body": "I haven't dug into the financial side of CDNs, but: Akamai's generally considered to be a legacy provider. They've headed much more toward the bulk/discount/enterprise market more than product innovation.",
        "created_utc": 1619953078,
        "id": "gwn9is4",
        "permalink": "/r/wallstreetbets/comments/n2obgn/understanding_serverless_fastly_softwaredefined/gwn9is4/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619981878.0
    },
    {
        "author": "PrimeOrigin",
        "body": "That's not a price target or valuation, though if you're going off PE ratios look no further than AMZN circa 2016 at about 1,000. \nThe core auto business posted over $5B in gross profit while building out multiple international production sites. They have higher margins than traditional auto manufacturers and have a decent cadence hitting their target production rates. Can you say depreciation? FSD is hella behind, but it's the dominant tech (say nothing of the infrastructure and engineering team they've built to develop it) in the space that will fundamentally change transportation in this country. \n+Batteries +Solar +Energy Arbitration\n\nOld-auto stocks are essentially just bonds at this point vs a company with real disruptive growth prospects in multiple industries. I'll keep buying until a 3T valuation and hold till about 4.5/5 in 8 years. \n\nHope your bones feel better after Tesla zeros out your puts yet again.",
        "created_utc": 1620847949,
        "id": "gxw3j13",
        "permalink": "/r/wallstreetbets/comments/napius/the_big_tesla_short/gxw3j13/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620876749.0
    },
    {
        "author": "PM_ME_UR__UPVOTE",
        "body": "I guarantee you they will never hit that cadence. If they get really good I could maybe see 1 a month. The amount of people in this sub spouting absolutely ridiculous figures about this company is hilarious.",
        "created_utc": 1621779996,
        "id": "gz5wo7g",
        "permalink": "/r/wallstreetbets/comments/ninbki/virgin_galactic_completes_first_human_spaceflight/gz5wo7g/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621808796.0
    },
    {
        "author": "TruffleOilMaker",
        "body": "I think so too - if you borrow at 0% and get 1% in installments with a similar cadence it won't matter if inflation is running at 2% or 100%.\nYou will always have more money in the future, even if it less money than now. It's the difference between  having 10k today and 5.1k or 5k tomorrow. The former is better than the latter.",
        "created_utc": 1621281150,
        "id": "gyhgblt",
        "permalink": "/r/investing/comments/neid4u/is_coming_inflation_starting_to_be_priced_in_to/gyhgblt/",
        "score": 1,
        "subreddit": "investing",
        "created": 1621309950.0
    },
    {
        "author": "RichSteps",
        "body": "This post mentions: **$CDNS, $LLNW**\n\nOn /r/pennystocks, /u/Take_Notice_Walk has previously mentioned:\n\n|||\n|:-|:-\n**ticker**|SIML\n**mentions**|1\n\n/u/Take_Notice_Walk's account was created **1 year ago**. It has **11478** comment karma and **12622** link karma.\n\n-----\n\n^You ^may ^see ^tickers ^you ^didn't ^mention ^-- ^I'm ^casting ^a ^wide ^net ^because ^y'all ^don't ^always ^$TAG ^your ^ticker ^symbols.\n\n^This ^was ^an ^automated ^response. ^If ^you ^have ^feedback, ^please ^reply ^to ^this ^comment ^or [^(send me a message)](https://www.reddit.com/message/compose?to=RichSteps&amp;subject=bot%20feedback)^.",
        "created_utc": 1620145751,
        "id": "gwxa4l1",
        "permalink": "/r/pennystocks/comments/n4smls/llnw_limelight_networks_cdn_about_to_go_below_3/gwxa4l1/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1620174551.0
    },
    {
        "author": "FactualNeutronStar",
        "body": "If they don't have an answer for how they'll be profitable then they never should have gone public. SpaceX is managing just fine, operating with pretty fat margins on Falcon 9 while still being the most cost-effective medium-heavy launch provider on the market. Starship promises to have even fatter margins on lower expenses and possibly even higher cadence.",
        "created_utc": 1622006481,
        "id": "gzhbwsx",
        "permalink": "/r/investing/comments/nl3ne2/question_how_do_you_expect_virgin_galactic_to_be/gzhbwsx/",
        "score": 1,
        "subreddit": "investing",
        "created": 1622035281.0
    },
    {
        "author": "iguessjustdont",
        "body": "Since February is a very short timeframe, whereas your opinion about the stock is a medium to long-term opinion. The price rising or falling over a couple months is not something that you should be trading on based upon your investment thesis. Especially doubling down, or selling other quality conpanies to trade on. Juat relax and enjoy the ride. \n\nNewer investors often get thrown by the cadence of the markets. They pretty much do their own thing most of the time based upon cash flows in and out, options expiry timing, and general macro trends, before trending towards their target price. Sometimes a big move occurs, but 90% of price movement is incrimental. If you are looking at the stock every day you will miss the forest for the trees, which is it will bounce around for a bit, and 8% in a couple months really isn't much movement for a single stock. \n\nSingle stocks are not like indices. A major index down 8% is something to talk about. A single stock down 8% is a couple pension funds sneezing",
        "created_utc": 1622383039,
        "id": "gzz45fz",
        "permalink": "/r/investing/comments/no814a/intel_stock_falls_should_i_double_down_or_sell/gzz45fz/",
        "score": 1,
        "subreddit": "investing",
        "created": 1622411839.0
    },
    {
        "author": "ribeyeguy",
        "body": "&gt;cadence\n\nhate that fucking word",
        "created_utc": 1621998337,
        "id": "gzgyg3o",
        "permalink": "/r/investing/comments/nl3ne2/question_how_do_you_expect_virgin_galactic_to_be/gzgyg3o/",
        "score": 0,
        "subreddit": "investing",
        "created": 1622027137.0
    }
]