[
    {
        "author": "vacityrocker",
        "body": "Bought F way back at 5.81. At the time I read a few analsists articles downgrading them and some on Bloomberg saying stay away etc etc. I've always been a dweeb type doing what others tel me not not do so I bought 2k shares.... few months ago bought some 2023 leap calls \n\nLooking forward to some additional gains and the new electro 150 does look pretty darn good\n\nWhen analsists say sell you know it's really a buy \n\nSchool Daze!",
        "created_utc": 1623523506,
        "id": "h1jiwrn",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1623552306.0
    },
    {
        "author": "fifthjack_TTV",
        "body": "Posted this yesterday and I got downvoted… guess I was kinda right. Tlry going to $24 today\n\nYo so this is my analysis of TLRY and why I think it’s bullish: \n\n 1 year+ chart:\nJust apply the Fibonacci curve. We are way below 38% and got lots to run. We should easily be able to hit $25 and have a run for $30+ (IMO either end of this week or beginning of the next week unless fed tapering screws us or GME ER takes the whole sector down)\n\n1-3 month chart: looks extremely bullish. Key resistances at $20.50 -$21.00 and $30. Strong support at $14, $17 -$18. Overall, bulls are in charge. Growing 4% a day steadily past 2 weeks with maybe 1 Rex day. \n\n1 week chart: we’ve been able to hold the $18 support and forming a new one around $19.90-20.10 range. We are slowly breaking down the $21 wall that was created back in Jan-Feb. in past 3 days we have hit $20.50-$21.00 range over 4 times and bounced back. But you can tel that it’s looking bullish because while we are bouncing back at the same ceiling price, the support price is steadily increasing. This creates an ascending triangle and is a sign of a strong bull coming up",
        "created_utc": 1623246726,
        "id": "h15icbf",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1623275526.0
    },
    {
        "author": "Own_Contribution1108",
        "body": "Tel your mother, tell your children, tell your doge.... we’re buying clf baby",
        "created_utc": 1623250205,
        "id": "h15qh2d",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1623279005.0
    },
    {
        "author": "SemiConductHer",
        "body": "I see people calling wish a garbage stock and saying nobody uses its services… but isn’t that what makes it a good candidate for a squeeze? Institutional short positions on a seemingly dying company that has caused undervaluation and prime squeeze opportunity. Are you going to sit here and tel me that $WISH is a bad stock, but $AMC, $GME and fucking $BB are good stocks!? Absolutely not, they’ve been pumped up due to nothing but internet hype. The same thing can and should happen with $WISH, it’s in a very similar position.",
        "created_utc": 1623789918,
        "id": "h1w417o",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1623818718.0
    },
    {
        "author": "NohoTwoPointOh",
        "body": "Re: Cylance, I (also?) worked in that industry for many years and know their folks and folks that compete against them.  Cylance is NOT the first company to do that.  Not by far.  \n\nPre-Dell SecureWorks, Damballa, and a little In-Q-Tel-funded shop in Northern Virginia were all applying machine-learning and AI to cybersecurity.  Roughly so by today's standards (especially in SecureWorks' case), but they were all doing it quite early. Damballa came out of Georgia Tech's ATDC incubator.  They had an interesting Chinese fellow that did machine-learning analysis of covert C&amp;C channels. \n\nI had a red Passport.  That thing had I-beams in the side of it.  Tough as nails and fast as hell.  Miss that phone terribly.  Had to ditch it when they started neutering mainstream apps (as I could run YouTube and multitask without the pro subscription).  My last phone was a KeyOne before I went Samsung.  Ick.",
        "created_utc": 1622816793,
        "id": "h0kk611",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622845593.0
    },
    {
        "author": "Anonplox",
        "body": "Currently the interest rate of buying a house in Canada is below 1%. If the interest rates from the Bank of Canada increase even to 1-2%, people’s mortgage payments are going to skyrocket, because they bought a house during a pandemic when rates were predatory to save the economy.\n\nNow that things are getting back to normal, and Canada is leading the charge of vaccines, I see the bank of Canada raising interest rates sooner than later.\n\nIn fact there’s an article here that talks about rates in the US, at least, increased by 2023. That’s not far off. And as we know, Canada follows US moves closely. [Federal Reserve Officials Project Rate Increases in 2023](https://www.nytimes.com/2021/06/16/business/economy/fed-meeting-inflation.html?campaign_id=60&amp;emc=edit_na_20210616&amp;instance_id=0&amp;nl=breaking-news&amp;ref=headline&amp;regi_id=76475603&amp;segment_id=60864&amp;user_id=1d5018a087ae3465a62b080157ab67a9)\n\nThe market is hot, and realtors know this. They are making crazy amounts of commission, along with their partnered brokers.  Most of these people just want to put a deal through before everything goes to shit.\n\nIn my area, there are empty houses. Lawns over grown, and no movement around the properties for months. \n\nIt’s a shit show waiting to happen, and I anticipate it to be bigger than the 2008 market crash.\n\nIn fact, Hamilton, Ontario is considered to be more expensive to live than LA. Fucking LA.  Let me tel you, Hamilton is NO LA. https://www.cbc.ca/news/canada/hamilton/affordability-canada-1.6034606",
        "created_utc": 1624022409,
        "id": "h27gaz1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1624051209.0
    },
    {
        "author": "Stonks1337",
        "body": "I know it’s just a thing everyone has to deal with but it’s so weird to me Schwab actually puts the tax loss into your cost basis when you view your securities thing. I’m pretty sure Robinhood never artificially inflates your cost basis if you have a wash sale they probs just record it on the tax forms. It’s stupid to tel someone you paid this cost basis for a security when in actually you never did you paid a good bit less",
        "created_utc": 1624164121,
        "id": "h2ebuuw",
        "score": 1,
        "subreddit": "investing",
        "created": 1624192921.0
    },
    {
        "author": "Arboring",
        "body": "$TEL in corn-land is a better bet (;",
        "created_utc": 1623101452,
        "id": "h0yi7aq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623130252.0
    },
    {
        "author": "tigolebities",
        "body": "If it’s good news don’t tel anyone because it will just go down as BB always does.",
        "created_utc": 1622658852,
        "id": "h0cezpy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622687652.0
    },
    {
        "author": "Motahababy",
        "body": "Im going to buy my first options. Can someoen tel me how i should trade it? 7 days ? Or 30 days? Etc",
        "created_utc": 1622798241,
        "id": "h0jpqj4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622827041.0
    },
    {
        "author": "farroshus",
        "body": "Can’t tel if you’re being sarcastic, but the first time I had alcohol bought for me in was a flavoured Smirnoff. It was horrible.",
        "created_utc": 1624193898,
        "id": "h2f9tys",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1624222698.0
    },
    {
        "author": "ricardosanch5",
        "body": "Somebody needs to tel hector that pimping cars was only cool inthe year 2005",
        "created_utc": 1623193139,
        "id": "h134teq",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1623221939.0
    },
    {
        "author": "Yoweekeyo",
        "body": "I can tel you one thing though. I’ve been watching all of this BB talk and ain’t seen shit yet Irvin bought into that shit at one time just to get fucked.\nOnly the people that bought in when the stock was down keep trying to pump it. \nIt’s already been pumped and dumped and now the people that are holding onto the bags keep trying to promote it",
        "created_utc": 1624301759,
        "id": "h2kfqoy",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1624330559.0
    },
    {
        "author": "saltyjose1",
        "body": "tel me about it. I have debit spreads expiring tomorrow that I can't sell because there's no buyers. FML",
        "created_utc": 1623996831,
        "id": "h26jmyg",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1624025631.0
    },
    {
        "author": "Caleb0000003",
        "body": "So your advice is to tel people to trade with their emotions? That’s not very good advice...\nI’m not telling people to be ok with their losses because them and my self included should have bought in at the start of the second impulsive wave, I am just stating this price movement is normal.",
        "created_utc": 1623280787,
        "id": "h17scfx",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1623309587.0
    },
    {
        "author": "fifthjack_TTV",
        "body": "Yo so this is my analysis of TLRY and why I think it’s bullish: \n\n 1 year+ chart:\nJust apply the Fibonacci curve. We are way below 38% and got lots to run. We should easily be able to hit $25 and have a run for $30+ (IMO either end of this week or beginning of the next week unless fed tapering screws us or GME ER takes the whole sector down)\n\n1-3 month chart: looks extremely bullish. Key resistances at $20.50 -$21.00 and $30. Strong support at $14, $17 -$18. Overall, bulls are in charge. Growing 4% a day steadily past 2 weeks with maybe 1 Rex day. \n\n1 week chart: we’ve been able to hold the $18 support and forming a new one around $19.90-20.10 range. We are slowly breaking down the $21 wall that was created back in Jan-Feb. in past 3 days we have hit $20.50-$21.00 range over 4 times and bounced back. But you can tel that it’s looking bullish because while we are bouncing back at the same ceiling price, the support price is steadily increasing. This creates an ascending triangle and is a sign of a strong bull coming up",
        "created_utc": 1623221816,
        "id": "h14j10f",
        "score": -4,
        "subreddit": "wallstreetbets",
        "created": 1623250616.0
    },
    {
        "author": "Fickle-Primary-3910",
        "body": "As I load up more AMC &amp; BB....\n\nAlexa play C.R.E.A.M. by Wu Tang",
        "created_utc": 1622579427,
        "id": "h08g2ig",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1622608227.0
    },
    {
        "author": "Impossible-Spell-335",
        "body": "Alexa, play c.r.e.a.m by wu-tang",
        "created_utc": 1622680594,
        "id": "h0drbxh",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1622709394.0
    },
    {
        "author": "emerald-Ember",
        "body": "WU-TANG Financial Advisor",
        "created_utc": 1622713470,
        "id": "h0f5mk1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622742270.0
    },
    {
        "author": "AceBullApe",
        "body": "WU TANG Clan ain’t nuttn to fuk with",
        "created_utc": 1622657966,
        "id": "h0ccv3x",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622686766.0
    },
    {
        "author": "EvlutnaryReject",
        "body": "After collecting that $20k go straight to the Western Union and wire it.. get ready for said alarms!",
        "created_utc": 1622612365,
        "id": "h0a6z5h",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622641165.0
    },
    {
        "author": "geebersgeeb",
        "body": "Wu-Tang and GME are for the children on this glorious Children’s Day! (And DFV!!!!)",
        "created_utc": 1622557280,
        "id": "h072ahs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622586080.0
    }
]