[
    {
        "author": "Zachjsrf",
        "body": "Used to work for the Broadcom (AVGO) co founder (the crazy one) and as it turns out I've hooked up with his girlfriend 🤣 Fuck that guy.",
        "created_utc": 1617752442,
        "id": "gtmoefe",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617781242.0
    },
    {
        "author": "X-Boozemonkey-X",
        "body": "Im a SOXL bull. Here's my take. NVDA at some point will take a breather. AMD has room to run but is not a big part of SOXL. TSM has room to run. LRCX, AVGO, INTC, TXN, ADI, SOXX, and MU are near all time highs.\n\nThere is no doubt in my mind that the demand for chips is through the roof amd will remain high. Every industry thats booming needs them. The shortage is a positive thing for us. Demand is high. We dont want a glut. We want to operate at a slight shortage. That said, we will need perfect numbers to start the next leg up or a breather to let things cool off. Ive been hoarding shares on the dips and am selling covered calls and cash secured puts and then putting the money towards more shares.",
        "created_utc": 1618499142,
        "id": "gum1eqs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618527942.0
    },
    {
        "author": "Katermickie",
        "body": "&gt;Katermickie\n\nDid you fix it? I still see it happening also for AVGO but maybe I'm missing something?",
        "created_utc": 1617875840,
        "id": "gtsitz9",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1617904640.0
    },
    {
        "author": "felunk",
        "body": "I love the amazon is getting into the business so every stock related dumps....WBA, WMT, AVGO, netflix you name it has dumped on that news....ez money everytime....",
        "created_utc": 1617842389,
        "id": "gtr5s7o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617871189.0
    },
    {
        "author": "Mr_Anomalistic",
        "body": "Semiconductor is always solid. Qualcomm, broadcom, skyworks...etc. They supple chips that goes into apple phones and other electronic devices.",
        "created_utc": 1618391472,
        "id": "gugvwhx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618420272.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "MasterCard \nBroadcom\nApple\nBerkshire Hathaway \nShopify\nVisa\nEnphase Energy\nNvidia\nTeradyne\nQORVO\nZebra \nEtsy\nAmazon \nGoogle\nCitigroup \nREGI \n\n\nNot in any particular order, MasterCard, Apple and Nvidia are the largest positions each around 10%",
        "created_utc": 1617769309,
        "id": "gtnjbpg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617798109.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "Lol I own about 70 companies at this point but many of them only make up 1% or less of a 250k portfolio. Largest holdings are \n\nApple\nAmazon \nNVDA \nMasterCard \nVisa\nBroadcom\nBerkshire Hathaway \nSquare\nChevron\nGOOGL",
        "created_utc": 1617920947,
        "id": "gtv5l37",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617949747.0
    },
    {
        "author": "PremiumRedditContent",
        "body": "Broadcom - Capital and dividend growth combined",
        "created_utc": 1617966484,
        "id": "gtx1cda",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617995284.0
    },
    {
        "author": "Agatha_Dunlap",
        "body": "AVGO",
        "created_utc": 1617294223,
        "id": "gt1nw6z",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617323023.0
    },
    {
        "author": "kilo_L33t3r",
        "body": "HP has massive government contracts. Sun was mostly a software company and Oracle still is, but the major hardware companies like Apple, Qualcomm, Broadcom, IBM, Dell, HP, AMD, and Intel all survived and thrived during and after the bubble.",
        "created_utc": 1617948303,
        "id": "gtwhcgt",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1617977103.0
    },
    {
        "author": "Kashm11r",
        "body": " AMD MU NVDA TSM AMAT INTC AAPL AVGO QCOM MRVL TXN NXPI QRVO SWKS CRUS",
        "created_utc": 1617593046,
        "id": "gtezt1p",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617621846.0
    },
    {
        "author": "FinMarketGeometry",
        "body": "It sounds like your goal is to generate passive income rather than long term capital gains. If so, it is not such a good idea investing in qqq.  As of 4/5/2021, I see qqq ETF is most likely reach 330 in a week and make all time new high in a month. However, it cannot go straight up without pullback. Sometimes those pullback could be very deep. The worst thing could happen is that qqq falls to the very bottom when you truly need to cash out from it.  Find something less volatile and delivering constant divvy.  You may even build your own high yield fund by investing several stocks such as KO, RIO, and AVGO.",
        "created_utc": 1617628875,
        "id": "gtg8p48",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617657675.0
    },
    {
        "author": "hopefuldepression",
        "body": "I wish you apes would make AVGO moon, it would be life-changing for me",
        "created_utc": 1617572851,
        "id": "gte08xs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617601651.0
    },
    {
        "author": "StalCair",
        "body": "I am not disputing the usefulness of semis. Only their recent movements. Last month most if not all semi stocks rebounded after earnings (over 100% for most since the march 2020 crash).\n\nNvidia 20% in 1 month.\n\nAMD 12% top 6% rn in one month.\n\nON 20% on the decline in one month.\n\nAVGO 20% in one month.\n\nTXN 20% in a month.\n\nMU 12% in a month.\n\nIntel 15% on the decline in one month.\n\nLRCX  30% on the decline in a month.\n\nTSMC is probably the stock that will tank the least due to its seat on the table of semis and the fact it wasn't overbought 5 weeks ago.",
        "created_utc": 1618487231,
        "id": "guleqxl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618516031.0
    },
    {
        "author": "X-Boozemonkey-X",
        "body": "Nvdia, avgo, lrcx, amd, txn, adi. Were all down about 20% in February/ March. FB, MSFT, and GOOGl arnt the only tech stocks in the nasdaq imfao",
        "created_utc": 1617924304,
        "id": "gtvccoj",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1617953104.0
    }
]