[
    {
        "author": "jaybianchi",
        "body": "It’s very noob whale 🐳 to concentrate your portfolio in the same industry you work in. Ask tech workers laid off in early 2000s how losing their job, seeing their industry get crushed and watching the halving (or worse) of their portfolio felt. I know, I know, it’ll never happen again… except history does like to rhyme. \nAre they good companies? Sure, but even good companies will get crushed in a recession under the right circumstances. I would just be very cognizant of the fact you may need to weather some ugly storms to reap the long term outcome you want.",
        "created_utc": 1628393960,
        "id": "h84r06j",
        "permalink": "/r/StockMarket/comments/p05q7h/seven_horses_diverse_portfolio_to_concentrated/h84r06j/",
        "score": 23,
        "subreddit": "StockMarket",
        "created": 1628422760.0
    },
    {
        "author": "OfficerTruth",
        "body": "**TTCF**\nTattooed Chef is a leading plant-based food company offering a broad portfolio of innovative plant-based food products that taste great and are sustainably sourced. Tattooed Chef’s signature products include ready-to-cook bowls, zucchini spirals, riced cauliflower, acai and smoothie bowls, and cauliflower pizza crusts, which are available in the frozen food sections of leading national retail food stores across the United States. Understanding consumer lifestyle and food trends, and a commitment to innovation, allows Tattooed Chef to continuously introduce new products. Tattooed Chef provides great-tasting, approachable, and innovative products not only to the growing group of consumers who seek to adopt a plant-based lifestyle, but to any of the “People Who Give a Crop™”.\n\nWhy Buy?\n\n- TTCF is one of the very few participants in the plant-based consume cyclical segment. This market is only set for growth as the convergence of a number of structural trends drive global diets away from meat. It's important for TTCF bulls to be cognizant of these trends to fully assess the direction of the market Tattooed Chef aims to capture.\n\n- TTCF's management had previously guided for full-year gross margin of 20% to 25% and adjusted earnings before interest, taxes, depreciation, and amortization (EBITDA) of $2 million to $4 million. But now, management lowered guidance for gross margin to 16%-22% and guided for an adjusted EBITDA loss of $14 million to $17 million.\n\n- TTCF Revenue is expected to grow by 41.30% on average over the next 5 years. This is a very strong growth coupled with the fact that \"emissions from plant-based foods are 10 to 50 times smaller than those from animal products. Meat and dairy also account for around 14.5% of global greenhouse gas emissions. Essentially, if the world is to meet its target of limiting global warming to “well below” 2C, radical changes in the global diet will be critical.\" This implies that demand will only continue to increase.\n\nPrices to look for: $16.14 - $17.58\nTTCF was recently hovering around the $30 price level and is an interesting stock as it has the lowest amount of competitors in it's niche segment of plant-based food providers. What is valuable about TTCF is the extremely low float it maintains and how the smallest catalyst can send this stock soaring for double digit gains. Definitely watch TTCF closely in the coming week.",
        "created_utc": 1628947178,
        "id": "h8wona1",
        "permalink": "/r/pennystocks/comments/p46t7q/you_provide_the_ticker_ill_provide_the_analysis/h8wona1/",
        "score": 16,
        "subreddit": "pennystocks",
        "created": 1628975978.0
    },
    {
        "author": "Snoo_46737",
        "body": "Good point. S/He needs to undo all the bad habits before approaching again.\n\nI am glad to hear that you are cognizant of your own weaknesses and made the right choices to prevent yourself from possibly getting into a disastrous financial situation. Take care :)",
        "created_utc": 1628961336,
        "id": "h8xjkbg",
        "permalink": "/r/stocks/comments/p3zh1t/any_good_comeback_stories_150k_loss/h8xjkbg/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628990136.0
    },
    {
        "author": "the_bollo",
        "body": "Background: I work for a large tech company and a big slice of my compensation is in the form of RSUs. I know next-to-nothing about the stock market and since my company has a \"blue chip\" stock I never thought to sell it, figuring it would just appreciate slowly and more or less increase my comp annually. I've sold shares off in the $5-$20k range before; nothing larger.\n\nI just started researching investing and found that if I had invested in a tech ETF last year, like VOO, I could have gotten a 30+% return instead of a \\~5% return. This is ironic because my company is one of the holdings of VOO and now I feel like a dope for not ETF'ing my shares the moment they've been vesting. \n\nThis leads to two newbie questions:\n\n* If you had six figures worth of stock to move around, would you throw it into VOO instead of one of the individual holdings?\n* If I were to do the above, for reasons of preference, I'd be selling off all of my shares of company X on one brokerage platform and buying VOO on another brokerage platform. Is there a way to accomplish this as more of a transfer than a profit-taking (for tax purposes)? The overall intent is to keep all of that money invested, not to cash out of the market. This would be by far my largest sale so I'm especially cognizant of tax impact.\n\nThanks!",
        "created_utc": 1628397055,
        "id": "h84w2ag",
        "permalink": "/r/investing/comments/ozpwka/daily_advice_thread_all_basic_help_or_advice/h84w2ag/",
        "score": 2,
        "subreddit": "investing",
        "created": 1628425855.0
    },
    {
        "author": "JimmyButtlard",
        "body": "Word of advice: be cognizant of the volume of spreads you write/buy in general. I’ve gotten burned on the bid ask spread too many times. I remember once a UVXY debit spread had a bid of 0.00 and ask of like 2.10 for a while. My fault for entering the position, but lame",
        "created_utc": 1627827655,
        "id": "h7bdtuy",
        "permalink": "/r/wallstreetbets/comments/ovmkpw/call_debit_spreads/h7bdtuy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627856455.0
    },
    {
        "author": "AndrewIsOnline",
        "body": "A draft bill to legalize medical cannabis in Mississippi could be taken up a special session in the legislature this month. \n\nBy Geoff Pender, Mississippi Today\n\nThe lead Senate and House negotiators working on a Mississippi medical marijuana program to replace the one shot down by the state Supreme Court say they’re close to having a draft that could prompt a special legislative session, as early as this month.\n\n“I believe we have basically most of the major issues resolved,” said Sen. Kevin Blackwell, R-Southaven, who’s leading the Senate’s medical marijuana work. “We’re very, very close.”\n\nRep. Lee Yancey, R-Brandon, said, “I would be surprised if there were not a special session soon, but that’s not my call … I think at some point soon we will be ready to say to the governor that we have something we can work with.”\n\nMississippi lawmakers are trying to reach consensus on a medical marijuana program after the state Supreme Court shot down one overwhelmingly passed by voters last year with ballot Initiative 65. The state Supreme Court ruled in May that the medical marijuana initiative and the entire ballot initiative process is invalid.\n\nGov. Tate Reeves (R) has sole authority to call lawmakers into a special session. He has said he would do so for a medical marijuana bill, but not before the House and Senate have general agreement on a proposal to avoid a long, drawn out session.\n\nBlackwell and Yancey had previously estimated a session could be called by mid-August. They said that might be pushed back, but that having one before the end of the month is still doable.\n\nNeither Blackwell nor Yancey would provide specifics of agreements they’ve reached on taxation, licensing and other particulars of a program.\n\n“I think we owe it to other legislators to let them have a chance to view and vet what we have worked on to this point,” Yancey said. “Each of us will have to get consensus to get 3/5 passage in both houses. We are cognizant of how important this is, that there are those our there who need this medication, and we are trying to put together a program we can be proud of — and know that we will have to tweak it year to year — but trying to get it as good as we can on the first push.”\n\nBlackwell said: “They don’t have a program right now, and I think we are going to give them a program that is better than the one from Initiative 65.”\n\nKen Newburger, director of the Mississippi Medical Marijuana Association, said he’s been in contact with Blackwell and Yancey, and is likewise confident an agreement, and a special session, will happen soon. Newburger said he believes lawmakers have taken input from medical marijuana advocates, patients and business leaders.\n\n“I think that’s been the most refreshing and surprising part of this whole legislative process, has been the willingness of the legislators in both chambers to reach out to people who have been advocating it, and patients who have been advocating it for years,” Newburger said.\n\nNewburger said his association has four main points it wants lawmakers to retain from the defunct Initiative 65:\n\nTo allow broad patient access to various forms — smokable, edibles, pills, etc. — of cannabis products with varying levels of THC, the psychoactive agent in marijuana.\nFor certification of patients to remain in the hands of doctors, not “some bureaucratic system.”\nFor cultivation and dispensing of cannabis to be a “free market enterprise” that allows broad participation and doesn’t limit businesses with exorbitant fees and license costs.\nThat the program be self-funded, that fees collected for the program fund it.\nNewburger said he is optimistic lawmakers will work to enshrine these tenets of Initiative 65 into a new law.\n\nYancey said he believes the House will work to hew as closely to the voter-passed initiative as possible.\n\nThis story was first published by Mississippi Today.",
        "created_utc": 1628775456,
        "id": "h8niu8c",
        "permalink": "/r/weedstocks/comments/p2ywwp/mississippi_lawmakers_very_close_to_deal_on/h8niu8c/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1628804256.0
    },
    {
        "author": "jsboutin",
        "body": "It's really not that controversial. Just something to be cognizant of. That case is pretty clear cut, others aren't.",
        "created_utc": 1628697654,
        "id": "h8jqchk",
        "permalink": "/r/ValueInvesting/comments/p1xgcx/why_is_depreciation_as_bad_as_everyone_says/h8jqchk/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1628726454.0
    },
    {
        "author": "ShockinglyEfficient",
        "body": "For a lot of new retail traders, the market has been like this for as long as they've been cognizant of it. Crazy to think about.",
        "created_utc": 1628348004,
        "id": "h827rwz",
        "permalink": "/r/StockMarket/comments/ozm2oa/what_a_time_to_be_alive/h827rwz/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1628376804.0
    }
]