[
    {
        "author": "apooroldinvestor",
        "body": "MSFT AMZN AAPL FB GOOGL will continue to dominate long after we're dead.\n\nAnd so won't ASML LRCX TSM and HD and UNH.",
        "created_utc": 1619820171,
        "id": "gwh5dqz",
        "permalink": "/r/stocks/comments/n24c8h/is_faang_becoming_boring_what_will_be_the_staples/gwh5dqz/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1619848971.0
    },
    {
        "author": "J4ckstr4w84",
        "body": "If you think about your portfolio over a really long Period (10, 20, 30 years), it’s super hard to beat the s&amp;p 500. So you’re probably best off having most of your money in something like spy. But I know that’s not much fun (I pick my own stocks for my Roth IRA). So if you want to pick stocks, I’d say have 15-20 companies or so (more is fine with zero commissions now). Pick stocks that have monopolies (Apple, Facebook, Google, Amazon), the strongest brands (Starbucks, Disney, Nike), and stocks which are growing their earnings and their revenue consistently over time (United health, Home Depot). Plus maybe throw in some newer companies (just 1 or 2 or a few more if you want more than 20 stocks) that have hyper growth and you think will be dominant in 2030 or whatever (square, crowdstrike, Zillow). AI is good! (Nvidia, Tesla) And definitely have half or more of your stocks NOT tech! New investors seem to want mostly tech....you need diversity. Also, really try to have most of your stocks be on the cheaper side as far as forward P/E ratio. Under 30 forward p/e is good right now. And if it’s higher, at least have a lowish PEG ratio, like Amazon. Dividends are good too! Other stocks which will be great for many years to come are Linde, Deere, JP Morgan, Blackrock, Microsoft, Goldman Sachs, PayPal, Lam Research, Chipotle, Visa. Do your thing! Make sure you’re super diverse and have mostly the biggest, best companies that will grow earnings and revenue for many years!",
        "created_utc": 1619061606,
        "id": "gvel09e",
        "permalink": "/r/stocks/comments/mvphtr/after_1_year_of_investing_in_stocks_im_feeling/gvel09e/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619090406.0
    },
    {
        "author": "TheTigersAreNotReal",
        "body": "Chick that manages her own fund posted on twitter that she expects LRCX to hit $700 soon. So I bought my calls at the top of the day. Already down $200. Hopefully she’s right, I got like 2.5 weeks for this to hit",
        "created_utc": 1617668291,
        "id": "gtijorf",
        "permalink": "/r/wallstreetbets/comments/mktg0s/what_are_your_moves_tomorrow_april_06_2021/gtijorf/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617697091.0
    },
    {
        "author": "Hobojoe-",
        "body": "The problem with chip shortage is that even if you invest in Foundries right now, their supply comes online 2-3 years from now.\n\nIf you want to invest in producers of Foundry equipment and material, Applied Materials, Ultra Clean Holdings, Lam Research, and Entegris",
        "created_utc": 1619760566,
        "id": "gwe4oz1",
        "permalink": "/r/CanadianInvestor/comments/n1jtd1/global_chip_shortage_crushing_auto_stocks/gwe4oz1/",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1619789366.0
    },
    {
        "author": "voneahhh",
        "body": "On my watchlist of stocks that are too rich for my blood: LRCX and Chipotle smashed earnings",
        "created_utc": 1619036632,
        "id": "gvd60z7",
        "permalink": "/r/stocks/comments/mvbyxu/rstocks_daily_discussion_wednesday_apr_21_2021/gvd60z7/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619065432.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Also LRCX.",
        "created_utc": 1619821685,
        "id": "gwh8hmn",
        "permalink": "/r/stocks/comments/n24c8h/is_faang_becoming_boring_what_will_be_the_staples/gwh8hmn/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619850485.0
    },
    {
        "author": "mushlafa123",
        "body": "Shits been looking rosy over in semi town. I'm tits deep on various calls \n\nAmat\nLrcx\nMU\nAmd\nTsm",
        "created_utc": 1617643404,
        "id": "gth3bhz",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gth3bhz/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617672204.0
    },
    {
        "author": "patright333",
        "body": "LRCX with a nice finish to the trading week...",
        "created_utc": 1617311674,
        "id": "gt2q0zq",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gt2q0zq/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617340474.0
    },
    {
        "author": "X-Boozemonkey-X",
        "body": "Im a SOXL bull. Here's my take. NVDA at some point will take a breather. AMD has room to run but is not a big part of SOXL. TSM has room to run. LRCX, AVGO, INTC, TXN, ADI, SOXX, and MU are near all time highs.\n\nThere is no doubt in my mind that the demand for chips is through the roof amd will remain high. Every industry thats booming needs them. The shortage is a positive thing for us. Demand is high. We dont want a glut. We want to operate at a slight shortage. That said, we will need perfect numbers to start the next leg up or a breather to let things cool off. Ive been hoarding shares on the dips and am selling covered calls and cash secured puts and then putting the money towards more shares.",
        "created_utc": 1618499142,
        "id": "gum1eqs",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/gum1eqs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618527942.0
    },
    {
        "author": "smokeyjay",
        "body": "Already own semis LRCX and TSM.  Thinking of AMAT.  I'm cautious now because it seems like everyone wouldn't shut up about semis now and its starting to feel frothy.  \n\nBought HEI.A yesterday.  Looking at opening a call on CVS.  The times I've gone to CVS in the States it seemed so shitty though.",
        "created_utc": 1617726819,
        "id": "gtl3xyz",
        "permalink": "/r/wallstreetbets/comments/ml86d3/daily_discussion_thread_for_april_06_2021/gtl3xyz/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617755619.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I am.  Hypothetical.  I have 5% in each stock.  20% is msft aapl though.\n\nHere's some of my portfolio.\n\nMsft aapl pypl crwd SQ HD UNH total market tmo ASML lrcx wmt SHW",
        "created_utc": 1618973454,
        "id": "gva5xis",
        "permalink": "/r/stocks/comments/mv4s98/im_making_my_entire_portfolio_msft_and_aapl_where/gva5xis/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619002254.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "Safer\nFB \nGoog\nAmzn\nAmat / lrcx\nLow\n\nRiskier\nCoin/voyager digital\nJumia\nPypl\nPltr\nTtcf",
        "created_utc": 1618683624,
        "id": "guvs9ij",
        "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/guvs9ij/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1618712424.0
    },
    {
        "author": "spatenfloot",
        "body": "AMAT &amp; LRCX",
        "created_utc": 1619613593,
        "id": "gw5yq9e",
        "permalink": "/r/stocks/comments/n0azop/rstocks_daily_discussion_wednesday_apr_28_2021/gw5yq9e/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619642393.0
    },
    {
        "author": "Actual-Ad-7209",
        "body": "Except for the obvious candidates (TSMC, AMD, Samsung, Nvidia and Intel) I'm holding ASML, AMAT and LRCX. \n\nThere is a lot of confirmed investment in new fabs and these three are absolutely necessary for all of them.",
        "created_utc": 1618644829,
        "id": "gutgc1t",
        "permalink": "/r/stocks/comments/msl1js/alternative_semiconductor_stocks/gutgc1t/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1618673629.0
    },
    {
        "author": "username--_--",
        "body": "technically, you'd buy ASML and LRCX as they create the hardware and software for the fabs.",
        "created_utc": 1619805883,
        "id": "gwgap01",
        "permalink": "/r/wallstreetbets/comments/n1w2mt/amds_fundamentals_in_charts_time_to_rise/gwgap01/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1619834683.0
    },
    {
        "author": "mushlafa123",
        "body": "Man I spent all Tuesday on here preaching about amat and lrcx. If anyone listened and bought some weeklies. They'd be looking at minimum 500%.",
        "created_utc": 1617312161,
        "id": "gt2r10p",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt2r10p/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617340961.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Fidelity active managed funds have returned 20% for over a decade.  Or you can invest in faangs and buy and hold.  I've done very well with individual stocks.  You just have to find good companies like HD MSFT LRCX UNH AAPL NVDA etc.\n\nAnd so what if you don't beat the market?  You accept what you get in life.",
        "created_utc": 1618475759,
        "id": "gul2bea",
        "permalink": "/r/stocks/comments/mqyv3r/how_to_bounce_back_after_losing_so_much/gul2bea/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1618504559.0
    },
    {
        "author": "Spec-Chum",
        "body": "They're a competitor of TSM (not really, in practice; UMC are nowhere near as advanced, specialising in 28nm and above fab), so they won't benefit from this.\n\nTo look at companies that would, look at: TER, ASML and LRCX as well as AMAT and ASYS from the OP.",
        "created_utc": 1617319799,
        "id": "gt35x4o",
        "permalink": "/r/stocks/comments/mi1v5s/taiwan_semiconductors_investing_100_billion_to/gt35x4o/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1617348599.0
    },
    {
        "author": "surmoiFire",
        "body": "ASML, LRCX, AMAT",
        "created_utc": 1617896756,
        "id": "gttlrfn",
        "permalink": "/r/wallstreetbets/comments/mmog6c/daily_discussion_thread_for_april_08_2021/gttlrfn/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617925556.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "Nah, LRCX and ASML have earnings coming up.  They're gonna rock and it'll be nice juice for SOXL.",
        "created_utc": 1617945130,
        "id": "gtwdas8",
        "permalink": "/r/wallstreetbets/comments/mn04vf/what_are_your_moves_tomorrow_april_09_2021/gtwdas8/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617973930.0
    },
    {
        "author": "apooroldinvestor",
        "body": "ASML and LRCX have both outperformed MSFT for many years!  Maybe I should bring them to 5% in my portfolio.\n\nLRCX seems like a good value compared to ASML though.\n\nThoughts?",
        "created_utc": 1618981373,
        "id": "gvaihgl",
        "permalink": "/r/stocks/comments/mv4s98/im_making_my_entire_portfolio_msft_and_aapl_where/gvaihgl/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619010173.0
    },
    {
        "author": "ScarletHark",
        "body": "A comment I was replying to was deleted, it was basically asking about different ways to play semis this summer on a budget, and mentioned they had done calls on SOXL and puts on SOXS so far. So I wanted to post the reply here anyway.\n\n\\---------------------------------------------------------------------------\n\nSOXL/counter-SOXS is a good way to play the semi expansion through all of its phases; I have long SOXL in my investment account for this reason. It's 3x levered already, so adding leverage through options takes nerves of steel, because that leverage swings both directions -- you will need to ride out the stomach-churning drops that can happen day-to-day. However, swing-trading or scalping options on SOXL/SOXS can work, because the semi industry only has tailwinds right now, and at 1,000 feet, I think SOX/SOXL/counter-SOXS trends upwards through this year.\n\nIt's possible to do the same with individual names, including some of the ones I mentioned. One of the issues will be figuring out whether the recent gap-ups in names like AMAT, ASML, LRCX and TER are fully pricing in PEG, because AMAT jumped from 24x TTM earnings to 30x; TER jumped from about the same level to 27x; LRCX to 28x. But that's all TTM earnings -- these companies are expecting additional earnings growth this year on the back of announcements by Intel and TSMC to spend upwards of at least $120B over the next three years ($100B announced by TSMC, $20B so far announced by Intel, with a hint of more to come later this year). In Feb 2021, [the AMAT earnings release had already painted a rosy picture for 2021](https://www.fool.com/earnings/call-transcripts/2021/02/19/applied-materials-amat-q1-2021-earnings-call-trans/); we'll possibly know more come the [AMAT Investor Day on April 6](https://ir.appliedmaterials.com/events/event-details/investor-meeting). Also know that AMAT supplies not just the CPU/GPU manufacturers, but also has good exposure to the memory semiconductor manufacturers, such as Micron (MU), who just had an incredible ER and gave impressive 2021 projections.\n\nI keep singling out AMAT because in terms of options, they are the most liquid, and therefore the most accessible; ASML and LRCX are great companies but their options chains tend to be less liquid than AMAT's; LRCX is a bit better than ASML's in this regard. These could be good LEAPS opportunities if you are willing to wait out IV before entering, and wait out buyers when you go to sell. TER only has monthlies, and have OK liquidity around the money, but you can still get decent action out to 0.04 delta above the money on TER calls. TER IVR is currently 11, but the options are still running in the 40s/50s for IV. \n\nI had previously done 113/114 put credit spreads on AMAT for Mar-5 and Mar-12 expirations, and those both held (Mar-5 closed at 113.45 IIRC, however). I later opened a PMCC on AMAT for Jan22\\[80c\\]/Mar-26\\[121c\\] and ended up chasing the short higher because AMAT jumped so fast (up to that point, AMAT had been trending steadily upwards, but not leaping like it has the past few days). I was able to get out of the short (which I had rolled to Apr-9 125) when AMAT retreated a bit, and then sold the LEAPS too because I figured the spike was done -- regretting that now. ;) I'm waiting a few more days to see if the churn is done (and for IV to come back down), and will probably open another LEAPS on it at some point. AMAT is still pretty volatile -- IVR 46 (which is unusual for them up to this point this year) and Apr-16 options are still in the 40s and 50s, favoring selling, rather than paying, premiums. \n\nI don't think we see a retreat in any of these names this summer; they've been able to withstand the rotation in and out of tech the past couple of weeks, which suggests that traders and investors are finally done painting everything that smells of tech with the same broad brush.",
        "created_utc": 1617330496,
        "id": "gt3oku4",
        "permalink": "/r/options/comments/mi9kxb/playing_the_semiconductor_shortage/gt3oku4/",
        "score": 1,
        "subreddit": "options",
        "created": 1617359296.0
    },
    {
        "author": "greasyg2121",
        "body": "Man, just circling back on this discussion. TSM is in the drivers seat. Add AMAT, LRCX and ASML and you have the making of a cash cow. July 16th  130c are doing swimmingly for TSM",
        "created_utc": 1617416161,
        "id": "gt7fas2",
        "permalink": "/r/smallstreetbets/comments/mcwqgq/tsm_taiwan_semiconductor_manufacturing_a_must/gt7fas2/",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1617444961.0
    },
    {
        "author": "I_like_to_build",
        "body": "Pick some shit you know, and watch it...  and stay in your lane:  for me MU, LRCX, NVDA, AMAT, AMD.\n\nBut also diversify a bit among sectors...  so I've got some DKNG, NCLH, CCL, DIS\n\nMeme stocks are fine, but buy when cheap as fuck and with calls get them a bit out.  Some shit has stupid premiums.  Don't buy those.\n\nWhen the market is doing great and everything is on fire, that's not the time to buy.  That's the time to unwind positions and take profits.\n\nWhen shit sells off, you have you have to have a big pile of cash on hand to buy with.  If all your shit bled down during a sell off you can't buy the bottom.\n\nMade a bunch of money on GME in March.  Then lost 20% of it because I was buying everything high.  Managed to get out as Nasdaq corrected down 10%.  But I had been watching all that shit.\n\nWhen MU was around 80, LRCX was 550, AMAT 95... I bought a shit ton of calls cheap as fuck.  Same thing with the BB dip and cruise lines.\n\nThen as it went up I started taking profits.\n\nDid I sell AMAT and LRCX too soon.  Fuck yeah.  Did I buy back in.  Fuck no.  I'm not buying shit now.  I'm just taking profits.\n\nWhen shit tanks back down I will buy calls again.  Am I missing out on shit.  Fuck yeah.  But my portfolio value is growing and I've got a ton of fucking ammo when prices come down.\n\nAlso once shit reaches 100%, I always sell half and cover my investment.  Now if it starts to sell off I'm good and can exit and still have gain overall.  I can also have the balls to let it moon because my risk is now zero.",
        "created_utc": 1617808519,
        "id": "gtp2wjs",
        "permalink": "/r/wallstreetbets/comments/mlrweo/improving_as_a_trader/gtp2wjs/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617837319.0
    },
    {
        "author": "NateArcade",
        "body": "AMAT and LRCX are a great combo",
        "created_utc": 1617774781,
        "id": "gtnqnce",
        "permalink": "/r/stocks/comments/ml7rbq/rstocks_daily_discussion_technicals_tuesday_apr/gtnqnce/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617803581.0
    },
    {
        "author": "HazardousMako",
        "body": "Interesting to see what this does to semiconductors seeing how most of them like AMAT, LRCX, KLAC, TSM, etc. all make most of their money in Asia.\n\nhttps://www.bbc.com/news/business-56685136",
        "created_utc": 1617939194,
        "id": "gtw4arh",
        "permalink": "/r/wallstreetbets/comments/mn04vf/what_are_your_moves_tomorrow_april_09_2021/gtw4arh/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617967994.0
    },
    {
        "author": "iamjt",
        "body": "Why do some of you guys keep going for TSM or AMD... Just go straight for LRCX. \n\n\nThe chip manufacturers are literally getting ransomed by lam research these days.",
        "created_utc": 1617953664,
        "id": "gtwnitt",
        "permalink": "/r/wallstreetbets/comments/mn04vf/what_are_your_moves_tomorrow_april_09_2021/gtwnitt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617982464.0
    },
    {
        "author": "Dematsa",
        "body": "AMAT, LRCX, AMD, KLAC, TSM",
        "created_utc": 1617574171,
        "id": "gte2qpz",
        "permalink": "/r/stocks/comments/mjrul6/long_term_stocks/gte2qpz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617602971.0
    },
    {
        "author": "seigy",
        "body": "I've been in this sector for a long time and it is my primary sector (~50% of my portfolio).  Based on my last cross screenings there are a lot of great plays here.  I am not going to specify any of my positions and recommend you independently investigate any stock further before investing.  With that said my most recent analysis kicked out.  \nSemi-eq: AMAT, LRCX, TER\nSemi-fab: TSM\nChips: AMD, NVDA, QRVO, &amp; SWKS\n\nThere are many other great names in the area and some that I want to buy myself however, I work primarily on a formulaic approach to removes my bias.",
        "created_utc": 1617589604,
        "id": "gteu49y",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gteu49y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617618404.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Asml and LRCX have done better than both for many years.",
        "created_utc": 1618983531,
        "id": "gvalb2c",
        "permalink": "/r/stocks/comments/mv4s98/im_making_my_entire_portfolio_msft_and_aapl_where/gvalb2c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619012331.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 21st of April\n\n\n\n## Upcoming events for Wednesday, April 21st\n\n - Expected earnings:\n\n  ANTM, ASML, BANR, BDN, BEDU, BKR, BOKF, BXS, CACI, CATC, CCI, CHDN, CLB, CMG, CNS, CP, CPSS, CSV, CVBF, CVCY, DFS, EFX, EGBN, ERIC, FCFS, FHN, FR, GGG, GL, GSBC, HAL, HBMD, HCSG, INBK, KMI, KNX, LAD, LOB, LRCX, LSTR, LVS, MMLP, NBN, NDAQ, NEE, NEP, NEU, NTGR, NWE, OFG, PLBC, PLXS, RCI, REXR, RHI, RLI, RUSHA, RUSHB, SAVE, SBNY, SEIC, SLG, SLM, SNBR, STC, STRM, STXB, TBK, TCBI, TEL, TRST, TSC, UBFO, UFPI, UMPQ, UNB, USAP, VMI, VZ, WASH, WHR, XM\n\n - Ex-div:\n\n  AGX, APA, BGH, CFBK, DX, FUL, LTC\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.920%)\n    - Crude Oil Imports (previous: 0.443M)\n    - Crude Oil Inventories (consensus: -2.975M, previous: -5.889M)\n    - Cushing Crude Oil Inventories (previous: 0.346M)\n    - Distillate Fuel Production (previous: 0.004M)\n    - EIA Refinery Crude Runs  (previous: 0.007M)\n    - EIA Weekly Distillates Stocks (consensus: -0.956M, previous: -2.083M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.7%, previous: 1.0%)\n    - Gasoline Inventories (consensus: 0.464M, previous: 0.309M)\n    - Gasoline Production (previous: 0.336M)\n    - Heating Oil Stockpiles (previous: -0.028M)\n    - MBA 30-Year Mortgage Rate (previous: 3.27%)\n    - MBA Mortgage Applications (previous: -3.7%)\n    - MBA Purchase Index (previous: 279.5)\n    - Mortgage Market Index (previous: 667.7)\n    - Mortgage Refinance Index (previous: 2,916.7)\n\n## Upcoming events for Thursday, April 22nd\n\n - Expected earnings:\n\n  AAL, ABCB, ACBI, AEP, AFI, ALK, ALLE, AMAL, AMNB, ARCH, ARD, ARI, ASB, ASR, AUB, BANC, BIIB, BJRI, BKU, BMTC, BOOM, BPRN, BX, CADE, CAJ, CAMP, CASS, CCBG, CE, CFB, CFFI, CLF, CLFD, CS, CSL, CSTR, CVLY, DGX, DHI, DHR, DOW, EIG, EWBC, FAF, FBIZ, FBRX, FCX, FE, FFBC, FFIN, FRBK, FRME, FVCB, GBCI, GFED, GPC, GRC, GTLS, HBAN, HCA, HFWA, HRI, HTBK, HTH, HZO, ICBK, IIIN, INDB, INDT, INTC, IQV, ISTR, KB, KN, LMST, LUV, LYTS, MAT, MBIN, MCBC, MKTX, MNOV, MOFG, MSBI, MYFW, NBHC, NUE, NURO, NVR, NWFL, ODFL, OFLX, OPBK, ORI, OZK, PBCT, PDS, PINE, PNR, POOL, PSTV, PWOD, RBCAA, RBNC, RS, SAFE, SAM, SAP, SASR, SBCF, SCKT, SITC, SIVB, SKX, SNA, SNAP, SON, SRCE, STBA, STRT, STX, T, TAL, TPH, TRN, TSCO, TZOO, UNP, USX, UTMD, VICR, VLO, VLRS, VRSN, WNS, WSFS, WSO, WSO.B, WWE\n\n - Ex-div:\n\n  ACP, AGD, AOD, ASGI, AWP, BGB, BGX, BSAC, BSL, BUSE, BWG, COKE, CVS, DEX, DFP, DMO, EFF, EFR, EFT, EHI, EMD, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EVG, EVT, EXD, EXG, FFC, FLC, FMN, GAIN, GDO, GLAD, GOOD, HFRO, HGLB, HIE, HIO, HIX, HYI, IGI, KALU, LAND, LKFN, MGU, MMU, NHF, NVT, PFD, PG, PNR, PPT, SBI, SCD, SM, TPZ, USA, WEA, WIA, WIW, WSM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.010%)\n    - 5-Year TIPS Auction (previous: -1.320%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Chicago Fed National Activity (previous: -1.09)\n    - Continuing Jobless Claims (consensus: 3,667K, previous: 3,731K)\n    - Existing Home Sales (consensus: 0.8%, previous: -6.6%)\n    - Existing Home Sales (consensus: 6.19M, previous: 6.22M)\n    - Initial Jobless Claims (consensus: 617K, previous: 576K)\n    - Jobless Claims 4-Week Avg. (previous: 683.00K)\n    - KC Fed Composite Index (previous: 26)\n    - KC Fed Manufacturing Index (previous: 23)\n    - Natural Gas Storage (previous: 61B)\n    - US Leading Index (consensus: 1.0%, previous: 0.2%)\n\n## Upcoming events for Friday, April 23rd\n\n - Stock splits:\n\n    - VXX @ **1:4**\n\n - Expected earnings:\n\n  ALV, AROW, AXP, AZZ, BCML, BOTJ, BRID, CBAN, CIVB, CIZN, CWBC, E, ESQ, ESXB, FHB, FMAO, FSBW, GCBC, GNTX, HON, KMB, LFC, LSBK, MCBS, MOG.A, MOG.B, PBIP, PFIS, RF, SBSI, SLB, SXT\n\n - Ex-div:\n\n  ACI, CAT, CE, DHC, FAST, ILPT, OKE, OPI, RMR, RMRM, SLP, SVC, TRMT, USAC, VALU\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.4K)\n    - CFTC Copper speculative net positions (previous: 36.0K)\n    - CFTC Corn speculative net positions (previous: 543.3K)\n    - CFTC Crude Oil speculative net positions (previous: 492.7K)\n    - CFTC Gold speculative net positions (previous: 180.9K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -6.1K)\n    - CFTC Natural Gas speculative net positions (previous: -51.3K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -40.1K)\n    - CFTC Silver speculative net positions (previous: 36.4K)\n    - CFTC Soybeans speculative net positions (previous: 224.0K)\n    - CFTC Wheat speculative net positions (previous: 5.5K)\n    - Manufacturing PMI (consensus: 60.5, previous: 59.1)\n    - Markit Composite PMI (previous: 59.7)\n    - New Home Sales (consensus: 12.8%, previous: -18.2%)\n    - New Home Sales (consensus: 886K, previous: 775K)\n    - Services PMI (consensus: 61.9, previous: 60.4)\n    - U.S. Baker Hughes Oil Rig Count (previous: 337)\n    - U.S. Baker Hughes Total Rig Count (previous: 432)\n\n^^^^2021-04-21",
        "created_utc": 1618999220,
        "id": "gvb2g0z",
        "permalink": "/r/RobinHood/comments/mvccju/daily_discussion_thread_april_21st_2021/gvb2g0z/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1619028020.0
    },
    {
        "author": "apooroldinvestor",
        "body": "HD UNH AAPL MSFT CRWD SQ PYPL LRCX ASML NVDA TSM TMO wmt.\n\nWhy do you need 10 companies from each sector?",
        "created_utc": 1619082264,
        "id": "gvfb37t",
        "permalink": "/r/ValueInvesting/comments/mvy47d/top_10_holdings_of_all_sector_portfolio/gvfb37t/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1619111064.0
    },
    {
        "author": "gainbabygain",
        "body": "So...TSM, ASML, &amp; LRCX all beat ER and went down. Maybe a trend in semi...",
        "created_utc": 1619108526,
        "id": "gvgki8m",
        "permalink": "/r/wallstreetbets/comments/mw1ekp/daily_discussion_thread_for_april_22_2021/gvgki8m/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619137326.0
    },
    {
        "author": "NateArcade",
        "body": "AMAT is great. Consider pairing it with LRCX. These are the #1 and #3 holdings of the PSI ETF, which focuses primarily on the semiconductor *equipment* sector.",
        "created_utc": 1618850269,
        "id": "gv3kg9k",
        "permalink": "/r/stocks/comments/mu3hqz/looking_at_amat_today/gv3kg9k/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618879069.0
    },
    {
        "author": "Amazing_Succotash677",
        "body": "I take lots of risks. Biggest positions are QCOM and LRCX",
        "created_utc": 1619234652,
        "id": "gvn73u4",
        "permalink": "/r/stocks/comments/mwzgik/does_anyone_in_this_sub_take_risks_or_is_everyone/gvn73u4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619263452.0
    },
    {
        "author": "lohith15",
        "body": "Alright already have small position FDs on nvda , aapl, sq, roku, SE,amd and LRCX \n\nAny other tech yolos you guys reccomend ?",
        "created_utc": 1617849815,
        "id": "gtrkdho",
        "permalink": "/r/wallstreetbets/comments/mmakl8/what_are_your_moves_tomorrow_april_08_2021/gtrkdho/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617878615.0
    },
    {
        "author": "I_like_to_build",
        "body": "Yep.  NVDA finally came back, took those profits.  Took rebound profits on AMAT, MU, LRCX, NXPI.\n\nGot lucky with PLTR finally printing today.  Maybe I get lucky before the correction and sell off and AMC and BB will print?  Still have a bit of ASO, NHCL, and CCL that printed and is still doing work for me.\n\nBut I'm about 85% cashed out waiting for the next sell of or correction.  Will be interesting to see how much more AMD can be driven down.\n\nGiven up home on UWMC, MVIS, APHA, turning green.\n\nI'm ready for these prices to get back down and unlike the last correction, now I've got a big ol pile of cash to throw at it.  Don't see what the catalyst will be.  Treasuries keep going down... earnings should be good this week.  Don't know what's it gonna be but I'm bout ready.",
        "created_utc": 1618378668,
        "id": "gughvy1",
        "permalink": "/r/wallstreetbets/comments/mqhcla/yolo_all_my_savings_on_spy/gughvy1/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618407468.0
    },
    {
        "author": "SpongEWorTHiebOb",
        "body": "AMAT, LRCX and INTC",
        "created_utc": 1617652855,
        "id": "gtho23m",
        "permalink": "/r/stocks/comments/mkgpbr/rstocks_daily_discussion_monday_apr_05_2021/gtho23m/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617681655.0
    },
    {
        "author": "Pat_riot88",
        "body": "I have TSM,ASML,AMAT,LRCX,AMD,INTC, MU,  All pretty solid.  I plan to hold for years.  These are the main components for the future.",
        "created_utc": 1617669705,
        "id": "gtimhpu",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gtimhpu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617698505.0
    },
    {
        "author": "NateArcade",
        "body": "Add in AMAT and LRCX and you've got a great manufacturer-agnostic trio.",
        "created_utc": 1617646950,
        "id": "gthb5q3",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gthb5q3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617675750.0
    },
    {
        "author": "JayArlington",
        "body": "For any interested in semiconductors, know that the industry is comprised of the following:\n\n-Integrated Chip manufacturers (both design and produce chips): Intel\n\n-Outsource Chip manufacturers (produce chips designed by others): TSMC, Samsung\n\n-Dedicated Chip Designers (design chips but let others manufacture them): Nvdia, AMD, Qualcomm \n\n-Semiconductor Equipment Manufacturers (design the equipment and services used to produce chips): ASML, Lam Research, Applied Materials\n\nFor the next year or so, I bet the Equipment Manufacturers are the ones that do the best.",
        "created_utc": 1617636217,
        "id": "gtgncbj",
        "permalink": "/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/gtgncbj/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617665017.0
    },
    {
        "author": "Amazing_Succotash677",
        "body": "LRCX",
        "created_utc": 1617657009,
        "id": "gthx470",
        "permalink": "/r/stocks/comments/mkgvvq/best_stocks_for_bidens_infrastructure_plan/gthx470/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617685809.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "Pretty much copying you but I would say Goog AMZN FB MSFT. I’d also say semis as a whole Soxx (index) for individual companies Amat/lrcx ran a lot recently but I see solid growth coming for quite awhile.",
        "created_utc": 1617729507,
        "id": "gtla5yu",
        "permalink": "/r/stocks/comments/mlbjdv/what_are_your_highest_conviction_picks/gtla5yu/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617758307.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "Calls on calls. Semis look juicy. Wish I had more LRCX.",
        "created_utc": 1617627675,
        "id": "gtg6kke",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gtg6kke/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617656475.0
    },
    {
        "author": "makaros622",
        "body": "I hold AMD and LRCX. I like AMAT and TSM 👍",
        "created_utc": 1617574433,
        "id": "gte38ds",
        "permalink": "/r/stocks/comments/mjrul6/long_term_stocks/gte38ds/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617603233.0
    },
    {
        "author": "makaros622",
        "body": "Also **Lam research** !!!!",
        "created_utc": 1617546370,
        "id": "gtclf8p",
        "permalink": "/r/stocks/comments/mjrul6/long_term_stocks/gtclf8p/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617575170.0
    },
    {
        "author": "makaros622",
        "body": "no AMD ? no lam research? why? why only DQ ?",
        "created_utc": 1617547395,
        "id": "gtcn980",
        "permalink": "/r/stocks/comments/mjrul6/long_term_stocks/gtcn980/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617576195.0
    },
    {
        "author": "TheDevilintheDark",
        "body": "LRCX is printing",
        "created_utc": 1617307762,
        "id": "gt2hmnt",
        "permalink": "/r/wallstreetbets/comments/mi3nbf/what_are_your_moves_tomorrow_april_02_2021/gt2hmnt/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617336562.0
    },
    {
        "author": "ScarletHark",
        "body": "I work in the semi industry and I've been in and out of AMAT positions the past couple of months. TSM, Samsung and INTC have near-term headwinds in terms of earnings based on semiconductor demand simply because it takes so long to expand capacity. The front-end winners in current semi production efforts are going to be those who supply the tools, products and services that go into these fabs that are planned for construction: AMAT, ASML, TER, LRCX, to name a few. Secondary effects on earnings from this will come 1-2-3 years down the line for the semi manufacturers themselves, depending on whether or not they are expanding/upgrading an existing facility, or building one from the ground up.\n\nThe end-users of these semiconductor products (GM, F, NVDA, AMD, etc.) will be the last ones to benefit from expanded chipmaking capacity, as easing the demand crunch allows them to resume normal sales levels. Note that for auto mfrs, this has a ripple effect on rental car companies, who sold all of their fleets in fire sales last year and now can't replace them because the auto mfrs can't make cars.\n\nAdditionally, TSMC is booked up for the foreseeable future; these bookings have prices agreed well in advance, and are almost certainly not subject to TSMC's recent statements that they plan to increase prices; that will happen with new bookings down the line.",
        "created_utc": 1617325086,
        "id": "gt3fbzb",
        "permalink": "/r/options/comments/mh99ky/anyone_have_any_options_on_tsm/gt3fbzb/",
        "score": 1,
        "subreddit": "options",
        "created": 1617353886.0
    },
    {
        "author": "ThisPomelo4",
        "body": "Your analysis is probably true for delta, but the problem with playing those names using vol is that the IV is higher. Options trading is most useful when you get the gamma cheap while also calling the direction right.\n\nI'm buying INTC 23Apr 70c because resistance at 65 has kept IV muted. My bet is that INTC will break through that resistance on 6Apr or 23Apr. I hate talking in terms of resistance in general, but looking at the long-term chart as well as price action in the morning after the Intel Unleashed event, it certainly seems like you'd need a big catalyst to justify a breakout beyond 65. I'd probably play those profits -- if any -- into AMD puts through to May, because I think hedge fund selling will take place when Lisa Su inevitably acknowledges the incorrectness of her prediction that supply \"tightness\" would clear up by 2H21.\n\nI also believe that the Archegos liquidation is another sign that correlated hedge fund losses will spell disaster for the market. We saw this already with GME and the other short-squeeze names. Chipmakers like to lay out their capex as close to production ramp-up as possible, which means that LRCX/AMAT/ASML/KLIC/KLAC/CAJ/etc won't book profits immediately even if billions of dollars are allocated to the roadmap. So I'm waiting for a big selloff this summer to get into those names as a long-term position. May try to play that selloff using hedgie favorites and names that have a lot of room to fall. ARKK, TSLA, TSM, NVDA come to mind. TSM seems counterintuitive but you get the added potential catalyst of Chinese brinkmanship as well as a deepening of the water supply woes.\n\nI mention CAJ because it gives a good read on DUV demand. Their equipment segment had a lot of profit growth last quarter. But it's not as good a play as the others because only a fifth of its revenue comes from that segment.",
        "created_utc": 1617331929,
        "id": "gt3qzmp",
        "permalink": "/r/options/comments/mi9kxb/playing_the_semiconductor_shortage/gt3qzmp/",
        "score": 1,
        "subreddit": "options",
        "created": 1617360729.0
    },
    {
        "author": "lohith15",
        "body": "Lots of luck \n\nAMD was a purely yolo - relying on Nasdaq bounce back \n\nLRCX I was just a bit more confident . Semi conductors have been doing well and they really got fucked during nasdaq red . Trusted them to bounce back rapidly.",
        "created_utc": 1617375609,
        "id": "gt5aa7l",
        "permalink": "/r/wallstreetbets/comments/mi3gog/after_a_long_time_10x_and_8x_on_the_same_day/gt5aa7l/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617404409.0
    },
    {
        "author": "Craino",
        "body": " TL:DR - looking for feedback on a simple hi return stock screen and thoughts on how to rank results.\n\nEarly 60's, simple, diversified, buy and hold retirement portfolio approach my whole life. Looking at working probably another 5-10 years and starting to get a lot more active in my portfolio. Nothing crazy and I'm fundamentally a conservative+ investor, but I do not subscribe to moving 100% into ultra safe right before retirement. Portfolio size is low 7 figure for reference.\n\nOver the past few months I subscribed to a couple of authors on Seeking Alpha and have tried out a few strategies with minimal exposure and have a good idea of how to use some of the approaches in my portfolio. I want to develop my own screens because at least on Seeking Alpha, the authors I've found charge a small monthly fee for their updates. It's nothing huge, and for me at least has been worth seeing their approaches, but nothing I want to pay for the rest of my life.\n\nI'm going to put together a dividend screen/strategy and a \"better than cash\" parking lot strategy. Pretty basic and straightforward. I also just got started on putting together a screen to identify a more hi growth strategy - thought being on a monthly basis invest in the top 4 stocks that fall out of the screen. Would love some feedback on the screen (I'm stock knowledgeable, but certainly not an expert). When looking at the screen and giving feedback keep in mind my objective: not looking for the perfect approach or for mega returns, I'm an 80/20 kinda guy so looking for a decent, simple to execute strategy to reliably give back a growth-class return. (And using the Fidelity screener as that's where my portfolio is).\n\nScreen as it stand currently:\n\n* Tagging Energy, Health Care, Financials, Information Technology and Industrials sectors\n* Market cap down to Medium (as defined by Fidelity: 6-33B)\n* 13 week price performance down to 13%\n* 3 yr annualized Beta of 1.1 and up (conflicted on whether this really helps the screen)\n* Very Bullish or Bullish analyst recommendations (Summary score from StarMine)\n* Forward EPS 3-5 yrs high to very high (16.5% and up)\n* EPS growth Projected year versus last year high to very high (40% and up)\n\nAs an example, running that screen today resulted in a list of 7 stocks (sorry not allowed to link image or would give you a shot of the fundamentals):\n\n1. AMAT - Applied materials\n2. FANG - Diamondback Energy\n3. EOG - EOG Resources\n4. NXPI - NXP SemiConductor\n5. KKR - KKR &amp; Co\n6. LRCX - LAM Research Corp\n7. MU - Micron Technology\n\nSo the thought would be to run this first day of every month and put a set amount in the top 4 stocks in the filter. I would guess some stocks might stay in for months, some might rotate in and out quickly.\n\nMy question is basically around how to rank. So do I just pick a screening metric (or some other metric) and do a simple rank on that metric to determine top 4, or do I create a formula to weight and aggregate multiple metrics into an overall score and rank on that?\n\nSorry for the long post - thank you to those who stuck with it and are willing to share your thoughts.",
        "created_utc": 1617376794,
        "id": "gt5cmwk",
        "permalink": "/r/investing/comments/migerh/daily_advice_thread_all_basic_help_or_advice/gt5cmwk/",
        "score": 1,
        "subreddit": "investing",
        "created": 1617405594.0
    },
    {
        "author": "K1nd0fab1gdeal",
        "body": "While I do agree that TSM with the amount of production they have is a great play I wonder are you concerned about the PRC there? I bought shares in LRCX, AMAT and MU a few months back and thought they were kind of a “picks and shovels” play.",
        "created_utc": 1617388393,
        "id": "gt6013h",
        "permalink": "/r/options/comments/mi9kxb/playing_the_semiconductor_shortage/gt6013h/",
        "score": 1,
        "subreddit": "options",
        "created": 1617417193.0
    },
    {
        "author": "Jyalecal",
        "body": "Buying LRCX 5/21 650’s this Friday",
        "created_utc": 1618972541,
        "id": "gva49dw",
        "permalink": "/r/wallstreetbets/comments/muyz0m/what_are_your_moves_tomorrow_april_21_2021/gva49dw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619001341.0
    },
    {
        "author": "surmoiFire",
        "body": "LRCX earnings beat, AH flats , this market is so rigged",
        "created_utc": 1619037803,
        "id": "gvd8ruc",
        "permalink": "/r/wallstreetbets/comments/mvo1tm/what_are_your_moves_tomorrow_april_22_2021/gvd8ruc/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619066603.0
    },
    {
        "author": "Amazing_Succotash677",
        "body": "Nvidia, qualcomm, micron, lam research, and p&amp;g",
        "created_utc": 1618782616,
        "id": "gv0i42r",
        "permalink": "/r/stocks/comments/mt7gsz/what_were_the_top_5_stock_picks_for_next_5_years/gv0i42r/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618811416.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 20th of April\n\n\n\n## Upcoming events for Tuesday, April 20th\n\n - Stock splits:\n\n    - VONG @ **4:1** (Payable date: 04/19/2021)\n    - VONV @ **2:1** (Payable date: 04/19/2021)\n    - VTWO @ **2:1** (Payable date: 04/19/2021)\n\n - Expected earnings:\n\n  ABT, AN, ASRV, BFIN, BMI, CIT, CMA, CSX, DOV, EBSB, EDU, EQBK, EW, FCBP, FITB, FMBI, FOR, FULT, GATX, GRFS, HNP, HOG, HTLD, HWC, IBKR, IRDM, ISRG, JNJ, KEY, LMT, LRN, MAN, MBWM, MLI, MNSB, NCBS, NFLX, NTRS, OMC, ORRF, PACW, PCAR, PEBO, PFBC, PFC, PG, PKBK, PM, PTSI, PZN, SFNC, SI, SMBK, SMIT, SNV, TFII, THC, TRV, UCBI, WBS, WRB, XRX\n\n - Ex-div:\n\n  CL, CLX, CMTL, EGBN, GBX, LEN, LEN.B, LOW, PCF, RMBI, SUNS, WST, ZTS\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.070%)\n    - API Weekly Crude Oil Stock (previous: -3.608M)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.2%)\n\n## Upcoming events for Wednesday, April 21st\n\n - Expected earnings:\n\n  ANTM, ASML, BANR, BDN, BEDU, BKR, BOKF, BXS, CACI, CATC, CCI, CHDN, CLB, CMG, CNS, CP, CPSS, CSV, CVBF, CVCY, DFS, EFX, EGBN, ERIC, FCFS, FHN, FR, GGG, GL, GSBC, HAL, HBMD, HCSG, INBK, KMI, KNX, LAD, LOB, LRCX, LSTR, LVS, MMLP, NDAQ, NEE, NEP, NEU, NTGR, NWE, OFG, PLBC, PLXS, RCI, REXR, RHI, RLI, RUSHA, RUSHB, SBNY, SEIC, SLG, SLM, SNBR, STC, STL, STRM, STXB, TBK, TCBI, TEL, TRST, TSC, UBFO, UFPI, UMPQ, UNB, USAP, VMI, VZ, WASH, WHR, XM\n\n - Ex-div:\n\n  AGX, APA, BGH, CFBK, DX, FUL, LTC\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.920%)\n    - Crude Oil Imports (previous: 0.443M)\n    - Crude Oil Inventories (consensus: -2.860M, previous: -5.889M)\n    - Cushing Crude Oil Inventories (previous: 0.346M)\n    - Distillate Fuel Production (previous: 0.004M)\n    - EIA Refinery Crude Runs  (previous: 0.007M)\n    - EIA Weekly Distillates Stocks (consensus: -0.898M, previous: -2.083M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.7%, previous: 1.0%)\n    - Gasoline Inventories (consensus: 0.650M, previous: 0.309M)\n    - Gasoline Production (previous: 0.336M)\n    - Heating Oil Stockpiles (previous: -0.028M)\n    - MBA 30-Year Mortgage Rate (previous: 3.27%)\n    - MBA Mortgage Applications (previous: -3.7%)\n    - MBA Purchase Index (previous: 279.5)\n    - Mortgage Market Index (previous: 667.7)\n    - Mortgage Refinance Index (previous: 2,916.7)\n\n## Upcoming events for Thursday, April 22nd\n\n - Expected earnings:\n\n  AAL, ABCB, ACBI, AEP, AFI, ALK, ALLE, AMAL, AMNB, ARCH, ARD, ARI, ASB, ASR, AUB, BANC, BIIB, BJRI, BKU, BMTC, BOOM, BPRN, BX, CADE, CAJ, CAMP, CASS, CCBG, CE, CFB, CFFI, CLF, CLFD, CS, CSL, CSTR, CTS, CVLY, CYBE, DGX, DHI, DHR, DOW, EIG, EWBC, FAF, FBIZ, FBRX, FCX, FE, FFBC, FFIN, FRME, FVCB, GBCI, GFED, GPC, GRC, GTLS, HBAN, HCA, HFWA, HRI, HTBK, HTH, HZO, ICBK, IIIN, INDB, INDT, INTC, IQV, ISTR, KB, KN, LUV, LYTS, MAT, MBIN, MCBC, MKTX, MNOV, MSBI, MYFW, NBHC, NUE, NURO, NVR, NWFL, ODFL, OPBK, ORI, OZK, PBCT, PDS, PINE, PNR, POOL, PSTV, PWOD, RBCAA, RBNC, RNGR, RS, SAFE, SAM, SAP, SASR, SBCF, SBFG, SCKT, SITC, SIVB, SKX, SNA, SNAP, SON, SRCE, STBA, STRT, STX, T, TAL, TPH, TRN, TSCO, TZOO, UNP, USX, UTMD, VICR, VLO, VLRS, VRSN, WNS, WSFS, WSO, WSO.B, WWE\n\n - Ex-div:\n\n  ACP, AGD, AOD, ASGI, AWP, BGB, BGX, BSAC, BSL, BUSE, BWG, COKE, CVS, DEX, DFP, DMO, EFF, EFR, EFT, EHI, EMD, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EVG, EVT, EXD, EXG, FFC, FLC, FMN, GAIN, GDO, GLAD, GOOD, HFRO, HGLB, HIE, HIO, HIX, HYI, IGI, KALU, LAND, LKFN, MGU, MMU, NHF, NVT, PFD, PG, PNR, PPT, SBI, SCD, SM, TPZ, USA, WEA, WIA, WIW, WSM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.010%)\n    - 5-Year TIPS Auction (previous: -1.320%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Chicago Fed National Activity (previous: -1.09)\n    - Continuing Jobless Claims (consensus: 3,667K, previous: 3,731K)\n    - Existing Home Sales (consensus: 0.8%, previous: -6.6%)\n    - Existing Home Sales (consensus: 6.19M, previous: 6.22M)\n    - Initial Jobless Claims (consensus: 617K, previous: 576K)\n    - Jobless Claims 4-Week Avg. (previous: 683.00K)\n    - KC Fed Composite Index (previous: 26)\n    - KC Fed Manufacturing Index (previous: 23)\n    - Natural Gas Storage (previous: 61B)\n    - US Leading Index (consensus: 1.0%, previous: 0.2%)\n\n## Upcoming events for Friday, April 23rd\n\n - Expected earnings:\n\n  ALV, AROW, AXP, AZZ, BCML, BOTJ, BRID, CBAN, CIVB, CIZN, CWBC, E, ESQ, ESXB, FHB, FMAO, FSBW, GCBC, GNTX, HON, KMB, LFC, LSBK, MCBS, MOG.A, MOG.B, PFIS, RF, SBSI, SLB, SXT\n\n - Ex-div:\n\n  ACI, CAT, CE, DHC, FAST, ILPT, OKE, OPI, RMR, RMRM, SLP, SVC, TRMT, USAC\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.4K)\n    - CFTC Copper speculative net positions (previous: 36.0K)\n    - CFTC Corn speculative net positions (previous: 543.3K)\n    - CFTC Crude Oil speculative net positions (previous: 492.7K)\n    - CFTC Gold speculative net positions (previous: 180.9K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -6.1K)\n    - CFTC Natural Gas speculative net positions (previous: -51.3K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -40.1K)\n    - CFTC Silver speculative net positions (previous: 36.4K)\n    - CFTC Soybeans speculative net positions (previous: 224.0K)\n    - CFTC Wheat speculative net positions (previous: 5.5K)\n    - Manufacturing PMI (consensus: 60.5, previous: 59.1)\n    - Markit Composite PMI (previous: 59.7)\n    - New Home Sales (consensus: 12.8%, previous: -18.2%)\n    - New Home Sales (consensus: 886K, previous: 775K)\n    - Services PMI (consensus: 61.9, previous: 60.4)\n    - U.S. Baker Hughes Oil Rig Count (previous: 337)\n    - U.S. Baker Hughes Total Rig Count (previous: 432)\n\n^^^^2021-04-20",
        "created_utc": 1618912816,
        "id": "gv6o88o",
        "permalink": "/r/RobinHood/comments/mumzid/daily_discussion_thread_april_20th_2021/gv6o88o/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1618941616.0
    },
    {
        "author": "someoneUnreadable",
        "body": "I will do some more digging into LRCX nice I get home!\n\nLove the way the daily chart looks so far.",
        "created_utc": 1618871850,
        "id": "gv4y3q8",
        "permalink": "/r/stocks/comments/mu3hqz/looking_at_amat_today/gv4y3q8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618900650.0
    },
    {
        "author": "zanif",
        "body": "Damn I chose to play LRCX instead of WHR 🤡",
        "created_utc": 1619035974,
        "id": "gvd4hs3",
        "permalink": "/r/wallstreetbets/comments/mvo1tm/what_are_your_moves_tomorrow_april_22_2021/gvd4hs3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619064774.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "LAM (LRCX) dayum good quarter.",
        "created_utc": 1619035871,
        "id": "gvd4988",
        "permalink": "/r/wallstreetbets/comments/mvcct1/daily_discussion_thread_for_april_21_2021/gvd4988/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619064671.0
    },
    {
        "author": "NateArcade",
        "body": "Add AMAT and LRCX to that for a great trio. They also provide chip manufacturing equipment.",
        "created_utc": 1619191028,
        "id": "gvkpivw",
        "permalink": "/r/stocks/comments/mwrgv5/rstocks_daily_discussion_fundamentals_friday_apr/gvkpivw/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619219828.0
    },
    {
        "author": "LoquatSeparate",
        "body": "Yeah except only one or two companies, namely TSM and INTC, can afford their machines. Get broader exposure with AMAT and LRCX.",
        "created_utc": 1618683213,
        "id": "guvre9g",
        "permalink": "/r/stocks/comments/msl1js/alternative_semiconductor_stocks/guvre9g/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618712013.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT PYPL UNH AAPL LRCX",
        "created_utc": 1618686425,
        "id": "guvxyz8",
        "permalink": "/r/ValueInvesting/comments/msiud7/5_companies_to_setandforget_hold_for_10_years/guvxyz8/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1618715225.0
    },
    {
        "author": "blueberry__wine",
        "body": "I would stay away from them for the next while. Drought in Taiwan makes it volatile for their industry. Just go with LRCX or NVDA or ASML",
        "created_utc": 1619826932,
        "id": "gwhiqfb",
        "permalink": "/r/CanadianInvestor/comments/n1jtd1/global_chip_shortage_crushing_auto_stocks/gwhiqfb/",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1619855732.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "I'll have another please. AMD needs to keep going though. I own - LRCX, QRVO, AMD, NVDA, Ter",
        "created_utc": 1619491780,
        "id": "gw0as64",
        "permalink": "/r/wallstreetbets/comments/mz6iks/what_are_your_moves_tomorrow_april_27_2021/gw0as64/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619520580.0
    },
    {
        "author": "wbnext",
        "body": "Don’t mean not knowing ASML or LRCX, just not into semi equipment companies. More on companies like TSMC, etc. that uses their equipments.",
        "created_utc": 1619291607,
        "id": "gvqmt0r",
        "permalink": "/r/stocks/comments/mv4s98/im_making_my_entire_portfolio_msft_and_aapl_where/gvqmt0r/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619320407.0
    },
    {
        "author": "apooroldinvestor",
        "body": "As is LRCX.  I just divide between the two in my ROTH.",
        "created_utc": 1619298167,
        "id": "gvqzpv7",
        "permalink": "/r/stocks/comments/mv4s98/im_making_my_entire_portfolio_msft_and_aapl_where/gvqzpv7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619326967.0
    },
    {
        "author": "beesemode",
        "body": "Yes, TSMC, Intel, Micron, etc all buy Equipment from Amat, LRCX, KLA, etc. You literally cannot make a chip without equipment from Amat and LRCX. Anytime a fab is built, equipment is bought from those companies. Hope that helps",
        "created_utc": 1617295444,
        "id": "gt1qm4o",
        "permalink": "/r/stocks/comments/m1orcz/does_tsmc_rely_on_lrcx_amat_klac_etc/gt1qm4o/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617324244.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "AMAT and LRCX are the real winners here.",
        "created_utc": 1617469378,
        "id": "gt9eysf",
        "permalink": "/r/wallstreetbets/comments/mikm42/i_built_a_program_that_tracks_mentions_and/gt9eysf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617498178.0
    },
    {
        "author": "Beagleoverlord33",
        "body": "What’s your time frame and risk appetite? With no information it’s hard to say but the FANG+Msft are still probably your best bet imo. Also a big fan of semis you could get an index or branch into individual names I personally own Amat lrcx qcom and Amd but there’s lots of good choices.",
        "created_utc": 1617545541,
        "id": "gtcjyzi",
        "permalink": "/r/stocks/comments/mjvkhh/looking_to_invest_25005000_into_the_market/gtcjyzi/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617574341.0
    },
    {
        "author": "kkInkr",
        "body": "There are bunch of chip companies, why just focus on AMD, NVDA, INTC, TSM.\n\nADI, AMAT, ASML, ATEYY, AVGO, KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI, QCOM, QRVO, SIMO, SWKS, TER.\n\nThere's also some small ones: Pixelworks, Himax.\n\nThere's also the design part: CDNS, SNPS.",
        "created_utc": 1617547643,
        "id": "gtcnpap",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcnpap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617576443.0
    },
    {
        "author": "GearheadGaming",
        "body": "Serious answer though, I'm not big on fabless semi companies, and at current valuations Himax is a little pricey, even for a semi.\n\n[Full disclosure, I sold my TSM at $124, and all I've got left in it at the moment is some call spreads](https://imgur.com/a/1NTT3Ag)\n\nI much prefer pure play foundry's, integrated companies, or front-end equipment makers.  That means TSM, INTC, MU, TSEM, Samsung, and TXN as your semi stocks, ASML, AMAT, KLAC, LRCX as your front end capital guys.  I also like AMKR and ICHR, even though they aren't technically on the front end side of things, and maybe 3-6 months from now I'll perk up on companies like KLIC.\n\nI'm not big on HIMAX's short term prospects, because I think the semi shortage will hurt them as much as help them, and I'm not big on their long-term prospects because I think it's only a matter of time before a bigger fabless company acquires one of Himax's direct competitors.",
        "created_utc": 1617548106,
        "id": "gtcokeu",
        "permalink": "/r/wallstreetbets/comments/mjwtjr/buyyyyy_himx_to_the_mar/gtcokeu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617576906.0
    },
    {
        "author": "third_legatron",
        "body": "Lol right? It already went up 500%, means it'll keep that pace forever. \n\nI think the one speculative stock I like that I purchased recently was lam research, I aim to hold that for years though. Other than that I'm bullish on banks, I picked em all up early March 2020 so I'm already doing well on them. Goldman Sachs I really liked  last year, it's growth is priced in, if it doesn't keep it's pace the share price will likely falter. \n\nI like Cigna a whole lot right now, as well as vertex pharmaceuticals. I do not own vertex, I sold last year. but I would like to own it again at some point, I've been buying cigna more recently. \n\nGE is my favorite, I've been playing it last year with leaps and 3-6 month calls and decided that I should finally buy some shares with all the sweet gains it has given me. \n\nConstellations and altria I like a lot because it's safe marijuana exposure without the pump and dumps. Also altrias dividend is nice although I don't view it as a value stock, I may have to trim that one down as I see it getting close to overvalued. \n\nAPD is a great stock, good green hydrogen and commodity play. More low-key and a boring slow mover but I see in the next 5 years it doing very well.",
        "created_utc": 1618691201,
        "id": "guwawi6",
        "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/guwawi6/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618720001.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Right but certain stocks have beat the market for many years.  Idxx lrcx msft aapl nvda hd unh etc.",
        "created_utc": 1618691696,
        "id": "guwcdfj",
        "permalink": "/r/stocks/comments/msxaqr/what_criteria_do_you_use_to_justify_buying_a/guwcdfj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618720496.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Why not MSFT?  ASML LRCX UNH HD?  And I wouldn't day trade.  You won't win in the long run.\n\nYou could just But QQQ.\n\n  But whatever floats your boat.",
        "created_utc": 1619497879,
        "id": "gw0kq9w",
        "permalink": "/r/ValueInvesting/comments/mzd5rf/spliting_5000_into_aapl_and_goog_long/gw0kq9w/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1619526679.0
    },
    {
        "author": "NateArcade",
        "body": "If you like AMAT, pick up LRCX. Those two have nearly half of the market between them.",
        "created_utc": 1617604950,
        "id": "gtffku1",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gtffku1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617633750.0
    },
    {
        "author": "bluffff",
        "body": "Larry Kurds says Biden wants to give semis 100 mill. Good for Mu. AMAT. LRCX. \n\n&amp;#x200B;\n\nBoom goes the dynamite",
        "created_utc": 1619037642,
        "id": "gvd8dyz",
        "permalink": "/r/wallstreetbets/comments/mvo1tm/what_are_your_moves_tomorrow_april_22_2021/gvd8dyz/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619066442.0
    },
    {
        "author": "bropafenone",
        "body": "I like Lam Research personally.",
        "created_utc": 1619188017,
        "id": "gvkink3",
        "permalink": "/r/stocks/comments/mwrgv5/rstocks_daily_discussion_fundamentals_friday_apr/gvkink3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619216817.0
    },
    {
        "author": "TheMailmanic",
        "body": "I think at this point you have to look at ntm EPS growth... companies with solid growth will likely see the returns follow suit.   Some multiple compression is possible as interest rates rise but the underlying business is solid in many of these names (tsm, klac, asml, lrcx, nvda, amd, etc)",
        "created_utc": 1618875856,
        "id": "gv565dr",
        "permalink": "/r/investing/comments/mu454g/future_outlook_for_semiconductor_manufacturing/gv565dr/",
        "score": 1,
        "subreddit": "investing",
        "created": 1618904656.0
    },
    {
        "author": "mr_baloo",
        "body": "Thoughts on Lam Research ($LRCX)?  They have earnings after hours on Wed. \n\nAmongst the chip-makers/suppliers, they have one of the lower P/E's (32x) and performance in the past 2 weeks has been pretty weak (*usually a good sign for earnings for strong companies*).  The expectations are high though.  I would love to get in on the $620C for this friday at around $19",
        "created_utc": 1618883757,
        "id": "gv5ll7n",
        "permalink": "/r/options/comments/msp4is/most_anticipated_earnings_releases_for_the_week/gv5ll7n/",
        "score": 1,
        "subreddit": "options",
        "created": 1618912557.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 19th of April\n\n\n\n## Upcoming events for Monday, April 19th\n\n - Stock splits:\n\n    - BBD @ **110:100** (Payable date: 04/27/2021)\n    - BBDO @ **110:100** (Payable date: 04/27/2021)\n    - ILCV @ **2:1** (Payable date: 04/16/2021)\n    - ILCB @ **4:1** (Payable date: 04/16/2021)\n    - ILCG @ **5:1** (Payable date: 04/16/2021)\n    - IMCB @ **4:1** (Payable date: 04/16/2021)\n    - IMCG @ **6:1** (Payable date: 04/16/2021)\n    - IMCV @ **3:1** (Payable date: 04/16/2021)\n    - ISCB @ **4:1** (Payable date: 04/16/2021)\n    - ISCG @ **6:1** (Payable date: 04/16/2021)\n    - ISCV @ **3:1** (Payable date: 04/16/2021)\n    - MONOY @ **2:1** (Payable date: 04/16/2021)\n\n - Expected earnings:\n\n  ACC, ACU, BMRC, BSRR, CCK, CCNE, DIT, EBF, ELS, FNB, GNTY, HMNF, HXL, IBM, KO, LCNB, MCB, MSB, MTB, ONB, PEBK, PLD, PNFP, SFBS, STLD, UAL, WTFC, ZION\n\n - Ex-div:\n\n  ATCO, CIVB, CMRE, DMB, HRZN, IGR, THQ, THW, VCIF\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.020%)\n    - 6-Month Bill Auction (previous: 0.040%)\n    - Investing.com Gold Index (actual: 48.9%, previous: 56.4%)\n    - Investing.com S&amp;P 500 Index (actual: 39.6%, previous: 40.2%)\n\n## Upcoming events for Tuesday, April 20th\n\n - Stock splits:\n\n    - VONG @ **4:1** (Payable date: 04/19/2021)\n    - VONV @ **2:1** (Payable date: 04/19/2021)\n    - VTWO @ **2:1** (Payable date: 04/19/2021)\n\n - Expected earnings:\n\n  ABT, AN, ASRV, BFIN, BMI, CIT, CMA, CSX, CTG, DOV, EBSB, EDU, EQBK, EW, FCBP, FITB, FMBI, FOR, FULT, GATX, GRFS, HNP, HOG, HTLD, HWC, IBKR, IRDM, ISRG, JNJ, KEY, LMT, LRN, MAN, MBWM, MLI, MNSB, NCBS, NFLX, NTRS, OMC, ORRF, PACW, PCAR, PEBO, PFBC, PFC, PG, PKBK, PM, PTSI, PZN, SFNC, SI, SMBK, SMIT, SNV, TER, TFII, THC, TRV, UCBI, WBS, WRB, XRX\n\n - Ex-div:\n\n  CL, CLX, CMTL, EGBN, GBX, LEN, LEN.B, LOW, PCF, RMBI, SUNS, WST, ZTS\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.070%)\n    - API Weekly Crude Oil Stock (previous: -3.608M)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.2%)\n\n## Upcoming events for Wednesday, April 21st\n\n - Expected earnings:\n\n  ANTM, ASML, BANR, BDN, BEDU, BKR, BLX, BOKF, BXS, CACI, CATC, CCI, CHDN, CLB, CMG, CNS, CP, CPSS, CVBF, CVCY, DFS, EFX, EGBN, ERIC, FCFS, FHN, FR, GGG, GL, GSBC, HAL, HBMD, HCSG, INBK, KMI, KNX, LAD, LOB, LRCX, LSTR, LVS, MMLP, NDAQ, NEE, NEP, NEU, NTGR, NWE, OFG, PLBC, PLXS, RCI, REXR, RHI, RLI, RUSHA, RUSHB, SEIC, SLG, SLM, SNBR, STC, STL, STRM, STXB, TBK, TCBI, TEL, TRST, TSC, UBFO, UFPI, UMPQ, UNB, USAP, VMI, VZ, WASH, WHR, XM\n\n - Ex-div:\n\n  AGX, APA, BGH, CFBK, DX, FUL, LTC\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 1.920%)\n    - Crude Oil Imports (previous: 0.443M)\n    - Crude Oil Inventories (previous: -5.889M)\n    - Cushing Crude Oil Inventories (previous: 0.346M)\n    - Distillate Fuel Production (previous: 0.004M)\n    - EIA Refinery Crude Runs  (previous: 0.007M)\n    - EIA Weekly Distillates Stocks (previous: -2.083M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.4%, previous: 1.0%)\n    - Gasoline Inventories (previous: 0.309M)\n    - Gasoline Production (previous: 0.336M)\n    - Heating Oil Stockpiles (previous: -0.028M)\n    - MBA 30-Year Mortgage Rate (previous: 3.27%)\n    - MBA Mortgage Applications (previous: -3.7%)\n    - MBA Purchase Index (previous: 279.5)\n    - Mortgage Market Index (previous: 667.7)\n    - Mortgage Refinance Index (previous: 2,916.7)\n\n## Upcoming events for Thursday, April 22nd\n\n - Expected earnings:\n\n  AAL, ABCB, ACBI, AEP, AFI, ALK, ALLE, AMAL, AMNB, ARCH, ARD, ARI, ASB, ASR, AUB, BANC, BIIB, BJRI, BKU, BMTC, BOOM, BPRN, BX, CADE, CAJ, CAMP, CASS, CCBG, CE, CFB, CFFI, CLF, CLFD, CS, CSL, CSTR, CTS, CVLY, CYBE, DGX, DHI, DHR, DOW, EIG, EWBC, FAF, FBIZ, FBRX, FCX, FE, FFBC, FFIN, FRME, FVCB, GBCI, GFED, GPC, GRC, GTLS, HBAN, HCA, HFWA, HRI, HTBK, HTH, HZO, ICBK, IIIN, INDB, INDT, INTC, IQV, ISTR, KB, KN, LUV, LYTS, MAT, MBIN, MCBC, MKTX, MNOV, MSBI, MYFW, NBHC, NUE, NURO, NVR, NWFL, ODFL, OPBK, ORI, OZK, PBCT, PDS, PINE, PNR, POOL, PSTV, PWOD, RBCAA, RBNC, RNGR, RS, SAFE, SAM, SAP, SASR, SBCF, SBFG, SBNY, SCKT, SITC, SIVB, SKX, SNA, SNAP, SON, SRCE, STBA, STRT, STX, T, TAL, TPH, TRN, TSCO, TZOO, UNP, USX, UTMD, VICR, VLO, VLRS, VRSN, VVV, WNS, WSFS, WSO, WSO.B, WST, WWE\n\n - Ex-div:\n\n  ACP, AGD, AOD, ASGI, AWP, BGB, BGX, BSAC, BSL, BUSE, BWG, COKE, CVS, DEX, DFP, DMO, EFF, EFR, EFT, EHI, EMD, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EVG, EVT, EXD, EXG, FFC, FLC, FMN, GAIN, GDO, GLAD, GOOD, HFRO, HGLB, HIE, HIO, HIX, HYI, IGI, KALU, LAND, LKFN, MGU, MMU, NHF, NVT, PFD, PG, PNR, PPT, SBI, SCD, SM, TPZ, USA, WEA, WIA, WIW, WSM\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.010%)\n    - 5-Year TIPS Auction (previous: -1.320%)\n    - 8-Week Bill Auction (previous: 0.015%)\n    - Chicago Fed National Activity (previous: -1.09)\n    - Continuing Jobless Claims (consensus: 3,667K, previous: 3,731K)\n    - Existing Home Sales (consensus: 0.8%, previous: -6.6%)\n    - Existing Home Sales (consensus: 6.19M, previous: 6.22M)\n    - Initial Jobless Claims (consensus: 617K, previous: 576K)\n    - Jobless Claims 4-Week Avg. (previous: 683.00K)\n    - KC Fed Composite Index (previous: 26)\n    - KC Fed Manufacturing Index (previous: 23)\n    - Natural Gas Storage (previous: 61B)\n    - US Leading Index (consensus: 1.0%, previous: 0.2%)\n\n^^^^2021-04-19",
        "created_utc": 1618826420,
        "id": "gv2cdwb",
        "permalink": "/r/RobinHood/comments/mtxal5/daily_discussion_thread_april_19th_2021/gv2cdwb/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1618855220.0
    },
    {
        "author": "butteryhippo",
        "body": "About 1/3 of my “portfolio” going into 0dte otm calls on LRCX, NVDA, TSLA, and PLTR. End of day targets are 625, 560, 730, and 28 respectively. \n\n2nd quarter rotation back into tech + Pres. Buyden stimmy + Tesla shorts covered/out (?) + gamma squeezes + tingling in my bits = 🚀🚀🚀\n\nGood luck ladies n gents",
        "created_utc": 1617283722,
        "id": "gt11rh3",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt11rh3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617312522.0
    },
    {
        "author": "lohith15",
        "body": "Lots of luck I got . And yes gambling mainly on AMD\n\nAMD was a purely yolo - relying on Nasdaq bounce back\n\nLRCX I was just a bit more confident . Semi conductors have been doing well and they really got fucked during nasdaq red . Trusted them to bounce back rapidly.",
        "created_utc": 1617375653,
        "id": "gt5ad9i",
        "permalink": "/r/wallstreetbets/comments/mi3gog/after_a_long_time_10x_and_8x_on_the_same_day/gt5ad9i/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617404453.0
    },
    {
        "author": "mushlafa123",
        "body": "That was a hard and fast dip.  We're pretty far away from all the moving averages after the last 2 weeks. Gonna look to buy more around there.\n\nI don't own lrcx but I think it's undervalued compared to amat.",
        "created_utc": 1617732912,
        "id": "gtli017",
        "permalink": "/r/wallstreetbets/comments/ml86d3/daily_discussion_thread_for_april_06_2021/gtli017/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617761712.0
    },
    {
        "author": "JayArlington",
        "body": "/breathes a sigh of relief\n\nI appreciate everything you wrote and the perspective.  \n\nWith these three companies specifically (ASML, LRCX, AMAT) what made me feel comfortable in their ability to innovate is their consistent R&amp;D spend... especially with the fact that they generate more than enough cash to pay the hefty R&amp;D bills.",
        "created_utc": 1617667570,
        "id": "gtii99d",
        "permalink": "/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/gtii99d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617696370.0
    },
    {
        "author": "t33po",
        "body": "Interesting. All are up similar amounts in the last 90 days. Options look dicey but they look solid for long IRA-type plays. Thanks for the heads up.\n\nLAM is *LRCX",
        "created_utc": 1618381116,
        "id": "gugkw50",
        "permalink": "/r/wallstreetbets/comments/mqaa3x/what_are_your_moves_tomorrow_april_14_2021/gugkw50/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618409916.0
    },
    {
        "author": "apooroldinvestor",
        "body": "AAPL MSFT LRCX ASML PYPL SQ CRWD UNH HD UNP NVDA TSM .... To name a few.",
        "created_utc": 1617582193,
        "id": "gteh5jh",
        "permalink": "/r/stocks/comments/mjrul6/long_term_stocks/gteh5jh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617610993.0
    },
    {
        "author": "hmu5nt",
        "body": "LAM Research.",
        "created_utc": 1617628975,
        "id": "gtg8vn5",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gtg8vn5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617657775.0
    },
    {
        "author": "JayArlington",
        "body": "You can check my post history (sorted by date) and you will see my recent DD on ASML and on AMAT/LRCX.",
        "created_utc": 1617637839,
        "id": "gtgqytr",
        "permalink": "/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/gtgqytr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617666639.0
    },
    {
        "author": "NateArcade",
        "body": "Every portfolio that has AMAT should also have LRCX in my opinion",
        "created_utc": 1617605027,
        "id": "gtffo1a",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gtffo1a/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617633827.0
    },
    {
        "author": "jerryjones-is-smart",
        "body": "LAM Research $LRCX has jumped miles in the last week. Anyone else short term selling then jumping back in lower?",
        "created_utc": 1617644964,
        "id": "gth6sk7",
        "permalink": "/r/wallstreetbets/comments/mkh463/daily_discussion_thread_for_april_05_2021/gth6sk7/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617673764.0
    },
    {
        "author": "JhoLow_1MDB",
        "body": "TSM beat in their latest earnings. Of note is that TSM revised CAPEX upwards by about 20% for 2021.  Calls on semi equipment suppliers.  AMAT, KLAC, ASML, LRCX.  This is surprise spending.  ASML, AMD, and LRCX also report very soon.  Start of a potential run.",
        "created_utc": 1618483780,
        "id": "guladt2",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/guladt2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618512580.0
    },
    {
        "author": "wearahat03",
        "body": "TSM is down probably because revenue guidance is flat and margin guidance is down.\n\nCapex is up big but it's not going to generate revenue anytime soon.\n\nTSM is more a 2+ year play, as they said it's in 2023 is when they can offer more capacity and supply will be less tight.\n\nThe more immediate semi players and biggest winners this year are semiconductor materials (AMAT, ASML, LRCX and KLAC). They are getting their revenue boost sooner as TSMC, Samsung etc. add capacity.",
        "created_utc": 1618497199,
        "id": "gulx348",
        "permalink": "/r/stocks/comments/mrb95v/rstocks_daily_discussion_options_trading_thursday/gulx348/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618525999.0
    },
    {
        "author": "StalCair",
        "body": "I am not disputing the usefulness of semis. Only their recent movements. Last month most if not all semi stocks rebounded after earnings (over 100% for most since the march 2020 crash).\n\nNvidia 20% in 1 month.\n\nAMD 12% top 6% rn in one month.\n\nON 20% on the decline in one month.\n\nAVGO 20% in one month.\n\nTXN 20% in a month.\n\nMU 12% in a month.\n\nIntel 15% on the decline in one month.\n\nLRCX  30% on the decline in a month.\n\nTSMC is probably the stock that will tank the least due to its seat on the table of semis and the fact it wasn't overbought 5 weeks ago.",
        "created_utc": 1618487231,
        "id": "guleqxl",
        "permalink": "/r/wallstreetbets/comments/mr03qi/80k_amd_yolo_day_1_babydick_gains/guleqxl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618516031.0
    },
    {
        "author": "apooroldinvestor",
        "body": "IDXX LRCX MSFT SHW too name a few.",
        "created_utc": 1618756180,
        "id": "guyzmdy",
        "permalink": "/r/stocks/comments/msxaqr/what_criteria_do_you_use_to_justify_buying_a/guyzmdy/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618784980.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Is msft aapl hd unh lrcx going to return -50% while sp500 does well?  Don't think so.",
        "created_utc": 1618696646,
        "id": "guwmclw",
        "permalink": "/r/stocks/comments/msxaqr/what_criteria_do_you_use_to_justify_buying_a/guwmclw/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618725446.0
    },
    {
        "author": "NateArcade",
        "body": "AMAT and LRCX",
        "created_utc": 1619137293,
        "id": "gvidu37",
        "permalink": "/r/stocks/comments/mw1057/rstocks_daily_discussion_options_trading_thursday/gvidu37/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619166093.0
    },
    {
        "author": "third_legatron",
        "body": "I have a couple reits, I like the dividends to pay for my margin. short term I'm buying UVXY calls tomorrow to hedge a bit for the next couple weeks. Not a lot at all, but enough to compensate a bit if my port retraces a bit, I'd rather hold than sell right now.\n\nI'm not big on tech in my port, but I am bullish. I have about ~11% tech. I think the semiconductor stocks will be my largest holdings in that category moving forward. \n\nI hate crypto honestly, the function of it is all the same whether or not it's expensive. It's just whatever someone is willing to pay into it to hold it for an asset. I don't understand it the way I can read and understand a stock. But blockchain tech is a bit interesting, although I think practical use is far away.\n\nMy thesis for crypto will be to test it in a bear market, and see if it outperforms gold and metals. I have a feeling it might. But I wouldn't ever consider buying it now, it's lofty.\n\nI don't think we're IN a bubble, I think certain sectors are in a bubble, but I think for once, big tech is not part of that. I think crypto and the ev/autos may be in slightly lofty territory, but I think it's because people are excited for the next step of innovation. And SOME tech is relatively cheap for their growth prospects right now,(more so a couple weeks ago.) referencing my AMD and lam research picks. I think they always have room to pullback, but those are good buying opportunities in an industry that is only growing.",
        "created_utc": 1619585424,
        "id": "gw505r3",
        "permalink": "/r/stocks/comments/mzgodf/what_are_yall_bullish_on_these_days/gw505r3/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619614224.0
    },
    {
        "author": "sparrow13_x",
        "body": "What do you think of soxl? I find it strange how ASML and LRCX are so high while soxl and AMAT are so cheap? Am i not seeing something? are these undervalued or are the rest over valued?",
        "created_utc": 1617656814,
        "id": "gthwpbq",
        "permalink": "/r/wallstreetbets/comments/mkljmv/amd_increasing_production_by_20_in_q2_buy_before/gthwpbq/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1617685614.0
    },
    {
        "author": "zanif",
        "body": "LRCX 650c 4/23 ER LOTTO. lol this is probably not a good idea",
        "created_utc": 1619034991,
        "id": "gvd26v8",
        "permalink": "/r/wallstreetbets/comments/mvcct1/daily_discussion_thread_for_april_21_2021/gvd26v8/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1619063791.0
    }
]