[
    {
        "author": "livingmargaritaville",
        "body": "Texas instruments is probably a good bet not micro though.",
        "created_utc": 1614824108,
        "id": "gplvesm",
        "score": 9,
        "subreddit": "stocks",
        "created": 1614852908.0
    },
    {
        "author": "OlDurtMcGurt",
        "body": "By freind you mean your wife's boyfriend?\n\n&amp;#x200B;\n\nIt's a good move IMO as well as the rest of the companies you listed. I'm waiting on UMC to blast off and have been buying every time it dips more. What Im looking at is when Biden decides to try to ramp up semiconductor production in the USA to compete against China, who is going to get government grants and huge tax breaks? TXN? MU? AVGO? For the Automotive industry, who is the most important US company producing the specific semiconductors the car manufactures need?",
        "created_utc": 1614897107,
        "id": "gpph4s9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614925907.0
    },
    {
        "author": "Odinhawk",
        "body": "Thank you wallstreetbets. The moderators, the OG members, the high profile members (DFV), the new members who are as clueless as me, the new members who can only post emojis and have a vocab of five words, the bots, and even the hedge fund infiltrators... if there is such a thing.  \n\nThis is the ultimate game. Do your own research, listen to smart people, and get rid of any MSM opinions. You will do great.\n\nNo one cares, but my favorite game of all time is Drug Wars on my good ole TI-85 Texas Instruments calculator (fucking nerd). The basics of that game is the exact same as the stock market. Buy low, sell high, fuck the loan shark. Difference - you will lose real money, you might get arrested, and you could probably get mugged? \n\nI was always scared to jump in to the big leagues but after the first GME squeeze I decided why not throw fun money into stocks instead of busch light and other useless crap. So I started throwing money into stocks and busch light.\n\nJokes aside, I did quit drinking every night. Started working out. Got a damn haircut. Almost bought a bidet... but I'm an american who needs to see my waste on paper. I'm one line of stripper salt and a convertible Pontiac fiero away from doing this full time. Because of this great community.\n\nI've learned a lot over the last month or two. Not from the GME experts and emoji people, but from the OG's who have been to battle. GME will not last forever but that does not mean the money will dry up. Soak the useful info in. This is the difference between dying alone in your recliner while watching 'the office' reruns or dying at the ripe age of 85 in a horrific, power grid altering accident that involves your diamond encrusted lambo wrapped around a telephone pole. \n\nI fucking love you people. To Valhalla!\n\nTLDR: read first 6 paragraphs and then skip to the last line.",
        "created_utc": 1614831458,
        "id": "gpm9j60",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614860258.0
    },
    {
        "author": "soonseen",
        "body": "Texas instruments has the sexist graph ever. Change my mind.",
        "created_utc": 1614823986,
        "id": "gplv5ub",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1614852786.0
    },
    {
        "author": "Oases-dragon",
        "body": "Yeah, the best I could find was Silicon Labs. It has a P/E of 535, with 6.64B market cap.  I have a feeling Texas Instruments is going to be facing a lot of future competition, pretty soon.",
        "created_utc": 1614826342,
        "id": "gplzyst",
        "score": 4,
        "subreddit": "stocks",
        "created": 1614855142.0
    },
    {
        "author": "AdNo7052",
        "body": "My stonx:\n\nGME up\nGIS up\nGOOGL up\nMSFT down\nTMO down\nHVT down\nDHR down\nDECK down\nQRVO down\nTXN down\nHVO down \nAMAT down\nKLAC down\nFTEC down\n\nHate red... ;(",
        "created_utc": 1614887831,
        "id": "gpovq5c",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614916631.0
    },
    {
        "author": "DeathbyToast",
        "body": "Why not $TXN? Lines up with most of your DD (they also have their own fabs, including US based ones). And P/E is a more comfortable 29 right now. \n\nDo you think the whole industry will bump over the next few years?",
        "created_utc": 1614756426,
        "id": "gpifa2p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614785226.0
    },
    {
        "author": "PorcoRossoPerot",
        "body": "Is anyone else seeing this weird glitch in the matrix where like a bunch of major S&amp;P stocks that dumped today suddenly skyrocketed back to exactly 0.0% right at close and then fell again in AH? Or is this just some weird thing I'm not understanding.\n\nSeeing it on Amazon, Google, Netflix, Adobe, Broadcom, Texas Instruments, Pepsi. Am I having a stroke?",
        "created_utc": 1615243693,
        "id": "gq9kmfe",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1615272493.0
    },
    {
        "author": "krunkpunk",
        "body": "Can Texas Instrument TXN continue this year-long run? Or is it time for puts?",
        "created_utc": 1614829310,
        "id": "gpm5p6t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614858110.0
    },
    {
        "author": "soonseen",
        "body": "Aye, that Texas instruments chart is so nice though.",
        "created_utc": 1614823940,
        "id": "gplv2go",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614852740.0
    },
    {
        "author": "SeorgeGoros",
        "body": "I'm also curious as to what that's about. I see it a lot where it spikes to previous days close. Something to do with some kind of IOU or options? It's not just a Robinhood thing; I see it on Google as well looking at TXN for example",
        "created_utc": 1615246545,
        "id": "gq9q3ky",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1615275345.0
    },
    {
        "author": "milimiri",
        "body": "You might want to remove STX, AVGO, AAPL and etc. from the list, and add ASML, LRCX, MU and etc. to the list. \n\n\nI am working in semiconductor industry but not in fabrication. Basically the most fabs have been out of game for advanced technology nodes. For example, TXN has some fabs, but they are old technology (still a descent market especially for analog chips). MU has fabs but mainly for memory (memory and logic CMOS are different in manufacting). There are also markets for power semiconductor, optical sensors and etc. For advanced SoC chips, only major players left right now are TSM and INTC. Samsung is still in the game and SMIC is trying to catch up. But basically TSM takes the majority of the market. \n\nDisclosure: I have been holding TSM for a couple of years. I personally prefer fab+fabless and I am a little bearish on US-based fab. But I am not an expert in the field.",
        "created_utc": 1615222721,
        "id": "gq88ilq",
        "score": 2,
        "subreddit": "investing",
        "created": 1615251521.0
    },
    {
        "author": "SantasButhole",
        "body": "Txn is the better buy. They don’t have a shortage of semiconductors because they have furnaces in house. Source: family works at their biggest fab",
        "created_utc": 1614793609,
        "id": "gpk2ikt",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614822409.0
    },
    {
        "author": "Selivard",
        "body": "I personally stay out of crypto, probably to my own detriment at this point, but the volatility makes my skin crawl, and the threat of government regulation causing a huge swing is enough to scare me away. I invest like a boomer. Can't seem to post a picture so here's some of my dividend picks for the year:(My Dividend Daddys Watchlist) MSFT, TXN, DIS, AGNC, PG, MRK, VIG, PG, JNJ, LMT, EDP, PEP, DPZ, KO, O, T, VYM, TRP, ATO, SPYD, MMM, CLX, CAP, BP, XOM, BK, MCD, BAC, WFC, ET. \n\nI am by no means a professional, but that's where I am currently adding long term positions. I've also grabbed some APPL while it's been down. I can't be any help on commodities, but raw materials should see a boost this year as things turn on, but a lot of them seem pretty front loaded for the recovery. I may look for a materials ETF to take a position in myself.",
        "created_utc": 1615417053,
        "id": "gqi6r5v",
        "score": 2,
        "subreddit": "investing",
        "created": 1615445853.0
    },
    {
        "author": "hi-imBen",
        "body": "A)  They are trying to say the semiconductor shortage could be manufactured (intentionally shutting down factories/restricting supply to increase the price they can charge).  While this isn't an insane theory, it is not what is happening now.\n\n\nB)  Doesn't look like they are talking about any one stock specifically, but the semiconductor industry.\n\n\nC)  Please buy all the semiconductor stocks/ETFs I'm holding :)   ADI, MXIM, MCHP, TXN, SITM, MPWR, ON, NXPI, MRVL, QCOM, XLNX, SOXX, PSI, SMH",
        "created_utc": 1614809529,
        "id": "gpl38tb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614838329.0
    },
    {
        "author": "LastDelivery5",
        "body": "TXN does not have as much of an operational improvement story. ON is going through fab rationalization.",
        "created_utc": 1614794344,
        "id": "gpk48o3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614823144.0
    }
]