[
    {
        "author": "LSatou",
        "body": "Make a Fidelity account and let them figure it out for you for free",
        "created_utc": 1626111373,
        "id": "h4xz0n0",
        "score": 424,
        "subreddit": "stocks",
        "created": 1626140173.0
    },
    {
        "author": "aurora4000",
        "body": "Not buying Robinhood.\n\nIf I wanted to buy a broker's stock, I'd buy Schwab (SCHW). \n\nI already own Morgan Stanley (MS) - they bought E\\*Trade.\n\nRobinhood has not even been able to keep their app working properly, has not been able to fill orders promptly, has consistently provided incorrect info to users about their trades.\n\nDon't buy Robinhood, and better yet don't use it. Use a real broker like Schwab, Fidelity or Int'l Brokers IBKR.",
        "created_utc": 1625362095,
        "id": "h3z90or",
        "score": 385,
        "subreddit": "StockMarket",
        "created": 1625390895.0
    },
    {
        "author": "Jack0fDiamonds",
        "body": "I would go with fidelity 100%.",
        "created_utc": 1626112293,
        "id": "h4y13cf",
        "score": 229,
        "subreddit": "stocks",
        "created": 1626141093.0
    },
    {
        "author": "Admiral_pumpkin",
        "body": "Head to fidelity!",
        "created_utc": 1626191735,
        "id": "h51rto9",
        "score": 190,
        "subreddit": "StockMarket",
        "created": 1626220535.0
    },
    {
        "author": "LatimerCross",
        "body": "Multiple outages such as when the stock market tanked beginning of pandemic, restricting certain stocks to closing only during volatility, other general shady stuff. Better to go with brokers that won't tank during unprecedented times such as Fidelity and Vanguard. I'm sure others can go into better detail though.",
        "created_utc": 1625266163,
        "id": "h3v15wv",
        "score": 186,
        "subreddit": "wallstreetbets",
        "created": 1625294963.0
    },
    {
        "author": "NegaTrollX",
        "body": "Get fidelity instead",
        "created_utc": 1625266648,
        "id": "h3v24cj",
        "score": 170,
        "subreddit": "wallstreetbets",
        "created": 1625295448.0
    },
    {
        "author": "Gold_Flake",
        "body": "**Uploaded vid proof for mod.** \n\nI've transferred most of my shares from RH (fuck vlad) to Fidelity &amp; Sofi.\n\nBeen Averaging up hard since ~$40 and will continue to do so!\n\nObligatory: LFG!!! 🚀🚀🚀🚀🦍🍌 🦍🍌 🦍🍌 🦍 🍌",
        "created_utc": 1625606320,
        "id": "h4a6swj",
        "score": 153,
        "subreddit": "wallstreetbets",
        "created": 1625635120.0
    },
    {
        "author": "robtbo",
        "body": "They admit to losing a bunch of money and also to receiving 331 million for order flow data. \n\nThey didn’t mention citadel though did they? \n\nEven though I hold some positions with robinhood the majority of my money is in fidelity. \nI actually have a little in cashapp too. \n\neven with that being said - I truly hope $HOOD fails",
        "created_utc": 1625225982,
        "id": "h3skzlr",
        "score": 147,
        "subreddit": "wallstreetbets",
        "created": 1625254782.0
    },
    {
        "author": "daigana",
        "body": "*\"We cannot assume that similar events won't happen in the future.\"*\n\nWe can as consumers; stop trading in Robinhood and switch to a different platform like Fidelity. Takes a few days to transfer your investments over.",
        "created_utc": 1625229499,
        "id": "h3sqh5c",
        "score": 107,
        "subreddit": "stocks",
        "created": 1625258299.0
    },
    {
        "author": "rhetorical_twix",
        "body": "it might depend on your broker. On Fidelity, you can set your trading preferences for each account, and you can pick among options like FIFO (First In First Out), Higher cost basis first, and so on. They have a lot of fancy options, like having one set of selling priorities for short-term-held stocks and another for your long-term-held stocks.",
        "created_utc": 1625531408,
        "id": "h46o7y3",
        "score": 101,
        "subreddit": "stocks",
        "created": 1625560208.0
    },
    {
        "author": "Top-Entrepreneur-589",
        "body": "put $75 into your robinhood balance and request a transfer over to fidelity my man 😎",
        "created_utc": 1626825737,
        "id": "h5xu9xa",
        "score": 97,
        "subreddit": "wallstreetbets",
        "created": 1626854537.0
    },
    {
        "author": "michael_maybe44",
        "body": "Fidelity did a study of their highest earners and their top 10 were dead and the others were unaware they had an account with fidelity",
        "created_utc": 1627209544,
        "id": "h6gmoj5",
        "score": 85,
        "subreddit": "stocks",
        "created": 1627238344.0
    },
    {
        "author": "jojot001",
        "body": "After the WSB meme stocks, I called Fidelity on a unrelated matter and the customer service rep apologies for the long wait time due to so much new accounts being setup. LOL",
        "created_utc": 1627235369,
        "id": "h6hul6l",
        "score": 83,
        "subreddit": "StockMarket",
        "created": 1627264169.0
    },
    {
        "author": "Believer109",
        "body": "$1.4B *so far*. \n\nRH doesn't reveal how this number is calculated but it is quite large compared to their January AUM of $20B total. \n\nIt's possible this is lost revenue from PFOF of users switching brokerages. I notice RH did not disclose the total number of accounts or transfers. \n\nIt could also be from having to buy real shares on dark pools as customers transferred out. Plenty of Fidelity customers reported wonky cost basis transferring over from RH, some higher than the stocks official ATH.",
        "created_utc": 1625220901,
        "id": "h3sebzc",
        "score": 81,
        "subreddit": "wallstreetbets",
        "created": 1625249701.0
    },
    {
        "author": "Oskisrevenge",
        "body": "What differentiates robinhood from its competitors? What's preventing Fidelity from eating their lunch? If Fidelity spends billions to build an app that appeals to Gen z investors, what advantages does robinhood have?",
        "created_utc": 1626922936,
        "id": "h631tsg",
        "score": 79,
        "subreddit": "investing",
        "created": 1626951736.0
    },
    {
        "author": "Embarrassed-Fruit-79",
        "body": "I made a few grand this year on some good picks. I'm a retard though when it comes to options. My Fidelity account wouldn't approve me at all for option trading, opened up Webull and got approved for level 2 by lying that I'm a pro at options with 7+ years of experience. Deposited $1000.00 and got me some options last week I'm down to about $126.00 as of today.",
        "created_utc": 1625161542,
        "id": "h3pgkae",
        "score": 73,
        "subreddit": "wallstreetbets",
        "created": 1625190342.0
    },
    {
        "author": "iplaypokerforaliving",
        "body": "I’m in the process of transferring to fidelity and it feels great",
        "created_utc": 1625603512,
        "id": "h4a0iqx",
        "score": 72,
        "subreddit": "wallstreetbets",
        "created": 1625632312.0
    },
    {
        "author": "BurnieSlander",
        "body": "Have you seen Fidelity’s beta version mobile app? Nearly identical to RH. Fidelity going to eat RH alive once they fine tune it (it’s worked perfectly for me so far)",
        "created_utc": 1626939671,
        "id": "h63pvf3",
        "score": 71,
        "subreddit": "investing",
        "created": 1626968471.0
    },
    {
        "author": "strongisthybeard",
        "body": "Fidelity is already doing this.",
        "created_utc": 1626990200,
        "id": "h66dmm1",
        "score": 66,
        "subreddit": "pennystocks",
        "created": 1627019000.0
    },
    {
        "author": "dungadewballz",
        "body": "Yup. I transferred from RH to Fidelity. Everything except partial shares will transfer. You’ll be charged $75. RH will drag their feet sending over your cost basis as mentioned. They suck.",
        "created_utc": 1627254603,
        "id": "h6ixhqq",
        "score": 65,
        "subreddit": "investing",
        "created": 1627283403.0
    },
    {
        "author": "FutureRaisin1350",
        "body": "Dollar amounts are relative.  $50-$100 can mean a lot to you in the right investment, and when that investment is not controlled by YOU, but by your trading platform? Things can get real.  RobbingHood has 49 pending lawsuits THIS YEAR ALONE.  \nFidelity is a sure bet- they clear their own trades, so they have no reason to profit off of you without your express consent. \nBut don’t listen to me, I’m not a financial advisor; I’m just an ape with one or two wrinkles in the brain.",
        "created_utc": 1625267026,
        "id": "h3v2uve",
        "score": 55,
        "subreddit": "wallstreetbets",
        "created": 1625295826.0
    },
    {
        "author": "TheFleshGordon",
        "body": "Fidelity Customer Service: Hi how can we help you today?\n\nMe: When your brokerage was down someone placed a whole bunch of shitty stupid trades in my account!",
        "created_utc": 1626969915,
        "id": "h652j1w",
        "score": 54,
        "subreddit": "wallstreetbets",
        "created": 1626998715.0
    },
    {
        "author": "Medium_Dimension9602",
        "body": "Switch to fidelity. Fuck robbing hood",
        "created_utc": 1626487649,
        "id": "h5gzckf",
        "score": 53,
        "subreddit": "StockMarket",
        "created": 1626516449.0
    },
    {
        "author": "AmericaneXLeftist",
        "body": "FIDELITY JUST BOUGHT 900,000+ SHARES OF CLOV",
        "created_utc": 1626985947,
        "id": "h6640v5",
        "score": 50,
        "subreddit": "wallstreetbets",
        "created": 1627014747.0
    },
    {
        "author": "allthegoodtimes80",
        "body": "Fidelity. Their app is ugly but when you go to buy stock they actually let you buy it!",
        "created_utc": 1625329041,
        "id": "h3xl49i",
        "score": 47,
        "subreddit": "Wallstreetbetsnew",
        "created": 1625357841.0
    },
    {
        "author": "NefariousnessOk980",
        "body": "This👆, I have fidelity, rh, and webull. Most of my shares are on fidelity. You don't understand how bad I want to transfer those shares from rh to Fidelity. I have heard bad things about Webull but I can't back it up, only been with webull for a month. Webull and Rh apps are easier to use imo. I do most of price checking there.",
        "created_utc": 1625277514,
        "id": "h3vlu7u",
        "score": 46,
        "subreddit": "wallstreetbets",
        "created": 1625306314.0
    },
    {
        "author": "Fickle_Particular_83",
        "body": "Go to fidelity. I had the same issue with vanguard and went to fidelity. I do not regret my decision at all, Fidelity’s customer service is actually good",
        "created_utc": 1625693346,
        "id": "h4egk4s",
        "score": 46,
        "subreddit": "investing",
        "created": 1625722146.0
    },
    {
        "author": "Ishmael_1851",
        "body": "Fidelity would have worked better on several levels",
        "created_utc": 1625534582,
        "id": "h46u2np",
        "score": 46,
        "subreddit": "StockMarket",
        "created": 1625563382.0
    },
    {
        "author": "Astro_Toro4",
        "body": "Fidelity is my fav at the moment. Not financial advice",
        "created_utc": 1625179095,
        "id": "h3qkglb",
        "score": 44,
        "subreddit": "Wallstreetbetsnew",
        "created": 1625207895.0
    },
    {
        "author": "Manofindie",
        "body": "Fintel buy list shows GME has renewed intarest from fidelity and other funds.\n\nAt current price,\n\nFuck this analyst and what he had to say.",
        "created_utc": 1625271582,
        "id": "h3vbaz0",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1625300382.0
    },
    {
        "author": "Steven_The_Sloth",
        "body": "I convinced my wife to get her GME transferred out of RH. But literally everything else she has self invested is still there. But at least her GME is on fidelity now.",
        "created_utc": 1625234847,
        "id": "h3t10yn",
        "score": 41,
        "subreddit": "wallstreetbets",
        "created": 1625263647.0
    },
    {
        "author": "callingthebullshit",
        "body": "I feel Schwab, TD, Fidelity might also either directly or indirectly want and need RH as the gateway drug. It introduces investing to a huge new customer base that may not be interested otherwise. And once these newer investors start learning more about the market they inevitably will transfer over to the more established brokers.",
        "created_utc": 1625937950,
        "id": "h4pzcc3",
        "score": 40,
        "subreddit": "stocks",
        "created": 1625966750.0
    },
    {
        "author": "Sad_Comedian_9775",
        "body": "Yes, not robbingthehood! I would go with fidelity.  There is a sub reddit page you can investigate the pros and cons of their platform. I think you should research them.",
        "created_utc": 1627232073,
        "id": "h6hnpuk",
        "score": 39,
        "subreddit": "stocks",
        "created": 1627260873.0
    },
    {
        "author": "Leather_Double_8820",
        "body": "You are so right everybody claims to hate Robinhood but I would say half of the screenshots that we see are from fucking Robin Hood.\n\nI know myself personally why would I download Robinhood when Fidelity is free Fidelity has been around forever and they play by the book.\n\nThe dumbasses that buy Robin Hood shares when they IPO will be the same dumb ass is holding the fucking bag Robin Hood is like a little devil with candy in their hand in front of a clueless child. \n\n Robin Hood is on the brink of being sued investigated all types of crazy shit , yet wanna IPO",
        "created_utc": 1626718056,
        "id": "h5s2ewi",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1626746856.0
    },
    {
        "author": "arockhardkeg",
        "body": "We must have different betas, cause my beta is one reskinned page at the front but the same ugly shit and horizontal scrolling when you tap into anything. \n\nI’m a loyal Fidelity customer, but I still use Robinhood to view prices on my watchlist, especially option chains. Holy fuck does Robinhood’s option chain run circles around Fidelity’s still.",
        "created_utc": 1626943961,
        "id": "h63uj3z",
        "score": 39,
        "subreddit": "investing",
        "created": 1626972761.0
    },
    {
        "author": "HYPED_UP_ON_CHARTS",
        "body": "Fidelity. As far as Im aware, they dont have problems with maxing out their line of credit every couple of wks",
        "created_utc": 1625663749,
        "id": "h4cmhrt",
        "score": 38,
        "subreddit": "StockMarket",
        "created": 1625692549.0
    },
    {
        "author": "iMacBurger",
        "body": "Yeah better switch to Fidelity.",
        "created_utc": 1625185969,
        "id": "h3qxz51",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1625214769.0
    },
    {
        "author": "Jack0fDiamonds",
        "body": "You'd have to do the research yourself. TD BANK has nickel and dimed me before so I'm a biased against it. I love fidelity because of my experience with staff in person and on the phone.",
        "created_utc": 1626113968,
        "id": "h4y4uih",
        "score": 37,
        "subreddit": "stocks",
        "created": 1626142768.0
    },
    {
        "author": "Stonkz_N_Roll",
        "body": "Ya just go with Fidelity.  I transferred everything I had over to Fidelity today.  The aesthetics and layout are terrible when compared to RH, but at least I’ll have peace of mind.\n\nYou can start out with RH, and get a handle on things; but transfer over to a serious broker if you’re ready to take things seriously.",
        "created_utc": 1625267662,
        "id": "h3v42mn",
        "score": 36,
        "subreddit": "wallstreetbets",
        "created": 1625296462.0
    },
    {
        "author": "gumbii87",
        "body": "Fidelity has been doing right for me for close to 2 decades now. Robinhood is just a sleezy organization and Im amazed and let down that this isnt a larger fine, given their rather blatant manipulation.",
        "created_utc": 1625129511,
        "id": "h3nv22e",
        "score": 34,
        "subreddit": "StockMarket",
        "created": 1625158311.0
    },
    {
        "author": "NewAdmiral",
        "body": "What brokerage are you using?  If using Fidelity, there is a performance tab that shows your performance versus your cash value if you had not invested.  So your growth/loss versus your starting balance +/- deposits and withdrawals.  At the bottom of that screen it shows your account performance in different intervals (1mo, 3mo, YTD, 1yr, 3yr, 5yr, 10yr) versus standard market indexes over the same time period.  You also have the option to modify which indexes you are comparing yourself against.",
        "created_utc": 1626386847,
        "id": "h5bswib",
        "score": 33,
        "subreddit": "investing",
        "created": 1626415647.0
    },
    {
        "author": "rogue_royal_",
        "body": "Fidelity",
        "created_utc": 1625578531,
        "id": "h48hxol",
        "score": 32,
        "subreddit": "Wallstreetbetsnew",
        "created": 1625607331.0
    },
    {
        "author": "not_creative1",
        "body": "Fidelity rubs salt on my wound by providing the graphic that compares my returns to SP500 returns.\n\nThis graphic is on the home page",
        "created_utc": 1626588996,
        "id": "h5loyob",
        "score": 31,
        "subreddit": "SPACs",
        "created": 1626617796.0
    },
    {
        "author": "dec718",
        "body": "Use fidelity not financial advice",
        "created_utc": 1626117704,
        "id": "h4ycru6",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1626146504.0
    },
    {
        "author": "imakeplasma",
        "body": "The top left screenshot is Fidelity, so he’s not all Robbinghood at least",
        "created_utc": 1625613582,
        "id": "h4alk37",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1625642382.0
    },
    {
        "author": "rawnaldo",
        "body": "Fidelity\\*\\*\\*\\* account.",
        "created_utc": 1625534340,
        "id": "h46tmz9",
        "score": 29,
        "subreddit": "StockMarket",
        "created": 1625563140.0
    },
    {
        "author": "WARMBROWNIES",
        "body": "Fidelity has a beta feature in their app which looks pretty close to Robinhood’s UI! It’s worth checking out.",
        "created_utc": 1626652261,
        "id": "h5oyda4",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1626681061.0
    },
    {
        "author": "leesteapleton",
        "body": "My girl just saw me sign into fidelity and asked if I knew the markets were closed... how about minding your own business...",
        "created_utc": 1625376057,
        "id": "h3zu0f2",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1625404857.0
    },
    {
        "author": "TheHizous",
        "body": "\\^\\^\\^ that right there... you could buy an ETF that tracks industry giants like FENY for Oil and Gas, or Technology giants FTEC (which basically is the same as SPY or VOO).  Instead of buying and selling 10+ stocks - the ETF will do it for you.  Some ETFs also provide dividends, but not all.   The trade from individual stocks to ETFs is volume of trades.  If you want someone to manage it for you - You can buy one time and hold to let someone else do the short term work and you only get hit with expense fees rather than short/long term capital gains (until you actually sell the ETF yourself).  ETFs typically carry a pretty low expense ratio .02 (pretty low) to .2ish (which i consider as high).  \n\nI own both FTEC and FENY and they have a .08 expense ratio.  FTEC has been going crazy because of all the massive gains in tech and its what I know and follow.  FENY is a nice dividend ETF, and its cheap.  I also use the Fidelity platform, which is why I also lean towards Fidelity ETFs.  \n\nI'm not an analyst... this is just my 2 cents worth.",
        "created_utc": 1625323721,
        "id": "h3xb19s",
        "score": 28,
        "subreddit": "stocks",
        "created": 1625352521.0
    },
    {
        "author": "atx_4_life",
        "body": "I transferred to fidelity twice. Both took 3 days. One for all my GME, one for the rest of my positions. Fuck em. Not gonna short them, but fuck em, forreal.",
        "created_utc": 1625605275,
        "id": "h4a4jyd",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1625634075.0
    },
    {
        "author": "AllItTakesIsNow",
        "body": "You need to move those shares out of Robinhood and into Fidelity or something.",
        "created_utc": 1626327981,
        "id": "h58t431",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1626356781.0
    },
    {
        "author": "Jmeshareholder",
        "body": "Transfer to fidelity",
        "created_utc": 1625167819,
        "id": "h3pv3yh",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1625196619.0
    },
    {
        "author": "jojot001",
        "body": "I’ve pulled all of my positions from them, I feel much better in trusting fidelity with my investments. They have also improved their mobile app considerably in the last few months.",
        "created_utc": 1627240867,
        "id": "h6i5zby",
        "score": 25,
        "subreddit": "StockMarket",
        "created": 1627269667.0
    },
    {
        "author": "yachtsandthots",
        "body": "Fidelity? More like INfidelity because they’re fucking everyone right now",
        "created_utc": 1626969558,
        "id": "h651ok8",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1626998358.0
    },
    {
        "author": "CJHoss",
        "body": "Start with index funds. Ignore the individual company stocks for long term as you’re getting started. \n\nFidelity Go is good for an actively managed fee based robo-advisor, but if you read up on index funds, asset allocation, and rebalancing you may be able to DIY.",
        "created_utc": 1625502183,
        "id": "h454211",
        "score": 25,
        "subreddit": "stocks",
        "created": 1625530983.0
    },
    {
        "author": "xvalid2",
        "body": "Transfer from Robinhood to Fidelity literally took like two business days",
        "created_utc": 1625167955,
        "id": "h3pvfc3",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1625196755.0
    },
    {
        "author": "msnf",
        "body": "Yeah not a chance. Robinhood has $80 billion assets under management compared to like $10 trillion for Fidelity and $7 trillion for Vanguard. Robinhood accounts are way smaller than the old brokers. They do punch above their weight in terms of activity though, and might even dominate small segments like dog themed internet bucks.",
        "created_utc": 1625658192,
        "id": "h4cdw10",
        "score": 24,
        "subreddit": "StockMarket",
        "created": 1625686992.0
    },
    {
        "author": "Gzrht",
        "body": "Fidelity is free",
        "created_utc": 1626637164,
        "id": "h5o18ef",
        "score": 24,
        "subreddit": "pennystocks",
        "created": 1626665964.0
    },
    {
        "author": "bittabet",
        "body": "It’s not hard to get on other platforms but it’s almost always an additional application and until recently most brokers required sending in actual physical paperwork or dropping it off at a Schwab or Fidelity branch. No brokers out there default to allowing margin and options except RH 😂",
        "created_utc": 1625516305,
        "id": "h45vx7a",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1625545105.0
    },
    {
        "author": "BigCitySteam638",
        "body": "1. Farmers &amp; merchants \n2. 3m \n3. Fidelity realty investment \n4. Johnson &amp; Johnson \n5. Proctor &amp; gamble \n\nTop 5",
        "created_utc": 1626055743,
        "id": "h4vjljb",
        "score": 23,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1626084543.0
    },
    {
        "author": "DdP2000",
        "body": "I use Fidelity. Their new beta look is pretty good and I like the research component they offer.",
        "created_utc": 1626135108,
        "id": "h4zcls2",
        "score": 23,
        "subreddit": "stocks",
        "created": 1626163908.0
    },
    {
        "author": "Artie_Fufkins_Fapkin",
        "body": "Is fidelity better than TDA? Does it have an analog to ThinkOrSwim? Luv thinkorswim",
        "created_utc": 1626113623,
        "id": "h4y42qs",
        "score": 23,
        "subreddit": "stocks",
        "created": 1626142423.0
    },
    {
        "author": "int-f-j",
        "body": "Fidelity.",
        "created_utc": 1625180464,
        "id": "h3qnaby",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1625209264.0
    },
    {
        "author": "LauriFUCKINGLegend",
        "body": "Took me less than 48 hours last week :) Fidelity is fucking awesome",
        "created_utc": 1625611175,
        "id": "h4agryz",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1625639975.0
    },
    {
        "author": "OuthouseBacksplash",
        "body": "Full disclosure, I use TD, fidelity, and wells Fargo. I like TD for their platform and the charts how i want to see them. In WF just cause had a 401k there, and use fidelity as well. Fidelity is the most solid broker you could want. 😎",
        "created_utc": 1626194374,
        "id": "h51xube",
        "score": 23,
        "subreddit": "StockMarket",
        "created": 1626223174.0
    },
    {
        "author": "srr5399",
        "body": "Thanks.  I’m about to give fidelity a call…. Closing all my accounts with ally after this.\nI don’t think I have enough karma to post but I’ll try.",
        "created_utc": 1626193479,
        "id": "h51vt9c",
        "score": 22,
        "subreddit": "StockMarket",
        "created": 1626222279.0
    },
    {
        "author": "Kellzbellz8888",
        "body": "Yeah well I don’t think we can avoid that at this point haha it’s like a hot trend right now lol. But with this stock it is pretty manipulated so it’s important to stay informed if your planning to hold like me. I’m not actively trading this stock and I don’t hold options anymore. I played some earlier this year and got lucky on the IVAS news when we spiked. Then I also got burned in April with some calls. I have some shares in my fidelity account as well that I’m holding.",
        "created_utc": 1626151264,
        "id": "h505azj",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1626180064.0
    },
    {
        "author": "TheCrassEnnui",
        "body": "Under Chicago Board Options Exchange (CBOE) rules, there are five criteria that a stock must meet before it can have options as of December 2020.\r  \n\r  \n\r  \n1. The underlying equity security must be a properly registered NMS stock.\r  \n2. The company must have at least 7,000,000 publicly held shares.\r  \n3. The underlying stock must have at least 2,000 shareholders.\r  \n4. Trading volume must equal or exceed 2,400,000 shares in the past 12 months.\r  \n5. The price of the security must be sufficiently high for a specific time.\n\nDue mostly to rule no. 4, we won't be able to do anything. I plan to ignore them and educate myself as much as possible about alternatives. I'm waiting on my checking account to catch up with the instant deposits so I can close out and move to Fidelity. I loathe these guys now and wouldn't piss on their teeth if they were on fire.",
        "created_utc": 1625165237,
        "id": "h3pp516",
        "score": 22,
        "subreddit": "Wallstreetbetsnew",
        "created": 1625194037.0
    },
    {
        "author": "Substantial_Boss_619",
        "body": "I am not a financial advisor so I can't get you a solid answer but most people switched to Fidelity",
        "created_utc": 1625175718,
        "id": "h3qd8mj",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1625204518.0
    },
    {
        "author": "mrmrmrj",
        "body": "The \"ratings\" on TDA, Fidelity, ETrade, Schwab are absolute farking garbage. Never make a decision based on these.",
        "created_utc": 1626112945,
        "id": "h4y2k4y",
        "score": 21,
        "subreddit": "stocks",
        "created": 1626141745.0
    },
    {
        "author": "srr5399",
        "body": "Seems to be the consensus - I’m calling fidelity now, ty!",
        "created_utc": 1626194623,
        "id": "h51yf2l",
        "score": 21,
        "subreddit": "StockMarket",
        "created": 1626223423.0
    },
    {
        "author": "wazza225",
        "body": "Apparently all but a few online brokers use them, fidelity was one of the few that sent order purchases to the proper exchanges, all the rest are going  to payment for flow orders that are being purchased off exchanges and have no effect on the price",
        "created_utc": 1626540718,
        "id": "h5j6bj9",
        "score": 21,
        "subreddit": "pennystocks",
        "created": 1626569518.0
    },
    {
        "author": "BigDaddyWarChest",
        "body": "Fidelity",
        "created_utc": 1625663665,
        "id": "h4cmcdr",
        "score": 20,
        "subreddit": "StockMarket",
        "created": 1625692465.0
    },
    {
        "author": "Flying_madman",
        "body": "It's two different brokers. Bottom right is Robinhood, top left is Fidelity.",
        "created_utc": 1625591150,
        "id": "h498szp",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1625619950.0
    },
    {
        "author": "robertleeblairjr",
        "body": "What DD? I've not seen any thought out DD to show that on a 500 million float which increased by 60-70 million over the past few weeks that retail hold the leverage. Not all the float which is quite doubtful. Leverage as in the significant holdings. Derivatives are controlling price movement and AMC has had a decent enough turnover, ie search Fidelity retail sentiment, that unless AA forces short closings to make that price jump. It will be controlled. You only have to look at a 70-75 million float in GME to understand that manipulation. If they can do it on that low of a float and it left the R2K, then AMC is a much easier target.",
        "created_utc": 1625685050,
        "id": "h4dxi48",
        "score": 19,
        "subreddit": "StockMarket",
        "created": 1625713850.0
    },
    {
        "author": "Claudius06",
        "body": "I would go s&amp;p 500 or Vti. You could even look into vanguard or fidelity robo Advisors fees apply but you don't have to manage anything.",
        "created_utc": 1625515941,
        "id": "h45v7g6",
        "score": 19,
        "subreddit": "investing",
        "created": 1625544741.0
    },
    {
        "author": "Yasukablyat",
        "body": "Fidelity is free day trading if your account is 25,000+.  The fees for penny stocks have never been more than .05-10 cents per trade.  \n\nEdit: Just checked my Fidelity fees for penny stocks, all .01 and one was .02, so yeah, no fees",
        "created_utc": 1626641764,
        "id": "h5obn9d",
        "score": 19,
        "subreddit": "pennystocks",
        "created": 1626670564.0
    },
    {
        "author": "Believer109",
        "body": "A lot of people on the other subs reported crazy wonky cost basis transferring over. Stuff like $480+ per share. One guy had a share appear to cost $600-something. No word on whether this is a glitch from RH (Fidelity lets you correct the cost basis) or somehow the dark pool pricing leaking through or a combination of both. \n\nPersonally when I did my transfer back in April it took weeks to get my cost basis but when it came over it was spot on from my records.",
        "created_utc": 1625226082,
        "id": "h3sl4ni",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1625254882.0
    },
    {
        "author": "JeffB1517",
        "body": "Zacks not fraudulent it is a very mainstream buy side analysis house without sell side conflicts of interest.  Fidelity for example pays for access for their customers as part of their research offerings.",
        "created_utc": 1626754208,
        "id": "h5u6emg",
        "score": 19,
        "subreddit": "investing",
        "created": 1626783008.0
    },
    {
        "author": "abzz123",
        "body": "Fidelity asks me to enter my password over phone call to support every time though. I seriously doubt they can have a user friendly app.",
        "created_utc": 1626941218,
        "id": "h63rjxz",
        "score": 19,
        "subreddit": "investing",
        "created": 1626970018.0
    },
    {
        "author": "Keith_13",
        "body": "No relationship is maintained.  That would be extremely complicated and unnecessary.  Imagine if I'm buying to close, and the trade is executed with you on the other side, and you are selling to close.  Now what?  We were not counterparties before, but now an option contract needs to go away.  So they need to pick one of the contracts to get rid of, and link our counterparties together on the one that they decide to leave it open.  It's a total mess and it accomplishes nothing.\n\nWhen an option is exercised, the OCC makes good on it (kind of; settlement takes time).  At the end of the day, they pick a random person to assign to out of all the open contracts.  (Technically they pick a random broker, who then picks a random client).  This is why exercise can happen at any time but assignment can only happen overnight (this is also very important; you have no assignment risk if you do not hold short positions overnight).  They key here is that when you exercise, the OCC is on the hook to deliver.  If the person who sold the contract is bankrupt, and their broker goes under, your exercise still happens with no issues.  If this was not the case then you would have to worry about who your counterparty was.  Is the option being sold from an account at Fidelity, or some questionable broker that your have never heard of?  Do you really want to worry about that?  If there was counterparty risk then the price of the contract would vary based on the creditworthiness of the issuer.  It would be a total mess.  You wouldn't be able to have a market, because every contract would be different.\n\nIt's not true that Charlie is the only one who can exercise Alfred's option, so no that can't be known.  \"Alfred's option\" didn't even really exist.  They are all the OCC's options",
        "created_utc": 1626889425,
        "id": "h610py1",
        "score": 18,
        "subreddit": "options",
        "created": 1626918225.0
    },
    {
        "author": "ashehudson",
        "body": "Fidelity rep 3 way called the holder of my IRA and verified all the information was 100% correct before they initiated the wire transfer. Just saying.",
        "created_utc": 1625695770,
        "id": "h4em91g",
        "score": 18,
        "subreddit": "investing",
        "created": 1625724570.0
    },
    {
        "author": "Electronic-Mango9423",
        "body": "have used both extensively this year. Although I like TOS better than Active Trader Pro for software experience, Fidelity is WAY better to deal with customer service and order execution. I dont have orders executing incorrectly anymore and found TD had terrible execution of market orders, often going through entirely outside of the spread and always only in ways that lost me money.",
        "created_utc": 1626114787,
        "id": "h4y6occ",
        "score": 18,
        "subreddit": "stocks",
        "created": 1626143587.0
    },
    {
        "author": "real_stock_guy",
        "body": "Wait! Before you call Fidelity… let me just say I use Fidelity and they are the best! I use 2 others for various reason but my largest by far accounts is Fidelity! Ok… call them!",
        "created_utc": 1626200809,
        "id": "h52cgqw",
        "score": 18,
        "subreddit": "StockMarket",
        "created": 1626229609.0
    },
    {
        "author": "Merc_Drew",
        "body": "Thank you for this, I was thinking fidelity but going to JD would probably be better.",
        "created_utc": 1626835622,
        "id": "h5yem46",
        "score": 18,
        "subreddit": "stocks",
        "created": 1626864422.0
    },
    {
        "author": "bad_Golf1986",
        "body": "Fidelity doesn't charge OTC",
        "created_utc": 1626732945,
        "id": "h5t0jtn",
        "score": 18,
        "subreddit": "pennystocks",
        "created": 1626761745.0
    },
    {
        "author": "vbfx",
        "body": "Can you explain what you mean? Vanguard mf better than vanguard etf? Does vanguard etf or mf cost the same/ fee is the same whether you buy from vanguard platform or from another place like fidelity/ Schwab / you invest",
        "created_utc": 1625320087,
        "id": "h3x4gq3",
        "score": 18,
        "subreddit": "stocks",
        "created": 1625348887.0
    },
    {
        "author": "scottygras",
        "body": "Just transferred out in less than 2 days to my fidelity account. Surprised I didn’t get fake shares…",
        "created_utc": 1625231364,
        "id": "h3stvnw",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1625260164.0
    },
    {
        "author": "psssat",
        "body": "You can just make a fidelity acct that your wife does not know about though",
        "created_utc": 1627358803,
        "id": "h6o4q7g",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1627387603.0
    },
    {
        "author": "unknown-human-69",
        "body": "Fidelity,Vanguard,Schwab",
        "created_utc": 1625666557,
        "id": "h4crx6v",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1625695357.0
    },
    {
        "author": "GIazednConfused",
        "body": "If you needed any other excuse to delete Robinghood\n\nThey’ve fucking done it AGAIN! How can you be getting all this money from Shitadel and your platform STILL can crash at MARKET OPEN on a NORMAL MONDAY. \n\nTired of this piece of shit, not only can I not buy stock like last time but I can’t buy OR sell ANY STOCK and NOTHING is moving. This is so fucking rigged, I’m taking my -69% portfolio to Fidelity.",
        "created_utc": 1625491970,
        "id": "h44l0r4",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1625520770.0
    },
    {
        "author": "pandaben3204",
        "body": "Just switched to fidelity today myself. Great customer service and way better platform.",
        "created_utc": 1626203085,
        "id": "h52hk2w",
        "score": 17,
        "subreddit": "StockMarket",
        "created": 1626231885.0
    },
    {
        "author": "Kind_Committee8997",
        "body": "I like Fidelity because they leave me alone and trust that I know what I'm doing.",
        "created_utc": 1626124697,
        "id": "h4yrt23",
        "score": 17,
        "subreddit": "stocks",
        "created": 1626153497.0
    },
    {
        "author": "WaffleMints",
        "body": "\"Hello, Fidelity.\"\n\n\"Hi, I'd like to buy 10k shares of THCB/Microvast.\"\n\n\"Sir, we are obligated to let you know that before any transaction of a Chinese company we....\"\n\n\"MOTHER FUCK POOPITY FUCK! Say it again! I dare you!\"",
        "created_utc": 1626971174,
        "id": "h655jnh",
        "score": 17,
        "subreddit": "SPACs",
        "created": 1626999974.0
    },
    {
        "author": "TechieFire",
        "body": "People are so uneducated it's unreal, recommending SoFi and Webull lmao\n\nJust go to a broker like Fidelity...",
        "created_utc": 1626920749,
        "id": "h62xm5t",
        "score": 17,
        "subreddit": "investing",
        "created": 1626949549.0
    },
    {
        "author": "Stardusterr1953",
        "body": "you will be much happier with Fidelity",
        "created_utc": 1625932244,
        "id": "h4pnb3x",
        "score": 16,
        "subreddit": "stocks",
        "created": 1625961044.0
    },
    {
        "author": "Organic-Appointment",
        "body": "Fuk.  Fidelity wont let me buy anymore SPY calls because I have no money.\n\n#SYSTEM IS RIGGED!",
        "created_utc": 1625758864,
        "id": "h4hfzsm",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625787664.0
    },
    {
        "author": "Options-n-Hookers",
        "body": "Lol, film degree for 180k? They probably had RH account instead of a fidelity.",
        "created_utc": 1625892292,
        "id": "h4o5jl0",
        "score": 16,
        "subreddit": "StockMarket",
        "created": 1625921092.0
    },
    {
        "author": "Minute-Ad-2749",
        "body": "You can open a brokerage account somewhere also; like Vanguard, Fidelity and many others.\nCLOV 🍀🍀🍀❤️",
        "created_utc": 1625661141,
        "id": "h4ci42g",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1625689941.0
    },
    {
        "author": "dundermif70",
        "body": "I trade it exclusively in options use profits to add to my long term investing. I keep my accounts separate my trading account with fidelity and my long term in vanguard every month i transfer a percentage of my trading profits to my long term account.",
        "created_utc": 1626750280,
        "id": "h5tzgiw",
        "score": 16,
        "subreddit": "options",
        "created": 1626779080.0
    }
]