[
    {
        "author": "origami_asshole",
        "body": "Storytime Late July: My dad asked me to buy him Fiserv, I was like “wtf Fiserv, whatever”. Turns out he meant Pfizer. \n\nNow he’s threatening to kick me out of the house because he got blasted by Fiserv post earnings dump and thought he was holding Pfizer calls for the past two weeks. How do I get his 35k back? The fiserv calls expired last week and I told him yesterday. He was like “WHAT THE FUCK IS FISERV I SAID PFIZER” \n\nHe is legit throwing shit at me right now.",
        "created_utc": 1629232636,
        "id": "h9by333",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1629261436.0
    },
    {
        "author": "margin_call_rep",
        "body": "crazy you know fiserv more than Pfizer",
        "created_utc": 1629232778,
        "id": "h9byfbh",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1629261578.0
    },
    {
        "author": "Lucasstrand111",
        "body": "Anyone have any thoughts on Fiserv?",
        "created_utc": 1630165720,
        "id": "haozwge",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630194520.0
    },
    {
        "author": "manamr",
        "body": "Fiserv botta pop off",
        "created_utc": 1628882678,
        "id": "h8tj2ok",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628911478.0
    },
    {
        "author": "BtchesLoveHotTubs",
        "body": "I need some new long ideas. Here’s some that I’ve been reading up on to buy big and stay long on… (I’m not a pro or anything so I’m not saying these picks are 100%, and *constructive* criticism is welcome.)\n\n(SOFI) -  Pretty sure everyone knows sofi… One of my fav fintech stocks that is still very young and is growing very nicely. Seem to be making all the right moves.\n\n(NMTR) - Making worlds first celiac disease drug and also developing a drug for covid treatment. It’s a spec, but imagine this potential.\n\n(DKNG) &amp; (PENN) - Rapidly growing. Will continue to have an expanding TAM as states legalize online gambling &amp; betting. Canada just passed some laws too. Both companies made some recent acquisitions to continue growth and expansion. They have their eyes set on going a lot further than where they are.\n\n(DIS) - Disney is a powerhouse. Their streaming business has been growing and parks will just continue to generate as we move past covid. Streaming, movies, theme parks, cruise lines, merchandise… they have their hands in everything. I think disney’s streaming service is going to be a monster.\n\n(KBWY) - It’s basically a REIT etf. It’s got a high dividend yield. It’s still not fully recovered from pre-pandemic levels. I believe real estate will continue to recover. I’d just keep this forever and keep buying into it over time and let the DRIP grow it too.\n\n(Z) - Zillow got a lot of attention with the housing boom and is taking advantage of it. Apparently they’ve been buying up a TON of real estate. I think that’s a genius idea to streamline real estate transactions. High P/E currently but I think as their new plans unfold that will rapidly make a lot more sense.\n\n(FISV) - Love what they’re doing in the fintech space. They’ve been making a lot of acquisitions to expand their reach and I think they have a good plan to keep making their mark… BUT… not yet. I think their P/E is something like 70-80 so I’d wait for a pullback on this one before starting a position.\n\n$SOFI $NMTR $DKNG $PENN $DIS $KBWY $Z\n\nShare your ideas or tell me what you think about these ones.\n\nGood luck everyone.",
        "created_utc": 1629769109,
        "id": "ha3xlbv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629797909.0
    },
    {
        "author": "fuckaliscious",
        "body": "Yes, little fish get eaten by bigger fish that get eaten by huge fish.  Not hard to understand.  It will happen within a few years.  Maybe by STNE or a US based mega sponsor that wants to expand south of the border and into gambling.\n\nThe card associations like VISA and MC are a completely different beast, related but separate.. \n\nPaysafe is a payment processor, so a big player is Square which had operating margins of 4% last quarter.  Another is FISERV operating margin of 7% last quarter.  The payment processors have low margins but make crap tons of $$$ because of their large scale.\n\nVisa is great, a card association but definitely NOT a payment processor.\n\nNice try though... good luck to you",
        "created_utc": 1629250272,
        "id": "h9cz4zj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629279072.0
    },
    {
        "author": "TheTetraGrammaton",
        "body": "Honest question here: is FISV diving just because of FIS and people are confusing the tickers?",
        "created_utc": 1627926614,
        "id": "h7gchas",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627955414.0
    },
    {
        "author": "greytoc",
        "body": "I'm not sure that comparing SQ to AAPL and MSFT makes sense. You may want to consider comparing SQ to companies in it's space instead. I.e. $FIS, $FISV, $GPN, $ACIW.",
        "created_utc": 1628003562,
        "id": "h7k6tsw",
        "score": 1,
        "subreddit": "investing",
        "created": 1628032362.0
    },
    {
        "author": "abeachy24",
        "body": "Add more FISV calls 😍",
        "created_utc": 1629414002,
        "id": "h9ldquy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629442802.0
    },
    {
        "author": "greensymbiote",
        "body": "These are fair concerns. I think the large float is intentional due to the profile of a fintech that already does $100 billion in transactional volume and controls enough market share to be so readily accumulated by institutions. \n\nRegarding competition, see section on MOAT. They clearly differentiate themselves from competitors in iGaming, eCash, multi-jurisdictional regulatory expertise and risk management.\n\nDebt is currently high but they just had their debt rating upgraded, successfully refinanced all of it at much lower rates and are on track to expand margins and cash flow to reduce leverage. As I posted:\n\n&gt;\"The deal synergies and our growth profile will allow us to de-lever quickly and meaningfully make progress in 2022 towards our target of 3.5 times adjusted EBITDA.”  \n&gt;  \n&gt;This quoted debt/EBITDA ratio is better than most fintechs, including FOUR, RPAY, AFRM, BILL, PAYS and FISV.  Even before they reach that target, the new interest rate of 3.25% indicates that their pro forma free cash flow to debt service ratio will be around 4.5 to 1.",
        "created_utc": 1629656831,
        "id": "h9xs2uo",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629685631.0
    },
    {
        "author": "greytoc",
        "body": "By what metric are you using?\n\nSquare transaction payment volume is about $120Bn...\n\nFiserv transaction payment volume is over $2.6 trillion...\n\nFIS transaction payment volume is over $1,7 trillion...\n\nAnd for Fiserv and FIS - payment processing is only a subset of their fintech businesses - such as core banking account processing, etc. \n\nI don't quite understand what MSFT and AAPL have to do with payment processing.",
        "created_utc": 1628011771,
        "id": "h7kqbru",
        "score": 1,
        "subreddit": "investing",
        "created": 1628040571.0
    },
    {
        "author": "ThePeople1234",
        "body": "worked - TDOC, INTC, LMT, SLP, PINS, SCR, FSLY,\nSBUX, SPOT, CALM, AMGN, LMND\nfailed - STLD, UAL, VZ, TWTR, AMKR, FISV, TAP, DXCM, SEDG",
        "created_utc": 1628355076,
        "id": "h82momw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628383876.0
    },
    {
        "author": "Spac_a_Cac",
        "body": "Only example i know is Betsy Cohen's first SPAC with CardConnect Corp. It was acquired by First Data Corp.(part of Fiserv now), In 2017 for $15 a share about 1 year after merger\nHere is the deal\n \nTransaction Valuation* Amount of Filing Fee**$557,833,454.78 $64,652.90 *Estimated solely for purposes of calculating the filing fee. This calculation is based on the offer to purchase all of the issued and outstanding shares of common stock, par value $0.001 per share, of CardConnect Corp. (the “Company”), at a purchase price of $15.00 per share, net to the seller in cash, without interest and subject to any required tax withholding. The Transaction Valuation was calculated based on the sum of: (i) 31,472,060 issued and outstanding shares of common stock of the Company, multiplied by $15.00 per share; (ii) 8,105,169 shares of common stock of the Company underlying outstanding options with an exercise price that is less than $15.00 per share, multiplied by $6.77 (rounded up to the nearest cent) per share (which is equal to the difference between $15.00 and $8.23 (rounded down to the nearest cent), the weighted average exercise price of such options that have an exercise price that is less than $15.00 per share); and (iii) 10,300,000 shares of common stock of the Company underlying outstanding warrants, multiplied by $3.00 per share (which is equal to the difference between $15.00 and $12.00, the weighted average exercise price of such warrants), which calculations reflect the maximum number of options and warrants that are expected to be outstanding at the time the offer is completed. The foregoing numbers of shares of common stock, options and warrants have been provided by the issuer to the offeror and are as of the close of business on June 5, 2017, the most recent practicable date.\n\nhttps://sec.report/Document/0001193125-17-197185/",
        "created_utc": 1629562392,
        "id": "h9swsgs",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1629591192.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  4th of August\n\n\n\n## Upcoming events for Wednesday, August  4th\n\n - Expected earnings:\n\n  AAU, ABC, ABIO, AC, ACA, ACAD, ACEL, ACIU, ACLS, ACR, ADMA, ADPT, ADT, ADTN, AEIS, AERI, AFIN, AGL, AIRI, ALB, ALE, ALG, ALIM, ALKT, ALL, ALLO, ALNA, ALRN, ALTM, AMED, AMOT, AMPE, AMPY, AMSC, ANGI, ANSS, APA, APO, ARLO, ARTNA, ASMB, ASTE, ASYS, ATO, ATRC, ATTO, AVA, AXGN, BAK, BBSI, BCLI, BCOR, BCSF, BCYC, BDC, BDSI, BE, BFAM, BGCP, BKNG, BKTI, BLPH, BLUE, BNGO, BOOT, BRSP, BTG, BVH, BWA, CAMT, CCMP, CCRN, CCU, CDAY, CDW, CENT, CENTA, CENX, CFMS, CHNG, CIA, CIB, CIGI, CIM, CKPT, CLH, CLVS, CLW, CMLS, CMP, CPA, CPK, CPS, CRL, CRTO, CSGS, CSII, CSTE, CSWI, CUTR, CVGI, CVRX, CVS, CYAD, DCP, DFIN, DGII, DHC, DLHC, DMTK, DNOW, DOC, DOX, DRTT, DVAX, DXC, EA, ECPG, EDIT, EDRY, EGHT, ELA, ELF, EMKR, EMR, ENBL, EOG, EOLS, EQH, EQX, ERJ, ERO, ETR, ETSY, EVH, EVOP, EVRI, EXC, EXPI, EYPT, FATE, FCPT, FDP, FENC, FLMN, FLOW, FLT, FLXN, FOX, FOXA, FPI, FRGI, FRT, FSLY, FTDR, FUN, FVE, GDDY, GEL, GEO, GGB, GHC, GLBZ, GM, GMED, GNK, GPRK, GRP.U, GRTS, GTHX, HARP, HBB, HCC, HDSN, HFC, HHC, HI, HMC, HNGR, HR, HRTX, HUBS, HWM, HYMC, HZNP, IAC, IAG, ICD, ICUI, IIPR, IMXI, INGN, INMB, INSG, IO, IONS, ISEE, ISSC, IVC, IVR, JACK, JLL, JRVR, KBAL, KE, KHC, KIN, KLIC, KRO, KRTX, KUKE, KW, KZR, LAND, LESL, LHCG, LILA, LILAK, LL, LMND, LMRK, LNC, LPG, LPI, LUMN, MAC, MASS, MAXR, MBI, MCK, MCS, MDU, MED, MELI, MET, MFC, MGLN, MGM, MGPI, MIDD, MLR, MLVF, MNKD, MNRL, MNTV, MOD, MPC, MPLX, MRO, MTG, MTOR, MVIS, MWA, NC, NEPH, NESR, NEX, NHTC, NI, NL, NMFC, NODK, NP, NSPR, NSTG, NTEC, NUS, NVRO, NWPX, NXST, NYT, OCDX, ODP, OESX, ONEM, OPRX, OR, ORA, ORCC, ORIC, OSPN, OTIC, OYST, PACE, PARR, PCSA, PDCE, PETQ, PFLT, PING, PIRS, PLMR, PLTK, PLUS, PLYA, PNNT, PROF, PSN, PSNL, PTVE, PW, QNST, QRVO, QTWO, RCII, RCKT, RCL, REGI, RGR, RKT, RMAX, RMNI, RNWK, ROKU, RPD, RPT, RTLR, RVI, RVLV, RYI, RYN, SAFT, SALM, SANA, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGRY, SGU, SITE, SITM, SJI, SLF, SLGL, SLNG, SMG, SMP, SMSI, SPNS, SPR, SRDX, SRI, SRPT, SSRM, SSSS, STAA, STN, SUM, SUP, SUPN, SWM, TELL, TGB, TGI, TLC, TNDM, TPC, TPVG, TRC, TREC, TRMB, TRNO, TS, TSE, TT, TTGT, TUP, TVTY, TWNK, TWO, TXG, TXMD, UBER, UE, UFCS, UFI, UGI, UHAL, UIHC, ULCC, UMH, UPLD, URG, URGN, USDP, USWS, UTHR, UVV, VCEL, VIRT, VMC, VRCA, VRDN, VTOL, VVV, VWTR, VZIO, WCN, WDC, WLFC, WLL, WTS, WU, WYNN, XNCR, XPL, YELL, ZYME\n\n - Ex-div:\n\n  AWI, CATC, CCK, DKL, FELE, IBTX, IDA, KBH, MATX, NEP, NWBI, OFED, OPBK, SIMO, STBA, TGP, VBTX, VLO, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 695K, previous: 692K)\n    - Crude Oil Imports (previous: -0.616M)\n    - Crude Oil Inventories (consensus: -3.102M, previous: -4.089M)\n    - Cushing Crude Oil Inventories (previous: -1.268M)\n    - Distillate Fuel Production (previous: -0.163M)\n    - EIA Refinery Crude Runs  (previous: -0.132M)\n    - EIA Weekly Distillates Stocks (consensus: -0.543M, previous: -3.088M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: -0.3%)\n    - FOMC Member Clarida Speaks\n    - Gasoline Inventories (consensus: -1.780M, previous: -2.253M)\n    - Gasoline Production (previous: 0.649M)\n    - Heating Oil Stockpiles (previous: 0.108M)\n    - ISM Non-Manufacturing Business Activity (consensus: 60.6, previous: 60.4)\n    - ISM Non-Manufacturing Employment (previous: 49.3)\n    - ISM Non-Manufacturing New Orders (previous: 62.1)\n    - ISM Non-Manufacturing PMI (consensus: 60.5, previous: 60.1)\n    - ISM Non-Manufacturing Prices (previous: 79.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.01%)\n    - MBA Mortgage Applications (previous: 5.7%)\n    - MBA Purchase Index (previous: 251.7)\n    - Markit Composite PMI (consensus: 59.7, previous: 63.7)\n    - Mortgage Market Index (previous: 737.9)\n    - Mortgage Refinance Index (previous: 3,570.4)\n    - Services PMI (consensus: 59.8, previous: 64.6)\n\n## Upcoming events for Thursday, August  5th\n\n - Expected earnings:\n\n  AAOI, AAON, AAWW, ABMD, ABUS, ACET, ACHV, ACIW, ACMR, ACOR, ADMS, ADNT, ADXN, AE, AEE, AEL, AES, AEZS, AFCG, AG, AGM, AGO, AGS, AHCO, AIG, AIKI, AINV, AJX, AKBA, AL, ALBO, ALCO, ALDX, ALGS, ALRM, ALTR, AMBC, AMEH, AMH, AMN, AMRN, AMRS, AMYT, ANIK, APDN, APLE, APPN, APR, APTV, AQB, ARD, ARDX, ARNA, ARW, ARWR, ASRT, ASXC, ATAX, ATH, ATNX, ATRI, ATRS, ATSG, AUMN, AUPH, AUTL, AUTO, AVD, AVEO, AVLR, AVRO, AVXL, AXDX, AXNX, AXON, BAND, BANX, BBGI, BCE, BCH, BCRX, BDX, BECN, BEP, BERY, BFS, BGNE, BGS, BGSF, BHF, BIGC, BIP, BKCC, BKD, BKI, BL, BLCM, BLDP, BLDR, BLFS, BLL, BLRX, BPMP, BRBR, BRG, BRKS, BRT, BSGM, BTBT, BV, BWMX, BXRX, BYND, CABA, CAH, CAI, CALA, CAPR, CARG, CARS, CBIO, CCOI, CDAK, CDXS, CELH, CEMI, CERT, CFLT, CGNX, CHEK, CHH, CHRS, CHUY, CI, CIO, CKX, CLBS, CLDX, CLLS, CLNE, CLXT, CMRX, CNCE, CNDT, CNNE, CNP, CNQ, CNXN, COCP, COLD, COLL, COMM, CORE, CPLG, CQP, CRAI, CRBP, CRC, CSOD, CTIC, CTMX, CTOS, CTRE, CTT, CTVA, CVCO, CVET, CVNA, CWK, CYRX, CYTK, CZNC, DBRG, DBX, DDOG, DEN, DHX, DIN, DIOD, DLA, DLX, DMLP, DMRC, DNN, DOCN, DRH, DRNA, DUK, DWSN, DXPE, DXYN, DYN, EB, ECOM, ECOR, ED, EFC, EGLE, EIGR, ELOX, ELY, ELYS, ENDP, ENG, ENSV, ENTA, ENV, EPAM, EPC, EPIX, ERF, ERII, ESCA, ESTE, ETTX, EVC, EVOK, EVRG, EXEL, EXPE, EYEG, FAT, FCRD, FDUS, FEYE, FLDM, FLS, FND, FNKO, FOCS, FOLD, FOUR, FOXF, FPH, FROG, FSR, FTSI, FVRR, G, GBNH, GCP, GDEN, GDP, GDYN, GENC, GEOS, GERN, GH, GIL, GKOS, GLMD, GLPG, GLYC, GNE, GNL, GOGO, GOLF, GPL, GPOR, GPRO, GRPN, GSAT, GSBD, GSL, GTH, GTN, GTN.A, GTS, GTYH, HASI, HBI, HBIO, HCAT, HCI, HEAR, HII, HIMX, HL, HMHC, HNNA, HRTG, HTA, IBOC, IBP, ICAD, IDCC, IESC, IFF, IFRX, IGMS, IHC, IHRT, ILMN, IMH, IMKTA, ING, INOD, INS, INSM, IOVA, IRM, IRTC, IRWD, ISDR, ISIG, ITI, ITRI, ITRM, ITT, JCOM, JNCE, JYNT, K, KALA, KAMN, KDMN, KIDS, KPTI, KRP, KTB, KURA, KYMR, LAMR, LASR, LAUR, LAZY, LCTX, LCUT, LEE, LGF.A, LGF.B, LJPC, LNG, LNSR, LNT, LOCO, LOPE, LORL, LPCN, LQDT, LSPD, LTHM, LUMO, LXP, MAIN, MCHX, MDGL, MDRX, MDWD, MFA, MGEE, MGNI, MGTA, MGTX, MIRM, MITO, MKTY, MLAB, MMS, MNPR, MNST, MOSY, MP, MPLN, MRNA, MRNS, MRTX, MRUS, MSI, MTBC, MTEM, MTW, MTZ, MUR, MUX, MX, MXC, MYE, NATR, NBRV, NBY, NET, NEXT, NFE, NFG, NGVC, NH, NHC, NICE, NINE, NJR, NKTR, NNA, NNBR, NNI, NOG, NOMD, NRG, NS, NSIT, NTLA, NTRA, NTUS, NUZE, NVAX, NVMI, NVO, NWN, NWS, NWSA, NXTC, NYMT, OBSV, OCN, OCSL, OEC, OGE, OLED, OLP, OM, ONCT, ONTO, OPNT, OPRT, ORBC, ORTX, OTEX, OTRK, OUT, PAE, PALT, PASG, PBA, PBH, PBPB, PBYI, PCOR, PCSB, PCTY, PDEX, PECO, PEI, PENN, PFBI, PFIE, PFSI, PGNY, PH, PHAT, PHI, PHX, PK, PLM, PLUG, PMT, PNW, PODD, POST, PPL, PRA, PRAA, PRDO, PRI, PRMW, PRQR, PRTA, PRTS, PRTY, PRVB, PTGX, PTMN, PWFL, PWR, PZZA, QDEL, QTNT, QTRX, QUOT, RAMP, RBA, RC, RCUS, RDFN, RDUS, REFR, REG, REGN, REV, REZI, RGNX, RLJ, RMD, RMR, ROLL, RSLS, RUN, RVNC, SAND, SBBP, SBLK, SEAS, SELB, SEM, SFM, SGA, SGMO, SHAK, SHYF, SIF, SIGA, SKM, SLDB, SLRX, SMHI, SNEX, SPCE, SPH, SPKE, SPNT, SPRO, SPRT, SPXC, SR, SRE, SRG, SRLP, SRRA, SRTS, SSYS, STFC, STMP, STNG, STOR, STRO, STRT, STWD, SVC, SVM, SVRA, SWCH, SWIM, SWX, SYBX, SYN, SYNA, SYRS, TAL, TBIO, TCX, TDC, TDS, TDW, TECH, TEN, TG, TGH, TGP, THR, THS, TIPT, TK, TM, TMCI, TMDX, TMST, TMX, TNK, TPIC, TPL, TRGP, TRHC, TRI, TRIN, TRIP, TRUE, TRUP, TSP, TTOO, TTSH, TUEM, UEIC, UNIT, UONE, UONEK, USM, USPH, VCTR, VEL, VEON, VER, VG, VGR, VHI, VIAC, VIACA, VIR, VLDR, VMEO, VOR, VOYA, VRAY, VRNA, VRRM, VSAT, VST, VVI, VXRT, W, WCC, WD, WFCF, WLDN, WMS, WOW, WPRT, WRK, WSC, WSTG, WTRG, WTRH, WVE, WVFC, WWR, XEC, XENE, XERS, XLRN, XOMA, XRAY, XTNT, XXII, Y, YELP, YETI, YMAB, YMTX, YORW, Z, ZEUS, ZG, ZGNX, ZIXI, ZNGA, ZSAN, ZTS\n\n - Ex-div:\n\n  AFB, AMG, ARLP, BKEP, BSBR, CADE, CEQP, CFFN, CMCO, CMS, CVCY, ET, FCF, FE, FHI, FRAF, FRBA, GPP, HMLP, HSII, HWM, IBCP, INTC, LBC, LSBK, LW, MMLP, MMP, MPLX, NYCB, OMF, PCB, PCTI, PETS, PKOH, PNFP, PNM, PPBI, RELX, SIRI, SMBK, SUN, UL, WAFD, WFC, WHG\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.045%)\n    - 8-Week Bill Auction (previous: 0.045%)\n    - Challenger Job Cuts (previous: 20.476K)\n    - Continuing Jobless Claims (consensus: 3,260K, previous: 3,269K)\n    - Exports (previous: 204.99B)\n    - Fed Waller Speaks\n    - Imports (previous: 273.89B)\n    - Initial Jobless Claims (consensus: 384K, previous: 400K)\n    - Jobless Claims 4-Week Avg. (previous: 394.50K)\n    - Natural Gas Storage (previous: 36B)\n    - Trade Balance (consensus: -74.10B, previous: -71.20B)\n\n^^^^2021-08-04",
        "created_utc": 1628071224,
        "id": "h7ns60v",
        "score": 3,
        "subreddit": "RobinHood",
        "created": 1628100024.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  3rd of August\n\n\n\n## Upcoming events for Tuesday, August  3rd\n\n - Expected earnings:\n\n  ACOR, ADCT, AENZ, AFG, AHH, AIZ, AKAM, ALNY, ALTO, AME, AMGN, ANDE, ANIX, APAM, APEN, APRN, APT, APTO, AQST, AQUA, ARC, ARNC, ARVN, ATEC, ATI, ATKR, ATOM, ATVI, AVID, AVNS, AY, AYX, BABA, BEN, BGFV, BHC, BHG, BKEP, BKH, BLD, BLKB, BNFT, BNL, BP, BRY, BXC, BYFC, CAR, CDEV, CDLX, CDXC, CECE, CEIX, CERS, CFBK, CGBD, CHCT, CHSCP, CIX, CLDT, CLSK, CLX, CMI, CNR, COHR, COP, COUR, CPE, CPSI, CPSS, CRD.A, CRD.B, CRIS, CRK, CRNC, CRSR, CRVL, CSLT, CTSO, CW, CWEN, CWEN.A, CWH, CZR, DCPH, DD, DEA, DEI, DENN, DISCA, DISCB, DISCK, DK, DKL, DNB, DS, DSKE, DSX, DVA, DVN, EC, EDU, ELVT, ENLC, EPZM, ESPR, ET, ETN, ETRN, EVTC, EXPD, EZPW, FCNCA, FI, FICO, FIS, FMC, FNF, FNHC, FOE, FRG, FSP, FSTR, GBL, GBT, GDOT, GECC, GHL, GIC, GLDD, GLRE, GLT, GLTO, GMRE, GNW, GRBK, GTE, H, HEES, HEP, HLF, HLI, HLNE, HPP, HSC, HSIC, HSKA, HST, HY, HZN, IAA, ICFI, ICHR, IDN, IDRA, IGT, INCY, INFN, INGR, INN, INSP, INVE, IOSP, IPGP, IT, ITIC, IX, J, JAX, JAZZ, JBGS, KAI, KAR, KFRC, KKR, KLDO, KNSA, KOPN, KTOS, KWR, LCII, LDI, LDOS, LEU, LGIH, LHX, LIND, LLY, LPG, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, LYV, MANT, MAR, MCHP, MCRB, MCY, MDNA, MDXG, MEC, MGRC, MGY, MIC, MIME, MKL, MNOV, MNR, MNTX, MRCC, MRCY, MTCH, MTRN, MUFG, MYGN, NBIX, NCR, NCSM, NDLS, NE, NEWR, NKLA, NMIH, NNN, NPO, NPTN, NR, NRC, NSA, NVST, NVT, NVTA, OAS, OCFT, OCN, OI, OKE, OMI, OMP, ONCR, OPCH, OPTN, OSUR, OXY, PAA, PACB, PAGP, PAYC, PBI, PCRX, PEAK, PEG, PERI, PKOH, POWL, PRIM, PRO, PRU, PSA, PSB, PSX, PSXP, PTRS, PUMP, PVAC, QTS, QUAD, RCKY, RCM, RDN, RGA, RHP, RIBT, RIGL, RL, RM, RMRM, RNG, ROCK, RPAI, RRD, RVPH, RYAM, RYTM, SABR, SAGE, SATS, SEB, SEE, SHO, SKLZ, SKT, SKY, SKYT, SLRC, SND, SONY, SPT, SPWR, SQNS, SRC, SRNE, STAR, STIM, STLA, SUN, SUNS, TACT, TALO, TBPH, TCS, TDG, TISI, TNC, TRTX, TSLX, TSQ, TTEC, TX, UA, UAA, UBOH, UFPT, UNM, USAC, USCR, UTL, VAL, VECO, VERI, VNTR, VREX, VRSK, VVNT, WAT, WBT, WEC, WEYS, WHLR, WK, WLK, WLKP, WLTW, WMC, WMG, WRN, WSR, WTI, WTTR, XFOR, XHR, XP, XPER, XYL, ZBH, ZBRA\n\n - Ex-div:\n\n  ATR, BBD, BBDO, BCBP, EIG, ETRN, HFWA, MKTX, NTIC, SHEN\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - FOMC Member Clarida Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n    - Total Vehicle Sales (previous: 15.40M)\n\n## Upcoming events for Wednesday, August  4th\n\n - Expected earnings:\n\n  AAU, ABC, ABIO, AC, ACA, ACAD, ACEL, ACIU, ACLS, ACR, ADMA, ADPT, ADT, ADTN, AEIS, AERI, AFIN, AGL, ALB, ALE, ALG, ALIM, ALKT, ALL, ALLO, ALNA, ALRN, ALTM, AMED, AMOT, AMPE, AMPY, AMSC, ANGI, ANSS, APA, APO, ARLO, ARTNA, ASMB, ASTE, ASYS, ATO, ATRA, ATRC, ATTO, AVA, AXGN, BBSI, BCLI, BCOR, BCSF, BCYC, BDC, BDSI, BE, BFAM, BGCP, BKNG, BKTI, BLPH, BLUE, BNGO, BOOT, BRSP, BTG, BVH, BWA, CAMT, CCMP, CCRN, CCU, CDAY, CDW, CENT, CENTA, CENX, CFMS, CHNG, CIA, CIB, CIGI, CIM, CKPT, CLH, CLVS, CLW, CMLS, CMP, CPA, CPK, CPS, CRL, CRTO, CSGS, CSII, CSTE, CSWI, CUTR, CVGI, CVRX, CVS, CYAD, DAR, DCP, DFIN, DGII, DHC, DLHC, DMTK, DNOW, DOC, DOX, DRTT, DVAX, DXC, EA, ECPG, EDIT, EDRY, EGHT, ELF, EMKR, EMR, ENBL, EOG, EOLS, EQH, EQX, ERJ, ERO, ETR, ETSY, EVH, EVOP, EVRI, EXC, EXPI, EYPT, FATE, FCPT, FDP, FENC, FLMN, FLOW, FLT, FLXN, FOX, FOXA, FPI, FRGI, FRT, FSLY, FTDR, FUN, FVE, GDDY, GEL, GEO, GGB, GHC, GLAD, GLBZ, GM, GMED, GNK, GPRK, GRP.U, GRTS, GTHX, HARP, HBB, HCC, HDSN, HFC, HHC, HI, HMC, HNGR, HR, HRTX, HUBS, HWM, HYMC, HZNP, IAC, IAG, ICD, ICUI, IIPR, IMXI, INGN, INMB, INSG, IO, IONS, ISEE, ISSC, IVC, IVR, JACK, JLL, JRVR, KBAL, KE, KHC, KIN, KLIC, KRO, KRTX, KUKE, KW, KZR, LAND, LESL, LHCG, LILA, LILAK, LL, LMND, LMRK, LNC, LPI, LUMN, MAC, MASS, MAXR, MBI, MCK, MCS, MDCA, MDU, MED, MET, MFC, MGLN, MGM, MGPI, MIDD, MLR, MLVF, MNKD, MNRL, MNTV, MOD, MPC, MPLX, MRO, MTG, MTOR, MVIS, MWA, NC, NEPH, NESR, NEWT, NEX, NHTC, NI, NL, NMFC, NMR, NODK, NP, NSPR, NSTG, NTEC, NUS, NVRO, NWPX, NXST, NYT, OCDX, ODP, OESX, ONEM, OPRX, OR, ORA, ORCC, ORIC, OSPN, OTIC, OYST, PACE, PARR, PCSA, PDCE, PETQ, PFLT, PING, PIRS, PLMR, PLTK, PLUS, PLYA, PNNT, PROF, PSN, PSNL, PTVE, PW, QNST, QRVO, QTWO, QUIK, RCII, RCKT, RCL, REGI, RESN, RGR, RKT, RMAX, RMNI, RNWK, ROKU, RPD, RPT, RTLR, RVI, RVLV, RYI, RYN, SAFT, SALM, SANA, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGRY, SITE, SITM, SJI, SLCT, SLF, SLGL, SLNG, SMFG, SMG, SMP, SMSI, SPNS, SPR, SRDX, SRI, SRPT, SSRM, SSSS, STAA, STKL, STN, SUM, SUP, SUPN, SWM, TELL, TGB, TGI, TLC, TNDM, TPC, TPVG, TRC, TREC, TRMB, TRNO, TS, TSE, TT, TTGT, TUP, TVTY, TWNK, TWO, TXG, TXMD, UBER, UE, UFCS, UFI, UGI, UHAL, UIHC, ULCC, UMH, UPLD, URG, URGN, USDP, USWS, UTHR, UVV, VCEL, VIRT, VMC, VRCA, VRDN, VTOL, VVV, VWTR, VZIO, WCN, WDC, WLFC, WLL, WTS, WU, WYNN, XNCR, XPL, YELL, ZYME\n\n - Ex-div:\n\n  AWI, CATC, CCK, DKL, FELE, IBTX, IDA, KBH, MATX, NEP, NWBI, OFED, OPBK, SIMO, STBA, TGP, VBTX, VLO, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - FOMC Member Clarida Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n    - Total Vehicle Sales (previous: 15.40M)\n\n^^^^2021-08-03",
        "created_utc": 1627984814,
        "id": "h7jaqb2",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1628013614.0
    },
    {
        "author": "moniis",
        "body": "Flt is trending on wealthsimple, anyone know why?",
        "created_utc": 1628011764,
        "id": "h7kqb58",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628040564.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  2nd of August\n\n\n\n## Upcoming events for Monday, August  2nd\n\n - Stock splits:\n\n    - GE @ **1:8**\n\n - Expected earnings:\n\n  ACHC, ADUS, AIV, ALX, AMRC, ANET, APPF, ARAV, ARCB, ARGO, ASLN, AWK, AWR, BCC, BRKR, BRX, BSBK, BSM, BVN, BWXT, CINR, CLAR, CLNN, CLR, CNA, COLM, CORR, CRNT, CSR, CSWC, CVI, CX, DAC, DBVT, DSPG, DZSI, EARN, EML, EMN, EVER, FANG, FNCB, FREY, FRPT, GAIA, GAIN, GOOD, GPN, GPP, GPRE, GSMG, HAYW, HLIT, HMN, HSBC, IMUX, IPI, ITUB, IVAC, JELD, KDNY, KMT, KNBE, KRG, L, LEG, LU, LUB, METC, MFIN, MG, MOS, NERV, NETI, NPK, NSP, NXPI, O, OGS, OHI, ON, OTTR, PBHC, PEBK, PLOW, PXD, RACE, RADA, RARE, REKR, REYN, RGCO, RIG, RMBL, RMBS, SANM, SBAC, SBT, SCM, SEDG, SFST, SGU, SIBN, SPG, SPNE, STRL, SYKE, TA, TCMD, TCPC, TGTX, TKR, TREX, TSEM, TTI, TTWO, UAN, UCTT, UIS, UNVR, USAU, UTI, VMD, VNO, VNOM, VRNS, VTVT, WILC, WMB, WMK, WWD, XTNT, ZI\n\n - Ex-div:\n\n  BANR, CAG, CAPL, CBAN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, IGD, ITUB, LMRK, SAFM, SHLX, SPH, SRCE, SRLP, WBS, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.050%)\n    - 6-Month Bill Auction (previous: 0.050%)\n    - Construction Spending (consensus: 0.4%, previous: -0.3%)\n    - ISM Manufacturing Employment (previous: 49.9)\n    - ISM Manufacturing New Orders Index (previous: 66.0)\n    - ISM Manufacturing PMI (consensus: 60.9, previous: 60.6)\n    - ISM Manufacturing Prices (previous: 92.1)\n    - Investing.com Gold Index (actual: 58.5%, previous: 58.2%)\n    - Investing.com S&amp;P 500 Index (actual: 47.3%, previous: 42.2%)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 63.1, previous: 62.1)\n    - Total Vehicle Sales (previous: 15.40M)\n\n## Upcoming events for Tuesday, August  3rd\n\n - Expected earnings:\n\n  ACOR, ADCT, AENZ, AFG, AHH, AIZ, AJX, AKAM, ALNY, ALTO, AME, AMGN, ANDE, ANIX, APAM, APEN, APRN, APT, APTO, AQST, AQUA, ARC, ARNC, ARVN, ATEC, ATI, ATKR, ATOM, ATVI, AVID, AVNS, AY, AYX, BABA, BEN, BGFV, BHC, BHG, BKEP, BKH, BLD, BLKB, BNFT, BNL, BP, BRY, BXC, BYFC, CAR, CDEV, CDLX, CDXC, CECE, CEIX, CERS, CFBK, CGBD, CHCT, CHSCP, CIX, CLDT, CLSK, CLX, CMI, CNR, COHR, COP, COUR, CPE, CPSI, CPSS, CRD.A, CRD.B, CRIS, CRK, CRNC, CRSR, CRVL, CSLT, CTSO, CW, CWEN, CWEN.A, CWH, CZR, DCPH, DD, DEA, DEI, DENN, DISCA, DISCB, DISCK, DK, DKL, DNB, DS, DSKE, DSX, DVA, DVN, E, EC, EDU, ELVT, ENIA, ENLC, EPZM, ESPR, ET, ETN, ETRN, EVC, EVTC, EXPD, EZPW, FCNCA, FI, FICO, FIS, FMC, FNF, FNHC, FOE, FRG, FSP, FSTR, GBL, GBT, GDOT, GHL, GIC, GLDD, GLRE, GLT, GLTO, GMRE, GNW, GRBK, GTE, H, HEES, HEP, HLF, HLI, HLNE, HPP, HSC, HSIC, HSKA, HST, HY, HZN, IAA, ICFI, ICHR, IDN, IDRA, IGT, INCY, INFN, INGR, INN, INSP, INVE, IOSP, IPGP, IT, ITIC, IX, J, JAX, JAZZ, JBGS, KAI, KAR, KFRC, KKR, KLDO, KNSA, KOPN, KTOS, KWR, LCII, LDI, LDOS, LEU, LGIH, LHX, LIND, LLY, LPG, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, LYV, MANT, MAR, MCHP, MCRB, MCY, MDNA, MDXG, MEC, MGRC, MGY, MIC, MIME, MKL, MNOV, MNR, MNST, MNTX, MRCC, MRCY, MTCH, MTRN, MUFG, MYGN, NBIX, NCR, NCSM, NDLS, NE, NEWR, NKLA, NMIH, NNN, NPO, NPTN, NR, NRC, NSA, NVST, NVT, NVTA, OAS, OCFT, OCN, OI, OKE, OMI, OMP, ONCR, OPCH, OPTN, OSUR, OXY, PAA, PACB, PAGP, PAYC, PBI, PCRX, PEAK, PEG, PERI, PKOH, POWL, PRIM, PRO, PRU, PSA, PSB, PSX, PSXP, PTRS, PUMP, PVAC, QTS, QUAD, RCKY, RCM, RDN, RGA, RHP, RIBT, RIGL, RL, RM, RMRM, RNG, ROCK, RPAI, RRD, RVPH, RYAM, RYTM, SABR, SAGE, SEB, SEE, SHO, SKLZ, SKT, SKY, SKYT, SLRC, SND, SONY, SPT, SPWR, SQNS, SRC, SRNE, STAR, STIM, STLA, SUN, SUNS, SWI, TACT, TALO, TBPH, TCS, TDG, TISI, TNC, TRTX, TSLX, TSQ, TTEC, TX, UA, UAA, UBOH, UFPT, UNM, USAC, USCR, UTL, VAL, VECO, VERI, VNTR, VREX, VRSK, VVNT, WAT, WBT, WEC, WEYS, WHLR, WK, WLK, WLKP, WLTW, WMC, WMG, WRN, WSR, WTI, WTTR, WYNN, XFOR, XHR, XP, XPER, XYL, ZBH, ZBRA\n\n - Ex-div:\n\n  ATR, BBD, BBDO, BCBP, EIG, ETRN, HFWA, MKTX, NTIC, SHEN\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 2.000%)\n    - API Weekly Crude Oil Stock (previous: -4.728M)\n    - Durables Excluding Defense (previous: 1.0%)\n    - FOMC Member Bowman Speaks\n    - Factory Orders (consensus: 1.0%, previous: 1.7%)\n    - Factory orders ex transportation (previous: 0.7%)\n    - IBD/TIPP Economic Optimism (previous: 54.3)\n    - Redbook (previous: 16.0%)\n\n## Upcoming events for Wednesday, August  4th\n\n - Expected earnings:\n\n  AAU, ABC, ABIO, AC, ACA, ACAD, ACEL, ACIU, ACLS, ACR, ADMA, ADPT, ADT, ADTN, AEIS, AERI, AFIN, AGL, ALB, ALE, ALG, ALIM, ALKT, ALL, ALLO, ALNA, ALRN, ALTM, AMED, AMOT, AMPE, AMPY, AMSC, ANGI, ANSS, ANVS, APA, APO, ARLO, ARNA, ARTNA, ASMB, ASTE, ASYS, ATO, ATRA, ATRC, ATTO, AVA, AXGN, BBSI, BCLI, BCOR, BCSF, BCYC, BDC, BDSI, BE, BFAM, BFIN, BGCP, BKNG, BKTI, BLPH, BLUE, BNGO, BOOT, BRSP, BTG, BWA, CAMT, CCMP, CCRN, CCU, CDAY, CDW, CENT, CENTA, CENX, CFMS, CHNG, CIA, CIB, CIGI, CIM, CKPT, CLH, CLLS, CLVS, CLW, CMLS, CMP, CPA, CPK, CPS, CRL, CRTO, CSGS, CSII, CSTE, CSWI, CUTR, CVGI, CVRX, CVS, CYAD, DAR, DCP, DFIN, DGII, DHC, DLHC, DMTK, DNOW, DOC, DOX, DRTT, DVAX, DXC, EA, ECPG, EDIT, EDRY, EGHT, ELF, EMKR, EMR, ENBL, EOG, EOLS, EQH, EQX, ERJ, ERO, ETR, ETSY, EVH, EVOP, EVRI, EXC, EXPI, EYPT, FATE, FCPT, FDP, FENC, FLMN, FLOW, FLT, FLXN, FOX, FOXA, FRGI, FRPH, FRT, FSLY, FTDR, FUN, FVE, GDDY, GEL, GGB, GHC, GLAD, GLBZ, GM, GMED, GNK, GPRK, GRP.U, GRTS, GTHX, HARP, HBB, HCC, HDSN, HFC, HHC, HI, HMC, HNGR, HR, HRTX, HUBS, HWM, HYMC, HZNP, IAC, IAG, ICD, ICUI, IIPR, IMXI, INGN, INMB, INSG, IO, IONS, ISEE, ISSC, IVC, IVR, JACK, JLL, JRVR, KBAL, KE, KHC, KIN, KLIC, KRO, KRTX, KUKE, KW, KZR, LAND, LESL, LEVL, LHCG, LILA, LILAK, LL, LMND, LMRK, LNC, LPI, LUMN, MAC, MASS, MAXR, MBI, MCK, MCS, MDCA, MDU, MED, MET, MFC, MGLN, MGM, MGPI, MIDD, MLR, MLVF, MNKD, MNRL, MNTV, MOD, MPC, MPLX, MRO, MTG, MTOR, MVIS, MWA, NC, NEPH, NESR, NEWT, NEX, NHTC, NI, NL, NMFC, NMR, NODK, NP, NSPR, NSTG, NTEC, NUS, NVRO, NWPX, NXST, NYT, OCDX, ODP, OESX, ONEM, OPRX, OR, ORA, ORCC, ORIC, OSPN, OTIC, OYST, PACE, PARR, PCSA, PDCE, PETQ, PFIE, PFLT, PING, PIRS, PLMR, PLTK, PLUS, PLYA, PNNT, PROF, PSN, PSNL, PTVE, PW, QNST, QRVO, QTWO, QUIK, RCII, RCKT, RCL, REGI, RESN, RGR, RKT, RMAX, RMNI, RNWK, ROKU, RPD, RPT, RTLR, RVI, RVLV, RYI, RYN, SAFT, SALM, SANA, SBGI, SBOW, SBRA, SCU, SD, SENEA, SENEB, SGMO, SGRY, SITE, SITM, SJI, SLCT, SLF, SLGL, SLNG, SMFG, SMG, SMP, SMSI, SPNS, SPR, SRDX, SRI, SRPT, SSRM, SSSS, STAA, STKL, STN, SUM, SUP, SUPN, SWM, TELL, TGB, TGI, TIPT, TLC, TNDM, TPC, TPVG, TRC, TREC, TRMB, TRNO, TS, TSE, TT, TTGT, TUP, TVTY, TWNK, TWO, TXG, TXMD, UBER, UE, UFCS, UFI, UGI, UHAL, UIHC, ULCC, UMH, UPLD, URG, URGN, USDP, USWS, UTHR, UVV, VCEL, VGR, VIRT, VMC, VRCA, VRDN, VTOL, VVV, VWTR, VZIO, WCN, WDC, WLFC, WLL, WTS, WU, XNCR, XPL, YELL, ZYME\n\n - Ex-div:\n\n  AWI, CATC, CCK, DKL, FELE, IBTX, IDA, KBH, MATX, NEP, NWBI, OFED, OPBK, SIMO, STBA, TGP, VBTX, VLO, WSFS, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 700K, previous: 692K)\n    - Crude Oil Imports (previous: -0.616M)\n    - Crude Oil Inventories (previous: -4.089M)\n    - Cushing Crude Oil Inventories (previous: -1.268M)\n    - Distillate Fuel Production (previous: -0.163M)\n    - EIA Refinery Crude Runs  (previous: -0.132M)\n    - EIA Weekly Distillates Stocks (consensus: -0.435M, previous: -3.088M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.4%, previous: -0.3%)\n    - FOMC Member Clarida Speaks\n    - Gasoline Inventories (consensus: -0.916M, previous: -2.253M)\n    - Gasoline Production (previous: 0.649M)\n    - Heating Oil Stockpiles (previous: 0.108M)\n    - ISM Non-Manufacturing Business Activity (previous: 60.4)\n    - ISM Non-Manufacturing Employment (previous: 49.3)\n    - ISM Non-Manufacturing New Orders (previous: 62.1)\n    - ISM Non-Manufacturing PMI (consensus: 60.4, previous: 60.1)\n    - ISM Non-Manufacturing Prices (previous: 79.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.01%)\n    - MBA Mortgage Applications (previous: 5.7%)\n    - MBA Purchase Index (previous: 251.7)\n    - Markit Composite PMI (previous: 59.7)\n    - Mortgage Market Index (previous: 737.9)\n    - Mortgage Market Index (previous: 737.9)\n    - Mortgage Refinance Index (previous: 3,570.4)\n    - Services PMI (previous: 59.8)\n\n^^^^2021-08-02",
        "created_utc": 1627898416,
        "id": "h7evcd0",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1627927216.0
    },
    {
        "author": "rigatoni-man",
        "body": "Ever sell some calls and wonder what absolute fucking moron bought them.\n\nHi, nice to meet you.  What is your return policy btw? I paid with PayPal and my trendies never arrived",
        "created_utc": 1627960224,
        "id": "h7iddhu",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1627989024.0
    },
    {
        "author": "IM_HERE_FOR_FUN",
        "body": "I'm going in on PYPL FDs tomorrow, there market cap is huge and I think they could easily jump back 20 dollars, remember I am a idiot",
        "created_utc": 1627949141,
        "id": "h7hqmuy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627977941.0
    },
    {
        "author": "LasagnaWater",
        "body": "If PYPL and BABA can pump up like 20-30 points each tomorrow (not asking for much) so I can not be rich but not be poor that would be chill",
        "created_utc": 1627874575,
        "id": "h7e0kox",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627903375.0
    },
    {
        "author": "akironman",
        "body": "Pypl",
        "created_utc": 1627993039,
        "id": "h7jlzo1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628021839.0
    },
    {
        "author": "cheerfulwish",
        "body": "Excellent PayPal joke sir!",
        "created_utc": 1627960291,
        "id": "h7idhv0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627989091.0
    },
    {
        "author": "Ben_Shapiroh",
        "body": "Everything you’ve mentioned points to PayPal or Apple being a much better suited for BNPL globally though - I would be concerned if I was a Square investor.",
        "created_utc": 1627962820,
        "id": "h7ii2s8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627991620.0
    },
    {
        "author": "Grits_N_Gravy_23",
        "body": "PYPL",
        "created_utc": 1627955888,
        "id": "h7i4ry0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627984688.0
    },
    {
        "author": "painterjo",
        "body": "In RBLX 85C UPS 205C and PYPL 285C for this week.\n\nI’m probably an idiot, but I’m betting on a rebound for these.",
        "created_utc": 1627953702,
        "id": "h7i081e",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627982502.0
    },
    {
        "author": "_foldLeft",
        "body": "&gt;It cant be that hard to make a bnpl service if there are so many different ones out there already.   \n\nProduct software is incredibly hard. It's not just about building the software, is much, _much_ more than that. I don't think there's _so many_ of these companies either - AFTPY, AFRM, Klarna, and technically PYPL are the major ones I'm aware of. Acquiring a company can be incredibly cheaper with a higher probability of success in regards to entering the market you're trying to get into.  \nMaybe they overpaid, but strangely enough the market didn't respond in that way and it'll take awhile to actually say for sure anyway",
        "created_utc": 1627958885,
        "id": "h7iat2j",
        "score": 1,
        "subreddit": "investing",
        "created": 1627987685.0
    },
    {
        "author": "Master_Proposal_3614",
        "body": "Cramer said to buy paypal.",
        "created_utc": 1627964917,
        "id": "h7ilkom",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627993717.0
    },
    {
        "author": "4moneystuff",
        "body": "So I just did a straddle or a strangle or just a credit spread, I don't know - anyway, what do you guys think?\n\nSold a 260 Put Aug 20 on PYPL and then bought a 287.5 Call, same expiry for a $15 credit.\n\nIs this stupid? What could I have done better?",
        "created_utc": 1627966807,
        "id": "h7ioiym",
        "score": 1,
        "subreddit": "options",
        "created": 1627995607.0
    },
    {
        "author": "_igg",
        "body": "Just got done working the Wendy’s dumpsters. Needed to make some cash after playing PYPL and AMZN earnings last week. How’s my CRSR calls today?",
        "created_utc": 1627990838,
        "id": "h7jilll",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628019638.0
    },
    {
        "author": "huynhorlose",
        "body": "PayPal already has a “buy now pay later” option, and with Apple already working on developing one it’s a smart time.\n\nIt would take at least 2 years to develop this with another year+ for consumers to be comfortable using a “new” product and work out the kinks. \n\nAt that point $SQ is now almost 4 years behind its competitors and with essentially 0 customers",
        "created_utc": 1627958751,
        "id": "h7iajtt",
        "score": 1,
        "subreddit": "investing",
        "created": 1627987551.0
    },
    {
        "author": "MordorBlues",
        "body": "PYPL near support...dipped toes in today, see how she goes.",
        "created_utc": 1627952417,
        "id": "h7hxiy1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627981217.0
    },
    {
        "author": "bloodyplonker",
        "body": "Your comment is naive and childish at best. You've provided no reasoning on how disruption could happen. ASML has an utter, total, and complete monopoly on those multi-hundred million dollar precision chip cutting machines. Let me ask you this: what kind of company will have the capital and time to be able to newly invent, produce and manufacture multi-hundred million dollar chip and likely fail multiple times in the process? Why would any company go into that when they could do something else and not have to compete with a monopoly?\n\nPaypal, on the other hand is not a monopoly. They have tons of innovative competitors attacking them from all sides, all verticals of their business, including companies like Square and Affirm.",
        "created_utc": 1627874713,
        "id": "h7e0tl0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627903513.0
    },
    {
        "author": "MasonAFK1",
        "body": "Is there enough room for PayPal to coexist with the Venmos of the world? I personally use PayPal but I so know a ton of my friends only have Venmo",
        "created_utc": 1627856957,
        "id": "h7d3fk6",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627885757.0
    },
    {
        "author": "apooroldinvestor",
        "body": "You bought 100 shares PYPL?  You must be rich .....",
        "created_utc": 1627851817,
        "id": "h7cszhl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627880617.0
    },
    {
        "author": "Jimminycrickets411",
        "body": "PayPal just came down so I’ll get some of that tomorrowi have some google too but I just hate buying things at all time highs",
        "created_utc": 1627863670,
        "id": "h7dg8sb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627892470.0
    },
    {
        "author": "iPoopWithMyJordansOn",
        "body": "Ok guys and gals - Lets talk Paypal and Pinterest. My gf's uncle said \"he bought the dip\" on Paypal and my homie said Pinterest dealing with some Melvin Capital struggles, wanna see what your thoughts are on these. Any good entry points for options/debit spreads? or bad play? Jimmy Chill, what are your thoughts?",
        "created_utc": 1627864295,
        "id": "h7dheg1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627893095.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I would still own PYPL, just reduce to maybe 1% or so.",
        "created_utc": 1627876073,
        "id": "h7e38sy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627904873.0
    },
    {
        "author": "WolfPackWSB",
        "body": "Had a feeling that would happen!! So many people used it over the last 12months, either Square or PayPal would’ve went for it",
        "created_utc": 1627872108,
        "id": "h7dw4rh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627900908.0
    },
    {
        "author": "juaggo_",
        "body": "Man that buy now, pay later scene is getting crowded. You got PayPal, Affirm, Klarna, Apple is doing their own bit with Goldman Sachs and now Square with its acquisiton of Afterpay.",
        "created_utc": 1627857584,
        "id": "h7d4nwn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627886384.0
    },
    {
        "author": "Abs_of_steel",
        "body": "Bought the PYPL dip on Thursday, turns out I swung a little early. In hindsight,  it hadn't bounced off of support then, but hopefully Friday's dip was the last of it. 20C $290 8/20.",
        "created_utc": 1627857813,
        "id": "h7d547g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627886613.0
    },
    {
        "author": "czechyerself",
        "body": "I don’t touch anything like NIO or the others you name. I’ve been burned and lost my collateral on spreads on those. I sell put spreads on blue chip growth stocks, stuff like NIO PLTR WKHS is too unpredictable. A typical month I sell Iron Condors on SPY IWM DIA, put spreads on AAPL MSFT FB PYPL and covered calls on the stocks I’m holding. My experience is to avoid options spreads on meme stocks, you’ll go broke",
        "created_utc": 1627859719,
        "id": "h7d8u3q",
        "score": 1,
        "subreddit": "options",
        "created": 1627888519.0
    },
    {
        "author": "motterpaul",
        "body": "Josh just happened to mention that PayPal also has BNPL option 3 minutes before close, and has had it for a while and didn't have to pay $20-billion to get it.",
        "created_utc": 1627935460,
        "id": "h7gwr9x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627964260.0
    },
    {
        "author": "ddevera98",
        "body": "Got into Paypal 2 days ago.  Just like Jesus my portfolio will rise again on the 3rd day.",
        "created_utc": 1627936693,
        "id": "h7gzk0n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627965493.0
    },
    {
        "author": "mamadidntraiseabitch",
        "body": "I’m in for SQ hopefully we reach new ATHs if they surprise with good guidance\n\nSeems like the bar is set low already due to PYPL too",
        "created_utc": 1627844759,
        "id": "h7ce6zj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627873559.0
    },
    {
        "author": "hugh_g_reckshon",
        "body": "Did you not look at their earnings reports? PayPal and Amazon had huge misses. Google for example smashed earnings and has kept going up as a result. Stop cherry picking data to support your bias.",
        "created_utc": 1627831282,
        "id": "h7blbe1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627860082.0
    },
    {
        "author": "PlayfulInstance2808",
        "body": "I agree that a partnership with Klarna. Afterpay or even PayPal would show that they are not competing with these larger players but instead can work with them in a waterfall approach.",
        "created_utc": 1627846218,
        "id": "h7ch8k5",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1627875018.0
    },
    {
        "author": "DoneDidNothing",
        "body": "I honestly dont know anybody that uses cash app, We usually send each other money through Zelle, Venmo and Paypal. I feel like they have pumped their numbers artificially by sending free money through the cash app promotion on Twitter.",
        "created_utc": 1627912806,
        "id": "h7fh8om",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627941606.0
    },
    {
        "author": "zanif",
        "body": "SQ ripping on overpaying for a feature PYPL was able to build in house... I have calls though so not complaining. Really thought this play was dead.",
        "created_utc": 1627912225,
        "id": "h7fg2rf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627941025.0
    },
    {
        "author": "motterpaul",
        "body": "I don't understand PYPL selloff. Hasn't it been a BNPL player itself for several years now?",
        "created_utc": 1627928279,
        "id": "h7gga27",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627957079.0
    },
    {
        "author": "Abs_of_steel",
        "body": "Same boat: 20C 290 8/20 purchased last week, -72% atm. But PYPL on a 10% discount from its recent peak? I imagine that some big fish will bite this week.",
        "created_utc": 1627929794,
        "id": "h7gjrw6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627958594.0
    },
    {
        "author": "Thazhowzitiz02",
        "body": "What are your thoughts with PYPL?? Should I hold or let it go? Sad to see it fall so dramatically.",
        "created_utc": 1627924342,
        "id": "h7g778n",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627953142.0
    },
    {
        "author": "PutsOnYourWife",
        "body": "PYPL keeps bleeding",
        "created_utc": 1627923794,
        "id": "h7g5x9g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627952594.0
    },
    {
        "author": "Dr_NoWayKraut",
        "body": "Paypal owns Venmo.",
        "created_utc": 1627895989,
        "id": "h7eslq1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627924789.0
    },
    {
        "author": "grcli0110",
        "body": "PYPL already offers BNPL",
        "created_utc": 1627889220,
        "id": "h7el4xa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627918020.0
    },
    {
        "author": "biologischeavocado",
        "body": "I agree, paypal is like a coding camp iphone app and ASML is like an OS. Every greasy robinhood employee can do what paypal does.",
        "created_utc": 1627892623,
        "id": "h7eoxk8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627921423.0
    },
    {
        "author": "Tayfunc",
        "body": "Should i invest in SQ or PayPal?",
        "created_utc": 1627928103,
        "id": "h7gfvhy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627956903.0
    },
    {
        "author": "clarence_worley90",
        "body": "how can SQ be up 13% on news like this and paypal be flat ?\n\nmakes no sense\n\npeople forgot theres a sell button",
        "created_utc": 1627928961,
        "id": "h7ghues",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627957761.0
    },
    {
        "author": "decisions4me",
        "body": "google seems to be climbing but it has climbed so much already it might have a correction soon. \n\nand PayPal seem to be in a downtrend \n\nSo no to both for this Monday.",
        "created_utc": 1627902708,
        "id": "h7f0hel",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627931508.0
    },
    {
        "author": "JayFql",
        "body": "late fees, and im sure you'll be barred from using it again if you dont pay.\nPaypal obviously thinks its worth the risk, im pretty sure they dont offer pay in 4 to everyone, you have to meet criteria. I use it all the fuckin time just because i can lol",
        "created_utc": 1627878118,
        "id": "h7e6l91",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627906918.0
    },
    {
        "author": "Vincent20309",
        "body": "I don’t see PayPal disappearing any time soon. Definite buy for me!",
        "created_utc": 1627878074,
        "id": "h7e6isz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627906874.0
    },
    {
        "author": "PrincPaco",
        "body": "DD on your preferred payment provider. PYPL",
        "created_utc": 1627940323,
        "id": "h7h7pwc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627969123.0
    },
    {
        "author": "Kay312010",
        "body": "FB\n\nMSFT\n\nPYPL\n\nTGT\n\nROKU",
        "created_utc": 1627957951,
        "id": "h7i8yua",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627986751.0
    },
    {
        "author": "Laurensio_",
        "body": "Where my TA guys at? Already time for PYPL calls yet?",
        "created_utc": 1627939791,
        "id": "h7h6jcz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627968591.0
    },
    {
        "author": "HerrJemine123",
        "body": "Sold the PYPL top this time, feels good. Waiting till eom with getting back in, this month seems fucky",
        "created_utc": 1627933339,
        "id": "h7grx7g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627962139.0
    },
    {
        "author": "clev3211",
        "body": "Ah... You mean the Chief Marketing Officer who has been there less than 1 year who decided to cash out on a $3.5M payday? A person who's background includes multiple years at Facebook, Paypal, and Amazon in Director and/or VP roles?\n\nI don't think she's too concerned about \"loyalties\" and future growth. She also isn't one in since the beginning who's built the company from the ground up.",
        "created_utc": 1627930353,
        "id": "h7gl2oa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627959153.0
    },
    {
        "author": "r00t1",
        "body": "Additionally -   \n\nPayPal created their afterpay solution from scratch in a few months.  \n\nKlarna, Affirm, and now Apple are serious competitors.",
        "created_utc": 1627955264,
        "id": "h7i3h4v",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627984064.0
    },
    {
        "author": "on-the-gang",
        "body": "PYPL",
        "created_utc": 1627928152,
        "id": "h7gfzm8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627956952.0
    },
    {
        "author": "MassHugeAtom",
        "body": "Jack really understands his investors well. All about that massive risk in spending to gain more users and revenue. Hopefully he will get some eth soon. Next year sq will probably surpass PayPal In terms of revenue. Also they should dilute twtr and get unity for 35 billion expanding on NFT and metaverse.",
        "created_utc": 1627912263,
        "id": "h7fg5hd",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627941063.0
    },
    {
        "author": "stevoacp1",
        "body": "so PYPL gets smoked for barely missing revenue while SQ misses earnings and overpays for a feature PYPL built in house and rips. make sense",
        "created_utc": 1627912771,
        "id": "h7fh66g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627941571.0
    },
    {
        "author": "LasagnaWater",
        "body": "PYPL is taking a lead pipe to both my kneecaps right now. Just copy what SQ is doing christ its not that hard",
        "created_utc": 1627928961,
        "id": "h7ghudu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627957761.0
    },
    {
        "author": "TheGreatLoudini",
        "body": "Are we feeling a PYPL comeback over the next month? Or am I fucked",
        "created_utc": 1627924160,
        "id": "h7g6rw5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627952960.0
    },
    {
        "author": "_hiddenscout",
        "body": "What’s your strategy with the stock? What else would you want to buy? \n\nIMO PYPL is a forever hold and would only sale when I needed the money. I’m also long with them.",
        "created_utc": 1627924490,
        "id": "h7g7jp4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627953290.0
    },
    {
        "author": "Thazhowzitiz02",
        "body": "Are you selling PYPL? Or buying more on this dip?",
        "created_utc": 1627924388,
        "id": "h7g7b1o",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627953188.0
    },
    {
        "author": "ASmootyOperator",
        "body": "SQ is ahead of PayPal when it comes to installment acquisition atm",
        "created_utc": 1627921344,
        "id": "h7g05r0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627950144.0
    },
    {
        "author": "czechyerself",
        "body": "Correct or there are sites that monitor IV. For example, PYPL has IV that changes. I get more premium depending on IV but still hold",
        "created_utc": 1627904649,
        "id": "h7f3439",
        "score": 1,
        "subreddit": "options",
        "created": 1627933449.0
    },
    {
        "author": "coolcomfort123",
        "body": "Bullish on both paypal and square, these 2 revenue grow healthy and keep attracting young people to use, own these 2 stocks and keep holding.",
        "created_utc": 1627917997,
        "id": "h7fsg0r",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627946797.0
    },
    {
        "author": "Desert_Haze_",
        "body": "SQ is going to touch PYPL market cap.",
        "created_utc": 1627917454,
        "id": "h7fr8if",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627946254.0
    },
    {
        "author": "DCook0308",
        "body": "How’s PYPL gonna react to that SQ acquisition?",
        "created_utc": 1627887818,
        "id": "h7ejj9u",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627916618.0
    },
    {
        "author": "UnknownEssence",
        "body": "Crypto buying is on PayPal and Venmo too now. CashApp isn't special.",
        "created_utc": 1627996888,
        "id": "h7jsvkz",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628025688.0
    },
    {
        "author": "kenyard",
        "body": "Much of tech especially Fintech has been on a climb e.g. pypl, sq.    \n    \nI'd argue sq is overvalued for sure there's a good bear case.    \nThese other stocks though I think will continue climbing and growing and more stuff is moving digital every day",
        "created_utc": 1627980858,
        "id": "h7j69cw",
        "score": 1,
        "subreddit": "options",
        "created": 1628009658.0
    },
    {
        "author": "niftyifty",
        "body": "Purely anecdotal but I have gone from avoiding PayPal for the last 15 years to using it as my go to online payment preference. I’m not sure if this is actually true, but it seems safer entering PayPal info than actual credit card data.",
        "created_utc": 1627876380,
        "id": "h7e3rvj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627905180.0
    },
    {
        "author": "agentdarklord",
        "body": "I agree. I am not saying PayPal is worse. They can both do well concurrently.",
        "created_utc": 1627810266,
        "id": "h7ap5ge",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627839066.0
    },
    {
        "author": "Billy-Klein",
        "body": "Thoughts on $PYPL?",
        "created_utc": 1627810681,
        "id": "h7aplt1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627839481.0
    },
    {
        "author": "StopTheBan420",
        "body": "Lol you didn’t learn from PayPal or Amazon or Facebook or Netflix or Tesla or any of them huh",
        "created_utc": 1627809531,
        "id": "h7aocyk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627838331.0
    },
    {
        "author": "MasonAFK1",
        "body": "Understandable. Honestly, I mostly use the rule of buying what you use (with most my money in VTI). I use PayPal and like their stock! This is my first year in my Roth and I'm using it as a huge learning opportunity.",
        "created_utc": 1627866440,
        "id": "h7dlek3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627895240.0
    },
    {
        "author": "Various_Baseball_458",
        "body": "It’s all a learning process. I also like to invest in things I use. I bought PayPal during March of 2020, and plan on holding long term.",
        "created_utc": 1627868006,
        "id": "h7doddk",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627896806.0
    },
    {
        "author": "MyNamePlusaNumber",
        "body": "In my opinion, an absolute yes for Paypal. I bought on Friday and will buy more tomorrow if it dips any.",
        "created_utc": 1627877332,
        "id": "h7e5c2l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627906132.0
    },
    {
        "author": "Own-Philosopher-1974",
        "body": "PayPal still considers me a user and I haven’t used their platform since 2014. Lol\n\nI am getting emails on an old email account from them as if I am still a ongoing user.",
        "created_utc": 1627858527,
        "id": "h7d6jap",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627887327.0
    },
    {
        "author": "apooroldinvestor",
        "body": "How many stocks do you have? I have about 22 right now.  I have about 4% in PYPL.  Still up 27% in less than a year!",
        "created_utc": 1627852505,
        "id": "h7cue98",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627881305.0
    },
    {
        "author": "makaros622",
        "body": "so better Paypal or SQ for the long run?",
        "created_utc": 1627977480,
        "id": "h7j2fhq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628006280.0
    },
    {
        "author": "CantStopWatchingVids",
        "body": "And Square. And ROKU. And Zillow. And PayPal. And Lending Club. And Amazon. And Crispr. And Meli. And Twilio. And all the other major tech holdings of hers that are up 100s if not thousands of percent…",
        "created_utc": 1627977421,
        "id": "h7j2d0b",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1628006221.0
    },
    {
        "author": "4moneystuff",
        "body": "A bit of a contra play - Paypal consistently beats estimates in earnings, and did so recently, but because the limelight has been stolen by SQ - I'm thinking PYPL is nearing bottom and took the opportunity to get in - I'm bullish overall on PYPL and don't mind being assigned.  \nBought the call as I saw that it's premium was less than what I sold the put for, so if the price rises, I can profit from the call.",
        "created_utc": 1627975827,
        "id": "h7j0irw",
        "score": 1,
        "subreddit": "options",
        "created": 1628004627.0
    },
    {
        "author": "PerkyCake",
        "body": "Paypal",
        "created_utc": 1627984833,
        "id": "h7jar3k",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628013633.0
    },
    {
        "author": "Laurensio_",
        "body": "All in on SBUX or PYPL september calls?",
        "created_utc": 1627940515,
        "id": "h7h84xw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627969315.0
    },
    {
        "author": "stringtheory28",
        "body": "Bought some PYPL. 10% discount from ATH ain’t bad.",
        "created_utc": 1627933486,
        "id": "h7gs9io",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627962286.0
    },
    {
        "author": "MajesticNectarine",
        "body": "But doesn’t SQ and PYPL still accept V and MA? I guess I’m confused on how SQ bad PYPL are hurting V and MA. Wouldn’t this increase V and MA revenue because more people can accept their cards?",
        "created_utc": 1627932504,
        "id": "h7gq0d1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627961304.0
    },
    {
        "author": "LePootPootJames",
        "body": "PYPL you have cucked me for the last time. Ima sell CCs on your ass.",
        "created_utc": 1627931896,
        "id": "h7goltu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627960696.0
    },
    {
        "author": "apooroldinvestor",
        "body": "I doubt PYPL will die. But yeah, I view ASML as a lot safer.  $10k in ASML in 2011 is now $260k! Wow!",
        "created_utc": 1627957531,
        "id": "h7i84pn",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627986331.0
    },
    {
        "author": "MasonAFK1",
        "body": "&gt;Venmo is crushing it\n\nThat seems to be the consensus here and I, as a millennial, know a ton of people using it over PayPal. I have been entrenched in PayPal since I was 16 and was selling stuff on eBay .",
        "created_utc": 1627856884,
        "id": "h7d3acx",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627885684.0
    },
    {
        "author": "apooroldinvestor",
        "body": "What will PYPL share price be in 5 years? .... There's your answer.  Think long always.",
        "created_utc": 1627851747,
        "id": "h7csuee",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627880547.0
    },
    {
        "author": "juaggo_",
        "body": "So in the beginning, PayPal was trying to get as much as users in the platform as possible. Now that there is 10s of millions, they’ve started to effectively monetize their userbase. You have had the opportunity to buy, hold and sell digital currencies since this April. That is a brilliant addition for Venmo, that is especially favoured among millenials. \n\nSome small businesses have been using Venmo for payments, so there’s definately more things to do in Venmo than there was a couple of years ago. The growth isn’t stopping, and that’s why Venmo will be a cash cow.",
        "created_utc": 1627853517,
        "id": "h7cwgyf",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627882317.0
    },
    {
        "author": "Various_Baseball_458",
        "body": "PayPal owns Venmo",
        "created_utc": 1627857158,
        "id": "h7d3tru",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627885958.0
    },
    {
        "author": "juaggo_",
        "body": "PayPal is a strong fundamental play. They missed their revenue estimates because ebay is finally transitioning out of PayPal’s platform. \n\nTheir userbase is growing still despite already being big with now 403 million users. Venmo is starting to be a cash cow. \n\nEcommerce will stay in our lifes. PayPal plays a big part in that and is a huge fintech giant. That’s why you should be in.",
        "created_utc": 1627852489,
        "id": "h7cud50",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627881289.0
    },
    {
        "author": "Summebride",
        "body": "There's two schools of thought right now.  One is that PYPL had run too far, too fast, and is heading back to a more fair value.  That, plus increasing competition in payments forms a thesis that PayPal is going below $250 again.  \n\nThere's another school that says the drop was a mistake, a knee jerk response to a surprise dip... but that the dip shouldn't have been a surprise because the EBay breakup was a known known, and just happened slightly earlier than expected.  That school also feels that Venmo is a juggernaut so the existence of competition doesn't bother them.\n\nI've had a small position and my thesis was a bit of each, but I held through earnings with the intent to sell if it popped.  That didn't happen so I had to make a new plan.  I still intend to sell, but now I'm looking to do so into strength when people realize the earnings sell off was a bit much.  Murphy's Law may prevent that, as the story that \"there's lots of competition\" is one that can be told today, whereas \"Venmo is crushing it\" is a story that will more likely be told in slower quarterly instalments.",
        "created_utc": 1627852702,
        "id": "h7cut2y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627881502.0
    },
    {
        "author": "mamadidntraiseabitch",
        "body": "Think SQ still has room to run with the downtrend of PYPL",
        "created_utc": 1627823364,
        "id": "h7b5qx0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627852164.0
    },
    {
        "author": "AgyleArgyle",
        "body": "I agree. Square “spent” 29 billion aka 25% of its market cap to buy afterpay. Paying PS of 40 for its 500 mil revenue generated through 10 billion is BNPL TPV (buy now pay later total payment volume). And by spent, I mean diluted it’s share holders in an all stock deal. To add what PayPal did on a whim 3 quarters ago without dropping a dime. And PayPal’s most recent quarter had 1.5 billion BNPL TPV. For an annual run rate of 6 billion. For free. No dilution. Didn’t buy affirm or klarna.",
        "created_utc": 1627961653,
        "id": "h7ifzo3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627990453.0
    },
    {
        "author": "edgedrazor",
        "body": "I need PYPL at $280 and FB at $360 by the end of the fucking month or I’m fuuuuucked",
        "created_utc": 1627977975,
        "id": "h7j30b7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628006775.0
    },
    {
        "author": "vacchagotta_on_fire",
        "body": "As someone mentioned PayPal = Venmo, but there is still plenty of competition in the app-based payment space (Square, Google, and Apple to name a few).\n\nPayPal may be on top now when it comes to app-based payments like Venmo but that does not mean other Big Tech companies are just going to concede the space. \n\nSomething to be aware of as you invest. I personally do plan to buy the PYPL dip--but not yet. I think it has further to go, especially after the guidance given doesn't predict any revenue growth for the next quarter.",
        "created_utc": 1627866395,
        "id": "h7dlbl9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627895195.0
    },
    {
        "author": "PutsOnYourWife",
        "body": "Ok so AMZN and PYPL no Moon but NKLA? Market broken",
        "created_utc": 1627892691,
        "id": "h7ep09y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627921491.0
    },
    {
        "author": "rugarias",
        "body": "PayPal is a high quality name, but even at current prices - it's very richly priced.\n\nNot a bad bet but it is by no means cheap at all, I don't see it as a buy a dip opportunity personally. PayPal needed to beat earnings and have very strong Q3 guidance to justify its pricing in my opinion",
        "created_utc": 1627895991,
        "id": "h7eslso",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627924791.0
    },
    {
        "author": "timwaaagh",
        "body": "asml of course. except for the threat of SMEE catching up to them way down the line, i dont think they can fail. however the stock price might become irrational at some point. paypal on the other hand i think will die eventually. i just think others (adyen mollie etc) offer better ways to pay for stuff.",
        "created_utc": 1627893013,
        "id": "h7epcq7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627921813.0
    },
    {
        "author": "apooroldinvestor",
        "body": "First rule.  No penny stocks! Only blue chips like MSFT AAPL PYPL GOOGL NVDA. 😆",
        "created_utc": 1627861276,
        "id": "h7dbsy7",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627890076.0
    },
    {
        "author": "ricke813",
        "body": "I just don't understand why SQ gave up 18.5% of their company (stock deal) for a buy now, pay later button when PYPL did the same thing on their own (Pay-in-4). The dilution kind of sucks for existing shareholders, but the underlying SQ biz is doing great with Cash App gross profits growing 94% from PY 🤷‍♂️.",
        "created_utc": 1627874447,
        "id": "h7e0cd9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627903247.0
    },
    {
        "author": "TheGreatLoudini",
        "body": "Right? And square has a tiny footprint in the online payment space compared to PayPal and they have had the buy now pay later option for like a year now where square just bought after pay today.",
        "created_utc": 1627924574,
        "id": "h7g7qrr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627953374.0
    },
    {
        "author": "LasagnaWater",
        "body": "Come on PYPL, go back to 300, preferably by Friday, just see how it feels",
        "created_utc": 1627916892,
        "id": "h7fq014",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627945692.0
    },
    {
        "author": "Particular-Cake-6430",
        "body": "Why is SQ up but PYPL down? PYPL is way better",
        "created_utc": 1627921216,
        "id": "h7fzusr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627950016.0
    },
    {
        "author": "fomoandyoloandnogrow",
        "body": "Just wait til earnings, it will sink faster than PayPal did",
        "created_utc": 1627917499,
        "id": "h7frc0y",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627946299.0
    },
    {
        "author": "jerryjones-is-smart",
        "body": "$QCOM still excellent value",
        "created_utc": 1627912129,
        "id": "h7ffvvy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627940929.0
    },
    {
        "author": "Omorphya",
        "body": "BUY QCOM $155 thank me later",
        "created_utc": 1627917337,
        "id": "h7fqzal",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1627946137.0
    },
    {
        "author": "z06dro",
        "body": "QCOM calls",
        "created_utc": 1627880604,
        "id": "h7ea9qb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627909404.0
    },
    {
        "author": "Omorphya",
        "body": "155 this week QCOM",
        "created_utc": 1627917374,
        "id": "h7fr28d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627946174.0
    },
    {
        "author": "Omorphya",
        "body": "Bro QCOM looks good",
        "created_utc": 1627917365,
        "id": "h7fr1i5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627946165.0
    },
    {
        "author": "dmitsuki",
        "body": "They didn't. When I spoke to an Intel product lead around 2012 he told me flat out that Intel, as a company didn't even consider AMD competition. He said that the only focus on the company was fighting companies like Qualcomm. This was obvious with their push of things like Atom. They didn't care about HPC because they didn't see any competition in it. Almost all of the money and research was poured elsewhere because everybody went to them for HPC anyway. Once Ryzen was released, which had obvious buy signals about it at the time, they still didn't give a shit, because first gen wasn't as good as Intels established product. \n\nThen it got better.\n\nThen it got even better.\n\nThen it got even better.\n\nAnd at that point it was too late, because Intel had focused all of it's energy trying to make atom processors and things of the like nobody wanted, they could no longer trivially keep up in HPC.",
        "created_utc": 1627916566,
        "id": "h7fpabl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627945366.0
    },
    {
        "author": "miscsubs",
        "body": "On the earnings call they did mention the major cloud provider being a IFS packaging solutions customer but Pat himself talked about collaborative effort and I don’t know, it sounded a bigger deal at the time. But I guess they picked their words just right.\n\nStill doesn’t justify the QCOM statement. At best, it was misleading IMO. that’s one thing that was frustrating about Intel in the previous regime. Always putting a spin on things with carefully crafted words.",
        "created_utc": 1627840122,
        "id": "h7c4fb6",
        "score": 1,
        "subreddit": "investing",
        "created": 1627868922.0
    },
    {
        "author": "Equivalent_Style4790",
        "body": "I guess your study would show u that none are neither over nor underevaluated if u add some more parameter in it. \n\n- Microsoft and visa are there to last \n- apple have only 1 product  that made most of its revenue\n- facebook and google are being fought by all the government for tax evasion and stuff. \n- qualcomm and intel are suffering the semiconducter crsis and they are only \"supliers\" and thus are heavily dependant on other big companies. \n- amazon was heavily sollicitaed during the pandemic and now ppl want to shop in the physical shops\n\nI beleive that those ideas can provide some insight of why a stock is under or over evaluated. \n\nNot to mention how the pandemic made all the money flow being very \"special\" during the last year and thus, all the number that are related on it are not even remotly indicating \"companie's health\". \n\nThx for sharing ur study with us",
        "created_utc": 1627851067,
        "id": "h7crf9a",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1627879867.0
    },
    {
        "author": "z06dro",
        "body": "Qcom calls",
        "created_utc": 1627875396,
        "id": "h7e21ya",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627904196.0
    },
    {
        "author": "miscsubs",
        "body": "I was cautiously optimistic about Gelsinger but this QCOM deal announcement did make me question things. Intel said QCOM to make chips in their foundries, QCOM then said no commitment yet, they’re just evaluating.\n\nThey also said they signed up a major cloud customer and sure, they did, but only for packaging (Amazon).\n\nNot sure if they’re intentionally misleading or being sloppy but I don’t like it.",
        "created_utc": 1627836077,
        "id": "h7bvq0p",
        "score": 1,
        "subreddit": "investing",
        "created": 1627864877.0
    }
]