[
    {
        "author": "wearahat03",
        "body": "Outperforming QQQ and SPY indices with FAANG + semiconductor portfolio\n\nMSFT, AAPL, ASML, AMAT, LRCX, KLAC were up today\n\nIf QQQ is down 1.4% and I'm down 1%, I consider that a win",
        "created_utc": 1638408258,
        "id": "hmvh3i5",
        "permalink": "/r/stocks/comments/r6btk6/rstocks_daily_discussion_wednesday_dec_01_2021/hmvh3i5/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1638437058.0
    },
    {
        "author": "IJustWantaQuietLife1",
        "body": "AMAT was my safe haven today. Hopefully the market won’t drag it down tomorrow so I can go cash when I buy this massive dip.",
        "created_utc": 1638394957,
        "id": "hmulubt",
        "permalink": "/r/wallstreetbets/comments/r6p244/what_are_your_moves_tomorrow_december_02_2021/hmulubt/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1638423757.0
    },
    {
        "author": "DoubleJesusPower",
        "body": "so so so sad I had to sell AMAT to buy my house in 2020",
        "created_utc": 1638565832,
        "id": "hn46z95",
        "permalink": "/r/stocks/comments/r7yl4f/biden_official_we_are_imploring_congress_to_pass/hn46z95/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638594632.0
    },
    {
        "author": "xflashbackxbrd",
        "body": "I'm buying MA (and selling visa for now to lock in loss for taxes) and i plan to buy amat once it gets back around 130 in the next few weeks ahead of the fomc",
        "created_utc": 1638584478,
        "id": "hn5a8sg",
        "permalink": "/r/stocks/comments/r831vv/long_awaited_mini_correction_is_here_whats_your/hn5a8sg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638613278.0
    },
    {
        "author": "vassadar",
        "body": "Not bad for AMD. AMD only design, but hire TSM to manufacture chips for them. So, more manufacturing capacity means cheaper cost of hiring manufacturers for producing chips.\n\nTSM on the other hand, will get cash from the gov, but have to invest heavily to create factories and procure machines.\n\nThose who benefit the most from is bill are ASML, LRCX and AMAT. They sell machines to these chip manufacturers.",
        "created_utc": 1638558979,
        "id": "hn3q35h",
        "permalink": "/r/stocks/comments/r7yl4f/biden_official_we_are_imploring_congress_to_pass/hn3q35h/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638587779.0
    },
    {
        "author": "RumHam1",
        "body": "Added a bit to my Microsoft position below 320 today, next but point on that one is 305.\n\nI'd also like to add to my Amat position below 140 and Citi below 61 if either falls much more.",
        "created_utc": 1638551992,
        "id": "hn38g7c",
        "permalink": "/r/stocks/comments/r7w895/rstocks_daily_discussion_fundamentals_friday_dec/hn38g7c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638580792.0
    },
    {
        "author": "tta2013",
        "body": "MSFT, NVDA, AMAT because many solutions to our future will depend on chips and heavy computing power. Our supply chain dependent on it and the chip and car shortage is a testament to that.",
        "created_utc": 1638504001,
        "id": "hn0y6pb",
        "permalink": "/r/stocks/comments/r7i0ym/what_are_you_investing_in_and_why/hn0y6pb/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638532801.0
    },
    {
        "author": "seigy",
        "body": "And this my friend is why you should own the semi equipment companies like AMAT, ASML, LRCX, &amp; TER.",
        "created_utc": 1638712622,
        "id": "hnbnk7c",
        "permalink": "/r/investing/comments/r8r1vq/why_is_valuation_for_semiconductors_so_poor/hnbnk7c/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638741422.0
    },
    {
        "author": "gainbabygain",
        "body": "Why don't you have AMAT &amp; ASML? ASML is pretty much a monopoly when it comes to bleeding edge tech",
        "created_utc": 1638683012,
        "id": "hnaj8w6",
        "permalink": "/r/investing/comments/r8ptp5/does_everyone_have_the_same_opinion_on_when_to/hnaj8w6/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638711812.0
    },
    {
        "author": "seigy",
        "body": "I'm with you the AMD, NVDA, LRCX, &amp; AMAT have carried my portfolio for years and it looks like it will for several more to come.  I've averaged over 30% a year for over 8 years now.  I don't think there has been a year I didn't beat the market.  There have been some ugly patches (see the last week or so) but the investment fundamentals are still strong.",
        "created_utc": 1638846541,
        "id": "hnjpj9z",
        "permalink": "/r/stocks/comments/rag1su/who_here_has_consistently_beat_the_sp500_for_more/hnjpj9z/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638875341.0
    },
    {
        "author": "wilstreak",
        "body": "company most benefitted from this, imo are semiconductor equipment manufacturer like ASML, AMAT, KLAC, LRCX.\n\nThey are basically a monopoly in their own specific niches equipment (a fab needs parts from different semi equipment company). Fixed supply, higher demand.\n\nshame this correction doesn't give us much opportunity to buy them for cheap.",
        "created_utc": 1638582566,
        "id": "hn56be5",
        "permalink": "/r/stocks/comments/r7yl4f/biden_official_we_are_imploring_congress_to_pass/hn56be5/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638611366.0
    },
    {
        "author": "MeldMeldMeld",
        "body": "oh. you mean large semiconductors are considered defensive stocks? like AMAT",
        "created_utc": 1638589087,
        "id": "hn5jjah",
        "permalink": "/r/stocks/comments/r823f2/how_can_we_simultaneously_be_in_a_bubble_and_a/hn5jjah/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638617887.0
    },
    {
        "author": "LastPotato1214",
        "body": "Tech is years out everything will change by then.  Who knows if solid states will even work.\n\nMain reason I like this is the pipe/investors though.  You have the 2 largest battery makers.  SK and LG and the several OEMs.  Imagine if Foxconn ends up making the Apple car too.    \n\nPIPE anchor investors include several leading automakers: General Motors, Hyundai Motor Company, Geely Holding Group, Kia Corporation, and SAIC Motor\n\nOther PIPE investors include Koch Strategic Platforms, LG Technology Ventures, Foxconn, Vertex Ventures, Fidelity Investments Canada ULC (certain funds), and Franklin Templeton\n\nExisting SES investors include SK Inc., General Motors, Hyundai Motor Company, Kia Corporation, Temasek, Tianqi Lithium, Vertex Ventures, Applied Materials, and SAIC Motor\n\nThe dcrc vc fund pipe really stands out by comparison.  Where's ford/bmw?\n\nKoch Strategic Platforms, Riverstone Energy Limited, Neuberger Berman funds and Van Eck Associates Corporation\n\nDcrb their last spac dumped on ticker change with a similar setup  of vc types n the pipe.  They had BlackRock, the Federated Hermes Kaufmann Funds, Fidelity Management &amp; Research Company LLC, Wellington Management and Riverstone Energy Limited\n\n\nMisc comments to your semi valid points though...\n\n\nA/C.  Levine is saying LiMetal will be the late decade norm.  (He's kinda an expert)  I doubt we see ssb until 2030.  \nB.  The largest US automaker, and 2 largest battery makers backing them.  (SK/LG)  You know South Korea isn't China right?   \nD.  This Bloomberg article is saying only QS can charge a high density battery faster lol.  Either way they expect that to improve.  Also if you sleep or work that's the perfect time to charge.  Only need to charge once a week for most drivers.\n\n\nhttps://twitter.com/stevelevine/status/1465088779895590912?t=vHQU9AEogRv2kg3ZYz4HCQ&amp;s=19\n\n0 chance this doesn't move when the battery is in one of those GM Hummer Evs.  Only risk is if dcrc dies and ruins the battery spacs.  Figure that random pipe will box on ticker change.",
        "created_utc": 1638357005,
        "id": "hms7pse",
        "permalink": "/r/SPACs/comments/r62uc9/gms_battery_bet_shows_off_lithiummetal_cell_that/hms7pse/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638385805.0
    },
    {
        "author": "vassadar",
        "body": "Please enlighten me.\n\nIsn't it involving in a lawsuit with IBM for not following though a contract to develop chips for them?\n\nimo, think ASML, LRCX, and AMAT will benefit the most as chip manufacturers will have to invest heavily and buy machines from them for the next few years.",
        "created_utc": 1638558542,
        "id": "hn3p0n8",
        "permalink": "/r/stocks/comments/r7yl4f/biden_official_we_are_imploring_congress_to_pass/hn3p0n8/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638587342.0
    },
    {
        "author": "Tenordrummer",
        "body": "Man this made me do a double take on my post, it was definitely assholeish unnecessarily. I had just waded through posts about how the bill shouldn’t pass and this was the first post I saw that actually mentioned a USA chipmaker lol. \n\nAnd hard agree on all suppliers will have heavy benefits, but I’m not sure if THE MOST benefit will be to suppliers, just depending on how money is allocated. I know ASML, TEL, AMAT, etc are building our capacity to handle increased demand for tools, but I don’t think they’re there yet and that extra (potentially unsubsidized) capital spending makes me more hesitant. That’s just a short take though without doing much digging so I could be off on that one.",
        "created_utc": 1638561093,
        "id": "hn3vb2m",
        "permalink": "/r/stocks/comments/r7yl4f/biden_official_we_are_imploring_congress_to_pass/hn3vb2m/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638589893.0
    },
    {
        "author": "LastPotato1214",
        "body": "Thanks for your in depth analysis, any info on these other small companies?\n\nPIPE anchor investors include several leading automakers: General Motors, Hyundai Motor Company, Geely Holding Group, Kia Corporation, and SAIC Motor\n\nOther PIPE investors include Koch Strategic Platforms, LG Technology Ventures, Foxconn, Vertex Ventures, Fidelity Investments Canada ULC (certain funds), and Franklin Templeton\n\nExisting SES investors include SK Inc., General Motors, Hyundai Motor Company, Kia Corporation, Temasek, Tianqi Lithium, Vertex Ventures, Applied Materials, and SAIC Motor",
        "created_utc": 1638389955,
        "id": "hmu8grf",
        "permalink": "/r/SPACs/comments/r62uc9/gms_battery_bet_shows_off_lithiummetal_cell_that/hmu8grf/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1638418755.0
    },
    {
        "author": "ObservationalHumor",
        "body": "AMAT, ASML, LAM and TEL are the ones I usually see crop up.",
        "created_utc": 1638637460,
        "id": "hn7ould",
        "permalink": "/r/investing/comments/r8r1vq/why_is_valuation_for_semiconductors_so_poor/hn7ould/",
        "score": 1,
        "subreddit": "investing",
        "created": 1638666260.0
    },
    {
        "author": "RumHam1",
        "body": "Some companies will take that sort of hit, but not most.  A fair amount of recent winners are already down 30%ish (Unity, RBLX, Affirm for example) which are still above where they were just a few months ago.  Their negative profitability to me means they could be in for a harder correction.\n\nGrowth tech with earnings and balance sheet strength won't fall nearly as far.  AMD is 137 as I type this, AMAT is 143.  Both down more than 10% from recent highs but I don't see the same risk in those two as I see in many others.\n\nI think when we look back in 1-3 years, we may see that this was a pullback buying opportunity on some winners for the next decade.  Obviously it's tough to say where they stop going down.  For the time being, my focus when looking at tech stocks is on companies with reasonable earnings multiples that also have achievable growth prospects.  The earnings should give me some freefall protection.",
        "created_utc": 1638802314,
        "id": "hngpq5f",
        "permalink": "/r/stocks/comments/ra4a8w/rstocks_daily_discussion_monday_dec_06_2021/hngpq5f/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638831114.0
    },
    {
        "author": "vizk0sity",
        "body": "5% lost on a 35% gain of the year during this week. I figured that inflation is here to stay and big tech can profit from both: 1. inflation, 2. covid, 3. Recovery. Top positions in order and none more than 15% each: VGT, QCOM, MSFT, GOOG, AAPL, AMZN, LRCX, TSM, KLAC, AMAT + everything else is under 3% of portfolio each.",
        "created_utc": 1638562225,
        "id": "hn3y3n2",
        "permalink": "/r/stocks/comments/r8560y/is_it_for_anyone_else_not_a_mini_correction_d/hn3y3n2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638591025.0
    },
    {
        "author": "mxx321",
        "body": "LEAPs on AMAT?",
        "created_utc": 1638539129,
        "id": "hn2e0rd",
        "permalink": "/r/wallstreetbets/comments/r7wo5m/daily_discussion_thread_for_december_03_2021/hn2e0rd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638567929.0
    },
    {
        "author": "BoomerImpairedShtSux",
        "body": "Applied Materials (NASDAQ:AMAT) declares $0.24/share quarterly dividend, -96.3% decrease from prior dividend of $6.40.\n\nSeekingA Boomers in shambles.",
        "created_utc": 1638480322,
        "id": "hmzfbsb",
        "permalink": "/r/wallstreetbets/comments/r7h6m8/what_are_your_moves_tomorrow_december_03_2021/hmzfbsb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638509122.0
    },
    {
        "author": "vassadar",
        "body": "Is it too late to get into AMAT?",
        "created_utc": 1638579304,
        "id": "hn4zmbh",
        "permalink": "/r/stocks/comments/r7yl4f/biden_official_we_are_imploring_congress_to_pass/hn4zmbh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1638608104.0
    }
]