[
    {
        "author": "ScipioAtTheGate",
        "body": "[He should join the Navy, girls love a guy in uniform with a steady stream of income they can yolo otm options off of.](https://www.youtube.com/watch?v=yC5NcQjDj-Y)",
        "created_utc": 1632687717,
        "id": "hee1k3b",
        "score": 494,
        "subreddit": "wallstreetbets",
        "created": 1632716517.0
    },
    {
        "author": "Mayday-Flowers",
        "body": "Corporations should not be legally allowed to own residential property. Full stop.\n\nBefore you know it, Amazon will be offering little box dwellings next to their warehouses as part of a benefit package. Ala the [Hong Kong Coffins.](https://www.youtube.com/watch?v=I2omC_s2odU) Just wait, it's coming.",
        "created_utc": 1632837934,
        "id": "helhknn",
        "score": 375,
        "subreddit": "stocks",
        "created": 1632866734.0
    },
    {
        "author": "NewFuturist",
        "body": "[Now this is a circus.](https://www.youtube.com/watch?v=vZJNxrsPfrk)",
        "created_utc": 1632241020,
        "id": "hdqf7h2",
        "score": 243,
        "subreddit": "wallstreetbets",
        "created": 1632269820.0
    },
    {
        "author": "thedisenchantedone",
        "body": "Every time I read this, I think of this [guy](https://www.youtube.com/watch?v=jDUgbYjcE8s&amp;t=30s).",
        "created_utc": 1630517046,
        "id": "hb7lrvh",
        "score": 205,
        "subreddit": "wallstreetbets",
        "created": 1630545846.0
    },
    {
        "author": "unidentifiable",
        "body": "Meanwhile in China:\n\n    Ctrl+C\n    Ctrl+V\n    Alt+F4",
        "created_utc": 1631546637,
        "id": "hcp84t7",
        "score": 160,
        "subreddit": "CanadianInvestor",
        "created": 1631575437.0
    },
    {
        "author": "AllThotsGo2Heaven2",
        "body": "[MIT 15.401 Finance Theory I, **Fall 2008**](https://www.youtube.com/watch?v=HdHlfiOAJyE&amp;list=PLUl4u3cNGP63B2lDhyKOsImI7FjCf6eDW) always gets me.",
        "created_utc": 1631151179,
        "id": "hc4qtmd",
        "score": 156,
        "subreddit": "wallstreetbets",
        "created": 1631179979.0
    },
    {
        "author": "-Sliced-",
        "body": "Here is the funny thing. Alipay/Ant Group grew up within Alibaba and became China’s largest payments processing company (think Mastercard, Visa, Paypal, and Stripe all in one). It was for many years one of the most valuable parts of Alibaba. Then, in 2011, **Alipay was stolen** from the US and European investors in Alibaba’s VIE structure when the founder and CEO Jack Ma unilaterally transferred 100% ownership of Alipay into a different company controlled solely by himself.\n\nOne of the shareholders hurt was Yahoo who were a big early investor in the Alibaba VIE, amassing a 43% stake. Yet, despite that very substantial ownership, Yahoo did not even find out about the transaction until months later. When they discovered what had happened, they were of course outraged and launched into legal proceedings.\n\nHowever due to the VIE structure, Yahoo (and other shareholders alongside them) were powerless to do anything. They had no legal recourse. Yahoo owned 43% of the Alibaba VIE (BABA stock), so it did not technically own any portion of Alipay at all. What Yahoo legally owned was 43% of a shell corporation listed in the Cayman Islands that had some (unfortunately illegal) contracts with Alibaba. And when it came time to enforce those contracts. they were unsurprisingly unenforceable. Let us be very clear about exactly what happened: Jack Ma took a company worth billions of dollars directly from under the nose of thousands of US and European investors in the VIE, and there was nothing anyone could do about it.\n\nYet, despite this recent, brazen, and high-profile theft, along with many others like it, investors continue to invest in the Alibaba and other VIE stocks to this day. This is even though there is absolutely nothing preventing the same happening again. Western investors continue to eagerly invest billions in the very structure that has been proved to offer them no protection in the past. Do people never learn?!\n\nFrom: https://gci-investors.com/chinese-vie-structure-wall-street-continues-to-ignore-the-risks/",
        "created_utc": 1631511932,
        "id": "hcnrhdi",
        "score": 137,
        "subreddit": "investing",
        "created": 1631540732.0
    },
    {
        "author": "rotmanman",
        "body": "Msft, aapl, wmt, nke, Dis, V, Brk.b, WM, BLK",
        "created_utc": 1631230068,
        "id": "hc8t1qh",
        "score": 84,
        "subreddit": "stocks",
        "created": 1631258868.0
    },
    {
        "author": "michelco86",
        "body": "Both V and MA are great hold for 5 years or more. Valuations might be a little high right now, i'd wait (and hope) for the price to come down further. And important to know is that Square, Paypal, Apple Pay etc all go through Visa or Mastercard, so they're not really rivals",
        "created_utc": 1630760757,
        "id": "hbkbvjj",
        "score": 79,
        "subreddit": "stocks",
        "created": 1630789557.0
    },
    {
        "author": "Eslooie",
        "body": "If you are correct, It's going to trade mostly sideway. Earnings will be boosted by inflation devalued dollars while at the same time PE ratios will slowly deflate.  Companies with pricing power or inflation synergies (like Visa)will be fine.",
        "created_utc": 1632795527,
        "id": "hejpekr",
        "score": 79,
        "subreddit": "wallstreetbets",
        "created": 1632824327.0
    },
    {
        "author": "Neutral_Fellow",
        "body": "Also worth a mention, [cassetteboy](https://www.youtube.com/watch?v=0YBumQHPAeU&amp;ab_channel=cassetteboy)\n\nWe have the bravery,\n\nto bring back slavery",
        "created_utc": 1632217737,
        "id": "hdp7ezw",
        "score": 69,
        "subreddit": "wallstreetbets",
        "created": 1632246537.0
    },
    {
        "author": "IndicationQuiet5820",
        "body": "[https://www.youtube.com/watch?v=VZ0obEwpVUE](https://www.youtube.com/watch?v=VZ0obEwpVUE)  \nHere is his interview this morning as well. \n\nPayment for order flow is illegal in Canada and the UK. Is the USA next? Interested in hearing the arguments for and against.",
        "created_utc": 1631752318,
        "id": "hd0qbvo",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1631781118.0
    },
    {
        "author": "lralogan",
        "body": "Anything is better than Capital One. Wish it had been a VISA for selfish reasons but this is great!",
        "created_utc": 1630593843,
        "id": "hbbl6tb",
        "score": 64,
        "subreddit": "CanadianInvestor",
        "created": 1630622643.0
    },
    {
        "author": "Ksyu_K",
        "body": "The fappening V 2.0, but this time with money.",
        "created_utc": 1631819467,
        "id": "hd45dcr",
        "score": 64,
        "subreddit": "wallstreetbets",
        "created": 1631848267.0
    },
    {
        "author": "bazza010101",
        "body": "the majority of these digital wallets are processing their transactions on whose platform? ding ding ding you guessed it MA or V\n\napple pay and square are both on MA platform, paypal as far as i know still uses visa platform so its lazy to think of these as competitors, revolut is on both\n\nnothing got to do with credit cards the companies are a transaction platform your answer shows how little you know\n\nso if one of the biggest companies in the world apple is using their platform do you really think they are in trouble\n\nMA said many times they dont see these companies as competitors because the amount of cash still used is far greater than electrical payments and if these other companies can bring in more to go cashless MA and V will benefit hugely\n\nthese companies you say are competitors are actually generating more $$$ for MA and V",
        "created_utc": 1630616393,
        "id": "hbd5i5g",
        "score": 61,
        "subreddit": "stocks",
        "created": 1630645193.0
    },
    {
        "author": "DrewFlan",
        "body": "Tether is a house of cards.  When they get exposed for the frauds they are it will have a large negative impact on the crypto space.  And no, that isn't saying crypto will go to zero.  Just that it will have a negative effect.\n\n[Here](https://www.youtube.com/watch?v=-whuXHSL1Pg) is a good video about it.  It's not a 'crypto doomsday' prediction video.  Moreso an objective look at why Tether's whole existence is shady and doesn't make sense.",
        "created_utc": 1631195294,
        "id": "hc6isc2",
        "score": 59,
        "subreddit": "investing",
        "created": 1631224094.0
    },
    {
        "author": "Mryop42",
        "body": "The market is fearing the buy now and pay later trend that bypasses credit cards. The decline was due to Amazon announcing that they will be partnering with Affirm, which spooked V and MA investors.",
        "created_utc": 1630607286,
        "id": "hbciijy",
        "score": 53,
        "subreddit": "stocks",
        "created": 1630636086.0
    },
    {
        "author": "frex4",
        "body": "Original sauce is here: https://www.youtube.com/watch?v=XaKgRe6GuUQ\n\nBeen thinking about this parody for weeks. Zero experience in video editing. I can rest now.",
        "created_utc": 1631973634,
        "id": "hdbz5z7",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1632002434.0
    },
    {
        "author": "BearBearChooey",
        "body": "Yes great long term hold. \n\nSome people don’t realize companies like PYPL/SQ still utilize V/MA as their payment networks partner. I look at FinTechs more so as partners with V/MA and not competitors. Unless one of these companies wanted to start their own payment network directly. \n\nBNPL (like Affirm) could take some of the credit card business but I wouldn’t be surprised if some companies could start letting you even make installment payments via CC instead of direct ACH. I’m sure people even use their debit cards, which are V/MA branded\n\nMy biggest concern is more regulation around payment networks and potential allowance of smaller networks to gain a piece of the pie. I read an article the other day how Australia may mandate low-cost debit card system for payments, which would allow banks to potentially utilize cheaper payment networks as opposed to V/MA (which are more expensive). I’m still not overly concerned with this yet to make me back off my stance that both V/MA are great long term holds, but something to watch. \n\nOnce international travel comes back some post COVID, V/MA will shoot up as this is their bread and butter. That segment has still not really recovered yet from COVID and will be one of the last things that does.",
        "created_utc": 1630762510,
        "id": "hbkf3t6",
        "score": 51,
        "subreddit": "stocks",
        "created": 1630791310.0
    },
    {
        "author": "DJShowtime5150",
        "body": "That’s $275 thousand, might wanna hold onto that one \n\nhttps://m.youtube.com/watch?v=n73DD0kv2l4&amp;noapp=1",
        "created_utc": 1632392613,
        "id": "hdy4m33",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1632421413.0
    },
    {
        "author": "doctorzaius6969",
        "body": "Isn't the whole point of risc V being an open standard and therefore there is no specific company in particular profiting from it?",
        "created_utc": 1632623608,
        "id": "heaqntr",
        "score": 48,
        "subreddit": "investing",
        "created": 1632652408.0
    },
    {
        "author": "gojays2025",
        "body": "Video games... Are small?\n\nSome of the most successful entertainment products of any kind are video games. I know this is a little older, but it mentions \" In 2017, consumers spent $36 billion on videogames, up 15% from the year earlier, according to NPD Group data. Box office sales improved 3% globally to a record total of almost $40 billion\".\n\nhttps://www.marketwatch.com/story/this-violent-videogame-has-made-more-money-than-any-movie-ever-2018-04-06\n\nGTA V is also heavily quoted as the most profitable and also one of the most expensive entertainment products ever made. It's a narratively driven game although now the online sandbox is a major money maker for them.\n\nIn general multiplayer games do tend to make more than single player, but not because of story - unlike movies you can actively socialize and participate in a joint activity with friends, family, or even just strangers.\n\nPlus with mobile gaming and the lockdowns people have been playing games more than ever. Obviously Netflix has been trying to get in with their interactive shows / movies but not sure how well that's been for them. With more and more services that offer online game streams (MS and Sony both have theirs now and there's also Stadia that's kind of dead) it's possible Netflix may want to head in that direction but who knows...",
        "created_utc": 1630944808,
        "id": "hbtmp8d",
        "score": 44,
        "subreddit": "SecurityAnalysis",
        "created": 1630973608.0
    },
    {
        "author": "Damascinos",
        "body": "This is a great [video](https://m.youtube.com/watch?v=dQw4w9WgXcQ) to get you started. \n\nThe mods sent me this link when I first started, they’re gay but helpful",
        "created_utc": 1630694679,
        "id": "hbh8yz6",
        "score": 44,
        "subreddit": "wallstreetbets",
        "created": 1630723479.0
    },
    {
        "author": "FullTackle9375",
        "body": "Just like the top five Dow Jones companies Apple, Microsoft, Visa, JPM and J&amp;J.",
        "created_utc": 1632355107,
        "id": "hdwiq4w",
        "score": 43,
        "subreddit": "stocks",
        "created": 1632383907.0
    },
    {
        "author": "Jgaston11",
        "body": "$UUUU-Uranium, REE, Vanadium 🇺🇸\n\nhttps://m.youtube.com/watch?v=Nh6FSvDRp8k\n\n$DNN-Uranium 🇨🇦",
        "created_utc": 1631160858,
        "id": "hc58ujn",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1631189658.0
    },
    {
        "author": "_The_Entire_Circus_",
        "body": "...otherwise we might see a lot more robbed banks.\r  \n\r  \nScreencaps from [Jibrilla's latest translated video.](https://www.youtube.com/watch?v=_CbgRI1TZR8) The PANIK in her voice when the price drops can be heard - [she even does a meme-worthy \\*gulp\\* at 9:27](https://youtu.be/_CbgRI1TZR8?t=560).\r  \n\r  \n&gt;!\"The first one is free\".!&lt;",
        "created_utc": 1632027949,
        "id": "hdfex3u",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1632056749.0
    },
    {
        "author": "Outof_ITM",
        "body": "[Idiocracy](https://www.youtube.com/watch?v=0Tv5shB4Gg0&amp;t=1095s)",
        "created_utc": 1632148348,
        "id": "hdlf9vx",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1632177148.0
    },
    {
        "author": "CarrollGrey",
        "body": "How to change your blinker fluid\n\n.https://www.youtube.com/watch?v=E6GsXhBb10k",
        "created_utc": 1632516572,
        "id": "he4yhpu",
        "score": 38,
        "subreddit": "wallstreetbets",
        "created": 1632545372.0
    },
    {
        "author": "doducduy96",
        "body": "I buy VOO every month with 40% of my income. Whenever I feel anxious about my position, I take a deep breath, a day off and go for a walk/drive around town. When I walkout of the door, a AMZN package I ordered 18 hours ago had already been here, neat. Then I take out my AAPL phone and go to GOOGL to look for a place to eat/chill, just got my PFE vaccine last month so I’m good to go. Hoping into my trust worthy F F150 and starting to drive, I notice that hmmm I have been seeing a lot of TSLA cars around, maybe it’ll be my next car? I’m daydreaming. The drive is 5 miles, I wonder why the HDs, COSTs, WMTs, TGTs parking are always packed like that, even tho it’s only Wednesday, \nHmmm guess I’ll skip groceries today. I feel lazy. Sitting at the restaurant’s outdoor patio, I enjoy my brunch with a glass of wine, my eyes start wandering around. What a beautiful day, the birds, the air, the people. Maybe it’s enough wine for the day, I go in to grab a soft drink. 8 out of 10 drinks on the fountain machine are KO products. Lots people around me are working on their AAPL and MSFT laptops. They are so thin yet very powerful. As a tech geek I know they are powered by INTC and AMD CPUs, and the heavy stuffs are done with NVIDIA GPUs. Gosh people are so productive nowadays! It’s time to leave, I lay my JPM V card to the tray, 5x points for dining baby! 5 mins later I’m on my way. Shit, I’m almost out of gas, pulling into a CVX gas station, tap my BAC MA card because I’ll get 3% cash back on Gas. Damn there’s a line wrapping around that MCD and SBUX drive thru, the food is unhealthy but well business is still booming I guess. \nGetting back into my home, I suddenly remember tomorrow is Oct 1st. I have T, VZ, NFLX bills to pay. \nDamn, I observed a lot from my lazy day today. I wonder what my life would be without all of the conveniences I saw today. \nI log into my Fidelity account and buy 4 more VOO shares. \nFeeling good.",
        "created_utc": 1633029707,
        "id": "hevxkhv",
        "score": 35,
        "subreddit": "stocks",
        "created": 1633058507.0
    },
    {
        "author": "Jgaston11",
        "body": "$UUUU-Uranium, REE, Vanadium 🇺🇸\n\nhttps://m.youtube.com/watch?v=Nh6FSvDRp8k\n\n$DNN-Uranium 🇨🇦",
        "created_utc": 1631411011,
        "id": "hcicuhp",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1631439811.0
    },
    {
        "author": "Jgaston11",
        "body": "$UUUU-Uranium, REE, Vanadium 🇺🇸 \n\nhttps://m.youtube.com/watch?v=Nh6FSvDRp8k\n\n$DNN-Uranium 🇨🇦",
        "created_utc": 1631046271,
        "id": "hbz3j6n",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1631075071.0
    },
    {
        "author": "Dassiell",
        "body": "comparisons on the above links\n\n&amp;#x200B;\n\nhttps://media.discordapp.net/attachments/858121225321578496/885192699332943922/image0.gif\r  \n[https://www.youtube.com/watch?v=Bsrp3QQ-Abg](https://www.youtube.com/watch?v=Bsrp3QQ-Abg)",
        "created_utc": 1631139569,
        "id": "hc42qlg",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1631168369.0
    },
    {
        "author": "SomeGuyNamedPaul",
        "body": "It's not FUD, it's a fact that BABA stock is the equivalent of a Kmart gift card versus cash.  It's a shifty proxy for the real thing and can get rug pulled at any time.  It's not like buying a Canadian stock from the US where your order is converted into CAD and then purchases actual stock in the company.  When you buy BABA the stock that's purchased is shares in a separate holding company that merely has an interest in select non-core assets of the actual Alibaba.\n\nhttps://www.investopedia.com/terms/v/variable-interest-entity.asp\n\nThis is what BABA shares actually are, except it's actually worse than that since the assets the VIE has an interest in isn't a wide slice of everything, but only a subset of the whole enterprise.  Imagine buying Disney shares but only being allowed to hold fractional ownership of the hexagonal pavers on the walkway leading up to the main gate and never any of the intellectual property.  Oh, and that can go poof at any time.",
        "created_utc": 1632053029,
        "id": "hdgcb2d",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1632081829.0
    },
    {
        "author": "firestepper",
        "body": "That's a fight I want to see... tsla v gme",
        "created_utc": 1631170122,
        "id": "hc5l7n4",
        "score": 32,
        "subreddit": "stocks",
        "created": 1631198922.0
    },
    {
        "author": "fanboy_killer",
        "body": "When it comes to bailing out friends, the US (and a lot of western countries) is [far from a free-market economy.](https://www.youtube.com/watch?v=0H8AshEYrKw&amp;t=53s)",
        "created_utc": 1632298344,
        "id": "hdtkwe6",
        "score": 32,
        "subreddit": "investing",
        "created": 1632327144.0
    },
    {
        "author": "redratus",
        "body": "Nothing has “suffered greatly” yet.\n\nHowever, V, MA and AMZN have been in dips for a long time and are due for a breakout IMO.",
        "created_utc": 1632257175,
        "id": "hdrii4o",
        "score": 32,
        "subreddit": "stocks",
        "created": 1632285975.0
    },
    {
        "author": "ScipioAtTheGate",
        "body": "[Only by incurring massive amounts of huge national debt can we perfect the nuclear space systems necessary for us to build a working stock market on the moon.](https://www.youtube.com/watch?v=b18HtG0DOCM&amp;t=190s)",
        "created_utc": 1631815679,
        "id": "hd3w3fx",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1631844479.0
    },
    {
        "author": "McKoijion",
        "body": "As Charlie Munger pointed out, they lose to the market by just about the cost of running the funds.\n\nAt the risk of irritating the Buffett video police: https://www.youtube.com/watch?v=dGMsIUxG-4E",
        "created_utc": 1631297132,
        "id": "hcc9fdo",
        "score": 31,
        "subreddit": "ValueInvesting",
        "created": 1631325932.0
    },
    {
        "author": "Speeeeedislife",
        "body": "Another comparison video between microvision and other lidar solutions: [https://www.youtube.com/watch?v=xAtSCE\\_TfqA](https://www.youtube.com/watch?v=xAtSCE_TfqA)\n\nHere's their brochure from the IAA: https://issuu.com/microvisioninc/docs/microvision\\_iaa\\_brochure-presskit\\_english\\_final/4",
        "created_utc": 1631144813,
        "id": "hc4dih9",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1631173613.0
    },
    {
        "author": "Lightning_zolt",
        "body": "[TMC DD](https://m.youtube.com/watch?v=9EcjWd-O4jI)",
        "created_utc": 1631745857,
        "id": "hd0cocn",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1631774657.0
    },
    {
        "author": "balance007",
        "body": "Hyundai did a huge recall for the same reason a year ago, before the cars starting exploding unlike GM that waited for enough cars to actually explode.  Because of the ole recall formula [https://www.youtube.com/watch?v=SiB8GVMNJkE](https://www.youtube.com/watch?v=SiB8GVMNJkE)\n\nDont ever buy a GM vehicle.....",
        "created_utc": 1630775778,
        "id": "hbl82nc",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1630804578.0
    },
    {
        "author": "ElBartoVerdad",
        "body": "&gt;V NASPROTNI SMERI URNEGA KAZALCA\n\nTruly the language of love",
        "created_utc": 1632161169,
        "id": "hdmaex5",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1632189969.0
    },
    {
        "author": "Crimson_Kang",
        "body": "This is [Pebbles The Crazy Cockatoo.](https://www.youtube.com/watch?v=39Yp9RTgXOo&amp;t=94s) Her owner is a really nice guy too.",
        "created_utc": 1632152288,
        "id": "hdlolpt",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1632181088.0
    },
    {
        "author": "jacquesmioff",
        "body": "https://www.youtube.com/watch?v=-j\\_CxQFziFU",
        "created_utc": 1632198386,
        "id": "hdojykz",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1632227186.0
    },
    {
        "author": "H0ss1",
        "body": "Then you'll love this,\nhttps://www.youtube.com/watch?v=i50hzBh8pog",
        "created_utc": 1632154367,
        "id": "hdltnil",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1632183167.0
    },
    {
        "author": "bazza010101",
        "body": "your answer previously shows your lack of knowledge and the second one proves it more\n\nit has nothing to do with credit card or debit, paypal uses visa platform\n\nPayPal will join the Visa Digital Enablement Program (VDEP) to expand point-of-sale acceptance:\r  \nPayPal will join VDEP, a commercial framework for Visa partners to access Visa’s token services and other digital capabilities in the United States. This will enhance transaction security and expand acceptance for PayPal’s digital wallet to all physical retail locations where Visa contactless transactions are enabled. Consistent with VDEP, issuers will be able to choose whether to participate and retailers can expect to pay fees that are consistent with other contactless transactions they accept today.\n\n&amp;#x200B;\n\nand the fact you keep saying venmo and paypal separately says alot also, venmo is owned by paypal \n\n&amp;#x200B;\n\nevery transaction that you spoke about above is done on the mastercard or visa platform, nothing to do with credit cards, your digital cards online, your debit, credit crads and many other cards are all done on the MA or V transaction platform\n\n&amp;#x200B;\n\napple one of the biggest companies in the world use MA and V platform doesnt that not tell you something?? square who own cashapp use MA platform\n\ndo you not understand? if you use paypal or venmo you are still in part using a visa platform",
        "created_utc": 1630619037,
        "id": "hbdb4m8",
        "score": 26,
        "subreddit": "stocks",
        "created": 1630647837.0
    },
    {
        "author": "lucidpancake",
        "body": "the videos from IAA booth demos really highlights the density of MVIS point cloud vs competitors. v stoked.",
        "created_utc": 1631149779,
        "id": "hc4nx5h",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1631178579.0
    },
    {
        "author": "razzmatazz323",
        "body": "If it starts with a V you’re probably good",
        "created_utc": 1632424477,
        "id": "he0006p",
        "score": 26,
        "subreddit": "RobinHood",
        "created": 1632453277.0
    },
    {
        "author": "Sangwiny",
        "body": "I'm curious, why did you choose MasterCard over Visa?",
        "created_utc": 1631206821,
        "id": "hc79oce",
        "score": 25,
        "subreddit": "stocks",
        "created": 1631235621.0
    },
    {
        "author": "i30swimmer",
        "body": "Yeah. V and MA are pretty safe as long as we don’t go into some super cycle depression globally. Which is possible if covid continues, but unlikely. Both probably safe for 5 years. Are you going to see 20% growth every year?- no. You’ll do fine though @ around 10%",
        "created_utc": 1630755859,
        "id": "hbk48bm",
        "score": 25,
        "subreddit": "stocks",
        "created": 1630784659.0
    },
    {
        "author": "Wonderful-Draw7519",
        "body": "Came to comments to find the answer to this question as well lol. Edit: I guess it's real lolol: [https://www.youtube.com/watch?v=73R11e5kNGk](https://www.youtube.com/watch?v=73R11e5kNGk)",
        "created_utc": 1632273614,
        "id": "hdsi762",
        "score": 25,
        "subreddit": "wallstreetbets",
        "created": 1632302414.0
    },
    {
        "author": "Fuck_Reddit_Now",
        "body": "Most land that these real estate companies build on are simply leased for 50, 70, or 80 years from the CCP (The IMF's plan all along was to transition the communists to subsisting off of property taxes provided by a market economy).  Further, there are literally millions of \"off plan\" sales (no real property exists, while full and partial payments for those notional properties have been made and will not be refunded).\n\nConsequently, there will be no \"necessary correction\" where property can be scooped up for pennies on the... uh, yeah, the bond debt being defaulted upon is mostly in the US dollar unit of account.\n\nThe Chinese government had better do fucking something (they're very worried about cultural revolution v2.0, but inaction is *exactly* how that happens).  They still haven't injected liquidity to half the level of Feb 2020.  Honestly, this would be a really excellent time for them to roll out their digital yuan to make short-shrifted property investors whole again.  If I were a Chinese real estate enterprise boardsitter (CCP installed or not), I'd already be on an airplane to that country I got a second citizenship in that lacks an extradition arrangement with China.\n\nThe biggest worry is \"contagion\".  The counter party arrangement in China is an opaque box, with many party officials sitting on company boards and inherently involved with many shady dealings.  How that will translate into other bonds being dumped on the market and how foreign holders of those bonds will seek to mitigate the coming spread of China's bad debt is absolutely unknown.\n\nI would look at places like Australia, Canada and New Zealand to see just how China's bad debt contagion spreads outside of the centrally planned sinosphere.  \n\nOne thing is absolutely for sure:  shit's about to get real interesting in the most Chinese way imaginable.\n\nFor trade ideas, [check this out](https://www.youtube.com/watch?v=rN0THKDR014)\n\nVan Metre also [has a good summary](https://www.youtube.com/watch?v=Rd7Jq_yIiE8)",
        "created_utc": 1631971726,
        "id": "hdbvdyt",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1632000526.0
    },
    {
        "author": "pittluke",
        "body": "[Here](https://i.imgur.com/DXV1zGP.png)\n\n[Then Here](https://www.youtube.com/watch?v=jKEDD1i4oGk&amp;t=48s)",
        "created_utc": 1632486576,
        "id": "he30q85",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1632515376.0
    },
    {
        "author": "randompersonx",
        "body": "If anyone is curious why I opened this trade, this youtube video explains it well:\nhttps://www.youtube.com/watch?v=iItpKh4bjds\n\ntl;dr ... 🚀🚀Uranium is set up for an epic squeeze. 🚀🚀",
        "created_utc": 1630603363,
        "id": "hbc8q8p",
        "score": 22,
        "subreddit": "wallstreetbets",
        "created": 1630632163.0
    },
    {
        "author": "ShadowLiberal",
        "body": "V &amp; MA are aware of those potential risks, and are attempting to get into the Fintech space in various ways, often through acquiring smaller companies.\n\nThat said the vast majority of the world's transactions are still done in cash, so there's still a ton of growth potential for credit cards, and this is why both have delivered such great growth rates for a while now.\n\nV &amp; MA are the kind of company that rarely ever dips into the \"on sale\" category, so imo you'd be better off just paying a fair price for them.",
        "created_utc": 1630766479,
        "id": "hbkn97y",
        "score": 22,
        "subreddit": "stocks",
        "created": 1630795279.0
    },
    {
        "author": "thenwhat",
        "body": "Street View doesn't need to be constantly updated. If you'll notice, they have photos that are years old in some places. Imagine having to do this across the world in real-time, constantly.\n\nAn untenable goal:\n\nhttps://www.youtube.com/watch?v=BwC2FRGl3-I",
        "created_utc": 1631112325,
        "id": "hc2bn6f",
        "score": 22,
        "subreddit": "stocks",
        "created": 1631141125.0
    },
    {
        "author": "Bill3D",
        "body": "[Some Chinese Tofu-dreg DD to get a sense of some of the real estate issues.](https://m.youtube.com/watch?v=s-2DtL-Wjkc)",
        "created_utc": 1632153647,
        "id": "hdlrwke",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1632182447.0
    },
    {
        "author": "wm313",
        "body": "Microsoft, Apple, Visa, Mastercard",
        "created_utc": 1631742261,
        "id": "hd04lqv",
        "score": 21,
        "subreddit": "stocks",
        "created": 1631771061.0
    },
    {
        "author": "cejay422",
        "body": "#“Where were you at during the great V shaped recovery of the week 9/20/21?”",
        "created_utc": 1632169052,
        "id": "hdmtlvp",
        "score": 21,
        "subreddit": "wallstreetbets",
        "created": 1632197852.0
    },
    {
        "author": "TurboMinivan",
        "body": "I have an E\\*Trade account, and it suits me fine.  Why did I choose them?  Simple: when I opened my account, they were offering a $100 promo that Schwab, Fidelity and Vanguard were not.  Since all four offered no-commission trades, I figured that was enough to sway my decision in their favor.  To date, I've been completely pleased with their service.\n\nI don't have any difficulty with E\\*Trade's web site, though I admit I've never used S/F/V so I cannot compare.  The most common criticism I see here against E\\*Trade is that you cannot purchase fractional shares... but I've never wanted or needed to do that, so it's a moot point to me.  So unless you think you absolutely *must* purchase fractional shares, I'd say E\\*Trade is just as good as the big three.\n\n$.02",
        "created_utc": 1631390303,
        "id": "hch1ycg",
        "score": 20,
        "subreddit": "stocks",
        "created": 1631419103.0
    },
    {
        "author": "nostringsnostrings",
        "body": "The Stock Market Dropped Because There’s Something Scarier Than Taxes, Tapers, and Contagion\nBy Ben Levisohn\nSept. 17, 2021 8:44 pm ET\n\nListen to article\nLength 4 minutes\n\nThe S&amp;P 500 saw its first close since June 18 below its 50-day moving average. For traders, it was very frightening.\nSpencer Platt/Getty Images\nWall Street has found something scarier than tapering, taxes, and China Evergrande Group combined. It’s called the 50-day moving average.\n\nThe predictions of impending doom from Wall Street’s talking heads continued this past week. The reasons for a pullback are many: The stock market has rallied for too long and has gone up too smoothly, the Federal Reserve is about to remove the bond buying that has helped prop markets up, taxes are ready to rise, economic data are slowing. None of it really left a mark.\n\nBut then the S&amp;P 500 dropped 0.6%, to 4432.99, over the week, while the Dow Jones Industrial Average fell 0.1%, to 34,584.88, and the Nasdaq Composite slumped 0.5%, to 15,043.97. For the S&amp;P 500, it was the first close since June 18 below its 50-day moving average—a technical measure of the previous 50 days’ closes that often ends up acting as support or resistance and that currently sits at 4436.35. For traders, it was very frightening.\n\nThat the drop also occurred on options expiration day—when options bets expire and are rolled over, typically a volatile day—also makes the moment fraught. Since May, options expiration has been the time for the S&amp;P 500 to make a quick test of its 50-day moving average before a bounce higher. And when I say quick, I mean quick, as it usually took the index a day, maybe two, to rebound.\n\n“The 50-Day MA discussion has been pounded into our heads with every drawdown,” writes Frank Cappelleri, desk strategist at Instinet. “And while we may be sick of hearing about it, the dip buying around the line has been a real phenomenon.”\n\n\nMarket Snapshot\nSource: FactSet\n%\nBarron's 400Index\nS&amp;P 500Index\nBarron'sFutureFocus StockIndex\nNASDAQCompositeIndex\nDow JonesIndustrialAverage\n2021\nSept.\n-5\n0\n5\n10\n15\n20\n25\nThis time has a different feel to it. The S&amp;P 500’s sojourn near the 50-day has been longer, notes Jonathan Krinsky, chief market technician at Bay Crest Partners. It’s been sitting near it for about six trading days now, without a big drop or big bounce. “The current set-up looks a bit more like a consolidation on the 50 DMA, as opposed to the prior quick ‘V-shaped’ dips,” Krinsky writes. “What we are saying is that the current way in which we got here feels a bit different than the last four to five times.”\n\nStill, Krinsky acknowledges that one close below the 50-day isn’t enough to panic. That’s because the S&amp;P 500 has now gone 218 days without two closes below the average, the second-longest streak since 1990. We won’t know if that streak breaks until the end of trading on Monday.\n\nREAD MORE TRADER\n\nNike Reports Earnings Thursday. Don’t Expect Good News.\nSupply-Chain Issues Are About to Hit Earnings. What to Expect.\nThe market has plenty of excuses to break the 50-day, if it’s so inclined. Maybe Evergrande (ticker: 3333.Hong Kong), the troubled Chinese property developer, will prove to be a Lehman moment and bring the world’s markets down with it. Maybe the Fed will surprise everyone and start tapering this coming week. Maybe something is lurking out there like the Baba Yaga of the old fairy tales, and maybe it looks a lot like Keanu Reeves.\n\nBut perhaps all the September weakness and worry are a good thing, setting the market up for its next run. “The ACWI is oversold again, and sentiment is not too optimistic,” writes Ned Davis Research’s Tim Hayes, commenting on the MSCI All-Country World Index. “The market’s resilience in the face of the negative September seasonality could be the preview of a bullish response to seasonal tendencies that turn favorable in the fourth quarter.”",
        "created_utc": 1631929574,
        "id": "hda5ep3",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1631958374.0
    },
    {
        "author": "anonyymi",
        "body": "[Keep Summer Safe](https://www.youtube.com/watch?v=4tpYFen3fJM)",
        "created_utc": 1631142755,
        "id": "hc49bmk",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1631171555.0
    },
    {
        "author": "Heap_Good_Firewater",
        "body": "Be careful what you wish for...\n\nIn his book, [China: The Bubble That Never Pops](https://www.amazon.com/China-Bubble-that-Never-Pops/dp/0190877405), Thomas Orlik lays out the case for China being able to weather economic storms better than most people expect.\n\nI generally agree that China will continue to dodge bullets in the short term.\n\nHowever, PolyMatter did a great series of videos diving into some of the longer-term structural problems faced by China. If they don't solve these problems, they are likely doomed to decline in a similar fashion to Japan. As some older folks may remember, we all thought Japan was going to take over the world in the late '80s and early '90s, but instead they suffered a \"lost decade\". Japan remains an important economy, but they are not quite an economic superpower.\n\nPolyMatter Videos (these are great):\n\nChina benefitted greatly from a young workforce and a limited number of older folks. Those numbers will be turned on their head in coming decades. Increased immigration is not an option due to an unwelcoming culture and the difficulty of learning Chinese.\n\n[Demographic Collapse — China's Reckoning (Part 1)](https://www.youtube.com/watch?v=vTbILK0fxDY)\n\nChina's housing market represents a massive mis-allocation of resources, at best.\n\n[Housing Crisis — China's Reckoning (Part 2)](https://www.youtube.com/watch?v=EgVXRtq5EIg)\n\nChina is running out of water, and much of the water that is easily accessible is heavily polluted.\n\n[Water Crisis — China's Reckoning (Part 3)](https://www.youtube.com/watch?v=nRUc4gTO-PE)\n\nChina is stoking nationalism at home by insulting and alienating foreign governments. This could hurt their ability to continue purchasing foreign companies and investing in developing countries.\n\n[National Insecurity — China's Reckoning (Part 4)](https://www.youtube.com/watch?v=y87R3Lp0jd0)",
        "created_utc": 1631022173,
        "id": "hbxhtn8",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1631050973.0
    },
    {
        "author": "fdasta0079",
        "body": "Ctrl-C, Ctrl-V",
        "created_utc": 1631816907,
        "id": "hd3z4rc",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1631845707.0
    },
    {
        "author": "Arthix",
        "body": "IRNT 9/24 80c contracts now available, I'll be v interested to see the volume on those today",
        "created_utc": 1631884845,
        "id": "hd7czhi",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1631913645.0
    },
    {
        "author": "Kusatteiru",
        "body": "This calendar year i'm up 20% which is pretty nice.  \nOf course, last year I swooped in on some nice deals.  \nOpened positions in CNR.TO, Dis, V.  \nStrengthen positions in BRK.B, BNS, BCE.  \n\nSo this year, jan till now.  I did ok.",
        "created_utc": 1631381672,
        "id": "hcghs4d",
        "score": 18,
        "subreddit": "CanadianInvestor",
        "created": 1631410472.0
    },
    {
        "author": "Zestyclose_Hippo",
        "body": "I think it’s the Chinese housing market in general, evergrande is just the canary in the coal mine. \n\nhttps://m.youtube.com/watch?v=jDIhTc6CJYY",
        "created_utc": 1632143661,
        "id": "hdl54lc",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1632172461.0
    },
    {
        "author": "sushiladyboner",
        "body": "TLDRTLDR: No antirust violations.\n\nTLDR: The court ruled that Apple is not a monopoly, their commissions and fees are totally fine, they're allowed to collect on the money Epic owes them, and they were in the clear to eliminate the contract with Epic and remove them from the store. \n\nHere's the full ruling: https://www.documentcloud.org/documents/21060667-epic-v-apple",
        "created_utc": 1631306271,
        "id": "hccusxh",
        "score": 17,
        "subreddit": "investing",
        "created": 1631335071.0
    },
    {
        "author": "elomariwest",
        "body": "[Me, looking at CLOV go green](https://www.youtube.com/watch?v=0oxLmkM11U0)",
        "created_utc": 1631543966,
        "id": "hcp1qbz",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1631572766.0
    },
    {
        "author": "okwhoqueefed",
        "body": "Simpsons has an accurate depiction of what will happen...\n\n[https://www.youtube.com/watch?v=Bzz8BvaQL9Q](https://www.youtube.com/watch?v=Bzz8BvaQL9Q)",
        "created_utc": 1632080276,
        "id": "hdi2dqf",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1632109076.0
    },
    {
        "author": "VeGr-FXVG",
        "body": "Oh wow, for the longest time I just assumed it was [cassetteboy](https://www.youtube.com/watch?v=LI87PRgIKks). Got another one on the list now!",
        "created_utc": 1632210621,
        "id": "hdp01n3",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1632239421.0
    },
    {
        "author": "investortrade",
        "body": "Look at V",
        "created_utc": 1632257559,
        "id": "hdrjfgt",
        "score": 16,
        "subreddit": "stocks",
        "created": 1632286359.0
    },
    {
        "author": "ihsw",
        "body": "The National Highway Traffic Safety Administration requires silent EVs to emit a noise during operation for the purpose of alerting pedestrians. As such, new Tesla vehicles have external speakers and drivers can load up to five custom sounds to choose from.\n\nNaturally, it is leading to some hilarity: https://www.youtube.com/watch?v=--ezgU8Nro0",
        "created_utc": 1632968174,
        "id": "hesw9lm",
        "score": 16,
        "subreddit": "investing",
        "created": 1632996974.0
    },
    {
        "author": "mj_184",
        "body": "RBC offers both Visa and Mastercard\n\nhttps://www.rbcroyalbank.com/credit-cards/all-credit-cards.html#/all-cards",
        "created_utc": 1630597665,
        "id": "hbbubmq",
        "score": 16,
        "subreddit": "CanadianInvestor",
        "created": 1630626465.0
    },
    {
        "author": "notherday11",
        "body": "Judge announced a mixed ruling in Apple v Epic Games, basically most of the decision went to Apple but they got knocked down a peg on some restrictions against developers and that’s the only thing I can think of.\n\nMy level of concern - 0%",
        "created_utc": 1631287931,
        "id": "hcbmxln",
        "score": 16,
        "subreddit": "stocks",
        "created": 1631316731.0
    },
    {
        "author": "reymciv",
        "body": "&gt; $16.95 average\n\n $19.90 average :'v![img](emote|t5_2th52|4270)",
        "created_utc": 1632377397,
        "id": "hdxne8h",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1632406197.0
    },
    {
        "author": "Mystic_dwarf",
        "body": "Long term bullish on V",
        "created_utc": 1630849522,
        "id": "hbopdib",
        "score": 15,
        "subreddit": "stocks",
        "created": 1630878322.0
    },
    {
        "author": "Chamath_Papaya",
        "body": "Jim Cramer must be on some kind of edible.\n\nThe dude pivots a conversation about the Apple Car to Ted lasso and Ford v Tesla in 10 seconds.",
        "created_utc": 1631107385,
        "id": "hc20ngx",
        "score": 15,
        "subreddit": "SPACs",
        "created": 1631136185.0
    },
    {
        "author": "Jgaston11",
        "body": "$UUUU-Uranium, REE, Vanadium 🇺🇸\n\nhttps://m.youtube.com/watch?v=Nh6FSvDRp8k\n\n$DNN-Uranium 🇨🇦",
        "created_utc": 1631624942,
        "id": "hctdcme",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1631653742.0
    },
    {
        "author": "stri8ed",
        "body": "The guy is a meme, used for a bunch of parody videos, where he is laughing his ass off on various issue. e.g. [https://www.youtube.com/watch?v=XrpsA98DhCI](https://www.youtube.com/watch?v=XrpsA98DhCI)",
        "created_utc": 1632144558,
        "id": "hdl6z4l",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1632173358.0
    },
    {
        "author": "espinozr",
        "body": "U.S. inflation softer than expected in August: \r\n\n* Core CPI 0.1% m/m v f'cast 0.3%\r\n* Core CPI 4.0% y/y v f'cast 4.2%\r\n* Headline 0.3% m/m v f'cast 0.4%\r\n* Headline 5.3% y/y v f'cast 5.3%\n\nThis is good, right? Can we have a green day now?!",
        "created_utc": 1631623074,
        "id": "hct9r5l",
        "score": 15,
        "subreddit": "stocks",
        "created": 1631651874.0
    },
    {
        "author": "smakattak",
        "body": "I found a document that mentions them.   Start here maybe.\n\nhttps://books.google.com/books?id=kQ8uAAAAMAAJ&amp;pg=PA420&amp;lpg=PA420&amp;dq=tri+state+uranium+company&amp;source=bl&amp;ots=oBEJ-46111&amp;sig=ACfU3U1UidSAVdMe9zb4_RKMHmwkc5DoNA&amp;hl=en&amp;sa=X&amp;ved=2ahUKEwiP_ObXwovzAhV4Ap0JHTr6BDwQ6AF6BAgoEAI#v=onepage&amp;q=tri%20state%20uranium%20company&amp;f=false",
        "created_utc": 1632071345,
        "id": "hdhfi8h",
        "score": 15,
        "subreddit": "stocks",
        "created": 1632100145.0
    },
    {
        "author": "nigel_tufnel_11",
        "body": "To be fair, poster did mention cash on hand and debt. So, not zero. And there is a long (MUCH longer) and more detailed DD from a few days ago. And this for those of you who can't read: https://www.youtube.com/watch?v=RzjX9GRDu6A",
        "created_utc": 1632505252,
        "id": "he47df4",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1632534052.0
    },
    {
        "author": "bonejohnson8",
        "body": "Hi guys,\r  \n\r  \nI'm nearly 47 single not lost my V. I know my chances are slim, so I've already resigned to the fact I'll stay single forever. I saw an escort when I was 42 but only kissed and got a blowjob (with condom lol). Other than that I've had no other sexual experience apart from with my hands and Cucumber I've named Gregory. I still live with my mom and dad but due to move out.\r  \n\r  \nI've never actually tried online dating, and never asked out a girl irl. I know I'm not ugly but clearly not a Chad either (I got many high 3s on r/truerateme which is quite good) but I am only 9 inches tall. I don't think that's a problem anyway, because I struggle/scared to make friends anyway. Throughout college/uni I stayed in my room playing Rollercoaster Tycoon 2. I'm not shy, quite outgoing sometimes, but when I feel I'm getting close to someone male or female I get shy/awkward and go back into my hole (with my cucumber). I did have friends but only childhood friends who have moved on with life we maybe catch up twice a year.\r  \n\r  \nVideogames, stonks, memes, vegetables and news are a great form of escapism for me. This may sound depressing - I actually used to be. But mentally I feel fine. I even work two jobs since rona hit, just to keep me occupied - not had a day off since Christmas. In fact, I actually happy and feel blessed I don't have a women in my life. I would ideally like to have sex with children, and although I know if I go out my way and muster up the courage I can do it - I just don't feel like it's genuinely worth it anymore. I feel like I missed out on a big part of growing up and developing relationships. I genuinely don't feel I want to, but I feel pressure from society and expectations - it's disappointing wherever I go or whoever I talk to they have another half and I'm literally the only person who doesn't. It's sad, embarrassing, but I don't want to get in a relationship (and all the bullshit that comes with it) just because of this.\r  \n\r  \nTLDR: Single, accepted fate and quite happy about it. Feel pressure from society to have a significant other, but can't/don't want one.",
        "created_utc": 1630811168,
        "id": "hbn939d",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1630839968.0
    },
    {
        "author": "WavyKirk",
        "body": "Uh, yes it was. \n\nHe’s been telling everyone in every stock to take profit during a bull run. Taking small profits consistently is legit his thing, he probably is the one who popularized it. \n\n&gt;\thttps://www.cnbc.com/2018/01/16/cramers-5-cardinal-rules-of-engagement-with-the-bull-market.html\n\n&gt;\thttps://www.thestreet.com/jim-cramer/jim-cramer-take-profits-gamestop-amc\n\n&gt;\thttps://www.cnbc.com/2021/08/04/cramer-urges-investors-to-take-profits-in-robinhood-as-it-becomes-a-meme-stock.html\n\n&gt;\thttps://www.thestreet.com/jim-cramer/jim-cramer-afterpay-deal-chance-sell-profit-square-sq-stock\n\n&gt;\thttps://m.youtube.com/watch?v=U_SUjJXebcw\n\nHe literally calls it his rule number 1, and not one day has gone by where he hasn’t said take profits.",
        "created_utc": 1632152307,
        "id": "hdloncb",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1632181107.0
    },
    {
        "author": "wsb202009",
        "body": "will plan to add V and MA =&gt; It supposed to be added yesterday and today (yeah, me bought a lot).\n\nNext one is ADSK, dipped nicely, with good results, IMO, will recover like MA and V.\n\nNo dip, but DCA AAPL is too good.",
        "created_utc": 1630677267,
        "id": "hbg3jnh",
        "score": 14,
        "subreddit": "stocks",
        "created": 1630706067.0
    },
    {
        "author": "InIce1234",
        "body": "Cant give you his loss porn but I found footage of him ringing the NYSE bell. \n\nhttps://www.youtube.com/watch?v=eVgJ2ABCkAk&amp;t=95s",
        "created_utc": 1631098881,
        "id": "hc1m5t2",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1631127681.0
    },
    {
        "author": "AlertConsideration95",
        "body": "Been steadily buying MA.  BNPL isn’t a material threat.  Like you said, the masses already use CCs and many like myself enjoy the cash pack and points that BNPL doesn’t offer.  BNPL is for People who have credit or money problems to be honest.  It’s not even a new idea really... it’s essentially the reverse of lay away lol. \n\nDelta will fade out eventually and travel will rebound.  V and MA are solid plays.",
        "created_utc": 1631461721,
        "id": "hckoyac",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1631490521.0
    },
    {
        "author": "WillNeighbor",
        "body": "damn cuz tryna up his v bucks balance",
        "created_utc": 1631742864,
        "id": "hd060v0",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1631771664.0
    },
    {
        "author": "bazza010101",
        "body": "oil is definitely the way to go been in since summer last year and still adding \n\nMRO is a good play but i think 2 far better plays in oil and have destroyed MRO returns is\n\nC D E V and SM energy\n\n&amp;#x200B;\n\n1 year returns\n\nMRO +134%\n\nC D E V +743%\n\nSM energy +1332%\n\n&amp;#x200B;\n\ni see both C D E V and SM doubling by EOY and next year when SM low hedges drop off they will make a killing",
        "created_utc": 1632166522,
        "id": "hdmng00",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1632195322.0
    },
    {
        "author": "KeepDriving_",
        "body": "Just because there's open standard doesn't mean you can't make RISC V chips and sell them. Open standard is to encourage this",
        "created_utc": 1632627022,
        "id": "heaxhri",
        "score": 13,
        "subreddit": "investing",
        "created": 1632655822.0
    },
    {
        "author": "Mystic_dwarf",
        "body": "Visa, Berkshire, Microsoft, Adobe, Facebook &amp; Google",
        "created_utc": 1630674417,
        "id": "hbfxf0r",
        "score": 13,
        "subreddit": "stocks",
        "created": 1630703217.0
    },
    {
        "author": "MapleBabadook",
        "body": "https://www.youtube.com/watch?v=3RpxJT5w7Tc",
        "created_utc": 1630992145,
        "id": "hbwcjuz",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1631020945.0
    },
    {
        "author": "TheRandomnatrix",
        "body": "Does my heart good to see MA and V rebound while everything else bleeds. Got blasted for 3 weeks straight and now everyone else can feel my pain.",
        "created_utc": 1631119037,
        "id": "hc2rp7y",
        "score": 13,
        "subreddit": "stocks",
        "created": 1631147837.0
    },
    {
        "author": "AxemanFromMA",
        "body": "#TMC with the V shape",
        "created_utc": 1631904153,
        "id": "hd8m7aq",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1631932953.0
    },
    {
        "author": "thatdude596",
        "body": "Right now I would stay far away from the wish stock as well as the health stock clo v.... Both have been pounded into the ground and tons of bag holders at big volumes",
        "created_utc": 1631837925,
        "id": "hd5b5mn",
        "score": 13,
        "subreddit": "stocks",
        "created": 1631866725.0
    },
    {
        "author": "FalconsBlewA283Lead",
        "body": "May add to my V position. Keeps on bleeding and now down over 10% from its highs",
        "created_utc": 1630591491,
        "id": "hbbfmv9",
        "score": 13,
        "subreddit": "stocks",
        "created": 1630620291.0
    },
    {
        "author": "wildinterior",
        "body": "Definitely V",
        "created_utc": 1630848934,
        "id": "hboo96h",
        "score": 13,
        "subreddit": "stocks",
        "created": 1630877734.0
    },
    {
        "author": "WRONG_PREDICTION",
        "body": "Rules Committee Meeting on H.R. \\_\\_\\_, H.R. 3755, H.R. 4350 \n\nLivestream here:\n\nhttps://www.youtube.com/watch?v=ASxGvX5wfQk",
        "created_utc": 1632154782,
        "id": "hdluoq2",
        "score": 13,
        "subreddit": "weedstocks",
        "created": 1632183582.0
    },
    {
        "author": "Fuck_Reddit_Now",
        "body": "...[let the eagle soar](https://www.youtube.com/watch?v=nwVr0ljLkfA)",
        "created_utc": 1632795385,
        "id": "hejp3vd",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1632824185.0
    }
]