[
    {
        "author": "OverRatedRaptor",
        "body": "You should be able to access the BB Terminal with Citrix, so it is available for Mac as well.",
        "created_utc": 1612208314,
        "id": "gln0i1s",
        "permalink": "/r/wallstreetbets/comments/labst6/gme_and_amc_short_data_taken_from_bloomberg/gln0i1s/",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1612237114.0
    },
    {
        "author": "Overall-Situation-41",
        "body": "its most likely a remote connection through citrix",
        "created_utc": 1612208387,
        "id": "gln0oy4",
        "permalink": "/r/wallstreetbets/comments/labst6/gme_and_amc_short_data_taken_from_bloomberg/gln0oy4/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1612237187.0
    },
    {
        "author": "1sttimeverbaldiarrhe",
        "body": "Work From Home &gt; VPN &gt; RDP/CITRIX &gt; Office PC running Bloomberg.",
        "created_utc": 1612208818,
        "id": "gln1s0c",
        "permalink": "/r/wallstreetbets/comments/labst6/gme_and_amc_short_data_taken_from_bloomberg/gln1s0c/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612237618.0
    },
    {
        "author": "RollingGreens",
        "body": "Do you use Schwab's Streetsmart Edge? I agree their online platform is pretty bland but SSE you can launch through citrix on mac or download a desktop version on PC. It's pretty good for what I use it for.",
        "created_utc": 1612188173,
        "id": "gllkffw",
        "permalink": "/r/wallstreetbets/comments/la0n4z/daily_discussion_thread_for_february_01_2021/gllkffw/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612216973.0
    },
    {
        "author": "z3luesuz2ge",
        "body": "HPE halted? It’s about to skyrocket.",
        "created_utc": 1614774259,
        "id": "gpiysm6",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpiysm6/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614803059.0
    },
    {
        "author": "DoneDidNothing",
        "body": "Finally got a stock right, HPE was so undervalued.",
        "created_utc": 1614719414,
        "id": "gpgk14k",
        "permalink": "/r/stocks/comments/lvz0ry/rstocks_daily_discussion_technicals_tuesday_mar/gpgk14k/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614748214.0
    },
    {
        "author": "lolobiga",
        "body": "There's still time to get on the HPE rocket woooooooooo",
        "created_utc": 1614781966,
        "id": "gpjbz45",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpjbz45/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614810766.0
    },
    {
        "author": "neurovish",
        "body": "No, I have a couple I was going to try the battery with, but been doing the power bank route. I've got an HPE giveaway power bank that works pretty well, but haven't been able to source any more. It's similar to https://www.amazon.com/Portable-Charger-Jellysub-External-Compatible/dp/B08MW87ZJZ/ but slimmer",
        "created_utc": 1614746963,
        "id": "gpi2gyr",
        "permalink": "/r/wallstreetbets/comments/ls7pck/finger_on_the_trigger_for_market_open/gpi2gyr/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614775763.0
    },
    {
        "author": "StankyyyBut",
        "body": "Why did I buy hpe calls why do I hate money",
        "created_utc": 1614727822,
        "id": "gph26ql",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gph26ql/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614756622.0
    },
    {
        "author": "Adlai8",
        "body": "HPE 6/18/21 16c\nMsft 370c 3/18/22",
        "created_utc": 1614793942,
        "id": "gpk3apk",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpk3apk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614822742.0
    },
    {
        "author": "Outspoken_Douche",
        "body": "https://www.carnegiece.com/wp-content/uploads/2020/11/201130-ASX-CCE-HPE-Collaboration-Agreement.pdf\n\nhttps://www.carnegiece.com/wp-content/uploads/2020/10/201027-ASX-CCE-Microsoft-AI-for-Earth-Grant.pdf\n\nhttps://www.carnegiece.com/wp-content/uploads/2021/01/210107-ASX-CCE-GIMG-Operations-Resume-1.pdf",
        "created_utc": 1614729927,
        "id": "gph6ajo",
        "permalink": "/r/pennystocks/comments/lwb7id/carnegie_clean_energy_ltd_shs_00055_00006_1006/gph6ajo/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1614758727.0
    },
    {
        "author": "Adlai8",
        "body": "Be brave when err’body else is scared!\n\nMsft 270c 3/18/22 \nHpe 16c 6/21",
        "created_utc": 1614806500,
        "id": "gpkwdpn",
        "permalink": "/r/wallstreetbets/comments/lx47v2/what_are_your_moves_tomorrow_march_04_2021/gpkwdpn/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614835300.0
    },
    {
        "author": "StankyyyBut",
        "body": "HPE being sneaky 👀",
        "created_utc": 1614762833,
        "id": "gpim6se",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpim6se/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614791633.0
    },
    {
        "author": "SapereSense",
        "body": "I’ve been all in on HPE for over a month now, they just crushed earnings. Don’t think it’s too late at all",
        "created_utc": 1614719680,
        "id": "gpgko0j",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpgko0j/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614748480.0
    },
    {
        "author": "StankyyyBut",
        "body": "I thought I was idiot for turning down RKT before close for HPE now not so much",
        "created_utc": 1614770717,
        "id": "gpiudax",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpiudax/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614799517.0
    },
    {
        "author": "cupavac",
        "body": "HPE is poised for a big jump. Great earnings with increased forward outlook and market cap is 1/4th of Rocket’s. No extensive DD to show at the moment but all indicator’s point towards big gains.",
        "created_utc": 1614751788,
        "id": "gpi9ig2",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi9ig2/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614780588.0
    },
    {
        "author": "CloudyHero",
        "body": "To play devil’s advocate here: Many people don’t get excited about dips because they don’t have any money, or very much money sitting on the sidelines. I see advice on here all the time telling people to not attempt timing the market. People point to studies saying “lump sum investing beats trying to time the market”. So lots of people buy ETFs or index funds of various sorts and “lump sum” invest. If they don’t have years of experience behind them, then they start to panic and think they’re doing it wrong when their numbers turn all red. A lot of subreddits are filled with people sharing how much money they’ve made from whatever strategy they employed. It makes sense that these new investors feel disheartened from their efforts. \n\nI know someone who just invested a ton of money in the past few months and are now seeing lots of red. One example is they bought 100 shares of Apple at $139 and this morning realized they were down about $2,100. Now all they talk about is selling it. \n\nI encourage people to take emotions out of investing (including feeling excited about dips) because it is an event to understand rather than have emotional reactions to. Dips are a time to re-evaluate their holdings. If they are good holdings and the outlook is good continue to hold or buy more. If they are uncomfortable holding it further then move the money into something else. If you get excited about every dip then you are prone to buying irrationally which just as bad as selling irrationally. \n\nContinuously buying dips is potentially a great strategy and also potentially dangerous. I know people who bought tons of GE back in the year 2000. It was the biggest company in the world. It was “Apple” back then. As it dipped they kept buying more and more and to this day they are still down (20+ years later) over 70% in that holding. This is dangerous. If that money were invested in the S&amp;P 500 for example they would’ve come out much better. Same thing happened with Qualcom, Hewlett-Packard, AOL, Merck, Ericsson and so on and so on. In the late 90’s and early 2000’s people bought the dips endlessly on these stocks and never recovered or waited like 20 years before it finally recovered. These were not small unheard of companies. These companies were heavily traded and hotly talked about stocks back then. They were big deals back in their day. Microsoft and Google turned out to be great long term holds but Yahoo and AOL did not. It’s easy to look back in time and judge it all, but back then people made very convincing cases for why AOL and YHOO would be the best.  They were convincing at the time but history proved them wrong. \n\nThis is why I encourage ETF investing, especially if you are a novice investor. Betting on AOL and Yahoo would’ve lost a person a lot of money but investing on the whole rise of the internet/PC is great because Microsoft and Google more than made up for it. It’s also why I encourage people to re-evaluate their holdings regularly (monthly is probably best). I also encourage dividend investing but that’s a slightly different thing from this discussion. \n\nYes, dips can be a time to buy more, but they are also an invitation to re-evaluate one’s holdings without emotions. I often buy during dips but I caution people about buying everything during every dip. In my 25 years of investing I’ve become a fairly conservative investor (very boring portfolio) so take my old man advice for whatever you think it’s worth, I guess.",
        "created_utc": 1615218783,
        "id": "gq7z7gm",
        "permalink": "/r/stocks/comments/m043o7/advice_literally_the_only_times_i_have_made_large/gq7z7gm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1615247583.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  9th of March\n\n\n\n## Upcoming events for Tuesday, March  9th\n\n - Expected earnings:\n\n  ABIO, ABM, AHC, ALSK, ANIP, APEI, APG, AQB, AQST, ARRY, AVAV, AVDL, AVID, AYLA, BBAR, BBI, BCYC, BKEP, BNED, BNGO, CATB, CHMI, CLNE, CMD, CMPS, CPIX, CRESY, CREX, CTSO, CXDO, DKS, DQ, DRIO, DTIL, DXPE, EGY, EMAN, EOLS, ERYP, EVLO, EVRI, FUSN, GBIO, GMDA, GPX, GRCL, GRTX, HJLI, HLG, HRB, HUGE, IMNM, INFI, INPX, IPHA, IRCP, KALV, KRMD, KROS, LIND, LIZI, LMPX, LOMA, LPRO, LUMO, LYRA, MDB, MICT, MRNS, MTLS, NARI, NAV, NES, NNDM, NPK, NSPR, OM, ORGS, OSH, PAM, PLCE, PLRX, PMD, PQG, PRLD, PTGX, PTVCA, PTVCB, RMED, RNA, RUHN, SHC, SRRA, STRR, STSA, SURF, SYNC, SYNL, TACT, THM, THO, TLC, TRIL, TRVN, VBFC, VIRX, VTNR, WEYS, WKEY, XCUR, XENT, XERS, XM, XOMA, YMTX, YORW, ZYNE\n\n - Ex-div:\n\n  AEE, AGO, ANTM, AUBN, AVT, BBDC, BDX, BSY, BWXT, CASH, CI, CME, CMP, CNO, DHF, ESNT, FDP, FLIC, FOX, FOXA, G, GNK, HPE, HPQ, KFY, KIM, MGM, MNRO, NMRK, NVDA, OMC, OXY, PPL, PPR, RILY, SBAC, SBGI, TRV, UBCP, UMBF, UWMC, VCTR, VFC, WRB\n\n - Economic events and announcements:\n\n    - 3-Year Note Auction (previous: 0.196%)\n    - API Weekly Crude Oil Stock (previous: 7.356M)\n    - EIA Short-Term Energy Outlook\n    - FOMC Member Kaplan Speaks\n    - NFIB Small Business Optimism (previous: 95.0)\n    - Redbook (previous: -0.3%)\n    - Redbook (previous: 4.6%)\n    - WASDE Report\n\n## Upcoming events for Wednesday, March 10th\n\n - Expected earnings:\n\n  ADES, AEGN, AGFS, ALTO, AMC, AMEH, AMOT, APT, ARTNA, ASAN, ASND, AVO, BBW, BDSI, BEST, BLDP, BLFS, BMA, BMBL, BPTH, BTN, CALA, CDXC, CEPU, CERC, CETX, CIA, CKPT, CLDR, CLSD, CPB, CRHM, CVGI, CVGW, DMAC, DPW, DRVN, ESTA, ETTX, EXPR, EYEG, FLXN, FNV, FOSL, FPRX, FRG, FSM, FTEK, FTHM, FTK, GDS, GHLD, GIFI, GLRE, GPRK, GRTS, GSKY, HARP, HBB, HBIO, HCHC, HGEN, HOFV, HPR, HSDT, HSTO, HUIZ, IDN, IMTX, IMXI, JCS, KEQU, KERN, KIDS, KRKR, KRO, KRON, LC, LCUT, LMNR, LNSR, LQDA, LTRN, LXRX, MDRR, MGTX, MLND, MPLN, MYO, NATR, NAVB, NEON, NFH, NGMS, NL, NM, NMCI, NODK, NXE, ONCR, ORCL, OVID, OXSQ, PDD, PFIE, PNRG, PW, RAIL, RCMT, RDHL, RDVT, REKR, REVG, RNET, RSI, SCYX, SGMA, SGRY, SID, SINA, SKLZ, SMHI, SONM, SPRB, SRG, SSSS, SUMO, TALO, TFFP, TH, TIPT, TTCF, TUP, UBX, UEC, UMH, UNFI, USWS, VERX, VRA, VSTM, WB, WHLR, WLFC, WPG, WVVI\n\n - Ex-div:\n\n  AAT, ACV, AIO, ASTE, BTO, CAI, CBH, CCK, DBL, DCF, DHIL, DLY, DSL, EFL, EHT, EVF, HD, HEQ, HPF, HPI, HPS, HTD, HTY, INSW, JHI, JHS, MDU, NCV, NCZ, NRGX, NRIM, NSP, OBCI, ORA, PCI, PCK, PCN, PCQ, PDI, PFN, PGP, PKO, PMF, PML, PMX, PNF, PNI, POOL, PTY, PYN, PZC, RVT, SR, TRU, UVE, VGI, ZTR\n\n - Economic events and announcements:\n\n    - 10-Year Note Auction (previous: 1.155%)\n    - 10-Year Note Auction (previous: 1.155%)\n    - CPI (consensus: 0.4%, previous: 0.3%)\n    - CPI (consensus: 1.7%, previous: 1.4%)\n    - CPI Index, n.s.a. (consensus: 263.08, previous: 261.58)\n    - CPI Index, s.a (previous: 262.23)\n    - CPI, n.s.a (previous: 0.43%)\n    - Cleveland CPI (previous: 0.1%)\n    - Core CPI (consensus: 0.2%, previous: 0.1%)\n    - Core CPI (consensus: 1.4%, previous: 1.4%)\n    - Core CPI Index (previous: 270.03)\n    - Crude Oil Imports (previous: 1.656M)\n    - Crude Oil Inventories (consensus: -0.833M, previous: 21.563M)\n    - Cushing Crude Oil Inventories (previous: 0.485M)\n    - Distillate Fuel Production (previous: -0.723M)\n    - EIA Refinery Crude Runs  (previous: -2.327M)\n    - EIA Weekly Distillates Stocks (consensus: -3.667M, previous: -9.719M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 5.7%, previous: -12.6%)\n    - Federal Budget Balance (consensus: -265.0B, previous: -163.0B)\n    - Gasoline Inventories (consensus: -4.167M, previous: -13.624M)\n    - Gasoline Production (previous: 0.565M)\n    - Heating Oil Stockpiles (previous: -1.123M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: 0.5%)\n    - MBA Purchase Index (previous: 269.7)\n    - Mortgage Market Index (previous: 794.5)\n    - Mortgage Refinance Index (previous: 3,850.4)\n    - Real Earnings (consensus: 0.1%, previous: 0.8%)\n    - Thomson Reuters IPSOS PCSI (previous: 50.92)\n\n## Upcoming events for Thursday, March 11th\n\n - Stock splits:\n\n    - ELPVY @ **10:1** (Payable date: 03/17/2021)\n\n - Expected earnings:\n\n  ACET, ACHV, ACTG, ADCT, ADMA, AEYE, AGRO, AIV, AKUS, ALDX, ALOT, ALXO, AMPH, AMPY, AMTI, AMTX, ASRT, ASUR, ASXC, ATHA, AUTO, AVGR, AVIR, AWX, AXU, BBCP, BCOW, BDSX, BLCM, BNR, BRP, BRT, BSGM, BTAI, CAPR, CBAY, CBMB, CBPO, CCCC, CDAK, CELH, CEMI, CHPT, CIB, CLPR, CMTL, CPLG, CRBP, CRC, CRT, CSBR, CTIC, CTK, CVV, CWBR, CZNC, DBVT, DCBO, DESP, DLNG, DOCU, DOMO, DWSN, ECOR, ELOX, ENG, ERII, ESTE, EVC, EVOK, EXPI, FBRX, FEIM, FINV, FIXX, FLNT, FMTX, FNKO, FRSX, GAU, GBLI, GCO, GDEN, GDP, GDRX, GERN, GHSI, GLMD, GNE, GOGO, GOL, HCI, HMPT, HWCC, HZN, IGIC, IHC, III, IMH, INOD, INSE, INZY, IRIX, ISNS, ITOS, ITRM, JD, KBNT, KNOP, KYMR, KZR, LAIX, LCTX, LOCO, LSEA, LSF, LUNA, MACK, MAX, MAXN, MBII, MIRM, MLVF, MOSY, MRKR, MRUS, MSP, MTCR, MTEM, MTN, MVIS, MYE, MYSZ, NBRV, NEN, NKSH, NKTX, NLTX, NNA, NNBR, NRP, NSCO, NVCN, NVIV, OBLN, OCUL, ONCT, OPCH, ORIC, PAE, PAR, PBLA, PBPB, PCVX, PEI, PFSW, PLX, POSH, PRTY, PSTX, PTE, PTMN, QRHC, RC, REED, REFR, RFIL, RGLS, RLH, RMTI, SCOR, SCPE, SCWX, SDPI, SELB, SHIP, SHSP, SHYF, SIEN, SLDB, SLGG, SMTX, SPPI, SQFT, SQZ, SRRK, STCN, STNE, SVRA, SYBX, TARA, TBIO, TGA, THRY, TISI, TLYS, TMBR, TOMZ, ULTA, USAU, VALU, VHI, VIAO, VNRX, VTRS, WLDN, WPM, WPP, XNET, XONE, XPEL, XTLB, XXII, YSG, ZEAL, ZUMZ, ZUO\n\n - Ex-div:\n\n  ADP, AEO, ALB, AMSF, AU, AY, BDC, BGFV, BSIG, CCD, CCOI, CFFI, CGO, CHI, CHW, CPZ, CRWS, CSQ, CTXS, ECC, EIC, ENS, EOD, EXPO, FBSS, FDUS, FFIC, FFNW, FHN, FIS, FIX, FMNB, FTAI, FUSB, GFI, GHY, GOLF, GPN, HSBC, HVT, HVT.A, ICMB, IIIN, ISD, KFRC, KHC, KIO, LAD, LCII, LEO, LHX, MANT, MFGP, MGPI, NAT, NDAQ, NEXA, NTES, NTRS, PHM, PRGO, RGR, RICK, RS, SAMG, SDHY, SNDR, SNR, STAY, SWM, SYBT, TCBK, TG, THG, TRTN, TXT, UBSI, UNTY, USPH, WM, WMB, WSBC, WSTG\n\n - Economic events and announcements:\n\n    - 30-Year Bond Auction (previous: 1.933%)\n    - 4-Week Bill Auction (previous: 0.030%)\n    - 8-Week Bill Auction (previous: 0.035%)\n    - Continuing Jobless Claims (consensus: 4,220K, previous: 4,295K)\n    - Initial Jobless Claims (consensus: 725K, previous: 745K)\n    - JOLTs Job Openings (consensus: 6.600M, previous: 6.646M)\n    - Jobless Claims 4-Week Avg. (previous: 790.75K)\n    - Natural Gas Storage (consensus: -136B, previous: -98B)\n    - OPEC Monthly Report\n    - OPEC Monthly Report\n\n## Upcoming events for Friday, March 12th\n\n - Stock splits:\n\n    - EDU @ **10:1** (Payable date: 03/11/2021)\n\n - Expected earnings:\n\n  ADXS, AIM, ANAT, APLT, ATLC, ATLO, AYRO, BDR, BH.A, BHAT, BKE, BOMN, BORR, CCNC, CEI, CIH, CKX, CMPI, CMT, CNTY, COMS, EIGR, EXN, FENC, FGBI, FSEA, FSTX, GGAL, GLTO, HCAP, HHR, HMG, HUSA, INBX, INSW, ITCB, JAX, JKS, JP, KIRK, KMPH, LPCN, MMAC, MVO, NBAC, NEOS, NOG, NWLI, OLB, OLP, ONCS, OSG, PDLB, PICO, PIRS, PLXP, PNBK, PRPO, PSO, PTPI, SGA, SLS, SNMP, SOL, SPLP, SQBG, STTK, TPHS, VOC, VSTA, WISA, ZSAN\n\n - Ex-div:\n\n  AME, AMH, ANH, APTS, ARCC, ARR, ATRI, AVK, BANC, BBF, BBN, BCAT, BCX, BDJ, BFK, BFY, BFZ, BGIO, BGR, BGT, BGY, BHK, BHV, BIT, BLE, BLW, BME, BMEZ, BNY, BOE, BR, BRY, BSD, BSE, BST, BSTZ, BTA, BTT, BTZ, BUI, BXMX, BXS, BYM, BZM, CBU, CCI, CII, CMA, COFS, CORE, CPK, CSWC, CTBI, CWH, DIAX, DLR, DPG, DPZ, DTE, DVN, EDF, EDI, EFSC, EGF, EMN, EXR, FCNCA, FCRD, FFG, FRA, GBAB, GECC, GGB, GGM, GILD, GIM, GOF, GPK, GRMN, GROW, GTN, GTN.A, HLNE, HRTG, HUN, HWBK, HYT, IBP, IHIT, IHTA, IPAR, IRM, JCE, JCO, JDD, JEMD, JFR, JGH, JHAA, JHB, JLS, JPC, JPI, JPS, JPT, JQC, JRI, JRO, JRS, JRVR, JSD, JTA, JTD, KNL, KO, LDOS, LEG, MAXR, MBIN, MCA, MEN, MLR, MMD, MRK, MSI, MUE, MUI, NAC, NAD, NAN, NBB, NDMO, NEA, NEU, NEV, NID, NIQ, NKG, NKX, NL, NMCO, NMS, NMZ, NREF, NRK, NSA, NSL, NTST, NUV, NVG, NWE, NX, NXJ, NXPI, NXR, NXRT, NYV, NZF, OCSL, OMI, PB, PFBI, PKG, QQQX, RAND, RC, REG, RNR, RRBI, SAH, SCI, SELF, SFL, SFNC, SMMF, SPTN, SPXX, SRV, STC, SZC, TEI, TNL, TPVG, TSLX, UCBI, UE, UGI, UHS, UNH, VBF, VHI, VIAC, VIACA, VLY, VRSK, VTA, VVR, WOR, WTM, WWE, XEL\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 4.3K)\n    - CFTC Copper speculative net positions (previous: 66.0K)\n    - CFTC Corn speculative net positions (previous: 503.8K)\n    - CFTC Crude Oil speculative net positions (previous: 519.0K)\n    - CFTC Gold speculative net positions (previous: 189.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -23.5K)\n    - CFTC Natural Gas speculative net positions (previous: 17.8K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 23.2K)\n    - CFTC Silver speculative net positions (previous: 39.6K)\n    - CFTC Soybeans speculative net positions (previous: 223.7K)\n    - CFTC Wheat speculative net positions (previous: 29.9K)\n    - Core PPI (consensus: 0.2%, previous: 1.2%)\n    - Core PPI (consensus: 2.6%, previous: 2.0%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (consensus: 74.0, previous: 70.7)\n    - Michigan Consumer Sentiment (consensus: 78.5, previous: 76.8)\n    - Michigan Current Conditions (consensus: 88.3, previous: 86.2)\n    - Michigan Inflation Expectations (previous: 3.3%)\n    - PPI (consensus: 0.5%, previous: 1.3%)\n    - PPI (consensus: 2.7%, previous: 1.7%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 309)\n    - U.S. Baker Hughes Total Rig Count (previous: 402)\n    - US Federal Budget (previous: -430.0B)\n\n^^^^2021-03-09",
        "created_utc": 1615287619,
        "id": "gqbd4l5",
        "permalink": "/r/RobinHood/comments/m144of/daily_discussion_thread_march_9th_2021/gqbd4l5/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1615316419.0
    },
    {
        "author": "Dogburt_Jr",
        "body": "I had a few early failures while day trading, but nothing major. I first went in on GM when it was at $20 and held it to $40, and saved some to diversify my portfolio. I diversified in DAL, HPE, HPQ, WFC, and BRK.b and got a loss on all of them because I got bored of waiting.\n\nNow I opted to split my account, have $2k in a long-term automatic portfolio and $1k I mess around with day trading. My strategy is to look for big market caps taking a sudden drop for a very reactionary reason (earnings a few % below expectation but generally considered a good company still) and buy at those prices and sell at 5-10% return.",
        "created_utc": 1614720454,
        "id": "gpgmhmm",
        "permalink": "/r/stocks/comments/lw5fn3/serious_question_if_99_of_firsttime_day_traders/gpgmhmm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614749254.0
    },
    {
        "author": "StankyyyBut",
        "body": "Am I retarded if I went all in on a HPE fd",
        "created_utc": 1614726857,
        "id": "gph09wp",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gph09wp/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614755657.0
    },
    {
        "author": "whereismynut",
        "body": "cwgyf \n\nHere some highlights from their last quarterly. \n\n \\&gt;• \t $1.6m Mooring Tensioner project led by Carnegie awarded funding  by  Blue  Economy Cooperative Research Centre and formally commences  with  project  partner  \n\\&gt;  \n\\&gt;•\tHewlett Packard  Enterprise  Company  (HPE) and Carnegie sign Collaboration Agreement to  develop  reinforcement  learning-based controller for CETO and commence  work  \n\\&gt;  \n\\&gt;• \tMicrosoft awards Carnegie  with an AI for Earth grant providing   computational resources and  support for a project to enhance Carnegie’s   Wave Predictor (oct 2020)  \n\\&gt;  \n\\&gt;• \tOceantera, a southeast  Asian  project developer, and Carnegie sign  Collaboration Agreement to  explore  potential projects in SE Asia and  share knowledge and  expertise  \n\\&gt;  \n\\&gt;•\t Hydrogen opportunities explored and further  knowledge developed  through  ongoing internal investigations and via  industry relationships  \n\\&gt;  \n\\&gt;• \tGarden Island Microgrid resumes  operation following temporary   disconnection required for Department  of Defence’s own electrical   upgrades  \n\\&gt;  \n\\&gt;•\tEuropean  Commission  releases new EU  Strategy on Offshore Renewable Energy  supporting a  vision of at least  1000 MW of ocean energy by 2030 and 60  GW by 2050\n\nI've done a bit of research on this so check out my post if interested.\n\n[https://www.reddit.com/r/pennystocks/comments/lrfpej/carnegie\\_clean\\_energy\\_limited\\_cwgyf\\_1250/](https://www.reddit.com/r/pennystocks/comments/lrfpej/carnegie_clean_energy_limited_cwgyf_1250/)",
        "created_utc": 1614781334,
        "id": "gpjaop1",
        "permalink": "/r/stocks/comments/lwt9oz/what_stocks_do_you_believe_are_currently/gpjaop1/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614810134.0
    },
    {
        "author": "StankyyyBut",
        "body": "Anyone stupid enough to play HPE earnings ? Who else is fucked?",
        "created_utc": 1614734336,
        "id": "gpheub0",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpheub0/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1614763136.0
    },
    {
        "author": "StankyyyBut",
        "body": "Praying to the gods my HPE calls print they killed earnings and the guidance was positive as well.  🙏🏿",
        "created_utc": 1614770627,
        "id": "gpiu9mr",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpiu9mr/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1614799427.0
    },
    {
        "author": "StankyyyBut",
        "body": "HPE halted means I think this is going to the moon the wild part is I’ve only seen 3 comments on this thread  about it",
        "created_utc": 1614774479,
        "id": "gpiz3ok",
        "permalink": "/r/wallstreetbets/comments/lwr7oo/daily_discussion_thread_for_march_03_2021/gpiz3ok/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1614803279.0
    },
    {
        "author": "Thomjones",
        "body": "Right. Is there any economic factors and market algorithms and behind the curtain stuff to explain why AMD has barely gone up in months? Noooo, it hasn't gone up because investor sentiment about Intel improved. Has clean energy gone crazy because they are pumping out products and making mad money? Nooooo, it's because the public THINKS it's going to pump out products and make mad money. Why did this stock spike today? \"Well, you see, this and that  and that and this\" Noooo, it's going up for no fucking reason. They just like the stock.",
        "created_utc": 1614752245,
        "id": "gpia4fk",
        "permalink": "/r/stocks/comments/lw5fn3/serious_question_if_99_of_firsttime_day_traders/gpia4fk/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1614781045.0
    },
    {
        "author": "AFmedic9919",
        "body": "Halting the stock is good...intel tells us people wants to jump in!!!!",
        "created_utc": 1614716898,
        "id": "gpge28w",
        "permalink": "/r/wallstreetbets/comments/lw6hoh/rkt_megathread_for_march_2nd_2021/gpge28w/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1614745698.0
    },
    {
        "author": "wine_o_clock",
        "body": "Not as a meme, is NOK a good 5G play? They’re one of the biggest owners of 5G patents. And I know “quality over quantity” is important in this regard, but they’re also a leader in patent “value” according to a few studies. Sources below:\n\nPatent quantity https://www.iam-media.com/who-leading-5g-patent-race-0\n\nThe Patent Power Index takes into account:\n\n&gt;growth, impact, generality and originality of communication patents\n\nSlide 11 https://www.ipwatchdog.com/wp-content/uploads/2019/07/SLIDE-DECK-apple-intel-07-30-2019-FINAL.pdf\n\nPatent value https://spectrum.ieee.org/static/interactive-patent-power-2017\n\nThoughts?",
        "created_utc": 1614751131,
        "id": "gpi8ma9",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi8ma9/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1614779931.0
    },
    {
        "author": "vaultboy1963",
        "body": "I hope so, although part of me hopes it continues to slide to a reasonable reentry point.  I sold all my AMD a couple weeks ago, but I still believe in company.  It's got a great CEO, who was executing a good plan on all cylinders and taking advantage of Intel stepping on their own dicks.",
        "created_utc": 1614747820,
        "id": "gpi3thc",
        "permalink": "/r/options/comments/lwlowk/amd_analysis/gpi3thc/",
        "score": 3,
        "subreddit": "options",
        "created": 1614776620.0
    },
    {
        "author": "dunkaroo55",
        "body": "Life must suck with a half empty outlook. Do more DD. This would be very unexpected based on all available intel",
        "created_utc": 1614739110,
        "id": "gpho3ot",
        "permalink": "/r/wallstreetbets/comments/lw6hoh/rkt_megathread_for_march_2nd_2021/gpho3ot/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1614767910.0
    },
    {
        "author": "RaguSpidersauce",
        "body": "Headline123,\n\nIronically, I am in the tech field and I'm weighted lower in tech.  Odd..  I've never thought about it.\n\nI am boring:\n\nIndex funds = 62%\n\nMaterial = 0%\n\nIndustrial = 11% (my employer's sector)\n\nFinancial (BRKB) = 2%\n\nEnergy (CVX) = 2%\n\nConsumer Discretionary (EXPE, IAC, LYV, MTCH, etc.)= 4%\n\nInformation Technology (CSCO, INTC) = 2%\n\nCommunications Services (DIS) = 4%\n\nReal Estate (O) = 4%\n\nHealth Care (JNJ, PFE) = 2%\n\nConsumer Staple (HD, WMT) = 6%\n\nUtility (PNW) = .6%",
        "created_utc": 1614727554,
        "id": "gph1nq2",
        "permalink": "/r/stocks/comments/lwcut9/is_it_necessary_to_diversify_out_of_tech/gph1nq2/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1614756354.0
    },
    {
        "author": "fifacb",
        "body": "I hate to say this on this sub, but you do realize that providing credible intel that makes people money is a great way to get them to believe you the next time. Both things can be true. RKT is an incredible opportunity, and the same posts may be trying to get you to dump your GME shares to get in. HF's etc aren't stupid and, if you believe in the shilling, they know retail only has a limited amount of capital. I am not telling anyone what to do, and I am holding my GME. That said, both things can be true.",
        "created_utc": 1614740873,
        "id": "gphrlt1",
        "permalink": "/r/wallstreetbets/comments/lwik1s/gme_vs_rkt_squeeze_comparison/gphrlt1/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614769673.0
    },
    {
        "author": "JamesBond88888",
        "body": "Trades at a 18 p/e much cheaper than INTC and more market share and tech",
        "created_utc": 1614770289,
        "id": "gpitw3x",
        "permalink": "/r/wallstreetbets/comments/lwqjlb/well_shit_looks_like_i_was_right_rkt_to_100_next/gpitw3x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614799089.0
    },
    {
        "author": "GregTradPlWthWS",
        "body": "Look at INTC calls...very cheap and the US wants to go away from Taiwan Semi.....",
        "created_utc": 1614715185,
        "id": "gpga373",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpga373/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614743985.0
    },
    {
        "author": "mozebyc",
        "body": "I made some option calls for INTC\n\nSlight bad news, and I expect a dip, but they have announced GPUs and new flash storage.  I can see INTC around 87$ by april 16th",
        "created_utc": 1614720841,
        "id": "gpgnd8i",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpgnd8i/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614749641.0
    },
    {
        "author": "DowGoldRatio",
        "body": "Price targets are useless.  Own the stock as long as you believe in it.  Understand that once you do your due diligence to buy it, your DD never stops.  You are continuing to do DD as long ad you hold it.\n\nA perfect example was a client I had thst put about $20k in Dell the year they first went public.  He believed in their model of selling PCs they built to business customers.  He followed the company religiously.  \n\nThen years later, all of a sudden the company decided to get on the low margin business of selling TVs to retail customers.  Dell never built their own TVs sonthey were just another reseller.\n\nThis caused my client to decide to sell his now $1 million in Dell.  And he lived happily ever after. \n\nSo hold uour Intel until you believe they aren't innovating and growing like you think they should and move on to your next position.",
        "created_utc": 1614717429,
        "id": "gpgfbrq",
        "permalink": "/r/stocks/comments/lwaq49/how_long_of_a_hold_is_msft/gpgfbrq/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1614746229.0
    },
    {
        "author": "Bl00D79",
        "body": "The chip crisis funding is going to help intel more.  They have US based facilities.",
        "created_utc": 1614747835,
        "id": "gpi3u8k",
        "permalink": "/r/wallstreetbets/comments/lwlohr/amd_analysis/gpi3u8k/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1614776635.0
    },
    {
        "author": "ThisPomelo4",
        "body": "you got what you wished for two weeks ago. Gelsinger started in mid Feb. I like INTC here; I think it will outperform AMD due to the fab tightness/shortage at TSMC that affects AMD more heavily than Intel.",
        "created_utc": 1614766843,
        "id": "gpiqaxw",
        "permalink": "/r/options/comments/ipmvw9/leaps_on_intc/gpiqaxw/",
        "score": 1,
        "subreddit": "options",
        "created": 1614795643.0
    },
    {
        "author": "HandsyBad",
        "body": "INTC \n\nintel down on taiwan chip shortages and biden executive order.\n\nSHOULD BE SUPER UP!\n\nONLY SMALL LITHOGRAPHY DOMESTIC CHIP MAKER!\n\nWHEN IT MAKES SENSE MY BET IS GOES THROUGH THE ROOF!\n\nnonsense eventually gets realized.",
        "created_utc": 1614707912,
        "id": "gpft3xo",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpft3xo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614736712.0
    },
    {
        "author": "wilhelm96",
        "body": "INTC isn’t losing as much market share as projected.. yet",
        "created_utc": 1614706573,
        "id": "gpfq106",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfq106/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614735373.0
    },
    {
        "author": "JRshoe1997",
        "body": "I would hold. Me personally I am invested in INTC and not AMD, but I believe that semiconductor companies will be huge and way bigger in the future.",
        "created_utc": 1614706197,
        "id": "gpfp67c",
        "permalink": "/r/stocks/comments/lvty8u/reddits_favorite_stocks_by_alphabet/gpfp67c/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614734997.0
    },
    {
        "author": "heyheymustbethemoney",
        "body": "What I hate about owning the Qs is there are some garbage names around the top holdings... specifically Intel.   \n\n\nOP. Both are at great prices right now, and I would split it in half and buy them now. No need to wait. There may be a little short term pain, but you will be good if its an actual investment.",
        "created_utc": 1614709118,
        "id": "gpfvvrm",
        "permalink": "/r/stocks/comments/lvuk88/what_would_you_do_with_5k/gpfvvrm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614737918.0
    },
    {
        "author": "yerawizardIMAWOTT",
        "body": "Miles ahead is a bit of an exaggeration. Intel 10 nm is going to catch up but it is weird seeing AMD ahead for once.",
        "created_utc": 1614703649,
        "id": "gpfjbdi",
        "permalink": "/r/stocks/comments/lvz0ry/rstocks_daily_discussion_technicals_tuesday_mar/gpfjbdi/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614732449.0
    },
    {
        "author": "ComfortMailbox",
        "body": "you are correct but why has the stock done what is it doing . IDK i think its a good comp owned by Intel (30% i believe) , the group holds 184 patents and patents pending and numerous IP licenses in the Video Eye wear field. On January 25, the company announced that it has partnered with the  overseas subsidiaries of KDDI Group, one of Asia’s largest  telecommunications providers, in order to provide its smart glasses to  customers in Asia.  Also February 4, Vuzix said it had completed the first phase of development  with a US medical partner to build a customized head-mounted display  system for assisted cancer surgery. So, it does look like its going in the right direction (for me anyways) and also i tried their product once and i quite liked it so there is also that.",
        "created_utc": 1614720245,
        "id": "gpgm0dl",
        "permalink": "/r/stocks/comments/lw5ejc/vuzi_long_term_hold/gpgm0dl/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614749045.0
    },
    {
        "author": "Everyman_B",
        "body": "2.. So a midcap stock for ntm. AMD? INTC?",
        "created_utc": 1614725711,
        "id": "gpgxy78",
        "permalink": "/r/options/comments/lwdy0j/cheap_option_calls/gpgxy78/",
        "score": 1,
        "subreddit": "options",
        "created": 1614754511.0
    },
    {
        "author": "Kobeissi2",
        "body": "Honestly. Their Ryzen line is miles ahead of Intel and their RX 6XXX series are getting closer to Nvidia. It never seems to go up.",
        "created_utc": 1614700899,
        "id": "gpfd47m",
        "permalink": "/r/stocks/comments/lvz0ry/rstocks_daily_discussion_technicals_tuesday_mar/gpfd47m/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614729699.0
    },
    {
        "author": "DrBix",
        "body": "Picked up some INTC Jan 21 2022 60 Call on Monday.  Not cheap, but could pay out huge.  Might pick up more on the dip tomorrow.",
        "created_utc": 1614721205,
        "id": "gpgo7hw",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpgo7hw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614750005.0
    },
    {
        "author": "PetulantWaffle",
        "body": "Intel is told to pay $2.18 billion after losing a patent trial. Yesterday. Look it up.",
        "created_utc": 1614751629,
        "id": "gpi9aly",
        "permalink": "/r/pennystocks/comments/lo4jjc/nlst_netlist_inc_vs_google_google_lost_and_now_is/gpi9aly/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1614780429.0
    },
    {
        "author": "cartertown11",
        "body": "NLST broke 1.50 today a new high. 🚀🚀🚀\nAfter the hynix and google trial finish this will explode. Intel lost to VSLI today for patent infringement for 2.18 billion. NLST on deck",
        "created_utc": 1614721933,
        "id": "gpgpvkw",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpgpvkw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614750733.0
    },
    {
        "author": "iamfromatlanta",
        "body": "Compute Health Acquisition $750MM SPAC raised by Intel Chairman and backed by Medtronic, next big thing but needs time for a proper acquisition. Keep it on your radar.\n\nhttps://markets.businessinsider.com/news/stocks/intel-chairman-raises-750-million-compute-health-spac-backed-medtronic-2021-1-1029986635",
        "created_utc": 1614713158,
        "id": "gpg5dot",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpg5dot/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614741958.0
    },
    {
        "author": "DowGoldRatio",
        "body": "Go to [Stockcharts.com](https://Stockcharts.com)  It's free unless you want to save and keep your charts.  \n\nEnter this symbol     AAPL:INTC   which will show you a ratio chart of the two.  I use ratio charts all the time to pick between two positions, (stocks or ETFs) that I may like.  \n\nIf the chart is going up, the first symbol is outperforming the second.\n\nIf the chart is falling, the second symbol is outperforming\n\nIf the chart is going sideways, they are doing about equally well.\n\nSee if you can change the time period to ten years.\n\nWhat you will see is that AAPL and INTC pretty much performed the same until 2020 when AAPL took off and clobbered INTC&gt;\n\nBUT around January 1 2021, that relationship changed.  Change the time period to year to date.\n\nYear to date AAPL is down about 5% while INTC is up about 25%.  \n\nI would go with the one what's going up the mostest.  That's Intel.\n\nYou can do the same with SPY:QQQ and see that QQQ has clobbered the S&amp;P since 2013.\n\nQQQj:QQQ shows QQQJ is the one going up the most.\n\nBut if you want to see the one blowing virtually everything else out of the water, use FNGU as the first symbol and substitute any thing else for the second one.   Make your chart three years as FNGU has only been out that long.",
        "created_utc": 1614713341,
        "id": "gpg5syo",
        "permalink": "/r/stocks/comments/lvuk88/what_would_you_do_with_5k/gpg5syo/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1614742141.0
    },
    {
        "author": "PetulantWaffle",
        "body": "Intel is told to pay $2.18 billion after losing a patent trial. Yesterday. Look it up.",
        "created_utc": 1614751687,
        "id": "gpi9dje",
        "permalink": "/r/pennystocks/comments/lo4jjc/nlst_netlist_inc_vs_google_google_lost_and_now_is/gpi9dje/",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1614780487.0
    },
    {
        "author": "ockuts",
        "body": "Almost bought intc....talked myself out of it",
        "created_utc": 1614707716,
        "id": "gpfsnj9",
        "permalink": "/r/wallstreetbets/comments/lvzh9h/daily_discussion_thread_for_march_02_2021/gpfsnj9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1614736516.0
    },
    {
        "author": "getmoneyTb",
        "body": "Intc looks decent rn",
        "created_utc": 1614725793,
        "id": "gpgy4cb",
        "permalink": "/r/options/comments/lwdy0j/cheap_option_calls/gpgy4cb/",
        "score": 1,
        "subreddit": "options",
        "created": 1614754593.0
    },
    {
        "author": "PingPongPeco",
        "body": "The day I finally buy INTC FD's again they get slapped a 2b fine.. ok.",
        "created_utc": 1614746145,
        "id": "gpi15d2",
        "permalink": "/r/wallstreetbets/comments/lwce20/what_are_your_moves_tomorrow_march_03_2021/gpi15d2/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1614774945.0
    },
    {
        "author": "the_ukes",
        "body": "Ahh ok! Appreciate the intel 🙏 I will hope the market contains to stay relatively low for anither day or so and go into a Bank to set up a Direct Investing/Trading Account. \nI believe TD is the frontrunner when it comes to that..",
        "created_utc": 1614710010,
        "id": "gpfxyir",
        "permalink": "/r/CanadianInvestor/comments/lvzh8n/daily_discussion_thread_for_march_02_2021/gpfxyir/",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1614738810.0
    },
    {
        "author": "Aikmero",
        "body": "Yes. The tech sector will drop. It's over valued anyways, and I want a better entry for TSM and INTC. \n\nCheck the industrial stocks during the 2000 pop. Oil will be fine if silicon valley implodes, I'm betting on it, so I hope it plays out similarly. \n\nI also whole hearted believe the US will be in a balance sheet recession like Japan was.\n\nInflation will not actually manifest in a meaningful way and it will baffle people like it baffled economists in Japan for 30 years.",
        "created_utc": 1614755847,
        "id": "gpielqq",
        "permalink": "/r/options/comments/lwfsl5/help_me_find_a_5_stock_with_weekly_options/gpielqq/",
        "score": 0,
        "subreddit": "options",
        "created": 1614784647.0
    }
]