[
    {
        "author": "TouksMode",
        "body": "High dividend growth stocks : \nUnited health group \nUnion Pacific group \nNorthrop grumman Corp \nMicrosoft\nJpmorgan \nVisa\nHome Depot\nAbbott labs\nBroadcom\nTexas Instruments \nCostco\nNextera energy \nBlack rock \nStarbucks \nS&amp;p global inc\nActivision blizzard\nSherwin-williams \nAir products &amp; chemicals \nL3 harris technologies\nT Rowe price",
        "created_utc": 1625644695,
        "id": "h4bz8q9",
        "score": 8,
        "subreddit": "investing",
        "created": 1625673495.0
    },
    {
        "author": "DoDaOpposite",
        "body": "This post from 20-30 years ago....\n\nConcentration on long term plays - consolidating down to 10 stock portfolio\n\nLooking to concentrate and leave 10 total stocks in my portfolio and just   \nauto-buy every month. I have a 5 stocks that I’m certain on, can anyone   \nsuggest or list their favorite ones?\n\n1. DEC\n2. SunMicrosystems\n3. Yahoo\n4. AOL\n5. Broadcom\n\nI understand that I’m very tech heavy but I believe tech will continue   \nto dominate for the next few decades - that’s my personal opinion. As   \nfor the next 5 stocks, please give your inputs and favorites.",
        "created_utc": 1626010804,
        "id": "h4t2gwb",
        "score": 5,
        "subreddit": "stocks",
        "created": 1626039604.0
    },
    {
        "author": "toydan",
        "body": "I sold out of today. Just have to deleverage some, but so heavy semis. Traded it for some $AVGO\n\nSemis gotta run here at some point Bones!",
        "created_utc": 1626367427,
        "id": "h5ake10",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1626396227.0
    },
    {
        "author": "marioistic",
        "body": "How much more will Broadcom drop on the monopoly charge news?",
        "created_utc": 1625248476,
        "id": "h3txxfq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1625277276.0
    },
    {
        "author": "brad2570",
        "body": "Got AVGO calls on the dip 🙂 spreads turned out being wide eod.🤞",
        "created_utc": 1625520736,
        "id": "h464j32",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625549536.0
    },
    {
        "author": "ElderlyYeti",
        "body": "I have a small position in QCOM (3% of my portfolio) that I plan on adding to over the next few months.  I'm not in a rush though, probably wait for it to dip back into the low 130s.  I'd also recommend you look at AVGO as well.  \n\nBoth of these stocks have run up quite a bit over the last year so it isn't practical to expect those returns to continue which is why I'd stress a bit of patience on an entry point.",
        "created_utc": 1625252920,
        "id": "h3u8f46",
        "score": 2,
        "subreddit": "investing",
        "created": 1625281720.0
    },
    {
        "author": "Ragnar12000",
        "body": "AVGO on the bounce!!",
        "created_utc": 1626107645,
        "id": "h4xqpsj",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1626136445.0
    },
    {
        "author": "nintendofn35",
        "body": "Apple Amazon avgo pltr",
        "created_utc": 1625587046,
        "id": "h48zjzy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625615846.0
    },
    {
        "author": "ceskanda",
        "body": "I always want to play avgo but the spreads are super 🌈",
        "created_utc": 1625521026,
        "id": "h4652z7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625549826.0
    },
    {
        "author": "Sir_Nix-a-Lot",
        "body": "My portfolio is a disaster today… Broadcom, Boeing, Lordstown…all getting f’d today… At least I have the weekend off work",
        "created_utc": 1625243121,
        "id": "h3tl1sq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625271921.0
    },
    {
        "author": "UnseasonedAndCrispy",
        "body": "CLF, SPCE, AVGO, APPS, SQ headed into the weekend let’s go",
        "created_utc": 1625864327,
        "id": "h4mtcyx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1625893127.0
    },
    {
        "author": "CrosscutDuck",
        "body": "Should be an easy quick little day trade on AVGO with the monopoly news",
        "created_utc": 1625242859,
        "id": "h3tkfbz",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625271659.0
    },
    {
        "author": "mihail_markov",
        "body": "Dont forget intel, Qualcomm, broadcom, they are all decent.",
        "created_utc": 1625748898,
        "id": "h4gvb5y",
        "score": 1,
        "subreddit": "stocks",
        "created": 1625777698.0
    },
    {
        "author": "seanprizzle",
        "body": "Just sold T for NLY for the dependable dividend, low RSI and position in the mortgage cycle.  Do a search on the articles.  Lots of positive vibes out there.  I'll eventually use the 10%+ to buy other dividend growers like ABBV, AVGO, HD, ITW, UNH, AMAT, NVDA and CMCSA once their more attractively priced. Other current opportunities lie in ENB and MO/BTI. Good luck!",
        "created_utc": 1627195331,
        "id": "h6g77iu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627224131.0
    },
    {
        "author": "p_giggles",
        "body": "You are overestimating bitcoin's impact on the broader semiconductor market. Last time bitcoin shit the bed in 2017 NVDA was the only company affected by it.  Companies making datacenter switches (AVGO) or PC CPUs (INTC) or mobile basebands (QCOM) or analog chips (TXN) do not care about crypto because their parts aren't used for it. \n\nI'm not sure who you're referencing by \"all the suppliers.\" Are you referring to GPU suppliers? Because it's NVDA with a little bit of AMD.",
        "created_utc": 1626481120,
        "id": "h5gmwv3",
        "score": 1,
        "subreddit": "investing",
        "created": 1626509920.0
    },
    {
        "author": "ScroogeMcThrowaway",
        "body": "AVGO unfazed by puny FTC news.",
        "created_utc": 1625248616,
        "id": "h3ty9g4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625277416.0
    },
    {
        "author": "Chugalug_674",
        "body": "For a few months, Ive kicked around NCLH $30 calls for January and finally pulled the trigger.  I'm not a cruse fan or even a customer but I understand the demographic.  I freely admit the balance sheet is troubling and long term they have some very real challenges.  I'm of the belief that recent COVID-19 Delta fears coupled with CDC court battles are the reason this travel leisure play has not caught traction ([https://www.clickorlando.com/news/2021/07/08/cdc-asks-court-to-put-florida-cruise-ruling-on-hold-after-judge-refuses/](https://www.clickorlando.com/news/2021/07/08/cdc-asks-court-to-put-florida-cruise-ruling-on-hold-after-judge-refuses/)).  \n\nRising options activity in OTM calls has my interest ([https://www.nasdaq.com/articles/noteworthy-tuesday-option-activity%3A-nclh-nke-avgo-2021-07-06](https://www.nasdaq.com/articles/noteworthy-tuesday-option-activity%3A-nclh-nke-avgo-2021-07-06)). I've made some significant returns this past CY on Gaming and REITs (CZR;SPG).   I rarely get into trading an industry i'm not long on however but this is the exception.  Listening to the last investor call and forward guidance based on bookings,  I think the upside returns are worth the risk.  This does assume positive CDC actions and continued vaccinations along with a strong August call.  I expect $36-$38 range by October.",
        "created_utc": 1625774500,
        "id": "h4ifjas",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1625803300.0
    },
    {
        "author": "555-Rally",
        "body": "Not saying the capacity might not be constrained, but my orders for network switches wasn't delayed because of the Broadcom chip fabrication (comparable primary chip like AMD in an Xbox).   It was the power regulation chip in the PSU delayed.  $5k switches that don't ship because a $4 power regulator chip can't be had.   6months+ waiting for a switch...  \n\n\nIt might not even be AMD's production with TSMC that's delaying an Xbox or PS5 production.  It could be some other chip can't be had in production.  And, from a profit perspective, AMD is likely getting chips to the production for those Xbox and Playstations, and getting paid for it...while the end product still isn't shipped.",
        "created_utc": 1627518855,
        "id": "h6wcyum",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627547655.0
    },
    {
        "author": "felunk",
        "body": "...for Apple, go over the wireless results of companies that sell to them.  AVGO wireless division gets 100% of revenues from apple so i like to watch their quarterly results, QCOM/SWKS/QRVO are also good indicators...",
        "created_utc": 1627560005,
        "id": "h6y2t47",
        "score": 1,
        "subreddit": "stocks",
        "created": 1627588805.0
    },
    {
        "author": "gumby9",
        "body": "$AVGO is primed to breakout w/ Apple ATH. Gonna Play some lotto and 8/20 swings!",
        "created_utc": 1626053191,
        "id": "h4vez0h",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1626081991.0
    },
    {
        "author": "Initial-Good4678",
        "body": "Apple is on borrowed time until they replace the most unimaginative bore to ever run a company. When they actually innovate again, instead of just releasing the next iphone, they’ll stay where they are. Tesla is losing market share everytime a real car company releases a car, so they are a no.\n\nAmazon...well, they have AWS and that will be Skynet in the next 10 years, so 5 trillion may be an under valuation. Facebook and Instagram...maybe, but there are up and coming competitors that are more nimble and creative. One of them may become the next it thing and will carve a piece out of Facebook. Nvidia/Qualcomm/Broadcom may surprise everyone and be the next golden child.\n\nwhen microsoft invents artificial flesh and graphs it to Watson’s A.I., they will have true artifical sentience. Either that will cause it stocks to shoot to the moon or will crash heavily.",
        "created_utc": 1625950444,
        "id": "h4qmql0",
        "score": -1,
        "subreddit": "stocks",
        "created": 1625979244.0
    },
    {
        "author": "Fuelrod_son_of_Zippy",
        "body": "From a Citibank analyst, indicating that U.K. Regulators were favorable after Broadcom, Marvell ($MRVL) and Taiwan’s Mediatek looked favorably on the acquisition.  Additionally, Jensen Huang (NVDA’s CEO), recently spoke about the acquisition and said that things were going well.",
        "created_utc": 1625525111,
        "id": "h46crok",
        "score": -1,
        "subreddit": "stocks",
        "created": 1625553911.0
    }
]