[
    {
        "author": "Amazing_Succotash677",
        "body": "MRVL, AMD, AMAT, ADI to name a few",
        "created_utc": 1625064862,
        "id": "h3kenaj",
        "score": 7,
        "subreddit": "stocks",
        "created": 1625093662.0
    },
    {
        "author": "creemeeseason",
        "body": "I've been eyeing ADI (analog devices) or TXN (Texas instruments). They make analog chips instead of digital and have a virtual duopoly. Analog chips have a long life cycle, sometimes 10 years plus, so these companies aren't in a constant technology cycle race. As a result they basically mint money off existing tech. \n\nNot as glamorous, but their chops go into everything. 5g, cars, phones, satellites, industry... basically all growing fields.",
        "created_utc": 1623403834,
        "id": "h1dunbc",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623432634.0
    },
    {
        "author": "_AnecdotalEvidence_",
        "body": "ADI",
        "created_utc": 1623335621,
        "id": "h1a8jel",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623364421.0
    },
    {
        "author": "Dan_inKuwait",
        "body": "What's the ticker here? ADI or BMS?",
        "created_utc": 1622557207,
        "id": "h0724u4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622586007.0
    },
    {
        "author": "Amazing_Succotash677",
        "body": "I have all of those as well, check out ADI too",
        "created_utc": 1624749312,
        "id": "h35mun2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624778112.0
    },
    {
        "author": "Onetimebird13",
        "body": "Amazon, Tencent, Facebook, Microsoft, Baba, Lowes, Honeywell, Nvidia, Qualcomm, Apple, MercadoLibre, Etsy, Shopify, Visa, PayPal, Zscaler, Brookfield Assest, Nextera Energy, Abbvie, Vertex Pharma, Match, blizzard, T-Mobile, TD bank, Blackrock, Adobe, Unity, Autodesk, Macerich",
        "created_utc": 1623626743,
        "id": "h1oa3gy",
        "score": 46,
        "subreddit": "ValueInvesting",
        "created": 1623655543.0
    },
    {
        "author": "flobbley",
        "body": "Autodesk\n\nIt's not new and it's not super exciting tech or anything, but they're super ingrained into everything Civil Engineering and 3D modeling for design purposes. That and the stock is currently pretty reasonably priced.",
        "created_utc": 1622737981,
        "id": "h0ggzi9",
        "score": 34,
        "subreddit": "stocks",
        "created": 1622766781.0
    },
    {
        "author": "Paulbo83",
        "body": "I use autodesk products every day for work and interned there in college. That is a money making machine right there",
        "created_utc": 1622742981,
        "id": "h0gt3kk",
        "score": 13,
        "subreddit": "stocks",
        "created": 1622771781.0
    },
    {
        "author": "0ddb4l1",
        "body": "unfortunately adsk is severely overpriced. I've been a holder since $140 but recently sold out at $288. With that being said, Autodesk isn't going anywhere but up long term.\n\nThey have some solid stuff in the works with Autodesk Build and will continue to acquire companies to achieve growth.\n\nI personally like $PCOR and RSTAY/RSTAF",
        "created_utc": 1622755031,
        "id": "h0hloxu",
        "score": 11,
        "subreddit": "stocks",
        "created": 1622783831.0
    },
    {
        "author": "resi5",
        "body": "I miss the days where you could torrent any piece of professional software and use a cracked code to install it. Bastards are milking money with the subscription model now.. I miss the glory days of pirating 🏴‍☠️\n\n$ADBE $ADSK 🚀",
        "created_utc": 1624331062,
        "id": "h2m1fxn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1624359862.0
    },
    {
        "author": "babaNK",
        "body": "AutoDesk has a shitload of software, not only AutoCad/Inventor",
        "created_utc": 1622755672,
        "id": "h0hnfs2",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622784472.0
    },
    {
        "author": "HorseLove19",
        "body": "Autodesk pretty much dominates the 2D modeling space I think. I used solidworks in school this year and it’s awesome, but applying for civil engineering they really want u to know 2D planning stuff like autocad and revit",
        "created_utc": 1622761248,
        "id": "h0hzhuq",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622790048.0
    },
    {
        "author": "Ripoldo",
        "body": "Software is the worst. Adobe, Autodesk, Microsoft office, I use these a lot and the only major changes they've made in decades are how it looks. I think half their employees must be icon desingers. And now that everything's subscription based they'll probably stop even doing that.",
        "created_utc": 1622906313,
        "id": "h0ozfdy",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622935113.0
    },
    {
        "author": "faster-than-car",
        "body": "Bought: hasbro, Etsy, Autodesk.\n\nSold: crsr, msft.",
        "created_utc": 1623686109,
        "id": "h1qqsjy",
        "score": 3,
        "subreddit": "stocks",
        "created": 1623714909.0
    },
    {
        "author": "rygo796",
        "body": "Computer Aided Engineering, CAE.\n\nHard to say if there's any particular standouts.  Entire industry with solid growth and \\*gasp\\* profitability.\n\nPTC, ADSK, ANSS are some of the big ones.  CDNS and SNPS for EDA.",
        "created_utc": 1624455090,
        "id": "h2rl01y",
        "score": 3,
        "subreddit": "stocks",
        "created": 1624483890.0
    },
    {
        "author": "Summebride",
        "body": "Autodesk is nice, but I always prefer Adobe in that category.  Autodesk is needed by very niche companies and departments.  But Adobe software is needed by basically everyone.  Market is way more broad.",
        "created_utc": 1622786036,
        "id": "h0jazk6",
        "score": 3,
        "subreddit": "stocks",
        "created": 1622814836.0
    },
    {
        "author": "lordjonas88",
        "body": "Autodesk",
        "created_utc": 1624669101,
        "id": "h324sa5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1624697901.0
    },
    {
        "author": "JonskMusic",
        "body": "Exactly. I don't get it. I mean... photoshop is/was ubiquitous but. its pricey for people. There are people who want to make content and can't afford 50 a month for Premiere etc. Also Adobe has been teasing some really cool AI stuff for years.... but where is it? They haven't really done anything huge in a while.. Creative Cloud is okay.. but its clunky and people don't like paying subscription and they don't like dealing with millions of passwords on an enterprise level etc. Adobe could be great.. but they need to do something big.... although every lawyer on the planet uses Acrobat and calls it Adobe. \"Do you have adobe?\"... Yet acrobat itself is kind of clunky as well.   \n\n\nBut who is their rival? If you look it up.. None of those companies have much to do with creating content: \"Adobe's top competitors include SAP, Salesforce, DocuSign, Dropbox, Getty Images, Shutterstock, Apple, Microsoft, IBM and Autodesk. Adobe is a software company developing digital marketing and media solutions.\"",
        "created_utc": 1623511752,
        "id": "h1iveuq",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1623540552.0
    },
    {
        "author": "DontUseEris",
        "body": "Neither is for assemblage. The CAD (assemblage software) is either SolidWorks  or AutoDesk. \n\nChegg has the answers to a lot of the questions in the textbooks it also has 24/7 tutoring. \n\nWolfram Alpha can answer almost any math question. If you are willing to go pro, I will show you how it got the answer.",
        "created_utc": 1623608000,
        "id": "h1n93zo",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623636800.0
    },
    {
        "author": "notbrokemexican",
        "body": "Wrote about this. Autodesk directly lobbies for an infrastructure bill since it benefits from both long term training and subscriptions. Some projects may take much longer than scheduled, resulting in bonus income for orgs like Autodesk.\n\nThey have also done interesting things like enter the water business through acquisitions like Innovyze.\n\nhttps://www.reddit.com/r/wallstreetbets/comments/mjcpfw/understanding_the_infrastructure_bill_the_federal/?utm_medium=android_app&amp;utm_source=share",
        "created_utc": 1624634738,
        "id": "h3067ko",
        "score": 1,
        "subreddit": "stocks",
        "created": 1624663538.0
    },
    {
        "author": "RationalExuberance7",
        "body": "Great ideas. \n\nFor allocation, I’d say:\n\n49.5% Autodesk\n\n49.5% Alibaba\n\n1% everything else",
        "created_utc": 1623696340,
        "id": "h1rdq2e",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623725140.0
    },
    {
        "author": "babywhiz",
        "body": "They did buy out OriginPC back in 2019 as well, which is where we get our Engineering Workstations from (Thanks Autodesk). \n\nhttps://www.originpc.com/landing/2019/corsair-acquires-origin-pc/",
        "created_utc": 1623755662,
        "id": "h1u3v47",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623784462.0
    },
    {
        "author": "faster-than-car",
        "body": "Autodesk",
        "created_utc": 1623823664,
        "id": "h1xuazl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623852464.0
    },
    {
        "author": "SpreadTheGlutes",
        "body": "$V $ADSK are my two US holdings",
        "created_utc": 1623348800,
        "id": "h1b4ldy",
        "score": 0,
        "subreddit": "CanadianInvestor",
        "created": 1623377600.0
    },
    {
        "author": "10xwannabe",
        "body": "Okay guess you are not invested then?  :)  \n\nNot to start a debate, but I would be careful sitting on your high horse looking down on all of us before you look at yourself.  If you do any broad based index fund investing then you are undoubtedly invested in tobacco and alcohol companies.  Tobacco is linked to the 5 leading causes of death in America (likely same in Canada).  Alcohol is related to 50% of all fatal car accidents in America (likely same in Canada).  If you wear sneakers or any type of clothing you would be surprised what type of at best adult and at worst child sweat shops they are made from in third-third world companies. If you like green energy you would be surprised at how much oil is needed to make green energy products.\n\nTrust me NO ONE really can stand on a pedestal in this day in age.  Just matters what you accept and what you choose to not be cognizant of in your daily life.  Running a google search itself consumes energy (carbon footprint).  I doubt you are outside planting trees to make up for it.    \n\nBTW, sticking to this discussion.  How many water wells has Disney (part owner) and Nat Geo dug or paid for in Namibia vs. RECAF?  RECAF cares about making money, but as far as I know they have done more for the Namibian people then Nat Geo does/has despite the latter making millions of their story to sell articles. \n\nThe problem with the green folks is they are ALWAYS hypocritical.  How did those journalist get to Namibia to do the article?  They flew.  Did they plant trees or pay for conversion of methane gases in landfills to make their flights carbon neutral?  Nope.  \n\nJust keep in mind the old adage if you point one finger at someone there are 3 pointing right back at you.",
        "created_utc": 1622837648,
        "id": "h0lwtfo",
        "score": 11,
        "subreddit": "pennystocks",
        "created": 1622866448.0
    },
    {
        "author": "LaOnionLaUnion",
        "body": "I think it’s going to be a major player in ML/AI coupled with its products. As a developer, their play with arm chips seems huge. Having a development machine that runs arm natively and which is already popular with developers is probably a bigger step than most people are cognizant of. It’s hardly a home run at this point but it reminds me that they are still making big Silicon Valley style plays and thinking big picture.",
        "created_utc": 1622757566,
        "id": "h0hrmkl",
        "score": 4,
        "subreddit": "investing",
        "created": 1622786366.0
    },
    {
        "author": "ElCalvo069",
        "body": "You have 7 months to go so that's 2 earnings reports and potentially some holiday sales info. If your analysis leads you to believe that you'll be ITM then wait it out. \n\nJust be cognizant of time decay (theta) which accelerates the closer you get to expiry and eats into the value of the option.\n\nAnd like others mentioned - have an exit plan before executing the trade.",
        "created_utc": 1622581025,
        "id": "h08jiwu",
        "score": 1,
        "subreddit": "options",
        "created": 1622609825.0
    },
    {
        "author": "Reddit_Nicholas",
        "body": "What do you think of CTSH?",
        "created_utc": 1623116750,
        "id": "h0zdveg",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1623145550.0
    },
    {
        "author": "SpeedoCheeto",
        "body": "Lmfao the echo chamber of hedgie interests is somehow briefly cognizant",
        "created_utc": 1623137717,
        "id": "h109u2w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623166517.0
    },
    {
        "author": "cricketfan2",
        "body": "Flower food \n\nMaximus\n\nBrunswick corporation \n\nBooz Allen Hamilton \n\nJ.B Hunt transport \n\nExpeditor International \n\nPulte Group \n\nOwen corning \n\nAmkor",
        "created_utc": 1622534495,
        "id": "h066677",
        "score": 10,
        "subreddit": "ValueInvesting",
        "created": 1622563295.0
    },
    {
        "author": "juan62389",
        "body": "GLW",
        "created_utc": 1622563745,
        "id": "h07glj3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622592545.0
    },
    {
        "author": "juan62389",
        "body": "GLW \n-Apple\n-Samsung \n-Pfizer\n-New 5G fiber optics tech\nGLW🦾🦾🦾🤓🦍🚀",
        "created_utc": 1622818124,
        "id": "h0kn5c1",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622846924.0
    },
    {
        "author": "1UpUrBum",
        "body": "https://wallmine.com/nyse/glw\n\nThat one is kept up-to-date. Go down the right side of the page a bit.\n\nWhen you learn to click the right buttons it will get you to here https://wallmine.com/nyse/glw/insider-trading",
        "created_utc": 1622984165,
        "id": "h0sgi7c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623012965.0
    },
    {
        "author": "Dragon22wastaken",
        "body": "ouch-- my biggest down other than GLW in 2000s -98 but that was just 1 token share of VIX thing to track..  Paid over $500 cuz 23 March 2020--",
        "created_utc": 1623004472,
        "id": "h0tkran",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1623033272.0
    },
    {
        "author": "juan62389",
        "body": "CORNING, N.Y., June 03, 2021 (GLOBE NEWSWIRE) -- Corning Incorporated (NYSE:GLW) today introduced its latest innovation, Corning SMF-28® Contour optical fiber, to help telecommunications operators address the ever-expanding number of connected devices, build-out of 5G networks, and advances in cloud computing.​\nNetworks perform at their best when errors are minimized during fiber installation and when existing infrastructure is used efficiently during upgrades. Corning engineered SMF-28 Contour fiber to meet those needs. This groundbreaking product will allow customers to seamlessly upgrade their optical infrastructures, enabling the cost-effective deployment of future-ready networks. The fiber offers:",
        "created_utc": 1622736695,
        "id": "h0gdwpr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622765495.0
    },
    {
        "author": "juan62389",
        "body": "GLW \nApple\nSamsung\nPfizer(vials)\n5G\n📈🦾",
        "created_utc": 1623074491,
        "id": "h0wr99e",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1623103291.0
    },
    {
        "author": "salfkvoje",
        "body": "If you were confident that a lot of people will have suddenly more complicated taxes in 2022, what would you think about H&amp;R Block ($HRB) or Intuit ($INTU)\n\nIntuit looks pretty damn good, from pretty much any time interval. That's probably a good sign, but as a newish investor, I'm also wondering if there's a perspective where they have less room to grow than H&amp;R Block. \n\nThough also, H&amp;R has been around forever, and the history of the price action doesn't look promising. Any insights on valuing these two companies?",
        "created_utc": 1622682007,
        "id": "h0du6v6",
        "score": 5,
        "subreddit": "investing",
        "created": 1622710807.0
    },
    {
        "author": "bigtimetimmyjim22",
        "body": "Intuit just recently acquired it, I’d imagine SPAC is off the table.",
        "created_utc": 1622841263,
        "id": "h0m4t9o",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1622870063.0
    },
    {
        "author": "Cap_Space",
        "body": "Might need to buy some 4/22 calls of HRB and INTU because all these gains means we will need to do taxes for once 😳",
        "created_utc": 1622716532,
        "id": "h0f9999",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622745332.0
    },
    {
        "author": "salfkvoje",
        "body": "Calls on Intuit it is, then",
        "created_utc": 1622689166,
        "id": "h0e8efz",
        "score": 1,
        "subreddit": "investing",
        "created": 1622717966.0
    },
    {
        "author": "salfkvoje",
        "body": "Intuit and H&amp;R block LEAPS",
        "created_utc": 1622676554,
        "id": "h0dj6oy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622705354.0
    },
    {
        "author": "pdieff",
        "body": "UPST…. $50-$70 by SEP\n\nWhich of you fools think UPST will pump again after lockup expiration. Allow me to pop your cherry and encourage any of you to proof me wrong. \n\n1. 60% plus of their loans are approved and financed by 1 shady ass bank (Cross River Bank) which also finances most of the loans for shitty fintech companies like Affirm &amp; CoinBase. \n\n2. 65% of their referrals also come form one company (Intuit - INTU) via their Credit Karma platform. At any point INTU can decide to go in to lending and destroy little UPST. \n\n3. 20% of UPST is owned by one hedge fund (Third Point) they invested in UPST back in 2005 and they also own a large chunk of Sentinel One which is going public in the next month.  So if you think they won’t sell think twice.  Also with 20% ownership and only 50% of the outstanding shares able to trade prior to lockup well now you know how they drive to price so high.  \n\n4. Lastly it trades at 45X Sales in 2020 that shit was allowed in 2021 the market is gonna smell blood and decimate them.",
        "created_utc": 1623636668,
        "id": "h1orj9b",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1623665468.0
    },
    {
        "author": "salfkvoje",
        "body": "If you were confident that a lot of people will have suddenly more complicated taxes in 2022, what would you think about H&amp;R Block ($HRB) or Intuit ($INTU)\n\nIntuit looks pretty damn good, from pretty much any time interval. That's probably a good sign, but as a newish investor, I'm also wondering if there's a perspective where they have less room to grow than H&amp;R Block. \n\nThough also, H&amp;R has been around forever, and the history of the price action doesn't look promising. Any insights on valuing these two companies?",
        "created_utc": 1622682007,
        "id": "h0du6v6",
        "score": 5,
        "subreddit": "investing",
        "created": 1622710807.0
    },
    {
        "author": "The_Folkhero",
        "body": "Yes, Adobe, Intuit and Salesforce are three of my biggest position long term holdings. I like to call them the \"baby FAANGs\".",
        "created_utc": 1624215733,
        "id": "h2gg5vs",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1624244533.0
    },
    {
        "author": "bigtimetimmyjim22",
        "body": "Intuit just recently acquired it, I’d imagine SPAC is off the table.",
        "created_utc": 1622841263,
        "id": "h0m4t9o",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1622870063.0
    },
    {
        "author": "ryry1237",
        "body": "&gt;  if you invest in a company at its peak\n\nI thought INTU was at its peak when it hit $400. Now it's at $472.\n\nI thought NVDA was at its peak when it hit $600. Now it's at $713.\n\nI thought MSFT was at its peak when it hit $200. Now it's at $257.\n\nI thought GOOG was at its peak when it hit $1,700. Now it's at $2513 (I really missed the boat on this one).\n\nCalling the peaks is not nearly as easy as you think it is.",
        "created_utc": 1623547918,
        "id": "h1kqpwo",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1623576718.0
    },
    {
        "author": "RedTigey",
        "body": "$INTU Solid company, growth and great CEO",
        "created_utc": 1623519314,
        "id": "h1jah6b",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1623548114.0
    },
    {
        "author": "OneofOneViper",
        "body": "Actually the quality of loans exceeds all other lenders in the US.  The reason for this is that they are a fintech company.  They have contracts with other companies like Intuit, Schwab, etc...  They buy information for advertisement purposes, and then advertise to the type of consumer that would create a good loan candidate with the lowest risk.",
        "created_utc": 1623508463,
        "id": "h1ip5a3",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623537263.0
    },
    {
        "author": "kotoku",
        "body": "Actually, even if you dont get a refund, all the major players auto debit your bank account after X number of days, 36 for Intuit/Turbotax for example. Turbotax smashed earnings this year, so unless you think it was all from stealing HR customers I would not.",
        "created_utc": 1623532043,
        "id": "h1jz8w7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623560843.0
    },
    {
        "author": "ExistentialCricket",
        "body": "Has anyone here ever heard of or invested with MasterWorks?\n\nIt's a brokerage for investing in fine art that boasts 20% returns or more compared to the usual suspects. I have read about how fine art is kind of like the wild west because who can really say how much art is worth or appreciates and many people launder money through art. But that makes me think, is this a recession proof option? Intuit (turbo tax/quickbooks) was pushing it as an offer on their site so it must be somewhat reputable I would think.\n\nCurious of any one else's take.",
        "created_utc": 1623786435,
        "id": "h1vvyja",
        "score": 2,
        "subreddit": "investing",
        "created": 1623815235.0
    },
    {
        "author": "Cap_Space",
        "body": "Might need to buy some 4/22 calls of HRB and INTU because all these gains means we will need to do taxes for once 😳",
        "created_utc": 1622716532,
        "id": "h0f9999",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622745332.0
    },
    {
        "author": "oscarpatterson",
        "body": "Tsm / nvda / intu",
        "created_utc": 1624242100,
        "id": "h2hthxy",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1624270900.0
    },
    {
        "author": "salfkvoje",
        "body": "Calls on Intuit it is, then",
        "created_utc": 1622689166,
        "id": "h0e8efz",
        "score": 1,
        "subreddit": "investing",
        "created": 1622717966.0
    },
    {
        "author": "salfkvoje",
        "body": "Intuit and H&amp;R block LEAPS",
        "created_utc": 1622676554,
        "id": "h0dj6oy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622705354.0
    }
]