[
    {
        "author": "ekkidee",
        "body": "I'm assuming this is the coin in PayPal's universe. From PayPal's website --\n\n&gt;**Can I transfer Cryptocurrency into and out of PayPal?**  \nCurrently, you can only hold the Cryptocurrency that you buy on PayPal in your account. Additionally, the Cryptocurrency in your account cannot be transferred to other accounts on or off PayPal.\n\nSource: [link](https://www.paypal.com/us/smarthelp/article/cryptocurrency-on-paypal-faq-faq4398)\n\nThat's kind of a deal killer for me. Is there an advantage to using PayPal's currency?",
        "created_utc": 1618935404,
        "id": "gv7th2s",
        "score": 69,
        "subreddit": "investing",
        "created": 1618964204.0
    },
    {
        "author": "Mooseknuckle94",
        "body": "Primed here for CLOV, also holding PSFE, don't know shit about them but I hate paypal so I'm down with it.",
        "created_utc": 1619695588,
        "id": "gwa8frj",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1619724388.0
    },
    {
        "author": "No_Wrangler93",
        "body": "If we close above 250 eow. I will buy the first person to comment on this a GME share. Money will be sent via PayPal. Proof will be provided and the other person shall also have to provide proof they have purchased a share. Im basically giving someone $1m here if we close above that.",
        "created_utc": 1617825885,
        "id": "gtq7fmj",
        "score": 29,
        "subreddit": "wallstreetbets",
        "created": 1617854685.0
    },
    {
        "author": "TheMauiWaui",
        "body": "Why buy Paypal when you can just buy dollars and euros instead",
        "created_utc": 1618430696,
        "id": "guiyolm",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1618459496.0
    },
    {
        "author": "nanonightmare",
        "body": "Went in on PYPL instead lol.",
        "created_utc": 1618960667,
        "id": "gv9h672",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1618989467.0
    },
    {
        "author": "PkPkKbKb",
        "body": "I don’t understand Cathys trades. She pretty much is a day trader and doesn’t actually seem to have gains. She got in and hour if snap so fast and lost money. She bought PayPal at a high and liquidated at a low so that she could get square. Now liquidated square at a loss so that she can buy more Coin (now she’s down like 20% on) and dkng (down 15%). Why is she famous for doing this but when I do it I’m a just a plain ol’ tard.",
        "created_utc": 1619063741,
        "id": "gveolit",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1619092541.0
    },
    {
        "author": "UTGPodcast",
        "body": "For anyone worried about buying in, just PayPal me all of your money and I’ll do it for you. I’m a team player like that.",
        "created_utc": 1617295755,
        "id": "gt1rbf4",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1617324555.0
    },
    {
        "author": "Dozzer_22",
        "body": "Dude you want to talk about a cult look at your comment history. Literally dozens of messages a day spreading FUD.\n\nMy bet is that you gambled in this casino and lost, don’t worry, send me your paypal and i’ll transfer you some of the money we pick up from mars😘",
        "created_utc": 1619573826,
        "id": "gw4g0iz",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1619602626.0
    },
    {
        "author": "FollowMe22",
        "body": "I agree with this. I think the fears about bigger financial players like Fidelity eating into their market are a bit overdone. Traditional brokerages don't want the risk associated with crypto custody I don't believe. The reward isn't there.\n\nTheir main competition is from other crypto companies like Kraken and Binance, as well as fintech companies like Square and PayPal, and Coinbase currently has somewhat of a lead. That said I think the current valuation is laughable.",
        "created_utc": 1618456551,
        "id": "guke4le",
        "score": 10,
        "subreddit": "investing",
        "created": 1618485351.0
    },
    {
        "author": "ColorFlyFly",
        "body": "You can’t lose money investing in PYPL.",
        "created_utc": 1619807274,
        "id": "gwgdunu",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1619836074.0
    },
    {
        "author": "realister",
        "body": "lmao you really think Pelosi going to want to pay taxes on those fat gains she made with PYPL and MSFT?",
        "created_utc": 1619146560,
        "id": "gviw2gn",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1619175360.0
    },
    {
        "author": "Robinhoodsnacker",
        "body": "Square and PayPal to the freaking moon",
        "created_utc": 1617936827,
        "id": "gtw08n2",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1617965627.0
    },
    {
        "author": "AntofWallstreet",
        "body": "Im beginning to not like the stock market. Everything i touch turns to negative. So new gameplan. Paypal me some money and I’ll crash whatever stock you want",
        "created_utc": 1617809637,
        "id": "gtp5g6k",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1617838437.0
    },
    {
        "author": "Krusty7382",
        "body": "MSFT, AAPL and PYPL getting ready to start their afternoon run. Please take PLTR with you.",
        "created_utc": 1617987847,
        "id": "gty899c",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1618016647.0
    },
    {
        "author": "qsxfthnko",
        "body": "What's the sentiment around FTOC these days. I remember pre crash people were calling them the next paypal. How do you guys feel about hoping back in at these prices.",
        "created_utc": 1619089844,
        "id": "gvfje3u",
        "score": 8,
        "subreddit": "SPACs",
        "created": 1619118644.0
    },
    {
        "author": "DonKanaille_94",
        "body": "I'd like to personally thank those stocks right now:\n\nThx, Apha\n\nThx, Tlry\n\nThx. Asml\n\nThx, Soxl\n\nThx, Pypl\n\nThx, Icln\n\nThx, Tsla\n\nThx, Clov\n\nThx, avda\n\n\nAnd last but not least: SPY CALLS.\n\nI LOVE ALL OF YOU FILTHY FUCKWITS, BE BLESSED.",
        "created_utc": 1619206822,
        "id": "gvlpond",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1619235622.0
    },
    {
        "author": "TheOriginalRK",
        "body": "I fucked myself so hard today. Got so cocky with TSLA, PYPL and SQ",
        "created_utc": 1618413240,
        "id": "guhulgx",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1618442040.0
    },
    {
        "author": "realister",
        "body": "**Update on Nancy Pelosi and her PayPal play 💰**\n\n&gt;purchased 10,000 shares of PYPL on June 12 2020.\n\n&gt;purchased 50 PYPL calls on June 24 with a strike of $100 and expiration 01/21/2022.\n\n**P/L** so far for this play:\n\n+**$1,087,400** from stock\n\n+**$452,875** from the option leaps\n\nThinkorswim^^^TM screenshot:\n\nhttps://i.imgur.com/KC2mejH.png\n\n*source: https://disclosures-clerk.house.gov/PublicDisclosure/FinancialDisclosure*",
        "created_utc": 1619061275,
        "id": "gvekflu",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1619090075.0
    },
    {
        "author": "TheOriginalRK",
        "body": "This PYPL and TSLA PM dip gonna pay off",
        "created_utc": 1618406775,
        "id": "guhgqv9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1618435575.0
    },
    {
        "author": "Krusty7382",
        "body": "MSFT, AAPL, LULU, AMD &amp; PYPL just erased all my loses from yesterday.",
        "created_utc": 1618494526,
        "id": "gulrdim",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1618523326.0
    },
    {
        "author": "Krusty7382",
        "body": "Looks like AAPL, MSFT and PYPL should recover nicely from yesterday.",
        "created_utc": 1618479252,
        "id": "gul5owq",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1618508052.0
    },
    {
        "author": "StewardOfOrimon",
        "body": "AAPL\nAMZN\nDIS\nSBUX\nSQ\n\nA bit hard to choose between SQ and PYPL.",
        "created_utc": 1618678417,
        "id": "guvh1pe",
        "score": 7,
        "subreddit": "stocks",
        "created": 1618707217.0
    },
    {
        "author": "Im_A_Canadian_Eh",
        "body": "Jfc you sound like my insecure, jealous girlfriend. \n\n&gt;I invest PURELY on common sense\n\nGo jerk yourself off somewhere else. No one gives a shit. \n\n&gt;It was common sense to invest in Uber when it dropped to $22/share. Sold half of it at $51.\n\nYawn. I'm up thousands of percent on my PayPal LEAPS. Again, no one gives a shit. You aren't impressing anyone here. \n\n&gt;You can be a pawn and be a part of the group think media bullshit or you can think for yourself and make reasonable investments based on common sense.\n\nLol. At no point did I suggest investing in travel right now is a bad idea, that's all you projecting shit onto me. So maybe rethink how you actually feel about these investments, because you come off as an insecure little bitch. \n\nWhat I was pointing out, is that age old adage that \"pride goeth before the fall\". You being proud of your unrealized gains is laughable because bears take the elevator and Bulls take the stairs.",
        "created_utc": 1619123923,
        "id": "gvhl20o",
        "score": 7,
        "subreddit": "stocks",
        "created": 1619152723.0
    },
    {
        "author": "alone-in-the-chat",
        "body": "anyone on Paypal ?",
        "created_utc": 1618510223,
        "id": "gumr0mh",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1618539023.0
    },
    {
        "author": "Lure852",
        "body": "100ish. These guys aren't going to be the only game in town. Once it's normalised the big fish are going to jump in. PayPal, banks, etc.",
        "created_utc": 1618436510,
        "id": "gujbmne",
        "score": 6,
        "subreddit": "investing",
        "created": 1618465310.0
    },
    {
        "author": "rocketparrotlet",
        "body": "You can withdraw your coins to a private wallet on these exchanges.  Not so for Venmo/Paypal.  It's like buying SLV stock- you might think you \"own\" silver, but good luck selling it to a pawn shop.",
        "created_utc": 1618940773,
        "id": "gv86h2c",
        "score": 6,
        "subreddit": "investing",
        "created": 1618969573.0
    },
    {
        "author": "Jrie0",
        "body": "I have legitimately no idea what to look at right now. I hold AAPL, WFC, GM, PYPL, TGT, and SBUX. Any other stocks you guys would recommend?",
        "created_utc": 1618597030,
        "id": "gur3hcp",
        "score": 6,
        "subreddit": "stocks",
        "created": 1618625830.0
    },
    {
        "author": "RumpOldSteelSkin",
        "body": "https://www.investopedia.com/articles/investing/031416/bitcoin-vs-ethereum-driven-different-purposes.asp\n\n\n\nYou can buy in and join the hype without knowing what it is or you can read a little more and try and predict the future. Some people believe that 20-30 years from now crypto will replace physical currency.\n\n\n\nAs for me I do not have the money nor the conviction to invest in crypto right now. There are crypto ETFs you can get into if you would like to buy in but play it safe. Paypal, Tesla, some banks are getting involved and those are found in some of those ETFs.",
        "created_utc": 1619558077,
        "id": "gw3jmjc",
        "score": 6,
        "subreddit": "investing",
        "created": 1619586877.0
    },
    {
        "author": "Krusty7382",
        "body": "Let’s go AAPL!!\n\nAnd, MSFT close at $257.\n\nTake PYPL with you. \n\nPLTR you are invited too. You’re welcome.",
        "created_utc": 1617989951,
        "id": "gtyd32w",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1618018751.0
    },
    {
        "author": "ryanryans425",
        "body": "Paysafe going to be the next stock to pop off.  If you compare it’s earnings to competitors PayPal and square it’s easily a $30 stock.",
        "created_utc": 1618429043,
        "id": "guiuu8m",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618457843.0
    },
    {
        "author": "GeneEnvironmental925",
        "body": "What can someone do on Coinbase that they can't do on PayPal or Square?  Buy alts?",
        "created_utc": 1618421743,
        "id": "guieao8",
        "score": 5,
        "subreddit": "stocks",
        "created": 1618450543.0
    },
    {
        "author": "stringtheory28",
        "body": "The investing learning curve steepens. I’ve been up down and all around since starting in November. Learning every day. Based on my experiences and appetite for risk thus far, my goal is to have a portfolio that looks like this by the summer. Planning to DCA for the long run. Would love some feedback! This started as a list of 30 with way too many speculative plays. The cost of education I guess. Thanks.\n\nAAPL \nDIS\nJNJ\nPYPL\nQQQJ\nQQQ\nVOO\nVXUS\nYOLO",
        "created_utc": 1618959842,
        "id": "gv9fiba",
        "score": 5,
        "subreddit": "stocks",
        "created": 1618988642.0
    },
    {
        "author": "snyder810",
        "body": "Love the post by OP, well put together counters, but I have the same quarrel on the comp framing to meet the bullish arguments throughout. Stagnant 2020 revenue, compare to V &amp; MA multiples but leave out that they’re established blue chips who bring in 50% to the bottom line which buffers their valuation. Not profitable, compare to a bucket of companies where many just came off 50% yoy rather than stagnant growth. I’d like to have seen comps, say FOUR, FISV, PayPal, &amp; NVEI, and keep them consistent throughout the counters to show where Paysafe shines and also falls short in comparison right now to truly highlight why money would/should flow in to them rather than the others.",
        "created_utc": 1619121162,
        "id": "gvhemif",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1619149962.0
    },
    {
        "author": "Awkward-Painter-2024",
        "body": "Fintech is speculative/growth AF. They're literally trying to reimagine banking! The returns have been amazing over the past few years. Who's to say they'll win? Square has a P/E of 554 right now. Paypal is 74. Paysafe is, I don't know it... Do you due diligence. For example, I'm long $UBS because I don't really like expensive stocks and prefer boring banking...  Good luck!",
        "created_utc": 1619062581,
        "id": "gvemo9v",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619091381.0
    },
    {
        "author": "uniaintshit",
        "body": "So are those girls with Venmo/PayPal in their profile hookers?",
        "created_utc": 1618759838,
        "id": "guz6uxh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618788638.0
    },
    {
        "author": "TheWings977",
        "body": "PayPal, SQ, or AMD? What to buy?",
        "created_utc": 1619176774,
        "id": "gvjyn1k",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619205574.0
    },
    {
        "author": "dudetalking",
        "body": "This will never pass, its would be very capital destructive and put is in a terrible spot globally.\n\nThe biggest factor for investment capital, is After Tax Returns. By basically destroying any after tax preference for long term investments and holdings, we would probably see a large rush to liquidate, transfer assets to investment trusts, or even move capital overseas.\n\nThe example I use, is would America be better off, if we had taxed Elon Musk at 60% in 2003 after he sold Paypal for 1billion, along with Peter Thiel.\n\nIF anything I would give them perpetual tax credits, they have generated more tax revenue in the last 20 years from their innovations and investments, then they could ever pay by themselves.",
        "created_utc": 1619126075,
        "id": "gvhq2z5",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1619154875.0
    },
    {
        "author": "SirYoda9871",
        "body": "Fck you pypl. Go down more why don’t you. Jeezus. Are you bipolar? Decide on what tf you want to do and get back to me",
        "created_utc": 1619712505,
        "id": "gwb72i8",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619741305.0
    },
    {
        "author": "MadCritic",
        "body": "Or just look at the numbers. Earnings were 0.721 billions last year. While Paypal is valued at half the market cap of Tesla with 4.2 billion in earnings last year.",
        "created_utc": 1619784973,
        "id": "gwf0sj7",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619813773.0
    },
    {
        "author": "goodiegumdropsforme",
        "body": "I'm only down 18% on my PYPL LEAPS instead of 50% down like before. Is that what winning feels like?",
        "created_utc": 1617891470,
        "id": "gtt9rpy",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617920270.0
    },
    {
        "author": "Persis09",
        "body": "Now your PayPal or ban",
        "created_utc": 1617916779,
        "id": "gtuwgwg",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617945579.0
    },
    {
        "author": "TheOriginalRK",
        "body": "FUCK PAYPAL AND SQ YOU PILES OF GARBAGE",
        "created_utc": 1618426593,
        "id": "guip9b6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618455393.0
    },
    {
        "author": "TheHighPriestess2",
        "body": "$$$$$ My favourite part of trading day, the downvotes. I have made a ton of money over the last year since Covid and still making it. The stocks I hold (yes hold) are MSFT, AAPL, AMZN, PYPL, SQ, AMD, LULU, FCX and some other re-opening stocks too long to list. Check what all of these were worth 1 year ago. BB is the one stock “right now, in this market” that I am big on for a tech holding growth potential. I have said many times on this site I am not a bag holder on BB, but I do keep averaging “up” on it, like I did today. I chose BB as my EV growth stock over EV manufacturers because the EV manufacturers will be in heavy competition to sell a car while BB pretty much has a lock on the software and security part of the EV business - monetization of said TBD, but it will be huge. I did not buy BB at the wrong time for the wrong reasons. I know BB will start it’s real growth path soon and if it dips another 2-1/2% tomorrow I’ll buy more. For those of you who want to trash BB it’s because you’re a bag holder who bought it as a meme stock and I’m not so fuck you. For those of you who don’t see the potential and growth coming in BB that’s too bad. Check in with me in 1 year from now when it’s at $20-$25 PS on it’s way to 10 times current valuation. For those of you who downvote me because you lost money today also fuck you. My portfolio was full of green and BB will get there too when the sentiment changes and I guarantee it will.\n\nP.S. Post, pre-market and futures mean nothing. Stop looking at them and blowing up WSB when something is green. If they meant anything every single one of you here would be filthy rich by following the leader. SMH",
        "created_utc": 1618525215,
        "id": "gunoxa9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618554015.0
    },
    {
        "author": "lattiboy",
        "body": "I just went in pretty big with ARKF. Square, PayPal, Sea, and a lot of other fin tech stocks positioned for an enormous breakout. Calls are reasonable, even LEAPS",
        "created_utc": 1619041271,
        "id": "gvdgosv",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619070071.0
    },
    {
        "author": "lomoprince",
        "body": "I don’t use cash app personally but I do use Venmo. I think both are fine, square is rightly or wrongly more sensitive to crypto movements. Would have to see their monetization efforts going forward. I’ve been a happy PayPal shareholder though. Can’t go wrong with either.",
        "created_utc": 1619059738,
        "id": "gvehov1",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619088538.0
    },
    {
        "author": "Crackbot420-69",
        "body": "I think Musk is kind of a douche in many ways but in all fairness Musk and Munger both came from well connected/well off families. Munger came of age at the end of WW2, one of the most prosperous times in American history. Musk was graduating amidst the internet/information age (or atleast when the growth of the internet was really accelerating). Both are obviously quite intelligent, even if Musk says stupid shit. \n\nThey both had huge, inescapable tailwinds that while not their only reason for success, certainly helped. \n\nDumping money into something like KO or real estate in 1945, was honestly easier and less thoughtful than making some crap website in 1995 to sell to Compaq and then turning around to make Paypal.",
        "created_utc": 1619522943,
        "id": "gw1ec30",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1619551743.0
    },
    {
        "author": "lmwfy",
        "body": "imagine trying to start Paypal with this guy..",
        "created_utc": 1619475736,
        "id": "gvzf7fj",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1619504536.0
    },
    {
        "author": "SheeeeetMan",
        "body": "SQ, PYPL, ETSY, SE, PTON, MSFT.....didn’t play a one.   What did I buy?  JKS calls like a smooth brain.",
        "created_utc": 1617934862,
        "id": "gtvwncm",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617963662.0
    },
    {
        "author": "daddyneedsmoohlah",
        "body": "The mad dash for the exit for COIN bagholders when one of the big boys(fido, vanguard, paypal, amazon, schwab) announce they are coming out with a full scale exchange is going to get my dick rock hard hehehehe. COIN is nothing but a fuckin placeholder and test run for the big boys until they decide that space is here to stay and they want their cut on the fuckin action. If you think they are letting that mickey mouse company rake in all the 💰 while sitting on the sidelines you are a retard retard.",
        "created_utc": 1618497920,
        "id": "gulyo4z",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1618526720.0
    },
    {
        "author": "SabertoothWizard27",
        "body": "Right now in addition to NET and PIN, I like Affirm, PayPal, and Bitcoin for growth. I've also lowered my risk over the years to dividend stocks such as Whirlpool, Enbridge, Maple Leaf Foods and Scotia Bank. This is not advice or recommendations. I have no qualifications to be giving advice about this stuff. Just sharing.",
        "created_utc": 1619024565,
        "id": "gvcdmtq",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619053365.0
    },
    {
        "author": "J4ckstr4w84",
        "body": "If you think about your portfolio over a really long Period (10, 20, 30 years), it’s super hard to beat the s&amp;p 500. So you’re probably best off having most of your money in something like spy. But I know that’s not much fun (I pick my own stocks for my Roth IRA). So if you want to pick stocks, I’d say have 15-20 companies or so (more is fine with zero commissions now). Pick stocks that have monopolies (Apple, Facebook, Google, Amazon), the strongest brands (Starbucks, Disney, Nike), and stocks which are growing their earnings and their revenue consistently over time (United health, Home Depot). Plus maybe throw in some newer companies (just 1 or 2 or a few more if you want more than 20 stocks) that have hyper growth and you think will be dominant in 2030 or whatever (square, crowdstrike, Zillow). AI is good! (Nvidia, Tesla) And definitely have half or more of your stocks NOT tech! New investors seem to want mostly tech....you need diversity. Also, really try to have most of your stocks be on the cheaper side as far as forward P/E ratio. Under 30 forward p/e is good right now. And if it’s higher, at least have a lowish PEG ratio, like Amazon. Dividends are good too! Other stocks which will be great for many years to come are Linde, Deere, JP Morgan, Blackrock, Microsoft, Goldman Sachs, PayPal, Lam Research, Chipotle, Visa. Do your thing! Make sure you’re super diverse and have mostly the biggest, best companies that will grow earnings and revenue for many years!",
        "created_utc": 1619061606,
        "id": "gvel09e",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619090406.0
    },
    {
        "author": "Unhappy_Internet_948",
        "body": "you have to feel bad for someone who wants to buy crypto but can't figure out how to use an actual brokerage like Coinbase. \n\nespecially since this is **paypal**, expect random account locks and awful customer service",
        "created_utc": 1618937258,
        "id": "gv7xzdh",
        "score": 5,
        "subreddit": "investing",
        "created": 1618966058.0
    },
    {
        "author": "lattiboy",
        "body": "Highly recommend ARKF calls Monday. They’re heavily weighted with PayPal and Square which are way overdue for a breakout. Both reporting earnings next week. \n\nFor sure a gamble, but a very inexpensive one as the options are very reasonable, especially if you look at the option prices on the underlying stocks",
        "created_utc": 1619817686,
        "id": "gwh06s5",
        "score": 5,
        "subreddit": "stocks",
        "created": 1619846486.0
    },
    {
        "author": "the_GuelahPapyrus",
        "body": "Every day I look at PayPal, and say \"Wow should have got in yesterday, too late now\" ...\n\n\n\"Wow I should have got in yesterday, too late now\"\n\n#\"Wow I should have got in yesterday, too late now\"",
        "created_utc": 1617805987,
        "id": "gtoxaoy",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617834787.0
    },
    {
        "author": "sinisterskrilla",
        "body": "Her paypal leaps she bought in the fall printing big time",
        "created_utc": 1618609505,
        "id": "gururfk",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1618638305.0
    },
    {
        "author": "DigitalDuct",
        "body": "\" Venmo, which is owned by PayPal (PYPL) \"  \n\n\nYucky",
        "created_utc": 1618936384,
        "id": "gv7vuxb",
        "score": 4,
        "subreddit": "investing",
        "created": 1618965184.0
    },
    {
        "author": "obiwang",
        "body": "just received an job offer from PYPL. I’m a retard. Puts on PYPL",
        "created_utc": 1619071213,
        "id": "gvez130",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1619100013.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "Paypal/SQ gang we feelin' good?",
        "created_utc": 1619247783,
        "id": "gvnolrd",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1619276583.0
    },
    {
        "author": "freehouse_throwaway",
        "body": "I wish AGC had further option expiry as Oct just wasn't far enough else I would have bought more.\n\nBought 5x Oct $10c for 2.5 since last week. Sold all but one (so I can remember the position lol) for 60% gain today.\n\nI really like GRAB even at these lofty valuation but after late Feb and March it's hard to go heavy into SPAC/growth names. I suppose there's nothing wrong waiting for actual DA to buy with actual information on valuation vs speculating.\n\nOr wait for eventual merger/ticker change. One thing to note for those doing LTBH especially on growth names is that eventually funds will want/need exposure to that sector. So if they want a pure play all-in-one wechat/uber/grub/sq/pypl company that commands SE market, ETFs and funds will eventually load up on shares of GRAB/AGC. \n\nBasically how most of my long term gains from growth names panned out. Most took 2-3 years to materialize tho so definitely not a short term play.",
        "created_utc": 1617845493,
        "id": "gtrbwa0",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1617874293.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "Fuck yes Paypal. Go to 300 for Daddy.",
        "created_utc": 1617905088,
        "id": "gtu5j88",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617933888.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "Well fuck you too Paypal/SQ",
        "created_utc": 1618410036,
        "id": "guhnhi6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1618438836.0
    },
    {
        "author": "edgedrazor",
        "body": "Wtf PayPal, most of tech up except you",
        "created_utc": 1617298648,
        "id": "gt1xtn7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617327448.0
    },
    {
        "author": "RowanHarley",
        "body": "Ya, that's a good arguement, but Paypal had an annual payment volume of $700 billion in 2019. Add to that, the fact that 980,000 bitcoin are purported to be stolen from crypto exchanges as of 2017, and you have a good argument for locking their crypto supply up. The risk they bring to the table by allowing people to withdraw their crypto brings more risk than locking it up, and giving people what's essentially a piece of paper saying they own x bitcoin.",
        "created_utc": 1618941516,
        "id": "gv88bfm",
        "score": 4,
        "subreddit": "investing",
        "created": 1618970316.0
    },
    {
        "author": "-_somebody_-",
        "body": "they have no competition in their space of gambling and iGaming, they are the top payment processor for that space and Paypal/square do NOT process those kinds of payments.  theres no bear case here, they own a completely niche and extremely profitable market.  Also not sure where you see that they are in debt, but there are no 'cool companies' popping up that do what paysafe does.\n\nAlso you must not have seen that they issued the Coinbase Debit Card..  they will benefit from Coinbase.  They also process Draftkings payments..  thats double huge.  Then they also contract with Spotify and Fortnite.\n\nSo yeah, again, they have tons of 'competition' huh?",
        "created_utc": 1618952835,
        "id": "gv8zomt",
        "score": 4,
        "subreddit": "stocks",
        "created": 1618981635.0
    },
    {
        "author": "nessus42",
        "body": "I have a hard time seeing PayPal obtain the kind of market domination that Amazon has been accumulating. And for Amazon, it's not just in retail, but also in cloud computing.",
        "created_utc": 1619058348,
        "id": "gvef5gc",
        "score": 4,
        "subreddit": "stocks",
        "created": 1619087148.0
    },
    {
        "author": "lomoprince",
        "body": "That’s because Amazon has already dominated and you’re using past/current success to evaluate PayPal’s future, which isn’t logical. We have no idea where PayPal could go; the only logical thing you can conclude is the most obvious: Amazon and PayPal are two different companies doing different things in different spaces.",
        "created_utc": 1619060166,
        "id": "gveigwv",
        "score": 4,
        "subreddit": "stocks",
        "created": 1619088966.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "My Paypal calls are making pain noises. Send help.",
        "created_utc": 1619184173,
        "id": "gvkandv",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1619212973.0
    },
    {
        "author": "lattiboy",
        "body": "Grabbed some 6/18 $56 ARKF calls. Square and PayPal options are fuck you expensive and if they pop like I think they will it should rocket that ETF pretty impressively.",
        "created_utc": 1619030478,
        "id": "gvcrn4w",
        "score": 4,
        "subreddit": "stocks",
        "created": 1619059278.0
    },
    {
        "author": "Archada",
        "body": "* [Tesla taking BTC as payment for their cars, without immediately converting back to fiat](https://www.nytimes.com/2021/03/24/business/elon-musk-tesla-bitcoin.html)\n\n* [MasterCard working to integrate with Ethereum](https://www.mastercard.com/news/press/2021/april/partnership-with-consensys-supports-the-future-of-multi-blockchain-commerce/)\n\n* [Visa working on using Ethereum as a settlement layer, via USDC, a stablecoin pegged to the US Dollar](https://usa.visa.com/about-visa/newsroom/press-releases.releaseId.17821.html)\n\n* [Paypal allowing users to pay with crypto](https://www.reuters.com/article/crypto-currency-paypal-idUSL1N2LR0OD) (a step in the right direction, but as of yet you can only buy/sell on their platform, you can't deposit or withdraw from an external wallet)\n\n* [Amazon allowing for the provisioning of Ethereum nodes into AWS](https://aws.amazon.com/about-aws/whats-new/2021/03/announcing-general-availability-of-ethereum-on-amazon-managed-blockchain/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)",
        "created_utc": 1618453394,
        "id": "guk8ey7",
        "score": 4,
        "subreddit": "stocks",
        "created": 1618482194.0
    },
    {
        "author": "New_Hedgehog_8865",
        "body": "PYPL finally back up to my original purchase price! AAPL also getting close.",
        "created_utc": 1617727664,
        "id": "gtl5w31",
        "score": 4,
        "subreddit": "stocks",
        "created": 1617756464.0
    },
    {
        "author": "TheOriginalRK",
        "body": "SQ and PYPL biggest disappointment",
        "created_utc": 1618409542,
        "id": "guhmest",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1618438342.0
    },
    {
        "author": "Krusty7382",
        "body": "Pretty good day today with:\n\nBB, MSFT, AAPL, LULU, PLTR, PYPL and VUZI. Added more BB at close. Some guy told me this morning this portfolio would trade flat. Lol He’s probably the same guy who sold off yesterday and again today. SMH.",
        "created_utc": 1617921148,
        "id": "gtv5zvq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617949948.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "If somehow Paypal/SQ fuck up their ER, I will shoot babies with a bazooka. Its the only way.",
        "created_utc": 1619298032,
        "id": "gvqzg9v",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1619326832.0
    },
    {
        "author": "i_may_need_rope_soon",
        "body": "PYPL son",
        "created_utc": 1617765297,
        "id": "gtncxvx",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617794097.0
    },
    {
        "author": "dcss_west",
        "body": "yeah literally any real tech company lol. msft aapl googl amzn fb sq pypl nvda amd tsm",
        "created_utc": 1618536924,
        "id": "guobq3w",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618565724.0
    },
    {
        "author": "i_may_need_rope_soon",
        "body": "PYPL, Z",
        "created_utc": 1617656583,
        "id": "gthw7j9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1617685383.0
    },
    {
        "author": "Dastardly_Tory",
        "body": "PayPal due to letting you pay with cripple.toe.",
        "created_utc": 1617645959,
        "id": "gth8ztf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617674759.0
    },
    {
        "author": "etxsomm",
        "body": "I think it's like paypal for Europoors.",
        "created_utc": 1617647480,
        "id": "gthcb61",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617676280.0
    },
    {
        "author": "srf5067",
        "body": "He was early on PayPal and Visa as well.",
        "created_utc": 1618432802,
        "id": "guj3h6r",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618461602.0
    },
    {
        "author": "Anne_Thracks",
        "body": "Great news for us PYPL holders! Thanks for sharing.",
        "created_utc": 1618937332,
        "id": "gv7y5qn",
        "score": 3,
        "subreddit": "investing",
        "created": 1618966132.0
    },
    {
        "author": "DigitalDuct",
        "body": "you don't actually own your crypto if you buy through paypal.",
        "created_utc": 1618938704,
        "id": "gv81hxl",
        "score": 3,
        "subreddit": "investing",
        "created": 1618967504.0
    },
    {
        "author": "HumanFromTexas",
        "body": "PYPL",
        "created_utc": 1618942563,
        "id": "gv8aw9h",
        "score": 3,
        "subreddit": "stocks",
        "created": 1618971363.0
    },
    {
        "author": "lomoprince",
        "body": "I think since the late 90s, the best companies demonstrate the value of intangibles, network effect, and the infinite scalability of the internet. So I have no clue if PYPL will grow into its valuation, but given the markets it has entered/could still enter, it’s not completely unreasonable. Not to mention its platform via network effect is more valuable the more people that use it. You can use the financial apps ecosystems in Asia as an example of what PayPal could be here: stuff like Alipay etc.",
        "created_utc": 1619057834,
        "id": "gvee6k9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619086634.0
    },
    {
        "author": "OlyBomaye",
        "body": "This is good DD.  I think I can get comfortable with the risk on it.  I wish I had gotten in on PYPL a long time ago and this might be a second chance at that one.",
        "created_utc": 1618773404,
        "id": "guzz0m1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618802204.0
    },
    {
        "author": "BullOnCocaine",
        "body": "Whos in PSFE. Tell me why they wont be strangled out by Paypal",
        "created_utc": 1619283840,
        "id": "gvq6sjg",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619312640.0
    },
    {
        "author": "New_Hedgehog_8865",
        "body": "Look for some companies that are still on discounts that have upcoming earnings and that you feel good about. Here's a few of mine: AMD (4/27), AAPL (4/28), CRSR (5/4), ZNGA (5/5), PYPL (5/5), CSTL (5/10), OPEN (5/11), BMBL (5/12), DIS (5/13).",
        "created_utc": 1619188583,
        "id": "gvkjx9a",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619217383.0
    },
    {
        "author": "Krusty7382",
        "body": "Doubling down and adding to MSFT, AAPL, AMD and PYPL positions into earnings. Holding long on BB, CLOV and LULU. Put $10k into MVIS Friday morning and cashed out for a $4,200 profit on a 1 day swing trade. I may go into MVIS for another $10k Monday morning if I feel this group will support it, but lately the group has not been able to hold the line on anything, which is why I cashed out profits Friday. We will see by the Monday morning dip if I roll MVIS again.",
        "created_utc": 1619310817,
        "id": "gvrnhhs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619339617.0
    },
    {
        "author": "bagtf3",
        "body": "I'm IPOing tomorrow in the daily thread for $50 /share, unlimited shares. Trades on venmo and PayPal.",
        "created_utc": 1619748265,
        "id": "gwdjcyf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619777065.0
    },
    {
        "author": "TheWokeKiwi",
        "body": "What's happening with mastercard and paypal?",
        "created_utc": 1619713375,
        "id": "gwb974o",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619742175.0
    },
    {
        "author": "Asking4Afren",
        "body": "Looking into SQ, SHOP, SPOT, PYPL\n\nAnyone interested in these or are in them feel free to contribute why.",
        "created_utc": 1619570957,
        "id": "gw4a8ub",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619599757.0
    },
    {
        "author": "JoanOfSnarke",
        "body": "I feel like I'm the only one on this sub who will publicly acknowledge how much of a hack Musk is. Whether that be the stupid hyperloop or reusable space rocket shit. A lot of his hype comes from people who don't have a background in the physical sciences. \n\nHe got his OG money through PayPal which is no small feat. But he does not have a good grasp of physics or the physical sciences in general.",
        "created_utc": 1619477955,
        "id": "gvzjs9m",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619506755.0
    },
    {
        "author": "notworthit999",
        "body": "You don't track AAPL, MSFT, AMZN, NFLX, V, MA, ROKU, SQ, PYPL, FB, SNAP, TWTR, GOOG?",
        "created_utc": 1617809636,
        "id": "gtp5g48",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617838436.0
    },
    {
        "author": "EatMePlsDaddy",
        "body": "This Coin shit fucked my Paypal calls 🤡🤡🤡",
        "created_utc": 1618410610,
        "id": "guhoqc9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618439410.0
    },
    {
        "author": "Rshawer",
        "body": "PYPL and SQ down today? Any reason? PayPal doesn’t actually depend much on crypto at all",
        "created_utc": 1618432198,
        "id": "guj23xs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1618460998.0
    },
    {
        "author": "HourFly5581",
        "body": "I doubt Venmo's going to go anywhere, I mean everything is tied to PayPal nowadays, for better or worse...",
        "created_utc": 1618944148,
        "id": "gv8eszg",
        "score": 3,
        "subreddit": "investing",
        "created": 1618972948.0
    },
    {
        "author": "kmaco75",
        "body": "Paypal have joined the party\n\nThere will be so much competition this time next year in this space. Those margins will have to come down.",
        "created_utc": 1618992370,
        "id": "gvavd5q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619021170.0
    },
    {
        "author": "hitzelsperger",
        "body": "I think the reason PSFE is fairly discounted vs Paypal is that Paypal has been a public co. since long and are used to quarterly results whereas for PSFE - even hitting their projections reliably for two quarters should close that valuation a bit.",
        "created_utc": 1618862390,
        "id": "gv4cy6z",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1618891190.0
    },
    {
        "author": "OlyBomaye",
        "body": "I bought PYPL 6/18 $280c today.\n\nWas it a good move?  Who the fuck knows!",
        "created_utc": 1619149858,
        "id": "gvj1v2t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619178658.0
    },
    {
        "author": "LegalHelpNeeded3",
        "body": "If you want to make a difference, start a go-fund-me. They take far less than PayPal does in commissions. Also, start a website if you’re serious. Who knows if this is legit or just some guy asking 8 million people for a single dollar from each.",
        "created_utc": 1619027590,
        "id": "gvckubn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1619056390.0
    },
    {
        "author": "BoomerStocksOnly",
        "body": "You can’t compare sofi to uwmc bruh. Uwmc is more or so comparable to rkt. If you want to compare something to sofi, square, affirm and PayPal are more or so more similar.",
        "created_utc": 1617750684,
        "id": "gtmkw79",
        "score": 3,
        "subreddit": "stocks",
        "created": 1617779484.0
    },
    {
        "author": "IH8KICKFLIPS",
        "body": "Hope y’all got Qualcomm calls today",
        "created_utc": 1617320701,
        "id": "gt37k2p",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617349501.0
    },
    {
        "author": "mcinthedorm",
        "body": "My gut is telling me to buy QCom, my brain is telling me not to buy on such a Green Day when a stock is already up 4%",
        "created_utc": 1617301037,
        "id": "gt236zt",
        "score": 4,
        "subreddit": "stocks",
        "created": 1617329837.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Lol \"I followed Jim into QCOM - getting killed here\"",
        "created_utc": 1617295766,
        "id": "gt1rce0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617324566.0
    },
    {
        "author": "lattiboy",
        "body": "Up 15% overall this week off gobbling up QCOM calls when it was at $127 and buying 4  $235 MSFT calls Tuesday for $50 and selling them for $600 today. That felt fucking great.\n\nStill have WAY too many eggs in the AAPL basket for calls, but loaded up on shares at $119 too, so even if I shit the bed with calls I’ve forced myself to actually hold some stock. Trying to get to 100 shares to sell some nice calls once it gets to $127.\n\nGrabbed September calls of CVS, Comcast, Pfizer, and Coke during their dips today. Also, loaded up some August UWM calls for pocket change. Almost bought a few hundred shares of UWM, but the options were practically free. \n\nReally, honestly believe that stock should be trading at $20 and cannot for the life of me figure out it’s horrid performance.",
        "created_utc": 1617319994,
        "id": "gt36a32",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617348794.0
    },
    {
        "author": "eyerollingsex",
        "body": "QCOM been melting up all day",
        "created_utc": 1617299609,
        "id": "gt203oe",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617328409.0
    },
    {
        "author": "Odd-Yoghurt-2244",
        "body": "Qualcomm",
        "created_utc": 1617295735,
        "id": "gt1r9sy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617324535.0
    },
    {
        "author": "lattiboy",
        "body": "I’ve been loading up on tech during this absurd dip and I’m up 3% for my whole portfolio in AH trading. It’s crazy everybody wasn’t buying QCOM and AAPL and AMD and MSFT. I simply don’t ever think they’ll be as cheap again.",
        "created_utc": 1617279377,
        "id": "gt0un6w",
        "score": 1,
        "subreddit": "investing",
        "created": 1617308177.0
    },
    {
        "author": "Amazing_Succotash677",
        "body": "If you're looking for a slam dunk invest in QCOM!",
        "created_utc": 1617374255,
        "id": "gt57nvs",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1617403055.0
    },
    {
        "author": "IH8KICKFLIPS",
        "body": "Hope y’all got Qualcomm calls today",
        "created_utc": 1617320676,
        "id": "gt37ihl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617349476.0
    },
    {
        "author": "DaddyDersch",
        "body": "I looked so hard at QCOM, AMD, AMAT and NEE on Wednesday even had an order in and then canceled it. #regrets.",
        "created_utc": 1617338367,
        "id": "gt40mim",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617367167.0
    },
    {
        "author": "raffiegang",
        "body": "Shares ASML , TSM , QCOM when price dips",
        "created_utc": 1617264250,
        "id": "gt0anod",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617293050.0
    },
    {
        "author": "crvernon",
        "body": "Unfortunately, it won’t go through. I’m still holding NVIDIA. But Qualcomm is the better ARM play.",
        "created_utc": 1617332941,
        "id": "gt3smp2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617361741.0
    },
    {
        "author": "Shaun8030",
        "body": "Stocks :\n\nMSFT , AAPL , Amzn , GOOG , Dis, QCOM , Nvidia , Amd, TSM, SQ , Pypl, , Shop, Shop , Tsla , BTC ,Adbe. \n\nETFs\n\nQQQM, QQQJ, VGT , SMH , WCLD, ARKW, ARKG,ICLN",
        "created_utc": 1617370393,
        "id": "gt50r1a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617399193.0
    },
    {
        "author": "IH8KICKFLIPS",
        "body": "Hope y’all got Qualcomm calls today",
        "created_utc": 1617320701,
        "id": "gt37k2p",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617349501.0
    },
    {
        "author": "mcinthedorm",
        "body": "My gut is telling me to buy QCom, my brain is telling me not to buy on such a Green Day when a stock is already up 4%",
        "created_utc": 1617301037,
        "id": "gt236zt",
        "score": 4,
        "subreddit": "stocks",
        "created": 1617329837.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Lol \"I followed Jim into QCOM - getting killed here\"",
        "created_utc": 1617295766,
        "id": "gt1rce0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617324566.0
    },
    {
        "author": "lattiboy",
        "body": "Up 15% overall this week off gobbling up QCOM calls when it was at $127 and buying 4  $235 MSFT calls Tuesday for $50 and selling them for $600 today. That felt fucking great.\n\nStill have WAY too many eggs in the AAPL basket for calls, but loaded up on shares at $119 too, so even if I shit the bed with calls I’ve forced myself to actually hold some stock. Trying to get to 100 shares to sell some nice calls once it gets to $127.\n\nGrabbed September calls of CVS, Comcast, Pfizer, and Coke during their dips today. Also, loaded up some August UWM calls for pocket change. Almost bought a few hundred shares of UWM, but the options were practically free. \n\nReally, honestly believe that stock should be trading at $20 and cannot for the life of me figure out it’s horrid performance.",
        "created_utc": 1617319994,
        "id": "gt36a32",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1617348794.0
    },
    {
        "author": "eyerollingsex",
        "body": "QCOM been melting up all day",
        "created_utc": 1617299609,
        "id": "gt203oe",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1617328409.0
    },
    {
        "author": "Odd-Yoghurt-2244",
        "body": "Qualcomm",
        "created_utc": 1617295735,
        "id": "gt1r9sy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617324535.0
    },
    {
        "author": "lattiboy",
        "body": "I’ve been loading up on tech during this absurd dip and I’m up 3% for my whole portfolio in AH trading. It’s crazy everybody wasn’t buying QCOM and AAPL and AMD and MSFT. I simply don’t ever think they’ll be as cheap again.",
        "created_utc": 1617279377,
        "id": "gt0un6w",
        "score": 1,
        "subreddit": "investing",
        "created": 1617308177.0
    },
    {
        "author": "Amazing_Succotash677",
        "body": "If you're looking for a slam dunk invest in QCOM!",
        "created_utc": 1617374255,
        "id": "gt57nvs",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1617403055.0
    },
    {
        "author": "IH8KICKFLIPS",
        "body": "Hope y’all got Qualcomm calls today",
        "created_utc": 1617320676,
        "id": "gt37ihl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617349476.0
    },
    {
        "author": "DaddyDersch",
        "body": "Its not a dividend stock but i HIGHLY recommend SCHD. I think youll find the return and dividend are both great. \n\nStock wise if i had to choose id grab qcom right now cause of the price point",
        "created_utc": 1617443601,
        "id": "gt8cfcv",
        "score": 1,
        "subreddit": "investing",
        "created": 1617472401.0
    },
    {
        "author": "stickman07738",
        "body": "Just take a look at QCOM chart from 1998 - 2001.   It rose like crazy - I thought I was genius.  After Y2K, we had 10-15% drop - I thought free month and rushed to buy more - I am genius it went back up a little. By mid June, lost $300K and exited.   Hindsight is 20/20 but if I held on until it would be a good investment, but I could not handle the lost.\n\nI knew people that lost more than 7 figures with CMGI - everyone is genius during boom.  \n\n**Everyone during a boom will tell you that this time is different (new economic, interest rate, stimulus, ---) - do not believe the BS they are self-justifying thing.**\n\nI learned one thing - slow and steady wins the race.   First, full fund retirement accounts with low cost mutual funds or ETF,  secondly pick-up a 2-3 blue chips stocks and consistently re-invest dividend; then and only then - start a speculative portfolio to keep you mind active and involved \"i*n the game*\" - and ***NEVER touch the retirement or blue chips and NEVER invest in speculative stocks in your retirement account***.\n\nGood Luck",
        "created_utc": 1617443893,
        "id": "gt8cowi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617472693.0
    },
    {
        "author": "AllProWomenRespecter",
        "body": "So that's technically playing AMD vs Intel still though, because that's where a disruption with TSMCs production comes in as a beneficiary to Intel.\n\nIf you're playing the 5 and 7 nm disruption. I don't get why you wouldn't just buy Qualcomm or Samsung.\n\nYour time horizon is also pretty long to not take into account ARM will belong to NVDA by then.",
        "created_utc": 1617397037,
        "id": "gt6h6yr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617425837.0
    },
    {
        "author": "DevonAllary",
        "body": "Qualcomm doesn't manufacture, though. They just design the chips and outsource manufacturing to foundries in China and Taiwan. The thesis here is that Chinese aggression towards Taiwan will disrupt manufacturing, meaning Qualcomm will have no one to produce its products.\n\nIntel, on the other hand, actually manufactures chips in foundries in the United States.",
        "created_utc": 1617397513,
        "id": "gt6i3uw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617426313.0
    },
    {
        "author": "Common-Worldliness-3",
        "body": "Check out $ASX. You’re welcome \n\nhttps://www.google.com/amp/s/seekingalpha.com/amp/article/4417169-ase-technology-vs-amkor-an-analysis-on-worlds-leading-osats\n\n“Strategic Alliance between ASE and TSMC\nASE is based in Taiwan, one of the leading centers for outsourced semiconductor and electronics manufacturing in the world. Its close geographical proximity allows the company to benefit from strong manufacturing activity. It has maintained a strategic alliance with TSMC since 1997, the largest dedicated foundry with a market share of 56% of the foundry market revenues. The alliance has made ASE the preferred provider of packaging and testing services for TSMC clients. This allows ASE to benefit by leveraging TSMC's clients of leading companies including Apple (AAPL), Qualcomm, Nvidia (NVDA), MediaTek (OTCPK:MDTKF), NXP Semiconductors (NXPI) as clients who account for nearly half of ASE's revenues. Apple, Qualcomm and MediaTek are major players in the smartphone processor market and are developing 5G chipsets that require advanced packaging capabilities which ASE can provide. Given the long-standing relationship between TSMC and ASE, we expect the alliance between both companies to continue as it enables them to provide a total semiconductor manufacturing solution and the close geographic advantage between both market leaders. This means that ASE should be able to continue counting on TSMC's clients of leading chipmakers.”",
        "created_utc": 1617409431,
        "id": "gt73vw3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617438231.0
    },
    {
        "author": "jwonz_",
        "body": "This is true, though my current thesis is TSLA is like QCOM in the 2000 tech bubble, a good company but grossly over valued. I think we are seeing the start of the 2-3 year sell off period as the EV bubble pops.\n\nOf course, even if this 2-3 year sell off is happening, it can still rally in the short term. If TSLA hype relights I can easily get flattened on a weekly position. Though, if the hype doesn't relight on this 10% beat, I think panic sets in and it massively sells off.\n\n\"A 10% beat didn't even stop the downward trend? What will?\"",
        "created_utc": 1617419593,
        "id": "gt7kxa4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617448393.0
    },
    {
        "author": "DaddyDersch",
        "body": "I looked so hard at QCOM, AMD, AMAT and NEE on Wednesday even had an order in and then canceled it. #regrets.",
        "created_utc": 1617338367,
        "id": "gt40mim",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617367167.0
    },
    {
        "author": "raffiegang",
        "body": "Shares ASML , TSM , QCOM when price dips",
        "created_utc": 1617264250,
        "id": "gt0anod",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617293050.0
    },
    {
        "author": "crvernon",
        "body": "Unfortunately, it won’t go through. I’m still holding NVIDIA. But Qualcomm is the better ARM play.",
        "created_utc": 1617332941,
        "id": "gt3smp2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617361741.0
    },
    {
        "author": "Shaun8030",
        "body": "Stocks :\n\nMSFT , AAPL , Amzn , GOOG , Dis, QCOM , Nvidia , Amd, TSM, SQ , Pypl, , Shop, Shop , Tsla , BTC ,Adbe. \n\nETFs\n\nQQQM, QQQJ, VGT , SMH , WCLD, ARKW, ARKG,ICLN",
        "created_utc": 1617370393,
        "id": "gt50r1a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617399193.0
    },
    {
        "author": "unsurevote",
        "body": "Have faith. I bought a deep ITM leap on QCOM to run PMCCs and it promptly dove OTM. I’ve been sitting on it for a month with no prospects in sight and the same thoughts as you. Then Thursday it finally popped and im back to wheeling. You never know when the market is going to swing in your favor.",
        "created_utc": 1617413619,
        "id": "gt7azwg",
        "score": 1,
        "subreddit": "options",
        "created": 1617442419.0
    },
    {
        "author": "IH8KICKFLIPS",
        "body": "Can Qualcomm hit 150 next week?",
        "created_utc": 1617408332,
        "id": "gt720er",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617437132.0
    },
    {
        "author": "claytondpark",
        "body": "qrvo 4/16 call from Monday printing nicely thus week!",
        "created_utc": 1617285894,
        "id": "gt15vjs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617314694.0
    },
    {
        "author": "claytondpark",
        "body": "Just closed my pton and qrvo 4/16 calls for 200 and 300% tho :)",
        "created_utc": 1617288818,
        "id": "gt1bxq9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617317618.0
    }
]