[
    {
        "author": "desquibnt",
        "body": "It’s data management. Have you ever worked for a larger company that’s been around for a while? If you have, chances are they operate on a conglomeration of programs that have accumulated over the years that all don’t talk to each other. Decision making at these companies takes longer and is inefficient because they have to pull data from multiple systems and sometimes the data you get is unreliable because the programs are old af. \n\nMy old job and my current job are both at Fortune 500 companies and both operate on a Frankenstein system of multiple programs for CRM. Both companies constantly talk about overhauling the system but it never gets done because of the legacy spaghetti code involved. You change/upgrade one program and then it becomes incompatible to the rest and you need to upgrade everything. Upgrading would mean overhauling everything at the same time which is a MASSIVE project. \n\nPLTR is coming in with one propriety program/OS that’s plug and play. Get rid of your old Frankenstein CRM that’s 50 different programs and replace it with Gotham. Now the entire system and database talks to each other and you can get real data in real time.",
        "created_utc": 1633932948,
        "id": "hg77fkw",
        "score": 83,
        "subreddit": "stocks",
        "created": 1633961748.0
    },
    {
        "author": "Init_4_the_downvotes",
        "body": "I saw salesforce ads in the airport and the metro in California about four years ago, I worked a shitty call center job that used it. It was good software and made my life easier. Figured eventually all shitty jobs would use it. Largest ROI in my life.",
        "created_utc": 1634317565,
        "id": "hgrdcx0",
        "score": 50,
        "subreddit": "stocks",
        "created": 1634346365.0
    },
    {
        "author": "Royyykent",
        "body": "Salesforce is CRM software not fin tech or POS",
        "created_utc": 1635594550,
        "id": "himsjff",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1635623350.0
    },
    {
        "author": "Velaryon1007",
        "body": "CRM is a good business. \n\nAt 118 PE, I doubt it's good enough to justify selling AAPL for it, considering that even if iPhone and iMac revenue stopped growing, they are increasing their services revenue like crazy, and they have barely started monetizing their cult-like ecosystem.",
        "created_utc": 1635708436,
        "id": "hiss6ex",
        "score": 30,
        "subreddit": "stocks",
        "created": 1635737236.0
    },
    {
        "author": "TajPereira",
        "body": "SOFI\nCRWD\nCRM",
        "created_utc": 1635202505,
        "id": "hi1nces",
        "score": 26,
        "subreddit": "stocks",
        "created": 1635231305.0
    },
    {
        "author": "59Watch",
        "body": "Sorry you lost me at Salesforce makes POS software for most industries.",
        "created_utc": 1635592382,
        "id": "himpi4n",
        "score": 24,
        "subreddit": "wallstreetbets",
        "created": 1635621182.0
    },
    {
        "author": "Beetlejuice_hero",
        "body": "I owned NVDA in 2009 @ ~3/share, sold a few years later for a decent profit.  Value today: $180,000.  \n\nI owned a LOT of ATVI @ 10.5/share in 2012, sold a few months later for a decent profit.  Value today: well over a million.\n\nOwned, again a lot, of AMAT in 2012 @ 11/share, sold a few months later for a decent profit.  Value today: also well over a million.\n\nWaste Management @ 32/share in 2012.  God do I wish I held that.  The dividends alone would be so sick (7%).  Hate that I sold that  one.  Absolutely rock-solid company currently @158/share.\n\nI've crushed it with AAPL, CRM, LMT, BIDU.  I've *been* crushed by OXY and an awful small-cap whose name I can't even bear to repeat.  \n\nOn and on...\n\nWin some, lose some.  Can't go back in time.  Keep your eye on the ball.  More winners ahead.\n\nAt the end of the day, most people should just stick to 80%+ index funds, with a little left over for higher risk in individual stocks.\n\nI don't do that I guess cause I'm a glutton for punishment and/or have a slight gambling problem, but that's the path most should take.",
        "created_utc": 1634247156,
        "id": "hgnsg5z",
        "score": 17,
        "subreddit": "stocks",
        "created": 1634275956.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "Adbe \n\nCRM\n\nTTWO",
        "created_utc": 1635198364,
        "id": "hi1dxkf",
        "score": 15,
        "subreddit": "stocks",
        "created": 1635227164.0
    },
    {
        "author": "Joltarts",
        "body": "They are the next level of CRM.\n\nLook at salesforce and SAP. Widely  used and adopted in enterprises.\n\nBut guess what? None of them have the capability of conducting data analytics and deducing answers effectively. Rudimentary answers to things like what are my customers interested in purchasing, currently requires you to do it yourself. \n\nPLTR will not only do this automatically, they can even plan things like stock inventory and forward planning and business strategy.\n\nHonestly, the biggest competitor to PLTR right now is Salesforce and PLTR absolutely blows salesforce out of the water.",
        "created_utc": 1633950158,
        "id": "hg7rf8v",
        "score": 12,
        "subreddit": "stocks",
        "created": 1633978958.0
    },
    {
        "author": "hnr01",
        "body": "For sure. Good luck. Buy on a red day. $CRM is so aggressive in mergers and acquisitions that it’s only a matter of time.",
        "created_utc": 1634181436,
        "id": "hgkhses",
        "score": 12,
        "subreddit": "stocks",
        "created": 1634210236.0
    },
    {
        "author": "RollShotCornerPocket",
        "body": "One of my largest next decade and beyond plays is fintech. Of which I think $SOFI has an incredible runway to take off. It's floor is being a buyout target for a $JPM or $GS type that wants to integrate their hyper growth customer base into legacy banking. I think it's at fair value right now just under $20 a share. \n\n&amp;#x200B;\n\n$FRSH is also on my watch list. Use the software for work and it just works. Really great product, regular joe schmoes can use their API Integrations to optimize work flows, etc. It won't be salesforce but it can cut into that market if you ask me. Valuation prior to upcoming earnings is a little rich, but mid to high 30's would be a solid entry. \n\n&amp;#x200B;\n\n&amp;#x200B;\n\n$PSFE is a massive risk massive reward situation. Absolute beat down stock with heavy institutional investment in the 7$ range. It's a payment processing platform that some consider a proxy to the gambling sector. Lots of debt from M&amp;A but the price targets are juicy. (Trading around 8$ right now with many targets of 15). \n\n&amp;#x200B;\n\nStripe (Whenever it IPO's next year). Can you tell I like fintech? lol",
        "created_utc": 1634313166,
        "id": "hgr2mbv",
        "score": 12,
        "subreddit": "RobinHood",
        "created": 1634341966.0
    },
    {
        "author": "ImpossibleRespond98",
        "body": "I work for Salesforce, so anything related to it gets an upvote. 🙌🏻",
        "created_utc": 1635591680,
        "id": "himok5r",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635620480.0
    },
    {
        "author": "ebichumannn",
        "body": "I think they are both great but I'm not into AMD for a couple reasons;\n\nCompetition,  its the hottest sector in the market and everyone is drawing blood to stay at the top.\n\nBy comparison PLTR has very limited competition, and the competition it does have are not exactly apples to apples. CRM, SNOW, Microsoft and Amazon would technically be competitors but with different twists.\n\nAMD is also positioned in a cyclical environment , which I hate. Cyclicality + not knowing how things are going to turn out for them long term make it a no go for me.\n\nIn the near term ( maybe 5 years ) Id say AMD is a no brainer buy, but the cyclicality of it makes it so It cant be a core holding for me. IF I had to invest in the sector, I'd go with something like ASML or ASYS. A supplier to the cyclicals. A pick and shovel play if you will.\n\nPLTR also benefits from the government contracts. Some people have said that its both its strength and its weakness, but Id argue that it provides no exposure to weakness what so ever.\n\nThe fact that PLTR has been the government's T1 data analytics and AI supplier for over a decade means they are sitting on technology light years ahead of the private sector. When and how they will be able to execute said technology is an unknown.\n\nPLTR has a lot of unknowns, as you stated, and this is a big reason why institutions shy away from the company. We will never be able to get a full peak behind the curtain, but I argue that this is PLTR's strength. Its relationship with government ensures its longevity.\n\nPLTR is just starting its foray into the private/commercial sector.\n\nIf a company is good enough to protect American lives and Uncle Sam's interest's , it projects a level of security , trustworthiness and safety  that they will be able to leverage in the private sector.\n\nLastly, considering AMD exists in the hardware ecosystem, growth will always be dependent on externalities such as supply chain issues ( currently on full display ) and commodity availability etc.\n\nPLTR doesnt require external inputs to sell their products. So exponential growth can be achieved with much less resistance.\n\n&amp;#x200B;\n\nAnyways, thats my pitch. PLTR is my second biggest holding. Its also the one that lets me get the best sleep at night. I truly never worry about it. Max drawdown I figure is about 50% but with everything it has going for it, even in an economic recession, I see it as unlikely.\n\nOnce their SPAC deals and investments start bearing fruit, you're going to see institutions begin to FOMO into the company. At that point government contracts will be nothing but a distant memory.",
        "created_utc": 1633567683,
        "id": "hfo8xn6",
        "score": 12,
        "subreddit": "stocks",
        "created": 1633596483.0
    },
    {
        "author": "wkb1111",
        "body": "Don't buy ibm right now. They are pre-spinoff and you won't receive share in their spin off company. \n\nI'd like to sarcastic ally respond - Yeah, all old bluechips from the 90s are going to 0. Just look at Microsoft. VISA. Cisco. Oracle. \n\nWhat operating systems do majority of servers run? It's not windows, or iOS, or android. It's Linux. And the best one is redhat. It can run on and interface with any of the cloud providers securely. It's a platform to switch between any cloud provider easier than conforming to each cloud setup separately. \n\nWhat company makes the best server to process transactions for credit cards, banks, large retailers and service companies? Ibm, their processors are purpose built. Some like banks, hospitals, insurers are require by law to run their own data transaction systems. Their 7nm power 10 / telum processors can handle more work load any one else. Amd and Intel chip followers take note of ibm's CPU architecture. Specifically their cash system that result in much lower latency and cash pools in the size of gigabytes, also shared memory pools in terabytes. \n\nThey came up with the 2nm and lower transistor process for chips. They led in creating a programming language for quantum computing. They set a world record in data storage solution with their 580 terabyte tape units. Not worth listing all the little things they do. \n\nTheir new CEO is outspoken about collaboration and getting ibm out from being a siloed company. I am sure they will find the right partners for their tech. He switched the company over to Salesforce and slack and such. Deepens partnerships with companies like SAP and others. Increasing consulting business. IBM was also early in jumping in and providing lots of online open courses with100s of thousands taking part across the world. \n\nIBMs role might be niche and you might not understand them. But, it doesn't mean they are not relevant globally. $75B in revenues.",
        "created_utc": 1635403437,
        "id": "hicoi46",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635432237.0
    },
    {
        "author": "NubChumpster",
        "body": "I'd bet that BABA, FB, VICI, AAPL, MSFT, GOOG, AMZN, CRM, COST, SPOT all out perform VOO in the next 5 years",
        "created_utc": 1635582537,
        "id": "himd9ig",
        "score": 10,
        "subreddit": "investing",
        "created": 1635611337.0
    },
    {
        "author": "michael_curdt",
        "body": "AAPL, MSFT, FB, NVDA, DIS, SQ, CRM, NKE, TWLO, NEE",
        "created_utc": 1633664716,
        "id": "hftc8q9",
        "score": 9,
        "subreddit": "stocks",
        "created": 1633693516.0
    },
    {
        "author": "jessejerkoff",
        "body": "Survivor bias.\n\nThe question is which sectors will outperform over the next ten years?\n\nI can see a world where cloud providers, from aws over msft all the way to abobe and CRM become more like modern day utilities, the currently obscene margins get competed away and iaas is suddenly as attractive as legacy infrastructure.\n\nEqually, i could see a world where utility by implementing more ai could smartify the grid and become vastly profitable or where consumer staples could digitally transform in a way where they go direct to consumer via monthly pay as you go subscription cutting out Walmart and Amazon, and j&amp;j suddenly triples their margin.\n\nNot saying this happens, but while in hindsight it and managed services was the winner industry over the last 20 years, there is hardly a guarantee that big cloud providers don't get sniped in niches like AWS is currently experiencing with snowflake. Their pricing of their cashcow S3 is basically the reason for snowflakes existance and success.\n\n\nPast performance will not guarantee future returns.",
        "created_utc": 1635696872,
        "id": "his0t8l",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635725672.0
    },
    {
        "author": "1ll0gic",
        "body": "30 years old\n\n21% CRM\n\n18% NVDA\n\n16% UPST\n\n14% CRWD\n\n12% NET\n\n12% INMD\n\n8% SOFI\n\nThinking of getting rid of UPST and maybe another one to add an energy stock and consumer cyclical stock",
        "created_utc": 1635529198,
        "id": "hijexr3",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635557998.0
    },
    {
        "author": "sabertoothed_tiger",
        "body": "I’m bullish on CRM.",
        "created_utc": 1635709069,
        "id": "histqay",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635737869.0
    },
    {
        "author": "coughingcoffee01",
        "body": "20% AMZN, 17.5% BTI, 15% CRM, 15% LMT, 12.5% D, 7.5% YUMC, 7.5% BUD, 3% BABA ( 140$ / share ) and 2% cash to DCA the position of BABA I just opened :p",
        "created_utc": 1633382128,
        "id": "hfeirgm",
        "score": 7,
        "subreddit": "stocks",
        "created": 1633410928.0
    },
    {
        "author": "59Watch",
        "body": "Salesforce is a CRM that integrates with POS systems. Micros would be the POS gold standard.",
        "created_utc": 1635594574,
        "id": "himskph",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635623374.0
    },
    {
        "author": "Mayor_Fob_Rord",
        "body": "PAANSS (PayPal, AMD, Aerotyne International, Nvidia, Square, Salesforce)",
        "created_utc": 1635649725,
        "id": "hiq1ev0",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635678525.0
    },
    {
        "author": "zg44",
        "body": "Money just flying into GOOG, MSFT, CRM, and TSLA there in the last hour.",
        "created_utc": 1635537637,
        "id": "hik0g4n",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635566437.0
    },
    {
        "author": "SkullRunner",
        "body": "I was lead promotional tech lead of a major Beer brands Facebook pages/apps about 12 years ago when it was a big deal in the engagement space, before the brand dialed back all engagement plays on the platform because, guess what, legal drinking age to 35 were as a demographic getting smaller on the platform, aging out with no fresh wave coming in behind, so the brand started to claw back their presence to a basic social posting schedule vs putting in content and promotions at scale, cause those dollars were better spent elsewhere.  \n\n\nMy opinion of FB is of someone that has worked in advertising and marketing tech development focused on CRM and stats research, for the past 15 years or so.   I have seen what it was, and now what it is.  \n\n\nI stand by my assessment as does Facebooks own internal research and 3rd parties that the platform is at large an echo chamber for those that do not think critically, are manipulated easily by what the algorithm is feeling them and is an older population of users.   It's not debatable.   \n\n\nIf you are a FB user it does not mean that's you or your friends (if you're taking this personally) peer group, age group, experience and interests can not be other than what I'm describing, you could see a feed of content that is yours and feel FB is not what I'm saying, that is the social bubble / echo chamber effect at work with their algorithm, they are not all bad, just the majority of them are.",
        "created_utc": 1635280012,
        "id": "hi5rxal",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1635308812.0
    },
    {
        "author": "zg44",
        "body": "Don't be a perma-bear or perma-bull.\n\nJust follow the market. \n\nToday's move was super-bullish in this downtrend.  A big red to green move from -1.2% or so is a huge move.\n\nAnd the debt ceiling coming into some form of resolution is a big deal, shows neither side is willing to actually blow up the situation.\n\nChinese markets have completely retraced their pandemic gains.\n\nWe look due for a significant bounce even if it fails eventually.\n\nLook at the market leaders and their strength today: MSFT and other big tech are looking really good.\n\nPANW, CRM, AFRM and others look like they want to run.  That's usually a good sign for a couple green sessions.\n\nObviously China or any other news can dump the market but we look set for some kind of multi-day rally.",
        "created_utc": 1633555450,
        "id": "hfnj2w4",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1633584250.0
    },
    {
        "author": "high_roller_dude",
        "body": "yeah obviously premiums are not huge but i dont reach for yield. id rather play things conservatively whether im selling calls or puts. \n\nalso i sell far otm calls on other stocks i own, including msft, crwd, crm, adbe, etc. all combined, they generate enough income for me to cover my grocery bills for a  month, which is good enough for me",
        "created_utc": 1633567893,
        "id": "hfo9dpq",
        "score": 5,
        "subreddit": "stocks",
        "created": 1633596693.0
    },
    {
        "author": "trickintown",
        "body": "&gt;UX is very simple.\n\nThe simplicity makes it so elegant. No too much graphics, no unwanted dumb animations, highly customizable workflow. No unwanted distractions - the slack/salesforce integration makes work so much pleasurable.",
        "created_utc": 1635227299,
        "id": "hi2z2qa",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635256099.0
    },
    {
        "author": "dannytrevito",
        "body": "As a tech guy, I dont understand how someone can pay that much for a crm websolution, its like Oracle but for crm..",
        "created_utc": 1635223466,
        "id": "hi2tnc6",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635252266.0
    },
    {
        "author": "The_Folkhero",
        "body": "This company is a beast! Blow away earnings every time. Was up 100% in ONE DAY back in March. Salesforce CEO Marc Benioff, Mark Cuban and former Google CEO Eric Schmidt are investors. \n\nhttps://www.cnbc.com/2021/03/22/upstart-up-171percent-in-three-days-as-momentum-pours-into-fintech-company.html?__source=androidappshare",
        "created_utc": 1634406674,
        "id": "hgvukzq",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634435474.0
    },
    {
        "author": "coolcomfort123",
        "body": "Probably only a little bit, but much better compared to other stocks like NET and CRM.",
        "created_utc": 1634689183,
        "id": "hhavmsb",
        "score": 4,
        "subreddit": "stocks",
        "created": 1634717983.0
    },
    {
        "author": "trickintown",
        "body": "I’m contemplating of going big on CRM, but their PE is right now not in accordance with market",
        "created_utc": 1635231489,
        "id": "hi34ce8",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635260289.0
    },
    {
        "author": "springsprint",
        "body": "TBF, you could say the same about Salesforce. Even their own employees seem a bit puzzled about what their company does.",
        "created_utc": 1633935497,
        "id": "hg7aqvm",
        "score": 4,
        "subreddit": "stocks",
        "created": 1633964297.0
    },
    {
        "author": "Beetlejuice_hero",
        "body": "Well the beauty of index funds is you just buy buy buy and never sell, regardless of up, down, or loop de loop.  I own SCHB, SCHA, and DGRO and will never sell.\n\nI also own one \"never sell\" stock (AAPL) and there are certainly more examples of those types of companies.  Buy and only buy.  \n\nBut for more \"trades\" or stocks you're uncertain about or concerned about locking in profit?  It can be very tough to know when to sell.  Sucks to watch a 20% gain shrink back to zero or negative, but oftentimes that's necessary to enjoy those big gaps up (would have made me a millionaire with ATVI &amp; AMAT). Also happened to me recently with CRM.  Up nice amount, pulled way back, then rocketed back up.  Still holding.\n\nAt the end of the day it's best to just focus on Index funds and leave a small % (5, 10, maybe 20) to play around.  So no matter what happens with your higher potential, more volatile portion, you always have that \"never have to worry\" 80+% to let you sleep at night and keep you continually invested.",
        "created_utc": 1634260855,
        "id": "hgomay3",
        "score": 4,
        "subreddit": "stocks",
        "created": 1634289655.0
    },
    {
        "author": "newzstockchick",
        "body": "Apparently RKT is partnering with CRM. It’s up 6% rn",
        "created_utc": 1635526960,
        "id": "hij94a5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635555760.0
    },
    {
        "author": "trickintown",
        "body": "Nvdia, AMD, TSLA, CRM. NET and I’m going to take a contrarian approach and say IBM and Intel Too",
        "created_utc": 1635673371,
        "id": "hiqwr5h",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635702171.0
    },
    {
        "author": "Future-Dimension-937",
        "body": "https://www.rocketcompanies.com/press-release/rocket-mortgage-unveils-partnership-with-salesforce-providing-transformational-mortgage-services-to-financial-institutions/\n\nIt’s not though read the press release \n\nToday’s news displays what is possible with the Rocket platform and the technology that powers it. This will be the first time a home lender will provide an end-to-end ‘mortgage-as-a-service’ solution through Salesforce Financial Services Cloud – a platform that thousands of financial institutions already heavily rely on,” said Jay Farner, Vice Chairman and CEO of Rocket Companies. “We recognize the important and personal role local banks and credit unions play with so many Americans – they have a trusted relationship with their customers. Financial institutions can now combine those relationships they’ve already established, while leveraging Rocket Mortgage’s transformational platform powered by Rocket technology.”",
        "created_utc": 1635597627,
        "id": "himxex5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635626427.0
    },
    {
        "author": "CanadianNic",
        "body": "I have more Apple and Microsoft then salesforce but I have a hefty amount of each! I work with salesforce so I wanted to have a decent size of my portfolio in it. Idk if I’d sell Apple for it but having all 3 is my plan.",
        "created_utc": 1635706852,
        "id": "hisocev",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635735652.0
    },
    {
        "author": "MiamiFan-305",
        "body": "Didn't check go to verify but I'm assuming Salesforce, square and crowdstrike are at decent percentages in qqq? So some more overlap there.",
        "created_utc": 1633399021,
        "id": "hffioq9",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633427821.0
    },
    {
        "author": "BeautifulPreparation",
        "body": "CRM has been free money lately",
        "created_utc": 1634659168,
        "id": "hh8vik8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634687968.0
    },
    {
        "author": "UKbigman",
        "body": "Salesforce deal for mortgage-as-service…not really sure what it means but the CEOs will be on CNBC shortly.",
        "created_utc": 1635534345,
        "id": "hijs1hf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635563145.0
    },
    {
        "author": "Dangerous_Contact439",
        "body": "agree. doing this with speculative stocks would be stupidity. AAPL wouldnt necessarily fit that bill - for Aapl, MSFT, CRM etc to be falling like a knife multiple businesses should be failing at once.",
        "created_utc": 1633212319,
        "id": "hf5emlp",
        "score": 3,
        "subreddit": "options",
        "created": 1633241119.0
    },
    {
        "author": "desquibnt",
        "body": "I’d say more like Salesforce from a CRM perspective but PLTR’s platform reaches much further than just CRM. It can go into supply chain management as well.",
        "created_utc": 1633950956,
        "id": "hg7sgm8",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633979756.0
    },
    {
        "author": "heyheymustbethemoney",
        "body": "Google, Align, intuitive surgical, Nvidia, AMD, Adobe, SalesForce. Shopify, Snap, Affirm, UpStart, MongoDB, Zscaler, Crowdstrike \n\nCrazy valuations but I buy these on all dips.",
        "created_utc": 1633841980,
        "id": "hg2irov",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633870780.0
    },
    {
        "author": "milanello09",
        "body": "CRM is Salesforce, competitor to Freshworks. You don’t have to completely rid of Freshworks, just weight the portfolio to not be so dependent on speculation. Speculative plays are good, and could work out and make you a a lot of money, but could also lose you a lot if you’re missing a solid foundation.\n\nIf you want to be more data-driven, go to finviz.com (free) and you can find stocks you like based of data.",
        "created_utc": 1633733305,
        "id": "hfwv712",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633762105.0
    },
    {
        "author": "milanello09",
        "body": "IMO, this is not a strong portfolio. You are somewhat diversified metals and gases, but the rest are speculative plays. It doesn’t matter how long you have to stay invested if the companies won’t grow or be around. \n\nStem and Sofi are the most interesting here, but those should be low weighted positions in the portfolio, not a core holding.\n\nIf I were you, I’d get rid of the literal crap plays like WISH and PSFE. Reduce exposure on some of the gas plays (LAC incl), it makes up like 50% of your net worth. Trade the more speculative plays with no backing like FRSH for more stable competitors like CRM and add some more stable tech (FAANG). \n\nThere are a million better assets out there to choose from besides these ones.\n\nJust my 1 cent.",
        "created_utc": 1633732265,
        "id": "hfwsvx1",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633761065.0
    },
    {
        "author": "_foldLeft",
        "body": "CRM now",
        "created_utc": 1633988515,
        "id": "hga1jfk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634017315.0
    },
    {
        "author": "evanc1411",
        "body": "Shoutout to cloud sector and CRM (Salesforce)",
        "created_utc": 1634966064,
        "id": "hhpmlq6",
        "score": 3,
        "subreddit": "investing",
        "created": 1634994864.0
    },
    {
        "author": "FlorianNV",
        "body": "Salesforce is on the list. I haven't seen anything in the emails yet about Pepsi and CVS. But I don't think the list of 30 above is the complete list. I bet there are several more stocks in his trust.",
        "created_utc": 1635198077,
        "id": "hi1d9fu",
        "score": 3,
        "subreddit": "investing",
        "created": 1635226877.0
    },
    {
        "author": "gouligan_GenY",
        "body": "RKT Volume surge sounds like they will be on CNBC closing bell. New says announcing partnership with salesforce.\n\nanyone confirm?",
        "created_utc": 1635531908,
        "id": "hijlwuf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635560708.0
    },
    {
        "author": "_hiddenscout",
        "body": "They operate in a different space than Salesforce. Salesforce is more a CRM. \n\nAtlassian has a suite of software more commonly used in software development. Their bread and butter is JIRA. It allows you track user stories when developing software. JIRA also has a roboust market place where people sell apps. \n\nBesides JIRA, they offer bitbucket. There is three big code repositories: Gitlab, GitHub, and Bitbucket. Atlassian owns Bitbucket. JIRA and BitBucket integrate really nicely, since when building software, it's takes a team. You change your code base with something called a pull request, which is tracked in the repo. \n\nThe other major product their offer is their Wiki's. \n\nThere really isn't too many bear cases against Atlassian. I've used JIRA at every sofware place I've worked.\n\nI think the biggest bear case agains them is that there is more competition coming into the space, especially for JIRA.",
        "created_utc": 1635454322,
        "id": "hifgwl6",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635483122.0
    },
    {
        "author": "VisualMod",
        "body": "&gt;Rocket Mortgage Unveils Partnership with Salesforce, Providing Transformational Mortgage Services to Financial Institutions\n$RKT\n\n^\\*Walter ^Bloomberg ^[@DeItaone](http://twitter.com/DeItaone) ^at ^2021-10-29 ^13:00:47 ^EDT-0400",
        "created_utc": 1635526856,
        "id": "hij8ulj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635555656.0
    },
    {
        "author": "YoloStonks4Tendies",
        "body": "That deal with Salesforce looks great",
        "created_utc": 1635528071,
        "id": "hijbzge",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635556871.0
    },
    {
        "author": "My_Bacon",
        "body": "Rocket and Salesforce partnering up eh?",
        "created_utc": 1635527125,
        "id": "hij9ju8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635555925.0
    },
    {
        "author": "tomb_bomt",
        "body": "There are a few things that worry me about Salesforce tbh, good company though.\n\nNegative earnings growth over the past year and their earnings are forecast to grow by 10.37% for the next 5 years, thats not exactly shit hot. For a company with a huge P/E ratio and a PEG ratio of 4.23, those growth figures aren't really what I'd expect to see. Though when looking at their balance sheet, it's bloody impressive haha!\n\nBut when I calculate the fair value of the stock it's $295. So tbh, in the long term, as long as they keep growing at rates currently predicted, you should have a decent investment. I'm just not sure it's as hot as you think it might be, then again I could be completely wrong haha! Just playing devil's advocate a little here.",
        "created_utc": 1635223292,
        "id": "hi2tdpa",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635252092.0
    },
    {
        "author": "MoRegrets",
        "body": "They offer solutions for salesforce. I’d see AVPT more as a value added reseller/support org for Microsoft implementations.",
        "created_utc": 1634070490,
        "id": "hgecjz0",
        "score": 3,
        "subreddit": "SPACs",
        "created": 1634099290.0
    },
    {
        "author": "Mister-guy",
        "body": "Dude you’re awesome, thanks. I’m mostly VTI and VXUS, but looking to diversify w a little risk (~10-15%). \n\nI was thinking ASTS originally, but I’ll be looking into Salesforce now as well. \n\nCheers.",
        "created_utc": 1634181380,
        "id": "hgkhoh5",
        "score": 3,
        "subreddit": "stocks",
        "created": 1634210180.0
    },
    {
        "author": "sabertoothed_tiger",
        "body": "CRM has a promising future.",
        "created_utc": 1635542409,
        "id": "hikcbo3",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635571209.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "The Dow is interesting one company can literally lift the entire index. Salesforce did it recently and DIS and BA this past week.",
        "created_utc": 1633286636,
        "id": "hf997y5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633315436.0
    },
    {
        "author": "NickNameIsNick",
        "body": "MSFT offered funds/stake but AVPT declined bc they want to work with Salesforce, AWS, Google, etc.",
        "created_utc": 1634070592,
        "id": "hgecte4",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1634099392.0
    },
    {
        "author": "CamaroLS1",
        "body": "CRM puts now - WITNESS ME",
        "created_utc": 1634240749,
        "id": "hgnf69s",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634269549.0
    },
    {
        "author": "majorchamp",
        "body": "I sometimes kick myself over this...I had Salesforce stock at a strike price of $5.50 lol, about 330 shares.  Sold most of it within 6 months of the IPO, highest price around $65 I think.",
        "created_utc": 1634252584,
        "id": "hgo4kfb",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634281384.0
    },
    {
        "author": "FinancialRub6814",
        "body": "AMD, Nvidia, CRM, Apple, Boeing.\n\nMade alot of money on Dutch Bros since IPO.$BROS.  Definitely the in and out burger or chick fil a of coffee.",
        "created_utc": 1634616435,
        "id": "hh71ggi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634645235.0
    },
    {
        "author": "bootcamper64",
        "body": "|\\*\\*Symbol\\*\\*|\\*\\*Percent Of Account\\*\\*|  \n:--|:--|  \n|CLF|12.46%|  \n|FVRR|9.49%|  \n|SBLK|8.68%|  \n|CRM|7.42%|  \n|SHOP|6.84%|  \n|SPAXX\\*\\* (CASH)|6.49%|  \n|ADSK|5.63%|  \n|ASO|5.41%|  \n|UPST|5.15%|  \n|SDC|4.46%|  \n|BBIG|4.22%|  \n|GOLD|4.13%|  \n|MT|4.06%|  \n|PAYC|4.03%|  \n|DOCU|3.58%|  \n|PLTR|3.17%|  \n|XLY|2.49%|  \n|SNOW|2.18%|  \n|OCUL|1.39%|  \n|CRNT|1.31%|  \n|SKLZ|1.27%|\n\n&amp;#x200B;\n\nMy main stock picking  account. Have another 'set and forget' account with SPY and bluechips (MSFT, APPL, WMT, etc)",
        "created_utc": 1634850789,
        "id": "hhjgryp",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634879589.0
    },
    {
        "author": "CognitivelyNomadic",
        "body": "What are the AAPL, MSFT and CRM of other industries? Healthy, steady but growing.\n\nLooking to broaden “fun money” side investments. Too exposed to QQQ, SPY or individual tech stocks",
        "created_utc": 1635180483,
        "id": "hi05wp4",
        "score": 2,
        "subreddit": "investing",
        "created": 1635209283.0
    },
    {
        "author": "Purple_Cow1",
        "body": "Twilio - it reminds me CRM 10 years ago. Now entering on marketing space. Bought Segment leader in Cdp customer data platform \n\nCloudflare- leader in CDN\n\nSofi - I see now they sponsoring Anthony Pompliano YouTube channel guru of Bitcoin. I have the feeling they are going in the right direction",
        "created_utc": 1635271140,
        "id": "hi552r2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635299940.0
    },
    {
        "author": "CaterpillarWeird9087",
        "body": "I have both. CRM has had better revenue and earnings growth than AAPL over the last few years, and is not as vulnerable to supply issues as AAPL is. However, it's trading at a very high multiple right now. I don't see either company as undervalued, and I doubt you'll see much growth in CRM in the near term (but who knows...). I think being overweight on CRM is a good idea, but I'd recommend DCA'ing into it, because it may not go anywhere for a while.",
        "created_utc": 1635722214,
        "id": "hitmll9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635751014.0
    },
    {
        "author": "sudopacman",
        "body": "I worked there a few years ago, and I hated the company.  Amazon cheaped out on everything, like making you pay for drinks, and your only special benefit was basically $100 off $1000 purchase.  \n\nI don't remember all the detail, but Amazon went out of its way to make you feel the frugality.  And I worked in one of the most profitable customer facing services in AWS, I can't imagine how stingy internal retail must've been.\n\nI work at Salesforce now and love it.  Whether they actually give a shit about me or not, they make a great effort to appear so.  The culture and work life balance are excellent.",
        "created_utc": 1633409645,
        "id": "hfg1ryn",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633438445.0
    },
    {
        "author": "jaynemesis",
        "body": "F, AMD, MSFT, CRM, SIE.DE, ABBN.ZU, ORSTED.CO, TWTR, SPOT, CSX",
        "created_utc": 1633666376,
        "id": "hftf00l",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633695176.0
    },
    {
        "author": "-Muscles-Marinara-",
        "body": "CLPT - think the intuitive surgical of neuro. \n\nTOITF(Topicus)- spin-off of constellation software. Going after the fragmented European crm market",
        "created_utc": 1633819095,
        "id": "hg1a8vz",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633847895.0
    },
    {
        "author": "bilateralconfusion",
        "body": "Lol HubSpot is on track to be the next salesforce",
        "created_utc": 1633818518,
        "id": "hg191cq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633847318.0
    },
    {
        "author": "SaltyEarth7905",
        "body": "It has split in the past but it’s been seven years or so. It’s a powerhouse, like SalesForce, nvidia, Microsoft. Whether in full shares or slices, get invested on dips.",
        "created_utc": 1634577768,
        "id": "hh4q625",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634606568.0
    },
    {
        "author": "trickintown",
        "body": "Alternate opinion… look at salesforce.. wait for one correction and when their P/E goes below 80 that’s a long game..\n\nLow code software dev is to become  a big industry (just like how cloud grew crazy this decade) and salesforce has a huge early mover advantage..",
        "created_utc": 1635082127,
        "id": "hhuxwju",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635110927.0
    },
    {
        "author": "the_beast93112",
        "body": "I think it's because of the collaboration with CRM",
        "created_utc": 1635535086,
        "id": "hijtw0h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635563886.0
    },
    {
        "author": "erockjr",
        "body": "Anyone know how accurate this is?\n\nhttps://enlyft.com/tech/products/salesforce-financial-services-cloud\n\nCan't find a date when this was published. Using a mobile device, but it doesn't look like too many financial institutions use the sales force suite.",
        "created_utc": 1635540998,
        "id": "hik8xea",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635569798.0
    },
    {
        "author": "gouligan_GenY",
        "body": "Confirmed, Rocket $RKT and Salesforce $CRM Partnership 🚀\n\nDreamforce 🚀",
        "created_utc": 1635536149,
        "id": "hijwkmm",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635564949.0
    },
    {
        "author": "Smipims",
        "body": "I see hubs and net a lot. I'm very behind on them even though knowing about them years ago which makes me sad. Years ago I knew that people hated CRM and investing in a competitor would be smart. My cost basis on HUBS could be much lower. But they're still only a 40B company.",
        "created_utc": 1635611447,
        "id": "hinqth1",
        "score": 2,
        "subreddit": "investing",
        "created": 1635640247.0
    },
    {
        "author": "developingstory",
        "body": "Need a crash so I can yolo calls at the bottom for once. The tendies are secondary, my real motivation is to mass email every lead in my company’s CRM a pic of my dangling nuts with the tattoo that reads:\n\n“Poor no moor”\n\nThen quit.",
        "created_utc": 1633486017,
        "id": "hfk0ec4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633514817.0
    },
    {
        "author": "Joltarts",
        "body": "They also have a product for small medium enterprises. \n\nTheir closest competitor in this CRM space is Salesforce and SAP. And those companies are not using AI driven analysis. Once companies start adopting PLTR software over other CRM, it's game over for Salesforce as far as I'm concerned.",
        "created_utc": 1633611283,
        "id": "hfq1n1x",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633640083.0
    },
    {
        "author": "CallMeEpiphany",
        "body": "I’m going to get hate for this but don’t invest in tech for a year. If that is not a choice, get Salesforce or Microsoft.",
        "created_utc": 1634179984,
        "id": "hgkeypy",
        "score": 2,
        "subreddit": "investing",
        "created": 1634208784.0
    },
    {
        "author": "stevoacp1",
        "body": "CRM new ATH.  $310 eoy",
        "created_utc": 1634241966,
        "id": "hgni555",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634270766.0
    },
    {
        "author": "zg44",
        "body": "Look at the stocks that did well today, it's a who's who of the biggest momentum stocks.\n\nCut losers and just buy winners.\n\nDoesn't matter if a stock is up 200% in the previous 2 months, it's going to try to go up another 50% in the next month (looking at you UPST).\n\nStocks that are breaking to ATHs right now are probably the best bet because this time of year is when all the big hedge funds crowd into winners to show good numbers/stocks on their year end reports.\n\nWe've seen that happen in previous years: last year it happened with stocks like TSLA, NIO, SQ, battery stocks like PLUG etc.\n\nComing out of a major dip like this late in the year, that type of crowding should be exacerbated.\n\nStocks like CRM, AFRM, and of course among the big caps: GOOG and MSFT (which have been the 2 most bullish of the big caps).\n\nLooks like we're going to witness a rotation into winners for the last 2.5 months if we break to new highs on SPX/Nasdaq.",
        "created_utc": 1634243132,
        "id": "hgnkymg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634271932.0
    },
    {
        "author": "Few_Dirt_8665",
        "body": "Each year there happen to be a couple companies that dominate the talking heads (and this percolates into the amateur content creation sphere).  Ones that I recall over the past few years… any of the FAANG companies.  FB is dominating the conversation in recent months.  Salesforce (CRM) goes in and out.  Same with Shopify.\n\nWhen Stripe IPOs, I think it’ll get some attention and stay there for a bit.  They are the darling in the private market sphere.\n\nBeen a lot of recent retail talk about Robinhood (HOOD) and Coinbase (COIN) but that’s beginning to wane.",
        "created_utc": 1635080709,
        "id": "hhuveo7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635109509.0
    },
    {
        "author": "Anth916",
        "body": "I'm not sure I'd consider 20 to 25 percent really being a \"crash\". I see it as a strong correction, but not really a \"crash\". For example, if Nvidia \"crashes\" 25 percent off it's all-time high of $230.43, it would drop to $172.82. If Google \"crashes\" 25% from it's all-time high of $2,936.41, it drops to $2,202.30. Or Salesforce crashing 25% from it's ATH of $286.36 to $214.77.  I see all those prices as major corrections, but not a full blown crash.\n\nBut you can say that it's mostly semantics, and when do you draw the line between major correction and legit crash",
        "created_utc": 1633291886,
        "id": "hf9mg1z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633320686.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "My new office is debating using them because we want a CRM system but they pricy af",
        "created_utc": 1633551603,
        "id": "hfna4mc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633580403.0
    },
    {
        "author": "zg44",
        "body": "Yesterday's move felt like the kind of move that happens at the end of pullbacks, and it was accompanied by strong earnings reports as earning season started the past 2 days.\n\nThis is probably the point where you abandon puts and start buying dips (or keep buying dips if you already were), at least until we get closer to the November 2-3 Fed meeting.\n\nMain reason yesterday's move was so bullish is that the market leaders approached or broke through new ATHs or closed their pullback gaps: GOOG, MSFT, CRM among big caps and of course UPST, AMBA, PANW and others among smaller caps.\n\nTSLA showing tons of momentum the past couple days and basically just looks like it's set to challenge all time highs.\n\nI'd expect some form of market rotation later in the year as we start getting to tapering and the tech stocks experience some kind of a mini-blowoff top, but for now market just looks set to get to all time highs.",
        "created_utc": 1634296342,
        "id": "hgq4d5i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634325142.0
    },
    {
        "author": "BeautifulPreparation",
        "body": "everyone sleeping on CRM?",
        "created_utc": 1634219494,
        "id": "hgm07rx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634248294.0
    },
    {
        "author": "thetagodfather",
        "body": "Think about it like this…most consumers have no reason for using AI, analytics, enterprise security or CRM platforms \n\nBut those have insane profit margins and print $$$\n\nThis is very early so we won’t see adoption for a while though \n\nBut will be good for speeding up mass processing of existing workloads, and application against a lot of problems we can’t solve now because of the limitation of 1 and 0 as the only answers\n\nQuantum mechanics becomes a mysterious realm of magic once you dig into it, and realize how ignorant we are of the universe around us and how it *really* works",
        "created_utc": 1634201756,
        "id": "hgl9kmu",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1634230556.0
    },
    {
        "author": "ondori_co",
        "body": "Thank you! \n\nThat makes a lot of sense.\n\nAssuming a lot of money is pulled from the fund and the shares are deleted. Then the dilution should remain unchanged and thus stock price unaffected. \n\nAlso from what I see, EIT.UN.TO is trading within a tiny % of its NAV. Thus I think it's safe for me to buy shares right now.\n\nMy other div funds, CLF &amp; CRF are trading ~30% above NAV. Honestly too risky to hold, so I divested to switch to EIT.UN.TO.\n\nIf there is a market crash that causes CLF &amp; CRM to drop near the NAV or if the CAD to USD drops to less than 1.2 then I'll switch back to CLF &amp; CRM.",
        "created_utc": 1634214741,
        "id": "hglqroh",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1634243541.0
    },
    {
        "author": "Japparbyn",
        "body": "I use Salesforce. It is slow and insights have to be found in other programs. Takes 10min to do all the research before a good cold call. Wish it was all on a single page like palantir UI",
        "created_utc": 1633981047,
        "id": "hg9kz8w",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634009847.0
    },
    {
        "author": "zg44",
        "body": "AMBA, CRM, among others.",
        "created_utc": 1634251412,
        "id": "hgo1zij",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634280212.0
    },
    {
        "author": "Guy_PCS",
        "body": "Your very welcome, suggested VGT is it has the holdings of Apple &amp; MSFT plus some very good tech growth companies. \n\nVGT top holdings\n\nMonth-end 10 largest holdings\r  \n(57.20% of total net assets) as of 09/30/2021 \r  \n\r  \n1\tApple Inc.\r  \n2\tMicrosoft Corp.\r  \n3\tNVIDIA Corp.\r  \n4\tVisa Inc.\r  \n5\tMastercard Inc.\r  \n6\tPayPal Holdings Inc.\r  \n7\tAdobe Inc.\r  \n8\tsalesforce.com Inc.\r  \n9\tCisco Systems Inc.\r  \n10\tIntel Corp.",
        "created_utc": 1634597622,
        "id": "hh5zmya",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1634626422.0
    },
    {
        "author": "Whyamihere5069",
        "body": "Totally agree but it’s important to note that Zuora can and only win in the b2b space. Stripe is taking over b2c and Salesforce is starting to take market share from Zuo.",
        "created_utc": 1634591190,
        "id": "hh5lujx",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1634619990.0
    },
    {
        "author": "stiveooo",
        "body": "Pypl for many of us did a bad choice, will it work? Who knows but now we think that is bad and that is overpaying like crm did. But eventually in 1 2 years we will know the answer.",
        "created_utc": 1634948900,
        "id": "hhos4cq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634977700.0
    },
    {
        "author": "throwAwayz5da",
        "body": "Retard stock picks that got me here:\n\n- CRM options before dreamforce\n\n- CLF options yesterday\n\n- WISH options at just under $5",
        "created_utc": 1634912832,
        "id": "hhmgyed",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634941632.0
    },
    {
        "author": "Si1verange1",
        "body": "Well it sounds like you don't have my problem, i.e. as Buffett said \"If I had never sold a stock, I would be much wealthier.\"\n\nOne other thought about the better-looking names in THNQ, a drawback of that is that no one really wants to pay a .75% fee to own IBM, AMZN, GOOG, CRM, etc., which are already in other ETFs anyway, maybe that's why I went with something that was more focused.  Good luck.",
        "created_utc": 1635267074,
        "id": "hi4upnu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635295874.0
    },
    {
        "author": "LordReek7",
        "body": "Again, the company makes the vast majority selling Sass software that is used on the operations end for cannabis companies...\n\nIt’d a tech company , with high margins in a particular niche.... the more dispensaries that pop up like you say such as McDonald’s , the more customer is has buying its software...\n\nYou using them to look up locations or order items via app isn’t how they actually make money lol.... it’s the SAP/oracle of weed..... \n\nGoogling locations of dispensaries isn’t how they make money, lol.. do people not follow this. \n\nThink of it this way, the most popular CRM for sales team is salesforce.... people pay a premium because it’s the best tool\nCompared to competitors.... and of course it was first to market....\n\nWeedmaps is first to maker for its tech Sass.... do you guys follow ?!?! It will have a lion share of the market before federal legalization occurs..... if you are google or Amazon or whoever and you want to get into that sector , it’s easier/cheaper to buy weedmaps.",
        "created_utc": 1635302653,
        "id": "hi77lh2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635331453.0
    },
    {
        "author": "Dmoan",
        "body": "I agree with your assessment but growth stocks actually seem to have rebounded and seem to be doing ok in spite of rates going up (with one exception). Look at CRM, TSLA, NVDA, AMD, SNOW. \n\nBut in other hand small cap high growth tech stocks seem to be in a free fall. It seems like risk off trade and there is fear if there is market sell off these companies could collapse (high rates low stock price coupled with huge debt is recipe for disaster).",
        "created_utc": 1635045647,
        "id": "hhtj9r1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635074447.0
    },
    {
        "author": "Euphoric_Environment",
        "body": "It’s the Five9 acquisition. Pretty expensive, and stocks always trade flat for a year after big acquisitions while they’re being integrated (see CRM and slack)",
        "created_utc": 1635222897,
        "id": "hi2sr71",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635251697.0
    },
    {
        "author": "ALL_GRAVY_BABY",
        "body": "They've missed every trend the last 25 years. \n\nNot much confidence in their AI or QC. \n\nThe could be dominant in CRM and cloud and cyber security.... But they missed everything.",
        "created_utc": 1635382720,
        "id": "hibmie1",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635411520.0
    },
    {
        "author": "CampPlane",
        "body": "I've been working in the cybersecurity sector for well over a decade. I don't trust a single one of these companies. The cybersecurity space moves very fast, with one player being top dog only to be replaced by another company, only to be replaced by another company. The truly best cybersecurity companies aren't public, let me make that clear. The best companies in this industry that I wish I could invest in are private. Crowdstrike doesn't even have the best products in its own industry; I know at least a dozen people who work there and their sales staff is straight out Wolf of Wall Street. Churning through sales reps left and right doesn't give me confidence that they'll continue to hit their revenue goals, and that's on top of that fact that they don't have the best security software in the space. So many people in this sub get their dicks hard from CRWD, but I just don't see it, and I'm an insider. The only way I can see them being a top dog is if they continue to acquire the hottest new technologies. That's what Microsoft did, that's what Salesforce did, that's what all the great and large companies do. I remember when everyone was crazy about FireEye back in like 2015 or so, that this was going to be the top security stock to own. Palo Alto Networks was another one, because their Traps software was supposed to be next big thing in endpoint security. Crowdstrike has had its day in the sun, but I've yet to see technology from them that is better than the likes of BitDefender, Malwarebytes, and others.",
        "created_utc": 1635210983,
        "id": "hi25pb3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635239783.0
    },
    {
        "author": "tqqq-ftw",
        "body": "So it bounces or falls? thanks Oracle of the retards",
        "created_utc": 1633078871,
        "id": "heye2tn",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1633107671.0
    }
]