[
    {
        "author": "creemeeseason",
        "body": "I don't see TXN (Texas instruments) mentioned here a lot. It's been solid for a long time.",
        "created_utc": 1623165335,
        "id": "h11cokw",
        "score": 14,
        "subreddit": "stocks",
        "created": 1623194135.0
    },
    {
        "author": "BizzyM",
        "body": "Gen-X becoming irrelevant.  We're equated with boomers because technologically, we were close to the first.  Like Betamax, Texas Instruments, and every proprietary Sony format, first easily becomes last.",
        "created_utc": 1622809877,
        "id": "h0k6324",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1622838677.0
    },
    {
        "author": "peter-doubt",
        "body": "AAPL isn't a semiconductor player on the scale of Taiwan semi or TXN. Nor is MSFT.\n\nHave SMH.. find it a bit dull compared to the overall chip market. But also have NVDA, so that works out. \n\nAlso, AAPL and MSFT are present in soooo many indeces and ETFs that if you pick another fund, almost any other, you'd have exposure there.\n\nKeep your semi choices in semis, get your tech issues elsewhere",
        "created_utc": 1623816900,
        "id": "h1xkr85",
        "score": 10,
        "subreddit": "stocks",
        "created": 1623845700.0
    },
    {
        "author": "PM_ME_DANK",
        "body": "Texas Instruments is awesome. Their product portfolio consists of &gt;100k products sold over an equally large number of customers so a very diverse revenue stream. Not only that, they make analog chips which have very long sell cycles. The latest Samsung or Apple chip may only be relevant for a year or 2 before faster/better chips are made but analog chips have 7 to 10 year sell cycles. $TXN still sells a chip that they designed/manufactured 30 years ago! And, it's vertically integrated. Great business.",
        "created_utc": 1623173754,
        "id": "h11wrhc",
        "score": 7,
        "subreddit": "stocks",
        "created": 1623202554.0
    },
    {
        "author": "LeocantoKosta_",
        "body": "NVDA is great, seems a little expensive though. Long term probably doesn't matter. I would avoid Intel. I like the trio of semi equipment companies - ASML, LRCX, AMAT. I also like some of the fabless chipmakers like AVGO, TXN, and NXP. TSMC might be good as well. Ultimately, you could spread out across some names, or maybe a semiconductor ETF like SOXX or PSI.",
        "created_utc": 1623262588,
        "id": "h16l8o8",
        "score": 5,
        "subreddit": "stocks",
        "created": 1623291388.0
    },
    {
        "author": "kwerfluffle",
        "body": "Have you looked at TXN? Pays a dividend and is in the same boat, might not be the same $ off highs as ON but ON like all semis got pumped at the breaking of Chip shortage news.",
        "created_utc": 1623851694,
        "id": "h1yv7ji",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1623880494.0
    },
    {
        "author": "Viclaterreur",
        "body": "We have less braincells than a neural network running on a Texas Instruments calculator maybe?",
        "created_utc": 1623058839,
        "id": "h0w49ib",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1623087639.0
    },
    {
        "author": "VMP85",
        "body": "Pick 4 of the following for long term holds:  \nTSM, NVDA, ASML, INTC, LRCX, TXN, AMAT, AMD, MRVL",
        "created_utc": 1623849778,
        "id": "h1yrcv6",
        "score": 3,
        "subreddit": "investing",
        "created": 1623878578.0
    },
    {
        "author": "creemeeseason",
        "body": "I've been eyeing ADI (analog devices) or TXN (Texas instruments). They make analog chips instead of digital and have a virtual duopoly. Analog chips have a long life cycle, sometimes 10 years plus, so these companies aren't in a constant technology cycle race. As a result they basically mint money off existing tech. \n\nNot as glamorous, but their chops go into everything. 5g, cars, phones, satellites, industry... basically all growing fields.",
        "created_utc": 1623403834,
        "id": "h1dunbc",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623432634.0
    },
    {
        "author": "DoggyFrench",
        "body": "Knowing this boomer administration it’s probably going towards companies with 0 Taiwan foundation or aesthetic. So essentially, Intel, AMAT, Texas Instruments, Qualcomm, and NXP.",
        "created_utc": 1623305261,
        "id": "h190kh9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623334061.0
    },
    {
        "author": "boxingborat",
        "body": "Semi conductor etf? Been on the fence about getting TSM, INTC, ON, TXN",
        "created_utc": 1623855189,
        "id": "h1z2u2f",
        "score": 2,
        "subreddit": "stocks",
        "created": 1623883989.0
    },
    {
        "author": "TheMadBeaker",
        "body": "The global markets can't get enough chips right now. Lead times are crazy, and most fabs are \\*just\\* starting to raise prices, which we should see some really great Q2/Q3 profits. Many have committed billions to more fabs, but those will be years before they come online.\n\nThere is never going to be a decline in chip demand, they keep shoving more and more in everything.\n\nSome stocks I bought early March: I'm up over 40% on NVDA, 23% on AMAT, 17% on NXPI, and 17% on UMC, 13% on TXN.\n\n**\\*Not stock advice\\***",
        "created_utc": 1623344008,
        "id": "h1asyg4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1623372808.0
    },
    {
        "author": "TheWings977",
        "body": "I have TXN in my Roth :)",
        "created_utc": 1623852483,
        "id": "h1ywvdy",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623881283.0
    },
    {
        "author": "geocaden",
        "body": "25 year old PhD student with $10k in a single stock (TXN).  I'm considering moving all of this into various index funds with goal of long-term growth.  I have a some money in savings and get paid a PhD student salary (essentially nothing haha).  Any advice on what you would do with this situation is greatly appreciated.",
        "created_utc": 1623518885,
        "id": "h1j9lhy",
        "score": 1,
        "subreddit": "investing",
        "created": 1623547685.0
    },
    {
        "author": "Leadershiptothemoon",
        "body": "Depending on when you purchased it and how much gains you have - are you up 15+%? If so I would keep it and with new cash here and there start buying mutual fund. \n\nIf you sell with decent gains - you will get hit with a higher tax bill you might not be expecting. Plus TXN might be on a growth trajectory.",
        "created_utc": 1623521562,
        "id": "h1jf0w8",
        "score": 1,
        "subreddit": "investing",
        "created": 1623550362.0
    },
    {
        "author": "winteroffice74",
        "body": "NVDA, INTC, TSM and TXN.\n\nhttps://news.stocktradersdaily.com/news_release/90/Texas+Instruments+TXN+Technical+Update_061621093446.html",
        "created_utc": 1623850544,
        "id": "h1ysv3m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1623879344.0
    },
    {
        "author": "VMP85",
        "body": "Pick 4 of the following for long term holds:  \nTSM, NVDA, ASML, INTC, LRCX, TXN, AMAT, AMD, MRVL",
        "created_utc": 1623849808,
        "id": "h1yrewt",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1623878608.0
    },
    {
        "author": "VMP85",
        "body": "Pick 4 of the following for long term holds:\n\nTSM, NVDA, ASML, INTC, LRCX, TXN, AMAT, AMD, MRVL",
        "created_utc": 1623849757,
        "id": "h1yrbdd",
        "score": -6,
        "subreddit": "stocks",
        "created": 1623878557.0
    }
]