[
    {
        "author": "joshonalog",
        "body": "I cannot tel y’all how hard I’ve worked to keep my portfolio at exactly the same price",
        "created_utc": 1620139228,
        "id": "gwwu1w6",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1620168028.0
    },
    {
        "author": "TheHumanCalculator_",
        "body": "If you dont listen to the cumtown podcast idk what to tel u bro",
        "created_utc": 1621402328,
        "id": "gynwhwm",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1621431128.0
    },
    {
        "author": "LiquidatedRetard",
        "body": "This goes for both bulls and bears. Sometimes you’ll think you’re right but the market will tel u otherwise.",
        "created_utc": 1621444345,
        "id": "gypw0xl",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1621473145.0
    },
    {
        "author": "dwdsquared2",
        "body": "https://twitter.com/IDF/status/1392267287542050819?s=20  \n\\&gt;It’s 3AM and more rockets are being fired at Tel Aviv. Families are being woken up &amp; rushed to bomb shelters. - Israel Defense Forces",
        "created_utc": 1620777980,
        "id": "gxsmrof",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620806780.0
    },
    {
        "author": "Janquas",
        "body": "Applied materials is another supplier of the manufacturing equipment. TEL is one. You can buy into Micron, Samsung, Taiwan semiconductor manufacturing, Nvidia, and AMD. Lots of strong companies. They have all performed well. I'm bias on MU, AMD, and a few others. They grown a lot over the last few years",
        "created_utc": 1620912547,
        "id": "gxz4oxi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620941347.0
    },
    {
        "author": "Monkeyseemonkey2doo",
        "body": "Anyone just want to cuddle and tel each other it will be ok come Monday",
        "created_utc": 1621055424,
        "id": "gy6o6dc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1621084224.0
    },
    {
        "author": "disGRUNTled03",
        "body": "Defense, shit is popping off in Tel Aviv right now.",
        "created_utc": 1620757364,
        "id": "gxrbpaw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620786164.0
    },
    {
        "author": "StartedWIT25",
        "body": "Oh shit Lidar??? Why didn’t you tel me they had Lidar? That changed everything!!!!",
        "created_utc": 1620141124,
        "id": "gwwyokq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620169924.0
    },
    {
        "author": "FalconGhost",
        "body": "I’m not but I’m just trying to tel even if it shoots up a short squeeze won’t happen because they almost never do",
        "created_utc": 1620768142,
        "id": "gxs1s3h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620796942.0
    },
    {
        "author": "el_hicham",
        "body": "You talking about tel Aviv? Those rockets are shit. One step up from bottle rockets or Roman candles 🤣",
        "created_utc": 1620756334,
        "id": "gxr97mk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620785134.0
    },
    {
        "author": "Twist_Frostyy",
        "body": "You write this like trails have been FAILING for decades. The world would probably be in a much better place if psychedelic research didn’t have the rug pulled out from under it in the late ‘60’s. Trials will tel the tale, but acting like you don’t already know what the outcome of these trials will be is foolish. We finally have the funding, we finally have the support, and we finally have the interest from society to change how Big Pharma works. It’s not really so up in the air as you are claiming it to be. All we have to do is wait. But the results were decided decades ago",
        "created_utc": 1620839152,
        "id": "gxvhsz3",
        "score": 2,
        "subreddit": "shroomstocks",
        "created": 1620867952.0
    },
    {
        "author": "justanoththrowaway94",
        "body": "I’m actually writing an assignment for my wife on why moving the embassy from Tel Aviv to Jerusalem was stupid right now.\n\nSeems like Trump might have got flak for it but Biden is double down on it.",
        "created_utc": 1620715675,
        "id": "gxpat47",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620744475.0
    },
    {
        "author": "DMK5506",
        "body": "Ironically, CNBC just tweeted: U.S. airlines cancel Tel Aviv flights after violence in Israel worsens",
        "created_utc": 1620848657,
        "id": "gxw59s4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620877457.0
    },
    {
        "author": "Fit-Mycologist-6951",
        "body": "Yo someone tel me what the f happened in europe",
        "created_utc": 1621352369,
        "id": "gykwo4x",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621381169.0
    },
    {
        "author": "3rdlifekarmabud",
        "body": "Is there a way to get the API key?? since the button where it says \"Tel us about your app\" does not work when pressing \"Create App\"",
        "created_utc": 1619972602,
        "id": "gwofnen",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1620001402.0
    },
    {
        "author": "jomo777",
        "body": "Broooo please tel me your TLRY position actually!!!!!! Much more interested in hearing about those bags.",
        "created_utc": 1622293682,
        "id": "gzv96pn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622322482.0
    },
    {
        "author": "Seahawks_Fan12",
        "body": "&amp;#x200B;\n\nHere is the notice filed on Sedar about the late filing...\n\n Hollister Biosciences Inc. Announces Delay in Filing Annual Financial Statements VANCOUVER, BC –May 4th, 2021 – Hollister Biosciences Inc. (CSE:HOLL, OTC:HSTRF, FRANKFURT:HOB) (“Hollister” or the “Company”) announces that its annual financial statements for the year ended December 31, 2020, including the related management discussion and analysis, and CEO and CFO certifications (collectively, the “Annual Financial Filings”) were not filed by the required filing deadline of April 30, 2021 (the “Filing Deadline”). The Annual Financial Filings were not filed on or before the Filing Deadline due to the location of the operations and the COVID-19 pandemic that lead to delays in coordinating the collection of data and documentation for inventory. The Company has been advised by its auditors, Davidson &amp; Company LLP, that they need more time to complete the audit. The Company is working on the steps required to complete the Annual Financial Filings and is working diligently to be able to file the Annual Financial Filings as soon as possible. The Company will provide updates as further information relating to the Annual Financial Filings becomes available. The Company has applied to the applicable securities regulatory authorities and received a management cease trade order (“MCTO”) imposed against the Chief Executive Officer and Chief Financial Officer of the Company precluding them from trading securities of the Company. The MCTO will be in effect until the Annual Financial Filings are filed, and requires that the Annual Financial Filings be filed on or before July 2nd, 2021. Until the Annual Financial Filings are filed, the Company intends to issue bi-weekly default status reports in accordance with National Policy 12-203 - Management Cease Trade Orders. The Company intends to satisfy the provisions of the Alternative Information Guidelines during the period it remains in default of the filing requirements. The Company confirms that there is no other material information relating to its affairs that has not been generally disclosed. About Hollister Biosiences Inc. Hollister Biosciences Inc. is a multi-state cannabis company with a vision to be the soughtafter premium brand portfolio of innovative, high-quality cannabis &amp; hemp products.  LEGAL\\_36167530.1 2 Error! Unknown document property name. Hollister uses a high margin model, controlling the whole process from manufacture to sales to distribution or seed to shelf. Products from Hollister Biosciences Inc. include HashBone, the brand's premier artisanal hash-infused pre-roll, along with concentrates (shatter, budder, crumble), distillates, solvent-free bubble hash, pre-packaged flower, prerolls, tinctures, vape products, and full-spectrum high CBD pet tinctures. Hollister Cannabis Co. additionally offers white-labeling manufacturing of cannabis products. Our wholly-owned California subsidiary Hollister Cannabis Co is the 1st state and locally licensed cannabis company in the city of Hollister, CA birthplace of the \"American Biker\". Website: www.hollisterbiosciences.co The CSE, nor its regulation services provider, does not accept responsibility for the adequacy or accuracy of this release. Forward-Looking Information Forward-Looking Information: This news release includes certain statements that may be deemed \"forward-looking statements\". The use of any of the words \"anticipate\", \"continue\", \"estimate\", \"expect\", \"may\", \"will\", \"would\", \"project\", \"should\", \"believe\" and similar expressions are intended to identify forward-looking statements. Although the Company believes that the expectations and assumptions on which the forward-looking statements are based are reasonable, undue reliance should not be placed on the forward-looking statements because the Company can give no assurance that they will prove to be correct. Since forwardlooking statements address future events and conditions, by their very nature they involve inherent risks and uncertainties. These statements speak only as of the date of this News Release. Actual results could differ materially from those currently anticipated due to a number of factors and risks including various risk factors discussed in the Company's disclosure documents which can be found under the Company's profile onwww.sedar.com For further information: HOLLISTER BIOSCIENCES INC.: Investor Relations Contact, Melanie Barbeau: mbarbeau@renmarkfinancial.com, Tel: (416) 644- 2020 or (212) 812-7680, www.renmarkfinancial.com; Company Contact: Kelvin Lee: klee@k2capital.ca, Tel: 604-961-",
        "created_utc": 1620403400,
        "id": "gxacowy",
        "score": 1,
        "subreddit": "shroomstocks",
        "created": 1620432200.0
    },
    {
        "author": "Angry_Cupboard",
        "body": "Can’t tel you where the bottom is but I sold in the 80’s after holding from IPO.  I have been watching it very closely and am tempted to buy back in.",
        "created_utc": 1620328786,
        "id": "gx6p8ut",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620357586.0
    },
    {
        "author": "quarantrader",
        "body": "Ironically tel Aviv has literally beat covid",
        "created_utc": 1620794353,
        "id": "gxth947",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620823153.0
    },
    {
        "author": "ch44916",
        "body": "$DBG $TEL $XRP $CSC",
        "created_utc": 1620244191,
        "id": "gx2d8lr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620272991.0
    },
    {
        "author": "bradcoops11",
        "body": "Just made a new post of an updated portfolio tel me what you think! Cheers",
        "created_utc": 1621607070,
        "id": "gyy2xvn",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1621635870.0
    },
    {
        "author": "lbo4lyfe",
        "body": "Can someone tel me why this SPAC has not split",
        "created_utc": 1620837001,
        "id": "gxvchds",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1620865801.0
    },
    {
        "author": "bmad8225",
        "body": "$TEL",
        "created_utc": 1620274973,
        "id": "gx451ll",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620303773.0
    },
    {
        "author": "thegeorgetalk",
        "body": "Please tel me when you buy in",
        "created_utc": 1621278655,
        "id": "gyhagdv",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1621307455.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 18th of May\n\n\n\n## Upcoming events for Tuesday, May 18th\n\n - Expected earnings:\n\n  AGFY, AGTI, AGYS, AKYA, ANVS, ARKR, ASND, BIDU, BTX, BWL.A, BZUN, CALT, CARV, CXDO, DAO, DGLY, DOYU, DQ, DXYN, DY, ECC, EIC, FCBP, GNLN, HD, HUIZ, HUYA, IBEX, ICON, IQ, JAN, JHX, KC, KTCC, LOOP, M, MITO, MOSY, MYTE, NCNA, NETI, NEW, NTES, NTIP, QUIK, RAVN, SCPE, SE, SKYT, SMTI, STE, STEP, STIC, SUMR, SYPR, TCOM, TCS, TIMB, TRNS, TTWO, VIAO, VOD, VST, VYNT, WHLR, WMT\n\n - Ex-div:\n\n  ADM, AFL, AGO, AMOT, BG, BGCP, BWXT, CVX, CXE, CXH, DHT, DMB, ED, EQIX, FDP, GAIN, GLAD, GOOD, LAND, LARK, LMAT, MAV, MCR, MHI, MIN, MMT, MPC, MRO, PCF, PHD, PHT, POWL, PTMN, RMAX, SEM, SXC, TGT, TXRH, WRK\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.065%)\n    - API Weekly Crude Oil Stock (previous: -2.533M)\n    - Building Permits (consensus: 1.770M, previous: 1.759M)\n    - Building Permits (previous: 2.3%)\n    - FOMC Member Bostic Speaks\n    - Housing Starts (consensus: 1.710M, previous: 1.739M)\n    - Housing Starts (previous: 19.4%)\n    - Redbook (previous: 13.3%)\n\n## Upcoming events for Wednesday, May 19th\n\n - Expected earnings:\n\n  ABEO, ADI, AIM, BBQ, BEKE, BLRX, BORR, CAAP, CAE, CMRE, CPRT, CRKN, CSCO, CYRN, DAVA, DESP, EM, EXP, FRO, FURY, FUTU, GBR, GDS, GGB, HMG, HOTH, IOR, IPDN, ITMR, JD, KEYS, KNBE, LB, LMNL, LOW, LPG, MNR, MNSO, NESR, NNA, NRBO, NVIV, PATI, REKR, RZLT, SBLK, SCVL, SINT, SJ, SNPS, SQM, SY, TARO, TBLT, TGT, TJX, TYME, VINP, VIPS, WLMS, YI, YSG, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, AJX, APO, ASA, BGH, CLPR, CNP, CTSH, DFS, ES, FSLF, GFF, HE, HL, HTBI, IGR, LFUS, LTC, MCO, MSFT, PHX, RPRX, RXN, SBAC, SBSI, SPB, SUNS, THQ, THW, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 2.144%)\n    - Crude Oil Imports (previous: 2.363M)\n    - Crude Oil Inventories (consensus: 1.680M, previous: -0.427M)\n    - Cushing Crude Oil Inventories (previous: -0.421M)\n    - Distillate Fuel Production (previous: 0.157M)\n    - EIA Refinery Crude Runs  (previous: -0.223M)\n    - EIA Weekly Distillates Stocks (consensus: -0.300M, previous: -1.733M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.7%, previous: -0.4%)\n    - FOMC Meeting Minutes\n    - FOMC Meeting Minutes\n    - FOMC Member Bostic Speaks\n    - Gasoline Inventories (consensus: -0.800M, previous: 0.378M)\n    - Gasoline Production (previous: 0.442M)\n    - Heating Oil Stockpiles (previous: -0.315M)\n    - MBA 30-Year Mortgage Rate (previous: 3.11%)\n    - MBA Mortgage Applications (previous: 2.1%)\n    - MBA Purchase Index (previous: 276.7)\n    - Mortgage Market Index (previous: 715.3)\n    - Mortgage Refinance Index (previous: 3,281.0)\n\n## Upcoming events for Thursday, May 20th\n\n - Expected earnings:\n\n  ACET, AINV, AIV, AMAT, APOP, ARPO, AVAL, BJ, BLCM, BRC, BWAY, CATO, CD, CDZI, CELC, CKX, CSIQ, CSWI, CUE, CZNC, DECK, ELTK, ENTX, FLO, FRSX, GENI, GLNG, GOGL, HRL, HWCC, HWKN, IGIC, JOBS, KSS, KUKE, LAZY, LBPS, LIZI, LSPD, MACK, MANU, MAXN, METX, MKTY, MNRO, NKSH, NUZE, OLK, PANW, PAVM, PAX, PLCE, PLUG, PLUS, QIWI, REDU, RL, ROST, SBR, SBSW, SCX, SEEL, SKM, SUNW, SVM, TDAC, TGI, WMS, WOOF, XNET, YTRA\n\n - Ex-div:\n\n  ABR, ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ARGO, ASGI, AUB, AWP, BBSI, BGB, BGX, BSL, BWG, CBFV, CEM, CGNX, CMI, CORE, CTR, DEX, DFP, DMO, EFF, EFR, EFT, EHI, EMD, EMO, ENIA, ENIC, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EURN, EVG, EVRG, EVT, EXD, EXG, FDBC, FF, FFC, FLC, FMN, FSS, GDO, GSK, HBI, HCI, HCSG, HFRO, HGLB, HIE, HIO, HIX, HNI, HSY, HYI, IGI, MCHP, MGPI, MGU, MMM, MMU, MNRL, NCMI, NHF, NTG, OTIS, PBI, PFD, PRI, RTX, SBI, SCD, SHW, SNA, STNG, SWM, TEL, TKR, TPZ, TTP, TYG, UL, USLM, WBA, WEA, WHR, WIA, WIW\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.580%)\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 8-Week Bill Auction (previous: 0.010%)\n    - Continuing Jobless Claims (consensus: 3,640K, previous: 3,655K)\n    - Initial Jobless Claims (consensus: 450K, previous: 473K)\n    - Jobless Claims 4-Week Avg. (previous: 534.00K)\n    - Natural Gas Storage (consensus: 76B, previous: 71B)\n    - Philadelphia Fed Manufacturing Index (consensus: 43.0, previous: 50.2)\n    - Philly Fed Business Conditions (previous: 66.6)\n    - Philly Fed CAPEX Index (previous: 36.70)\n    - Philly Fed Employment (previous: 30.8)\n    - Philly Fed New Orders (previous: 36.0)\n    - Philly Fed Prices Paid (previous: 69.10)\n    - US Leading Index (consensus: 1.4%, previous: 1.3%)\n\n## Upcoming events for Friday, May 21st\n\n - Expected earnings:\n\n  AENZ, AHPI, ATLC, AZRX, BAH, BCOW, BFI, BKE, CBLI, CBMB, CGA, CIG, CNNB, CRTD, CYTH, DE, DSX, EMX, ENVB, FKWL, FL, FLNG, FSEA, GTBP, GWGH, HGSH, HUSA, JAGX, JOB, LIVE, MAG, MARPS, MBOT, MDLY, MDNA, MFG, MOXC, MTR, MUFG, MYMD, NAK, NETE, NXTD, OBCI, OGEN, PALI, PED, PPSI, PRT, ROLL, RVP, SELF, SNFCA, SNGX, SQBG, TAIT, TENX, TTNP, UAMY, UAVS, UNAM, USAS, VERY, VFC, WVFC, XPL, ZNTL\n\n - Ex-div:\n\n  AEIS, ATO, CHK, DLX, DX, ENR, FGB, FHB, GER, GSL, IEX, LPLA, MFD, NKSH, PAG, PPT, PSX, R, RDN, TIPT, TSCO, UPS, VTRS, WMG\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.2K)\n    - CFTC Copper speculative net positions (previous: 45.8K)\n    - CFTC Corn speculative net positions (previous: 500.9K)\n    - CFTC Crude Oil speculative net positions (previous: 496.6K)\n    - CFTC Gold speculative net positions (previous: 192.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -6.0K)\n    - CFTC Natural Gas speculative net positions (previous: -65.5K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -36.8K)\n    - CFTC Silver speculative net positions (previous: 52.8K)\n    - CFTC Soybeans speculative net positions (previous: 245.9K)\n    - CFTC Wheat speculative net positions (previous: 24.3K)\n    - Existing Home Sales (consensus: 2.0%, previous: -3.7%)\n    - Existing Home Sales (consensus: 6.09M, previous: 6.01M)\n    - Manufacturing PMI (consensus: 60.2, previous: 60.5)\n    - Markit Composite PMI (previous: 63.5)\n    - Services PMI (consensus: 64.5, previous: 64.7)\n    - U.S. Baker Hughes Oil Rig Count (previous: 344)\n    - U.S. Baker Hughes Total Rig Count (previous: 448)\n\n^^^^2021-05-18",
        "created_utc": 1621332017,
        "id": "gyjuyuf",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1621360817.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the 20th of May\n\n\n\n## Upcoming events for Thursday, May 20th\n\n - Expected earnings:\n\n  ADIL, AINV, AIV, AMAT, APOP, ARL, AVAL, BJ, BRC, BWAY, CATO, CCEP, CD, CDZI, CELC, CETX, CIH, CKX, CSIQ, CSWI, CTK, DECK, DYAI, EDRY, ELTK, ENTX, FLO, FRSX, GENI, GLNG, GNPX, GOGL, GRNQ, HRL, HWCC, HWKN, IGIC, ISUN, JOBS, KSS, KUKE, LAZY, LBPS, LIZI, LSPD, MACK, MAGS, MANU, MAXN, MDRR, METX, MNRO, MYSZ, NNDM, NUZE, OFED, OLK, PANW, PAX, PBFS, PBR.A, PLCE, PLUG, PLUS, PRPO, QIWI, RBCN, REDU, RL, ROST, SBR, SBSW, SEEL, SHSP, SKM, SUNW, SVM, TCRR, TDAC, TGI, WMS, WOOF, XNET, YTRA\n\n - Ex-div:\n\n  ABR, ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ARGO, ASGI, AUB, AWP, BBSI, BGB, BGX, BSL, BWG, CBFV, CEM, CGNX, CMI, CORE, CTR, DEX, DFP, DMO, EFF, EFR, EFT, EHI, EMD, EMO, ENIA, ENIC, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EURN, EVG, EVRG, EVT, EXD, EXG, FDBC, FF, FFC, FLC, FMN, FSS, GDO, GSK, HBI, HCI, HCSG, HFRO, HGLB, HIE, HIO, HIX, HNI, HSY, HYI, IGI, MCHP, MGPI, MGU, MMM, MMU, MNRL, NCMI, NHF, NTG, OTIS, PBI, PFD, PRI, RTX, SBI, SCD, SHW, SNA, STNG, SWM, TEL, TKR, TPZ, TTP, TYG, UL, USLM, WBA, WEA, WHR, WIA, WIW\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.580%)\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 8-Week Bill Auction (previous: 0.010%)\n    - Continuing Jobless Claims (consensus: 3,640K, previous: 3,655K)\n    - Initial Jobless Claims (consensus: 450K, previous: 473K)\n    - Jobless Claims 4-Week Avg. (previous: 534.00K)\n    - Natural Gas Storage (consensus: 60B, previous: 71B)\n    - Philadelphia Fed Manufacturing Index (consensus: 43.0, previous: 50.2)\n    - Philly Fed Business Conditions (previous: 66.6)\n    - Philly Fed CAPEX Index (previous: 36.70)\n    - Philly Fed Employment (previous: 30.8)\n    - Philly Fed New Orders (previous: 36.0)\n    - Philly Fed Prices Paid (previous: 69.10)\n    - US Leading Index (consensus: 1.4%, previous: 1.3%)\n\n## Upcoming events for Friday, May 21st\n\n - Expected earnings:\n\n  AENZ, AHPI, ANAT, ANDA, AZRX, BAH, BCOW, BFI, BKE, BOMN, CBLI, CGA, CIG, DE, DSX, FKWL, FL, FLNG, FSEA, GB, GTT, GWGH, HUSA, JOB, MARPS, MBOT, MDLY, MDNA, MLND, MTR, MYMD, NTZ, NXTD, OGEN, PALI, PED, PRT, ROLL, SQBG, TAIT, TTNP, UNAM, VERY, VFC, XPL\n\n - Ex-div:\n\n  AEIS, ATO, CHK, DLX, DX, ENR, FGB, FHB, GER, GSL, IEX, LPLA, MFD, NKSH, PAG, PPT, PSX, R, RDN, TIPT, TSCO, UPS, VTRS, WMG\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.2K)\n    - CFTC Copper speculative net positions (previous: 45.8K)\n    - CFTC Corn speculative net positions (previous: 500.9K)\n    - CFTC Crude Oil speculative net positions (previous: 496.6K)\n    - CFTC Gold speculative net positions (previous: 192.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -6.0K)\n    - CFTC Natural Gas speculative net positions (previous: -65.5K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -36.8K)\n    - CFTC Silver speculative net positions (previous: 52.8K)\n    - CFTC Soybeans speculative net positions (previous: 245.9K)\n    - CFTC Wheat speculative net positions (previous: 24.3K)\n    - Existing Home Sales (consensus: 2.0%, previous: -3.7%)\n    - Existing Home Sales (consensus: 6.09M, previous: 6.01M)\n    - Manufacturing PMI (consensus: 60.2, previous: 60.5)\n    - Markit Composite PMI (previous: 63.5)\n    - Services PMI (consensus: 64.5, previous: 64.7)\n    - U.S. Baker Hughes Oil Rig Count (previous: 344)\n    - U.S. Baker Hughes Total Rig Count (previous: 448)\n\n^^^^2021-05-20",
        "created_utc": 1621504813,
        "id": "gysz9ud",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1621533613.0
    },
    {
        "author": "Silver_Wolf_19",
        "body": "Time for RTX.\r  \nImproving earnings, paid dividend today.\r  \nThey are producing so many rockets. Why don't they fire some of them? They should also receive some new orders from Tel Aviv.",
        "created_utc": 1621538198,
        "id": "gyuwbgu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621566998.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 19th of May\n\n\n\n## Upcoming events for Wednesday, May 19th\n\n - Expected earnings:\n\n  ABEO, ADI, AIM, BBQ, BEKE, BLRX, BORR, CAAP, CAE, CMRE, CPRT, CRKN, CSCO, CYRN, DAVA, DESP, DTST, EM, EXP, FRO, FURY, FUTU, GDS, GGB, HMG, HOTH, IPDN, ITMR, JD, KEYS, KNBE, LB, LOW, LPG, MNR, MNSO, NESR, NNA, NVIV, PATI, SBLK, SCVL, SINT, SJ, SNPS, SQM, SY, TARO, TBLT, TGT, TJX, TYME, VINP, VIPS, WLMS, YI, YSG, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, AJX, APO, ASA, BGH, CLPR, CNP, CTSH, DFS, ES, FSLF, GFF, HE, HL, HTBI, IGR, LFUS, LTC, MCO, MSFT, PHX, RPRX, RXN, SBAC, SBSI, SPB, SUNS, THQ, THW, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 2.144%)\n    - Crude Oil Imports (previous: 2.363M)\n    - Crude Oil Inventories (consensus: 1.623M, previous: -0.427M)\n    - Cushing Crude Oil Inventories (previous: -0.421M)\n    - Distillate Fuel Production (previous: 0.157M)\n    - EIA Refinery Crude Runs  (previous: -0.223M)\n    - EIA Weekly Distillates Stocks (consensus: -0.386M, previous: -1.733M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.7%, previous: -0.4%)\n    - FOMC Meeting Minutes\n    - FOMC Member Bostic Speaks\n    - FOMC Member Quarles Speaks\n    - Gasoline Inventories (consensus: -0.886M, previous: 0.378M)\n    - Gasoline Production (previous: 0.442M)\n    - Heating Oil Stockpiles (previous: -0.315M)\n    - MBA 30-Year Mortgage Rate (previous: 3.11%)\n    - MBA Mortgage Applications (previous: 2.1%)\n    - MBA Purchase Index (previous: 276.7)\n    - Mortgage Market Index (previous: 715.3)\n    - Mortgage Refinance Index (previous: 3,281.0)\n\n## Upcoming events for Thursday, May 20th\n\n - Expected earnings:\n\n  ADIL, AINV, AIV, AMAT, APOP, ARL, AVAL, BJ, BRC, BWAY, CATO, CCEP, CD, CDZI, CELC, CETX, CIH, CKX, CSIQ, CSWI, CTK, DECK, DYAI, ELTK, ENTX, FLO, FRSX, GENI, GLNG, GNPX, GOGL, GRNQ, HRL, HWCC, HWKN, IGIC, ISUN, JOBS, KSS, KUKE, LAZY, LBPS, LIZI, LSPD, MACK, MAGS, MANU, MAXN, MDRR, METX, MKTY, MNRO, MYSZ, NKSH, NNDM, NUZE, OFED, OLK, OPHC, PANW, PAX, PBFS, PBR.A, PLCE, PLUG, PLUS, PRPO, QIWI, RBCN, REDU, RL, ROST, SBR, SBSW, SCX, SEEL, SHSP, SKM, SUNW, SVM, TCI, TCRR, TDAC, TGI, VBFC, WMS, WOOF, XNET, YTRA\n\n - Ex-div:\n\n  ABR, ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ARGO, ASGI, AUB, AWP, BBSI, BGB, BGX, BSL, BWG, CBFV, CEM, CGNX, CMI, CORE, CTR, DEX, DFP, DMO, EFF, EFR, EFT, EHI, EMD, EMO, ENIA, ENIC, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EURN, EVG, EVRG, EVT, EXD, EXG, FDBC, FF, FFC, FLC, FMN, FSS, GDO, GSK, HBI, HCI, HCSG, HFRO, HGLB, HIE, HIO, HIX, HNI, HSY, HYI, IGI, MCHP, MGPI, MGU, MMM, MMU, MNRL, NCMI, NHF, NTG, OTIS, PBI, PFD, PRI, RTX, SBI, SCD, SHW, SNA, STNG, SWM, TEL, TKR, TPZ, TTP, TYG, UL, USLM, WBA, WEA, WHR, WIA, WIW\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.580%)\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 8-Week Bill Auction (previous: 0.010%)\n    - Continuing Jobless Claims (consensus: 3,640K, previous: 3,655K)\n    - Initial Jobless Claims (consensus: 450K, previous: 473K)\n    - Jobless Claims 4-Week Avg. (previous: 534.00K)\n    - Natural Gas Storage (consensus: 76B, previous: 71B)\n    - Philadelphia Fed Manufacturing Index (consensus: 43.0, previous: 50.2)\n    - Philly Fed Business Conditions (previous: 66.6)\n    - Philly Fed CAPEX Index (previous: 36.70)\n    - Philly Fed Employment (previous: 30.8)\n    - Philly Fed New Orders (previous: 36.0)\n    - Philly Fed Prices Paid (previous: 69.10)\n    - US Leading Index (consensus: 1.4%, previous: 1.3%)\n\n## Upcoming events for Friday, May 21st\n\n - Expected earnings:\n\n  AENZ, AHPI, ANAT, ANDA, AZRX, BAH, BCOW, BFI, BKE, BOMN, CBLI, CGA, CIG, DE, DSX, ENVB, FKWL, FL, FLNG, FSEA, GB, GTT, GWGH, HUSA, JOB, MARPS, MBOT, MDLY, MDNA, MLND, MOXC, MTR, MYMD, NAK, NEN, NXTD, OGEN, PALI, PED, PRT, ROLL, SQBG, TAIT, TTNP, UNAM, VERY, VFC, XPL\n\n - Ex-div:\n\n  AEIS, ATO, CHK, DLX, DX, ENR, FGB, FHB, GER, GSL, IEX, LPLA, MFD, NKSH, PAG, PPT, PSX, R, RDN, TIPT, TSCO, UPS, VTRS, WMG\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.2K)\n    - CFTC Copper speculative net positions (previous: 45.8K)\n    - CFTC Corn speculative net positions (previous: 500.9K)\n    - CFTC Crude Oil speculative net positions (previous: 496.6K)\n    - CFTC Gold speculative net positions (previous: 192.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -6.0K)\n    - CFTC Natural Gas speculative net positions (previous: -65.5K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -36.8K)\n    - CFTC Silver speculative net positions (previous: 52.8K)\n    - CFTC Soybeans speculative net positions (previous: 245.9K)\n    - CFTC Wheat speculative net positions (previous: 24.3K)\n    - Existing Home Sales (consensus: 2.0%, previous: -3.7%)\n    - Existing Home Sales (consensus: 6.09M, previous: 6.01M)\n    - Manufacturing PMI (consensus: 60.2, previous: 60.5)\n    - Markit Composite PMI (previous: 63.5)\n    - Services PMI (consensus: 64.5, previous: 64.7)\n    - U.S. Baker Hughes Oil Rig Count (previous: 344)\n    - U.S. Baker Hughes Total Rig Count (previous: 448)\n\n^^^^2021-05-19",
        "created_utc": 1621418414,
        "id": "gyofdys",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1621447214.0
    },
    {
        "author": "The_Squidling",
        "body": "I tel her as soon as PLTR pays off we can finally afford to go to Wendies",
        "created_utc": 1621597100,
        "id": "gyxkto7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621625900.0
    },
    {
        "author": "IvanThinking",
        "body": "Hop on board, this should soar today. \n\n\\- Phase 3 GENESIS study in stem-cell mobilization (SCM) demonstrated highly statistically significant positive results across all primary and secondary endpoints -\r  \n\r  \n\\- \\~90% of patients in treatment arm underwent transplantation following only one dose of Motixafortide and only one apheresis session; potentially positions Motixafortide + G-CSF to become new standard of care in this indication -\r  \n\r  \n\\- Company proceeding with activities in support of NDA submission targeted for H1 2022 -\r  \n\r  \n\\- Management to hold conference call today, May 26, at 10:00 am EST -\r  \n\r  \nTEL AVIV, Israel, May 26, 2021 /PRNewswire/ -- BioLineRx Ltd. (NASDAQ: BLRX) (TASE: BLRX), a late clinical-stage biopharmaceutical company focused on oncology, today reports its financial results for the quarter ended March 31, 2021 and provides a corporate update.",
        "created_utc": 1622027340,
        "id": "gzi0umw",
        "score": -6,
        "subreddit": "wallstreetbets",
        "created": 1622056140.0
    },
    {
        "author": "Analoghogdog",
        "body": "Oof. Palantir is never coming back. Its essentially a CIA scam to get the people to willingly fund 1984 style surveilance. Dont believe me? In-Q-tel is the investment banking arm of the CIA who owns an unknown percentage of PLTR and was an initial investor.",
        "created_utc": 1620572800,
        "id": "gxi53ns",
        "score": -7,
        "subreddit": "investing",
        "created": 1620601600.0
    },
    {
        "author": "Kay312010",
        "body": "FTNT\n\nMSFT\n\nFB\n\nCROX\n\nVSTO\n\nAMC\n\nBB",
        "created_utc": 1622684988,
        "id": "h0e03a1",
        "score": 2,
        "subreddit": "investing",
        "created": 1622713788.0
    },
    {
        "author": "LeoBarca-10",
        "body": "I am heavily invested in Fortinet. As for the “why” do your DD and just look at the growth in that last 1 year. It’s competitors are the likes of Cisco and paloalto and fortinet is starting to have majority of some markets. Targets for the stock are $350+ usd. This is not financial advice.",
        "created_utc": 1622768599,
        "id": "h0iej60",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1622797399.0
    },
    {
        "author": "LeoBarca-10",
        "body": "Fortinet.",
        "created_utc": 1622604645,
        "id": "h09ud1a",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1622633445.0
    }
]