[
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  3rd of May\n\n\n\n## Upcoming events for Monday, May  3rd\n\n - Stock splits:\n\n    - AMOT @ **3:2** (Payable date: 04/30/2021)\n    - BRBS @ **3:2** (Payable date: 04/30/2021)\n    - CIG @ **111.497:100** (Payable date: )\n\n - Expected earnings:\n\n  ADC, ADUS, AGR, AKTS, ALUS, ALX, AMG, APPF, ARGO, ATCO, AWK, AWR, BCEI, BELFA, BELFB, BLDP, BRX, BSM, BWXT, CAN, CAR, CBFV, CBT, CC, CEA, CHGG, CIB, CINR, CNA, CORT, CPTA, CR, CRNT, CSR, CURO, CVI, CYCN, DBVT, DESP, DSPG, DZSI, EARN, EL, ELVT, ENBL, ENIA, ENIC, EPD, EPRT, EVER, FANG, FLS, FN, FNCB, FRPT, FSTR, GAIA, GENC, GLAD, GLYC, GPP, GPRE, HBP, HLIT, HNRG, IAG, IPI, IRBT, ITRI, ITUB, IVAC, JKHY, KDNY, KELYA, KELYB, KFFB, KFRC, KMT, KPTI, KRYS, L, LDI, LEG, LGND, LJPC, LMNX, LTHM, LTRN, LXRX, MAXR, MFIN, MOS, MRNS, MSB, MWA, MYGN, NCSM, NERV, NSP, NSSC, NTR, NWPX, O, OGS, OHI, ON, OTTR, OVBC, OXLC, PEBK, PETS, PLOW, PW, QGEN, RBC, REGI, RGCO, RIG, RILY, RMBS, RVPH, RYTM, SANM, SBT, SCI, SEB, SEDG, SGU, SHLS, SHO, SIBN, SOI, SPNE, STRL, SU, TA, TCMD, TELL, TGH, THCA, THCB, TRC, TRVG, UAN, UE, VGZ, VMD, VNO, VNOM, VRNS, WEC, WMB, WMK, WTRE, WWD, XPO, ZI, ZNH\n\n - Ex-div:\n\n  ASML, BMTC, BND, BNDW, BNDX, CAPL, CIG, CRS, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, IGD, ITUB, LMRK, MCBS, PKBK, SAFM, SHLX, SNY, SPH, SRCE, SRLP, STZ, STZ.B, VCIT, VCLT, VCSH, VGIT, VGLT, VGSH, VMBS, VTC, VWOB, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.020%)\n    - 6-Month Bill Auction (previous: 0.035%)\n    - Construction Spending (consensus: 1.9%, previous: -0.8%)\n    - FOMC Member Williams Speaks\n    - Fed Chair Powell Speaks\n    - ISM Manufacturing Employment (consensus: 61.5, previous: 59.6)\n    - ISM Manufacturing New Orders Index (previous: 68.0)\n    - ISM Manufacturing PMI (consensus: 65.0, previous: 64.7)\n    - ISM Manufacturing Prices (consensus: 86.1, previous: 85.6)\n    - Investing.com Gold Index (actual: 50.0%, previous: 52.0%)\n    - Investing.com S&amp;P 500 Index (actual: 49.1%, previous: 33.1%)\n    - Loan Officer Survey\n    - Manufacturing PMI (previous: 60.6)\n    - Total Vehicle Sales (previous: 17.70M)\n\n## Upcoming events for Tuesday, May  4th\n\n - Expected earnings:\n\n  ACLS, ACOR, ACRE, AFG, AGRX, AHH, AHT, AIZ, AJX, AKAM, ALC, ALGT, ALRM, AMCR, AME, AMK, AMRC, ANDE, ANET, ANVS, APEN, APO, APTO, AQB, AQST, ARC, ARCB, ARNC, ARVN, ARWR, ATC, ATRA, ATVI, AYX, AZYO, BBGI, BEN, BEP, BERY, BG, BGFV, BHC, BKEP, BKH, BNFT, BNL, BR, BRY, BTG, BXC, CBB, CDEV, CDLX, CEIX, CERS, CGBD, CHCT, CIGI, CIX, CLDT, CMI, CMP, CNCE, COP, COUR, CPK, CPSI, CRK, CRL, CRSR, CTLT, CTSO, CTVA, CVGI, CVLT, CVS, CWH, CXDO, CYRX, CZR, D, DCO, DCPH, DD, DEA, DEI, DENN, DHT, DK, DKL, DLB, DOOR, DRRX, DVN, EC, ENLC, EPAY, EQC, ERYP, ESE, ESPR, ETN, ETRN, EXAS, EXPD, EXTN, FCBP, FI, FNHC, FSP, FSS, FTSI, GCP, GHC, GILT, GLDD, GLT, GMED, GOOD, GPN, GRBK, GRFS, GSKY, GTE, H, HASI, HCCI, HEP, HI, HLF, HMN, HSC, HSIC, HST, HURN, HY, IAA, ICD, ICFI, ICHR, IDN, IDXX, INCY, INFN, INGN, INGR, INN, INS, INSP, INTZ, IOSP, IPGP, IT, ITIC, JAZZ, JBGS, JNCE, KAI, KAMN, KAR, KBAL, KKR, KNSA, KOPN, KTCC, LADR, LAMR, LANC, LARK, LCII, LDOS, LGIH, LNG, LNTH, LOOP, LPSN, LPX, LSCC, LSI, LUNG, LYFT, MANT, MBUU, MCFE, MCRB, MCY, MEC, MED, MELI, MIC, MLM, MOSY, MPC, MPLX, MPWR, MRCC, MRCY, MSEX, MTCH, MTOR, MVBF, NEX, NMIH, NNN, NR, NRC, NS, NSA, NVTA, NXST, OBSV, ODT, OSPN, OUT, PAA, PAGP, PAYC, PCRX, PEAK, PEN, PERI, PFE, PINC, PKI, PKOH, POWL, PQG, PRO, PRU, PTCT, PTVCA, PTVCB, PUMP, PVAC, PVG, PXD, PXLW, QUAD, RACE, RARE, RCKY, RCM, RCUS, RDN, RGEN, RHP, RM, RMRM, RNG, RPAI, RRR, RTLR, RVI, RYAM, SABR, SAGE, SEE, SFST, SGMO, SIFY, SILK, SITM, SKLZ, SMCI, SND, SPCE, SPNS, SPT, STAG, STIM, SYKE, SYX, SYY, TBPH, TCS, TDG, TIMB, TKC, TMDX, TMUS, TNC, TREC, TRI, TRTX, TSLX, TTEC, TTI, UA, UAA, UFPT, UPWK, USAC, UTL, VECO, VERI, VIAV, VIRT, VMC, VREX, VRSK, VSH, VST, VTOL, VVI, WDR, WEYS, WK, WLFC, WLK, WLKP, WMG, WOW, WSR, WTI, WTS, WTTR, WU, XELA, XENT, XLNX, XOMA, XP, XYL, YORW, Z, ZBH, ZBRA, ZG\n\n - Ex-div:\n\n  AMRB, BANR, BBD, BBDO, BUD, CS, EIG, ETRN, FMX, HFWA, IBCP, IDA, NTIC, RELL, TGP, USDP, WBS\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: 4.319M)\n    - Durables Excluding Defense (previous: 0.5%)\n    - Exports (previous: 187.30B)\n    - FOMC Member Daly Speaks\n    - Factory Orders (consensus: 1.3%, previous: -0.8%)\n    - Factory orders ex transportation (previous: -0.6%)\n    - IBD/TIPP Economic Optimism (previous: 56.4)\n    - ISM NY Business Conditions (previous: 37.2%)\n    - ISM-New York Index (previous: 804.5)\n    - Imports (previous: 258.30B)\n    - Redbook (previous: -17.2%)\n    - Redbook (previous: 13.9%)\n    - Trade Balance (consensus: -74.50B, previous: -71.10B)\n\n## Upcoming events for Wednesday, May  5th\n\n - Stock splits:\n\n    - FRSB @ **105:100** (Payable date: 05/20/2021)\n\n - Expected earnings:\n\n  AAWW, ABC, ABEO, ABIO, ABUS, AC, ACAD, ACCD, ACR, ADMA, ADPT, ADT, ADTN, AEGN, AEIS, AEL, AERI, AEZS, AFIN, AINC, ALB, ALCO, ALG, ALGM, ALL, ALLO, ALSK, ALTM, AMEH, AMOT, AMPE, AMPY, AMYT, ANAB, ANSS, AOSL, APA, APT, AQUA, ARAV, ARLO, ARNA, ASC, ASM, ASTE, ASYS, ATAX, ATLO, ATO, ATSG, ATTO, AVA, AVID, AVNS, AVNW, AXGN, BAND, BBSI, BBU, BCH, BCOR, BCSF, BDC, BE, BFAM, BFS, BHR, BKNG, BLX, BRKR, BWA, BXRX, CCMP, CCRN, CCU, CDAY, CDNA, CDW, CENT, CENTA, CENX, CERN, CF, CFBK, CFMS, CGEN, CIM, CKPT, CLDX, CLH, CLLS, CLNC, CLVS, CLW, CMLS, CMRE, CNDT, CNHI, CPA, CPAC, CPE, CPSS, CRD.A, CRD.B, CRTO, CSGS, CSTE, CTSH, CUB, CUTR, CW, CXW, CYBR, DAR, DCP, DFIN, DGII, DHC, DHX, DIN, DLHC, DMAC, DNB, DNN, DNOW, DOC, DRTT, EAF, ECPG, EDIT, EFC, ELA, EMKR, EMR, EPM, EPR, EQH, EQT, EQX, ES, ESTA, ESTE, ETSY, EVH, EVRI, EXC, EYEG, EYPT, FATE, FDP, FICO, FLEX, FLMN, FLOW, FLT, FMC, FMS, FNV, FORR, FOX, FOXA, FPAY, FRPH, FRT, FSLY, FTS, FUN, FUNC, FVE, FXNC, GAU, GBT, GDDY, GDOT, GEL, GFL, GFN, GGB, GIL, GKOS, GLRE, GM, GMAB, GMRE, GNK, GOEV, GOLD, GPL, GRP.U, GSS, GSX, GTHX, HARP, HAYW, HCC, HDSN, HEAR, HFC, HLT, HNGR, HPP, HR, HRTG, HRTX, HSON, HUBG, HUBS, HZNP, IEC, IIPR, IMXI, INMB, INMD, INSG, IO, IONS, ISEE, IVC, IVR, JLL, JRVR, KALA, KE, KIDS, KLIC, KRO, KTOS, KVHI, KW, LBTYA, LBTYB, LBTYK, LCI, LESL, LHCG, LILA, LILAK, LL, LMRK, LNC, LNSR, LOPE, LPI, LUMN, LUMO, MCS, MDCA, MDU, MDWD, MET, MFC, MGPI, MGY, MLR, MLVF, MNKD, MNR, MOR, MRO, MTG, MTW, MYO, NBIX, NC, NEO, NESR, NGD, NHTC, NI, NL, NLTX, NMFC, NNA, NODK, NOTV, NP, NRZ, NUS, NUVA, NVEC, NVO, NVRO, NVST, NWN, NYT, OAS, OCDX, OCUL, ODP, OM, OMI, OMP, OPTN, ORA, ORCC, OSUR, PARR, PASG, PDCE, PEG, PEI, PETQ, PFGC, PFIE, PFLT, PGEN, PING, PLMR, PLYA, PNNT, PNW, PRA, PRI, PRIM, PRTA, PSN, PSNL, PTMN, PTR, PTVE, PWFL, PYPL, QLYS, QNST, QRVO, QTRX, QTWO, QUOT, QURE, RCII, RCKT, RDFN, RDWR, RESN, REYN, RGLD, RGNX, RGR, RIGL, RKT, RLJ, RMNI, RNGR, ROCK, ROOT, RPT, RSG, RUN, RYI, RYN, SAFT, SAR, SBBP, SBGI, SBH, SBOW, SBRA, SCU, SGRY, SHI, SIMO, SITE, SJ, SJI, SKT, SLF, SLNG, SLRC, SMG, SMP, SMSI, SNEX, SNR, SPKE, SPR, SPWR, SRC, SRE, SRPT, SSYS, STAA, STAY, STKL, STLA, STN, STNG, SUNS, SUP, SUPN, SWM, SYN, TALO, TCON, TCPC, TGB, TLND, TNDM, TPC, TPTX, TPVG, TRMB, TRNO, TT, TTGT, TUP, TVTY, TWLO, TWO, TXG, UBER, UFCS, UGI, UIHC, UNM, UPLD, USDP, UTHR, VAC, VAPO, VBIV, VCEL, VGR, VNDA, VRTV, VYGR, WAT, WHD, WLL, WMC, WRK, WTRG, WW, WYNN, XEC, XNCR, XPER, YELL, ZIXI, ZNGA, ZVO\n\n - Ex-div:\n\n  AWI, CATC, CCK, ETR, FELE, FSBW, HMLP, IBTX, KBH, LSTR, MATX, NBN, NEP, NWBI, OFED, OMF, OPBK, SIMO, STBA, TX, VBTX, WTFC\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 810K, previous: 517K)\n    - Crude Oil Imports (previous: 1.218M)\n    - Crude Oil Inventories (previous: 0.090M)\n    - Cushing Crude Oil Inventories (previous: 0.722M)\n    - Distillate Fuel Production (previous: 0.071M)\n    - EIA Refinery Crude Runs  (previous: 0.253M)\n    - EIA Weekly Distillates Stocks (consensus: -0.648M, previous: -3.342M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.4%)\n    - Gasoline Inventories (consensus: 0.508M, previous: 0.092M)\n    - Gasoline Production (previous: 0.243M)\n    - Heating Oil Stockpiles (previous: -0.175M)\n    - ISM Non-Manufacturing Business Activity (consensus: 69.5, previous: 69.4)\n    - ISM Non-Manufacturing Employment (previous: 57.2)\n    - ISM Non-Manufacturing New Orders (previous: 67.2)\n    - ISM Non-Manufacturing PMI (consensus: 64.3, previous: 63.7)\n    - ISM Non-Manufacturing Prices (previous: 74.0)\n    - MBA 30-Year Mortgage Rate (previous: 3.17%)\n    - MBA Mortgage Applications (previous: -2.5%)\n    - MBA Purchase Index (previous: 281.4)\n    - Markit Composite PMI (previous: 62.2)\n    - Mortgage Market Index (previous: 706.6)\n    - Mortgage Refinance Index (previous: 3,185.3)\n    - Services PMI (previous: 63.1)\n\n^^^^2021-05-03",
        "created_utc": 1620046601,
        "id": "gws01nq",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1620075401.0
    },
    {
        "author": "ColonelLongernuts",
        "body": "I lost my keys when I had $14 worth. The year was 2010. Reeeeeeeporting for duty",
        "created_utc": 1619903224,
        "id": "gwl4gvi",
        "score": 26,
        "subreddit": "StockMarket",
        "created": 1619932024.0
    },
    {
        "author": "AuroraItsNotTheTime",
        "body": "Like the dumbasses who bought bitcoins early on and then... forgot their keys? Like this ain’t your stockbroker account with a password you can recover if you answer 3 out of 4 security questions dude 😂",
        "created_utc": 1619897927,
        "id": "gwksb1o",
        "score": 21,
        "subreddit": "StockMarket",
        "created": 1619926727.0
    },
    {
        "author": "rjgnal",
        "body": "They just stole some activation keys from bill gates’s 5G microchips and are trying to market it for themselves.",
        "created_utc": 1620032129,
        "id": "gwrf2nz",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620060929.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\n\n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy. \n\n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\n\n3. If you want tax free capital gains, you can buy QBTC, BTCX or BTCC in your TFSA. For QBTC, it is certainly expensive in terms of its historical premiums (5%-20%) and MER (1.95%); however, if you are long/bullish in Bitcoin as an alternative asset class, then perhaps it does not really matter. With that said, you do not truly own Bitcoin with any of those because they are a fund; and therefore, you own shares of the fund and not Bitcoin itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your Bitcoin\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not insured. Big risk, but tax free in a TFSA.\n\n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\n\n5. Unfortunately, with BTCC, QBTC and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (Bitcoin) and simply run the fund with the Bitcoin backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\n\n6. In regards to taxes, if you truly own the asset (Bitcoin), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\n\n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really the Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. Disclaimer: I am super long Bitcoin.\n\nNow, here are some general points of interests to help you understand cold storage wallets:\n\n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\n\n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\n\n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \n\n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\n\n5. What is a blockchain? It is a transparent, public, and append-only ledger. Basically, you can add data to this transparent, open, and public ledger, but you can never edit/delete previously established data within it. This is executed by a mechanism of consensus creation between geographically scattered parties (i.e. computers) that do not need to trust each other. The parties only need to trust the consensus mechanism itself. Blockchain infrastructure relies on some form of challenge such that no single party on the network can consistently and systematically solve this challenge more than everyone else on the network. This randomizes the consensus mechanism of confirming transactions and ensures that no single party can force the blockchain ledger to accept a particular entry onto the ledger that others disagree with. This is a peer-to-peer network that can maintain updates to the ledger and verify those updates in such a way that it is impossible to defraud and impossible to alter an entry after it has been confirmed via consensus.\n\nI sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1620013345,
        "id": "gwqsbe4",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1620042145.0
    },
    {
        "author": "capn_of_outerspace",
        "body": "If you don’t have your private keys, you don’t own your crypto",
        "created_utc": 1619896755,
        "id": "gwkpq3q",
        "score": 6,
        "subreddit": "stocks",
        "created": 1619925555.0
    },
    {
        "author": "IIIBryGuyIII",
        "body": "That’s where your confused. You don’t “own” anything in regards to crypto until the crypto is backed behind your private keys.\n\nRobinhood and PayPal don’t even EVER give YOU actual access to the actual crypto.  Coinbase doesn’t relinquish this access until you send it your personal wallet that is backed up by your personal seed phrase.\n\nEdit: I might fall asleep. If your actually interested in learning the intricacy of it from me....and my knowledge is probably minimal in all reality... keep responding and I’ll happily reply at some point.",
        "created_utc": 1619918840,
        "id": "gwlzvg3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619947640.0
    },
    {
        "author": "justaRndy",
        "body": "Oh wait another thing. Are they going to convince Sony, Valve, Microsoft etc. to let people sell their digitally owned games / keys back via some Gamestop service, thus removing them from their accounts? Is Gamestop going to open up their own client for digital games and have a full community integration there, expecting people to shift there, leaving everything previously bought behind? \nWill this be integrated to the new consoles, do you think Sony and Microsoft will team up with Gamestop on that?\nBecause there is no buying digital games without an account that is linked to these games. Downloading / streaming games is clearly taking over.",
        "created_utc": 1619910742,
        "id": "gwll6gl",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1619939542.0
    },
    {
        "author": "haight6716",
        "body": "If I had a reason to, I would. Lmk when I can buy car insurance or tickets or whatever. I'm not interested in gambling on the price of nfts and I don't want to expose my keys to a 3rd party.\n\nMaybe one day we can really kill ticketmaster. That would be cool.",
        "created_utc": 1620005139,
        "id": "gwqe1xz",
        "score": 1,
        "subreddit": "investing",
        "created": 1620033939.0
    },
    {
        "author": "52F1",
        "body": "Yes it was, and in a very generic response I can tell you the CEO has made public statements to the effect of the bad finacials decisons made early on in the company. However I think some futher more detailed clatification is in order.\nAnd lieu of me piecing together the info I have been i touch with Steve Rheinarz the CEO and made a request for these details so you can hear it accurately and right from the source.\nToday they are at a gathering, a grand opening of sorts for the new factory, which is actually more ceremonial passing of the keys to the company and a site tour. So more than likely I wont hear back from him today, but he has usually gotten back to me in a day or two with the few email exchanges we have had.\nWhen I get those details I will post the info to help everyone better understand the companies history.",
        "created_utc": 1619877664,
        "id": "gwjhfq8",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1619906464.0
    },
    {
        "author": "JonathanL73",
        "body": "At this point Robinhood users are like that one person who keeps getting back into the same abusive relationship expecting things to be different.\n\nGuys just switch brokers, you have options. The biggest punishment RH can face is loosing customers due to screwing customers. If you stay with RH, you are giving them the greenlight to keep getting away with that. Stop supporting bad brokers, just get the ACATS transfer done.\n\nEdit: You guys should never have bought crypto on RH on the first place, use an exchange that gives you access to your wallet keys like Coinbase, Binance, BlockFi, Kraken, etc.",
        "created_utc": 1619947164,
        "id": "gwn1ugp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619975964.0
    },
    {
        "author": "ColonelLongernuts",
        "body": "I lost my keys when I had $14 worth. The year was 2010. Reeeeeeeporting for duty",
        "created_utc": 1619903224,
        "id": "gwl4gvi",
        "score": 26,
        "subreddit": "StockMarket",
        "created": 1619932024.0
    },
    {
        "author": "AuroraItsNotTheTime",
        "body": "Like the dumbasses who bought bitcoins early on and then... forgot their keys? Like this ain’t your stockbroker account with a password you can recover if you answer 3 out of 4 security questions dude 😂",
        "created_utc": 1619897927,
        "id": "gwksb1o",
        "score": 21,
        "subreddit": "StockMarket",
        "created": 1619926727.0
    },
    {
        "author": "Auquaholic",
        "body": "Hand keys to valet. Walk past pretty fountain and through the glass doors. Scans room. About midway, sees slot machine with a huge rocket on top. Yes, this is the best one in this whole casino. I'm playing.",
        "created_utc": 1620183144,
        "id": "gwze18s",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1620211944.0
    },
    {
        "author": "f1_manu",
        "body": "You clearly didn't understand my post. I specifically mentioned risk management as one of the keys of investing.  Nowhere do I say \"stocks only go up\" or talk about investing tech/growth. I don't know man, stop trying to be picky about everything and grasp the general idea behind what I said",
        "created_utc": 1620314839,
        "id": "gx5rsd2",
        "score": 13,
        "subreddit": "stocks",
        "created": 1620343639.0
    },
    {
        "author": "Pikachu87",
        "body": "Hello, its me, time traveller from the future. Today I time travelled to 8 May, 2022. PLTR announces that all their software will now be free-to-use. However, users will need to watch unskippable ads every 30mins, or pay 100$ each time to skip. Their Gotham and Foundry software will also be throttled and can only be sped up via 'speed boost' tokens, costing 200$ for a set for 5 tokens. Additionally, users can buy keys to open loot boxes that contain customizable skins for their software. If they are lucky, they can even win speed boost tokens.\n\nPLTR stock rises 200%.",
        "created_utc": 1620462689,
        "id": "gxdafkq",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1620491489.0
    },
    {
        "author": "EJ3CTO_SEATO_CUZ",
        "body": "Bots are off, dad took away the car keys",
        "created_utc": 1620271033,
        "id": "gx3yhvp",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1620299833.0
    },
    {
        "author": "BSDC",
        "body": "I think that's an emergency stop mechanism/kill switch. You fasten the non-plastic end to your wrist, so if the plastic gets pulled from the machine, it shuts down. Jet skis have these, too. It technically has a \"key\" sort of function, in that it can enable or disable the machine, but I never thought of them as \"keys.\"",
        "created_utc": 1620255057,
        "id": "gx32alk",
        "score": 9,
        "subreddit": "investing",
        "created": 1620283857.0
    },
    {
        "author": "Ragnaroktogon",
        "body": "Y’all is it worth dipping into my meme stock winnings and paying double rent for three months because I’ve began to resent my roommate (and former best friend) immensely\n\nHe has an extensive DVD collection (cool!) and we also have HBO Max. He wants to watch Ocean’s 11. He has it on DVD, so he has decided to watch it with our friend in 480p and dvd quality rather than just hitting two keys on the remote and watching it in full 4K with surround sound\n\nAlso there are other things but this for me crosses the fucking line",
        "created_utc": 1620189475,
        "id": "gwzp4sa",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620218275.0
    },
    {
        "author": "Peshhhh",
        "body": "Just another reason among many that you should **stop day trading** and **start investing**. The only things that disruptors like Robinhood accomplished by eliminating trade commissions was give the little guys the keys to enter the lions' den and get absolutely wrecked.",
        "created_utc": 1620423442,
        "id": "gxbkyfc",
        "score": 8,
        "subreddit": "stocks",
        "created": 1620452242.0
    },
    {
        "author": "lazerdudes",
        "body": "They keep not allowing people to sell when Doge rises. From my understanding it’s because they are heavily invested and don’t want people to sell. It’s not the stock market so remember nobody is really regulating shady stuff. I’m in crypto and remember this “not your keys not your wallet”. If Doge moons more RH will turn it off until it comes back down I bet.",
        "created_utc": 1620163746,
        "id": "gwy90i5",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1620192546.0
    },
    {
        "author": "rjgnal",
        "body": "They just stole some activation keys from bill gates’s 5G microchips and are trying to market it for themselves.",
        "created_utc": 1620032129,
        "id": "gwrf2nz",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620060929.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\n\n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy. \n\n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\n\n3. If you want tax free capital gains, you can buy QBTC, BTCX or BTCC in your TFSA. For QBTC, it is certainly expensive in terms of its historical premiums (5%-20%) and MER (1.95%); however, if you are long/bullish in Bitcoin as an alternative asset class, then perhaps it does not really matter. With that said, you do not truly own Bitcoin with any of those because they are a fund; and therefore, you own shares of the fund and not Bitcoin itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your Bitcoin\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not insured. Big risk, but tax free in a TFSA.\n\n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\n\n5. Unfortunately, with BTCC, QBTC and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (Bitcoin) and simply run the fund with the Bitcoin backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\n\n6. In regards to taxes, if you truly own the asset (Bitcoin), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\n\n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really the Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. Disclaimer: I am super long Bitcoin.\n\nNow, here are some general points of interests to help you understand cold storage wallets:\n\n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\n\n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\n\n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \n\n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\n\n5. What is a blockchain? It is a transparent, public, and append-only ledger. Basically, you can add data to this transparent, open, and public ledger, but you can never edit/delete previously established data within it. This is executed by a mechanism of consensus creation between geographically scattered parties (i.e. computers) that do not need to trust each other. The parties only need to trust the consensus mechanism itself. Blockchain infrastructure relies on some form of challenge such that no single party on the network can consistently and systematically solve this challenge more than everyone else on the network. This randomizes the consensus mechanism of confirming transactions and ensures that no single party can force the blockchain ledger to accept a particular entry onto the ledger that others disagree with. This is a peer-to-peer network that can maintain updates to the ledger and verify those updates in such a way that it is impossible to defraud and impossible to alter an entry after it has been confirmed via consensus.\n\nI sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1620013345,
        "id": "gwqsbe4",
        "score": 6,
        "subreddit": "CanadianInvestor",
        "created": 1620042145.0
    },
    {
        "author": "capn_of_outerspace",
        "body": "If you don’t have your private keys, you don’t own your crypto",
        "created_utc": 1619896755,
        "id": "gwkpq3q",
        "score": 6,
        "subreddit": "stocks",
        "created": 1619925555.0
    },
    {
        "author": "sharkyjackson",
        "body": "Whaaaa surely not someone with “stocks” in their user name? I saw underscore stocks and was ready to DM my wallet keys. You can’t trust anyone these days smh",
        "created_utc": 1620098635,
        "id": "gwv6j7j",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620127435.0
    },
    {
        "author": "Inquisitor1",
        "body": "I remember RKT. Some good info but you could see the hype, get warned about the cramer effect so after the one day profit opportunity it snapped back and people were discussing that before and after. Now it's just a ton of submissions about buy mvis today, next day it loses all price gains, crickets, but hey look at this mushroom company that doesn't have distrubtion expertise or anything noteworthy, buy this one today, and tomorrow crickets.\n\nEven the gme cultist subreddits have stopped with the \"you did a thing, any thing? I'm raising my floor one million brazillion\".\n\nIn February wsb was full of people saying \"we're not talking about silver for fucks sake\". Today? They are the ones pushing silver. Or whatever the next set of sparkly jangly keys are. Shake shake, jangle jangle.",
        "created_utc": 1620302808,
        "id": "gx52zne",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620331608.0
    },
    {
        "author": "rufus2785",
        "body": "No but kids can easily, find the keys to the room, plug it in, or get past a plug lock by finding the key.  Kids are way craftier than people without kids think.  They’re like little geniuses who have no fear or concept of danger.",
        "created_utc": 1620232906,
        "id": "gx1m9h4",
        "score": 4,
        "subreddit": "stocks",
        "created": 1620261706.0
    },
    {
        "author": "getaway18",
        "body": "Most other treadmills are lower to the ground(6 inches) and use a continuous belt for motion. The Peloton tread uses a slat belt which can catch things in between and is 12 inches off the ground. Other treadmills are also lighter(220lbs) and usually have a mechanism to fold upwards so if something gets under it will lift up, the pton tread is 450lbs. Other treadmills also have emergency shut off keys and locks, the tread just has a touchscreen and no emergency shut off.\n\nFor perspective, the pton treadmill caught a 6yr old kid under it and killed them, not like a small dog or infant.",
        "created_utc": 1620256885,
        "id": "gx366tt",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620285685.0
    },
    {
        "author": "the_snook",
        "body": "&gt; Why would international investors put their money on a database controlled by the US government\n\nBecause they trust the US government more than they trust the distributed network to be resilient to 51% and other attacks from adversarial states.\n\nAdditionally, they may have no choice if they want to continue to invest in US government instruments. The US could move all government bond settlements to a blockchain. Why would they do that? It's cheaper. You authorize half a dozen large banks to participate in the quorum and turn down all the government-run infrastructure except the bit that signs the keys of the participants.",
        "created_utc": 1620114397,
        "id": "gwvrxem",
        "score": 3,
        "subreddit": "investing",
        "created": 1620143197.0
    },
    {
        "author": "mouldyrumble",
        "body": "Alright boys, full disclosure: I’m a little saucy. \n\nNoticed a cbr with the keys in it about 200 feet from my apartment... think he’d know if I took it for a spin?",
        "created_utc": 1620444079,
        "id": "gxcn5cl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620472879.0
    },
    {
        "author": "lornafear",
        "body": "Ex-roomie's friend in China worked at Foxconn. They made everyone live in gender-specific barracks. House \"Dad\" was a creep who had master keys regularly had his way with whomever whenever.",
        "created_utc": 1620087320,
        "id": "gwuk0s5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620116120.0
    },
    {
        "author": "Msg_me_ur_boobz",
        "body": "Not your keys, not your crypto.\nNot your registration, not your stock. \n\nSame principle. That's why your post is wrong because you can take hold of shares but not robinhood crypto.",
        "created_utc": 1620107989,
        "id": "gwvklmo",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620136789.0
    },
    {
        "author": "naptik187",
        "body": "&gt;  “not your keys not your wallet”.\n\nthat is very true but it is also hard to sell if your keys aren't in an exchange",
        "created_utc": 1620164045,
        "id": "gwy9pkv",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620192845.0
    },
    {
        "author": "never_noob",
        "body": "\\&gt; How it works (the source) is less what I'm thinking off than stuff like  insider trading limitations, annual reporting requirements, and  financial auditing for brokerages or other services.\n\nMost of this information is visible to literally everyone and some is not relevant at all since it doesn't exist with Crypto, so I'm not sure what you mean.  BTC has instant reporting and auditing, and it's all public: [https://www.blockchain.com/explorer](https://www.blockchain.com/explorer)\n\n\\&gt; The cryptocurrency ecosystem is poorly understood\n\nPoorly understood to people who haven't taken the time to understand it.  Just because many people are ignorant about it doesn't make it inherently opaque.\n\n\\&gt; makes it easy for unscrupulous people to make money if they know what they are doing.\n\nNo one else's scruples impact crypto holdings if you either control your own keys or have a contract with recourse for ownership.  I'm really not sure what you mean here.",
        "created_utc": 1620213108,
        "id": "gx0hieb",
        "score": 2,
        "subreddit": "investing",
        "created": 1620241908.0
    },
    {
        "author": "dorflinuse",
        "body": "You have to distinguish between exchanges and wallets. Some exchanges actually provide you with the coins, other just provide you with exposure to it and give you some kind of object tied to the price action but never the actual transferable coin.\n\nFor exchanges that allow you to buy the coins, just look at [https://coinmarketcap.com/currencies/bitcoin/markets/](https://coinmarketcap.com/currencies/bitcoin/markets/) \n\nEtoro, Robinhood and a few others just allow you some exposure.\n\nFurthermore, exchanges give you acces to the coins, but they are never yours, they still can exert influence on them such as freezing the account and you will not be able to transfer or trade. The second part is much more relevant. These exchanges can be hacked and your coins can be transferred without your consent. In crypto we say, not your keys, not your coins. \n\nWallets are a bit tougher to explain, it's your personal bank account which is accessible through software.  I'll try to explain it buy using Cardano. \n\nA Cardano wallet is accessible through Yoroi and Daedalus and those two allow you to make transactions on the network (sending / staking). So your adress is where it is stored, but the software allows you to mutate the contents. \n\nNow.. if you are still reading :)\n\nWhichever is good for you depends on what you want. First you have to realise the fees.. \n\nEach exchange has fees, trading fees and transfer fees as well as minimum transfer amounts, this scheme varies. Depending on which coins you are interested in, you will find a subset of exchanges with their own set of values for this. \n\nSecond, some coins allow for staking (you can roughly translate this as a short term fixed deposit which gives you a return on investment). This can be done on some exchanges (Bittrex, Binance, Coinbase, Kraken), but again, they facilitate, they take. There are some cases where it is preferable though, i.e. when you don't have the minimum required amount to stake.\n\nWell that's all for now :) If you want more info, send a DM or visit us at the cryptocurrency sub.",
        "created_utc": 1620227406,
        "id": "gx18snr",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1620256206.0
    },
    {
        "author": "Squamsk",
        "body": "I think it will take a bite out of the florida keys. ::***puts up a crumpled $5 bill***::",
        "created_utc": 1620451859,
        "id": "gxcyhpz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620480659.0
    },
    {
        "author": "Snoo21282",
        "body": "🎵🎵🔥🔥 my portfolio is on fire 🔥🔥🎵🎵\n\n\nSung to Alicia Keys \"This Girl is on Fire\"",
        "created_utc": 1620326222,
        "id": "gx6j776",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620355022.0
    },
    {
        "author": "pwh012",
        "body": "There is an actual key that has to be attached for the thing to turn on...if you leave your keys in the ignition and your kid takes your car for a joy ride, we don't recall the car - seems like maybe parents should just not let their kids play with heavy machinery?",
        "created_utc": 1620230170,
        "id": "gx1fjrx",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620258970.0
    },
    {
        "author": "kuraitengai",
        "body": "Same. I went back and \"replayed\" all my losses or my panic sells. That's what got me to trust the process.\n\nI opened a  3915/3940/4065/4090 Iron Condor the Thursday before Easter. Thought the long weekend would help me with theta. Didn't pay attention to the jobs report coming out that Friday. Monday comes and SPX spikes. Rolled up my puts to 4025/4050 for more premium and to try to mitigate losses. Should have bailed earlier in the day at a $2k loss, but waited it out, ended up taking a $3.8k loss. Made it all back through the week and ended up +$300 by that Friday. But that is the only time I would have lost. But only because I didn't pay attention to upcoming market events.\n\nOpened a 0DTE 4100/4120 on 4/14. Was still stinging from the $4k loss a week before. Watched it dropping. Literally spend 2 hours in a gaming setup with fingers on the up/down keys and hand on the mouse adjusting my limits. Rode it from a $4k loss to $60 gain to $2k loss, roller coaster. Closed at a $159 loss with 45 seconds left in the trading day. Closed at 4124, so I would have been fine. But had $20k collateral riding on it and couldn't risk that for a $550 premium.\n\nThen monday, opened a 0DTE  4165/4175 spread. Panicked and sold at a $700 loss. Recovered right after I sold and closed at 4191. So would have been fine. That's what changed my thinking to letting it play out and trusting the deltas.\n\nsince 3/22, I've run 31 credit spreads and 16 iron condors. only had the 3 total losses above and 2 of them would have been gains if i had trusted the process. Even with the losses, I'm still up $8,800 in a month and a half.",
        "created_utc": 1620319529,
        "id": "gx62yep",
        "score": 2,
        "subreddit": "options",
        "created": 1620348329.0
    },
    {
        "author": "IIIBryGuyIII",
        "body": "That’s where your confused. You don’t “own” anything in regards to crypto until the crypto is backed behind your private keys.\n\nRobinhood and PayPal don’t even EVER give YOU actual access to the actual crypto.  Coinbase doesn’t relinquish this access until you send it your personal wallet that is backed up by your personal seed phrase.\n\nEdit: I might fall asleep. If your actually interested in learning the intricacy of it from me....and my knowledge is probably minimal in all reality... keep responding and I’ll happily reply at some point.",
        "created_utc": 1619918840,
        "id": "gwlzvg3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619947640.0
    },
    {
        "author": "djb25",
        "body": "Now I can tell myself that my unimaginative name is cool because it’s 5 characters. \n\nIs a lonely swinger a swinger who never gets picked? I thought the fishbowl of keys was designed to prevent that from happening?",
        "created_utc": 1620063330,
        "id": "gwt22q5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620092130.0
    },
    {
        "author": "gatvoedioos",
        "body": "Translation :  \n\n\nWife: OMG I am sorry for the delay\n\nWife's Boyfriend : ok, Can we go now ?  \nHusband :  Oh , you guys are going already ?  \nWife : Oh yes,  sorry babe meet Berrington, the guy I am going on a date with, Berrington meet my boyfriend.  \nHusband : Oh let me find something for you guys(not clear), see just have everything...  \nHusband : you guys are trekking ?  \nWife's Boyfriend : no actually we are using uber\n\nHusband : take my car keys",
        "created_utc": 1620112051,
        "id": "gwvpddm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620140851.0
    },
    {
        "author": "CaptainCaveSam",
        "body": "Just take the tax hit, you’re still gonna have profit. If you’re not shorter term trading keep your keys in an offline wallet. \n\nA wallet only you own. An account there’s a 3rd party, in RH’s case they’ll block selling and not let you send your keys to a wallet. \n\nFuck their promises, other exchanges will treat you better by CEX standards. Or use a DEX like bisq so you don’t have to use your personal information",
        "created_utc": 1620114251,
        "id": "gwvrrta",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1620143051.0
    },
    {
        "author": "ihavetotinkle",
        "body": "That is corrext. Idk the facts, kinda learned about this \"not my keys, not my crypto\" recently. But robinhood isnt a crypto wallet, so you dont own the crypto. So, sell all the crypto you wish to sell, recognize your profits in USD and transfer that to your bank, and start over on a new crypto wallet.",
        "created_utc": 1620150362,
        "id": "gwxlg4i",
        "score": 1,
        "subreddit": "investing",
        "created": 1620179162.0
    },
    {
        "author": "xQuizate87",
        "body": "that's why you turn the car off and take the keys with you whenever you leave the car.",
        "created_utc": 1620057786,
        "id": "gwsoy3l",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620086586.0
    },
    {
        "author": "scotty6chips",
        "body": "The keys to unencrypted iMessage are stored privately on the device, in a separate closed chipset. Apple doesn’t have access to the key at all.",
        "created_utc": 1620521485,
        "id": "gxg3t05",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620550285.0
    },
    {
        "author": "Razakel",
        "body": "And you were free to sell your Dogecoin to anyone you wanted to... except you never actually owned it so you couldn't.\n\nIf you don't have the private keys, it's not yours. End of. Caveat emptor.",
        "created_utc": 1620595317,
        "id": "gxjf836",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1620624117.0
    },
    {
        "author": "drewbltz",
        "body": "Robbing hood gives you ious for crypto, not actual crypto. You can’t withdraw it from Robin Hood, you don’t own the keys to it like you do with other exchanges, and so you just have to sell your ious when the time comes.",
        "created_utc": 1620285146,
        "id": "gx4iaa9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620313946.0
    },
    {
        "author": "itsirregardless",
        "body": "Yep. Even on WS. But funny you mention it, cause I actually just sold my BTCC.B. I loved having some exposure to crypto in my TFSA but I think I decided to amass a larger holding in crypto directly and avoid the tax problem by never selling. I may put another ETF in there at some point though.\n\nJust ordered a hardware wallet but if anyone doesn't want to bother with cold storage and managing keys, these ETFs in a TFSA would be a great option.",
        "created_utc": 1620244988,
        "id": "gx2f4y8",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1620273788.0
    },
    {
        "author": "justaRndy",
        "body": "Oh wait another thing. Are they going to convince Sony, Valve, Microsoft etc. to let people sell their digitally owned games / keys back via some Gamestop service, thus removing them from their accounts? Is Gamestop going to open up their own client for digital games and have a full community integration there, expecting people to shift there, leaving everything previously bought behind? \nWill this be integrated to the new consoles, do you think Sony and Microsoft will team up with Gamestop on that?\nBecause there is no buying digital games without an account that is linked to these games. Downloading / streaming games is clearly taking over.",
        "created_utc": 1619910742,
        "id": "gwll6gl",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1619939542.0
    },
    {
        "author": "haight6716",
        "body": "If I had a reason to, I would. Lmk when I can buy car insurance or tickets or whatever. I'm not interested in gambling on the price of nfts and I don't want to expose my keys to a 3rd party.\n\nMaybe one day we can really kill ticketmaster. That would be cool.",
        "created_utc": 1620005139,
        "id": "gwqe1xz",
        "score": 1,
        "subreddit": "investing",
        "created": 1620033939.0
    },
    {
        "author": "TheFrugalMonk",
        "body": "Just buy more blow... hide the handcuff keys",
        "created_utc": 1620504657,
        "id": "gxf7mw8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620533457.0
    },
    {
        "author": "52F1",
        "body": "Yes it was, and in a very generic response I can tell you the CEO has made public statements to the effect of the bad finacials decisons made early on in the company. However I think some futher more detailed clatification is in order.\nAnd lieu of me piecing together the info I have been i touch with Steve Rheinarz the CEO and made a request for these details so you can hear it accurately and right from the source.\nToday they are at a gathering, a grand opening of sorts for the new factory, which is actually more ceremonial passing of the keys to the company and a site tour. So more than likely I wont hear back from him today, but he has usually gotten back to me in a day or two with the few email exchanges we have had.\nWhen I get those details I will post the info to help everyone better understand the companies history.",
        "created_utc": 1619877664,
        "id": "gwjhfq8",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1619906464.0
    },
    {
        "author": "artgarfunkadelic",
        "body": "You bought tlry at 27$?!?! \n\nYep. You retarded. Give him the keys, boys.",
        "created_utc": 1620093562,
        "id": "gwuwvl8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620122362.0
    },
    {
        "author": "toogaloog",
        "body": "You might want to start with finding your car keys 👀👀",
        "created_utc": 1620054810,
        "id": "gwsht27",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1620083610.0
    },
    {
        "author": "Wheeler_Dealer1",
        "body": "look up MtGOX that's where \"Not your keys, not your Crypto” bullcrap started. hell people in turkey just lost all there money because the exchange(*Thodex*) they used CEO stole the crypto that was left on the exchange and disappeared.",
        "created_utc": 1620111185,
        "id": "gwvodwn",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1620139985.0
    },
    {
        "author": "getrichtb",
        "body": "Vista is smashing it.  Last March this thing was a dead horse at 6 bucks then all hell broke loose .\n\n...multiple factors contributed to the greatest run on ammo as long as I have been in the industry ..8 years now. ..national emergency with Covid, Civil Unrest, Police Brutality..looting in Santa Monica, CA of all places, Massive influx of new buyers..the list goes on. \n\nObama was no match for this.  \n\nIt started March 12th 2020 and has been outrageous sales EVERY SINGLE day 417 days in a row!!!!!. Can't keep anyting in stock. Vista has a massive market share(Federal, Blazer, CCI, Speer, American Eagle and now Remington) This is THE ammo stock. They also hold the keys to primer manufacturing which is the reason we are in this mess. The primer shortage caused a backlog and then 10 million new gun buyers wanted to feed their new toys. \n\nSuper Demand City and no Supply easy math. As far as timing..this thing still has some juice left in it I believe and that's because they've had some price increases and recently stated they are behind a billion dollars in orders.\n\nPrice Targets range from 35-49. A consensus buy across the board on most outlets.  I believe all time high was 52 and change..it has a serious shot at beating that.  I have personally spent a year watching and running with this stock.  Seriously hours daily researching this for over a year.\n\nThe negative is there is low volume to move this thing. It's insane. It has taken a big jump, but over 14 months.\n\nThe earnings probably hit 575 million in this report and might break earnings record. It was at 38 not too long ago.  I've owned this since last March at an average of 7.80. I have taken profits twice so far. I now have stock and 35 dollar calls to hit May 21st which are green and also some 40 dollar hail mary calls as well. Those could be dreamers, but I work in this field and it never ends. Phones ringing off the hook..lines all day long.  I can't and won't give you advice on what to do with your hard earned money, but I do believe this company has a serious positive short term outlook.\n\nBest of luck Champ",
        "created_utc": 1620109971,
        "id": "gwvmzl9",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620138771.0
    },
    {
        "author": "BhinoTL",
        "body": "Financial education gots the keys my man he's only been wrong once in the years I've been subscribed to him",
        "created_utc": 1620442679,
        "id": "gxcksmv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620471479.0
    },
    {
        "author": "Pe1per",
        "body": "&gt;60% of the hashrate is in China, so China can just take over BTC or turn it off, if it wants.\n\nNot true anymore, hashrate in china recently got below 50% because the US and other places are starting to step up their game. This will only continue as more and more serious institutions start to get it and don't want china to control them. \n\n&gt;The ecological impact of running computers to support BTC is insane and currently unsustainable.\n\nEnergy consumption of Bitcoin is lower then our current monetary system (banks, visa etc) in relative terms. There's also a clear trend to sustainable energy usage since mining is location independent and is a way to profit off of otherwise unusable land and wasted energy (deserts/surplus of the power grid etc.)\n\n&gt;Nobody knows the exact origin of BTC, so nobody really knows if there is a back door to hack\n\nKnowing who Satoshi is is irrelevant in terms of hacking. The entire code of the protocol is public since it started. Bitcoin is an open source project and anyone can look at the code if they want to. There are no backdoors and there's no way to build one unless you want the whole world to see it. \n\n&gt;there are a number of early early adopters that hold a huge amount and can tank the market anytime they decide to sell their billions of dollars worth of BTC\n\nOnly point that's fair imo. Although there's something to be said that the market can tank it by now and it won't be the end of Bitcoin. Also I doubt these individuals would voluntarily trigger a market crash by selling billions at once. They obviously believe in Bitcoin's future or lost their keys otherwise they wouldn't have stayed committed to their holdings for this long. \n\n&gt;I think blockchain is a tech that is here to stay, but current versions are basically beta tests.\n\nSmart contract platforms and everything build on them are still in beta/early adopter territory but Bitcoin isn't. Banks and the biggest financial institutions don't adopt technologies that are in \"beta\" Bitcoin is a trillion dollar asset and on it's way to cross the chasm to the early majority.",
        "created_utc": 1620229771,
        "id": "gx1ek7u",
        "score": 1,
        "subreddit": "investing",
        "created": 1620258571.0
    },
    {
        "author": "JonathanL73",
        "body": "At this point Robinhood users are like that one person who keeps getting back into the same abusive relationship expecting things to be different.\n\nGuys just switch brokers, you have options. The biggest punishment RH can face is loosing customers due to screwing customers. If you stay with RH, you are giving them the greenlight to keep getting away with that. Stop supporting bad brokers, just get the ACATS transfer done.\n\nEdit: You guys should never have bought crypto on RH on the first place, use an exchange that gives you access to your wallet keys like Coinbase, Binance, BlockFi, Kraken, etc.",
        "created_utc": 1619947164,
        "id": "gwn1ugp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1619975964.0
    },
    {
        "author": "TreeHugChamp",
        "body": "When she comes out:        \nHer: sorry I’m so late.      \nBf: where do you think you guys are going.        \nGf: oh yeah sorry babes, something about sweets, why don’t you meet my boyfriend.    \nBf: here just have everything.     \nBf#2: ty.       \nBf: you guys are trekking?      \nBf#2: no actually we are using a car.       \nBf: take my car keys now.       \nEnd scene",
        "created_utc": 1620113712,
        "id": "gwvr6n9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620142512.0
    },
    {
        "author": "introvertedhedgehog",
        "body": "Well firstly his ideas hardly addresses the points I illustrated. Interesting but full of conjecture and vague suppositions, typical for that kind of pitch \"people disagree with me but this is because they are stupid and are part of the machine\"\n\n If VCs where prone to believe every similar line of reason they read like Dan's they would invest after every one of thousands of hockey stick presentations they see. Here is one such gem based on emotional appeal to the outsider:\n\n\"The idea that Satoshi perfectly crafted Bitcoin on the first try is unfathomable for them to consider.\" \n\nTo which the first commentor correctly replies \"Because it's unfathomable that this is true\" and there you have the summary of the two sides of the argument.\n\nEven a brief browse through the Wikipedia entry for Bitcoin will tell you as much based on its history.\n\nThere are so many other problems with BtC but let's just choose one and let's also apply another line if reasoning: how secure is it in a physical sense? People are keeping their keys on physical media in safety deposit boxes at multiple banks because they are rightly concerned people can and would kill them for their Bitcoin or otherwise steal it. Many people who used services for their wallet have been burnt hard. We have laws about the fiet money proceeds of such crimes but people who own BTC do well to be concerned. Whose jurisdiction does solving a theft of Bitcoin actually fall under? Where exactly is Satoshi if he is even a real person? If he is not dead it's pretty dangerous to be him.\n\nThe truth is that BTC is flawed and will be changed/replaced as people solve problems with it. As such it will become obsolete or be updated and when that happens it will be vulnerable and Dans reasoning is flawed on this basis.\n\nI have no doubt there is utility for crypto. I just think investing in any particular technology as an investment asset will be demonstrated to be a huge mistake in 15 years when when we look back on the crypto bubble of 20xx. Many of the Dotcom companies had value there was still a bubble. Except now with crypto we have perfected this bubble. For Dotcom and firms pretended to have value and products or services. \n\nBottom line: Dan is invested",
        "created_utc": 1620144188,
        "id": "gwx67sy",
        "score": 1,
        "subreddit": "investing",
        "created": 1620172988.0
    },
    {
        "author": "outandaboutbc",
        "body": "Yes, I am aware of that. It happened in a scenario where it meant either do that or the death of ETH.   \n\n\nI know... I know... \"it happened once, what's to say it won't happen again ?\". \n\nI doubt they'll start reversing it because people's keys got hacked or they got scammed. You can only do so many reversals before people leave. That's bad publicity.",
        "created_utc": 1620183633,
        "id": "gwzeyc9",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1620212433.0
    },
    {
        "author": "Powerful_Reward_8567",
        "body": "You can’t have fake Bitcoin or borrow Bitcoin like shares. It’s all on the blockchain and you can take custody of your keys. People will prefer crypto over stock market with its huge gains in short term.",
        "created_utc": 1620079826,
        "id": "gwu48pv",
        "score": 0,
        "subreddit": "investing",
        "created": 1620108626.0
    },
    {
        "author": "OKImHere",
        "body": "No thanks. Humility ain't my style. You start telling people you got lucky, they start thinking they need to get lucky to be successful. You don't. Anyone can do it. No luck required. \n\nDon't sell yourself short. You say you got lucky breaks, but you also say it can disappear in a heartbeat. So you must understand how quickly you could throw it all away if you made bad choices. Not making those choices is one of the keys to your success. That's not luck. That's you doing that intentionally.",
        "created_utc": 1620176709,
        "id": "gwz0uvo",
        "score": 0,
        "subreddit": "stocks",
        "created": 1620205509.0
    },
    {
        "author": "rica217",
        "body": "Did they show parents how to use the safety keys in this video also or nah?",
        "created_utc": 1620246679,
        "id": "gx2j708",
        "score": 0,
        "subreddit": "stocks",
        "created": 1620275479.0
    },
    {
        "author": "oxxoMind",
        "body": "Don't listen to this “Not your keys, not your Crypto” bullcrap.\n\nIf you forgot your wallet's password or your device accidentally destroyed or malfunction, then your cryptos are gone with it. Its almost impossible to recover it.   \nIf Robinhood gets bankrupt, chances are you can still take back some of your crypto when they got liquidated.\n\nSo its up to your where you want to bet the odds. Put your crypto wherever you feel safe.",
        "created_utc": 1620109458,
        "id": "gwvme7v",
        "score": 0,
        "subreddit": "StockMarket",
        "created": 1620138258.0
    },
    {
        "author": "CalligrapherOneTwo3",
        "body": "Yes, as a Canadian, there are multiple exchanges available to us such as Newton, ShakePay, NDAX, WealthSimple Crypto, and some Bitcoin/Ethereum ETFs. Here are a few points which may or may not be helpful to you from my perspective regarding buying this alternative asset class, cold storage, taxation, and the cheapest method of accumulating/procuring it in Canada:\n\n1. Personally, I only buy on the Newton app since they currently have the lowest purchasing fees out of all of the available exchanges in Canada. Newton's average spread varies from 0.50% to 0.60% which is 2-3 times cheaper than most of the other available exchanges that are available to us as Canadians. I also use the ShakePay app to earn free Bitcoin on a daily basis by physically shaking my phone once a day. Trust me, I know that sounds ridiculous, stupid, and suspicious, but ShakePay is a legitimate company based out of Montréal which is regulated by both FINTRAC and AMF while it is also legally licensed as a Money Service Business. I never actually buy from ShakePay because of their high purchasing spreads (which is approximately 1.75%) and I simply use them for the free daily accumulation of Bitcoin. Anyone who uses ShakePay can attest to this and easily confirm their legitimacy. \n\n2. Since I actually want to own the underlying asset, I withdraw my Bitcoin from both of those exchanges and I put my assets into a cold storage wallet. In Canada, this is currently the cheapest method of accumulating Bitcoin and truly owning the assets by storing them \"offline\" in a cold storage wallet. However, in order to unlock the ShakingSats feature in ShakePay to earn free Bitcoin, you will need to be referred as per their current terms and conditions. I can assist you with that in addition to answering any general questions that you may have regarding buying, selling, converting, and taxation-related issues if you want to message me directly as I am always willing to help educate others in this space with whatever knowledge and/or experience that I have gained over the years.\n\n3. If you want tax free capital gains, you can buy BTCX, ETHX or BTCC in your TFSA. With that said, you do not truly own crypto with any of those because they are a fund; and therefore, you own shares of the fund and not the asset itself. As the saying goes and as you may have heard if you have done your due diligence: \"not your keys, not your crypto\". As such, you run and operate with all of the associated risks of leaving your coins on an exchange which is why I choose to own the real thing and use a cold storage wallet. The products mentioned above are not insured. Big risk, but tax free/deferred in a TFSA/RRSP.\n\n4. You may have heard of a Canadian company named Quadriga. In short, many investors did not truly own their Bitcoin with them since Quadriga sold \"entitlements to receive crypto assets or fiat currency from Quadriga\" while Quadriga held the \"keys\" to the real Bitcoin and investors lost around 135 million dollars CAD, but up to 250 million dollars CAD according to Wikipedia. This is verifiable information, a famous story, and a perfect example of \"not your keys, not your Bitcoin\" as well as a lack of insurance of clients. Also, as of April, 22, 2021, Thodex, an exchange with 400,000 users went offline while Interpol issued a red notice for its CEO who mysteriously disappeared. According to Fortune,  an international manhunt is currently underway to locate the CEO and secure $2 billion in digital tokens he allegedly embezzled from Thodex.\n\n5. Unfortunately, with BTCC, ETHX, and WealthSimple Crypto, you cannot take your Bitcoin off of their exchanges because, again, you do not truly own Bitcoin with them. Rather, you own shares of the fund whereas those organizations truly own the asset since they have the \"keys\". They are the ones who own the real asset (crypto) and simply run the fund with the crypto backing that fund as they make money through their ridiculously overpriced premiums and spread/fees (WealthSimple's spread is around 1.5-2.0% if not higher and BTCC's MER is about 1%).\n\n6. In regards to taxes, if you truly own the asset (crypto), it is subject to capital appreciation tax whenever you trigger a taxable event such as selling it, buying things with it, and/or converting crypto-to-crypto. As such, you need to be prudent in your bookkeeping behavior and calculate your \"adjusted cost base\" for each transaction. There is no legal requirement forcing you to calculate your \"adjusted cost base\" for each transaction, but it just saves you a lot of headaches later on when you need to pay taxes. This is no different than investing in traditional equities in a taxable account after you have maxed out your TFSA, RRSP, RESP, etc.\n\n7. Before you invest in anything regardless of the asset class, make sure you understand what you are putting your money towards, understand your risk tolerance, understand the proper asset allocation percentages for your risk tolerance, and formulate a clear plan of what you want to achieve. For me, the biggest investment is not really Bitcoin itself, but rather, it is in the underlying technology and innovation of the blockchain infrastructure which serves as a massive global public ledger leading to the decentralization of this digital currency as well as its invincibility and independence from overbearing governing bodies whereby the Bitcoin unit itself simply has a monetary value relative to fiat currency. Disclaimer: I am irresponsibly long Bitcoin/Ethereum.\n\nNow, here are some general points of interests to help you understand cold storage wallets:\n\n1. There is a big misconception that if you decide to operate as your own bank (i.e.truly own your Bitcoin) and use a cold storage wallet device (i.e. physical hardware connected via USB to your PC), that your assets (Bitcoin) will be transferred and stored onto that physical USB device. This is the part that confuses a lot of people. In short, Bitcoin is not stored on that device, it will never be stored there, and this is because Bitcoin can never leave its \"blockchain\".\n\n2. So, what does your cold storage device do? The device allows you to have a \"key\" to your asset (Bitcoin) on the blockchain. How is this \"key\" established? Without going too deep into the technical aspects, when you initially setup the hardware wallet device, you will be given a 24-word \"seed phrase\" and it is literally 24 words. From a computer science perspective, this 24-word \"seed phrase\" actually represents and is transcribed into a huge series/string of alphanumeric characters. This 24-word \"seed phrase\" is essentially your \"keys\" to your assets on the blockchain.\n\n3. Your 24-word \"seed phrase\" is what is most important if you decide to act as your own bank and truly own Bitcoin since this is what gives you access to it. It does not matter if you lose your physical device and it does not matter if your physical device was destroyed. Why? Again, your assets are on the blockchain and not on the physical device. So, if you lose your physical device, you can simply replace it with another one (and this can be one from a different manufacturer too), set it up with your original 24-word \"seed phrase\" and you will once again have access to your assets since they are on the blockchain. In essence, never lose your \"keys\" because then you will have truly lost your Bitcoin. \n\n4. As you can probably see now, your 24-word \"seed phrase\" is extremely important (and more important than the physical hardware device itself). Therefore, when you first take note of your 24-word \"seed phrase\" during the initial setup of your physical hardware device, make sure that no one is watching, there are no cameras around you (including your mobile phone), etc. Only you should know your \"keys\". Never type it out on any digital device, never e-mail it to yourself, never take a photo of it, never upload it to a cloud database such as Google Docs and never try to encrypt it and put it on a regular USB drive. You want this 24-word seed phrase as private as possible. So, if anyone/anything asks you for your \"keys\", never give it out. Period.\n\n5. What is a blockchain? It is a transparent, public, and append-only ledger. Basically, you can add data to this transparent, open, and public ledger, but you can never edit/delete previously established data within it. This is executed by a mechanism of consensus creation between geographically scattered parties (i.e. computers) that do not need to trust each other. The parties only need to trust the consensus mechanism itself. Blockchain infrastructure relies on some form of challenge such that no single party on the network can consistently and systematically solve this challenge more than everyone else on the network. This randomizes the consensus mechanism of confirming transactions and ensures that no single party can force the blockchain ledger to accept a particular entry onto the ledger that others disagree with. This is a peer-to-peer network that can maintain updates to the ledger and verify those updates in such a way that it is impossible to defraud and impossible to alter an entry after it has been confirmed via consensus.\n\nI sincerely hope that this has been helpful to you and good luck!",
        "created_utc": 1620574084,
        "id": "gxi7nro",
        "score": -1,
        "subreddit": "CanadianInvestor",
        "created": 1620602884.0
    },
    {
        "author": "TheNorseHorseForce",
        "body": "I mean,  who owns the private keys and encryption method for your imessages. Apple.  \n\nThey can absolutely read them,  if necessary.  However,  I bet it's primarily for FISA warrants,  which are daily.",
        "created_utc": 1620482614,
        "id": "gxdzkaz",
        "score": -2,
        "subreddit": "stocks",
        "created": 1620511414.0
    },
    {
        "author": "bungholio99",
        "body": "Not a financial advisor but i like Lenovo and UBS does to.\nGrown to biggest P.C manufacturer, while being cheap compared to (&gt; 10 HKD) DELL and HP, even wins marketshare during Chip Crisis.\n\nMany mergers (IBM,Fujitsu,Motorola) great JV Netapp, Absolute Software, Instore\n\nInvestor and supplier of NIO.\n\nPays dividend",
        "created_utc": 1619975375,
        "id": "gwompkh",
        "score": 8,
        "subreddit": "ValueInvesting",
        "created": 1620004175.0
    },
    {
        "author": "zxc123zxc123",
        "body": "*\"Weren't we silly for thinking those auto companies had a shot? They were the Nokia, Blackberry, and Motorola. Turns out Tesla wasn't Yahoo, but Apple plus crypto and actually going to mars. On the plus side, now GM/Toyota/BMW are now meme stocks that do specialized mechanical engineering infrastructure rather than cars.\"*",
        "created_utc": 1620081403,
        "id": "gwu7jxn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620110203.0
    },
    {
        "author": "Pnotebluechip",
        "body": "Back in 1991 I bought a Motorola bag phone, then became a bag holder of the stock. It took 20 years for everyone to \"need\" a cell phone. Change takes way longer than you think.",
        "created_utc": 1619958360,
        "id": "gwnjyqz",
        "score": 1,
        "subreddit": "investing",
        "created": 1619987160.0
    },
    {
        "author": "Tp_for_my_cornholio",
        "body": "You might be right that it’s hype, but the same things were said about Apple/Steve jobs. Amazon didn’t make a profit for 10 years...now they print money. You might be right about tsla and it is definitely richly valued, but as the future moves to a greener future, I expect the tides to turn pretty quickly. I expect tsla to get a bigger piece of that pie than most. You might want to buy a Ford Mach E over a Tesla and that’s fine. There will be a lot of others that think the same way. It reminds me of when LG and Motorola had their “iPhone killer”phones 15 years ago and I had to hear about people telling me how Apple was doomed. Same for amazon being a joke of a company bc they couldn’t make a profit for a decade.",
        "created_utc": 1620003560,
        "id": "gwqb7fl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620032360.0
    },
    {
        "author": "JohnnyBoyJr",
        "body": "I think most Americans assume that a Motorola is going to be an American phone, and also because it has software made by Google. Nope.  \nI just don't understand why the American gov't is so vehemently opposed to Huawei, but ZTE and Lenovo are perfectly OK, especially considering that ZTE is partially owned by the CCP.",
        "created_utc": 1619891730,
        "id": "gwke6tq",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1619920530.0
    },
    {
        "author": "ninkorn",
        "body": "motorola, nokia, sony erricsson",
        "created_utc": 1620015605,
        "id": "gwqvpmy",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1620044405.0
    },
    {
        "author": "Pnotebluechip",
        "body": "Back in 1991 I bought a Motorola bag phone, then became a bag holder of the stock. It took 20 years for everyone to \"need\" a cell phone. Change takes way longer than you think.",
        "created_utc": 1619958360,
        "id": "gwnjyqz",
        "score": 1,
        "subreddit": "investing",
        "created": 1619987160.0
    },
    {
        "author": "JohnnyBoyJr",
        "body": "I think most Americans assume that a Motorola is going to be an American phone, and also because it has software made by Google. Nope.  \nI just don't understand why the American gov't is so vehemently opposed to Huawei, but ZTE and Lenovo are perfectly OK, especially considering that ZTE is partially owned by the CCP.",
        "created_utc": 1619891730,
        "id": "gwke6tq",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1619920530.0
    }
]