[
    {
        "author": "Fleureverr",
        "body": "Fidelity will. You're doing something wrong.",
        "created_utc": 1633093417,
        "id": "heyybi6",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1633122217.0
    },
    {
        "author": "Weyland-U",
        "body": "Fidelity",
        "created_utc": 1633128920,
        "id": "hf14xov",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1633157720.0
    },
    {
        "author": "9mac",
        "body": "My Mydecine shares are all fuckey on Fidelity right now.",
        "created_utc": 1633098170,
        "id": "hez88ls",
        "score": 7,
        "subreddit": "shroomstocks",
        "created": 1633126970.0
    },
    {
        "author": "shaneizzard",
        "body": "I’ve generally had a great experience using Fidelity, and their lack of fees is hard to beat from a major US broker, but these are my two complaints. Their app is such trash that I just use the website, even on my phone. And they’re among the last brokers to process ticker changes on SPACs. At least the latter issue is fairly niche.",
        "created_utc": 1633106150,
        "id": "hezqlxf",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1633134950.0
    },
    {
        "author": "all-rightx3",
        "body": "Closing my fidelity account and going all in on Touchdown Tommy against the Patriots on Sunday #fuckit",
        "created_utc": 1633099850,
        "id": "hezbz6d",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1633128650.0
    },
    {
        "author": "kevdawgie7",
        "body": "Fidelity won’t let me get to it. But, it does look intriguing.",
        "created_utc": 1633092022,
        "id": "heyvps5",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633120822.0
    },
    {
        "author": "BobsBurgersJoint",
        "body": "I really wish that fidelity didn't have the $50 foreign transaction fee",
        "created_utc": 1633129425,
        "id": "hf15z29",
        "score": 4,
        "subreddit": "pennystocks",
        "created": 1633158225.0
    },
    {
        "author": "SirGlass",
        "body": "The target date fund is a nice set it and forget it I would check the expense ratio and also what its current allocation is, sometimes target date funds are too conservative for some people (hold more bonds than they want to) however they are still usually pretty good options\n\nThe other thing would be just to construct your own so you can allocate how you want to. I like the classic 3 fund portfolio  however because they do not have a total USA market fund you would have to do something like (NOte these are just sample allocations you can allocate how you want)\n\nFidelity 500 Index Fund 45%\n\nFidelity Mid Cap Index Fund 10%\n\nFidelity Small Cap Index Fund 5%\n\nFidelity Total International Index Fund 20%\n\nFidelity US Bond Index Fund 20%\n\nNote some people skip bonds before they are close to retirement or only like to hold 10-15% bonds",
        "created_utc": 1633099586,
        "id": "hezbdi3",
        "score": 3,
        "subreddit": "investing",
        "created": 1633128386.0
    },
    {
        "author": "9mac",
        "body": "Yeah my shares are currently locked and showing as MYCO:CA on Fidelity.",
        "created_utc": 1633101402,
        "id": "hezfjon",
        "score": 3,
        "subreddit": "shroomstocks",
        "created": 1633130202.0
    },
    {
        "author": "Dr_Clout",
        "body": "I never said I wanted it free dude.Are you in a bad mood today or something? 100% there was a major technical glitch which is the 2nd time it’s happened. It calculates my fucking portfolio +$2000 up when I purchased puts and the stock went up. I 100% understand that brokerages have commissions in general but even if I switched to TD Ameritrade or Fidelity or Webull… they don’t have commissions more than Robinhood from what I understand. We’re merely talking just to talk here. Good day.",
        "created_utc": 1633097883,
        "id": "hez7la8",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633126683.0
    },
    {
        "author": "tamufc2018",
        "body": "Dont have to sell! Just call vanguard and initiate a drs share registration and they will take care of rest, fidelity took about 2 days for mine",
        "created_utc": 1633090749,
        "id": "heytgl4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633119549.0
    },
    {
        "author": "Djstevieo",
        "body": "Anyone else having problems with fidelity right now?",
        "created_utc": 1633096033,
        "id": "hez3l9c",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633124833.0
    },
    {
        "author": "hydrocyanide",
        "body": "&gt;Based on my amateur research, it seems that for long term gains I should be investing in international, not US, because the US economy isn't looking too great in the long term. Someone on this subreddit suggested VXUS, but Fidelity shows that fund as \"weak\" across the short/mid/long term.\n\nVXUS is weak because US equity has dominated international equity for a long time, which is also directly at odds with the idea that the US economy \"isn't looking too great.\" I don't know how you arrived at that conclusion, but I would seriously reconsider if I were you.",
        "created_utc": 1633111889,
        "id": "hf03x03",
        "score": 2,
        "subreddit": "investing",
        "created": 1633140689.0
    },
    {
        "author": "almilian",
        "body": "You need to sell before 3pm unless you have the money to exercise, Fidelity does the same.",
        "created_utc": 1633115406,
        "id": "hf0bznv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633144206.0
    },
    {
        "author": "Mryop42",
        "body": "Don't forgot that Fidelity has index funds with zero expenses. ( FNILX, FZIPX, etc.)",
        "created_utc": 1633121556,
        "id": "hf0pknu",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633150356.0
    },
    {
        "author": "ClamPaste",
        "body": "0dte Disney 177.5c looking ripe for the picking. \n\nToo bad fidelity restricts 0dte or I would have picked it up for .08\n\nEdit: strike price. I fucked up typing. Fidelity is right to restrict my dumb ass.",
        "created_utc": 1633102376,
        "id": "hezhscz",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633131176.0
    },
    {
        "author": "evilvyse",
        "body": "I picked up some bags yesterday thinking it is the dip, hopefully it bounces. 🙏 I think it had ticker problems yesterday, couldnt buy through fidelity.",
        "created_utc": 1633083648,
        "id": "heyjbmw",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1633112448.0
    },
    {
        "author": "Loadingexperience",
        "body": "The problem is that RH takes the money, lets say 50$ for GME share, routes that order to Citadel for PFOF. Citadel internalise that order and shits out and IOU for you. \n\nAll good so far right?\n\nBut Citadel as MM dont like to cover during major volatility so they keep taking these 50/60/70..$ orders while internalising order flow from RH or other PFOF broker(basically assuming short position), they know from experience that 99.99% of the time markets will calm down, the price will drop and they will be able to secure shares for favorable price to deliver them. PLEASE LET ME CLEAR THAT MOST OF THE TIME ITS DONE UNWILLINGLY BY ALGOS THAT RUN THE MARKET.\n\nSo what happened is that when GME started blowing  up at December/Early January algos took these 20/30/40$ orders gave out IOUs but never delivered actual shares. By mid Jan, some1 got margin call and realised that GME situation is that 00.01% event and now they are on the hook for 2700% payout compared to what they took in. \n\nThats why only PFOF brokers had to turn off buy button, because unlike brokers like fidelity that actually got their shares delivered they only had IOU but not the share and as soon as some1 pressed Sell button they had to pay from their own pocket the difference hence all the liquidity issues.",
        "created_utc": 1633071640,
        "id": "hey64io",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633100440.0
    },
    {
        "author": "bigtimetimmyjim22",
        "body": "Seeing an 11 cent b/a spread on Fidelity and 85k volume.  Volume has been much lower this week than the ~ 2.5M per it was doing before.  Spreads have always been on the large end. \n\nNot sure about the float.",
        "created_utc": 1633103194,
        "id": "hezjoun",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1633131994.0
    },
    {
        "author": "WolfofLawlStreet",
        "body": "Yep, alot of things actually. The whole GME thing, got in a huge fight with an old friend in college because he thought rh halted trading for 15 min instead of the SEC. LOL \n\nThat and people don't understand the automatic clearing house issue either. rh doesn't have that much book value to withstand that much volume when that happened too. They also weren't the only brokerage to do this either. No one is going after TD, Fidelity, or eTrade who did identical stops on it.",
        "created_utc": 1633089611,
        "id": "heyrkvn",
        "score": 2,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1633118411.0
    },
    {
        "author": "Scary-Drink8659",
        "body": "Is it just me or is the fidelity app acting gay?",
        "created_utc": 1633096015,
        "id": "hez3jvp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633124815.0
    },
    {
        "author": "william_cutting_1",
        "body": "Fidelity.",
        "created_utc": 1633117752,
        "id": "hf0h9jp",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633146552.0
    },
    {
        "author": "Reddit_Roit",
        "body": "Drop robinhood and get fidelity. You can get penny stocks and it's a hell of a lot cheaper than other companies like td Ameritrade.",
        "created_utc": 1633117039,
        "id": "hf0fpk2",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1633145839.0
    },
    {
        "author": "emikoala",
        "body": "Target date is a safe place to stash your money. The Fidelity indexes are good because their expense ratios are typically 0.01-0.02% since a computer is doing all the work instead of a human investment advisor. Higher expense ratios aren't necessarily bad if the human-operated fund beats the computer-operated fund by a large enough margin, but that happens less often than you might think.\n\nI'm a relatively risk averse person who nonetheless understands that the optimal amount of risk is not zero, so my investing paradigm is to invest more in lower-risk ventures and less in higher-risk ones.\n\nMy retirement savings are roughly:\n\n* 28% target-date fund (pre-tax account)\n* 22% Fidelity 500 (pre-tax account)\n* 17% Fidelity Mid Cap (pre-tax account)\n* 13% Fidelity Small Cap (pre-tax account)\n* 20% speculative investments in a slew of stocks with high growth potential (post-tax account)\n\nYour mix could look different depending on your own risk tolerance, but for my 2c it helps steel my nerves enough to take the bigger swings like in my post-tax account if I'm only swinging with a small percentage of my savings and the majority of it is in a safer place. There's always a trade-off between risk and reward, you will need to find the sweet spot where you feel most comfortable. At some point you may realize you're not comfortable with as much risk as you thought, and at some point you may realize that you'd be comfortable with more risk, and you can change your 401k allocations along the way to match your comfort level.",
        "created_utc": 1633114427,
        "id": "hf09qy7",
        "score": 1,
        "subreddit": "investing",
        "created": 1633143227.0
    },
    {
        "author": "DeFi_ance",
        "body": "I recently switched over to Yubikey after using Authy for years, and I friggin' love it. It's far more secure and it's even quicker than pulling up an OTP code for sites that support the FIDO protocol directly, such as Coinbase and Gemini. For sites that don't support FIDO and still use OTP (what Authy/Google Auth is), Yubikey can do those too with a Yubico Authenicator app which requires your key to generate the codes.\n\nYubico's site has excellent setup guides and FAQs to get things going. The only downside is the expense, as you want to buy multiple keys to have a backup incase you lose your primary. But, if you've got a decent chunk of money to protect, spending a hundred bucks for a couple Yubikeys is well worth the vastly improved security.\n\nTradFi is so behind crypto on security models, it's insane. For Fidelity, TDA, and my three banks, they *all* only have SMS 2FA as an option, not even OTP. And for my trading platform, ThinkOrSwim, it doesn't have any 2FA at all to login and make trades. Drives me nuts.",
        "created_utc": 1633128863,
        "id": "hf14tiv",
        "score": 1,
        "subreddit": "investing",
        "created": 1633157663.0
    },
    {
        "author": "KidsAlwaysSeeGhosts",
        "body": "make him a fidelity account where he can invest his allowance",
        "created_utc": 1633118229,
        "id": "hf0ibeo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633147029.0
    },
    {
        "author": "Conscious-Soil9055",
        "body": "Yes, Webull still has flaws, but comparing Webull to fidelity is not even a fair fight.",
        "created_utc": 1633128700,
        "id": "hf14hf4",
        "score": 1,
        "subreddit": "options",
        "created": 1633157500.0
    },
    {
        "author": "Dr_Clout",
        "body": "I 100% understand I’m a scrub for using them. I have TD Ameritrade and Fidelity setup but no holdings. I just started using Robinhood so haven’t stopped. I realize I’m my own culprit but responding to everything like you did is like if I said “hey my speedometers off!” “Well you should’ve known that they make better fuckin cars”. My bad, I thought the speedometer worked.",
        "created_utc": 1633098135,
        "id": "hez85rq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633126935.0
    },
    {
        "author": "kiwimancy",
        "body": "Yes. You can buy fractional shares of an S&amp;P 500 index mutual fund like FXAIX which has a $0 minimum investment. You can also buy partial shares of an S&amp;P 500 index ETF like VOO from the Fidelity mobile app (I think it's not implemented on the website or desktop apps).",
        "created_utc": 1633116464,
        "id": "hf0eevb",
        "score": 1,
        "subreddit": "investing",
        "created": 1633145264.0
    },
    {
        "author": "Complete-Fact",
        "body": "Fidelity wouldn't let me trade options",
        "created_utc": 1633115221,
        "id": "hf0bkkm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633144021.0
    },
    {
        "author": "RunawayMoon",
        "body": "Great question here and looking to see answers from others as well. Same demographics as yourself.\n\nRecently consolidated my investments into three active strategies (one with fidelity) and have no regrets. Out of the US here so YMMV.",
        "created_utc": 1633104826,
        "id": "hezni5d",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633133626.0
    },
    {
        "author": "Conscious-Soil9055",
        "body": "Switched to fidelity to avoid pfof and consolidate accounts. I kept my Webull account active because the mobile app blows everything else away. I like it so much better. I really wish Fidelity would just buy Webull.",
        "created_utc": 1633081418,
        "id": "heygsur",
        "score": 1,
        "subreddit": "options",
        "created": 1633110218.0
    },
    {
        "author": "mike7x",
        "body": "TMC up on insider buy. From Fidelity:\n\n$TMC Insider Buy: TMC The Metals Co\r  \n09:35 AM EDT, 10/01/2021 (MT Newswires) Andrei Karkar, 10% Owner, Director, on Sept 30, 2021, executed a purchase for 2,250,110 shares in TMC for $9,999,939. Karkar has control over a total of 41.8M shares...value is approximately $186,123,323.",
        "created_utc": 1633101803,
        "id": "hezgh06",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633130603.0
    },
    {
        "author": "justsomeitguyhere",
        "body": "I've never had a fidelity account, but I see this question with a lot of US brokers, read the fine print",
        "created_utc": 1633116085,
        "id": "hf0djuf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633144885.0
    },
    {
        "author": "Conscious-Soil9055",
        "body": "If you get a chance you should download Webull's app. Fidelity's app for active traders/investors is worthless. For checking account balances it is fine, much past that is clunky and doesn't work well. They obviously tried to make it look like Robinhood. No idea why, that's a terrible app as well. Yes, I'm very hard on fidelity for the app but it's only because fidelity is the best in the industry and I want fidelity to have the best tools.",
        "created_utc": 1633126097,
        "id": "hf0z26z",
        "score": 1,
        "subreddit": "options",
        "created": 1633154897.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "\"if not they are making money another way.\"\n\nThat's exactly it! They make money another way, by offering additional financial planning services, from margin, and from options.\n\nBy providing a high quality trading platform that is totally free, and has market-leading price improvements since they don't use PFOF, they create trust advertise their other services.\n\nFidelity is trusted, and that is an important point.",
        "created_utc": 1633122570,
        "id": "hf0rr20",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633151370.0
    },
    {
        "author": "lyleberrycrunch",
        "body": "Yeah unfortunately for most blue-collar folks that’s how it is. It’s big finance and it’s confusing and most working families don’t know if they can trust it. But that’s mostly because they haven’t seen the historical data (hundreds of years of it). And they tend to draw a false equivalency between options trading/gambling and dollar-cost-averaging into VT or VTI\n\nI think a lot of it comes from accessibility and family influence: back in the day it used to cost a bunch of money to trade and it was super hard to do so most didn’t even bother. And if your parents don’t know anything about stocks, they won’t teach you. I was lucky in that I grew up in a very stock-friendly household with CNBC going 24/7. I was aware of the market in elementary school lol but I recognize this isn’t how most people grew up\n\nAnyways, yeah there’s usually no need for financial advisors. Odds are they’ll get complicated, try to get fees out of you and whatever they tell you will probably underperform VT or VTI anyway. Great choice with Fidelity by the way, they’re an excellent broker. And even if you lost money giving into the hype on CLOV, hopefully you can consider it a cheap “intro to the stock market course” because at least it got you more involved\n\nAlso, just want to mention that there’s probably no need to own VTI and VT/VXUS. If you already own all 3, I wouldn’t bother selling though. Basically VTI is total US stock market, VT is total all stock market and VXUS is total non-US stock market so VT is just a combination of VTI/VXUS. Currently it’s about 62% VTI and 38% VXUS because of the size of the US market but it’s up to you how much you want to weight international. I tend to go less as I have a bit of a preference toward US stocks so I like the weighting you currently have\n\nAnd yeah, I still check my brokerage app way too often but oh well. Just don’t ever panic sell even if the market crashes and try not to act on emotion. I remember people selling when the market was down 7-10% per day during March 2020, thinking they’d buy back later, meanwhile I bought the entire time and the market rallied extremely quickly. Some are still waiting on the sidelines hoping they’ll get the correction they were hoping for. Just remember the two key phrases “more money has been lost trying to anticipate corrections than lost in the corrections themselves” and “time in the market beats timing the market”",
        "created_utc": 1633112108,
        "id": "hf04eyi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633140908.0
    },
    {
        "author": "not_that_kind_of_dr-",
        "body": "I've was able to buy IONQWS an hour ago in the fidelity app\n\nA few weeks ago they offered a toggle to a new 'BETA' interface. I had trouble with that, and switched back.\n\nOne other thing I noticed, just in the past week or so, on Android, if I try to adjust the price of an existing limit order, I would consistently get a crash. So instead I just cancel and then submit a new one. Is that what is affecting you? But that is unusual, over the past year or so I can't remember any other problems.\n\nTheir free  desktop trader pro software is way better than the phone app.",
        "created_utc": 1633110557,
        "id": "hf00ud8",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1633139357.0
    },
    {
        "author": "JimboMcMidges",
        "body": "Hello, I am 44 living in the US. I have $6,270 available to invest from my SEP-IRA and I am only 44 so I have 20 years for a long-term investment and I would prefer a high yield. I currently have $6,500 split between VOO and VOOV. Based on my amateur research, it seems that for long term gains I should be investing in international, not US, because the US economy isn't looking too great in the long term. Someone on this subreddit suggested VXUS, but Fidelity shows that fund as \"weak\" across the short/mid/long term. Are there any international funds that are a better bet? Thanks!",
        "created_utc": 1633111291,
        "id": "hf02jtw",
        "score": 1,
        "subreddit": "investing",
        "created": 1633140091.0
    },
    {
        "author": "ParsleySalsa",
        "body": "I dont know if I'm in the correct sub. Is this where we can ask totalnoob questions? \n\n I just want to know if I can buy $8 worth of the s&amp;p. I bought a full share of a stock on fidelity which was simple. About $8 is all the cash left in the fidelity account.  Is buying partial the same process?",
        "created_utc": 1633115841,
        "id": "hf0czi6",
        "score": 1,
        "subreddit": "investing",
        "created": 1633144641.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "From their website.\n\nI simply looked up the stock most people who recommend them are investing in, and it has a 5% reinvestment fee.\n\nI'm sure you can find stocks on there without a reinvestment fee. Instead of not paying any fees, across the board, as I do, you pay varying fees depending on which stock you buy.\n\nIt also has  $5 one-time investment fee, and a $2.50 recurring fee. Every time you trade there is a surcharge. Plus $.05 per share!\n\nWhat is the case for not \"trusting\" Fidelity? I understand the case for not trusting PFOF and trading apps, but those aren't the only brokerage options.",
        "created_utc": 1633120438,
        "id": "hf0n4po",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633149238.0
    }
]