[
    {
        "author": "dasheasy",
        "body": "Hire a monkey they can reproduce Shakespeare randomly hitting keys, they must be lucky hitting few buttons",
        "created_utc": 1638651990,
        "id": "hn8no41",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638680790.0
    },
    {
        "author": "Sultan_Of_Ping",
        "body": "&gt; This is projecting. You've decided what is hard for you is also hard for me, which is inaccurate. Don't judge a thing by listening to the people that can't effectively use it. Talk to the people with mastery.\n\nNo, this is experience in managing the security of real world systems using real world constraints. In the real world, nobody let users manage their own crypto keys, because users will make mistake (or just be unlucky) all the time.\n\nIf the average user has 1/10K chance every day of mishandling its cryptographic key, and your system has 1M users, it means that on average, 100 users are going to mishandle their cryptographic key every day. For a typical bank issuing debit cards, this is business as usual, and something that is easy to manage every day, because they are an authority who can re-issue their own cards at will. In a cryptocurrency scheme that trust users with the handling of their own crypto keys, that's 100 users every day who will lose everything.\n\nCryptocurrency schemes are secure only under a very narrow and superficial view of what \"being secure\" means.",
        "created_utc": 1638654404,
        "id": "hn8t7tl",
        "score": 1,
        "subreddit": "investing",
        "created": 1638683204.0
    },
    {
        "author": "klienbottle45",
        "body": "If they can violate human rights, then they can come and also take your keys.",
        "created_utc": 1638567027,
        "id": "hn49ulo",
        "score": 1,
        "subreddit": "investing",
        "created": 1638595827.0
    },
    {
        "author": "crimeo",
        "body": "* Registered accounts\n\n* Can't lose your keys (this actually causes almost as much loss as inflation in fiat does...)\n\n* If you have a 0 commission brokerage, you can trade for free, no gas no exchange fees at all",
        "created_utc": 1638564208,
        "id": "hn42z0p",
        "score": 1,
        "subreddit": "investing",
        "created": 1638593008.0
    },
    {
        "author": "AKeveryday",
        "body": "Well their source is fees, they have to hold the coins in case a buyer or all buyers wants to pull their coins out of the exchange essentially. \n\nThat’s why it’s a rule for any new Bitcoin user to remember the phrase “not your keys, not your coin”.",
        "created_utc": 1638583371,
        "id": "hn57zev",
        "score": 1,
        "subreddit": "investing",
        "created": 1638612171.0
    },
    {
        "author": "nomad0010",
        "body": "idk, it lost so many keys supports i could see it opening at 150 levels",
        "created_utc": 1638508874,
        "id": "hn17ou3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638537674.0
    },
    {
        "author": "Karl_Marx_",
        "body": "Hard keys are dope, fight me.",
        "created_utc": 1638539723,
        "id": "hn2f7dj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638568523.0
    },
    {
        "author": "15kisFUD",
        "body": "Made moving money internationally easier \n\nAchieved widespread adoption of easy-to-use public key infrastructure on a much greater scale than was available before (remember PGP web-of-trust?). Metamask is very widespread, as are other mEth wallets, and there's also infrastructure around these keys such as ENS, attestations (proofofhumanity, POAP, etc), and people are talking about using it as an alternative scheme for logging into traditional web services.\r  \n\r  \nFully decentralized messengers that are easy-to-use (eg. Status is slowly getting there). This requires buttchains in two places: ENS for persistent usernames, and eventually for sybil-resistance/anti-spam mechanisms\r  \n\r  \nFunded the zero-knowledge proof space, which has all sorts of industrial applications even far beyond buttchains\r  \n\r  \nMade it easier for people in countries with weak financial systems to hold dollar-equivalents (eg. DAI, USDC)\r  \n\r  \nAllowed organizations to control funds securely with multisig wallets (actual-money finance has much weaker and more inconsistent support for this)\r  \n\r  \nSome of the world's best and easiest-to-use prediction markets\n\nEasy access for everyone to get a loan againts their collateral\n\nEasy access for everyone to earn yield on stable usd equivalent coins\n\n&amp;#x200B;\n\nBut don't judge the tech by todays use cases. Ethereum has only existed for 6 years now and has had to overcome significant scaling challenges that are only now coming together. How much use cases did the internet have in 1989?",
        "created_utc": 1638539880,
        "id": "hn2finp",
        "score": 1,
        "subreddit": "investing",
        "created": 1638568680.0
    },
    {
        "author": "Arsewipes",
        "body": "Did she hide the keys?",
        "created_utc": 1638702595,
        "id": "hnb9dwb",
        "score": 1,
        "subreddit": "investing",
        "created": 1638731395.0
    },
    {
        "author": "Immediate-Assist-598",
        "body": "Many stocks are a fraud and pyramid schemes too, it depends. I got suckered into both the Y2K and the cannabis legalization hysterias and made some money at first but then lost about 40% before I got out.  One of my stocks went to zero after Apple cancelled its contract with them.   Re-watch THE WOLF OF WALL STREET and pretend it is 2019 and they are hawking cryptos instead of mostly worthless penny stocks.  My making mistakes earlier in my life, including being taken in by a few scam artists, I came to guard my rational thought and caution when it comes to investing.  It is also like the old tortoise vs hare analogy. Or only fools rush in.  -- My first stock trade was a winner and I made $5000 in one day. I was 28 years old and I thought \"boy am I smart this is easy\" so I kept playing and ended up losing $50,000 because I ignored all the warning signs and had blind faith.  Even blue chips can sometimes be a death trap.  Enron and GE were two I owned at one time. Thank God I sold them. Enron went to zero.  Then, in 2008 at the pits of the economic collapse, I had no money except $250,000 I had borrowed against my home. I saw the market down 70%. It was like the reverse of the crypto craze all the \"experts\" on CNBC were saying \"stocks are worthless, could all go to zero\". I thought \"that is a glaring buy signal\". So I took my whole $250000 and bought. What did I buy? I looked around at young people I knew and thought, what are the two things they will never surrender even if they are unemployed and so are their parents?  Apple and Whole Foods (cheaper than restaurants).  Well to make a long story short, I doubled my money on those two, paid off all debts, Amazon bought Whole Foods giving a %500 profit , but I kept buying Apple on every dip, especially when Steve Jobs died and the Street was writing off Apple, accumulating moreand more. Why? Because everywhere I went I saw that the iPhone was the #1 essential in peoples'  lives or aspirational brand.  I am now up 6 million on AAPl alone.  Then 18 months ago during the pits of the shutdown I went to the Caribbean to retire and realized the real estate market was dead because no one was traveling and there were no customers except for private islands.  So I started making lowball offers and got two cool condos at about 25% off.   The keys were timing. When everyone else is selling (unless it is for very good reasons) that is the time to buy,  but only buy something REAL with deep value behind it.  Also remember, avoiding losses is the same as making gains. So if in doubt go with capital preservation and income.  A safe undervalued dividend stock. Like four I can recommend right now: T, VZ, VIAC and SWKS. Those were the four best bargains I could find and even if they go down (which they have until very recently) you get paid to wait and every dog has its day. PLus I don't need the cash so I can afford to sock money away in a dividend paying dog which is temporarily out of all St favor.  But Apple, that is the perfect investment.  Because nobody makes more money than they do or products that people are so devoted to and dependent upon, and I see no real competition for Apple for at least a decade so I can sleep well at night.  But cryptos?  Wouldn't touch any of them a ten foot pole because just like those penny Y2K stocks, they are not real, with no book value, so they could go to zero.  Don't think it cannot happen to you just because other people are bowing at the crypto altar.  And if a severe sell-off comes, remember you want to be the first to cash out, not the last.",
        "created_utc": 1638742324,
        "id": "hndq37i",
        "score": 1,
        "subreddit": "investing",
        "created": 1638771124.0
    },
    {
        "author": "AlexJamesCook",
        "body": "Read it again, or are you just hitting keys on a phone?\n\nAnyway, I'm out. You have fun being the toughest guy on the internet.  I look forward to reading about your internet fighting championship record, that reads like an unironic version (in your head) of Chael Sonnen's \"undefeated, never lost a round\" spiel.",
        "created_utc": 1638413333,
        "id": "hmvstuc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638442133.0
    },
    {
        "author": "dragobah",
        "body": "This is gonna be like Alicia Keys being Creative Director of Blackberry. We all saw how that went. \n\nOh wait, its a fancy brand ambassador job.",
        "created_utc": 1638466750,
        "id": "hmyfy17",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638495550.0
    },
    {
        "author": "T__i__m__",
        "body": "Sadly, I look at this forum daily and then I’m surprised when headlines comes out referencing it and what’s it’s up to. Can I get the keys to the secret planning room on the top floor where all the real action is? What’s the password?",
        "created_utc": 1638441255,
        "id": "hmx0nos",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638470055.0
    },
    {
        "author": "neer21aj",
        "body": "Keyboards are ass. Keys stop working after a couple of years",
        "created_utc": 1638380133,
        "id": "hmtiyzc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638408933.0
    },
    {
        "author": "Sultan_Of_Ping",
        "body": "This is what make the whole scheme ridiculously pointless from a security perspective.\n\nBitcoin (to take this specific example) was created to get rid of the trusted authority - and it succeeded, at a huge computational cost, many order of magnitude slower than competing systems.\n\nBut managing one own's crypto keys is ridiculously insecure and unscalable in the real world. So people rely on brokers instead... thus recreating the very entity they were getting rid of... while still using this cost-prohibitive protocol to do it.",
        "created_utc": 1638635908,
        "id": "hn7l4cq",
        "score": 1,
        "subreddit": "investing",
        "created": 1638664708.0
    },
    {
        "author": "lll_lll_lll",
        "body": "Well who are the other custodians? Do they have ownership over the private keys as well? What if they decide to betray you and drain the account? What if they don't agree to give their consent even though you want the money and it's yours?\n\nOnce you're talking about other custodians it's no longer a trustless system but just another form of third-party system like a bank.\n\n\nAs for the time release thing that's kind of interesting. But how much time like a day? I just think that wrench attacks will evolve to counter whatever self custody security measures come out.",
        "created_utc": 1638639041,
        "id": "hn7snhm",
        "score": 1,
        "subreddit": "investing",
        "created": 1638667841.0
    },
    {
        "author": "RandoStonian",
        "body": "This stuff can be done in crypto too, using what's called \"vaults\" - essentially time locked accounts with potentially mutliple custodians who are authorized to 'cancel' attempted transactions within a set time period to prevent faud.\n\nThis sort of stuff can also be used for 'social recover' to lost account keys.",
        "created_utc": 1638636280,
        "id": "hn7lzpt",
        "score": 1,
        "subreddit": "investing",
        "created": 1638665080.0
    },
    {
        "author": "ResponsibleReality51",
        "body": "Only then people who miss the \"hard keys\" on phones.",
        "created_utc": 1638536831,
        "id": "hn29rgh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638565631.0
    },
    {
        "author": "DarthLysergis",
        "body": "[I hear the keys are lovely this time of year.](https://youtu.be/cu_A-aG8G7U&amp;t=141s)",
        "created_utc": 1638506032,
        "id": "hn12ff1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638534832.0
    },
    {
        "author": "PrincPaco",
        "body": "That shit is wild. Everything is cool until MS-13 gets the keys",
        "created_utc": 1638658883,
        "id": "hn93qb3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638687683.0
    },
    {
        "author": "Packolypse",
        "body": "You can’t sit still. You find yourself OCDing on simple things like placement of keys or scissors and you get frustrated when things are out of place. That people have noticed you do things like play with your hair or bite your lips or you can’t make eye contact.",
        "created_utc": 1638673577,
        "id": "hna0svo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638702377.0
    },
    {
        "author": "LoveSucklingBreasts",
        "body": "Really? I cant speak on that, but lets be honest here.. blockchain wallet security is at the end of the day solely on us as the individual, the company providing a custodian wallet does their best to protect that integrity. So if the give you 2 step verification and google auth code, and you need your wallet keys ;  how do they get hacked?\n\n&amp;#x200B;\n\nmost of these people have ebnen victims of a phishing attack and they write down their keys online and they don't have  good security to begin with. \n\n&amp;#x200B;\n\nTrustwallet has my trust &lt;3",
        "created_utc": 1638732807,
        "id": "hnd01fy",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1638761607.0
    },
    {
        "author": "Bonbon676790",
        "body": "You’d have to give up substances, being under the influence in your car while the keys are in it, even if they aren’t in the ignition, is enough to be charged with a DUI.",
        "created_utc": 1638435079,
        "id": "hmwtfdi",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638463879.0
    },
    {
        "author": "crimeo",
        "body": "There is a \"Fee\" of 3-4% annually which is the likelihood on average of you losing your keys.",
        "created_utc": 1638563750,
        "id": "hn41umk",
        "score": 1,
        "subreddit": "investing",
        "created": 1638592550.0
    },
    {
        "author": "crimeo",
        "body": "2% expense ratio is still lower than the amount of coins people lose every year on average by holding their own keys, so... doesn't matter. If that's your best professional option, at least. In Canada we have some ETFs that are better at under 1/2 a % MER",
        "created_utc": 1638563613,
        "id": "hn41ih9",
        "score": 1,
        "subreddit": "investing",
        "created": 1638592413.0
    },
    {
        "author": "gmoneymaker7",
        "body": "they can seize private keys, but that's the one security hole bitcoin has.  \n\n\nbut if you properly store your device on a multisig, nobody is getting that shit.",
        "created_utc": 1638661558,
        "id": "hn99zdm",
        "score": 1,
        "subreddit": "investing",
        "created": 1638690358.0
    },
    {
        "author": "mushlafa123",
        "body": "So god damn hungry and I can't find my car keys. I wanna go get some McDonald's. Someone help",
        "created_utc": 1638474034,
        "id": "hmyyvns",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638502834.0
    },
    {
        "author": "Mr_Yuzu",
        "body": "Funny, I did the same thing and he took my keys and made me take the bus home.",
        "created_utc": 1638575920,
        "id": "hn4sjf3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638604720.0
    },
    {
        "author": "Thanis_in_Eve",
        "body": "Well yes. You must take action to ensure you don't lose your keys. This is similar to how you must not lose your bearer bonds (very old paper based Fintech), cash (even older paper  or coin based Fintech), or paper contracts. If you lose a diamond from a ring, it is lost. Yet, people still put diamonds on rings.\n\nWallets aren't insecure or hard, they just take some training and effort. There is always a potential for loss, regardless if the asset. Every BTC loss story I've heard had a clear failure point. And between you, me and Reddit, the same people that infect the corporate network by clicking on malware links in phishing emails are the same ones that will lose their keys. We can't (humanely) fix that.",
        "created_utc": 1638656919,
        "id": "hn8z2x8",
        "score": 1,
        "subreddit": "investing",
        "created": 1638685719.0
    },
    {
        "author": "ProffS",
        "body": "Apparently the supply chain of &lt;Enter&gt; keys is disrupted, and is floating off the Long Beach Harbor.\nThat was my take when I read the first few words...and then thought....\"naa\"",
        "created_utc": 1638711858,
        "id": "hnbm82j",
        "score": 1,
        "subreddit": "investing",
        "created": 1638740658.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/Glittering-Zebra-892 (1/0) made a bet that BABA would go to 120.0 when it was 140.34 and it did, congrats autist.",
        "created_utc": 1638535911,
        "id": "hn28713",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638564711.0
    },
    {
        "author": "Educational_Big_4900",
        "body": "Thanks for the comment.  I'm going to have to check in the margin.  I'm with Fidelity as well and I thought I could use margin when I ran it through the calculator.  Unfortunately, I get an error saying they are down atm and cant check.  I do like the idea of buyting the further OTM put to redcue the capital if it is 100% cash.\n\nAs for the ZEBRA, I'll have to look in to that.  I havent used or even know what one is and will have to do some research.  Love getting in to this but have a lot to learn.  If you have any good resources, i'd appreciate it.  If not, google works too!",
        "created_utc": 1638674540,
        "id": "hna2vtx",
        "score": 1,
        "subreddit": "options",
        "created": 1638703340.0
    },
    {
        "author": "GimmeAllDaTendiesNow",
        "body": "It seems like you understand the risks. Keep in mind that the covered strangle is a long position. You stand to lose a lot if the stock drops. Additionally, it seems like you’re selling a cash-covered put and not a leveraged put. That’s a VERY capital-intensive position. The airlines might not be margined with your broker. I know Fidelity isn’t margining AAL, which I found out when they took $1,700 for a 17P. Very annoying. \n\nYou might consider buying a further OTM put to cap the capital requirement and give yourself some efficiency. \n\nYou can achieve the same results on an un-leveraged covered strangle with a lot less and less risk. For example, if you own 100 shares of DAL and you sell a 20 delta strangle, you are net long 100 deltas. However, if you’re selling a CSP, you are synthetically long the second lot at your break even, so from a capital standpoint, it’s actually more like 180 long deltas. Ignoring that, you can buy a ZEBRA, which will give you 100 long deltas for probably 1/4 the amount of capital as the cash-covered strangle. You could sell 2 ATM puts, or buy 2 ATM calls both of which will give you 100 deltas. If you wanted 180 long deltas, you could sell (3) 60 delta puts or buy (3) 60 delta calls.",
        "created_utc": 1638673450,
        "id": "hna0iyg",
        "score": 1,
        "subreddit": "options",
        "created": 1638702250.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/Glittering-Zebra-892 (1/0) made a bet that BABA would go to 120.0 when it was 140.34 and it did, congrats autist.",
        "created_utc": 1638535911,
        "id": "hn28713",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1638564711.0
    }
]