[
    {
        "author": "stoney-the-tiger",
        "body": "After we killed the Iranian terrorist dude, Sulamani, about a year ago I went in big on a number of cloud security stocks including $NET.  I am a software and devops engineer with a lot of exp in the industry and I have seen demos/sales pitches from just about every one of these companies and used many of them (good and bad).  So I bought the stocks that I make good products I enjoy using and trust as a consumer of these products.  Full disclosure, I made these picks because their tech works and I feel that technical leadership in this area will beat out accounting, marketing, and other aspects of successful companies.  That bet has paid off with 300-400% gains in the last year for the companies I bought with every penny of available capital \\~yr ago.  Those were $NET, $CRWD, and $ZS I am still long on these.  I also was into $MSFT which is good in this respect and $ESTC (which I unfortunately sold around $100 because they were going sideways). I have since gone into $FROG, $PLTR, and $SUMO which are more recent IPOs.\n\nThere are a few categories of attack that you worry about from an IT organizational standpoint.  This list is in no particular order other than the first one because you asked about $NET.\n\n* Distributed Denial of Service (DDOS)\n   * Cloudflare ($NET) is the best protection you can have for this.  End of story.  They have many other products that make them a great company. They have introduced a new set of tools that cover everything you need for a work anywhere company.  They also have made some things that do for cloud computing what CDNs (like Akamai) did for static content.  There main competitors are Fastly, Akamai, and Limelight but $NET is best from tech standpoint.\n* ID management and access control\n   * $MSFT, $OKTA, Ping, Sailpoint from login perspective\n   * $FROG is also good from the perspective of managing access control to intellectual property\n* Malicious websites and phishing \n   * $ZS, $PANO, Fortinet, and a few others play in this space\n* Post attack cleanup\n   * $CRWD is the best here\n   * $ESTC is actually the best but it is open source and european which I think had some negative influences for me as an investor.   Splunk, $SUMO, Data Dog, and Snowflake can also be really good in this regard \n* Secure development\n   * There are a few companies but all of their stuff is hum drum",
        "created_utc": 1610846081,
        "id": "gjizx7f",
        "score": 19,
        "subreddit": "stocks",
        "created": 1610874881.0
    },
    {
        "author": "Quelorel",
        "body": "PLEASE RATE / ROAST MY SOON TO BE PORTFOLIO (IM NEW)\n\nMSFT, NOW, CRM, DOCU, CRWD, WDAY, OKTA, TEAM, SPLK, AKAM, NICE, HUBS, CHKP, CTXS, FICO, CMPS, VEEVA, NVDA, GOOG, TWLO, HERS, SYK\n\nI plan on keeping them (and invest more in them) from minimum 2yrs (If I keep it more then 2 I don't have to pay tax in Croatia) to 10 - 15yrs.\n\nAlso considering to research EV a little bit this year.\n\nLet me know what you think!\n\nThanks!",
        "created_utc": 1611327417,
        "id": "gk6mqlp",
        "score": 5,
        "subreddit": "stocks",
        "created": 1611356217.0
    },
    {
        "author": "Amasan89",
        "body": "I bought all last year: NET, FSLY, AKAM 33% each. I sold AKAM for BB on Monday but NET and FSLY are there to stay and moon.",
        "created_utc": 1611236765,
        "id": "gk25s4p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611265565.0
    },
    {
        "author": "Quelorel",
        "body": " PLEASE RATE / ROAST MY SOON TO BE PORTFOLIO!\n\n&amp;#x200B;\n\nI am 24yrs old and want to start investing in mainly growth stocks.\n\nMy main target is Tech, but have some others as well.\n\nMSFT, NOW, CRM, DOCU, CRWD, WDAY, OKTA, TEAM, SPLK, AKAM, NICE, HUBS, CHKP, CTXS, FICO, CMPS, VEEVA, NVDA, GOOG, TWLO, HERS, SYK\n\nI plan on keeping them (and invest more in them) from minimum 2yrs (If I keep it more then 2 I don't have to pay tax in Croatia) to 10 - 15yrs.\n\nAlso considering to research EV a little bit this year.\n\nLet me know what you think!\n\nThanks",
        "created_utc": 1611327292,
        "id": "gk6mcjp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1611356092.0
    },
    {
        "author": "Hun-chan",
        "body": "That may be true, but what does that mean for the share price? I suggest you study the MSFT or AKAM historical charts for some insight into what can happen when innovative companies attract lofty valuations.",
        "created_utc": 1610337280,
        "id": "giu6cli",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1610366080.0
    },
    {
        "author": "leembarnes",
        "body": "Geoblock from Akamai WAF?",
        "created_utc": 1610543139,
        "id": "gj3ws40",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610571939.0
    },
    {
        "author": "SmallParade",
        "body": "VMW and AKAM are two more that fit. DBX is close: debt to equity of 117%",
        "created_utc": 1611139615,
        "id": "gjxl5c0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1611168415.0
    },
    {
        "author": "ThePorko",
        "body": "Akam is the back bone of the internet.",
        "created_utc": 1611192760,
        "id": "gk0h892",
        "score": 2,
        "subreddit": "stocks",
        "created": 1611221560.0
    },
    {
        "author": "Leblanc_James",
        "body": "I think it's good to buy the dip on cloudflare. Akamai doesn't really seem to innovate as much as Cloudflare is doing by pushing out new products. Plus cloudflare is a growth company soon to make profit.",
        "created_utc": 1609788328,
        "id": "gi3j5wv",
        "score": 2,
        "subreddit": "stocks",
        "created": 1609817128.0
    },
    {
        "author": "chedrich446",
        "body": "They use Akamai. As do most big retailers.",
        "created_utc": 1611206397,
        "id": "gk16h74",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611235197.0
    },
    {
        "author": "Amasan89",
        "body": "FSLY is such a gem, I didn't want to commit fully so I bought also NET and AKAM but FSLY is the leader. (AKAM I sold for BB on Monday)",
        "created_utc": 1611233403,
        "id": "gk20pif",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611262203.0
    },
    {
        "author": "1i3to",
        "body": "They are still in a rapidly growing sector and it is my understanding that the loan was taken to build and scale edge capability.\n\nI am sure that they will never get a fastly multiple but I can't see why they would not get an Akamai multiple unless you know that their tech is somehow inferior..",
        "created_utc": 1609523995,
        "id": "ghqm1t2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609552795.0
    },
    {
        "author": "1i3to",
        "body": "Thanks for the warning. I am thinking that if a trendy youtuber picks it up they can totally go closer to Akamai multiple, but totally see where you are coming from.",
        "created_utc": 1609524100,
        "id": "ghqmbul",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609552900.0
    },
    {
        "author": "bonvandalay",
        "body": "https://www.google.com/amp/s/www.ndtv.com/india-news/covaxin-effectively-neutralises-uk-covid-strain-says-bharat-biotech-2358730%3famp=1&amp;akamai-rum=off",
        "created_utc": 1611882251,
        "id": "gl692hp",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1611911051.0
    },
    {
        "author": "jake_cake_48",
        "body": "On and off with net. I don't think they'll ever be the company fastly is set to grow into, but they are head and shoulders above akamai/limelight/etc when it comes to product quality. Also just made a move into the Covid narrative, so anticipating short term excitement there. I'm too absorbed into the gme chaos to get into it atm though",
        "created_utc": 1611330357,
        "id": "gk6wdp6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611359157.0
    },
    {
        "author": "chedrich446",
        "body": "“Digital security” is super broad. If you’re talking about application security for consumer facing apps (like an e-commerce shopping cart) most of the big guys use Akamai.",
        "created_utc": 1611206521,
        "id": "gk16nxe",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611235321.0
    },
    {
        "author": "0xCr0v4x",
        "body": "A few people reported that they suddenly had issues when it previously worked. The access denied indicates that the site in general is up but their CDN/Cloud protection service Akamai blocked your request - most probably due to your specific IP being blacklisted (More likely a whole address space) to mitigate DDoS attacks.",
        "created_utc": 1611295717,
        "id": "gk5es6m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611324517.0
    },
    {
        "author": "McCringle3erry",
        "body": "TER, AKAM, QCOM, HOLX and V/MA pick one.",
        "created_utc": 1609769180,
        "id": "gi2gkfp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609797980.0
    },
    {
        "author": "McCringle3erry",
        "body": "TER, AKAM and GPN are three of my long term large cap growth holdings.",
        "created_utc": 1609539427,
        "id": "ghrla3q",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609568227.0
    },
    {
        "author": "i_accidently_reddit",
        "body": "Sure. A tech company, in the same way Allianz, Domino's or 3M are tech companies: they needed to adapt and have gone through a digital transformation.\n\nMarvelous.\n\nAnd hiring from Apple proves exactly that! Apple is mainly an electronics company with good UX.\n\nNone of those companies have contributed anything revolutionary in terms of software in the last twenty years. They have not pushed the boundary in this field at all. If you want good software engineers, go to Google, Red Hat, Elastic, Akamai, Shopify, SAP, Adobe or Salesforce, Palantir, or maybe even Facebook, but good luck getting those guys out. Potentially tier one breakout unicorns like bolt, airtable, fastly, tiktok, database companies, or edge companies amongst others.\n\nNot apple. There I would headhunt if I want marketing or design.\n\nWhat you need to understand is how difficult it is to build fully self driving cars, suitable for robo cabs.\n\nThe best self driving car makers are:\n\nWaymo (Google)\n\nGM\n\nArgo.ai (autonomous intelligent driving), part of VW.\n\nThose are the companies leading in every conceivable metric in this field.",
        "created_utc": 1610208578,
        "id": "ginymi4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610237378.0
    },
    {
        "author": "greytoc",
        "body": "I started before then and no I did not miss out as you you misinterpreted. The market has always been forward looking - that has not changed.  And I was fortunate that at the time, I was fairly diversified and still accumulating so the draw-down that I experienced was quite recoverable and didn't have lasting impact. But I am sure that wasn't the same for everyone. \n\nIf you were fortunate to have chosen a stock that recovered quickly and continued to climb then that's great. But that was not true for many other high-flyers stocks. Cisco for example has never recovered from it's highs. Akamai has never come close to recovering. Microsoft took about 10-15 years to recover.  Verisign which was the hot cybersecurity stock or the day is now only starting to recover. And the broad market took a good 10-15 years to recover back to the same level. Also - don't forget the many companies that evaporated like [Pets.com](https://Pets.com), webvan, etoys, [agency.com](https://agency.com), Doubleclick.  These are just the ones that I remember because I either swing traded them or they were core holdings in my portfolio at the time. \n\nYup - EV and clean energy are part of my portfolio but I will continue to hedge and protect my hard-earned capital.",
        "created_utc": 1611447055,
        "id": "gkgwncd",
        "score": 1,
        "subreddit": "investing",
        "created": 1611475855.0
    },
    {
        "author": "Kashm11r",
        "body": "I think you are trolling with statements like \"If a trendy youtuber picks this up they can totally go closer to Akamai multiple\". You already had this garbage pump removed twice from r/wallstreetbets. If you are down 40% on this you should just learn from your mistake.",
        "created_utc": 1609535116,
        "id": "ghrd4zl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1609563916.0
    },
    {
        "author": "rw1337",
        "body": "Excellent, AKAM looks especially good and I've never heard these mentioned before. Will do some more research on these.",
        "created_utc": 1611140110,
        "id": "gjxlnpw",
        "score": 1,
        "subreddit": "stocks",
        "created": 1611168910.0
    },
    {
        "author": "optionmaven1965",
        "body": "REASON\n\n&amp;#x200B;\n\n1.  there will be headlines in Barrons etc.\n2. The SEC and congress will be looking into all trading\n3. buy in anticipation and sell on realization.\n4. realization came today.\n5. if you watched AMC it started the down trend first.\n6. AKAM that I'm long took a hit.\n7. when all the big short stocks that were pushed up beyond reason, reason hit.\n8. Finally,  I would bet anything that Citadel is behind this drop of $300 points.  $100 billion remains solvent unlike KEYNES.",
        "created_utc": 1611852642,
        "id": "gl44yj3",
        "score": 1,
        "subreddit": "options",
        "created": 1611881442.0
    },
    {
        "author": "tomorland",
        "body": "Ok, let's talk about Tesla.\n\nFor the record, I do not own any Tesla stock, nor do I own a Tesla car, nor do I plan to own either in the foreseeable future. (I \\*do\\* own an electric car that I built myself. Love it. Planning to convert my daughter's car soon.)\n\nHere's why I think Tesla's stock value *could* be justified and *may* continue to go up.\n\n1. Tesla is a car company that makes a profit. It's not Amazon. But then, Amazon *didn't* make a profit for a long, long time. Amazon's retail product delivery service still doesn't make a profit. Who could have known that Amazon would beat Microsoft, Oracle, Cisco, Walmart, Akamai and all the others at cloud services? AWS is the meat of Amazon's profits. Who could have predicted this when they were just a book store?\n2. Tesla is also a consumer goods company. Solar power is just the tip of the iceberg. Heat pumps, Smart Homes, Satellite Networking... Yes, it's a tech company -- but it's more than that, it's a *BRAND*. Brand is far more valuable than innovation. The story you sell is more effective than the product you sell, *especially* if it's an also-ran product...\n3. Musk only knows one way to manage -- like a startup. Still going strong, like a start-up, after all these years.\n4. Leverage. Space-X, Boring Co. Tesla and whatever else comes along -- Grid-scale electrical storage? Off-grid self-sufficient housing? Insurance services? They all share tech between them. Tesla's Octo-valve, for instance. Almost certainly was designed by an aerospace engineer at Space-X.\n5. Tesla isn't Apple, or Amazon, or Microsoft. It's more like Java (the programming language) in the late 1990s.  Java didn't do anything better than any other language could do. It was a far worse language than many other more suitable, more mature ones. It failed at its main promise (write once, run anywhere!) Most seasoned programmers laughed at it. They said it wouldn't last. And yet...\n\nSo, forget about the cars. Tesla is a *brand*. It's a consumer technology-goods company that got it's start with cars, like Amazon got its start with books until it found gold in cloud services. Tesla is still digging, currently using a constellation of satellites... It won't end there. That's guaranteed.\n\nHaving said that, keep in mind that any one of IBM, Oracle, Walmart or a dozen others *could* have eaten Amazon's lunch at any time. Amazon was lucky no one tried very hard.",
        "created_utc": 1609736817,
        "id": "gi1essu",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1609765617.0
    },
    {
        "author": "25spread",
        "body": "RYCEY and ACIW are my largest current holdings because they are a bargain for the upside potential. RYCEY I'm anticipating a return to over $5 easily soon.  ACIW I'm anticipating to be bought for up to $51/share very soon, from an analyst projection in Dec 2020.  \n\nLarge positions that paid off big for me were: VRTX, GDRX, GOOGL, WWE, BMRN, FB, BABA, TSLA, MSFT, NVDA, LMND, AKAM, QDEL, LB, and many others.\n\nMy biggest percentage wins were: NKLA, XPEL, EXPE, F, COLM, ALGN, SPG, CLAR, TSLA, FB, RKT, SLQT,  INMD, ZTS, NVDA, LMND, GOOGL, GOOS, AMC, AMZN, AAPL, FROG, NFLX, RYCEY, PLTR, GOLD, and many others.\n\nI'm not a financial advisor, or expert.  Please make your own decisions, but I believe in these 2 above, among the 30 or so stocks I own at any given time.  I have an engineering degree and negotiating with contractors for over 20 years, I know how to spot bullshit, and when a good value is at hand.",
        "created_utc": 1611979529,
        "id": "glbzlz8",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1612008329.0
    },
    {
        "author": "0xCr0v4x",
        "body": "I think they misconfigured their Akamai setup. Its been like that for ages for various gamestop urls. Some subdomains ( news.gamestop.com ) work however.\n\nLooks like they have ip blacklisting in place and might have overdone it.",
        "created_utc": 1611263351,
        "id": "gk3r4uf",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1611292151.0
    }
]