[
    {
        "author": "fantasyfitboiz",
        "body": "I wish I would have understood the value of Deep ITM LEAPs and the leverage it can give you a year ago. I want to try a PMCC on something such as NVDA but knowing my luck I'll 100% buy the top.",
        "created_utc": 1630521975,
        "id": "hb7xsio",
        "score": 189,
        "subreddit": "wallstreetbets",
        "created": 1630550775.0
    },
    {
        "author": "thepunnman",
        "body": "Doesn’t matter if you buy at the top. The farthest out .7d nvda call costs roughly $6k. If you thetagang that and sell cc against that, which is roughly $100/week and you win 80% of the time, which means that you make money on your sold cc’s 41.6 weeks out of the 52 (rounded down to 41), you make back your initial investment in 75 weeks, or just the tiniest more than the lifetime of the leaps option. Even if your leaps eats shit and dies, you’re making money every week that makes up for it. This doesn’t even take into account if your leaps increases in value, and suddenly you’ve doubled your initial investment in a year",
        "created_utc": 1630528427,
        "id": "hb8dpq0",
        "score": 159,
        "subreddit": "wallstreetbets",
        "created": 1630557227.0
    },
    {
        "author": "CaptainHookemHoes",
        "body": "Wait so you’re saying you got 1 million off of covered calls from NVDA?",
        "created_utc": 1630512989,
        "id": "hb7brnu",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1630541789.0
    },
    {
        "author": "stonksrgud",
        "body": "I buy as far out as available almost every time.  I buy at least 10% ITM. I do not sell calls on my leaps.  I hold them like shares.  I sell them 6mo before expiry.  I also consider selling as I just did with Googl msft and NVDA when a leap is up ~100%, and buy a higher strike.   \n\nThis is just my strategy.  Not advice for anyone else",
        "created_utc": 1630677194,
        "id": "hbg3drh",
        "score": 46,
        "subreddit": "stocks",
        "created": 1630705994.0
    },
    {
        "author": "iandw",
        "body": "Skimmed through OP's posts.  Looks like NVDA, WFC, C, BAC, probably others we don't know about.\n\n\"got in when WFC was $39 since my C &amp; BAC in shares were returning 40%+. sometimes you just gotta go with the flow of market and don't fight it.\"",
        "created_utc": 1630535469,
        "id": "hb8t8f3",
        "score": 45,
        "subreddit": "wallstreetbets",
        "created": 1630564269.0
    },
    {
        "author": "HopefulStudent1",
        "body": "Portfolio gonna be 50/50 NVDA and TSLA lmao",
        "created_utc": 1630514112,
        "id": "hb7ej2i",
        "score": 41,
        "subreddit": "investing",
        "created": 1630542912.0
    },
    {
        "author": "UnstableCortex",
        "body": "I'm an electrical engineer, but not an expert on automobile engineering. But, I highly doubt if NVIDIA will be the beneficiary of the impending smart car boom. Smart cars will probably use more custom-made ASICs for intelligence than GPUs, as the latter is orders of magnitude less energy efficient than the former. And energy efficiency will be very important for battery powered smart cars.",
        "created_utc": 1630911126,
        "id": "hbs68ac",
        "score": 41,
        "subreddit": "stocks",
        "created": 1630939926.0
    },
    {
        "author": "Vinyyy23",
        "body": "lol winners keep winning.  Facebook, google, Microsoft, CRM, apple, tesla, amazon, nvidia…etc.   Its not hard finding good companies…the problem is just buying them and holding them a long time and to stop yourself from buying the shit companies you think are going to “moon”",
        "created_utc": 1630895946,
        "id": "hbrh8vj",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1630924746.0
    },
    {
        "author": "MaizeandBlue94",
        "body": "Sure.\n\nIf you ignore the fact that NVDA just had a 4-for-1 stock split 6 weeks ago so it's actually trading higher than the pre-split price.",
        "created_utc": 1630516955,
        "id": "hb7ljus",
        "score": 34,
        "subreddit": "wallstreetbets",
        "created": 1630545755.0
    },
    {
        "author": "crepeblanket",
        "body": "What was the news about Intel delaying their govt deliveries so they bought some AMD and NVIDIA chips while waiting for Intel to come through? Intel being the defacto govt chip supplier doesn’t sound like an absolutely sure thing long term",
        "created_utc": 1630765009,
        "id": "hbkk4ay",
        "score": 34,
        "subreddit": "investing",
        "created": 1630793809.0
    },
    {
        "author": "moekayat",
        "body": "damn. That's impressive. And I thought I was doing good with NVDA lol.",
        "created_utc": 1630854418,
        "id": "hbozx1y",
        "score": 28,
        "subreddit": "stocks",
        "created": 1630883218.0
    },
    {
        "author": "Zenny_100",
        "body": "TQQQ, IIPR, NVDA, UPRO and ABR",
        "created_utc": 1630850061,
        "id": "hboqfwj",
        "score": 28,
        "subreddit": "stocks",
        "created": 1630878861.0
    },
    {
        "author": "fresh_churros",
        "body": "I sold Nvidia for like 20 bucks back in the college days for some weed money. Still kicking myself. Got in at 30 for NET with all my first year paychecks in 2019. Redemptions do exist",
        "created_utc": 1630858199,
        "id": "hbp8ftm",
        "score": 21,
        "subreddit": "stocks",
        "created": 1630886999.0
    },
    {
        "author": "UnstableCortex",
        "body": "Anyone could, really. Apple's Neural Engine is an example. The point relevant to this post is that NVIDIA isn't making the right product for smart cars right now.",
        "created_utc": 1630911735,
        "id": "hbs70iu",
        "score": 18,
        "subreddit": "stocks",
        "created": 1630940535.0
    },
    {
        "author": "Difficult-Garage8985",
        "body": "When mining eth becomes no longer a thing used graphics cards will get dumped on the market and cause nvda to take a big hit in revenues. That's supposed to happen in like 6 months.",
        "created_utc": 1630909998,
        "id": "hbs4q1j",
        "score": 18,
        "subreddit": "stocks",
        "created": 1630938798.0
    },
    {
        "author": "Celtic_Legend",
        "body": "Hey 8 weeks before the tesla stock split it was 900 dollars. And then 6months later after the stock splir it was 900 again!\n \nNvidia can do the same",
        "created_utc": 1630521424,
        "id": "hb7wgv8",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1630550224.0
    },
    {
        "author": "jeffreyianni",
        "body": "AAPL MSFT GOOG NVDA ASML",
        "created_utc": 1630853323,
        "id": "hboxh14",
        "score": 17,
        "subreddit": "stocks",
        "created": 1630882123.0
    },
    {
        "author": "KKLHY",
        "body": "want to know too as i had NVDA leaps for Mar 2022 and sold half after being up 100%, cant go broke taking profits!",
        "created_utc": 1630863016,
        "id": "hbpjcg2",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1630891816.0
    },
    {
        "author": "Youre_a_dipshit69",
        "body": "Nvda is an amazing company but it only pays a miniscule, technical dividend to start in certain indexes. Not really relevant here",
        "created_utc": 1630861296,
        "id": "hbpfgf3",
        "score": 16,
        "subreddit": "investing",
        "created": 1630890096.0
    },
    {
        "author": "ra__account",
        "body": "See the recent discussion that we're still paying baggage fees that were markets as temporary after 9/11. If there's limited enough suppliers (like the AMD/Intel/NVidia trio), they can keep prices up without crossing the line of overtly colluding. Creating and manufacturing a powerful CPU is very costly and the only edge players like Apple have no interest in driving prices down.",
        "created_utc": 1630777573,
        "id": "hblc3s2",
        "score": 15,
        "subreddit": "investing",
        "created": 1630806373.0
    },
    {
        "author": "jeffreyianni",
        "body": "NVDA chugga chugga. The green monster is coming.",
        "created_utc": 1630714854,
        "id": "hbig7rk",
        "score": 15,
        "subreddit": "stocks",
        "created": 1630743654.0
    },
    {
        "author": "Sixers0321",
        "body": "NVDA is worth 570 billion, I'm sorry but at this point multiple baggers in the near term are all but impossible.",
        "created_utc": 1630829149,
        "id": "hbnyhc7",
        "score": 14,
        "subreddit": "stocks",
        "created": 1630857949.0
    },
    {
        "author": "MrDraiger",
        "body": "Five? I can only think of NVDA and BB in my portfolio.",
        "created_utc": 1630852293,
        "id": "hbov67d",
        "score": 12,
        "subreddit": "stocks",
        "created": 1630881093.0
    },
    {
        "author": "Original_Raspberry",
        "body": "NVDA, GOOG, MELI, QQQ",
        "created_utc": 1630790923,
        "id": "hbm5i6a",
        "score": 11,
        "subreddit": "stocks",
        "created": 1630819723.0
    },
    {
        "author": "PresterJohnsKingdom",
        "body": "Hesitate to comment since it seems you're pretty combative with some of the other commenters, and I'm not looking for an argument. But here goes.\n\nI think the basic principles of value investing are still alive and well, as long as you don't become shackled by rules (I won't buy a stock with a PE less than X or Y) and not adjust to the current dynamic.  \n\nI don't think Ford or GM are good examples of a value play...for me, my \"safe\" money is in companies who I feel the market is undervaluing.  Exxon Mobile, Altria Group, etc. and a couple REITs.  These companies have simple products (oil, cigarettes) but have done nothing but make money for years, and return value to their stockholders in dividends. I'm\n\nI still have a portion of my portfolio in growth, and haven't let high valuations scare me away from Nvidia, Cloudfare, Rocket Labs and other plays.",
        "created_utc": 1630778476,
        "id": "hble46t",
        "score": 10,
        "subreddit": "investing",
        "created": 1630807276.0
    },
    {
        "author": "LifeInAction",
        "body": "I started investing in 2017 and remember debating between making 25% of my total portfolio either Nvidia or AMD, I choose Nvidia, with AMD being an absolute sideways stock at that time, and while so happy to be up a ton, imagining what could've been if it was AMD. Thankfully grabbed SHOP, which also went parabolic. It was a fun year to invest, when things were so much significantly cheaper.",
        "created_utc": 1630631958,
        "id": "hbe2u23",
        "score": 10,
        "subreddit": "stocks",
        "created": 1630660758.0
    },
    {
        "author": "Drragos",
        "body": "NVDA will be way higher. Atleast top5, in the next 5 years, imo.",
        "created_utc": 1630668184,
        "id": "hbfmbyc",
        "score": 9,
        "subreddit": "StockMarket",
        "created": 1630696984.0
    },
    {
        "author": "nightastheold",
        "body": "had a 1.6k dayooooo bros.\n\nclosed the rest of those NVDA weekly poots, just gonna hang on the monthlies and closed some more IWM calls.",
        "created_utc": 1630607540,
        "id": "hbcj5pi",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630636340.0
    },
    {
        "author": "mMounirM",
        "body": "NVDA going up!!! the rope is back in the closet",
        "created_utc": 1630677705,
        "id": "hbg4ju6",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630706505.0
    },
    {
        "author": "UtsavTiwari",
        "body": "I think amd and nvidia both would be sitting in 7-9 position.",
        "created_utc": 1630686162,
        "id": "hbgosk6",
        "score": 8,
        "subreddit": "StockMarket",
        "created": 1630714962.0
    },
    {
        "author": "ktempo",
        "body": "I'm so glad that for the past 5 years, I've been buying NVDA weekly. Holy shit this is amazing.",
        "created_utc": 1630689371,
        "id": "hbgwjhq",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1630718171.0
    },
    {
        "author": "SirGasleak",
        "body": "You shouldn't make your decisions to buy based on the price of the stock by itself.  You need to dig deeper, look into some valuation metrics.  One thing to consider is that history has shown that stocks with high P/S ratios tend to underperform over time because that means the stock is already pricing in strong future growth.  As soon as that growth slows, the price takes a hit.  That's why you see so many high flying popular stocks selling off big on earnings these days.  With a P/S of 25, NVDA is up there - not crazy high, but up there.  That doesn't mean it is due for a selloff any time soon, but it does mean your upside from these levels is somewhat limited.",
        "created_utc": 1630595606,
        "id": "hbbpd8l",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630624406.0
    },
    {
        "author": "birdstwin",
        "body": "Also added AMZN during the dip. Going to get some Apple, Microsoft, nvidia, visa, Disney next.",
        "created_utc": 1630677501,
        "id": "hbg42zd",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630706301.0
    },
    {
        "author": "iratherpeeoutside",
        "body": "NVDA/APPL/PYPL/SQ/AMZN/JPM/PLTR\n\nHolding until retirement.",
        "created_utc": 1630761085,
        "id": "hbkcgb5",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630789885.0
    },
    {
        "author": "nightastheold",
        "body": "Thanks man! \n\nI’m actually pretty cautious right now, I took profits on some longer dates calls this past month. Also in some NVDA poots. \nIt’s hard to say, could lighten up on positions to have more cash, at least what I’m up to, \n\nGood luck and thanks for reading!",
        "created_utc": 1630623327,
        "id": "hbdkicq",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630652127.0
    },
    {
        "author": "digitalwriternow",
        "body": "If you are thinking in near term like the multi bagger speed as a meme stock, you are right. But let me remind you that Apple is a two-bagger in the last three years and had an even bigger marketcap than Nvidia in that time. And it's not like Apple had produced a mind blowing technology.",
        "created_utc": 1630831910,
        "id": "hbo1ky3",
        "score": 7,
        "subreddit": "stocks",
        "created": 1630860710.0
    },
    {
        "author": "thepunnman",
        "body": "i really need nvda to come back to 227+ by friday please",
        "created_utc": 1630528013,
        "id": "hb8cp6g",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1630556813.0
    },
    {
        "author": "CuriousDev1012",
        "body": "AAPL, MSFT, NVDA",
        "created_utc": 1630637201,
        "id": "hbedw1a",
        "score": 7,
        "subreddit": "options",
        "created": 1630666001.0
    },
    {
        "author": "TomWaah",
        "body": "VIX, MRNA, EDIT, GSAT, APPL, GOOG, NVIDIA, GME (if you plan to buy today or tomorrow)",
        "created_utc": 1630569807,
        "id": "hbai288",
        "score": 6,
        "subreddit": "RobinHood",
        "created": 1630598607.0
    },
    {
        "author": "ptwonline",
        "body": "10 years is a long time.  If I had to guess:\n\nSaudi Aramco\n\nFacebook\n\nTesla\n\nJP Morgan\n\nNVIDIA\n\n\nI don't think any of them will fail or drop dramatically (well, Tesla might fall a lot).  Just not grow at the same rate as some other companies and get overtaken.",
        "created_utc": 1630674671,
        "id": "hbfxxii",
        "score": 6,
        "subreddit": "StockMarket",
        "created": 1630703471.0
    },
    {
        "author": "iopq",
        "body": "Sorry to burst your bubble, but this company is a marketer of common components. Like they don't make their own power supplies, they have another company make it and they just paint it over with whatever color they like and slap the Corsair logo on it.\n\nThey make their own keyboards, but my wireless keyboard is shitty, after I charge it it stops working until I try turning it on and off again.\n\nAre they going to make money? Yes. But they are basically cashing in on the brand image, not really putting out great products. They are in a commodity market where you can just buy a different brand and there will be no problem. I can't just buy something other than Nvidia - my CUDA code won't work. But I can buy any brand mouse, PSU, headphones, keyboard.\n\nI'm not saying you won't make money with this stock - you will. But temper your expectations. This isn't gamestop that was shorted to near 0. This is a fairly valued company that will continue to do well and go up.",
        "created_utc": 1630643713,
        "id": "hbeq8nr",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1630672513.0
    },
    {
        "author": "kemar7856",
        "body": "I swear my portfolio should have been 100% nvda",
        "created_utc": 1630688606,
        "id": "hbgupyw",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1630717406.0
    },
    {
        "author": "SnipahShot",
        "body": "And to add on top of that Intel finally put their foot in the gaming GPU market for the first time. Regardless of how good Alchemist will be, it will take profits from AMD and Nvidia, especially if it is as good as they make it sound.",
        "created_utc": 1630914900,
        "id": "hbsavdb",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630943700.0
    },
    {
        "author": "apooroldinvestor",
        "body": "Wow you must be a multi millionaire!  NVDA and GOOGL and MSFT too!",
        "created_utc": 1630794984,
        "id": "hbmdzyy",
        "score": 6,
        "subreddit": "stocks",
        "created": 1630823784.0
    },
    {
        "author": "apooroldinvestor",
        "body": "MSFT NVDA AAPL GOOGL ASML UNH HD",
        "created_utc": 1630700914,
        "id": "hbhn3al",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630729714.0
    },
    {
        "author": "toydan",
        "body": "Way cool Lace! \n\nWill be adversaries on NVDA 😢 as I am in it pretty heavy and going to make more bull plays.",
        "created_utc": 1630608028,
        "id": "hbckdq9",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630636828.0
    },
    {
        "author": "wilciws",
        "body": "Nvidia makes graphics cards.",
        "created_utc": 1630528149,
        "id": "hb8d1az",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630556949.0
    },
    {
        "author": "dreamsushi",
        "body": "[\\+$1.9k playing NVDA pullback](https://imgur.com/a/9PfAYB6)\n\nThis went my way a lot quicker than I thought it would, probably should have held a little longer but its Friday and I'm trying to hangout by the pool and not look at charts lmao. Hope you guys are having a good morning and all your otms go itm and you make lots of money&lt;3",
        "created_utc": 1630680700,
        "id": "hbgbkyo",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630709500.0
    },
    {
        "author": "nightastheold",
        "body": "hahaaaa, NVDA put monthlies are back in the port. Blessith SeptemBear.\n\nFor real though fuck analysts, I swear some of these MM's or funds have got to be slipping them some money from time to time. \n\nI've gotten fucked by analysts and china more times than I'd like to admit.",
        "created_utc": 1630694435,
        "id": "hbh8f3m",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630723235.0
    },
    {
        "author": "MineConsistent20845",
        "body": "This sub said net was overvalued at 90. This sub said nvda was overvalued at 700. I could go on. \nInstead they try to catch the falling knife with China stocks or manage to be bagholders (sofi and all kinds of other pump and dumps) in the biggest bull market of all time. \nMost people here seem to dislike making money so I'd just do my own research",
        "created_utc": 1630847530,
        "id": "hboloy2",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630876330.0
    },
    {
        "author": "dhpw2",
        "body": "**Main Portfolio:**  \nApple  \nMicrosoft  \nVisa  \nMastercard  \nFacebook  \nAlibaba  \nSquare  \nAMD  \n\n\n**Long shots/Play portfolio:**  \nPalantir  \nVirgin Galactic  \nGamestop  \nBlackberry  \nInvitae  \n\n\n**Looking to add in, in the future**  \nTaiwan Semiconductor  \nDisney  \nCostco  \nCoinbase  \nTesla  \nNvidia  \nJPMorgan  \nApplied Materials",
        "created_utc": 1630489444,
        "id": "hb62btv",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630518244.0
    },
    {
        "author": "nightastheold",
        "body": "mwaahahahahaha\n\nbuy calls on NVDA I dare you",
        "created_utc": 1630590147,
        "id": "hbbcku0",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630618947.0
    },
    {
        "author": "FunkMetal804",
        "body": "I hope AMD will get to 600 before NVDA does. NVDA to 600 would be around 2,400 per share considering the pre split value? I bet NVDA felt compelled to split because AMD looked like a much better value for a fraction of the share price. Both companies have seen comparable revenue growth over the past few years. AMD stock trades at 11x trailing revenues compared to around 25x for NVDA....",
        "created_utc": 1630522817,
        "id": "hb7zufh",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630551617.0
    },
    {
        "author": "StabbyPants",
        "body": "get a load of mr moneybags NVDA with it's 0.07% yield",
        "created_utc": 1630887009,
        "id": "hbqz5mm",
        "score": 5,
        "subreddit": "investing",
        "created": 1630915809.0
    },
    {
        "author": "Difficult-Garage8985",
        "body": "Just means a huge huge amount of demand for the chips will drop off and I mean huge. Eth mining accounts for almost all (I think it's like 90% plus) gpu crypto mining and those rigs will suddenly become worthless. Even if the used market doesn't cause so much trouble, the sudden drop-off in demand will reduce revenues for NVDA. I must say I'm not well read enough on NVDAs revenue streams to know for sure how big a chunk of their pie this would equate to. Just something to consider that doesn't get discussed much in more stocks-focused forums.",
        "created_utc": 1630916929,
        "id": "hbsd7l1",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630945729.0
    },
    {
        "author": "TaxGuy_021",
        "body": "AMD and Nvidia dont have an insurmountable lead. They are ahead of Intel for sure for now, but I believe intel has what it takes to get back in the game.",
        "created_utc": 1630866603,
        "id": "hbprfhq",
        "score": 5,
        "subreddit": "investing",
        "created": 1630895403.0
    },
    {
        "author": "ligmah91",
        "body": "Done trading for today. Down 2% today and up 108% for the week thanks to NVDA. Hope you guys have a nice weekend",
        "created_utc": 1630690292,
        "id": "hbgyr6n",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630719092.0
    },
    {
        "author": "mMounirM",
        "body": "someone tell me NVDA is going back above 225 tomorrow",
        "created_utc": 1630611517,
        "id": "hbct5v9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630640317.0
    },
    {
        "author": "meowman3000",
        "body": "Intel is getting government money to setup fabs in the US, as part of an infrastructure bill.  I could see them treating TSMC like they do Huawei in the future if Intel gets enough capacity.  I could see a strong case for national security, in which case Nvidia and AMD would shift to Intel, assuming the fabs are competitive.\n\nA small chance at least.",
        "created_utc": 1630637279,
        "id": "hbee1ue",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630666079.0
    },
    {
        "author": "GADHP",
        "body": "NVDA 260 EOD",
        "created_utc": 1630586667,
        "id": "hbb57ot",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630615467.0
    },
    {
        "author": "BLOW_0",
        "body": "I love my amd &amp; nvidia Bags",
        "created_utc": 1630576941,
        "id": "hbaq1t5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630605741.0
    },
    {
        "author": "iSovereign",
        "body": "Well my account went from -20% to +50% on NVDA calls today",
        "created_utc": 1630683712,
        "id": "hbgiuuc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630712512.0
    },
    {
        "author": "UltimateTraders",
        "body": "Well NVDA has been on a tear!\nEveryone has a different strategy and portfolio size my friend",
        "created_utc": 1630852334,
        "id": "hbov9sq",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630881134.0
    },
    {
        "author": "ENRONsOkayestAdvice",
        "body": "I think people need to refresh or educate themselves on the differences between a shortage and a change in the demand curve.  And how this impacts prices.  Investors and traders need to ask themselves is the price going up because of inflation, or is the systemic change in demand due to lifestyle changes as a result of COVID?  If people can’t drink themselves silly at a bar, are they now buying cars, good equipment, computer games, and other things with money that would have been spent at the bar? \n\nExample “chip shortages”. Nothing mentioned in the $NVDA about a shortage, just excessive demand and not being able to keep up with production.  \n\nAdditionally, many companies have dug themselves into a hole and aren’t owning up to their mistake (automakers).  They cut production at the beginning of COVID and we are literally paying for their mistake by not being patient.  It’s also a fault of inventory management system like “Just In Time Inventory management (JTM) where it assumes the supply chain won’t have major interruptions in the supply chain.  I am sure several industries are going through the same pains.",
        "created_utc": 1630789300,
        "id": "hbm20e8",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630818100.0
    },
    {
        "author": "TheOriginalBushToad",
        "body": "Puts on NVDA, calls on AMD!",
        "created_utc": 1630628457,
        "id": "hbdvahl",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630657257.0
    },
    {
        "author": "nightastheold",
        "body": "Nvidia just fucking die omg. Reeeeeeeeéëèe",
        "created_utc": 1630673912,
        "id": "hbfwed7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630702712.0
    },
    {
        "author": "GeezWhizGuys",
        "body": "NVDA=RollTide. Perennial champs",
        "created_utc": 1630687522,
        "id": "hbgs3t5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630716322.0
    },
    {
        "author": "Electrical-Path-9618",
        "body": "Come on NVDA you sick fuck",
        "created_utc": 1630506041,
        "id": "hb6uys1",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630534841.0
    },
    {
        "author": "tmoney_99",
        "body": "NVDA let’s have a 4% day",
        "created_utc": 1630502898,
        "id": "hb6nvwg",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630531698.0
    },
    {
        "author": "lurkman_420",
        "body": "NVDA 30%\nSWBI 13%\nAMD 11%\nMSFT 10%\nCARR 9%\nAAPL 7%\nHIMX 5%\nAMKR &lt;5%\nTSM &lt;5%\nRBBN &lt;5%\nECOM &lt;5%",
        "created_utc": 1630510510,
        "id": "hb75oof",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630539310.0
    },
    {
        "author": "Slaxle",
        "body": "My portfolio:\nFunds:\nFSKAX - 33.43% (TOTAL MARKET)\nFSELX - 12.07 (SEMICONDUCTOR)\nFBGRX - 7.02% (BLUE CHIP)\n\nPAYPAL - 18.15%\nSOFI - 10.02%\nAMD - 3.49%\nMU - 6.96%\nFree cash - 8.85%\n\nI want to get some hidings in NVIDIA, TSM, and ASML to round off my semiconductors. Get some SQ to polish off my Fintech. Just looking for good prices.\n\nNew investments I'm looking at for fall 2021 - Industrials (xli) online retail (Amazon and IBUY)",
        "created_utc": 1630516106,
        "id": "hb7jgjh",
        "score": 4,
        "subreddit": "stocks",
        "created": 1630544906.0
    },
    {
        "author": "PrincPaco",
        "body": "Some Thetagang post came across as I was scrolling. Dude crying cuz he sold CCs on NVDA at 215. If his shares get called away the taxes on his 700% gainz are gonna wipe out all his increase so far for the year. When I make 700% I pony up for the tax man then pick out what color Lambo you're getting. WtF is wrong with those guys?",
        "created_utc": 1630805420,
        "id": "hbmycqc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630834220.0
    },
    {
        "author": "xraygoth",
        "body": "Holy NVDA with that rocket back to $229",
        "created_utc": 1630688821,
        "id": "hbgv8k8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630717621.0
    },
    {
        "author": "davidbigham",
        "body": "NVDA , plz moon up for no reason .",
        "created_utc": 1630599368,
        "id": "hbbylcm",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630628168.0
    },
    {
        "author": "ThrowAwayhfhdjhxnjd",
        "body": "NVDA will hit 250 next week\n\nI had a dream. Felt real. That's my DD\n\nThank you for reading",
        "created_utc": 1630704426,
        "id": "hbhuvp5",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630733226.0
    },
    {
        "author": "davidbigham",
        "body": "Step NVDA i need you to do something.",
        "created_utc": 1630519474,
        "id": "hb7rq0p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630548274.0
    },
    {
        "author": "FinancialRub6814",
        "body": "How do I get in the yacht club? Do I need to share my portfolio from buying AMD shares at for less than $3 a piece and Nvidia shares for $45?",
        "created_utc": 1630509113,
        "id": "hb72afv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630537913.0
    },
    {
        "author": "digitalwriternow",
        "body": "Nvidia is the best in Artificial Intelligence by far.",
        "created_utc": 1630561555,
        "id": "hba7o14",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630590355.0
    },
    {
        "author": "Tersiv",
        "body": "You’re speaking to a man who sold NVDA at $250 pre split so don’t worry",
        "created_utc": 1630539007,
        "id": "hb90ck7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630567807.0
    },
    {
        "author": "GraysonMA",
        "body": "When you buy leaps you are taking on a lot of vega exposure which can add significant risk to your portfolio. However, vega gives you a second way to win if you stick to companies that have IVR/IV% near their 52 week lows. [Barchart is a great resource for finding these.](https://www.barchart.com/options/iv-rank-percentile/stocks?orderBy=optionsWeightedImpliedVolatility&amp;orderDir=asc)\nI also choose underlyings that have low correlation with each other. This keeps things a little less volatile which is especially important using any type of leverage. [PortfolioVisualizer has a great tool for this.](https://www.portfoliovisualizer.com/asset-correlations?s=y&amp;symbols=SPY+TLT+KO+PG+D+INTC+MCD+VZ+FB+MSFT+NVDA+LLY+NEE&amp;timePeriod=2&amp;tradingDays=60&amp;months=36). Leaps I bought recently are in PG, INTC, FB, D, MSFT, KO, VZ, and MCD. LLY is an solid low correlation pick but I’m waiting for a dip in IV.",
        "created_utc": 1630675696,
        "id": "hbg03gf",
        "score": 3,
        "subreddit": "options",
        "created": 1630704496.0
    },
    {
        "author": "four1six_",
        "body": "Hahaha I think when MU was being hyped by wsb back in the day made me never want to play it! I liked both AMD and NVDA though. AMD maybe some LEAPs would be an idea.\n\nEnjoying a cider, just did a giant shop and filled out the fridge. Feeling good bud. How's about you?",
        "created_utc": 1630799526,
        "id": "hbmmxhy",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630828326.0
    },
    {
        "author": "Inferno456",
        "body": "UPST NET NVDA SE are great companies that only seem to go up from these past few months",
        "created_utc": 1630861682,
        "id": "hbpgbsx",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630890482.0
    },
    {
        "author": "digitalwriternow",
        "body": "Enphase (solar panel technology and batteries) and Nvidia ( no presentation needed, but artificial intelligence is what will propel it to multibagger status, despite it seems expensive right now).",
        "created_utc": 1630828538,
        "id": "hbnxrfs",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630857338.0
    },
    {
        "author": "SomalianStockBroker",
        "body": "I can’t relate brother.. I had $150 nvidia leaps I sold likes dumb ASS",
        "created_utc": 1630732141,
        "id": "hbjbft5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630760941.0
    },
    {
        "author": "POWRAXE",
        "body": "VOO QQQ APPL MSFT NVDA GOOGL AMZN AMD. Buy these now, add to them often, sit on them until retirement, be rich.",
        "created_utc": 1630726072,
        "id": "hbj1l3b",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630754872.0
    },
    {
        "author": "imsilver4fukyou",
        "body": "when you had choice to do 230 0dte nvda or hop on ironnet, and you pick nvda 🥴",
        "created_utc": 1630703589,
        "id": "hbht204",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630732389.0
    },
    {
        "author": "SnobCooky01",
        "body": "No it's not too late. I started at about 60 and over the pandemic I've got into it more. Doing very nicely. Don't forget the dividend shares you can buy more shares every quarter. I'm a long term investor. AAPL, KO, NVDA and an investment I can't mention here. Worst comes to worse I'll leave it to my children.\nEd. I would keep well away from WSB.",
        "created_utc": 1630872606,
        "id": "hbq4w87",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630901406.0
    },
    {
        "author": "sperrjo",
        "body": "NVDA is so high up tho, MU could be a good buy, SNAP still up, ETSY still up. I want something that’s dipped",
        "created_utc": 1630629171,
        "id": "hbdwszp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630657971.0
    },
    {
        "author": "JackB4Ucryptostonkrs",
        "body": "Top Semi I own, but also like Broadcom and NVIDIA",
        "created_utc": 1630621698,
        "id": "hbdgyvf",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630650498.0
    },
    {
        "author": "agyria",
        "body": "What are some good long term holds? I have AMZN, SQ, NVDA, and MSFT\n\nEdit; NET as well",
        "created_utc": 1630623149,
        "id": "hbdk4m0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630651949.0
    },
    {
        "author": "RockeManTT",
        "body": "I agree with everything you just said. Margin is pretty easy to use in a market like this. But TSLA has a higher cash requirement. And I don’t think TSLA can ever repeat 2020. Too many catalysts that won’t be repeated.. like the short squeeze and the SP inclusion. On the margin.. I use it a lot.. but I’ve been long on GOOGL and NVDA since May.. and up a lot. So the margin pays for itself and more. I think market will tank 4th week of Sept.. then shaky Oct. Back up for Nov-Jan. We’re for sure gonna hit some corrections. Idk I still think Tech is gonna keep running up and looks like SPY too. That’s only gonna help TSLA. We’ll see what happens..",
        "created_utc": 1630543137,
        "id": "hb98wso",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630571937.0
    },
    {
        "author": "RADIO02118",
        "body": "That’s what I’ve been watching. Options volume at open. Calls bought at the market or near the ask, which suggests retail buying.\n\nAnd you’re right. It’s 100% tech. AAPL is actually the perfect example of what I’m talking about. You can see it in NVDA, TSLA and MSFT as well. Take a look!",
        "created_utc": 1630544232,
        "id": "hb9bb8q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630573032.0
    },
    {
        "author": "Full-Synthetic",
        "body": "If video card prices and crypto keep rising I bet Nvidia breaks 1T within the next 5 years",
        "created_utc": 1630686970,
        "id": "hbgqrds",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1630715770.0
    },
    {
        "author": "BLOW_0",
        "body": "Nvidia bags Are off",
        "created_utc": 1630689190,
        "id": "hbgw45p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630717990.0
    },
    {
        "author": "tmoney_99",
        "body": "NVDA let’s revive my 232 calls lol",
        "created_utc": 1630685552,
        "id": "hbgnb0y",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630714352.0
    },
    {
        "author": "tmoney_99",
        "body": "Go ahead NVDA kiss off 225 like you have all week dumb whore",
        "created_utc": 1630595955,
        "id": "hbbq89r",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630624755.0
    },
    {
        "author": "underling1978",
        "body": "There was no way to guess that though. I picked nVidia and am up 26% over the last 3 months. I picked them because they are a solid company with a good plan forward, but had no idea they were going to perform that well. Also picked Apple and Microsoft which are both solid, though not performing as well as nVidia for now. \n\nAs you said XIT is great for exposure to tech stock. I may choose it for one of my accounts. In TEC in my TFSA for tech exposure for now.",
        "created_utc": 1630718780,
        "id": "hbinxcl",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1630747580.0
    },
    {
        "author": "AdministrativeYard",
        "body": "Nvidia about to run",
        "created_utc": 1630503257,
        "id": "hb6on8l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630532057.0
    },
    {
        "author": "JoanOfSnarke",
        "body": "I'm risking an ARM and a leg with this NVDA merger play.",
        "created_utc": 1630513564,
        "id": "hb7d6gk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630542364.0
    },
    {
        "author": "aioliravioli",
        "body": "the next obvious company to hit 1 trillion is nvidia. It's that easy",
        "created_utc": 1630532792,
        "id": "hb8nnqv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630561592.0
    },
    {
        "author": "jd_sleepypillows",
        "body": "Even better, buy Puts, sell shares short then slip Cramer a crisp $50 and tell him to bash a stock for a week.\nReverse position once it’s fallen, get Mama Cathy to tel everybody she’s buying.\n\nClose position. Everybody wins\nInvesting is easy",
        "created_utc": 1631458119,
        "id": "hckguqi",
        "score": 12,
        "subreddit": "options",
        "created": 1631486919.0
    },
    {
        "author": "LostLifeSavingsOnGME",
        "body": "That’s what I’m trying to tel myself. Idk why I wanted to play spy 2DTE with my entire account. Learnt my lesosn",
        "created_utc": 1630527960,
        "id": "hb8ckhx",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1630556760.0
    },
    {
        "author": "Hairy_CoinPurse",
        "body": "Bro please tel us what you listen to, I’m dying to know",
        "created_utc": 1630647109,
        "id": "hbevn6l",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1630675909.0
    },
    {
        "author": "brandenbenjamin12",
        "body": "Just want to insert a company worth looking into from Tel Aviv, IS (ironsource Ltd.) I don’t know too much about them other than it has great revenue, cheap, huge volume with a nice chart to boot.  Great analysis as always.",
        "created_utc": 1631329580,
        "id": "hce6hiw",
        "score": 3,
        "subreddit": "stocks",
        "created": 1631358380.0
    },
    {
        "author": "ICKTUSS",
        "body": "I haven’t looked at the market all week, who wants to tel me why my GOOGL plunged",
        "created_utc": 1631909627,
        "id": "hd8z23r",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1631938427.0
    },
    {
        "author": "redratus",
        "body": "Of the chiense stocks nio is the one im most bullish on (prob tied with baba)…thosetwo are pretty much the oly ones il touch.\n\nwhy? NIO has a collaboration with intel and israel to make an autonomous taxi, i think theyre currently testing it in tel a viv and berlin. Nio is the hidden gem ( praps not so hiddne) of chinese stocks",
        "created_utc": 1631941881,
        "id": "hdar1i2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1631970681.0
    },
    {
        "author": "graham2100",
        "body": "In the very long term terrible investors probably regress to the mean, i.e. index funds, except (i) when they go broke sooner and (ii) at higher costs than your typical Vanguard TER. \n\nValue investors may recognize their is no need to be invested all of the time. Buffett currently keeps large amounts of cash not seeing anything of value.",
        "created_utc": 1630509710,
        "id": "hb73qjk",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630538510.0
    },
    {
        "author": "CannaVestments",
        "body": "Unfortunately at this point there aren't many licenses left to buy as most are owned by public operators. GTI/Verano/Acreagw/TER/CC/AWH/AYR/Cura are 8 of the  12, Ianthus likely trying to hold theirs, Jusrice Grown (private MSO) likely not an option, not sure of the other 2 but I bet everyone approached them to sell. There has been several dozen (I figure the exact number) licenses held up in court since 2019 so perhaps they are waiting on those as well. \n\nStill time but a head start helps a lot",
        "created_utc": 1630550031,
        "id": "hb9nki9",
        "score": 2,
        "subreddit": "weedstocks",
        "created": 1630578831.0
    },
    {
        "author": "poopANDweed",
        "body": "I would say this is a good premium for Gage. It’s a stock deal and TER stock has been crushed since they said they will miss their 2021 forecast. The reason TERs stock tanked is a short term problem (lower yields/quality due to grow expansion), so Gage actually got a pretty good deal relative to where the two stocks were trading a month ago.",
        "created_utc": 1630543237,
        "id": "hb994r6",
        "score": 2,
        "subreddit": "weedstocks",
        "created": 1630572037.0
    },
    {
        "author": "trilogee",
        "body": "Ter and gage both halted. Very likely to be a buyout announcement.",
        "created_utc": 1630498973,
        "id": "hb6g54v",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1630527773.0
    },
    {
        "author": "Mister_Rahool",
        "body": "Can someone explain to me why GAGE is doing nothing and TER is slightly down with the buy being a 17% premium on current prices?",
        "created_utc": 1630506816,
        "id": "hb6wske",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1630535616.0
    },
    {
        "author": "Zannierer",
        "body": "1. Dragon Capital picked the right time to introduce E1VFVN30 though. The last 5 years did saw very serious double digit gains, but the 5 years before it were stagnant, hence lower than expected decade gains. However this could still be a good sign for what to come, if all those reports on Vietnamese market being undervalued is right.\n\n2. You're right, I need to look past the crashes, but the market is still young so that's an addtional risk.\n\n3. I've read that larger NAV correlates with lower TER and it seems to be the case for the mentioned ETFs. \n\nAnyway, thanks for the input.",
        "created_utc": 1630480582,
        "id": "hb5sbs1",
        "score": 1,
        "subreddit": "investing",
        "created": 1630509382.0
    },
    {
        "author": "mr_molecular",
        "body": "To play the arbitrage, people short TER and buy GAGE. As long as the deal closes, they will earn the 15% arb, regardless of what price TER is at when the deal finalizes. It will probably take nearly 6 months to finalize, 15% in 6 months isn't bad, but there may be better opportunities.",
        "created_utc": 1630507276,
        "id": "hb6xvzs",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1630536076.0
    },
    {
        "author": "NiamorJafar",
        "body": "TER and Gage halted.   Very interesting.",
        "created_utc": 1630498982,
        "id": "hb6g5qt",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1630527782.0
    },
    {
        "author": "trilogee",
        "body": "I wasn't aware that Linton was even involved in TER? As far as I know his only involvement was inking the deal with CGC and ter at the time but no current involvement/position right? Jw is the bigger and obvious connection. I'll eat my tshirt if this isn't an m&amp;a announcement",
        "created_utc": 1630499661,
        "id": "hb6he9g",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1630528461.0
    },
    {
        "author": "mr_molecular",
        "body": "Usually 3 to 4 months, since there will be no complicated issues integrating Gage, which only has assets in Michigan into TER; which does not have any Michigan assets.\n\nCresco/Bluma took 3 months plus another week or so for the shares to actually convert.",
        "created_utc": 1630514533,
        "id": "hb7fkfo",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1630543333.0
    },
    {
        "author": "wabty",
        "body": "Double dipping on the TER. Clever!",
        "created_utc": 1630509173,
        "id": "hb72fmr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630537973.0
    },
    {
        "author": "Mister_Rahool",
        "body": "right just surprised by the lack of volatility, TER giving up 1/3rd the company like HEXO",
        "created_utc": 1630515219,
        "id": "hb7haj6",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1630544019.0
    }
]