[
    {
        "author": "up_the_dubs",
        "body": "The deal with Microsoft....",
        "created_utc": 1623264796,
        "id": "h16qph9",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16qph9/",
        "score": 605,
        "subreddit": "investing",
        "created": 1623293596.0
    },
    {
        "author": "coolcomfort123",
        "body": "Waiting for msft to hit $300 this year.",
        "created_utc": 1623351494,
        "id": "h1bb68s",
        "permalink": "/r/stocks/comments/nws8lb/microsoft_is_developing_new_hardware_to_bring_its/h1bb68s/",
        "score": 367,
        "subreddit": "stocks",
        "created": 1623380294.0
    },
    {
        "author": "Purple-Ad-3492",
        "body": "What's the deal with Microsoft?",
        "created_utc": 1623266874,
        "id": "h16vuto",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16vuto/",
        "score": 294,
        "subreddit": "investing",
        "created": 1623295674.0
    },
    {
        "author": "flyhighy",
        "body": "Microsoft keep finding acquisition targets. Some fail, some will bring future growth. \n\nApple has a hard time deciding what to do with almost $200bn of cash and $100bn FCF every year.",
        "created_utc": 1622862851,
        "id": "h0nab41",
        "permalink": "/r/stocks/comments/nsjp6c/microsoft_wins_us_antitrust_okay_for_16_billion/h0nab41/",
        "score": 209,
        "subreddit": "stocks",
        "created": 1622891651.0
    },
    {
        "author": "jebronnlamezz",
        "body": "Microsoft  apple Netflix",
        "created_utc": 1623376760,
        "id": "h1cs1ct",
        "permalink": "/r/wallstreetbets/comments/nwxthn/the_two_trades_that_sent_me_to_the_moon_and_have/h1cs1ct/",
        "score": 205,
        "subreddit": "wallstreetbets",
        "created": 1623405560.0
    },
    {
        "author": "-Paradox-11",
        "body": "Honestly? $MSFT (as lame as that sounds). They have their hands in everything, and the pandemic only strengthened their position. With new military contracts in the pipeline, a booming gaming division, cloud computing, the ability and cash to buy new/emerging companies -- I just don't see Microsoft losing.",
        "created_utc": 1625018020,
        "id": "h3igf3i",
        "permalink": "/r/stocks/comments/oai5jy/what_are_your_highest_conviction_plays_for_the/h3igf3i/",
        "score": 188,
        "subreddit": "stocks",
        "created": 1625046820.0
    },
    {
        "author": "up_the_dubs",
        "body": "https://news.microsoft.com/2020/10/08/gamestop-announces-multiyear-strategic-partnership-with-microsoft/",
        "created_utc": 1623267632,
        "id": "h16xq4y",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16xq4y/",
        "score": 145,
        "subreddit": "investing",
        "created": 1623296432.0
    },
    {
        "author": "Fwellimort",
        "body": "Who knows if MSFT might be a 20+ trillion dollar company in my lifetime.\n\nThere once was a time when 500 billion dollar market cap was considered 'too high'. Then 1 trillion dollars.\n\nI have a long lifetime left. Who knows what the future holds.",
        "created_utc": 1624394468,
        "id": "h2oytzo",
        "permalink": "/r/stocks/comments/o5w8ta/msft_closes_at_2_trillion_as_second_us_company/h2oytzo/",
        "score": 140,
        "subreddit": "stocks",
        "created": 1624423268.0
    },
    {
        "author": "AceOrigins",
        "body": "that spy call and the msft one sent so many people in the dump lmao",
        "created_utc": 1623357601,
        "id": "h1bpd2q",
        "permalink": "/r/wallstreetbets/comments/nwxthn/the_two_trades_that_sent_me_to_the_moon_and_have/h1bpd2q/",
        "score": 139,
        "subreddit": "wallstreetbets",
        "created": 1623386401.0
    },
    {
        "author": "SnooCrickets2458",
        "body": "No, but Microsoft, Apple, and Disney are.",
        "created_utc": 1622701623,
        "id": "h0es6fg",
        "permalink": "/r/stocks/comments/nr1dkn/beware_of_what_amc_shorts_are_holding/h0es6fg/",
        "score": 137,
        "subreddit": "stocks",
        "created": 1622730423.0
    },
    {
        "author": "Samcrow15",
        "body": "So what you’re telling me is I don’t have to put up with 3X MSRP for computer parts for something I now play casually and instead purchase a plug and play subscription model? Yeah I think that might work lol. \n\nThe problem with Stadia is no support for 1440p and the graphics are moderate. If Microsoft develops this technology to match the hardware in my room, say goodbye to me building any future pc’s. Looking at the comments there’s not many gamers in here lol.",
        "created_utc": 1623353511,
        "id": "h1bg2fu",
        "permalink": "/r/stocks/comments/nws8lb/microsoft_is_developing_new_hardware_to_bring_its/h1bg2fu/",
        "score": 137,
        "subreddit": "stocks",
        "created": 1623382311.0
    },
    {
        "author": "jimsturkey",
        "body": "There is some reason to be skeptical that they can ever reach their current valuation though. Gaming industry will be all about market share. GME has a ton of opportunity and is in a great position to acquire a large part of future market share but nothing is guaranteed. Microsoft is making it increasingly difficult to need any middle man in its products for instance. Games are downloaded straight to Xbox, same with Playstation and Steam on PC. Microsoft and Netflix are also entering the cloud gaming space. Facebook, Microsoft, Sony, and others are all chasing VR.\n\nSo there are some legitimate concerns. A lot GME could do, especially in emerging tech spaces like VR/AR/E-Sports. I love the idea of them acquiring Corsair somehow. Elgato and SCUF are fantastic brands. They'll have to do a lot more than that to maintain a $21B market cap though.\n\nI'm not a bear and I don't own any GME. I just like gaming. Always good to keep an eye on the downsides of the stocks you own though. Unbridled optimism usually creates bag holders.",
        "created_utc": 1624373214,
        "id": "h2nnj1s",
        "permalink": "/r/wallstreetbets/comments/o5k4w3/gamestop_completes_atthemarket_equity_offering/h2nnj1s/",
        "score": 134,
        "subreddit": "wallstreetbets",
        "created": 1624402014.0
    },
    {
        "author": "ModernBuddha1",
        "body": "The author of the yahoo article is an idiot. He purposely used a phone pic for front page. 99% of idiots writing blackberry articles have no clue that BB has transformed into pure software play. They have no clue that BB provides best ai based cybersecurity in the WORLD..unmatched! Entire US gov started using it and more so after the solarwind and microsoft hack. No american company has this ai technology that protects against all cyber threat! they control the entire car software operating system and about to provide a data analystics layer to all the cars and iot. this stock should be $150 today!!! in 5-7 years it will be over $700.",
        "created_utc": 1623265163,
        "id": "h16rmi1",
        "permalink": "/r/wallstreetbets/comments/nvzofc/blackberry_bb_has_confirmed_their_partnership/h16rmi1/",
        "score": 129,
        "subreddit": "wallstreetbets",
        "created": 1623293963.0
    },
    {
        "author": "msnebjsnsbek5786",
        "body": "You're not thinking about it correctly.\n\nWhen I was buying AAPL a few years ago, their dividend yield was higher than it is now despite the fact that they've raised their dividend every year since I originally bought it. So my dividend yield is lower but my cost basis dividend yield is higher.\n\nIt's not that MSFT doesn't pay a lot of dividends, it's that their dividends/future dividends are so highly coveted that it makes the yield look low. \n\nHere's an example: Buffett bought KO between 1988-1994 for a total cost of $1.3B. Since then Buffett has made $8.5B in total dividends. They will pay out $672M in dividends to Berkshire this year on an investment of $1.3B. KO only has a 3% dividend yield, but that is irrelevant because the cash on cash return doesn't care about current unrealized gains. \n\nSo let's say you bought MSFT exactly ten years ago at $23.71, then your cost basis dividend yield would be 9.2%. \n\nMost importantly, you wouldn't have to sell shares to receive that payment. That's the problem with appreciation, you have to sell a productive asset (shares) in order to receive an unproductive asset (cash), and even worse, the cash value for your shares is net taxes. Dividends are also net taxes but you didn't have to sell an asset to get them.",
        "created_utc": 1623445533,
        "id": "h1g5bbc",
        "permalink": "/r/stocks/comments/nxp7y7/what_is_the_point_of_1_dividends/h1g5bbc/",
        "score": 117,
        "subreddit": "stocks",
        "created": 1623474333.0
    },
    {
        "author": "Timirlan",
        "body": "Yeah, Microsoft",
        "created_utc": 1622870615,
        "id": "h0nmis8",
        "permalink": "/r/stocks/comments/nsjp6c/microsoft_wins_us_antitrust_okay_for_16_billion/h0nmis8/",
        "score": 116,
        "subreddit": "stocks",
        "created": 1622899415.0
    },
    {
        "author": "FreakyEcon",
        "body": "Amazing how the sheep are so out of their fucking minds to think GME and MSFT are even close to comparable.  Now downvote me GME sheep",
        "created_utc": 1624396147,
        "id": "h2p2h1h",
        "permalink": "/r/investing/comments/o5w9xy/msft_closes_at_2_trillion_as_second_us_company/h2p2h1h/",
        "score": 103,
        "subreddit": "investing",
        "created": 1624424947.0
    },
    {
        "author": "bbq54",
        "body": "I just accepted an offer from Microsoft! So happy :)",
        "created_utc": 1624402276,
        "id": "h2peore",
        "permalink": "/r/investing/comments/o5w9xy/msft_closes_at_2_trillion_as_second_us_company/h2peore/",
        "score": 98,
        "subreddit": "investing",
        "created": 1624431076.0
    },
    {
        "author": "works_best_alone",
        "body": "No publisher is going to allow this. You guys realise that GameStop does not control video game licensing, right? Sony, Microsoft, Nintendo are the only companies who can distribute licenses for the games on their platforms. They are not going to give licenses to GameStop because allowing digital resales completely cannibalises their sales because you no longer have to buy the game new. It literally makes no sense. It will not happen.",
        "created_utc": 1623262136,
        "id": "h16k5m6",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16k5m6/",
        "score": 98,
        "subreddit": "investing",
        "created": 1623290936.0
    },
    {
        "author": "innnx",
        "body": "Imagine thinking msft and aapl are not high growth",
        "created_utc": 1624692565,
        "id": "h33303g",
        "permalink": "/r/stocks/comments/o81utw/favorite_stocks_for_the_next_5_years_that_arent/h33303g/",
        "score": 85,
        "subreddit": "stocks",
        "created": 1624721365.0
    },
    {
        "author": "entertainman",
        "body": "They need to release a $20 Xbox Lite, Roku Stick / Fire TV Stick.  Everybody else has a TV dongle and Microsoft is afraid to enter that market because they’ve failed multiple times before, and fear will lead to them trying to overpower it so it’s “better.”\n\nIt’ll be a mistake to release this at $100 and go for the elite crowd.",
        "created_utc": 1623355272,
        "id": "h1bk0qz",
        "permalink": "/r/stocks/comments/nws8lb/microsoft_is_developing_new_hardware_to_bring_its/h1bk0qz/",
        "score": 81,
        "subreddit": "stocks",
        "created": 1623384072.0
    },
    {
        "author": "neothedreamer",
        "body": "Everyone is overlook key facts - Pros also have disadvantages, they have tons of capital to invest, limits to their mandate on what they can invest in, how much they can invest in one position, indexes are only matching the companies in their index including zombie companies, don't normally trade options (selling CC can bring additional return for low risk on a long term position you may plan on keeping for years) etc.\n\nIf you only buy blue chips like Aapl, MSFT etc and sell CC on them far enough otm you will beat indexes because that is return they aren't even trying to chase.",
        "created_utc": 1623639663,
        "id": "h1owkle",
        "permalink": "/r/investing/comments/nz9dxc/is_bogles_style_passive_investing_really_better/h1owkle/",
        "score": 78,
        "subreddit": "investing",
        "created": 1623668463.0
    },
    {
        "author": "wrighterjw10",
        "body": "Yep.  If there’s a huge correction, load up on the blue chips.  Appl, msft are my two favs.\n\nThey’ll rebound and you’ll print.",
        "created_utc": 1625025718,
        "id": "h3ius6l",
        "permalink": "/r/stocks/comments/oafplq/who_truly_believes_a_crash_is_coming_this_year/h3ius6l/",
        "score": 74,
        "subreddit": "stocks",
        "created": 1625054518.0
    },
    {
        "author": "felipunkerito",
        "body": "Wasn't Azure what kick started MSFT?",
        "created_utc": 1624398878,
        "id": "h2p83dm",
        "permalink": "/r/investing/comments/o5w9xy/msft_closes_at_2_trillion_as_second_us_company/h2p83dm/",
        "score": 70,
        "subreddit": "investing",
        "created": 1624427678.0
    },
    {
        "author": "schittluck",
        "body": "Im super long in MSFT. Theres litterally no chance I will sell in the next 20 years. Buy it and hold it",
        "created_utc": 1624407336,
        "id": "h2po1ip",
        "permalink": "/r/stocks/comments/o611a6/msft_for_long_term/h2po1ip/",
        "score": 69,
        "subreddit": "stocks",
        "created": 1624436136.0
    },
    {
        "author": "GroundSe7en",
        "body": "Credits to /u/ixamnis\n\n\" Here are some that I like. By no means an exhaustive list:\n\n**QQQ** \\- This one uses the NASDAQ 100 as its benchmark. Obviously it's an Indexed, non-managed ETF. XTF used to rate this one as a perfect 10.0 out of 10 rating, but recently dropped it to 9.9 out of 10. It has one of the highest rates of return over the past 10 years of any ETF. It does tend to be tech-heavy, especially with the FAANG +M stocks.  (Facebook, Apple, Amazon, Netflix, Google and Microsoft).  Other top holdings include TSLA, NVDA and ADBE.  (The rating dropped recently when the portfolio of the NASDAQ 100 was re-balanced).\n\n**VXUS** \\- Vanguard Total International Index Fund ETF - top holdings include BABA, Tencent, Samsung, Taiwan Semiconductors, Novartis, Toyota. This is a broad market fund investing only in companies overseas.  I'm not generally bullish on foreign markets, but this one is a very solid ETF with some companies that are likely to do extremely well for the foreseeable future.  XTF rates this one a perfect 10.0 out of 10.\n\nAt the suggestion of u/Here4TheCatPics, I'm also going to include **EFA** and **EEM**. These are Emerging Markets ETFs.  Both have some crossover in their top holdings with VXUS. **EFA** is rated 9.6/10 by XTF Analysts and **EEM** is rated only 5.7/10. **EEM** appears to be heavily invested in the Chinese market with Alibaba and TenCent the top two holdings. It also holds quite a bit of cash for an ETF. **EFA** appears to be more tilted toward the European market. \n\n**VOO**/**SPY** \\- **VOO** and **SPY** are non-managed funds indexed to the S&amp;P 500 Index. These funds are very popular on this subreddit, for good reason. They are well diversified, broad market funds investing in mostly US stocks. XTF rates these funds at 9.6 out of 10 because their return on investment over the long term is somewhat tempered by some of the blue chip stocks in the funds. But those stocks also help reduce volatility relative to some other ETFs. These are solid investments, but keep in mind that in the top 10 holdings there will be a lot of crossover between these funds and other broad market funds that hold US stocks like **QQQ**, **VTI**, **VTG**, **VOOG** and **SPYG**.  There are differences, of course, as well, but you always want to know where those duplications exist.\n\n**IWF** \\- This is a Russell 1000 indexed fund. It is one of my favorites that doesn't get talked about much. It does have a lot of crossover with the other funds mentioned above, but the mix is slightly different.  I would describe this fund as more aggressive than **VOO/SPY**, less volatile than **QQQ**.\n\n**IWM** \\- for someone looking to diversify a little bit, this is a great fund to look into. This fund is a non-managed, indexed fund that uses the Russell 2000 index as its benchmark. The big difference between the Russell 2000 index and many of the the other indexes is that the Russell 2000 index looks at small and mid-cap companies, rather than large-cap companies.  Thus, there is zero crossover between this one and the funds mentioned above. While this fund will move up and down with the market, it is often less volatile than the market overall. If you look at the charts, this fund has under-performed some of the other funds over the past few months while the market has been very volatile in an upward direction, but in a crash, this fund would probably outperform the rest of the market.  It has a 9.0/10 XTF rating.\n\nThere are also some sector funds you may want to look at:\n\n&amp;#x200B;\n\n**ICLN**/**TAN/FAN** \\- These funds are clean/renewable energy ETFs. ICLN is more broad while TAN focuses more specifically on solar energy and FAN specifically on wind generated energy. I think renewable energy companies are the future. There is no crossover in the top holdings of this fund with the top holdings of QQQ and most of the other broad market funds. Also, these are global, not just US based companies.  QCLN and PBW are also renewable energy funds, but they also contain a lot of TSLA, NIO and W.K. H.S. in their top holdings making them \"electric vehicle\" funds, as well.  No problem if you want to add that, but you'll find a lot of Tesla in some of the funds mentioned above.\n\n**ARK** group of funds: **ARKG**, **ARKF**, **ARKK ARKW**, **ARKQ**, **PRNT** and **IZRL**. These are managed funds investing in companies that invest in disruptive companies in their respective industries. Most posters on this subreddit are bullish on these funds. They are aggressive growth ETFs, but should be considered somewhat risky and volatile.\n\n* ARKG - Genomic Revolution\n* ARKF - Fintech\n* ARKK - Disruptive Companies (broader market)\n* ARKW - Internet/computer/technology  (Telsa is a top holding)\n* ARKQ - Robotics and artificial intelligence\n* PRNT - 3D printing technology\n* IZRL - disruptive companies based in Israel\n\nXL series of funds.  Similar to the ARK series, these tend to be more aggressive growth funds, however these are passively managed indexed funds with various benchmarks that usually are overloaded in the better companies within a sector:\n\n* **XLV** \\- Health Care\n* **XLK** \\- Technology\n* **XLY** \\- Consumer Discretionary\n* **XLF** \\- Financial\n* **XLU** \\- Utilities\n\nAt the suggestion of u/Shaun8030, I'm adding Cloud Computing as another sector to consider.  Some tickers in that sector include:  **WCLD**, **SKYY**, **CLOU**, **BUG** and **XIKT**. Of these **WCLD** has the best 52 week performance.  Top holdings in **WCLD** include **ZM**, **PLAN**, **CRM**, **CRWD**, **ZEN**, **WDAY**, **TENB**, **PCTY**, **DDOG**, **BL**.  Many of these are likely to also appear in **QQQ**, however, they would be in very small percentages as the Cap on these companies is much smaller.\n\nRead through the comments below. Many users have posted some other great suggestions, as well.\n\n***A nice portfolio might look something like this:***\n\n20% - Broad market US fund such as QQQ, VOO or IWF\n\n20% - VXUS - International\n\n20% - IWM - Small/Mid-cap broad market fund\n\n10% each in four sector funds of your choice\n\nHope this helps.\n\n&amp;#x200B;\n\n*I'm not a financial expert or advisor and this is not financial advice, just an opinion from a random internet person.  I do own shares in several, but not all of the funds listed above, including QQQ, IWF, some ARK funds, ICLN, VXUS, etc.*\n\n&amp;#x200B;\n\n**EDIT:**  WOW! Thanks for the awards and the positive comments.  I appreciate the feedback.  I hope this advice really helps some people.\"",
        "created_utc": 1623447021,
        "id": "h1g8hk1",
        "permalink": "/r/investing/comments/nxlekk/which_to_pick_schd_voo_vig_vti_vt_vym_vxus_veu/h1g8hk1/",
        "score": 68,
        "subreddit": "investing",
        "created": 1623475821.0
    },
    {
        "author": "WhiteHoney88",
        "body": "If you want to get really excited, look at msft month over month chart over the last ten years. That’s perfection. Only thing that’s better IMO is Visa.",
        "created_utc": 1625019628,
        "id": "h3ijnal",
        "permalink": "/r/stocks/comments/oai5jy/what_are_your_highest_conviction_plays_for_the/h3ijnal/",
        "score": 66,
        "subreddit": "stocks",
        "created": 1625048428.0
    },
    {
        "author": "ImmySnommis",
        "body": "This is a hilarious post... But I guess this is what the market has bred over the last decade or so with easy money.\n\nI'm in big on MSFT. Like 19% of my portfolio. Those reinvested dividends pay off in spades. Just like COST or AAPL. Your vision is quite narrow.",
        "created_utc": 1623444378,
        "id": "h1g2v03",
        "permalink": "/r/stocks/comments/nxp7y7/what_is_the_point_of_1_dividends/h1g2v03/",
        "score": 62,
        "subreddit": "stocks",
        "created": 1623473178.0
    },
    {
        "author": "nachoman420",
        "body": "It's not talked about much, but GameStop does have a partnership with Microsoft. Also their market cap is about 15bil right now",
        "created_utc": 1624375564,
        "id": "h2nsmae",
        "permalink": "/r/wallstreetbets/comments/o5k4w3/gamestop_completes_atthemarket_equity_offering/h2nsmae/",
        "score": 61,
        "subreddit": "wallstreetbets",
        "created": 1624404364.0
    },
    {
        "author": "dal2k305",
        "body": "Short term yes, long term absolutely not. If what you’re saying is true then AAPL, MSFT, AMZN and GOOG wouldn’t be the largest companies by market cap. If you look at revenue and profit there is a direct correlation between those things and the appreciation of a stock. The companies that perform the best year over year have the best stock performance and the companies that perform poorly crash. \n\nThe longer the time frame the more rational the market becomes.",
        "created_utc": 1623276726,
        "id": "h17jpzi",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h17jpzi/",
        "score": 60,
        "subreddit": "investing",
        "created": 1623305526.0
    },
    {
        "author": "ShadowLiberal",
        "body": "MSFT definitely feels like the unpopular step child right now when it comes to the big FAANG+M stocks. I've been buying into it heavily for months, at a minimum I've been buying 2 shares every pay check. But I rarely see others calling MSFT a buy at reddit or in investing channels. I've seen some people argue that they just won't keep growing, and a lot of others saying it's just too expensive. It doesn't normally get that much love (or even a lot of mentions at all) in investing youtube channels either.\n\nAMZN is almost always called a buy whenever anyone talks about it, I practically never see anyone argue not to buy it, and I've never seen anyone use any kind of analysis/numbers to justify it being overpriced.\n\nAAPL has some people who say it's stupidly overpriced, and some who say it's a crazy steal right now if you look at the forward PE ratio. It's just a more polarizing stock that has a lot haters and a lot of loyal fans.\n\nGOOG &amp; FB have their haters, but also have a lot of people who have been saying for a while that they're really undervalued. I've seen so many youtube videos over the last year or two calling both of them great buys.\n\nNFLX has it's doubters with many others making their own streaming services these days, but I still see a lot of people who argue they're still a great investment and will continue growing despite these challenges.",
        "created_utc": 1624399513,
        "id": "h2p9cyd",
        "permalink": "/r/stocks/comments/o5w8ta/msft_closes_at_2_trillion_as_second_us_company/h2p9cyd/",
        "score": 60,
        "subreddit": "stocks",
        "created": 1624428313.0
    },
    {
        "author": "Citizen_of_Danksburg",
        "body": "Thanks for the comment! \n\nI guess for background, I’m 24 and a half, just finished grad school in stats, and I’m making $65k/year (living with my parents rn but will be moving back to the RTP for work in late July). Before taxes, every two weeks I’ll be making about $2700. Thank god I have no debt (love my parents so much ❤️), but my current portfolio is this:\n\n100 shares of CRSP\n15 shares of AMC\n10 shares of WISH\n10 shares of CLOV\n\nThe 100 shares of CRSP I really don’t want to touch. I originally had 50 shares of MSFT at around $245 at its peak (then), sold it all for GME, diamond handed it, and then sold it for a slight loss at $90/share (bought in around $94/share). Used that money to buy CRSP because I felt like an idiot with my GME purchase, thinking it wouldn’t ever spike again. Also, like an idiot, while I was still living with my parents back home in Ohio, I was still on my lease back in NC and gambled $2500 (about 6 months worth of rent) in the market as well and lost about $1900 leaving me with just south of 2 months worth of rent. \n\nI’ve learned my lessons for sure, and I’m happy that I put money into CLOV and WISH yesterday, and I’m optimistic about AMC, but my goal is \n\n100 shares of BEAM, \n100 shares of FATE, \n100 shares of NTLA, \n25 shares of NVDA, \n25 shares of TSLA, \n50 shares of AMD, \n50 shares of AAPL, \n50 shares of MSFT, and \n50 shares of AI. \n\nThat said, I really want to get into purchasing calls, I just don’t really know how to. I use TD Ameritrade and I just want to make sure I’m doing it right and be super careful. I definitely have opinions about what prices certain stocks will be at by some time point I think, I just don’t know how to trade calls on those. I also don’t really know what “theta” is so that’s why I’m not in the options game. I see so many people making big bucks off it though. I don’t know the math/logistics of how that works but damn, I want my piece. \n\nThanks for coming to my Ted talk haha.",
        "created_utc": 1623244877,
        "id": "h15ed9s",
        "permalink": "/r/wallstreetbets/comments/nvonrs/500k_gain_today_with_wish_clne_and_vldr_leading/h15ed9s/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1623273677.0
    },
    {
        "author": "infamous9111",
        "body": "If WISH hits $15 and SPY hits $430 tmr, I'll buy one Wendy's burger for every upvoter\n\nalso AAPL and MSFT have to go up at least $2",
        "created_utc": 1623821821,
        "id": "h1xrxi2",
        "permalink": "/r/wallstreetbets/comments/o0n6ry/what_are_your_moves_tomorrow_june_16_2021/h1xrxi2/",
        "score": 58,
        "subreddit": "wallstreetbets",
        "created": 1623850621.0
    },
    {
        "author": "documentnow",
        "body": "Big mistake! Hahah, to answer your question though...yes you would need a lot of Microsoft to make anything in dividends, it is generally regarded as a very stable company sitting on a mountain of cash, so some people feel safe parking their money there.",
        "created_utc": 1623443325,
        "id": "h1g0ji2",
        "permalink": "/r/stocks/comments/nxp7y7/what_is_the_point_of_1_dividends/h1g0ji2/",
        "score": 56,
        "subreddit": "stocks",
        "created": 1623472125.0
    },
    {
        "author": "-Paradox-11",
        "body": "Life got in the way for a loooong time before I could finally start investing and saving. \n\n31 yo, $15k brokerage (msft, dkng, nvda, dis, vti, eglx) and $6k in Roth IRA (fidelity go account but will change back to regular Roth IRA so I can manage), $10k cash, little to no debt (finally) besides student loans (~$20k still to payoff). \n\nAggressive growth strategy, and using dollar-cost averaging for the most part. Saving roughly 20-30% of monthly take home and trying to bolster my portfolio sooner rather than later. \n\nI started investing in May of this year. Late bloomer, but hoping to have a sizable amount saved and invested by retirement (goal is 55 to retire).",
        "created_utc": 1624743468,
        "id": "h35c92w",
        "permalink": "/r/stocks/comments/o8dxux/whats_your_current_portfolio_strategy_total_and/h35c92w/",
        "score": 54,
        "subreddit": "stocks",
        "created": 1624772268.0
    },
    {
        "author": "This_Clock",
        "body": "The Yahoo who:\n\n1. 1998 -Turned down licensing Google search engine for $1 Million\n2. 2002 - Wouldn't pay $5 Billion to buy Google (offered $3 Billion)\n3. 2006 - Dropped offer to buy Facebook from $1.1 Billion to $800 Million \n4. 2008 - Turned down a Microsoft buyout for $44.6 Billion\n5. 2016 - Sells to Verizon for $5 Billion",
        "created_utc": 1623862365,
        "id": "h1zjsvk",
        "permalink": "/r/wallstreetbets/comments/o0zxy4/amc_was_my_first_investment_back_in_january2021_i/h1zjsvk/",
        "score": 53,
        "subreddit": "wallstreetbets",
        "created": 1623891165.0
    },
    {
        "author": "Amat3urPro",
        "body": "Coke and AT&amp;T are terrible examples of solid blue chip companies to invest in. Coke's ceo is running them into the ground and AT&amp;T is a slowly dying dinosaur. I would look heavily at Apple, Pepsi, Microsoft, CAT, HPQ, FIS, GE, NET, or TSMC/SMH/Intel/AMD. No hate for your advice just don't want a new trader getting burned on either of those zombie companies.",
        "created_utc": 1623952381,
        "id": "h245qm8",
        "permalink": "/r/investing/comments/o1zxq4/should_i_focus_more_on_growth_or_dividend_stocks/h245qm8/",
        "score": 51,
        "subreddit": "investing",
        "created": 1623981181.0
    },
    {
        "author": "DaEagle07",
        "body": "Memes and mother of all short squeezes aside, the future of GameStop is ridiculously bright. Ryan Cohen’s leadership, debt paid off early, online sales growth, retail locations being leveraged as individual service centers for same day deliveries, partnership with Microsoft and the sale of PC hardware at their locations, upgrading some of their stores to game lounges to fit the growing trend of “retail as an experience”, and last but probably most important: investment in blockchain technology via NFT. They can use NFTs for digital trade-ins, digital goods, dividends, as a stock alternate, as a cryptocurrency, or for a myriad of other use cases. I know I’ll get downvoted here, but remember when people used to crap on Amazon who was JUST an online book store….\n\nIf you are one of the many of us who thought “oh if I had only bought Apple/Amazon/Tesla when it was cheap” then this is your sign. GameStop had no right surviving COVID and the shorts piling on to drive it to bankruptcy, but thanks to deep value investors, new life has been breathed into the company. Even if it doesn’t “squeeze to the moon” (which I personally believe it will) the long term value of GME is insane based off the gaming industry alone. GameStop’s NFT efforts could very well unseat Steam from the gaming marketplace throne.\n\n[GME NFT](https://nft.gamestop.com)",
        "created_utc": 1622649714,
        "id": "h0bs5e0",
        "permalink": "/r/stocks/comments/nqlc56/are_meme_stocks_just_one_huge_pump_and_dump/h0bs5e0/",
        "score": 51,
        "subreddit": "stocks",
        "created": 1622678514.0
    },
    {
        "author": "innnx",
        "body": "AAPL past 5 years up 450%. \nMSFT past 5 years up 420%\n\nThis is as high growth as it gets to be honest",
        "created_utc": 1624699037,
        "id": "h339l7b",
        "permalink": "/r/stocks/comments/o81utw/favorite_stocks_for_the_next_5_years_that_arent/h339l7b/",
        "score": 49,
        "subreddit": "stocks",
        "created": 1624727837.0
    },
    {
        "author": "ModernBuddha1",
        "body": "2000  shares strong BB!!! lets go!! \n\n1. They protect 500 million endpoints with ai cybersecurity. Only company trusted by Pentagon and Department of Defense and NATO and Canada fed gov. \n2. Only company with ai security that wasn't compromised in solarwind and microsoft hack. \n3. they protect 175 million cars ( including 70 % EV market) and provide software for ADAS function\n4. They have 38k patents in software and security\n5. They make security RADAR tracker for wordwide logistics\n6. They have ATHOC...critical event mgmt system for emergencies. Huge growth here.",
        "created_utc": 1623008825,
        "id": "h0tu6wl",
        "permalink": "/r/wallstreetbets/comments/nttgr8/bb_amc_gme_daily_popular_ticker_thread_for_june/h0tu6wl/",
        "score": 48,
        "subreddit": "wallstreetbets",
        "created": 1623037625.0
    },
    {
        "author": "Onetimebird13",
        "body": "Amazon, Tencent, Facebook, Microsoft, Baba, Lowes, Honeywell, Nvidia, Qualcomm, Apple, MercadoLibre, Etsy, Shopify, Visa, PayPal, Zscaler, Brookfield Assest, Nextera Energy, Abbvie, Vertex Pharma, Match, blizzard, T-Mobile, TD bank, Blackrock, Adobe, Unity, Autodesk, Macerich",
        "created_utc": 1623626743,
        "id": "h1oa3gy",
        "permalink": "/r/ValueInvesting/comments/nz8m0q/you_have_500k_and_you_have_to_build_a_portfolio/h1oa3gy/",
        "score": 46,
        "subreddit": "ValueInvesting",
        "created": 1623655543.0
    },
    {
        "author": "Level420Jesus",
        "body": "MSFT is a never seller",
        "created_utc": 1624407026,
        "id": "h2pnhdj",
        "permalink": "/r/investing/comments/o5w9xy/msft_closes_at_2_trillion_as_second_us_company/h2pnhdj/",
        "score": 45,
        "subreddit": "investing",
        "created": 1624435826.0
    },
    {
        "author": "EmperorOfWallStreet",
        "body": "They already have partnership with Microsoft who releasing all their exclusives to both latest gen of Xbox and Windows too.",
        "created_utc": 1623284177,
        "id": "h17z60n",
        "permalink": "/r/stocks/comments/nw5703/gamestop_releases_first_quarter_2021_financial/h17z60n/",
        "score": 45,
        "subreddit": "stocks",
        "created": 1623312977.0
    },
    {
        "author": "mahalob1tches",
        "body": "Top 10 Holdings (52.28% of Total Assets)\r  \nName\tSymbol\t% Assets\r  \nApple Inc\tAAPL\t11.10%\r  \nMicrosoft Corp\tMSFT\t9.57%\r  \nAmazon.com Inc\tAMZN\t8.77%\r  \nTesla Inc\tTSLA\t4.24%\r  \nAlphabet Inc Class C\tGOOG\t3.96%\r  \nFacebook Inc A\tFB\t3.93%\r  \nAlphabet Inc A\tGOOGL\t3.55%\r  \nNVIDIA Corp\tNVDA\t2.85%\r  \nPayPal Holdings Inc\tPYPL\t2.35%\r  \nComcast Corp Class A\tCMCSA\t1.96%\n\n&amp;#x200B;\n\nHow is this fund a risk hedge for the SP?",
        "created_utc": 1623696852,
        "id": "h1reu7l",
        "permalink": "/r/investing/comments/nzr17w/if_hedge_funds_really_do_such_a_bad_job_why_do/h1reu7l/",
        "score": 45,
        "subreddit": "investing",
        "created": 1623725652.0
    },
    {
        "author": "knights8154",
        "body": "Feel like MSFT might as well be my savings account at this point lol",
        "created_utc": 1624407500,
        "id": "h2poc8l",
        "permalink": "/r/stocks/comments/o611a6/msft_for_long_term/h2poc8l/",
        "score": 44,
        "subreddit": "stocks",
        "created": 1624436300.0
    },
    {
        "author": "HyperionCantos",
        "body": "In Redmond they say that the reason Microsoft is so chill now because all the assholes left to work for Amazon.",
        "created_utc": 1624426030,
        "id": "h2qkzhi",
        "permalink": "/r/investing/comments/o5w9xy/msft_closes_at_2_trillion_as_second_us_company/h2qkzhi/",
        "score": 44,
        "subreddit": "investing",
        "created": 1624454830.0
    },
    {
        "author": "KSMG9",
        "body": "[Here you go](https://news.microsoft.com/2020/10/08/gamestop-announces-multiyear-strategic-partnership-with-microsoft/)",
        "created_utc": 1623267117,
        "id": "h16wgf5",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16wgf5/",
        "score": 43,
        "subreddit": "investing",
        "created": 1623295917.0
    },
    {
        "author": "Flogrown_HS",
        "body": "To all the WISH haters saying WISH sells cheap crap therefore is a crap comany:  Walmart sells junk, has been for decades, Target's crap isn't much better.  McDonald's literally sells edible poison that causes heart disease and diabetes. Tesla sold cars that actually exploded. What about Microsoft? Remember the Windows phone? There are tons of companies that manufacture and sell crap, yet are extremely popular and profitable.  WISH is not the products they sell, they are an e-commerce marketplace, that is their business, that is where their value is. WISH is gaining marketshare by the minute in the developing world.  Is McDonald's a successful company because they sell the best food? No.  Is KIA a successful company because they make the best cars? No. Get your heads out of your pretentious asses. /end rant",
        "created_utc": 1624462304,
        "id": "h2s03i7",
        "permalink": "/r/wallstreetbets/comments/o69rc2/daily_popular_tickers_thread_for_june_23_2021/h2s03i7/",
        "score": 43,
        "subreddit": "wallstreetbets",
        "created": 1624491104.0
    },
    {
        "author": "JoSenz",
        "body": "Or that your android/microsoft friends will settle for a half-baked solution they have no control over. Unless FaceTime becomes native to both platforms, it'll be a cheap trick that won't appeal to anyone not on an iOS device.",
        "created_utc": 1623212366,
        "id": "h145pkc",
        "permalink": "/r/stocks/comments/nvktu5/apple_is_encroaching_on_facebooks_territory_like/h145pkc/",
        "score": 42,
        "subreddit": "stocks",
        "created": 1623241166.0
    },
    {
        "author": "Gorpachev",
        "body": "I forgot what the class was called, but it was business related and we entered a Long Island stock competition put on by Newsday.  We came in 3rd amongst hundreds of teams thanks to awesome stock tips from my Dad...this was early 90's and we were pouring our fake money into Microsoft, Adobe, IBM, and other tech stocks....while most other kids were buying Nike and Coke.  The two teams that beat us had returns several multiples above ours.  My teacher was convinced they were backdating their trades.  :-)  But whatever, it was a ton of fun and planted the seed for later in life.  That teacher wrote in my yearbook he expects a share of the first million I make in the market...I actually want to make good on that.",
        "created_utc": 1624252937,
        "id": "h2iatgt",
        "permalink": "/r/stocks/comments/o4n02o/why_dont_high_schools_have_classes_on_stock_market/h2iatgt/",
        "score": 42,
        "subreddit": "stocks",
        "created": 1624281737.0
    },
    {
        "author": "Jimz2018",
        "body": "People chasing shitty meme stocks while tech has been fucking booming every day.\n\nMSFT, NVDA, QQQ, SPY, GOOG.\n\nNVDA up **300** points in the last 3 months. That's where the real money is. Fools, all of you.",
        "created_utc": 1624999568,
        "id": "h3he38l",
        "permalink": "/r/wallstreetbets/comments/oag1qt/what_are_your_moves_tomorrow_june_30_2021/h3he38l/",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1625028368.0
    },
    {
        "author": "knights8154",
        "body": "Probably gonna keep buying Microsoft and avoiding buying real estate",
        "created_utc": 1625001400,
        "id": "h3hic74",
        "permalink": "/r/stocks/comments/oafplq/who_truly_believes_a_crash_is_coming_this_year/h3hic74/",
        "score": 40,
        "subreddit": "stocks",
        "created": 1625030200.0
    },
    {
        "author": "DavesNotWhere",
        "body": "You're not thinking outside the box.  Tell the apes it's proof MSFT is going to buy CLNE.",
        "created_utc": 1623716743,
        "id": "h1sle3l",
        "permalink": "/r/wallstreetbets/comments/o00qva/bezos_cow_farts_and_you_how_amzns_deal_w_clne_is/h1sle3l/",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1623745543.0
    },
    {
        "author": "Chance-Progress-7356",
        "body": "In the quarter, we continued to secure business with our highly regulated customers. Let me start with financial services. In financial services, including Mitsubishi UFJ, Bank of China, Bank of France and the Union Bank of India.\n\nIn the government and health care sector, we conduct business with the government of Canada, the U.K. NHS Health Services, University Health Network Canada, the United States Department of Energy, and Department of Commerce, the Netherlands Ministry of General Affairs, the Australian Department of Environmental and Energy, also the White House Communications Agency, U.S. Department of State, Department of Treasury and the United States Department of Defense.\n\nAlso in government -- in the United States federal government, we have increased the number of AtHoc cloud FedRAMP users by 6% sequentially. From a market perspective, this quarter, we gained new business through partnership we recently announced with Verizon, Vodafone as well as Telus. With Microsoft, we have integrated our Critical Event Management product alert with Microsoft Teams. John Chen, Earnings Transcript W1 FY 2022",
        "created_utc": 1624833539,
        "id": "h39d2g8",
        "permalink": "/r/wallstreetbets/comments/o96vka/blackberry_beats_revenue_estimates_by_3000000/h39d2g8/",
        "score": 40,
        "subreddit": "wallstreetbets",
        "created": 1624862339.0
    },
    {
        "author": "tehnoodles",
        "body": "in no specific weight or order.. PSTH(and all that is going to happen), SOFI, MNMD, BRK.B, AMZN, MSFT, DIS, ACB, TSM, ATVI.",
        "created_utc": 1623626319,
        "id": "h1o9cff",
        "permalink": "/r/ValueInvesting/comments/nz8m0q/you_have_500k_and_you_have_to_build_a_portfolio/h1o9cff/",
        "score": 39,
        "subreddit": "ValueInvesting",
        "created": 1623655119.0
    },
    {
        "author": "restlessapi",
        "body": "FAANG as an acronym exists for salaries. Microsoft does not pay as well as those companies. Also, Netflix has contributed enormously to the open source enterprise world, pioneering a lot of the java cloud stuff currently used by other companies. Yes, Netflix only really has one product, but they are an engineering marvel.",
        "created_utc": 1623768499,
        "id": "h1uqf5k",
        "permalink": "/r/stocks/comments/o00pa3/does_netflix_feel_like_a_ticking_time_bomb_to/h1uqf5k/",
        "score": 39,
        "subreddit": "stocks",
        "created": 1623797299.0
    },
    {
        "author": "R0gueR0nin",
        "body": "Don’t think of it as a missed opportunity. You never had it in the first place. If you keep thinking of it I should, would have, could have, you will drive yourself crazy. In the early 1990 I was told about a small company that I should invest in. I had $18,000 and lived in Europe for 6 months. I had a great time. \nHowever, that little company up the road from where I lived was called Microsoft. You do the math. \n\nEarlier in the year before their split, I didn’t do a good job convincing the wife that we needed to buy Tesla. The money that was supposed to go to Tesla are in Reits that are down 5% since we bought. I bought Netflix at $20, sold at a $100. That was before they blew up and split the stock. I think each one is worth $2800. My friend tried to convince me to Bitcoin in the beginning when it was around $100.  Who knew?\n\nI even sold AMC, took the profit, reinvested my initial seed money. Sold it again today, and forgot to reinvest the seed money. That means if it blows up again, oh well. If I didn’t sell in the first place, I would be in a better position. At the same time, I bought Amazon at 20, sold at around 3200. And it hasn’t done anything since. \n\nAs you can see, some bets pay off, some don’t. You can only do things that make sense for your situation, and sense of risk. You have to ask yourself what would have happened if AMC went to 0. Could you have afforded that?\n\nInvesting is a long term game. This stuff with AMC and the others are just having fun. Its like going to Vegas. You go to have a good time. If you make money while having fun, great!",
        "created_utc": 1622680196,
        "id": "h0dqj0p",
        "permalink": "/r/wallstreetbets/comments/nr08hw/missed_opportunities_how_do_you_deal_with_it/h0dqj0p/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1622708996.0
    },
    {
        "author": "juaggo_",
        "body": "I’ve said this many times and I’ll say it again: I really like Microsoft.  They are heavily betting on cloud with Azure. They’ve had huge growth through it and have managed to take market share from AWS. Xbox is about to be more than just consoles, it’ll be more about the gamepass and other services. The Office 365 and Windows are super popular products for businesses and everybody uses them. Probably one of the strongest moats in the world. LinkedIn is also a very interesting one since it is a platform with so many possibilities. \n\nFinancials are great. Everything is going up smoothly revenue and net income wise. Margins are also nice. The balance sheet is true grit with the well controlled debt and huge pile of cash. And Satya Nadella isn’t afraid to use it. He’s a great CEO and will lead the company beyond that 2 trillion dollar market cap. They’ve had their differences with the US government in the past, so I think Microsoft won’t face as much preassure from Capitol Hill as the other big tech companies.",
        "created_utc": 1624408122,
        "id": "h2pph0a",
        "permalink": "/r/stocks/comments/o611a6/msft_for_long_term/h2pph0a/",
        "score": 37,
        "subreddit": "stocks",
        "created": 1624436922.0
    },
    {
        "author": "CALLSORPUT",
        "body": "🅱️🅱️ $BB\n love this stock for the future but today we seen a heavy short attack nearly 600 million plus last time I checked being shorted this week. More short volume than actual fuckin buying because amc is hot. Don't get discouraged if anything load up on shares. Stop playing options until the float is eaten more. 43% owned by insiders. Haha do the math people. This is a winner all around. G7 cybersecurity biggest concern. Who is #1 growing and backed by \n$AMZN\n and \n$MSFT\n deals haha one good news from Chen and shorts are fucked. Still quiet on \n$FB\n settlement but word on the street it is anywhere from 5 to 10 billion so let that sink in.  This isn't going anywhere. Let then short the float and when they cover as float gets eaten we rise. Easy as that. stop being a bitch 🚀🚀🚀🚀🌝",
        "created_utc": 1623699617,
        "id": "h1rky18",
        "permalink": "/r/wallstreetbets/comments/nzjcfg/daily_popular_tickers_thread_for_june_14_2021_amc/h1rky18/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1623728417.0
    },
    {
        "author": "theepicone111",
        "body": "Tesla, Microsoft, Disney, PayPal, Google, TSM",
        "created_utc": 1624821664,
        "id": "h38pgbg",
        "permalink": "/r/stocks/comments/o93hw4/what_are_some_companies_you_love_but_hate_the/h38pgbg/",
        "score": 37,
        "subreddit": "stocks",
        "created": 1624850464.0
    },
    {
        "author": "ihavenipplefocker",
        "body": "32 YO\n\n94k Self Directed 401k\n\n60k Brokerage Account\n\n$230k equity in a $630k house.\n\n30k Cash.\n\nHome purchase and wedding dented my brokerage account back in 2019. Extra cash is conservative as our first child is being born in October. Will deploy that extra cash once the dust settles and we adjust to life with baby :).\n\nPortfolio is all tech. AAPL, GOOGL, MSFT, TTD, SOFI, NVDA, AMZN, SQ and MATCH.",
        "created_utc": 1624726783,
        "id": "h34figi",
        "permalink": "/r/stocks/comments/o8dxux/whats_your_current_portfolio_strategy_total_and/h34figi/",
        "score": 37,
        "subreddit": "stocks",
        "created": 1624755583.0
    },
    {
        "author": "iknownotthing",
        "body": "Good reliable Microsoft",
        "created_utc": 1622873403,
        "id": "h0nq4aw",
        "permalink": "/r/stocks/comments/nsjp6c/microsoft_wins_us_antitrust_okay_for_16_billion/h0nq4aw/",
        "score": 37,
        "subreddit": "stocks",
        "created": 1622902203.0
    },
    {
        "author": "pussy_impaler337",
        "body": "Honestly I think you are better off just buying stock in good companies that you like long term, not dividend hunting.  Some really good stocks have dividends like msft, appl, cvx, and some great stocks like amzn and goog do not, just focus on buying stock in good companies?",
        "created_utc": 1622605170,
        "id": "h09vcm3",
        "permalink": "/r/stocks/comments/nqbweg/help_setting_a_portfolio_goal_to_get_to_a_point/h09vcm3/",
        "score": 36,
        "subreddit": "stocks",
        "created": 1622633970.0
    },
    {
        "author": "Lord_Oim-Kedoim",
        "body": "I think it’s so amazing how Microsoft isn’t to be found in any of these hot big tech talks either in Congress or on Wallstreet - which is in my opinion the biggest reason to prefere it over every other big tech company right now",
        "created_utc": 1623613493,
        "id": "h1nkck8",
        "permalink": "/r/stocks/comments/nz3qpi/faang_has_been_the_hot_acronym_for_the_top_stocks/h1nkck8/",
        "score": 36,
        "subreddit": "stocks",
        "created": 1623642293.0
    },
    {
        "author": "Limewire-",
        "body": "Your Microsoft Paint skills truly are a sight to behold",
        "created_utc": 1623430566,
        "id": "h1f7ii6",
        "permalink": "/r/wallstreetbets/comments/nxknef/pltr_palantir_we_going_to_the_moon_heres_why_i/h1f7ii6/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1623459366.0
    },
    {
        "author": "jesperbj",
        "body": "MSFT probably. It would have to be something with a dividend I feel. If not, then TSLA for sure.",
        "created_utc": 1624314451,
        "id": "h2l6y33",
        "permalink": "/r/stocks/comments/o555lb/if_you_could_only_buy_one_stock_for_the_rest_of/h2l6y33/",
        "score": 34,
        "subreddit": "stocks",
        "created": 1624343251.0
    },
    {
        "author": "designatedtruth",
        "body": "In the long run, there's never a right time to buy MSFT. There's never a wrong time to buy MSFT. You jusy buy MSFT. \n\n&amp;#x200B;\n\nSeriously...go buy some MSFT",
        "created_utc": 1624414919,
        "id": "h2q2fi8",
        "permalink": "/r/stocks/comments/o5w8ta/msft_closes_at_2_trillion_as_second_us_company/h2q2fi8/",
        "score": 34,
        "subreddit": "stocks",
        "created": 1624443719.0
    },
    {
        "author": "litshit94",
        "body": "First: human capital; invest in yourself (books, courses, education)\n\nSecond: save some money for emergencys (broken car, broken dishwasher, paying fines, etc.) Rebuild it immediately with your next paycheck(s), when you have to use the emergency money. I have 6 paychecks on the side most people have around 3-6 paychecks.\n\nThird: build up a nice and fine portfolio. Mostly classics WalMart, Disney, Microsoft, ETF's bla bla.\n\nFourth: buy real estate to live in there or rent \n\nFifth: repeat Step 1, 3 and 4\n\nBut for all steps... Don't forget to be happy, humble and nice to your people.\n\nGood luck man\nDm me, if you need an advice or opinion.",
        "created_utc": 1623000003,
        "id": "h0tbacd",
        "permalink": "/r/stocks/comments/ntq6q7/25_yo_what_should_be_my_first_move/h0tbacd/",
        "score": 33,
        "subreddit": "stocks",
        "created": 1623028803.0
    },
    {
        "author": "Traberjkt",
        "body": "Gamer chiming and I want to second everything you said. If Microsoft could actually pull this off and make it a similar experience then they have something really special. I'd get multiple if it's reasonably priced.  Microsoft Gaming is making huge moves no doubt about it.",
        "created_utc": 1623354345,
        "id": "h1bhsh5",
        "permalink": "/r/stocks/comments/nws8lb/microsoft_is_developing_new_hardware_to_bring_its/h1bhsh5/",
        "score": 33,
        "subreddit": "stocks",
        "created": 1623383145.0
    },
    {
        "author": "zxc123zxc123",
        "body": "I'm a LT investor in INTC. LT as in nearing decade rather than years.\n\nIMO INTC isn't good for the short term and you'd have to have a lot of faith in Gelsinger turning the ship around. Right now Intel is not undervalued but IMO fairly priced given the risks involved in investing in it. The price is right but I think OP is looking at the upside potential compared to the price and sees a deal. As someone holding the company and considering my holdings, I would say there is upside potential (esp if you hold long) but it's not \"undervalued\".\n\nThe reason why it's not \"undervalued\" is because it's losing and getting disrupted. It's a tech company in the sense that it's in the field of high tech semis, but it's NOT a tech company in the sense of growth and disrupting others. In fact it's looking like a dinosaur. TSM, CSM, Samsung, etcetc. AMD, NVDA, ARM, etcetc. All bombarding it from all sides. Cheaper &amp; faster manufacturing, 7nm/5mn foundries built and running, 7nm/5nm designed and selling, already developing 5nm/3nm, etctec. \n\nAnd that's before we get into the real problem: the FAAAMs &amp; BATs are looking for places to expand and the semi space is where many of them are looking. \n\n&gt;Apple recently stopped using Intel chips and have their in house designed M1/M2 chips manufactured by TSM. Apple isn't going back to INTC anytime soon. And Apple doesn't go away. Nokia/Motorola phones basically dead, watch industry forever changed, Ipad industry disrupted, app store still dominating, apple computers aren't made by someone else, etcetc. Intel cannot fight back against Apple and it will NEVER kill Apple. Maybe Apple gets too comfy and declines, but that's not something Intel can control. If anything, the last 20 years have shown Apple only gets stronger and better with each reiteration of their products.\n\n&gt;MSFT? Doing the same thing AAPL is doing. Intel ain't effecting, killing, or pushing out Microsoft either. MSFT is bigger, more corporate, more innovative, and has stronger ties to China which INTC does not have. INTC isn't going to kill the Xbox, windows, office, github, skype, linkedin, bing, etctec. Nope. INTC has it's hands full desperately struggling to catch up to AMD/NVD/SMG on development and SMG/TSM/CSM in manufacturing. \n\n&gt;AMZN? Already dominating everything. Has AWS needs. Will look to in-housing their chips if supply issues become a problem. AMZN make so much money it has to actively lose money going into new businesses to keep from paying boatloads of taxes. Right now it's shipping, but chips could be next now that it sees MSFT/AAPL doing it.\n\n&gt;GOOG? Already doing chips in their own way. Leader in AI. Can use chips in their own chromebooks/phones. Fighting a cloud war in AAPL which chips might come in handy. Also has tons of cash laying around.\n\n&gt;Now FB is in a war with AAPL with apple using it's products to lockout FB datamining. FB is complaining about Apple app store fees and monopoly. FB will look to ways to circumvent that by going into hardware. And thus they'll be incentivized to not use INTC or go into chips themselves.\n\n&gt;Chinese BATs looking to do the same. Japanese tech leaders playing defensive but not backing down. Europe doesn't have the same tech titans but will pull some legislative B.S. to protect their own markets.\n\nSee the real reason I say INTC isn't \"undervalued\" is because it's fairly valued given the very real threats that surround it on multiple sides. It's big, has US government backing, in a still growing industry, and can whether a beating. But INTC was INTC because it was a technology leader that disrupted the industry. It's technology lead was what kept AAPL using INTC chips and everyone off their back. It was their moat. And now that moat is disappearing if not gone with a lot of bigger, stronger, more innovative, more driven, better runned, and better funded companies that they have no answer to eating it's market share.",
        "created_utc": 1624988214,
        "id": "h3go0p7",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3go0p7/",
        "score": 32,
        "subreddit": "investing",
        "created": 1625017014.0
    },
    {
        "author": "MericaMericaMerica",
        "body": "As a Microsoft investor, I'm excited.\n\nAs someone who prefers physical media for video games, I'm still unhappy about this trend.",
        "created_utc": 1623355275,
        "id": "h1bk0ya",
        "permalink": "/r/stocks/comments/nws8lb/microsoft_is_developing_new_hardware_to_bring_its/h1bk0ya/",
        "score": 32,
        "subreddit": "stocks",
        "created": 1623384075.0
    },
    {
        "author": "Acidictadpole",
        "body": "Nice! I skimmed over it and saw the bullet points. Those things seem pretty reasonable to me...\n\nIt's a commitment for GameStop to use Microsoft products internally and also offer a particular XBox service/product. \n\nAre these viewed as being negative?",
        "created_utc": 1623272832,
        "id": "h17ao0v",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h17ao0v/",
        "score": 31,
        "subreddit": "investing",
        "created": 1623301632.0
    },
    {
        "author": "apooroldinvestor",
        "body": "All I know is I've been told to never sell MSFT or AAPL.  20% of my portfolio and have been solid.",
        "created_utc": 1624409685,
        "id": "h2psela",
        "permalink": "/r/stocks/comments/o611a6/msft_for_long_term/h2psela/",
        "score": 31,
        "subreddit": "stocks",
        "created": 1624438485.0
    },
    {
        "author": "Flakey_Felatio",
        "body": "This. Think Amazon, Microsoft, Apple, etc. They were very rarely - if ever - cheap, but they have been outstanding investments.",
        "created_utc": 1624999804,
        "id": "h3hen54",
        "permalink": "/r/stocks/comments/oagbeg/according_to_buffett_it_is_far_better_to_buy_a/h3hen54/",
        "score": 31,
        "subreddit": "stocks",
        "created": 1625028604.0
    },
    {
        "author": "IdealGuest",
        "body": "Time is on your side till retirement.\n\nThe best thing to invest in is a stock you believe in. Look at what you use and what is invaluable to you. Computer parts, food, drinks, delivery services just an example.\nTo answer your question though:\n\nCostco (cost) has a dividend and is forecasted to grow up in the future. Or you can go with a stock like coke (KO) which is relatively flat but a solid hedge against inflation.\n\nFor growth I always look at Tech\nTech is where fortunes are gained and lost but apple and Microsoft are a great way to hold value since their fluctuations aren’t drastic.",
        "created_utc": 1623944547,
        "id": "h23n6cz",
        "permalink": "/r/investing/comments/o1zxq4/should_i_focus_more_on_growth_or_dividend_stocks/h23n6cz/",
        "score": 31,
        "subreddit": "investing",
        "created": 1623973347.0
    },
    {
        "author": "crackdup",
        "body": "I would agree with Amazon for a 5-10 year time horizon, but 40 is too unpredictable.. they're a juggernaut with solid fundamentals, but 40 years from now Amazon may be a different/diminished company due to antitrust laws/regulation/higher corporate tax, strong labor laws, climate change impacting supply chains, MSFT overtaking them in cloud business, new leadership after Bezos having a flawed business vision etc.. \n\nNot saying any of that may happen but 40 year timeframe is too unpredictable.. if my horizon was 40 years, index fund is the only thing I would be confident about..",
        "created_utc": 1624970091,
        "id": "h3fl4f1",
        "permalink": "/r/stocks/comments/oa4sm2/when_investing_in_stocks_what_important_truth_do/h3fl4f1/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1624998891.0
    },
    {
        "author": "ediblemonkeycakes",
        "body": "Msft is great. I believe it will hit 300. Msft is a buy and hold forever. What company can actually compete with it's OS? Is Xbox every going to go down? Is it's cloud computing audience going to change? What about it's defense contract with the government? It's not over valued. It's undervalued and a great buy. I will keep buying and holding.",
        "created_utc": 1624839736,
        "id": "h39o339",
        "permalink": "/r/stocks/comments/o93hw4/what_are_some_companies_you_love_but_hate_the/h39o339/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1624868536.0
    },
    {
        "author": "lowlyinvestor",
        "body": "Dividends are only a part of the total return. In almost all cases, when you buy a dividend paying stock, you’re expecting it to increase in value over time as well. Not only that, but many well run companies increase their payouts regularly. \n\nLook at Apple, when it began paying dividends again it started out paying a (split adjusted) quarterly dividend of around 9.5 cents per share. Now it’s 22 cents. \n\nLook at the historical payouts of many other dividend paying businesses, Verizon. Microsoft. Target. Home Depot. The dividends grow over time. \n\nBut yes, overall, the payout is only a portion of the total return. No one is evaluating Apple and saying “and look at that juicy 0.66% payout!”  But Apple holders (like me) are still happy to see that payout get increased each year.",
        "created_utc": 1624714798,
        "id": "h33sqwe",
        "permalink": "/r/stocks/comments/o8akyg/are_dividends_worth_it/h33sqwe/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1624743598.0
    },
    {
        "author": "PfizerForYou",
        "body": "Are we complaining about free money? Did you buy these Microsoft shares with your stimmies?",
        "created_utc": 1623444087,
        "id": "h1g27u0",
        "permalink": "/r/stocks/comments/nxp7y7/what_is_the_point_of_1_dividends/h1g27u0/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1623472887.0
    },
    {
        "author": "bluehat9",
        "body": "There is no \"better\". \n\nKeep in mind that VGT contains Microsoft and Nvidia as its number #2 and #3 holdings. VTI has Microsoft as #1, Alphabet as #3, and Facebook as #5. IWF has Microsoft as #2, FB #4, GOOG #5 and #6, Nvidia #8. \n\nWhat I'm trying to say is that you still are pretty concentrated in those names. I like a little diversification but it's not a requirement.",
        "created_utc": 1624392461,
        "id": "h2oudsw",
        "permalink": "/r/investing/comments/o5vqa5/at_what_point_does_diversification_detract_from/h2oudsw/",
        "score": 29,
        "subreddit": "investing",
        "created": 1624421261.0
    },
    {
        "author": "bmore_conslutant",
        "body": "Yeah like the other guy said my 401k is nearly 100% s&amp;p and that's like 20% AAPL/msft/amzn/goog/fb\n\nNo real reason to do those individually",
        "created_utc": 1623951607,
        "id": "h243w4v",
        "permalink": "/r/investing/comments/o1zxq4/should_i_focus_more_on_growth_or_dividend_stocks/h243w4v/",
        "score": 28,
        "subreddit": "investing",
        "created": 1623980407.0
    },
    {
        "author": "RunningJay",
        "body": "GOOG, AMZN, AAPL, MSFT.  There are others but those IMO are still going to grow.\n\nBut honestly using u/stocksnhoops's strategy you're better off in SP500.",
        "created_utc": 1624725921,
        "id": "h34dssj",
        "permalink": "/r/stocks/comments/o81utw/favorite_stocks_for_the_next_5_years_that_arent/h34dssj/",
        "score": 28,
        "subreddit": "stocks",
        "created": 1624754721.0
    },
    {
        "author": "semicoloradonative",
        "body": "Most MSFT employees own MSFT stock, so…they are giving it to the employees.  Everyone wins when you own MSFT!",
        "created_utc": 1623448516,
        "id": "h1gbl0z",
        "permalink": "/r/stocks/comments/nxp7y7/what_is_the_point_of_1_dividends/h1gbl0z/",
        "score": 28,
        "subreddit": "stocks",
        "created": 1623477316.0
    },
    {
        "author": "Paul_Ostert",
        "body": "Cloud computing AMZN MSFT",
        "created_utc": 1624417588,
        "id": "h2q7d99",
        "permalink": "/r/stocks/comments/o642ov/whats_your_industry_and_which_stocks_in_that/h2q7d99/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1624446388.0
    },
    {
        "author": "KKnCookies",
        "body": "Google and Microsoft don’t have a fast growing fleet of delivery vehicles and a massive international logistic operation already setup to accommodate personal delivery, and that is secure enough for high value items",
        "created_utc": 1622646646,
        "id": "h0bkx8i",
        "permalink": "/r/weedstocks/comments/nqled2/is_amazon_the_spark_that_reignites_cannabis/h0bkx8i/",
        "score": 27,
        "subreddit": "weedstocks",
        "created": 1622675446.0
    },
    {
        "author": "Flinkaroo",
        "body": "Can I get a hell yeah for all us MSFT holders who played safe 😅👍🏻",
        "created_utc": 1624993457,
        "id": "h3h07nt",
        "permalink": "/r/stocks/comments/oa4tpp/rstocks_daily_discussion_technicals_tuesday_jun/h3h07nt/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1625022257.0
    },
    {
        "author": "gswizzle911",
        "body": "“Don’t invest in Microsoft, invest in these random companies I own shares of instead”",
        "created_utc": 1623351382,
        "id": "h1bawe9",
        "permalink": "/r/stocks/comments/nws8lb/microsoft_is_developing_new_hardware_to_bring_its/h1bawe9/",
        "score": 27,
        "subreddit": "stocks",
        "created": 1623380182.0
    },
    {
        "author": "Jake10873",
        "body": "Apple $22 December 12th 1980\n\nAmazon $18 May 15th 1997\n\nMicrosoft $21 March 13th 1986\n\nYOU check your history lmfao.\n\nMaybe you should learn how to do a simple Google search before getting so many monitors which are pretty much useless and I guarantee you hardly know what you're looking at and just have all of that stuff on them to feel or look cool 🤣",
        "created_utc": 1624214848,
        "id": "h2gefmm",
        "permalink": "/r/RobinHoodPennyStocks/comments/o48u0b/what_are_the_safest_penny_stocks_where_is_my_edge/h2gefmm/",
        "score": 27,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1624243648.0
    },
    {
        "author": "BacklogBeast",
        "body": "I’m a Sony fanboy (though I own MSFT stock and not Sony stock) and I very much agree with you. Netflix of gaming; Xbox will be what people call video gaming (like we used to with Ni te do).",
        "created_utc": 1624399759,
        "id": "h2p9un1",
        "permalink": "/r/stocks/comments/o5w8ta/msft_closes_at_2_trillion_as_second_us_company/h2p9un1/",
        "score": 26,
        "subreddit": "stocks",
        "created": 1624428559.0
    },
    {
        "author": "trill_collins__",
        "body": "Why would MSFT or Sony do this? It canibalizes demand for higher margin new releases and is a negative NPV scenario for them",
        "created_utc": 1623263552,
        "id": "h16nm17",
        "permalink": "/r/investing/comments/nw1smc/i_dont_understand_the_long_term_appeal_of_gme/h16nm17/",
        "score": 25,
        "subreddit": "investing",
        "created": 1623292352.0
    },
    {
        "author": "4ppleF4n",
        "body": "Ratios are fine for historic comparisons; but use of competitor's ratios to evaluate individual stock price will yield lots of wrong numbers particularly for unique companies.\n\nFor example, Apple's current P/E ratio [according to Microtrends is 28.59](macrotrends.net/stocks/charts/AAPL/apple/pe-ratio).\n\nWho are Apple's competitors? Would you evaluate it against HP with a current P/E of 10.13; Lenovo at 12.87... or Microsoft at 35.52?",
        "created_utc": 1623612220,
        "id": "h1nhrhq",
        "permalink": "/r/investing/comments/nz1bqv/whats_some_basic_dd_that_i_can_do/h1nhrhq/",
        "score": 25,
        "subreddit": "investing",
        "created": 1623641020.0
    },
    {
        "author": "HulksInvinciblePants",
        "body": "&gt;I love how everyone was shitting on WSB for telling people to \"buy and hold\" a stock\n\nThat's not even close to the actual issue. \n\nYou want to buy and hold AAPL or MSFT? Sure, that makes sense. They have positive outlooks and the earnings to justify their valuations in today's climate. \n\nAMC and GME are not AAPL or MSFT. They're companies bleeding money, and their valuations are very much detached from reality. Once the merry-go-round stops, those \"buy and hold\" folks will turn into bag holders.",
        "created_utc": 1623869977,
        "id": "h201j6c",
        "permalink": "/r/investing/comments/o1918w/lets_be_honest_and_recognize_the_presence_of_a/h201j6c/",
        "score": 25,
        "subreddit": "investing",
        "created": 1623898777.0
    },
    {
        "author": "SubHomestead",
        "body": "Yup. MSFT and APPL are never sells.",
        "created_utc": 1624410709,
        "id": "h2puf44",
        "permalink": "/r/stocks/comments/o611a6/msft_for_long_term/h2puf44/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1624439509.0
    },
    {
        "author": "Heraklion-Greece",
        "body": "Good! I own 50k worth of MSFT stock. Gotta keep the stock going higher.",
        "created_utc": 1622893103,
        "id": "h0ocq8c",
        "permalink": "/r/stocks/comments/nsjp6c/microsoft_wins_us_antitrust_okay_for_16_billion/h0ocq8c/",
        "score": 24,
        "subreddit": "stocks",
        "created": 1622921903.0
    },
    {
        "author": "FinndBors",
        "body": "The way the quote was phrased in the article, it's likely that GOOG , AAPL and MSFT would be included.",
        "created_utc": 1622958304,
        "id": "h0rmnc8",
        "permalink": "/r/stocks/comments/ntbhea/amazon_and_facebook_to_fall_under_new_g7_tax/h0rmnc8/",
        "score": 24,
        "subreddit": "stocks",
        "created": 1622987104.0
    },
    {
        "author": "Abject-Mixture-8926",
        "body": "Nestle? Apple? Nike? Under Armour? Microsoft? Oil companies? All of them have something they violate.",
        "created_utc": 1622813043,
        "id": "h0kc885",
        "permalink": "/r/investing/comments/nrw7cv/biden_bans_us_investment_in_chinese_military_and/h0kc885/",
        "score": 24,
        "subreddit": "investing",
        "created": 1622841843.0
    },
    {
        "author": "PlzbuffRakiThenNerf",
        "body": "Watch MSFT crash to 1/3 of its value and op comes back to finally cheer that it’s at 3% yield",
        "created_utc": 1623452141,
        "id": "h1giiqs",
        "permalink": "/r/stocks/comments/nxp7y7/what_is_the_point_of_1_dividends/h1giiqs/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1623480941.0
    },
    {
        "author": "Scameron313",
        "body": "Lol such an ignorant take. The entire corporate world runs on Microsoft.",
        "created_utc": 1624396781,
        "id": "h2p3rxl",
        "permalink": "/r/stocks/comments/o5w8ta/msft_closes_at_2_trillion_as_second_us_company/h2p3rxl/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1624425581.0
    },
    {
        "author": "piggydancer",
        "body": "Yes, but not as much as you may think.\n\nTwo examples come to mind.\n\nOne is where you could've invested in Microsoft at the peak of the Dotcom bubble in 2000 and still returned 9% a year and beat the index.\n\nWalmart was way overvalued in the 70's but returned something like 13% a year since then.\n\nTwo things they had in common? They both have long periods of vastly underperforming the index. They both turned out to be incredibly good businesses and that never changed.\n\nIt's hard to find a business that good, and it's hard to keep faith in a business being that good after 5 or worse 10 years of under performance.\n\nThat's why people like valuations, you don't need to pick the next great company over the next 30 years and remain confident in it when everything else looks better. \n\nBuying a great company and staying invested is a lot harder than it sounds.\n\nIt also had lead a lot of people holding on to GE way to long and riding GM into bankruptcy.\n\nSeems obvious in hindsight, but telling the difference between Microsoft being a market beating investment and GE being a money losing investment would have been an impossible decision in the late 90's.",
        "created_utc": 1623655054,
        "id": "h1ph077",
        "permalink": "/r/stocks/comments/nzfxbd/does_a_stock_being_overvalued_matter_if_buying/h1ph077/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1623683854.0
    },
    {
        "author": "401TCW",
        "body": "Spread it out over Apple, Microsoft, Visa/Mastercard, Disney, Costco, Nvidia and JPMorgan\n\nKeep around 30k~40k to buy dips",
        "created_utc": 1624812672,
        "id": "h3873uy",
        "permalink": "/r/stocks/comments/o8ys7u/investment_ideas_150k/h3873uy/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1624841472.0
    },
    {
        "author": "sstobo",
        "body": "I sold all my bags, MSFT, TSLA, APPL and bitcoin. Put it all into AMC and GOED monday. For the first time since march my portfolio is green.",
        "created_utc": 1622685073,
        "id": "h0e09gp",
        "permalink": "/r/StockMarket/comments/nqy1ep/arrrrrrrghh/h0e09gp/",
        "score": 23,
        "subreddit": "StockMarket",
        "created": 1622713873.0
    },
    {
        "author": "DaEagle07",
        "body": "Memes and mother of all short squeezes aside, the future of GameStop is ridiculously bright. Ryan Cohen’s leadership, debt paid off early, online sales growth, retail locations being leveraged as individual service centers for same day deliveries, partnership with Microsoft and the sale of PC hardware at their locations, upgrading some of their stores to game lounges to fit the growing trend of “retail as an experience”, and last but probably most important: investment in blockchain technology via NFT. They can use NFTs for digital trade-ins, digital goods, dividends, as a stock alternate, as a cryptocurrency, or for a myriad of other use cases. I know I’ll get downvoted here, but remember when people used to crap on Amazon who was JUST an online book store….\n\nIf you are one of the many of us who thought “oh if I had only bought Apple/Amazon/Tesla when it was cheap” then this is your sign. GameStop had no right surviving COVID and the shorts piling on to drive it to bankruptcy, but thanks to deep value investors, new life has been breathed into the company. Even if it doesn’t “squeeze to the moon” (which I personally believe it will) the long term value of GME is insane based off the gaming industry alone. GameStop’s NFT efforts could very well unseat Steam from the gaming marketplace throne.\n\n[GME NFT](https://nft.gamestop.com)",
        "created_utc": 1622649714,
        "id": "h0bs5e0",
        "permalink": "/r/stocks/comments/nqlc56/are_meme_stocks_just_one_huge_pump_and_dump/h0bs5e0/",
        "score": 51,
        "subreddit": "stocks",
        "created": 1622678514.0
    },
    {
        "author": "R0gueR0nin",
        "body": "Don’t think of it as a missed opportunity. You never had it in the first place. If you keep thinking of it I should, would have, could have, you will drive yourself crazy. In the early 1990 I was told about a small company that I should invest in. I had $18,000 and lived in Europe for 6 months. I had a great time. \nHowever, that little company up the road from where I lived was called Microsoft. You do the math. \n\nEarlier in the year before their split, I didn’t do a good job convincing the wife that we needed to buy Tesla. The money that was supposed to go to Tesla are in Reits that are down 5% since we bought. I bought Netflix at $20, sold at a $100. That was before they blew up and split the stock. I think each one is worth $2800. My friend tried to convince me to Bitcoin in the beginning when it was around $100.  Who knew?\n\nI even sold AMC, took the profit, reinvested my initial seed money. Sold it again today, and forgot to reinvest the seed money. That means if it blows up again, oh well. If I didn’t sell in the first place, I would be in a better position. At the same time, I bought Amazon at 20, sold at around 3200. And it hasn’t done anything since. \n\nAs you can see, some bets pay off, some don’t. You can only do things that make sense for your situation, and sense of risk. You have to ask yourself what would have happened if AMC went to 0. Could you have afforded that?\n\nInvesting is a long term game. This stuff with AMC and the others are just having fun. Its like going to Vegas. You go to have a good time. If you make money while having fun, great!",
        "created_utc": 1622680196,
        "id": "h0dqj0p",
        "permalink": "/r/wallstreetbets/comments/nr08hw/missed_opportunities_how_do_you_deal_with_it/h0dqj0p/",
        "score": 37,
        "subreddit": "wallstreetbets",
        "created": 1622708996.0
    },
    {
        "author": "pussy_impaler337",
        "body": "Honestly I think you are better off just buying stock in good companies that you like long term, not dividend hunting.  Some really good stocks have dividends like msft, appl, cvx, and some great stocks like amzn and goog do not, just focus on buying stock in good companies?",
        "created_utc": 1622605170,
        "id": "h09vcm3",
        "permalink": "/r/stocks/comments/nqbweg/help_setting_a_portfolio_goal_to_get_to_a_point/h09vcm3/",
        "score": 36,
        "subreddit": "stocks",
        "created": 1622633970.0
    },
    {
        "author": "KKnCookies",
        "body": "Google and Microsoft don’t have a fast growing fleet of delivery vehicles and a massive international logistic operation already setup to accommodate personal delivery, and that is secure enough for high value items",
        "created_utc": 1622646646,
        "id": "h0bkx8i",
        "permalink": "/r/weedstocks/comments/nqled2/is_amazon_the_spark_that_reignites_cannabis/h0bkx8i/",
        "score": 27,
        "subreddit": "weedstocks",
        "created": 1622675446.0
    },
    {
        "author": "Accomplished_Sky_759",
        "body": "Let’s make BB great again to rival Apple and Microsoft! We must have more options on phones and softwares!",
        "created_utc": 1622576413,
        "id": "h089hmq",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h089hmq/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1622605213.0
    },
    {
        "author": "AnythingTotal",
        "body": "Are any other Fortune 500 companies lobbying for cannabis reform?\n\nAmazon isn’t the least surprising, but I expected them to be behind Google, Microsoft, and other big tech.",
        "created_utc": 1622643140,
        "id": "h0bd325",
        "permalink": "/r/weedstocks/comments/nqled2/is_amazon_the_spark_that_reignites_cannabis/h0bd325/",
        "score": 17,
        "subreddit": "weedstocks",
        "created": 1622671940.0
    },
    {
        "author": "psychotrader00",
        "body": "Big tech have a humongous market cap so they typically don't move much in the short-term. That said many like AAPL, FB, AMZN, MSFT, Google are way up year-to-date. \n\nLook for the longterm with the big techs they're businesses are solid and their stocks have performed exceedingly well in even in the last 6 months",
        "created_utc": 1622591111,
        "id": "h094b7h",
        "permalink": "/r/stocks/comments/nq3ic1/here_is_a_market_recap_for_today_tuesday_june_1/h094b7h/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1622619911.0
    },
    {
        "author": "Telkorenar",
        "body": "I don't like meme stocks because i don't feel good holding them.  Holding companies like DIS, MSFT, BA, etc... with solid financials and outlook, I feel confident doing so through dips and doing so long.\n\nBut the \"meme\" stocks, are only good if you can catch a few upticks.  Otherwise you end up like the silent majority bagholder group.",
        "created_utc": 1622647781,
        "id": "h0bniuu",
        "permalink": "/r/stocks/comments/nqlc56/are_meme_stocks_just_one_huge_pump_and_dump/h0bniuu/",
        "score": 15,
        "subreddit": "stocks",
        "created": 1622676581.0
    },
    {
        "author": "Kay312010",
        "body": "MSFT\n\nCOST",
        "created_utc": 1622601604,
        "id": "h09okxc",
        "permalink": "/r/stocks/comments/nq9bh1/what_one_stock_do_you_think_has_the_least_risk_in/h09okxc/",
        "score": 14,
        "subreddit": "stocks",
        "created": 1622630404.0
    },
    {
        "author": "wasinwill",
        "body": "When Buffett mentioned that omission cost him more than commission, he gave Fannie Mae as an example back in 2008 when the company was at an all-time high, and stated that he understood enough about their business to know that he should've bought the entire company before it blew up, and that mistake won't show in the books. He also said during the same speech that he doesn't regret not buying Microsoft before it took off because he didn't know enough about the business.\n\nThe point is that you shouldn't take risks for the sake of taking risks. You should not use that quote to justify uncalculated risks. Like many have said on here, your investment may go down, maybe as soon as you buy into it, and may stay down for months before it builds back up (if it ever does). The reason why someone is willing to lend you money at 3% instead of investing the same amount in stocks, is because that 3% is guaranteed. It was guaranteed after the dot com crash, and it was guaranteed after the subprime crisis. Like the comment above pointed out, there's no free lunch.",
        "created_utc": 1622635054,
        "id": "h0ay4q0",
        "permalink": "/r/investing/comments/nqgwyl/is_it_ok_to_borrow_at_cheap_interest_rate_to/h0ay4q0/",
        "score": 13,
        "subreddit": "investing",
        "created": 1622663854.0
    },
    {
        "author": "AuctorLibri",
        "body": "Bwaahaahaa not wrong. Been holding MSFT and AMZN over seven years, still got away to go.\n\nOne of my parent's friends has had APPL stocks since it was $25 / share, 1980-ish. 😆 Now that's 'long.'",
        "created_utc": 1622578202,
        "id": "h08deqr",
        "permalink": "/r/StockMarket/comments/nq1pue/the_beauty_of_buy_and_hold/h08deqr/",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1622607002.0
    },
    {
        "author": "quakerzombie",
        "body": "I think cloud a big pie for everyone to have a large piece. Azure is still growing double digit. You could probably pick AMZN or GOOG as well but personally I think MSFT as a company is more diversified.",
        "created_utc": 1622595578,
        "id": "h09cyv3",
        "permalink": "/r/stocks/comments/nq9bh1/what_one_stock_do_you_think_has_the_least_risk_in/h09cyv3/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1622624378.0
    },
    {
        "author": "Aware-Ingenuity",
        "body": "In tenth grade I was in an investing class. We made fake portfolios and watched our stocks. I chose Nvidia, Microsoft, Apple, and google. This was in 2006.\n\nI had better investing sense at 16 than I do today. What the fuck is wrong with me",
        "created_utc": 1622640888,
        "id": "h0b8ctr",
        "permalink": "/r/StockMarket/comments/nqb495/decided_to_only_buy_stocks_im_willing_to_hold_for/h0b8ctr/",
        "score": 10,
        "subreddit": "StockMarket",
        "created": 1622669688.0
    },
    {
        "author": "401TCW",
        "body": "For a 12 months timeframe: Apple, Microsoft, Visa, Mastercard, Costco, Disney",
        "created_utc": 1622607942,
        "id": "h0a09w5",
        "permalink": "/r/stocks/comments/nq9bh1/what_one_stock_do_you_think_has_the_least_risk_in/h0a09w5/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1622636742.0
    },
    {
        "author": "SoLo412",
        "body": "Same with MSFT",
        "created_utc": 1622577228,
        "id": "h08ba1v",
        "permalink": "/r/stocks/comments/nppzux/rstocks_daily_discussion_technicals_tuesday_jun/h08ba1v/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1622606028.0
    },
    {
        "author": "Qwertyforu",
        "body": "I have all my retirement in etfs, but the stocks I own are...\n\n\nTarget (TGT) - 10.8%\n\nMicrosoft (MSFT) - 9%\n\nApple (AAPL) - 8.3%\n\nDisney (DIS) - 8%\n\nStarbucks (SBUX) - 7.6%\n\nBlackRock (BLK)  - 7.3%\n\nPayPal (PYPL) - 6.5%\n\nSquare (SQ) - 6.2%\n\nDeere &amp; Company (DE) - 6%\n\nAbbVie (ABBV) - 5.3%\n\nGeneral Motors (GM) - 4.7%\n\nGoldman Sachs (GS) - 4.7%\n\nCVS (CVS) - 3.6%\n\nCanadian National Railway (CNI) - 3.1%\n\nKeurig Dr Pepper (KDP) - 2.7%\n\nExpedia (EXPE) - 2.5%\n\nNextera Energy (NEE) - 2.2%\n\nVuzix (VUZI) - 1.3%",
        "created_utc": 1622584284,
        "id": "h08qjsh",
        "permalink": "/r/stocks/comments/nppkp4/rate_my_portfolio_rstocks_quarterly_thread_june/h08qjsh/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1622613084.0
    },
    {
        "author": "Gurthang99",
        "body": "Gurthang's Gainers\r  \n\r  \n\\+0.59% from 5/28/21\r  \n\r  \n\\+46.18% Lifetime\r  \n\r  \nI am long on O, STAG, BND, VIG, VYM, AMT, CCI, MSFT, IRM, QCOM, ESTC, ET, LAND, CRLBF, PW\r  \n\r  \nCompound interest is the eighth wonder of the world. He who understands it, earns it ... he who doesn't ... pays it. Compound interest is the most powerful force in the universe. Compound interest is the greatest mathematical discovery of all time.",
        "created_utc": 1622540643,
        "id": "h06clvr",
        "permalink": "/r/investing/comments/nppldq/daily_general_discussion_and_spitballin_thread/h06clvr/",
        "score": 7,
        "subreddit": "investing",
        "created": 1622569443.0
    },
    {
        "author": "Mojojojo3030",
        "body": "I like the moat, consistent growth and rev, lack of debt, multiple is fine I guess, exposure is large, SaaS in general is great.\n\nMy reservations are 8% tutes, large % SPACcers, which seems like they're hard up for cash, which is also disturbing when they have Microsoft around. Also it seems like they've mostly come of age and have been around for 20 years in an established industry, so it's hard for me to justify the 9-13x. I like the buyback a lot in theory but it didn't seem to do much and I have to wonder if it was motivated by fear of redemptions. Thoughts?",
        "created_utc": 1622599182,
        "id": "h09jxl9",
        "permalink": "/r/SPACs/comments/nq6jwt/june_is_a_big_month_for_despacs_which_ones_will/h09jxl9/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1622627982.0
    },
    {
        "author": "adjacent-analyst",
        "body": "Hahaha, I have no fucking clue man. MSFT 1,000 by 2022",
        "created_utc": 1622603179,
        "id": "h09rm2m",
        "permalink": "/r/wallstreetbets/comments/mrzztb/unpinned_daily_discussion_thread_for_april_16_2021/h09rm2m/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1622631979.0
    },
    {
        "author": "Sandvicheater",
        "body": "Hey MSFT ceo Nutella, go buy BB and get back into the phone market with your windows phones",
        "created_utc": 1622662905,
        "id": "h0comer",
        "permalink": "/r/wallstreetbets/comments/nqi9f6/daily_discussion_thread_for_june_02_2021/h0comer/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1622691705.0
    },
    {
        "author": "Shandowarden",
        "body": "i dont disagree but damn this shit is getting repetitive. as if there are no other stocks apart from baba, aapl, msft, amzn in this sub",
        "created_utc": 1622553615,
        "id": "h06uwlh",
        "permalink": "/r/stocks/comments/npsja8/alibaba_baba_undervalued/h06uwlh/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1622582415.0
    },
    {
        "author": "aGunInMyPants",
        "body": "You catch the conference today?  Microsoft forecasts cloud customers to almost double, from 280 million to 500 million.  They currently service 3% of Microsoft customers and have the goal of the 10%.  That could put them at 1 billion revenue mark.  They aren’t in need of cash in my opinion. Heck, Ave Point spent 1.6 million buying APXT stock.  How many times do you see that?",
        "created_utc": 1622599706,
        "id": "h09kxr5",
        "permalink": "/r/SPACs/comments/nq6jwt/june_is_a_big_month_for_despacs_which_ones_will/h09kxr5/",
        "score": 6,
        "subreddit": "SPACs",
        "created": 1622628506.0
    },
    {
        "author": "four1six_",
        "body": "Sem2sem.\n\nAlso I doubled down on my MSFT.",
        "created_utc": 1622658931,
        "id": "h0cf6jn",
        "permalink": "/r/wallstreetbets/comments/mrzztb/unpinned_daily_discussion_thread_for_april_16_2021/h0cf6jn/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1622687731.0
    },
    {
        "author": "DoesntUnderstandJoke",
        "body": "Any boomers buying the Msft dip?  Easy 20% baby gains",
        "created_utc": 1622661198,
        "id": "h0ckkw9",
        "permalink": "/r/wallstreetbets/comments/nqi9f6/daily_discussion_thread_for_june_02_2021/h0ckkw9/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1622689998.0
    },
    {
        "author": "Neo1331",
        "body": "Honestly just more comfortable with SPY. I also hold some AAPL/MSFT as well and I come from tech and just feel more comfortable with it. I also don't plan to do it forever, I use the funds to build out my portfolio.",
        "created_utc": 1622638577,
        "id": "h0b3xpz",
        "permalink": "/r/options/comments/nqbgku/anyone_here_only_trades_spy/h0b3xpz/",
        "score": 5,
        "subreddit": "options",
        "created": 1622667377.0
    },
    {
        "author": "restlessleg",
        "body": "is msft moving at a hundredth of a cent again?",
        "created_utc": 1622560391,
        "id": "h07907b",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h07907b/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1622589191.0
    },
    {
        "author": "four1six_",
        "body": "LOL\n\n&gt; theycallme1\n\n&gt; MSFT puts are ruining me. Holding, still have faith this bitch gonna drop.",
        "created_utc": 1622672590,
        "id": "h0db1dg",
        "permalink": "/r/wallstreetbets/comments/mrzztb/unpinned_daily_discussion_thread_for_april_16_2021/h0db1dg/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1622701390.0
    },
    {
        "author": "Disposable_Canadian",
        "body": "Its nots truggling, it's been crushing earnings quarter after quarter and is the way forward for work.  It's just went 191% y/y lol\n\n\nPlus discord msft deal didn't happen  and the alternative is teams.  Zoom is secure and has some moat for now.",
        "created_utc": 1622579599,
        "id": "h08gfyj",
        "permalink": "/r/stocks/comments/nppzux/rstocks_daily_discussion_technicals_tuesday_jun/h08gfyj/",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622608399.0
    },
    {
        "author": "blackswansus",
        "body": "MSFT - world trade would stop without Excel.\n\nFB - the worlds favorite advertising medium\n\nEL - grooming is a DNA powered urge.\n\nV - cash is dying\n\nYou don't need new winners, existing winners can continue to win.",
        "created_utc": 1622582453,
        "id": "h08mmni",
        "permalink": "/r/StockMarket/comments/nq41o1/looking_back_we_see_obvious_investments_what_are/h08mmni/",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1622611253.0
    },
    {
        "author": "Sandvicheater",
        "body": "I have the all 3 retarded trifecta (gme bb AMC) so I ain't adding any more to that shit. I'm gonna add more to safe shit like MSFT and AAPL",
        "created_utc": 1622583280,
        "id": "h08odxl",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h08odxl/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1622612080.0
    },
    {
        "author": "DPurp4",
        "body": "Interesting day. Down on AAPL, ARKK, BRKB, MSFT, QQQ and TSLA. Up on BA, BABA, GOOGL, and VTI. \n\nIn total, very slightly in the red, but pretty much a wash. Hope some of y’all did better than me today",
        "created_utc": 1622577817,
        "id": "h08ckiz",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h08ckiz/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1622606617.0
    },
    {
        "author": "Ur_moms_box69",
        "body": "Damn looking back on it, MSFT was a horrible choice to buy calls for",
        "created_utc": 1622583665,
        "id": "h08p7rm",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h08p7rm/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1622612465.0
    },
    {
        "author": "gorays21",
        "body": "M - Microsoft \n\nA - Apple \n\nD - Disney",
        "created_utc": 1622621152,
        "id": "h0ahjqc",
        "permalink": "/r/stocks/comments/nq9bh1/what_one_stock_do_you_think_has_the_least_risk_in/h0ahjqc/",
        "score": 4,
        "subreddit": "stocks",
        "created": 1622649952.0
    },
    {
        "author": "Ur_moms_box69",
        "body": "Man F U msft🙄",
        "created_utc": 1622559342,
        "id": "h076q51",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h076q51/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1622588142.0
    },
    {
        "author": "meta-cognizant",
        "body": "PLTR at least has a bull case. AMC doesn't. I've evidently been here longer than you have because WSB used to meme solid companies, like MU and MSFT. Everything divorced from the underlying will eventually crash. I'd rather not buy calls on something that has no reason to be as high as it is.",
        "created_utc": 1622632967,
        "id": "h0av4tr",
        "permalink": "/r/wallstreetbets/comments/npzfzx/a_reminder_that_ceos_are_not_wsbers/h0av4tr/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1622661767.0
    },
    {
        "author": "GapOne2569",
        "body": "How many times I got to tell you no, I'm not restarting my computer. \n\nFuck off, Microsoft.",
        "created_utc": 1622562170,
        "id": "h07d08m",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h07d08m/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1622590970.0
    },
    {
        "author": "RewPurt",
        "body": "Closed my MSFT for a BB yolo, just cycle the profits back into value after bruh",
        "created_utc": 1622681886,
        "id": "h0dty0w",
        "permalink": "/r/wallstreetbets/comments/nquubf/what_are_your_moves_tomorrow_june_03_2021/h0dty0w/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622710686.0
    },
    {
        "author": "McCandlessDK",
        "body": "I am holding AMC(dohh) and maybe buying some more Microsoft, if they go red again tomorrow",
        "created_utc": 1622580424,
        "id": "h08i82y",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h08i82y/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622609224.0
    },
    {
        "author": "The_Folkhero",
        "body": "FB is a long term core holding for me. Undervalued! Facebook is the best value in FAAG/MSFT. Lowest market cap = more runway left for appreciation. Best valuation with lowest P/E and P/Cash Flow. Has the most untapped revenue verticals (video, AR/VR, payments, Angie's List type of service referrals, hardware (Portal/Oculus), dating, WhatsApp and Instagram.",
        "created_utc": 1622624070,
        "id": "h0akojn",
        "permalink": "/r/stocks/comments/nqdhp3/fb_overvalued_or_undervalued/h0akojn/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1622652870.0
    },
    {
        "author": "LargeHotdog",
        "body": "Puts on Microsoft. I want a refund on my windows 10 pro keys. Every week I get a call at work that our software isn’t working. Only happens after windows 10 decides to update itself after I said NO.",
        "created_utc": 1622558731,
        "id": "h075dzk",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h075dzk/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622587531.0
    },
    {
        "author": "JDubbs0098",
        "body": "When was the last time a gaming console that wasn't from one of the big three (Microsoft, Sony, Nintendo) got anywhere?",
        "created_utc": 1622593888,
        "id": "h099pce",
        "permalink": "/r/Wallstreetbetsnew/comments/nq8c4a/atari_pongf/h099pce/",
        "score": 3,
        "subreddit": "Wallstreetbetsnew",
        "created": 1622622688.0
    },
    {
        "author": "Strongest-There-Is",
        "body": "I’m with you. I’ve got a little exposure to Baidu, Tencent, and Alibaba. I’m eyeing JD but have been using those funds to snatch up currency during the current dip. \n\nAlso, I like how you have the comparison right there. One suggestion though: if you have a 4 set like FB, MSFT, Goog, APPL, then you should use the same 4 set in the next comparison. Amazon is more apples to apples.",
        "created_utc": 1622549696,
        "id": "h06o620",
        "permalink": "/r/stocks/comments/npsja8/alibaba_baba_undervalued/h06o620/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1622578496.0
    },
    {
        "author": "Ok_Customer2455",
        "body": "Microsoft bought Skype for 8,5 billion!.. what a bunch of idiots! I downloaded it for free!",
        "created_utc": 1622562182,
        "id": "h07d183",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h07d183/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622590982.0
    },
    {
        "author": "exe_virus",
        "body": "Here's my normal recommendations for someone starting out:\n\nLearn \"time value of money\" like the back of your hand. You should be able to apply it to any aspect of your life, a company, a purchase decision, a loan, etc. You should be able to know, for your own financial situation, if it's better to delay a payment for 6 months if that costs you $3 now.\n\nThen learn Discounted cash flow models, which is #1 applied to companies and stocks.\n\nLearn about financial statements and how they represent the underlying business. I.e. if you are studying, say, Microsoft, understand where their coats are, what makes them most of their money, where they are investing that money, and what they have loans for, if any.\n\nLearn about macro economics, such as how government policy can affect companies. A good current example is that US stimulus for the unemployed is quite generous and is a strong disincentive for low wage labor to find work. This is causing major inflation pressures or shortages in low wage industries. Other examples include central bank policies, inflation in general, droughts and floods and natural disasters, etc.\n\nLearn how to visualize and imagine the future lives of people, and what kinds of services/goods they will use or need. At the end of the day, all this learning relies on good understandings of the future to be profitable.\n\nAs for how to buy and sell, that's called a \"Brokerage\" and I recommend Fidelity, Schwab, Vangaurd, and if you really, truly must, Robinhood (don't they have mediocre support, taxes, and security). The more professional ones will help you learn more.\n\nWord of warning: don't touch options for at least 3-5 years from now. I still haven't started using them and making plenty (30%+) returns without that or leverage in general.",
        "created_utc": 1622584154,
        "id": "h08q9jf",
        "permalink": "/r/investing/comments/nppkph/daily_advice_thread_all_basic_help_or_advice/h08q9jf/",
        "score": 3,
        "subreddit": "investing",
        "created": 1622612954.0
    },
    {
        "author": "sparkyladder",
        "body": "AAPL was generous to me today but I still want to see $130+ before mid-June. Kinda silly we haven’t seen legitimate growth since August yet it’s been having record quarters each time. Very undervalued compared to a lot of tech, with MSFT an exception perhaps",
        "created_utc": 1622671200,
        "id": "h0d81oz",
        "permalink": "/r/wallstreetbets/comments/nquubf/what_are_your_moves_tomorrow_june_03_2021/h0d81oz/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622700000.0
    },
    {
        "author": "discovery999",
        "body": "MSFT",
        "created_utc": 1622596017,
        "id": "h09dtdi",
        "permalink": "/r/stocks/comments/nq9bh1/what_one_stock_do_you_think_has_the_least_risk_in/h09dtdi/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1622624817.0
    },
    {
        "author": "FellowFellow22",
        "body": "Well, I YOLO'd some Microsoft calls when it dipped a couple weeks back and doubled down when it continued to go down. \n\nMy couple grand has become a couple hundred so that's a bummer.",
        "created_utc": 1622654220,
        "id": "h0c3lnf",
        "permalink": "/r/wallstreetbets/comments/nqi9f6/daily_discussion_thread_for_june_02_2021/h0c3lnf/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622683020.0
    },
    {
        "author": "caronanumberguy",
        "body": "Because Microsoft sucks.",
        "created_utc": 1622577599,
        "id": "h08c324",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h08c324/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622606399.0
    },
    {
        "author": "four1six_",
        "body": "Billy MSFT is going down on me and not in the fun way",
        "created_utc": 1622655367,
        "id": "h0c6h5y",
        "permalink": "/r/wallstreetbets/comments/mrzztb/unpinned_daily_discussion_thread_for_april_16_2021/h0c6h5y/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622684167.0
    },
    {
        "author": "djb25",
        "body": "If you think about it, G🛑 is basically nintendo, sony and microsoft combined.",
        "created_utc": 1622549948,
        "id": "h06oju1",
        "permalink": "/r/wallstreetbets/comments/mrzztb/unpinned_daily_discussion_thread_for_april_16_2021/h06oju1/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622578748.0
    },
    {
        "author": "jgbailey7070",
        "body": "Can someone give me a read on MSFT? \n\nI see it as neither a tech stock nor a cyclical stock but more of a fresh dog turd melting in the hot sun.",
        "created_utc": 1622681923,
        "id": "h0du0oo",
        "permalink": "/r/wallstreetbets/comments/nquubf/what_are_your_moves_tomorrow_june_03_2021/h0du0oo/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622710723.0
    },
    {
        "author": "RobertsonvsPhillips",
        "body": "And IVAS, you mentioned it but we'll see revenue from that 10bil over 10yrs with the military and Microsoft.",
        "created_utc": 1622682212,
        "id": "h0dulpe",
        "permalink": "/r/wallstreetbets/comments/nqv2ic/vldr_velodyne_lidar_is_going_to_the_moon/h0dulpe/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622711012.0
    },
    {
        "author": "NOTHlNGBUTNET",
        "body": "MSFT dumping makes sense because it‘s one of the biggest cash generators with one of the highest cash reserves",
        "created_utc": 1622577419,
        "id": "h08bp0i",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h08bp0i/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622606219.0
    },
    {
        "author": "send_me_your_GUH",
        "body": "Cloud gaming is a thing. They can do a Microsoft partnership",
        "created_utc": 1622585820,
        "id": "h08tqwj",
        "permalink": "/r/stocks/comments/npo298/amd_and_tesla_team_up/h08tqwj/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622614620.0
    },
    {
        "author": "StephenElliott",
        "body": "Yup.\n\nImagine if TSLA, MicroSoft and Google/Apple also got on board.",
        "created_utc": 1622614787,
        "id": "h0aa6cb",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h0aa6cb/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622643587.0
    },
    {
        "author": "WrongYak34",
        "body": "I bought a bunch of msft today. I have 700$usd or so left. What is something half decent to buy and hold? \n\nI’m debating more YETI it’s done well for me and I’d be averaging up",
        "created_utc": 1622562331,
        "id": "h07dd87",
        "permalink": "/r/CanadianInvestor/comments/npqemz/daily_discussion_thread_for_june_01_2021/h07dd87/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1622591131.0
    },
    {
        "author": "The_Three_Nuts",
        "body": "Msft leaps look fun to me though. 80% chance I get some tomorrow.\n\nWhat's your expirey?",
        "created_utc": 1622567785,
        "id": "h07py9u",
        "permalink": "/r/wallstreetbets/comments/mrzztb/unpinned_daily_discussion_thread_for_april_16_2021/h07py9u/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622596585.0
    },
    {
        "author": "NOTHlNGBUTNET",
        "body": "MSFT dumping makes sense because it‘s one of the biggest cash generator with one of the highest cash reserves",
        "created_utc": 1622577419,
        "id": "h08bp0j",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h08bp0j/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622606219.0
    },
    {
        "author": "The_Liberal_Agenda",
        "body": "What is even down today? Seems most things are up at least a little. Besides Microsoft.",
        "created_utc": 1622653177,
        "id": "h0c105p",
        "permalink": "/r/stocks/comments/nqhts8/rstocks_daily_discussion_wednesday_jun_02_2021/h0c105p/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622681977.0
    },
    {
        "author": "Kay312010",
        "body": "FTNT\n\nMSFT\n\nFB\n\nCROX\n\nVSTO\n\nAMC\n\nBB",
        "created_utc": 1622684988,
        "id": "h0e03a1",
        "permalink": "/r/investing/comments/nqk9zr/what_are_your_winners_for_2021/h0e03a1/",
        "score": 2,
        "subreddit": "investing",
        "created": 1622713788.0
    },
    {
        "author": "Ur_moms_box69",
        "body": "MSFT needs to gap up 2% to save my balls",
        "created_utc": 1622580611,
        "id": "h08imk9",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h08imk9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622609411.0
    },
    {
        "author": "comeonsexmachine",
        "body": "I bought AAPL alongside MSFT. With the job posting for a crypto specialist, eventually an electric vehicle in the works and the amount of brand loyalty they still have, I think it's a great long hold.",
        "created_utc": 1622568359,
        "id": "h07r9ot",
        "permalink": "/r/CanadianInvestor/comments/npqemz/daily_discussion_thread_for_june_01_2021/h07r9ot/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1622597159.0
    },
    {
        "author": "Chance_Island2704",
        "body": "Of the three, MSFT is my biggest holding. AAPL never ceases to disappoint me and I own 0 in GM.",
        "created_utc": 1622558657,
        "id": "h07588f",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h07588f/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622587457.0
    },
    {
        "author": "Not99Percent",
        "body": "MSFT is moving better compared to BA",
        "created_utc": 1622560564,
        "id": "h079e5o",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h079e5o/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622589364.0
    },
    {
        "author": "RecreationalNukes",
        "body": "I make more trading options than I do at my career job \n\nAAPL\n\nMSFT\n\nNVDA\n\nAMD\n\nPBI\n\n&amp;#x200B;\n\nall have been good to me",
        "created_utc": 1622547167,
        "id": "h06kfqs",
        "permalink": "/r/options/comments/np9abl/selling_options_as_a_strategy_for_weekly_income/h06kfqs/",
        "score": 2,
        "subreddit": "options",
        "created": 1622575967.0
    },
    {
        "author": "coren77",
        "body": "First, the Microsoft hololens uses mvis for the core component.  So while they aren't showing significant profits yet, it's only a matter of time.  \n\nSecond, from that earnings report: Another major advantage of our technology is its capability to demonstrate \r\nscalability. To demonstrate this, we successfully developed and installed our long-range lidar \r\nsensor pilot line in Redmond. This pilot line is sophisticated. It includes six custom active \r\nalignment stations that our team developed working with our automation partners to enable \r\nscalability and performance. Our team has launched multiple pilot lines in the past for our \r\ndisplay, augmented reality, and interactive display products. \n\nHe goes on to say:\nThis pilot line will allow us to validate designs and manufacturing processes in house \r\nin faster cycles. We expect limited quantities produced from this line will support exploring \r\npotential partnerships. This pilot line will also enable us to take our designs, process maps and \r\ncontrol plans, and launch a new highly automated production line to support expected initial \r\nsales inventory in the second half of 2021 through a contract manufacturer. This future \r\nproduction line in Asia will eventually have the capacity to produce between 12-15 thousand \r\nsensors per year starting sometime in 2022. The purpose of this second line is to show the next \r\nlevel of scaling. The ultimate capacity of this production line can be adjusted to meet volumes \r\nas required prior to mass production in the 2024-25 timeframe.\n\nThey also just released mems version 5.\n\nThey have enough money on hand to last years if needed, but they don't.",
        "created_utc": 1622670752,
        "id": "h0d72eo",
        "permalink": "/r/wallstreetbets/comments/nqv2ic/vldr_velodyne_lidar_is_going_to_the_moon/h0d72eo/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622699552.0
    },
    {
        "author": "OkActinomycetaceae72",
        "body": "no google microsoft amazon starbucks amc nio amd nvdia",
        "created_utc": 1622628467,
        "id": "h0apjhv",
        "permalink": "/r/StockMarket/comments/nqbp2v/please_poke_some_holes_in_this_portfolio/h0apjhv/",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1622657267.0
    },
    {
        "author": "dairyxox",
        "body": "Why does BlackBerry need a real time OS when their competitors are doing fine without? There's normally a good reason to use a RTOS otherwise it's not worth it. And if you think any company that needs a real time OS cant either purchase or create their own (certainly Apple, Google, Microsoft can do it) then you're mistaken. There's probably some good reason to buy blackberry? - but this isn't it.\n\n[https://en.wikipedia.org/wiki/Comparison\\_of\\_real-time\\_operating\\_systems](https://en.wikipedia.org/wiki/Comparison_of_real-time_operating_systems)",
        "created_utc": 1622680239,
        "id": "h0dqm6o",
        "permalink": "/r/wallstreetbets/comments/nqsgln/bb/h0dqm6o/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622709039.0
    },
    {
        "author": "Historical-Egg3243",
        "body": "MSFT is overvalued too",
        "created_utc": 1622577635,
        "id": "h08c60x",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h08c60x/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622606435.0
    },
    {
        "author": "xbills22",
        "body": "Sup with microsoft ?",
        "created_utc": 1622651469,
        "id": "h0bwiv9",
        "permalink": "/r/wallstreetbets/comments/nqi9f6/daily_discussion_thread_for_june_02_2021/h0bwiv9/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622680269.0
    },
    {
        "author": "Ashtonpaper",
        "body": "I will add this:  if you invest in companies like AAPL and MSFT and ETFs like SPY, you will certainly return a higher % over a longer term period, say 10 to 15 years, than any financial advisor who takes 2%.\n\nI would practically guarantee it.  Unless you invest with Madoff and then get out before the scheme collapses.",
        "created_utc": 1622588286,
        "id": "h08yqxh",
        "permalink": "/r/stocks/comments/npk966/investments_in_blue_chip_stocks_advice_requested/h08yqxh/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622617086.0
    },
    {
        "author": "Gurthang99",
        "body": "Gurthang's Gainers \r  \n\\+0.26% from 5/27/21\r  \n\\+46.56% Lifetime\r  \nI am long on O, STAG, BND, VIG, VYM, AMT, CCI, MSFT, IRM, QCOM, ESTC, ET, LAND, CRLBF, PW\r  \nI like to DRiP monthly payers.",
        "created_utc": 1622633293,
        "id": "h0avla9",
        "permalink": "/r/investing/comments/nqhf08/daily_general_discussion_and_spitballin_thread/h0avla9/",
        "score": 2,
        "subreddit": "investing",
        "created": 1622662093.0
    },
    {
        "author": "College_Prestige",
        "body": "Some companies used to, but the fact that index funds and institutional investors exist means that dividends are more efficient in returning value to shareholders. Who knows maybe one day Microsoft shareholders get discounts",
        "created_utc": 1622654380,
        "id": "h0c3zz4",
        "permalink": "/r/stocks/comments/nqk7qi/amc_to_offer_free_popcorn_and_exclusive/h0c3zz4/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622683180.0
    },
    {
        "author": "ninostsop",
        "body": "No, you can't transfer ETFs to your Roth IRA. If you want you can transfer them to another brokerage (you'll have to pay a fee tho) but not to your IRA. You can sell your assets but you'll pay taxes on your capital gains.   \nI would suggest you keep both. There's nothing wrong with that.\n\nIn my opinion, how you invest your money depends on the amount of time you want to spend researching. If you don't want to spend time researching companies, balance sheets invest with ETFs. If you want to learn more about the stock market and it is something that you enjoy doing, you can go ahead and find companies you like and invest in individual stocks. \n\nIf you go the ETF route you can find ETFs by Fidelity online. I would suggest you invest 50% of your portfolio in an S&amp;P500 ETF and then chose whatever you like. Technology, Semiconductors, Energy, whatever.\n\nIf you want to learn more about stocks you can find everything online. I would suggest watching Peter Lynch and Warren Buffet interviews on youtube or reading Books like \"One Up on Wallstreet\", \"The Intelligent Investor\" and stuff like that. \n\nYou can also do both. You can own an S&amp;P500 ETF and then some stocks like Apple, Microsoft, or whatever you like.",
        "created_utc": 1622650371,
        "id": "h0btq0y",
        "permalink": "/r/stocks/comments/nqovan/20yo_getting_into_stocks_and_starting_a_roth_ira/h0btq0y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622679171.0
    },
    {
        "author": "EvilTwinGhost",
        "body": "Almost every other platform is better. Microsoft has killed them on the corporate level. The only platform shittier is Webex. I am a GoToMeeting guy myself ;)",
        "created_utc": 1622671667,
        "id": "h0d92lw",
        "permalink": "/r/wallstreetbets/comments/nng6r6/most_anticipated_earnings_releases_for_the_week/h0d92lw/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622700467.0
    },
    {
        "author": "BraveLittlePene",
        "body": "Why is Microsoft dumping?",
        "created_utc": 1622577568,
        "id": "h08c0iy",
        "permalink": "/r/wallstreetbets/comments/npqenw/daily_discussion_thread_for_june_01_2021/h08c0iy/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622606368.0
    },
    {
        "author": "manofculture003",
        "body": "If Apple don't move, Amazon don't move, Microsoft don't move, spy will eventually run out of components to move it up. The other tickers are almost all up 10%+ YTD. Eventually even they will become 'fully priced'. Counting on Apple to move up again. At least above 128. Otherwise spy is fuk and it's all sideways or bearish",
        "created_utc": 1622588633,
        "id": "h08zg7l",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h08zg7l/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622617433.0
    },
    {
        "author": "hankhill72",
        "body": "AMZN, MSFT, AAPL, and BRK-B are probably the safest.",
        "created_utc": 1622637736,
        "id": "h0b2fup",
        "permalink": "/r/stocks/comments/nq9bh1/what_one_stock_do_you_think_has_the_least_risk_in/h0b2fup/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622666536.0
    },
    {
        "author": "Dramatic-Routine-919",
        "body": "ARKW here! Then MSFT",
        "created_utc": 1622643070,
        "id": "h0bcxma",
        "permalink": "/r/wallstreetbets/comments/nqi9f6/daily_discussion_thread_for_june_02_2021/h0bcxma/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622671870.0
    },
    {
        "author": "ConfusedinKY2019",
        "body": "I had bought some apple too, because they are a giant right? But I ask myself, what new things have they come out with in the last 10 years? What new things does it seem like they are working on over the next 10 years? Popular Companies tend to start —&gt; grow rapidly —&gt; Stagnate (where I feel Apple is right now) —&gt; Decline and then they either innovate and reinvigorate they brand OR they get eaten alive by the competition. If Apple doesn’t innovate more and stop banking on people buying overpriced phones with minor improvements every year, I actually see them declining over the next 10 years. They need to innovate more into the streaming service arena or the gaming arena or the music arena or something. Without innovation they will get overtaken by someone else (Google? Facebook? Amazon? Microsoft?) it’s possible.",
        "created_utc": 1622564312,
        "id": "h07hwl7",
        "permalink": "/r/stocks/comments/npc0mc/went_against_general_sentiment_here_and_purchased/h07hwl7/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622593112.0
    },
    {
        "author": "blackswansus",
        "body": "FB &amp; MSFT are better stocks and will probably provide a better profit.",
        "created_utc": 1622577075,
        "id": "h08axrm",
        "permalink": "/r/stocks/comments/npc0mc/went_against_general_sentiment_here_and_purchased/h08axrm/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622605875.0
    },
    {
        "author": "CorrosiveRose",
        "body": "Microsoft went Megasoft today",
        "created_utc": 1622577779,
        "id": "h08chkf",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h08chkf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622606579.0
    },
    {
        "author": "Ok_Customer2455",
        "body": "Microsoft bought Skype for 8,5 billion!.. what a bunch of idiots! I downloaded it for free!",
        "created_utc": 1622641401,
        "id": "h0b9e6h",
        "permalink": "/r/wallstreetbets/comments/nqbs4h/amazon_backs_marijuana_legalization_drops_weed/h0b9e6h/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622670201.0
    },
    {
        "author": "gavelTree",
        "body": "Put another way, at current valuation it's market cap is $100B. Do we really think it's worth 1/18th of Microsoft? 1/16th of Amazon? Half of ATT?",
        "created_utc": 1622584623,
        "id": "h08r9ht",
        "permalink": "/r/stocks/comments/nppzux/rstocks_daily_discussion_technicals_tuesday_jun/h08r9ht/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622613423.0
    },
    {
        "author": "syzygyz",
        "body": "FB feels appropriately valued based on cost of money, projected revenue growth, and mega-cap tech (GOOG in particular) valuations--PE of 28.14 (GOOG @ 32.15, MSFT @ 33.71, AAPL @ 27.9).",
        "created_utc": 1622612363,
        "id": "h0a6z25",
        "permalink": "/r/stocks/comments/nqdhp3/fb_overvalued_or_undervalued/h0a6z25/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622641163.0
    },
    {
        "author": "late4Deaner",
        "body": "Buy mvis and check out the subreddit for juicy dd it’s more like a cult of polite apes that didn’t want the company that makes pew pew lasers to get delisted from the stonk exchange so Microsoft could get the Hololens 2 display engine patents for cheaply but behind closed doors papa sharma was prolly like hella naww that offer ain’t enough and now they just dropped best in class lidar so it’ll meme to the moon eventually. Buy leaps or shares and a few short dated calls or even play weeklies until it gaps upward. The first one is free :)",
        "created_utc": 1622684416,
        "id": "h0dyyiv",
        "permalink": "/r/wallstreetbets/comments/nr1st1/what_to_invest/h0dyyiv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622713216.0
    },
    {
        "author": "TreborMAI",
        "body": "To be clear, I started with a few hundred in my RH account but of course added more as time went on and I started to see returns. I've invested a little over 32k in the past 4 years, so about 140% return. \n  \nI got lucky buying SHOP @ $50 and AMD @ $10, but otherwise I just invest every 2 weeks in blue chip stocks and never sell. My portfolio is SHOP, SQ, AMZN, NVDA, MSFT, AMD, AAPL, NFLX, FB, WM, OTLY, DIS, BOTZ.",
        "created_utc": 1622660081,
        "id": "h0chy3e",
        "permalink": "/r/stocks/comments/njgyv3/if_i_hold_a_stock_long_term_and_keep_adding_to_it/h0chy3e/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622688881.0
    },
    {
        "author": "tearedditdown",
        "body": "Apes no like MSFT and hedgies.",
        "created_utc": 1622661763,
        "id": "h0clx3t",
        "permalink": "/r/wallstreetbets/comments/mukwax/mvis_yolo_update_1_still_in_it_to_win_it/h0clx3t/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622690563.0
    },
    {
        "author": "fromcj",
        "body": "Feels like it would lead to manipulation tbh. Like imagine MS is having a rough quarter so they say “all Microsoft stock holders get a free game” or some shit idk. \n\nBasically I could see it being used for bad stuff. Which sucks because it would rule.",
        "created_utc": 1622669825,
        "id": "h0d50zf",
        "permalink": "/r/stocks/comments/nqk7qi/amc_to_offer_free_popcorn_and_exclusive/h0d50zf/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622698625.0
    },
    {
        "author": "I_am_not_a_murderer",
        "body": "MSFT is no match for SKLZ",
        "created_utc": 1622673226,
        "id": "h0dcd08",
        "permalink": "/r/wallstreetbets/comments/nquubf/what_are_your_moves_tomorrow_june_03_2021/h0dcd08/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622702026.0
    },
    {
        "author": "four1six_",
        "body": "MSFT 250Cs\n\nSpy 418C \n\n\n!guh",
        "created_utc": 1622567729,
        "id": "h07ptpu",
        "permalink": "/r/wallstreetbets/comments/mrzztb/unpinned_daily_discussion_thread_for_april_16_2021/h07ptpu/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622596529.0
    },
    {
        "author": "cd7k",
        "body": "PC has Steam, Xbox has Microsoft Store, Sony has Playstation store - the latter two being integrated into the console, making it easy to purchase.  How do you see GameStop improving the customer experience?  Game keys like cdkeys etc...?  Genuinely curious.",
        "created_utc": 1622569858,
        "id": "h07uqja",
        "permalink": "/r/wallstreetbets/comments/npso9s/amc_sells_85_million_shares/h07uqja/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622598658.0
    },
    {
        "author": "four1six_",
        "body": "6/25 for MSFT\n\n6/30 SPY\n\nDoubled down on my MSFT on today's bottom.",
        "created_utc": 1622573249,
        "id": "h082hk9",
        "permalink": "/r/wallstreetbets/comments/mrzztb/unpinned_daily_discussion_thread_for_april_16_2021/h082hk9/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622602049.0
    },
    {
        "author": "Chance_Island2704",
        "body": "MSFT",
        "created_utc": 1622582170,
        "id": "h08m0h3",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h08m0h3/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622610970.0
    },
    {
        "author": "Big-Toe6215",
        "body": "Realize for those believing in a short squeeze that this would be a huge catalyst? \n\nIf your $1b short position didnt move much but your $2b MSFT position is now $1b then you face getting called. \n\nNot that everyone is trading with a squeeze in mind but there's enough meme stock YOLOs posted here that this would be a positive for a lot of people.",
        "created_utc": 1622587078,
        "id": "h08wb0d",
        "permalink": "/r/wallstreetbets/comments/nq32sc/what_are_your_moves_tomorrow_june_02_2021/h08wb0d/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622615878.0
    },
    {
        "author": "cheekygorilla",
        "body": "What are some good stocks or etfs that are geared around automation, deep machine learning and AI; data analytics; cloud and edge computing, managed software services, next-gen finance and marketing?  \n\nSome companies that I can think of include (In no particular order):  \nMicrosoft  \nJP Morgan  \nOracle  \nGoogle  \nAmazon  \nInfosys  \nAdobe  \nDocusign  \nTSMC  \nDLR  \nEquinix  \nNVIDIA",
        "created_utc": 1622605259,
        "id": "h09vipy",
        "permalink": "/r/investing/comments/nppldq/daily_general_discussion_and_spitballin_thread/h09vipy/",
        "score": 1,
        "subreddit": "investing",
        "created": 1622634059.0
    },
    {
        "author": "devilmaskrascal",
        "body": "They didn't though. Google, Facebook, Microsoft and other stable growth stocks have been fine, while others like Amazon have simply traded sideways.\n\nIt was the ones that were hotly day traded and speculative that got killed.\n\nBonds are still historically speaking low as hell.",
        "created_utc": 1622683174,
        "id": "h0dwib5",
        "permalink": "/r/SPACs/comments/nq8r7d/were_we_victims_of_our_own_success_could_tax/h0dwib5/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1622711974.0
    },
    {
        "author": "SelkirkRanger",
        "body": "Tech: NVDA, AAPL, and MSFT. \nConsumer/e-commerce: COST, BABA, and AMZN. \nMaterials/miners: MT (sleeping steel giant), NTR, WFG, BHP, GOLD, and PAAS. \nFin-tech: POW.TO (my largest position), V, and SQ.\nHealthcare: JNJ (my second largest position).",
        "created_utc": 1622660754,
        "id": "h0cjjyi",
        "permalink": "/r/investing/comments/nqk9zr/what_are_your_winners_for_2021/h0cjjyi/",
        "score": 1,
        "subreddit": "investing",
        "created": 1622689554.0
    },
    {
        "author": "dicksonlyplease",
        "body": "Here’s some boomer shit - If you’re up big on AMC, let’s be honest, the smart thing to do would be the rollover the money into VTI or VOO. AAPL, MSFT, AMZN, etc. I’ve been playing semi conductors lately as well (SOXL on down days).",
        "created_utc": 1622654458,
        "id": "h0c46xf",
        "permalink": "/r/wallstreetbets/comments/nqi9f6/daily_discussion_thread_for_june_02_2021/h0c46xf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622683258.0
    },
    {
        "author": "HaveBlue_2",
        "body": "&gt; no matter the trajectory of a stock. Even after being in deep red earlier this year, and finally realizing some profits, I can't help but think about the \"could haves\".  \n&gt;  \n&gt;I need to realign and shift perspectives, even though I know that's the path to heavy losses, how do you guys deal with?\n\nOversaturation with $600 ain't a thing unless it's a really risky, or really underperforming, choice.  MSFT and APPL are solid performers.  \n\nYes, diversification is a thing... but perhaps that would be with something more like $4k or $10k total.",
        "created_utc": 1622546696,
        "id": "h06js5e",
        "permalink": "/r/stocks/comments/nohefp/the_more_i_gain_the_more_i_get_greedy_how_do_you/h06js5e/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1622575496.0
    },
    {
        "author": "TruthHurtsLessThan",
        "body": "I believe you are biased. When was the last time you used a Samsung phone and I don't mean picked up for 10 minutes. I mean used a whole day? Obviously its between Apple and Samsung and I used both. Samsung I would say they definitely give their users more options. Apple definitely has a great user experience; simplicity.\n\nNokia? Why not dust the cob webs off the Motorola Razor, haha. no thank you.",
        "created_utc": 1622543769,
        "id": "h06g3er",
        "permalink": "/r/wallstreetbets/comments/noual3/samsung_heavy_shorts/h06g3er/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1622572569.0
    }
]