[
    {
        "author": "DrBoo-T-Hole",
        "body": "Reposting an edited version of someone's list of dots to be connected for MVIS and the imminent BO that is upon us. Not to even mention the SQUEEEEEEEEZE \n\n&amp;#x200B;\n\nMicrovision (MVIS) dots\n\nNo fireside chat after Q4 2020 earnings call\n\nDavid has not been able to directly answer most  investor's questions over email or the phone.\n\n“⁠Best in class LIDAR” used by Sumit during EC. “No competition in any verticals” used by Sumit\n\nSumit has staked his and MVIS entire reputation on Lidar completion in April\n\nSumit can’t contain himself in EC and references the current state of MVIS to the internet boom as a simile for his excitement.\n\nYalon Farhi (the funds that kept MVIS alive) retires. Yalon Farhi hasn’t sold.\n\nDavid Westgor retirement. David Westgor hasn’t sold.\n\n$50M ATM to unknown party finished in very quickly time.\n\nFord announced a stake in VLDR in Q3 2020 and Judy Curran (Ford) joins the Microvision board in Dec,2020.\n\nFord and Google partnership and Microvision add multiple board of directors from these two companies.\n\nFord sold its position in VLDR - Mid feb 2021\n\nSeval Oz joins the board *”I am thrilled to join the MicroVision board of directors at this opportune time. I am excited to bring my expertise and experience in autonomous vehicle technology and mobility to the Company as it develops its automotive lidar technology and explores strategic alternatives.”*\n\nSeval Oz still hasn’t filed a Form 4\n\nBYD posts on LinkedIn “We believe in Microvision” BYD posts again on LinkedIn that we are better than Lumimar\n\n⁠Ever growing new jobs listing for MVIS\n\nJudy Curran is “Head of Automotive Global Strategy” for ANSYS. ANSYS could conduct testing for interested parties to have benchmark data.\n\nMicrovision is not attending CES (Worlds largest AR/MR/VR conference) *hololens is the best selling AR in the world*\n\nState of Michigan has purchased 1 Million SHARES of MVIS *not 1 million worth of MVIS, SHARES* (2/1/21)\n\nBlack rock buys 2.4 million SHARES (2/5/21)\n\nLIDAR sample update in April time frame.\n\nEarnings Call and Annual Share Holder meeting in May. \n\nChris Grayson thinks Niatech (Google owned) has “a confident guess” that they will be using microvision light engines. from [u/s2upid](https://www.reddit.com/u/s2upid/)\n\nIntel awards Hololens 2 a supplier achievement award through a pandemic\n\nMicrovision follows Elon on Twitter (3/30)\n\nShorts are driving MVIS pps down\n\nNobody’s defending the price.\n\nNot even counting patent filings for lasers and scanning devices from MANY interested parties ranging from US to a GLOBAL scale.\n\nTesla crashing causing increase in eyes needing regulation.\n\nMore and MORE FUD across all platforms. The only real argument is that we don’t have a working product that anyone has seen and very little revenue.\n\nMicrosoft wins $22 BILLION contract to supply the US Army with IVAS headsets (based on Hololens 2 which we know for a fact MVIS is in)\n\nForm 8-K is filed where CEO Sumit Sharma agrees to 3 year contract to be compensated with 900,000 shares. \n\nThis is just the tip of everything that is going on and I don't have much foreskin in the game but have about 30 July calls and 500 shares @ $14\n\nP.S. I LOVE THIS STOCK",
        "created_utc": 1618940605,
        "id": "gv862i1",
        "permalink": "/r/wallstreetbets/comments/mugv4v/cramer_it_has_a_gigantic_short_position_avoid/gv862i1/",
        "score": 31,
        "subreddit": "wallstreetbets",
        "created": 1618969405.0
    },
    {
        "author": "TrumpFamilySyndicate",
        "body": "I should do some DD on ANSS and ADBE. They've been banging the last month.",
        "created_utc": 1618511428,
        "id": "gumts1g",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/gumts1g/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618540228.0
    },
    {
        "author": "SwaggyJ505",
        "body": "They are actually in the process of field testing it via Ansys which is headed up by one of its board members Judy Curran! She was a former executive at Ford for 32 years and she just joined Microvisions board of directors late last year. According to Sharma the initial tests were a success and beyond the expectations of the interested parties. The lidar is based on the same technology that Microsoft uses in their flagship product (Hololens 2)! That's a real and proven product; they are not a joke!",
        "created_utc": 1618917043,
        "id": "gv6t623",
        "permalink": "/r/wallstreetbets/comments/mugv4v/cramer_it_has_a_gigantic_short_position_avoid/gv6t623/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618945843.0
    },
    {
        "author": "Tasteless_Salt",
        "body": "8th semester mechanical engineering student here. I use both AutoCAD (2d drawings) and Inventor (3D drawings, analysis) daily.\n\nAutoCAD is terrible, and i only use it because it can make nice technical drawings for reports. Everything in the software is so awkward and non intuitive. I could honestly not imagine a company, serious about it's spendings, use money on this. Yet it's the industry standard.\n\nInventor is amazing for 3D drawings/ solid models. Very intuitive, can easily read parameters from Excel sheets, and in general very effective at parametric design just works. The FEM (analysis) part is quite over simplified, and the competitor ANSYS does a MUCH better job. \n\nIf I were a company, I would probably not pay to have my engineers use Autodesk software, and thus, would not invest in their stock.",
        "created_utc": 1617568977,
        "id": "gtdsx8g",
        "permalink": "/r/stocks/comments/mjwx90/thoughts_on_autodesk/gtdsx8g/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617597777.0
    },
    {
        "author": "Oscar_O_Connell",
        "body": "I think some sunny DD might do you good. Look up ANSYS and the role that that MVIS will most likely play in every autonomous vehicle manufactured... that’s just one vertical.",
        "created_utc": 1619226231,
        "id": "gvmsmnk",
        "permalink": "/r/RobinHoodPennyStocks/comments/mx3ysr/did_anyone_els_give_up_on_mvis/gvmsmnk/",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1619255031.0
    },
    {
        "author": "kkInkr",
        "body": "ZTS, CDNS, SNPS, ANSS, TER",
        "created_utc": 1618724286,
        "id": "guxwrsz",
        "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/guxwrsz/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618753086.0
    },
    {
        "author": "rusbus720",
        "body": "What is this nonsense, she’s speaking on behalf of ansys",
        "created_utc": 1619030165,
        "id": "gvcqwix",
        "permalink": "/r/wallstreetbets/comments/mvcct1/daily_discussion_thread_for_april_21_2021/gvcqwix/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1619058965.0
    },
    {
        "author": "MyopiaCapital",
        "body": "1) Buy AVGO\n\n2) Collect dividends\n\n3) Hang out",
        "created_utc": 1617307410,
        "id": "gt2gvv2",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt2gvv2/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617336210.0
    },
    {
        "author": "Zachjsrf",
        "body": "Used to work for the Broadcom (AVGO) co founder (the crazy one) and as it turns out I've hooked up with his girlfriend 🤣 Fuck that guy.",
        "created_utc": 1617752442,
        "id": "gtmoefe",
        "permalink": "/r/wallstreetbets/comments/mlkbp6/what_are_your_moves_tomorrow_april_07_2021/gtmoefe/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617781242.0
    },
    {
        "author": "X-Boozemonkey-X",
        "body": "Im a SOXL bull. Here's my take. NVDA at some point will take a breather. AMD has room to run but is not a big part of SOXL. TSM has room to run. LRCX, AVGO, INTC, TXN, ADI, SOXX, and MU are near all time highs.\n\nThere is no doubt in my mind that the demand for chips is through the roof amd will remain high. Every industry thats booming needs them. The shortage is a positive thing for us. Demand is high. We dont want a glut. We want to operate at a slight shortage. That said, we will need perfect numbers to start the next leg up or a breather to let things cool off. Ive been hoarding shares on the dips and am selling covered calls and cash secured puts and then putting the money towards more shares.",
        "created_utc": 1618499142,
        "id": "gum1eqs",
        "permalink": "/r/wallstreetbets/comments/mrbmfj/daily_discussion_thread_for_april_15_2021/gum1eqs/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1618527942.0
    },
    {
        "author": "Katermickie",
        "body": "&gt;Katermickie\n\nDid you fix it? I still see it happening also for AVGO but maybe I'm missing something?",
        "created_utc": 1617875840,
        "id": "gtsitz9",
        "permalink": "/r/ValueInvesting/comments/mjn9bq/created_a_research_tool_to_structure_business/gtsitz9/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1617904640.0
    },
    {
        "author": "felunk",
        "body": "I love the amazon is getting into the business so every stock related dumps....WBA, WMT, AVGO, netflix you name it has dumped on that news....ez money everytime....",
        "created_utc": 1617842389,
        "id": "gtr5s7o",
        "permalink": "/r/stocks/comments/mmcdjp/whats_your_thoughts_on_teladoc_inc_tdoc/gtr5s7o/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617871189.0
    },
    {
        "author": "Mr_Anomalistic",
        "body": "Semiconductor is always solid. Qualcomm, broadcom, skyworks...etc. They supple chips that goes into apple phones and other electronic devices.",
        "created_utc": 1618391472,
        "id": "gugvwhx",
        "permalink": "/r/stocks/comments/mqllnj/looking_to_add_more_big_tech_to_my_portfolio/gugvwhx/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618420272.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "MasterCard \nBroadcom\nApple\nBerkshire Hathaway \nShopify\nVisa\nEnphase Energy\nNvidia\nTeradyne\nQORVO\nZebra \nEtsy\nAmazon \nGoogle\nCitigroup \nREGI \n\n\nNot in any particular order, MasterCard, Apple and Nvidia are the largest positions each around 10%",
        "created_utc": 1617769309,
        "id": "gtnjbpg",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gtnjbpg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617798109.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "Lol I own about 70 companies at this point but many of them only make up 1% or less of a 250k portfolio. Largest holdings are \n\nApple\nAmazon \nNVDA \nMasterCard \nVisa\nBroadcom\nBerkshire Hathaway \nSquare\nChevron\nGOOGL",
        "created_utc": 1617920947,
        "id": "gtv5l37",
        "permalink": "/r/stocks/comments/mmz6hl/for_those_owning_30_stocks_why/gtv5l37/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617949747.0
    },
    {
        "author": "PremiumRedditContent",
        "body": "Broadcom - Capital and dividend growth combined",
        "created_utc": 1617966484,
        "id": "gtx1cda",
        "permalink": "/r/stocks/comments/mn9kbq/if_you_had_10000_what_would_you_spend_it_on/gtx1cda/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617995284.0
    },
    {
        "author": "SpartanArmy35",
        "body": "AMZN AVGO COIN SQ V",
        "created_utc": 1618692570,
        "id": "guwedn2",
        "permalink": "/r/stocks/comments/msqx2g/5_stock_picks_for_the_next_5_years/guwedn2/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618721370.0
    },
    {
        "author": "Offduty_shill",
        "body": "I use T as my savings account, shit doesn't move but does give nice dividends. AVGO is also a candidate for a great company whose stock actually moves and you get a pretty fat dividend.",
        "created_utc": 1617302447,
        "id": "gt265jv",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt265jv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617331247.0
    },
    {
        "author": "toydan",
        "body": "WBA T AVGO SWKS QCOM HD PFE ABBV. \n\nlots out there.",
        "created_utc": 1617298884,
        "id": "gt1yejo",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt1yejo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617327684.0
    },
    {
        "author": "kkInkr",
        "body": "There are bunch of chip companies, why just focus on AMD, NVDA, INTC, TSM.\n\nADI, AMAT, ASML, ATEYY, AVGO, KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI, QCOM, QRVO, SIMO, SWKS, TER.\n\nThere's also some small ones: Pixelworks, Himax.\n\nThere's also the design part: CDNS, SNPS.",
        "created_utc": 1617547643,
        "id": "gtcnpap",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcnpap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617576443.0
    },
    {
        "author": "caem123",
        "body": "AVGO abuses the dividend system.  AVGO grows dividend payments faster than revenue growth, which sounds great, but AVGO is now sending out 25% of revenue as dividend, which is in addition to even more cash going out for interest on debts.  Each time I check AVGO's dividend numbers, they keep pushing this up while investors assume the trend will never end:  25% revenue, then 30% revenue, then 35% revenue....  I guess until 100% of revenue?\n\nSo, yea, AVGO has spectacular dividend metrics.  Stellar!  I agree.  But 100% UNSUSTAINABLE!",
        "created_utc": 1618758085,
        "id": "guz3b7i",
        "permalink": "/r/stocks/comments/mtb35f/a_plea_for_the_dividend/guz3b7i/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618786885.0
    },
    {
        "author": "Agatha_Dunlap",
        "body": "AVGO",
        "created_utc": 1617294223,
        "id": "gt1nw6z",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt1nw6z/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617323023.0
    },
    {
        "author": "kilo_L33t3r",
        "body": "HP has massive government contracts. Sun was mostly a software company and Oracle still is, but the major hardware companies like Apple, Qualcomm, Broadcom, IBM, Dell, HP, AMD, and Intel all survived and thrived during and after the bubble.",
        "created_utc": 1617948303,
        "id": "gtwhcgt",
        "permalink": "/r/ValueInvesting/comments/mn56dy/everybody_is_a_long_term_investor_until_the/gtwhcgt/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1617977103.0
    },
    {
        "author": "Kashm11r",
        "body": " AMD MU NVDA TSM AMAT INTC AAPL AVGO QCOM MRVL TXN NXPI QRVO SWKS CRUS",
        "created_utc": 1617593046,
        "id": "gtezt1p",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gtezt1p/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617621846.0
    },
    {
        "author": "FinMarketGeometry",
        "body": "It sounds like your goal is to generate passive income rather than long term capital gains. If so, it is not such a good idea investing in qqq.  As of 4/5/2021, I see qqq ETF is most likely reach 330 in a week and make all time new high in a month. However, it cannot go straight up without pullback. Sometimes those pullback could be very deep. The worst thing could happen is that qqq falls to the very bottom when you truly need to cash out from it.  Find something less volatile and delivering constant divvy.  You may even build your own high yield fund by investing several stocks such as KO, RIO, and AVGO.",
        "created_utc": 1617628875,
        "id": "gtg8p48",
        "permalink": "/r/StockMarket/comments/mk660d/newbie_investor_40k_check_invest/gtg8p48/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617657675.0
    },
    {
        "author": "hopefuldepression",
        "body": "I wish you apes would make AVGO moon, it would be life-changing for me",
        "created_utc": 1617572851,
        "id": "gte08xs",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gte08xs/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617601651.0
    },
    {
        "author": "StalCair",
        "body": "I am not disputing the usefulness of semis. Only their recent movements. Last month most if not all semi stocks rebounded after earnings (over 100% for most since the march 2020 crash).\n\nNvidia 20% in 1 month.\n\nAMD 12% top 6% rn in one month.\n\nON 20% on the decline in one month.\n\nAVGO 20% in one month.\n\nTXN 20% in a month.\n\nMU 12% in a month.\n\nIntel 15% on the decline in one month.\n\nLRCX  30% on the decline in a month.\n\nTSMC is probably the stock that will tank the least due to its seat on the table of semis and the fact it wasn't overbought 5 weeks ago.",
        "created_utc": 1618487231,
        "id": "guleqxl",
        "permalink": "/r/wallstreetbets/comments/mr03qi/80k_amd_yolo_day_1_babydick_gains/guleqxl/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1618516031.0
    },
    {
        "author": "lomoprince",
        "body": "Yeah I’d say we are very similar in approach. I own LMT as well, and have considered opening a position in CRSR as well after this period of consolidation. When people shift their attention away from quality companies, that’s when I want to get in. LMT has been an absolute winner and so has AVGO; you’re going to profit for a very long time from those names. Definitely consider VRTX then at the very least. BMRN is more sleeper, but potentially deeper undervaluation. VRTX is just a few steps ahead in the life cycle and is just a profitability and growth monster. I’ll send you a pm in the AM to continue this discussion. Thanks for making this post!",
        "created_utc": 1618806386,
        "id": "gv1ot1y",
        "permalink": "/r/stocks/comments/mts4ne/what_under_the_radar_stock_have_you_been_buying/gv1ot1y/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618835186.0
    },
    {
        "author": "jordanw71",
        "body": "I feel some similarities in our strategies. Personally I seem to look for the long term fundamentals which will make a company successful and but them when investors become short term pessimistic. My largest holding is AVGO which I began buying heavily in 2020 in the 200s. I've also added alot of LMT over the last few months when it was in the low 300s. CRSR is one I am beginnng to like as well under $35. Feel free to DM me if you'd like and maybe we could bounce some ideas off of each other.",
        "created_utc": 1618806186,
        "id": "gv1oi8k",
        "permalink": "/r/stocks/comments/mts4ne/what_under_the_radar_stock_have_you_been_buying/gv1oi8k/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1618834986.0
    },
    {
        "author": "X-Boozemonkey-X",
        "body": "Nvdia, avgo, lrcx, amd, txn, adi. Were all down about 20% in February/ March. FB, MSFT, and GOOGl arnt the only tech stocks in the nasdaq imfao",
        "created_utc": 1617924304,
        "id": "gtvccoj",
        "permalink": "/r/wallstreetbets/comments/mn04vf/what_are_your_moves_tomorrow_april_09_2021/gtvccoj/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1617953104.0
    },
    {
        "author": "MyopiaCapital",
        "body": "1) Buy AVGO\n\n2) Collect dividends\n\n3) Hang out",
        "created_utc": 1617307410,
        "id": "gt2gvv2",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt2gvv2/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1617336210.0
    },
    {
        "author": "Zachjsrf",
        "body": "Used to work for the Broadcom (AVGO) co founder (the crazy one) and as it turns out I've hooked up with his girlfriend 🤣 Fuck that guy.",
        "created_utc": 1617752442,
        "id": "gtmoefe",
        "permalink": "/r/wallstreetbets/comments/mlkbp6/what_are_your_moves_tomorrow_april_07_2021/gtmoefe/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1617781242.0
    },
    {
        "author": "Katermickie",
        "body": "&gt;Katermickie\n\nDid you fix it? I still see it happening also for AVGO but maybe I'm missing something?",
        "created_utc": 1617875840,
        "id": "gtsitz9",
        "permalink": "/r/ValueInvesting/comments/mjn9bq/created_a_research_tool_to_structure_business/gtsitz9/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1617904640.0
    },
    {
        "author": "felunk",
        "body": "I love the amazon is getting into the business so every stock related dumps....WBA, WMT, AVGO, netflix you name it has dumped on that news....ez money everytime....",
        "created_utc": 1617842389,
        "id": "gtr5s7o",
        "permalink": "/r/stocks/comments/mmcdjp/whats_your_thoughts_on_teladoc_inc_tdoc/gtr5s7o/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617871189.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "MasterCard \nBroadcom\nApple\nBerkshire Hathaway \nShopify\nVisa\nEnphase Energy\nNvidia\nTeradyne\nQORVO\nZebra \nEtsy\nAmazon \nGoogle\nCitigroup \nREGI \n\n\nNot in any particular order, MasterCard, Apple and Nvidia are the largest positions each around 10%",
        "created_utc": 1617769309,
        "id": "gtnjbpg",
        "permalink": "/r/stocks/comments/lv5dlb/rate_my_portfolio_rstocks_quarterly_thread_march/gtnjbpg/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617798109.0
    },
    {
        "author": "Butterscotch-Apart",
        "body": "Lol I own about 70 companies at this point but many of them only make up 1% or less of a 250k portfolio. Largest holdings are \n\nApple\nAmazon \nNVDA \nMasterCard \nVisa\nBroadcom\nBerkshire Hathaway \nSquare\nChevron\nGOOGL",
        "created_utc": 1617920947,
        "id": "gtv5l37",
        "permalink": "/r/stocks/comments/mmz6hl/for_those_owning_30_stocks_why/gtv5l37/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617949747.0
    },
    {
        "author": "Offduty_shill",
        "body": "I use T as my savings account, shit doesn't move but does give nice dividends. AVGO is also a candidate for a great company whose stock actually moves and you get a pretty fat dividend.",
        "created_utc": 1617302447,
        "id": "gt265jv",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt265jv/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617331247.0
    },
    {
        "author": "toydan",
        "body": "WBA T AVGO SWKS QCOM HD PFE ABBV. \n\nlots out there.",
        "created_utc": 1617298884,
        "id": "gt1yejo",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt1yejo/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617327684.0
    },
    {
        "author": "kkInkr",
        "body": "There are bunch of chip companies, why just focus on AMD, NVDA, INTC, TSM.\n\nADI, AMAT, ASML, ATEYY, AVGO, KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI, QCOM, QRVO, SIMO, SWKS, TER.\n\nThere's also some small ones: Pixelworks, Himax.\n\nThere's also the design part: CDNS, SNPS.",
        "created_utc": 1617547643,
        "id": "gtcnpap",
        "permalink": "/r/stocks/comments/mjk7qj/amd_is_a_buy/gtcnpap/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617576443.0
    },
    {
        "author": "Agatha_Dunlap",
        "body": "AVGO",
        "created_utc": 1617294223,
        "id": "gt1nw6z",
        "permalink": "/r/wallstreetbets/comments/mhs01v/daily_discussion_thread_for_april_01_2021/gt1nw6z/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617323023.0
    },
    {
        "author": "Kashm11r",
        "body": " AMD MU NVDA TSM AMAT INTC AAPL AVGO QCOM MRVL TXN NXPI QRVO SWKS CRUS",
        "created_utc": 1617593046,
        "id": "gtezt1p",
        "permalink": "/r/stocks/comments/mk8qcl/semiconductor_related_stocks/gtezt1p/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1617621846.0
    },
    {
        "author": "FinMarketGeometry",
        "body": "It sounds like your goal is to generate passive income rather than long term capital gains. If so, it is not such a good idea investing in qqq.  As of 4/5/2021, I see qqq ETF is most likely reach 330 in a week and make all time new high in a month. However, it cannot go straight up without pullback. Sometimes those pullback could be very deep. The worst thing could happen is that qqq falls to the very bottom when you truly need to cash out from it.  Find something less volatile and delivering constant divvy.  You may even build your own high yield fund by investing several stocks such as KO, RIO, and AVGO.",
        "created_utc": 1617628875,
        "id": "gtg8p48",
        "permalink": "/r/StockMarket/comments/mk660d/newbie_investor_40k_check_invest/gtg8p48/",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1617657675.0
    },
    {
        "author": "hopefuldepression",
        "body": "I wish you apes would make AVGO moon, it would be life-changing for me",
        "created_utc": 1617572851,
        "id": "gte08xs",
        "permalink": "/r/wallstreetbets/comments/mi3t1v/weekend_discussion_thread_for_the_weekend_of/gte08xs/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1617601651.0
    }
]