[
    {
        "author": "QuestionablySensible",
        "body": "Counterpoint - they sell quite a lot of equipment to Ericsson and Qualcomm.\n\nA bet on Nokia right now is a bet on the new executive team. Nokia have the ingredients to do better than they are but it remains to be seen if they can execute.",
        "created_utc": 1620042710,
        "id": "gwrt6at",
        "permalink": "/r/wallstreetbets/comments/n3r0wi/nokia_diamond_hands_averaging_down_all_these/gwrt6at/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620071510.0
    },
    {
        "author": "LegendLarrynumero1",
        "body": "QCOMM's market share in china already plunged\nQualcomm's shipments in China shrank 48.1% year-on-year, CINNO Research said without releasing details on the number of Qualcomm chips shipped. The U.S. giant's market share in China fell to 25.4% in 2020 versus 37.9% in 2019.",
        "created_utc": 1619890731,
        "id": "gwkbrto",
        "permalink": "/r/stocks/comments/n2lf5r/a_thought_about_qualcomm_future_revenue_situation/gwkbrto/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619919531.0
    },
    {
        "author": "kkInkr",
        "body": "SMH, ADI, AMAT, ASML, ATEYY, AVGO, HIMX, INTT,  KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI,  PXLW, QCOM, QRVO, SIMO, SWKS, TER,\n\nbesides the usual AMD, INTC, NVDA, and TSM. Those 4 imo are outdated.  SMH is the ETF.\n\nCircuitry, CDNS, SNPS, ANSS, they are being ignored, but have dominant roles, imo.",
        "created_utc": 1619900068,
        "id": "gwkwyeo",
        "permalink": "/r/stocks/comments/n2705g/best_sector_for_the_next_5_years/gwkwyeo/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619928868.0
    },
    {
        "author": "jwonz_",
        "body": "Yes, “model”, as in modeling based on a previous hype bubble to estimate how long until people sell an over valued position.\n\nDid you know you can read comment threads from 1999 on QCOM and see people calculating a PE of 300 and justifying it? It’s quite hilarious.\n\nYou’re right that I should do a proper valuation model on TSLA given growth and margin assumptions. Last time I played with one of these a price of 700 required great margins and 100% growth of car sales up to the same amount as Toyota. I don’t see how they achieve the margins.\n\nGuess I need to google these guys, second time they are mentioned.",
        "created_utc": 1619879858,
        "id": "gwjm1zv",
        "permalink": "/r/investing/comments/n1z80f/this_barrons_article_might_explain_teslas_sudden/gwjm1zv/",
        "score": 1,
        "subreddit": "investing",
        "created": 1619908658.0
    },
    {
        "author": "thenwhat",
        "body": "Do you think Tesla can grow sales by at least 50% yearly the next few years or not?\n\nIf people were calculating Qualcomm's PE in 1999, that tells me Qualcomm wasn't a growth company, and that would explain why it failed. Tesla is a growth company. A disruptive one at that. It is disrupting industries with an enormous total addressable market (several times that of Apple's TAM, for example). Did Qualcomm do and have that?\n\nTesla is a growth company. Using P/E to value Telsla is misguided at best. You should be using discounted future cashflow (DFC).",
        "created_utc": 1619959382,
        "id": "gwnlvxc",
        "permalink": "/r/investing/comments/n1z80f/this_barrons_article_might_explain_teslas_sudden/gwnlvxc/",
        "score": 1,
        "subreddit": "investing",
        "created": 1619988182.0
    },
    {
        "author": "happierdayz4me3",
        "body": "Hauwei didnt [hardly] pay QCOM now that other Chinese phone makers are taking the market share, QCOM's revenue from China will only increase as they can't their hands on enough snapdragons and signed (and honor) more lucrative licensing agreements. Read last week's ER call transcript.  \n\nAlso, this play/idea was baked in well over a year ago. Known risk.",
        "created_utc": 1619981899,
        "id": "gwp4vzj",
        "permalink": "/r/stocks/comments/n2lf5r/a_thought_about_qualcomm_future_revenue_situation/gwp4vzj/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620010699.0
    },
    {
        "author": "jwonz_",
        "body": "LOL “this time it’s different”\n\nOf course QCOM was a growth company, they were predicting it was going to massively grow due to the Internet growth. Similarly with TSLA and the EV boom.\n\nTesla could grow sales by 100% per year, but I don’t think they improve margins as required.\n\nAlso, sentiment on Teslas all looking the same is brewing. At what point does that start dragging sales as competitors release unique cars? Of this happens then the 100% sales growth might not even happen.\n\nPriced to perfection means the investment will be dead money for a long time and people will start selling it.",
        "created_utc": 1619974111,
        "id": "gwojhsx",
        "permalink": "/r/investing/comments/n1z80f/this_barrons_article_might_explain_teslas_sudden/gwojhsx/",
        "score": 1,
        "subreddit": "investing",
        "created": 1620002911.0
    },
    {
        "author": "shiverstar",
        "body": "QCOM might benefit from AAPL's success even if they cannot",
        "created_utc": 1619888231,
        "id": "gwk5s0s",
        "permalink": "/r/wallstreetbets/comments/n222v3/weekend_discussion_thread_for_the_weekend_of/gwk5s0s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1619917031.0
    },
    {
        "author": "Trump_Ate_My_Ass",
        "body": "What does QCOM do?",
        "created_utc": 1619888707,
        "id": "gwk6wkp",
        "permalink": "/r/wallstreetbets/comments/n222v3/weekend_discussion_thread_for_the_weekend_of/gwk6wkp/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1619917507.0
    },
    {
        "author": "ScroogeMcBux",
        "body": "$VOD just signed a deal with Google and Qualcomm. Been watching this one forever. MMs and shorts been holding this back forever but there’s too much momentum right now.  52 billion market cap telecom company teaming up with the big boys to prepare for the AR/VR, 5G, Cloud, etc. . Cha Ching. This is gonna blow up fast once volume goes up. Links below for DD. \n\nhttps://www.forbes.com/sites/tiriasresearch/2021/04/29/qualcomm-and-vodafone-open-a-new-chapter-for-open-ran/amp/\n\nhttps://amp.ft.com/content/8d2287ad-d0a3-4972-9b0d-9e32846f3164",
        "created_utc": 1620043257,
        "id": "gwru3qv",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwru3qv/",
        "score": -1,
        "subreddit": "wallstreetbets",
        "created": 1620072057.0
    }
]