[
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  2nd of November\n\n\n\n## Upcoming events for Tuesday, November  2nd\n\n - Expected earnings:\n\n  AAIC, ACH, ACOR, ACT, ADCT, ADXN, AFG, AGRX, AHH, AIZ, AKAM, AMCR, AME, AMED, AMGN, ANDE, APO, APPS, AQB, AQST, ARCB, ARGO, ARNC, AROC, ATVI, AVNS, AWK, AYX, BBGI, BCC, BFAM, BGFV, BHC, BKH, BLD, BLMN, BP, BRY, BSBR, BTG, BXC, CASA, CDK, CDLX, CEIX, CERS, CHCT, CHK, CIGI, CINR, CLNN, CLW, CMI, COP, COUR, CRK, CRSR, CRVL, CSLT, CTLT, CZR, DAR, DCO, DCP, DCPH, DD, DEA, DEI, DENN, DHT, DOX, DRRX, DS, DVN, EARN, EDU, EGHT, EIX, EKSO, EL, ELVT, ENLC, EOLS, EPD, ES, ESPR, ETN, ETRN, EXAS, EXEL, EXLS, EXPD, EXTN, EXTR, FMC, FNF, FRG, FRSH, FSTR, GAIN, GIC, GLDD, GLT, GLYC, GNRC, GNW, GPN, GPOR, GRBK, HALO, HCC, HEES, HEP, HLF, HLNE, HRB, HSC, HSIC, HURN, HY, IAA, IART, ICD, ICFI, ICHR, IDXX, IEP, INCY, INFI, INGR, INSP, INTG, INVE, IOSP, IPGP, IT, JBGS, JRVR, KAI, KAMN, KAR, KKR, KOPN, KTCC, LCII, LDOS, LEA, LGIH, LILA, LILAK, LIND, LPI, LPSN, LPX, LRFC, LSCC, LSI, LUNG, LYFT, MANT, MCY, MDLZ, MDXG, MEC, METC, MG, MGNX, MGY, MIME, MINM, MKL, MLM, MMP, MOD, MPC, MPLX, MRCC, MRCY, MTCH, MTRN, MYGN, NAUT, NCSM, NE, NETI, NMIH, NNN, NP, NR, NRC, NRZ, NSA, NXRT, NXST, NYMT, OCN, OKE, OMCL, ORTX, OSPN, OVV, PAA, PACB, PAGP, PAHC, PAYC, PEAK, PEG, PFE, PINC, PIRS, PKI, PKOH, PMTS, PRO, PRTS, PRU, PTRS, PUMP, QUAD, RACE, RAMP, RARE, RCKY, RCM, RDN, RGNX, RIGL, RL, RM, ROK, RRR, RYAM, RYTM, SABR, SAGE, SEB, SEDG, SEE, SEVN, SFST, SGRY, SHIP, SKY, SKYT, SMCI, SNCY, SPLP, SPT, SQNS, SRC, SRCL, SREV, SRG, SRT, STAR, STE, STRL, TCS, TECH, TMUS, TMX, TNC, TRC, TRI, TRNS, TRTX, TSLX, TSQ, TTM, TVTY, TX, UA, UAA, UBCP, UFPT, UIS, UNM, USAC, USDP, UTL, VAL, VECO, VMD, VOYA, VRSK, VRTX, WAT, WBT, WEC, WEYS, WFRD, WLK, WLKP, WTI, WTTR, WU, XHR, XPO, XYL, Z, ZBRA, ZG, ZYME\n\n - Ex-div:\n\n  ASML, BRO, CAPL, CBAN, DSX, HFWA, LUB, MCBS, MKTX, MTX, NTIC, SSBK, TACO, TRS, USDP, VSEC\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.090%)\n    - API Weekly Crude Oil Stock (previous: 2.318M)\n    - IBD/TIPP Economic Optimism (previous: 46.8)\n    - Redbook (previous: 15.6%)\n    - Total Vehicle Sales (previous: 9.66M)\n\n## Upcoming events for Wednesday, November  3rd\n\n - Expected earnings:\n\n  AAWW, ACA, ACEL, ACLS, ACNB, ACRE, ACRS, ADPT, AEE, AEMD, AFIN, AGIO, ALB, ALG, ALL, ALTM, AMOT, AMRN, AMSC, ANAB, ANSS, ANVS, APA, ARAY, ARC, ARTL, ARTNA, ASC, ASTE, ASXC, ATEX, ATGE, ATH, ATRC, ATXI, ATY, AUPH, AUTL, AVA, AVNW, AXGN, BBSI, BCRX, BCSF, BDC, BDSI, BGCP, BGSF, BIP, BKCC, BKNG, BLKB, BLUE, BNFT, BR, BRSP, BVH, BWA, CAKE, CBD, CCRN, CCU, CDAY, CDEV, CDW, CDXC, CENX, CF, CFMS, CGBD, CHNG, CIA, CIM, CIO, CIX, CKPT, CLH, CLR, CLVS, CMLS, CMP, COHN, CORT, CPE, CPK, CPRI, CPS, CRL, CRSP, CRTO, CSGS, CSTE, CSWI, CTRA, CTVA, CUTR, CVE, CVGI, CVS, CW, CWAN, CWH, CYTK, DFIN, DIOD, DISCA, DISCB, DISCK, DMAC, DNOW, DRTT, DXC, DXYN, EA, EAT, ECPG, EGY, ELA, ELF, EMR, EPR, EQH, EQIX, EQX, ET, ETR, ETSY, EVA, EVH, EVOP, EVRG, EVRI, EXC, EXPI, EYPT, FBRT, FDP, FLMN, FLT, FLXN, FNV, FOE, FORR, FOX, FOXA, FPH, FRGI, FRPH, FSLY, FSR, FUN, FYBR, GCP, GDDY, GDEN, GFL, GHC, GHL, GLBZ, GLRE, GMAB, GMRE, GNK, GRP.U, GTHX, H, HARP, HBB, HBIO, HBM, HBP, HDSN, HFC, HLMN, HMN, HR, HRTX, HST, HUBS, HUM, HZNP, IAG, ICLR, ICPT, ICUI, IIPR, IMXI, INFN, INMB, INN, INOV, INSG, IO, IONS, IR, ITI, ITIC, ITT, ITUB, IVR, JLL, JMP, KE, KIDS, KL, KLTR, KNBE, KPTI, KRO, KTOS, KW, LAMR, LANC, LAND, LBTYA, LBTYB, LBTYK, LCI, LCTX, LEXX, LHCG, LIVN, LL, LNC, LPG, LUMN, LUMO, LXRX, LYTS, MAC, MAR, MATX, MAXR, MCHX, MCS, MDU, MET, MFC, MGM, MGNI, MGPI, MGYR, MLNK, MLP, MLR, MNKD, MNRL, MPLN, MRO, MRTX, MTG, MTTR, MTW, NC, NCLH, NESR, NEXT, NFE, NHTC, NI, NL, NMFC, NODK, NRP, NSR, NUS, NVST, NYT, OAS, OCDX, ODP, ODT, OLP, OM, OMI, OMP, ONCS, ONCT, ONEM, OPRT, ORA, ORCC, OSUR, OSW, OTIC, PARR, PBI, PBPB, PCRX, PEN, PETQ, PFIE, PING, PK, PLMR, PLTK, PLYA, PRAX, PRG, PSN, PTC, PTGX, PTVE, PW, PXD, QCOM, QGEN, QLYS, QMCO, QNST, QRVO, QTWO, QUOT, RADA, RCII, RCKT, RDWR, REGI, RGLD, RGR, RMNI, RNWK, ROCC, ROKU, RPD, RPT, RRD, RTLR, RVI, RVLV, RVPH, RYI, RYN, SAFT, SANA, SAND, SB, SBGI, SBOW, SBRA, SD, SENEA, SENEB, SGC, SHOO, SITE, SITM, SJI, SKLZ, SLF, SLRC, SMG, SNSE, SPNS, SPNT, SPOK, SPPI, SPR, SPWR, SPXC, SRDX, SRPT, SSRM, SSSS, STAA, STGW, STLA, STN, SUM, SUN, SUNS, SUP, SUPN, SWM, SWN, SYN, SYNH, TALO, TARS, TBPH, TCON, TCPC, TGB, TISI, TLK, TNDM, TPC, TPVG, TREC, TRMB, TRNO, TRUE, TRUP, TS, TSP, TT, TTGT, TTWO, TUP, TWNK, TXG, UBX, UE, UEC, UGP, UHAL, UMH, UPLD, UTHR, UVV, VAPO, VEL, VGR, VIRT, VKTX, VMAR, VMEO, VNDA, VNTR, VRTV, VSH, VTOL, VVNT, VVV, WHD, WING, WK, WTS, YELL, ZD, ZY\n\n - Ex-div:\n\n  AWI, BBD, BBDO, BSMX, CATC, FELE, FMX, HESM, HOPE, NEP, STBA, WSFS\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 400K, previous: 568K)\n    - Crude Oil Imports (previous: 0.702M)\n    - Crude Oil Inventories (consensus: 1.567M, previous: 4.267M)\n    - Cushing Crude Oil Inventories (previous: -3.899M)\n    - Distillate Fuel Production (previous: 0.164M)\n    - Durables Excluding Defense (previous: -2.0%)\n    - EIA Refinery Crude Runs  (previous: 0.058M)\n    - EIA Weekly Distillates Stocks (consensus: -1.533M, previous: -0.432M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.6%, previous: 0.4%)\n    - FOMC Press Conference\n    - FOMC Statement\n    - Factory Orders (consensus: 0.1%, previous: 1.2%)\n    - Factory orders ex transportation (previous: 0.5%)\n    - Fed Interest Rate Decision (previous: 0.25%)\n    - Gasoline Inventories (consensus: -1.200M, previous: -1.994M)\n    - Gasoline Production (previous: 0.012M)\n    - Heating Oil Stockpiles (previous: -0.031M)\n    - ISM Non-Manufacturing Business Activity (consensus: 59.5, previous: 62.3)\n    - ISM Non-Manufacturing Employment (previous: 53.0)\n    - ISM Non-Manufacturing New Orders (previous: 63.5)\n    - ISM Non-Manufacturing PMI (consensus: 62.0, previous: 61.9)\n    - ISM Non-Manufacturing Prices (previous: 77.5)\n    - MBA 30-Year Mortgage Rate (previous: 3.30%)\n    - MBA Mortgage Applications (previous: 0.3%)\n    - MBA Purchase Index (previous: 275.6)\n    - Markit Composite PMI (consensus: 57.3, previous: 57.3)\n    - Mortgage Market Index (previous: 645.1)\n    - Mortgage Refinance Index (previous: 2,763.8)\n    - Services PMI (consensus: 58.2, previous: 58.2)\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n\n^^^^2021-11-02",
        "created_utc": 1635847213,
        "id": "hizs3wm",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635876013.0
    },
    {
        "author": "letsmakesomecalls",
        "body": "Oh no! Su Bae always pulls through!\nXlnx merger will be next catalyst to $180.\nI’ll be looking for re entry.",
        "created_utc": 1636392684,
        "id": "hjts7f6",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1636421484.0
    },
    {
        "author": "werewere223",
        "body": "XLNX (Cheap AMD play) is what I'm in, also I grabbed some KLIC. Remember during the gold rush the miners weren't the ones coming out rich, it was the people selling the pickaxes and shovels. KLIC is a super undervalued play in that industry",
        "created_utc": 1636080582,
        "id": "hjdb8fz",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636109382.0
    },
    {
        "author": "EZ_Money87",
        "body": "The 1.7 shares of AMD for every Xilinx share will be  interesting to see how it plays out.",
        "created_utc": 1635874416,
        "id": "hj1azzb",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635903216.0
    },
    {
        "author": "wondermania",
        "body": "Fully loaded for XLNX deal to finalize before EOY.",
        "created_utc": 1636064691,
        "id": "hjcb7ov",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636093491.0
    },
    {
        "author": "BenWinnin",
        "body": "ohh yeah amd and xilinx completely forgot about it",
        "created_utc": 1635873000,
        "id": "hj17fqt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635901800.0
    },
    {
        "author": "ourobboros",
        "body": "Is this the week where xlnx and amd turn into Gogeta?",
        "created_utc": 1636353768,
        "id": "hjryzz5",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636382568.0
    },
    {
        "author": "Illustrious_Truth_34",
        "body": "LOAD UP ON AMD... THEY STILL ARE TRYING TO ACQUIRE Xilinx  BY END OF YEAR",
        "created_utc": 1636129831,
        "id": "hjflsal",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636158631.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/VaultBoy3 (1/0) made a bet that XLNX would go to 199.21 when it was 181.1 and it did, congrats fucker.",
        "created_utc": 1636052919,
        "id": "hjbhlmd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636081719.0
    },
    {
        "author": "Wiscoman",
        "body": "Same with AMD once Xilinx acquisition is completed.  AMD+XLNX is maybe 1 year or less behind NVDA in terms of size and look at the differences in Market caps.",
        "created_utc": 1636057017,
        "id": "hjbs1tx",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636085817.0
    },
    {
        "author": "TechnicalEntry",
        "body": "130 shares of AMD (and 20 XLNX), average cost $94 - LETS FUCKING GOOOOOOO",
        "created_utc": 1636389259,
        "id": "hjtjiya",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636418059.0
    },
    {
        "author": "papabri",
        "body": "Love it. Holding both AMD and XLNX shares and calls.",
        "created_utc": 1635913794,
        "id": "hj3yqki",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635942594.0
    },
    {
        "author": "2CommaNoob",
        "body": "Nice play.  Been in AMD since $12; took some profits along the way but still rocking a shit ton of shares along with xlnx.",
        "created_utc": 1635972196,
        "id": "hj73xzc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636000996.0
    },
    {
        "author": "VaultBoy3",
        "body": "BUY THE DIP ON XLNX\n\nXLNX is merging with AMD in about 2 months with a ratio of 1.7234 AMD shares for every XLNX share\n\nThis means XLNX shares will be worth 1.7234x more than AMD shares.\n\n$150×1.7234=$258.51\n\nThere's a 25% gain to be made on XLNX\n\nLook it up",
        "created_utc": 1636393195,
        "id": "hjtthw7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636421995.0
    },
    {
        "author": "L3artes",
        "body": "Xilinx is amazing. Super fun merger arbitrage. They are at 198$ and AMD is at 137.5$ and they will merge for 1.743 shares per share which comes out at 240$. Was even better a few weeks ago.",
        "created_utc": 1636062946,
        "id": "hjc6zp9",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1636091746.0
    },
    {
        "author": "axe-cap1",
        "body": "Any idea why XLNX isn’t following AMD up?",
        "created_utc": 1636392990,
        "id": "hjtszft",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636421790.0
    },
    {
        "author": "IllBiteYourLegsOff",
        "body": "AMD rocketing above ATH while xlnx just chilling below the one it set earlier today... what is going on there...?",
        "created_utc": 1636051399,
        "id": "hjbdql9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636080199.0
    },
    {
        "author": "rsoni1997",
        "body": "Anyone get in on AMD + Xilinx merger?\n\nXLNX one share = 1.7234 shares of AMD\n1.7234 shares of AMD at current price is 234. \n\nXLNX trading at 197-198 right now. AMD likely to go higher.",
        "created_utc": 1636043090,
        "id": "hjasctf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636071890.0
    },
    {
        "author": "180IQCONSERVATIVE",
        "body": "The cap of Nvidea will be close to 325.  It's almost there.  As I said it's going to start leveling off. Investors will still invest but will look for other things for gains.  AMD is set to release new processor and chips.  The AMD acquisition of Xilinx is still on.  Read up on Xilinx.  AMD was at and up and down for a while in the 120 to 125 per share.  My tech investments are on fire.  Once AMD is done with buy out the stock will fly and they will eventually be right up on Nvideas back door.",
        "created_utc": 1636080177,
        "id": "hjdaeah",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1636108977.0
    },
    {
        "author": "UnseenTardigrade",
        "body": "Yeah, having my TSM feels good today. Having NVIDIA or AMD would be better though lol. I sold my XLNX for a 20% gain a couple weeks ago. Should have held on for even more the way things are going with AMD",
        "created_utc": 1636055974,
        "id": "hjbpdl7",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636084774.0
    },
    {
        "author": "MangoAI",
        "body": "AMD and BNTX - AMD continues to grab market share and takes over Xilinx soon, Biontech sold most vaccines on the planet because they are the best.",
        "created_utc": 1635766219,
        "id": "hivf993",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635795019.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  4th of November\n\n\n\n## Upcoming events for Thursday, November  4th\n\n - Expected earnings:\n\n  AAOI, AAON, AAU, ABC, ABNB, ABUS, ACET, ACIW, ACMR, ACR, ACRX, ADAP, ADMA, ADMS, ADVM, ADXN, AE, AERI, AES, AEZS, AFCG, AG, AGLE, AGO, AGS, AHCO, AIG, AINV, AIV, AJX, AKBA, AL, ALBO, ALE, ALEX, ALGS, ALHC, ALKT, ALLO, ALRM, ALTR, AMEH, AMH, AMN, AMPY, AMRK, AMYT, ANGI, ANIK, AOSL, APD, APLE, APPN, APR, APRE, APT, APTV, AQMS, ARC, ARDX, ARNA, ARQT, ARVN, ARW, ASMB, ASPS, ASRT, ATAX, ATEC, ATLO, ATNX, ATRA, ATRS, ATSG, ATUS, AUMN, AUTO, AVLR, AVRO, AXNX, BABA, BALY, BAP, BATRA, BATRK, BBD, BBDO, BBIO, BCE, BCLI, BCOR, BCYC, BDX, BE, BEPC, BFS, BGNE, BGS, BHF, BIGC, BILL, BKD, BL, BLCM, BLDR, BLFS, BLI, BLL, BLPH, BNGO, BPMP, BRG, BSBK, BSGM, BXRX, CABO, CAI, CALA, CARS, CBAY, CBIO, CC, CCOI, CDR, CDTX, CDXS, CDZI, CEMI, CFLT, CFX, CGNX, CHH, CHUY, CI, CIR, CLBS, CLDT, CLDX, CLFD, CLI, CLLS, CLNE, CLXT, CMBM, CMRX, CMT, CNCE, CNDT, CNHI, CNP, CNQ, CNXN, COLD, COLL, COMM, CPLG, CPLP, CRAI, CRDF, CRMD, CRON, CRY, CS, CTHR, CTLP, CTMX, CTSO, CTT, CTXS, CUBE, CVCO, CVET, CVNA, CVRX, CWEN, CWEN.A, CWK, CXP, CYBR, CYCN, CYRX, DBRG, DBX, DDOG, DEN, DHC, DIN, DISH, DK, DKL, DLX, DMLP, DNB, DNLI, DNN, DOCN, DRH, DRNA, DUK, DVAX, DWSN, DYN, EBS, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, EOG, EPAM, ERF, ERII, ESTE, ETTX, EURN, EVC, EWCZ, EXPE, FARM, FAT, FATBB, FATE, FCRD, FDUS, FIS, FLNT, FND, FNKO, FOCS, FOLD, FOR, FOXF, FROG, FRT, FSLR, FTNT, FULC, FVCB, FVE, FWONA, FWONK, GBT, GDOT, GDP, GDYN, GEL, GEO, GERN, GH, GIL, GKOS, GLPG, GMED, GNE, GNL, GOGO, GOLD, GOLF, GOVX, GPP, GPRE, GPRO, GRFS, GROW, GRTS, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HEAR, HHC, HII, HIMX, HL, HMHC, HMPT, HRTG, HSKA, HTA, HWM, HZN, IAC, IBOC, IBP, ICL, IDCC, IDRA, IFRX, IGMS, IHC, IHRT, III, ILMN, IMH, IMMR, IMRA, IMUX, INDP, INDT, ING, INGN, INOD, INS, IOVA, IRM, IRTC, IRWD, ISDR, ISPC, ITP, ITRI, JNCE, JYNT, K, KALA, KBAL, KDMN, KDNY, KFFB, KIQ, KMPH, KOP, KRP, KRTX, KTB, KURA, KVHI, KWR, KYMR, KZR, LABP, LASR, LAUR, LAZY, LBRDA, LBRDK, LCUT, LFVN, LGF.A, LGF.B, LITE, LLNW, LND, LNG, LNT, LNTH, LOCO, LORL, LPTH, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LTRPA, LTRPB, LXP, LYV, MACK, MAIN, MASS, MBUU, MCHP, MDGL, MDRX, MED, MELI, MGEE, MGLN, MGTA, MGTX, MITK, MITO, MLAB, MLCO, MNDT, MNST, MP, MRIN, MRNA, MSC, MSGM, MSI, MTBC, MTD, MTEM, MTSI, MTX, MTZ, MUR, MUX, MXC, MYE, NATR, NE, NEO, NEPH, NET, NFG, NH, NHC, NINE, NKLA, NKSH, NKTR, NLOK, NMM, NNBR, NNI, NOMD, NPTN, NREF, NRG, NS, NSIT, NTCT, NTLA, NTRA, NTUS, NVAX, NVMI, NWS, NWSA, NXTC, OBSV, OEC, OGE, OHI, OLED, ONCT, ONTO, OPCH, OPTN, ORGS, ORIC, ORLA, OTEX, OTRK, OUT, OXY, OYST, PAC, PAE, PALT, PASG, PBA, PBH, PBYI, PCOR, PCTI, PCTY, PDCE, PDEX, PECO, PEI, PENN, PESI, PFSI, PGNY, PH, PHI, PINS, PLM, PLNT, PLX, PMT, PODD, PPL, PRCT, PRDO, PRMW, PROF, PRTA, PRVB, PSNL, PTMN, PTON, PWFL, PWP, PWR, PZG, PZZA, QDEL, QRTEA, QRTEB, QTRX, RBA, RC, RCUS, RDFN, REFR, REG, REGN, REPL, REYN, REZI, RFP, RGA, RGLS, RGS, RKT, RLJ, RMAX, RNGR, RUN, RWAY, SALM, SATS, SELB, SEM, SFE, SFM, SGA, SGMO, SHAK, SHO, SHYF, SID, SIGA, SKM, SLDB, SLQT, SLRX, SMHI, SMLP, SNPO, SO, SPRO, SQ, SRLP, SRRA, SRTS, SSYS, STFC, STKS, STNE, STOR, STRA, STRO, SVC, SVM, SVRA, SWCH, SWKS, SWX, SXI, SYBX, SYNA, TAL, TCX, TDC, TDS, TDW, TEF, TFFP, TGH, TGNA, TGP, TGTX, THR, TIPT, TK, TMCI, TMST, TNK, TPL, TRGP, TRHC, TRIN, TTOO, TTSH, TUEM, TWI, UBER, UEIC, UFCS, UIHC, UNIT, UONE, UONEK, USM, USPH, USWS, VATE, VCTR, VG, VHI, VIA, VIAC, VIACA, VIAO, VIAV, VIR, VLDR, VMC, VNT, VRAY, VRRM, VSAT, VSTO, VTVT, VVI, W, WCC, WD, WELL, WFCF, WLDN, WLL, WMC, WMS, WPM, WSC, WSTG, WW, WWE, WYNN, XENE, XFOR, XLRN, XOMA, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZBH, ZEUS, ZGNX, ZTS\n\n - Ex-div:\n\n  AFB, AMX, ARLP, BKEP, BMRC, BPRN, CEQP, CFFN, CMCO, CMS, CPLP, CVCY, DAN, DKL, ET, FBC, FCBC, FCF, FE, FFWM, FRAF, FRBA, GPP, HCC, HSII, HWKN, HWM, IBCP, ICBK, IDA, INTC, JBHT, LBAI, LBC, LVHD, LW, MMLP, MMP, NSC, NWBI, NWLI, NYCB, OHI, PFE, PNFP, RELL, SIRI, SRLP, STZ, STZ.B, SUN, TGP, UL, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 17.895K)\n    - Continuing Jobless Claims (consensus: 2,118K, previous: 2,243K)\n    - Exports (previous: 213.70B)\n    - Imports (previous: 287.00B)\n    - Initial Jobless Claims (consensus: 275K, previous: 281K)\n    - Jobless Claims 4-Week Avg. (previous: 299.25K)\n    - Natural Gas Storage (consensus: 63B, previous: 87B)\n    - Nonfarm Productivity (consensus: -3.0%, previous: 2.1%)\n    - OPEC Meeting\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n    - Unit Labor Costs (consensus: 7.0%, previous: 1.3%)\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AMRX, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, EPZM, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, MTNB, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NVO, NWLI, NWN, OCGN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TELL, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n^^^^2021-11-04",
        "created_utc": 1636020014,
        "id": "hj9i3rw",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636048814.0
    },
    {
        "author": "180IQCONSERVATIVE",
        "body": "AMD is buying out Xilinx.  If you don't know you need to look at Xilinx.  It seems AMD will be following what Nvidea has expanded to be.  Xilinx stock is at 191 and by far not a peanuts company.  AMD stock is still cheap compared to what it will be in 5 years or less.  Qualcomm is having big gains too.  I have all three plus others and my gains today is damn close to orgasmic.",
        "created_utc": 1636051064,
        "id": "hjbcvi3",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1636079864.0
    },
    {
        "author": "AlmightySnoo",
        "body": "Shit, I'm out of $AMD, that downgrade is nasty especially when $XLNX is already holding it down until merger. All in $TSLA for now.",
        "created_utc": 1635764472,
        "id": "hivcwo0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635793272.0
    },
    {
        "author": "boristheblade202",
        "body": "There’s more to it than just thinking it will hit my  call price. If the stock is at $100, I can buy $140 (or higher/lower, this is just an example) and if the stock goes up I can earn money along the way. Once your option is “in the money (ITM)” your options gain faster. A common strategy is to buy Leaps, which are a year or two out or more (expiration date). Do this with solid companies and look at their performance, price targets, etc. AMDs price target has, mostly, been pushed some where between $130-150. So I bought $130 calls when the price was around $125 (they’ve crushed earnings all year and had big runs the last two ERs). I’ve been in and out of calls with this stock for the past year+. There’s a macro play with merger coming. This is not about gambling. It’s knowing the stock, fundamentals, and preparing accordingly. Fully expect this to run more post-merger with Xilinx. Then will take it from there. Hope this helps.",
        "created_utc": 1636121510,
        "id": "hjf0oz7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636150310.0
    },
    {
        "author": "UnseenTardigrade",
        "body": "Wish I hadn’t sold my XLNX for a 20% gain a few weeks ago… would be up like 40% now. Oh well, a 20% gain is still pretty good for how little time I held it.",
        "created_utc": 1636389983,
        "id": "hjtld8u",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636418783.0
    },
    {
        "author": "zg44",
        "body": "XLNX options will double (at least) if the AMD merger goes through (because it's an all stock merger).\n\nDunno how risky the China approval situation is though.\n\nAMD execs were confident China would give approval in Dec.\n\nI may load some January XLNX calls at end of Nov if they are trading at a 70% discount to AMD options at the 1.7234 merger ratio.\n\nWorth keeping an eye on...",
        "created_utc": 1635781737,
        "id": "hiw8zrh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635810537.0
    },
    {
        "author": "DragonInPajama",
        "body": "I may buy some xlnx in a dip",
        "created_utc": 1636043264,
        "id": "hjastf2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636072064.0
    },
    {
        "author": "L3artes",
        "body": "In this case it is. For every share of xilinx that i hold, i will receive shares of and which are worth more than the xilinx shares.",
        "created_utc": 1636090953,
        "id": "hjdsveh",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1636119753.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the  5th of November\n\n\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BORR, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NWLI, NWN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PMTS, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n## Upcoming events for Monday, November  8th\n\n - Expected earnings:\n\n  ABEO, ACAD, ADMP, AEIS, AEL, AESE, AGM, AKYA, ALAC, ALLK, ALNA, ALT, AMBC, AMC, AMPH, AMRS, AMSC, ANAT, APEI, APLS, APPF, APTS, ARCT, ARVL, ASM, ASUR, ATCO, ATCX, ATER, ATRI, ATRO, AUID, AVCO, AVD, AVDL, AVEO, AVTX, AXSM, BAND, BATL, BEKE, BHVN, BKI, BLDP, BOMN, BRAG, BRFS, BRMK, BRP, BRT, CAPL, CARA, CBT, CCLP, CECE, CELC, CHRS, CLAR, CLOV, CLPR, CLRB, CMCT, COGT, COTY, CPHC, CRD.A, CRD.B, CSSE, CSTL, CTKB, CTRE, CXW, DAC, DDD, DH, DIT, DOOR, DPRO, DS, DSGN, DSS, EC, EDIT, EFC, EHTH, EML, ENV, ENVX, EVCM, EVI, EWTX, EYEG, EZFL, FA, FBIO, FBRX, FEDU, FGBI, FIVN, FIXX, FLDM, FLL, FNHC, FPAY, FRHC, FRPT, FSK, FSP, FTK, FWRG, GALT, GAME, GECC, GOSS, GPMT, GSKY, GTES, GTH, HFFG, HIL, HLIO, HNGR, HNRG, HPK, HTBX, HYMC, ICMB, IEA, IFF, IIN, IMOS, INST, IPAR, IX, JAN, JHX, JKHY, KERN, KNDI, KOD, KOS, KRYS, LBPH, LFST, LINC, LIZI, LJPC, LMND, LNSR, LOGC, LOTZ, LTBR, LWLG, MCRB, MDVL, MILE, MLVF, MNOV, MNTX, MORF, MPAA, MRC, MRKR, MRTX, MSGS, MTNB, MTRX, MWA, NCMI, NERV, NES, NEWR, NEWT, NEX, NEXI, NHI, NLTX, NMTR, NSSC, NVRO, NVTA, NWPX, OCN, OCUL, OMER, ONVO, OR, OSH, OUST, PBT, PGEN, PLUG, PMD, PME, PNTG, PRA, PRAA, PRI, PRIM, PROG, PRTK, PRVA, PSEC, PSTL, PYPL, RBLX, RBOT, RCEL, RCMT, RCUS, RDI, RDNT, RDUS, REAL, REKR, RETA, RIOT, RMTI, ROVR, RUBY, SACH, SANM, SAVA, SCOR, SDC, SESN, SIBN, SMTS, SNCR, SNDX, SPCE, SQSP, SRRK, SWAV, TALK, TCDA, TCMD, TDUP, TG, TGLS, THS, TME, TNXP, TPIC, TPST, TREX, TRIP, TRVN, TSEM, TTD, TWO, TYME, UEPS, USFD, UUU, VAC, VBIV, VGR, VOR, VRCA, VSTM, VTRS, VUZI, WOW, WPRT, XBIT, XNCR, XPER, XPRO, YALA, ZEST, ZIOP, ZIXI, ZNGA, ZNTL, ZYNE\n\n - Ex-div:\n\n  AROC, ASIX, BLX, BY, CG, CINR, CSV, DCF, EDF, EDI, GGB, GHM, HBI, HMST, HTBK, INVH, KMT, LGI, LSBK, LSTR, MAC, MET, NBN, PZZA, RILY, RNDB, TEX, WBK, WBS, WCN\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.050%)\n    - 3-Year Note Auction (previous: 0.635%)\n    - 6-Month Bill Auction (previous: 0.065%)\n    - CB Employment Trends Index (previous: 110.35)\n    - Loan Officer Survey\n\n^^^^2021-11-05",
        "created_utc": 1636106411,
        "id": "hjeamfa",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636135211.0
    },
    {
        "author": "Illustrious_Truth_34",
        "body": "amd going sideways ... its working on the deal with Xilinx by end of year... i would hop in before then",
        "created_utc": 1636129182,
        "id": "hjfk496",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636157982.0
    },
    {
        "author": "Pas7alavista",
        "body": "If you're bullish on amd in the long term there is opportunity to arbitrage some shares by playing the merger with xlnx.",
        "created_utc": 1636315506,
        "id": "hjprpe2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636344306.0
    },
    {
        "author": "Past_Syrup",
        "body": "I want to retire early. Not gonna wait till 67. \n\nSo retirement/5years lcid. \n\nAnd short term xilinx/amd",
        "created_utc": 1636206563,
        "id": "hjjtch7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636235363.0
    },
    {
        "author": "zg44",
        "body": "Yeah the XLNX options will convert into AMD options at that ratio.\n\nSo like if AMD is $125, XLNX conversion value would be $215. \n\nSafest way will likely be to just buy some slightly OTM XLNX options.\n\nXLNX would go to $205-210 immediately after China grants clearance.\n\nObviously that's biggest risk which is a wild card.",
        "created_utc": 1635783062,
        "id": "hiwc0y4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635811862.0
    },
    {
        "author": "xtahua_42",
        "body": "All in XLNX Jan 200c",
        "created_utc": 1635799790,
        "id": "hixgr04",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635828590.0
    },
    {
        "author": "niloc99",
        "body": "Just get xlnx lower IV and undervalued compared to the deal",
        "created_utc": 1636059550,
        "id": "hjbyjhu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636088350.0
    },
    {
        "author": "rsoni1997",
        "body": "I don't know about you, but I'd buy it right now. It seems as if even if Xilinx goes up, so is AMD. Either way, you are getting a good deal.",
        "created_utc": 1636043470,
        "id": "hjatd5g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636072270.0
    },
    {
        "author": "Pas7alavista",
        "body": "Dw man I totally stole that dd from seeking alpha, but I've been loading up since the price ratio is lower than the conversion rate. The only thing to be aware of is that xlnx is a Chinese company so people are worried that the deal could get swatted at the last minute but I think it's a low chance.",
        "created_utc": 1636340691,
        "id": "hjrda6h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636369491.0
    },
    {
        "author": "FloridaReallyIsAwful",
        "body": "Really late to the game, but\nXLNX $250 Jan 2022 c",
        "created_utc": 1636232657,
        "id": "hjlh735",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636261457.0
    },
    {
        "author": "CamSlam2902",
        "body": "Xilinx tearing it up aswell holding both",
        "created_utc": 1635985614,
        "id": "hj8002d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636014414.0
    },
    {
        "author": "LiqCourage",
        "body": "I think they are trading off different scenarios right now, even though both are near ATH.  AMD is trading on taking share from INTC plus I think people are starting to treat the XLNX acquisition as accretive.  Yes they do have a graphics business but it wasn't an earnings driver in the recent earnings call.  NVDA I think is riding a bigger tail wind from crypto, and IMO is more priced to perfection (disclosure they are above my sell target price), but they have done a good job with software offerings that are quite profitable too.\n\nAll the analysis from Fidelity etc say INTC is undervalued and a buy while they say stay away from AMD.  I think they have it wrong on AMD and INTC but that's what you get from sell side analysts whose job is frequently to pander for investment banking opportunities.",
        "created_utc": 1635956590,
        "id": "hj5ywcm",
        "score": 1,
        "subreddit": "investing",
        "created": 1635985390.0
    },
    {
        "author": "qazwer001",
        "body": "Personally I'm hoping amd slides down a bit further. Got a bunch of cash waiting for a decent entry to XLNX for merger",
        "created_utc": 1635776160,
        "id": "hivwlf7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635804960.0
    },
    {
        "author": "Wiscoman",
        "body": "Are you planning on holding through XLNX approval announcement and close of acquisition?",
        "created_utc": 1636070836,
        "id": "hjcpn8b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636099636.0
    },
    {
        "author": "isellamdcalls",
        "body": "amd and xilinx",
        "created_utc": 1636132511,
        "id": "hjfss9d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636161311.0
    },
    {
        "author": "FloridaReallyIsAwful",
        "body": "What’s the Sharpe ratio of YOLO bets on AMD and XLNX!?!?",
        "created_utc": 1636114107,
        "id": "hjelker",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636142907.0
    },
    {
        "author": "Away_Needleworker655",
        "body": "I do actually have some xlnx for some good gains too, but I’m a little wary on the merger, Lisa said she’s hoping to close by eoy. It’s getting close I am hoping they at least have some news for the event on the 8th, if not I’ll probably sell and put it all in amd. Well see time will tell.",
        "created_utc": 1636080737,
        "id": "hjdbjwy",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1636109537.0
    },
    {
        "author": "king-bollie",
        "body": "Nope amd ab to be a disappointment until next earnings season or xlnx merger",
        "created_utc": 1636321975,
        "id": "hjq80nl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636350775.0
    },
    {
        "author": "Wilkesy07",
        "body": "Because there has to be a premium for taking the risk. The merge might fall through in which case xlnx tanks.",
        "created_utc": 1635772695,
        "id": "hivpo2s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635801495.0
    },
    {
        "author": "GamerGER",
        "body": "If you want to buy AMD get XLNX instead. They will exchange for 1:1.7 pretty soon.\n\nSmall gamble though.",
        "created_utc": 1635798516,
        "id": "hixdkyy",
        "score": 1,
        "subreddit": "investing",
        "created": 1635827316.0
    },
    {
        "author": "rankiba",
        "body": "Interested in this play, what do you mean by trading at a 70% discount to AMD options at the 1.7234 merger ratio? Divide AMD prices by XLNX prices?",
        "created_utc": 1635782025,
        "id": "hiw9np8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635810825.0
    },
    {
        "author": "snkbrdng",
        "body": "NVDA and AMD are the best chips.\nNVDA now trades at 22x sales (and has recently made us 🍗🍗🍗)\nAMD is trading at 8x sales \n🐓🐓🐓🐓🐓🐓\n\npositions $200k AMD calls $130,000 Xilinx shares",
        "created_utc": 1635789195,
        "id": "hiwqoyc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635817995.0
    },
    {
        "author": "Desmater",
        "body": "I am long UMC, AMD/XLNX, MRVL, NVDA, QCOM, TXN and INTL.\n\nUMC is just overlooked, under the radar.\n\nSecond they are located in Taiwan and you know the geo political issues right now.\n\nThird they don't make leading edge chips. I feel they are similar to TXN.",
        "created_utc": 1635801606,
        "id": "hixl4qg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635830406.0
    },
    {
        "author": "covetednhk",
        "body": "Possible XILINX merger",
        "created_utc": 1635996422,
        "id": "hj8nala",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636025222.0
    },
    {
        "author": "drmcbrayer",
        "body": "Be careful. I’ve played nvidia all year. I’d try and be patient to see a 270 range price before going balls deep again. Realistically Xilinx calls would be better than AMD.",
        "created_utc": 1636056630,
        "id": "hjbr1jh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636085430.0
    },
    {
        "author": "niloc99",
        "body": "Xlnx is so undervalued right now with the merger 95% likely",
        "created_utc": 1636038357,
        "id": "hjag490",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636067157.0
    },
    {
        "author": "Cautious-Virus-2724",
        "body": "Xilinx didn’t make me 10k today lmao",
        "created_utc": 1636057481,
        "id": "hjbt8wb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636086281.0
    },
    {
        "author": "Cloakedbug",
        "body": "That happened earlier today with the combined value of AMD/XLNX no?",
        "created_utc": 1636100918,
        "id": "hje4ivt",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636129718.0
    },
    {
        "author": "ourobboros",
        "body": "Rumor says that it’s either EOY or next week so they don’t have to pay xlnx dividends.",
        "created_utc": 1636137034,
        "id": "hjg4ir4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636165834.0
    },
    {
        "author": "iiYop",
        "body": "Xilinx too",
        "created_utc": 1636204630,
        "id": "hjjpall",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636233430.0
    },
    {
        "author": "spctr13",
        "body": "&gt; in fact im fairly certain all of our parts are manufactured on US soil\n\nDown to what level though? Not many of the basic electronic components everything else is built from are made in the US. American companies like Vishay, Microchip, Texas Instruments, and Xilinx either operate factories in China or contract foundries in China or Taiwan. Other large supplies of ours are not even American such as Yageo and TE Connectivity aren't even headquartered in the US and manufacturer the bulk of their product in their home country. It's been a big issue for my portion of the defense industry the past couple of years because these factories in China are also sourcing a large portion of counterfeit electronic components on the market.\n\nI know we're not the only defense manufacturer using Chinese components because I've seen several news articles and reports from the DOD claiming this is a problem.\n\nhttps://www.washingtontimes.com/news/2020/dec/10/us-military-reliance-china-foreign-suppliers-expos/\n\nPanasonic and Murata (Japanese) used to produce critical components of our products, but have since stopped selling to us because they don't want their products used in munitions. When that happened the government fronted a lot of money to a couple American companies to produce an alternative since none existed.",
        "created_utc": 1635993895,
        "id": "hj8ic9d",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1636022695.0
    },
    {
        "author": "AdNo7192",
        "body": "Search for Xilinx. Amd is up 70% during last several months because of the deal.",
        "created_utc": 1636061633,
        "id": "hjc3q32",
        "score": 0,
        "subreddit": "StockMarket",
        "created": 1636090433.0
    },
    {
        "author": "ercanbas",
        "body": "They are not trying to convince you to dump GME to save Ken Griffin from your theoretical grip on Citadel’s balls. They care about page views and clearly it worked and I guarantee you that whatever publication it was has an opinion on both sides of the argument for every stock. Look into AMD and how they smashed earnings and what articles were put out to sell. Meanwhile they are climbing and are finalizing a huge merge with Xilinx.",
        "created_utc": 1635875140,
        "id": "hj1ctlq",
        "score": -4,
        "subreddit": "wallstreetbets",
        "created": 1635903940.0
    },
    {
        "author": "EZ_Money87",
        "body": "The 1.7 shares of AMD for every Xilinx share will be  interesting to see how it plays out.",
        "created_utc": 1635874416,
        "id": "hj1azzb",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635903216.0
    },
    {
        "author": "BenWinnin",
        "body": "ohh yeah amd and xilinx completely forgot about it",
        "created_utc": 1635873000,
        "id": "hj17fqt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635901800.0
    },
    {
        "author": "MangoAI",
        "body": "AMD and BNTX - AMD continues to grab market share and takes over Xilinx soon, Biontech sold most vaccines on the planet because they are the best.",
        "created_utc": 1635766219,
        "id": "hivf993",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635795019.0
    },
    {
        "author": "AlmightySnoo",
        "body": "Shit, I'm out of $AMD, that downgrade is nasty especially when $XLNX is already holding it down until merger. All in $TSLA for now.",
        "created_utc": 1635764472,
        "id": "hivcwo0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635793272.0
    },
    {
        "author": "zg44",
        "body": "XLNX options will double (at least) if the AMD merger goes through (because it's an all stock merger).\n\nDunno how risky the China approval situation is though.\n\nAMD execs were confident China would give approval in Dec.\n\nI may load some January XLNX calls at end of Nov if they are trading at a 70% discount to AMD options at the 1.7234 merger ratio.\n\nWorth keeping an eye on...",
        "created_utc": 1635781737,
        "id": "hiw8zrh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635810537.0
    },
    {
        "author": "zg44",
        "body": "Yeah the XLNX options will convert into AMD options at that ratio.\n\nSo like if AMD is $125, XLNX conversion value would be $215. \n\nSafest way will likely be to just buy some slightly OTM XLNX options.\n\nXLNX would go to $205-210 immediately after China grants clearance.\n\nObviously that's biggest risk which is a wild card.",
        "created_utc": 1635783062,
        "id": "hiwc0y4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635811862.0
    },
    {
        "author": "xtahua_42",
        "body": "All in XLNX Jan 200c",
        "created_utc": 1635799790,
        "id": "hixgr04",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635828590.0
    },
    {
        "author": "qazwer001",
        "body": "Personally I'm hoping amd slides down a bit further. Got a bunch of cash waiting for a decent entry to XLNX for merger",
        "created_utc": 1635776160,
        "id": "hivwlf7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635804960.0
    },
    {
        "author": "Wilkesy07",
        "body": "Because there has to be a premium for taking the risk. The merge might fall through in which case xlnx tanks.",
        "created_utc": 1635772695,
        "id": "hivpo2s",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635801495.0
    },
    {
        "author": "GamerGER",
        "body": "If you want to buy AMD get XLNX instead. They will exchange for 1:1.7 pretty soon.\n\nSmall gamble though.",
        "created_utc": 1635798516,
        "id": "hixdkyy",
        "score": 1,
        "subreddit": "investing",
        "created": 1635827316.0
    },
    {
        "author": "rankiba",
        "body": "Interested in this play, what do you mean by trading at a 70% discount to AMD options at the 1.7234 merger ratio? Divide AMD prices by XLNX prices?",
        "created_utc": 1635782025,
        "id": "hiw9np8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635810825.0
    },
    {
        "author": "snkbrdng",
        "body": "NVDA and AMD are the best chips.\nNVDA now trades at 22x sales (and has recently made us 🍗🍗🍗)\nAMD is trading at 8x sales \n🐓🐓🐓🐓🐓🐓\n\npositions $200k AMD calls $130,000 Xilinx shares",
        "created_utc": 1635789195,
        "id": "hiwqoyc",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635817995.0
    },
    {
        "author": "Desmater",
        "body": "I am long UMC, AMD/XLNX, MRVL, NVDA, QCOM, TXN and INTL.\n\nUMC is just overlooked, under the radar.\n\nSecond they are located in Taiwan and you know the geo political issues right now.\n\nThird they don't make leading edge chips. I feel they are similar to TXN.",
        "created_utc": 1635801606,
        "id": "hixl4qg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635830406.0
    },
    {
        "author": "esqualatch12",
        "body": "My take on stock investing in general is it really works in levels. You do not touch the higher levels of investing until you have a firm understanding and success at the lower. \nThe lowest level is ETF investing, easy to learn easy to toss money at and make returns. Also builds a strong base to work from\n\n The 2nd is individual stock, once you really learned to analyze investment data. You can also work on the emotional side of your investments in this area like not panicking during a selloff or becoming to elated in your gains not to sell.\n\nThe 3rd level is learning the various trading options such as limits, stop losses and margins. Really it can be bundled into the 2nd BUT these things are generally more important for traders rather Investors.\n\nFinally we get to options, if you don't have a firm grasp and decent experience with the above then you need to stay the hell away from options. They are the ultimate trap to newbie investors who see dipshits on WSB gambling away there entire savings. HOWEVER, a reasonable experienced investor whom can make sound decisions in there investments in the previous level can  infact benefit from limited option trading (can never recommend an all in). \n\nI for one am sitting on some delicious AMD 87.5 leap calls that don't expire til next June. I felt they were a reasonable investment as the XLNX merger was already know.",
        "created_utc": 1636682199,
        "id": "hka2zvj",
        "score": 74,
        "subreddit": "stocks",
        "created": 1636710999.0
    },
    {
        "author": "letsmakesomecalls",
        "body": "Oh no! Su Bae always pulls through!\nXlnx merger will be next catalyst to $180.\nI’ll be looking for re entry.",
        "created_utc": 1636392684,
        "id": "hjts7f6",
        "score": 30,
        "subreddit": "wallstreetbets",
        "created": 1636421484.0
    },
    {
        "author": "VaultBoy3",
        "body": "I bought my first house this year because of my GME gains.\n\nNow I'm already in the position to buy a second house thanks to AMD/XLNX gains. 😂🤑\n\nLife is crazy. Chase your dreams kids.",
        "created_utc": 1636408485,
        "id": "hjuvkb3",
        "score": 23,
        "subreddit": "wallstreetbets",
        "created": 1636437285.0
    },
    {
        "author": "VaultBoy3",
        "body": "Semiconductor company that's rumored to merge with AMD by the end of the year at a ratio of 1.7234 meaning each of my XLNX shares turns into 1.7234 shares of AMD.\n\nIf you do the math, XLNX ought to move up another 15-20% upon merging.",
        "created_utc": 1637120137,
        "id": "hky0918",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1637148937.0
    },
    {
        "author": "WrongPurpose",
        "body": "Looks like we should buy some XLNX then.",
        "created_utc": 1636393791,
        "id": "hjtuzy5",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636422591.0
    },
    {
        "author": "INukeMyAccountDaily",
        "body": "AMD &amp; XLNX are about to moon on the acquisition finalization announcement.",
        "created_utc": 1636659520,
        "id": "hk8nwy0",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636688320.0
    },
    {
        "author": "SofaKingStonked",
        "body": "I think they have to get to an inflection point on the technological delta with tsm before I’d even consider it. Right now the gap is continuing to widen and all of the major tech pushes in semiconductors right now need lower power consumption. PCs dominated the sector for decades but in 2018 you could see that era was coming to an end. PCs are the only area we’re intels 10 nm process node competes. By the time 7 nm is in production tsm will have released 3 nm. A few years ago intel was only one process node behind but now they are 2.\n\nMaybe the best example of this is my best friend who is not an engineer owning a ton of intel he bought the upward swing of the dip in 2019 and got it for 48. I convinced him to rotate that position into Amd and the best way to do that was xlnx based on price ratio of the two. He was able to get out at 57. He made 18.75% holding a stock for two years during one of the most historic bull runs ever and even an order of magnitude more historic for semiconductor stocks. He rotated all of it into xlnx at 120 and in a few months is up 79%. The delta between Amd price appreciation and intel might not always be that crazy and that fast but for the next two or so years I think most semiconductor stocks will outpace intel gains wise.",
        "created_utc": 1637039223,
        "id": "hktgmqc",
        "score": 8,
        "subreddit": "stocks",
        "created": 1637068023.0
    },
    {
        "author": "RetdThx2AMD",
        "body": "Arbs don't have unlimited funds.  As AMD rips up they have to keep increasing their exposure to keep XLNX at pace.   At some point they reach their budgetary limit and then the gap widens their AMD shorts start to put pressure on their margin balance.  Then they have to buy AMD / sell XLNX to unwind.  Eventually new money will come in to chase those sweet returns and things will balance out, until the next time.  The same thing happened after Q2 earnings back in July.",
        "created_utc": 1636394810,
        "id": "hjtxjs4",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636423610.0
    },
    {
        "author": "werewere223",
        "body": "XLNX (Cheap AMD play) is what I'm in, also I grabbed some KLIC. Remember during the gold rush the miners weren't the ones coming out rich, it was the people selling the pickaxes and shovels. KLIC is a super undervalued play in that industry",
        "created_utc": 1636080582,
        "id": "hjdb8fz",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636109382.0
    },
    {
        "author": "heprotecs",
        "body": "Buy Xlnx instead. They will get 1.72 AMD shares when merger is approved. Right now trading at 25% discount",
        "created_utc": 1636394542,
        "id": "hjtwvvf",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636423342.0
    },
    {
        "author": "EZ_Money87",
        "body": "The 1.7 shares of AMD for every Xilinx share will be  interesting to see how it plays out.",
        "created_utc": 1635874416,
        "id": "hj1azzb",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635903216.0
    },
    {
        "author": "wondermania",
        "body": "Fully loaded for XLNX deal to finalize before EOY.",
        "created_utc": 1636064691,
        "id": "hjcb7ov",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636093491.0
    },
    {
        "author": "BenWinnin",
        "body": "ohh yeah amd and xilinx completely forgot about it",
        "created_utc": 1635873000,
        "id": "hj17fqt",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635901800.0
    },
    {
        "author": "Zerole00",
        "body": "Bought AMD at $18, sold it at $50. I can't wait for my 200 shares of XLNX ($120 avg) to get converted to AMD. I'll hold it much longer this time around.",
        "created_utc": 1636402391,
        "id": "hjugabj",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636431191.0
    },
    {
        "author": "ourobboros",
        "body": "Is this the week where xlnx and amd turn into Gogeta?",
        "created_utc": 1636353768,
        "id": "hjryzz5",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636382568.0
    },
    {
        "author": "4ttil4th3hun",
        "body": "I disagree with your datacenter argument, their cloud segment dropped 20% and AMD is taking marketshare in the server space.\n\nAMD’s Epyc cpus are better in powerefficiency and multitasking, they just announced 128 core chip for early 2023. They have technological advantage here. \n\nFurthermore with their new MI200 datacenter GPU they are challenging nvidia in this area as well.\n\nSo overall AMD is better choice, they have a good roadmap, rising margins, rising revenues, they are expanding to new markets (Xilinx) and so far they’ve delivered their promises. \nDisclaimer: my biggest position is AMD shares",
        "created_utc": 1636960732,
        "id": "hkp0hch",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636989532.0
    },
    {
        "author": "Illustrious_Truth_34",
        "body": "LOAD UP ON AMD... THEY STILL ARE TRYING TO ACQUIRE Xilinx  BY END OF YEAR",
        "created_utc": 1636129831,
        "id": "hjflsal",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636158631.0
    },
    {
        "author": "L3artes",
        "body": "Sold and for 100% over a few month, bought xilinx, Intel, micron and ASX.\n\nAll dirt cheap.",
        "created_utc": 1636636633,
        "id": "hk75w5k",
        "score": 5,
        "subreddit": "investing",
        "created": 1636665433.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/VaultBoy3 (1/0) made a bet that XLNX would go to 199.21 when it was 181.1 and it did, congrats fucker.",
        "created_utc": 1636052919,
        "id": "hjbhlmd",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636081719.0
    },
    {
        "author": "Wiscoman",
        "body": "Same with AMD once Xilinx acquisition is completed.  AMD+XLNX is maybe 1 year or less behind NVDA in terms of size and look at the differences in Market caps.",
        "created_utc": 1636057017,
        "id": "hjbs1tx",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636085817.0
    },
    {
        "author": "TechnicalEntry",
        "body": "130 shares of AMD (and 20 XLNX), average cost $94 - LETS FUCKING GOOOOOOO",
        "created_utc": 1636389259,
        "id": "hjtjiya",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636418059.0
    },
    {
        "author": "bearhunter429",
        "body": "AMD up 11% while XLNX is up only 2.5%. Time to buy XLNX.",
        "created_utc": 1636394650,
        "id": "hjtx5qn",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636423450.0
    },
    {
        "author": "Danielfm95",
        "body": "Yea im doing the same, but got in xlnx a bit late (185 or so), my amd shares are up 90% tho 😂",
        "created_utc": 1637136245,
        "id": "hkyqekv",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1637165045.0
    },
    {
        "author": "papabri",
        "body": "Love it. Holding both AMD and XLNX shares and calls.",
        "created_utc": 1635913794,
        "id": "hj3yqki",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635942594.0
    },
    {
        "author": "VaultBoy3",
        "body": "AMD and XLNX can't be stopped. We buy the dip.",
        "created_utc": 1636702723,
        "id": "hkb41pc",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636731523.0
    },
    {
        "author": "2CommaNoob",
        "body": "Nice play.  Been in AMD since $12; took some profits along the way but still rocking a shit ton of shares along with xlnx.",
        "created_utc": 1635972196,
        "id": "hj73xzc",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636000996.0
    },
    {
        "author": "VaultBoy3",
        "body": "BUY THE DIP ON XLNX\n\nXLNX is merging with AMD in about 2 months with a ratio of 1.7234 AMD shares for every XLNX share\n\nThis means XLNX shares will be worth 1.7234x more than AMD shares.\n\n$150×1.7234=$258.51\n\nThere's a 25% gain to be made on XLNX\n\nLook it up",
        "created_utc": 1636393195,
        "id": "hjtthw7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636421995.0
    },
    {
        "author": "McSupergeil",
        "body": "I had boight nvidia pre split and sold  with almost 200% gains.. i love nvidia and amd but they are both pumping like crazy atm and i dont think that is sustainable... i will still keep my amd i got since 2015, because of the xilinx merger but i will slowly transer into divident stocks, these tech valuations begin to scare me",
        "created_utc": 1636716215,
        "id": "hkbjx72",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636745015.0
    },
    {
        "author": "P33L_R",
        "body": "Port rn is \n\nAMD calls \nNVDA FDs\nRIOT calls \nMVIS shares \nXLNX shares\n\nAm genius",
        "created_utc": 1636454938,
        "id": "hjx6xxh",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636483738.0
    },
    {
        "author": "L3artes",
        "body": "Xilinx is amazing. Super fun merger arbitrage. They are at 198$ and AMD is at 137.5$ and they will merge for 1.743 shares per share which comes out at 240$. Was even better a few weeks ago.",
        "created_utc": 1636062946,
        "id": "hjc6zp9",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1636091746.0
    },
    {
        "author": "axe-cap1",
        "body": "Any idea why XLNX isn’t following AMD up?",
        "created_utc": 1636392990,
        "id": "hjtszft",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636421790.0
    },
    {
        "author": "BATTLECATHOTS",
        "body": "AMD + META + future merger with Xilinx\n\nAMD going to worth more than NVIDIA",
        "created_utc": 1636403943,
        "id": "hjuk51a",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636432743.0
    },
    {
        "author": "IllBiteYourLegsOff",
        "body": "AMD rocketing above ATH while xlnx just chilling below the one it set earlier today... what is going on there...?",
        "created_utc": 1636051399,
        "id": "hjbdql9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636080199.0
    },
    {
        "author": "rsoni1997",
        "body": "Anyone get in on AMD + Xilinx merger?\n\nXLNX one share = 1.7234 shares of AMD\n1.7234 shares of AMD at current price is 234. \n\nXLNX trading at 197-198 right now. AMD likely to go higher.",
        "created_utc": 1636043090,
        "id": "hjasctf",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636071890.0
    },
    {
        "author": "Danielfm95",
        "body": "The xlnx shares and calls will net you some sweet gains when the merger goes through 😁",
        "created_utc": 1637133623,
        "id": "hkyn1iw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1637162423.0
    },
    {
        "author": "180IQCONSERVATIVE",
        "body": "The cap of Nvidea will be close to 325.  It's almost there.  As I said it's going to start leveling off. Investors will still invest but will look for other things for gains.  AMD is set to release new processor and chips.  The AMD acquisition of Xilinx is still on.  Read up on Xilinx.  AMD was at and up and down for a while in the 120 to 125 per share.  My tech investments are on fire.  Once AMD is done with buy out the stock will fly and they will eventually be right up on Nvideas back door.",
        "created_utc": 1636080177,
        "id": "hjdaeah",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1636108977.0
    },
    {
        "author": "Fantasyball8",
        "body": "Sold all my AMD and bought XLNX fuck it cocks out",
        "created_utc": 1636671660,
        "id": "hk9gxv5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636700460.0
    },
    {
        "author": "INukeMyAccountDaily",
        "body": "AMD &amp; XLNX are about to moon on the acquisition finalization announcement.CALLS",
        "created_utc": 1636663471,
        "id": "hk8xikh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636692271.0
    },
    {
        "author": "UnseenTardigrade",
        "body": "Yeah, having my TSM feels good today. Having NVIDIA or AMD would be better though lol. I sold my XLNX for a 20% gain a couple weeks ago. Should have held on for even more the way things are going with AMD",
        "created_utc": 1636055974,
        "id": "hjbpdl7",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636084774.0
    },
    {
        "author": "chickenfriedsandwich",
        "body": "15% of my portfolio is now the XLNX/AMD arbitrage play. Sort of want to make it even more…",
        "created_utc": 1636474367,
        "id": "hjy7kfq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636503167.0
    },
    {
        "author": "Mammoth-Passenger-88",
        "body": "I just paperhanded into Xilinx at ATH . ![img](emote|t5_2th52|4260)![img](emote|t5_2th52|4263) If this merger fails you can meet me behind wendys in the dumpster.",
        "created_utc": 1636398648,
        "id": "hju6zu0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636427448.0
    },
    {
        "author": "MangoAI",
        "body": "AMD and BNTX - AMD continues to grab market share and takes over Xilinx soon, Biontech sold most vaccines on the planet because they are the best.",
        "created_utc": 1635766219,
        "id": "hivf993",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635795019.0
    },
    {
        "author": "ImRunningOutOfIdead",
        "body": "I dont hold AMD but I do hold XLNX so I am quite pleased with this.",
        "created_utc": 1636396026,
        "id": "hju0fq5",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636424826.0
    },
    {
        "author": "kitfoxtrot",
        "body": "I'd wait it out a bit more myself then just roll it if you get into trouble or let it get called and roll that $ into xlnx if ratio still favorable?",
        "created_utc": 1636463958,
        "id": "hjxkie6",
        "score": 2,
        "subreddit": "options",
        "created": 1636492758.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Meta is choosing AMD over NVDA which caused a pop which seems to have blown out people playing arbitrage on the XLNX merger\n\nAt least that’s the best guess based on available info",
        "created_utc": 1636395290,
        "id": "hjtymo6",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636424090.0
    },
    {
        "author": "MericuhFuckYeah",
        "body": "What am I missing about xlnx? Shouldn’t it trade near the same to AMD if this is a slam dunk? Or Is the merger just not à certainty?",
        "created_utc": 1636409418,
        "id": "hjuxure",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636438218.0
    },
    {
        "author": "PoEisFine69",
        "body": "so when is amd dropping cause of xlnx price",
        "created_utc": 1636739889,
        "id": "hkcxpa9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636768689.0
    },
    {
        "author": "Fantasyball8",
        "body": "Sell AMD and buy XLNX then. AMD is acquiring XLNX  and one share oF XLNX will get you 1.7 shares of AMD",
        "created_utc": 1636740746,
        "id": "hkczsie",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636769546.0
    },
    {
        "author": "notbrokemexican",
        "body": "For me it was the fact that AMD was making computing cheaper for people like me when it came to gaming.\n\nAt the time I worked in manufacturing and understood the economic value or 3D computing and the challenges of it. \n\nI found AMDs energy vertical with alternative currencies very intriguing and made me understand their server side growth. This was when I was a computer science student.\n\n\nI'm still bullish on AMD and I'm inspired by its future with Xilinx. I'm probably more excited about Xilinx today than I am AMD.",
        "created_utc": 1636658539,
        "id": "hk8ljeb",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636687339.0
    },
    {
        "author": "asicman78",
        "body": "Trying to use XLNX options to play AMD. Sadly I do not know what I am doing.",
        "created_utc": 1636571887,
        "id": "hk3sg9n",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636600687.0
    },
    {
        "author": "Time_Kaleidoscope",
        "body": "Every time I try to do an arbitrage play it blows up in my face… please XLNX don’t fuck me",
        "created_utc": 1637095611,
        "id": "hkwexrb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637124411.0
    },
    {
        "author": "raris_rovers",
        "body": "XLNX finally someone else printing off this obvious play",
        "created_utc": 1637141062,
        "id": "hkyw6qn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637169862.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "Personally I think it’s overpriced rn and Im holding shares 🤷‍♂️ \n\nXLNX merger getting approved might make it pop even more though",
        "created_utc": 1637178820,
        "id": "hl10xg9",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637207620.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  4th of November\n\n\n\n## Upcoming events for Thursday, November  4th\n\n - Expected earnings:\n\n  AAOI, AAON, AAU, ABC, ABNB, ABUS, ACET, ACIW, ACMR, ACR, ACRX, ADAP, ADMA, ADMS, ADVM, ADXN, AE, AERI, AES, AEZS, AFCG, AG, AGLE, AGO, AGS, AHCO, AIG, AINV, AIV, AJX, AKBA, AL, ALBO, ALE, ALEX, ALGS, ALHC, ALKT, ALLO, ALRM, ALTR, AMEH, AMH, AMN, AMPY, AMRK, AMYT, ANGI, ANIK, AOSL, APD, APLE, APPN, APR, APRE, APT, APTV, AQMS, ARC, ARDX, ARNA, ARQT, ARVN, ARW, ASMB, ASPS, ASRT, ATAX, ATEC, ATLO, ATNX, ATRA, ATRS, ATSG, ATUS, AUMN, AUTO, AVLR, AVRO, AXNX, BABA, BALY, BAP, BATRA, BATRK, BBD, BBDO, BBIO, BCE, BCLI, BCOR, BCYC, BDX, BE, BEPC, BFS, BGNE, BGS, BHF, BIGC, BILL, BKD, BL, BLCM, BLDR, BLFS, BLI, BLL, BLPH, BNGO, BPMP, BRG, BSBK, BSGM, BXRX, CABO, CAI, CALA, CARS, CBAY, CBIO, CC, CCOI, CDR, CDTX, CDXS, CDZI, CEMI, CFLT, CFX, CGNX, CHH, CHUY, CI, CIR, CLBS, CLDT, CLDX, CLFD, CLI, CLLS, CLNE, CLXT, CMBM, CMRX, CMT, CNCE, CNDT, CNHI, CNP, CNQ, CNXN, COLD, COLL, COMM, CPLG, CPLP, CRAI, CRDF, CRMD, CRON, CRY, CS, CTHR, CTLP, CTMX, CTSO, CTT, CTXS, CUBE, CVCO, CVET, CVNA, CVRX, CWEN, CWEN.A, CWK, CXP, CYBR, CYCN, CYRX, DBRG, DBX, DDOG, DEN, DHC, DIN, DISH, DK, DKL, DLX, DMLP, DNB, DNLI, DNN, DOCN, DRH, DRNA, DUK, DVAX, DWSN, DYN, EBS, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, EOG, EPAM, ERF, ERII, ESTE, ETTX, EURN, EVC, EWCZ, EXPE, FARM, FAT, FATBB, FATE, FCRD, FDUS, FIS, FLNT, FND, FNKO, FOCS, FOLD, FOR, FOXF, FROG, FRT, FSLR, FTNT, FULC, FVCB, FVE, FWONA, FWONK, GBT, GDOT, GDP, GDYN, GEL, GEO, GERN, GH, GIL, GKOS, GLPG, GMED, GNE, GNL, GOGO, GOLD, GOLF, GOVX, GPP, GPRE, GPRO, GRFS, GROW, GRTS, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HEAR, HHC, HII, HIMX, HL, HMHC, HMPT, HRTG, HSKA, HTA, HWM, HZN, IAC, IBOC, IBP, ICL, IDCC, IDRA, IFRX, IGMS, IHC, IHRT, III, ILMN, IMH, IMMR, IMRA, IMUX, INDP, INDT, ING, INGN, INOD, INS, IOVA, IRM, IRTC, IRWD, ISDR, ISPC, ITP, ITRI, JNCE, JYNT, K, KALA, KBAL, KDMN, KDNY, KFFB, KIQ, KMPH, KOP, KRP, KRTX, KTB, KURA, KVHI, KWR, KYMR, KZR, LABP, LASR, LAUR, LAZY, LBRDA, LBRDK, LCUT, LFVN, LGF.A, LGF.B, LITE, LLNW, LND, LNG, LNT, LNTH, LOCO, LORL, LPTH, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LTRPA, LTRPB, LXP, LYV, MACK, MAIN, MASS, MBUU, MCHP, MDGL, MDRX, MED, MELI, MGEE, MGLN, MGTA, MGTX, MITK, MITO, MLAB, MLCO, MNDT, MNST, MP, MRIN, MRNA, MSC, MSGM, MSI, MTBC, MTD, MTEM, MTSI, MTX, MTZ, MUR, MUX, MXC, MYE, NATR, NE, NEO, NEPH, NET, NFG, NH, NHC, NINE, NKLA, NKSH, NKTR, NLOK, NMM, NNBR, NNI, NOMD, NPTN, NREF, NRG, NS, NSIT, NTCT, NTLA, NTRA, NTUS, NVAX, NVMI, NWS, NWSA, NXTC, OBSV, OEC, OGE, OHI, OLED, ONCT, ONTO, OPCH, OPTN, ORGS, ORIC, ORLA, OTEX, OTRK, OUT, OXY, OYST, PAC, PAE, PALT, PASG, PBA, PBH, PBYI, PCOR, PCTI, PCTY, PDCE, PDEX, PECO, PEI, PENN, PESI, PFSI, PGNY, PH, PHI, PINS, PLM, PLNT, PLX, PMT, PODD, PPL, PRCT, PRDO, PRMW, PROF, PRTA, PRVB, PSNL, PTMN, PTON, PWFL, PWP, PWR, PZG, PZZA, QDEL, QRTEA, QRTEB, QTRX, RBA, RC, RCUS, RDFN, REFR, REG, REGN, REPL, REYN, REZI, RFP, RGA, RGLS, RGS, RKT, RLJ, RMAX, RNGR, RUN, RWAY, SALM, SATS, SELB, SEM, SFE, SFM, SGA, SGMO, SHAK, SHO, SHYF, SID, SIGA, SKM, SLDB, SLQT, SLRX, SMHI, SMLP, SNPO, SO, SPRO, SQ, SRLP, SRRA, SRTS, SSYS, STFC, STKS, STNE, STOR, STRA, STRO, SVC, SVM, SVRA, SWCH, SWKS, SWX, SXI, SYBX, SYNA, TAL, TCX, TDC, TDS, TDW, TEF, TFFP, TGH, TGNA, TGP, TGTX, THR, TIPT, TK, TMCI, TMST, TNK, TPL, TRGP, TRHC, TRIN, TTOO, TTSH, TUEM, TWI, UBER, UEIC, UFCS, UIHC, UNIT, UONE, UONEK, USM, USPH, USWS, VATE, VCTR, VG, VHI, VIA, VIAC, VIACA, VIAO, VIAV, VIR, VLDR, VMC, VNT, VRAY, VRRM, VSAT, VSTO, VTVT, VVI, W, WCC, WD, WELL, WFCF, WLDN, WLL, WMC, WMS, WPM, WSC, WSTG, WW, WWE, WYNN, XENE, XFOR, XLRN, XOMA, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZBH, ZEUS, ZGNX, ZTS\n\n - Ex-div:\n\n  AFB, AMX, ARLP, BKEP, BMRC, BPRN, CEQP, CFFN, CMCO, CMS, CPLP, CVCY, DAN, DKL, ET, FBC, FCBC, FCF, FE, FFWM, FRAF, FRBA, GPP, HCC, HSII, HWKN, HWM, IBCP, ICBK, IDA, INTC, JBHT, LBAI, LBC, LVHD, LW, MMLP, MMP, NSC, NWBI, NWLI, NYCB, OHI, PFE, PNFP, RELL, SIRI, SRLP, STZ, STZ.B, SUN, TGP, UL, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 17.895K)\n    - Continuing Jobless Claims (consensus: 2,118K, previous: 2,243K)\n    - Exports (previous: 213.70B)\n    - Imports (previous: 287.00B)\n    - Initial Jobless Claims (consensus: 275K, previous: 281K)\n    - Jobless Claims 4-Week Avg. (previous: 299.25K)\n    - Natural Gas Storage (consensus: 63B, previous: 87B)\n    - Nonfarm Productivity (consensus: -3.0%, previous: 2.1%)\n    - OPEC Meeting\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n    - Unit Labor Costs (consensus: 7.0%, previous: 1.3%)\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AMRX, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, EPZM, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, MTNB, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NVO, NWLI, NWN, OCGN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TELL, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n^^^^2021-11-04",
        "created_utc": 1636020014,
        "id": "hj9i3rw",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636048814.0
    },
    {
        "author": "180IQCONSERVATIVE",
        "body": "AMD is buying out Xilinx.  If you don't know you need to look at Xilinx.  It seems AMD will be following what Nvidea has expanded to be.  Xilinx stock is at 191 and by far not a peanuts company.  AMD stock is still cheap compared to what it will be in 5 years or less.  Qualcomm is having big gains too.  I have all three plus others and my gains today is damn close to orgasmic.",
        "created_utc": 1636051064,
        "id": "hjbcvi3",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1636079864.0
    },
    {
        "author": "AlmightySnoo",
        "body": "Shit, I'm out of $AMD, that downgrade is nasty especially when $XLNX is already holding it down until merger. All in $TSLA for now.",
        "created_utc": 1635764472,
        "id": "hivcwo0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635793272.0
    },
    {
        "author": "boristheblade202",
        "body": "There’s more to it than just thinking it will hit my  call price. If the stock is at $100, I can buy $140 (or higher/lower, this is just an example) and if the stock goes up I can earn money along the way. Once your option is “in the money (ITM)” your options gain faster. A common strategy is to buy Leaps, which are a year or two out or more (expiration date). Do this with solid companies and look at their performance, price targets, etc. AMDs price target has, mostly, been pushed some where between $130-150. So I bought $130 calls when the price was around $125 (they’ve crushed earnings all year and had big runs the last two ERs). I’ve been in and out of calls with this stock for the past year+. There’s a macro play with merger coming. This is not about gambling. It’s knowing the stock, fundamentals, and preparing accordingly. Fully expect this to run more post-merger with Xilinx. Then will take it from there. Hope this helps.",
        "created_utc": 1636121510,
        "id": "hjf0oz7",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636150310.0
    },
    {
        "author": "UnseenTardigrade",
        "body": "Wish I hadn’t sold my XLNX for a 20% gain a few weeks ago… would be up like 40% now. Oh well, a 20% gain is still pretty good for how little time I held it.",
        "created_utc": 1636389983,
        "id": "hjtld8u",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636418783.0
    },
    {
        "author": "j455b",
        "body": "Huh? Remember when it was at 73$ a few months ago after  the Xilinx crap...ppl these days",
        "created_utc": 1636643746,
        "id": "hk7kxpy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636672546.0
    },
    {
        "author": "bearhunter429",
        "body": "XLNX acquisition to be approved any day now.",
        "created_utc": 1636663579,
        "id": "hk8xryc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636692379.0
    },
    {
        "author": "RockinOutCockOut",
        "body": "Xilinx\n\nOnce (if) the acquisition happens, I believe that AMD will have momentum to reach 300$ by this time next year.",
        "created_utc": 1636406925,
        "id": "hjurn3u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636435725.0
    },
    {
        "author": "stevoacp1",
        "body": "spreads on XLNX options are fucked tho since they’re so low volume",
        "created_utc": 1636403736,
        "id": "hjujmjs",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636432536.0
    },
    {
        "author": "P33L_R",
        "body": "PM and AH moves are not a good indicator for AMD. It has been following XLNX",
        "created_utc": 1636980363,
        "id": "hkppa75",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637009163.0
    },
    {
        "author": "zg44",
        "body": "XLNX options will double (at least) if the AMD merger goes through (because it's an all stock merger).\n\nDunno how risky the China approval situation is though.\n\nAMD execs were confident China would give approval in Dec.\n\nI may load some January XLNX calls at end of Nov if they are trading at a 70% discount to AMD options at the 1.7234 merger ratio.\n\nWorth keeping an eye on...",
        "created_utc": 1635781737,
        "id": "hiw8zrh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635810537.0
    },
    {
        "author": "DragonInPajama",
        "body": "I may buy some xlnx in a dip",
        "created_utc": 1636043264,
        "id": "hjastf2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636072064.0
    },
    {
        "author": "L3artes",
        "body": "In this case it is. For every share of xilinx that i hold, i will receive shares of and which are worth more than the xilinx shares.",
        "created_utc": 1636090953,
        "id": "hjdsveh",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1636119753.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the  5th of November\n\n\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BORR, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NWLI, NWN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PMTS, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n## Upcoming events for Monday, November  8th\n\n - Expected earnings:\n\n  ABEO, ACAD, ADMP, AEIS, AEL, AESE, AGM, AKYA, ALAC, ALLK, ALNA, ALT, AMBC, AMC, AMPH, AMRS, AMSC, ANAT, APEI, APLS, APPF, APTS, ARCT, ARVL, ASM, ASUR, ATCO, ATCX, ATER, ATRI, ATRO, AUID, AVCO, AVD, AVDL, AVEO, AVTX, AXSM, BAND, BATL, BEKE, BHVN, BKI, BLDP, BOMN, BRAG, BRFS, BRMK, BRP, BRT, CAPL, CARA, CBT, CCLP, CECE, CELC, CHRS, CLAR, CLOV, CLPR, CLRB, CMCT, COGT, COTY, CPHC, CRD.A, CRD.B, CSSE, CSTL, CTKB, CTRE, CXW, DAC, DDD, DH, DIT, DOOR, DPRO, DS, DSGN, DSS, EC, EDIT, EFC, EHTH, EML, ENV, ENVX, EVCM, EVI, EWTX, EYEG, EZFL, FA, FBIO, FBRX, FEDU, FGBI, FIVN, FIXX, FLDM, FLL, FNHC, FPAY, FRHC, FRPT, FSK, FSP, FTK, FWRG, GALT, GAME, GECC, GOSS, GPMT, GSKY, GTES, GTH, HFFG, HIL, HLIO, HNGR, HNRG, HPK, HTBX, HYMC, ICMB, IEA, IFF, IIN, IMOS, INST, IPAR, IX, JAN, JHX, JKHY, KERN, KNDI, KOD, KOS, KRYS, LBPH, LFST, LINC, LIZI, LJPC, LMND, LNSR, LOGC, LOTZ, LTBR, LWLG, MCRB, MDVL, MILE, MLVF, MNOV, MNTX, MORF, MPAA, MRC, MRKR, MRTX, MSGS, MTNB, MTRX, MWA, NCMI, NERV, NES, NEWR, NEWT, NEX, NEXI, NHI, NLTX, NMTR, NSSC, NVRO, NVTA, NWPX, OCN, OCUL, OMER, ONVO, OR, OSH, OUST, PBT, PGEN, PLUG, PMD, PME, PNTG, PRA, PRAA, PRI, PRIM, PROG, PRTK, PRVA, PSEC, PSTL, PYPL, RBLX, RBOT, RCEL, RCMT, RCUS, RDI, RDNT, RDUS, REAL, REKR, RETA, RIOT, RMTI, ROVR, RUBY, SACH, SANM, SAVA, SCOR, SDC, SESN, SIBN, SMTS, SNCR, SNDX, SPCE, SQSP, SRRK, SWAV, TALK, TCDA, TCMD, TDUP, TG, TGLS, THS, TME, TNXP, TPIC, TPST, TREX, TRIP, TRVN, TSEM, TTD, TWO, TYME, UEPS, USFD, UUU, VAC, VBIV, VGR, VOR, VRCA, VSTM, VTRS, VUZI, WOW, WPRT, XBIT, XNCR, XPER, XPRO, YALA, ZEST, ZIOP, ZIXI, ZNGA, ZNTL, ZYNE\n\n - Ex-div:\n\n  AROC, ASIX, BLX, BY, CG, CINR, CSV, DCF, EDF, EDI, GGB, GHM, HBI, HMST, HTBK, INVH, KMT, LGI, LSBK, LSTR, MAC, MET, NBN, PZZA, RILY, RNDB, TEX, WBK, WBS, WCN\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.050%)\n    - 3-Year Note Auction (previous: 0.635%)\n    - 6-Month Bill Auction (previous: 0.065%)\n    - CB Employment Trends Index (previous: 110.35)\n    - Loan Officer Survey\n\n^^^^2021-11-05",
        "created_utc": 1636106411,
        "id": "hjeamfa",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636135211.0
    },
    {
        "author": "Illustrious_Truth_34",
        "body": "amd going sideways ... its working on the deal with Xilinx by end of year... i would hop in before then",
        "created_utc": 1636129182,
        "id": "hjfk496",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636157982.0
    },
    {
        "author": "Pas7alavista",
        "body": "If you're bullish on amd in the long term there is opportunity to arbitrage some shares by playing the merger with xlnx.",
        "created_utc": 1636315506,
        "id": "hjprpe2",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636344306.0
    },
    {
        "author": "Past_Syrup",
        "body": "I want to retire early. Not gonna wait till 67. \n\nSo retirement/5years lcid. \n\nAnd short term xilinx/amd",
        "created_utc": 1636206563,
        "id": "hjjtch7",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636235363.0
    },
    {
        "author": "dysenterygary69",
        "body": "Buy XLNX stock",
        "created_utc": 1636664471,
        "id": "hk8zy07",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636693271.0
    },
    {
        "author": "xflashbackxbrd",
        "body": "The question is, will xlnx go up or amd go down or both?",
        "created_utc": 1636921086,
        "id": "hkmpss0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1636949886.0
    },
    {
        "author": "Anaveratia",
        "body": "That XLNX play looking real nice, I hold more AMD myself but been adding in every XLNX dip",
        "created_utc": 1637142820,
        "id": "hkyy8fr",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1637171620.0
    },
    {
        "author": "asicman78",
        "body": "Sell my Xlnx calls, then go get an 🎱 and a hooker",
        "created_utc": 1636945585,
        "id": "hkoao03",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636974385.0
    },
    {
        "author": "zg44",
        "body": "Yeah the XLNX options will convert into AMD options at that ratio.\n\nSo like if AMD is $125, XLNX conversion value would be $215. \n\nSafest way will likely be to just buy some slightly OTM XLNX options.\n\nXLNX would go to $205-210 immediately after China grants clearance.\n\nObviously that's biggest risk which is a wild card.",
        "created_utc": 1635783062,
        "id": "hiwc0y4",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635811862.0
    },
    {
        "author": "xtahua_42",
        "body": "All in XLNX Jan 200c",
        "created_utc": 1635799790,
        "id": "hixgr04",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635828590.0
    },
    {
        "author": "niloc99",
        "body": "Just get xlnx lower IV and undervalued compared to the deal",
        "created_utc": 1636059550,
        "id": "hjbyjhu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636088350.0
    },
    {
        "author": "rsoni1997",
        "body": "I don't know about you, but I'd buy it right now. It seems as if even if Xilinx goes up, so is AMD. Either way, you are getting a good deal.",
        "created_utc": 1636043470,
        "id": "hjatd5g",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636072270.0
    },
    {
        "author": "savinger",
        "body": "If AMD acquisition of XLNX went through today, there's a 25% upside on XLNX.",
        "created_utc": 1636401868,
        "id": "hjuf0ea",
        "score": 1,
        "subreddit": "investing",
        "created": 1636430668.0
    },
    {
        "author": "noiserr",
        "body": "I think AMD (particularly if the Xilinx merger goes through) has a larger upside or TAM.\n\n- AMD showed MI250 today which is faster than Nvidia's best (A100), in some workloads by a factor of x1.49, and in ML it was faster by x1.2.\n\n- AMD showed today Milan X, which considerably extends AMD's server CPU lead to everyone else (Intel and ARM) even further.\n\n- Training has diminishing returns (Nvidia's market). Semi analysts predict that the edge will be a larger market. Basically there will be more inference than training. Xilinx FPGA are really strong at inference.\n\nAMD having the ability to deliver to a customer: the fastest server CPU, fastest server GPU and the best edge inference solution in form of the best FPGA's on the market. Puts AMD on a direct collision course with Nvidia. And my money is on Lisa Su.",
        "created_utc": 1636404256,
        "id": "hjukwvh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636433056.0
    },
    {
        "author": "Pas7alavista",
        "body": "Dw man I totally stole that dd from seeking alpha, but I've been loading up since the price ratio is lower than the conversion rate. The only thing to be aware of is that xlnx is a Chinese company so people are worried that the deal could get swatted at the last minute but I think it's a low chance.",
        "created_utc": 1636340691,
        "id": "hjrda6h",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636369491.0
    },
    {
        "author": "diamondlips69",
        "body": "Xlnx a buy here?",
        "created_utc": 1636395673,
        "id": "hjtzkbb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636424473.0
    },
    {
        "author": "FloridaReallyIsAwful",
        "body": "Really late to the game, but\nXLNX $250 Jan 2022 c",
        "created_utc": 1636232657,
        "id": "hjlh735",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636261457.0
    },
    {
        "author": "Cilantbro",
        "body": "&gt; And what use case are we seeing for these besides Shors algorithm? A probabilistic computer is not good for almost all the problems we have to solve today, so beyond needing one to help with your cryptography, what is the use case for the market? \n\nI've yet to understand why shor's algorithm even gets mentioned - Seemingly only around hype articles and investing spaces. I'm guessing because it's easy for the layman to understand the nature of the result: \"you get a prime factors and someone told me they're important to encryption\" that's *technically* true for one nature of encryption but absolutely false for symmetric encryption like AES-256. Now we do have Grover's algorithm which reduces the solve space of AES-256 to AES-64 but that's arguably marginal gain because of a dirty \"secret\". Quantum computers don't run as fast as classical computers, there isn't as many processing cycles per second on even the best machines so when you see only quadratic gains in solve time, forget it. It's exponential or bust because of this slow down that you have to overcome.\n\nPhysicists like me want them for simulating quantum physics. I know, pretty meta, but that's our motivation and frankly everything else is just frosting. You need 2^N bits on a classical computer or N qbits, the choice is easy. I believe a lot of \"killer apps\" could simply be built in this benefit of 2^N unitary matrix multiplication resulting in 2^N exponential speed up and 2^N state space.\n\nThe \"probablistic\" nature of these algorithms is already accounted for in the solve time. Circuits are developed so that \"incorrect\" solutions are attributed with both positive and negative probabilities so while your state space is 2^N, your output is completely deterministic and repeatable.\n\nMore tangibly I'd point out computational chemistry which leads into biology and pharmaceuticals.\n\nYou will be able to simulate high-temperature superconductors; the active sites of enzymes containing metal complexes or radicals, photovoltaic materials and inorganic catalyst behavior. Anything that needs precise modeling of electron orbitals is impossible to do classically. Projects like folding@home are monuments to how bad classical computers are at computational chemistry. It's tough to simulate anything without assumptions and simplifications that interfere with your results on a classic machine.\n\nOne example is how the transcription of genetic information encoded in DNA is regulated by histone proteins which exist in a regime where the Born-Oppenheimer approximation breaks down. This forces you to calculate for every electron spin state in the system. Just the Fe ion has 151 electrons and 121 spatial orbitals and that's only one of nine catalytic steps to understanding gene switching. Enter quantum computers\n\nAnother example is how telomerase replenishment is significant to our understanding of stem cell maintenance, aging, and cancer treatment. Quantum computing would have advantage in simulating the catalytic active centers and preserve fidelity during the extension process. This is because the process relies on nucleobase pairing.\n\n \n&gt; noise problem\n\nAs for your purported \"noise problem\" I genuinely don't know what you're talking about. The world record for two gate fidelities, state prep, measurement and entanglement are all beyond acceptable for commercial use today, if someone used noise as an excuse... they used it as a buzz word to wave away impatient investors. The papers that have come out for QEC on logical qbits proves as much. It's getting increasingly frustrating watching companies flail in the space and spread disingenuous quantum hype and quantum excuses to pump their stocks up and while I'm not going to name names, they're everywhere and I hope they're self evident to the critical eye. Look for the humble, steady releases on arxiv.org not the \"we just made a computer 10 million times faster at everything but you can't independently benchmark it yet\" articles.\n\nIt's not the next Fitbit or iPhone, that's for sure but computing is shaping the future and specialized compute units have consistently been the answer. Look how Important companies like Intel, AMD and Nvidia are and they spend a lot of time just making specialized graphics cards, Xilinx just makes FPGA's and Bitfury, ASICS.\n\nWe're rapidly seeing cloud accessible commercial systems that are being leveraged by multiple industries to calculate the solutions to everyday problems. I would bet the first \"wow\"problem  will be chemistry based but it could be natural language processing, logistics, cryptology, or something unexpected. This isn't a video game, these research problems aren't time fungible so I can't possibly know which one will break through first.\n\nI guess my thesis would be, \"don't bet against this technology evolving and improving exponentially\"",
        "created_utc": 1637080607,
        "id": "hkvclmm",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637109407.0
    },
    {
        "author": "chromevfx",
        "body": "they're moving over to amd and xlnx come join the party",
        "created_utc": 1636968351,
        "id": "hkp9sfr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636997151.0
    },
    {
        "author": "GO00Ofy",
        "body": "I’m interested in your XLNX play. I’ve read up on it and I want to invest in shares and options too, but I’m a bit unsure about which options to get.\n\nI’ve read the merger is now expected to happen at the end of this year. How will that work if you have options with a further expiration, like you do? Are you just expected to keep tabs on the merger news and sell before the shares get converted into AMD? Will there even be any indicators for the merger beforehand?\n\nI’m not very familiar with this type of play and to me it seems like the options could just become worthless when the merger’s completed. Hope to hear your thoughts on this.",
        "created_utc": 1637151315,
        "id": "hkz9axs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637180115.0
    },
    {
        "author": "isellamdcalls",
        "body": "30k. i started trading with 40k last november. i bought my mother's second house in august, and she gave me the equity to trade with, which brought me to 120. had i been trading with the 120 the whole year, it would have been much higher CC returns. \n\nim waiting for the xilinx merger due by december 8th. i expect we jump to 170, then i start selling atm weeklies again for 8k a week",
        "created_utc": 1637165439,
        "id": "hl02toq",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637194239.0
    },
    {
        "author": "raris_rovers",
        "body": "I'd never sell AMD/XLNX &lt;3",
        "created_utc": 1637141088,
        "id": "hkyw7x9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1637169888.0
    },
    {
        "author": "CamSlam2902",
        "body": "Xilinx tearing it up aswell holding both",
        "created_utc": 1635985614,
        "id": "hj8002d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636014414.0
    },
    {
        "author": "LiqCourage",
        "body": "I think they are trading off different scenarios right now, even though both are near ATH.  AMD is trading on taking share from INTC plus I think people are starting to treat the XLNX acquisition as accretive.  Yes they do have a graphics business but it wasn't an earnings driver in the recent earnings call.  NVDA I think is riding a bigger tail wind from crypto, and IMO is more priced to perfection (disclosure they are above my sell target price), but they have done a good job with software offerings that are quite profitable too.\n\nAll the analysis from Fidelity etc say INTC is undervalued and a buy while they say stay away from AMD.  I think they have it wrong on AMD and INTC but that's what you get from sell side analysts whose job is frequently to pander for investment banking opportunities.",
        "created_utc": 1635956590,
        "id": "hj5ywcm",
        "score": 1,
        "subreddit": "investing",
        "created": 1635985390.0
    },
    {
        "author": "qazwer001",
        "body": "Personally I'm hoping amd slides down a bit further. Got a bunch of cash waiting for a decent entry to XLNX for merger",
        "created_utc": 1635776160,
        "id": "hivwlf7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635804960.0
    },
    {
        "author": "Wiscoman",
        "body": "Are you planning on holding through XLNX approval announcement and close of acquisition?",
        "created_utc": 1636070836,
        "id": "hjcpn8b",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636099636.0
    },
    {
        "author": "isellamdcalls",
        "body": "amd and xilinx",
        "created_utc": 1636132511,
        "id": "hjfss9d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636161311.0
    },
    {
        "author": "FloridaReallyIsAwful",
        "body": "What’s the Sharpe ratio of YOLO bets on AMD and XLNX!?!?",
        "created_utc": 1636114107,
        "id": "hjelker",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636142907.0
    },
    {
        "author": "Away_Needleworker655",
        "body": "I do actually have some xlnx for some good gains too, but I’m a little wary on the merger, Lisa said she’s hoping to close by eoy. It’s getting close I am hoping they at least have some news for the event on the 8th, if not I’ll probably sell and put it all in amd. Well see time will tell.",
        "created_utc": 1636080737,
        "id": "hjdbjwy",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1636109537.0
    },
    {
        "author": "king-bollie",
        "body": "Nope amd ab to be a disappointment until next earnings season or xlnx merger",
        "created_utc": 1636321975,
        "id": "hjq80nl",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636350775.0
    },
    {
        "author": "DragonInPajama",
        "body": "arbitrageurs selling it in overdrive to buy the xlnx dip",
        "created_utc": 1636396699,
        "id": "hju24nd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636425499.0
    },
    {
        "author": "zg44",
        "body": "Wait a few days.  If AMD spikes then retraces, there should be a better buying opportunity.  Saw that happen in September the last time the merger arbs got blown up.  Both sold off after the spike.  Then XLNX outperformed AMD.\n\nI might buy Jan ITM calls on XLNX if that happens.",
        "created_utc": 1636396264,
        "id": "hju117m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636425064.0
    },
    {
        "author": "alchemythical",
        "body": "Nice thinking! Now if only I could set a sell limit with a formula. If XLNX &gt; AMD \\* 1.7 then sell XLNX.",
        "created_utc": 1636396088,
        "id": "hju0l8v",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636424888.0
    },
    {
        "author": "kirlandwater",
        "body": "The real play is buying XLNX for the 1.7234 shares if AMD at the end of the year. The spread is insane right now thanks to AMD flying up the last couple days.",
        "created_utc": 1636414121,
        "id": "hjv8y5h",
        "score": 1,
        "subreddit": "stocks",
        "created": 1636442921.0
    }
]