[
    {
        "author": "Trevdo",
        "body": "I did the same thing. I started investing in 2016 going all Canadian cannabis (ACB, WEED, APH). In 2019 I pulled out 85% of my Cannabis and threw it into XEQT. The remaining 15% I held, and well, I think you guys can figure out what happened there. For people that have a fairly small portfolio (let’s say 10-20-% of yearly earnings) I would go 50% XEQT and 50% individual stocks. If you think you can really beat XEQT, try your best, but 8/10 times, you won’t.",
        "created_utc": 1629041775,
        "id": "h91hofi",
        "permalink": "/r/CanadianInvestor/comments/p4ke9h/what_should_i_get_rid_off/h91hofi/",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1629070575.0
    },
    {
        "author": "CannaVestments",
        "body": "Fair enough- good points. I'd point out a few things though:\n\n1) Market share for the top LPs (canopy, Aph, acb, Tilray) has been on a multi-year downward trend as Canada continues to license new operators and small players continue to take share. Not saying that continues forever but going to be a challenge. The legacy Aphria business had more cannabis revenue 1 year ago in Q4 2020 than this most recent report for example when the market expanded significantly in that time. Buying their way to $1B seems more likely \n\n2) 25% of all of Europe where there are hundreds of different players seems like a long shot. No doubt in a good position but 1/4 of the entire market is asking a lot. There are quite a few scaled, private companies targeting the export market to Europe \n\n3) All good \n\n4) I don't think it'll be any of the largest players. Cura and GTI are already larger by market cap and Trul/verano/cresco will continue to catch up. My point is mainly that they are essentially buying their way to $4B with this approach, meaning shareholders are getting diluted to fund it. It's not quite the same as organic growth that actually raises the share price \n\nPlausible sure, but unlikely imo. Would need to execute close to perfect at every aspect across the board",
        "created_utc": 1628177380,
        "id": "h7tgynj",
        "permalink": "/r/weedstocks/comments/oxxkq2/irwin_simon_maps_out_path_to_tilrays_potential_4/h7tgynj/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1628206180.0
    },
    {
        "author": "NextTrillion",
        "body": "I remember that well. I wanted to get in, but the SP ran on me. I thought it would go lower. But I vowed to learn from that, and that def. helped me really average down on APH during the short report. I’ve since come to really appreciate these bears.",
        "created_utc": 1629496882,
        "id": "h9ptkwd",
        "permalink": "/r/weedstocks/comments/p8cqou/after_hours_discussion_thread_august_20_2021/h9ptkwd/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1629525682.0
    },
    {
        "author": "wet_tree",
        "body": "It’s kind of a double edge sword. When they merged with tlry they became a traders favorite. \n\nIn that same vein a lot of them might not be “conviction” holders and therefore not voting. \n\nI have to say that the mmen optics and the names attached that call back to dark days for $aph could also be a tough sell. \n\nExciting times.",
        "created_utc": 1629482862,
        "id": "h9ovyyn",
        "permalink": "/r/weedstocks/comments/p825ww/daily_discussion_thread_august_20_2021/h9ovyyn/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1629511662.0
    },
    {
        "author": "skinniks",
        "body": "Look at how Aph and Tilray deal was structured.  It's not as simplistic as buying out Trul.  You buy off the insiders and give everyone else proportionate ownership in the combined entity.  I'm not sure about other MSO's but I feel pretty strongly that the end game for Kim and friends is to cash out.  They feel like the company most likely to pull a MedReleaf.",
        "created_utc": 1629309069,
        "id": "h9fm8gl",
        "permalink": "/r/weedstocks/comments/p6o3xm/daily_discussion_thread_august_18_2021/h9fm8gl/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1629337869.0
    },
    {
        "author": "Shotgun516",
        "body": "Doesn’t cannabis stocks always fall after earnings come out? The only time is maybe APH for a quarter or two but this has been the trend for years",
        "created_utc": 1628603960,
        "id": "h8esqoe",
        "permalink": "/r/weedstocks/comments/p1m59b/daily_discussion_thread_august_10_2021/h8esqoe/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1628632760.0
    },
    {
        "author": "123_holden",
        "body": "Aph and Tilray is a different animal since both companies are legal\n\nYou would either have to wait for legalization or buy options for TRUL(like CGC aand acreage)\n\nBut TRUL has no money issues nor are they desparate\n\nThey are buying MSOs - it serves no purpose from TRUL's prespective",
        "created_utc": 1629309626,
        "id": "h9fnhkw",
        "permalink": "/r/weedstocks/comments/p6o3xm/daily_discussion_thread_august_18_2021/h9fnhkw/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1629338426.0
    },
    {
        "author": "skinniks",
        "body": "For everyone talking about how Aphria shareholders have been screwed WHAT THE FUCK ARE YOU TALKING ABOUT?\n\nAug 17 2020 share price:  $6.04\n\nThe merger was announced Dec 21st (-ish as I'm going by memory). Share price at that time: $9.24\n\nAnd then we hit all fucking time highs in Feb.  Does anyone not remember the bitching in 2019 and most of 2020 about how Aph will take YEARS AND FUCKING YEARS to break $10?\n\nGo cry me a fucking river.\n\n(that wasn't meant to be aggressive against you /u/wet_tree just sick of this narrative)",
        "created_utc": 1629209609,
        "id": "h9aj47k",
        "permalink": "/r/weedstocks/comments/p60qpj/daily_discussion_thread_august_17_2021/h9aj47k/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1629238409.0
    },
    {
        "author": "CannaVestments",
        "body": "Not sure how they get there based on his projections:\n\n1) $1B from the Canadian cannabis market- ~$53.7M in total cannabis sales last Q (included 1 month of Tilray so call it $75M) which includes some international revenue. So roughly a $250-300M annual run-rate meaning they need to 3-4x by 2024 in a very competitive Canadian market. Not impossible but quite a high bar. \n\n2) $1B out of Europe- I assume this includes the distribution business cause international cannabis revenue is fairly small at this point ($$20M/q of so). $66M in dist revenue this past quarter so again a $250M annual run-rate roughly on that. The distribution business is not a growing one so I assume they see most growth coming from the actual cannabis side then. For that, all of Europe is projected at a $3.5-3.8B in 2025 (so maybe closer to $3B for 2024) so that means Aph thinks will need to control ~25% of the entire European market to reach their numbers - very unlikely imo given there are no entry barriers on who can export to Europe. \n\n3) Expansion in alcohol/hemp seems somewhat reasonable. \n\n4) Buying an MSO with $1.5B in 2024 revenue. Again not impossible, but there will be just a handful of companies that size and they will obviously need to dilute significantly to pay for it. Maybe Columbia Care?     \n\nSo overall feels pumpy given they will essentially have to acquire/dilute like crazy to remotely approach that $4B number. I'd wager on the under",
        "created_utc": 1628118873,
        "id": "h7qlk0h",
        "permalink": "/r/weedstocks/comments/oxxkq2/irwin_simon_maps_out_path_to_tilrays_potential_4/h7qlk0h/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1628147673.0
    },
    {
        "author": "bananastock",
        "body": "Love the lack of comments here. Volume is almost as low as it will go IMO.\n\nHEXO deal with redecan closed. is their deal with 48 north done too?\nCEO said they have a food partner in the USA, a fortune 200 company who they haven't disclosed yet. I'm curious to see who it is.\n\nAlso, if y'all we'rent paying attention, the mounting speculation of the 100M investor in Aphria is probably Michael Serruya given his 100M investment in MedMen and simultaneous deal with Tilray. He was also involved as an investor in LHS which Ayr now owns and was an early investor in APH when Vic was ceo....during the short attack.\n\nCrazy world we live in. Enjoy the ride, Folkes.",
        "created_utc": 1630359107,
        "id": "haz9un6",
        "permalink": "/r/weedstocks/comments/pepvpp/after_hours_discussion_thread_august_30_2021/haz9un6/",
        "score": 1,
        "subreddit": "weedstocks",
        "created": 1630387907.0
    }
]