[
    {
        "author": "theJimmybob",
        "body": "Some implies moves for earnings next week:\n\n&amp;#x200B;\n\n$ROKU 9.1%  \n$PTON 9.7%  \n$SQ 6.8%  \n$ABNB 7.3%  \n$PINS 10.7%  \n$UBER 8.1%  \n$COIN 11.2%  \n$DKNG 7.6%  \n$PENN 7.0%  \n$MRNA 7.9%  \n$W 10.2%  \n$NET 11.5%  \n$MELI 7.8%  \n$FSLR 7.1%  \n$DBX 6.5%  \n$FTNT 8.3%  \n$DDOG 9.2%  \n$EXPE 8.2%  \n$RDFN 13.1%  \n$SHAK 9.0%  \n$ILMN 6.5%  \n$OLED 9.1%  \n$YELP 10.7%  \n$JYNT 13.6%  \n$UAA 9.9%  \n$RACE 5.1%  \n$CRSR 10.4%  \n$GRPN 16.7%  \n$AMC 11.6%  \n$APPS 12.1%  \n$ATVI 5.7%  \n$ZG 11.4%  \n$LYFT 8.2%  \n$REGN 4.7%  \n$LITE 7.1%  \n$PZZA 5.9%  \n$PLNT 7.8%  \n$K 4.5%  \n$LSPD 14.0%  \n$CARS 11.9%  \n$DOCN 13.1%  \n$VRTX 6.5%  \n$AYX 13.4%  \n$SEDG 12.0%  \n$MTCH 7.6%  \n$XPO 8.7%  \n$AMGN 3.3%  \n$MDLZ 2.7%  \n$PAYC 8.2%  \n$AKAM 6.1%  \n$EXAS 7.5%  \n$CVS 4.2%  \n$WING 9.0%  \n$MAR 4.6%  \n$NCLH 5.8%  \n$EXPI 16.3%  \n$LL 9.6%  \n$SMG 7.3%  \n$CPRI 9.8%  \n$TUP 14.8%  \n$QCOM 5.3%  \n$FSLY 13.7%  \n$SKLZ 14.0%  \n$TTWO 6.3%  \n$MGNI 16.3%  \n$EA 5.6%  \n$MGM 5.8%  \n$CAKE 10.0%  \n$QRVO 7.3%  \n$BKNG 5.0%  \n$HUBS 9.7%  \n$GDDY 8.3%  \n$CF 5.1%  \n$CGC 11.7%  \n$GOOS 9.0%  \n$JCI 3.9%  \n$NKLA 14.2%",
        "created_utc": 1635600117,
        "id": "hin1yci",
        "score": 124,
        "subreddit": "wallstreetbets",
        "created": 1635628917.0
    },
    {
        "author": "shortyafter",
        "body": "For me it's usually a warning sign when I see a stock going up and up like that.  Even so, if the fundamentals are there, it may still be a good time to hop on the train.  So the next thing I look at is the P/E ratio.  FTNT currently has a P/E ratio of over 100.  For comparison, the S+P 500 is at about 28 right now, with a historical mean of about 16.\n\nI don't know anything about the company, but a quick Google search says that they're in cybersecurity.  I guess investors are betting on them being important in the near future due to all the ransomware attacks, etc., therefore they're willing to pay an extremely high multiple for future earnings.\n\nMe personally, I don't buy stocks like that.  It's speculating.  Yeah, if the growth story pans out, better to get in now than later.  But if it doesn't, you're left holding a very big bag.  Every now and then you might get an Amazon for $250 even when people like me are saying it's overvalued.  But do you think all the companies trading at this valuation are going to end up being the next Amazon?  Probably not, so it's basically gambling.\n\nI prefer to invest in companies with a valuation that is reasonably justified in the present, while still taking into account *reasonable* expectations for growth based on historical numbers and trends.  It's a winning strategy that doesn't rely on the rosiest of assumptions in order to pan out.",
        "created_utc": 1634557206,
        "id": "hh3ii31",
        "score": 6,
        "subreddit": "stocks",
        "created": 1634586006.0
    },
    {
        "author": "Dr_ako",
        "body": "Clean Water - there will be a crisis in around 5 years and I am getting in early. Particularly in relation to small cap growth water companies which will get bought up by the majors.\n\nI also like Cyber Security. Fortinet.\n\nFor dividends I like Electronic Market Makers. Particularly in markets like 2020.\n\nFinally I like Industrial and Warehouse REITS - particularly around ports and airports. They are crushing it due to problems in the supply chain and the need to re-shore high tech manufacturing.",
        "created_utc": 1634150107,
        "id": "hgijxqh",
        "score": 6,
        "subreddit": "investing",
        "created": 1634178907.0
    },
    {
        "author": "compoundluck",
        "body": "Was around 55 March 20. 280 currently. 5x but nothing to complain about. FTNT was at 100 in March 20 now 330. NET 23 to 190. ZS 60 to 310. \n\nWhich is sort of my point: Although all up a ton, NET up TEN fold while others 3-5x. Why? Bc TEN and NET are anagrams?!",
        "created_utc": 1635197516,
        "id": "hi1bxhu",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635226316.0
    },
    {
        "author": "postblitz",
        "body": "&gt; Do you see all or most cybersecurity stocks as overvalued (Crowd, FTNt, PANW etc..)?\n\nAbsolutely. Garbage companies.",
        "created_utc": 1634636736,
        "id": "hh7qdzm",
        "score": 4,
        "subreddit": "stocks",
        "created": 1634665536.0
    },
    {
        "author": "Due-Tip-4022",
        "body": "Would it be considered market manipulation or insider trading if I were to publish my stock moves in real time? Doesn't matter what I do, shit goes the opposite direction almost immediately. I'm why FTNT stopped doing that thing where it always goes up. I'm why Amazon tanked a month ago. Same with ELY and so many more. Even Boomer stocks aren't safe. I'm why JNJ has gone down since Aug and PG since mid Sept. If I touch it, it's going south. I literally cause the peak to reverse in anything I touch. Guaranteed. I used to be very good at SPY, but now even that has inverse.  \n\n\nI feel like I have a duty to use these powers for good. It's too late for me, but you can benefit. I figure, if I start a website publishing my moves in real time, people would pay to subscribe and do the opposite. You literally can't go tits up if you do the opposite of me. But I can only assume such a sure thing would get me in hot water with the SEC.",
        "created_utc": 1633108971,
        "id": "hezx7y2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633137771.0
    },
    {
        "author": "MovieMuscle25",
        "body": "Is there any real reason why CRWD is better than FTNT?",
        "created_utc": 1633722095,
        "id": "hfw4zxp",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633750895.0
    },
    {
        "author": "sirf_trivedi",
        "body": "Buy an ETF. BUG, HACK, CIBR. \n\nIndividual picks for me: CRWD, PANW, FTNT",
        "created_utc": 1635296482,
        "id": "hi6u2iz",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635325282.0
    },
    {
        "author": "us3rnamecheck5out",
        "body": "Any thoughts on why FTNT has gone down the last couple days?",
        "created_utc": 1635354490,
        "id": "hi9p50f",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635383290.0
    },
    {
        "author": "pauledowa",
        "body": "On a stock like this one: [https://finviz.com/quote.ashx?t=FTNT&amp;ty=c&amp;ta=0&amp;p=m](https://finviz.com/quote.ashx?t=FTNT&amp;ty=c&amp;ta=0&amp;p=m)\n\nwhere it's been going up for a straight year... what do you guys usually think?   \nHad I looked four months ago it would have been all green as well. So just because it's all green, should I stay away from it?  \n\n\nJust a general question...",
        "created_utc": 1634550189,
        "id": "hh39jrm",
        "score": 3,
        "subreddit": "stocks",
        "created": 1634578989.0
    },
    {
        "author": "The_SHUN",
        "body": "Yup, if I have not bought more VTI, Microsoft and fortinet I wouldn't due to fear of crashing i would've missed out on some gains",
        "created_utc": 1634694655,
        "id": "hhb790g",
        "score": 3,
        "subreddit": "investing",
        "created": 1634723455.0
    },
    {
        "author": "Terrible_Toe",
        "body": "Well from a stock market POV PANW is kicking ass regardless of their security issues. Check Point has the best security and threat prevention capabilities. This is not just me saying that this is NSS labs, Gartner, MITRE reports saying that. Fortinet is the best for SMB gateways and SD-WAN. Palo is somewhere in the middle but they have great perception from customers. CRWD is good for EDR especially since ransomware is hot right now, but they also have some vulnerabilities and can be bypassed. If we're talking pure security I like check point for gateways and public/ private cloud northsouth &amp; eastwest. I like Zscaler for remote access and secure internet browsing. I like Okta for IDAM. I like Radware &amp; Akami for ddos. I just want to clarify I speak from a security first point of view, not from a stock price point of view. my final note is don't invest in Cisco for security they are complete dog ass without HTTPS inspection and their ASA's + firepower suck.",
        "created_utc": 1634673452,
        "id": "hh9vheh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634702252.0
    },
    {
        "author": "BurnerBurnerBurns20",
        "body": "So at what level do you think most cybersecurity stocks should be at? Because I think the sector in general is not necessarily overvalued at all given how reliant we all will become on cybersecurity in the future. \n\nDo you see all or most cybersecurity stocks as overvalued (Crowd, FTNt, PANW etc..)?",
        "created_utc": 1634616952,
        "id": "hh72acg",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634645752.0
    },
    {
        "author": "us3rnamecheck5out",
        "body": "Anybody knows what the fuk is happening to FTNT?",
        "created_utc": 1635255658,
        "id": "hi42wxq",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635284458.0
    },
    {
        "author": "MovieMuscle25",
        "body": "Shit, I confused my sectors. CRWD and even PANW have been mentioned more than FTNT on here.",
        "created_utc": 1633467934,
        "id": "hfiyqpw",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633496734.0
    },
    {
        "author": "googlme",
        "body": "you can't go wrong with ftnt &amp; panw. these 2 vendors will eat more and more market share due to the shift from best of breed to platform approaches. more and more consolidation will happen at that front. They both are eating market share from chkp and cisco for years now and I don't see any other company taking the nr1 and nr2 spot from them. \n\nWill other cybersecurity companies outperform them? yes for sure there are some unicorns out there but these 2 are like the FAANG of cybersec.",
        "created_utc": 1634034845,
        "id": "hgc7e0x",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634063645.0
    },
    {
        "author": "VisualMod",
        "body": "&gt; The company sells networking equipment for telecom and datacom applications. FTNT is a holding of the First Trust Cloud Computing ETF (SKYY). SKYY has been in a downtrend since late February 2018, as shown below:",
        "created_utc": 1635255672,
        "id": "hi42y2c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635284472.0
    },
    {
        "author": "jrmtz85",
        "body": "I seem to have good picks, but just bad sell-timing. Bought FTNT in 2019 for 83. Sold in 2020 for $145. Bought frickin Tesla in 2013 for $156, sold in 2018 for $350. Bought Amazon in 2013 for $267, sold in 2014 for $342. Bought Broadcom in 2017 for $172, sold in 2020 for $321. Bought Dominos in 2014 for $$79, sold in 2018 for $200. So, obviously had good gains and profits and can't complain, but goddamn it, everything explodes after I sell...\n\nI bought NET on IPO day for $18, and they will pry it from my cold, dead hands!",
        "created_utc": 1635437749,
        "id": "hiease5",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635466549.0
    },
    {
        "author": "95Daphne",
        "body": "I actually looked at it earlier in the year and then blew it off for some reason.\n\nI found it because I was looking in the BUL ETF, which I think is a pretty good ETF for ideas as it's a cash cow growth ETF, but then I haven't listened to my own advice.\n\nNET wasn't a bad idea last year but I wouldn't touch it now, frankly I wouldn't touch FTNT either...in the case of TMO (which is in that ETF and I also thought about it), I might end up getting in after all.",
        "created_utc": 1633467060,
        "id": "hfiwpln",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633495860.0
    },
    {
        "author": "AlbertineVierra121",
        "body": "I looked at some of their products. For a cybersecurity its pretty cool what they're trying to do. Rather than create security from software application they want to build hardware from scratch with security like the CPU. With the growth they  had they have a chance to compete toe to toe with other's like Fortinet or Zscaler",
        "created_utc": 1634140204,
        "id": "hghv4gb",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1634169004.0
    },
    {
        "author": "Terrible_Toe",
        "body": "As someone who has worked with most security products and all of those vendors I'll give you some food for thought.  First off, all of these companies have very different businesses. only a few of them have overlapping products and I'll explain below. \n\nEDR- Endpoint detection and remediation, previously called End point protection (EPP) or antivirus (AV)\n\nCrowdstrike is focused purely on Managed Detection and remediation (MDR) and EDR solutions - Protecting endpoints IE. Laptops, phones, tablets etc.. Fortinet has their own EDR solution but it doesn't compare to crowd strike's.  Z scaler and Net do not offer an EDR solution by my knowledge and it's the reason that Zscaler has decided to integrate heavily with crowdstrike for EDR telemetry &amp; Illumio for micro segmentation &amp; workload protection. When using these products in unison you can produce an architecture which can follow a zero trust methodology. It will share intel between them (what we call telemetry data) for quicker remediation's, and actively defending your network instead of the products being separated into silos. \n\nIE. Crowdstrike finds a ransomware on one of your endpoints, Illumio can quarantine the device from the rest of your network, &amp; Zscaler can update it's signatures to prevent the transmission of this ransomware again. \n\nPause here - If you don't know what Zero Trust Security (ZTS). It is a methodology which says that protecting the perimeter of your network is no longer effective in reducing breaches / incidents. Ex. a castles moat is no longer good enough, instead lock each door and ask whether someone has permission to enter that room. In technological terms a Zero trust methodology should include continuous authentication, workload protection, &amp; micro segmentation.  A lot of companies say \"I sell Zero trust\" but in reality nobody sells ZTS, ZTS is a way to manage your network which some companies may sell a component of.\n\nFirewalls - on premise or in the cloud\n\nZscaler, Net, and Fortinet, all have cloud firewall offerings but not all of them do the same function / business.  to my knowledge Fortinet is the only firewall vendor ( out of these 3) who has the partnerships to spin up cloud based firewalls with AWS, Azure, Google Cloud, etc. Zscaler and Net have their own private clouds which they allow you to secure pass traffic through and middle your traffic securely. This can be great for a company with all mobile workers as you don't have to invest in your own firewall appliances to be getting enterprise grade protections. They have a per user per month model and they can protect you from internet access as well as give you a secure backdoor into your applications behind your private clouds. Fortinet has this functionality with hardware appliances but not the same model as Net / Zscaler. (I've never used a Net gateway so I can't speak to which is better between them and ZS, I've used ZS before I like it).\n\nFortinet has the best on prem firewalls out of all the companies above. They don't have the best on prem firewalls in the business, but they excel at Small and medium business (SMB) and their hardware is designed to support Software defined wide area networked (SD-WAN) architectures. I have seen these in action with a hub-n-spoke architecture and they worked well. \n\nDDOS- distributed denial of service \n\nCloudflare is the only company above to provide a DDOS solution. I don't think they are the best in the industry but they do a good job. A note on Cloudflare is that they are a diverse company with a lot of verticals. Some are security related otheres are services that I know little about. I don't think you are comparing apples to apples with any of these companies so understand where each has strengths and weaknesses.\n\nFinal thoughts-\n\nTo round out your portfolio you may want to look into companies that sell SIEMs IE. Splunk, darktrace, microsoft sentinal, IBM's Qradar. Okta is an Identity Access Manager provider (IDAM) and they are also a heavy player to the authentication component of ZTS.  You should also consider reading Mitre, gartner, and NSS labs reports to compare how customers feel about these products as well as their security scores. Being the best at security doesn't correlate to having the best stock price. Palo and Crowdstrike have the best mind space - yet some of the oldest vulnerabilities that are left unpatched. All of these companies will continue to grow due to industry trends and each of them have their own slice of the security pie. My 2 cents.",
        "created_utc": 1635207447,
        "id": "hi1y10a",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635236247.0
    },
    {
        "author": "Terrible_Toe",
        "body": "Zscaler is partnered with CRWD to enhance EDR's capabilities and their own capabilities. Zscaler has ZIA for protecting remote workers for internet access and ZPA for remote workers private access back into your DC's or public cloud applications. CRWD for EDR - Zscaler for cloud firewalling. Cloudflare has many products, a part of which is DDOS I don't know much of their business is DDOS. There are pureplay DDOS companies like Akami, Arbor, &amp; Radware. Fortinet, Check Point, and Palo alto are the top 3 appliance based firewall vendors IMO. Palo Alto has a product called prisma which competes directly with ZS and check Point has Harmony connect which competes with ZS.",
        "created_utc": 1635527117,
        "id": "hij9izm",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635555917.0
    },
    {
        "author": "Kekbar",
        "body": "Anyone have thoughts on cloudflare, datadog and fortinet? Mulling over going full retard on cyber security/deployment/analytics companies though dynatrace bucked me a bit",
        "created_utc": 1635638092,
        "id": "hiperpr",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635666892.0
    },
    {
        "author": "Daniwasabi",
        "body": "Spot, Fb, Ftnt, Baba also. Bntx earning nov 9. Pins...",
        "created_utc": 1634565991,
        "id": "hh3yfyw",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1634594791.0
    },
    {
        "author": "OldLace300",
        "body": "Biggest gain-FTNT.  Also, won on AMC as well with much smaller amount.\nBiggest lost-I think it was Six flags.  I thought dividend would be fine.  CEO bailed and dividend cut.  \nMy REITS tanked hard in March 2020 but I did nothing wrong investing wise…just held until they came back.",
        "created_utc": 1635054977,
        "id": "hhtyav0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635083777.0
    },
    {
        "author": "captainstrange94",
        "body": "I've been debating between FTNT, NET and CRWD. Which ones would you guys recommend, if I have to pick one for the long haul?",
        "created_utc": 1635201334,
        "id": "hi1kpcv",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635230134.0
    },
    {
        "author": "captainstrange94",
        "body": "So from what I am understanding; Cloudfare is a good play for DDOS, Fortinet is good for Firewalls and ZS/CRWD for EDR. Is that correct?",
        "created_utc": 1635526723,
        "id": "hij8ic4",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635555523.0
    },
    {
        "author": "sockalicious",
        "body": "Step 2:  Using comparators from other industries, while ignoring available data from representatives of the same industry such as Motorola, Texas Instruments, 3DFX, ATI, National Semiconductor, Rockwell Semi, TRW, VM Labs et cetera.",
        "created_utc": 1635142526,
        "id": "hhyg20t",
        "score": 42,
        "subreddit": "wallstreetbets",
        "created": 1635171326.0
    },
    {
        "author": "Summebride",
        "body": "Lots of line item beats here.  But the bigger story is more qualitative, in that other chip companies like Texas Instruments and Intel report woes and gloom from supply chain, yet AMD has been rolling along.",
        "created_utc": 1635284078,
        "id": "hi627ov",
        "score": 21,
        "subreddit": "stocks",
        "created": 1635312878.0
    },
    {
        "author": "nekomech",
        "body": "Literally any other semi.  It’s going to take INTC years to turn around.  CEO keeps pointing to the foundry that’s going to come in 2024 if there are zero delays and they execute well.\n\nAMD\nNVDA\nTXN\nMU\nTSM\nQCOM\nAMAT\n\nor just buy SOXX, or SOXL if you are feeling spicy.\n\nI will bet $100 that INTC underperforms both SOXX and QQQ in 2022.",
        "created_utc": 1635321459,
        "id": "hi80p74",
        "score": 9,
        "subreddit": "investing",
        "created": 1635350259.0
    },
    {
        "author": "bearhunter429",
        "body": "Texas Instruments market cap $183.78B.\n\nSelling calculators must be really profitable.",
        "created_utc": 1635273396,
        "id": "hi5asbv",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635302196.0
    },
    {
        "author": "bungholio99",
        "body": "If you can check Lenovo, record growth discounted cause china stock.\nVery innovative and in several markets (Motorola is also Lenovo today and Fujitsu) own manufacturing so has priority during chip crisis.\nGood investments and JV (NIO, NEC,Netapp)\nBiggest Cloud Server Provider for Microsoft and SAP.\n\nIf semi-conducteur Qualcomm they are leading in Smartphone,Tablet and get used in further appliances.\n\nBaba or AMS/Flex for the risky ones and AMD/Texas Instruments/TSMC/Apple as the safe bets.\n\nAlways watch the SOX when buying Semi Conducteur\n\nhttps://www.marketwatch.com/investing/index/sox",
        "created_utc": 1634983743,
        "id": "hhq73ry",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635012543.0
    },
    {
        "author": "StockTipsTips",
        "body": "Possibly Very Bullish Sectors for the Next 3-12 Months Amid Troubled Times. The examples below are certainly not buy recommendations. Just examples.\n\nBelow is a list of what I consider possible bullish sectors/industries in the next 3-12 months. We all know of the supply chain issues, the semiconductor shortages, worker shortages, &amp; inflation issues. As a result I'm considering these sectors/industries as possible bullish options in the next 3-12 Months. Please understand that I know that I did not get all stocks in each category. So if you're favored stock isn't listed, don't get angry, post it in the comments below. And if you feel I missed a sector, please let me know. \n\nAnyway enjoy the dips now because these are likely to get beefed up as the supply chain &amp; worker shortages unwind\n\n.\n\n**1)** **Inelastic &amp; Fairly inelastic Industries:** (*Meaning people usually pay for the good or service no matter what the price \"insensitive to changes in price or income\"*) \n\n* Pharmaceuticals (With highly used patented meds for diseases &amp; illnesses)\n* Oil/Gas/Natural Gas (No matter how scarce it gets, people will buy it)\n* Energy (Be careful, many producers of electricity are heavily regulated)\n\n**2) Agriculture/Farm Equipment/Fertilizers/Farm Chemicals:** People got to eat ... and have you seen the price of softs futures? This will incentivize farmers to produce more which in turn will require more farm equipment, farm construction, pesticides, herbicides, insecticides, seeds, chemicals etc. It does not help that food is rotting on the docks right now &amp; people are panic buying.\n\n* **Examples:** YTEN, TITN, NTR, SANW, DE, DOLE, ANDE, CLXT, ADM, CLXT, AGRO, AGCO, ADM, LMNR, TWI, ADM, BG, CALM, GRWG, HYFM, FMC, MEOH, \n\n**3) Semiconductors, Passive Semiconductors, &amp; Electronic Components:** Semiconductors are suffering due to worker shortages &amp; supply chain issues. However demand is seriously backed up. As soon as the supply chain situation gets straightened out expect semiconductors to explode.\n\n* **Examples:** NVDA, INTC, ARCB, AMKR, MU AMD, TXN, VSH, STM, ASYS, WOLF, TSM, QCOM, ON, ASML, NXP, AMAT, AVGO, LRCX, SWKS, MRVL, KLAC, MCHP, QRVO, SSNLF, DIOD\n\n**4) Shipping/Bulk Transportation/Freight/Transportation Services:** Shipping / Bulk Transportation / Freight / Transportation Services / are more in demand now than ever before in US history. In fact these services are in so much demand that they're clogging up the ports. And while ships sitting off the coast are likely loosing money as the supply chain issues worsen, you can bet they'll explode with business for pint up demand as the situation unwinds. \n\n* **Examples:** ZIM, JBHT, NSC, TNK, TGP, CNI, CMRE, REVG, DAC, SB, HTZZ, GRIN, ODFL, ASC, EDRY, XPO, SBLK, FWRD, BEST, CPLP, MATX, SAIA, INSW, GASS, PATI, PSHG, NETI, PXS, ULH, USDP, TFII, KNOP, KNX, CHRW, GLOP, EDRY, CVLG, PAC, HUBG, EDRY, MRTN, GLNG, NMM, HMLP, BEST, CPLP, DESP, HTLD, PWFL, GOGL, EGLE, SHIP, ZTO, LSTR, WERN, USAK, ESEA, GNK, CICOY, OROVY, PCFBY, CSX, DSX, MMLP,  PANL, KEX, NAT, UNP, WJRYY\n\n**5)** **Chemicals:** Agriculture chemicals, industrial chemicals, construction chemicals, drilling chemicals, textile chemicals, take your pick. The worlds manufacturers do not run without chemicals of some sort. And once supply chain issues are put behind us &amp; workers start to fill these empty job seats, you can bet that increased production will ramp up the demand for industrial chemicals. \n\n* **EXAMPLES:** HUN, OLN, DOW, LYB, EMN, GLTC, KRO, UNVR, CBT, MEOH, APD, OEC, VHI, ODC, TREC, TROX, IOSP, DD, KOP, ALB, LAC, PPG\n\n**6) Staffing Firms:** There's a massive worker shortage &amp; those positions will need to be filled. You can bet staffing firms are in high demand.\n\n* **EXAMPLES:** DLHC, CCRN, KFY, CBRE, HQI, RHI, WDAY, NSP, HSII, RGP, TBI, KFRC, \n\n**7) Inferior goods:** Ever notice how demand for some products go up when prices rise? These are generally inferior goods. Ramen Noodles &amp; Mac&amp;Cheese are a few examples. Dollar Stores are filled with inferior goods. \n\n* DG, DLTR, WMT, ROST, KHC",
        "created_utc": 1635443044,
        "id": "hieog2c",
        "score": 5,
        "subreddit": "investing",
        "created": 1635471844.0
    },
    {
        "author": "wsupduck",
        "body": "Texas Instruments",
        "created_utc": 1633375969,
        "id": "hfe1vls",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1633404769.0
    },
    {
        "author": "redbatman2",
        "body": "Texas Instruments is in a different market than the other semiconductor companies.",
        "created_utc": 1634857496,
        "id": "hhjvqn3",
        "score": 3,
        "subreddit": "stocks",
        "created": 1634886296.0
    },
    {
        "author": "azwel",
        "body": "Amazon Google  Facebook. Microsoft.Apple. Tesla. Home depot, Texas instruments, shopify...  Abbvie Altria and various dividend stocks..etc",
        "created_utc": 1633899188,
        "id": "hg5dcow",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633927988.0
    },
    {
        "author": "95Daphne",
        "body": "TSM actually happens to be its top holding.\n\nBesides NVDA/AMD, outside of the semiconductor equipment stocks, you have AVGO (holding of mine since last year) and TXN...besides them I'm not sure about anybody else.",
        "created_utc": 1635176542,
        "id": "hhzwas3",
        "score": 3,
        "subreddit": "investing",
        "created": 1635205342.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "Dropped $TXN from my watchlist 6 mos ago when it was trading at 190, just checked it - yup. Still 190",
        "created_utc": 1634220793,
        "id": "hgm33ym",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634249593.0
    },
    {
        "author": "ReThinkingForMyself",
        "body": "It's very interesting to read all of the different perspectives about the chip industry, good stuff. I took a less granular approach. Intel has been an iconic business for my entire adult lifetime and has survived many troubles. I'm not looking for a moon stock, just something that is likely to keep It's value for the next 20 years or so, grow modestly, and keep paying the dividend. Bleeding edge chips are not going to fuel growth forever. Soon we will reach the limits and needs of human perception, and performance/graphics improvements won't have as much value as in the past.\n\nThe covid and climate crises appear to predict a contraction in globalization  and a simplification of supply chains, which may benefit Intel in the near future. Its name recognition, market cap, low p/e, importance to American interests, and forward looking attitude all indicate a \"buy\" to me. I see Texas Instruments  taking advantage of the current situation as well.",
        "created_utc": 1633272718,
        "id": "hf8cdzj",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1633301518.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 26th of October\n\n\n\n## Upcoming events for Tuesday, October 26th\n\n - Expected earnings:\n\n  AAN, AAT, ABG, ACCO, ACH, ACU, ADM, AGR, AGYS, AHT, AKO.A, AKO.B, AKR, AMD, AMP, APAM, ARCC, ARCH, AUDC, AWI, AWRE, BEN, BGFV, BSBR, BUSE, BXP, BYD, CAC, CAJ, CB, CCB, CCBG, CCNE, CEQP, CHRW, CIT, CMRE, CNC, COF, CSGP, CVLT, CZOO, CZWI, DALN, DAN, DBVT, DHIL, DLR, EBMT, ECL, EDU, EGP, ENPH, ENTG, EQR, ESS, FBHS, FCBC, FCF, FCPT, FELE, FFIC, FFIV, FFNW, FFWM, FIBK, FRAF, FRBA, FRME, FSV, GBX, GE, GIC, GLW, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HFBL, HIW, HNP, HONE, HOOD, HPP, HRZN, HSBC, HT, HUBB, HZO, IBCP, IEX, INMD, IVZ, JBLU, JNPR, KAI, LBAI, LBC, LBRT, LFUS, LLY, LMT, MANH, MASI, MKL, MMM, MMYT, MSCI, MSFT, MTDR, MYOV, NAVI, NBR, NBTB, NCR, NETI, NOV, NVS, OMAB, OVBC, OXSQ, PCAR, PCB, PEBO, PERI, PFG, PHM, PII, PJT, PNR, PROV, QS, QURE, RARE, RCKY, RNDB, ROIC, RRC, RRD, RTX, SBSI, SEB, SFBC, SFNC, SFST, SHW, SPFI, SPGI, SSTK, ST, TECK, TENB, TER, TPB, TRMK, TRTN, TRU, TTM, TWOU, TWTR, TXN, UBCP, UBS, UDR, UMBF, UPS, USNA, UTMD, V, VBTX, VNE, WIRE, WM, WNEB, WRLD, WSBC, WSR, XRX, ZWS\n\n - Ex-div:\n\n  AM, ATR, CLX, CMC, DNUT, ENTG, INFY, PSEC\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.310%)\n    - API Weekly Crude Oil Stock (previous: 3.294M)\n    - CB Consumer Confidence (consensus: 108.3, previous: 109.3)\n    - Dallas Fed Services Revenues (previous: 14.5)\n    - House Price Index (previous: 1.4%)\n    - House Price Index (previous: 19.2%)\n    - House Price Index (previous: 348.4)\n    - New Home Sales (consensus: 760K, previous: 740K)\n    - New Home Sales (previous: 1.5%)\n    - Redbook (previous: 15.4%)\n    - Richmond Manufacturing Index (previous: -3)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -3)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 1.5%, previous: 1.5%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 20.0%, previous: 19.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.5%, previous: 1.5%)\n    - Texas Services Sector Outlook (previous: 8.3)\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFI, AFL, AGI, AINC, AIT, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, AROW, ARR, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CADE, CAMT, CASH, CBD, CBTX, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FBC, FCNCA, FDBC, FDP, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HVT, HVT.A, HWKN, IBA, ICLR, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MXL, MYRG, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PAYA, PB, PDM, PEGA, PGC, PGRE, PI, PINS, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.650M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.1%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -2.350M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.1%, previous: -2.0%)\n    - Gasoline Inventories (consensus: -1.850M, previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BCLI, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, HVT, HVT.A, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, LVO, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NOK, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPK, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RILY, RLGY, RMD, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SID, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, BSRR, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, SLG, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,415K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.7%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.5%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 290K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n^^^^2021-10-26",
        "created_utc": 1635242415,
        "id": "hi3h3xm",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635271215.0
    },
    {
        "author": "zen_gambler",
        "body": "If you could only pick one of these to buy tomorrow, which would it be and why?\n\n1. FB\n\n2. MSFT\n\n3. JPM\n\n4. COIN\n\n5. V\n\n6. TXN\n\n7. COF\n\n8. MA\n\n9. SHLX\n\n10. ADBE",
        "created_utc": 1635077812,
        "id": "hhuqjai",
        "score": 2,
        "subreddit": "investing",
        "created": 1635106612.0
    },
    {
        "author": "Capasian",
        "body": "Thank you so much for these two meaningful and insightful posts. For a long time I have been trying to convince my friend to drop Intel stock (mostly based on their shrinking market share, your data nicely adds), but he still believes in the power of inertia. Nevertheless, I had gathered a list of stocks one IMO can use instead, not overperformative, but solid. \n\nI think that top pick is ASML - instead of betting on a sloppy big player in a growing market, you switch to the main supplier of players in this market. \nTexas Instruments and Analog Devices are good picks if you trust in the electronics segment as a whole, and they provide a wider product mix in terms of electronic components and integrated circuits.\nAnd my favorites also are companies, that produce good measurement instruments. I do solid state physics, and there is funny coincidence - producers of devices I like and use generally show good performance at a stock market. Those are Ametek, Agilent, Keysight, Danaher (Fortive).\n\nWhether you have the opinion on these companies, I would highly appreciate it.",
        "created_utc": 1634888953,
        "id": "hhlf79e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634917753.0
    },
    {
        "author": "daydancer",
        "body": "PEP, TXN, UPS, PG are nice blue chip stocks with decent dividend. These are long term investments for my portfolio though\n\nMy actual dividend portfolio only consists of O, IRM, and IEP. In that order, they increase in yield percentage. IEP pays the most at 8 dollars a year for a nice yield of 14.61%. Dividend stocks are great but can quickly be unprofitable if the losses offset the payout so its good to buy dips and monitor performance as needed.",
        "created_utc": 1634334371,
        "id": "hgsgtht",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634363171.0
    },
    {
        "author": "redbatman2",
        "body": "They make completely different types of chips. Texas Instruments makes analog chops while intel and TSM does digital chips.",
        "created_utc": 1634853998,
        "id": "hhjo5gr",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634882798.0
    },
    {
        "author": "BUDDHA_LAUGHING",
        "body": "I've read many of the projects first hand at a my job and I can speak to it a bit but it's been a long day and this is a big subject with many aspects.  I will just mention the main one along with some publicly traded companies.  The main buzz word or \"thrust\" right now is \"Digital Twins\" for \"remote viewing.\"  Matterport MTTR is mapping and storing the interiors of the world which will be used at some point in the future for the metaverse.  The reverse of this is Snapchat SNAP whose glasses will merge the digital world into your viewing and will be able to record the two together for content posting.  A larger aspect is that 5G is using mmWaves so that mmWave radar can also be part of the 5G towers.  This will allow unmanned drones to fly and film and allow remote viewing in real-time.  MmWave radar chips are now being added to phones (I think mostly from TXN) so that the drones can ping them to navigate indoors unmanned.  These chips also are supposed to work with augmented reality Snapchat or Magic Leap type apps.  Not investment advice.  This is a very boring post for a subject I'm actually excited about.  Sorry, just tired...",
        "created_utc": 1634864398,
        "id": "hhkacx3",
        "score": 1,
        "subreddit": "smallstreetbets",
        "created": 1634893198.0
    },
    {
        "author": "BackgroundJudge2896",
        "body": "Low-multiple semis (TXN, QCOM), some energy on big drawdowns like yesterday, airlines, MA/V, and pharma/biotech",
        "created_utc": 1635409397,
        "id": "hicvkgg",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635438197.0
    },
    {
        "author": "asianrockstar2009",
        "body": "Texas Instruments",
        "created_utc": 1635443741,
        "id": "hieq9v8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635472541.0
    },
    {
        "author": "jbonesmiller1981",
        "body": "MSFT,V,DIS,TXN,LOW,SBUX,PYPL,DOV,NEP,ABT",
        "created_utc": 1633666242,
        "id": "hftescq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633695042.0
    },
    {
        "author": "daydancer",
        "body": "My favorites are blue chip/large cap stocks and I've made some nice returns by doing so. They are not risk-free but way less risk compared to small caps/short squeezes. The strategy is literally buy low, sell high lol. Study the daily chart and find the lows and high of the stocks. Some stocks like to bounce within a range for weeks or even months.\n\nA super great example is TXN. It reached 197 in April and it usually bounces down to its lows (174-180) and bounces back up to 190s. It has repeated this pattern for MONTHS and just yesterday, it hit 186 and today it bounced right back up. AXP has also been fairly predictable, lows (155-161), and highs (171-179). When stocks break out of their range, then I usually stop trading it for awhile to see the new boundaries. At what price you sell is up to you, but my minimum goal is a 2% return but if the stock is looking strong I try to aim for 5% or above. During this choppy market recently, I've also been having major fun with SBUX, V, WM, UPS, AMD, VTI.",
        "created_utc": 1634254501,
        "id": "hgo8nft",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634283301.0
    },
    {
        "author": "More-Sprinkles29",
        "body": " Just started managing an account. Looking to restructure/consolidate a portfolio for long term growth - already have a few thoughts on which ones I plan to sell. Wanted to seek other's constructive criticism on what should be removed or added. May consider reallocating some of that cash into existing portfolio stocks (I.e. MSFT or DIS), but definitely looking to diversify and potentially include some new stocks. \n\nAbout me: In late twenties; high risk tolerance, no outstanding debt or loans. Potentially use a portion of the funds for a wedding  house purchase in the next 5 years. \n\n  \nBolded below is what I'm thinking of selling. Thoughts?  \nSymbol  % Of Account  \nAMZN 9.83%  \nAAPL 18.68%  \nSCHW 2.21%  \nCSCO 5.74%  \nCOST 2.31%  \n**GILD 0.43%**  \n**INTC 5.74%**  \nMSFT 7.82%  \nMRNA 1.52%  \nTXN 7.14%  \nDIS 3.37%  \nQQQ 2.27%  \n**VWO 1.31% (maybe)**  \n**VNQ 2.12% (maybe)**  \n**TWCUX 4.89%**  \n**FRESX 1.52%**  \n**GTHIX 2.42%**  \n**MWTRX 1.05%**  \n**PONAX 0.89%**  \n**SWCAX 7.01%**  \n**SWANX 0.42%**  \n**SWISX 0.96%**  \n**SWSSX 5%**  \n**TBGVX 1.12%**  \n**VALIX 1.36%**  \n**VSGAX 1.90%**",
        "created_utc": 1634288958,
        "id": "hgpvfzj",
        "score": 1,
        "subreddit": "investing",
        "created": 1634317758.0
    },
    {
        "author": "2E26",
        "body": "Continue watching my existing stonks. I want to dump UWMC and WISH if they go green. I may go for an even hundred shares of LYG, as they seem promising.\n\nLonger term (or sooner if one of my more expendable stocks looks moonish) is to get more TXN or go wild and get some TGT. Not hoping to live off of dividends, but it provides me with some money to play around with cheaper stocks (like LYG).",
        "created_utc": 1634699501,
        "id": "hhbh1d8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634728301.0
    },
    {
        "author": "BackgroundJudge2896",
        "body": "When? Not seeing anything on it right now. TXN is dropping bc they had in-line guidance (dumb reason for a drop), but not seeing any sympathy with TSM.",
        "created_utc": 1635284179,
        "id": "hi62gk9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635312979.0
    },
    {
        "author": "Intrepid_Artist",
        "body": "How TSMC was build? \nIn the late 80s. By experiences of Morris Chang and taiwanese government determination to build tech. Morris Chang passed his PhD at Stanford University in 60s and worked at Texas Instruments for nearly 3 decades before Taiwan government recruited him. \n\nHe holds opinion only real rival to TSMC is Samsung, cause of operating advantages and local talent. American foundries relay on subsidies, which can give short term boost but can not guarantee long term edge. \nMorris Chang find ironic (once) mighty Intel wants enter foundry, when they refused investing into TSMC.\n\nWhat is my conclusion from above? One man, a strong CEO matters. I believe  Pat Gelsinger is the right guy for the j",
        "created_utc": 1635323556,
        "id": "hi833jq",
        "score": 1,
        "subreddit": "investing",
        "created": 1635352356.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the 29th of October\n\n\n\n## Upcoming events for Friday, October 29th\n\n - Expected earnings:\n\n  ABBV, ABR, AENZ, AON, AREC, ASIX, ASX, ATNM, ATRO, B, BAH, BBVA, BCH, BCPC, BELFA, BELFB, BLX, BSAC, CBOE, CCJ, CERN, CHD, CHT, CHTR, CL, COWN, CRI, CVX, DCOM, ECVT, ENIC, ENLV, ESXB, FNCB, FSFG, FTS, GIGM, GRC, GWW, HEXO, HUN, IMGN, IMO, IRMD, IROQ, ITCB, JCS, LAZ, LEVL, LHX, LYB, MGI, MSEX, NECB, NICK, NOVN, NPK, NTP, NVO, NWG, NWL, OIIM, OXLC, PBR, PBR.A, PFS, PHVS, PIPR, PLPC, PNM, POR, PSX, PSXP, RCL, RUTH, SHLX, SIFY, SJR, SLCA, SNP, TTE, TWIN, TZOO, UBOH, URG, UUUU, WETF, WPC, WY, XOM, ZNH\n\n - Ex-div:\n\n  ALLY, AON, ATLO, AVAL, BCBP, BK, BMO, BMTC, BX, C, CAG, CASY, CE, CZNC, DGICA, DGICB, DMLP, ENLC, EVTC, EWBC, HAS, HEP, HFBL, HIFS, KMI, KOF, KRP, LCUT, LNT, NRG, NVEC, OKE, ORRF, PAYX, PBCT, PLBC, PNM, PPBI, RBB, RVI, SAN, SGU, SPFI, STL, SXT, SYF, TKC, TXN, VALU, VOC, WES\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.6K)\n    - CFTC Copper speculative net positions (previous: 40.6K)\n    - CFTC Corn speculative net positions (previous: 277.0K)\n    - CFTC Crude Oil speculative net positions (previous: 429.6K)\n    - CFTC Gold speculative net positions (previous: 193.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.1K)\n    - CFTC Natural Gas speculative net positions (previous: -131.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 67.6K)\n    - CFTC Silver speculative net positions (previous: 30.4K)\n    - CFTC Soybeans speculative net positions (previous: 43.5K)\n    - CFTC Wheat speculative net positions (previous: -8.6K)\n    - Chicago PMI (consensus: 63.5, previous: 64.7)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.3%)\n    - Core PCE Price Index (consensus: 3.7%, previous: 3.6%)\n    - Dallas Fed PCE (previous: 2.80%)\n    - Dallas Fed Services Revenues (previous: 14.0)\n    - Employment Benefits (previous: 0.40%)\n    - Employment Cost Index (consensus: 0.9%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.80%)\n    - Michigan Consumer Expectations (consensus: 67.2, previous: 68.1)\n    - Michigan Consumer Sentiment (consensus: 71.4, previous: 71.4)\n    - Michigan Current Conditions (consensus: 77.9, previous: 80.1)\n    - Michigan Inflation Expectations (consensus: 4.8%, previous: 4.6%)\n    - PCE Price index (previous: 4.3)\n    - PCE price index (previous: 0.4%)\n    - Personal Income (consensus: -0.2%, previous: 0.2%)\n    - Personal Spending (consensus: 0.5%, previous: 0.8%)\n    - Real Personal Consumption (previous: 0.4%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.6%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 3.9%)\n    - Texas Services Sector Outlook (previous: 11.5)\n    - U.S. Baker Hughes Oil Rig Count (previous: 445)\n    - U.S. Baker Hughes Total Rig Count (previous: 543)\n\n## Upcoming events for Monday, November  1st\n\n - Expected earnings:\n\n  ABIO, ADC, ADTN, ADUS, AKTS, ALX, AMC, AMG, AMRC, ANAT, ANET, APEN, APLS, AWR, BEN, BNL, BRKR, BRX, BWXT, CACC, CAR, CCLP, CEA, CHGG, CLDB, CLX, CNA, CORR, CPLP, CRNT, CRUS, CSR, CSWC, CURO, CVI, CWBC, DSPG, DSS, DZSI, EC, EEX, EGRX, ENBL, EPRT, EVER, FANG, FEDU, FGBI, FN, FSBW, GAIA, GAME, GSS, GTE, GXO, HLIT, HNRG, HOLX, IPI, ISEE, IVAC, IVT, IX, JELD, KFRC, KLDO, KMT, KOF, L, LDI, LEG, LPG, LTRN, LXU, MCK, MFIN, MGP, MNOV, MOS, MRBK, MVBF, NBIX, NERV, NNN, NRIM, NSP, NSSC, NTR, NXPI, O, OGS, OIS, ON, ONVO, OTTR, PCG, PDLB, PLOW, PSA, RGS, RHP, RIG, RMBS, RRX, RYAAY, SBAC, SBT, SCCO, SKT, SMLR, SNDX, SOI, SPG, SUNW, SXC, TA, TGB, TKR, TRVG, TRVN, TTI, UAN, UNVR, VBIV, VNO, VNOM, VRNS, WBK, WLFC, WMB, WMK, WTRG, XENT, ZI\n\n - Ex-div:\n\n  AES, BANR, BKR, ETRN, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HIHO, IGD, ITUB, LMRK, O, OMF, SHLX, SPH, SRCE, VER, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Construction Spending (consensus: 0.4%, previous: 0.3%)\n    - ISM Manufacturing Employment (previous: 50.2)\n    - ISM Manufacturing New Orders Index (previous: 66.7)\n    - ISM Manufacturing PMI (consensus: 60.4, previous: 61.1)\n    - ISM Manufacturing Prices (consensus: 78.5, previous: 81.2)\n    - Loan Officer Survey\n    - Manufacturing PMI (consensus: 59.2, previous: 60.7)\n    - Total Vehicle Sales (previous: 9.66M)\n\n^^^^2021-10-29",
        "created_utc": 1635501611,
        "id": "hihss0l",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635530411.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 27th of October\n\n\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFI, AFL, AGI, AINC, AIT, AKO.A, AKO.B, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, AROW, ARR, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CAMT, CASH, CBD, CBTX, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CMRE, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FBC, FCNCA, FDBC, FDP, FIBK, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FPI, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HWKN, ICLR, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MXL, MYRG, NBN, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PB, PDM, PEGA, PGC, PGRE, PI, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.914M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.1%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -2.311M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: -2.0%)\n    - Gasoline Inventories (consensus: -1.862M, previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BCLI, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, HVT, HVT.A, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, LVO, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NOK, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPK, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RILY, RLGY, RMD, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SID, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, BSRR, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, SLG, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,415K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.7%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.5%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 290K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n## Upcoming events for Friday, October 29th\n\n - Expected earnings:\n\n  ABBV, ABR, AENZ, AON, AREC, ASIX, ASX, ATNM, ATRO, B, BAH, BBVA, BCH, BCPC, BELFA, BELFB, BLX, BSAC, CBOE, CCJ, CERN, CHD, CHT, CHTR, CL, COWN, CRI, CVX, DCOM, ECVT, ENIC, ENLV, ESXB, FNCB, FSFG, FTS, FUSB, GIGM, GRC, GWW, HUN, HWBK, IMGN, IMO, IRMD, IROQ, ITCB, JCS, LAZ, LEVL, LGND, LHX, LYB, MGI, MSEX, NECB, NICK, NOVN, NPK, NTP, NVO, NWFL, NWG, NWL, OIIM, OXLC, PEG, PFS, PHVS, PIPR, PLPC, PNM, POR, PSX, PSXP, RCL, ROLL, RUTH, SHLX, SIFY, SJR, SLCA, SNP, TTE, TWIN, TZOO, UBOH, UBSI, URG, UUUU, WETF, WPC, WY, XOM, ZNH\n\n - Ex-div:\n\n  ALLY, AON, ATLO, AVAL, BCBP, BK, BMO, BMTC, BX, C, CAG, CASY, CE, CZNC, DGICA, DGICB, DMLP, ENLC, EVTC, EWBC, HAS, HEP, HFBL, HIFS, KMI, KOF, KRP, LCUT, LNT, NRG, NVEC, OKE, ORRF, PAYX, PBCT, PLBC, PNM, PPBI, RBB, RVI, SAN, SGU, SPFI, STL, SXT, SYF, TKC, TXN, VALU, VOC, WES\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.6K)\n    - CFTC Copper speculative net positions (previous: 40.6K)\n    - CFTC Corn speculative net positions (previous: 277.0K)\n    - CFTC Crude Oil speculative net positions (previous: 429.6K)\n    - CFTC Gold speculative net positions (previous: 193.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.1K)\n    - CFTC Natural Gas speculative net positions (previous: -131.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 67.6K)\n    - CFTC Silver speculative net positions (previous: 30.4K)\n    - CFTC Soybeans speculative net positions (previous: 43.5K)\n    - CFTC Wheat speculative net positions (previous: -8.6K)\n    - Chicago PMI (consensus: 63.5, previous: 64.7)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.3%)\n    - Core PCE Price Index (consensus: 3.7%, previous: 3.6%)\n    - Dallas Fed PCE (previous: 2.80%)\n    - Dallas Fed Services Revenues (previous: 14.0)\n    - Employment Benefits (previous: 0.40%)\n    - Employment Cost Index (consensus: 0.9%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.80%)\n    - Michigan Consumer Expectations (previous: 67.2)\n    - Michigan Consumer Sentiment (consensus: 71.4, previous: 71.4)\n    - Michigan Current Conditions (previous: 77.9)\n    - Michigan Inflation Expectations (previous: 4.8%)\n    - PCE Price index (previous: 4.3)\n    - PCE price index (previous: 0.4%)\n    - Personal Income (consensus: -0.2%, previous: 0.2%)\n    - Personal Spending (consensus: 0.5%, previous: 0.8%)\n    - Real Personal Consumption (previous: 0.4%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.6%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 3.9%)\n    - Texas Services Sector Outlook (previous: 11.5)\n    - U.S. Baker Hughes Oil Rig Count (previous: 445)\n    - U.S. Baker Hughes Total Rig Count (previous: 543)\n\n^^^^2021-10-27",
        "created_utc": 1635328812,
        "id": "hi895vq",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635357612.0
    },
    {
        "author": "rhythmdev",
        "body": "$20k High yield Gov Bonds\n\n$15k VTI\n\n$10k Cash\n\n$10k AAPL\n\n$10k Phys Gold\n\n$5k XOM\n\n$5k TXN\n\n$5k MMM\n\n$5k GSK\n\n$5k BATS\n\n$5k PEP\n\n$5k V",
        "created_utc": 1633322575,
        "id": "hfbedaq",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1633351375.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 25th of October\n\n\n\n## Upcoming events for Monday, October 25th\n\n - Stock splits:\n\n    - DPST @ **5:1** (Payable date: 10/22/2021)\n    - RETL @ **5:1** (Payable date: 10/22/2021)\n    - TECS @ **1:10**\n    - DRV @ **1:10**\n\n - Expected earnings:\n\n  ACC, AGNC, AIN, AJRD, AMG, AMKR, ARE, ARI, ARLP, AUB, AXTA, BDN, BMRC, BOH, BRO, BSRR, BXS, CAJ, CALX, CATY, CBNK, CBU, CCK, CDNS, CFBK, CIZN, CLDB, CPSS, CR, CWBC, DORM, DSS, EC, EFSC, FB, FBMS, FBNC, FBP, FEDU, FLXS, FSBC, FSBW, GABC, GAME, HBT, HMST, HNI, HOPE, HSII, HSTM, HTLF, IBTX, JBSS, KMB, KOF, KREF, LII, LKFN, LOGI, LSBK, LXFR, MEDP, MEDS, MNOV, MRBK, MSVB, NEU, NRIM, NWBI, OI, ONVO, OPOF, OTIS, PCH, PEBK, PETS, PKG, PRK, PWOD, QSR, RBB, RNR, SAN, SCCO, SITC, SLP, SMBC, SSD, SUI, TBI, TCBK, TGB, TIMB, TNET, TZOO, UFI, UHS, WASH\n\n - Ex-div:\n\n  APOG, CRS, CVLY, FAST, RY\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Chicago Fed National Activity (previous: 0.29)\n    - Dallas Fed Mfg Business Index (previous: 4.6)\n    - Investing.com Gold Index (actual: 54.3%, previous: 58.4%)\n    - Investing.com S&amp;P 500 Index (actual: 47.2%, previous: 62.3%)\n\n## Upcoming events for Tuesday, October 26th\n\n - Expected earnings:\n\n  AAN, AAT, ABG, ACCO, ACH, ACU, ADM, AGR, AGYS, AHT, AKO.A, AKO.B, AKR, AMD, AMP, APAM, ARCC, ARCH, AUDC, AWI, AWRE, BEN, BGFV, BSBR, BUSE, BXP, BYD, CAC, CB, CCB, CCBG, CCNE, CEQP, CHRW, CIT, CLS, CMRE, CNC, COF, CSGP, CVLT, CZOO, CZWI, DALN, DAN, DHIL, DLR, EBMT, ECL, EDU, EGP, ENPH, ENTG, EQR, ESS, FBHS, FCBC, FCF, FCPT, FELE, FFIC, FFIV, FFNW, FFWM, FIBK, FRAF, FRBA, FRME, FSV, GBX, GE, GIC, GLW, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HFBL, HIW, HNP, HONE, HOOD, HPP, HRZN, HSBC, HT, HUBB, HZO, IBCP, IEX, INMD, IVZ, JBLU, JNPR, KAI, LBAI, LBC, LBRT, LFUS, LLY, LMT, MANH, MASI, MKL, MMM, MMYT, MSCI, MSFT, MTDR, MYOV, NAVI, NBR, NBTB, NCR, NETI, NOV, NVS, OMAB, OVBC, OXSQ, PCAR, PCB, PEBO, PERI, PFG, PHM, PII, PJT, PNR, PROV, QS, QURE, RARE, RCKY, RNDB, ROIC, RRC, RRD, RTX, SBSI, SEB, SFBC, SFNC, SFST, SHW, SPFI, SPGI, SSTK, ST, TECK, TENB, TER, TPB, TRMK, TRTN, TRU, TTM, TWOU, TWTR, TXN, UBCP, UBS, UDR, UMBF, UPS, USNA, UTMD, V, VBTX, WIRE, WM, WNEB, WRLD, WSBC, WSR, XRX, ZWS\n\n - Ex-div:\n\n  AM, ATR, CLX, CMC, DNUT, ENTG, INFY, PSEC\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.310%)\n    - API Weekly Crude Oil Stock (previous: 3.294M)\n    - CB Consumer Confidence (consensus: 108.8, previous: 109.3)\n    - Dallas Fed Services Revenues (previous: 14.5)\n    - House Price Index (previous: 1.4%)\n    - House Price Index (previous: 19.2%)\n    - House Price Index (previous: 348.4)\n    - New Home Sales (consensus: 755K, previous: 740K)\n    - New Home Sales (previous: 1.5%)\n    - Redbook (previous: 15.4%)\n    - Richmond Manufacturing Index (previous: -3)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -3)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 1.5%, previous: 1.5%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 20.1%, previous: 19.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.4%, previous: 1.5%)\n    - Texas Services Sector Outlook (previous: 8.3)\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFL, AGI, AINC, AIT, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CAMT, CASH, CBD, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FCNCA, FDBC, FDP, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HVT, HVT.A, HWKN, IBA, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MYRG, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PAYA, PB, PDM, PEGA, PGC, PGRE, PI, PINS, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.857M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.0%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -0.700M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (previous: -2.0%)\n    - Gasoline Inventories (previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ASR, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBTX, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, GWB, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RLGY, RMD, RNGR, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TV, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,445K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.8%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.4%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 292K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n^^^^2021-10-25",
        "created_utc": 1635156012,
        "id": "hhyvgab",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635184812.0
    },
    {
        "author": "Jumpdeckchair",
        "body": "TXN is the GOAT of wasting time in school during the 2000s",
        "created_utc": 1635339667,
        "id": "hi8q5qx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635368467.0
    },
    {
        "author": "dahliatree",
        "body": "whattabout texas instruments?",
        "created_utc": 1634840568,
        "id": "hhirjgk",
        "score": 0,
        "subreddit": "stocks",
        "created": 1634869368.0
    },
    {
        "author": "thisistheperfectname",
        "body": "Please, no - I'm having a bad enough earnings season as it is between TXN and V.",
        "created_utc": 1635348238,
        "id": "hi99kne",
        "score": 0,
        "subreddit": "stocks",
        "created": 1635377038.0
    },
    {
        "author": "alles_long",
        "body": "Also:\n- XLNX merger on the brink of completion. \n- Semi’s rebounding\n- Google just expanded collaboration with AMD in the cloud server market\n- Rates trending down, good news for (semi)growth stocks\n- JPow dm’ed me “f*ck your puts”",
        "created_utc": 1634499176,
        "id": "hh0rj7j",
        "score": 66,
        "subreddit": "wallstreetbets",
        "created": 1634527976.0
    },
    {
        "author": "Cantgetfooledagain1",
        "body": "XLNX merger is the single most important point here - merg arb players will be pushed out and of course great synergies longer term",
        "created_utc": 1634500436,
        "id": "hh0ukj3",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1634529236.0
    },
    {
        "author": "alles_long",
        "body": "[Previous post.](https://www.reddit.com/r/wallstreetbets/comments/qa5rsx/amd_q3_is_going_to_be_a_blowout_tsm_already_gave/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf)\n\nAlso: volume on weekly calls is insane. AMD-XLNX arb traders hedging their upside risk? Just like last time…0",
        "created_utc": 1634575766,
        "id": "hh4l9l5",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1634604566.0
    },
    {
        "author": "19901224",
        "body": "Just buy Xilinx if you betting on acquisition to go through",
        "created_utc": 1634686412,
        "id": "hhapld9",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1634715212.0
    },
    {
        "author": "DontGetInjuredPls",
        "body": "Xilinx isn't a random stock when AMD is being discussed. Their value is directly linked.",
        "created_utc": 1633624847,
        "id": "hfqwe22",
        "score": 10,
        "subreddit": "stocks",
        "created": 1633653647.0
    },
    {
        "author": "VaultBoy3",
        "body": "If XLNX goes up at least 0.5% tomorrow after the earnings release, I will donate $420.69 to St. Jude Children's Research Hospital.",
        "created_utc": 1635348038,
        "id": "hi992q1",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635376838.0
    },
    {
        "author": "VaultBoy3",
        "body": "It'll really be more like XLNX +85% when the merger goes through and every XLNX share is converted to 1.7234 shares of AMD.\n\nBut XLNX+AMD I think could surpass Intel's market cap which would be like a +20% move for them combined.",
        "created_utc": 1635110264,
        "id": "hhwsdk2",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635139064.0
    },
    {
        "author": "xxJunjiFritoxx",
        "body": "Anyone think AMD announces completion of the Xilinx merger during their earnings call? Has to be done soon...",
        "created_utc": 1634658253,
        "id": "hh8tbp0",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1634687053.0
    },
    {
        "author": "Official_Ken_Bone",
        "body": "54 strong (comes out to 93.1 AMD) with a cost average of $134 on my XLNX which is $77.75 AMD cost average after it goes through. Wanna add more but mentally I hate messing with a great cost average, even though the premium/discount is still silly. I share OPs confidence in the merger happening so I don’t know why I just don’t add more…",
        "created_utc": 1633648368,
        "id": "hfsff6k",
        "score": 7,
        "subreddit": "stocks",
        "created": 1633677168.0
    },
    {
        "author": "Both-Employee-3421",
        "body": "XLNX up more than AMD. It liked AMD earnings better than AMD did.",
        "created_utc": 1635342640,
        "id": "hi8waq7",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635371440.0
    },
    {
        "author": "DragonInPajama",
        "body": "Yeah, I'm in the same boat but AMD has burned more than once on earnings, I'm now holding shares and XLNX LEAPSs. I maybe get a few calls for fun this week if it dips, but nothing remotely close to a yolo like you. Good Luck!",
        "created_utc": 1634502269,
        "id": "hh0yvrd",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1634531069.0
    },
    {
        "author": "Desmater",
        "body": "Not sure but thinking the XLNX deal odds are getting better and more details soon.\n\nPlus ER is coming up, TSM did pretty well.",
        "created_utc": 1634584266,
        "id": "hh560in",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1634613066.0
    },
    {
        "author": "VisualMod",
        "body": "&gt; I think AMD will announce the completion of their Xilinx merger during their earnings call. I also think that they will announce a new partnership with Intel to develop a new line of CPUs based on an x86-64 architecture, but using ARM's 64-bit instruction set.",
        "created_utc": 1634658267,
        "id": "hh8tcvx",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1634687067.0
    },
    {
        "author": "ourobboros",
        "body": "Xlnx &amp; amd = ❤️",
        "created_utc": 1635179793,
        "id": "hi0487j",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635208593.0
    },
    {
        "author": "Hushpupppi",
        "body": "AMD and XLNX let's see what we have in store for the merger. Time to moon to send a signal of confidence.",
        "created_utc": 1635329083,
        "id": "hi89ht8",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635357883.0
    },
    {
        "author": "chickenfriedsandwich",
        "body": "XLNX!!!",
        "created_utc": 1635346860,
        "id": "hi9670t",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635375660.0
    },
    {
        "author": "stevoacp1",
        "body": "buying more AMD tomorrow. just wait til XLNX merger 🚀🚀🚀",
        "created_utc": 1635280231,
        "id": "hi5shr6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635309031.0
    },
    {
        "author": "jawntist",
        "body": "AMD is in the process of acquiring XLNX.  Just waiting on all the approvals, China particularly.",
        "created_utc": 1634512396,
        "id": "hh1lp1p",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1634541196.0
    },
    {
        "author": "Spitzly",
        "body": "I have my entire net worth in AMD and XLNX. \n\nThis is fine",
        "created_utc": 1635342057,
        "id": "hi8v0up",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635370857.0
    },
    {
        "author": "P33L_R",
        "body": "Waiting on xilinx earnings AH. PT increases incoming. Will resume the run soon",
        "created_utc": 1635337368,
        "id": "hi8lsir",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635366168.0
    },
    {
        "author": "LePootPootJames",
        "body": "Ideally tomorrow AMD announces XLNX buyout process has been done and AMD rallies to 200.",
        "created_utc": 1634155459,
        "id": "hgix7ka",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1634184259.0
    },
    {
        "author": "One_of_the_blessings",
        "body": "Gonna be a nail biter for me today - will this $150 put I sold on XLNX end up in the money and will I have to take delivery of shares? \n\nGonna ride it out",
        "created_utc": 1633095650,
        "id": "hez2sr5",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1633124450.0
    },
    {
        "author": "thetatheropy",
        "body": "Wouldn't it be the other way around? 100 XLNX to 170 shares of AMD?",
        "created_utc": 1633711236,
        "id": "hfveudu",
        "score": 3,
        "subreddit": "stocks",
        "created": 1633740036.0
    },
    {
        "author": "VaultBoy3",
        "body": "Have fun being short AMD when they're about to have one of the biggest company mergers in the history of the semiconductor industry. AMD+XLNX could be worth as much as Intel.",
        "created_utc": 1634324848,
        "id": "hgrv3e2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634353648.0
    },
    {
        "author": "thejunes",
        "body": "I’m all in on AMD and XLNX",
        "created_utc": 1634529052,
        "id": "hh2ikx2",
        "score": 3,
        "subreddit": "smallstreetbets",
        "created": 1634557852.0
    },
    {
        "author": "Runningflame570",
        "body": "Whether or not what they're doing winds up being successful or profitable for me I just want to know if my thoughts/predictions on company strategies were right or not. It would definitely be nice to get another AMD-XLNX update though.",
        "created_utc": 1634654468,
        "id": "hh8kccy",
        "score": 3,
        "subreddit": "stocks",
        "created": 1634683268.0
    },
    {
        "author": "VisualMod",
        "body": "**Ban Bet Created:** **/u/Spitzly** bet **XLNX** goes from **172.25** to **200.0** before **2021-12-17 20:58:39.775965-04:00**",
        "created_utc": 1634950727,
        "id": "hhovo9p",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634979527.0
    },
    {
        "author": "VaultBoy3",
        "body": "XLNX earnings tomorrow... fingies crossed",
        "created_utc": 1635294842,
        "id": "hi6qhen",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635323642.0
    },
    {
        "author": "UnseenTardigrade",
        "body": "I bought 3 shares of XLNX at the beginning of August. It’s up 17% since then. I wish I had bought more, I’d have made a good chunk of money. It feels like the less I buy of a stock, the better it does.",
        "created_utc": 1634230161,
        "id": "hgmpla1",
        "score": 3,
        "subreddit": "stocks",
        "created": 1634258961.0
    },
    {
        "author": "xxJunjiFritoxx",
        "body": "C'mon, AMD-Xilinx merger. Let's wrap this up.",
        "created_utc": 1634568353,
        "id": "hh43oam",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634597153.0
    },
    {
        "author": "Right-Fee6202",
        "body": "Xilinx up 6 and continuing and Amd retracting a bit. Can we just merge already hehe. Maybe 10% was too ambitious of a bet 🤣",
        "created_utc": 1635342817,
        "id": "hi8wons",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635371617.0
    },
    {
        "author": "One_of_the_blessings",
        "body": "Can Winnie the Pooh approve this XLNX and AMD merger already so AMD can lift off?",
        "created_utc": 1634250686,
        "id": "hgo0dcv",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634279486.0
    },
    {
        "author": "neothedreamer",
        "body": "Xlnx is the play right now.  Assuming merger happens you get 1.7234 shares of Amd for everyone of Xlnx.  Mispriced right now \n\nOP sell at least half and buy Xlnx and thank me later.",
        "created_utc": 1634697432,
        "id": "hhbd08i",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634726232.0
    },
    {
        "author": "dvking131",
        "body": "This week TSLA, AMD, Xilinx, Mango, Mara",
        "created_utc": 1635150732,
        "id": "hhypnjd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635179532.0
    },
    {
        "author": "xxJunjiFritoxx",
        "body": "$500 in *deep* OTM mid-November calls for AMD. Hoping they announce that the Xilinx merger has been approved or is at least close.",
        "created_utc": 1634839843,
        "id": "hhipr57",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1634868643.0
    },
    {
        "author": "AlmightySnoo",
        "body": "Damn $XLNX stealing those gains from $AMD",
        "created_utc": 1635344108,
        "id": "hi8zlmq",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635372908.0
    },
    {
        "author": "sogerr",
        "body": "XLNX is so behind the merger ratio that im impressed it didnt run up any sooner, its supposed to be a XLNX 1:1.7 AMD thing but right now its sitting at 1.46",
        "created_utc": 1635342789,
        "id": "hi8wmgt",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635371589.0
    },
    {
        "author": "One_of_the_blessings",
        "body": "Will XLNX finish above $150? These options balancing on a razors edge",
        "created_utc": 1633107711,
        "id": "hezuaty",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633136511.0
    },
    {
        "author": "rotflolmaomgeez",
        "body": "XLNX calls for next week, a lot of them. We'll see how it goes.",
        "created_utc": 1633643407,
        "id": "hfs4vd0",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633672207.0
    },
    {
        "author": "Paul_Ostert",
        "body": "Xilinx was hot in the late 90s and was one stock that ran up very high in 2000....it took almost 20 years to get the stock price back to the high of 2000.  Is Xilinx to AMD like Altera is to Intel?",
        "created_utc": 1633657217,
        "id": "hfsxg5a",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633686017.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the 26th of October\n\n\n\n## Upcoming events for Tuesday, October 26th\n\n - Expected earnings:\n\n  AAN, AAT, ABG, ACCO, ACH, ACU, ADM, AGR, AGYS, AHT, AKO.A, AKO.B, AKR, AMD, AMP, APAM, ARCC, ARCH, AUDC, AWI, AWRE, BEN, BGFV, BSBR, BUSE, BXP, BYD, CAC, CAJ, CB, CCB, CCBG, CCNE, CEQP, CHRW, CIT, CMRE, CNC, COF, CSGP, CVLT, CZOO, CZWI, DALN, DAN, DBVT, DHIL, DLR, EBMT, ECL, EDU, EGP, ENPH, ENTG, EQR, ESS, FBHS, FCBC, FCF, FCPT, FELE, FFIC, FFIV, FFNW, FFWM, FIBK, FRAF, FRBA, FRME, FSV, GBX, GE, GIC, GLW, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HFBL, HIW, HNP, HONE, HOOD, HPP, HRZN, HSBC, HT, HUBB, HZO, IBCP, IEX, INMD, IVZ, JBLU, JNPR, KAI, LBAI, LBC, LBRT, LFUS, LLY, LMT, MANH, MASI, MKL, MMM, MMYT, MSCI, MSFT, MTDR, MYOV, NAVI, NBR, NBTB, NCR, NETI, NOV, NVS, OMAB, OVBC, OXSQ, PCAR, PCB, PEBO, PERI, PFG, PHM, PII, PJT, PNR, PROV, QS, QURE, RARE, RCKY, RNDB, ROIC, RRC, RRD, RTX, SBSI, SEB, SFBC, SFNC, SFST, SHW, SPFI, SPGI, SSTK, ST, TECK, TENB, TER, TPB, TRMK, TRTN, TRU, TTM, TWOU, TWTR, TXN, UBCP, UBS, UDR, UMBF, UPS, USNA, UTMD, V, VBTX, VNE, WIRE, WM, WNEB, WRLD, WSBC, WSR, XRX, ZWS\n\n - Ex-div:\n\n  AM, ATR, CLX, CMC, DNUT, ENTG, INFY, PSEC\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.310%)\n    - API Weekly Crude Oil Stock (previous: 3.294M)\n    - CB Consumer Confidence (consensus: 108.3, previous: 109.3)\n    - Dallas Fed Services Revenues (previous: 14.5)\n    - House Price Index (previous: 1.4%)\n    - House Price Index (previous: 19.2%)\n    - House Price Index (previous: 348.4)\n    - New Home Sales (consensus: 760K, previous: 740K)\n    - New Home Sales (previous: 1.5%)\n    - Redbook (previous: 15.4%)\n    - Richmond Manufacturing Index (previous: -3)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -3)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 1.5%, previous: 1.5%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 20.0%, previous: 19.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.5%, previous: 1.5%)\n    - Texas Services Sector Outlook (previous: 8.3)\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFI, AFL, AGI, AINC, AIT, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, AROW, ARR, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CADE, CAMT, CASH, CBD, CBTX, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FBC, FCNCA, FDBC, FDP, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HVT, HVT.A, HWKN, IBA, ICLR, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MXL, MYRG, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PAYA, PB, PDM, PEGA, PGC, PGRE, PI, PINS, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.650M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.1%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -2.350M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.1%, previous: -2.0%)\n    - Gasoline Inventories (consensus: -1.850M, previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BCLI, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, HVT, HVT.A, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, LVO, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NOK, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPK, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RILY, RLGY, RMD, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SID, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, BSRR, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, SLG, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,415K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.7%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.5%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 290K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n^^^^2021-10-26",
        "created_utc": 1635242415,
        "id": "hi3h3xm",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1635271215.0
    },
    {
        "author": "Chilly-Cheez",
        "body": "Don't forget Xilinx and ARM holdings which are going into a side room to do a foursome with AMD and NVDA while INTC cucks in tears in the corner =====D\\~\\~\\~\\~ $$$$$$$",
        "created_utc": 1635275351,
        "id": "hi5frrh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635304151.0
    },
    {
        "author": "2CommaNoob",
        "body": "When the XLNX merger closes and assuming AMD's stock price stays at this level; it's market cap will exceed Intel.",
        "created_utc": 1635322667,
        "id": "hi8239t",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635351467.0
    },
    {
        "author": "VaultBoy3",
        "body": "HOLY SHIT XLNX is up almost 7% on AMD's earnings beat. Merger being priced in now?",
        "created_utc": 1635345182,
        "id": "hi924gc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635373982.0
    },
    {
        "author": "randomaccount0923",
        "body": "That’s if you’re thinking of it from a value perspective. Same thing can be said about NVDA. AMD and NVIDIA have more room to grow esp. with the XLNX merger for AMD. If you’re worried that it’s overvalued, then AMAT is the way to go for semis. With the recent drop, I’m personally looking to add more AMD if it drops to the 90s. It’s definitely a solid pick for the next 5 years. Intel is consistently losing market share to AMD and probably won’t regain it for a good 3-5 years.",
        "created_utc": 1633272553,
        "id": "hf8c0ki",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1633301353.0
    },
    {
        "author": "Anth916",
        "body": "&gt; and AMD doesn't drop in value\n\nBut if AMD does drop in value, wouldn't XLNX drop to mirror it pretty closely? I'm guessing you're only getting this extra benefit, because the common Joe Blow retail investor doesn't really know about this, and they just buy AMD shares, while bigger insiders that feel this merger is a slam dunk buy XLNX instead. The spread you're seeing is this slight difference in understanding, also some people don't want to take the 20 percent risk the merger somehow doesn't happen",
        "created_utc": 1633709935,
        "id": "hfvbol2",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633738735.0
    },
    {
        "author": "Jumpdeckchair",
        "body": "The announcement of xlnx blew up my account.  I was really deep into AMD at the time.",
        "created_utc": 1633612031,
        "id": "hfq32vk",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633640831.0
    },
    {
        "author": "Hot-Bluebird3919",
        "body": "They have been working on a chip that allows them to gape your rectum, using XLNX technology.",
        "created_utc": 1633608631,
        "id": "hfpwu2k",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1633637431.0
    },
    {
        "author": "BTC_Throwaway_1",
        "body": "I’m YOLOing AMD Leaps rather than XLNX probably silly considering the discount but much safer IMO.",
        "created_utc": 1634515430,
        "id": "hh1s060",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634544230.0
    },
    {
        "author": "mannomann91",
        "body": "Congratulations I’m holding as well. You think it’ll get capped at 70$? You see it as a merger ? Or will it trade independently like xlnx is doing ? Can you explain?",
        "created_utc": 1634764189,
        "id": "hhetvuv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634792989.0
    },
    {
        "author": "yardsale2",
        "body": "Meh. The calls were very cheap (and are even cheaper now). Upside was massive if it went in my favour. I figured the expected value was positive. Doesn't mean the bet would win though.\n\nYeah, the view of the xilinx merger is probably correct. It's probably going thru.",
        "created_utc": 1634930943,
        "id": "hhnpjp5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634959743.0
    },
    {
        "author": "_MoveSwiftly",
        "body": "If they acquire Xilinx their revenue will match Nvidia, I'd say $180 in the low end, to $240.",
        "created_utc": 1634875484,
        "id": "hhkws53",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634904284.0
    },
    {
        "author": "pa1reddit",
        "body": "Personally I think it’s an end game for intel. There are better options to invest other than intel. Honestly I would AmD at the current price as they have been executing in all segments. With xlnx they are going to take it to the next level. For an organization like intel to reinvent, the change has to come from the roots which is literally impossible.",
        "created_utc": 1635013422,
        "id": "hhrmbri",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635042222.0
    },
    {
        "author": "ThatKrazyPolak",
        "body": "And how are they overvalued again? NVDA has record GPU sales and a pending acquisition with ARM. AI use cases that rival Tesla’s Dojo computer. AMD has a pending Xilinx deal with record desktop CPU sales and growing laptop market share.",
        "created_utc": 1635305177,
        "id": "hi7cqeo",
        "score": 2,
        "subreddit": "investing",
        "created": 1635333977.0
    },
    {
        "author": "IllBiteYourLegsOff",
        "body": "Look into the xlnx/amd arbitrage. It's likely better to buy xlnx at this point.",
        "created_utc": 1635341872,
        "id": "hi8umkq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635370672.0
    },
    {
        "author": "DontGetInjuredPls",
        "body": "Either works. I think it's likely that Xilinx will rise, but the market is unpredictable. Perhaps you could keep your AMD shares, but buy Xilinx shares if you consider adding to your position?",
        "created_utc": 1633696976,
        "id": "hfuj1dg",
        "score": 2,
        "subreddit": "stocks",
        "created": 1633725776.0
    },
    {
        "author": "DragonInPajama",
        "body": "market reacting to rx6600 launch. Also people anticipating positive ER EOM and merger with xlnx later.",
        "created_utc": 1634139024,
        "id": "hghs8r5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634167824.0
    },
    {
        "author": "DragonInPajama",
        "body": "In a nutshell: They have a tech that allows for cpu chips to have more cores while being cheaper (they use several smaller chips that are cheaper to manufacture). This allow them to sell 64 cores cpus for less than intel sells a 24 cores cpu. This makes them gain server marketshare very quickly 5% three years ago to 20% now, and accelerating.\n\nIn the gpu side they got better but nvidia still beats them in the software side of things. No worries, they will apply the same tech to gpus and beat them with raw power and let the open software comminty take care of the software side.\n\nThey are also buying xilinx to get better tech in computation and access to new markets (automotive, aerospace, special computation loads in datacenters, etc).\n\nTo sum Up, AMD will be 200 in less than 12 months.",
        "created_utc": 1634138758,
        "id": "hghrl6t",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634167558.0
    },
    {
        "author": "AlmightySnoo",
        "body": "$AMD or $XLNX for December if you're bullish on the AMD+XLNX deal getting China's approval by EOY.",
        "created_utc": 1634651535,
        "id": "hh8drpa",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634680335.0
    },
    {
        "author": "otakucode",
        "body": "Plus, people following it have been buying XLNX instead of AMD shares because when merger completes every share of XLNX turns into 1.72 shares of AMD... yet only costs ~1.5x as much.  And obviously it's being maintained at that 1.5x level intentionally, because I've been following this for a year and it rarely budges.  Every move in one gets accounted for in the other practically instantly.  Must be those HFT hedgies.  I know I've only been buying XLNX shares myself, guaranteed bump on merger day sounds good to me.",
        "created_utc": 1634557955,
        "id": "hh3jn4l",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634586755.0
    },
    {
        "author": "yourdadsalt",
        "body": "Or load up on Xilinx that’s what I’ve been doing the last few months for an arbitrage play. It’s gotten pretty pricey now last week or two",
        "created_utc": 1635073845,
        "id": "hhul0qu",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635102645.0
    },
    {
        "author": "xxJunjiFritoxx",
        "body": "Possibly, but Xilinx merger coming soon. Be careful 🤡",
        "created_utc": 1634946187,
        "id": "hhomufc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634974987.0
    },
    {
        "author": "isellamdcalls",
        "body": "we just need to defend it till amd and xilinx merge. tiawan can fall into the ocean after that for all i care",
        "created_utc": 1634954104,
        "id": "hhp268v",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634982904.0
    },
    {
        "author": "Brett-_-_",
        "body": "Intel owns half of the FPGA market, Xilinx the other half.  That will always be a fundamental help to INTC",
        "created_utc": 1634954052,
        "id": "hhp22ii",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634982852.0
    },
    {
        "author": "ourobboros",
        "body": "$xlnx &amp; $amd kept me green 🤝",
        "created_utc": 1634155760,
        "id": "hgixygy",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634184560.0
    },
    {
        "author": "Spitzly",
        "body": "Probably both go up, but xlnx goes up more because arbitrage",
        "created_utc": 1634153175,
        "id": "hgirjir",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634181975.0
    },
    {
        "author": "Skydivekev",
        "body": "Good tip, thanks.  How much do you think XLNX will drop if the merger doesnt go through?",
        "created_utc": 1633805498,
        "id": "hg0fwjh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633834298.0
    },
    {
        "author": "ImSkripted",
        "body": "defo the synergy effects should be sizeable. AMD desperately need more talent. they lost so much in the years prior to ryzen. Xilinx has the serious talent they need. not to mention Xilinx had to work out chiplets years ago, they likely have considerable IP that is invaluable to AMD\n\nXilinx is actually currently more profitable than AMD, however, they are a lower volume producer, so I could assume their wafer costs could defo see improvement under AMD who has the volume to get the cost down (they also don't need bleeding edge so maybe this is also how AMD will continue to fulfil the WSA or whatever is left of that but they would still need to port over which isn't cheap)\n\nAMDs management has really got good at execution, so id expect this merger assuming fully approved which Id see likely will go well and we will see the benefits long term.",
        "created_utc": 1633976680,
        "id": "hg9aq4m",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634005480.0
    },
    {
        "author": "tebedam",
        "body": "Why would it grow? There's no good news coming for AMD and a lot of bad ones:\n\n\\- Intel will leapfrog AMD by the end of October with Alder Lake and AMD has nothing to counter with for the next year and a half. This is massive in terms of sentiment change, from \"AMD is the best\" to \"AMD is behind\".\n\n\\- TSMC capacity is all booked by Apple, Qualcomm and Intel, preventing AMD from improving their node process. They just do not have enough money to outbid competitors.\n\n\\- Intel will release its own mid-range GPUs early next year, undercut on pricing, and use TSMC capacity to starve AMD.\n\n\\- Supply shortages are not getting any better, preventing AMD from capitalizing on their current advantages. By the time they are resolved, Intel will capitalize on laptop and server processors with Alder Lake using its own capacity.\n\n\\- Xilinx merger may get cockblocked or delayed by China, as well as force AMD to make costly concessions.\n\nOn the other hand, we can draw a few astrological lines and prey.",
        "created_utc": 1633941017,
        "id": "hg7h1yk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633969817.0
    },
    {
        "author": "Slopii",
        "body": "I like ones that aren't involved in military contracts, not making chips for guided missiles, etc. (See the Xilinx controversy).\n\nTaiwan Semiconductor Manufacturing Company ($TSM) is the foundry that produces the majority of the world's chips. It's a pretty solid bet, as are $AMD and $NVDA, which often rely on $TSM. \n\nOther semiconductor &amp; related companies I like include $UMC, $ACLS, $KLAC, $ASX, $AXTI, $INDI, $ENTG, $KLIC, $COHU, $AMAT, $AMSC, $ACMR, $AMKR. Look them up and see what they do, some will be more profitable than others. \n\nAlso, $MP is a US company that mines for elements crucial for electric vehicle chips.",
        "created_utc": 1634487816,
        "id": "hh004br",
        "score": 1,
        "subreddit": "RobinHoodPennyStocks",
        "created": 1634516616.0
    },
    {
        "author": "Secret_Dimension_z",
        "body": "Super excited willy tingles, I was 2500$ down after 3 months trading thanks to this sub and bloody memes, in the last month XLNX and AMD have brought me back from the depths into 1000$ up and I think there fuel left in the tank for moreemote:t5\\_2th52:4276",
        "created_utc": 1634849622,
        "id": "hhje0gk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634878422.0
    },
    {
        "author": "quantumpencil",
        "body": "I'm already diversified, I own a variety of AMD and XLNX calls options, probably 10 different strikes!",
        "created_utc": 1634839952,
        "id": "hhiq0o8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634868752.0
    },
    {
        "author": "Spitzly",
        "body": "Basically just banned myself for making a XLNX banbet. Problem is, when the merger is approved it won't be XLNX anymore.\n\nGUH",
        "created_utc": 1635011301,
        "id": "hhrhlyd",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635040101.0
    },
    {
        "author": "UABeeezy",
        "body": "Loading up on XLNX shares for whenever the merger announcement happens. If only the FDs were more liquid. Those spreads are bananas",
        "created_utc": 1635262952,
        "id": "hi4kavw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635291752.0
    },
    {
        "author": "Miserable-Fact-6668",
        "body": "Xilinx tmrw should send it flying",
        "created_utc": 1635277933,
        "id": "hi5mhkj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635306733.0
    },
    {
        "author": "Nickor11",
        "body": "Ok cool, I was thinking I might enter a share position starting at mid/low 40's. I'm currently playing the AMD Xilinx merger with the premise that the China risk is overblown. Atm my xilinx is up 20% and theres an other 20% on the table if the merger clears.\n\nI wish you good luck, some times when you dare you lose but if you never dare you never win.",
        "created_utc": 1634930854,
        "id": "hhnpbw3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634959654.0
    },
    {
        "author": "ChallengeLivid",
        "body": "Each Xilinx shareholder will get 1.7234 shares of AMD for every share of Xilinx they own when the merger goes through. XLNX is currently lagging behind AMD about 20%.",
        "created_utc": 1635185132,
        "id": "hi0h9ct",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635213932.0
    },
    {
        "author": "SpaceCatVII",
        "body": "I sold a CC on XLNX at $165 🤡🤡🤡",
        "created_utc": 1635342411,
        "id": "hi8vsnk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635371211.0
    },
    {
        "author": "DragonInPajama",
        "body": "xlnx. If amd/xlnx merger goes through you get an instant 30-40% and you end up holding a super itm, 1.7x AMD leaps. If it doesn't, welp, you better start an onlyfans...",
        "created_utc": 1633212187,
        "id": "hf5ebwa",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633240987.0
    },
    {
        "author": "wintermaker2",
        "body": ".... and then there's fucking Xilinx, who let their entire even semi-recent FPGA portfolio go out to 52 week lead time.  Luckily, fairly old shit like the Spartan3 is still available.\n\nIt's due to a packing plant fire, apparently.  One that only affects the more modern BGA packages.\n\n... guess who just did emergency redevelopment of two Xilinx designs to older Xilinx and TI DSPs?",
        "created_utc": 1633222334,
        "id": "hf611ec",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633251134.0
    },
    {
        "author": "kupka316",
        "body": "Can AMD and XLNX deal close already Jesus. Going to be sweating these calls all Fall",
        "created_utc": 1633491827,
        "id": "hfkbtw3",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633520627.0
    },
    {
        "author": "Hani95",
        "body": "Personally I like AMD through Xilinx arbitrage though I acknowledge the risk, TSM, Traditional financials, Alight, System1 (Still trebia but you can check their beat and raise in their investor relations), Paysafe even if their debt leverage is now pretty high which I’m leery of, FB, Microsoft and Apple if it goes lower, Razer if you’re OTC, and a few other tickers. Think hypergrowth still has a long slide down.",
        "created_utc": 1633541927,
        "id": "hfmnb6i",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633570727.0
    },
    {
        "author": "otakucode",
        "body": "Xilinx is the clear leader in their market segment, the biggest maker of FPGAs (which are like programmable hardware, with them you can turn code directly into hardware essentially) and business-wise they've been doing well for a long time.  They've also got a great software team (I'm personally hoping they let some of those guys rub off on AMDs GPU driver team...).  It'll be a great acquisition from that perspective.  From the perspective of investors, on the day the merger completes, every share of XLNX stock will turn into 1.72 shares of AMD.  But XLNX shares only cost as much as about 1.5 shares of AMD... and that price gap has been maintained ever since the 1.72 ratio was announced by hedge funds actively manipulating the market.  So why not ride along and get that free money?",
        "created_utc": 1634558854,
        "id": "hh3l1la",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634587654.0
    },
    {
        "author": "VaultBoy3",
        "body": "Hellllll no LMFAO\n\nBuying AMD and XLNX instead, they'll surpass Intel",
        "created_utc": 1634863903,
        "id": "hhk9ao6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634892703.0
    },
    {
        "author": "Paul_Ostert",
        "body": "The difference is that AMD acquiring Xilinx makes business sense.  Paypal buying a website is ridiculous.",
        "created_utc": 1634748942,
        "id": "hhdrezb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634777742.0
    },
    {
        "author": "Kindly-Somewhere-14",
        "body": "Amd will be 135. Why you people have no DD buying puts? Amd is growth company with solid earnings. Since intel beat up only thing that can go up is amd now. With xilinx deal coming close you guess what it will be",
        "created_utc": 1635140004,
        "id": "hhycrw1",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635168804.0
    },
    {
        "author": "dysenterygary69",
        "body": "Retards - for every share of $XLNX you own, you will exchange for 1.72 $AMD shares when the merger happens.  The merger has a 96-99% chance of happening and is forecast to occur by the end of this year.  The current share price is equivalent to buying $AMD for $100.  This is not financial advice.",
        "created_utc": 1635281271,
        "id": "hi5v6se",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635310071.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the 27th of October\n\n\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFI, AFL, AGI, AINC, AIT, AKO.A, AKO.B, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, AROW, ARR, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CAMT, CASH, CBD, CBTX, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CMRE, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FBC, FCNCA, FDBC, FDP, FIBK, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FPI, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HWKN, ICLR, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MXL, MYRG, NBN, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PB, PDM, PEGA, PGC, PGRE, PI, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.914M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.1%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -2.311M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.3%, previous: -2.0%)\n    - Gasoline Inventories (consensus: -1.862M, previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BCLI, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, HVT, HVT.A, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, LVO, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NOK, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPK, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RILY, RLGY, RMD, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SID, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, BSRR, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, SLG, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,415K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.7%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.5%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 290K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n## Upcoming events for Friday, October 29th\n\n - Expected earnings:\n\n  ABBV, ABR, AENZ, AON, AREC, ASIX, ASX, ATNM, ATRO, B, BAH, BBVA, BCH, BCPC, BELFA, BELFB, BLX, BSAC, CBOE, CCJ, CERN, CHD, CHT, CHTR, CL, COWN, CRI, CVX, DCOM, ECVT, ENIC, ENLV, ESXB, FNCB, FSFG, FTS, FUSB, GIGM, GRC, GWW, HUN, HWBK, IMGN, IMO, IRMD, IROQ, ITCB, JCS, LAZ, LEVL, LGND, LHX, LYB, MGI, MSEX, NECB, NICK, NOVN, NPK, NTP, NVO, NWFL, NWG, NWL, OIIM, OXLC, PEG, PFS, PHVS, PIPR, PLPC, PNM, POR, PSX, PSXP, RCL, ROLL, RUTH, SHLX, SIFY, SJR, SLCA, SNP, TTE, TWIN, TZOO, UBOH, UBSI, URG, UUUU, WETF, WPC, WY, XOM, ZNH\n\n - Ex-div:\n\n  ALLY, AON, ATLO, AVAL, BCBP, BK, BMO, BMTC, BX, C, CAG, CASY, CE, CZNC, DGICA, DGICB, DMLP, ENLC, EVTC, EWBC, HAS, HEP, HFBL, HIFS, KMI, KOF, KRP, LCUT, LNT, NRG, NVEC, OKE, ORRF, PAYX, PBCT, PLBC, PNM, PPBI, RBB, RVI, SAN, SGU, SPFI, STL, SXT, SYF, TKC, TXN, VALU, VOC, WES\n\n - Economic events and announcements:\n\n    - CFTC Aluminium speculative net positions (previous: 3.6K)\n    - CFTC Copper speculative net positions (previous: 40.6K)\n    - CFTC Corn speculative net positions (previous: 277.0K)\n    - CFTC Crude Oil speculative net positions (previous: 429.6K)\n    - CFTC Gold speculative net positions (previous: 193.3K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.1K)\n    - CFTC Natural Gas speculative net positions (previous: -131.1K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 67.6K)\n    - CFTC Silver speculative net positions (previous: 30.4K)\n    - CFTC Soybeans speculative net positions (previous: 43.5K)\n    - CFTC Wheat speculative net positions (previous: -8.6K)\n    - Chicago PMI (consensus: 63.5, previous: 64.7)\n    - Core PCE Price Index (consensus: 0.2%, previous: 0.3%)\n    - Core PCE Price Index (consensus: 3.7%, previous: 3.6%)\n    - Dallas Fed PCE (previous: 2.80%)\n    - Dallas Fed Services Revenues (previous: 14.0)\n    - Employment Benefits (previous: 0.40%)\n    - Employment Cost Index (consensus: 0.9%, previous: 0.7%)\n    - Employment Wages (previous: 0.90%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.80%)\n    - Michigan Consumer Expectations (previous: 67.2)\n    - Michigan Consumer Sentiment (consensus: 71.4, previous: 71.4)\n    - Michigan Current Conditions (previous: 77.9)\n    - Michigan Inflation Expectations (previous: 4.8%)\n    - PCE Price index (previous: 4.3)\n    - PCE price index (previous: 0.4%)\n    - Personal Income (consensus: -0.2%, previous: 0.2%)\n    - Personal Spending (consensus: 0.5%, previous: 0.8%)\n    - Real Personal Consumption (previous: 0.4%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 0.6%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (previous: 3.9%)\n    - Texas Services Sector Outlook (previous: 11.5)\n    - U.S. Baker Hughes Oil Rig Count (previous: 445)\n    - U.S. Baker Hughes Total Rig Count (previous: 543)\n\n^^^^2021-10-27",
        "created_utc": 1635328812,
        "id": "hi895vq",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635357612.0
    },
    {
        "author": "Anth916",
        "body": "Man, it does appear to be an absolute no brainer if you're super bullish on AMD.\n\nHowever, I'm in a particular scenario at the moment where I might not want to buy XLNX yet, and should try to wait a bit longer.\n\nBasically, I feel like a pretty significant market correction is going to happen the week of November 2nd with the next big Fed meeting. I think the market will be down pretty big in November and December.\n\nHalf of my portfolio is in cash. \n\nHalf of my portfolio is in play, and the reason it's still there is because I do believe there might be one more mini-bull rally before we get closer to November 2nd. My 2nd largest position is in AMD.\n\nMy plan is to try to milk whatever mini-bull rally happens prior to November 2nd. I see October 20th or 21st as the last chances to exit before everybody starts to get really nervous about November 2nd. Starting Monday, I only have about 8 or 9 more market days for half this portfolio.\n\nThen I might be jumping 100 percent to cash. This of course will be a temporary move, but I'm expecting November and December to just be months that most stock enthusiasts would like to forget. So, it's going to take a lot of discipline for me to hold out for the real lows that I'm expecting (at least 25 percent of all-time highs).\n\nBasically, I think when I buy back in either in November or December, I will load the boat with XLNX shares over AMD shares, but who knows if the spread will be as big then? Or maybe the merger will have been announced as final.",
        "created_utc": 1633709644,
        "id": "hfvazig",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633738444.0
    },
    {
        "author": "DontGetInjuredPls",
        "body": "No. AMD and Xilinx has agreed to the deal, but it need to be approved for the markets mentioned above. They currently function as separate companies, and will continue to do so if the merger is rejected. \n\nIt seems likely that it'll get approved though. Just waiting for China to green light it",
        "created_utc": 1633696042,
        "id": "hfuhckh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633724842.0
    },
    {
        "author": "golli123",
        "body": "I'd completely disagree with that. Since they actually don't manufacture their chips and instead rely on TSMC for doing so, they are actually limited by the shortage. \n\nThey have the better product compared to Intel especially in the hugely important server market. They are gaining market share, but the lack of supply actually saves their rival at the moment. Similarly they'd have no problem selling more CPUs in the laptop/desktop market, chips for the PS5 or hugely in demand GPUs (even though nvidia still has an edge there). \n\nThey'll also buy Xilinx, which adds some nice synergies with the FPGAs. I feel like they most of all need to work on their software and GPUs, but they kind of already have the product range that nvidia would like to achieve by purchasing ARM (which so far doesn't seem to happen).",
        "created_utc": 1633612279,
        "id": "hfq3jww",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633641079.0
    },
    {
        "author": "FunkMetal804",
        "body": "I have about 60% XLNX 40% AMD, so hopefully 100% AMD soon...",
        "created_utc": 1633461435,
        "id": "hfij9r3",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1633490235.0
    },
    {
        "author": "krzen",
        "body": "Yeah, it’s been pinned down by this whole xlnx merger thing for over a year with exception of that brief breakout after their last earnings so it’s a little more of a gamble. There’s just so much more upside it’s hard to resist. Lol",
        "created_utc": 1633609432,
        "id": "hfpy7xs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1633638232.0
    },
    {
        "author": "Anth916",
        "body": "Just a quick comment about AMD. I've traded the stock back and forth since February, and I can tell you that the stock was mostly not doing much of anything for long stretches, and then it finally had a big breakout, that pushed it above $100. This happened in this most recent 6 month period, so it seems like AMD is this outstanding performer in the most recent 6 months, but for 4 of those months, it didn't do much of anything.\n\nI still love AMD by the way. One of my favorite stocks going forward.\n\n(Pro Tip - If you plan on going LONG on AMD, with no plans to sell the stock in the next 90 days, then do yourself a huge favor and buy shares of XLNX instead of AMD. The merger has an 85 percent chance of being approved, and if so, you get 1.7234 shares of AMD for each share of XLNX. If you run the numbers right now, it's like buying an AMD share with a $12/$13 off per share coupon. However, if you plan to swing trade AMD, and you might be selling in the next 90 days, then it's better to stay with AMD shares for this purpose)",
        "created_utc": 1633794949,
        "id": "hfzs2og",
        "score": 1,
        "subreddit": "stocks",
        "created": 1633823749.0
    },
    {
        "author": "DontGetInjuredPls",
        "body": "I reckon there'll be some sell pressure initally, yea. Xilinx haven't paid dividends since the merger was announced, so they'll bring a decent chunk of cash. Current market cap for Xilinx and AMD is 39B + 128B. Please correct me if I'm wrong, but wouldn't their combined total value push more funds to pick them up? Scaled up production and synergy effects should so some work as well.\n\nI'm really not sure how the market will react, so it's just a wild guess from my side. Only been following AMD/Xilinx since the merger announcement",
        "created_utc": 1633972687,
        "id": "hg911ba",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634001487.0
    },
    {
        "author": "Hot-Bluebird3919",
        "body": "So when will the XLNX correction magically not happen?",
        "created_utc": 1634427207,
        "id": "hgx50zn",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634456007.0
    },
    {
        "author": "VisualMod",
        "body": "&gt; The Xilinx Inc. (XLNX) stock price is up 0.5% today, but down -0.2% over the past week and down -1.3% over the past month...",
        "created_utc": 1634427223,
        "id": "hgx5297",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634456023.0
    },
    {
        "author": "OkTop5487",
        "body": "I held AMD from high 80s and sold it at 116 in the beginning of August. Bought Xilinx with what I made and holding through till the merger. For the past few months Xilinx has been moving with AMD so think you will get the same exposure but obviously with the risk of the merger not happening.",
        "created_utc": 1634494693,
        "id": "hh0gmfi",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634523493.0
    },
    {
        "author": "forshakuras",
        "body": "About 50% or so. Memes and AMD/XLNX doing the hard work.",
        "created_utc": 1634676177,
        "id": "hha2beu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1634704977.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 25th of October\n\n\n\n## Upcoming events for Monday, October 25th\n\n - Stock splits:\n\n    - DPST @ **5:1** (Payable date: 10/22/2021)\n    - RETL @ **5:1** (Payable date: 10/22/2021)\n    - TECS @ **1:10**\n    - DRV @ **1:10**\n\n - Expected earnings:\n\n  ACC, AGNC, AIN, AJRD, AMG, AMKR, ARE, ARI, ARLP, AUB, AXTA, BDN, BMRC, BOH, BRO, BSRR, BXS, CAJ, CALX, CATY, CBNK, CBU, CCK, CDNS, CFBK, CIZN, CLDB, CPSS, CR, CWBC, DORM, DSS, EC, EFSC, FB, FBMS, FBNC, FBP, FEDU, FLXS, FSBC, FSBW, GABC, GAME, HBT, HMST, HNI, HOPE, HSII, HSTM, HTLF, IBTX, JBSS, KMB, KOF, KREF, LII, LKFN, LOGI, LSBK, LXFR, MEDP, MEDS, MNOV, MRBK, MSVB, NEU, NRIM, NWBI, OI, ONVO, OPOF, OTIS, PCH, PEBK, PETS, PKG, PRK, PWOD, QSR, RBB, RNR, SAN, SCCO, SITC, SLP, SMBC, SSD, SUI, TBI, TCBK, TGB, TIMB, TNET, TZOO, UFI, UHS, WASH\n\n - Ex-div:\n\n  APOG, CRS, CVLY, FAST, RY\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.055%)\n    - 6-Month Bill Auction (previous: 0.060%)\n    - Chicago Fed National Activity (previous: 0.29)\n    - Dallas Fed Mfg Business Index (previous: 4.6)\n    - Investing.com Gold Index (actual: 54.3%, previous: 58.4%)\n    - Investing.com S&amp;P 500 Index (actual: 47.2%, previous: 62.3%)\n\n## Upcoming events for Tuesday, October 26th\n\n - Expected earnings:\n\n  AAN, AAT, ABG, ACCO, ACH, ACU, ADM, AGR, AGYS, AHT, AKO.A, AKO.B, AKR, AMD, AMP, APAM, ARCC, ARCH, AUDC, AWI, AWRE, BEN, BGFV, BSBR, BUSE, BXP, BYD, CAC, CB, CCB, CCBG, CCNE, CEQP, CHRW, CIT, CLS, CMRE, CNC, COF, CSGP, CVLT, CZOO, CZWI, DALN, DAN, DHIL, DLR, EBMT, ECL, EDU, EGP, ENPH, ENTG, EQR, ESS, FBHS, FCBC, FCF, FCPT, FELE, FFIC, FFIV, FFNW, FFWM, FIBK, FRAF, FRBA, FRME, FSV, GBX, GE, GIC, GLW, GOOG, GOOGL, GPK, HA, HAFC, HAS, HBCP, HFBL, HIW, HNP, HONE, HOOD, HPP, HRZN, HSBC, HT, HUBB, HZO, IBCP, IEX, INMD, IVZ, JBLU, JNPR, KAI, LBAI, LBC, LBRT, LFUS, LLY, LMT, MANH, MASI, MKL, MMM, MMYT, MSCI, MSFT, MTDR, MYOV, NAVI, NBR, NBTB, NCR, NETI, NOV, NVS, OMAB, OVBC, OXSQ, PCAR, PCB, PEBO, PERI, PFG, PHM, PII, PJT, PNR, PROV, QS, QURE, RARE, RCKY, RNDB, ROIC, RRC, RRD, RTX, SBSI, SEB, SFBC, SFNC, SFST, SHW, SPFI, SPGI, SSTK, ST, TECK, TENB, TER, TPB, TRMK, TRTN, TRU, TTM, TWOU, TWTR, TXN, UBCP, UBS, UDR, UMBF, UPS, USNA, UTMD, V, VBTX, WIRE, WM, WNEB, WRLD, WSBC, WSR, XRX, ZWS\n\n - Ex-div:\n\n  AM, ATR, CLX, CMC, DNUT, ENTG, INFY, PSEC\n\n - Economic events and announcements:\n\n    - 2-Year Note Auction (previous: 0.310%)\n    - API Weekly Crude Oil Stock (previous: 3.294M)\n    - CB Consumer Confidence (consensus: 108.8, previous: 109.3)\n    - Dallas Fed Services Revenues (previous: 14.5)\n    - House Price Index (previous: 1.4%)\n    - House Price Index (previous: 19.2%)\n    - House Price Index (previous: 348.4)\n    - New Home Sales (consensus: 755K, previous: 740K)\n    - New Home Sales (previous: 1.5%)\n    - Redbook (previous: 15.4%)\n    - Richmond Manufacturing Index (previous: -3)\n    - Richmond Manufacturing Shipments (previous: -1)\n    - Richmond Services Index (previous: -3)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 1.5%, previous: 1.5%)\n    - S&amp;P/CS HPI Composite - 20 n.s.a. (consensus: 20.1%, previous: 19.9%)\n    - S&amp;P/CS HPI Composite - 20 s.a. (consensus: 1.4%, previous: 1.5%)\n    - Texas Services Sector Outlook (previous: 8.3)\n\n## Upcoming events for Wednesday, October 27th\n\n - Expected earnings:\n\n  ACBI, ACGL, ACNB, ADP, AEM, AEMD, AFL, AGI, AINC, AIT, ALG, ALGN, ALGT, ALKS, ALRS, ALSN, AM, AMSF, APH, AR, ARES, ASGN, ATNI, AVB, AVID, AVY, AXS, AXTI, AZPN, BA, BCO, BCOV, BFIN, BG, BHE, BHR, BMRN, BMY, BOOT, BRKL, BSM, BSX, BWFG, BXMT, CACI, CAMT, CASH, CBD, CCS, CDE, CHDN, CHEF, CHX, CINF, CIVB, CLB, CME, CMPR, CNMD, CNO, COFS, CONE, CPF, CPSH, CRSP, CSTM, CSV, CTS, CTSH, CUBI, CX, CYBE, CYH, DB, DGICA, DGICB, DMRC, DRE, DRVN, DT, DTE, DX, E, EAT, EBAY, ECHO, EHC, ENSG, EQC, EQT, ESI, ESRT, ETD, EVR, EVTC, EW, EXR, F, FARO, FCNCA, FDBC, FDP, FISV, FIX, FLEX, FLOW, FLS, FMNB, FNWB, FORM, FRBK, FRTA, FWRD, GD, GGB, GHM, GLOP, GM, GORO, GRMN, GSHD, GSK, GTY, HAYW, HBNC, HEES, HES, HESM, HLT, HOG, HVT, HVT.A, HWKN, IBA, ILPT, INOV, INVA, INVH, IP, IRBT, IRT, ISBC, IVC, JAKK, JBT, JMP, JOE, KHC, KLAC, KN, KO, KRA, KRC, KRNY, LARK, LC, LEXX, LOB, MAA, MAS, MBIN, MC, MCD, MEOH, MHH, MHO, MKSI, MN, MNRO, MOH, MORN, MPX, MSA, MTH, MUSA, MYRG, NDLS, NFBK, NGVT, NLY, NMR, NOA, NOVA, NOW, NSC, NSR, NTB, NTGR, NYCB, OBNK, OC, ODFL, ODT, OII, ONCS, ORLY, ORN, PAG, PAYA, PB, PDM, PEGA, PGC, PGRE, PI, PINS, PLXS, PPC, PPD, PW, QCRH, R, RBBN, RDY, RE, RES, RIBT, RJF, ROCK, ROL, RVPH, RWT, SAVE, SC, SCI, SF, SIGI, SIM, SIMO, SIX, SLAB, SLGN, SMED, SMP, SNBR, SONY, SP, SPOK, SPOT, SREV, SRI, SSB, SSBI, STC, STCN, STLA, STXB, SU, SYBT, TDOC, TDY, TEL, TESS, TEVA, THFF, THG, TMHC, TMO, TNL, TROX, TTMI, TWLO, TYL, UCTT, UEC, UMC, UPWK, URI, USLM, UTHR, UVE, UVSP, VALE, VGZ, VICI, VIST, VKTX, VMAR, VNDA, VRT, VRTS, VSEC, WAB, WCN, WFG, WH, WHG, WOLF, XLNX, YNDX, YUMC, ZDGE, ZVO\n\n - Ex-div:\n\n  BPMP, COP, FRC, KNOP\n\n - Economic events and announcements:\n\n    - 5-Year Note Auction (previous: 0.990%)\n    - Core Durable Goods Orders (consensus: 0.4%, previous: 0.3%)\n    - Crude Oil Imports (previous: -0.715M)\n    - Crude Oil Inventories (consensus: 1.857M, previous: -0.431M)\n    - Cushing Crude Oil Inventories (previous: -2.320M)\n    - Distillate Fuel Production (previous: -0.289M)\n    - Durable Goods Orders (consensus: -1.0%, previous: 1.8%)\n    - Durables Excluding Defense (previous: 2.4%)\n    - EIA Refinery Crude Runs  (previous: -0.071M)\n    - EIA Weekly Distillates Stocks (consensus: -0.700M, previous: -3.913M)\n    - EIA Weekly Refinery Utilization Rates (previous: -2.0%)\n    - Gasoline Inventories (previous: -5.368M)\n    - Gasoline Production (previous: 0.455M)\n    - Goods Orders Non Defense Ex Air (consensus: 0.5%, previous: 0.6%)\n    - Goods Trade Balance (previous: -88.16B)\n    - Heating Oil Stockpiles (previous: 0.037M)\n    - MBA 30-Year Mortgage Rate (previous: 3.23%)\n    - MBA Mortgage Applications (previous: -6.3%)\n    - MBA Purchase Index (previous: 266.2)\n    - Mortgage Market Index (previous: 643.0)\n    - Mortgage Refinance Index (previous: 2,807.9)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Wholesale Inventories (previous: 1.2%)\n\n## Upcoming events for Thursday, October 28th\n\n - Stock splits:\n\n    - SSBI @ **110:100** (Payable date: 11/04/2021)\n\n - Expected earnings:\n\n  AAPL, AB, ABCB, ABMD, ABTX, ACHC, ADS, AEP, AGCO, AGL, AIRC, AJG, ALDX, ALGM, ALIM, ALNY, AMAL, AMT, AMZN, AOS, AQMS, ARGX, ASPN, ASR, ATEN, ATI, ATOM, ATR, AUY, AVNT, AVT, AVTR, AX, BAX, BC, BIO, BIO.B, BPMC, BSIG, BSMX, BTU, BVN, BWMX, BY, CARR, CAT, CBRE, CBTX, CBZ, CDNA, CFFN, CFR, CG, CHE, CHKP, CLVT, CMCO, CMCSA, CMS, CNOB, CNSL, CNX, CODI, COHU, COLB, COLM, COOP, COR, CPG, CPT, CRS, CTO, CUZ, CVEO, CVLY, CWST, CWT, DAIO, DBD, DECK, DQ, DRQ, DVA, DVD, DXCM, EB, EBC, EGO, EIG, EME, EMN, ENVA, ERIE, EVBN, EVLO, EXP, EXPO, FBIZ, FCN, FE, FHI, FISI, FLWS, FMX, FRST, FTAI, FTDR, FTV, FVCB, GILD, GLPI, GNCA, GPI, GSIT, GTX, GVA, GWB, HBAN, HIG, HLI, HSY, HTBK, HTGC, HTH, HUBG, ICE, IDA, IMAX, INSM, INT, ITGR, ITW, JHG, KBR, KDP, KEX, KMPR, KNSL, KRG, LADR, LAWS, LECO, LH, LIN, LKQ, LMAT, LOPE, LPLA, LTC, LTH, MA, MAYS, MCBC, MCO, MD, MDC, MDP, MERC, MGRC, MHK, MIXT, MMSI, MO, MPW, MPWR, MRK, MSBI, MSTR, MTLS, MVIS, NATI, NEM, NKSH, NLSN, NOC, NTST, NVCR, NVT, NXGN, OCFC, OFC, OPBK, OPI, OPRA, ORC, ORI, OSIS, OSK, OSTK, PACK, PATK, PBF, PBFX, PEB, PFC, PFHD, POLY, POWI, PRFT, PRLB, PSB, PTCT, PTEN, PVBC, QUMU, RDS.A, RDS.B, RGEN, RLGY, RMD, RNGR, RNST, RS, RSG, SAH, SAIA, SBCF, SBFG, SBUX, SCM, SGEN, SHBI, SHEN, SHOP, SILC, SIRI, SJW, SKX, SKYW, SM, SMMF, SNDR, SNY, SPNE, SPSC, SSNC, STAG, STM, SVBI, SWI, SWK, SYK, TAL, TAP, TAP.A, TARO, TBBK, TEAM, TEX, TFII, TFX, THRM, TIGO, TOWN, TPX, TREE, TRS, TV, TVTX, TW, TXRH, TXT, ULBI, ULH, USAK, USCB, VC, VCRA, VLY, VRSN, WDC, WERN, WEX, WLTW, WNS, WRAP, WRE, WST, WTBA, X, XEL, YUM, ZEN\n\n - Ex-div:\n\n  AA, ACI, ADC, AGNC, AOS, ARC, BRMK, CARR, CFG, CIT, COST, CRT, CSWI, DCP, DNP, DSX, EARN, EFC, EPD, EPR, FERG, FT, GEL, GRP.U, HMLP, KFFB, LEVI, LND, MAIN, MS, MSB, NI, NNN, NWN, ORC, OSBC, OVBC, PAA, PAGP, PBT, PRT, PSXP, PVL, PZN, RBNC, SBNY, SCHL, SCM, SIG, SJT, SKT, STAG, TRGP, UNB, UNM, VRTS, WHF, ZTS\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.050%)\n    - 7-Year Note Auction (previous: 1.332%)\n    - 8-Week Bill Auction (previous: 0.100%)\n    - Continuing Jobless Claims (consensus: 2,445K, previous: 2,481K)\n    - Core PCE Prices (consensus: 4.50%, previous: 6.10%)\n    - GDP (consensus: 2.8%, previous: 6.7%)\n    - GDP Price Index (consensus: 5.4%, previous: 6.2%)\n    - GDP Sales (previous: 8.1%)\n    - Initial Jobless Claims (consensus: 292K, previous: 290K)\n    - Jobless Claims 4-Week Avg. (previous: 319.75K)\n    - KC Fed Composite Index (previous: 22)\n    - KC Fed Manufacturing Index (previous: 10)\n    - Natural Gas Storage (consensus: 90B, previous: 92B)\n    - PCE Prices (previous: 6.5%)\n    - Pending Home Sales (consensus: 0.5%, previous: 8.1%)\n    - Pending Home Sales Index (previous: 119.5)\n    - Real Consumer Spending (previous: 12.0%)\n\n^^^^2021-10-25",
        "created_utc": 1635156012,
        "id": "hhyvgab",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1635184812.0
    }
]