[
    {
        "author": "schittluck",
        "body": "Cramer loves skyworks",
        "created_utc": 1620562598,
        "id": "gxhnwd7",
        "permalink": "/r/wallstreetbets/comments/n8coni/skyworks_expands_into_automotive_semiconductor/gxhnwd7/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620591398.0
    },
    {
        "author": "toydan",
        "body": "#BTFD \n\nThe past 6-8 weeks I have bought 100s of shares of mostly what I already owned and on red days. I often sort by % gain that day and scroll down and pick up some of the laggards. Day after day of AAPL TSLA MSFT GOOG UWMC WBA SWKS QCOM TGT XOM MO HD WMT and on and on. I believe in all my positions. \n\nDuring this same time frame I have loaded up in like over 50+ LEAPS in PLTR NIO TSLA SoFi TTCF NNDM MU AMD ARKF DKNG BABA Z off the top of my head. \n\nOnly time will tell if these were the right plays. I post most of plays and effort to be transparent for all to see and judge. It is not easy to buy the dips as your portfolio bleeds, but scared money don’t make money. \n\nGood luck-it’s crazy out there!",
        "created_utc": 1621903447,
        "id": "gzc64g3",
        "permalink": "/r/wallstreetbets/comments/nk6ucy/what_are_your_moves_tomorrow_may_25_2021/gzc64g3/",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1621932247.0
    },
    {
        "author": "toydan",
        "body": "Today’s moves:\n\n$TSLA rolled a CSP down and out for $475 and picked up more shares under $600.\n\nAdded to following positions in dividend Acct: UPS ABBV MO WBA QCOM SWKS T XOM MSFT AAPL UWMC\n\nPicked up more GOOG and sold a CC over VALE\n\nITM LEAPS on DKNG CRWD MU PLTR\n\nThis is me and my risk tolerance. Just posting for the haters and I know many others irl doing the same. I am in this for the next 30 years.\n\nSell if you need to. Play your hand. Good luck.\n\n✌️\n\nEdit posted this earlier. Over 30 trades. All buys and no sells. I am happy with all of them. Some may be down tomorrow. That is ok. \n\nHope you had a great day.",
        "created_utc": 1620778633,
        "id": "gxso2vi",
        "permalink": "/r/wallstreetbets/comments/na65ti/what_are_your_moves_tomorrow_may_12_2021/gxso2vi/",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620807433.0
    },
    {
        "author": "jonahsrevenge",
        "body": "CRM, and NOW are undervalued (Morningstar 4-star).  MSFT is solid and maybe a bit undervalued.  ADBE  OKTA and SWKS are probably undervalued (Morningstar 3-star but selling below their fair value estimate). \n\nLong all named.",
        "created_utc": 1621444480,
        "id": "gypwcr5",
        "permalink": "/r/stocks/comments/ng9v2p/are_tech_stocks_still_overpriced/gypwcr5/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1621473280.0
    },
    {
        "author": "marioistic",
        "body": "SWKS dip is big.. \nMight buy leaps on Boeing TSM MU AMAT\nPLTR and SKLZ cheap af rn",
        "created_utc": 1620007610,
        "id": "gwqijlv",
        "permalink": "/r/wallstreetbets/comments/n3ekxx/what_are_your_moves_tomorrow_may_03_2021/gwqijlv/",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1620036410.0
    },
    {
        "author": "Diaper_Gravy",
        "body": "Are you saying 1000% in 2/3 years isn’t possible or are you saying its not possible for this company? Tons of companies have grown 1000% in 3 years. Check out Skyworks’ growth in its earlier years when it was around $5. What makes you know more information about the current climate of the EV semiconductor business versus a company that has been in the business for 10+ years? Maybe they have data/contracts that are disclosed, that help support their claim of a secured $2billion in deals. Or maybe they are understanding the exponential growth in the EV sector within this next 2/3 years and have been ramping up supply and projections. \n\nI hear your argument but dont find it more valid then the information presented to me from this SPAC",
        "created_utc": 1620278016,
        "id": "gx49ea3",
        "permalink": "/r/SPACs/comments/n5mv40/thunder_bridge_acquisition_ii_ltd_thbr_files/gx49ea3/",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1620306816.0
    },
    {
        "author": "motterpaul",
        "body": "I had TDOC and SWKS short at the open and was doing well even though I also had a few longs, but I covered my shorts when I thought the Nazgul was going to recover. Covered too soon, they went lower.\n\nI do think my AMZN has bottomed out. NasD has lost a lot since 2:15 but AMZN is still solid. I might buy another share here.",
        "created_utc": 1620672392,
        "id": "gxn15c0",
        "permalink": "/r/wallstreetbets/comments/n90t4p/daily_discussion_thread_for_may_10_2021/gxn15c0/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620701192.0
    },
    {
        "author": "happierdayz4me3",
        "body": "Skyworks better get above 200 asap. Lost a weeks profit on friday.",
        "created_utc": 1619980982,
        "id": "gwp2jca",
        "permalink": "/r/wallstreetbets/comments/n3cqdc/several_opportunities_for_options_gains/gwp2jca/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620009782.0
    },
    {
        "author": "WoodpeckerAlarmed239",
        "body": "New Positions: QCOM- down 19% right now\n\nKMI- up 23%\n\nMO- **Sold already** for 6% gain. scared off by nicotine limit talks.\n\nGS- **Sold already** for 9% gain. Smaller position, used $ for another.\n\nINTC- down 13% \n\nKLIC- down 1%\n\nHeld positions: SWKS- up 65% even after the recent drop\n\nLMT- up 6%\n\nAAPL- up 155% even after the drop\n\nCSCO- up 8%\n\n\n\nTotal Potfolio: up 21%\n\nAll my tech from this year is obviously down, while the oil pipeline is doing well.\n\nI'm having second thoughts about selling MO after seeing the $100 dividend in the last quarter. But I'm really worried biden is going to do some more stupid stuff like raise taxes to unreasonable numbers.",
        "created_utc": 1621511840,
        "id": "gyt96jq",
        "permalink": "/r/ValueInvesting/comments/ngm9y0/share_your_personal_13f/gyt96jq/",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1621540640.0
    },
    {
        "author": "kkInkr",
        "body": "SMH, ADI, AMAT, ASML, ATEYY, AVGO, HIMX, INTT,  KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI,  PXLW, QCOM, QRVO, SIMO, SWKS, TER,\n\nbesides the usual AMD, INTC, NVDA, and TSM. Those 4 imo are outdated.  SMH is the ETF.\n\nCircuitry, CDNS, SNPS, ANSS, they are being ignored, but have dominant roles, imo.",
        "created_utc": 1619900068,
        "id": "gwkwyeo",
        "permalink": "/r/stocks/comments/n2705g/best_sector_for_the_next_5_years/gwkwyeo/",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619928868.0
    },
    {
        "author": "Immediate-Assist-598",
        "body": "Skyworks is one of the most oversold stocks in the market now considering its strategic position and value.  They were at 205 a few weeks ago and now 165 on no particular news. And the Apple chips are not going to affect them.  AAPL itself is also a buy today but I figure more bang for the buck with Skyworks so I am selling some T and VZ (my parking places for cash) and buying SWKS and will buy more tomorrow if it sinks any further. Last time there was a big tech sell-off SWKS bottomed around 165 so this may be the extent of it",
        "created_utc": 1620676285,
        "id": "gxnadsu",
        "permalink": "/r/wallstreetbets/comments/n8coni/skyworks_expands_into_automotive_semiconductor/gxnadsu/",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620705085.0
    },
    {
        "author": "Dampish10",
        "body": "Awesome thanks for picking a stock :)\n\nis this a \"Buy 1 now and wait for a drop\" type of thing? or wait for a drop and buy a few?  \n\n\nPortfolio so far:\n\n* ENB (Enbridge)\n* SWKS,\n* SRU.UN (Smart Centers/30% Walmart Canada)\n*  [LIF.TO](https://LIF.TO)\n* VZ\n* SPY (maybe)\n* TXF ( Tech Giant ETF)\n* BNS",
        "created_utc": 1621322794,
        "id": "gyjkx2e",
        "permalink": "/r/Wallstreetbetsnew/comments/nf2al8/you_vs_me_you_have_1000_choose_a_dividend_stock/gyjkx2e/",
        "score": 2,
        "subreddit": "Wallstreetbetsnew",
        "created": 1621351594.0
    },
    {
        "author": "toydan",
        "body": "I picked up more $SWKS Friday. Also decided to get back in $MU w 2023 @ $75 tomorrow. About only trade I plan to make other some CCs",
        "created_utc": 1620008585,
        "id": "gwqkabk",
        "permalink": "/r/wallstreetbets/comments/n3ekxx/what_are_your_moves_tomorrow_may_03_2021/gwqkabk/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620037385.0
    },
    {
        "author": "toydan",
        "body": "Decent. Most have been in my boomer plays. Have added a lot to SWKS AAPL MSFT XOM WBA UWMC MO HD TGT etc. some other riskier ones too.",
        "created_utc": 1621828569,
        "id": "gz8ke8r",
        "permalink": "/r/wallstreetbets/comments/njfshj/what_are_your_moves_tomorrow_may_24_2021/gz8ke8r/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621857369.0
    },
    {
        "author": "futbolito112000",
        "body": "I think Broadcom, Skyworks, and Ncino do well. Would be interesting to see how C3.Ai does as I am curious on that one. Express had a huge move this week since retail has been doing well and wonder if it can go a bit more.",
        "created_utc": 1622310509,
        "id": "gzw42se",
        "permalink": "/r/options/comments/nnmf4f/most_anticipated_earnings_releases_for_the_week/gzw42se/",
        "score": 1,
        "subreddit": "options",
        "created": 1622339309.0
    },
    {
        "author": "toydan",
        "body": "MU QCOM SWKS TXN. Would like to get back into $SOXL too honestly.",
        "created_utc": 1621343770,
        "id": "gykcxka",
        "permalink": "/r/wallstreetbets/comments/nf6oeg/daily_discussion_thread_for_may_18_2021/gykcxka/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621372570.0
    },
    {
        "author": "TheBoom129",
        "body": "Guys and gal this is just something I found looking at the option chart.  if ya buy or sell, best of luck. Thought I would share it here to see whether other saw the same thing I did when looking at the option chart on Ma and Swks nothing more &amp; nothing less. I am sure as hell not telling anyone what to do.",
        "created_utc": 1619982702,
        "id": "gwp6nno",
        "permalink": "/r/wallstreetbets/comments/n3cqdc/several_opportunities_for_options_gains/gwp6nno/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620011502.0
    },
    {
        "author": "moolium",
        "body": "I'm risk adverse myself,  I always liked swks, but I bought intel after the drop.  They are trading cheap l, the consensus is that they're the loser of the group, I'm betting against the grain.  With the new ceo and working towards new foundries in the next decade,  I'm treating them as a growth company currently at 10x earnings.  Right now in the market that's hard to find. We'll see.",
        "created_utc": 1619995594,
        "id": "gwpwhzh",
        "permalink": "/r/stocks/comments/n3gkmr/electric_utilities_as_an_ev_play/gwpwhzh/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620024394.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Friday, the 14th of May\n\n\n\n## Upcoming events for Friday, May 14th\n\n - Stock splits:\n\n    - CP @ **5:1** (Payable date: 05/13/2021)\n    - MSBC @ **105:100** (Payable date: 06/01/2021)\n\n - Expected earnings:\n\n  AENZ, ANAT, ANDA, ARGX, BKYI, BOMN, BPTH, CLSN, CLVR, DSEY, DUO, EVK, FMTX, FREE, GB, GBNH, GTT, HOFV, HYMC, ITRM, LGVN, LMB, LMPX, LORL, MLND, NEN, PLX, PLXP, SACH, SLDB, SOGO, SOHU, STRR, TGS, UUUU, VSTA, WYY, XPL\n\n - Ex-div:\n\n  ABC, AFT, AIF, ALSN, AMGN, ARR, AWR, BCO, BGFV, BLX, BOKF, CC, CF, CLDB, CNA, CNOB, CNS, COF, CSL, DLB, EDF, EDI, EEA, GF, GGAL, GIM, GLOG, GNK, GPRK, HIW, HP, HR, HTLF, IHIT, IHTA, IOSP, JEF, KKR, KLAC, KMPR, LPX, MMD, MNR, MSA, MUR, MUSA, NRP, NVEC, OAS, OGS, OMP, PACW, PFLT, PFSI, POOL, RGR, RILY, ROK, SBR, SBRA, SMP, SO, SOR, SRV, STK, SWX, SYX, SZC, TECH, TEI, TROX, UI, UIHC, UMH, VBF, VLO, VTA, VVR, WSTG\n\n - Economic events and announcements:\n\n    - Business Inventories (consensus: 0.3%, previous: 0.5%)\n    - CFTC Aluminium speculative net positions (previous: 3.1K)\n    - CFTC Copper speculative net positions (previous: 53.8K)\n    - CFTC Corn speculative net positions (previous: 536.1K)\n    - CFTC Crude Oil speculative net positions (previous: 500.0K)\n    - CFTC Gold speculative net positions (previous: 170.7K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -16.8K)\n    - CFTC Natural Gas speculative net positions (previous: -55.8K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -33.8K)\n    - CFTC Silver speculative net positions (previous: 47.9K)\n    - CFTC Soybeans speculative net positions (previous: 247.6K)\n    - CFTC Wheat speculative net positions (previous: 28.0K)\n    - Capacity Utilization Rate (consensus: 75.0%, previous: 74.4%)\n    - Core Retail Sales (consensus: 0.7%, previous: 8.4%)\n    - Export Price Index (consensus: 0.6%, previous: 2.1%)\n    - Import Price Index (consensus: 0.6%, previous: 1.2%)\n    - Industrial Production (consensus: 1.0%, previous: 1.4%)\n    - Industrial Production (previous: 1.02%)\n    - Manufacturing Production (consensus: 0.4%, previous: 2.7%)\n    - Michigan 5-Year Inflation Expectations (previous: 2.70%)\n    - Michigan Consumer Expectations (consensus: 85.0, previous: 82.7)\n    - Michigan Consumer Sentiment (consensus: 90.4, previous: 88.3)\n    - Michigan Current Conditions (consensus: 99.6, previous: 97.2)\n    - Michigan Inflation Expectations (previous: 3.4%)\n    - Retail Control (consensus: -0.2%, previous: 6.9%)\n    - Retail Inventories Ex Auto (previous: 0.6%)\n    - Retail Sales (consensus: 1.0%, previous: 9.7%)\n    - Retail Sales (previous: 27.85%)\n    - Retail Sales Ex Gas/Autos (previous: 8.2%)\n    - U.S. Baker Hughes Oil Rig Count (previous: 342)\n    - U.S. Baker Hughes Total Rig Count (previous: 440)\n\n## Upcoming events for Monday, May 17th\n\n - Stock splits:\n\n    - SOMC @ **2:1** (Payable date: 05/14/2021)\n\n - Expected earnings:\n\n  AAMC, ACRX, ACTG, ADMP, AESE, AGBA, AGTC, ALAC, ALHC, ALT, ALUS, APPH, ATCX, ATEX, ATXI, AUVI, AYTU, BATL, BMTX, BPT, BRFS, BSGM, CELP, CERE, CLOV, CLSD, COE, COMS, CRBP, CREX, CRT, CVM, CWBR, CWCO, CYCN, DM, DNMR, DRIO, EBIX, EDRY, ELSE, ENIC, ENLV, ENOB, FBIO, FGBI, FONR, FORA, FSR, FSTX, FUV, GALT, GAN, GENC, GNUS, GOEV, GSM, GSMG, GVP, HPK, HQI, HSDT, IBIO, IDEX, INVO, LEV, LMFA, LOV, LUNA, MARK, MBIO, MILE, MLSS, MMAC, MSGM, MTEM, MVO, NAT, NDRA, NEXT, NIU, NTCO, NVVE, OCX, OEG, OMEX, ONDS, ONVO, PBT, PCT, PCYG, PFX, PIRS, PME, PRCH, PRPL, PRTK, PSHG, PSTI, PVL, QRHC, RAIL, RCMT, REED, RIDE, RIOT, RKDA, RMBL, RMTI, RVPH, RYAAY, SCYX, SGBX, SJT, SNMP, SONN, SRAX, SVVC, SYTA, THCA, THCB, TLS, TMDI, TME, TOMZ, TPHS, TWNK, USWS, VEI, VERO, VHC, VOC, VRRM, VTSI, WF, XBIT, XL, XONE, XSPA, ZH\n\n - Ex-div:\n\n  ADX, BC, BKH, CSTE, ESXB, FMBH, GGB, HRZN, IBA, NHTC, ORA, PEO, PROV, PTVCA, PTVCB, RGA, SCU, SHYF, SMM, SSSS, SWKS, UMPQ, VCIF, WWD, XFLT\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.015%)\n    - 6-Month Bill Auction (previous: 0.035%)\n    - NAHB Housing Market Index (consensus: 84, previous: 83)\n    - NY Empire State Manufacturing Index (consensus: 22.55, previous: 26.30)\n    - Overall Net Capital Flow (previous: 72.60B)\n    - TIC Net Long-Term Transactions (previous: 4.2B)\n    - TIC Net Long-Term Transactions including Swaps (previous: -38.00B)\n    - US Foreign Buying, T-bonds (previous: -65.50B)\n\n^^^^2021-05-14",
        "created_utc": 1620986415,
        "id": "gy2yz6v",
        "permalink": "/r/RobinHood/comments/nc4ysd/daily_discussion_thread_may_14th_2021/gy2yz6v/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1621015215.0
    },
    {
        "author": "ReaditB4Bomber",
        "body": "Yeah gonna sell some boeing to double down on my higher conviction stocks like AMD and might buy skyworks on the dip as well😋",
        "created_utc": 1620061966,
        "id": "gwsytkb",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwsytkb/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620090766.0
    },
    {
        "author": "Old-Worldliness7713",
        "body": "well give us some gifts of reason.  because im down a few thousand today.  even things that are not tech like carrier globle, FNGU, zillow, amazon, skyworks,MP, sunpower, even advertisement such as pubmatic,magnite, digital turnbine,  nothing is green.  so guild me  old mystical one",
        "created_utc": 1620057639,
        "id": "gwsolrf",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwsolrf/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620086439.0
    },
    {
        "author": "Immediate-Assist-598",
        "body": "All tech is selling off today providing an excellent short-term buying opportunity as there is no rational reason for it other than just following the herd.  What I look for are dominant companies with secure moats and amazing earnings which are not overvalued, do not have a sky-high PE and which pay a dividend.   There are only a few stocks like this and at the top of that list is AAPL.  True many stocks, mostly young companies on the move, will outperform AAPL.  Some will double, triple, quadruple, and AAPL's days of quadrupling are likely over but capital preservation and security is just as important as capital appreciation, and especially if you have already made all or most of the money you need, I recommend AAPL as a safe longterm investment or temporary parking place. Eventually and maybe very soon it will resume its upward track but for now even a sell-off day like today is quite modest and unlikely to continue for more than another day or two, which means today and tomorrow might be the best times to buy AAPl and any of its suppliers like Skyworks which has been getting hammered for several weeks now.  In fact I bought more SKWS today at 167 and will buy again and again perhaps even on margin if it keeps selling off.  For if there is one secure product line in the world now it is the iPhone and everything it is made up and offers.  And unlike most stocks, AAPl has already proven with spectacular earnings that is is undervalued. And yes all stocks and investments entail risk, but with AAPl is it minimal and short-lived, and the trajectory is still up with no competition in its lane. And as for the Epic lawsuit, I have read a detailed legal analysis and would not fear them much.  I believe they will lose (because Netflix left the Ap Store and thrived) and even if they do win one round, Apple will keep on appealing and fighting this for years. Also, if congress  ever forced Apple to break up (will never happen but who knows?) that will actually unlock even more value.",
        "created_utc": 1620675487,
        "id": "gxn8hr6",
        "permalink": "/r/options/comments/muz0ac/the_blood_bath_todayat_one_point_my_aapl_calls_my/gxn8hr6/",
        "score": 1,
        "subreddit": "options",
        "created": 1620704287.0
    },
    {
        "author": "PunctualDealer",
        "body": "I know they are a CM. What I am saying is they occupy different spaces. SWKS designs and manufactures RFICs, iPhones and playstations all have multiple SWKS chips already. My question wasn’t based on my unfamiliarity with TSMC, rather they are not direct comparisons.",
        "created_utc": 1620594316,
        "id": "gxjd6my",
        "permalink": "/r/wallstreetbets/comments/n8coni/skyworks_expands_into_automotive_semiconductor/gxjd6my/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620623116.0
    },
    {
        "author": "moolium",
        "body": "You can buy a company like swks now they  acquired silicon labs. You can play EV more broad by the semi conductors that they'll all need to use and save yourself from having to pick the winners.",
        "created_utc": 1619992258,
        "id": "gwppxfx",
        "permalink": "/r/stocks/comments/n3gkmr/electric_utilities_as_an_ev_play/gwppxfx/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620021058.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the 17th of May\n\n\n\n## Upcoming events for Monday, May 17th\n\n - Stock splits:\n\n    - SOMC @ **2:1** (Payable date: 05/14/2021)\n\n - Expected earnings:\n\n  AAMC, ACRX, ACTG, ADMP, AESE, AGBA, AGTC, ALAC, ALHC, ALT, ALUS, APPH, ATCX, ATEX, ATXI, AUVI, AYTU, BATL, BHTG, BMTX, BPT, BRFS, BSGM, CELP, CERE, CLOV, CLSD, CLVR, COE, COMS, CRBP, CREX, CRT, CVM, CWBR, CWCO, CYCN, DM, DNMR, DRIO, EBIX, EDRY, ENIC, ENLV, ENOB, FBIO, FGBI, FONR, FORA, FSR, FSTX, FUV, GALT, GAN, GENC, GMBL, GNOG, GNUS, GOEV, GSM, GSMG, GVP, HPK, HQI, HSDT, HYMC, IBIO, IDEX, INVO, LEV, LMFA, LOV, LUNA, MARK, MBIO, MILE, MLSS, MMAC, MRNS, MSGM, MVO, NAT, NDRA, NEXT, NIU, NTCO, NVVE, OCX, OEG, OMEX, ONDS, ONVO, PBT, PCT, PCYG, PIRS, PME, PRCH, PRPL, PRTK, PSHG, PSTI, PTN, PVL, QRHC, RAIL, REED, RIDE, RIOT, RKDA, RMBL, RMTI, RVPH, RYAAY, SCYX, SGBX, SJT, SNMP, SONN, SRAX, SVVC, SYTA, THCA, THCB, TLS, TMDI, TME, TOMZ, TPHS, TWNK, USWS, VEI, VERO, VHC, VOC, VRRM, VTSI, VVOS, WF, XBIT, XL, XONE, XSPA, ZH\n\n - Ex-div:\n\n  ADX, BC, BKH, CSTE, ESXB, FMBH, GGB, HRZN, IBA, NHTC, ORA, PEO, PROV, PTVCA, PTVCB, RGA, SCU, SHYF, SMM, SSSS, SWKS, UMPQ, VCIF, WWD, XFLT\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.015%)\n    - 6-Month Bill Auction (previous: 0.035%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Clarida Speaks\n    - FOMC Member Clarida Speaks\n    - Investing.com Gold Index (actual: 59.9%, previous: 56.2%)\n    - Investing.com S&amp;P 500 Index (actual: 42.1%, previous: 35.0%)\n    - NAHB Housing Market Index (consensus: 83, previous: 83)\n    - NY Empire State Manufacturing Index (consensus: 23.90, previous: 26.30)\n    - Overall Net Capital Flow (previous: 72.60B)\n    - TIC Net Long-Term Transactions (previous: 4.2B)\n    - TIC Net Long-Term Transactions including Swaps (previous: -38.00B)\n    - US Foreign Buying, T-bonds (previous: -65.50B)\n\n## Upcoming events for Tuesday, May 18th\n\n - Expected earnings:\n\n  AAP, AGFY, AGTI, AGYS, AKYA, ANVS, ASND, BIDU, BTX, BWL.A, BZUN, CARV, CXDO, DAO, DGLY, DOYU, DQ, DXYN, DY, ECC, EIC, FCBP, GBS, GEG, GNLN, HD, HMC, HUIZ, HUYA, IBEX, ICON, IQ, JAN, JHX, KC, KTCC, LOOP, M, MITO, MOSY, MYTE, NCNA, NETI, NEW, NTES, NTIP, ODT, QUIK, RAVN, SCPE, SE, SKYT, SMTI, SOLO, STE, STEP, SUMR, SYPR, TCOM, TCS, TIMB, TRNS, TTWO, VIAO, VOD, VST, VYNT, WHLR, WMT, XELB\n\n - Ex-div:\n\n  ADM, AFL, AGO, AMOT, BG, BGCP, BWXT, CVX, CXE, CXH, DHT, DMB, ED, EQIX, FDP, GAIN, GLAD, GOOD, LAND, LARK, LMAT, MAV, MCR, MHI, MIN, MMT, MPC, MRO, PCF, PHD, PHT, POWL, PTMN, RMAX, SEM, SXC, TGT, TXRH, WRK\n\n - Economic events and announcements:\n\n    - 52-Week Bill Auction (previous: 0.065%)\n    - API Weekly Crude Oil Stock (previous: -2.533M)\n    - Building Permits (consensus: 1.770M, previous: 1.759M)\n    - Building Permits (previous: 2.3%)\n    - Housing Starts (consensus: 1.710M, previous: 1.739M)\n    - Housing Starts (previous: 19.4%)\n    - Redbook (previous: 13.3%)\n\n## Upcoming events for Wednesday, May 19th\n\n - Expected earnings:\n\n  ABEO, ADI, BEKE, BLRX, BORR, CAAP, CAE, CMRE, CPRT, CRKN, CSCO, CSWI, DAVA, DESP, EM, EXP, FRO, FUTU, GDS, GGB, GOTU, GURE, IPDN, ITMR, JD, KEYS, KNBE, LB, LOW, LPG, MNR, MNSO, NESR, NNA, NRBO, RDY, SBLK, SCVL, SJ, SNPS, SQM, SY, TARO, TGT, TJX, TYME, VINP, VIPS, WLMS, YI, YSG, YY, ZIM, ZTO\n\n - Ex-div:\n\n  ADTN, AJX, APO, ASA, BGH, CLPR, CNP, CTSH, DFS, ES, FSLF, GFF, HE, HL, HTBI, IGR, LFUS, LTC, MCO, MSFT, PHX, RPRX, RXN, SBAC, SBSI, SPB, SUNS, THQ, THW, WD\n\n - Economic events and announcements:\n\n    - 20-Year Bond Auction (previous: 2.144%)\n    - Crude Oil Imports (previous: 2.363M)\n    - Crude Oil Inventories (previous: -0.427M)\n    - Cushing Crude Oil Inventories (previous: -0.421M)\n    - Distillate Fuel Production (previous: 0.157M)\n    - EIA Refinery Crude Runs  (previous: -0.223M)\n    - EIA Weekly Distillates Stocks (consensus: -1.080M, previous: -1.733M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.5%, previous: -0.4%)\n    - FOMC Meeting Minutes\n    - FOMC Meeting Minutes\n    - FOMC Member Bostic Speaks\n    - Gasoline Inventories (consensus: -0.600M, previous: 0.378M)\n    - Gasoline Production (previous: 0.442M)\n    - Heating Oil Stockpiles (previous: -0.315M)\n    - MBA 30-Year Mortgage Rate (previous: 3.11%)\n    - MBA Mortgage Applications (previous: 2.1%)\n    - MBA Purchase Index (previous: 276.7)\n    - Mortgage Market Index (previous: 715.3)\n    - Mortgage Refinance Index (previous: 3,281.0)\n\n## Upcoming events for Thursday, May 20th\n\n - Expected earnings:\n\n  ACET, AINV, AIV, AMAT, APOP, ARPO, AVAL, BJ, BLCM, BRC, BWAY, CATO, CD, CDZI, CELC, CKX, CSIQ, CUE, CZNC, DECK, ELTK, ENTX, FLO, FRSX, GENI, GLNG, HRL, HWCC, HWKN, IGIC, INDT, JOBS, KSS, LAZY, LBPS, LIZI, LSPD, MACK, MANU, MAXN, MKTY, MNRO, NKSH, NUZE, OLK, PANW, PAVM, PAX, PLCE, PLUG, PLUS, QIWI, REDU, RL, ROST, SBR, SBSW, SCX, SEEL, SKM, SPLP, SUNW, SVM, TDAC, TGI, TRT, WMS, WOOF, XNET, YTRA\n\n - Ex-div:\n\n  ABR, ACP, AGD, AKO.A, AKO.B, AOD, ARDC, ARGO, ASGI, AUB, AWP, BBSI, BGB, BGX, BSL, BWG, CBFV, CEM, CGNX, CMI, CORE, CTR, DEX, DFP, DMO, EFF, EFR, EFT, EHI, EMD, EMO, ENIA, ENIC, EOI, EOS, EOT, ETB, ETG, ETJ, ETO, ETV, ETW, ETX, ETY, EURN, EVG, EVRG, EVT, EXD, EXG, FDBC, FF, FFC, FLC, FLIR, FMN, FSS, GDO, GSK, HBI, HCI, HCSG, HFRO, HGLB, HIE, HIO, HIX, HNI, HSY, HYI, IGI, MCHP, MGPI, MGU, MMM, MMU, MNRL, NCMI, NHF, NTG, OTIS, PBI, PFD, PRI, RTX, SBI, SCD, SHW, SNA, STNG, SWM, TEL, TKR, TPZ, TTP, TYG, UL, USLM, WBA, WEA, WHR, WIA, WIW\n\n - Economic events and announcements:\n\n    - 10-Year TIPS Auction (previous: -0.580%)\n    - 4-Week Bill Auction (previous: 0.000%)\n    - 8-Week Bill Auction (previous: 0.010%)\n    - Continuing Jobless Claims (consensus: 3,640K, previous: 3,655K)\n    - Initial Jobless Claims (consensus: 450K, previous: 473K)\n    - Jobless Claims 4-Week Avg. (previous: 534.00K)\n    - Natural Gas Storage (consensus: 76B, previous: 71B)\n    - Philadelphia Fed Manufacturing Index (consensus: 43.0, previous: 50.2)\n    - Philly Fed Business Conditions (previous: 66.6)\n    - Philly Fed CAPEX Index (previous: 36.70)\n    - Philly Fed Employment (previous: 30.8)\n    - Philly Fed New Orders (previous: 36.0)\n    - Philly Fed Prices Paid (previous: 69.10)\n    - US Leading Index (consensus: 1.4%, previous: 1.3%)\n\n^^^^2021-05-17",
        "created_utc": 1621245613,
        "id": "gyff1kk",
        "permalink": "/r/RobinHood/comments/nec4fh/daily_discussion_thread_may_17th_2021/gyff1kk/",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1621274413.0
    },
    {
        "author": "toydan",
        "body": "$SWKS",
        "created_utc": 1621015469,
        "id": "gy4kn4s",
        "permalink": "/r/wallstreetbets/comments/nc4z12/daily_discussion_thread_for_may_14_2021/gy4kn4s/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621044269.0
    },
    {
        "author": "Accomplished_Duty632",
        "body": "Skyworks, MSFT, AAPL, GOOG, AMZN, NVDA.   I’m a professional.",
        "created_utc": 1621989880,
        "id": "gzgi34p",
        "permalink": "/r/wallstreetbets/comments/nl4ajv/skyworks_swks_new_facility_in_2003_was_the/gzgi34p/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622018680.0
    },
    {
        "author": "Immediate-Assist-598",
        "body": "IMHO it is the stupid crypto craze and the reckless Robin Hood day trading casino which is freaking out the markets now, that plus the uncertainty of Biden's big bills getting passed.  The Trump newly-dominated GOP (are they nuts or what going back to him?) is doing everything it can to queer the economy (as well as our whole democracy and national mood), not wanting Biden to succeed and partnering with Putin once again to try and bring him down. Putin was likely behind the gas pipeline hack and most of the covid denialism anti vaccine BS.  Putin is also big into crypto which is a way for him to avoid detection and launder money.  But I would avoid both oil stocks and cryptos like the plague. They will fall hard soon.   So yes, we have some problems.  But who wants to bet against AAPl for more than a few days?  Sanity will resume soon.  What we really need it for the cryptos to crash 50% and that will wake up people to resume normal responsible adult investing again.  So I bought more Skyworks today and if this continues I will buy more tomorrow as a proxy for AAPL which I already own 60,000 shares of, and I like round numbers.  Instead of cash I have parked all extra money in T and VZ and am up around 10% so I am selling some of those and buying Skyworks which once tech rallies back will be one of the fastest movers, and also pays a dividend.  At today's prices, I estimate one could make 50% off Skyworks and 25% off AAPL and not even need any miracles. Attitudes just need to change, and they will, any hour or day now,. Also, amongst the FAANMG stock, the one with the least amount of value and good news priced in is AAPL.  So I assume that has the most upside.",
        "created_utc": 1620676008,
        "id": "gxn9qak",
        "permalink": "/r/options/comments/muz0ac/the_blood_bath_todayat_one_point_my_aapl_calls_my/gxn9qak/",
        "score": 1,
        "subreddit": "options",
        "created": 1620704808.0
    },
    {
        "author": "californianotter",
        "body": "Yup.  I had XPEV, NIO, SMH, SWKS and AMD.  I cut it all early this week.",
        "created_utc": 1620331432,
        "id": "gx6vsis",
        "permalink": "/r/stocks/comments/n63da7/rstocks_daily_discussion_options_trading_thursday/gx6vsis/",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620360232.0
    },
    {
        "author": "Diaper_Gravy",
        "body": "You look at the current board at Indie and realize the key veteran players there. A board member who was the CEO of skyworks, a leading cellular chip designer. He recently fully stepped off the board of skyworks, to ensure no conflict of interest with Indie.\n\nThis company has been around for a decade and have already 100 million units shipped. They are going public to help with costs and pave the way to expand and further grow Indie. Their career board has grown three fold since last fall.",
        "created_utc": 1621057084,
        "id": "gy6qc44",
        "permalink": "/r/SPACs/comments/nckfkg/thbr_confirmed_merger_with_indie_semiconductors/gy6qc44/",
        "score": 1,
        "subreddit": "SPACs",
        "created": 1621085884.0
    },
    {
        "author": "ReaditB4Bomber",
        "body": "TF is this skyworks solutions dip, i thought it was on sale yesterday after earnings, gonna buy some later on in the day😋",
        "created_utc": 1620062772,
        "id": "gwt0qj7",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwt0qj7/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1620091572.0
    },
    {
        "author": "winteroffice74",
        "body": "Something worth watching\n\nhttps://news.stocktradersdaily.com/news_release/90/Skyworks+Solutions+SWKS+Technical+Update_050921091019.html",
        "created_utc": 1620566002,
        "id": "gxhswrb",
        "permalink": "/r/wallstreetbets/comments/n8coni/skyworks_expands_into_automotive_semiconductor/gxhswrb/",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1620594802.0
    },
    {
        "author": "poodlesofnoodles",
        "body": "Nowhere near the best LIDAR tech. Check out Teledyne",
        "created_utc": 1620150183,
        "id": "gwxl16t",
        "permalink": "/r/wallstreetbets/comments/n4klyx/daily_discussion_thread_for_may_04_2021/gwxl16t/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620178983.0
    },
    {
        "author": "poodlesofnoodles",
        "body": "Then buy Teledyne which actually has revenue and products",
        "created_utc": 1620058413,
        "id": "gwsqeux",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gwsqeux/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620087213.0
    },
    {
        "author": "sagegraff",
        "body": "I was in the air force and got separated early. While processing my separation i was getting tdy pay which means i was getting my base pay ~800 along with an allowance for food and housing which for my pay grade made my paychecks about 15-1600 every two weeks. When i applied for UI, my most recent income (1500 every two weeks) is what i was granted",
        "created_utc": 1620507003,
        "id": "gxfc9tm",
        "permalink": "/r/wallstreetbets/comments/n77hgs/weekend_discussion_thread_for_the_weekend_of_may/gxfc9tm/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620535803.0
    },
    {
        "author": "Kabohead",
        "body": "$TDY",
        "created_utc": 1619984573,
        "id": "gwpaf0u",
        "permalink": "/r/ValueInvesting/comments/n3ada1/what_is_a_company_where_you_personally_have/gwpaf0u/",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1620013373.0
    },
    {
        "author": "fatguynextdoor",
        "body": "Wht to buy tdy bois",
        "created_utc": 1620050976,
        "id": "gws9ajd",
        "permalink": "/r/wallstreetbets/comments/n3sdrh/daily_discussion_thread_for_may_03_2021/gws9ajd/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620079776.0
    },
    {
        "author": "poodlesofnoodles",
        "body": "Why would Ford use anyone but Teledyne u walnut",
        "created_utc": 1620147745,
        "id": "gwxf4ow",
        "permalink": "/r/wallstreetbets/comments/n4klyx/daily_discussion_thread_for_may_04_2021/gwxf4ow/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620176545.0
    }
]