[
    {
        "author": "MassCasualty",
        "body": "Oh boy. When people chart stocks they use candles. As the candles decrease rapidly it forms a ladder. It’s a short sale induced seller hoping to trigger stop losses or sell offs by individuals who get scared by the quick drops. However if you look at the actual sales data you will see there are not a lot of shares being sold. The beautiful thing with this has been every time they’ve done this strong hands of swooped in to gobble up these discount shares. Look at today’s data you can see the giant red swoops down and then a return as people were able to buy back. It wasn’t as rapid as in previous days because of the collusion blocking out traders from being able to buy a GME. Imagine you shorted all of that stock today drove the price down to under $200 at close. You went home to watch your wife with her boyfriend and celebrate your successful job. When you opened up your Motorola Razr to take some quick pix you had a text message from your boss that said “GameStop back over 300” dammit now what.",
        "created_utc": 1611895347,
        "id": "gl71rv4",
        "score": 95,
        "subreddit": "wallstreetbets",
        "created": 1611924147.0
    },
    {
        "author": "BuysHigh_SellsLow",
        "body": "When’s the Motorola brick coming back?",
        "created_utc": 1611939908,
        "id": "gl9brgy",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1611968708.0
    },
    {
        "author": "C4242",
        "body": "That sounds like an old phone company. First blackberry, then Nokia, now Motorola!",
        "created_utc": 1611780581,
        "id": "gkzxqm4",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1611809381.0
    },
    {
        "author": "lightscapr",
        "body": "Can we go one generation further back next? Can we bring back Motorola for their Saved By the Bell Zack Morris phones? And maybe whoever makes ring pops?",
        "created_utc": 1611881144,
        "id": "gl66m4v",
        "score": 33,
        "subreddit": "wallstreetbets",
        "created": 1611909944.0
    },
    {
        "author": "eddiebrown82",
        "body": "GME now back at 346 in after hours trading. \n\nDid anyone see the spike at 2.10pm today? Googles chart is saying it went up to 469. My brokerage is saying It didn't. What the actual fuck?\n\nhttps://www.google.com/search?q=%24gme&amp;oq=&amp;aqs=chrome.0.35i39i362l5...5.-1j0j7&amp;client=ms-android-motorola-gfw&amp;sourceid=chrome-mobile&amp;ie=UTF-8",
        "created_utc": 1611878407,
        "id": "gl60esq",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1611907207.0
    },
    {
        "author": "elreytx",
        "body": "Apple hasn’t invented anything new revolutionary since his death. Once something cripples iphone sales, I’m worried apple will be the next gen Motorola",
        "created_utc": 1610100376,
        "id": "gij0ezu",
        "score": 11,
        "subreddit": "investing",
        "created": 1610129176.0
    },
    {
        "author": "InitializedVariable",
        "body": "Perhaps this isn’t the best analogy, but: Peloton is the iPhone of workout bicycles.\n\nYes, Samsung and Motorola and other companies will produce competing devices with a smaller price tag that will likely serve the needs of the majority of the market. In fact, some people may even like them better.\n\nBut Peloton has set the bar for a premium workout bicycle — with a premium experience. They are not a perfect company, and some of the criticisms raised against them are valid, but it is inaccurate to accuse them of not delivering a stellar product.",
        "created_utc": 1610497241,
        "id": "gj25vl5",
        "score": 10,
        "subreddit": "investing",
        "created": 1610526041.0
    },
    {
        "author": "halfmanhalfrobot69",
        "body": "Are we pumping NOK now?\n\nIs it just because BB is mooning?  What’s next?  Motorola?  NEXTEL?",
        "created_utc": 1611199183,
        "id": "gk0tzpz",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1611227983.0
    },
    {
        "author": "fsoto161",
        "body": "Don't you see? The goal is to get all the 2000s cell phone manufacturers above AAPL. Start with BB, then NOK, and then MSI and so on",
        "created_utc": 1611081614,
        "id": "gjuvigu",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1611110414.0
    },
    {
        "author": "andreib14",
        "body": "Lolno. Just last year we've had developers lash out against Steam and Apple for taking too big a cut from the sales, they hate giving cuts to retailers and GME is one of those retailers.\n\nGames are never going to be a solid source of revenue for GME again.\n\nConsole/gadget sales are jsut one step away fron running away as well. MSI, Razer, etc. preffer to deal directly and Sony/Microsoft are close to not giving a shit about GME anymore.",
        "created_utc": 1611953719,
        "id": "glaf7jh",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1611982519.0
    },
    {
        "author": "YimYimYimi",
        "body": "Thanks for including the lyrics in the description. I wasn't able to make them out as this was recorded with a Motorola Razr in a sheet metal garage.",
        "created_utc": 1611953200,
        "id": "gladn8w",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1611982000.0
    },
    {
        "author": "KYJELLYTIME69",
        "body": "they're starting to sell high margin parts like keyboards and hardware on their website, a small and shitty collection tbh, but I saw a post about possible partnerships with MSI and other companies. That is pretty bullish for all parties involved and I hope they use their awards program to help offer discounts to their customers and gain loyalty",
        "created_utc": 1609629294,
        "id": "ghvhgkt",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1609658094.0
    },
    {
        "author": "yoholife",
        "body": "whats Motorola doing",
        "created_utc": 1611431705,
        "id": "gkfomqp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1611460505.0
    },
    {
        "author": "John_Stonkton",
        "body": "AAPL tryna re-invent the motorola RAZR now lmao",
        "created_utc": 1610745550,
        "id": "gjdwjpw",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1610774350.0
    },
    {
        "author": "foeplay44",
        "body": "Will Motorola be making a come back too?",
        "created_utc": 1611197349,
        "id": "gk0qcau",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1611226149.0
    },
    {
        "author": "Harudera",
        "body": "Heard the same shit about how Apple wouldn't kill off Nokia, Ericsson, Motorola and all the other shit phones from back then.\n\nEuropean countries simply aren't  innovative in regards to software.",
        "created_utc": 1610305986,
        "id": "gisehid",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1610334786.0
    },
    {
        "author": "PlayFree_Bird",
        "body": "Microsoft is still here, but their valuation is more in line with their market share.  The existence of Microsoft PCs didn't stop others from capturing share.\n\nI didn't say that the first company to market always loses, but they are not guaranteed market share.  On that note, when was the last time you bought a Motorola phone?  Or a Blackberry?  Hell, we can even look at the history of the automotive sector itself.\n\nTesla is sitting in a very bizarre spot right now where it is being valued as if it already has accomplished its lofty goals.  It will need to earn this valuation against a field of competitors which is something much harder in practice than in the wide, dollar-filled eyes of investors.  It's easier to imagine TSLA doing all these things than for them to *actually* do them.\n\nRegarding #2, you realize there are already non-auto manufacturing companies working on this, right?",
        "created_utc": 1609878487,
        "id": "gi7wkfk",
        "score": 3,
        "subreddit": "investing",
        "created": 1609907287.0
    },
    {
        "author": "BornLoser23",
        "body": "Motorola has a new Razor lol. No lie.",
        "created_utc": 1610164275,
        "id": "gimdcz0",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1610193075.0
    },
    {
        "author": "Fearmentor1",
        "body": "The tech wasn't there in 99 for what is happening now. People didn't Motorola sidekick with each other",
        "created_utc": 1611961278,
        "id": "glaxz89",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611990078.0
    },
    {
        "author": "xXx_Bunga_xXx",
        "body": "Part 2:\n\n    MTOR\t0.879\n    PFGC\t0.121\n    PZN\t0.02\n    SC\t0.96\n    SLAB\t0.463\n    SMG\t0.201\n    SNDR\t0.06\n    SPOT\t0.1\n    TGI\t0.322\n    WNC\t0.959\n    ADTN\t1\n    AFG\t0.9\n    AFL\t0.96\n    ALGN\t0.342\n    ALGT\t0.899\n    ALL\t0.939\n    ANGI\t0.06\n    APPS\t0.537\n    ASH\t0.92\n    AVB\t0\n    AVNW\t0.141\n    AVTR\t0.779\n    AXTA\t1\n    BSMX\t0\n    CCMP\t0.98\n    CHNG\t0.98\n    CSGS\t0.181\n    CSII\t0.98\n    CTSH\t0.98\n    CTVA\t0.98\n    DGII\t1\n    EBAY\t1\n    ECHO\t0.98\n    ELF\t0.859\n    EMKR\t0.101\n    FORM\t0.96\n    GEOS\t0.041\n    GRUB\t0.92\n    HI\t0.899\n    HMN\t0.859\n    IAC\t0.08\n    INOV\t0.02\n    IVAC\t0.821\n    KE\t0.081\n    KLAC\t1\n    LCI\t0.161\n    LNC\t0.06\n    MAA\t0\n    MET\t0.98\n    MUSA\t0.92\n    MWA\t0.1\n    MXL\t0.482\n    NEU\t0.04\n    NTGR\t1\n    PAHC\t0.718\n    PYPL\t1\n    QCOM\t1\n    QNST\t0.92\n    QRVO\t0.98\n    RGLD\t0.06\n    RYN\t0.458\n    SIMO\t0.622\n    SITM\t0.96\n    TBI\t0.919\n    THG\t0.98\n    TSE\t0.101\n    TTMI\t0.96\n    UGI\t0.101\n    UHAL\t0.658\n    VVV\t0.88\n    YUMC\t0.9\n    VNE\t0.539\n    ABC\t0.941\n    AGCO\t0.98\n    ALXN\t1\n    AME\t1\n    APD\t0.1\n    ARW\t0.939\n    BAX\t1\n    BCE\t0.12\n    BDX\t0.96\n    BLL\t0.879\n    BMY\t1\n    BSIG\t0.338\n    BTU\t0.602\n    BV\t0.02\n    CI\t0.94\n    CLX\t0.859\n    CMI\t0.899\n    CMS\t0.417\n    COR\t0\n    DGX\t0.96\n    DSPG\t0.881\n    DX\t0.221\n    GLT\t0.08\n    GOOS\t0.86\n    GPI\t0.96\n    HIMX\t0\n    HSY\t0.96\n    ICE\t0.94\n    IEX\t1\n    IP\t0.96\n    IRMD\t1\n    JHG\t0.94\n    LANC\t0.081\n    LEA\t0.96\n    LQDT\t0.74\n    LSPD\t0\n    MDP\t0.241\n    MDU\t0.04\n    MMS\t0.92\n    MPW\t0\n    MRK\t1\n    MSGN\t0.1\n    NJR\t0.06\n    NS\t0.039\n    NYT\t0.94\n    OCSI\t0\n    OCSL\t0.159\n    ODFL\t0.879\n    ONEW\t0.478\n    PBH\t0.98\n    PENN\t0.98\n    PH\t1\n    PIPR\t0.88\n    PM\t0.86\n    PTEN\t0.322\n    RFP\t0.101\n    RGS\t0.04\n    RL\t0.622\n    SBH\t0.242\n    SNA\t0.98\n    SPH\t0.02\n    SR\t0.218\n    SXC\t0.121\n    TKR\t0.98\n    TPR\t0.98\n    TW\t0.201\n    ULBI\t0\n    VSTO\t0.94\n    WD\t0.919\n    WEC\t0.879\n    WLMS\t0.08\n    WMS\t0.04\n    XYL\t0.9\n    YTRA\t0.1\n    YUM\t0.9\n    AINV\t0.338\n    AOSL\t0.88\n    ARWR\t0.02\n    ATVI\t1\n    BILL\t0.98\n    BRBR\t0.121\n    CCS\t0.94\n    CDR\t0\n    COLM\t0.101\n    CPT\t0\n    CSL\t0.98\n    CTHR\t0\n    CURO\t0.94\n    DECK\t0.98\n    DHX\t0.362\n    DLX\t0.343\n    DXC\t0.98\n    ENVA\t0.859\n    ESS\t0\n    EVBN\t0.98\n    EXPO\t1\n    F\t0.899\n    FARM\t0.161\n    FFG\t0\n    FLT\t1\n    FTNT\t1\n    FTV\t1\n    GHL\t0.04\n    GILD\t0.94\n    GPRO\t0.523\n    GTIM\t0.08\n    HIG\t0.96\n    HUBG\t1\n    KLIC\t0.12\n    KN\t0.08\n    LBRT\t0.02\n    LGF.A\t0.96\n    LPLA\t0.98\n    MCHP\t0.98\n    MNR\t0.02\n    MOD\t0.201\n    MPWR\t0.401\n    MSI\t1\n    MTD\t0.98\n    MTX\t1\n    NBIX\t0.02\n    NEWR\t0.362\n    NFG\t0.379\n    NGVC\t0.04\n    NLOK\t1\n    NOV\t0.504\n    OFC\t0\n    OHI\t0\n    ONTO\t1\n    OTEX\t1\n    PCTY\t1\n    PFPT\t1\n    PFSI\t0.819\n    PINS\t0.98\n    PLT\t0.98\n    PMT\t0.84\n    POST\t0.081\n    PRO\t0.98\n    PRU\t0.8\n    PTON\t0.681\n    SKX\t0.96\n    SKYW\t0.241\n    SNAP\t0.94\n    SVM\t0.06\n    SYNA\t1\n    TDC\t1\n    THST\t0\n    TMUS\t0.92\n    TWST\t0.081\n    U\t1\n    UEPS\t0.04\n    ULH\t0.04\n    UNM\t0.04\n    USAT\t0.04\n    UTI\t0.04\n    VREX\t0.1\n    WERN\t0.899\n    WWE\t1\n    YRCW\t0.1\n    ZEN\t0.98\n    ABB\t0.02\n    BSAC\t0\n    CG\t0.84\n    RDS.A\t0.24\n    SOGO\t0.02\n    SOHU\t0\n    THR\t0.501\n    ADNT\t0.9\n    AMPH\t0.9\n    AON\t0.859\n    ARA\t0.06\n    ASRT\t0.281\n    ASX\t0\n    BBU\t0\n    BERY\t0.88\n    CAH\t0.959\n    CBOE\t0.98\n    CIVB\t1\n    CNTY\t0.04\n    CSWI\t0.221\n    CXRXF\t0.081\n    EAF\t0.839\n    EL\t0.96\n    FCCY\t0.98\n    FE\t0.539\n    GAU\t0.02\n    GNE\t0.12\n    GRC\t0\n    GVA\t0\n    HCAP\t0.26\n    HMC\t0.32\n    HRC\t1\n    ITW\t1\n    JOUT\t0.02\n    KKR\t0.9\n    LAZ\t1\n    MTNB\t0\n    NOG\t0.8\n    OCGN\t0.02\n    OFS\t0.02\n    OIIM\t0.02\n    OPY\t0.181\n    PAR\t0.222\n    PFSW\t0.523\n    REGN\t0.98\n    ROAD\t0\n    SCYX\t0.641\n    SDPI\t0.04\n    SPB\t0.221\n    THM\t0\n    TMP\t0.859\n    TT\t0.98\n    UTSI\t0\n    VIVO\t0.461\n    ZBH\t0.96\n    CRNX\t0.02\n    JCS\t0.04\n    KINS\t0.4\n    LIVX\t0\n    PSTI\t0.02\n    STLY\t0.02\n    UUUU\t0\n    VHC\t0.061\n    AU\t0\n    CBFV\t0.98\n    CDZI\t0\n    CTTC\t0\n    CZNC\t0.76\n    DIIBF\t0.101\n    DPSI\t0\n    ELUXY\t0.461\n    GNUS\t0\n    KMTUY\t0.2\n    NHYDY\t0.04\n    RICOY\t0\n    SNP\t0\n    SNY\t0\n    TCFC\t0.623\n    WRN\t0\n    XBIO\t0.14\n    YORW\t0.16",
        "created_utc": 1612124595,
        "id": "glikwui",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612153395.0
    },
    {
        "author": "Brilliant_Bet",
        "body": "I'm using my moms motorola razr",
        "created_utc": 1611801012,
        "id": "gl1czwd",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1611829812.0
    },
    {
        "author": "TenMegaFarads",
        "body": "The Motorola Razr was a perfect device",
        "created_utc": 1610861942,
        "id": "gjjs4kz",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1610890742.0
    },
    {
        "author": "GoyaBlackBeans",
        "body": "I am...  I refuse to buy Apple, had a Samsung, and I dropped it and it cracked 2 weeks after I bought it.  Then bought a Motorola - and that bitch has been dropkicked onto concrete on a cold Winter day multiple times.  Ive dropped it in my house, in the car, on the ground, at the store...  Left it in my car console in single digit weather overnight.  3 years in, not a scratch or a crack on it.  Indestructible.  Seems like the more I pay for a phone, the easier it breaks.  So F that, I'm buying a Nokia...",
        "created_utc": 1612118108,
        "id": "gli6rzl",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1612146908.0
    },
    {
        "author": "sherman020",
        "body": "Let's spread this Cramer 2006 video everywhere until there's repercussions, this needs to go mainstream: [https://youtu.be/VMuEis3byY4](https://youtu.be/VMuEis3byY4)\n\nBest Quotes (it was hard to choose because everything was so shocking, and hard to edit because it's so fucking disgusting):\n\n\"A lot of times when I was short at my hedge fund I was positioned short, meaning I needed it down, I would create a level of activity beforehand that could drive the futures. It doesn't take much money.\"\n\n\"It's a fun game and a lucrative game and you can move it up and then fade it, that often creates a very negative feel (...) That's a strategy very worth doing. (...) I would encourage anyone who's in the hedge fund game to do it because it's legal and it's a very quick way to make money and very satisfying.\"\n\n\"Hedge funds are positioned long-short okay, not just long like mutual funds, so it's really vital these next six days because of your payday, you've really got to control the market. You can't let it lift (...) It's really important to use a lot of your firepower to knock that down.\"\n\n\"You can't foment, that's a violation. You can't create yourself an impression that a stock's down, but you do it anyway because the SEC doesn't understand it so yeah.\"\n\n\"A hedge fund that's not up a lot really has to do a lot now to save itself. (...) This is actually just blatantly illegal but when you have six days and your company may be in doubt because you're down I think it's really important to foment.\"\n\n\"When you see a guy's bidding you'd wipe out that guy very quickly. What i used to do was if I wanted to go higher I would take and bid, take and bid, take and bid, and if I wanted to go lower I'd hit and offer, hit and offer and I could get a stock like RIM, maybe that might cost me 15, 20 million to knock RIM down but it would be fabulous because it would beleaguer all the moron longs who are also keying on RIM.\"\n\n\"When your company's into survival mode it's really important to defeat RIM and get the Pizani's of the world and people talking about it as if there's something wrong with RIM then you would call the journal and you get the bozo reporter.\"\n\n\"These are all the things you must do on a day like today and if you're not doing it maybe you shouldn't be in the game.\"\n\n\"Apple's very important to spread the rumor that um that both verizon and AT&amp;T have decided they don't like the phone (...) You want to spread the rumor that it's not going to be ready for macworld and this is very easy.\"\n\n\"With a little bit of capital you go buy some January 80 puts that makes it look like there's going to be something going on (...) and you just kind of create an image that there's going to be news next week and that's going to frighten everybody.\"\n\n\"What's important when you're in that hedge fund mode is to not do anything remotely truthful because the truth is so against your view right that it's important to create a new truth to develop a fiction.\"\n\n\"The mechanics are much more important than fundamentals. Who cares about the fundamentals? (...) That's a fabulous thing. The great thing about the market is there's nothing to do with the actual stocks.\"\n\n\"Fannie Mae lied about the earnings for six billion dollars right? It's fiction and fiction and fiction and I think it's important for people to recognize that the way that the market really works is to have that nexus of: Hit the brokerage houses with a series of orders that can push it down, then leak it to the press and get it on CNBC, that's also very important, and then you have a kind of a vicious cycle down. It's a pretty good game.\"\n\n\"The problem with the cell phone market frankly is that these guys are all killing each other, you know? Someone has to take a dive. Motorola and Nokia, you have to get in a room and just fix price. They've been reluctant to do that because of the various justice departments. (Host says \"And because it's illegal\") Well, that hasn't stopped a lot of other companies. What eventually happens is the shareholders demand that you get phony lawyers and you sit in the room and it'll happen soon\"\n\n\"I have to talk about what it's like at my hedge fund and what other hedge funds do because this is an intraday show and you need to know what's going on.\"",
        "created_utc": 1612055919,
        "id": "glfizmg",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612084719.0
    },
    {
        "author": "denverdabs",
        "body": "My man probably trades on a Motorola  razr",
        "created_utc": 1611813129,
        "id": "gl20djn",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611841929.0
    },
    {
        "author": "Daegoba",
        "body": "Market cap is directly tied to your stock price though. It is calculated by multiplying the price of a stock by its total number of outstanding shares. \n\nBecause of that, I feel like your math is a little backwards. CRWD is at like $220 right now. That's what leads to that $50B market cap. It's not really the same thing as BB (which I love; don't take this the wrong way). Also: is CRWD even competition to BB? I searched for their competition and came up with JAMF, MOBL (just bought by Ivanti), MSI, and EVBG. Most of those companies trade waaaay higher, but also do not have the integration of BB, so I'm not sure if they're comparable for our reasonings.\n\nSo, I guess what I'm asking is, how did you land on any of these valuations? Why compare them to CRWD? \n\nSo I'm clear: I'm investing in BB. Don't mistake this critique as me tearing you down or shit-talking, please. I'm merely trying to understand how to better vet my choices for investments.",
        "created_utc": 1611361411,
        "id": "gk9j6q5",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611390211.0
    },
    {
        "author": "HerezahTip",
        "body": "MSI RTX 3070 Gaming X Trio \n\nThanks I’m super pumped to put it all together! My first build. Case is a P500A",
        "created_utc": 1611210184,
        "id": "gk1bpfy",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611238984.0
    },
    {
        "author": "GoBeaversOSU",
        "body": "I didn't. My dad eventually got a Motorola phone and the Nokia brick",
        "created_utc": 1611265764,
        "id": "gk3wf2h",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611294564.0
    },
    {
        "author": "4chanstan",
        "body": "Needed the Motorola with the chirp chirp deal on the side. Paying for a glorified walkie talkie-- what a racket",
        "created_utc": 1610173557,
        "id": "gims4j4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1610202357.0
    },
    {
        "author": "GrandSacko",
        "body": "I wanted to make a joke about Motorola but apparently they’re a prosperous company.",
        "created_utc": 1611031411,
        "id": "gjsr44g",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611060211.0
    },
    {
        "author": "IskandarAli",
        "body": "Clearly the trick is to invest in dead mobile companies. Have you tried Motorola?",
        "created_utc": 1611129967,
        "id": "gjxba56",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611158767.0
    },
    {
        "author": "dirtymike2499",
        "body": "When is Motorola mooning? Seems to be the trend here",
        "created_utc": 1611783590,
        "id": "gl05j4s",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1611812390.0
    },
    {
        "author": "Maxsanja",
        "body": "Im not sure if they have drip, but these are probably my fav monthly dividend stocks. RNW, NPI, PLC, kmp.un, FN, EIF, MSI, PPL",
        "created_utc": 1610429567,
        "id": "giz0mdl",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1610458367.0
    },
    {
        "author": "Irishmen80",
        "body": "Please google \" sunburst \".... Many cyber sec experts are advising a ZERO trust policy. This is not as a precaution but due to the nature in how the malware was implemented an executed. In layman's terms patch no fix big open door. Honestly appreciate the fuck out of fire eye for their transparency I can't say I expect the same from $msft $csco $msi $jetbrains, etc. It looks as if this is a pwntoown situation and we've been pwned. But DAMN I hope I'm wrong and I'm just out $$ , not back in the fucking stone age or a fucking communist. If you want to Kno how big it really is barley scratch the surface here https://www.cbsnews.com/video/the-threats-arising-from-the-massive-solarwinds-hack  \n if you can understand some tech jargon (dec14)https://youtu.be/qP3LQNsjKWw\n\nDisclaimer:Above are great places to start but quite a bit has unfolded since 2020.  I suggest sources like Reuters or wired just to name a few. Really look into explanation videos cuz big tech loves y'all confused and focused elsewhere.",
        "created_utc": 1610517784,
        "id": "gj35bc9",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610546584.0
    },
    {
        "author": "good_man_101",
        "body": "I use $100 Motorola and don't miss an iPhone.  Apple is overpriced.  It's the next ge.",
        "created_utc": 1609572887,
        "id": "ght4nbf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609601687.0
    },
    {
        "author": "mtfkgentleman",
        "body": "MSI? Got that from ur username",
        "created_utc": 1609757160,
        "id": "gi222vx",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609785960.0
    },
    {
        "author": "goodbrews",
        "body": "damages law is COMPLETELY different.   Night and day.   I think you are thinking about PCT.   When you file PCT, it gives you the chance to get an initial search and opinion from the ISA which can contribute to your decision to seek rights in many different countries (US, EP, China, Japan, etc).   But that has nothing to do with damages law.   US is very litigious for a reason ;)    European patents dont hold that much value (except for Germany bc there are \"teeth\" in those injunctions).\n\nThis ultimately fizzled, but think of the impact if it hadnt\nhttps://www.theverge.com/2012/5/24/3040859/microsoft-wins-patent-injunction-motorola-germany",
        "created_utc": 1611896655,
        "id": "gl74ezo",
        "score": 1,
        "subreddit": "pennystocks",
        "created": 1611925455.0
    },
    {
        "author": "shakenbake561",
        "body": "Yeah its actually a solid company. MSI",
        "created_utc": 1611032166,
        "id": "gjssby5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611060966.0
    },
    {
        "author": "iambruceli",
        "body": "Why go for Intel and Nvidia's overall AMD system?\n\nIt's simple really…..Perfect Optimization!\n\nYes, be it Hardware Optimization or Driver Optimization Intel &amp; Nvidia has proven to be a better combo for a long time. Take AMD’s Smart Access Memory (SAM) it is great but has lots of compatibility issues with many games out there as not all developers are using the AMD platform for Game Development thanks to Advantages bought by RTX &amp; DLSS. Nvidia always had an upper hand and now Intel and Nvidia have their own version of SAM known as Resizable BAR giving Intel CPU to access all of GPU memory all at once if needed. \n\nPreviously, CPU’s access to the VRAM in a GPU is limited to 256MB for data transferring. When\n\ndata exceeds the limit; it will lead to a performance drop in the system.\n\nBig improvement in calculating efficiency has been realized by decreasing data transfer\n\nbetween CPU and GPU, and instead of collaborating via shared memory as a buffer.\n\nI have seen these improvements on some MSI Laptops which comes with new RTX 3000 Laptops. After looking at those I couldn’t resist but to pre-book one for myself. \n\nTo sum up, MSI implements Intel CPU plus NVIDIA GPU that will technically improve frame-per-second (FPS) by 5%-10%, which is currently the best solution for direct memory access between CPU and GPU. 2021 is going to be a great year for mobile gaming.",
        "created_utc": 1611817619,
        "id": "gl26x59",
        "score": 1,
        "subreddit": "stocks",
        "created": 1611846419.0
    },
    {
        "author": "nosystemsgo",
        "body": "Motorola made the first cell phone, the DynaTAC 8000X, motherfucker: https://mashable-evaporation-wordpress.s3.amazonaws.com/2014/03/moto-dynatac-ads.jpg\n\nBut yeah, you're right about NOK. They're among the leading developers of the 5G network and have real fundamentals as well as being a mature asset. So it's not all meme hype that's driving $NOK.",
        "created_utc": 1611769825,
        "id": "gkz6nbf",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611798625.0
    },
    {
        "author": "HerezahTip",
        "body": "Ryzen 5600x \n\nFinally found a GPU- MSI RTX 3070 x trio\n\nMSI B550 gaming edge WiFi MOBO \n\nI won’t bore you with the memory but it’s all going in a Phanteks P500A RGB 🤩\n\nMost of the Corsair parts are aesthetics",
        "created_utc": 1611333205,
        "id": "gk75xtb",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611362005.0
    },
    {
        "author": "TenF",
        "body": "And NVIDIA. \n\nAnd Motorola. \n\nIt's more than just a pattern.",
        "created_utc": 1611429860,
        "id": "gkfhw8c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611458660.0
    },
    {
        "author": "felixfelix",
        "body": "I came across [this photo](https://i.ytimg.com/vi/wGoM_wVrwng/hqdefault.jpg) recently.  Steve Jobs announcing the iPhone in 2007.  The major competitors were: Motorola, Palm, Nokia, and....Blackberry!",
        "created_utc": 1609768001,
        "id": "gi2eryz",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1609796801.0
    },
    {
        "author": "atdharris",
        "body": "No one can really value Tesla which does make it scary. However, they are more than just a car company like a GM or Toyota. People said the same thing about Apple years ago \"it's worth more than Samsung/Erickson/Nokia/Motorola combined!\" and look where we are now. I gave up worrying and bought 3 shares pre-split for fun and have been happy so far with its performance.",
        "created_utc": 1610031466,
        "id": "gifhgx7",
        "score": 1,
        "subreddit": "investing",
        "created": 1610060266.0
    },
    {
        "author": "yaoksuuure",
        "body": "Motorola...",
        "created_utc": 1610687294,
        "id": "gjbbr8n",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1610716094.0
    },
    {
        "author": "Burrrrrrito",
        "body": "Couldn’t agree more with the sentiment - in a capitalistic system there is always someone trying to steal your lunch money by building a better product or service.  The difference is in this case it’s like the Motorola razor is trying to take on the iPhone.  The current banking/payments system work really well.  \n\nThe Decentralized Finance (DeFi) theme sounds interesting and new - it’s not it’s just deregulated finance.  DeFi won’t work in my view because regulators won’t let it - Finance is an important foundation of the economy - we saw what happened in 2008 when it went off the rails.  In ten years I think we will see it’s hard to disrupt highly regulated industries.  We are starting to see it already - Jack Dorsey is critical of new cryptocurrency regulation.  They are going to find that these regulations aren’t a bug of the system they are a critical feature.\n\nTime will tell.",
        "created_utc": 1609860488,
        "id": "gi6qs4h",
        "score": 1,
        "subreddit": "investing",
        "created": 1609889288.0
    },
    {
        "author": "jbro12345",
        "body": "Well you can watch it on the hub in 480p with your broken Motorola. Now go hibernate in your cave 🌈🐻.",
        "created_utc": 1609854912,
        "id": "gi6gnot",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609883712.0
    },
    {
        "author": "TTheorem",
        "body": "MSI actually looks like it’s gonna continue it’s uptrend",
        "created_utc": 1611849632,
        "id": "gl3v5iw",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611878432.0
    },
    {
        "author": "dabbinthenightaway",
        "body": "You should watch them whole series.\n\nThe big one for me is when he's trying to build a setup and uses a \"pringles can\"  antenna and goes to Microcenter to buy an msi laptop vs the typical best buy /apple bs you see everywhere.\n\nThere's also a whole dark web market subplot that is really on point.  \n\nYes, some of it is still cyberpunk-y, but you should gives it a go.\n\nI put it on par with \"Halt and Catch Fire\"  for internet accuracy.",
        "created_utc": 1609792912,
        "id": "gi3syk7",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609821712.0
    },
    {
        "author": "BenjaminFernwood",
        "body": "She probably rocked this nifty $10000+ cellular phone too.\n\n[https://en.wikipedia.org/wiki/Motorola\\_DynaTAC](https://en.wikipedia.org/wiki/Motorola_DynaTAC)",
        "created_utc": 1609657707,
        "id": "ghwxnxp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1609686507.0
    },
    {
        "author": "fsoto161",
        "body": "Bring back all 2000s cell phone companies. motorola already over 100 but we need to bring NOK and BB to its level",
        "created_utc": 1611340556,
        "id": "gk7vcon",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611369356.0
    },
    {
        "author": "iamsoserious",
        "body": "Motorola is going to take market share from Axon.",
        "created_utc": 1611031886,
        "id": "gjsrvuk",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611060686.0
    },
    {
        "author": "davebu",
        "body": "And MSI",
        "created_utc": 1611417717,
        "id": "gke7adj",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611446517.0
    },
    {
        "author": "stenglboy96",
        "body": "That's motorola..",
        "created_utc": 1611764913,
        "id": "gkyrqmp",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1611793713.0
    },
    {
        "author": "TheOneEyedMan",
        "body": "Look at MSI? I don't even know what i'm doing here.",
        "created_utc": 1612022428,
        "id": "gldlevh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612051228.0
    },
    {
        "author": "nysrpatakemyenergy2",
        "body": "Brain cancer from having the early 90s Motorola against his noggin 12 hours a day",
        "created_utc": 1611790519,
        "id": "gl0mnej",
        "score": 0,
        "subreddit": "investing",
        "created": 1611819319.0
    },
    {
        "author": "DingLeiGorFei",
        "body": "How can Samsung become a major player in the smart phone world when Nokia, Ericsson, Motorola and Black Berry having been going for decades and have the best technological minds playing catch up to Apple?\n\nSee how retarded you sound? Shut the fuck up boomer.",
        "created_utc": 1610881453,
        "id": "gjkg909",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1610910253.0
    },
    {
        "author": "mxpro000",
        "body": "why can’t it become the most valuable company in the world? you sound like steve ballmer comparing motorola to iphone back in the days",
        "created_utc": 1609913065,
        "id": "gi9zdeh",
        "score": -1,
        "subreddit": "stocks",
        "created": 1609941865.0
    },
    {
        "author": "flocho22",
        "body": "I’m like borderline Gen Z I was born in ‘97, I was in 5th grade when everyone’s first phone was either a Nokia or Motorola lol",
        "created_utc": 1611390916,
        "id": "gkbm6vr",
        "score": -6,
        "subreddit": "wallstreetbets",
        "created": 1611419716.0
    },
    {
        "author": "jandres42",
        "body": "When I good blackberry a picture of a Motorola Razr comes up.... BB is not the move lmao",
        "created_utc": 1610635049,
        "id": "gj8be7r",
        "score": -19,
        "subreddit": "wallstreetbets",
        "created": 1610663849.0
    },
    {
        "author": "acididica",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753557,
        "id": "go0uein",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1613782357.0
    },
    {
        "author": "nvrsmr1",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613752905,
        "id": "go0swu9",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613781705.0
    },
    {
        "author": "NuclearReactions",
        "body": "I also like MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753291,
        "id": "go0tsl7",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613782091.0
    },
    {
        "author": "NowLickIt",
        "body": "I'm a big fan of these stocks for no other reason than the letters look good together\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613753061,
        "id": "go0t9jn",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613781861.0
    },
    {
        "author": "DroneCone",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613753360,
        "id": "go0tyaj",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1613782160.0
    },
    {
        "author": "Kac985",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751459,
        "id": "go0pkyk",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613780259.0
    },
    {
        "author": "Kac985",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751444,
        "id": "go0pjnb",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1613780244.0
    },
    {
        "author": "Kac985",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751468,
        "id": "go0plpi",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613780268.0
    },
    {
        "author": "hshieh",
        "body": "Fortinet, Palo Alto Networks, and Proofpoint! Cyber security going to be hot 2021!",
        "created_utc": 1612330823,
        "id": "gltxe6i",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1612359623.0
    },
    {
        "author": "luptonite",
        "body": "I too like these specific stocks\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.",
        "created_utc": 1613753650,
        "id": "go0um6q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1613782450.0
    },
    {
        "author": "Almost_sober",
        "body": "Anybody else playing $FTNT? Such a great company",
        "created_utc": 1612804118,
        "id": "gmll0d0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612832918.0
    },
    {
        "author": "hshieh",
        "body": "I agree but I think the cyber security space is still relatively young compared to the broader tech companies. I can easily see a lot of these going to 50-100B market cap by 2024. We'll see how earnings are this week with fortinet",
        "created_utc": 1612331188,
        "id": "gltxyab",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612359988.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Tuesday, the  2nd of February\n\n\n\n## Upcoming events for Tuesday, February  2nd\n\n - Expected earnings:\n\n  ABG, ALGM, AMCR, AMGN, AMZN, APAM, AQUA, ARCB, ARTW, ATGE, ATHM, ATKR, ATO, BABA, BDN, BEN, BHB, BP, BPY, BR, BRKS, CB, CFBK, CLCT, CMG, CNXN, COP, CRVL, CTLT, DLHC, DOX, EA, EMR, ENTG, EPAY, ETN, FBHS, FEYE, GAIN, GBL, GL, GLDG, GNW, GOOG, GOOGL, GPK, HAE, HCA, HLNE, HMN, HOG, HUBB, IBA, ICHR, IDXX, IESC, IMO, IPHI, ITI, LARK, LFVN, LII, LITE, LPG, LU, MAN, MANH, MCK, MDC, MFGP, MHO, MKL, MLI, MMP, MPC, MPLX, MRCY, MTCH, MUFG, OCFT, PBI, PFE, PINC, PJT, PKI, POWI, POWL, PTRS, RACE, RCL, SALT, SANM, SCSC, SIRI, SMCI, SNE, ST, STE, SWI, SYY, TAK, TCS, TDG, TECH, TENB, TRNS, UPS, UTL, VBFC, VIAV, VRTS, VTOL, WAT, WDR, WVFC, XOM\n\n - Ex-div:\n\n  AM, AMRB, BBD, BBDO, BCBP, CFG, ETRN, FAST, MCBS, NTIC, PNM\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -5.272M)\n    - FOMC Member Mester Speaks\n    - FOMC Member Williams Speaks\n    - IBD/TIPP Economic Optimism (previous: 50.1)\n    - ISM NY Business Conditions (previous: 61.3%)\n    - ISM-New York Index (previous: 817.6)\n    - Redbook (previous: -2.0%)\n    - Redbook (previous: 3.9%)\n    - Total Vehicle Sales (previous: 16.30M)\n\n## Upcoming events for Wednesday, February  3rd\n\n - Expected earnings:\n\n  ABBV, ADTN, AFG, AFL, AGTC, ALGN, ALGT, ALL, AMSC, ANGI, APO, APPS, APTV, ASH, AVB, AVNW, AVTR, AVY, AXTA, BBD, BBDO, BCLI, BIIB, BIP, BSMX, BSX, CCMP, CENT, CENTA, CHKP, CHNG, CHT, CLDB, CNHI, COFS, COHR, COTY, CPRI, CSGS, CSII, CTSH, CTVA, CUB, DGII, DHT, DT, DTE, EBAY, ECHO, ELF, EMKR, ENSG, EPD, EPM, EVR, FMAO, FORM, FSFG, FUNC, GEOS, GLAD, GLUU, GRUB, GSK, GWW, HI, HOFV, HUM, HWM, IAC, IEC, IEX, INGR, INOV, INVA, IO, ISSC, IVAC, JVA, KE, KLAC, KLIC, LAD, LCI, LCNB, LFUS, LGND, LNC, MAA, MDU, MET, MHH, MIME, MSGS, MTOR, MUSA, MWA, MXL, NEU, NMCI, NTGR, NVO, PAHC, PATI, PFGC, PGC, PLUS, PW, PYPL, PZN, QCOM, QNST, QRVO, RGLD, RYN, SAN, SAVE, SC, SENEA, SENEB, SGU, SIMO, SITM, SLAB, SMG, SNDR, SNEX, SPOT, SRDX, STC, SU, SUM, TBI, TGI, THG, TSE, TTMI, TYME, UGI, UHAL, UWMC, VNE, VVV, WNC, WTM, YUMC\n\n - Ex-div:\n\n  BANR, FELE, FUL, GHC, HESM, KBH, NWBI, VBTX, WLKP\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 45K, previous: -123K)\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: -2.085M)\n    - Crude Oil Inventories (consensus: 0.367M, previous: -9.910M)\n    - Cushing Crude Oil Inventories (previous: -2.281M)\n    - Distillate Fuel Production (previous: -0.011M)\n    - EIA Refinery Crude Runs  (previous: -0.039M)\n    - EIA Weekly Distillates Stocks (consensus: -0.400M, previous: -0.815M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.4%, previous: -0.8%)\n    - Gasoline Inventories (consensus: 1.633M, previous: 2.470M)\n    - Gasoline Production (previous: -0.212M)\n    - Heating Oil Stockpiles (previous: 0.055M)\n    - ISM Non-Manufacturing Business Activity (consensus: 57.3, previous: 60.5)\n    - ISM Non-Manufacturing Employment (previous: 48.7)\n    - ISM Non-Manufacturing New Orders (previous: 58.6)\n    - ISM Non-Manufacturing PMI (consensus: 56.8, previous: 57.7)\n    - ISM Non-Manufacturing Prices (previous: 64.4)\n    - MBA 30-Year Mortgage Rate (previous: 2.95%)\n    - MBA Mortgage Applications (previous: -4.1%)\n    - MBA Purchase Index (previous: 334.2)\n    - Markit Composite PMI (previous: 58.0)\n    - Mortgage Market Index (previous: 907.6)\n    - Mortgage Refinance Index (previous: 4,261.5)\n    - Services PMI (previous: 57.5)\n\n## Upcoming events for Thursday, February  4th\n\n - Stock splits:\n\n    - GNTY @ **110:100** (Payable date: 02/12/2021)\n\n - Expected earnings:\n\n  ABB, ABC, AGCO, AINV, AIV, ALCO, ALXN, AME, AMRK, ANIX, AOSL, APD, APDN, ARNC, ARRY, ARW, ARWR, ATVI, AVXL, BAX, BCE, BCO, BDX, BEP, BHE, BILL, BLL, BMY, BRBR, BRT, BSAC, BSBK, BSGM, BSIG, BTU, BV, CARR, CCS, CDR, CG, CI, CLX, CMI, CMS, COLM, COR, CPT, CRC, CSL, CTHR, CURO, CZNC, DB, DD, DECK, DGX, DHX, DLX, DSPG, DX, DXC, DYN, EIGI, ENTA, ENVA, EQNR, ESS, EURN, EVBN, EXPO, F, FARM, FFG, FLT, FOUR, FTNT, FTV, GHL, GILD, GLOG, GLOP, GLT, GOOS, GPI, GPRO, GTIM, HIG, HIMX, HL, HSY, HUBG, ICE, IMKTA, IMRA, ING, IP, IRMD, JHG, KBAL, KN, KYMR, LANC, LBRT, LEA, LEE, LGF.A, LGF.B, LPLA, LPTH, LQDT, LSPD, LTRN, MCHP, MDP, MEIP, MLVF, MMS, MNR, MOD, MPW, MPWR, MRK, MSGN, MSI, MSON, MTD, MTX, MYGN, NBIX, NEWR, NFG, NGL, NGVC, NICK, NJR, NKSH, NLOK, NMR, NNA, NOK, NOV, NRZ, NS, NWS, NWSA, NYT, OCSI, OCSL, ODFL, OESX, OFC, OHI, ONEW, ONTO, ORIC, OTEX, PBH, PCTY, PDEX, PENN, PFPT, PFSI, PH, PINS, PIPR, PLT, PM, PMT, POST, PRO, PRU, PTEN, PTON, PXLW, PZG, RDS.A, RDS.B, RFP, RGS, RL, SBH, SKX, SKYW, SNA, SNAP, SOGO, SOHU, SPH, SQFT, SR, STLA, SVM, SXC, SXI, SYNA, TDC, THFF, THR, TKR, TM, TMUS, TNAV, TOT, TPL, TPR, TRNO, TW, TWST, U, UEPS, UL, ULBI, ULH, UNM, USAK, USAT, UTI, VREX, VRTU, VSAT, VSTO, WD, WEC, WERN, WLL, WMS, WWE, WYNN, XYL, YRCW, YTRA, YUM, ZEN\n\n - Ex-div:\n\n  AFB, AMSWA, BKEP, BMRC, BPFH, BRO, CADE, CEQP, CFFN, CIT, CMCO, CMS, COST, DCOM, DCP, DHF, FCBC, FCF, FE, FFWM, FHI, FRAF, GMLP, GPP, HOPE, IBCP, IBOC, IDA, JBHT, LBC, LW, MET, MMLP, MMP, NBLX, NEA, NEP, NSC, NYCB, PNFP, PPBI, RELL, SSSS, SYF, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.065%)\n    - Challenger Job Cuts (previous: 77.030K)\n    - Continuing Jobless Claims (consensus: 4,700K, previous: 4,771K)\n    - Durables Excluding Defense (previous: 0.5%)\n    - FOMC Member Daly Speaks\n    - Factory Orders (consensus: 0.7%, previous: 1.0%)\n    - Factory orders ex transportation (previous: 0.8%)\n    - Initial Jobless Claims (consensus: 830K, previous: 847K)\n    - Jobless Claims 4-Week Avg. (previous: 868.00K)\n    - Natural Gas Storage (consensus: -136B, previous: -128B)\n    - Nonfarm Productivity (consensus: -2.8%, previous: 4.6%)\n    - Unit Labor Costs (consensus: 3.9%, previous: -6.6%)\n\n## Upcoming events for Friday, February  5th\n\n - Expected earnings:\n\n  ADNT, ALUS, AON, ASX, ATLO, AYRO, BBU, BERY, BH.A, BRID, CAH, CBOE, CIVB, CSWI, CWBC, DJCO, EAF, EL, FE, FGBI, GRC, HMC, HRC, IBN, IHT, INTG, ITW, JOUT, LAZ, LIN, LIVX, NATH, OIIM, PFIS, RBKB, REGN, ROAD, SKM, SMMF, SNY, SPB, TT, UI, VIVO, ZBH\n\n - Ex-div:\n\n  AAPL, AROC, ARTNA, ASRV, AWK, BCO, BX, CSV, CWT, EBTC, ET, GAM, GLOP, GLP, GROW, GWW, HAFC, HBCP, HBT, INTC, LBAI, MATW, MPLX, MRLN, NATI, NS, NSEC, OCFC, OHI, PCTI, PEBO, PZZA, RBNC, SJW, STND, SUN, WABC, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 5.1%, previous: 5.1%)\n    - Average Hourly Earnings (consensus: 0.3%, previous: 0.8%)\n    - Average Weekly Hours (consensus: 34.7, previous: 34.7)\n    - CFTC Aluminium speculative net positions (previous: 3.2K)\n    - CFTC Copper speculative net positions (previous: 70.3K)\n    - CFTC Corn speculative net positions (previous: 547.7K)\n    - CFTC Crude Oil speculative net positions (previous: 504.6K)\n    - CFTC Gold speculative net positions (previous: 257.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 39.7K)\n    - CFTC Natural Gas speculative net positions (previous: 11.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -28.4K)\n    - CFTC Silver speculative net positions (previous: 54.5K)\n    - CFTC Soybeans speculative net positions (previous: 236.4K)\n    - CFTC Wheat speculative net positions (previous: 36.2K)\n    - Consumer Credit (consensus: 12.00B, previous: 15.27B)\n    - Government Payrolls (previous: -45.0K)\n    - Manufacturing Payrolls (consensus: 30K, previous: 38K)\n    - Nonfarm Payrolls (consensus: 50K, previous: -140K)\n    - Participation Rate (previous: 61.5%)\n    - Payrolls Benchmark (previous: -514.00)\n    - Payrolls Benchmark, n.s.a. (previous: -173.00K)\n    - Private Nonfarm Payrolls (consensus: 45K, previous: -95K)\n    - Trade Balance (consensus: -65.70B, previous: -68.10B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 289)\n    - U.S. Baker Hughes Total Rig Count (previous: 378)\n    - U6 Unemployment Rate (previous: 11.7%)\n    - Unemployment Rate (consensus: 6.7%, previous: 6.7%)\n\n^^^^2021-02-02",
        "created_utc": 1612263635,
        "id": "glpu4y9",
        "score": 1,
        "subreddit": "RobinHood",
        "created": 1612292435.0
    },
    {
        "author": "BigWilllly69420",
        "body": "if you think cybersecurity is going to be hot I recommend FORTINET (FTNT). Its probably one of the best companies in this sector with consistent revenue growth and a really good balance sheet. Their management also looks top tier too with a lot of experience",
        "created_utc": 1612865248,
        "id": "gmom45l",
        "score": 1,
        "subreddit": "stocks",
        "created": 1612894048.0
    },
    {
        "author": "CadperGN",
        "body": "The difference with CHKP, FTNT and CSCO is they make profit. Neither Palo Alto, zscaler nor cloudflare does that at the moment.",
        "created_utc": 1613454262,
        "id": "gnm9wku",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613483062.0
    },
    {
        "author": "CyberConnoisseur",
        "body": "I'm aware what Check Points are.  I actually own SMB versions of all 3 vendors.  Palo, Fortinet, Checkpoint, all do the same NGFW stuff - IPS/Content Inspection, DNS Security, Decryption, etc...  All of these features are being disrupted by cloud-native products like Cloudflare, Zscaler, and cloud providers like AWS/Azure.\n\nThe \"cloud\" sentiment is happening whether its your thing or not.  The biggest companies on earth are abandoning their data centers.  It is simply more cost and risk effective.  Will it happen tomorrow? No. But it is a fact that pure cloud is going to be the dominant way IT departments function in the future.  We'll see \"hybrid cloud\" for a while, but it wont last.  \n\n\nRegulatory and compliance requirements are changing regulations to accommodate cloud only environments as everyone agrees this is the way forward.  \n\n\nI don't think that Checkpoint is a *bad* investment.  I just don't see any explosive growth potential coming from them long term.  As others have said, r/wallstreetbets is for rapid tenderloin accumulation.\n\nDisclaimer:  ***Not a financial advisor or anything of the sort. This is not investment advice.***",
        "created_utc": 1613414155,
        "id": "gnk5bo2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613442955.0
    },
    {
        "author": "silicapacks",
        "body": "I already have FTNT, PFPT. Was thinking they'll consolidate while something else goes up like 12%. But as I write this, I'm thinking this was the 12% rocket across the board.",
        "created_utc": 1612287380,
        "id": "glr8z4a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1612316180.0
    },
    {
        "author": "AngryBiteyPlatypus",
        "body": "Also thinking of going into FTNT.",
        "created_utc": 1613095073,
        "id": "gn0fl5m",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613123873.0
    },
    {
        "author": "_trashedbags",
        "body": "I’m late 20’s and thinking about starting to invest now I’m earning a reasonable wage. I’ve been gaining exposure to Fortinet at work and want to make it my first long investment.  \n\nExpanding features targeting med-large orgs and businesses and leading in Gartner magic quadrants, blah blah. \n\n  \n\nAlas I’m a retarded ape and would appreciate hearing another ape’s thoughts",
        "created_utc": 1613130970,
        "id": "gn1t1st",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613159770.0
    },
    {
        "author": "mimik987",
        "body": " \n\nHey there, this is Tom, this is one of my accounts, not sure which as I tend to lose passwords and end up making new accounts... :). I just finished reading this post and I want to stress I have no hate or anger towards the OP, but I'd like to offer my side of story if you may:\n\n1. I think the OP should have disclosed he is managing a competing youtube channel in the same niche as me. Its a smaller channel and it is pretty much the same content and audience. Not saying he did this to clout chase, as I am sure his motives are pure, but he needed to disclose this fact and omitting it is kinda weird... (especially since he posted this exact post in multiple YouTube promotion groups...)\n2. He couldn't find my intro video after viewing it once: That is because it will only auto play for first time visitors, for repeat visitors the page plays the recent video posted instead of the intro. That point amused me...\n3. I only do small cap stocks and trendy stocks: here is an excel spreadsheet which I keep of every stock I covered, Its open to my subscribers to audit me at any moment. You will soon find out I cover large cap blue chip stocks (apart from 2 stocks) like CRM, MSFT, ORCL, FTNT, TSLA, TWLO and many others. [https://docs.google.com/spreadsheets/d/1bR4KloyKmRXqY-Eh2nG-fs4-yRqDpfnkTpCYIgh1Q3E/edit#gid=0](https://docs.google.com/spreadsheets/d/1bR4KloyKmRXqY-Eh2nG-fs4-yRqDpfnkTpCYIgh1Q3E/edit#gid=0)\n4. He couldn’t find my credentials on social media: I’ve said this many times before that Tom Nash is a stage name, I am a Russian guy and this name is not my legal name. Exposing this seems to me a bit strange after I made a video explaining that months ago. My real social media is obviously not under this name and since I want to keep my privacy I won’t disclose it ever. I want to protect my own identity. I got a family and kids so I think most of you would agree that is the smart move. Saying my credentials don't show up on my fake profile on linkedin is kinda funny...\n5. I did other youtube channels, including gaming, audio and youtube education: My youtube passion is not something new, I was doing youtube for years, including educational content and even an audio channel. I could have deleted these old channels but I keep them up since its NOT a secret lol. One channel is called gearly reviews and we posted once every few months. We actually have a few videos that got millions of views there and I’m proud of that channel. Which I wish I had more time to work on. My youtube educational videos are mostly gone now since it’s trash but some can be found here and there and they are cringe. I do still run a youtube group for creators and I posted about it many times on my channel asking people to join if they want to do youtube. It’s sponsored by TubeBuddy and we plan to revive it and post much more content there to help creators. I always did youtube on the side as a hobby and obviously I was trying to find my audience and become a full time YouTube, this was always my dream and exposing this item is kinda pointless. I even had a gaming channel called gamernomics but it’s gone now since I feel I was so cringe. I’m still a massive gamer though even with 3 kids... for me saying I was always passionate about youtube and using the fact I tried to break through as proof I’m a fraud is strange lol. Funny enough I only broke through when I quit my job and went all in on this channel without a safety net.\n6. My guru exposed videos: I loved doing guru exposed videos but I kinda shifted away from this since it’s very taxing emotionally being negative and going at people. When I moved into the stock scene it wasn’t as big and in fact my views took a hit. My Ignite and NKLA videos used to get massive views which my stock videos will never get but I love it so I’ll keep doing it. It’s true I have no courses or affiliate links on my channel but I do have channel membership and a big Patreon community, since I am trying to make it into a viable business, don’t think there is something wrong here.\n7. As far as work, and what I did. It’s very simple. After graduating from Umich I was lucky to even find a job in 2009. Started as an intern at a major investment bank for 40k per year and moved my way up. Eventually moved up to senior analyst. Never claimed I was managing director or a VP or a stock broker lol. I then moved back to my country and got a job at one of the BIG4 companies (EY, PWC, DTT, KPMG). Just so you know every big4 has a multiple divisions and I ended up working for the financial division doing valuations, due diligence and a lot of transnational work related to M&amp;A. My job was to look at financials and find out how valuable the company really is. Eventually burned out and quit to decide to go in on YT and here we are.\n\nNo hate from me to the OP. It’s all good. Much love Tom.",
        "created_utc": 1613133602,
        "id": "gn1wff0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1613162402.0
    },
    {
        "author": "Temp-namee",
        "body": "I’ve been following checkpoint for a while but Fortinet and Palalto seem to have taken a lot of share. They continue to grow faster as well.",
        "created_utc": 1613429324,
        "id": "gnl0sqs",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613458124.0
    },
    {
        "author": "Earth_Science_Is_Lit",
        "body": "Cyber-security long by weight CRWD, OKTA, PANW, FTNT and I think MSFT should be added to this category",
        "created_utc": 1613411236,
        "id": "gnjz71t",
        "score": 1,
        "subreddit": "options",
        "created": 1613440036.0
    },
    {
        "author": "CadperGN",
        "body": "Thanks for this addition.\n\nI guess the buzzword for vendor is depending on where you look as all I hear is that the management interface and the distribution of ruleset is so much better on the Check Point gear. That said Check Point is not only a firewall. It's an IPS blade with a firewall. Something (some of) the others charge extra for.\n\nThe sentiment for \"all cloud\" is not my thing. I don't believe in cloud-only for a cross-sector and industry as the replacement for on-prem. Cloud may work on a broad scale for some industries and sectors but I recon we'll see more agnostic and hybrid environments being the norm when we're done buzzwording (as if that ever happens in infosec lol). At some point in time regulation may follow but some things simply don't work well in the cloud (legislation and other outside factors).\n\nAbout IaC, I see Check Point being much more on-par than for example Cisco. I haven't worked with Fortinet or Palo Alto although we had a sales meeting with Palo Alto for some of the \"Next Gen Slideware\" they had which I (personal preference) did not like at all. I really do believe that the government wide investment into Cyber Security that Isreal has made will benefit the vendors from there. Cyberark may also be one to benefit although they are far to expensive for my liking atm.\n\nAbout Fortinet. I haven't had time to proper dig into them yet but the fundamentals python code I've got really have them as a candidate for a rocket in price.\n\nI'm glad to see a fellow Security-person here :-)",
        "created_utc": 1613413522,
        "id": "gnk3zl6",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613442322.0
    },
    {
        "author": "Pma2kdota",
        "body": "MMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, HEY, SU, CK, MY, NUTS, MEL, VIN, CAP, IT, AL, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, WE, LI, KE, THE, STO, CK, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613751658,
        "id": "go0q1so",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613780458.0
    },
    {
        "author": "The_Egg_",
        "body": "**GREENLIGHT CAPITAL**\n\n* Top new buys: **DNMR**, ~~FUBO, ADT, CLOV, SATS, SONO, NPA~~\n* Boosted stakes in: REZI, **TECK**, CNX, DDS, AAWW\n\n**WHALE ROCK CAPITAL MANAGEMENT**\n\n* Top new buys: ~~DIS, UBER, ZS, SMAR, EXPE, FTCH, TRIP,~~ **BILI**, **EGHT, PDD**\n* Top exits: W, BABA, MSFT, AVLR, FTNT, STNE, AMD, AYX, CDAY, NOW\n* Boosted stakes in: **CRWD, CVNA, TSM, PINS, CREE, MDB, FIVN, SQ, SE, CRUS**\n* Cut stakes in: AMZN, JD, FB, ZM, OKTA, SHOP, COUP, NVDA, MPWR, FSLY",
        "created_utc": 1613727721,
        "id": "gnzorp0",
        "score": 1,
        "subreddit": "SecurityAnalysis",
        "created": 1613756521.0
    },
    {
        "author": "CyberConnoisseur",
        "body": "Couldn't agree more.  I think all the big NGFW firewall players are in trouble - fortinet, Palo, Checkpoint, even Cisco. Zcaler and Cloudflare are going to eat them alive or atleast the general pure cloud adoption will.  \n\n\nImagine deploying a Checkpoint, Fortinet, Palo VM in AWS with a serious face....",
        "created_utc": 1613447256,
        "id": "gnlyk1a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613476056.0
    },
    {
        "author": "SociallyUnder_a_Rock",
        "body": "About 30% (~$1,500) of my portfolio is BB and GME. Should I sell them and invest elsewhere?\nI'm a small-time investor in US with about $4K in stock. Last year, I managed to increased it by 50% on stocks like PANW, AMD, FTNT. \nHowever, most of my gains got wipes last month on GME (8@ $285) &amp; BB (48@ $17), and I'm wondering if it would be better to just abandon the two and go back to my last year's strategy.\nFYI, I'm currently an unemployed college undergraduate with no debt and my goal is to eventually create an emergency funds with stocks by 2025~2027.",
        "created_utc": 1612852307,
        "id": "gmo80oy",
        "score": 1,
        "subreddit": "investing",
        "created": 1612881107.0
    },
    {
        "author": "TicTicB00M",
        "body": "Well these are the stocks i like and in this specific order, unless it's a Monday following a 4-day trading week, if the 12th of the month falls on a Thursday or it's after-hours market in which case you reverse all the ticker symbols and then those are the stocks I like:\n\nMGM, MCHP, MU, MSFT, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS MMM, ABT, ABBV, ABMD,  AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB.  \n\n\nEdit: i am not a financial professional...i don't lose enough money to be considered one yet",
        "created_utc": 1613750102,
        "id": "go0miti",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613778902.0
    },
    {
        "author": "jherndon22",
        "body": "I copy pasted those stock tickers and posted. Here’s some more to fuck em up.\n\nstocks I like - \nMMM, ABT, ABBV, ABMD, ACN, ATVI, ADBE, AMD, AAP, AES, AFL, A, APD, AKAM, ALK, ALB, ARE, ALXN, ALGN, ALLE, AGN, ADS, LNT, ALL, GOOGL, GOOG, MO, AMZN, AMCR, AEE, AAL, AEP, AXP, AIG, AMT, AWK, AMP, ABC, AME, AMGN, APH, ADI, ANSS, ANTM, AON, AOS, APA, AIV, AAPL, AMAT, APTV, ADM, ARNC, ANET, AJG, AIZ, ATO, T, ADSK, ADP, AZO, AVB, AVY, BKR, BLL, BAC, BK, BAX, BDX, BRK.B, BBY, BIIB, BLK, BA, BKNG, BWA, BXP, BSX, BMY, AVGO, BR, BF.B, CHRW, COG, CDNS, CPB, COF, CPRI, CAH, KMX, CCL, CAT, CBOE, CBRE, CDW, CE, CNC, CNP, CTL, CERN, CF, SCHW, CHTR, CVX, CMG, CB, CHD, CI, XEC, CINF, CTAS, CSCO, C, CFG, CTXS, CLX, CME, CMS, KO, CTSH, CL, CMCSA, CMA, CAG, CXO, COP, ED, STZ, COO, CPRT, GLW, CTVA, COST, COTY, CCI, CSX, CMI, CVS, DHI, DHR, DRI, DVA, DE, DAL, XRAY, DVN, FANG, DLR, DFS, DISCA, DISCK, DISH, DG, DLTR, D, DOV, DOW, DTE, DUK, DRE, DD, DXC, ETFC, EMN, ETN, EBAY, ECL, EIX, EW, EA, EMR, ETR, EOG, EFX, EQIX, EQR, ESS, EL, EVRG, ES, RE, EXC, EXPE, EXPD, EXR, XOM, FFIV, FB, FAST, FRT, FDX, FIS, FITB, FE, FRC, FISV, FLT, FLIR, FLS, FMC, F, FTNT, FTV, FBHS, FOXA, FOX, BEN, FCX, GPS, GRMN, IT, GD, GE, GIS, GM, GPC, GILD, GL, GPN, GS, GWW, HRB, HAL, HBI, HOG, HIG, HAS, HCA, PEAK, HP, HSIC, HSY, HES, HPE, HLT, HFC, HOLX, HD, HON, HRL, HST, HPQ, HUM, HBAN, HII, IEX, IDXX, INFO, ITW, ILMN, IR, INTC, ICE, IBM, INCY, IP, IPG, IFF, INTU, ISRG, IVZ, IPGP, IQV, IRM, JKHY, J, JBHT, SJM, JNJ, JCI, JPM, JNPR, KSU, K, KEY, KEYS, KMB, KIM, KMI, KLAC, KSS, KHC, KR, LB, LHX, LH, LRCX, LW, LVS, LEG, LDOS, LEN, LLY, LNC, LIN, LYV, LKQ, LMT, L, LOW, LYB, MTB, M, MRO, MPC, MKTX, MAR, MMC, MLM, MAS, MA, MKC, MXIM, MCD, MCK, MDT, MRK, MET, MTD, MGM, MCHP, MU, MSFT, MAA, MHK, TAP, MDLZ, MNST, MCO, MS, MOS, MSI, MSCI, MYL, NDAQ, NOV, NTAP, NFLX, NWL, NEM, NWSA, NWS, NEE, NLSN, NKE, NI, NBL, JWN, NSC, NTRS, NOC, NLOK, NCLH, NRG, NUE, NVDA, NVR, ORLY, OXY, ODFL, OMC, OKE, ORCL, PCAR, PKG, PH, PAYX, PAYC, PYPL, PNR, PBCT, PEP, PKI, PRGO, PFE, PM, PSX, PNW, PXD, PNC, PPG, PPL, PFG, PG, PGR, PLD, PRU, PEG, PSA, PHM, PVH, QRVO, PWR, QCOM, DGX, RL, RJF, RTN, O, REG, REGN, RF, RSG, RMD, RHI, ROK, ROL, ROP, ROST, RCL, SPGI, CRM, SBAC, SLB, STX, SEE, SRE, NOW, SHW, SPG, SWKS, SLG, SNA, SO, LUV, SWK, SBUX, STT, STE, SYK, SIVB, SYF, SNPS, SYY, TMUS, TROW, TTWO, TPR, TGT, TEL, FTI, TFX, TXN, TXT, TMO, TIF, TJX, TSCO, TDG, TRV, TFC, TWTR, TSN, UDR, ULTA, USB, UAA, UA, UNP, UAL, UNH, UPS, URI, UTX, UHS, UNM, VFC, VLO, VAR, VTR, VRSN, VRSK, VZ, VRTX, VIAC, V, VNO, VMC, WRB, WAB, WMT, WBA, DIS, WM, WAT, WEC, WFC, WELL, WDC, WU, WRK, WY, WHR, WMB, WLTW, WYNN, XEL, XRX, XLNX, XYL, YUM, ZBRA, ZBH, ZION, ZTS",
        "created_utc": 1613752229,
        "id": "go0rd38",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1613781029.0
    },
    {
        "author": "sergiomack",
        "body": "FTNT gang where you at?",
        "created_utc": 1613589060,
        "id": "gnsoqjh",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1613617860.0
    },
    {
        "author": "VegetableInterest4",
        "body": "The tech sector is in a shit spot now. Explains why it has an even worse downturn. PLTR had a sell volume of 69M today at market open.\n\nPLTR might still be dropping until about 21 or 20 maximum imo. \n\nI hope it recovers though. It is a cybersecurity company that worked on US government military contracts and with the CIA, recently had a contract with IBM but IBM had a garbage last report (with the pervious ones also being bad) also, so I do not see much +++ in the following 1-2 weeks. After that it might get better I hope.\n\nIn the long run/big picture a tech company is always a good investment unless their employees are completely braindead. I wouldn't say they are so stupid in this example since they have worked with the military and they should not be lenient work partners imo.\n\nThe behavior pattern I have noticed with PLTR is that when all the other stocks are doing poor PLTR is still doing well or it is sometimes Workhorse GRP, the traders need something to fill their daily trades even on red days.\n\nThose days are mostly just up and down jumps and lots of short selling on a 1-5 minute time range.\n\nThey did unlock the stock from the IPO either today or it might be on Friday, not sure about this information though. \n\nAny time a \"hack\" attack happens or similar security breach, this stock also tends to have a somewhat of a rising. Similar with other companies for cybersecurity like Fortinet, Qualys and Splunk.\n\nIn general I would say to stay away from this until late evening Friday 21:55 and then buy and hope for next Monday market opener to be a better restart.\n\nNon legally binding advice.\n\nI do own the stock.",
        "created_utc": 1613693568,
        "id": "gny7m45",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1613722368.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Wednesday, the  3rd of February\n\n\n\n## Upcoming events for Wednesday, February  3rd\n\n - Expected earnings:\n\n  ABBV, ADTN, AFG, AFL, AGTC, ALGN, ALGT, ALL, AMSC, ANGI, APO, APPS, APTV, ASH, AVB, AVNW, AVTR, AVY, AXTA, BBD, BBDO, BCLI, BIIB, BIP, BSMX, BSX, CCMP, CENT, CENTA, CHKP, CHNG, CHT, CNHI, COHR, COTY, CPRI, CSGS, CSII, CTSH, CTVA, DGII, DT, DTE, EBAY, ECHO, ELF, EMKR, ENSG, EPD, EPM, EVR, FMAO, FORM, FUNC, GEOS, GLAD, GRUB, GSK, GWW, HI, HOFV, HUM, HWM, IAC, IEC, IEX, INGR, INOV, INVA, IO, IVAC, KE, KLAC, KLIC, LAD, LCI, LFUS, LGND, LNC, MAA, MDU, MET, MIME, MSGS, MTOR, MUSA, MWA, MXL, NEU, NMCI, NTGR, NVO, PAHC, PATI, PFGC, PLUS, PW, PYPL, PZN, QCOM, QNST, QRVO, RGLD, RYN, SAN, SAVE, SC, SENEA, SENEB, SGU, SIMO, SITM, SLAB, SMG, SNDR, SNEX, SPOT, STC, SU, SUM, TBI, TGI, THG, TSE, TTMI, TYME, UGI, UHAL, UWMC, VNE, VVV, WNC, WTM, YUMC\n\n - Ex-div:\n\n  BANR, FELE, FUL, GHC, HESM, KBH, NWBI, VBTX, WLKP\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 49K, previous: -123K)\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: -2.085M)\n    - Crude Oil Inventories (consensus: 0.446M, previous: -9.910M)\n    - Cushing Crude Oil Inventories (previous: -2.281M)\n    - Distillate Fuel Production (previous: -0.011M)\n    - EIA Refinery Crude Runs  (previous: -0.039M)\n    - EIA Weekly Distillates Stocks (consensus: -0.429M, previous: -0.815M)\n    - EIA Weekly Refinery Utilization Rates (consensus: 0.1%, previous: -0.8%)\n    - FOMC Member Bullard Speaks\n    - FOMC Member Harker Speaks\n    - FOMC Member Kaplan Speaks\n    - FOMC Member Mester Speaks\n    - Gasoline Inventories (consensus: 1.134M, previous: 2.470M)\n    - Gasoline Production (previous: -0.212M)\n    - Heating Oil Stockpiles (previous: 0.055M)\n    - ISM Non-Manufacturing Business Activity (consensus: 57.3, previous: 60.5)\n    - ISM Non-Manufacturing Employment (previous: 48.7)\n    - ISM Non-Manufacturing New Orders (previous: 58.6)\n    - ISM Non-Manufacturing PMI (consensus: 56.8, previous: 57.7)\n    - ISM Non-Manufacturing Prices (previous: 64.4)\n    - MBA 30-Year Mortgage Rate (previous: 2.95%)\n    - MBA Mortgage Applications (previous: -4.1%)\n    - MBA Purchase Index (previous: 334.2)\n    - Markit Composite PMI (previous: 58.0)\n    - Mortgage Market Index (previous: 907.6)\n    - Mortgage Refinance Index (previous: 4,261.5)\n    - Services PMI (previous: 57.5)\n\n## Upcoming events for Thursday, February  4th\n\n - Stock splits:\n\n    - GNTY @ **110:100** (Payable date: 02/12/2021)\n\n - Expected earnings:\n\n  ABB, ABC, AGCO, AINV, AIV, ALCO, ALXN, AME, AMRK, AOSL, APD, APDN, ARNC, ARRY, ARW, ARWR, ATVI, AVXL, BAX, BCE, BCO, BDX, BEP, BHE, BILL, BLL, BMY, BRBR, BRT, BSAC, BSBK, BSGM, BSIG, BTU, BV, CCS, CDR, CG, CI, CLX, CMI, CMS, COLM, COR, CPT, CRC, CSL, CTHR, CURO, CZNC, DB, DECK, DGX, DHX, DLX, DSPG, DX, DXC, DYN, EIGI, ENTA, ENVA, EQNR, ESS, EURN, EVBN, EXPO, F, FARM, FFG, FLT, FOUR, FTNT, FTV, GHL, GILD, GLOG, GLOP, GLT, GOOS, GPI, GPRO, GTIM, HIG, HIMX, HL, HSY, HUBG, ICE, IMKTA, IMRA, ING, IP, IRMD, JHG, KBAL, KN, KYMR, LANC, LBRT, LEA, LEE, LGF.A, LGF.B, LPLA, LPTH, LQDT, LSPD, LTRN, MCHP, MDP, MEIP, MLVF, MMS, MNR, MOD, MPW, MPWR, MRK, MSGN, MSI, MSON, MTA, MTD, MTX, MYGN, NBIX, NEWR, NFG, NGL, NGVC, NICK, NJR, NKSH, NLOK, NMR, NNA, NOK, NOV, NRZ, NS, NWS, NWSA, NYT, OCSI, OCSL, ODFL, OESX, OFC, OHI, ONEW, ONTO, ORIC, OTEX, PBH, PCTY, PDEX, PENN, PFPT, PFSI, PH, PINS, PIPR, PLT, PM, PMT, POST, PRO, PRU, PTEN, PTON, PXLW, PZG, RDS.A, RDS.B, RFP, RGS, RL, SBH, SKX, SKYW, SNA, SNAP, SOGO, SOHU, SPH, SQFT, SR, STLA, SVM, SXC, SXI, SYNA, TDC, THFF, THR, TKR, TM, TMUS, TNAV, TOT, TPL, TPR, TRNO, TW, TWST, U, UEPS, UL, ULBI, ULH, UNM, USAK, USAT, UTI, VREX, VRTU, VSAT, VSTO, WD, WEC, WERN, WLL, WMS, WWE, WYNN, XYL, YRCW, YTRA, YUM, ZEN\n\n - Ex-div:\n\n  AFB, AMSWA, BKEP, BMRC, BPFH, BRO, CADE, CEQP, CFFN, CIT, CMCO, CMS, COST, DCOM, DCP, DHF, FCBC, FCF, FE, FFWM, FHI, FRAF, GMLP, GPP, HOPE, IBCP, IBOC, IDA, JBHT, LBC, LW, MET, MMLP, MMP, NBLX, NEA, NEP, NSC, NYCB, PNFP, PPBI, RELL, SSSS, SYF, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.065%)\n    - Challenger Job Cuts (previous: 77.030K)\n    - Continuing Jobless Claims (consensus: 4,700K, previous: 4,771K)\n    - Durables Excluding Defense (previous: 0.5%)\n    - FOMC Member Daly Speaks\n    - Factory Orders (consensus: 0.7%, previous: 1.0%)\n    - Factory orders ex transportation (previous: 0.8%)\n    - Initial Jobless Claims (consensus: 830K, previous: 847K)\n    - Jobless Claims 4-Week Avg. (previous: 868.00K)\n    - Natural Gas Storage (consensus: -136B, previous: -128B)\n    - Nonfarm Productivity (consensus: -2.8%, previous: 4.6%)\n    - Unit Labor Costs (consensus: 4.0%, previous: -6.6%)\n\n## Upcoming events for Friday, February  5th\n\n - Expected earnings:\n\n  ADNT, AENZ, ALUS, AON, ASX, ATLO, AYRO, BBU, BERY, BH.A, BHAT, CAH, CBOE, CIVB, CSWI, DJCO, EAF, EL, FCCY, FE, FGBI, GENC, GRC, GROW, HMC, HRC, IBN, INTG, ITW, JOUT, LAZ, LIN, LIVX, NATH, OIIM, RBKB, REGN, ROAD, SCX, SKM, SMFG, SNY, SPB, TCFC, TT, UI, VIVO, ZBH\n\n - Ex-div:\n\n  AAPL, AROC, ARTNA, ASRV, AWK, BCO, BX, CLAR, CSV, CWT, EBTC, ET, FBIZ, FBK, GAM, GLOP, GLP, GROW, GWW, HAFC, HBCP, HBT, INTC, LBAI, MATW, MPLX, MRLN, NATI, NS, NSEC, OCFC, OHI, PCTI, PEBO, PZZA, RBNC, SJW, STND, SUN, WABC, WVFC, X\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 5.0%, previous: 5.1%)\n    - Average Hourly Earnings (consensus: 0.3%, previous: 0.8%)\n    - Average Weekly Hours (consensus: 34.7, previous: 34.7)\n    - CFTC Aluminium speculative net positions (previous: 3.2K)\n    - CFTC Copper speculative net positions (previous: 70.3K)\n    - CFTC Corn speculative net positions (previous: 547.7K)\n    - CFTC Crude Oil speculative net positions (previous: 504.6K)\n    - CFTC Gold speculative net positions (previous: 257.5K)\n    - CFTC Nasdaq 100 speculative net positions (previous: 39.7K)\n    - CFTC Natural Gas speculative net positions (previous: 11.6K)\n    - CFTC S&amp;P 500 speculative net positions (previous: -28.4K)\n    - CFTC Silver speculative net positions (previous: 54.5K)\n    - CFTC Soybeans speculative net positions (previous: 236.4K)\n    - CFTC Wheat speculative net positions (previous: 36.2K)\n    - Consumer Credit (consensus: 12.00B, previous: 15.27B)\n    - Government Payrolls (previous: -45.0K)\n    - Manufacturing Payrolls (consensus: 30K, previous: 38K)\n    - Nonfarm Payrolls (consensus: 50K, previous: -140K)\n    - Participation Rate (previous: 61.5%)\n    - Payrolls Benchmark (previous: -514.00)\n    - Payrolls Benchmark, n.s.a. (previous: -173.00K)\n    - Private Nonfarm Payrolls (consensus: 60K, previous: -95K)\n    - Trade Balance (consensus: -65.70B, previous: -68.10B)\n    - U.S. Baker Hughes Oil Rig Count (previous: 289)\n    - U.S. Baker Hughes Total Rig Count (previous: 378)\n    - U6 Unemployment Rate (previous: 11.7%)\n    - Unemployment Rate (consensus: 6.7%, previous: 6.7%)\n\n^^^^2021-02-03",
        "created_utc": 1612350021,
        "id": "gluke83",
        "score": 0,
        "subreddit": "RobinHood",
        "created": 1612378821.0
    },
    {
        "author": "qtwitaboooty",
        "body": "Anyone playing FTNT?",
        "created_utc": 1612372050,
        "id": "glvqo24",
        "score": -2,
        "subreddit": "wallstreetbets",
        "created": 1612400850.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Monday, the  1st of February\n\n\n\n## Upcoming events for Monday, February  1st\n\n - Stock splits:\n\n    - EFRTF @ **1:4**\n\n - Expected earnings:\n\n  ADUS, AKTS, AMG, ARE, ARLP, BCH, CACC, CBT, CMRE, CRUS, CSWC, EZPW, FN, HLIT, IBTX, ITUB, IX, KMPR, KMT, KRC, LBRDA, LBRDK, LND, LUB, MNOV, MRBK, MTSC, NRIM, NSSC, NTP, NXPI, OMCL, ON, OTIS, OXLC, PBHC, PCH, QTNT, RBC, RGCO, RMBS, RMR, RYAAY, SBT, SKY, SVBI, SXI, TESS, TMO, VRTX, WMG, WWD\n\n - Ex-div:\n\n  CAPL, CPLP, CRS, DGICA, DGICB, DKL, FAM, FCCO, FCT, FDEU, FEI, FIF, FIV, FMY, FPF, FPL, FSD, FTHY, HAS, HEP, IGD, IID, ITUB, LMRK, SAFM, SHLX, SPH, SRCE, SRLP, SXT, TACO, TGP, WSR\n\n - Economic events and announcements:\n\n    - 3-Month Bill Auction (previous: 0.080%)\n    - 6-Month Bill Auction (previous: 0.085%)\n    - Construction Spending (consensus: 0.9%, previous: 0.9%)\n    - FOMC Member Bostic Speaks\n    - FOMC Member Rosengren Speaks\n    - ISM Manufacturing Employment (previous: 51.7)\n    - ISM Manufacturing New Orders Index (previous: 67.5)\n    - ISM Manufacturing PMI (consensus: 60.0, previous: 60.5)\n    - ISM Manufacturing Prices (consensus: 77.7, previous: 77.6)\n    - Investing.com Gold Index (actual: 56.4%, previous: 54.4%)\n    - Investing.com S&amp;P 500 Index (actual: 42.6%, previous: 47.5%)\n    - Loan Officer Survey\n    - Manufacturing PMI (previous: 59.1)\n    - Total Vehicle Sales (previous: 16.30M)\n\n## Upcoming events for Tuesday, February  2nd\n\n - Expected earnings:\n\n  ABG, ACNB, ALGM, AMCR, AMGN, AMZN, APAM, AQUA, ARCB, ARTW, ATGE, ATHM, ATKR, ATO, BABA, BDN, BEN, BHB, BP, BPY, BR, BRKS, CB, CFBK, CLCT, CMG, CNXN, CODA, COP, CRVL, CTLT, DLHC, DOX, EA, EBAY, EMR, ENTG, EPAY, ETN, FBHS, FEYE, FXNC, GAIN, GBL, GL, GLDG, GNW, GOOG, GOOGL, GPK, HAE, HCA, HLNE, HOG, HUBB, IBA, ICHR, IDXX, IESC, IMO, IPHI, ITI, LARK, LFVN, LII, LITE, LPG, MAN, MANH, MCHP, MCK, MDC, MFGP, MHO, MKL, MLI, MMP, MPC, MPLX, MRCY, MTCH, MUFG, OCFT, PBI, PFE, PINC, PJT, PKI, POWI, POWL, PTRS, PWOD, RACE, RCL, SALT, SANM, SCSC, SIRI, SMCI, SNE, ST, STE, SWI, SYY, TAK, TCS, TDG, TECH, TENB, TRNS, UPS, UTL, VBFC, VEDL, VIAV, VRTS, VTOL, WAT, WDR, WVFC, XOM\n\n - Ex-div:\n\n  AM, AMRB, BBD, BBDO, BCBP, CFG, ETRN, FAST, MCBS, NTIC, PNM\n\n - Economic events and announcements:\n\n    - API Weekly Crude Oil Stock (previous: -5.272M)\n    - IBD/TIPP Economic Optimism (previous: 50.1)\n    - ISM NY Business Conditions (previous: 61.3%)\n    - ISM-New York Index (previous: 817.6)\n    - Redbook (previous: -2.0%)\n    - Redbook (previous: 3.9%)\n\n## Upcoming events for Wednesday, February  3rd\n\n - Expected earnings:\n\n  ABBV, ADTN, AFG, AFL, AGTC, ALGN, ALGT, ALL, AMSC, ANGI, APO, APPS, APTV, ASH, AUBN, AVB, AVNW, AVTR, AVY, AXTA, BBD, BBDO, BCLI, BIIB, BIP, BSMX, BSX, CALB, CCMP, CENT, CENTA, CHKP, CHNG, CNHI, COHR, COTY, CPRI, CSGS, CSII, CTSH, CTVA, CUB, DGII, DHT, DT, DTE, ECHO, ELF, EMKR, ENSG, EPD, EPM, EVR, FMAO, FORM, FSFG, FUNC, GEOS, GLAD, GLUU, GRUB, GSK, GWW, HI, HMN, HOFV, HUM, HWM, IAC, IEC, IEX, INGR, INOV, INVA, IO, ISSC, IVAC, JVA, KE, KLAC, KLIC, LAD, LCI, LCNB, LFUS, LNC, MAA, MDU, MET, MHH, MIME, MSGS, MTOR, MUSA, MWA, MXL, NEU, NMCI, NTGR, NVO, OHI, PAHC, PATI, PFGC, PGC, PLUS, PYPL, PZN, QCOM, QNST, QRVO, RGLD, RRBI, RYN, SAN, SAVE, SC, SENEA, SENEB, SGU, SIMO, SITM, SLAB, SMG, SNDR, SNEX, SPOT, SRDX, STC, SU, SUM, TBI, TGI, THG, TSE, TTMI, TYME, UGI, UHAL, UWMC, VNE, VVV, WNC, WTM, YUMC\n\n - Ex-div:\n\n  BANR, FELE, FUL, GHC, HESM, KBH, NWBI, VBTX, WLKP\n\n - Economic events and announcements:\n\n    - ADP Nonfarm Employment Change (consensus: 45K, previous: -123K)\n    - Chicago Fed President Evans Speaks\n    - Crude Oil Imports (previous: -2.085M)\n    - Crude Oil Inventories (consensus: 0.430M, previous: -9.910M)\n    - Cushing Crude Oil Inventories (previous: -2.281M)\n    - Distillate Fuel Production (previous: -0.011M)\n    - EIA Refinery Crude Runs  (previous: -0.039M)\n    - EIA Weekly Distillates Stocks (previous: -0.815M)\n    - EIA Weekly Refinery Utilization Rates (consensus: -0.5%, previous: -0.8%)\n    - Gasoline Inventories (consensus: 1.764M, previous: 2.470M)\n    - Gasoline Production (previous: -0.212M)\n    - Heating Oil Stockpiles (previous: 0.055M)\n    - ISM Non-Manufacturing Business Activity (consensus: 57.3, previous: 60.5)\n    - ISM Non-Manufacturing Employment (previous: 48.7)\n    - ISM Non-Manufacturing New Orders (previous: 58.6)\n    - ISM Non-Manufacturing PMI (consensus: 56.8, previous: 57.7)\n    - ISM Non-Manufacturing Prices (previous: 64.4)\n    - MBA 30-Year Mortgage Rate (previous: 2.95%)\n    - MBA Mortgage Applications (previous: -4.1%)\n    - MBA Purchase Index (previous: 334.2)\n    - Markit Composite PMI (previous: 58.0)\n    - Mortgage Market Index (previous: 907.6)\n    - Mortgage Refinance Index (previous: 4,261.5)\n    - Services PMI (previous: 57.5)\n\n## Upcoming events for Thursday, February  4th\n\n - Stock splits:\n\n    - GNTY @ **110:100** (Payable date: 02/12/2021)\n\n - Expected earnings:\n\n  ABB, ABC, AGCO, AINV, AIV, ALCO, ALXN, AME, AMRK, ANIX, AOSL, APD, APDN, ARNC, ARRY, ARW, ARWR, ATVI, AVXL, BAX, BCE, BCO, BDX, BEP, BHE, BILL, BLL, BMY, BNL, BRBR, BRT, BSAC, BSBK, BSGM, BSIG, BTU, BV, CARR, CCS, CDR, CG, CI, CLX, CMI, CMS, COLM, COR, CPT, CRC, CSL, CTHR, CURO, CZNC, DB, DD, DECK, DGX, DHX, DLX, DSPG, DX, DXC, DYN, EIGI, ENTA, ENVA, EQNR, ESS, EURN, EVBN, EXPO, F, FARM, FFG, FLIC, FLT, FOUR, FTNT, FTV, GDYN, GHL, GILD, GLOG, GLOP, GLT, GOOS, GPI, GPRO, GTIM, HIG, HIMX, HL, HSY, HUBG, ICE, IMKTA, IMRA, ING, IP, IRMD, IROQ, JHG, KBAL, KN, KYMR, LANC, LBRT, LEA, LEE, LEVL, LGF.A, LGF.B, LGND, LPLA, LPTH, LQDT, LSBK, LSPD, LTRN, MDP, MEIP, MLVF, MMS, MNR, MOD, MPW, MPWR, MRK, MSGN, MSI, MSON, MTD, MTX, MYGN, NBIX, NEWR, NFG, NGL, NGVC, NICK, NJR, NKSH, NLOK, NMR, NNA, NOK, NOV, NRZ, NS, NWS, NWSA, NYT, OCSI, OCSL, ODFL, OESX, OFC, ONEW, ONTO, ORIC, OTEX, PBH, PCTY, PDEX, PENN, PFPT, PFSI, PH, PINS, PIPR, PLT, PM, PMT, POST, PRO, PRU, PTEN, PTON, PXLW, PZG, RDS.A, RDS.B, RFP, RGS, RL, SBH, SKX, SKYW, SNA, SNAP, SOGO, SOHU, SPH, SQFT, SR, STLA, SVM, SXC, SYNA, TDC, THFF, THR, TKR, TM, TMUS, TNAV, TOT, TPL, TPR, TRNO, TTM, TW, TWOU, TWST, U, UEPS, UL, ULBI, ULH, UNM, USAK, USAT, USLM, UTI, VREX, VRTU, VSAT, VSTO, WD, WEC, WERN, WLL, WMS, WWE, WYNN, XYL, YRCW, YTRA, YUM, ZEN\n\n - Ex-div:\n\n  AFB, AMSWA, BDGE, BKEP, BMRC, BPFH, BRO, CADE, CEQP, CFFN, CIT, CMCO, CMS, COST, DCOM, DCP, DHF, FCBC, FCF, FE, FFWM, FRAF, GMLP, GPP, HOPE, IBCP, IBOC, IDA, JBHT, LBC, LW, MET, MMLP, MMP, NBLX, NEA, NEP, NSC, NYCB, PNFP, PPBI, RELL, SSSS, SYF, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.065%)\n    - Challenger Job Cuts (previous: 77.030K)\n    - Continuing Jobless Claims (consensus: 4,750K, previous: 4,771K)\n    - Durables Excluding Defense (previous: 0.5%)\n    - FOMC Member Daly Speaks\n    - Factory Orders (consensus: 0.7%, previous: 1.0%)\n    - Factory orders ex transportation (previous: 0.8%)\n    - Initial Jobless Claims (consensus: 830K, previous: 847K)\n    - Jobless Claims 4-Week Avg. (previous: 868.00K)\n    - Natural Gas Storage (consensus: -136B, previous: -128B)\n    - Nonfarm Productivity (consensus: -2.9%, previous: 4.6%)\n    - Unit Labor Costs (consensus: 3.6%, previous: -6.6%)\n\n^^^^2021-02-01",
        "created_utc": 1612177215,
        "id": "gll419k",
        "score": -2,
        "subreddit": "RobinHood",
        "created": 1612206015.0
    }
]