[
    {
        "author": "EerdayLit",
        "body": "Yeah, maybe Elon never said it publicly; but Peter Thiel has said a couple times that literally everyone at Paypal was on the spectrum.",
        "created_utc": 1620572573,
        "id": "gxi4njs",
        "permalink": "/r/wallstreetbets/comments/n886vf/elon_musk_reveals_he_has_aspergers_syndrome_in/gxi4njs/",
        "score": 189,
        "subreddit": "wallstreetbets",
        "created": 1620601373.0
    },
    {
        "author": "HeckleHelix",
        "body": "I had to deposit more funds so I dont get flagged or called.  Guess I could just turn my phone off 😬.  Sounds like no big deal, except I already deposited all the funds to pay household bills this month.  C'mon PayPal, need you to rocket on Thursday!",
        "created_utc": 1620092631,
        "id": "gwuuz3m",
        "permalink": "/r/wallstreetbets/comments/n4d0oz/anyone_else_enjoy_their_monday_as_much_as_i_did/gwuuz3m/",
        "score": 90,
        "subreddit": "wallstreetbets",
        "created": 1620121431.0
    },
    {
        "author": "swistak84",
        "body": "&gt; “To  anyone I’ve offended, I just want to say, I reinvented electric cars  and I’m sending people to Mars in a rocket ship. Did you think I was  also going to be a chill, normal dude?”\n\nI also invented alternative reality where I didn't do a hostile takeover on Tesla - company started by two other guys I forced out of the company, after investing money I made off PayPal, that I could invest in because of blood emerald from the mine my family owned in Aperthaid South Africa.\n\nHe might have Aspbergers, but he's 100% asshole",
        "created_utc": 1620548778,
        "id": "gxh8r6v",
        "permalink": "/r/wallstreetbets/comments/n886vf/elon_musk_reveals_he_has_aspergers_syndrome_in/gxh8r6v/",
        "score": 81,
        "subreddit": "wallstreetbets",
        "created": 1620577578.0
    },
    {
        "author": "f1_manu",
        "body": "&gt;and even though it's a gigantic thing, it's only at around 54 dollars per share\n\nShare price has little do with how big a company is. DIS is trading at 170$ per share (x3 KO) and yet their market cap is very similar. How big companies are is valued in market cap, revenue, etc not share price. PYPL trades at 250$ per share and their market cap is similar to KO's. Goldman Sachs trades at 360$ and is half of KO's market cap.",
        "created_utc": 1621596159,
        "id": "gyxjj0g",
        "permalink": "/r/stocks/comments/nhpkn0/is_it_worth_it_to_invest_in_multiple_shares_of/gyxjj0g/",
        "score": 79,
        "subreddit": "stocks",
        "created": 1621624959.0
    },
    {
        "author": "hom6872",
        "body": "Square also has a PE of 277 and PayPal 55.  55 is high, but 277 is ridiculously high.  With that said, I like Square, but I love PayPal.",
        "created_utc": 1620932650,
        "id": "gy0fof8",
        "permalink": "/r/stocks/comments/nbo9z0/sq_is_trading_at_an_absolute_bargain_right_now/gy0fof8/",
        "score": 58,
        "subreddit": "stocks",
        "created": 1620961450.0
    },
    {
        "author": "SrAccident",
        "body": "Venmo gave me $5 just for logging in. Puts on PYPL",
        "created_utc": 1621974130,
        "id": "gzflykz",
        "permalink": "/r/wallstreetbets/comments/nkyn0w/what_are_your_moves_tomorrow_may_26_2021/gzflykz/",
        "score": 51,
        "subreddit": "wallstreetbets",
        "created": 1622002930.0
    },
    {
        "author": "solidmussel",
        "body": "ARKK has been doing some weird stuff lately if you watch their trades. \n\nLike wkhs when it dropped 50% when losing the ups contract.  Arkk buys at $13 then shortly after sells at $8.\n\nArkk buys pypl after great earnings from $260-290 per share then sells the whole way down.\n\nArkk loads up on SPCE in the high twenties and starts selling it in the teens. \n\nWhere's the longterm mindset?",
        "created_utc": 1621769623,
        "id": "gz5ghy9",
        "permalink": "/r/StockMarket/comments/nj14zc/please_stop_telling_new_investors_to_invest_in/gz5ghy9/",
        "score": 47,
        "subreddit": "StockMarket",
        "created": 1621798423.0
    },
    {
        "author": "juaggo_",
        "body": "PayPal might hit it. They are very well diversified in a business that will be huge in the future as the world moves to a cashless world.",
        "created_utc": 1621421014,
        "id": "gyoihsk",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gyoihsk/",
        "score": 45,
        "subreddit": "stocks",
        "created": 1621449814.0
    },
    {
        "author": "MagicSkullBus",
        "body": "Steve Jobs main trait was an \"aggressive marketer\". Assholes or not, world class marketers are a huge ingredient in world class companies. I'm not even a musk nuthugger but he couldnt have even bought the company without being successful already with paypal, your comment is so shit.",
        "created_utc": 1620544977,
        "id": "gxh4p1u",
        "permalink": "/r/wallstreetbets/comments/n886vf/elon_musk_reveals_he_has_aspergers_syndrome_in/gxh4p1u/",
        "score": 39,
        "subreddit": "wallstreetbets",
        "created": 1620573777.0
    },
    {
        "author": "HugeBeaverGuy",
        "body": "Should I trust that guy that just sent me a PM telling me he doubles my money if I paypal him $10k ?",
        "created_utc": 1622501102,
        "id": "h04ptae",
        "permalink": "/r/wallstreetbets/comments/npbyt0/what_are_your_moves_tomorrow_june_01_2021/h04ptae/",
        "score": 35,
        "subreddit": "wallstreetbets",
        "created": 1622529902.0
    },
    {
        "author": "sublette313",
        "body": "Also you should think of palantir as basically three companies and they actually are very far from unprofitable. \n\nThey developed the really massive government software (gotham) specifically as a result of an interaction that happened to Peter Thiel while he was at paypal. They were losing millions to foreign scammers at paypal and the solution ended up being a high quality algorithm that flagged the most likely scam transactions and then allowed analysts to efficiently double check and verify the real scam transactions.\n\n It essentially was using what computers are efficient at (sorting through massive amounts of data) and then combining that with what humans are good at (looking at the more complex nuances that at least at that point computer algorithms were incapable of doing) and augmenting the humans ability to make complex decisions by rapidly sorting through the incoming data and bringing everything good to their attention.\n\nThey fixed paypals using this method and literally made the company profitable overnight because of fixing how much they were losing in the scam transactions. The FBI contacted PayPal and Thiel about using that initial software. That was literally his inspiration for what would become Palantir. He goes over it in huge detail in his book zero to one. If you make an audible account you can read it for free and find the chapter I'm talking about.\n\nThen for 15 years they perfected the government software into the absolute nearly monopoly it is now in government intelligence augmentation software. The whole time though they reinvested almost everything for the last 10 years into building the commercial software (Foundry). That side of the business has only been live for a VERY short time and initially they literally didn't spend a single dollar on marketing their first commercial clients sought THEM out because of their insane reputation with the government. Foundry helps with supply chains and all kinds of other important data  insights. But if you want a recent example the NIH and the NHS both used Foundry to figure out how to best distribute the vaccine and vaccine distribution in the US and Britain has far outpaced expectations. You think commercial companies aren't going to be interested in using the software that was literally proven on a level like that?\n\n They're only just now adding huge amounts of people to their sales teams literally in the last six months which if you read Peter thiels book is insane for the stock because they have this crazy long term plan and he literally talks about how when they get to a certain point and start adding sales as a full sector of the company it means that is the company the company plans to BEGIN scaling. Meaning they're this big and they literally only just started on the scaling part. Which they've also said in tons of interviews if you're a die hard Palantirian like me. \n\n\n\nThey actually also have the third side of the  business which is their actual like full AI for weaponization and war and defense for the government. Gotham is like helping analysts and commanders lead and even helping police or agents figure out what's going on. This other software is different. It's called Apollo and its only at the beginning too. It's like pure AI machine learning AI handles everything stuff. Go find a video called pentagon head of NSC briefs public on AI I think it's on the PBS channel on YouTube or some shit. Or you can listen to Joe Biden talk about how we're going to double our percentage of gdp spending on AI. The amount of government money that's going to go into AI as a weapon to compete with China DWARFS peoples expectations of how much large the market for the kind of software palantir makes is. \n\nhttps://www.businesswire.com/news/home/20201001005334/en/U.S.-Army-Research-Lab-Selects-Palantir-Technologies-Inc.-for-91M-Artificial-Intelligence-and-Machine-Learning-Development\n\nThis is literally the backbone of everything AI that the government is about to invest in. Sure they're going to experiment with other research but if you do research you'll also find Palantir is the ONLY company that does anything remotely like this software that has anywhere near the kind of clearances like what is required for these contracts. They are currently a clearance level 5 and about to be the highest 6. The closest competitors are almost all a 3 or lower I'm not even sure if there's more than a single 4 and that stuff is crazy hard to get. \n\nBut like again I'm an obsessive. I realize why people get so excited about the commercial side scaling and how it's very possible and can make them huge and it will. But I'm actually pretty sure the reason people like Cathy Wood has such a huge boner for them is that she realizes how MASSIVELY. And I mean MASSIVELY underestimated the amount of government revenue they will get from all this AI investing the United States and NATO are about to do. It's literally the next Manhattan project and they're absolutely going to be one of the biggest players developing it if not the biggest. I think it's funny because most people are pretty disinterested in the government stuff for Palantir but i really think the weaponized AI apollo stuff may be as big as anything could ever be. \n\n\n\n\nAlso people got the insider selling stuff very very wrong. Tom Nash (love him or hate him I don't care) has a few really good recent videos where he explains it in basically full detail what was happening. The selling panicked a lot of retail investors during a time when the buying for growth markets had really slowed because of rate hike due to inflation scares and a ton of retail holders got scared and caused more selling and more people got scared because of that and sold and it really just was mass psychology in effect and a LOT of FUD and confusion. \n\nBasically a few executives karp in particular got billions of dollars worth of options that vest but literally expire so you have to exercise them which means you buy shares of the company at a strike price. Well because it's the company granting shares the strike price is literally 10 cents or something and these automatically have to vest at quarterly increments. So everytime karp was exercising he's actually buying shares. Like over 150 million in total maybe a lot more million SHARES not dollars. shares. And even those when he exercising he's buying shares technically from the company it ALL counts as profit on taxes and ITS NOT LONG TERM CAP GAINS ELIGIBLE. So over the last year plus this year he's essentially getting shares but the literal dollar value of those shares to the government counts as pure profit. So his total income which he's getting taxed at 40% of is in the BILLIONS yes billions. Because that's a lot to handle people that work for them actually automatically schedule sells of shares to cover the taxes so that there's no issue it's not even like him saying sell today and they do this.... TO AVOID ANY POSSIBLE ACCUSATION OF INSIDER SELLING TO THE SEC. That's why it's automatically happening so no one can ever claim he's timing it. \n\nSo listen cause here's where it gets important. The exercising of the shares counts as almost pure profits but remember he's receiving SHARES not dollars he doesn't actually get billions of dollars. So has to then sell SOME of the shares so he can pays taxes on that. Then when he sells the shares to pay the taxes for exercising he actually owes even more money if they went up from when he exercised. So everytime he's selling low its actually good for him because it's less ADDITIONAL PROFIT that he would owe taxes on.\n\n If he wasn't selling its because he thought it would go down even further and then he would actually owe less taxes overall. So if he thought it was going to tank he'd wait and actually get a nice fat discount on his taxes. \n\nI know this seems really crazy but I promise that's how it works you can look it up in detail but yeah shocking that mainstream media and redditors/youtubers who barely do research and have no real understanding of how these billion dollar compensations work would get it wrong. Unbelievable I know. If he had actually sold the massive overall percentage of his shares that some people claim he did the company would be at like $3-6 dollars not low 20s. Retail got confused because of market pressured due to interest rate fears from inflation and sold low (like retail always does) to institutions.",
        "created_utc": 1622171269,
        "id": "gzpsmih",
        "permalink": "/r/wallstreetbets/comments/nmlb2d/palantir_options_dirt_cheap/gzpsmih/",
        "score": 32,
        "subreddit": "wallstreetbets",
        "created": 1622200069.0
    },
    {
        "author": "KrazieKanuck",
        "body": "You’re **fine** most of us are buying those stocks right now (I for one am bullish af on ARKK and NFLX) first and foremost, before you invest another dime you need to put in the time to learn about some companies you love and believe in and decide if you want to invest in their future. Given what you owned before try researching Square, Paypal, Coinbase, and Riot.\n\nNow on to your current positions, I will try and give you my DD on them short and long term.\n\n**Short term** *aka wth happened to them*\nIn Q1 of this year the market rotated from tech/growth (your stuff) to re-opening stocks. Don’t panic, you’re in good stuff, you just timed your entry badly. Patience will very likely solve this mistake on its own, if you believe in those holdings now could be a good opportunity to add to them. (But learn more first as I said above) do not panic and switch to re-opening stuff, “chasing the trade” rarely works.\n\n**Long term** *will this be forever?*\nI hold two of the five tickers you mentioned and I plan to have them for years. The market will rotate back into tech / growth it just needs to cool down a bit because it was overbought during the pandemic. How do I know investors will come back to the tech sector (and specifically the stuff ARKK holds?)\n\nWhat else are they gonna do? **not** invest in the future???\n\nI’m also a highly contrarian investor so Wallstreet’s jealousy of Cathy Wood’s gains and criticism of her methods makes me more interested in her fund not less. Try reading some of ARKK’s investor communications you can learn a lot from them.\n\n**final thought** if none of the tickers I suggested make your heart soar and your mind sing, then consider the three following options while you continue learning.\n\n1. Hold cash (yes I know inflation is scary but it doesn’t happen overnight)\n\n2. Dollar cost average into an index fund for the next year+ until you find something more appealing\n\n3. Continue doing what you were doing before",
        "created_utc": 1620314293,
        "id": "gx5qhtc",
        "permalink": "/r/stocks/comments/n65x7r/i_started_investing_in_february_2021_how_do_i/gx5qhtc/",
        "score": 31,
        "subreddit": "stocks",
        "created": 1620343093.0
    },
    {
        "author": "JimCramersCoke",
        "body": "I’m a crypto shill so take this with a grain of salt but I think there’s little long term(5+ years) potential with banks. I think fintech (sq, pypl, coin) make a lot more sense from a long term perspective",
        "created_utc": 1622501449,
        "id": "h04qfxx",
        "permalink": "/r/stocks/comments/npe3eo/jpm_or_sq_which_one_is_for_long_term/h04qfxx/",
        "score": 30,
        "subreddit": "stocks",
        "created": 1622530249.0
    },
    {
        "author": "raidmytombBB",
        "body": "PayPal.  They will let you pay using Bitcoin but the business owners would be paid in cash.",
        "created_utc": 1620871229,
        "id": "gxxinqk",
        "permalink": "/r/investing/comments/nb164d/elon_musk_tesla_will_no_longer_accept_bitcoin_as/gxxinqk/",
        "score": 29,
        "subreddit": "investing",
        "created": 1620900029.0
    },
    {
        "author": "shroomenheimer",
        "body": "That dude who YOLO'd RKT options then low-key edited his PayPal and cash app into the post once it hit front page 🤣",
        "created_utc": 1620316753,
        "id": "gx5wd81",
        "permalink": "/r/wallstreetbets/comments/n63s48/daily_discussion_thread_for_may_06_2021/gx5wd81/",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1620345553.0
    },
    {
        "author": "Motschekiebchen",
        "body": "I mean you could argue completely different.\nIt’s true that crypto went through cyclic movements in the past and that the market is currently pumping strongly.\nBut all those investment or adaptions from Tesla, Paypal or the listing of Coinbase could be seen as a sign of mass adoption. So maybe no cyclic bear market is coming for crypto and it remains relatively stable.\nIt’s all very speculative and you might as well ask your magic 8-Ball.\nIn my opinion this is a very interesting time to start to invest in crypto with good fundamentals. But I definitely would only start with a part of your money.",
        "created_utc": 1620214463,
        "id": "gx0jdmf",
        "permalink": "/r/investing/comments/n5a2ms/in_your_opinion_is_cryptocurrency_a_sound/gx0jdmf/",
        "score": 25,
        "subreddit": "investing",
        "created": 1620243263.0
    },
    {
        "author": "FishermanPrize",
        "body": "\\&gt;IQ 155+\n\nIQ is a really dumb metric of intelligence and is in absolutly no way a proper indicator as to how successful someone can be; Just that they can solve logic problems.\n\nYou can be really good at solving problems but still be dumb as fuck (socially) and fumble your way through life, much like it seems musk has been doing for the past year.\n\nPlus, he was only able to start up paypal with his families (blood) emerald mine... then he bought the \"founders\" right from tesla's og founders and made them sign an NDA.Every single thing this dude has done has been built up on the backs of others; he's not that special.",
        "created_utc": 1621002869,
        "id": "gy3r7ak",
        "permalink": "/r/stocks/comments/nc78i5/interesting_take_on_teslas_recent_btc_move_by/gy3r7ak/",
        "score": 25,
        "subreddit": "stocks",
        "created": 1621031669.0
    },
    {
        "author": "antichain",
        "body": "Musk has never been the genius popular culture believes him to be. He was born rich (to a family that owned mines in apartheid S. Africa - yikes), made a ton of money selling a failing business to PayPal, and now he pays really smart people to build rockets and cars for him, while stealing credit for their labor and stopping them from unionizing.\n\nThe guy is just a dick.",
        "created_utc": 1621203620,
        "id": "gydighw",
        "permalink": "/r/investing/comments/ndvuxs/elon_musk_implies_tesla_has_sold_all_of_their/gydighw/",
        "score": 24,
        "subreddit": "investing",
        "created": 1621232420.0
    },
    {
        "author": "shepherd00000",
        "body": "PayPal would have been the most valuable company in the world right now if they had run the business right a decade ago.  They would have already replaced all the banks and would be doing everything Tencent is doing now in China, but everywhere else in the world.  There is a lot of potential but it is hard for me believe in them after they wasted years not innovating.  Now there is competition with Square and others, as well as the crypto market.",
        "created_utc": 1621433054,
        "id": "gyp4x33",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gyp4x33/",
        "score": 23,
        "subreddit": "stocks",
        "created": 1621461854.0
    },
    {
        "author": "LeoLabine",
        "body": "&gt;most secure monetary layer with the highest assurances\n\nMan you're drinking the Kool-Aid hard. To call a bitcoin's transaction secure with the highest assurances is really pushing it to nonsense levels. \n\nYou can contest a credit card charge, a paypal transaction, an Escrow, etc. You can't do shit to contest a bitcoin transaction. What assurances are you seeing?Why do you think most scams ask to be paid in bitcoins?",
        "created_utc": 1621481423,
        "id": "gys4roe",
        "permalink": "/r/investing/comments/ngamt2/can_we_please_throw_out_the_idea_that_bitcoin_is/gys4roe/",
        "score": 22,
        "subreddit": "investing",
        "created": 1621510223.0
    },
    {
        "author": "Goodboi209",
        "body": "Some completely true facts about Elon;\n\nHe got kicked out of a small website called x.com for being a dumbass. Peter Thiel then proceeded to turn it into the behemoth that is Paypal. He just happened to still hold stock as its value explodes. He did not found or build Paypal.\n\nTESLA WAS NOT FOUNDED BY ELON MUSK, it was founded by Martin Eberhard and Marc Tarpenning. Elon bought a majority stake in tesla and then proceeded to kick them out of their own vision and masquerade as a savior to humanity. \n\n\nIn depth debunking of the Elon and his assumed history\n\nPart 1\n\nhttps://m.youtube.com/watch?v=c-FGwDDc-s8 \n\nPart 2\n\nhttps://m.youtube.com/watch?v=DopFo1rjAr4\n\n\nHe has been lying about “self driving” coming out “this year” for 5 years despite the fact in recent emails they fucking told the DMV ITS NOT COMING.\n\nhttps://sys.4channel.org/derefer?url=https%3A%2F%2Fwww.forbes.com%2Fsites%2Fdavidsilver%2F2021%2F03%2F09%2Ftesla-emails-to-the-california-dmv-emphasize-continued-reliance-on-maps%2F%3Fsh%3D5d6468d057e6\n\n\nDid you know the only reason Tesla has a solar division is because musk used shareholder money to bailout his failing solar company?\n\nIs Elon musk a psychopath?\n\nDid you know he said he would “fire” his ex wife if she didnt dye her hair blonde?\n\nHe then proceeded to abandon her after having her bear 5 of his children.\n\nhttps://m.youtube.com/watch?v=01LK1hxpwcY\n\n\nVideo exposing Elon lying about FSD as well as video showing how useless and horrifyingly dangerous it truly is\n\nhttps://m.youtube.com/watch?v=PRKAH4d48Ic [Open]\n\nMeecedes Benz has been developing self driving since 1989, they have no technological lead.\n\nhttps://m.youtube.com/watch?v=I39sxwYKlEE",
        "created_utc": 1621199726,
        "id": "gyda3ds",
        "permalink": "/r/wallstreetbets/comments/ndwk25/what_are_your_moves_tomorrow_may_17_2021/gyda3ds/",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1621228526.0
    },
    {
        "author": "everybodysaysso",
        "body": "BABA seem to be gaining some attention on this sub and rightly so IMO. While talking about its valuation and growth are good. I think that the discussion on its venture arm is severely overlooked. I have looked into their investments in India and they will come out as bandits when these startups IPO. For example, BABA has invested in some of the biggest startups in India in their respective fields: Fintech (Paytm), e-com (Snapdeal), daily fruits/veggies/groceries (BigBasket), online delivery (Zomato). All these companies are highly successful and will be north of $50B in 5 years as more and more Indians get online. \n\nLast year because of escalation at government level between India and China, Alibaba halted their Indian investments. But I think they have already invested in Paypal, Doordash and Amazon of India and have even used the same playbook in other countries. \n\nIf China FUD was not a thing, Alibaba would make FANG look like boomers when their startup investments come to IPO. But again may be I am missing a piece of the puzzle somewhere. But for me, Alibaba itself is doing great, but I will continue buying since its my best way to gain exposure in upcoming behemoths in developing World.",
        "created_utc": 1621179834,
        "id": "gyc1z82",
        "permalink": "/r/investing/comments/ndow0k/simple_alibaba_intrinsic_value_caluclation/gyc1z82/",
        "score": 19,
        "subreddit": "investing",
        "created": 1621208634.0
    },
    {
        "author": "spirgnob",
        "body": "Yep [https://www.paypal.com/us/webapps/mpp/ua/cryptocurrencies-tnc?locale.x=en_US#fees-pricing](and according to them) there's a 2.8%-1.5% fee on top of their undisclosed 'spread'\n\n&gt;PayPal makes money when you buy and sell Crypto Assets. PayPal will charge a spread (or margin) between the market price we receive from our trading Service Provider",
        "created_utc": 1620872378,
        "id": "gxxkxlf",
        "permalink": "/r/investing/comments/nb164d/elon_musk_tesla_will_no_longer_accept_bitcoin_as/gxxkxlf/",
        "score": 19,
        "subreddit": "investing",
        "created": 1620901178.0
    },
    {
        "author": "Astronaut100",
        "body": "Agreed. Completely slipped my mind. PayPal is a juggernaut of a business. They will probably get there in the next few years with V and MA.",
        "created_utc": 1621421214,
        "id": "gyoiqqf",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gyoiqqf/",
        "score": 19,
        "subreddit": "stocks",
        "created": 1621450014.0
    },
    {
        "author": "JBeibs2012",
        "body": "Elon didn't buy PayPal. He was a cofounder for a company called x.com that was doing something very similar. They merged and then they all made their millions.\n\nSorry about your Bitcoin losses...",
        "created_utc": 1621199214,
        "id": "gyd8ynr",
        "permalink": "/r/investing/comments/ndvuxs/elon_musk_implies_tesla_has_sold_all_of_their/gyd8ynr/",
        "score": 18,
        "subreddit": "investing",
        "created": 1621228014.0
    },
    {
        "author": "Complex-Intention-43",
        "body": "But his family didnt own tesla or paypal.\nHe couldnt get the ceo title just to be born in a wealthy family\n\nAnd tesla was a big risk from the start for him",
        "created_utc": 1620553143,
        "id": "gxhd8w1",
        "permalink": "/r/wallstreetbets/comments/n886vf/elon_musk_reveals_he_has_aspergers_syndrome_in/gxhd8w1/",
        "score": 18,
        "subreddit": "wallstreetbets",
        "created": 1620581943.0
    },
    {
        "author": "EvaUnit343",
        "body": "I truly, truly do not understand the long term bull thesis for COIN. \n\nIf corn is adopted, other competitors (like PayPal) step in and drive down COIN’s absurd premiums, losing market share. \n\nIf corn is not adopted, COIN goes to zero. \n\nAs much as I want Cathie to sit on my face, she’s wrong on this one...",
        "created_utc": 1621255831,
        "id": "gyftofm",
        "permalink": "/r/wallstreetbets/comments/nec4of/daily_discussion_thread_for_may_17_2021/gyftofm/",
        "score": 17,
        "subreddit": "wallstreetbets",
        "created": 1621284631.0
    },
    {
        "author": "financialsfyi",
        "body": "Top stock mentions on r/wallstreetbets today (Not investment advice)\n\n|Symbol|Total Mentions|Price &amp; Change|Trading Volume|Market Cap|\n|:-|:-|:-|:-|:-|\n|GME|178|173.59 -1.48%|4.43M|12.29B|\n|CLOV|108|9.85 -3.15%|17.44M|4.34B|\n|MVIS|69|15.25 -15.28%|74.01M|2.41B|\n|SPY|58|417.30 -0.66%|85.53M|361.16B|\n|AMC|43|10.03 -1.67%|27.74M|4.52B|\n|PLTR|38|23.04 -1.41%|24.72M|40.37B|\n|RKT|27|22.45 -1.97%|3.73M|2.59B|\n|NOK|24|4.68 +0.21%|67.01M|26.56B|\n|TSLA|22|709.44 +4.79%|40.76M|683.43B|\n|BTX|20|49.80 +45.53%|54.57M|148.24M|\n|AMD|17|81.62 -2.73%|46.6M|99.17B|\n|PSFE|17|13.80 -0.29%|4.01M|2.02B|\n|OCGN|16|12.67 +5.94%|164.4M|2.38B|\n|AAPL|15|131.46 -1.51%|109.84M|2.19T|\n|VXRT|11|10.78 +17.05%|112.22M|1.27B|\n|VIAC|11|41.02 -1.16%|20.59M|26.67B|\n|BB|9|8.83 -2.54%|6.14M|4.99B|\n|SQQQ|8|10.89 +1.97%|53.95M|1.51B|\n|UWMC|8|8.16 -1.69%|2.1M|841.33M|\n|NIO|7|39.84 +2.18%|116.73M|62.11B|\n|COIN|7|297.64 +0.97%|4M|77.77B|\n|ACB|7|8.94 -0.22%|3.42M|1.77B|\n|APHA|6|15.38 -0.45%|16.31M|4.87B|\n|FB|6|325.08 -1.34%|26.33M|927.78B|\n|AMZN|6|3,467.42 -0.11%|7.01M|1.75T|\n|SQ|6|244.82 -1.19%|6.19M|104.05B|\n|CRSR|5|33.18 -3.21%|941.25K|3.05B|\n|GLD|5|165.66 -0.34%|6.25M|58.08B|\n|PYPL|5|262.29 -2.08%|6.59M|308B|\n|QS|5|36.54 -0.95%|3.98M|8.85B|",
        "created_utc": 1619999343,
        "id": "gwq3h6w",
        "permalink": "/r/wallstreetbets/comments/n3ekxx/what_are_your_moves_tomorrow_may_03_2021/gwq3h6w/",
        "score": 16,
        "subreddit": "wallstreetbets",
        "created": 1620028143.0
    },
    {
        "author": "imlaggingsobad",
        "body": "Disney, Paypal, Nvidia, Tesla, Salesforce, Netflix",
        "created_utc": 1621428499,
        "id": "gyouydl",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gyouydl/",
        "score": 16,
        "subreddit": "stocks",
        "created": 1621457299.0
    },
    {
        "author": "iBifteki",
        "body": "This is what I keep seeing as well.\n\nMany genuienly big cap, good companies (strong guidance, free cashflow, profitability, debt ratio, etc) are already down 20-25% from ATH ($TSM, $PYPL, etc)\n\nOther growths like $TDOC and $BYND are down 50%+.\n\nI don't understand how much more punishment these need to receive for a reversal to start taking place.\n\nAnd what shall we do, buy bonds from a historially indebted US Treasury?\n\nI feel like these inflation news are priced in now, and actually promising that the US economy is not totally fucked. Imagine if we got disinflation. That would be a huge issue.\n\nIf we drop another 10% I am buying all the way down, in my humble opinion, I feel like companies like Apple will keep killing it.",
        "created_utc": 1620861637,
        "id": "gxwyqs5",
        "permalink": "/r/stocks/comments/nb0p47/how_worried_are_you_about_the_current_volatility/gxwyqs5/",
        "score": 15,
        "subreddit": "stocks",
        "created": 1620890437.0
    },
    {
        "author": "HeckleHelix",
        "body": "Youre screwed.  So am I, Im sitting on a few thousand dollars in $270 calls on Paypal that expire tomorrow.  However. all is not lost!  For we have learned valuable (expensive) lessons",
        "created_utc": 1621557875,
        "id": "gyw2a7y",
        "permalink": "/r/wallstreetbets/comments/nhfc4q/be_honest_do_i_have_a_chance_here_fml/gyw2a7y/",
        "score": 15,
        "subreddit": "wallstreetbets",
        "created": 1621586675.0
    },
    {
        "author": "slammerbar",
        "body": "Think of it as a smaller scale PayPal. They are also a big worldwide payments processor, the specialize in online and E-cash payments. They process payments for Fortnite, Xbox, Spotify, Twitch and many others. \n\nPaysafe delivers payment solutions to merchants in over 40 different countries. In the United States alone, Paysafe processed $80 billion worth of transactions in 2017.",
        "created_utc": 1621566110,
        "id": "gywhnfm",
        "permalink": "/r/stocks/comments/nhhkh7/paysafe_stock/gywhnfm/",
        "score": 15,
        "subreddit": "stocks",
        "created": 1621594910.0
    },
    {
        "author": "HeckleHelix",
        "body": "Thats about what my Paypal calls looks like.  Might as well hold till the bitter end.  💎🙌  And yes I also took a small position in CLOV 🐵👍",
        "created_utc": 1620331944,
        "id": "gx6x1ma",
        "permalink": "/r/wallstreetbets/comments/n6gcdo/clovaint_over_until_may_21/gx6x1ma/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1620360744.0
    },
    {
        "author": "Thump604",
        "body": "Paypal is a public company. You can buy the stock.",
        "created_utc": 1622132063,
        "id": "gzngumj",
        "permalink": "/r/StockMarket/comments/nm45aw/paypal_will_allow_users_to_withdraw/gzngumj/",
        "score": 14,
        "subreddit": "StockMarket",
        "created": 1622160863.0
    },
    {
        "author": "Skyfall-77",
        "body": "If they are processing payments via stripe why would they need same level as PayPal? Unless we can determine their partnership cut with stripe it’s irrelevant info?",
        "created_utc": 1622471835,
        "id": "h033nmj",
        "permalink": "/r/wallstreetbets/comments/np2smh/shop_the_biggest_canadian_market_cap_is_the/h033nmj/",
        "score": 14,
        "subreddit": "wallstreetbets",
        "created": 1622500635.0
    },
    {
        "author": "pdieff",
        "body": "TECH WHAT TO GO LONG OR SHORT &amp; WHY.  \n\nReal Rates are going up nothing we can do about it not even JPow. \n\nHigher Rates = poison for growth companies w a stupid valuation.  2020 was different the market didn’t care but now it grew a conscience and it does.  \n\nWhat to short;  like Simba would say “Everything the Market Touches with a Price to Sale Ratio of 20X or more.  Pick your victim plot it on ychart.com and see what the PS is.   \n\nPayPal: 15X a bit expensive but not horrible and they killed it. They go up. (SQ; is only 12X if they have good numbers they should pump). \n\nFASTLY; before today 24X expensive and missed their numbers you are fucked. \n\nNIKOLA: 9,400X (it’s not a typo over 9K) if they don’t cure cancer on Friday with their earnings report they are gonna crash.  \n\nOCGN: 70X. They is fucked as well. And not only for their high PS.  \n\nMVIS: 250X and that’s after they collapsed.  \n\nThis is good info use it.  Stop losing $$$",
        "created_utc": 1620261397,
        "id": "gx3fj2l",
        "permalink": "/r/wallstreetbets/comments/n5p1yh/what_are_your_moves_tomorrow_may_06_2021/gx3fj2l/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1620290197.0
    },
    {
        "author": "lattiboy",
        "body": "I think PayPal earnings are the most important of the whole season. They’re basically the 500lb gorilla of Fintech and they’ve been getting beaten down since February. If they print money like i think they will, it could send the whole sector (and tech more broadly) into a turn around. \n\nJust my two cents, and I’ve got a lot of ARKF options riding on this that I’m down a fair bit on….",
        "created_utc": 1620236125,
        "id": "gx1u5mi",
        "permalink": "/r/stocks/comments/n5bwii/rstocks_daily_discussion_wednesday_may_05_2021/gx1u5mi/",
        "score": 13,
        "subreddit": "stocks",
        "created": 1620264925.0
    },
    {
        "author": "WRL23",
        "body": "I'd agree for that with any Crypto not just doge\n\nIt's slowly becoming accepted, understood, trusted, etc.. like how paypal existed for years but (let's be honest here) not that many people used at least not often. Then came along venmo and other shit like that.. let's call those alt-pay apps. People slowly but surely were accepting it, using it etc.\n\nNo not the best 3 example but hopefully you see my point. That's why I  stand by any good Crypto news is good news for all Crypto.. alts or not. The more the good vibes go out to media etc the more people get used to hearing it and then accepting it and eventually using it.\n\nDoes grandma still write checks? Yep! But those situations are less and less and do not reflect the direction we're heading.",
        "created_utc": 1621182025,
        "id": "gyc6mkf",
        "permalink": "/r/StockMarket/comments/ndny0q/tether_says_its_reserves_are_backed_by_cash_to/gyc6mkf/",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1621210825.0
    },
    {
        "author": "Billionairess",
        "body": "Nah, elon's a revisionist. Just look at paypal and tesla.",
        "created_utc": 1620182067,
        "id": "gwzbyf9",
        "permalink": "/r/SPACs/comments/n4vwbp/discrediting_the_competition_elon_musk/gwzbyf9/",
        "score": 13,
        "subreddit": "SPACs",
        "created": 1620210867.0
    },
    {
        "author": "stevejam89",
        "body": "Essentially every boomer I know is talking about or investing heavily in crypto, without understanding it. “I missed out on Amazon, I won’t miss this” or “it’s like the next PayPal right?” It is worrisome, as it has the potential to cause a spill over crash for the broader markets if it goes sideways.",
        "created_utc": 1620953460,
        "id": "gy1o1vl",
        "permalink": "/r/CanadianInvestor/comments/nbv1sn/is_crypto_the_next_dot_com_bubble/gy1o1vl/",
        "score": 13,
        "subreddit": "CanadianInvestor",
        "created": 1620982260.0
    },
    {
        "author": "The_Contrarian01",
        "body": "Futures are higher this morning, rebounding from the ‘Yellen head-fake’ that caused a bunch of selling yesterday afternoon. Small caps are leading the move higher, with the Russell 2000 up 0.7%. Nasdaq is up 0.6%. S&amp;P and Dow up about 0.3%. Russell and Nasdaq also saw the brunt of the damage yesterday, giving up almost 2% each.\n\nWe do get to hear from a couple of FOMC members: Eric Rosengren, Loretta Mester, and Charles Evans. Not sure if they’re taking questions but if so you can bet they’ll be asked about Yellen’s comments. \n\nMy thoughts on Yellen and the Fed: Need to listen to the audio. Not gonna type it.\n\nADP payrolls are due out at 0815. Economists expecting 800k jobs added in April, quite a bit more than the 517k from March. We also get ISM services data at 10am. These are a couple of key reports where the health of the economy is concerned. As always, you need to watch for the Goldilocks scenario: too hot and it means inflation and Fed tightening. Too cold and the economy is not recovering quickly or strongly enough. Though nowadays, maybe the ‘too cold’ scenario is preferred.\n\nMore earnings today as well: Hilton Worldwide just came out with a miss. GM, Allstate, and Etsy report later. After the bell we get Uber, Booking Holdings, and PayPal.",
        "created_utc": 1620211987,
        "id": "gx0g2uv",
        "permalink": "/r/wallstreetbets/comments/n5cc1t/daily_discussion_thread_for_may_05_2021/gx0g2uv/",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1620240787.0
    },
    {
        "author": "The_Contrarian01",
        "body": "Good morning contrarians!\n\nFutures are higher this morning, rebounding from the ‘Yellen head-fake’ that caused a bunch of selling yesterday afternoon. Small caps are leading the move higher, with the Russell 2000 up 0.7%. Nasdaq is up 0.6%. S&amp;P and Dow up about 0.3%. Russell and Nasdaq also saw the brunt of the damage yesterday, giving up almost 2% each.\n\nWe do get to hear from a couple of FOMC members: Eric Rosengren, Loretta Mester, and Charles Evans. Not sure if they’re taking questions but if so you can bet they’ll be asked about Yellen’s comments. \n\nMy thoughts on Yellen and the Fed: Need to listen to the audio. Not gonna type it.\n\nADP payrolls are due out at 0815. Economists expecting 800k jobs added in April, quite a bit more than the 517k from March. We also get ISM services data at 10am. These are a couple of key reports where the health of the economy is concerned. As always, you need to watch for the Goldilocks scenario: too hot and it means inflation and Fed tightening. Too cold and the economy is not recovering quickly or strongly enough. Though nowadays, maybe the ‘too cold’ scenario is preferred.\n\nMore earnings today as well: Hilton Worldwide just came out with a miss. GM, Allstate, and Etsy report later. After the bell we get Uber, Booking Holdings, and PayPal.",
        "created_utc": 1620211957,
        "id": "gx0g1je",
        "permalink": "/r/investing/comments/n5bhps/daily_general_discussion_and_spitballin_thread/gx0g1je/",
        "score": 12,
        "subreddit": "investing",
        "created": 1620240757.0
    },
    {
        "author": "mcgravier",
        "body": "&gt; But all those investment or adaptions from Tesla, Paypal or the listing of Coinbase could be seen as a sign of mass adoption.\n\nBack in 2017 Bitcoin looked to be mass adopted as well. Microsoft, Dell, Steam, Tigerdirect, Wargaming and many other companies big and small started to accept Bitcoin payments for their products, but it went nowhere - mostly because technology was immature, and couldn't cope with the massive traffic. \n\nThis time might be different, but it may misfire again as well.",
        "created_utc": 1620216692,
        "id": "gx0ms86",
        "permalink": "/r/investing/comments/n5a2ms/in_your_opinion_is_cryptocurrency_a_sound/gx0ms86/",
        "score": 12,
        "subreddit": "investing",
        "created": 1620245492.0
    },
    {
        "author": "Boomtown626",
        "body": "SQ and PYPL earnings coming up. After sideways quarters for both, I could go for an earnings-fueled 3-month rally.",
        "created_utc": 1620210081,
        "id": "gx0dujf",
        "permalink": "/r/stocks/comments/n5bwii/rstocks_daily_discussion_wednesday_may_05_2021/gx0dujf/",
        "score": 12,
        "subreddit": "stocks",
        "created": 1620238881.0
    },
    {
        "author": "Tobytime34",
        "body": "At this point in the SPAC cycle it’s going to take PayPal buying it for $20 a share to move the price more than a nickel. 🤦",
        "created_utc": 1620147383,
        "id": "gwxe87f",
        "permalink": "/r/SPACs/comments/n4r7c7/ftoc_payoneer_announce_on_a_deal_with_ebay/gwxe87f/",
        "score": 12,
        "subreddit": "SPACs",
        "created": 1620176183.0
    },
    {
        "author": "Darklord12345678",
        "body": "Just check carefully your data. It seems that your announcements were captured incorrectly.\n\nFor example, there is no earning on Oct 28 for PYPL: [https://finance.yahoo.com/calendar/earnings/?symbol=pypl](https://finance.yahoo.com/calendar/earnings/?symbol=pypl) but you have in your data.\n\nThis is a great tool, and I think it has a lot of potentials. Thank you for supporting our community.",
        "created_utc": 1619994358,
        "id": "gwpu2zy",
        "permalink": "/r/options/comments/n3e3d9/expected_moves_this_week_roku_draftkings_uber/gwpu2zy/",
        "score": 11,
        "subreddit": "options",
        "created": 1620023158.0
    },
    {
        "author": "jemoederkanker",
        "body": "One of the reasons, why it became extremely popular is because it has founding members of PayPal, known as PayPal mafia which have gone to create multiple successful companies. Peter Thiel, co founder of PayPal is also a co-founder of palantir. It's also got a great fucking name 🙏",
        "created_utc": 1620743364,
        "id": "gxqe1qm",
        "permalink": "/r/wallstreetbets/comments/n9v0jy/postponing_my_marriage_and_house_purchase_thank/gxqe1qm/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1620772164.0
    },
    {
        "author": "QisDenseInR",
        "body": "Last week I went all in with margin. Bought $FB and $AMZN just before market close and sold those 5mins after close. I am thinking to do the same next week. Pfizer (6:40 AM) SKLZ, PYPL, SQ, BYND and DKNG. What do you guys suggest?",
        "created_utc": 1619877223,
        "id": "gwjgk9x",
        "permalink": "/r/options/comments/n2hk1s/most_anticipated_earnings_releases_for_the_week/gwjgk9x/",
        "score": 11,
        "subreddit": "options",
        "created": 1619906023.0
    },
    {
        "author": "dudetalking",
        "body": "I agree with Munger this current mania is not healthy for society, and will be very destructive.  When you see things like Weed Stocks, Gambling Stocks, Vaporware cyrptos, excess financial leverage.\n\nAlso systemic risk is brewing everywhere, especially in the Defi space. That is the new unregulated dark pools, except this time its going to destroy retail when it unravels.  Its amazing that there is zero concern for these giants like paypal, square, becoming quasi banks.\n\nDefinitely going to be a fun movie to watch.\n\nI think the boom/bust cycle could be faster than people anticipate. This morning on CNBC a advisor already had mapped the entire year, a 10% correction 2 months before the new tax plan, and until then the market can go sideways or up. Zero risk apparently.\n\nAs someone who was around and traded in the .com, this bubble is dwarfing .com mania.",
        "created_utc": 1620136392,
        "id": "gwwnf8e",
        "permalink": "/r/ValueInvesting/comments/n4n39e/warren_buffett_says_robinhood_is_catering_to_the/gwwnf8e/",
        "score": 11,
        "subreddit": "ValueInvesting",
        "created": 1620165192.0
    },
    {
        "author": "Roffler967",
        "body": "We need a bet bot. \n\nA bot that owns a PayPal account where the money goes in from both sides. After the bet ends the bot pays the winning account the money.",
        "created_utc": 1622076727,
        "id": "gzl0ty9",
        "permalink": "/r/wallstreetbets/comments/nlg7w1/a_bet_appears_in_the_daily_chat_wsb_really_is_a/gzl0ty9/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1622105527.0
    },
    {
        "author": "J_Artiz",
        "body": "Very similar to PayPal with the whole digital wallet. Think this is the area that Foley will be able to add the most value to with the connections to casinos. Even my broker accepts payments from Skrill so at least here in the UK it's everywhere and the more expansion to different countries the more value will be placed onto the brand",
        "created_utc": 1620640787,
        "id": "gxlau4m",
        "permalink": "/r/stocks/comments/n8zkio/psfe_paysafe_a_better_way_to_bet_on_multiple_high/gxlau4m/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1620669587.0
    },
    {
        "author": "Lost_Wealth_2111",
        "body": "Both SQ AND PAYPAL beat earnings PAYSAFE next",
        "created_utc": 1620337465,
        "id": "gx7a8zc",
        "permalink": "/r/wallstreetbets/comments/n6g549/what_are_your_moves_tomorrow_may_07_2021/gx7a8zc/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1620366265.0
    },
    {
        "author": "The_subtle_learner",
        "body": "No actually only somebody who had $350MM in the bank or so (or more) after having sold a company like PayPal or sold whatever else remarkable commercial achievement",
        "created_utc": 1620544869,
        "id": "gxh4kps",
        "permalink": "/r/wallstreetbets/comments/n886vf/elon_musk_reveals_he_has_aspergers_syndrome_in/gxh4kps/",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1620573669.0
    },
    {
        "author": "snake250",
        "body": "Couple of things...\n\n- Don't just look at PS, also look at EV / gross profits\n- PYPL gross margins are stable and higher than SQ\n\nNo horse in the race, just saying you need to look beyond just revenue growth % and PS.",
        "created_utc": 1620940740,
        "id": "gy0z18b",
        "permalink": "/r/stocks/comments/nbo9z0/sq_is_trading_at_an_absolute_bargain_right_now/gy0z18b/",
        "score": 11,
        "subreddit": "stocks",
        "created": 1620969540.0
    },
    {
        "author": "kharaloser",
        "body": "Beep beep I'm here from the future, they're bigger than PayPal now. $300+ billion market cap.",
        "created_utc": 1622236577,
        "id": "gzsze7d",
        "permalink": "/r/SPACs/comments/nmyw20/sofi_ipoe_merger_approved/gzsze7d/",
        "score": 10,
        "subreddit": "SPACs",
        "created": 1622265377.0
    },
    {
        "author": "Delicious_Can_7849",
        "body": "BABA calls looking juicy as eff. \n\nAAPL calls look tempting as great earnings are about to set in (Buffet sold some too so that’s a plus)\n\nAMD calls are making me engorged considering the merger with XLNX and XLNX’s good beat (and AMD is tech and tech=tendies).\n\nPYPL calls looking great bc well earnings are tomorrow and I’m a degenerate gambler that enjoys a tasty crayon from time to time. \n\nCRSR calls also in the mix bc my brain is super smooth and some retard made a post about it earlier. \n\nIn all seriousness, today seemed to be just a normal case of profit taking.\n\nTL;DR Buy the dip. I like the stock.",
        "created_utc": 1620166182,
        "id": "gwyem1k",
        "permalink": "/r/wallstreetbets/comments/n4wnlb/what_are_your_moves_tomorrow_may_05_2021/gwyem1k/",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1620194982.0
    },
    {
        "author": "urgirlsmomsdaddy",
        "body": "Made the executive decision - moving funds to VTI.\n\nDone playing with individual stocks.\n\nIll hold onto my long terms like the mega cap tech+ SQ, NVDA, PYPL, AMD, SHOP but thats it.",
        "created_utc": 1620928564,
        "id": "gy05q6f",
        "permalink": "/r/stocks/comments/nbcof0/rstocks_daily_discussion_options_trading_thursday/gy05q6f/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1620957364.0
    },
    {
        "author": "HeckleHelix",
        "body": "Im averaging down on Paypal.  Excellent company with nothing but a positive future.  Every $10 drop I buy 5 shares.",
        "created_utc": 1621214648,
        "id": "gye47sn",
        "permalink": "/r/stocks/comments/ndyzxa/is_now_the_time_to_buy_tech_stocks/gye47sn/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1621243448.0
    },
    {
        "author": "M-Catalyst",
        "body": "I would probably only go with PYPL and SQ. Market sentiment on more speculative companies  such as SKLZ I've been noticing many run up on good earnings to immediately get beaten down as profits are locked in. Wildcard is DKNG imo, and I have no idea how pfizer will play out whatsoever.",
        "created_utc": 1619879671,
        "id": "gwjlnqo",
        "permalink": "/r/options/comments/n2hk1s/most_anticipated_earnings_releases_for_the_week/gwjlnqo/",
        "score": 10,
        "subreddit": "options",
        "created": 1619908471.0
    },
    {
        "author": "oarabbus",
        "body": "What is so great about them? I'm not saying they are not an amazing business, just curious why. I don't know too many people who use paypal itself, and while I know a lot of people who use Venmo, just as many use Square, Cashapp, etc.",
        "created_utc": 1621447446,
        "id": "gyq3jwf",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gyq3jwf/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1621476246.0
    },
    {
        "author": "blingblingmofo",
        "body": "Well PYPL did a free fall prior to earnings so it may actually be okay - assuming there isn't a broader market sell-off, ofc.",
        "created_utc": 1620250188,
        "id": "gx2rkpg",
        "permalink": "/r/stocks/comments/n5qe9w/incredible_earnings_for_paypal_beat_q1_estimates/gx2rkpg/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1620278988.0
    },
    {
        "author": "TaxShield",
        "body": "I love how many useful replies you’ve already gotten lol.\n\nOf your list, i’d personally pick;\n\nAAPL\nAMZN\nBA\nDIS\nJNJ\nJPM\nMSFT\nPYPL",
        "created_utc": 1621535711,
        "id": "gyuqenl",
        "permalink": "/r/stocks/comments/nh7ld4/stock_holdings_for_retirement_ie_next_30_years/gyuqenl/",
        "score": 10,
        "subreddit": "stocks",
        "created": 1621564511.0
    },
    {
        "author": "Popular_Abrocoma558",
        "body": "PYPL announced great earnings yesterday. What happens today? PYPL receives a big red dildo in the ass by the market🤡",
        "created_utc": 1620310854,
        "id": "gx5ilfx",
        "permalink": "/r/stocks/comments/n63da7/rstocks_daily_discussion_options_trading_thursday/gx5ilfx/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1620339654.0
    },
    {
        "author": "Apart-Seesaw-6047",
        "body": "Don't sleep on PYPL &amp; WMT",
        "created_utc": 1621431439,
        "id": "gyp18ls",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gyp18ls/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1621460239.0
    },
    {
        "author": "I_love_avocados1",
        "body": "I agree with V and MA (can include PayPal too)\n\nAside from that, CRM.",
        "created_utc": 1621435291,
        "id": "gypa6sm",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gypa6sm/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1621464091.0
    },
    {
        "author": "WhoDoUThinkUAre-I-Am",
        "body": "Trying to actually buy a videogame from GameStop but they won't take my europe monopoly money nor my Brexit pounds. \n\nHow tf are you going to take over online sales if us europoors can't even buy presents for our American friends? \n\nSeriously... I'm trying to by some games for an 11 year old girl with a shitty family and GameStop won't take my PayPal or my credit card it's fucking ridiculous.",
        "created_utc": 1622114723,
        "id": "gzmheiu",
        "permalink": "/r/wallstreetbets/comments/nm414o/daily_discussion_thread_for_may_27_2021/gzmheiu/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1622143523.0
    },
    {
        "author": "criptocrazy",
        "body": "My bets:\nPYPL; BABA; PLTR; BYND; DIS",
        "created_utc": 1621306814,
        "id": "gyixrgw",
        "permalink": "/r/wallstreetbets/comments/neq7g4/what_are_your_moves_tomorrow_may_18_2021/gyixrgw/",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1621335614.0
    },
    {
        "author": "WickedSensitiveCrew",
        "body": "When Ebay spunoff  Paypal. Ebay shareholders got one share on Paypal for each ebay share they had prior to a certain date. Probably the same will happen with that company.",
        "created_utc": 1621129427,
        "id": "gya1pp7",
        "permalink": "/r/stocks/comments/nddie8/what_happens_to_a_companys_stock_when_they_sell/gya1pp7/",
        "score": 9,
        "subreddit": "stocks",
        "created": 1621158227.0
    },
    {
        "author": "CitiesFinest",
        "body": "Ipoe/Sofi is a solid play long term or short. This will be SPAC of all spacs in 5 years. Think Square. Think Paypal. Ride them and roll them.",
        "created_utc": 1621996673,
        "id": "gzgvd4i",
        "permalink": "/r/options/comments/nl4ppf/ipoesofi_as_you_know_ipoe_will_become_sofi_next/gzgvd4i/",
        "score": 9,
        "subreddit": "options",
        "created": 1622025473.0
    },
    {
        "author": "RGR111",
        "body": "PSFE is the stock to own. To the 🌚 and beyond. We got here another SQ &amp; PYPL in the making",
        "created_utc": 1619939956,
        "id": "gwmudgl",
        "permalink": "/r/wallstreetbets/comments/n222v3/weekend_discussion_thread_for_the_weekend_of/gwmudgl/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1619968756.0
    },
    {
        "author": "Milanoate",
        "body": "They do NOT hunt for the companies in their earliest life cycle. They focus on the next phase of growth, i.e. still fast growth, but with established business model, and almost no worry for bankruptcy. Using human as analogy, they are looking for mostly \"teenagers\", with some 8-10 year old, but very few \"toddlers\" and \"babies\".\n\nDon't confuse my phrases of \"well-established image and income and billions of worth\" with \"profitable\" and \"mature\". Amazon was not profitable until 2010, but they had been a well-established company for a long time.\n\nThe gene editing companies are the exceptions despite of the Nobel Prize-winning technology, along with a few others (like air taxi), are the examples of the 2% that could go bankrupt. However, look at the others - JD, SHOP, TSLA, DE, SQ, ZG, TDOC, DOCU, BIDU, PINS, MELI, Paypal... those are not small at all. These are \"strong teenagers\" instead of babies.",
        "created_utc": 1622332846,
        "id": "gzxafyk",
        "permalink": "/r/investing/comments/nnv7be/arkk_sells_leverage_not_alpha_and_they_overcharge/gzxafyk/",
        "score": 8,
        "subreddit": "investing",
        "created": 1622361646.0
    },
    {
        "author": "isweat_",
        "body": "SQ &amp; PYPL killed earnings\n\nIm praying for my fellow PSFE bag holders 🙏🏼",
        "created_utc": 1620347827,
        "id": "gx7vpy7",
        "permalink": "/r/wallstreetbets/comments/n6g549/what_are_your_moves_tomorrow_may_07_2021/gx7vpy7/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620376627.0
    },
    {
        "author": "oarabbus",
        "body": "What I'm hearing from this topic is buy all 4 of PYPL, SQ, V, MA",
        "created_utc": 1621447400,
        "id": "gyq3fw7",
        "permalink": "/r/stocks/comments/ng2d39/next_set_of_trillion_dollar_companies/gyq3fw7/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1621476200.0
    },
    {
        "author": "Ronnieisred",
        "body": "I look at it as WELL took over Canada and is now expanding rapidly into the US with the Circle Medical acquisition - the ceo also sold his last company to PayPal for $304M in 2017 and has had the 29th richest man in the world as a seed investor all the way through the most recent round priced above market so I don't think they are limited to Canada in anyway.  I think they are just smart businessmen that saw an opportunity in Canada which would set them up for success in all other markets. Just feels like a difference between hype (Clov) and solid business fundamentals with not much hype (Well). I also personally won't contribute any more money to the clintons lol",
        "created_utc": 1620595179,
        "id": "gxjey68",
        "permalink": "/r/wallstreetbets/comments/n8nalc/mega_move_incoming_for_well_health_well_wlyyf/gxjey68/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620623979.0
    },
    {
        "author": "wnsgus",
        "body": "This same exact price movement happened with PYPL last earnings. Shall we see it touch upwards of 280-300 again? 🤔",
        "created_utc": 1620247328,
        "id": "gx2kqd1",
        "permalink": "/r/wallstreetbets/comments/n5p1yh/what_are_your_moves_tomorrow_may_06_2021/gx2kqd1/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620276128.0
    },
    {
        "author": "RGR111",
        "body": "I was thinking about this and I believe SQ can outpace PYPL with its direct crypto investments and the potential of still expanding its business and reaching Europe (UK right now) and other countries. I’d rather have one than both and SQ seems to be the winner for me and I believe it can double its price in 2-3 years",
        "created_utc": 1620446109,
        "id": "gxcqdms",
        "permalink": "/r/stocks/comments/n7fwqd/worth_holding_both_sq_and_pypl/gxcqdms/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1620474909.0
    },
    {
        "author": "cold_tone",
        "body": "Oh is paypal an electric vehicle? Is pay pal the precursor to Nueralink? Ya he helped develop paypal and sold it to make big bank and fund his endeavors. But HardCock up there claims he’s big brains behind those ideas.  \n\nElon fanboys everywhere",
        "created_utc": 1621099240,
        "id": "gy8fw9f",
        "permalink": "/r/Wallstreetbetsnew/comments/nd1j35/elon_knows_about_us/gy8fw9f/",
        "score": 8,
        "subreddit": "Wallstreetbetsnew",
        "created": 1621128040.0
    },
    {
        "author": "Emprease",
        "body": "SQ TSLA PYPL MARA RIOT MSTR\n\npress f to pay respects",
        "created_utc": 1621223873,
        "id": "gyemyik",
        "permalink": "/r/wallstreetbets/comments/ndwk25/what_are_your_moves_tomorrow_may_17_2021/gyemyik/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1621252673.0
    },
    {
        "author": "IAmPandaRock",
        "body": "Nice to see PYPL and VIAC continue to drop after great earnings. Makes a ton of sense. I love it.",
        "created_utc": 1620313793,
        "id": "gx5pbyt",
        "permalink": "/r/stocks/comments/n63da7/rstocks_daily_discussion_options_trading_thursday/gx5pbyt/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1620342593.0
    },
    {
        "author": "TinfoilHat87",
        "body": "Sq moving up on PayPal earnings?",
        "created_utc": 1620247830,
        "id": "gx2lzh9",
        "permalink": "/r/wallstreetbets/comments/n5p1yh/what_are_your_moves_tomorrow_may_06_2021/gx2lzh9/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620276630.0
    },
    {
        "author": "Mryop42",
        "body": "Pypl",
        "created_utc": 1621073906,
        "id": "gy78eus",
        "permalink": "/r/stocks/comments/ncutxn/growth_stocks_for_the_next_10_years/gy78eus/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1621102706.0
    },
    {
        "author": "Inori92",
        "body": "I do not understand how you can just come out and determine that it was trolling when it's highly frowned upon from businesses to close doors publicly in any capacity, the Collisons were harassed by PSTH mega-bulls all of 2H last year to the point where they issued multiple tweet replies ending with this one.\n\nAlso, Stripe is not \"iconic\", I at least believe Bill selling that part. Paypal would be the icon of online fintech.\n\nAll signs are pointing towards Bloomberg and as a holder myself, that's great news for long. But y'all are just throwing darts when some of these just don't even fit half the criteria listed or have been all but outright denied.",
        "created_utc": 1622248885,
        "id": "gztm5rz",
        "permalink": "/r/SPACs/comments/nna01r/psth_the_endgame/gztm5rz/",
        "score": 8,
        "subreddit": "SPACs",
        "created": 1622277685.0
    },
    {
        "author": "Ok_Capital2097",
        "body": "Showtime for my portfolio. Holding CRSR, PYPL, RKT, VIAC, UBER... F",
        "created_utc": 1620096997,
        "id": "gwv3jv2",
        "permalink": "/r/wallstreetbets/comments/n45qyv/what_are_your_moves_tomorrow_may_04_2021/gwv3jv2/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620125797.0
    },
    {
        "author": "VisaDeKlein",
        "body": "paypal, if you could singlehandedly carry qqq up tomorrow, that'd be great thanks. she's heavy but you got this do it for mama",
        "created_utc": 1620246207,
        "id": "gx2i24o",
        "permalink": "/r/wallstreetbets/comments/n5p1yh/what_are_your_moves_tomorrow_may_06_2021/gx2i24o/",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1620275007.0
    },
    {
        "author": "suphater",
        "body": "Very nice PayPal pop so far from earnings.\n\nIf it crashes tomorrow I'm just going all in on Goodyear Tires since that's been my best stock of 2021, wtf",
        "created_utc": 1620247445,
        "id": "gx2l0je",
        "permalink": "/r/stocks/comments/n5bwii/rstocks_daily_discussion_wednesday_may_05_2021/gx2l0je/",
        "score": 8,
        "subreddit": "stocks",
        "created": 1620276245.0
    },
    {
        "author": "amg_class",
        "body": "PYPL and SQ will beat for sure. Calls on both",
        "created_utc": 1619879415,
        "id": "gwjl2x8",
        "permalink": "/r/options/comments/n2hk1s/most_anticipated_earnings_releases_for_the_week/gwjl2x8/",
        "score": 7,
        "subreddit": "options",
        "created": 1619908215.0
    },
    {
        "author": "schitaco",
        "body": "$SQ to the moon\n\nSomeone discovered a reference to \"Square Checking\" and \"Square Savings\" in their recent app update, meaning they're finally launching bank accounts for businesses. \n\nThis means there's basically no point in having a banking relationship for most small merchants, and Square is aggressively coming after midmarket merchants too (restaurants, larger retailers). They'll have access to cheap capital to lend, and have insight into customers' cash flow to make more accurate and timely credit offers than the bank, and get paid directly from receipts. Anyone not named Chase, BofA, Wells, Amex, PayPal, or Intuit is fuk.\n\nThanks for reading my journal.",
        "created_utc": 1621914388,
        "id": "gzcqcr6",
        "permalink": "/r/wallstreetbets/comments/nk6ucy/what_are_your_moves_tomorrow_may_25_2021/gzcqcr6/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1621943188.0
    },
    {
        "author": "Billionairess",
        "body": "Elon was never a founder of either paypal or tesla anyway. He basically strongarmed his way to power, booted the original founders one way or another, and forced the board to grant him co-founder status. He was a founder of spacex though, for whats its worth.",
        "created_utc": 1620181995,
        "id": "gwzbtcf",
        "permalink": "/r/SPACs/comments/n4vwbp/discrediting_the_competition_elon_musk/gwzbtcf/",
        "score": 7,
        "subreddit": "SPACs",
        "created": 1620210795.0
    },
    {
        "author": "Ok_Capital2097",
        "body": "I hope shit corn $ rotate into PLTR, DKNG, CRSR, PYPL, SPOT, TLT",
        "created_utc": 1621197298,
        "id": "gyd4odz",
        "permalink": "/r/wallstreetbets/comments/ndwk25/what_are_your_moves_tomorrow_may_17_2021/gyd4odz/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1621226098.0
    },
    {
        "author": "urgirlsmomsdaddy",
        "body": "I sold out of most of my more speculative plays.\n\nMy most spec plays left are TSLA, SQ, AMD, SHOP, DKNG, IPOE, ARKK.\n\nI will let those rock, while I continue to DCA into VTI, MSFT, AAPL, DIS, GOOG, AMZN, PYPL, NVDA.",
        "created_utc": 1620956385,
        "id": "gy1tl2j",
        "permalink": "/r/stocks/comments/nbcof0/rstocks_daily_discussion_options_trading_thursday/gy1tl2j/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1620985185.0
    },
    {
        "author": "Laxman259",
        "body": "Paypal and Shopify are completely different businesses. I dont think you understand how platforms operate.",
        "created_utc": 1622474035,
        "id": "h037zo6",
        "permalink": "/r/wallstreetbets/comments/np2smh/shop_the_biggest_canadian_market_cap_is_the/h037zo6/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1622502835.0
    },
    {
        "author": "Goodboi209",
        "body": "Some completely true facts about Elon;\n\nHe got kicked out of a small website called x.com for being a dumbass. Peter Thiel then proceeded to turn it into the behemoth that is Paypal. He just happened to still hold stock as its value explodes. He did not found or build Paypal.\n\nTESLA WAS NOT FOUNDED BY ELON MUSK, it was founded by Martin Eberhard and Marc Tarpenning. Elon bought a majority stake in tesla and then proceeded to kick them out of their own vision and masquerade as a savior to humanity. \n\n\nIn depth debunking of the Elon and his assumed history\n\nPart 1\n\nhttps://m.youtube.com/watch?v=c-FGwDDc-s8 \n\nPart 2\n\nhttps://m.youtube.com/watch?v=DopFo1rjAr4\n\n\nHe has been lying about “self driving” coming out “this year” for 5 years despite the fact in recent emails they fucking told the DMV ITS NOT COMING.\n\nhttps://sys.4channel.org/derefer?url=https%3A%2F%2Fwww.forbes.com%2Fsites%2Fdavidsilver%2F2021%2F03%2F09%2Ftesla-emails-to-the-california-dmv-emphasize-continued-reliance-on-maps%2F%3Fsh%3D5d6468d057e6\n\n\nDid you know the only reason Tesla has a solar division is because musk used shareholder money to bailout his failing solar company?\n\nIs Elon musk a psychopath?\n\nDid you know he said he would “fire” his ex wife if she didnt dye her hair blonde?\n\nHe then proceeded to abandon her after having her bear 5 of his children.\n\nhttps://m.youtube.com/watch?v=01LK1hxpwcY\n\n\nVideo exposing Elon lying about FSD as well as video showing how useless and horrifyingly dangerous it truly is\n\nhttps://m.youtube.com/watch?v=PRKAH4d48Ic [Open]\n\nMeecedes Benz has been developing self driving since 1989, they have no technological lead.\n\nhttps://m.youtube.com/watch?v=I39sxwYKlEE",
        "created_utc": 1621200937,
        "id": "gydcqge",
        "permalink": "/r/wallstreetbets/comments/ndwk25/what_are_your_moves_tomorrow_may_17_2021/gydcqge/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1621229737.0
    },
    {
        "author": "realister",
        "body": "**Lets check on our girl Nancy Pelosi and her option plays**\n\n\n&gt;purchased 10,000 shares of PYPL on June 12, 2020. \n\n&gt;purchased 50 PYPL calls on June 24 with a strike of $100 and expiration 01/21/2022. \n\nP/L so far for this play:\n\n**+$1,060,800 from stock**\n\n**+$436,625 from the option leaps**\n\nThinkorswim^^tm screenshot:\n\nhttps://i.imgur.com/1qNzSM0.png\n\n*source: https://disclosures-clerk.house.gov/PublicDisclosure/FinancialDisclosure*",
        "created_utc": 1622070545,
        "id": "gzko4lj",
        "permalink": "/r/wallstreetbets/comments/nlq1js/what_are_your_moves_tomorrow_may_27_2021/gzko4lj/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1622099345.0
    },
    {
        "author": "iamjpow69",
        "body": "The stocks I own (and hopefully will continue to grow) are the following \n\nApple, Microsoft, Google, Facebook, Tesla, Shopify, Square, PayPal, Visa, Disney, Nvidia, AMD, TD, RBC, JPM, JNJ, Enbridge, BRK-B",
        "created_utc": 1621536032,
        "id": "gyur60a",
        "permalink": "/r/stocks/comments/nh7ld4/stock_holdings_for_retirement_ie_next_30_years/gyur60a/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1621564832.0
    },
    {
        "author": "medi3val10",
        "body": "This is... completely incorrect. The OP says nothing about international money movement, which is really all that matters. I work in information technology for a major FINTECH and treasury management corporation. The system used to transfer money internationally is called SWIFT, and was created decades ago. It is very expensive to wire money internationally as it's not a flat rate, but a percentage. Sending multiple millions of dollars can add up to tens of thousands of dollars and isn't fully settled for three days. With Bitcoin, right now, one can send one billion USD for under $50 and have it settled near instantaneously. Read that again. \n\nThere is a reason that Paypal and Square are heavily moving in to the crypto space. It allows them to transfer money internationally exponentially easier and cheaper to serve as a back-end for their money transfer services. \n\nThe reputation of Bitcoin has been damaged by alt-coins. It is correct to be cautious of crypto as a space in general. There are thousands of scam and copy-cat coins. The only one that is trustworthy, proven over a decade, decentralized, and has a large enough market-cap to be useful for corporations is Bitcoin. If publicly traded and SEC-regulated companies are making purchases and moving in to Bitcoin, you can rest assured that it is safe for the consumer.  Don't make that assumption for any other coin, including Eth.\n\nFinally, the other major reason that Bitcoin will continue to move in an exponentially upward trajectory is the adoption by the entire rest of the planet that is not the USA or EU. There's a lot of talk about inflation and the danger of keeping your reserves in fiat money right now. Take whatever concerns you have and multiply that by one-thousand if you live anywhere else in the entire world, such as Turkey, Greece, or Africa, where new adopters are being onboarded at unprecedented rates. Bitcoin is rapidly becoming the new, decentralized, universal and trusted way to store and transfer value for normal people. I work in FINTECH and cryptology  and can tell you that this is only the beginning.",
        "created_utc": 1620737373,
        "id": "gxq1imd",
        "permalink": "/r/investing/comments/n9odr2/what_is_the_longest_future_trend_you_know_of_that/gxq1imd/",
        "score": 7,
        "subreddit": "investing",
        "created": 1620766173.0
    },
    {
        "author": "urgirlsmomsdaddy",
        "body": "Is it even worth holding large tech like SQ, PYPL, NVDA?\n\nIm getting paper hands, and an thinking of just moving everything into VTI.",
        "created_utc": 1620868079,
        "id": "gxxc6o2",
        "permalink": "/r/stocks/comments/naklxe/rstocks_daily_discussion_wednesday_may_12_2021/gxxc6o2/",
        "score": 7,
        "subreddit": "stocks",
        "created": 1620896879.0
    },
    {
        "author": "Vuffy_",
        "body": "Go PYPL",
        "created_utc": 1620245986,
        "id": "gx2his5",
        "permalink": "/r/wallstreetbets/comments/n5p1yh/what_are_your_moves_tomorrow_may_06_2021/gx2his5/",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620274786.0
    },
    {
        "author": "ReaditB4Bomber",
        "body": "Got fucked on my paypal calls yesterday but im diamond handing the shares idgaf, Paypal been beaten 9% for the month because the market was shit and had no run up to earnings,it just beat earnings and isnt trading much higher so im gonna wait until the markets better before I unload the shares🤔",
        "created_utc": 1620308508,
        "id": "gx5dhgz",
        "permalink": "/r/wallstreetbets/comments/n63s48/daily_discussion_thread_for_may_06_2021/gx5dhgz/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620337308.0
    },
    {
        "author": "order_66_man",
        "body": "PSFE is gonna crush earnings. SQ did good, PYPL did great and DKNG raking in the cash. Great news for PSFE. We will see $20+ before you know it.",
        "created_utc": 1620401135,
        "id": "gxa7d8l",
        "permalink": "/r/wallstreetbets/comments/n6uyxz/daily_discussion_thread_for_may_07_2021/gxa7d8l/",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620429935.0
    },
    {
        "author": "suphater",
        "body": "Pay attention to the strong behavior of this week while also probably avoiding stocks at ATHs, although I'm doing a mix.\n\nI love Roku, JCI, GT, RFP, PayPal, maybe Etsy if it goes just a little more down, CSPI is a little hidden gem in IT that's been strong this week, FANG, Verizon...\n\nYes those are most of the stocks green or \"close enough\" in my portfolio today. No I don't believe anyone on r/stocks has the ability to influence market trends, retail is low enough let alone our lonely sub. Genuinely trying to help, but you must do your own DD (or search the sub).",
        "created_utc": 1620834352,
        "id": "gxv5zip",
        "permalink": "/r/stocks/comments/naklxe/rstocks_daily_discussion_wednesday_may_12_2021/gxv5zip/",
        "score": 6,
        "subreddit": "stocks",
        "created": 1620863152.0
    }
]