[
    {
        "author": "NoBrainNoPain547",
        "body": "Nobody has mentioned that’s the ticker symbol for analog devices in the title. Adobe is ADBE and they have somewhere around a 310B market cap right now.",
        "created_utc": 1635547956,
        "id": "hikp8n6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1635576756.0
    },
    {
        "author": "Capasian",
        "body": "Thank you so much for these two meaningful and insightful posts. For a long time I have been trying to convince my friend to drop Intel stock (mostly based on their shrinking market share, your data nicely adds), but he still believes in the power of inertia. Nevertheless, I had gathered a list of stocks one IMO can use instead, not overperformative, but solid. \n\nI think that top pick is ASML - instead of betting on a sloppy big player in a growing market, you switch to the main supplier of players in this market. \nTexas Instruments and Analog Devices are good picks if you trust in the electronics segment as a whole, and they provide a wider product mix in terms of electronic components and integrated circuits.\nAnd my favorites also are companies, that produce good measurement instruments. I do solid state physics, and there is funny coincidence - producers of devices I like and use generally show good performance at a stock market. Those are Ametek, Agilent, Keysight, Danaher (Fortive).\n\nWhether you have the opinion on these companies, I would highly appreciate it.",
        "created_utc": 1634888953,
        "id": "hhlf79e",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1634917753.0
    },
    {
        "author": "SnipahShot",
        "body": "Financials is one thing. You can also check investor presentations and earning calls. \n\nThere is sometimes interesting information in those. \n\nThird is probably some information you can check in Yahoo Finance as well, like forward P/E, debt etc.\n\nThe last place is probably Google. You can simply Google the company and read recent news. Google makes it even easier because you can sort news based on dates and read the most recent news.\n\n&amp;#x200B;\n\nFor example, I invest in Analog Devices, Intel, Pfizer and some of the FAANG. \n\nI Google Analog Devices, Intel and Pfizer every day to read the most recent news about them, and sometimes you can notice rumors that make it worthwhile to invest more or buy in.",
        "created_utc": 1633268669,
        "id": "hf83ver",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1633297469.0
    },
    {
        "author": "SnipahShot",
        "body": "Oh yeah, I learned quite a bit in the short time I am investing so I do plan to research any company before putting money into it. \n\nRegarding dividends, I really only have one company that I bought specifically for that and it is O. The other companies are more growth than dividend but they provide dividend too (INTC, PFE, MSFT, AAPL and ADI).\n\nI do have a bit of money in VOO and VTI (accidently bought VOO instead of VTI so waiting to break even and then move what I have there to VTI).    \nI don't plan to focus that much in ETF though, as it stands right now I have only 3% of my portfolio in ETF. On one hand I want to learn more, on the other I think the stocks I have can do better than the overall market.",
        "created_utc": 1633990270,
        "id": "hga595l",
        "score": 2,
        "subreddit": "stocks",
        "created": 1634019070.0
    },
    {
        "author": "Dr_Clout",
        "body": "Where are my Palantards at?  How we doing tomorrow?  I like the fact Alaskan Revenue sold most their GME for PLTR and MRNA and ADI but I mean I just care about my man Magickarp. That autistic MUTHAFUCKA wouldn’t even have to ask me. Present itself 🌮",
        "created_utc": 1634515757,
        "id": "hh1so1w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1634544557.0
    },
    {
        "author": "SnipahShot",
        "body": "Hmm, 1-3 years?\n\nProbably Analog Devices (ADI) - Diversified chip maker. Kind of disappointed I didn't buy more of it during the September drops. Love that company after I heard the CEO in the last Q investor call answer that they are not going to raise their prices on their customers even though their competition did.\n\nPfizer too as I expect it go past $50 again after they finish the trials on their Covid pill.\n\nI am also heavy in Intel (20%)  but I am not sure how it will do in the next 1-3 years as I invested for the next 5-10.",
        "created_utc": 1635236703,
        "id": "hi3aaw8",
        "score": 1,
        "subreddit": "stocks",
        "created": 1635265503.0
    },
    {
        "author": "cantesa",
        "body": "CHPS semiconductor ETF.  It's newly launched in Canada. Top 10 holdings are:  \nNvidia  \nTSMA  \nASML  \nBroadcom  \nIntel  \nTexas Instruments  \nAMD  \nQualcomm  \nApplied Materials  \nAnalog Devices",
        "created_utc": 1635566344,
        "id": "hilqk1c",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1635595144.0
    },
    {
        "author": "SnipahShot",
        "body": "In my opinion, Intel, and very undervalued.\n\nAlso, Analog Devices. I personally really love that company, they dropped 5% yesterday down to 170.4 or something for some reason, price targets by institutions are around 190-200.",
        "created_utc": 1635417009,
        "id": "hid4kq0",
        "score": 0,
        "subreddit": "stocks",
        "created": 1635445809.0
    }
]