[
    {
        "author": "cmon_do_it",
        "body": "Here is Shiller's own Excess CAPE Yield metric which factors in interest rates:\n\n[https://en.macromicro.me/charts/27100/us-shiller-ecy](https://en.macromicro.me/spotlights/131/guan-jian-tu-biao-gu-jia-yi-jing-tai-gui-le-ma-le-ma-ren-shi-diao-zheng-hou-chao-e-ben-yi-bi-bao-chou-ECY)\n\nalso,\n\n[https://pse.is/3e9gf3](https://pse.is/3e9gf3)\n\nAccording to ECY, valuations are not as astronomical as they seem.",
        "created_utc": 1636132196,
        "id": "hjfryw4",
        "score": 132,
        "subreddit": "investing",
        "created": 1636160996.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "Paypal users 390 Million \n\nVisa Users 1280 Million\n\nMastercard users 840 Million",
        "created_utc": 1636704241,
        "id": "hkb5ysd",
        "score": 47,
        "subreddit": "stocks",
        "created": 1636733041.0
    },
    {
        "author": "wearahat03",
        "body": "&amp;#x200B;\n\n||PE RATIO|Recent REV GROWTH|\n|:-|:-|:-|\n|PYPL|44.7|13%|\n|AAPL|25.9|29%|\n|MSFT|39.1|22%|\n|GOOGL|28|41%|\n|FB|23.5|35%|\n|AMZN|80|15%|\n|V|34.9|29%|\n|MA|44|29%|\n\nPYPL is too expensive versus their growth rate. Their PE ratio is AFTER they've dropped.\n\nNot only are they more expensive than FAAMG but also more expensive than V and MA.\n\nOnly AMZN is more expensive and might correct in the future.",
        "created_utc": 1636821939,
        "id": "hkh1rf0",
        "score": 31,
        "subreddit": "stocks",
        "created": 1636850739.0
    },
    {
        "author": "TheDynamicKing",
        "body": "ain't nothing wrong with 50 years old living with ma and pa. this is the wall street way",
        "created_utc": 1636567568,
        "id": "hk3hamv",
        "score": 28,
        "subreddit": "wallstreetbets",
        "created": 1636596368.0
    },
    {
        "author": "Calm_Leek_1362",
        "body": "I've never heard of 'wumao'. I didn't think I was saying anything political... it's just how it is. The US Congress works for big money. CPC has complete control in China. Remember how some people thought Jack Ma was dead and nobody thought that sounded implausible? And not a single wall street banker that caused the 07 crash even had to pay a fine (in fact, they paid themselves bonuses with taxpayer money from bailouts), and nobody was surprised?\n\nI'm not judging either country, that's just the way it is.",
        "created_utc": 1636566641,
        "id": "hk3evsw",
        "score": 26,
        "subreddit": "wallstreetbets",
        "created": 1636595441.0
    },
    {
        "author": "EMTPirate",
        "body": "I checked your profile to see if you are another one of the Chinese profiles that keeps pushing junk investment, and I doubt a lawyer would need to buy a Turkish knockoff of a Glock, but I'll give you the benefit of the doubt that you are just a bad lawyer and can't afford anything better.\n\nI know a good deal about China, I know about the power struggle between Xi Jinping and the Jiang Zemin faction that is causing a lot of these crackdowns. I know the Army swears allegiance to the CCP instead of the nation. That the CCP rules as the please from Zhongnanhai without regard to laws.  They are content to practice hostage diplomacy like they did with the two Michael's to free Meng Wanzhou and they seem confused when western counties can't simply disregard the courts and do as they please like China. That the Belt and Road initiative is just neo colonialism to steal resources and strategic ports from poor nations. That the Uighurs face slave labor and genocide by controlling birth rates and harvesting organs like Falun Gong practitioners. \n\nChina is not a free, fair, or open market. Ask Jack Ma who got disappeared by them. Look at their national security laws, and how they annex neighborhoods and force their will on them. How they alter maps and globes to include the 9 dash line and pretend it is part of Chinese territory like the Scarborough shoal despite court rulings.\n\nSo tell me how elections matter when China can decide who is on the ballot to prevent a true opposition and use the national security law to disappear opposition?\n\nCall me a typical American, but my eyes are open to the actions of the CCP.",
        "created_utc": 1635853573,
        "id": "hj00l6f",
        "score": 19,
        "subreddit": "wallstreetbets",
        "created": 1635882373.0
    },
    {
        "author": "EtadanikM",
        "body": "You are all sorts of stupid if you think this wasn't caused by people like Jack Ma. It was precisely corporate greed that caused Chinese real estate companies to operate pyramid schemes where they would use the down payments from apartments that weren't even built to finish previous apartments that weren't even built. Ant Group would've made this infinitely worse with its \"wild west\" loan shark practices. Run away financialization IS the cause of over building.\n\nThis is a problem that Deng and his successors created. It isn't new.",
        "created_utc": 1636578439,
        "id": "hk49bcv",
        "score": 18,
        "subreddit": "stocks",
        "created": 1636607239.0
    },
    {
        "author": "Will_House",
        "body": "As a customer and holder of EQB, I'm very stoked for the Mastercard partnership",
        "created_utc": 1635896667,
        "id": "hj2vs48",
        "score": 15,
        "subreddit": "CanadianInvestor",
        "created": 1635925467.0
    },
    {
        "author": "moaiii",
        "body": "That doesn't work well with options most of the time due to gamma. You could have a fairly small pullback of the underlying down to a support line or MA which will knock 50% or more off the premium almost instantly. You close, because you couldn't get a fill at 20% down, but then the underlying confirms support and shoots right back up again past your entry point bringing those premiums straight back up with them. You just lost over 50% when the trade was always above support, still trending up, and doing just fine.\n\nTrade on the price action, not the P&amp;L, assume that the cost/margin to enter the trade is your \"at risk\" amount, and set your position size accordingly.",
        "created_utc": 1636242873,
        "id": "hjm3qei",
        "score": 14,
        "subreddit": "options",
        "created": 1636271673.0
    },
    {
        "author": "wsb202009",
        "body": "I keep adding PYPL daily dips, both shares and options. I hold V and MA Jan 22 options, buying IPAY ETF too.",
        "created_utc": 1635899035,
        "id": "hj31gmt",
        "score": 11,
        "subreddit": "stocks",
        "created": 1635927835.0
    },
    {
        "author": "Bacarchi",
        "body": "Wish is good company. Whenever I see their FB ads for male corzettes, various sex toys, fake night vission goggles, booletproof vests and shit like that it always makes me laugh.\n\nBut I ain't giving dime for that bag of shit. Jack Ma can eat them alive.",
        "created_utc": 1636585487,
        "id": "hk4qvcq",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636614287.0
    },
    {
        "author": "CommunicationOld9321",
        "body": "I hate not having alot to invest.....but slowly I ma get there",
        "created_utc": 1636071979,
        "id": "hjcs8k6",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1636100779.0
    },
    {
        "author": "Litho360",
        "body": "I like T for sure. Surprised it hasn’t moved already, but the latest infrastructure bill passed has 65 billion dedicated to improve internet access. \n\nPayPal seems like it should have some nice movements seeing how Visa and Mastercard have been making some nice gains.",
        "created_utc": 1636380109,
        "id": "hjsyfdz",
        "score": 11,
        "subreddit": "stocks",
        "created": 1636408909.0
    },
    {
        "author": "LuxGang",
        "body": "Someone yesterday made a great post analysing the Fintech companies like V, MA, PYPL, SQ etc.\n\nThe point this user made boils down to:\n\nV, MA, SQ, PYPL etc still have inflated P/E ratios(30+), while companies like GOOG are trading below 30 P/E and growing faster. So why buy an overpriced Fintech when you can buy GOOG at a much better value?\n\nMakes sense to me. I was looking at buying one of the aforementioned stocks, but now I think I'll just stick to big tech, which to me looks like a much better long term buy. Thoughts?",
        "created_utc": 1635960635,
        "id": "hj69ojt",
        "score": 11,
        "subreddit": "stocks",
        "created": 1635989435.0
    },
    {
        "author": "BernardoDeGalvez",
        "body": "I don't agree.\n\nVisa can grow a lot in south east asia and Africa.\n\nIn Europe and the States, there are a lot of people that don't need/use Paypal and never will\n\nBut everybody has and will have sinxe they open a bank account debit and credit cards (V and MA)",
        "created_utc": 1636728508,
        "id": "hkc5y97",
        "score": 10,
        "subreddit": "stocks",
        "created": 1636757308.0
    },
    {
        "author": "SmallParade",
        "body": "&gt;43.5 payment transactions per active account on a trailing twelve months basis, growing 11%\n\nThat’s from PayPal’s last earnings report. People are using it 3.6 times a month on average. That’s about how often I use it. I don’t use cash much anymore either but I use it more than 3.6 times a month. And I use my debit MasterCard to pay from my bank account probably 60-100 times a month. You understand now why they wanted to buy Pinterest. Generally speaking, people aren’t going around flashing the PayPal app everyday to pay for things. They use it here and there.",
        "created_utc": 1635899940,
        "id": "hj33peq",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635928740.0
    },
    {
        "author": "dzettel",
        "body": "For real. It’s a fair value now, about to pick up Visa and Mastercard at EOD",
        "created_utc": 1635881775,
        "id": "hj1twuu",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635910575.0
    },
    {
        "author": "Testynut",
        "body": "I love MasterCard and Visa",
        "created_utc": 1636509139,
        "id": "hk0jxoo",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1636537939.0
    },
    {
        "author": "tothemoonandback01",
        "body": "&gt;86% of Chinese approve of their government compared to something like 30% in America.\n\nYes, if the Chinese don't approve they disappear to the re-education camp.  Ask Jack Ma if you don't believe me.",
        "created_utc": 1635856623,
        "id": "hj05qa7",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635885423.0
    },
    {
        "author": "VacationLover1",
        "body": "Can Jack Ma just come out of his forced rehabilitation and say ‘buy the baba dip bitches’ just so we can break into the $200’s.. I mean how much longer will it take to brainwash the guy, it’s been a year",
        "created_utc": 1636341115,
        "id": "hjre52r",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636369915.0
    },
    {
        "author": "Tsukune_Surprise",
        "body": "I’ve said it before and I’ll say it again-\n\nGambling is why we are here. But when you gamble you know the odds and the rules of the game. (Mostly- I still don’t understand craps but I’ll lose money on it anyway)\n\nPoint is this- don’t fuck around with Chinese stocks.  They have no rules. The Chinese government is also instituting some new Jack Ma rules to keep companies from getting too strong. A Chinese company gets too big and the government will knock it down. \n\nDon’t fuck around with Chinese stocks.  (And you aren’t even really buying their stocks since foreigners can’t own Chinese stock directly). \n\nYou’re buying promise rings from virgins who haven’t figured out their sexuality while their ultra religious father tries to send them to straight camp.",
        "created_utc": 1635982342,
        "id": "hj7sm37",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636011142.0
    },
    {
        "author": "discovery991",
        "body": "MA",
        "created_utc": 1636697398,
        "id": "hkawsdx",
        "score": 9,
        "subreddit": "stocks",
        "created": 1636726198.0
    },
    {
        "author": "james14cunningham",
        "body": "the corrections are done, this is ready to move up much higher, all aboard. imho\r  \nI ma sure there is going to be smashing news very soon,\r  \nstart of the phase 3\r  \ntoxicology report\r  \npartnership\r  \ncovid nasal spray progress  \n\n\n$ATOS along with JMP and $BTCS will give good green this month. DD",
        "created_utc": 1636367598,
        "id": "hjsewbl",
        "score": 9,
        "subreddit": "pennystocks",
        "created": 1636396398.0
    },
    {
        "author": "swingforthefence69",
        "body": "Is PYPL dragging down V and MA? Looking to add some more to my positions",
        "created_utc": 1636470038,
        "id": "hjxx6rr",
        "score": 8,
        "subreddit": "stocks",
        "created": 1636498838.0
    },
    {
        "author": "DDRaptors",
        "body": "Fuckin PayPal dragging down my V and MA.",
        "created_utc": 1636471906,
        "id": "hjy1kp1",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636500706.0
    },
    {
        "author": "wsb202009",
        "body": "Big companies like PYPL, V and MA always meet the street expectations, but their forecast may differ depending on demand. \n\nWhen PYPL jumps, it goes like TSLA, no one can catch it !",
        "created_utc": 1635899175,
        "id": "hj31sz0",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635927975.0
    },
    {
        "author": "Successful_Okra6902",
        "body": "Price is below 200 MA, it's still going down.",
        "created_utc": 1636410526,
        "id": "hjv0jpq",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636439326.0
    },
    {
        "author": "brooklynbest97",
        "body": "I need PYPL to jump the same way MA did after that drop two weeks ago",
        "created_utc": 1636729588,
        "id": "hkc8foc",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636758388.0
    },
    {
        "author": "Jayytimes2",
        "body": "&gt;(V, MA, PYPL, SQ, etc) are all dipping and being replaced with buys of cyber security etc. (Cloudflare, NET, DDOG, FASTLY, etc).\n\nWould you mind expanding on this?",
        "created_utc": 1636593664,
        "id": "hk59bku",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636622464.0
    },
    {
        "author": "FEMA_Camp_Survivor",
        "body": "PayPal, Visa, MA, and others have been in the dumps lately. Godspeed homie.",
        "created_utc": 1636056486,
        "id": "hjbqoah",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636085286.0
    },
    {
        "author": "Queen__Elizabeth__2",
        "body": "Guys need some advice, I'm very interested in V, I believe is an awesome stock and is ready to go up but I have no ideia whats going on in that space. V, MA and PYPL have been dropping for a while... and I can't wrap my head around why. Can someone help?",
        "created_utc": 1636124479,
        "id": "hjf81tm",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636153279.0
    },
    {
        "author": "Zackattackrat",
        "body": "Ma calls be a printin’ tmro",
        "created_utc": 1636589483,
        "id": "hk500i5",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1636618283.0
    },
    {
        "author": "I_love_avocados1",
        "body": "It’s most payment processors, not just PayPal. Look what’s happening to old school competitors like $EEFT, $FIS, $FISV, $GPN, not to mention $MA, and $V.",
        "created_utc": 1635864325,
        "id": "hj0m8a9",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635893125.0
    },
    {
        "author": "Eslooie",
        "body": "Looks like no one is ever using electronic payments again. Totally makes sense V, MA, and Pypl have drilled.",
        "created_utc": 1635959531,
        "id": "hj66qrr",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635988331.0
    },
    {
        "author": "juaggo_",
        "body": "I think V. They are bigger and valuation more attractive. MA also has a lawsuit at the moment where they have their entire cash reserve worth of money on the line. I doubt they lose it all, just a thing to notice.",
        "created_utc": 1635975749,
        "id": "hj7czg2",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636004549.0
    },
    {
        "author": "FJBonks",
        "body": "Honest question here bc I was an investor in it but got out when Jack Ma faded out of the limelight.\n\nWhat are your reasons in putting money in a company that CCP likes to mess with?  Did you guys forget CCP cancelled the biggest IPO in the world for Ant group Nov 2020; And Alibaba just got fined $2.8 billion in April 2021.  Any success of Alibaba are being watched closely by the CCP.  \n\nI do hope this stock goes up for you if you’re still invested in it.",
        "created_utc": 1636570315,
        "id": "hk3oeg7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1636599115.0
    },
    {
        "author": "TheRandomnatrix",
        "body": "Me: \"Why can't you just have a green day?!\"\n\nVisa and MA: *screams*\n\nAt least DFS is carrying me today.",
        "created_utc": 1635952775,
        "id": "hj5oudc",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635981575.0
    },
    {
        "author": "The_Number_12",
        "body": "I got in at $187 last year, I think it's honestly going to keep sliding down for a while, it's likely gonna get to $160 maybe even $150\\~. T ROWE Price is one of the biggest holders and they've been shedding PYPL for a little while now, I think other large firms are doing the same en masse now. They were up over 100% if they bought a little over a year ago, time to sell it off hard. the P/E makes no sense compared to V amd MA which do the same service more or less (move money &amp; pay merchants).",
        "created_utc": 1636499404,
        "id": "hjzy4da",
        "score": 6,
        "subreddit": "stocks",
        "created": 1636528204.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "JACK MA",
        "created_utc": 1635951334,
        "id": "hj5l6pz",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1635980134.0
    },
    {
        "author": "WasteNet2532",
        "body": "Baba was beat down bc Jack Ma made a mistake. And Xinnie the Pooh punished him greatly for it. So long as baba diversifies in areas where the government doesnt care so much ( which it seems to be doing)it is greatly undervalued, but in my situation, the risk *is* necessary. I lost 70% of my account. So im using the last few grand for a couple LEAPs. Lets just see how these earnings play out",
        "created_utc": 1636449169,
        "id": "hjx0eo7",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636477969.0
    },
    {
        "author": "WombatShwambat",
        "body": "When do you guys think Jack Ma will be done with his re-education?",
        "created_utc": 1636392801,
        "id": "hjtsi49",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636421601.0
    },
    {
        "author": "whatyoulookinatbud",
        "body": "MQ. I believe they can take on MasterCard and Visa. Or will get bought out.",
        "created_utc": 1635828550,
        "id": "hiz68o3",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635857350.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "When is Jack Ma going to rescue BABA?",
        "created_utc": 1636601093,
        "id": "hk5pual",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636629893.0
    },
    {
        "author": "duskick",
        "body": "To me, SQ is an earlier version of PayPal.  They are in the process of creating their network.  The benefit they have in the long run in owning the hardware, software, and network, is that they can eliminate Visa and MasterCard from the equation.  If someone uses the Cash app to buy directly from a SQ terminal, the could reduce the charge from 2-3% (of which they get a small cut) to 0-5-1% (of which they get all).  SQ wins, merchant wins, but V and MC lose on such a transaction. PayPal is trying to build a similar network, but doesn’t have as much traction with in person terminals.",
        "created_utc": 1636724999,
        "id": "hkbyg2k",
        "score": 5,
        "subreddit": "stocks",
        "created": 1636753799.0
    },
    {
        "author": "yaboiRich",
        "body": "Went to the bar last night and ran in to this girl I used to bang. She ignored me like she didn't who I was. Its alright bitch, I got your friends number and imma fuck her just to spite you. \n\nHave a safe weekend out there ma dudes",
        "created_utc": 1636782719,
        "id": "hkffflb",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636811519.0
    },
    {
        "author": "midnightscare",
        "body": "Brookfield bets on post-pandemic office demand with Alstria (German real estate company) €19.50/share in cash takeover offer \n\nhttps://www.reuters.com/article/alstria-office-ma-brookfield-asset-idUSL8N2RV4JP",
        "created_utc": 1636044593,
        "id": "hjawavk",
        "score": 5,
        "subreddit": "CanadianInvestor",
        "created": 1636073393.0
    },
    {
        "author": "Current-Promotion-31",
        "body": "Watertown MA offering $310 an hour for snow plow drivers.  Dat shit cray",
        "created_utc": 1636547171,
        "id": "hk265ub",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1636575971.0
    },
    {
        "author": "Shandowarden",
        "body": "MQ and SOFI. Idk why this sub is so biased heavily onto old names when there are far better opportunities. Mastercard, Visa and Paypal already grew a shit ton during covid and their numbers were unjustified. SQ also blew up so much already and you can see it sitting stale st 230-270 levels forever. If you want to save money, sure buy those, but if you want more aggro future growth, go MQ and SoFi",
        "created_utc": 1635864854,
        "id": "hj0nhfx",
        "score": 4,
        "subreddit": "stocks",
        "created": 1635893654.0
    },
    {
        "author": "LazySoftwareEngineer",
        "body": "Buy almost any other payment processor, not PyPl. V, MA, SOFI, SQ, now UPST on the dip even. There will be a bounce, but I foresee a long sideways crawl for this.",
        "created_utc": 1636513592,
        "id": "hk0tukr",
        "score": 4,
        "subreddit": "StockMarket",
        "created": 1636542392.0
    },
    {
        "author": "epyonxero",
        "body": "Thats the dream but the banks and payment networks arent going to give up their cash cow without a fight. V and MA are already dipping their toes into crypto and blockchain payments. Banks tried and failed to kill crypto before and now theyre trying to co-opt it by making it so only banks can issue stable coins. \n\nIm bullish on Circle because they know this and have been very proactive in appeasing the regulators.",
        "created_utc": 1636683378,
        "id": "hka5jqg",
        "score": 4,
        "subreddit": "SPACs",
        "created": 1636712178.0
    },
    {
        "author": "sf_warriors",
        "body": "Galileo is alone worth $20 billion imho. They are galloping at 100miles/hr with their expansion throughout the world, visa and mastercard have 10a of integrations in the news. It is regarded as one of the best and fastest growing payments processor. If Galileo to have a ipo today, they will easily raise $20 billion. Similar company called Marquetta(MQ) is valued $25 billion who went ipo this year",
        "created_utc": 1636694880,
        "id": "hkasr4p",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636723680.0
    },
    {
        "author": "polonaisefantaisie",
        "body": "Okay but Visa looks terribly oversold. It's way below the ath and lagging behind Mastercard.\n\nI think V leaps could be a nice play.",
        "created_utc": 1636828559,
        "id": "hkhhcpz",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636857359.0
    },
    {
        "author": "Sell_Hour",
        "body": "They’re going into hiding like jack ma did",
        "created_utc": 1636046595,
        "id": "hjb1h21",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636075395.0
    },
    {
        "author": "Specialist_Coffee709",
        "body": "All in $INTC then since we all know they just need to do a better copycat of AMD shit. Alibaba did a good job……Pat needs to higher ma asap!",
        "created_utc": 1635864225,
        "id": "hj0lzpa",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1635893025.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "Jack Ma",
        "created_utc": 1636234787,
        "id": "hjllwq8",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636263587.0
    },
    {
        "author": "bidensaphag",
        "body": "MA!!! The Meatloaf!!",
        "created_utc": 1636307135,
        "id": "hjp67w6",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636335935.0
    },
    {
        "author": "atdharris",
        "body": "Venmo may be growing but apparently other parts of their business are not. PYPL is growing slower than V or MA yet trading at a premium to those two companies. That's likely why the stock is selling off.",
        "created_utc": 1636486120,
        "id": "hjz17za",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636514920.0
    },
    {
        "author": "Erion929",
        "body": "I understand, as a business….but they have some hard times coming in China.\n\nPolitically, BABA will continue to be depressed by the CCP….where’s Ma, anyway?",
        "created_utc": 1636564926,
        "id": "hk3afc0",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1636593726.0
    },
    {
        "author": "Ok-Wasabi2873",
        "body": "I was arguing with my cousin, heavy value guy, about this. My argument against BABA is that Jack Ma has fallen out of favor with the CCP. And the CCP picks the winners. I don’t think they’re going to pick BABA.",
        "created_utc": 1636828645,
        "id": "hkhhjxz",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636857445.0
    },
    {
        "author": "Teekay53",
        "body": "Same. People are saying that the CCP is not going to kill their golden goose. However, I don't think that when the CCP looks at Alibaba they see a golden goose, but rather they see how capitalism can bring arrogance and power to someone who's supposed to listen to them, not question them (Jack Ma). It doesn't matter that Ma is out, my belief is that this is how they still see alibaba, as an entity that dared question their power.",
        "created_utc": 1636828862,
        "id": "hkhi1n2",
        "score": 4,
        "subreddit": "stocks",
        "created": 1636857662.0
    },
    {
        "author": "CommunicationOld9321",
        "body": "Those new solar roof tiles look dope I ma invest in the companies",
        "created_utc": 1635827460,
        "id": "hiz4ktn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635856260.0
    },
    {
        "author": "daaabears1",
        "body": "I haven’t followed the company very closely but a short term headwind could be the reopening. It seems like PayPal is used mostly digitally. When i pay for stuff in person I use Visa or Mastercard (sometimes use a Square POS). I think there’s a big missed opportunity with a digital only (or mostly) platform. With that said, not an expert on the company so I could be wrong.",
        "created_utc": 1635816435,
        "id": "hiyiwwi",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635845235.0
    },
    {
        "author": "phohunna",
        "body": "I live in Canada and I recently visited friends in MA where weed was legalized in 2017. Many municipalities still ban the sale.\n\nIn Boston, they have like 2 recreational dispensaries for the entire city. We had to bike nearly a half hour from Cambridge, and there were several security guards for the sleepy store. You can't buy with a credit card because the lending banks want nothing to do with it.\n\nIn Canada by contrast, its much more like a small fancy liquor store. We have dispensaries every few blocks and zero security guards. You can go in and buy with your credit card.\n\nCompanies like TLRY wont take off until there is sufficient distribution and its easy to buy. That wont come until its nationally legalized. Its going to be a long time.",
        "created_utc": 1636037190,
        "id": "hjad7db",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636065990.0
    },
    {
        "author": "wsb202009",
        "body": "Ha ha ha ! That is for you to find out !! If the reason is genuine, PYPL stock down is justified. If not, you have chances to benefit !!!\n\nBTW: All payment sector is down with rotation, such as V, MA, PYPL..etc",
        "created_utc": 1636121692,
        "id": "hjf14bn",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636150492.0
    },
    {
        "author": "B1gChuckDaddySr",
        "body": "Jack Ma to the rescue",
        "created_utc": 1636336838,
        "id": "hjr58cn",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636365638.0
    },
    {
        "author": "NaplesBrandon",
        "body": "You would be better served trading spreads on large, industry leading stocks like MA, SHOP, DG, AMZN etc. watching their 30-60 trading ranges and selling spreads far out of the money when they trade near the lower end of their range. OTM by 20% or more when possible or near 52 week low.",
        "created_utc": 1636728759,
        "id": "hkc6j0m",
        "score": 3,
        "subreddit": "options",
        "created": 1636757559.0
    },
    {
        "author": "VisualMod",
        "body": "#Ban Bet Won\n---\n\n/u/Telkorenar (2/0) made a bet that MA would go to 355.0 when it was 336.7 and it did, congrats autist.",
        "created_utc": 1636556226,
        "id": "hk2oiym",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636585026.0
    },
    {
        "author": "RingingInTheRain",
        "body": "I'm down at least 10k from my FB/Meta calls. I averaged down too. I feel you ma. I feel you..",
        "created_utc": 1636561944,
        "id": "hk32pd9",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636590744.0
    },
    {
        "author": "MungerMentalModel",
        "body": "if you go to [tradingview.com](https://tradingview.com), go to the chart, click on \"indicators\" , then search for \"MA\".  add it to the chart and then you can change the settings for it to show 20 instead of the default which is 9.  The price action of a stock frequently interacts with the moving average, the moving average acts like a rubber band.  The farther the stock moves away from it, the stronger it wants to rebound back.",
        "created_utc": 1636512860,
        "id": "hk0s8o8",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636541660.0
    },
    {
        "author": "The_Bill_Slayer",
        "body": "I love Canadian tire,  I really think they've been incredible lately.  Sears target closed, years later I'm checking out full toy isles in canadian tire lol loved it almost filled a void.   \nAlso love their website I swear it's better then walmarts website and costco I mean that says a lot imo!\n\nOnly reason I put it behind a railroad or a bank as my choice is because . . . .\n\nThe banks are expanding outside of Canada td bank northern USA, scotia bank south America.   I mean if your in a government corrupt country would you rather use Los Locale Banco  or Scotia bank to hold your tendies? \n\nRailroads are kind of limited to North America altho they can do buyouts for a bigger American presence I don't even think they have to worry too much there is 2 for canada they can share?!\n\nSeems more competition in stores?\n\nHow much more can they expand?  I love em use them all the time and have their Mastercard lol",
        "created_utc": 1636597871,
        "id": "hk5ishb",
        "score": 3,
        "subreddit": "CanadianInvestor",
        "created": 1636626671.0
    },
    {
        "author": "iriechubs",
        "body": "I was day trading my mom txt me I’m like ma The meatloaf! Anyways by the time I got back from the txt like 1 min later I was down 2,500$. I was like note to self never answer txts while trading!",
        "created_utc": 1636812959,
        "id": "hkgioiw",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636841759.0
    },
    {
        "author": "sreten-jr",
        "body": "Buy high, sell low ma brothas",
        "created_utc": 1635863552,
        "id": "hj0keez",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635892352.0
    },
    {
        "author": "wsb202009",
        "body": "Look of for IPAY, portfolio is V, MA, PYPL...etc all mobile payments.\n\nIf you look for stocks, my preference is for SID (3.95 now), but steel industry with good dividend 9% and low P/E. Results due by Nov 4th. I think it won't long last at this price.\n\nETF is SLX.\n\nPresently they are corrected high and will revive in future.\n\nStarting buying small qty, keep adding every dip.\n\nBTW: I own all of these, may be biased with my DD. You need to analyze before your decision.",
        "created_utc": 1635875661,
        "id": "hj1e57c",
        "score": 3,
        "subreddit": "stocks",
        "created": 1635904461.0
    },
    {
        "author": "tracyXTMAC",
        "body": "lol okay. You will get there one day ma boi. And yeah dont ever bet against Elon. I did the same thing earlier this year and $8k evaporated in 3 days.",
        "created_utc": 1636175151,
        "id": "hjik6ve",
        "score": 3,
        "subreddit": "options",
        "created": 1636203951.0
    },
    {
        "author": "Particular-Cake-6430",
        "body": "Jack ma is rich as fuck though. That’s like a 5 point boost",
        "created_utc": 1636086011,
        "id": "hjdlf9q",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636114811.0
    },
    {
        "author": "BokitoIsMijnVriend",
        "body": "he was [overhere](https://nltrending.com/billionaire-and-alibaba-founder-jack-ma-brings-visit-to-the-netherlands/) last week",
        "created_utc": 1636392979,
        "id": "hjtsyeh",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636421779.0
    },
    {
        "author": "bazookateeth",
        "body": "Also LLKKF for a lithium play. Has ties with Jeff Bezos, Bill Gates and Jack Ma.",
        "created_utc": 1636300841,
        "id": "hjoqcz6",
        "score": 3,
        "subreddit": "pennystocks",
        "created": 1636329641.0
    },
    {
        "author": "CHERCK_FLOKI",
        "body": "IRS be like.... Where's ma cut home.",
        "created_utc": 1636320868,
        "id": "hjq5b55",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636349668.0
    },
    {
        "author": "arbiter12",
        "body": "Ma dude... your innocence worries me so i will be harsh.\n\nDo you really think, if the recipe for making money was \"[just look for undervalued companies whereby their total share\\*value is lower than their Ebitda/cashvalue!](https://corporatefinanceinstitute.com/resources/knowledge/trading-investing/trading-below-cash/)\", professional trading houses would spend literal billions in research, algorithm and personnel?\n\n&amp;#x200B;\n\nWhat you should first learn about this industry, if you want to succeed in it is that if something is easy and/or predictable, then it doesn't work/won't happen. You may get lucky and expect the expected and it happens just as planned, but most often, the big players are contrarian to the market itself, meaning that if you think A is likely and a million people think A is likely, then B is almost guaranteed to happen (unless enough contrarians think B will happen, then probably C)\n\nTraders don't play the game fairly. They just harvest money from betting against the most number of people.",
        "created_utc": 1636552545,
        "id": "hk2gasj",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636581345.0
    },
    {
        "author": "EyesEarsMouthNose",
        "body": "Just say EBITDA ma guy",
        "created_utc": 1636676194,
        "id": "hk9q7j4",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636704994.0
    },
    {
        "author": "RumHam1",
        "body": "Valuing a stock is really difficult and it often boils down to a lot of different assumptions.  Even experts are routinely wrong, so keep that in mind.  What I do for one company normally takes 3-5 hours, and I try to do it quarterly for any company I own.\n\nI will usually start by collecting the company's past, current and future valuation metrics.  Things like price to sales, price to earnings, price to forward earnings, debt ratios, etc.  I compare the 5 year averages to what they currently are.  I also do for their competitors and companies in the same financial space (for example, I'd look at Visa, Mastercard, and other card companies together).  I look at past growth and projected growth to see if I think the valuations are justifiable where they currently are.\n\nI look through the financial statements and try to spot trends in cash flow, debt, margin, and many other things to see how the company is performing yoy and qoq.\n\nI look at how the company is engaging with the industry and where they are projecting their growth to come from.  Are the expanding market share, is the sector growing, etc.  I need the company to justify why it can achieve or surpass their growth estimates.\n\nI listen to their most recent conference calls and look though any articles I can find, but I heavily discount opinion pieces.  I actively seek out reasons why this company will fail.\n\nAfter all of this, I try to put together a balanced view of where the company is valued now vs historically and also vs their competition.  It requires a lot of projection and assumptions and I only do it for companies that I can understand their business model.  You have to go into the process without bias, and to be honest the majority of companies that I do this for aren't buys at the time.",
        "created_utc": 1636650548,
        "id": "hk81eep",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636679348.0
    },
    {
        "author": "sendokun",
        "body": "I would do 40% on V and PayPal, 20% on MA",
        "created_utc": 1636743617,
        "id": "hkd6o2e",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636772417.0
    },
    {
        "author": "rainbow0o",
        "body": "id rather invest in sofi, visa, mastercard, afrm, and square than paypal.",
        "created_utc": 1636818352,
        "id": "hkgtlx9",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636847152.0
    },
    {
        "author": "Im_Blind_And_Deaf",
        "body": "I wanna sheet on ma bed",
        "created_utc": 1635805147,
        "id": "hixtivs",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635833947.0
    },
    {
        "author": "mwing95",
        "body": "BKKT - Hugh volatility play but with their recent deal with Mastercard I'm liking their future. \n\nSLI - stable lithium company, decent volatility",
        "created_utc": 1635781568,
        "id": "hiw8lzl",
        "score": 3,
        "subreddit": "options",
        "created": 1635810368.0
    },
    {
        "author": "WSBrexiteer",
        "body": "Jack Ma new Chinese Premier after initiating a bloody coup with thousands of tanks bought over AliExpress",
        "created_utc": 1635800966,
        "id": "hixjlz7",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1635829766.0
    },
    {
        "author": "WVEers89",
        "body": "Sold my $MA calls for a $400 loss yesterday morning.\nThey would have been worth $1900 at 2pm today.\nSick.",
        "created_utc": 1636145683,
        "id": "hjgrkv1",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636174483.0
    },
    {
        "author": "Albedo100",
        "body": "&gt; Visa/Mastercard/Discover all charge the vendor a percentage of the transaction. This fee adds up. Blockchain can be substantially less.\n\nTraditional transaction fees *can* be less as well if they just chose to lower the fees. \n\nYou're missing the point that blockchains carry a premium cost to cover securing the network and it may never been competitive with closed systems. On blockchain *fees* are fundamental. In traditional systems, they aren't.",
        "created_utc": 1636313778,
        "id": "hjpna1h",
        "score": 3,
        "subreddit": "investing",
        "created": 1636342578.0
    },
    {
        "author": "Future_Expat_FIRE",
        "body": "Nice post and I like the set up rather than coming in hot.  Downside risk is limited to $200 IMO and they consistently meet or beat earnings because they are conservative by nature.  I’ve been waiting for this type of opportunity in a solid company for a long time.  Went with $300 Jan 24 leaps just in case I’m completely wrong about Monday, so I have time on my side :)  GLTA and hop on MA if your looking for a safer play that is already breaking out!",
        "created_utc": 1636198685,
        "id": "hjjexax",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636227485.0
    },
    {
        "author": "1200mademeaCommie",
        "body": "I’d go with the beat up Dow names and look for continuation. Axp. V. Ma. Cat. Ba. Dis.",
        "created_utc": 1636197552,
        "id": "hjjda9z",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636226352.0
    },
    {
        "author": "dontgetmadgetdata",
        "body": "I like it. The price is pretty elevated off it’s 50 day MA due to a nice post earnings drift. It has kissed its 50 day 5 times this year. To increase your probability of profit, I might wait until it consolidates/retraces to around this area and open up the position at that time. Possibly move the strike closer to that stock price to further increase the leverage. \n\nFor example, If it retraces to closer to $300 level and open contracts with $280-$300 strike. You would still need around $350 to break even if the cost is halved but you would have substantially more leverage per dollar.",
        "created_utc": 1636230931,
        "id": "hjldc8e",
        "score": 3,
        "subreddit": "options",
        "created": 1636259731.0
    },
    {
        "author": "migbyo",
        "body": "I think [this breakdown of M&amp;A in the biotech industry](https://www.evaluate.com/vantage/articles/data-insights/ma/following-ma-money-phase-and-therapy-area) is interesting.",
        "created_utc": 1636661759,
        "id": "hk8td8r",
        "score": 3,
        "subreddit": "shroomstocks",
        "created": 1636690559.0
    },
    {
        "author": "notreally49",
        "body": "agreed, baba price is 90% dependent on chinese gov easing the pressure and Jack Ma coming back, earnings alone wont take it above 180.",
        "created_utc": 1636757257,
        "id": "hke21z2",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1636786057.0
    },
    {
        "author": "PCB4lyfe",
        "body": ".75% ER seems high when their top holdings are SQ PYPL V and MA, I just bought those 4 companies and called it a day.",
        "created_utc": 1636820931,
        "id": "hkgzg3n",
        "score": 3,
        "subreddit": "stocks",
        "created": 1636849731.0
    },
    {
        "author": "Mr-Acorns22",
        "body": "GIMME MA MONEY",
        "created_utc": 1635763211,
        "id": "hivbbig",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635792011.0
    },
    {
        "author": "Goddess_Peorth",
        "body": "&gt; not afraid of risk\n\nThat's for sure.\n\nYou can't balance with solid long term plays. It isn't in your character. You'll buy whatever people tell you are long-term solid plays.\n\nLike I could tell you that MACAW is going to the moon, and you'd probably buy it. (I bought it. I'm bullish. Don't buy that, it's gambling, be a good boy.)\n\nSell your bags and buy VOO. If you own something shitty like BABA and it is up, sell that too. Where is the world is Jack Ma? Why would you still be holding that?",
        "created_utc": 1635818343,
        "id": "hiyn5j8",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1635847143.0
    },
    {
        "author": "Tendiemesilly",
        "body": "Imma keeep it lika island boy imma keep it like an island boy imma keep it like a guap ma man, ya ya ya",
        "created_utc": 1636044248,
        "id": "hjavepo",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636073048.0
    },
    {
        "author": "Dmoan",
        "body": "It is still way below its highs and 200 day MA",
        "created_utc": 1635790047,
        "id": "hiwsrch",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635818847.0
    },
    {
        "author": "Beilsteiner",
        "body": "Also Jack Ma everything in Baba",
        "created_utc": 1635884708,
        "id": "hj21iye",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1635913508.0
    },
    {
        "author": "polychris",
        "body": "[https://imgur.com/a/shou9yJ](https://imgur.com/a/shou9yJ) The MA(50) on the 5 min chart is the 250-min moving average.",
        "created_utc": 1636073524,
        "id": "hjcvsgc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636102324.0
    },
    {
        "author": "Joltarts",
        "body": "I paint you a highly probable bear scenario.\n\nTesla cant meet production demand because of microchip shortages. Tesla is the most chip dependant car company out there. They will get hit by a shortage in chips to produce their cars. The prices of chips will also shoot up so high, Tesla will have no choice but to sell their cars at even lesser margins.\n\nThe green credits which Tesla depends highly on to boost their profit numbers become less attractive in 2022 and it drops significantly. A big revenue stream for Tesla is about to go out of business.\n\nAutonomous driving experiences set back, Tesla cant deliver a workable solution and regulations ban the use of fully auto vehicles due to safety concerns.\n\nThe already crowded Tesla network is both costly to maintain and cant expand quick enough. Other players using standard charging ports catch up and overtake Tesla here. Especially in Europe and China. Since Tesla cars can only charge on Tesla ports, suddenly, Tesla cars are less attractive to own.",
        "created_utc": 1635831051,
        "id": "hiz9qo2",
        "score": 5,
        "subreddit": "stocks",
        "created": 1635859851.0
    },
    {
        "author": "Paul_Ostert",
        "body": "TSM is a buy and hold.... they almost have a monopoly on high end microchip manufacturing.",
        "created_utc": 1636067986,
        "id": "hjcj197",
        "score": 5,
        "subreddit": "StockMarket",
        "created": 1636096786.0
    },
    {
        "author": "Robot_of_Sherwood",
        "body": "# Today is Thursday, the  4th of November\n\n\n\n## Upcoming events for Thursday, November  4th\n\n - Expected earnings:\n\n  AAOI, AAON, AAU, ABC, ABNB, ABUS, ACET, ACIW, ACMR, ACR, ACRX, ADAP, ADMA, ADMS, ADVM, ADXN, AE, AERI, AES, AEZS, AFCG, AG, AGLE, AGO, AGS, AHCO, AIG, AINV, AIV, AJX, AKBA, AL, ALBO, ALE, ALEX, ALGS, ALHC, ALKT, ALLO, ALRM, ALTR, AMEH, AMH, AMN, AMPY, AMRK, AMYT, ANGI, ANIK, AOSL, APD, APLE, APPN, APR, APRE, APT, APTV, AQMS, ARC, ARDX, ARNA, ARQT, ARVN, ARW, ASMB, ASPS, ASRT, ATAX, ATEC, ATLO, ATNX, ATRA, ATRS, ATSG, ATUS, AUMN, AUTO, AVLR, AVRO, AXNX, BABA, BALY, BAP, BATRA, BATRK, BBD, BBDO, BBIO, BCE, BCLI, BCOR, BCYC, BDX, BE, BEPC, BFS, BGNE, BGS, BHF, BIGC, BILL, BKD, BL, BLCM, BLDR, BLFS, BLI, BLL, BLPH, BNGO, BPMP, BRG, BSBK, BSGM, BXRX, CABO, CAI, CALA, CARS, CBAY, CBIO, CC, CCOI, CDR, CDTX, CDXS, CDZI, CEMI, CFLT, CFX, CGNX, CHH, CHUY, CI, CIR, CLBS, CLDT, CLDX, CLFD, CLI, CLLS, CLNE, CLXT, CMBM, CMRX, CMT, CNCE, CNDT, CNHI, CNP, CNQ, CNXN, COLD, COLL, COMM, CPLG, CPLP, CRAI, CRDF, CRMD, CRON, CRY, CS, CTHR, CTLP, CTMX, CTSO, CTT, CTXS, CUBE, CVCO, CVET, CVNA, CVRX, CWEN, CWEN.A, CWK, CXP, CYBR, CYCN, CYRX, DBRG, DBX, DDOG, DEN, DHC, DIN, DISH, DK, DKL, DLX, DMLP, DNB, DNLI, DNN, DOCN, DRH, DRNA, DUK, DVAX, DWSN, DYN, EBS, ECOR, ED, EGLE, EIGR, ELOX, ENDP, ENG, EOG, EPAM, ERF, ERII, ESTE, ETTX, EURN, EVC, EWCZ, EXPE, FARM, FAT, FATBB, FATE, FCRD, FDUS, FIS, FLNT, FND, FNKO, FOCS, FOLD, FOR, FOXF, FROG, FRT, FSLR, FTNT, FULC, FVCB, FVE, FWONA, FWONK, GBT, GDOT, GDP, GDYN, GEL, GEO, GERN, GH, GIL, GKOS, GLPG, GMED, GNE, GNL, GOGO, GOLD, GOLF, GOVX, GPP, GPRE, GPRO, GRFS, GROW, GRTS, GSBD, GTN, GTN.A, GTYH, HALL, HASI, HBI, HEAR, HHC, HII, HIMX, HL, HMHC, HMPT, HRTG, HSKA, HTA, HWM, HZN, IAC, IBOC, IBP, ICL, IDCC, IDRA, IFRX, IGMS, IHC, IHRT, III, ILMN, IMH, IMMR, IMRA, IMUX, INDP, INDT, ING, INGN, INOD, INS, IOVA, IRM, IRTC, IRWD, ISDR, ISPC, ITP, ITRI, JNCE, JYNT, K, KALA, KBAL, KDMN, KDNY, KFFB, KIQ, KMPH, KOP, KRP, KRTX, KTB, KURA, KVHI, KWR, KYMR, KZR, LABP, LASR, LAUR, LAZY, LBRDA, LBRDK, LCUT, LFVN, LGF.A, LGF.B, LITE, LLNW, LND, LNG, LNT, LNTH, LOCO, LORL, LPTH, LSPD, LSXMA, LSXMB, LSXMK, LTHM, LTRPA, LTRPB, LXP, LYV, MACK, MAIN, MASS, MBUU, MCHP, MDGL, MDRX, MED, MELI, MGEE, MGLN, MGTA, MGTX, MITK, MITO, MLAB, MLCO, MNDT, MNST, MP, MRIN, MRNA, MSC, MSGM, MSI, MTBC, MTD, MTEM, MTSI, MTX, MTZ, MUR, MUX, MXC, MYE, NATR, NE, NEO, NEPH, NET, NFG, NH, NHC, NINE, NKLA, NKSH, NKTR, NLOK, NMM, NNBR, NNI, NOMD, NPTN, NREF, NRG, NS, NSIT, NTCT, NTLA, NTRA, NTUS, NVAX, NVMI, NWS, NWSA, NXTC, OBSV, OEC, OGE, OHI, OLED, ONCT, ONTO, OPCH, OPTN, ORGS, ORIC, ORLA, OTEX, OTRK, OUT, OXY, OYST, PAC, PAE, PALT, PASG, PBA, PBH, PBYI, PCOR, PCTI, PCTY, PDCE, PDEX, PECO, PEI, PENN, PESI, PFSI, PGNY, PH, PHI, PINS, PLM, PLNT, PLX, PMT, PODD, PPL, PRCT, PRDO, PRMW, PROF, PRTA, PRVB, PSNL, PTMN, PTON, PWFL, PWP, PWR, PZG, PZZA, QDEL, QRTEA, QRTEB, QTRX, RBA, RC, RCUS, RDFN, REFR, REG, REGN, REPL, REYN, REZI, RFP, RGA, RGLS, RGS, RKT, RLJ, RMAX, RNGR, RUN, RWAY, SALM, SATS, SELB, SEM, SFE, SFM, SGA, SGMO, SHAK, SHO, SHYF, SID, SIGA, SKM, SLDB, SLQT, SLRX, SMHI, SMLP, SNPO, SO, SPRO, SQ, SRLP, SRRA, SRTS, SSYS, STFC, STKS, STNE, STOR, STRA, STRO, SVC, SVM, SVRA, SWCH, SWKS, SWX, SXI, SYBX, SYNA, TAL, TCX, TDC, TDS, TDW, TEF, TFFP, TGH, TGNA, TGP, TGTX, THR, TIPT, TK, TMCI, TMST, TNK, TPL, TRGP, TRHC, TRIN, TTOO, TTSH, TUEM, TWI, UBER, UEIC, UFCS, UIHC, UNIT, UONE, UONEK, USM, USPH, USWS, VATE, VCTR, VG, VHI, VIA, VIAC, VIACA, VIAO, VIAV, VIR, VLDR, VMC, VNT, VRAY, VRRM, VSAT, VSTO, VTVT, VVI, W, WCC, WD, WELL, WFCF, WLDN, WLL, WMC, WMS, WPM, WSC, WSTG, WW, WWE, WYNN, XENE, XFOR, XLRN, XOMA, XONE, XRAY, XTNT, XXII, Y, YELP, YMAB, YTRA, ZBH, ZEUS, ZGNX, ZTS\n\n - Ex-div:\n\n  AFB, AMX, ARLP, BKEP, BMRC, BPRN, CEQP, CFFN, CMCO, CMS, CPLP, CVCY, DAN, DKL, ET, FBC, FCBC, FCF, FE, FFWM, FRAF, FRBA, GPP, HCC, HSII, HWKN, HWM, IBCP, ICBK, IDA, INTC, JBHT, LBAI, LBC, LVHD, LW, MMLP, MMP, NSC, NWBI, NWLI, NYCB, OHI, PFE, PNFP, RELL, SIRI, SRLP, STZ, STZ.B, SUN, TGP, UL, WAFD, WFC\n\n - Economic events and announcements:\n\n    - 4-Week Bill Auction (previous: 0.055%)\n    - 8-Week Bill Auction (previous: 0.095%)\n    - Challenger Job Cuts (previous: 17.895K)\n    - Continuing Jobless Claims (consensus: 2,118K, previous: 2,243K)\n    - Exports (previous: 213.70B)\n    - Imports (previous: 287.00B)\n    - Initial Jobless Claims (consensus: 275K, previous: 281K)\n    - Jobless Claims 4-Week Avg. (previous: 299.25K)\n    - Natural Gas Storage (consensus: 63B, previous: 87B)\n    - Nonfarm Productivity (consensus: -3.0%, previous: 2.1%)\n    - OPEC Meeting\n    - Trade Balance (consensus: -80.50B, previous: -73.30B)\n    - Unit Labor Costs (consensus: 7.0%, previous: 1.3%)\n\n## Upcoming events for Friday, November  5th\n\n - Expected earnings:\n\n  AAMC, AENZ, AMCX, AMR, AMRX, AREC, ATNM, AXL, AY, AYRO, BBU, BCH, BEP, BH, BH.A, BRK.A, BRK.B, CGAU, CGC, CKX, CLMT, CNK, CNTY, CQP, CRNX, CRT, CVR, CZNC, D, DKNG, DOC, DSEY, DTM, DXPE, DXYN, EAF, ECOL, ELAN, ENB, ENIC, ENLV, EPZM, ESGR, ESNT, FET, FLR, FTSI, GBL, GBNY, GCI, GLP, GOOS, GRPN, GSAT, GT, GTS, HE, HMC, HMTV, HRC, HSON, INTT, JCI, JCS, KFS, KIM, LFT, LMRK, MBIO, MFA, MGA, MITT, MMI, MODV, MOG.A, MOG.B, MOSY, MTNB, NATH, NEN, NMRK, NOG, NOVN, NPO, NTP, NVIV, NVO, NWLI, NWN, OCGN, OFIX, OFS, ONCY, PAYA, PFSW, PHVS, PLYM, PNW, PVL, RAND, RSLS, SAMG, SBR, SCYX, SII, SRE, SRNE, SSP, SYRS, TELL, TEN, TGS, THM, TILE, TIXT, TKC, TM, TPHS, TRP, TSE, TU, TUSK, UBOH, UFS, UI, UK, VHC, VRS, VST, VTR, VWTR, WRN, WTM, XELA, YORW\n\n - Ex-div:\n\n  AAPL, AB, ALX, AMP, ARTNA, ASRV, BCO, BSBR, CLAR, CLB, CWT, DHF, ENBL, FBIZ, FBK, FHI, FIBK, GLOP, GLP, GWW, HAFC, HBCP, HBT, JHG, LAZ, LPX, MC, MCI, MN, MRLN, MUSA, NATI, NMM, NS, NSEC, OCFC, PCTI, PEAK, PEBO, PETS, RUSHA, RUSHB, RWAY, SCHN, SHEN, SJW, SXI, VNO, WABC, WMK, WVFC, X, XLNX\n\n - Economic events and announcements:\n\n    - Average Hourly Earnings (YoY) (consensus: 4.9%, previous: 4.6%)\n    - Average Hourly Earnings (consensus: 0.4%, previous: 0.6%)\n    - Average Weekly Hours (consensus: 34.8, previous: 34.8)\n    - CFTC Aluminium speculative net positions (previous: 4.2K)\n    - CFTC Copper speculative net positions (previous: 37.3K)\n    - CFTC Corn speculative net positions (previous: 307.8K)\n    - CFTC Crude Oil speculative net positions (previous: 423.7K)\n    - CFTC Gold speculative net positions (previous: 214.6K)\n    - CFTC Nasdaq 100 speculative net positions (previous: -3.3K)\n    - CFTC Natural Gas speculative net positions (previous: -138.2K)\n    - CFTC S&amp;P 500 speculative net positions (previous: 96.5K)\n    - CFTC Silver speculative net positions (previous: 37.5K)\n    - CFTC Soybeans speculative net positions (previous: 43.2K)\n    - CFTC Wheat speculative net positions (previous: 0.8K)\n    - Consumer Credit (consensus: 15.90B, previous: 14.38B)\n    - Government Payrolls (previous: -123.0K)\n    - Manufacturing Payrolls (consensus: 27K, previous: 26K)\n    - Nonfarm Payrolls (consensus: 450K, previous: 194K)\n    - Participation Rate (previous: 61.6%)\n    - Private Nonfarm Payrolls (consensus: 400K, previous: 317K)\n    - U.S. Baker Hughes Oil Rig Count (previous: 443)\n    - U.S. Baker Hughes Total Rig Count (previous: 542)\n    - U6 Unemployment Rate (previous: 8.5%)\n    - Unemployment Rate (consensus: 4.7%, previous: 4.8%)\n\n^^^^2021-11-04",
        "created_utc": 1636020014,
        "id": "hj9i3rw",
        "score": 2,
        "subreddit": "RobinHood",
        "created": 1636048814.0
    },
    {
        "author": "eyerollingsex",
        "body": "Damn these MCHP lotto calls might pay 😤",
        "created_utc": 1636057045,
        "id": "hjbs4fb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1636085845.0
    },
    {
        "author": "jaedubbs",
        "body": "Tesla has insane margins on their EVs and its clear that those margins are growing. The competition needs to sell 3+ EVs for every 1 that Tesla sells. And on top of that, Tesla produces cars in 1/3rd the time. Some OEMs are not profitable at all and each EV sold is a loss.\n\nAlso Tesla has car sales back logged for 6 months!\n\nAnd a simple youtube search of FSD 10.3 shows dozens of reviews and drives of the general public. Meanwhile the competition only reveals company videos of their absolute best drives.\n\nHow about autonomous distribution?\nHow many self driving cars can the competition roll out to with these geofenced cars that need lidar and radar? Compare that to Tesla, which can push an over the air update and sell FSD to millions in an instant.\n\nPeople keep calling Tesla just a car company, but what other car company is the:\n\nMajority part Supplier\nDealership\nFuel provider\nMicrochip maker\nAI developer\nSoftware developer",
        "created_utc": 1635888576,
        "id": "hj2bpld",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1635917376.0
    },
    {
        "author": "eyerollingsex",
        "body": "Buying lottos on MCHP for earnings today \n\nMicrochips so hot rn",
        "created_utc": 1636050067,
        "id": "hjbacmu",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636078867.0
    },
    {
        "author": "AcanthisittaVarious6",
        "body": "MCHP about to be Baby Nividia",
        "created_utc": 1635984705,
        "id": "hj7xyd0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636013505.0
    },
    {
        "author": "NervousTumbleweed",
        "body": "I guess I’m getting a tattoo of a microchip being dipped into a bowl of French onion dip. \n\nI couldn’t be happier about this.",
        "created_utc": 1636033887,
        "id": "hja5eem",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636062687.0
    },
    {
        "author": "AcanthisittaVarious6",
        "body": "Don’t sleep on MCHP dudes!",
        "created_utc": 1636047497,
        "id": "hjb3s9w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1636076297.0
    },
    {
        "author": "spctr13",
        "body": "&gt; in fact im fairly certain all of our parts are manufactured on US soil\n\nDown to what level though? Not many of the basic electronic components everything else is built from are made in the US. American companies like Vishay, Microchip, Texas Instruments, and Xilinx either operate factories in China or contract foundries in China or Taiwan. Other large supplies of ours are not even American such as Yageo and TE Connectivity aren't even headquartered in the US and manufacturer the bulk of their product in their home country. It's been a big issue for my portion of the defense industry the past couple of years because these factories in China are also sourcing a large portion of counterfeit electronic components on the market.\n\nI know we're not the only defense manufacturer using Chinese components because I've seen several news articles and reports from the DOD claiming this is a problem.\n\nhttps://www.washingtontimes.com/news/2020/dec/10/us-military-reliance-china-foreign-suppliers-expos/\n\nPanasonic and Murata (Japanese) used to produce critical components of our products, but have since stopped selling to us because they don't want their products used in munitions. When that happened the government fronted a lot of money to a couple American companies to produce an alternative since none existed.",
        "created_utc": 1635993895,
        "id": "hj8ic9d",
        "score": 0,
        "subreddit": "wallstreetbets",
        "created": 1636022695.0
    },
    {
        "author": "Powerful_Stick_1449",
        "body": "MSFT.... their cloud growth is exponential, they have no anti-trust heat right now, and their gaming segment is making acquisition after acquisition.",
        "created_utc": 1635798955,
        "id": "hixeoo5",
        "score": 1285,
        "subreddit": "stocks",
        "created": 1635827755.0
    },
    {
        "author": "lSoosl",
        "body": "1500 AAPL &amp; 1500 MSFT",
        "created_utc": 1635798193,
        "id": "hixcroo",
        "score": 452,
        "subreddit": "stocks",
        "created": 1635826993.0
    },
    {
        "author": "foxcorp26",
        "body": "1800 MSFt and 1200 AAPL\nBut yes",
        "created_utc": 1635802973,
        "id": "hixofyn",
        "score": 217,
        "subreddit": "stocks",
        "created": 1635831773.0
    },
    {
        "author": "Ozzy4253",
        "body": "Bill Gates would be worth $1.2 trillion if he still had his Microsoft shares.\n\nInstead, he became best friends with Warren Buffett and decided to diversify his portfolio.\n\nHe is worth only $136 billion today.\n\nDiversification is for pussies.",
        "created_utc": 1635971117,
        "id": "hj7126u",
        "score": 183,
        "subreddit": "wallstreetbets",
        "created": 1635999917.0
    },
    {
        "author": "QuantityAccording750",
        "body": "Msft. Their price increase will be taking effect shortly",
        "created_utc": 1635799546,
        "id": "hixg5g9",
        "score": 175,
        "subreddit": "stocks",
        "created": 1635828346.0
    },
    {
        "author": "ffsudjat",
        "body": "MSFT will definitely go up; or down, or sideway.",
        "created_utc": 1635789495,
        "id": "hiwrfe1",
        "score": 159,
        "subreddit": "investing",
        "created": 1635818295.0
    },
    {
        "author": "high_roller_dude",
        "body": "growth stocks. esp mid cap tech, before they moon. \n\nFeb of 2020, my account was at $300k at the peak. then covid happened and things went to hell in March 2020. at the trough my account dipped to $200k.\n\nas of today my account is north of $900k. how did i get there? mix of mega cap (msft) and a basket of mid cap tech (net, crwd, se, mdb, etc)\n\nalways be on the look out for promising young companies whose market cap is less than $20B. barbell that with some safe assets like msft. \n\nembrace risk, and learn to live with volatility. that is what i can tell you. good luck",
        "created_utc": 1635815916,
        "id": "hiyhs1v",
        "score": 143,
        "subreddit": "stocks",
        "created": 1635844716.0
    },
    {
        "author": "babydragon89",
        "body": "both AAPL and MSFT.\n\nAAPL f*cks up all other ad platforms from ios 14 and now their ad revenue increase by 3x. \n\nMSFT is just a beast, just steadily increasing..",
        "created_utc": 1635803097,
        "id": "hixoqgx",
        "score": 117,
        "subreddit": "stocks",
        "created": 1635831897.0
    },
    {
        "author": "ThePartyLeader",
        "body": "AAPL for shorter investment. They are making good use of design updates and Apple silicon should continue to be good IMO.\n\nMSFT for long long hold. They have the best diversity of projects and I think therefore the best growth opportunity.\n\nFB will benefit from Meta brand short term but there company seems to be imploding at times so I just wouldn't personally.",
        "created_utc": 1635797899,
        "id": "hixc0sj",
        "score": 105,
        "subreddit": "stocks",
        "created": 1635826699.0
    },
    {
        "author": "ProteinEngineer",
        "body": "A bit ridiculous to think Apple is specifically targeting Facebook as opposed to all third party apps. \n\nI do think the metaverse concept seems like a terrible video game and Facebook is much more vulnerable to competitors than Amazon, Microsoft, google, and Apple.",
        "created_utc": 1635804256,
        "id": "hixrhai",
        "score": 89,
        "subreddit": "SecurityAnalysis",
        "created": 1635833056.0
    },
    {
        "author": "xAragon_",
        "body": "3000 MSFT and 0 AAPL but yes",
        "created_utc": 1635806931,
        "id": "hixxmae",
        "score": 71,
        "subreddit": "stocks",
        "created": 1635835731.0
    },
    {
        "author": "Mysterious----",
        "body": "Best part is you can’t say market isn’t built on only speculation when MSFT quarterly growth in EPS Was less than 4% but it’s share price is up 17% quarter over quarter and its revenue is down. It’s all cash injected growth from the fed pumping market prices. Inflation hasn’t even hit Main Street. Wait until the 2.5x leveraged markets deleverage and the money hits. Add on the great resignation and worker shortages which will eat into corporations margins, supply chain issues, and the housing market crisis slowly unfolding. There is no way the SPY doesn’t hit $500 EOY.",
        "created_utc": 1635921358,
        "id": "hj4a0ru",
        "score": 68,
        "subreddit": "wallstreetbets",
        "created": 1635950158.0
    },
    {
        "author": "Washedup11",
        "body": "Apple. Google. Microsoft.\n\nThey out budget everyone in R&amp;D. If a smaller company has some innovation they (AAPL, GOOG, MSFT) value - they often acquire them.\n\nThey’ll continue to dominate every in computers, phones, software, wearables, head phones, chrome books (schools won’t STOP giving students chromebooks), etc.",
        "created_utc": 1635993555,
        "id": "hj8hn82",
        "score": 47,
        "subreddit": "stocks",
        "created": 1636022355.0
    },
    {
        "author": "slimkay",
        "body": "MSFT is more diversified than either FB or AAPL and is also more antitrust proof than them.\n\nNo brainer if you ask me...",
        "created_utc": 1635798064,
        "id": "hixcfv7",
        "score": 46,
        "subreddit": "stocks",
        "created": 1635826864.0
    },
    {
        "author": "masterfox72",
        "body": "I had this internal debate last year. I picked 100% AAPL. MSFT ended up better 😢",
        "created_utc": 1635813133,
        "id": "hiyblzd",
        "score": 46,
        "subreddit": "stocks",
        "created": 1635841933.0
    },
    {
        "author": "MustNotFapBruh",
        "body": "I love Microsoft and all my homies love Microsoft.",
        "created_utc": 1635806334,
        "id": "hixw9de",
        "score": 46,
        "subreddit": "stocks",
        "created": 1635835134.0
    },
    {
        "author": "holding-light",
        "body": "So when Tesla is a 5-10 T market cap company what will google, Microsoft, apple, and Amazon be at?",
        "created_utc": 1635809691,
        "id": "hiy3vl8",
        "score": 30,
        "subreddit": "stocks",
        "created": 1635838491.0
    },
    {
        "author": "ProteinEngineer",
        "body": "I have never had a VR experience that I think would increase work efficiency.  I think Zuckerberg is so far removed from what it's like working an actual job or living a normal life that he thinks it's a good idea.\n\nIn terms of facebook/instagram: It seems like every 5-10 years, a new app comes around that replaces the previously popular one.  Instagram is being replaced by Tik Tok with younger users. Nobody young wants to be on facebook anymore now that it's filled with geriatrics, so FB is much more instagram heavy than in the past for younger users, and reliant on some really politically controversial groups to extract money out of facebook. Yes, they currently have a stranglehold on social media advertising, but I think their \"moat\"  is nonexistent compared to companies like Amazon, Apple,  Google, and Microsoft. Apple, Amazon, and Google especially-those are three exceptionally innovative companies compared to FB.",
        "created_utc": 1635818595,
        "id": "hiynp75",
        "score": 29,
        "subreddit": "SecurityAnalysis",
        "created": 1635847395.0
    },
    {
        "author": "TheCivilian1",
        "body": "$2500 on MSFT and $500 on AAPL - none on shitty Facebook",
        "created_utc": 1635802207,
        "id": "hixml3a",
        "score": 29,
        "subreddit": "stocks",
        "created": 1635831007.0
    },
    {
        "author": "isospeedrix",
        "body": "Might have to quit playing earnings for good. I didn’t realize it was even possible to be this unlucky.\n\nApple calls- fail.\n\nFb calls- fail.\n\nMsft puts- fail.\n\nAmzn calls- fail.\n\nCar puts- fail.\n\nAtvi calls- fail.\n\nThe last time I was this bad was 2018 where I went 1/6 in one season. This is 0/6. Fuk this gay earth.",
        "created_utc": 1635893468,
        "id": "hj2o1cw",
        "score": 27,
        "subreddit": "wallstreetbets",
        "created": 1635922268.0
    },
    {
        "author": "Shift_Tex",
        "body": "MSFT. First stock I ever bought and been holding and adding for years now. It's never let me down and the growth is still accelerating even though it's the most valuable company in the world.",
        "created_utc": 1635809315,
        "id": "hiy312s",
        "score": 26,
        "subreddit": "stocks",
        "created": 1635838115.0
    },
    {
        "author": "Vulgar-Captain",
        "body": "I so far has picked ETFs that are both steady and growth-oriented, for example, VTI, VXUS, SCHD, QQQM. Additionally, I have a few mega and a number of risky ones. \n\nI was wondering if it makes sense to adjust them and say dump a large sum in MSFT or other stocks that grow reasonably well with good dividends. Or should I consider buy into REITs to further diversify.",
        "created_utc": 1635817888,
        "id": "hiym5ax",
        "score": 25,
        "subreddit": "stocks",
        "created": 1635846688.0
    },
    {
        "author": "mchlsxjkbsn",
        "body": "Microsoft, Apple, Tesla, Google to name a few safe bets..",
        "created_utc": 1635789242,
        "id": "hiwqt1e",
        "score": 24,
        "subreddit": "investing",
        "created": 1635818042.0
    },
    {
        "author": "Going_Live",
        "body": "&gt;Facebook (now Meta), Apple, Amazon, Alphabet, Microsoft\n\nSo now it's Maaam?\n\n*\\*tips fedora\\**",
        "created_utc": 1635795407,
        "id": "hix5ty8",
        "score": 22,
        "subreddit": "investing",
        "created": 1635824207.0
    },
    {
        "author": "Oringi200",
        "body": "Probably Microsoft, bright future, dividends, stable and growing stock. And new stuff coming out",
        "created_utc": 1635951342,
        "id": "hj5l7es",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635980142.0
    },
    {
        "author": "walkenoverhere",
        "body": "?? MSFT is up 62%, AAPL 37%",
        "created_utc": 1635813940,
        "id": "hiydf1w",
        "score": 22,
        "subreddit": "stocks",
        "created": 1635842740.0
    },
    {
        "author": "deevee12",
        "body": "Microsoft, Facebook, Apple, Google. Long ago, the four metaverses lived together in harmony. Then everything changed when the Appleverse attacked…",
        "created_utc": 1635961171,
        "id": "hj6b3a3",
        "score": 21,
        "subreddit": "stocks",
        "created": 1635989971.0
    },
    {
        "author": "tallpaulpaultall",
        "body": "$PYPL 11/19 $335c x 2\n$MSFT 11/19 $330c x 2\n$NKE 12/17 $170c x 2\n$SNAP 1/22 $55c x 5\n$TGT 12/17 $270c x 2\n\nMy positions. Since I think we used to post those here.",
        "created_utc": 1635855270,
        "id": "hj03c89",
        "score": 20,
        "subreddit": "wallstreetbets",
        "created": 1635884070.0
    },
    {
        "author": "Megatron_overlord",
        "body": "Some kids in the comments are seriously deluded. A quick reality check: ATVI is one of the top gaming companies in the world, only behind Sony, Microsoft, Tencent and Nintendo, way ahead of EA, Epic, and Take Two in terms of revenue.  Their \"dead games\" generated  8 billion USD in 2020 (God of War sales: 500m, for comparison).",
        "created_utc": 1635960677,
        "id": "hj69shc",
        "score": 20,
        "subreddit": "StockMarket",
        "created": 1635989477.0
    },
    {
        "author": "henkgaming",
        "body": "Hate to break it to ya but Microsoft is 2.47T market cap",
        "created_utc": 1635799915,
        "id": "hixh1y2",
        "score": 19,
        "subreddit": "stocks",
        "created": 1635828715.0
    },
    {
        "author": "discountcouscous",
        "body": "MSFT up 18% past month, Suncor 20%, TSLA 50%, Cloudflare 66%, NVIDA/Ford/AMD 25% lots of big caps and lots of diversity too.",
        "created_utc": 1635914154,
        "id": "hj3zdv4",
        "score": 18,
        "subreddit": "CanadianInvestor",
        "created": 1635942954.0
    },
    {
        "author": "peregruzka",
        "body": "This isn’t logic, it is a rant. Posts like these make me bullish on $FB. They have an entire generation of data and have integrated people and businesses and commerce into their platforms. To think they won’t grow,  I’m not convinced.\n\nThat being said, put it on $MSFT. Diverse products and continued momentum on the stock. $AAPL has slowed since the split, but is a great choice. \n\nConsider $GOOGL. YouTube generates more revenue than Netflix itself.",
        "created_utc": 1635824167,
        "id": "hiyz154",
        "score": 16,
        "subreddit": "stocks",
        "created": 1635852967.0
    },
    {
        "author": "MustNotFapBruh",
        "body": "Thanks man. That’s great news for long term MSFT holders like us!",
        "created_utc": 1635807643,
        "id": "hixz94n",
        "score": 16,
        "subreddit": "stocks",
        "created": 1635836443.0
    },
    {
        "author": "tall_investor",
        "body": "Interesting.\n\nI'm sure people thought Microsoft was impervious to competitors as well and along came Apple.\n\nFacebook owns social media. While this does make it subject to the whims of the hardware it is run on, and you bet monopolistic companies like Apple want to eventually get into that sphere, FB still has a monopoly on what we use our devices for.\n\nI swear, we live not in the apple, Microsoft, or amazon age... but the Instagram age.\n\nRecently I have come around with regards to the metaverse - I think it is the terrifying step towards us living in VR as all the future dystopian movies showed us. I really could see us working and logging into a meta verse to allow WFH while still having more supervision than we currently have.\n\nAlso, agreed. Thought it was ridiculous when the author said they changed their name to metaverse to distract from the bad press... You seriously think they'd change their name to an even scarier name and that that would distract the press? You think they would make such an enormous decision in a matter of weeks or months?",
        "created_utc": 1635816012,
        "id": "hiyhzrk",
        "score": 16,
        "subreddit": "SecurityAnalysis",
        "created": 1635844812.0
    },
    {
        "author": "PleezHireMe",
        "body": "AAPL or msft",
        "created_utc": 1635798322,
        "id": "hixd3g5",
        "score": 15,
        "subreddit": "stocks",
        "created": 1635827122.0
    },
    {
        "author": "Diesel-doc82",
        "body": "AAPL or Microsoft. Buy both.",
        "created_utc": 1635800206,
        "id": "hixhrql",
        "score": 14,
        "subreddit": "stocks",
        "created": 1635829006.0
    },
    {
        "author": "hsjdkdkd",
        "body": "Tesla 10 trillion market cap? More valuable than apple, amazon and Microsoft combined. Seems likely",
        "created_utc": 1635928554,
        "id": "hj4if8m",
        "score": 14,
        "subreddit": "stocks",
        "created": 1635957354.0
    },
    {
        "author": "acegarrettjuan",
        "body": "MSFT",
        "created_utc": 1635803261,
        "id": "hixp4bz",
        "score": 14,
        "subreddit": "stocks",
        "created": 1635832061.0
    },
    {
        "author": "gjob1",
        "body": "Someone gotta do it. 3000 AAPL and 0 MSFT",
        "created_utc": 1635810933,
        "id": "hiy6o49",
        "score": 14,
        "subreddit": "stocks",
        "created": 1635839733.0
    },
    {
        "author": "Glad-Marionberry-634",
        "body": "Finally someone advising to buy actually strong companies. Personally I hold msft (best investment yet) and Intel. Baba will probably come back so I don't blame anyone for buying/holding it, I just don't. Everyone else in this thread is advising to buy more meme stocks, id say take any profits you've made and walk away, eventually people will need their money that's tied up in those and you don't want to be a bag holder. MSFT is probably the safest and most solid tech company right now with the best credit, and tons of cash, etc, etc basically hard to find weak spots. If this person really wants serious advice I'd say count your blessings and get out of the meme stocks and into lower risk, maybe some etfs. There are a lot of sectors that were ignored that are poised to do well. If you really want individual stocks maybe NOK or RYAAY. Those are in a similar risk/reward range to their current portfolio but with a little more stability.",
        "created_utc": 1635950359,
        "id": "hj5iq4j",
        "score": 13,
        "subreddit": "StockMarket",
        "created": 1635979159.0
    },
    {
        "author": "AltPossum",
        "body": "Sold my MSFT 330s yesterday morning for way too cheap. \n\nWent all in on TSLA weeklies around 1187.\n\nWhy do I only do exactly the wrong thing, all the time?",
        "created_utc": 1635936841,
        "id": "hj4sd33",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1635965641.0
    },
    {
        "author": "firstinitallastname",
        "body": "Anybody remember MSFT 220c ex. 3/20/20 and how many people got fucking burned?  Those were the days",
        "created_utc": 1635976792,
        "id": "hj7flws",
        "score": 13,
        "subreddit": "wallstreetbets",
        "created": 1636005592.0
    },
    {
        "author": "jumboblueberry",
        "body": "Facebook (now Meta), Apple, Amazon, Alphabet, Microsoft / Baidu, Alibaba, Tencent",
        "created_utc": 1635791783,
        "id": "hiwwz9i",
        "score": 12,
        "subreddit": "investing",
        "created": 1635820583.0
    },
    {
        "author": "iamnotbutiknowIAM",
        "body": "MSFT, INTL, BABA",
        "created_utc": 1635943600,
        "id": "hj53m1p",
        "score": 12,
        "subreddit": "StockMarket",
        "created": 1635972400.0
    },
    {
        "author": "throwwayhubu",
        "body": "CRSR wasnt listed back when Cathy Woods et al hatched their revenue- and profit-averse plan to pump every speculative dumpsterfire of a stock that could present a way to give goods and services for free or at a loss to its users. In the short term, if CRSR wants to improve its share price, they need to dump their cash cows on an established firm like MSFT and launch a crypto-based multi-level marketing scheme that promises to end climate change and require a vaccine pass.  \n  \n In the long term, CRSR is looking like one of the juicier fundamental plays in the markets, they are riding a strong macro trend in gaming and media, streamers have essentially replaced TV for people 6-20 years of age and gaming is probably the most common hobby of that generation and tends to be kept up over the years. The only future headwind I see is continued expansion and innovation in their product lines, their position in components like memory would ideally be follow up with stronger positions in other peripherals and potentially software.",
        "created_utc": 1635893260,
        "id": "hj2nj8t",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635922060.0
    },
    {
        "author": "b0z0fr34k",
        "body": "DGNS news: Cvent now integrated with Microsoft Teams --https://twitter.com/kingtutspacs/status/1455609888684523523",
        "created_utc": 1635880518,
        "id": "hj1qoqj",
        "score": 12,
        "subreddit": "SPACs",
        "created": 1635909318.0
    },
    {
        "author": "ybnesman",
        "body": "MSFT to $400 seems to be otw",
        "created_utc": 1635766811,
        "id": "hivg360",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635795611.0
    },
    {
        "author": "MvCSpiderman",
        "body": "People don't get why Tesla is going up because they have no idea how the market works or what to look at.\n\n$TSLA is up due to retailer mass consolidation. Ten(well now 9) stocks are basically pushing the three major indexes as people spend the last two years tired of figuring out charts, being burned by earnings and memes, and the recent higher prices for goods which give them less to spend.\n\nTesla is one of those 9 stocks. That's it.\n\nIn fact at this point 60% of retail are in these 9 stocks. All it takes is to manipulate one of them by a decent amount and the whole thing crumbles.\n\nPeople are stubborn and make themselves believe they are causing the upward trends in the etfs or Tesla when they aren't. Tesla can drop to $400 in a couple days if institutions wanted it to. Many are already diversifying outside the most popular stocks the last two years (with some exceptions like MSFT).\n\nKeep an eye on institutions during the FED meeting the next two days, you are going to see gradual movements to make it not seem obvious that they are preparing to take advantage of the dive.\n\nIf you are in Tesla now and over $100k+ in profits then take it out. Don't hold at this point. There isn't time to correct after the FED meeting as you will likely be priced out. Puts will be much more expensive in the next couple weeks for high value stocks.",
        "created_utc": 1635810979,
        "id": "hiy6rrk",
        "score": 12,
        "subreddit": "wallstreetbets",
        "created": 1635839779.0
    },
    {
        "author": "weaponized_teletubby",
        "body": "I should have quit while I was ahead. This morning I cashed out Microsoft calls and said I was done. This was a lie. I then partook in some vigorous investing of capital and was subsequently ripped a new anal orifice ![img](emote|t5_2th52|4271)",
        "created_utc": 1635877206,
        "id": "hj1i2qw",
        "score": 11,
        "subreddit": "wallstreetbets",
        "created": 1635906006.0
    },
    {
        "author": "FistEnergy",
        "body": "Microsoft just announced Cvent integration into Teams in 2022. $DGNS 🙏\n\nhttps://twitter.com/spacanpanman/status/1455615787343953925?t=FHlU1VXY5tZDWPUwO3glpA&amp;s=19",
        "created_utc": 1635881198,
        "id": "hj1sfci",
        "score": 11,
        "subreddit": "SPACs",
        "created": 1635909998.0
    },
    {
        "author": "TheGeoninja",
        "body": "So FB is going full meta and Microsoft has stated their intentions of creating their own version. What stops Apple from demolishing both metaverses with there own in two to five years?\n\nSo many people already live with Apple’s “walled-garden” so the needle doesn’t need to be pushed very far.",
        "created_utc": 1635960010,
        "id": "hj680gt",
        "score": 11,
        "subreddit": "stocks",
        "created": 1635988810.0
    },
    {
        "author": "TheNewOP",
        "body": "You're expecting a rebound. That may not happen, the 2020 crash rebound is not a rule. There are plenty of stocks that trade sideways for 5 years, and the tickers you named are not immune to that. The market was basically trading sideways from 2000-2013. Microsoft traded sideways for 10 years. Your LEAPS would've either expired worthless or you would've been bled by theta. But if you bought shares all of those years, you would've had a ~13 bagger. Meanwhile your LEAPS in total would be down by God knows how much. Options are a form of market timing and risky, and that includes LEAPS, a year is nothing if compared to buying and holding.",
        "created_utc": 1635976308,
        "id": "hj7ee3j",
        "score": 11,
        "subreddit": "investing",
        "created": 1636005108.0
    },
    {
        "author": "Dark_Tranquility",
        "body": "MSFT",
        "created_utc": 1635870396,
        "id": "hj10x19",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635899196.0
    },
    {
        "author": "Shamamble",
        "body": "Wtf I made over 5k this month just holding Msft shares, you assholes told me that investing like a boomer wouldn’t make me any money",
        "created_utc": 1635873652,
        "id": "hj193ap",
        "score": 10,
        "subreddit": "wallstreetbets",
        "created": 1635902452.0
    },
    {
        "author": "willthewarlock23",
        "body": "Xbox pass works on mobile if you have a strong enough phone to handle the games. Which shows Microsoft is really going down the software route rather then hardware.",
        "created_utc": 1635826875,
        "id": "hiz3n6h",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635855675.0
    },
    {
        "author": "courseman5",
        "body": "I own: NVDA, MSFT, AMD, so far Nvidia is my favourite and most profitable",
        "created_utc": 1635961158,
        "id": "hj6b211",
        "score": 10,
        "subreddit": "stocks",
        "created": 1635989958.0
    },
    {
        "author": "Alcapwn-",
        "body": "It’s not rocket science, but trying to get rich quick tends not to end well unless you’re lucky or are given extremely good advice from people who know the tricks of the trade. \n\nI’m a rank amateur at this game. I have three kids, aged 14, 12, &amp; 10. About 7 years ago they were each given 10k from their grandpa to open an investment account. I opened an account for each them here in Australia trading on the ASX. I’ve only purchased blue chip shares that pay 4-10% returns year in year out, and all those dividends are reinvested back in to those stocks when issued. Each birthday I give them $1000 to add to their portfolios, and $1000 each at Xmas. The eldest two are sitting on almost 75k each, and the youngest is just under 70k. \n\nBy the time they’re 21 and have access to their accounts, they should have around 150k perhaps more if the bank of mum and dad don’t raid it🤣. It gives them a leg up to start their lives. They’re not allow to blow it on cars etc, they can use a bit for travel, but I’m hoping it can get them in to the property market and or keep the portfolio going until they’re much older. They’ve had one really lucky break with one share which has doubled and makes up good slice of their portfolio and pays big dividends each year. That aside it’s been pretty basic investments. If it was the US market it would stocks like MSFT, CRM, TSLA, AAPL that I’ve tipped money in to. So relatively low risk and just playing the long game and I’ve not sold a single share in that time. \n\nChrist I wished my parents had done a similar thing for me and my sisters when I was young.",
        "created_utc": 1635849297,
        "id": "hizumy7",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635878097.0
    },
    {
        "author": "gabugabuchan",
        "body": "Great product with potential, trash management.\n\nSome people might disagree with me on the great product part, because they think it's just an art board. But there's more to it, it's a mommy-dominated social media platform and it's the 14th largest in the world at that, with 454 million monthly active users. The user base is there, the influence is there, the potential is definitely there. There's a reason why Microsoft was willing to pay a premium of roughly 86 per share to acquire the company.\n\nWhich leads us to why the stock is falling, they didn't get acquired, which means that they believe they can grow it better than the 86 per share valuation, but then in a span of less than a year, the management managed (pardon the pun) to drive the stock price down to half or less than half of what Microsoft originally offered due to their management.\n\nWith the reason you mentioned, bad guidance attributed to covid reopening, and the disappointing earning reports over the last 2 quarters. I wouldn't be touching this stock anywhere at this price.",
        "created_utc": 1635943983,
        "id": "hj54cxi",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635972783.0
    },
    {
        "author": "DickDowning",
        "body": "MSFT.  No supply chain issues and doest have an A$$whole CEO like Zucker",
        "created_utc": 1635810386,
        "id": "hiy5fw0",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635839186.0
    },
    {
        "author": "deniz2306",
        "body": "People don't see PayPal and Pinterest fitting together, and that's the problem. It's like Microsoft buying up a brick and mortar business. It can sometimes go well, like when Amazon bought Whole Foods, but it's understandable that people a skeptical.",
        "created_utc": 1635816969,
        "id": "hiyk3em",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635845769.0
    },
    {
        "author": "the_GuelahPapyrus",
        "body": "AMZN, GOOG, MSFT, AAPL all red today\n\nQQQ new ATH\n\nTSLA gonna carry us into the future as nature intended",
        "created_utc": 1635815455,
        "id": "hiygrgq",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635844255.0
    },
    {
        "author": "NaNoBoT900",
        "body": "AMZN and MSFT calls and hedged with weekly spy put. \n\nYes I’m staring at TSLA everyday and not buying in.",
        "created_utc": 1635815723,
        "id": "hiyhclr",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1635844523.0
    },
    {
        "author": "Spiritual_Extreme_81",
        "body": "MARA, HUT, Googl, AMZN, MSFT, AMD, SQ, IWM \n\nI’m long with this tomorrow am I fucked?",
        "created_utc": 1635973987,
        "id": "hj78jo7",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1636002787.0
    },
    {
        "author": "arbuge00",
        "body": "&gt;I'm sure people thought Microsoft was impervious to competitors as well and along came Apple.\n\nYour definition of impervious is different than mine. I see that along came Apple and Microsoft is still doing just fine, which makes it impervious in my book.",
        "created_utc": 1635851374,
        "id": "hizxd6g",
        "score": 9,
        "subreddit": "SecurityAnalysis",
        "created": 1635880174.0
    },
    {
        "author": "PM_ME_DANK",
        "body": "Oh I know, commented that mostly in jest. But $FB is my 3rd highest conviction stock and most of the responses in this thread are leaning MSFT with second being $AAPL so I'm anticipating downvotes which will add some drops to my $FB conviction bucket",
        "created_utc": 1635818378,
        "id": "hiyn8aw",
        "score": 9,
        "subreddit": "stocks",
        "created": 1635847178.0
    },
    {
        "author": "tmoney_99",
        "body": "Someone poke MSFT with a stick",
        "created_utc": 1635776589,
        "id": "hivxivx",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635805389.0
    },
    {
        "author": "Captain_Yolo_",
        "body": "Where did all the money to go into TSLA today even come from?\n\n*(glances at AMZN, AAPL, and MSFT)*\n\nOh.",
        "created_utc": 1635787826,
        "id": "hiwncl8",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635816626.0
    },
    {
        "author": "BonBelafonte",
        "body": "AAPL makes as much on games as Sony, MSFT, Nintendo and Activision. COMBINED 😂😂",
        "created_utc": 1635935187,
        "id": "hj4q2ve",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635963987.0
    },
    {
        "author": "Lewodyn",
        "body": "If you believe Microsoft is going to beat the market by a significant amount, then buy microsoft otherwise go with a broad market fund. I am not talking about the company, but about the stock. Microsoft stock has a significant premium. \n\nFor most ppl, especially beginners, a passive strategy is advised. Set and forget. You don't need a lot of knowledge to passively invest; just buy every month and trust that the market will go up in the longterm, like it has in the past. \n\nWhen buying a fund, two things are vital. The holdings and the costs. Make sure that the cost is below 0.3%, there are some funds below 0.1%. Plus make sure that the holdings contains a lot of stocks from different sectors with a good spread (e.g. not 80% is in tesla). Plus you could also diversify with including different regions. You might want to consider an all world fund, like vt.",
        "created_utc": 1635955151,
        "id": "hj5v2wq",
        "score": 8,
        "subreddit": "stocks",
        "created": 1635983951.0
    },
    {
        "author": "xflashbackxbrd",
        "body": "Microsoft did the same song and dance once upon a time, for a bigger price tag too.",
        "created_utc": 1635816513,
        "id": "hiyj357",
        "score": 8,
        "subreddit": "stocks",
        "created": 1635845313.0
    },
    {
        "author": "beefandfoot",
        "body": "I bought msft at mid 20's a few years ago. I set a sell order to sell half when it goes up double. I forgot about it and found out the hard way. Anyway, my other half has gone up 15 times. I really can't complain.",
        "created_utc": 1635907605,
        "id": "hj3lwgo",
        "score": 8,
        "subreddit": "CanadianInvestor",
        "created": 1635936405.0
    },
    {
        "author": "BOBI_2206",
        "body": "Lol TSLA. Loving this we will surpass Apple and Microsoft by end of year",
        "created_utc": 1635783486,
        "id": "hiwczx1",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635812286.0
    },
    {
        "author": "humblepharmer",
        "body": "MSFT",
        "created_utc": 1635808112,
        "id": "hiy0bpm",
        "score": 8,
        "subreddit": "stocks",
        "created": 1635836912.0
    },
    {
        "author": "SolitaireyEgg",
        "body": "Apple, msft, Google, Tesla all slightly down AH\n\nRoku fell off a cliff on earnings AH\n\nQQQ up AH\n\nYou can't explain that",
        "created_utc": 1635974730,
        "id": "hj7af7u",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636003530.0
    },
    {
        "author": "weaponized_teletubby",
        "body": "MSFT you dirty whore. You’re supposed to 🚀 not limp dick and flip like a dead fish.",
        "created_utc": 1635779067,
        "id": "hiw2zkc",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1635807867.0
    },
    {
        "author": "ImNoAlbertFeinstein",
        "body": "ah, msft 220c's ...  like it was yesterday",
        "created_utc": 1635976939,
        "id": "hj7fyv0",
        "score": 8,
        "subreddit": "wallstreetbets",
        "created": 1636005739.0
    },
    {
        "author": "maz-o",
        "body": "1% down from ATH is not a sizeable dip.\n\nThat said MSFT is always a good buy.",
        "created_utc": 1635781857,
        "id": "hiw99kt",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635810657.0
    },
    {
        "author": "imlostandneedanadult",
        "body": "I agree with you but do you think a name change is enough to fix the opinion the general public has? I personally don't think the company can be successful without removing Zuck as the face of the brand. He's obviously a necessary part of the business but no one trusts him and when companies like Microsoft, Apple and Amazon all join the space with their version of the Metaverse, my opinion is that those brands will be selected over Meta based on public perception of trust and integrity.",
        "created_utc": 1635976920,
        "id": "hj7fx5w",
        "score": 7,
        "subreddit": "stocks",
        "created": 1636005720.0
    },
    {
        "author": "dcahill78",
        "body": "You are totally correct on In 2 ways I’m living in Ireland so 1.16 million dollars would make me a millionaire here. Also our version of the IRS is just called Revenue, no tax on the unsold Tesla shares. Hobby trading options call could be 33% or if what I’ve done in 2 years is looked at as professional really all my realised gains this year get taxed at 41%. \n\nProblem is our revenue don’t have clear cut rules, as in x trades per year or gains over x amount is income vs CGT. I would totally like to have a simple balanced account my next purchase is probably 100k of Microsoft, BRKb, Amazon and Apple but I wouldn’t let go of of a single Tesla share, they mean to much to me now.",
        "created_utc": 1635833349,
        "id": "hizcp12",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635862149.0
    },
    {
        "author": "captain_americano",
        "body": "Did MSFT, APPL and GOOG say a really bad swear?",
        "created_utc": 1635774715,
        "id": "hivtlwa",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635803515.0
    },
    {
        "author": "braamdepace",
        "body": "I think Peter Thiel said something like why have a 1% chance to make 100x when you can have a 99% chance to make 4x…. \n\nGaming will be big for sure, but I doubt SLGG does jack… you think Amazon gaming, Microsoft or others are gonna roll over",
        "created_utc": 1635857978,
        "id": "hj08agu",
        "score": 7,
        "subreddit": "investing",
        "created": 1635886778.0
    },
    {
        "author": "Webwonder325",
        "body": "I have kind of a large spread of things. I'm holding shares if Microsoft and Apple. I have some holdings in catapillar and Walmart. My account is set up in a way where I get a small dividend payment each week.",
        "created_utc": 1635867452,
        "id": "hj0tpf2",
        "score": 7,
        "subreddit": "options",
        "created": 1635896252.0
    },
    {
        "author": "mishka__",
        "body": "CNBC: In a stunning market day Avis Budget Rental Cars overtakes Microsoft as the world’s most valuable company.",
        "created_utc": 1635864787,
        "id": "hj0nbqh",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635893587.0
    },
    {
        "author": "mtherndo",
        "body": "lol Microsoft is up 51% YTD, 63% over the past year, and up 461% over the past 5 years",
        "created_utc": 1635803455,
        "id": "hixpky9",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635832255.0
    },
    {
        "author": "atdharris",
        "body": "Target has no expertise in running a social media company. Microsoft would make the most sense since they already own Linkedin, but PINS reportedly turned down an $86/share offer. Paypal makes sense because they can build out some sort of e-commerce platform through PINS and already deal in fintech. \n\n\nBut right now, it looks like PINS is going to remain an independent company.",
        "created_utc": 1635801567,
        "id": "hixl1cl",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635830367.0
    },
    {
        "author": "fantomdelucifer",
        "body": "31 years old, investing from Japan. I played it slow and safe because bank saving here is literally at 0.001% rate\n\n13.5% AAPL\n\n5% V\n\n22% AMZN\n\n5% AXP\n\n7.2% ADBE\n\n3% AMD\n\n4% COST\n\n15% NVDA\n\n10% PLTR\n\n1.2% BMBL\n\n0.5% OTLY ( Used to be 6% but I cut the loss)\n\n10% MSFT\n\n6% GOOGL",
        "created_utc": 1635953877,
        "id": "hj5rox2",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635982677.0
    },
    {
        "author": "ybnesman",
        "body": "MSFT 2-18 390 calls might be my move",
        "created_utc": 1635767589,
        "id": "hivh7ux",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635796389.0
    },
    {
        "author": "JMLobo83",
        "body": "P/E around 92, AMD and MSFT also high but much lower, NVDA is nosebleed section high.  If you're concerned at all about inflation 92 is too high.  Even ASML is quite a bit lower.",
        "created_utc": 1635809627,
        "id": "hiy3qcs",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635838427.0
    },
    {
        "author": "KGisTop15All_Time",
        "body": "Fuck working class families. Middle schoolers with 3 Microsoft shares need to make money too.",
        "created_utc": 1635967526,
        "id": "hj6rqt5",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635996326.0
    },
    {
        "author": "manitowoc2250",
        "body": "Ive personally started selling my individual stocks and just buying an sp index etf. You'll own Microsoft in it anyways",
        "created_utc": 1635954968,
        "id": "hj5ulj4",
        "score": 7,
        "subreddit": "stocks",
        "created": 1635983768.0
    },
    {
        "author": "bifburger",
        "body": "Don't take this the wrong way but Puts on MSFT?\n\nReally?",
        "created_utc": 1635893673,
        "id": "hj2ojcd",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635922473.0
    },
    {
        "author": "Shreeder",
        "body": "MSFT eow",
        "created_utc": 1635951043,
        "id": "hj5kg9k",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1635979843.0
    },
    {
        "author": "yeppersbruh",
        "body": "A deal that is worth about $5B is announced, not even signed yet.\n\n&gt;Market Cap increases by about $300B\n\nCEO makes sure to tell people the deal isn't even signed yet, additionally 12.000 cars are getting recalled\n\n&gt;Market Cap decreases by about $40B pre market\n\nThis is an absolute joke. What the fuck is going on? Tesla seems to be the OG Meme stock. This is absolutely insane and not rationally justifiable. Tesla isn't worth half of Microsoft and Apple. It just isn't. At least not today, at least not on a risk adjusted basis. I'm just speechless at this point.",
        "created_utc": 1635859241,
        "id": "hj0auff",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635888041.0
    },
    {
        "author": "whatthehicks",
        "body": "AAPL 8.01%\n\nIWP 7.96%\n\nFQAL 7.78%\n\nTDV 7.28%\n\nGPI 7.11%\n\nCOST 6.63%\n\nVEU 6.43%\n\nGLAD 6.37%\n\nVHT 6.11%\n\nTWO 5.04%\n\nVIG 5.21%\n\nMSFT 4.73%\n\nMCO 4.38%\n\nVTI 4.33%\n\nGWRS 4.23%\n\nSCHD 4.21%\n\nDAL 4.19%",
        "created_utc": 1635818822,
        "id": "hiyo6zz",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635847622.0
    },
    {
        "author": "rFFModsHaveTheBigGay",
        "body": "Microsoft is in it now. New acronym is FAGMAN",
        "created_utc": 1635790093,
        "id": "hiwsvfl",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635818893.0
    },
    {
        "author": "thatguy425",
        "body": "And MSFT is a tech company and stays in their lane. GE makes jet engines and home appliances. I don’t see MSFT venturing into other domains outside of what they know.",
        "created_utc": 1635859562,
        "id": "hj0bidt",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635888362.0
    },
    {
        "author": "Snoo_96430",
        "body": "Well TSLA trade broke googl,Apple,AMZN,SPY and  MSFT thanks for that.",
        "created_utc": 1635788711,
        "id": "hiwpigz",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635817511.0
    },
    {
        "author": "Dakidmen",
        "body": "Microsoft all day",
        "created_utc": 1635810155,
        "id": "hiy4x53",
        "score": 6,
        "subreddit": "stocks",
        "created": 1635838955.0
    },
    {
        "author": "Historical-Egg3243",
        "body": "im gonna need a bigger dip on MSFT....1% ain't shit after running 15% in a month",
        "created_utc": 1635804405,
        "id": "hixrtt6",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635833205.0
    },
    {
        "author": "NaNoBoT900",
        "body": "Sold my MSFT call at open like a puss. Bought a tsla verical call with an erection cuz im poor. Kept my amzn call. Bought 10 RKT calls like a retard. \n\nGoodnight diary",
        "created_utc": 1635898955,
        "id": "hj319ny",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1635927755.0
    }
]