[
    {
        "author": "shawman123",
        "body": "There is no question that Qualcomm will be around 10+ years. They have moats in many segments and are now making AR/VR chips which are going to be huge. There will be negative catalysts like Apple making its own modem(still have to pay licensing to QCOM for using 3g/4g if I am not wrong). Exynos with AMD GFX might at one point end up better than QCOM chips and low/medium end soc's are in competition against Mediatek. Still they should be around for a long time.",
        "created_utc": 1622307719,
        "id": "gzvymuh",
        "score": 103,
        "subreddit": "investing",
        "created": 1622336519.0
    },
    {
        "author": "hermeticstudy",
        "body": "The bear case is relatively short runway for growth that is derisked. Yes, they are the unquestioned leader in 5G modem and RF technology currently, and will benefit from a historic refresh cycle as all handsets become 5G-enabled (this is already underway). However, beyond that, handset units isn't a viable growth story (penetration already high) - so Qualcomm will have to depend on design wins in auto, notebook PCs etc, where their dominance is far from a sure thing. Others have already noted the potential for in-sourcing of iPhone components that could disrupt the handset moat over time.",
        "created_utc": 1622309874,
        "id": "gzw2upc",
        "score": 53,
        "subreddit": "investing",
        "created": 1622338674.0
    },
    {
        "author": "miscsubs",
        "body": "To counter your counter, it seems Apple hired a lot of Intel modem engineers who came up with an inferior product despite Intel’s expertise in semiconductors.\n\nMaking modems is hard, very hard. I seriously doubt Apple (or anyone) can come from behind and catch up to QCOM.\n\nThere is a reason QCOM wasn’t scared to go to (legal) war with Apple over this and was one of few companies that bent Apple’s will.\n\nIMO, the biggest bear case for QCOM is/was regulatory due to their aggressive licensing practices. But they won that battle too, surprising many of us who thought otherwise.\n\nMaybe if 5G flops or has very slow adoption, then there is another concern but I don’t know if I’d bank on that.",
        "created_utc": 1622313750,
        "id": "gzwahzg",
        "score": 26,
        "subreddit": "investing",
        "created": 1622342550.0
    },
    {
        "author": "ADzeek",
        "body": "AMD Applied materials Qualcomm DKNG",
        "created_utc": 1620443127,
        "id": "gxcljxk",
        "score": 22,
        "subreddit": "stocks",
        "created": 1620471927.0
    },
    {
        "author": "tywebb1000",
        "body": "QCOM",
        "created_utc": 1620875428,
        "id": "gxxqm9v",
        "score": 21,
        "subreddit": "stocks",
        "created": 1620904228.0
    },
    {
        "author": "Gr0und0ne",
        "body": "*whispers*\n\n^QCOM.\n\n*sigh*",
        "created_utc": 1621651177,
        "id": "gz0l04t",
        "score": 18,
        "subreddit": "stocks",
        "created": 1621679977.0
    },
    {
        "author": "littlered1984",
        "body": "I think this is spot on. QCOM isn't a shoe in for any new growth areas (they aren't the leader already), and those areas have a massive number of competitors.",
        "created_utc": 1622317969,
        "id": "gzwivg4",
        "score": 16,
        "subreddit": "investing",
        "created": 1622346769.0
    },
    {
        "author": "GYN-k4H-Q3z-75B",
        "body": "The split is nice and Nvidia is doing well, but my eyes are still on the ARM merger. If that gets the nod from regulators, Nvidia is golden. If it does not, growth becomes harder for Nvidia. The reason is that ARM as an architecture stands to expand into the desktop segment. Apple is transitioning, and Windows has the software support but is lacking the hardware. The merger would give Nvidia control over the architecture and companies like Apple and Qualcomm would have to pay royalties to Nvidia who could at the same time churn out their own ARM chips.",
        "created_utc": 1621983194,
        "id": "gzg4tye",
        "score": 13,
        "subreddit": "stocks",
        "created": 1622011994.0
    },
    {
        "author": "ScipioAfricanvs",
        "body": "I’ve just started looking into QCOM as well as it would be directly relevant to me (RSUs if I accept a job there). I personally think they are well positioned and we’ve recently seen how important some of their technologies are. Apart from Apple, which others have mentioned, one potential weakness is China - if there’s ever a trade war, tariffs, sanctions, etc. their revenue would take a huge hit.",
        "created_utc": 1622309065,
        "id": "gzw19l4",
        "score": 12,
        "subreddit": "investing",
        "created": 1622337865.0
    },
    {
        "author": "NPPraxis",
        "body": "This is my exact argument. Apple has proven that they can easily crush Qualcomm’s designs and that ARM is viable for laptops.  Pretty quickly everyone is going to make their own ARM chips if Qualcomm can’t dramatically increase performance.\n\nApple is also working on their own 5G modem and there are potential monopoly legal issues with some of their behavior.",
        "created_utc": 1622326659,
        "id": "gzwzoxq",
        "score": 9,
        "subreddit": "investing",
        "created": 1622355459.0
    },
    {
        "author": "sebasq",
        "body": "Oh no. QCOM is not going to potentially 100x my money. Spacemobile is going to be a FCF machine. The revenue sharing and profits are going to be insane.",
        "created_utc": 1620322070,
        "id": "gx692zd",
        "score": 9,
        "subreddit": "wallstreetbets",
        "created": 1620350870.0
    },
    {
        "author": "felunk",
        "body": "Last i check both Intel and Qualcomm are doing quite well.  If anything China just wants to create their own Intel and Qualcomm to cut them out of China and sell similar products to world cheaper so the in the long run not working with China would benefit them",
        "created_utc": 1622299945,
        "id": "gzvjodr",
        "score": 9,
        "subreddit": "stocks",
        "created": 1622328745.0
    },
    {
        "author": "Flakmaster92",
        "body": "Chip shortage for one. But also everyone is getting into making their own chips. \n\nApple makes their own with the A/M/W series, Amazon makes their own ARM cores (if you don’t think they’ll bring them to kindle and Alexa devices eventually, you’re crazy). Microsoft is rumored to be working on their own, possibly for Azure, possibly for future Surface products. Samsung has their own with Exynos. Google is rumored to be unveiling a new Pixel phone with their own SoC. \n\nQualcomm still has patents and modem tech, that’s true and fair however all of the above players will eat onto their SoC profits. They’ll exist, but I wouldn’t be banking on same levels of growth moving into the future.",
        "created_utc": 1622315434,
        "id": "gzwdrwx",
        "score": 8,
        "subreddit": "investing",
        "created": 1622344234.0
    },
    {
        "author": "ron_leflore",
        "body": "Yeah, the bear case against qcom five five years ago was that Intel was going to compete with them. So much for that.",
        "created_utc": 1622317897,
        "id": "gzwipu6",
        "score": 8,
        "subreddit": "investing",
        "created": 1622346697.0
    },
    {
        "author": "AnonBoboAnon",
        "body": "I think you are highly underestimating the areas qcom address and currently their products are in the (mobile, laptop, VR/AR, auto, wearables, audio, networking, industrial, cameras, smart home). They are literally hitting their stride where the world is dependent on their products or licenses.",
        "created_utc": 1622307431,
        "id": "gzvy2m8",
        "score": 8,
        "subreddit": "investing",
        "created": 1622336231.0
    },
    {
        "author": "Pikachu87",
        "body": "Me: Buys QCOM, TSMC\n\nAAPL: i'm about to end this man's whole portfolio.\n\nMe: Buys PLTR \n\nPLTR: i'm about to end this man's whole portfolio too.",
        "created_utc": 1620716776,
        "id": "gxpc291",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1620745576.0
    },
    {
        "author": "Muboi",
        "body": "Tesla is very similiarly valued to Cisco or Qcom during the dotcom bubble.  \nDownvote to the left",
        "created_utc": 1621026095,
        "id": "gy58ig5",
        "score": 7,
        "subreddit": "stocks",
        "created": 1621054895.0
    },
    {
        "author": "JayArlington",
        "body": "Before a single new chip is made with this investment, it is the capital equipment manufacturers that will benefit FIRST.  \n\nASML, AMAT, KLAC, KLIC, LRCX\n\nThis will not help NVDA, QCOM, or AMD until new fab capacity is online (so end of 2022 at the earliest).  Once more fab capacity has been created, the chip designers should benefit from lower contract manufacturing prices.",
        "created_utc": 1621028790,
        "id": "gy5e8o9",
        "score": 7,
        "subreddit": "wallstreetbets",
        "created": 1621057590.0
    },
    {
        "author": "Gurthang99",
        "body": "Gurthang's Gainers +0.38%\r  \n\n\nI am long on O,STAG,BND,VIG,VYM,AMT,CCI,MSFT,IRM,QCOM,ESTC,ET,LAND,CRLBF,PW\r  \n\n\nCompound interest is the eighth wonder of the world. He who understands it, earns it ... he who doesn't ... pays it.  Compound interest is the most powerful force in the universe.  Compound interest is the greatest mathematical discovery of all time.",
        "created_utc": 1622026854,
        "id": "gzi06wy",
        "score": 7,
        "subreddit": "investing",
        "created": 1622055654.0
    },
    {
        "author": "aurora4000",
        "body": "$QCOM - how is this stock trading so low? Only $132.73\n\nThey make wireless 3G, 4G and 5G chips used by the majority of smartphones.\n\n$175 price target was assigned to them on 4/29 by JP Morgan, Morgan Stanley, Piper Sandler and Mizuho.\n\nIt has appreciated some from  last year when I bought it - but it has been flat for too long IMO.",
        "created_utc": 1621872554,
        "id": "gzab6dg",
        "score": 6,
        "subreddit": "stocks",
        "created": 1621901354.0
    },
    {
        "author": "jesperbj",
        "body": "Correct. And QCOM mainly design - they don't manufacture. Samsung does most of their high end chips for example. Hence why Samsung phones in the US use Qualcomm.",
        "created_utc": 1622328742,
        "id": "gzx3e6x",
        "score": 6,
        "subreddit": "investing",
        "created": 1622357542.0
    },
    {
        "author": "RegretTMRW",
        "body": "Nvidia +2%, Qualcomm + 1.3%, AMD???????? fucking nothing. fuck you arbitrage",
        "created_utc": 1620228636,
        "id": "gx1bqp7",
        "score": 6,
        "subreddit": "wallstreetbets",
        "created": 1620257436.0
    },
    {
        "author": "Objective_YOLO63",
        "body": "10 yrs. A few Suggestions \nAPPL * Tsla * GM * NIO * Amzn * FB * TTD * RIO * AMAT* TSM * CVS * AMT * CCI * JPM * MSFT * NVDA * QCOM * MU * SKLZ * CAT * TGT * COST * AVGO * \n\nIn funds you could go 3x's in 9-10yrs.\nALSO ADD a  cpl index funds.\nVTI * VFINX * solid funds Or go with spy qqq to many funds!\n\nI am not a financial advisor I pick for. fun and entertainment purposes only!",
        "created_utc": 1621086422,
        "id": "gy7pymc",
        "score": 6,
        "subreddit": "stocks",
        "created": 1621115222.0
    },
    {
        "author": "ILoveMyFerrari",
        "body": "Qualcomm doesn't make the kind of GPU's that crypto miners use. No worries here.",
        "created_utc": 1620093101,
        "id": "gwuvy0f",
        "score": 6,
        "subreddit": "stocks",
        "created": 1620121901.0
    },
    {
        "author": "Finfinner7",
        "body": "Congrats! I’m holding a QCOM position as well, hoping with you 🤞",
        "created_utc": 1620939010,
        "id": "gy0v441",
        "score": 6,
        "subreddit": "options",
        "created": 1620967810.0
    },
    {
        "author": "Captain-Whoopass",
        "body": "“There’s no good picks left”-the market. Meanwhile JD sitting at a single digit forward p/e and a market cap less than its revenue last year, Baba undervalued af and beats every earnings, and NIO already solved their own chip shortage issue before it became priced in and is making a fucking super factory that will net them 1 million cars a year. And there’s plenty of decent US value stocks if you sort through em as well, like qualcomm trading at 133 and they will be netting 7 dollars a share for earnings seasons soon. There’s plenty of good picks out there right now, even big tech will grow into their valuations within a fucking year, market makers have no real excuse they just want to burn it all down to fuck retail. Don’t buy short dated options, they will quit this bullshit when WSB quits donating them money, they are literally targeting us and options players, if you haven’t figured this out yet...please do",
        "created_utc": 1620155586,
        "id": "gwxq30j",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620184386.0
    },
    {
        "author": "WalterBoudreaux",
        "body": "&gt;Sounds like it could be compelling and is there B/S in good shape?\n\nYes, balance sheet is pristine. If you re-read my original post, I mention how post-IPO, they had $300 million in cash and no debt.\n\n&gt;I pause becuz Vizio doesn’t make their own TV components and will always have an inferior product.\n\nPretty sure neither do a lot of the \"big name\" brands. Everyone buys TV OLED panels off of LG. Sony can't even put more than 2 HDMI 2.1 ports even in their top $4,000 OLED TV right now because they are having to buy the chip off of MediaTek. Just 2 quick examples.\n\n&gt;Personally I stay away from their TVs and over last 15 years go with LG (recently with Samsung, which was disappointing). \n\nLG's non-OLED TVs are complete trash. They are THE market leader in OLED though and make all the OLED panels (Sony and Vizio buy OLED panels from LG). Sony overall makes the best non-OLED TVs. Basically if you want the best high end, get an LG OLED or debatably a Sony OLED, which uses an LG OLED panel but Sony's own processor.\n\nSamsung has been churning out trash TVs for a few years now (because they know most people are too clueless to realize it and will fork over $ for Samsung brand). The exception is the top few models, all of which are really overpriced in my view vs. Sony.\n\n&gt;Are these profit margin numbers indicative of Vizio’s industry in whole, or is Vizio ascending to a leading position? \n\nVizio's platform gross margins are a lot higher than Roku's. I'm not sure why yet.\n\n&gt;Curious as I’d expect every smart TV to have an ad selling platform.\n\nAlmost none of the others fully control theirs. Sony licenses Google/Android TV OS. Samsung uses some Linux-based one called Tizen. LG licenses webOS from QualComm. TCL licenses Roku. Hisense licenses both Roku and Android. The final piece here is that ad selling platforms don't move the needle for massive conglomerates like Samsung and LG. Not to mention that these platforms are not mutually exclusive....will advertisers only want to reach Roku customers and just ignore the millions who own Vizio's for example? No. They want to get the furthest reach possible!\n\nLet me know if you have any other q's",
        "created_utc": 1620686514,
        "id": "gxnx8tx",
        "score": 5,
        "subreddit": "ValueInvesting",
        "created": 1620715314.0
    },
    {
        "author": "Captain-Whoopass",
        "body": "Qualcomm literally became a fucking value stock today with a trailing p/e of 18. Thanks Wall Street, I will gladly pick these up at 133 to DCA for long term dividends and growth. Best 5G play and cheapest chip stock. These clowns literally think we panic when they dump but we just keep buying lmfao, just givin me cheaper stonks and leaps for the inevitable money party cuz shit is hella oversold for high growth",
        "created_utc": 1620154229,
        "id": "gwxn0xg",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620183029.0
    },
    {
        "author": "pman6",
        "body": "holy shit this earnings seasons has fucked me in the ass.\n\nAAPL AMD QCOM SQ \n\nand now BABA\n\njesus fuck.\n\nDIS is gonna shit the bed today, just like my other stocks.\n\nDIS dipped to 170 premarket, so sentiment not good probably. DIS expectations are very high",
        "created_utc": 1620917529,
        "id": "gxzflxy",
        "score": 5,
        "subreddit": "stocks",
        "created": 1620946329.0
    },
    {
        "author": "felunk",
        "body": "Qualcomm has not lost anything, pure growth as they have a near monopoly on 5G....Intel has been losing marketshare to AMD and Nvidia, both American companies, but still printing money...so yeah more than quite well",
        "created_utc": 1622301501,
        "id": "gzvmj96",
        "score": 5,
        "subreddit": "stocks",
        "created": 1622330301.0
    },
    {
        "author": "ThankYouHuma2016",
        "body": "Intel’s chip technology is years behind the other big boys and Apple has now ditched them entirely. TSMC makes the chips for Apple, AMD, NVDA, Marvell, Qualcomm, Broadcom, and basically any other chip company you can think of.",
        "created_utc": 1622320129,
        "id": "gzwn6p6",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1622348929.0
    },
    {
        "author": "QuestionablySensible",
        "body": "Counterpoint - they sell quite a lot of equipment to Ericsson and Qualcomm.\n\nA bet on Nokia right now is a bet on the new executive team. Nokia have the ingredients to do better than they are but it remains to be seen if they can execute.",
        "created_utc": 1620042710,
        "id": "gwrt6at",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1620071510.0
    },
    {
        "author": "RssnGopnik",
        "body": "I believe in QCOM as a company. They make great products",
        "created_utc": 1620940163,
        "id": "gy0xqdm",
        "score": 5,
        "subreddit": "options",
        "created": 1620968963.0
    },
    {
        "author": "littlered1984",
        "body": "Different perspective - in my experience QCOM can struggle to recruit top engineers as they are not FAANG(not MS/AMD/NVDA either), which can be an issue when it comes to company growth. When I was interviewing for jobs about 5 years ago, I had offers from a number of places including QCOM. QCOM ranked towards the bottom in interesting projects and clearly wasn't a leader in the space I work. \"A great perk is that we get offices instead of cubicles, plus  we get to be in sunny San Diego vs the bay area\" is the main selling point I heard from nearly everyone there I talked to. San Diego is a risk as other top companies aren't there - you can't change jobs easily. And offices vs cubicles was a weird one in retrospect as many people work from home these days.",
        "created_utc": 1622318659,
        "id": "gzwkcfw",
        "score": 5,
        "subreddit": "investing",
        "created": 1622347459.0
    },
    {
        "author": "Youkiame",
        "body": "QCOM blew their Q1 earning expectation out of Mars and it's not moving at all.",
        "created_utc": 1621664532,
        "id": "gz14g8r",
        "score": 5,
        "subreddit": "stocks",
        "created": 1621693332.0
    },
    {
        "author": "IOERSdj",
        "body": "This applies if you're looking only at the semiconductor foundry industry/market. However samsung is not a bad choice as a whole just due to its massive size and diversification. And their foundry effectively has a captive customer in the form of their mobile division (exynos). Also qualcomm would rather get their chips manufactured at samsung rather than TSMC because Apple has priority at TSMC.",
        "created_utc": 1621799250,
        "id": "gz71hgw",
        "score": 5,
        "subreddit": "stocks",
        "created": 1621828050.0
    },
    {
        "author": "WilhelmSuperhitler",
        "body": "I think it's possible that Arm processors will be running server farms soon. The idea behind that is that Arm processors are energy efficient and at the scale of thousands of servers the energy cost savings will be significant.\n\nConsidering that QCOM bought Nuvia for measly 1.4B I consider it a really good move.",
        "created_utc": 1622406237,
        "id": "h00d5pu",
        "score": 5,
        "subreddit": "investing",
        "created": 1622435037.0
    },
    {
        "author": "shilpagupta74",
        "body": "Thinking of buying the dip for investing purposes. Thought on ABBV, QCOM, AMD or EPD?",
        "created_utc": 1620842137,
        "id": "gxvp1ds",
        "score": 4,
        "subreddit": "investing",
        "created": 1620870937.0
    },
    {
        "author": "toydan",
        "body": "Today’s moves:\n\n$TSLA rolled a CSP down and out for $475 and picked up more shares under $600.\n\nAdded to following positions in dividend Acct: UPS ABBV MO WBA QCOM SWKS T XOM MSFT AAPL UWMC\n\nPicked up more GOOG and sold a CC over VALE\n\nITM LEAPS on DKNG CRWD MU PLTR\n\nThis is me and my risk tolerance. Just posting for the haters and I know many others irl doing the same. I am in this for the next 30 years.\n\nSell if you need to. Play your hand. Good luck.\n\n✌️\n\nEdit posted this earlier. Over 30 trades. All buys and no sells. I am happy with all of them. Some may be down tomorrow. That is ok. \n\nHope you had a great day.",
        "created_utc": 1620778633,
        "id": "gxso2vi",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1620807433.0
    },
    {
        "author": "third_legatron",
        "body": "Be careful. That guy just told you to buy stocks that have been on a losing spree for a bit. This isn't the market cycle for frothy tech stocks. I'm a fan of semiconductor plays like , QCOM, Lam research, AMD and intel (long hold, short is hairy.) I like big tech with good earnings and decently low peg and pe multiples. Tech is presenting some good buying opportunities, but the market is rampant with companies that just simply won't make it. Stick to blues chip names that have gotten beaten up and dca into a solid position. Anything else speculative, may be comparable to catching a falling knife.\n\nApph isn't terrible and has promise. \n\nEV is solid, but very expensive for most investments right now, as most don't turn a profit. Tesla barely even turns a profit and is the first mover. To play this space, I would go with legacy automakers like Gm or ford or volkswagen, as they are on a path to integrate EVs into their lineups. \n\nOther than automakers, I would buy lithium miners like Livent or albemarle. Precious metals like palladium and rhodium related stocks may also be good buys because PGM metals are used in EV cars as well as ICE cars. \n\nRight now, industrials are good, although with the inflation narrative, stocks with pricing power are in demand. Healthcare, tobacco, oil (eh, I'm bullish, but I'm biased), food and beverage (pepsi, Coca-Cola, etc) will probably do decent under this volatility, but won't make you heaps of money either. \n\nBanks are also decent buys, I like Citi and BAC. They will do well under inflation BUT have already went on a bit of a tear so dca into a position may be smart.",
        "created_utc": 1621406116,
        "id": "gyo1l63",
        "score": 4,
        "subreddit": "stocks",
        "created": 1621434916.0
    },
    {
        "author": "ksirutas",
        "body": "You also bought at an all time high. I invested in QCOM in December of 2019 and I’m up 100%.",
        "created_utc": 1622324311,
        "id": "gzwvc7g",
        "score": 4,
        "subreddit": "investing",
        "created": 1622353111.0
    },
    {
        "author": "LegendLarrynumero1",
        "body": "QCOMM's market share in china already plunged\nQualcomm's shipments in China shrank 48.1% year-on-year, CINNO Research said without releasing details on the number of Qualcomm chips shipped. The U.S. giant's market share in China fell to 25.4% in 2020 versus 37.9% in 2019.",
        "created_utc": 1619890731,
        "id": "gwkbrto",
        "score": 3,
        "subreddit": "stocks",
        "created": 1619919531.0
    },
    {
        "author": "csklmf",
        "body": "Please rate my portfolio and see what adjustment I can make:\n\n16 shares TSLA\n\n21 shares SQ\n\n21 shares AAPL\n\n.5 share AMZN\n\n5 shares MSFT\n\n39 shares CELH\n\n70 shares PLTR\n\n60 shares CHPT\n\n13 shares QCOM\n\n16 shares AMD\n\n8 shares ABNB\n\n20 shares ARKX\n\n15 shares UPWK\n\n20 shares PLUG\n\n10 shares U\n\n10 shares ETSY\n\n10 shares PINS\n\n15 shares DIS\n\n30 sahres MGM\n\n15 shares RTX\n\n18 shares DAL\n\n30 shares AAL\n\n20 shares TTCF\n\n2 shares PYPL",
        "created_utc": 1621813522,
        "id": "gz7ub8x",
        "score": 3,
        "subreddit": "stocks",
        "created": 1621842322.0
    },
    {
        "author": "TheMailmanic",
        "body": "The future is bright for semis and valuations aren't that crazy especially you look at growth,  earnings,  FCF and ROIC\n\nI bought more AMD on the dip\n\nNote I do not believe buying overvalued high growth no profits software companies makes sense right now\n\nIn semis I hold NVDA, amd, asml, lrcx, klac, mu,  and qcom\n\nMu and qcom look REALLY cheap too",
        "created_utc": 1620943434,
        "id": "gy14ffs",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620972234.0
    },
    {
        "author": "redouglas39",
        "body": "I am a new investor. Should I get some BRK.B or XLP into play to balance my tech portfolio?\n\nCRM 22%\n\nQCOM 13%\n\nSQ 11%\n\nAAPL 10%\n\nUAL 5%\n\nNET 5%\n\nSNOW 5%\n\nIPOE 4%\n\nOXY 3%\n\nCash 21%",
        "created_utc": 1620748483,
        "id": "gxqq4s3",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620777283.0
    },
    {
        "author": "embrace-ur-elements",
        "body": "ABBV is losing Humira which is a huge revenue stream, so the great valuation is actually less great than it seems. I don't think it is a terrible pick compared to the broad market.\n\nQCOM seems fairly valued (especially compared to broad market).\n\nAMD seems very overextended. I don't know enough about the company to know if enough growth is there in the future to justify it, but I would steer clear based on its financials at the moment.\n\nEPD- Never heard of but valuation is cheap and oil and gas has nice valuations of course but the risks are it's oil and gas. It is not cheap enough for me based on looking at financials, but granted I don't know the company.\n\nGranted my time horizon is 20 years.",
        "created_utc": 1620848701,
        "id": "gxw5dl4",
        "score": 3,
        "subreddit": "investing",
        "created": 1620877501.0
    },
    {
        "author": "idkfawin32",
        "body": "I YOLOed into QCOM",
        "created_utc": 1621912092,
        "id": "gzcmgqu",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1621940892.0
    },
    {
        "author": "No_Werewolf_1214",
        "body": "QCOM is my highest conviction position. You’re just early. It will dip a bit after next earnings bc that’s how the annual cycle goes on their finances but Q4/Q1 gonna explode to the upside.",
        "created_utc": 1621687172,
        "id": "gz1t3cr",
        "score": 3,
        "subreddit": "stocks",
        "created": 1621715972.0
    },
    {
        "author": "ravakata",
        "body": "I lived for 3 years in San Diego 2 miles from Qualcomm office. I was friends with many engineers and everyone’s opinion is that its not FAANG or it not San Francisco. On top of it, there scare of major layoffs a couple of hears back made lot of engineers to jump their ship. If people on H1B are switching jobs it means something is seriosuly wrong because a) 80% of companies do not want to hire H1B so market is tough for them and b) the job change process is 10 times tougher for them due to paperwork and greencard processing tied to employers. A lot of H1B were making the move outside ..",
        "created_utc": 1622339695,
        "id": "gzxlv67",
        "score": 3,
        "subreddit": "investing",
        "created": 1622368495.0
    },
    {
        "author": "Gurthang99",
        "body": "Gurthang's Gainers +0.37% from 5/26/21\r  \nI am long on O,STAG,BND,VIG,VYM,AMT,CCI,MSFT,IRM,QCOM,ESTC,ET,LAND,CRLBF,PW\r  \nCompound interest is the eighth wonder of the world. He who understands it, earns it ... he who doesn't ... pays it.  Compound interest is the most powerful force in the universe.  Compound interest is the greatest mathematical discovery of all time.",
        "created_utc": 1622120654,
        "id": "gzmre1o",
        "score": 3,
        "subreddit": "investing",
        "created": 1622149454.0
    },
    {
        "author": "True-Requirement8243",
        "body": "Doesn't Qualcomm make modem chips for 5G communications? They do graphics cards too?",
        "created_utc": 1620089913,
        "id": "gwupcw6",
        "score": 3,
        "subreddit": "stocks",
        "created": 1620118713.0
    },
    {
        "author": "littlered1984",
        "body": "I’ve met very few people in tech that made the move out there. What makes you think SD gives Qualcomm an advantage over other tech companies?",
        "created_utc": 1622334150,
        "id": "gzxcn1q",
        "score": 3,
        "subreddit": "investing",
        "created": 1622362950.0
    },
    {
        "author": "AirborneReptile",
        "body": "Their only gpu product to my knowledge is a mobile gpu.  Crypto mining or lack of it, should not disrupt anything QCOM does. Please correct me if I’m wrong 🍻",
        "created_utc": 1620093343,
        "id": "gwuwfq5",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620122143.0
    },
    {
        "author": "rfgrunt",
        "body": "San Diego has major sticking power. Cheaper and nicer than the bay. But Intel, Apple, TSMC, mediatek are all opening offices in SD to poach qcom engineers who don’t want to move.",
        "created_utc": 1622385642,
        "id": "gzz8n8c",
        "score": 2,
        "subreddit": "investing",
        "created": 1622414442.0
    },
    {
        "author": "Bcron",
        "body": "SOXL has NVDA AMAT QCOM TXN INTC. Triple leveraged.  Positive alpha, sharpe ratio 1.06, beta of like 6.  I theta gang this shit and it works, great dips and great rips\n\nAlso AMD is tight, hell, I could see this sector being the next 'reopening play' after big money rotates out of industrials and brick and mortar garbage, the shortage won't last forever and the forward metrics aren't taking that into account... Sound familiar?  Hell yeah it's the next Shake Shack",
        "created_utc": 1620437262,
        "id": "gxcb960",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620466062.0
    },
    {
        "author": "Outrageous-Win-9449",
        "body": "Haven't looked into AMAT.  I like TSM, QCOM and NVDA, but I think TSM capitalizes the most out of all of them on the shortage alone.",
        "created_utc": 1620436119,
        "id": "gxc985u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620464919.0
    },
    {
        "author": "bernie638",
        "body": "My condolences. \n\nUnfortunately,  good advice gets down voted to invisible and ridiculed around here.\n\nHaving a diversified portfolio helps a lot,  my biggest loser from 2013 has been my biggest winner this year (TROX).  Unfortunately I left it for dead and didn't reballance into it. If you don't want to spend a lot of effort finding good companies in different areas and periodically reballancing,  just by a low cost index fund and they do it for you. \n\nAnother way is to dump your losers and let your winners run.  Ignore the price you paid for the stock,  that's the most meaningless thing and it would benefit humanity if that number was hard to find.   The important thing, is it going to go up from the price today? People sell something that still has a lot of upside just because they are up some arbitrary amount or hold something going down because they don't want to \"sell for a loss \" and instead take an even bigger loss.  Again,  if you're holding a diversified portfolio then you would sometimes sell a portion of your winners and buy your low priced losers to keep roughly the same dollar amount in each sector. Example,  I sold 2/3 of QCOM after it shot up big in February and put that money into beaten down energy and materials.  I  didn't get rid of all my QCOM,  but it was back to 1/15th of my total dollar amount.",
        "created_utc": 1620661070,
        "id": "gxma7fp",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620689870.0
    },
    {
        "author": "All-i-eat-is-pussy",
        "body": "Anyone knows why QCOM is on the dumpster",
        "created_utc": 1620663553,
        "id": "gxmg4lb",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620692353.0
    },
    {
        "author": "RichSteps",
        "body": "This post mentions: **$QCOM, $FDD, $MSFT, $ACCYY, $SRMX, $IOT, $TDD, $AVT**\n\n/u/RD_TheGunnslinger's account was created **4 years ago**. It has **665** comment karma and **769** link karma.\n\n-----\n\n^You ^may ^see ^tickers ^you ^didn't ^mention ^-- ^I'm ^casting ^a ^wide ^net ^because ^y'all ^don't ^always ^$TAG ^your ^ticker ^symbols.\n\n^This ^was ^an ^automated ^response. ^If ^you ^have ^feedback, ^please ^reply ^to ^this ^comment ^or [^(send me a message)](https://www.reddit.com/message/compose?to=RichSteps&amp;subject=bot%20feedback)^.",
        "created_utc": 1621347667,
        "id": "gyklcdv",
        "score": 2,
        "subreddit": "pennystocks",
        "created": 1621376467.0
    },
    {
        "author": "RobertDrewke",
        "body": "Just look at my watch list. All red except:  \n\n\nQCOM, FB, UPST, MRVI and FSR and a few one penny moves in some SPACs.",
        "created_utc": 1621450373,
        "id": "gyqak8m",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1621479173.0
    },
    {
        "author": "felunk",
        "body": "On long enough time frame hard to go wrong but since AMD doesnt pay a dividend its hard to hold it unlike Intel, NVDA, AVGO, QCOM, etc etc....which pay you to hold for the inevitable boom/bust cycles...",
        "created_utc": 1621096852,
        "id": "gy8awf1",
        "score": 2,
        "subreddit": "stocks",
        "created": 1621125652.0
    },
    {
        "author": "SatriaDigja",
        "body": "Technically, everything is fine with Qualcomm but need to watch closely (technology could change dramatically). I think \"The Court\" is the problem for the Qualcomm license business.",
        "created_utc": 1622499472,
        "id": "h04mtzo",
        "score": 2,
        "subreddit": "investing",
        "created": 1622528272.0
    },
    {
        "author": "Momentum1975",
        "body": "QCOM jumped up on hi volume after the last earnings report. Generally that is a good time buy. But it crapped out in the next few days (dropped precipitously). That’s a bad sign. Our research, based on thousands of reactions to earnings announcements, says stay away from stocks that crap out after a positive earnings surprise.",
        "created_utc": 1622482582,
        "id": "h03pc6m",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622511382.0
    },
    {
        "author": "BuildingBenjamins",
        "body": "At least you know it can and will happen. We have seen this movie before. Most investors, pros and retail, have not. I too owned QCOM, sold my last share on January 2, 2000. A couple of months too early but better than late. I do own QCOM now.",
        "created_utc": 1620664187,
        "id": "gxmhnhg",
        "score": 2,
        "subreddit": "investing",
        "created": 1620692987.0
    },
    {
        "author": "don_cornichon",
        "body": "QCOM has been one of my greatest disappointments (read: losses on options) this year.",
        "created_utc": 1620655684,
        "id": "gxly14y",
        "score": 2,
        "subreddit": "investing",
        "created": 1620684484.0
    },
    {
        "author": "PeeLoosy",
        "body": "AST technology does not require any modification to existing phones. No new chips, no new design, you take your phone out and go remote, that's how easy it is. No dish antenna, no battery packs, nothing else is needed. Qualcomm + GSAT chip will be hard to scale at the global level since the transition from existing phones to new ones will take some time.",
        "created_utc": 1620364998,
        "id": "gx8ppcl",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620393798.0
    },
    {
        "author": "WoodpeckerAlarmed239",
        "body": "Trimmed some AAPL and picked up some QCOM. \n\nAAPL p/e is getting swole (28!) and it's been losing steam in general. One analyst downgraded with a price target below $100. I only sold a portion to take profits and It's still a good peice of my portfolio.\n\nBought QCOM with the cash and brought my price down a little bit. I recently bought near ATH and it looks like it's got support at this price. p/e of 19 is much better.\n\nThoughts and opinions?",
        "created_utc": 1622212228,
        "id": "gzrgwlq",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622241028.0
    },
    {
        "author": "loin-king",
        "body": "AMD 7nm gave them a perf and power advantage wrt intel in data centers. Not all applications are arm friendly… but I understand that is changing (may take 5-10 years). Apple definitely can make strides with ARM as they have a strong hardware team. Google/Amazon/Microsoft, in my view do not have the hardware focus and do not have the talent to cut AMD in data center… we will know in 3-5 years. I doubt apple will share their Soc or design with other tech companies and they currently do not have cloud offering… google/Amazon can go to qcom but qcom is mostly strong on modem side… I doubt nvidia can close the ARM deal, but if they are successful, it will again cause a disruption and vendors would try to look elsewhere… I guess Nvidia would try to close the ecosystem and slow down the innovation in ARM. The bigger shift in DC is with TPUs and ML specific processors… nvidia would be hurt once everyone comes out with ML specific cores… I assume intel and AMD are trying something there. Google has the lead and Amazon maybe trying to copy things. Microsoft will most likely try to buy qcom/AMD/ml-hardware company… I doubt they can come up with a cpu internally. Interesting times ahead.",
        "created_utc": 1622397786,
        "id": "gzzwavi",
        "score": 2,
        "subreddit": "investing",
        "created": 1622426586.0
    },
    {
        "author": "nycbay",
        "body": "Apple has enough money and talent to drop off QCOM from all of their phones in the next few years. Apple paid Intel 1B to intel for their modem department. Given Apple's history to reinvent technology, I won't bet against Apple. Apple is a pretty bug customer for QCOM.",
        "created_utc": 1622488161,
        "id": "h040our",
        "score": 2,
        "subreddit": "investing",
        "created": 1622516961.0
    },
    {
        "author": "Additional-Primary-8",
        "body": "https://twitter.com/Qualcomm/status/1398338359446151171?s=20",
        "created_utc": 1622416745,
        "id": "h00x3ri",
        "score": 2,
        "subreddit": "investing",
        "created": 1622445545.0
    },
    {
        "author": "introvertedhedgehog",
        "body": "Looking at Nokia, Ericsson and Huawei on the radio side gives a hint as to what the competitive situation could become where basically incombants are challenged by a low cost option (in this example Huawei) that is also very technically competitive.\n\nThat said currently Qualcomm is very dominant..I think non technical people overstate the potential there competition has in the short term. Like they forget Qualcomm has had years and years working in the standards bodies steering the direction of LTE and 5G to be to its liking and not faced the competition Ericsson for example has always faced from Nokia. Qualcomm is deeply entrenched.\n\nAnd you should remember that it's a US company. The US banned Huawei and there is not a top US radio vendor benefitting from that the way Ericsson Nokia and Samsung do. The US will go far to protect Qualcomm from competition from outside the US. The security concerns are similar as on the radio side.\n\nBearish ideas:\n\n*It's not sexy to regular consumers. Maybe the valuation is just 'good' and the rest of the market is crazy right now with TLSA, AAPL and Bitcoin making everything consumer facing crazy with dumb money flooding the market. Maybe it's just what it should be.\n\n*5g may not be as revolutionary as Qualcomm and radio vendors want it to be. It has its own technical challenges that must be overcome for some of the great benefits to be realized so those features can be enabled. How that rolls out is work in progress.\n\n*Longer term I would be looking at the satalite radio communications/internet as possible disruptors.",
        "created_utc": 1622486269,
        "id": "h03wvig",
        "score": 2,
        "subreddit": "investing",
        "created": 1622515069.0
    },
    {
        "author": "kkInkr",
        "body": "SMH, ADI, AMAT, ASML, ATEYY, AVGO, HIMX, INTT,  KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI,  PXLW, QCOM, QRVO, SIMO, SWKS, TER,\n\nbesides the usual AMD, INTC, NVDA, and TSM. Those 4 imo are outdated.  SMH is the ETF.\n\nCircuitry, CDNS, SNPS, ANSS, they are being ignored, but have dominant roles, imo.",
        "created_utc": 1619900068,
        "id": "gwkwyeo",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619928868.0
    },
    {
        "author": "ThisKarmaLimitSucks",
        "body": "Qualcomm is trading at a 19 P/E right now. Full disclosure that I already own a ton of shares in it, but if I was looking to buy a 5G stock on a dip, I'd start there.",
        "created_utc": 1620663594,
        "id": "gxmg83q",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620692394.0
    },
    {
        "author": "TheBullishPanda",
        "body": "Renewable Energy (excluding nuclear)\n\nAs stated before me, renewables are more than likely to be the future of energy. The reason I think investing here is safer than any tech or space company is the capital needed to participate and the time it takes to acquire/build wine and solar plants.\n\nAs recently seen at Qualcomm and before that on many other occasions, tech stocks as well as crypto are extremely vulnerable to disruption. One malfunction, one competitor with a better code or a single security breach can ruin companies for ever. And competition is only getting steeper with almost anybody with a PC able to try to compete.\n\nOpposed to that, renewable energy is a necessity for long term sustained life in earth. Wind and solar plants are extrmly expensive to build and in most of the world you need a government permit to build them. This narrows down the companies likely to succeed substantially. Furthermore, once a plant is installed and the debt you took on to build it is paid off, it's pretty much free money on a great margin.\n\nSo yeah, probably not anymore the fastest growing industry out there, but one with stable cash flows, a good dividend and a great outlook for about as far as we can try to foresee the future.",
        "created_utc": 1620725851,
        "id": "gxplkw7",
        "score": 2,
        "subreddit": "investing",
        "created": 1620754651.0
    },
    {
        "author": "uuzzmmaa",
        "body": "I AM GETTING RAMMED IN MY ASSHOLE RIGHT NOW PLEASE TELL ME IF I SHOULD KEEP MY MORALE UP OR OFF MYSELF WITH THESE STOCKS IN MY PORTFOLIO\n\nAbbvie - 1 share\n\nAlibaba- 1 share\n\nApple- 2\n\nCharge point holdings- 4\n\nCloud fare- 2\n\nFacebook- 1\n\nGolden nugget online gaming- 7\n\nNio- 12\n\nNvidia- 0.5\n\nPayPal- 1\n\nPinterest- 4\n\nQualcomm- 3\n\nRush street interactive- 13\n\nSnowflake- 1\n\nWorkhorse- 22\n\nXpeng- 13\n\nRight now I am in the mentality that when I get more money I will just double down on the reds (almost all of them) to lower the average until it finally turns green. I am not really looking for buying other stocks unless one really intrigues me. Please let me know if I am being dumb. I am -24.7% right now :(",
        "created_utc": 1620778146,
        "id": "gxsn3r3",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620806946.0
    },
    {
        "author": "Winter-Fix-2676",
        "body": "I think the others look better so i only have a small holding in $QCOM",
        "created_utc": 1620262638,
        "id": "gx3i163",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1620291438.0
    },
    {
        "author": "kushal12321",
        "body": "Anyone looking into qcom?",
        "created_utc": 1620281067,
        "id": "gx4de7j",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1620309867.0
    },
    {
        "author": "renjkb",
        "body": "BABA and QCOM",
        "created_utc": 1620932787,
        "id": "gy0g0e6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620961587.0
    },
    {
        "author": "Winter-Fix-2676",
        "body": "FSFG, SLM, GNW, FCBP, ANAT, PGR, QCOM, HAS, TTWO, GURE, U, AFL\n\nCurrently my holdings include : GURE, U, AFL\n\nThinking about adding F and GM",
        "created_utc": 1621474692,
        "id": "gyrrmzh",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1621503492.0
    },
    {
        "author": "thosewhocallme-Tim",
        "body": "Hear you there, I was looking at Qualcomm as a comparative company that the party wasn’t too fond of. They’ve suffered since the US basically blocked them, but BABA’s market is their own back yard. I’m probably going to open a small position, nothing I can’t afford to lose, the overwhelmingly negative sentiment lately has me feeling greedy.",
        "created_utc": 1620947783,
        "id": "gy1d43n",
        "score": 2,
        "subreddit": "stocks",
        "created": 1620976583.0
    },
    {
        "author": "WolfPackWSB",
        "body": "QS &amp; QCOM will be awarded huge money from the $6.5Trillion Infrastructure Bill.. Good growth through next quarter!!",
        "created_utc": 1622305525,
        "id": "gzvubb4",
        "score": 2,
        "subreddit": "stocks",
        "created": 1622334325.0
    },
    {
        "author": "not_creative1",
        "body": "Qualcomm is going to have a great couple of years ahead once android’s 5G super cycle starts.",
        "created_utc": 1622316661,
        "id": "gzwg829",
        "score": 2,
        "subreddit": "investing",
        "created": 1622345461.0
    },
    {
        "author": "aurora4000",
        "body": "Sold QCOM this week -  rocket up guaranteed",
        "created_utc": 1622152401,
        "id": "gzos4jc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1622181201.0
    },
    {
        "author": "Sandalensamy",
        "body": "Yes, i bought KLIC and qualcomm. I lile that  Qcomm is buying back shares and their PE was at 17 when i bought so, its good to me",
        "created_utc": 1621935208,
        "id": "gzdgak2",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1621964008.0
    },
    {
        "author": "Rod_Rhino_TX",
        "body": "been long QCOM ~ 6 mos. Too soon but they re trading below their mediam FV. Holding, but appreciate the bearviews which  I think will be overcome.",
        "created_utc": 1622395259,
        "id": "gzzr81c",
        "score": 2,
        "subreddit": "investing",
        "created": 1622424059.0
    },
    {
        "author": "Majesticpork",
        "body": "Qualcomm biggest strength is it's hold on crucial patterns in chip technologies. Even AMD has to release their Epyc line of chips quickly before Qualcomm cashes in on their growth with a new contract on the cores number.\n\nSo the block before Qualcomm is whether it can retain the hold on the patterns or will the other big tech manage to create something on their own and bypass Qualcomm?\n\nBoth Google and Apple are trying obviously. However Qualcomm hold is quite extensive. They don't just hold patterns on the chips but also the architectures as well as the implementation.\n\nMicrosoft and AMD are also teaming up to fight back.\n\nNvidia is trying to push it's AI friendly chip into various markets. If they succeed then Qualcomm will loose big because Nvidia will offer their stuff for cheap to grab market share.\n\nIntel is losing to everyone but I have no doubt they will try to invent something before they completely lose.",
        "created_utc": 1622504083,
        "id": "h04v6ra",
        "score": 2,
        "subreddit": "investing",
        "created": 1622532883.0
    },
    {
        "author": "jwonz_",
        "body": "Yes, “model”, as in modeling based on a previous hype bubble to estimate how long until people sell an over valued position.\n\nDid you know you can read comment threads from 1999 on QCOM and see people calculating a PE of 300 and justifying it? It’s quite hilarious.\n\nYou’re right that I should do a proper valuation model on TSLA given growth and margin assumptions. Last time I played with one of these a price of 700 required great margins and 100% growth of car sales up to the same amount as Toyota. I don’t see how they achieve the margins.\n\nGuess I need to google these guys, second time they are mentioned.",
        "created_utc": 1619879858,
        "id": "gwjm1zv",
        "score": 1,
        "subreddit": "investing",
        "created": 1619908658.0
    },
    {
        "author": "baconNlegs",
        "body": "QCOM puts 🤢",
        "created_utc": 1621974076,
        "id": "gzflu17",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622002876.0
    },
    {
        "author": "Impressive-Bench-380",
        "body": "(. QCOM ) 5 G    P.E  18.50 always beating there Earnings \nQualcomm Cheers",
        "created_utc": 1621983373,
        "id": "gzg56x2",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1622012173.0
    },
    {
        "author": "JayArlington",
        "body": "I think the closest thing to a bear case for QCOM is that they get nailed via some antitrust case over their existing policy of “no license no chip”.   \n\nThis is where you don’t get their best chips unless you also license their technology (fat margins).  \n\nQCOM is up there with NVDA in being hated by their customers but that’s the price for being VERY good.",
        "created_utc": 1622316885,
        "id": "gzwgort",
        "score": 1,
        "subreddit": "investing",
        "created": 1622345685.0
    },
    {
        "author": "UncommercializedHun",
        "body": "Thoughts on $QCOM? Just sold my $TSM to buy it",
        "created_utc": 1620414649,
        "id": "gxb2cl5",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620443449.0
    },
    {
        "author": "2CommaNoob",
        "body": "The only hold forever is the index ETFs or mutual funds.  Good companies have long lure periods of no stock movement.  Apple, MSFT, IBM, Intel, Qcom, F, GM, Xom, Cisco etc all have years long periods where the stock did absolutely nothing or even lost money.\n\nUnless you got into KO/JPM/BAC/Xom in the 70s; you are underperforming the general market.  It doesn't mean you can't hold individual stocks; you can do both.  Hold some ETFs and trade some stocks that you like.",
        "created_utc": 1620641061,
        "id": "gxlb4sc",
        "score": 1,
        "subreddit": "investing",
        "created": 1620669861.0
    },
    {
        "author": "ashish1512",
        "body": "Is QCOM a buy at this price after the Apple news?",
        "created_utc": 1620746527,
        "id": "gxqlgi0",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620775327.0
    },
    {
        "author": "Winter-Fix-2676",
        "body": "1) American National Group Inc\n\n2) National Western Group Life Inc\n\n3) Take-Two Interactive Software, Inc\n\n4) Qualcomm, Inc",
        "created_utc": 1620231213,
        "id": "gx1i3e8",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1620260013.0
    },
    {
        "author": "Shaun8030",
        "body": "Big tech Facebook, apple ,amzn , MSFT , amd , QCOM , GOOG all crushed earnings lol",
        "created_utc": 1620184561,
        "id": "gwzgow5",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1620213361.0
    },
    {
        "author": "toydan",
        "body": "MU QCOM SWKS TXN. Would like to get back into $SOXL too honestly.",
        "created_utc": 1621343770,
        "id": "gykcxka",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621372570.0
    },
    {
        "author": "Dry-Psychology-1469",
        "body": "CRM and QCOM &lt;3",
        "created_utc": 1621467683,
        "id": "gyrdrif",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1621496483.0
    },
    {
        "author": "uhhsam",
        "body": "My personal for-fun portfolio that has been mostly cleaned up after a rocky reddit-fueled start (retirement fund is all fine and boring and chugging along boringly somewhere (I hope)):\n\n\nVUG - 18%\n\nVYM - 16%\n\nTXN - 11%\n\nQCOM - 9%\n\nYUM - 8%\n\nHD - 7%\n\nTGT - 6%\n\nNVDA - 5%\n\nMSOS - 4%\n\nTTNDY - 4%\n\nASO - 3%\n\nWSM - 3%\n\nSLV - 3%\n\nHOL - 1%\n\nMJ - 1%\n\nLB - 1%\n\n\nNotes: I got drawn in by the Gamestop hype.  Luckily, I had a moment of doubt and cancelled the orders I had placed during the weekend it had peaked.  I still ended up starting off pretty semiconductor-heavy and have slowly been working at decreasing their overall share of my portfolio, although I feel I am falling into a pit of consumer discretionary stocks.\n\nThe ones I'm still slightly ashamed of are HOL, SLV, and the two cannabis ETFs (MSOS and MJ).  I'm in no rush to get rid of them, though.\n\nI would also love to put more into LB, but I'd like to wait to see how the separation plays out so I don't end up with half of the money I put in getting converted to Victoria's Secret stock or something, since I'm only interested in the Bath &amp; Body Works side of the business.\n\nOverall, it may not be ideal, but it's mine and it makes me happy, and I'm to a point where I no longer see red days as being my fault and rather as just what the market did that day.",
        "created_utc": 1620951671,
        "id": "gy1kmsb",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620980471.0
    },
    {
        "author": "Ok_Capital2097",
        "body": "Anyone know if PFZ and MRNA are using QCOM or INTC 5G module for vaccine microchips? \n\nMicrochip shortage is caused by vaccines. Spread the truth. I'm vaccinated so I know.",
        "created_utc": 1620056143,
        "id": "gwsl031",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1620084943.0
    },
    {
        "author": "Auquaholic",
        "body": "So, I've held this stock for 2 years. It's at the same price it was when I bought it. While Qualcomm almost doubled in that time. Of course I sold before the big dip.",
        "created_utc": 1620495292,
        "id": "gxeor7z",
        "score": 1,
        "subreddit": "stocks",
        "created": 1620524092.0
    },
    {
        "author": "kkInkr",
        "body": "SMH, ADI, AMAT, ASML, ATEYY, AVGO, HIMX, INTT,  KLAC, LRCX, LSCC, MPWR, MU, NXPI, POWI,  PXLW, QCOM, QRVO, SIMO, SWKS, TER,\n\nbesides the usual AMD, INTC, NVDA, and TSM. Those 4 imo are outdated.  SMH is the ETF.\n\nCircuitry, CDNS, SNPS, ANSS, they are being ignored, but have dominant roles, imo.",
        "created_utc": 1619900068,
        "id": "gwkwyeo",
        "score": 2,
        "subreddit": "stocks",
        "created": 1619928868.0
    },
    {
        "author": "kyle91892",
        "body": "Here is net asset value and underlying holdings.\n\nSite: [https://ark-funds.com/arkk](https://ark-funds.com/arkk)\n\nSummary Prospectus - Principal Risks Section - [https://etfs.ark-funds.com/hubfs/1\\_Download\\_Files\\_ETF\\_Website/Prospectuses/ARKK\\_Summary\\_Prospectus.pdf](https://etfs.ark-funds.com/hubfs/1_Download_Files_ETF_Website/Prospectuses/ARKK_Summary_Prospectus.pdf)\n\nHoldings:\n\nCompany Ticker CUSIP Shares Market Value($) Weight(%)\n\n1 TESLA INC TSLA 88160R101 3,459,467 2,342,059,159.00 9.95\n\n2 TELADOC HEALTH INC TDOC 87918A105 8,334,125 1,423,968,597.50 6.05\n\n3 ROKU INC ROKU 77543R102 3,420,473 1,220,082,719.10 5.19\n\n4 SQUARE INC - A SQ 852234103 4,615,084 1,143,433,211.84 4.86\n\n5 SHOPIFY INC - CLASS A SHOP 82509L107 703,222 867,121,951.54 3.69\n\n6 ZILLOW GROUP INC - C Z 98954M200 6,370,651 843,729,018.44 3.59\n\n7 SPOTIFY TECHNOLOGY SA SPOT L8681T102 3,067,150 804,053,372.50 3.42\n\n8 ZOOM VIDEO COMMUNICATIONS-A ZM 98980L101 2,474,413 794,534,014.30 3.38\n\n9 BAIDU INC - SPON ADR BIDU 056752108 3,452,947 733,026,118.63 3.12\n\n10 EXACT SCIENCES CORP EXAS 30063P105 5,346,316 711,166,954.32 3.02\n\n11 TWILIO INC - A TWLO 90138F102 1,764,060 662,298,686.40 2.81\n\n12 CRISPR THERAPEUTICS AG CRSP H17182108 4,991,200 658,239,456.00 2.80\n\n13 UNITY SOFTWARE INC U 91332U101 6,165,551 636,469,829.73 2.71\n\n14 COINBASE GLOBAL INC -CLASS A COIN 19260Q107 1,851,777 545,848,306.29 2.32\n\n15 DOCUSIGN INC DOCU 256163106 2,379,851 534,490,736.09 2.27\n\n16 INVITAE CORP NVTA 46185L103 14,352,796 502,347,860.00 2.14\n\n17 10X GENOMICS INC-CLASS A TXG 88025U109 2,312,229 456,434,004.60 1.94\n\n18 INTELLIA THERAPEUTICS INC NTLA 45826J105 5,308,716 425,121,977.28 1.81\n\n19 SEA LTD-ADR SE 81141R100 1,426,044 366,250,880.52 1.56\n\n20 IOVANCE BIOTHERAPEUTICS INC IOVA 462260100 11,409,802 357,583,194.68 1.52\n\n21 TWIST BIOSCIENCE CORP TWST 90184D100 2,594,471 354,352,849.18 1.51\n\n22 PALANTIR TECHNOLOGIES INC-A PLTR 69608A108 15,014,744 350,894,567.28 1.49\n\n23 NINTENDO CO LTD-UNSPONS ADR NTDOY 654445303 4,815,970 342,463,626.70 1.46\n\n24 KE HOLDINGS INC-ADR BEKE 482497104 6,308,021 332,054,225.44 1.41\n\n25 PURE STORAGE INC - CLASS A PSTG 74624M102 15,978,258 327,873,854.16 1.39\n\n26 IRIDIUM COMMUNICATIONS INC IRDM 46269C102 8,139,789 311,265,531.36 1.32\n\n27 BEAM THERAPEUTICS INC BEAM 07373V105 3,903,026 304,826,330.60 1.30\n\n28 PROTO LABS INC PRLB 743713109 2,556,555 287,868,093.00 1.22\n\n29 FATE THERAPEUTICS INC FATE 31189P102 3,147,221 270,251,867.27 1.15\n\n30 PAGERDUTY INC PD 69553P100 6,209,725 267,142,369.50 1.14\n\n31 2U INC TWOU 90214J101 6,622,988 269,290,692.08 1.14\n\n32 TENCENT HOLDINGS LTD-UNS ADR TCEHY 88032Q109 3,251,447 263,692,351.70 1.12\n\n33 INTERCONTINENTAL EXCHANGE IN ICE 45866F104 2,038,673 239,911,038.64 1.02\n\n34 TWITTER INC TWTR 90184L102 3,672,637 239,051,942.33 1.02\n\n35 DRAFTKINGS INC - CL A DKNG 26142R104 3,922,283 225,374,381.18 0.96\n\n36 SYNOPSYS INC SNPS 871607107 880,867 222,427,726.17 0.95\n\n37 NOVARTIS AG-SPONSORED ADR NVS 66987V109 2,570,263 221,119,725.89 0.94\n\n38 TERADYNE INC TER 880770102 1,633,739 213,709,398.59 0.91\n\n39 LENDINGTREE INC TREE UW 52603B107 947,951 206,947,182.81 0.88\n\n40 EDITAS MEDICINE INC EDIT 28106W103 5,472,206 204,496,338.22 0.87\n\n41 PACIFIC BIOSCIENCES OF CALIF PACB 69404D108 5,966,741 199,766,488.68 0.85\n\n42 VERACYTE INC VCYT 92337F107 3,980,523 195,045,627.00 0.83\n\n43 NANOSTRING TECHNOLOGIES INC NSTG 63009R109 1,931,542 154,561,990.84 0.66\n\n44 MATERIALISE NV-ADR MTLS 57667T100 4,742,189 146,438,796.32 0.62\n\n45 SERES THERAPEUTICS INC MCRB 81750R102 6,608,680 139,971,842.40 0.59\n\n46 TUSIMPLE HOLDINGS INC - A TSP 90089L108 3,334,334 132,373,059.80 0.56\n\n47 STRATASYS LTD SSYS M85548101 5,323,624 121,910,989.60 0.52\n\n48 BERKELEY LIGHTS INC BLI 084310101 2,426,102 122,227,018.76 0.52\n\n49 TRIMBLE INC TRMB 896239100 1,440,750 120,533,145.00 0.51\n\n50 UIPATH INC - CLASS A PATH 90364P105 1,495,273 112,579,104.17 0.48\n\n51 REGENERON PHARMACEUTICALS REGN 75886F107 218,766 106,101,510.00 0.45\n\n52 HUYA INC-ADR HUYA 44852D108 5,656,170 102,885,732.30 0.44\n\n53 CERUS CORP CERS 157085101 15,673,427 93,727,093.46 0.40\n\n54 SKILLZ INC SKLZ 83067L109 5,196,642 93,175,791.06 0.40\n\n55 COMPUGEN LTD CGEN M25722105 8,245,978 71,987,387.94 0.31\n\n56 PACCAR INC PCAR 693718108 664,473 61,065,068.70 0.26\n\n57 DREYFUS GOVT CASH MAN INS X9USDDGCM 44,419,453 44,419,452.87 0.19\n\n58 SYROS PHARMACEUTICALS INC SYRS 87184Q107 4,157,189 25,940,859.36 0.11",
        "created_utc": 1619912073,
        "id": "gwlnmww",
        "score": -5,
        "subreddit": "investing",
        "created": 1619940873.0
    }
]