[
    {
        "author": "bridgeheadone",
        "body": "Paypal\n\nAdobe\n\nNvidia and Visa are pretty muck locks for 1t in five years with their growth\n\n\nSquare is my dark horse though, if Jack executes well and ties payments in to the lightning network look out.",
        "created_utc": 1628434978,
        "id": "h86c0af",
        "score": 139,
        "subreddit": "stocks",
        "created": 1628463778.0
    },
    {
        "author": "The_Folkhero",
        "body": "Love Salesforce. One of my biggest holdings. Founder led juggernaut. I call CRM along with Adobe and Intuit as the \"baby FAANGs\" in my portfolio.",
        "created_utc": 1630015910,
        "id": "hahc3od",
        "score": 25,
        "subreddit": "investing",
        "created": 1630044710.0
    },
    {
        "author": "sirdeionsandals",
        "body": "Obviously all the FAAMG companies are tanks and keep marching but some that I like are:\n\nWM, TMO, COST, ADBE, ADSK, BA, BRKB, UNH, DHR,HD",
        "created_utc": 1629743989,
        "id": "ha2bdca",
        "score": 18,
        "subreddit": "stocks",
        "created": 1629772789.0
    },
    {
        "author": "solscend",
        "body": "Adobe.",
        "created_utc": 1630185421,
        "id": "haq8x4w",
        "score": 13,
        "subreddit": "stocks",
        "created": 1630214221.0
    },
    {
        "author": "ThrowawayLegalNL",
        "body": "Their current path towards profitability seems to involve asking small content creators to pay thousands of dollars so they can host their content on there. That, combined with the absolute dominance of Youtube makes me think that they have absolutely no chance with regular consumers and content creators. \n\nI'm less knowledgeable about them using businesses as customers. Is there any reason why a business would choose to host their content on Vimeo rather than other platforms? I can see why businesses shell out big money for MS Office or Adobe Premiere licenses, as those programs are clearly number one, but what is the upside to Vimeo in this regard?",
        "created_utc": 1628590075,
        "id": "h8e6hit",
        "score": 8,
        "subreddit": "investing",
        "created": 1628618875.0
    },
    {
        "author": "InitializedVariable",
        "body": "As a SysAdmin, Adobe is not my favorite company to deal with. But man, they are going **nowhere**. They’re about as essential a productivity suite as Office365.",
        "created_utc": 1628728681,
        "id": "h8lqugc",
        "score": 6,
        "subreddit": "stocks",
        "created": 1628757481.0
    },
    {
        "author": "toko92",
        "body": "Adobe Illustrator",
        "created_utc": 1628441057,
        "id": "h86oukf",
        "score": 5,
        "subreddit": "SPACs",
        "created": 1628469857.0
    },
    {
        "author": "uninfinity",
        "body": " ***Nvidia (NVDA) announces expansion of its 'Omniverse' through new integrations with Blender (BLND) and Adobe (ADBE) that will give it access to more users***",
        "created_utc": 1628610243,
        "id": "h8f72ob",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1628639043.0
    },
    {
        "author": "WorkingCorrect1062",
        "body": "AMZN should gain some momentum today. \nMSFT, NVDA, ADBE keep ripping all time highs.",
        "created_utc": 1629793966,
        "id": "ha50p10",
        "score": 5,
        "subreddit": "wallstreetbets",
        "created": 1629822766.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "It's overpriced and adobe can take all their business.\n\nPass",
        "created_utc": 1630153182,
        "id": "haoad0s",
        "score": 5,
        "subreddit": "stocks",
        "created": 1630181982.0
    },
    {
        "author": "WorkingCorrect1062",
        "body": "And for TSLA, GOOG, ADBE, AMZN",
        "created_utc": 1630361804,
        "id": "hazfzbp",
        "score": 4,
        "subreddit": "wallstreetbets",
        "created": 1630390604.0
    },
    {
        "author": "silent_johnn",
        "body": "What does Adobe make? Or Facebook? Or any software as a service company? They literally do nothing but produce bytes. Are you actually arguing that Facebook has no intrinsic value?\n\n&gt;In fact, thousands of cryptocurrencies have dropped to zero\n\nI think you'd be surprised at the number of worthless stocks in your index fund, and ones that have disappeared over the years...\n\n&gt;Much like iPhones metal can be repurposed for other things. \n\nWhy couldn't the infrastructure of crypto be repurposed just as easily? I'm confused...",
        "created_utc": 1630199923,
        "id": "har2cza",
        "score": 4,
        "subreddit": "investing",
        "created": 1630228723.0
    },
    {
        "author": "LayfonGrendan",
        "body": "He basically taking a look at an old promotion before the zero commission fees pricing went in place. \n\nhttps://nbdb.ca/accounts/open-alt.html?adobe\\_mc\\_sdid=SDID%3D2102521D33AFF2BA-26729BDF0CC52C25%7CMCORGID%3D1E24776A524450D90A490D44%40AdobeOrg%7CTS%3D1630185223&amp;adobe\\_mc\\_ref=https%3A%2F%2Fnbdb.ca%2Fcontact-us.html",
        "created_utc": 1630188999,
        "id": "haqghnw",
        "score": 4,
        "subreddit": "CanadianInvestor",
        "created": 1630217799.0
    },
    {
        "author": "neothedreamer",
        "body": "OP it depends why the company isn't profitable yet, what their growth rate is, how dominant they are in their industry etc.\n\nYour statement is so broad I would just call it wrong.\n\nMost software companies aren't profitable for a while because they are spending money to build market base.  Cost of sale is what causes them to not be profitable.  The thing is the cost to retain those customer is very small so 2 to 3 years after they are acquired they are extremely profitable.  Once they hit critical mass those software companies make massive profits.\n\nGo look at Adobe from 2010 to now.  They switched from a boxed software model with Creative Suite to Creative Cloud which is a subscription model and acquired Omniture, Day, Market, Magento etc to build their Marketing cloud.  Went from $30s to over $630 now, profits went up 3x.\n\nAmazon earned more profit in 2018 than the previous 14 years.\n\nIs the risk higher in companies pre-profit, sure but lose all your money, naw.",
        "created_utc": 1628447601,
        "id": "h873351",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1628476401.0
    },
    {
        "author": "HotSarcasm",
        "body": "There could be several arguments against Teledoc specifically, but telemedicine is here to stay.  Regulations need to be sorted out and streamlined.  Nothing really stopping Apple, Zoom, Microsoft or even Adobe from entering this space.",
        "created_utc": 1629494437,
        "id": "h9pnzbs",
        "score": 3,
        "subreddit": "stocks",
        "created": 1629523237.0
    },
    {
        "author": "claytondpark",
        "body": "Eod msft, adbe, nflx and nvda selloff will take ndx down",
        "created_utc": 1629395185,
        "id": "h9k4p4t",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629423985.0
    },
    {
        "author": "WorkingCorrect1062",
        "body": "Big tech is just ripping higher highs. MSFT, GOOG, Nvidia, ADBE. Time for AMZN to catch up. 🚀",
        "created_utc": 1629389119,
        "id": "h9jpx8w",
        "score": 3,
        "subreddit": "wallstreetbets",
        "created": 1629417919.0
    },
    {
        "author": "HotSarcasm",
        "body": "YTD - AAPL up 9.5%, ADBE up 27%, AMD up 12%, GOOG up 55%, F up 43%, UBER down 24%.\n\nUnless you threw money into UBER in November 2020 or earlier, you're down overall.  What exactly about their business model said this was a wise investment?  Figure that out first.",
        "created_utc": 1629399056,
        "id": "h9kdy15",
        "score": 3,
        "subreddit": "stocks",
        "created": 1629427856.0
    },
    {
        "author": "HotSarcasm",
        "body": "Do not look at $, focus on %.\n\nYTD - AAPL up 9.5%, ADBE up 27%, AMD up 12%, GOOG up 55%, F up 43%.  Many indexes are \\~15% up YTD.\n\nPick your valuation, set your total investment &amp; per share price, place a limit GTC + EXT order and wait.  Patience is your friend.",
        "created_utc": 1629400882,
        "id": "h9kicfs",
        "score": 3,
        "subreddit": "stocks",
        "created": 1629429682.0
    },
    {
        "author": "HotSarcasm",
        "body": "Entry at $275-$300 if you want to be green.  Over $300 and it needs to be a long hold consideration.  They might need to adopt a renewed business strategy to maintain customers.  Their old Avid-style model isn't cutting it long term for a company with their market cap.  Likely need to be more like Adobe to justify stock price.",
        "created_utc": 1630001932,
        "id": "hagdzvq",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630030732.0
    },
    {
        "author": "TheRealSerialys",
        "body": "For me:\n- Apple\n- Microsoft\n- Deere\n- Adobe\n- Alphabet\n- Copart",
        "created_utc": 1630069830,
        "id": "hajvxyu",
        "score": 3,
        "subreddit": "ValueInvesting",
        "created": 1630098630.0
    },
    {
        "author": "Additional-Ferret616",
        "body": "My honest opinion is that you should only be playing the stock market with money that you COULD possibly lose. \n\nDon’t get me wrong, Microsoft, Adobe, and the ones you mentioned are trustworthy investments, but they could always take a turn (although I’m bullish on all of these). \n\nThe better question to ask is if you were to lose said investments, how far back is this going to put you from a life goal like buying a house? A year? 6 months? These are questions you need to weigh yourself. \n\nA possibly better/safer play would be to lock them into bank mutual funds, but obviously the return on these funds would be far less (assuming Microsoft et al. keep moving they have historically).",
        "created_utc": 1629565540,
        "id": "h9t3uge",
        "score": 3,
        "subreddit": "StockMarket",
        "created": 1629594340.0
    },
    {
        "author": "Test-Ing2K",
        "body": "Haha! User validation is always a good health check. It seems like early investments in understanding document management was really key for DOCU. \nMy only concern is the competitive landscape with Adobe etc. Maybe I should buy them both.",
        "created_utc": 1630140028,
        "id": "hantlco",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630168828.0
    },
    {
        "author": "Several_Tone1248",
        "body": "&gt; What happens to Adobe if they go under?\n\nThen my mutual fund would lose a percent or two, LOL. The most any of my mutual funds owns is about 10% of any one stock. They are diversified, and I own many different mutual funds, so a single company of any brand going to 0 has little impact on me.",
        "created_utc": 1629311728,
        "id": "h9fs75e",
        "score": 3,
        "subreddit": "investing",
        "created": 1629340528.0
    },
    {
        "author": "SpliTTMark",
        "body": "adobe is a teenager",
        "created_utc": 1630087797,
        "id": "hal3vkx",
        "score": 3,
        "subreddit": "investing",
        "created": 1630116597.0
    },
    {
        "author": "OmegaSeamaster300m",
        "body": "High growth potential a little riskier due to already high valuation\n\nETSY, CRM\n\n\nGrowth at a reasonable price\nTTWO\n\n\nGrowth at a reasonable price Stocks after a 10% pullback (still will likely beat market)\n\nAdbe, FAAMG, HD",
        "created_utc": 1630090627,
        "id": "halapsl",
        "score": 3,
        "subreddit": "stocks",
        "created": 1630119427.0
    },
    {
        "author": "Saajaadeen",
        "body": "Ahhh i got it well right now I just have stocks and they're listed below.\n\n&amp;#x200B;\n\n* $APPL\n* $MSFT\n* $GOOG\n* $GOOGL\n* $ORCL\n* $ADBE\n* $TSLA\n* $AMD",
        "created_utc": 1628186786,
        "id": "h7u3ty2",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1628215586.0
    },
    {
        "author": "ericgol7",
        "body": "I didn't even know Adobe had any competitors, so that's how far ahead they are.",
        "created_utc": 1627841198,
        "id": "h7c6pfq",
        "score": 2,
        "subreddit": "investing",
        "created": 1627869998.0
    },
    {
        "author": "PrognosticatorofLife",
        "body": "Adobe has little costs and lots of income. Its a steady riser through all of covid. Im planning to hold till 700 and reevaluate.",
        "created_utc": 1628723988,
        "id": "h8lgsrz",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628752788.0
    },
    {
        "author": "AmericanTickers",
        "body": "Most people have already said the 1st stocks that came to my mind but I have a few other considerations...\nABNB and ADBE",
        "created_utc": 1628482766,
        "id": "h890qp0",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628511566.0
    },
    {
        "author": "claytondpark",
        "body": "Yeah legit it's nvda, adbe, msft, nflx and a lil bit of apple and crm today otherwise all other major stocks are red or flat",
        "created_utc": 1629391049,
        "id": "h9jup7w",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629419849.0
    },
    {
        "author": "Expensive_Plankton52",
        "body": "Yeah, and the chicken is marinated in an Adobe sauce. \n\nI by no means can make it exactly the same but I can make it so close that I don't really care to spend 3 times as much to buy it from them.\n\nI haven't mastered their queso recipe yet so if anyone has please let me know lol😉",
        "created_utc": 1629810392,
        "id": "ha5o1ua",
        "score": 2,
        "subreddit": "StockMarket",
        "created": 1629839192.0
    },
    {
        "author": "CraftBeerDadBod",
        "body": "Apple, Adobe, Nvidia, Home Depot, Nike, Pepsi",
        "created_utc": 1629902660,
        "id": "haaqr7m",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629931460.0
    },
    {
        "author": "WorkingCorrect1062",
        "body": "CRM gonna print hard, nice beat! Green signal for ADBE too. 🚀",
        "created_utc": 1629923483,
        "id": "hac6n3u",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629952283.0
    },
    {
        "author": "rivercitygirl111",
        "body": "Apple \nMicrosoft initial investment 25,000 worth $150,000\nAdobe \nAlphabet \nAll purchased in 2016/17. Microsoft is my biggest holding. \nI have a friend who has 4-5 mil in Microsoft from stock options. But heavily weighted in one direction but it’s a toss up with capital gains. But in this case just living off dividends  works for that person. My brother is a Boeing buyer is heavily weighted there. Everything else he buys &amp; sells.",
        "created_utc": 1630075492,
        "id": "hak92tg",
        "score": 2,
        "subreddit": "ValueInvesting",
        "created": 1630104292.0
    },
    {
        "author": "GongTzu",
        "body": "I sold at 256 as I thought it will take more time outside of Covid to gain traction, I know people who really love the product, but looking at the very few companies that actually uses digital signature, I think it will take lots of time and money to turn profitable, but once there, they will have a setup like Adobe where clients simply can’t quit.",
        "created_utc": 1630158265,
        "id": "haojidl",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630187065.0
    },
    {
        "author": "emilstyle91",
        "body": "If the company is a blue chip like adobe or msft that basically keep going up yes.\nOtherwise very risky move.",
        "created_utc": 1628282481,
        "id": "h7z9el0",
        "score": 2,
        "subreddit": "investing",
        "created": 1628311281.0
    },
    {
        "author": "Remington_NA",
        "body": "My guess is mix of fear from FinTech and the rising popularity of buy now, pay later services which don't require a credit card as far as I am aware. American Express did add a plan it option to their credit cards. As well as consumer spending trending down this month.\n\n\"Buy Now, Pay Later: This payment method is seeing a boom, with 215 percent YoY growth in the first two months (Jan-Feb) of 2021. Consumers using this service are also placing orders that are 18 percent larger. Retailers are offering the buy now/pay later option more often, while consumers deal with financial uncertainty.\"\n\nSources: \n\n[https://blog.adobe.com/en/publish/2021/03/15/adobe-digital-economy-index-covid-19-report.html#gs.8qdrzx](https://blog.adobe.com/en/publish/2021/03/15/adobe-digital-economy-index-covid-19-report.html#gs.8qdrzx)\n\n[https://www.cardify.ai/covid-19-index/total-expenditure-covid-19-spend-index](https://www.cardify.ai/covid-19-index/total-expenditure-covid-19-spend-index)",
        "created_utc": 1628707660,
        "id": "h8ke7wo",
        "score": 2,
        "subreddit": "investing",
        "created": 1628736460.0
    },
    {
        "author": "lvrbeats",
        "body": "Not buying Shopify in 2015, Adobe when they started to use cloud subscriptions.",
        "created_utc": 1629225497,
        "id": "h9bh03p",
        "score": 2,
        "subreddit": "CanadianInvestor",
        "created": 1629254297.0
    },
    {
        "author": "NooshBagoosh",
        "body": "Great day for software. MSFT, ADBE, INTU, ADSK, DOCU. Who else is in this sector?",
        "created_utc": 1629397304,
        "id": "h9k9qxc",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629426104.0
    },
    {
        "author": "PerspectiveFew7772",
        "body": "Lol I hear ya I had the same issue last year when I started. That's why if I really want to sell something I wait the week, and I don't really buy anymore except for days like today. I picked up some target,  msft, and Adobe and I'm up on all 3.",
        "created_utc": 1629139526,
        "id": "h96vj0e",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629168326.0
    },
    {
        "author": "Nihaohonkie",
        "body": "Reading this thread is amusing.  Why is it so hard to understand people are buying this stock not because of the current fundamentals but of what they will be 5+ years from now pending their contracts produce constant revenue.  I think Adobe and it’s cloud service is a really fair comparison of where they were pre cloud and where they are now",
        "created_utc": 1629658955,
        "id": "h9xwysh",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629687755.0
    },
    {
        "author": "CrimsonPE",
        "body": "Adobe",
        "created_utc": 1629746618,
        "id": "ha2hqhi",
        "score": 2,
        "subreddit": "stocks",
        "created": 1629775418.0
    },
    {
        "author": "CathieWoodsStepChild",
        "body": "Oh man, you haven’t been paying attention. The only thing propping up the market right now is big tech like Apple, Microsoft, Google, Facebook, Adobe, etc. Most mid cap and small cap growth stocks have been getting beaten down all 2021.",
        "created_utc": 1630193686,
        "id": "haqq2ng",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630222486.0
    },
    {
        "author": "labormarket",
        "body": "It’s a 400 stock imo, but id rather buy in at 280-300.\n\nI look at zm as capturing a sliver of what firms pay for CRE and biz travel in 2019. \n\nAnd in that sense, it’s huge. \n\nAnd unlike docusign where I think Adobe can build a better product, I don’t think msft can vs zm even if they give that shit away for free.",
        "created_utc": 1630283961,
        "id": "havd6xv",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1630312761.0
    },
    {
        "author": "fredczar",
        "body": "Adobe and Unity takes up a substantial percentage of my portfolio as well.\n\nUnity personally I find would have plenty of room to run in the coming years. Being in the tech field myself, I find that AR/VR would be the next technology leap. The metaverse that zuck has been talking about will happen imo. We are currently really inefficient in our communication via technology.\n\nFor example, I am taking up a good 3 mins to write out this reply, even though it would have taken me 30 secs if I can simply transmit whatever I am saying vocally or directly from my brain. In decades to come, we will laugh at how we are using QWERTY keyboards to communicate to one another.",
        "created_utc": 1628427036,
        "id": "h85xcgs",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628455836.0
    },
    {
        "author": "motterpaul",
        "body": "They are raising the prices of Office subscriptions. Today seems to be favoring monthly fee stocks: MSFT, ADBE, NFLX",
        "created_utc": 1629398590,
        "id": "h9kctr4",
        "score": 2,
        "subreddit": "wallstreetbets",
        "created": 1629427390.0
    },
    {
        "author": "ueasyhoe",
        "body": "Adobe, but more than 5 years",
        "created_utc": 1628425273,
        "id": "h85uoyd",
        "score": 2,
        "subreddit": "stocks",
        "created": 1628454073.0
    },
    {
        "author": "sincitygames",
        "body": "I think unity is going to become like adobe or autodesk.  They will buy a shit ton of companies to juice the numbers cause their main product is a hot mess.  What that means for the stock I have no idea.\n\nFor example they just bought some remote desktop company.",
        "created_utc": 1629762846,
        "id": "ha3jrxa",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1629791646.0
    },
    {
        "author": "linkin06",
        "body": "maybe dumb question, but i saw an SEC filing for CCIV today for what looks like an update to the prospectus. it's like 300 pages long, so there was a change somewhere i guess? any easy way to see what's changed? i tried to compare changes with Adobe Acrobat and it crashed. is it something major they updated?",
        "created_utc": 1629853223,
        "id": "ha8hcst",
        "score": 2,
        "subreddit": "SPACs",
        "created": 1629882023.0
    },
    {
        "author": "tdawg_4ever",
        "body": "The big moat is after flash, no sane person wants to install Adobe on their computer lol",
        "created_utc": 1630163899,
        "id": "haovrj6",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630192699.0
    },
    {
        "author": "EverQrius",
        "body": "There are a number of competitors for Focusing.   The likes of Adobe and cheaper competitors like HelloSign.\n\nDocusign is the most well known in this space. They also power multiple vertical solutions as a whitelabel.\n\nPersonally, I see them as a niche player.",
        "created_utc": 1630160632,
        "id": "haoohk9",
        "score": 2,
        "subreddit": "stocks",
        "created": 1630189432.0
    },
    {
        "author": "lowrankcluster",
        "body": "Couple of flaws in your statement.\n\n&gt;75% of the market now is Android.\n\nDoesn't matter. *Profits* Apple make selling to 5% of the global smartphone market is more than what the rest of 75% make.\n\n\\&gt; The problem with closed platforms is they will eventually find themselves behind.\n\nAgain, not true. There are plenty of examples of widely used software that are not open sourced and easily outcompete the open source counterparts. Windows and Mac in Desktop/Laptop space. Office by Microsoft. Database products by AWS/Oracle. Content creation software by Adobe. Many more.\n\n\\&gt; it's Apple vs. the world.\n\nAnd Apple has won in *every single* field they have entered. Self-driving and VR are upcoming techs, but just because its Apple vs world doesn't mean Apple will be at a huge disadvantage. Indeed, it is the world that is at disadvantage when Apple enters a field.\n\n\\&gt; Apple also charges a fee to develop apps. It's free on Android.\n\nDespite iOS being less than 20% of market, more than 50% of revenue developers make are on iOS. Not sure what fee are you talking about, but the fact that iOS is still a priority for developers despite them having to pay a fee actually puts Android in bad light.\n\n\\&gt; iOS it is a massive pain\n\n99% of people on this planet just download from App Store directly, whether it is iOS or Android.\n\n\\&gt; The reality is they're losing margin on their phones\n\niPhones are the most profitable item at Apple, accounting for majority of their profits. If you think that they are committing a financial fraud by reporting $20B+ profits from iPhone sales instead of a loss, then I don't know what to say. This would be the biggest scam in the history of mankind.\n\n\\&gt; Also we are at peak phones now - I only see downward pressure on margins due to the competition\n\nActually, if you think that smartphone sales are at peak (which is incorrect), then Apple is even more likely to maintain sales (generally, people who buy cheap &lt;$400 Android are less likely to buy a phone when new one comes out when old one works just fine).\n\n\\&gt; I always felt their original PE ratio\n\nPE ratio is high for companies who have high growth potential. Microsoft has been doing not bad in cloud segment and cloud segment market is not even at 5% potential. Now obviously, *you* don't think Apple and Microsoft will grow in future, but others do; so naturally, you would say their PE ratio is high.\n\n\\&gt; This was true years ago. Not true anymore.\n\nBased on sales of phones with cost &gt;= $700, Apple dominates and they do that with iPhone 12 more than they did with any other iPhone apart from iPhone 6.",
        "created_utc": 1628042819,
        "id": "h7mnsmr",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628071619.0
    },
    {
        "author": "SetzerWithFixedDice",
        "body": "The one I talk about the most? ROKU. The one that naps half the day but slowly crawls to new ATH and no one gives a shit? ADBE.",
        "created_utc": 1628180866,
        "id": "h7tpcc0",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628209666.0
    },
    {
        "author": "Mortal1ty1337",
        "body": "Just goes to show how easy it is to move across CDM networks. That makes them very low quality and eventually commoditized businesses. Just like that a top 10 customer can walk out the door and go elsewhere . It means they have little differentiation or pricing power. None of them should be on more than 10x sales for that reason\n\nAs a counter example think about Microsoft, salesforce, Adobe etc. No way in a million years could a large company just drop them in a heartbeat. They are way too ingrained in companies operations.",
        "created_utc": 1628143479,
        "id": "h7rw4ke",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628172279.0
    },
    {
        "author": "GaiusJuliusCaesar7",
        "body": "In at $29.62. \n\nWas hoping to play earnings, but guess not. At least the price is relatively stable. It'll pop back to $30 and I can unload my bags. Also got NVDA and ADBE ticking away nicely.",
        "created_utc": 1627995782,
        "id": "h7jqs0s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628024582.0
    },
    {
        "author": "bloatedkat",
        "body": "Netflix is non-essential. Adobe is.",
        "created_utc": 1627849080,
        "id": "h7cn7vg",
        "score": 1,
        "subreddit": "investing",
        "created": 1627877880.0
    },
    {
        "author": "soapinthepeehole",
        "body": "They dominate the design market, but they do not have a legitimate CGI software.  That world is dominated by Maya,  Cinema 4D, 3DS Max… I’d argue that there are viable alternatives for editorial in Final Cut Pro and Avid, even if Premiere is out in front.  \n\nFor the things like Photoshop, After Effects, and much of the photography stuff though, this is the right answer.  There’s no serious competition for much of their product line. \n\nThat said, I’ve been using Creative Cloud products professionally since far before they went to  subscriptions… this is anecdotal and based on my experience and the things my peers and I have talked about over the years, but lots of people loathe their subscription model, hate the companies perceived laziness in terms of updates (I.e., relying on third parties to write scripts and plugins for expanded features), and would happily use another piece of software if one existed. \n\nSome Adobe products are so far out ahead that I don’t know that that’ll ever happen… but it’s not all roses I think.",
        "created_utc": 1627828287,
        "id": "h7bf20v",
        "score": 1,
        "subreddit": "investing",
        "created": 1627857087.0
    },
    {
        "author": "doggy_lovers",
        "body": "true but with more tam, more competiotrs, so your competing to take a piece of the pie in marketshare (TAM), adobe you get nearly all of the TAM",
        "created_utc": 1627906487,
        "id": "h7f5uyi",
        "score": 1,
        "subreddit": "investing",
        "created": 1627935287.0
    },
    {
        "author": "r2002",
        "body": "&gt; switch away form Adobe to a new software\n\nDoes Adobe even have real competitors?",
        "created_utc": 1627805799,
        "id": "h7ak7d5",
        "score": 1,
        "subreddit": "investing",
        "created": 1627834599.0
    },
    {
        "author": "burn_bridges",
        "body": "Thoughts on the VGT ETF?  Owns all (3) of those in addition to NVDA, AAPL, MSFT, ADBE, INTC, CRM, CSCO, etc...",
        "created_utc": 1628795686,
        "id": "h8ouwta",
        "score": 1,
        "subreddit": "investing",
        "created": 1628824486.0
    },
    {
        "author": "Personal-Hospital-52",
        "body": "ADOBE staying flat",
        "created_utc": 1628708622,
        "id": "h8kgl3c",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1628737422.0
    },
    {
        "author": "solscend",
        "body": "My favorite four are nvda adbe shop avgo (broadcom), super solid group",
        "created_utc": 1628444568,
        "id": "h86wjdh",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628473368.0
    },
    {
        "author": "moderndhaniya",
        "body": "Adobe from the pump and dump I think some insider trading is going on with this. \n\nVolume is almost same but sentiment is super down. \n\nThe information about this was mostly available in public domain.",
        "created_utc": 1629221841,
        "id": "h9bai8s",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629250641.0
    },
    {
        "author": "niftyifty",
        "body": "No, I make it sound like several companies are better poised to succeed in that environment. History is full of no/low moat companies getting undercut. \n\nMuch of today’s innovation is centered around removing the middle man as a function of cost reduction. I am making an assumption that the trend would continue because I see no purpose in reintroducing costs back in to the system. Amazon, Tesla, Netflix, Disney, Adobe, Opendoor, etc are all brands currently focused on removing the middleman and are quite successful as a result. You can dive even further to brands like Warby Parker and Harry’s, that have very quickly carved out market share in long established markets that typically have a high entry barrier all through cost reduction. \n\nMy opinion continues to go back to no moat. Uber has nothing valuable to keep someone from doing it better, easier, and for less. I used Tesla as an example because it already has everything in place it would need except inventory. Google/waymo would have a similar advantage over Uber although they seem less inclined to do something like that. \n\nSo to simplify Tesla can easily do what Uber would do, but Uber can not easily do what Tesla does. Who is better poised for success in the self driving taxi sector? Same goes for Google and the rest. Lyft and Uber have nothing in place to stop the competition.",
        "created_utc": 1629566338,
        "id": "h9t5mce",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629595138.0
    },
    {
        "author": "WorkingCorrect1062",
        "body": "Adobe is already on a monster run. They will crush the earnings too but it could be priced in ADBE too. That stock is fairly expensive.",
        "created_utc": 1630357018,
        "id": "haz4x3a",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630385818.0
    },
    {
        "author": "WorkingCorrect1062",
        "body": "Wtf AMZN, MSFT, ADBE lol",
        "created_utc": 1630357604,
        "id": "haz6brh",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630386404.0
    },
    {
        "author": "Olives4ever",
        "body": "ADBE at 666, pray for its soul🙏",
        "created_utc": 1630372307,
        "id": "hb02m6f",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630401107.0
    },
    {
        "author": "SirGasleak",
        "body": "Okay, but we're talking about a massive market here with basically two big players.  I'm completely pulling this out of my ass, but I wouldn't be surprised if DOCU and ADBE share 90% of the market.",
        "created_utc": 1630241451,
        "id": "haspshj",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630270251.0
    },
    {
        "author": "ProffesorSpitfire",
        "body": "Moat is a broad term, and can be different things for different industries and companies. But generally, it’s a structural competitive advantage.\n\nThe most used example is probably Coca-Cola. Their moat is their brand, which they spent 100 years building. Coke is virtually synonymous with Coca-Cola in many parts of the world. I live in Sweden, and when you order a coke at a restaurant here you’ll sometimes get the reply ”we have Pepsi, is that all right?”\n\nMicrosoft and Adobe are two other good examples of companies with wide moats imo. Their moats aren’t their brands but rather that they’ve been industry standards for decades. There are equally good products (or near enough) available that are cheaper, but everybody still uses Word, Excel, Outlook, Photoshop, InDesign and so on because that’s what their employees have all spent 15 years learning. Companies might be able to save money in the long term by going with a cheaper option, but that would require them to first pay to educate their employees in the new software, it could cause problems in the workplace before everyone grows accustomed to the new software, and so on.\n\nFacebook is another good example of a company with a good moat. Their moat is their platform and it’s network effects, i.e. the more people that join their platforms, the better the platform becomes for everybody else and the more valuable it becomes for them. Imagine that you discover a social network that is twice as good as Facebook in every regard and joined it as the first among your friends. Now you’ll try to get a friend to join it. You demonstrate its features, and the friend agrees that it’s better than Facebook. But you are his only friend on the platform, whereas he has 199 friends on Facebook already. Odds are, he’ll remain with Facebook even though he thinks the other network is better.\n\nOf course competitors try to cross these moats, but that’s the thing about moats; they’re difficult to cross! In the case of Coca-Cola, they have such a strong brand that basically no amount of marketing spending from Pepsi and others can threaten it. The only ones that could conceivably threaten Coca-Cola are Coca-Cola. In the case of Microsoft, the fact that they are dominant keeps them dominant. If only the didn’t dominate the market, competitors could conceivably challenge them for market leadership with their equally good products. But alas, everybody is used to Microsoft so they don’t want to learn new software even if it saves them a few bucks. And in the case of Facebook, in order to threaten it you first have to become as large as Facebook, and thus far Facebook have strategically acquired competitors with the capability to do that well before that point.",
        "created_utc": 1630240248,
        "id": "hasnrr3",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630269048.0
    },
    {
        "author": "NooshBagoosh",
        "body": "Nice AH gains for ADBE (+$8.30, 1.25%) on 165k volume. If this opens up like this tomorrow I'm gonna feel awfully good about holding these calls (could turn a $1k gain into $5k+).",
        "created_utc": 1630451025,
        "id": "hb4a33d",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630479825.0
    },
    {
        "author": "Shadybetz101",
        "body": "Nvidia, paypal,adobe, servicenow, globalpayments,microsoft, vmware,taiwan semi,amd, palantir, american lithium, wacky chemi, ericson,",
        "created_utc": 1630178708,
        "id": "hapu3pu",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630207508.0
    },
    {
        "author": "Test-Ing2K",
        "body": "Yeah the moat isn't strong enough here - Adobe's tech can do all of this too. But Adobe isn't cheaply priced either 😔",
        "created_utc": 1630146214,
        "id": "hao0jvl",
        "score": 1,
        "subreddit": "stocks",
        "created": 1630175014.0
    },
    {
        "author": "Shaun8030",
        "body": "Delta spike amount unvaccinated in US might be good for stay at home tech stocks like post March 2020 amzn , nflx , zoom , Etsy , shop ,Adbe , MSFT  cloud stocks",
        "created_utc": 1628126565,
        "id": "h7r1sqp",
        "score": 1,
        "subreddit": "CanadianInvestor",
        "created": 1628155365.0
    },
    {
        "author": "costadelsol312",
        "body": "Splunk SPLK. They are going through a financially messy transition from licensing model to recurring revenue subscription cloud model. The financials get messed up in the short term but will be much better once the transition is completed. Similar story previously with Adobe and Autodesk. Will take a couple of years to play out though.",
        "created_utc": 1628112892,
        "id": "h7q8e2t",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628141692.0
    },
    {
        "author": "valoremz",
        "body": "Thanks! So based on our Adobe, do you recommend selling right away or holding?",
        "created_utc": 1627951288,
        "id": "h7hv66c",
        "score": 1,
        "subreddit": "investing",
        "created": 1627980088.0
    },
    {
        "author": "neothedreamer",
        "body": "Depends on how bullish you are on your employer and how much you need the ESPP money.  Adobe capped it at $25k yearly which I believe was IRS rule.\n\nI wish I would have not sold all my stock but used some for down-payment on my home etc. House is up around $800k now, bought $490k.",
        "created_utc": 1627959063,
        "id": "h7ib5l5",
        "score": 1,
        "subreddit": "investing",
        "created": 1627987863.0
    },
    {
        "author": "vansterdam_city",
        "body": "Adobe has so much going for it on the core business model compared to Netflix, as you pointed out.\n\nThe thing you didn't mention is that Netflix has a much larger TAM. The amount of potential streaming TV viewers on Earth is much larger than the amount of digital artists. Adobe has a much shorter runway for continued userbase growth and this is one place where Adobe comes up short compared to Netflix.\n\nThis is what FAANG have in common, a TAM which includes nearly every person on Earth.",
        "created_utc": 1627890455,
        "id": "h7emiup",
        "score": 1,
        "subreddit": "investing",
        "created": 1627919255.0
    },
    {
        "author": "meatballsbonanza",
        "body": "You have a point. My evidence is anecdotal, but it’s a cirka 15 years of experience in the business and I’m fairly certain it’s true.\n\nMy gripe is not with Adobe as a whole, it’s the example you used. Most of my colleagues move between design software very often, some of them are Adobe. It’s a bit annoying, but they all share the same conventions and principles. Hotkeys are ofcourse super annoying to relearn. But the future of Adobe is not software for graphic or digital designers.\n\nIf all Adobe had was design software (Ps, Ai, XD, AE etc) then I’d say that company is in big trouble, but it’s not. They have other parts of the business that’s doing very good. And the cloud subscription keeps their design software profitable, despite the fact that if you said you primarily design in Photoshop at a job interview with Google, you’d get laughed out of the room.",
        "created_utc": 1627801401,
        "id": "h7af5ss",
        "score": 1,
        "subreddit": "investing",
        "created": 1627830201.0
    },
    {
        "author": "vrijheidsfrietje",
        "body": "And then someone is gonna jump in that vacuum Adobe just created with their SaaS monopoly.\n\nI deliberately chose to create the vids in my profile with Davinci Resolve so I wouldn't be stuck to the premiere pro subscription.\n\nSame why I'd rather use GIMP than Photoshop.\n\nFor companies it's different of course, but as an individual creator I avoid the fuck out of adobe nowadays.",
        "created_utc": 1627839564,
        "id": "h7c37uw",
        "score": 1,
        "subreddit": "investing",
        "created": 1627868364.0
    },
    {
        "author": "stippleworth",
        "body": "Google’s glasses were fine, but it was too early for the market and they didn’t have the ecosystem or developer support that any of big tech does.  A famous tech entrepreneur once said that “tech is not about getting your gadgets to work, it’s about having them at the right time.” They were doomed from the start.  The director of operations for that project is now the CEO for the company with the light engine in Microsoft’s Hololens 2.\n\nTim Cook has repeatedly said in keynote speeches that AR is the future and has been working on an AR headset for years, leaked to launch 2022 last year but could of course be delayed.  They are knocking down patents left and right on it though.  He has played his role perfectly, milking the smartphone to build the greatest warchest in history just in time to capture emerging technology as the market is ready for it.  AirPods make more revenue a year than nvidia and Adobe and most tech companies.  He knows what he is doing and is looking at the future.  They are a $2T company and have no trouble developing multiple verticals at once, especially when one of those verticals will replace or supplement their cash cow within 10 years.\n\nIt doesn’t sound like you’re highly tuned into Microsoft’s AR setup or commitment if you are comparing it to a watch.  It is without a doubt the most sophisticated and compelling AR device that exists in the world and comparing it to a watch from 2015 is low-brow.  Remember that the army is paying them $22B to outfit the military with AR and develop software for them.  Those headsets are already being deployed in combat zones.\n\nI’ve got a little over a million invested in the augmented reality space if you count my big tech investments and am very up to date with all of the inner workings.  You can disagree if you like but I’m telling you how it is in the current environment and who the serious players are.  You should research patent grants and who is aiming at what with what velocity.  I have money in Facebook too, but they are not even the only company dedicated to the concept of the metaverse, and Microsoft is doing the exact same thing with a head start.  They will likely coexist with different purposes.  As a last thought, you dog on Google and Microsoft for some wearables they’ve released in the past.  What successful wearable has Facebook ever released?\n\nP.s. I’ll be there in my spandex and cowboy hat, be ready",
        "created_utc": 1628044304,
        "id": "h7mqrsx",
        "score": 1,
        "subreddit": "investing",
        "created": 1628073104.0
    },
    {
        "author": "PM_UR_PLATONIC_SOLID",
        "body": "Yes, the low interest rates are supporting the stock market.\n\nNext, you need to learn that P/E ratios are great in theory but crappy in practice. P/E really tells you about the quality of earnings, not the value of the company. A company, like Tesla, with a high P/E means that the market values their FUTURE earning potential higher than say... GM or Ford. Using this logic, Adobe, with a P/E of 55, is more likely to have solid future earnings than a company like Microsoft with a 35 P/E. Or so the market thinks.\n\nIf you want to find value, look at Price to Book (P/B) or Book to Market (B/M; the inverse of P/B). Also, investigate CROIC or CROCI to see which companies are returning cash on their cash invested. That will help you find value.\n\nPeople use P/E like they use sticker prices on car. $100,000 for a car? Too expensive. I'm looking for a $30,000 model. That's stupid. What you want is the $100,000 car for $30,000! P/B will get you that. P/E won't.\n\nOnly retail investors use P/E. It's an easy way to talk about a stock but provides very little guidance in real life. Once you drop P/E, you'll see that there are a lot of undervalued but good companies out there. What this means, though, is that if you use P/E, you can end up with a lot of stocks in a particular sector... where P/E's tend to be low anyway. So you have increased your sector risk by having all stocks in the same sector, but the P/E's won't increase to the levels normal in other sectors. You aren't buying cheap, you are buying average that looks cheap when compared to other sectors (even though you didn't consciously realize that's what you did).\n\nI look at CROIC, Altman Z, Sortino, P/B, volume, expected return, and a few other things. Build a system you like that works. Then compare that system to the market to see how you are doing. If you make 10% but the market makes 15%, you would have been ahead to buy an S&amp;P Index fund. When you buy in a sector, compare your returns to the sector average too. If the sector earned 15%, but you made 10% on your pick, you chose a below-average stock and would have been ahead buying a sector index fund.\n\nComparing your returns to benchmarks lets you know how you are doing (once you start making money on a regular basis).",
        "created_utc": 1628194116,
        "id": "h7ulut3",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1628222916.0
    },
    {
        "author": "TheRealSerialys",
        "body": "My situation is similar to you. I only have stocks in 6 companies  and I doubt to add VTI or VOO... \n- Apple\n- Alphabet\n- Adobe\n- Microsoft \n- Nvidia\n- Paypal\n\nAny suggestions?",
        "created_utc": 1628970717,
        "id": "h8y4n90",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628999517.0
    },
    {
        "author": "TheWealthyNidus",
        "body": "Warren should buy tech company because some tech company are wonderful business like apple, Adobe and Google if warren see value he should invest in whatever it is Chinese stock or tech or textile business, wonderful business are wonderful business",
        "created_utc": 1628692445,
        "id": "h8je0k2",
        "score": 1,
        "subreddit": "ValueInvesting",
        "created": 1628721245.0
    },
    {
        "author": "silent_johnn",
        "body": "&gt; Crypto CAN go to 0\n\nWhat would cause people to not be able to propose new blocks for crypto? That's really what it would take to go to zero.\n\n&gt; where if home depot goes to 0 they liquidate stores, and mutual funds get paid since they are A stocks.\n\nLiquidations happen in crypto as well. What happens to Adobe if they go under? What do they liquidate? (or any SaaS company?)",
        "created_utc": 1629311565,
        "id": "h9fru5s",
        "score": 1,
        "subreddit": "investing",
        "created": 1629340365.0
    },
    {
        "author": "bonejohnson8",
        "body": "Do you have premiere? It's pretty easy now for them to auto transcribe the video for you and then you can modify the captions from there. All the adobe products are the same and worth learning imo, if you are a student or have an edu email you can get the whole suite free and it comes with good tutorials.",
        "created_utc": 1629334198,
        "id": "h9h533w",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1629362998.0
    },
    {
        "author": "JWOINK",
        "body": "At $10B, it makes a lot of sense to me. Many companies worth much less go public though SPACs. You should take a look at Reddit Inc’s blogpost on ads, showing the specific use cases Reddit could provide to advertisers. There’s a reason why they have many high profile ads on here (Adobe,Apple,Disney,etc.)",
        "created_utc": 1629190142,
        "id": "h99n4e2",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629218942.0
    },
    {
        "author": "LocustFunds",
        "body": "Large cap in the IWM? More like large cap holding up the SPY and QQQ due to the way they are weighted. Apple, Amazon, Facebook, Google, Microsoft, Tesla, Netflix, Adobe, PayPal, NVDA make up almost 30% of the S&amp;P 500 and 55% of the NASDAQ.\n\nIWM largest holdings are AMC, CROX https://www.zacks.com/funds/etf/IWM/holding",
        "created_utc": 1629972502,
        "id": "haen7dj",
        "score": 1,
        "subreddit": "options",
        "created": 1630001302.0
    },
    {
        "author": "chris2033",
        "body": "Adobe",
        "created_utc": 1629892356,
        "id": "haa577b",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629921156.0
    },
    {
        "author": "AnalbolicHazelnut",
        "body": "I really like the VGT pick. Let's have a look at the top 10 holdings of the fund that account for 57.4%.\n \n1 Apple 19.58%\n\n2 Microsoft 16.53%\n\n3 Nvidia 4.22%\n\n4 Visa 3.16%\n\n5 Mastercard 2.76%\n\n6 Paypal 2.76%\n\n7 Adobe 2.39%\n\n8 Intel 1.94%\n\n9 Salesforce 1.91%\n\n10 Cisco 1.90%\n\nThere is some hardware in there but most of the revenue on that list comes from software by subscription and that is with out a doubt the best business model of all time. It's almost cheating. Those are almost comming a part of the infastructure, with the margins that it brings when the company has matured. Those are all great companies to own.\n\nWith that beeing said, you are paying a premium for those companies right now. Now, ofcourse that is the case with most of the top holdings in any ETF, but big and mega cap tech are in my opinion due for a _mild_ correction that won't stay long. Or at the very least,  a slower climb moving forwards. \n\nIf this is a decent amount that you are going to be investing, I recommend that you start of with at least half in a lump sum and then periodecly re-invest the next 24 months. Or 12. Or at least 6. I think you should make the innitial more VTI heavy and aventually end it in the 70-30. \n\nOr don't. This might be overthinking it wich is not really in tune with your tech heavy bogglehead approuch. I would add in a little VOO but I still like your picks. In the end, it properbly doesn't matter.",
        "created_utc": 1629840481,
        "id": "ha7oucp",
        "score": 1,
        "subreddit": "stocks",
        "created": 1629869281.0
    },
    {
        "author": "CrimsonPE",
        "body": "Either Amd, Google, Adobe, msft, Apple or unity",
        "created_utc": 1629745687,
        "id": "ha2fhmk",
        "score": 1,
        "subreddit": "StockMarket",
        "created": 1629774487.0
    },
    {
        "author": "SmoothBrainSavant",
        "body": "Its ok adbe fucked me hard.. it just keep going wtf. Chart divergences be damned this stock give no fucks. Now i just hold the stocks, so that mean it will prob drop now.",
        "created_utc": 1630099695,
        "id": "halw7z8",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1630128495.0
    },
    {
        "author": "HotSarcasm",
        "body": "Not entirely true in my case.  Took advice to diversify outside of tech and didn't buy as much NVDA, AMD, AAPL, ADBE because the investment \"pool\" was spread thinner overall.",
        "created_utc": 1628087548,
        "id": "h7ojoeq",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628116348.0
    },
    {
        "author": "new_pr0spect",
        "body": "I mean my business needs adobe, if they doubled the cost I'd be pissed but wouldn't leave.. they definitely have pricing power lol.",
        "created_utc": 1627964893,
        "id": "h7ilj9p",
        "score": 1,
        "subreddit": "investing",
        "created": 1627993693.0
    },
    {
        "author": "neothedreamer",
        "body": "ALWAYS participate in ESPP. It is a free 15%. You either get 15% off a lock price or 15% off the current prices.\n\nThey include it in your W2 wages so you only have to pay on any appreciation after you purchase.\n\nTake 15% profit and pay taxes. Best scenario the stock goes way up and you come out ahead. I used to work for Adobe and I have friends that have NEVER sold their ESPP stock. They could pay off their house now.",
        "created_utc": 1627943723,
        "id": "h7hf84u",
        "score": 1,
        "subreddit": "investing",
        "created": 1627972523.0
    },
    {
        "author": "Smarty300",
        "body": "ADBE",
        "created_utc": 1627970683,
        "id": "h7iu3zo",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1627999483.0
    },
    {
        "author": "vansterdam_city",
        "body": "That is a blessing and a curse. My biggest issue with Adobe is that they are saturated in their TAM.\n\nThey have driven 10 years of growth mainly by moving to a cloud based sub model with their existing users and avoiding heavy piracy doing so.\n\nI think that transition is closer to complete than they talk about and I do wonder if that will kneecap Adobe growth going forward.",
        "created_utc": 1627916534,
        "id": "h7fp7uj",
        "score": 1,
        "subreddit": "investing",
        "created": 1627945334.0
    },
    {
        "author": "rioxofia",
        "body": "**Looking for feedback on my portolio! New to this.**\n\nAccount Value 37K  \n18.1% Down  \nStarted building portfolio in January 2021.  \nIAU 11.5%  \nFAN 10.9%  \nGOPAX 10.3%  \nTAN 8.72%  \nSHOP 8.1%  \nADBE 6.8%  \nTLRY 6.1%  \nCIBR 5.2%  \nMSOS 4.5%  \nBYND 4.2%  \nYOLO 3.2%  \nCVS 2.8%  \nENZL 2.5%  \nBRCN 2.1%  \nMNMD 2.1%  \nMKTY 2%  \nTTCF 1.8%  \nLSF 1.5%  \nFIW 1.2%  \nVRYYF 1.1%  \nAPPH .5%  \nI’m 28 years old and investing for long term. Im 18% down because I started when most of these stocks were at ATHs (esp MJ and energy), but I don’t think I should be concerned about that for the long run. I’ve tried to invest alongside my values (primarily considering company labor practices and environmental impact) and what I feel to be forward thinking investments.   \nWhat’s missing? What’s a mistake here? I’ve got about 30 years before retiring—I enjoy the stock market and am not all that interested in a super low risk portfolio, but am also looking for buy and hold investments so I’m not looking at this every day.   \nIve been lurking on this sub all year, this’ll be my first post. Grateful for any feedback!   \nBTW: A bunch of small positions in plant-based foods because I couldn’t find an ETF for it.",
        "created_utc": 1629184315,
        "id": "h99fzlw",
        "score": 1,
        "subreddit": "investing",
        "created": 1629213115.0
    },
    {
        "author": "adambrukirer",
        "body": "why have i seen adobe a few times in this thread. How are they growing?",
        "created_utc": 1628500324,
        "id": "h89me9r",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628529124.0
    },
    {
        "author": "sanitationsengineer",
        "body": "Use dataroma.com and clone. The most underrated investor I've seen is Chuck Akre if you're looking for long buy and holds. He rarely puts a foot wrong and has beaten the S &amp; P 500 in something like 28 of his 32 years of investing. And the times he didn't the margin was very small. His latest buy is Salesforce, so I'm going with that. And he's topping up Goosehead insurance so I'll be buying that. Last year he bought Adobe for what I thought was a high price of about $320 and its almost double in 18 Months. An absolute beast of an investor. And if the underlying business changes (ie poor management choices, growth opportunities dry up etc) he gets out. He doesn't have a price target or anything so you really are buying the business until the business is no good. I just clone him and have seen steady and solid returns.",
        "created_utc": 1628888370,
        "id": "h8txw3c",
        "score": 1,
        "subreddit": "stocks",
        "created": 1628917170.0
    }
]