[
    {
        "author": "Ironleg01",
        "body": "In other news\n\n* \\[...\\] This trend is increasingly dividing the country by racial lines. \n* Rapid technological change is causing \"technological unemployment,\" whereby a large portion of the population is left behind because they do not have the skills to participate in the growing sectors of the economy. This trend is furthering the country's class divide. \n* Trade wars and Brexit notwithstanding, the world is more interconnected than ever. Increasing globalization shifts the power from labor to capital since capital can flow much more easily across borders than can labor. \n* \"In my view, tragic events such as those discussed in this section will likely occur at a more frequent pace. Like the Ferguson and George Floyd unrests\"\n\nConclusion? Analysts see secular growth for Axon Enterprise (makes tazers) and  Motorola Solutions (makes surveilance and body cameras)... No crisis should go to waste as they say...",
        "created_utc": 1625142301,
        "id": "h3obcw2",
        "permalink": "/r/stocks/comments/obi5og/rstocks_daily_discussion_options_trading_thursday/h3obcw2/",
        "score": 3,
        "subreddit": "stocks",
        "created": 1625171101.0
    },
    {
        "author": "Pass_Little",
        "body": "You mean like Westinghouse, ITT, GE, Motorola, Kodak, Sears, and so on?\r  \n\r  \nIndividual stocks will have a larger standard deviation in their value.   Some will grow greatly, some will fail.   While it's true that 'blue chips' tend to be more stable, if you looked at a list of blue chip stocks from even the mid 80's you'd be surprised how few of them are still blue-chip stocks today.",
        "created_utc": 1625219882,
        "id": "h3sd519",
        "permalink": "/r/investing/comments/obnprd/what_are_your_best_12_line_counters_to_the_advice/h3sd519/",
        "score": 2,
        "subreddit": "investing",
        "created": 1625248682.0
    },
    {
        "author": "justanormalchat",
        "body": "INTC if anything is overvalued. The company is in a retreat on all fronts: losing data center designs to both AMD and custom SOCs, losing technological advancement in their fabs, not expanding meaningfully into new markets. Their 10 nm process is dead man walking. Think Motorola, IBM. The writing is on the wall.",
        "created_utc": 1625338718,
        "id": "h3y3r5l",
        "permalink": "/r/investing/comments/oac3ox/intel_corp_intc_is_undervalued/h3y3r5l/",
        "score": 1,
        "subreddit": "investing",
        "created": 1625367518.0
    },
    {
        "author": "thesetangiblethings",
        "body": "Why does my account show a huge gain if I can't exit my position?  \nIn early June I entered into an $MSI 190-strike Put expiring July 16. I paid 1.00 for the contract. I've been down ever since and had accepted my loss. The price of the option was steadily decreasing, .70, .50, and so on.  \nToday I checked and in my account shows a 100% gain for the same option. The ask is posted at $2.15. Obviously I put an order in trying to exit my position asap.  \nI know that just cause the ask is posted there, does not mean it's the \"real price\" until someone buys it, and the volume on the option is super low.  \nI'm waiting for my order to go through but I'm almost certain it won't. It makes no sense why I would see green in my account if I can't exit my position. I did search the internet to make sense of it but it seems too vague an issue for anyone to provide an answer for me.",
        "created_utc": 1625255044,
        "id": "h3ud9ai",
        "permalink": "/r/wallstreetbets/comments/oc6yol/daily_discussion_thread_for_july_02_2021/h3ud9ai/",
        "score": 1,
        "subreddit": "wallstreetbets",
        "created": 1625283844.0
    }
]